[
  {
    "title": "Mexican President Threatens to Sue Google Over 'Gulf of America' Label on Maps",
    "description": "The president of Mexico on Thursday expressed hope that Google \"reconsiders\" its decision to change its online maps to reflect U.S. President Donald Trump's claim that he has the authority to change the name of the Gulf of Mexico. Shortly after taking office,…",
    "link": "https://www.commondreams.org/news/google-earth-gulf-of-mexico",
    "timestamp": "2025-02-13T22:38:20Z"
  },
  {
    "title": "The price of eggs just hit an all-time high. Here’s how the cost of everyday consumer goods is changing under the Trump administration",
    "description": "While President Donald Trump has been in office less than a month, the costs of some consumer goods and services are trending up.\nAt nearly $5 a dozen, the price of eggs just surpassed record highs, and while quite moderate in comparison, bread, electricity, …",
    "link": "https://biztoc.com/x/4fbae40570a4f129",
    "timestamp": "2025-02-13T22:38:14Z"
  },
  {
    "title": "Donald Trump declares \"BRICS is dead,\" claims 100% tariff threat stopped Bloc’s dollar moves",
    "description": "Former US President Donald Trump has threatened a 100% tariff on all imports from BRICS nations if they launch a common currency. Dismissing BRICS' relevance, Trump emphasized the US's leverage over the bloc, warning against attempts to undermine the US dolla…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/donald-trump-declares-brics-is-dead-claims-100-tariff-threat-stopped-blocs-dollar-moves/articleshow/118226943.cms",
    "timestamp": "2025-02-13T22:37:55Z"
  },
  {
    "title": "Top Biden HHS Official Funneled Billions To Migrants Through Her Nonprofit Connections",
    "description": "A top official in Biden's administration HHS directed millions in migrant assistance grants to nonprofits where she previously held senior positions.",
    "link": "https://dailycaller.com/2025/02/13/robin-dunn-marcos-billions-migrant-aid-office-refugee-resettlement-health-human-services-funding/",
    "timestamp": "2025-02-13T22:37:42Z"
  },
  {
    "title": "Prosecutors quit after being ordered to end case against New York mayor",
    "description": "NEW YORK — The top federal prosecutor in Manhattan resigned Thursday after refusing a Justice Department order to drop corruption charges against New York City Mayor Eric Adams. Two senior Justice Department officials also quit after the department leadership…",
    "link": "https://www.voanews.com/a/prosecutors-quit-after-being-ordered-to-end-case-against-new-york-mayor/7974287.html",
    "timestamp": "2025-02-13T22:37:30Z"
  },
  {
    "title": "The key question for Democrats hoping to take down Trump",
    "description": "The Democrats trying to resist Elon Musk’s rampage across the federal government face a choice: How should they best alert the American people to the dangers he poses? Do they lean into a defense of the system — of checks and balances, democratic norms, and i…",
    "link": "https://www.vox.com/politics/399786/democrats-trump-resistance-democracy-norms-elon-musk-doge-division",
    "timestamp": "2025-02-13T22:37:24Z"
  },
  {
    "title": "U.S. stocks close higher after Trump signs memo on reciprocal tariffs",
    "description": "NEW YORK, Feb. 13 (Xinhua) -- U.S. stocks advanced on Thursday as investors reacted to U.S. President Donald Trump's announcement of planned reciprocal tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/14/us-stocks-close-higher-after-trump-signs-memo-on-reciprocal-tariffs",
    "timestamp": "2025-02-13T22:36:00Z"
  },
  {
    "title": "Sold-Out Show at Kennedy Center Canceled After Trump 'Infringement'",
    "description": "Award-winning actress, writer, director and media mogul Issa Rae is canceling her sold-out appearance at the John F. Kennedy Center for the Performing Arts over President Donald Trump's \"infringement\" on the institution's values.\nRae, who is widely known for …",
    "link": "https://biztoc.com/x/1f679f78fb983eb4",
    "timestamp": "2025-02-13T22:35:43Z"
  },
  {
    "title": "Trump hosts India's Modi, courting world's biggest 'swing state'",
    "description": "WASHINGTON -- U.S. President Donald Trump hosted Indian Prime Minister Narendra Modi for an official working visit on Thursday, a meeting that will likely signal the American leader's second-term approach to South Asia's dominant actor.\n\"They're going to be p…",
    "link": "https://biztoc.com/x/e731e153002978f1",
    "timestamp": "2025-02-13T22:35:16Z"
  },
  {
    "title": "BREAKING: Federal judge temporarily blocks Trump ban on transgender surgeries for minors",
    "description": "null / Credit: Brian A Jackson/Shutterstock\n\nWashington, D.C. Newsroom, Feb 13, 2025 / 17:35 pm (CNA).\nA federal judge has temporarily blocked President Donald Trump’s executive order barring transgender medical surgeries and interventions for individuals und…",
    "link": "https://www.catholicnewsagency.com/news/262209/breaking-federal-judge-temporarily-blocks-trump-ban-on-transgender-surgeries-for-minors",
    "timestamp": "2025-02-13T22:35:00Z"
  },
  {
    "title": "What rights do immigrants have at Guantánamo’s legal black hole?",
    "description": "Immigration advocates sued the Trump administration on Wednesday in order to learn more about and communicate with detainees sent from the US to the tightly controlled American naval base in Guantánamo Bay, Cuba. Their lawsuit may shed light on both Trump’s s…",
    "link": "https://www.vox.com/politics/399772/guantanamo-immigration-trump-court-legal",
    "timestamp": "2025-02-13T22:34:37Z"
  },
  {
    "title": "X to pay $10 million to settle Trump lawsuit over his post-Jan. 6 account suspension",
    "description": "Elon Musk's X has agreed to pay $10 million to settle a lawsuit from President Donald Trump over his account suspension after the Jan. 6 attack on the Capitol.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-twitter-x-lawsuit-jan-6-settlement-rcna192090",
    "timestamp": "2025-02-13T22:34:21Z"
  },
  {
    "title": "\"BRICS Is Dead, Will Impose 100% Tariff If Dollar Replaced\", Warns Trump",
    "description": "US President Donald said that BRICS is dead and reiterated his threat to BRICS nations, saying he would impose a 100 per cent tariff on the bloc if they try to replace the US dollar with any other currency.",
    "link": "https://www.ndtv.com/world-news/brics-is-dead-will-impose-100-tariff-if-dollar-replaced-warns-donald-trump-7705864",
    "timestamp": "2025-02-13T22:33:55Z"
  },
  {
    "title": "Texas measles outbreak hits at least 22 children, two adults | Honolulu Star-Advertiser",
    "description": "At least 24 cases of measles have been reported in an outbreak in Gaines County, Texas, state officials said, warning that more cases of the highly contagious disease were likely to surface.",
    "link": "https://www.staradvertiser.com/2025/02/13/breaking-news/texas-measles-outbreak-hits-at-least-22-children-two-adults/",
    "timestamp": "2025-02-13T22:32:19Z"
  },
  {
    "title": "Civil society groups urge Meta’s Oversight Board to resign in protest",
    "description": "Meta’s Oversight Board is coming under new pressure to respond to the company’s recent policy changes on fact-checking and moderation, which were made without input from the advisory group. A coalition of civil society organizations has published an open lett…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176234021",
    "timestamp": "2025-02-13T22:32:07Z"
  },
  {
    "title": "US President Donald Trump hugs PM Modi while welcoming him at White House",
    "description": "US President Donald Trump welcomed Prime Minister Narendra Modi to the White House for discussions and meetings with key US officials and entrepreneurs. Modi's visit included prior bilateral engagements with US Vice President JD Vance, National Security Advis…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-president-donald-trump-hugs-pm-modi-while-welcoming-him-at-white-house/articleshow/118227072.cms",
    "timestamp": "2025-02-13T22:31:41Z"
  },
  {
    "title": "Trump Announces ‘Fair and Reciprocal’ Tariff Plan",
    "description": "\"No more, no less. In other words, they charge us a tax or tariff, and we charge them the exact same tax or tariff. Very simple.\"\nThe post Trump Announces ‘Fair and Reciprocal’ Tariff Plan first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/trump-announces-fair-and-reciprocal-tariff-plan/",
    "timestamp": "2025-02-13T22:30:59Z"
  },
  {
    "title": "Bristling at ‘Gulf of Mexico’ name change on maps, Mexico says it might sue Google",
    "description": "MEXICO CITY (AP) — Mexican President Claudia Sheinbaum said Thursday that her government wouldn’t rule out filing a civil lawsuit against Google if it maintains its stance of calling the stretch of sea between northeastern Mexico and the southeastern United S…",
    "link": "https://financialpost.com/pmn/bristling-at-gulf-of-mexico-name-change-on-maps-mexico-says-it-might-sue-google",
    "timestamp": "2025-02-13T22:30:58Z"
  },
  {
    "title": "Trump Appears Set To Reward Russia For Its Brutal Invasion Of Ukraine",
    "description": "The president, who called the invasion “genius,” suggests Russia deserves Ukrainian territory because it has lost many soldiers in its assault.",
    "link": "https://www.huffpost.com/entry/trump-ukraine-hegseth-putin_n_67ae6717e4b035ea23a4bd53",
    "timestamp": "2025-02-13T22:30:47Z"
  },
  {
    "title": "Trump took over the Kennedy Center. And then placed his allies on the board.",
    "description": "Trump ousted the chairman of the esteemed institution, named himself the new leader, and then put a bunch of loyalists — including second lady Usha Vance and singer Lee Greenwood — on the board.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/trump-kennedy-center-board-chairman-usha-vance-rcna192101",
    "timestamp": "2025-02-13T22:30:40Z"
  },
  {
    "title": "State Department halts plan to buy $400M worth of armored vehicles from Musk's Tesla",
    "description": "The State Department had been in talks with Elon Musk’s Tesla company to buy armored electric vehicles, but the plans have been put on hold by the Trump administration after reports emerged about a potential $400 million purchase",
    "link": "https://abcnews.go.com/Business/wireStory/state-department-halts-plan-buy-400m-worth-armored-118802417",
    "timestamp": "2025-02-13T22:30:25Z"
  },
  {
    "title": "GameStop Stock Price Pumps After Report of Bitcoin Buying Plans",
    "description": "Video game retailer GameStop saw a sizable after-hours stock jump following a report that it's looking to invest in Bitcoin and other coins.",
    "link": "https://decrypt.co/305876/gamestop-stock-pumps-bitcoin-buying-report",
    "timestamp": "2025-02-13T22:30:16Z"
  },
  {
    "title": "The Daily Signal Names Elizabeth Mitchell as White House Correspondent",
    "description": "The Daily Signal announced Thursday the appointment of Elizabeth Mitchell as its White House correspondent. Mitchell, who joined The Daily Signal in June 2024, will... Read More\nThe post The Daily Signal Names Elizabeth Mitchell as White House Correspondent a…",
    "link": "https://www.dailysignal.com/2025/02/13/the-daily-signal-names-elizabeth-mitchell-as-white-house-correspondent/",
    "timestamp": "2025-02-13T22:30:00Z"
  },
  {
    "title": "US President Donald Trump Hugs PM Modi While Welcoming Him At White House",
    "description": "US President Donald Trump welcomed Prime Minister Narendra Modi at the West Wing lobby in the White House in Washington, DC on Thursday (local time). The two leaders shared a warm hug as they greeted each other.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-hugs-pm-narendra-modi-while-welcoming-him-at-white-house-7705827",
    "timestamp": "2025-02-13T22:29:08Z"
  },
  {
    "title": "Bank: Trump policies rev up export gains",
    "description": "<p>Thai export growth this year should accelerate because of the policies implemented by US President Donald Trump, according to the chief of the Export-Import Bank of Thailand (Exim Bank).</p>",
    "link": "https://www.bangkokpost.com/business/general/2960836/bank-trump-policies-rev-up-export-gains",
    "timestamp": "2025-02-13T22:29:00Z"
  },
  {
    "title": "Linda McMahon Wants to Keep Student Loan Forgiveness Program—Who's Impacted",
    "description": "During Linda McMahon's confirmation hearing for education secretary, she said she will uphold the loan program.",
    "link": "https://www.newsweek.com/linda-mcmahon-wants-keep-student-loan-forgiveness-programwhos-impacted-2030875",
    "timestamp": "2025-02-13T22:28:23Z"
  },
  {
    "title": "Sold-Out Show at Kennedy Center Canceled After Trump 'Infringement'",
    "description": "As the cultural community reels over Trump's takeover of the institution, an upcoming show at the venue was canceled on Thursday.",
    "link": "https://www.newsweek.com/sold-out-show-kennedy-center-canceled-after-trump-infringement-2030890",
    "timestamp": "2025-02-13T22:27:18Z"
  },
  {
    "title": "Israeli parliament leader praises Trump’s Gaza Strip plan as ‘fresh perspective’",
    "description": "The Oct. 7, 2023, attacks marked the end of the two-state solution, Israel's Knesset Speaker Amir Ohana told visiting European Parliament President Roberta Metsola in Jerusalem on Thursday.",
    "link": "https://nypost.com/2025/02/13/world-news/israeli-parliament-leader-praises-trumps-gaza-strip-plan-as-fresh-perspective/",
    "timestamp": "2025-02-13T22:26:13Z"
  },
  {
    "title": "Gov. Josh Shapiro sues Trump administration over federal funding freeze, alleging Pennsylvania hasn't received $2 billion (Gillian McGoldrick/The Philadelphia ...)",
    "description": "Gillian McGoldrick / The Philadelphia Inquirer:\nGov. Josh Shapiro sues Trump administration over federal funding freeze, alleging Pennsylvania hasn't received $2 billion  —  HARRISBURG — Gov. Josh Shapiro took the rare step Thursday of suing President Donald …",
    "link": "https://www.memeorandum.com/250213/p140",
    "timestamp": "2025-02-13T22:25:01Z"
  },
  {
    "title": "Radical Left-Wing Activist Org Sunsetting Grant Program Biden EPA Wanted To Fund To Tune Of $50 Million",
    "description": "Climate Justice Alliance (CJA), a radical left-wing activist group, is closing down a grantmaking program that the Biden administration sought to seed with $50 million in taxpayer cash, the Daily Caller News Foundation has confirmed. CJA is sunsetting the “en…",
    "link": "https://freerepublic.com/focus/f-news/4297445/posts",
    "timestamp": "2025-02-13T22:25:00Z"
  },
  {
    "title": "Google Maps is not interested in your Gulf of America complaints",
    "description": "Google has admitted it is taking down negative reviews and turned off reporting related to the Gulf of Mexico's name change.",
    "link": "https://www.androidauthority.com/google-maps-gulf-of-america-review-removal-3526126/",
    "timestamp": "2025-02-13T22:24:30Z"
  },
  {
    "title": "Trump says 'wonderful' trade deals coming for India, US",
    "description": "United States President Donald Trump said during a joint press conference with Indian Prime Minister Narendra Modi that \"we're going to make some wonderful trade deals for India and the US.&q...",
    "link": "https://biztoc.com/x/123c0202628edcc4",
    "timestamp": "2025-02-13T22:23:21Z"
  },
  {
    "title": "Trump’s Blanket Tariff Plan Praised by Rust Belt Lawmakers",
    "description": "President Donald Trump signed a memorandum on “reciprocal trade and tariffs” in the Oval Office Thursday, calling on his Cabinet members to draw up a... Read More\nThe post Trump’s Blanket Tariff Plan Praised by Rust Belt Lawmakers appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/02/13/trumps-blanket-tariff-plan-praised-rust-belt-congressmen/",
    "timestamp": "2025-02-13T22:21:27Z"
  },
  {
    "title": "State Department halts plan to buy $400M worth of armored vehicles from Musk's Tesla",
    "description": "The State Department had been in talks with Elon Musk’s Tesla company to buy armored electric vehicles, but the plans have been put on hold by the Trump administration after reports emerged about a potential $400 million purchase. A State Department spokesper…",
    "link": "https://www.seattlepi.com/news/politics/article/state-department-halts-plan-to-buy-400m-worth-of-20166270.php",
    "timestamp": "2025-02-13T22:20:31Z"
  },
  {
    "title": "From booing to singing, crowds keep drowning out anthems at Canadian sporting events",
    "description": "After weeks of Canadian fans booing the American national anthem at sporting events, a new issue has emerged: singing O Canada too loudly.",
    "link": "https://www.cbc.ca/news/entertainment/drowning-out-anthems-1.7458441",
    "timestamp": "2025-02-13T22:20:23Z"
  },
  {
    "title": "Trump Targets Canada’s Digital Service Tax in New Trade Plan",
    "description": "U.S. President Donald Trump has unveiled a new trade policy, dubbed the ‘Fair and Reciprocal Plan,’ aimed at countering what he calls unfair international trade practices. Part of the plan, announced today, February 13, takes specific aim at Canada’s Digital …",
    "link": "https://www.iphoneincanada.ca/2025/02/13/trump-targets-canadas-digital-service-tax-in-new-trade-plan/",
    "timestamp": "2025-02-13T22:19:50Z"
  },
  {
    "title": "Trump wants denuclearization talks with Russia and China, hopes for defense spending cuts",
    "description": "WASHINGTON — President Donald Trump said Thursday that he wants to restart nuclear arms control talks with Russia and China and that eventually he hopes all three countries could agree to cut their massive defense budgets in half.\n\n\nSpeaking to reporters in t…",
    "link": "https://www.voanews.com/a/trump-wants-denuclearization-talks-with-russia-china-hopes-for-defense-spending-cuts/7974285.html",
    "timestamp": "2025-02-13T22:19:45Z"
  },
  {
    "title": "Trump Is 'Perfect Dealmaker' to Handle Putin and Zelenskiy: Hegseth",
    "description": "NATO members in Europe should bear more of the costs of collective defense, US Defense Secretary Pete Hegseth said Thursday, echoing President Donald Trump’s call for allies to spend 5% of their GDP on defense while sidestepping suggestions that the US should…",
    "link": "https://biztoc.com/x/7ba3f190d53391cb",
    "timestamp": "2025-02-13T22:19:13Z"
  },
  {
    "title": "Conservative strategists say Trump comparisons no reason for Poilievre to change gears",
    "description": "Conservative Leader Pierre Poilievre's pledge to boost Arctic security through a \"massive\" cut to Canada's foreign aid budget has led to renewed attacks from his political opponents, who are accusing him of borrowing policy from U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/politics/poilievre-foreign-aid-1.7458797",
    "timestamp": "2025-02-13T22:19:01Z"
  },
  {
    "title": "Actress Issa Rae Cancels Live Show at Kennedy Center in Protest of Trump",
    "description": "HBO's \"Insecure\" star Issa Rae has cancelled her sold-out live show at the Kennedy Center in protest of President Donald Trump's leadership of the federally funded cultural institution.\nThe post Actress Issa Rae Cancels Live Show at Kennedy Center in Protest …",
    "link": "https://www.breitbart.com/entertainment/2025/02/13/actress-issa-rae-cancels-live-show-at-kennedy-center-in-protest-of-trump/",
    "timestamp": "2025-02-13T22:18:45Z"
  },
  {
    "title": "VOA Spanish: Migrants on Mexico-US border to return to their countries",
    "description": "Some of the migrants stranded on Mexico's northern border have decided to return to their countries, given the border restrictions adopted by U.S. President Donald Trump.\n\n\nClick here for the full story in Spanish.",
    "link": "https://www.voanews.com/a/voa-spanish-migrants-on-mexico-us-border-to-return-to-their-countries/7974277.html",
    "timestamp": "2025-02-13T22:18:10Z"
  },
  {
    "title": "B.C. cancels $1,000 grocery rebate and pauses hiring over Trump's tariff threats",
    "description": "Finance Minister Brenda Bailey says the impacts of the \"reckless\" and \"destabilizing\" tariffs are impossible to predict.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/bc-cancels-grocery-rebate-pauses-hiring-1.7458799",
    "timestamp": "2025-02-13T22:18:01Z"
  },
  {
    "title": "Trump launches plan to target countries with new tariffs",
    "description": "Trump launches plan to target countries with new tariffs\nUS President Donald Trump is sharpening plans to hit exports from countries that he says have trade policies that are unfair to the US.\nOn Thursday, Trump signed a memo that instructed staff to develop …",
    "link": "https://biztoc.com/x/3e8bf181b08bf7f6",
    "timestamp": "2025-02-13T22:17:14Z"
  },
  {
    "title": "Confused Senator Rages That Self-Driving Cars Are Woke",
    "description": "Senator Ted Cruz (R-TX) believes that teaching children about the solar eclipse is \"neo-Marxist class warfare propaganda.\" According to a database he released this week, just over $2 billion of the National Science Foundation's $9 billion budget went to \"left…",
    "link": "https://futurism.com/senator-ted-cruz-self-driving-cars-woke",
    "timestamp": "2025-02-13T22:16:36Z"
  },
  {
    "title": "DOGE software approval alarms Labor Department employees",
    "description": "Elon Musk’s DOGE received approval from the Department of Labor to use software that could allow it to transfer vast amounts of data.",
    "link": "https://www.nbcnews.com/tech/security/doge-software-approval-alarms-labor-department-employees-data-security-rcna191583",
    "timestamp": "2025-02-13T22:16:32Z"
  },
  {
    "title": "VOA Creole: Congressman asks Trump to renew TPS for Haitians",
    "description": "Republican Congressman Mike Lawler of New York told VOA in an exclusive interview that he will ask President Donald Trump to renew Temporary Protected Status for Haitians. TPS will expire for current holders in February 2026. Lawler told VOA that gang violenc…",
    "link": "https://www.voanews.com/a/voa-creole-congressman-asks-trump-to-renew-tps-for-haitians/7974259.html",
    "timestamp": "2025-02-13T22:14:55Z"
  },
  {
    "title": "5 Key Takeaways From McMahon’s Hearing for Ed Secretary",
    "description": "5 Key Takeaways From McMahon’s Hearing for Ed Secretary\n\n \n\n\n \njessica.blake@…\n\nThu, 02/13/2025 - 05:14 PM\n\nIn the nearly three-hour hearing, Linda McMahon committed to the Trump agenda but provided little detail as far as how she’d execute it.\n \n Byline(s)\n …",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/02/13/mcmahon-confirms-trumps-plans-dismantle-department-ed",
    "timestamp": "2025-02-13T22:14:53Z"
  },
  {
    "title": "MAGA DEI: Covid Conspiracist RFK Jr. Confirmed As Department Of Health And Human Services Despite Lack Of Medical Knowledge",
    "description": "Welp, it happened. Robert F. Kennedy Jr. has been confirmed to lead the Department of Health and Human Services.   That’s right, the highest-ranking health department in the nation is being run by a COVID conspiracy theorist who dabbles in medical racism, thi…",
    "link": "http://bossip.com/2777600/rfk-departement-of-health-and-human-services/",
    "timestamp": "2025-02-13T22:14:47Z"
  },
  {
    "title": "VOA Russian: Expert says Trump needs ‘carrot and stick’ with Putin",
    "description": "As U.S. President Donald Trump announced talks to end Russia’s war with Ukraine, Eurasia Group President Ian Bremmer in an exclusive interview with VOA Russian describes how Trump will need to use a carrot and a stick to persuade Vladimir Putin to agree to a …",
    "link": "https://www.voanews.com/a/voa-russian-expert-says-trump-needs-carrot-and-stick-with-putin/7974250.html",
    "timestamp": "2025-02-13T22:14:04Z"
  },
  {
    "title": "Modi glad that Trump's 'taken initiative' to restore peace in Ukraine",
    "description": "Indian Prime Minister Narendra Modi said during a joint press conference with United States President Donald Trump that he is glad that Trump has \"taken initiative\" to restore peace in Ukrai...",
    "link": "https://biztoc.com/x/b2576ed9ae0f3f7a",
    "timestamp": "2025-02-13T22:13:21Z"
  },
  {
    "title": "Trump’s latest tariff salvo is all bark and no bite – for now",
    "description": "To hear President Donald Trump tell it, Thursday’s new tariffs announcement was a significant and sweeping order that will bring the world to heel. But the plan, as it were, consisted of a vaguely worded memo that offered few concrete details and no real time…",
    "link": "https://biztoc.com/x/53874e77b888fa6b",
    "timestamp": "2025-02-13T22:13:03Z"
  },
  {
    "title": "How major US stock indexes fared Thursday, 2/13/2025",
    "description": "U.S. stocks rallied to the brink of a record after more companies reported fatter profits than expected. The S&P 500 rose 1% Thursday. It got within 0.1% of its all-time high as Wall Street yawned at the latest announcement on tariffs by President Donald Trum…",
    "link": "https://www.seattlepi.com/business/article/how-major-us-stock-indexes-fared-thursday-20166257.php",
    "timestamp": "2025-02-13T22:11:01Z"
  },
  {
    "title": "Trump planning more tariffs against any country with its own tariffs on U.S. goods",
    "description": "U.S. President Donald Trump on Thursday asked his staff to come up with a plan to slap what’s known as reciprocal tariffs on every country, ally or otherwise, that puts tariffs on American imports.",
    "link": "https://www.cbc.ca/news/politics/trump-reciprocal-tariffs-canada-1.7458775",
    "timestamp": "2025-02-13T22:10:55Z"
  },
  {
    "title": "Federal judge temporarily blocks Trump order restricting trans care for youths (NBC News)",
    "description": "NBC News:\nFederal judge temporarily blocks Trump order restricting trans care for youths  —  President Donald Trump signed a sweeping executive order last month that sought to further restrict access to gender-affirming medical care for those younger than 19.…",
    "link": "https://www.memeorandum.com/250213/p133",
    "timestamp": "2025-02-13T22:10:01Z"
  },
  {
    "title": "Bristling at ‘Gulf of Mexico’ name change on maps, Mexico says it might sue Google",
    "description": "It was not immediately clear where such a suit would be filed.",
    "link": "https://www.bostonherald.com/2025/02/13/gulf-of-mexico-google-civil-suit/",
    "timestamp": "2025-02-13T22:09:11Z"
  },
  {
    "title": "Trump Trashes McConnell Over RFK Vote, Questions His Childhood Polio",
    "description": "\"I have no idea if he had polio,\" Trump said of the former Senate majority leader.",
    "link": "https://www.huffpost.com/entry/trump-mcconnell-doubts-polio_n_67ae61a1e4b0a9618d73ab54",
    "timestamp": "2025-02-13T22:08:31Z"
  },
  {
    "title": "Trump Suggests Musk Met India's Prime Minister in Washington Because 'He Wants to Do Business in India'",
    "description": "The president initially claimed he wasn't sure why Musk met with the prime minister before assuming it must be business-related.",
    "link": "https://www.ibtimes.com/trump-suggests-musk-met-indias-prime-minister-washington-because-he-wants-do-business-india-3763655",
    "timestamp": "2025-02-13T22:07:56Z"
  },
  {
    "title": "'Wild document': Trump DOJ official blasted on MSNBC over 'unhinged' letter",
    "description": "Former Assistant U.S. Attorney Mimi Rocha, former top Justice Department prosecutor Andrew Weissmann and two hosts of MSNBC sounded the alarm about a new letter from the acting U.S. deputy attorney general, which they called \"unhinged.\" Acting Manhattan U.S. …",
    "link": "https://www.rawstory.com/trump-justice-department-2671153736/",
    "timestamp": "2025-02-13T22:07:23Z"
  },
  {
    "title": "Trump Announces Reciprocal Tariff Plan: What Countries Charge Us, 'We Will Charge Them'",
    "description": "President Donald Trump signed a memorandum Thursday announcing that he would introduce a plan to impose reciprocal tariffs on all countries that tariff U.S. exports.\nThe post Trump Announces Reciprocal Tariff Plan: What Countries Charge Us, ‘We Will Charge Th…",
    "link": "https://www.breitbart.com/politics/2025/02/13/trump-announces-reciprocal-tariff-plan-what-countries-charge-us-we-will-charge-them/",
    "timestamp": "2025-02-13T22:07:20Z"
  },
  {
    "title": "WATCH: Trump gives remarks after signing plan for reciprocal tariffs on trade partners",
    "description": "President Donald Trump on Thursday rolled out his plan to increase U.S. tariffs to match the tax rates that other countries charge on imports, possibly triggering a broader economic confrontation with allies and rivals alike as he hopes to eliminate any trade…",
    "link": "https://biztoc.com/x/eb3cc340aed88b68",
    "timestamp": "2025-02-13T22:07:15Z"
  },
  {
    "title": "Bristling at 'Gulf of Mexico' name change on maps, Mexico says it might sue Google",
    "description": "Mexican President Claudia Sheinbaum says her government is not ruling out filing a civil lawsuit against Google if it maintains its stance of calling the stretch of sea between northeastern Mexico and the southeastern United States the “Gulf of America.”",
    "link": "https://abcnews.go.com/Technology/wireStory/bristling-gulf-mexico-change-maps-mexico-sue-google-118802425",
    "timestamp": "2025-02-13T22:06:44Z"
  },
  {
    "title": "Where’s Melania? Maybe in the White House, Maybe Not!",
    "description": "Where is Melania Trump today? Maybe in the White House, maybe not. Melania signaled she would be a full-time First Lady and stop going missing. But she skipped several major events, like the Super Bowl, and hasn’t been seen publicly in three weeks.",
    "link": "http://nymag.com/intelligencer/article/where-is-melania-today-white-house-missing.html",
    "timestamp": "2025-02-13T22:06:24Z"
  },
  {
    "title": "GOP Bill Would Ban Criminals From Asylum. Most Already Are",
    "description": "House Republicans introduced a bill barring criminals from claiming asylum in U.S. on Thursday, despite criteria already in place.",
    "link": "https://www.newsweek.com/gop-bill-new-asylum-rules-banning-criminals-2030819",
    "timestamp": "2025-02-13T22:06:14Z"
  },
  {
    "title": "WATCH: Robert F. Kennedy Jr. sworn in as Trump’s secretary of health and human services",
    "description": "Robert F. Kennedy Jr. was sworn in Thursday as President Donald Trump’s health secretary after a close Senate vote, putting the prominent vaccine skeptic in control of $1.7 trillion in federal spending, vaccine recommendations and food safety as well as healt…",
    "link": "https://www.pbs.org/newshour/politics/watch-robert-f-kennedy-jr-sworn-in-as-trumps-secretary-of-health-and-human-services",
    "timestamp": "2025-02-13T22:05:51Z"
  },
  {
    "title": "Democratic Voters Tell Party To Chill Out With All The Left-Wing Nonsense: POLL",
    "description": "Democratic voters are craving moderation following a bruising election cycle during which a majority of voters appeared to reject progressive policies.",
    "link": "https://dailycaller.com/2025/02/13/democratic-voters-left-wing-moderate/",
    "timestamp": "2025-02-13T22:05:29Z"
  },
  {
    "title": "'Not quite certain': Linda McMahon says schools teaching Black history might be defunded - NewsBreak",
    "description": "Linda McMahon, President Donald Trump's secretary of education nominee, said she was \"not quite certain\" if teaching Black history would violate an executi",
    "link": "https://www.newsbreak.com/share/3809670351222-not-quite-certain-linda-mcmahon-says-schools-teaching-black-history-might-be-defunded?s=a2&share_destination_id=MjQzODgzNzEyLTE3Mzk0ODQyOTY3MjQ%3D&pd=0GVJIGXl&hl=en_US&send_time=1739484296&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v5",
    "timestamp": "2025-02-13T22:05:25Z"
  },
  {
    "title": "Secretary of Defense Pete Hegseth Press Conference Following NATO Ministers of Defense Meeting in Brussels, Belgium",
    "description": "Defense Secretary Pete Hegseth took questions from reporters following the 26th meeting of the Ukraine Defense Contact Group.",
    "link": "https://www.defense.gov/News/Transcripts/Transcript/Article/4066734/secretary-of-defense-pete-hegseth-press-conference-following-nato-ministers-of/",
    "timestamp": "2025-02-13T22:05:06Z"
  },
  {
    "title": "Russian Stock Market Surges After Trump-Putin Phone Call",
    "description": "Russia's stock market surged on Thursday following President Donald Trump's announcement that he spoke with Russian President Vladimir Putin on the phone about ceasefire negotiations in Ukraine.\nWhy It Matters\nFollowing Putin's invasion of Ukraine in February…",
    "link": "https://biztoc.com/x/2d6ad4399ff1fae4",
    "timestamp": "2025-02-13T22:04:58Z"
  },
  {
    "title": "Jordan's King Abdullah slammed in Arab world for response to Trump's Gaza plan",
    "description": "Critics condemn King Abdullah II for what he said and also how he conducted himself during his meeting with Donald Trump while discussing a U.S. 'takeover' of Gaza. 'An American president humiliated the Jordanian state's sovereignty,' wrote one",
    "link": "https://www.haaretz.com/middle-east-news/2025-02-14/ty-article/.premium/jordans-king-abdullah-slammed-in-arab-world-for-response-to-trumps-gaza-plan/00000194-ff18-db1f-a5dd-ff996cca0000",
    "timestamp": "2025-02-13T22:04:24Z"
  },
  {
    "title": "Trump admin prepares to change conditions of CHIPS Act and its $39B subsidies: sources",
    "description": "One of the sources said the White House is also frustrated by companies that accepted CHIPS Act subsidies and then announced significant overseas expansion plans, including in China. The law allowed some investments in China.",
    "link": "https://nypost.com/2025/02/13/business/trump-admin-prepares-to-change-conditions-of-chips-act-and-its-39b-subsidies-sources/",
    "timestamp": "2025-02-13T22:04:03Z"
  },
  {
    "title": "India's Modi brings a tariff 'gift' to Trump talks",
    "description": "WASHINGTON: Indian Prime Minister Narendra Modi comes bearing gifts as he meets Donald Trump on Thursday (Feb 13), hoping that concessions on",
    "link": "https://www.channelnewsasia.com/asia/indias-modi-brings-tariff-gift-trump-talks-4935471",
    "timestamp": "2025-02-13T22:03:55Z"
  },
  {
    "title": "Bristling at 'Gulf of Mexico' name change on maps, Mexico says it might sue Google",
    "description": "Mexican President Claudia Sheinbaum says her government is not ruling out filing a civil lawsuit against Google if it maintains its stance of calling the stretch of sea between northeastern Mexico and the southeastern United States the “Gulf of America.”.",
    "link": "https://www.ksat.com/business/2025/02/13/bristling-at-gulf-of-mexico-name-change-on-maps-mexico-says-it-might-sue-google/",
    "timestamp": "2025-02-13T22:03:13Z"
  },
  {
    "title": "Trump offers top-end jets, trade deal to India in Modi bromance",
    "description": "WASHINGTON: United States President Donald Trump on Thursday (Feb 13) offered to sell state-of-the-art fighter jets to India as he and Prime Minister Narendra Modi vowed to ramp up trade, rekindling a bond that defies the new US administration's punitive appr…",
    "link": "https://www.channelnewsasia.com/asia/india-us-trump-modi-jets-trade-deal-bromance-4935471",
    "timestamp": "2025-02-13T22:03:00Z"
  },
  {
    "title": "Trump taps Michael Whatley to remain RNC chair (from December)",
    "description": "Republican National Committee Chair Michael Whatley has agreed to remain in the role following President-elect Donald Trump’s request for him to stay. In a post to X on Wednesday, Whatley said the RNC has “crucial fights ahead,” from “supporting President Tru…",
    "link": "https://freerepublic.com/focus/f-news/4297441/posts",
    "timestamp": "2025-02-13T22:02:24Z"
  },
  {
    "title": "Trump taps Michael Whatley to remain RNC chair (from December)",
    "description": "Republican National Committee Chair Michael Whatley has agreed to remain in the role following President-elect Donald Trump’s request for him to stay. In a post to X on Wednesday, Whatley said the RNC has “crucial fights ahead,” from “supporting President Tru…",
    "link": "https://freerepublic.com/focus/f-chat/4297441/posts",
    "timestamp": "2025-02-13T22:02:24Z"
  },
  {
    "title": "Who is Lara Trump? Fox News hired Donald Trump's daughter-in-law to host new show, everything you need to know",
    "description": "US Donald Trump's daughter-in-law Lara Trump will now be returning to Fox News to host an all-new show, 'My View with Lara Trump', which will start off this February itself. This development comes just days after she stepped down as the Republican National Co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-lara-trump-fox-news-hired-donald-trumps-daughter-in-law-to-host-new-show-everything-you-need-to-know/articleshow/118226325.cms",
    "timestamp": "2025-02-13T22:02:05Z"
  },
  {
    "title": "Federal judge orders restoration of health agency web pages",
    "description": "A federal judge Tuesday directed the restoration of web pages and data regarding HIV and AIDS, assisted reproductive technologies, and health risks for youth on sites maintained by the Department of Health and Human Services, the Centers for Disease Control a…",
    "link": "https://www.advocate.com/health/judges-orders-health-sites-restored",
    "timestamp": "2025-02-13T22:02:05Z"
  },
  {
    "title": "'Such a juvenile': Longtime Musk associate throws him under bus on live TV",
    "description": "Veteran tech journalist Kara Swisher swatted down billionaire Elon Musk as highly immature on live TV Thursday.The tech mogul billionaire and close adviser to President Donald Trump has taken his disruptive business model to the federal government, where he's…",
    "link": "https://www.rawstory.com/elon-musk-humor/",
    "timestamp": "2025-02-13T22:02:00Z"
  },
  {
    "title": "Russia and US to hold ‘high-level’ meeting in Munich – Trump",
    "description": "President Trump has announced that “high-level” US representatives will meet their Russian counterparts at the Munich Security Conference Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612680-russia-us-munich-trump/",
    "timestamp": "2025-02-13T22:00:53Z"
  },
  {
    "title": "Trump's executive orders cause 'chaos' at the VA, some staffers say",
    "description": "President Donald Trump has implemented a flurry of executive orders and policies that have touched nearly every corner of the federal government, and the Department of Veterans Affair has not been immune.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/trumps-executive-orders-cause-chaos-va-staffers-say-rcna192045",
    "timestamp": "2025-02-13T22:00:51Z"
  },
  {
    "title": "Amazon Studios Discontinues Inclusion Playbook As DEI Programs Topple Under Donald Trump",
    "description": "As DEI buckles under President Donald Trump, Amazon Studios — along with its parent company, the broader tech industry, and much of corporate America — has discontinued its Inclusion Policy and Playbook unveiled in the summer of 2021 to codify its existing di…",
    "link": "http://deadline.com/2025/02/amazon-studios-inclusion-policy-dei-donald-trump-1236288680/",
    "timestamp": "2025-02-13T22:00:46Z"
  },
  {
    "title": "BREAKING: Biden Judge Blocks Trump’s Executive Order Restricting Federal Aid to Hospitals That Perform Transgender Surgeries on Minors",
    "description": "A federal judge has issued a temporary injunction against Trump's executive order limiting federal funding for hospitals performing transgender surgeries on minors, igniting a contentious debate over healthcare and children's rights.\nThe post BREAKING: Biden …",
    "link": "https://www.thegatewaypundit.com/2025/02/breaking-biden-judge-blocks-trumps-executive-order-restricting/",
    "timestamp": "2025-02-13T22:00:46Z"
  },
  {
    "title": "Chris Selley: Crombie comes out against deleting historic Toronto school names. Ford remains silent",
    "description": "Liberal leader Bonnie Crombie promises not to shy away from 'tough conversations' about Canadian history",
    "link": "https://nationalpost.com/opinion/crombie-against-changing-historic-toronto-school-names-ford-silent",
    "timestamp": "2025-02-13T22:00:34Z"
  },
  {
    "title": "Joy Behar goes off on US being 'named after a White man' during Gulf of America debate",
    "description": "\"The View\" co-host Joy Behar went off on America's name during a discussion on Monday, complaining that the country is \"named after a White man.\"",
    "link": "https://www.foxnews.com/media/joy-behar-goes-off-us-named-after-white-man-during-gulf-america-debate",
    "timestamp": "2025-02-13T22:00:19Z"
  },
  {
    "title": "Russian Stock Market Surges After Trump-Putin Phone Call",
    "description": "The Russian ruble on Thursday closed at its highest level in several months.",
    "link": "https://www.newsweek.com/russia-stock-market-surges-trump-putin-2030897",
    "timestamp": "2025-02-13T22:00:19Z"
  },
  {
    "title": "Air Marshal Association recognized as Federal Air Marshal union and leads effort to separate from the TSA",
    "description": "The Air Marshal Association was recently recognized in federal court as the Federal Air Marshal union. The union is leading an effort to leave the TSA.......",
    "link": "https://www.globenewswire.com/news-release/2025/02/13/3026340/0/en/Air-Marshal-Association-recognized-as-Federal-Air-Marshal-union-and-leads-effort-to-separate-from-the-TSA.html",
    "timestamp": "2025-02-13T22:00:00Z"
  },
  {
    "title": "Trump Reverses Biden's Environmental Policies With Assessment Freeze",
    "description": "A far-reaching nature assessment that was approved by the Biden administration in 2022 has been halted by President Donald Trump just weeks before its completion. This follows recent decisions by Trump to take the United States out of the Paris climate agreem…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Reverses-Bidens-Environmental-Policies-With-Assessment-Freeze.html",
    "timestamp": "2025-02-13T22:00:00Z"
  },
  {
    "title": "Issa Rae cancels Kennedy Center event due to Donald Trump’s takeover",
    "description": "Issa Rae cancels her sold-out ‘An Evening with Issa Rae’ event at the Kennedy Center due to Donald Trump being appointed as the center’s chairman:“Unfortunately, due to what I believe to be an infringement on the values of an institution that has faithfully c…",
    "link": "https://ohnotheydidnt.livejournal.com/130023597.html",
    "timestamp": "2025-02-13T21:58:49Z"
  },
  {
    "title": "‘Absolutely Ridiculous!’ Bush’s USAID Chief Flips The Script on Musk, Says Agency Was Burdened By Oversight",
    "description": "\"We design the project. We co-invest and then we manage it. The notion that AID is irresponsible in terms of its oversight is utter nonsense.\"\nThe post ‘Absolutely Ridiculous!’ Bush’s USAID Chief Flips The Script on Musk, Says Agency Was Burdened By Oversight…",
    "link": "https://www.mediaite.com/politics/absolutely-ridiculous-bushs-usaid-chief-flips-the-script-on-musk-says-agency-was-burdened-by-oversight/",
    "timestamp": "2025-02-13T21:58:37Z"
  },
  {
    "title": "Tilda Swinton Alludes to Trump, Blasts Political Extremism and ‘Entitled Domination’ During Berlin Film Festival Speech",
    "description": "The Oscar-winning actress calls out the inhumanity and \"unacceptable complacency of our greed-addicted governments\"\nThe post Tilda Swinton Alludes to Trump, Blasts Political Extremism and ‘Entitled Domination’ During Berlin Film Festival Speech appeared first…",
    "link": "https://www.thewrap.com/tilda-swinton-berlin-film-festival-speech-political-extremism-trump/",
    "timestamp": "2025-02-13T21:58:31Z"
  }
]