[
  {
    "title": "New Deal Puts Takaichi On Track To Be Japan's First Woman PM: Reports",
    "description": "Japan's ruling party is set to sign a new coalition deal on Monday, paving the way for Sanae Takaichi to become the country's first woman prime minister, media reports said.",
    "link": "https://www.ibtimes.com/new-deal-puts-takaichi-track-japans-first-woman-pm-reports-3787547",
    "timestamp": "2025-10-19T05:06:09Z"
  },
  {
    "title": "Hamas official: We are in talks with Trump, we won't disarm",
    "description": "A senior Hamas official abroad, Mohammad Nazzal, stated that talks are being held with US President Donald Trump as well as a dialogue with senior American officials through several channels, during which Hamas is clarifying its position.In an interview with …",
    "link": "https://www.israelnationalnews.com/flashes/668691",
    "timestamp": "2025-10-19T05:00:48Z"
  },
  {
    "title": "Colombia Accuses US Of Violating Sovereignty In Strike",
    "description": "Colombia's president accused on Saturday Washington of violating his country's sovereignty and killing a fisherman, shortly after US leader Donald Trump confirmed that US forces carried out another strike in his military campaign against \"narcoterrorists.\"",
    "link": "https://www.ibtimes.com/colombia-accuses-us-violating-sovereignty-strike-3787544",
    "timestamp": "2025-10-19T05:00:09Z"
  },
  {
    "title": "The ‘enormous conflict of interest’ at centre of Jared Kushner’s Gaza ceasefire deal",
    "description": "US president’s son-in-law was instrumental in getting deal – which could bring him huge windfall if plan to redevelop Gaza ever comes to fruition",
    "link": "https://uk.news.yahoo.com/enormous-conflict-interest-centre-jared-050007161.html",
    "timestamp": "2025-10-19T05:00:07Z"
  },
  {
    "title": "Donald Trump Posts Weird AI Video of Himself in a ‘King Trump’ Fighter Jet Dropping Streams of Brown Liquid on NYC Protestors",
    "description": "President Donald Trump acknowledged the nationwide “No Kings” protests against him and his administration Saturday — in an AI-generated video that shows the U.S. president as a king in a fighter jet dropping what appears to be a large amount of fecal matter o…",
    "link": "https://variety.com/2025/digital/news/trump-ai-video-no-kings-fighter-jet-brown-sludge-protestors-1236556347/",
    "timestamp": "2025-10-19T04:52:45Z"
  },
  {
    "title": "Trumpeting from skies: Trump shares AI video of spraying mud on 'No Kings' protestors",
    "description": "Former US President Donald Trump shared a video showing him as 'King Trump' in a fighter jet. The video depicted him spraying mud on 'No Kings' protestors. Millions participated in these protests across the US. Demonstrations occurred amid a government shutdo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumpeting-from-skies-trump-shares-ai-video-of-spraying-mud-on-no-kings-protestors/articleshow/124682618.cms",
    "timestamp": "2025-10-19T04:51:39Z"
  },
  {
    "title": "Donald Trump Celebrates Today’s ‘Yes King March’ on ‘SNL’: ‘People Are Marching’ Because I Freed ‘Liar’ George Santos From Prison",
    "description": "James Austin Johnson’s Donald Trump dropped by an episode of the junk food podcast “Snack Homiez” during the Sabrina Carpenter-hosted episode of “Saturday Night Live” on Oct. 18. When asked by young men co-hosting the podcast — played by Carpenter, Chloe Fine…",
    "link": "https://variety.com/2025/tv/news/snl-donald-trump-march-george-santos-1236556351/",
    "timestamp": "2025-10-19T04:50:07Z"
  },
  {
    "title": "Sold out in India, panic in London: How the silver market broke",
    "description": "A perfect storm of events, including a surge in Indian demand for silver during festival season and a boom in solar power, drained global inventories. This led to unprecedented shortages and price spikes, causing a market breakdown not seen in decades. Intern…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/sold-out-in-india-panic-in-london-how-the-silver-market-broke/articleshow/124682536.cms",
    "timestamp": "2025-10-19T04:46:32Z"
  },
  {
    "title": "‘SNL’: Donald Trump Tells Gen Z Why His Heaven Chances Are ‘Cooked’",
    "description": "On Saturday Night Live, Donald Trump worries a troublesome past friendship might doom his odds for an afterlife.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-donald-trump-tells-gen-z-why-heaven-chances-are-cooked-1235449939/",
    "timestamp": "2025-10-19T04:43:55Z"
  },
  {
    "title": "Colombia accuses US of killing ‘lifelong fisherman’ in boat strike",
    "description": "Colombian President Gustavo Petro has claimed that the US military killed an ordinary fisherman instead of a cartel member Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626671-colombian-us-killed-fisherman/",
    "timestamp": "2025-10-19T04:42:54Z"
  },
  {
    "title": "Bolivia heads to the polls in a tight runoff as voters seek a president to lift them from crisis",
    "description": "Bolivia is about to swing to the right after almost two decades of being governed by the Movement Toward Socialism party",
    "link": "https://abcnews.go.com/International/wireStory/bolivia-heads-polls-tight-runoff-voters-seek-president-126655563",
    "timestamp": "2025-10-19T04:37:53Z"
  },
  {
    "title": "Terrorism as religious sacrifice: What the Trump deal ignored",
    "description": "In essence, for Hamas, terror is a form of sacred violence oriented toward the “sacrifice” of enemies and martyrs. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416448",
    "timestamp": "2025-10-19T04:33:33Z"
  },
  {
    "title": "US Warns of 'Imminent Ceasefire Violation by Hamas'",
    "description": "MOSCOW (Sputnik) - The United States informed the guarantor countries of the Gaza peace agreement of an \"imminent\" ceasefire violation by Palestinian movement Hamas, the US State Department said.",
    "link": "https://sputnikglobe.com/20251019/us-warns-of-imminent-ceasefire-violation-by-hamas-1122986553.html",
    "timestamp": "2025-10-19T04:32:23Z"
  },
  {
    "title": "James Austin Johnson’s Trump blamed one infamous figure for killing his chances at making it through the pearly gates.",
    "description": "Saturday Night Live‘s Donald Trump made a surprise appearance in an early sketch centered around male Gen Z podcasters. Played once again by cast member...",
    "link": "https://www.thedailybeast.com/even-snls-donald-trump-doubts-hes-getting-into-heaven/",
    "timestamp": "2025-10-19T04:32:15Z"
  },
  {
    "title": "France Yellow Vests Week 360*The Tense Macron-Trump Handshake*The Macron Government Survives*",
    "description": "What was going on when President Emmanuel Macron and US President Donald Trump engaged in a tense handshake that lasted almost 30 seconds. A lip reader was consulted and came up with a notion of what the two leaders said... After making the apparent concessio…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347255/posts",
    "timestamp": "2025-10-19T04:30:42Z"
  },
  {
    "title": "Barry O’Halloran: Ukraine conflict could hinge on Donald Trump’s cat-and-mouse game around Tomahawk missiles",
    "description": "For the nine months he has been in office, ­Donald Trump has courted Vladimir Putin assiduously, to no avail. In a major boost to the Russian president, the pair met in Alaska in August but “Vladimir”, as the US president likes to call him, didn’t budge. Will…",
    "link": "https://www.independent.ie/irish-news/presidential-election/barry-ohalloran-ukraine-conflict-could-hinge-on-donald-trumps-cat-and-mouse-game-around-tomahawk-missiles/a401710816.html",
    "timestamp": "2025-10-19T04:30:00Z"
  },
  {
    "title": "Letters: Michael D Higgins’ ideology and ego will not be missed",
    "description": "Madam — As Michael D Higg­ins prepares to leave Áras an Uachtaráin, the usual chorus of sentimental tributes will try to paper over what his tenure really represented: more than a decade of interference, ideological indulgence and serial embarrassment for the…",
    "link": "https://www.independent.ie/irish-news/presidential-election/letters-michael-d-higgins-ideology-and-ego-will-not-be-missed/a923128671.html",
    "timestamp": "2025-10-19T04:30:00Z"
  },
  {
    "title": "‘Tariff risk from OTB bill just one of many trade threats Irish firms face in volatile geopolitical landscape’ corporate crime summit hears",
    "description": "Passing the controversial Occupied Territories Bill could provoke a tariff backlash against Ireland from US President Donald Trump, a former senior prosecutor and national security official with the US Department of Justice (DOJ) has warned.",
    "link": "https://www.independent.ie/business/irish/tariff-risk-from-otb-bill-just-one-of-many-trade-threats-irish-firms-face-in-volatile-geopolitical-landscape-corporate-crime-summit-hears/a1590467815.html",
    "timestamp": "2025-10-19T04:30:00Z"
  },
  {
    "title": "‘No Kings’ protests branded ‘Hate America’ by Donald Trump allies",
    "description": "Protesting the direction of the US under President Donald Trump, people gathered yesterday in the nation’s capital and communities across the US for ‘No Kings’ demonstrations — what the President’s Republican Party is calling ‘Hate America’ rallies.",
    "link": "https://www.independent.ie/world-news/north-america/no-kings-protests-branded-hate-america-by-donald-trump-allies/a1179563468.html",
    "timestamp": "2025-10-19T04:30:00Z"
  },
  {
    "title": "Letters: Michael D Higgins’ ideology and ego will not be missed",
    "description": "Madam — As Michael D Higg­ins prepares to leave Áras an Uachtaráin, the usual chorus of sentimental tributes will try to paper over what his tenure really represented: more than a decade of interference, ideological indulgence and serial embarrassment for the…",
    "link": "https://www.independent.ie/opinion/letters/letters-michael-d-higgins-ideology-and-ego-will-not-be-missed/a923128671.html",
    "timestamp": "2025-10-19T04:30:00Z"
  },
  {
    "title": "Dear MAGA... (By libertarians)",
    "description": "@beinlibertarian Dear MAGA, Nothing will lose libertarian support for Republicans like Trump taking uncalled for shots at Constitutional Conservatives like Rand Paul and Thomas Massie while supporting Lindsey Graham and Fauci. That might not be as big as the …",
    "link": "https://freerepublic.com/focus/f-chat/4347251/posts",
    "timestamp": "2025-10-19T04:22:31Z"
  },
  {
    "title": "Thousands come together in downtown Louisville for second 'No Kings' rally",
    "description": "Protesters voiced concerns about President Donald Trump and his policies, gathering in the wake of the federal government shutdown and the deployment of National Guard troops into cities.",
    "link": "https://www.wlky.com/article/no-kings-day-rally-louisville-kentucky-trump-protest/69082847",
    "timestamp": "2025-10-19T04:22:30Z"
  },
  {
    "title": "'No Kings' protests against Trump happening nationwide",
    "description": "This is the third mass mobilization since Trump's return to the White House, and it is expected to be the largest.",
    "link": "https://www.wcvb.com/article/no-kings-protests-planned-nationwide/69080501",
    "timestamp": "2025-10-19T04:20:27Z"
  },
  {
    "title": "Ypsilanti, named for a Greek Freedom Fighter against Tyranny, Rallies against Trump on “No Kings” Day",
    "description": "Ann Arbor (Informed Comment) - In the 1820s Greece waged a successful war of independence against an authoritarian king, the Ottoman Emperor Mahmoud II. The American public, enthralled with this saga of a quest for liberty, idolized the revolutionaries, who w…",
    "link": "https://www.juancole.com/2025/10/ypsilanti-freedom-fighter.html",
    "timestamp": "2025-10-19T04:15:01Z"
  },
  {
    "title": "Victor Davis Hanson Reveals How He’d Rank Trump, Biden Among US Presidents",
    "description": "Victor Davis Hanson ranked President Donald Trump in the top five of best U.S. presidents and former President Joe Biden among the worst three presidents... Read More\nThe post Victor Davis Hanson Reveals How He’d Rank Trump, Biden Among US Presidents appeared…",
    "link": "https://www.dailysignal.com/2025/10/19/victor-davis-hanson-reveals-how-hed-rank-trump-biden-among-us-presidents/",
    "timestamp": "2025-10-19T04:15:00Z"
  },
  {
    "title": "China's ruling Communist Party meets to map out plans for the next 5 years",
    "description": "One of China’s most important meetings begins Monday, as its top leader Xi Jinping and other ruling Communist Party elites gather in Beijing to map out the country’s goals for the next five years",
    "link": "https://abcnews.go.com/Business/wireStory/chinas-ruling-communist-party-meets-map-plans-5-126654352",
    "timestamp": "2025-10-19T04:05:21Z"
  },
  {
    "title": "The Russia–Ukraine War as Seen From Budapest",
    "description": "The American Conservative sits down with Balázs Orbán, political director to the Hungarian Prime Minister, to discuss why the logic of war should be replaced in the forthcoming Budapest summit by the idea of political settlement. \nThe post The Russia–Ukraine …",
    "link": "https://www.theamericanconservative.com/the-russia-ukraine-war-as-seen-from-budapest/",
    "timestamp": "2025-10-19T04:03:00Z"
  },
  {
    "title": "No More (Bureaucrats Who Would Be) Kings",
    "description": "If you’re reading this today, you probably did not join the aged hippies marching around with signs saying “No more Kings,”a multistate demonstration whose sponsors are not yet fully disclosed. (I don’t think Meghan ...",
    "link": "https://www.americanthinker.com/articles/2025/10/no_more_bureaucrats_who_would_be_kings.html",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Trump said he’s not going to heaven: He’s probably wrong",
    "description": "Aboard Air Force One on October 12th, Trump said there was no place in heaven for him, that he “won’t get to heaven.” He is wrong about that, and I wish most fervently that I could speak with him about this. Someone has made Trump b...",
    "link": "https://www.americanthinker.com/blog/2025/10/trump_said_he_s_not_going_to_heaven_he_s_probably_wrong.html",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Mexico’s first woman president balances continuity and change but pressure is mounting",
    "description": "In her first year in office, Claudia Sheinbaum has deftly managed tensions with the US and at home. But the pressure is starting to mount",
    "link": "https://www.irishtimes.com/world/americas/2025/10/19/mexicos-first-woman-president-balances-continuity-and-change-but-pressure-is-mounting/",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Trump Pushes The Limits Of Presidential Power",
    "description": "Now that Trump has seen success in the Middle East, at least for the moment, where does he go from here? We are left with the question of how he can top this and where he goes from here. What we know is that he will push the limits of presidential po...",
    "link": "https://www.americanthinker.com/articles/2025/10/trump_pushes_the_limits_of_presidential_power.html",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Watch out for the crazies this weekend",
    "description": "Did you hear that we marched against “kings” this weekend? Yes, who knows how many reminded us that they hate kings, dictators, authoritarians, and anything that rhymes with Trump. Yes, anything that rhymes with Trump.\r\n\r\nAt the same time...",
    "link": "https://www.americanthinker.com/blog/2025/10/watch_out_for_the_crazies_this_weekend.html",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Electric vehicle subsidies end; Colorado steps up",
    "description": "My fellow editor Olivia Murray and I often write about the electric vehicle—EV--scam/debacle, though not lately. With Donald Trump’s 2024 victory, most automakers sighed and began to acknowledge the reality they’d avoided for years:...",
    "link": "https://www.americanthinker.com/blog/2025/10/electric_vehicle_subsidies_end_colorado_steps_up.html",
    "timestamp": "2025-10-19T04:00:00Z"
  },
  {
    "title": "Japan coalition set to back Takaichi as first woman prime minister: Reports",
    "description": "Liberal Democratic Party leader Sanae Takaichi appears back on track to becoming Japan first female prime minister.",
    "link": "https://www.aljazeera.com/news/2025/10/19/japan-coalition-set-to-back-takaichi-as-first-woman-prime-minister-reports",
    "timestamp": "2025-10-19T03:56:41Z"
  },
  {
    "title": "Several \"No Kings\" protests take place across Pittsburgh area",
    "description": "County and city officials said there were no arrests related to the protest.",
    "link": "https://www.cbsnews.com/pittsburgh/news/pittsburgh-no-kings-trump-protests-october/",
    "timestamp": "2025-10-19T03:43:08Z"
  },
  {
    "title": "Kamala Harris criticizes Joe Biden for snubbing Elon Musk in 2021: ‘Big mistake’",
    "description": "Harris said she believed the snub — which was widely seen as a political favor to organized labor — was mishandled and had lasting repercussions.",
    "link": "https://nypost.com/2025/10/18/us-news/kamala-harris-criticizes-joe-biden-for-snubbing-elon-musk-in-2021/",
    "timestamp": "2025-10-19T03:37:52Z"
  },
  {
    "title": "Squad Stands with Minneapolis Mamdani-Like Omar Fateh in Mayoral Showdown",
    "description": "Minnesota State Sen. Omar Fateh is receiving high-profile backing from current and former Squad members Ilhan Omar and Jamaal Bowman as he campaigns for mayor of Minneapolis, marking a show of unity among progressive Democrats following months of internal par…",
    "link": "https://www.breitbart.com/politics/2025/10/18/squad-stands-with-minneapolis-mamdani-like-omar-fateh-in-mayoral-showdown/",
    "timestamp": "2025-10-19T03:31:34Z"
  },
  {
    "title": "Trump shares AI video of himself as king",
    "description": "United States President Donald Trump posted an AI-generated video of himself flying a jet with the inscription \"King Trump\" and dumping mud on protesters.Additionally, he reposted an AI-generated vide...",
    "link": "https://biztoc.com/x/925de55e063fe974",
    "timestamp": "2025-10-19T03:21:44Z"
  },
  {
    "title": "Piece of puzzle: Putin demands key Ukraine region in return for peace",
    "description": "Russian President Vladimir Putin has demanded Ukraine surrender all of Donetsk to end the war.  He offered to give up parts of Zaporizhzhia and Kherson in exchange.  US President Donald Trump plans to meet Putin soon to discuss the conflict.  Ukraine hopes fo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/piece-of-puzzle-putin-demands-key-ukraine-region-in-return-for-peace/articleshow/124681739.cms",
    "timestamp": "2025-10-19T03:11:06Z"
  },
  {
    "title": "Trump shared AI video of himself as king",
    "description": "United States President Donald Trump posted an AI-generated video of himself flying a jet with the inscription \"King Trump\" and dumping mud on protesters.Additionally, he reposted an AI-generated vide...",
    "link": "https://biztoc.com/x/5be8481e8cdb527f",
    "timestamp": "2025-10-19T03:10:32Z"
  },
  {
    "title": "China’s ruling Communist Party meets to map out plans for the next 5 years",
    "description": "HONG KONG (AP) — One of China’s most important meetings begins Monday, as leader Xi Jinping and other ruling Communist Party elites gather in Beijing to map out the goals for the next five years. The closed-door gathering — known as the fourth plenum — is exp…",
    "link": "https://financialpost.com/pmn/chinas-ruling-communist-party-meets-to-map-out-plans-for-the-next-5-years",
    "timestamp": "2025-10-19T03:06:55Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang to attend APEC CEO Summit in South Korea",
    "description": "SEOUL (Reuters) -NVIDIA CEO Jensen Huang plans to meet \"global leaders and top Korean executives\" when he attends the Asia-Pacific Economic Cooperation CEO...",
    "link": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-attend-030314645.html",
    "timestamp": "2025-10-19T03:03:14Z"
  },
  {
    "title": "China's ruling Communist Party meets to map out plans for the next 5 years",
    "description": "One of China’s most important meetings begins Monday, as leader Xi Jinping and other ruling Communist Party elites gather in Beijing to map out the goals for...",
    "link": "https://www.yahoo.com/news/articles/chinas-ruling-communist-party-meets-030122502.html",
    "timestamp": "2025-10-19T03:01:22Z"
  },
  {
    "title": "No Kings Protest Against Trump - What It's About",
    "description": "Large groups of people came on the streets of major cities in the US  for 'No Kings Protest' against the policies of the President Donald Trump's administration. Small gathering of protestors were also seen throughout the country on Saturday.",
    "link": "https://www.ndtvprofit.com/world/no-kings-protest-against-trump-what-its-about",
    "timestamp": "2025-10-19T02:46:23Z"
  },
  {
    "title": "Gran-Tifa: Boomer Resistance Activists Out in Large Numbers at ‘No Kings’ Rally",
    "description": "Older demonstrators joined Saturday’s nationwide “No Kings” protests under the self-styled banner “Grantifa,” with participants holding handmade signs and wearing shirts declaring themselves “Grandparents Against Fascism.” The “No Kings” demonstrations were o…",
    "link": "https://www.breitbart.com/politics/2025/10/18/gran-tifa-boomer-resistance-activists-out-in-large-numbers-at-no-kings-rally/",
    "timestamp": "2025-10-19T02:37:37Z"
  },
  {
    "title": "Weekly Stock Market Update: Apple, Taiwan Semiconductor and Novo Nordisk",
    "description": "It was a volatile but ultimately positive week on Wall Street, marked by renewed tensions in the U.S.-China trade war and a strong start to the earnings...",
    "link": "https://www.thestreet.com/investing/stocks/weekly-stock-market-update-apple-taiwan-semiconductor-and-novo-nordisk",
    "timestamp": "2025-10-19T02:37:33Z"
  },
  {
    "title": "JOSH HAMMER: Democrats Still Haven’t Learned Any Lessons",
    "description": "On Thursday, Senate Democrats voted for the 10th time to prolong the federal government shutdown. They also voted against funding the military.",
    "link": "https://dailycaller.com/2025/10/18/opinion-democrats-still-havent-learned-any-lessons-josh-hammer/",
    "timestamp": "2025-10-19T02:36:12Z"
  },
  {
    "title": "Report: Democrat California State Sen. to Challenge Nancy Pelosi in Primary",
    "description": "A California Democrat state senator is reportedly planning to challenge Rep. Nancy Pelosi D-CA), who has not yet announced if she will run for re-election or retire, according to multiple reports.\nThe post Report: Democrat California State Sen. to Challenge N…",
    "link": "https://www.breitbart.com/politics/2025/10/18/report-democrat-california-state-sen-to-challenge-nancy-pelosi-in-primary/",
    "timestamp": "2025-10-19T02:34:39Z"
  },
  {
    "title": "Who will succeed Trump in 2028 election? New poll shows...",
    "description": "Vice President JD Vance and California Gov. Gavin Newsom (D) are locked in a tight hypothetical 2028 presidential election race.",
    "link": "https://www.nj.com/politics/2025/10/who-will-succeed-trump-in-2028-election-new-poll-shows.html",
    "timestamp": "2025-10-19T02:21:10Z"
  },
  {
    "title": "US says Hamas is planning 'imminent' attack on Gaza civilians",
    "description": "The US state department says the move would be a violation of the ceasefire deal, but did not give further details.",
    "link": "https://www.bbc.com/news/articles/cm2elr16jjqo",
    "timestamp": "2025-10-19T02:16:33Z"
  },
  {
    "title": "Vance celebrates Marine Corps’ 250th anniversary with California event that sparks back-and-forth with Newsom | CNN Politics",
    "description": "Vice President JD Vance celebrated the 250th anniversary of the United States Marine Corps on Saturday at a California event that drew some pushback from Gov. Gavin Newsom over a live artillery demonstration.",
    "link": "https://www.cnn.com/2025/10/18/politics/marine-corps-anniversary-jd-vance",
    "timestamp": "2025-10-19T02:12:14Z"
  },
  {
    "title": "Protesters Out In Force For Anti-Trump 'No Kings' Rallies Across US",
    "description": "Huge crowds took to the streets in all 50 US states at \"No Kings\" protests on Saturday, venting anger over President Donald Trump's hardline policies, while Republicans ridiculed them as \"Hate America\" rallies.",
    "link": "https://www.ibtimes.com.au/protesters-out-force-anti-trump-no-kings-rallies-across-us-1860897",
    "timestamp": "2025-10-19T02:12:07Z"
  },
  {
    "title": "George Santos expresses gratitude to Trump following commutation of his 7-year prison sentence",
    "description": "George Santos plans to focus on prison reform after President Trump commuted his sentence, saying he will dedicate his next chapter to \"doing good.\"",
    "link": "https://www.foxnews.com/politics/george-santos-expresses-gratitude-trump-following-commutation-7-year-prison-sentence",
    "timestamp": "2025-10-19T01:59:23Z"
  },
  {
    "title": "John Cusack: Trump Is an Authoritarian, His 'Masked Goons' Are 'Abducting People'",
    "description": "Saturday on CNN's \"Newsroom,\" during a “No Kings” protest, actor John Cusack said President Donald Trump was an authoritarian using \"masked goons\" to abduct people.\nThe post John Cusack: Trump Is an Authoritarian, His ‘Masked Goons’ Are ‘Abducting People’ app…",
    "link": "https://www.breitbart.com/clips/2025/10/18/john-cusack-trump-is-an-authoritarian-his-masked-goons-are-abducting-people/",
    "timestamp": "2025-10-19T01:56:45Z"
  },
  {
    "title": "Starmer’s China woes mean an ‘unwieldy mess’ just got messier",
    "description": "The collapse of a high-profile espionage trial has thrust U.K.-China relations firmly into the spotlight.",
    "link": "https://www.japantimes.co.jp/news/2025/10/19/world/politics/starmer-china-xi/",
    "timestamp": "2025-10-19T01:52:00Z"
  },
  {
    "title": "Why Did Democrats Lose White Men? John Fetterman Has the Answer.",
    "description": "Sen. John Fetterman (D-PA) was on point when he discussed why the Democratic Party can’t win the votes of White men. During an appearance on Tara Palmeri’s show, Fetterman suggested there might not be a way for Democrats to win among this demographic. \"How do…",
    "link": "https://freerepublic.com/focus/f-news/4347234/posts",
    "timestamp": "2025-10-19T01:42:39Z"
  },
  {
    "title": "'No Kings' protesters emerge en masse for anti-Trump rallies",
    "description": "The demographically mixed crowds included many parents pushing youngsters in strollers alongside elderly participants.",
    "link": "https://www.japantimes.co.jp/news/2025/10/19/world/politics/no-kings-anti-trump-rallies/",
    "timestamp": "2025-10-19T01:42:00Z"
  },
  {
    "title": "White House taunts liberals with provocative meme-filled debut on Bluesky",
    "description": "The Trump White House joined Bluesky with a meme-filled debut on Friday, appearing to poke fun at the liberal-leaning platform’s progressive users.",
    "link": "https://www.foxnews.com/media/white-house-taunts-liberals-provocative-meme-filled-debut-bluesky",
    "timestamp": "2025-10-19T01:34:39Z"
  },
  {
    "title": "Thousands challenge Trump policies in 'No Kings' rallies",
    "description": "More than two-and-a-half thousand demonstrations are taking place across the United States, to express opposition to the policies of US President Donald Trump.",
    "link": "https://www.rte.ie/news/us/2025/1019/1539326-no-kings-protests/",
    "timestamp": "2025-10-19T01:32:20Z"
  },
  {
    "title": "'Why? This is a mistake': Fox News contributor melts down after learning of new Trump move",
    "description": "Donald Trump just made a huge mistake in releasing a Republican from prison, according to former George W. Bush administration White House press secretary Ari Fleischer.Fleischer, a Fox News contributor who served as press secretary under then-President Georg…",
    "link": "https://www.rawstory.com/fox-news-2674212106/",
    "timestamp": "2025-10-19T01:32:19Z"
  },
  {
    "title": "Republicans mostly silent as millions of Americans protest Trump on No Kings day (Edward Helmore/The Guardian)",
    "description": "Edward Helmore / The Guardian:\nRepublicans mostly silent as millions of Americans protest Trump on No Kings day  —  Outside of typical remarks from Donald Trump, JD Vance and Mike Johnson and a Fox News report, party stayed mum  —  Republican voices were most…",
    "link": "https://www.memeorandum.com/251018/p54",
    "timestamp": "2025-10-19T01:30:04Z"
  },
  {
    "title": "George Conway TROLLS Trump at 'No Kings\"'protests",
    "description": "Millions of protesters took to the streets nationwide as part of the \"No Kings\" protests against Donald Trump's authoritarian ...",
    "link": "https://biztoc.com/x/9f8911b85d4e854f",
    "timestamp": "2025-10-19T01:24:51Z"
  },
  {
    "title": "Benioff sorry for saying Trump must send troops to San Francisco",
    "description": "US News: Marc Benioff apologised on Friday for saying President Donald Trump should send the National Guard to San Francisco after a week of being hammered by .",
    "link": "https://timesofindia.indiatimes.com/world/us/benioff-sorry-for-saying-trump-must-send-troops-to-san-francisco/articleshow/124681133.cms",
    "timestamp": "2025-10-19T01:22:41Z"
  },
  {
    "title": "Novo Nordisk hires US pharma veteran as Trump pricing pressure mounts",
    "description": "Novo Nordisk has appointed Greg Miley, a U.S. pharmaceutical executive, as its new global head of corporate affairs. This move comes as the company faces increasing pressure on drug pricing from the U.S. President. Miley's expertise will help Novo Nordisk man…",
    "link": "https://economictimes.indiatimes.com/news/international/business/novo-nordisk-hires-us-pharma-veteran-as-trump-pricing-pressure-mounts/articleshow/124681168.cms",
    "timestamp": "2025-10-19T01:21:52Z"
  },
  {
    "title": "War for Ukraine Day 1,332: A Brief Saturday Night Update",
    "description": "A quick housekeeping note: Apparently whenever there is a protest, someone asks if my posts about safety while protesting can get reposted. I have no idea if that happened for today’s protests. I know it happened for the last one several months ago because so…",
    "link": "https://balloon-juice.com/2025/10/18/war-for-ukraine-day-1332-a-brief-saturday-night-update/",
    "timestamp": "2025-10-19T01:15:03Z"
  },
  {
    "title": "Venezuela announces sweeping military exercises as US escalates pressure",
    "description": "Venezuela has launched a military mobilization and civilian combat training.  The government cites an escalating threat from the United States.  This comes as US operations intensify in the Caribbean.  Venezuelan officials are urging citizens to prepare for t…",
    "link": "https://economictimes.indiatimes.com/news/defence/venezuela-announces-sweeping-military-exercises-as-us-escalates-pressure/articleshow/124681130.cms",
    "timestamp": "2025-10-19T01:11:06Z"
  },
  {
    "title": "Netanyahu says Gaza war not over until Hamas disarms",
    "description": "Israeli Prime Minister Benjamin Netanyahu declared the Gaza war will continue until Hamas is disarmed and the territory demilitarized. This comes as Hamas handed over the remains of two hostages, a key sticking point in the ceasefire. The Rafah crossing remai…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-says-gaza-war-not-over-until-hamas-disarms/articleshow/124681099.cms",
    "timestamp": "2025-10-19T01:03:19Z"
  },
  {
    "title": "Green joins new public health alliance formed by governors | Honolulu Star-Advertiser",
    "description": "Gov. Josh Green is one of 15 state governors that have joined forces to launch a new alliance to coordinate public health efforts.",
    "link": "https://www.staradvertiser.com/2025/10/18/hawaii-news/green-joins-new-public-health-alliance-formed-by-governors/",
    "timestamp": "2025-10-19T01:00:41Z"
  },
  {
    "title": "“Academia is a sinking ship, and the Trump administration is actually trying to intervene and rescue it”",
    "description": "Higher Education Needs An Intervention - Part 2 - Academia is in freefall. It's losing not only the population as a whole, but both Republicans and Democrats and almost all demographics. Yet higher education is defiant of attempts at outside reform.\nThe post …",
    "link": "https://legalinsurrection.com/2025/10/academia-is-a-sinking-ship-and-the-trump-administration-is-actually-trying-to-intervene-and-rescue-it/",
    "timestamp": "2025-10-19T01:00:21Z"
  },
  {
    "title": "Trump Coin down 70%, but NewsMax still dives in with $5M bet – Why?",
    "description": "From Bitcoin to TRUMP: Understanding NMAX’s strategy.",
    "link": "https://ambcrypto.com/trump-coin-down-70-but-newsmax-still-dives-in-with-5m-bet-why/",
    "timestamp": "2025-10-19T01:00:20Z"
  },
  {
    "title": "'No Kings' protests against Trump bring a street party vibe to cities nationwide",
    "description": "Thousands across the U.S. participated in \"No Kings\" demonstrations, protesting what they perceive as President Trump's authoritarian drift. Rallies in major cities featured signs like \"Resist Fascism\" and \"We The People,\" with organizers aiming to unite oppo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-kings-protests-against-trump-bring-a-street-party-vibe-to-cities-nationwide/articleshow/124681089.cms",
    "timestamp": "2025-10-19T01:00:15Z"
  },
  {
    "title": "Netanyahu plans to seek another term",
    "description": "Israeli Prime Minister Benjamin Netanyahu says he will run in the 2026 elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626667-netanyahu-plans-run-again-pm/",
    "timestamp": "2025-10-19T00:57:40Z"
  },
  {
    "title": "‘No Kings’ Protesters Take to the Streets Against Trump’s ‘Authoritarianism’",
    "description": "In the largest series of demonstrations against the administration and its policies to date, participants express fear and anger at America’s political trajectory",
    "link": "http://www.rollingstone.com/politics/politics-features/no-kings-protesters-against-trump-authoritarianism-dc-1235449984/",
    "timestamp": "2025-10-19T00:55:24Z"
  },
  {
    "title": "Israel says Hamas hands over '2 coffins of deceased hostages' from Gaza",
    "description": "Hamas has returned the remains of two more deceased hostages from Gaza. Prime Minister Netanyahu is urging Hamas to expedite the handover of all remaining hostages. The Rafah crossing remains closed, impacting aid flow. Both sides accuse each other of ceasefi…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-says-hamas-hands-over-2-coffins-of-deceased-hostages-from-gaza/articleshow/124681050.cms",
    "timestamp": "2025-10-19T00:52:55Z"
  },
  {
    "title": "'You ok?': MAGA called out for complaining about 'old white people' at anti-Trump protests",
    "description": "Multiple MAGA commentators noted an abundance of older people protesting Donald Trump at \"No Kings\" protests across the country, leading one ex-MSNBC host to call them out.Tony Ortiz (Current Revolt) posted a video on X on Saturday, writing, \"Currently at the…",
    "link": "https://www.rawstory.com/maga-old-white-people/",
    "timestamp": "2025-10-19T00:50:58Z"
  },
  {
    "title": "‘No Kings’ protests against Trump bring a street party vibe to cities nationwide",
    "description": "WASHINGTON (AP) — Large crowds of protesters marched and rallied in cities across the U.S. Saturday for “ No Kings ” demonstrations decrying what participants see as the government’s swift drift into authoritarianism under President Donald Trump. People carry…",
    "link": "https://freerepublic.com/focus/f-chat/4347228/posts",
    "timestamp": "2025-10-19T00:50:04Z"
  },
  {
    "title": "‘No Kings’ protests against Trump bring a street party vibe to cities nationwide",
    "description": "WASHINGTON (AP) — Large crowds of protesters marched and rallied in cities across the U.S. Saturday for “ No Kings ” demonstrations decrying what participants see as the government’s swift drift into authoritarianism under President Donald Trump. People carry…",
    "link": "https://freerepublic.com/focus/f-news/4347228/posts",
    "timestamp": "2025-10-19T00:50:04Z"
  },
  {
    "title": "State Department Warns of 'Credible Reports' Hamas Planning Attack on Gaza",
    "description": "The Department of State issued a warning there were \"credible reports\" Hamas was planning an attack on the people of Gaza, which would violate a ceasefire agreement between Hamas and Israel.\nThe post State Department Warns of ‘Credible Reports’ Hamas Planning…",
    "link": "https://www.breitbart.com/politics/2025/10/18/state-department-warns-of-credible-reports-hamas-planning-attack-on-gaza/",
    "timestamp": "2025-10-19T00:49:44Z"
  },
  {
    "title": "Bowen Yang To Miss ‘SNL’ Tonight",
    "description": "Saturday Night Live repertory player Bowen Yang is set to miss tonight’s taping of the late-night sketch show, the comedian and actor confirmed on his Instagram Story. He wrote, “missing the show tonight but it will be sooooo fun sab is amazing,” referencing …",
    "link": "http://deadline.com/2025/10/bowen-yang-missing-snl-show-academy-museum-gala-1236591278/",
    "timestamp": "2025-10-19T00:47:05Z"
  },
  {
    "title": "US warns Hamas planning attack on Palestinian civilians in apparent violation of Gaza ceasefire",
    "description": "The US State Department has received credible reports that Hamas might break the ceasefire. Such an attack on Palestinian civilians would be a grave violation of the agreement. The US stated measures will be taken to protect Gazans and preserve the ceasefire.…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-warns-hamas-planning-attack-on-palestinian-civilians-in-apparent-violation-of-gaza-ceasefire/articleshow/124681020.cms",
    "timestamp": "2025-10-19T00:42:07Z"
  },
  {
    "title": "All you protest kids",
    "description": "Today has been one of the largest mass mobilizations in American history: Americans across all 50 states marched in protests against the Trump administration on Saturday, aligning behind a message that the country is sliding into authoritarianism and there sh…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/all-you-protest-kids",
    "timestamp": "2025-10-19T00:31:16Z"
  },
  {
    "title": "Mamdani Campaigns with Unindicted Co-Conspirator in 1993 WTC Bombing",
    "description": "New York City Democratic Party mayoral nominee Zohran Mamdani campaigned Friday with radical Imam Siraj Wahhaj, an Islamist who was an unindicted co-conspirator in the 1993 World Trade Center bombing.\nThe post Mamdani Campaigns with Unindicted Co-Conspirator …",
    "link": "https://www.breitbart.com/politics/2025/10/18/mamdani-campaigns-with-unindicted-co-conspirator-in-1993-wtc-bombing/",
    "timestamp": "2025-10-19T00:30:39Z"
  },
  {
    "title": "No Kings protest in the US",
    "description": "Protesters - many with children and pets in tow - took to the streets en masse for \"No Kings\" rallies across the United States on Saturday, denouncing what they view as authoritarian tendencies and unbridled corruption of U.S. President Donald Trump. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/10/19/no-kings-protest-in-the-us",
    "timestamp": "2025-10-19T00:30:00Z"
  },
  {
    "title": "WGA West President Michele Mulroney Delivers Speech At No Kings Protest: “When Our Words Are Powerful, We Cannot Be Silenced”",
    "description": "Recently appointed Writers Guild of America West President Michele Mulroney delivered a rousing speech at the No Kings protest in Los Angeles, decrying President Donald Trump and his administration’s recent actions curtailing Hollywood writers’ freedom of exp…",
    "link": "http://deadline.com/2025/10/wga-west-president-michele-mulroney-no-kings-protest-speech-1236591269/",
    "timestamp": "2025-10-19T00:30:00Z"
  },
  {
    "title": "WATCH: Cory Booker Joins ‘No Kings’ Protest, Chants ‘This Is What Democracy Looks Like’",
    "description": "Sen. Cory Booker (D-NJ) filmed himself leading a “No Kings” protest chant in California, joining a growing list of prominent Democrats taking part in the nationwide demonstrations against President Donald Trump.\nThe post WATCH: Cory Booker Joins ‘No Kings’ Pr…",
    "link": "https://www.breitbart.com/politics/2025/10/18/watch-cory-booker-joins-no-kings-protest-chants-this-is-what-democracy-looks-like/",
    "timestamp": "2025-10-19T00:29:03Z"
  },
  {
    "title": "Health officials warn of possible measles exposure at Sea-Tac Airport - NewsBreak",
    "description": "Public Health – Seattle & King County confirmed a measles case in a traveler who passed through Seattle-Tacoma International Airport on Oct. 13, 2025. Poss",
    "link": "https://www.newsbreak.com/share/4298434789334-health-officials-warn-of-possible-measles-exposure-at-sea-tac-airport?s=a2&amp;share_destination_id=MzQwNDYxMjY3LTE3NjA4MzMzNTM0MjA%3D&amp;pd=0N2XWl7j&amp;hl=en_US&amp;send_time=1760833353&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.42.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-10-19T00:22:44Z"
  },
  {
    "title": "Crowds gather across US for anti-Trump protests",
    "description": "Millions of Americans gather across the United States to protest the administration of US President Donald Trump, for the \"No Kings\" protests.More to come......",
    "link": "https://biztoc.com/x/1b53230fb1aa13af",
    "timestamp": "2025-10-19T00:13:00Z"
  },
  {
    "title": "Speaker Johnson blasts Chuck Schumer for 'shameless' support of 'No Kings' protests",
    "description": "House Speaker Mike Johnson, R-La., slammed Senate Minority Leader Chuck Schumer, D-N.Y., Saturday, accusing him of siding with communists by backing the nationwide \"No Kings\" protests—a sweeping movement against the Trump administration. The social media smac…",
    "link": "https://freerepublic.com/focus/f-chat/4347215/posts",
    "timestamp": "2025-10-19T00:00:01Z"
  },
  {
    "title": "US alleges reports of imminent Hamas ceasefire violation",
    "description": "The US State Department said it had \"credible reports\" that Palestinian armed group Hamas was planning an imminent attack against civilians in Gaza, a move the US said would be a \"ceasefire violation.\"",
    "link": "https://www.rte.ie/news/middle-east/2025/1019/1539324-middle-east/",
    "timestamp": "2025-10-18T23:57:47Z"
  },
  {
    "title": "State Department warns Hamas may violate ceasefire with attack on Palestinian civilians",
    "description": "Hamas faces potential consequences after the U.S. State Department says the group plans to violate its ceasefire with Israel by attacking civilians in Gaza.",
    "link": "https://www.foxnews.com/world/state-department-warns-hamas-may-violate-ceasefire-attack-palestinian-civilians",
    "timestamp": "2025-10-18T23:55:03Z"
  },
  {
    "title": "‘Proud to Say That the People out Here are Antifa’: No Kings Organizer Brags to MSNBC",
    "description": "A No Kings organizer said if Mike Johnson wants to brand them as Antifa, that's fine, because she is \"proud\" to fight back against Trump's \"fascist government.\"\nThe post ‘Proud to Say That the People out Here are Antifa’: No Kings Organizer Brags to MSNBC fir…",
    "link": "https://www.mediaite.com/media/proud-to-say-that-the-people-out-here-are-antifa-no-kings-organizer-brags-to-msnbc/",
    "timestamp": "2025-10-18T23:49:45Z"
  },
  {
    "title": "Alan Dershowitz breaks down harsh Middle East reality after Gaza peace deal [3:54]",
    "description": "Constitutional lawyer Alan Dershowitz discusses President Donald Trump's trip to the Middle East after Israel and Hamas agreed to the first phase of his peace deal on 'The Evening Edit.' Alan Dershowitz breaks down harsh Middle East reality after Gaza peace d…",
    "link": "https://freerepublic.com/focus/f-chat/4347212/posts",
    "timestamp": "2025-10-18T23:39:09Z"
  },
  {
    "title": "No Kings Rallies Get Big News Coverage (NYC, Dallas, Boston & More)",
    "description": "With marches and rallies taking place in more than 2500 locations nationwide and around the world (including a flagship rally in Washington, DC), local & national broadcast, cable, and online news agencies jumped on coverage of the second \"No Kings\" rally of …",
    "link": "https://bleedingcool.com/tv/no-kings-rallies-get-big-news-coverage-nyc-dallas-boston-more/",
    "timestamp": "2025-10-18T23:37:06Z"
  },
  {
    "title": "2026 Health Insurance Rates Released; This Is GOP's Fault",
    "description": "More than 20 million Americans are expected to see their health insurance premiums more than double next year after Republicans refused to extend a tax credit for those who purchase health insurance on the Affordable Care Act marketplace.\nAnd as the GOP remai…",
    "link": "https://crooksandliars.com/2025/10/2026-health-insurance-rates-released-gops",
    "timestamp": "2025-10-18T23:36:54Z"
  },
  {
    "title": "MAGA Lawmaker Loses Dad Of The Year Award",
    "description": "Rep Randy Fine was speaking to a group of home-schooled children - apparently the only group of people that won't look at him in absolute disgust - when one of the little kids asked him who the coolest person in his phone was. It went downhill from there:\n\n“W…",
    "link": "https://crooksandliars.com/2025/10/maga-lawmaker-loses-dad-year-award",
    "timestamp": "2025-10-18T23:36:32Z"
  },
  {
    "title": "Glenn Close, Spike Lee, Jean Smart & More Voice Support For No Kings Protests: “The Most Patriotic Thing That You Can Do”",
    "description": "As millions of Americans take to the streets — from New York to Los Angeles, Washington, D.C. to Chicago — Hollywood is voicing its support for the nationwide No Kings protests, with prominent figures like Glenn Close, Spike Lee, Jean Smart and many others pr…",
    "link": "http://deadline.com/2025/10/no-kings-protests-hollywood-support-glenn-close-spike-lee-1236591263/",
    "timestamp": "2025-10-18T23:32:28Z"
  },
  {
    "title": "Mayors, Political Leaders Speak at 'No Kings' Nationwide Protests",
    "description": "Hundreds of thousands of people took to the streets across the country to voice their frustration with President Donald Trump.",
    "link": "https://biztoc.com/x/ab30f5800329f166",
    "timestamp": "2025-10-18T23:28:15Z"
  },
  {
    "title": "Bill O’Reilly Growls at Pete Hegseth’s Pentagon Press Restrictions: ‘Craziness … It’s Not Going to Hold’ | Video",
    "description": "The \"No Spin News\" host also notes that Donald Trump has \"changed\" on the issue of requiring permission to publish information\nThe post Bill O’Reilly Growls at Pete Hegseth’s Pentagon Press Restrictions: ‘Craziness … It’s Not Going to Hold’ | Video appeared f…",
    "link": "https://www.thewrap.com/bill-oreilly-growls-at-pete-hegseths-pentagon-press-restrictions-craziness-its-not-going-to-hold-video/",
    "timestamp": "2025-10-18T23:25:25Z"
  },
  {
    "title": "Newsom clashes with White House over Marine Corps anniversary celebration highway closure",
    "description": "The White House accused California Governor Gavin Newsom of distorting facts after he blamed the Trump administration for highway delays due to the Marine Corps anniversary celebration.",
    "link": "https://www.foxnews.com/politics/newsom-clashes-white-house-marine-corps-anniversary-celebration-highway-closure",
    "timestamp": "2025-10-18T23:18:30Z"
  }
]