[
  {
    "title": "'Convicted US Felon To Arrive In Scotland'",
    "description": "According to Wikipedia, \"The National is a Scottish daily newspaper owned by Newsquest. It began publication on 24 November 2014, and was the first daily newspaper in Scotland to support Scottish independence.\" With that in mind, an edgy front page that recei…",
    "link": "https://crooksandliars.com/2025/07/convicted-us-felon-arrive-scotland",
    "timestamp": "2025-07-26T15:10:07Z"
  },
  {
    "title": "Trump Quip On Infant Daughter’s Future Breasts Goes Viral Amid Flood Of Sex-Creep Videos, Epstein Uproar",
    "description": "Unearthed video of Trump commenting on then-infant Tiffany Trump's potential breast size went viral amid the furor over the “Epstein Files.\"\nThe post Trump Quip On Infant Daughter’s Future Breasts Goes Viral Amid Flood Of Sex-Creep Videos, Epstein Uproar firs…",
    "link": "https://www.mediaite.com/media/news/trump-quip-on-infant-daughters-future-breasts-goes-viral-amid-flood-of-sex-creep-videos-epstein-uproar/",
    "timestamp": "2025-07-26T15:09:04Z"
  },
  {
    "title": "Jig Loading: Donald Trump Says He Hasn’t Thought About Pardoning Ghislaine Maxwell, But Adds “I’m Allowed To Do It”",
    "description": "Is Donald Trump considering pardoning convicted child sex trafficker Ghislaine Maxwell in exchange for distance from the Epstein case? Many believe so.",
    "link": "https://hiphopwired.com/playlist/donald-trump-possible-ghislaine-maxwell-pardon-jeffrey-epstein-reactions/",
    "timestamp": "2025-07-26T15:08:45Z"
  },
  {
    "title": "Trump slams Europe over immigration, says ‘horrible invasion’ is killing the continent",
    "description": "President Donald Trump arrived in Scotland on Friday and wasted little time lashing out at European leaders over mass immigration, warning that the crisis is “killing\" the continent and calling it a “horrible invasion.\"",
    "link": "https://www.foxnews.com/world/trump-slams-europe-over-immigration-says-horrible-invasion-killing-continent",
    "timestamp": "2025-07-26T15:05:35Z"
  },
  {
    "title": "President Trump Lands in Britain and Immediately Torches Europe For Killing Itself With Immigration",
    "description": "Immigration is killing Europe, warned U.S. President Donald Trump as he arrived in northern Britain for a four-day visit to Scotland. President Donald Trump touched down at Glasgow Prestwick Airport in Scotland on Friday evening and briefly delivered on-camer…",
    "link": "https://freerepublic.com/focus/f-news/4330880/posts",
    "timestamp": "2025-07-26T15:04:48Z"
  },
  {
    "title": "Ghislaine Maxwell Plays LET'S MAKE A DEAL!",
    "description": "She's the first contestant on YOU KIDDING US WITH THIS?",
    "link": "https://www.wonkette.com/p/hot-pedo-coverup-summer",
    "timestamp": "2025-07-26T15:02:08Z"
  },
  {
    "title": "Trump says he'll 'give you a list' as Epstein pressure mounts",
    "description": "Donald Trump pointed fingers at a former president, the ex-head of Harvard and 'hedge fund guys' when quizzed about Jeffrey Epstein's alleged list.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-epstein-list-comment-bill-clinton-larry-summers-936083-20250726",
    "timestamp": "2025-07-26T15:01:30Z"
  },
  {
    "title": "Don plays golf while protesters take to streets...",
    "description": null,
    "link": "https://apnews.com/article/trump-scotland-protests-golf-starmer-tariffs-1c9b7265e56c6ec01821e1c33eb9de14",
    "timestamp": "2025-07-26T15:00:03Z"
  },
  {
    "title": "Trump Can Never Accuse Obama of Anything",
    "description": "The liberal Poynter Institute is very upset at President Donald Trump for suggesting former President Barack Obama was guilty of “treason” for organizing the campaign... Read More\nThe post Trump Can Never Accuse Obama of Anything appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/07/26/trump-can-never-accuse-obama-of-anything/",
    "timestamp": "2025-07-26T15:00:00Z"
  },
  {
    "title": "Asean News Headlines at 10pm on Saturday (July 26, 2025)",
    "description": "Here's a look at the news highlights from Asean countries in the Star-AseanPlus section for Saturday (July 26, 2025) Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/26/asean-news-headlines-at-10pm-on-saturday-july-26-2025",
    "timestamp": "2025-07-26T14:48:00Z"
  },
  {
    "title": "Maggie Haberman And Kaitlan Collins Call Out Trump Over New Epstein Contradictions: ‘All Over The Map’",
    "description": "CNN's Kaitlan Collins and Maggie Haberman called out President Donald Trump’s latest contradictory messages about Jeffrey Epstein.\nThe post Maggie Haberman And Kaitlan Collins Call Out Trump Over New Epstein Contradictions: ‘All Over The Map’ first appeared o…",
    "link": "https://www.mediaite.com/media/news/maggie-haberman-and-kaitlan-collins-call-out-trump-over-new-epstein-contradictions-all-over-the-map/",
    "timestamp": "2025-07-26T14:47:10Z"
  },
  {
    "title": "Protesters Take To The Streets In Scotland Over Trump’s Golf Course Visit",
    "description": "Hundreds of demonstrators gathered on the cobblestone and tree-lined street in front of the U.S. Consulate about 100 miles away in Edinburgh.",
    "link": "https://www.huffpost.com/entry/trump-plays-golf-scotland-protesters-take-streets_n_6884e87be4b0d2b6e053768c",
    "timestamp": "2025-07-26T14:45:08Z"
  },
  {
    "title": "Il presidente Trump in visita in Scozia",
    "description": "epa12263712 US President Donald J. Trump plays at Trump Turnberry golf course during a private visit in Turnberry, Scotland, Britain, 26 July 2025. (ANSA)",
    "link": "https://www.ansa.it/sito/photogallery/primopiano/2025/07/26/il-presidente-trump-in-visita-in-scozia_272f304f-438a-46bb-b47a-22ee68c2c7a5.html",
    "timestamp": "2025-07-26T14:42:39Z"
  },
  {
    "title": "Trump Is Trying to Deflect Focus From the Epstein Case—Can He?",
    "description": "How a once-fringe conspiracy theory became a spiraling controversy",
    "link": "https://www.theatlantic.com/national/archive/2025/07/epstein-trump-washington-week/683680/",
    "timestamp": "2025-07-26T14:42:02Z"
  },
  {
    "title": "Texas Democrats escalate fight against Republican-led redistricting efforts with Pritzker, Newsom meetings",
    "description": "Texas Democrats escalate fight against Republican-led redistricting efforts with Pritzker, Newsom meetingsgo.com",
    "link": "https://abcnews.go.com/Politics/texas-democrats-escalate-fight-republican-led-redistricting-efforts/story?id=124075648",
    "timestamp": "2025-07-26T14:25:46Z"
  },
  {
    "title": "Lin-Manuel Miranda to Turn 10th Anniversary of 'Hamilton' Play into an Illegal Immigration Fundraiser",
    "description": "Lin-Manuel Miranda plans to turn the 10th anniversary of the Broadway play \"Hamilton\" into a fundraiser for illegal immigration services.\nThe post Lin-Manuel Miranda to Turn 10th Anniversary of ‘Hamilton’ Play into an Illegal Immigration Fundraiser appeared f…",
    "link": "https://www.breitbart.com/entertainment/2025/07/26/lin-manuel-miranda-to-turn-10th-anniversary-of-hamilton-play-into-an-illegal-immigration-fundraiser/",
    "timestamp": "2025-07-26T14:25:19Z"
  },
  {
    "title": "Shopify Stock Is Now An AI Play, But Google May Pose A Threat",
    "description": "After President Donald Trump launched the first of many tariff hikes in February, Shopify (SHOP) got right to work helping its merchants navigate the rapidly shifting trade currents. Over the following weekend, the e-commerce software and payments platform ad…",
    "link": "https://biztoc.com/x/b0e6b8f6846302e5",
    "timestamp": "2025-07-26T14:24:38Z"
  },
  {
    "title": "FTC firings take spotlight in Trump's fight to erase independence of agencies",
    "description": "Former FTC commissioner Slaughter continues legal fight against her 'illegal firing' by President Trump, testing limits of presidential authority over agencies.",
    "link": "https://www.foxnews.com/politics/ftc-firings-take-spotlight-trumps-fight-erase-independence-agencies",
    "timestamp": "2025-07-26T14:22:29Z"
  },
  {
    "title": "Ethereum ETFs Massively Outpace Bitcoin Funds—Why ETH Demand Is Surging",
    "description": "Ethereum ETFs flipped their Bitcoin counterparts this week, adding $1.8 billion in ETH while BTC funds saw a fraction of that tally.",
    "link": "https://decrypt.co/331906/ethereum-etfs-massively-outpace-bitcoin-funds",
    "timestamp": "2025-07-26T14:22:18Z"
  },
  {
    "title": "NASA To Downsize By More Than 20 Percent",
    "description": "The National Aeronautics and Space Administration (NASA) will cut over 20 percent of its workforce under President Donald Trump's plan to shrink the federal government.",
    "link": "https://dailycaller.com/2025/07/26/nasa-downsize-more-than-20-percent-donald-trump-doge-deferred-resignation-program/",
    "timestamp": "2025-07-26T14:21:40Z"
  },
  {
    "title": "Trump Just Activated the Last Hard Drive – Why the Maxwell Files Have DC in Full Panic Mode",
    "description": "Nobody saw this coming. I mean nobody. Yesterday, the Times ran another electrifying story headlined, “After Ghislaine Maxwell Interview, Concerns Mount Over Possibility of a Trump Pardon.” Pardon concerns mount! In the passive voice! By themselves! Yesterday…",
    "link": "https://freerepublic.com/focus/f-bloggers/4330874/posts",
    "timestamp": "2025-07-26T14:20:19Z"
  },
  {
    "title": "‘He’s Daring Us To Fire Him.’ How Stephen Colbert Is Allegedly Rubbing Execs The Wrong Way Following The Late Show’s Cancellation",
    "description": "Bosses at the Eye Network are reportedly not happy.",
    "link": "https://www.cinemablend.com/television/how-stephen-colbert-allegedly-rubbing-execs-wrong-way-the-late-show-cancellation",
    "timestamp": "2025-07-26T14:20:02Z"
  },
  {
    "title": "Trump Pals Spin Ghislaine Maxwell as ‘Victim’ in Batshittiest Epstein Twist Yet",
    "description": "Trumpworld spins Ghislaine Maxwell as a victim—ignoring her conviction for sex trafficking—as DOJ eyes deal that could shield Trump and target Democrats.\nThe post Trump Pals Spin Ghislaine Maxwell as ‘Victim’ in Batshittiest Epstein Twist Yet first appeared o…",
    "link": "https://www.mediaite.com/opinion/trump-pals-spin-ghislaine-maxwell-as-victim-in-batshittiest-epstein-twist-yet/",
    "timestamp": "2025-07-26T14:17:01Z"
  },
  {
    "title": "Donald Trump Hits Out At Europe: 'Get Your Act Together'",
    "description": "U.S. president told reporters in Scotland that immigration is \"killing Europe.\"",
    "link": "https://biztoc.com/x/b7ae6aa9b418b90b",
    "timestamp": "2025-07-26T14:13:29Z"
  },
  {
    "title": "Anthony Scaramucci May Not Have Seen Eye-To-Eye With Trump On Crypto, But Called His Second Term, 'The Greatest Comeback In Political History'",
    "description": "Last week, former White House Communications Director Anthony Scaramucci offered a surprising assessment of Donald Trump, calling his political comeback historic and cautioning critics not to confuse his communication style with a lack of intelligence.\nWhat H…",
    "link": "https://biztoc.com/x/f3a2cfff27fd9f39",
    "timestamp": "2025-07-26T14:13:22Z"
  },
  {
    "title": "An AI-Created Nine Step Process for President Trump to Control the Media Narrative",
    "description": "I've been having a long-running conversation with the Perplexity Pro AI about all the recent Democrat troubles they've been experiencing, including district court overreach, illegal immigration and border control, the Biden/Harris administration and health co…",
    "link": "https://freerepublic.com/focus/f-news/4330873/posts",
    "timestamp": "2025-07-26T14:09:31Z"
  },
  {
    "title": "Dems Quickly Delete Widely-Mocked Groceries Post After Realizing It's a Massive Self-Own",
    "description": "Democrats were trying to say that President Donald Trump caused high inflation, but they made the opposite point instead.",
    "link": "https://www.westernjournal.com/dems-quickly-delete-widely-mocked-groceries-post-realizing-massive-self/",
    "timestamp": "2025-07-26T14:07:43Z"
  },
  {
    "title": "Donald Trump Hits Out At Europe: 'Get Your Act Together'",
    "description": "U.S. president told reporters in Scotland that immigration is \"killing Europe.\"",
    "link": "https://www.newsweek.com/trump-immigration-scotland-visit-2104472",
    "timestamp": "2025-07-26T14:06:11Z"
  },
  {
    "title": "Trump tees off in Scotland as protests, backlash grow",
    "description": "The president’s “working trip” sparked large-scale protests, local controversy, and a few brutal front pages",
    "link": "https://www.salon.com/2025/07/26/trump-tees-off-in-scotland-as-protests-backlash-grow/",
    "timestamp": "2025-07-26T14:04:19Z"
  },
  {
    "title": "NASA says it will lose about 20 percent of its workforce as a result of Trump cuts",
    "description": "Despite the cuts, Trump still wants NASA to beat China by getting to Mars first.",
    "link": "https://www.thejournal.ie/nsa-cuts-trump-6774660-Jul2025/",
    "timestamp": "2025-07-26T14:03:34Z"
  },
  {
    "title": "Obama and Democrats don’t get it: Masculinity is not the problem. Erasing it is",
    "description": "The political impact of challenging masculinity, as male voters abandon the Democratic party following rhetoric that questions men's roles as providers and protectors.",
    "link": "https://www.foxnews.com/opinion/obama-democrats-dont-get-it-masculinity-not-problem-erasing",
    "timestamp": "2025-07-26T14:00:42Z"
  },
  {
    "title": "WATCH: Gabbard's Obama bombshell has GOP demanding accountability while Dems question timing as 'distraction'",
    "description": "GOP senators are demanding accountability amid allegations Obama officials tried to sabotage Trump's 2016 election, but Democrats question the timing and credibility.",
    "link": "https://www.foxnews.com/politics/watch-gabbards-obama-bombshell-has-gop-demanding-accountability-while-dems-question-timing-distraction",
    "timestamp": "2025-07-26T14:00:30Z"
  },
  {
    "title": "Report: ‘Media Matters’ Barely Hanging on as Lawsuits, Infighting, and Mounting Debts Take Their Toll",
    "description": "\"Media Matters has also been frozen out by some allies. And it has faced plummeting staff morale, rising infighting and security concerns.\"\nThe post Report: ‘Media Matters’ Barely Hanging on as Lawsuits, Infighting, and Mounting Debts Take Their Toll first ap…",
    "link": "https://legalinsurrection.com/2025/07/report-media-matters-barely-hanging-on-as-lawsuits-infighting-and-mounting-debts-take-their-toll/",
    "timestamp": "2025-07-26T14:00:07Z"
  },
  {
    "title": "‘Nowhere Else to Go’: SF Families Protest Kaiser’s New Limits on Gender-Affirming Care",
    "description": "The rally at Kaiser Permanente’s San Francisco Medical Center came after the California health care giant said it was pausing gender-affirming surgeries for patients younger than 19.",
    "link": "https://www.kqed.org/news/12049666/nowhere-else-to-go-sf-families-protest-kaisers-new-limits-on-gender-affirming-care",
    "timestamp": "2025-07-26T14:00:04Z"
  },
  {
    "title": "Tax Breaks: The All Work And A Little Bit Of Play Edition",
    "description": "Plus: Employees could lose a work perk (thanks to the One Big Beautiful Bill Act), new retirement account penalty rules, deducting gambling losses, IRS employee count keeps dropping, filing deadlines, tax trivia and more.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/07/26/tax-breaks-the-all-work-and-a-little-bit-of-play-edition/",
    "timestamp": "2025-07-26T14:00:00Z"
  },
  {
    "title": "Why Trump’s cost cutters are wise to have Reagan’s ‘one-man DOGE’ Don Devine on speed dial",
    "description": "Don Devine made bold, even shocking moves as Ronald Reagan’s Office of Personnel Management head more than 40 years ago. Now he's a mentor to a new generation.",
    "link": "https://nypost.com/2025/07/26/opinion/trumps-cost-cutters-are-wise-to-listen-to-reagans-don-devine/",
    "timestamp": "2025-07-26T14:00:00Z"
  },
  {
    "title": "Understanding Israel and Trump’s conflicting agendas in Syria",
    "description": "A common cliche used by American politicians to describe the U.S.-Israel relationship is that “there is no daylight between the two.” But this is clearly not true when it comes to Syria.",
    "link": "https://mondoweiss.net/2025/07/understanding-israel-and-trumps-conflicting-agendas-in-syria/",
    "timestamp": "2025-07-26T14:00:00Z"
  },
  {
    "title": "US Democrats have worst poll numbers since Clinton era – WSJ",
    "description": "Democrats have their lowest approval in 35 years, with the GOP preferred even on issues where Trump polls poorly, a WSJ poll has shown Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622029-us-democrats-low-ratings/",
    "timestamp": "2025-07-26T13:59:51Z"
  },
  {
    "title": "Immigration judges fired by Trump administration say they will fight back",
    "description": "Federal immigration judges fired by the Trump administration are filing appeals, pursuing legal action and speaking out in an unusually public campaign to fight for their jobs",
    "link": "https://abcnews.go.com/US/wireStory/immigration-judges-fired-trump-administration-fight-back-124095072",
    "timestamp": "2025-07-26T13:58:25Z"
  },
  {
    "title": "Trump plays golf in Scotland while protesters take to the streets and decry his visit",
    "description": "President Donald Trump has played golf at his course on Scotland’s coast while protesters around the country took to the streets to decry his visit and accuse United Kingdom leaders of pandering to the American",
    "link": "https://abcnews.go.com/International/wireStory/trump-plays-golf-scotland-protesters-streets-decry-visit-124094049",
    "timestamp": "2025-07-26T13:58:14Z"
  },
  {
    "title": "The Real January 6 Wasn’t at the Capitol – It Was at Trump Tower",
    "description": "January 6 has become a date of hallowed pagan sacredness to the ruling class – a supposed talisman marking chaos, a shorthand for “threats to democracy.” But the media, predictably, has focused on the wrong January. And the wrong threat. Because the real Janu…",
    "link": "https://freerepublic.com/focus/f-chat/4330871/posts",
    "timestamp": "2025-07-26T13:57:22Z"
  },
  {
    "title": "Trump able to enjoy round of golf at Turnberry as protesters speak out from hundreds of miles away",
    "description": "The US president has come to Turnberry to play but it appears as if anti-Trump protesters have not.",
    "link": "https://news.sky.com/story/donald-trump-able-to-enjoy-round-of-golf-at-turnberry-as-protesters-speak-out-from-hundreds-of-miles-away-13402149",
    "timestamp": "2025-07-26T13:54:00Z"
  },
  {
    "title": "'I'm sure he doesn't like that!' MSNBC hosts lose it over AI-generated parody Trump ad",
    "description": "The co-hosts of MSNBC's \"The Weekend\" dissolved in laughter on Saturday morning after sharing a clip from the recent \"South Park\" episode that brutally mocked Donald Trump.Then they totally lost it over a clip they could not show in which an AI-generated Trum…",
    "link": "https://www.rawstory.com/trump-south-park-2673764703/",
    "timestamp": "2025-07-26T13:50:28Z"
  },
  {
    "title": "Trump flees Washington controversies for golf-heavy trip to Scotland (CNN)",
    "description": "CNN:\nTrump flees Washington controversies for golf-heavy trip to Scotland  —  Fleeing Washington's oppressive humidity and nonstop questions over heated controversies, President Donald Trump is once again taking weekend refuge at his golf clubs — this time mo…",
    "link": "https://www.memeorandum.com/250726/p16",
    "timestamp": "2025-07-26T13:50:01Z"
  },
  {
    "title": "FAFO: Kansas And Missouri Lose Funding For Power Transmission Line",
    "description": "Kansas and Missouri, two states that heavily voted for Trump, are in the Finding Out part of FAFO. They just lost funding for a HUGE energy project that would have been incredibly beneficial for both states, but Donald Trump's administration has decided it is…",
    "link": "https://crooksandliars.com/2025/07/fafo-kansas-and-missouri-lose-funding",
    "timestamp": "2025-07-26T13:47:09Z"
  },
  {
    "title": "Donald Trump's Disapproval Rating 'Stuck'",
    "description": "Donald Trump's support has hit a ceiling, with his approval ratings stabilizing but showing little sign of growth.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-polls-2104468",
    "timestamp": "2025-07-26T13:46:22Z"
  },
  {
    "title": "Psychologists predicted Trump’s 2024 win before a single vote was cast — here’s how they did it",
    "description": "Before any ballots were cast, Penn researchers say they correctly predicted Trump’s 2024 victory by analyzing his upbeat rhetoric in the final weeks of the race. A surge in optimism pointed to his win over Kamala Harris, a new study claims.",
    "link": "https://nypost.com/2025/07/26/us-news/how-psychologists-called-trumps-2024-win-based-on-one-factor/",
    "timestamp": "2025-07-26T13:44:11Z"
  },
  {
    "title": "Report: Trump halted Israeli strikes aimed at toppling Iranian regime",
    "description": "An Israeli source also told The Washington Post that the Israeli offensive delayed Iran's nuclear program by one to two years, adding, 'Iran is no longer a threshold nuclear state'",
    "link": "https://www.haaretz.com/israel-news/2025-07-26/ty-article/report-trump-halted-israeli-strikes-aimed-at-toppling-iranian-regime/00000198-45e9-d675-a79a-67efca290000",
    "timestamp": "2025-07-26T13:43:47Z"
  },
  {
    "title": "Blackburn Calls on Media to Return Pulitzer Prizes Awarded for Russia Collusion Hoax",
    "description": "Friday on FNC's \"Hannity,\" Sen. Marsha Blackburn (R-TN) took aim at the media for its involvement in the so-called Russia collusion hysteria.\nThe post Blackburn Calls on Media to Return Pulitzer Prizes Awarded for Russia Collusion Hoax appeared first on Breit…",
    "link": "https://www.breitbart.com/clips/2025/07/26/blackburn-calls-on-media-to-return-pulitzer-prizes-awarded-for-russia-collusion-hoax/",
    "timestamp": "2025-07-26T13:42:55Z"
  },
  {
    "title": "Goodbye Colbert, hello Bari Weiss? Paramount stands at fork in the road after finally winning FCC approval",
    "description": "After the merger's Aug. 7 closing date, the new leaders will be watched most closely for how they deal with CBS News, particularly given the $16 million settlement with Trump.",
    "link": "https://fortune.com/2025/07/26/stephen-colbert-bari-weiss-paramount-global-fcc-approval-news-media/",
    "timestamp": "2025-07-26T13:42:32Z"
  },
  {
    "title": "Ravens Coach Pushes Back Against Goonish Reporter",
    "description": "The leftism infesting professional sports has driven some of us to find other uses for our time. But it’s nice to know there are still countermoonbats in the NFL — like Baltimore Ravens Head Coach John Harbaugh. A reporter presented this as a question regardi…",
    "link": "https://moonbattery.com/ravens-coach-pushes-back-against-goonish-reporter/",
    "timestamp": "2025-07-26T13:42:30Z"
  },
  {
    "title": "Hungarian Prime Minister Warns About 'Menacing Shadow' of World War 3",
    "description": "MOSCOW (Sputnik) - Hungarian Prime Minister Viktor Orban warned on Saturday that the menacing shadow of a new global war was looming over the world, adding that war was already a reality in Europe.",
    "link": "https://sputnikglobe.com/20250726/hungarian-prime-minister-warns-about-menacing-shadow-of-world-war-3-1122495406.html",
    "timestamp": "2025-07-26T13:41:31Z"
  },
  {
    "title": "Trump started Scotland visit with golf at Turnberry",
    "description": "United States President Donald Trump began his five-day private visit to Scotland by golfing at his Turnberry resort on Saturday.\nThe US president arrived at Prestwick Airport on Friday night, accomp...",
    "link": "https://biztoc.com/x/cb3da1e75cd2c97d",
    "timestamp": "2025-07-26T13:40:05Z"
  },
  {
    "title": "‘Not Pedophile Island!’ MSNBC Host Relishes Brutal Trump-Bashing Greeting Him In Scotland",
    "description": "MSNBC host Jen Psaki relished the brutal trolling that awaited Trump as he \"escaped\" to Scotland amid the ongoing uproar over Jeffrey Epstein.\nThe post ‘Not Pedophile Island!’ MSNBC Host Relishes Brutal Trump-Bashing Greeting Him In Scotland first appeared on…",
    "link": "https://www.mediaite.com/media/news/not-pedophile-island-msnbc-host-relishes-brutal-trump-bashing-greeting-him-in-scotland/",
    "timestamp": "2025-07-26T13:36:39Z"
  },
  {
    "title": "Cotton: DNI, CIA, FBI Need to Put Out as Much Information as Possible as Quickly as Possible on Russia Hoax",
    "description": "Friday on Fox News Channel's \"Hannity,\" Sen. Tom Cotton (R-AR), called on the intelligence community to release \"as much information as possible\" on allegations the Obama administration worked to manufacture the narrative that the 2016 Trump presidential camp…",
    "link": "https://www.breitbart.com/clips/2025/07/26/cotton-dni-cia-fbi-need-to-put-out-as-much-information-as-possible-as-quickly-as-possible-on-russia-hoax/",
    "timestamp": "2025-07-26T13:33:51Z"
  },
  {
    "title": "President Trump and His Team Respond After Formerly Anti-Woke South Park Thrills the Left By Launching Absolutely Disgusting Attacks on Trump (VIDEO)",
    "description": "The formerly anti-woke adult cartoon South Park decided to go hard-core left and thrill liberals earlier this week in its season premiere, targeting President Trump in the most disgusting way imaginable.\nThe post President Trump and His Team Respond After For…",
    "link": "https://www.thegatewaypundit.com/2025/07/president-trump-his-team-respond-after-formerly-anti/",
    "timestamp": "2025-07-26T13:30:05Z"
  },
  {
    "title": "Paramount Skydance Merger: 'It's The Corruption, Stupid'",
    "description": "The Republican-controlled Federal Communications Commission on Thursday gave formal approval to the $8 billion merger of CBS owner Paramount and the media firm Skydance, which won over the agency's Trump-appointed chairman with pledges to review CBS' content …",
    "link": "https://crooksandliars.com/2025/07/paramount-skydance-merger-its-corruption",
    "timestamp": "2025-07-26T13:30:02Z"
  },
  {
    "title": "Trump played golf at Turnberry to start Scotland visit",
    "description": "United States President Donald Trump began his five-day private visit to Scotland by golfing at his Turnberry resort on Saturday.\nThe US president arrived at Prestwick Airport on Friday night, accomp...",
    "link": "https://biztoc.com/x/b644cb3ea371d8f2",
    "timestamp": "2025-07-26T13:29:09Z"
  },
  {
    "title": "Trump Faces More Epstein Questions as He Lands in Scotland",
    "description": "President Donald Trump has touched down in Scotland on Friday evening. Despite making lengthy remarks as he left the White House, Trump spoke again to reporters at the Glasgow airport and was quizzed again about the Jeffrey Epstein case and whether he would p…",
    "link": "https://biztoc.com/x/89b66bf06f18a680",
    "timestamp": "2025-07-26T13:29:02Z"
  },
  {
    "title": "Trump's MAGA allies zero in on Ghislaine Maxwell as Epstein furor persists (Jonathan Edwards/Washington Post)",
    "description": "Jonathan Edwards / Washington Post:\nTrump's MAGA allies zero in on Ghislaine Maxwell as Epstein furor persists  —  The intensifying focus on Ghislaine Maxwell represents the latest turn in a winding case that has long been a focus of conspiracy theorists.  — …",
    "link": "https://www.memeorandum.com/250726/p14",
    "timestamp": "2025-07-26T13:25:00Z"
  },
  {
    "title": "PEPFAR escaped the rescission ax. But where does it stand?",
    "description": "Founded by George W. Bush, the President's Emergency Plan for AIDS Relief was taken out of the list of agencies that lost previously pledged funds. But its future is far from certain.",
    "link": "https://www.npr.org/sections/goats-and-soda/2025/07/26/g-s1-79083/pepfar-hiv-aids-rescission",
    "timestamp": "2025-07-26T13:21:45Z"
  },
  {
    "title": "Amid Rising Fascism, the Left Looks for Action. It Should Also Ask Questions.",
    "description": "There’s no cookie-cutter solution to confronting fascism; action must be grounded in analysis, says Robin D. G. Kelley.",
    "link": "https://truthout.org/articles/amid-rising-fascism-the-left-looks-for-action-it-should-also-ask-questions/",
    "timestamp": "2025-07-26T13:20:20Z"
  },
  {
    "title": "Top State Dept. official who once attended conference with White nationalists picked to lead US Institute of Peace",
    "description": "Darren Beattie — a top State Department official who was fired as a speechwriter during President Donald Trump’s first term after CNN revealed that he spoke at a conference attended by White nationalists — will now serve as the acting president of the US Inst…",
    "link": "https://www.cnn.com/2025/07/26/politics/darren-beattie-us-institute-of-peace",
    "timestamp": "2025-07-26T13:14:04Z"
  },
  {
    "title": "Hungary’s Orban says he will not back EU budget unless funds released",
    "description": "This is not the first time Orbán has threatened to withhold support for the next EU budget",
    "link": "https://www.euractiv.com/section/politics/news/hungarys-orban-says-he-will-not-back-eu-budget-unless-funds-released/",
    "timestamp": "2025-07-26T13:13:05Z"
  },
  {
    "title": "Orban credits Trump win with preventing global conflict",
    "description": "Hungarian Prime Minister Viktor Orban said United States President Donald Trump's victory in the most recent US election helped prevent a global conflict.\nSpeaking at a student event in Romania o...",
    "link": "https://biztoc.com/x/22aa86f1879819b0",
    "timestamp": "2025-07-26T13:07:11Z"
  },
  {
    "title": "Russia and Ukraine agree on leaders’ summit - Turkish FM",
    "description": "Turkish FM Hakan Fidan has praised the third round of peace talks between Russia and Ukraine in Istanbul Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622025-russia-ukraine-leaders-summit-fidan/",
    "timestamp": "2025-07-26T13:06:35Z"
  },
  {
    "title": "'The theories are endless' as Trump is 'consumed' by the Epstein scandal: NYT",
    "description": "With Donald Trump in Scotland touring his two golf courses, he faces the grim specter of returning to the U.S. where his ties to convicted pedophile Jeffrey Epstein is front and center –– and he has only himself to blame.According to analysis by the New York …",
    "link": "https://www.rawstory.com/trump-consumed-epstein/",
    "timestamp": "2025-07-26T13:04:11Z"
  },
  {
    "title": "Zelensky tried to break free – and broke something else",
    "description": "His assault on anti-corruption agencies has opened the door to political revolt – and made his position look weaker than ever Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622010-zelensky-tried-to-break-free/",
    "timestamp": "2025-07-26T13:02:54Z"
  },
  {
    "title": "Democrats are posting weightlifting videos to give their midterm campaigns a lift | CNN Politics",
    "description": "Democrats are posting weightlifting videos to give their midterm campaigns a lift | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/07/26/politics/democrats-weightlifting-videos",
    "timestamp": "2025-07-26T13:00:41Z"
  },
  {
    "title": "Trump’s threats against Obama are very real — and dangerous",
    "description": "Accusations of treason are not just distractions from Epstein",
    "link": "https://www.salon.com/2025/07/26/trumps-threats-against-obama-are-racism-made-dangerously-real/",
    "timestamp": "2025-07-26T13:00:40Z"
  },
  {
    "title": "‘Don’t Talk About Trump!’ Trump Bristles As Reporters Instantly Pepper Him About Epstein As He Lands In Scotland",
    "description": "Trump bristled at the barrage of questions about deceased sex criminal Jeffrey Epstein as the scandal followed him across the ocean to Scotland.\nThe post ‘Don’t Talk About Trump!’ Trump Bristles As Reporters Instantly Pepper Him About Epstein As He Lands In S…",
    "link": "https://www.mediaite.com/media/news/dont-talk-about-trump-trump-bristles-as-reporters-instantly-pepper-him-about-epstein-as-he-lands-in-scotland/",
    "timestamp": "2025-07-26T13:00:30Z"
  },
  {
    "title": "DNI Tulsi Gabbard declassified Trump-Russia docs: Here’s what they say",
    "description": "DNI Tulsi Gabbard declassified a slew of documents this month she says reveal Obama administration officials “manufactured\" intelligence to push the Trump-Russia collusion narrative.",
    "link": "https://www.foxnews.com/politics/dni-tulsi-gabbard-declassified-trump-russia-docs-heres-what-say",
    "timestamp": "2025-07-26T13:00:27Z"
  },
  {
    "title": "What To Know About Ghislaine Maxwell, Jeffrey Epstein's Longtime Collaborator",
    "description": "The disgraced British socialite is at the center of renewed public interest in Epstein.",
    "link": "https://www.huffpost.com/entry/who-is-ghislaine-maxwell_n_68824b34e4b036c6e7021b70",
    "timestamp": "2025-07-26T13:00:17Z"
  },
  {
    "title": "David Brooks faces the truth of US history — and runs away",
    "description": "NY Times' pet conservative offers a lengthy apologia for America — and gets pretty much everything wrong",
    "link": "https://www.salon.com/2025/07/26/david-brooks-faces-the-truth-of-us-history-and-runs-away/",
    "timestamp": "2025-07-26T13:00:09Z"
  },
  {
    "title": "Obama Knew the Russiagate Intelligence Was Manufactured",
    "description": "Director of National Intelligence Tulsi Gabbard contends that new declassified documents show that former President Barack Obama engaged in the plot to create the lie... Read More\nThe post Obama Knew the Russiagate Intelligence Was Manufactured appeared first…",
    "link": "https://www.dailysignal.com/2025/07/26/obama-knew-russiagate-intelligence-manufactured/",
    "timestamp": "2025-07-26T13:00:00Z"
  },
  {
    "title": "Georgia sterilization plants using toxic gas among those exempt from new rules",
    "description": "Exemption allows facilities using ethylene oxide, a gas linked to health problems in humans, two more years to meet federal standards.",
    "link": "https://grist.org/regulation/georgia-sterilization-plants-using-toxic-gas-among-those-exempt-from-new-rules/",
    "timestamp": "2025-07-26T13:00:00Z"
  },
  {
    "title": "‘South Park’ Vs. Donald Trump—The Controversial Episode, Explained",
    "description": "‘South Park’ drew the ire of the White House after mocking Donald Trump, depicting the president with tiny genitals—here’s the controversial episode, explained.",
    "link": "https://www.forbes.com/sites/danidiplacido/2025/07/26/south-park-vs-donald-trump-the-controversial-episode-explained/",
    "timestamp": "2025-07-26T13:00:00Z"
  },
  {
    "title": "Should You Actually Invest Your Own Money in the Trump Baby Accounts?",
    "description": "One of the key provisions of President Donald Trump’s “Big Beautiful Bill” establishes so-called “Trump Accounts,” designed to encourage savings for newborn children. In addition to receiving an initial deposit from the federal government, the accounts allow …",
    "link": "https://biztoc.com/x/5e0106bfebf46137",
    "timestamp": "2025-07-26T12:56:59Z"
  },
  {
    "title": "Mental health provider warns patients of state health department changes - NewsBreak",
    "description": "JACKSON, Mich. (WILX) - Community mental health organization LifeWays is warning patients about incoming changes to the way that behavioral health care is",
    "link": "https://www.newsbreak.com/share/4135010818334-mental-health-provider-warns-patients-of-state-health-department-changes?s=a99&amp;share_destination_id=MzE4NzMzNjYyLTE3NTM1MzQ0MDUzMDI%3D&amp;pd=0LZNBWQ1&amp;hl=en_US&amp;send_time=1753534405&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_recall_exp_25q3-v5%2Cns_foryou_blend_exp_25q2-v9%2Cns_foryou_rank_exp_25q2-v1",
    "timestamp": "2025-07-26T12:54:01Z"
  },
  {
    "title": "Hamas pushes back on Trump and Witkoff's criticisms, demands US pressure Israel",
    "description": "Hamas issued a scathing statement in which it rejected U.S. criticism of its handling of negotiations aimed at ending the nearly two-year-long war in Gaza.",
    "link": "https://www.foxnews.com/world/hamas-pushes-back-trump-witkoffs-criticisms-demands-us-pressure-israel",
    "timestamp": "2025-07-26T12:52:00Z"
  },
  {
    "title": "Trump Plays Golf In Scotland As Protesters Rally",
    "description": "US President Donald Trump played golf under tight security on the first full day of a visit to Scotland Saturday, as hundreds of protesters took to the streets in major cities.",
    "link": "https://www.ibtimes.com/trump-plays-golf-scotland-protesters-rally-3779496",
    "timestamp": "2025-07-26T12:51:14Z"
  },
  {
    "title": "Kamala Sinks Past Rock Bottom at Embarrassing Dem Youth Summit with 'Panda Emcee'",
    "description": "Democrats hosted a youth voter summit that featured former Vice President Kamala Harris and a very desperate panda emcee.",
    "link": "https://www.westernjournal.com/kamala-sinks-past-rock-bottom-embarrassing-dem-youth-summit-panda-emcee/",
    "timestamp": "2025-07-26T12:43:39Z"
  },
  {
    "title": "Trump plays golf in Scotland while protesters take to the streets and decry his visit",
    "description": "By WILL WEISSERT EDINBURGH, Scotland (AP) — President Donald Trump played golf Saturday at his course on Scotland’s coast while protesters around the country took to the streets to decry his visit and accuse United Kingdom leaders of pandering to the American…",
    "link": "https://www.denverpost.com/2025/07/26/trump-plays-golf-in-scotland-while-protesters-take-to-the-streets-and-decry-his-visit/",
    "timestamp": "2025-07-26T12:39:26Z"
  },
  {
    "title": "Trump plays golf in Scotland while protesters take to the streets and decry his visit",
    "description": "President Donald Trump played golf Saturday at his course on Scotland's coast while protesters around the country took to the streets to decry his visit and ...",
    "link": "https://www.yahoo.com/news/articles/trump-plays-golfs-scotland-while-123926511.html",
    "timestamp": "2025-07-26T12:39:26Z"
  },
  {
    "title": "Trump golfs in Scotland as Epstein questions persist",
    "description": "EDINBURGH, Scotland (Reuters) -U.S. President Donald Trump kept a low profile on his Scottish golf course on Saturday, ahead of meetings with top British and...",
    "link": "https://www.yahoo.com/news/articles/trump-golfs-scotland-epstein-questions-123613521.html",
    "timestamp": "2025-07-26T12:36:13Z"
  },
  {
    "title": "\"Baseless?\"",
    "description": "\"If you can arrest a former president named Donald Trump, you can arrest a former president named Barack Obama.\" — Peachy Keenan on \"X\". Don’t you think it’s time for The New York Times to stop using the cliché “baseless” when referring to allegations — now, …",
    "link": "https://freerepublic.com/focus/f-chat/4330859/posts",
    "timestamp": "2025-07-26T12:36:05Z"
  },
  {
    "title": "China urges global consensus on balancing AI development, security",
    "description": "China's Premier Li Qiang warned Saturday that artificial intelligence development must be weighed against the security risks, saying global consensus was...",
    "link": "https://www.yahoo.com/news/articles/china-urges-global-consensus-balancing-042026536.html",
    "timestamp": "2025-07-26T12:34:05Z"
  },
  {
    "title": "Spineless Mike Johnson Grovels to Trump and Shutters the House Early",
    "description": "The Speaker of the U.S. House of Representatives, Mike Johnson—probably the worst speaker in American history—shut down the House early this week before its five-week vacation. He wants to avoid holding votes on releasing the Epstein files that reportedly inc…",
    "link": "https://www.commondreams.org/opinion/spineless-mike-johnson",
    "timestamp": "2025-07-26T12:30:02Z"
  },
  {
    "title": "Federal judge tosses Trump DOJ lawsuit against sanctuary policies in Chicago",
    "description": "A federal judge in Illinois has dismissed a Trump administration lawsuit that sought to disrupt limits Chicago imposes on cooperation between federal immigration agents and local police.",
    "link": "https://www.foxnews.com/politics/federal-judge-tosses-trump-doj-lawsuit-against-sanctuary-policies-chicago",
    "timestamp": "2025-07-26T12:25:37Z"
  },
  {
    "title": "Trump Rages At Democrats In New Attack As He Jets Away From Epstein-Mania To Scotland",
    "description": "Trump launched a new grenade as he jetted to Scotland amid the uproar over Jeffrey Epstein — ranting about an attack on the \"FireAid\" concert.\nThe post Trump Rages At Democrats In New Attack As He Jets Away From Epstein-Mania To Scotland first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/trump-rages-at-democrats-in-new-attack-as-he-jets-away-from-epstein-mania-to-scotland/",
    "timestamp": "2025-07-26T12:19:35Z"
  },
  {
    "title": "Trump's trip to Scotland as his new golf course opens blurs politics and the family's business",
    "description": "Donald Trump's visit to Scotland to inaugurate a new golf course is raising eyebrows due to potential conflicts of interest. The trip, coinciding with the course's opening, sees Trump engaging in trade talks while promoting his family's business.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-trip-to-scotland-as-his-new-golf-course-opens-blurs-politics-and-the-familys-business/articleshow/122922629.cms",
    "timestamp": "2025-07-26T12:12:08Z"
  },
  {
    "title": "Trump tells Europe to ‘get your act together’ on immigration before US-EU trade talks",
    "description": "Ursula von der Leyen will meet with US president on Sunday, who describes ‘20 sticking points’ in negotiations\nIntensive negotiations are continuing on Saturday between the EU and the US before a crunch meeting in Scotland between Donald Trump and the Europea…",
    "link": "https://biztoc.com/x/1c2617cc408b2a3e",
    "timestamp": "2025-07-26T12:11:51Z"
  },
  {
    "title": "Colbert’s left-wing ‘Late Show’ became ‘therapy’ session for liberals: study",
    "description": "Stephen Colbert’s “Late Show” booked 43 liberal guests and zero conservatives in the first half of 2025 — leading all late-night shows in partisan tilt, according to a new study. CBS has since announced the show will be canceled in 2026 amid financial woes.",
    "link": "https://nypost.com/2025/07/26/us-news/colbert-axed-after-hosting-176-liberals-one-conservative-study/",
    "timestamp": "2025-07-26T12:10:00Z"
  },
  {
    "title": "Senator Warren Slams Crypto ‘Industry-Designed’ Bills, Says American People Will ‘Pay The Price’",
    "description": "US Senator Elizabeth Warren has slammed the Trump administration and the recently passed crypto bill focusing on stablecoin regulation, arguing that the American people will pay the price for “industry-designed” legislation. Related Reading: US Appeals Court …",
    "link": "https://bitcoinist.com/senator-warren-slams-crypto-industry-designed-bills-says-american-people-will-pay-the-price/",
    "timestamp": "2025-07-26T12:00:51Z"
  },
  {
    "title": "Why Trump stripped NPR of federal funding and what happens next",
    "description": "Fox News breaks down exactly what happened with Trump stripping NPR of federal funding from attention to NPR’s perceived liberal bias through Trump's rescissions package and what happens next.",
    "link": "https://www.foxnews.com/media/why-trump-stripped-npr-of-federal-funding-and-what-happens-next",
    "timestamp": "2025-07-26T12:00:48Z"
  },
  {
    "title": "Trump signs rescissions package, closes out week with trip to Scotland",
    "description": "Trump visited the Federal Reserve headquarters, signed the rescissions package, and headed off to Scotland this week.",
    "link": "https://www.foxnews.com/politics/trump-signs-rescissions-package-closes-out-week-trip-scotland",
    "timestamp": "2025-07-26T12:00:26Z"
  },
  {
    "title": "Trump Is Gutting The State Department And Dragging Diplomats ‘Through The Mud’",
    "description": "Secretary of State Marco Rubio \"succeeded [in creating] an environment where people wake up and don’t want to come in to work,\" a still-serving State Department official told HuffPost.",
    "link": "https://www.huffpost.com/entry/trump-state-department-firing_n_6883ad30e4b016b12b830b18",
    "timestamp": "2025-07-26T12:00:20Z"
  }
]