[
  {
    "title": "The real danger of Trump’s incoherent trade policy",
    "description": "President Donald Trump's use of tariffs lacks a coherent goal, oscillating between fixing perceived trade imbalances and using them as negotiating leverage. This strategy may endanger the bond market, worsen U.S. debt and deficits, and strain relations with m…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-real-danger-of-trumps-incoherent-trade-policy/articleshow/118014334.cms",
    "timestamp": "2025-02-07T10:37:52Z"
  },
  {
    "title": "UK trying to prevent peace – Ukrainian MP",
    "description": "The UK foreign secretary’s trip to Kiev was aimed at derailing efforts to resolve the conflict, a Ukrainian legislator has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612324-uk-ukraine-peace-talks/",
    "timestamp": "2025-02-07T10:36:10Z"
  },
  {
    "title": "Iran dismisses talks with US as it blasts new sanctions",
    "description": "Iran said the US sanctions will prevent it from conducting legitimate trade with partners.",
    "link": "https://www.aljazeera.com/news/2025/2/7/iran-condemns-latest-us-sanctions-on-its-oil-as-unlawful",
    "timestamp": "2025-02-07T10:31:54Z"
  },
  {
    "title": "Iran’s Khamenei Pours Scorn on Trump’s Nuclear-Deal Overture",
    "description": "Iran’s Supreme Leader Ayatollah Ali Khamenei said it wouldn’t be smart, wise or honorable to start fresh negotiations with the US after President Donald Trump said he wanted a new nuclear deal.",
    "link": "https://financialpost.com/pmn/business-pmn/irans-khamenei-pours-scorn-on-trumps-nuclear-deal-overture",
    "timestamp": "2025-02-07T10:31:43Z"
  },
  {
    "title": "Musk's move fast and break things mantra won't work in US.gov",
    "description": "248-year-old democracy is not a tech startup Opinion  120-hour work weeks, firing government staffers and dismantling agencies? Oh my. The US government under pseudo President Musk is in for a world of radical change.…",
    "link": "https://www.theregister.com/2025/02/07/opinion_column_musk/",
    "timestamp": "2025-02-07T10:27:14Z"
  },
  {
    "title": "Germany Logs Record US Surplus Amid Trump Tariff Fears",
    "description": "Germany logged a record trade surplus with the United States last year, data showed Friday, news that could stoke tensions with US President Donald Trump as he threatens the EU with tariffs.",
    "link": "https://www.ibtimes.com/germany-logs-record-us-surplus-amid-trump-tariff-fears-3762761",
    "timestamp": "2025-02-07T10:27:13Z"
  },
  {
    "title": "Social Security Boost Proposed for Millions of Americans",
    "description": "Eliminating taxes on Social Security benefits for U.S. seniors is on Trump's agenda, press secretary Karoline Leavitt said.",
    "link": "https://www.newsweek.com/social-security-boost-proposed-millions-americans-2027678",
    "timestamp": "2025-02-07T10:26:15Z"
  },
  {
    "title": "NASA employees asked to implement these massive changes in work communication after Trump's executive order",
    "description": "National Aeronautics and Space Administration (NASA) personnel were instructed to remove all pronouns from emails and other forms. This comes after President Donald Trump signed the order, which, among other things, instructs agencies to \"end the Federal fund…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-nasa-employees-remove-pronouns-from-email-trump-dei-policies-nasa-employees-asked-to-implement-these-massive-changes-in-work-communication-after-trumps-executive-order/articleshow/118013613.cms",
    "timestamp": "2025-02-07T10:23:41Z"
  },
  {
    "title": "Trump Signs Order Imposing Sanctions On ICC Over Israel Probes",
    "description": "The court has issued an arrest warrant for Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.huffpost.com/entry/trump-imposes-sanctions-on-icc_n_67a5dc7de4b011cd6d36fa69",
    "timestamp": "2025-02-07T10:23:19Z"
  },
  {
    "title": "US ‘will lose the next war very badly’ – Musk",
    "description": "The nation faces the risk of major defeat in future conflicts without immediate reforms to outdated weapons programs, Elon Musk has warned Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612323-us-will-lose-next-war/",
    "timestamp": "2025-02-07T10:19:37Z"
  },
  {
    "title": "You can now find bitcoin ATMs in some Costco stores",
    "description": "Bitcoin ATMs have become increasingly common in the US as crypto has entered the mainstream, with many Walgreens and CVS stores also having them.",
    "link": "https://www.businessinsider.com/costco-bitcoin-atm-libertyx-us-store-cryptocurrency-2025-2",
    "timestamp": "2025-02-07T10:18:26Z"
  },
  {
    "title": "'Irresponsible' Or 'Antiwar': US Fighters In Ukraine Grapple With Trump",
    "description": "Tracey, an American fighting in Ukraine, got angry at social media posts from his friends back home calling for Washington to cut its support to Kyiv.",
    "link": "https://www.ibtimes.com.au/irresponsible-antiwar-us-fighters-ukraine-grapple-trump-1855960",
    "timestamp": "2025-02-07T10:18:09Z"
  },
  {
    "title": "Super Bowl Props Include Fox Interview And Game Appearance By President Trump",
    "description": "The Big Game is approaching with Super Bowl LIX on Feb. 9, 2025 between the Philadelphia Eagles and 2-time defending champions Kansas City Chiefs. Record betting is expected again, but this year’s Super Bowl will make more history with U.S. President Donald T…",
    "link": "https://freerepublic.com/focus/f-chat/4295676/posts",
    "timestamp": "2025-02-07T10:17:13Z"
  },
  {
    "title": "US-China tariffs reshape the shipping market",
    "description": "Who are the big losers from the trade conflict and which sector shows the greatest resilience - What analysts foresee \nThe post US-China tariffs reshape the shipping market appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/02/07/us-china-tariffs-reshape-the-shipping-market/",
    "timestamp": "2025-02-07T10:16:52Z"
  },
  {
    "title": "Infinite Erie leaders optimistic about Shapiro budget, proposed investment in housing",
    "description": "Gov. Josh Shapiro's budget proposal was discussed Wednesday among Erie's community and economic development leaders.",
    "link": "https://www.goerie.com/story/business/2025/02/07/pa-state-budget-offers-significant-opportunities-infinite-erie-work-shapiro/78095631007/",
    "timestamp": "2025-02-07T10:16:35Z"
  },
  {
    "title": "Elon Musk is a global problem",
    "description": "The far-right billionaire seems to be trying to replicate all across the world what he already has achieved in the US.",
    "link": "https://www.aljazeera.com/opinions/2025/2/7/elon-musk-is-a-global-problem",
    "timestamp": "2025-02-07T10:15:32Z"
  },
  {
    "title": "'Irresponsible' Or 'Antiwar': US Fighters In Ukraine Grapple With Trump",
    "description": "Tracey, an American fighting in Ukraine, got angry at social media posts from his friends back home calling for Washington to cut its support to Kyiv.",
    "link": "https://www.ibtimes.com/irresponsible-antiwar-us-fighters-ukraine-grapple-trump-3762760",
    "timestamp": "2025-02-07T10:15:23Z"
  },
  {
    "title": "Futures steady ahead of monthly payrolls test; Amazon slips",
    "description": "Meanwhile, Amazon.com dipped 3% in premarket trading due to weakness in the retailer's cloud computing unit, Amazon Web Services, and lower-than-expected...",
    "link": "https://finance.yahoo.com/news/futures-steady-ahead-monthly-payrolls-101459153.html",
    "timestamp": "2025-02-07T10:14:59Z"
  },
  {
    "title": "Texas To Investigate Schools Over Transgender Policies",
    "description": "President Donald Trump signed an executive order on Wednesday banning transgender athletes from female sport.",
    "link": "https://biztoc.com/x/4054203d47d7da02",
    "timestamp": "2025-02-07T10:13:04Z"
  },
  {
    "title": "Trump Media wants to let you invest in Trump's MAGA promises",
    "description": "In This Story\nThe company that owns President Donald Trump’s Truth Social now plans to let consumers invest in companies that benefit directly from his campaign promises.\nTrump Media & Technology Group (TMTG), which counts Trump as its majority owner, on Thur…",
    "link": "https://biztoc.com/x/6c38a6c13e6255c7",
    "timestamp": "2025-02-07T10:12:57Z"
  },
  {
    "title": "Texas To Investigate Schools Over Transgender Policies",
    "description": "President Donald Trump signed an executive order on Wednesday banning transgender athletes from female sport.",
    "link": "https://www.newsweek.com/texas-investigate-schools-over-transgender-policies-2027704",
    "timestamp": "2025-02-07T10:06:34Z"
  },
  {
    "title": "Iran Supreme Leader Says U.S. Talks 'Not Intelligent, Wise Or Honorable'",
    "description": "His remarks upend months of signals from Tehran that it wanted to negotiate over its nuclear program in exchange for the lifting of economic sanctions.",
    "link": "https://www.huffpost.com/entry/iran-supreme-leader-on-us-talks_n_67a5d92fe4b09b6785cb05cb",
    "timestamp": "2025-02-07T10:05:05Z"
  },
  {
    "title": "As he helps fight DEI, Musk's SpaceX has a huge contract to send 1st woman, person of color to the moon",
    "description": "As he helps fight DEI, Musk's SpaceX has a huge contract to send 1st woman, person of color to the moongo.com",
    "link": "https://abcnews.go.com/US/helps-fight-dei-musks-spacex-huge-contract-send/story?id=118547470",
    "timestamp": "2025-02-07T10:04:00Z"
  },
  {
    "title": "Taylor Swift and Donald Trump on Collision Course at Super Bowl",
    "description": "Taylor Swift and President Donald Trump will both be in attendance at Super Bowl LIX in New Orleans on Sunday, marking the first time they have been in the same place at the same time.\nNewsweek has reached out to Swift's representatives for comment.\nWhy It Ma…",
    "link": "https://biztoc.com/x/ae9a038fd65a03fc",
    "timestamp": "2025-02-07T10:02:20Z"
  },
  {
    "title": "Trump sanctions ICC for 'illegitimate' Israel, US probes",
    "description": "U.S. President Donald Trump slapped sanctions on the International Criminal Court for probes targeting America and its ally Israel, but the ICC on Friday vowed to continue providing \"justice and hope\" around the world.",
    "link": "https://www.hurriyetdailynews.com/trump-sanctions-icc-for-illegitimate-israel-us-probes-205550",
    "timestamp": "2025-02-07T10:02:06Z"
  },
  {
    "title": "Trump administration plans to slash all but 300 jobs at USAID",
    "description": "Trump administration plans to slash all but 300 jobs at USAID\nDemonstrators and lawmakers rally against President Donald Trump and his ally Elon Musk as they disrupt the federal government, including dismantling the U.S. Agency for International Development, …",
    "link": "https://biztoc.com/x/007a0941e959aee6",
    "timestamp": "2025-02-07T10:01:46Z"
  },
  {
    "title": "U.S. education policy is at a crossroads. This congressional hearing shows why",
    "description": "The House education committee is charged with forging consensus on the nation's education policy. But at a recent meeting, partisan differences were on full display.",
    "link": "https://www.kpbs.org/news/education/2025/02/07/u-s-education-policy-is-at-a-crossroads-this-congressional-hearing-shows-why",
    "timestamp": "2025-02-07T10:00:57Z"
  },
  {
    "title": "U.S. education policy is at a crossroads. This congressional hearing shows why",
    "description": "The House education committee is charged with forging consensus on the nation's education policy. But at a recent meeting, partisan differences were on full display.",
    "link": "https://www.npr.org/2025/02/07/nx-s1-5288107/trump-education-department-race-gender-democrats",
    "timestamp": "2025-02-07T10:00:57Z"
  },
  {
    "title": "Elon Musk's DOGE member, who once tried to 'normalise Indian hate', resigns after old post goes viral",
    "description": "Marko Elez resigned from the Office for Governmental Optimization after his offensive social media posts resurfaced. Linked to an anonymous account, Elez had made discriminatory remarks about individuals of Indian descent, igniting significant backlash and le…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/elon-muske-doge-member-who-once-tried-to-normalise-indian-hate-resigns-after-old-post-goes-viral/articleshow/118012457.cms",
    "timestamp": "2025-02-07T10:00:51Z"
  },
  {
    "title": "White House pressures ICE to pick up pace of migrant arrests, sources say | CNN Politics",
    "description": "In the first weeks of the new Trump administration, the White House has boasted about the arrests of thousands of undocumented immigrants. But behind the scenes, senior officials have expressed frustration with Immigration and Customs Enforcement in tense cal…",
    "link": "https://www.cnn.com/2025/02/07/politics/ice-arrests-pressure/index.html",
    "timestamp": "2025-02-07T10:00:48Z"
  },
  {
    "title": "California school official warns blue states won't go down without fight over Trump's gender orders",
    "description": "Sonja Shaw, school board president for Chino Valley Unified School District, told Fox News Digital she expects California leaders to push back against Trump's gender executive orders.",
    "link": "https://www.foxnews.com/media/california-school-official-warns-blue-states-wont-go-down-without-fight-over-trumps-gender-orders",
    "timestamp": "2025-02-07T10:00:47Z"
  },
  {
    "title": "How USAID went woke and destroyed itself",
    "description": "USAID operated largely unnoticed by the US public. The organization is in the public eye and staffers aren't happy. The agency went woke over several years. Now, it could go broke, too.",
    "link": "https://www.foxnews.com/opinion/how-usaid-went-woke-destroyed-itself",
    "timestamp": "2025-02-07T10:00:40Z"
  },
  {
    "title": "Trump-backed WLFI buys 342,000 ONDO crypto tokens – Why?",
    "description": "Trump-backed WLFI purchased 342,000 ONDO tokens amid Ondo Finance's blockchain launch, signaling rising institutional interest in tokenized assets.",
    "link": "https://ambcrypto.com/trump-backed-wlfi-buys-342000-ondo-crypto-tokens-why/",
    "timestamp": "2025-02-07T10:00:40Z"
  },
  {
    "title": "SEN. KATIE BRITT: Laken Riley Act our first step in ending era of open borders – here's what's next",
    "description": "In signing the most significant piece of immigration-enforcement legislation to reach the Resolute Desk since 1996, President Trump signaled that the era of open borders is over.",
    "link": "https://www.foxnews.com/opinion/sen-katie-britt-laken-riley-act-first-step-ending-era-open-borders-heres-whats-next",
    "timestamp": "2025-02-07T10:00:33Z"
  },
  {
    "title": "Universities vow to fight antisemitism, brace for potential deportation of pro-Hamas student activists",
    "description": "Schools across the country are navigating how they plan to deal with antisemitism, potential deportations and government investigations.",
    "link": "https://www.foxnews.com/media/universities-vow-fight-antisemitism-brace-potential-deportation-pro-hamas-student-activists",
    "timestamp": "2025-02-07T10:00:30Z"
  },
  {
    "title": "Trump's Youth Revolution",
    "description": "Donald Trump may be the oldest man elected president, but he leads a youth movement that will shape politics for decades to come.\nTrump shattered the cliché that Republicans are the party of seniors and Democrats the party of young people. And he's staffing h…",
    "link": "https://freebeacon.com/columns/trumps-youth-revolution/",
    "timestamp": "2025-02-07T10:00:14Z"
  },
  {
    "title": "Taylor Swift and Donald Trump on Collision Course at Super Bowl",
    "description": "It will be the first time Swift and Trump will have been publicly seen in the same place at the same time.",
    "link": "https://www.newsweek.com/taylor-swift-donald-trump-super-bowl-travis-kelce-2027331",
    "timestamp": "2025-02-07T10:00:02Z"
  },
  {
    "title": "Will Supreme Court Overturn Gay Marriage? How Obergefell Could Fall",
    "description": "Some lawmakers are calling for the Court to overturn the landmark decision that allows same-sex couples to marry across the U.S.",
    "link": "https://www.newsweek.com/will-supreme-court-overturn-gay-marriage-2026450",
    "timestamp": "2025-02-07T10:00:01Z"
  },
  {
    "title": "New Brunswick travellers changing course to avoid U.S. amid tariff threats",
    "description": "In an online poll of 1,600 Maritime residents, roughly 6 in 10 said they will travel to the U.S. less within the next year, over recent tensions between the two countries.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/canadian-travellers-avoiding-u-s-amid-tariff-threats-1.7451014",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "How Elon Musk boosted false USAID conspiracy theories to shut down global aid",
    "description": "Elon Musk drove fringe viewpoints on USAID into the mainstream on X, as the Trump administration halted the humanitarian relief agency’s work.",
    "link": "https://www.nbcnews.com/politics/doge/elon-musk-boosted-false-usaid-conspiracy-theories-global-aid-rcna190646",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Some Incarcerated Youths Will Get Health Care After Release Under New Law",
    "description": "It’s common for young people leaving jails and prisons to end up back behind bars, often after lapses related to untreated mental health issues or substance abuse. A new law is aimed at getting them on Medicaid before they’re released. But the government coor…",
    "link": "https://kffhealthnews.org/news/article/incarcerated-youth-juvenile-jail-reentry-medicaid-chip-texas-mental-health/",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Uncertainty around U.S. tariffs causing chaos, forcing N.S. businesses to adapt",
    "description": "While U.S. President Donald Trump has paused the implementation of sweeping tariffs on imported Canadian goods, Nova Scotia businesses are still facing uncertainty and the ramifications that come with that.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/us-tariffs-uncertainty-1.7452310",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Trump’s Angry Rant at USAID Instantly Undercut by Surprise Rubio Video",
    "description": "President Donald Trump unleashed an angry rant Thursday about the U.S. Agency for International Development. He falsely claimed billions of dollars had been stolen there to fund pro-Democrat media. But only hours later, CNN posted video of Secretary of State …",
    "link": "https://newrepublic.com/article/191266/trumps-angry-rant-usaid-instantly-undercut-surprise-rubio-video",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Democrats Are Helping Trump Carry Out His Nativist Agenda",
    "description": "Gaby Del Valle\n\n\n\nTrump and his white-nationalist allies are pursuing a shock-and-awe strategy against immigrants—and many Democrats seem all too eager to join him.\r\n\n\r\n\n\nThe post Democrats Are Helping Trump Carry Out His Nativist Agenda appeared first on The…",
    "link": "https://www.thenation.com/?post_type=article&p=540821",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "The Dehumanization Is the Point",
    "description": "Sasha Abramsky\n\n\n\nYou know things are bad when you end up nostalgic for Trump's first term. \r\n\n\r\n\n\nThe post The Dehumanization Is the Point appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-musk-dehumanization-fascism/",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Negative revisions expected in January jobs report as economic hopes persist",
    "description": "The final jobs report capturing a snapshot of the economy during the Biden administration will be released Friday.",
    "link": "https://www.nbcnews.com/business/economy/january-2025-jobs-report-how-the-job-market-is-looking-forecast-rcna190693",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Zepbound sales double, tariffs could hit Ozempic, and Pfizer on RFK Jr.: Pharma news roundup",
    "description": "Sales of Eli Lilly’s (LLY) blockbuster weight-loss drug Zepbound doubled in the fourth quarter year over year, despite missing the company’s initial sales expectations. Novo Nordisk (NVO), the maker of the popular GLP-1 medications Wegovy and Ozempic, said po…",
    "link": "https://qz.com/zepbound-ozempic-pfizer-rfk-jr-1851757343",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "The White Nationalist in Chief’s Return to Power",
    "description": "Clarence Lusane, The Nation\n\n\n\nNo president in the post-civil-rights era has been as racially aggressive as the now-47th president.\r\n\n\r\n\n\nThe post The White Nationalist in Chief’s Return to Power appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/trump-white-nationalist-in-chief/",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Why Trump and South Africa Are at Odds",
    "description": "Trump and his allies have targeted South Africa, promoting the false narrative that white people are being mistreated by the nation’s post-apartheid government.",
    "link": "https://time.com/7213703/trump-south-africa-elon-musk-white-land-expropriation-act-explainer/",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Trump's week in review",
    "description": "An attempt to identify and explain some of the biggest things that happened each week, and draw attention to some that have been overlooked.",
    "link": "https://www.npr.org/2025/02/07/nx-s1-5289315/trump-week-in-review",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "Secrecy is becoming a defining characteristic of Elon Musk’s DOGE",
    "description": "Officials from Elon Musk's DOGE have been active at USAID, Veterans Affairs, Treasury and elsewhere, but little is publicly known about their work.",
    "link": "https://www.nbcnews.com/politics/white-house/secrecy-becoming-defining-characteristic-elon-musks-doge-rcna190966",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "As Ukraine Fights, Echoes of Historic Meetings in Yalta and Helsinki Abound",
    "description": "Some 80 years ago, Roosevelt and Churchill were at their meeting with Stalin. Fifty years ago, the Helsinki Accords helped doom the Iron Curtain. Here’s what we can learn on their anniversaries. \nThe post As Ukraine Fights, Echoes of Historic Meetings in Yalt…",
    "link": "http://washingtonmonthly.com/2025/02/07/echoes-of-yalta-and-helsinki-in-ukraines-fight/",
    "timestamp": "2025-02-07T10:00:00Z"
  },
  {
    "title": "China Hoards More Gold as US Trade War Intensifies",
    "description": "Geopolitical tensions have contributed to gold-buying spree, says the World Gold Council.",
    "link": "https://www.newsweek.com/china-hoards-more-gold-us-trade-war-intensifies-2027170",
    "timestamp": "2025-02-07T09:59:44Z"
  },
  {
    "title": "Indonesia Halts Billionaire’s Project With Trump-Branded Golf Course On Environmental Issues",
    "description": "The Indonesian government has suspended construction activities at a tourism estate that features a Donald Trump-branded golf course outside of Jakarta amid environmental concerns.",
    "link": "https://www.forbes.com/sites/yessarrosendar/2025/02/07/indonesia-halts-billionaires-project-with-trump-branded-golf-course-on-environmental-issues/",
    "timestamp": "2025-02-07T09:59:25Z"
  },
  {
    "title": "LIV Golf to be broadcast on ITV in 2025",
    "description": "LIV Golf agree a deal with ITV to show live coverage of the 2025 season in the UK.",
    "link": "https://www.bbc.com/sport/golf/articles/c14n2mk7ly6o",
    "timestamp": "2025-02-07T09:58:35Z"
  },
  {
    "title": "Trump’s foul solution to the Palestinian problem was aided by Biden, too",
    "description": "The US president finally said out loud what his predecessors always tried to hide behind more agreeable language.",
    "link": "https://www.aljazeera.com/opinions/2025/2/7/trumps-foul-solution-to-the-palestinian-problem-was-aided-by-biden-too",
    "timestamp": "2025-02-07T09:57:23Z"
  },
  {
    "title": "Trump’s Gaza plan derails Saudi-Israel ties: analysts",
    "description": "US President Donald Trump’s plan to take over Gaza will imperil attempts to forge landmark ties between Saudi Arabia and Israel and fuel anti-American sentiment in the oil-rich kingdom, analysts said. Trump’s proposal to redevelop Gaza and oust the more than …",
    "link": "https://www.digitaljournal.com/world/trumps-gaza-plan-derails-saudi-israel-ties-analysts/article",
    "timestamp": "2025-02-07T09:57:20Z"
  },
  {
    "title": "Hong Kong to file complaint with WTO over US tariffs",
    "description": "Hong Kong will file a complaint with the World Trade Organization in response to heightened US tariffs on its goods, a government spokesperson said Friday, days after Beijing announced a similar move. US President Donald Trump over the weekend launched the op…",
    "link": "https://www.digitaljournal.com/world/hong-kong-to-file-complaint-with-wto-over-us-tariffs/article",
    "timestamp": "2025-02-07T09:57:20Z"
  },
  {
    "title": "Hyundai Wia to expand engine production in Mexico",
    "description": "Hyundai Wia Corporation plans to begin production of engines for hybrid electric vehicles (HEVs) in Mexico in 2026, to meet growing demand from Hyundai Motor...",
    "link": "https://www.just-auto.com/news/hyundai-wia-to-expand-engine-production-in-mexico/",
    "timestamp": "2025-02-07T09:56:17Z"
  },
  {
    "title": "USAID Unions Sue Trump Administration, Citing 'Unconstitutional Actions'",
    "description": "The lawsuit names President Donald Trump, along with Secretary of State Marco Rubio, Treasury Secretary Scott Bessent, and their departments as defendants.",
    "link": "https://www.ibtimes.com/usaid-unions-sue-trump-administration-citing-unconstitutional-actions-3762749",
    "timestamp": "2025-02-07T09:55:55Z"
  },
  {
    "title": "Hong Kong to complain to WTO on U.S. tariff decision",
    "description": "Hong Kong said on Friday it would file a complaint with the World Trade Organisation (WTO) on a U.S. decision to impose 10% tariffs on goods from the Asian financial hub as U.S. President Donald Trump targets Chinese imports.",
    "link": "https://biztoc.com/x/e2ea9c277c6bb844",
    "timestamp": "2025-02-07T09:51:04Z"
  },
  {
    "title": "Tommy Tuberville’s Newsmax Rant Ends In Spectacular Facepalm Moment",
    "description": "The Republican senator went to bat for Donald Trump with a major self-own.",
    "link": "https://www.huffpost.com/entry/tommy-tuberville-facepalm-moment_n_67a5c72ee4b09b6785cafab5",
    "timestamp": "2025-02-07T09:50:11Z"
  },
  {
    "title": "Trump's Gaza Plan Derails Saudi-Israel Ties: Analysts",
    "description": "US President Donald Trump's plan to take over Gaza will imperil attempts to forge landmark ties between Saudi Arabia and Israel and fuel anti-American sentiment in the oil-rich kingdom, analysts said.",
    "link": "https://www.ibtimes.com/trumps-gaza-plan-derails-saudi-israel-ties-analysts-3762755",
    "timestamp": "2025-02-07T09:48:12Z"
  },
  {
    "title": "U.S. cannot withdraw from a body it no longer belongs: UNHRC",
    "description": "The United Nations Human Rights Council (UNHRC) stated on Thursday that as of Jan. 1, 2025, the United States' term as a member had ended, making it ineligible to withdraw from an intergovernmental body it was no longer part of.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250207-pdo03.htm",
    "timestamp": "2025-02-07T09:45:39Z"
  },
  {
    "title": "China lashes out at US 'coercion' after Panama declines to renew infrastructure agreement",
    "description": "China on lashed out at what it called U.S. “coercion” after Panama declined to renew a key infrastructure agreement with Beijing following Washington’s threat to take back the Panama Canal. The Belt and Road Initiative is President Xi Jinping’s signature fore…",
    "link": "https://www.seattlepi.com/news/world/article/china-lashes-out-at-us-coercion-after-panama-20153238.php",
    "timestamp": "2025-02-07T09:45:29Z"
  },
  {
    "title": "Trump Signs Order Imposing Sanctions On International Criminal Court",
    "description": "U.S. President Donald Trump has signed an executive order slapping sanctions on officials with the International Criminal Court for opening investigations targeting the United States and Israel.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250207-rferl01.htm",
    "timestamp": "2025-02-07T09:45:25Z"
  },
  {
    "title": "200 Kenyan police officers arrive at UN mission in Haiti",
    "description": "Two hundred Kenyan police officers arrived in Haiti on Thursday to join the United Nations-backed mission to fight gangs in the crisis-plagued Caribbean country.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-voa05.htm",
    "timestamp": "2025-02-07T09:44:47Z"
  },
  {
    "title": "Why Trump’s assault on USAID could change US foreign policy forever",
    "description": "The president’s offensive against America’s ‘state within a state’ marks the end of an era Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612319-why-trumps-assault-on-usaid/",
    "timestamp": "2025-02-07T09:43:11Z"
  },
  {
    "title": "Federal workers sue Trump administration over plan to shut down USAID",
    "description": "Federal workers associations in the United States have asked a federal high court in Washington to stop the Donald Trump administration from shutting down the United States Agency for International Development. The lawsuit was filed by the American Foreign Se…",
    "link": "https://punchng.com/federal-workers-sue-trump-administration-over-plan-to-shut-down-usaid/",
    "timestamp": "2025-02-07T09:40:42Z"
  },
  {
    "title": "China lashes out at US 'coercion' as Panama declines to renew agreement",
    "description": "China on lashed out at what it called U.S. “coercion” after Panama declined to renew a key infrastructure agreement with Beijing following Washington’s threat to take back the Panama Canal",
    "link": "https://abcnews.go.com/Business/wireStory/china-lashes-us-coercion-after-panama-declines-renew-118561218",
    "timestamp": "2025-02-07T09:40:08Z"
  },
  {
    "title": "Elon Musk's Crackdown on USAID Splits With Project 2025 Agenda",
    "description": "President Donald Trump and tech billionaire Elon Musk's crackdown on the U.S. Agency for International Development (USAID) contradicts how the conservative manifesto Project 2025 suggested the agency should operate.\nNewsweek has reached out to The Heritage Fo…",
    "link": "https://biztoc.com/x/1232461e2d1b0a3e",
    "timestamp": "2025-02-07T09:39:42Z"
  },
  {
    "title": "Israel Orders Army To Prepare For Palestinians' \"Voluntary\" Exit From Gaza",
    "description": "US President Donald Trump had earlier proposed moving Palestinians out of Gaza, sparking uproar from leaders in the Middle East and beyond.",
    "link": "https://www.ndtv.com/world-news/israel-orders-army-to-prepare-for-palestinians-voluntary-exit-from-gaza-7655988",
    "timestamp": "2025-02-07T09:39:34Z"
  },
  {
    "title": "Trump Wants a Sovereign Wealth Fund for the US. What Are They?",
    "description": "Donald Trump wants a sovereign wealth fund for the US.\nWhat exactly are they and are there risks? Bloomberg's David Ramli explains: https://trib.al/BVTGFvl\n--------\nSubscribe to our YouTube channel: https://trib.al/KM4k5RA\nSubscribe to Bloomberg Originals: ht…",
    "link": "https://biztoc.com/x/e27a40ab281dec03",
    "timestamp": "2025-02-07T09:39:21Z"
  },
  {
    "title": "Elon Musk's Crackdown on USAID Splits With Project 2025 Agenda",
    "description": "The conservative manifesto largely praises USAID's humanitarian work and does not call for it to be dismantled.",
    "link": "https://www.newsweek.com/elon-musk-crackdown-usaid-splits-project-2025-agenda-2027687",
    "timestamp": "2025-02-07T09:37:57Z"
  },
  {
    "title": "Treaty obliges US to to defend Panama Canal, says Rubio",
    "description": "The United States has a treaty obligation to protect the Panama Canal if it comes under attack, U.S. Secretary of State Marco Rubio said Thursday, amid confusion and what Panama has described as \"lies\" regarding whether U.S. Navy ships can transit the Panama …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-voa06.htm",
    "timestamp": "2025-02-07T09:37:46Z"
  },
  {
    "title": "Climate Politics: What Would Donald Trump Do?",
    "description": "So, what would Donald Trump do to convince his voters of the need for a low-carbon economy? He would keep it simple and all about the economy. Those are words to advocate by.",
    "link": "https://www.resilience.org/stories/2025-02-07/climate-politics-what-would-donald-trump-do/",
    "timestamp": "2025-02-07T09:37:41Z"
  },
  {
    "title": "Panama Canal Authority denies claim of free passage for US govt. vessels",
    "description": "The Panama Canal Authority has denied claims by Washington that United States government vessels are being given free passage, stressing that no preferential crossing rights for American vessels have been granted.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-presstv04.htm",
    "timestamp": "2025-02-07T09:37:21Z"
  },
  {
    "title": "Malaysia rejects Trump's proposal to resettle Palestinians",
    "description": "Malaysia strongly opposes any proposal that could lead to the forced displacement or movement of Palestinians, Malaysia's Foreign Ministry said on Thursday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-pdo04.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "Trump: Israel to hand over Gaza Strip to US at end of war",
    "description": "US President Donald Trump says Gaza will be \"turned over\" to the US at the end of the Israeli war on the besieged territory, but that \"no soldiers by the US would be needed.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-presstv01.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "Trump: Israel to hand Gaza over to US when war with Hamas ends",
    "description": "U.S. President Donald Trump on Thursday said Israel would turn the Gaza Strip over to the United States after the war with Hamas ends and that no U.S. soldiers would be needed there.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-voa01.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "Israeli occupation army planning for 'voluntary' departure of Gazans after Trump proposal",
    "description": "Israeli minister of military affairs Israel Katz has ordered the regime's army to prepare a plan forcing the \"voluntary departure\" of Palestinian from the Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-presstv03.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "UN human rights chief urges respect for int'l law following Trump's Gaza remarks",
    "description": "UN High Commissioner for Human Rights Volker Turk on Thursday underscored the necessity of upholding international law following U.S. President Donald Trump's Gaza takeover proposal.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250207-pdo01.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "US refuses to ensure Palestinians can stay in Gaza under Trump's plan",
    "description": "The White House has refrained from assuring that any Palestinians wishing to remain in the besieged Gaza Strip would be allowed to do so following US President Donald Trump's controversial proposal to assume control of Gaza after relocating its entire populat…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-presstv02.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "Explainer: How the world reacts to Trump's Gaza takeover proposal",
    "description": "U.S. President Donald Trump's recent proposal to take over Gaza by the United States, made during a joint press conference with Israeli Prime Minister Benjamin Netanyahu on Tuesday, has met with widespread condemnation from European, Middle Eastern and other …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250207-pdo02.htm",
    "timestamp": "2025-02-07T09:36:44Z"
  },
  {
    "title": "Leader: All of Palestine, from the river to the sea, belongs to Palestinians",
    "description": "Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei says all of Palestine — from the Jordan River to the Mediterranean Sea — belongs to the Palestinians.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-irna02.htm",
    "timestamp": "2025-02-07T09:36:43Z"
  },
  {
    "title": "Iran condemns US president's 'ownership' and ethnic cleansing scheme for Gaza",
    "description": "Iran's Foreign Ministry spokesman Esmail Baghaei has condemned US President Donald Trump's 'ownership' and ethnic cleansing plan for Gaza, describing it as appalling and aligning with Israel's goal of annihilation of Palestine.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-irna03.htm",
    "timestamp": "2025-02-07T09:36:43Z"
  },
  {
    "title": "Trump repeats claims, says Israel 'will hand over' Gaza to U.S.",
    "description": "U.S. President Donald Trump remains adamant over his shock plan to relocate residents of the Gaza Strip, saying the United States will take over the Palestinian territory from Israel after the war ends.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250206-irna01.htm",
    "timestamp": "2025-02-07T09:36:43Z"
  },
  {
    "title": "Japan's Ishiba faces balancing act in first meeting with Trump",
    "description": "When Japanese Prime Minister Shigeru Ishiba meets with U.S. President Donald Trump at the White House on Friday, his goal, according to Japanese officials, will be straightforward: reaffirm the U.S.-Japan alliance and build a strong rapport with Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/japan/2025/japan-250206-voa01.htm",
    "timestamp": "2025-02-07T09:34:14Z"
  },
  {
    "title": "US updates: ICC says it is undeterred by Trump sanctions",
    "description": "Donald Trump has signed an executive order imposing sanctions on the International Criminal Court for its investigations into Israel. In 2024, the ICC issued an arrest warrant for Benjamin Netanyahu. DW has more. President Donald Trump has signed an executive…",
    "link": "https://www.dw.com/en/us-updates-icc-says-it-is-undeterred-by-trump-sanctions/live-71534014",
    "timestamp": "2025-02-07T09:34:00Z"
  },
  {
    "title": "PM Netanyahu Meets with Bipartisan US Senate Leadership",
    "description": "PM Netanyahu Meets with Bipartisan US Senate Leadership, on Capitol Hill in Washington, met with the US Senate leadership from both parties.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/02/israel-250206-israel-pm01.htm",
    "timestamp": "2025-02-07T09:33:51Z"
  },
  {
    "title": "Trump administration plans to slash all but a fraction of USAID jobs, officials say",
    "description": "WASHINGTON — The Trump administration presented a plan Thursday to dramatically cut staffing worldwide for U.S. aid projects as part of its dismantling of the U.S. Agency for International Development, leaving fewer than 300 workers out of thousands.\n\n\nLate T…",
    "link": "https://www.voanews.com/a/trump-administration-plans-to-slash-all-but-a-fraction-of-usaid-jobs-officials-say/7966325.html",
    "timestamp": "2025-02-07T09:33:49Z"
  },
  {
    "title": "Statement by PM Netanyahu at the White House press conference",
    "description": "Following is Prime Minister Benjamin Netanyahu's statement at the White House press conference, yesterday, with US President Donald Trump:",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/02/israel-250205-israel-pm01.htm",
    "timestamp": "2025-02-07T09:33:48Z"
  },
  {
    "title": "US imposes new sanctions targeting Iran oil exports",
    "description": "The U.S. Treasury Department announced on Thursday new sanctions on Iran's oil industry, targeting an international network that facilitates the shipment of millions of barrels of Iranian oil to China.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250206-voa01.htm",
    "timestamp": "2025-02-07T09:33:06Z"
  },
  {
    "title": "IRGC chief: President Trump has realized real power of Iran",
    "description": "The chief commander of the Islamic Revolution Guards Corps (IRGC) has reacted to US President Donald Trump's remarks about Iran, saying they show he has discerned the country's real power.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250206-presstv03.htm",
    "timestamp": "2025-02-07T09:32:14Z"
  },
  {
    "title": "US slaps new sanctions on Iran under Trump's failed 'maximum pressure'",
    "description": "The United States has imposed its first set of sanctions on Iran after US President Donald Trump revived his so-called maximum pressure strategy against the Islamic Republic.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250206-presstv01.htm",
    "timestamp": "2025-02-07T09:32:08Z"
  },
  {
    "title": "Trump's maximum pressure on Iran 'a failed experience': FM Araghchi",
    "description": "Iran's Foreign Minister Abbas Araghchi has brushed aside US President Donald Trump's signing of a memorandum re-imposing his so-called \"maximum pressure\" policy on Tehran, calling it a failed experience.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250206-presstv07.htm",
    "timestamp": "2025-02-07T09:32:01Z"
  }
]