[
  {
    "title": "Fastex Expands U.S. Presence With Los Angeles Office",
    "description": "In an interview with CoinDesk, Fastex’s chief legal officer said that the crypto regulatory shift under President Donald Trump has made it possible for the exchange to expand in the U.S.",
    "link": "https://www.coindesk.com/policy/2025/05/29/fastex-expands-u-s-presence-with-los-angeles-office",
    "timestamp": "2025-05-30T03:21:23Z"
  },
  {
    "title": "Defense Intelligence Agency Employee Charged With Trying To Send Classified Data To Foreign Government",
    "description": "FBI officials arrested a DIA employee for allegedly attempting to transmit national defense information to an officer or agent of a foreign government.",
    "link": "https://dailycaller.com/2025/05/29/defense-intelligence-agency-employee-aressted-charged-fbi/",
    "timestamp": "2025-05-30T03:21:16Z"
  },
  {
    "title": "High-yielding bonds in EM may beat peers as treasuries decline",
    "description": "Bloomberg's analysis suggests that riskier emerging-market bonds, particularly from India, Indonesia, Brazil, and South Africa, are outperforming due to the dollar's decline offsetting rising Treasury yields. Goldman Sachs strategists note that a weaker dolla…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/high-yielding-bonds-in-em-may-beat-peers-as-treasuries-decline/articleshow/121504298.cms",
    "timestamp": "2025-05-30T03:16:56Z"
  },
  {
    "title": "RFK Jr.’s MAHA Report Cites Studies That Don’t Seem To Exist, Misinterprets Others",
    "description": "We recently talked about Donald Trumps foray into medicine when he declared, sans any actual evidence of course, that autism cannot possibly be caused by anything other than some external source. It was an admittedly odd stance to take for someone who seems t…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177861517",
    "timestamp": "2025-05-30T03:15:27Z"
  },
  {
    "title": "Exclusive: Trump aims to exceed first term's weapons sales to Taiwan, officials say (Reuters)",
    "description": "Reuters:\nExclusive: Trump aims to exceed first term's weapons sales to Taiwan, officials say  —  The United States plans to ramp up weapons sales to Taipei to a level exceeding President Donald Trump's first term as part of an effort to deter China as it inte…",
    "link": "https://www.memeorandum.com/250529/p158",
    "timestamp": "2025-05-30T03:15:00Z"
  },
  {
    "title": "Donald Trump tells Jay Powell the Federal Reserve is making a ‘mistake’ by not cutting US interest rates",
    "description": "Donald Trump tells Jay Powell the Federal Reserve is making a ‘mistake’ by not cutting US interest rates\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade wa…",
    "link": "https://biztoc.com/x/514c04b1643814b4",
    "timestamp": "2025-05-30T03:10:51Z"
  },
  {
    "title": "RFK Jr.’s MAHA Report Cites Studies That Don’t Seem To Exist, Misinterprets Others",
    "description": "We recently talked about Donald Trump’s foray into medicine when he declared, sans any actual evidence of course, that autism cannot possibly be caused by anything other than some external source. It was an admittedly odd stance to take for someone who seems …",
    "link": "https://www.techdirt.com/2025/05/29/rfk-jr-s-maha-report-cites-studies-that-dont-seem-to-exist-misinterprets-others/",
    "timestamp": "2025-05-30T03:05:47Z"
  },
  {
    "title": "Trump goes after Leonard Leo and the Federalist Society in fury over court ruling (Politico)",
    "description": "Politico:\nTrump goes after Leonard Leo and the Federalist Society in fury over court ruling  —  Trump's attack came after the U.S. Court of International Trade struck down his tariffs, a blow to the primary pillar of his economic agenda.  —  President Donald …",
    "link": "https://www.memeorandum.com/250529/p156",
    "timestamp": "2025-05-30T03:05:01Z"
  },
  {
    "title": "Asian markets reverse as appeals court gives Trump tariffs reprieve",
    "description": "HONG KONG: Asian shares fell Friday (May 30) after a US appeal court gave Donald Trump's sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional. The losses reversed a rally acro…",
    "link": "https://www.channelnewsasia.com/business/asian-markets-reverse-appeals-court-gives-trump-tariffs-reprieve-5159696",
    "timestamp": "2025-05-30T03:05:00Z"
  },
  {
    "title": "Trouble in Trumpland: From Gaza and Iran to a court date, dark clouds hover over Netanyahu",
    "description": "On every possible front, the Americans make have made it clear to Netanyahu that they have had enough of his foot-dragging ■ According to our prime minister, Israel recorded zero achievement from the War of Independence to the Six-Day War ■ The opposition has…",
    "link": "https://www.haaretz.com/israel-news/2025-05-30/ty-article/.premium/trouble-in-trumpland-from-gaza-and-iran-to-a-court-date-dark-clouds-hover-over-netanyahu/00000197-1d3f-d57f-a7d7-3fff4f550000",
    "timestamp": "2025-05-30T03:02:03Z"
  },
  {
    "title": "Without Elon Musk, DOGE likely to fizzle out, says ex-staffer",
    "description": "DOGE has overseen job cuts at nearly every federal agency as part of U.S. President Donald Trump's attempts to shake up the federal bureaucracy.However, software engineer Sahil Lavingia, who spent almost two months working for the group of pro-Musk technologi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/without-elon-musk-doge-likely-to-fizzle-out-says-ex-staffer/articleshow/121503400.cms",
    "timestamp": "2025-05-30T03:01:40Z"
  },
  {
    "title": "Bessent says U.S.-China talks ‘stalled,’ pushes for Trump-Xi call",
    "description": "U.S. Treasury Secretary Scott Bessent said trade talks with China are “a bit stalled,” and that a call between President Donald Trump and his counterpart Xi Jinping may be needed for the world’s two largest economies to reach a deal.\n“I would say that they ar…",
    "link": "https://biztoc.com/x/563340bb918ed88c",
    "timestamp": "2025-05-30T03:00:08Z"
  },
  {
    "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
    "description": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon\nSince returning to power, US President Donald Trump has wielded tariffs – or the threat of them - as his economic weapon of choice.\nHe has slapped import duties against allies …",
    "link": "https://biztoc.com/x/55bfb64da05a9e95",
    "timestamp": "2025-05-30T02:59:55Z"
  },
  {
    "title": "'I left one conflict zone to enter another': Harvard's Jewish foreign students on Trump row",
    "description": "The BBC's Nomia Iqbal meets foreign Jewish students at Harvard left scared and uncertain after Trump's threats against the university.",
    "link": "https://www.bbc.com/news/articles/ckg4908n834o",
    "timestamp": "2025-05-30T02:59:19Z"
  },
  {
    "title": "Trump Turns on Conservative Group’s ‘Sleazebag’ Leader Who Recommended Judges: ‘Probably Hates America’",
    "description": "President Donald Trump laid into the conservative Federalist Society and its \"sleazebag\" chairman of the board Leonard Leo, accusing him of \"hating America.\"\nThe post Trump Turns on Conservative Group’s ‘Sleazebag’ Leader Who Recommended Judges: ‘Probably Hat…",
    "link": "https://www.mediaite.com/politics/trump-turns-on-conservative-groups-sleazebag-leader-who-recommended-judges-probably-hates-america/",
    "timestamp": "2025-05-30T02:56:16Z"
  },
  {
    "title": "Average Ethereum ETF investor ‘substantially underwater’ — Glassnode",
    "description": "Glassnode says investors in BlackRock and Fidelity’s spot Ether ETFs are “substantially underwater” as the asset’s has failed to rally alongside Bitcoin.",
    "link": "https://cointelegraph.com/news/ethereum-etf-investors-substantially-underwater-glassnode",
    "timestamp": "2025-05-30T02:55:27Z"
  },
  {
    "title": "Peter Doocy Asks Why Trump Doesn’t Just Ask Congress ‘To Make a New Law’ After Spate of Court Losses",
    "description": "Fox News Senior White House Correspondent Peter Doocy asked the White House press secretary why President Donald Trump does not simply ask Congress to pass bills that would obviate unfavorable court rulings. \nThe post Peter Doocy Asks Why Trump Doesn’t Just A…",
    "link": "https://www.mediaite.com/media/tv/peter-doocy-asks-why-trump-doesnt-just-ask-congress-to-make-a-new-law-after-spate-of-court-losses/",
    "timestamp": "2025-05-30T02:53:27Z"
  },
  {
    "title": "Asian Markets Reverse As Appeals Court Gives Trump Tariffs Reprieve",
    "description": "Asian shares fell Friday after a US appeal court gave Donald Trump's sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional.",
    "link": "https://www.ibtimes.com/asian-markets-reverse-appeals-court-gives-trump-tariffs-reprieve-3774904",
    "timestamp": "2025-05-30T02:51:15Z"
  },
  {
    "title": "Pressure mounts on a reluctant Trump to impose sanctions on Russia",
    "description": "Trump has held off on such penalties for months, believing he could have fruitful dealings with Putin to end the war.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/politics/trump-russia-sanction-pressure-mounts/",
    "timestamp": "2025-05-30T02:51:00Z"
  },
  {
    "title": "Bessent: Trade Talks with China 'a Bit Stalled', 'Close' on a Couple 'Very Large Deals'",
    "description": "On Thursday’s broadcast of the Fox News Channel’s “Special Report,” Treasury Secretary Scott Bessent said that there are a couple of “very large” trade deals that “are close” but talks with China “are a bit stalled.” And will require direct\nThe post Bessent: …",
    "link": "https://www.breitbart.com/clips/2025/05/29/bessent-trade-talks-with-china-a-bit-stalled-close-on-a-couple-very-large-deals/",
    "timestamp": "2025-05-30T02:50:53Z"
  },
  {
    "title": "Chris Hayes Runs Down Why Elon Musk’s Trump Tenure Was an ‘Abject Failure’: ‘No One Likes the Guy’ | Video",
    "description": "\"He convinced himself, because he's worth a lot of money, that everyone loves him,\" the MSNBC host says, but \"they would really much rather he just go away\"\nThe post Chris Hayes Runs Down Why Elon Musk’s Trump Tenure Was an ‘Abject Failure’: ‘No One Likes the…",
    "link": "https://www.thewrap.com/chris-hayes-elon-musk-trump-doge-abject-failure-msnbc/",
    "timestamp": "2025-05-30T02:50:15Z"
  },
  {
    "title": "The US dollar's dominance is unwinding in #Asia #stocks #business #shorts",
    "description": "As Donald Trump tries to remake global trade, the dollar's historic dominance in Asia is unwinding. Find out what's driving Asia's ...",
    "link": "https://biztoc.com/x/cbdf8d6b6b5b9327",
    "timestamp": "2025-05-30T02:49:48Z"
  },
  {
    "title": "Jamie Raskin Wants Trump To Disclose His Crypto Dinner Guest List, Says Foreigners Can't Donate Dollar But Are Buying Access To President Through Memecoin",
    "description": "A leading Democratic lawmaker launched a probe Thursday into the private dinner held by President Donald Trump for top investors in his Official Trump (CRYPTO: TRUMP)\nWhat Happened: Rep. Jamie Raskin (D-Md.), Ranking Member of the House Judiciary Committee, s…",
    "link": "https://biztoc.com/x/827ff1f86c1418f1",
    "timestamp": "2025-05-30T02:48:51Z"
  },
  {
    "title": "Cambodia PM urges 'industrial recalibrations' under Trump tariff pressure",
    "description": "TOKYO -- Cambodian Prime Minister Hun Manet said his country's businesses and communities must pursue \"industrial recalibrations\" as the economy comes under pressure from U.S. President Donald Trump's trade policy.\nHun Manet delivered a keynote address to Nik…",
    "link": "https://biztoc.com/x/a339bf418c652643",
    "timestamp": "2025-05-30T02:48:50Z"
  },
  {
    "title": "Asian markets reverse as appeals court gives Trump tariffs reprieve",
    "description": "Asian shares fell Friday after a US appeal court gave Donald Trump’s sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional. The losses reversed a rally across world markets the…",
    "link": "https://www.digitaljournal.com/world/asian-markets-reverse-as-appeals-court-gives-trump-tariffs-reprieve/article",
    "timestamp": "2025-05-30T02:47:32Z"
  },
  {
    "title": "Trump Slams Leonard Leo and Federalist Society",
    "description": "“President Donald Trump leveled unusually pointed criticism of a prominent conservative legal activist and organization Thursday as he railed against a ruling that struck down his sweeping tariffs,” Politico reports. “The president, in a post",
    "link": "https://politicalwire.com/2025/05/29/trump-slams-leonard-leo-and-federalist-society/",
    "timestamp": "2025-05-30T02:42:01Z"
  },
  {
    "title": "Hubris, denial and deceit",
    "description": "There comes a point when we all need to reckon with the changes that come to all of us as we age. Sometimes hubris and denial work against us. Deceit always catches up with us.",
    "link": "https://www.ncspin.com/hubris-denial-and-deceit",
    "timestamp": "2025-05-30T02:41:51Z"
  },
  {
    "title": "Bernard Kerik, New York Police Commissioner on 9/11, dies at 69",
    "description": "Bernard Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.",
    "link": "https://www.nbcnews.com/news/us-news/bernard-kerik-new-york-police-commissioner-911-dies-69-rcna209887",
    "timestamp": "2025-05-30T02:41:14Z"
  },
  {
    "title": "‘Existential Crisis’: Victor Davis Hanson Predicts Why Chuck Schumer Will Go Down In Reelection",
    "description": "Victor Davis Hanson predicted Democrat Senate Minority Leader Chuck Schumer will be booted out of his Senate seat by Rep. Alexandria Ocasio-Cortez.",
    "link": "https://dailycaller.com/2025/05/29/victor-davis-hanson-prediction-chuck-schumer-senate-alexandria-ocasio-cortez-new-york/",
    "timestamp": "2025-05-30T02:40:08Z"
  },
  {
    "title": "SHOCK: Washington, DC Mayor Muriel Bowser Quietly Working to Reverse ‘Sanctuary City’ Policy",
    "description": "Did Washington, DC Mayor Muriel Bowser start taking common sense pills this year or something?\nThe post SHOCK: Washington, DC Mayor Muriel Bowser Quietly Working to Reverse ‘Sanctuary City’ Policy appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/shock-washington-dc-mayor-muriel-bowser-quietly-working/",
    "timestamp": "2025-05-30T02:40:05Z"
  },
  {
    "title": "Fox Host Hits Back At Trump Adviser's 'Rogue' Talk With Ice Cold Reality Check",
    "description": "Liz Claman wasn't having it with Peter Navarro as he tried to dismiss a court's ruling on the president's trade policy.",
    "link": "https://www.huffpost.com/entry/fox-business-liz-claman-trump-peter-navarro-judges-tariffs_n_6838f8f9e4b04cbc7110dcc8",
    "timestamp": "2025-05-30T02:39:22Z"
  },
  {
    "title": "Three Judges Blocking Trump's Tariffs Have Decades-Long Histories of Democrat Activism",
    "description": "The judges on the U.S. Court of International Trade who ruled that President Donald Trump's \"Liberation Day\" tariffs are illegal have a history of Democrat Party activism.\nThe post Three Judges Blocking Trump’s Tariffs Have Decades-Long Histories of Democrat …",
    "link": "https://www.breitbart.com/politics/2025/05/29/three-judges-blocking-trumps-tariffs-have-decades-long-histories-of-democrat-activism/",
    "timestamp": "2025-05-30T02:36:13Z"
  },
  {
    "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
    "description": "Despite the legal mire, all signs point to this being a battle the Republican president won't give up easily.",
    "link": "https://www.bbc.com/news/articles/cvg788jrxrro",
    "timestamp": "2025-05-30T02:34:20Z"
  },
  {
    "title": "Thanks for the evidence",
    "description": "Trump's white supremacy leanings were never more evident than when the president of South Africa met with Trump in the White House.",
    "link": "https://www.ncspin.com/thanks-for-the-evidence",
    "timestamp": "2025-05-30T02:31:52Z"
  },
  {
    "title": "Trump’s tariffs: Turfed out but raring to return",
    "description": "The US Court of International Trade struck down America’s ‘reciprocal’ tariffs for exceeding the president’s authority. As the legal battle over their validity thickens, could the rule of law in the US come to the global economy’s rescue?",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-us-congress-ieepa-us-supreme-court-trade-barriers-us-court-of-international-trade-steel-tariffs-fentanyl-11748533411139.html",
    "timestamp": "2025-05-30T02:30:10Z"
  },
  {
    "title": "Ross Ulbricht Speaks at Bitcoin 2025: 'You Didn’t Forget Me'",
    "description": "Ulbricht called for unity in the crypto community saying its now more \"important than ever to stay true to our principles.\"",
    "link": "https://decrypt.co/322898/ross-ulbricht-speaks-at-bitcoin-2025-you-didnt-forget-me",
    "timestamp": "2025-05-30T02:27:16Z"
  },
  {
    "title": "Less TACO, more chaos theory: The only thing Trump can offer is a crash course in economic uncertainty",
    "description": "The US economic policymaking apparatus is systemically dysfunctional. And rivals stand ready to take full advantage of that fact.\nThe post Less TACO, more chaos theory: The only thing Trump can offer is a crash course in economic uncertainty appeared first on…",
    "link": "http://www.crikey.com.au/2025/05/30/donald-trump-tariffs-courts-economic-uncertainty/",
    "timestamp": "2025-05-30T02:25:43Z"
  },
  {
    "title": "Ben & Jerry's board accuses Israel of 'genocide' in Gaza, deepening Unilever feud",
    "description": "Ben & Jerry's independent board escalates its feud with parent company Unilever, issuing a statement denouncing the Gaza conflict as \"genocide.\"",
    "link": "https://www.israelnationalnews.com/news/409220",
    "timestamp": "2025-05-30T02:23:12Z"
  },
  {
    "title": "Elon exiled, tariffs turfed: Welcome to the MAGA meltdown",
    "description": "The second Trump administration is reverting to type as the pain of actually having to govern kicks in.\nThe post Elon exiled, tariffs turfed: Welcome to the MAGA meltdown appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/30/elon-musk-tariffs-donald-trump-usa-recap/",
    "timestamp": "2025-05-30T02:22:51Z"
  },
  {
    "title": "Trump's Lawyers Claim Kamala Harris' '60 Minutes' Interview Caused Him 'Mental Anguish'",
    "description": "The president reportedly turned down a $15 million settlement offer from CBS because he's seeking millions more and an apology.",
    "link": "https://www.huffpost.com/entry/trump-claim-kamala-harris-60-minutes-interview-mental-anguish_n_6838ebe1e4b09b466de9b66f",
    "timestamp": "2025-05-30T02:22:46Z"
  },
  {
    "title": "Bernie Kerik, who served as NYPD commissioner during 9/11 attacks, dies at 69",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died",
    "link": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
    "timestamp": "2025-05-30T02:19:06Z"
  },
  {
    "title": "US-Chinese trade talks ‘stalled’ – Treasury Secretary",
    "description": "Presidents Trump and Xi may need to get personally involved to accelerate US-Chinese trade talks, Treasury Secretary Scott Bessent has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618338-us-china-trade-talks-stalled/",
    "timestamp": "2025-05-30T02:18:54Z"
  },
  {
    "title": "Ex-NY Police Commissioner Bernie Kerik, Who Pleaded Guilty To Federal Tax Fraud, Has Died",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.",
    "link": "https://www.huffpost.com/entry/us-bernie-kerik-obit_n_68391443e4b03a503eaa4bb8",
    "timestamp": "2025-05-30T02:18:53Z"
  },
  {
    "title": "How Julie Chrisley Feels About Ditching Her Blonde Hair After Prison",
    "description": "Julie Chrisley has left prison a changed woman.\nA day after she and husband Todd Chrisley walked free thanks to presidential pardons from Donald Trump, the Chrisley Knows Best matriarch debuted a...",
    "link": "https://www.eonline.com/news/1418129/julie-chrisley-ditching-blonde-hair-for-good-after-prison",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "Heritage President Argues That America is Entering a ‘Golden Age’",
    "description": "Is America heading into a “golden age” in President Donald Trump’s second term? That was the question put up for discussion Thursday in a Munk... Read More\nThe post Heritage President Argues That America is Entering a ‘Golden Age’ appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/05/29/heritage-president-argues-that-america-is-entering-a-golden-age/",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "DOT Sec. Duffy Announces 'Great American Road Trip' to Stimulate Economy",
    "description": "WASHINGTON, DC — Transportation Secretary Sean Duffy announced his department's project to celebrate the United States' 250th birthday while also stimulating the economy — the Great American Road Trip.\nThe post DOT Sec. Duffy Announces ‘Great American Road Tr…",
    "link": "https://www.breitbart.com/economy/2025/05/29/dot-sec-duffy-announces-great-american-road-trip-to-stimulate-economy/",
    "timestamp": "2025-05-30T02:16:28Z"
  },
  {
    "title": "GM CEO Mary Barra backs Trump’s auto tariffs as a tool to help US manufacturers ‘level the playing field’",
    "description": "General Motors CEO Mary Barra is voicing support for the Trump administration’s automotive tariffs, arguing they allow U.S. automakers to compete more fairly in the international market.",
    "link": "https://nypost.com/2025/05/29/business/gm-ceo-mary-barra-backs-trumps-auto-tariffs-as-a-tool-to-help-us-manufacturers/",
    "timestamp": "2025-05-30T02:16:22Z"
  },
  {
    "title": "Trump's tariffs to remain in effect after appeals court grants stay",
    "description": "A federal appeals court temporarily reinstated the most sweeping of Trump's tariffs a day after a US trade court ruled that Trump had exceeded his authority in imposing the duties and ordered a block",
    "link": "https://www.jpost.com/international/article-856041",
    "timestamp": "2025-05-30T02:16:21Z"
  },
  {
    "title": "U.N. eyes budget and job cuts for 2026 as U.S. scales back aid",
    "description": "The U.N. Secretariat is preparing to cut its $3.7 billion budget by 20% and slash about 6,900 jobs, according to an internal memo.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/un-job-cuts/",
    "timestamp": "2025-05-30T02:16:00Z"
  },
  {
    "title": "US SEC dismisses lawsuit against Binance crypto exchange",
    "description": "The SEC sued Binance and Zhao in June 2023, accusing the exchange of artificially inflating trading volumes, diverting customer funds and misleading investors about its surveillance controls. Binance was also accused of unlawfully facilitating trading of seve…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-sec-dismisses-lawsuit-against-binance-crypto-exchange/articleshow/121502060.cms",
    "timestamp": "2025-05-30T02:15:22Z"
  },
  {
    "title": "Trump's lost control of his tariff see-saw, making his aims even harder",
    "description": "Since Trump's \"Liberation Day\" tariffs were announced, they have been changing constantly. But does the escalating court battle to implement them give the president an off-ramp to soften his second-term trade agenda without facing political fallout?",
    "link": "https://www.abc.net.au/news/2025-05-30/donald-trump-tariff-trade-war-court-uncertainty/105356192",
    "timestamp": "2025-05-30T02:08:31Z"
  },
  {
    "title": "Dollar poised for fifth-straight monthly drop on trade, fiscal uncertainty",
    "description": "The U.S. dollar weakened, marking its fifth consecutive monthly drop. Trade and fiscal uncertainties loomed. Investors awaited a key inflation report. Trump's tariff policies added to market worries. Emerging market currencies gained. The Japanese yen rose af…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-poised-for-fifth-straight-monthly-drop-on-trade-fiscal-uncertainty/articleshow/121501980.cms",
    "timestamp": "2025-05-30T02:07:16Z"
  },
  {
    "title": "Trump administration reverses MSHA office closures",
    "description": "The Trump administration is dropping plans to terminate leases for 34 offices in the Mine Safety and Health Administration.",
    "link": "https://www.wcvb.com/article/trump-administration-reverses-msha-office-closures/64921687",
    "timestamp": "2025-05-30T02:06:07Z"
  },
  {
    "title": "Judge extends block on Harvard foreign student ban",
    "description": "Federal judge extends temporary order blocking the Trump administration's revocation of Harvard's ability to enroll international students.",
    "link": "https://www.israelnationalnews.com/news/409219",
    "timestamp": "2025-05-30T02:01:15Z"
  },
  {
    "title": "President Trump to Hold Press Conference With Elon Musk Friday",
    "description": "Contrary to gossipy media reports, it looks like the bromance between President Donald Trump and Elon Musk is not over.\nThe post President Trump to Hold Press Conference With Elon Musk Friday appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/president-trump-hold-press-conference-elon-musk-friday/",
    "timestamp": "2025-05-30T02:00:56Z"
  },
  {
    "title": "Op-Ed: Tariffs vs government powers – The courts will win eventually.",
    "description": "Now try and convince the rest of the world you’re not out of your minds. It won’t be easy.\nThe post Op-Ed: Tariffs vs government powers – The courts will win eventually. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-tariffs-vs-government-powers-the-courts-will-win-eventually/article",
    "timestamp": "2025-05-30T02:00:53Z"
  },
  {
    "title": "Between a smack and a hard place — Poland votes, Orbán provokes, and Brussels shows its teeth",
    "description": "Slaps were exchanged — some literal, some political — and suddenly Brussels isn’t just watching from the sidelines. This week on EU Confidential, we dive into a whirlwind of action across the continent: a presidential toss-up coming up this Sunday in Poland; …",
    "link": "https://www.politico.eu/podcast/eu-confidential/between-a-smack-and-a-hard-place-poland-votes-orban-provokes-and-brussels-shows-its-teeth/",
    "timestamp": "2025-05-30T02:00:00Z"
  },
  {
    "title": "Trump picks Paul Ingrassia to head U.S. Office of Special Counsel (Swapna Venugopal Ramaswamy/USA Today)",
    "description": "Swapna Venugopal Ramaswamy / USA Today:\nTrump picks Paul Ingrassia to head U.S. Office of Special Counsel  —  President Donald Trump announced Paul Ingrassia, who is currently a White House liaison for the Department of Homeland Security, as his pick to head …",
    "link": "https://www.memeorandum.com/250529/p150",
    "timestamp": "2025-05-30T01:55:01Z"
  },
  {
    "title": "Law Enforcement Titan Bernie Kerik Dead At 69",
    "description": "Former NYPD Commissioner Bernard Kerik died Thursday at the age of 69 after a private battle with cardiac illness, his family confirmed.",
    "link": "https://dailycaller.com/2025/05/29/bernie-kerik-dead-69/",
    "timestamp": "2025-05-30T01:54:15Z"
  },
  {
    "title": "Silk Road Founder Ross Ulbricht to Bitcoiners: ‘Freedom is Worth the Struggle’",
    "description": "Ulbright told the crowd a story from his youth about killing wasps in order to illustrate his point that, without unity and decentralization, there is no freedom.",
    "link": "https://www.coindesk.com/policy/2025/05/29/silk-road-founder-ross-ulbricht-to-bitcoiners-freedom-is-worth-the-struggle",
    "timestamp": "2025-05-30T01:53:34Z"
  },
  {
    "title": "Macron and Hegseth to address China and the Ukraine war at Singapore security forum",
    "description": "World leaders and defense officials are convening in Singapore for a security forum addressing China's assertiveness, the Ukraine war's global impact, and Asian conflicts. Emmanuel Macron's keynote will likely address these issues, including the pressure from…",
    "link": "https://economictimes.indiatimes.com/news/defence/macron-and-hegseth-to-address-china-and-the-ukraine-war-at-singapore-security-forum/articleshow/121501820.cms",
    "timestamp": "2025-05-30T01:52:37Z"
  },
  {
    "title": "Trump denounces court’s 'political' tariff decision, calls on Supreme Court to act quickly",
    "description": "President Trump criticized a recent court ruling on his tariff plan on Thursday. He directed criticism to the Federalist Society and expressed disappointment in judicial nominations.",
    "link": "https://www.foxnews.com/politics/trump-denounces-courts-political-tariff-decision-calls-supreme-court-act-quickly",
    "timestamp": "2025-05-30T01:52:34Z"
  },
  {
    "title": "Western businesses will not return to Russia",
    "description": "Russia’s much-touted “no-limits” partnership with China has proven an inadequate substitute for its largely severed ties to the West.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/30/world/western-businesses-russia-return/",
    "timestamp": "2025-05-30T01:50:00Z"
  },
  {
    "title": "U.S.-China talks 'a bit stalled' and need Trump and Xi to weigh in, Treasury Secretary Bessent says",
    "description": "U.S.-China trade talks are \"a bit stalled,\" requiring the two countries' leaders to speak directly, Treasury Secretary Scott Bessent told Fox News.",
    "link": "https://www.cnbc.com/2025/05/30/us-china-talks-bit-stalled-and-need-trump-and-xi-to-weigh-in-treasury-secretary-bessent-says.html",
    "timestamp": "2025-05-30T01:49:40Z"
  },
  {
    "title": "Republican Says US Should End All Military Aid to Israel",
    "description": "Representative Thomas Massie of Kentucky has previously voted against sending U.S. aid to Israel.",
    "link": "https://www.newsweek.com/thomas-massie-us-israel-military-aid-2078784",
    "timestamp": "2025-05-30T01:48:34Z"
  },
  {
    "title": "Utah Pharmacist Reacts to NBA YoungBoy’s Presidential Pardon",
    "description": "SALT LAKE CITY — A Utah pharmacist is upset the man who admitted to breaking into his pharmacy has been let off the hook. On May 28, President Donald Trump pardoned 25-year-old rapper NBA YoungBoy, who had been sentenced to nearly two years in jail in Utah ba…",
    "link": "https://freerepublic.com/focus/f-news/4319903/posts",
    "timestamp": "2025-05-30T01:47:52Z"
  },
  {
    "title": "What is Humphrey's Executor? A look at the 90-year-old Supreme Court decision",
    "description": "WASHINGTON (AP) — A month into President Donald Trump ‘s second term, lawyers for the Republican administration seem intent on provoking a legal fight to overturn a 90-year-old Supreme Court decision known as Humphrey’s Executor that has been critical to the …",
    "link": "https://www.theusconstitution.org/news/what-is-humphreys-executor-a-look-at-the-90-year-old-supreme-court-decision-trump-is-targeting/",
    "timestamp": "2025-05-30T01:47:00Z"
  },
  {
    "title": "FBI leaders say jail video shows that Jeffrey Epstein died by suicide",
    "description": "FBI leaders Kash Patel and Dan Bongino say surveillance video shows that convicted sex offenderJeffrey Epstein died by suicide in his jail cell in 2019.",
    "link": "https://www.nbcnews.com/politics/justice-department/dan-bongino-kash-patel-jeffrey-epstein-rcna209871",
    "timestamp": "2025-05-30T01:46:10Z"
  },
  {
    "title": "Rosie O’Donnell on Romancing Miranda in ‘And Just Like That’ and Moving to Ireland to Escape Trump: ‘When Would It Be Safe to Come Back?’",
    "description": "SPOILER ALERT: This story contains spoilers for “Outlook Good,” Season 3, Episode 1 of “And Just Like That,” now streaming on HBO Max. And just like that, Rosie O’Donnell has made a splashy return to comedy.  On the season premiere of “And Just Like That,” O’…",
    "link": "https://variety.com/2025/tv/news/rosie-odonnell-and-just-like-that-ireland-trump-1236399222/",
    "timestamp": "2025-05-30T01:44:00Z"
  },
  {
    "title": "Targeting Foreign Students, Trump Hits A US Lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India.",
    "link": "https://www.ibtimes.com.au/targeting-foreign-students-trump-hits-us-lifeline-1859157",
    "timestamp": "2025-05-30T01:42:24Z"
  },
  {
    "title": "Targeting foreign students, Trump hits a US lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India. Now back at the…",
    "link": "https://www.digitaljournal.com/world/targeting-foreign-students-trump-hits-a-us-lifeline/article",
    "timestamp": "2025-05-30T01:42:20Z"
  },
  {
    "title": "Rocket Lab signs $460 million deal to build missile defence system",
    "description": "The aim of the defence dome is to create a shield that can shoot down all sorts of missiles including nuclear warheads.",
    "link": "https://www.rnz.co.nz/news/business/562663/rocket-lab-signs-460-million-deal-to-build-missile-defence-system",
    "timestamp": "2025-05-30T01:42:16Z"
  },
  {
    "title": "Targeting Foreign Students, Trump Hits A US Lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India.",
    "link": "https://www.ibtimes.com/targeting-foreign-students-trump-hits-us-lifeline-3774902",
    "timestamp": "2025-05-30T01:42:15Z"
  },
  {
    "title": "Trump admin said to be considering 15% tariffs for 150 days",
    "description": "United States President Donald Trump's administration is allegedly considering imposing 15% tariffs on large parts of the global economy for 150 days, invoking an existing trade law that would all...",
    "link": "https://biztoc.com/x/121a59a9af17dcb0",
    "timestamp": "2025-05-30T01:42:12Z"
  },
  {
    "title": "Trump Says He Is Having Elon Musk Over At The White House Tomorrow For A Press Conference As Billionaire Exits Government: 'This Will Be His Last Day, But Not Really…'",
    "description": "On Thursday night, President Donald Trump said that he will host Elon Musk at the White House on Friday to mark the Tesla Inc. (NASDAQ:TSLA) CEO's departure from his official role leading the administration's Department of Government Efficiency.\nWhat Happened…",
    "link": "https://biztoc.com/x/3409d022b0c60d25",
    "timestamp": "2025-05-30T01:41:30Z"
  },
  {
    "title": "DOGE is already catastrophic and will continue to be",
    "description": "As Elon at least formally (although not necessarily in terms of actual influence) steps away from his government role, it’s critical to accurately summarize what he’s done: The flood of encomiums and morality tales about Elon's turn in Washington cldn't be mo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/doge-is-already-catastrophic-and-will-continue-to-be",
    "timestamp": "2025-05-30T01:41:12Z"
  },
  {
    "title": "Julie Chrisley Has No Plans to Return to Blonde Hair After Prison Stay",
    "description": "Julie Chrisley is not planning to return to her trademark blonde hairstyle now that she and husband Todd have been released from prison, according to her son Chase. Chase, 28, weighed in on his mom’s locks while speaking to Entertainment Tonight on Thursday, …",
    "link": "https://www.usmagazine.com/celebrity-news/news/julie-chrisley-hair-change-after-prison-chase-chrisley-reacts/#article",
    "timestamp": "2025-05-30T01:36:56Z"
  },
  {
    "title": "UN may cut staff by 20%, internal memo says",
    "description": "The United Nations plans to reduce its budget by 20 percent. Around 6,900 jobs may be cut. This is due to a financial crisis. The United States owes the UN $1.5 billion. The cuts are part of a review to ensure the UN is fit for purpose. Secretary General Anto…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/un-may-cut-staff-by-20-internal-memo-says/articleshow/121501696.cms",
    "timestamp": "2025-05-30T01:36:26Z"
  },
  {
    "title": "The US academic partnership with China, under strain for years, faces its biggest threat",
    "description": "America and China's academic relations face strain. The US plans to revoke visas for some Chinese students. This move worries universities, which benefit from Chinese tuition. Some fear a loss of talent and research collaboration. Critics cite security risks …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-us-academic-partnership-with-china-under-strain-for-years-faces-its-biggest-threat/articleshow/121501688.cms",
    "timestamp": "2025-05-30T01:35:17Z"
  },
  {
    "title": "Todd Chrisley smiles in first public outing since Trump pardon",
    "description": "Todd Chrisley looked happy as he went on his first public outing on Thursday following his release from prison.",
    "link": "https://nypost.com/2025/05/29/entertainment/todd-chrisley-smiles-in-first-public-outing-since-trump-pardon/",
    "timestamp": "2025-05-30T01:34:14Z"
  },
  {
    "title": "Top Japan shipper sees orders recovering as trade tensions ease",
    "description": "Nippon Yusen saw a robust recovery in container shipping orders following an easing in tensions between the United States and some of its trading partners this month.",
    "link": "https://www.japantimes.co.jp/business/2025/05/30/companies/japan-shipper-orders-recover/",
    "timestamp": "2025-05-30T01:34:00Z"
  },
  {
    "title": "Analysis: South Korea's presidential election set to reshape policies for key US ally",
    "description": "SEOUL: South Korean liberal candidate Lee Jae-myung is projected to win next week's",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-presidential-election-reshape-policies-us-ally-5159571",
    "timestamp": "2025-05-30T01:31:02Z"
  },
  {
    "title": "Someone Is Reportedly Impersonating Trump’s Chief of Staff in Texts to GOP Bigwigs and Business Titans",
    "description": "Federal officials are investigating an impersonation of White House Chief of Staff Susie Wiles, The Wall Street Journal reported on Thursday night.\nThe post Someone Is Reportedly Impersonating Trump’s Chief of Staff in Texts to GOP Bigwigs and Business Titans…",
    "link": "https://www.mediaite.com/politics/trump/someone-is-reportedly-impersonating-trumps-chief-of-staff-in-texts-to-gop-bigwigs-and-business-titans/",
    "timestamp": "2025-05-30T01:30:52Z"
  },
  {
    "title": "Drones, doubts as US allies look to NATO summit",
    "description": "Estonia focuses on advanced military tech amid Russian pressure. Baltic states and others boost defense spending. The US plans troop cuts in Europe, pushing NATO allies to increase defense spending. US shifts focus to homeland defense and China. Concerns aris…",
    "link": "https://economictimes.indiatimes.com/news/defence/drones-doubts-as-us-allies-look-to-nato-summit/articleshow/121501648.cms",
    "timestamp": "2025-05-30T01:30:25Z"
  },
  {
    "title": "Taoiseach Micheál Martin urges calm after Fianna Fáil TD says British Army never shot Irish civilians",
    "description": "There was “horrendous violence” in the North “perpetrated by the British state and other actors, but the emphasis now has to be on reconciliation”, Taoiseach Micheál Martin has said.",
    "link": "https://www.independent.ie/irish-news/taoiseach-micheal-martin-urges-calm-after-fianna-fail-td-says-british-army-never-shot-irish-civilians/a634554899.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Nandita Bose: The tumultuous tour of Trump’s tech-bro-in-chief comes to an end",
    "description": "Elon Musk’s White House exit  was quick and unceremonious. He did not have a formal conversation with Donald Trump before announcing his exit, according to a source with knowledge of the matter, who added that his departure was decided “at a senior staff leve…",
    "link": "https://www.independent.ie/world-news/north-america/nandita-bose-the-tumultuous-tour-of-trumps-tech-bro-in-chief-comes-to-an-end/a1107216876.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Donald Trump commutes notorious gang leader’s sentence after lobbying by Kanye West",
    "description": "US president Donald Trump has commuted the sentence of notorious former gang leader Larry Hoover after being lobbied for years by Kanye West.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-commutes-notorious-gang-leaders-sentence-after-lobbying-by-kanye-west/a1350246422.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Waterland eyes €150m of Irish deals despite Trump tariff uncertainty",
    "description": "Irish companies focused on European expansion are now a better investment bet than US-oriented ventures, according to Laura Dillon of Waterland Private Equity, which has emerged as a significant backer of SMEs here since 2019.",
    "link": "https://www.independent.ie/business/small-business/waterland-eyes-150m-of-irish-deals-despite-trump-tariff-uncertainty/a1237449011.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Irish fintech mogul Terry Clune won’t be bidding for UK currency group Argentex",
    "description": "Irish fintech entrepreneur Terry Clune does not now intend to make an offer to buy embattled listed UK currency management services minnow Argentex.",
    "link": "https://www.independent.ie/business/irish-fintech-mogul-terry-clune-wont-be-bidding-for-uk-currency-group-argentex/a978574967.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Musk said he's leaving the White House. Here's what we do (and don't) know about the departure",
    "description": "In an X post, the tech billionaire announced his \"scheduled time as a Special Government Employee\" had come to an end.",
    "link": "https://www.snopes.com//news/2025/05/30/musk-leaving-white-house/",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Nigel Farage’s ‘fantasies’ would ruin the UK economy, warns Keir Starmer",
    "description": "Reform UK leader Nigel Farage is attempting to woo younger voters by announcing a Donald Trump-style foray into cryptocurrency policy at a Bitcoin conference in Las Vegas late yesterday.",
    "link": "https://www.independent.ie/world-news/britain/nigel-farages-fantasies-would-ruin-the-uk-economy-warns-keir-starmer/a491679364.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Taoiseach Micheál Martin urges calm after Fianna Fáil TD says British Army never shot Irish civilians",
    "description": "There was “horrendous violence” in the North “perpetrated by the British state and other actors, but the emphasis now has to be on reconciliation”, Taoiseach Micheál Martin has said.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-micheal-martin-urges-calm-after-fianna-fail-td-says-british-army-never-shot-irish-civilians/a634554899.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Trump wins temporary relief as court allows tariffs under emergency powers",
    "description": "This comes after a lower federal trade court ruled that Trump had overstepped his authority by imposing sweeping tariffs on imports from multiple countries, citing a national emergency",
    "link": "https://www.thehindubusinessline.com/news/world/trump-wins-temporary-relief-as-court-allows-tariffs-under-emergency-powers/article69636284.ece",
    "timestamp": "2025-05-30T01:27:41Z"
  },
  {
    "title": "A bad wrap: An angry Trump blasts the ‘TACO Theory’",
    "description": "President Donald Trump made no pretense at hiding his irritation this week when he was asked by a reporter about “TACO” — an acronym that has been gaining traction among Wall Street traders who believe that “Trump Always Chickens Out.”  The so-called “TACO Th…",
    "link": "https://www.digitaljournal.com/world/a-bad-wrap-an-angry-trump-blasts-the-taco-theory/article",
    "timestamp": "2025-05-30T01:27:32Z"
  },
  {
    "title": "A Bad Wrap: An Angry Trump Blasts The 'TACO Theory'",
    "description": "President Donald Trump made no pretense at hiding his irritation this week when he was asked by a reporter about \"TACO\" -- an acronym that has been gaining traction among Wall Street traders who believe that \"Trump Always Chickens Out.\"",
    "link": "https://www.ibtimes.com/bad-wrap-angry-trump-blasts-taco-theory-3774900",
    "timestamp": "2025-05-30T01:27:11Z"
  },
  {
    "title": "Bernard Kerik, former New York police commissioner and 9/11 figure, dies at 69",
    "description": "Bernard Kerik, former NYC police commissioner and 9/11 hero, dies at 69. Known for his rise during 9/11, later faced legal issues, and was pardoned by Trump.",
    "link": "https://www.foxnews.com/us/bernard-kerik-former-new-york-police-commissioner-9-11-figure-dies-69",
    "timestamp": "2025-05-30T01:26:25Z"
  },
  {
    "title": "Trump administration weighs 15% tariffs for 150 days under existing law: Report",
    "description": "The Trump administration is reportedly considering a temporary plan to impose tariffs of up to 15% on goods from around the world, using an existing law that permits such measures for 150 days. According to The Wall Street Journal, this would act as a stopgap…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-weighs-15-tariffs-for-150-days-under-existing-law-report/articleshow/121501620.cms",
    "timestamp": "2025-05-30T01:26:02Z"
  },
  {
    "title": "Trump administration considers allowing tariffs of up to 15% for 150 days, WSJ reports",
    "description": "President Donald Trump's administration is considering a stopgap effort to impose tariffs on large parts of the global economy under an existing law that includes language allowing for tariffs of up to 15 per cent for 150 days, the Wall Street Journal reporte…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-considers-allowing-tariffs-up-15-150-days-wsj-reports-5159601",
    "timestamp": "2025-05-30T01:23:36Z"
  }
]