[
  {
    "title": "Stephen Colbert Confirms Final Air Date for ‘The Late Show’ on CBS",
    "description": "The late night staple first premiered in 1993\nThe post Stephen Colbert Confirms Final Air Date for ‘The Late Show’ on CBS appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/the-late-show-with-stephen-colbert-end-date/",
    "timestamp": "2026-01-27T18:54:08Z"
  },
  {
    "title": "CBS News Reporter Blames Nick Shirley For Anti-ICE Riots",
    "description": "A CBS reporter claimed Nick Shirley’s expose on fraud at Somali-run day care centers was to blame for the violent clashes between federal and left-wing rioters.",
    "link": "https://dailycaller.com/2026/01/27/cbs-news-reporter-blames-nick-shirley-for-anti-ice-riots/",
    "timestamp": "2026-01-27T18:53:54Z"
  },
  {
    "title": "Will Taxpayers Fund UFC White House Card Arena Construction? Dana White Reveals the Truth",
    "description": "Will taxpayers have to foot the bill for the construction of the arena that will hold June’s UFC White House […]",
    "link": "https://sportsnaut.com/ufc/ufc-white-house-card-arena-construction-cost",
    "timestamp": "2026-01-27T18:53:17Z"
  },
  {
    "title": "Trump: Homeland Security Secretary Kristi Noem will remain in her position, has done a very good job",
    "description": "He described the death of an American protester from federal agents’ gunfire in Minneapolis as “very sad”\nThe post Trump: Homeland Security Secretary Kristi Noem will remain in her position, has done a very good job appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/01/27/trump-homeland-security-secretary-kristi-noem-will-remain-in-her-position-has-done-a-very-good-job/",
    "timestamp": "2026-01-27T18:51:01Z"
  },
  {
    "title": "US intensifies strikes in Somalia after Nigeria bombardment",
    "description": "The US has increased the pace of its air strikes against Al-Shabaab and Islamic State in Somalia this year, part of a broader push on the continent.\n\nRead More: https://punchng.com/us-intensifies-strikes-in-somalia-after-nigeria-bombardment/",
    "link": "https://punchng.com/us-intensifies-strikes-in-somalia-after-nigeria-bombardment/",
    "timestamp": "2026-01-27T18:50:39Z"
  },
  {
    "title": "Alex Vindman, key figure in Trump's first impeachment, enters Florida Senate race",
    "description": "Vindman was serving on the National Security Council in 2019 when Trump pressured Ukrainian President Volodymyr Zelenskyy to investigate Joe Biden.",
    "link": "https://www.pbs.org/newshour/politics/alex-vindman-key-figure-in-trumps-first-impeachment-enters-florida-senate-race",
    "timestamp": "2026-01-27T18:50:07Z"
  },
  {
    "title": "Never Trumper Rick Wilson Targets Stephen Miller: 'Tried and Convicted and F*cking Dangles’",
    "description": "Lincoln Project co-founder Rick Wilson unleashed a profane and incendiary tirade against Deputy Chief of Staff for Policy and Homeland Security Advisor Stephen Miller likening him to a Nazi war criminal.\nThe post Never Trumper Rick Wilson Targets Stephen Mill…",
    "link": "https://www.breitbart.com/politics/2026/01/27/never-trumper-rick-wilson-targets-stephen-miller-tried-and-convicted-and-fcking-dangles/",
    "timestamp": "2026-01-27T18:49:34Z"
  },
  {
    "title": "Carney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos",
    "description": "Carney plans to diversify Canada’s trade away from the U.S.",
    "link": "https://www.bostonherald.com/2026/01/27/carney-trump-trade/",
    "timestamp": "2026-01-27T18:49:16Z"
  },
  {
    "title": "Greenland’s Inuit have spent decades fighting for self-determination",
    "description": "Greenland’s inhabitants call it Kalaallit Nunaat, or land of the Kalaallit. It is an Indigenous nation whose relatively few people now mostly govern themselves.",
    "link": "https://theconversation.com/greenlands-inuit-have-spent-decades-fighting-for-self-determination-274268",
    "timestamp": "2026-01-27T18:48:31Z"
  },
  {
    "title": "Trump Says 'Very Good Things Happening' on Ukraine, Russia Talks",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump on Tuesday estimated the progress made in the talks on Russia and Ukraine as very positive.",
    "link": "https://sputnikglobe.com/20260127/trump-says-very-good-things-happening-on-ukraine-russia-talks-1123538283.html",
    "timestamp": "2026-01-27T18:48:01Z"
  },
  {
    "title": "Two-Thirds Of House Dems Are Calling For Noem’s Impeachment - UPDATED",
    "description": "On Monday afternoon, NOTUS reported that in the wake of the second DHS murder of an American citizen, 142 House Democrats, including several from swing districts, have signed a resolution calling for Department of Homeland Security Secretary Kristi Noem to be…",
    "link": "https://crooksandliars.com/2026/01/two-thirds-house-dems-are-calling-noem-s",
    "timestamp": "2026-01-27T18:48:00Z"
  },
  {
    "title": "Trump Screams 'You Can't Have Guns. You Can't Walk In With Guns'",
    "description": "During a Trump gaggle in front of a very noisy Air Force One helicopter, Trump clearly said that you can't have guns at protests, which is a u-turn from the thoughts he had about Kyle Rittenhouse gunning down 2 men at a protest and injuring another.\nI can't s…",
    "link": "https://crooksandliars.com/2026/01/trump-screams-you-cant-have-guns-you-cant",
    "timestamp": "2026-01-27T18:47:43Z"
  },
  {
    "title": "VIDEO: Librarian Accused of Trying to Recruit Social Media Users to Assassinate President Trump",
    "description": "A librarian from Ripley, West Virginia, is accused of trying to recruit people on social media to assassinate President Donald Trump.\nThe post VIDEO: Librarian Accused of Trying to Recruit Social Media Users to Assassinate President Trump appeared first on Br…",
    "link": "https://www.breitbart.com/crime/2026/01/27/video-librarian-accused-trying-recruit-social-media-users-assassinate-president-trump/",
    "timestamp": "2026-01-27T18:46:58Z"
  },
  {
    "title": "Why have homicide rates reportedly plummeted in the last year?",
    "description": "There could be more to the issue than politics",
    "link": "https://theweek.com/crime/homicide-rates-plummeted-last-year",
    "timestamp": "2026-01-27T18:45:43Z"
  },
  {
    "title": "The Fed releases its latest interest rate decision Wednesday. Here's what to expect",
    "description": "This week's meeting offers little suspense and probably not much action, even as massive changes loom over the Fed's longer-term direction.",
    "link": "https://www.cnbc.com/2026/01/27/fed-preview-january-2026.html",
    "timestamp": "2026-01-27T18:45:18Z"
  },
  {
    "title": "WATCH: 'You can't have guns. You can't walk in with guns,' Trump says of Alex Pretti killing",
    "description": "The president's remarks reiterates a talking point from the administration that Pretti should not have brought a legally carried handgun to the scene — a position that has infuriated gun rights advocates.",
    "link": "https://www.pbs.org/newshour/politics/watch-you-cant-have-guns-you-cant-walk-in-with-guns-trump-says-of-alex-pretti-killing",
    "timestamp": "2026-01-27T18:44:24Z"
  },
  {
    "title": "US and Iran engage in shadow-boxing as US armada arrives in Gulf",
    "description": "Tehran warns of attacks against Washington’s regional allies and assets if it is targeted",
    "link": "https://www.irishtimes.com/world/middle-east/2026/01/27/us-and-iran-engage-in-shadow-boxing-as-us-armada-arrives-in-gulf/",
    "timestamp": "2026-01-27T18:44:13Z"
  },
  {
    "title": "Trump calls Minneapolis killing 'a very sad situation' as he backs Homeland Security chief",
    "description": "Trump also rejected the ‘assassin’ label used by a top aide to describe the shooting victim, but said that people could not go to protests with guns.",
    "link": "https://www.thejournal.ie/minneapolis-trump-6940076-Jan2026/",
    "timestamp": "2026-01-27T18:43:20Z"
  },
  {
    "title": "Tim Cook chooses riches over justice and coddles the evil ways of dictator Trump",
    "description": "Opinion: While Americans were reeling from the killing of Alex Pretti in Minnesota, Tim Cook chose to attend a nauseatingly tone-deaf screening of a glossy documentary about Melania Trump. A vanity project soaked in controversy and obscene money, writes John …",
    "link": "https://www.advocate.com/opinion/tim-cook-melania-trump",
    "timestamp": "2026-01-27T18:42:46Z"
  },
  {
    "title": "“We Know You Live Right Here”: ICE Agents Follow Protesters Home",
    "description": "Federal agents in Maine are now threatening ICE watchers at their homes.Liz Eisele McLellan, a volunteer ICE watcher monitoring the intensifying federal operations in Maine, told the Portland Press Herald that a federal agent came to her home to threaten her.…",
    "link": "https://newrepublic.com/post/205759/ice-agents-follow-protesters-home-maine-minnesota",
    "timestamp": "2026-01-27T18:41:29Z"
  },
  {
    "title": "Carney, Poilievre square off in House of Commons for first time this year",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/carney-poilievre-question-period-9.7063235",
    "timestamp": "2026-01-27T18:41:18Z"
  },
  {
    "title": "Biden speaks out against immigration crackdown in Minnesota, says it goes against American values",
    "description": "Former President Joe Biden slams President Donald Trump's federal immigration crackdown in Minnesota, saying it \"betrays our basic values as Americans.\"",
    "link": "https://www.foxnews.com/politics/biden-speaks-out-against-immigration-crackdown-minnesota-says-goes-against-american-values",
    "timestamp": "2026-01-27T18:41:13Z"
  },
  {
    "title": "House Freedom Caucus draws line on DHS, ICE funding as Minneapolis unrest fuels shutdown risk",
    "description": "House Freedom Caucus leaders warn they will block any deal that strips DHS and ICE funding, setting up a high-stakes shutdown fight tied to unrest in Minneapolis.",
    "link": "https://www.foxnews.com/politics/house-freedom-caucus-draws-line-dhs-ice-funding-minneapolis-unrest-fuels-shutdown-risk",
    "timestamp": "2026-01-27T18:40:26Z"
  },
  {
    "title": "The new MAGA owners of TikTok are censoring content about Epstein, ICE, and Israel",
    "description": "TikTok was forced to sell to American owners to comply with a federal law. The transfer of ownership happened five days ago and we're already seeing the effects of it. There isn't one new owner of TikTok but rather a collection of companies and investment fir…",
    "link": "https://ohnotheydidnt.livejournal.com/131829937.html",
    "timestamp": "2026-01-27T18:40:12Z"
  },
  {
    "title": "Work on Gateway tunnel project linking New York and New Jersey to pause next month without federal dollars (Ry Rivard/Politico)",
    "description": "Ry Rivard / Politico:\nWork on Gateway tunnel project linking New York and New Jersey to pause next month without federal dollars … But President Donald Trump has taunted Senate Minority Leader Chuck Schumer, a New York Democrat who has championed the rail lin…",
    "link": "https://www.memeorandum.com/260127/p75",
    "timestamp": "2026-01-27T18:40:03Z"
  },
  {
    "title": "Walz Silent After Condemnations of His Comparing ICE Operations to Holocaust",
    "description": "The office of Minnesota Gov. Tim Walz has not responded to condemnations of his comparing illegal alien children to Holocaust victim Anne Frank. The U.S. Holocaust Museum... Read More\nThe post Walz Silent After Condemnations of His Comparing ICE Operations to…",
    "link": "https://www.dailysignal.com/2026/01/27/walz-silent-after-condemnations-of-his-comparing-ice-operations-to-holocaust/",
    "timestamp": "2026-01-27T18:40:00Z"
  },
  {
    "title": "Renowned Composer Philip Glass Withdraws Symphony from the Kennedy Center",
    "description": "\"The values of Kennedy Center today are in direct conflict with the message of the symphony,\" Glass wrote in his announcement.",
    "link": "https://www.artnews.com/art-news/news/composer-philip-glass-withdraws-symphony-kennedy-center-1234771138/",
    "timestamp": "2026-01-27T18:39:39Z"
  },
  {
    "title": "Trump’s Board of Peace Will Help Strong Countries Dominate Weak Ones",
    "description": "In Gaza, it will legitimize Israeli land grabs and ethnic cleansing.",
    "link": "http://foreignpolicy.com/2026/01/27/trump-board-peace-strong-countries-dominate-weak-israel-gaza/",
    "timestamp": "2026-01-27T18:37:45Z"
  },
  {
    "title": "Stephen Colbert Reveals ‘The Late Show’ End Date",
    "description": "The Late Show is coming to an end and the goodbye party now has a date. The Stephen Colbert-hosted late-night show will end on Thursday, May 21, Deadline has confirmed. CBS always said that the series, which has been running since 1993, was going to end in Ma…",
    "link": "http://deadline.com/2026/01/the-late-show-with-stephen-colbert-final-episode-date-1236698681/",
    "timestamp": "2026-01-27T18:37:05Z"
  },
  {
    "title": "Sean Spicer Says Kristi Noem Can’t Come Back From Her Response To Border Patrol Killing",
    "description": "Former White House press secretary Sean Spicer argued that DHS Secretary Kristi Noem will not survive much longer in the administration.",
    "link": "https://dailycaller.com/2026/01/27/sean-spicer-kristi-noem-alex-pretti/",
    "timestamp": "2026-01-27T18:34:24Z"
  },
  {
    "title": "Killing of Alex Pretti scrambles Second Amendment politics for Trump",
    "description": "The blowback against the administration from core Trump supporters comes as Republicans are trying to protect their threadbare majority in the U.S. House and face several competitive Senate races.",
    "link": "https://www.pbs.org/newshour/politics/killing-of-alex-pretti-scrambles-second-amendment-politics-for-trump",
    "timestamp": "2026-01-27T18:33:47Z"
  },
  {
    "title": "Philip Glass Cancels Kennedy Center World Premiere Amid MAGA Takeover",
    "description": "Prolific pianist and composer Phillip Glass is boycotting the Kennedy Center, adding his name to a growing list of performers who have pulled their performances in the wake of President Trump’s hostile takeover.“After thoughtful consideration, I have decided …",
    "link": "https://newrepublic.com/post/205760/philip-glass-cancels-kennedy-center-premiere",
    "timestamp": "2026-01-27T18:33:30Z"
  },
  {
    "title": "House Democrats tell Trump to fire DHS chief Noem or they will start impeachment proceedings against her",
    "description": "Department of Homeland Security Secretary Kristi Noem has faced strong criticism for her caustic comments on Alex Pretti, the U.S. citizen killed by a federal agent in Minnesota.",
    "link": "https://www.cnbc.com/2026/01/27/house-democrats-kristi-noem-impeachment-trump.html",
    "timestamp": "2026-01-27T18:32:50Z"
  },
  {
    "title": "Mess halls get a re-do: Trump trades 'mystery meat' for MAHA meals",
    "description": "As America's Armed Services are experiencing a boost in recruitment under Trump 2.0, their health and meals will soon get a boost as well, with a watchful eye on how we feed our soldiers.",
    "link": "https://justthenews.com/politics-policy/health/mess-hall-glow-trump-trades-mre-mystery-meat-maha-meals",
    "timestamp": "2026-01-27T18:31:54Z"
  },
  {
    "title": "James Comer Tells Trump To Pull ICE Out Of MInnesota",
    "description": "Speaking with Fox News' Maria Bartiromo on Sunday, The House Chairman of the Oversight Committee, James Comer told Trump to remove Immigration and Customs Enforcement from Minnesota after the vicious killing of Alex Pretti by ICE agents while being interviewe…",
    "link": "https://crooksandliars.com/2026/01/james-comer-tells-trump-pull-ice-out",
    "timestamp": "2026-01-27T18:31:50Z"
  },
  {
    "title": "Washington Post staffers feeling 'betrayed' as turmoil, looming layoffs rock billionaire Jeff Bezos’ newsroom",
    "description": "The Washington Post is facing the specter of another round of major layoffs, and staffers are feeling \"betrayed\" by billionaire owner Jeff Bezos.",
    "link": "https://www.foxnews.com/media/washington-post-staffers-feeling-betrayed-turmoil-looming-layoffs-rock-newsroom",
    "timestamp": "2026-01-27T18:30:48Z"
  },
  {
    "title": "Why ‘TACO Trump’ Can’t Really Chicken Out on Mass Deportation",
    "description": "Despite talk of a pivot after the fatal shooting of Alex Pretti, the reality is Trump has invested too much in violent immigration rhetoric and ICE tactics to turn back now. Here’s why ‘TACO Trump’ can’t really chicken out on mass deportation.",
    "link": "http://nymag.com/intelligencer/article/taco-trump-cant-really-chicken-out-on-mass-deportation.html",
    "timestamp": "2026-01-27T18:30:22Z"
  },
  {
    "title": "Greg Bovino 'scapegoated' to protect 'still armed' killer of Alex Pretti: analysis",
    "description": "Border Patrol Chief Greg Bovino was ousted Monday amid the fallout from the fatal shooting of Alex Pretti, but on Tuesday, journalist Peter Rothpletz warned that the Trump administration was “scapegoating” Bovino in an effort to shield both itself and Pretti’…",
    "link": "https://www.rawstory.com/alex-pretti-2675039899/",
    "timestamp": "2026-01-27T18:29:41Z"
  },
  {
    "title": "Israel plans large camp for Palestinians in southern Gaza, retired general says",
    "description": "By Pesha MagidJERUSALEM, Jan 27 (Reuters) - Israel has cleared land in southern Gaza for the construction of a camp for Palestinians potentially equipped with surveillanc… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/27/israel-plans-large-camp-for-palestinians-in-southern-gaza-retired-general-says",
    "timestamp": "2026-01-27T18:29:29Z"
  },
  {
    "title": "Carney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos (Rob Gillies/Associated Press)",
    "description": "Rob Gillies / Associated Press:\nCarney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos  —  Canadian Prime Minister Mark Carney said Tuesday he told U.S. President Donald Trump that he meant what he said in his speech at D…",
    "link": "https://www.memeorandum.com/260127/p73",
    "timestamp": "2026-01-27T18:25:03Z"
  },
  {
    "title": "‘Fire’ and ‘ICE’: Fetterman Sets Own Path on Immigration Issue",
    "description": "As Congress battles over homeland security funding ahead of a potential government shutdown, Pennsylvania Democrat Sen. John Fetterman is calling to keep the government open... Read More\nThe post ‘Fire’ and ‘ICE’: Fetterman Sets Own Path on Immigration Issue …",
    "link": "https://www.dailysignal.com/2026/01/27/fire-and-ice-fetterman-sets-own-path-on-immigration-issue/",
    "timestamp": "2026-01-27T18:25:00Z"
  },
  {
    "title": "Why Starmer's reset moment with China 'carries consequence'",
    "description": "Sir Keir Starmer will have to walk a tightrope during his trip to China, as he tries to drive investment from Beijing, while avoiding upsetting US President Donald Trump.",
    "link": "https://news.sky.com/story/why-sir-keir-starmers-reset-moment-with-china-carries-consequence-13499749",
    "timestamp": "2026-01-27T18:25:00Z"
  },
  {
    "title": "CNN Data Guru Reveals Trump’s Economy Ratings Have Crashed to Biden-Level Lows: ‘Eating’ His ‘Presidency Alive’",
    "description": "CNN chief data analyst Harry Enten broke down how President Donald Trump's low economy ratings could cost Republicans control of Congress later this year.\nThe post CNN Data Guru Reveals Trump’s Economy Ratings Have Crashed to Biden-Level Lows: ‘Eating’ His ‘P…",
    "link": "https://www.mediaite.com/politics/cnn-data-guru-reveals-trumps-economy-ratings-have-crashed-to-biden-level-lows-eating-his-presidency-alive/",
    "timestamp": "2026-01-27T18:24:18Z"
  },
  {
    "title": "Melania Trump goes behind the scenes of inauguration, details 'cordial' time spent with Bidens",
    "description": "First lady Melania Trump promotes upcoming \"MELANIA\" movie while discussing her role supporting President Donald Trump during inauguration on \"Fox & Friends.\"",
    "link": "https://www.foxnews.com/media/melania-trump-goes-behind-scenes-inauguration-details-cordial-time-spent-bidens",
    "timestamp": "2026-01-27T18:22:23Z"
  },
  {
    "title": "US Links Security Guarantees for Ukraine to Peace Deal Ceding Donbas",
    "description": "The Trump administration has signaled to Ukraine that U.S. security guarantees would depend on Kyiv first agreeing to a peace deal likely requiring it to cede the Donbas region to Russia, the Financial Times reported on Tuesday, citing eight people familiar w…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364209/posts",
    "timestamp": "2026-01-27T18:22:15Z"
  },
  {
    "title": "Ted Cruz says Trump officials should tone down 'terrorist' rhetoric after ICE shootings",
    "description": "U.S. Sen Ted Cruz is urging the Trump administration to rethink its handling of the recent shooting of protestors by Immigration and Customers Enforcement officers in Minnesota. While Cruz praised the administration's crackdown on illegal immigration, he is t…",
    "link": "https://freerepublic.com/focus/f-news/4364208/posts",
    "timestamp": "2026-01-27T18:22:03Z"
  },
  {
    "title": "Polish ex-president lands role at US Project 2025 think tank",
    "description": "Andrzej Duda's job at the influential Heritage Foundation underlines how nationalist right-wing politics have become international.",
    "link": "https://www.politico.eu/article/polish-ex-president-lands-role-us-project-2025-think-tank-andrzej-duda/",
    "timestamp": "2026-01-27T18:20:43Z"
  },
  {
    "title": "How did Tucker Carlson become one of the far right's most influential voices?",
    "description": "Writer Jason Zengerle says Carlson had the foresight to see Trump's potential in 2015. Now he's someone the president \"definitely listens to.\" Zengerle's new book is Hated by All the Right People.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5688915/tucker-carlson-hated-by-all-the-right-people-jason-zengerle",
    "timestamp": "2026-01-27T18:20:32Z"
  },
  {
    "title": "‘Nothing about what is going on here is normal’: A fight over evidence in Good, Pretti cases",
    "description": "Hours after Gov. Tim Walz said President Donald Trump was open to an independent state investigation into the fatal shootings of Renee Good and Alex Pretti by federal agents this month, Minnesota state and local lawyers told a federal judge Monday that they h…",
    "link": "https://www.advocate.com/politics/fight-evidence-good-pretti-ice",
    "timestamp": "2026-01-27T18:18:09Z"
  },
  {
    "title": "What to know about Gregory Bovino and his role in Trump's immigration crackdown",
    "description": "Gregory Bovino had been the go-to architect for the large-scale immigration crackdowns ordered by Trump and the public face of his administration's city-by-city sweeps.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-gregory-bovino-and-his-role-in-trumps-immigration-crackdown",
    "timestamp": "2026-01-27T18:17:22Z"
  },
  {
    "title": "Reporter Straight-Up Asks Trump ‘Was Alex Pretti’s Death Justified?’ After Officials Called Him ‘Assassin,’ ‘Terrorist’",
    "description": "Trump was confronted by a reporter who straight-up asked \"Was Alex Pretti's death justified?\" after Trump officials called the man\"terrorist\" and \"assassin.\"\nThe post Reporter Straight-Up Asks Trump ‘Was Alex Pretti’s Death Justified?’ After Officials Called …",
    "link": "https://www.mediaite.com/media/news/reporter-straight-up-asks-trump-was-alex-prettis-death-justified-after-officials-called-him-assassin-terrorist/",
    "timestamp": "2026-01-27T18:17:09Z"
  },
  {
    "title": "EU Bans Imports of Russian Gas, But Gives Itself Two-Year Grace Period",
    "description": "The European Council has voted to ban Russian gas, but with so many exemptions, the energy will likely flow for years to come. \nThe post EU Bans Imports of Russian Gas, But Gives Itself Two-Year Grace Period appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/27/eu-bans-imports-of-russian-gas-but-gives-itself-two-year-grace-period/",
    "timestamp": "2026-01-27T18:16:19Z"
  },
  {
    "title": "Trump Says the Military Deployed a Secret “Discombobulator” Weapon in Venezuela",
    "description": "\"I'm not allowed to talk about it.\"\nThe post Trump Says the Military Deployed a Secret “Discombobulator” Weapon in Venezuela appeared first on Futurism.",
    "link": "http://futurism.com/science-energy/trump-venezuela-energy-weapon",
    "timestamp": "2026-01-27T18:15:33Z"
  },
  {
    "title": "Minnesota judge orders ICE chief to appear in court",
    "description": "Judge orders head of ICE to explain agency's handling of bond hearings for immigrants it has detained.",
    "link": "https://www.aljazeera.com/news/2026/1/27/minnesota-judge-orders-ice-chief-to-appear-in-court",
    "timestamp": "2026-01-27T18:14:12Z"
  },
  {
    "title": "The Tide Is Turning in Minnesota. But This Is Just the Beginning.",
    "description": "What it takes to defend democracy from autocracy is suddenly crystal clear.",
    "link": "https://slate.com/news-and-politics/2026/01/minnesota-protests-ice-donald-trump-taco.html",
    "timestamp": "2026-01-27T18:11:10Z"
  },
  {
    "title": "Xi offers Europe alternative to Trump’s Board of Peace",
    "description": "Xi Jinping has offered Europe new trade partnerships and promised to uphold the “values” of the United Nations. The move is an apparent attempt to capitalise on the continent’s growing rift with the United States. On Tuesday, Sir Keir Starmer became the lates…",
    "link": "https://freerepublic.com/focus/f-news/4364206/posts",
    "timestamp": "2026-01-27T18:10:25Z"
  },
  {
    "title": "Morgan Wade, Carter Faith Will No Longer Perform on 2026 Rock the Country Tour",
    "description": "The Nashville country singers' exits follow that of Ludacris, who after being announced as a performer on the Kid Rock-founded tour, said there was a \"mix-up\"",
    "link": "http://www.rollingstone.com/music/music-country/rock-the-country-tour-lineup-carter-faith-morgan-wade-leave-1235505404/",
    "timestamp": "2026-01-27T18:07:23Z"
  },
  {
    "title": "Tourism in Cuba plummets as tensions with US increase and Venezuela oil shipments drop",
    "description": "Tourism in Cuba is plummeting at a time when the island desperately needs that revenue",
    "link": "https://abcnews.go.com/Business/wireStory/tourism-cuba-plummets-tensions-us-increase-venezuela-oil-129603161",
    "timestamp": "2026-01-27T18:07:03Z"
  },
  {
    "title": "Gold at ₹1.59 lakh per 10 gm: Jewellers halt purchases as sales fall 70%",
    "description": "Gold and silver prices have reached unprecedented levels. This surge is driven by global geopolitical unrest, a weaker US dollar, and anticipation of interest rate reductions by the US Federal Reserve. Investors are increasingly turning to these precious meta…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/gold-at-1-59-lakh-per-10-gm-jewellers-halt-purchases-as-sales-fall-70/articleshow/127644883.cms",
    "timestamp": "2026-01-27T18:06:59Z"
  },
  {
    "title": "Explainer-What do Democrats and Republicans want in fight over ICE operations?",
    "description": "By Richard CowanWASHINGTON, Jan 27 (Reuters) - Funding for the Department of Homeland Security and several other U.S. government agencies could expire this week if Republ… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/27/explainer-what-do-democrats-and-republicans-want-in-fight-over-ice-operations",
    "timestamp": "2026-01-27T18:06:35Z"
  },
  {
    "title": "CNN Panelist Fires Back At Guest Who Claims Alex Pretti Was ‘Not Murdered’: 'We're Not Lying Today'",
    "description": "\"It wasn't a scrum. He was murdered. We have to start using the word,” said “Naked Sports” host Cari Champion.",
    "link": "https://www.huffpost.com/entry/cnn-cari-champion-batya-ungar-sargon-alex-pretti-murder_n_6978e304e4b001bb8312f699",
    "timestamp": "2026-01-27T18:05:24Z"
  },
  {
    "title": "The government is barreling toward a partial shutdown over DHS funding. Here's what to expect",
    "description": "The U.S. government may partially shutdown on Saturday months after a record 43 day shutdown in 2025.",
    "link": "https://www.cnbc.com/2026/01/27/us-government-shutdown-over-dhs-funding.html",
    "timestamp": "2026-01-27T18:02:06Z"
  },
  {
    "title": "‘This is a militia that kills’: Olympics rattled by ICE security detail as mayor declares ‘they are not welcome in Milan, without a doubt’",
    "description": "Why is Donald Trump sending Immigration and Customs Enforcement to Italy for the Winter Games?",
    "link": "https://fortune.com/2026/01/27/ice-security-detail-olympic-games-milan-mayor-militia-that-kills/",
    "timestamp": "2026-01-27T18:01:45Z"
  },
  {
    "title": "Witkoff celebrates 'new day in the Middle East' after final Israeli hostage is returned from Gaza",
    "description": "All hostages from Gaza have returned home as Trump administration completes historic Middle East diplomatic achievement, marking end of painful chapter.",
    "link": "https://www.foxnews.com/world/witkoff-celebrates-new-day-middle-east-after-final-israeli-hostage-returned-from-gaza",
    "timestamp": "2026-01-27T18:01:35Z"
  },
  {
    "title": "Can You Sue the White House Over an AI Deepfake?",
    "description": "The Trump regime's abuse of AI has opened up new legal questions.",
    "link": "https://gizmodo.com/can-you-sue-the-white-house-over-an-ai-deepfake-2000714219",
    "timestamp": "2026-01-27T18:00:56Z"
  },
  {
    "title": "Iran’s Currency Falls to Record Low as Intel Says Regime at Its ‘Weakest Point’ Since 1979",
    "description": "NYT: \"The reports signal that the Iranian government’s hold on power is at its weakest point since the shah was overthrown in the 1979 revolution.\"\nThe post Iran’s Currency Falls to Record Low as Intel Says Regime at Its ‘Weakest Point’ Since 1979 first appea…",
    "link": "https://legalinsurrection.com/2026/01/irans-currency-falls-to-record-low-as-intel-says-regime-at-its-weakest-point-since-1979/",
    "timestamp": "2026-01-27T18:00:35Z"
  },
  {
    "title": "Philip Glass cancels Kennedy Center symphony premiere in protest of Trump leadership...",
    "description": "Prize-winning composer Philip Glass has canceled the world premiere of his symphony about Abraham Lincoln at the Kennedy Center. Glass' Symphony No. 15, titled \"Lincoln,\" was set to be conducted by Grammy winner Karen Kamensek on June 12 and 13. Glass stated …",
    "link": "https://apnews.com/article/philip-glass-kennedy-center-cancellations-d29fda6fa3ea80dcdc7ded1033d6c04e",
    "timestamp": "2026-01-27T18:00:16Z"
  },
  {
    "title": "EXCLUSIVE: Meet the Billionaire Make-Up Heir 'Who Sowed Seed for Donald Trump's Absolute Obsession With Grabbing Greenland'",
    "description": "Ronald Lauder is said to have pitched the Greenland buyout to Trump as his own investments grew.",
    "link": "https://radaronline.com/p/ronald-lauder-greenland-trump-obsession/",
    "timestamp": "2026-01-27T18:00:00Z"
  },
  {
    "title": "Families of 2 men killed in boat strike sue Trump administration over attack they call ‘unlawful’",
    "description": "The families called the attack a war crime.",
    "link": "https://www.bostonherald.com/2026/01/27/boat-strike-lawsuit/",
    "timestamp": "2026-01-27T17:59:39Z"
  },
  {
    "title": "Neil Young’s gift to Greenland: Free access to his entire music catalog",
    "description": "The offer is for a year — though Young said renewing is possible.",
    "link": "https://www.bostonherald.com/2026/01/27/neil-young-greenland/",
    "timestamp": "2026-01-27T17:59:23Z"
  },
  {
    "title": "Philip Glass pulls Kennedy Center premiere in US",
    "description": "Renowned American composer Philip Glass has become the latest artist to sever ties with Washington's Kennedy Center following its takeover by US President Donald Trump, withdrawing a major new work from the institution.",
    "link": "https://www.rte.ie/entertainment/2026/0127/1555408-philip-glass-pulls-kennedy-center-premiere-in-us/",
    "timestamp": "2026-01-27T17:57:28Z"
  },
  {
    "title": "Monochrome cookies and branded popcorn buckets: Trump family holds private White House screening for Melania film",
    "description": "Some 70 VIP guests arrived at the White House Saturday to celebrate the first lady’s Amazon-funded movie, which tracks her over the 20 days leading up to President Trump’s inauguration",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/melania-trump-documentary-amazon-white-house-b2908648.html",
    "timestamp": "2026-01-27T17:56:09Z"
  },
  {
    "title": "Trump's Chagos remark can be fresh flashpoint in Indo-US ties",
    "description": "In a recent statement, US President Donald Trump expressed his disapproval of the UK's choice to transfer the Chagos Islands back to Mauritius, a move that could potentially strain relations with India, which staunchly endorses Mauritius' claim.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-chagos-remark-can-be-fresh-flashpoint-in-indo-us-ties/articleshow/127644290.cms",
    "timestamp": "2026-01-27T17:56:04Z"
  },
  {
    "title": "'Who’s your daddy?': The trade deal Trump missed",
    "description": "India and the European Union have signed a trade agreement. Donald Trump, referred to as 'the Chump', reportedly reacted with a fabricated social media post. This post mocked the deal, accusing Ursula von der Leyen and India of excluding him. Trump insisted o…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/big-daddy-of-all-sulks-the-trade-deal-trump-missed/articleshow/127644375.cms",
    "timestamp": "2026-01-27T17:55:25Z"
  },
  {
    "title": "DHS Confirms ICE Will Conduct Enforcement Operations at Super Bowl",
    "description": "DHS confirmed that ICE agents will conduct enforcement operations at the Super Bowl LX on Feb. 8 in Santa Clara, California. \nThe post DHS Confirms ICE Will Conduct Enforcement Operations at Super Bowl appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/27/dhs-confirms-ice-will-conduct-enforcement-operations-at-super-bowl/",
    "timestamp": "2026-01-27T17:54:34Z"
  },
  {
    "title": "‘We Are Not Letting Up’: Advocates Say Much More Work to Do as Bovino Exits Minnesota",
    "description": "Border Patrol Commander-at-Large Gregory Bovino has reportedly been pushed out of his role leading President Donald Trump's mass deportation campaign amid a torrent of backlash against immigration agents' lawless behavior in Minnesota in recent weeks, particu…",
    "link": "https://www.commondreams.org/news/bovino-ousted-ice-pressure",
    "timestamp": "2026-01-27T17:54:01Z"
  },
  {
    "title": "WATCH LIVE: Senate considers Pregnant Students' Rights Act",
    "description": "The Senate convenes at 3 p.m. EST.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-considers-pregnant-students-rights-act",
    "timestamp": "2026-01-27T17:53:05Z"
  },
  {
    "title": "U.S. Posts Minneapolis On Craigslist ($50 OBO)",
    "description": "U.S. — Seemingly at a loss as to how to solve the ongoing problems originating from the North Star State, everyone else in the United States reached a joint agreement to post Minneapolis on Craigslist for $50 or best offer. The Somali fraud scandal, recent ri…",
    "link": "https://freerepublic.com/focus/f-chat/4364203/posts",
    "timestamp": "2026-01-27T17:51:02Z"
  },
  {
    "title": "Minnesota law lets licensed gun owners carry loaded firearms at protests, despite Trump officials' claims",
    "description": "Claims about gun rights laws in Minnesota circulated after Minneapolis nurse Alex Pretti died at the hands of Border Patrol agents on Jan. 24, 2026.",
    "link": "https://www.snopes.com//fact-check/minnesota-gun-laws-protests/",
    "timestamp": "2026-01-27T17:51:00Z"
  },
  {
    "title": "Fox News’ Brit Hume Warns Trump He’s ‘Not Winning the PR War in Minnesota’",
    "description": "Brit Hume warned President Donald Trump and his deputies that they're \"not winning the PR war in Minnesota\" on Monday evening.\nThe post Fox News’ Brit Hume Warns Trump He’s ‘Not Winning the PR War in Minnesota’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/fox-news-brit-hume-warns-trump-hes-not-winning-the-pr-war-in-minnesota/",
    "timestamp": "2026-01-27T17:51:00Z"
  },
  {
    "title": "UN experts condemn US move to strip migrant children of legal aid",
    "description": "By Jasper WardJan 27 (Reuters) - U.N. human rights experts on Tuesday denounced the Trump administration’s decision last year to cut legal aid for unaccompanied children … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/27/un-experts-condemn-us-move-to-strip-migrant-children-of-legal-aid",
    "timestamp": "2026-01-27T17:50:33Z"
  },
  {
    "title": "SCOOP: ICE Has Failed to Disclose Info About 8 Immigrants' Deaths, Defying Congress (Justin Glawe/Zeteo)",
    "description": "Justin Glawe / Zeteo:\nSCOOP: ICE Has Failed to Disclose Info About 8 Immigrants' Deaths, Defying Congress  —  Trump has ICE detaining more people than ever.  The agency keeps failing to report information about immigrants' deaths in its custody.  —  ∙ Paid  —…",
    "link": "https://www.memeorandum.com/260127/p66",
    "timestamp": "2026-01-27T17:50:00Z"
  },
  {
    "title": "Minnesota’s chief federal judge wants the head of ICE to explain why he shouldn’t be held in contempt",
    "description": "“This Court has been extremely patient with respondents,” the judge wrote.",
    "link": "https://fortune.com/2026/01/27/minnesotas-chief-federal-judge-wants-the-head-of-ice-to-explain-why-he-shouldnt-be-held-in-contempt/",
    "timestamp": "2026-01-27T17:49:37Z"
  },
  {
    "title": "Trump’s immigration crackdown led to drop in US growth rate last year as population hit 342 million",
    "description": "California had a net population loss of 9,500 people in 2025, a stark change from the previous year, when it gained 232,000 residents.",
    "link": "https://www.mercurynews.com/2026/01/27/trumps-immigration-crackdown-led-to-drop-in-us-growth-rate-last-year-as-population-hit-342-million/",
    "timestamp": "2026-01-27T17:49:28Z"
  },
  {
    "title": "Composer Philip Glass Pulls ‘Lincoln’ Symphony Premiere From Kennedy Center",
    "description": "\"The values of the Kennedy Center today are in direct conflict with the message of the Symphony,\" the composer writes\nThe post Composer Philip Glass Pulls ‘Lincoln’ Symphony Premiere From Kennedy Center appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/music/philip-glass-withdraws-kennedy-center-symphony-premiere/",
    "timestamp": "2026-01-27T17:49:12Z"
  },
  {
    "title": "Silicon Valley Employees Are Starting to Protest Again",
    "description": "The self-censorship that accompanied big tech’s MAGA pivot seems to be ending, writes technology columnist John Herrman.",
    "link": "http://nymag.com/intelligencer/article/silicon-valley-employees-are-starting-to-protest-again.html",
    "timestamp": "2026-01-27T17:45:02Z"
  },
  {
    "title": "Flurry of famed architects submit designs for Trump airport terminal",
    "description": "Multiple well-known architecture studios, including Zaha Hadid Architects and Grimshaw, have created proposals for Washington Dulles Airport, following president Donald Trump's call for a redesign. The studios responded to the Department of Transportation's (…",
    "link": "https://www.dezeen.com/2026/01/27/trump-airport-terminal-washington-zaha-hadid-grimshaw/",
    "timestamp": "2026-01-27T17:43:28Z"
  },
  {
    "title": "Tom Homan Isn't the Solution",
    "description": "Homan is a bully with little regard for rights or the rule of law. And the problems with Trump's immigration tactics point back to the White House itself.",
    "link": "https://reason.com/2026/01/27/tom-homan-isnt-the-solution/",
    "timestamp": "2026-01-27T17:43:21Z"
  },
  {
    "title": "American births outnumbered deaths in 2025 by 519,000 people as population growth rate keeps shrinking",
    "description": "The 0.5% growth rate for 2025 was a sharp drop from 2024's almost 1% growth rate.",
    "link": "https://fortune.com/2026/01/27/what-is-american-population-growth-rate-demographics-immigration-fertility/",
    "timestamp": "2026-01-27T17:42:42Z"
  },
  {
    "title": "Neil Young Spites Amazon With Major Gift To Greenland",
    "description": "The rock legend didn't pull any punches — just his music.",
    "link": "https://www.huffpost.com/entry/neil-young-amazon-greenland-gift_n_6978e4f3e4b0baacbfb71d0b",
    "timestamp": "2026-01-27T17:42:23Z"
  },
  {
    "title": "Trump Screwed Elderly Patients After Nursing Home Execs Begged Him To",
    "description": "President Donald Trump decided to abandon regulations protecting elderly residents, after nursing home executives poured millions into a pro-Trump super PAC, The New York Times reported Tuesday.  In early December, the Department of Health and Human Services …",
    "link": "https://newrepublic.com/post/205755/donald-trump-nursing-home-executives-donation-staffing-rule",
    "timestamp": "2026-01-27T17:40:28Z"
  }
]