[
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The Secretary-General welcomes the signing of agreement between the United Kingdom and Mauritius concerning the Chagos Archipelago, including Diego Garcia. This agreement marks a significant step towards resolving a long-standing dispute in the Indian Ocean r…",
    "link": "https://press.un.org/en/2025/db250522.doc.htm",
    "timestamp": "2025-05-22T21:13:43Z"
  },
  {
    "title": "Trump isn't cutting red tape. He's creating more of it for average Americans.",
    "description": "President Donald Trump loves to talk about cutting red tape.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-medicaid-social-security-red-tape-rcna207999",
    "timestamp": "2025-05-22T21:13:33Z"
  },
  {
    "title": "Supreme Court lets Trump fire heads of independent labor agencies for now",
    "description": "The Supreme Court on Thursday gave Trump a green light, for now, to his removal of the heads of the National Labor Relations Board and Merit Systems Protection Board.",
    "link": "https://abcnews.go.com/Politics/supreme-court-lets-trump-fire-heads-labor-worker/story?id=122091589",
    "timestamp": "2025-05-22T21:13:28Z"
  },
  {
    "title": "Divided Supreme Court backs Trump’s power to fire independent agency members",
    "description": "The Supreme Court backed President Donald Trump’s power to fire independent federal agency members over dissent from the court’s three Democratic appointees, who said the majority “favors the President over our precedent.”",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-trump-humphreys-precedent-agencies-rcna201176",
    "timestamp": "2025-05-22T21:11:27Z"
  },
  {
    "title": "Democrats slam Trump megabill as hurting low-income Americans and helping the rich",
    "description": "Republicans are touting House passage of a megabill to fund Trump’s agenda as a win for Americans. Democrats slam it as benefiting the rich and hurting low-income people.",
    "link": "https://abcnews.go.com/Politics/ugly-democrats-slam-trump-megabill-hurting-low-income/story?id=122078571",
    "timestamp": "2025-05-22T21:10:51Z"
  },
  {
    "title": "Supreme Court Refuses To Reinstate Independent Agency Board Members Fired By Trump",
    "description": "The firings have hamstrung two agencies that deal with labor issues because Trump has not appointed replacements.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-board-members_n_682f91fae4b0239ca9a6e738",
    "timestamp": "2025-05-22T21:10:37Z"
  },
  {
    "title": "This state just became the latest in the country to ban sanctuary cities",
    "description": "Gov. Kelly Ayotte signs bills banning sanctuary cities in New Hampshire, highlighting public safety and cooperation with federal immigration efforts as priorities.",
    "link": "https://www.foxnews.com/politics/state-just-became-latest-country-ban-sanctuary-cities",
    "timestamp": "2025-05-22T21:10:09Z"
  },
  {
    "title": "Lauren Sánchez sparkles in sequined corset gown on amfAR Gala Cannes 2025 red carpet",
    "description": "Following her star-studded bachelorette party in Paris, the helicopter pilot was honored with an award at the Cannes Film Festival.",
    "link": "https://pagesix.com/2025/05/22/style/lauren-sanchez-shines-on-amfar-gala-cannes-2025-red-carpet/",
    "timestamp": "2025-05-22T21:09:47Z"
  },
  {
    "title": "Trump’s Ambush of Ramaphosa Leaves South Africa Reeling",
    "description": "South Africans watched aghast on Wednesday as US President Donald Trump berated their leader in the Oval Office over false claims that there’s a genocide against White people in the country.\nPresident Cyril Ramaphosa was upbeat ahead of his White House meetin…",
    "link": "https://biztoc.com/x/e36d28f948a412b1",
    "timestamp": "2025-05-22T21:08:48Z"
  },
  {
    "title": "OpenAI and Nvidia among companies building Stargate AI infrastructure in UAE",
    "description": "OpenAI and Nvidia will join other companies to build Stargate UAE, an artificial intelligence infrastructure cluster, in a sister project to the recently unveiled push to expand AI infrastructure in the United States.\nAppearing alongside President Donald Trum…",
    "link": "https://biztoc.com/x/354f9e297de21746",
    "timestamp": "2025-05-22T21:08:34Z"
  },
  {
    "title": "'Target rich': Ex-chief of staff warns Trump he just handed winning weapon to Dems",
    "description": "Former President Barack Obama's first chief of staff, Rahm Emanuel, is warning President Donald Trump that his \"big, beautiful bill\" hands a huge gift to Democrats. Trump demanded that his GOP majority in the House and Senate pass a single bill that contains …",
    "link": "https://www.rawstory.com/trump-republican-budget/",
    "timestamp": "2025-05-22T21:08:16Z"
  },
  {
    "title": "Republican Calls for Gaza to Be “Nuked” Like Hiroshima and Nagasaki",
    "description": "Rep. Randy Fine said “the Palestinian cause” is “evil” in stunning remarks on Fox.",
    "link": "https://truthout.org/articles/republican-calls-for-gaza-to-be-nuked-like-hiroshima-and-nagasaki/",
    "timestamp": "2025-05-22T21:07:14Z"
  },
  {
    "title": "Hinge Health just broke open the digital health IPO market. Here's who's getting rich.",
    "description": "The stakes of Hinge Health's investors and executives are now worth millions after the company debuted on the stock market.",
    "link": "https://www.businessinsider.com/investors-executives-got-rich-hinge-health-ipo-2025-5",
    "timestamp": "2025-05-22T21:06:49Z"
  },
  {
    "title": "Ex-Obama Aide Says He Soft-Pedaled Concerns About Biden Because He Wanted Him To ‘F*cking Win’",
    "description": "Jon Lovett admitted that he held back concerns regarding former President Joe Biden's decline because he wanted him to win reelection in 2024.",
    "link": "https://dailycaller.com/2025/05/22/jon-lovett-biden-health-decline-2024-election/",
    "timestamp": "2025-05-22T21:04:48Z"
  },
  {
    "title": "‘I’m Very Upset’: Steve Bannon Says Trump’s Big Beautiful Bill Needs Fixing in the Senate",
    "description": "\"I have not changed my mind one bit on this bill. This bill could be a lot better. I'm very concerned about the deficits\"\nThe post ‘I’m Very Upset’: Steve Bannon Says Trump’s Big Beautiful Bill Needs Fixing in the Senate first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/im-very-upset-steve-bannon-says-trumps-big-beautiful-bill-needs-fixing-in-the-senate/",
    "timestamp": "2025-05-22T21:04:48Z"
  },
  {
    "title": "U.S. stocks close mixed as Trump's tax bill passes House",
    "description": "NEW YORK, May 22 (Xinhua) -- U.S. stocks finished little changed on Thursday, as investors digested the House of Representatives's narrow passage of U.S. President Donald Trump's sweeping tax legislation and its potential impact on the nation's growing debt. …",
    "link": "https://www.thestar.com.my/news/world/2025/05/23/us-stocks-close-mixed-as-trump039s-tax-bill-passes-house",
    "timestamp": "2025-05-22T21:03:00Z"
  },
  {
    "title": "200 TRUMP crypto investors shell out $394 mln for a gala dinner, but concerns arise",
    "description": "With 19 of top 25 wallets outside U.S., Trump’s memecoin raises red flags on foreign political involvement.",
    "link": "https://ambcrypto.com/200-trump-crypto-investors-shell-out-394-mln-for-a-gala-dinner-but-concerns-arise/",
    "timestamp": "2025-05-22T21:00:34Z"
  },
  {
    "title": "House passes tax bill that bans Medicaid from covering transition-related care",
    "description": "The House tax bill would prohibit Medicaid from covering any transgender health care, for both minors and adults.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/house-passes-tax-bill-bans-medicaid-covering-transition-related-care-rcna208618",
    "timestamp": "2025-05-22T20:59:44Z"
  },
  {
    "title": "After Meeting With Trump, Bob Iger Tells Marvel To Get Politics Out of Its Movies",
    "description": "Since President Donald Trump’s election, Disney and its CEO, Bob Iger, have entirely changed their stance on the President and his politics. Disney spent years fighting against laws in Florida that it believed discriminated against the LGBTQ community and wor…",
    "link": "https://insidethemagic.net/?p=773338&preview=true&preview_id=773338",
    "timestamp": "2025-05-22T20:59:16Z"
  },
  {
    "title": "Bruce Springsteen Cover Band Told Jersey Shore Gig ‘Too Risky’ After Real Bruce’s Anti-Trump Comments",
    "description": "No Surrender chose to perform at another venue after a Toms River bar owner told them his city \"is red and won't stand for [Springsteen's] bullshit\"",
    "link": "http://www.rollingstone.com/music/music-news/bruce-springsteen-cover-band-nj-concert-trump-1235346409/",
    "timestamp": "2025-05-22T20:59:09Z"
  },
  {
    "title": "Trump administration blocks Harvard from enrolling international students",
    "description": "The Ivy League school called the move 'unlawful,' saying that it is a retaliatory action that threatens serious harm to the university",
    "link": "https://www.haaretz.com/us-news/2025-05-22/ty-article/.premium/trump-administration-blocks-harvard-from-enrolling-international-students/00000196-f955-d6d3-ab9e-fb7ffd4b0000",
    "timestamp": "2025-05-22T20:58:18Z"
  },
  {
    "title": "LOFTUS: Kamala’s Next Career Move Is Already Doomed",
    "description": "Kamala Harris's next career move may already be doomed.",
    "link": "https://dailycaller.com/2025/05/22/kamala-harris-governor-run-california-biden-cover-up/",
    "timestamp": "2025-05-22T20:56:35Z"
  },
  {
    "title": "Ilhan Omar Avoided Reporters When Asked About Jewish Museum Murders: Report",
    "description": "Anti-Semitic congresswoman Ilhan Omar (D., Minn.) on Thursday walked away from reporters who asked about the horrific slayings of two Israeli embassy staffers outside a Jewish history museum in Washington, D.C., only issuing a written statement later online.\n…",
    "link": "https://freebeacon.com/latest-news/ilhan-omar-avoided-reporters-when-asked-about-jewish-museum-murders-report/",
    "timestamp": "2025-05-22T20:55:21Z"
  },
  {
    "title": "Ticker: US to stop making cents; Mortgage rates tick up",
    "description": "The U.S. Mint has made its final order of penny blanks and plans to stop producing the coin when those run out, a Treasury Department official confirmed Thursday.",
    "link": "https://www.bostonherald.com/2025/05/22/ticker-us-to-stop-making-cents-mortgage-rates-tick-up/",
    "timestamp": "2025-05-22T20:54:55Z"
  },
  {
    "title": "“THEY LIED ABOUT EVERYTHING”: Rep. Jim Jordan SLAMS Dems for Biden Health Coverup - NewsBreak",
    "description": "Congressman Jim Jordan, who represents Ohio’s 4th Congressional District and serves as House Judiciary Committee Chairman, joined The Guy Benson Show today",
    "link": "https://www.newsbreak.com/share/4016365620918-they-lied-about-everything-rep-jim-jordan-slams-dems-for-biden-health-coverup?s=a2&amp;share_destination_id=MTI5MzEyMjE2LTE3NDc5NDcyNjYxODM%3D&amp;pd=08ka0uBv&amp;hl=en_US&amp;send_time=1747947266&amp;share_comment_id=swokp724zly0&amp;actBtn=shareButton&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v9%2Cns_foryou_recall_exp_25q2-control%2Cns_local_strategy_25q1_exp-holdback",
    "timestamp": "2025-05-22T20:54:53Z"
  },
  {
    "title": "Kid Rock Blames 'Ugly' Liberal Women For Low Birth Rate",
    "description": "Kid Rock Blames 'Ugly' Liberal Women For Low Birth Ratelittlethings.com",
    "link": "https://littlethings.com/entertainment/kid-rock-liberal-women-low-birth-rate",
    "timestamp": "2025-05-22T20:53:55Z"
  },
  {
    "title": "Trump Is Trying to Scrap Basic Protections for Unaccompanied Immigrant Children",
    "description": "The Trump administration filed a motion Thursday to end the decades-old legal ruling that established basic standards for the treatment and release of migrant children—a move that immigrant rights advocates say they will challenge. The Flores Settlement Agree…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-immigrant-kids-children-unaccompanied-flores-settlement/",
    "timestamp": "2025-05-22T20:53:34Z"
  },
  {
    "title": "Supreme Court grants Trump request to fire independent agency members",
    "description": "Trump's actions tee up a significant question over whether provisions intended to protect independent agencies from political interference are constitutional.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-request-fire-independent-agency-members-rcna201152",
    "timestamp": "2025-05-22T20:52:13Z"
  },
  {
    "title": "Top $TRUMP holders head to crypto dinner with president that Democrats call 'orgy of corruption'",
    "description": "President Trump is hosting a black-tie dinner at his Virginia golf club on Thursday for the top buyers of his $TRUMP meme coin.",
    "link": "https://www.cnbc.com/2025/05/22/top-trump-holders-head-to-exclusive-crypto-dinner-with-president.html",
    "timestamp": "2025-05-22T20:51:41Z"
  },
  {
    "title": "US Govt Revokes Harvard's Right To Enroll Foreign Students",
    "description": "Donald Trump's administration on Thursday revoked Harvard's right to enroll foreign nationals -- more than a quarter of the student body -- in a dramatic escalation of the US president's fight against the prestigious university.",
    "link": "https://www.ibtimes.com/us-govt-revokes-harvards-right-enroll-foreign-students-3774288",
    "timestamp": "2025-05-22T20:51:10Z"
  },
  {
    "title": "Trump Hosts Gala For Memecoin Buyers Despite Corruption Concerns",
    "description": "US President Donald Trump on Thursday will host a private event for hundreds of top investors in his crypto memecoin, with leaders of the Democratic opposition blasting it as \"an orgy of corruption.\"",
    "link": "https://www.ibtimes.com/trump-hosts-gala-memecoin-buyers-despite-corruption-concerns-3774285",
    "timestamp": "2025-05-22T20:51:09Z"
  },
  {
    "title": "Supreme Court won’t reinstate top federal labor officials in a victory for Trump’s firing powers | CNN Politics",
    "description": "The Supreme Court on Thursday said President Donald Trump doesn’t have to rehire senior officials he fired from two independent federal labor agencies that enforce worker protections, while the officials continue fighting in court to reverse their termination…",
    "link": "https://www.cnn.com/2025/05/22/politics/supreme-court-trump-firing-power",
    "timestamp": "2025-05-22T20:49:50Z"
  },
  {
    "title": "Trump, Netanyahu Condemn Killing of Israeli Embassy Staffers in D.C.",
    "description": "Incidents of antisemitism have skyrocketed since the Israel-Hamas war broke out in October 2023.",
    "link": "http://foreignpolicy.com/2025/05/22/israel-embassy-shooting-dc-antisemitism-gaza/",
    "timestamp": "2025-05-22T20:49:45Z"
  },
  {
    "title": "FTC drops Biden-era suit accusing Pepsi of price discrimination",
    "description": "The FTC voted to dismiss a lawsuit filed in the last days of the Biden administration that had accused PepsiCo of offering sweetheart pricing to big retailers.",
    "link": "https://www.nbcnews.com/business/business-news/biden-era-pepsi-price-discrimination-suit-dropped-ftc-rcna208635",
    "timestamp": "2025-05-22T20:49:26Z"
  },
  {
    "title": "ROOKE: DOJ Lawyer Revealed What She Found First Week On Job And It’s Perfect Example Of What Liberals Get Wrong",
    "description": "Assistant Attorney General for Civil Rights Harmeet Dhillon revealed the wild situation she walked into after joining the DOJ in the new Trump administration.",
    "link": "https://dailycaller.com/2025/05/22/rooke-doj-lawyer-civil-rights-crying-resign/",
    "timestamp": "2025-05-22T20:48:46Z"
  },
  {
    "title": "US senate to investigate who really ran country under Biden",
    "description": "Senator Ron Johnson’s initiative comes amid speculation of a cover-up at the top after the ex-president was diagnosed with prostate cancer Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618022-us-senator-probe-biden-health-cover-up/",
    "timestamp": "2025-05-22T20:48:36Z"
  },
  {
    "title": "Pope’s call to tame AI sets tone for Christian leaders",
    "description": "Pope Leo XIV singled out the challenges of artificial intelligence as he took office this month, underscoring religious leaders’ hopes to influence a technology freighted with both vast hopes and apocalyptic fears. The pope was cited by Protestant American Ev…",
    "link": "https://www.digitaljournal.com/tech-science/popes-call-to-tame-ai-sets-tone-for-christian-leaders/article",
    "timestamp": "2025-05-22T20:47:49Z"
  },
  {
    "title": "Christian Israeli Diplomat Murdered in D.C. Hailed Trump’s ‘Legacy’ of Peace, Creating ‘More Secure’ World",
    "description": "The Christian Israeli embassy staffer gunned down alongside his almost-fiancée in a terror attack outside the Capital Jewish Museum had long praised President Donald Trump’s leadership — both abroad and at home — as a blueprint for peace and strength.\nThe pos…",
    "link": "https://www.breitbart.com/middle-east/2025/05/22/christian-israeli-diplomat-murdered-d-c-hailed-trumps-legacy-peace-creating-more-secure-world/",
    "timestamp": "2025-05-22T20:47:21Z"
  },
  {
    "title": "Trump hosts gala for memecoin buyers despite corruption concerns",
    "description": "US President Donald Trump on Thursday will host a private event for hundreds of top investors in his crypto memecoin, with leaders of the Democratic opposition blasting it as “an orgy of corruption.” The unprecedented melding of US presidential power and pers…",
    "link": "https://www.digitaljournal.com/world/trump-hosts-gala-for-memecoin-buyers-despite-corruption-concerns/article",
    "timestamp": "2025-05-22T20:47:20Z"
  },
  {
    "title": "Jake Tapper and Alex Thompson on Explosive Biden Book, Media Cover-Up, and Why The View Won’t Have Them on Air",
    "description": "In their newly released book, CNN host Jake Tapper and Axios reporter Alex Thompson uncover former President Joe Biden’s mental decline and the cover up that sought to keep it from the public.\nThe post Jake Tapper and Alex Thompson on Explosive Biden Book, Me…",
    "link": "https://www.mediaite.com/media/podcasts/jake-tapper-and-alex-thompson-on-explosive-biden-book-media-cover-up-and-why-the-view-wont-have-them-on-air/",
    "timestamp": "2025-05-22T20:46:44Z"
  },
  {
    "title": "Trump announces 'up to 89%' drug costs reduction",
    "description": "United States President Donald Trump said on Thursday that the drug cost reduction will be \"up to 89% in some cases,\" stressing his administration's effort to reduce prices and fight big pharmaceutica...",
    "link": "https://biztoc.com/x/c7dd36f9c784fd90",
    "timestamp": "2025-05-22T20:46:30Z"
  },
  {
    "title": "Trump admin blocked from revoking student visas",
    "description": "A California federal judge issued a nationwide directive barring US President Donald Trump's administration from canceling foreign students' legal status to study and work in the United States without...",
    "link": "https://biztoc.com/x/4895e384cdd3f2c6",
    "timestamp": "2025-05-22T20:46:24Z"
  },
  {
    "title": "Trump suggested Biden hid cancer diagnosis. Here's what we know about the timeline",
    "description": "Standard medical practice is to not test men who have a life expectancy of less than 10 years for prostate cancer.",
    "link": "https://www.snopes.com//news/2025/05/22/trump-stage-9-cancer-biden/",
    "timestamp": "2025-05-22T20:46:00Z"
  },
  {
    "title": "Exclusive--Stefanik: Shock Poll Shows Gov. Hochul Could Lose Reelection to Popular Republican",
    "description": "Rep. Elise Stefanik (R-NY) is neck-and-neck in a hypothetical race against Democrat incumbent Kathy Hochul for governor, a new poll found.\nThe post Exclusive–Stefanik: Shock Poll Shows Gov. Hochul Could Lose Reelection to Popular Republican appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/05/22/exclusive-stefanik-shock-poll-shows-gov-hochul-could-lose-reelection-to-popular-republican/",
    "timestamp": "2025-05-22T20:45:59Z"
  },
  {
    "title": "A Salmonella Outbreak Sickens Dozens, Prompting a Cucumber Recall. Here’s What to Do",
    "description": "The FDA says Fresh Start Produce Sales distributed cucumbers to retailers, distribution centers, wholesalers and food service distributors nationwide, making people sick from California to Kansas to New York — and it is unclear exactly where else they may hav…",
    "link": "https://www.kqed.org/news/12041226/a-salmonella-outbreak-sickens-dozens-prompting-a-cucumber-recall-heres-what-to-do",
    "timestamp": "2025-05-22T20:45:59Z"
  },
  {
    "title": "Man charged with murder after two Israeli embassy staff members shot dead in Washington DC",
    "description": "The suspect shouted “free, free Palestine” after he was arrested, police said.",
    "link": "https://www.thejournal.ie/man-charged-with-murder-after-two-israeli-embassy-staff-members-shot-dead-in-washington-dc-6711318-May2025/",
    "timestamp": "2025-05-22T20:45:00Z"
  },
  {
    "title": "'Easier ways to send messages' to Trump than bringing in the King: U.S. ambassador",
    "description": "The new U.S. ambassador to Canada says he knows the implication of King Charles III’s upcoming trip to Ottawa is to push back on U.S. President Donald Trump’s 51st state threats — and he says there are “easier ways to send messages” to the American government.",
    "link": "https://www.cbc.ca/news/politics/us-ambassador-trump-1.7541432",
    "timestamp": "2025-05-22T20:44:35Z"
  },
  {
    "title": "Whoopi Goldberg says Trump is giving U.S. middle finger by accepting Qatari jet",
    "description": "Whoopi Goldberg slammed Donald Trump for accepting a luxury jet as a gift from Qatar, saying he's giving the country the 'middle finger' with the decision: 'People are starving.'",
    "link": "https://ew.com/whoopi-goldberg-says-donald-trump-giving-country-middle-finger-by-accepting-qatar-jet-11740265",
    "timestamp": "2025-05-22T20:44:30Z"
  },
  {
    "title": "Is Donald Trump To Blame for a COVID Lab Leak?",
    "description": "If COVID-19 leaked from a Chinese lab as a result of U.S.-funded gain-of-function research, is Donald Trump to blame? The New York Times opinion writer",
    "link": "https://reason.com/2025/05/22/is-donald-trump-to-blame-for-a-covid-lab-leak/",
    "timestamp": "2025-05-22T20:44:21Z"
  },
  {
    "title": "Officials for ActBlue Dem money machine go silent when Congress asks questions",
    "description": "Committee chiefs now considering subpoenas to obtain testimony",
    "link": "https://www.wnd.com/2025/05/officials-for-actblue-dem-money-machine-go-silent-when-congress-asks-questions/",
    "timestamp": "2025-05-22T20:44:08Z"
  },
  {
    "title": "Trump Raises $600 Million Ahead Of Midterms And Eyes Even More Aggressive Goal",
    "description": "It’s an unprecedented sum in modern politics, particularly for a lame-duck president who is barred from running again.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-fundraising_n_682f8ab8e4b05418243cd0fc",
    "timestamp": "2025-05-22T20:43:00Z"
  },
  {
    "title": "DOGE Cancels Nearly 200 Government Phone Lines",
    "description": "The Trump administration task force said the \"unused\" lines were costing the government $100,000 per year.",
    "link": "https://www.newsweek.com/doge-cancels-nearly-200-government-phone-lines-2076079",
    "timestamp": "2025-05-22T20:42:28Z"
  },
  {
    "title": "Syrian business owners welcome EU’s lifting of sanctions",
    "description": "Syrians are hoping sanctions relief will help boost investment, reconstruction after more than a decade of civil war.",
    "link": "https://www.aljazeera.com/news/2025/5/22/syrian-business-owners-welcome-eus-lifting-of-sanctions",
    "timestamp": "2025-05-22T20:42:22Z"
  },
  {
    "title": "Democrats seeking to buy the ‘next Joe Rogan’ of the left after 2024 election defeat",
    "description": "Liberal operatives scramble to build podcast empire after Trump won over younger male voters.",
    "link": "https://nypost.com/2025/05/22/media/democrats-seeking-to-buy-the-next-joe-rogan-of-the-left-after-2024-election-defeat/",
    "timestamp": "2025-05-22T20:42:09Z"
  },
  {
    "title": "Why did the government sign the Chagos deal now?",
    "description": "A deal to hand Mauritius the Chagos Islands and lease back a key military base has been months in the making.",
    "link": "https://www.bbc.com/news/articles/cp3ql9k3vdqo",
    "timestamp": "2025-05-22T20:41:54Z"
  },
  {
    "title": "How Bruce Springsteen Got to Donald Trump, and Why It Matters: Consequence Chat",
    "description": "What Springsteen vs. Trump can teach us.\nHow Bruce Springsteen Got to Donald Trump, and Why It Matters: Consequence Chat\nWren Graves and Alex Young",
    "link": "https://consequence.net/2025/05/bruce-springsteen-donald-trump-chat/",
    "timestamp": "2025-05-22T20:41:31Z"
  },
  {
    "title": "What we know about the suspect in the Capital Jewish Museum shooting",
    "description": "Federal officials are reviewing writings that they say may belong to the man suspected of fatally gunning down two Israeli Embassy staffers in Washington, D.C., as they investigate whether the attack was motivated by antisemitism.",
    "link": "https://www.nbcnews.com/news/us-news/know-suspect-capital-jewish-museum-shooting-rcna208519",
    "timestamp": "2025-05-22T20:38:52Z"
  },
  {
    "title": "S&P/TSX composite edges higher on Thursday, U.S. stocks mixed",
    "description": "TORONTO — Canada’s main stock index edged higher on Thursday, helped by strength in the financial sector, while U.S. stock markets were mixed. The S&P/TSX composite index was up 14.84 points at 25,854.01. TD Bank’s share price moved higher along with most maj…",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-edges-higher-on-thursday-u-s-stocks-mixed",
    "timestamp": "2025-05-22T20:38:27Z"
  },
  {
    "title": "'Orgy of Corruption': Senators Slam Trump Crypto Dinner, Demand Info on Attendees",
    "description": "Democrats are increasingly zeroing in on the president’s private crypto dealings as a means to critique his second term.",
    "link": "https://decrypt.co/321684/orgy-corruption-democrats-slam-trump-crypto-dinner",
    "timestamp": "2025-05-22T20:37:48Z"
  },
  {
    "title": "Trump’s White House Goes From Hiding 80% Of His Transcribed Remarks To Hiding 99.5%",
    "description": "The purge of the transcripts of Trump’s speeches and interactions with the media came just days after HuffPost revealed how few they had been posting.",
    "link": "https://www.huffpost.com/entry/trump-transcript-purge_n_682f797de4b0e1fe96d64b10",
    "timestamp": "2025-05-22T20:37:40Z"
  },
  {
    "title": "Exclusive — ‘A Million Apprenticeships’: Labor Secretary Reveals Plans to Execute Trump’s Directive for Working Class Boom",
    "description": "WASHINGTON — Labor Secretary Lori Chavez-DeRemer told Breitbart News exclusively in her office at the U.S. Department of Labor here in Washington last week that she is working tirelessly to execute President Donald Trump’s order to expand the number of appren…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318568/posts",
    "timestamp": "2025-05-22T20:37:35Z"
  },
  {
    "title": "States and nonprofits sue feds for illegally withholding $5B in EV charger funds",
    "description": "California and 16 other states have sued the government for illegally withholding $5 billion in funds that Congress earmarked for EV charging, calling the action “another trump gift to China.”\n\n\n\nUpdate, May 22: After the initial lawsuit was filed on May 7th,…",
    "link": "http://electrek.co/2025/05/22/ca-and-16-states-sue-feds-for-5b-gift-to-china-withholding-ev-charger-funds/",
    "timestamp": "2025-05-22T20:37:00Z"
  },
  {
    "title": "The Trump Tax Cut American Families Need",
    "description": "Under the Biden Administration, moms were doing the math around kitchen tables all across America — and it wasn’t adding up.",
    "link": "https://dailycaller.com/2025/05/22/trump-tax-cut-american-families-credit/",
    "timestamp": "2025-05-22T20:35:05Z"
  },
  {
    "title": "Trump's image of dead 'white farmers' came from Reuters footage in Congo, not South Africa (Reuters)",
    "description": "Reuters:\nTrump's image of dead ‘white farmers’ came from Reuters footage in Congo, not South Africa  —  U.S. President Donald Trump showed a screenshot of Reuters video taken in the Democratic Republic of Congo as part of what he falsely presented on Wednesda…",
    "link": "https://www.memeorandum.com/250522/p129",
    "timestamp": "2025-05-22T20:35:01Z"
  },
  {
    "title": "Ukraine wants fixed percentage of EU’s GDP",
    "description": "Ukrainian Finance Minister Sergey Marchenko has proposed that EU members directly fund the country’s armed forces Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618020-ukraine-eu-funding-military/",
    "timestamp": "2025-05-22T20:34:06Z"
  },
  {
    "title": "Trump Admin Forcing African Countries To Embrace Elon Musk’s Starlink If They Want To Continue Receiving Lifesaving Aid",
    "description": "You cant say that Elon Musk hasnt gotten his moneys worth after spending $277 million to help buy Donald Trump an election victory (thats not including the $44 billion Musk spent on turning Twitter into a right wing propaganda mill). The end of the numerous i…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177694981",
    "timestamp": "2025-05-22T20:32:05Z"
  },
  {
    "title": "The US of A, now featuring Putinesque kleptocracy",
    "description": "\"The most brazenly corrupt thing a president has ever done,\" said Democratic Sen. Chris Murphy about Trump's  \"coin scam.\" \"[It's] a stunning public display of corruption,\" said Democratic Sen. Jeff Merkley. \"President Trump’s financial entanglements to the $…",
    "link": "https://www.pmcarpenter.com/post/the-us-of-a-now-featuring-putinesque-kleptocracy",
    "timestamp": "2025-05-22T20:31:50Z"
  },
  {
    "title": "Israeli speculation mounts over potential rift between Trump and Netanyahu",
    "description": "US and Israel have always been close, especially under Trump, but that makes even the smallest differences more evident.",
    "link": "https://www.aljazeera.com/news/2025/5/22/israeli-speculation-mounts-over-potential-rift-between-trump-and-netanyahu",
    "timestamp": "2025-05-22T20:31:04Z"
  },
  {
    "title": "Selling the Euro-Mom Fantasy",
    "description": "With Trump in office, an increasing number of rich, progressive parents are contemplating moves abroad. Expat moms Emily San José, who is an influencer, and Maggie Gavilán saw a business opportunity and started a company, Mother Euro, in response.",
    "link": "http://www.thecut.com/article/the-start-up-selling-american-parents-a-euro-mom-fantasy.html",
    "timestamp": "2025-05-22T20:30:39Z"
  },
  {
    "title": "Trump’s $600 million war chest: How he plans to wield his power in the midterms and beyond",
    "description": "It's an unprecedented sum in modern politics.",
    "link": "https://www.bostonherald.com/2025/05/22/trump-fundraising-600-million/",
    "timestamp": "2025-05-22T20:30:30Z"
  },
  {
    "title": "FTC Is Investigating Media Matters Over Elon Musk's X Boycott Claims",
    "description": "The probe marks an escalation in U.S. government scrutiny of media watchdog groups who Elon Musk has accused of colluding to get advertisers to boycott his social media site.",
    "link": "https://www.huffpost.com/entry/media-matters-ftc-elon-musk_n_682f869fe4b0e1fe96d64f23",
    "timestamp": "2025-05-22T20:30:28Z"
  },
  {
    "title": "Robert F. Kennedy Jr.: Trump Is A Populist President, He Is On The Side Of The Working Class And Poor In This Country",
    "description": "Secretary of Health and Human Services Robert F. Kennedy Jr. praised President Donald Trump at a MAHA commission event at the White House on Thursday. Kennedy said he has never seen a president who is willing to stand up to industry and willing to talk about …",
    "link": "https://www.realclearpolitics.com/video/2025/05/22/robert_f_kennedy_jr_trump_is_a_populist_president_he_is_on_the_side_of_the_working_class_and_poor_in_this_country.html",
    "timestamp": "2025-05-22T20:30:02Z"
  },
  {
    "title": "Trump and Republicans’ Tax Bill Will Redistribute Wealth Upwards",
    "description": "Tax reform? More like “tax deform.”",
    "link": "https://slate.com/podcasts/political-gabfest/2025/05/politics-us-credit-downgraded-house-passes-tax-bill-antisemitism-doj-project-ester-donald-trump",
    "timestamp": "2025-05-22T20:30:00Z"
  },
  {
    "title": "Foreign aid, the powerful US soft power, is gone",
    "description": "'Don't it always seem to go, that you don't know what you've got 'til it's gone.\" When Joni Mitchell sang that line in 1970, she was lamenting the destruction of the environment, but the sentiment applies to many issues. Today, we can add official development…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3032216/foreign-aid-the-powerful-us-soft-power-is-gone",
    "timestamp": "2025-05-22T20:30:00Z"
  },
  {
    "title": "No Tax on Tips Act: What It Means for You as Senate Passes Bill",
    "description": "This bill would offer a tax break for tipped income under certain levels, but that might not be the uncomplicated relief it sounds like.",
    "link": "https://www.cnet.com/personal-finance/taxes/no-tax-on-tips-act-what-it-means-for-you-as-senate-passes-bill/",
    "timestamp": "2025-05-22T20:30:00Z"
  },
  {
    "title": "Former Ukrainian commander says Ukraine cannot restore post-Soviet borders, media report says",
    "description": "(Reuters) -Ukraine should abandon any notion of restoring its borders established with the 1991 collapse of Soviet rule or even those dating from the 2022 full-scale Russian invasion, the country's former military commander was quoted as saying on Thursday. R…",
    "link": "https://www.thestar.com.my/news/world/2025/05/23/former-ukrainian-commander-says-ukraine-cannot-restore-post-soviet-borders-media-report-says",
    "timestamp": "2025-05-22T20:30:00Z"
  },
  {
    "title": "Why Trump’s ‘Golden Dome’ Won’t Shield the U.S. from Nuclear Strikes",
    "description": "The White House’s $175-billion plan to protect the U.S. from nuclear annihilation will probably cost much more—and deliver far less—than has been claimed, says nuclear arms expert Jeffrey Lewis",
    "link": "https://www.scientificamerican.com/article/why-trumps-golden-dome-wont-shield-the-u-s-from-nuclear-strikes/",
    "timestamp": "2025-05-22T20:30:00Z"
  },
  {
    "title": "Announcement: The Babylon Bee Is Now A Full-Service Restaurant And All Our Writers Are Compensated Entirely With Tips",
    "description": "ANNOUNCEMENT: The Babylon Bee is no longer a satire website. After months of strategy meetings and lots of thinking really hard, we have decided to pivot to becoming a full-service restaurant empire. In light of this change, all our writers and other staffers…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318566/posts",
    "timestamp": "2025-05-22T20:29:28Z"
  },
  {
    "title": "Trump's image of dead 'white farmers' came from Reuters footage in Congo, not South Africa",
    "description": "\"These are all white farmers that are being buried,\" said Trump, holding up a print-out of an article accompanied by the picture during a contentious Oval Office meeting with South African President.",
    "link": "https://www.jpost.com/international/article-855140",
    "timestamp": "2025-05-22T20:28:54Z"
  },
  {
    "title": "Trump Declared an Energy Emergency. Now He's Creating One | Opinion",
    "description": "President Donald Trump seems to have landed, in part unintentionally, on a \"none of the above\" energy strategy.",
    "link": "https://www.newsweek.com/trump-declared-energy-emergency-now-hes-creating-one-opinion-2075834",
    "timestamp": "2025-05-22T20:27:33Z"
  },
  {
    "title": "Small Business Administration boosts manufacturing funding efforts",
    "description": "The agency will provide up to $1.1 million to three applicants to deliver training and assistance to small manufacturers. An effort to unlock more financing for businesses is also in the works.",
    "link": "https://www.manufacturingdive.com/news/small-business-administration-boosts-funding-Made-in-America-Manufacturing/747729/",
    "timestamp": "2025-05-22T20:27:00Z"
  },
  {
    "title": "Trump vows to fight public health crisis",
    "description": "United States President Donald Trump vowed on Thursday that his administration will fight the country's chronic disease epidemic.Trump is attending the Make America Healthy (MAHA) event with Secretary...",
    "link": "https://biztoc.com/x/18f2762cb77bd43e",
    "timestamp": "2025-05-22T20:24:21Z"
  },
  {
    "title": "State Dept says Chevron must leave Venezuela, even as American freed",
    "description": "The US State Department said Thursday that Chevron must wrap up operations in Venezuela next week as scheduled, contradicting an envoy who told a podcast differently after Caracas freed an American. President Donald Trump’s administration has canceled an exem…",
    "link": "https://www.digitaljournal.com/world/state-dept-says-chevron-must-leave-venezuela-even-as-american-freed/article",
    "timestamp": "2025-05-22T20:22:20Z"
  },
  {
    "title": "State Dept Says Chevron Must Leave Venezuela, Even As American Freed",
    "description": "The US State Department said Thursday that Chevron must wrap up operations in Venezuela next week as scheduled, contradicting an envoy who told a podcast differently after Caracas freed an American.",
    "link": "https://www.ibtimes.com/state-dept-says-chevron-must-leave-venezuela-even-american-freed-3774279",
    "timestamp": "2025-05-22T20:21:21Z"
  },
  {
    "title": "SCOOP: IS DEI STILL PLAGUING THE SECRET SERVICE? \nFRACAS OUTSIDE OBAMA RESIDENCE RAISES NEW QUESTIONS: Get a supervisor \"immediately before I whoop this girl's ass.\"",
    "description": "SCOOP: IS DEI STILL PLAGUING THE SECRET SERVICE? FRACAS OUTSIDE OBAMA RESIDENCE RAISES NEW QUESTIONS: Get a supervisor \"immediately before I whoop this girl's ass.\" Two female Secret Service Uniformed Division officers got into a physical fight outside former…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318563/posts",
    "timestamp": "2025-05-22T20:21:06Z"
  },
  {
    "title": "Trump Administration Launches Investigation Into Media Matters Amid Musk Lawsuits",
    "description": "The Trump administration is investigating Media Matters amid Elon Musk's ongoing lawsuits against the liberal website, The New York Times reported on Thursday.\nThe post Trump Administration Launches Investigation Into Media Matters Amid Musk Lawsuits first ap…",
    "link": "https://www.mediaite.com/politics/trump/trump-administration-launches-investigation-into-media-matters-amid-musk-lawsuits/",
    "timestamp": "2025-05-22T20:21:00Z"
  },
  {
    "title": "Trump Wouldn't Use Tragic Israeli Embassy Shooting As Excuse To Go (More) Fascist, Would He?",
    "description": "Thank goodness serious adults Pam Bondi and Judge Boxwine are in charge.",
    "link": "https://www.wonkette.com/p/trump-wouldnt-use-tragic-israeli",
    "timestamp": "2025-05-22T20:20:23Z"
  },
  {
    "title": "President Trump Highlights ‘Super Technology’ Being Used In ‘Golden Dome’ Defense System",
    "description": "The world has marveled at the efficacy of Israel’s “Iron Dome” missile-defense system, which has kept that nation safe amid countless attacks from its hostile neighbors. But President Donald Trump revealed this week that his administration is working on somet…",
    "link": "https://freerepublic.com/focus/f-chat/4318561/posts",
    "timestamp": "2025-05-22T20:20:07Z"
  },
  {
    "title": "'Death, Death, Horrible Death' — Trump Tees Off On Reporter Pivoting From Genocide Of White South Africans (Reagan Reese/The Daily Caller)",
    "description": "Reagan Reese / The Daily Caller:\n‘Death, Death, Horrible Death’ — Trump Tees Off On Reporter Pivoting From Genocide Of White South Africans  —  President Donald Trump laid into reporters on Wednesday after they tried to pivot his meeting in the Oval Office aw…",
    "link": "https://www.memeorandum.com/250522/p125",
    "timestamp": "2025-05-22T20:20:04Z"
  },
  {
    "title": "'Considerable changes': Mike Johnson's budget victory lap rained on by skeptical senators",
    "description": "House Republican Speaker Mike Johnson (R-LA) took a victory lap in a speech Thursday in which he cheered President Donald Trump for his leadership. Meanwhile, the bill he's so excited about still must pass the Senate — and things aren't looking good. \"Today w…",
    "link": "https://www.rawstory.com/senate-republicans-2672189831/",
    "timestamp": "2025-05-22T20:19:18Z"
  },
  {
    "title": "What to Know About the Trump Administration Revoking Harvard’s Ability to Enroll International Students",
    "description": "The Trump Administration's action threatens to impact thousands of students and a key source of Harvard's revenue.",
    "link": "https://time.com/7288058/harvard-international-students-trump-administration/",
    "timestamp": "2025-05-22T20:17:23Z"
  },
  {
    "title": "Chrisley Family Returning to Reality TV with Brand New Show",
    "description": "Reading Time: 3 minutesThe Chrisleys are returning to television!\nChrisley Family Returning to Reality TV with Brand New Show was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/05/chrisley-family-reality-tv-comeback/",
    "timestamp": "2025-05-22T20:17:11Z"
  },
  {
    "title": "Trump Was Right to Shame South African President",
    "description": "In one of the most incredible scenes in American diplomatic history, President Donald Trump halted his meeting with the South African president Wednesday to show him a... Read More\nThe post Trump Was Right to Shame South African President appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/05/22/trump-was-right-to-shame-south-african-president/",
    "timestamp": "2025-05-22T20:16:59Z"
  },
  {
    "title": "White House Defends Pushing 'Unsubstantiated' Video to Support South African 'Genocide' Claims",
    "description": "The White House defended the use of a misleading video in order to support claims that white South Africans are being oppressed and murdered in the country.",
    "link": "https://www.ibtimes.com/white-house-defends-pushing-unsubstantiated-video-support-south-african-genocide-claims-3774278",
    "timestamp": "2025-05-22T20:16:06Z"
  },
  {
    "title": "2503 - Has Israel Already Lost?; Trump’s South Africa Obsession w/ David Hearst, Benjamin Fogel",
    "description": "It's a jam-packed Emma-jority Thursday folks. House Republicans have jammed through an abominable budget bill that will gut Medicaid and lots of other vital programs. But guess what? There's more money for the military and for border enforcement, and most imp…",
    "link": "https://majorityfm.libsyn.com/2503-has-israel-already-lost-trumps-south-africa-obsession-w-david-hearst-benjamin-fogel",
    "timestamp": "2025-05-22T20:16:00Z"
  },
  {
    "title": "As Tornado Rips St. Louis, Defenseless Black Neighborhoods Faced Silence After FEMA Was Nowhere to Be Found",
    "description": "The city of St. Louisis witnessing the consequences of President Donald Trump’s attacks on the Federal Emergency Management Agency (FEMA) happen in real time. And to be expected, it’s the city’s Black residents and other vulnerable groups who are suffering th…",
    "link": "https://www.theroot.com/as-tornado-rips-st-louis-defenseless-black-neighborho-1851782019",
    "timestamp": "2025-05-22T20:15:00Z"
  }
]