[
  {
    "title": "Elon Musk's X settles Donald Trump's free speech lawsuit brought after Jan. 6 ban",
    "description": "USA TODAY and Yahoo may earn commission from links in this article. Pricing and availability subject to change.\nElon Musk's X has agreed to settle a lawsuit President Donald Trump brought against Twitter for approximately $10 million, multiple news outlets re…",
    "link": "https://biztoc.com/x/d9211f7c32d0b915",
    "timestamp": "2025-02-13T16:32:13Z"
  },
  {
    "title": "Senate confirms Robert F. Kennedy Jr. as health secretary",
    "description": "A leading anti-vaccine activist, Kennedy was a bizarre pick to lead Health and Human Services from the start.",
    "link": "https://www.msnbc.com/top-stories/latest/rfk-jr-confirmed-health-secretary-senate-rcna190839",
    "timestamp": "2025-02-13T16:32:06Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Confirmed as Trump's Health Secretary",
    "description": "As health secretary, Kennedy will oversee $1.7 trillion in spending on vaccines, food safety, and health insurance programs.",
    "link": "https://www.newsweek.com/robert-f-kennedy-jr-confirmed-trumps-health-secretary-2030707",
    "timestamp": "2025-02-13T16:32:02Z"
  },
  {
    "title": "Foreign Money, Alleged Lies, and Extremism—What GOP Senators Voting for Kash Patel Ignored",
    "description": "Republicans on the Senate Judiciary Committee voted on Thursday morning to approve the nomination of Kash Patel to be FBI director, despite a host of issues that once would have sunk any nominee for this critical national security and law enforcement post. Th…",
    "link": "https://www.motherjones.com/politics/2025/02/kash-patel-senate-republicans-fbi-extremism-lies-qanon-trump-revenge/",
    "timestamp": "2025-02-13T16:31:58Z"
  },
  {
    "title": "Donald Trump health nominee Robert Kennedy Jr secures enough US Senate votes for confirmation",
    "description": "Robert F. Kennedy Jr., nominated by President Donald Trump for U.S. Health Secretary, has secured enough votes from senators for confirmation. He will lead the Department of Health and Human Services, overseeing agencies like the FDA and CDC.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-health-nominee-robert-kennedy-jr-secures-enough-us-senate-votes-for-confirmation/articleshow/118221398.cms",
    "timestamp": "2025-02-13T16:31:33Z"
  },
  {
    "title": "Laura Loomer turns on Trump for giving up power to Elon Musk: 'It's hard to deny'",
    "description": "MAGA activists Steve Bannon and Laura Loomer blasted Elon Musk and President Donald Trump for distracting from the budget deficit and national debt by focusing on internet memes instead.As the House Budget Committee was marking up a budget likely to have few …",
    "link": "https://www.rawstory.com/laura-loomer-elon-musk-co-president/",
    "timestamp": "2025-02-13T16:31:32Z"
  },
  {
    "title": "Marlon Wayans Demolishes Soulja Boy After Has-Been Rapper Spews Homophobic Slur While …",
    "description": "Reading Time: 3 minutesWhen Marlon Wayans claps back against Soulja Boy, it hurts. Good. Aside from being a footnote in the Bhad Bhabie …\nMarlon Wayans Demolishes Soulja Boy After Has-Been Rapper Spews Homophobic Slur While … was originally published on The H…",
    "link": "http://www.thehollywoodgossip.com/2025/02/marlon-wayans-soulja-boy-slur/",
    "timestamp": "2025-02-13T16:30:58Z"
  },
  {
    "title": "Robert Kennedy Jr. Confirmed to Lead Health and Human Services Department",
    "description": "Robert F. Kennedy Jr., the president’s controversial choice to lead the Department of Health and Human Services, was confirmed Thursday by a 52-48 vote in the Senate. A longtime critic of vaccines, Kennedy will oversee the nation’s sprawling health care burea…",
    "link": "https://variety.com/2025/politics/news/robert-kennedy-jr-health-human-services-confirmation-vote-1236296756/",
    "timestamp": "2025-02-13T16:30:56Z"
  },
  {
    "title": "Trump Hostility to US Offshore Wind Reverberates Through Supply Chain",
    "description": "Companies that committed to investments in U.S. offshore wind infrastructure and supply chains are scrapping their plans as the projects they were meant to serve face huge setbacks, including President Donald Trump's plan to end federal support.",
    "link": "https://gcaptain.com/trump-hostility-to-us-offshore-wind-reverberates-through-supply-chain/",
    "timestamp": "2025-02-13T16:30:54Z"
  },
  {
    "title": "Senate confirms Robert F Kennedy Jr. to serve as Trump's Health secretary",
    "description": "The Senate on Thursday confirmed Robert F. Kennedy Jr. as Health and Human Services (HHS) secretary in President Donald Trump's cabinet.",
    "link": "https://www.foxnews.com/politics/senate-confirms-robert-f-kennedy-jr-serve-trumps-health-secretary",
    "timestamp": "2025-02-13T16:30:27Z"
  },
  {
    "title": "'Patience paid off': Putin out of shadow after Trump call",
    "description": "Russian President Vladimir Putin has been largely shunned by the West since his troops attacked Ukraine in February 2022, triggering the biggest conflict in Europe since World War II. That era of isolation came to an abrupt end on Wednesday, when U.S. Preside…",
    "link": "https://www.rawstory.com/patience-paid-off-putin-out-of-shadow-after-trump-call/",
    "timestamp": "2025-02-13T16:30:16Z"
  },
  {
    "title": "What to know about the federal workforce under Trump",
    "description": "Here's what to know about the federal workforce, its job protections and the process of cutting back on its ranks.",
    "link": "https://roanoke.com/news/nation-world/government-politics/civil-servants-federal-workers-elon-musk-deferred-resignation/article_a2c53e4a-4e34-530a-9380-169239f9d98a.html",
    "timestamp": "2025-02-13T16:30:00Z"
  },
  {
    "title": "What to know about the federal workforce under Trump",
    "description": "Here's what to know about the federal workforce, its job protections and the process of cutting back on its ranks.",
    "link": "https://richmond.com/news/nation-world/government-politics/civil-servants-federal-workers-elon-musk-deferred-resignation/article_eba7eea3-adcc-52b5-98f2-bfe75c37577b.html",
    "timestamp": "2025-02-13T16:30:00Z"
  },
  {
    "title": "The D Brief: ‘Start negotiations immediately’; Gabbard, intel chief; 5K troops at border; State Dept.’s armored Teslas?; And just a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/02/the-d-brief-february-13-2025/402987/",
    "timestamp": "2025-02-13T16:29:58Z"
  },
  {
    "title": "JD Vance’s Wife Usha Continues Favorite Daughter Style Streak in Germany",
    "description": "JD Vance and his wife, Usha Vance, visited the Dachau concentration camp memorial in Germany on Tuesday. She wore Favorite Daughter.",
    "link": "http://wwd.com/pop-culture/celebrity-news/jd-vance-wife-usha-favorite-daughter-coat-germany-1236929607/",
    "timestamp": "2025-02-13T16:29:54Z"
  },
  {
    "title": "Hegseth Says 'Everything Is on the Table' For Russia-Ukraine Negotiations",
    "description": "Hegseth's assertion that NATO membership for Ukraine is unrealistic fueled debate over the West's long-term commitment to Kyiv.",
    "link": "https://www.newsweek.com/hegseth-says-everything-table-russia-ukraine-negotiations-2030699",
    "timestamp": "2025-02-13T16:29:12Z"
  },
  {
    "title": "Why a judge sided with Trump's federal employee 'Fork in the Road' resignation deadline",
    "description": "Federal labor unions didn't have legal standing to sue, a federal judge in Massachusetts said. The administration had been losing a series of claims.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-federal-workers-resignation-deadline-judge-rcna192004",
    "timestamp": "2025-02-13T16:29:06Z"
  },
  {
    "title": "Ukraine to participate in peace talks 'one way or another', Kremlin says",
    "description": "Kremlin spokesman Dmitry Peskov said on Thursday that Ukraine would participate \"one way or another\" in any talks to end the war, but there would be a separate US-Russian track to the talks, Russian state news agency TASS reported. Another agency, Interfax, q…",
    "link": "https://freerepublic.com/focus/f-chat/4297317/posts",
    "timestamp": "2025-02-13T16:28:00Z"
  },
  {
    "title": "IEA Sees Muted Effects of New Russia Sanctions Amid Workarounds",
    "description": "The International Energy Agency has lowered its outlook for Russia’s oil production this year by only a narrow margin even with sweeping western energy sanctions, as the Paris-based organization expects the nation to come up with workarounds.",
    "link": "https://gcaptain.com/iea-sees-muted-effects-of-new-russia-sanctions-amid-workarounds/",
    "timestamp": "2025-02-13T16:27:50Z"
  },
  {
    "title": "Explainer: Breaking down Trump’s executive order targeting Palestine activists",
    "description": "Last month Donald Trump signed an Executive Order aimed at canceling the visas of foreign students who advocate for Palestine. Mondoweiss talked to legal experts about its possible impact and the wider attacks on Palestine advocacy in the U.S.",
    "link": "https://mondoweiss.net/2025/02/explainer-breaking-down-trumps-executive-order-targeting-palestine-activists/",
    "timestamp": "2025-02-13T16:25:45Z"
  },
  {
    "title": "Donald Trump nominates Apple employee to serve as top auto safety regulator",
    "description": "Jonathan Morrison, working with Apple since May 2021, has been nominated by US President Donald Trump to lead National Highway Traffic Safety Administration (NHTSA) as its administrator.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-nominates-apple-employee-to-serve-as-top-auto-safety-regulator/articleshow/118221213.cms",
    "timestamp": "2025-02-13T16:25:44Z"
  },
  {
    "title": "Hegseth: US does not seek conflict with China",
    "description": "United States Defense Secretary Pete Hegseth underscored on Thursday that President Donald Trump maintains a strong relationship with his Chinese counterpart Xi Jinping, despite their diverging nation...",
    "link": "https://biztoc.com/x/9705be4a2874abc8",
    "timestamp": "2025-02-13T16:25:39Z"
  },
  {
    "title": "Mass firings of federal workers begin as Donald Trump, Elon Musk purge U.S. government",
    "description": "Mass firings at multiple U.S. government agencies have begun as President Donald Trump and Tesla CEO Elon Musk accelerate their purge of America’s federal bureaucracy, union sources and employees familiar with the layoffs told Reuters on Thursday.\nTermination…",
    "link": "https://biztoc.com/x/47251961887bb664",
    "timestamp": "2025-02-13T16:25:38Z"
  },
  {
    "title": "Robert F. Kennedy Jr. is confirmed as Trump’s health secretary after a close Senate vote",
    "description": "Republicans fell in line behind Trump despite hesitancy over Kennedy views on vaccines.",
    "link": "https://www.denverpost.com/2025/02/13/trump-cabinet-rfk-vote/",
    "timestamp": "2025-02-13T16:24:35Z"
  },
  {
    "title": "Robert F. Kennedy Jr. is confirmed as Trump’s secretary after a close Senate vote",
    "description": "Republicans fell in line behind Trump despite hesitancy over Kennedy views on vaccines.",
    "link": "https://www.bostonherald.com/2025/02/13/trump-cabinet-rfk-vote/",
    "timestamp": "2025-02-13T16:24:35Z"
  },
  {
    "title": "Alibaba confirms Apple deal bringing AI features to iPhones in China",
    "description": "Alibaba on Thursday confirmed recent reports of a partnership with Apple that’s set to bring AI features to iPhones sold in China. The deal is an important one for Apple, as iPhone sales have dropped precipitously in the world’s largest smartphone market. The…",
    "link": "https://techcrunch.com/2025/02/13/alibaba-confirms-apple-deal-bringing-ai-features-to-iphones-in-china/",
    "timestamp": "2025-02-13T16:24:29Z"
  },
  {
    "title": "‘I Think Everyone Knew This Is Probably Not Going to Be a Good Film’",
    "description": "A technical crew member on Marvel’s ‘Captain America: Brave New World’ recalls chaotic reshoots, a curmudgeonly Harrison Ford, and a director out of his depth. ‘I think everyone knew this is probably not going to be a good film.’",
    "link": "http://www.vulture.com/article/inside-captain-america-brave-new-worlds-chaotic-production.html",
    "timestamp": "2025-02-13T16:24:18Z"
  },
  {
    "title": "Ukraine, US weigh critical minerals agreement",
    "description": "Ukraine and the United States are considering a crucial minerals deal at this week's Munich Security Conference, according to officials from the two countries.\n\n\nAfter meeting with Ukrainian President Volodymyr Zelenskyy, U.S. Treasury Secretary Scott Bessent…",
    "link": "https://www.voanews.com/a/ukraine-us-weigh-critical-minerals-agreement/7973695.html",
    "timestamp": "2025-02-13T16:24:07Z"
  },
  {
    "title": "House Republican Hits Back at Pete Hegseth’s Ukraine Statement: ‘There Are Consequences of Rewarding the Invader’",
    "description": "“We should have moral clarity who started this war, who is bombing cities indiscriminately and who our real friend here is.\"\nThe post House Republican Hits Back at Pete Hegseth’s Ukraine Statement: ‘There Are Consequences of Rewarding the Invader’ first appea…",
    "link": "https://www.mediaite.com/news/house-republican-hits-back-at-pete-hegseths-ukraine-statement-there-are-consequences-of-rewarding-the-invader/",
    "timestamp": "2025-02-13T16:24:05Z"
  },
  {
    "title": "Judge hands Trump victory over federal employee payouts",
    "description": "In the January OPM email sent to employees, workers learned that the Trump administration would reform the workforce through 4 pillars",
    "link": "https://www.wnd.com/2025/02/judge-hands-trump-victory-over-federal-employee-payouts/",
    "timestamp": "2025-02-13T16:23:57Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Confirmed as Health and Human Services Secretary - The HighWire",
    "description": "RFK Jr. is confirmed as HHS Secretary, pledging to reform public health agencies, tackle chronic disease, and expose government corruption.",
    "link": "https://thehighwire.com/news/robert-f-kennedy-jr-confirmed-as-health-and-human-services-secretary/",
    "timestamp": "2025-02-13T16:23:02Z"
  },
  {
    "title": "Farmers and rural businesses shelled out money for improvements. Will their promised rebates arrive?",
    "description": "A freeze on federal loans and grants is sending tremors across the rural U.S.",
    "link": "https://www.bostonherald.com/2025/02/13/climate-clean-energy-rebate-freeze/",
    "timestamp": "2025-02-13T16:22:51Z"
  },
  {
    "title": "RFK Jr. will call the shots on health policy. Here's where he stands on vaccines, abortion, and your dinner plate.",
    "description": "Robert F. Kennedy Jr, a vaccine critic and the newly-appointed US health secretary, thanked \"MAHA moms\" before senators voted him in.",
    "link": "https://www.businessinsider.com/rfk-jr-confirmed-health-secretary-2025-2",
    "timestamp": "2025-02-13T16:22:43Z"
  },
  {
    "title": "Donald Trump, UnitedHealthcare, and the “Villains” of a Broken Economy",
    "description": "New York magazine’s Sarah Jones explains how America’s underclass was devastated by a “dysfunctional” health care system during COVID, and argues that Trump’s reelection is “a triumph for the ruling class.”",
    "link": "https://www.vanityfair.com/news/story/donald-trump-unitedhealthcare-covid-broken-economy",
    "timestamp": "2025-02-13T16:22:41Z"
  },
  {
    "title": "US Treasury confirms Trump sanctions on ICC prosecutor Karim Khan",
    "description": "Trump said the court had abused its power when issuing \"baseless arrest warrants\" against Prime Minister Benjamin Netanyahu and then-Defense Minister Yoav Gallant.",
    "link": "https://www.jpost.com/breaking-news/article-842053",
    "timestamp": "2025-02-13T16:22:36Z"
  },
  {
    "title": "Mass firings of federal workers begin as Trump and Musk purge U.S. government",
    "description": "By Tim Reid\nWASHINGTON (Reuters) - Mass firings at multiple U.S. government agencies have begun as President Donald Trump and Tesla CEO Elon Musk accelerate their purge of America's federal bureaucracy, union sources and employees familiar with the layoffs to…",
    "link": "https://biztoc.com/x/8fd2fede45cfb62e",
    "timestamp": "2025-02-13T16:22:11Z"
  },
  {
    "title": "‘It is impossible to bring us to our knees’: Russia reacts to Putin-Trump phone call",
    "description": "Russian politicians, journalists, and experts reacted to the news about the first contact between the presidents of Russia and the US Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612661-russia-reacts-putin-trump-call/",
    "timestamp": "2025-02-13T16:22:11Z"
  },
  {
    "title": "USAID Hearing Protesters Rage Against Trump Cutting Funding For Health Program — But There’s A Problem",
    "description": "Protesters at a hearing called on President Donald Trump's administration to reinstate funding for an AIDS initiative that has already had its funding restored.",
    "link": "https://dailycaller.com/2025/02/13/usaid-hearing-protesters-rage-against-trump-cutting-funding-for-health-program-but-theres-a-problem/",
    "timestamp": "2025-02-13T16:21:54Z"
  },
  {
    "title": "'Kicking and screaming': How Donald Trump negotiates, according to The Art of the Deal",
    "description": "'That's just my makeup. I fight when I feel I'm getting screwed, even if it's costly and difficult and highly risky'",
    "link": "https://nationalpost.com/news/world/donald-trump-negotiation-the-art-of-the-deal",
    "timestamp": "2025-02-13T16:21:38Z"
  },
  {
    "title": "Jimmy Kimmel needles Trump over post about Taylor Swift boos, claims he's 'jealous'",
    "description": "Late-night host Jimmy Kimmel took a shot at President Donald Trump on Monday after the commander-in-chief wrote on social media about Taylor Swift getting booed.",
    "link": "https://www.foxnews.com/sports/jimmy-kimmel-needles-trump-over-post-about-taylor-swift-boos-claims-hes-e",
    "timestamp": "2025-02-13T16:21:34Z"
  },
  {
    "title": "Judge Orders Trump Administration to Stop Deleting January 6 Videos",
    "description": "Trump officials have been deleting large numbers of videos of the 2021 Capitol riot from government websites.",
    "link": "https://www.newsweek.com/president-donald-trump-january-6-capitol-riot-election-2020-certification-press-coalition-2030601",
    "timestamp": "2025-02-13T16:21:24Z"
  },
  {
    "title": "DOGE discovers the Biden-Mayorkas illegal migration funding machine - NewsBreak",
    "description": "Via Homeland Security, the Biden administration channeled billions to FEMA, which in turn granted states, cities and nonprofits money to transport, house a",
    "link": "https://www.newsbreak.com/share/3809047323209-doge-discovers-the-biden-mayorkas-illegal-migration-funding-machine?_f=app_share&amp;pd=0EVYRQRT&amp;lang=en_US&amp;send_time=1739463621&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v4%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v9&amp;s=i2",
    "timestamp": "2025-02-13T16:20:47Z"
  },
  {
    "title": "BREAKING: Senate Confirms Robert F. Kennedy Jr. As Next HHS Secretary",
    "description": "The Senate voted to confirm Robert F. Kennedy Jr. as the next Secretary of Health and Human Services (HHS) on Thursday. He has received 51 votes as of publication. The vote was mostly along party lines, though former Senate Majority Leader Mitch McConnell was…",
    "link": "https://dailycaller.com/2025/02/13/senate-confirms-robert-f-kennedy-jr-hhs-secretary-mcconnell-vaccines/",
    "timestamp": "2025-02-13T16:20:36Z"
  },
  {
    "title": "Bernie Sanders Launches Tour 'to Fight Oligarchy': Here's Where He's Going",
    "description": "Sanders said in a video message that his tour is against billionaires like Elon Musk, who are using power to gain more money.",
    "link": "https://www.newsweek.com/bernie-sanders-elon-musk-tour-oligarchy-2030615",
    "timestamp": "2025-02-13T16:20:05Z"
  },
  {
    "title": "Ode to Passed FReeper DainBramaged, and the Hunt of a Lifetime He Gave Me!",
    "description": "Six years ago, FReeper “dainbramaged” (a guy I eventually knew In Real Life named “Rich”, last name withheld for his family’s anonymity) and I were FReepmailing about firearms. He mentioned he had a Winchester Model 94 in .30-30 that his Great Grandfather had…",
    "link": "https://freerepublic.com/focus/f-news/4297314/posts",
    "timestamp": "2025-02-13T16:19:53Z"
  },
  {
    "title": "'Patience paid off': Putin out of shadow after Donald Trump call",
    "description": "US President Trump’s phone call to Russian President Putin, their first in almost three years, has raised concerns worldwide. The lengthy discussion signals a potential end to Russia’s isolation and could initiate new talks on the Ukraine conflict, despite Pu…",
    "link": "https://economictimes.indiatimes.com/news/defence/patience-paid-off-putin-out-of-shadow-after-donald-trump-call/articleshow/118221193.cms",
    "timestamp": "2025-02-13T16:19:32Z"
  },
  {
    "title": "Trump says he'll announce reciprocal tariffs on US trading partners on Thursday",
    "description": "President Donald Trump says he's announcing increases on U.S. tariffs to match the tax rates other countries charge on imports.",
    "link": "https://www.clickondetroit.com/business/2025/02/13/trump-says-hell-sign-sweeping-reciprocal-tariffs-on-us-trading-partners-on-thursday/",
    "timestamp": "2025-02-13T16:18:40Z"
  },
  {
    "title": "Jonathan Turley explains how New York law protects illegal aliens",
    "description": "'Tip-off' provision part of system targeted by DOJ lawsuit against Letitia James, Kathy Hochul",
    "link": "https://www.wnd.com/2025/02/jonathan-turley-explains-how-new-york-law-protects-illegal-aliens/",
    "timestamp": "2025-02-13T16:18:30Z"
  },
  {
    "title": "‘Patience paid off’: Putin out of shadow after Trump call",
    "description": "Russian President Vladimir Putin has been largely shunned by the West since his troops attacked Ukraine in February 2022, triggering the biggest conflict in Europe since World War II.  That era of isolation came to an abrupt end on Wednesday, when US Presiden…",
    "link": "https://www.digitaljournal.com/world/patience-paid-off-putin-out-of-shadow-after-trump-call/article",
    "timestamp": "2025-02-13T16:18:20Z"
  },
  {
    "title": "\"Måke Califørnia Great Ægain\"",
    "description": "In response to the initiative for the U,S.  to buy (or otherwise acquire) Greenland from Denmark, some Danes have started a petition to buy California from the U.S. Have you ever looked at a map and thought, \"You know what Denmark needs? More sunshine, palm t…",
    "link": "https://languagelog.ldc.upenn.edu/nll/?p=68290",
    "timestamp": "2025-02-13T16:17:54Z"
  },
  {
    "title": "Don’t Expect Republicans to Stop Trump’s Constitutional Chaos",
    "description": "Sure, a few GOP lawmakers have warned the president against defying court rulings. But he's already done just that, with the encouragement of top allies like JD Vance, Elon Musk and Mike Johnson.",
    "link": "https://www.vanityfair.com/news/story/republicans-trump-constitutional-chaos",
    "timestamp": "2025-02-13T16:17:17Z"
  },
  {
    "title": "What Are Reciprocal Tariffs and Who Might Be Impacted by Trump’s Plan?",
    "description": "\"Very simply, it’s if they charge us, we charge them,\" President Trump said.",
    "link": "https://time.com/7222082/what-are-reciprocal-tariffs-who-might-be-impacted-by-trump-plan/",
    "timestamp": "2025-02-13T16:17:01Z"
  },
  {
    "title": "Aggressive deregulation creates risky business environment",
    "description": "Through DOGE, President Donald Trump is cutting work and funding to federal agencies to overhaul business rules and regulations in the U.S.",
    "link": "https://www.techtarget.com/searchcio/news/366619263/Aggressive-deregulation-creates-risky-business-environment",
    "timestamp": "2025-02-13T16:17:00Z"
  },
  {
    "title": "Opinion: Federal courts face challenges in countering Trump's and Musk's actions",
    "description": "State governments, community groups, advocacy nonprofits and regular Americans have filed a large and growing number of federal lawsuits opposing President Donald Trump's barrage of executive orders and policy statements. Some of his actions have been put on …",
    "link": "https://phys.org/news/2025-02-opinion-federal-courts-countering-trump.html",
    "timestamp": "2025-02-13T16:16:08Z"
  },
  {
    "title": "‘Serious Consequences’: House Votes To Slap Migrants Who Flee Border Patrol On Vehicle With Jail Time, Deportation",
    "description": "House Republicans passed legislation that calls for penalties onto migrants that try to evade Border Patrol agents by leading them on high-speed car chases.",
    "link": "https://dailycaller.com/2025/02/13/republicans-get-tough-on-fleeing-migrants/",
    "timestamp": "2025-02-13T16:16:02Z"
  },
  {
    "title": "Reproductive Labor Has Always Been Fundamental to Social Movements’ Resistance",
    "description": "Reproductive labor — like cooking, child care and distributing mutual aid — serves as the lifeblood of social movements.",
    "link": "https://truthout.org/articles/reproductive-labor-has-always-been-fundamental-to-social-movements-resistance/",
    "timestamp": "2025-02-13T16:15:34Z"
  },
  {
    "title": "'Patience Paid Off': Putin Out Of Shadow After Trump Call",
    "description": "Russian President Vladimir Putin has been largely shunned by the West since his troops attacked Ukraine in February 2022, triggering the biggest conflict in Europe since World War II. \nThat era of isolation came to an abrupt end on Wednesday, when US Presiden…",
    "link": "https://www.ibtimes.com/patience-paid-off-putin-out-shadow-after-trump-call-3763597",
    "timestamp": "2025-02-13T16:15:14Z"
  },
  {
    "title": "Tesla's Name Removed From Planned State Department Contract As Musk's Involvement With Trump Called Into Question",
    "description": "The State Department removed Tesla's name from a planned $400 million armored vehicle contract after media concerns about Elon Musk's involvement with Trump.",
    "link": "https://www.ibtimes.com/teslas-name-removed-planned-state-department-contract-musks-involvement-trump-called-question-3763596",
    "timestamp": "2025-02-13T16:14:52Z"
  },
  {
    "title": "Elon Musk urges deletion of US federal agencies for efficiency",
    "description": "Elon Musk suggests deleting entire U.S. federal agencies to improve efficiency",
    "link": "https://www.wxii12.com/article/elon-musk-delete-federal-agencies/63785274",
    "timestamp": "2025-02-13T16:14:32Z"
  },
  {
    "title": "The FCC is a weapon in Trump’s war on free speech",
    "description": "I’ve been the editor-in-chief of The Verge for over 10 years now, and a tech journalist for about 15 — and until recently, it felt pretty safe to assume that there was a zero percent chance that the US government would punish me for doing my job. There’s that…",
    "link": "https://www.theverge.com/decoder-podcast-with-nilay-patel/612069/fcc-brendan-carr-elon-musk-donald-trump-first-amendment-free-speech-censorship",
    "timestamp": "2025-02-13T16:14:25Z"
  },
  {
    "title": "BigLaw firm tones down diversity references on website, citing ‘fluctuating internal and external expectations’",
    "description": "K&L Gates has removed references to “diversity” from its website and rebranded its Diversity and Inclusion Committee.Above the Law noted the changes after monitoring BigLaw…",
    "link": "https://www.abajournal.com/news/article/biglaw-firm-tones-down-diversity-references-on-website-citing-fluctuating-internal-and-external-expectations",
    "timestamp": "2025-02-13T16:13:00Z"
  },
  {
    "title": "Senate Judiciary Committee Votes To Approve Kash Patel—What To Know About Trump’s FBI Nominee",
    "description": "Patel is a controversial nominee, having long raged against the so-called Deep State and prioritized his loyalty to Trump.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/13/senate-judiciary-committee-votes-to-approve-kash-patel-what-to-know-about-trumps-fbi-nominee/",
    "timestamp": "2025-02-13T16:10:05Z"
  },
  {
    "title": "Russia rejoices at Trump-Putin call as Zelenskyy rejects talks without Ukraine present (Politico)",
    "description": "Politico:\nRussia rejoices at Trump-Putin call as Zelenskyy rejects talks without Ukraine present  —  A senior Russian lawmaker said that the call “will go down in the history of world politics and diplomacy.”  —  Russian officials and state media took a trium…",
    "link": "https://www.memeorandum.com/250213/p55",
    "timestamp": "2025-02-13T16:10:00Z"
  },
  {
    "title": "Mission Drift",
    "description": "It hardly matters for this purpose whether the new spy writers, late of their intelligence agencies, can produce basically competent thrillers; they all can. The question is what else they can do, what new spin they can put on the established library of espio…",
    "link": "https://www.nplusonemag.com/online-only/book-review/mission-drift/",
    "timestamp": "2025-02-13T16:09:47Z"
  },
  {
    "title": "State Dept.’s plan to buy $400 million worth of armored Teslas hastily changed to ‘armored EVs’",
    "description": "On Wednesday, reports from The New York Times and Drop Site News pointed out that the US Department of State included an order for $400 million worth of armored Teslas in its 2025 procurement forecast. But shortly after these reports emerged, the agency repla…",
    "link": "https://www.theverge.com/news/612017/tesla-armored-cybertrucks-order-state-department",
    "timestamp": "2025-02-13T16:08:29Z"
  },
  {
    "title": "Euro whipsaws as markets react to Trump’s ‘reciprocal tariff’ threat",
    "description": "“I think the defining feature of the present situation [is] we don't know what is going to come,\" said one senior EU official.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/euro-whipsaws-as-markets-react-to-trumps-reciprocal-tariff-threat/",
    "timestamp": "2025-02-13T16:08:23Z"
  },
  {
    "title": "Trump Determined to Undo Damage to US-Russian Relations – Former Pentagon Officer",
    "description": "The phone call between Presidents Vladimir Putin and Donald Trump marks the formal beginning of peace negotiations between the US and Russia, EMP Task Force scholar and former US Department of Defense officer David Pyne tells Sputnik.",
    "link": "https://sputnikglobe.com/20250213/trump-determined-to-undo-damage-to-us-russian-relations--former-pentagon-officer-1121567345.html",
    "timestamp": "2025-02-13T16:08:05Z"
  },
  {
    "title": "Drill, Baby, Drill? Why Oil Producers Are Hesitant Despite Trump’s Push",
    "description": "Trump's 'Drill, Baby, Drill' push faces industry hesitation as oil producers prioritize profits over politics. Explore the market forces shaping U.S. oil in 2025.",
    "link": "https://www.forbes.com/sites/rrapier/2025/02/13/drill-baby-drill-why-oil-producers-are-hesitant-despite-trumps-push/",
    "timestamp": "2025-02-13T16:07:53Z"
  },
  {
    "title": "'Thuggery': Musk Backs GOP Push to Impeach Judge Who Blocked Trump Funding Freeze",
    "description": "Unelected shadow government leader Elon Musk ramped up his attack on the U.S. judiciary on Thursday by expressing support for a Republican impeachment effort targeting one of the federal judges who blocked the Trump administration's destructive funding freeze…",
    "link": "https://www.commondreams.org/news/musk-impeach-judges",
    "timestamp": "2025-02-13T16:07:47Z"
  },
  {
    "title": "Bezalel Smotrich will 'pay in heaven' for opposing Gaza deal, hostage's father says",
    "description": "Speaking with 103FM, Elhanan Danino, the father of Ori Danino, strongly criticized the government.",
    "link": "https://www.jpost.com/israel-news/article-842040",
    "timestamp": "2025-02-13T16:06:38Z"
  },
  {
    "title": "After 3 Weeks on the Job, Trump Getting Close to Doubling Support from Black Men",
    "description": "\"If you’re on Team Trump right now, you’ve got to be feeling good about these numbers and quick progress they’ve made already with voters.”",
    "link": "https://www.westernjournal.com/3-weeks-job-trump-getting-close-doubling-support-black-men/",
    "timestamp": "2025-02-13T16:06:33Z"
  },
  {
    "title": "Inside boxing's rise in popularity, concerning trends in America and TKO's looming potential takeover",
    "description": "The news of the week is painting a bleak picture for the future of the sport in the United States",
    "link": "https://www.cbssports.com/boxing/news/inside-boxings-rise-in-popularity-concerning-trends-in-america-and-tkos-looming-potential-takeover/",
    "timestamp": "2025-02-13T16:06:29Z"
  },
  {
    "title": "Trump Education nominee Linda McMahon says shutting down DOE would 'require congressional action'",
    "description": "President Donald Trump's Education secretary nominee Linda McMahon faces fiery questioning from senators about the president's goal of dismantling the department.",
    "link": "https://www.foxnews.com/politics/trump-education-nominee-linda-mcmahon-says-shutting-down-doe-would-require-congressional-action",
    "timestamp": "2025-02-13T16:06:25Z"
  },
  {
    "title": "Rumors: China Angling to Host Trump-Putin Summit on Ukraine",
    "description": "The Wall Street Journal shared a rumor on Thursday, citing anonymous people \"familiar,\" that the Communist Party of China proposed to President Donald Trump that Beijing could host a summit between him and Russian strongman Vladimir Putin to discuss the war o…",
    "link": "https://www.breitbart.com/asia/2025/02/13/rumors-china-angling-to-host-trump-putin-summit-on-ukraine/",
    "timestamp": "2025-02-13T16:05:30Z"
  },
  {
    "title": "'Do-or-die' time for Mike Johnson as he faces 'vote-count problem': Politico",
    "description": "House Speaker Mike Johnson (R-LA) is facing the first real test of his control of his GOP caucus in Donald Trump's second term as the clock is ticking toward a government shutdown.According to a report from Politico's Eugene Daniels, it is \"do-or-die\" time fo…",
    "link": "https://www.rawstory.com/mike-johnson-do-or-die/",
    "timestamp": "2025-02-13T16:05:11Z"
  },
  {
    "title": "Trump brandishes his big weapon: What are reciprocal tariffs?",
    "description": "Just before meeting Prime Minister Narendra Modi, US President Donald Trump announced plans to impose reciprocal tariffs on countries matching their tariffs on US goods. This move, intended to address trade imbalances, could stir international tensions and im…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-brandishes-his-big-weapon-what-are-reciprocal-tariffs/articleshow/118220603.cms",
    "timestamp": "2025-02-13T16:04:07Z"
  },
  {
    "title": "The worst foods to buy in the supermarket",
    "description": "The Fox News Lifestyle Newsletter brings you trending stories on family, travel, food, neighbors helping neighbors, pets, autos, military veterans, heroes, faith and American values.",
    "link": "https://www.foxnews.com/lifestyle/worst-foods-buy-supermarket",
    "timestamp": "2025-02-13T16:02:17Z"
  },
  {
    "title": "Hegseth Warns NATO That European Members Need To Take Primary Role In Their Defense",
    "description": "Hegseth addressed the Trump administration's view of the defense pact after meetings at NATO headquarters.",
    "link": "https://www.ibtimes.com/pete-hegseth-nato-deffense-europe-3763588",
    "timestamp": "2025-02-13T16:02:09Z"
  },
  {
    "title": "Elon Musk calls for the US to 'delete entire agencies' from the federal government",
    "description": "Elon Musk calls for the US to 'delete entire agencies' from the federal governmentclick2houston.com",
    "link": "https://www.click2houston.com/business/2025/02/13/elon-musk-calls-for-us-government-to-delete-entire-agencies/",
    "timestamp": "2025-02-13T16:00:40Z"
  },
  {
    "title": "Associated Press Blocked from Oval Office for Dead-Naming ‘Gulf of America’",
    "description": "Google Maps and Encyclopedia Britannica recognize the new name.\nThe post Associated Press Blocked from Oval Office for Dead-Naming ‘Gulf of America’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/associated-press-blocked-from-oval-office-for-dead-naming-gulf-of-america/",
    "timestamp": "2025-02-13T16:00:35Z"
  },
  {
    "title": "Is the Government Buying 'Armored Teslas'? What We Know",
    "description": "A State Department procurement forecast initially included Tesla in a $400 million contract for armored electric vehicles.",
    "link": "https://www.newsweek.com/government-buying-armored-teslas-2030485",
    "timestamp": "2025-02-13T16:00:08Z"
  },
  {
    "title": "Trump Takes Charge of the Kennedy Center",
    "description": "Trump doesn’t understand the arts. There is no evidence that he has ever been interested in the arts. He doesn’t understand that the arts by their nature are cutting-edge. They take us to imaginative worlds we knew nothing about. They expand our horizons. We …",
    "link": "https://dianeravitch.net/2025/02/13/trump-takes-charge-of-the-kennedy-center/",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "My Favorite Things: Change, Slowly Then All at Once",
    "description": "Our favorite things change. But, writes Tom Guarriello, there’s a lot more going on under the hood of \"change,\" than is immediately obvious.\nThe post My Favorite Things: Change, Slowly Then All at Once appeared first on PRINT Magazine.",
    "link": "https://www.printmag.com/creative-voices/my-favorite-things-change-slowly-then-all-at-once/",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "Orlando Sentinel on Trump’s Gaza Fantasy: Is He Unhinged or Has He Gone Mad?”",
    "description": "The Orlando Sentinel editorial board published a scathing editorial about Trump’s ridiculous idea of evicting the people of Gaza and turning their land into a luxury resort. It said: No president ever proposed anything so unhinged as Donald Trump’s brutal fan…",
    "link": "https://dianeravitch.net/2025/02/13/orlando-sentinel-on-trumps-gaza-fantasty-is-he-unhinged-or-has-he-gone-mad/",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "The 100 Greatest TV Performances of the 21st Century",
    "description": "When one thinks of the defining TV performances of the past 25 or so years, what comes to mind? For Variety staffers, some of the answers included a teacher-turned-drug kingpin, spies working both for and against the U.S. government — and perhaps the defining…",
    "link": "https://variety.com/lists/greatest-tv-performances/",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "European Leaders Demand Involvement in Ukraine Peace Talks",
    "description": "European leaders demanded assurances that Europe will be part of any peace talks with Russia after U.S. President Donald Trump stepped up his push to broker a deal to end the fighting in Ukraine by speaking directly with Russian President Vladimir Putin for m…",
    "link": "https://oilprice.com/Geopolitics/International/European-Leaders-Demand-Involvement-in-Ukraine-Peace-Talks.html",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "‘No drop in investors’ confidence’",
    "description": "KUALA LUMPUR: Malaysia’s economic indicators have shown improvement, says Datuk Seri Anwar Ibrahim, dismissing claims by Opposition MPs that investors’ confidence has eroded due to policy uncertainties and flip-flops. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/14/no-drop-in-investors-confidence",
    "timestamp": "2025-02-13T16:00:00Z"
  },
  {
    "title": "Stock market today: Fat profit reports keep Wall Street steady ahead of a tariff announcement",
    "description": "NEW YORK (AP) — U.S. stocks are holding relatively steady on Thursday, ahead of an expected announcement on tariffs by President Donald Trump, as big U.S. companies keep reporting bigger profits than expected.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9b5abc73-59f4-4036-9819-4dcb9abf961e",
    "timestamp": "2025-02-13T15:59:53Z"
  },
  {
    "title": "Disney is pulling back on trigger warnings for old movies",
    "description": "Disney (DIS) is overhauling how it warns users on its streaming platform of older films that contain racial stereotypes. Read more...",
    "link": "https://qz.com/disney-plus-content-warnings-1851762459",
    "timestamp": "2025-02-13T15:59:51Z"
  },
  {
    "title": "Germany protests 'regrettable' Trump 'concessions' to Putin on Ukraine",
    "description": "Germany's defense minister criticized President Donald Trump for what he called \"regrettable\" concessions to Moscow, after the president unilaterally announced an immediate start to direct peace talks with President Vladimir Putin to end the Kremlin's war on …",
    "link": "https://freerepublic.com/focus/f-news/4297304/posts",
    "timestamp": "2025-02-13T15:58:30Z"
  },
  {
    "title": "The FCC is investigating Comcast’s DEI policies",
    "description": "Noting an executive order by President Trump, FCC Chairman Brendan Carr said in a letter to Comcast CEO Brian Roberts that the agency is probing both Comcast and NBCUniversal.",
    "link": "https://www.inquirer.com/business/comcast/comcast-nbc-universal-federal-dei-investigation-20250213.html",
    "timestamp": "2025-02-13T15:58:22Z"
  },
  {
    "title": "US govt paid Reuters for ‘social deception’ – Musk",
    "description": "Elon Musk has accused Reuters of allegedly receiving government funds for social engineering projects Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612663-musk-reuters-funds-doge/",
    "timestamp": "2025-02-13T15:56:50Z"
  },
  {
    "title": "Donald Trump's Gen Z Popularity Plunges",
    "description": "A poll shows the president's net favorable rating among those aged 18-29 has fallen dramatically in the past three months.",
    "link": "https://www.newsweek.com/donald-trump-gen-z-popularity-favorable-rating-yougov-2030595",
    "timestamp": "2025-02-13T15:56:31Z"
  },
  {
    "title": "Will Corporate Purpose Go The Way Of DEI?",
    "description": "Corporate purpose speaks to the very reason a company exists, and can be a unifying force that aligns employees' values and company goals.",
    "link": "https://www.forbes.com/sites/iese/2025/02/13/will-corporate-purpose-go-the-way-of-dei/",
    "timestamp": "2025-02-13T15:55:40Z"
  },
  {
    "title": "Trump's pick for education chief says Congress needed to shut down department",
    "description": "WASHINGTON (AP) — Linda McMahon told senators she believes it would take an act of Congress to abolish the Education Department, saying the Trump administration wants to “do this right” and craft a plan that senators will support.",
    "link": "https://ca.news.yahoo.com/trumps-pick-education-chief-seeks-150856742.html",
    "timestamp": "2025-02-13T15:55:22Z"
  },
  {
    "title": "Is Elon Musk a US Citizen? Here's What Country the Billionaire Is From",
    "description": "Now that Elon Musk has assumed great power within the United States government, many are asking about his citizenship and where he was born.",
    "link": "https://www.newsweek.com/elon-musk-us-american-citizenship-country-birth-2030603",
    "timestamp": "2025-02-13T15:53:20Z"
  },
  {
    "title": "Nestlé CEO Backs Packaged Food as Kennedy's Health Policies Loom",
    "description": "Nestlé CEO Laurent Freixe defended packaged food, emphasizing its role in providing safe nutrition and reducing waste amid growing scrutiny. His comments came as the U.S. Senate moved closer to confirming Robert F. Kennedy Jr. as the next Secretary of Health …",
    "link": "https://freerepublic.com/focus/f-chat/4297303/posts",
    "timestamp": "2025-02-13T15:52:34Z"
  }
]