[
  {
    "title": "BREAKING: ZELENSKY calls US security guarantees involvement a 'historic decision'",
    "description": "Donald Trump's special envoy says Vladimir Putin has agreed to \"robust\" security guarantees for Ukraine - including a potential Nato-style defence arrangement Speaking to CNN, Steve Witkoff describes the proposal as \"game changing\" Ukraine's Volodymyr Zelensk…",
    "link": "https://freerepublic.com/focus/f-news/4335101/posts",
    "timestamp": "2025-08-17T17:47:39Z"
  },
  {
    "title": "‘Weapons’ Dominates Box Office For Second Weekend—Here’s How It Stacks Up Against Other Horror Hits",
    "description": "The horror film is a hit for director Zach Cregger.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/08/17/weapons-dominates-box-office-for-second-weekend-heres-how-it-stacks-up-against-other-horror-hits/",
    "timestamp": "2025-08-17T17:47:07Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Aug. 17, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Secretary of State Marco Rubio and Sen. Dan Sullivan join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-08-17-2025/",
    "timestamp": "2025-08-17T17:46:43Z"
  },
  {
    "title": "Margaret Brennan Confronts Marco Rubio On Concerns Zelensky Will Be ‘Bullied’ Into Deal While Secretary Decries ‘Stupid Media Narrative!’",
    "description": "Marco Rubio torched what he called a \"stupid media narrative\" as he was confronted him on \"concerns\" that Zelensky will be \"bullied\" into a Russia deal.\nThe post Margaret Brennan Confronts Marco Rubio On Concerns Zelensky Will Be ‘Bullied’ Into Deal While Sec…",
    "link": "https://www.mediaite.com/media/tv/margaret-brennan-confronts-marco-rubio-on-concerns-zelensky-will-be-bullied-into-deal-while-secretary-decries-stupid-media-narrative/",
    "timestamp": "2025-08-17T17:45:15Z"
  },
  {
    "title": "Rising Food Prices Are Likely to Continue, Thanks to Trump’s Trade Wars",
    "description": "Wholesale prices on fresh and dry vegetables rose nearly 40 percent, and soon consumers will feel the pinch",
    "link": "http://www.rollingstone.com/politics/politics-news/rising-food-prices-trump-trade-wars-1235410245/",
    "timestamp": "2025-08-17T17:42:55Z"
  },
  {
    "title": "Rubio shoots down report that Trump backs Putin’s plan for Russia to control Ukraine’s Donbas region",
    "description": "Marco Rubio clarifies that Ukrainian President Zelenskyy will decide on territorial issues in peace talks, not Trump, following reports concerning Donbas control.",
    "link": "https://www.foxnews.com/media/rubio-shoots-down-report-trump-backs-putins-plan-russian-control-ukraines-donbas-region",
    "timestamp": "2025-08-17T17:42:25Z"
  },
  {
    "title": "Melania Trump’s Weird, Vague Letter to Putin",
    "description": "First Lady Melania Trump tends to be seen more often than she is heard. But when she does speak, it’s often hard to forget. Take, for example, her infamous profanity-laden tirade against having to decorate the White House for Christmas, per tradition, and cri…",
    "link": "https://www.motherjones.com/politics/2025/08/melania-trump-putin-ukraine-children-letter/",
    "timestamp": "2025-08-17T17:40:28Z"
  },
  {
    "title": "Trump Administration Halts Visas For People From Gaza After Laura Loomer Questions Arrivals",
    "description": "Conservative activist Laura Loomer complained on social media about children from Gaza arriving in the U.S. for medical treatment and questioned how they got visas.",
    "link": "https://www.huffpost.com/entry/ap-us-mideast-wars-gaza-visas-halted_n_68a21368e4b0858c7642b876",
    "timestamp": "2025-08-17T17:40:19Z"
  },
  {
    "title": "Justice Didn’t Put Tina Peters in Prison, Villains in the Deep State Did",
    "description": "Justice Didn’t Put Tina Peters in Prison, Criminals in the Deep State Did Guest post by Martel Maxim There’s nothing more disgusting than a ‘Dirty Cop’ operating under the ‘Color of Law’, and the Deep State employs many of them.  The same goes for anyone elec…",
    "link": "https://joehoft.com/justice-didnt-put-tina-peters-in-prison-criminals-in-the-deep-state-did/",
    "timestamp": "2025-08-17T17:40:09Z"
  },
  {
    "title": "Larry Fink and André Hoffmann are named new chairmen of WEF: Who is Hoffmann?",
    "description": "In April, at an extraordinary meeting of the World Economic Forum (“WEF”) board, Klaus Schwab announced he was stepping down with immediate effect and bogeyman Peter Brabeck-Letmathe was appointed the interim Chairman. On 15 August, with the completion of the…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335096/posts",
    "timestamp": "2025-08-17T17:33:47Z"
  },
  {
    "title": "'Trump is terrified': Senator says president is scared he 'poked the bear' in power grab",
    "description": "Donald Trump just \"poked the bear,\" and now he's \"terrified,\" according to a longtime thorn in the president's side.Adam Schiff, one of California's two senators, the lead prosecutor in Trump's first impeachment trial, and a January 6th Committee member, call…",
    "link": "https://www.rawstory.com/trump-schiff-terrified-power-grab/",
    "timestamp": "2025-08-17T17:33:13Z"
  },
  {
    "title": "Trump administration halts visas for people from Gaza after Laura Loomer questions arrivals",
    "description": "A day after conservative activist Laura Loomer posted videos on social media of children from Gaza arriving in the U.S. for medical treatment and questioning how they got visas, the State Department said it was halting all visitor visas for people from Gaza p…",
    "link": "https://www.denverpost.com/2025/08/17/trump-administration-halts-visas-for-people-from-gaza-after-laura-loomer-questions-arrivals/",
    "timestamp": "2025-08-17T17:32:33Z"
  },
  {
    "title": "Surprise, Your IVF Baby Isn’t Even Related To You: Lawsuits Highlight Often ‘Unreported’ Fertility Errors",
    "description": "In vitro fertilization (IVF) related-lawsuits over errors are stacking up, even as the Trump administration's policy on the issue remains unsettled.",
    "link": "https://dailycaller.com/2025/08/17/ivf-lawsuits-unreported-fertility-errors/",
    "timestamp": "2025-08-17T17:28:22Z"
  },
  {
    "title": "Dem Rep. Crow: Trump-Putin Meeting Was 'Historic Embarrassment' for U.S.",
    "description": "Sunday on CBS's \"Face the Nation,\" Rep. Jason Crow (D-CO) said President Donald Trump's Alaskan summit with Russia President Vladimir Putin was a \"historic embarrassment for the United States.\"\nThe post Dem Rep. Crow: Trump-Putin Meeting Was ‘Historic Embarra…",
    "link": "https://www.breitbart.com/clips/2025/08/17/dem-rep-crow-trump-putin-meeting-was-historic-embarrassment-for-u-s/",
    "timestamp": "2025-08-17T17:28:07Z"
  },
  {
    "title": "What’s the Defense for Antoni’s Nomination",
    "description": "From Daily Signal: President Donald Trump was right to fire BLS Commissioner Erika McEntarfer, a Biden appointee, for these mistakes, even if they were the result of systemic flaws, not partisanship. Antoni, whom Trump nominated as her replacement on Monday, …",
    "link": "https://econbrowser.com/archives/2025/08/whats-the-defense-for-antonis-nomination",
    "timestamp": "2025-08-17T17:27:16Z"
  },
  {
    "title": "We still aren’t sure what’s going on with tariffs and inflation — or what will happen next",
    "description": "\"Despite this firmness, the tariff pass-through effect on consumer prices arguably has been less bad than expected so far.\"",
    "link": "https://fortune.com/2025/08/17/tariffs-inflation-pass-through-consumers-businesses-cpi-fed-rate-cuts/",
    "timestamp": "2025-08-17T17:26:55Z"
  },
  {
    "title": "European, NATO leaders to present united front with Zelensky in Trump meeting (Washington Post)",
    "description": "Washington Post:\nEuropean, NATO leaders to present united front with Zelensky in Trump meeting  —  The meeting follows President Donald Trump's summit with Russia's Vladimir Putin in Alaska, after which Trump told allies that Putin wanted Ukraine's Donbas.  —…",
    "link": "https://www.memeorandum.com/250817/p34",
    "timestamp": "2025-08-17T17:25:00Z"
  },
  {
    "title": "Anxiety Builds at CBS News Over Potential Moves by Skydance",
    "description": "The journalists at CBS News are eager to report out details of what might happen to their own workplace. Staffers at the unit, now part of Paramount Skydance, are worried about the potential for a new round of layoffs, according to three people familiar with …",
    "link": "https://variety.com/2025/tv/news/cbs-news-anxiety-skydance-layoffs-evening-news-1236491480/",
    "timestamp": "2025-08-17T17:25:00Z"
  },
  {
    "title": "Trump Circles Drop F-Bomb After 'Failure' Putin Summit: Wolff (Josh Fiallo/The Daily Beast)",
    "description": "Josh Fiallo / The Daily Beast:\nTrump Circles Drop F-Bomb After ‘Failure’ Putin Summit: Wolff  —  HELSINKI 2.0  —  MAGA is spinning the summit as a success.  —  President Donald Trump has tried to put a positive spin on his “failure” of a summit with Russian P…",
    "link": "https://www.memeorandum.com/250817/p35",
    "timestamp": "2025-08-17T17:25:00Z"
  },
  {
    "title": "Former Vice President Mike Pence defends Trump's crime crackdown in DC",
    "description": "Former Vice President Pence backed Trump's federal action in Washington, D.C., citing high homicide rates, while Democrats counter claims of violent crime rise.",
    "link": "https://www.foxnews.com/media/former-vice-president-mike-pence-defends-trumps-crime-crackdown-dc",
    "timestamp": "2025-08-17T17:24:37Z"
  },
  {
    "title": "Arnold Schwarzenegger Is Ready To Take On Gavin Newsom",
    "description": "'Terminator' star Arnold Schwarzenegger is ready to battle gubernatorial successor Gavin Newsom over California's redistricting plans.",
    "link": "https://www.vanityfair.com/hollywood/story/gavin-newsom-arnold-schwarzenegger-california-gerrymandering",
    "timestamp": "2025-08-17T17:23:36Z"
  },
  {
    "title": "WATCH: Marco Rubio vaporizes network’s ‘stupid media narrative’ about Trump planning to ‘bully’ Zelensky",
    "description": "'We've been working with these people for weeks, for weeks on this stuff'",
    "link": "https://www.wnd.com/2025/08/watch-marco-rubio-vaporizes-networks-stupid-media-narrative/",
    "timestamp": "2025-08-17T17:23:26Z"
  },
  {
    "title": "Russia made concessions on ‘land swaps’ with Ukraine – Witkoff",
    "description": "US President Donald Trump’s special envoy has claimed that Moscow made a “significant” shift in its demands during the Alaska summit Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623126-witkoff-russia-concessions-territory-ukraine-alaska-summit/",
    "timestamp": "2025-08-17T17:22:22Z"
  },
  {
    "title": "Black mayors of cities Trump decries as ‘lawless’ tout significant declines in violent crimes",
    "description": "As President Donald Trump declared Washington, D.C., a crime-ridden wasteland in need of federal intervention this week and threatened similar federal interventions in other Black-led cities, several mayors compared notes.The president’s characterization of t…",
    "link": "https://freerepublic.com/focus/f-news/4335094/posts",
    "timestamp": "2025-08-17T17:18:48Z"
  },
  {
    "title": "Melania Trump Penned a Letter to Vladimir Putin: Here's What It Said",
    "description": "First Lady Melania Trump told Vladimir Putin that for the children whose lives are under a cloud, \"It is time.\"",
    "link": "https://www.westernjournal.com/melania-trump-penned-letter-vladimir-putin-said/",
    "timestamp": "2025-08-17T17:17:26Z"
  },
  {
    "title": "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says",
    "description": "Russia's Vladimir Putin agreed at his summit with President Donald Trump to allow the United States and its European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part of an eventual deal to end the 3 1/2-year wa…",
    "link": "https://freerepublic.com/focus/f-news/4335093/posts",
    "timestamp": "2025-08-17T17:16:18Z"
  },
  {
    "title": "DAVID MARCUS: There are no more innocent explanations for Democrats’ Russiagate lies",
    "description": "Russiagate emails reveal James Clapper told Mike Rogers agencies must be supportive of Trump-Russia report despite NSA reservations about the intelligence",
    "link": "https://www.foxnews.com/opinion/david-marcus-no-more-innocent-explanations-democrats-russiagate-lies",
    "timestamp": "2025-08-17T17:12:57Z"
  },
  {
    "title": "Zelensky Ally Says He Hopes JD Vance Not at Trump Meeting",
    "description": "Trump will meet the Ukrainian leader, along with several European heads of state and the NATO Secretary-General, on Monday.",
    "link": "https://www.newsweek.com/volodymyr-zelensky-donald-trump-vladimir-putin-white-house-meeting-ukraine-russia-2114668",
    "timestamp": "2025-08-17T17:12:46Z"
  },
  {
    "title": "European leaders to join Zelenskiy in Washington as Trump presses Ukraine deal",
    "description": "Summary Zelenskiy flies to Washington on Monday to meet Trump Merz, Macron, Starmer, Meloni, von der Leyen to accompany him Rubio sees progress but says both sides need to make concessions Putin wants swathe of Ukraine land in peace deal, sources say Putin wa…",
    "link": "https://freerepublic.com/focus/f-news/4335092/posts",
    "timestamp": "2025-08-17T17:11:55Z"
  },
  {
    "title": "Mother of Slain D.C. Intern: Trump Taking His Death More Seriously Than Local Officials",
    "description": "The mother of a congressional intern who became a victim of crime in Washington, DC, when he was fatally shot is pushing back against the D.C. Council, saying President Donald Trump's administration is taking her loss more seriously than those officials.\nThe …",
    "link": "https://www.breitbart.com/crime/2025/08/17/mother-of-slain-d-c-intern-trump-taking-his-death-more-seriously-than-local-officials/",
    "timestamp": "2025-08-17T17:09:51Z"
  },
  {
    "title": "Zelenskyy And EU Leaders To Meet With Trump After Dismal Alaska Summit",
    "description": "President Zelenskyy faces the fallout from the Alaska summit. He needs to remind Trump of the vision of a ceasefire and to halt the violence. EU Leaders will join him.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/08/17/zelenskyy-and-eu-leaders-to-meet-with-trump-after-dismal-alaska-summit/",
    "timestamp": "2025-08-17T17:09:44Z"
  },
  {
    "title": "La locura de Trump en Alaska",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/trump-foreign-policy-fantasy-ended-at-alaska-summit-by-timothy-snyder-2025-08/spanish",
    "timestamp": "2025-08-17T17:06:53Z"
  },
  {
    "title": "Trump’s Alaska Folly",
    "description": "US President Donald Trump believes that foreign leaders can be dealt with like Americans, with fantastic promises and obnoxious bullying. But the empty offer of a “beautiful” future does not move dictators like Vladimir Putin, who has in mind his own specific…",
    "link": "https://www.project-syndicate.org/commentary/trump-foreign-policy-fantasy-ended-at-alaska-summit-by-timothy-snyder-2025-08",
    "timestamp": "2025-08-17T17:06:53Z"
  },
  {
    "title": "Schumer Confronts Trump For ‘Selling Out Ukraine’ In Fiery Post",
    "description": "Schumer said that Trump's failure to reach an agreement to end the war in Ukraine won't earn him the Nobel Peace Prize he's been vying for.",
    "link": "https://www.huffpost.com/entry/chuck-schumer-donald-trump-nobel-peace-prize-alaska-summit-putin_n_68a1f22ee4b07702299b5881",
    "timestamp": "2025-08-17T17:06:22Z"
  },
  {
    "title": "Putin agreed to let U.S., Europe offer Ukraine NATO-like security protections, Trump envoy says",
    "description": "Russia's Vladimir Putin agreed at his summit with President Donald Trump to allow the United States and its European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part of an eventual deal to end the 3 1/2-year wa…",
    "link": "https://biztoc.com/x/7090df9031d759fc",
    "timestamp": "2025-08-17T17:06:20Z"
  },
  {
    "title": "‘The Hammer Needs To Come’: Mike Pence Advises Trump To Stop ‘Velvet Glove’ Treatment of Putin",
    "description": "Mike Pence urged President Donald Trump to stop pussyfooting around Russian President Vladimir Putin if he wants to help stop the killing in Ukraine.\nThe post ‘The Hammer Needs To Come’: Mike Pence Advises Trump To Stop ‘Velvet Glove’ Treatment of Putin first…",
    "link": "https://www.mediaite.com/media/news/the-hammer-needs-to-come-mike-pence-advises-trump-to-stop-velvet-glove-treatment-of-putin/",
    "timestamp": "2025-08-17T17:04:07Z"
  },
  {
    "title": "Homeland Security Department slams New York Gov. Hochul for pardon of 'illegal alien killer'",
    "description": "Hochul pardoned an illegal migrant who was convicted of manslaughter as a teenager, according to a report from The New York Times. The Homeland Security Department criticized New York Democrat Gov. Kathy Hochul for pardoning an illegal migrant to keep him fro…",
    "link": "https://freerepublic.com/focus/f-news/4335090/posts",
    "timestamp": "2025-08-17T17:01:48Z"
  },
  {
    "title": "Ukraine has right to make decisions on its territory, says Taoiseach after Trump comments",
    "description": "Micheál Martin repeats call for ceasefire after Trump backs ‘peace deal’ that concerns European leaders",
    "link": "https://www.irishtimes.com/ireland/2025/08/17/ukraine-has-right-to-make-decisions-on-its-territory-says-taoiseach-after-trump-comments/",
    "timestamp": "2025-08-17T17:01:39Z"
  },
  {
    "title": "Marco Rubio Vaporizes Margaret Brennan’s ‘Stupid Media Narrative’ About Trump Planning To ‘Bully’ Zelenskyy",
    "description": "Secretary of State Marco Rubio eviscerated CBS News host Margaret Brennan's assertion that President Donald Trump may bully Volodymyr Zelenskyy.",
    "link": "https://dailycaller.com/2025/08/17/marco-rubio-cbs-news-margaret-brennan-trump-zelenskyy/",
    "timestamp": "2025-08-17T17:01:18Z"
  },
  {
    "title": "Trump Declares Hamas Must Go: A New Chapter in the Gaza Conflict",
    "description": "President Donald Trump has taken a firm stance against Hamas, declaring that the militant group cannot continue to control Gaza. This shift underscores a strategic pivot in U.S. policy, prioritizing the removal of Hamas as a key objective in the Middle East.",
    "link": "https://www.shtfplan.com/headline-news/trump-declares-hamas-must-go-a-new-chapter-in-the-gaza-conflict",
    "timestamp": "2025-08-17T17:00:59Z"
  },
  {
    "title": "A ‘Ten’ Out of Ten: The Trump-Russia Summit in Pictures",
    "description": "President Donald Trump rated his conversation with Russian President Vladimir Putin a “ten” out of ten after the two met in Alaska on Friday for... Read More\nThe post A ‘Ten’ Out of Ten: The Trump-Russia Summit in Pictures appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/17/a-ten-out-of-ten-the-trump-russia-summit-in-pictures/",
    "timestamp": "2025-08-17T17:00:00Z"
  },
  {
    "title": "Is the Super Bowl heading to London? British ambassador to US reveals 'big pitch' for NFL showpiece",
    "description": "A Super Bowl not being played on American soil has never felt more likely with the NFL's international expansion of regular season games, with London making a strong case through British ambassador to the United States Peter Mandelson. London's Wembley Stadiu…",
    "link": "https://freerepublic.com/focus/f-chat/4335089/posts",
    "timestamp": "2025-08-17T16:58:46Z"
  },
  {
    "title": "Putin agreed to let U.S., Europe offer Ukraine NATO-like security protections, Trump envoy says",
    "description": "Russia's Vladimir Putin agreed at his summit with President Donald Trump to allow the United States and its European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part of an eventual deal to end the 3 1/2-year wa…",
    "link": "https://www.pbs.org/newshour/world/putin-agreed-to-let-u-s-europe-offer-ukraine-nato-like-security-protections-trump-envoy-says",
    "timestamp": "2025-08-17T16:56:56Z"
  },
  {
    "title": "Zelensky Returning to White House With Backup After Trump Clash",
    "description": "Zelensky visited the White House in February, the trip becoming a public dressing-down of the Ukrainian leader by the Trump administration.",
    "link": "https://www.newsweek.com/volodymyr-zelensky-white-house-meeting-donald-trump-2114648",
    "timestamp": "2025-08-17T16:55:36Z"
  },
  {
    "title": "Trump biographer says White House insider texted blunt, profane message after Putin summit",
    "description": "President Donald Trump has sought to present his recent summit with Russian President Vladimir Putin as a constructive encounter, but several inside accounts and media analyses suggest otherwise.Analysts highlighted how Putin managed to shift U.S. policy rhet…",
    "link": "https://www.rawstory.com/trump-biographer-blunt-prophane-message/",
    "timestamp": "2025-08-17T16:53:23Z"
  },
  {
    "title": "Rubio Desperately Tries to Spin Trump’s Putin Flop",
    "description": "The president said he'd be \"unhappy\" if he walked away from his meeting with the Russian leader without a ceasefire agreement, which is exactly what happened",
    "link": "http://www.rollingstone.com/politics/politics-news/rubio-spin-trump-putin-ukraine-1235410244/",
    "timestamp": "2025-08-17T16:52:34Z"
  },
  {
    "title": "Oakland Mayor Lee: Trump Is Attempting to 'Dismantle Our Democracy'",
    "description": "Sunday on MSNBC's \"The Weekend,\" Oakland Mayor Barbara Lee said President Donald Trump is attempting to \"dismantle our democracy\" with his federal takeover of Washington, D.C.\nThe post Oakland Mayor Lee: Trump Is Attempting to ‘Dismantle Our Democracy’ appear…",
    "link": "https://www.breitbart.com/clips/2025/08/17/oakland-mayor-lee-trump-is-attempting-to-dismantle-our-democracy/",
    "timestamp": "2025-08-17T16:52:24Z"
  },
  {
    "title": "The “Layer 1” Fight Is Not About Stablecoins But The Future Of Finance",
    "description": "Can the \"Layer 1\" of DeFi really be provided Circle or Stripe? Or will it ultimately need Big Tech or governments or someone else to deliver the platform for innovation?",
    "link": "https://www.forbes.com/sites/davidbirch/2025/08/17/the-layer-1-fight-is-not-about-stablecoins-but-the-future-of-finance/",
    "timestamp": "2025-08-17T16:46:41Z"
  },
  {
    "title": "Trump says the world respects us. Empty seats in Vegas prove otherwise",
    "description": "President Donald Trump is so disastrously incompetent he once managed to bankrupt a casino in Atlantic City. Now, from the Oval Office, he’s trying to do it again—in Las Vegas.\nIn June 2025, Las Vegas welcomed 400,000 fewer visitors than in June 2024—a more t…",
    "link": "https://biztoc.com/x/ed55f1b70c883ed4",
    "timestamp": "2025-08-17T16:44:11Z"
  },
  {
    "title": "New York Times Columnist David Brooks Compares Trump-Backed Redistricting Efforts to Using ‘Mustard Gas’ on Democracy",
    "description": "New York Times columnist David Brooks compared redistricting efforts backed by President Donald Trump to using chemical weapons on civilians.\nThe post New York Times Columnist David Brooks Compares Trump-Backed Redistricting Efforts to Using ‘Mustard Gas’ on …",
    "link": "https://www.mediaite.com/media/tv/new-york-times-columnist-david-brooks-compares-trump-backed-redistricting-efforts-to-using-mustard-gas-on-democracy/",
    "timestamp": "2025-08-17T16:41:41Z"
  },
  {
    "title": "Dana White sets 'billion to one' odds for Jon Jones to headline UFC's White House card",
    "description": "Jones has expressed interest in joining the potential event",
    "link": "https://www.cbssports.com/mma/news/dana-white-sets-billion-to-one-odds-for-jon-jones-to-headline-ufcs-white-house-card/",
    "timestamp": "2025-08-17T16:39:09Z"
  },
  {
    "title": "European leaders will join Trump-Zelenskyy meeting, signaling solidarity with Ukraine",
    "description": "European leaders including France's Macron, UK's Starmer and EU's von der Leyen join Zelenskyy for crucial Washington meeting with Trump amid Russia's ongoing war.",
    "link": "https://www.foxnews.com/politics/european-leaders-join-trump-zelensky-meeting-signaling-solidarity-ukraine",
    "timestamp": "2025-08-17T16:34:31Z"
  },
  {
    "title": "Zelensky Declares ‘Impossible’ for Ukraine to Give Up Territory to Russia, Doubles Down on Ceasefire Demand",
    "description": "Ukrainian President Zelensky said on Sunday that it would be “impossible” for Kyiv to cede territory to Russia and reiterated his call for an immediate ceasefire.Speaking from the European Commission headquarters in Brussels ahead of his planned sit-down with…",
    "link": "https://freerepublic.com/focus/f-news/4335086/posts",
    "timestamp": "2025-08-17T16:34:18Z"
  },
  {
    "title": "Pence says Trump needs to bring the 'hammer' down on Putin with immediate new sanctions",
    "description": "Mike Pence calls for Donald Trump to demand secondary sanctions on Russia after Alaska summit shifts focus from Ukraine ceasefire to broader peace deal.",
    "link": "https://www.foxnews.com/politics/pence-says-trump-should-bring-hammer-down-putin-immediate-new-sanctions",
    "timestamp": "2025-08-17T16:33:50Z"
  },
  {
    "title": "Gavin Newsom's Team Unveils New Nickname for JD Vance",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAfter pivoting into a Donald Trump-style of social media posting to mock the U.S. president, California Governor Gavin Newsom's team has now introduced a new nickname for Vice President J.D. Vance, \"Just Dance…",
    "link": "https://biztoc.com/x/6b0c334ffe039a2a",
    "timestamp": "2025-08-17T16:33:21Z"
  },
  {
    "title": "What’s going on with Putin’s jelly legs? Vlad’s mad twitching feet at Trump talks spark speculation he was wearing LIFTS",
    "description": "VLADIMIR Putin's uncontrollable shaky legs as he bid farewell to Donald Trump at the Alaskan summit have sparked wild speculation he was wearing Lifts. Many claim the Russian leader opted for the height-boosting shoes to minimise his height difference with th…",
    "link": "https://freerepublic.com/focus/f-chat/4335084/posts",
    "timestamp": "2025-08-17T16:30:27Z"
  },
  {
    "title": "Gavin Newsom's Team Unveils New Nickname for JD Vance",
    "description": "\"NOT EVEN JD 'JUST DANCE' VANCE CAN SAVE TRUMP FROM THE DISASTROUS MAPS 'WAR' HE HAS STARTED,\" Newsom's office wrote on social media.",
    "link": "https://www.newsweek.com/gavin-newsom-team-unveils-new-nickname-jd-vance-2114644",
    "timestamp": "2025-08-17T16:30:25Z"
  },
  {
    "title": "Trade Partners Grow Restless Waiting for Trump’s Tariff Breaks",
    "description": "UK Prime Minister Keir Starmer declared at a Jaguar Land Rover factory in May that his world-leading trade deal with President Donald Trump included a cut in US tariffs on British steel to zero.",
    "link": "https://financialpost.com/pmn/business-pmn/trade-partners-grow-restless-waiting-for-trumps-tariff-breaks",
    "timestamp": "2025-08-17T16:20:56Z"
  },
  {
    "title": "Melania Trump's Message to Putin Sparks AI Claims",
    "description": "The first lady did not attend the summit between President Donald Trump and Russian leader Vladimir Putin in Alaska on Friday.",
    "link": "https://www.newsweek.com/melania-trump-vladimir-putin-letter-ukraine-russia-abducted-children-2114616",
    "timestamp": "2025-08-17T16:20:34Z"
  },
  {
    "title": "Vladimir Putin 'Got Everything He Wanted' at Trump Alaska Summit—Senator",
    "description": "President Donald Trump and the Russian leader met in Alaska on Friday to discuss how they could end the conflict in Ukraine.",
    "link": "https://www.newsweek.com/vladimir-putin-got-everything-donald-trump-alaska-summit-2114678",
    "timestamp": "2025-08-17T16:16:48Z"
  },
  {
    "title": "Marco Rubio Doesn’t Let ABC Host Off The Hook As She Attempts To Grill Trump For Putin ‘Red Carpet’",
    "description": "Secretary of State Marco Rubio on Sunday scoffed at ABC News host Martha Raddatz's attempt to grill President Donald Trump's greeting in Alaska.",
    "link": "https://dailycaller.com/2025/08/17/marco-rubio-martha-raddatz-trump-putin-red-carpet/",
    "timestamp": "2025-08-17T16:16:21Z"
  },
  {
    "title": "US, Russia Agreed On Ukraine Security Pledges, Witkoff Says",
    "description": "Donald Trump and Vladimir Putin agreed at their summit in Alaska last week that the US would be able to offer Ukraine security guarantees, according to Steve Witkoff, Trump’s special envoy, even as many details of Friday’s meeting remain unclear.",
    "link": "https://www.ndtvprofit.com/world/us-russia-agreed-on-ukraine-security-pledges-witkoff-says",
    "timestamp": "2025-08-17T16:14:31Z"
  },
  {
    "title": "'There's Nothing I Can Say!' Trump Melts Down Over Negative Reports On Putin Meeting",
    "description": "President Donald Trump expressed frustration over media coverage after he failed to strike a deal with Russian President Vladimir Putin to stop the war in Ukraine.\n\n\nIn a Sunday post on Truth Social, Trump attacked the media over reports that he could not get…",
    "link": "https://crooksandliars.com/2025/08/theres-nothing-i-can-say-trump-melts-down",
    "timestamp": "2025-08-17T16:14:07Z"
  },
  {
    "title": "Who’s REALLY ‘destroying democracy’ — after failing to win voters legitimately?",
    "description": "Does destroying democracy also entail weaponizing federal bureaucracies, turning them into rogue partisan arms of a president?",
    "link": "https://nypost.com/2025/08/17/opinion/whos-really-destroying-democracy-after-failing-to-win-voters-legitimately/",
    "timestamp": "2025-08-17T16:14:03Z"
  },
  {
    "title": "ICE Arrests Influencer Tatiana Martinez During Live Stream",
    "description": "DHS Assistant Secretary Tricia McLaughlin told Newsweek that Martinez was arrested because of a prior DUI conviction in Los Angeles.",
    "link": "https://www.newsweek.com/ice-arrest-influencer-tatiana-martinez-immigration-california-2114664",
    "timestamp": "2025-08-17T16:13:32Z"
  },
  {
    "title": "Who’s Zelensky’s Backup for His Meeting With Trump?",
    "description": "European leaders are travelling to the US on August 18 to accompany Zelensky during his meeting with US President Trump. Trump allowed Europeans to join without sending them an official invitation.",
    "link": "https://sputnikglobe.com/20250817/whos-zelenskys-backup-for-his-meeting-with-trump-1122638100.html",
    "timestamp": "2025-08-17T16:11:45Z"
  },
  {
    "title": "‘It will be up to Ukraine to make decisions on its territory’ – Taoiseach says after Trump’s meeting with Putin",
    "description": "International borders must not be changed by force, the Taoiseach has said, ahead of a meeting between the presidents of the United States and Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/it-will-be-up-to-ukraine-to-make-decisions-on-its-territory-taoiseach-says-after-trumps-meeting-with-putin/a1551943950.html",
    "timestamp": "2025-08-17T16:08:35Z"
  },
  {
    "title": "Ohio to send National Guard military police to DC",
    "description": "Ohio will send 150 military police from the Ohio National Guard to Washington, D.C., at the request of the Secretary of the Army.",
    "link": "https://www.wfmj.com/story/53009992/ohio-to-send-national-guard-military-police-to-dc",
    "timestamp": "2025-08-17T16:05:02Z"
  },
  {
    "title": "Trump envoy says Putin made 'robust' concessions during Alaska meeting talks on Ukraine",
    "description": "President Donald Trump shifted focus from a Ukraine ceasefire toward a more comprehensive peace deal following his Alaska meeting with Russian President Vladimir Putin, according to Special Envoy Witkoff.",
    "link": "https://www.foxnews.com/politics/trump-envoy-says-putin-made-robust-concessions-during-alaska-meeting-talks-ukraine",
    "timestamp": "2025-08-17T16:02:45Z"
  },
  {
    "title": "“South Park” and the high price of free speech",
    "description": "With our First Amendment rights under attack, those in the best position to defend them also happen to be rich",
    "link": "https://www.salon.com/2025/08/17/south-park-and-the-high-price-of-free-speech/",
    "timestamp": "2025-08-17T16:00:48Z"
  },
  {
    "title": "DOE Unveils Nearly $1 Billion Fund to Boost Domestic Critical Minerals Supply Chain and Manufacturing",
    "description": "Meanwhile, China has inspired other nations to make plans to reshore their rare earth mining and processing capacity.\nThe post DOE Unveils Nearly $1 Billion Fund to Boost Domestic Critical Minerals Supply Chain and Manufacturing first appeared on Le·gal In·su…",
    "link": "https://legalinsurrection.com/2025/08/doe-unveils-nearly-1-billion-fund-to-boost-domestic-critical-minerals-supply-chain-and-manufacturing/",
    "timestamp": "2025-08-17T16:00:47Z"
  },
  {
    "title": "Zelensky Declares 'Impossible' for Ukraine to Give Up Territory to Russia, Doubles Down on Ceasefire Demand",
    "description": "Ukrainian President Zelensky said on Sunday that it would be \"impossible\" for Kyiv to cede territory to Russia and reiterated his call for an immediate ceasefire.\nThe post Zelensky Declares ‘Impossible’ for Ukraine to Give Up Territory to Russia, Doubles Down…",
    "link": "https://www.breitbart.com/europe/2025/08/17/zelensky-declares-impossible-for-ukraine-to-give-up-territory-to-russia-doubles-down-on-ceasefire-demand/",
    "timestamp": "2025-08-17T16:00:36Z"
  },
  {
    "title": "Van Hollen: Trump’s Federal Takeover of D.C. 'Total Abuse of Power'",
    "description": "Sunday on ABC's \"This Week,\" Sen. Chris Van Hollen (D-MD) said President Donald Trump's federal crackdown on crime in Washington D.C. was \"a total abuse of power.\"\nThe post Van Hollen: Trump’s Federal Takeover of D.C. ‘Total Abuse of Power’ appeared first on …",
    "link": "https://www.breitbart.com/clips/2025/08/17/van-hollen-trumps-federal-takeover-of-d-c-total-abuse-of-power/",
    "timestamp": "2025-08-17T16:00:27Z"
  },
  {
    "title": "The rizz kid: How a campus Communist turned conservative kingmaker put the ‘social’ in ‘social movement’",
    "description": "Gen Z calls it “rizz.” Conservative theorist Frank Meyer radiated it. Rizz is what Donald Trump exudes and Kamala Harris lacks, and this je ne sais quoi quality, at least to all who came before Gen Z brilliantly put a name on it, explains not just one’s succe…",
    "link": "https://nypost.com/2025/08/17/opinion/the-rizz-kid-how-frank-meyer-a-campus-communist-turned-conservative-kingmaker-put-the-social-in-social-movement/",
    "timestamp": "2025-08-17T16:00:08Z"
  },
  {
    "title": "Trump Made Right Call in Picking EJ Antoni to Replace Biden-Appointed BLS Leader",
    "description": "DAILY CALLER NEWS FOUNDATION—Heritage Foundation chief economist EJ Antoni is the perfect choice to clean up the mess at the Bureau of Labor Statistics—the guardian... Read More\nThe post Trump Made Right Call in Picking EJ Antoni to Replace Biden-Appointed BL…",
    "link": "https://www.dailysignal.com/2025/08/17/alfredo-ortiz-trump-made-right-call-picking-ej-antoni-replace-biden-appointed-bls-leader/",
    "timestamp": "2025-08-17T16:00:00Z"
  },
  {
    "title": "Starmer to attend Trump and Zelensky's meeting",
    "description": "British Prime Minister Sir Keir Starmer will also attend the meeting between the presidents of the United States and Ukraine, Donald Trump and Volodymyr Zelensky, respectively, at the White House on M...",
    "link": "https://biztoc.com/x/d07c2574fabff874",
    "timestamp": "2025-08-17T15:59:24Z"
  },
  {
    "title": "European leaders will join Zelenskyy’s meeting with Trump at the White House",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump on ending Russia’s war in Ukraine, with the possibility of U.S. security guarantees now on the negotiating table.",
    "link": "https://biztoc.com/x/8bc991c0d568f10b",
    "timestamp": "2025-08-17T15:59:11Z"
  },
  {
    "title": "California high school girls volleyball team forfeits against opponent with trans athlete (guy pretending to be a woman)",
    "description": "A California high school girls’ volleyball team forfeited a match against a team that is believed to include a biological male trans athlete Friday night. Riverside Poly High School in Riverside County, California, announced its forfeit against Jurupa Valley …",
    "link": "https://freerepublic.com/focus/f-news/4335080/posts",
    "timestamp": "2025-08-17T15:58:29Z"
  },
  {
    "title": "School Assembly Headlines for August 18: Top national, international, sports and business updates",
    "description": "The NDA nominated CP Radhakrishnan as their vice-presidential candidate, while Rahul Gandhi launched a voter awareness campaign in Bihar. Internationally, European leaders are set to meet with Zelenskyy to discuss the Moscow invasion, and Pakistan aims to lev…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-headlines-for-august-18-top-national-international-sports-and-business-updates/articleshow/123347636.cms",
    "timestamp": "2025-08-17T15:57:44Z"
  },
  {
    "title": "Business English News 60 – Tariffs: Rewiring Global Trade",
    "description": "Learn business English vocabulary in this lesson on the effects of tariffs on global trade.\n>>>\nThe post Business English News 60 – Tariffs: Rewiring Global Trade first appeared on Business English Pod :: Learn Business English Online.",
    "link": "https://www.businessenglishpod.com/2025/08/17/business-english-news-60-tariffs-rewiring-global-trade/",
    "timestamp": "2025-08-17T15:55:28Z"
  },
  {
    "title": "Amid DC Takeover, Trump Eyes Crime In Other Cities - Here's What To Know",
    "description": "Amid DC Takeover, Trump Eyes Crime In Other Cities - Here's What To Know\n \nAuthored by Nathan Worcester via The Epoch Times (emphasis ours),\nWhile federalizing the local police and deploying the National Guard in Washington, D.C., President Donald Trump has s…",
    "link": "https://biztoc.com/x/a003d9e96009a4a2",
    "timestamp": "2025-08-17T15:48:31Z"
  },
  {
    "title": "ESPN shelves Colin Kaepernick docuseries over 'certain creative differences'",
    "description": "A documentary directed by Spike Lee on the life of former Colin Kaepernick was shelved over \"creative disagreements\" among the director, ESPN and the ex-quarterback.",
    "link": "https://www.foxnews.com/sports/espn-shelves-colin-kaepernick-docuseries-over-certain-creative-differences",
    "timestamp": "2025-08-17T15:47:55Z"
  },
  {
    "title": "Trump Writes Post About Moscow That's Absurd Even For Him",
    "description": "The president ranted about negative coverage of his peace talks with Putin.",
    "link": "https://www.huffpost.com/entry/donald-trump-if-i-got-russia-to-give-up-moscow-truth-social_n_68a1df07e4b07702299b5342",
    "timestamp": "2025-08-17T15:47:26Z"
  },
  {
    "title": "European leaders will join Zelenskyy’s meeting with Trump at the White House",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump on ending Russia’s war in Ukraine, with the possibility of U.S. security guarantees now on the negotiating table.",
    "link": "https://www.pbs.org/newshour/world/european-leaders-will-join-zelenskyys-meeting-with-trump-at-the-white-house",
    "timestamp": "2025-08-17T15:46:30Z"
  },
  {
    "title": "Nine teens arrested in connection with 'love triangle' murder of boy, 16",
    "description": "A 16-year-old boy was lured to his death following an argument 'over a girl,' in what authorities are calling a calculated and deadly plot. South Carolina teenager Trey Dean Wright was found shot to death on June 24. Nine teenagers, including the victim's gir…",
    "link": "https://freerepublic.com/focus/f-chat/4335079/posts",
    "timestamp": "2025-08-17T15:46:04Z"
  },
  {
    "title": "'It Might've Been A Spirit, But It Wasn't The Holy One,' Says Dave Ramsey As Couple Waits On God To Sell $60,000 In Crypto",
    "description": "Arabella from Springfield, Missouri, told \"The Ramsey Show\" in April that she faced $60,000 in cryptocurrency, $14,000 in student loans and $37,000 in auto...",
    "link": "https://finance.yahoo.com/news/mightve-spirit-wasnt-holy-one-154603440.html",
    "timestamp": "2025-08-17T15:46:03Z"
  },
  {
    "title": "Gal Gadot Says Hollywood Pressure to Denounce Israel Helped Tank Disney's Woke 'Show White'",
    "description": "Actress Gal Gadot says she thinks pressure in Hollywood to denounce Israel helped tank her latest Disney film, 'Show White.'\nThe post Gal Gadot Says Hollywood Pressure to Denounce Israel Helped Tank Disney’s Woke ‘Show White’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/17/gal-gadot-says-hollywood-pressure-to-denounce-israel-helped-tank-disneys-woke-show-white/",
    "timestamp": "2025-08-17T15:44:19Z"
  },
  {
    "title": "Melania Trump Sent ‘Peace Letter’ To Putin Ahead Of Alaska Summit",
    "description": "\"As leaders, the responsibility to sustain our children extends beyond the comfort of a few ...\"First Lady Melania Trump sent what is being called a “peace letter” to Russian President Vladimir Putin ahead of his meeting in Alaska with President Donald Trump,…",
    "link": "https://freerepublic.com/focus/f-chat/4335078/posts",
    "timestamp": "2025-08-17T15:43:43Z"
  },
  {
    "title": "Trump to meet Zelensky one-on-one, without European leaders - Bild",
    "description": "US President Donald Trump has refused a joint meeting with European leaders and will receive Ukrainian President Volodymyr Zelensky alone. This was reported by Bild, according to UNN. Details As stated in the publication, only after the one-on-one talks betwe…",
    "link": "https://freerepublic.com/focus/f-chat/4335076/posts",
    "timestamp": "2025-08-17T15:41:41Z"
  },
  {
    "title": "‘Breaking the Law’ Exclusive: President Trump Warns Rampant Judge-Shopping Is the Left’s ‘Final Weapon’ That Could ‘Take Down America’",
    "description": "In an exclusive interview for \"Breaking the Law,\" President Donald Trump warned that the practice of “judge-shopping,” whereby political operatives seek out activist judges who they know will render a favorable ruling, is the radical left’s “final weapon to t…",
    "link": "https://www.breitbart.com/politics/2025/08/17/breaking-the-law-exclusive-president-trump-warns-rampant-judge-shopping-is-the-lefts-final-weapon-that-could-take-down-america/",
    "timestamp": "2025-08-17T15:41:21Z"
  },
  {
    "title": "\"When they go low, we're going to bury them below the Capitol. That's what we're going to do, because this is about protecting democracy,\" Swalwell tells me on California's redistricting efforts.",
    "description": "\"When they go low, we're going to bury them below the Capitol. That's what we're going to do, because this is about protecting democracy,\" Swalwell tells me on California's redistricting efforts.",
    "link": "https://freerepublic.com/focus/f-bloggers/4335075/posts",
    "timestamp": "2025-08-17T15:38:41Z"
  },
  {
    "title": "MSNBC dismisses fears about DC safety, says 'it ain't Mayberry,' amid Trump crackdown",
    "description": "MSNBC host Jonathan Capehart criticized overheard conversations about D.C. safety as Trump sent federal troops to patrol streets, resulting in over 240 arrests this week.",
    "link": "https://www.foxnews.com/media/msnbc-dismisses-fears-about-dc-safety-says-it-aint-mayberry-amid-trump-crackdown",
    "timestamp": "2025-08-17T15:38:04Z"
  },
  {
    "title": "Gal Gadot clarifies why she blamed anti-Israel sentiments in Hollywood for ‘Snow White’ flop: ‘Very personal’",
    "description": "“They saw me, first and foremost, as an Israeli, not as an actress. That’s the perspective I spoke from when I answered the question,\" she wrote.",
    "link": "https://pagesix.com/2025/08/17/celebrity-news/gal-gadot-clarifies-why-she-blamed-anti-israel-sentiments-in-hollywood-for-snow-white-flop/",
    "timestamp": "2025-08-17T15:37:34Z"
  },
  {
    "title": "'Yelp For Toilets': Newsom Press Office Hilariously Smacks Down Tomi Lahren",
    "description": "Donald Trump is the biggest troll on Xitter, but Democratic Gov. Gavin Newsom has been calling out the \"failed president\" at every turn. Newsom's press office has expanded its targets to others, including White House press secretary 'KaroLYIN Leavitt,' and no…",
    "link": "https://crooksandliars.com/2025/08/yelp-toilets-newsom-press-office",
    "timestamp": "2025-08-17T15:36:26Z"
  },
  {
    "title": "'Trump Got Played': MAGA Sees Through Failed Putin Meeting, CNN Host Reports",
    "description": "CNN host Jake Tapper noted that even supporters of President Donald Trump believed that he \"got played\" by Russian President Vladimir Putin in last week's meeting on the war in Ukraine.\n\n\nDuring a Sunday interview with former Vice President Mike Pence, Tapper…",
    "link": "https://crooksandliars.com/2025/08/trump-got-played-maga-sees-through-failed",
    "timestamp": "2025-08-17T15:36:14Z"
  },
  {
    "title": "“Body language of beaten man”: Martina Navratilova calls out Donald Trump following failed peace talks with Vladimir Putin",
    "description": "Tennis legend Martina Navratilova called Donald Trump a 'beaten man'. This comment came after the U.S. President's meeting with Vladimir Putin in Alaska. The meeting failed to produce a peace deal for Ukraine. Trump left reporters without answers. European le…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/body-language-of-beaten-man-martina-navratilova-calls-out-donald-trump-following-failed-peace-talks-with-vladimir-putin/articleshow/123347645.cms",
    "timestamp": "2025-08-17T15:35:53Z"
  },
  {
    "title": "Transcript: Fiona Hill on \"Face the Nation\"",
    "description": "The following is the transcript of an interview with Fiona Hill that aired on \"Face the Nation with Margaret Brennan\" on Aug. 17, 2025.",
    "link": "https://www.cbsnews.com/news/fiona-hill-face-the-nation-transcript-8-17-2025/",
    "timestamp": "2025-08-17T15:35:22Z"
  },
  {
    "title": "Trump’s Ukraine gamble: Policy shift alarms Europe",
    "description": "President’s post-Alaska summit stance raises questions about American diplomatic priorities The political landscape shifted dramatically following President Donald Trump’s unexpected summit with Russian President Vladimir Putin in Alaska, as Trump abandoned h…",
    "link": "https://rollingout.com/2025/08/17/trumps-ukraine-gamble-policy-shift/",
    "timestamp": "2025-08-17T15:34:51Z"
  }
]