[
  {
    "title": "Gavin Newsom Surges as Democratic 2028 Front-Runner: Poll",
    "description": "The survey indicates the California governor's more aggressive stance is paying off.",
    "link": "https://www.newsweek.com/newsom-surges-poll-democratic-primary-frontrunner-2124888",
    "timestamp": "2025-09-05T03:33:02Z"
  },
  {
    "title": "These Trump voters back his immigration crackdown, but some worry about his methods",
    "description": "All 20 voters said they support Trump's work to expel immigration offenders with violent criminal records, but there was less consensus about how he is going about the crackdown.",
    "link": "https://www.japantimes.co.jp/news/2025/09/05/world/society/trump-voters-immigration-method-worry/",
    "timestamp": "2025-09-05T03:30:00Z"
  },
  {
    "title": "Sam Altman, Tim Cook, and other tech leaders lauded Trump at a White House AI dinner",
    "description": "Top tech executives from Google and OpenAI flocked to the White House for an AI education event and praised President Donald Trump over dinner.",
    "link": "https://www.businessinsider.com/whos-who-tech-leaders-attended-dinner-white-house-altman-pichai-2025-9",
    "timestamp": "2025-09-05T03:27:44Z"
  },
  {
    "title": "'So Maddening!': Seth Meyers Absolutely Roasts Trump Over This Big DC Claim",
    "description": "The \"Late Night\" host took on the president's restaurant boast in the Oval Office.",
    "link": "https://www.huffpost.com/entry/seth-meyers-trump-save-dc-restaurants-claim_n_68ba3c99e4b09c6f4cf6b7cd",
    "timestamp": "2025-09-05T03:25:04Z"
  },
  {
    "title": "Trump says he'd like to see two candidates drop out of crowded New York mayoral race",
    "description": "President Donald Trump suggested Thursday night that Democratic nominee Zohran Mamdani could win the New York City mayor’s race if the field of candidates isn’t narrowed.“I don’t think you can win unless you have one on one, because somehow he’s gotten a litt…",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-says-see-two-candidates-drop-crowded-new-york-mayoral-race-rcna229256",
    "timestamp": "2025-09-05T03:21:56Z"
  },
  {
    "title": "트럼프 관세와 저출생, 고령화, 저성장",
    "description": "Here Comes a Jobs Report Where the Stakes Are High https://t.co/jx0h2VdvDi— Bloomberg (@business) September 4, 2025 Hiring plans fell to the weakest level for any August on record and intended job cuts mounted amid broader economic uncertainty, according to o…",
    "link": "https://ryueyes11.tistory.com/511829",
    "timestamp": "2025-09-05T03:20:30Z"
  },
  {
    "title": "Trump to attend the US Open men's final Sunday, marking another trip to a major sporting event",
    "description": "President Donald Trump plans to attend the men's final of the U.S. Open on Sunday",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-attend-us-open-mens-final-sunday-marking-125278769",
    "timestamp": "2025-09-05T03:18:27Z"
  },
  {
    "title": "'Ready to support diplomatic efforts for early end to Ukraine conflict': India's Ambassador to the UN",
    "description": "Noting that India welcomes recent positive developments in this direction, Ambassador Harish said, \"We endorsed the Summit meeting in Alaska between US President Donald Trump and Russian President Vladimir Putin. We appreciate the progress made at the Alaska …",
    "link": "https://economictimes.indiatimes.com/news/india/ready-to-support-diplomatic-efforts-for-early-end-to-ukraine-conflict-indias-ambassador-to-the-un/articleshow/123710525.cms",
    "timestamp": "2025-09-05T03:18:21Z"
  },
  {
    "title": "Trump supports nuclear power as it is 'more American' than wind, solar, US official says",
    "description": "Agen said building out nuclear power is the third prong of the Trump administration's approach to winning the artificial intelligence race against China after extending the lifespans of aging coal plants that are retiring and increasing the efficiency of the …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-supports-nuclear-power-as-it-is-more-american-than-wind-solar-us-official-says/articleshow/123710516.cms",
    "timestamp": "2025-09-05T03:18:07Z"
  },
  {
    "title": "Trump administration agrees to restore health websites and data",
    "description": "Federal officials have agreed to restore health- and science-related webpages and data following a lawsuit settlement with doctors' groups and other organizations.",
    "link": "https://www.kwtx.com/2025/09/04/trump-administration-agrees-restore-health-websites-data/",
    "timestamp": "2025-09-05T03:17:31Z"
  },
  {
    "title": "'Highly provocative': Venezuelan military aircraft flew near US Navy vessel, DOD says",
    "description": "The Pentagon said two Venezuelan military aircraft flew near a U.S. Navy vessel on Thursday in international waters in a \"highly provocative move.\"\n\nIn a statement posted on the social media platform X on Thursday night, the Defense Department wrote the move …",
    "link": "https://abcnews.go.com/International/2-venezuelan-military-aircraft-flew-us-navy-vessel/story?id=125278868",
    "timestamp": "2025-09-05T03:16:09Z"
  },
  {
    "title": "Trump warns ‘fairly substantial’ chip tariffs are coming; signals Apple, others will be safe",
    "description": "Trump has reiterated a warning that he will soon impose \"fairly substantial\" tariffs on semiconductor imports, but spare firms like Apple investing in the U.S.",
    "link": "https://www.cnbc.com/2025/09/05/trump-warns-of-fairly-substantial-chip-tariffs-signals-apple-others-safe-ai-tim-cook-tech.html",
    "timestamp": "2025-09-05T03:16:02Z"
  },
  {
    "title": "Trump says Zohran Mamdani likely to be New York's next mayor unless two of his opponents quit the race",
    "description": "President Trump believes Democrat Zohran Mamdani could win New York City's mayoral race unless some opponents withdraw. Trump expressed a desire for a head-to-head contest, hinting at influencing candidates to drop out. While Adams denies quitting, there are …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-zohran-mamdani-likely-to-be-new-yorks-next-mayor-unless-two-of-his-opponents-quit-the-race/articleshow/123710471.cms",
    "timestamp": "2025-09-05T03:14:41Z"
  },
  {
    "title": "US: Trump to relabel Pentagon as 'Department of War'",
    "description": "US President Donald Trump is set to sign an executive order to change the name of the Department of Defense to the 'Department of War'. This would revive a name that was abandoned over seven decades ago. United States President Donald Trump is renaming the De…",
    "link": "https://www.dw.com/en/us-trump-to-relabel-pentagon-as-department-of-war/a-73887300",
    "timestamp": "2025-09-05T03:12:00Z"
  },
  {
    "title": "Market Structure Faces Headwinds From Senate Critics, Crypto Industry",
    "description": "Two very different but powerful camps - Senator Elizabeth Warren (D-MA) on one side and the crypto industry on the other, want improvements in the market structure bill.",
    "link": "https://www.forbes.com/sites/jasonbrett/2025/09/04/market-structure-faces-headwinds-from-senate-critics-crypto-industry/",
    "timestamp": "2025-09-05T03:02:46Z"
  },
  {
    "title": "Steve Witkoff needs to visit Baghdad: Business and Real Estate are Booming",
    "description": "BAGHDAD, IRAQ — In just the last two years, Baghdad has transformed. Traffic flows unimpeded through the former Green Zone. A new highway abuts the Tigris River in the heart of the city. Overpasses and elevated highways now cross Baghdad’s infamous traffic ci…",
    "link": "https://freerepublic.com/focus/f-news/4338707/posts",
    "timestamp": "2025-09-05T03:02:13Z"
  },
  {
    "title": "Analysis-With diplomatic tour de force, China's Xi shows he's 'totally in charge'",
    "description": "HONG KONG/BEIJING (Reuters) -When Chinese leader Xi Jinping organised his first parade to mark the anniversary of the end of World War Two, in 2015, he...",
    "link": "https://www.yahoo.com/news/articles/analysis-diplomatic-tour-force-chinas-030146286.html",
    "timestamp": "2025-09-05T03:01:46Z"
  },
  {
    "title": "Trump threatens tariffs on chip imports from firms not producing in US",
    "description": "US President Donald Trump said on Thursday his administration would impose tariffs on semiconductor imports from companies not shifting production to the US, speaking ahead of a dinner with major technology company CEOs.\nSince returning to office in January, …",
    "link": "https://biztoc.com/x/522740fec5b91b6f",
    "timestamp": "2025-09-05T03:01:06Z"
  },
  {
    "title": "Trump Says He's Making It 'Very Easy' For Business As Mark Zuckerberg, Tim Cook And Tech CEOs Recite Investment Pledges",
    "description": "On Thursday, President Donald Trump hosted top technology executives at the White House, using the event to tout his business-friendly agenda while pressing leaders on how much they are investing in the U.S.\nBillion-Dollar Pledges From Tech Giants\nSeated betw…",
    "link": "https://biztoc.com/x/4dc060c0813b935d",
    "timestamp": "2025-09-05T03:00:57Z"
  },
  {
    "title": "Jeanine Pirro Says What Trump’s Cartel Crackdown Just Intercepted Was Big Enough To Fill Two Dozen 18-Wheelers",
    "description": "Jeanine Pirro said on Fox News Thursday that federal authorities seized one of the largest drug precursor shipments ever headed for the Sinaloa Cartel.",
    "link": "https://dailycaller.com/2025/09/04/jeanine-pirro-cartel-crackdown/",
    "timestamp": "2025-09-05T03:00:36Z"
  },
  {
    "title": "Trump Now Has Liberals on MSNBC Defending Terrorist Drug Cartels (VIDEO)",
    "description": "It has been absolutely amazing to watch the left take up unpopular positions on issues, solely to be in opposition to Trump.\nThe post Trump Now Has Liberals on MSNBC Defending Terrorist Drug Cartels (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/trump-now-has-liberals-msnbc-defending-terrorist-drug/",
    "timestamp": "2025-09-05T03:00:17Z"
  },
  {
    "title": "Hegseth Says ‘We Have the Absolute Authority’ To Kill Alleged Drug Traffickers",
    "description": "Secretary of Defense Pete Hegseth claimed sweeping powers for the Trump administration on Thursday, stating that the government has \"the absolute authority\" to kill suspected drug traffickers in international waters.\nThe post Hegseth Says ‘We Have the Absolut…",
    "link": "https://www.mediaite.com/media/news/hegseth-says-we-have-the-absolute-authority-to-kill-alleged-drug-traffickers/",
    "timestamp": "2025-09-05T02:58:25Z"
  },
  {
    "title": "Cryptocurrencies fall as Trump-linked tokens and stocks come under pressure",
    "description": "The crypto rally is faltering as digital assets and related stocks fall. Tokens and companies tied to Donald Trump’s family are seeing the steepest declines. Nasdaq is reportedly tightening the rules for digital-asset treasury companies. The music has stopped…",
    "link": "https://coinjournal.net/news/cryptocurrencies-fall-as-trump-linked-tokens-and-stocks-come-under-pressure/",
    "timestamp": "2025-09-05T02:56:57Z"
  },
  {
    "title": "Stephen Miran faces scrutiny over dual role as Trump’s Fed nominee",
    "description": "Stephen Miran, Trump’s Fed nominee, told senators he would remain a White House employee if confirmed, raising concerns about central bank independence and political influence.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/stephen-miran-faces-scrutiny-over-dual-role-as-trumps-fed-nominee/article70014870.ece",
    "timestamp": "2025-09-05T02:56:31Z"
  },
  {
    "title": "News Today Live Updates, 5 September | Zohran Mamdani likely to be New York’s next mayor unless 2 of his opponents quit race, says Trump",
    "description": "Latest News Live Updates | Trump denied urging or encouraging any of the candidates in the race to drop out, however, went on to say he would like to see that happen.",
    "link": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-09-05-2025-news-headlines-10231209/",
    "timestamp": "2025-09-05T02:55:26Z"
  },
  {
    "title": "Trump pressures European leaders over Russian oil purchases, White House official says",
    "description": "President Trump, in a combative call with European leaders and Zelenskiy, urged Europe to halt Russian oil purchases, accusing them of funding Moscow's war in Ukraine. He also pressed Europeans to exert economic pressure on China for supporting Russia's war e…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-pressures-european-leaders-over-russian-oil-purchases-white-house-official-says/articleshow/123710179.cms",
    "timestamp": "2025-09-05T02:54:31Z"
  },
  {
    "title": "Justice Barrett defends Jackson jabs as ‘warranted’ in rare public appearance",
    "description": "Justice Amy Coney Barrett spoke about her recent controversial opinion on universal injunctions, saying her stern words for Justice Ketanji Brown Jackson in it were appropriate.",
    "link": "https://www.foxnews.com/politics/barrett-defends-jackson-jabs-warranted-rare-public-appearance",
    "timestamp": "2025-09-05T02:53:56Z"
  },
  {
    "title": "U.S. says 2 Venezuelan planes flew near U.S. navy ship in international waters",
    "description": "The U.S. Department of Defence said late on Thursday that two Venezuela military aircraft flew near a U.S. Navy vessel in international waters, with the Pentagon calling it 'a highly provacative move.'",
    "link": "https://www.cbc.ca/news/world/venzeuela-planes-us-ship-1.7625855",
    "timestamp": "2025-09-05T02:53:43Z"
  },
  {
    "title": "Trump to attend the US Open men's final Sunday, marking another trip to a major sporting event",
    "description": "Donald Trump will attend the US Open men's final on Sunday. This marks his return to the tournament after ten years. The White House has confirmed his visit. He will travel to New York for the day. He will return to Washington after the match. Jannik Sinner w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-attend-the-us-open-mens-final-sunday-marking-another-trip-to-a-major-sporting-event/articleshow/123710121.cms",
    "timestamp": "2025-09-05T02:51:01Z"
  },
  {
    "title": "Japan auto stocks jump as Trump brings tariffs down",
    "description": "TOKYO -- Shares in Japanese automakers and parts suppliers rose Friday morning, as investors welcomed U.S. President Donald Trump's executive order cutting the tariff on the country's automotive imports.\nUS levies set at 15%; shares in Toyota, Nissan and Mazd…",
    "link": "https://biztoc.com/x/1a7e6b8bb5c603bf",
    "timestamp": "2025-09-05T02:50:08Z"
  },
  {
    "title": "Data Shows Job Market Still Sucks After Trump Fired Labor Stats Chief",
    "description": "President Donald Trump might regret sacking his last Bureau of Labor Statistics (BLS) chief because the new numbers are in and they’re just as bad as before.\nReleased Wednesday, the agency’s latest Job Openings and Labor Turnover report recorded just 7.18 mil…",
    "link": "https://biztoc.com/x/3490d2a5fb35bce6",
    "timestamp": "2025-09-05T02:50:03Z"
  },
  {
    "title": "Donald Trump to attend the US Open men's final Sunday - first time in a decade",
    "description": "Donald Trump is set to attend the US Open men's final on Sunday, marking his first appearance at the tournament since 2015. He was last seen at the event before launching his presidential campaign. Trump's presence at sporting events often elicits mixed react…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-to-attend-the-us-open-mens-final-sunday-first-time-in-a-decade/articleshow/123710083.cms",
    "timestamp": "2025-09-05T02:48:45Z"
  },
  {
    "title": "GOP Lawmakers Told Trump Voters Support Vaccines",
    "description": "“Polling showing that a majority of President Donald Trump’s voters support vaccines was shared with several Republicans lawmakers’ staffers in a closed-door meeting Wednesday,” NBC News reports. The poll was conducted by veteran Republican pollsters",
    "link": "https://politicalwire.com/2025/09/04/gop-lawmakers-told-trump-voters-support-vaccines/",
    "timestamp": "2025-09-05T02:47:07Z"
  },
  {
    "title": "Japan auto stocks jump as Trump brings tariffs down",
    "description": "US levies set at 15%; shares in Toyota, Nissan and Mazda trade higher",
    "link": "https://asia.nikkei.com/business/markets/japan-auto-stocks-jump-as-trump-brings-tariffs-down",
    "timestamp": "2025-09-05T02:46:42Z"
  },
  {
    "title": "'We're denying people vaccines': Senators grill RFK Jr on vaccine policies",
    "description": "Democrats and Republicans have grilled US Health Secretary Robert F Kennedy Jr on his recent vaccine policies.",
    "link": "https://www.abc.net.au/news/2025-09-05/us-senators-grill-rfk-jr-on-vaccine-policies/105739198",
    "timestamp": "2025-09-05T02:45:22Z"
  },
  {
    "title": "Milwaukee street takeovers; MPA’s National Guard proposal sparks backlash",
    "description": "The Milwaukee Police Association president suggested the National Guard could help with recent street takeovers, but the suggestion quickly drew criticism from city leaders and activists.",
    "link": "https://www.fox6now.com/news/milwaukee-street-takeovers-mpas-national-guard-proposal-sparks-backlash",
    "timestamp": "2025-09-05T02:45:22Z"
  },
  {
    "title": "Trump hosts tech leaders at White House; Musk missing from guest list",
    "description": "Trump hosted top tech leaders at the White House, showcasing AI and billions in US investments, while Melania led an AI task force and Musk skipped the event.",
    "link": "https://www.thehindubusinessline.com/info-tech/trump-hosts-tech-leaders-at-white-house-musk-missing-from-guest-list/article70014869.ece",
    "timestamp": "2025-09-05T02:43:51Z"
  },
  {
    "title": "'Incredible Job!' Trump Praises Google's Sundar Pichai At AI Education Event: Here's What Happened",
    "description": "During a meeting of the White House task force on AI Education, President Donald Trump commended Google's recent efforts, telling CEO Sundar Pichai that he's doing an \"incredible job.\" The President's remarks, including \"Google had a very good day yesterday\" …",
    "link": "https://www.ndtvprofit.com/technology/incredible-job-trump-praises-googles-sundar-pichai-at-ai-education-event-heres-what-happened",
    "timestamp": "2025-09-05T02:41:45Z"
  },
  {
    "title": "Asia mixed after Trump implements Japan trade deal",
    "description": "Asia-Pacific markets traded mixed on Friday after United States President Donald Trump signed an executive order implementing a 15% tariff on Japanese auto imports, lowering the rate from the previous...",
    "link": "https://biztoc.com/x/b9c10f5f9372e3a2",
    "timestamp": "2025-09-05T02:39:13Z"
  },
  {
    "title": "How PA Turned Red--and Why It Might Last",
    "description": "Butler: The Untold Story of the Near Assassination of Donald Trump and the Fight for America's Heartland, by Salena Zito (Center Street, 256 pp., $20.28)On July 13, 2024, a youthful, bespectacled ass",
    "link": "http://www.realclearpennsylvania.com/articles/2025/09/04/the_story_of_how_pa_turned_redbut_will_it_last_1132902.html",
    "timestamp": "2025-09-05T02:38:34Z"
  },
  {
    "title": "Trump's pick for Fed tells Senate panel he's 'not at all' president's puppet",
    "description": "The hearing was held as Trump steps up efforts to exert control over the central bank, including an unprecedented attempt to remove a sitting Fed governor.",
    "link": "https://www.japantimes.co.jp/business/2025/09/05/economy/fed-nominee-miran-senate-panel/",
    "timestamp": "2025-09-05T02:38:00Z"
  },
  {
    "title": "As Trump abandons the rulebook on trade, does free trade have a future elsewhere?",
    "description": "The old system of US-led multilateralism has ended. What will replace it remains unclear.",
    "link": "https://theconversation.com/as-trump-abandons-the-rulebook-on-trade-does-free-trade-have-a-future-elsewhere-264338",
    "timestamp": "2025-09-05T02:35:47Z"
  },
  {
    "title": "Trump questions Tim Cook's intent to invest 'elsewhere' as Apple deepens roots in India",
    "description": "Donald Trump questioned Tim Cook about Apple's expansion. This happened during a dinner with tech leaders. Cook assured Trump of Apple's US investment. Apple is also boosting iPhone production in India. The company plans to export more to the US. Apple is ope…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/trump-questions-tim-cooks-intent-to-invest-elsewhere-as-apple-deepens-roots-in-india/articleshow/123709675.cms",
    "timestamp": "2025-09-05T02:35:41Z"
  },
  {
    "title": "Kim, Xi hail bond as North Korea says it will protect China’s interests",
    "description": "Goodwill messages continued this week's public display of diplomatic unity between Beijing, Pyongyang and Moscow.",
    "link": "https://www.aljazeera.com/news/2025/9/5/kim-xi-hail-bond-as-north-korea-says-it-will-protect-chinas-interests",
    "timestamp": "2025-09-05T02:34:58Z"
  },
  {
    "title": "Trump finalizes Japan trade deal with 15% tariffs as Ishiba faces discontent from within party",
    "description": "The deal was agreed in July after months of talks, with Washington and Tokyo continuing to haggle over details for weeks before finalizing the terms.",
    "link": "https://www.cnbc.com/2025/09/05/trum-japan-trade-deal-tariffs-ishiba-ldp-party.html",
    "timestamp": "2025-09-05T02:34:35Z"
  },
  {
    "title": "Trump Hints At 200-300% Tariff On Semiconductor Imports: 'Fairly Substantial Chips Coming Shortly'",
    "description": "Donald Trump addressed reporters during a dinner at the White House with a rare gathering of top executives and founders from some of the world’s biggest technology companies, including Tim Cook",
    "link": "https://www.ndtvprofit.com/world/trump-hints-at-200-300-tariff-on-semiconductor-imports-fairly-substantial-chips-coming-shortly",
    "timestamp": "2025-09-05T02:33:15Z"
  },
  {
    "title": "Trump signs order to lower US tariffs on Japan autos to 15%",
    "description": "US President Donald Trump signed an order Thursday to lower tariffs on Japanese autos, as Washington moves to implement a trade pact negotiated with...",
    "link": "https://finance.yahoo.com/news/trump-signs-order-lower-us-220926026.html",
    "timestamp": "2025-09-05T02:33:05Z"
  },
  {
    "title": "Trump to attend the US Open men's final Sunday, marking another trip to a major sporting event",
    "description": "President Donald Trump will attend Sunday's men's final of the U.S. Open, returning to a tournament he once frequently attended for the first time in a decade. The White House confirmed the visit Thursday night. Trump is expected to make a daytrip to Queens, …",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c68c1b43-3b56-4b46-aa9d-aafc7b9bbfed",
    "timestamp": "2025-09-05T02:32:34Z"
  },
  {
    "title": "Trump likely to sign executive order over ‘Department of War’ rebranding for Pentagon",
    "description": "In August, Trump told reporters that “everybody likes that we had an unbelievable history of victory when it was Department of War. Then we changed it to Department of Defence\".",
    "link": "https://indianexpress.com/article/world/trump-department-of-war-rebrand-pentagon-name-change-10231255/",
    "timestamp": "2025-09-05T02:26:47Z"
  },
  {
    "title": "US considers banning Iranians from shopping at Costco during UN meeting",
    "description": "The Trump administration is considering tightening travel restrictions on delegations from Iran, Sudan, Zimbabwe, and potentially Brazil, for the upcoming U.N. meeting. These restrictions could limit their movement outside New York City, with Iranian diplomat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-considers-banning-iranians-from-shopping-at-costco-during-un-meeting/articleshow/123709728.cms",
    "timestamp": "2025-09-05T02:26:37Z"
  },
  {
    "title": "The president looked to the first lady, 24 years his junior, for assistance after a question didn’t register.",
    "description": "President Donald Trump had to lean on First Lady Melania to help him understand a reporter’s question while hosting tech leaders at the White House. The...",
    "link": "https://www.thedailybeast.com/donald-trump-79-needs-melanias-help-hearing-reporters-question/",
    "timestamp": "2025-09-05T02:23:26Z"
  },
  {
    "title": "US tech titans pay hommage to Trump at White House dinner",
    "description": "Tech world executives showered Donald Trump with praise Thursday during a rare dinner that saw the US president host some of the most important players in AI at the White House. “This is quite a group to get together,” said Meta chief and co-founder Mark Zuck…",
    "link": "https://www.digitaljournal.com/world/us-tech-titans-pay-hommage-to-trump-at-white-house-dinner/article",
    "timestamp": "2025-09-05T02:22:32Z"
  },
  {
    "title": "Biden had surgery to remove cancerous cells: Report",
    "description": "Former President Joe Biden, 82, underwent Mohs surgery to remove cancerous skin cells and is recovering well, months after revealing a diagnosis of metastatic prostate cancer. This follows a previous basal cell carcinoma removal in 2023. Biden's health was of…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/biden-had-surgery-to-remove-cancerous-cells-report/articleshow/123709685.cms",
    "timestamp": "2025-09-05T02:21:26Z"
  },
  {
    "title": "President Trump expected to attend U.S. Open men's final",
    "description": "Trump last attended the U.S. Open in 2015.",
    "link": "https://sports.yahoo.com/tennis/article/president-trump-expected-to-attend-us-open-mens-final-022115945.html",
    "timestamp": "2025-09-05T02:21:15Z"
  },
  {
    "title": "US Tech Titans Pay Hommage To Trump At White House Dinner",
    "description": "Tech world executives showered Donald Trump with praise Thursday during a rare dinner that saw the US president host some of the most important players in AI at the White House.",
    "link": "https://www.ibtimes.com/us-tech-titans-pay-hommage-trump-white-house-dinner-3782546",
    "timestamp": "2025-09-05T02:21:11Z"
  },
  {
    "title": "US says 2 Venezuela military aircraft flew near US Navy vessel in international waters",
    "description": "WASHINGTON (Reuters) -The U.S. Department of Defense said late on Thursday that two Venezuela military aircraft flew near a U.S. Navy vessel in international...",
    "link": "https://www.yahoo.com/news/articles/us-says-2-venezuela-military-021754808.html",
    "timestamp": "2025-09-05T02:17:54Z"
  },
  {
    "title": "Pete Hegseth’s Department of Cringe",
    "description": "Renaming the Defense Department is a pathetic stunt.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/09/defense-war-cringe-department/684112/",
    "timestamp": "2025-09-05T02:17:44Z"
  },
  {
    "title": "Mike Tyson to set fight Floyd Mayweather in boxing bombshell",
    "description": "Two of boxing's greatest competitors will go head-to-head in the ring.",
    "link": "https://nypost.com/2025/09/04/sports/mike-tyson-to-set-fight-floyd-mayweather-in-boxing-bombshell/",
    "timestamp": "2025-09-05T02:15:09Z"
  },
  {
    "title": "Justice Department probes mortgage fraud claims against Lisa Cook of Federal Reserve: Source",
    "description": "The Justice Department is investigating Federal Reserve Governor Lisa Cook for alleged mortgage fraud, stemming from a criminal referral regarding two properties she purchased in 2021. This probe coincides with Cook's legal challenge against President Trump's…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/justice-department-probes-mortgage-fraud-claims-against-lisa-cook-of-federal-reserve-source/articleshow/123709623.cms",
    "timestamp": "2025-09-05T02:14:04Z"
  },
  {
    "title": "Trump to speak at Museum of the Bible on religious liberty in education",
    "description": "President Trump will deliver remarks at the Museum of the Bible in Washington during a hearing on religious liberty in education, according to a White House spokesperson.",
    "link": "https://www.foxnews.com/politics/trump-speak-museum-bible-religious-liberty-education",
    "timestamp": "2025-09-05T02:11:13Z"
  },
  {
    "title": "Trump signs order to lower US tariffs on Japan autos to 15%",
    "description": "Donald Trump, the US President, signed an order. This order lowers tariffs on Japanese autos. Japanese autos will now face a 15-percent tariff. Earlier, it was 27.5 percent. Many other goods will also have a 15-percent cap. This is a win for Japan. The change…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-order-to-lower-us-tariffs-on-japan-autos-to-15/articleshow/123709576.cms",
    "timestamp": "2025-09-05T02:08:33Z"
  },
  {
    "title": "Demolition for new White House ballroom doesn't need approval, Trump-appointed commission head says",
    "description": "The head of the National Capital Planning Commission says crews can start demolishing parts of the White House for a new ballroom without needing approval",
    "link": "https://abcnews.go.com/Politics/wireStory/demolition-new-white-house-ballroom-approval-trump-appointed-125268879",
    "timestamp": "2025-09-05T02:06:30Z"
  },
  {
    "title": "Trump to rename Department of Defense the 'Department of War,' official says",
    "description": "The name change will be costly and require updating signs and letterheads used around the world.",
    "link": "https://www.japantimes.co.jp/news/2025/09/05/world/politics/us-department-of-war/",
    "timestamp": "2025-09-05T02:06:00Z"
  },
  {
    "title": "Dollar holds ground as bonds find footing, jobs data looms",
    "description": "The dollar steadied as bond markets recovered, awaiting crucial U.S. jobs data that could reinforce expectations of a Federal Reserve rate cut. Investors are cautiously optimistic, with many believing the dollar is currently undervalued and poised for a rebou…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-ground-as-bonds-find-footing-jobs-data-looms/articleshow/123709525.cms",
    "timestamp": "2025-09-05T02:01:06Z"
  },
  {
    "title": "David Axelrod Tries to Advise Illinois Governor Pritzker Not to Play Politics With Crime, Work With Trump (VIDEO)",
    "description": "Longtime Democrat strategist and former Obama campaign adviser David Axelrod recently tried to warn Illinois Governor JB Pritzker not to play politics on the issue of crime in Chicago.\nThe post David Axelrod Tries to Advise Illinois Governor Pritzker Not to P…",
    "link": "https://www.thegatewaypundit.com/2025/09/david-axelrod-tries-advise-illinois-governor-pritzker-not/",
    "timestamp": "2025-09-05T02:00:23Z"
  },
  {
    "title": "Trump To Rename Pentagon, Restoring Historic 'Department Of War'",
    "description": "US President Donald Trump on Friday is expected to sign an executive order authorising the US Department of Defence to rebrand itself as the 'Department of War', the White House said. The President had suggested the change during remarks to reporter on Aug. 2…",
    "link": "https://www.ndtvprofit.com/world/trump-to-rename-pentagon-restoring-historic-department-of-war",
    "timestamp": "2025-09-05T02:00:05Z"
  },
  {
    "title": "Politics Over People: Chicago’s Leaders Are Failing Their City",
    "description": "There was no Labor Day holiday for Chicago criminals, who murdered nine people and wounded another 51; most (if not all) were black or brown... Read More\nThe post Politics Over People: Chicago’s Leaders Are Failing Their City appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/09/04/politics-over-people-chicagos-leaders-are-failing-their-city/",
    "timestamp": "2025-09-05T02:00:00Z"
  },
  {
    "title": "Northwestern President resigns amid antisemitism probe and funding freeze",
    "description": "Northwestern President Michael Schill resigns amid federal funding freeze and criticism over campus protests. He’ll stay on until an interim leader is named and help restore the university’s lost funding.",
    "link": "https://www.israelnationalnews.com/news/414433",
    "timestamp": "2025-09-05T01:56:13Z"
  },
  {
    "title": "‘He’s in Epstein’s Black Book’: Thomas Massie Lays Into ‘Major Donor to the Republican Party’",
    "description": "Rep. Thomas Massie tore into Republican donor John Paulson this week, accusing Trump of protecting Paulson and others \"in Epstein's black book.\"\nThe post ‘He’s in Epstein’s Black Book’: Thomas Massie Lays Into ‘Major Donor to the Republican Party’ first appea…",
    "link": "https://www.mediaite.com/media/tv/hes-in-epsteins-black-book-thomas-massie-lays-into-major-donor-to-the-republican-party/",
    "timestamp": "2025-09-05T01:55:58Z"
  },
  {
    "title": "Australia is having the last laugh on Donald Trump’s trade beef",
    "description": "Nothing highlights the US president’s trade delusions better than his victory over Australia’s beef ban. Record exports are now flowing in the opposite direction to what he intended.",
    "link": "https://www.smh.com.au/business/the-economy/australia-is-having-the-last-laugh-on-trump-s-trade-beef-20250807-p5ml77.html",
    "timestamp": "2025-09-05T01:55:03Z"
  },
  {
    "title": "Oil prices ease as investors await OPEC+ output decision",
    "description": "Oil prices edged lower for the third consecutive day as investors anticipate the upcoming OPEC+ meeting, where further output increases will be considered for October. The potential boost in production could lead to unwinding output cuts ahead of schedule. Me…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-ease-as-investors-await-opec-output-decision/articleshow/123709492.cms",
    "timestamp": "2025-09-05T01:54:32Z"
  },
  {
    "title": "Northwestern president resigns amid funding cuts, White House negotiations - The Washington Post",
    "description": "Northwestern president resigns amid funding cuts, White House negotiationsThe Washington Post President of Northwestern, a School Attacked by the G.O.P., Will ResignThe New York Times Northwestern University President Michael Schill resigns amid President Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179012260",
    "timestamp": "2025-09-05T01:53:21Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,289",
    "description": "Here are the key events on day 1,289 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/9/5/russia-ukraine-war-list-of-key-events-day-1289",
    "timestamp": "2025-09-05T01:52:01Z"
  },
  {
    "title": "Trump asks Supreme Court to quickly uphold global tariffs",
    "description": "The move follows a federal appeals court ruling that said the U.S. president can’t impose import taxes by invoking a 1977 law designed to address emergencies.",
    "link": "https://www.japantimes.co.jp/business/2025/09/05/markets/trump-supreme-court-global-tariffs/",
    "timestamp": "2025-09-05T01:49:00Z"
  },
  {
    "title": "Canada to Stall Electric Vehicle Rules as Carney Seeks to Boost Auto Sector",
    "description": "Canada is delaying a plan to force automakers to hit minimum sales levels for electric vehicles by 2026, a concession to manufacturers in a sector that has been upended by tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-to-stall-electric-vehicle-rules-as-carney-seeks-to-boost-auto-sector",
    "timestamp": "2025-09-05T01:47:02Z"
  },
  {
    "title": "Asian Shares Join Global Rally Before US Jobs Data: Markets Wrap",
    "description": "Asian shares posted early gains Friday after stocks and bonds rallied on Wall Street as further signs of a cooling labor market reinforced bets the Federal Reserve will cut rates this month. Stocks rose in Japan, Australia and South Korea at the open. The Nik…",
    "link": "https://www.ndtvprofit.com/markets/global-stock-market-update-sept-5-check-s-and-p-500-nasdaq-nikkei-hang-seng-dow-jones-today",
    "timestamp": "2025-09-05T01:46:58Z"
  },
  {
    "title": "Ahead of Kennedy hearing, GOP saw poll showing Trump voters support vaccines",
    "description": "Polling showing that a majority of President Donald Trump’s voters support vaccines was shared with several Republicans lawmakers’ staffers in a closed-door meeting Wednesday, according to two people familiar with the meeting",
    "link": "https://www.nbcnews.com/health/health-news/ahead-kennedy-hearing-gop-saw-poll-showing-trump-voters-support-vaccin-rcna229243",
    "timestamp": "2025-09-05T01:45:56Z"
  },
  {
    "title": "Chuck Todd Spells Out Why RFK Jr. Is Posing The 'Biggest Problem' For Trump",
    "description": "The former \"Meet the Press\" host said he expects the president will eventually throw his health secretary \"overboard.\"",
    "link": "https://www.huffpost.com/entry/chuck-todd-trump-rfk-jr-senate-hearing_n_68ba2464e4b04dd23504322e",
    "timestamp": "2025-09-05T01:41:51Z"
  },
  {
    "title": "Melania Trump invites tech CEOs to White House to inaugurate education AI task force",
    "description": "The first lady today invited some of the U.S.’s foremost tech leaders to the East Wing of the White House to inaugurate a task force on artificial intelligence with an emphasis on integrating AI into the education of children. “I predict AI will represent the…",
    "link": "https://siliconangle.com/2025/09/04/melania-trump-invites-tech-ceos-white-house-inaugurate-education-ai-task-force/",
    "timestamp": "2025-09-05T01:41:45Z"
  },
  {
    "title": "Legal expert warns Trump saving this 'big heavy gun' for 'when all hell has broken loose'",
    "description": "In an article for Democracy Docket published Thursday, journalist Jim Saksa argued that President Donald Trump is systematically expanding his authority to deploy military force within U.S. cities, and that the lack of sufficient legal or legislative pushback…",
    "link": "https://www.rawstory.com/donald-trump-2673962597/",
    "timestamp": "2025-09-05T01:40:45Z"
  },
  {
    "title": "US considers banning Iranians from shopping at Costco during UN meeting",
    "description": "The Trump administration has already denied visas for Palestinian leader Mahmoud Abbas and his large delegation to attend the U.N. General Assembly later this month",
    "link": "https://abcnews.go.com/US/wireStory/us-considers-banning-iranians-shopping-costco-meeting-125272515",
    "timestamp": "2025-09-05T01:34:19Z"
  },
  {
    "title": "Joe Biden Underwent Surgery To Remove Skin Cancer",
    "description": "Former President Joe Biden reportedly underwent surgery to remove cancerous cells from his forehead, according to multiple reports.",
    "link": "https://dailycaller.com/2025/09/04/joe-biden-underwent-surgery-to-remove-skin-cancer/",
    "timestamp": "2025-09-05T01:32:25Z"
  },
  {
    "title": "Japanese Equities Rise As 15% Donald Trump Tariff Deal Sealed, Autos Up",
    "description": "The Topix rose 0.8% to 3,106.31 as of 9:15 a.m. Tokyo time, while the blue-chip heavy Nikkei 225 Stock Average advanced 1.2% to 43,109.47. The yen was up 0.1% to 148.36 against the dollar.",
    "link": "https://www.ndtvprofit.com/markets/japanese-equities-rise-as-15-donald-trump-tariff-deal-sealed-autos-up",
    "timestamp": "2025-09-05T01:31:31Z"
  },
  {
    "title": "Rubio says US will 'blow up' foreign crime groups if needed",
    "description": "The secretary of state made the comments during a trip to Ecuador, where he announced new measures targeting criminal gangs.",
    "link": "https://www.bbc.com/news/articles/cx23nzwjnwwo",
    "timestamp": "2025-09-05T01:30:42Z"
  },
  {
    "title": "Justice Amy Coney Barrett says country is not in a 'constitutional crisis'",
    "description": "Speaking to Free Press founder Bari Weiss to promote her new book, the conservative justice said the American people should trust the Supreme Court.",
    "link": "https://www.nbcnews.com/politics/supreme-court/amy-coney-barrett-says-country-not-constitutional-crisis-bari-weiss-rcna229238",
    "timestamp": "2025-09-05T01:30:41Z"
  },
  {
    "title": "Fact Check: Doctored image of Trump spreads online amid health concerns",
    "description": "California Gov. Gavin Newsom's office and others shared the altered image on social media, with some people speculating about the president's health.",
    "link": "https://www.snopes.com/fact-check/trump-image-health-concerns/",
    "timestamp": "2025-09-05T01:30:00Z"
  },
  {
    "title": "Doctored image of Trump spreads online amid health concerns",
    "description": "California Gov. Gavin Newsom's office and others shared the altered image on social media, with some people speculating about the president's health.",
    "link": "https://www.snopes.com//fact-check/trump-image-health-concerns/",
    "timestamp": "2025-09-05T01:30:00Z"
  },
  {
    "title": "President Trump signs order that could massively benefit Elon Musk and Jeff Bezos: 'Critical to economic growth'",
    "description": "\"It doesn’t mean that’s possible, or that they have the authority to do so.\"",
    "link": "https://finance.yahoo.com/news/president-trump-signs-order-could-013000348.html",
    "timestamp": "2025-09-05T01:30:00Z"
  },
  {
    "title": "Trump praises RFK Jr.'s performance even as some Republicans grow weary of his tumultuous term (Adam Cancryn/CNN)",
    "description": "Adam Cancryn / CNN:\nTrump praises RFK Jr.'s performance even as some Republicans grow weary of his tumultuous term  —  Robert F. Kennedy Jr.'s tumultuous tenure atop the US Health and Human Services Department is starting to wear on some prominent Republicans…",
    "link": "https://www.memeorandum.com/250904/p147",
    "timestamp": "2025-09-05T01:30:00Z"
  },
  {
    "title": "Farage grabs momentum, convenes hard-right Reform UK party",
    "description": "Nigel Farage’s anti-immigration party Reform UK kicks off Britain’s annual party conference season Friday, with the Brexit cheerleader and his buoyant supporters increasingly confident he could be Britain’s next leader.  Farage — who rebranded his Brexit Part…",
    "link": "https://www.digitaljournal.com/world/farage-grabs-momentum-convenes-hard-right-reform-uk-party/article",
    "timestamp": "2025-09-05T01:27:20Z"
  },
  {
    "title": "Farage Grabs Momentum, Convenes Hard-right Reform UK Party",
    "description": "Nigel Farage's anti-immigration party Reform UK kicks off Britain's annual party conference season Friday, with the Brexit cheerleader and his buoyant supporters increasingly confident he could be Britain's next leader.",
    "link": "https://www.ibtimes.com/farage-grabs-momentum-convenes-hard-right-reform-uk-party-3782537",
    "timestamp": "2025-09-05T01:27:10Z"
  },
  {
    "title": "Farage Grabs Momentum, Convenes Hard-right Reform UK Party",
    "description": "Nigel Farage's anti-immigration party Reform UK kicks off Britain's annual party conference season Friday, with the Brexit cheerleader and his buoyant supporters increasingly confident he could be Britain's next leader.",
    "link": "https://www.ibtimes.com.au/farage-grabs-momentum-convenes-hard-right-reform-uk-party-1860383",
    "timestamp": "2025-09-05T01:27:07Z"
  },
  {
    "title": "Trump to sign executive order rebranding Defense Department as the Department of War (NBC News)",
    "description": "NBC News:\nTrump to sign executive order rebranding Defense Department as the Department of War  —  The directive won't rename the Defense Department, which would require congressional approval, but it will make the Department of War its secondary title.  —  W…",
    "link": "https://www.memeorandum.com/250904/p145",
    "timestamp": "2025-09-05T01:25:04Z"
  },
  {
    "title": "Trump to seek 'Department of War' rebranding for Pentagon",
    "description": "Donald Trump intends to rename the Defence Department as the War Department. He will sign an executive order soon. The change requires Congressional approval. Pete Hegseth supports the name change. Hegseth has removed diversity programs and materials. Transge…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-seek-department-of-war-rebranding-for-pentagon/articleshow/123709306.cms",
    "timestamp": "2025-09-05T01:24:39Z"
  },
  {
    "title": "'Makes no sense': 9/11 museum slams Trump's new takeover bid",
    "description": "President Donald Trump is reportedly mulling a takeover bid of the 9/11 Memorial & Museum — and museum officials aren't on board.Trump is looking into how the federal government could take control of the museum, which has faced questions over its finances and…",
    "link": "https://www.rawstory.com/trump-911-2673962567/",
    "timestamp": "2025-09-05T01:24:25Z"
  },
  {
    "title": "Hegseth vows to rebuild military deterrence so enemies 'don't want to f--- with us'",
    "description": "Sec. Pete Hegseth addressed Officer Candidate School graduates at Fort Benning, emphasizing military strength and Trump administration's focus on deterrence.",
    "link": "https://www.foxnews.com/politics/hegseth-vows-rebuild-military-deterrence-so-enemies-dont-want-us",
    "timestamp": "2025-09-05T01:21:52Z"
  },
  {
    "title": "Trump Basks in Tech Leaders’ Spending Vows at White House Dinner",
    "description": "Meta Platforms Inc.’s Mark Zuckerberg and Apple Inc.’s Tim Cook joined tech industry leaders in touting their pledges to boost spending in the US on artificial intelligence during a dinner hosted by President Donald Trump that highlighted his deepening relati…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-basks-in-tech-leaders-spending-vows-at-white-house-dinner",
    "timestamp": "2025-09-05T01:21:31Z"
  }
]