[
  {
    "title": "Trump’s Tariffs Are Already Devastating Small Businesses",
    "description": "Small businesses owners are already feeling the effects of Donald Trump’s tariff scheme that he claims will boost American manufacturing and bring jobs back to the United States.\r\nMany have flocked to Reddit to share their struggles, desperately searching for…",
    "link": "https://newrepublic.com/post/193753/donald-trump-tariffs-devastating-small-businesses",
    "timestamp": "2025-04-08T19:55:41Z"
  },
  {
    "title": "Trump is expected to sign executive orders to boost coal",
    "description": "President Donald Trump is expected to sign executive orders aimed at boosting coal, a reliable but polluting energy source that's long been in decline.",
    "link": "https://www.wcvb.com/article/trump-executive-orders-coal-energy-policy/64419796",
    "timestamp": "2025-04-08T19:55:37Z"
  },
  {
    "title": "Trump is expected to sign executive orders to boost coal",
    "description": "President Donald Trump signed executive orders aimed at boosting coal, a reliable but polluting energy source that's long been in decline.",
    "link": "https://www.wmtw.com/article/trump-executive-orders-coal-energy-policy/64419796",
    "timestamp": "2025-04-08T19:55:36Z"
  },
  {
    "title": "This dead cat won’t bounce",
    "description": "After a big explosion of wishful thinking earlier in the day, the stock market is cratering again at the close. The indices will have lost something like 13% of their value over the last four trading days, which is something like eight trillion dollars and 17…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/this-dead-cat-wont-bounce",
    "timestamp": "2025-04-08T19:54:47Z"
  },
  {
    "title": "Could Israel-Turkey war of words escalate to actual war?",
    "description": "The war of words between Israel and Turkey has been intensifying. And recent Israeli bombs on Syria were meant as a message to Turkey, observers say. Will it come to a direct confrontation between the two countries?",
    "link": "https://www.dw.com/en/could-israel-turkey-war-of-words-escalate-to-actual-war/a-72173780",
    "timestamp": "2025-04-08T19:54:00Z"
  },
  {
    "title": "Government considers nationalising British Steel",
    "description": "There are fears among ministers that the company's blast furnaces could run out of raw materials within days.",
    "link": "https://www.bbc.com/news/articles/c7vnz4jy97no",
    "timestamp": "2025-04-08T19:53:32Z"
  },
  {
    "title": "Analysts Clarify That Trump Is Only Responsible For The Stock Market When It Goes Down",
    "description": "U.S. — With investors pleasantly surprised that a crash has thus far been avoided and the market had rebounded in the wake of new trade tariffs, top analysts clarified that President Trump was only responsible for the stock market when it goes down.",
    "link": "https://babylonbee.com/news/analysts-clarify-that-trump-is-only-responsible-for-the-stock-market-when-it-goes-down",
    "timestamp": "2025-04-08T19:52:40Z"
  },
  {
    "title": "ICYMI: Why Global Markets Are In Flux",
    "description": "President Donald Trump's escalating trade war sent markets lurching between hope and panic yesterday.<br><br>But overall, stocks have been tumbling since last Wednesday. That's when President Trump announced a universal 10 percent tariff on all goods coming i…",
    "link": "https://www.npr.org/2026/01/01/1265982437/zz-1a-globalmarkets",
    "timestamp": "2025-04-08T19:52:16Z"
  },
  {
    "title": "WTI Falls Below $60 Amid Trade War Escalation",
    "description": "Crude hit a 4-year low after Trump's new tariffs stoked recession fears.",
    "link": "https://www.rigzone.com/news/wire/wti_falls_below_60_amid_trade_war_escalation-08-apr-2025-180175-article/",
    "timestamp": "2025-04-08T19:52:10Z"
  },
  {
    "title": "Ukraine Will Reportedly Take Another Stab At Securing Mineral Deal After Oval Office Blow Up",
    "description": "Ukrainian envoys are set to visit the U.S between April 11 and 12 to discuss a new mineral deal, people familiar with matter told Bloomberg Tuesday.",
    "link": "https://dailycaller.com/2025/04/08/ukraine-to-attempt-second-mineral-deal-oval-office-blow-up/",
    "timestamp": "2025-04-08T19:51:08Z"
  },
  {
    "title": "Trump assassination attempt suspect Ryan Routh sought rocket launcher from Ukraine: docs",
    "description": "Federal prosecutors revealed that Ryan Routh, the accused would-be assassin of President Donald Trump, sought to obtain military-grade weapons – including a rocket launcher – from a Ukrainian contact as part of his alleged assassination plot. Routh told his a…",
    "link": "https://freerepublic.com/focus/f-news/4309765/posts",
    "timestamp": "2025-04-08T19:51:00Z"
  },
  {
    "title": "Democratic lawmakers slam Trump admin after Reuters reports US Navy admiral firing",
    "description": "WASHINGTON (Reuters) -Democratic lawmakers on Tuesday sharply criticized President Donald Trump's administration and said it was harming national security, after Reuters reported the firing of U.S. Navy Vice Admiral Shoshana Chatfield, who held a senior posit…",
    "link": "https://www.thestar.com.my/news/world/2025/04/09/democratic-lawmakers-slam-trump-admin-after-reuters-reports-us-navy-admiral-firing",
    "timestamp": "2025-04-08T19:50:00Z"
  },
  {
    "title": "I just had a great call with the Acting President of South Korea.",
    "description": "I just had a great call with the Acting President of South Korea. We talked about their tremendous and unsustainable Surplus, Tariffs, Shipbuilding, large scale purchase of U.S. LNG, their joint venture in an Alaska Pipeline, and payment for the big time Mili…",
    "link": "https://freerepublic.com/focus/f-news/4309764/posts",
    "timestamp": "2025-04-08T19:49:40Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/headlines-today-2-6672600-Apr2025/",
    "timestamp": "2025-04-08T19:49:15Z"
  },
  {
    "title": "Sweeping legal claim from Trump admin: Citizens can be deported without due process and left abroad without reprieve",
    "description": "The Trump administration is asserting the authority to deport anyone, including American citizens, without due process, according to a Supreme Court brief. This policy would permit indefinite overseas detention, depriving citizens of their constitutional righ…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sweeping-legal-claim-from-trump-admin-citizens-can-be-deported-without-due-process-and-left-abroad-without-reprieve/articleshow/120105331.cms",
    "timestamp": "2025-04-08T19:48:42Z"
  },
  {
    "title": "Trump told Republican senators he’s open to raising taxes on highest earners",
    "description": "The Scoop\nPresident Donald Trump told Republican senators in private last week that he’s open to raising tax rates on some of the highest-earning Americans, according to three people familiar with the meeting.\nTrump’s comments came during a sitdown about his …",
    "link": "https://biztoc.com/x/8ef2d5698e139250",
    "timestamp": "2025-04-08T19:48:13Z"
  },
  {
    "title": "Is a Recession Looming? What to Expect from Trump’s Tariffs",
    "description": "Turmoil following President Donald Trump’s tariffs are sending experts and consumers into a frenzy about a potential recession.",
    "link": "https://time.com/7275838/recession-what-to-expect-from-trumps-tariffs/",
    "timestamp": "2025-04-08T19:47:15Z"
  },
  {
    "title": "Canada Says Tariffs On US Auto Imports Take Effect Today",
    "description": "Canada said it will begin imposing a 25 percent tariff on certain US auto imports from Wednesday, activating a retaliatory measure in response to President Donald Trump&#039;s levies on foreign-made cars and trucks.",
    "link": "https://www.ndtv.com/world-news/canada-says-tariffs-on-us-auto-imports-take-effect-today-8119879",
    "timestamp": "2025-04-08T19:46:38Z"
  },
  {
    "title": "IRS to share info with ICE about some undocumented immigrant taxpayers",
    "description": "The Department of Homeland Security has sought to use tax filing information to find people in the U.S. without legal status in support of President Donald Trump’s mass deportation operation.",
    "link": "https://www.nbcnews.com/news/latino/irs-share-taxpayer-info-ice-immigrants-rcna200250",
    "timestamp": "2025-04-08T19:46:05Z"
  },
  {
    "title": "StanChart initiates coverage of XRP, projects $12.5 price by end of Trump’s term",
    "description": "Standard Chartered has initiated coverage of XRP with a sharply bullish outlook, predicting the digital asset could climb to $12.50 before the end of President Donald Trump’s current term. The bank said XRP’s expanding use cases, favorable legal trajectory, a…",
    "link": "https://cryptoslate.com/stanchart-initiates-coverage-of-xrp-projects-12-5-price-by-end-of-trumps-term/",
    "timestamp": "2025-04-08T19:45:36Z"
  },
  {
    "title": "What Europe Overlooks About the Trump Administration’s Defense Policy",
    "description": "Since the election of President Donald Trump, Europeans have been vocal in their criticism of nearly every U.S. policy issue, often professing that “transatlantic relations... Read More\nThe post What Europe Overlooks About the Trump Administration’s Defense P…",
    "link": "https://www.dailysignal.com/2025/04/08/what-europe-overlooks-about-trump-administrations-defense-policy/",
    "timestamp": "2025-04-08T19:45:00Z"
  },
  {
    "title": "Trump's 104% tariffs on China to take effect at midnight, quashing earlier market gains",
    "description": "The United States said on Tuesday that 104 per cent duties on imports from China will take effect shortly after midnight, even as the Trump administration moved to quickly start talks with other trading partners targeted by President Donald Trump's sweeping t…",
    "link": "https://www.cbc.ca/news/world/trump-tariffs-china-1.7505028",
    "timestamp": "2025-04-08T19:44:33Z"
  },
  {
    "title": "Rise in asylum seekers crossing into Quebec as U.S. revokes status of thousands of migrants",
    "description": "Canadian border officials say there has been a steady rise in the number of people seeking asylum at a border crossing south of Montreal.",
    "link": "https://www.cbc.ca/news/canada/montreal/rise-asylum-seekers-quebec-1.7505027",
    "timestamp": "2025-04-08T19:44:15Z"
  },
  {
    "title": "No proof Trump sold $2.3B in Truth Social stock before April 2 tariffs announcement",
    "description": "U.S. President Donald Trump sold $2.3 billion worth of his Truth Social stock the day before his \"Liberation Day\" tariffs announcement on April 2, 2025.",
    "link": "https://www.snopes.com//fact-check/trump-sells-truth-social-stock/",
    "timestamp": "2025-04-08T19:44:00Z"
  },
  {
    "title": "Supreme Court Rejects Trump's Claim That He Can Summarily Deport Anyone He Describes As an 'Alien Enemy'",
    "description": "The Supreme Court on Monday unanimously agreed that alleged members of the Venezuelan gang Tren de Aragua have a due process right to challenge President",
    "link": "https://reason.com/2025/04/08/the-supreme-court-rejects-trumps-claim-that-he-can-summarily-deport-anyone-he-describes-as-an-alien-enemy/",
    "timestamp": "2025-04-08T19:42:54Z"
  },
  {
    "title": "Idaho Cuts Public Health Benefits for Undocumented Immigrants",
    "description": "The restrictions on public benefits are part of a broader effort in Republican-led states to support Trump's crackdown on immigration.",
    "link": "https://time.com/7275849/idaho-ends-publicly-funded-vaccinations-for-undocumented-immigrants/",
    "timestamp": "2025-04-08T19:41:40Z"
  },
  {
    "title": "GOP Senator Facing Reelection Issues Big Tariff Warning",
    "description": "“Whose throat do I get to choke if this proves to be wrong?” Sen. Thom Tillis (R-N.C.) asked Tuesday during a hearing on President Donald Trump's tariffs.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs-tillis_n_67f559d1e4b05deb9be80e70",
    "timestamp": "2025-04-08T19:40:51Z"
  },
  {
    "title": "WATCH: What’s Changed at the Southern Border Under Trump",
    "description": "Since President Donald Trump returned to the Oval Office on Jan. 20, the number of illegal aliens crossing the southern border has plummeted. Not only... Read More\nThe post WATCH: What’s Changed at the Southern Border Under Trump appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/04/08/watch-what-changed-southern-border-trump/",
    "timestamp": "2025-04-08T19:40:20Z"
  },
  {
    "title": "Donald Trump Jr. to visit Romania right before contentious election (Politico)",
    "description": "Politico:\nDonald Trump Jr. to visit Romania right before contentious election  —  Donald Trump Jr., the eldest son of the United States president, will travel to Romania just six days before the first round of the country's controversially delayed presidentia…",
    "link": "https://www.memeorandum.com/250408/p111",
    "timestamp": "2025-04-08T19:40:10Z"
  },
  {
    "title": "'Very bad thing to say': Conservative pollster hits Trump after eyebrow-raising comment",
    "description": "Conservative pollster Frank Luntz, who appeared on CNN to talk about voter confidence in the GOP amid the current economy, appeared shocked at President Donald Trump's admonition that Americans not act \"stupid\" over his sweeping tariffs. \nOn Monday, as many p…",
    "link": "https://www.rawstory.com/trump-tariff-message/",
    "timestamp": "2025-04-08T19:40:07Z"
  },
  {
    "title": "CatholicVote president grilled on foreign aid, China at Vatican ambassador hearing",
    "description": "CatholicVote president Brian Burch speaks during a Senate Foreign Relations Committee hearing on his nomination for to be ambassador to the Holy See on Tuesday, April 8, 2025, on Capitol Hill in Washington, D.C. / Credit: AP Photo/Jacquelyn Martin\n\nWashington…",
    "link": "https://www.catholicnewsagency.com/news/263241/catholicvote-president-faces-questions-on-foreign-aid-china-at-confirmation-hearing",
    "timestamp": "2025-04-08T19:39:00Z"
  },
  {
    "title": "WATCH LIVE: Trump gives remarks at National Republican Congressional Committee dinner",
    "description": "Trump is scheduled to speak at a National Republican Congressional Committee dinner at 6:45 p.m. ET. Watch in the player above.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-gives-remarks-at-national-republican-congressional-committee-dinner",
    "timestamp": "2025-04-08T19:38:31Z"
  },
  {
    "title": "CIA Reviewing Its Authority for Lethal Force Use on Cartel Targets",
    "description": "\"Socalj\" for Borderland Beat From a CNN Exclusive Report The CIA is reviewing its authorities to use lethal force against drug cartels in Me...",
    "link": "https://www.borderlandbeat.com/2025/04/cia-reviewing-its-authority-for-lethal.html",
    "timestamp": "2025-04-08T19:38:00Z"
  },
  {
    "title": "House votes to block bipartisan push for proxy voting by new parents",
    "description": "GOP Rep. Anna Paulina Luna struck a deal with Speaker Mike Johnson after an intraparty spat brought the House floor to a halt last week.",
    "link": "https://www.nbcnews.com/politics/congress/house-votes-block-bipartisan-proxy-voting-push-new-parents-rcna200210",
    "timestamp": "2025-04-08T19:37:39Z"
  },
  {
    "title": "USA starts work on new nuke bomb; 24x more powerful than Hiroshima...",
    "description": "A POWERFUL nuclear weapon that’s 24 times stronger than the bomb that killed hundreds of thousands of people at Hiroshima is underway. The United States has ramped up production of the bone-c…",
    "link": "https://www.the-sun.com/news/13967576/us-iran-new-nuclear-weapon-sandia-national-laboratories/",
    "timestamp": "2025-04-08T19:37:36Z"
  },
  {
    "title": "25 Films to Help Understand the US Today",
    "description": "For The Guardian, the film critic Guy Lodge has complied a list of 25 films that “shed light on the US under Trump”. F",
    "link": "https://kottke.org/25/04/25-films-to-help-understand-the-us-today",
    "timestamp": "2025-04-08T19:37:36Z"
  },
  {
    "title": "TRUMP TO REPUBLICANS: SOAK THE RICH",
    "description": "TRUMP TO REPUBLICANS: SOAK THE RICH\r\n\n \n \n \n (Main headline, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TRADE SPAT GETS MESSY\r\nMUSK CALLS NAVARRO 'MORON'\r\n104% TARIFFS ON CHINA!",
    "link": "https://www.semafor.com/article/04/08/2025/trump-told-republican-senators-hes-open-to-raising-taxes-on-highest-earners",
    "timestamp": "2025-04-08T19:37:36Z"
  },
  {
    "title": "Jewish communities are wary of Trump's push to punish antisemitism",
    "description": "President Donald Trump has long portrayed himself as a steadfast friend and fierce protector of Jewish people the world over. Jewish Americans, however, have been mostly unconvinced, voting overwhelmingly for Democrat Kamala Harris in 2024, keeping with decad…",
    "link": "https://biztoc.com/x/2131152b22385377",
    "timestamp": "2025-04-08T19:37:07Z"
  },
  {
    "title": "Here’s How Much The Tariff War Has Cost Trump So Far",
    "description": "Tariffs seem like simple tools, but they often come with unexpected repercussions. Just ask the president, whose fortune dropped a half billion dollars in a few days.\nDonald Trump fired the first shots in a global trade war last week, inflicting damage on all…",
    "link": "https://biztoc.com/x/3f96c628ce2f26a7",
    "timestamp": "2025-04-08T19:36:58Z"
  },
  {
    "title": "New York street co-named after Chabad's Lubavitcher Rebbe",
    "description": "Honoree Rabbi Schneerson led the Chabad movement from 1951 until his death in 1994.",
    "link": "https://www.jpost.com/diaspora/article-849378",
    "timestamp": "2025-04-08T19:35:30Z"
  },
  {
    "title": "10-year Treasury yield rises back above 4% despite tariff threat to growth",
    "description": "The benchmark 10-year Treasury yield climbed back above the 4% level on Monday, even as President Donald Trump’s tariffs sparked fears of an economic slowdown.",
    "link": "https://www.nbcnews.com/business/economy/10-year-treasury-yield-rises-back-4-tariff-threat-growth-rcna200297",
    "timestamp": "2025-04-08T19:34:04Z"
  },
  {
    "title": "Pro-Israel evangelical leader calls on Trump to tariff Tucker Carlson for pro-Iran post",
    "description": "Pro-Israel activist and evangelical leader Laurie Cardoza-Moore called on US President Donald Trump on Tuesday to place a tariff on conservative media personality Tucker Carlson's show after he tweeted in support of Iran. “Tucker Carlson is acting like a fore…",
    "link": "https://freerepublic.com/focus/f-chat/4309760/posts",
    "timestamp": "2025-04-08T19:32:12Z"
  },
  {
    "title": "This Supreme Court Decision Is A Sign Of Bad Things To Come",
    "description": "It is a warning that constitutional rights may be scant protection against being disappeared into a foreign prison.",
    "link": "https://www.huffpost.com/entry/supreme-court-alien-enemies-act_n_67f56408e4b046bb946e0242",
    "timestamp": "2025-04-08T19:31:52Z"
  },
  {
    "title": "Nvidia AI servers coming from Mexico could be partially exempt from Trump's tariffs",
    "description": "The technology industry is still grappling with the aftermath of the new economic policy imposed by the US administration on its traditional partners and competitors. Meanwhile, analysts are trying to determine whether some of the most popular tech stocks cou…",
    "link": "https://www.techspot.com/news/107465-nvidia-ai-servers-coming-mexico-could-partially-exempt.html",
    "timestamp": "2025-04-08T19:31:00Z"
  },
  {
    "title": "Musk calls Trump adviser 'dumber than bricks' as tariff blowback escalates",
    "description": "Elon Musk calls Donald Trump's top trade adviser a \"moron\", escalating tensions over tariffs within the US president's inner sanctum, as some White House officials indicate deals could be on the table.",
    "link": "https://www.abc.net.au/news/2025-04-09/elon-musk-peter-navarro-donald-trump-trade-tariffs/105154190",
    "timestamp": "2025-04-08T19:28:18Z"
  },
  {
    "title": "National Park Service restores original Harriet Tubman, Underground Railroad webpage",
    "description": "The National Park Service has reversed edits and restored content to its webpage about Harriet Tubman and the Underground Railroad in the wake of news reports and public backlash over the changes.",
    "link": "https://www.nbcnews.com/news/nbcblk/national-park-service-restores-original-harriet-tubman-underground-rai-rcna200298",
    "timestamp": "2025-04-08T19:27:46Z"
  },
  {
    "title": "Business Leaders Voice Concerns About Tariffs",
    "description": "Some business leaders are reportedly voicing concerns about tariffs after seeing the impact the policy has had on the stock market. They are doing so publicly after initially working through trade groups or in meetings with Trump administration officials, The…",
    "link": "https://www.pymnts.com/economy/2025/business-leaders-voice-concerns-about-tariffs/",
    "timestamp": "2025-04-08T19:26:50Z"
  },
  {
    "title": "Trump more like a 'soaring eagle' than lame duck with record number of executive orders, polling expert says",
    "description": "Harry Enten said during a CNN segment on Tuesday that Trump was like a \"soaring eagle\" due to his 111 executive orders since taking office, noting concerns he would be a lame duck.",
    "link": "https://www.foxnews.com/media/trump-more-like-soaring-eagle-than-lame-duck-record-number-executive-orders-polling-expert-says",
    "timestamp": "2025-04-08T19:26:41Z"
  },
  {
    "title": "Trump Set to Hit China With Sweeping 104% Tariffs",
    "description": "China pledged to retaliate against Donald Trump’s latest tariff threat and mobilized state organs to send a message of resilience, raising the risk of a prolonged trade war between the world’s two largest economies.\n“The US threat to escalate tariffs on China…",
    "link": "https://biztoc.com/x/4e03f96de90b7cd1",
    "timestamp": "2025-04-08T19:25:33Z"
  },
  {
    "title": "Elon Musk Says Peter Navarro Is 'Dumber Than a Sack of Bricks'",
    "description": "Imagine an alternate reality where President Donald Trump's top trade adviser was a bulging Hefty trash bag stuffed with discarded bricks. \nNo, really. Picture it. When Trump gathers his cabinet together for an important meeting, inexplicably, there is a larg…",
    "link": "https://biztoc.com/x/684f672c797abe08",
    "timestamp": "2025-04-08T19:25:30Z"
  },
  {
    "title": "Jewish communities are wary of Trump's push to punish antisemitism",
    "description": "While the White House expands its effort to criminalize actions it deems harmful to Jewish Americans, not everyone in those same communities are on board with the president's purported assistance.",
    "link": "https://theweek.com/politics/antisemitism-jewish-commities-trump-israel-universities-brown-columbia",
    "timestamp": "2025-04-08T19:25:29Z"
  },
  {
    "title": "Guns, God — and Blockchain: Christian nationalists build techno-theocracy in Appalachia",
    "description": "A group of Christian nationalist venture capitalists are constructing a \"techno-libertarian\" theocratic community in Tennessee, reported Mother Jones on Tuesday — in perhaps the latest sign of a new breed of right-wing politics establishing a physical presenc…",
    "link": "https://www.rawstory.com/christian-nationalism-2671692937/",
    "timestamp": "2025-04-08T19:23:57Z"
  },
  {
    "title": "Even Streaming Services Might Be Hurt by Trump’s Tariffs",
    "description": "President Trump’s tariffs don’t hit streamers like Netflix directly. But they could impact what streaming services release—and how much people are willing to pay for it.",
    "link": "https://www.wired.com/story/even-streaming-services-might-be-hurt-by-trumps-tariffs/",
    "timestamp": "2025-04-08T19:23:23Z"
  },
  {
    "title": "RISD International Student Has Visa Revoked, School President Says Reason Unclear",
    "description": "President Crystal Williams said the reason was unclear why the visa for the art school student was revoked by the US State Department.",
    "link": "https://www.artnews.com/art-news/news/risd-international-student-visa-revoked-1234735763/",
    "timestamp": "2025-04-08T19:23:07Z"
  },
  {
    "title": "Trump’s Ex Chief-of-Staff Mick Mulvaney Shreds ‘Notorious’ Peter Navarro on CNBC: ‘I Would Have Fired Him’",
    "description": "Mick Mulvaney shredded President Trump's senior counselor for trade and manufacturing Peter Navarro on CNBC Tuesday afternoon.\nThe post Trump’s Ex Chief-of-Staff Mick Mulvaney Shreds ‘Notorious’ Peter Navarro on CNBC: ‘I Would Have Fired Him’ first appeared o…",
    "link": "https://www.mediaite.com/tv/trumps-ex-chief-of-staff-mick-mulvaney-shreds-notorious-peter-navarro-on-cnbc-i-would-have-fired-him/",
    "timestamp": "2025-04-08T19:22:30Z"
  },
  {
    "title": "Trump Plants 'MAGAnolia' To Replace 200-Year-Old Historic White House Tree",
    "description": "US President Donald Trump planted a new sapling on Tuesday to replace a nearly 200-year-old tree at the White House -- dubbing it a &quot;MAGAnolia&quot; after his &quot;Make America Great Again&quot; slogan.",
    "link": "https://www.ndtv.com/world-news/trump-plants-maganolia-to-replace-200-year-old-historic-white-house-tree-8119811",
    "timestamp": "2025-04-08T19:21:33Z"
  },
  {
    "title": "New Universal theme park set to open in UK - with promise of 'billions' of pounds for the economy",
    "description": "A deal for a new Universal theme park in Bedfordshire has been confirmed, which Rachel Reeves says will bring \"billions\" to the economy and create thousands of jobs.",
    "link": "https://news.sky.com/story/new-universal-theme-park-set-to-open-in-uk-with-promise-of-billions-of-pounds-for-the-economy-13344696",
    "timestamp": "2025-04-08T19:21:00Z"
  },
  {
    "title": "US wine sellers worry as Trump tariffs set to hit Wednesday",
    "description": "Adam Williams, 57, owner of Ansley Wine Merchants in Atlanta, said he was bracing for the worst on Wednesday, as President Donald Trump's tariffs are set to ...",
    "link": "https://finance.yahoo.com/news/us-wine-sellers-worry-trump-192056661.html",
    "timestamp": "2025-04-08T19:20:56Z"
  },
  {
    "title": "Italy's Meloni says to visit US for tariff talks",
    "description": "ROME: Italy's Giorgia Meloni said Tuesday (Apr 8) she would visit Washington next week to talk to US President Donald Trump about tariffs, as the European Union seeks to avert an all-out",
    "link": "https://www.channelnewsasia.com/world/italys-meloni-says-visit-us-tariff-talks-5052796",
    "timestamp": "2025-04-08T19:20:00Z"
  },
  {
    "title": "Farmers, Not Bureaucrats, Deserve Control of California’s Water: A Farmer’s Call for Stability",
    "description": "Farmers are at the heart of California’s water wars, but you wouldn’t know it from reading The New York Times. A recent feature on the... Read More\nThe post Farmers, Not Bureaucrats, Deserve Control of California’s Water: A Farmer’s Call for Stability appeare…",
    "link": "https://www.dailysignal.com/2025/04/08/farmers-bureaucrats-deserve-control-californias-water-farmers-call-stability/",
    "timestamp": "2025-04-08T19:19:52Z"
  },
  {
    "title": "Tech analyst responds to Trump wanting Apple to make iPhones in U.S.: 'I don't think that's a thing'",
    "description": "Martin said Apple's costs would skyrocket if it began building its marquee product in the U.S.",
    "link": "https://www.cnbc.com/2025/04/08/tech-analyst-responds-to-trump-wanting-apple-to-make-iphones-in-us-i-dont-think-thats-a-thing.html",
    "timestamp": "2025-04-08T19:19:35Z"
  },
  {
    "title": "Mike Huckabee nomination advances in Senate, one step closer to becoming ambassador to Israel",
    "description": "The Senate moved closer to confirming Mike Huckabee as ambassador to Israel amid backlash over his past remarks on Palestinians and Trump’s vision for the Gaza Strip.",
    "link": "https://www.foxnews.com/politics/huckabee-nomination-clears-senate-hurdle-us-ambassador-israel",
    "timestamp": "2025-04-08T19:18:30Z"
  },
  {
    "title": "Press Secretary Says Trump Wasn’t Joking About Deporting U.S. Citizens",
    "description": "White House Press Secretary Karoline Leavitt waffled Tuesday when asked about Donald Trump’s threat to deport U.S. citizens to foreign prisons. \r\nDuring a press briefing, Leavitt was asked to explain Trump’s disturbingly enthusiastic response to Salvadoran Pr…",
    "link": "https://newrepublic.com/post/193751/donald-trump-press-secretary-deport-us-citizens",
    "timestamp": "2025-04-08T19:17:49Z"
  },
  {
    "title": "Meet the Elon Musk minions installed to continue work after his departure",
    "description": "As Elon Musk's days in federal government dwindle, he's leaving behind a cadre of his allies from the private sector to continue his work in the Department of Government Efficiency (DOGE) and elsewhere in the government.Donald Trump reportedly told administra…",
    "link": "https://www.rawstory.com/musk/",
    "timestamp": "2025-04-08T19:17:14Z"
  },
  {
    "title": "Farmers MIGHT Be Able To Get Their USDA Grants, If They Reject Satan And All His Wokes",
    "description": "Wokes like 'conserving soil' and 'crop rotation.'",
    "link": "https://www.wonkette.com/p/farmers-might-be-able-to-get-their",
    "timestamp": "2025-04-08T19:15:51Z"
  },
  {
    "title": "Vice President JD Vance Lights Up Mitch McConnell for Grand Display of 'Political Pettiness'",
    "description": "Vice President JD Vance lit up Sen. Mitch McConnell (R-KY) after the senator voted against the nomination of Elbridge Colby to serve as Under Secretary of Policy at the Defense Department, describing the move as a grand display of \"political pettiness.\"\nThe p…",
    "link": "https://www.breitbart.com/politics/2025/04/08/vice-president-jd-vance-lights-up-mitch-mcconnell-for-grand-display-of-political-pettiness/",
    "timestamp": "2025-04-08T19:15:23Z"
  },
  {
    "title": "Elon Musk Says Peter Navarro Is 'Dumber Than a Sack of Bricks'",
    "description": "Imagine an alternate reality where President Donald Trump's top trade adviser was a bulging Hefty trash bag stuffed with discarded bricks. No, really.",
    "link": "https://reason.com/2025/04/08/elon-musk-says-peter-navarro-is-dumber-than-a-sack-of-bricks/",
    "timestamp": "2025-04-08T19:15:04Z"
  },
  {
    "title": "Trump Faces New Deportation Challenge After Supreme Court Order (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nTrump Faces New Deportation Challenge After Supreme Court Order  —  President Donald Trump is facing a new challenge to his use of a wartime law to deport alleged Venezuelan gang members, less than a day after the US Supreme Court sid…",
    "link": "https://www.memeorandum.com/250408/p107",
    "timestamp": "2025-04-08T19:15:00Z"
  },
  {
    "title": "Wall Street gives up earlier gains as hopes wane for tariff delays, deals",
    "description": "Wall Street indexes fluctuated on Tuesday as hopes for tariff delays faded ahead of a looming deadline. Despite an initial rally, stocks wavered after the White House confirmed tariffs would proceed, causing investors to lose confidence. The Dow Jones Industr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-gives-up-earlier-gains-as-hopes-wane-for-tariff-delays-deals/articleshow/120104894.cms",
    "timestamp": "2025-04-08T19:13:54Z"
  },
  {
    "title": "Donald Trump to Hit China with 104% Tariffs as Xi Jinping Refuses to Halt Retaliatory Tariffs",
    "description": "President Donald Trump will slap 104-percent tariffs on China at midnight Tuesday after Xi Jinping refused to withdraw retaliatory tariffs placed on the United States.\nThe post Donald Trump to Hit China with 104% Tariffs as Xi Jinping Refuses to Halt Retaliat…",
    "link": "https://www.breitbart.com/politics/2025/04/08/donald-trump-to-hit-chin-104-tariffs-xi-jinping-refuses-halt-retaliatory-tariffs/",
    "timestamp": "2025-04-08T19:10:44Z"
  },
  {
    "title": "Trump Believes Apple Could Manufacture iPhones in the U.S.",
    "description": "U.S. President Donald Trump \"absolutely\" believes that Apple could manufacture its iPhones and other devices in the United States, Press Secretary Karoline Leavitt said today during a media briefing.\n\n\n\n\n\nLeavitt was asked whether Trump thought that iPhone ma…",
    "link": "https://www.macrumors.com/2025/04/08/trump-apple-us-iphone-manufacturing/",
    "timestamp": "2025-04-08T19:08:36Z"
  },
  {
    "title": "John Oliver Brutally Mocks Trump For ‘Shooting The Economy In The Dick’ With ‘Ridiculous’ Tariff Scheme",
    "description": "HBO host John Oliver brutally mocked President Donald Trump for \"shooting the economy in the dick\" with a tariff scheme based on a \"ridiculous\" formula.\nThe post John Oliver Brutally Mocks Trump For ‘Shooting The Economy In The Dick’ With ‘Ridiculous’ Tariff …",
    "link": "https://www.mediaite.com/news/john-oliver-brutally-mocks-trump-for-shooting-the-economy-in-the-dick-with-ridiculous-tariff-scheme/",
    "timestamp": "2025-04-08T19:08:28Z"
  },
  {
    "title": "Anthony Scaramucci Urges Dems To Bring ‘Lifelong Democrat’ Elon Musk ‘Back in the Tent’ After Trump Tariff Split",
    "description": "Anthony Scaramucci advised Democrats to bring Elon Musk \"back in the tent\" after the billionaire split with President Donald Trump on tariffs.\nThe post Anthony Scaramucci Urges Dems To Bring ‘Lifelong Democrat’ Elon Musk ‘Back in the Tent’ After Trump Tariff …",
    "link": "https://www.mediaite.com/tv/anthony-scaramucci-urges-dems-to-bring-lifelong-democrat-elon-musk-back-in-the-tent-after-trump-tariff-split/",
    "timestamp": "2025-04-08T19:08:17Z"
  },
  {
    "title": "UN chief rejects new Israeli plan to control Gaza aid",
    "description": "No aid delivered to Palestinian enclave since March 2nd, as Israel says it will not allow entry of supplies until Hamas releases hostages",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/08/un-chief-rejects-new-israeli-plan-to-control-gaza-aid/",
    "timestamp": "2025-04-08T19:07:05Z"
  },
  {
    "title": "Move over taco Tuesday! Tariff Tuesday is here",
    "description": "You may be wondering whether the prices of your go-to products, from avocados to smartphones, will be raised by tariffs in the coming weeks. We hear you! On the show today, Martha Gimbel, executive director of the Budget Lab at Yale, gives us a broad view of …",
    "link": "https://www.marketplace.org/episode/2025/04/08/move-over-taco-tuesday-tariff-tuesday-is-here",
    "timestamp": "2025-04-08T19:06:16Z"
  },
  {
    "title": "‘Truly a moron’: Watch Elon Musk torch key Trump official after he goes after Tesla",
    "description": "'Dumber than a sack of bricks'",
    "link": "https://www.wnd.com/2025/04/truly-a-moron-watch-elon-musk-torch-key-trump-official-after-he-goes-after-tesla/",
    "timestamp": "2025-04-08T19:05:57Z"
  },
  {
    "title": "If Trump Breaks the Economy, He Will Own It",
    "description": "By his aggressive pursuit of a destructive agenda, particularly on tariffs, Trump now bears the burden of American unhappiness with their government. ‘Wrong track’ voters won’t blame Joe Biden any longer.",
    "link": "http://nymag.com/intelligencer/article/if-trump-breaks-the-economy-he-will-own-it.html",
    "timestamp": "2025-04-08T19:05:51Z"
  },
  {
    "title": "DAVID BOSSIE: Only Trump Is Brave Enough For This Job",
    "description": "Aside from Congressional Democrats, there’s widespread agreement among the American people that the failed status quo must be confronted immediately.",
    "link": "https://dailycaller.com/2025/04/08/opinion-only-trump-is-brave-enough-for-this-job-david-bossie/",
    "timestamp": "2025-04-08T19:05:05Z"
  },
  {
    "title": "The Irish Times view on China and the US: Beijing takes the fight to Trump",
    "description": "The size of China’s economy and its position in manufacturing supply chains leave it in a stronger negotiating position with the US than many other countries",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/04/08/the-irish-times-view-on-china-and-the-us-beijing-takes-the-fight-to-trump/",
    "timestamp": "2025-04-08T19:05:00Z"
  },
  {
    "title": "High Court, Shin Bet chief and the fate of Israeli democracy",
    "description": "Why did so much of the country focus its attention on this hearing while there is an ongoing war in Gaza and while Netanyahu was on a high-stakes visit with US President Donald Trump?",
    "link": "https://www.jpost.com/israel-news/article-849398",
    "timestamp": "2025-04-08T19:04:08Z"
  },
  {
    "title": "US tech firms grapple with increasing uncertainty under Trump",
    "description": "The News\nUS President Donald Trump’s “Liberation Day” tariffs have escalated a burgeoning trade war that will spare few of America’s biggest tech companies: Giants like Apple and Amazon rely heavily on manufacturing and imports from China and elsewhere — both…",
    "link": "https://biztoc.com/x/bb26853ef752ded2",
    "timestamp": "2025-04-08T19:03:38Z"
  },
  {
    "title": "Donald Trump Jr. and Bettina Anderson strive to show their passion and compete with Tiger Woods and Vanessa Trump romance",
    "description": "Donald Trump Jr. and Bettina Anderson are putting their love on full display - and making headlines - as they continue to grow closer in the public eye. \nThe couple made a splash t",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/04/08/67f54a2aca4741133f8b457b.html",
    "timestamp": "2025-04-08T19:03:37Z"
  },
  {
    "title": "Trump Assassination Attempt Suspect Tries to Silence Eyewitness",
    "description": "As Trump attempted assassination suspect Ryan Routh tries to discredit a witness, prosecutors unveil a major new claim about him.",
    "link": "https://www.westernjournal.com/trump-assassination-attempt-suspect-tries-silence-eyewitness/",
    "timestamp": "2025-04-08T19:02:53Z"
  },
  {
    "title": "Karoline Leavitt Brings Receipts Of Dems Echoing Trump’s Concerns About Trade Policy",
    "description": "White House press sWhite House press secretary Karoline Leavitt brought receipts of prominent Democrats making the same critiques about trade policy.",
    "link": "https://dailycaller.com/2025/04/08/karoline-leavitt-receipts-dems-trump-trade-policy/",
    "timestamp": "2025-04-08T19:02:39Z"
  },
  {
    "title": "Tesla Supercharger damaged in possible explosion in Washington",
    "description": "A Tesla Supercharger station was severely damaged in a possible explosion in Lacey, Washington. The local police department is investigating the incident, along with the FBI, which has been probing a number of acts of vandalism involving Tesla. The Lacey Poli…",
    "link": "https://www.theverge.com/news/645378/tesla-supercharger-damaged-explosion-washington",
    "timestamp": "2025-04-08T19:00:44Z"
  },
  {
    "title": "The Trump administration withdrew 11 pieces of ADA guidance. How will it affect compliance?",
    "description": "President Donald Trump’s administration has withdrawn 11 pieces of guidance related to the Americans with Disabilities Act that helped stores, hotels and other businesses understand their obligation to the law.",
    "link": "https://www.news4jax.com/business/2025/04/08/the-trump-administration-withdrew-11-pieces-of-ada-guidance-how-will-it-affect-compliance/",
    "timestamp": "2025-04-08T19:00:40Z"
  },
  {
    "title": "Coal is dead and Trump’s executive order won’t revive it",
    "description": "Donald Trump is expected to sign executive orders today to resuscitate the US coal industry – here’s why this is a complete waste of time.\n\n\n\n more…",
    "link": "http://electrek.co/2025/04/08/coal-is-dead-and-trumps-executive-order-wont-revive-it/",
    "timestamp": "2025-04-08T19:00:11Z"
  },
  {
    "title": "DHS to Fine Illegal Aliens $998 a Day Who Defy Deportation Orders",
    "description": "\"Emails reviewed by Reuters show the White House has pressed U.S. Customs and Border Protection to handle the issue of penalties, property seizures for migrants who don't pay, and the sale of their assets.\"\nThe post DHS to Fine Illegal Aliens $998 a Day Who D…",
    "link": "https://legalinsurrection.com/2025/04/dhs-to-fine-illegal-aliens-998-a-day-who-defy-deportation-orders/",
    "timestamp": "2025-04-08T19:00:02Z"
  },
  {
    "title": "Dutton stood right where Albanese was three years ago, but with less success",
    "description": "Both the prime minister and the opposition leader hit their marks in the first debate but the opposition leader was under more pressure to perform after a truly horrendous week.",
    "link": "https://www.abc.net.au/news/2025-04-09/leaders-debate-sky-news-peter-dutton-anthony-albanese/105148158",
    "timestamp": "2025-04-08T19:00:00Z"
  },
  {
    "title": "Trump set to sign executive orders to boost US coal (Reuters)",
    "description": "Reuters:\nTrump set to sign executive orders to boost US coal  —  U.S. President Donald Trump will sign executive orders on Tuesday aiming to boost coal production, a senior White House official and two sources told Reuters, in his latest action that runs coun…",
    "link": "https://www.memeorandum.com/250408/p106",
    "timestamp": "2025-04-08T19:00:00Z"
  },
  {
    "title": "What college savers need to know about their 529 accounts as market roils",
    "description": "Families saving for their children's education in a 529 plan may be on edge amid recent market volatility. Financial experts share their tips.",
    "link": "https://www.cnbc.com/2025/04/08/529-college-savings-account-tips-as-market-roils.html",
    "timestamp": "2025-04-08T18:58:20Z"
  },
  {
    "title": "Homeland Security revokes legal status for migrants who entered U.S. using CBP One app",
    "description": "The Department of Homeland Security is telling migrants who entered the country using an online app to leave the United States immediately.",
    "link": "https://www.pbs.org/newshour/nation/homeland-security-revokes-legal-status-for-migrants-who-entered-u-s-using-cbp-one-app",
    "timestamp": "2025-04-08T18:56:51Z"
  },
  {
    "title": "Report: Justice Department to End ‘Regulation by Prosecution’ of Crypto-Related Activities",
    "description": "The U.S. Justice Department will reportedly limit its cryptocurrency enforcement efforts to the use of digital assets in crimes related to things like terrorism, drug cartels and fraud. Deputy Attorney General Todd Blanche said in a Monday (April 7) memo that…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/report-justice-department-to-end-regulation-by-prosecution-of-crypto-related-activities/",
    "timestamp": "2025-04-08T18:56:21Z"
  }
]