[
  {
    "title": "US envoy to visit Russia ahead of sanctions deadline",
    "description": "US envoy Steve Witkoff will meet Russian leadership in Moscow as US President Donald Trump's deadline to impose fresh sanctions over Russia's war in Ukraine looms.",
    "link": "https://www.rte.ie/news/ukraine/2025/0806/1527105-russia-ukraine/",
    "timestamp": "2025-08-05T23:52:02Z"
  },
  {
    "title": "Texas ignited a gerrymandering war. We will all pay the price.",
    "description": "Redistricting reform could die as it becomes another polarizing and partisan blood sport.David Daley is author of “Ratf**ked: Why Your Vote Doesn’t Count” and “Antidemocratic: Inside the Far Right’s 50-Year Plot to Control American Elections.”The 2026 midterm…",
    "link": "https://freerepublic.com/focus/f-news/4332911/posts",
    "timestamp": "2025-08-05T23:49:35Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs’ Attorneys Contacted Trump Administration About Potential Pardon, Report Says",
    "description": "Trump has said Combs’ “hostility” toward him during the 2024 election makes pardoning the rapper “more difficult to do.”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/05/sean-diddy-combs-attorneys-contacted-trump-administration-about-potential-pardon-report-says/",
    "timestamp": "2025-08-05T23:49:19Z"
  },
  {
    "title": "Diddy's Lawyer Confirms Trump Pardon Request, Says Rapper Is 'Hopeful'",
    "description": "A member of Sean “Diddy” Combs’ legal team is confirming claims they’ve approached Donald Trump’s administration in the hopes of securing a presidential pardon. “It’s my understanding that we’ve reached out and had conversations in reference to a pardon,” att…",
    "link": "https://www.usmagazine.com/celebrity-news/news/diddys-lawyer-confirms-pardon-request-to-donald-trump/#article",
    "timestamp": "2025-08-05T23:44:26Z"
  },
  {
    "title": "‘South Park’ Tells ICE to ‘Eat a Bag of Dicks’ After Co-Opting Cartoon to Recruit Agents",
    "description": "A DHS spokesperson thanked South Park for \"drawing attention to ICE law enforcement recruitment,\" even though the Trump administration called the show irrelevant",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/south-park-slams-ice-using-cartoon-recruit-officers-1235401409/",
    "timestamp": "2025-08-05T23:42:52Z"
  },
  {
    "title": "Biden's doctor thought cognitive tests were 'meaningless,' ex-aide Bruce Reed told investigators",
    "description": "Former Biden aide Bruce Reed told Congress that the former president's doctor viewed cognitive tests as ‘meaningless’ and that the campaign expected debate questions on mental acuity.",
    "link": "https://www.foxnews.com/politics/bidens-doctor-thought-cognitive-tests-were-meaningless-ex-aide-bruce-reed-told-investigators",
    "timestamp": "2025-08-05T23:42:10Z"
  },
  {
    "title": "Trump Threatens to Take Control of D.C. Unless Crime Is Addressed",
    "description": "President Donald Trump threatened to take \"federal control\" of Washington, D.C., unless the crime in the city was addressed and called for a change in D.C.'s law regarding prosecuting minors as adults.\nThe post Trump Threatens to Take Control of D.C. Unless C…",
    "link": "https://www.breitbart.com/politics/2025/08/05/trump-threatens-to-take-control-of-d-c-unless-crime-is-addressed/",
    "timestamp": "2025-08-05T23:41:05Z"
  },
  {
    "title": "'South Park' hurls DHS's own post back in its face as feud with Trump escalates",
    "description": "A social media spat escalated Tuesday between the satirical animated television show \"South Park\" and the Trump administration.In a post on X, the Department of Homeland Security used a South Park-style animation in a recruiting post, just days after South Pa…",
    "link": "https://www.rawstory.com/south-park/",
    "timestamp": "2025-08-05T23:39:59Z"
  },
  {
    "title": "Trump to fill Federal Reserve board vacancy by week’s end, says he’s considering four Chair candidates",
    "description": "U.S. President Donald Trump said on Tuesday he will decide on a nominee to fill a coming vacancy on the Federal Reserve’s Board of Governors by the end of the week, and had separately narrowed the possible replacements for Fed chair Jerome Powell to a short l…",
    "link": "https://biztoc.com/x/3d60dbe7b5b17f52",
    "timestamp": "2025-08-05T23:38:45Z"
  },
  {
    "title": "Social Security phasing out paper checks as Trump pushes payment overhaul",
    "description": "Less than 1% of beneficiaries still receive paper checks, which cost 50 cents each compared to 15 cents for electronic transfers.",
    "link": "https://nypost.com/2025/08/05/us-news/social-security-phasing-out-paper-checks-as-trump-pushes-payment-overhaul/",
    "timestamp": "2025-08-05T23:37:01Z"
  },
  {
    "title": "How Trump's secondary tariffs on Russia could hit the global economy",
    "description": "The sweeping secondary tariffs could cut the flow of Russian oil and gas to global markets.",
    "link": "https://www.bbc.com/news/articles/cwyp7lgyy4ro",
    "timestamp": "2025-08-05T23:36:18Z"
  },
  {
    "title": "Jasmine Crockett Churns Out the Charm",
    "description": "It’s funny that Democrat rhetoric so often centers on class, considering that they have no class. Representative Jasmine Crockett (D-TX), a prominent face of her party, was in Phoenix for a MoveOn rally on Sunday: “Listen, Donald Trump is a piece of sh*t. Oka…",
    "link": "https://moonbattery.com/jasmine-crockett-churns-out-the-charm/",
    "timestamp": "2025-08-05T23:35:20Z"
  },
  {
    "title": "Despite Trump's peace calls, Russian attacks on Ukraine double since inauguration",
    "description": "Missile and drone attacks on Ukraine are now higher than at any other point of the war, according to Ukrainian data.",
    "link": "https://www.bbc.com/news/articles/c5yl6eegv63o",
    "timestamp": "2025-08-05T23:35:07Z"
  },
  {
    "title": "Stay or go? Under Trump, dreams fade for Chinese who trekked to US",
    "description": "Migrants living in unease under President Trump have quietly begun to ask themselves: is America worth it?",
    "link": "https://www.bbc.com/news/articles/cd97e120xe5o",
    "timestamp": "2025-08-05T23:33:56Z"
  },
  {
    "title": "DOJ identifies 35 ‘sanctuary jurisdictions’ in immigration crackdown",
    "description": "The agency said the list of cities, counties, and states \"impede law enforcement and put American citizens at risk by design.\"The U.S. Department of Justice published a list of 35 so-called \"sanctuary jurisdictions\" on Tuesday, threatening legal action agains…",
    "link": "https://freerepublic.com/focus/f-news/4332906/posts",
    "timestamp": "2025-08-05T23:32:08Z"
  },
  {
    "title": "Veteran fund manager sends urgent 9-word message on stocks",
    "description": "The stock market has had a rally for the ages since President Donald Trump backed off some tariffs in early April, clearing the way for trade negotiations with major trading partners.\nThe S&P 500 marched over 25% higher since hitting a tariff-fueled low on Ap…",
    "link": "https://biztoc.com/x/44ffa74ad29de800",
    "timestamp": "2025-08-05T23:27:31Z"
  },
  {
    "title": "Brazil's Bolsonaro arrested, adding to tensions with Trump",
    "description": "Summary Bolsonaro under house arrest for breaking restraining orders Trump called Bolsonaro's Supreme Court trial a \"witch hunt\" U.S. sanctioned Brazil Supreme Court judge issuing orders BRASILIA, Aug 4 (Reuters) - Brazil's Supreme Court put former President …",
    "link": "https://freerepublic.com/focus/f-news/4332905/posts",
    "timestamp": "2025-08-05T23:26:59Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump Lookalike From ‘South Park’ Reveals That Footage Was Shot Years Ago",
    "description": "It’s not every day that a professional Kim Jong Un lookalike gets in touch, but that’s exactly how this story started. Howard X Lee, who has previously collaborated with Donald Trump lookalike Dennis Alan in a musical lounge act in Hong Kong, reached out to B…",
    "link": "https://brobible.com/culture/article/exclusive-donald-trump-lookalike-from-south-park-reveals-that-footage-was-shot-years-ago/",
    "timestamp": "2025-08-05T23:26:43Z"
  },
  {
    "title": "Whitmer meets with Trump to ask for relief on tariffs, Medicaid cuts",
    "description": "This was the third meeting between Trump and Whitmer, a Democratic governor, since April.",
    "link": "https://www.cbsnews.com/news/gretchen-whitmer-meets-trump-tariffs-medicaid/",
    "timestamp": "2025-08-05T23:26:41Z"
  },
  {
    "title": "‘South Park’ Trolls Donald Trump’s DHS Ahead Of ICE Barbie Episode: “Wait, So We ARE Relevant?”",
    "description": "South Park continues to aim at the Donald Trump administration and is firing back amid claims the animated series is not relevant anymore. The Comedy Central series opened Season 27 mocking Trump and has not stopped since. An upcoming episode will parody Depa…",
    "link": "http://deadline.com/2025/08/south-park-trolls-donald-trump-dhs-ice-barbie-1236479471/",
    "timestamp": "2025-08-05T23:25:07Z"
  },
  {
    "title": "'I think it’s wrong': Mike Lawler defies Trump over GOP's election-rigging scheme",
    "description": "Rep. Mike Lawler (R-NY) came out against Texas Republicans' effort to redraw their congressional map to give themselves five extra seats in an interview with CNN's Jake Tapper on Friday.Lawler, a swing-district Republican who has largely backed President Dona…",
    "link": "https://www.rawstory.com/mike-lawler-2673861669/",
    "timestamp": "2025-08-05T23:24:27Z"
  },
  {
    "title": "Sean 'Diddy' Combs has reached out to Trump about pardon, source says",
    "description": "The defense team for Sean “Diddy” Combs has reached out to President Donald Trump seeking a pardon after his conviction on prostitution-related offenses, a source close to the legal team told NBC News on Tuesday",
    "link": "https://www.nbcnews.com/news/us-news/sean-diddy-combs-trump-pardon-rcna223282",
    "timestamp": "2025-08-05T23:24:26Z"
  },
  {
    "title": "Exclusive--Breitbart’s Alex Marlow: ‘Deeply Engaged Conservative Movement’ Crucial for Beating Left’s Lawfare, Winning the Culture War",
    "description": "The conservative movement must be \"robust, charismatic, [and] deeply engaged\" to win the culture war and wage a long campaign against the radical left's use of lawfare, Breitbart News Editor-in-Chief Alex Marlow said at the Young America’s Foundation (YAF) Na…",
    "link": "https://www.breitbart.com/politics/2025/08/05/breitbarts-alex-marlow-deeply-engaged-conexclusive-breitbarts-alex-marlow-deeply-engaged-conservative-movement-crucial-for-beating-lefts-lawfare-winning-the-cult/",
    "timestamp": "2025-08-05T23:23:15Z"
  },
  {
    "title": "'Safeguards? What Safeguards?': Grok's New 'Spicy Mode' Makes Nude Taylor Swift Deepfakes",
    "description": "Grok Imagine—a generative artificial intelligence tool developed by Elon Musk's xAI—has rolled out a \"spicy mode\" that is under fire for creating deepfake images on demand, including nudes of superstar Taylor Swift that's prompting calls for guardrails on the…",
    "link": "https://www.commondreams.org/news/taylor-swift-nude-deepfakes",
    "timestamp": "2025-08-05T23:20:16Z"
  },
  {
    "title": "Administrator Loeffler Leads Presidential Delegation to the Republic of Poland",
    "description": "The delegation will attend the inauguration of President-elect Karol Nawrocki The delegation will attend the inauguration of President-elect Karol Nawrocki",
    "link": "https://www.globenewswire.com/news-release/2025/08/05/3127978/0/en/Administrator-Loeffler-Leads-Presidential-Delegation-to-the-Republic-of-Poland.html",
    "timestamp": "2025-08-05T23:20:00Z"
  },
  {
    "title": "Hunter Biden Says Trump's Laptop Obsession Is Just Another Epstein Distraction",
    "description": "In a new interview, the former first son called the president’s strategy predictable, if not exhausting.",
    "link": "https://www.huffpost.com/entry/hunter-biden-laptop-trump-epstein-distractioin_n_6892608be4b07e7958a0df42",
    "timestamp": "2025-08-05T23:19:57Z"
  },
  {
    "title": "Judge Rules Rocky Mountain Wolves Wrongly Denied Endangered Species Protections",
    "description": "Conservationists cautiously celebrated a U.S. judge's Tuesday ruling that the federal government must reconsider its refusal to grant protections for gray wolves in the Rocky Mountains, as killing regimes in Idaho, Montana, and Wyoming put the species at risk…",
    "link": "https://www.commondreams.org/news/are-gray-wolves-endangered",
    "timestamp": "2025-08-05T23:19:36Z"
  },
  {
    "title": "Ghislaine Maxwell, in DOJ interview, said nothing that would be harmful to Trump: Sources",
    "description": "During her nine hours speaking with Deputy Attorney General Todd Blanche last month, Ghislaine Maxwell said nothing during the interview that would be harmful to President Donald Trump, telling Blanche that Trump had never done anything in her presence that w…",
    "link": "https://freerepublic.com/focus/f-news/4332904/posts",
    "timestamp": "2025-08-05T23:19:01Z"
  },
  {
    "title": "Swiss president rushes to US to avert steep tariffs",
    "description": "Switzerland's president was in Washington on Tuesday in a last-minute push to stop steep new tariffs, but with no appointment to plead her case to US...",
    "link": "https://www.yahoo.com/news/articles/swiss-president-rushes-us-avert-120840790.html",
    "timestamp": "2025-08-05T23:18:42Z"
  },
  {
    "title": "‘We reviewed the science’: RFK Jr. cancels $500 million in mRNA research",
    "description": "After COVID-era failures, HHS will instead prioritize 'safer, broader' vaccine strategies",
    "link": "https://www.wnd.com/2025/08/we-reviewed-science-rfk-jr-cancels-500-million/",
    "timestamp": "2025-08-05T23:17:25Z"
  },
  {
    "title": "Trump says JPMorgan Chase, Bank of America rejected him as a customer",
    "description": "Key PointsPresident Donald Trump said Tuesday that the two largest U.S. banks previously rejected him as a customer, reviving claims that conservative clients were being unfairly denied accounts. Trump told CNBC’s “Squawk Box” in a wide-ranging interview that…",
    "link": "https://freerepublic.com/focus/f-chat/4332902/posts",
    "timestamp": "2025-08-05T23:16:34Z"
  },
  {
    "title": "Indiana Prepping 'Speedway Slammer' Similar to 'Alligator Alcatraz'",
    "description": "DHS is preparing another ICE detention facility as deportation efforts continue.",
    "link": "https://www.newsweek.com/indiana-prepping-speedway-slammer-similar-alligator-alcatraz-2109393",
    "timestamp": "2025-08-05T23:13:29Z"
  },
  {
    "title": "Woody Allen compares Epstein to Dracula in newly unearthed letter",
    "description": "The director and regular dinner guest of Epstein's said he could see the sex trafficker \"sleeping in damp Earth\"",
    "link": "https://www.salon.com/2025/08/05/woody-allen-compares-epstein-to-dracula-in-newly-unearthed-letter/",
    "timestamp": "2025-08-05T23:11:23Z"
  },
  {
    "title": "Washington Post ‘fact checker’ throws in the towel",
    "description": "Mr. Kessler had it in for people who favored the reasonable theory that COVID-19 leaked from a lab",
    "link": "https://www.wnd.com/2025/08/washington-post-fact-checker-throws-towel/",
    "timestamp": "2025-08-05T23:10:02Z"
  },
  {
    "title": "‘Irrelevant’ ‘South Park’ Claps Back at ICE for Contradicting the President",
    "description": "Why is ICE using a desperate, fourth-rate comedy show to try and boost its recruiting numbers?",
    "link": "https://www.cracked.com/article_47741_irrelevant-south-park-claps-back-at-ice-for-contradicting-the-president.html",
    "timestamp": "2025-08-05T23:10:00Z"
  },
  {
    "title": "Music teacher who rejected transgender students' chosen names can sue Indiana school",
    "description": "(Reuters) -A divided U.S. appeals court revived a lawsuit against an Indiana school district by a former high school music teacher who objected to being...",
    "link": "https://www.yahoo.com/news/articles/music-teacher-rejected-transgender-students-230903736.html",
    "timestamp": "2025-08-05T23:09:03Z"
  },
  {
    "title": "San Diego County among Justice Department’s 35 'sanctuary' jurisdictions",
    "description": "The county was only one of four counties singled out by the DOJ for policies, laws or regulations that \"impede enforcement of federal immigration laws.\"",
    "link": "https://www.kpbs.org/news/politics/2025/08/05/san-diego-county-among-justice-departments-35-sanctuary-jurisdictions",
    "timestamp": "2025-08-05T23:07:55Z"
  },
  {
    "title": "Toppled Confederate statue in DC to be replaced in line with Trump’s executive order",
    "description": "The Albert Pike statue restoration is targeted for October.",
    "link": "https://www.bostonherald.com/2025/08/05/dc-confederate-statue/",
    "timestamp": "2025-08-05T23:06:26Z"
  },
  {
    "title": "Maggie Haberman Says Trump Believes His Own Falsehoods on Jobs Numbers: ‘He Has Convinced Himself’",
    "description": "CNN's Maggie Haberman said she believes President Donald Trump has managed to convince himself that the underwhelming jobs numbers released last week were \"faked,\" despite zero evidence supporting the claim.\nThe post Maggie Haberman Says Trump Believes His Ow…",
    "link": "https://www.mediaite.com/media/tv/maggie-haberman-says-trump-believes-his-own-falsehoods-on-jobs-numbers-he-has-convinced-himself/",
    "timestamp": "2025-08-05T23:04:54Z"
  },
  {
    "title": "Trump says it is ‘up to Israel’ whether to occupy all of Gaza",
    "description": "US president's comments come amid warnings that expanding Israeli operations would be 'catastrophic' for Palestinians.",
    "link": "https://www.aljazeera.com/news/2025/8/5/trump-says-it-is-up-to-israel-whether-to-occupy-all-of-gaza",
    "timestamp": "2025-08-05T23:04:22Z"
  },
  {
    "title": "BREAKING: DOJ Requests DNI Documents Following Gabbard Criminal Referral On Russiagate Conspiracy",
    "description": "The request suggests that the DOJ is aggressively pursuing options to hold accountable any federal officials for their actions on Russiagate.The U.S. Department of Justice (DOJ) has sent the Office of the Director of National Intelligence (ODNI) a request for…",
    "link": "https://freerepublic.com/focus/f-chat/4332900/posts",
    "timestamp": "2025-08-05T23:03:38Z"
  },
  {
    "title": "The world is watching as Brazil reacts to the US",
    "description": "President Lula’s reaction to Trump is of interest to other economies like Mexico and Canada. World leaders are watching closely how he fares in the standoff.\nThe post The world is watching as Brazil reacts to the US first appeared on LSE Business Review.",
    "link": "https://blogs.lse.ac.uk/businessreview/2025/08/06/the-world-is-watching-brazil-react-to-the-us/",
    "timestamp": "2025-08-05T23:01:00Z"
  },
  {
    "title": "Noem Announces ‘Speedway Slammer’ Illegal-Alien Detention Center in Indiana",
    "description": "A new illegal-alien detention center is opening in Indiana, Homeland Security Secretary Kristi Noem announced Tuesday.   “Coming soon to Indiana: The Speedway Slammer,” Noem... Read More\nThe post Noem Announces ‘Speedway Slammer’ Illegal-Alien Detention Cente…",
    "link": "https://www.dailysignal.com/2025/08/05/noem-announces-speedway-slammer-illegal-alien-detention-center-indiana/",
    "timestamp": "2025-08-05T23:01:00Z"
  },
  {
    "title": "‘South Park’ Claps Back at Homeland Security for Using New Episode to Promote ICE",
    "description": "The reaction comes after the official U.S. Department of Homeland Security posted the promo to their X account Tuesday\nThe post ‘South Park’ Claps Back at Homeland Security for Using New Episode to Promote ICE appeared first on TheWrap.",
    "link": "https://www.thewrap.com/south-park-homeland-security-ice-promotion-x/",
    "timestamp": "2025-08-05T22:59:34Z"
  },
  {
    "title": "Coinbase Debuts ‘Embedded’ Crypto Wallet for Developers—With Stablecoin Focus",
    "description": "The new product gives builders the infrastructure to seamlessly integrate wallets into their apps.",
    "link": "https://decrypt.co/333681/coinbase-debuts-embedded-crypto-wallet-for-developers-with-stablecoin-focus",
    "timestamp": "2025-08-05T22:57:51Z"
  },
  {
    "title": "Michigan Gov. Whitmer makes another White House visit to meet with Trump",
    "description": "The Democrat is taking a more diplomatic approach than in his first term.",
    "link": "https://www.bostonherald.com/2025/08/05/michigan-gov-whitmer-another-trump-visit/",
    "timestamp": "2025-08-05T22:55:38Z"
  },
  {
    "title": "Trump says pharmaceutical tariffs could reach 250% in future",
    "description": "President Donald Trump provided new details about his plan to impose tariffs on foreign-made pharmaceuticals, but the White House says nothing is final.",
    "link": "https://www.wmur.com/article/trump-pharmaceutical-tariffs-could-reach-250-in-future/65607038",
    "timestamp": "2025-08-05T22:55:30Z"
  },
  {
    "title": "Asian Traders Cautious as US Data Clouds Fed Path: Markets Wrap",
    "description": "Asian stocks may struggle for direction on Wednesday after Wall Street erased gains, as weakening US services data raised concerns about the Federal Reserve’s policy path.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-traders-cautious-as-us-data-clouds-fed-path-markets-wrap",
    "timestamp": "2025-08-05T22:53:29Z"
  },
  {
    "title": "The Knock-Down, Drag-‘Em-Out Texas Redistricting Showdown Heats Up",
    "description": "An old-fashioned Western showdown is happening in Texas right now.  On one side you have Texas House Democrats who fled the state over the weekend to stop Texas Republicans from carrying out Trump’s orders to redraw the state’s maps. And Texas governor Greg A…",
    "link": "https://www.motherjones.com/politics/2025/08/the-knock-down-drag-em-out-texas-redistricting-showdown-heats-up/",
    "timestamp": "2025-08-05T22:51:12Z"
  },
  {
    "title": "U.S. stocks close lower on weak economic data, tariff concerns",
    "description": "NEW YORK, Aug. 5 (Xinhua) -- U.S. stocks fell on Tuesday as investors reacted to disappointing economic data and U.S. President Donald Trump's new tariff threats. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/06/us-stocks-close-lower-on-weak-economic-data-tariff-concerns",
    "timestamp": "2025-08-05T22:51:00Z"
  },
  {
    "title": "The ripple effects of the BLS firing (Jacob Wendler/Politico)",
    "description": "Jacob Wendler / Politico:\nThe ripple effects of the BLS firing  —  SLIPPERY SLOPE — The good news for Donald Trump is that the Jeffrey Epstein saga didn't dominate the news cycle today.  The bad news?  Four days after firing the head of the Bureau of Labor St…",
    "link": "https://www.memeorandum.com/250805/p112",
    "timestamp": "2025-08-05T22:50:00Z"
  },
  {
    "title": "'Speedway Slammer' is red state's answer to 'Alligator Alcatraz' detention facility",
    "description": "Governor Braun partners with Trump administration to create 1,000-bed immigration detention center at Miami Correctional Center funded by federal reconciliation bill.",
    "link": "https://www.foxnews.com/politics/speedway-slammer-red-states-answer-alligator-alcatraz-detention-facility",
    "timestamp": "2025-08-05T22:48:53Z"
  },
  {
    "title": "Trump says pharmaceutical tariffs could reach 250% in future",
    "description": "President Donald Trump provided new details about his plan to impose tariffs on foreign-made pharmaceuticals, but the White House says nothing is final.",
    "link": "https://www.wisn.com/article/trump-pharmaceutical-tariffs-could-reach-250-in-future/65607038",
    "timestamp": "2025-08-05T22:45:28Z"
  },
  {
    "title": "Trump says pharmaceutical tariffs could reach 250% in future",
    "description": "President Donald Trump provided new details about his plan to impose tariffs on foreign-made pharmaceuticals, but the White House says nothing is final.",
    "link": "https://www.kcci.com/article/trump-pharmaceutical-tariffs-could-reach-250-in-future/65607038",
    "timestamp": "2025-08-05T22:45:02Z"
  },
  {
    "title": "RFK Jr. pulls $500 million in funding for vaccine development",
    "description": "The 22 projects, all using mRNA technology, are led by some of the nation's leading pharmaceutical companies to prevent flu, COVID-19 and H5N1 infections.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_4b43a2e1-4839-500f-843e-f370823c8fd7.html",
    "timestamp": "2025-08-05T22:45:00Z"
  },
  {
    "title": "Biden’s Doctor Shunned Cognitive Test, According to ‘Politburo’ Member",
    "description": "The same doctor who invoked his Fifth Amendment right against self incrimination told former President Joe Biden’s inner circle that a cognitive test would be... Read More\nThe post Biden’s Doctor Shunned Cognitive Test, According to ‘Politburo’ Member appeare…",
    "link": "https://www.dailysignal.com/2025/08/05/bidens-doctor-shunned-cognitive-test-according-to-politburo-member/",
    "timestamp": "2025-08-05T22:45:00Z"
  },
  {
    "title": "Trump says pharmaceutical tariffs could reach 250% in future",
    "description": "President Donald Trump provided new details about his plan to impose tariffs on foreign-made pharmaceuticals, but the White House says nothing is final.",
    "link": "https://www.wbaltv.com/article/trump-pharmaceutical-tariffs-could-reach-250-in-future/65607038",
    "timestamp": "2025-08-05T22:44:55Z"
  },
  {
    "title": "Trump says pharmaceutical tariffs could reach 250% in future",
    "description": "President Donald Trump provided new details about his plan to impose tariffs on foreign-made pharmaceuticals, but the White House says nothing is final.",
    "link": "https://www.wcvb.com/article/trump-pharmaceutical-tariffs-could-reach-250-in-future/65607038",
    "timestamp": "2025-08-05T22:44:32Z"
  },
  {
    "title": "Venezuelan Little League team granted exemption to President Trump's travel ban after senior team denied entry",
    "description": "The team needed a sign-off from Secretary of State Marco Rubio to enter the country for the Little League World Series.",
    "link": "https://sports.yahoo.com/mlb/breaking-news/article/venezuelan-little-league-team-granted-exemption-to-president-trumps-travel-ban-after-senior-team-denied-entry-224402602.html",
    "timestamp": "2025-08-05T22:44:02Z"
  },
  {
    "title": "Brazil's Supreme Court caught off guard by order to arrest Bolsonaro, sources say",
    "description": "SAO PAULO (Reuters) -Brazil's Supreme Court was caught off-guard by Justice Alexandre de Moraes' decision late on Monday to place former President Jair Bolsonaro under house arrest, two sources at the court told Reuters on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/06/brazil039s-supreme-court-caught-off-guard-by-order-to-arrest-bolsonaro-sources-say",
    "timestamp": "2025-08-05T22:44:00Z"
  },
  {
    "title": "Jim Cramer rebuffs Wall Street's 'knee-jerk negativity' after Tuesday's pullback",
    "description": "CNBC's Jim Cramer on Tuesday pushed back against a downbeat sentiment he's felt on Wall Street, saying \"kneejerk negativity\" is making investors lose money.",
    "link": "https://www.cnbc.com/2025/08/05/jim-cramer-rebuffs-wall-streets-kneejerk-negativity-after-tuesdays-pullback.html",
    "timestamp": "2025-08-05T22:43:00Z"
  },
  {
    "title": "Trump to Settle on New Fed Governor by End of Week",
    "description": "President Donald Trump said he would select a new Federal Reserve governor before the end of the week. At a White House event Tuesday in... Read More\nThe post Trump to Settle on New Fed Governor by End of Week appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/05/trump-settle-new-fed-governor-end-week/",
    "timestamp": "2025-08-05T22:42:58Z"
  },
  {
    "title": "President Trump To Sign Executive Order Penalizing Banks For Debanking Crypto Firms",
    "description": "U.S. President Trump is reportedly planning to sign an executive order that would shield crypto firms and conservatives from alleged discriminatory banking practices.",
    "link": "https://zycrypto.com/president-trump-to-sign-executive-order-penalizing-banks-for-debanking-crypto-firms/",
    "timestamp": "2025-08-05T22:40:22Z"
  },
  {
    "title": "RFK Jr. Makes Major Vaccine Announcement",
    "description": "Kennedy urged HHS to move away from mRNA vaccines and \"invest in better solutions,\" but did not specify alternatives.",
    "link": "https://www.newsweek.com/rfk-trump-admin-vaccines-mrna-covid-flu-2109400",
    "timestamp": "2025-08-05T22:39:30Z"
  },
  {
    "title": "WATCH: Trump says FBI 'may have to' help Texas round up AWOL Dem lawmakers",
    "description": "The FBI “may have to\" round up a group of Democratic lawmakers who fled Texas to avoid voting on the state’s proposed redistricting map, President Donald Trump told reporters.",
    "link": "https://www.foxnews.com/politics/watch-trump-says-fbi-may-have-to-help-texas-round-up-awol-dem-lawmakers",
    "timestamp": "2025-08-05T22:39:12Z"
  },
  {
    "title": "Donald Trump’s attack on US labour statistics agency spooks investors - Financial Times",
    "description": "Donald Trump’s attack on US labour statistics agency spooks investorsFinancial Times Trump Fired America’s Economic Data Collector. History Shows the Perils.The New York Times Trump redoubles attack on federal jobs data, calls numbers politicalThe Washington …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178583536",
    "timestamp": "2025-08-05T22:36:19Z"
  },
  {
    "title": "Supreme Court Killed Universal Injunctions In Name Only",
    "description": "Supreme Court Killed Universal Injunctions In Name Only\n \nAuthored by Benjamin Weingarten via RealClearInvestigations,\nOn June 27, the Supreme Court handed President Donald Trump what he hailed as a “GIANT WIN,” finding that lower courts had “likely” overstep…",
    "link": "https://biztoc.com/x/5fcd4846c2a3a34a",
    "timestamp": "2025-08-05T22:31:50Z"
  },
  {
    "title": "Trump Says 4 Candidates Running For Fed Chair—As Treasury Secretary Bessent ‘Does Not Want’ Role",
    "description": "Topline\nThe list of candidates to succeed Fed Chair Jerome Powell has been cut down to four after Treasury Secretary Scott Bessent dropped out of consideration, President Donald Trump said Tuesday amid his growing feud with Powell over the agency’s decision t…",
    "link": "https://biztoc.com/x/76c1f9398dc220af",
    "timestamp": "2025-08-05T22:31:38Z"
  },
  {
    "title": "Russia weighs Ukraine air-truce offer to Trump without ending war",
    "description": "The Kremlin is weighing options for a concession that could include an air truce with Ukraine to try to head off the threat of secondary U.S. sanctions.",
    "link": "https://www.japantimes.co.jp/news/2025/08/06/world/politics/russia-ukraine-air-truce-trump/",
    "timestamp": "2025-08-05T22:31:00Z"
  },
  {
    "title": "22nd Amendment: Can Trump Run for a Third Term?",
    "description": "there are legal avenues for him to become president again, Rossi said. \"Only under Donald Trump would you have a president that even speculates, ponders or contemplates serving a third term. We're in a different world.\"",
    "link": "https://freerepublic.com/focus/f-chat/4332895/posts",
    "timestamp": "2025-08-05T22:29:09Z"
  },
  {
    "title": "Trump’s visa havoc strands students weeks before classes start",
    "description": "International students are struggling to secure visas as the Trump administration aggressively moves to curtail immigration.",
    "link": "https://www.japantimes.co.jp/news/2025/08/06/world/politics/trump-visa-students-stranded/",
    "timestamp": "2025-08-05T22:29:00Z"
  },
  {
    "title": "Trump suggests there will be mandatory gender testing for women's sports at 2028 LA Olympics",
    "description": "Trump suggested 'very strong' genetic testing will be implemented for women's sports at the 2028 Los Angeles Olympics following his executive order.",
    "link": "https://www.foxnews.com/sports/trump-suggests-mandatory-gender-testing-womens-sports-2028-la-olympics",
    "timestamp": "2025-08-05T22:27:49Z"
  },
  {
    "title": "ICE Is Already Using Tomorrow’s ‘South Park’ Episode As A Recruitment Tool",
    "description": "The Right has begun reappropriating ‘South Park’s attacks for their marketing campaigns",
    "link": "https://www.cracked.com/article_47738_ice-is-already-using-tomorrows-south-park-episode-as-a-recruitment-tool.html",
    "timestamp": "2025-08-05T22:25:00Z"
  },
  {
    "title": "WATCH: President Trump predicts who will replace him in 2028",
    "description": "'I also think we have incredible people, some of the people on the stage right here'",
    "link": "https://www.wnd.com/2025/08/watch-president-trump-predicts-who-will-replace-him/",
    "timestamp": "2025-08-05T22:24:01Z"
  },
  {
    "title": "Hulk Hogan funeral in Largo: ‘Even in heaven, he sold out again’",
    "description": "LARGO — Friends and colleagues of Terry Bollea, the pro wrestler better known to the world as Hulk Hogan, gathered Tuesday evening to say goodbye to the...",
    "link": "https://www.tampabay.com/life-culture/2025/08/05/hulk-hogan-memorial-indian-rocks-largo/",
    "timestamp": "2025-08-05T22:24:00Z"
  },
  {
    "title": "Michigan Sen. Elissa Slotkin urges fellow Democrats to 'go nuclear' in redistricting fight",
    "description": "Sen. Elissa Slotkin says Democrats should “go nuclear” to counter Republicans’ redistricting push in Texas and other red states and go on offense against Trump in general.",
    "link": "https://www.nbcnews.com/politics/2026-election/michigan-sen-elissa-slotkin-democrats-nuclear-redistricting-texas-rcna223158",
    "timestamp": "2025-08-05T22:23:44Z"
  },
  {
    "title": "Trump's firing of the labor statistics chief could lead to a financial crisis",
    "description": "Donald Trump’s firing of Bureau of Labor Statistics Commissioner Erika McEntarfer after a disappointing jobs report is clearly not good news.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-economy-jobs-bls-firing-rcna223206",
    "timestamp": "2025-08-05T22:23:01Z"
  },
  {
    "title": "Scotland approved new wind farm after Trump's visit, but not exactly off the coast from his golf course",
    "description": "Scotland approved the construction of 300 wind turbines off the coast of Trump's golf course days after he complained about the nation's wind farms and called them ugly.",
    "link": "https://www.snopes.com//fact-check/scotland-wind-farm-trump-golf/",
    "timestamp": "2025-08-05T22:21:00Z"
  },
  {
    "title": "Trump narrows Fed chair candidates to four, excluding Treasury Secretary Bessent",
    "description": "Trump narrows Fed chair candidates to four, excluding Treasury Secretary Bessent\nWASHINGTON (AP) — President Donald Trump said Tuesday that he’s whittled down his list of potential Federal Reserve chair candidates to four as he considers a successor to Jerome…",
    "link": "https://biztoc.com/x/25fad10e4cb0dfb4",
    "timestamp": "2025-08-05T22:20:47Z"
  },
  {
    "title": "Woody Allen compared Jeffrey Epstein's Manhattan home to 'Castle Dracula' in birthday letter: report",
    "description": "Woody Allen allegedly compared Jeffrey Epstein's Manhattan townhouse to \"Castle Dracula\" in an undated birthday letter praising the financier's dinner parties.",
    "link": "https://www.foxnews.com/entertainment/woody-allen-compared-jeffrey-epsteins-manhattan-home-castle-dracula-birthday-letter-report",
    "timestamp": "2025-08-05T22:20:26Z"
  },
  {
    "title": "Rwanda says it will take migrant deportees from the US",
    "description": "Rwanda has said it agreed to help the Trump administration in its deportation push, by taking in up to 250 migrants. Under the deal, Rwanda could offer resettlement to those eligible. The government of Rwanda said on Tuesday that it had agreed to receive migr…",
    "link": "https://www.dw.com/en/rwanda-says-it-will-take-migrant-deportees-from-the-us/a-73541686",
    "timestamp": "2025-08-05T22:20:00Z"
  },
  {
    "title": "Trump says he wants strong testing to keep transgender athletes out of women’s sports at 2028 Olympics | CNN",
    "description": "President Donald Trump on Tuesday signed an executive order to establish a White House task force to coordinate the federal government’s preparations for the 2028 Summer Olympic Games in Los Angeles, using the occasion to rail against transgender athletes’ pa…",
    "link": "https://www.cnn.com/2025/08/05/sport/trump-task-force-la-olympics-spt",
    "timestamp": "2025-08-05T22:19:07Z"
  },
  {
    "title": "Texas Democrats refuse to go back to the state as they face threats of arrest and expulsion",
    "description": "Texas Democrats say they're not worried about the bribery allegations, daily fines and arrest warrants being levelled against them as they hunker down in nearby states to delay a vote on a Trump-backed redistricting plan that would bolster Republican power.",
    "link": "https://www.cbc.ca/radio/asithappens/texas-redistricting-fight-1.7601600",
    "timestamp": "2025-08-05T22:16:24Z"
  },
  {
    "title": "Trump Predicts Who Will Replace Him In 2028",
    "description": "President Donald Trump said on Tuesday that Vice President JD Vance is \"probably favored\" to carry the MAGA mantle in 2028.",
    "link": "https://dailycaller.com/2025/08/05/donald-trump-jd-vance-maga-2028/",
    "timestamp": "2025-08-05T22:14:15Z"
  },
  {
    "title": "Charlamagne Tha God Blesses Donald Trump With Donkey of The Day Following Truth Social Rant",
    "description": "It didn't take long, but on Monday, Charlamagne Tha God kicked off The Breakfast Club's work week by responding to Felon 47.",
    "link": "https://hiphopwired.com/playlist/charlamagne-tha-god-labels-donald-trump-donkey-of-the-day-reactions/",
    "timestamp": "2025-08-05T22:13:36Z"
  },
  {
    "title": "Trump appoints task force to ensure ‘safe, seamless’ LA Olympics",
    "description": "President Donald Trump creates LA28 task force to prepare for the first Olympics in the US since the 2002 Winter Games.",
    "link": "https://www.aljazeera.com/sports/2025/8/5/trump-appoints-taskforce-to-ensure-safe-seamless-la-olympics",
    "timestamp": "2025-08-05T22:10:38Z"
  },
  {
    "title": "Here's Your Reminder Donald Has Always Been A Nasty Creeper",
    "description": "Meidas Touch called this newly \"unearthed footage,\" but Mother Jones had this back in 2016 prior to our first Trump nightmare: Watch Donald Trump Say He Hired a Female Employee Just Because She Was Hot:\nWhile campaigning for president, Donald Trump often boas…",
    "link": "https://crooksandliars.com/2025/08/heres-your-reminder-trump-has-always-been",
    "timestamp": "2025-08-05T22:10:19Z"
  }
]