[
  {
    "title": "THE ORIGIN — 1. — The virus possesses a biological characteristic that is not found in nature. (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nTHE ORIGIN  —  1.  —  The virus possesses a biological characteristic that is not found in nature.  —  2.  —  Data shows that all COVID-19 cases stem from a single introduction into humans.  This runs contrary to p…",
    "link": "https://www.memeorandum.com/250418/p56",
    "timestamp": "2025-04-18T15:50:02Z"
  },
  {
    "title": "'Not doing this right': Analyst says Trump admin legal move will 'come back to haunt them'",
    "description": "NBC News reporter Ken Dilanian and legal analyst Danny Cevallos think that an appeal to the Fourth Circuit Court of Appeals backfired against President Donald Trump. Speaking to MSNBC on Friday, Dilanian addressed the case involving Kilmar Ábrego García, a Ma…",
    "link": "https://www.rawstory.com/trump-deportations-2671800181/",
    "timestamp": "2025-04-18T15:49:44Z"
  },
  {
    "title": "Faculty-Led Movement Opposing Trump Attack on Universities Builds Steam",
    "description": "Weeks after the Rutgers University Senate passed a resolution to form a \"mutual defense compact\"—aiming to band together with other universities to protect from the Trump administration's attacks on academic freedom and free speech—university communities' pus…",
    "link": "https://www.commondreams.org/news/campus-protest",
    "timestamp": "2025-04-18T15:49:22Z"
  },
  {
    "title": "Fox & Friends Hosts Spar Over Drinks Served at Meeting Between Dem Senator and Kilmar Abrego Garcia",
    "description": "The Fox & Friends curvy couch devolved into a brief beverage squabble Friday as they reported on the meeting between Sen. Chris Van Hollen (D-MD) and deported migrant Kilmar Abrego Garcia in El Salvador the day before. At the center of the debate were two dri…",
    "link": "https://www.mediaite.com/news/fox-friends-hosts-spar-over-drinks-served-at-meeting-between-dem-senator-and-kilmar-abrego-garcia/",
    "timestamp": "2025-04-18T15:47:52Z"
  },
  {
    "title": "Trump Studying Whether Removing Powell Is Option",
    "description": "\"Donald Trump is studying whether he’s able to fire Federal Reserve Chairman Jerome Powell, his top economist said Friday, a day after the president publicly criticized the head of the central bank for not moving",
    "link": "https://politicalwire.com/2025/04/18/trump-studying-whether-removing-powell-is-option/",
    "timestamp": "2025-04-18T15:47:42Z"
  },
  {
    "title": "Zelensky delays elections by extending martial law",
    "description": "The Ukrainian leader has signed a decree to prolong martial law and general mobilization in the country until August Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615970-zelensky-ukraine-martial-law-extension/",
    "timestamp": "2025-04-18T15:47:08Z"
  },
  {
    "title": "Trump Plans to Blatantly Ignore Supreme Court on Deportations",
    "description": "Donald Trump’s administration is moving forward with more expedited deportations under the Alien Enemies Act—despite a Supreme Court ruling that requires it to provide advance notice and a court hearing. \r\nIn a new filing Friday, lawyers for the American Civi…",
    "link": "https://newrepublic.com/post/194140/donald-trump-plans-ignore-supreme-court-deportations",
    "timestamp": "2025-04-18T15:45:47Z"
  },
  {
    "title": "Trump Elevates Christian Prayer and Power",
    "description": "New York Times: \"From the moment Donald J. Trump was re-elected to the presidency, his conservative Christian supporters have rejoiced in a second chance for their values to have power. And now, week after week,",
    "link": "https://politicalwire.com/2025/04/18/trump-elevates-christian-prayer-and-power/",
    "timestamp": "2025-04-18T15:45:22Z"
  },
  {
    "title": "‘I never issued a criminal contempt citation in 19 ½ years on the bench’ – a former federal judge looks at the ‘relentless bad behavior’ of the Trump administration in court",
    "description": "‘It’s one big show of contempt for the court,’ says a former federal judge about the Trump administration’s handling of two cases related to its deportation of noncitizens to an El Salvador prison.",
    "link": "https://theconversation.com/i-never-issued-a-criminal-contempt-citation-in-19-1-2-years-on-the-bench-a-former-federal-judge-looks-at-the-relentless-bad-behavior-of-the-trump-administration-in-court-254877",
    "timestamp": "2025-04-18T15:44:29Z"
  },
  {
    "title": "Trump Admin Studying Options To Fire US Federal Reserve Chief: White House",
    "description": "US President Donald Trump and his administration are studying whether dismissing independent Federal Reserve chief Jerome Powell is an option, his top White House economic aide said Friday.",
    "link": "https://www.ndtv.com/world-news/trump-admin-studying-options-to-fire-us-federal-reserve-chief-white-house-8197985",
    "timestamp": "2025-04-18T15:44:03Z"
  },
  {
    "title": "150 Economists Sign Letter Opposing Trump's Protectionist Agenda",
    "description": "Only time will tell if America heeds their clarion call.",
    "link": "https://reason.com/2025/04/18/150-economists-sign-letter-opposing-trumps-protectionist-agenda/",
    "timestamp": "2025-04-18T15:42:36Z"
  },
  {
    "title": "Trump floats US-Europe meeting as Vance visits Italy for 2nd day of talks on tariffs",
    "description": "U.S. Vice President JD Vance met with Italian Premier Giorgia Meloni in Rome to discuss tariffs, with a potential U.S.-Europe summit on the horizon during President Trump's upcoming visit to Italy. Meloni aims to bridge the gap between the Trump administratio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-floats-us-europe-meeting-as-vance-visits-italy-for-2nd-day-of-talks-on-tariffs/articleshow/120411627.cms",
    "timestamp": "2025-04-18T15:42:10Z"
  },
  {
    "title": "Trump admin studying option to fire Fed chair Powell: White House",
    "description": "The Trump administration is exploring the possibility of dismissing Federal Reserve chief Jerome Powell, according to a top White House economic aide. This consideration follows President Trump's recent criticism of Powell, whom he accuses of political maneuv…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-admin-studying-option-to-fire-fed-chair-powell-white-house/articleshow/120411600.cms",
    "timestamp": "2025-04-18T15:41:29Z"
  },
  {
    "title": "Wife Of Man Wrongly Deported To El Salvador 'Won't Stop Fighting Until He Returns Home'",
    "description": "Jennifer Vasquez Sura, the wife of deported man Kilmar Abrego Garcia, said she was overwhelmed after seeing a photo of her husband alive in El Salvador.",
    "link": "https://www.huffpost.com/entry/wife-of-immigrant-wrongly-deported-to-el-salvador-wont-stop-fighting-until-he-returns-home_n_6802606fe4b058dd5962e1b0",
    "timestamp": "2025-04-18T15:40:21Z"
  },
  {
    "title": "Maggie Haberman: Trump Sources Trying Really Hard To Keep Trump From Firing Fed Chair",
    "description": "Maggie Haberman told anchor Kaisie Hunt that Trump's senior White House aides are engaged in an effort to keep him from trying to fire Jerome Powell.\nThe post Maggie Haberman: Trump Sources Trying Really Hard To Keep Trump From Firing Fed Chair first appeared…",
    "link": "https://www.mediaite.com/news/maggie-haberman-trump-sources-trying-really-hard-to-keep-trump-from-firing-fed-chair/",
    "timestamp": "2025-04-18T15:40:08Z"
  },
  {
    "title": "Worrying signs for Donald Trump! Is US Dollar is losing its mojo? Unprecedented sell-off, sharp decline hint so",
    "description": "Dollar dominance also allows the U.S. to push around other countries like Venezuela, Iran and Russia by locking them out of a currency they need to buy and sell with others.",
    "link": "https://economictimes.indiatimes.com/news/international/us/worrying-signs-for-donald-trump-is-us-dollar-is-losing-its-mojo-unprecedented-sell-off-sharp-decline-hint-so/articleshow/120411382.cms",
    "timestamp": "2025-04-18T15:39:03Z"
  },
  {
    "title": "Trump admin studying option to fire independent finance chief, White House confirms",
    "description": "The US president does not technically have direct authority to fire Federal Reserve governors.",
    "link": "https://www.thejournal.ie/trump-fed-reserve-6682185-Apr2025/",
    "timestamp": "2025-04-18T15:38:43Z"
  },
  {
    "title": "Trump to fast-track permitting for 10 mining projects across US",
    "description": "USA-TRUMP/MINING (UPDATE 1, PIX):UPDATE 1-Trump to fast-track permitting for 10 mining projects across US",
    "link": "https://www.livemint.com/companies/news/trump-to-fast-track-permitting-for-10-mining-projects-across-us-11744990626492.html",
    "timestamp": "2025-04-18T15:37:05Z"
  },
  {
    "title": "Trump wants Powell out of the Fed. Waiting in the wings is Kevin Warsh",
    "description": "President Donald Trump on Thursday again made clear his disdain for Federal Reserve Chair Jerome Powell, going so far as to say the central banker’s “termination can’t come fast enough” and saying in an Oval Office event that Powell will “be out of there real…",
    "link": "https://biztoc.com/x/e77ee0c372c18edc",
    "timestamp": "2025-04-18T15:35:27Z"
  },
  {
    "title": "‘Ripple effect:’ In US, anti-immigrant policy strains child and eldercare",
    "description": "Immigrants are scared to show up to work, exacerbating a worker shortage in key industries.",
    "link": "https://www.aljazeera.com/economy/2025/4/18/ripple-effect-in-us-anti-immigrant-policy-strains-child-and-eldercare",
    "timestamp": "2025-04-18T15:33:58Z"
  },
  {
    "title": "The federal government is taking over Penn Station’s massive renovations plans",
    "description": "Governor Kathy Hochul is in full support of the plan.",
    "link": "https://www.timeout.com/newyork/news/the-federal-government-is-taking-over-penn-stations-massive-renovations-plans-041825",
    "timestamp": "2025-04-18T15:33:37Z"
  },
  {
    "title": "FEMA Isn't Ready for Disaster Season, Workers Say",
    "description": "Instability, cuts, and a looming sense of dread have FEMA employees unsure the agency is ready for hurricanes, fires, and floods. “We are being set up for a really, really bad situation,\" says one.",
    "link": "https://www.wired.com/story/fema-isnt-ready-for-disaster-season-workers-say-hurricanes-fires-floods/",
    "timestamp": "2025-04-18T15:33:08Z"
  },
  {
    "title": "The Abrego Garcia case pulls Democrats into the immigration debate Trump wants to have",
    "description": "This is playing out as Democrats double down on their defense of Abrego Garcia.",
    "link": "https://www.denverpost.com/2025/04/18/deportation-error-democrats/",
    "timestamp": "2025-04-18T15:32:59Z"
  },
  {
    "title": "The Abrego Garcia case pulls Democrats into the immigration debate Trump wants to have",
    "description": "This is playing out as Democrats double down on their defense of Abrego Garcia.",
    "link": "https://www.bostonherald.com/2025/04/18/deportation-error-democrats/",
    "timestamp": "2025-04-18T15:32:59Z"
  },
  {
    "title": "Will the Global Economy Stall?",
    "description": "Although it is premature to claim that a worldwide recession is around the corner, the breakdown of global trade and elevated policy uncertainty will undoubtedly suppress growth in the months ahead. Each country will need to prepare for the worst by conservin…",
    "link": "https://www.project-syndicate.org/commentary/global-economy-tracking-indices-show-a-mixed-picture-by-eswar-prasad-and-caroline-smiltneks-2025-04",
    "timestamp": "2025-04-18T15:31:14Z"
  },
  {
    "title": "MLB Commissioner Rob Manfred meets with President Trump at White House",
    "description": "Baseball Commissioner Rob Manfred met this week at the White House with President Donald Trump.",
    "link": "https://www.stltoday.com/sports/professional/mlb/article_721968e6-0caa-5316-9636-b30a5d60da92.html",
    "timestamp": "2025-04-18T15:30:00Z"
  },
  {
    "title": "Ahead of Fire and Hurricane Season, FEMA Moves to End a Major Disaster-Preparedness Program",
    "description": "In an internal FEMA memo, the Trump administration announced its plans to dismantle the government’s largest climate adaptation initiative.",
    "link": "https://inthesetimes.com/article/climate-change-fema-ends-disaster-adaption-program",
    "timestamp": "2025-04-18T15:30:00Z"
  },
  {
    "title": "10,000 pages of records about Robert F. Kennedy's 1968 assassination are released, on Trump's order",
    "description": "Approximately 10,000 pages of records concerning the 1968 assassination of Senator Robert F. Kennedy have been released, fulfilling President Trump's order to disclose national secrets. The U.S. National Archives and Records Administration posted 229 files to…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/10000-pages-of-records-about-robert-f-kennedys-1968-assassination-are-released-on-trumps-order/articleshow/120411252.cms",
    "timestamp": "2025-04-18T15:28:59Z"
  },
  {
    "title": "Iran has ‘doubts’ about US intentions ahead of nuclear talks",
    "description": "Iran's FM expresses concern about US motivations but says negotiations will take place in Rome this weekend.",
    "link": "https://www.aljazeera.com/news/2025/4/18/iran-has-doubts-about-us-intentions-ahead-of-nuclear-talks",
    "timestamp": "2025-04-18T15:28:52Z"
  },
  {
    "title": "Marco Rubio Has Lost Himself",
    "description": "The Secretary of State once asked, “If America stops leading, who will fill the vacuum we leave behind?” Anyone know if he's got an answer?",
    "link": "https://www.vanityfair.com/news/story/marco-rubio-ukraine-russia-pepfar",
    "timestamp": "2025-04-18T15:26:36Z"
  },
  {
    "title": "CM Punk Adamant Elon Musk Crowd Wave Was Nazi Salute, 'Don't Gaslight Me'",
    "description": "CM Punk is sure Elon Musk was giving a Nazi salute at that Donald Trump inauguration event back in January ... and the WWE Superstar is adamant there's no amount of \"gaslighting\" the billionaire can do to sway his opinion. The 46-year-old wrestler…\n Permalink",
    "link": "https://www.tmz.com/2025/04/18/cm-punk-blasts-elon-musk/",
    "timestamp": "2025-04-18T15:25:47Z"
  },
  {
    "title": "Huckabee visits iconic holy site in Israel, delivers Trump's prayer for peace",
    "description": "U.S. Ambassador to Israel Mike Huckabee delivered a prayer from President Donald Trump to a major holy site in Jerusalem as Passover ends and Easter approaches.",
    "link": "https://www.foxnews.com/politics/huckabee-visits-iconic-holy-site-israel-delivers-trumps-prayer-peace",
    "timestamp": "2025-04-18T15:23:39Z"
  },
  {
    "title": "ChatGPT Declares Trump's Physical Results 'Virtually Impossible': 'Usually Only Seen in Elite Bodybuilders'",
    "description": "A viral TikTok shows ChatGPT calling Trump's reported weight and height \"virtually impossible,\" fueling online jokes and renewed scrutiny over his health.",
    "link": "https://www.medicaldaily.com/chatgpt-declares-trumps-physical-results-virtually-impossible-usually-only-seen-elite-473412",
    "timestamp": "2025-04-18T15:20:59Z"
  },
  {
    "title": "Iran wants guarantees Trump will not quit a new nuclear pact, Tehran official says",
    "description": "Iran has conveyed to the United States its willingness to accept certain limitations on uranium enrichment during recent talks, seeking firm guarantees that a future U.S. administration will not abandon the agreement. Scheduled for Rome, the second round of d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-wants-guarantees-trump-will-not-quit-a-new-nuclear-pact-tehran-official-says/articleshow/120410948.cms",
    "timestamp": "2025-04-18T15:19:13Z"
  },
  {
    "title": "Industry Expert Predicts Bitcoin’s Non-Stop Rocket Surge To $1 Million If the U.S. Purchases One Million BTC",
    "description": "An executive at the Bitcoin Policy Institute has suggested that the Bitcoin price could reach $1M if the U.S Govt. were to announce a plan to acquire 1 million BTC.",
    "link": "https://zycrypto.com/industry-expert-predicts-bitcoins-non-stop-rocket-surge-to-1-million-if-the-u-s-purchases-one-million-btc/",
    "timestamp": "2025-04-18T15:18:58Z"
  },
  {
    "title": "Trump administration studying option to fire Fed chair Powell: White House",
    "description": "US President Donald Trump and his administration are studying whether dismissing independent Federal Reserve chief Jerome Powell is an option, his top White House economic aide said. \"The president and his team will continue to study that matter,\" National Ec…",
    "link": "https://freerepublic.com/focus/f-news/4311805/posts",
    "timestamp": "2025-04-18T15:16:18Z"
  },
  {
    "title": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump",
    "description": "economists worry the dramatic dollar drop shows a loss of confidence in the U.S.",
    "link": "https://www.denverpost.com/2025/04/18/trump-tariffs-falling-dollar/",
    "timestamp": "2025-04-18T15:16:10Z"
  },
  {
    "title": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump",
    "description": "economists worry the dramatic dollar drop shows a loss of confidence in the U.S.",
    "link": "https://www.bostonherald.com/2025/04/18/trump-tariffs-falling-dollar/",
    "timestamp": "2025-04-18T15:16:10Z"
  },
  {
    "title": "Will Kamala Harris’ win 2026 California governor’s race? Here’s what a new poll reveals",
    "description": "A recent poll reveals divided opinions among Californians regarding a potential Kamala Harris run for governor in 2026. While Democratic voters show strong enthusiasm, Republicans express opposition. Policy influencers remain uncertain about her candidacy. Ha…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-kamala-harris-win-2026-california-governors-race-heres-what-a-new-poll-reveals/articleshow/120410369.cms",
    "timestamp": "2025-04-18T15:15:17Z"
  },
  {
    "title": "White House Gives Update After Trump Urges 'Termination' of Fed's Powell",
    "description": "On Thursday, Trump blasted Powell for not cutting interest rates and once again suggested he could remove him as Fed Chair.",
    "link": "https://www.newsweek.com/white-house-gives-update-after-trump-urges-termination-feds-powell-2061491",
    "timestamp": "2025-04-18T15:15:15Z"
  },
  {
    "title": "Rachel Maddow Showcases How Resistance Against Trump Is Growing Nationwide | Video",
    "description": "\"It does have the effect of exposing the shambolic and slapdash and utterly incompetent behavior of the Trump administration,\" the MSNBC host says\nThe post Rachel Maddow Showcases How Resistance Against Trump Is Growing Nationwide | Video appeared first on Th…",
    "link": "https://www.thewrap.com/trump-resistance-nationwide-protests-rachel-maddow/",
    "timestamp": "2025-04-18T15:14:44Z"
  },
  {
    "title": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump",
    "description": "The dollar's recent steep decline is raising concerns about a potential loss of confidence in the U.S. economy due to President Trump's trade policies. This decline threatens the dollar's dominance as a safe haven and reserve currency, potentially leading to …",
    "link": "https://economictimes.indiatimes.com/news/international/business/strange-sell-off-in-the-dollar-raises-the-specter-of-investors-losing-trust-in-the-us-under-trump/articleshow/120410794.cms",
    "timestamp": "2025-04-18T15:13:45Z"
  },
  {
    "title": "National Archives releases 10,000 pages of records related to 1968 assassination of Robert F. Kennedy",
    "description": "The Friday release continues the disclosure of national secrets ordered by President Donald Trump. Director of National Intelligence Tulsi Gabbard says in a statement the RFK files' release will \"shine a long-overdue light on the truth.\"",
    "link": "https://biztoc.com/x/b6db867037d5ba89",
    "timestamp": "2025-04-18T15:13:14Z"
  },
  {
    "title": "US strikes on a Yemeni oil port kill 74 people, Houthis say, in deadliest attack of Trump campaign",
    "description": "Satellite images of the port showed destroyed tanks and vehicles as oil leaked into the Red Sea.",
    "link": "https://www.denverpost.com/2025/04/18/mideast-wars-yemen-strike/",
    "timestamp": "2025-04-18T15:13:10Z"
  },
  {
    "title": "US strikes on a Yemeni oil port kill 74 people, Houthis say, in deadliest attack of Trump campaign",
    "description": "Satellite images of the port showed destroyed tanks and vehicles as oil leaked into the Red Sea.",
    "link": "https://www.bostonherald.com/2025/04/18/mideast-wars-yemen-strike/",
    "timestamp": "2025-04-18T15:13:10Z"
  },
  {
    "title": "LVMH CEO says to blame Brussels for U.S.-EU tariff tensions",
    "description": "Bernard Arnault, the chairman and CEO of French luxury conglomerate LVMH, says to blame Brussels — the location of the EU headquarters — if tariff policies can’t be worked out with the U.S.Read more...",
    "link": "https://qz.com/bernard-arnault-lvmh-brussels-eu-trump-tariffs-1851776780",
    "timestamp": "2025-04-18T15:13:00Z"
  },
  {
    "title": "Cybertruck hits a speed bump: Tesla cuts back factory staffing and scales down output plans as sales nosedive and investor confidence plummets",
    "description": "Tesla faces challenges with its Cybertruck. Production targets are lowered due to weak sales. Some workers are moved to other lines like Model Y. Cybertruck sales dipped in the first quarter of 2025. Reliability issues and recalls add to the problems. A cheap…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cybertruck-hits-a-speed-bump-tesla-cuts-back-factory-staffing-and-scales-down-output-plans-as-sales-nosedive-and-investor-confidence-plummets/articleshow/120410070.cms",
    "timestamp": "2025-04-18T15:12:43Z"
  },
  {
    "title": "Financial Pundit Says India Should Follow US And Hold Bitcoin, SOL, And XRP In Strategic Reserve",
    "description": "Despite having one of the highest crypto adoption rates globally, India lacks a formal regulatory framework.",
    "link": "https://zycrypto.com/financial-pundit-says-india-should-follow-us-and-hold-bitcoin-sol-and-xrp-in-strategic-reserve/",
    "timestamp": "2025-04-18T15:12:41Z"
  },
  {
    "title": "Wall Street Journal Backs Fed Chair in — and Mocks Trump Over — Feud: ‘The Problem for Mr. Trump Is That Mr. Powell Spoke the Truth’",
    "description": "The Wall Street Journal backed Federal Reserve Chairman Jerome Powell in -- and mocked President Donald Trump over -- their feud in an editorial.\nThe post Wall Street Journal Backs Fed Chair in — and Mocks Trump Over — Feud: ‘The Problem for Mr. Trump Is That…",
    "link": "https://www.mediaite.com/news/wall-street-journal-backs-fed-chair-in-and-mocks-trump-over-feud-the-problem-for-mr-trump-is-that-mr-powell-spoke-the-truth/",
    "timestamp": "2025-04-18T15:12:09Z"
  },
  {
    "title": "Italy agrees with US to oppose 'discriminatory' tech taxes",
    "description": "WASHINGTON : Italy and the United States issued a joint statement against \"discriminatory\" taxes on digital services on Friday, in a possible signal Rome is moving away from a levy that has irked Washington.The statement came as Meloni held back-to-back trans…",
    "link": "https://www.channelnewsasia.com/business/italy-agrees-us-oppose-discriminatory-tech-taxes-5074581",
    "timestamp": "2025-04-18T15:11:56Z"
  },
  {
    "title": "The D Brief: State of Defense, service by service; US strikes Yemen port; DEI is out at DOD; Shakeup week for OSD; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/04/the-d-brief-april-18-2025/404679/",
    "timestamp": "2025-04-18T15:10:55Z"
  },
  {
    "title": "Al Sharpton holds ‘constructive and candid’ meeting with Target CEO over DEI initiatives",
    "description": "The CEO of Target met MSNBC host Rev. Al Sharpton as the latter's organization puts pressure on companies that previously scaled back DEI initiatives.",
    "link": "https://nypost.com/2025/04/18/media/al-sharpton-holds-constructive-and-candid-meeting-with-target-ceo-over-dei-initiatives/",
    "timestamp": "2025-04-18T15:10:26Z"
  },
  {
    "title": "After tariffs, Trump turns his gaze to universities",
    "description": "From deportation of foreign students to freezing funding, the US President is redeeming another poll promise",
    "link": "https://www.thehindubusinessline.com/opinion/after-tariffs-trump-turns-his-gaze-to-universities/article69465609.ece",
    "timestamp": "2025-04-18T15:09:34Z"
  },
  {
    "title": "Shapiro Declines To Back Schumer’s Call For Hate Crime Probe: 'It’s Not My Job’",
    "description": "The Pennsylvania governor, while giving a tour of his home's destruction, said he doesn’t think outside opinions about the arson attack are “helpful.”",
    "link": "https://www.huffpost.com/entry/josh-shapiro-arson-hate-crime-investigation_n_6802537de4b058dd5962e05e",
    "timestamp": "2025-04-18T15:09:08Z"
  },
  {
    "title": "Confidence in Congressional Democrats hits all time low in new poll",
    "description": "A new national poll shows that confidence in Democratic Party leaders in Congress has hit an all-time low. This as the party's favorable ratings have sunk to historic lows in other surveys",
    "link": "https://www.foxnews.com/politics/confidence-congressional-democrats-hits-all-time-low-new-poll",
    "timestamp": "2025-04-18T15:08:33Z"
  },
  {
    "title": "Nintendo has some good news and bad news for Switch 2 fans",
    "description": "Nintendo gave an update to its American customers on Friday— and it's a good news/bad news situation.",
    "link": "https://www.businessinsider.com/nintendo-switch-2-new-preorder-date-controller-accessories-price-increase-2025-4",
    "timestamp": "2025-04-18T15:07:59Z"
  },
  {
    "title": "Trade war puts US on ‘precipice’ of recession: Moody’s chief economist",
    "description": "The U.S. economy will likely begin to shrink “unless policy takes a very sharp turn here pretty quickly,” Moody’s Chief Economist Mark Zandi said.",
    "link": "https://www.cfodive.com/news/trade-war-puts-us-precipice-recession-moodys-chief-economist-Trump-tariffs-inflation-unemployment/745712/",
    "timestamp": "2025-04-18T15:05:00Z"
  },
  {
    "title": "‘We Are Not the Same:’ Trump Meets with Angel Mom as Chris Van Hollen Meets with Accused Wife Beater",
    "description": "While President Donald Trump met with Angel Mom Patty Morin, whose 37-year-old daughter Rachel Morin was murdered by an illegal alien MS-13 gang member in Maryland, Sen. Chris Van Hollen (D-MD) met in El Salvador with a deported illegal alien accused of being…",
    "link": "https://freerepublic.com/focus/f-news/4311802/posts",
    "timestamp": "2025-04-18T15:04:49Z"
  },
  {
    "title": "Anti-Trump protests in 50 US states: List of cities hosting rallies on Saturday",
    "description": "The 50501 Movement, meaning 50 protests, 50 states, 1 movement, is pushing back against what it called executive overreach from the Trump administration. Its organizing started on Reddit. Massive protests and rallies against President Donald Trump and his clo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/anti-trump-protests-in-50-us-states-list-of-cities-hosting-rallies-on-saturday/articleshow/120410442.cms",
    "timestamp": "2025-04-18T15:04:39Z"
  },
  {
    "title": "‘War On Coal Is Finally Over’: Energy Experts Say Trump Admin’s Deregulation Agenda Could Fuel Coal’s Revival",
    "description": "President Donald Trump has prioritized \"unleashing\" American energy and has axed several of what he considers to be burdensome regulations on the coal industry.",
    "link": "https://dailycaller.com/2025/04/18/energy-experts-trump-admin-deregulation-agenda-coal-revival/",
    "timestamp": "2025-04-18T15:03:38Z"
  },
  {
    "title": "Gov. Josh Shapiro details arson attack on his home and if he believes it was a hate crime in ABC interview",
    "description": "Pennsylvania Gov. Josh Shapiro detailed the arson attack on his home last week to NBC's News’ George Stephanopoulos during an interview at the governor's residence on Friday.",
    "link": "https://www.foxnews.com/media/gov-josh-shapiro-details-arson-attack-his-home-he-believes-hate-crime-abc-interview",
    "timestamp": "2025-04-18T15:03:32Z"
  },
  {
    "title": "Nintendo Announces New Switch 2 U.S. Preorder Date, Price Will Remain $449.99",
    "description": "Mark your calendars, U.S. Nintendo fans you can now officially preorder your Switch 2 on April 24.",
    "link": "https://hiphopwired.com/2681665/nintendo-switch-2-us-preorder-date-update-pricing-details/",
    "timestamp": "2025-04-18T15:03:28Z"
  },
  {
    "title": "Trump Demands The FED Fix His Stock Market Problem Or Else",
    "description": "Donald Trump told a press gaggle earlier today he's unhappy with Federal Reserve Chairman Jerome Powell and he'll \"be out of there\" if he doesn't lower interest rates NOW.\nTrump is scrambling to find a way to not destroy the US economy while still imposing hi…",
    "link": "https://crooksandliars.com/2025/04/trump-demands-fed-fix-his-stock-market",
    "timestamp": "2025-04-18T15:03:27Z"
  },
  {
    "title": "Trump’s 100 Days of Failure in Ukraine",
    "description": "Vladimir Putin and his negotiators have obviously succeeded in leading their US counterparts on, cynically voicing support for a peace process in Ukraine that they have no intention of pursuing. After many weeks of this, even the most dimwitted of negotiators…",
    "link": "https://www.project-syndicate.org/commentary/trump-100-days-of-failure-in-ukraine-by-carl-bildt-2025-04",
    "timestamp": "2025-04-18T15:03:13Z"
  },
  {
    "title": "Americans split on whether Russia is ‘enemy’ – poll",
    "description": "50% of Americans view Russia as an enemy, down from 61% in 2024, a survey by the Pew Research Center suggests Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615967-american-poll-russia-enemy/",
    "timestamp": "2025-04-18T15:02:31Z"
  },
  {
    "title": "Trump Administration Opens Pacific Remote Islands Marine Monument to Commercial Fishing",
    "description": "President Donald Trump signed a proclamation on Thursday opening the Pacific Remote Islands Marine National Monument (PRIMNM) to commercial fishing, marking a substantial change in U.S. fishing policy. The proclamation...",
    "link": "https://gcaptain.com/trump-administration-opens-pacific-remote-islands-marine-monument-to-commercial-fishing/",
    "timestamp": "2025-04-18T15:01:49Z"
  },
  {
    "title": "Elon Musk's DOGE savings faces backlash as $1 billion vanishes overnight amidst cost-cutting claims",
    "description": "Elon Musk's DOGE savings just took a major hit as nearly $1 billion vanished overnight from the agency’s website. The Department of Government Efficiency, led by Musk, removed hundreds of grants and contracts from its public savings list without warning. One …",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-doge-savings-faces-backlash-as-1-billion-vanishes-overnight-amidst-cost-cutting-claims/articleshow/120410340.cms",
    "timestamp": "2025-04-18T15:01:46Z"
  },
  {
    "title": "The Nintendo Switch 2 Price Won't Get Hit By Trump's Tariffs",
    "description": "Preorders for the console will resume next week at the previously announced price of $450 but accessories are getting more expensive.",
    "link": "https://www.wired.com/story/the-nintendo-switch-2-price-wont-get-hit-by-trumps-tariffs/",
    "timestamp": "2025-04-18T15:01:46Z"
  },
  {
    "title": "Waiting for the Fever to Break",
    "description": "Virginia Postrel reviews \"Abundance\" by Ezra Klein and Derek Thompson and lays out her hopes for progress and abundance after Trump.\nThe post Waiting for the Fever to Break appeared first on PRINT Magazine.",
    "link": "https://www.printmag.com/creative-voices/waiting-for-the-fever-to-break/",
    "timestamp": "2025-04-18T15:01:26Z"
  },
  {
    "title": "Don’t Believe Democrats’ Scare Tactics About the SAVE Act Election Integrity Bill",
    "description": "The John F. Kennedy Library Foundation is set to hand out its annual Profile in Courage Award on May 4 to a politician or other... Read More\nThe post Don’t Believe Democrats’ Scare Tactics About the SAVE Act Election Integrity Bill appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/04/18/voting-save-act-shouldnt-be-profile-political-courage/",
    "timestamp": "2025-04-18T15:01:00Z"
  },
  {
    "title": "Nintendo Switch 2 Pre-orders Open on April 24 Following Delay from Tariffs' Impact",
    "description": "Console/games' prices, release dates remain unchanged",
    "link": "https://www.animenewsnetwork.com/news/2025-04-18/nintendo-switch-2-pre-orders-open-on-april-24-following-delay-from-tariffs-impact/.223678",
    "timestamp": "2025-04-18T15:00:25Z"
  },
  {
    "title": "LGBTQ Christians crusade against Trump's 'anti-LGBTQ' orders during Holy Week",
    "description": "Attendees at the Collective of Queer Christian Leaders event in Washington told Fox News Digital they reject President Donald Trump.",
    "link": "https://www.foxnews.com/politics/lgbtq-christians-crusade-against-trumps-anti-lgbtq-orders-during-holy-week",
    "timestamp": "2025-04-18T15:00:19Z"
  },
  {
    "title": "All 63 National Parks Have Free Entry on Saturday, April 19—What To Know",
    "description": "On Saturday, April 19, visitors can access paid-entry national parks for free.",
    "link": "https://www.newsweek.com/earth-day-national-parks-free-entry-april-2025-2060757",
    "timestamp": "2025-04-18T15:00:01Z"
  },
  {
    "title": "Trump vs. NY AG Letitia James: What's behind the fraud accusations in an ongoing feud",
    "description": "New York state Attorney General Letitia James has long had a feud with President Donald Trump.\n \n\nA Trump official accused James of fraud concerning her real estate properties. Her allies argue it's political retribution. [ more › ]",
    "link": "https://gothamist.com/news/trump-vs-ny-ag-letitia-james-whats-behind-the-fraud-accusations-in-an-ongoing-feud",
    "timestamp": "2025-04-18T15:00:00Z"
  },
  {
    "title": "Court to hear challenge to ACA preventative-care coverage",
    "description": "The Supreme Court will hear oral arguments on Monday in yet another dispute over the separation of powers. The case is a challenge to the constitutionality of the structure of a relatively obscure section of the Department of Health and Human Services. But al…",
    "link": "https://www.scotusblog.com/2025/04/court-to-hear-challenge-to-aca-preventative-care-coverage/",
    "timestamp": "2025-04-18T14:59:41Z"
  },
  {
    "title": "FSU shooting: What we know about the victims and suspected attacker",
    "description": "The attacker and wounded victims at Florida State University are currently being treated in hospital.",
    "link": "https://www.aljazeera.com/news/2025/4/18/fsu-shooting-what-we-know-about-the-victims-and-suspected-attacker",
    "timestamp": "2025-04-18T14:59:14Z"
  },
  {
    "title": "National Archives releases 10,000 pages of records related to 1968 assassination of Robert F. Kennedy",
    "description": "The Friday release continues the disclosure of national secrets ordered by President Donald Trump. Director of National Intelligence Tulsi Gabbard says in a statement the RFK files' release will \"shine a long-overdue light on the truth.\"",
    "link": "https://www.pbs.org/newshour/nation/national-archives-releases-10000-pages-of-records-related-to-1968-assassination-of-robert-f-kennedy",
    "timestamp": "2025-04-18T14:57:28Z"
  },
  {
    "title": "Trump Swaps Out COVID.gov For Page Blaming Chinese Lab For Virus And Attacking Biden’s Pandemic Policies",
    "description": "President Donald Trump’s administration scrapped the federal government’s main Covid-19 information hub and replaced it with a holding page blaming a Chinese laboratory for leaking the virus, shredding former President Joe Biden’s pandemic policies and attack…",
    "link": "https://www.mediaite.com/news/trump-swaps-out-covid-gov-for-page-blaming-chinese-lab-for-virus-and-attacking-bidens-pandemic-policies/",
    "timestamp": "2025-04-18T14:56:24Z"
  },
  {
    "title": "Trump Is Flirting With Economic Disaster",
    "description": "By threatening the independence of the Federal Reserve, the president risks undermining many of his key goals.",
    "link": "https://www.theatlantic.com/economy/archive/2025/04/trump-fed-economic-disaster/682506/",
    "timestamp": "2025-04-18T14:56:00Z"
  },
  {
    "title": "Trump allies pitch an alternate reality in which his approval rating is ‘soaring’",
    "description": "Confronted with evidence that the president's support is falling, Donald Trump's allies have some options. They've chosen the worst one.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-allies-pitch-alternate-reality-approval-rating-soaring-rcna201872",
    "timestamp": "2025-04-18T14:53:53Z"
  },
  {
    "title": "Bill Maher declares himself a ‘hero’ for confronting Trump during White House meeting",
    "description": "“Real Time” host Bill Maher said Thursday that he should be regarded as a “hero” for how he handled the White House meeting with his political foe, President Donald Trump. …",
    "link": "https://nypost.com/2025/04/18/us-news/bill-maher-declares-himself-a-hero-over-trump-meeting/",
    "timestamp": "2025-04-18T14:53:41Z"
  },
  {
    "title": "Houthis Claim Attack on Second U.S. Aircraft Carrier",
    "description": "USS Carl Vinson has recently been deployed to the Middle East, alongside the USS Harry S. Truman",
    "link": "https://www.newsweek.com/us-aircraft-carrier-houthis-iran-war-2061468",
    "timestamp": "2025-04-18T14:53:35Z"
  },
  {
    "title": "Trump calls Sen. Van Hollen a 'fool' after meeting with deported MS-13 suspect in El Salvador",
    "description": "President Donald Trump is calling Sen. Chris Van Hollen a \"fool\" after the Maryland Democrat flew to El Salvador to meet with Kilmar Abrego Garcia.",
    "link": "https://www.foxnews.com/politics/trump-calls-sen-van-hollen-fool-after-meeting-deported-ms-13-suspect-el-salvador",
    "timestamp": "2025-04-18T14:53:14Z"
  },
  {
    "title": "NATO to abandon ‘woke language’ – Politico",
    "description": "NATO has reportedly softened gender and diversity, equity, and inclusion language in new laws to appease Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615960-nato-abandon-woke-language/",
    "timestamp": "2025-04-18T14:53:09Z"
  },
  {
    "title": "Trump Tariff Sell-Off: How IBD's Risk Management Rules Avoided Big Losses",
    "description": "President Donald Trump's tariffs have sparked heavy losses on Wall Street over the last two months. And IBD's risk management rules helped investors avoid big drawdowns. Now, equity and ETF investors face the question of how to get back into stocks. And just …",
    "link": "https://biztoc.com/x/c6eb773a13884fba",
    "timestamp": "2025-04-18T14:51:54Z"
  },
  {
    "title": "Records Related To The 1968 Assassination Of Robert F. Kennedy Released",
    "description": "Many files had been previously released, but others had not been digitized and sat for decades in storage facilities maintained by the federal government.",
    "link": "https://www.huffpost.com/entry/rfk-assassination-files_n_6802653de4b058dd5962e393",
    "timestamp": "2025-04-18T14:46:18Z"
  },
  {
    "title": "Sen. Van Hollen meets with Maryland man mistakenly deported to El Salvador amid court fight over return",
    "description": "Van Hollen posted a photo of the meeting Thursday on X, saying he also called Abrego Garcia's wife \"to pass along his message of love.\"",
    "link": "https://www.pbs.org/newshour/politics/sen-van-hollen-meets-with-maryland-man-mistakenly-deported-to-el-salvador-amid-court-fight-over-return",
    "timestamp": "2025-04-18T14:46:15Z"
  },
  {
    "title": "Iran wants guarantees Trump will not quit a new nuclear pact, Iranian official says",
    "description": "Iran told the US in talks it was ready to accept some limits on its uranium enrichment but needed watertight guarantees Trump wouldn't ditch another nuclear pact.",
    "link": "https://www.jpost.com/middle-east/article-850623",
    "timestamp": "2025-04-18T14:45:25Z"
  },
  {
    "title": "Trump Is Right: Fed Chair Jerome Powell Is a Complete Disaster and Caused Extreme Suffering on the US Middle Class",
    "description": "President Trump criticizes Fed Chair Jerome Powell's recent actions, claiming they jeopardize the middle class and calling for his removal. This post examines the implications of Powell's tenure on America's economy.\nThe post Trump Is Right: Fed Chair Jerome …",
    "link": "https://www.thegatewaypundit.com/2025/04/trump-is-right-fed-chair-jerome-powell-is/",
    "timestamp": "2025-04-18T14:45:17Z"
  },
  {
    "title": "Trump Releases Files on 1968 Assassination of Robert F. Kennedy (Hadriana Lowenkron/Bloomberg)",
    "description": "Hadriana Lowenkron / Bloomberg:\nTrump Releases Files on 1968 Assassination of Robert F. Kennedy  —  President Donald Trump's administration on Friday released more than 10,000 pages of files related to the 1968 assassination of former Senator Robert F. Kenned…",
    "link": "https://www.memeorandum.com/250418/p45",
    "timestamp": "2025-04-18T14:45:01Z"
  },
  {
    "title": "Florida State University Shooting: What We Know About The Suspect",
    "description": "Police said the alleged gunman is the son of a sheriff’s deputy, whose handgun he allegedly used during the shooting.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/18/florida-state-university-shooting-what-we-know-about-the-suspect/",
    "timestamp": "2025-04-18T14:44:51Z"
  },
  {
    "title": "Shawn Fain for President!",
    "description": "Jeet Heer\n\n\n\nCentrist Democrats hate the union leader because he puts the working class first.\r\n\n\r\n\n\nThe post Shawn Fain for President! appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/shawn-fain-tariffs-democrats-president/",
    "timestamp": "2025-04-18T14:44:00Z"
  },
  {
    "title": "'We Are Not the Same:' Trump Meets with Angel Mom as Chris Van Hollen Meets with Accused Wife Beater",
    "description": "While President Donald Trump met with Angel Mom Patty Morin, Sen. Chris Van Hollen (D-MD) met with a deported illegal alien.\nThe post ‘We Are Not the Same:’ Trump Meets with Angel Mom as Chris Van Hollen Meets with Accused Wife Beater appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/04/18/we-are-not-same-trump-meets-angel-mom-chris-van-hollen-meets-accused-ms-13-gang-member/",
    "timestamp": "2025-04-18T14:43:18Z"
  },
  {
    "title": "What is 50501 movement, activist network fuelling anti-Trump and Elon Musk protests across US?",
    "description": "More than 400 events are scheduled nationwide for April 19 across 50 states in US, including rallies, protests, nature cleanups and food drives. Protests will be held across US tomorrow against President Donald Trump and his tech billionaire ally Elon Musk. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-is-50501-movement-activist-network-fuelling-anti-trump-and-elon-musk-protests-across-us/articleshow/120410021.cms",
    "timestamp": "2025-04-18T14:42:52Z"
  }
]