[
  {
    "title": "Trump's $750 Billion EU Energy Deal 'Wholly Unrealistic' And 'Absurd,' Say Analysts: 'How Would Literally Any Of This Work'",
    "description": "The European Union’s pledge to purchase $750 billion worth of U.S. energy products over the next three years, as part of its trade deal with the U.S., has been met with skepticism from industry experts.\nWhat Happened: President Donald Trump announced a trade …",
    "link": "https://biztoc.com/x/ececdc6e84506460",
    "timestamp": "2025-07-29T07:50:43Z"
  },
  {
    "title": "Beijing Britain? Leftist UK Govt May Ban VPNs to Enforce Online Censorship Law",
    "description": "The Labour Party government in Britain may consider banning VPNs, according to unearthed plans made before the implementation of the controversial Online Safety Act.\nThe post Beijing Britain? Leftist UK Govt May Ban VPNs to Enforce Online Censorship Law appea…",
    "link": "https://www.breitbart.com/europe/2025/07/29/beijing-britain-leftist-uk-govt-may-ban-vpns-to-enforce-online-censorship-law/",
    "timestamp": "2025-07-29T07:47:02Z"
  },
  {
    "title": " BREAKING: Trump BACKTRACKS on China Tech Ban!  Nvidia’s CEO Pressure?  Chip Wars Heating Up! ",
    "description": "Trump’s Temporary Halt on China Tech Restrictions: A Win for Nvidia? US-China relations are always a hot topic, and the latest developments in tech exports are no exception. Recent reports indicate that former US President Donald Trump has temporarily suspend…",
    "link": "https://nep123.com/breaking-trump-backtracks-on-china-tech-ban-nvidias-ceo-pressure-chip-wars-heating-up/",
    "timestamp": "2025-07-29T07:44:53Z"
  },
  {
    "title": "Massie warns blocking Epstein vote in the House could be political liability for GOP in midterms",
    "description": "House Speaker Mike Johnson criticized a discharge petition that would force a vote in the U.S. House on releasing the federal files pertaining to sex offender Jeffrey Epstein. Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., are behind the effort to force…",
    "link": "https://freerepublic.com/focus/f-news/4331371/posts",
    "timestamp": "2025-07-29T07:41:46Z"
  },
  {
    "title": "Trump visit gives Swinney golden opportunity to butter up president on Scotch whisky tariffs exemption",
    "description": "There had been much talk of the possibility of a frosty reception when the US president locked eyes with Scotland's first minister.",
    "link": "https://news.sky.com/story/trump-visit-gives-swinney-golden-opportunity-to-butter-up-president-on-scotch-whisky-tariffs-exemption-13403325",
    "timestamp": "2025-07-29T07:40:00Z"
  },
  {
    "title": "Asian shares mostly slip as focus shifts to US talks with China",
    "description": "Asian shares mostly declined Tuesday as some of the euphoria fizzled out over a tariff deal with Japan as proposed by President Donald Trump, which was followed by a similar deal with the European Union. Japan's benchmark Nikkei 225 slipped nearly 0.7% to 40,…",
    "link": "https://japantoday.com/category/business/asian-shares-mostly-slip-as-focus-shifts-to-us-talks-with-china",
    "timestamp": "2025-07-29T07:36:21Z"
  },
  {
    "title": "Donald Trump hits back with strange response to claims he visited Jeffrey Epstein’s island",
    "description": "When asked if he ever visited Jeffrey Epstein's island, Donald Trump gave a rather odd response",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-response-epstein-island-779132-20250729",
    "timestamp": "2025-07-29T07:31:01Z"
  },
  {
    "title": "Mystery girl next to Prince William during Euro 2025 trophy presentation spoke out after people wondered who she was",
    "description": "The identity of the young girl stood next to Prince William during Euro 2025 trophy presentation has spoken out after people wondered who she was online.",
    "link": "https://www.ladbible.com/news/sport/euro-2025-womens-final-trophy-young-girl-identified-538669-20250729",
    "timestamp": "2025-07-29T07:29:59Z"
  },
  {
    "title": "Oil Holds Gain as Trump’s Russia Deadline Raises Supply Concerns",
    "description": "Oil held a gain after US President Donald Trump pushed for Russia to reach a swift truce with Ukraine or face potential economic ...",
    "link": "https://biztoc.com/x/8e412c4b2116de6d",
    "timestamp": "2025-07-29T07:27:49Z"
  },
  {
    "title": "Trump is getting the world economy he wants — but the risk to growth could spoil his victory lap",
    "description": "President Donald Trump is getting his way with the world economy. Trading partners from the European Union to Japan to Vietnam appear to be acceding to the president’s demands to accept higher costs — in the form of high tariffs — for the privilege of selling…",
    "link": "https://japantoday.com/category/business/trump-is-getting-the-world-economy-he-wants-%E2%80%94-but-the-risk-to-growth-could-spoil-his-victory-lap",
    "timestamp": "2025-07-29T07:27:37Z"
  },
  {
    "title": "Russia strikes prison in Ukraine, killing 16 and wounding dozens",
    "description": "The attack is one of many on the frontline region of Zaporizhzhia as Trump renews demands for a ceasefire.",
    "link": "https://www.bbc.com/news/articles/cj0y45mdjp7o",
    "timestamp": "2025-07-29T07:27:08Z"
  },
  {
    "title": "Hulk Hogan’s son joins WWE wrestlers in emotional tribute to his father",
    "description": "Nick Hogan appeared on WWE’s flagship Monday show to honour his father",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/nick-hogan-hulk-wwe-raw-b2797840.html",
    "timestamp": "2025-07-29T07:23:50Z"
  },
  {
    "title": "Ukraine calls Russian strike on penal colony 'another war crime'",
    "description": "Ukrainian officials say Russian strikes on the frontline region of Zaporizhzhia have killed at least 16 people and injured dozens more.",
    "link": "https://www.abc.net.au/news/2025-07-29/russian-strikes-ukraine-penal-colony/105587352",
    "timestamp": "2025-07-29T07:22:13Z"
  },
  {
    "title": "Ukraine calls deadly Russian strike on Zaporizhzhia prison 'another war crime'",
    "description": "Russian glide bombs and missiles strike a Ukrainian prison and a medical facility, with US President Donald Trump threatening to punish Russia unless the attacks stop.",
    "link": "https://www.abc.net.au/news/2025-07-29/russian-strikes-ukraine-prison-and-medical-facility/105587352",
    "timestamp": "2025-07-29T07:22:13Z"
  },
  {
    "title": "Indian foreign minister refutes Trump’s repeated claims on Pakistan ceasefire",
    "description": "US President Donald Trump and Indian PM Narendra Modi did not speak during the recent South Asian military conflict, S. Jaishankar has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622126-indian-foreign-minister-refutes-trumps/",
    "timestamp": "2025-07-29T07:20:22Z"
  },
  {
    "title": "Thailand accuses Cambodia of ceasefire breach",
    "description": "The Cambodian military has denied claims by the Thai military that it breached a ceasefire agreement in the border conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622128-cambodia-thailand-truce-tested/",
    "timestamp": "2025-07-29T07:18:06Z"
  },
  {
    "title": "Jon Stewart Takes Aim at Trump’s Epstein Defense: ‘He Fled the Country’",
    "description": "Jon Stewart discussed Donald Trump's recent visit to Scotland and his many defenses around the Epstein files on 'The Daily Show.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-donald-trump-epstein-defense-scotland-1235395744/",
    "timestamp": "2025-07-29T07:17:52Z"
  },
  {
    "title": "US and China hold trade talks after Donald Trump eyes ‘world tariff’ – business live",
    "description": "Live, rolling coverage of business, economics and financial markets as US Treasury chief Scott Bessent attends negotiations in Sweden\nGood morning, and welcome to our live coverage of business, economics and financial markets.\nAfter the US and EU announced th…",
    "link": "https://biztoc.com/x/105a43e9aa634f37",
    "timestamp": "2025-07-29T07:17:30Z"
  },
  {
    "title": "Spain's black olive exporters to struggle under fresh US tariffs",
    "description": "LA RODA DE ANDALUCIA, Spain (Reuters) -Spain's black olive exporters, subject to harsh tariffs since U.S. President Donald Trump's first term, are warning it...",
    "link": "https://finance.yahoo.com/news/spains-black-olive-exporters-struggle-071543469.html",
    "timestamp": "2025-07-29T07:15:43Z"
  },
  {
    "title": "Jon Stewart Stunned By 2 Words In Trump's Latest Epstein Denial",
    "description": "The \"Daily Show\" host spotted a bizarre moment at a presidential news conference.",
    "link": "https://www.huffpost.com/entry/jon-stewart-trump-epstein-island_n_68884b4ee4b0d2f59326656d",
    "timestamp": "2025-07-29T07:06:38Z"
  },
  {
    "title": "Donald Trump Quashes China Summit Rumors: 'No Interest'",
    "description": "President Donald Trump has said that he is \"not seeking anything,\" but added that he may visit China \"at the invitation of President Xi.\"",
    "link": "https://biztoc.com/x/c9c6b5fa55de1b58",
    "timestamp": "2025-07-29T07:06:08Z"
  },
  {
    "title": "Japan's Nikkei falls for third session on corporate outlook concerns",
    "description": "Japan's Nikkei experienced a third consecutive day of losses, dropping 0.79% to 40,674.55, as corporate outlook concerns triggered profit-taking. Investors are cautious amid the earnings season and the potential impact of a 15% tariff on exports to the U.S. C…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-for-third-session-on-corporate-outlook-concerns/articleshow/122969535.cms",
    "timestamp": "2025-07-29T07:05:13Z"
  },
  {
    "title": "US must recognize North Korea as a nuclear power – Kim’s sister",
    "description": "Amicable personal relations between heads of state should not be used as a pretense to push denuclearization, Kim Yo-jong has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622127-us-must-recognize-north-korea-nuclear/",
    "timestamp": "2025-07-29T07:03:17Z"
  },
  {
    "title": "Musk’s Geopolitical Influence Raises Concerns Among Regulators and Lawmakers",
    "description": "During a pivotal push by Ukraine to retake territory from Russia in late September 2022, Elon Musk gave an order that disrupted the counteroffensive and dented Kyiv’s trust in Starlink, the satellite internet service the billionaire provided early in the …",
    "link": "https://www.insurancejournal.com/news/international/2025/07/29/833369.htm",
    "timestamp": "2025-07-29T07:03:14Z"
  },
  {
    "title": "Donald Trump Quashes China Summit Rumors: 'No Interest'",
    "description": "President Donald Trump has said that he is \"not seeking anything,\" but added that he may visit China \"at the invitation of President Xi.\"",
    "link": "https://www.newsweek.com/donald-trump-rejects-china-summit-xi-jinping-2105470",
    "timestamp": "2025-07-29T06:55:29Z"
  },
  {
    "title": "Thailand says Cambodia violated border truce, military talks postponed",
    "description": "Thailand and Cambodia disputed whether an hours-old ceasefire was holding after the Thai army accused Cambodian forces of launching attacks. Meanwhile, a military-level parley has reportedly been postponed.",
    "link": "https://www.dw.com/en/thailand-says-cambodia-violated-border-truce-military-talks-postponed/a-73445019",
    "timestamp": "2025-07-29T06:51:00Z"
  },
  {
    "title": "Tata Steel Q1 preview: All eyes on UK business turnaround, cost cuts, and margin expansions",
    "description": "Tata Steel's performance over the next 18 months will determine whether it can turn its UK operations profitable by September 2026.",
    "link": "https://www.livemint.com/companies/company-results/tata-steel-q1-preview-all-eyes-on-uk-business-turnaround-cost-cuts-margin-expansion-steel-prices-11753764474107.html",
    "timestamp": "2025-07-29T06:46:43Z"
  },
  {
    "title": "EU capitals and businesses sharply divived over US deal",
    "description": "The European Union has defended its trade deal with President Donald Trump, with EU capitals and businesses sharply divided on an outcome some branded a \"capitulation.\"",
    "link": "https://www.hurriyetdailynews.com/eu-capitals-and-businesses-sharply-divived-over-us-deal-211977",
    "timestamp": "2025-07-29T06:44:12Z"
  },
  {
    "title": "US stopover by Taiwan’s president cancelled; Trump mulls China trip: Report",
    "description": "US President Donald Trump reportedly opposed a stopover in New York by Taiwan's president, says considers China trip.",
    "link": "https://www.aljazeera.com/news/2025/7/29/us-stopover-by-taiwans-president-cancelled-trump-mulls-china-trip-report",
    "timestamp": "2025-07-29T06:43:15Z"
  },
  {
    "title": "Nomura first-quarter profit jumps 52%",
    "description": "TOKYO :Nomura Holdings reported on Tuesday a 52 per cent rise in first-quarter net profit. Japan's top investment bank and brokerage firm booked a profit of 104.6 billion yen ($705.71 million) in the April-June period, compared to a profit of 68.9 billion yen…",
    "link": "https://www.channelnewsasia.com/business/nomura-first-quarter-profit-jumps-52-5264381",
    "timestamp": "2025-07-29T06:39:01Z"
  },
  {
    "title": "Nomura Q1 profit jumps 52% as markets, investment bank units ride out volatility",
    "description": "TOKYO :Nomura Holdings reported on Tuesday a 52 per cent rise in first-quarter net profit thanks to a strong showing in trading and investment banking despite volatile global markets.Japan's top investment bank and brokerage firm booked a profit of 104.6 bill…",
    "link": "https://www.channelnewsasia.com/business/nomura-q1-profit-jumps-52-markets-investment-bank-units-ride-out-volatility-5264381",
    "timestamp": "2025-07-29T06:39:01Z"
  },
  {
    "title": "Trump temporarily drops export controls to smooth negotiations with China",
    "description": "After previously saying that the US would block exports of key AI chips to China, Donald Trump’s administration may have backtracked. The US will now temporarily block restriction on exports of chips and other technology to China, the Financial Times reported…",
    "link": "https://www.madshrimps.be/news/trump-temporarily-drops-export-controls-to-smooth-negotiations-with-china/",
    "timestamp": "2025-07-29T06:38:59Z"
  },
  {
    "title": "Thailand accuses Cambodia of violating hours-old ceasefire",
    "description": "Cambodia says there have been \"no armed clashes\" between the two sides since the midnight ceasefire.",
    "link": "https://www.bbc.com/news/articles/cly4l7j3e8zo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-29T06:37:47Z"
  },
  {
    "title": "Russian strikes on Zaporizhzhia kill 16, Ukraine says",
    "description": "At least 16 people were killed in multiple overnight strikes by Russia on the frontline region of Zaporizhzhia in southwestern Ukraine.",
    "link": "https://www.rte.ie/news/ukraine/2025/0729/1525848-ukraine-russia/",
    "timestamp": "2025-07-29T06:31:04Z"
  },
  {
    "title": "CNBC Daily Open: Investors are signaling it's time for tariffs to move aside",
    "description": "Economists appear to be lowering their expectations of the impact tariffs will have on the U.S. economy.",
    "link": "https://www.cnbc.com/2025/07/29/cnbc-daily-open-investors-signal-its-time-for-tariffs-to-move-aside.html",
    "timestamp": "2025-07-29T06:30:01Z"
  },
  {
    "title": "US seeks to claim $2.4M in Bitcoin seized from ransomware group",
    "description": "A civil forfeiture complaint filed by US authorities hopes to lay claim to $2.4 million in Bitcoin allegedly tied to a ransomware gang, which could end up in the proposed US Bitcoin treasury.",
    "link": "https://cointelegraph.com/news/us-bitcoin-reserve-seizure-foia-dispute",
    "timestamp": "2025-07-29T06:28:25Z"
  },
  {
    "title": "Trump denies seeking summit with Xi, says he ‘may’ visit China",
    "description": "US president says he will visit China only at the invitation of Chinese leader.",
    "link": "https://www.aljazeera.com/news/2025/7/29/trump-denies-seeking-summit-with-xi-says-he-may-visit-china",
    "timestamp": "2025-07-29T06:26:42Z"
  },
  {
    "title": "US Justice Department targets judge over Trump remarks",
    "description": "US President Donald Trump's administration has filed a misconduct complaint against a top federal judge, accusing him of bias. The judge had previously blocked deportation flights of Venezuelans to El Salvador.",
    "link": "https://www.dw.com/en/us-justice-department-targets-judge-over-trump-remarks/a-73444971",
    "timestamp": "2025-07-29T06:22:00Z"
  },
  {
    "title": "Air-dropping food into Gaza is a ‘smokescreen’ – this is what must be done to prevent mass starvation",
    "description": "States must exercise their full diplomatic leverage to pressure Israel to let aid in at the scale required to avert famine.",
    "link": "https://theconversation.com/air-dropping-food-into-gaza-is-a-smokescreen-this-is-what-must-be-done-to-prevent-mass-starvation-262053",
    "timestamp": "2025-07-29T06:18:26Z"
  },
  {
    "title": "Thai army accuses Cambodia of breaking truce",
    "description": "Thailand's army accused Cambodia Tuesday of violating an hours-old truce, saying clashes continued despite a deal meant to end the bloody fighting that engulfed their jungle-clad frontier.",
    "link": "https://www.hurriyetdailynews.com/thai-army-accuses-cambodia-of-breaking-truce-211972",
    "timestamp": "2025-07-29T06:17:36Z"
  },
  {
    "title": "Donald Trump to open resort’s second golf course on final day in Scotland",
    "description": "Donald Trump will officially open his new golf course in Aberdeenshire on the final day of his visit to Scotland.",
    "link": "https://www.independent.ie/world-news/britain/donald-trump-to-open-resorts-second-golf-course-on-final-day-in-scotland/a433076203.html",
    "timestamp": "2025-07-29T06:16:48Z"
  },
  {
    "title": "Trump says Gaza faces 'real starvation' as death toll nears 60,000",
    "description": "U.S. President Donald Trump warned Monday that the people of Gaza are facing \"real starvation\", as Israel kills 92 in Gaza in one day as death toll rises to at least 59,921 people",
    "link": "https://www.hurriyetdailynews.com/trump-says-gaza-faces-real-starvation-as-death-toll-nears-60-000-211970",
    "timestamp": "2025-07-29T06:08:32Z"
  },
  {
    "title": "Overnight Russian attacks killed at least 20 people, says Ukraine",
    "description": "",
    "link": "https://www.thejournal.ie/overnight-russian-attacks-ukraine-6776600-Jul2025/",
    "timestamp": "2025-07-29T06:07:24Z"
  },
  {
    "title": "Thailand and Cambodia dispute whether ceasefire is holding",
    "description": "Thailand and Cambodia are disputing whether their ceasefire is holding, the morning after they agreed to stop fighting in a deal reached in Malaysia under U.S. pressure",
    "link": "https://abcnews.go.com/International/wireStory/thailand-cambodia-dispute-ceasefire-holding-124160165",
    "timestamp": "2025-07-29T06:06:21Z"
  },
  {
    "title": "As if the trade war never happened, stocks could pull off a feat not seen since the late-1990s boom",
    "description": "\"This year reminds us of the classic Charles Dickens quote, 'It was the best of times, it was the worst of times.'\"",
    "link": "https://fortune.com/2025/07/29/stock-market-outlook-sp500-forecast-7100-trump-trade-war-tariffs/",
    "timestamp": "2025-07-29T06:02:00Z"
  },
  {
    "title": "BRICS charts new economic course as U.S. escalates tariffs in shift of global power",
    "description": "BRICS’s global influence expands as U.S. imposes new tariffs on South Africa. U.S. applies 30% tariffs on South African exports, excluding key minerals. BRICS nations call for reform of IMF, World Bank, pushing multipolar economic order. 11th BRICS Parliament…",
    "link": "https://www.naturalnews.com/2025-07-29-brics-charts-new-economic-course-us-tariffs.html",
    "timestamp": "2025-07-29T06:00:00Z"
  },
  {
    "title": "Thailand and Cambodia reach CEASEFIRE following U.S. pressure",
    "description": "A fragile truce between Thailand and Cambodia took effect on July 28, halting four days of deadly clashes that killed 38 people and displaced 300,000 civilians near their disputed border. The U.S. (led by President Trump), Malaysia and China pressured both si…",
    "link": "https://www.naturalnews.com/2025-07-29-thailand-cambodia-reach-ceasefire-following-us-pressure.html",
    "timestamp": "2025-07-29T06:00:00Z"
  },
  {
    "title": "Brazil defies Trump, strengthens BRICS ties amid tariff threats",
    "description": "Brazilian officials announced their intention to strengthen ties with fellow BRICS nations, despite explicit warnings and tariff threats from U.S. President Donald Trump. The U.S. accusations of undermining the dollar and meddling in Brazil’s affairs have onl…",
    "link": "https://www.naturalnews.com/2025-07-29-brazil-strengthens-brics-ties-amid-tariff-threats.html",
    "timestamp": "2025-07-29T06:00:00Z"
  },
  {
    "title": "Despite Democrat talking heads and shills saying otherwise, OBAMA CAN STILL BE INDICTED for his treason and conspiracy to wreck America",
    "description": "This week, investigative journalist John Solomon told Steve Bannon that former President Barack Obama is unlikely to face legal consequences for his alleged role in the Russia collusion hoax. According to Solomon, the Supreme Court’s 2024 decision in Trump v.…",
    "link": "https://www.naturalnews.com/2025-07-29-obama-can-be-indicted-treason-conspiracy-america.html",
    "timestamp": "2025-07-29T06:00:00Z"
  },
  {
    "title": "Cambodian official praises Trump's role in 'bringing peace' as ceasefire with Thailand takes hold",
    "description": "Cambodian official praises Trump's role in 'bringing peace' as ceasefire with Thailand takes hold go.com",
    "link": "https://abcnews.go.com/International/cambodian-official-praises-trumps-role-bringing-peace-ceasefire/story?id=124128353",
    "timestamp": "2025-07-29T05:58:00Z"
  },
  {
    "title": "Entering a Golden Age for War Profiteers",
    "description": "When, in his 1961 farewell address, President Dwight D. Eisenhower warned of the dangers of the unwarranted influence wielded by a partnership between the military and a growing cohort of U.S. weapons contractors and came up with the ominous term “military-in…",
    "link": "https://www.counterpunch.org/2025/07/29/entering-a-golden-age-for-war-profiteers/",
    "timestamp": "2025-07-29T05:52:58Z"
  },
  {
    "title": "Ukraine says at least 20 killed in Russian strikes",
    "description": "At least 20 people were killed and more than 40 wounded in overnight Russian strikes on Ukraine, regional officials said on Tuesday.",
    "link": "https://www.hurriyetdailynews.com/ukraine-says-at-least-20-killed-in-russian-strikes-211969",
    "timestamp": "2025-07-29T05:52:15Z"
  },
  {
    "title": "Today in Sweden: A roundup of the latest news on Tuesday",
    "description": "Weather warning as storm Karl-Heinz hits Sweden, Swedish PM lukewarm on US-EU deal, and other news from Sweden on Tuesday.",
    "link": "https://www.thelocal.se/20250729/today-in-sweden-a-roundup-of-the-latest-news-on-tuesday-208",
    "timestamp": "2025-07-29T05:51:21Z"
  },
  {
    "title": "STEPHEN MOORE: Desperately Seeking A Pro-Growth Democrat",
    "description": "STEPHEN MOORE: Desperately Seeking A Pro-Growth Democrat",
    "link": "https://dailycaller.com/2025/07/29/opinion-desperately-seeking-a-pro-growth-democrat-stephen-moore/",
    "timestamp": "2025-07-29T05:48:47Z"
  },
  {
    "title": "The Actual Conspiracy Theory Surrounding Trump and Epstein",
    "description": "\"The real conspiracy theory around Trump and Epstein is that multiple apparently unconnected women lied, and continue to lie, about Trump’s behavior. This with nothing to gain, and much to lose, by speaking out about his misdeeds.\"",
    "link": "https://katemanne.substack.com/p/the-actual-conspiracy-theory-surrounding",
    "timestamp": "2025-07-29T05:47:01Z"
  },
  {
    "title": "Pete Buttigieg says matter of trans athletes shouldn’t be decided by ‘politicians in Washington’",
    "description": "Gay democrat Pete Buttigieg has weighed in on trans rights, including trans athletes’ participation in sports, declaring that they shouldn’t be decided by “politicians in Washington”.  In light of President Donald Trump’s anti-trans athletes in sports executi…",
    "link": "https://www.thepinknews.com/2025/07/29/pete-buttigieg-trans-rights-interview/",
    "timestamp": "2025-07-29T05:45:14Z"
  },
  {
    "title": "Is Putin's aide threatening Trump with World War III? Ex-Russian President Medvedev warns US President as he mounts heat on Putin to pause Ukraine war",
    "description": "President Trump has shortened his deadline for Putin to end the war in Ukraine, now demanding action within 10-12 days and threatening severe tariffs. Medvedev responded sharply, calling Trump's ultimatum a dangerous escalation towards war, not just with Ukra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-putins-aide-threatening-trump-with-world-war-iii-ex-russian-president-medvedev-warns-us-president-as-he-mounts-heat-on-putin-to-pause-ukraine-war/articleshow/122967402.cms",
    "timestamp": "2025-07-29T05:44:44Z"
  },
  {
    "title": "PIX: England Lionesses return home to heroes' welcome",
    "description": "'Not only are they bringing it home for England again, but they're inspiring the next generation of champions too.'",
    "link": "https://www.rediff.com/sports/report/pix-england-return-home-to-heroes-welcome-after-euro-2025-win/20250729.htm",
    "timestamp": "2025-07-29T05:42:08Z"
  },
  {
    "title": "Pakistan's finance minister heads to US to finalise trade deal",
    "description": "Pakistan's Finance Minister is in the U.S. to finalize a trade deal aimed at resetting economic ties and avoiding steep U.S. tariffs. Negotiations focus on reciprocal tariffs, with Pakistan offering to import more U.S. goods and open investment opportunities.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pakistans-finance-minister-heads-to-us-to-finalise-trade-deal/articleshow/122967384.cms",
    "timestamp": "2025-07-29T05:41:26Z"
  },
  {
    "title": "Federal Reserve likely to stand pat on rates this week",
    "description": "The Federal Reserve is expected to leave its short-term interest rate unchanged on Wednesday for the fifth straight meeting, a move that will likely underscore the deep divide between how Chair Jerome Powell and President Donald Trump see the economy",
    "link": "https://biztoc.com/x/401b300f26053361",
    "timestamp": "2025-07-29T05:25:54Z"
  },
  {
    "title": "Shooter opens fire outside Reno casino, killing 3 and injuring several others",
    "description": "A gunman opened fire Monday outside the largest casino in Reno, Nevada, killing three people and wounding three others before police shot the suspect and arrested him, officials said.",
    "link": "https://www.npr.org/2025/07/29/nx-s1-5483477/shooter-opens-fire-outside-reno-casino-killing-3-and-injuring-several-others",
    "timestamp": "2025-07-29T05:24:49Z"
  },
  {
    "title": "Taiwan says President Lai not blocked from US stopover",
    "description": "TAIPEI: President Lai Ching-te has not been blocked from visiting the United States, Taipei's foreign ministry said on Tuesday (Jul 29), insisting he has no plans to travel overseas \"in the near future\". The remarks came after US President Donald Trump's admi…",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-president-lai-ching-te-not-blocked-us-stopover-5264226",
    "timestamp": "2025-07-29T05:23:00Z"
  },
  {
    "title": "Trump to meet FM and open golf course on final day of visit",
    "description": "First Minister John Swinney has vowed to speak out about whisky tariffs as the president's Scottish trip ends.",
    "link": "https://www.bbc.com/news/articles/cx2q5pwzz1yo",
    "timestamp": "2025-07-29T05:16:32Z"
  },
  {
    "title": "Federal Reserve likely to stand pat on rates this week",
    "description": "The Federal Reserve is expected to leave its short-term interest rate unchanged on Wednesday for the fifth straight meeting, a move that will likely underscore the deep divide between how Chair Jerome Powell and President Donald Trump see the economy",
    "link": "https://abcnews.go.com/Business/wireStory/federal-reserve-stand-pat-rates-week-deepening-gulf-124160721",
    "timestamp": "2025-07-29T05:10:33Z"
  },
  {
    "title": "Europe loses patience with Israel",
    "description": "In today’s edition of The Capitals, read about the EU edging toward Israel sanctions, a rough landing for the US-EU deal, China ripping into MEPs over Taiwan, and steel safeguards set to hit EFTA states.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-europe-loses-patience-with-israel/",
    "timestamp": "2025-07-29T05:10:06Z"
  },
  {
    "title": "UVA Business School Suspends DEI-Related Partnerships Amid Political Pressure",
    "description": "The University of Virginia’s Darden School of Business suspended its partnerships with several organizations dedicated to increasing opportunities for underrepresented groups in business schools amid persistent calls from the White House to dismantle diversit…",
    "link": "https://www.insurancejournal.com/news/east/2025/07/29/833473.htm",
    "timestamp": "2025-07-29T05:00:22Z"
  },
  {
    "title": "‘Clear understanding’ 15% tariff max will be applied by US to pharma exports",
    "description": "Pharmaceuticals and semiconductors accounted for the bulk of Ireland’s exports to the US in 2024",
    "link": "https://www.irishtimes.com/politics/2025/07/29/clear-understanding-15-tariff-max-will-be-applied-by-us-to-pharma-exports/",
    "timestamp": "2025-07-29T05:00:01Z"
  },
  {
    "title": "Trump’s tariffs: What the world got wrong about US president’s trade policy",
    "description": "No economy rises or falls for just one reason, even a shock as big as Trump’s trade policy",
    "link": "https://www.irishtimes.com/business/2025/07/29/trumps-tariffs-what-the-world-got-wrong-about-us-presidents-trade-policy/",
    "timestamp": "2025-07-29T05:00:01Z"
  },
  {
    "title": "Fintan O'Toole: Ireland in the 1980s was bloody awful, but there was at least one good reason not to emigrate",
    "description": "Galway’s Druid theatre company had a superb, stubborn belief that a basket case of a nation could also be a Moses basket",
    "link": "https://www.irishtimes.com/opinion/2025/07/29/fintan-otoole-ireland-in-the-1980s-was-bloody-awful-but-there-was-at-least-one-good-reason-not-to-emigrate/",
    "timestamp": "2025-07-29T05:00:01Z"
  },
  {
    "title": "Jessica Williams Says Urkel Didn’t Do 9/11 in Her Return to ‘The Daily Show’",
    "description": "Trump’s attempts to throw prominent Black Americans under the boast won’t fly with the former correspondent",
    "link": "https://www.cracked.com/article_47609_jessica-williams-says-urkel-didnt-do-911-in-her-return-to-the-daily-show.html",
    "timestamp": "2025-07-29T05:00:00Z"
  },
  {
    "title": "Simpsons creator predicts how world would react to Trump’s death and Elon Musk landing on Mars",
    "description": "Matt Groening also took a shot at Fox News and revealed when he thinks the show will end",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/simpsons-trump-death-musk-mars-prediction-b2797797.html",
    "timestamp": "2025-07-29T04:56:25Z"
  },
  {
    "title": "CNBC’s Jim Cramer drops F-bomb live on air while marveling over Trump’s ‘great economy’",
    "description": "CNBC host Jim Cramer’s excitement about President Donald Trump’s latest trade deal got the better of him on Monday. Cramer blurted out “What the f—!” during a segment of CNBC’s “Squawk on The Street” after seeing a graphic detailing the United States’ recent …",
    "link": "https://freerepublic.com/focus/f-news/4331364/posts",
    "timestamp": "2025-07-29T04:54:41Z"
  },
  {
    "title": "Thailand accuses Cambodia of violating hours-old ceasefire",
    "description": "Cambodia says there have been \"no armed clashes\" between the two sides since the midnight ceasefire.",
    "link": "https://www.bbc.com/news/articles/cly4l7j3e8zo",
    "timestamp": "2025-07-29T04:50:12Z"
  },
  {
    "title": "Oil futures edge lower despite Trump shortening Russia peace deal deadline",
    "description": "Crude oil futures traded marginally lower on Tuesday morning despite US President Donald Trump shortening the deadline for Russia to reach a peace deal with Ukraine.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/oil-futures-edge-lower-despite-trump-shortening-russia-peace-deal-deadline/article69868013.ece",
    "timestamp": "2025-07-29T04:44:09Z"
  },
  {
    "title": "Trump says he is not seeking summit with President Xi, but may visit China",
    "description": "Donald Trump might visit China if President Xi Jinping invites him. This could happen during Trump's Asia trip later this year. It would be their first meeting since Trump's second term. Trade and security tensions between the US and China are high. Discussio…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-says-he-is-not-seeking-summit-with-president-xi-but-may-visit-china/articleshow/122966334.cms",
    "timestamp": "2025-07-29T04:43:15Z"
  },
  {
    "title": "'Bharat ka rehne waala hoon...': Congress' Manish Tewari posts a cryptic tweet after exclusion from Op Sindoor debate",
    "description": "Congress leader Manish Tewari questioned his and Shashi Tharoor’s exclusion from the Lok Sabha debate on Operation Sindoor, despite their diplomatic roles abroad. Tharoor reportedly opted out over possible differences with the party’s stance. External Affairs…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/bharat-ka-rehne-waala-hoon-congress-manish-tewari-posts-a-cryptic-tweet-after-exclusion-from-op-sindoor-debate/articleshow/122965867.cms",
    "timestamp": "2025-07-29T04:42:34Z"
  },
  {
    "title": "Iran denies involvement in the hostage negotiations",
    "description": "Iran’s Foreign Ministry has denied US President Donald Trump’s remarks regarding Tehran’s involvement with Hamas in the hostage deal negotiations.Yesterday, at the start of his meeting with British Prime Minister Keir Starmer, Trump stated: “Iran was sending …",
    "link": "https://www.israelnationalnews.com/flashes/663194",
    "timestamp": "2025-07-29T04:36:37Z"
  },
  {
    "title": "Euro-fuelled dollar surge adds to headwinds facing rupee",
    "description": "The Indian rupee is anticipated to weaken due to a stronger dollar index following a euro decline, influenced by the US-EU trade deal. Rising oil prices and continuous foreign portfolio outflows add pressure. The rupee is expected to open around 86.75-86.77 a…",
    "link": "https://economictimes.indiatimes.com/markets/forex/euro-fuelled-dollar-surge-adds-to-headwinds-facing-rupee/articleshow/122966151.cms",
    "timestamp": "2025-07-29T04:36:08Z"
  },
  {
    "title": "After Donald Trump’s presidential win, green investing gets personal",
    "description": "Climate-themed funds were treated less as a financial bet, than a moral statement by some investors",
    "link": "https://www.irishtimes.com/your-money/2025/07/29/after-trumps-win-green-investing-turns-personal/",
    "timestamp": "2025-07-29T04:36:00Z"
  },
  {
    "title": "Gaza and Ukraine will show whether Trump is a true leader or just a bully - CNN",
    "description": "Gaza and Ukraine will show whether Trump is a true leader or just a bullyCNN Sidekick Starmer can’t get a word in as The Donald dominates world’s most one-sided double act | John CraceThe Guardian Trump meets with UK Prime Minister Starmer on heels of EU trad…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178499552",
    "timestamp": "2025-07-29T04:34:27Z"
  },
  {
    "title": "Scores more killed by bombs and starvation in Gaza as Trump vows food aid",
    "description": "Israeli strikes or gunfire killed at least 78 Palestinians across the Gaza Strip on Monday, including a pregnant woman whose baby was delivered after her death but also died, local health officials said. Dozens were killed while seeking food, even as Israel m…",
    "link": "https://www.independent.ie/world-news/middle-east/scores-more-killed-by-bombs-and-starvation-in-gaza-as-trump-vows-food-aid/a1566447377.html",
    "timestamp": "2025-07-29T04:32:00Z"
  },
  {
    "title": "'LET'S RIDE': MAGA Rep Starts Engines On Senate Bid With 1 Embarrassing Error",
    "description": "Rep. Mike Collins declares that \"we've got to be unafraid to call balls and strikes\" just before a messy pitch in the video.",
    "link": "https://www.huffpost.com/entry/rep-mike-collins-georgia-misspelled-senate-campaign_n_6888355de4b0a13396207c8c",
    "timestamp": "2025-07-29T04:31:00Z"
  },
  {
    "title": "Canadian prime minister Mark Carney sees ‘landing zone’ for trade deal with US",
    "description": "Canadian prime minister Mark Carney said his government is still in deep trade talks with the Donald Trump administration despite recent comments from the US president that suggested a deal with Ottawa wasn’t a priority.",
    "link": "https://www.independent.ie/business/world/canadian-prime-minister-mark-carney-sees-landing-zone-for-trade-deal-with-us/a1850972554.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Judge orders Rupert Murdoch to respond in a week as Donald Trump sues over Jeffrey Epstein story",
    "description": "Donald Trump asked a US court to order a swift deposition for billionaire Rupert Murdoch in the US president’s defamation lawsuit against The Wall Street Journal over its July 17 article asserting Mr Trump’s name was on a 2003 birthday greeting for the late f…",
    "link": "https://www.independent.ie/business/world/judge-orders-rupert-murdoch-to-respond-in-a-week-as-donald-trump-sues-over-jeffrey-epstein-story/a493411663.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Palestine Supporters Walk Out of Regina Spektor’s Portland Show",
    "description": "Spektor reacted strongly when a pro-Palestine protester interrupted the show at Revolution Hall. Then, others were asked to leave for expressing support for Gaza.\n \n by Taylor Griggs\n \n \n \n Nadia is a longtime fan of the singer-songwriter Regina Spektor, so s…",
    "link": "https://www.portlandmercury.com/news/2025/07/28/47947232/palestine-supporters-walk-out-of-regina-spektors-portland-show",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Thailand and Cambodia agree ‘unconditional’ ceasefire following talks",
    "description": "Thailand and Cambodia have agreed to an “unconditional” ceasefire starting at midnight, Malaysian prime minister Anwar Ibrahim said yesterday",
    "link": "https://www.independent.ie/world-news/asia-pacific/thailand-and-cambodia-agree-unconditional-ceasefire-following-talks/a812378654.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Pressure on Putin as deadline for ceasefire down to ‘10-12 days’",
    "description": "US president Donald Trump set a new deadline yesterday of 10 or 12 days for Russia to make progress toward ending the war in Ukraine or face consequences, underscoring frustration with Russian president Vladimir Putin for the three-and-a-half-year-old conflic…",
    "link": "https://www.independent.ie/world-news/europe/pressure-on-putin-as-deadline-for-ceasefire-down-to-10-12-days/a607259827.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Donald Trump’s trade victory over EU has wider implications",
    "description": "A trade war has been averted – but at what cost? US president Donald Trump and European Commission president Ursula von der Leyen agreed a US tariff on all EU goods of 15pc. But there are no reciprocal tariffs from the EU side.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-donald-trumps-trade-victory-over-eu-has-wider-implications/a1312271300.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Ireland 'in the dark' over fate of pharma in Trump tariff deal",
    "description": "There is enormous confusion in Government and the EU about what products will be covered by the baseline 15pc tariff which activates on Friday following the US trade deal.",
    "link": "https://www.independent.ie/irish-news/ireland-in-the-dark-over-fate-of-pharma-in-trump-tariff-deal/a1915608501.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "New EU-US trade deal not ideal, but brings relief for Irish dairy sector",
    "description": "The EU’s new trade agreement with the US falls short of Ireland’s hopes, but still offers a welcome improvement for the country’s dairy sector, which had faced steep and unpredictable tariffs in recent months.",
    "link": "https://www.independent.ie/farming/dairy/new-eu-us-trade-deal-not-ideal-but-brings-relief-for-irish-dairy-sector/a930344961.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "Letters: There was touch of karma in the All-Ireland football final after Donegal snubbed parade tradition",
    "description": "The traditional parade of the teams at the annual All-Ireland finals held in Croke Park is an important feature of the nationalist/republican tradition. Notably, teams are instructed not to break ranks until the parade is completed.",
    "link": "https://www.independent.ie/opinion/letters/letters-there-was-touch-of-karma-in-the-all-ireland-football-final-after-donegal-snubbed-parade-tradition/a1470783844.html",
    "timestamp": "2025-07-29T04:30:00Z"
  },
  {
    "title": "How US-EU aerospace rivals united to preserve tariff-free aircraft trade",
    "description": "A provisional agreement between the U.S. and EU will exempt aircraft from tariffs, averting a potential crisis for jet production and deliveries. This deal, which follows intense lobbying, reinstates zero-for-zero tariffs on aircraft and parts, providing stab…",
    "link": "https://economictimes.indiatimes.com/news/international/business/how-us-eu-aerospace-rivals-united-to-preserve-tariff-free-aircraft-trade/articleshow/122966045.cms",
    "timestamp": "2025-07-29T04:29:57Z"
  },
  {
    "title": "Trump Caps His Scottish Visit By Opening A New Golf Course",
    "description": "Much of his trip has revolved around golfing — and promoting his family's luxury properties.",
    "link": "https://www.huffpost.com/entry/ap-eu-trump-scotland_n_68884960e4b0b5f7e9087fc2",
    "timestamp": "2025-07-29T04:26:36Z"
  },
  {
    "title": "Inside Economics: Why the job market feels worse than the numbers look",
    "description": "Liam Dann takes a deeper dive into the week's economic news",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-why-the-job-market-feels-worse-than-the-numbers-look/32UJ776DXZA6HFTB5B56DRFTMQ/",
    "timestamp": "2025-07-29T04:26:09Z"
  }
]