[
  {
    "title": "Trump made his MAGA Fed pick. His next choice will be far more consequential",
    "description": "President Donald Trump recently nominated one of his economic advisers to the Federal Reserve’s top ranks, but his next choice will be far more consequential. Plans for picking the next Fed chair are already taking shape.\nTrump on Thursday nominated White Hou…",
    "link": "https://biztoc.com/x/88614d3ab1bcdb5a",
    "timestamp": "2025-08-10T15:54:14Z"
  },
  {
    "title": "Netanyahu defends military expansion in Gaza and lashes out at ‘global campaign of lies’",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Sunday sought to defend a new military offensive in one of Gaza's most populated areas amid growing condemnation at home and abroad, declaring that Israel “has no choice but to finish the job and complete the defea…",
    "link": "https://www.pbs.org/newshour/world/netanyahu-defends-military-expansion-in-gaza-and-lashes-out-at-global-campaign-of-lies",
    "timestamp": "2025-08-10T15:54:13Z"
  },
  {
    "title": "Trump-Putin summit appears favorable to Russia as Europe pushes for Zelenskyy invite",
    "description": "US President Donald Trump announced he will meet Russia’s Vladimir Putin in Alaska on Friday, in a summit that appears oriented toward Moscow’s aims.\nUkrainian President Volodymyr Zelenskyy has not been invited; European officials scrambled to pressure Washin…",
    "link": "https://biztoc.com/x/b2423cca9c983047",
    "timestamp": "2025-08-10T15:53:34Z"
  },
  {
    "title": "Trump Calls Pelosi ‘Disgusting Degenerate,’ Alleges She And Husband Got Rich Off ‘Inside Information’",
    "description": "President Donald Trump called Nancy Pelosi a \"disgusting degenerate\" and alleged she and her husband got rich off \"inside information\" in a social media post.",
    "link": "https://dailycaller.com/2025/08/10/trump-pelosi-insider-information-stock-ban-honest-act/",
    "timestamp": "2025-08-10T15:53:23Z"
  },
  {
    "title": "Trump's Latest Distraction: 'Disgusting' Nancy Pelosi 'Who Impeached Me Twice'",
    "description": "Unsurprisingly, Trump is creating another distraction from Pedo-gate. Senator Josh Hawley, a bill's sponsor, seems to prohibit elected officials from purchasing or selling individual stocks, and that sounds like something we can get behind. However, Hawley th…",
    "link": "https://crooksandliars.com/2025/08/trumps-latest-distraction-disgusting-nancy",
    "timestamp": "2025-08-10T15:53:13Z"
  },
  {
    "title": "Graham Wants to 'Crush' Russian Oil Customers: 'Putin Could Give A Damn'",
    "description": "Senator Lindsey Graham has remained hawkish on Russia and China, hitting out at Vladimir Putin over his seeming lack of care for deaths in Ukraine.",
    "link": "https://www.newsweek.com/lindsey-graham-wants-crush-russian-oil-customers-vladimir-putin-2111414",
    "timestamp": "2025-08-10T15:50:25Z"
  },
  {
    "title": "Here Are 3 Bullish Reasons Why JPMorgan Sees S&P 500 Rallying Much Higher",
    "description": "JPMorgan expects a high single-digit rise in the S&P 500 over the next 12 months.",
    "link": "https://www.coindesk.com/markets/2025/08/10/here-are-3-bullish-reasons-why-jpmorgan-sees-s-and-p-500-rallying-much-higher",
    "timestamp": "2025-08-10T15:48:48Z"
  },
  {
    "title": "Ukrainian foreign minister rejects Trump’s peace suggestion",
    "description": "FM Andrey Sibiga has rejected the US president’s idea that Kiev and Moscow could swap territories to reach peace Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622729-ukrainian-fm-calls-trump-suggestion-into-question/",
    "timestamp": "2025-08-10T15:47:40Z"
  },
  {
    "title": "‘How are you feeling now, Nancy?’ Trump launches fresh attack on ‘disgusting degenerate’ Pelosi",
    "description": "'Is anybody looking into this?'",
    "link": "https://www.wnd.com/2025/08/how-are-you-feeling-now-nancy-trump-launches/",
    "timestamp": "2025-08-10T15:46:28Z"
  },
  {
    "title": "New chatbot on Trump's Truth Social platform keeps contradicting him (Drew Harwell/Washington Post)",
    "description": "Drew Harwell / Washington Post:\nNew chatbot on Trump's Truth Social platform keeps contradicting him  —  An “answer engine” on Trump's social media site says the 2020 election wasn't stolen, tariffs aren't boosting the stock market and Barack Obama is seen fa…",
    "link": "https://www.memeorandum.com/250810/p30",
    "timestamp": "2025-08-10T15:45:00Z"
  },
  {
    "title": "Europe Pushes For Ukraine Role In Trump-Putin Talks",
    "description": "European leaders pushed on Sunday for Ukraine to be a part of the negotiations between the United States and Russia, ahead of talks between presidents Vladimir Putin and Donald Trump.",
    "link": "https://www.ibtimes.com/europe-pushes-ukraine-role-trump-putin-talks-3780604",
    "timestamp": "2025-08-10T15:42:09Z"
  },
  {
    "title": "Trump teases major presser to ‘stop violent crime’ and make Washington DC ‘one of the safest’ cities in the world",
    "description": "Donald Trump announced a White House press conference to address violent crime in Washington, D.C., claiming it would become one of the safest cities. This follows increased federal law enforcement presence after an attempted carjacking injured a former staff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-teases-major-presser-to-stop-violent-crime-and-make-washington-dc-one-of-the-safest-cities-in-the-world/articleshow/123219472.cms",
    "timestamp": "2025-08-10T15:39:51Z"
  },
  {
    "title": "JD Vance says Ukraine peace deal unlikely to satisfy either side",
    "description": "JD Vance suggests a Russia-Ukraine peace deal will likely displease both nations. Donald Trump plans to meet Vladimir Putin in Alaska on August 15 to discuss ending the war. Trump believes a ceasefire is near, potentially involving Ukraine ceding territory. Z…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/jd-vance-says-ukraine-peace-deal-unlikely-to-satisfy-either-side/articleshow/123219564.cms",
    "timestamp": "2025-08-10T15:37:20Z"
  },
  {
    "title": "Georgia Man Arrested for Allegedly Threatening to Kill Trump",
    "description": "A man named Jauan Rashun Porter was arrested after allegedly making threats to assassinate President Donald Trump.",
    "link": "https://www.westernjournal.com/georgia-man-arrested-allegedly-threatening-kill-trump/",
    "timestamp": "2025-08-10T15:37:06Z"
  },
  {
    "title": "Netanyahu defends planned military offensive in Gaza and lashes out at 'global campaign of lies'",
    "description": "Broadcaster Al Jazeera says its correspondent Anas al-Sharif has been killed in Gaza City, and Israel’s military confirms it.",
    "link": "https://www.news4jax.com/news/world/2025/08/10/26-gaza-aid-seekers-killed-as-netanyahu-faces-growing-criticism-over-expanding-the-war/",
    "timestamp": "2025-08-10T15:35:29Z"
  },
  {
    "title": "Prioritise Bharat's needs, PM Modi tells tech companies",
    "description": "Narendra Modi emphasizes India's tech self-reliance. He highlights indigenous tech's role in national security. Modi envisions India as a global AI leader with initiatives like the India AI Mission. He notes India's economic growth and rise in mobile handset …",
    "link": "https://economictimes.indiatimes.com/tech/information-tech/prioritise-bharats-needs-pm-modi-tells-tech-companies/articleshow/123219453.cms",
    "timestamp": "2025-08-10T15:34:38Z"
  },
  {
    "title": "Why Derek Chauvin Will Languish in Prison—Regardless of the Facts",
    "description": "The George Floyd case shows how America traded the rule of law for the rule of narrative—leaving Derek Chauvin to serve the sentence the storyline demanded. I missed Rachel K. Paulose’s column about George Floyd—sorry, Saint George Floyd—when it appeared in T…",
    "link": "https://freerepublic.com/focus/f-chat/4333753/posts",
    "timestamp": "2025-08-10T15:34:16Z"
  },
  {
    "title": "Trump Demands Homeless Move Out of Washington, DC 'Immediately'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said Washington, D.C.'s homeless population must leave the capital \"IMMEDIATELY,\" in a Sunday morning Truth Social post.\n\"We're having a News Conference tomorrow in the White House,\" the…",
    "link": "https://biztoc.com/x/dd0446ac539ca85b",
    "timestamp": "2025-08-10T15:31:20Z"
  },
  {
    "title": "Trump Demands Homeless Move Out of Washington, DC 'Immediately'",
    "description": "Trump has repeatedly threatened to federalize the nation's capital city while citing a high rate of violent crime.",
    "link": "https://www.newsweek.com/trump-demands-homeless-move-out-washington-dc-immediately-2111419",
    "timestamp": "2025-08-10T15:28:28Z"
  },
  {
    "title": "US aiming for Ukraine settlement based on current front line – Vance",
    "description": "Presidents Donald Trump and Vladimir Putin are to meet on August 15 in Alaska for a summit Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622732-vance-conflict-line-ukraine/",
    "timestamp": "2025-08-10T15:27:42Z"
  },
  {
    "title": "Putin and Trump May 'Reconfigure the World Order' in Alaska",
    "description": "Donald Trump chose Alaska as the place to hold his meeting with Vladimir Putin for two reasons, argues Tiberio Graziani, chairman at Vision & Global Trends - International Institute for Global Analyses:",
    "link": "https://sputnikglobe.com/20250810/putin-and-trump-may-reconfigure-the-world-order-in-alaska-1122590042.html",
    "timestamp": "2025-08-10T15:26:48Z"
  },
  {
    "title": "'Wives, golf, and votes': Dem governor flags evidence of Trump's 'cheating'",
    "description": "Illinois Gov. JB Pritzker (D) pointed out that President Donald Trump had a history of cheating, as evidenced by his demand that Texas lawmakers find new Republican seats through redistricting the state before the 2026 midterm elections.In a Sunday interview …",
    "link": "https://www.rawstory.com/jb-pritzker-trump-cheating/",
    "timestamp": "2025-08-10T15:24:17Z"
  },
  {
    "title": "Beto’s Group Temporarily Blocked From Funding TX Dems",
    "description": "I recently wrote about Beto O’Rourke bringing the fire we all need to Donald Trump’s plan to rig the midterms by rigging Texas’ congressional map. That threat to democracy was, apparently, music to the ears of Texas’ Republican Governor Greg Abbott and crooke…",
    "link": "https://crooksandliars.com/2025/08/beto-s-group-temporarily-blocked-funding",
    "timestamp": "2025-08-10T15:15:19Z"
  },
  {
    "title": "'There’s No Way He Killed Himself': Jeffrey Epstein's Butler for 18 Years Breaks His Silence, Says Twisted Tycoon 'Loved Life Too Much' to Kill Himself and Was Confident of Securing Bail Before He Died",
    "description": "Valdson Vieira Cotrin revealed that he had spoken to Jeffrey Epstein, the disgraced financier, shortly before he died in August 2019.",
    "link": "https://radaronline.com/p/jeffrey-epsteins-butler-18-years-breaks-silence-kill-himself/",
    "timestamp": "2025-08-10T15:15:00Z"
  },
  {
    "title": "Trump Expands Race Data Disclosure Requirements, Putting Harvard Admissions Under Scrutiny Again (Abigail S. Gerstein/The Harvard Crimson)",
    "description": "Abigail S. Gerstein / The Harvard Crimson:\nTrump Expands Race Data Disclosure Requirements, Putting Harvard Admissions Under Scrutiny Again  —  Harvard and all other American universities will now be required to submit data proving that they do not consider r…",
    "link": "https://www.memeorandum.com/250810/p20",
    "timestamp": "2025-08-10T15:15:00Z"
  },
  {
    "title": "Illinois Governor Defiant When Asked About FBI Arresting Texas Dems Hiding In His State: ‘They’re Heroes!’",
    "description": "JB Pritzker praised lawmakers who fled to Illinois to stall redistricting efforts \"heroes\" and warned Texas officials that their laws do not apply in his state.\nThe post Illinois Governor Defiant When Asked About FBI Arresting Texas Dems Hiding In His State: …",
    "link": "https://www.mediaite.com/media/tv/illinois-governor-defiant-when-asked-about-fbi-arresting-texas-dems-hiding-in-his-state-theyre-heroes/",
    "timestamp": "2025-08-10T15:14:07Z"
  },
  {
    "title": "Trump Envoy’s Embarrassing Gaffe Could Blow Back on President",
    "description": "President Donald Trump’s special envoy to the Middle East botched a sitdown with Russian President Vladimir Putin earlier this week. During the Wednesday...",
    "link": "https://www.thedailybeast.com/donald-trumps-special-envoy-steve-witkoffs-embarrassing-gaffe-could-blow-back-on-president/",
    "timestamp": "2025-08-10T15:12:22Z"
  },
  {
    "title": "Watch: JD Vance reacts to Fox News asking if he will run for president in 2028",
    "description": "Vice President J.D. Vance mustered an awkward laugh after he was asked if he was running for president in 2028.During an interview on Fox News over the weekend, host Maria Bartiromo noted that President Donald Trump suggested that Vance and Secretary of State…",
    "link": "https://www.rawstory.com/jd-vance-laughs-at-2028/",
    "timestamp": "2025-08-10T15:11:44Z"
  },
  {
    "title": "Vance: US working on Putin-Zelensky meeting",
    "description": "United States Vice President JD Vance said on Sunday that the US is working on setting up a meeting between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin. However, he told Fox News that it would not be \"productive\" to schedule th…",
    "link": "https://freerepublic.com/focus/f-chat/4333747/posts",
    "timestamp": "2025-08-10T15:11:03Z"
  },
  {
    "title": "How Kentucky bourbon went from boom to bust",
    "description": "Tariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.",
    "link": "https://www.bbc.com/news/articles/ckglnk6yxlko?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-10T15:10:25Z"
  },
  {
    "title": "Trump Is Accused of 'Sundowning' on White House Roof",
    "description": "When your \"exciting stunt\" gives everyone secondhand embarrassment.",
    "link": "https://cafemom.com/entertainment/trump-is-accused-of-sundowning-on-white-house-roof",
    "timestamp": "2025-08-10T15:08:09Z"
  },
  {
    "title": "Europe Casts Doubt on Trump-Putin Summit Without Ukraine",
    "description": "The leaders of France, Italy, the U.K., Germany, Poland, and Finland rebuked Trump's decision to exclude Zelensky from peace talks.",
    "link": "https://time.com/7308731/europe-ukraine-trump-putin-summit/",
    "timestamp": "2025-08-10T15:02:42Z"
  },
  {
    "title": "Netanyahu defends planned military offensive in Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Aug. 10 sought to defend a new military offensive in one of Gaza 's most populated areas amid growing condemnation at home and abroad, declaring that Israel “has no choice but to finish the job and complete the def…",
    "link": "https://www.hurriyetdailynews.com/netanyahu-defends-planned-military-offensive-in-gaza-212386",
    "timestamp": "2025-08-10T15:01:02Z"
  },
  {
    "title": "Sen. Rand Paul Staffer, Nearly Killed In Random Attack In D.C., Chooses Faith (Mercy And Redemption) Over Politics (Crime And Punishment)",
    "description": "Washington Post, He Could Have Been the GOP’s Voice on Crime, But His Faith Intervened: Bleeding from his brain and minutes from surgery that would determine whether he lived or died, Phillip Todd had a question. He looked at his mother, sitting by his hospit…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/08/sen-rand-paul-staffer-nearly-killed-in-random-attack-in-dc-chooses-mercy-and-redemption-for-perpetra.html",
    "timestamp": "2025-08-10T15:00:00Z"
  },
  {
    "title": "‘It is sick and it’s disgusting’: JD Vance makes big prediction on Russiagate indictments",
    "description": "'What do you want our intelligence community to be doing? I want them to be catching bad guys'",
    "link": "https://www.wnd.com/2025/08/it-is-sick-its-disgusting-jd-vance-makes/",
    "timestamp": "2025-08-10T14:57:53Z"
  },
  {
    "title": "World reacts to peace agreement between Armenia and Azerbaijan - Euronews.com",
    "description": "World reacts to peace agreement between Armenia and AzerbaijanEuronews.com Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters Pope Leo hails Armenia-Azerbaijan peace dealVatican News Donald Trump brokers a peace plan in th…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178633778",
    "timestamp": "2025-08-10T14:55:39Z"
  },
  {
    "title": "'Sab ke boss to hum hain…': Rajnath Singh’s veiled dig at Trump over tariffs, saying \"some\" are jealous of India’s rapid growth",
    "description": "Defence Minister Rajnath Singh took a subtle dig at US President Donald Trump over recent tariffs on Indian goods, accusing global powers of jealousy and trying to disrupt India’s rapid economic growth. Speaking at a bhoomi pujan ceremony for a new rail coach…",
    "link": "https://economictimes.indiatimes.com/news/india/sab-ke-boss-to-hum-hain-rajnath-singhs-veiled-dig-at-trump-over-tariffs-saying-some-are-jealous-of-indias-rapid-growth/articleshow/123219125.cms",
    "timestamp": "2025-08-10T14:55:11Z"
  },
  {
    "title": "Can Trump's Fannie Mae and Freddie Mac IPO plan slash mortgage rates? Bill Ackman says...",
    "description": "Donald Trump is reportedly planning to IPO Fannie Mae and Freddie Mac, potentially the largest IPO in history. Billionaire Investor Bill Ackman suggests merging the two mortgage giants to reduce mortgage rates and government oversight costs. Ackman believes p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-can-trumps-fannie-mae-and-freddie-mac-ipo-plan-could-slash-mortgage-rates-bill-ackman-says-/articleshow/123219160.cms",
    "timestamp": "2025-08-10T14:53:25Z"
  },
  {
    "title": "Netanyahu vows to continue with Gaza occupation despite protests as he denies Israel is starving Palestinians",
    "description": "Israeli Prime Minister Benjamin Netanyahu said today that Israel “has no choice but to finish the job and complete the defeat of Hamas” as 26 more people were shot dead in Gaza while seeking aid, authorities said.",
    "link": "https://www.independent.ie/world-news/middle-east/netanyahu-vows-to-continue-with-gaza-occupation-despite-protests-as-he-denies-israel-is-starving-palestinians/a917606618.html",
    "timestamp": "2025-08-10T14:47:48Z"
  },
  {
    "title": "A Congolese refugee's 8-year struggle to reunite with her family in the US",
    "description": "A Congolese refugee who had been separated from her family for eight years was on the verge of joining them in the United States when President Donald Trump halted the refugee program in January",
    "link": "https://abcnews.go.com/US/wireStory/congolese-refugees-8-year-struggle-reunite-family-us-124521765",
    "timestamp": "2025-08-10T14:46:27Z"
  },
  {
    "title": "Ukraine says it hit oil refinery in Russia’s Saratov, Moscow says one dead",
    "description": "Drones launched by Kyiv are targeting deeper into Russian territory than in past, Al Jazeera's correspondent reports.",
    "link": "https://www.aljazeera.com/news/2025/8/10/ukraine-says-it-hit-oil-refinery-in-russias-saratov-moscow-says-one-dead",
    "timestamp": "2025-08-10T14:43:57Z"
  },
  {
    "title": "Crockett: Republicans Have Taken Their Hoods Off in Trump’s Second Term",
    "description": "Saturday on MSNBC’s \"Velshi,\" Rep. Jasmine Crockett (D-TX) claimed Republicans had taken their hoods off in President Donald Trump’s second term.\nThe post Crockett: Republicans Have Taken Their Hoods Off in Trump’s Second Term appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/08/10/crockett-republicans-have-taken-their-hoods-off-in-trumps-second-term/",
    "timestamp": "2025-08-10T14:42:58Z"
  },
  {
    "title": "Pritzker: Trump Is Attempting to Cheat, 'Steal Seats' in Midterms",
    "description": "Sunday on NBC's \"Meet the Press,\" Gov. J.B. Pritzker (D-IL) said President Donald Trump was attempting to cheat in the 2026 midterm elections with the help of Gov. Greg Abbott (R-TX) by redistricting the state house.\nThe post Pritzker: Trump Is Attempting to …",
    "link": "https://www.breitbart.com/clips/2025/08/10/pritzker-trump-is-attempting-to-cheat-steal-seats-in-midterms/",
    "timestamp": "2025-08-10T14:35:50Z"
  },
  {
    "title": "Mamdani’s vow to wage war on Trump WILL be a nightmare — for New York City",
    "description": "Zohran Mamdani promises to be President Donald Trump’s “worst nightmare” if he becomes mayor, but the actual victims of any such faceoff will be the people of New York City.",
    "link": "https://nypost.com/2025/08/10/opinion/zohran-mamdani-will-make-new-york-city-a-living-nightmare/",
    "timestamp": "2025-08-10T14:34:43Z"
  },
  {
    "title": "Jen Psaki Is Asked If She Fears Trump Administration Is 'Coming After' Her",
    "description": "The former Biden White House press secretary gave an eyebrow-raising response to a personal question from an MSNBC colleague.",
    "link": "https://www.huffpost.com/entry/jen-psaki-trump-administration-coming-after-her-ali-velshi_n_68988c66e4b0f3b8e58d834b",
    "timestamp": "2025-08-10T14:34:35Z"
  },
  {
    "title": "Whitmer told Trump in private that Michigan auto jobs depend on a tariff change of course",
    "description": "Michigan Gov. Gretchen Whitmer met privately in the Oval Office with President Donald Trump to make a case he did not want to hear: the automotive industry he s",
    "link": "https://wsbt.com/news/business/whitmer-told-trump-in-private-that-michigan-auto-jobs-depend-on-a-tariff-change-of-course",
    "timestamp": "2025-08-10T14:33:05Z"
  },
  {
    "title": "Zelensky Fires Back At Trump-Putin Meeting",
    "description": "Donald Trump’s plan to bully Ukraine into submitting to Russia is not off to a great start.\nVia The Guardian:\nPresident Volodymyr Zelenskyy said early on Saturday that “Ukrainians will not give their land to occupiers” after Donald Trump said he would meet Vl…",
    "link": "https://crooksandliars.com/2025/08/zelensky-fires-back-trump-putin-meeting",
    "timestamp": "2025-08-10T14:30:55Z"
  },
  {
    "title": "ChatGPT Lured Him Down a Philosophical Rabbit Hole. Then He Had to Find a Way Out",
    "description": "A husband and father was developing a philosophical belief system with ChatGPT that took over his life — and he found himself in an AI spiral.",
    "link": "http://www.rollingstone.com/culture/culture-features/chatgpt-ai-philosophical-psychosis-1235404568/",
    "timestamp": "2025-08-10T14:30:00Z"
  },
  {
    "title": "College endowment tax is leading to hiring freezes and could mean cuts in financial aid",
    "description": "Private universities will be on the hook to pay hundreds of millions more in taxes amid the Trump administration's threats to their funding.",
    "link": "https://roanoke.com/news/nation-world/education/article_ee232b99-aeee-507e-8475-0745a80d081d.html",
    "timestamp": "2025-08-10T14:30:00Z"
  },
  {
    "title": "Why Trump wants Putin in Alaska – and not anywhere else",
    "description": "The choice of America’s northern frontier is as much about politics as it is about geography Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622724-why-trump-wants-putin-in-alaska/",
    "timestamp": "2025-08-10T14:29:34Z"
  },
  {
    "title": "Trump Risks Looking Weaker Than Putin in Alaska — And on the World Stage",
    "description": "Trump’s Alaska summit with Putin risks appeasement, broken promises, and a U.S. foreign policy that could look weaker than Russia on the world stage.\nThe post Trump Risks Looking Weaker Than Putin in Alaska — And on the World Stage first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trump-risks-looking-weaker-than-putin-in-alaska-and-on-the-world-stage/",
    "timestamp": "2025-08-10T14:28:44Z"
  },
  {
    "title": "Gaza takeover necessary for victory — Netanyahu",
    "description": "Israel's plans to expand its operations to capture and occupy Gaza City have drawn severe condemnation. DW has the latest. Israel's Prime Minister Benjamin Netanyahu has defended his government's decision to expand the Israeli army's operations and reoccupy G…",
    "link": "https://www.dw.com/en/gaza-takeover-necessary-for-victory-netanyahu/live-73587148",
    "timestamp": "2025-08-10T14:23:00Z"
  },
  {
    "title": "Middle East: Gaza takeover necessary for victory — Netanyahu",
    "description": "Israel's plans to expand its operations to capture and occupy Gaza City have drawn severe condemnation.",
    "link": "https://www.dw.com/en/middle-east-gaza-takeover-necessary-for-victory-netanyahu/live-73587148",
    "timestamp": "2025-08-10T14:23:00Z"
  },
  {
    "title": "Al Jazeera journalist killed in Israeli attack in Gaza City",
    "description": "Israel says it killed Al Jazeera journalist Anas Al-Sharif. Israel's plans to expand operations to capture and occupy Gaza City have drawn severe condemnation. DW has the latest.",
    "link": "https://www.dw.com/en/al-jazeera-journalist-killed-in-israeli-attack-in-gaza-city/live-73587148",
    "timestamp": "2025-08-10T14:23:00Z"
  },
  {
    "title": "Lindsey Graham says Russia and Ukraine would need to swap land in a ceasefire deal",
    "description": "Sen. Lindsey Graham said in an interview on NBC News' \"Meet the Press\" that Russia and Ukraine would have to swap some territory in any ceasefire agreement, echoing President Donald Trump's comments about land exchanges.",
    "link": "https://www.nbcnews.com/politics/trump-administration/lindsey-graham-says-russia-ukraine-need-swap-land-ceasefire-deal-rcna224140",
    "timestamp": "2025-08-10T14:22:50Z"
  },
  {
    "title": "Opinion | Trump once openly discussed nuclear disarmament. What happened?",
    "description": "President Trump once appeared to push for nuclear disarmament for the U.S. yet went on to renege on that promise in dealings with Iran, China and Russia.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-nuclear-weapons-disarmament-hiroshima-rcna224100",
    "timestamp": "2025-08-10T14:20:47Z"
  },
  {
    "title": "Trump 401k changes: What to know",
    "description": "options could change soon. President Donald Trump signed an executive order Thursday to clear the way for Americans to invest their retirement savings in private equity, cryptocurrency, real estate and other alternative assets.\nIt’s a big win for the asset in…",
    "link": "https://biztoc.com/x/196e390a03962ce2",
    "timestamp": "2025-08-10T14:13:57Z"
  },
  {
    "title": "Israeli PM Netanyahu defends his planned military offensive in Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu defended a planned military offensive in Gaza, stating Israel aims to \"free Gaza\" and demilitarize it, with Israel maintaining security control. Amid international condemnation, at least 26 Palestinians were killed se…",
    "link": "https://economictimes.indiatimes.com/news/defence/israeli-pm-netanyahu-defends-his-planned-military-offensive-in-gaza/articleshow/123218821.cms",
    "timestamp": "2025-08-10T14:13:47Z"
  },
  {
    "title": "Netanyahu defends planned military offensive in Gaza: ‘No choice but to finish the job’",
    "description": "He is also pushing back against what he calls a “global campaign of lies” as condemnation of the plan grows both inside and outside Israel.",
    "link": "https://www.pennlive.com/nation-world/2025/08/netanyahu-defends-planned-military-offensive-in-gaza-no-choice-but-to-finish-the-job.html",
    "timestamp": "2025-08-10T14:08:20Z"
  },
  {
    "title": "Trump moves Obama, Bush portraits to hidden stairwell",
    "description": "Once a dramatic feature of the White House entryway, the official portrait of former President Barack Obama has been moved to a decidedly less prominent...",
    "link": "https://www.cnn.com/2025/08/10/politics/trump-moves-obama-bush-portraits-to-hidden-stairwell",
    "timestamp": "2025-08-10T14:07:26Z"
  },
  {
    "title": "Senate Republicans reveal dramatic dealmaking behind Trump's $3.3T megabill passage",
    "description": "Trump's massive spending bill faced GOP resistance over Medicaid cuts before Senate Republicans ultimately passed the legislation following marathon voting sessions.",
    "link": "https://www.foxnews.com/politics/senate-republicans-reveal-dramatic-dealmaking-behind-trumps-3-3t-megabill-passage",
    "timestamp": "2025-08-10T14:00:42Z"
  },
  {
    "title": "Fed’s Bowman Backs 3 Rate Cuts By Year-End – Another Crypto Catalyst?",
    "description": "Federal Reserve Governor Michelle Bowman has publicly called for the US central bank to implement multiple interest rate cuts before 2025 ends. Michelle’s statement comes amid a monetary policy stalemate between US President Donald Trump and Fed Chairman Jero…",
    "link": "https://bitcoinist.com/feds-bowman-three-rate-cut-year-end-crypto-catalyst/",
    "timestamp": "2025-08-10T14:00:37Z"
  },
  {
    "title": "PUTIN COMING TO AMERICA",
    "description": "Back-channel intel. A Moscow trip. And an invitation to Alaska.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-putin-zelensky-alaska/683815/",
    "timestamp": "2025-08-10T14:00:03Z"
  },
  {
    "title": "Six Ways Trump Is Screwing Solar",
    "description": "Donald Trump is repealing tax credits, blocking solar development, and going back on deals in the so-called \"Big Beautiful Bill.\"",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-war-solar-blocking-green-power-1235404339/",
    "timestamp": "2025-08-10T14:00:00Z"
  },
  {
    "title": "Ex Intel directors advocate massive shake up as Trump guns for CEO Tan",
    "description": "Former Intel board members are advocating for a significant restructuring, urging shareholders to push for the spin-off of Intel Foundry into an independent entity to enhance competitiveness and address national security imperatives. This call comes amid scru…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ex-intel-directors-advocate-massive-shake-up-as-trump-guns-for-ceo-tan/articleshow/123218678.cms",
    "timestamp": "2025-08-10T13:59:32Z"
  },
  {
    "title": "First RIT women's track runner comes forward about sharing team and locker room with viral trans athlete",
    "description": "RIT runner Caroline Hill details two years competing alongside transgender athlete Sadie Schreiner, including locker room concerns and broken collegiate track records.",
    "link": "https://www.foxnews.com/sports/rit-womens-track-runner-comes-forward-about-sharing-team-locker-room-viral-trans-athlete",
    "timestamp": "2025-08-10T13:58:24Z"
  },
  {
    "title": "Gold may rally further amid macro uncertainty, global tariff tensions: Analysts",
    "description": "The near-term bias for gold remains positive as long as it sustains above Rs ₹99,000 per 10 grams, according to Jateen Trivedi, VP Research Analyst – Commodity and Currency at LKP Securities",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-may-rally-further-amid-macro-uncertainty-global-tariff-tensions-analysts/article69916932.ece",
    "timestamp": "2025-08-10T13:47:31Z"
  },
  {
    "title": "No One Believes Dr. Vinay Prasad Grew Tired of His Family. To Restore Trust, We Need an Honest Explanation From Our Medical Establishment. That’s Not Asking Too Much.",
    "description": "The public deserves to the full story about Dr. Vinay Prasad's temporary resignation and how this might impact regulatory decisions moving forward.\nThe post No One Believes Dr. Vinay Prasad Grew Tired of His Family. To Restore Trust, We Need an Honest Explana…",
    "link": "https://sciencebasedmedicine.org/nobodytrustsfdaleaders/",
    "timestamp": "2025-08-10T13:46:46Z"
  },
  {
    "title": "WATCH: Top pollster reveals what two things can hurt Republicans most in 2026",
    "description": "'I'm just hoping the Republicans will keep following Trump's lead and not decide to drift off'",
    "link": "https://www.wnd.com/2025/08/watch-top-pollster-reveals-what-two-things-can/",
    "timestamp": "2025-08-10T13:41:30Z"
  },
  {
    "title": "Donald Trump's Declining Health is Becoming Hard to Hide—These Shocking Moments Nearly Expose the ‘Real Trump’ - Inquisitr News",
    "description": "President Donald Trump appears to be experiencing the effects of aging at a rapid pace. Trump ascended to power with his brazen demeanor and seemingly endless zeal.",
    "link": "https://www.inquisitr.com/donald-trumps-declining-health-is-becoming-hard-to-hide-these-shocking-moments-nearly-expose-the-real-trump",
    "timestamp": "2025-08-10T13:39:50Z"
  },
  {
    "title": "Iran objects to US plan on Armenia-Azerbaijan transit route",
    "description": "Iran has argued that the US corridor proposal is a ploy to isolate it along with Russia and weaken their influence in the region Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622725-iran-objects-us-armenia-corridor/",
    "timestamp": "2025-08-10T13:39:36Z"
  },
  {
    "title": "Why Was ‘The Late Show With Stephen Colbert’ Canceled? The Real Reason",
    "description": "CBS revealed the reason why Stephen's stint on 'The Late Show' is ending after more than a decade.",
    "link": "https://hollywoodlife.com/feature/why-was-stephen-colbert-canceled-5429176/",
    "timestamp": "2025-08-10T13:39:33Z"
  },
  {
    "title": "Brava, Bravissima! Emma Thompson Stuns Locarno with Her Acceptance Speech – Delivered Entirely in Italian",
    "description": "Emma Thompson might have been making headlines this week due to her surprise revelation about Donald Trump “stalking” her and trying to ask her out on a date when she was making “Primary Colors”, but she also stunned Locarno with her acceptance speech – deliv…",
    "link": "https://variety.com/2025/awards/global/emma-thompson-locarno-award-acceptance-speech-italian-1236486104/",
    "timestamp": "2025-08-10T13:37:55Z"
  },
  {
    "title": "Trump Rips 'Disgusting Degenerate' Nancy Pelosi In Saturday Night Stock Rant",
    "description": "Her husband Paul Pelosi's plush stock portfolio has long been a topic of conversation.",
    "link": "https://www.huffpost.com/entry/trump-nancy-pelosi-disgusting-degenerate-stocks_n_68988c1de4b07a70fa088fd9",
    "timestamp": "2025-08-10T13:30:40Z"
  },
  {
    "title": "Trump Executive Order Opens Up a Whole New World of Possibilities for Your 401(k)",
    "description": "Americans who control the investments in their 401(k) retirement plans will be having a new world of choices under an executive order from President Donald Trump Private equity investments and hedge funds, with both larger risks and potential rewards, will be…",
    "link": "https://www.thegatewaypundit.com/2025/08/trump-executive-order-opens-whole-new-world-possibilities/",
    "timestamp": "2025-08-10T13:30:30Z"
  },
  {
    "title": "The crypto craze sweeping Washington and Wall Street",
    "description": "While many Americans are still baffled by cryptocurrency, enthusiasm for these digital assets is growing - despite the potential risks of integrating digital currencies with the mainstream economy - in part due to support coming from the White House.",
    "link": "https://www.cbsnews.com/news/the-crypto-craze-sweeping-washington-and-wall-street/",
    "timestamp": "2025-08-10T13:30:12Z"
  },
  {
    "title": "Dissolve The People",
    "description": "Democratic politicians seem to have lost the skill of dealing with their left flank. You can \"Sister Souljah\" them, telling them to fuck off, or you can \"triangulate\" (The Clinton, harsh and mild versions, respectively). You can hint that you secretly agree w…",
    "link": "https://www.eschatonblog.com/2025/08/dissolve-people.html",
    "timestamp": "2025-08-10T13:30:00Z"
  },
  {
    "title": "Maureen Dowd: Trump is refashioning the Oval and our democracy",
    "description": "US president is making the justice department a subsidiary of Trump Inc",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/08/09/opinion/trump-design-rococo-gold.html",
    "timestamp": "2025-08-10T13:29:21Z"
  },
  {
    "title": "European Leaders Call For Protection Of Ukraine As Trump-Putin Summit Looms",
    "description": "European Leaders Call For Protection Of Ukraine As Trump-Putin Summit Looms\n \nAuthored by T.J.Muscaro via The Epoch Times,\nA coalition of European leaders released a joint statement on Aug. 9 welcoming the news of President Donald Trump’s upcoming meeting wit…",
    "link": "https://biztoc.com/x/a1f10af625002c72",
    "timestamp": "2025-08-10T13:29:06Z"
  },
  {
    "title": "'Highly dangerous': Trump nominee says president's new move will backfire on the economy",
    "description": "A Donald Trump nominee came out swinging on Sunday against the president and a White House economist, saying their recent actions could be \"highly dangerous.\"Fortune over the weekend published an article called, \"Two Trump-appointed economists—and longtime fr…",
    "link": "https://www.rawstory.com/trump-highly-dangerous-backfire-economy/",
    "timestamp": "2025-08-10T13:27:59Z"
  },
  {
    "title": "The crypto craze sweeping Washington and Wall Street",
    "description": "While many Americans are still baffled by cryptocurrency, enthusiasm for these digital assets is rising in Washington and on Wall Street. Correspondent Jo Ling Kent explains all things crypto, including the potential risks of integrating digital currencies wi…",
    "link": "https://www.cbsnews.com/video/the-crypto-craze-sweeping-washington-and-wall-street/",
    "timestamp": "2025-08-10T13:27:00Z"
  },
  {
    "title": "European powers say Ukraine must have say in peace talks",
    "description": "The leaders of Europe's largest military and economic powers have issued a statement, saying that Ukraine must play a role in peace talks, ahead of a summit between Donald Trump and Vladimir Putin in Alaska. Sergie Marvov, former member of parliament for Vlad…",
    "link": "https://www.bbc.co.uk/programmes/w172zss6c83zvmy",
    "timestamp": "2025-08-10T13:23:00Z"
  },
  {
    "title": "New Medicaid federal work requirements mean less leeway for states",
    "description": "States that jumped ahead need to ensure their proposals don’t stray too far,",
    "link": "https://www.bostonherald.com/2025/08/10/states-medicaid-work-requirements/",
    "timestamp": "2025-08-10T13:20:35Z"
  },
  {
    "title": "NATO Secretary General Rutte says Trump-Putin summit is about 'testing Putin'",
    "description": "NATO Secretary General Mark Rutte said Friday’s summit between President Donald Trump and Russian President Vladimir Putin in Alaska will be an important test for Putin.",
    "link": "https://abcnews.go.com/Politics/nato-secretary-general-rutte-trump-putin-summit-testing/story?id=124520882",
    "timestamp": "2025-08-10T13:20:13Z"
  },
  {
    "title": "Nvidia Just Dodged an $8 Billion Bullet, Thanks to Donald Trump",
    "description": "After months of high-stakes diplomacy and a personal plea to the president, the AI giant has secured a crucial license to sell its specialized chips in China.",
    "link": "https://gizmodo.com/nvidia-just-dodged-an-8-billion-bullet-thanks-to-donald-trump-2000641188",
    "timestamp": "2025-08-10T13:18:16Z"
  },
  {
    "title": "Trump has said abortion is a state issue. His judicial picks could shape it nationally for decades",
    "description": "By CHRISTINE FERNANDO CHICAGO (AP) — One called abortion a “barbaric practice.” Another referred to himself as a “zealot” for the anti-abortion movement. Several have …",
    "link": "https://www.orlandosentinel.com/2025/08/10/trump-has-said-abortion-is-a-state-issue-his-judicial-picks-could-shape-it-nationally-for-decades/",
    "timestamp": "2025-08-10T13:10:00Z"
  },
  {
    "title": "Sen. Elizabeth Warren discusses future of Mass Pike project, Cape Cod bridges and President Trump",
    "description": "Massachusetts Sen. Elizabeth Warren spoke to WBZ-TV's Jon Keller about a wide range of issues on this week's \"Keller at Large.\"",
    "link": "https://www.cbsnews.com/boston/news/elizabeth-warren-wbz-tv-interview/",
    "timestamp": "2025-08-10T13:02:46Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker blasts Abbott and Trump over GOP redistricting efforts",
    "description": "Illinois Gov. JB Pritzker slammed President Donald Trump as a \"cheater\" and Texas Gov.",
    "link": "https://www.nbcnews.com/politics/politics-news/illinois-gov-jb-pritzker-blasts-texas-gov-greg-abbott-trump-gop-redist-rcna224081",
    "timestamp": "2025-08-10T13:00:41Z"
  },
  {
    "title": "Trump nominates ex-Fox commentator Tammy Bruce for deputy UN ambassador (Coral Murphy Marcos/The Guardian)",
    "description": "Coral Murphy Marcos / The Guardian:\nTrump nominates ex-Fox commentator Tammy Bruce for deputy UN ambassador  —  Bruce, dubbed a ‘great patriot’ by Trump in announcement, now serves as state department spokesperson  —  Donald Trump said on Saturday he was nomi…",
    "link": "https://www.memeorandum.com/250810/p12",
    "timestamp": "2025-08-10T13:00:04Z"
  },
  {
    "title": "Offshore wind leasing is officially dead under Trump",
    "description": "Over 3.5 million acres of federal waters are no longer eligible for offshore wind development following an order from the Interior Department.",
    "link": "https://www.canarymedia.com/articles/offshore-wind/trump-interior-revokes-leasing-areas",
    "timestamp": "2025-08-10T13:00:00Z"
  },
  {
    "title": "Trump Considers Inviting Zelenskyy to Putin Meeting in Alaska",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist to discuss the White House potentially inviting Ukraine President Volodymyr Zelenskyy to President Donald Trump's meeting with Russia’s Vladimir Putin in Alaska.",
    "link": "https://www.today.com/video/trump-considers-inviting-zelenskyy-to-putin-meeting-in-alaska-244668485844",
    "timestamp": "2025-08-10T12:54:23Z"
  },
  {
    "title": "Trump Suggests Ukraine Will Have to Give up Land in Peace Deal",
    "description": "President Donald Trump announced his meeting with Russian President Vladimir Putin will take place in Alaska. After Trump suggested Ukraine may have to cede some of its land as part of a peace agreement, Ukrainian President Volodymyr Zelenskyy slammed the pro…",
    "link": "https://www.today.com/video/trump-suggests-ukraine-will-have-to-give-up-land-in-peace-deal-244667973959",
    "timestamp": "2025-08-10T12:50:01Z"
  },
  {
    "title": "Laura Loomer Blasts Return of FDA Vaccine Chief She Helped Force Out",
    "description": "The conservative activist also said she \"will be ramping up\" exposés of officials at the FDA.",
    "link": "https://www.newsweek.com/laura-loomer-fda-vaccine-chief-vinay-prasad-2111358",
    "timestamp": "2025-08-10T12:49:03Z"
  },
  {
    "title": "Tim Cook's White House visit shows the true cost of tariffs",
    "description": "President Trump's tariff policies, ostensibly aimed at boosting US manufacturing, are riddled with exemptions granted based on political favor rather than objective criteria. This system, exemplified by Apple's tariff exemption in exchange for investment pled…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tim-cooks-white-house-visit-shows-the-true-cost-of-tariffs/articleshow/123218012.cms",
    "timestamp": "2025-08-10T12:48:12Z"
  }
]