[
  {
    "title": "The Trojan Horse That Snuck Through MAGA’s Gates",
    "description": "MAGA embraced the “tech right,” the network of right-wing, anti-woke Silicon Valley executives and venture capitalists, in the 2024 election.",
    "link": "https://dailycaller.com/2025/11/20/maga-tech-right-silicon-valley-trump-administration-palantir-alex-karp/",
    "timestamp": "2025-11-20T21:12:56Z"
  },
  {
    "title": "Federal Agents Can Continue To Use Riot Control Weapons in Chicago With Limited Oversight Amid Pending Appeal",
    "description": "Chicago’s protections for protesters and press were paused after the 7th Circuit stayed Judge Ellis’ limits on ICE force during the appeal.",
    "link": "https://reason.com/2025/11/20/federal-agents-can-continue-to-use-riot-control-weapons-in-chicago-with-limited-oversight-amid-pending-appeal/",
    "timestamp": "2025-11-20T21:12:20Z"
  },
  {
    "title": "Report: Trump could sign executive order to preempt state AI laws",
    "description": "U.S. President Donald Trump could reportedly sign an executive order that would limit states’ ability to regulate artificial intelligence. Trump may sign the order as soon as Friday, sources told Politico today. In recent months, California and Oregon have pa…",
    "link": "https://siliconangle.com/2025/11/20/report-trump-sign-executive-order-preempt-state-ai-laws/",
    "timestamp": "2025-11-20T21:11:59Z"
  },
  {
    "title": "Mike Johnson Dodges When Pressed on Trump’s Call to Execute Congressional Democrats",
    "description": "Mike Johnson dodged when asked to respond to Donald Trump accusing some Democratic lawmakers of “SEDITIOUS BEHAVIOR\" that's \"punishable by DEATH!”\nThe post Mike Johnson Dodges When Pressed on Trump’s Call to Execute Congressional Democrats first appeared on M…",
    "link": "https://www.mediaite.com/media/news/mike-johnson-dodges-when-pressed-on-trumps-call-to-execute-congressional-democrats/",
    "timestamp": "2025-11-20T21:11:33Z"
  },
  {
    "title": "'They should be held accountable': Leavitt defends Trump's endorsement of hanging top Dems",
    "description": "Amid tremendous uproar on the left over President Donald Trump calling for the arrest of six Democratic lawmakers for “seditious behavior,” and even promoting a call for them to be hanged, the White House is walking back what has been described as Trump’s “vi…",
    "link": "https://www.rawstory.com/alternet-posts/karoline-leavitt-trump-dems/",
    "timestamp": "2025-11-20T21:10:53Z"
  },
  {
    "title": "Trump renews pressure on Powell, Fed to cut rates ahead of its December meeting",
    "description": "Trump renews pressure on Powell, Fed to cut rates ahead of its December meeting\nWASHINGTON (TNND) — President Donald Trump renewed his criticisms of Fed chair Jerome Powell on Wednesday, claiming he has “mental problems” and renewing his wishes to oust him fr…",
    "link": "https://biztoc.com/x/dd203de7513f0bd1",
    "timestamp": "2025-11-20T21:08:19Z"
  },
  {
    "title": "Woman found zip-tied in woods staged her own political attack, DOJ says",
    "description": "Prosecutors allege Natalie Greene, 26, paid a body modification artist earlier to make it look like she was injured.Photo by: Department of JusticeCourt documents show how law enforcement found Natalie Green in the woods. A New Jersey woman who was found boun…",
    "link": "https://freerepublic.com/focus/f-news/4353693/posts",
    "timestamp": "2025-11-20T21:08:19Z"
  },
  {
    "title": "Here We Go: Jeffrey Epstein’s Brother Says Financier ‘Had Dirt’ On Donald Trump, Trump Signs Bill To Release Epstein Files",
    "description": "Donald Trump Signs Bill To Release Epstein Files\nThe post Here We Go: Jeffrey Epstein’s Brother Says Financier ‘Had Dirt’ On Donald Trump, Trump Signs Bill To Release Epstein Files appeared first on Bossip.",
    "link": "https://bossip.com/4076500/donald-trump-signs-bill-to-release-epstein-files/",
    "timestamp": "2025-11-20T21:08:18Z"
  },
  {
    "title": "Dangerous war games: Telling servicemembers to resist Trump invites pure chaos",
    "description": "Six Democratic lawmakers warn troops to refuse Trump's 'illegal' orders. But critics argue their video fails to cite any specific unlawful commands, call it dangerous political theater.",
    "link": "https://www.foxnews.com/opinion/dangerous-war-games-telling-servicemembers-resist-trump-invites-pure-chaos",
    "timestamp": "2025-11-20T21:05:42Z"
  },
  {
    "title": "Do Vaccines Cause Autism? CDC Moves From Denial to Doubt",
    "description": "The Centers for Disease Control and Prevention has updated its information on the potential link between autism and vaccines, no longer ruling out the possibility of causation.   “We (HHS) are updating the CDC’s... Read More\nThe post Do Vaccines Cause Autism?…",
    "link": "https://www.dailysignal.com/2025/11/20/vaccines-cause-autism-cdc-moves-denial-doubt/",
    "timestamp": "2025-11-20T21:05:40Z"
  },
  {
    "title": "Liz Cheney Takes A Swipe At Trump In Father's Eulogy",
    "description": "The Republican ex-congresswoman said that while Dick Cheney was a powerful member of the GOP, he would never place party over country.",
    "link": "https://www.huffpost.com/entry/liz-cheney-swipes-trump-maga-father-dick-eulogy_n_691f606be4b071a086ba263e",
    "timestamp": "2025-11-20T21:05:38Z"
  },
  {
    "title": "WATCH: White House says Trump calling a reporter ‘piggy’ shows he’s ‘frank and open’",
    "description": "Asked about President Donald Trump telling a female reporter, “Quiet, piggy” while answering questions aboard Air Force One last week, White House press secretary Karoline Leavitt responded that the president “is very frank and honest with everyone in this ro…",
    "link": "https://www.pbs.org/newshour/politics/watch-white-house-says-trump-calling-a-reporter-piggy-shows-hes-frank-and-open",
    "timestamp": "2025-11-20T21:04:43Z"
  },
  {
    "title": "US troops INVADE Mexico in dramatic escalation of tensions as Pentagon scrambles to contain the fallout",
    "description": "American troops pulled up on a Mexican beach in a dramatic escalation of tensions after Donald Trump threatened to bomb the country. US 'contractors' arrived by boat on Monday at Playa Bagdad, driving signs into the sand near where the Rio Grande empties into…",
    "link": "https://freerepublic.com/focus/f-backroom/4353691/posts",
    "timestamp": "2025-11-20T21:03:29Z"
  },
  {
    "title": "Trump at Odds with CIA Assessment on Khashoggi Killing",
    "description": "President Donald Trump brushed aside a reporter's question to Saudi Crown Prince Mohammed bin Salman about the 2018 killing of Washington Post contributing columnist Jamal Khashoggi, saying the crown prince \"knew nothing about it and we can leave it at that.\"…",
    "link": "https://www.factcheck.org/2025/11/trump-at-odds-with-cia-assessment-on-khashoggi-killing/",
    "timestamp": "2025-11-20T21:02:58Z"
  },
  {
    "title": "Report: Larry Ellison Discussed Firing CNN Anchors with White House amid Warner Bros. Discovery Merger Bidding War",
    "description": "White House officials reportedly discussed the potential firing of several CNN anchors disliked by President Donald Trump with billionaire investor Larry Ellison, a report says.\nThe post Report: Larry Ellison Discussed Firing CNN Anchors with White House amid…",
    "link": "https://www.breitbart.com/entertainment/2025/11/20/report-larry-ellison-discussed-firing-cnn-anchors-with-white-house-amid-warner-bros-discovery-merger-bidding-war/",
    "timestamp": "2025-11-20T21:02:42Z"
  },
  {
    "title": "Trump, Vance Not Invited To Dick Cheney's Funeral: Reports",
    "description": "Cheney, who served as vice president under the presidency of George W. Bush, \"died due to complications of pneumonia and cardiac and vascular disease.\"",
    "link": "https://www.huffpost.com/entry/trump-vance-not-invited-cheney-funeral_n_691f6ed4e4b047290e294add",
    "timestamp": "2025-11-20T21:02:26Z"
  },
  {
    "title": "Russian Oil Giant Recommends Lowest Interim Dividends Since 2020",
    "description": "Russian oil giant Rosneft PJSC plans to pay the lowest interim dividends since the pandemic in 2020.",
    "link": "https://www.rigzone.com/news/wire/russian_oil_giant_recommends_lowest_interim_dividends_since_2020-20-nov-2025-182360-article/",
    "timestamp": "2025-11-20T21:00:00Z"
  },
  {
    "title": "Donald Trump Is The Only Person Who Will Admit That He’s Still Watching Jimmy Kimmel",
    "description": "Trump apparently watches 'Jimmy Kimmel Live!' through closing credits",
    "link": "https://www.cracked.com/article_49218_donald-trump-is-the-only-person-who-will-admit-that-hes-still-watching-jimmy-kimmel.html",
    "timestamp": "2025-11-20T21:00:00Z"
  },
  {
    "title": "The Irish Times view on the US and Saudi Arabia: a business relationship",
    "description": "Prince Mohammed has weapons to buy and billions in investment to sweeten the pill of a diplomatic embrace",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/11/20/the-irish-times-view-on-the-us-and-saudi-arabia-a-business-relationship/",
    "timestamp": "2025-11-20T21:00:00Z"
  },
  {
    "title": "When Is ‘South Park’ Returning For Final 2 Episodes Of Season 28?",
    "description": "Trey Parker and Matt Stone’s odd run of new episodes for \"South Park\" begins heading down its final stretch next week. Find out when you can catch the final two episodes of the hit adult animated series.",
    "link": "https://www.forbes.com/sites/timlammers/2025/11/20/when-is-south-park-returning-for-final-2-episodes-of-season-28/",
    "timestamp": "2025-11-20T20:59:13Z"
  },
  {
    "title": "Donald Trump and Cristiano Ronaldo’s bizarre football match in Oval Office breaks the internet",
    "description": "A surreal AI-generated video of Donald Trump and Cristiano Ronaldo playing keepy-uppy in the Oval Office has gone viral. The clip, posted on Trump's Truth Social, shows the two men juggling a football, with Trump performing exaggerated moves. The video quickl…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trump-and-cristiano-ronaldos-bizarre-football-match-in-oval-office-breaks-the-internet/articleshow/125471831.cms",
    "timestamp": "2025-11-20T20:58:31Z"
  },
  {
    "title": "Zelenskyy says he is ready to work on US-backed plan to end war in Ukraine",
    "description": "The acceleration in US diplomacy comes at an awkward time for Kyiv, with its troops on the back foot on the battlefield and Zelenskyy's government undermined by a corruption scandal.",
    "link": "https://www.channelnewsasia.com/asia/zelenskyy-says-he-ready-work-us-backed-plan-end-war-in-ukraine-5480666",
    "timestamp": "2025-11-20T20:57:00Z"
  },
  {
    "title": "North Carolina officials say US Border Patrol has ended Charlotte operation",
    "description": "The Trump administration has targeted Democrat-led cities like Charlotte for a surge in immigration enforcement.",
    "link": "https://www.aljazeera.com/news/2025/11/20/north-carolina-officials-say-us-border-patrol-has-ended-charlotte-operation",
    "timestamp": "2025-11-20T20:56:58Z"
  },
  {
    "title": "US judge halts Trump's National Guard deployment in Washington, D.C.",
    "description": "Nov 20 (Reuters) - A federal judge on Thursday halted for now President Donald Trump’s deployment of National Guard troops to Washington D.C., dealing Trump a temporary legal setback to his efforts to send the military to American cities over the objections o…",
    "link": "https://freerepublic.com/focus/f-news/4353687/posts",
    "timestamp": "2025-11-20T20:55:15Z"
  },
  {
    "title": "Dick Cheney remembered at funeral as having \"devotion to America\" over party - CBS News",
    "description": "Dick Cheney remembered at funeral as having \"devotion to America\" over partyCBS News Bush, Biden and former vice presidents honor Dick Cheney, while Trump, Vance snubbed for funeral invitationCNN Donald Trump and JD Vance snubbed for Dick Cheney’s funeralThe …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180157095",
    "timestamp": "2025-11-20T20:52:46Z"
  },
  {
    "title": "An early 2028 fight erupts as the White House stews over Sen. Ted Cruz",
    "description": "Long-simmering tensions between President Donald Trump and Sen.",
    "link": "https://www.nbcnews.com/politics/2028-election/early-2028-fight-white-house-ted-cruz-rcna244987",
    "timestamp": "2025-11-20T20:51:49Z"
  },
  {
    "title": "CDT’s “404 Deleted Content Archive” Summary for October 2025, Part Two",
    "description": "CDT presents a monthly series of censored content that has been added to our “404 Deleted Content Archive.” Each month, we publish a summary of content blocked or deleted (often yielding the message “404: content not found”) from Chinese platforms such as WeC…",
    "link": "https://chinadigitaltimes.net/2025/11/cdts-404-deleted-content-archive-summary-for-october-2025-part-two/",
    "timestamp": "2025-11-20T20:49:39Z"
  },
  {
    "title": "Bush, Biden and former vice presidents honor Dick Cheney, while Trump, Vance snubbed for funeral invitation",
    "description": "Political figures from across the aisle gathered Thursday in Washington, DC, for former Vice President Dick Cheney’s funeral — sending off a key figure of pre-MAGA Republican politics. The funeral, which was attended by two former presidents and all living fo…",
    "link": "https://freerepublic.com/focus/f-news/4353685/posts",
    "timestamp": "2025-11-20T20:49:34Z"
  },
  {
    "title": "Press Secretary Defends Donald Trump’s Name Calling Of A Reporter As “Piggy”",
    "description": "White House Press Secretary Karoline Leavitt defended Donald Trump for calling a reporter “piggy,” as she tried to cast the president’s outburst last week in a positive light. On Air Force One on Friday, Trump scolded Bloomberg’s Catherine Lucey as she tried …",
    "link": "http://deadline.com/2025/11/trump-piggy-bloomberg-reporter-1236625130/",
    "timestamp": "2025-11-20T20:45:11Z"
  },
  {
    "title": "Judge orders Trump administration to end National Guard deployment in DC",
    "description": "A federal judge on Thursday ordered the Trump administration to end its monthslong deployment of National Guard troops to help police the nation’s capital.",
    "link": "https://www.wpxi.com/news/local/judge-orders-trump-administration-end-national-guard-deployment-dc/C33RTZXOWBHA7HXXENHI7AYQ5M/",
    "timestamp": "2025-11-20T20:44:24Z"
  },
  {
    "title": "This Dissent From a Reagan Judge Is One of the Most Unhinged Judicial Opinions in U.S. History",
    "description": "He invokes the liberal Jewish philanthropist George Soros no fewer than 17 times.",
    "link": "https://slate.com/news-and-politics/2025/11/texas-gerrymander-judge-soros-trump-crazy.html",
    "timestamp": "2025-11-20T20:42:00Z"
  },
  {
    "title": "Zelensky to speak to Trump after US proposes Russia-Ukraine peace plan",
    "description": "Volodymyr Zelensky will speak to Donald Trump after the US presented Ukraine with a draft peace plan to end the war with Russia. The plan was reportedly drafted by US special envoy Steve Witkoff and his Russian counterpart Kirill Dmitriev, without Ukraine's i…",
    "link": "https://freerepublic.com/focus/f-news/4353682/posts",
    "timestamp": "2025-11-20T20:39:18Z"
  },
  {
    "title": "Judge orders end to National Guard deployment in DC",
    "description": "Judge Jia Cobb concluded Thursday that President Donald Trump’s military takeover in Washington, D.C., violates the Constitution and illegally intrudes on local officials’ authority to direct law enforcement in the district.",
    "link": "https://www.wmur.com/article/judge-orders-end-national-guard-dc/69500493",
    "timestamp": "2025-11-20T20:35:22Z"
  },
  {
    "title": "PR Roundup: Piggy Problems, Cloudflare Outage Response, Bluesky and the Holidays",
    "description": "PR Roundup examines how to respond when your leadership insults members of the media, using the example of Trump and a reporter he called \"piggy,\" how the Cloudflare CEO responded after another outage and a new report acknowledging that users want brands on B…",
    "link": "https://www.prnewsonline.com/pr-roundup-piggy-problems-cloudflare-outage-response-bluesky-and-the-holidays/",
    "timestamp": "2025-11-20T20:35:16Z"
  },
  {
    "title": "'I don't know if CDC will survive, to be quite frank': Former CDC officials describe the disintegration of the agency under RFK",
    "description": "Three former CDC officials share their experiences at the agency leading up to their resignations.",
    "link": "https://www.livescience.com/health/i-dont-know-if-cdc-will-survive-to-be-quite-frank-former-cdc-officials-describe-the-disintegration-of-the-agency-under-rfk",
    "timestamp": "2025-11-20T20:35:00Z"
  },
  {
    "title": "Rep. Suhas Subramanyam Concerned Donald Trump Will Tamper With Epstein Files",
    "description": "President Donald Trump has signed a bill legislating the release of the Epstein Files ... but a Democratic lawmaker does not have faith the Commander in Chief will honor the commitment. Rep. Suhas Subramanyam stopped by TMZ Live Thursday to tell us…\n Permalink",
    "link": "https://www.tmz.com/2025/11/20/suhas-subramanyam-trump-mess-with-epstein-files/",
    "timestamp": "2025-11-20T20:34:38Z"
  },
  {
    "title": "Emails reveal Trump ally Steve Bannon’s plot to rehab Epstein’s image",
    "description": "This is an adapted excerpt from the Nov. 19 episode of “The Beat with Ari Melber.”\nDonald Trump has officially signed the Epstein Files Transparency Act, which forces the federal government to release all documents related to its investigation into the late s…",
    "link": "https://biztoc.com/x/8b91a60f7cb9c951",
    "timestamp": "2025-11-20T20:34:19Z"
  },
  {
    "title": "Judge Orders Trump Administration To End National Guard Deployment In DC",
    "description": "A federal judge is ordering the Trump administration to end its monthslong deployment of National Guard troops to help police the nation’s capital.",
    "link": "https://www.huffpost.com/entry/trump-dc-federal-enforcement-national-guard_n_691f7aeee4b0448495238b5b",
    "timestamp": "2025-11-20T20:33:49Z"
  },
  {
    "title": "NIH Grant Cuts Have Disrupted 383 Clinical Trials With 74,311 Patients",
    "description": "A study found that Trump administration NIH grant cuts led to termination of 118 trials studying cancer, 97 studying infectious diseases and 140 testing new treatments.",
    "link": "https://www.forbes.com/sites/brucelee/2025/11/20/nih-grant-cuts-have-disrupted-383-clinical-trials-with-74311-patients/",
    "timestamp": "2025-11-20T20:32:26Z"
  },
  {
    "title": "Federal judge orders Trump administration to end National Guard deployment in DC",
    "description": "A federal judge on Thursday ordered the Trump administration to end its monthslong deployment of National Guard troops to help police the nation’s capital.",
    "link": "https://www.pbs.org/newshour/politics/federal-judge-orders-trump-administration-to-end-national-guard-deployment-in-dc",
    "timestamp": "2025-11-20T20:31:04Z"
  },
  {
    "title": "EXCLUSIVE: What's Trump Hiding? Medical Expert Goes Off on Prez After He Claimed He Had 'No Idea' What Was Analyzed During his MRI... as Dementia Rumors Ramp Up",
    "description": "Donald Trump previously claimed he had no idea what a recent MRI done on him was for, but many have called him out on the apparent lie.",
    "link": "https://radaronline.com/p/whats-trump-hiding-doctor-responds-to-mri-dementia-rumors/",
    "timestamp": "2025-11-20T20:30:00Z"
  },
  {
    "title": "Fast food is no longer affordable to low-income Americans",
    "description": "Cheap meals are getting farther out of reach",
    "link": "https://theweek.com/business/economy/fast-food-affordable-low-income-economy",
    "timestamp": "2025-11-20T20:27:25Z"
  },
  {
    "title": "Trump DOJ backtracks after major 'admission' in case against president's foe: court filing",
    "description": "Donald Trump's DOJ is backtracking after a major \"admission\" in court.Lindsay Halligan, who was tapped as interim U.S. attorney for the Eastern District of Virginia, admitted during brief testimony Wednesday that the indictment in the case against Trump foe J…",
    "link": "https://www.rawstory.com/lindsay-halligan-admission-backtrack/",
    "timestamp": "2025-11-20T20:26:38Z"
  },
  {
    "title": "GOP wrestles with Obamacare fix as Trump looms over subsidy fight",
    "description": "Senate and House Republicans eye different approaches to tackle expiring healthcare subsidies, with reconciliation process and bipartisan deals under consideration.",
    "link": "https://www.foxnews.com/politics/gop-wrestles-obamacare-fix-trump-looms-over-subsidy-fight",
    "timestamp": "2025-11-20T20:26:32Z"
  },
  {
    "title": "Fox News Politics Newsletter: Trump not invited to Dick Cheney funeral",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-trump-not-invited-dick-cheney-funeral",
    "timestamp": "2025-11-20T20:26:19Z"
  },
  {
    "title": "‘Beyond The Pale’: Dem Senator Denounces Trump’s Threat to Execute Her as Un-American",
    "description": "Elissa Slotkin denounced Donald Trump's calls to execute her and other Democrats for treason after they encouraged the military to \"refuse illegal orders.\"\nThe post ‘Beyond The Pale’: Dem Senator Denounces Trump’s Threat to Execute Her as Un-American first ap…",
    "link": "https://www.mediaite.com/politics/beyond-the-pale-dem-senator-denounces-trumps-threat-to-execute-her-as-un-american/",
    "timestamp": "2025-11-20T20:24:55Z"
  },
  {
    "title": "Theater Kids In Congress Vaguely Urge Military To Disobey Commander-In-Chief",
    "description": "More mush from the wimps. Donald Trump is very bad, because mumble mumble mumble.Even by the pathetic standards of congressional Democrats, this is unusually idiotic. Note what they don’t say. They say that the American military is being “pitted against” thei…",
    "link": "https://freerepublic.com/focus/f-news/4353676/posts",
    "timestamp": "2025-11-20T20:24:13Z"
  },
  {
    "title": "Vance tells Americans to have ‘a little bit of patience’ on high prices",
    "description": "While President Donald Trump has struggled to settle on a way to address Americans’ concerns about high costs, Vice President JD Vance on Thursday offered a more direct and empathetic message, saying, “We hear you” and “there’s a lot more work to do.”\nBut the…",
    "link": "https://biztoc.com/x/af59010aa0538a26",
    "timestamp": "2025-11-20T20:23:19Z"
  },
  {
    "title": "Judge orders Trump administration to end National Guard deployment in DC",
    "description": "She put her order on hold for 21 days to allow for an appeal, however.",
    "link": "https://www.bostonherald.com/2025/11/20/trump-national-guard-dc/",
    "timestamp": "2025-11-20T20:23:10Z"
  },
  {
    "title": "Mamdani Targets The Rich With New Tax On Anyone Who Makes More Than $0 A Year",
    "description": "NEW YORK, NY — Mayor-elect Zohran Mamdani announced plans on Thursday to specifically target the rich with a new tax on anyone who makes more than $0.00 a year. The plan, dubbed the \"How Much You Got?\" Tax, was expected to go into effect in January after Mamd…",
    "link": "https://freerepublic.com/focus/f-chat/4353675/posts",
    "timestamp": "2025-11-20T20:23:07Z"
  },
  {
    "title": "Prospective CFTC chair’s nomination advances through committee",
    "description": "Acting CFTC Chair Caroline Pham may be one step closer to leaving the agency after the Senate Agriculture Committee advanced US President Donald Trump's pick to replace her.",
    "link": "https://cointelegraph.com/news/michael-selig-cftc-chair-nomination-committee-vote",
    "timestamp": "2025-11-20T20:22:37Z"
  },
  {
    "title": "Trump administration announces plan for new oil drilling off the coasts of California and Florida",
    "description": "WASHINGTON (AP) — The Trump administration announced on Thursday new oil drilling off the California and Florida coasts for the first time in decades, advancing a project that critics say could harm coastal communities and ecosystems, as President Donald Trum…",
    "link": "https://freerepublic.com/focus/f-news/4353673/posts",
    "timestamp": "2025-11-20T20:21:16Z"
  },
  {
    "title": "Powder River Basin coal access bill awaits Trump signature",
    "description": "Mining industry access to federally owned coal in northeastern Wyoming will continue under a bill headed to President Donald Trump",
    "link": "https://www.wftv.com/news/business/senate-reversal/2BD622VMLU6OTNUA3YZE626334/",
    "timestamp": "2025-11-20T20:20:24Z"
  },
  {
    "title": "How the Trump Administration Abandoned Plans for a Major Cut in Disability Benefits for Older Workers",
    "description": "After meeting with advocates, the Trump administration confirmed it has scrapped a controversial regulation that would have cut disability benefits for older workers.",
    "link": "http://www.propublica.org/article/trump-administration-social-security-disability-cuts",
    "timestamp": "2025-11-20T20:20:00Z"
  },
  {
    "title": "Karoline Leavitt Doesn't Think Trump's Death Threats To Democrats Are A Big Deal",
    "description": "The press secretary argued that President Donald Trump's social media messages about the death penalty aren't the real cause for concern.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-trump-death-threats_n_691f66e9e4b047290e293efb",
    "timestamp": "2025-11-20T20:19:30Z"
  },
  {
    "title": "Donald Trump Attacks Late Night Hosts but ‘Falls Silent’ on ‘South Park’ Because It ‘Gets Insane Ratings,’ Says Patton Oswalt: ‘Nothing Shuts Up Trump Like Money’",
    "description": "Patton Oswalt appeared on the latest episode of The Daily Beast’s “Last Laugh” podcast and took aim at America’s “authoritarian government” under Donald Trump. One of the most notable parts of the interview came when the comedian was asked about Trump’s selec…",
    "link": "https://variety.com/2025/tv/news/donald-trump-wont-attack-south-park-patton-oswalt-1236585509/",
    "timestamp": "2025-11-20T20:19:25Z"
  },
  {
    "title": "Top Military Lawyer's Objection to Trump Boat Bombings Off Venezuela Were Sidelined: Report",
    "description": "The Trump administration's deadly strikes on boats in the Caribbean and Pacific have alarmed legal experts, Democratic lawmakers, and a small number of Republicans in Congress since they began in early September, but new reporting Thursday revealed that befor…",
    "link": "https://www.commondreams.org/news/us-military-venezuela",
    "timestamp": "2025-11-20T20:19:25Z"
  },
  {
    "title": "The Ghislaine Maxwell Emails",
    "description": "The longtime Epstein associate reveled in her privileges after the Trump administration moved her to more comfortable surroundings.",
    "link": "https://www.theatlantic.com/politics/2025/11/ghislaine-maxwell-emails-prison-trump/684993/",
    "timestamp": "2025-11-20T20:19:00Z"
  },
  {
    "title": "Trump opens parts of Florida, California waters up to offshore oil drilling, breaking decades of precedent | CNN",
    "description": "The Trump administration is proposing to open federal waters off the entire coastline of California to drilling, as well as an area off the coast of Florida. Neither state’s waters have been open to new drilling for decades.",
    "link": "https://www.cnn.com/2025/11/20/climate/trump-oil-drilling-offshore-california-florida",
    "timestamp": "2025-11-20T20:18:46Z"
  },
  {
    "title": "Jon Stewart Blasts Republican Hypocrites After Saudi Crown Prince White House Visit: ‘Look in the Mirror, F—k Face’ | Video",
    "description": "\"F—k you to the highest order of f—king you that you can be f—ked,\" the \"Weekly Show\" host says\nThe post Jon Stewart Blasts Republican Hypocrites After Saudi Crown Prince White House Visit: ‘Look in the Mirror, F—k Face’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jon-stewart-donald-trump-republicans-zohran-mamdani-mohammed-bin-salman/",
    "timestamp": "2025-11-20T20:18:39Z"
  },
  {
    "title": "Trump accuses six Democratic lawmakers of \"seditious behavior\"",
    "description": "President Trump posted on social media that Democratic lawmakers who urged members of the military to disobey illegal orders should be arrested and face trial for \"seditious behavior.\"",
    "link": "https://www.cbsnews.com/news/trump-democrats-seditious-behavior/",
    "timestamp": "2025-11-20T20:18:26Z"
  },
  {
    "title": "Judge halts Trump’s deployment of national guard in Washington, DC | CNN Politics",
    "description": "President Donald Trump and the Defense Department illegally deployed the National Guard in Washington, DC, a federal judge ruled Thursday.",
    "link": "https://www.cnn.com/2025/11/20/politics/national-guard-washington-dc-trump-ruling",
    "timestamp": "2025-11-20T20:18:21Z"
  },
  {
    "title": "Trump’s Own Judges Easily Reject His Bonkers Lawsuit Against CNN For Calling His Big Lie A ‘Big Lie’",
    "description": "Donald Trump, who presents himself as a free speech champion, sure loves suing the media for their First Amendment-protected speech. CNN is a favorite target of his though these lawsuits don’t do particularly well. Back in 2022, he sued CNN for calling Trump’…",
    "link": "https://www.techdirt.com/2025/11/20/trumps-own-judges-easily-reject-his-bonkers-lawsuit-against-cnn-for-calling-his-big-lie-a-big-lie/",
    "timestamp": "2025-11-20T20:16:54Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Cyrus, the Greek Cypriot leader, Nikos Christodoulides, and the Turkish Cypriot leader, Tufan Erhürman, met for the first time as leaders of the Greek Cypriot and Turkish Cypriot communities. The meeting took place in the UN protected area and was facilita…",
    "link": "https://press.un.org/en/2025/db251120.doc.htm",
    "timestamp": "2025-11-20T20:16:52Z"
  },
  {
    "title": "Nigeria Is Turning Into a U.S.-China Battleground",
    "description": "Trump’s threats leave Nigerians worried about superpower intentions.",
    "link": "http://foreignpolicy.com/2025/11/20/trump-china-nigeria-great-power-competition-resources/",
    "timestamp": "2025-11-20T20:14:45Z"
  },
  {
    "title": "Trump Plan Would Expand West Coast, Arctic Offshore Drilling",
    "description": "The Trump administration is proposing to open new areas off the West Coast and in the Arctic to crude drilling as part of a draft blueprint released Thursday that would dramatically expand the sale of offshore oil and natural gas rights.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plan-would-expand-west-coast-arctic-offshore-drilling",
    "timestamp": "2025-11-20T20:14:02Z"
  },
  {
    "title": "Trump Eyes National AI Rules Overriding State Authority",
    "description": "President Donald Trump is preparing an executive order that would sharply limit state authority over artificial intelligence (AI). The draft, reported by The Verge, casts AI innovation as a national-security priority and warns that state rules threaten econom…",
    "link": "https://freerepublic.com/focus/f-chat/4353671/posts",
    "timestamp": "2025-11-20T20:13:50Z"
  },
  {
    "title": "Trump admin announces plan for new oil drilling off coasts of California and Florida",
    "description": "The Trump administration is proposing new oil drilling off the California and Florida coasts for the first time in decades, as President Donald Trump seeks to expand U.S. oil production that is already leading the world",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-announces-plan-new-oil-drilling-off-127725269",
    "timestamp": "2025-11-20T20:13:37Z"
  },
  {
    "title": "‘Pick a f**king side’: Chris Murphy delivers rant over Trump calling for the seditious to be executed",
    "description": "'Under no circumstances should the president of the United States be calling on his political opposition to be hanged'",
    "link": "https://www.wnd.com/2025/11/pick-fking-side-chris-murphy-delivers-rant-trump/",
    "timestamp": "2025-11-20T20:13:36Z"
  },
  {
    "title": "Karoline Leavitt Pressed About Trump Saying Democrats Committed Crimes ‘Punishable By Death’",
    "description": "White House press secretary Karoline Leavitt got confronted on Thursday over President Donald Trump stating that the Democrats committed seditious crimes.",
    "link": "https://dailycaller.com/2025/11/20/karoline-leavitt-trump-democrats-punishable-by-death/",
    "timestamp": "2025-11-20T20:12:57Z"
  },
  {
    "title": "Trump could sign order to prevent state AI laws",
    "description": "United States President Donald Trump could soon sign an executive order that would thwart states' possible artificial intelligence (AI) laws, CNBC reported on Thursday, citing the draft of the alleged...",
    "link": "https://biztoc.com/x/2c9fb6e6d4ebebcd",
    "timestamp": "2025-11-20T20:12:16Z"
  },
  {
    "title": "EU rejects US-proposed Ukraine peace plan",
    "description": "EU ministers have pushed back against the US-proposed Ukraine peace plan unless they are part of the talks Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628078-eu-rejects-ukraine-peace-plan/",
    "timestamp": "2025-11-20T20:12:12Z"
  },
  {
    "title": "Trump Says He's a Little Disappointed in Putin Right Now",
    "description": "A US military delegation met with Ukrainian officials in Kyiv on Wednesday as part of a fresh bid by President Donald Trump to rejuvenate peace talks with Russia, even as another US-Russian proposal modeled on the Gaza ceasefire got a tepid reception from Ukr…",
    "link": "https://biztoc.com/x/dda67e793fde2df6",
    "timestamp": "2025-11-20T20:11:51Z"
  },
  {
    "title": "Trump Just Issued a Shocking New Pardon. It Won’t Work as Intended.",
    "description": "Earlier this month, President Donald Trump quietly pardoned 77 people across the country who participated in the fake electors scheme of 2020.",
    "link": "https://slate.com/news-and-politics/2025/11/trump-giuliani-pardon-fail.html",
    "timestamp": "2025-11-20T20:11:32Z"
  },
  {
    "title": "The Trump Administration’s Order on AI Is Deeply Misguided",
    "description": "Widespread news reports indicate that President Donald Trump’s administration has prepared an executive order to punish states that have passed laws attempting to address harms from artificial intelligence (AI) systems. According to a draft published by news …",
    "link": "https://www.eff.org/deeplinks/2025/11/trump-administrations-order-ai-deeply-misguided",
    "timestamp": "2025-11-20T20:10:51Z"
  },
  {
    "title": "Zelenskyy ready to work on US-backed plan to end war in Ukraine",
    "description": "The White House says senior Trump administration officials have met Ukrainian officials in the past week to discuss the plan.",
    "link": "https://www.abc.net.au/news/2025-11-21/ukraine-ready-to-work-with-us-on-peace-plan/106035582",
    "timestamp": "2025-11-20T20:10:24Z"
  },
  {
    "title": "Donald Trump Plays Soccer With Cristiano Ronaldo in Oval Office in A.I. Video",
    "description": "He shoots, he scores… kinda!! Donald Trump was in full kick-back mode -- literally -- dropping an A.I. clip of himself pulling World Cup-level moves during his White House hang with Cristiano Ronaldo. In a Thursday Truth Social drop, Trump served…\n Permalink",
    "link": "https://www.tmz.com/2025/11/20/donald-trump-cristiano-ronaldo-artificial-intelligence/",
    "timestamp": "2025-11-20T20:09:45Z"
  },
  {
    "title": "U.S. Coast Guard Will No Longer Consider Swastika a Hate Symbol",
    "description": "The U.S. Coast Guard is no longer going to consider the swastika a hate symbol. The Washington Post reports that a new policy will take effect next month at the military branch that will reclassify the swastika, used by the German Nazi Party and adopted as a …",
    "link": "https://newrepublic.com/post/203458/us-coast-guard-removes-swastika-hate-symbol",
    "timestamp": "2025-11-20T20:09:17Z"
  },
  {
    "title": "McMahon Reveals Congress Interested in Huge Step To Dismantle Ed Department",
    "description": "Secretary of Education Linda McMahon is talking to “dozens” of Congress members about codifying the Education Department’s biggest step toward extinction. The Daily Signal asked... Read More\nThe post McMahon Reveals Congress Interested in Huge Step To Dismant…",
    "link": "https://www.dailysignal.com/2025/11/20/mcmahon-reveals-congress-interested-in-huge-step-to-dismantle-ed-department/",
    "timestamp": "2025-11-20T20:08:05Z"
  },
  {
    "title": "U.S. judge halts Trump's National Guard deployment in Washington, D.C",
    "description": "(Reuters) -A federal judge on Thursday halted for now President Donald Trump's deployment of National Guard troops to Washington D.C., dealing Trump a temporary legal setback to his efforts to send the military to American cities over the objections of local …",
    "link": "https://www.thestar.com.my/news/world/2025/11/21/us-judge-halts-trump039s-national-guard-deployment-in-washington-dc",
    "timestamp": "2025-11-20T20:06:00Z"
  },
  {
    "title": "Trump Spox Called Out By CNN’s Kaitlan Collins As She Exits Briefing Amid Jeers",
    "description": "Karoline Leavitt was called out by CNN White House correspondent Kaitlan Collins as she left a White House briefing amid a chorus of complaints from reporters.\nThe post Trump Spox Called Out By CNN’s Kaitlan Collins As She Exits Briefing Amid Jeers first appe…",
    "link": "https://www.mediaite.com/online/trump-spox-called-out-by-cnns-kaitlan-collins-as-she-exits-briefing-amid-jeers/",
    "timestamp": "2025-11-20T20:05:29Z"
  },
  {
    "title": "HHS gold standard study flips ‘gender affirming care’ on its head as Dems keep pushing trans issues at SCOTUS",
    "description": "Department of Health and Human Services report warns of risks from transgender medical procedures for children as Democrats continue supporting such treatments.",
    "link": "https://www.foxnews.com/politics/hhs-gold-standard-study-flips-gender-affirming-care-its-head-dems-continue-pushing-issue-scotus",
    "timestamp": "2025-11-20T20:05:14Z"
  },
  {
    "title": "US troops INVADE Mexico in dramatic escalation of tensions as Pentagon scrambles to contain the fallout",
    "description": "American troops have stormed a Mexican beach setting off a diplomatic firestorm amid soaring tensions after Donald Trump threatened to bomb the country. US 'contractors' arrived by boat on Monday to 'Playa Bagdad', driving signs into the sand near where the R…",
    "link": "https://freerepublic.com/focus/f-news/4353668/posts",
    "timestamp": "2025-11-20T20:03:41Z"
  },
  {
    "title": "Cracker Barrel shareholders ax DEI specialist over logo flap, spare CEO",
    "description": "Cracker Barrel shareholders spared CEO Julie Felss Masino after a branding crisis that wiped out hundreds of millions of dollars in value.",
    "link": "https://nypost.com/2025/11/20/business/cracker-barrel-shareholders-ax-dei-specialist-over-logo-flap-keep-ceo/",
    "timestamp": "2025-11-20T20:03:02Z"
  },
  {
    "title": "Trump Quips He’ll Fire Bessent If Interest Rates Not Lowered",
    "description": "President Donald Trump suggested he would fire Scott Bessent if the Treasury secretary doesn't help secure lower interest rates, ...",
    "link": "https://biztoc.com/x/e0495c007d195bea",
    "timestamp": "2025-11-20T20:02:45Z"
  },
  {
    "title": "Trump Calls 6 Democrats 'Traitors,' Claims It's 'Punishable by Death' & Reposts Suggestion to Hang Them",
    "description": "President Donald Trump is going off the rails yet again. The 79-year-old President of the United States, who recently confused a dementia test for an IQ test, called out a group of Democrats who questioned his administration. Keep reading to find out more… Hi…",
    "link": "https://www.justjared.com/2025/11/20/trump-calls-6-democrats-traitors-claims-its-punishable-by-death-reposts-suggestion-to-hang-them/",
    "timestamp": "2025-11-20T20:02:15Z"
  },
  {
    "title": "FCC Chairman Carr launches probe into BBC for 'intentionally distorting' Trump's Jan. 6 speech in documentary",
    "description": "FCC Chairman Brendan Carr sent a letter to the BBC, NPR and PBS on Wednesday over the BBC \"intentionally distorting\" President Donald Trump’s Jan. 6, 2021, speech.",
    "link": "https://www.foxnews.com/media/fcc-chairman-carr-launches-probe-bbc-intentionally-distorting-trumps-jan-6-speech-documentary",
    "timestamp": "2025-11-20T20:01:24Z"
  },
  {
    "title": "Trump administration announces plan for new oil drilling off the coasts of California and Florida",
    "description": "WASHINGTON (AP) — The Trump administration announced on Thursday new oil drilling off the California and Florida coasts for the first time in decades, advancing a project that critics say could harm coastal communities and ecosystems, as President Donald Trum…",
    "link": "https://financialpost.com/pmn/trump-administration-announces-plan-for-new-oil-drilling-off-the-coasts-of-california-and-florida",
    "timestamp": "2025-11-20T20:01:11Z"
  },
  {
    "title": "Trump and Republicans again face a tough political battle over Obama’s health care law",
    "description": "President Donald Trump is once more targeting former President Barack Obama’s signature health care law, and Trump is picking a political fight before next year’s elections.",
    "link": "https://biztoc.com/x/51af6c5aba0a2cda",
    "timestamp": "2025-11-20T20:01:10Z"
  },
  {
    "title": "Coast Guard to remove swastikas and nooses from its list of hate symbols",
    "description": "On the first day of Donald Trump second term, the administration fired Adm. Linda Fagan, the commandant of the U.S. Coast Guard, evicting her from her home with three hours of notice. That Fagan was a four-star admiral and the first woman to lead a branch of …",
    "link": "https://biztoc.com/x/8896675464af5dea",
    "timestamp": "2025-11-20T20:00:52Z"
  },
  {
    "title": "DOJ Charges House Democrat for Allegedly Stealing $5 Million in FEMA Funds",
    "description": "\"This is an unjust, baseless, sham indictment — and I am innocent. The timing alone is curious and clearly meant to distract from far more pressing national issues.\"\nThe post DOJ Charges House Democrat for Allegedly Stealing $5 Million in FEMA Funds first app…",
    "link": "https://legalinsurrection.com/2025/11/doj-charges-house-democrat-for-allegedly-stealing-5-million-in-fema-funds/",
    "timestamp": "2025-11-20T20:00:50Z"
  },
  {
    "title": "Exclusive: Treasury Department Issues Historic Rule to Prevent Illegal Aliens from Securing Income Tax Credits",
    "description": "President Donald Trump’s Treasury Department will issue a new rule that prevents illegal aliens and foreign nationals from securing income tax credits such as the lucrative Earned Income Tax Credit and Additional Child Tax Credit, Breitbart News has exclusive…",
    "link": "https://freerepublic.com/focus/f-news/4353665/posts",
    "timestamp": "2025-11-20T20:00:39Z"
  },
  {
    "title": "Ukraine and Europe cannot reject Trump's plan - they will play for time and hope he can still be persuaded to desert the Kremlin",
    "description": "\"Terrible\", \"weird\", \"peculiar\" and \"baffling\" - some of the adjectives being levelled by observers at the Donald Trump administration's peace plan for Ukraine.",
    "link": "https://news.sky.com/story/ukraine-and-europe-cannot-reject-trumps-plan-they-will-play-for-time-and-hope-he-can-still-be-persuaded-to-desert-the-kremlin-13473348",
    "timestamp": "2025-11-20T20:00:00Z"
  },
  {
    "title": "Minnesota state senator on Trump sedition remarks: ‘I cannot describe how f‑‑‑ing dangerous this is’",
    "description": "Minnesota state Sen. Erin Maye Quade (D) on Thursday slammed President Trump after he called six Democratic lawmakers “traitors” and suggested their request ...",
    "link": "https://thehill.com/homenews/administration/5615413-erin-maye-quade-minnesota-trump-democrats-attack/",
    "timestamp": "2025-11-20T19:59:59Z"
  },
  {
    "title": "Former U.S. vice president Dick Cheney’s family: Who he leaves behin",
    "description": "Former U.S. Vice President Dick Cheney died at age 84, leaving behind his two daughters and seven grandchildren. His family shared warm memories about him and spoke about his strong values. Liz Cheney’s public life and Mary Cheney’s private life show two side…",
    "link": "https://economictimes.indiatimes.com/news/international/us/former-u-s-vice-president-dick-cheneys-family-who-he-leaves-behin/articleshow/125471690.cms",
    "timestamp": "2025-11-20T19:59:56Z"
  },
  {
    "title": "Trump administration announces plan for new oil drilling off the coasts of California and Florida",
    "description": "Critics say the project could harm coastal communities and ecosystems.",
    "link": "https://www.bostonherald.com/2025/11/20/trump-offshore-drilling/",
    "timestamp": "2025-11-20T19:59:20Z"
  }
]