[
  {
    "title": "New Trump move 'puts us in danger' of 'brutal' Iran 'retaliation': conservative",
    "description": "Donald Trump's latest move \"puts us in danger,\" according to a former Republican strategist Wednesday.Conservative anti-Trump activist Rick Wilson, who co-founded the Lincoln Project and hosts the group's podcast, published a Substack post called The Only Thi…",
    "link": "https://www.rawstory.com/trump-iran-danger-rick-wilson/",
    "timestamp": "2025-06-25T11:38:26Z"
  },
  {
    "title": "Nato’s Mark Rutte calls Donald Trump ‘daddy’ while speaking at summit as damage to Iran’s nuclear programme ‘inconclusive’",
    "description": "NATO secretary-general Mark Rutte has described US president Donald Trump as “a man of strength” and “daddy” while speaking at the NATO summit in the Hague.",
    "link": "https://www.independent.ie/world-news/natos-mark-rutte-calls-donald-trump-daddy-while-speaking-at-summit-as-damage-to-irans-nuclear-programme-inconclusive/a1008592080.html",
    "timestamp": "2025-06-25T11:34:47Z"
  },
  {
    "title": "Trump says Nato defence spend rising to 5% of GDP is 'big win' for US and the West",
    "description": "In a statement, called the Hague Declaration, members also say: \"We reaffirm our ironclad commitment to collective defence\".",
    "link": "https://www.bbc.com/news/live/cm2ld0e0rzkt",
    "timestamp": "2025-06-25T11:34:03Z"
  },
  {
    "title": "Tesla's long-awaited robotaxi rollout faced bumps in the road",
    "description": "The first Tesla robotaxi rides were available on Sunday. It came at a turbulent time for Elon Musk.",
    "link": "https://www.businessinsider.com/tesla-robotaxi-austin-waymo-google-video-elon-musk-uber-stock-2025-6",
    "timestamp": "2025-06-25T11:33:01Z"
  },
  {
    "title": "Trump says damage from Iran strikes was severe despite 'inconclusive' intelligence",
    "description": "THE HAGUE: US President Donald Trump said on Wednesday (Jun 25) that the damage to Iranian nuclear sites from American missile strikes over the weekend was severe, even as he acknowledged that the available intelligence on the matter was inconclusive. His com…",
    "link": "https://www.channelnewsasia.com/world/trump-us-iran-strikes-damage-severe-intelligence-report-5202861",
    "timestamp": "2025-06-25T11:32:59Z"
  },
  {
    "title": "Singapore welcomes Iran-Israel ceasefire, urges all parties to abide by it",
    "description": "SINGAPORE: Singapore's Ministry of Foreign Affairs (MFA) said on Wednesday (Jun 25) that it welcomed the recently announced ceasefire between Israel and Iran. \"We u",
    "link": "https://www.channelnewsasia.com/singapore/israel-iran-ceasefire-singapore-urges-all-parties-abide-5202811",
    "timestamp": "2025-06-25T11:32:43Z"
  },
  {
    "title": "This Pride Month, the Backlash Has Officially Arrived",
    "description": "Young LGBTQ people are facing the prospect of losing rights they thought they’d never have to worry about.",
    "link": "https://www.theatlantic.com/culture/archive/2025/06/whiplash-pride-month/683315/",
    "timestamp": "2025-06-25T11:30:00Z"
  },
  {
    "title": "Is New Orleans Becoming A Sanctuary City For Mutants? (X-Men Spoilers)",
    "description": "In the current post-Krakoan X-Men titles, the world has turned even more anti-mutant than usual, especially in America. As the government takes over the X-Mansion, imprisons, interrogates and tortures mutants, Uncanny X-Men has entrenched that history of anti…",
    "link": "https://bleedingcool.com/comics/is-new-orleans-becoming-a-sanctuary-city-for-mutants-x-men-spoilers/",
    "timestamp": "2025-06-25T11:28:34Z"
  },
  {
    "title": "Crypto Stocks Soar as Iran-Israel Ceasefire Holds – Best New Crypto to Buy",
    "description": "US crypto stocks are rallying following US President Donald Trump’s announcement of a phased ceasefire between Iran and Israel. The pause in fighting was initially set to begin June 24, but the truce was broken within an hour: Iran allegedly fired missiles, w…",
    "link": "https://bitcoinist.com/new-crypto-to-buy-as-stocks-soar-after-ceasefire/",
    "timestamp": "2025-06-25T11:28:08Z"
  },
  {
    "title": "Join the ‘Stop the Billionaire Giveaway’ Bus Tour to Fight the GOP’s Big Ugly Budget Bill",
    "description": "As the big, ugly GOP budget bill moves through Congress, advocates for a fair economy are hitting the road. Two organizations—Fair Share America and Unrig Our Economy—are bringing experts and stakeholders on a “Stop the Billionaire Giveaway” bus tour to publi…",
    "link": "https://inequality.org/article/billionaire-giveaway-bus-tour/",
    "timestamp": "2025-06-25T11:26:03Z"
  },
  {
    "title": "Zelensky’s Wartime Leadership Provides 7 Crisis Management Lessons",
    "description": "How President Volodymyr Zelensky has led Ukraine during its war with Russia provides important crisis leadership lessons for corporate executives.",
    "link": "https://www.forbes.com/sites/edwardsegal/2025/06/25/zelenskys-wartime-leadership-provides-7-crisis-management-lessons/",
    "timestamp": "2025-06-25T11:24:42Z"
  },
  {
    "title": "Did Donald Trump's Bombing of Iran Fail? What We Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has hit back at reports that the strikes he ordered on Iranian nuclear sites were not as effective as he had claimed as questions grow over the success of the attacks.\nTrump had said tha…",
    "link": "https://biztoc.com/x/80091384c3ad6131",
    "timestamp": "2025-06-25T11:23:19Z"
  },
  {
    "title": "Damage assessment of Iran nuclear sites and what to watch in NBA draft: Morning Rundown",
    "description": "An early assessment challenges Trump and Netanyahu's assertions that Iran's nuclear capabilities have been \"obliterated.\"",
    "link": "https://www.nbcnews.com/news/us-news/damage-iran-nuclear-sites-nba-draft-morning-rundown-rcna214919",
    "timestamp": "2025-06-25T11:23:05Z"
  },
  {
    "title": "NATO Chief Praises Trump as 'Man of Peace'",
    "description": "4 min ago\nNATO Chief Praises Trump as 'Man of Peace'\nNATO Secretary-General Mark Rutte on Wednesday praised President Donald Trump and the U.S. strikes on Iran's nuclear facilities.\n\"You took out the nuclear capability of Iran. This was crucial,\" Rutte told T…",
    "link": "https://biztoc.com/x/17f2edabefb2db70",
    "timestamp": "2025-06-25T11:23:03Z"
  },
  {
    "title": "Trump Made 'Europe…Pay In A Big Way:' NATO Chief Lauds Role In Boosting Defense Spending",
    "description": "Mark Rutte, the NATO Secretary-General, has extended his appreciation to President Donald Trump for his significant contribution to the escalation of European defense spending.\nWhat Happened: Rutte’s message to Trump, which was shared on the president’s socia…",
    "link": "https://biztoc.com/x/40b803cebfe69291",
    "timestamp": "2025-06-25T11:22:50Z"
  },
  {
    "title": "Business Brief: Did Trump outsmart everyone on inflation?",
    "description": "Good morning. Another monthly inflation report shows Canadian prices behaving relatively well, with no sign yet of the inflation time bomb that economists warned us about, either here or in the U.S. Now U.S. President Donald Trump is taking a victory lap, say…",
    "link": "https://biztoc.com/x/0dd4cabd3c52f0e2",
    "timestamp": "2025-06-25T11:22:48Z"
  },
  {
    "title": "Did Donald Trump's Bombing of Iran Fail? What We Know",
    "description": "U.S. strikes on Iran's nuclear sites only set Tehran's nuclear program back by months, according to an intelligence leak reported by CNN.",
    "link": "https://www.newsweek.com/iran-trump-nuclear-destroyed-2090347",
    "timestamp": "2025-06-25T11:22:08Z"
  },
  {
    "title": "Alina Habba slapped with new ethics complaint over pursuit of NJ Democrats",
    "description": "Former Donald Trump personal attorney Alina Habba has been slapped with a formal ethics complaint over her conduct in her latest incarnation as acting U.S. attorney for the District of New Jersey.According to a report from Politico, as Habba's case against Re…",
    "link": "https://www.rawstory.com/alina-habba-ethics-complaint-nj/",
    "timestamp": "2025-06-25T11:21:56Z"
  },
  {
    "title": "Iran's parliament approves bill to suspend co-operation with UN nuclear watchdog: report",
    "description": "Iran's parliament approved a bill on Wednesday to suspend co-operation with the UN nuclear watchdog, state-affiliated outlet Nournews reported.",
    "link": "https://www.cbc.ca/news/world/iran-un-nuclear-watchdog-1.7570165",
    "timestamp": "2025-06-25T11:20:38Z"
  },
  {
    "title": "Democrats Warned About Unelected, Rogue Judges — Until Trump Started Fighting Them",
    "description": "Everything Democrats warned about before Trump returned to office is exactly what they’re either now celebrating or dismissing. President Donald Trump’s second term has been plagued by leftist-led lawfare — with unelected, inferior court judges usurping execu…",
    "link": "https://freerepublic.com/focus/f-news/4325167/posts",
    "timestamp": "2025-06-25T11:20:08Z"
  },
  {
    "title": "Iran's 'sleeper cell' threat proves we MUST secure our borders (Daniel McCarthy/New York Post)",
    "description": "Daniel McCarthy / New York Post:\nIran's ‘sleeper cell’ threat proves we MUST secure our borders  —  The Iran crisis of the past two weeks isn't just about nuclear weapons — it's also an urgent reminder that border security is national security.  —  President …",
    "link": "https://www.memeorandum.com/250625/p16",
    "timestamp": "2025-06-25T11:20:01Z"
  },
  {
    "title": "Trump’s Opponents Want to Humble the USA - What do Iran’s nuclear ambitions have to do with America First? A lot.",
    "description": "Internal MAGA opposition to President Donald Trump’s support for Israel’s campaign to destroy the Iranian nuclear program is not about helping him preserve his legacy or holding him to his promises about avoiding Middle East conflicts or foregoing regime-chan…",
    "link": "https://freerepublic.com/focus/f-chat/4325166/posts",
    "timestamp": "2025-06-25T11:19:20Z"
  },
  {
    "title": "Trump 'Proud' of Israel on Ceasefire: 'Technically, They Were Right'",
    "description": "President Donald Trump said Wednesday at the NATO Summit in Brussels that he was \"proud\" of Israel for refraining from a broader strike on Iran after a ceasefire violation even though \"technically, they were right.\"\nThe post Trump ‘Proud’ of Israel on Ceasefi…",
    "link": "https://www.breitbart.com/middle-east/2025/06/25/trump-proud-of-israel-on-ceasefire-technically-they-were-right/",
    "timestamp": "2025-06-25T11:19:03Z"
  },
  {
    "title": "Trump judicial nominee Bove faces questions as whistleblower claims he floated ignoring court orders",
    "description": "A Justice Department official under scrutiny over a whistleblower’s claims he suggested ignoring court orders will face questions on Capitol Hill as he seeks confirmation as a federal judge hearing cases from Delaware, New Jersey and Pennsylvania",
    "link": "https://abcnews.go.com/US/wireStory/trump-judicial-nominee-bove-faces-questions-whistleblower-claims-123185870",
    "timestamp": "2025-06-25T11:18:15Z"
  },
  {
    "title": "Poland’s Democratic Deadlock",
    "description": "Poland’s embattled Prime Minister Donald Tusk emerged bruised but still standing after his government survived a parliamentary vote of confidence on 11 June. He’d called the vote, which he won by 243 to 210, just days after the presidential candidate of his C…",
    "link": "https://www.ipsnews.net/2025/06/polands-democratic-deadlock/",
    "timestamp": "2025-06-25T11:17:46Z"
  },
  {
    "title": "Trump says Iran nuclear program 'gone for years,' rejects early Pentagon analysis",
    "description": "President Donald Trump again claimed \"total obliteration\" of Iran's nuclear program during the NATO summit in the Netherlands on Wednesday.",
    "link": "https://abcnews.go.com/International/trump-iran-nuclear-program-years-rejects-early-pentagon/story?id=123185760",
    "timestamp": "2025-06-25T11:17:35Z"
  },
  {
    "title": "'So fake, corny': JD Vance makes controversial gesture during Ohio speech as he doubles down on Trump's antics",
    "description": "US Vice President JD Vance is being mocked on social media after he made a controversial gesture while delivering a speech in Ohio. The vice president made the surprise gesture while telling a story at a Republican dinner in Ohio. Vance's gesture Tuesday nigh…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/so-fake-corny-jd-vance-makes-controversial-gesture-during-ohio-speech-as-he-doubles-down-on-trumps-antics/articleshow/122069647.cms",
    "timestamp": "2025-06-25T11:16:29Z"
  },
  {
    "title": "15 of the best and worst outfits Usha Vance has worn as second lady",
    "description": "Usha Vance's best looks as second lady have been effortlessly stylish, though not every outfit has matched the occasion.",
    "link": "https://www.businessinsider.com/usha-vance-best-worst-outfits-second-lady-2025-6",
    "timestamp": "2025-06-25T11:16:01Z"
  },
  {
    "title": "Crypto Daybook Americas: Bitcoin Nears $107K as Ceasefire Lifts Markets, Powell Eyed",
    "description": "The day ahead in crypto: June 25, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/06/25/crypto-daybook-americas-bitcoin-nears-usd107k-as-ceasefire-lifts-markets-powell-eyed",
    "timestamp": "2025-06-25T11:15:00Z"
  },
  {
    "title": "Trump Presses NATO on 5% Defense Goal Amid Iran Ceasefire Talks",
    "description": "Trump demands NATO boost defense spending to 5% as Iran-Israel ceasefire overshadows Ukraine at summit. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-administration-iran-israel-middle-east-live-updates-2090459",
    "timestamp": "2025-06-25T11:12:20Z"
  },
  {
    "title": "Giant Leviathan Gas Field Offshore Israel Resumes Operations",
    "description": "The massive Leviathan gas field offshore Israel is resuming production on Wednesday, following two weeks in which it was shut down due to the Israel-Iran conflict. Leviathan, operated by U.S. supermajor Chevron, was shut down on June 13, after the Israeli str…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Giant-Leviathan-Gas-Field-Offshore-Israel-Resumes-Operations.html",
    "timestamp": "2025-06-25T11:12:15Z"
  },
  {
    "title": "Trump Hits ‘Scum’ for Revealing Bombing Was Botched",
    "description": "\"President Donald Trump lashed out at 'scum' who revealed his much-championed strikes against Iran were likely far less effective than he claims,\" the Daily Beast reports. Said Trump: “CNN is scum, MSDNC is scum, the",
    "link": "https://politicalwire.com/2025/06/25/trump-hits-scum-for-revealing-bombing-was-botched/",
    "timestamp": "2025-06-25T11:12:09Z"
  },
  {
    "title": "Joe Rogan, Bernie Sanders spar over big money in politics after Sanders complains about Musk's spending",
    "description": "On Joe Rogan's podcast, Bernie Sanders called Citizens United \"maybe the worst Supreme Court decision ever\" and complained about Elon Musk's role in Donald Trump's win.",
    "link": "https://www.foxnews.com/media/joe-rogan-bernie-sanders-spar-over-big-money-politics-after-sanders-complains-about-musk-spending",
    "timestamp": "2025-06-25T11:10:18Z"
  },
  {
    "title": "Supreme Court ending term with birthright, porn, voting rights...",
    "description": "Supreme Court ending term with birthright, porn, voting rights...\r\n\n \n \n \n (First column, 14th story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.yahoo.com/news/us-supreme-court-ending-term-074512136.html",
    "timestamp": "2025-06-25T11:07:36Z"
  },
  {
    "title": "Trump Confirms U.S. Backs NATO 'All The Way' as Alliance agrees Massive Defence Spending Rebalance to Europe",
    "description": "\"NATO is going to become very strong with us\", U.S. President Donald Trump said as he arrived at the alliance summit at The Hague.\nThe post Trump Confirms U.S. Backs NATO ‘All The Way’ as Alliance agrees Massive Defence Spending Rebalance to Europe appeared f…",
    "link": "https://www.breitbart.com/europe/2025/06/25/trump-confirms-u-s-backs-nato-all-the-way-at-summit/",
    "timestamp": "2025-06-25T11:05:56Z"
  },
  {
    "title": "WATCH: NATO Chief Praises ‘Daddy’ Trump for Israel-Iran F-Bomb",
    "description": "Rutte bizarrely called Trump “daddy” while applauding the president for cursing out Israel and Iran in an on-air press gaggle on Tuesday.\nThe post WATCH: NATO Chief Praises ‘Daddy’ Trump for Israel-Iran F-Bomb first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/watch-nato-chief-praises-daddy-trump-for-israel-iran-f-bomb/",
    "timestamp": "2025-06-25T11:05:47Z"
  },
  {
    "title": "Nato set to agree big spike in defence spending at 'historic summit'",
    "description": "Nato leaders are meeting in The Hague to decide on ramping up defence spending to 5% of their countries' economic output.",
    "link": "https://www.bbc.com/news/articles/cj4en8djwyko",
    "timestamp": "2025-06-25T11:05:19Z"
  },
  {
    "title": "Alvin Bragg blows out Democratic challenger in Manhattan DA primary",
    "description": "Manhattan DA Alvin Bragg wins primary election with 70% support a year after prosecuting President Donald Trump in business records case.",
    "link": "https://www.foxnews.com/politics/alvin-bragg-blows-out-democratic-challenger-manhattan-da-primary",
    "timestamp": "2025-06-25T11:04:19Z"
  },
  {
    "title": "Buckingham Palace confirms Trump state visit invitation",
    "description": "No dates for the visit have been confirmed but it is understood September is said to be the most likely.",
    "link": "https://www.bbc.com/news/articles/cvg4589pweeo",
    "timestamp": "2025-06-25T11:03:45Z"
  },
  {
    "title": "WATCH LIVE: Trump adviser Kari Lake testifies in hearing on U.S. agency that runs Voice of America",
    "description": "Approximately 1,400 people at Voice of America and the U.S. Agency for Global Media, or 85% of its workforce, have lost their jobs since March, Kari Lake, Trump’s senior advisor to the agency, said earlier this week.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-adviser-kari-lake-testifies-in-hearing-on-u-s-agency-that-runs-voice-of-america",
    "timestamp": "2025-06-25T11:02:38Z"
  },
  {
    "title": "Video Shows Top Iranian Commander Alive, Defying Death Reports",
    "description": "Esmail Qaani, commander of Iran's IRGC Quds Force, appeared publicly in Tehran, disproving reports that he had been killed in Israeli strikes.",
    "link": "https://www.newsweek.com/irgc-commander-qanni-alive-israel-strike-2090365",
    "timestamp": "2025-06-25T11:01:50Z"
  },
  {
    "title": "Hamas claims progress in Gaza ceasefire talks",
    "description": "Saudi media reports renewed momentum in Gaza ceasefire negotiations; US President Trump says Iran strike may aid hostage release.",
    "link": "https://www.israelnationalnews.com/news/410635",
    "timestamp": "2025-06-25T11:01:06Z"
  },
  {
    "title": "Trump wants to declare 'Mission Accomplished' on Iran. Not so fast",
    "description": "President Donald Trump boards Air Force One at Morristown Municipal Airport in Morristown, New Jersey, on June 21, 2025 as he returns to the White House from his golf club in Bedminster, N.J.",
    "link": "https://biztoc.com/x/0fb3c91f99f3cd05",
    "timestamp": "2025-06-25T11:00:56Z"
  },
  {
    "title": "Russian official says Moscow has 'no intention' of supplying Iran with warheads, following Trump taunts",
    "description": "Former Russian President Dmitry Medvedev said that the U.S. strikes on Iranian nuclear facilities 'failed to achieve its objectives.\"",
    "link": "https://www.foxnews.com/politics/russian-official-says-moscow-has-no-intention-supplying-iran-warheads-following-trump-taunts",
    "timestamp": "2025-06-25T11:00:42Z"
  },
  {
    "title": "Top DOJ official faces test in Senate over nomination to become federal judge",
    "description": "Former Trump lawyer Emil Bove heads to Senate hearing amid heated debate over his qualifications to serve as a federal judge, from \"brilliant\" attorney to claims of bullying",
    "link": "https://www.foxnews.com/politics/top-doj-official-faces-test-senate-over-nomination-become-federal-judge",
    "timestamp": "2025-06-25T11:00:36Z"
  },
  {
    "title": "Elton John & Ryan White’s mom wrote about funding cuts to HIV & AIDS prevention",
    "description": "Embed from Getty Images You know how Donald Trump and his husky henchman RFK Jr. have been systematically dismantling all the vast healthcare agencies, panels and research that, you know, keep us alive? Plus the executive orders and budget proposals the Orang…",
    "link": "https://www.celebitchy.com/928314/elton_john_ryan_whites_mom_wrote_about_funding_cuts_to_hiv_aids_prevention/",
    "timestamp": "2025-06-25T11:00:33Z"
  },
  {
    "title": "Trump’s Truth Social Officialy Files For Bitcoin And Ethereum ETFs With NYSE",
    "description": "Trump Media and Technology Group Corp (TMTG) has officially filed for its second crypto exchange-traded fund (ETF), focusing on Bitcoin (BTC) and Ethereum (ETH), as detailed in a recent filing to the Securities and Exchange Commission (SEC).  Trump Media File…",
    "link": "http://www.newsbtc.com/bitcoin-news/trumps-truth-social-officialy-files-for-bitcoin-and-ethereum-etfs-with-nyse/",
    "timestamp": "2025-06-25T11:00:14Z"
  },
  {
    "title": "Exclusive: Sen. Moreno to Introduce Resolution Backing Trump for Nobel Peace Prize",
    "description": "Sen. Bernie Moreno (R-OH) is set to introduce a Senate resolution on Wednesday urging the Norwegian Nobel Committee to award President Donald Trump the 2025 Nobel Peace Prize, Breitbart News has learned exclusively.\nThe post Exclusive: Sen. Moreno to Introduc…",
    "link": "https://www.breitbart.com/politics/2025/06/25/exclusive-sen-moreno-introduce-resolution-backing-trump-nobel-peace-prize/",
    "timestamp": "2025-06-25T11:00:03Z"
  },
  {
    "title": "No, Liz Cheney didn't pen letter urging Democratic Party to fight Trump's 'authoritarian machine'",
    "description": "Liz Cheney wrote a letter to the Democratic Party in 2025 urging it to do more to fight the Trump administration’s “authoritarian machine.”",
    "link": "https://www.snopes.com//fact-check/liz-cheney-facebook-letter-fight-authoritarians/",
    "timestamp": "2025-06-25T11:00:00Z"
  },
  {
    "title": "A Cease-Fire Without a Conclusion",
    "description": "Iran’s regime has proved resilient, even in its toughest hour.",
    "link": "https://www.theatlantic.com/international/archive/2025/06/iran-israel-cease-fire/683319/",
    "timestamp": "2025-06-25T11:00:00Z"
  },
  {
    "title": "NATO allies agree 'ironclad commitment' to collective defence - but no condemnation of Russia's war in Ukraine",
    "description": "Donald Trump and his NATO allies confirmed their \"ironclad commitment\" to collective defence in a communique released at the end of a brief summit in The Hague.",
    "link": "https://news.sky.com/story/nato-allies-agree-ironclad-commitment-to-collective-defence-but-no-condemnation-of-russias-war-in-ukraine-13388393",
    "timestamp": "2025-06-25T10:58:00Z"
  },
  {
    "title": "Trump compares Iran strikes to Hiroshima and Nagasaki",
    "description": "US President Donald Trump has compared the US strikes in Iran to the nuclear bombs dropped on Hiroshima and Nagasaki,",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/25/trump-compares-iran-strikes-to-hiroshima-and-nagasaki",
    "timestamp": "2025-06-25T10:57:50Z"
  },
  {
    "title": "Links 6/25/2025",
    "description": "Our pacific daily links: killer catfish, heat domes and strain on grids, Hauwei expanding, Israel v. Iran cessation debate, nearly 400,000 missing in Gaza, NATO wobbles, Pamama protests, EU readies retaliatory tariffs, UK pet euthanasia up, Mamdani big NYC wi…",
    "link": "https://www.nakedcapitalism.com/2025/06/links-6-25-2025.html",
    "timestamp": "2025-06-25T10:55:17Z"
  },
  {
    "title": "Todd and Julie Chrisley describe moment they learned about pardon: ‘God touched President Trump’s heart’",
    "description": "The \"Chrisley Knows Best\" star didn't initially believe what he had heard until a corrections officer asked him if he was doing well.",
    "link": "https://nypost.com/2025/06/25/entertainment/todd-and-julie-chrisley-describe-moment-they-were-pardoned-by-trump/",
    "timestamp": "2025-06-25T10:54:07Z"
  },
  {
    "title": "Pakistan says trade talks with US to conclude next week",
    "description": "KARACHI (Reuters) -Pakistan and the U.S. have resolved to conclude trade talks next week, the South Asian nation said on Wednesday after a meeting between...",
    "link": "https://finance.yahoo.com/news/pakistan-says-trade-talks-us-105046474.html",
    "timestamp": "2025-06-25T10:50:46Z"
  },
  {
    "title": "Morning Bid: Fed rate bets surge as oil calms",
    "description": "As the geopolitical center of gravity shifts from the Middle East to the NATO summit, Wall Street turns its attention back to the domestic economy and rising...",
    "link": "https://finance.yahoo.com/news/morning-bid-fed-rate-bets-104828298.html",
    "timestamp": "2025-06-25T10:48:28Z"
  },
  {
    "title": "Bernie Sanders Clashes With Joe Rogan Over Trump’s Media Lawsuits: ‘The Impact Is Clearly Intimidation’",
    "description": "Joe Rogan and Sen. Bernie Sanders (I-VT) clashed on Tuesday over the justification of President Donald Trump's several lawsuits against media organizations.\nThe post Bernie Sanders Clashes With Joe Rogan Over Trump’s Media Lawsuits: ‘The Impact Is Clearly Int…",
    "link": "https://www.mediaite.com/politics/bernie-sanders-clashes-with-joe-rogan-over-trumps-media-lawsuits-the-impact-is-clearly-intimidation/",
    "timestamp": "2025-06-25T10:48:03Z"
  },
  {
    "title": "Rupee falls 2 paise to close at 86.07 against US dollar",
    "description": "At the interbank foreign exchange, the rupee opened at 86.00 against the US dollar and traded in the range of 85.79-86.14 before settling at 86.07 (provisional), down 2 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-2-paise-to-close-at-8607-against-us-dollar/article69735597.ece",
    "timestamp": "2025-06-25T10:45:04Z"
  },
  {
    "title": "Beijing’s No. 2 says China is growing into a ‘major consumption powerhouse,’ even amid ‘intensifying’ trade frictions",
    "description": "Premier Li Qiang said Wednesday that the global economy was \"undergoing profound changes\"—a reference to swinging tariffs from Donald Trump.",
    "link": "https://fortune.com/asia/2025/06/25/china-premier-li-qiang-tianjin-tariffs-trade/",
    "timestamp": "2025-06-25T10:43:57Z"
  },
  {
    "title": "Jasmine Crockett Gives Up on Power Grab as Key Committee Selects New Top Dem",
    "description": "\"It was clear by the numbers that my style of leadership is not exactly what they were looking for.\" Well, duh.",
    "link": "https://www.westernjournal.com/jasmine-crockett-gives-power-grab-key-committee-selects-new-top-dem/",
    "timestamp": "2025-06-25T10:41:33Z"
  },
  {
    "title": "Donald Trump sends scathing message to Vladimir Putin following phone call between them",
    "description": "After a phone call between Vladimir Putin and Donald Trump, the US president had a scathing message for his Russian counterpart.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-phone-call-message-putin-102626-20250625",
    "timestamp": "2025-06-25T10:40:17Z"
  },
  {
    "title": "Tesla's European car sales nosedive for fifth month as customers switch to Chinese EVs",
    "description": "The U.S. EV maker has sustained brand and reputational damage in part due to CEO Elon Musk's incendiary rhetoric and political activity.",
    "link": "https://www.cnbc.com/2025/06/25/teslas-european-car-sales-fall-as-customers-switch-to-chinese-evs.html",
    "timestamp": "2025-06-25T10:38:58Z"
  },
  {
    "title": "Can Nato keep Donald Trump happy?",
    "description": "Donald Trump arrived at this year's annual gathering of Nato leaders fresh from brokering a ceasefire between Israel and Iran.\nWhile the US president comes looking to brandish his credentials as a peacemaker, for European officials the goal of the summit is \"…",
    "link": "https://biztoc.com/x/d52296f1b63b72ed",
    "timestamp": "2025-06-25T10:38:53Z"
  },
  {
    "title": "Trump Says Iran's Nuclear Program Set Back Decades",
    "description": "11 min ago\nTrump Says Iran's Nuclear Program Set Back Decades\nPresident Donald Trump said he thinks Iran's nuclear program was set back \"basically decades\" by U.S. strikes, refuting a leaked intelligence report suggesting otherwise, as he spoke to reporters a…",
    "link": "https://biztoc.com/x/8e17106bb7f1c190",
    "timestamp": "2025-06-25T10:38:33Z"
  },
  {
    "title": "Transcript: Trump Explodes in Fury as Media Reveals Fresh Iran Fiasco",
    "description": "The following is a lightly edited transcript of the June 25 episode of the Daily Blast podcast. Listen to it here.\r\n[Editor’s note: After this episode was recorded, The New York Times confirmed the CNN report we discussed here, reporting that a classified int…",
    "link": "https://newrepublic.com/article/197194/transcript-trump-explodes-fury-media-reveals-fresh-iran-fiasco",
    "timestamp": "2025-06-25T10:38:20Z"
  },
  {
    "title": "Brits spending more time on mobile phones than TV",
    "description": "The amount of time Individuals spend looking at their phones surpasses the telly for the first time.",
    "link": "https://www.bbc.com/news/articles/crrqdw9v02eo",
    "timestamp": "2025-06-25T10:31:54Z"
  },
  {
    "title": "New York City Mayor Election: Updates on Cuomo, Mamdani & More",
    "description": "Former Governor Andrew Cuomo and fellow mayoral candidate Zohran Mamdani were leading in the polls. Get an update on the primary Democratic election here.",
    "link": "https://hollywoodlife.com/2025/06/25/new-york-city-mayor-election-updates/",
    "timestamp": "2025-06-25T10:31:47Z"
  },
  {
    "title": "Can Nato keep Donald Trump happy?",
    "description": "Military alliance pulls out all the stops to woo US president on his peacemaker victory lap",
    "link": "https://theweek.com/defence/can-nato-keep-donald-trump-happy",
    "timestamp": "2025-06-25T10:31:18Z"
  },
  {
    "title": "Linda McMahon opens up on ongoing battle to combat trans inclusion in women's sports",
    "description": "Education Secretary Linda McMahon warned states ignoring President Donald Trump's executive order on women's sports face Title IX investigations and potential federal funding cuts.",
    "link": "https://www.foxnews.com/sports/linda-mcmahon-talks-ongoing-battle-combat-trans-inclusion-womens-sports",
    "timestamp": "2025-06-25T10:30:30Z"
  },
  {
    "title": "Trump says China ‘can now continue to purchase oil from Iran’—but he hopes Beijing will buy U.S. crude instead",
    "description": "U.S. President Donald Trump on Tuesday appeared to propose a change in policy towards Iran, suggesting that China—one of Iran’s few allies and a major trading partner—might be permitted to purchase Iranian oil. \nIn a social media post on Tuesday, Trump wrote …",
    "link": "https://biztoc.com/x/38d5f98c89ffeac8",
    "timestamp": "2025-06-25T10:27:57Z"
  },
  {
    "title": "Trump's budget plan shifts wealth from young to old, analysts say",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump's sweeping tax-cut legislation would effectively transfer wealth from younger Americans to older...",
    "link": "https://ca.news.yahoo.com/trumps-budget-plan-shifts-wealth-102712730.html",
    "timestamp": "2025-06-25T10:27:12Z"
  },
  {
    "title": "Rupee ends a tad lower, month-end importer dollar bids weigh",
    "description": "The Indian rupee weakened slightly on Wednesday. This was due to dollar demand from importers at the end of the month. Gains in Indian stocks and improved risk appetite limited the rupee's losses. A fragile truce between Iran and Israel also helped. The dolla…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-ends-a-tad-lower-month-end-importer-dollar-bids-weigh/articleshow/122068629.cms",
    "timestamp": "2025-06-25T10:23:13Z"
  },
  {
    "title": "Trump Torches ‘Disgraceful’ CNN, ‘Failing’ NYT Over Leaked Iran Intel Report: ‘Fake News!’",
    "description": "Trump slammed “disgraceful\" CNN and the \"failing\" New York Times, accusing the outlets of distorting Iran intelligence to embarrass his administration.\nThe post Trump Torches ‘Disgraceful’ CNN, ‘Failing’ NYT Over Leaked Iran Intel Report: ‘Fake News!’ first a…",
    "link": "https://www.mediaite.com/media/news/trump-torches-disgraceful-cnn-failing-nyt-over-leaked-iran-intel-report-fake-news/",
    "timestamp": "2025-06-25T10:20:40Z"
  },
  {
    "title": "Exclusive-US exchanges, SEC in talks to ease public company regulations",
    "description": "NEW YORK (Reuters) -U.S. exchange operators are in talks with the Securities and Exchanges Commission on easing regulatory burdens for public companies, as...",
    "link": "https://finance.yahoo.com/news/exclusive-us-exchanges-sec-talks-101858903.html",
    "timestamp": "2025-06-25T10:18:58Z"
  },
  {
    "title": "Trump's nephew hints at family dementia amid concerns over president's health - NewsBreak",
    "description": "Fred Trump III, the nephew of former President Donald Trump, said he is worried about his uncle's mental state and believes dementia 'runs in the family'",
    "link": "https://www.newsbreak.com/share/4071499328125-trump-s-nephew-hints-at-family-dementia-amid-concerns-over-president-s-health?_f=app_share&amp;pd=0Hkk0WBv&amp;lang=en_US&amp;send_time=1750846685&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.25.0.37%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v9%2Cns_foryou_blend_exp_25q2-v8%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v2&amp;s=i2",
    "timestamp": "2025-06-25T10:18:30Z"
  },
  {
    "title": "Trump says China ‘can now continue to purchase oil from Iran’—but he hopes Beijing will buy U.S. crude instead",
    "description": "China currently buys around 90% of Iran’s oil exports.",
    "link": "https://fortune.com/asia/2025/06/25/trump-iran-china-oil-us-crude/",
    "timestamp": "2025-06-25T10:16:56Z"
  },
  {
    "title": "Deals Veteran Ken Moelis Sees World ‘Getting Better Every Day’",
    "description": "Ken Moelis, the veteran Wall Street dealmaker, predicted a golden era of prosperity across the globe, shrugging off tariff uncertainty and wars in the Middle East.",
    "link": "https://financialpost.com/pmn/business-pmn/deals-veteran-ken-moelis-sees-world-getting-better-every-day",
    "timestamp": "2025-06-25T10:16:15Z"
  },
  {
    "title": "European shares edge up as Middle East truce lifts sentiment",
    "description": "European shares experienced a slight increase on Wednesday, driven by investor optimism following the ceasefire between Israel and Iran. The pan-European STOXX 600 index rose by 0.2%. Auto stocks led sectoral gains, while media shares declined. Stellantis saw…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-up-as-middle-east-truce-lifts-sentiment/articleshow/122068463.cms",
    "timestamp": "2025-06-25T10:15:26Z"
  },
  {
    "title": "WATCH: Zohran Mamdani Vows to ‘Reject’ Trump’s ‘Fascism’ in NYC Primary Victory Speech",
    "description": "Mamdani quoted Nelson Mandela and vowed to \"reject\" Trump’s “fascism” in a victory speech after winning the Democratic NYC mayoral primary.\nThe post WATCH: Zohran Mamdani Vows to ‘Reject’ Trump’s ‘Fascism’ in NYC Primary Victory Speech first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/watch-zohran-mamdani-vows-to-reject-trumps-fascism-in-nyc-primary-victory-speech/",
    "timestamp": "2025-06-25T10:14:26Z"
  },
  {
    "title": "They voted for Trump. Most still back him - but not on everything",
    "description": "Despite overall approval for President Trump's immigration policies, some voters express concerns over tariff policies and federal workforce cuts. While many support Trump's border security efforts, economic uncertainty caused by federal cuts and tariffs is a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/they-voted-for-trump-most-still-back-him-but-not-on-everything/articleshow/122068386.cms",
    "timestamp": "2025-06-25T10:11:33Z"
  },
  {
    "title": "Japan's Nikkei ends at over 4-month high as chip-related shares track US peers higher",
    "description": "Japan's Nikkei share average reached a four-month high, boosted by chip-related stocks mirroring gains in the U.S. market. Advantest and Tokyo Electron significantly contributed to the Nikkei's rise, while SoftBank Group experienced a decline. Olympus shares …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-4-month-high-as-chip-related-shares-track-us-peers-higher/articleshow/122068356.cms",
    "timestamp": "2025-06-25T10:10:32Z"
  },
  {
    "title": "Freed Belarus dissident speaks out against Lukashenko",
    "description": "Siarhei Tsikhanouski, recently released after US mediation, shared his harrowing prison experiences and political convictions at a press conference in Vilnius. Sentenced to 18 years in 2021, he endured harsh conditions, including isolation and deprivation. Ts…",
    "link": "https://timesofindia.indiatimes.com/world/europe/freed-belarus-dissident-speaks-out-against-lukashenko/articleshow/122068139.cms",
    "timestamp": "2025-06-25T10:09:18Z"
  },
  {
    "title": "Fox News Host Asks Most Bootlicking Question About Donald Trump Yet",
    "description": "Will Cain suggested how the president should be immortalized.",
    "link": "https://www.huffpost.com/entry/will-cain-question-donald-trump_n_685bbb85e4b0a6ad6d5b3804",
    "timestamp": "2025-06-25T10:07:16Z"
  },
  {
    "title": "Ukrainian President Zelenskyy sidelined as NATO leaders meet to agree defense spending boost",
    "description": "Ukrainian President Volodymyr Zelenskyy is looking on from the sidelines as NATO leaders meet to agree a significant boost in defense spending that is spurred by Russian aggression",
    "link": "https://abcnews.go.com/International/wireStory/ukrainian-president-zelenskyy-sidelined-nato-leaders-meet-agree-123185057",
    "timestamp": "2025-06-25T10:06:29Z"
  },
  {
    "title": "The Federalist Society isn’t going anywhere",
    "description": "President Donald Trump said the Federalist Society gave him “bad advice” on judicial nominations. He’s still appointing their members to the federal bench anyway. \nOn Wednesday, the Senate Judiciary Committee will consider nominees for seats on the federal be…",
    "link": "https://biztoc.com/x/638d4c495d6187b6",
    "timestamp": "2025-06-25T10:05:32Z"
  },
  {
    "title": "Trump says 'great progress' made on Gaza ceasefire talks",
    "description": "US President Donald Trump said attacking Iran caused \"great progress\" in negotiations regarding Gaza, and insisted Tehran \"won't be building nuclear weapons for a long time.\" DW has more.",
    "link": "https://www.dw.com/en/trump-says-great-progress-made-on-gaza-ceasefire-talks/live-73028690",
    "timestamp": "2025-06-25T10:04:00Z"
  },
  {
    "title": "Fed kicks off effort to ease bank leverage rules",
    "description": "WASHINGTON (Reuters) -The Federal Reserve meets on Wednesday to advance a proposal that would ease leverage rules for banks, which would grant the industry a...",
    "link": "https://finance.yahoo.com/news/fed-kicks-off-effort-ease-100359744.html",
    "timestamp": "2025-06-25T10:03:59Z"
  },
  {
    "title": "Trump thanks Jeb Bush for strong praise of Iran strike: 'Very much appreciated!'",
    "description": "Trump thanked former Florida Gov. Jeb Bush after Bush and others with United Against Nuclear Iran praised the president's move to order the strikes against Iran",
    "link": "https://www.foxnews.com/politics/trump-thanks-jeb-bush-strong-praise-iran-strike-very-much-appreciated",
    "timestamp": "2025-06-25T10:03:37Z"
  },
  {
    "title": "US ‘totally committed’ to Article 5, NATO chief insists on day 2 of summit",
    "description": "Secretary-General Mark Rutte sought to downplay fears of wavering US commitment, predicting a 'transformational summit'.",
    "link": "https://www.aljazeera.com/news/2025/6/25/us-totally-committed-to-article-5-nato-chief-insists-on-day-2-of-summit",
    "timestamp": "2025-06-25T10:02:27Z"
  },
  {
    "title": "Crypto stocks rally on ceasefire optimism – But will it last?",
    "description": "4,000 BTC and 61,000 ETH exit Binance as geopolitical and inflation fears ease.",
    "link": "https://ambcrypto.com/crypto-stocks-rally-on-ceasefire-optimism-but-will-it-last/",
    "timestamp": "2025-06-25T10:00:48Z"
  },
  {
    "title": "Former Trump Ambassador Scott Brown launches bid to flip key battleground Senate seat from blue to red",
    "description": "Scott Brown enters the 2026 New Hampshire Senate race as the first major Republican candidate, focusing on inflation, border security and supporting Trump",
    "link": "https://www.foxnews.com/politics/former-trump-ambassador-scott-brown-launches-bid-flip-key-swing-state-senate-seat-from-blue-red",
    "timestamp": "2025-06-25T10:00:43Z"
  },
  {
    "title": "‘Looking Backwards’ and Forward: How Democrats Who Voted for Iraq Cashed In and How It Ensured the Rise of the Imperial Uniparty",
    "description": "Obama’s decision to “look forward” continues to reverberate into our endless wars of the present—and future.",
    "link": "https://www.nakedcapitalism.com/?p=294537",
    "timestamp": "2025-06-25T10:00:41Z"
  },
  {
    "title": "Trump's border strategy empowers patrol agents to finally do their job, says veteran chief",
    "description": "Border Patrol Tucson Sector Chief McGoffin reported a 91% drop in apprehensions under Trump administration, citing stronger enforcement on the Arizona border.",
    "link": "https://www.foxnews.com/media/trumps-border-strategy-empowers-patrol-agents-finally-do-job-says-veteran-chief",
    "timestamp": "2025-06-25T10:00:41Z"
  },
  {
    "title": "Hoist with Their Own Petard",
    "description": "\"Hoist with his own petard\" is a metaphor from Shakespeare meaning to get blown up by one's own bomb. Conservatives are using this as a political tactic: To use policies developed by the left against the left. But petards can blow up both ways.",
    "link": "https://www.patheos.com/blogs/geneveith/2025/06/hoist-with-their-own-petard/",
    "timestamp": "2025-06-25T10:00:34Z"
  }
]