[
  {
    "title": "US-EU trade deal with 15% tariff is on the table but needs sign-off from Trump, diplomat says",
    "description": "US President Donald Trump and EU chief Ursula von der Leyen were set for make-or-break talks in Scotland Sunday, aimed at ending a months-long transatlantic trade standoff, as negotiations went down to the wire.\nTrump has said he sees a one-in-two chance of a…",
    "link": "https://biztoc.com/x/eeb4533ac0a882c6",
    "timestamp": "2025-07-27T15:36:04Z"
  },
  {
    "title": "Trump's inner circle accused of 'pure malpractice' for mismanaging Epstein blowback",
    "description": "According to a former Donald Trump communications official, there is no way that the president and his White House should be at the center of the Jeffrey Epstein files scandal which should be handled instead by the Department of Justice.During an appearance o…",
    "link": "https://www.rawstory.com/trump-epstein-white-house/",
    "timestamp": "2025-07-27T15:31:36Z"
  },
  {
    "title": "White House orders Hegseth to stop polygraphs on Pentagon staff suspected of leaking: report",
    "description": "A current adviser to Secretary of Defense Pete Hegseth alerted senior officials in the Trump administration of the use of polygraphs to find leakers at the Pentagon.",
    "link": "https://www.foxnews.com/politics/white-house-orders-hegseth-stop-polygraph-tests-pentagon-staff",
    "timestamp": "2025-07-27T15:25:26Z"
  },
  {
    "title": "Lutnick: Trump wants 'good enough' EU trade offer — but what that means is unclear",
    "description": "Commerce Secretary Howard Lutnick said Sunday that the European Union should agree to open its markets for U.S. exports to convince President Donald Trump to lower \"reciprocal\" tariffs on the 27-member bloc.\nLutnick's comments suggest that Trump is open to a …",
    "link": "https://biztoc.com/x/5f6773b59db31485",
    "timestamp": "2025-07-27T15:25:09Z"
  },
  {
    "title": "Jay Leno hits out at ‘political’ late night talk shows amid Stephen Colbert cancellation",
    "description": "The former host of ‘The Tonight Show’ said that you lose ‘half an audience’ by making political jokes",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jay-leno-politics-stephen-colbert-b2796878.html",
    "timestamp": "2025-07-27T15:21:51Z"
  },
  {
    "title": "’20 Years Was a Pittance!’ Mike Johnson Takes Fiery Stand Against a Ghislane Maxwell Pardon — As Trump Keeps Door Open",
    "description": "House Speaker Mike Johnson (R-LA) took a fiery stand against a pardon for Ghislaine Maxwell — something on which President Donald Trump has not closed the door.\nThe post ’20 Years Was a Pittance!’ Mike Johnson Takes Fiery Stand Against a Ghislane Maxwell Pard…",
    "link": "https://www.mediaite.com/media/news/20-years-was-a-pittance-mike-johnson-takes-fiery-stand-against-a-ghislane-maxwell-pardon-as-trump-keeps-door-open/",
    "timestamp": "2025-07-27T15:20:44Z"
  },
  {
    "title": "US-EU trade deal with 15% tariff is on the table but needs sign-off from Trump, diplomat says",
    "description": "Under the proposal described to AFP, the EU would commit to ramp up purchases of US liquefied natural gas, along with other investment pledges.",
    "link": "https://fortune.com/2025/07/27/us-eu-trade-deal-15-perent-tariff-trump-talks-lng-carveouts/",
    "timestamp": "2025-07-27T15:20:20Z"
  },
  {
    "title": "Imperialists Using NATO and G7 to Maintain Global Domination",
    "description": "“Let’s work for peace and justice! Canada out of NATO! Canada out of the G7!”\n– Tamara Lorincz, this week’s show\n \n***\nLISTEN TO THE SHOW\n\r\n\n\r\n\n Click to download the audio (MP3 format) \nLast month, in a report …\nThe post Imperialists Using NATO and G7 to Mai…",
    "link": "https://www.globalresearch.ca/imperialists-using-nato-and-g7-to-maintain-global-domination/5896126",
    "timestamp": "2025-07-27T15:16:14Z"
  },
  {
    "title": "'Not My Lane': Watch Mike Johnson Squirm Out Of Question On Ghislaine Maxwell Pardon",
    "description": "House Speaker Mike Johnson (R-LA) said it was \"not my lane\" when he was asked if he supported President Donald Trump granting a pardon for Jeffrey Epstein's accomplice, Ghislaine Maxwell.\n\n\nDuring a Sunday interview on Meet the Press, host Kristen Welker aske…",
    "link": "https://crooksandliars.com/2025/07/not-my-lane-watch-mike-johnson-squirm-out",
    "timestamp": "2025-07-27T15:15:41Z"
  },
  {
    "title": "House Dems Request Epstein ‘Birthday Book’ From Estate",
    "description": "This could be very bad news for Donald Trump, his $10 billion libel lawsuit against The Wall Street Journal and his Epstein scandal cover up.\nDemocratic Reps. Robert Garcia, the ranking Democrat on the Oversight and Accountability Committee, and Ro Khanna hav…",
    "link": "https://crooksandliars.com/2025/07/house-dems-request-epstein-birthday-book",
    "timestamp": "2025-07-27T15:14:17Z"
  },
  {
    "title": "Trump: Macron's Two-State Talk \"Doesn't Matter\" & \"Carries No Weight\"",
    "description": "Trump: Macron's Two-State Talk \"Doesn't Matter\" & \"Carries No Weight\"\n \nFrance this week became the largest European nation, and the first G7 country, to recognize a Palestinian state, a move strongly condemned by Israel - and which has also angered Washingto…",
    "link": "https://biztoc.com/x/6b1dbe6745c2135a",
    "timestamp": "2025-07-27T15:14:01Z"
  },
  {
    "title": "Democratic financial officials warn Medicaid cuts will disrupt entire health systems - NewsBreak",
    "description": "Colorado State Treasurer Dave Young’s sister Dorothy has relied heavily on Medicaid “for health care and for life-sustaining support” as she lives with sev",
    "link": "https://www.newsbreak.com/share/4132117718484-democratic-financial-officials-warn-medicaid-cuts-will-disrupt-entire-health-systems?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NTM2MjkxOTkwOTE%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1753629199&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v3%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v2",
    "timestamp": "2025-07-27T15:13:48Z"
  },
  {
    "title": "Watch: Fed Chair Jerome Powell Fumes as Trump Hands Him a Document During Building Tour",
    "description": "President Donald Trump warned Federal Reserve Chairman Jerome Powell that he'd be visiting the Fed's headquarters.",
    "link": "https://www.westernjournal.com/watch-fed-chair-jerome-powell-fumes-trump-hands-document-building-tour/",
    "timestamp": "2025-07-27T15:10:06Z"
  },
  {
    "title": "Rep. Massie Calls For Ghislaine Maxwell To Testify ‘If She Has Information That Could Help Us’",
    "description": "Rep. Thomas Massie said on NBC News Sunday that Ghislaine Maxwell should testify if she possesses information beneficial to investigations related to Epstein.",
    "link": "https://dailycaller.com/2025/07/27/thomas-massie-ghislaine-maxwell-testify-nbc/",
    "timestamp": "2025-07-27T15:09:23Z"
  },
  {
    "title": "Lutnick: Trump wants 'good enough' EU trade offer — but what that means is unclear",
    "description": "President Donald Trump is set to hold trade talks with President of the European Commission Ursula von der Leyen, days before the Aug. 1 tariff deadline.",
    "link": "https://www.cnbc.com/2025/07/27/lutnick-trump-european-union-trade-aug-1-.html",
    "timestamp": "2025-07-27T15:08:51Z"
  },
  {
    "title": "Donald Trump's Favorability Rating Falls With AAPI Adults",
    "description": "The president's ratings with the Asian American and Pacific Islander demographic have fallen considerably since he took office.",
    "link": "https://www.newsweek.com/donald-trumps-favorability-rating-falls-aapi-adults-2104667",
    "timestamp": "2025-07-27T15:08:27Z"
  },
  {
    "title": "'At least pick up the tab!' Trump Scotland trip slammed as tax-funded golf marketing ploy - NewsBreak",
    "description": "While President Donald Trump’s five-day trip to Scotland that began Friday was described by the White House as a “working visit,” he’s expected to stop by",
    "link": "https://www.newsbreak.com/share/4134424235595-at-least-pick-up-the-tab-trump-scotland-trip-slammed-as-tax-funded-golf-marketing-ploy?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NTM2Mjg0NjI0MDY%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1753628462&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v3%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v8",
    "timestamp": "2025-07-27T15:01:32Z"
  },
  {
    "title": "Trump pens letter to grieving mother of slain congressional intern: 'Held in my heart'",
    "description": "President Trump sent a letter to the parents of Eric Tarpinian-Jachym, a congressional intern who was killed in a shooting in Washington, D.C.",
    "link": "https://www.foxnews.com/us/trump-pens-letter-grieving-mother-slain-congressional-intern-held-heart",
    "timestamp": "2025-07-27T15:00:57Z"
  },
  {
    "title": "How Trump Is Stalling Solar and Wind Projects",
    "description": "United States President Donald Trump announced plans in July to tighten federal permitting to restrict solar and wind energy development. This follows the passing on Trump’s One Big Beautiful Bill Act, which seeks to expand the fossil fuel and nuclear power s…",
    "link": "https://oilprice.com/Energy/Energy-General/How-Trump-Is-Stalling-Solar-and-Wind-Projects.html",
    "timestamp": "2025-07-27T15:00:00Z"
  },
  {
    "title": "August 1 Tariff Deadline Won't Be Extended, Says US Commerce Secretary",
    "description": "The tariff deadline set for Aug. 1 by US President Donald Trump would not be extended, said Howard Lutnick, a key member of his administration, while speaking to a news channel on Sunday. There will be no more grace periods after the Aug. 1 tariff deadline, s…",
    "link": "https://www.ndtvprofit.com/world/august-1-tariff-deadline-wont-be-extended-says-us-commerce-secretary",
    "timestamp": "2025-07-27T14:57:16Z"
  },
  {
    "title": "Federal judge in RI halts restrictions on funding to groups that serve society's vulnerable",
    "description": "A nationwide coalition of dozens of organizations, including six from Rhode Island, sued the government on July 21 in U.S. District Court.",
    "link": "https://www.providencejournal.com/story/news/politics/courts/2025/07/27/federal-judge-in-ri-halts-restrictions-on-us-funding-to-aid-groups/85394206007/",
    "timestamp": "2025-07-27T14:55:03Z"
  },
  {
    "title": "Trump to Meet EU Leader as Trade Deadline Looms",
    "description": "LIVE UPDATES\nTrump to Meet EU Leader as Trade Deadline Looms\nThe president was traveling in Scotland with his Aug. 1 trade deal deadline just days away.\nLast Updated:\nJuly 27, 2025 at 10:47 AM ET\nLatest Updates\nPresident Donald Trump was set to meet European …",
    "link": "https://biztoc.com/x/19c9effafb021990",
    "timestamp": "2025-07-27T14:52:10Z"
  },
  {
    "title": "Threat of US-EU trade war looms as Trump and top European official plan talks in Scotland",
    "description": "EDINBURGH, Scotland — President Donald Trump is meeting Sunday with European Commission chief Ursula von der Leyen, taking a break from golfing in Scotland to discuss trade as both sides seek an agreement on tariff rates with the White House’s deadline to imp…",
    "link": "https://biztoc.com/x/96a6ff8416897e70",
    "timestamp": "2025-07-27T14:52:02Z"
  },
  {
    "title": "Defense Department bars officials from left-leaning think tank events",
    "description": "The Pentagon on Thursday publicly announced it will no longer allow Defense Department officials to appear at events that do not align with the current presidential administration, and will instead thoroughly screen future programs. The move comes a week afte…",
    "link": "https://freerepublic.com/focus/f-news/4331054/posts",
    "timestamp": "2025-07-27T14:46:46Z"
  },
  {
    "title": "Rubio rips Venezuela's Maduro as 'narco-terrorist' leader threatening US one year after disputed election",
    "description": "Secretary of State Marco Rubio shreds Venezuelan dictator Nicolás Maduro, calling him leader of narco-terrorist group Cartel de los Soles.",
    "link": "https://www.foxnews.com/politics/rubio-rips-venezuelas-maduro-narco-terrorist-leader-threatening-us-one-year-after-disputed-election",
    "timestamp": "2025-07-27T14:45:55Z"
  },
  {
    "title": "Destiny’s Child Reunite at Beyoncé’s Final “Cowboy Carter” Concert",
    "description": "JAY-Z and Shaboozey also joined Queen Bey on stage during her finale concert in Las Vegas.\nDestiny’s Child Reunite at Beyoncé’s Final “Cowboy Carter” Concert\nScoop Harrison",
    "link": "https://consequence.net/2025/07/destinys-child-reunite-beyonce-final-cowboy-carter-concert/",
    "timestamp": "2025-07-27T14:41:00Z"
  },
  {
    "title": "DOGE has built an AI tool to slash federal regulations | TechCrunch",
    "description": "The Department of Government Efficiency has presented plans to use a new AI tool to eliminate half of the federal government’s regulatory mandates by the first anniversary of President Donald Trump’s return to office, according to The Washington Post.",
    "link": "https://techcrunch.com/2025/07/27/doge-has-built-an-ai-tool-to-slash-federal-regulations/",
    "timestamp": "2025-07-27T14:40:27Z"
  },
  {
    "title": "Cambodian, Thai Prime Ministers to Come to Malaysia for Border Talks on Monday",
    "description": "MOSCOW (Sputnik) - Cambodian Prime Minister Hun Manet and Thailand’s acting Prime Minister Phumtham Wechayachai will come to the Malaysian capital of Kuala Lumpur on Monday to discuss the border conflict, Malaysian Foreign Minister Mohamad Hasan told state ne…",
    "link": "https://sputnikglobe.com/20250727/cambodian-thai-prime-ministers-to-come-to-malaysia-for-border-talks-on-monday-1122498362.html",
    "timestamp": "2025-07-27T14:35:24Z"
  },
  {
    "title": "Trump Admin Locates 13,000 Unaccompanied Minors, Arrests Hundreds Of Sponsors: Report",
    "description": "The Trump administration has reportedly located over 13,000 children who entered the United States unaccompanied and illegally before being lost to government tracking systems. Immigration and Customs Enforcement under President Donald Trump has arrested more…",
    "link": "https://freerepublic.com/focus/f-news/4331052/posts",
    "timestamp": "2025-07-27T14:32:31Z"
  },
  {
    "title": "With South Park's Episode About President Trump Going Viral, Stephen Colbert Weighed In And Did Not Hold Back",
    "description": "The host didn't mince words.",
    "link": "https://www.cinemablend.com/television/south-parks-episode-president-donald-trump-viral-stephen-colbert-did-not-hold-back",
    "timestamp": "2025-07-27T14:32:03Z"
  },
  {
    "title": "Scozia: partita a golf per il tycoon e suono figlio Eric",
    "description": "epa12265576 US President Donald J. Trump (C) and his son Eric Trump (R) play at Trump Turnberry golf course during a private visit in Turnberry, Scotland, Britain, 27 July 2025. (ANSA)",
    "link": "https://www.ansa.it/sito/photogallery/curiosita/2025/07/27/scozia-partita-a-golf-per-il-tycoon-e-suono-figlio-eric_8d75a87b-53b0-4d5e-a678-0a653a3f1dc6.html",
    "timestamp": "2025-07-27T14:29:54Z"
  },
  {
    "title": "Lara Trump sits out on swing state Senate bid to replace Thom Tillis",
    "description": "As the 2026 primaries begin to take shape, one swing state in particular has remained on the GOP's radar. After Republican Sen. Thom Tillis of North Carolina announced his retirement in June, all eyes turned to Tar Heel State native Lara Trump. Although the R…",
    "link": "https://freerepublic.com/focus/f-news/4331051/posts",
    "timestamp": "2025-07-27T14:24:39Z"
  },
  {
    "title": "Lara Trump sits out on swing state Senate bid to replace Thom Tillis",
    "description": "As the 2026 primaries begin to take shape, one swing state in particular has remained on the GOP's radar. After Republican Sen. Thom Tillis of North Carolina announced his retirement in June, all eyes turned to Tar Heel State native Lara Trump. Although the R…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331051/posts",
    "timestamp": "2025-07-27T14:24:39Z"
  },
  {
    "title": "GOPer Blames Obama For An Epstein Deal Done While Bush Was In Office",
    "description": "CNN's Jake Tapper corrected Oklahoma GOP Sen. Markwayne Mullin twice when he somehow tried to blame former President Barack Obama for the \"sweetheart plea\" that Alex Acosta gifted disgraced financier Jeffrey Epstein with when he was a top federal prosecutor i…",
    "link": "https://crooksandliars.com/2025/07/goper-blames-obama-epstein-deal-done-while",
    "timestamp": "2025-07-27T14:24:01Z"
  },
  {
    "title": "Bongino 'SHOCKED' down to the core about FBI findings (short video - 2:11: Bongino shocked about fabricated ICA-Obama, Comey, Brennan, Clapper)",
    "description": "Summary: The video covers growing scrutiny over the 2016 U.S. intelligence assessment that claimed Russian interference aimed to help Donald Trump. Key points: Senator Tom Cotton, Chairman of the Intelligence Committee, has sent a letter to the FBI questionin…",
    "link": "https://freerepublic.com/focus/f-news/4331050/posts",
    "timestamp": "2025-07-27T14:23:58Z"
  },
  {
    "title": "Cambodia, Thailand trade fire and accusations hours after Trump intervenes for ceasefire",
    "description": "Cambodia and Thailand have exchanged accusations of artillery attacks, jeopardizing a potential ceasefire brokered by US President Donald Trump. The renewed fighting follows days of intense clashes that have resulted in over 30 deaths and the displacement of …",
    "link": "https://economictimes.indiatimes.com/news/defence/cambodia-thailand-trade-fire-and-accusations-hours-after-trump-intervenes-for-ceasefire/articleshow/122936760.cms",
    "timestamp": "2025-07-27T14:19:51Z"
  },
  {
    "title": "Jay Leno Criticizes Political Late-Night Hosts",
    "description": "The former 'Tonight Show' host took aim at partisan late-night shows in a recent interview: \"Why shoot for just half an audience?\"",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/jay-leno-criticizes-political-late-night-hosts-1236330418/",
    "timestamp": "2025-07-27T14:19:32Z"
  },
  {
    "title": "DC police commander under investigation for allegedly manipulating crime stats",
    "description": "The Metropolitan Police Department is embroiled in controversy over allegations related to its reported crime statistics. The Washington, D.C., department placed Police Commander Michael Pulliam on paid administrative leave in May after a police union accused…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331049/posts",
    "timestamp": "2025-07-27T14:19:03Z"
  },
  {
    "title": "DC police commander under investigation for allegedly manipulating crime stats",
    "description": "The Metropolitan Police Department is embroiled in controversy over allegations related to its reported crime statistics. The Washington, D.C., department placed Police Commander Michael Pulliam on paid administrative leave in May after a police union accused…",
    "link": "https://freerepublic.com/focus/f-news/4331049/posts",
    "timestamp": "2025-07-27T14:19:03Z"
  },
  {
    "title": "US stock market outlook: S&P 500, Nasdaq to plunge into volatility from all-time highs? Check Wall Street signs before August 1 tariff deadline",
    "description": "Apple, Microsoft, Amazon and Facebook parent Meta Platforms, four of the \"Magnificent Seven,\" whose stocks heavily influence Wall Street's benchmark indexes because of the companies' massive market values, will announce earnings results.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-outlook-sp-500-nasdaq-to-plunge-into-volatility-from-all-time-highs-check-wall-street-signs-before-august-1-tariff-deadline/articleshow/122936695.cms",
    "timestamp": "2025-07-27T14:18:57Z"
  },
  {
    "title": "How Musk's Empire Is Struggling in Wake of Trump Feud",
    "description": "Elon Musk’s companies—specifically Tesla, SpaceX and xAI—are struggling in the wake of his feud with President Donald Trump. Here's where each of these companies stand now. \n----------\nLike this video? Subscribe https://www.youtube.com/@Bloomberg-News\nBloombe…",
    "link": "https://biztoc.com/x/f4f495168f9c59c8",
    "timestamp": "2025-07-27T14:18:46Z"
  },
  {
    "title": "'Not my lane': Watch Mike Johnson squirm out of question on Ghislaine Maxwell pardon",
    "description": "House Speaker Mike Johnson (R-LA) said it was \"not my lane\" when he was asked if he supported President Donald Trump granting a pardon for Jeffrey Epstein's accomplice, Ghislaine Maxwell.During a Sunday interview on Meet the Press, host Kristen Welker asked J…",
    "link": "https://www.rawstory.com/mike-johnson-ghislaine-maxwell-pardon/",
    "timestamp": "2025-07-27T14:16:43Z"
  },
  {
    "title": "Bipartisan duo pushing for Epstein files release disagrees on Ghislaine Maxwell pardon",
    "description": "Reps. Thomas Massie and Ro Khanna, who are working together to push the Trump administration to release federal files related to Epstein, disagreed over whether Trump should pardon Epstein’s longtime associate Ghislaine Maxwell.",
    "link": "https://www.nbcnews.com/politics/congress/bipartisan-duo-pushing-epstein-files-release-disagrees-ghislaine-maxwe-rcna221255",
    "timestamp": "2025-07-27T14:16:28Z"
  },
  {
    "title": "Trump Blamed for ‘Superman’ Global Slump: Reeve’s 1978 Classic Debunks the Haters",
    "description": "If you’re in business and you’re not doing as well as you’d like in foreign markets in 2025, it doesn’t hurt to blame President Donald Trump.\nThe post Trump Blamed for ‘Superman’ Global Slump: Reeve’s 1978 Classic Debunks the Haters appeared first on The Gate…",
    "link": "https://www.thegatewaypundit.com/2025/07/trump-blamed-superman-global-slump-reeves-1978-classic/",
    "timestamp": "2025-07-27T14:15:28Z"
  },
  {
    "title": "GOP Rep. Massie wants more from Epstein estate than his reported ‘birthday book’",
    "description": "Republican Rep. Thomas Massie said he stands with Democratic Rep. Ro Khanna's calls to subpoena Jeffrey Epstein's estate for documents related to his case.",
    "link": "https://abcnews.go.com/Politics/gop-rep-massie-epstein-estate-reported-birthday-book/story?id=124112485",
    "timestamp": "2025-07-27T14:12:10Z"
  },
  {
    "title": "Ottawa is quietly working on launching a new entity it hopes will be key to housing affordability",
    "description": "Carney’s goal for the government to act as an affordable housing developer was quickly overshadowed by trade turmoil, leaving little information on how he plans to get more homes built",
    "link": "https://www.theglobeandmail.com/business/economy/article-ottawa-build-canada-homes-initiative-housing-affordability/",
    "timestamp": "2025-07-27T14:10:36Z"
  },
  {
    "title": "US, China to resume tariff talks in effort to extend truce",
    "description": "Senior U.S. and Chinese negotiators are convening in Stockholm to address persistent economic disputes at the heart of their trade war, aiming to extend a truce and prevent escalating tariffs. The talks occur amidst a deadline to reach a durable agreement, wi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-to-resume-tariff-talks-in-effort-to-extend-truce/articleshow/122936629.cms",
    "timestamp": "2025-07-27T14:08:34Z"
  },
  {
    "title": "Trump weighs prosecution of Harris, Beyoncé over endorsements",
    "description": "Trump accused the former vice president of paying for endorsements from Oprah Winfrey and others.",
    "link": "https://www.salon.com/2025/07/27/trump-weighs-prosecution-of-harris-beyonce-over-endorsements/",
    "timestamp": "2025-07-27T14:07:16Z"
  },
  {
    "title": "GOP Senator Pushes False Epstein Claim Even After Jake Tapper Corrects Him in Wild CNN Interview",
    "description": "Sen. Markwayne Mullin (R-OK) repeatedly pushed a false claim about the Epstein prosecution — even after Jake Tapper corrected him in a wild CNN interview.\nThe post GOP Senator Pushes False Epstein Claim Even After Jake Tapper Corrects Him in Wild CNN Intervie…",
    "link": "https://www.mediaite.com/media/news/gop-senator-pushes-false-epstein-claim-even-after-jake-tapper-corrects-him-in-wild-cnn-interview/",
    "timestamp": "2025-07-27T14:05:02Z"
  },
  {
    "title": "Trump and Von der Leyen meeting today to clinch trade deal will hopefully be ‘a decisive moment’, says Michael McGrath",
    "description": "The meeting between Donald Trump and the president of the European Commission is a “significant and decisive moment”, with hopes for a tariff deal between the US and the EU, commissioner Michael McGrath has said.",
    "link": "https://www.independent.ie/irish-news/politics/trump-and-von-der-leyen-meeting-today-to-clinch-trade-deal-will-hopefully-be-a-decisive-moment-says-michael-mcgrath/a1942953498.html",
    "timestamp": "2025-07-27T14:02:57Z"
  },
  {
    "title": "Five things to watch for in the Canadian business world in the coming week",
    "description": "TORONTO — Five things to watch for in the Canadian business world in the coming week: Interest rates The Bank of Canada is set to announce its latest interest rate decision and monetary policy report on Wednesday. The central bank held its key rate at 2.75 pe…",
    "link": "https://financialpost.com/pmn/five-things-to-watch-for-in-the-canadian-business-world-in-the-coming-week-157",
    "timestamp": "2025-07-27T14:01:57Z"
  },
  {
    "title": "Democrats are hammering Republicans on Epstein, but one senator brushed off the issue years ago",
    "description": "Congressional Democrats push for transparency on Epstein documents as Sen. Elissa Slotkin criticized the Trump administration's handling of files she once dismissed as not \"front of mind.\"",
    "link": "https://www.foxnews.com/politics/democrats-hammering-republicans-epstein-one-senator-brushed-off-issue-years-ago",
    "timestamp": "2025-07-27T14:00:42Z"
  },
  {
    "title": "The legal pushback that could complicate Trump's AI plan",
    "description": "The Trump administration’s new 'Action Plan' to support US dominance in artificial intelligence is all but certain to be met with legal pushback, especially ...",
    "link": "https://finance.yahoo.com/news/the-legal-pushback-that-could-complicate-trumps-ai-plan-140035912.html",
    "timestamp": "2025-07-27T14:00:35Z"
  },
  {
    "title": "Dan Bongino Posts Cryptic Message, Says He’s Been ‘Shocked to His Core’",
    "description": "The newly discovered material \"was not processed through the normal procedure, digitizing it, putting it in FBI records. We found it in bags hiding under Jim Comey’s FBI, and you’re going to be stunned!\"\nThe post Dan Bongino Posts Cryptic Message, Says He’s B…",
    "link": "https://legalinsurrection.com/2025/07/dan-bongino-what-i-have-learned-has-shocked-me-down-to-my-core/",
    "timestamp": "2025-07-27T14:00:34Z"
  },
  {
    "title": "WaPo editorial admits entertainment is destroying society, calls Trump 'a one-person digital diversion'",
    "description": "A Washington Post column showed how entertainment is destroying society while some Gen Z \"refuseniks\" offer hope by walking away from technology, seeking silence and restoration.",
    "link": "https://www.foxnews.com/media/wapo-editorial-admits-entertainment-destroying-society-calls-trump-a-one-person-digital-diversion",
    "timestamp": "2025-07-27T14:00:10Z"
  },
  {
    "title": "This 'Dark Triad' shows MAGA is sick enough to believe Trump's Obama lies",
    "description": "When the walls start closing in, Donald Trump doesn’t lawyer up: he doubles down. With Jeffrey Epstein’s ghost rattling through the headlines and the threat of explosive disclosures looming, Team Trump has rolled out its most cynical, racially-charged distrac…",
    "link": "https://www.rawstory.com/raw-investigates/obama-trump-2673760170/",
    "timestamp": "2025-07-27T14:00:02Z"
  },
  {
    "title": "Supreme Court Lets Trump Enact His Authoritarian Agenda on Its ‘Shadow Docket’",
    "description": "The Supreme Court granted Trump’s emergency requests in 17 straight cases, reversing lower courts that temporarily blocked the admin’s overreach.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-supreme-court-shadow-docket-emergency-agenda-1235394694/",
    "timestamp": "2025-07-27T14:00:00Z"
  },
  {
    "title": "Ben Bernanke And Janet Yellen’s Inflation Mystification Ails The Fed",
    "description": "While they’re no longer at the central bank, their ideas about inflation remain.",
    "link": "https://www.forbes.com/sites/johntamny/2025/07/27/ben-bernanke-and-janet-yellens-inflation-mystification-ails-the-fed/",
    "timestamp": "2025-07-27T14:00:00Z"
  },
  {
    "title": "The Canning of Colbert Is a Victory for Comedy … and for Colbert",
    "description": "The seven days of mourning over the death of Stephen Colbert’s late-night show has ended. The rendered garments have been replaced. The flag no longer... Read More\nThe post The Canning of Colbert Is a Victory for Comedy … and for Colbert appeared first on The…",
    "link": "https://www.dailysignal.com/2025/07/27/the-canning-of-colbert-is-a-victory-for-comedy-and-for-colbert/",
    "timestamp": "2025-07-27T14:00:00Z"
  },
  {
    "title": "Trump Says Kamala Harris, Beyonce Should Be Prosecuted For ‘Totally Illegal’ Campaign Payouts",
    "description": "President Donald Trump said Saturday that former Vice President Kamala Harris should be prosecuted along with Beyonce and Oprah Winfrey for alleged endorsement payouts.",
    "link": "https://dailycaller.com/2025/07/27/donald-trump-kamala-harris-beyonce-prosecuted-campaign-payouts-oprah-winfrey/",
    "timestamp": "2025-07-27T13:54:42Z"
  },
  {
    "title": "UN tech chief calls for global AI rules",
    "description": "GENEVA: The world must urgently come together to develop a global framework for regulating artificial intelligence (AI), said Doreen Bogdan-Martin, Secretary-General of the United Nations’ International Telecommunication Union (ITU), warning that fragmented s…",
    "link": "https://english.khabarhub.com/2025/27/487919/",
    "timestamp": "2025-07-27T13:45:04Z"
  },
  {
    "title": "US commerce secretary says Europe must open markets to get lower tariff deal",
    "description": "The United States is pushing the European Union to open its markets. This is to avoid a 30% tariff threatened by President Donald Trump. U.S. Commerce Secretary Howard Lutnick says the EU seems willing to negotiate. Trump wants increased access for U.S. firms…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-commerce-secretary-says-europe-must-open-markets-to-get-lower-tariff-deal/articleshow/122936417.cms",
    "timestamp": "2025-07-27T13:43:12Z"
  },
  {
    "title": "Thailand and Cambodia agree to talk after Trump threat",
    "description": "The recent cross-border escalation has resulted in over 30 deaths Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622051-thailand-cambodia-agree-ceasefire-talks/",
    "timestamp": "2025-07-27T13:41:45Z"
  },
  {
    "title": "US commerce secretary says Trump really likes TikTok, but app has to move to US ownership",
    "description": "U.S. President Donald Trump appreciates TikTok's communication with young Americans, but Secretary of Commerce Howard Lutnick emphasizes the necessity for the app to transition to U.S. ownership. Lutnick highlights concerns about Chinese control over an app o…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-commerce-secretary-says-trump-really-likes-tiktok-but-app-has-to-move-to-us-ownership/articleshow/122936373.cms",
    "timestamp": "2025-07-27T13:39:17Z"
  },
  {
    "title": "US commerce secretary says Trump really likes TikTok, but app has to move to US ownership",
    "description": "U.S. Commerce Secretary Howard Lutnick stated that President Trump appreciates TikTok's communication with young Americans. However, the administration insists the Chinese-owned app, popular among 170 million Americans, must transition to U.S. ownership. Lutn…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-commerce-secretary-says-trump-really-likes-tiktok-but-app-has-to-move-to-us-ownership/articleshow/122936354.cms",
    "timestamp": "2025-07-27T13:37:39Z"
  },
  {
    "title": "US commerce secretary says Trump really likes TikTok, but app has to move to US ownership",
    "description": "WASHINGTON :U.S. President Donald Trump likes TikTok but the Chinese-owned short video app, used by some 170 million Americans, has to move to U.S. ownership, Secretary of Commerce Howard Lutnick said on Sunday.\"The President really likes TikTok, and he said …",
    "link": "https://www.channelnewsasia.com/business/us-commerce-secretary-says-trump-really-likes-tiktok-app-has-move-us-ownership-5261216",
    "timestamp": "2025-07-27T13:37:23Z"
  },
  {
    "title": "The key to understanding Trump? It’s not what you think",
    "description": "Everything the US president does is for money – and in serving his avarice, he’s managed to triumph over the market\nDonald Trump embodies dealmaking as the essence of a particular form of entrepreneurship. Every deal begins with his needs and every deal feeds…",
    "link": "https://biztoc.com/x/f7bc3859e692d1fa",
    "timestamp": "2025-07-27T13:34:02Z"
  },
  {
    "title": "'At least pick up the tab!' Trump Scotland trip slammed as tax-funded golf marketing ploy - NewsBreak",
    "description": "While President Donald Trump’s five-day trip to Scotland that began Friday was described by the White House as a “working visit,” he’s expected to stop by",
    "link": "https://www.newsbreak.com/share/4134424235595-at-least-pick-up-the-tab-trump-scotland-trip-slammed-as-tax-funded-golf-marketing-ploy?s=a2&amp;share_destination_id=MzA3ODg1MTc3LTE3NTM2MjMxMDc3MjI%3D&amp;pd=0KpqzxIY&amp;hl=en_US&amp;send_time=1753623107&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v3%2Cns_foryou_rank_exp_25q2-v7",
    "timestamp": "2025-07-27T13:32:14Z"
  },
  {
    "title": "Who is Anjani Sinha, the Indian-origin surgeon nominated by Donald Trump as Singapore’s ambassador?",
    "description": "Dr. Anjani Sinha, President Trump's nominee for U.S. Ambassador to Singapore, faced tough questioning during his Senate confirmation hearing. Senator Tammy Duckworth criticized Sinha's lack of knowledge regarding Singapore's trade, ASEAN role, and U.S. strate…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-anjani-sinha-the-indian-origin-surgeon-nominated-by-donald-trump-as-singapores-ambassador/articleshow/122936251.cms",
    "timestamp": "2025-07-27T13:30:04Z"
  },
  {
    "title": "Trump’s Senior Moments Are Getting Worse",
    "description": "Does America have another president in decline — or is Trump just being Trump?",
    "link": "https://www.rollingstone.com/politics/politics-features/trump-biden-senior-moments-health-age-1235394162/",
    "timestamp": "2025-07-27T13:30:00Z"
  },
  {
    "title": "Trump’s Senior Moments Are Getting Worse",
    "description": "Donald Trump keeps forgetting things and telling odd and impossible tales, much like his predecessor Joe Biden.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-biden-senior-moments-health-age-1235394162/",
    "timestamp": "2025-07-27T13:30:00Z"
  },
  {
    "title": "Every big SDCC 2025 reveal in one place",
    "description": "The 2025 edition of San Diego Comic-Con was relatively muted: Marvel skipped Hall H in favor of releasing The Fantastic Four: First Steps in all its standalone-thrills-but-pivotal-end-credits-scene glory while James Gunn only popped by to promote Peacemaker s…",
    "link": "https://www.polygon.com/sdcc/616709/all-news-trailers-san-diego-comic-con-2025",
    "timestamp": "2025-07-27T13:29:28Z"
  },
  {
    "title": "Donald Trump once decried the idea of presidential vacations. His Scotland trip is built around golf",
    "description": "Donald Trump's trip to Scotland, framed as a working visit, is raising eyebrows due to its focus on promoting his family's golf courses. Unlike his predecessors, Trump's itinerary appears to leverage his presidency to benefit his business interests. This move…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-once-decried-the-idea-of-presidential-vacations-his-scotland-trip-is-built-around-golf/articleshow/122936231.cms",
    "timestamp": "2025-07-27T13:21:04Z"
  },
  {
    "title": "FBI deputy head says he’ll ‘never be the same’ after what he’s learned",
    "description": "The FBI deputy director has hinted at disturbing internal revelations amid tension over the Epstein files Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622050-fbi-deputy-changed-forever/",
    "timestamp": "2025-07-27T13:15:57Z"
  },
  {
    "title": "If Elon Musk Is So Concerned About Falling Birthrates, Why Is He Creating Perfect and Beautiful AI-Powered Girlfriends and Boyfriends That Seem Designed to Drive Down Romance Between Real Humans?",
    "description": "Billionaire Elon Musk has rolled out AI companions, which seemingly contradicts his opinion on how people should increase the birth rate.",
    "link": "https://futurism.com/elon-musk-birthrates-ai",
    "timestamp": "2025-07-27T13:15:44Z"
  },
  {
    "title": "Minneapolis Mayoral Race Heats Up with Unlikely Candidate",
    "description": "Something big is happening up in Minneapolis, folks. There’s this fellow, Omar Fateh, who’s looking to become the next mayor. Now, he’s not your regular candidate. He’s a Somali American who calls himself a democratic socialist, and he’s got some unusual plan…",
    "link": "https://freerepublic.com/focus/f-news/4331035/posts",
    "timestamp": "2025-07-27T13:13:14Z"
  },
  {
    "title": "Trump Tells Europe to Curb Migration and 'Stop the Windmills'",
    "description": "President Donald Trump arrived in Scotland Friday evening for part of a five-day trip to the country. Trump will be spending the weekend at one of his golf properties near Turnberry. Early next week, he will be visiting another near Abderdeen, where his famil…",
    "link": "https://biztoc.com/x/c08927623cbdf2dd",
    "timestamp": "2025-07-27T13:11:56Z"
  },
  {
    "title": "They’re Starving Civilians to Steal a Palestinian Territory, and They’re Lying About It",
    "description": "…\nThe post They’re Starving Civilians to Steal a Palestinian Territory, and They’re Lying About It appeared first on Global Research.",
    "link": "https://www.caitlinjohnst.one/p/theyre-starving-civilians-to-steal",
    "timestamp": "2025-07-27T13:11:30Z"
  },
  {
    "title": "Democrat in Congress admits party’s Epstein files attack line is ‘bulls***’",
    "description": "Meanwhile, Mike Johnson says: 'The Biden administration held the Epstein files for four years and not a single one of these Democrats – or anyone in Congress – thought about that at all'",
    "link": "https://www.wnd.com/2025/07/democrat-congress-admits-partys-epstein-files-attack-line/",
    "timestamp": "2025-07-27T13:11:07Z"
  },
  {
    "title": "Georgia shows rough road ahead for states as Medicaid work requirements loom",
    "description": "Georgia Pathways costs more than $100 million, with only $26 million spent on health benefits.",
    "link": "https://www.bostonherald.com/2025/07/27/georgia-medicaid-work-requirements-example/",
    "timestamp": "2025-07-27T13:10:20Z"
  },
  {
    "title": "There’s more to the anti-Trump Russiagate plot — and Tulsi Gabbard will unravel it",
    "description": "Barack Obama and his cronies will likely never face legal consequences — but they shouldn't be exempt from Tulsi Gabbard's exposure of the ugly truth.",
    "link": "https://nypost.com/2025/07/27/opinion/anti-trump-russiagate-plot-is-unraveling-with-more-to-come/",
    "timestamp": "2025-07-27T13:03:42Z"
  },
  {
    "title": "Questions raised over cost to rehab Trump's Qatar jet and 'mysterious' $934M fund transfer",
    "description": "The cost to rehab the controversial luxury jet generously gifted to Donald Trump by the government of Qatar remains a mystery with the figures not being made available at the same time that there are questions about a \"mysterious\" Pentagon fund transfer.Accor…",
    "link": "https://www.rawstory.com/qatar-trump/",
    "timestamp": "2025-07-27T13:03:39Z"
  },
  {
    "title": "Donald Trump and Ursula von der Leyen to meet in Scotland in effort to clinch EU-US trade deal",
    "description": "European Commission President Ursula von der Leyen is set to meet U.S. President Donald Trump on Sunday to clinch a trade deal for Europe that would likely see a 15% baseline tariff on most EU goods, but end months of uncertainty for EU companies.",
    "link": "https://www.independent.ie/world-news/donald-trump-and-ursula-von-der-leyen-to-meet-in-scotland-in-effort-to-clinch-eu-us-trade-deal/a687734848.html",
    "timestamp": "2025-07-27T13:03:34Z"
  },
  {
    "title": "Schools must make classrooms sane again — and ditch ‘restorative justice’",
    "description": "Leftist ideas of \"equity\" have done enough damage to our kids' education. It’s time for our schools to reestablish rules, order and accountability. Here's how.",
    "link": "https://nypost.com/2025/07/27/opinion/make-classrooms-sane-again-and-ditch-restorative-justice/",
    "timestamp": "2025-07-27T13:01:32Z"
  },
  {
    "title": "EU delegation poised for Trump trade talks in Scotland",
    "description": "Maroš Šefčovič arrives to join Ursula von der Leyen, although US president says chances of deal still 50/50\nA high-power EU delegation has landed in Scotland nervously anticipating a breakthrough in talks with Donald Trump at a crunch meeting on Sunday to avo…",
    "link": "https://biztoc.com/x/b56f387d07a0b7c7",
    "timestamp": "2025-07-27T13:00:54Z"
  },
  {
    "title": "EXCLUSIVE: Mysterious giant Elon Musk head travels America's national parks, saying 'Make America Wait Again'",
    "description": "An anonymous backer told Fox News Digital why he commissioned a 12-foot Elon Musk head and dragged it across America’s most beloved national parks, sparking debate.",
    "link": "https://www.foxnews.com/travel/mysterious-giant-elon-musk-head-travels-americas-national-parks-saying-make-america-wait-again",
    "timestamp": "2025-07-27T13:00:12Z"
  },
  {
    "title": "Gutfeld Attacks Tarlov For Citing Trump's Low Approval Ratings In Fox Poll",
    "description": "Fox must be paying Jessica Tarlov pretty well to put up with arguing with these blithering idiots week after week. During a segment on this Friday's The Five, where they started out by attacking Democrats for a since deleted Tweet, showing a chart with the ri…",
    "link": "https://crooksandliars.com/2025/07/gutfeld-attacks-tarlov-citing-trumps",
    "timestamp": "2025-07-27T13:00:02Z"
  },
  {
    "title": "Why your energy bill is suddenly so much more expensive",
    "description": "And why it’s not getting cheaper any time soon.",
    "link": "https://grist.org/energy/why-your-energy-bill-is-suddenly-so-much-more-expensive/",
    "timestamp": "2025-07-27T13:00:00Z"
  },
  {
    "title": "Could the Epstein Controversy Engulf Donald Trump’s Presidency?",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist to discuss how the Jeffery Epstein controversy is affecting the Trump administration and its supporters.",
    "link": "https://www.today.com/video/could-the-epstein-controversy-engulf-donald-trump-s-presidency-243902533899",
    "timestamp": "2025-07-27T12:58:59Z"
  },
  {
    "title": "'Shoot illegals': C-SPAN caller wants Trump to go 'a lot further' on immigration",
    "description": "A Massachusetts man called on President Donald Trump to go \"a lot further\" on immigration by shooting undocumented immigrants.During Sunday's Washington Journal program on C-SPAN, a man named Ryan called in to urge the president to be tougher on immigration.\"…",
    "link": "https://www.rawstory.com/trump-shoot-illegals/",
    "timestamp": "2025-07-27T12:58:11Z"
  },
  {
    "title": "Thai and Cambodian leaders to meet in Malaysia for talks to end deadly border dispute",
    "description": "Thai and Cambodian leaders will meet in Malaysia for talks to end hostilities, a spokesperson for the Thai prime minister's office said on Sunday.",
    "link": "https://www.npr.org/2025/07/27/nx-s1-5481779/thai-cambodian-leaders-to-meet-malaysia-talks-end-deadly-border-dispute",
    "timestamp": "2025-07-27T12:51:45Z"
  },
  {
    "title": "Canada: Let's allow the US to spy on all our citizens and backdoor everything",
    "description": "The Canadian government is preparing to give away Canadians’ digital lives—to U.S. police, to the Donald Trump administration, and possibly to foreign spy agencies.Bill C-2, the so-called Strong Borders Act, is a sprawling surveillance bill with multiple priv…",
    "link": "https://slashdot.org/submission/17338266/canada-lets-allow-the-us-to-spy-on-all-our-citizens-and-backdoor-everything",
    "timestamp": "2025-07-27T12:48:08Z"
  },
  {
    "title": "Outcome of EU-US tariff talks 'not certain' - McGrath",
    "description": "European Union commissioner Michael McGrath has said \"the world has changed\" and that economic terms \"we had six months ago are no longer available\" amid ongoing discussions on an EU-US tariff deal.",
    "link": "https://www.rte.ie/news/2025/0727/1525581-outcome-of-eu-us-tariff-talks-not-certain-mcgrath/",
    "timestamp": "2025-07-27T12:45:12Z"
  }
]