[
  {
    "title": "Trump blocks Medicare coverage for obesity drugs",
    "description": "President Donald Trump's administration has decided not to cover expensive, high-demand obesity treatments under the government-funded Medicare program",
    "link": "https://www.4029tv.com/article/trump-administration-medicare-obesity-drug-decision/64392328",
    "timestamp": "2025-04-05T09:46:25Z"
  },
  {
    "title": "US research highlights RT role in media landscape",
    "description": "Since 2014, the New York Times has published more than 500 articles about RT, a review by Johns Hopkins University has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615267-rt-media-impact-us-research/",
    "timestamp": "2025-04-05T09:45:14Z"
  },
  {
    "title": "Democrats Might Finally Be Learning an Important Lesson. Will They Run With It?",
    "description": "Will the party do something with this momentum?",
    "link": "https://slate.com/news-and-politics/2025/04/cory-booker-democrats-donald-trump-news.html",
    "timestamp": "2025-04-05T09:40:00Z"
  },
  {
    "title": "US, Nigeria seek to strengthen ties amid tariff dispute",
    "description": "The United States Deputy Secretary of State, Christopher Landau, has held a phone conversation with Nigeria’s Foreign Minister, Ambassador Yusuf Tuggar. The discussion, which took place on Friday, focused on a range of issues, including the enhancement of com…",
    "link": "https://punchng.com/us-nigeria-seek-to-strengthen-ties-amid-tariff-dispute/",
    "timestamp": "2025-04-05T09:36:48Z"
  },
  {
    "title": "China Strikes Back: Beijing's Bold Response to Trump’s Tariff Offensive",
    "description": "As global markets reel from U.S. President Donald Trump’s sweeping announcement of new tariffs on nearly all trade partners, China has emerged at the forefront of international backlash, firing off its strongest retaliatory move yet and signaling that it is p…",
    "link": "https://english.gossiplankanews.com/2025/04/china-strikes-back-beijings-bold.html",
    "timestamp": "2025-04-05T09:36:00Z"
  },
  {
    "title": "Not Making America Green: The Impact Of President Trump’s Tariffs",
    "description": "Clean tech especially in the U.S. is in for a rough ride following the President's latest tariffs. How will the rest of the world respond?",
    "link": "https://www.forbes.com/sites/heatherfarmbrough/2025/04/05/not-making-america-green-the-impact-of-president-trumps-tariffs/",
    "timestamp": "2025-04-05T09:30:58Z"
  },
  {
    "title": "Bitcoin’s Most Critical Support Level At $69,000 — Here’s Why",
    "description": "The price of Bitcoin made a strong start to the month of April, reaching as high as $87,000 on Wednesday, April 2. The flagship cryptocurrency couldn’t sustain this blistering momentum, dropping below $84,000 in the late hours of Friday, April 4. However, the…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-critical-support-level-at-69000-why/",
    "timestamp": "2025-04-05T09:30:21Z"
  },
  {
    "title": "Trump’s Tariffs Are Threatening the US Semiconductor Revival",
    "description": "While the White House carved out a narrow exemption for some semiconductor imports, President Donald Trump’s sweeping tariffs still apply to GPUs and chipmaking equipment.",
    "link": "https://www.wired.com/story/trump-tariffs-impact-semiconductors-chips/",
    "timestamp": "2025-04-05T09:30:00Z"
  },
  {
    "title": "Lucas: Karen Spilka and the Massachusetts Senate will ‘take on’ Trump. Yeah. Right.",
    "description": "Lucas: What surely must have President Trump shaking in his boots was the vow by Democrat state Senate President Karen Spilka to stand up to him and his campaign to cut fraud, waste abuse in federal government programs.",
    "link": "https://www.bostonherald.com/2025/04/05/lucas-karen-spilka-and-the-massachusetts-senate-will-take-on-trump-yeah-right/",
    "timestamp": "2025-04-05T09:26:19Z"
  },
  {
    "title": "Watch: 'Chinese Donald Trump' Impersonates US President In Viral Video",
    "description": "During his trip to China, American streamer IShowSpeed had a surprise encounter with a Donald Trump impersonator in Chongqing.",
    "link": "https://www.ndtv.com/world-news/watch-chinese-donald-trump-impersonates-us-president-in-viral-video-american-streamer-ishowspeed-8093170",
    "timestamp": "2025-04-05T09:22:12Z"
  },
  {
    "title": "Trump’s Tariffs Are Extremely Dumb, Just Not For The Reasons You Might Think",
    "description": "The massive Trump tariffs are a con on a global scale. Trump is not rejecting the corporate trade model. He’s weaponizing it.",
    "link": "https://www.nakedcapitalism.com/2025/04/trumps-tariffs-are-extremely-dumb-just-not-for-the-reasons-you-might-think.html",
    "timestamp": "2025-04-05T09:21:53Z"
  },
  {
    "title": "Trump Extends TikTok Ban Deadline Again — App’s Fate Hangs In The Balance",
    "description": "The clock is ticking for TikTok owner ByteDance as potential buyers circle and pressure mounts from Washington and Beijing.",
    "link": "https://www.forbes.com/sites/esatdedezade/2025/04/05/trump-extends-tiktok-ban-deadline-again---apps-fate-hangs-in-the-balance/",
    "timestamp": "2025-04-05T09:20:48Z"
  },
  {
    "title": "I'm a car dealer. Here's how I'm preparing for Trump's tariffs on autos",
    "description": "Some prospective car buyers have rushed to buy cars ahead of expected tariffs.\nScott Olson/Getty Images\nCars and car parts are on the long list of goods that Donald Trump hit with tariffs this week.\nOne dealer said he was bringing in extra vehicles and parts …",
    "link": "https://biztoc.com/x/86075751e970b8d6",
    "timestamp": "2025-04-05T09:17:05Z"
  },
  {
    "title": "WTO chief says deeply concerned over U.S. tariffs",
    "description": "Director-General of the World Trade Organization (WTO), Ngozi Okonjo-Iweala, expressed deep concern on Thursday over the decline in global trade and the potential for an escalating tariff war, sparked by U.S. tariff measures.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-pdo06.htm",
    "timestamp": "2025-04-05T09:16:51Z"
  },
  {
    "title": "Wall Street investors suffer $8 trillion shock since Trump took over. Is the worst yet to come?",
    "description": "President Trump's new tariffs have sparked a significant financial crisis, leading to an $8 trillion market value drop, with the Nasdaq falling into a bear market. Economists now warn of a possible recession, with global supply chains disrupted and investor c…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-investors-suffer-8-trillion-shock-since-trump-took-over-is-the-worst-yet-to-come/articleshow/120009590.cms",
    "timestamp": "2025-04-05T09:12:35Z"
  },
  {
    "title": "Americans Were Souring on Trump’s Plans Before Tariffs",
    "description": "“Americans elected Donald Trump with a favorable opinion of his economic plans. But his expansive push for tariffs has helped turn that confidence into skepticism,” a new Wall Street Journal poll finds. “Tepid support for",
    "link": "https://politicalwire.com/2025/04/05/americans-were-souring-on-trumps-plans-before-tariffs/",
    "timestamp": "2025-04-05T09:12:01Z"
  },
  {
    "title": "Yemen's army thwarts two US attacks: Spokesman",
    "description": "The Yemeni Armed Forces have conducted a retaliatory attack against US warships in the Red Sea, including USS Harry S. Truman aircraft carrier, thwarting two planned strikes targeting the impoverished nation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-presstv04.htm",
    "timestamp": "2025-04-05T09:11:26Z"
  },
  {
    "title": "I'm a car dealer. Here's how I'm preparing for Trump's tariffs on autos.",
    "description": "A car dealer in the Midwest said he's bringing in more cars and car parts to prepare for the tariffs that Donald Trump announced on Wednesday.",
    "link": "https://www.businessinsider.com/car-dealer-stocking-vehicles-parts-as-trump-tariffs-hit-2025-4",
    "timestamp": "2025-04-05T09:11:01Z"
  },
  {
    "title": "USAGM Terminates Some Satellite Broadcasts By Radio Free Europe's Russian-Language Current Time",
    "description": "The US Agency for Global Media (USAGM) has terminated contracts with two satellite systems that carry Russian-language content produced by Current Time, a network run by Radio Free Europe/Radio Liberty, amid a fight over winding down operations at a number of…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-rferl01.htm",
    "timestamp": "2025-04-05T09:10:13Z"
  },
  {
    "title": "What 'Unprecedented' US Tariffs Mean For Europe",
    "description": "US President Donald Trump's April 2 announcement to raise tariffs to the highest level in more than 100 years has sent stock markets tumbling and shaken the global economy.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-rferl02.htm",
    "timestamp": "2025-04-05T09:10:05Z"
  },
  {
    "title": "Samarkand Summit Marks A New Era In EU-Central Asia Relations Amid Geopolitical Challenges",
    "description": "The European Union says it is entering a \"new era\" in its relationship with Central Asian nations following a summit aimed at making inroads in a region dominated by Russia and China.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-rferl03.htm",
    "timestamp": "2025-04-05T09:09:17Z"
  },
  {
    "title": "A timeline of US-China tit-for-tat tariffs since Trump's first term",
    "description": "China has responded forcefully to U.S. President Donald Trump's sweeping new 34% tariffs on Chinese imports, matching the rate and expanding countermeasures. These include export controls on rare earths, WTO litigation, import bans on U.S. products, and anti-…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-timeline-of-us-china-tit-for-tat-tariffs-since-trumps-first-term/articleshow/120009498.cms",
    "timestamp": "2025-04-05T09:08:36Z"
  },
  {
    "title": "A timeline of US-China tit-for-tat tariffs since Trump’s first term",
    "description": "TAIPEI, Taiwan (AP) — China is retaliating in a determined and at times highly detailed manner to U.S. President Donald Trump’s new tariffs, led by a retaliatory 34% tax on all U.S. imports next week. The strong response shows a degree of preparation that lea…",
    "link": "https://financialpost.com/pmn/a-timeline-of-us-china-tit-for-tat-tariffs-since-trumps-first-term-2",
    "timestamp": "2025-04-05T09:08:23Z"
  },
  {
    "title": "Sure, Congress could stop Trump's tariff plan, but they won't",
    "description": "Some GOP lawmakers have publicly split from President Donald Trump over his tariff plan, proposing bills to rein him in on trade issues, but the measures almost certainly won't pass.\nTasos Katopodis/Getty Images\nPresident Donald Trump's sweeping tariff plan t…",
    "link": "https://biztoc.com/x/0dd5dcbb0e23eb47",
    "timestamp": "2025-04-05T09:06:15Z"
  },
  {
    "title": "Stargate developer Crusoe could spend $3.5 billion on a Texas data center. Most of it will be tax-free",
    "description": "Oracle executive chairman and CTO Larry Ellison at the White House to announce Project Stargate with President Donald Trump.\nElizabeth Frantz/REUTERS\nThe Abilene City Council approved a tax abatement for Crusoe's data center campus in Texas.\nBusiness Insider …",
    "link": "https://biztoc.com/x/328606afd75d17fa",
    "timestamp": "2025-04-05T09:06:05Z"
  },
  {
    "title": "Argentina's Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "While the world’s leaders were wringing their hands over President Donald Trump’s announcement of sweeping tariffs on U.S. imports, Argentina’s right-wing president was ebullient, feted at Trump’s Mar-a-Lago club.",
    "link": "https://www.clickondetroit.com/news/world/2025/04/05/argentinas-milei-doubles-down-on-trump-bromance-as-the-world-reels-from-trade-shock/",
    "timestamp": "2025-04-05T09:06:00Z"
  },
  {
    "title": "Pezeshkian: Iran's capability in defending itself at highest level",
    "description": "Iranian President Masoud Pezeshkian has reaffirmed that the Islamic Republic seeks no war with any country, but is determined to defend itself against any aggression.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250404-presstv01.htm",
    "timestamp": "2025-04-05T09:04:42Z"
  },
  {
    "title": "Argentina's Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "While the world’s leaders were wringing their hands over President Donald Trump’s announcement of sweeping tariffs on U.S. imports, Argentina’s right-wing president was ebullient, feted at Trump’s Mar-a-Lago club",
    "link": "https://abcnews.go.com/International/wireStory/argentinas-milei-doubles-trump-bromance-world-reels-trade-120513964",
    "timestamp": "2025-04-05T09:02:15Z"
  },
  {
    "title": "Kerrygold hopeful of 'negotiated solution' to tariffs as Irish dairy industry braces for impact",
    "description": "Irish dairy exports to the US exports were valued at €830 million last year.",
    "link": "https://www.thejournal.ie/kerrygold-tariffs-dairy-impact-6669439-Apr2025/",
    "timestamp": "2025-04-05T09:01:56Z"
  },
  {
    "title": "PRESS COMMUNIQUE",
    "description": "The US President issued an Executive Order on Reciprocal Tariffs imposing additional ad-valorem duties ranging from 10% to 50% on imports from all trading partners",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-250403-india-pib08.htm",
    "timestamp": "2025-04-05T09:01:48Z"
  },
  {
    "title": "Stargate developer Crusoe could spend $3.5 billion on a Texas data center. Most of it will be tax-free.",
    "description": "The city of Abilene approved an 85% property tax abatement for data center developer Crusoe.",
    "link": "https://www.businessinsider.com/crusoes-project-stargate-data-center-tax-break-in-abilene-texas-2025-4",
    "timestamp": "2025-04-05T09:01:01Z"
  },
  {
    "title": "Members of Congress Agree: Jerry Nadler Is the Capitol's Worst-Smelling Man",
    "description": "He knows how to make a stink. Longtime New York congressman Jerry Nadler has become famous as a champion of progressive policies in the House of Representatives. But among his colleagues in the chamber, he has also earned the dubious distinction of being its …",
    "link": "https://freebeacon.com/democrats/members-of-congress-agree-jerry-nadler-is-the-capitols-worst-smelling-man/",
    "timestamp": "2025-04-05T09:00:54Z"
  },
  {
    "title": "The Rocky Road to Liberation",
    "description": "With Wednesday’s sweeping announcement of tariffs, Donald Trump has achieved one of his major goals for this term: raising taxes on imports. As he said in the Rose Garden, \"For decades, our country has been looted, pillaged, raped, and plundered by nations ne…",
    "link": "https://freebeacon.com/columns/the-rocky-road-to-liberation/",
    "timestamp": "2025-04-05T09:00:52Z"
  },
  {
    "title": "Any agreement will be subject to approval under Chinese law, ByteDance says after Trump's additional 75-day extension from ban",
    "description": "TikTok's owner, Chinese technology company ByteDance said on early Saturday morning that it is involved in negotiations with the US government but has yet to execute any agreement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250405-globaltimes01.htm",
    "timestamp": "2025-04-05T09:00:10Z"
  },
  {
    "title": "Ireland has its own history with imposing tariffs, it's bleak to say the least",
    "description": "After becoming largely independent in the 1920s, the Irish state used tariffs up until around the 1960s.",
    "link": "https://www.thejournal.ie/ireland-tariffs-2-6668989-Apr2025/",
    "timestamp": "2025-04-05T09:00:05Z"
  },
  {
    "title": "For this Mi'kmaw creator, art is a way to amplify activism and promote Indigenous sovereignty",
    "description": "Mel Beaulieu is a queer Mi’kmaw artist whose work centres on Indigenous resistance, gender identity, and tradition. They say a dark political climate is informing their art.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/mel-beaulieu-art-politics-1.7497860",
    "timestamp": "2025-04-05T09:00:00Z"
  },
  {
    "title": "The Affordable Car Is About to Go Extinct in the US",
    "description": "As President Donald Trump’s tariffs set in, it may well be time to say goodbye to the under-$30,000 car.",
    "link": "https://www.wired.com/story/trump-tariffs-affordable-cars-extinct-united-states/",
    "timestamp": "2025-04-05T09:00:00Z"
  },
  {
    "title": "‘Hands Off!’ protests against Trump and Musk are planned across the US",
    "description": "More than 1,200 “Hands Off!” demonstrations have been planned by more than 150 groups, including civil rights organizations, labor unions, LBGTQ+ advocates, veterans and fair-elections activists.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_b6b04004-1ce7-48fc-9581-2136a4396a15.html",
    "timestamp": "2025-04-05T09:00:00Z"
  },
  {
    "title": "Small-Dollar Donors Are Asking John Fetterman for Their Money Back",
    "description": "Amid a wellspring of discontent over the Pennsylvania senator’s coziness with Israel and Republicans, people are demanding campaign donation refunds.\nThe post Small-Dollar Donors Are Asking John Fetterman for Their Money Back appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/05/john-fetterman-israel-campaign-donation-refunds/",
    "timestamp": "2025-04-05T09:00:00Z"
  },
  {
    "title": "Microsoft Hooked the Government on Its Products With Freebies. Could Elon Musk’s Starlink Be Doing the Same?",
    "description": "by Renee Dudley \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nA few weeks ago, my colleague Doris Burke sent me a story from The New York Tim…",
    "link": "https://www.propublica.org/article/elon-musk-starlink-trump-white-house-spacex-microsoft",
    "timestamp": "2025-04-05T09:00:00Z"
  },
  {
    "title": "'Imagine if I had done any of this': Barack Obama reacts to Trump administration after tariff shocker",
    "description": "Barack Obama, breaking his silence, criticized Donald Trump’s administration for infringing on rights, targeting free speech, and threatening law firms. He expressed concern over Trump’s tariffs and questioned Republican double standards. Vice President Kamal…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/imagine-if-i-had-done-any-of-this-barack-obama-reacts-to-trump-administration-after-tariff-shocker/articleshow/120009044.cms",
    "timestamp": "2025-04-05T08:59:54Z"
  },
  {
    "title": "China will impose an additional 34% tariff on imports of all U.S. products",
    "description": "As a part of a retaliatory measures to U.S. President Donald Trump's imposition of tariffs on Chinese goods, Beijing has decided to impose an additional 34% tariff on imports of all U.S. products, effective April 10.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250404-irna01.htm",
    "timestamp": "2025-04-05T08:59:45Z"
  },
  {
    "title": "China hits back with 34% tariffs on US imports as fears of global recession rise",
    "description": "China has announced retaliatory tariffs of 34% on US imports, taking effect from April 10, signaling a sharp escalation of a major trade war that could lead to a global recession.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250404-presstv01.htm",
    "timestamp": "2025-04-05T08:59:43Z"
  },
  {
    "title": "China to impose new tariffs on US goods after Trump upended global trade status quo",
    "description": "China is imposing retaliatory tariffs on U.S. goods a day after President Donald Trump announced sweeping taxes on trade with most countries -- the latest escalation of a trade war that could stunt economic growth worldwide. the latest escalation of a trade w…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250404-rfa01.htm",
    "timestamp": "2025-04-05T08:59:40Z"
  },
  {
    "title": "Trump Admin Mistakenly Threatens To Deport Ukrainian Refugees: 'Depart'",
    "description": "The Department of Homeland Security later said the message had been sent by mistake.",
    "link": "https://www.newsweek.com/trump-admin-mistakenly-threatens-deport-ukrainian-refugees-2055768",
    "timestamp": "2025-04-05T08:58:05Z"
  },
  {
    "title": "Top finance influencers share their 5 best pieces of advice for budgeting, investing, and more as tariffs rock the market",
    "description": "We asked top women finance influencers to share their No. 1 piece of advice ahead of the next round of tariffs.",
    "link": "https://www.businessinsider.com/finance-influencers-share-best-advice-as-tariffs-rock-market-2025-4",
    "timestamp": "2025-04-05T08:58:02Z"
  },
  {
    "title": "Sure, Congress could stop Trump's tariff plan, but they won't",
    "description": "Four political scientists told Business Insider Congress has the power to stop Donald Trump's tariff plan, but there's almost no chance they will.",
    "link": "https://www.businessinsider.com/could-congress-stop-trump-tariffs-2025-4",
    "timestamp": "2025-04-05T08:55:02Z"
  },
  {
    "title": "Senate Stages All-Night Session Aiming to Advance Trump’s Tax Cuts - WSJ",
    "description": "Senate Stages All-Night Session Aiming to Advance Trump’s Tax CutsWSJ Senate GOP approves framework for Trump's tax breaks and spending cuts after late-night sessionAP News Donald Trump Scores Major Senate WinNewsweek Senate begins ‘vote-a-rama’ as GOP takes …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176932329",
    "timestamp": "2025-04-05T08:52:59Z"
  },
  {
    "title": "Brace for Taiwan stock market turbulence over Trump tariff: Premier",
    "description": "Premier Cho Jung-tai (卓榮泰) on Friday said people in Taiwan should be ready to brace for turbulence brought by U.S. President Donald Trump's \"Liberation Day\" tariff when the local stock market reopens on Monday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250404-cna07.htm",
    "timestamp": "2025-04-05T08:52:42Z"
  },
  {
    "title": "Cabinet pledges NT$88 billion to support local economy amid U.S. tariffs",
    "description": "The Executive Yuan on Friday unveiled a NT$88 billion (US$2.65 billion) proposal to assist Taiwanese businesses set to be hard hit by U.S. President Donald Trump's sweeping tariffs.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250404-cna01.htm",
    "timestamp": "2025-04-05T08:52:41Z"
  },
  {
    "title": "Trump tariffs aim to cut trade deficit, won't affect security ties: Scholars",
    "description": "With U.S. President Donald Trump's new tariffs set to take effect in the coming days, scholars on Friday said the move aims to pressure countries into negotiations to reduce trade deficits, while security ties with allies will remain unaffected.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250404-cna02.htm",
    "timestamp": "2025-04-05T08:52:39Z"
  },
  {
    "title": "Trump tariffs aim to cut trade deficit, won't affect security ties: Scholars",
    "description": "Planned negotiations with the United States will focus on bringing down the sweeping duties pledged by U.S. President Donald Trump on Taiwanese goods, Taiwan's top trade negotiator Yang Jen-ni (楊珍妮) said Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250404-cna03.htm",
    "timestamp": "2025-04-05T08:52:38Z"
  },
  {
    "title": "‘Oops’: Donald Trump shares video showing attack on Yemen's Houthis - Hindustan Times",
    "description": "‘Oops’: Donald Trump shares video showing attack on Yemen's HouthisHindustan Times Cost of US military offensive against Houthis nears $1 billion with limited impactCNN U.S. Strikes in Yemen Burning Through Munitions With Limited SuccessThe New York Times Tru…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176932321",
    "timestamp": "2025-04-05T08:52:28Z"
  },
  {
    "title": "Russian Strike Kills 18 In Zelenskyy's Hometown In One Of The Worst Attacks On Civilians This Year",
    "description": "A Russian missile attack that hit in a residential area of the industrial Ukrainian city of Kryvyi Rih on April 4 killed at least 18 people, half of them children, President Volodymyr Zelenskyy said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250404-rferl02.htm",
    "timestamp": "2025-04-05T08:51:01Z"
  },
  {
    "title": "Europe Calls Out Putin For Failing To Make Ukraine Peace Deal",
    "description": "Several of Europe's top diplomats called out Russian President Vladimir Putin for failing to agree to a US-led peace proposal to end the war in Ukraine amid signs Washington has grown wary of the Kremlin's intentions during several weeks of talks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250404-rferl03.htm",
    "timestamp": "2025-04-05T08:51:01Z"
  },
  {
    "title": "Trump advised not to call Putin until Moscow agrees to full ceasefire: NBC",
    "description": "U.S. President Donald Trump's inner circle has advised him not to call Russian President Vladimir Putin until Moscow agrees to a full ceasefire with Ukraine, NBC News reported Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250404-pdo01.htm",
    "timestamp": "2025-04-05T08:50:58Z"
  },
  {
    "title": "Death Count In Myanmar Quake Crosses 3,300: Report",
    "description": "The March 28 quake flattened buildings and destroyed infrastructure across the country, resulting in 3,354 deaths and 4,508 people injured, with 220 others missing, according to new figures published by state media.",
    "link": "https://www.ndtv.com/world-news/death-count-in-myanmar-quake-crosses-3-300-report-8092977",
    "timestamp": "2025-04-05T08:49:27Z"
  },
  {
    "title": "Nissan considers transferring some domestic production to US, Nikkei says",
    "description": "Nissan Motor considers moving some U.S.-bound vehicle production from Japan to the U.S. to escape the impact of President Trump's tariffs. The automaker plans to reduce output at its Fukuoka plant and transfer production of its Rogue SUV to its Tennessee faci…",
    "link": "https://economictimes.indiatimes.com/news/international/business/nissan-considers-transferring-some-domestic-production-to-us-nikkei-says/articleshow/120008928.cms",
    "timestamp": "2025-04-05T08:47:00Z"
  },
  {
    "title": "Why Trump Tariffs Put Lucrative Transatlantic Flights at Risk",
    "description": "Optimism about travel demand has been put to the test by US President Donald Trump's tariffs with airlines including Virgin ...",
    "link": "https://biztoc.com/x/474db301e1115750",
    "timestamp": "2025-04-05T08:45:22Z"
  },
  {
    "title": "More than 1,200 protests against Donald Trump and Elon Musk planned across the US Saturday",
    "description": "Opponents of president Donald Trump and billionaire Elon Musk plan to rally across the US later today.",
    "link": "https://www.independent.ie/world-news/more-than-1200-protests-against-donald-trump-and-elon-musk-planned-across-the-us-saturday/a1919697141.html",
    "timestamp": "2025-04-05T08:44:01Z"
  },
  {
    "title": "Tariff risks US market crash for humble Aussie wines",
    "description": "The blanket 10 per cent tariff on all wine sent to the US will have a profound impact on a sector still struggling after three years of Chinese tariffs.",
    "link": "https://7news.com.au/business/tariff-risks-us-market-crash-for-humble-aussie-wines-c-18269239",
    "timestamp": "2025-04-05T08:41:37Z"
  },
  {
    "title": "Why Americans Are Rushing To Buy Essential Items Ahead Of Trump's Tariffs",
    "description": "Donald Trump announced reciprocal tariffs on almost all countries, including the US allies such as the United Kingdom and the European Union.",
    "link": "https://www.ndtv.com/world-news/laptops-coffee-diapers-americans-rush-to-buy-essentials-ahead-of-donald-trumps-tariffs-8092943",
    "timestamp": "2025-04-05T08:41:22Z"
  },
  {
    "title": "US starts collecting Trump tariffs, smashing global trade norms after stock market sell-off",
    "description": "US customs agents began collecting President Donald Trump's unilateral 10pc tariff on all imports from many countries on Saturday, with higher levies on goods (20pc for Ireland the EU) from 57 larger trading partners due to start next week.",
    "link": "https://www.independent.ie/world-news/us-starts-collecting-trump-tariffs-smashing-global-trade-norms-after-stock-market-sell-off/a743212676.html",
    "timestamp": "2025-04-05T08:35:25Z"
  },
  {
    "title": "7 Things- Trade war declared; gambling is dead; protests banned at homes; and more ...",
    "description": "Commerce Secretary Howard Lutnick asserts there’s no chance Trump will abandon his tariff plan, predicting long-term market gains despite immediate fallout, as Singapore and Switzerland pursue engagement with the Trump administration, France demands a Europea…",
    "link": "https://yellowhammernews.com/7-things-trade-war-declared-gambling-is-dead-protests-banned-at-homes-and-more/",
    "timestamp": "2025-04-05T08:34:20Z"
  },
  {
    "title": "Commerce Secretary Howard Lutnick on the US trying to take chip manufacturing from Taiwan: 'Why can't those be made with robotics in America?'",
    "description": "Commerce Secretary Howard Lutnick said the US is going to bring back chip manufacturing from Taiwan.\n- President Donald Trump's latest round of reciprocal tariffs do not apply to semiconductors.\n- But Lutnick said Trump is \"going to deeply study those\" and br…",
    "link": "https://biztoc.com/x/997bbec4d3712c06",
    "timestamp": "2025-04-05T08:32:42Z"
  },
  {
    "title": "Cathie Wood Weighs In On Trump's 'Tariff Turmoil' And Potential Economic Impact: 'If President Trump Cares About His Legacy…'",
    "description": "Cathie Wood, CEO of Ark Invest, on Friday warned that President Donald Trump’s new tariffs could push the U.S. economy into a recession but remained optimistic that innovation and smart policy could lead to a recovery.\nWhat Happened: During an \"Employment Fri…",
    "link": "https://biztoc.com/x/695dc944f002f3b9",
    "timestamp": "2025-04-05T08:32:40Z"
  },
  {
    "title": "Donald Trump called out after sharing video of US Army 'decimating' people on social media",
    "description": "Donald Trump shared the air strike footage on his social media platform, Truth Social",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-houthis-yemen-video-377838-20250405",
    "timestamp": "2025-04-05T08:32:05Z"
  },
  {
    "title": "Putin thinks time is on his side. Sadly he may be right, says Alexander Gabuev",
    "description": "Efforts are under way to find a negotiated settlement. But, asks the head of Carnegie Russia Eurasia Centre, has the Kremlin got the memo?",
    "link": "https://www.livemint.com/opinion/online-views/putin-thinks-time-is-on-his-side-sadly-he-may-be-right-says-alexander-gabuev-11743824668032.html",
    "timestamp": "2025-04-05T08:30:13Z"
  },
  {
    "title": "While Canada was spared from further tariffs — for now — N.L. plans to hold its ground",
    "description": "Newfoundland and Labrador Premier Andrew Furey vows to keep U.S. alcohol off of liquor store shelves. Meanwhile, seafood entrepreneur Danny Dumaresque says he'll continue to look outside of the U.S. for new markets.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/furey-us-trade-war-1.7500793",
    "timestamp": "2025-04-05T08:30:00Z"
  },
  {
    "title": "America is about to be hit by a 'tsunami' of authentic Chinese restaurants",
    "description": "Dozens of Chinese restaurant chains are opening their doors in America — if they can survive the backlash.",
    "link": "https://www.businessinsider.com/china-restaurants-food-chains-coming-us-geopolitical-trade-war-backlash-2025-4",
    "timestamp": "2025-04-05T08:24:02Z"
  },
  {
    "title": "Nissan considers transferring some domestic production to U.S., report says",
    "description": "The carmaker plans to reduce production at its Fukuoka factory and shift some manufacturing to the U.S. to mitigate the impact of Trump's tariffs.",
    "link": "https://www.japantimes.co.jp/business/2025/04/05/companies/nissan-production-us-shift/",
    "timestamp": "2025-04-05T08:24:00Z"
  },
  {
    "title": "Argentina's Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "Argentina’s Milei doubles down on Trump bromance as the world reels from trade shock\nBUENOS AIRES, Argentina (AP) — Europe vowed retaliation. China plotted tariffs of its own. Mexico scrambled to blunt the blow. But while the world’s leaders were wringing the…",
    "link": "https://biztoc.com/x/dcbc39d9757bce52",
    "timestamp": "2025-04-05T08:22:26Z"
  },
  {
    "title": "Trump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil (Erik Wasson/Bloomberg)",
    "description": "Erik Wasson / Bloomberg:\nTrump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil  —  Senate Republicans took a major step toward enacting President Donald Trump's tax cut agenda and increasing the debt ceiling that could inject a small degree of certainty…",
    "link": "https://www.memeorandum.com/250405/p5",
    "timestamp": "2025-04-05T08:20:00Z"
  },
  {
    "title": "Nissan considers transferring some domestic production to US, Nikkei says",
    "description": "TOKYO : Nissan Motor is considering shifting some domestic production of U.S.-bound vehicles to the U.S., the Nikkei reported on Saturday, as President Donald Trump ramps up trade tariffs on nations worldwide.As early as this summer, Nissan plans to reduce pr…",
    "link": "https://www.channelnewsasia.com/business/nissan-considers-transferring-some-domestic-production-us-nikkei-says-5046576",
    "timestamp": "2025-04-05T08:17:46Z"
  },
  {
    "title": "2 charts show who's getting hired right now",
    "description": "Healthcare has had strong job growth over the last several months.",
    "link": "https://www.businessinsider.com/what-industries-are-hiring-employment-cant-find-job-2025-4",
    "timestamp": "2025-04-05T08:16:01Z"
  },
  {
    "title": "Argentina’s Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "BUENOS AIRES, Argentina (AP) — Europe vowed retaliation. China plotted tariffs of its own. Mexico scrambled to blunt the blow. But while the world’s leaders were wringing their hands over President Donald Trump’s announcement of sweeping tariffs on U.S. impor…",
    "link": "https://financialpost.com/pmn/argentinas-milei-doubles-down-on-trump-bromance-as-the-world-reels-from-trade-shock",
    "timestamp": "2025-04-05T08:15:56Z"
  },
  {
    "title": "Police expect anti-Trump protests to be peaceful in Portland, plan to help marchers move through streets - OregonLive.com",
    "description": "Police expect anti-Trump protests to be peaceful in Portland, plan to help marchers move through streetsOregonLive.com 'There's a movement bubbling up': Anti-Trump protests planned nationwide SaturdayUSA Today 'Hands Off!': Nationwide protests against Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176932079",
    "timestamp": "2025-04-05T08:12:44Z"
  },
  {
    "title": "The last time the US raised tariffs this much it made the Great Depression way worse",
    "description": "President Donald Trump announced reciprocal tariffs on imported goods from other countries on Wednesday.\nCarlos Barria/REUTERS\nTrump increased tariffs on US imports to the highest levels in nearly a century.\nThe Smoot-Hawley Tariff Act of 1930 raised tariffs …",
    "link": "https://biztoc.com/x/79d51cc29d657f5e",
    "timestamp": "2025-04-05T08:11:01Z"
  },
  {
    "title": "What a Third Donald Trump Term Could Look Like",
    "description": "Experts discuss with Newsweek what it would mean if Trump is still in the White House come 2029.",
    "link": "https://biztoc.com/x/e2acd4103774e937",
    "timestamp": "2025-04-05T08:10:44Z"
  },
  {
    "title": "Trump Tariffs Could Spike iPhone Prices To Almost $2,300 If Apple Decides To Pass On The Costs To Buyers",
    "description": "President Donald Trump has enacted sweeping tariffs that could significantly increase the cost of consumer goods, including Apple Inc. (NASDAQ:AAPL) iPhones. Analysts foresee a potential price surge of 30% to 40% if Apple passes these costs onto consumers.\nWh…",
    "link": "https://biztoc.com/x/b05077c6b54ff615",
    "timestamp": "2025-04-05T08:10:42Z"
  },
  {
    "title": "The last time the US raised tariffs this much it made the Great Depression way worse",
    "description": "Trump's tariff hike mirrors the 1930 Smoot-Hawley Tariff Act, which exacerbated the Great Depression and led to a major shift in US trade policy.",
    "link": "https://www.businessinsider.com/trumps-tariffs-highest-since-the-great-depression-2025-4",
    "timestamp": "2025-04-05T08:07:02Z"
  },
  {
    "title": "Fissure among Conservatives undermining Poilievre's pitch he's a national unifier: experts",
    "description": "Long-simmering tensions within the Conservative movement are bursting out into the federal election, experts say — undercutting Conservative Leader Pierre Poilievre’s efforts to present himself as a unifier who can take on U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/politics/poilievre-manning-smith-fissure-conservative-movement-1.7502543",
    "timestamp": "2025-04-05T08:00:40Z"
  },
  {
    "title": "One State, No Solution: Planning for the Death of Palestinian Independence",
    "description": "'The real discourse is—de facto—not between the one state or two states but rather what kind of one state will it be,' a former Israeli leader tells Newsweek.",
    "link": "https://www.newsweek.com/death-two-state-solution-israel-palestine-2054974",
    "timestamp": "2025-04-05T08:00:03Z"
  },
  {
    "title": "Doctor Suggests Pregnancy Changes To Solve US Birth Rate Panic",
    "description": "There is a \"disconnect between pregnancies and babies,\" Dr. Jonathan Sher told Newsweek.",
    "link": "https://www.newsweek.com/pregnancy-changes-birth-rate-panic-population-fertility-rate-2054902",
    "timestamp": "2025-04-05T08:00:02Z"
  },
  {
    "title": "What a Third Donald Trump Term Could Look Like",
    "description": "Experts discuss with Newsweek what it would mean if Trump is still in the White House come 2029.",
    "link": "https://www.newsweek.com/donald-trump-third-term-2028-election-constitution-2054821",
    "timestamp": "2025-04-05T08:00:01Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "US tariffs come into effect, 18 killed in Russian strikes and funeral of Mick O’Dwyer set to take place",
    "link": "https://www.thejournal.ie/9-at-9-saturday-210-6669452-Apr2025/",
    "timestamp": "2025-04-05T08:00:00Z"
  },
  {
    "title": "Ontario tourism operators hope for summer staycation boom",
    "description": "Local tourism operators are anticipating more business this summer as Canadians opt out of travel south of the border.",
    "link": "https://www.cbc.ca/news/canada/ottawa/ontario-tourism-boost-canadian-staycationers-1.7500841",
    "timestamp": "2025-04-05T08:00:00Z"
  },
  {
    "title": "Senate GOP pushes Trump budget framework through after marathon vote series",
    "description": "The amended framework would raise the debt ceiling by up to $5 trillion within the reconciliation process, taking future leverage away from Senate Democrats.",
    "link": "https://nypost.com/2025/04/05/us-news/senate-republicans-pass-trump-budget-framework-after-marathon-vote-session/",
    "timestamp": "2025-04-05T07:58:33Z"
  },
  {
    "title": "Eggs, Eyelashes, iPhones: What Donald Trump’s trade war could really cost you",
    "description": "US President Donald Trump’s sweeping global tariffs are already rippling through everyday consumer goods, sparking price hikes across groceries, fashion, tech, and health products. From European eyewear and Finnish health rings to Chinese wigs and Swiss coffe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eggs-eyelashes-iphones-what-donald-trumps-trade-war-could-really-cost-you/articleshow/120005604.cms",
    "timestamp": "2025-04-05T07:56:43Z"
  },
  {
    "title": "US deputy Middle East envoy meets Lebanese officials to discuss contentious border issues",
    "description": "Ortagus will demand that Lebanese authorities establish a schedule for Hezbollah’s disarmament, push for talks between Israel and Lebanon.",
    "link": "https://www.jpost.com/middle-east/article-848943",
    "timestamp": "2025-04-05T07:53:24Z"
  },
  {
    "title": "Donald Trump Scores Major Senate Win",
    "description": "The Senate has approved President Donald Trump's tax and spending cut framework in a 51-49 vote.",
    "link": "https://biztoc.com/x/1c7e25727bd99496",
    "timestamp": "2025-04-05T07:48:41Z"
  },
  {
    "title": "Donald Trump Scores Major Senate Win",
    "description": "The Senate has approved President Donald Trump's tax and spending cut framework in a 51-49 vote.",
    "link": "https://www.newsweek.com/donald-trump-scores-senate-win-republican-senators-approve-tax-breaks-spending-cuts-2055766",
    "timestamp": "2025-04-05T07:43:10Z"
  },
  {
    "title": "Foxconn reports record Q1 revenue, says it must closely watch global politics",
    "description": "TAIPEI :Taiwan's Foxconn, the world's largest contract electronics maker, posted its highest first-quarter revenue ever on strong demand for artificial intelligence products but said it would need to closely watch global politics.Revenue for Apple's biggest i…",
    "link": "https://www.channelnewsasia.com/business/foxconn-reports-record-q1-revenue-says-it-must-closely-watch-global-politics-5046551",
    "timestamp": "2025-04-05T07:42:19Z"
  },
  {
    "title": "Sherman: We can boost aviation fuel independence",
    "description": "There is a growing demand that will be met by foreign producers if the government does not do more to promote domestic production.",
    "link": "https://www.bostonherald.com/2025/04/05/sherman-we-can-boost-aviation-fuel-independence/",
    "timestamp": "2025-04-05T07:28:32Z"
  },
  {
    "title": "Donald Trump says 'time to get rich' as Dow Jones crash sparks recession fears",
    "description": "Donald Trump says 'time to get rich' as Dow Jones crash sparks recession fears\nFollowing President Trump's tariffs, US markets plummet, with a $6 trillion loss affecting investments by Americans.\nThe United States markets are reeling from the shock of the rec…",
    "link": "https://biztoc.com/x/a7780cf9f0d7a9f6",
    "timestamp": "2025-04-05T07:27:13Z"
  },
  {
    "title": "Trump Tariffs Push Staunch Critic Austria to Back Mercosur Deal",
    "description": "President Donald Trump’s global tariffs are convincing Austria to ditch its long-time opposition to a trade deal between the European Union and the Mercosur bloc.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-push-staunch-critic-austria-to-back-mercosur-deal",
    "timestamp": "2025-04-05T07:21:50Z"
  },
  {
    "title": "Trump’s 10 percent tariff takes effect, raising fears of global trade war",
    "description": "Initial 'baseline' tariff comes into effect at US seaports, airports and customs warehouses as stock markets plummet.",
    "link": "https://www.aljazeera.com/news/2025/4/5/trumps-10-percent-tariff-takes-effect-raising-fears-of-global-trade-war",
    "timestamp": "2025-04-05T07:19:14Z"
  },
  {
    "title": "Trump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil",
    "description": "Senate Republicans took a major step toward enacting President Donald Trump’s tax cut agenda and increasing the debt ceiling that could inject a small degree of certainty into financial markets roiled by the president’s tariff policies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tax-cut-debt-limit-plan-advances-amid-tariff-turmoil",
    "timestamp": "2025-04-05T07:17:57Z"
  }
]