[
  {
    "title": "Michigan Governor Confronts Trump on Tariff Hit to Auto Industry",
    "description": "Michigan Democratic Governor Gretchen Whitmer told President Donald Trump that his tariffs are having a negative effect on her state’s flagship auto industry during a closed-door meeting at the White House.",
    "link": "https://financialpost.com/pmn/business-pmn/michigan-governor-confronts-trump-on-tariff-hit-to-auto-industry",
    "timestamp": "2025-08-05T20:58:25Z"
  },
  {
    "title": "Trump signs executive order establishing task force for 2028 Olympic Games in Los Angeles",
    "description": "President Trump signed an executive order forming a White House task force to oversee security, transportation, and logistics for the 2028 Summer Olympics in Los Angeles.",
    "link": "https://www.foxnews.com/sports/trump-signs-executive-order-task-force-2028-olympic-games-los-angeles",
    "timestamp": "2025-08-05T20:58:15Z"
  },
  {
    "title": "Trump Slams Gayle King, Shares Report Claiming Her CBS Future Unclear",
    "description": "The President has escalated his long-running feud with top TV anchors in targeting the CBS News star.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/trump-gayle-king-cbs-mornings-future-uncertain-woke-1236337968/",
    "timestamp": "2025-08-05T20:57:54Z"
  },
  {
    "title": "Trump to Sign Order Penalizing Politically Motivated ‘Debanking’",
    "description": "President Donald Trump plans to sign an executive order cracking down on “debanking,” a term used to describe financial institutions that selectively close customer accounts... Read More\nThe post Trump to Sign Order Penalizing Politically Motivated ‘Debanking…",
    "link": "https://www.dailysignal.com/2025/08/05/trump-sign-order-penalizing-politically-motivated-debanking/",
    "timestamp": "2025-08-05T20:57:15Z"
  },
  {
    "title": "ICE Deports 50 Irish Migrants: Anyone Here Illegally Is 'Subject to Deportation'",
    "description": "The federal government has arrested roughly 50 Irish migrants for deportation amid left-wing complaints that it is only deporting non-white migrants.\nThe post ICE Deports 50 Irish Migrants: Anyone Here Illegally Is ‘Subject to Deportation’ appeared first on B…",
    "link": "https://www.breitbart.com/economy/2025/08/05/ice-deports-50-irish-migrants-anyone-here-illegally-is-subject-to-deportation/",
    "timestamp": "2025-08-05T20:56:44Z"
  },
  {
    "title": "WATCH: Trump signs executive order on 2028 Olympic task force",
    "description": "The 2028 Games will be the first Olympics to be hosted by the U.S. since the 2002 Winter Games in Salt Lake City, Utah.",
    "link": "https://www.pbs.org/newshour/nation/watch-trump-signs-executive-order-on-2028-olympic-task-force",
    "timestamp": "2025-08-05T20:54:12Z"
  },
  {
    "title": "The Supreme Court Prepares to End Voting Rights As We Know It",
    "description": "It is a truth universally acknowledged that if you want to hide what you are doing in Washington, announce it on a Friday evening in the heat of August. Better yet, in place of clarity, reference some pages in another document, so that people have to track th…",
    "link": "https://www.motherjones.com/politics/2025/08/voting-rights-act-supreme-court-2/",
    "timestamp": "2025-08-05T20:53:50Z"
  },
  {
    "title": "USA Fencing Minnesota division to only sanction mixed events in response to trans ban",
    "description": "USA Fencing Minnesota announced it will only sanction mixed-gender events in response to new policies preventing trans athletes from competing in women's competitions.",
    "link": "https://www.foxnews.com/sports/usa-fencing-minnesota-division-only-sanction-mixed-events-trans-ban",
    "timestamp": "2025-08-05T20:53:32Z"
  },
  {
    "title": "Trump posts bloodied teen photo in drastic call to 'lock up' 14-year-olds",
    "description": "President Donald Trump went off on a rant, attacking Washington, D.C., as \"out of control\" with local \"youths.\" To solve the crime problem, Trump wants to begin charging 14-year-olds as adults. Taking to his Truth Social platform on Tuesday, Trump said gang m…",
    "link": "https://www.rawstory.com/donald-trump-2673861386/",
    "timestamp": "2025-08-05T20:52:42Z"
  },
  {
    "title": "The jobs report that enraged Trump was flashing a recession warning sign",
    "description": "The bad news in last Friday’s jobs report may have been overshadowed when President Donald Trump fired the commissioner in charge of producing it. But economists haven’t forgotten about America’s job market – and they’re growing concerned.\nSome of the jobs re…",
    "link": "https://biztoc.com/x/cf9a7d08fe4d5f7c",
    "timestamp": "2025-08-05T20:51:02Z"
  },
  {
    "title": "What, Exactly, Is the ‘Russia Hoax’?",
    "description": "To start with, it’s not a hoax.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/russia-hoax-trump-2016-election/683770/",
    "timestamp": "2025-08-05T20:51:00Z"
  },
  {
    "title": "Trump Approval Rating Jumps Double Digits With Hispanics in a Month: Polls",
    "description": "Hispanic voters were one of the key groups who proved important in securing Trump's victory in the November election.",
    "link": "https://www.newsweek.com/trump-approval-rating-jumps-double-digits-hispanics-month-polls-2109348",
    "timestamp": "2025-08-05T20:48:54Z"
  },
  {
    "title": "Labor Activist Makes Point Conservatives Have Been Making For Years Buried Deep Within Interview",
    "description": "Labor activist Dolores Huerta made a not-so-subtle admission that illegal migrants depress wages in an interview published Saturday.",
    "link": "https://dailycaller.com/2025/08/05/dolores-huerta-politico-interview-migrants-farm-workers-wages-americans-dirty-jobs/",
    "timestamp": "2025-08-05T20:45:20Z"
  },
  {
    "title": "‘FEDERALIZE This City!’ Trump Threatens to Take Over Washington DC to Get Crime Under Control",
    "description": "\"If this continues, I am going to exert my powers, and FEDERALIZE this City. MAKE AMERICA GREAT AGAIN!\"\nThe post ‘FEDERALIZE This City!’ Trump Threatens to Take Over Washington DC to Get Crime Under Control first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/federalize-this-city-trump-threatens-to-take-over-washington-dc-to-get-crime-under-control/",
    "timestamp": "2025-08-05T20:45:14Z"
  },
  {
    "title": "Undocumented man framed for Trump, ICE threats; accused in court",
    "description": "The Milwaukee man accused of writing threatening letters while posing as an undocumented man pleaded not guilty and was bound over for trial.",
    "link": "https://www.fox6now.com/news/milwaukee-undocumented-framed-trump-ice-threats-080525",
    "timestamp": "2025-08-05T20:44:59Z"
  },
  {
    "title": "Canada Will Look at Opportunities to Remove Tariffs, Carney Says",
    "description": "Prime Minister Mark Carney said Canada will look for opportunities to remove some counter-tariffs against the US, despite winning an election in which he pledged to fight back against President Donald Trump’s trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-will-look-at-opportunities-to-remove-tariffs-carney-says",
    "timestamp": "2025-08-05T20:43:16Z"
  },
  {
    "title": "Florida prepares to build a 2nd immigration detention center to join ‘Alligator Alcatraz’",
    "description": "The site is planned for a National Guard training center about 27 miles southwest of Jacksonville.",
    "link": "https://www.bostonherald.com/2025/08/05/florida-second-immigration-detention-center/",
    "timestamp": "2025-08-05T20:40:34Z"
  },
  {
    "title": "Watch Live: Donald Trump Launches 2028 Olympics Task Force",
    "description": "President Donald Trump signs an executive order creating a task force for the 2028 Olympics on Tuesday, August 5.\nThe post Watch Live: Donald Trump Launches 2028 Olympics Task Force appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/08/05/watch-live-donald-trump-launches-2028-olympics-task-force/",
    "timestamp": "2025-08-05T20:39:33Z"
  },
  {
    "title": "Crucial exemption allows majority of Canadian and Mexican goods to be shipped to US without tariffs",
    "description": "TORONTO — U.S. President Donald Trump raised the tariffs on Canadian goods to 35% last week, but a key exemption for Canada and Mexico shields the vast majority of goods from the punishing duties.\nGoods that comply with the 2020 United States-Mexico-Canada Ag…",
    "link": "https://biztoc.com/x/4f856d97d43c88da",
    "timestamp": "2025-08-05T20:39:28Z"
  },
  {
    "title": "What we know about Trump’s Fed chair candidates so far",
    "description": "President Donald Trump said Tuesday that he's whittled down his list of potential Federal Reserve chair candidates to four as he considers a successor to Jerome Powell — a choice that could reset the path of the U.S. economy.",
    "link": "https://biztoc.com/x/cab92e71034d08fb",
    "timestamp": "2025-08-05T20:39:13Z"
  },
  {
    "title": "US Colleges Could Lose Up to 150K International Students This Year Amid Trump Crackdown",
    "description": "The number of international students enrolling at U.S. colleges looks set to plummet this fall, according scenario modeling by NAFSA Association of International Educators.Insider Higher Ed reported on Tuesday that new data from NAFSA has found that American …",
    "link": "https://www.commondreams.org/news/us-international-student-enrollment",
    "timestamp": "2025-08-05T20:38:02Z"
  },
  {
    "title": "VP Vance to visit Indiana to discuss redistricting of US House seats",
    "description": "Vice President JD Vance to visit Indiana to discuss the redistricting of Indiana's U.S. House of Representatives seats.",
    "link": "https://www.wishtv.com/news/politics/vp-vance-to-visit-indiana-to-discuss-redistricting-of-us-house-seats/",
    "timestamp": "2025-08-05T20:37:41Z"
  },
  {
    "title": "Witkoff to meet with Russian leadership in Moscow on Wednesday, source says",
    "description": "WASHINGTON (Reuters) -U.S. special envoy Steve Witkoff will be in Moscow on Wednesday to meet with Russian leadership, a source familiar with the plan said on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/06/witkoff-to-meet-with-russian-leadership-in-moscow-on-wednesday-source-says",
    "timestamp": "2025-08-05T20:37:00Z"
  },
  {
    "title": "Some 'manosphere' podcasters who backed Trump are turning from him",
    "description": "During the 2024 campaign, then-candidate Donald Trump went on several podcasts in the so-called \"manosphere,\" in an effort to reach new voters. Now that he's back in office, he may be losing the support of some of those shows' hosts. We discuss the manosphere…",
    "link": "https://www.npr.org/2025/08/05/1256758550/some-manosphere-podcasters-who-backed-trump-are-turning-from-him",
    "timestamp": "2025-08-05T20:36:48Z"
  },
  {
    "title": "Trump Admin Bars Visas From Men Competing In Women’s Sports",
    "description": "An update to U.S. Citizenship and Immigration Services policy will prevent foreign male athletes from entering the United States to compete in women’s sports.",
    "link": "https://dailycaller.com/2025/08/05/trump-admin-bars-visas-men-competing-womens-sports/",
    "timestamp": "2025-08-05T20:33:14Z"
  },
  {
    "title": "Trump Administration Illegally Withheld Science Funding, Watchdog Finds",
    "description": "It’s the fifth time this year that the Government Accountability Office has determined the administration defied Congress on spending.",
    "link": "https://www.huffpost.com/entry/donald-trump-nih-funding_n_68924b87e4b0d3424bc3f6cf",
    "timestamp": "2025-08-05T20:31:20Z"
  },
  {
    "title": "Trump's quest to reduce drug prices is heating up. But will he be able to do it?",
    "description": "Trump is pushing drug companies to lower their prices, but experts cast doubt on how effective this endeavor will prove.",
    "link": "https://www.foxnews.com/politics/trumps-quest-reduce-drug-prices-heating-up-he-able-do-it",
    "timestamp": "2025-08-05T20:31:08Z"
  },
  {
    "title": "News Corp Profit Jumps 28%, Driven by Dow Jones, Digital Real Estate Growth",
    "description": "In reporting earnings, CEO Robert Thomson made a plea to \"cherish\" the value of IP rights against AI\nThe post News Corp Profit Jumps 28%, Driven by Dow Jones, Digital Real Estate Growth appeared first on TheWrap.",
    "link": "https://www.thewrap.com/news-corporation-earnings-q4-2025/",
    "timestamp": "2025-08-05T20:30:27Z"
  },
  {
    "title": "Trump Walks On White House ROOF and Shouts At Reporters In Bizarre Video As Dementia Rumors Erupt — 'He Makes No Sense!'",
    "description": "Donald Trump is everywhere these days, even the roof of the White House as the president was seen 'talking a walk' in a random appearance.",
    "link": "https://radaronline.com/p/trump-white-house-roof-shouts-at-reporters-video-dementia-rumors/",
    "timestamp": "2025-08-05T20:30:00Z"
  },
  {
    "title": "Secret Service In Awe As Trump Walks On Moderately Sloped Roof",
    "description": "WASHINGTON, D.C. — Members of the United States Secret Service were reportedly awestruck today, as they witnessed President Donald Trump performing the seemingly impossible feat of walking casually on a moderately sloped roof.",
    "link": "https://babylonbee.com/news/secret-service-in-awe-as-trump-walks-on-moderately-sloped-roof",
    "timestamp": "2025-08-05T20:29:53Z"
  },
  {
    "title": "What we know about Trump’s Fed chair candidates so far",
    "description": "President Donald Trump said Tuesday that he's whittled down his list of potential Federal Reserve chair candidates to four as he considers a successor to Jerome Powell — a choice that could reset the path of the U.S. economy.",
    "link": "https://www.pbs.org/newshour/politics/what-we-know-about-trumps-fed-chair-candidates-so-far",
    "timestamp": "2025-08-05T20:29:10Z"
  },
  {
    "title": "U.S. Homeland Security Is Now Using ‘South Park’ to Promote ICE’s Website Amid the Show’s Takedown of Donald Trump",
    "description": "The official X account for the United States Department of Homeland Security is using a still from a recent “South Park” trailer to promote the Immigration and Customs Enforcement’s website, which includes application portals to sign up for various jobs under…",
    "link": "https://variety.com/2025/tv/news/homeland-secuirty-south-park-ice-website-1236479064/",
    "timestamp": "2025-08-05T20:28:57Z"
  },
  {
    "title": "Hawaiian Shipping Company Puts Kibosh On EVs Over Fears They’ll Burst Into Flames",
    "description": "A major Hawaiian shipping company halted electric vehicles (EV) deliveries over concerns that their batteries may catch fire, according to multiple reports.",
    "link": "https://dailycaller.com/2025/08/05/hawaiian-shipping-company-kibosh-evs-fears-burst-flames/",
    "timestamp": "2025-08-05T20:28:43Z"
  },
  {
    "title": "Trump threatens to federalize DC, cites lawlessness",
    "description": "United States President Donald Trump said on Tuesday that Washington, DC, is \"totally out of control,\" adding that if the situation continues like that, he will have to use his powers and federalize t...",
    "link": "https://biztoc.com/x/69b742912091ae94",
    "timestamp": "2025-08-05T20:28:30Z"
  },
  {
    "title": "‘The Hypocrisy!’ Jessica Tarlov and Tomi Lahren Tangle Over Gerrymandering on Fox News",
    "description": "Fox News' Jessica Tarlov and Tomi Lahren tangled over the ongoing controversy concerning the GOP's redistricting efforts in Texas.\nThe post ‘The Hypocrisy!’ Jessica Tarlov and Tomi Lahren Tangle Over Gerrymandering on Fox News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/the-hypocrisy-jessica-tarlov-and-tomi-lahren-tangle-over-gerrymandering-on-fox-news/",
    "timestamp": "2025-08-05T20:27:45Z"
  },
  {
    "title": "Bullish Begins Roadshow to Take Crypto Platform Public",
    "description": "Digital asset platform Bullish said it is once again ready to go public after a previous failed attempt. [contact-form-7] The company started the roadshow for its initial public offering (IPO), according to a Monday (Aug. 4) press release. Bullish is targetin…",
    "link": "http://www.pymnts.com/news/ipo/2025/bullish-begins-roadshow-take-crypto-platform-public/",
    "timestamp": "2025-08-05T20:26:47Z"
  },
  {
    "title": "Watch: Rapper Latto, Stacey Abrams Backer, Struggles to Name 45th & 47th U.S. President",
    "description": "Rapper Latto was asked during a recent jewelry store visit how the 45th and 47th president of the United States could have the same parents.\nThe post Watch: Rapper Latto, Stacey Abrams Backer, Struggles to Name 45th & 47th U.S. President appeared first on Bre…",
    "link": "https://www.breitbart.com/entertainment/2025/08/05/watch-rapper-latto-stacey-abrams-backer-struggles-to-name-45th-47th-u-s-president/",
    "timestamp": "2025-08-05T20:26:42Z"
  },
  {
    "title": "The eternal vacuity of reactionary centrism",
    "description": "Thomas Chatterton Williams has always been a particularly representative example of the particular strain of reactionary centrism that Bari Weiss has mobilized to great profit and some measure of assistance to Donald Trump. He has once again exposed his ideas…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/the-eternal-vacuity-of-reactionary-centrism",
    "timestamp": "2025-08-05T20:24:00Z"
  },
  {
    "title": "REPORT: FBI Proves Trump’s DEI Purge Is Effective",
    "description": "At least 18 of the FBI's field office chiefs have been removed under Trump, with nearly half of those ousted being women, minorities, or both.",
    "link": "https://dailycaller.com/2025/08/05/fbi-kash-patel-dei-purge-donald-trump-merit-performance/",
    "timestamp": "2025-08-05T20:23:46Z"
  },
  {
    "title": "John Oliver Didn't Mince His Words Explaining Why He Disagrees With Jay Leno's Advice About Late Night Political Humor: 'I'm Going To Take A Hard Pass'",
    "description": "John Oliver dropped some thoughts.",
    "link": "https://www.cinemablend.com/television/john-oliver-explains-why-he-disagrees-jay-leno-advice-late-night-political-humor",
    "timestamp": "2025-08-05T20:23:37Z"
  },
  {
    "title": "2,300 California ‘Dreamers’ are about to lose their health care coverage",
    "description": "The Trump administration has reversed a rule that allowed undocumented immigrants who were brought to the U.S. as kids to buy health insurance on Affordable Care Act marketplaces.",
    "link": "https://laist.com/news/health/california-dreamers-are-about-to-lose-their-health-care-coverage",
    "timestamp": "2025-08-05T20:23:35Z"
  },
  {
    "title": "US stocks slip following the latest discouraging signal on the economy",
    "description": "U.S. stock indexes slipped following the latest discouraging signal on the U.S. economy",
    "link": "https://abcnews.go.com/US/wireStory/us-stocks-slip-latest-discouraging-signal-economy-124367518",
    "timestamp": "2025-08-05T20:22:28Z"
  },
  {
    "title": "Crucial exemption allows majority of Canadian and Mexican goods to be shipped to US without tariffs",
    "description": "U.S. President Donald Trump raised the tariffs on Canadian goods to 35% last week, but a key carve-out for Canada as well as Mexico shields the vast majority of goods from the punishing duties",
    "link": "https://abcnews.go.com/Business/wireStory/crucial-exemption-allows-majority-canadian-mexican-goods-shipped-124390271",
    "timestamp": "2025-08-05T20:22:28Z"
  },
  {
    "title": "Karoline Leavitt’s net worth stuns as Trump’s flirty praise for her lips sparks uproar",
    "description": "Karoline Leavitt, the youngest White House press secretary, is gaining attention for her impressive $7 million net worth and controversial praise from Donald Trump, who admired her \"face and lips.\" This remark sparked outrage, overshadowing her political and …",
    "link": "https://economictimes.indiatimes.com/news/international/us/karoline-leavitts-net-worth-stuns-as-trumps-flirty-praise-for-her-lips-sparks-uproar/articleshow/123127538.cms",
    "timestamp": "2025-08-05T20:22:08Z"
  },
  {
    "title": "FBI crime report says violent crime decreased by 4.5% in 2024",
    "description": "Statistics released by the FBI on Tuesday show that violent crime decreased overall in the U.S. by 4.5% in 2024",
    "link": "https://www.nbcnews.com/news/us-news/fbi-crime-report-says-violent-crime-decreased-45-2024-rcna223201",
    "timestamp": "2025-08-05T20:21:18Z"
  },
  {
    "title": "US Envoy Witkoff To Visit Moscow On Wednesday",
    "description": "US envoy Steve Witkoff will meet on Wednesday with Russian leadership in Moscow, an American source confirmed, as President Donald Trump's deadline to impose fresh sanctions over Russia's war in Ukraine looms.",
    "link": "https://www.ibtimes.com/us-envoy-witkoff-visit-moscow-wednesday-3780269",
    "timestamp": "2025-08-05T20:21:17Z"
  },
  {
    "title": "Netanyahu Pushes for Full Israeli Occupation of Gaza",
    "description": "Doing so would appease the prime minister’s far-right coalition partners at a time when his grip on power remains fragile.",
    "link": "http://foreignpolicy.com/2025/08/05/israel-gaza-occupation-military-takeover-hamas-hostages-cease-fire/",
    "timestamp": "2025-08-05T20:21:13Z"
  },
  {
    "title": "Trump Claims That Strenuous Farm Work Just Comes 'Naturally' To Migrant Laborers",
    "description": "He said a farmer told him that migrants don't get \"bad backs,\" because \"if they get a bad back, they die.”",
    "link": "https://www.huffpost.com/entry/trump-racist-migrant-laborers-naturally_n_68922611e4b044af87ac5860",
    "timestamp": "2025-08-05T20:20:37Z"
  },
  {
    "title": "US Trade Deficit Plummets To Near 2-Year Low",
    "description": "In June, the U.S. trade deficit dropped to its lowest level in nearly two years, while the trade gap with China narrowed to levels not seen in over two decades.",
    "link": "https://dailycaller.com/2025/08/05/us-trade-deficit-plummets-to-near-2-year-low/",
    "timestamp": "2025-08-05T20:20:36Z"
  },
  {
    "title": "ICE Nazis Kidnap Episcopal Priest's Daughter, Release Her, Probably Are Mad She Didn't Say 'Thank You'",
    "description": "Screaming at these people works.",
    "link": "https://www.wonkette.com/p/ice-nazis-kidnap-episcopal-priests",
    "timestamp": "2025-08-05T20:20:16Z"
  },
  {
    "title": "Tourists from Malawi and Zambia are first to face $15,000 visa bonds in US",
    "description": "Advocates have denounced the bond scheme as a 'legalised shakedown' that profits from vulnerable, lawful travellers.",
    "link": "https://www.aljazeera.com/news/2025/8/5/tourists-from-malawi-and-zambia-are-first-to-face-15000-visa-bonds-in-us",
    "timestamp": "2025-08-05T20:20:07Z"
  },
  {
    "title": "Mayor Adams’ misguided answer to gun violence: Letters to the Editor — Aug. 6, 2025",
    "description": "NY Post readers discuss Mayor Adams’ Post column on gun availability and violence after the Midtown shooting.",
    "link": "https://nypost.com/2025/08/05/opinion/mayor-adams-misguided-answer-to-gun-violence-letters/",
    "timestamp": "2025-08-05T20:20:01Z"
  },
  {
    "title": "State Department announces program requiring some foreign visitors to pay bonds of up to $15,000",
    "description": "The State Department announced Tuesday that the program will first apply to visa applicants from Malawi and Zambia.",
    "link": "https://www.nbcnews.com/politics/national-security/state-department-announces-program-requiring-foreign-visitors-pay-bond-rcna223205",
    "timestamp": "2025-08-05T20:16:11Z"
  },
  {
    "title": "France's first couple didn't 'drop' lawsuit against Candace Owens",
    "description": "In early August 2025, France's President Emmanuel Macron and his wife, Brigitte Macron, announced they were abandoning their 22-count defamation lawsuit against U.S. far-right commentator Candace Owens, who spread the false claim that Brigitte Macron was a tr…",
    "link": "https://www.snopes.com//fact-check/macrons-lawsuit-candace-owens/",
    "timestamp": "2025-08-05T20:16:00Z"
  },
  {
    "title": "Trump Administration Will Not Issue Visas to Foreign Transgender Athletes",
    "description": "The U.S. Citizenship and Immigration Services (USCIS), a Department of Homeland Security (DHS) agency, announced that it will no longer be granting visas to biological males trying to compete in women's sports.\nThe post Trump Administration Will Not Issue Vis…",
    "link": "https://www.breitbart.com/immigration/2025/08/05/trump-administration-will-not-issue-visas-to-foreign-transgender-athletes/",
    "timestamp": "2025-08-05T20:13:00Z"
  },
  {
    "title": "Ghislaine Maxwell doesn’t want Epstein grand jury transcripts released",
    "description": "Maxwell hasn't seen the material herself, her attorneys said — the grand jury process is conducted behind closed doors. But she opposes unsealing what her lawyers described as potentially “hearsay-laden” transcripts of grand jury testimony, which was given in…",
    "link": "https://www.pbs.org/newshour/nation/ghislaine-maxwell-doesnt-want-epstein-grand-jury-transcripts-released",
    "timestamp": "2025-08-05T20:08:50Z"
  },
  {
    "title": "Fox News Blitzes Airwaves With Sydney Sweeney Coverage Amid Epstein Scandal",
    "description": "Fox News mentioned Sydney Sweeney at least 766 times over the course of a week, according to a report from CNN.",
    "link": "http://www.rollingstone.com/politics/politics-news/fox-news-sydney-sweeney-ad-epstein-scandal-1235401026/",
    "timestamp": "2025-08-05T20:08:44Z"
  },
  {
    "title": "Crucial exemption allows majority of Canadian and Mexican goods to be shipped to US without tariffs",
    "description": "U.S. President Donald Trump raised the tariffs on Canadian goods to 35% last week, but a key exemption for Canada and Mexico shields the vast majority of...",
    "link": "https://finance.yahoo.com/news/crucial-exemption-allows-majority-canadian-200834235.html",
    "timestamp": "2025-08-05T20:08:34Z"
  },
  {
    "title": "House subpoenas Clintons, demands full Epstein files from DOJ",
    "description": "The former president and secretary of state were included in a raft of subpoenas related to the \"Epstein files.\"",
    "link": "https://www.salon.com/2025/08/05/house-subpoenas-clintons-demands-full-epstein-files-from-doj/",
    "timestamp": "2025-08-05T20:07:40Z"
  },
  {
    "title": "Brazil's lower house to hold hearing on creating national Bitcoin reserve",
    "description": "If a bill to create a BTC reserves passes in Brazil's House of Representatives, it will require Senate approval before being signed into law or vetoed by the country's president.",
    "link": "https://cointelegraph.com/news/brazil-lower-house-hold-hearing-national-bitcoin-reserve",
    "timestamp": "2025-08-05T20:07:08Z"
  },
  {
    "title": "ICE Office Set Ablaze In Sanctuary State As Attacks Against Agency Rack Up",
    "description": "A \"cowardly rioter\" is suspected of attacking an Immigration and Customs Enforcement (ICE) office over the weekend, according to the Trump administration.",
    "link": "https://dailycaller.com/2025/08/05/wasington-ice-office-set-ablaze-in-attack/",
    "timestamp": "2025-08-05T20:07:02Z"
  },
  {
    "title": "Russia's economy 'stinks,' Trump says, and lower oil prices will stop its war machine",
    "description": "The rift between Moscow and Washington looks set to deepen after U.S. President Donald Trump said Tuesday that Russia's ...",
    "link": "https://biztoc.com/x/d7b1189518bf400d",
    "timestamp": "2025-08-05T20:07:01Z"
  },
  {
    "title": "US government proposes easing some restrictions on drones traveling long distances",
    "description": "A new federal rule would make it easier for companies to use drones over longer distances out of sight of the operator without having to go through a cumbersome waiver process",
    "link": "https://abcnews.go.com/Business/wireStory/us-government-proposes-easing-restrictions-drones-traveling-long-124380163",
    "timestamp": "2025-08-05T20:06:28Z"
  },
  {
    "title": "Wall Street closes lower as new tariffs loom",
    "description": "Major stock indexes in the United States traded lower at the closing bell on Tuesday after President Donald Trump announced a new set of tariffs on chips and pharmaceuticals coming \"next week or so.\" ...",
    "link": "https://biztoc.com/x/cd76ae5327e6f62a",
    "timestamp": "2025-08-05T20:06:15Z"
  },
  {
    "title": "The EU’s deal with Trump could blow up at any time",
    "description": "Poor Ursula von der Leyen. Various European Union leaders heaped abuse on the European Commission President for having capitulated to Donald Trump’s trade demands. The accusations were unfair. Yes, the U.S. President bullied her into accepting 15-per-cent acr…",
    "link": "https://biztoc.com/x/37c70375e953ae5b",
    "timestamp": "2025-08-05T20:06:14Z"
  },
  {
    "title": "Rivian loss bigger than expected on higher costs, lower credit income",
    "description": "RIVIAN-RESULTS/ (PIX):Rivian loss bigger than expected on higher costs, lower credit income",
    "link": "https://www.livemint.com/companies/company-results/rivian-loss-bigger-than-expected-on-higher-costs-lower-credit-income-11754424339780.html",
    "timestamp": "2025-08-05T20:05:39Z"
  },
  {
    "title": "U of L Health delays South End birthing center “indefinitely,” citing Medicaid cuts",
    "description": "The Birthing Place at Mary & Elizabeth Hospital would have returned labor and delivery services to southwest Louisville for the first time since the 1970’s.",
    "link": "https://www.lpm.org/news/2025-08-05/u-of-l-health-delays-south-end-birthing-center-indefinitely-citing-medicaid-cuts",
    "timestamp": "2025-08-05T20:05:21Z"
  },
  {
    "title": "Ghislaine Maxwell Fights To Keep Epstein Grand Jury Secrets Buried",
    "description": "Ghislaine Maxwell told a federal judge she’s opposed to the Department of Justice's (DOJ) push to make grand jury transcripts from her case public.",
    "link": "https://dailycaller.com/2025/08/05/ghislaine-maxwell-jeffrey-epstein-todd-blanche-department-of-justice-grand-jury/",
    "timestamp": "2025-08-05T20:05:10Z"
  },
  {
    "title": "Meet the 30-Year-Old Far-Right Provocateur Nominated by Trump to Investigate Jack Smith (John Harwood/Zeteo)",
    "description": "John Harwood / Zeteo:\nMeet the 30-Year-Old Far-Right Provocateur Nominated by Trump to Investigate Jack Smith  —  Paul Ingrassia, who has defended Nick Fuentes and Andrew Tate and was only admitted to the bar last year, is Donald Trump's nominee to run the al…",
    "link": "https://www.memeorandum.com/250805/p88",
    "timestamp": "2025-08-05T20:05:01Z"
  },
  {
    "title": "What the Hell Was Trump Doing on the White House Roof?",
    "description": "Donald Trump had an interesting morning on Tuesday. At 8 a.m., he took to the airwaves, where he spun a web of lies to justify firing the Bureau of Labor Statistics’ commissioner for a report indicating a fragile labor market.He then spoke to Ukrainian Presid…",
    "link": "https://newrepublic.com/post/198837/trump-white-house-roof",
    "timestamp": "2025-08-05T20:04:52Z"
  },
  {
    "title": "Trump administration to curtail veterans’ abortion rights at Veterans Affairs hospitals",
    "description": "The Biden administration expanded reproductive rights options at VA hospitals. For veterans, the Trump administration is now trying to roll back the clock.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-administration-curtail-veterans-abortion-rights-veterans-affairs-rcna223227",
    "timestamp": "2025-08-05T20:04:18Z"
  },
  {
    "title": "White House Orders NASA to Destroy Important Satellite",
    "description": "The White House has instructed NASA employees to terminate two major, climate change-focused satellite missions.As NPR reports, Trump officials reached out to the space agency to draw up plans for terminating the two missions, called the Orbiting Carbon Obser…",
    "link": "https://slashdot.org/submission/17338548/white-house-orders-nasa-to-destroy-important-satellite",
    "timestamp": "2025-08-05T20:03:47Z"
  },
  {
    "title": "Texas AG’s Ultimatum to Missing Democrats: Return or Risk Ouster",
    "description": "Texas state House Democrats again refused to return for state legislative business Tuesday, prompting Republicans to issue an ultimatum—come back to the Capitol by Friday... Read More\nThe post Texas AG’s Ultimatum to Missing Democrats: Return or Risk Ouster a…",
    "link": "https://www.dailysignal.com/2025/08/05/texas-ags-ultimatum-to-missing-democrats-return-or-risk-ouster/",
    "timestamp": "2025-08-05T20:03:29Z"
  },
  {
    "title": "How a Texas showdown could reshape Congress - and Trump's presidency",
    "description": "A dramatic redistricting fight could spread to other states before next year's crucial midterm elections.",
    "link": "https://www.bbc.com/news/articles/cx2q7egqrpdo",
    "timestamp": "2025-08-05T20:03:04Z"
  },
  {
    "title": "Celebrities Who Are Registered Republicans or Those Who Support Donald Trump & MAGA",
    "description": "So many celebrities seem to endorse Democratic candidates for President, however, you may not realize that there are some stars who prefer to vote Republican. We’ve gathered up the list of celebrities who are more on the conservative end of the spectrum, incl…",
    "link": "https://www.justjared.com/2025/08/05/celebrities-who-are-registered-republicans-or-those-who-support-donald-trump-maga/",
    "timestamp": "2025-08-05T20:02:59Z"
  },
  {
    "title": "Amgen quarterly results beat Wall Street estimates",
    "description": "(Reuters) -Amgen on Tuesday posted quarterly financial results that beat Wall Street expectations as a 9% increase in product sales offset higher operating...",
    "link": "https://finance.yahoo.com/news/amgen-quarterly-results-beat-wall-200251393.html",
    "timestamp": "2025-08-05T20:02:51Z"
  },
  {
    "title": "Oil Sinks as Russia Mulls Truce Deal",
    "description": "Oil slid for a fourth day as Russia considered pausing airstrikes to avoid new US sanctions.",
    "link": "https://www.rigzone.com/news/wire/oil_sinks_as_russia_mulls_truce_deal-05-aug-2025-181383-article/",
    "timestamp": "2025-08-05T20:01:41Z"
  },
  {
    "title": "Fed Rate Cut Now Would Be ‘Playing With Fire’ Amid Risk of Credibility Loss, Says Former Treasury Secretary Larry Summers",
    "description": "Former U.S. Treasury Secretary Larry Summers believes there is no urgent need for the Federal Reserve to cut interest rates. In a new Bloomberg interview, Summers says instituting a rate cut now would be akin to “playing with fire.” According to the former Tr…",
    "link": "https://dailyhodl.com/2025/08/05/fed-rate-cut-now-would-be-playing-with-fire-amid-risk-of-credibility-loss-says-former-treasury-secretary-larry-summers/",
    "timestamp": "2025-08-05T20:00:37Z"
  },
  {
    "title": "Howard Stern Show 'to be canceled'... | | 20 years on SIRIUSXM...",
    "description": "THE ICONIC Howard Stern Show on SiriusXM is set to be canceled after a stunning 20-year run, sources exclusively told The U.S. Sun.  Stern, 71, who has had a mega-bucks contract for decades at…",
    "link": "https://www.the-sun.com/entertainment/14910416/howard-stern-show-canceled-contract-up/",
    "timestamp": "2025-08-05T20:00:03Z"
  },
  {
    "title": "Bill and Hillary Clinton ordered to give evidence in Jeffrey Epstein investigation",
    "description": "Ex-president Bill Clinton and his wife Hillary are among ten high-profile individuals who have been subpoenaed in relation to Epstein's 'horrific crimes'.",
    "link": "https://www.ladbible.com/news/us-news/jeffrey-epstein-bill-hillary-clinton-subpoena-committee-246073-20250805",
    "timestamp": "2025-08-05T19:59:43Z"
  },
  {
    "title": "Trump Administration Weighs Release Of Ghislaine Maxwell's DOJ Interview: Reports",
    "description": "The alleged debate over releasing them comes after Maxwell was transferred to a minimum-security prison without explanation.",
    "link": "https://www.huffpost.com/entry/ghislaine-maxwell-interview-audio-recordings_n_689234bae4b0d3424bc3ef62",
    "timestamp": "2025-08-05T19:58:19Z"
  },
  {
    "title": "White House Reportedly Taking Aim At Banks Allegedly Cancelling Conservatives’ Accounts",
    "description": "The White House is preparing an executive order targeting banks that discriminate against customers based on political views, The Wall Street Journal reported.",
    "link": "https://dailycaller.com/2025/08/05/white-house-reportedly-taking-aim-banks-allegedly-cancelling-conservative-accounts/",
    "timestamp": "2025-08-05T19:57:33Z"
  },
  {
    "title": "What $4 trillion in debt from Trump's spending measure could mean for future generations",
    "description": "What $4 trillion in debt from Trump's spending measure could mean for future generationsgo.com",
    "link": "https://abcnews.go.com/Business/4-trillion-debt-trumps-spending-measure-future-generations/story?id=124372328",
    "timestamp": "2025-08-05T19:56:00Z"
  },
  {
    "title": "US demands $15,000 deposit for visa applicants from two countries",
    "description": "The 12-month pilot programme targeting Malawi and Zamia aims to curb visa overstays, the US says.",
    "link": "https://www.bbc.com/news/articles/cp9415d53xko?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-05T19:55:41Z"
  },
  {
    "title": "Billionaire Ray Dalio Says Government Money Printing Could Lead to New Gold-Backed Currency Era",
    "description": "Bridgewater Associates founder Ray Dalio is warning that the US may be forced to go back to a gold standard at some point in the future. In a post on the social media platform X, the billionaire says that historically, currencies go through cycles of devaluat…",
    "link": "https://dailyhodl.com/2025/08/05/billionaire-ray-dalio-says-government-money-printing-could-lead-to-new-gold-backed-currency-era/",
    "timestamp": "2025-08-05T19:55:17Z"
  },
  {
    "title": "Prediction markets see Hassett and Warsh as Fed chair frontrunners as Trump talks up the 'Kevins'",
    "description": "President Donald Trump's fresh comments on potential candidates to replace Jerome Powell as the next chair of the Federal Reserve sparked a wave of speculation on prediction markets.\nNational Economic Council Director Kevin Hassett, former Fed Governor Kevin …",
    "link": "https://biztoc.com/x/3b6f9f01fb492ea4",
    "timestamp": "2025-08-05T19:55:09Z"
  },
  {
    "title": "India accuses EU and US of ‘indulging’ in trade with Russia",
    "description": "India has accused the EU and US of “indulging” in trade with Russia after Donald Trump criticised New Delhi for propping up Vladimir Putin’s war machine by buying its oil.The country’s foreign ministry said it was forced to buy “predictable and affordable” Ru…",
    "link": "https://freerepublic.com/focus/f-news/4332871/posts",
    "timestamp": "2025-08-05T19:53:23Z"
  },
  {
    "title": "NASA aiming to build nuclear reactor on the moon by 2030",
    "description": "NASA is accelerating its plans for a nuclear reactor on the moon, aiming to establish such a power outpost by 2030, according to Politico.",
    "link": "https://www.space.com/astronomy/moon/nasa-aiming-to-build-nuclear-reactor-on-the-moon-by-2030",
    "timestamp": "2025-08-05T19:48:47Z"
  },
  {
    "title": "How Trump Uses Oil As An Economic Weapon In The Ukraine-Russia War",
    "description": "How Donald Trump is leveraging the U.S. economy to use purchases of Russian oil by China and India to damage Russia's war effort.",
    "link": "https://www.forbes.com/sites/mattrandolph/2025/08/05/how-trump-uses-oil-as-an-economic-weapon-in-the-ukraine-russia-war/",
    "timestamp": "2025-08-05T19:47:26Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/todays-headlines-news-fix-2-6783279-Aug2025/",
    "timestamp": "2025-08-05T19:45:39Z"
  },
  {
    "title": "Hoosier Representative? Indiana GOP Wants It to Be Another Republican.",
    "description": "Indiana Republicans are looking to alter the boundaries of the Hoosier State’s congressional districts to help Republicans in the 2026 midterms, and to that end,... Read More\nThe post Hoosier Representative? Indiana GOP Wants It to Be Another Republican. appe…",
    "link": "https://www.dailysignal.com/2025/08/05/indiana-potentially-join-fray-redistricting/",
    "timestamp": "2025-08-05T19:45:00Z"
  },
  {
    "title": "What’s known and not yet known about the Justice Department’s scrutiny of Trump-Russia probe origins",
    "description": "This move reopens a highly scrutinized chapter in American history.",
    "link": "https://www.bostonherald.com/2025/08/05/trump-russia-probe-origins/",
    "timestamp": "2025-08-05T19:44:05Z"
  }
]