[
  {
    "title": "Trump Kicks Zelensky Out of White House, Cancels Press Conference After Ukrainian’s Unhinged Oval Office Outburst",
    "description": "President Donald Trump kicked Ukraine President Volodymyr Zelensky out of the White House on Friday after Zelensky made \"disrespectful\" remarks in front of the media ahead of planned private talks and the expected signing of the much-discussed minerals deal. …",
    "link": "https://www.breitbart.com/politics/2025/02/28/trump-kicks-zelensky-out-white-house-cancels-press-conference-after-ukrainians-unhinged-oval-office-outburst/",
    "timestamp": "2025-02-28T20:48:03Z"
  },
  {
    "title": "FIFA boss defends 'critical' yet controversial alliance with Trump",
    "description": "FIFA president Gianni Infantino has defended his controversial alliance with Donald Trump as \"critical\" for the success of the World Cup.",
    "link": "https://news.sky.com/story/fifa-president-gianni-infantino-defends-critical-alliance-with-donald-trump-13318990",
    "timestamp": "2025-02-28T20:48:00Z"
  },
  {
    "title": "Bessent Calls Zelensky’s White House Outburst 'One of The Greatest Diplomatic Own Goals in History'",
    "description": "“It’s very difficult to do an economic deal with a leader who doesn’t want to do a peace deal,” Bessent said in an interview after Zelensky's outburst brought a White House meeting to an abrupt halt.\nThe post Bessent Calls Zelensky’s White House Outburst ‘One…",
    "link": "https://www.breitbart.com/economy/2025/02/28/bessent-zelensky-own-goal/",
    "timestamp": "2025-02-28T20:44:14Z"
  },
  {
    "title": "Did Trump shut down U.K. PM's response about Canada? Here's what happened",
    "description": "Starmer was asked if King Charles III expressed any concern over Trump's 'apparent desire to remove one of (the king's) realms from his control'",
    "link": "https://nationalpost.com/news/canada/trump-starmer-canada-heres-what-happened",
    "timestamp": "2025-02-28T20:44:14Z"
  },
  {
    "title": "As Trump Plans to Double Tariffs on China, Twisted X Pledges to Not Raise Its Prices",
    "description": "Texas shoe company Twisted X has said it will not raise prices on its boots despite President Trump's increased tariffs on imports from China.",
    "link": "http://footwearnews.com/business/business-news/twisted-x-not-raise-prices-despite-trump-tariffs-1234775884/",
    "timestamp": "2025-02-28T20:43:59Z"
  },
  {
    "title": "Euro falls to more than two-week low after Trump, Zelenskiy meeting",
    "description": "NEW YORK :The euro dropped on Friday, after a meeting between Ukrainian President Volodymyr Zelenskiy and U.S. President Donald Trump went up in flames, dashing hopes any peace deal could be reached soon in the war with Russia. Trump and Zelenskiy traded verb…",
    "link": "https://www.channelnewsasia.com/business/euro-falls-more-two-week-low-after-trump-zelenskiy-meeting-4966366",
    "timestamp": "2025-02-28T20:43:18Z"
  },
  {
    "title": "The Ukrainian gratitude that JD Vance has apparently failed to notice",
    "description": "JD Vance suggested that Ukraine's Volodymyr Zelenskyy has never thanked the United States for its support. That’s demonstrably ridiculous.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ukrainian-gratitude-jd-vance-apparently-failed-notice-rcna194285",
    "timestamp": "2025-02-28T20:43:09Z"
  },
  {
    "title": "Afro Fashion Association Keeps DEI Conversation in Fashion Rolling",
    "description": "The organization held a breakfast networking event during Milan Fashion Week to spotlight 10 of its talents.",
    "link": "http://wwd.com/sustainability/social-impact/afro-fashion-association-dei-event-milan-fashion-week-1237007993/",
    "timestamp": "2025-02-28T20:42:11Z"
  },
  {
    "title": "‘Fantastic Choice’: Heritage Foundation Backs Colby for Defense Post",
    "description": "The Heritage Foundation gave a resounding endorsement Thursday to Elbridge Colby, President Donald Trump’s nominee to be undersecretary of defense for policy.  In a post... Read More\nThe post ‘Fantastic Choice’: Heritage Foundation Backs Colby for Defense Pos…",
    "link": "https://www.dailysignal.com/2025/02/28/fantastic-choice-heritage-foundation-backs-colby-for-defense-post/",
    "timestamp": "2025-02-28T20:41:22Z"
  },
  {
    "title": "‘So Depressing To Watch’: MSNBC Guest Chews Up Three Minutes Ranting About Vance Calling Zelenskyy On Carpet",
    "description": "Michael McFaul spent three minutes bemoaning an Oval Office meeting where Donald Trump and J.D. Vance clashed with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://dailycaller.com/2025/02/28/msnbc-guest-three-minutes-rant-vance-zelenskyy/",
    "timestamp": "2025-02-28T20:41:11Z"
  },
  {
    "title": "Why EVs and Renewable Energy Stocks Crashed This Week",
    "description": "Despite Tesla CEO Elon Musk being close to President Donald Trump, which was supposed to be bullish for electric vehicles (EVs), the market is selling off most EV and renewable energy stocks this week. The biggest reason is the government beginning to make mo…",
    "link": "https://biztoc.com/x/c7ea9baf1e41e50d",
    "timestamp": "2025-02-28T20:40:36Z"
  },
  {
    "title": "Doug Ford says 'count me in' for new solution to mitigate tariff threats",
    "description": "Doug Ford made his stand against Donald Trump's tariffs a cornerstone of his platform as he sought — and won — re-election as premier, and among other steps the province plans to take if and when the levies come into effect, it seems the Ontario leader is on …",
    "link": "https://www.blogto.com/city/2025/02/doug-ford-solution-mitigate-tariff-threats/",
    "timestamp": "2025-02-28T20:40:24Z"
  },
  {
    "title": "Trump and Vance attack Zelenskyy in remarkable Oval Office exchange (Eli Stokols/Politico)",
    "description": "Eli Stokols / Politico:\nTrump and Vance attack Zelenskyy in remarkable Oval Office exchange  —  The president and vice president each had harsh words for the Ukrainian president.  —  Ukrainian President Volodymyr Zelenskyy came to Washington optimistic that s…",
    "link": "https://www.memeorandum.com/250228/p103",
    "timestamp": "2025-02-28T20:40:01Z"
  },
  {
    "title": "Read Trump and Zelensky’s Fiery Oval Office Exchange",
    "description": "The meeting caps weeks of tense relations between Kyiv and Washington as they wrangle a deal.",
    "link": "https://foreignpolicy.com/2025/02/28/trump-zelensky-meeting-transcript-full-text-video-oval-office/",
    "timestamp": "2025-02-28T20:36:55Z"
  },
  {
    "title": "Hungary to ban LGBTQ parades – Orban",
    "description": "The Hungarian prime minister had previously suggested that the organizers of the Pride event “should not bother” to prepare for it Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613484-hungary-bans-gay-parade-orban/",
    "timestamp": "2025-02-28T20:35:56Z"
  },
  {
    "title": "Will Spanish no longer be spoken? Trump decrees English as the official language of USA",
    "description": "According to the White House, English as the official language of USA fosters cohesion and helps newcomers participate in traditions",
    "link": "https://www.merca20.com/will-spanish-no-longer-be-spoken-trump-decrees-english-as-the-official-language-of-usa/",
    "timestamp": "2025-02-28T20:35:02Z"
  },
  {
    "title": "GOP-led committee launches probe to root out 'political' hires (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nGOP-led committee launches probe to root out ‘political’ hires  —  As President Donald Trump and Elon Musk move to fire broad swaths of the federal workforce, the top Republican on the House Oversight and Government Reform Committee i…",
    "link": "https://www.memeorandum.com/250228/p102",
    "timestamp": "2025-02-28T20:35:00Z"
  },
  {
    "title": "‘Trump Gaza’ AI video creators say they don’t want to be the president’s ‘propaganda machine’",
    "description": "The creators of a controversial AI-generated video shared by President Donald Trump on social media say they never meant to become a “propaganda machine,” and that their video, which depicts an outlandish vision of Gaza featuring bearded dancers in bikinis an…",
    "link": "https://www.nbcnews.com/tech/internet/trump-gaza-ai-video-propaganda-machine-rcna194097",
    "timestamp": "2025-02-28T20:32:30Z"
  },
  {
    "title": "Floyd Mayweather's bold Trump endorsement triggers Elon Musk support and 50 Cent ridicule",
    "description": "Floyd Mayweather has never been one to hold back his opinions, and his latest remarks about former President Donald Trump have ignited a storm of reactions. \n\nThe undefeated boxing",
    "link": "https://www.marca.com/en/boxing/2025/02/28/67c21451ca4741cf3e8b45be.html",
    "timestamp": "2025-02-28T20:31:02Z"
  },
  {
    "title": "What Everyone’s Missing In The Bezos-WaPo Meltdown",
    "description": "Bezos announced an overhaul to WaPo Opinion, and although conservatives cheered on the change and liberals lamented it, everyone is missing a crucial point.",
    "link": "https://dailycaller.com/2025/02/28/washington-post-jeff-bezos-opinion-section-newsroom-bias/",
    "timestamp": "2025-02-28T20:31:01Z"
  },
  {
    "title": "The Irish Times view on Europe’s reaction to Trump: the EU must protect its own values",
    "description": "The uncertainties which Europe is now dealing with were starkly illustrated by the angry meeting in the White House yesterday evening between US president Donald Trump and Ukrainian president Volodymyr Zelenskiy",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/02/28/the-irish-times-view-on-europes-reaction-to-trump-the-eu-must-protect-its-own-value/",
    "timestamp": "2025-02-28T20:30:00Z"
  },
  {
    "title": "Screaming Match Erupts As Donald Trump And JD Vance Berate President Zelensky (Aaron Parnas/MeidasTouch News)",
    "description": "Aaron Parnas / MeidasTouch News:\nScreaming Match Erupts As Donald Trump And JD Vance Berate President Zelensky  —  Is this how we treat our allies?  —  This afternoon, a screaming match erupted in the Oval Office as Donald Trump and JD Vance berated Ukrainian…",
    "link": "https://www.memeorandum.com/250228/p101",
    "timestamp": "2025-02-28T20:30:00Z"
  },
  {
    "title": "Lawmakers in US Congress react to Zelenskiy-Trump Oval Office clash",
    "description": "(Reuters) - Ukrainian President Volodymyr Zelenskiy and U.S. President Donald Trump traded blows at a White House meeting that ended in disaster on Friday, prompting an outpouring of reaction from members of Congress and other American public figures. Read fu…",
    "link": "https://www.thestar.com.my/news/world/2025/03/01/lawmakers-in-us-congress-react-to-zelenskiy-trump-oval-office-clash",
    "timestamp": "2025-02-28T20:30:00Z"
  },
  {
    "title": "Bitcoin’s ‘Trump trade’ is over — Traders shift hope to Fed rate cuts, expanding global liquidity",
    "description": "The pre-and-post-election Trump trade sent Bitcoin to new highs, but the jig is up. Traders now shift their hope to the resumption of QE and expanding global liquidity.",
    "link": "https://cointelegraph.com/news/bitcoin-trump-trade-is-over-will-fed-rate-cuts-and-m2-expansion-help",
    "timestamp": "2025-02-28T20:30:00Z"
  },
  {
    "title": "Crypto Biz: Weeks like this will rattle your conviction",
    "description": "A $1.4 billion Bybit hack, efforts to \"Kill Tether\" and a Bitcoin price crash headline a rough week for the crypto markets.",
    "link": "https://cointelegraph.com/news/crypto-biz-weeks-like-this-will-rattle-your-conviction",
    "timestamp": "2025-02-28T20:30:00Z"
  },
  {
    "title": "WATCH: Zelenskyy ‘needs to resign’ or ‘change’ after tense meeting with Trump, Sen. Lindsay Graham says",
    "description": "Graham called the meeting a “complete, utter disaster” and said he’s “never been more proud” of President Donald Trump.",
    "link": "https://biztoc.com/x/e902eb1638b536ad",
    "timestamp": "2025-02-28T20:29:53Z"
  },
  {
    "title": "Zelensky speaks to Macron, Rutte after Trump row",
    "description": "Ukrainian President Volodymyr Zelensky spoke with his French counterpart Emmanuel Macron and NATO Secretary General Mark Rutte following his falling out with United States President Donald Trump durin...",
    "link": "https://biztoc.com/x/d23bb42ec64976da",
    "timestamp": "2025-02-28T20:29:49Z"
  },
  {
    "title": "Trump's tariff threats rattle Taiwan chipmakers, weigh on TSMC stock",
    "description": "TAIPEI -- Taiwan's chip industry faces growing pressure from U.S. President Donald Trump to invest in America, with the resulting uncertainty pushing down shares of Taiwan Semiconductor Manufacturing Co.\n\"Taiwan is willing and able to work with global democra…",
    "link": "https://biztoc.com/x/5db42f6b3ef4498f",
    "timestamp": "2025-02-28T20:29:35Z"
  },
  {
    "title": "‘You Should Be Grateful’: Lindsey Graham Turns on Zelensky After Trump Kicks Him Out of White House",
    "description": "Senator Lindsey Graham (R-SC) bashed Ukraine President Volodymyr Zelensky for his explosive exchange with President Donald Trump on Friday. \nThe post ‘You Should Be Grateful’: Lindsey Graham Turns on Zelensky After Trump Kicks Him Out of White House first app…",
    "link": "https://www.mediaite.com/tv/you-should-be-grateful-lindsey-graham-turns-on-zelensky-after-trump-kicks-him-out-of-white-house/",
    "timestamp": "2025-02-28T20:29:29Z"
  },
  {
    "title": "UK's position explained after Donald Trump warned Zelenskyy he's 'gambling with WW3' in explosive White House argument",
    "description": "Brits have been left wondering where the UK stands after tempers flared between Donald Trump and Volodymyr Zelenskyy over Russia's invasion of Ukraine.",
    "link": "https://www.ladbible.com/news/uk-news/donald-trump-president-zelenskyy-uk-position-explained-keir-starmer-750560-20250228",
    "timestamp": "2025-02-28T20:28:33Z"
  },
  {
    "title": "James Cameron Says Trump Admin Is Destroying The U.S.",
    "description": "The Oscar-winning filmmaker had some choice words for the MAGA leader's second administration.",
    "link": "https://www.huffpost.com/entry/james-cameron-says-trump-admin-destroying-us-hollowing-it-out-as-fast-as-they-can_n_67c1cde2e4b0bf548640652b",
    "timestamp": "2025-02-28T20:26:49Z"
  },
  {
    "title": "SC Congressman Wants Money With Donald Trump's Portrait",
    "description": "Federal law prohibits any living person from being depicted on US currency, but Representative Joe Wilson doesn't seem to care.",
    "link": "https://littlethings.com/entertainment/sc-congressman-wants-to-print-new-money-with-donald-trumps-portrait",
    "timestamp": "2025-02-28T20:26:10Z"
  },
  {
    "title": "In Oval Office Temper Tantrum, Zelensky Blows Up Peace Talks",
    "description": "Trump and Vance told Zelensky he is in no position to make demands of the U.S. government after the Ukrainian leader attempted to strong-arm the United States.",
    "link": "https://thefederalist.com/2025/02/28/in-oval-office-temper-tantrum-zelensky-blows-up-peace-talks/",
    "timestamp": "2025-02-28T20:26:04Z"
  },
  {
    "title": "Joe Biden was brutally forced out of re-election; the approach was like a ‘firing squad’, says Karine Jean-Pierre, former White House press secretary",
    "description": "Former White House press secretary Karine Jean-Pierre has spoken out about Joe Biden's abrupt withdrawal from the 2024 presidential race. She referred to the pressure campaign against him as a \"firing squad.\" Jean-Pierre also warned that the Donald Trump admi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/joe-biden-was-brutally-forced-out-of-re-election-the-approach-was-like-a-firing-squad-says-karine-jean-pierre-former-white-house-press-secretary/articleshow/118637192.cms",
    "timestamp": "2025-02-28T20:25:32Z"
  },
  {
    "title": "Republicans Cheer on Trump as He Bullies Zelenskiy out of White House",
    "description": "Republicans in Congress are cheering on Donald Trump’s disastrous meeting with Ukrainian President Volodymyr Zelenskiy Friday, which ended with a hasty exit from Zelenskiy, a canceled press conference, and no mineral rights deal.\r\nZelenskiy was reportedly kic…",
    "link": "https://newrepublic.com/post/192171/republican-reaction-trump-vance-zelenskiy-shouting-match-white-house",
    "timestamp": "2025-02-28T20:25:32Z"
  },
  {
    "title": "Are egg producers inflating prices during outbreak to boost profits?",
    "description": "Egg producers blame the ongoing bird flu outbreak for driving prices up to record highs. But some believe companies are taking advantage.",
    "link": "https://www.wishtv.com/news/business/are-egg-producers-inflating-prices-during-the-bird-flu-outbreak-to-boost-profits/",
    "timestamp": "2025-02-28T20:25:16Z"
  },
  {
    "title": "Trump’s VOA Pick Kari Lake Also Named Adviser to Global Media Agency",
    "description": "Kari Lake, who is President Donald Trump’s choice to run the Voice of America, will become a senior adviser to the U.S. Agency for Global... Read More\nThe post Trump’s VOA Pick Kari Lake Also Named Adviser to Global Media Agency appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/02/28/trumps-voa-pick-kari-lake-named-adviser-global-media-agency/",
    "timestamp": "2025-02-28T20:25:03Z"
  },
  {
    "title": "Key takeaways from the fiery White House meeting with Trump and Zelenskyy",
    "description": "A news conference in the Oval Office has erupted into naked tension, as Trump yells at Zelenskyy to be ‘thankful’ to US.",
    "link": "https://www.aljazeera.com/news/2025/2/28/key-takeaways-from-the-fiery-white-house-meeting-with-trump-and-zelenskyy",
    "timestamp": "2025-02-28T20:24:36Z"
  },
  {
    "title": "Why Canadian coffee shops are renaming Americanos to ‘Canadianos’",
    "description": "Some Canadian coffee shops are renaming Americanos to \"Canadianos\" as an act of defiance against President Donald Trump's proposed tariffs on Canada.",
    "link": "https://www.today.com/food/news/canadian-coffee-shops-rename-americanos-to-canadianos-rcna193910",
    "timestamp": "2025-02-28T20:24:21Z"
  },
  {
    "title": "WATCH: Zelenskyy ‘needs to resign’ or ‘change’ after tense meeting with Trump, Sen. Lindsay Graham says",
    "description": "Graham called the meeting a “complete, utter disaster” and said he’s “never been more proud” of President Donald Trump.",
    "link": "https://www.pbs.org/newshour/politics/watch-zelenskyy-needs-to-resign-or-change-after-tense-meeting-with-trump-sen-lindsay-graham-says",
    "timestamp": "2025-02-28T20:22:41Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Feb. 22: Germany votes, Britain ups defense spending, and Bolivia inaugurates a new plant.",
    "link": "https://foreignpolicy.com/2025/02/28/foreign-policy-news-quiz-germany-election-afd-starmer-defense-spending-israel-gaza-plan-trump-taliban/",
    "timestamp": "2025-02-28T20:22:22Z"
  },
  {
    "title": "Trump Links Gaza",
    "description": "Like any self-respecting don of a powerful crime family, Donald Trump – AKA “Don the Con” – always gets a taste of any action going down on his territory. And that territory, as recent events have made clear, knows no borders. (I mean, except for the southwes…",
    "link": "https://www.ipsnews.net/2025/02/trump-links-gaza/",
    "timestamp": "2025-02-28T20:22:04Z"
  },
  {
    "title": "Liberal Journo Earnestly Compares Zelenskyy To Jesus Christ",
    "description": "The Daily Beast columnist Julia Davis compared Ukrainian President Volodymyr Zelenskyy to Jesus Christ in a Friday social media post.",
    "link": "https://dailycaller.com/2025/02/28/columnist-compares-zelensky-jesus-christ/",
    "timestamp": "2025-02-28T20:20:49Z"
  },
  {
    "title": "The Perils of a Reality TV Presidency",
    "description": "The Trump-Zelensky shouting match is a reminder that international diplomacy was never meant to be carried out in front of billions of eyes.",
    "link": "https://foreignpolicy.com/2025/02/28/trump-zelensky-television-presidency-diplomacy/",
    "timestamp": "2025-02-28T20:20:18Z"
  },
  {
    "title": "Trump to sign executive order making English the official US language (Reuters)",
    "description": "Reuters:\nTrump to sign executive order making English the official US language  —  The order marks the first time the country has ever had a national language.  —  President Donald Trump attends a press conference with British Prime Minister Keir Starmer (not…",
    "link": "https://www.memeorandum.com/250228/p100",
    "timestamp": "2025-02-28T20:20:01Z"
  },
  {
    "title": "It Isn’t A ‘Crisis’ For Trump To Fire Flag Officers, It’s A Crisis To Think He Can’t",
    "description": "Trump's decision to fire flag officers isn’t a break with American law and tradition. The warning about a crisis is the crisis.",
    "link": "https://thefederalist.com/2025/02/28/it-isnt-a-crisis-for-trump-to-fire-flag-officers-its-a-crisis-to-think-he-cant/",
    "timestamp": "2025-02-28T20:19:04Z"
  },
  {
    "title": "Trump and Musk’s Social Security ‘chainsaw massacre’ is slashing all the wrong things",
    "description": "Donald Trump’s decision to apply his chainsaw to the Social Security Administration will do nothing to shore up the program’s finances — or help balance the federal budget.",
    "link": "https://biztoc.com/x/6aac1479d24e9425",
    "timestamp": "2025-02-28T20:18:56Z"
  },
  {
    "title": "WATCH: Zelenskyy departs White House after Trump and Vance chastise him in tense meeting",
    "description": "Ukraine's leader left the White House shortly after President Donald Trump shouted at him, showing open disdain.",
    "link": "https://biztoc.com/x/8ebe631671b889c9",
    "timestamp": "2025-02-28T20:18:23Z"
  },
  {
    "title": "Trump company files trademarks for branded metaverse, NFT marketplace",
    "description": "A Trump organization has filed trademark applications for the word \"TRUMP\" in connection with a metaverse and NFT marketplace based on the President's brand.",
    "link": "https://cointelegraph.com/news/trump-company-files-trademarks-branded-metaverse-nft-marketplace",
    "timestamp": "2025-02-28T20:18:16Z"
  },
  {
    "title": "Kremlin Gloats After Trump, Vance Oval Office Ukraine Meltdown",
    "description": "In the wake of the bizarre confrontation between Trump and Ukraine's president, democratic leaders across the globe are backing Zelensky",
    "link": "http://www.rollingstone.com/politics/politics-news/leaders-condemn-trump-clash-with-zelenzky-kremlin-happy-1235283958/",
    "timestamp": "2025-02-28T20:16:07Z"
  },
  {
    "title": "'A proper slap down': Russian, world leaders respond to Trump, Zelensky’s tense exchange",
    "description": "France's Macron, after Trump-Zelensky clash, says \"we must respect those who have been fighting since the beginning\"",
    "link": "https://www.jpost.com/international/article-844178",
    "timestamp": "2025-02-28T20:16:01Z"
  },
  {
    "title": "How Trump’s planned ‘gold card’ visa would work",
    "description": "The program would replace an existing program that offers U.S. visas to investors who spend about $1 million on a company that employs at least 10 people, echoing  similar “golden visa ” programs in countries such as Canada, New Zealand, Malta.",
    "link": "https://www.pbs.org/newshour/politics/how-trumps-planned-gold-card-visa-would-work",
    "timestamp": "2025-02-28T20:14:52Z"
  },
  {
    "title": "Untangling Jeffrey Epstein's Docs: Trump Family Named in Contact List",
    "description": "Attorney General Pamela Bondi released the first phase of Jeffrey Epstein’s classified documents Feb. 27, and some of President Donald Trump’s family were named in a contact list amid the 200 pages.",
    "link": "https://www.eonline.com/news/1414122/jeffrey-epstein-case-donald-trumps-family-named-in-contact-list",
    "timestamp": "2025-02-28T20:14:00Z"
  },
  {
    "title": "Trump cuts short Zelensky meeting after Oval Office clash",
    "description": "US President Donald Trump cut short a meeting with Volodymyr Zelensky on Friday and said the Ukrainian leader is “not ready” for peace with Russia in an extraordinary meltdown in the Oval Office that threw question marks over chances for a truce. Zelensky was…",
    "link": "https://punchng.com/trump-cuts-short-zelensky-meeting-after-oval-office-clash/",
    "timestamp": "2025-02-28T20:13:20Z"
  },
  {
    "title": "Trump to Zelensky: Obama Gave You Sheets, I Gave You Javelins",
    "description": "During his heated Oval Office press conference on Friday with Ukrainian President Volodymyr Zelensky, President Donald Trump told the Ukrainian leader he should be grateful because Trump gave him effective weapons to fight back against the Russian invasion, w…",
    "link": "https://www.breitbart.com/europe/2025/02/28/trump-to-zelensky-obama-gave-you-sheets-i-gave-you-javelins/",
    "timestamp": "2025-02-28T20:13:16Z"
  },
  {
    "title": "At Least Now We Know the Truth",
    "description": "David Frum: \"At least the Oval Office meeting held by President Donald Trump and Vice President J.D. Vance with Ukrainian President Volodymyr Zelensky was held in front of the cameras. False friendliness in public by",
    "link": "https://politicalwire.com/2025/02/28/at-least-now-we-know-the-truth/",
    "timestamp": "2025-02-28T20:12:34Z"
  },
  {
    "title": "\"Historic, Insolent Pig\": What Russia Said After Trump-Zelensky Fight",
    "description": "Russia&#039;s foreign ministry spokeswoman Maria Zakharova on Friday said US President Donald Trump showed &quot;restraint&quot; by not hitting Ukrainian President Volodymyr Zelensky during their shouting match in the White House.",
    "link": "https://www.ndtv.com/world-news/historic-insolent-pig-what-russia-said-after-trump-zelensky-fight-in-oval-office-7819395",
    "timestamp": "2025-02-28T20:12:20Z"
  },
  {
    "title": "WATCH: Zelenskyy departs White House after Trump and Vance chastise him in tense meeting",
    "description": "Ukraine's leader left the White House shortly after President Donald Trump shouted at him, showing open disdain.",
    "link": "https://www.pbs.org/newshour/world/watch-zelenskyy-departs-white-house-after-trump-and-vance-chastise-him-in-tense-meeting",
    "timestamp": "2025-02-28T20:12:18Z"
  },
  {
    "title": "Are Egg Producers Inflating Prices During the Bird Flu Outbreak?",
    "description": "Retail egg prices had generally remained below $2 per dozen for years before this outbreak began. Prices have more than doubled since then.",
    "link": "https://time.com/7262924/are-egg-producers-inflating-prices-bird-flu-outbreak/",
    "timestamp": "2025-02-28T20:10:44Z"
  },
  {
    "title": "US Port Fees on China Vessels Would Affect All Shipping Firms, CMA CGM Says",
    "description": "U.S. proposals to hit Chinese vessels with high port fees would have a major impact on all firms in a container shipping industry in which most vessels are built in China, French-based shipping firm CMA CGM said on Friday.",
    "link": "https://gcaptain.com/us-port-fees-on-china-vessels-would-affect-all-shipping-firms-cma-cgm-says/",
    "timestamp": "2025-02-28T20:10:24Z"
  },
  {
    "title": "Opinion: Our boycott of Big Business could help reverse the worst Trump policies",
    "description": "\"As everyday people, we are not powerless to bring about change through the discretionary use of our purchasing power.\"",
    "link": "https://www.denverpost.com/2025/02/28/boycott-trump-economic-blackout-no-shopping-feb-28/",
    "timestamp": "2025-02-28T20:08:59Z"
  },
  {
    "title": "Even Some Republicans Are Shocked by Trump-Zelenskiy Shouting Match",
    "description": "Donald Trump and JD Vance had a disastrous meeting with Ukrainian President Volodymyr Zelenskiy. And while most Republicans are cheering on their fearless  leader, at least two GOP members have found the courage to criticize the Trump administration.\r\nTrump a…",
    "link": "https://newrepublic.com/post/192172/republicans-congress-shocked-trump-zelenskiy-shouting-match",
    "timestamp": "2025-02-28T20:08:37Z"
  },
  {
    "title": "As tensions spike between journalists and the president, here's a look at 'viewpoint discrimination'",
    "description": "President Donald Trump’s executive order was clear: The Gulf of Mexico was out after hundreds of years. The Gulf of America was its name now.\nBut The Associated Press decided to keep the original name for its style and also note that Trump changed it. Trump l…",
    "link": "https://biztoc.com/x/cdb466cf716b915b",
    "timestamp": "2025-02-28T20:08:17Z"
  },
  {
    "title": "Donald Trump's Multiple Legal Setbacks",
    "description": "President Donald Trump has faced numerous legal challenges that threaten to derail his political agenda in his second term.\nWhy It Matters\nTrump has signed a rapid succession of executive orders on everything from birthright citizenship to the federal budget,…",
    "link": "https://biztoc.com/x/a8293126394355a0",
    "timestamp": "2025-02-28T20:08:12Z"
  },
  {
    "title": "Russia proposes resuming direct flights with US",
    "description": "Moscow suggested restoring air travel with the US during talks in Türkiye, according to the Foreign Ministry Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613456-russia-direct-flights-us/",
    "timestamp": "2025-02-28T20:06:44Z"
  },
  {
    "title": "Trump shouts at Zelenskyy; berates him for ‘gambling with millions of lives’",
    "description": "AGENCIES ASHINGTON: President Donald Trump shouted at Ukraine’s leader on Friday during an extraordinary meeting in the Oval Office, berating President Volodymyr Zelenskyy for “gambling with millions of lives” and suggesting his actions could trigger World Wa…",
    "link": "https://statetimes.in/trump-shouts-at-zelenskyy-berates-him-for-gambling-with-millions-of-lives/",
    "timestamp": "2025-02-28T20:06:40Z"
  },
  {
    "title": "How Jeff Bezos betrayed the Washington Post — and its readers",
    "description": "On a Monday in August 2013, I sat for coffee with a colleague from The Washington Post when suddenly my phone buzzed.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jeff-bezos-washington-post-opinion-free-markets-rcna194028",
    "timestamp": "2025-02-28T20:05:44Z"
  },
  {
    "title": "'We Are Governed by Children': Disgust as Trump and Vance Bully Zelenskyy in Oval Office",
    "description": "A White House meeting on Friday between U.S. President Donald Trump, Vice President JD Vance, and Ukrainian President Volodymyr Zelenskyy rapidly devolved into chaos as the two American leaders took turns berating Zelenskyy with television cameras rolling and…",
    "link": "https://www.commondreams.org/news/trump-vance-zelenskyy",
    "timestamp": "2025-02-28T20:03:28Z"
  },
  {
    "title": "Trump and Zelenskyy got into a heated blow-up in the Oval Office. Now their mineral deal is in limbo.",
    "description": "In an extraordinary scene, Volodymyr Zelenskyy and Donald Trump shouted at each other in the Oval Office.",
    "link": "https://www.businessinsider.com/white-house-statement-minerals-deal-trump-zelenskyy-oval-office-2025-2",
    "timestamp": "2025-02-28T20:03:04Z"
  },
  {
    "title": "Yes, Every Noncitizen in the US Should Register: The BorderLine",
    "description": "President Donald Trump has lost no time keeping his promises to secure the border, curtail illegal immigration, and enforce our immigration laws. He has signed... Read More\nThe post Yes, Every Noncitizen in the US Should Register: The BorderLine appeared firs…",
    "link": "https://www.dailysignal.com/2025/02/28/yes-every-noncitizen-us-should-register-borderline/",
    "timestamp": "2025-02-28T20:03:03Z"
  },
  {
    "title": "Roundup: Budget talks, cabinet meetings, and lots of TV",
    "description": "Congress is trying to come up with a new budget, while also attempting to extend tax cuts put in place during President Trump's first term. But with a very small majority in both houses, Republicans have little margin for error.\nThen, we look at the first cab…",
    "link": "https://www.npr.org/2025/02/28/1234443280/podcast-roundup-cabinet-taxes",
    "timestamp": "2025-02-28T20:02:34Z"
  },
  {
    "title": "Epstein files debacle spurs new interest in contents of promised JFK, MLK assassination files",
    "description": "In accordance with President Trump's executive order, the plan to release the MLK and RFK files is due on March 9, just weeks after the DOJ revealed highly anticipated Epstein files, many of which had already been released.",
    "link": "https://www.foxnews.com/politics/epstein-files-debacle-spurs-new-interest-contents-promised-jfk-mlk-assassination-files",
    "timestamp": "2025-02-28T20:02:14Z"
  },
  {
    "title": "Trump and Zelensky in tense Oval Office clash: 'Gambling with World War III'",
    "description": "A crucial meeting between former President Donald Trump and Ukrainian President Volodymyr Zelensky took an unexpected and dramatic turn on Friday. \n\nWhat was initially planned as a",
    "link": "https://www.marca.com/en/lifestyle/world-news/2025/02/28/67c2162bca474112528b45bd.html",
    "timestamp": "2025-02-28T20:02:13Z"
  },
  {
    "title": "Photos: Trump, Vance have tense blow up with Zelenskyy in Oval Office",
    "description": "The world saw tensions rise in real time as President Donald Trump and Vice President JD Vance shouted at Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://abcnews.go.com/Politics/photos-trump-vance-tense-blow-zelenskyy-oval-office/story?id=119299955",
    "timestamp": "2025-02-28T20:01:41Z"
  },
  {
    "title": "Europe's support for Ukraine unwavered after messy Trump-Zelenskyy meeting",
    "description": "The heated Oval Office exchange has left a peace deal on the Ukraine-Russia war hanging in the balance.",
    "link": "https://www.thejournal.ie/a-proper-slap-down-world-leaders-react-to-messy-trump-zelenskyy-white-house-press-conference-6636551-Feb2025/",
    "timestamp": "2025-02-28T20:01:35Z"
  },
  {
    "title": "Live updates: Trump cuts short talks with Ukraine's Zelenskyy after Oval Office blow up (Lisa Mascaro/Associated Press)",
    "description": "Lisa Mascaro / Associated Press:\nLive updates: Trump cuts short talks with Ukraine's Zelenskyy after Oval Office blow up  —  Watch live as U.S. President Donald Trump greets Ukrainian President Volodymyr Zelenskyy in Washington, D.C.  —  President Donald Trum…",
    "link": "https://www.memeorandum.com/250228/p96",
    "timestamp": "2025-02-28T20:00:35Z"
  },
  {
    "title": "VIDEO: THE MELTDOWN",
    "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.",
    "link": "https://www.youtube.com/watch?v=h3WD9CUNgEE",
    "timestamp": "2025-02-28T20:00:02Z"
  },
  {
    "title": "Bitcoin Rallies 8% From Overnight Low as Crypto Market Plunge Cools",
    "description": "Bitcoin and other risk-on assets wobbled after U.S. President Donald Trump clashed with Volodymyr Zelenskyy, though BTC is up since bottoming out overnight.",
    "link": "https://decrypt.co/308312/bitcoin-rallies-8-percent-overnight-low",
    "timestamp": "2025-02-28T19:59:57Z"
  },
  {
    "title": "How to Turn an “Economic Blackout” Into an All-Out War on Corporate Power",
    "description": "Americans who couldn’t defeat President Donald Trump in the voting booth are planning on Friday to fight back — with their pocketbooks.\nThe People’s Union USA, a movement led by a former drum instructor John Schwarz, organized a 24-hour “economic blackout” th…",
    "link": "https://biztoc.com/x/e1541350db2c3ecc",
    "timestamp": "2025-02-28T19:57:18Z"
  },
  {
    "title": "Putin Allies Rejoice After Heated Trump-Zelensky White House Meeting",
    "description": "Russian state media and allies of Russian President Vladimir Putin took a victory lap after U.S. President Donald Trump and Vice President JD Vance berated Ukrainian leader Volodymyr Zelensky at the White House on Friday.\nThe Context\nZelensky's White House vi…",
    "link": "https://biztoc.com/x/7aae0be3b73096f9",
    "timestamp": "2025-02-28T19:57:00Z"
  },
  {
    "title": "GOP-led committee launches probe to root out 'political' hires",
    "description": "As President Donald Trump and Elon Musk move to fire broad swaths of the federal workforce, the top Republican on the House Oversight and Government Reform Committee is launching an investigation into who officials in the previous administration hired in the …",
    "link": "https://biztoc.com/x/b64c6507d3405b23",
    "timestamp": "2025-02-28T19:56:49Z"
  },
  {
    "title": "Trump and Vance Argue With Zelenskiy in Oval Office",
    "description": "President Donald Trump’s meeting Friday with Volodymyr Zelenskiy quickly devolved into a fiery exchange when the Ukrainian leader cast doubt on the likelihood US efforts to broker a deal with Russia would yield lasting peace.\nThe reaction by Zelenskiy inspire…",
    "link": "https://biztoc.com/x/0e7583280113e2d1",
    "timestamp": "2025-02-28T19:56:44Z"
  },
  {
    "title": "NATO Could Effectively Die This June",
    "description": "Trump's negotiations and German elections may augur the end of collective security as we known it.",
    "link": "https://reason.com/2025/02/28/nato-could-effectively-die-this-june/",
    "timestamp": "2025-02-28T19:54:22Z"
  },
  {
    "title": "Foreign powers have long profited from Ukrainian resources – Trump’s minerals grab is no exception",
    "description": "Western capitalists and Russian elites first began developing Ukrainian resources in the mid-19th century.",
    "link": "https://theconversation.com/foreign-powers-have-long-profited-from-ukrainian-resources-trumps-minerals-grab-is-no-exception-250811",
    "timestamp": "2025-02-28T19:53:56Z"
  },
  {
    "title": "Elon Musk is firing thousands of workers – why this could be the biggest jobs cut in US history",
    "description": "The Musk-led purge of public servants is causing concern among some Republicans as well as Democrats.",
    "link": "https://theconversation.com/elon-musk-is-firing-thousands-of-workers-why-this-could-be-the-biggest-jobs-cut-in-us-history-250854",
    "timestamp": "2025-02-28T19:53:51Z"
  },
  {
    "title": "US inflation has increased since Trump took office – why prices are unlikely to come down soon",
    "description": "Donald Trump’s pledge to halt US inflation looks like a challenging task.",
    "link": "https://theconversation.com/us-inflation-has-increased-since-trump-took-office-why-prices-are-unlikely-to-come-down-soon-249956",
    "timestamp": "2025-02-28T19:53:49Z"
  },
  {
    "title": "51st state? Donald Trump’s closest advisor, Peter Navarro, threatens to redraw Canadian border amid President's talk of the country becoming next U.S. state",
    "description": "Peter Navarro, a key Donald Trump adviser, is pushing for border changes and other harsh measures against Canada, escalating tensions. Trump has repeatedly suggested that Canada become the 51st state of the United States, but Prime Minister Justin Trudeau has…",
    "link": "https://economictimes.indiatimes.com/news/international/us/51st-state-donald-trumps-closest-advisor-peter-navarro-threatens-to-redraw-canadian-border-amid-presidents-talk-of-the-country-becoming-next-u-s-state/articleshow/118637040.cms",
    "timestamp": "2025-02-28T19:53:26Z"
  },
  {
    "title": "Filmmaker Paul Feig Donates $300,000 to Support 'Trans' Youth: ‘Our Fellow Citizens Are Stripped of Their Rights'",
    "description": "Hollywood Director Paul Feig has decided to take a stand against President Donald Trump by giving money to several LGBTQQIAAP2S+ groups who are digging in on transing children.\nThe post Filmmaker Paul Feig Donates $300,000 to Support ‘Trans’ Youth: ‘Our Fello…",
    "link": "https://www.breitbart.com/entertainment/2025/02/28/filmmaker-paul-feig-donates-300000-to-support-trans-youth-our-fellow-citizens-are-stripped-of-their-rights/",
    "timestamp": "2025-02-28T19:53:22Z"
  },
  {
    "title": "Zelensky Posts Tweet Thanking ‘POTUS, Congress, and the American People’ After White House Meeting Explodes",
    "description": "Ukrainian President Volodymyr Zelensky issued a statement of thanks to the American people and the White House Friday afternoon after President Donald Trump reportedly asked him to leave the White House following a heated meeting. Trump, Zelensky, and Vice Pr…",
    "link": "https://www.mediaite.com/trump/zelensky-posts-tweet-thanking-potus-congress-and-the-american-people-after-white-house-meeting-explodes/",
    "timestamp": "2025-02-28T19:52:26Z"
  },
  {
    "title": "Zelensky Thanks US For His Visit After Clash With Trump At White House",
    "description": "Ukrainian President Volodymyr Zelensky on Friday said he was grateful to the United States for its support and for his visit after a shouting match with US President Donald Trump in the White House.",
    "link": "https://www.ndtv.com/world-news/zelensky-thanks-us-for-his-visit-after-clash-with-trump-at-white-house-7819328",
    "timestamp": "2025-02-28T19:51:11Z"
  },
  {
    "title": "Why are CEOs having second thoughts about Trump?",
    "description": "Tariff threats and economic warning signs create corporate uncertainty",
    "link": "https://theweek.com/business/economy/ceo-trump-uncertainty-tariffs-economic-optimism",
    "timestamp": "2025-02-28T19:50:57Z"
  },
  {
    "title": "Conservative Columnist Torches Trump Over Oval Office Roast of Zelensky: ‘There Will Be Consequences’",
    "description": "National Review's Noah Rothman was more than a little disappointed by President Donald Trump performance during an Oval Office with Volodymyr Zelensky.\nThe post Conservative Columnist Torches Trump Over Oval Office Roast of Zelensky: ‘There Will Be Consequenc…",
    "link": "https://www.mediaite.com/news/conservative-columnist-torches-trump-over-oval-office-roast-of-zelensky-there-will-be-consequences/",
    "timestamp": "2025-02-28T19:50:10Z"
  },
  {
    "title": "European shares extend winning streak into 10th week",
    "description": "Dublin Euronext market ends week on a high while FTSE 100 hits another record",
    "link": "https://www.irishtimes.com/business/markets/2025/02/28/european-shares-extend-winning-streak-into-tenth-week/",
    "timestamp": "2025-02-28T19:48:18Z"
  },
  {
    "title": "FIFA’s Gianni Infantino defends awarding of World Cup to Saudi Arabia and his relationship with Donald Trump",
    "description": "FIFA president Gianni Infantino has defended awarding the 2034 World Cup to Saudi Arabia and his close relationship with United States president Donald Trump.",
    "link": "https://www.independent.ie/sport/soccer/fifas-gianni-infantino-defends-awarding-of-world-cup-to-saudi-arabia-and-his-relationship-with-donald-trump/a701432464.html",
    "timestamp": "2025-02-28T19:47:56Z"
  }
]