[
  {
    "title": "Senate returns amid concerns about deeper US involvement in the Iran, Israel conflict",
    "description": "Congress returns amid Israel-Iran conflict, with lawmakers questioning U.S. involvement, war powers implications and terrorism risks as President Donald Trump balances MAGA concerns with Israel support.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-congressional-concerns-about-deeper-u-s-involvement-iran-israel-conflict",
    "timestamp": "2025-06-16T16:57:44Z"
  },
  {
    "title": "Trump Administration Sued For 'Discriminating Against White Farmers'",
    "description": "A Wisconsin dairy farmer is suing the Trump administration over allegations it is discriminating against white farmers by continuing programs that favor minorities.",
    "link": "https://www.newsweek.com/trump-administration-sued-discriminating-against-white-farmers-2086229",
    "timestamp": "2025-06-16T16:57:43Z"
  },
  {
    "title": "Israel Can’t Be a Hegemon",
    "description": "The Israeli government is making a bid for regional dominance that’s unlikely to succeed.",
    "link": "http://foreignpolicy.com/2025/06/16/israel-iran-war-middle-east-hegemon/",
    "timestamp": "2025-06-16T16:57:05Z"
  },
  {
    "title": "What to Know About Trump Mobile, the New Phone Service Announced by the Trump Organization",
    "description": "The Trump Organization has announced the launch of a new “all-American” cellular service that will carry the President’s name.",
    "link": "https://time.com/7294675/trump-mobile-phone-service/",
    "timestamp": "2025-06-16T16:56:38Z"
  },
  {
    "title": "'Tens Of People Seemed To Enjoy It': Pundits Backhand Trump's Birthday Parade",
    "description": "NewsNation pundit and radio host Julie Mason offered backhanded praise for the military parade held on President Donald Trump's birthday.\n\n\nDuring a Sunday panel discussion, host Chris Stirewalt noted that there \"were a lot of anxieties\" over Saturday's event…",
    "link": "https://crooksandliars.com/2025/06/tens-people-seemed-enjoy-it-pundits",
    "timestamp": "2025-06-16T16:55:38Z"
  },
  {
    "title": "Hillary Clinton's 'utter contempt' for troops under fire after attempting to mock Trump's military parade",
    "description": "Former Secretary of State Hillary Clinton's attempt to mock President Donald Trump's military parade honoring the 250th anniversary of the U.S. Army backfired on social media as conservatives and other critics lambasted her for allegedly holding \"utter contem…",
    "link": "https://freerepublic.com/focus/f-news/4323398/posts",
    "timestamp": "2025-06-16T16:55:37Z"
  },
  {
    "title": "Netanyahu doesn't rule out assassinating Khamenei",
    "description": "Israeli PM tells ABC News the claims the elimination of Iran's Supreme Leader would escalate the conflict are incorrect and the opposite would occur.",
    "link": "https://www.israelnationalnews.com/news/410124",
    "timestamp": "2025-06-16T16:55:18Z"
  },
  {
    "title": "Trump Orders ICE Vengeance on 'No Kings' Protest Cities (Cameron Adams/The Daily Beast)",
    "description": "Cameron Adams / The Daily Beast:\nTrump Orders ICE Vengeance on ‘No Kings’ Protest Cities  —  RETRIBUTION MOVE  —  President gives nakedly political order for law enforcement to target Democratic cities.  —  Donald Trump ordered ICE officers to prioritize depo…",
    "link": "https://www.memeorandum.com/250616/p71",
    "timestamp": "2025-06-16T16:55:00Z"
  },
  {
    "title": "Watchdog Warns of Growing Global Threat as Nuclear-Armed Israel Attacks Iran",
    "description": "As Israel's assault on Iran generates global alarm, an international watchdog on Monday released an annual report warning that \"a dangerous new nuclear arms race is emerging at a time when arms control regimes are severely weakened.\"The Stockholm Internationa…",
    "link": "https://www.commondreams.org/news/countries-with-nuclear-weapons",
    "timestamp": "2025-06-16T16:54:35Z"
  },
  {
    "title": "Coming to America? In 2025, the US to some looks less like a dream and more like a place to avoid",
    "description": "Clues across sectors suggest the American dream is fading.",
    "link": "https://www.bostonherald.com/2025/06/16/american-immigration/",
    "timestamp": "2025-06-16T16:53:41Z"
  },
  {
    "title": "Raport. Statele europene reușesc să suplinească ajutorul militar pentru Ucraina, oprit de americani când Donald Trump a revenit la Casa Albă. Sprijinul europenilor pentru Kiev l-a depășit pe cel al SUA, iar Marea Britanie și țările nordice au cea mai mare contribuție.",
    "description": " #UkraineSupportTracker: For the 1st time since mid-2022, Europe has surpassed the US in total military aid to Ukraine. This shift comes as US support has stalled, while European countries—especially Nordics & UK—have increased their contributions  http…",
    "link": "https://www.biziday.ro/322696-2/",
    "timestamp": "2025-06-16T16:53:06Z"
  },
  {
    "title": "'Project Runway' Designer Dead After Shooting at ‘No Kings’ Protest",
    "description": "Project Runway contestant Arthur Folasa “Afa” Ah Loo has been identified as a victim of a fatal shooting during the Salt Lake City “No Kings” march. He was 39. The Salt Lake Police Department described Loo as an “innocent bystander” during the Saturday, June …",
    "link": "https://www.usmagazine.com/celebrity-news/news/project-runways-afa-ah-loo-dead-after-shooting-at-no-kings-protest/#article",
    "timestamp": "2025-06-16T16:51:05Z"
  },
  {
    "title": "Iranian Officials Seek Asylum in Russia in Case Regime Crumbles: Report",
    "description": "Iranian supreme leader Ali Khamenei's senior officials are reportedly in talks to secure asylum in Russia, as the Islamic Republic reels from Israeli strikes on its nuclear and military infrastructure.\nThe post Iranian Officials Seek Asylum in Russia in Case …",
    "link": "https://freebeacon.com/latest-news/iranian-officials-seek-asylum-in-russia-in-case-regime-crumbles-report/",
    "timestamp": "2025-06-16T16:50:48Z"
  },
  {
    "title": "EXCLUSIVE INVESTIGATION: How Joe Biden Splashed Nearly $51K of Taxpayers' Cash On Just ONE NIGHT at Robert De Niro's Hotel Chain — As Part of $8MILLION Luxury Travel Blitz in Just One Year",
    "description": "Joe Biden splashed out over $50,000 of taxpayers cash on a visit to Robert De Niro’s hotel chain – as part of a massive $8million travel expenses bill.",
    "link": "https://radaronline.com/p/joe-biden-splashed-fortune-taxpayers-cash-robert-de-niro-hotel/",
    "timestamp": "2025-06-16T16:50:04Z"
  },
  {
    "title": "THE TRASH REPORT: Brad Pitt, Donald Trump, and King Charles are All Embarrassing",
    "description": "Line up for your heaping helping of garbage-y gossip!\n \n by Elinor Jones\n \n \n \n Hi there, and welcome to the Trash Report! I'm Elinor Jones. I'm writing this week's column on Father's Day, immensely grateful that my immediate family all had the fortune of bei…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/06/16/47851674/the-trash-report-brad-pitt-donald-trump-and-king-charles-are-all-embarrassing",
    "timestamp": "2025-06-16T16:50:00Z"
  },
  {
    "title": "'The View' star Ana Navarro saw attempted conflict at 'No Kings' protest",
    "description": "'The View' cohost Ana Navarro said she witnessed antagonists 'put in the crowd to instigate confrontation' as she attended a 'No Kings' protest over the weekend.",
    "link": "https://ew.com/the-view-ana-navarro-no-kings-protest-crowd-confrontation-11755183",
    "timestamp": "2025-06-16T16:48:57Z"
  },
  {
    "title": "Canadian PM 'shuts off' Trump as press conference heads 'off the rails': CNN",
    "description": "Canadian Prime Minister Mark Carney interrupted question and answer session with Donald Trump at Monday's G7 summit before the U.S. president got too much into the weeds discussing ICE raids on \"blue cities,\" according to CNN correspondent Kristen Holmes.As T…",
    "link": "https://www.rawstory.com/trump-canada-2672378971/",
    "timestamp": "2025-06-16T16:47:00Z"
  },
  {
    "title": "Terry Moran Disputes ABC News' Statement After His Exit, Responds to Rumors He Was 'Drunk' When He Wrote the Stephen Miller Message",
    "description": "Terry Moran is breaking his silence on the tweet that got him suspended before being ousted. If you don’t know, earlier this month, the former ABC News journalist called Donald Trump‘s deputy chief of staff Stephen Miller a “world-class hater” on X. “The thin…",
    "link": "https://www.justjared.com/2025/06/16/terry-moran-disputes-abc-news-statement-after-his-exit-responds-to-rumors-he-was-drunk-when-he-wrote-the-stephen-miller-message/",
    "timestamp": "2025-06-16T16:46:29Z"
  },
  {
    "title": "Sincerity Wins the War",
    "description": "Hello Where’s Your Ed At Subscribers! I’ve started a premium version of this newsletter with a weekly Friday column where I go over the most meaningful news and give my views, which I guess is what you’d expect. Anyway, it’s $7 a month or $70 a year, and help…",
    "link": "https://www.wheresyoured.at/sic/",
    "timestamp": "2025-06-16T16:45:56Z"
  },
  {
    "title": "Iranians seek temporary refuge in neighbouring Turkiye as conflict with Israel escalates",
    "description": "At the Turkiye-Iran border, Iranian families are crossing into Turkiye to seek temporary refuge from the intensifying conflict between Israel and Iran. Many, like Shirin Talebi from Urmia, are hoping to return home once the situation stabilises.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iranians-seek-temporary-refuge-in-neighbouring-turkiye-as-conflict-with-israel-escalates/articleshow/121890287.cms",
    "timestamp": "2025-06-16T16:45:39Z"
  },
  {
    "title": "Trump enters smartphone market with exactly the gaudy golden phone you’d imagine",
    "description": "The Trump Organization has officially announced a new mobile service called T1 Mobile and a new phone called the T1 Phone.",
    "link": "https://www.androidauthority.com/trump-t1-phone-and-service-3567848/",
    "timestamp": "2025-06-16T16:45:19Z"
  },
  {
    "title": "G7 leaders struggle for unity as Trump says removing Russia from group was a mistake",
    "description": "Group of Seven leaders met in Canada amidst global tensions. Discussions focused on the Ukraine and Middle East conflicts. Donald Trump suggested Russia's return to the group and a mediation role in the Israel-Iran conflict. Disagreements arose on de-escalati…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g7-leaders-struggle-for-unity-as-trump-says-removing-russia-from-group-was-a-mistake/articleshow/121890284.cms",
    "timestamp": "2025-06-16T16:44:29Z"
  },
  {
    "title": "Iran asks Gulf states to mediate for ceasefire with Israel: Sources",
    "description": "Tehran has asked Qatar, Saudi Arabia and Oman to press US President Donald Trump to use his influence on Israel to agree to an immediate ceasefire, two Iranian and three regional sources told Reuters on Monday (Jun 16). In return, Iran will reportedly offer f…",
    "link": "https://freerepublic.com/focus/f-bloggers/4323395/posts",
    "timestamp": "2025-06-16T16:43:57Z"
  },
  {
    "title": "The Tyrant Test",
    "description": "A leader who uses military force to suppress his political opposition ought to lose the right to govern.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/trump-military-force-protests/683198/",
    "timestamp": "2025-06-16T16:43:38Z"
  },
  {
    "title": "Trump Mobile Debuts To Challenge Big Telecom",
    "description": "The Trump Organization on Monday unveiled Trump Mobile, a self-branded wireless service and $499 smartphone, aiming to attract conservative consumers seeking alternatives to major telecom providers. \nDonald Trump Jr. introduced the service at Trump Tower, pro…",
    "link": "https://biztoc.com/x/59440f05ad6b1640",
    "timestamp": "2025-06-16T16:43:31Z"
  },
  {
    "title": "‘Pathetic’: Former White House press secretary shreds media for ‘disgusting’ coverage of military parade",
    "description": "'The United States Army alone has lost over a million Americans in the service of this country to give people the freedom to go do stupid crap like they did'",
    "link": "https://www.wnd.com/2025/06/pathetic-former-white-house-press-secretary-shreds-media-for-disgusting-coverage-of-military-parade/",
    "timestamp": "2025-06-16T16:43:26Z"
  },
  {
    "title": "G7 summit: Trump calls removing Russia from group 'mistake'",
    "description": "The US president has also said he 'wouldn't mind' China joining the G7.The summit is held against the backdrop of a climate of global economic uncertainty and the Israel-Iran conflict. Follow DW for more. Trump has said throwing Russia out of the then G8 was …",
    "link": "https://www.dw.com/en/g7-summit-trump-calls-removing-russia-from-group-mistake/live-72915936",
    "timestamp": "2025-06-16T16:43:00Z"
  },
  {
    "title": "G7 leaders aim for unity, facing escalating wars in Ukraine, Middle East",
    "description": "The group is convening in the resort area of Kananaskis in the Canadian Rockies until Tuesday",
    "link": "https://www.irishtimes.com/world/europe/2025/06/16/g7-leaders-aim-for-unity-facing-escalating-wars-in-ukraine-middle-east/",
    "timestamp": "2025-06-16T16:41:51Z"
  },
  {
    "title": "ICE crackdown ordered by Trump on No Kings protest cities sparks outrage - here's what's coming next",
    "description": "Millions protested against President Donald Trump's policies. Trump responded by ordering ICE to conduct mass deportations. The order targets cities like Los Angeles, Chicago, and New York. Trump claims these cities use undocumented immigrants to boost Democr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ice-crackdown-ordered-by-trump-on-no-kings-protest-cities-sparks-outrage-heres-whats-coming-next/articleshow/121889885.cms",
    "timestamp": "2025-06-16T16:41:20Z"
  },
  {
    "title": "Unhinged Trump Order Lets VA Doctors Refuse to Treat Democratic Vets",
    "description": "Healthcare professionals at the Department of Veterans Affairs can now discriminate against Democrats, and it’s all thanks to Donald Trump’s anti-trans executive order. \r\nWhile medical staff are still required to treat patients regardless of race, color, reli…",
    "link": "https://newrepublic.com/post/196877/donald-trump-executive-order-veterans-affairs-doctors-refuse-treat-democrats",
    "timestamp": "2025-06-16T16:40:21Z"
  },
  {
    "title": "‘Damning’ UK child grooming report finds authorities feared being called racist",
    "description": "\"Questions about ethnicity have been asked but dodged for years,\" says official report into organized child sexual abuse.",
    "link": "https://www.politico.eu/article/uk-child-grooming-racist-report-house-of-commons-elon-musk/",
    "timestamp": "2025-06-16T16:38:33Z"
  },
  {
    "title": "Trump family unveils new mobile service and plans for US-made smartphone",
    "description": "The $47.45 a month plan includes unlimited talk, text and data, as well as roadside assistance and telehealth services, according to Trump Mobile’s website.",
    "link": "https://nypost.com/2025/06/16/business/trump-family-unveils-mobile-service-plan-499-smartphone/",
    "timestamp": "2025-06-16T16:38:04Z"
  },
  {
    "title": "US bolsters military options for Trump with refueling aircraft, officials say",
    "description": "Amid rising tensions in the Middle East, the United States military has deployed refueling aircraft to Europe. This move provides President Trump with more options. The aircraft carrier Nimitz is also heading to the Middle East. These deployments suggest a st…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-bolsters-military-options-for-trump-with-refueling-aircraft-officials-say/articleshow/121890103.cms",
    "timestamp": "2025-06-16T16:37:39Z"
  },
  {
    "title": "The Trump Family’s Latest Grift Is a Cheap Phone That Might Not Work",
    "description": "The “Trump Phone” is coming this fall. \r\nPresident Trump’s son Eric Trump went on Fox Business’s “Mornings with Maria” to discuss how the new phone can use it to “correct” a political sphere they think is unfairly targeting them. \r\n“More and more we’re using …",
    "link": "https://newrepublic.com/post/196874/trump-family-latest-grift-cheap-phone-might-not-work",
    "timestamp": "2025-06-16T16:37:26Z"
  },
  {
    "title": "UN refugee agency says will shed 3,500 jobs due to funding cuts",
    "description": "The UN refugee agency said Monday it will cut 3,500 staff jobs — slashing nearly a third of its workforce costs — due to a funding shortfall, and reduce the scale of its help worldwide. UNHCR carried out a review of its activities, expenditure, staffing and s…",
    "link": "https://www.digitaljournal.com/world/un-refugee-agency-says-will-shed-3500-jobs-due-to-funding-cuts/article",
    "timestamp": "2025-06-16T16:37:20Z"
  },
  {
    "title": "Trump’s New Cash Grab Is a Gold iPhone Lookalike That’s Worse Than Any Budget Android",
    "description": "When conflict of interest calls, Trump answers.",
    "link": "https://gizmodo.com/trumps-new-cash-grab-is-a-gold-iphone-lookalike-thats-worse-than-any-budget-android-2000616319",
    "timestamp": "2025-06-16T16:35:39Z"
  },
  {
    "title": "US senator introduces bill to curb Trump’s power to go to war with Iran",
    "description": "The measure by Democratic lawmaker Tim Kaine comes as foreign policy hawks call on US to join Israel in attacking Iran.",
    "link": "https://www.aljazeera.com/news/2025/6/16/us-senator-introduces-bill-to-curb-trumps-power-to-go-to-war-with-iran",
    "timestamp": "2025-06-16T16:35:35Z"
  },
  {
    "title": "Trump slams Obama, Trudeau for pushing Russia out of G8 summit years ago: 'Wouldn't have a war'",
    "description": "Trump criticized former President Obama and former Prime Minister Trudeau for Russia's G8 removal, claiming it was a \"very big mistake\" that would have prevented further war.",
    "link": "https://www.foxnews.com/politics/trump-slams-obama-trudeau-pushing-russia-out-g8-summit-years-ago-wouldnt-have-war",
    "timestamp": "2025-06-16T16:35:35Z"
  },
  {
    "title": "Netanyahu tells ABC he's not ruling out taking out Iran's Supreme Leader Ali Khamenei",
    "description": "Netanyahu tells ABC he's not ruling out taking out Iran's Supreme Leader Ali Khameneigo.com",
    "link": "https://abcnews.go.com/Politics/netanyahu-tells-abc-ruling-taking-irans-supreme-leader/story?id=122868515",
    "timestamp": "2025-06-16T16:35:00Z"
  },
  {
    "title": "Over 98% of Americans ignore No Kings' tired tantrum | Blaze Media",
    "description": "98% of Americans went on with their lives, while a small minority participated in No Kings.",
    "link": "https://www.theblaze.com/news/over-98-of-americans-ignore-no-kings-tired-tantrum",
    "timestamp": "2025-06-16T16:35:00Z"
  },
  {
    "title": "Trump Refuses to Answer Key Question About Israel’s War in Iran",
    "description": "The president is mulling over the possibility of throwing the United States into war with Iran.\r\nSpeaking with ABC News Sunday, Donald Trump refused to answer whether the U.S. would wade into the conflict. He said that American forces were not currently invol…",
    "link": "https://newrepublic.com/post/196871/donald-trump-refuses-answer-key-question-israel-iran",
    "timestamp": "2025-06-16T16:34:46Z"
  },
  {
    "title": "How Hunger Games: Sunrise on the Reaping cast stacks up against original as new characters announced",
    "description": "Latest film in Hunger Games franchise is slated for release in November 2026",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/hunger-games-sunrise-on-reaping-cast-announcement-b2771039.html",
    "timestamp": "2025-06-16T16:34:18Z"
  },
  {
    "title": "Trump Says Trade Deal With Canada ‘Achievable’ as G-7 Opens",
    "description": "President Donald Trump expressed optimism about settling a trade dispute with Canada during his time at the Group of Seven summit, calling a deal in the coming weeks between the US and its northern neighbor “achievable.”",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-trade-deal-with-canada-achievable-as-g-7-opens",
    "timestamp": "2025-06-16T16:33:59Z"
  },
  {
    "title": "Trump Says Iran Wants to Talk After Waves of Israeli Strikes",
    "description": "President Donald Trump said Iran wants to talk about de-escalating the conflict with Israel even as the two sides exchanged deadly fire for the fourth consecutive day.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-iran-wants-to-talk-after-waves-of-israeli-strikes",
    "timestamp": "2025-06-16T16:33:51Z"
  },
  {
    "title": "LA Law Enforcement Agencies Rioted So Hard They Ended Up Shooting Each Other",
    "description": "While Donald Trump was trying (and failing) to cheer himself up with a self-congratulatory birthday parade I mean, just look at this sad boy: the Los Angeles Police Department and Los Angeles Sheriffs Department were busy turning peaceful protests in violent …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178066747",
    "timestamp": "2025-06-16T16:33:27Z"
  },
  {
    "title": "Trump Says Israel, Iran May Need to ‘Fight It Out’ Before Deal",
    "description": "President Donald Trump said he believed it’s possible Israel and Iran could reach an agreement to end their conflict, though the two sides may need to continue fighting before they’re ready to broker a peace deal.\n“Sometimes they have to fight it out, but we’…",
    "link": "https://biztoc.com/x/2e2ac43f803c11fa",
    "timestamp": "2025-06-16T16:32:38Z"
  },
  {
    "title": "No War If Russia Was Still In G8: Trump",
    "description": "President Donald Trump on Tuesday criticized the decision to remove Russia from the G8, suggesting it contributed to the ongoing war in Ukraine.\n“The G7 used to be the G8,” Trump said at the G7 summit in Alberta. “Barack Obama and a person named Trudeau didn’…",
    "link": "https://biztoc.com/x/512aa2db6162ea5f",
    "timestamp": "2025-06-16T16:32:36Z"
  },
  {
    "title": "Is Trump Mobile first family's latest effort to cash in on the White House? What you need to know",
    "description": "The Trump Organization is launching T1 Mobile, a virtual mobile phone service, capitalizing on Donald Trump's image. Managed by Donald Trump Jr. and Eric Trump, the venture offers the \"47 Plan\" and a golden \"T1\" smartphone. Critics raise concerns about potent…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-trump-mobile-first-familys-latest-effort-to-cash-in-on-the-white-house-what-you-need-to-know/articleshow/121889918.cms",
    "timestamp": "2025-06-16T16:32:28Z"
  },
  {
    "title": "'He sulked, he slouched': Analyst claims 'puny' parade left Trump miserable",
    "description": "Americans “really let President Donald Trump down on June 14\r\n,\" USA Today columnist\r\n Rex Huppke\r\n mocked on Monday.With more than five million people rallying at various ‘no kings’ protests, Huppke wanted those demonstrators to know how “hurtful that was fo…",
    "link": "https://www.rawstory.com/parade/",
    "timestamp": "2025-06-16T16:32:24Z"
  },
  {
    "title": "A Dangerous Plan From Senate Republicans Would Give Trump Even More Power",
    "description": "The proposal mirrors a House plan that would undermine civil service protections and give a president like Trump more power to fire whomever he wants.",
    "link": "https://www.huffpost.com/entry/senate-reconciliation-civil-service-protections_n_68503c3de4b0dd6cd17e4d72",
    "timestamp": "2025-06-16T16:31:10Z"
  },
  {
    "title": "What Not to Miss at the 13th Berlin Biennale",
    "description": "Across the city, artists transform sites of surveillance, repression and bureaucracy into spaces for dignity, solidarity and truth-telling.",
    "link": "https://observer.com/2025/06/first-look-13th-berlin-biennale-passing-the-fugitive-on/",
    "timestamp": "2025-06-16T16:30:15Z"
  },
  {
    "title": "Trump Media is pushing deeper into crypto after filing to launch a bitcoin-ether ETF",
    "description": "The parent company of Truth Social filed for the launch of a bitcoin-ether ETF. It's the latest push by Trump and his companies into the world of crypto.",
    "link": "https://www.businessinsider.com/trump-media-djt-crypto-president-bitcoin-ether-etf-btc-eth-2025-6",
    "timestamp": "2025-06-16T16:30:04Z"
  },
  {
    "title": "How Trump went from opposing Israel's strikes on Iran to reluctant support (NBC News)",
    "description": "NBC News:\nHow Trump went from opposing Israel's strikes on Iran to reluctant support  —  The president had opposed Israeli action against Iran but came to believe that Israel had reason to act and that the U.S. would have to lend some support.  —  WASHINGTON …",
    "link": "https://www.memeorandum.com/250616/p68",
    "timestamp": "2025-06-16T16:30:01Z"
  },
  {
    "title": "Anand Girihadaras: Why Trump’s Birthday Parade Failed",
    "description": "The crowds were larger and more animated at the No Kings rallies than on Constitution Avenue, where Trump summoned up a parade in honor of his 79th birthday. Yesterday evening, I saw tweets comparing the demeanor of the American service members to their parad…",
    "link": "https://dianeravitch.net/2025/06/16/anand-girihadaras-why-trumps-birthday-parade-failed/",
    "timestamp": "2025-06-16T16:30:00Z"
  },
  {
    "title": "Here's what Trump gifted Carney the last time the leaders met in Washington",
    "description": "Trump gifted Carney, a die-hard Edmonton Oilers fan, the framed and mounted jersey after the leaders sat down for their first meeting",
    "link": "https://nationalpost.com/news/politics/heres-what-trump-gifted-carney-the-last-time-the-leaders-met-in-washington",
    "timestamp": "2025-06-16T16:29:10Z"
  },
  {
    "title": "Caitlyn Jenner flees Israel after being forced to hide in bomb shelter in face of Iran attacks",
    "description": "\"I am happy to stand with Israel today, now more than ever,\" Jenner wrote.",
    "link": "https://nypost.com/2025/06/16/world-news/caitlyn-jenner-flees-israel-in-face-of-iran-attacks/",
    "timestamp": "2025-06-16T16:28:42Z"
  },
  {
    "title": "Introducing ‘Trump Mobile,’ Don Jr. And Eric Trump's Latest Gold-Plated, $499 Grift",
    "description": "The Trump Organization's latest venture will raise concerns about the president's potential conflicts of interest amid his tariffs threat.",
    "link": "https://www.huffpost.com/entry/trump-mobile-eric-don_n_68501768e4b006b6c3e64e7e",
    "timestamp": "2025-06-16T16:28:23Z"
  },
  {
    "title": "People are thinking viral video of soldiers marching at Trump birthday parade has hidden meaning",
    "description": "People online have suggested that soliders in the U.S. Army 250th Anniversary Parade were deliberately marching badly on purpose as a sign of defiance.",
    "link": "https://www.ladbible.com/news/us-news/us-military-parade-soldiers-marching-donald-trump-theory-171583-20250616",
    "timestamp": "2025-06-16T16:28:14Z"
  },
  {
    "title": "LA Law Enforcement Agencies Rioted So Hard They Ended Up Shooting Each Other",
    "description": "While Donald Trump was trying (and failing) to cheer himself up with a self-congratulatory birthday parade — I mean, just look at this sad boy: — the Los Angeles Police Department and Los Angeles Sheriffs Department were busy turning peaceful protests in viol…",
    "link": "https://www.techdirt.com/2025/06/16/la-law-enforcement-agencies-rioted-so-hard-they-ended-up-shooting-each-other/",
    "timestamp": "2025-06-16T16:27:00Z"
  },
  {
    "title": "Putin Says Americans 'Galore' Agree With Him",
    "description": "\"We have people galore who share our position,\" the Russian president said.",
    "link": "https://www.newsweek.com/putin-americans-traditional-values-russia-2086186",
    "timestamp": "2025-06-16T16:24:33Z"
  },
  {
    "title": "Trump Sends Command to ICE Agents in Truth Social Post: 'ICE Officers Are Herewith Ordered...'",
    "description": "President Donald Trump has delivered a public message to ICE agents telling them where to focus as they search for illegal immigrants.",
    "link": "https://www.westernjournal.com/trump-sends-command-ice-agents-truth-social-post-ice-officers-herewith-ordered/",
    "timestamp": "2025-06-16T16:23:23Z"
  },
  {
    "title": "Trump: Throwing Russia out of G8 'mistake'",
    "description": "United States President Donald Trump said on Monday that the Group of Seven (G7) used to be the Group of Eight (G8), but his predecessor Barack Obama and former Prime Minister of Canada Justin Trudeau...",
    "link": "https://biztoc.com/x/46dd9eb1d267a2d4",
    "timestamp": "2025-06-16T16:21:36Z"
  },
  {
    "title": "In Los Angeles, So Much of the Protest Narrative Has Felt Wrong. Saturday Was a Corrective",
    "description": "After a week of watching a fun-house-mirror version of their city in global media, thousands of Los Angeles residents took to the streets on Saturday.",
    "link": "https://www.vanityfair.com/hollywood/story/los-angeles-protest-narrative-no-kings",
    "timestamp": "2025-06-16T16:21:18Z"
  },
  {
    "title": "Trump Explains What’s Holding Up Canada Trade Deal",
    "description": "President Donald Trump on Friday outlined the key obstacle in finalizing a trade deal with Canada, saying the two countries differ on their approach. \nSpeaking at the G7 summit in Alberta, Trump said, “It’s not so much a holding up, we just have different con…",
    "link": "https://biztoc.com/x/f8c9bdd313bdacc4",
    "timestamp": "2025-06-16T16:21:16Z"
  },
  {
    "title": "‘Another Trump Grift’: Critics Aghast at New Trump Cell Phone",
    "description": "Donald Trump’s latest business venture, a branded cell phone and wireless plan dubbed “Trump Mobile,” sparked swift backlash Monday, with critics accusing the president of exploiting his supporters for personal gain. Trump Mobile launched on Monday, promoting…",
    "link": "https://www.mediaite.com/politics/trump/another-trump-grift-critics-aghast-at-new-trump-cell-phone/",
    "timestamp": "2025-06-16T16:19:16Z"
  },
  {
    "title": "Republicans criticize Dem congressional candidate's '86 47' post as call for 'political violence'",
    "description": "Former Marine and Democratic hopeful Maura Sullivan faces GOP backlash after appearing with sign containing '86 47' message that some interpret as threatening toward Trump",
    "link": "https://www.foxnews.com/politics/republicans-call-out-congressional-candidates-86-47-message-call-political-violence",
    "timestamp": "2025-06-16T16:18:05Z"
  },
  {
    "title": "EU dismisses reports that it is ready to accept flat 10% U.S. tariff",
    "description": "BRUSSELS (Reuters) -The European Commission dismissed on Monday reports suggesting it was willing to accept a broad U.S. tariff of 10% on EU goods as...",
    "link": "https://uk.finance.yahoo.com/news/eu-dismisses-reports-ready-accept-161746679.html",
    "timestamp": "2025-06-16T16:17:46Z"
  },
  {
    "title": "Eric Trump Mocked for Declaring Trump Mobile Will 'Revolutionize' Cell Phones: 'The White House Is an Infomercial'",
    "description": "Eric Trump's declaration that Trump Mobile will \"revolutionize\" phones sparked ridicule and skepticism.",
    "link": "https://www.ibtimes.com/eric-trump-mocked-declaring-trump-mobile-will-revolutionize-cell-phones-white-house-3775819",
    "timestamp": "2025-06-16T16:17:12Z"
  },
  {
    "title": "‘Trump’s plan is working’: Iran reportedly wants to negotiate after crippling Israeli strikes",
    "description": "On condition America does not join in offensive action against Islamic regime",
    "link": "https://www.wnd.com/2025/06/trumps-plan-is-working-iran-reportedly-wants-to-negotiate-after-crippling-israeli-strikes/",
    "timestamp": "2025-06-16T16:15:57Z"
  },
  {
    "title": "‘They Just Walked Away’: New Poll Shows How Badly Democrats Are Losing Christian Voters of All Stripes",
    "description": "A stunning 75% of Christian voters have little or no trust in the Democratic Party, according to the data shared first with TIME.",
    "link": "https://time.com/7294664/they-just-walked-away-new-poll-shows-how-badly-democrats-are-losing-christian-voters-of-all-stripes/",
    "timestamp": "2025-06-16T16:15:45Z"
  },
  {
    "title": "Trump says 'we can work something out' as he talks trade with Carney at G7 summit",
    "description": "U.S. President Donald Trump sounded an optimistic tone as he sat down with Prime Minister Mark Carney Monday on the sidelines of the G7 summit in Kananaskis, Alta., to discuss tariffs and other trade irritants — saying he thinks the two sides can hammer out a…",
    "link": "https://www.cbc.ca/news/politics/trump-carney-trade-war-1.7562351",
    "timestamp": "2025-06-16T16:15:35Z"
  },
  {
    "title": "G7 Summit in Canada Begins in Shadow of Iran, Ukraine Wars",
    "description": "Leftist Canadian Prime Minister Mark Carney is expecting to welcome a host of world leaders to Kananaskis, Alberta, on Monday for the beginning of the annual G7 Summit – expected to address some of the world’s most pressing emergencies, including the ongoing …",
    "link": "https://freerepublic.com/focus/f-news/4323388/posts",
    "timestamp": "2025-06-16T16:15:18Z"
  },
  {
    "title": "Trump Says Russia And Maybe China Should Join G7",
    "description": "Trump said there “wouldn’t be a war right now” between Russia and Ukraine if Russia was part of the G7.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/16/trump-says-russia-and-maybe-china-should-join-g7/",
    "timestamp": "2025-06-16T16:14:23Z"
  },
  {
    "title": "SRM Stock Soars 580% as Justin Sun's Tron Eyes Nasdaq Debut",
    "description": "The Florida-based theme-park supplier plans on renaming to Tron.",
    "link": "https://decrypt.co/325352/srm-stock-soars-580-justin-suns-tron-eyes-nasdaq-debut",
    "timestamp": "2025-06-16T16:13:56Z"
  },
  {
    "title": "Iran Cries Uncle: Wants to End Israeli Attacks, Negotiate with Trump",
    "description": "Iran has sent messages to both Israel and the United States that it wants to end the war and to negotiate with President Donald Trump, and could give up its nuclear enrichment program to save the Iranian regime.\nThe post Iran Cries Uncle: Wants to End Israeli…",
    "link": "https://www.breitbart.com/middle-east/2025/06/16/iran-cries-uncle-wants-to-end-israeli-attacks-negotiate-with-trump/",
    "timestamp": "2025-06-16T16:13:53Z"
  },
  {
    "title": "TRX surges as SRM Entertainment secures $100M deal to launch TRON treasury",
    "description": "SRM inks $100M deal to launch TRON-based treasury strategy TRX price jumps as reverse merger with SRM gains momentum Justin Sun named advisor as SRM rebrands to Tron Inc. Justin Sun’s Tron (TRX) has recorded a significant price surge in market momentum follow…",
    "link": "https://coinjournal.net/news/trx-surges-as-srm-entertainment-secures-100m-deal-to-launch-tron-treasury/",
    "timestamp": "2025-06-16T16:13:02Z"
  },
  {
    "title": "Trump: 'Iran is not winning this war. They should talk immediately before it's too late'",
    "description": "At G-7 Summit, President Trump urges Iran to negotiate “before it’s too late,” citing Tehran’s failure to act during 60-day deadline amid war with Israel.",
    "link": "https://www.israelnationalnews.com/news/410121",
    "timestamp": "2025-06-16T16:13:00Z"
  },
  {
    "title": "As GOP pushes spending cuts, many say Medicaid and food stamps are underfunded: poll",
    "description": "Americans are more divided on spending around the military and border security.",
    "link": "https://www.bostonherald.com/2025/06/16/poll-government-spending/",
    "timestamp": "2025-06-16T16:12:38Z"
  },
  {
    "title": "G7 leaders want to contain the Israel-Iran conflict, as Trump calls for talks between the countries",
    "description": "The G7 summit in Canada commenced amidst escalating global tensions, particularly concerning the Israel-Iran conflict and Tehran's nuclear ambitions. Leaders, including Trump, Starmer and Merz, are seeking de-escalation, while Trump advocates for direct negot…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g7-leaders-want-to-contain-the-israel-iran-conflict-as-trump-calls-for-talks-between-the-countries/articleshow/121889760.cms",
    "timestamp": "2025-06-16T16:12:36Z"
  },
  {
    "title": "Trump does not intend to sign joint G7 statement on Iran | CNN Politics",
    "description": "President Donald Trump does not intend to sign a joint statement calling for de-escalation between Israel and Iran that had been drafted by G7 leaders in Canada, according to a person familiar with the matter, though officials preparing the document held out …",
    "link": "https://www.cnn.com/2025/06/16/politics/trump-israel-iran-g7-statement",
    "timestamp": "2025-06-16T16:12:32Z"
  },
  {
    "title": "Traces of Toxic Industrial Chemical Found in U.S. Air for the First Time",
    "description": "Medium-chain chlorinated paraffins (MCCPs) are already known to be toxic to aquatic life—now we're finding them in the air.",
    "link": "https://gizmodo.com/traces-of-toxic-industrial-chemical-found-in-u-s-air-for-the-first-time-2000616311",
    "timestamp": "2025-06-16T16:10:52Z"
  },
  {
    "title": "Donald Trump Reacts to Russia and China Being Added to G7",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said Monday at the Group of Seven (G7) Summit in Canada that Russia would not have started its ongoing war with Ukraine if it had been allowed back in the group by previous U.S. and worl…",
    "link": "https://biztoc.com/x/959acc5577b3703d",
    "timestamp": "2025-06-16T16:10:51Z"
  },
  {
    "title": "Trump Org eyes new Trump-branded mobile phone service, complete with gold phones",
    "description": "In the months leading up to Election Day 2024, when Donald Trump was ostensibly focused on his candidacy, the Republican launched a dizzying merchandising campaign, pitching everything from Trump-branded watches to silver Trump commemorative coins, batches of…",
    "link": "https://biztoc.com/x/2460f200e695965d",
    "timestamp": "2025-06-16T16:10:13Z"
  },
  {
    "title": "Sen. Jeff Merkley Blames Trump for MN Lawmaker Shootings: ‘Profoundly Disturbing’",
    "description": "A Democratic senator is placing blame squarely on President Donald Trump for hateful rhetoric that may have inspired a man to shoot two Minnesota lawmakers in their homes over the weekend — one fatally.\nThe post Sen. Jeff Merkley Blames Trump for MN Lawmaker …",
    "link": "https://www.mediaite.com/media/tv/sen-jeff-merkley-blames-trump-for-mn-lawmaker-shootings-profoundly-disturbing/",
    "timestamp": "2025-06-16T16:10:07Z"
  },
  {
    "title": "Wife of Minnesota politician shielded daughter from bullets, says relative",
    "description": "Yvette Hoffman, one of the victims of Saturday's shootings, shielded her daughter from being shot.",
    "link": "https://www.bbc.com/news/articles/c4gdeeqv724o",
    "timestamp": "2025-06-16T16:09:55Z"
  },
  {
    "title": "What to know about the shootings of 2 Minnesota lawmakers and the arrest of suspect Vance Boelter",
    "description": "The search for Boelter was the \"largest manhunt in the state's history,\" Brooklyn Park Police Chief Mark Bruley said.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-the-shootings-of-2-minnesota-lawmakers-and-the-arrest-of-suspect-vance-boelter",
    "timestamp": "2025-06-16T16:09:21Z"
  },
  {
    "title": "Trump says deal with Canada is achievable but 'we have different concepts' on trade",
    "description": "The heads of the world's seven most powerful economies are meeting amid a U.S.-led tariff war and global uncertainty",
    "link": "https://nationalpost.com/news/carney-trump-deal-different-concepts-on-trade",
    "timestamp": "2025-06-16T16:09:02Z"
  },
  {
    "title": "Trump says deal with Canada is achievable but 'we have different concepts' on trade",
    "description": "The heads of the world's seven most powerful economies are meeting amid a U.S.-led tariff war and global uncertainty",
    "link": "https://nationalpost.com/news/canada/carney-trump-deal-different-concepts-on-trade",
    "timestamp": "2025-06-16T16:09:02Z"
  },
  {
    "title": "Singer at Dodger Stadium sings national anthem in Spanish in protest against L.A. immigration raids",
    "description": "Known to fans as Nezza, Dominican American singer Vanessa Hernández's Spanish-language rendition on Saturday reverberated around the stadium — and on social media.",
    "link": "https://www.nbcnews.com/news/latino/singer-dodger-stadium-national-anthem-spanish-nezza-rcna213236",
    "timestamp": "2025-06-16T16:08:45Z"
  },
  {
    "title": "Trump says Iran would ‘like to talk’ about a nuclear deal, claims they’re ‘not winning’ war against Israel",
    "description": "WASHINGTON -- President Trump said Monday that Iran is willing to \"talk\" about limiting its uranium enrichment after Israel destroyed many of Tehran's top officials and above-ground nuclear sites.",
    "link": "https://nypost.com/2025/06/16/world-news/trump-says-iran-would-like-to-talk-about-a-nuclear-deal-claims-theyre-not-winning-war-against-israel/",
    "timestamp": "2025-06-16T16:06:23Z"
  },
  {
    "title": "Donald Trump Announces Wireless Service, Plans for Gold Smartphone",
    "description": "President Donald Trump is getting into the wireless business. The Trump Organization announced Trump Mobile, which will offer 5G service with an unlimited plan (the “47 Plan”) priced at $47.45 per month, per Variety. The president’s two oldest sons, Donald Tr…",
    "link": "https://www.justjared.com/2025/06/16/donald-trump-wireless-service-plans-for-gold-smartphone/",
    "timestamp": "2025-06-16T16:05:41Z"
  },
  {
    "title": "UK and US to begin implementing trade deal ‘very soon,’ says Starmer",
    "description": "The U.K. prime minister told broadcasters he would meet with Donald Trump for a one-on-one later on Monday.",
    "link": "https://www.politico.eu/article/uk-and-us-to-begin-implementing-trade-deal-very-soon-says-starmer/",
    "timestamp": "2025-06-16T16:05:34Z"
  },
  {
    "title": "Texas Man With Two US Citizen Children Detained by ICE",
    "description": "\"They took him with handcuffs and a chain,\" his wife, Laura Rodriguez, told Newsweek.",
    "link": "https://www.newsweek.com/texas-man-us-citzen-children-detained-ice-2086161",
    "timestamp": "2025-06-16T16:05:07Z"
  },
  {
    "title": "Trump fires Democratic appointee from Nuclear Regulatory Commission (Politico)",
    "description": "Politico:\nTrump fires Democratic appointee from Nuclear Regulatory Commission  —  NRC commissioner Christopher Hanson's dismissal comes as the White House has sought control over independent agencies.  —  President Donald Trump has terminated Commissioner Chr…",
    "link": "https://www.memeorandum.com/250616/p64",
    "timestamp": "2025-06-16T16:05:01Z"
  }
]