[
  {
    "title": "Trump Warns 'Handful of Communist, Radical Judges' Are Trying to Assume Powers Belonging Solely to POTUS",
    "description": "President Donald Trump warns that \"a handful of communist, radical judges\" are destroying the Constitution's balance of power.",
    "link": "https://www.westernjournal.com/trump-warns-handful-communist-radical-judges-trying-assume-powers-belonging-solely-potus/",
    "timestamp": "2025-04-30T13:03:58Z"
  },
  {
    "title": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt business",
    "description": "The January-March expansion was the slowest in almost three years.",
    "link": "https://www.bostonherald.com/2025/04/30/us-economy-shrinks-trade-wars/",
    "timestamp": "2025-04-30T13:02:29Z"
  },
  {
    "title": "Africa's Minerals Will Shape the Future of Global Power",
    "description": "As the US-China rivalry intensifies, both powers are courting mineral-rich African countries in an effort to secure critical raw materials. Translating Africa's vast natural-resource wealth into lasting development requires an infrastructure-led strategy that…",
    "link": "https://www.project-syndicate.org/commentary/race-for-african-minerals-could-determine-who-wins-us-china-tech-rivalry-by-otaviano-canuto-and-sabrine-emran-2025-04",
    "timestamp": "2025-04-30T13:00:36Z"
  },
  {
    "title": "Why Trump, at the 100-day mark, is relying so heavily on gaslighting",
    "description": "Donald Trump won’t course-correct if he embraces an alternate reality in which he’s already on the right track.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-100-day-mark-relying-heavily-gaslighting-rcna203670",
    "timestamp": "2025-04-30T13:00:12Z"
  },
  {
    "title": "U.S. economy shrank 0.3% in the first quarter as Trump policy uncertainty weighed on businesses (Jeff Cox/CNBC)",
    "description": "Jeff Cox / CNBC:\nU.S. economy shrank 0.3% in the first quarter as Trump policy uncertainty weighed on businesses  —  The U.S. economy contracted in the first three months of 2025, fueling recession fears at the start of President Donald Trump's second term in…",
    "link": "https://www.memeorandum.com/250430/p25",
    "timestamp": "2025-04-30T13:00:06Z"
  },
  {
    "title": "Trump, Who Owes His Freedom To Due Process, Is Destroying It for Everyone Else",
    "description": "Donald Trump owes his presidency and freedom to due process. Now, he says America can’t give everyone a trial — no matter what the Constitution says.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-due-process-freedom-presidency-everyone-else-1235327264/",
    "timestamp": "2025-04-30T13:00:00Z"
  },
  {
    "title": "The Process Due Illegal Immigrants Is Deportation",
    "description": "If you break a system, you can’t be upset when fixing that system requires a solution that’s outside the normal operation of the system. Congressional... Read More\nThe post The Process Due Illegal Immigrants Is Deportation appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/30/due-process-illegals-is-deportation-abrego-garcia/",
    "timestamp": "2025-04-30T13:00:00Z"
  },
  {
    "title": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt business",
    "description": "The U.S. economy shrank at a 0.3% annual pace from January through March, the first drop in three years",
    "link": "https://www.shawlocal.com/news/2025/04/30/us-economy-shrinks-03-in-first-quarter-as-trump-trade-wars-disrupt-business/",
    "timestamp": "2025-04-30T12:59:33Z"
  },
  {
    "title": "Gold prices decline by Rs 900 to Rs 98,550/10 g in Delhi on Akshaya Tritiya",
    "description": "Gold prices in Delhi fell by Rs 900 to Rs 98,550 per 10 grams due to weak global trends, though Akshaya Tritiya buying limited the decline. Jewellers anticipate a 35% increase in sales value, driven by high prices, while volume remains steady. Silver also slu…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-decline-by-rs-900-to-rs-98550/10-g-in-delhi-on-akshaya-tritiya/articleshow/120766405.cms",
    "timestamp": "2025-04-30T12:58:52Z"
  },
  {
    "title": "Ontario, Prairies prevented Liberals from an election-night majority blowout",
    "description": "The Liberals rose from the ashes under Prime Minister Mark Carney in a stunning reversal of fortunes this year, but the party's failure to sweep many of the ridings it sought Monday night denied it a resounding majority mandate.",
    "link": "https://www.nationalobserver.com/2025/04/30/news/ontario-prairies-prevented-liberals-election-night-majority-blowout",
    "timestamp": "2025-04-30T12:58:46Z"
  },
  {
    "title": "U.S. Economy Shrinks 0.3% In First Quarter As Trump Trade Wars Disrupt Business",
    "description": "Trump's erratic trade policies — including 145% tariffs on China — have paralyzed businesses and threatened to raise prices and hurt consumers.",
    "link": "https://www.huffpost.com/entry/us-economy-shrinks-trump-trade-wars_n_68121d86e4b03062c8917381",
    "timestamp": "2025-04-30T12:58:00Z"
  },
  {
    "title": "Trump seeks to reshape how schools discipline students",
    "description": "A new executive order would create new guidelines on school discipline, suggesting the current ones are ‘discriminatory.’",
    "link": "https://theconversation.com/trump-seeks-to-reshape-how-schools-discipline-students-255377",
    "timestamp": "2025-04-30T12:57:43Z"
  },
  {
    "title": "US economy shrinks 0.3% in first quarter as Trump trade wars disrupt business",
    "description": "The economy was slowed by a surge in imports as companies in the United States tried to bring in foreign goods before President Trump imposed massive tariffs.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_fba18eee-f908-57b3-bf48-185fce05f4fc.html",
    "timestamp": "2025-04-30T12:57:00Z"
  },
  {
    "title": "'This is a problem!' CNN host confronts conservative over Trump contradicting his own DOJ",
    "description": "CNN's Kate Bolduan challenged a conservative commentator who downplayed president Donald Trump's comments about a man who was mistakenly deported to El Salvador.The president said in an interview that he had the ability to help return Kilmar Abrego Garcia fro…",
    "link": "https://www.rawstory.com/trump-2671871420/",
    "timestamp": "2025-04-30T12:56:10Z"
  },
  {
    "title": "Stupid Hitler, Emphasis On The Stupid, Really Thinks That Kilmar Photoshop He Posted Is Real",
    "description": "Or he's just a lying Nazi who hates immigrants like Hitler hated Jews. Or both.",
    "link": "https://www.wonkette.com/p/stupid-hitler-emphasis-on-the-stupid",
    "timestamp": "2025-04-30T12:55:15Z"
  },
  {
    "title": "Commerce Secretary Denies Jobs Coming ‘Back’ to America Will Just Be for Robots",
    "description": "Howard Lutnick made it clear he's seen the AI jokes about Americans in factories.",
    "link": "https://gizmodo.com/commerce-secretary-denies-jobs-coming-back-to-america-will-just-be-for-robots-2000595978",
    "timestamp": "2025-04-30T12:55:05Z"
  },
  {
    "title": "Trump and Bukele's Concentration Camp (Andrea Pitzer/New York Magazine)",
    "description": "Andrea Pitzer / New York Magazine:\nTrump and Bukele's Concentration Camp  —  CECOT is no regular prison.  It is also a warning.  —  Like Donald Trump, Nayib Bukele ran for president by vowing to use extreme methods to punish those he deems terrorists.  Though…",
    "link": "https://www.memeorandum.com/250430/p24",
    "timestamp": "2025-04-30T12:55:00Z"
  },
  {
    "title": "IDF Called in to Battle Flames as Wildfires Rage Near Jerusalem",
    "description": "The Israel Defense Forces (IDF) joined the battle against a series of wildfires near Jerusalem on Wednesday as high winds drove the blazes toward major roads and population centers, with people forced to evacuate.\nThe post IDF Called in to Battle Flames as Wi…",
    "link": "https://www.breitbart.com/environment/2025/04/30/idf-called-in-to-battle-flames-as-wildfires-rage-near-jerusalem/",
    "timestamp": "2025-04-30T12:54:37Z"
  },
  {
    "title": "Chip designer MediaTek unable to give full-year outlook given tariff uncertainty",
    "description": "MediaTek’s CEO withheld full-year earnings guidance due to US tariff uncertainty but remained optimistic amid strong AI demand. While cautious about the second half of 2025, the company expects growth. MediaTek joins other Taiwanese tech firms navigating pote…",
    "link": "https://economictimes.indiatimes.com/tech/technology/chip-designer-mediatek-unable-to-give-full-year-outlook-given-tariff-uncertainty/articleshow/120766281.cms",
    "timestamp": "2025-04-30T12:51:45Z"
  },
  {
    "title": "First 100 days under President Trump: crypto industry faces new challenges and opportunities",
    "description": "SEC and CFTC leadership reshuffled to favour digital asset regulation. Strategic Bitcoin Reserve created, but without new BTC purchases. WLFI stablecoin launch triggered calls for an ethics investigation. The first 100 days of US President Donald Trump’s seco…",
    "link": "https://coinjournal.net/news/first-100-days-under-president-trump-crypto-industry-faces-new-challenges-and-opportunities/",
    "timestamp": "2025-04-30T12:51:45Z"
  },
  {
    "title": "Taiwan unexpectedly raises 2025 full-year GDP forecast on strong tech demand",
    "description": "Taiwan raised its 2025 growth forecast to 3.6% after strong Q1 performance driven by booming tech exports, particularly AI-related demand. Despite US tariff uncertainty, robust production and investment buoyed outlook. Officials remain cautious about H2, but …",
    "link": "https://economictimes.indiatimes.com/tech/technology/taiwan-unexpectedly-raises-2025-full-year-gdp-forecast-on-strong-tech-demand/articleshow/120766278.cms",
    "timestamp": "2025-04-30T12:51:33Z"
  },
  {
    "title": "Trump’s Irish drugs bust could cost America billions",
    "description": "President Trump’s proposed 25% tariff on pharmaceutical imports, largely from Ireland, could raise U.S. drug costs by nearly $51 billion annually, potentially increasing prices by up to 12.9%.",
    "link": "https://www.euractiv.com/section/health-consumers/news/trumps-irish-drugs-bust-could-cost-america-billions/",
    "timestamp": "2025-04-30T12:51:32Z"
  },
  {
    "title": "From the Chinese Exclusion Act to pro-Palestinian activists: The evolution of politically motivated deportations",
    "description": "An immigration historian says removal orders targeting student activists echo America’s long past of jailing and expelling immigrants because of their race, what they say or believe – or all three.",
    "link": "https://theconversation.com/from-the-chinese-exclusion-act-to-pro-palestinian-activists-the-evolution-of-politically-motivated-deportations-254683",
    "timestamp": "2025-04-30T12:51:31Z"
  },
  {
    "title": "Romania’s Donald Trump-Supporting Candidate Leads In Polls Ahead Of Presidential Election",
    "description": "George Simion, the leader of the right-wing Union of Romanians (AUR) party, has emerged as the frontrunner in Romania’s upcoming presidential election, polling reveals. Simion is projected to win the first round of voting on May 4 with approximately 29 percen…",
    "link": "https://freerepublic.com/focus/f-chat/4314159/posts",
    "timestamp": "2025-04-30T12:49:30Z"
  },
  {
    "title": "US economy contracts as Trump tariffs prompt import surge",
    "description": "Annualised first-quarter figure comes below expectations and contrasts with previous growth",
    "link": "https://www.irishtimes.com/business/2025/04/30/us-economy-contracts-as-trump-tariffs-prompt-import-surge/",
    "timestamp": "2025-04-30T12:49:28Z"
  },
  {
    "title": "Has Trump delivered on his promises after 100 days of his second term?",
    "description": "President Trump's second term faces court challenges and unfulfilled pledges, despite his \"promises kept\" mantra. While inflation saw a slight dip, economic concerns persist due to tariffs and stalled trade deals. Immigration policies show mixed results, with…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/has-trump-delivered-on-his-promises-after-100-days-of-his-second-term/articleshow/120766198.cms",
    "timestamp": "2025-04-30T12:49:19Z"
  },
  {
    "title": "Trump’s tariffs loom over the economy as shipments from China fall",
    "description": "By PAUL WISEMAN, ANNE D’INNOCENZIO and CHRISTOPHER RUGABER, Associated Press Business Writers\nWASHINGTON (AP) — American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Do…",
    "link": "https://biztoc.com/x/49355fb757140157",
    "timestamp": "2025-04-30T12:49:00Z"
  },
  {
    "title": "First Solar stock plunges as CEO says Trump tariffs pose ‘significant economic headwind’",
    "description": "First Solar shares plunged on Wednesday, after CEO Mark Widmar said the scale and depth of President Donald Trump's tariffs were unexpected and pose a \"significant economic headwind\" to the company's manufacturing facilities.\nWidmar said the implementation of…",
    "link": "https://biztoc.com/x/ce5994903baec632",
    "timestamp": "2025-04-30T12:48:50Z"
  },
  {
    "title": "Trump’s Newest Executive Order “Unleashes” the Cops—and Flirts With Martial Law",
    "description": "Elie Mystal\n\n\n\nThe new order effectively allows police to get away with murder. And that’s just the beginning.\r\n\n\r\n\n\nThe post Trump’s Newest Executive Order “Unleashes” the Cops—and Flirts With Martial Law appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-executive-order-police-martial-law/",
    "timestamp": "2025-04-30T12:48:31Z"
  },
  {
    "title": "Kamala Harris plans to take on Trump in first major speech since leaving office — but it'll cost you to watch",
    "description": "Emerge, a training organization that seeks to prepare Democratic women to run for office, is charging $25 for viewers to gain access to the virtual livestream of the event.",
    "link": "https://www.foxnews.com/politics/kamala-harris-plans-take-trump-first-major-speech-since-leaving-office-itll-cost-you-watch",
    "timestamp": "2025-04-30T12:47:30Z"
  },
  {
    "title": "Donald Trump's move to cut scientific research may cause recession-like economic damage, claims study",
    "description": "Economists have warned that such cuts could undermine U.S. competitiveness in areas like vaccine development, artificial intelligence and quantum computing, and could slow growth in income and productivity in the long term.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-move-to-cut-scientific-research-may-cause-recession-like-economic-damage-claims-study/articleshow/120766083.cms",
    "timestamp": "2025-04-30T12:47:19Z"
  },
  {
    "title": "Rights group urges US and other governments to hold Venezuela's Maduro accountable for repression",
    "description": "A global human rights watchdog is urging the United States and other governments to bolster their support for people seeking democratic change in Venezuela",
    "link": "https://abcnews.go.com/International/wireStory/rights-group-urges-us-governments-hold-venezuelas-maduro-121304708",
    "timestamp": "2025-04-30T12:46:22Z"
  },
  {
    "title": "Court Documents Prove Incomprehensivle Abuse and Neglect of J6 Prisoner Ryan Samsel – Today Ryan Tells His Story",
    "description": "Recently, photos of me in what is called a hard cell have gone viral. A post tagged Attorney General Pam Bondi and asked where the justification is in this and why there are not Democrats living like this.\nThe post Court Documents Prove Incomprehensivle Abuse…",
    "link": "https://www.thegatewaypundit.com/2025/04/court-documents-prove-incomprehensivle-abuse-neglect-j6-prisoner/",
    "timestamp": "2025-04-30T12:45:41Z"
  },
  {
    "title": "Democrats question Customs and Border Protection tactics at points of entry",
    "description": "A green card holder detained on return to the United States and denied access to medications.",
    "link": "https://www.nbcnews.com/news/latino/border-agents-tactics-ports-entry-democrats-question-rcna203585",
    "timestamp": "2025-04-30T12:45:23Z"
  },
  {
    "title": "US private sector hiring cools sharply amid tariff uncertainty",
    "description": "US private sector hiring cooled markedly last month, according to data from payroll firm ADP published Wednesday, as uncertainty around President Donald Trump's tariff rollout complicated hiring decisions. The data covers the period earlier this month when US…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-private-sector-hiring-cools-sharply-amid-tariff-uncertainty/articleshow/120765669.cms",
    "timestamp": "2025-04-30T12:43:58Z"
  },
  {
    "title": "Trump tariffs force more automakers to scrap profit guidance",
    "description": "Mounting trade tensions, spearheaded by unpredictable U.S. tariffs, have prompted Stellantis and Mercedes-Benz to retract their profit forecasts, mirroring similar actions by other automakers. The uncertainty is disrupting long-term planning and investment in…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trump-tariffs-force-more-automakers-to-scrap-profit-guidance/articleshow/120766062.cms",
    "timestamp": "2025-04-30T12:43:18Z"
  },
  {
    "title": "US private sector hiring cools sharply amid tariff uncertainty",
    "description": "US private sector hiring experienced a significant slowdown in April, with only 62,000 jobs added, according to ADP data. This figure fell considerably short of market expectations, reflecting employer unease amid policy and consumer uncertainty, particularly…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-private-sector-hiring-cools-sharply-amid-tariff-uncertainty/articleshow/120766034.cms",
    "timestamp": "2025-04-30T12:42:35Z"
  },
  {
    "title": "Market volatility spurred by Trump tariffs was a boost for Europe's banks",
    "description": "UBS, Barclays, Deutsche Bank, and HSBC all reported pre-tax profits above analyst estimates in their first quarters amid market turbulence.",
    "link": "https://www.businessinsider.com/market-volatility-donald-trump-tariffs-ubs-hsbc-deutsche-bank-barclays-2025-4",
    "timestamp": "2025-04-30T12:41:42Z"
  },
  {
    "title": "Facing Trump, Microsoft Vows To Protect Europeans' Data",
    "description": "Microsoft on Wednesday committed to boosting its presence in Europe and protecting European citizens&#039; data against a backdrop of rising &quot;geopolitical volatility&quot;.",
    "link": "https://www.ndtv.com/world-news/facing-trump-microsoft-vows-to-protect-europeans-data-8296172",
    "timestamp": "2025-04-30T12:41:20Z"
  },
  {
    "title": "Trump’s tariffs loom over the economy as shipments from China fall",
    "description": "The president’s taxes on imports seems likely to mean emptier shelves and higher prices, perhaps within weeks.",
    "link": "https://www.denverpost.com/2025/04/30/trump-economy-tariffs-china-shipments/",
    "timestamp": "2025-04-30T12:41:05Z"
  },
  {
    "title": "Trump’s tariffs loom over the economy as shipments from China fall",
    "description": "The president’s taxes on imports seems likely to mean emptier shelves and higher prices, perhaps within weeks.",
    "link": "https://www.bostonherald.com/2025/04/30/trump-economy-tariffs-china-shipments/",
    "timestamp": "2025-04-30T12:41:05Z"
  },
  {
    "title": "Carney's economic blueprint takes center stage amidst Conservative pushback and Trump's shadow",
    "description": "Carney, victorious against Trump's influence, unveils economic reforms amid Conservative scrutiny. He tackles tariffs, housing, and regional divides with trade diversification and housing initiatives. Alberta's demands and economic challenges test his economi…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carneys-economic-blueprint-takes-center-stage-amidst-conservative-pushback-and-trumps-shadow/articleshow/120765932.cms",
    "timestamp": "2025-04-30T12:40:59Z"
  },
  {
    "title": "US economy contracts first time in three years by 0.3% in Q1; Trump's tariffs unleash flood of imports",
    "description": "The US economy faced a contraction in the first quarter. Businesses imported goods to avoid higher costs. This offset President Trump's tariff policy. The GDP decreased by 0.3%. Economists had predicted a 0.3% increase. A surge in the goods trade deficit cont…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-economy-contracts-first-time-in-three-years-by-0-3-in-q1-trumps-tariffs-unleash-flood-of-imports/articleshow/120765957.cms",
    "timestamp": "2025-04-30T12:40:54Z"
  },
  {
    "title": "‘How to Train Your Dragon,’ ‘Lilo & Stitch’ Win China Release Approval Despite Trade Tensions, Report Suggests",
    "description": "“How to Train Your Dragon” and “Lilo & Stitch” are among the latest Hollywood tentpoles to secure coveted Chinese exhibition approvals, signaling that Beijing is keeping the door open for major American releases despite ongoing U.S.-China trade disputes. Walt…",
    "link": "https://variety.com/2025/film/news/how-to-train-your-dragon-lilo-stitch-china-release-1236382447/",
    "timestamp": "2025-04-30T12:40:50Z"
  },
  {
    "title": "First Solar stock plunges as CEO says Trump tariffs pose ‘significant economic headwind’",
    "description": "President Donald Trump's tariffs \"create a significant economic headwind\" for First Solar's plants in India, Malaysia and Vietnam, CEO Mark Widmar said.",
    "link": "https://www.cnbc.com/2025/04/30/first-solar-stock-tumbles-as-trump-tariffs-pose-significant-headwind.html",
    "timestamp": "2025-04-30T12:40:33Z"
  },
  {
    "title": "Gold price forecast: Why did gold fall below $3,300 and what Trump's new China tariffs and upcoming US jobs data mean for gold’s next big move",
    "description": "Gold price forecast: Gold price slipped below $3,300 this week, raising eyebrows across markets. Investors are now closely watching US economic data, the dollar's strength, and Trump’s fresh trade moves. This dip comes after gold's record-breaking rally, but …",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-forecast-why-did-gold-fall-below-3300-and-what-trumps-new-china-tariffs-and-upcoming-us-jobs-data-mean-for-golds-next-big-move/articleshow/120765436.cms",
    "timestamp": "2025-04-30T12:40:16Z"
  },
  {
    "title": "Trump tariff whiplash forces more automakers to scrap profit guidance",
    "description": "In This Article:\nBy Nick Carey\nLONDON (Reuters) -Unable to predict the impact of U.S. President Donald Trump's ever-changing trade war, Stellantis and Mercedes-Benz became the latest automakers on Wednesday to yank their profit guidance citing market uncertai…",
    "link": "https://biztoc.com/x/37eecae1c0dffab6",
    "timestamp": "2025-04-30T12:38:34Z"
  },
  {
    "title": "Microsoft pledges to protect European operations and unveils data center expansion",
    "description": "Microsoft has pledged to fight any U.S. government order to halt data center operations in Europe, as it sought to soothe concerns among European customers that trans-Atlantic tensions would lead to service disruptions",
    "link": "https://abcnews.go.com/Technology/wireStory/microsoft-pledges-protect-european-operations-unveils-data-center-121311340",
    "timestamp": "2025-04-30T12:38:24Z"
  },
  {
    "title": "Microsoft pledges to protect European operations and unveils data center expansion",
    "description": "Microsoft has pledged to fight any U.S. government order to halt data center operations in Europe, as it sought to soothe concerns among European customers that trans-Atlantic tensions would lead to service disruptions",
    "link": "https://abcnews.go.com/Business/wireStory/microsoft-pledges-protect-european-operations-unveils-data-center-121311339",
    "timestamp": "2025-04-30T12:38:24Z"
  },
  {
    "title": "U.S. economy shrank 0.3% in the first quarter as Trump policy uncertainty weighed on businesses",
    "description": "The U.S. economy contracted in the first three months of 2025, fueling recession fears at the start of President Donald Trump's second term in office as he wages a potentially costly trade war.\nGross domestic product, a sum of all the goods and services produ…",
    "link": "https://biztoc.com/x/affe3d1edcad5b67",
    "timestamp": "2025-04-30T12:37:57Z"
  },
  {
    "title": "'Already too late': Hedge fund billionaire, who predicted 2008 financial crisis, gives big warning over Trump tariffs",
    "description": "Ray Dalio, hedge fund billionaire and founder of Bridgewater Associates, has given a big warning over US President Donald Trump's tariffs in a social media post on X. Dalio, who correctly predicted 2008 financial crisis, has warned that the world is on the 'b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-already-too-late-hedge-fund-billionaire-who-predicted-2008-financial-crisis-gives-big-warning-over-trump-tariffs/articleshow/120765460.cms",
    "timestamp": "2025-04-30T12:37:56Z"
  },
  {
    "title": "Pakistan Claims ‘Credible Evidence’ India Is Planning ‘Military Action’ Soon—As Tensions Rise Between Neighbors",
    "description": "Tensions between the two nuclear-armed countries have spiked over the past week, following a deadly attack in the Indian-administered region of Kashmir, where 26 tourists were killed.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/04/30/pakistan-claims-credible-evidence-india-is-planning-military-action-soon-as-tensions-rise-between-neighbors/",
    "timestamp": "2025-04-30T12:37:55Z"
  },
  {
    "title": "Amal Clooney: facing a US travel ban for her cooperation with the ICC in the Netanyahu case",
    "description": "Amal Clooney played a role in lobbying the International Criminal Court to prosecute Netanyahu-Galand for war crimes in Gaza\nThe post Amal Clooney: facing a US travel ban for her cooperation with the ICC in the Netanyahu case appeared first on ProtoThema Engl…",
    "link": "https://en.protothema.gr/2025/04/30/amal-clooney-facing-a-us-travel-ban-for-her-cooperation-with-the-icc-in-the-netanyahu-case/",
    "timestamp": "2025-04-30T12:35:20Z"
  },
  {
    "title": "U.S. economy shrank 0.3% in the first quarter as Trump policy uncertainty weighed on businesses",
    "description": "Gross domestic product was expected to rise at a 0.4% annualized pace in the first quarter, according to the Dow Jones consensus estimate.",
    "link": "https://www.cnbc.com/2025/04/30/gdp-q1-2025-.html",
    "timestamp": "2025-04-30T12:34:53Z"
  },
  {
    "title": "After Much Talk of Seeking a Third Term, Trump Tells Crowd: ‘We Actually Already Served Three’",
    "description": "Trump once again appeared to deny the 2020 election results, telling a Michigan crowd: \"We actually already served three, if you count.\"",
    "link": "https://time.com/7281485/is-trump-seeking-a-third-term-rally-comments-election-denial/",
    "timestamp": "2025-04-30T12:34:39Z"
  },
  {
    "title": "Drittsirkuset: Transcription of Trump 100 day speech Michigan 29th of April 2025",
    "description": "Below is a transcription of president Donald Trump's 100 day speech in Michigan on the 29th of April 2025.",
    "link": "https://cornucopia.se/2025/04/drittsirkuset-transcription-of-trump-100-day-speech-michigan-29th-of-april-2025/",
    "timestamp": "2025-04-30T12:32:22Z"
  },
  {
    "title": "Germany poised to get new conservative chancellor Friedrich Merz",
    "description": "Germany's next chancellor is set to be conservative leader Friedrich Merz after his party, thee Christian Democratic Union, reached a coalition deal with outgoing Chancellor Olaf Scholz’s party, the Social Democrats.",
    "link": "https://www.foxnews.com/world/germany-poised-get-new-conservative-chancellor-friedrich-merz",
    "timestamp": "2025-04-30T12:31:59Z"
  },
  {
    "title": "Does Abrego Garcia have ‘MS-13’ tattooed on his knuckles, as Trump claims?",
    "description": "US president has insisted tattoos prove MS-13 ties, but experts and photos contradict the claim in Abrego Garcia's case.",
    "link": "https://www.aljazeera.com/news/2025/4/30/does-abrego-garcia-have-ms-13-tattooed-on-his-knuckles-as-trump-claims",
    "timestamp": "2025-04-30T12:31:45Z"
  },
  {
    "title": "Exclusive: Lee Zeldin Details 100 Environmental Actions EPA Took to 'Power the American Comeback' Under Trump",
    "description": "Environmental Protection Agency (EPA) Administrator Lee Zeldin detailed 100 environmental actions the agency took to \"power the American comeback\" 100 days into President Donald Trump's second term in office.\nThe post Exclusive: Lee Zeldin Details 100 Environ…",
    "link": "https://www.breitbart.com/politics/2025/04/30/exclusive-epa-chief-lee-zeldin-100-environmental-actions-power-american-comeback/",
    "timestamp": "2025-04-30T12:30:44Z"
  },
  {
    "title": "Trump Rages at ABC’s Terry Moran for ‘Not Being Very Nice’ in Stunning Meltdown: ‘You Come in Here Shooting’",
    "description": "Trump bitterly raged at ABC News anchor Terry Moran for \"not being very nice,\" indignantly complaining throughout an interview about the questions Moran asked.\nThe post Trump Rages at ABC’s Terry Moran for ‘Not Being Very Nice’ in Stunning Meltdown: ‘You Come…",
    "link": "https://www.mediaite.com/tv/trump-rages-at-abcs-terry-moran-for-not-being-very-nice-in-stunning-meltdown-you-come-in-here-shooting/",
    "timestamp": "2025-04-30T12:30:23Z"
  },
  {
    "title": "European Consumers Ready to Drop US Products, ECB Survey Finds",
    "description": "European consumers are prepared to actively move away from US products and services as a result of President Donald Trump’s trade war, according to research by the European Central Bank.",
    "link": "https://financialpost.com/pmn/business-pmn/european-consumers-ready-to-drop-us-products-ecb-survey-finds",
    "timestamp": "2025-04-30T12:30:07Z"
  },
  {
    "title": "Trump tariff whiplash forces more automakers to scrap profit guidance",
    "description": "LONDON (Reuters) -Unable to predict the impact of U.S. President Donald Trump's ever-changing trade war, Stellantis and Mercedes-Benz became the latest...",
    "link": "https://finance.yahoo.com/news/trump-tariff-whiplash-forces-more-122915314.html",
    "timestamp": "2025-04-30T12:29:15Z"
  },
  {
    "title": "'Daily Show' Finds Perfect Metaphor For Trump's 100 Days Back In Office",
    "description": "\"America's doing great. We're doing great,\" host Jordan Klepper sarcastically said.",
    "link": "https://www.huffpost.com/entry/jordan-klepper-donald-trump-100-days-metaphor_n_6811fc8ae4b08ec913f0721e",
    "timestamp": "2025-04-30T12:28:38Z"
  },
  {
    "title": "Tech sector cautiously optimistic; cost pressures may spur opportunities: HCL Group's Roshni Nadar",
    "description": "HCL Chairperson Roshni Nadar Malhotra sees tariff and inflationary pressures in the US as a double-edged sword but believes they offer cost-optimisation opportunities for Indian IT. Despite global trade uncertainties, she remains cautiously optimistic about t…",
    "link": "https://economictimes.indiatimes.com/tech/information-tech/tech-sector-cautiously-optimistic-cost-pressures-may-spur-opportunities-hcl-groups-roshni-nadar/articleshow/120765592.cms",
    "timestamp": "2025-04-30T12:28:05Z"
  },
  {
    "title": "DOGE Is Going Global: Elon Musk Is Inspiring Right-Wing Efforts Abroad to Gut Government Programs",
    "description": "Tech writer and critic Paris Marx discusses the first 100 days of the second Trump administration and the influence of billionaire Elon Musk at the helm of the Department of Government Efficiency, or DOGE, which has slashed government programs and the civil s…",
    "link": "https://www.democracynow.org/2025/4/30/elon_musk_doge_paris_marx",
    "timestamp": "2025-04-30T12:27:27Z"
  },
  {
    "title": "Amal Clooney Could Be Banned from U.S. Under Trump Sanctions over ICC Case Against Netanyahu",
    "description": "Amal Clooney, the British human rights lawyer married to Hollywood star George Clooney, could be banned from the United States because of her work with the International Criminal Court (ICC) targeting Israeli Prime Minister Benjamin Netanyahu, according to a …",
    "link": "https://www.breitbart.com/entertainment/2025/04/30/amal-clooney-could-be-banned-from-u-s-under-trump-sanctions-over-icc-case-against-netanyahu/",
    "timestamp": "2025-04-30T12:27:12Z"
  },
  {
    "title": "Key Trump policy will make controversial issue 'harder for Republicans': ex-GOP lawmaker",
    "description": "President Donald Trump's tariffs could endanger a Republican proposal to generate more revenue to offset the elimination of the federal gasoline tax.The House Transportation and Infrastructure Committee has proposed a $20 annual fee on most passenger cars as …",
    "link": "https://www.rawstory.com/republican-passenger-car-fee/",
    "timestamp": "2025-04-30T12:26:57Z"
  },
  {
    "title": "Social Security Administration Lists Changes Made Under Trump",
    "description": "Many of the reforms have been met with fierce criticism during President Donald Trump's first 100 days back in office.",
    "link": "https://biztoc.com/x/7e629a7ed59c48f8",
    "timestamp": "2025-04-30T12:26:49Z"
  },
  {
    "title": "The Trump Crypto Wallet Pivot Could Trigger a Web3 Boom: Be Ready with Best Wallet Token",
    "description": "Crypto president – of the entire world? Perhaps we all underestimated how much Donald Trump wants to dominate crypto. Even while provoking reciprocal tariffs and spurring major shifts in global trade patterns, the US president is going all-in on crypto. That …",
    "link": "https://bitcoinist.com/trump-crypto-wallet-launching-best-wallet-better-alternative/",
    "timestamp": "2025-04-30T12:25:45Z"
  },
  {
    "title": "Trump's first 100 days target diversity policies, civil rights protections",
    "description": "President Trump's second term has seen a dismantling of diversity and inclusion policies, impacting education, cultural institutions, and economic opportunities for marginalized groups. These actions include revoking equal opportunity mandates, slashing fundi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-first-100-days-target-diversity-policies-civil-rights-protections/articleshow/120765548.cms",
    "timestamp": "2025-04-30T12:25:45Z"
  },
  {
    "title": "Who is Airyn De Niro? Robet De Niro's Daughter Comes Out as Transgender",
    "description": "Airyn De Niro said that \"trans women being honest and open\" helped her with her transition.",
    "link": "https://www.newsweek.com/airyn-de-niro-comes-out-transgender-robert-de-niro-daughter-2066063",
    "timestamp": "2025-04-30T12:25:26Z"
  },
  {
    "title": "White House Embarrassingly Holds ‘Press Briefing’ Full of MAGA Influencers",
    "description": "The Trump administration's slide towards state-sponsored media continues.",
    "link": "https://gizmodo.com/white-house-embarrassingly-holds-press-briefing-full-of-maga-influencers-2000596111",
    "timestamp": "2025-04-30T12:25:11Z"
  },
  {
    "title": "PMQs: Starmer beats Badenoch on grooming gangs",
    "description": "The final joust before Thursday's local elections saw a subject as distressing as child sexual abuse reduced to political back and forth.",
    "link": "https://www.politico.eu/article/pmqs-starmer-beats-badenoch-grooming-gangs-debate/",
    "timestamp": "2025-04-30T12:21:58Z"
  },
  {
    "title": "Common Sense Is Highly Contagious — Except Among Dems",
    "description": "At a town hall meeting last week, Rep. Marie Gluesenkamp Perez — one of the few moderate Democrats left in the world — made a perfectly common-sensical statement: “Americans believe that only U.S. citizens should be determining the outcome of American electio…",
    "link": "https://freerepublic.com/focus/f-chat/4314153/posts",
    "timestamp": "2025-04-30T12:21:53Z"
  },
  {
    "title": "UK conducts precision strikes against Houthi drone site in Yemen",
    "description": "In Commons statement after successful RAF operation Defence Sec John Healey reminds MPs the Houthis targeted ships in Red Sea 'well before the war in Gaza began'",
    "link": "https://www.jewishnews.co.uk/uk-conducts-precision-strikes-against-houthi-drone-site-in-yemen/",
    "timestamp": "2025-04-30T12:21:41Z"
  },
  {
    "title": "AOC Dismisses Republican Promises on Medicaid",
    "description": "Though Republicans have publicly vowed not to cut benefits, past proposals to impose work requirements or cap federal contributions have raised concern.",
    "link": "https://www.newsweek.com/aoc-dismisses-republican-promises-medicaid-2065976",
    "timestamp": "2025-04-30T12:20:27Z"
  },
  {
    "title": "With California Bleeding Cash, Newsom Claims He Does 'DOGE but Better'",
    "description": "California Gov. Gavin Newsom (D) claimed Tuesday that he is doing \"DOGE but better\" as he announced that his state would adopt AI initiatives.\nThe post With California Bleeding Cash, Newsom Claims He Does ‘DOGE but Better’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/30/gavin-newsom-bleeding-cash-claims-he-does-doge-but-better-california-six-years/",
    "timestamp": "2025-04-30T12:19:22Z"
  },
  {
    "title": "'Shark Tank' star insists AOC is a capitalist at heart: 'The best marketeer in politics'",
    "description": "Canadian businessman and star of ABC's \"Shark Tank\" Kevin O'Leary praised far-left lawmaker Rep. Alexandria Ocasio-Cortez for her ability to raise money, calling her a \"capitalist\" at heart but adding her chances of being president are nonexistent.",
    "link": "https://www.foxnews.com/politics/shark-tank-star-insists-aoc-capitalist-heart-the-best-marketeer-politics",
    "timestamp": "2025-04-30T12:19:18Z"
  },
  {
    "title": "I Didn't Recognize Myself After Having 3 Kids In 3 Years. Salvation Came From An Unlikely Place.",
    "description": "\"The contrast has made me rethink what we really need as parents.\"",
    "link": "https://www.huffpost.com/entry/mother-of-three-community-skate-park-connection-lonely-parent_n_6807a759e4b0f03155238cef",
    "timestamp": "2025-04-30T12:18:25Z"
  },
  {
    "title": "Social Security Administration Lists Changes Made Under Trump",
    "description": "Many of the reforms have been met with fierce criticism during President Donald Trump's first 100 days back in office.",
    "link": "https://www.newsweek.com/social-security-administration-lists-changes-made-under-trump-2066027",
    "timestamp": "2025-04-30T12:17:59Z"
  },
  {
    "title": "Trump Takes Victory Lap At 100-Day Celebration Rally In Michigan",
    "description": "Trump's campaign-like rally was to celebrate his second first 100 days in office as he touted his victories on the border crisis and culture issues.",
    "link": "https://dailycaller.com/2025/04/30/donald-trump-michigan-rally-100-days-accomplishments-stephen-miller-border/",
    "timestamp": "2025-04-30T12:17:58Z"
  },
  {
    "title": "President Donald Trump speech to announce new fighter jets to the Michigan National Guard (Youtube Video link)",
    "description": "President Donald Trump speech to announce new fighter jets to the Michigan National Guard0:17 well I guess they think we're going to 0:18 save this place and you know what 0:21 they're right 100% right we're going to 0:23 save it and make it better actually s…",
    "link": "https://freerepublic.com/focus/f-news/4314150/posts",
    "timestamp": "2025-04-30T12:17:13Z"
  },
  {
    "title": "\"Trump Is Trying to Break Us\": Trump Threats to Annex Canada Help Liberal Party Win Critical Election",
    "description": "The Liberal Party in Canada had been massively trailing in the polls. Then it pulled off a victory that seemed impossible just two months ago, largely thanks to one man: President Donald Trump, who repeatedly threatened to make Canada the 51st state. After fo…",
    "link": "https://www.democracynow.org/2025/4/30/canada_election_mark_carney",
    "timestamp": "2025-04-30T12:16:08Z"
  },
  {
    "title": "Can Cambodia get rid of landmines without US help?",
    "description": "The US foreign aid freeze has cast a long shadow over demining efforts in Cambodia. What does Trump's \"America First\" agenda mean for the Asian country?",
    "link": "https://www.dw.com/en/can-cambodia-get-rid-of-landmines-without-us-help/a-72397877",
    "timestamp": "2025-04-30T12:15:00Z"
  },
  {
    "title": "'Maybe they're letting him hang': MSNBC panel stunned by 'awkward' Pete Hegseth decision",
    "description": "A major announcement by Defense Secretary Pete Hegseth that he is canceling the Women Peace and Security program at the Defense Department that was instituted during Donald Trump's first term left an MSNBC panel scratching their heads Wednesday morning.Accord…",
    "link": "https://www.rawstory.com/pete-hegseth-2671871110/",
    "timestamp": "2025-04-30T12:14:10Z"
  },
  {
    "title": "Why Utah Farmers Are Struggling With Mental Health",
    "description": "Farmers are dying by suicide at the third-highest rate by vocation in Utah. But after a federal program offering mental health support ran out of money, the state did not continue it.",
    "link": "https://www.propublica.org/article/utah-farmers-therapy-mental-health-suicide-rates",
    "timestamp": "2025-04-30T12:13:44Z"
  },
  {
    "title": "Trump and the changing face of America’s young evangelicals",
    "description": "‘The cultural and political landscapes are pushing us to reimagine what it means to live out our faith authentically in today’s America’",
    "link": "https://www.dazeddigital.com/life-culture/article/66699/1/donald-trump-young-evangelicals-in-the-us-at-right-now",
    "timestamp": "2025-04-30T12:13:00Z"
  },
  {
    "title": "Euro Emerges as a Safe Haven",
    "description": "The euro is fast establishing itself as a global safe haven currency, affirms the CEO of one of the world’s largest independent financial advisory and asset management organizations. Nigel Green of deVere Group’s comments come as the single currency has surge…",
    "link": "https://www.dubaichronicle.com/2025/04/30/euro-emerges-as-a-safe-haven/",
    "timestamp": "2025-04-30T12:12:58Z"
  },
  {
    "title": "Trump’s Volatility Is Pushing Asia Toward Beijing",
    "description": "But fears over China’s intentions could limit its regional gains.",
    "link": "http://foreignpolicy.com/2025/04/30/trump-china-us-allies-geopolitics-tariffs-trade-war-security-alliances/",
    "timestamp": "2025-04-30T12:12:48Z"
  },
  {
    "title": "Aston Martin limits US car imports due to tariffs",
    "description": "British luxury carmaker Aston Martin Lagonda said Wednesday that it is limiting shipments to the United States after US President Donald Trump slapped 25-percent tariffs on car imports.  Automakers have been among the sectors hardest-hit by Trump’s tariffs on…",
    "link": "https://www.digitaljournal.com/world/aston-martin-limits-us-car-imports-due-to-tariffs/article",
    "timestamp": "2025-04-30T12:12:33Z"
  },
  {
    "title": "More automakers drop earnings guidance over tariffs",
    "description": "Germany’s Mercedes-Benz and US-European group Stellantis, whose brands include Jeep, Peugeot and Fiat, joined other automakers Wednesday in suspending their annual financial guidance because of uncertainty over US tariffs. The announcements came even as US Pr…",
    "link": "https://www.digitaljournal.com/world/more-automakers-drop-earnings-guidance-over-tariffs/article",
    "timestamp": "2025-04-30T12:12:33Z"
  },
  {
    "title": "Canada was poised to elect its own 'Maple MAGA' movement. Then Trump happened.",
    "description": "Canadian Conservatives say they voted for the Mark Carney's Liberal party, with many describing it as a rejection of \"Canada's Trump,\" Pierre Poilievre.",
    "link": "https://www.nbcnews.com/world/canada/canada-was-poised-elect-maple-maga-movement-trump-happened-rcna203645",
    "timestamp": "2025-04-30T12:11:55Z"
  },
  {
    "title": "‘Why Are You Saying Tariffs Are Not In Effect?’ CNN Anchor Battles GOP Congressman Defending Trump Trade War Backlash",
    "description": "CNN's Brianna Keilar pushed back on Dan Meuser after he downplayed the economic effect of President Donald Trump's tariffs.\nThe post ‘Why Are You Saying Tariffs Are Not In Effect?’ CNN Anchor Battles GOP Congressman Defending Trump Trade War Backlash first ap…",
    "link": "https://www.mediaite.com/tv/why-are-you-saying-tariffs-are-not-in-effect-cnn-anchor-battles-gop-congressman-defending-trump-trade-war-backlash/",
    "timestamp": "2025-04-30T12:11:22Z"
  }
]