[
  {
    "title": "EU Chief Says Pressure Off For Lower Russia Oil Price Cap",
    "description": "EU Commission Chief Ursula von der Leyen on Tuesday said surging energy prices have reduced the urgency to slash the price cap on Russia's global oil exports.",
    "link": "https://www.ibtimes.com/eu-chief-says-pressure-off-lower-russia-oil-price-cap-3776017",
    "timestamp": "2025-06-17T20:15:20Z"
  },
  {
    "title": "Trump's Own Staff Don't Think He's Fit to Be President (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nTrump's Own Staff Don't Think He's Fit to Be President … Dissent against Donald Trump is bubbling within his administration—but people are too scared to act on it.  —  Some White House staffers no longer believe that …",
    "link": "https://www.memeorandum.com/250617/p131",
    "timestamp": "2025-06-17T20:15:00Z"
  },
  {
    "title": "Trump Allies Falsely Link Democrats to Minnesota Shooting Suspect—Despite His Pro-Trump Views",
    "description": "Several right-wing voices have falsely cast blame on Democrats for the violence, despite the suspect’s apparent support for the President.",
    "link": "https://time.com/7295227/minnesota-shooting-marxism-utah-senator/",
    "timestamp": "2025-06-17T20:14:47Z"
  },
  {
    "title": "Anti-domestic violence groups sue Trump DOJ over anti-diversity restrictions",
    "description": "The National Women's law center has filed a suit against the Department of Justice that claims new restrictions on grants are illegal.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-doj-lawsuit-national-womens-law-center-rcna213554",
    "timestamp": "2025-06-17T20:14:28Z"
  },
  {
    "title": "Is Israel trying to destroy Iran’s nukes — or topple its government?",
    "description": "Iran’s state broadcaster, which was bombed mid-broadcast by Israel on Monday, was many things to many people. It was the employer of hundreds of journalists, some of whom were injured in the attack, prompting protests from press freedom organizations. It was …",
    "link": "https://www.vox.com/world-politics/417111/israel-iran-nuclear-bomb-regime-change",
    "timestamp": "2025-06-17T20:14:25Z"
  },
  {
    "title": "Israel-Iran conflict: List of key events, June 17, 2025",
    "description": "Here are the key events on day five of the Israel-Iran conflict.",
    "link": "https://www.aljazeera.com/news/2025/6/17/israel-iran-conflict-list-of-key-events-june-17-2025",
    "timestamp": "2025-06-17T20:13:19Z"
  },
  {
    "title": "FOX NEWS CHANNEL’S ‘ARMY 250 PARADE’ COVERAGE IS NUMBER ONE ON TELEVISION ON SATURDAY, JUNE 14",
    "description": "‘Army 250 Parade’ Peaks with 5.5 Million Viewers in the 8 PM Hour, Leading All Broadcast Programs Including NBC’s Coverage of the U.S. Open NEW YORK – June 17, 2025 – FOX News Channel’s Army 250 Parade coverage was the number one cable program on Saturday, Ju…",
    "link": "https://press.foxnews.com/2025/06/fox-news-channels-army-250-parade-coverage-is-number-one-on-television-on-saturday-june-14",
    "timestamp": "2025-06-17T20:11:23Z"
  },
  {
    "title": "Trump Says Iran 'Very Close' to Having Nuclear Weapon",
    "description": "US President Donald Trump tells reporters onboard Air Force One that Iran was \"very close\" to being able to make a nuclear weapon Trump said his early departure from the G7 meeting has \"nothing to do\" with working on a ceasefire between Israel and Iran, addin…",
    "link": "https://biztoc.com/x/645dc8ae4fd34535",
    "timestamp": "2025-06-17T20:11:11Z"
  },
  {
    "title": "White House Punts 'Big, Beautiful Bill' Deadline",
    "description": "President Donald Trump had previously set a July 4 deadline for Congress to pass his sweeping tax and spending package.",
    "link": "https://www.newsweek.com/trump-big-beautiful-budget-bill-house-senate-deadline-2086994",
    "timestamp": "2025-06-17T20:11:05Z"
  },
  {
    "title": "US closes lower as Iran conflict, weak data shake markets",
    "description": "US markets closed lower on Tuesday as escalating conflict between Iran and Israel and disappointing retail data unnerved investors.Market sentiment soured after President Donald Trump issued threats t...",
    "link": "https://biztoc.com/x/b8ec8525f1d499a7",
    "timestamp": "2025-06-17T20:10:52Z"
  },
  {
    "title": "Bitcoin, Ethereum, XRP, Dogecoin Drop As Middle East Tensions Rise: Will BTC Still Hit $130K By October?",
    "description": "Cryptocurrencies are trading sharply lower amid rising geopolitical tensions. Fears of a broader Middle East conflict escalated after President Donald Trump hinted at a possible U.S. involvement in the Iran-Israel conflict. As global markets reel from rising …",
    "link": "https://biztoc.com/x/70402429d35bbedd",
    "timestamp": "2025-06-17T20:10:49Z"
  },
  {
    "title": "A split forms in MAGA world as Trump weighs next steps on Iran, with some top stars rebuking him",
    "description": "Some longtime defenders of the president’s America First mantra are calling him out for weighing a greater U.S. role in the region.",
    "link": "https://www.bostonherald.com/2025/06/17/trump-iran-maga/",
    "timestamp": "2025-06-17T20:10:27Z"
  },
  {
    "title": "How high can US debt go before it triggers a financial crisis?",
    "description": "US government debt is soaring and foreign investors are getting nervous. We don’t really know where the tipping point is.",
    "link": "https://theconversation.com/how-high-can-us-debt-go-before-it-triggers-a-financial-crisis-258812",
    "timestamp": "2025-06-17T20:09:23Z"
  },
  {
    "title": "Trump Team Is Already Lying About Detention of NYC Mayoral Candidate",
    "description": "Masked ICE agents detained New York City Comptroller Brad Lander Tuesday. But rather than focus on the fact that federal agents are targeting American citizens, government accounts worked to add their own spin to the situation, trying to make Lander appear gu…",
    "link": "https://newrepublic.com/post/196927/donald-trump-lying-arrest-new-york-mayor-candidate-brad-lander",
    "timestamp": "2025-06-17T20:07:57Z"
  },
  {
    "title": "Trump tax bill would widen deficits by $2.8T after factoring in economic impacts, CBO says",
    "description": "The analysis comes as Trump pushes Congress to send the final product to his desk to become law by Fourth of July.",
    "link": "https://www.bostonherald.com/2025/06/17/trump-tax-bill/",
    "timestamp": "2025-06-17T20:06:20Z"
  },
  {
    "title": "Mike Lindell Declares Victory After Crushing Trial Defeat",
    "description": "A jury ruled Mike Lindell defamed former Dominion Voting Systems executive Eric Coomer and ordered the MyPillow CEO to pay $2 million in damages.",
    "link": "http://www.rollingstone.com/politics/politics-news/mike-lindell-declares-victory-after-defamation-defeat-1235366934/",
    "timestamp": "2025-06-17T20:06:09Z"
  },
  {
    "title": "Airbus strikes Vietjet deal at Paris Air Show, hopes for tariff rollback",
    "description": "US Transportation Secretary Sean Duffy said he wanted a return to a tariff-free agreement for civil aviation.",
    "link": "https://www.aljazeera.com/economy/2025/6/17/airbus-strikes-vietjet-deal-at-paris-air-show-hopes-for-tariff-rollback",
    "timestamp": "2025-06-17T20:04:56Z"
  },
  {
    "title": "CNN Data Guru Warns Republicans of ‘Big Beautiful Election Night’ For Dems If They Pass Trump’s Budget Bill",
    "description": "\"So if this is the big, beautiful bill—and maybe a big, beautiful bill for Democrats, if it passes,\" Enten said on CNN Tuesday\nThe post CNN Data Guru Warns Republicans of ‘Big Beautiful Election Night’ For Dems If They Pass Trump’s Budget Bill first appeared …",
    "link": "https://www.mediaite.com/politics/cnn-data-guru-warns-republicans-of-big-beautiful-election-night-for-dems-if-they-pass-trumps-budget-bill/",
    "timestamp": "2025-06-17T20:04:49Z"
  },
  {
    "title": "Musk’s xAI Burns Through $1 Billion a Month as Costs Pile Up",
    "description": "Elon Musk’s artificial intelligence startup xAI is burning through $1 billion a month as the cost of building its advanced AI models races ahead of the limited revenues, according to people briefed on the company’s financials.",
    "link": "https://www.livemint.com/companies/news/musks-xai-burns-through-1-billion-a-month-as-costs-pile-up-11750190671603.html",
    "timestamp": "2025-06-17T20:04:31Z"
  },
  {
    "title": "‘An Abortion Saved My Life After I Got Leukemia’",
    "description": "Mom Abby Blum tells why she was forced her to end her much-wanted pregnancy. She warns that an unexpected tragic event can happen to any woman—even if they think they'll never need an abortion.\n\"It felt like an impossible choice, but I decided to go ahead and…",
    "link": "https://msmagazine.com/2025/06/17/abortion-leukemia-chemotherapy-women-abortion-ban-new-york-texas/",
    "timestamp": "2025-06-17T20:04:19Z"
  },
  {
    "title": "Wise Trump Suggests Cutting The Temple Mount In Half",
    "description": "WASHINGTON, D.C. — Continuing his quest to bring peace to the Middle East and permanently quell hostilities between Jews and Muslims, President Donald Trump wisely suggested cutting the Temple Mount in half.",
    "link": "https://babylonbee.com/news/wise-trump-suggests-cutting-the-temple-mount-in-half",
    "timestamp": "2025-06-17T20:03:24Z"
  },
  {
    "title": "The Trump Phone Will Cost You $499. Here's What You Get and What We Don't Know Yet",
    "description": "The president's son Eric says the phone will be made in the US \"eventually.\"",
    "link": "https://www.cnet.com/tech/mobile/the-trump-phone-will-cost-you-499-heres-what-you-get-and-what-we-dont-know-yet/",
    "timestamp": "2025-06-17T20:02:00Z"
  },
  {
    "title": "‘One of The Most Hated Men in the World’: How World Leaders Learned to Disdain Trump All Over Again",
    "description": "Veteran journalist and author Alan Friedman joined Mediaite’s Press Club this week to deliver a sweeping — and searing — diagnosis of America’s decline, placing the blame on decades of bipartisan failure and the accelerating threat posed by President Donald T…",
    "link": "https://www.mediaite.com/media/podcasts/one-of-the-most-hated-men-in-the-world-how-world-leaders-learned-to-disdain-trump-all-over-again/",
    "timestamp": "2025-06-17T20:01:28Z"
  },
  {
    "title": "Fifa criticised over lack of anti-racism messaging",
    "description": "Campaigners criticise Fifa after it appeared to drop anti-racism messaging at the Club World Cup, with some suggesting it may be connected to the policies of US President Donald Trump.",
    "link": "https://www.bbc.com/sport/football/articles/c5y78xzwg6ko",
    "timestamp": "2025-06-17T20:01:08Z"
  },
  {
    "title": "The biggest fear was that AI would steal our jobs. In reality, it’s replacing those of people who are learning how to work.",
    "description": "As thousands of young graduates prepare to take their first steps on the job market, an unexpected obstacle stands in their way: artificial intelligence. The technological promise that was supposed to relieve us of repetitive tasks seems, paradoxically, to be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4323654/posts",
    "timestamp": "2025-06-17T20:00:18Z"
  },
  {
    "title": "U.S. Steel Tariffs Add Uncertainty to Global Economy",
    "description": "Via Metal Miner The European Commission (EC) has expressed concern about Donald Trump’s announcement of plans to double import tariffs on steel. The U.S. President proclaimed the new “Trump Tariffs” during a speech at US Steel’s Mon Valley-Irwin works in Penn…",
    "link": "https://oilprice.com/Metals/Commodities/US-Steel-Tariffs-Add-Uncertainty-to-Global-Economy.html",
    "timestamp": "2025-06-17T20:00:00Z"
  },
  {
    "title": "Trump Has the Only Vote That Matters on the Big Beautiful Bill",
    "description": "Trump has the only vote that matters on the Big Beautiful Bill. All the yelling and screaming among Republicans on provisions from Medicaid cuts to SALT will matter only up until the moment Trump says it’s time to vote.",
    "link": "http://nymag.com/intelligencer/article/trump-has-only-vote-that-matters-on-the-big-beautiful-bill.html",
    "timestamp": "2025-06-17T20:00:00Z"
  },
  {
    "title": "Joe Rogan regular Dave Smith makes U-turn on Trump support and calls for president’s impeachment",
    "description": "Comedian Smith is a frequent guest on ‘The Joe Rogan Experience’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/joe-rogan-trump-impeachment-dave-smith-b2771765.html",
    "timestamp": "2025-06-17T19:59:58Z"
  },
  {
    "title": "Donald Trump calls Iran’s leader an ‘easy target’ amid conflict with Israel",
    "description": "The Trump administration has said the US would not rule out 'further action' against Iran to prevent nuclear enrichment.",
    "link": "https://www.aljazeera.com/news/2025/6/17/donald-trump-calls-irans-leader-an-easy-target-amid-conflict-with-israel",
    "timestamp": "2025-06-17T19:59:22Z"
  },
  {
    "title": "Israel’s spy agency used AI and smuggled-in drones to prepare attack on Iran",
    "description": "The attack built off knowledge Israel gained during a wave of airstrikes last October.",
    "link": "https://www.bostonherald.com/2025/06/17/how-israel-stunned-iran/",
    "timestamp": "2025-06-17T19:59:21Z"
  },
  {
    "title": "Who is Ayatollah Ali Khamenei? Once dismissed as weak, here's how Iran Supreme Leader becomes most wanted man in earth by USA, Israel",
    "description": "Iran Supreme Leader Ayatollah Ali Khamenei has ruled since 1989 dominated successive elected presidents and promoted nuclear technology that has unnerved the surrounding region.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-ayatollah-ali-khamenei-once-dismissed-as-weak-heres-how-iran-supreme-leader-becomes-most-wanted-man-in-earth-by-usa-israel/articleshow/121917199.cms",
    "timestamp": "2025-06-17T19:57:22Z"
  },
  {
    "title": "Trump’s sons say his new phone will be built in the US. Experts say it looks a lot like a phone from China",
    "description": "Experts are skeptical that a smartphone can be built in the US based on the specifications, price and timeline laid out by Donald Trump, Jr., and Eric Trump when they announced the phone.",
    "link": "https://www.cnn.com/2025/06/17/tech/trump-mobile-t1-phone-built-in-us-experts-china",
    "timestamp": "2025-06-17T19:57:04Z"
  },
  {
    "title": "B.C. mining company cuts 140 positions due to 'challenging market conditions'",
    "description": "Glencore-owned Elk Valley Resources, which operates four steelmaking coal mines in B.C.'s southeast along the Alberta border, said it is cutting 140 staff jobs.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/elk-valley-resources-cuts-140-positions-1.7563514",
    "timestamp": "2025-06-17T19:56:16Z"
  },
  {
    "title": "Trump Threats Push Crude to 5-Month High",
    "description": "Oil surged to nearly $75 as Trump hinted at military action against Iran, stoking fears of supply disruptions.",
    "link": "https://www.rigzone.com/news/wire/trump_threats_push_crude_to_5month_high-17-jun-2025-180867-article/",
    "timestamp": "2025-06-17T19:53:20Z"
  },
  {
    "title": "Political violence thrusts 2028 candidates onto the national stage",
    "description": "More than a half-dozen potential 2028 contenders have personally experienced political violence or had to manage the response to such incidents.",
    "link": "https://www.nbcnews.com/politics/2028-election/political-violence-thrusts-2028-candidates-national-stage-rcna213289",
    "timestamp": "2025-06-17T19:52:50Z"
  },
  {
    "title": "WATCH: Jim Acosta invokes Trump’s deceased ex-wife in rant about immigration raids",
    "description": "'Hey, how many immigrants has he married? He's got one buried at his golf course in New Jersey!'",
    "link": "https://www.wnd.com/2025/06/watch-jim-acosta-invokes-trumps-deceased-ex-wife/",
    "timestamp": "2025-06-17T19:52:40Z"
  },
  {
    "title": "Tulsi Gabbard Has Been Blown Off by Trump",
    "description": "Trump is ignoring his own administration’s intelligence and appears to be listening to Israel as he considers whether or not to join the war against Iran.",
    "link": "http://nymag.com/intelligencer/article/trump-tulsi-gabbard-rain-israel-nuclear-weapon.html",
    "timestamp": "2025-06-17T19:49:02Z"
  },
  {
    "title": "Trump family unveils Trump Mobile with a flashy $500 gold smartphone",
    "description": "Trump family unveils Trump Mobile with a flashy $500 gold smartphone\nDonald Trump's sons unveiled a new service called Trump Mobile on Monday. Among the new offerings will be a $500 gold-colored smartphone.\nDonald Trump's sons unveiled a new service called Tr…",
    "link": "https://biztoc.com/x/3bb9a4e013e1989b",
    "timestamp": "2025-06-17T19:48:39Z"
  },
  {
    "title": "National Security Adv: Iran op. won't end before Fordow is struck",
    "description": "National Security Adviser Tzachi Hanegbi says he does not know if the US will participate in the operation in Iran, but 'the plan is blue and white, including all elements of the offensive.'",
    "link": "https://www.israelnationalnews.com/news/410199",
    "timestamp": "2025-06-17T19:47:53Z"
  },
  {
    "title": "Democratic Crypto Supporters To Offer Belated Push For Presidential Crypto Ban",
    "description": "Sen. Adam Schiff (D-Calif.) plans to introduce a new bill banning presidents from issuing crypto, but not before the Senate passes a crypto bill that omitted similar language.",
    "link": "https://www.huffpost.com/entry/adam-schiff-crypto-corruption-bill_n_6851b2b1e4b025ec9a1a80eb",
    "timestamp": "2025-06-17T19:46:36Z"
  },
  {
    "title": "Israel: We Are Hitting Fordow, With or Without U.S., Bunker-Busters",
    "description": "Israel's national security adviser, Tzachi Hanegbi, said Tuesday that Israel will not stop fighting the war before it has damaged Iran's Fordow (or Fordo) nuclear facility, which is buried deep within a mountain.\nThe post Israel: We Are Hitting Fordow, With o…",
    "link": "https://www.breitbart.com/middle-east/2025/06/17/israel-we-are-hitting-fordow-with-or-without-u-s-bunker-busters/",
    "timestamp": "2025-06-17T19:46:08Z"
  },
  {
    "title": "Citizen Fundraisers Outpace E.U. in Arming Ukraine Against Russia",
    "description": "While the E.U. has fallen short on arms pledges, grassroots fundraisers and independent initiatives have delivered millions of dollars in munitions and supplies to Ukraine.",
    "link": "https://reason.com/2025/06/17/citizen-fundraisers-outpace-e-u-in-arming-ukraine-against-russia/",
    "timestamp": "2025-06-17T19:45:33Z"
  },
  {
    "title": "Senate GOP Favors Round-The-Clock Power Over Solar and Wind",
    "description": "The Senate’s tax bill would boost baseload electricity — including nuclear and geothermal power — while slashing incentives for intermittent sources.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-gop-favors-round-the-clock-power-over-solar-and-wind",
    "timestamp": "2025-06-17T19:44:53Z"
  },
  {
    "title": "MAGA Is at War With Itself Over Iran",
    "description": "And Donald Trump is caught in the middle.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/trump-iran-israel-maga/683211/",
    "timestamp": "2025-06-17T19:44:15Z"
  },
  {
    "title": "'Warning!' Ex-Panamanian president's visa pulled after criticizing Trump deal",
    "description": "The Trump administration has revoked the U.S. visas of former Panamanian President Martin Torrijos, as well as Panamanian presidential candidate Ricardo Lombana, according to The New York Times.Torrijos made the announcement at a news conference Monday aftern…",
    "link": "https://www.rawstory.com/panama-canal-2672387050/",
    "timestamp": "2025-06-17T19:43:03Z"
  },
  {
    "title": "Trump family unveils Trump Mobile with a flashy $500 gold smartphone",
    "description": "Donald Trump's sons unveiled a new Trump Mobile service on Monday. Among the new offerings will be a $500 gold-colored smartphone.",
    "link": "https://www.businessinsider.com/trump-family-unveils-trump-mobile-flashy-499-gold-smartphone-2025-6",
    "timestamp": "2025-06-17T19:42:16Z"
  },
  {
    "title": "Ilhan Omar claims US turning into one of 'worst countries' in the world",
    "description": "Minnesota Rep. Ilhan Omar sparked controversy by comparing the U.S. to a dictatorship, prompting critics to question her statements about U.S. values.",
    "link": "https://www.foxnews.com/media/ilhan-omar-claims-us-turning-one-worst-countries-world",
    "timestamp": "2025-06-17T19:40:48Z"
  },
  {
    "title": "Federal court to decide if Trump can override Newsom, deploy National Guard in California riots",
    "description": "Ninth Circuit panel to rule on legality of Trump federalizing National Guard troops in Los Angeles County following Newsom's lawsuit over immigration enforcement protests.",
    "link": "https://www.foxnews.com/politics/federal-court-decide-trump-can-override-newsom-deploy-national-guard-california-riots",
    "timestamp": "2025-06-17T19:38:14Z"
  },
  {
    "title": "R. Kelly wants Trump's help after his lawyer alleges surreal murder plot conspiracy story",
    "description": "R. Kelly remains behind bars at a North Carolina prison.\n(Antonio Perez/Chicago Tribune via AP, Pool, File)\nR. Kelly's lawyer claims prison officials have a plot to kill the disgraced R&B singer.\nThe singer is seeking the \"intervention\" of President Donald Tr…",
    "link": "https://biztoc.com/x/28053326642a0dc0",
    "timestamp": "2025-06-17T19:37:45Z"
  },
  {
    "title": "The Fed is likely to keep rates the same, but give a forecast that moves markets. What to expect",
    "description": "While any movement on interest rates seems improbable, the meeting will feature important signals that still could move markets.",
    "link": "https://www.cnbc.com/2025/06/17/the-fed-is-likely-to-keep-rates-the-same-but-give-a-forecast-that-moves-markets-what-to-expect.html",
    "timestamp": "2025-06-17T19:35:51Z"
  },
  {
    "title": "R. Kelly Hospitalized for Overdose on Medications",
    "description": "R. Kelly's lawyer claims that the disgraced singer was hospitalized in prison for overdosing on anxiety and sleep medication, as per Billbo",
    "link": "https://exclaim.ca/music/article/r-kelly-hospitalized-for-overdose-on-anxiety-and-sleep-meds",
    "timestamp": "2025-06-17T19:35:41Z"
  },
  {
    "title": "Schweizer: 'No Kings' Lesson For Leftist Billionaires — You Can’t Buy an Uprising",
    "description": "No Kings? No problem. The weekend protests called “No Kings” produced crowds of a few thousand in some reliably “blue” cities like Portland, Boston, Seattle, and others, but not much else.\nThe post Schweizer: ‘No Kings’ Lesson For Leftist Billionaires — You C…",
    "link": "https://www.breitbart.com/politics/2025/06/17/schweizer-no-kings-lesson-for-leftist-billionaires-you-cant-buy-an-uprising/",
    "timestamp": "2025-06-17T19:35:29Z"
  },
  {
    "title": "Starmer Says US Not Targeting Steel Ownership in Trade Talks",
    "description": "The UK does not need to push out British Steel’s Chinese owners in order to cut a deal to reduce US tariffs on steel, Prime Minister Keir Starmer said.",
    "link": "https://financialpost.com/pmn/business-pmn/starmer-says-us-not-targeting-steel-ownership-in-trade-talks",
    "timestamp": "2025-06-17T19:34:23Z"
  },
  {
    "title": "Countdown to eschatological ecstasy",
    "description": "Showbiz kids making movies of themselves: Look I get it: A lot of these fundie types are just on the grift, and they no more believe their schtick than Donald Trump believes that this time share next to his now-bankrupt casino is going to make you a Real Winn…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/countdown-to-eschatological-ecstasy",
    "timestamp": "2025-06-17T19:34:04Z"
  },
  {
    "title": "MAGA lawmaker pleads with Kristi Noem for mercy amid Trump’s mass deportations",
    "description": "Rep. Mario Diaz-Balart, a Florida Republican, is just one of many conservatives to become disturbed by how Trump’s immigrant agenda is being carried out.",
    "link": "https://www.msnbc.com/top-stories/latest/mario-diaz-balart-trump-deportations-sanabria-noem-rcna213534",
    "timestamp": "2025-06-17T19:33:57Z"
  },
  {
    "title": "Iran confronts Trump with toughest choice yet",
    "description": "President Donald Trump faces potentially the hardest choice of his time in the White House, as he weighs up whether the United States should join Israel’s bombing campaign against Iran. Trump fueled speculation about a US intervention as he dashed back from a…",
    "link": "https://www.digitaljournal.com/world/iran-confronts-trump-with-toughest-choice-yet/article",
    "timestamp": "2025-06-17T19:32:20Z"
  },
  {
    "title": "Trump: “I Don’t Care” That US Has Assessed Iran Is Not Pursuing Nuclear Weapon",
    "description": "US spies have assessed that Iran has not been pursuing a nuclear weapon for over 20 years.",
    "link": "https://truthout.org/articles/trump-i-dont-care-that-us-has-assessed-iran-is-not-pursuing-nuclear-weapon/",
    "timestamp": "2025-06-17T19:32:04Z"
  },
  {
    "title": "Taiwan thumbs its nose at Beijing by blocking chip exports to SMIC and Huawei",
    "description": "A symbolic political move\nTaiwan has added China's leading foundry operator Semiconductor Manufacturing International Co. (SMIC) and IT giant Huawei to its export control list. The move effectively blacklists the duo from doing business with the chip manufact…",
    "link": "https://www.theregister.com/2025/06/17/taiwans_crack_down_on_exports/",
    "timestamp": "2025-06-17T19:31:54Z"
  },
  {
    "title": "New York City comptroller Brad Lander arrested by federal agents at Manhattan courthouse",
    "description": "Federal agents on Tuesday detained New York City Comptroller Brad Lander at a federal immigration courthouse in Manhattan.",
    "link": "https://www.msnbc.com/top-stories/latest/brad-lander-arrested-ice-immigration-new-york-rcna213573",
    "timestamp": "2025-06-17T19:31:27Z"
  },
  {
    "title": "Iran Confronts Trump With Toughest Choice Yet",
    "description": "President Donald Trump faces potentially the hardest choice of his time in the White House, as he weighs up whether the United States should join Israel's bombing campaign against Iran.",
    "link": "https://www.ibtimes.com/iran-confronts-trump-toughest-choice-yet-3776008",
    "timestamp": "2025-06-17T19:30:13Z"
  },
  {
    "title": "R. Kelly wants Trump's help after his lawyer alleges surreal murder plot conspiracy story",
    "description": "R. Kelly's lawyer said the singer was hospitalized after prison officials gave him a medication \"overdose.\" Prosecutors call it \"a fanciful conspiracy.\"",
    "link": "https://www.businessinsider.com/r-kelly-donald-trump-prison-officials-allegations-murder-plot-hospital-2025-6",
    "timestamp": "2025-06-17T19:28:31Z"
  },
  {
    "title": "'It's really scary': Australians desperate to leave as Israel-Iran conflict intensifies",
    "description": "At least 1,250 Australians are registered with the Department of Foreign Affairs and Trade as wanting to be repatriated from either Israel or Iran, as the two countries target each other with ballistic missiles.",
    "link": "https://www.abc.net.au/news/2025-06-18/israel-iran-australians-seeking-to-leave/105429742",
    "timestamp": "2025-06-17T19:27:53Z"
  },
  {
    "title": "Trump, Starmer Say They Signed UK Trade Deal at G-7",
    "description": "Prime Minister Keir Starmer reached an agreement with US President Donald Trump to implement trading terms disclosed last month to slash US tariffs on key British exports and raise UK quotas on certain American agricultural products.\nTrump and Starmer on Mond…",
    "link": "https://biztoc.com/x/c18a336c4548b425",
    "timestamp": "2025-06-17T19:26:44Z"
  },
  {
    "title": "Padilla says Trump is on a ‘tour of retribution’ in first post-handcuffing floor speech",
    "description": "Sen. Alex Padilla (D-Calif.) castigated President Donald Trump as a “vindictive president on a tour of retribution” and warned of what the administration was doing to Americans around the country in “places where there are no cameras” in his first comments on…",
    "link": "https://biztoc.com/x/e7a4d0f30f4dda4f",
    "timestamp": "2025-06-17T19:26:29Z"
  },
  {
    "title": "Stephen A. Smith Dumps Cold Water On Narrative Trump Ruling Like King",
    "description": "ESPN’s Stephen A. Smith on Monday refuted the narrative that President Donald Trump is governing as a king following so-called “No Kings” protests on Saturday. The “No Kings” protests occurred throughout the United States and the movement’s website says the p…",
    "link": "https://freerepublic.com/focus/f-bloggers/4323648/posts",
    "timestamp": "2025-06-17T19:24:46Z"
  },
  {
    "title": "Gabbard Insists She, Trump on 'Same Page' Over Iran",
    "description": "Director of National Intelligence Tulsi Gabbard pushed back on any speculation that she and President Donald Trump are on different pages regarding Iran and its nuclear weapons program. \"President Trump was saying the same thing that I said in my annual threa…",
    "link": "https://freerepublic.com/focus/f-news/4323647/posts",
    "timestamp": "2025-06-17T19:24:02Z"
  },
  {
    "title": "At Religious Liberty Commission hearing, scholars urge government to support faith, freedom",
    "description": "The Trump administration’s Religious Liberty Commission meets in Washington, D.C., on Monday, June 16, 2025. / Credit: Tessa Gervasini/CNA\n\nWashington D.C., Jun 17, 2025 / 15:22 pm (CNA).\nThe White House Religious Liberty Commission held its first hearing in …",
    "link": "https://www.catholicnewsagency.com/news/264801/at-religious-liberty-commission-hearing-scholars-urge-government-to-support-faith-freedom",
    "timestamp": "2025-06-17T19:22:00Z"
  },
  {
    "title": "Tulsi Gabbard Breaks Silence After Trump Publicly Rebukes Her Over Her Iran Nuclear Program",
    "description": "Director of National Intelligence Tulsi Gabbard has broken her silence after President Donald Trump publicly refuted her earlier congressional testimony regarding Iran’s nuclear ambitions.\nThe post Tulsi Gabbard Breaks Silence After Trump Publicly Rebukes Her…",
    "link": "https://www.thegatewaypundit.com/2025/06/tulsi-gabbard-breaks-silence-after-trump-publicly-refutes/",
    "timestamp": "2025-06-17T19:20:49Z"
  },
  {
    "title": "US knows where Khamenei is hiding, urges Iran’s unconditional surrender: Trump",
    "description": "STATE TIMES NEWS Washington: President Donald Trump said Tuesday the US knows where Iran’s Supreme Leader Ayatollah Ali Khamenei is hiding during the Israel-Iran conflict but doesn’t want him killed “for now.”Trump urged, in a social media posting, Iran’s “UN…",
    "link": "https://statetimes.in/us-knows-where-khamenei-is-hiding-urges-irans-unconditional-surrender-trump/",
    "timestamp": "2025-06-17T19:19:40Z"
  },
  {
    "title": "'You don't understand': Lindsey Graham battles MTG over GOP 'slobbering' for war",
    "description": "Sen. Lindsey Graham (R-SC) rejected Rep. Marjorie Taylor Greene's (R-GA) views after she lashed out at Republicans \"slobbering\" over war with Iran.During a Tuesday interview on Fox News, host John Roberts noted that Greene had come out against joining the war…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-2672387052/",
    "timestamp": "2025-06-17T19:19:03Z"
  },
  {
    "title": "GENIUS Act could strengthen dollar power, write ‘rulebook’ for global financial system",
    "description": "The GENIUS Act, a stablecoin regulation bill in the United States Senate, faces a key vote on June 17, and industry stakeholders are weighing in on what it means if it passes.",
    "link": "https://cointelegraph.com/news/genius-act-dollar-dominance-rulebook-global-financial-system",
    "timestamp": "2025-06-17T19:18:55Z"
  },
  {
    "title": "Lindsey Graham Appears on Fox News to Urge Trump to Join War Against Iran: ‘Help Israel Finish the Job’",
    "description": "Sen. Lindsey Graham (R-SC) used a Tuesday appearance on Fox News to urge President Donald Trump to \"help\" Israel \"finish the job\" against Iran.\nThe post Lindsey Graham Appears on Fox News to Urge Trump to Join War Against Iran: ‘Help Israel Finish the Job’ fi…",
    "link": "https://www.mediaite.com/media/tv/lindsey-graham-appears-on-fox-news-to-urge-trump-to-join-war-against-iran-help-israel-finish-the-job/",
    "timestamp": "2025-06-17T19:18:14Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Trump for Dozing Off During 'Boring' Multi-Million Dollar Military Parade, Jokes About Sleeping With Wife Melania Trump",
    "description": "Jimmy Kimmel isn’t holding back about Donald Trump’s multi-million-dollar military parade. The late night host laid into the President of the United States during Jimmy Kimmel Live Monday (June 17) evening, pointing out that even the President could not keep …",
    "link": "https://www.justjared.com/2025/06/17/jimmy-kimmel-roasts-trump-for-dozing-off-during-boring-multi-million-dollar-military-parade-jokes-about-sleeping-with-wife-melania-trump/",
    "timestamp": "2025-06-17T19:18:03Z"
  },
  {
    "title": "New York City comptroller arrested by ICE agents outside immigration court",
    "description": "Official and mayoral candidate Brad Lander is handcuffed by masked US federal agents.",
    "link": "https://www.aljazeera.com/news/2025/6/17/new-york-city-comptroller-arrested-by-ice-agents-outside-immigration-court",
    "timestamp": "2025-06-17T19:17:18Z"
  },
  {
    "title": "‘The Breakfast Club’ Caller Spirals After Journalist Calls Trump ‘The President’",
    "description": "A caller on “The Breakfast Club” became agitated Tuesday after journalist Morgyn Wood referred to President Donald Trump as “the president.”",
    "link": "https://dailycaller.com/2025/06/17/the-breakfast-club-caller-trump-the-president/",
    "timestamp": "2025-06-17T19:16:42Z"
  },
  {
    "title": "Trump tax bill would widen deficits by $2.8T after factoring in economic impacts, CBO says",
    "description": "President Donald Trump’s tax and budget bill would increase deficits by $2.8 trillion over the next decade after factoring in other economic effects.",
    "link": "https://www.clickorlando.com/news/politics/2025/06/17/trump-tax-bill-would-widen-deficits-by-28t-after-factoring-in-economic-impacts-cbo-says/",
    "timestamp": "2025-06-17T19:16:37Z"
  },
  {
    "title": "Cathie Wood’s 50% ARKK rebound hits a big wall of skepticism",
    "description": "Cathie Wood’s flagship ETF has staged a powerful comeback from the depths of the trade war panic, rallying more than 50% since early April.",
    "link": "https://fortune.com/2025/06/17/cathie-wood-arkk-etf-ark-innovation-skepticism/",
    "timestamp": "2025-06-17T19:15:59Z"
  },
  {
    "title": "Jim Acosta Calls Trump ‘A Danger to This Country’",
    "description": "Former CNN anchor Jim Acosta denounced President Donald Trump as \"a danger to this country\" during a forum in Washington on Tuesday.\nThe post Jim Acosta Calls Trump ‘A Danger to This Country’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/jim-acosta-calls-trump-a-danger-to-this-country/",
    "timestamp": "2025-06-17T19:14:32Z"
  },
  {
    "title": "Fearing chaos, Macron opposed to using military force against Iran for regime change",
    "description": "KANANASKIS, Alberta (Reuters) -French President Emmanuel Macron said on Tuesday he was against military action against Iran that could lead to regime change and potential chaos, calling for a ceasefire with a return to negotiations over its nuclear programme.…",
    "link": "https://www.thestar.com.my/news/world/2025/06/18/fearing-chaos-macron-opposed-to-using-military-force-against-iran-for-regime-change",
    "timestamp": "2025-06-17T19:12:00Z"
  },
  {
    "title": "As Israeli bombs rain down, calls in Iran for 'liberation not destruction'",
    "description": "With Israel and Iran continuing to trade blows, Iranians tell the ABC of their fears living in a conflict zone — and the hope among some that it might eventually lead to lasting change in the country.",
    "link": "https://www.abc.net.au/news/2025-06-18/iranians-fearful-and-hopeful-amid-israel-conflict/105424706",
    "timestamp": "2025-06-17T19:11:04Z"
  },
  {
    "title": "Elon Musk’s X sues New York to block social media hate speech law",
    "description": "In its complaint X said the law forces firms to disclose 'highly sensitive and controversial speech' that is protected.",
    "link": "https://www.aljazeera.com/news/2025/6/17/elon-musks-x-sues-new-york-to-block-social-media-hate-speech-law",
    "timestamp": "2025-06-17T19:11:02Z"
  },
  {
    "title": "Chicago Mayor Johnson: Trump Is ‘Trying to Eliminate Black Existence From This Country’",
    "description": "Chicago Mayor Brandon Johnson (D) said Monday on CNN’s “The Situation Room” that President Donald Trump was “trying to eliminate black existence from this country. Johnson said, “Governor Abbott spent over $220 million to ship people across America. Instead o…",
    "link": "https://freerepublic.com/focus/f-news/4323643/posts",
    "timestamp": "2025-06-17T19:08:57Z"
  },
  {
    "title": "How The Republican Party Became A Party That Believes The Constitution Only Applies To Its Enemies",
    "description": "Let’s talk about constitutional hypocrisy so brazen, so comprehensive, so morally bankrupt that it would be laughable if it weren’t so dangerous to the republic. I’ve learned something about modern Republicans that crystallizes everything wrong with our curre…",
    "link": "https://www.techdirt.com/2025/06/17/how-the-republican-party-became-a-party-that-believes-the-constitution-only-applies-to-its-enemies/",
    "timestamp": "2025-06-17T19:08:00Z"
  },
  {
    "title": "Sarah Emami, the face of Iranian media and resistance who resumed her bulletin minutes after Israeli missile strike",
    "description": "",
    "link": "https://economictimes.indiatimes.com/news/international/us/sarah-emami-the-face-of-iranian-media-and-resistance-who-resumed-her-bulletin-minutes-after-israeli-missile-strike/articleshow/121916563.cms",
    "timestamp": "2025-06-17T19:06:01Z"
  },
  {
    "title": "Federal agents arrest NYC mayoral candidate at immigration court",
    "description": "Federal agents detained city's chief finance officer Brad Lander as he guided a defendant out of immigration court on Tuesday.",
    "link": "https://www.bbc.com/news/articles/cvg430dx702o",
    "timestamp": "2025-06-17T19:05:58Z"
  },
  {
    "title": "Trump's DOJ goes after red state over tuition breaks for undocumented immigrants",
    "description": "President Donald Trump's Department of Justice filed a complaint Tuesday challenging a Kentucky law that allows undocumented immigrants to pay in-state tuition. The complaint contends that the Kentucky law is illegal because it provides a benefit to undocumen…",
    "link": "https://www.rawstory.com/trump-doj-2672386833/",
    "timestamp": "2025-06-17T19:05:56Z"
  },
  {
    "title": "Has Trump Brought Authoritarianism to the U.S.?",
    "description": "Experts are alarmed by Trump’s deployment of troops to Los Angeles.",
    "link": "http://foreignpolicy.com/2025/06/17/trump-authoritarianism-newsom-california-marines-national-guard/",
    "timestamp": "2025-06-17T19:05:55Z"
  },
  {
    "title": "ICE-averse states won’t get ‘one red cent’ from feds to rebuild infrastructure, Secretary Duffy warns",
    "description": "Transportation Secretary Sean Duffy vowed to cut federal funding to cities that obstruct ICE or allow rioters to destroy infrastructure.",
    "link": "https://www.foxnews.com/politics/ice-averse-states-wont-get-one-red-cent-from-feds-rebuild-infrastructure-sec-duffy-warns",
    "timestamp": "2025-06-17T19:05:44Z"
  },
  {
    "title": "8 Senators Demand Super PAC, Dark Money Ban in Democratic Primaries",
    "description": "Independent U.S. Sen. Bernie Sanders and seven of his Democratic colleagues on Tuesday urged party leaders to ban super PAC and other forms of dark money from party primaries to curb outside corporate giving and the shadowy influence of the megarich.\"We canno…",
    "link": "https://www.commondreams.org/news/super-pac",
    "timestamp": "2025-06-17T19:04:57Z"
  },
  {
    "title": "Trump threatens to keep 25% tariff on UK steel imports over Port Talbot concerns",
    "description": "Sources say US wants information on when importing of raw materials from abroad at Port Talbot site will stop\nDonald Trump is threatening to keep tariffs on some or all of its steel imports from the UK unless it gives specific guarantees over the Indian-owned…",
    "link": "https://biztoc.com/x/c508221d99716539",
    "timestamp": "2025-06-17T19:04:22Z"
  },
  {
    "title": "An interfaith conversation on immigrant justice and religion",
    "description": "A pastor, a rabbi and an imam discuss how their faith implores them to fight for immigrant and refugee communities.",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/an-interfaith-conversation-on-immigrant-justice-and-religion",
    "timestamp": "2025-06-17T19:01:00Z"
  }
]