[
  {
    "title": "GOP Senators: Scrap the Post Office Electric Vehicle 'Boondoggle'",
    "description": "“Neither snow nor rain nor heat nor gloom of night stays these couriers from the completion of their appointed rounds” goes the U.S. Postal Service creed – but not with electric vehicles, if some Republican lawmakers have their way.\nThe post GOP Senators: Scr…",
    "link": "https://www.breitbart.com/environment/2025/08/17/30759804gop-senators-scrap-the-post-office-electric-vehicle-boondoggle/",
    "timestamp": "2025-08-17T23:35:37Z"
  },
  {
    "title": "Israeli ‘Dancing With the Stars’ Contestants Go Viral With Donald and Melania Trump Tribute | Video",
    "description": "A piece of Trumpian performance art has taken the internet by storm. Haim Pershtin and internet personality Taylor Malkov, participants on Israel's version of \"Dancing With the Stars\" debuted a routine inspired by Donald and Melania Trump — and set to \"The St…",
    "link": "https://www.thewrap.com/israeli-dancing-with-the-stars-contestants-go-viral-with-donald-and-melania-trump-tribute-video/",
    "timestamp": "2025-08-17T23:34:56Z"
  },
  {
    "title": "\"President applauded the criminal\": Dominik Hašek blasts U.S. for honoring a war criminal as Donald Trump rolls out red carpet for Vladimir Putin",
    "description": "Dominik Hašek, a vocal critic of Russia, has condemned the Alaska summit between Donald Trump and Vladimir Putin. He criticized the red-carpet military welcome given to Putin, labeling him “the greatest criminal of the 21st century.” Hašek's outrage reflects …",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/president-applauded-the-criminal-dominik-haek-blasts-u-s-for-honoring-a-war-criminal-as-donald-trump-rolls-out-red-carpet-for-vladimir-putin/articleshow/123352239.cms",
    "timestamp": "2025-08-17T23:34:43Z"
  },
  {
    "title": "Putin, Trump, and a summit that ended in stalemate",
    "description": "The Alaska Summit between Putin and Trump ended prematurely after three hours without big outcomes, raising worries about unresolved issues. Both leaders expressed differing expectations, and the summit highlighted complexities of US-Russia ties",
    "link": "https://www.livemint.com/opinion/columns/vladimir-putin-donald-trump-alaska-summit-stalemate-zelensky-11755419672195.html",
    "timestamp": "2025-08-17T23:30:17Z"
  },
  {
    "title": "Jobs of 1.73 lakh workers in gems and jewellery trade hang in balance",
    "description": "The new 25-50% tariffs on Indian diamond and studded jewellery imports are expected to severely impact labour-intensive manufacturing hubs in Gujarat, Maharashtra, and Rajasthan.",
    "link": "https://www.livemint.com/industry/jobs-of-1-73-lakh-workers-in-gems-and-jewellery-trade-hang-in-balance-11755436686425.html",
    "timestamp": "2025-08-17T23:30:17Z"
  },
  {
    "title": "EU leaders to join Zelenskyy at White House",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington to present a united front in talks with President Donald Trump on ending Russia's war in Ukraine and firming up U.S. security guarantees now on the negotiati…",
    "link": "https://www.bostonherald.com/2025/08/17/eu-leaders-to-join-zelenskyy-at-white-house/",
    "timestamp": "2025-08-17T23:21:04Z"
  },
  {
    "title": "Trump’s peace-deal demands leave Ukraine's Zelenskyy with only bad options",
    "description": "Ukrainian leader Volodymyr Zelenskyy faces an existential dilemma as he travels to Washington for talks with U.S. President Donald Trump on Monday.",
    "link": "https://www.japantimes.co.jp/news/2025/08/18/world/trump-ukraine-deal-zelenskyy/",
    "timestamp": "2025-08-17T23:21:00Z"
  },
  {
    "title": "Trump’s peace-deal demands leave Ukraine's Zelenskyy with only bad options",
    "description": "Ukrainian leader Volodymyr Zelenskyy faces an existential dilemma as he travels to Washington for talks with U.S. President Donald Trump on Monday.",
    "link": "https://www.japantimes.co.jp/news/2025/08/18/world/politics/trump-ukraine-deal-zelenskyy/",
    "timestamp": "2025-08-17T23:21:00Z"
  },
  {
    "title": "Deal or no deal, Mark Carney has to manage a new relationship with the United States",
    "description": "A week after the latest deadline to somehow resolve the trade war that Donald Trump has launched against Canada — and with Canadian officials now looking ahead to a full renegotiation of the Canada-U.S.-Mexico Agreement — many things remain unclear. But when …",
    "link": "https://freerepublic.com/focus/f-news/4335146/posts",
    "timestamp": "2025-08-17T23:16:02Z"
  },
  {
    "title": "Former FBI Director James Comey confesses he's a 'Swiftie' in new anti-Trump video message",
    "description": "James Comey revealed his family's Taylor Swift obsession and participation in \"Swiftie\" group chat while taking political swipes at Donald Trump in strange video.",
    "link": "https://www.foxnews.com/politics/former-fbi-director-james-comey-confesses-hes-swiftie-new-anti-trump-video-message",
    "timestamp": "2025-08-17T23:15:44Z"
  },
  {
    "title": "'That's not how Putin saw it': Analyst warns Trump's 'show of force' at summit backfired",
    "description": "President Donald Trump may have done more to help Russian President Vladimir Putin than he did to help Ukraine during the summit in Alaska on Friday, according to one analyst. Trump said he intended to negotiate a ceasefire in the three-and-a-half-year war in…",
    "link": "https://www.rawstory.com/trump-2673891247/",
    "timestamp": "2025-08-17T23:12:24Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for meeting with Trump",
    "description": "European and NATO leaders will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump.",
    "link": "https://www.wishtv.com/news/politics/european-leaders-to-join-ukraines-zelenskyy-for-meeting-with-trump/",
    "timestamp": "2025-08-17T23:11:26Z"
  },
  {
    "title": "Trump runs into the difficulty of Putin diplomacy and ending a long war",
    "description": "President Donald Trump walked into a summit with Russia’s Vladimir Putin pressing for a ceasefire deal and threatening “severe consequences” and tough new sanctions if the Kremlin leader failed to agree to halt the fighting in Ukraine. Instead, Trump was the …",
    "link": "https://www.wishtv.com/news/politics/trump-runs-into-the-difficulty-of-putin-diplomacy-and-ending-a-long-war/",
    "timestamp": "2025-08-17T23:11:26Z"
  },
  {
    "title": "Asia Set for Cautious Open Ahead of Ukraine Talks: Markets Wrap",
    "description": "Asian markets are set for a tepid start ahead of talks between Donald Trump and Volodymyr Zelenskiy, after the US-Russia summit on the Ukraine war ended without a ceasefire.",
    "link": "https://financialpost.com/pmn/business-pmn/asia-set-for-cautious-open-ahead-of-ukraine-talks-markets-wrap",
    "timestamp": "2025-08-17T23:07:28Z"
  },
  {
    "title": "US, Russia agree on Ukraine security",
    "description": "Donald Trump and Vladimir Putin agreed at their summit in Alaska last week that the U.S. would be able to offer security guarantees to Ukraine, according to Steve Witkoff, Trump’s special envoy, even as many details of Friday’s meeting remain unclear.",
    "link": "https://www.bostonherald.com/2025/08/17/us-russia-agree-on-ukraine-security/",
    "timestamp": "2025-08-17T23:04:38Z"
  },
  {
    "title": "Mark Cuban warns Donald Trump he will run for President in 2028, but only if he does one thing",
    "description": "There may well be a shift in the political waters coming to the United States as billionaire entrepreneur and former Shark Tank investor Mark Cuban admitted he could be forced to r",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/08/18/68a25f28ca474187738b4586.html",
    "timestamp": "2025-08-17T23:04:29Z"
  },
  {
    "title": "‘NEITHER SIDE IS GOING TO SURRENDER’: Rubio States Russia and Ukraine Will Have to Make Concessions",
    "description": "Secretary of State Marco Rubio argued on ABC’s “This Week” Sunday morning that both Russia and Ukraine are bound to “give and get” in order... Read More\nThe post ‘NEITHER SIDE IS GOING TO SURRENDER’: Rubio States Russia and Ukraine Will Have to Make Concessio…",
    "link": "https://www.dailysignal.com/2025/08/17/trump-administration-priority-promote-peace/",
    "timestamp": "2025-08-17T23:03:43Z"
  },
  {
    "title": "Should Europe wean itself off US tech?",
    "description": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
    "link": "https://www.bbc.com/news/articles/c3dpr2zkny0o",
    "timestamp": "2025-08-17T23:03:19Z"
  },
  {
    "title": "Donald Trump deserves praise for having the nerve to meet Vladimir Putin face-to-face",
    "description": "Let’s praise Donald. Thank him. Respect him. Who else had the gizzard, nerves, smarts to stand face-to-face to Satan’s lying teeth in front of the world?",
    "link": "https://nypost.com/2025/08/17/opinion/donald-trump-deserves-praise-for-having-the-nerve-to-meet-vladimir-putin-face-to-face/",
    "timestamp": "2025-08-17T23:02:45Z"
  },
  {
    "title": "Marco Rubio, Sen. Chris Murphy Push Polar Opposite Trump-Putin Summit Takes on ‘Meet the Press’ | Video",
    "description": "\"War criminals are not normally invited to the United States,\" the Connecticut senator says, \nThe post Marco Rubio, Sen. Chris Murphy Push Polar Opposite Trump-Putin Summit Takes on ‘Meet the Press’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/marco-rubio-sen-chris-murphy-opposite-trump-putin-summit-takes/",
    "timestamp": "2025-08-17T23:02:32Z"
  },
  {
    "title": "Zelensky hails 'historic' US commitment to offer Ukraine security guarantees in event of peace",
    "description": "With less than 24 hours to go before he meets Donald Trump again, Volodymyr Zelensky has hailed the president's \"historic decision\" to offer Ukraine security guarantees if a peace deal is reached with Russia. It's unclear exactly what shape this support might…",
    "link": "https://freerepublic.com/focus/f-news/4335142/posts",
    "timestamp": "2025-08-17T23:01:28Z"
  },
  {
    "title": "The stakes are high - and the unity of the alliance against Putin has never been so threatened",
    "description": "The challenge for Volodymyr Zelenskyy for his talks with Donald Trump at the White House is to avoid a repeat of the disastrous encounter the last time they met there.",
    "link": "https://news.sky.com/story/the-stakes-are-high-and-the-unity-of-the-alliance-against-putin-has-never-been-so-threatened-13413864",
    "timestamp": "2025-08-17T23:01:00Z"
  },
  {
    "title": "Trump relaxed restrictions on a key AI chip for China. Beijing isn’t saying thank you. | CNN Business",
    "description": "In a surprising reversal of the United States’ years-long technology restrictions on China, President Donald Trump last month allowed Nvidia to resume sales of a key AI chip designed specifically for the Chinese market.",
    "link": "https://www.cnn.com/2025/08/17/tech/nvidia-china-beijing-trump-ai-intl-hnk",
    "timestamp": "2025-08-17T23:00:42Z"
  },
  {
    "title": "'60 MINUTES' Australia tackls Trump, Epstein... | 'I THOUGHT SHE WAS 16'...",
    "description": "In death, Jeffrey Epstein has managed to do something no one else has been able to - drive a wedge between Donald Trump and his loyal base.",
    "link": "https://9now.nine.com.au/60-minutes/how-jeffrey-epstein-files-have-turned-donald-trump-base-against-him/d68a08aa-c0b6-4663-8ddc-de454473103c",
    "timestamp": "2025-08-17T23:00:04Z"
  },
  {
    "title": "PM Modi urges states to cooperate in implementing proposed GST reforms",
    "description": "NEW DELHI, Aug 17: Prime Minister Narendra Modi on Sunday said the Centre has circulated the draft of the next-generation GST reforms among states and sought their cooperation to implement the proposal before Diwali. He said the reform in GST would benefit po…",
    "link": "https://thehillstimes.in/national/pm-modi-urges-states-to-cooperate-in-implementing-proposed-gst-reforms",
    "timestamp": "2025-08-17T23:00:00Z"
  },
  {
    "title": "Examining rumor Trump wants to lower age of consent and marriage to 14",
    "description": "Some users claimed Trump desired to protect himself from potential future charges for alleged crimes involving convicted sex offender Jeffrey Epstein.",
    "link": "https://www.snopes.com//news/2025/08/17/trump-age-consent-marriage/",
    "timestamp": "2025-08-17T23:00:00Z"
  },
  {
    "title": "Ukrainian mood hardens as MPs insist country should not be forced to surrender",
    "description": "A string of Ukrainian politicians and public figures condemned the idea of handing over unoccupied land to Russia for peace on Sunday, arguing that their country had not been defeated and should not be forced into a surrender. The hardening of the mood came a…",
    "link": "https://freerepublic.com/focus/f-news/4335141/posts",
    "timestamp": "2025-08-17T22:56:10Z"
  },
  {
    "title": "Russia strikes Kharkiv with ballistic missile, injures 11, Ukraine says",
    "description": "KHARKIV (Reuters) -Russia hit a residential area in Kharkiv with a ballistic missile, injuring at least 11 people, Ukrainian authorities said late on Sunday, as the U.S. president presses Kyiv to accept a quick deal to end the war that Moscow had started. Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/08/18/russia-strikes-kharkiv-with-ballistic-missile-injures-11-ukraine-says",
    "timestamp": "2025-08-17T22:51:00Z"
  },
  {
    "title": "Oil Dips as Focus Shifts to Zelenskiy Meet After Putin Summit",
    "description": "Oil slipped as traders turned their attention to Donald Trump’s meeting with Volodymyr Zelenskiy on Monday, with the Ukrainian leader facing US pressure to reach a peace deal with Russia that involves ceding territory.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-dips-as-focus-shifts-to-zelenskiy-meet-after-putin-summit",
    "timestamp": "2025-08-17T22:47:06Z"
  },
  {
    "title": "Oil slips as Russia supply concerns ease after Trump-Putin meet",
    "description": "SINGAPORE (Reuters) -Oil prices slipped in early Asian trade on Monday as the United States did not exert more pressure on Russia to end the Ukraine war by...",
    "link": "https://finance.yahoo.com/news/oil-slips-russia-supply-concerns-224014888.html",
    "timestamp": "2025-08-17T22:40:14Z"
  },
  {
    "title": "Senator Calls Trump-Putin Meeting An 'Embarrassment For The United States'",
    "description": "Sen. Chris Murphy called the failed meeting, in which no ceasefire was reached for the war in Ukraine, a \"disaster\" while on air with NBC News.",
    "link": "https://www.huffpost.com/entry/senator-chris-murphy-trump-putin-meeting-failure_n_68a220f9e4b0858c7642ba2a",
    "timestamp": "2025-08-17T22:38:13Z"
  },
  {
    "title": "South Africa's Head General Visited Iranian Special Forces Unit",
    "description": "South African National Defense Force Chief General Rudzani Maphwanya inspected an Iranian special forces unit last week, despite efforts by the South African government to minimize the importance of his visit.\nThe post South Africa’s Head General Visited Iran…",
    "link": "https://www.breitbart.com/africa/2025/08/17/south-africas-head-general-visited-iranian-special-forces-unit/",
    "timestamp": "2025-08-17T22:35:25Z"
  },
  {
    "title": "‘Not Acceptable’: GOP Rep Ripped For Suggesting Trump Get Permanent Power ‘As Long As He Wants’",
    "description": "Rep. Andy Ogles (R) got major blowback on social media after suggesting that Donald Trump be given a hall pass to do whatever he wants.\nThe post ‘Not Acceptable’: GOP Rep Ripped For Suggesting Trump Get Permanent Power ‘As Long As He Wants’ first appeared on …",
    "link": "https://www.mediaite.com/media/news/not-acceptable-gop-rep-ripped-for-suggesting-trump-get-permanent-power-as-long-as-he-wants/",
    "timestamp": "2025-08-17T22:33:17Z"
  },
  {
    "title": "Trump administration minimizes summit papers left in hotel | Honolulu Star-Advertiser",
    "description": "The Trump administration this weekend downplayed a report that officials left in a public area of a hotel documents describing the confidential movements of President Donald Trump and President Vladimir Putin of Russia during their meeting in Alaska on Friday.",
    "link": "https://www.staradvertiser.com/2025/08/17/breaking-news/trump-administration-minimizes-summit-papers-left-in-hotel/",
    "timestamp": "2025-08-17T22:26:24Z"
  },
  {
    "title": "'Not Much Was Accomplished': Fox News Host Offers Brutal Takedown Of Trump's Putin Summit",
    "description": "Fox News host Howard Kurtz opened his Sunday show by noting that \"not much was accomplished\" at President Donald Trump's summit with Russian President Vladimir Putin on the war in Ukraine.\n\n\n\"Three and a half years into the brutal and bloody war in Ukraine af…",
    "link": "https://crooksandliars.com/2025/08/not-much-was-accomplished-fox-news-host",
    "timestamp": "2025-08-17T22:23:54Z"
  },
  {
    "title": "Trump Tells Ukraine To Surrender After Meeting With Putin",
    "description": "Donald Trump told Fox News host Sean Hannity the only way forward for Ukraine is to “make a deal” with Russia because their war criminal invaders are a war machine.\nThe Alaska summit is one of the most embarrassing summits in US history. It accomplished nothi…",
    "link": "https://crooksandliars.com/2025/08/trump-tells-ukraine-surrender-after-putin",
    "timestamp": "2025-08-17T22:23:54Z"
  },
  {
    "title": "When Putin’s jet refuelled in Alaska, the Russians offered to pay in cash",
    "description": "Donald Trump's Secretary of State Marco Rubio and his special envoy Steve Witkoff have spoken about the Alaska summit, discussing \"the crux of the deal\" they want made between Russia and Ukraine.",
    "link": "https://www.abc.net.au/news/2025-08-18/inside-alaska-summit-with-trump-putin-rubio-witkoff/105665374",
    "timestamp": "2025-08-17T22:20:01Z"
  },
  {
    "title": "Trump administration halts visas for Gazans",
    "description": "A day after conservative activist Laura Loomer posted videos on social media of children from Gaza arriving in the U.S. for medical treatment and questioning how they got visas, the State Department said it was halting all visitor visas for people from Gaza p…",
    "link": "https://www.bostonherald.com/2025/08/17/trump-administration-halts-visas-for-gazans/",
    "timestamp": "2025-08-17T22:19:01Z"
  },
  {
    "title": "Angry Gavin Newsom Files FOIA Request on Border Patrol Raid Outside His Rally to Eliminate Republican Seats",
    "description": "California Gov. Gavin Newsom angrily demanded information Sunday about a U.S. Border Patrol raid outside a rally in downtown Los Angeles on Thursday during his rally to gerrymander the state's congressional seats.\nThe post Angry Gavin Newsom Files FOIA Reques…",
    "link": "https://www.breitbart.com/politics/2025/08/17/angry-gavin-newsom-files-foia-request-on-border-patrol-raid-outside-gerrymandering-rally/",
    "timestamp": "2025-08-17T22:12:09Z"
  },
  {
    "title": "‘We Want to Make DC Safe Again’: US Attorney Pirro Explains Trump’s Agenda",
    "description": "U.S. Attorney for the District of Columbia Jeanine Pirro stated clearly on “My View with Lara Trump” on Saturday that federalizing the Metropolitan Police Department... Read More\nThe post ‘We Want to Make DC Safe Again’: US Attorney Pirro Explains Trump’s Age…",
    "link": "https://www.dailysignal.com/2025/08/17/pirro-vows-end-coddling-teen-criminals-dc/",
    "timestamp": "2025-08-17T22:10:44Z"
  },
  {
    "title": "68 DC suspects arrested in single night as White House touts Trump's push to 'clean up' capital city",
    "description": "Nearly 70 arrests were made on Saturday night during Trump's ongoing cleanup operation in Washington D.C., with charges including assault and weapon possession.",
    "link": "https://www.foxnews.com/us/68-dc-suspects-arrested-single-night-white-house-touts-trumps-push-clean-up-capital-city",
    "timestamp": "2025-08-17T22:09:02Z"
  },
  {
    "title": "Russia Is Pumping Out Disinformation That Looks Like Legitimate News Reports",
    "description": "Despite Donald Trump's whining about \"fake news,\" his administration has rolled back efforts to combat it, allowing fakes to flourish",
    "link": "http://www.rollingstone.com/politics/politics-news/russia-pumping-out-disinformation-fake-news-1235410290/",
    "timestamp": "2025-08-17T22:02:00Z"
  },
  {
    "title": "VIDEO: Migrant Detention Center Opening in Texas Will Be Largest in History",
    "description": "A migrant detention facility of historic proportions is scheduled to open on Sunday in El Paso, Texas.\nThe post VIDEO: Migrant Detention Center Opening in Texas Will Be Largest in History appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/08/17/video-migrant-detention-center-opening-in-texas-will-be-largest-in-history/",
    "timestamp": "2025-08-17T22:01:05Z"
  },
  {
    "title": "Marco Rubio accuses CBS reporter of pushing 'stupid media narrative' in fiery clash over Zelensky",
    "description": "Trump hosted Putin in Alaska summit on Ukraine war but failed to secure ceasefire, though both sides reported progress and planned future meetings",
    "link": "https://www.foxnews.com/media/marco-rubio-accuses-cbs-reporter-pushing-stupid-media-narrative-fiery-clash-over-zelensky",
    "timestamp": "2025-08-17T22:00:50Z"
  },
  {
    "title": "Newsom Files Request for Info on Trump Admin Use of Military",
    "description": "The California Governor has again questioned the tactics of President Trump's administration.",
    "link": "https://www.newsweek.com/newsom-files-request-info-trump-admin-use-military-2114750",
    "timestamp": "2025-08-17T22:00:29Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Ukraine and its allies are scrambling to respond to President Donald Trump’s apparent shift toward Vladimir Putin’s hard-line position after their summit in Alaska",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-august-17-rcna225033",
    "timestamp": "2025-08-17T22:00:00Z"
  },
  {
    "title": "‘Just Vague Assurances’: Fox’s Howard Kurtz Says It’s ‘Clear’ Trump-Putin Summit Didn’t Accomplish Much",
    "description": "Fox News host Howard Kurtz claimed that President Donald Trump walked away from the Alaska summit without much to show for it.\nThe post ‘Just Vague Assurances’: Fox’s Howard Kurtz Says It’s ‘Clear’ Trump-Putin Summit Didn’t Accomplish Much first appeared on M…",
    "link": "https://www.mediaite.com/media/news/just-vague-assurances-foxs-howard-kurtz-says-its-clear-trump-putin-summit-didnt-accomplish-much/",
    "timestamp": "2025-08-17T21:51:40Z"
  },
  {
    "title": "Insufficiently Foreign Affairs Open Thread: RUSSIA RUSSIA RUSSIA",
    "description": "Crow: \"Look at what happened. US military personnel in uniform literally were on hands & knees rolling out a red carpet for the most murderous dictator of the 21st century…we keep on acting like Putin deserves to be brought out in open like any of head of sta…",
    "link": "https://balloon-juice.com/2025/08/17/insufficiently-foreign-affairs-open-thread-russia-russia-russia/",
    "timestamp": "2025-08-17T21:40:57Z"
  },
  {
    "title": "Colin Kaepernick docuseries produced by Spike Lee no longer moving forward at ESPN amid 'creative differences'",
    "description": "Kaepernick reportedly wanted the docuseries to focus more on his career, while Lee wanted the story to cover cultural issues including social justice and police brutality.",
    "link": "https://sports.yahoo.com/nfl/article/colin-kaepernick-docuseries-produced-by-spike-lee-no-longer-moving-forward-at-espn-amid-creative-differences-213849203.html",
    "timestamp": "2025-08-17T21:38:49Z"
  },
  {
    "title": "7NEWS breaking news live blog: Follow along as we bring you morning crime, weather and traffic updates | 7NEWS",
    "description": "7NEWS breaking news live blog: Follow along as we bring you morning crime, weather and traffic updates | 7NEWS7news.com.au",
    "link": "https://7news.com.au/news/7news-breaking-news-live-blog-follow-along-as-we-bring-you-morning-crime-weather-and-traffic-updates-c-19715678",
    "timestamp": "2025-08-17T21:37:24Z"
  },
  {
    "title": "BRIG. GEN. JOHN TEICHERT: Accountability For America’s Afghanistan Catastrophe",
    "description": "August marks the solemn four-year anniversary of the American failure in its tragic withdrawal from Afghanistan under President Joe Biden. On Aug. 15, 2021, the Afghan capital of Kabul fell into the hands of Taliban control. On Aug. 26,, thirteen military mem…",
    "link": "https://dailycaller.com/2025/08/17/opinion-accountability-for-americas-afghanistan-catastrophe-brig-gen-john-teichert/",
    "timestamp": "2025-08-17T21:35:58Z"
  },
  {
    "title": "WATCH -- Chuck Todd: Joe Biden's Legacy Is 'Donald Trump Came Back'",
    "description": "Former NBC host Chuck Todd recently offered a stinging assessment of Joe Biden's (D) presidency and how it turned out.\nThe post WATCH — Chuck Todd: Joe Biden’s Legacy Is ‘Donald Trump Came Back’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/08/17/watch-chuck-todd-joe-bidens-legacy-is-donald-trump-came-back/",
    "timestamp": "2025-08-17T21:30:22Z"
  },
  {
    "title": "The Alaska Summit: A Symposium",
    "description": "The Realist Review and The American Committee for US-Russia Accord have gathered over a dozen experts on US-Russia relations and US foreign policy to share their thoughts on Friday’s summit in Alaska. Below are contributions from Norman Solomon, Ted Snider, M…",
    "link": "https://www.antiwar.com/blog/2025/08/17/the-alaska-summit-a-symposium/",
    "timestamp": "2025-08-17T21:24:00Z"
  },
  {
    "title": "Peter Alexander said President Donald Trump’s aides’ “eyes were wide” when they left the meeting with Russian President Vladimir Putin.",
    "description": "NBC News Chief White House Correspondent Peter Alexander says he won’t forget the “looks on the faces” of President Donald Trump’s team at his summit with...",
    "link": "https://www.thedailybeast.com/nbc-host-peter-alexander-says-karoline-leavitts-shocking-ashen-look-will-stick-with-me/",
    "timestamp": "2025-08-17T21:23:51Z"
  },
  {
    "title": "A dangerous new idea about what Democrats are doing wrong",
    "description": "Polling is “90% bullshit.” In fact, all political data is “garbage.” The Democratic consultants who traffic in such numbers are perpetrating a “scam” against their own party and are largely responsible for President Donald Trump’s victories. Instead of trying…",
    "link": "https://www.vox.com/politics/458175/democrats-polls-immigration-moderation",
    "timestamp": "2025-08-17T21:21:57Z"
  },
  {
    "title": "German foreign minister criticizes 'aggressive' China ahead of trip to Japan",
    "description": "Germany's foreign minister on Sunday criticized what he called the &quot;aggressive behavior&quot; of China in the Taiwan Strait ahead of a trip to Japan and Indonesia, and stressed the need to strengthen internationally binding rules. Speaking to reporters, …",
    "link": "https://japantoday.com/category/politics/german-foreign-minister-criticises-%27aggressive%27-china-ahead-of-trip-to-japan",
    "timestamp": "2025-08-17T21:20:19Z"
  },
  {
    "title": "U.S. seeks shipbuilding expertise from Japan, S Korea to counter China",
    "description": "American lawmakers are using a trip to Japan and South Korea to explore how the United States can tap those allies’ shipbuilding expertise and capacity to help boost its own capabilities, which are dwarfed by those of China. Sens. Tammy Duckworth, D-Ill, and …",
    "link": "https://japantoday.com/category/politics/us-seeks-shipbuilding-expertise-from-south-korea-and-japan-to-counter-china",
    "timestamp": "2025-08-17T21:19:05Z"
  },
  {
    "title": "Rubio Snaps At Fox News Host After She Calls Him Out For 'No Ceasefire' In Ukraine",
    "description": "Secretary of State Marco Rubio struggled to explain why there had been \"no ceasefire\" between Russia and Ukraine after President Donald Trump's meeting with Russian President Vladimir Putin.\n\n\nFox News host Maria Bartiromo pressed Rubio on the outcome of the …",
    "link": "https://crooksandliars.com/2025/08/rubio-snaps-fox-news-host-after-she-calls",
    "timestamp": "2025-08-17T21:16:15Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for meeting with Trump",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump on ending Russia’s war in Ukraine, with the possibility of U.S. security guarantees now on the negotiating table. Europ…",
    "link": "https://japantoday.com/category/world/european-leaders-to-join-ukraine%27s-zelenskyy-for-white-house-meeting-with-trump",
    "timestamp": "2025-08-17T21:15:32Z"
  },
  {
    "title": "Putin wins Ukraine concessions in Alaska but did not get all he wanted",
    "description": "In a few short hours in Alaska, Vladimir Putin managed to convince Donald Trump that a Ukraine ceasefire was not the way to go, stave off U.S. sanctions, and spectacularly shatter years of Western attempts to isolate the Russian president. Outside Russia, Put…",
    "link": "https://japantoday.com/category/features/opinions/analysis-putin-wins-ukraine-concessions-in-alaska-but-did-not-get-all-he-wanted",
    "timestamp": "2025-08-17T21:09:19Z"
  },
  {
    "title": "Donald Trump's Mental Health Shows 'Classic Signs' Of Rapid Decline",
    "description": "Donald Trump's mental health shows 'classic signs' of dementia as he continues to display off-script behaviors, putting Americans at risk.",
    "link": "https://okmagazine.com/p/donald-trump-mental-health-worse-horror-disease/",
    "timestamp": "2025-08-17T21:06:15Z"
  },
  {
    "title": "Rubio issues thinly veiled warning to Ukraine",
    "description": "The conflict “is going to get worse” if Kiev does not agree to a peace deal with Moscow, the US Secretary of State has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623130-rubio-warns-ukraine-conflict-going-to-get-worse/",
    "timestamp": "2025-08-17T21:03:49Z"
  },
  {
    "title": "Trump’s Occupation of D.C. Is Hurting Local Businesses Too",
    "description": "As fewer customers visit restaurants and bars, the president considers escalation by arming members of the National Guard in the capital city.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-occupation-dc-local-businesses-1235410277/",
    "timestamp": "2025-08-17T21:00:23Z"
  },
  {
    "title": "US claims Putin ‘concession’ victory — but no ceasefire for Ukraine",
    "description": "Ukraine would be offered NATO-style protection under new concessions allegedly won during Donald Trump's meeting with Vladimir Putin, and Albo and Labor's approval rating just keeps on climbing.\nThe post US claims Putin ‘concession’ victory — but no ceasefire…",
    "link": "http://www.crikey.com.au/2025/08/18/donald-trump-vladimir-putin-nato-ukraine-war-russia-albanese-labor/",
    "timestamp": "2025-08-17T20:55:01Z"
  },
  {
    "title": "Black Mayors Of Cities Trump Decries As 'Lawless' Tout Significant Declines In Violent Crimes",
    "description": "Members of the African American Mayors Association started noticing last year declines in violent crime in their cities.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-dc-takeover-black-mayors_n_68a23d5ee4b07702299b5f5d",
    "timestamp": "2025-08-17T20:55:00Z"
  },
  {
    "title": "Exclusive -- Attorney General Ken Paxton: John Cornyn a 'Washington Insider' That Pushed Gun Control, Insinuated 'Amnesty,' Fought Trump on Border Wall",
    "description": "Texas Attorney General Ken Paxton on Breitbart News Saturday said that Sen. John Cornyn (R-TX) is nothing but a \"Washington insider\" who has been in the Senate for 23 years and has pushed gun control, \"insinuated\" amnesty, and chided President Donald Trump's …",
    "link": "https://www.breitbart.com/politics/2025/08/17/exclusive-attorney-general-ken-paxton-john-cornyn-a-washington-insider-that-pushed-gun-control-insinuated-amnesty-fought-trump-on-border-wall/",
    "timestamp": "2025-08-17T20:53:21Z"
  },
  {
    "title": "Trump And Zelenskyy Set For High-Stakes White House Meeting Monday: Here’s What To Know",
    "description": "Leaders from the EU and NATO will join the Ukrainian president at the White House.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/08/17/trump-and-zelenskyy-set-for-high-stakes-white-house-meeting-monday-heres-what-to-know/",
    "timestamp": "2025-08-17T20:52:11Z"
  },
  {
    "title": "WEEKLY PREVIEW: All eyes still on Alaska summit",
    "description": "Just like the previous week, the next seven days will also be marked by the summit between Donald Trump and Vladimir Putin, the respective presidents of the United States and Russia, which took place ...",
    "link": "https://biztoc.com/x/0c181156eeefe321",
    "timestamp": "2025-08-17T20:50:26Z"
  },
  {
    "title": "‘I Shouldn’t Even Have To Say It’: Rubio Slaps Back ABC’s Raddatz For Saying Trump ‘Elevated’ Putin",
    "description": "\"You're not going to end a war between Russia and Ukraine without dealing with Putin.\"Secretary of State Marco Rubio unloaded on ABC News host Martha Raddatz over her claim that when President Donald Trump met with Russian President Vladimir Putin at Friday’s…",
    "link": "https://freerepublic.com/focus/f-news/4335122/posts",
    "timestamp": "2025-08-17T20:47:50Z"
  },
  {
    "title": "Even liberal Maureen Dowd of The Times admits DC is crime-ridden",
    "description": "One of The New York Time's marquee columnists has agreed — grudgingly, stubbornly, kicking and screaming — that President Donald Trump is right: There's too much crime in the nation's capital.",
    "link": "https://nypost.com/2025/08/17/opinion/even-liberal-maureen-dowd-of-the-times-admits-dc-is-crime-ridden/",
    "timestamp": "2025-08-17T20:46:15Z"
  },
  {
    "title": "Fed Chair Jerome Powell may seriously disappoint Wall Street at Jackson Hole",
    "description": "\"It will be difficult for policymakers to tease out one-off tariff effects from longer-lasting inflationary pressures.\"",
    "link": "https://fortune.com/2025/08/17/jerome-powell-jackson-hole-speech-preview-fed-rate-cuts-tariffs-inflation-jobs/",
    "timestamp": "2025-08-17T20:44:20Z"
  },
  {
    "title": "How a chaotic 24 hours unfolded ahead of Trump-Zelenskyy meeting",
    "description": "The US president's deal-making skills came under question after his summit with Vladimir Putin in Alaska - but it's clear he's retained his ability to catch the world off guard.",
    "link": "https://news.sky.com/story/how-a-chaotic-24-hours-unfolded-ahead-of-trump-and-zelenskyys-crunch-white-house-talks-13413857",
    "timestamp": "2025-08-17T20:44:00Z"
  },
  {
    "title": "Laura Loomer’s Latest Victim: Visas For Critically Injured Palestinian Kids",
    "description": "Laura Loomer, the far-right provocateur and conspiracy theorist who has described herself as a “proud Islamophobe,” has proven to have particular sway with President Donald Trump. The latest example came on Saturday, when the State Department halted all visit…",
    "link": "https://www.motherjones.com/politics/2025/08/loomer-gaza-medical-visas-us-palestine/",
    "timestamp": "2025-08-17T20:42:18Z"
  },
  {
    "title": "Democratic Open Thread: Sherrod Brown for Ohio",
    "description": "contrarian.substack.com/p/undaunted-… Throughout his career, Brown has championed blue-collar workers, supported unions, expanded access to healthcare, and bolstered Social Security—all in support of what he calls “the dignity of work.” [image or embed] — Jen…",
    "link": "https://balloon-juice.com/2025/08/17/democratic-open-thread-sherrod-brown-for-ohio/",
    "timestamp": "2025-08-17T20:39:58Z"
  },
  {
    "title": "Papers: Man Utd, Liverpool and Spurs target PL defender",
    "description": "The top stories and transfer rumours from Monday's newspapers...",
    "link": "https://www.skysports.com/football/transfer-paper-talk/12709/13413847/man-utd-liverpool-and-tottenham-targeting-a-move-for-brentford-defender-nathan-collins-paper-talk",
    "timestamp": "2025-08-17T20:35:00Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for meeting with Trump",
    "description": "Special U.S. envoy Steve Witkoff said Putin agreed to allow the U.S. and European allies to offer Ukraine a security guarantee.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_9900d929-1c20-532e-b3f3-e8f471fb8b0c.html",
    "timestamp": "2025-08-17T20:30:00Z"
  },
  {
    "title": "European leaders to discuss potential security guarantees for Ukraine with Donald Trump",
    "description": "Five European leaders, plus heads of Nato and EU to join Volodymyr Zelenskiy in talks with Trump amid fears he may face same pressure as February Oval Office meeting",
    "link": "https://www.irishtimes.com/world/europe/2025/08/18/european-leaders-to-discuss-potential-security-guarantees-for-ukraine-with-donald-trump/",
    "timestamp": "2025-08-17T20:29:19Z"
  },
  {
    "title": "Trump to Host Zelenskyy, EU Leaders at White House Following ‘Successful’ Russia Summit",
    "description": "President Donald Trump was very successful in his negotiations with Russian President Vladimir Putin in Alaska on Friday, said Steve Witkoff, U.S. special envoy for... Read More\nThe post Trump to Host Zelenskyy, EU Leaders at White House Following ‘Successful…",
    "link": "https://www.dailysignal.com/2025/08/17/trump-to-host-zelenskyy-eu-leaders-at-white-house-following-successful-russia-summit/",
    "timestamp": "2025-08-17T20:27:51Z"
  },
  {
    "title": "Victor Davis Hanson: ‘The Democratic Party Has Collapsed’",
    "description": "\"It's a whole new counterrevolution and they're melting down\"\nThe post Victor Davis Hanson: ‘The Democratic Party Has Collapsed’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/victor-davis-hanson-the-democratic-party-has-collapsed/",
    "timestamp": "2025-08-17T20:24:34Z"
  },
  {
    "title": "Antonio Brown drops explosive Epstein remark on Donald Trump and Vladimir Putin at Alaska Pursuing Peace summit",
    "description": "Antonio Brown ignited controversy by posting, then deleting, a provocative tweet referencing Donald Trump and Vladimir Putin in connection to the Epstein scandal following their \"Pursuing Peace\" summit in Alaska. The post, a sarcastic jab at the leaders, allu…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/antonio-brown-drops-explosive-epstein-remark-on-donald-trump-and-vladimir-putin-at-alaska-pursuing-peace-summit/articleshow/123351418.cms",
    "timestamp": "2025-08-17T20:15:00Z"
  },
  {
    "title": "The strange second summit on Ukraine",
    "description": "After the damp squib of a summit with Russian president Vladimir Putin, Trump said that it was up to Putin and Ukrainian president Volodymyr Zelenskyy to work things out between them. It was never clear that Putin had agreed to such a meeting and it seems unl…",
    "link": "https://freethoughtblogs.com/singham/2025/08/17/the-strange-second-summit-on-ukraine/",
    "timestamp": "2025-08-17T20:11:14Z"
  },
  {
    "title": "Black mayors of cities Trump called 'lawless' point to decline in violent crime",
    "description": "\"It’s just not true,” said Van Johnson, mayor of Savannah, Georgia. “It’s not supported by any evidence or statistics whatsoever.”",
    "link": "https://www.wcvb.com/article/black-mayors-point-to-violent-crime-declines-trump/65799758",
    "timestamp": "2025-08-17T20:08:40Z"
  },
  {
    "title": "Black mayors of cities Trump called 'lawless' point to decline in violent crime",
    "description": "\"It’s just not true,” said Van Johnson, mayor of Savannah, Georgia. “It’s not supported by any evidence or statistics whatsoever.”",
    "link": "https://www.wtae.com/article/black-mayors-point-to-violent-crime-declines-trump/65799758",
    "timestamp": "2025-08-17T20:08:27Z"
  },
  {
    "title": "Black mayors of cities Trump called 'lawless' point to decline in violent crime",
    "description": "\"It’s just not true,” said Van Johnson, mayor of Savannah, Georgia. “It’s not supported by any evidence or statistics whatsoever.”",
    "link": "https://www.wmur.com/article/black-mayors-point-to-violent-crime-declines-trump/65799758",
    "timestamp": "2025-08-17T20:08:14Z"
  },
  {
    "title": "Ex-Washington Post fact checker hits ‘absentee owner’ Bezos, tells him to commit to saving paper or sell it",
    "description": "In an interview with Fox News Digital, former Washington Post fact checker Glenn Kessler called out Jeff Bezos and the paper's top management as he says the news outlet \"lost its way.\"",
    "link": "https://www.foxnews.com/media/ex-washington-post-fact-checker-hits-absentee-owner-bezos-tells-him-commit-saving-paper-sell",
    "timestamp": "2025-08-17T20:00:19Z"
  },
  {
    "title": "Silence or secrecy? What Putin and Trump didn’t say in Alaska",
    "description": "Blockbuster without an ending: the Alaska summit and what comes next Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623135-silence-or-secrecy-putin-and-trump/",
    "timestamp": "2025-08-17T19:59:45Z"
  },
  {
    "title": "Transgender Deja Vu in Loudoun County",
    "description": "“The predator transgender student or person simply does not exist.” With those infamous words, then-Loudoun County Superintendent Scott Ziegler dismissed the very possibility that a... Read More\nThe post Transgender Deja Vu in Loudoun County appeared first on…",
    "link": "https://www.dailysignal.com/2025/08/17/transgender-deja-vu-loudoun-county/",
    "timestamp": "2025-08-17T19:57:30Z"
  },
  {
    "title": "David Brooks: Trump-Backed Redistricting Is Using 'Mustard Gas on Our Democracy'",
    "description": "Friday, during his weekly appearance on PBS's \"NewsHour,\" New York Times columnist David Brooks said President Donald Trump was using \"mustard gas on our democracy\" by advocating for redistricting in Texas.\nThe post David Brooks: Trump-Backed Redistricting Is…",
    "link": "https://www.breitbart.com/clips/2025/08/17/david-brooks-trump-backed-redistricting-is-using-mustard-gas-on-our-democracy/",
    "timestamp": "2025-08-17T19:55:34Z"
  },
  {
    "title": "Zelensky Declares ‘Impossible’ for Ukraine to Give Up Territory to Russia, Doubles Down on Ceasefire Demand",
    "description": "Ukrainian President Zelensky said on Sunday that it would be “impossible” for Kyiv to cede territory to Russia and reiterated his call for an immediate ceasefire.Speaking from the European Commission headquarters in Brussels ahead of his planned sit-down with…",
    "link": "https://freerepublic.com/focus/f-news/4335118/posts",
    "timestamp": "2025-08-17T19:53:35Z"
  },
  {
    "title": "Zelensky Declares ‘Impossible’ for Ukraine to Give Up Territory to Russia, Doubles Down on Ceasefire Demand",
    "description": "Ukrainian President Zelensky said on Sunday that it would be “impossible” for Kyiv to cede territory to Russia and reiterated his call for an immediate ceasefire.Speaking from the European Commission headquarters in Brussels ahead of his planned sit-down with…",
    "link": "https://freerepublic.com/focus/f-chat/4335118/posts",
    "timestamp": "2025-08-17T19:53:35Z"
  },
  {
    "title": "MAGA Influencer Calls Trump Haters ‘Domestic Terrorists’ In Wild Social Media Post",
    "description": "Riley Gaines, a vocal Trump supporter, previously made national headlines for slamming transgender athletes for competing in women’s sports.",
    "link": "https://www.huffpost.com/entry/riley-gaines-domestic-terrorists-trump-social-media_n_68a20d6ee4b0858c7642b846",
    "timestamp": "2025-08-17T19:52:06Z"
  },
  {
    "title": "Putin agreed to 'robust' security guarantees for Ukraine, says US envoy",
    "description": "Donald Trump's special envoy said Russia had agreed to allow the US and Europe to give Ukraine \"robust\" security guarantees as part of a potential peace deal. Steve Witkoff told CNN it was agreed at the Alaska summit that the US and Europe could \"effectively …",
    "link": "https://freerepublic.com/focus/f-chat/4335117/posts",
    "timestamp": "2025-08-17T19:51:20Z"
  },
  {
    "title": "LEAK: State department offers bonus to employees if they kiss up to Rubio!",
    "description": "LEAK: State department offers bonus to employees if they kiss up to Rubio!\r\n\n \n \n \n (Third column, 1st story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.kenklippenstein.com/p/exclusive-rubio-offers-ass-kissing",
    "timestamp": "2025-08-17T19:49:41Z"
  },
  {
    "title": "Bill Ackman pours billions into 2 tech stocks amid AI boom",
    "description": "The billionaire hedge fund manager is doubling down on AI, making Big Tech a quarter of his portfolio.",
    "link": "https://www.thestreet.com/technology/bill-ackman-pours-billions-into-2-tech-stocks-amid-ai-boom",
    "timestamp": "2025-08-17T19:46:10Z"
  }
]