[
  {
    "title": "Trump refuses to rule out a recession as tariffs bite",
    "description": "When asked if he's expecting a recession this year, Trump said \"I hate to predict things like that.\"",
    "link": "https://www.businessinsider.com/recession-outlook-2025-trump-tariffs-trumpcession-trade-war-economy-growth-2025-3",
    "timestamp": "2025-03-10T13:47:04Z"
  },
  {
    "title": "Trump administration scraps over 80% of USAID programs, top diplomat Rubio says",
    "description": "WASHINGTON (Reuters) -The Trump administration has canceled more than 80 percent of all the programs at U.S. Agency for International Development following a six-week review, U.S. Secretary of State Marco Rubio said on Monday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/10/trump-administration-scraps-over-80-of-usaid-programs-top-diplomat-rubio-says",
    "timestamp": "2025-03-10T13:47:00Z"
  },
  {
    "title": "Carney says Canada’s tariffs to remain in place until U.S. shows ‘respect’",
    "description": "Canada will keep in place its retaliatory tariffs against United States-made products as long as President Donald Trump persists with a trade war, said Mark Carney, the Canadian prime minister-designate.\n“The Canadian government is rightly retaliating with ou…",
    "link": "https://biztoc.com/x/2c36b68a60082a98",
    "timestamp": "2025-03-10T13:46:59Z"
  },
  {
    "title": "Trump, Xi may meet in China in April",
    "description": "United States President Donald Trump could meet with his Chinese counterpart Xi Jinping next month in Beijing, the South China Morning Post reported on Monday, citing multiple American and Chinese dip...",
    "link": "https://biztoc.com/x/76d8be32992f43c8",
    "timestamp": "2025-03-10T13:46:52Z"
  },
  {
    "title": "Ukraine to propose sky, sea truce at US talks in Saudi: Official",
    "description": "Kyiv plans to propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia. President Zelensky is set to meet Saudi Crown Prince Mohammed bin Salman. The US aims to create a peace framework and initial ceasefire. Washington…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-to-propose-sky-sea-truce-at-us-talks-in-saudi-official/articleshow/118849572.cms",
    "timestamp": "2025-03-10T13:46:30Z"
  },
  {
    "title": "Will the United Nations Survive Trump 2.0?",
    "description": "Recent actions by the United States may foreshadow its withdrawal from the world’s foremost multilateral institution. Paradoxically, however, the breakdown of the multilateral order the US helped establish nearly eight decades ago could serve as a catalyst fo…",
    "link": "https://www.project-syndicate.org/commentary/will-the-un-survive-trump-second-term-by-jayati-ghosh-2025-03",
    "timestamp": "2025-03-10T13:46:24Z"
  },
  {
    "title": "Musk's Tesla facilities in US face 'Takedown' protests",
    "description": "It is part of an effort to protest the role Tesla's billionaire owner, Elon Musk, has played in the Trump administration.",
    "link": "https://www.bbc.com/news/articles/cnvze9dzq8vo",
    "timestamp": "2025-03-10T13:45:53Z"
  },
  {
    "title": "‘How embarrassing’: NYPD shows up in full force to protect Cybertruck on Women’s March route",
    "description": "As Elon Musk's political influence swells in the Trump administration, acts of vandalism against his signature products are spiking. \n\n\nRecent reports of arson and egging of Cybertrucks and Teslas, as well as protesters collecting at dealerships across the na…",
    "link": "https://www.dailydot.com/debug/nypd-cybertruck-cops-womens-march/",
    "timestamp": "2025-03-10T13:44:18Z"
  },
  {
    "title": "Trump administration scraps over 80% of USAID programs, top diplomat Rubio says",
    "description": "Following a six-week review, the Trump administration has canceled over 80 percent of programs at the U.S. Agency for International Development. The decision, announced by Secretary of State Marco Rubio, aims to streamline aid efforts in line with the 'Americ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-scraps-over-80-of-usaid-programs-top-diplomat-rubio-says/articleshow/118849496.cms",
    "timestamp": "2025-03-10T13:44:00Z"
  },
  {
    "title": "'Beyond anything...': Trump warns of 'big monster' nuclear weapons that pose 'greatest' threat to US",
    "description": "The US president Donald Trump said he thinks nuclear weapons are more dangerous threat than the climate crisis. Trump spoke of the dangers of nuclear stockpiles around the world and lamented the huge amount of money spent on maintaining the ‘big monsters’ tha…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-nuclear-weapon-warning-beyond-anything-trump-warns-of-big-monster-nuclear-weapons-that-pose-greatest-threat-to-us-climate-change/articleshow/118849353.cms",
    "timestamp": "2025-03-10T13:43:54Z"
  },
  {
    "title": "Why is this week important for Ukraine's future?",
    "description": "Donald Trump believes Kyiv is now ready to \"move forward\" with a ceasefire with Russia. BBC News correspondent James Waterhouse explains what it means for Ukraine.",
    "link": "https://www.bbc.com/news/videos/c04zgkrgdq0o",
    "timestamp": "2025-03-10T13:43:34Z"
  },
  {
    "title": "Who Is Mark Carney? Former Goldman Sachs Banker And Trump Critic Is Canada’s New Prime Minister.",
    "description": "Canada’s new leader previously denounced Trump’s planned tariffs on the country, saying Canadians would “stand up to a bully.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/03/10/who-is-mark-carney-former-goldman-sachs-banker-and-trump-critic-is-canadas-new-prime-minister/",
    "timestamp": "2025-03-10T13:43:24Z"
  },
  {
    "title": "How Canada's Next Leader Could Use Anti-Trump Sentiment To His Advantage In The Upcoming Election",
    "description": "Carney, who will take over the leadership of both his party and his country, is expected to call a snap election shortly after being sworn into office.",
    "link": "https://www.huffpost.com/entry/donald-trump-impact-canada-election_n_67ceaf2ee4b0d416d844c77b",
    "timestamp": "2025-03-10T13:43:16Z"
  },
  {
    "title": "Supreme Court Will Take Up State Bans On Conversion Therapy For LGBTQ+ Children",
    "description": "The conservative-led court is taking up the case amid aggressive actions by President Donald Trump targeting transgender people.",
    "link": "https://www.huffpost.com/entry/supreme-court-conversion-therapy_n_67ceebb8e4b0d416d844fbc0",
    "timestamp": "2025-03-10T13:42:52Z"
  },
  {
    "title": "Supreme Court will take up state bans on conversion therapy for LGBTQ+ children, in a Colorado case",
    "description": "The Supreme Court has agreed to decide whether state and local governments can enforce laws banning conversion therapy for LGBTQ+ children, in a Colorado case",
    "link": "https://abcnews.go.com/Health/wireStory/supreme-court-state-bans-conversion-therapy-lgbtq-children-119630365",
    "timestamp": "2025-03-10T13:42:42Z"
  },
  {
    "title": "Stocks slump after Trump declines to rule out recession",
    "description": "Stocks slump after Trump declines to rule out recessiongo.com",
    "link": "https://abcnews.go.com/Business/stocks-slump-after-trump-declines-rule-recession/story?id=119626168",
    "timestamp": "2025-03-10T13:42:21Z"
  },
  {
    "title": "US ‘not seeking deal’ with EU on tariffs, says Commission trade chief",
    "description": "Šefčovič vowed to protect European businesses and citizens from Trump's \"unjustified\" trade measures, but noted that Brussels' \"doors\" remain \"open for constructive engagement\" with Washington.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/us-not-seeking-deal-with-eu-on-tariffs-says-commission-trade-chief/",
    "timestamp": "2025-03-10T13:41:17Z"
  },
  {
    "title": "Kremlin says process of restoring Russia-US ties still in ‘initial stages'",
    "description": "The process of restoring relations between Moscow and Washington is still in its “initial stages,” the Kremlin said on Monday, as bilateral contacts began after Donald Trump took over as US president in January. -snip- Peskov, however, denied media reports th…",
    "link": "https://freerepublic.com/focus/f-chat/4303302/posts",
    "timestamp": "2025-03-10T13:39:36Z"
  },
  {
    "title": "Trump Confronted on Air Force One Over Fox News Interview — Says ‘The Plane Is Landing’ Mid-Answer",
    "description": "Trump was confronted on AF11 over an answer he gave during a Fox News interview — which he doubled down on just before announcing \"The plane is landing.\"\nThe post Trump Confronted on Air Force One Over Fox News Interview — Says ‘The Plane Is Landing’ Mid-Answ…",
    "link": "https://www.mediaite.com/news/trump-confronted-on-air-force-one-over-fox-news-interview-says-the-plane-is-landing-in-mid-answer/",
    "timestamp": "2025-03-10T13:39:35Z"
  },
  {
    "title": "Trump Crypto Warning—Do Not Buy These Coins",
    "description": "You must not buy into this crypto—here's why.",
    "link": "https://www.forbes.com/sites/zakdoffman/2025/03/10/trump-crypto-warning-do-not-buy-these-coins/",
    "timestamp": "2025-03-10T13:39:21Z"
  },
  {
    "title": "From Holocaust to Oct. 7: The story of the cartoon given to Trump by former hostages",
    "description": "The cartoon illustrated a clear, visual link between the tragedies of the Holocaust and the Nazis’ treatment of the Jews, compared to the hostages held in captivity by Hamas since October 7.",
    "link": "https://www.jpost.com/american-politics/article-845463",
    "timestamp": "2025-03-10T13:38:32Z"
  },
  {
    "title": "Stocks Are Sliding as Trump Fails to Rule Out a Recession",
    "description": "2 min ago\nStocks Are Sliding as Trump Fails to Rule Out a Recession\nStock market selling resumed at the start of Monday’s session after President Donald Trump didn’t rule out a potential recession in an interview that aired on Fox News over the weekend.\nThe D…",
    "link": "https://biztoc.com/x/86e59a182589ad77",
    "timestamp": "2025-03-10T13:36:01Z"
  },
  {
    "title": "Pro-Russian candidate to challenge bar on Romanian presidential run",
    "description": "The move follows rioting in Bucharest overnight after a court threw far-right Calin Georgescu out of the race.",
    "link": "https://www.aljazeera.com/news/2025/3/10/pro-russian-candidate-to-challenge-bar-on-romanian-presidential-run",
    "timestamp": "2025-03-10T13:35:58Z"
  },
  {
    "title": "Donald Trump bets propel Michael Platt’s BlueCrest to 15% gain",
    "description": "Hedge fund turned family office eclipses rivals with currency and bond wagers on a slowing US economy",
    "link": "https://biztoc.com/x/82dbf85ed4287b7b",
    "timestamp": "2025-03-10T13:35:48Z"
  },
  {
    "title": "Donald Trump Defends Amy Coney Barrett After MAGA Attacks",
    "description": "The Supreme Court justice faced scrutiny from conservatives for voting against the president in a recent ruling.",
    "link": "https://biztoc.com/x/7877c01718c5736e",
    "timestamp": "2025-03-10T13:35:38Z"
  },
  {
    "title": "US plunges at open on economic growth worries",
    "description": "Wall Street started Monday's session with losses after a plunge in the premarket trade. United States President Donald Trump did not rule out recession in an interview on Sunday, stating that he \"hate...",
    "link": "https://biztoc.com/x/8433c1971816bd80",
    "timestamp": "2025-03-10T13:35:29Z"
  },
  {
    "title": "Donald Trump Defends Amy Coney Barrett After MAGA Attacks",
    "description": "The Supreme Court justice faced scrutiny from conservatives for voting against the president in a recent ruling.",
    "link": "https://www.newsweek.com/donald-trump-amy-coney-barrett-maga-attacks-supreme-court-2042113",
    "timestamp": "2025-03-10T13:33:49Z"
  },
  {
    "title": "Wall Street Is Quietly Hinting At Major Ideological Shift Toward Bitcoin This Year",
    "description": "From financial advisor surveys and money flows to Wall Street’s recent investments, a mounting pile of data points to a major ideological shift about Bitcoin at an institutional level—one that goes beyond empty talk.",
    "link": "https://www.forbes.com/sites/danrunkevicius/2025/03/10/wall-street-is-quietly-hinting-at-major-ideological-shift-toward-bitcoin-this-year/",
    "timestamp": "2025-03-10T13:32:49Z"
  },
  {
    "title": "Stock Market Comeback Erased: Dow Sinks As Trump Says Don’t ‘Watch The Stock Market’",
    "description": "The Nasdaq Composite entered a 10% correction from its February high Monday, with Nvidia and Tesla stocks again headlining losses.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/10/stock-market-comeback-erased-dow-sinks-as-trump-says-dont-watch-the-stock-market/",
    "timestamp": "2025-03-10T13:32:31Z"
  },
  {
    "title": "JD Vance's cousin Nate Vance, who fought in Ukraine, voices disdain for the VP and Donald Trump",
    "description": "Nate Vance claims he joined the Ukraine war in 2022 as part of the country’s Da Vinci Wolves First Motorized Battalion volunteer unit. In an interview, he also urged his cousin and Vice President JD Vance to listen to his first-person account about the Russia…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jd-vances-cousin-nate-vance-who-fought-in-ukraine-voices-disdain-for-the-vp-and-donald-trump/articleshow/118849024.cms",
    "timestamp": "2025-03-10T13:32:03Z"
  },
  {
    "title": "Bloody Sunday: Maxine Waters, Joy Reid & Angela Rye Join 60th Anniversary March in Selma; Hakeem Jeffries Speaks",
    "description": "Bloody Sunday 60th anniversary march in Selma, Alabama and another ceremonial march in Little Rock, Arkansas hosted by NAACP\nThe post Bloody Sunday: Maxine Waters, Joy Reid & Angela Rye Join 60th Anniversary March in Selma; Hakeem Jeffries Speaks appeared fir…",
    "link": "http://bossip.com/2803432/bloody-sunday-60th-anniversary-march-in-selma-alabama/",
    "timestamp": "2025-03-10T13:31:33Z"
  },
  {
    "title": "US Government Should Buy 25% Of Bitcoin Supply By 2035, Says Strategy Founder Michael Saylor",
    "description": "Strategy founder Michael Saylor has urged the United States government to purchase up to 25% of Bitcoin’s supply over the next decade.",
    "link": "https://zycrypto.com/us-government-should-buy-25-of-bitcoin-supply-by-2035-says-strategy-founder-michael-saylor/",
    "timestamp": "2025-03-10T13:31:09Z"
  },
  {
    "title": "JD Vance Calls Out Screaming Protesters for ‘Chasing’ His 3-Year-Old Daughter",
    "description": "Vice President J.D. Vance called out pro-Ukrainian protesters Saturday for screaming as they chased him down on a walk with his 3-year-old daughter, Mirabel. “Today while walking my 3 year old daughter a group of ‘Slava Ukraini’ protesters followed us around …",
    "link": "https://freerepublic.com/focus/f-news/4303299/posts",
    "timestamp": "2025-03-10T13:30:05Z"
  },
  {
    "title": "Democrat Senator Mark Kelly Visits Ukraine, Calls President Trump’s Pressure on Zelenskyy to Help Bring an End to Russia’s War “Sickening”",
    "description": "Senator Mark Kelly's recent visit to Ukraine highlights his stark criticism of President Trump's approach to the ongoing conflict, labeling it as detrimental. His insights shed light on the urgent need for continued U.S. support for Ukraine.\nThe post Democrat…",
    "link": "https://www.thegatewaypundit.com/2025/03/democrat-senator-mark-kelly-visits-ukraine-calls-president/",
    "timestamp": "2025-03-10T13:30:04Z"
  },
  {
    "title": "Meet the federal worker who went rogue: 'I hope that it lights a fire under people'",
    "description": "To Elon Musk and DOGE, Karen Ortiz may be a faceless bureaucrat. But to some of her colleagues, she's giving a voice to those who feel they can't speak out.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_ad42fca5-4dfb-50de-bf39-9a6448f01e93.html",
    "timestamp": "2025-03-10T13:30:00Z"
  },
  {
    "title": "Trump Is Leading an ‘All-Out Assault’ on the Climate",
    "description": "The president is threatening the government’s ability to regulate greenhouse gas emissions, firing scientists, and undermining electric vehicles",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-climate-weather-epa-noaa-1235292543/",
    "timestamp": "2025-03-10T13:30:00Z"
  },
  {
    "title": "Meet the federal worker who went rogue: 'I hope that it lights a fire under people'",
    "description": "To Elon Musk and DOGE, Karen Ortiz may be a faceless bureaucrat. But to some of her colleagues, she's giving a voice to those who feel they can't speak out.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d3cd3337-99d9-5027-879d-6dcdf6c70226.html",
    "timestamp": "2025-03-10T13:30:00Z"
  },
  {
    "title": "The IRS Bleeds",
    "description": "Plus: Ceasefire talks, J.D. Vance as the future of the GOP, the government's war on treehouses, and more...",
    "link": "https://reason.com/2025/03/10/the-irs-bleeds/",
    "timestamp": "2025-03-10T13:28:49Z"
  },
  {
    "title": "On the Biden-era economy, Republicans scramble to rewrite history",
    "description": "The problem is not just that Donald Trump and his allies are trying to gaslight the public on the Biden-era economy. It’s also that they feel like they have to.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biden-era-economy-republicans-scramble-rewrite-history-rcna195604",
    "timestamp": "2025-03-10T13:27:09Z"
  },
  {
    "title": "Trump Defends Amy Coney Barrett",
    "description": "“President Donald Trump defended Supreme Court Justice Amy Coney Barrett on Sunday after she faced attacks from his supporters for being part of the court majority that ruled to reject the Trump administration’s freeze on",
    "link": "https://politicalwire.com/2025/03/10/trump-defends-amy-coney-barrett/",
    "timestamp": "2025-03-10T13:25:30Z"
  },
  {
    "title": "US To Cancel 83 Percent Of USAID Programs, Says Marco Rubio",
    "description": "US Secretary of State Marco Rubio said Monday the United States was cancelling 83 percent of programs at the US Agency for International Development (USAID).",
    "link": "https://www.ndtv.com/world-news/us-to-cancel-83-percent-of-us-agency-for-international-development-usaid-programs-says-marco-rubio-7892584",
    "timestamp": "2025-03-10T13:25:00Z"
  },
  {
    "title": "State Department diplomacy official scrambles to delete attacks on Marco Rubio's sexuality",
    "description": "The recently appointed acting under secretary of state for public diplomacy has been busy deleting posts on social media where he questioned Secretary of State Marco Rubio's sexuality and cast aspersions on his IQ.According to a report from CNN, Darren Beatti…",
    "link": "https://www.rawstory.com/rubio-sexuality/",
    "timestamp": "2025-03-10T13:24:40Z"
  },
  {
    "title": "President Trump's Trade War Is Here: Here's How Investors Can Benefit",
    "description": "Well, that didn't take long.\nIn just a matter of weeks, President Donald Trump's tariff threats have gone from what many believed to be just saber-rattling to a full-blown trade war with the United States' closest trading partners: Canada, Mexico, and China.\n…",
    "link": "https://biztoc.com/x/d75249532b371e95",
    "timestamp": "2025-03-10T13:24:27Z"
  },
  {
    "title": "Gold rate today: Gold price drops as US Dollar bounces back. Details here",
    "description": "Gold price today went down after the US dollar index slightly pared losses after hitting its lowest in over 4-months on Friday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-rate-today-gold-price-drops-as-us-dollar-bounces-back-details-here/articleshow/118848888.cms",
    "timestamp": "2025-03-10T13:24:05Z"
  },
  {
    "title": "Trump administration scraps over 80% of USAID programs, top diplomat Rubio says",
    "description": "WASHINGTON:  The Trump administration has closed more than 80 per cent of programs and 5,200 contracts at the US Agency for International Development, Secretary of State Marco Ru",
    "link": "https://www.channelnewsasia.com/world/donald-trump-administration-scraps-over-80-usaid-programs-marc-rubio-4990836",
    "timestamp": "2025-03-10T13:24:01Z"
  },
  {
    "title": "Stock market today: Volatility persists on Wall Street as tariffs continue to drag on confidence",
    "description": "By ELAINE KURTENBACH and MATT OTT, Associated Press Business Writers\nVolatility returned to Wall Street Monday, with most major U.S. indices swinging to significant losses after President Donald Trump dismissed concerns over the possibility of his upcoming ta…",
    "link": "https://biztoc.com/x/40f2bea31428e2cc",
    "timestamp": "2025-03-10T13:24:00Z"
  },
  {
    "title": "Ford to hold news conference as Ontario threatens 25% surcharge on U.S.-bound electricity",
    "description": "Premier Doug Ford is set to hold a news conference Monday morning as Ontario prepares to move ahead with a 25 per cent surcharge on U.S.-bound electricity in response to President Donald Trump's tariffs.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-electricity-tariffs-ford-trump-1.7479180",
    "timestamp": "2025-03-10T13:23:52Z"
  },
  {
    "title": "Watch Energy Secretary Chris Wright speak live about Trump's energy agenda",
    "description": "Wright is member of Trump's National Energy Dominance Council, the former CEO of Liberty Energy and a former board member of the nuclear startup Oklo.",
    "link": "https://www.cnbc.com/2025/03/10/watch-energy-secretary-chris-wright-speak-live-about-trumps-energy-agenda.html",
    "timestamp": "2025-03-10T13:23:02Z"
  },
  {
    "title": "Russia's Vladimir Putin will attack 3 Baltic nations soon, claims NATO ex-commander",
    "description": "Former NATO deputy supreme allied commander Sir Richard Shirreff warns that Russian President Vladimir Putin may attack more European countries after Ukraine, citing Baltics as the next targets. He criticizes US President Trump's stance on NATO and urges west…",
    "link": "https://economictimes.indiatimes.com/news/defence/russias-vladimir-putin-will-attack-3-baltic-nations-soon-claims-nato-ex-commander/articleshow/118848910.cms",
    "timestamp": "2025-03-10T13:22:38Z"
  },
  {
    "title": "Russia's Vladimir Putin will attack 3 Baltic nations soon, claims NATO ex-commander",
    "description": "Former NATO deputy supreme allied commander Sir Richard Shirreff warns that Russian President Vladimir Putin may attack more European countries after Ukraine, citing Baltics as the next targets. He criticizes US President Trump's stance on NATO and urges west…",
    "link": "https://economictimes.indiatimes.com/news/defence/russias-vladimir-putin-will-attack-3-baltic-nations-soon-claims-nato-ex-commander/articleshow/118848098.cms",
    "timestamp": "2025-03-10T13:22:38Z"
  },
  {
    "title": "How Trump Created a South African Team of Rivals",
    "description": "Pressure from Washington has united long-standing political enemies and cemented the government of national unity.",
    "link": "http://foreignpolicy.com/2025/03/10/trump-south-africa-anc-da-gnu-rivals-allies/",
    "timestamp": "2025-03-10T13:21:57Z"
  },
  {
    "title": "Amazon to begin streaming Trump’s ‘The Apprentice’",
    "description": "Amazon has announced it will begin streaming \"The Apprentice\" — the reality TV show famous for boosting the profile of President Donald Trump — on its Prime Video service from Monday.",
    "link": "https://www.nbcnews.com/news/us-news/amazon-begin-streaming-trumps-apprentice-rcna195590",
    "timestamp": "2025-03-10T13:21:11Z"
  },
  {
    "title": "Jeff Bezos bought total creative control of the James Bond franchise for $1 billion",
    "description": "In December, the Wall Street Journal published a status report on the James Bond franchise, given Amazon’s purchase of MGM. MGM was the longtime home of the Bond franchise, although MGM didn’t have sole “ownership” of the 007 property. James Bond was owned by…",
    "link": "https://www.celebitchy.com/912601/jeff_bezos_bought_total_creative_control_of_the_james_bond_franchise_for_1_billion/",
    "timestamp": "2025-03-10T13:20:37Z"
  },
  {
    "title": "Carney says Canada’s tariffs to remain in place until U.S. shows ‘respect’",
    "description": "Canada will keep in place its retaliatory tariffs against US-made products as long as Donald Trump persists with a trade war. Read more here",
    "link": "https://financialpost.com/news/economy/canada-tariffs-stay-until-us-shows-respect",
    "timestamp": "2025-03-10T13:20:27Z"
  },
  {
    "title": "New federal Liberal leader must be ready to defend against U.S. threats, say N.B. MP, prof",
    "description": "When Mark Carney took home the Liberal leadership Sunday night, making him prime minister-designate, Saint John-Rothesay MP Wayne Long took to social media with the message, \"Well it looks like I'm back!\"",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/mark-carney-wayne-long-liberal-leader-1.7479167",
    "timestamp": "2025-03-10T13:20:23Z"
  },
  {
    "title": "CBS Warns That FCC Action On ’60 Minutes’ Complaint Would Create “A Less Free World” Where Government Becomes “A Roving Censor”",
    "description": "CBS is calling out the FCC’s inquiry into how 60 Minutes edited an interview with Kamala Harris as inappropriate for the federal agency, while warning that...",
    "link": "https://deadline.com/2025/03/trump-60-minutes-cbs-fcc-1236320668/",
    "timestamp": "2025-03-10T13:19:44Z"
  },
  {
    "title": "Rubio says Trump administration canceling 83% of programs at USAID and intends to move remaining ones to State Department",
    "description": "The Trump administration is canceling 83% of programs at the US Agency for International Development and intends to fold the remaining programs under the State Department, Secretary of State Marco Rubio said Monday.",
    "link": "https://www.cnn.com/2025/03/10/politics/rubio-usaid-contracts-state-department/index.html",
    "timestamp": "2025-03-10T13:19:32Z"
  },
  {
    "title": "Egypt or Donald Trump: Whose plan for Gaza's future is better?",
    "description": "Some commentators, claiming to know Trump’s methods, maintained that he had deliberately used shock tactics to goad the Arab world into playing a more active role in Gaza’s future.",
    "link": "https://www.jpost.com/opinion/article-845461",
    "timestamp": "2025-03-10T13:18:32Z"
  },
  {
    "title": "Mahmoud Khalil: Meet the Columbia University graduate taken into custody by Donald Trump administration",
    "description": "Palestinian activist Mahmoud Khalil, a graduate student at the university until December last year, was arrested by plainclothes officers of the US Immigration and Customs Enforcement on Saturday. This is the maiden known deportation effort by the Donald Trum…",
    "link": "https://economictimes.indiatimes.com/news/international/us/mahmoud-khalil-meet-the-columbia-university-graduate-taken-into-custody-by-donald-trump-administration/articleshow/118848655.cms",
    "timestamp": "2025-03-10T13:17:29Z"
  },
  {
    "title": "'Elon Musk has got to go': Why are Tesla facilities being attacked worldwide? Know in 10 points",
    "description": "Tesla facilities have been facing a wave of attacks worldwide. Six protesters were arrested at a Tesla showroom in Manhattan on Saturday, cops said. This comes amid Elon Musk's involvement in US politics after he was picked by Donald Trump to lead Department …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-tesla-protests-elon-musk-has-got-to-go-why-are-tesla-facilities-being-attacked-worldwide-know-in-10-points/articleshow/118848104.cms",
    "timestamp": "2025-03-10T13:16:41Z"
  },
  {
    "title": "When feelings don’t match the headline figures",
    "description": "There’s a clear divide over some sunnier economic data that’s been released over the past few months and how consumers are actually experiencing this economy. On today’s show, we discuss how some headline figures — like unemployment and inflation — can mislea…",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/when-feelings-dont-match-the-headline-figures/",
    "timestamp": "2025-03-10T13:16:01Z"
  },
  {
    "title": "Consumer Reports calls out slapdash AI voice-cloning safeguards",
    "description": "Study finds 4 out of 6 providers don't do enough to stop impersonation\nFour out of six companies offering AI voice cloning software fail to provide meaningful safeguards against the misuse of their products, according to research conducted by Consumer Reports…",
    "link": "https://www.theregister.com/2025/03/10/ai_voice_cloning_safeguards/",
    "timestamp": "2025-03-10T13:15:09Z"
  },
  {
    "title": "PSLF Eligibility And Student Loan Forgiveness Turmoil Spark Panic",
    "description": "The collapse of the Education Department’s student loan forgiveness programs and PSLF restrictions have left millions in financial limbo.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/03/10/student-loan-forgiveness-pslf-and-education-department-chaos-spark-panic/",
    "timestamp": "2025-03-10T13:15:00Z"
  },
  {
    "title": "President's Former Lawyer Names 'The Thing That Sinks Trump's Presidency'",
    "description": "\"Here's where the story turns,\" Michael Cohen wrote.",
    "link": "https://www.huffpost.com/entry/michael-cohen-thing-that-sinks-trumps-presidency_n_67cec3b6e4b0204ff2daa3be",
    "timestamp": "2025-03-10T13:14:34Z"
  },
  {
    "title": "Donald Trump’s ‘The Apprentice’ Seasons 1-7 to Stream on Amazon Prime Video",
    "description": "“The Apprentice” is coming to Prime Video. Amazon announced on Monday that the former reality competition series hosted by current U.S. President Donald Trump will be available to stream on Prime Video beginning today, March 10, in the United States only. Sea…",
    "link": "https://variety.com/2025/tv/news/donald-trump-the-apprentice-streaming-amazon-prime-video-1236333072/",
    "timestamp": "2025-03-10T13:14:28Z"
  },
  {
    "title": "Prime Video To Stream Donald Trump’s TV Series ‘The Apprentice’",
    "description": "Prime Video is to stream Seasons 1-7 of President Donald Trump’s competition show The Apprentice. Each season of the show, which launched 20 years ago on NBC, will roll out weekly, with Season 1 launching today. Seasons will roll out until April 27. The Appre…",
    "link": "http://deadline.com/2025/03/donald-trump-the-apprentice-tv-series-prime-video-1236320663/",
    "timestamp": "2025-03-10T13:14:12Z"
  },
  {
    "title": "European lawmakers silent on US Bitcoin reserve amid digital euro push",
    "description": "European lawmakers have remained silent on the United States’ Strategic Bitcoin Reserve order, a landmark policy shift favoring early adopters of Bitcoin due to its economic model.US President Donald Trump’s March 7 executive order outlined a plan to create a…",
    "link": "https://cointelegraph.com/news/european-lawmakers-silent-trump-bitcoin-reserve-amid-cbdc-push",
    "timestamp": "2025-03-10T13:13:38Z"
  },
  {
    "title": "Trump Says 'No Clash' Between Musk and Rubio",
    "description": "President Donald Trump denied reports Friday of a clash between Secretary of State Marco Rubio and Elon Musk over sweeping government cuts during a Cabinet meeting Thursday at the White House.\n“No clash, I was there,” Trump told reporters Friday afternoon. “E…",
    "link": "https://biztoc.com/x/80d84abbdaf296c7",
    "timestamp": "2025-03-10T13:13:17Z"
  },
  {
    "title": "What to know about Mark Carney, Canada’s next prime minister",
    "description": "Canada’s next prime minister has helped run two Group of Seven economies in crisis before and now will try to steer Canada through a looming trade war brought by U.S. President Donald Trump, a threat of annexation, and an expected federal election.Former cent…",
    "link": "https://biztoc.com/x/dde2e442150e21da",
    "timestamp": "2025-03-10T13:12:57Z"
  },
  {
    "title": "Is millennials’ fancy favorite superfood 'avocado' toast destroying the planet? Here is what expert says",
    "description": "Avocado farming is causing significant environmental damage, including deforestation and excessive water use, to meet global demand. Experts, like Alan Titchmarsh, highlight the fruit's high carbon footprint and adverse impacts on local communities. With risi…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/is-millennials-fancy-favorite-superfood-avocado-toast-destroying-the-planet-here-is-what-expert-says/articleshow/118848158.cms",
    "timestamp": "2025-03-10T13:11:52Z"
  },
  {
    "title": "Rex Shares and Osprey Funds File for MOVE ETF",
    "description": "The proposed REX-Osprey MOVE ETF would invest at least 80% of its assets in MOVE or related instruments.",
    "link": "https://www.coindesk.com/markets/2025/03/10/rex-shares-and-osprey-funds-file-for-move-etf",
    "timestamp": "2025-03-10T13:11:20Z"
  },
  {
    "title": "TSMC chip plans in US fuel China security fears in Taiwan",
    "description": "Chip giant TSMC investing a further $100 billion in US production facilities has set off alarm bells in Taiwan over the integrity of the self-ruled island's \"silicon shield\" against Chinese aggression.",
    "link": "https://www.dw.com/en/tsmc-chip-plans-in-us-fuel-china-security-fears-in-taiwan/a-71877492",
    "timestamp": "2025-03-10T13:11:00Z"
  },
  {
    "title": "Utah pivots away from state Bitcoin reserve in landmark crypto legislation",
    "description": "Utah’s State Senate has stripped a provision for a state-backed Bitcoin reserve from its recently passed crypto bill. The Blockchain and Digital Innovation Amendments bill (HB230) aims to establish clear guidelines for crypto use within the state. The origina…",
    "link": "https://cryptoslate.com/utah-pivots-away-from-state-bitcoin-reserve-in-landmark-crypto-legislation/",
    "timestamp": "2025-03-10T13:10:59Z"
  },
  {
    "title": "Rubio says purge of USAID programs complete, with 83% of agency's programs gone",
    "description": "Washington — Secretary of State Marco Rubio said Monday the Trump administration had finished its six-week purge of programs of the six-decade-old U.S. Agency for International Development, and said he would move the 18% of aid and development programs that s…",
    "link": "https://www.voanews.com/a/rubio-says-purge-of-usaid-programs-complete-with-83-of-agency-s-programs-gone-/8005107.html",
    "timestamp": "2025-03-10T13:10:50Z"
  },
  {
    "title": "Stock market today: Volatility persists on Wall Street as tariffs continue to drag on confidence",
    "description": "Volatility returned to Wall Street, with most major U.S. indices swinging to significant losses early in the trading day.",
    "link": "https://www.denverpost.com/2025/03/10/volatility-persists-financial-markets/",
    "timestamp": "2025-03-10T13:10:41Z"
  },
  {
    "title": "Stock market today: Volatility persists on Wall Street as tariffs continue to drag on confidence",
    "description": "Volatility returned to Wall Street, with most major U.S. indices swinging to significant losses early in the trading day.",
    "link": "https://www.bostonherald.com/2025/03/10/volatility-persists-financial-markets/",
    "timestamp": "2025-03-10T13:10:41Z"
  },
  {
    "title": "Ukraine betrayal: Who does Netanyahu have if Trump turns his back on Israel?",
    "description": "At least Zelensky has the Europeans to fall back on if he loses US support altogether. Who does Netanyahu have?",
    "link": "https://www.jpost.com/opinion/article-845455",
    "timestamp": "2025-03-10T13:08:53Z"
  },
  {
    "title": "Russia Responds to Reports of New Meeting With Trump Allies in Saudi Arabia",
    "description": "Only Kyiv—and not Moscow—will meet with U.S. officials in Saudi Arabia this week to discuss ending the war, contradicting earlier reports.",
    "link": "https://www.newsweek.com/russia-responds-reports-new-meeting-trump-allies-saudi-arabia-2042072",
    "timestamp": "2025-03-10T13:07:01Z"
  },
  {
    "title": "Watch: Lady Gaga hilariously channels inner 57-year-old in SNL ‘Little Red Glasses’ skit",
    "description": "Lady Gaga channelled her inner middle-America bookstore-owner on Saturday Night Live this past weekend, entertaining people so much that “SNL Little Red Glasses skit” started trending on social media. The popstar got the chance to show off her funny side by h…",
    "link": "https://www.thepinknews.com/2025/03/10/lady-gaga-little-red-glasses-skit/",
    "timestamp": "2025-03-10T13:06:38Z"
  },
  {
    "title": "Tariffs could make some popular side hustles and small businesses harder to run: 'The expenses have already started,' CEO says",
    "description": "The Trump administration's China tariffs could have an unintended consequence, some CEOs say: a higher barrier to entry for American entrepreneurs.",
    "link": "https://www.cnbc.com/2025/03/10/how-tariffs-could-make-some-side-hustles-small-businesses-harder-to-run.html",
    "timestamp": "2025-03-10T13:05:01Z"
  },
  {
    "title": "Trump wants Zelensky to quit – NBC",
    "description": "The US president has reportedly insisted that the Ukrainian leader should be willing to hold an election and possibly step down Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613971-trump-zelensky-us-ukraine/",
    "timestamp": "2025-03-10T13:02:06Z"
  },
  {
    "title": "Stock of the Day: Coinbase falls 5% on crypto-summit disappointment, S&P 500 snub",
    "description": "Trump's hotly anticipated crypto summit failed to lift prices, and the company was also left out of the benchmark S&P 500.",
    "link": "https://www.businessinsider.com/coinbase-stock-price-selloff-spx-listing-crypto-summit-trump-bitcoin-2025-3",
    "timestamp": "2025-03-10T13:01:44Z"
  },
  {
    "title": "Bitcoin falls after hopes that purchases will boost Trump's strategic crypto reserve are dashed",
    "description": "Only bitcoin already held by the US government will be included in President Donald Trump's crypto strategic reserve.",
    "link": "https://www.businessinsider.com/bitcoin-xrp-ether-national-strategic-reserve-digital-asset-stockpile-2025-3",
    "timestamp": "2025-03-10T13:01:08Z"
  },
  {
    "title": "Greenland election closely watched by the world — and Trump",
    "description": "US President Donald Trump's urge to make Greenland part of the United States means the parliamentary election in the autonomous Danish territory will be a global event.",
    "link": "https://www.dw.com/en/greenland-election-donald-trump-plans-v2/a-71864584",
    "timestamp": "2025-03-10T13:01:00Z"
  },
  {
    "title": "Father Of The Year JD Vance Just Trying To Maintain Work-Life Balance",
    "description": "Why is the left making him terrorize his toddler?",
    "link": "https://www.wonkette.com/p/father-of-the-year-jd-vance-just",
    "timestamp": "2025-03-10T13:00:13Z"
  },
  {
    "title": "TRUMP SLUMP",
    "description": "US President Donald Trump won the election with the promise to end wars and Make America Great Again, but he appears to be driving the United States into stagflation and strategic blunders just weeks into the term",
    "link": "https://www.firstpost.com/world/trump-bump-turns-into-trump-slump-3-big-reasons-13870336.html",
    "timestamp": "2025-03-10T13:00:03Z"
  },
  {
    "title": "Murdoch’s Next Move: How Rupert Could Box Out His Children and Keep Control of the Fox Empire",
    "description": "The 93-year-old media titan is locked in a legal feud with his kids over attempts to consolidate power under eldest son Lachlan\nThe post Murdoch’s Next Move: How Rupert Could Box Out His Children and Keep Control of the Fox Empire appeared first on TheWrap.",
    "link": "https://www.thewrap.com/rupert-murdoch-trust-battle-succession-fox-news-corp-analysis/",
    "timestamp": "2025-03-10T13:00:00Z"
  },
  {
    "title": "Photo of Churchill visiting White House in 'siren-suit' during WWII is authentic",
    "description": "A photograph authentically depicts then-British Prime Minister Winston Churchill visiting the White House in the U.S. during World War II wearing a “siren-suit.”",
    "link": "https://www.snopes.com//fact-check/churchill-siren-suit-white-house/",
    "timestamp": "2025-03-10T13:00:00Z"
  },
  {
    "title": "Eby maps out B.C.'s trade-war power strategy with an eye on Doug Ford and Elon Musk",
    "description": "B.C. unlikely to follow Ontario's lead in slapping surplus on power exports, premier says.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/b-c-trade-war-power-strategy-1.7477914",
    "timestamp": "2025-03-10T13:00:00Z"
  },
  {
    "title": "Russia Bombs Ukraine’s Gas System But Experts Say Russia May Implode",
    "description": "The economic sanctions and boycotts of Russian oil and gas must persist—and why Trump must set aside his pride and support Ukraine in its effort to stay a free nation.",
    "link": "https://www.forbes.com/sites/kensilverstein/2025/03/10/russia-bombs-ukraines-gas-system-but-experts-say-russia-may-implode/",
    "timestamp": "2025-03-10T13:00:00Z"
  },
  {
    "title": "Scientists Say Trump Cuts Threaten Climate Research, Public Safety",
    "description": "Climate scientist Tom Di Liberto had dreamed of working at the National Oceanic and Atmospheric Administration (NOAA) since college.",
    "link": "https://www.ibtimes.com.au/scientists-say-trump-cuts-threaten-climate-research-public-safety-1856760",
    "timestamp": "2025-03-10T12:57:56Z"
  },
  {
    "title": "Stock Markets Mainly Lower On China, US Economy Fears",
    "description": "European and Asian stock markets mostly fell Monday, as investors feared the impact of President Donald Trump's trade policy on the economic growth of the United States and China, the world's biggest economies.",
    "link": "https://www.ibtimes.com.au/stock-markets-mainly-lower-china-us-economy-fears-1856759",
    "timestamp": "2025-03-10T12:57:54Z"
  },
  {
    "title": "Trump Says US In Talks With Four Groups Over TikTok Sale",
    "description": "President Donald Trump said Sunday the United States was in talks with four groups interested in acquiring TikTok, with the Chinese-owned app facing an uncertain future in the country.",
    "link": "https://www.ibtimes.com.au/trump-says-us-talks-four-groups-over-tiktok-sale-1856755",
    "timestamp": "2025-03-10T12:57:50Z"
  },
  {
    "title": "Musk Spat Renews Opposition In Italy To Starlink Deal",
    "description": "Italian opposition parties stepped up criticism Monday of a proposed deal between the government and SpaceX's Starlink following founder Elon Musk's suggestion he could cut Ukraine from the satellite network.",
    "link": "https://www.ibtimes.com.au/musk-spat-renews-opposition-italy-starlink-deal-1856753",
    "timestamp": "2025-03-10T12:57:48Z"
  }
]