[
  {
    "title": "White House Chief of Staff Susie Wiles Says Trump Has ‘An Alcoholic’s Personality’ in Explosive Vanity Fair Story",
    "description": "Wiles counters in an X post that her comments were taken out of context and part of a “dangerously framed hit piece”\nThe post White House Chief of Staff Susie Wiles Says Trump Has ‘An Alcoholic’s Personality’ in Explosive Vanity Fair Story appeared first on T…",
    "link": "https://www.thewrap.com/susie-wiles-vanity-fair-trump-white-house/",
    "timestamp": "2025-12-16T15:18:34Z"
  },
  {
    "title": "Susie Wiles Attacks Vanity Fair Article on Trump Admin: ‘Hit Piece’",
    "description": "White House Chief of Staff Susie Wiles lashed out at Vanity Fair after it published an article based on months of conversations with her in which she talked candidly about the Trump administration and its top officials.\nIn the article, Wiles is quoted as sayi…",
    "link": "https://biztoc.com/x/df38ede3b36aa285",
    "timestamp": "2025-12-16T15:18:33Z"
  },
  {
    "title": "Employment market stumbles under policy uncertainty",
    "description": "The American job market has entered a period of troubling stagnation, leaving workers and policymakers grappling with incomplete data and mounting uncertainty about the economic road ahead. The Labor Department is finally set to release November employment fi…",
    "link": "https://rollingout.com/2025/12/16/employment-market-stumbles/",
    "timestamp": "2025-12-16T15:17:38Z"
  },
  {
    "title": "Michelle Obama Says Rob Reiner Was ‘Not Deranged,’ No Matter What Trump Claims",
    "description": "Michelle Obama defended her late friends Rob Reiner and Michele Singer against Donald Trump while on ‘Jimmy Kimmel Live!’ ‘Unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever wanna know,’ she said.",
    "link": "http://www.vulture.com/article/michelle-obama-rob-reiner-donald-trump.html",
    "timestamp": "2025-12-16T15:15:22Z"
  },
  {
    "title": "Prestwick Airport records sixth year in a row in profit",
    "description": "The report said Prestwick has already achieved its annual operating target in the first six months of the financial year.",
    "link": "https://www.bbc.com/news/articles/cx2glk17097o",
    "timestamp": "2025-12-16T15:15:05Z"
  },
  {
    "title": "Australian Jews fear for safety after beach shooting",
    "description": "Australian Jews are now fearing for their safety after the Bondi beach shooting in Sydney, a survivor has told the BBC. \n\nOne of the two men suspected of carrying out a mass shooting at Bondi Beach was originally from southern India but had \"limited contact\" …",
    "link": "https://www.bbc.co.uk/programmes/w172zssh2pkyngg",
    "timestamp": "2025-12-16T15:15:00Z"
  },
  {
    "title": "‘Enjoy The Honeymoon’: New York Voters Warm To Mamdani, His Socialist Policies, Poll Shows",
    "description": "Voters are warming up to New York City Mayor-elect Zohran Mamdani, according to a Siena University poll released on Tuesday.",
    "link": "https://dailycaller.com/2025/12/16/zohran-mamdani-favorability-policies-siena-poll/",
    "timestamp": "2025-12-16T15:15:00Z"
  },
  {
    "title": "Jane Fonda Saw Rob Reiner and Wife Michele 1 Night Before Their Deaths",
    "description": "Jane Fonda is sharing insight into Rob Reiner and wife Michele Singer Reiner’s moods the night before their shocking deaths. “Rob and Michele Reiner were wonderful, caring, smart, funny, generous people, always coming up with ideas for how to make the world b…",
    "link": "https://www.usmagazine.com/celebrity-news/news/jane-fonda-saw-rob-reiner-wife-michele-the-night-before-their-deaths/#article",
    "timestamp": "2025-12-16T15:14:25Z"
  },
  {
    "title": "'PM Modi Great Friend': US Embassy Quotes Trump's Praise For India Amid Prolonged Trade Deal Talks",
    "description": "The US Embassy in India has resonated with US President Donald Trump's feelings for the country. Trump had called India an \"amazing country\" and said that America has found a great friend in the Indian Prime Minister Narendra Modi.",
    "link": "https://www.ndtvprofit.com/economy-finance/pm-modi-great-friend-us-embassy-quotes-trumps-praise-for-india-amid-prolonged-trade-deal-talks",
    "timestamp": "2025-12-16T15:13:17Z"
  },
  {
    "title": "DOJ to give Congress email evidence that the Biden admin knew it did not have probable cause to raid Trump's home",
    "description": "On August 8, 2022, former President Biden's administration authorized an FBI raid of President Trump's Florida home in the unprecedented legal prosecution of a former president. Former AG Merrick Garland said that he personally authorized the raid. Garland: \"…",
    "link": "https://freerepublic.com/focus/f-news/4357650/posts",
    "timestamp": "2025-12-16T15:12:58Z"
  },
  {
    "title": "Pfizer’s modest 2026 outlook shows its big investments will take time to pay off",
    "description": "Pfizer has pursued deals of all sizes to build new revenue streams, but the outlook underscores that those investments are still some distance from paying off.",
    "link": "https://www.cnbc.com/2025/12/16/pfizer-2026-guidance-metsera-seagen-deals.html",
    "timestamp": "2025-12-16T15:12:25Z"
  },
  {
    "title": "Under Kennedy, America’s health department is in the business of promoting Kennedy",
    "description": "HHS has compromised campaigns promoting immunizations and other preventive health measures.",
    "link": "https://www.bostonherald.com/2025/12/16/under-kennedy-americas-health-department-is-in-the-business-of-promoting-kennedy/",
    "timestamp": "2025-12-16T15:10:49Z"
  },
  {
    "title": "Jennifer Welch Suddenly Worried About Toxicity",
    "description": "Jennifer Welch voiced concern on \"I've Had It\" Tuesday about toxicity in American politics despite her record of using hateful rhetoric against conservatives.",
    "link": "https://dailycaller.com/2025/12/16/jennifer-welch-suddenly-worried-about-toxicity/",
    "timestamp": "2025-12-16T15:09:34Z"
  },
  {
    "title": "Late-Night Hosts Kimmel, Meyers Call Out Trump Over Rob Reiner Post",
    "description": "When the tragic news broke that actor/director Rob Reiner and his wife, Michele Singer Reiner, had been found dead in their home, it didn't take long for Donald Trump to try to make it all about him and piss off a lot of folks on both sides of the political a…",
    "link": "https://bleedingcool.com/tv/late-night-hosts-kimmel-meyers-call-out-trump-over-rob-reiner-post/",
    "timestamp": "2025-12-16T15:08:10Z"
  },
  {
    "title": "DeSantis claps back at Canadians boycotting Florida: 'We continue to break tourism records (and win Stanley Cups)'",
    "description": "Ron DeSantis responded to comments from Ontario's premier by pointing to second-quarter tourism numbers and second consecutive win.",
    "link": "https://nationalpost.com/news/canada/florida-governor-ron-desantis-tourism-ontario",
    "timestamp": "2025-12-16T15:07:54Z"
  },
  {
    "title": "Howard Stern Isn’t Going Anywhere, Announces New 3-Year Deal",
    "description": "Howard Stern has confirmed he won't be leaving SiriusXM anytime soon, with the radio legend announcing a new three-year deal to continue his show.",
    "link": "http://www.rollingstone.com/culture/culture-news/howard-stern-renews-sirius-xm-deal-three-years-1235484908/",
    "timestamp": "2025-12-16T15:07:25Z"
  },
  {
    "title": "US Urges Ukraine to Accept Last Offer of 'Platinum' Security Guarantees - Reports",
    "description": "MOSCOW (Sputnik) - The United States has told Ukraine to accept its \"platinum standard\" offer of security guarantees or lose it, The Telegraph newspaper reported, citing US officials.",
    "link": "https://sputnikglobe.com/20251216/us-urges-ukraine-to-accept-last-offer-of-platinum-security-guarantees---reports-1123308123.html",
    "timestamp": "2025-12-16T15:06:05Z"
  },
  {
    "title": "Fake Christmas tree prices are up, but Americans keep buying them. Here’s why",
    "description": "On a recent December day, Mark Latino and a handful of his workers spun sheets of vinyl into tinsel for Christmas tree branches. They worked on a custom-made machine that’s nearly a century old, churning out strands of bright silver tinsel along its 35-foot (…",
    "link": "https://newsroom.ap.org/detail/AmericanslikeartificialChristmastreeseventhoughfewaremadeinUSandpricesareup/1ddac9237e03e3afad18759754131a4d/text",
    "timestamp": "2025-12-16T15:05:58Z"
  },
  {
    "title": "The US gained 64,000 jobs in November but lost 105,000 in October; unemployment rate at 4.6%",
    "description": "America added 64,000 jobs in November, a welcome gain after October's loss of 105,000 jobs. Federal worker departures heavily influenced October's figures. The unemployment rate climbed to 4.6%. Healthcare and construction sectors saw job additions. Manufactu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-us-gained-64000-jobs-in-november-but-lost-105000-in-october-unemployment-rate-at-4-6/articleshow/126009080.cms",
    "timestamp": "2025-12-16T15:05:43Z"
  },
  {
    "title": "INGERSOLL: Sure, Let’s Make Rob Reiner’s Murder About Donald Trump",
    "description": "Human beings have always struggled when it comes to death. The religious among us handle it the best, in my opinion.",
    "link": "https://dailycaller.com/2025/12/16/ingersoll-rob-reiner-murder-about-donald-trump/",
    "timestamp": "2025-12-16T15:02:02Z"
  },
  {
    "title": "Family of Bondi hero in Syria says his home country is proud of him",
    "description": "NAYRAB, Syria, Dec 16 (Reuters) - As Australia's worst mass shooting in nearly 30 years unfolded, a Sydney shopowner was captured on camera charging at one of the gunmen and disarming him. Halfway around the world in Syria, a group of men watching the footage…",
    "link": "https://www.thestar.com.my/news/world/2025/12/16/family-of-bondi-hero-in-syria-says-his-home-country-is-proud-of-him",
    "timestamp": "2025-12-16T15:01:00Z"
  },
  {
    "title": "Exclusive: State Dept. to Designate Colombia’s Clan del Golfo as Terror Organization",
    "description": "The State Department will announce the designation of the Clan del Golfo, a cocaine- and human-trafficking organized criminal militia in Colombia, as a Foreign Terrorist Organization (FTO) on Tuesday, Breitbart News learned.\nThe post Exclusive: State Dept. to…",
    "link": "https://www.breitbart.com/latin-america/2025/12/16/exclusive-state-department-designate-colombia-clan-del-golfo-terror-organization/",
    "timestamp": "2025-12-16T15:00:09Z"
  },
  {
    "title": "Trump’s Henchmen Keep Calling Their War Slut President A Peacemaker",
    "description": "Trump campaigned on being a president of peace and continues to stake his personal reputation on big talk about peacemaking, but in terms of concrete action he’s just as much of a warmonger as the psychopaths who came before him. Listen to a reading of this a…",
    "link": "https://www.activistpost.com/trumps-henchmen-keep-calling-their-war-slut-president-a-peacemaker/",
    "timestamp": "2025-12-16T15:00:00Z"
  },
  {
    "title": "Most Influential: Jerome Powell",
    "description": "Powell’s decisions as Fed chair have continued to have a massive impact on bitcoin and the wider cryptocurrency markets.",
    "link": "https://www.coindesk.com/policy/2025/12/16/most-influential-jerome-powell",
    "timestamp": "2025-12-16T15:00:00Z"
  },
  {
    "title": "U.S. and Ukraine Report Progress Toward Peace",
    "description": "US and Ukrainian officials said they made substantial progress in two days of talks aimed to bring an end to Russia's invasion closer, with Washington reportedly offering Kyiv security guarantees modeled on NATO's Article 5 mutual defense pledge. While questi…",
    "link": "https://oilprice.com/Geopolitics/Europe/US-and-Ukraine-Report-Progress-Toward-Peace.html",
    "timestamp": "2025-12-16T15:00:00Z"
  },
  {
    "title": "Most Influential: Tyler Williams",
    "description": "Williams has helped cement crypto gains in Congress alongside White House allies.",
    "link": "https://www.coindesk.com/policy/2025/12/16/most-influential-tyler-williams",
    "timestamp": "2025-12-16T15:00:00Z"
  },
  {
    "title": "PayPal Bank on cards? Global payments giant seeks banking charter amid lending push in US — all you need to know",
    "description": "Payments giant PayPal has filed its banking charter application with US regulators to become a bank amid a broader push for fintech and crypto companies that are seeking a licence to expand their lending operations among customers and small businesses.&nbsp;",
    "link": "https://www.livemint.com/companies/news/paypal-bank-on-cards-global-payments-giant-seeks-banking-charter-amid-lending-push-in-us-all-you-need-to-know-11765889403962.html",
    "timestamp": "2025-12-16T14:56:45Z"
  },
  {
    "title": "On the Reiners’ death, Trump should have quit while he was behind",
    "description": "As a rule, when Donald Trump publishes abhorrent content on his social media platform, the responses from his Republican allies fall into one of three categories. Many pretend they haven’t see what the president wrote, while others say something along the lin…",
    "link": "https://biztoc.com/x/57c957fdcfd7c71f",
    "timestamp": "2025-12-16T14:56:33Z"
  },
  {
    "title": "US: Military Boat Strikes Constitute Extrajudicial Killings",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n President Donald Trump speaks during a Cabinet meeting at the White House, Tuesday, Dec. 2, 2025, in Washington, as Secretary of State Marco Rubio, left, and Defense Secretary Pete Hegseth, right, look on. \n © 2025 A…",
    "link": "https://www.hrw.org/news/2025/12/16/us-military-boat-strikes-constitute-extrajudicial-killings",
    "timestamp": "2025-12-16T14:55:41Z"
  },
  {
    "title": "Europe Saves Combustion Engine in Reversal of Controversial Ban",
    "description": "The European Union pulled back from an effective ban on combustion engines and offered more flexibility for carmakers in the transition to cleaner transport after months of industry pressure.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-saves-combustion-engine-in-reversal-of-controversial-ban",
    "timestamp": "2025-12-16T14:53:03Z"
  },
  {
    "title": "Mark Zuckerberg faces fierce backlash after lavish purchase sends the internet into a frenzy",
    "description": "Mark Zuckerberg is facing renewed online criticism. His massive superyacht, Launchpad, has drawn attention for its significant fuel consumption. This has led to accusations of hypocrisy regarding his past climate change advocacy. Social media users are highli…",
    "link": "https://economictimes.indiatimes.com/news/international/us/mark-zuckerberg-faces-fierce-backlash-after-lavish-purchase-sends-the-internet-into-a-frenzy/articleshow/126007410.cms",
    "timestamp": "2025-12-16T14:49:22Z"
  },
  {
    "title": "JD Vance 'status' problem in White House is sinking presidential ambitions: analysis",
    "description": "JD Vance must tackle a huge \"status\" problem if he has any hope of succeeding Donald Trump, a political scientist has said. Though the Vice President may think of himself as a shoo-in for the Republican Party nomination in future, he still has a wide gap of d…",
    "link": "https://www.rawstory.com/jd-vance-president/",
    "timestamp": "2025-12-16T14:49:20Z"
  },
  {
    "title": "Daddy Trump",
    "description": "In the 1970s, citizens of the Soviet Union scoffed at Leonid Brezhnev’s demented vanity, his insatiable need for praise, and the obsequiousness of his entourage. But it was nothing compared to the self-aggrandizing behavior of Donald Trump and the sycophancy …",
    "link": "https://www.project-syndicate.org/commentary/trump-sycophancy-and-self-aggrandizement-compares-only-to-that-of-stalin-by-nina-l-khrushcheva-2025-12",
    "timestamp": "2025-12-16T14:49:13Z"
  },
  {
    "title": "You Won’t Believe Who Lindsey Graham Blames for Bondi Beach Shooting",
    "description": "Somehow, Joe Biden is responsible for one of the most horrific shootings in Australian history.At least, that’s the narrative that Senator Lindsey Graham is pushing. In an interview with Fox News Monday night, the South Carolina lawmaker claimed that former P…",
    "link": "https://newrepublic.com/post/204479/lindsey-graham-blames-bondi-beach-shooting-joe-biden",
    "timestamp": "2025-12-16T14:48:07Z"
  },
  {
    "title": "Susie Wiles Trashes Bondi as She Tells All About Epstein Files in Explosive Interview: ‘It Sure as Hell Wasn’t on Her Desk’",
    "description": "President Trump's chief of staff Susie Wiles ripped into Attorney General Pam Bondi over the botched release of the Epstein files in an exclusive interview with Vanity Fair, saying America's top prosecutor gave a bunch of right-wing influencers \"binders full …",
    "link": "https://www.mediaite.com/media/news/susie-wiles-trashes-bondi-as-she-tells-all-about-epstein-files-in-explosive-interview-it-sure-as-hell-wasnt-on-her-desk/",
    "timestamp": "2025-12-16T14:46:59Z"
  },
  {
    "title": "Trump chief of staff Susie Wiles says president ‘has an alcoholic’s personality’ and more in candid interviews | CNN Politics",
    "description": "The White House chief of staff, Susie Wiles, delivered a series of unusually candid and at times unflattering assessments of President Donald Trump, his second-term agenda and some of his closest allies in a series of wide-ranging interviews with Vanity Fair …",
    "link": "https://www.cnn.com/2025/12/16/politics/susie-wiles-interview-trump",
    "timestamp": "2025-12-16T14:46:41Z"
  },
  {
    "title": "Obamas planned to meet Reiners on night they were killed, former first lady reveals",
    "description": "Michelle Obama reveals on \"Jimmy Kimmel Live!\" that she and Barack were supposed to meet Rob and Michele Reiner the very night they tragically died.",
    "link": "https://www.foxnews.com/politics/obamas-planned-to-meet-reiners-on-night-they-were-killed-former-first-lady-reveals",
    "timestamp": "2025-12-16T14:44:55Z"
  },
  {
    "title": "US Puts ‘Technology Prosperity Deal’ With UK on Hold",
    "description": "The United States government reportedly paused its technology deal with the United Kingdom. The suspension of the “technology prosperity deal” comes amid rising frustration in Washington over the progress of trade discussions with the U.K., the Financial Time…",
    "link": "https://www.pymnts.com/technology/2025/united-states-puts-technology-prosperity-deal-with-uk-hold/",
    "timestamp": "2025-12-16T14:44:41Z"
  },
  {
    "title": "Trump announces Donald Trump Jr.’s engagement at White House holiday party | CNN Politics",
    "description": "The president’s eldest son, Donald Trump Jr., is engaged to Palm Beach socialite Bettina Anderson, a spokesperson for Trump Jr. confirmed to CNN.",
    "link": "https://www.cnn.com/2025/12/16/politics/donald-trump-jr-bettina-anderson",
    "timestamp": "2025-12-16T14:44:24Z"
  },
  {
    "title": "Why WH chief of staff Susie Wiles says teetotaling Trump has ‘an alcoholic’s personality’",
    "description": "White House chief of staff Susie Wiles says in a revealing new interview that her boss, President Trump, has “an alcoholic’s personality” because he believes “there’s nothing he can’t do.” Wiles, 68, made the comment to author Chris Whipple in one of 11 inter…",
    "link": "https://nypost.com/2025/12/16/us-news/why-chief-of-staff-susie-wiles-says-teetotaling-trump-has-alcoholics-personality/",
    "timestamp": "2025-12-16T14:41:26Z"
  },
  {
    "title": "The U.S. gained 64,000 jobs in November but lost 105,000 in October as the unemployment rate rose to 4.6%",
    "description": "Hiring has clearly lost momentum, hobbled by uncertainty over President Donald Trump's tariffs and the lingering effects of the high interest rates the Federal Reserve engineered in 2022 and 2023 to rein in an outburst of inflation.",
    "link": "https://www.pbs.org/newshour/economy/the-u-s-gained-64000-jobs-in-november-but-lost-105000-in-october-as-the-unemployment-rate-rose-to-4-6",
    "timestamp": "2025-12-16T14:41:13Z"
  },
  {
    "title": "Brent Oil Prices Fall Below $60 on Ukraine Peace Deal Progress",
    "description": "Oil prices fell by 2% early on Tuesday as hope of a peace deal in Ukraine increased, sending Brent crude below $60 per barrel to the lowest level since May.  As of 9:47 a.m. ET on Tuesday, the front-month Brent Crude futures prices traded down by 2.10% below …",
    "link": "https://oilprice.com/Energy/Crude-Oil/Brent-Oil-Prices-Fall-Below-60-on-Ukraine-Peace-Deal-Progress.html",
    "timestamp": "2025-12-16T14:41:00Z"
  },
  {
    "title": "White House Chief Of Staff Susie Wiles Tells Vanity Fair That Donald Trump Has “An Alcoholic’s Personality,” Refers To JD Vance As “Conspiracy Theorist”",
    "description": "Much of the political media was chattering about a newly Vanity Fair piece on Susie Wiles, the White House chief of staff, who not only gave a rare interview to writer Chris Whipple but some very candid assessments of the personalities in Trump 2.0. The profi…",
    "link": "http://deadline.com/2025/12/susie-wiles-trump-vanity-fair-1236649834/",
    "timestamp": "2025-12-16T14:40:36Z"
  },
  {
    "title": "US freezes $42B trade pact with UK over digital tax row",
    "description": "Tech Prosperity Deal paused after London resists pressure on online services levy The US government has put a proposed $42 billion (£31 billion) trade pact with the UK on ice because the European country has yet to budge on its Digital Services Tax (DST).…",
    "link": "https://www.theregister.com/2025/12/16/us_uk_trade_deal/",
    "timestamp": "2025-12-16T14:40:08Z"
  },
  {
    "title": "Barack and Michelle Obama met Rob Reiner and his wife on night of their murder? Obamas links with murdered couple explained",
    "description": "Barack and Michelle Obama met Rob Reiner and his wife on night of their murder? Michelle Obama confirmed they were scheduled to meet Rob Reiner and Michele Reiner the same night the couple were found dead in Los Angeles. She spoke about the case, their friend…",
    "link": "https://economictimes.indiatimes.com/news/international/us/barack-and-michelle-obama-met-rob-reiner-and-his-wife-on-night-of-their-murder-obamas-links-with-murdered-couple-explained-filmmaker-michele-brentwood-area-of-los-angeles-twin-towers-jail-president-donald-trump/articleshow/126007603.cms",
    "timestamp": "2025-12-16T14:38:07Z"
  },
  {
    "title": "Russia-Ukraine war: Is a ceasefire deal on the horizon?",
    "description": "Experts say a ceasefire deal is unlikely to be close, as many sticking points remain.",
    "link": "https://www.aljazeera.com/news/2025/12/16/russia-ukraine-war-is-a-ceasefire-deal-on-the-horizon",
    "timestamp": "2025-12-16T14:36:43Z"
  },
  {
    "title": "Crowd Surrounds ICE Agents During Enforcement Operation In Minneapolis",
    "description": "ICE agents carrying out an operation in Minneapolis Monday found themselves surrounded by anti-ICE rioters, according to video posted by local media.",
    "link": "https://dailycaller.com/2025/12/16/crowd-surrounds-ice-agents-in-minneapolis/",
    "timestamp": "2025-12-16T14:36:30Z"
  },
  {
    "title": "Live updates: Trump administration news on health care, boat strikes and Epstein files | CNN Politics",
    "description": "Secretary of State Marco Rubio and Defense Secretary Pete Hegseth are giving lawmakers classified briefings on the administration’s strikes on alleged drug boats as the battle over health care continues on Capitol Hill. Follow here for liveupdates on Presiden…",
    "link": "https://www.cnn.com/politics/live-news/trump-administration-news-12-16-25",
    "timestamp": "2025-12-16T14:33:56Z"
  },
  {
    "title": "Trump sued again as he barrels forward with new White House renovation plans",
    "description": "Donald Trump's plan for further renovations to White House landmarks has prompted a lawsuit from the DC Preservation League. Trump has deconstructed the East Wing to build a ballroom and has marbled the Lincoln Bedroom bathroom too. The president has made it …",
    "link": "https://www.rawstory.com/trump-white-house-2674403258/",
    "timestamp": "2025-12-16T14:33:29Z"
  },
  {
    "title": "U.S. Unemployment Rate Rose In November",
    "description": "Hiring has clearly lost momentum, hobbled by uncertainty over President Donald Trump’s tariffs, among other things.",
    "link": "https://www.huffpost.com/entry/us-economy-jobs-report_n_69416ae0e4b06cf6877f0f0f",
    "timestamp": "2025-12-16T14:32:48Z"
  },
  {
    "title": "Hassett says Fed independence is ‘really important’ and chair candidates shouldn’t be disqualified for being Trump’s friend",
    "description": null,
    "link": "https://www.cnbc.com/2025/12/16/fed-chief-candidate-hassett-says-central-banks-independence-is-really-important-would-move-rates-by-consensus.html",
    "timestamp": "2025-12-16T14:32:47Z"
  },
  {
    "title": "US retail sales unexpectedly unchanged in October",
    "description": "The unchanged reading in retail sales reported by the Commerce Department's Census Bureau on Tuesday followed a downwardly revised 0.1% gain in September. Economists polled by Reuters had forecast retail sales, which are mostly goods and are not adjusted for …",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-retail-sales-unexpectedly-unchanged-in-october/articleshow/126008117.cms",
    "timestamp": "2025-12-16T14:30:01Z"
  },
  {
    "title": "EU likely to delay free-trade deal with South America as French farmers block roads",
    "description": "French farmers are driving opposition to a massive trade deal between the Mercosur bloc and the European Union",
    "link": "https://abcnews.go.com/Business/wireStory/eu-delay-free-trade-deal-south-america-french-128448985",
    "timestamp": "2025-12-16T14:29:50Z"
  },
  {
    "title": "Rob Reiner's Wife Michele Singer Took the Photo for Donald Trump's Book ‘The Art of the Deal’",
    "description": "Rob Reiner's wife Michele Singer was the photographer who took the image that graced the cover of President Donald Trump's publishing breakthrough in 1987. The book that soon became a bestseller was The Art of the Deal.\nThe post Rob Reiner’s Wife Michele Sing…",
    "link": "https://www.breitbart.com/entertainment/2025/12/16/rob-reiners-wife-michele-singer-took-the-photo-for-donald-trumps-book-the-art-of-the-deal/",
    "timestamp": "2025-12-16T14:22:52Z"
  },
  {
    "title": "Oil falls below $60 a barrel on hopes of Russia-Ukraine peace deal",
    "description": "Brent crude hits lowest intraday level for six months",
    "link": "https://www.irishtimes.com/business/2025/12/16/oil-falls-below-60-a-barrel-on-hopes-of-russia-ukraine-peace-deal/",
    "timestamp": "2025-12-16T14:21:01Z"
  },
  {
    "title": "Comer warns contempt as Clintons face January dates for Epstein-probe depositions",
    "description": "House Oversight Chair James Comer threatens contempt proceedings against Bill and Hillary Clinton if they skip January 2026 depositions in Epstein probe.",
    "link": "https://www.foxnews.com/politics/comer-warns-contempt-clintons-face-january-dates-epstein-probe-depositions",
    "timestamp": "2025-12-16T14:19:00Z"
  },
  {
    "title": "Donald Trump Jr. & Bettina Anderson Engaged After 1 Year",
    "description": "Reading Time: 3 minutesDonald Trump Jr. and socialite Bettina Anderson announced their engagement at the White House about a year after going public.\nDonald Trump Jr. & Bettina Anderson Engaged After 1 Year was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/12/donald-trump-jr-engaged-bettina-anderson/",
    "timestamp": "2025-12-16T14:18:14Z"
  },
  {
    "title": "Rachel Maddow Says Trump Is Excelling At Just 1 Thing Right Now. And It’s Brutal.",
    "description": "The MS NOW host ran through an extensive list Monday of controversial policy decisions, public statements and scandals.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-trump-approval-ratings_n_694138cfe4b0a75967041582",
    "timestamp": "2025-12-16T14:17:24Z"
  },
  {
    "title": "U.S. Ambassador Signals Hope on F-35s, Türkiye Firm on S-400s",
    "description": "U.S. Ambassador Tom Barrack voiced hope for progress on F-35 talks, but Turkish officials said there are no new developments regarding the S-400 air defence system. In a recent post on X, U.S. Ambassador to Türkiye Tom Barrack stated his hope that “talks will…",
    "link": "https://theaviationist.com/2025/12/16/turkish-f-35-talks/",
    "timestamp": "2025-12-16T14:15:45Z"
  },
  {
    "title": "Obamas due to see Reiners the night they were killed",
    "description": "Former US first lady Michelle Obama has said she and her husband Barack Obama were meant to see Hollywood director Rob Reiner and his wife, photographer Michele Reiner, the night they were killed.",
    "link": "https://www.rte.ie/entertainment/2025/1216/1549304-obamas-due-to-see-reiners-the-night-they-were-killed/",
    "timestamp": "2025-12-16T14:15:15Z"
  },
  {
    "title": "Trump sues BBC for $10 billion over documentary",
    "description": "Donald Trump filed a massive $10 billion defamation lawsuit against the BBC Monday, claiming the British broadcaster manipulated footage from his January 6 speech to make him appear responsible for violence at the Capitol. The legal action targets a documenta…",
    "link": "https://rollingout.com/2025/12/16/trump-sues-bbc/",
    "timestamp": "2025-12-16T14:14:55Z"
  },
  {
    "title": "Trump praises India, Modi amid long-drawn negotiations on trade pact",
    "description": "US President Donald Trump said India is an important strategic partner and reiterated that Prime Minister Narendra Modi was a “great friend”",
    "link": "https://www.thehindubusinessline.com/economy/trump-praises-india-modi-amid-long-drawn-negotiations-on-trade-pact/article70403617.ece",
    "timestamp": "2025-12-16T14:14:33Z"
  },
  {
    "title": "Kushner scraps Trump Tower Belgrade after officials indicted",
    "description": "Jared Kushner’s private equity firm dropped its plans for a hotel in Serbia after the indictment of a government official. Read more.",
    "link": "https://financialpost.com/real-estate/kushner-scraps-trump-tower-belgrade-officials-indicted",
    "timestamp": "2025-12-16T14:13:31Z"
  },
  {
    "title": "US Moves Unto Piracy to Enforce Its Sanctions Against Venezuela. Escalation of Its Economic and Military Campaign?",
    "description": "The United States has escalated its military and economic campaign against the Venezuelan government by moving beyond economic sanctions to the physical seizure of an oil tanker off the coast of the Bolivarian country. US military and law enforcement personne…",
    "link": "https://www.globalresearch.ca/us-piracy-enforce-sanctions-venezuela/5909236",
    "timestamp": "2025-12-16T14:13:17Z"
  },
  {
    "title": "EU likely to delay free-trade deal with South America as French farmers block roads",
    "description": "PARIS (AP) — French farmers are driving opposition to a massive transatlantic trade deal between five South American nations of the Mercosur bloc and the 27-nation European Union that officials say will likely lead to its delay. Farmers turned out across Fran…",
    "link": "https://financialpost.com/pmn/eu-likely-to-delay-free-trade-deal-with-south-america-as-french-farmers-block-roads",
    "timestamp": "2025-12-16T14:11:52Z"
  },
  {
    "title": "Trump sues BBC for $10 billion, accusing it of defamation deceptive practices over editing of his Jan. 6 speech",
    "description": "The suit accused the BBC of \"splicing together two entirely separate parts of President Trump's speech on January 6, 2021\" in order to \"intentionally misrepresent the meaning of what President Trump said.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-sues-bbc-for-10-billion-accusing-it-of-defamation-deceptive-practices-over-editing-of-his-jan-6-speech",
    "timestamp": "2025-12-16T14:11:47Z"
  },
  {
    "title": "Rob Reiner’s Charlie Kirk Comments Resurface Following Brutal Murder",
    "description": "Reading Time: 2 minutesRob Reiner's comments regarding Charlie Kirk have resurfaced following the famed director's murder.\nRob Reiner’s Charlie Kirk Comments Resurface Following Brutal Murder was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/12/rob-reiners-charlie-kirk-comments-resurface-following-brutal-murder/",
    "timestamp": "2025-12-16T14:11:25Z"
  },
  {
    "title": "‘A Conspiracy Theorist for a Decade’: Trump’s Chief of Staff Gets Stunningly Candid in Blockbuster Vanity Fair Exposé",
    "description": "Wiles offered a remarkably candid window into a presidency she described as driven by impulse and a widening view of power, in a blockbuster portrait.\nThe post ‘A Conspiracy Theorist for a Decade’: Trump’s Chief of Staff Gets Stunningly Candid in Blockbuster …",
    "link": "https://www.mediaite.com/media/news/a-conspiracy-theorist-for-a-decade-trumps-chief-of-staff-gets-stunningly-candid-in-blockbuster-vanity-fair-expose/",
    "timestamp": "2025-12-16T14:10:16Z"
  },
  {
    "title": "Oil prices tumble to lowest since May, on pace for biggest decline in 7 years",
    "description": "The oil market is under pressure as OPEC+ members have rapidly ramped up production and the U.S. pressures Ukraine to accept a peace agreement with Russia.",
    "link": "https://www.cnbc.com/2025/12/16/crude-oil-prices-today.html",
    "timestamp": "2025-12-16T14:07:10Z"
  },
  {
    "title": "LATE BREAKING: Don Jr. Announces Surprise Engagement to Bettina Anderson at WH Party - in Her Response Anderson Praised Melania",
    "description": "LATE BREAKING: Don Jr. Announces Surprise Engagement to Bettina Anderson at WH Party - in Her Response Anderson Praised Melaniawesternjournal.com",
    "link": "https://www.westernjournal.com/late-breaking-don-jr-announces-surprise-engagement-bettina-anderson-wh-party-response-anderson-praised-melania/",
    "timestamp": "2025-12-16T14:06:40Z"
  },
  {
    "title": "The Irresistible Temptation of Chile’s Polarized Politics",
    "description": "Four years ago, Chileans were tempted by the promise of a progressive “refoundation” of the country under Gabriel Boric, a former student leader, and elected him president. Now they have swung in the opposite direction, electing the far-right José Antonio Kas…",
    "link": "https://www.project-syndicate.org/commentary/polarized-chile-new-far-right-president-kast-by-andres-velasco-2025-12",
    "timestamp": "2025-12-16T14:05:18Z"
  },
  {
    "title": "South Africa will attend G20 summit in US – official",
    "description": "A spokesperson for South Africa’s president urged G20 leaders not to boycott next year’s summit in Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629516-south-africa-will-attend-g20-us/",
    "timestamp": "2025-12-16T14:03:43Z"
  },
  {
    "title": "“Slop” Is Merriam-Webster’s 2025 Word Of The Year",
    "description": "Merriam-Webster’s 2025 word of the year is “slop.” The word was first used in the 1700s to mean soft mud. It evolved more generally to mean something of little value. The definition has since expanded to mean “digital content of low quality that is produced u…",
    "link": "https://apnews.com/article/merriam-webster-dictionary-word-year-2025-slop-2dffb2379cac6001aa30e148669e3393",
    "timestamp": "2025-12-16T14:03:00Z"
  },
  {
    "title": "Michelle Obama Says She and Barack Were Supposed to See Rob Reiner on Night of Death",
    "description": "Obama addressed Donald Trump's disparaging comments about the late director during an appearance on Jimmy Kimmel Live.\nMichelle Obama Says She and Barack Were Supposed to See Rob Reiner on Night of Death\nScoop Harrison",
    "link": "https://consequence.net/2025/12/michelle-obama-rob-reiner-kimmel/",
    "timestamp": "2025-12-16T14:02:45Z"
  },
  {
    "title": "US in no position to lecture others after ‘rigged’ Biden election – Lukashenko",
    "description": "Belarusian President Alexander Lukashenko has criticized the US approach toward Venezuela and its claims about foreign elections Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629515-lukashenko-rigged-biden-election/",
    "timestamp": "2025-12-16T14:01:59Z"
  },
  {
    "title": "Pentagon prepares major military reorganization plan: Report",
    "description": "US Joint Chiefs Chairman Dan Caine was expected to present the plan to Hegseth in coming days, a senior defense official familiar with the discussion told the Washington Post.",
    "link": "https://economictimes.indiatimes.com/news/defence/pentagon-prepares-major-military-reorganization-plan-report/articleshow/126007235.cms",
    "timestamp": "2025-12-16T14:01:47Z"
  },
  {
    "title": "Michelle Obama Breaks Her Silence After Trump Blames The Rob Reiner Tragedy On Fake Syndrome",
    "description": "Michelle Obama condemned President Donald Trump’s Truth Social post blaming Rob Reiner’s passing on “Trump Derangement Syndrome.”",
    "link": "https://www.boredpanda.com/michelle-obama-breaks-silence-on-rob-michele-reiner-tragedy/",
    "timestamp": "2025-12-16T14:01:21Z"
  },
  {
    "title": "Mark Carney warns US-Canada economic relationship is ‘now over.’ How to survive a ‘drastically different world’",
    "description": "What was once a strength could now be a vulnerability.",
    "link": "https://finance.yahoo.com/news/mark-carney-warns-us-canada-140100528.html",
    "timestamp": "2025-12-16T14:01:00Z"
  },
  {
    "title": "Bitcoin Mining Hit Hard: 10% Hashrate Loss Linked To China Shutdowns",
    "description": "According to a post by former Canaan (a Chinese tech company) executive Jianping Kong, Bitcoin’s estimated hashrate fell roughly 10% in a single day, sliding from about 1,053 TH/s to just under 943 TH/s. Related Reading: Binance And HTX Get Regulatory Nod To …",
    "link": "https://bitcoinist.com/bitcoin-mining-hit-hard-10-hashrate-loss-linked-to-china-shutdowns/",
    "timestamp": "2025-12-16T14:00:53Z"
  },
  {
    "title": "GOP accuses Democrats of 'fabricating' Trump-Epstein link with selective document leaks, internal memo shows",
    "description": "House Oversight Committee GOP fires back at Democrats over Epstein probe, claiming selective leaks create a false Trump narrative in new memo to lawmakers.",
    "link": "https://www.foxnews.com/politics/gop-accuses-democrats-fabricating-trump-epstein-link-selective-document-leaks-internal-memo-shows",
    "timestamp": "2025-12-16T14:00:36Z"
  },
  {
    "title": "Hollywood filmmaker’s son charged in parents’ double murder",
    "description": "Nick Reiner, son of famed director Rob Reiner, has been charged with the murder of his parents after they were found stabbed to death in their home.\n\nRead More: https://punchng.com/hollywood-filmmakers-son-charged-in-parents-double-murder/",
    "link": "https://punchng.com/hollywood-filmmakers-son-charged-in-parents-double-murder/",
    "timestamp": "2025-12-16T14:00:28Z"
  },
  {
    "title": "Does the Boxing Movie Have Anything Left to Say?",
    "description": "This year’s fighting films, like ‘Christy’ and ‘The Smashing Machine,’ attempted to modernize a classic American story but still felt behind the times.",
    "link": "http://www.thecut.com/article/christy-smashing-machine-2025-boxing-movie-genre-trend.html",
    "timestamp": "2025-12-16T14:00:05Z"
  },
  {
    "title": "What Trump has said about Project 2025 over the years: A timeline",
    "description": "During his 2024 presidential campaign, Trump distanced himself from Project 2025. Now his administration is enacting many of its proposals.",
    "link": "https://www.snopes.com//news/2025/12/16/trump-project-2025-timeline/",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "Musk and Trump Have Blood on Their Hands After Canceling US AID",
    "description": "At the start of the second Trump administration, Trump unilaterally created a fake “Department of Government Efficiency,” led by Elon Musk. Only Congress can create or eliminate Departments. According to the Constitution, the House of Representatives is respo…",
    "link": "https://dianeravitch.net/2025/12/16/musk-and-trump-have-blood-on-their-hands-after-canceling-us-aid/",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "EU: Flagship Corporate Accountability Law Suffers Big Losses",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n European activists march in Brussels on September 23, 2025 to protest EU governments’ efforts to weaken the EU’s corporate accountability law, the Corporate Sustainability Due Diligence Directive.\n © 2025 Friends of …",
    "link": "https://www.hrw.org/news/2025/12/16/eu-flagship-corporate-accountability-law-suffers-big-losses",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "‘Never uttered this sequence of words’: Trump sues BBC for billions over deceptively edited speech",
    "description": "Documentary made it appear president incited the riot at U.S. Capitol on Jan. 6",
    "link": "https://www.wnd.com/2025/12/never-uttered-this-sequence-words-trump-sues-bbc/",
    "timestamp": "2025-12-16T13:59:47Z"
  },
  {
    "title": "Trump Finds Way To Be Bigger Piece Of Sh*t Than Ever, Re: Rob Reiner",
    "description": "Every time we think he can't go any lower, Daddy provides.",
    "link": "https://www.wonkette.com/p/trump-finds-way-to-be-bigger-piece",
    "timestamp": "2025-12-16T13:59:45Z"
  },
  {
    "title": "EXCLUSIVE: Biden State Dept Appeared To Ignore Emails From Would-Be Trump Assassin",
    "description": "Would-be Trump assassin Ryan Routh tried — and seemingly failed — to get the State Department to help him recruit foreign soldiers for the war in Ukraine.",
    "link": "https://dailycaller.com/2025/12/16/exclusive-biden-state-department-ryan-routh-ukraine-emails/",
    "timestamp": "2025-12-16T13:57:45Z"
  },
  {
    "title": "Trump announces son’s engagement",
    "description": "The US president shared the news at a White House Christmas event, revealing Trump Jr.’s engagement to Palm Beach socialite Bettina Anderson Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/629518-trump-announces-son-engagement/",
    "timestamp": "2025-12-16T13:54:00Z"
  },
  {
    "title": "Morning Minute: Decrypt Names Trump as Crypto Person of the Year",
    "description": "It's hard to argue the impact Trump has had on crypto - but has that impact been net positive or negative?",
    "link": "https://decrypt.co/352529/morning-minute-decrypt-names-trump-as-crypto-person-of-the-year",
    "timestamp": "2025-12-16T13:53:55Z"
  },
  {
    "title": "Trump Files $10B Defamation Lawsuit Against BBC Over Jan 6 Speech Edit",
    "description": "In the 46-page long filing Trump's team argue the BBC edit gave the \"mistaken impression\" he called for violence on that day.\nThe post Trump Files $10B Defamation Lawsuit Against BBC Over Jan 6 Speech Edit first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-files-10b-defamation-lawsuit-against-bbc-over-jan-6-speech-edit/",
    "timestamp": "2025-12-16T13:51:13Z"
  },
  {
    "title": "EU leaders genetically wired for theft – Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov has accused European officials of being inherently inclined to steal other countries’ assets Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629506-lavrov-eu-assets-theft/",
    "timestamp": "2025-12-16T13:50:20Z"
  }
]