[
  {
    "title": "Jesse Watters: We Have Divided And Conquered CNN And MSNBC With Jake Tapper's Book",
    "description": "FOX News host Jesse Watters gives his take on the DOJ announcing an investigation into former President Joe Biden’s alleged use of an autopen on ‘Jesse Watters Primetime.’ \r\n\r\nJESSE WATTERS, FOX NEWS CHANNEL HOST, \"JESSE WATTERS PRIMETIME\": The Biden White Ho…",
    "link": "https://www.realclearpolitics.com/video/2025/06/04/jesse_watters_we_have_divided_and_conquered_cnn_and_msnbc_with_jake_tappers_book.html",
    "timestamp": "2025-06-04T18:52:46Z"
  },
  {
    "title": "Pelosi's stock trading legacy haunts Democrats as Jeffries slams GOP freshman's 'thievery'",
    "description": "Amid accusations against freshman GOP Rep. Bresnahan for continued stock trading despite campaign promises, Republicans and Democrats trade barbs over congressional stock trading practices.",
    "link": "https://www.foxnews.com/politics/pelosis-stock-trading-legacy-haunts-democrats-jeffries-slams-gop-freshmans-thievery",
    "timestamp": "2025-06-04T18:52:41Z"
  },
  {
    "title": "Trump’s promised steel and aluminum tariffs go into effect",
    "description": "U.S. President Donald Trump hiked nearly all of his tariffs on steel and aluminum imports to a punishing 50% on Wednesday in a move that’s set to hammer businesses from automakers to home builders, and likely push up prices for consumers even further",
    "link": "https://www.wsbtv.com/news/trump-promises-hike/2SEPXTJUUVA6ROPLDIIYZ24SFI/",
    "timestamp": "2025-06-04T18:50:25Z"
  },
  {
    "title": "Mayoral candidate furious as Republican councilmember demands he be deported",
    "description": "New York City mayoral candidate and state Assemblymember Zohran Mamdani responded forcefully on Tuesday to comments from a Republican New York City councilmember, who the day prior took issue with Mamdani's politics and called for him to be deported.Late Mond…",
    "link": "https://www.rawstory.com/what-trump-and-his-sycophants-have-wrought-mayor-candidate-furious-as-r/",
    "timestamp": "2025-06-04T18:47:42Z"
  },
  {
    "title": "Report: Defeated Pa. Democrat Cartwright Won’t Seek to Reclaim House Seat",
    "description": "Former Democrat congressman Matthew Cartwright has reportedly decided not to run in 2026 to try to reclaim his congressional seat in Pennsylvania. Democrats had contemplated... Read More\nThe post Report: Defeated Pa. Democrat Cartwright Won’t Seek to Reclaim …",
    "link": "https://www.dailysignal.com/2025/06/04/report-defeated-pa-democrat-cartwright-wont-seek-reclaim-house-seat/",
    "timestamp": "2025-06-04T18:46:55Z"
  },
  {
    "title": "NEWT GINGRICH: Pay less, know more — Trump is slashing red tape and lowering your healthcare costs",
    "description": "Trump's approach to health care reform challenges middlemen profiting from system inefficiencies, implementing price transparency measures and addressing prescription drug costs through market competition.",
    "link": "https://www.foxnews.com/opinion/newt-gingrich-pay-less-know-more-trump-slashing-red-tape-lowering-your-healthcare-costs",
    "timestamp": "2025-06-04T18:46:13Z"
  },
  {
    "title": "‘F*cking Stupid’: James Carville Blows Gasket During Minute-Long Rant About Ukraine Drone Attack",
    "description": "James Carville lost his temper as he explained why he believes Volodymyr Zelenskyy did not inform Donald Trump ahead of his country's attack against Russia.",
    "link": "https://dailycaller.com/2025/06/04/james-carville-blows-gasket-during-minute-long-rant-about-ukraine-drone-attack/",
    "timestamp": "2025-06-04T18:46:08Z"
  },
  {
    "title": "Marjorie Taylor Greene Admits She Didn't Read Trump Spending Bill: 'I'm Being Very Honest'",
    "description": "Rep. Marjorie Taylor Greene (R-GA) admitted she voted for Trump's \"big, beautiful bill\" without reading a section she now says she's \"adamantly opposed to.\"",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-admits-she-didnt-read-trump-spending-bill-im-being-very-honest-3775172",
    "timestamp": "2025-06-04T18:45:51Z"
  },
  {
    "title": "Marjorie Taylor Greene Regrets Voting for 'Big, Beautiful Bill' After Seeing 'Pages 278-279'",
    "description": "\"When the OBBB comes back to the House for approval after Senate changes, I will not vote for it with this in it.\"",
    "link": "https://www.westernjournal.com/marjorie-taylor-greene-regrets-voting-big-beautiful-bill-seeing-pages-278-279/",
    "timestamp": "2025-06-04T18:45:33Z"
  },
  {
    "title": "Canada's union calls for countermeasures against U.S. escalating tariffs",
    "description": "OTTAWA, June 4 (Xinhua) -- Canada's largest private sector union, Unifor, on Wednesday urged the federal government to act without delay to counter the escalating steel and aluminum tariffs initiated by the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/05/canada039s-union-calls-for-countermeasures-against-us-escalating-tariffs",
    "timestamp": "2025-06-04T18:45:00Z"
  },
  {
    "title": "EXCLUSIVE: How Donald Trump and J Lo Teamed Up to Boot Out World's Biggest Punk Icon After He 'Destroyed' Diva's Dress",
    "description": "The Legendary musician recently shared his cringey encounter with Donald Trump and Jennifer Lopez decades ago.",
    "link": "https://radaronline.com/p/donald-trump-jennifer-lopez-johnny-rotten-pistols/",
    "timestamp": "2025-06-04T18:45:00Z"
  },
  {
    "title": "Belated Republican Objections to the One Big Beautiful Bill Glide Over Its Blatant Fiscal Irresponsibility",
    "description": "House members who discovered objectionable elements only after voting for the package nevertheless underline the unseemly haste of the legislative process.",
    "link": "https://reason.com/2025/06/04/belated-republican-objections-to-the-one-big-beautiful-bill-glide-over-its-blatant-fiscal-irresponsibility/",
    "timestamp": "2025-06-04T18:43:12Z"
  },
  {
    "title": "GOP Senator Flummoxed By Trump Adviser's Response To Tariff Question",
    "description": "Republican Senator John Kennedy of Louisiana grilled Commerce Secretary Howard Lutnick on the Trump administration's tariffs.",
    "link": "https://www.newsweek.com/howard-lutnick-john-kennedy-tariffs-watch-2081058",
    "timestamp": "2025-06-04T18:41:24Z"
  },
  {
    "title": "Trump: Putin Vows Retaliatory Strike Coming on Ukraine for Nuke Bombers Hit",
    "description": "President Donald Trump said Wednesday he discussed the recent drone attacks by Ukraine on Russia and developments concerning Iran in a telephone conversation with Russian President Vladimir Putin. Kremlin foreign policy aide Yuri Ushakov confirmed the two spo…",
    "link": "https://freerepublic.com/focus/f-news/4320989/posts",
    "timestamp": "2025-06-04T18:41:17Z"
  },
  {
    "title": "US expected to block Gaza ceasefire vote at UNSC",
    "description": "It will be put to vote at 4:00 pm Wednesday (2000 GMT), but several diplomats indicated to AFP that they expected the US to wield its veto power. They added that the representatives from the 10 elected members of the Council, who will introduce the text, trie…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-expected-to-block-gaza-ceasefire-vote-at-unsc/articleshow/121631171.cms",
    "timestamp": "2025-06-04T18:38:10Z"
  },
  {
    "title": "Fed 'Beige Book' economic report cites declining growth, rising prices and slow hiring",
    "description": "The report noted that \"economic activity has declined slightly since the previous report\" released April 23.",
    "link": "https://www.cnbc.com/2025/06/04/fed-beige-book-economic-report-cites-declining-growth-rising-prices-and-slow-hiring.html",
    "timestamp": "2025-06-04T18:36:39Z"
  },
  {
    "title": "Trump: Putin says Russia will ‘have to’ respond to Ukraine attacks",
    "description": "US president says Putin also suggested he would participate in talks aimed at reaching a new nuclear deal with Tehran.",
    "link": "https://www.aljazeera.com/news/2025/6/4/trump-putin-says-russia-will-have-to-respond-to-ukraine-attacks",
    "timestamp": "2025-06-04T18:34:34Z"
  },
  {
    "title": "Trump's Crypto Ties at Forefront as U.S. Lawmakers Weigh Crypto Market Structure Bill",
    "description": "Two House of Representatives hearings dug into the details of the current legislation to regulate U.S. crypto markets, but Trump loomed over the discussions.",
    "link": "https://www.coindesk.com/policy/2025/06/04/trump-s-crypto-ties-at-forefront-as-u-s-lawmakers-weigh-crypto-market-structure-bill",
    "timestamp": "2025-06-04T18:34:28Z"
  },
  {
    "title": "JPMorgan to accept Bitcoin ETFs as loan collateral, consider digital holdings in evaluations",
    "description": "JPMorgan is set to begin accepting Bitcoin (BTC) exchange-traded funds as collateral for loans, Bloomberg News reported on June 4. The lender also plans to consider digital asset holdings when evaluating a client’s net worth and liquid assets, placing crypto …",
    "link": "https://cryptoslate.com/jpmorgan-to-accept-bitcoin-etfs-as-loan-collateral-consider-digital-holdings-in-evaluations/",
    "timestamp": "2025-06-04T18:34:03Z"
  },
  {
    "title": "Bernie Sanders Agrees With Elon Musk",
    "description": "Senator Bernie Sanders is in alignment with billionaire Elon Musk over Trump's budget bill.",
    "link": "https://www.newsweek.com/bernie-sanders-agrees-elon-musk-2081027",
    "timestamp": "2025-06-04T18:32:55Z"
  },
  {
    "title": "Most companies are already raising prices or plan to because of tariffs, data shows",
    "description": "Two different surveys show most firms plan to pass along tariff costs to consumers.",
    "link": "https://www.cnbc.com/2025/06/04/companies-already-raise-prices-or-plan-to-blaming-tariffs-data-shows.html",
    "timestamp": "2025-06-04T18:32:29Z"
  },
  {
    "title": "Part toy, part fashion, the arrival of the viral Labubu was a long time in the making",
    "description": "Labubu has been a bonanza for Pop Mart.",
    "link": "https://www.bostonherald.com/2025/06/04/pop-mart-labubu/",
    "timestamp": "2025-06-04T18:31:24Z"
  },
  {
    "title": "Are We Having Second Thoughts About Capitalism?",
    "description": "I’m not claiming that most people are saying “Let’s get rid of capitalism,” because it still delivers the bacon, to some extent. But I do think that many people are looking for a way to make it work better for everybody, and not just for the few. – Yale Review",
    "link": "https://yalereview.org/article/john-cassidy-capitalism-critics-interview",
    "timestamp": "2025-06-04T18:31:00Z"
  },
  {
    "title": "Trump tax bill will add $2.4 trillion to the deficit and leave 10.9 million more uninsured, CBO says",
    "description": "President Donald Trump’s big bill is likely to unleash trillions in tax cuts and slash spending, but also spike deficits by $2.4 trillion over the decade and leave some 10.9 million more people without health insurance.",
    "link": "https://www.ksat.com/news/politics/2025/06/04/trumps-big-bill-will-cut-taxes-by-37t-and-add-24t-to-deficit-budget-office-says/",
    "timestamp": "2025-06-04T18:30:39Z"
  },
  {
    "title": "Democrats’ $20 Million Study of Men Produces Laughably Obvious Results",
    "description": "DAILY CALLER NEWS FOUNDATION—New findings from the Democrats’ costly and widely panned Speaking with American Men (SAM) project found that many young men view the... Read More\nThe post Democrats’ $20 Million Study of Men Produces Laughably Obvious Results app…",
    "link": "https://www.dailysignal.com/2025/06/04/democrats-20-million-study-young-men-produces-laughably-obvious-results/",
    "timestamp": "2025-06-04T18:30:16Z"
  },
  {
    "title": "Pace Gallery CEO sells Palm Beach home at discount to ex-Dodgers CEO for $19M",
    "description": "Marc Glimcher, president and CEO of Pace Gallery, sold his lakefront Palm Beach house for $19.2 million to Jamie McCourt, the former Dodgers CEO and ambassador to France and Monaco under the first Trump administration. Records show Glimcher’s 1221 NLW LLC, a …",
    "link": "https://therealdeal.com/miami/2025/06/04/pace-gallery-boss-sells-palm-beach-house-to-ex-dodgers-ceo/",
    "timestamp": "2025-06-04T18:30:00Z"
  },
  {
    "title": "A federal court’s novel proposal to rein in Trump’s power grab",
    "description": "President Donald Trump speaks during a news conference on May 30, 2025, in the Oval Office. | Allison Robbert/AFP via Getty Images\nFederal civil servants are supposed to enjoy robust protections against being fired or demoted for political reasons. But Presid…",
    "link": "https://biztoc.com/x/9073a4fea85562c6",
    "timestamp": "2025-06-04T18:28:38Z"
  },
  {
    "title": "Russia: Trump informed Kiev attempted to disrupt talks",
    "description": "Russian presidential aide Yuri Ushakov revealed Wednesday that United States President Donald Trump was informed by his Russian colleague during their phone call of Ukraine's attempts to \"disrupt\" the...",
    "link": "https://biztoc.com/x/834a72550cece411",
    "timestamp": "2025-06-04T18:28:25Z"
  },
  {
    "title": "Multiple polls show Donald Trump’s approval ratings shifting, is it a warning sign for the President?",
    "description": "Donald Trump's approval rating is going up in many new polls. Some show small changes, others show drops. But overall, he's doing better than before. This might help him and the Republican party in future elections, says reports.",
    "link": "https://economictimes.indiatimes.com/news/international/us/multiple-polls-show-donald-trumps-approval-ratings-shifting-is-it-a-warning-sign-for-the-president/articleshow/121630463.cms",
    "timestamp": "2025-06-04T18:28:21Z"
  },
  {
    "title": "The tiny office with 275 employees blocking Trump’s 'Big, Beautiful Bill'",
    "description": "The Congressional Budget Office (CBO) finds itself at the center of a political storm in Washington. Its projection indicates that President Donald Trump's proposed bill could increase the federal deficit. Republicans challenge the CBO's economic assumptions.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-tiny-office-with-275-employees-blocking-trumps-big-beautiful-bill/articleshow/121630848.cms",
    "timestamp": "2025-06-04T18:28:00Z"
  },
  {
    "title": "Give Laken Riley Her Name Back",
    "description": "I’m talking both to the man who murdered Laken Riley and the people who use her name to push their own agenda. Laken Riley is not a bill or a law. She was a person. \nIt’s time for the world to give Laken Riley her name back. Let her family remember her for th…",
    "link": "https://msmagazine.com/2025/06/04/give-laken-riley-her-name-back/",
    "timestamp": "2025-06-04T18:27:23Z"
  },
  {
    "title": "'Watch carefully': Marjorie Taylor Greene doubles down in new 'warning'",
    "description": "U.S. Rep. Marjorie Taylor Greene is doubling down after admitting she didn’t fully read the House GOP’s sweeping budget bill—despite now emphatically opposing its AI provisions. The outspoken Georgia Republican faced widespread ridicule Tuesday, as House Demo…",
    "link": "https://www.rawstory.com/watch-carefully-marjorie-taylor-greene-doubles-down-in-new-warning-to-lawma/",
    "timestamp": "2025-06-04T18:27:18Z"
  },
  {
    "title": "Chip Roy reveals to Glenn Beck possible motive behind Elon Musk's scathing review of the 'big, beautiful bill'",
    "description": "Although Elon Musk has largely functioned as a close ally to President Donald Trump, the former DOGE head condemned one of the administration's greatest legislative projects — and it might not be for the reason you think.Musk signaled disapproval for Trump's …",
    "link": "https://www.theblaze.com/news/chip-roy-reveals-to-glenn-beck-possible-motive-behind-elon-musk-s-scathing-review-of-the-big-beautiful-bill",
    "timestamp": "2025-06-04T18:27:17Z"
  },
  {
    "title": "Texas hospital that sent woman home with nonviable pregnancy violated the law, federal inquiry finds",
    "description": "A federal investigation has found that a Texas hospital that repeatedly sent a woman who was bleeding and in pain home without ending her nonviable, life-threatening pregnancy violated the law.",
    "link": "https://www.pbs.org/newshour/nation/texas-hospital-that-sent-woman-home-with-nonviable-pregnancy-violated-the-law-federal-inquiry-finds",
    "timestamp": "2025-06-04T18:27:15Z"
  },
  {
    "title": "Trump-appointed FDA chief to launch unnecessary review of abortion pill",
    "description": "The FDA approved mifepristone a quarter of a century ago, and the abortion drug has proven to be safe and effective. So why is it reviewing the pill again?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-appointed-fda-chief-launch-unnecessary-review-abortion-pill-rcna210988",
    "timestamp": "2025-06-04T18:26:01Z"
  },
  {
    "title": "Texas hospital that discharged woman with doomed pregnancy violated the law, a federal inquiry finds",
    "description": "A federal investigation has found that a Texas hospital that repeatedly sent a woman who was bleeding and in pain home without ending her nonviable, life-threatening pregnancy violated the law",
    "link": "https://abcnews.go.com/Health/wireStory/texas-hospital-discharged-woman-doomed-pregnancy-violated-law-122492303",
    "timestamp": "2025-06-04T18:22:30Z"
  },
  {
    "title": "Speaker Johnson surprised by Musk's criticism of 'big, beautiful bill': He's 'flat wrong'",
    "description": "House Speaker Mike Johnson told reporters he was surprised by Elon Musk's criticism of the \"big, beautiful bill\" after the two discussed why the legislation was necessary.",
    "link": "https://www.foxnews.com/politics/johnson-surprised-musks-criticism-big-beautiful-bill-hes-flat-wrong",
    "timestamp": "2025-06-04T18:21:35Z"
  },
  {
    "title": "With Elections Now Totally Rigged – California Looks More and More Like a Communist State",
    "description": "The elections in Russia that led to Lenin taking power are what we are seeing now in California.  Once the elections are no longer free and fair a state becomes a communist nightmare.  In December 2020 a man by the name of John Kachelman shared a history less…",
    "link": "https://joehoft.com/breaking-exclusive-with-elections-totally-rigged-california-is-now-a-communist-state/",
    "timestamp": "2025-06-04T18:20:16Z"
  },
  {
    "title": "Report Finds Smartphone Sales Growth Dampened as Tariffs Threaten Price Hikes",
    "description": "Apple's iPhone is expected to see a slump in sales growth this year as Samsung is predicted to remain stagnant.",
    "link": "https://www.cnet.com/tech/mobile/report-finds-smartphone-sales-growth-dampened-as-tariffs-threaten-price-hikes/",
    "timestamp": "2025-06-04T18:20:02Z"
  },
  {
    "title": "Homan Gives a Grim Warning About a Possible '9/11-Style' Terrorist Attack",
    "description": "This week, President Donald Trump’s border czar said that he is “convinced” there will be a major terrorist attack in the United States as a direct result of former President Joe Biden’s open border policies. “It’s coming,” Homan said in an interview on Fox N…",
    "link": "https://freerepublic.com/focus/f-news/4320986/posts",
    "timestamp": "2025-06-04T18:19:09Z"
  },
  {
    "title": "China's chokehold on rare earths set to suffocate auto industry",
    "description": "The move underscores China's dominance of the critical mineral industry and is seen as leverage by China in its ongoing trade war with US President Donald Trump. Trump has sought to redefine the trading relationship with the US' top economic rival China by im…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/chinas-chokehold-on-rare-earths-set-to-suffocate-auto-industry/articleshow/121630613.cms",
    "timestamp": "2025-06-04T18:18:01Z"
  },
  {
    "title": "State Dem party reveals terminal financial condition, asks reporters to keep it secret",
    "description": "Forecasts show group could have only $12,000 left at the end of this year",
    "link": "https://www.wnd.com/2025/06/state-dem-party-reveals-terminal-financial-condition-asks-reporters-to-keep-it-secret/",
    "timestamp": "2025-06-04T18:17:19Z"
  },
  {
    "title": "A federal court’s novel proposal to rein in Trump’s power grab",
    "description": "Federal civil servants are supposed to enjoy robust protections against being fired or demoted for political reasons. But President Donald Trump has effectively stripped them of these protections by neutralizing the federal agencies that implement these safeg…",
    "link": "https://www.vox.com/donald-trump/415466/supreme-court-trump-civil-servants-owen-immigration-judges",
    "timestamp": "2025-06-04T18:17:04Z"
  },
  {
    "title": "Pete Hegseth’s “Warrior” Rebranding Seems More About Rewriting American History",
    "description": "After ordering the renaming of the USNS Harvey Milk, the Defense Secretary is reportedly considering doing the same for vessels honoring other civil rights trailblazers, falling in line with Donald Trump’s attempt to reframe the America’s past.",
    "link": "https://www.vanityfair.com/news/story/pete-hegseths-warrior-rebranding-seems-more-about-rewriting-american-history",
    "timestamp": "2025-06-04T18:15:44Z"
  },
  {
    "title": "Nebraska is the latest state to ban transgender students from girls' sports",
    "description": "Nebraska Gov. Jim Pillen has signed into law a measure banning transgender athletes from girls’ sports",
    "link": "https://abcnews.go.com/US/wireStory/nebraska-latest-state-ban-transgender-students-girls-sports-122503076",
    "timestamp": "2025-06-04T18:15:25Z"
  },
  {
    "title": "Brain Drain: Talented Young People Are Abandoning Plans to Become Scientists as White House Undermines the Entire Career",
    "description": "As the Trump administration continues its crusade against science, the careers of would-be scientists are on the line. President Donald Trump has suggested slashing NASA's science directorate's budget in half, dealing a fatal blow to dozens of future science …",
    "link": "https://futurism.com/scientists-brain-drain-trump-white-house",
    "timestamp": "2025-06-04T18:12:02Z"
  },
  {
    "title": "Ontario expected to pass controversial mining law; Ford warns against blockades",
    "description": "Ontario government is expected to pass a controversial mining law Wednesday that has sparked angry backlash from First Nations who warn they may blockade roads and railways in protest.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-ford-mining-law-1.7552148",
    "timestamp": "2025-06-04T18:11:50Z"
  },
  {
    "title": "Biden White House Press Secretary Karine Jean-Pierre Quits Democratic Party, Citing 'Betrayal'",
    "description": "The former White House press secretary under President Joe Biden is abandoning her party. And she's citing some major trust issues.",
    "link": "https://www.westernjournal.com/biden-white-house-press-secretary-karine-jean-pierre-quits-democratic-party-citing-betrayal/",
    "timestamp": "2025-06-04T18:10:58Z"
  },
  {
    "title": "States Expecting the Biggest Layoffs in June",
    "description": "\"I think we know employment growth will decline and unemployment may rise,\" economist Harry Holzer tells Newsweek.",
    "link": "https://www.newsweek.com/list-companies-layoffs-tariffs-jobs-june-2080010",
    "timestamp": "2025-06-04T18:10:11Z"
  },
  {
    "title": "DAVID MARCUS: Musk vs. MAGA on Big, Beautiful Bill, but GOP needs both",
    "description": "Elon Musk calls Trump's bill a 'disgusting abomination' over debt concerns, creating tension with Trump's base who overwhelmingly support the legislation according to new polling, despite the billionaire's significant influence in Republican politics.",
    "link": "https://www.foxnews.com/opinion/david-marcus-musk-vs-maga-big-beautiful-bill-gop-needs-both",
    "timestamp": "2025-06-04T18:10:02Z"
  },
  {
    "title": "Trump’s tariffs would cut US deficits by $2.8T over 10 years and shrink the economy, CBO says",
    "description": "The nonpartisan CBO said tariffs would reduce the purchasing power of households overall.",
    "link": "https://www.bostonherald.com/2025/06/04/cbo-trump-tariffs/",
    "timestamp": "2025-06-04T18:09:54Z"
  },
  {
    "title": "Duffy moves to defund California high-speed rail after blistering federal review",
    "description": "Transportation Secretary Sean Duffy is threatening to pull federal funding on California's long-troubled high-speed rail project after a scathing report found a myriad of problems, including skyrocketing costs and budget shortfalls.",
    "link": "https://www.foxnews.com/politics/duffy-moves-defund-california-high-speed-rail-after-blistering-federal-review",
    "timestamp": "2025-06-04T18:08:01Z"
  },
  {
    "title": "Trump’s tariffs would cut US deficits by $2.8T over 10 years and shrink the economy, CBO says",
    "description": "WASHINGTON (AP) — President Donald Trump’s sweeping tariff plan would cut deficits by $2.8 trillion over a 10-year period while shrinking the economy, raising the inflation rate and reducing the purchasing power of households overall, according to an analysis…",
    "link": "https://financialpost.com/pmn/trumps-tariffs-would-cut-us-deficits-by-2-8t-over-10-years-and-shrink-the-economy-cbo-says",
    "timestamp": "2025-06-04T18:07:10Z"
  },
  {
    "title": "Heavy metal duties kick in as US awaits 'best offers' from nations",
    "description": "European businesses called on the European Commission, which handles trade talks for the 27-nation EU to do everything it can to remove the tariffs, as the bloc's trade negotiator Maros Sefcovic met with US Trade Representative Jamieson Greer here. Sefcovic s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/heavy-metal-duties-kick-in-as-us-awaits-best-offers-from-nations/articleshow/121630356.cms",
    "timestamp": "2025-06-04T18:06:21Z"
  },
  {
    "title": "‘SNL’ Cast Unpacks Season 50 Including Miss Eggy, Chloe Fineman’s Big Dumb Line, Straight Bowen Yang & Sarah Sherman Nearly Getting “Jacked”",
    "description": "While Saturday Night Live celebrated its 50th anniversary this season – with a star-studded special that featured many of the 167 iconic cast members that have appeared on the show – there was another change that helped it “get back to its roots”. Since Seaso…",
    "link": "http://deadline.com/2025/06/snl-cast-unpack-season-50-1236422018/",
    "timestamp": "2025-06-04T18:06:00Z"
  },
  {
    "title": "Congress Nears Move To Designate the Muslim Brotherhood as a Terrorist Organization",
    "description": "Momentum has built for the U.S. government to formally designate the Muslim Brotherhood as a terrorist organization in the weeks since President Donald Trump’s Middle East trip, lawmakers and other sources familiar with the effort tell the Washington Free Bea…",
    "link": "https://freerepublic.com/focus/f-news/4320982/posts",
    "timestamp": "2025-06-04T18:05:58Z"
  },
  {
    "title": "Did William F. Buckley Pave the Way for Trump?",
    "description": "Did William F. Buckley pave the way for Trump? While a new Buckley biography by Sam Tanenhaus suggests some parallels between the ideologue of Reagan Republicanism and its disrupter, they are from two different ages and worlds.",
    "link": "http://nymag.com/intelligencer/article/william-f-buckley-pave-way-trump.html",
    "timestamp": "2025-06-04T18:05:35Z"
  },
  {
    "title": "50 Wins in the One Big Beautiful Bill (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\n50 Wins in the One Big Beautiful Bill  —  Here are 50 reasons why President Donald J. Trump's One Big Beautiful Bill is the best chance in a generation to pass critical reforms for which Americans voted:  — It deli…",
    "link": "https://www.memeorandum.com/250604/p99",
    "timestamp": "2025-06-04T18:05:01Z"
  },
  {
    "title": "When Even Trump-Friendly Companies Won’t Work With Law Firms That Caved To Trump",
    "description": "If asked, do you think corporate America would prefer to hire (1) lawyers who fight, or (2) lawyers who immediately surrender, I think you’d know the answer. And now we have some fairly unambiguous empirical data to support what the answer is. Oracle’s Larry …",
    "link": "https://www.techdirt.com/2025/06/04/when-even-trump-friendly-companies-wont-work-with-law-firms-that-caved-to-trump/",
    "timestamp": "2025-06-04T18:04:56Z"
  },
  {
    "title": "Trump Proposes Unlikely Alliance With Elizabeth Warren to ‘Prevent an Economic Catastrophe’",
    "description": "President Donald Trump proposed on Wednesday that he and Senator Elizabeth Warren (D-MA) form an unlikely alliance \"to prevent an Economic catastrophe.\"\nThe post Trump Proposes Unlikely Alliance With Elizabeth Warren to ‘Prevent an Economic Catastrophe’ first…",
    "link": "https://www.mediaite.com/media/news/trump-proposes-unlikely-alliance-with-elizabeth-warren-to-prevent-an-economic-catastrophe/",
    "timestamp": "2025-06-04T18:04:53Z"
  },
  {
    "title": "Trump says Putin told him Russia will respond to Ukrainian airfield attack",
    "description": "US and Russian presidents discuss Ukraine and Iran in phone call",
    "link": "https://www.irishtimes.com/world/europe/2025/06/04/trump-says-putin-told-him-russia-will-respond-to-ukrainian-airfield-attack/",
    "timestamp": "2025-06-04T18:04:53Z"
  },
  {
    "title": "I testified at a congressional hearing on the JFK files — I won't make that mistake again",
    "description": "Congress under the Trump administration presents a troubling, undeniable problem: it is dominated by deeply unserious people wielding serious power.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jfk-files-congress-conspiracy-theories-anna-paulina-luna-rcna210504",
    "timestamp": "2025-06-04T18:04:39Z"
  },
  {
    "title": "Trump’s Tariffs On Steel And Aluminum Double To 50%",
    "description": "U.S. tariffs on steel and aluminum doubled from 25% to 50% Wednesday after President Donald Trump announced the move last ...",
    "link": "https://biztoc.com/x/b41c44e1cfacfe60",
    "timestamp": "2025-06-04T18:04:35Z"
  },
  {
    "title": "San Diego labor leaders rally after ICE raid on South Park restaurant",
    "description": "They said Friday's raid on Buona Forchetta was reminiscent of a dictatorship. A warrant for the raid, unsealed on Monday afternoon, alleges nearly half the workers there used fraudulent IDs to obtain employment.",
    "link": "https://www.kpbs.org/news/politics/2025/06/04/san-diego-labor-leaders-rally-after-ice-raid-on-south-park-restaurant",
    "timestamp": "2025-06-04T18:03:06Z"
  },
  {
    "title": "Citi Stops Debanking Gun Retailers",
    "description": "Citigroup announced Tuesday that it’s ending its policy restricting banking services to businesses selling firearms, citing “regulatory developments, recent executive orders and federal legislation.” The policy, which required retailers to limit gun sales to …",
    "link": "https://freerepublic.com/focus/f-news/4320980/posts",
    "timestamp": "2025-06-04T18:02:21Z"
  },
  {
    "title": "Finn McRedmond: Maybe what the world needs right now is another Anthony Bourdain",
    "description": "Chef, TV star, rhetorician and more, he proved the truth of a culinary universal language",
    "link": "https://www.irishtimes.com/opinion/2025/06/04/finn-mcredmond-maybe-what-the-world-needs-right-now-is-another-anthony-bourdain/",
    "timestamp": "2025-06-04T18:00:01Z"
  },
  {
    "title": "“I Am Not Afraid”",
    "description": "The Trump administration is attacking protesters from all angles. Activists refuse to back down.",
    "link": "https://inthesetimes.com/article/trump-campus-protest-crackdown-ice",
    "timestamp": "2025-06-04T18:00:00Z"
  },
  {
    "title": "Republicans aren't following Elon Musk's lead anymore",
    "description": "Months ago, Musk helped tank a massive government funding bill. Now, the GOP is largely dismissing his criticisms of their \"big beautiful bill.\"",
    "link": "https://www.businessinsider.com/republicans-not-listening-elon-musk-anymore-big-beautiful-bill-2025-6",
    "timestamp": "2025-06-04T17:58:59Z"
  },
  {
    "title": "Putin-Trump Phone Call Lasted 70 Minutes - Kremlin Aide",
    "description": "MOSCOW (Sputnik) - The conversation between Russian President Vladimir Putin and US President Donald Trump lasted 70 minutes, Kremlin aide Yuri Ushakov said on Wednesday.",
    "link": "https://sputnikglobe.com/20250604/putin-trump-phone-call-lasted-70-minutes---kremlin-aide-1122193046.html",
    "timestamp": "2025-06-04T17:57:11Z"
  },
  {
    "title": "House GOP unveils resolution to condemn Boulder terror attack, call for mass deportation of overstayed visas",
    "description": "Reps. Randy Fine and August Pfluger are rolling out a new resolution to condemn antisemitism and call for the deportation of people who have overstayed visas.",
    "link": "https://www.foxnews.com/politics/house-gop-unveils-resolution-condemn-boulder-terror-attack-call-mass-deportation-overstayed-visas",
    "timestamp": "2025-06-04T17:56:35Z"
  },
  {
    "title": "Putin feels he must respond to Ukraine's drone attacks, Trump warns",
    "description": "US President Donald Trump said on Wednesday he had a \"good conversation\" with Russian President Vladimir Putin, in a call about Ukraine's recent drone attack and Iran. Following Ukraine's major drone attack deep on air bases inside Russia, Trump reported that…",
    "link": "https://freerepublic.com/focus/f-news/4320977/posts",
    "timestamp": "2025-06-04T17:55:22Z"
  },
  {
    "title": "Putin Tells Trump Russia Will Strike Back Over Ukraine Drone Attacks",
    "description": "President Donald Trump said he spoke with Russian President Vladimir Putin for over an hour to discuss Ukraine’s drone strikes inside Russia and the Iranian nuclear issue. \nIn a post on Truth Social, Trump said Putin emphasized that Russia “will have to respo…",
    "link": "https://biztoc.com/x/8fe60518c7792750",
    "timestamp": "2025-06-04T17:55:05Z"
  },
  {
    "title": "Trump Aide Hassett Reveals Coinbase Stake of at Least $1 Million (Bill Allison/Bloomberg)",
    "description": "Bill Allison / Bloomberg:\nTrump Aide Hassett Reveals Coinbase Stake of at Least $1 Million  —  Kevin Hassett, one of President Donald Trump's top economic officials, revealed holding a stake in Coinbase Global Inc. worth at least $1 million thanks to his work…",
    "link": "https://www.memeorandum.com/250604/p97",
    "timestamp": "2025-06-04T17:55:00Z"
  },
  {
    "title": "Russia: Trump said he wasn't informed about Ukraine's attack",
    "description": "Russian presidential aide Yuri Ushakov commented Wednesday on the results of the phone call held between United States President Donald Trump and his Russian counterpart Vladimir Putin earlier today, ...",
    "link": "https://biztoc.com/x/eb81dd3e3f6b6807",
    "timestamp": "2025-06-04T17:54:54Z"
  },
  {
    "title": "Here's How Donald Trump Responded To Elon Musk's Twitter Meltdown, And It's EXACTLY What We All Saw Coming",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b01785db-a702-4864-ad66-994057f216fc",
    "timestamp": "2025-06-04T17:54:17Z"
  },
  {
    "title": "Sen. Ron Johnson rips into 'immoral' GOP spending bill: 'I can't accept it'",
    "description": "Ron Johnson has been among the loudest Senate critics of the budget bill that narrowly passed the House last month.",
    "link": "https://www.cnbc.com/2025/06/04/ron-johnson-republican-spending-bill-elon-musk-trump.html",
    "timestamp": "2025-06-04T17:52:54Z"
  },
  {
    "title": "‘Woke propaganda disguised as news’: Congress taking up Trump plan to defund leftist propaganda",
    "description": "House to begin rescission work on NPR, PBS cash in just days",
    "link": "https://www.wnd.com/2025/06/woke-propaganda-disguised-as-news-congress-taking-up-trump-plan-to-defund-leftist-propaganda/",
    "timestamp": "2025-06-04T17:52:38Z"
  },
  {
    "title": "Trump to shore up support among Senate GOP at White House meeting",
    "description": "Members of the Senate Finance Committee will meet with Trump at the White House.",
    "link": "https://abcnews.go.com/Politics/trump-shore-support-senate-gop-white-house-meeting/story?id=122497578",
    "timestamp": "2025-06-04T17:52:19Z"
  },
  {
    "title": "Trump Says Xi Is ‘Extremely Hard To Make A Deal With’ As China Trade Negotiations Stall",
    "description": "President Donald Trump said early Wednesday morning that Chinese President Xi Jinping is “very tough” and “extremely hard to make a deal with” as the United States attempts to advance trade talks with China. While the president’s top trade officials have met …",
    "link": "https://freerepublic.com/focus/f-news/4320975/posts",
    "timestamp": "2025-06-04T17:51:11Z"
  },
  {
    "title": "There's a way to aid Gaza. I know, my foundation just helped deliver 7 million meals... without incident",
    "description": "The Gaza Humanitarian Foundation has successfully delivered 7 million meals in Gaza amid a Hamas disinformation campaign that reveals a system that failed Palestinians for decades.",
    "link": "https://www.foxnews.com/opinion/theres-way-aid-gaza-i-know-my-foundation-helped-deliver-7-million-meals-without-incident",
    "timestamp": "2025-06-04T17:51:08Z"
  },
  {
    "title": "The big mistake Labour think Farage has made - and how the chancellor hopes to capitalise",
    "description": "Next week, the chancellor will unveil the first spending review since 2021. It will set Whitehall budgets for the remainder of this parliament and it will be a big moment for a government struggling to tell a story about what it is trying to achieve to voters.",
    "link": "https://news.sky.com/story/the-big-mistake-labour-think-nigel-farage-has-made-and-how-the-chancellor-hopes-to-capitalise-13379207",
    "timestamp": "2025-06-04T17:51:00Z"
  },
  {
    "title": "Condoleezza Rice reveals concerning shift in Putin's behavior, calls him 'desperate' as Ukraine strikes back",
    "description": "Former Secretary of State Condoleezza Rice issued a stark warning on Russian President Vladimir Putin's behavioral shift, arguing he is 'desperate' to 'extinguish' Ukraine.",
    "link": "https://www.foxnews.com/media/condoleezza-rice-reveals-concerning-shift-putins-behavior-calls-him-desperate-ukraine-strikes-back",
    "timestamp": "2025-06-04T17:50:23Z"
  },
  {
    "title": "Putin Tells Trump He Will Respond to Ukraine Attack",
    "description": "\"Russian President Vladimir Putin told President Donald Trump in a phone call Wednesday that he was obligated to respond to Ukraine’s weekend drone attack, Trump said, setting up a potential escalation in the conflict just",
    "link": "https://politicalwire.com/2025/06/04/putin-tells-trump-he-will-respond-to-ukraine-attack/",
    "timestamp": "2025-06-04T17:50:19Z"
  },
  {
    "title": "‘No One Can Offer Any Hope’",
    "description": "Even if most Americans haven’t abandoned their private sense of empathy, many don’t seem terribly bothered by the rancidness of their leaders.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/trump-vance-empathy-afghanistan-refugees/683032/",
    "timestamp": "2025-06-04T17:50:00Z"
  },
  {
    "title": "Trump's surprise IPL intervention",
    "description": "In a bizarre turn, Donald Trump claims credit for Royal Challengers Bengaluru's IPL victory, asserting he influenced the other teams to ensure RCB's win due to their long losing streak. Trump praised Virat Kohli and hinted at an executive order to ban the LBW…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/trumps-surprise-ipl-intervention/articleshow/121629934.cms",
    "timestamp": "2025-06-04T17:48:29Z"
  },
  {
    "title": "A lingering Musk: Will ex-aide Elon get up Trump's nose?",
    "description": "Donald Trump's sweeping domestic policy bill has careened into an Elon Musk-shaped brick wall, complicating its passage into law and risking a schism between the most powerful man in the world and the wealthiest. Continued interventions by Musk over governmen…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-lingering-musk-will-ex-aide-elon-get-up-trumps-nose/articleshow/121629924.cms",
    "timestamp": "2025-06-04T17:47:38Z"
  },
  {
    "title": "Trump Is Creating ‘Chaos’ for US Energy, Quantum Founder VanLoh Says",
    "description": "Wil VanLoh, the founder of one of the biggest private equity backers of shale drillers, said he’s concerned President Donald Trump’s administration is creating “a lot of chaos” both for the US energy industry and the overall economy that could in turn lead to…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-is-creating-chaos-for-us-energy-quantum-founder-vanloh-says",
    "timestamp": "2025-06-04T17:45:47Z"
  },
  {
    "title": "Secretary Sh*tfaced Orders Renaming Of USNS Harvey Milk, Because He's A Little Bitch",
    "description": "Greatest fighting force in the history of the world, and it's reduced to this.",
    "link": "https://www.wonkette.com/p/secretary-shtfaced-orders-renaming",
    "timestamp": "2025-06-04T17:45:27Z"
  },
  {
    "title": "Trump says Iran 'slowwalking' as Khamenei opposes nuclear proposal",
    "description": "WASHINGTON - US President Donald Trump accused Tehran on Wednesday of \"slowwalking\" on a nuclear deal, after Iran's supreme leader Ayatollah Ali Khamenei said the latest proposal from Washington was against the national interest.",
    "link": "https://www.bangkokpost.com/world/3041902/trump-says-iran-slowwalking-as-khamenei-opposes-nuclear-proposal",
    "timestamp": "2025-06-04T17:45:00Z"
  },
  {
    "title": "'Do this!' Trump declares rare unity with Democratic foe after 'all these years'",
    "description": "President Donald Trump joined Sen Elizabeth Warren in calling for the elimination of the debt limit.The president is pushing congressional Republicans to pass a massive domestic policy bill that would permanently extend his 2017 tax cuts, and the version curr…",
    "link": "https://www.rawstory.com/donald-trump-debt-limit-warren/",
    "timestamp": "2025-06-04T17:44:27Z"
  },
  {
    "title": "Trade tensions stall Apple Intelligence rollout in China",
    "description": "Amid regulatory limbo and \"increasing political uncertainties,\" trade tensions stall Apple Intelligence rollout in China.\n(via Cult of Mac - A 24/7 website publishing the latest Apple news, rumors, reviews, how-tos and deals.)",
    "link": "https://www.cultofmac.com/news/trade-tensions-stall-apple-intelligence-rollout-in-china",
    "timestamp": "2025-06-04T17:44:13Z"
  },
  {
    "title": "Semiconductor Supplier GlobalFoundries to Spend $16B to Boost US Chip Production",
    "description": "Key Takeaways\n- GlobalFoundries plans to spend more than $16 billion to increase chip production in the U.S.\n- The supplier of major tech firms said the move followed calls by President Donald Trump to increase domestic manufacturing.\n- GlobalFoundries noted …",
    "link": "https://biztoc.com/x/f6011f19757ade8a",
    "timestamp": "2025-06-04T17:44:00Z"
  },
  {
    "title": "Ontario expected to pass controversial mining law; Ford warns against blockades",
    "description": "TORONTO — Ontario Premier Doug Ford’s government is expected to pass a controversial mining law that gives it the power to suspend provincial and municipal laws for chosen projects in areas it deems to have economic importance. If Bill 5 ends up being challen…",
    "link": "https://financialpost.com/pmn/ontario-expected-to-pass-controversial-mining-law-ford-warns-against-blockades",
    "timestamp": "2025-06-04T17:43:51Z"
  }
]