[
  {
    "title": "Mexico senators come to blows after debate over U.S. military intervention",
    "description": "Mexican senators came to blows after a heated debate over alleged opposition calls for the U.S. to intervene militarily against drug cartels.",
    "link": "https://www.cbsnews.com/news/mexico-senators-fight-us-military-intervention-drug-cartels/",
    "timestamp": "2025-08-28T11:24:18Z"
  },
  {
    "title": "India’s Russian oil imports set to rise in September in defiance of US",
    "description": "New Delhi says it is relying on talks to try to resolve Trump's additional tariffs, but Prime Minister Narendra Modi has also embarked on a tour to develop diplomatic ties elsewhere, including meeting Russian President Vladimir Putin",
    "link": "https://www.thehindubusinessline.com/news/world/indias-russian-oil-imports-set-to-rise-in-september-in-defiance-of-us/article69984359.ece",
    "timestamp": "2025-08-28T11:24:06Z"
  },
  {
    "title": "Russian Troops Push Into Dnipropetrovsk As Fuel Crisis Hits Moscow",
    "description": "The move puts Ukraine's industrial heartland at risk, while analysts warned it signals Moscow's intent to stretch Ukraine's defenses across multiple fronts beyond Donbas.",
    "link": "https://www.ibtimes.com/russian-troops-push-dnipropetrovsk-fuel-crisis-hits-moscow-3781847",
    "timestamp": "2025-08-28T11:21:44Z"
  },
  {
    "title": "Russia advances in Kupiansk, rejects US push for Zelenskyy-Putin summit",
    "description": "Moscow's forces extend encirclement of Ukraine's northeastern city and pummel Kyiv with a deadly attack.",
    "link": "https://www.aljazeera.com/news/2025/8/28/russia-advances-in-kupiansk-rejects-us-push-for-zelenskyy-putin-summit",
    "timestamp": "2025-08-28T11:21:37Z"
  },
  {
    "title": "트럼프, 인도에 50% 관세 발효에 충돌 본격화",
    "description": "Indian tycoon Gautam Adani is adding more women leaders to his ports-to-power conglomerate as part of a push to diversify its boardrooms — a transformation that’s seeing talent drafted from within the family https://t.co/mKmDDYwh8P— Bloomberg (@business) Augu…",
    "link": "https://ryueyes11.tistory.com/511807",
    "timestamp": "2025-08-28T11:21:34Z"
  },
  {
    "title": "Hundreds honor victims of Minneapolis Catholic school shooting",
    "description": "The children who died were 8 and 10.",
    "link": "https://nypost.com/2025/08/28/us-news/minneapolis-residents-honor-victims-of-annunciation-catholic-school-shooting/",
    "timestamp": "2025-08-28T11:18:38Z"
  },
  {
    "title": "‘If Indians don’t budge, I don’t think the President will’: Trump adviser on India trade talks",
    "description": "Kevin Hassett's remarks echoed US Treasury Secretary Scott Bessent, who said high tariffs on India are “not just over India’s purchase of Russian oil” but also because “this is a very complicated relationship.”",
    "link": "https://indianexpress.com/article/world/us-tariffs-on-india-kevin-hassett-trump-adviser-trade-talks-10216383/",
    "timestamp": "2025-08-28T11:18:18Z"
  },
  {
    "title": "Italian PM takes credit for Ukraine guarantee proposal",
    "description": "Giorgia Meloni has taken credit for suggesting a collective defense clause be extended to Kiev as part of settlement of the conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623627-italy-ukraine-security-guarantees/",
    "timestamp": "2025-08-28T11:16:53Z"
  },
  {
    "title": "'Trump Tariffs May Backfire': From UK To China, How Global Media Covered US Levies On India",
    "description": "US President Donald Trump's 50% tariff on Indian products became effective from Aug 27, that is Wednesday. The tariffs have stirred the Indian export market and feelings of worry and fear have bubbled up. Sectors like textiles, gems and jewellery, shrimp, lea…",
    "link": "https://www.ndtvprofit.com/world/trump-tariffs-may-backfire-from-uk-to-china-how-global-media-covered-us-levies-on-india",
    "timestamp": "2025-08-28T11:14:05Z"
  },
  {
    "title": "Al Sharpton leads Wall Street protest for DEI",
    "description": "The Rev. Al Sharpton is set to lead a protest march on Wall Street to urge corporate America to resist the Trump administration’s campaign to roll back diversity, equity and inclusion initiatives.",
    "link": "https://www.wgal.com/article/al-sharpton-wall-street-march-dei-rollback/65919821",
    "timestamp": "2025-08-28T11:13:41Z"
  },
  {
    "title": "Al Sharpton leads Wall Street protest for DEI",
    "description": "The Rev. Al Sharpton is set to lead a protest march on Wall Street to urge corporate America to resist the Trump administration’s campaign to roll back diversity, equity and inclusion initiatives.",
    "link": "https://www.wmur.com/article/al-sharpton-wall-street-march-dei-rollback/65919821",
    "timestamp": "2025-08-28T11:13:36Z"
  },
  {
    "title": "North Korea's Kim will meet with Xi and Putin at Chinese military parade",
    "description": "With Russia's Vladimir Putin also coming for the parade, the event will underline the three-way alignment among Beijing, Moscow and Pyongyang in the face of a U.S. push to bolster its alliances with South Korea and Japan.",
    "link": "https://www.npr.org/2025/08/28/g-s1-85964/north-koreas-kim-will-meet-with-xi-and-putin-at-chinese-military-parade",
    "timestamp": "2025-08-28T11:09:53Z"
  },
  {
    "title": "Trump tariff hammer hits India’s biggest garment hubs",
    "description": "India's garment export hubs near Delhi face a grim reality as the US imposes 50% tariffs, impacting orders and prompting buyers to seek discounts. Exporters fear closures and job losses as competitors like Bangladesh gain an edge.",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/garments-/-textiles/trump-tariff-hammer-hits-indias-biggest-garment-hubs/articleshow/123562438.cms",
    "timestamp": "2025-08-28T11:09:37Z"
  },
  {
    "title": "Swiss economy set to slow due to US tariffs",
    "description": "The Swiss economy will likely grow more slowly than previously expected next year due to the massive import tariffs imposed by US President Donald Trump, the economy ministry said Thursday. Trump blindsided Switzerland when he announced that incoming Swiss go…",
    "link": "https://www.digitaljournal.com/world/swiss-economy-set-to-slow-due-to-us-tariffs/article",
    "timestamp": "2025-08-28T11:07:33Z"
  },
  {
    "title": "Melania Trump ‘shattered’ to ‘senseless and depraved’ Minnesota school shooting, calls for ‘pre-emptive intervention’",
    "description": "First lady Melania Trump issued a rare statement Wednesday calling for “pre-emptive” intervention” to identify future school shooters after the Minneapolis shooting left two children dead and 17 others injured.",
    "link": "https://nypost.com/2025/08/28/us-news/melania-trump-calls-for-preemptive-intervention-after-robin-westman-kills-two-in-minneapolis-school-shooting/",
    "timestamp": "2025-08-28T11:07:19Z"
  },
  {
    "title": "Will SCOTUS Let Trump Fire Lisa Cook From the Federal Reserve?",
    "description": "President Donald Trump has purported to fire Lisa Cook from her position as a member of the Federal Reserve's Board of Governors.\nCan he lawfully do that? Or, perhaps the better question to ask: Will the U.S. Supreme Court let him do that?\nBefore tackling tho…",
    "link": "https://biztoc.com/x/f5b4db5d29db0714",
    "timestamp": "2025-08-28T11:06:42Z"
  },
  {
    "title": "Deadly Russian Attack Kills 15 In Kyiv, Raising Fears For Peace Talks",
    "description": "Russian missiles and drones ripped through apartment blocks in the Ukrainian capital Kyiv early Thursday, killing at least 15 people, including four children, an attack that President Volodymyr Zelensky said showed Moscow's rejection of peace negotiations.",
    "link": "https://www.ibtimes.com.au/deadly-russian-attack-kills-15-kyiv-raising-fears-peace-talks-1860277",
    "timestamp": "2025-08-28T11:06:14Z"
  },
  {
    "title": "'Arming the problem': Ex-Trump operative slams president for making school shootings worse",
    "description": "A former Donald Trump insider who has himself experienced a child hiding from an active shooter skewered the president for making the school shooting problem even worse.Former Trump associate Lev Parnas, who says he used to be \"deep inside the Trump machine\" …",
    "link": "https://www.rawstory.com/trump-parnas-school-shooting-worse/",
    "timestamp": "2025-08-28T11:06:01Z"
  },
  {
    "title": "If Trump loves gay weddings so much, what's he going to do if SCOTUS takes them away?",
    "description": "The only thing that Donald Trump\r\n has ever been consistent about in his life is his devotion to money, so it should surprise no one that his private take on marriage equality has nothing to do with rights, dignity, or love.",
    "link": "https://www.advocate.com/if-trump-loves-gay-weddings-so-much-what-s-he-going-to-do-if-scotus-takes-them-away",
    "timestamp": "2025-08-28T11:04:13Z"
  },
  {
    "title": "If Trump loves gay weddings so much, what's he going to do if SCOTUS takes them away?",
    "description": "The only thing that Donald Trump\r\n has ever been consistent about in his life is his devotion to money, so it should surprise no one that his private take on marriage equality has nothing to do with rights, dignity, or love.",
    "link": "https://www.advocate.com/voices/if-trump-loves-gay-weddings-so-much-what-s-he-going-to-do-if-scotus-takes-them-away",
    "timestamp": "2025-08-28T11:04:13Z"
  },
  {
    "title": "Modi’s Billionaires in Trump’s Crosshairs",
    "description": "Following the collapse of US-India trade talks, Donald Trump’s administration has stepped up efforts to pressure oligarchs linked to Indian Prime Minister Narendra Modi, most notably Gautam Adani and Mukesh Ambani. By targeting Modi’s inner circle, Trump may …",
    "link": "https://www.project-syndicate.org/commentary/trump-trade-tactics-hit-modi-where-it-hurts-by-jayati-ghosh-2025-08",
    "timestamp": "2025-08-28T11:04:00Z"
  },
  {
    "title": "The CIA and the Pentagon: an uneasy alliance",
    "description": "The Pentagon and the CIA agree on US supremacy — but clash on how best to achieve it. Their rivalry has ebbed and flowed, but today's emphasis on technology is giving the CIA the edge\n\n-\n2025/09\n\n/ \narticle",
    "link": "https://mondediplo.com/2025/09/08cia-pentagon",
    "timestamp": "2025-08-28T11:03:43Z"
  },
  {
    "title": "Transcript: Trump Erupts in Rage as Dem Gov’s Harsh Takedown Hits Home",
    "description": "The following is a lightly edited transcript of the August 28 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.This week, G…",
    "link": "https://newrepublic.com/article/199721/transcript-trump-erupts-rage-dem-gov-harsh-takedown-hits-home",
    "timestamp": "2025-08-28T11:02:28Z"
  },
  {
    "title": "Krista Kafer: Trump gets virtually everything wrong about the Constitution and mail-in-voting",
    "description": "In a recent social media post, Trump declared he intends to ban mail-in voting in the 2026 election. If Trump was striving for 100% inaccuracy in a single post, he nailed it.",
    "link": "https://www.denverpost.com/2025/08/28/mail-voting-trump-wrong-constitution-krista-kafer/",
    "timestamp": "2025-08-28T11:01:58Z"
  },
  {
    "title": "The growing power of France's pro-Israel lobby",
    "description": "Binyamin Netanyahu asserts that his country is fighting a ‘shared war' in defence of Western values. In France, as elsewhere, it's a message that has found powerful advocates.\n\n-\n2025/09\n\n/ \narticle",
    "link": "https://mondediplo.com/2025/09/04israel-france",
    "timestamp": "2025-08-28T11:01:00Z"
  },
  {
    "title": "Why politicians abandon Switzerland-like centrism to be more like Trump",
    "description": "Gavin Newsom and Zohran Mamdani show how politicians must embrace bold, controversial stances rather than moderate positions to succeed in modern campaigns.",
    "link": "https://www.foxnews.com/opinion/why-politicians-abandon-switzerland-like-centrism-more-like-trump",
    "timestamp": "2025-08-28T11:00:55Z"
  },
  {
    "title": "Trump’s New CDC Chief Fights Ouster as Top Agency Officials Step Down",
    "description": "Meanwhile, HHS head RFK, Jr. indicates he will release findings related to autism in September.\nThe post Trump’s New CDC Chief Fights Ouster as Top Agency Officials Step Down first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/trumps-new-cdc-chief-fights-ouster-as-top-agency-officials-step-down/",
    "timestamp": "2025-08-28T11:00:46Z"
  },
  {
    "title": "DC Mayor Bowser reverses course, admits Trump's federal crime crackdown is working",
    "description": "D.C. Mayor Muriel Bowser changed her stance on Trump's federal officer surge after initially calling it \"unsettling,\" now praising its effectiveness in reducing crime.",
    "link": "https://www.foxnews.com/media/dc-mayor-bowser-reverses-course-admits-trumps-federal-crime-crackdown-working",
    "timestamp": "2025-08-28T11:00:03Z"
  },
  {
    "title": "Are the Most Dangerous Words in Criminal Justice About to Disappear? | Opinion",
    "description": "When it comes to criminal justice, the two most dangerous words are undoubtedly \"early release.\"",
    "link": "https://www.newsweek.com/are-most-dangerous-words-criminal-justice-about-disappear-opinion-2119582",
    "timestamp": "2025-08-28T11:00:01Z"
  },
  {
    "title": "‘You’re fired!’ Kimmel claims Trump is behind Colbert canning",
    "description": "Now, that’s funny!Jimmy Kimmel, soon to inherit Stephen Colbert’s throne as king of clapter, is standing tall for free speech.Crime in DC? What crime? Union Station remains a utopian vision of progress, just don’t mind the junkies waving dirty needles in your…",
    "link": "https://www.theblaze.com/align/youre-fired-kimmel-claims-trump-is-behind-colbert-canning",
    "timestamp": "2025-08-28T11:00:00Z"
  },
  {
    "title": "A Blueprint for Military Takeovers",
    "description": "How the president could normalize military presence in American cities",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/08/a-blueprint-for-military-takeovers/684026/",
    "timestamp": "2025-08-28T11:00:00Z"
  },
  {
    "title": "Kim Jong-un to join Putin at China’s Victory Day celebrations – Beijing",
    "description": "The surprise visit is viewed as a gesture of reassurance as Pyongyang is developing closer ties with Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623625-kim-putin-china-parade/",
    "timestamp": "2025-08-28T10:57:59Z"
  },
  {
    "title": "Garment hubs of Gurgaon & Noida brace for uncertain times",
    "description": "As India’s garment sector navigates these turbulent waters, the long-term implications of the US tariffs remain to be seen. The industry’s resilience will be tested, and the response from both businesses and the government will be crucial in determining the f…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/garments-/-textiles/garment-hubs-of-gurgaon-noida-brace-for-uncertain-times/articleshow/123561655.cms",
    "timestamp": "2025-08-28T10:57:55Z"
  },
  {
    "title": "Trump’s attack on Lisa Cook is an attack on all of us",
    "description": "Donald Trump is trying to do something no American president has ever done: fire a sitting governor of the Federal Reserve for political reasons.",
    "link": "https://biztoc.com/x/d1e20edebdf4f6ee",
    "timestamp": "2025-08-28T10:55:16Z"
  },
  {
    "title": "On Russia’s hit list but unshaken: Rheinmetall CEO leads Europe’s defence surge",
    "description": "Despite a foiled assassination plot, Armin Papperger remains calm as Germany’s largest weapons manufacturer ramps up artillery production to counter Russian aggression and bolster NATO’s defenses.",
    "link": "https://news.sky.com/story/on-russia-s-hit-list-but-unshaken-rheinmetall-ceo-leads-europe-s-defence-surge-13419903",
    "timestamp": "2025-08-28T10:55:00Z"
  },
  {
    "title": "Ron DeSantis Wasted $250 Million on Alligator Alcatraz as It Faces Closure",
    "description": "A federal judge has ruled that the new Florida detention center must close within 60 days.",
    "link": "https://www.newsweek.com/ron-desantis-wasted-250-million-alligator-alcatraz-it-faces-closure-2120638",
    "timestamp": "2025-08-28T10:53:32Z"
  },
  {
    "title": "Donald Trump Has Shocking Response to Taylor Swift Engagement",
    "description": "Reading Time: 3 minutesDonald Trump has never been a fan of Taylor Swift or Travis Kelce. This is how he feels about their engagement.\nDonald Trump Has Shocking Response to Taylor Swift Engagement was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/08/donald-trump-has-shocking-response-to-taylor-swift-engagement/",
    "timestamp": "2025-08-28T10:51:34Z"
  },
  {
    "title": "I was a teenage Trumper: How a first-gen immigrant fell out of love with MAGA",
    "description": "At 21, Steve Vilchez is much like any other senior at Illinois State University. Studying biology teacher education, he aspires to teach high school science. But, Vilchez has an unusual story to tell. From 2016 until the aftermath of the Jan. 6, 2021 attack o…",
    "link": "https://www.rawstory.com/raw-investigates/i-was-a-teenage-trumper-how-a-first-gen-u-s-immigrant-fell-in-and-out-of-love-with-maga/",
    "timestamp": "2025-08-28T10:50:38Z"
  },
  {
    "title": "In Trump's Second Term, a Bolder President Charges Ahead Unchecked (Wall Street Journal)",
    "description": "Wall Street Journal:\nIn Trump's Second Term, a Bolder President Charges Ahead Unchecked  —  Trump is frequently riffing on authoritarianism and ignoring caution from advisers  —  Some aides to Donald Trump warned the president that building a ballroom at the …",
    "link": "https://www.memeorandum.com/250828/p7",
    "timestamp": "2025-08-28T10:50:01Z"
  },
  {
    "title": "Von der Leyen launches tour of ‘frontline’ states to bolster defense against Russia",
    "description": "The tour marks a major effort to show EU solidarity and support for countries bordering Russia or Belarus.",
    "link": "https://www.politico.eu/article/ursula-von-der-leyen-launche-tour-frontline-states-bolster-defense-against-russia/",
    "timestamp": "2025-08-28T10:49:52Z"
  },
  {
    "title": "‘Just Back Off!’ Brian Kilmeade Playfully Warns Jesse Watters for Ranting Fox — ‘Not Trump’ — Forced Cracker Barrel Rebrand Rollback",
    "description": "Kilmeade warned Watters to “go easy” after the host playfully ranted that he wouldn’t be giving Trump “credit” for Cracker Barrel’s return to its old logo.\nThe post ‘Just Back Off!’ Brian Kilmeade Playfully Warns Jesse Watters for Ranting Fox — ‘Not Trump’ — …",
    "link": "https://www.mediaite.com/media/tv/just-back-off-brian-kilmeade-playfully-warns-jesse-watters-for-ranting-fox-not-trump-forced-cracker-barrel-rebrand-rollback/",
    "timestamp": "2025-08-28T10:48:51Z"
  },
  {
    "title": "Jesse Watters Tells Trump To Back Off Over 1 Boast: 'I’m Not Giving Trump Credit On This'",
    "description": "The Fox News anchor scolded the president for taking credit where he believed it wasn't due.",
    "link": "https://www.huffpost.com/entry/jesse-watters-donald-trump-credit_n_68b02e06e4b0bbcc3f8e4838",
    "timestamp": "2025-08-28T10:45:08Z"
  },
  {
    "title": "Russia Defends Kyiv Strikes as Trump Pushes for Ukraine Peace",
    "description": "The strikes killed at least 14 people, including children.",
    "link": "https://www.newsweek.com/trump-russia-ukraine-war-zelensky-putin-strikes-kyiv-2120708",
    "timestamp": "2025-08-28T10:44:49Z"
  },
  {
    "title": "Xi's Secret Letter to India, Nvidia Forecasts Decelerating Growth | The Opening Trade 8/28/2025",
    "description": "Beijing began a quiet outreach to India in March when US President Donald Trump was ratcheting up his trade war with China, ...",
    "link": "https://biztoc.com/x/932a73d586a94bd3",
    "timestamp": "2025-08-28T10:40:21Z"
  },
  {
    "title": "At least 14 people, including three children, killed in overnight Russian strikes in Kyiv",
    "description": "The attack blasted a five-storey crater in one apartment block, ripping the building in two.",
    "link": "https://www.thejournal.ie/14-people-killed-after-overnight-russian-strikes-in-ukraines-capital-kyiv-6801209-Aug2025/",
    "timestamp": "2025-08-28T10:37:00Z"
  },
  {
    "title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US",
    "description": "MOSCOW/LONDON (Reuters) -Russian oil exports to India are set to rise in September, traders said, as producers cut prices to sell more crude because they...",
    "link": "https://sg.finance.yahoo.com/news/exclusive-india-russian-oil-imports-103602449.html",
    "timestamp": "2025-08-28T10:36:02Z"
  },
  {
    "title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US",
    "description": "MOSCOW/LONDON (Reuters) -Russian oil exports to India are set to rise in September, traders said, as producers cut prices to sell more crude because they...",
    "link": "https://finance.yahoo.com/news/exclusive-india-russian-oil-imports-103602322.html",
    "timestamp": "2025-08-28T10:36:02Z"
  },
  {
    "title": "India's Russian oil imports set to rise in September in defiance of US",
    "description": "India is poised to increase its Russian oil imports in September due to discounted prices and refinery outages in Russia caused by Ukrainian attacks. Despite U.S. tariffs and EU price caps, India continues to rely on Russian crude, benefiting from cheaper sup…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/indias-russian-oil-imports-set-to-rise-in-september-in-defiance-of-us/articleshow/123562485.cms",
    "timestamp": "2025-08-28T10:35:31Z"
  },
  {
    "title": "'End of his political career!' Trump pounces on Dem contender in middle-of-night rant",
    "description": "President Donald Trump fired off at Maryland Governor Wes Moore (D) early morning Thursday following reports that the governor had mistakenly listed himself as a Bronze Star recipient in an application nearly two decades ago.Moore and Trump have feuded public…",
    "link": "https://www.rawstory.com/wes-moore-trump-erupts-overnight/",
    "timestamp": "2025-08-28T10:33:47Z"
  },
  {
    "title": "Thursday Morning Open Thread",
    "description": "Good news, if true: WASTE! FRAUD! ABUSE! Send the $400 million bill to Ron DeSantis and Donald Trump. ??Alligator Alcatraz will be empty within days, according to an email obtained by ABC News. [image or embed] — Christopher Webb (@cwebbonline.com) August 27,…",
    "link": "https://balloon-juice.com/2025/08/28/thursday-morning-open-thread-68/",
    "timestamp": "2025-08-28T10:32:38Z"
  },
  {
    "title": "Is Trump considering bold Africa play to push back on China, Russia and Islamic terrorists?",
    "description": "Ted Cruz has called on President Trump to recognize Somaliland in exchange for a new strategic air and sea base, and access to rare earth minerals.",
    "link": "https://www.foxnews.com/world/trump-considering-bold-africa-play-push-back-china-russia-islamic-terrorists",
    "timestamp": "2025-08-28T10:30:08Z"
  },
  {
    "title": "Amtrak is launching its faster NextGen Acela with better amenities after years of delays. Here's what you need to know",
    "description": "Amtrak is introducing five of its 28 planned new NextGen Acela trains on Thursday, signaling the next step of America's attempt at high-speed rail.",
    "link": "https://www.cnbc.com/2025/08/28/amtrak-nextgen-acela-high-speed-rail.html",
    "timestamp": "2025-08-28T10:30:01Z"
  },
  {
    "title": "Trump administration's land conservation projects in limbo",
    "description": "Funding for US conservation projects faces uncertainty. Projects across 38 states are in limbo. Donald Trump's administration considers redirecting funds. This affects land and water conservation. The Land and Water Conservation Fund is impacted. Concerns ris…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administrations-land-conservation-projects-in-limbo/articleshow/123562324.cms",
    "timestamp": "2025-08-28T10:28:16Z"
  },
  {
    "title": "RFK Jr. Says He Can Diagnose Kids With Health Issues Just By Looking at Them: ‘You Can Tell From Their Faces’",
    "description": "Secretary of Health Robert F. Kennedy Jr. claimed in a speech on Wednesday that he could diagnose children with health issues just by looking at their face",
    "link": "https://www.newsbreak.com/share/4200760405887-rfk-jr-says-he-can-diagnose-kids-with-health-issues-just-by-looking-at-them-you-can-tell-from-their-faces?_f=app_share&amp;pd=00UhHWCu&amp;lang=en_US&amp;send_time=1756376771&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button-v3%2Csc_ios_comment_share_v2-v1&amp;s=i2",
    "timestamp": "2025-08-28T10:26:48Z"
  },
  {
    "title": "Newsom Paints Bleak Picture of American Democracy",
    "description": "Gov. Gavin Newsom (D) warned the country is on the precipice of tipping into authoritarianism, predicting that President Donald Trump does not want to leave office after his term ends and accusing federal immigration officials",
    "link": "https://politicalwire.com/2025/08/28/newsom-paints-bleak-picture-of-american-democracy/",
    "timestamp": "2025-08-28T10:25:36Z"
  },
  {
    "title": "Mass Russian drone and missile attack kills 15 and injures 48 in Ukraine's capital",
    "description": "Russia bombarded the Ukrainian capital with drones and missiles early Thursday, including a rare strike in the city center, killing at least 15 people and wounding 48, local authorities said.",
    "link": "https://www.independent.ie/world-news/europe/mass-russian-drone-and-missile-attack-kills-15-and-injures-48-in-ukraines-capital/a636683139.html",
    "timestamp": "2025-08-28T10:23:42Z"
  },
  {
    "title": "Who’s to blame for higher US power bill?",
    "description": "Energy Secretary Chris Wright attributes rising electricity bills to Democrats' green power policies, but the reality is more complex. Distribution infrastructure investments, not generation, drive much of the price increase. While deregulation has been succe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whos-to-blame-for-higher-us-power-bill/articleshow/123562065.cms",
    "timestamp": "2025-08-28T10:20:55Z"
  },
  {
    "title": "Gavin Newsom Reveals Trump Team’s Trolling Gifts To Him And The Dark Message Behind Them",
    "description": "The revelation drew laughter from a summit audience but prompted the California governor to warn: “This is serious, guys. This is serious.\"",
    "link": "https://www.huffpost.com/entry/gavin-newsom-trolled-by-trump-team_n_68b0197ee4b0bbcc3f8e3895",
    "timestamp": "2025-08-28T10:20:30Z"
  },
  {
    "title": "Gloria Gaynor has been revealed as a Republican donor and LGBTQ+ people are furious: ‘F**k her’",
    "description": "It might take all our strength not to fall apart, but it would appear that (former) queer icon Gloria Gaynor has donated thousands of dollars to Republican lawmakers over the last few years. The news comes as a result of an examination into the donations made…",
    "link": "https://www.thepinknews.com/2025/08/28/gloria-gaynor-republican-lgbtq-i-will-survive/",
    "timestamp": "2025-08-28T10:20:11Z"
  },
  {
    "title": "Minnesota shooter wrote of killing ‘fil#hy Zionist Jews,’ ‘free Palestine’.\nRobin Westman, who was transgender, killed two children at a Catholic school.",
    "description": "Minnesota shooter wrote of killing ‘fil#hy Zionist Jews,’ ‘free Palestine’. Robin Westman, who was transgender, killed two children at a Catholic school. JNS Staff. (Aug. 27, 2025 / JNS) Robin Westman, who died of a self-inflicted gunshot after killing two ch…",
    "link": "https://freerepublic.com/focus/f-news/4337201/posts",
    "timestamp": "2025-08-28T10:19:10Z"
  },
  {
    "title": "US CDC chief fired after weeks in role as other top officials quit agency",
    "description": "Susan Monarez fired while four officials resign amid tensions over vaccine policies and public health directives.",
    "link": "https://www.aljazeera.com/news/2025/8/28/us-cdc-chief-fired-after-weeks-in-role-as-other-top-officials-quit-agency",
    "timestamp": "2025-08-28T10:17:11Z"
  },
  {
    "title": "In Chicago, locals prepare for Trump's possible deployment of National Guard",
    "description": "CHICAGO (Reuters) -When U.S. President Donald Trump threatened to flood Chicago with National Guard troops and Immigration and Customs Enforcement agents earlier this month, Illinois Governor J.B. Pritzker said that the president lacked the legal authority. R…",
    "link": "https://www.thestar.com.my/news/world/2025/08/28/in-chicago-locals-prepare-for-trump039s-possible-deployment-of-national-guard",
    "timestamp": "2025-08-28T10:17:00Z"
  },
  {
    "title": "The 'land swap' that wasn't: Inside Trump's frantic dash for Ukraine peace",
    "description": "WASHINGTON (Reuters) -Shortly after meeting Vladimir Putin in Moscow on August 6, U.S. special envoy Steve Witkoff delivered major news to Donald Trump: The Russian president was prepared to offer significant territorial concessions to end his war in Ukraine.…",
    "link": "https://www.thestar.com.my/news/world/2025/08/28/the-039land-swap039-that-wasn039t-inside-trump039s-frantic-dash-for-ukraine-peace",
    "timestamp": "2025-08-28T10:16:00Z"
  },
  {
    "title": "U.S. officials pressure EU regulators to soften tech regulations",
    "description": "President Donald Trump called out countries trying to regulate U.S. tech companies earlier this week, warning they could face new tariffs. The White House has struck a provisional trade deal with the European Union, but tensions remain over the bloc's sweepin…",
    "link": "https://www.marketplace.org/episode/2025/08/27/us-officials-pressure-eu-regulators-to-soften-tech-regulations",
    "timestamp": "2025-08-28T10:15:00Z"
  },
  {
    "title": "The 'land swap' that wasn't: Inside Trump's frantic dash for Ukraine peace",
    "description": "Donald Trump's administration tried to end the Ukraine war. Steve Witkoff met Vladimir Putin and conveyed a potential deal. The proposal involved territorial concessions. European leaders were surprised by the offer. Witkoff later changed his account. A Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-land-swap-that-wasnt-inside-trumps-frantic-dash-for-ukraine-peace/articleshow/123562084.cms",
    "timestamp": "2025-08-28T10:13:06Z"
  },
  {
    "title": "Ukraine updates: EU office damaged in deadly Kyiv strikes",
    "description": "The EU condemned a \"deliberate\" Russian attack in which the building of the EU delegation in Kyiv was also hit. Ukraine said at least 14 people were killed in overnight Russian strikes on the capital. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-eu-office-damaged-in-deadly-kyiv-strikes/live-73789764",
    "timestamp": "2025-08-28T10:12:00Z"
  },
  {
    "title": "China Is Big Winner of Trump's Falling Out With India's Modi",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's decision to ratchet up tariffs on India, far from teaching New Delhi a lesson, may be nudging it into the embrace of America's foes and strengthening China's geopolitical sway in the A…",
    "link": "https://biztoc.com/x/7259e0b59441ad38",
    "timestamp": "2025-08-28T10:11:11Z"
  },
  {
    "title": "The Disaster that Was George W. Bush",
    "description": "In a recent New York Times column, David French in one of his usual anti-Trump screeds, created a hagiographic picture of the presidency of George W. Bush, comparing him to Donald Trump’s current term of office. Wrote French:\nBush was interventionist; Trump i…",
    "link": "https://biztoc.com/x/0fdf972b1444ec8d",
    "timestamp": "2025-08-28T10:10:40Z"
  },
  {
    "title": "Trump isn’t just remodeling the White House. He’s rebranding America",
    "description": "In 1990, Playboy published an interview with Donald Trump in which the future president offered his thoughts on foreign affairs, the death penalty, and why he puts his name on everything. He also reflected on the meaning — or, perhaps, meaninglessness — of li…",
    "link": "https://biztoc.com/x/cd0054ae18547afa",
    "timestamp": "2025-08-28T10:10:30Z"
  },
  {
    "title": "Canada must be ready to get its elbows up again to stand a chance in the post-Trump era",
    "description": "Kevin Yin is a contributing columnist for The Globe and Mail and an economics doctoral student at the University of California, Berkeley.\nWe can note with immense pride that Canada was one of two countries that actually retaliated against U.S. President Donal…",
    "link": "https://biztoc.com/x/200ae738b25c7a40",
    "timestamp": "2025-08-28T10:10:20Z"
  },
  {
    "title": "Trump-trolling Gov. Gavin Newsom suggests 'coin' is coming to online store: 'Trump corruption coin'",
    "description": "Golden State Gov. Gavin Newsom, a Democrat, indicated he's poised to release a \"coin\" in his online store that features Trump-trolling merchandise",
    "link": "https://www.foxnews.com/politics/trump-trolling-gov-gavin-newsom-suggests-coin-coming-online-store-trump-corruption-coin",
    "timestamp": "2025-08-28T10:08:56Z"
  },
  {
    "title": "Was Minneapolis Shooter Robin Westman Republican? What We Know",
    "description": "A video allegedly posted online by the suspected shooter praised a Republican congressional candidate.",
    "link": "https://www.newsweek.com/minneapolis-shooter-robin-westman-republican-2120627",
    "timestamp": "2025-08-28T10:08:18Z"
  },
  {
    "title": "Lassi Price Hiked By 75%? Mother Dairy Responds After User Questions Rs 15 Jump",
    "description": "Mother Dairy on Thursday issued a clarification after a user on social media claimed that the price of its sweet lassi had been hiked from Rs 20 to Rs 35 without any prior announcement. The user, identified as Kamlesh Singh, said that the price was hiked \"ove…",
    "link": "https://www.ndtvprofit.com/trending/lassi-price-hiked-by-75-mother-dairy-responds-after-user-questions-rs-15-jump",
    "timestamp": "2025-08-28T10:02:23Z"
  },
  {
    "title": "Why the tech bubble seems safe - at least for now",
    "description": "For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it?",
    "link": "https://news.sky.com/story/nvidia-tech-bubble-seems-safe-so-long-as-ai-demand-remains-high-13419880",
    "timestamp": "2025-08-28T10:01:00Z"
  },
  {
    "title": "China Is Big Winner of Trump's Falling Out With India's Modi",
    "description": "Experts told Newsweek that Trump's tariffs risk nudging India away from the West—and straight into China's welcoming orbit.",
    "link": "https://www.newsweek.com/china-big-winner-trump-modi-dispute-2120426",
    "timestamp": "2025-08-28T10:00:58Z"
  },
  {
    "title": "Trump’s pick to help run the FBI has a history of prosecuting influential Democrats",
    "description": "Andrew Bailey’s targeting of Democrats is legally questionable, experts say, but it’s helped to further his career",
    "link": "https://www.salon.com/2025/08/28/trumps-pick-to-help-run-the-fbi-has-a-history-of-prosecuting-influential-democrats_partner/",
    "timestamp": "2025-08-28T10:00:53Z"
  },
  {
    "title": "Opinion: End the U.S. liquor ban and let consumers decide",
    "description": "On travel and many imports Canadians have switched to non-U.S. options. Let's trust them to shun U.S. liquor — or not, as they wish. Read on",
    "link": "https://financialpost.com/opinion/end-us-liquor-ban-let-consumers-decide",
    "timestamp": "2025-08-28T10:00:51Z"
  },
  {
    "title": "DC politicians kept 'chopping away' at law enforcement, paving way for Trump takeover, former FBI agent says",
    "description": "A former FBI special agent says that that policies surrounding crime in Washington, D.C. backfired, leading to President Trump's federalization of the Metropolitan Police Department.",
    "link": "https://www.foxnews.com/us/dc-politicians-kept-chopping-away-law-enforcement-paving-way-trump-takeover-former-fbi-agent-says",
    "timestamp": "2025-08-28T10:00:38Z"
  },
  {
    "title": "Trump has 'upper hand' on Democrats in crime debate, MSNBC guest admits",
    "description": "Rachel Bade, a Politico columnist, said Wednesday that President Trump had the \"upper hand\" on crime politically over Democrats during a \"Morning Joe\" discussion.",
    "link": "https://www.foxnews.com/media/trump-has-upper-hand-democrats-crime-debate-msnbc-guest-admits",
    "timestamp": "2025-08-28T10:00:31Z"
  },
  {
    "title": "National Guard deployment: Experts estimate deployment in DC is costing roughly $1 million a day",
    "description": "The ongoing National Guard mission in Washington, DC, as part of President Donald Trump’s crime crackdown in the city, is costing roughly $1 million a day, experts estimated to CNN.",
    "link": "https://www.cnn.com/2025/08/28/politics/cost-national-guard-deployment-washington-dc",
    "timestamp": "2025-08-28T10:00:09Z"
  },
  {
    "title": "Newsweek Contributors Debate: Are Trump's Deportations Effective?",
    "description": "Have Trump's immigration policies been a successful deterrent? Or draconian violations of migrant rights?",
    "link": "https://www.newsweek.com/newsweek-contributors-debate-are-trumps-deportations-effective-2119741",
    "timestamp": "2025-08-28T10:00:01Z"
  },
  {
    "title": "AI Doesn’t Spout MAGA Propaganda. No Wonder Donald Trump Hates It.",
    "description": "“How many genders are there?” I asked Claude.“Gender depends on cultural, legal, and individual perspectives,” the chatbot said. “Biological sex characteristics exist on a spectrum. Western legal systems have traditionally recognized only two genders. Traditi…",
    "link": "https://newrepublic.com/article/199644/artificial-intelligence-chat-trump-maga-propaganda",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "Breaking Down the White House’s Lies and Distortions About Crime in DC",
    "description": "This story was originally published by The Watch, Radley Balko’s substack publication, to which you can subscribe here. So let’s get this out of the way first: As I wrote in a previous post, Donald Trump’s “takeover” of Washington, DC, is authoritarian thugge…",
    "link": "https://www.motherjones.com/politics/2025/08/trump-white-house-claims-lies-dc-crime-ice-national-guard/",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "This Artist Painted Trump at Mar-a-Lago. Now She’s Documenting His Immigration Crackdown.",
    "description": "In June, Isabelle Brourman took a sketch board and her press pass to immigration court at 26 Federal Plaza in New York City. She’d heard that US Immigration and Customs Enforcement (ICE) officers were arresting people after their hearings, and she wanted to d…",
    "link": "https://www.motherjones.com/politics/2025/08/trump-portrait-artist-isabelle-brourman-trial-mar-lago-immigration-court-ice-arrests/",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "They Survived Katrina and Started to Rebuild. Now Trump’s Cuts May Flood Them Out Again.",
    "description": "After Hurricane Katrina and its related flooding inundated much of New Orleans in 2005, residents of a large Vietnamese community in the Algiers neighborhood were some of the first to return and rebuild. But 20 years later, their neighborhood is still prone t…",
    "link": "https://www.motherjones.com/politics/2025/08/they-survived-katrina-and-started-to-rebuild-now-trumps-cuts-may-flood-them-out-again/",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "Trump’s attack on Lisa Cook is an attack on all of us",
    "description": "Donald Trump is trying to do something no American president has ever done: fire a sitting governor of the Federal Reserve for political reasons.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-lisa-cook-federal-reserve-independence-rcna227526",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "A Texas Congressman Is Quietly Helping Elon Musk Pitch a $760M Plan to Build Tunnels Under Houston to Ease Flooding",
    "description": "by Lauren McGaughy, The Texas Newsroom, and Yilun Cheng, Houston Chronicle \n \n\n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\nThis article is co-published with The …",
    "link": "https://www.kut.org/politics/2025-08-28/elon-musk-texas-houston-flood-hurricane-tunnels-boring",
    "timestamp": "2025-08-28T10:00:00Z"
  },
  {
    "title": "North Korea's Kim To Visit China for First Time in Six Years: What To Know",
    "description": "Pyongyang's leader is due to join Russian President Vladimir Putin in Beijing to attend a huge military parade.",
    "link": "https://www.newsweek.com/north-korea-kim-jong-un-china-visit-2120633",
    "timestamp": "2025-08-28T09:51:49Z"
  },
  {
    "title": "US-Sanctioned Russian LNG Lands in China for First Time",
    "description": "A tanker with a shipment of liquefied natural gas from a US-sanctioned export facility in Russia has docked at a Chinese terminal for the first time, the latest move by Moscow to expand fuel deliveries into Asia.",
    "link": "https://financialpost.com/pmn/business-pmn/us-sanctioned-russian-lng-lands-in-china-for-first-time",
    "timestamp": "2025-08-28T09:50:52Z"
  },
  {
    "title": "Smartphone Market to Grow in 2025 Despite Trump Tariffs, Says IDC",
    "description": "IDC lifts smartphone forecast for 2025, citing iOS growth, GenAI features, and rising foldable demand despite tariff concerns.",
    "link": "https://www.androidheadlines.com/2025/08/smartphone-market-to-grow-in-2025-despite-trump-tariffs-says-idc.html",
    "timestamp": "2025-08-28T09:50:16Z"
  },
  {
    "title": "Trump Administration Withdraws $175 Million More From California's High-Speed Rail Project, Calls It 'Failed Experiment'",
    "description": "In a fresh blow to California’s high-speed rail project, the Trump administration has withdrawn another $175 million in funding, adding to the challenges...",
    "link": "https://finance.yahoo.com/news/trump-administration-withdraws-175-million-094605858.html",
    "timestamp": "2025-08-28T09:46:05Z"
  },
  {
    "title": "Trump’s Team Simply Cannot Leave This Man Alone",
    "description": "First, they deported him unlawfully. Now, they’re trying a new, cruel form of punishment.",
    "link": "https://slate.com/news-and-politics/2025/08/kilmar-abrego-garcia-deportation-trump-marco-rubio.html",
    "timestamp": "2025-08-28T09:45:00Z"
  },
  {
    "title": "NATO says all countries to hit spending goal",
    "description": "NATO on Thursday said all its members were finally set this year to hit the alliance's previous defense spending target of 2 percent of GDP, as they gear up for a far more ambitious goal.",
    "link": "https://www.hurriyetdailynews.com/nato-says-all-countries-to-hit-spending-goal-212997",
    "timestamp": "2025-08-28T09:44:57Z"
  }
]