[
  {
    "title": "Israel’s Assault Marks One of the Deadliest Days for Children in Gaza History",
    "description": "“Israeli forces have signed a death warrant for Palestinian children in Gaza,” one rights group worker said.",
    "link": "https://truthout.org/articles/israels-assault-marks-one-of-the-deadliest-days-for-children-in-gaza-history/",
    "timestamp": "2025-03-18T21:10:08Z"
  },
  {
    "title": "Jordan demands testimony from prosecutors who went after Trump (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nJordan demands testimony from prosecutors who went after Trump  —  It's the latest step in the House GOP's efforts to support the president's desires for political retribution.  —  House Judiciary Chair Jim Jordan is calling prosecuto…",
    "link": "https://www.memeorandum.com/250318/p124",
    "timestamp": "2025-03-18T21:10:02Z"
  },
  {
    "title": "Los astronautas varados en la Estación Espacial abandonan la nave y vuelven a la Tierra",
    "description": "Nick Hague, Suni Williams, Butch Wilmore y Aleksandr Gorbunov viajan a bordo de la nave espacial SpaceX Dragon.",
    "link": "https://www.montevideo.com.uy/Ciencia-y-Tecnologia/Los-astronautas-varados-en-la-Estacion-Espacial-abandonan-la-nave-y-vuelven-a-la-Tierra-uc918052",
    "timestamp": "2025-03-18T21:10:00Z"
  },
  {
    "title": "Israeli settlers accused of major livestock theft in West Bank",
    "description": "Palestinian Bedouins report theft of 1500 livestock by Israeli settlers.",
    "link": "https://www.nzherald.co.nz/world/israeli-settlers-accused-of-major-livestock-theft-in-west-bank/MC3RWVWC5FB5LNPNMQWNIFWSP4/",
    "timestamp": "2025-03-18T21:09:52Z"
  },
  {
    "title": "US continues operations against the Houthis",
    "description": "The US has continued striking the Houthis in Yemen, hitting targets across territory controlled by the group, including military sites, infrastructure, and personnel. The Houthis have unsuccessfully attempted to target US naval assets in response.\nThe post US…",
    "link": "https://www.longwarjournal.org/archives/2025/03/us-continues-operations-against-the-houthis.php",
    "timestamp": "2025-03-18T21:09:33Z"
  },
  {
    "title": "Steve Kornacki: White men, white women and the gap within the gender gap",
    "description": "College-educated white women and white men without college degrees have come to exist in polar opposite political and cultural universes, each one unrelatable and probably unrecognizable to the other.",
    "link": "https://www.nbcnews.com/politics/elections/steve-kornacki-white-men-white-women-gap-gender-gap-rcna196791",
    "timestamp": "2025-03-18T21:08:36Z"
  },
  {
    "title": "BOJ set to keep interest rates steady as Trump risks cloud outlook",
    "description": "TOKYO : The Bank of Japan is set to keep interest rates steady on Wednesday, as policymakers spend more time gauging how prospects of higher U.S. tariffs would affect the export-reliant economy.The recent market rout and fears of a global slowdown caused by U…",
    "link": "https://www.channelnewsasia.com/business/boj-set-keep-interest-rates-steady-trump-risks-cloud-outlook-5009171",
    "timestamp": "2025-03-18T21:07:36Z"
  },
  {
    "title": "US judge orders Elon Musk's DOGE to stop firing employees of foreign aid agency",
    "description": "The judge’s ruling was the latest legal setback to Trump’s cost-cutting and government staff reduction drive.",
    "link": "https://www.thejournal.ie/us-judge-orders-elon-musks-doge-to-stop-firing-employees-of-foreign-aid-agency-6653177-Mar2025/",
    "timestamp": "2025-03-18T21:07:21Z"
  },
  {
    "title": "Conor McGregor: Rape crisis charity complaint over Trump visit",
    "description": "The Dublin Rape Crisis Centre says McGregor's meeting with Donald Trump \"effectively normalises sexual violence\".",
    "link": "https://www.bbc.com/news/articles/c4gp8elw4v5o",
    "timestamp": "2025-03-18T21:07:10Z"
  },
  {
    "title": "Solana, XRP and Dogecoin Slump as Crypto Market Awaits Fed’s ‘Dot Plot’",
    "description": "Top altcoins like Solana and XRP are down ahead of the Federal Reserve’s policy decision, an event that could shape rate cut expectations.",
    "link": "https://decrypt.co/310534/solana-xrp-dogecoin-slump-federal-reserve",
    "timestamp": "2025-03-18T21:07:02Z"
  },
  {
    "title": "U.S. Pulls Out of Group Seeking to Prosecute Putin as Trump Focuses on Peace.",
    "description": "The U.S. is exiting the International Center for the Prosecution of the Crime of Aggression against Ukraine, a group the former Biden government joined in 2023 to virtue-signal about Russian President Vladimir Putin and others being guilty of war crimes. This…",
    "link": "https://freerepublic.com/focus/f-news/4305161/posts",
    "timestamp": "2025-03-18T21:06:36Z"
  },
  {
    "title": "Trump, Putin on same page about Iran's nuclear weapon capabilities, White House says",
    "description": "Trump and Putin agreed that Iran must not obtain access to weapons permitting Tehran to obliterate Israel, the White House said.",
    "link": "https://www.foxnews.com/politics/trump-putin-same-page-about-irans-nuclear-weapon-capabilities-white-house-says",
    "timestamp": "2025-03-18T21:06:36Z"
  },
  {
    "title": "Germany Is Re-Arming For War With Russia. Here’s What Hundreds Of Billions Of Dollars Will Buy.",
    "description": "A massive budget increase will pay for armored vehicles, ships and satellites—and people.",
    "link": "https://www.forbes.com/sites/davidaxe/2025/03/18/germany-is-re-arming-for-war-with-russia-heres-what-hundreds-of-billions-of-dollars-will-buy/",
    "timestamp": "2025-03-18T21:06:30Z"
  },
  {
    "title": "Trump Dramatically Escalates Military Strikes on Yemen’s Houthis",
    "description": "It’s unclear what the U.S. president’s ultimate aims are—or whether increased military action will be enough to neutralize the Houthi threat.",
    "link": "http://foreignpolicy.com/2025/03/18/trump-houthi-strikes-yemen-israel/",
    "timestamp": "2025-03-18T21:05:18Z"
  },
  {
    "title": "Conor McGregor: Rape crisis charity complaint over Trump visit",
    "description": "The Dublin Rape Crisis Centre says McGregor's meeting with Donald Trump \"effectively normalises sexual violence\".",
    "link": "https://www.bbc.co.uk/news/articles/c4gp8elw4v5o",
    "timestamp": "2025-03-18T21:04:53Z"
  },
  {
    "title": "Obama judge blocks Trump, Musk from dismantling USAID in blow to crown jewel of DOGE cuts",
    "description": "Blistering 68-page ruling gives White House 7 days to confirm in writing that email and computer access is restored to employees",
    "link": "https://www.wnd.com/2025/03/obama-judge-blocks-trump-musk-from-dismantling-usaid-in-blow-to-crown-jewel-of-doge-cuts/",
    "timestamp": "2025-03-18T21:03:15Z"
  },
  {
    "title": "Zelensky Has a Key Question after Trump's Call with Putin",
    "description": "Following the call between U.S. President Donald Trump and Russian President Vladimir Putin on Tuesday, Ukrainian President Volodymyr Zelensky stressed the need for full transparency in all peace discussions.\n\"We need to understand what the conversation is ab…",
    "link": "https://biztoc.com/x/eeeb7f87d0153a51",
    "timestamp": "2025-03-18T21:02:32Z"
  },
  {
    "title": "JD Vance tries to mend the MAGA-Tech divide",
    "description": "On Tuesday, Vice President JD Vance publicly acknowledged a simmering “tension” between two warring factions inside the Republican party – the populist MAGA right and the tech billionaires who threw their support to Donald Trump – and called for a truce.\nIn r…",
    "link": "https://biztoc.com/x/da4aa639980f87db",
    "timestamp": "2025-03-18T21:02:17Z"
  },
  {
    "title": "Trump on Putin Call: We Agreed to 'Immediate' Energy, Infrastructure Ceasefire; 'Many Elements' of Possible Peace Deal Discussed",
    "description": "President Donald Trump said he and Russian President Vladimir Putin agreed to an immediate ceasefire on infrastructure and energy in the Ukraine War. \nThe post Trump on Putin Call: We Agreed to ‘Immediate’ Energy, Infrastructure Ceasefire; ‘Many Elements’ of …",
    "link": "https://www.breitbart.com/politics/2025/03/18/trump-on-putin-call-we-agreed-immediate-energy-infrastructure-ceasefire-many-elements-possible-peace-deal-discussed/",
    "timestamp": "2025-03-18T21:01:26Z"
  },
  {
    "title": "National Review Writer Roasts Trump Over ‘Endless Capacity to Absorb Humiliation’ by Putin",
    "description": "Noah Rothman roasted President Donald Trump on Tuesday, marveling at his \"endless capacity to absorb humiliation\" at the hands of Vladimir Putin.\nThe post National Review Writer Roasts Trump Over ‘Endless Capacity to Absorb Humiliation’ by Putin first appeare…",
    "link": "https://www.mediaite.com/news/national-review-writer-roasts-trump-over-endless-capacity-to-absorb-humiliation-by-putin/",
    "timestamp": "2025-03-18T21:01:06Z"
  },
  {
    "title": "Dear Chief Justice Roberts, Do Your Job",
    "description": "My take on Chief Justice Roberts admonition against impeaching federal district court judges: \"So Chief Justice Roberts, if you want the normal appellate process to work, you have to make it work. You have to do your job. The Supreme Court needs to do its job…",
    "link": "https://legalinsurrection.com/2025/03/dear-chief-justice-roberts-do-your-job/",
    "timestamp": "2025-03-18T21:00:29Z"
  },
  {
    "title": "Why there's no such thing as 'clean' coal",
    "description": "President Donald Trump has called for the expansion of U.S. coal production, claiming that an increase of \"clean\" coal produced in the U.S. will soon take place.",
    "link": "https://abcnews.go.com/US/trump-clean-coal-thing/story?id=119920490",
    "timestamp": "2025-03-18T21:00:18Z"
  },
  {
    "title": "The Feds' Legal Arguments for These Deportations Are Laughably Weak",
    "description": "A Trump administration official admits that there is little specific evidence tying some deportees to any crime—and argues that the lack of evidence should be taken as proof of criminality.",
    "link": "https://reason.com/2025/03/18/the-feds-legal-arguments-for-these-deportations-are-laughably-weak/",
    "timestamp": "2025-03-18T21:00:17Z"
  },
  {
    "title": "LAME DUCK: Republicans already gaming out Vance '28 odds...",
    "description": "The VP is the early favorite, but there’s plenty of time left on the clock.",
    "link": "https://www.semafor.com/article/03/18/2025/republicans-already-gauging-vances-odds-for-2028",
    "timestamp": "2025-03-18T21:00:03Z"
  },
  {
    "title": "Energy Chief Praises Research Hub That Trump Once Sought to Ax",
    "description": "The Advanced Research Projects Agency-Energy, or ARPA-E, has doled out some $4.2 billion to more than 1,700 energy projects since 2009.",
    "link": "https://www.rigzone.com/news/wire/energy_chief_praises_research_hub_that_trump_once_sought_to_ax-18-mar-2025-179960-article/",
    "timestamp": "2025-03-18T21:00:00Z"
  },
  {
    "title": "ABC News President Almin Karamehmedovic Tells Staffers ‘GMA3’ Will Remain, Outlines News Division Restructuring",
    "description": "ABC News President Almin Karamehmedovic told staffers that GMA3 will remain on the air, while he outlined the news division’s restructuring, now completed after a recent round of layoffs. Karamehmedovic wrote in a memo after a town hall meeting this afternoon…",
    "link": "http://deadline.com/2025/03/abc-news-gma3-restructuring-1236330083/",
    "timestamp": "2025-03-18T20:59:47Z"
  },
  {
    "title": "Elon Musk May Need to Recalculate His Opinion on EV Tax Credit Repeal",
    "description": "On the campaign trail last year, asked about US EV subsidies, Elon Musk said that he was opposed to all subsidies and would be happy with both EV and fossil fuel subsidies being removed. Of course, Republicans in control of everything are not going to remove …",
    "link": "https://cleantechnica.com/2025/03/18/elon-musk-may-need-to-recalculate-his-opinion-on-ev-tax-credit-repeal/",
    "timestamp": "2025-03-18T20:56:44Z"
  },
  {
    "title": "US Court Orders Immediate Halt To Elon Musk Shutdown Of USAID",
    "description": "A federal judge ordered an immediate halt on Tuesday to the shutdown of the main US aid agency by Elon Musk&#039;s Department of Government Efficiency (DOGE).",
    "link": "https://www.ndtv.com/world-news/us-court-orders-immediate-halt-to-elon-musk-shutdown-of-us-aid-agency-7955370",
    "timestamp": "2025-03-18T20:55:15Z"
  },
  {
    "title": "Zelensky Has One Key Question After Trump's Call with Putin",
    "description": "Zelensky said Putin's condition was an attempt to \"weaken\" Ukraine by trying to cut off the crucial flow of weapons and intelligence.",
    "link": "https://www.newsweek.com/zelensky-has-key-question-after-trumps-call-putin-2046818",
    "timestamp": "2025-03-18T20:55:09Z"
  },
  {
    "title": "Putin makes self-serving concession to Ukraine as Trump tries unsuccessfully to become a statesman",
    "description": "What did Donald Trump’s phone call with Vladimir Putin actually accomplish in terms of a lasting ceasefire agreement with Ukraine? Not much.",
    "link": "https://theconversation.com/putin-makes-self-serving-concession-to-ukraine-as-trump-tries-unsuccessfully-to-become-a-statesman-252368",
    "timestamp": "2025-03-18T20:55:05Z"
  },
  {
    "title": "Trump-Putin ceasefire conversation shows no initial signs of ending the war in Ukraine",
    "description": "What did Donald Trump’s phone call with Vladimir Putin actually accomplish in terms of a lasting ceasefire agreement with Ukraine? Not much.",
    "link": "https://theconversation.com/trump-putin-ceasefire-conversation-shows-no-initial-signs-of-ending-the-war-in-ukraine-252368",
    "timestamp": "2025-03-18T20:55:05Z"
  },
  {
    "title": "Trump-Putin ceasefire conversation shows no initial signs of bringing peace to Ukraine",
    "description": "What did Donald Trump’s phone call with Vladimir Putin actually accomplish in terms of a lasting ceasefire agreement with Ukraine? Not much.",
    "link": "https://theconversation.com/trump-putin-ceasefire-conversation-shows-no-initial-signs-of-bringing-peace-to-ukraine-252368",
    "timestamp": "2025-03-18T20:55:05Z"
  },
  {
    "title": "Putin makes paltry concession to Ukraine in Trump’s self-aggrandizing ceasefire effort",
    "description": "What did Donald Trump’s phone call with Vladimir Putin actually accomplish in terms of a lasting ceasefire agreement with Ukraine? Not much.",
    "link": "https://theconversation.com/putin-makes-paltry-concession-to-ukraine-in-trumps-self-aggrandizing-ceasefire-effort-252368",
    "timestamp": "2025-03-18T20:55:05Z"
  },
  {
    "title": "Trump Moves to Settle the Fascism Debate (Joe Perticone/The Bulwark)",
    "description": "Joe Perticone / The Bulwark:\nTrump Moves to Settle the Fascism Debate  —  Plus: A supposedly fun thing Chuck Schumer will never do again.  —  President Donald Trump took another step in an openly fascist direction over the weekend when he skirted a federal co…",
    "link": "https://www.memeorandum.com/250318/p122",
    "timestamp": "2025-03-18T20:55:01Z"
  },
  {
    "title": "Republican Behind “Trump Derangement Bill” Accused of Soliciting Minor",
    "description": "A right-wing Minnesota state senator, who infamously co-sponsored a bill Monday to label “Trump Derangement Syndrome” a mental illness, was arrested hours later for allegedly soliciting a minor for prostitution.\r\nSenator Justin Eichorn was arrested at 6 p.m. …",
    "link": "https://newrepublic.com/post/192890/republican-trump-derangement-bill-arrested-soliciting-minor",
    "timestamp": "2025-03-18T20:54:33Z"
  },
  {
    "title": "Trump Nominates Bowman, Bank Industry Favorite, to be Next Vice Chair for Supervision",
    "description": "President Donald Trump yesterday nominated Federal Reserve Governor Michelle Bowman to be the next vice chair for supervision, the lead role in developing policy recommendations for supervising and regulating the banks in the Federal Reserve System. Critical …",
    "link": "https://www.commondreams.org/newswire/trump-nominates-bowman-bank-industry-favorite-to-be-next-vice-chair-for-supervision",
    "timestamp": "2025-03-18T20:54:00Z"
  },
  {
    "title": "Russian Bomb Reportedly Cuts Power in Ukrainian City Just Hours After Putin Promised Trump He’d Stop Attacking Energy Facilities",
    "description": "A Russian bomb reportedly cut power in a Ukrainian city just after President Vladimir Putin vowed to stop attacks on energy facilities.\nThe post Russian Bomb Reportedly Cuts Power in Ukrainian City Just Hours After Putin Promised Trump He’d Stop Attacking Ene…",
    "link": "https://www.mediaite.com/news/russian-bomb-reportedly-cuts-power-in-ukrainian-city-just-hours-after-putin-promised-trump-hed-stop-attacking-energy-facilities/",
    "timestamp": "2025-03-18T20:53:19Z"
  },
  {
    "title": "As Her Battle With Brain Cancer Comes to an End, the First Black Republican Woman Elected to Congress Shares Her Living Wish With the World",
    "description": "NATIONAL HARBOR, MD - MARCH 03: U.S. Rep. Mia Love (R-UT) speaks during the Conservative Political Action Conference (CPAC) March 3, 2016 in National Harbor, Maryland. The American Conservative Union hosted its annual Conservative Political Action Conference …",
    "link": "https://www.theroot.com/as-her-battle-with-brain-cancer-comes-to-an-end-the-fi-1851770847",
    "timestamp": "2025-03-18T20:52:00Z"
  },
  {
    "title": "Cardano’s ADA lands spot in US Digital Asset Stockpile — Will it generate value?",
    "description": "On March 2, President Donald Trump mentioned Cardano’s ADA (ADA) token among the cryptocurrencies to be included in the US strategic crypto reserve. Trump’s March 6 executive order clarified that altcoins would be part of the Digital Asset Stockpile (DAS) und…",
    "link": "https://cointelegraph.com/news/cardano-s-ada-lands-spot-in-us-digital-asset-stockpile-will-it-generate-value",
    "timestamp": "2025-03-18T20:51:15Z"
  },
  {
    "title": "‘Flagrant display of personal and political weakness’: Nicolle Wallace on Trump and Putin's call",
    "description": "Charlie Sykes, MSNBC Columnist and Contributor and John Brennan, Former CIA Director join Nicolle Wallace on Deadline White House to discuss Donald Trump’s phone call with Vladimir Putin where Donald Trump seems happy to give concession after concession displ…",
    "link": "https://biztoc.com/x/133051326546c093",
    "timestamp": "2025-03-18T20:51:02Z"
  },
  {
    "title": "Putin Says Trump Agrees to Hockey Games Between U.S. and Russia",
    "description": "President Trump agreed in principle to Russian leader Vladimir Putin's proposal of a series of hokey games between the U.S. and Russia.\nThe post Putin Says Trump Agrees to Hockey Games Between U.S. and Russia appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/03/18/report-putin-says-trump-agrees-hockey-games-between-us-russia/",
    "timestamp": "2025-03-18T20:50:42Z"
  },
  {
    "title": "Appellate court strikes down Ohio gender-affirming health care ban",
    "description": "Appellate court strikes down Ohio gender-affirming health care banthebuckeyeflame.com",
    "link": "https://thebuckeyeflame.com/2025/03/18/appellate-court-strikes-down-ohio-gender-affirming-health-care-ban/",
    "timestamp": "2025-03-18T20:50:37Z"
  },
  {
    "title": "Schumer says 'oligarchs' keep him up at night, despite his own ties to billionaires",
    "description": "Senate Minority Leader Chuck Schumer told the hosts of \"The View\" on Tuesday morning that \"oligarchs\" running the United States keep him up at night, despite his ties to the billionaire Soros family.",
    "link": "https://www.foxnews.com/politics/schumer-says-oligarchs-keep-him-up-night-despite-his-own-billionaire-ties",
    "timestamp": "2025-03-18T20:49:42Z"
  },
  {
    "title": "Danish Petition to Buy California, Rename Disneyland Nears 300k Signatures",
    "description": "A Danish petition to \"buy California\" from the U.S. is nearing 300,000 signatures. The tongue-in-cheek petition was created in response to President Donald Trump's repeated threats to purchase Greenland, a semiautonomous territory of Denmark. Newsweek has con…",
    "link": "https://freerepublic.com/focus/f-news/4305157/posts",
    "timestamp": "2025-03-18T20:49:37Z"
  },
  {
    "title": "GOP lawmakers praise Trump call with Putin after Biden 'refused to even pick up the phone'",
    "description": "President Donald Trump was hailed by GOP lawmakers after a phone call with Russian President Vladimir Putin, while Democrats remain unconvinced the country will enter into a peace deal.",
    "link": "https://www.foxnews.com/politics/gop-lawmakers-praise-trump-call-putin-after-biden-refused-even-pick-up-phone",
    "timestamp": "2025-03-18T20:48:43Z"
  },
  {
    "title": "Minnesota Republican Arrested in Underage Prostitution Sting",
    "description": "Both Republicans and Democrats are calling out their senatorial colleague for his alleged criminality.",
    "link": "https://www.newsweek.com/eichorn-minnesota-arrest-minor-prostitution-senate-republican-2046765",
    "timestamp": "2025-03-18T20:46:42Z"
  },
  {
    "title": "Would Support Proposal To Stop Energy Infrastructure Strikes: Zelensky",
    "description": "President Volodymyr Zelenskiy said Ukraine would support a US proposal to stop strikes on Russian energy infrastructure, and that he hoped to speak to U.S. President Donald Trump about his phone call on Tuesday with Russian President Vladimir Putin.",
    "link": "https://www.ndtv.com/world-news/ukraine-would-support-proposal-to-stop-energy-infrastructure-strikes-zelensky-7955338",
    "timestamp": "2025-03-18T20:45:52Z"
  },
  {
    "title": "Putin-Trump phone call: key takeaways",
    "description": "Russian President Vladimir Putin and US President Donald Trump held a phone call to address the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614453-putin-trump-talks-takeaways/",
    "timestamp": "2025-03-18T20:45:34Z"
  },
  {
    "title": "Countries Must Fill in Void Left by Shift in U.S. FCPA Enforcement, Says Leading Whistleblower Attorney",
    "description": "On February 10, President Donald Trump Trump issued an Executive Order halting enforcement of the Foreign Corrupt Practices Act (FCPA). In light of this shift in U.S. anti-corruption policy, leading whistleblower attorney Stephen M. Kohn is calling for a “Rev…",
    "link": "https://whistleblowersblog.org/foreign-corruption-whistleblowers/countries-must-fill-in-void-left-by-shift-in-u-s-fcpa-enforcement-says-leading-whistleblower-attorney/",
    "timestamp": "2025-03-18T20:45:32Z"
  },
  {
    "title": "Trump to attend NCAA men's wrestling championship (Jake Traylor/Politico)",
    "description": "Jake Traylor / Politico:\nTrump to attend NCAA men's wrestling championship  —  The trip comes weeks after the NCAA moved to ban transgender women from competing in women's sports in line with Trump's policy.  —  President Donald Trump plans to attend the NCAA…",
    "link": "https://www.memeorandum.com/250318/p120",
    "timestamp": "2025-03-18T20:45:02Z"
  },
  {
    "title": "Hungary passes bill against annual Budapest Pride march",
    "description": "<p>BUDAPEST - Hungarian lawmakers passed a bill on Tuesday aimed at banning Budapest's annual Pride march, the latest in a series of measures under Prime Minister Viktor Orban's government, which critics say curtail the rights of the EU country's LGBTQ commun…",
    "link": "https://www.bangkokpost.com/world/2982651/hungary-passes-bill-against-annual-budapest-pride-march",
    "timestamp": "2025-03-18T20:45:00Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/headlines-today-tuesday-news-fix-6653151-Mar2025/",
    "timestamp": "2025-03-18T20:44:32Z"
  },
  {
    "title": "DOGE Marks 3.2 Million Social Security Accounts 120 Years and Older as 'Deceased'",
    "description": "The Department of Government Efficiency (DOGE) has marked approximately 3.2 million Social Security number-holders for people aged 120 and older as \"deceased\" as part of ongoing efforts to root out fraud.\nThe post DOGE Marks 3.2 Million Social Security Accoun…",
    "link": "https://www.breitbart.com/economy/2025/03/18/doge-marks-3-2-million-social-security-accounts-120-years-and-older-as-deceased/",
    "timestamp": "2025-03-18T20:43:45Z"
  },
  {
    "title": "Could Syria be the next frontier for Palestinian refugees?",
    "description": "After Trump’s statements, Arab governments emphasized their rejection of transferring Gaza’s population.",
    "link": "https://www.jpost.com/middle-east/article-846629",
    "timestamp": "2025-03-18T20:43:10Z"
  },
  {
    "title": "Why Non-white Voters and Young Men Drifted to Trump",
    "description": "Data analyst David Shor explains how Trump attracted an unlikely coalition, with especially large gains among non-white voters and young men, but may now be unraveling it with his conduct in office.",
    "link": "http://nymag.com/intelligencer/article/why-nonwhite-voters-and-young-men-drifted-to-trump.html",
    "timestamp": "2025-03-18T20:42:28Z"
  },
  {
    "title": "DOGE’s USAID dismantling likely violates the Constitution, judge rules",
    "description": "The order requires the Trump administration to restore email and computer access to all employees of USAID, including those put on administrative leave, though it appears to stops short of reversing firings or fully resurrecting the agency.",
    "link": "https://www.pbs.org/newshour/politics/doges-usaid-dismantling-likely-violates-the-constitution-judge-rules",
    "timestamp": "2025-03-18T20:41:53Z"
  },
  {
    "title": "Zelenskyy open to halting strikes on energy but needs details from Trump",
    "description": "Volodymyr Zelenskyy says he would support a proposal to stop strikes on energy infrastructure, but needs more details.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/3/18/zelenskyy-open-to-halting-strikes-on-energy-but-needs-details-from-trump",
    "timestamp": "2025-03-18T20:41:53Z"
  },
  {
    "title": "‘DOGE has broken into our building’: Federal bureaucrats panic, call cops for ‘illegal takeover’",
    "description": "Deposed leader claims agency is 'a private non-profit'",
    "link": "https://www.wnd.com/2025/03/doge-has-broken-into-our-building-federal-bureaucrats-panic-call-cops/",
    "timestamp": "2025-03-18T20:41:52Z"
  },
  {
    "title": "As Trump cuts aid, EU leaders look to contain ISIS-linked camps",
    "description": "55,000 Islamic State-linked detainees  are being held in Al Hol and Roj camps in northeastern Syria.",
    "link": "https://www.politico.eu/article/donald-trump-foreign-aid-cuts-eu-isis-camps-al-hol-roj/",
    "timestamp": "2025-03-18T20:41:51Z"
  },
  {
    "title": "New PM Carney anticipating conflict-of-interest screen around Brookfield dealings",
    "description": "Prime Minister Mark Carney says he expects the government's ethics commissioner will recommend he set up a screen around his previous business dealings to avoid any potential conflicts of interest.",
    "link": "https://www.cbc.ca/news/politics/carney-brookfield-screen-1.7486801",
    "timestamp": "2025-03-18T20:41:10Z"
  },
  {
    "title": "Pentagon is cutting up to 60,000 civilian jobs, administration aims for at least 5 percent total reduction",
    "description": "The official said Tuesday that to reach the goal of a 5% to 8% cut in a civilian workforce of more than 900,000, the department aims to cut another 6,000 positions a month by simply not replacing workers who routinely leave.",
    "link": "https://www.pbs.org/newshour/politics/pentagon-is-cutting-up-to-60000-civilian-jobs-administration-aims-for-at-least-5-percent-total-reduction",
    "timestamp": "2025-03-18T20:40:37Z"
  },
  {
    "title": "Big Bank Lobbying Groups Celebrate Trump’s Pick for Fed Vice Chair",
    "description": "Last night, President Trump nominated Michelle Bowman as the Federal Reserve’s Vice Chair for Supervision, a key role that oversees the Fed’s regulatory efforts. Bowman’s appointment was yet another gift from the Trump administration to the banking industry, …",
    "link": "https://www.commondreams.org/newswire/big-bank-lobbying-groups-celebrate-trumps-pick-for-fed-vice-chair",
    "timestamp": "2025-03-18T20:40:25Z"
  },
  {
    "title": "Trump is attacking libraries and museums in every state. Here are 3 things you can do to help communities fight back",
    "description": "On Friday, President Donald Trump issued yet another executive order aimed at gutting our federal agencies in the name of fiscal efficiency, this time slashing much-needed funding for libraries and museums nationwide.\nHis target is the Institute of Museum and…",
    "link": "https://biztoc.com/x/b43ed5ee0adaada1",
    "timestamp": "2025-03-18T20:40:05Z"
  },
  {
    "title": "The Irish Times view on Ireland and big pharma: State faces risks from overreliance",
    "description": "Major players have tried to use the importance of the sector to jobs and tax here to get Irish support at EU level",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/03/18/the-irish-times-view-on-ireland-and-big-pharma-state-faces-risks-from-overreliance/",
    "timestamp": "2025-03-18T20:40:00Z"
  },
  {
    "title": "I Teach Jewish Studies. Trump’s Department of Education Just Made My Job So Much Harder.",
    "description": "Students were willing to be honest in class. Now they're worried.",
    "link": "https://slate.com/life/2025/03/antisemitism-definition-trump-university-columbia-department-education.html",
    "timestamp": "2025-03-18T20:38:46Z"
  },
  {
    "title": "FBI arrests alleged MS-13 leader with help of Mexican government",
    "description": "FBI arrests alleged MS-13 leader with help of Mexican governmentgo.com",
    "link": "https://abcnews.go.com/Politics/fbi-arrests-alleged-ms-13-leader-mexican-government/story?id=119924149",
    "timestamp": "2025-03-18T20:38:11Z"
  },
  {
    "title": "HHS Website Removes Advisory Declaring Gun Violence a Public Health Crisis",
    "description": "The HHS web page that once featured the former surgeon general’s advisory on gun violence now reads “Page Not Found.”…",
    "link": "https://truthout.org/articles/hhs-website-removes-advisory-declaring-gun-violence-a-public-health-crisis/",
    "timestamp": "2025-03-18T20:37:59Z"
  },
  {
    "title": "Letters: Courts must check Trump’s abuse of wartime powers for deportations",
    "description": "\"The slippery slope is turning into an avalanche of the abuse of power. Immigrants today, citizens tomorrow; a dictatorship next week.\" -- Bob Stephenson, Englewood",
    "link": "https://www.denverpost.com/2025/03/18/trump-deportations-abuse-wartime-powers/",
    "timestamp": "2025-03-18T20:37:39Z"
  },
  {
    "title": "UK, EU in Talks to Accelerate Arms for Ukraine Before Ceasefire",
    "description": "The UK and European Union are in talks to accelerate arms shipments to Ukraine ahead of a potential full ceasefire, Britain’s foreign secretary told Bloomberg shortly before Vladimir Putin agreed to a limited truce.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-eu-in-talks-to-accelerate-arms-for-ukraine-before-ceasefire",
    "timestamp": "2025-03-18T20:37:13Z"
  },
  {
    "title": "Elon Musk’s Just-Revealed Texts to His Friend Tell You a Lot About His Character",
    "description": "Oculus founder-turned-defense-contractor Palmer Luckey is opening up about his not-quite-friendship with Elon Musk — and about the dumb \"anti-woke\" stuff they like to talk about. In an appearance on the Wall Street Journal's \"What's News\" podcast, the AI weap…",
    "link": "https://futurism.com/elon-musks-texts-friends-character",
    "timestamp": "2025-03-18T20:36:37Z"
  },
  {
    "title": "CASEY RYAN: Yes, American Education Can Survive Just Fine Without Federal Department",
    "description": "Trump can continue to clean up our nation’s education system without a hitch once ED is eliminated.",
    "link": "https://dailycaller.com/2025/03/18/opinion-american-education-can-survive-just-fine-without-federal-department-casey-ryan/",
    "timestamp": "2025-03-18T20:36:09Z"
  },
  {
    "title": "Trump’s War on Universities Is More Dangerous Than You Think",
    "description": "What his attack on Columbia means for America’s entire democratic system.",
    "link": "http://foreignpolicy.com/2025/03/18/trump-columbia-universities-attack-education-global-leader/",
    "timestamp": "2025-03-18T20:35:20Z"
  },
  {
    "title": "Decoding Michelle Obama's Speech, Which Perfectly Predicted Trump's Destructive Actions",
    "description": "During former Vice President Kamala Harris’ presidential campaign, a number of big names and political officials came onto the stage to help her gather votes. However, when former First Lady Michelle Obama grabbed the mic, she also took that moment to serve a…",
    "link": "https://www.theroot.com/decoding-michelle-obamas-speech-which-perfectly-predic-1851770805",
    "timestamp": "2025-03-18T20:35:00Z"
  },
  {
    "title": "Elon Musk has been buying up X shares near his initial purchase price",
    "description": "Elon Musk invested US$150 million to acquire X shares last year at a valuation near what he paid for the company’s equity in 2022. Read on",
    "link": "https://financialpost.com/investing/elon-musk-buying-x-shares-near-initial-purchase-price",
    "timestamp": "2025-03-18T20:34:54Z"
  },
  {
    "title": "Dropkick Murphys ‘broke up’ with Elon Musk before Ken Casey’s anti-Trump remarks at Boston show",
    "description": "Dropkick Murphys’ leading man Ken Casey says the punk band “broke up” with Elon Musk long before rumors started to swirl that the group’s X account got suspended because the singer called out a concertgoer flaunting a MAGA hat.",
    "link": "https://www.bostonherald.com/2025/03/18/dropkick-murphys-broke-up-with-elon-musk-before-ken-caseys-anti-trump-remarks-at-boston-show/",
    "timestamp": "2025-03-18T20:33:51Z"
  },
  {
    "title": "Chief Justice Roberts rebukes Trump and GOP rhetoric about impeaching judges - CNN",
    "description": "Chief Justice Roberts rebukes Trump and GOP rhetoric about impeaching judgesCNN Republicans Move to Impeach Judge After John Roberts' Rebuke of TrumpNewsweek Live updates: John Roberts rebukes Trump; USAID dismantling 'likely' unconstitutionalThe Hill Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176765065",
    "timestamp": "2025-03-18T20:33:38Z"
  },
  {
    "title": "Live: Wall Street drops ahead of US Fed interest rates decision, ASX to follow suit",
    "description": "A fall on Wall Street is likely to send Australian stocks lower, as investors exercise caution ahead of a monetary policy decision from the Federal Reserve. Follow the latest updates in our live blog.",
    "link": "https://www.abc.net.au/news/2025-03-19/asx-markets-business-live-news-march-19-2025/105069228",
    "timestamp": "2025-03-18T20:33:37Z"
  },
  {
    "title": "Live: Wall Street plunges ahead of US Fed rates decision, ASX to follow suit",
    "description": "A fall on Wall Street is likely to send Australian stocks lower, as investors exercise caution ahead of a monetary policy decision from the Federal Reserve. Follow the latest updates in our live blog.",
    "link": "https://www.abc.net.au/news/2025-03-19/asx-markets-business-live-news-dec12-2023/105069228",
    "timestamp": "2025-03-18T20:33:37Z"
  },
  {
    "title": "Why Musk is dumping cash into Wisconsin's Supreme Court race",
    "description": "Ayman Mohyeldin highlights the upcoming Wisconsin Supreme Court election and explains how Musk's millions could help tip the race toward a Trump ally.",
    "link": "https://www.msnbc.com/top-stories/latest/musk-trump-wisconsin-supreme-court-election-rcna196736",
    "timestamp": "2025-03-18T20:33:23Z"
  },
  {
    "title": "Ford says energy surcharge remains on table but he won't 'antagonize' U.S. in talks",
    "description": "Ontario Premier Doug Ford is keeping the possibility of reintroducing a surcharge on electricity exported to the United States in his back pocket, but says for now he doesn't want to \"antagonize\" American officials.",
    "link": "https://www.cbc.ca/news/canada/toronto/doug-ford-ontario-energy-surcharge-still-on-table-us-tariffs-1.7486948",
    "timestamp": "2025-03-18T20:33:06Z"
  },
  {
    "title": "Canadian 'American Pie' Actress Was Held By ICE For 12 Days",
    "description": "Jasmine Mooney says she's still processing the \"inhumane\" conditions of the detention centers.",
    "link": "https://littlethings.com/entertainment/canadian-actress-known-for-american-pie-speaks-out-after-being-held-by-ice-for-12-days",
    "timestamp": "2025-03-18T20:32:30Z"
  },
  {
    "title": "Russia’s Putin agrees to 30-day halt in attacks on Ukraine energy targets",
    "description": "Announcement comes after Russian leader held a lengthy phone call with US President Donald Trump.",
    "link": "https://www.aljazeera.com/news/2025/3/18/russias-putin-agrees-to-30-day-halt-in-attacks-on-ukraine-energy-targets",
    "timestamp": "2025-03-18T20:32:25Z"
  },
  {
    "title": "Court Docs Reveal Just How Many Tren De Aragua Gangbangers Are On ICE’s Deportation List",
    "description": "Newly submitted court documents reveal just how many members of a ruthless Venezuelan gang are being held in ICE custody and detained elsewhere in the U.S.",
    "link": "https://dailycaller.com/2025/03/18/court-docs-reveal-tren-de-aragua-numbers/",
    "timestamp": "2025-03-18T20:31:43Z"
  },
  {
    "title": "Could the Bluest State in the Nation Get Voter ID?",
    "description": "California, one of the most solidly blue states in the nation, could be voting on adopting voter ID—an initiative that President Donald Trump called for... Read More\nThe post Could the Bluest State in the Nation Get Voter ID? appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/03/18/could-the-bluest-state-in-the-nation-get-voter-id/",
    "timestamp": "2025-03-18T20:31:35Z"
  },
  {
    "title": "Trump claims ‘contract for Peace’ in the works after 90-minute call with Putin",
    "description": "In a high-stakes phone call, US President Donald Trump and Russian President Vladimir Putin agreed to an immediate halt on strikes targeting Ukraine’s energy and infrastructure. While this is seen as the first step towards broader negotiations, Putin stopped …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-claims-contract-for-peace-in-the-works-after-90-minute-call-with-putin/articleshow/119177133.cms",
    "timestamp": "2025-03-18T20:30:20Z"
  },
  {
    "title": "Bill Gates warns he can’t make up funding difference after US government stripped global health payments: report - NewsBreak",
    "description": "Billionaire Bill Gates is reportedly appealing to the White House to keep funding global health programs – and warning that his own foundation is unable t",
    "link": "https://www.newsbreak.com/share/3861716894162-bill-gates-warns-he-can-t-make-up-funding-difference-after-us-government-stripped-global-health-payments-report?s=a2&share_destination_id=MjE0Mzc0NjMxLTE3NDI0MDcyNDQ3NzM%3D&pd=0EVUdLcy&hl=en_US&send_time=1742407244&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.11.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-control%2Cns_local_strategy_25q1_exp-control%2Cns_foryou_rank_exp_25q1-v1",
    "timestamp": "2025-03-18T20:29:19Z"
  },
  {
    "title": "Bill Gates warns he can’t make up funding difference after US government stripped global health payments: report - NewsBreak",
    "description": "Billionaire Bill Gates is reportedly appealing to the White House to keep funding global health programs – and warning that his own foundation is unable t",
    "link": "https://www.newsbreak.com/share/3861716894162-bill-gates-warns-he-can-t-make-up-funding-difference-after-us-government-stripped-global-health-payments-report?_f=app_share&pd=07TiCGBg&lang=en_US&send_time=1742410093&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.11.0.51%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v5&s=i2",
    "timestamp": "2025-03-18T20:29:19Z"
  },
  {
    "title": "Immigrants disappear from US detainee tracking system after deportation flights",
    "description": "Many families have no idea where to find their loved ones.",
    "link": "https://www.denverpost.com/2025/03/18/trump-deportations-searches/",
    "timestamp": "2025-03-18T20:29:17Z"
  },
  {
    "title": "Immigrants disappear from US detainee tracking system after deportation flights",
    "description": "Many families have no idea where to find their loved ones.",
    "link": "https://www.bostonherald.com/2025/03/18/trump-deportations-searches/",
    "timestamp": "2025-03-18T20:29:17Z"
  },
  {
    "title": "Russia, Ukraine accuse each other of attempting cross-border attack",
    "description": "(Reuters) - Russia and Ukraine accused each other of trying to launch cross-border attacks on Tuesday, each saying its forces had repelled attempted incursions. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/russia-ukraine-accuse-each-other-of-attempting-cross-border-attack",
    "timestamp": "2025-03-18T20:29:00Z"
  },
  {
    "title": "Some States Consider Bills That Would Punish People Seeking Abortions",
    "description": "Lawmakers in several states have introduced bills that would allow authorities to charge people who obtain abortions with homicide.",
    "link": "https://time.com/7269263/bills-punishing-people-seeking-abortions/",
    "timestamp": "2025-03-18T20:28:54Z"
  },
  {
    "title": "Why Donald Trump's Claims About Joe Biden's Signature Could Struggle",
    "description": "Joe Biden's preemptive pardons for Trump enemies are legal and binding, several attorneys have told Newsweek.\nPresident Donald Trump wrote on Monday that Biden's pardons for the January 6 committee are invalid because they were signed with an autopen.\nWhy It …",
    "link": "https://biztoc.com/x/58bb65184e2991cd",
    "timestamp": "2025-03-18T20:28:49Z"
  },
  {
    "title": "Canada PM Carney Announces Deal With Australia To Boost Arctic Radar",
    "description": "Prime Minister Mark Carney announced Tuesday a Can$6 billion (US$4.2 billion) deal with Australia to develop an Arctic radar system, warning that Canada must take more responsibility for its defence as US priorities shift.",
    "link": "https://www.ibtimes.com/canada-pm-carney-announces-deal-australia-boost-arctic-radar-3766748",
    "timestamp": "2025-03-18T20:27:07Z"
  },
  {
    "title": "'Taking over the Capitol again': Violent J6 rioter now seeks Marco Rubio's old Senate seat",
    "description": "A pardoned Jan. 6 defendant who was accused of violently attacking police at the Capitol is hoping to take over the Florida Senate seat vacated by Secretary of State Marco Rubio.Jake Lang never stood trial for his alleged role in the insurrection due to repea…",
    "link": "https://www.rawstory.com/jan-6-defendants-2671353588/",
    "timestamp": "2025-03-18T20:27:00Z"
  },
  {
    "title": "BARR: Government Over-Regulation Is Handing China The Energy Future",
    "description": "President Donald Trump’s planned executive order to bolster U.S. shipbuilding acknowledges a hard truth: China is winning the global economic battle, at least in the maritime sector.",
    "link": "https://dailycaller.com/2025/03/18/bob-barr-government-regulation-china-green-energy-future/",
    "timestamp": "2025-03-18T20:25:57Z"
  }
]