[
  {
    "title": "Japan official wants stronger yen, says Tokyo shouldn't sell Treasurys",
    "description": "Japan should not intentionally sell its U.S. Treasury holdings in retaliation against tariffs levied by President Donald Trump, official says.",
    "link": "https://www.cnbc.com/2025/04/13/japan-official-wants-stronger-yen-says-tokyo-shouldnt-sell-treasurys.html",
    "timestamp": "2025-04-13T07:07:57Z"
  },
  {
    "title": "Map Shows How Trump, Putin and Xi Could Carve Up the Globe",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump's outreach to Russian President Vladimir Putin to try to end the war with Ukraine comes amid jockeying among leaders for spheres of influence while China seeks to exert its clout. A…",
    "link": "https://biztoc.com/x/6120e6c164782180",
    "timestamp": "2025-04-13T07:06:59Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "The 83-year-old senator is drawing tens of thousands of people to his \"fighting oligarchy\" rallies around the country.",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/world/politics/bernie-sanders-apathy-left/",
    "timestamp": "2025-04-13T07:05:00Z"
  },
  {
    "title": "Saturday Night Live Has a Winner Spoof with The White Potus",
    "description": "Host Jon Hamm is an unhinged RFK Jr.; musical guest Lizzo is “Tariffied”",
    "link": "https://www.vanityfair.com/hollywood/story/saturday-night-live-jon-hamm-the-white-potus",
    "timestamp": "2025-04-13T07:03:12Z"
  },
  {
    "title": "Maureen Dowd: So much about Donald Trump just does not add up",
    "description": "With his miscalculations on trade tariffs, tax cuts and more, the future of the US is at stake",
    "link": "https://www.irishtimes.com/world/us/2025/04/13/maureen-dowd-so-much-about-donald-trump-just-does-not-add-up/",
    "timestamp": "2025-04-13T07:02:23Z"
  },
  {
    "title": "Bitcoin: Experts split on BTC’s long-term outlook- Here’s why",
    "description": "BTC struggles with volatility; optimistic on-chain metrics hint at potential breakout above $94,500.",
    "link": "https://ambcrypto.com/bitcoin-experts-split-on-btcs-long-term-outlook-heres-why/",
    "timestamp": "2025-04-13T07:00:20Z"
  },
  {
    "title": "Map Shows How Trump, Putin and Xi Could Carve Up the Globe",
    "description": "The consequences of a deal between Trump and Putin on Ukraine could resonate well beyond Europe's borders.",
    "link": "https://www.newsweek.com/trump-putin-map-china-xi-2058157",
    "timestamp": "2025-04-13T07:00:01Z"
  },
  {
    "title": "Michigan Gov. Gretchen Whitmer mocked for hiding face from cameras in Oval Office before Trump meeting",
    "description": "Michigan Gov. Gretchen Whitmer is being panned for hiding her face behind a stack of binders so as not to be seen standing in the Oval Office when President Donald Trump spoke to the press.",
    "link": "https://nypost.com/2025/04/13/us-news/michigan-gov-gretchen-whitmer-hid-face-behind-binders-during-trump-oval-office-press-conference/",
    "timestamp": "2025-04-13T06:49:38Z"
  },
  {
    "title": "The U.S. and Russia are negotiating in bad faith",
    "description": "For now, Trump says he is “pissed off” at Putin for not being more amenable to his administration’s ceasefire proposals and he is threatening to impose yet more sanctions.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/13/world/us-russia-baid-faith-negotiations/",
    "timestamp": "2025-04-13T06:43:00Z"
  },
  {
    "title": "Photo Shows Musk's \"Top Secret\" Notepad At Trump's Cabinet Meet, He Reacts",
    "description": "A photo of Elon Musk&#039;s notepad from a cabinet meeting with Donald Trump sparked buzz online after the words Top Secret were seen scribbled across the page.",
    "link": "https://www.ndtv.com/world-news/elon-musks-top-secret-notepad-at-donald-trumps-cabinet-meet-goes-viral-he-responds-with-emoji-8153210",
    "timestamp": "2025-04-13T06:35:54Z"
  },
  {
    "title": "Xi's Southeast Asia tour, Singapore monetary policy, TSMC earnings",
    "description": "Welcome to Your Week in Asia.\nChinese President Xi Jinping heads to Southeast Asia for a three-nation tour, just as the region begins to grapple with the fallout from sweeping trade tariffs introduced by U.S. leader Donald Trump.\nInvestors are looking out for…",
    "link": "https://biztoc.com/x/a27abe635676bd84",
    "timestamp": "2025-04-13T06:34:13Z"
  },
  {
    "title": "How The Trump Family Is Going All-In On Crypto Projects",
    "description": "Donald Trump is already the richest person to have ever become US president, and his non-crypto holdings include significant investments in real estate.",
    "link": "https://www.ndtv.com/world-news/how-the-trump-family-is-going-all-in-on-crypto-projects-8153196",
    "timestamp": "2025-04-13T06:34:08Z"
  },
  {
    "title": "Trump’s tariffs: What the exemption of smartphones and computers means for the market – New announcements tomorrow",
    "description": "The US president said that on Monday he will give \"very specific answers\" about this decision and the plans for semiconductors\nThe post Trump’s tariffs: What the exemption of smartphones and computers means for the market – New announcements tomorrow appeared…",
    "link": "https://en.protothema.gr/2025/04/13/trumps-tariffs-what-the-exemption-of-smartphones-and-computers-means-for-the-market-new-announcements-tomorrow/",
    "timestamp": "2025-04-13T06:32:45Z"
  },
  {
    "title": "From viral videos to AI giant: How ByteDance built a tech empire",
    "description": "ByteDance is also using the data as the linchpin of a growing business in artificial intelligence. The company has invested billions of dollars in the infrastructure needed to power AI systems, building vast data centers in China and Southeast Asia and buying…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/from-viral-videos-to-ai-giant-how-bytedance-built-a-tech-empire/articleshow/120249640.cms",
    "timestamp": "2025-04-13T06:31:52Z"
  },
  {
    "title": "US trade uncertainties to undermine biz confidence, adversely impact growth in Asian region: Moody's",
    "description": "US-China tariff tensions pose downside risks to Asian growth; India may benefit from investment shifts over time.",
    "link": "https://www.thehindubusinessline.com/economy/us-trade-uncertainties-to-undermine-biz-confidence-adversely-impact-growth-in-asian-region-moodys/article69445502.ece",
    "timestamp": "2025-04-13T06:29:06Z"
  },
  {
    "title": "Protect Indonesia's economy amid Trump policies: DEN member",
    "description": "Member of the National Economic Council (DEN), Chatib Basri, emphasized the importance of protecting the domestic economy to ensure Indonesia remains ...",
    "link": "https://en.antaranews.com/news/351537/protect-indonesias-economy-amid-trump-policies-den-member",
    "timestamp": "2025-04-13T06:21:34Z"
  },
  {
    "title": "'Boycott Starbucks' is trending on X. MAGA activists' big call after coffee chain stopped services across US",
    "description": "The giant coffee chain Starbucks is facing a massive boycott call by MAGA activists in the United States of America. This comes after Starbucks stopped their services across the nation for a few minutes to protest against the \"illegal deportation of immigrant…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/boycott-starbucks-is-trending-on-x-maga-activists-big-call-after-coffee-chain-stopped-work-across-us/articleshow/120249395.cms",
    "timestamp": "2025-04-13T06:21:00Z"
  },
  {
    "title": "Ecuador votes in close presidential race, with drug violence the top concern",
    "description": "QUITO (Reuters) - Ecuadoreans vote on Sunday in what is expected to be a close presidential race between incumbent Daniel Noboa, who says he needs more time to combat drug gangs and boost the economy, and leftist Luisa Gonzalez, whose election would mark a re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/13/ecuador-votes-in-close-presidential-race-with-drug-violence-the-top-concern",
    "timestamp": "2025-04-13T06:19:00Z"
  },
  {
    "title": "Bernie Sanders Makes Surprise Appearance At Coachella",
    "description": "Sounding off on President Donald Trump, Sanders told music fans, \"The future of what happens to America is dependent upon your generation.\"",
    "link": "https://www.huffpost.com/entry/bernie-sanders-coachella_n_67fb414fe4b0bb4e0b77bb5e",
    "timestamp": "2025-04-13T06:17:47Z"
  },
  {
    "title": "‘Those jobs aren’t coming back’: When Steve Jobs explained why Apple won't make iPhones in the US",
    "description": "Amidst Trump's tariffs on Chinese goods and pressure on Apple to manufacture in the U.S., a resurfaced video reveals Steve Jobs's 2011 stance that iPhone production wouldn't return to America. He cited China's unmatched manufacturing ecosystem, developed over…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/those-jobs-arent-coming-back-when-steve-jobs-explained-why-iphones-arent-made-in-the-us/articleshow/120248751.cms",
    "timestamp": "2025-04-13T06:11:30Z"
  },
  {
    "title": "Israeli military will expand offensive 'throughout most of Gaza'",
    "description": "Israel's minister in charge of military affairs, Israel Katz, has announced plans to expand the ongoing offensive across much of the Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250412-irna02.htm",
    "timestamp": "2025-04-13T06:09:44Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "Bernie Sanders is emerging as one of the most vocal opponents to U.S. President Donald Trump, with the 83-year-old senator drawing tens of thousands of people to his &quot;fighting oligarchy&quot; rallies around the country. Supporters packed the Gloria Molin…",
    "link": "https://japantoday.com/category/world/bernie-sanders-fights-apathy-on-american-left",
    "timestamp": "2025-04-13T06:07:54Z"
  },
  {
    "title": "Over 30 Diseases, Torture Claim: How Tahawwur Rana Tried To Stop Extradition",
    "description": "Tahawwur Rana landed in Delhi on Thursday and has been sent to the custody of the anti-terror National Investigation Agency (NIA) for 18 days.",
    "link": "https://www.ndtv.com/world-news/over-30-diseases-torture-claim-how-tahawwur-rana-tried-to-stop-extradition-8153062",
    "timestamp": "2025-04-13T06:07:38Z"
  },
  {
    "title": "Iraq hopes indirect Iran-US talks lead to regional stability",
    "description": "Iraq's foreign minister has voiced support for the indirect talks between Iran and the US in Oman, expressing Baghdad's hope for regional peace and stability.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-presstv03.htm",
    "timestamp": "2025-04-13T06:05:20Z"
  },
  {
    "title": "Araqchi: Iran seeks a fair and dignified agreement negotiated from a position of equality",
    "description": "Iran is seeking a fair and dignified agreement with the United States negotiated from a position of equality, Foreign Minister Abbas Araqchi says, ahead of planned indirect talks with U.S. representatives.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-irna09.htm",
    "timestamp": "2025-04-13T06:05:19Z"
  },
  {
    "title": "US National Security Advisor Mike Waltz unlikely to travel to India",
    "description": "U.S. National Security Advisor Mike Waltz is unlikely to visit India this month for the India-US Forum, despite earlier expectations. The reason for the postponement is unknown, but it follows a politically sensitive period for Waltz. The India-US Forum will …",
    "link": "https://economictimes.indiatimes.com/news/india/us-national-security-advisor-mike-waltz-unlikely-to-travel-to-india/articleshow/120249216.cms",
    "timestamp": "2025-04-13T06:05:08Z"
  },
  {
    "title": "Diplomatic stakes are high as Iran and the U.S. are set to start indirect negotiations in Muscat",
    "description": "An Iranian delegation headed by Foreign Minister Abbas Araqchi is in Oman's capital, Muscat, for indirect negotiations with the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-irna11.htm",
    "timestamp": "2025-04-13T06:05:04Z"
  },
  {
    "title": "Iran: Oman talks not expected to take long",
    "description": "Foreign Ministry spokesperson Esmaeil Baqaei says he doesn't believe the current round of talks with the United States in Oman would take long.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-irna07.htm",
    "timestamp": "2025-04-13T06:04:52Z"
  },
  {
    "title": "Iran and the U.S. agree to continue negotiations next week",
    "description": "Iran and the United States have agreed to hold another round of negotiations next week, following preliminary talks in the Omani capital, Muscat.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-irna06.htm",
    "timestamp": "2025-04-13T06:04:51Z"
  },
  {
    "title": "Iran says it prefers negotiations that are on target and free from fanfare",
    "description": "Administration spokesperson Fatemeh Mohajerani says Iran's preferred approach to negotiations with the United States is dialogue that is precise and free from fanfare.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250412-irna05.htm",
    "timestamp": "2025-04-13T06:04:49Z"
  },
  {
    "title": "US, Iran Agree To Meet Again Next Week Following 'Constructive' Talks In Oman",
    "description": "Iranian and US negotiators agreed to a second round of high-level talks over Tehran's nuclear programs next week after meeting on April 12 for more than two hours of what both sides described as a \"positive\" and \"constructive\" session.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-rferl01.htm",
    "timestamp": "2025-04-13T06:04:40Z"
  },
  {
    "title": "Shipments from Chinese ports slow as US tariffs bite",
    "description": "Major ports and foreign trade provinces in China are showing the first signs of disruption from the ongoing tariff war between the world's two largest economies.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250412-rfa01.htm",
    "timestamp": "2025-04-13T06:03:01Z"
  },
  {
    "title": "Volkanovski beats Lopes; reclaims UFC featherweight title in front of Trump",
    "description": "The Australian beat his Brazilian opponent by unanimous decision to reclaim his title on UFC 314 fight night in Miami.",
    "link": "https://www.aljazeera.com/sports/2025/4/13/volkanovski-beats-lopes-reclaims-ufc-featherweight-title-in-front-of-trump",
    "timestamp": "2025-04-13T06:02:36Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "Bernie Sanders, a vocal critic of Donald Trump, rallied tens of thousands in Los Angeles, denouncing the influence of billionaires and Trump's policies. Joined by Alexandria Ocasio-Cortez and musicians like Neil Young, Sanders urged resistance against what he…",
    "link": "https://timesofindia.indiatimes.com/world/us/bernie-sanders-fights-apathy-on-american-left/articleshow/120249072.cms",
    "timestamp": "2025-04-13T06:02:15Z"
  },
  {
    "title": "China's Xi vows to Indonesia's Prabowo to deepen partnership, Xinhua says",
    "description": "Chinese President Xi Jinping vowed to deepen his country's strategic partnership with Indonesia in a call with President Prabowo Subianto on Sunday, China's ...",
    "link": "https://www.yahoo.com/news/chinas-xi-vows-indonesias-prabowo-060203885.html",
    "timestamp": "2025-04-13T06:02:03Z"
  },
  {
    "title": "Apple was on brink of crisis before tariff concession from Trump",
    "description": "Donald Trump’s 125% tariffs on goods produced in China threatened to upend its supply chain as seriously as the COVID-19 snarls did five years ago.",
    "link": "https://biztoc.com/x/30ef905b1d108396",
    "timestamp": "2025-04-13T06:01:19Z"
  },
  {
    "title": "Taiwan, U.S. to hold more talks on tariffs after 1st meeting",
    "description": "Taiwan and the United States will hold additional talks on tariffs after representatives of both sides held their first meeting on Friday U.S. time, according to the Office of Trade Negotiations under Taiwan's Executive Yuan.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250412-cna02.htm",
    "timestamp": "2025-04-13T06:00:21Z"
  },
  {
    "title": "U.S. tariff uncertainty pushes Taiwan's businesses in Vietnam to pivot",
    "description": "Taiwanese businesses in Vietnam are exploring alternatives after the United States imposed a 46 percent import duty on Vietnamese goods, following President Donald Trump's announcement of \"reciprocal\" tariffs on America's trading partners.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250412-cna03.htm",
    "timestamp": "2025-04-13T06:00:19Z"
  },
  {
    "title": "Taiwan-U.S. tariff talks proceeding smoothly: President Lai",
    "description": "President Lai Ching-te (賴清德) said Saturday that Taiwan has officially begun negotiations with the United States on reciprocal tariffs, describing the process as \"smooth.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250412-cna01.htm",
    "timestamp": "2025-04-13T06:00:17Z"
  },
  {
    "title": "Trump proposes historic $1T defense budget amid global tensions and government spending scrutiny",
    "description": "President Donald Trump announced a historic $1 trillion defense budget – the largest in U.S. history – aimed at countering threats from China and Russia, dwarfing the current $895 billion allocation. While Defense Secretary Pete Hegseth touted the budget’s fo…",
    "link": "https://www.naturalnews.com/2025-04-13-trump-proposes-1t-defense-budget-amid-spending-scrutiny.html",
    "timestamp": "2025-04-13T06:00:00Z"
  },
  {
    "title": "DOJ and ATF kill Biden’s “Zero Tolerance” firearms dealer policy",
    "description": "The DOJ and ATF have rescinded Biden’s 2021 “Zero Tolerance” policy, which mandated license revocations for Federal Firearms Licensees (FFLs) over even minor or first-time violations, including paperwork errors. Under Biden, the ATF revoked 92 licenses in 202…",
    "link": "https://www.naturalnews.com/2025-04-13-doj-kill-biden-zero-tolerance-firearms-dealer-policy.html",
    "timestamp": "2025-04-13T06:00:00Z"
  },
  {
    "title": "U.S. vows to counter Chinese influence in Panama Canal",
    "description": "The U.S. aims to counter China’s growing presence near the Panama Canal through military and economic partnerships, with Defense Secretary Pete Hegseth vowing to “take back” control of the strategic waterway. While China does not operate the canal, its contro…",
    "link": "https://www.naturalnews.com/2025-04-13-us-vows-counter-chinese-influence-panama-canal.html",
    "timestamp": "2025-04-13T06:00:00Z"
  },
  {
    "title": "POLL: U.S. support for Israel drops to lowest level in decades amid Gaza War",
    "description": "For the first time in over two decades, 53 percent of Americans hold an unfavorable view of Israel, up from 42 percent in 2022, driven by the Gaza conflict and high Palestinian casualties. Republican support for Israel has declined (64 percent favorable, down…",
    "link": "https://www.naturalnews.com/2025-04-13-us-support-for-israel-drops-to-lowest.html",
    "timestamp": "2025-04-13T06:00:00Z"
  },
  {
    "title": "Maine sues USDA over withheld funds in transgender athlete dispute",
    "description": "Maine has filed a lawsuit against the U.S. Department of Agriculture (USDA) after the agency froze federal funds due to the state’s policy allowing transgender athletes in girls’ sports. USDA Secretary Brooke Rollins claims Maine’s policies discriminate again…",
    "link": "https://www.naturalnews.com/2025-04-13-maine-sues-usda-withheld-funds-transgender-dispute.html",
    "timestamp": "2025-04-13T06:00:00Z"
  },
  {
    "title": "Russia, Ukraine Pound Each Other With Drones, As US Envoy Meets With Putin",
    "description": "Russia and Ukraine pounded each other with drones, with Moscow complaining that Kyiv had targeted its energy facilities in violation of a tenuous cease-fire agreement that has yet to take hold.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250412-rferl02.htm",
    "timestamp": "2025-04-13T05:59:08Z"
  },
  {
    "title": "Ukraine Could Be Sabotaging Agreements by Violating Moratorium with Strikes on Energy Facilities",
    "description": "Kiev's strikes on energy facilities are carried out either because there was no order to halt them or because the order was not followed, Director of the Second Department of CIS Countries of the Russian Foreign Ministry Alexey Polishchuk told Sputnik in an i…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250412-sputnik01.htm",
    "timestamp": "2025-04-13T05:58:52Z"
  },
  {
    "title": "Scarlett Johansson Cameos as Ivanka Trump In 'The White Lotus' Spoof On 'Saturday Night Live' - Watch!",
    "description": "Scarlett Johansson made a surprise appearance during a pre-filmed sketch on this weekend’s Saturday Night Live! The 40-year-old actress, whose husband Colin Jost is a regular cast member on the series, played Ivanka Trump in “The White Potus,” a spoof of The …",
    "link": "https://www.justjared.com/2025/04/13/scarlett-johansson-cameos-as-ivanka-trump-in-the-white-lotus-spoof-on-saturday-night-live-watch/",
    "timestamp": "2025-04-13T05:58:14Z"
  },
  {
    "title": "Good news: Your smartphones and other gadgets are now exempt from US tariffs",
    "description": "The US has made a U-turn on tariffs for electronics, announcing that phones, PCs, and other electronics are exempt from reciprocal tariffs.",
    "link": "https://www.androidauthority.com/smartphones-electronics-exemption-us-tariffs-china-3544130/",
    "timestamp": "2025-04-13T05:57:09Z"
  },
  {
    "title": "SNL: Trump-Skewering \"The White Lotus\" Sketch Show/Season Highlight",
    "description": "While NBC's Saturday Night Live was off to a pretty solid start, a filmed sketch might have been the headline-grabber of the night. It took the current situation with Trump's White House and applied it to a hit HBO series that recently wrapped up its run last…",
    "link": "https://bleedingcool.com/tv/snl-trump-skewering-the-white-lotus-sketch-show-season-highlight/",
    "timestamp": "2025-04-13T05:54:07Z"
  },
  {
    "title": "They’re just a tax on Americans: China has a message for US citizens amid the ongoing trade war",
    "description": "Amid escalating trade tensions, China is directly addressing the American public, warning that increased tariffs imposed by President Trump will ultimately burden US consumers with higher prices. Beijing is challenging the narrative that tariffs solely impact…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/theyre-just-a-tax-on-americans-china-has-a-message-for-us-citizens-amid-the-ongoing-trade-war/articleshow/120248831.cms",
    "timestamp": "2025-04-13T05:53:10Z"
  },
  {
    "title": "Ahead of Easter, SNL's Trump says stocks 'did a Jesus' in falling, rising and falling again",
    "description": "\"Saturday Night Live\" did its best attempt to bring levity to the global economic turmoil sparked by President Donald Trump's uncertain and oft-changing tariffs.",
    "link": "https://biztoc.com/x/4f1b916651c8b33d",
    "timestamp": "2025-04-13T05:50:20Z"
  },
  {
    "title": "Bernie Sanders Fights Apathy On American Left",
    "description": "Bernie Sanders is emerging as one of the most vocal opponents to US President Donald Trump, with the 83-year-old senator drawing tens of thousands of people to his \"fighting oligarchy\" rallies around the country.",
    "link": "https://www.ibtimes.com/bernie-sanders-fights-apathy-american-left-3769869",
    "timestamp": "2025-04-13T05:45:15Z"
  },
  {
    "title": "Apple was on brink of crisis before tariff concession from Trump",
    "description": "<p>Apple Inc has managed to dodge its biggest crisis since the pandemic &mdash; for the moment, at least.</p>",
    "link": "https://www.bangkokpost.com/business/general/3002246/apple-was-on-brink-of-crisis-before-tariff-concession-from-trump",
    "timestamp": "2025-04-13T05:44:00Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "Bernie Sanders is emerging as one of the most vocal opponents to US President Donald Trump, with the 83-year-old senator drawing tens of thousands of people to his “fighting oligarchy” rallies around the country. Supporters packed the Gloria Molina Grand Park…",
    "link": "https://www.digitaljournal.com/world/bernie-sanders-fights-apathy-on-american-left/article",
    "timestamp": "2025-04-13T05:43:18Z"
  },
  {
    "title": "US exempts tech imports in tariff step back",
    "description": "The Trump administration has exempted a raft of consumer electronics from its punishing import tariffs — offering relief to U.S. tech firms and partially dialling down a trade war with China.",
    "link": "https://www.hurriyetdailynews.com/us-exempts-tech-imports-in-tariff-step-back-207991",
    "timestamp": "2025-04-13T05:39:00Z"
  },
  {
    "title": "'Does Trump have beef with RKJ JR's wife Cheryl Hines?': This video from UFC event in Florida is going viral",
    "description": "Donald Trump appeared to snub Robert F. Kennedy Jr.'s wife, Cheryl Hines, at UFC 314 in Florida and a video of the same has quickly gained traction on social media. At the event, Cheryl Hines, wife of Robert F. Kennedy Jr extended her hand to greet the Presid…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/does-trump-have-beef-with-rkj-jrs-wife-cheryl-hines-this-video-from-ufc-event-in-florida-is-going-viral/articleshow/120248969.cms",
    "timestamp": "2025-04-13T05:38:52Z"
  },
  {
    "title": "Ahead of Easter, SNL's Trump says stocks 'did a Jesus' in falling, rising and falling again",
    "description": "\"Saturday Night Live\" did its best attempt to bring levity to the global economic turmoil sparked by President Donald Trump's uncertain and oft-changing tariffs.",
    "link": "https://www.nbcnews.com/pop-culture/tv/ahead-easter-snl-trump-stocks-jesus-falling-rising-falling-rcna201026",
    "timestamp": "2025-04-13T05:38:21Z"
  },
  {
    "title": "Volkanovski claims featherweight belt at UFC 314 with unanimnous decision over Lopes",
    "description": "Alexander Volkanovski reclaimed the featherweight championship Sunday morning, defeating Diego Lopes by unanimous decision at UFC 314. Two judges scored the ...",
    "link": "https://sports.yahoo.com/article/volkanovski-claims-featherweight-belt-ufc-053333370.html",
    "timestamp": "2025-04-13T05:33:33Z"
  },
  {
    "title": "On Ukraine talks, Trump says there is a time 'to put up or shut up'",
    "description": "The U.S. president made the comments a day after he showed frustration with Russia and told it to \"get moving\" on reaching a deal.",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/world/politics/trump-ukraine-talks-russia/",
    "timestamp": "2025-04-13T05:29:00Z"
  },
  {
    "title": "US trade uncertainties to undermine business confidence, adversely impact growth in Asian region: Moody's",
    "description": "Moody's Ratings cautions that uncertainties in US trade policy, despite a tariff pause, will likely dampen business confidence and consumer sentiment across Asia, including India, impacting growth prospects. While India's large domestic market offers some buf…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-trade-uncertainties-to-undermine-business-confidence-adversely-impact-growth-in-asian-region-moodys/articleshow/120248892.cms",
    "timestamp": "2025-04-13T05:26:32Z"
  },
  {
    "title": "‘SNL’ Weekend Update Addresses RFK Jr.’s Crazy New Health Advice, Musk’s Tariff Plea",
    "description": "SNL's Weekend Update addresses RFK Jr.'s anti-fluoride crusade and Elon Musk's request that Trump back off his tariffs",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-weekend-update-addresses-rfk-jr-advice-elon-musk-trump-tariff-1235316293/",
    "timestamp": "2025-04-13T05:22:47Z"
  },
  {
    "title": "SNL Sends Donald Trump’s Family to The White Lotus, With Scarlett Johansson as Ivanka — Watch Video",
    "description": "Looks like Saturday Night Live isn’t ready to check out of The White Lotus just yet. Saturday’s SNL featured a pre-taped sketch that imagined Donald Trump and his family enjoying a Thai vacation on the hit HBO series — here, retitled “The White POTUS.” James …",
    "link": "https://tvline.com/recaps/snl-video-the-white-lotus-donald-trump-scarlett-johansson-1235431645/",
    "timestamp": "2025-04-13T05:22:20Z"
  },
  {
    "title": "As tariffs put trade between China and the US in peril, Chinese businesses ponder the future",
    "description": "Escalating tariffs between the U.S. and China are pushing businesses to the brink, threatening decades-long trade ties. A Chinese exporter, initially able to absorb some losses, now faces insurmountable barriers. Experts warn of potential economic decoupling …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-tariffs-put-trade-between-china-and-the-us-in-peril-chinese-businesses-ponder-the-future/articleshow/120248836.cms",
    "timestamp": "2025-04-13T05:21:12Z"
  },
  {
    "title": "US talks with Iran in Oman 'very positive and constructive': White House",
    "description": "The United States wants a nuclear agreement \"as soon as possible\", Iran said after rare talks on Saturday, as U.S. President Donald Trump threatens military action if they fail to reach a deal.FF",
    "link": "https://www.hurriyetdailynews.com/us-talks-with-iran-in-oman-very-positive-and-constructive-white-house-207989",
    "timestamp": "2025-04-13T05:20:33Z"
  },
  {
    "title": "SNL compares Trump to Jesus in Easter sketch mocking economy and faith: 'Donald Jesus Trump'",
    "description": "SNL's Easter sketch portrayed Trump as “Donald Jesus Trump,\" mocking his economic policies, faith, and inflation during a holiday-themed cold open.",
    "link": "https://www.foxnews.com/media/snl-compares-trump-jesus-easter-sketch-mocking-economy-faith",
    "timestamp": "2025-04-13T05:15:03Z"
  },
  {
    "title": "Billionaires facing buyer’s remorse over Trump?",
    "description": "A few macro fund managers ‘quietly wondered if the president might be insane’",
    "link": "https://www.irishtimes.com/your-money/2025/04/13/billionaires-facing-buyers-remorse-over-trump/",
    "timestamp": "2025-04-13T05:15:00Z"
  },
  {
    "title": "CGTN: China’s silver screen pivot: Why U.S. tariff policy is to blame",
    "description": "CGTN published an article on how China’s new film partnership with Spain contrasts with its cuts to U.S. film imports, exposing the self-defeating impact of America’s tariff war – jeopardizing Hollywood’s most lucrative foreign market and undermining the coun…",
    "link": "https://financialpost.com/globe-newswire/cgtn-chinas-silver-screen-pivot-why-u-s-tariff-policy-is-to-blame",
    "timestamp": "2025-04-13T05:14:51Z"
  },
  {
    "title": "CGTN: China’s silver screen pivot: Why U.S. tariff policy is to blame",
    "description": "CGTN published an article on how China's new film partnership with Spain contrasts with its cuts to U.S. film imports, exposing the self-defeating impact of America's tariff war – jeopardizing Hollywood's most lucrative foreign market and undermining the coun…",
    "link": "https://www.globenewswire.com/news-release/2025/04/13/3060535/0/en/CGTN-China-s-silver-screen-pivot-Why-U-S-tariff-policy-is-to-blame.html",
    "timestamp": "2025-04-13T05:12:00Z"
  },
  {
    "title": "Muthoot Finance, IGL among 10 midcap stocks that fell most this week, dropping up to 14%",
    "description": "Indian equity benchmarks ended a volatile week slightly lower, dragged by global trade tensions and policy uncertainty. The Nifty 50 and Sensex dipped 0.3% for the week, despite a late rebound after US President Donald Trump announced a 90-day pause on retali…",
    "link": "https://m.economictimes.com/markets/stocks/news/muthoot-finance-igl-among-10-midcap-stocks-that-fell-most-this-week-dropping-up-to-14/midcap-slump/slideshow/120248794.cms",
    "timestamp": "2025-04-13T05:08:31Z"
  },
  {
    "title": "Colin Jost Jokes Trump’s Affinity For Tariffs Is “Like Listening To Bubba Gump Talk About Shrimp”",
    "description": "Weekend Update was full of zingers about President Donald Trump’s rapid about-face in the wake of the stock market crash his global tariffs spurred. Co-anchor Colin Jost kicked off the Saturday Night Live segment by quipping that POTUS “tried to rescue the ec…",
    "link": "http://deadline.com/2025/04/weekend-update-trump-tariffs-colin-jost-michael-che-1236367358/",
    "timestamp": "2025-04-13T05:03:46Z"
  },
  {
    "title": "US-Iran Talks 'Going OK' - Trump Says After Witkoff-Araghchi Meeting",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said after a meeting between his special envoy Steve Witkoff and Iranian Foreign Minister Abbas Araghchi that the Iran talks were going \"OK,\" Reuters reported.",
    "link": "https://sputnikglobe.com/20250413/us-iran-talks-going-ok---trump-says-after-witkoff-araghchi-meeting-1121864536.html",
    "timestamp": "2025-04-13T05:03:29Z"
  },
  {
    "title": "US-China tariff war developments, earnings to drive markets in holiday-shortened week: Analysts",
    "description": "Global market trends, US-China tariff war, corporate earnings, and economic data to drive market movement this week.",
    "link": "https://www.thehindubusinessline.com/markets/us-china-tariff-war-developments-earnings-to-drive-markets-in-holiday-shortened-week-analysts/article69445412.ece",
    "timestamp": "2025-04-13T05:00:43Z"
  },
  {
    "title": "European Union faces balancing act on Big Tech taxes",
    "description": "Commission president has floated idea in response to Trump tariffs",
    "link": "https://www.irishtimes.com/business/2025/04/12/european-union-faces-balancing-act-on-big-tech-taxes/",
    "timestamp": "2025-04-13T05:00:00Z"
  },
  {
    "title": "How U2 drummer Larry Mullen jnr avoids conflict with neighbours: buy up all surrounding houses",
    "description": "Plus: Shane Lowry adds bulk, film producer Alan Moloney’s big plans; and the bald truth about hair-loss exploitation",
    "link": "https://www.irishtimes.com/ireland/2025/04/13/how-u2-drummer-larry-mullen-jnr-avoids-conflict-with-neighbours-buy-up-all-surrounding-houses/",
    "timestamp": "2025-04-13T05:00:00Z"
  },
  {
    "title": "Turkish Trump Erdogan didn’t reckon with the power of a younger generation",
    "description": "Worldview: Erdogan’s Turkey is sliding decisively into autocracy, with a pliant judiciary co-opted, democratic norms abandoned, and media muzzled. But the young are standing up",
    "link": "https://www.irishtimes.com/opinion/2025/04/12/turkish-trump-erdogan-didnt-reckon-with-the-power-of-a-younger-generation/",
    "timestamp": "2025-04-13T05:00:00Z"
  },
  {
    "title": "$400-million unemployment fraud under Biden-era? Elon Musk's DOGE drops another bombshell",
    "description": "Elon Musk's government agency DOGE is on a mission to expose the corruption and slash the costs of the federal government. DOGE's probe revealed nearly $382 million in fraudulent unemployment payouts since 2020. California, New York, and Massachusetts account…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-400-million-unemployment-fraud-under-biden-era-elon-musks-doge-drops-another-bombshell-california-new-york-and-massachusetts/articleshow/120248582.cms",
    "timestamp": "2025-04-13T04:59:14Z"
  },
  {
    "title": "‘SNL’ Spoofs ‘The White Lotus’ With Trump Panicking Over Tariffs, Featuring Scarlett Johansson: “The White POTUS”",
    "description": "Saturday Night Live is trying to steal HBO’s thunder. On an episode hosted by Jon Hamm, the NBC sketch show introduced “The White POTUS,” featuring James Austin Johnson’s caricature of President Donald Trump numbing the pain of his own existential crisis in t…",
    "link": "http://deadline.com/2025/04/snl-the-white-lotus-trump-scarlett-johansson-1236367362/",
    "timestamp": "2025-04-13T04:58:43Z"
  },
  {
    "title": "‘Saturday Night Live’ roasts Trump’s tariff chaos of biblical proportions | CNN",
    "description": "After an unholy week on Wall Street and in Washington, “Saturday Night Live” kicked off its new episode with help from the Bible.",
    "link": "https://www.cnn.com/2025/04/13/entertainment/snl-cold-open-trump-tariffs/index.html",
    "timestamp": "2025-04-13T04:57:30Z"
  },
  {
    "title": "Trump Issues Passover Message to Jewish Families: 'Have a Blessed Passover'",
    "description": "President Donald Trump issued a Passover message to Jewish families in the United States and to people in Israel, telling them to \"have a blessed\" Passover holiday.\nThe post Trump Issues Passover Message to Jewish Families: ‘Have a Blessed Passover’ appeared …",
    "link": "https://www.breitbart.com/politics/2025/04/12/trump-issues-passover-message-to-jewish-families-have-a-blessed-passover/",
    "timestamp": "2025-04-13T04:48:59Z"
  },
  {
    "title": "'I Think It's Going Fine' - Trump on Progress in Resolving Ukraine Conflict",
    "description": "WASHINGTON (Sputnik) - Commenting on the progress in resolving the conflict in Ukraine, US President Donald Trump said that, in his opinion, everything was \"going fine.\"",
    "link": "https://sputnikglobe.com/20250413/i-think-its-going-fine---trump-on-progress-in-resolving-ukraine-conflict-1121864210.html",
    "timestamp": "2025-04-13T04:48:50Z"
  },
  {
    "title": "New U.S. ambassador to Japan 'optimistic' about tariff negotiations",
    "description": "Tariffs on vehicles and auto parts are expected to be a key focus of the talks this week, Japanese officials have said.",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/japan/politics/george-glass-us-ambassador-tariffs/",
    "timestamp": "2025-04-13T04:46:00Z"
  },
  {
    "title": "Donald Trump attends UFC event in Miami",
    "description": "The Republican president is a longtime UFC fan and sports enthusiast who has frequently attended major fights.",
    "link": "https://www.wtae.com/article/donald-trump-ufc-miami/64466084",
    "timestamp": "2025-04-13T04:45:22Z"
  },
  {
    "title": "Apple’s $22 bn pivot to India: iPhone manufacturing surges as trade winds shift from China",
    "description": "While electronics, including smartphones, were exempted from those tariffs in a recent announcement, the broader levies on China — now totalling 145 per cent — remain intact. For Apple, this makes India a relatively safe harbour",
    "link": "https://www.firstpost.com/tech/apples-22-bn-pivot-to-india-iphone-manufacturing-surges-as-trade-winds-shift-from-china-13879499.html",
    "timestamp": "2025-04-13T04:42:58Z"
  },
  {
    "title": "Trump's tariffs against China major test for Xi Jinping's leadership: Nicholas Burns",
    "description": "Former US Ambassador Nicholas Burns highlights the challenges President Xi Jinping faces due to US tariffs amid China's economic slowdown, property bubble hangover, and declining FDI. Burns suggests Trump's tariffs would be more effective with allied support,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-tariffs-against-china-major-test-for-xi-jinpings-leadership-nicholas-burns/articleshow/120248514.cms",
    "timestamp": "2025-04-13T04:42:27Z"
  },
  {
    "title": "Trump has blustered himself into a corner",
    "description": "What happens when you are confronted by an enemy and you fire all the weapons in your arsenal at it but after using up all your ammunition, you still fail to stop it and it keeps coming at you? Your only option then is to run like hell in the opposite directi…",
    "link": "https://freethoughtblogs.com/singham/2025/04/13/trump-has-blustered-himself-into-a-corner/",
    "timestamp": "2025-04-13T04:41:58Z"
  },
  {
    "title": "Trump Enters UFC 314 with Grandkids, Elon Musk, Dana White, Byron Donalds – Greets Dave Portnoy, Joe Rogan, Shaq, Tulsi, Marco Rubio, Bobby Kennedy Jr… But NOT His Wife! (VIDEO)",
    "description": "President Donald Trump entered UFC 314 on Saturday night in Miami on Saturday night. President Trump walked out flanked by his two grandchildren at his side. He was followed by Dana White, Elon Musk, gubernatorial candidate Byron Donalds, and several more. Be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4310712/posts",
    "timestamp": "2025-04-13T04:39:56Z"
  },
  {
    "title": "Donald Trump's Entrance to Star-Studded UFC 314 Brings House Down",
    "description": "President Donald Trump received a standing ovation during a triumphant walkout at UFC 314 in Miami, Florida, Saturday night.\nThe post Donald Trump’s Entrance to Star-Studded UFC 314 Brings House Down appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/12/donald-trumps-entrance-to-star-studded-ufc-314-brings-house-down/",
    "timestamp": "2025-04-13T04:38:12Z"
  },
  {
    "title": "Donald Trump attends UFC event in Miami",
    "description": "The Republican president is a longtime UFC fan and sports enthusiast who has frequently attended major fights.",
    "link": "https://www.kcra.com/article/donald-trump-ufc-miami/64466084",
    "timestamp": "2025-04-13T04:34:49Z"
  },
  {
    "title": "\"Visiting America Is Not...\": Top US Diplomat Defends Trump's Visa Policy",
    "description": "Since coming to power in January, Donald Trump has deported some foreign students, has revoked multiple visas and has warned universities of federal funding cuts over pro-Palestinian protests.",
    "link": "https://www.ndtv.com/world-news/top-us-diplomat-marco-rubio-on-why-they-donald-trump-team-revokes-visas-visiting-america-is-not-an-entitlement-its-a-privilege-8152598",
    "timestamp": "2025-04-13T04:34:47Z"
  },
  {
    "title": "Sen. Bernie Sanders delivers ranting speech at Coachella festival as Trump thrills UFC crowd in Florida",
    "description": "While President Trump thrilled crowds in Miami -- Senator Bernie Sanders found a more left-leaning audience at Coachella Saturday where the socialist firebrand took the stage to rant about his pet causes.",
    "link": "https://nypost.com/2025/04/13/us-news/coachella-2025-bernie-sanders-delivers-ranting-speech-at-festival-as-trump-thrills-ufc-crowd-in-florida/",
    "timestamp": "2025-04-13T04:26:01Z"
  },
  {
    "title": "Video: Trump seen with Elon Musk and his son X in Miami for UFC event, netizens call them 'power trio'",
    "description": "Donald Trump arrived with his tech billionaire ally Elon Musk and his son X at the West Palm Beach for an UFC event. A video of the three arriving in Florida has gone viral on social media with many netizens praising it. Trump recently spent four days visitin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/video-trump-seen-with-elon-musk-and-his-son-x-in-miami-for-ufc-event-netizens-call-them-power-trio/articleshow/120248262.cms",
    "timestamp": "2025-04-13T04:24:54Z"
  },
  {
    "title": "‘Saturday Night Live’ Host Jon Hamm Plays A Disillusioned Financial News Host In Trump Tariffs Sketch",
    "description": "Saturday Night Live came out of the gate swinging at President Donald Trump after another tumultuous week for the U.S. economy, poking fun at the chaos with a segment featuring host Jon Hamm as a very disillusioned cable news personality trying to make sense …",
    "link": "http://deadline.com/2025/04/saturday-night-live-on-hamm-trump-tariffs-sketch-1236367339/",
    "timestamp": "2025-04-13T04:20:19Z"
  },
  {
    "title": "As tariffs put trade between China and the US in peril, Chinese businesses ponder the future",
    "description": "The 145% tariff from the U.S. and the retaliatory 125% tariff from China are putting businesses doing trade between the U.S. and China on edge",
    "link": "https://abcnews.go.com/Business/wireStory/tariffs-put-trade-china-us-peril-chinese-businesses-120757320",
    "timestamp": "2025-04-13T04:14:36Z"
  },
  {
    "title": "Trump says Ukraine-Russia talks 'going well'",
    "description": "United States President Donald Trump said to reporters on Air Force One that he believes progress is being made in resolving the Ukraine conflict.\"I think that everything is going well between Ukraine...",
    "link": "https://biztoc.com/x/6dcbd9655f04717e",
    "timestamp": "2025-04-13T04:11:24Z"
  },
  {
    "title": "Trump tariffs: Trump-China tariff war could end post-COVID travel surge ‘a bit faster’",
    "description": "Sharemarket plunges and a weaker dollar, sparked by Donald Trump’s trade war, may prompt more people to stay home rather than head overseas.",
    "link": "https://www.smh.com.au/business/companies/trump-china-tariff-war-could-end-post-covid-travel-surge-a-bit-faster-20250408-p5lq7o.html",
    "timestamp": "2025-04-13T04:09:26Z"
  },
  {
    "title": "Trump tariffs, Q4 earnings, FII action among 8 factors that could move D-Street this week",
    "description": "Indian markets, buoyed by a pause on Trump's tariffs, face a week packed with influences. Key factors include the US-China trade situation, Wall Street's performance, and Q4FY25 earnings from major companies like Wipro and HDFC Bank.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariffs-q4-earnings-fii-action-among-8-factors-that-could-move-d-street-this-week/articleshow/120247831.cms",
    "timestamp": "2025-04-13T04:06:59Z"
  }
]