[
  {
    "title": "From students to tech: How US-China ties are sliding despite tariff truce",
    "description": "Following tariffs pause with Beijing, Trump has cracked down on Chinese students and access to advanced computer chips.",
    "link": "https://www.aljazeera.com/news/2025/5/30/from-students-to-tech-how-us-china-ties-are-sliding-despite-tariff-truce",
    "timestamp": "2025-05-30T13:51:25Z"
  },
  {
    "title": "Is Vietnam courting Trump family with luxury golf course?",
    "description": "A luxury golf resort owned by Donald Trump's family broke ground in Vietnam. This happened as Vietnam faced trade pressure from the US. The Vietnamese government expedited approvals for the project. This raised concerns about potential regulatory violations. …",
    "link": "https://timesofindia.indiatimes.com/world/us/is-vietnam-courting-trump-family-with-luxury-golf-course/articleshow/121518802.cms",
    "timestamp": "2025-05-30T13:49:55Z"
  },
  {
    "title": "The Wall Street Journal Takes a Victory Lap Over ‘Destructive’ Trump and His ‘Illegal’ Tariffs",
    "description": "The Wall Street Journal took a victory lap over President Donald Trump and his \"destructive tariff obsessions\" in a new editorial.\nThe post The Wall Street Journal Takes a Victory Lap Over ‘Destructive’ Trump and His ‘Illegal’ Tariffs first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/the-wall-street-journal-takes-a-victory-lap-over-destructive-trump-and-his-illegal-tariffs/",
    "timestamp": "2025-05-30T13:49:41Z"
  },
  {
    "title": "Unfortunately for Trump, the ‘TACO’ label isn’t just true, it’s also gaining traction",
    "description": "The \"Trump Always Chickens Out\" framing has caught on with extraordinary speed. The \"TACO\" memes are likely to annoy the president to no end.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-taco-label-always-chickens-out-rcna209930",
    "timestamp": "2025-05-30T13:48:45Z"
  },
  {
    "title": "Bono Snaps Back Hard at Trump’s Call for an Investigation Into Him and Others Over Harris Support: ‘There Will Be Trouble’",
    "description": "U2 frontman Bono bit back at President Donald Trump's call for an investigation into him and others by predicting, \"There will be trouble.\"\nThe post Bono Snaps Back Hard at Trump’s Call for an Investigation Into Him and Others Over Harris Support: ‘There Will…",
    "link": "https://www.mediaite.com/media/entertainment/bono-snaps-back-hard-at-trumps-call-for-an-investigation-into-him-and-others-over-harris-support-there-will-be-trouble/",
    "timestamp": "2025-05-30T13:48:43Z"
  },
  {
    "title": "Trump Dreams of Minerals — in Ukraine and Greenland",
    "description": "The clean energy transition that the Biden administration touted as the focus of its industrial policy required large amounts of mineral inputs. Batteries for electric vehicles depend on lithium, solar panels contain gallium and molybdenum, and powerful magne…",
    "link": "https://www.fairobserver.com/politics/trump-dreams-of-minerals-in-ukraine-and-greenland/",
    "timestamp": "2025-05-30T13:48:07Z"
  },
  {
    "title": "Farmers Press Trump for Biofuels Boost to Counter Tariff Losses",
    "description": "After losing their biggest export market due to Donald Trump’s trade wars, US farmers are now counting on the president’s support for biofuels to prevent their next crop from piling up in storage. The administration is set to soon unveil …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/05/30/825702.htm",
    "timestamp": "2025-05-30T13:47:06Z"
  },
  {
    "title": "China broke trade pact, once again, says Trump",
    "description": "President Donald Trump on Friday accused China of violating a trade agreement he said was hastily arranged to save its collapsing economy. In a post on Truth Social, Trump claimed his sweeping tariffs had pushed China to the brink of economic disaster, shutti…",
    "link": "https://biztoc.com/x/56f80002792b70a2",
    "timestamp": "2025-05-30T13:45:54Z"
  },
  {
    "title": "Rivals Neck-and-neck Ahead Of Poland's 'Clash Of Civilisations' Vote",
    "description": "Warsaw's pro-EU mayor and a nationalist historian held their last day of campaigning on Friday for Poland's presidency, with opinion polls predicting a close race in Sunday's vote, which will determine the direction of the key central European EU and NATO mem…",
    "link": "https://www.ibtimes.com/rivals-neck-neck-ahead-polands-clash-civilisations-vote-3774945",
    "timestamp": "2025-05-30T13:45:14Z"
  },
  {
    "title": "Polish vote framed as ‘clash of civilisations’",
    "description": "WARSAW - Warsaw&rsquo;s pro-EU mayor and a nationalist historian held their last day of campaigning on Friday for Poland&rsquo;s presidency, with opinion polls predicting a close race in Sunday&rsquo;s vote, which will determine the direction of the key centr…",
    "link": "https://www.bangkokpost.com/world/3038391/polish-vote-framed-as-clash-of-civilisations",
    "timestamp": "2025-05-30T13:45:00Z"
  },
  {
    "title": "Bitkraft doubles down on Web3 games with added leaders",
    "description": "Bitkraft Ventures, an early-stage investment firm focused on games, has announced new leaders who will double down on Web3 gaming.",
    "link": "https://venturebeat.com/games/bitkraft-doubles-down-on-web3-games-with-added-leaders/",
    "timestamp": "2025-05-30T13:45:00Z"
  },
  {
    "title": "Trump signals fresh trade tensions with China",
    "description": "WASHINGTON - US President Donald Trump signalled renewed trade tensions with China on Friday, arguing that Beijing had &ldquo;violated&rdquo; a deal to de-escalate tariffs, at a time when both sides appeared deadlocked in negotiations.",
    "link": "https://www.bangkokpost.com/world/3038386/trump-signals-fresh-trade-tensions-with-china",
    "timestamp": "2025-05-30T13:45:00Z"
  },
  {
    "title": "A Victory for Separation of Powers",
    "description": "A court’s decision affirmed a fundamental American principle: The president is no king, and he does not have the power to impose taxes in the form of tariffs whenever he feels like it.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/trump-tariffs-separation-powers/682982/",
    "timestamp": "2025-05-30T13:41:57Z"
  },
  {
    "title": "OPEC+ Mulls Even Larger Oil-Output Hike as It Seeks Market Share",
    "description": "OPEC+ is considering accelerating its production increases by discussing a potential hike of more than 411,000 barrels a day for July as it seeks to recoup lost market share, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-mulls-even-larger-oil-output-hike-as-it-seeks-market-share",
    "timestamp": "2025-05-30T13:40:29Z"
  },
  {
    "title": "Since Floyd riots culled monuments 5 years ago, leaders in ex-Confederate capital lament ‘s—t didn’t change'",
    "description": "From Jefferson Davis at Valentine Museum to stalled bridge renaming, Virginia faces ongoing debates over history and progress",
    "link": "https://www.foxnews.com/politics/since-floyd-riots-culled-monuments-5-years-ago-leader-s-ex-confederate-capital-lament-s-t-didnt-change",
    "timestamp": "2025-05-30T13:40:06Z"
  },
  {
    "title": "Trump accuses China of violating preliminary trade deal (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump accuses China of violating preliminary trade deal … President Donald Trump on Friday said that China has “totally violated its” preliminary trade agreement with the United States, and suggested he would take action in response.  —  “S…",
    "link": "https://www.memeorandum.com/250530/p34",
    "timestamp": "2025-05-30T13:40:02Z"
  },
  {
    "title": "'Should be embarrassed': Trump admin slaps back as it's caught in major lie",
    "description": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.\n\nThe Trump administration knew that the vast majority of the 238 Venezuelan immigrants it sent to a maximum-sec…",
    "link": "https://www.rawstory.com/should-be-embarrassed-trump-admin-slaps-back-as-it-s-caught-in-major-lie/",
    "timestamp": "2025-05-30T13:38:16Z"
  },
  {
    "title": "Elite Western universities are a corrupt, parasitic empire",
    "description": "Instead of high-quality education, these institutions are fostering a global neo-feudal system reminiscent of the British Raj Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618349-elite-universities-corrupt-empire/",
    "timestamp": "2025-05-30T13:35:52Z"
  },
  {
    "title": "US opens lower amid Trump remarks on China, data",
    "description": "Major stock indexes in the United States traded in the red at the opening bell on Friday after President Donald Trump accused China of violating the deal with the US to pause tariffs, sparking concern...",
    "link": "https://biztoc.com/x/31e889c534f05027",
    "timestamp": "2025-05-30T13:35:09Z"
  },
  {
    "title": "Report: Elon Musk’s drug use ramped up during the 2024 presidential campaign",
    "description": "Elon Musk increased his drug taking during the 2024 presidential campaign in which he donated around $270 million to help elect Donald Trump.",
    "link": "https://biztoc.com/x/e1f24822e607f889",
    "timestamp": "2025-05-30T13:35:06Z"
  },
  {
    "title": "Trump biographer Michael Wolff has suggested that Stinky has turned his ire on Harvard because he, not Baron, didn't get into the school [Interesting]",
    "description": "Trump biographer Michael Wolff has suggested that Stinky has turned his ire on Harvard because he, not Baron, didn't get into the school",
    "link": "https://www.fark.com/comments/13689500/Trump-biographer-Michael-Wolff-has-suggested-that-Stinky-has-turned-his-ire-on-Harvard-because-he-not-Baron-didnt-get-into-school",
    "timestamp": "2025-05-30T13:35:04Z"
  },
  {
    "title": "More than 100 arrested during Tallahassee immigration sweep",
    "description": "State, federal law-enforcement officers handcuffed workers and loaded them into vans before taking them away from site near FSU",
    "link": "https://www.orlandosentinel.com/2025/05/30/more-than-100-arrested-at-construction-site-during-tallahassee-immigration-sweep/",
    "timestamp": "2025-05-30T13:35:04Z"
  },
  {
    "title": "Foreign tax provision in Trump budget bill spooks Wall Street",
    "description": "Legislation would erode the appeal of US financial assets, warn banks and investors",
    "link": "https://www.irishtimes.com/business/2025/05/30/foreign-tax-provision-in-trump-budget-bill-spooks-wall-street/",
    "timestamp": "2025-05-30T13:34:05Z"
  },
  {
    "title": "US stocks open lower as Trump says China violated tariff terms",
    "description": "Wall Street's main indexes opened lower on Friday as trade worries deepened after U.S. President Donald Trump accused China of violating a tariff agreement, while investors assessed the latest inflation data.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-as-trump-says-china-violated-tariff-terms/articleshow/121518702.cms",
    "timestamp": "2025-05-30T13:33:12Z"
  },
  {
    "title": "Will you get a refund for Trump tariffs after federal court's ruling? Check details",
    "description": "Donald Trump's tariffs faced legal challenges. A court initially ruled against his authority to impose them. Another court allowed tariffs to continue temporarily. This happened while the White House appeals. The ruling raised questions about refunds for impo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-will-you-get-a-refund-for-trump-tariffs-after-federal-courts-ruling-check-details/articleshow/121518551.cms",
    "timestamp": "2025-05-30T13:31:35Z"
  },
  {
    "title": "NYT Investigation Accuses Musk of Heavy Drug Use",
    "description": "As Elon Musk formally steps away from his duties in the Trump administration, the New York Times is out with a report sure to rile the world's richest person. The investigation by Kirsten Grind and Megan Twohey asserts that Musk was using drugs far more than …",
    "link": "https://www.newser.com/story/369502/nyt-report-accuses-musk-of-heavy-drug-use.html",
    "timestamp": "2025-05-30T13:30:58Z"
  },
  {
    "title": "‘I Am, For One, Exhausted’: Will Cain Has Had Just About Enough Of Jake Tapper’s Book Tour",
    "description": "Will Cain expressed exhaustion over CNN anchor Jake Tapper's \"Original Sin\" book tour following his Wednesday appearance on Stephen A. Smith's podcast.",
    "link": "https://dailycaller.com/2025/05/30/will-cain-enough-jake-tappers-book-tour/",
    "timestamp": "2025-05-30T13:30:40Z"
  },
  {
    "title": "Vacillation, Uncertainty, and Danger Signs",
    "description": "This week, President Donald Trump announced that he was considering a 50% tariff on goods from the European Union. Just days later, he reversed himself,... Read More\nThe post Vacillation, Uncertainty, and Danger Signs appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/30/vacillation-uncertainty-danger-signs/",
    "timestamp": "2025-05-30T13:30:00Z"
  },
  {
    "title": "Lessons from the past, geopolitical uncertainties can help Johor-Singapore Special Economic Zone take off",
    "description": "Interest in the Johor-Singapore Special Economic Zone has been high amid geopolitical uncertainties and businesses that have already set up shop in the area have seen early gains, but more improvements are needed for the business ecosystem to really take off …",
    "link": "https://www.channelnewsasia.com/today/big-read/johor-singapore-special-economic-zone-promise-challenges-5158506",
    "timestamp": "2025-05-30T13:30:00Z"
  },
  {
    "title": "Despite Anti-Trump Mandate, Canada’s New PM Pushes “Golden Dome” Missile System",
    "description": "Organizers protested the Canadian government’s planned investment into militarization at a weapons fair this week.",
    "link": "https://truthout.org/articles/despite-anti-trump-mandate-canadas-new-pm-pushes-golden-dome-missile-system/",
    "timestamp": "2025-05-30T13:29:46Z"
  },
  {
    "title": "Trump Rips His Own Dark Money Buddy in Bonkers Rant Over Tariff Losses",
    "description": "Donald Trump unleashed a furious screed lamenting his recent legal loss on tariffs, and pointed the finger at “sleazebag” conservative billionaire Leonard Leo, the ex-chairman of the Federalist Society.\r\nIn a post on Truth Social Thursday night, Trump railed …",
    "link": "https://newrepublic.com/post/195895/donald-trump-leonard-leo-rant-tariff-losses",
    "timestamp": "2025-05-30T13:29:31Z"
  },
  {
    "title": "Trump Accuses China of ‘Violating’ Its Trade Agreement With the U.S., Laments Being ‘Mr. Nice Guy’",
    "description": "“The bad news is that China, perhaps not surprisingly to some, has totally violated its agreement with us. So much for being Mr. Nice Guy.\"",
    "link": "https://time.com/7290011/trump-says-china-violating-trade-agreement-tariffs-row/",
    "timestamp": "2025-05-30T13:29:23Z"
  },
  {
    "title": "Report: Elon Musk's drug use ramped up during the 2024 presidential campaign | TechCrunch",
    "description": "Elon Musk increased his drug taking during the 2024 presidential campaign in which he donated around $270 million to help elect Donald Trump.",
    "link": "https://techcrunch.com/2025/05/30/report-elon-musks-drug-use-ramped-up-during-the-2024-presidential-campaign/",
    "timestamp": "2025-05-30T13:28:34Z"
  },
  {
    "title": "Elon Musk Has Been “Using Drugs Far More Intensely Than Previously Known”: Report",
    "description": "A new report from The New York Times details Musk's alleged use of ketamine and other drugs.\nElon Musk Has Been “Using Drugs Far More Intensely Than Previously Known”: Report\nScoop Harrison",
    "link": "https://consequence.net/2025/05/elon-musk-drug-use-ketamine/",
    "timestamp": "2025-05-30T13:27:44Z"
  },
  {
    "title": "Trump holding Pennsylvania rally to promote deal for Japan-based Nippon to ‘partner’ with US Steel",
    "description": "President Donald Trump is holding a rally in Pennsylvania on Friday to celebrate a details-to-come deal for Japan-based Nippon Steel to invest in U.S. Steel.",
    "link": "https://nypost.com/2025/05/30/business/trump-holding-pennsylvania-rally-to-promote-deal-for-japan-based-nippon-to-partner-with-us-steel/",
    "timestamp": "2025-05-30T13:27:36Z"
  },
  {
    "title": "Ukraine says it's ready to resume talks with Russia but needs clarity on Kremlin's terms",
    "description": "A Ukraine presidential adviser says Ukraine is ready to resume direct peace talks with Russia in Istanbul on Monday but insists that the Kremlin provide a promised memorandum setting out its position on ending the war",
    "link": "https://abcnews.go.com/International/wireStory/ukraine-ready-resume-talks-russia-clarity-kremlins-terms-122341369",
    "timestamp": "2025-05-30T13:26:58Z"
  },
  {
    "title": "Surprise! Elon Musk Isn’t Done Torturing Us After All",
    "description": "Elon Musk isn’t done with the federal government after all.\r\nDays after the tech billionaire confirmed on X that his time as a special government employee had come to a close, the vice president revealed that the administration isn’t ready to let Musk go.\r\n“I…",
    "link": "https://newrepublic.com/post/195892/donald-trump-elon-musk-not-leaving-yet",
    "timestamp": "2025-05-30T13:25:12Z"
  },
  {
    "title": "Trump accuses China of violating Geneva trade agreement",
    "description": "US President Donald Trump during a swearing-in ceremony for Jeanine Pirro, interim US attorney for the District of Columbia, not pictured, in the Oval Office of the White House in Washington, DC, US, on Wednesday, May 28, 2025.",
    "link": "https://biztoc.com/x/be7fadcf053411cf",
    "timestamp": "2025-05-30T13:23:50Z"
  },
  {
    "title": "New Trump Rant Instantly Sends Stock Futures Sharply Down",
    "description": "President Donald Trump sent stock futures into negative territory instantly with a Truth Social rant about trade relations with China.\nThe post New Trump Rant Instantly Sends Stock Futures Sharply Down first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/new-trump-rant-instantly-sends-stock-futures-sharply-down/",
    "timestamp": "2025-05-30T13:22:31Z"
  },
  {
    "title": "Tariff Legal Battle Plays Out",
    "description": "Plus: Javier Milei puts state-run TV to good use, Texas' THC antagonism, rent control lunacy, and more...",
    "link": "https://reason.com/2025/05/30/tariff-legal-battle-plays-out/",
    "timestamp": "2025-05-30T13:22:27Z"
  },
  {
    "title": "Trump Signals Fresh Trade Tensions With China",
    "description": "US President Donald Trump signaled renewed trade tensions with China on Friday, arguing that Beijing had \"violated\" a deal to de-escalate tariffs, at a time when both sides appeared deadlocked in negotiations.",
    "link": "https://www.ibtimes.com/trump-signals-fresh-trade-tensions-china-3774941",
    "timestamp": "2025-05-30T13:21:10Z"
  },
  {
    "title": "Pam Bondi Drops American Bar Association, Ends Special Treatment from DOJ",
    "description": "Attorney General Pam Bondi says the Trump administraion will lump the American Bar Association with other \"activist\" groups.",
    "link": "https://www.westernjournal.com/pam-bondi-drops-american-bar-association-ends-special-treatment-doj/",
    "timestamp": "2025-05-30T13:20:54Z"
  },
  {
    "title": "Democrats need to embrace males with affection, not political strategy, NYT columnist argues",
    "description": "David French, a columnist for the NYT, suggested Democrats should embrace young male voters with affection, critiquing their $20 million plan to win back the key voting bloc.",
    "link": "https://www.foxnews.com/media/democrats-need-embrace-males-affection-not-political-strategy-nyt-columnist-argues",
    "timestamp": "2025-05-30T13:19:41Z"
  },
  {
    "title": "CNN Analyst Alyssa Farah Griffin Says ‘TACO’ Taunt Is Actually a Win for Trump",
    "description": "CNN political analyst Alyssa Farah Griffin argued that he derisive Wall Street acronym TACO — “Trump Always Chickens Out” — is actually a \"win\" for Trump.\nThe post CNN Analyst Alyssa Farah Griffin Says ‘TACO’ Taunt Is Actually a Win for Trump first appeared o…",
    "link": "https://www.mediaite.com/media/tv/cnn-analyst-alyssa-farah-griffin-says-taco-taunt-is-actually-a-win-for-trump/",
    "timestamp": "2025-05-30T13:18:16Z"
  },
  {
    "title": "Elon Musk used so much ketamine he wrecked his bladder: insiders",
    "description": "The knives are coming out as Elon Musk exits the White House, with insiders spilling new details about his drug use and family drama.The tech mogul bought himself a perch inside the White House by donating at least $275 million of his own money to get Donald …",
    "link": "https://www.rawstory.com/elon-musk-use-bladder/",
    "timestamp": "2025-05-30T13:18:13Z"
  },
  {
    "title": "Bernard Kerik: About the Former Police Commmissioner Who Died",
    "description": "Kerik died at the age of 69. He is best known as the former New York City police commissioner during 9/11, and he served time in prison for tax fraud charges.",
    "link": "https://hollywoodlife.com/feature/who-is-bernard-kerik-5420681/",
    "timestamp": "2025-05-30T13:17:42Z"
  },
  {
    "title": "Trump signals fresh trade tensions with China",
    "description": "US President Donald Trump signaled renewed trade tensions with China on Friday, arguing that Beijing had “violated” a deal to de-escalate tariffs, at a time when both sides appeared deadlocked in negotiations. Trump’s post on his Truth Social platform came ho…",
    "link": "https://www.digitaljournal.com/world/trump-signals-fresh-trade-tensions-with-china/article",
    "timestamp": "2025-05-30T13:17:32Z"
  },
  {
    "title": "Ukraine keeps Russia guessing over participation in June 2 peace talks",
    "description": "KYIV/MOSCOW (Reuters) -Ukraine on Friday resisted pressure from Moscow and Washington to commit itself to attending peace talks with Russia on June 2, saying it first needed to see the proposals Russian negotiators plan to bring to the talks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/30/ukraine-keeps-russia-guessing-over-participation-in-june-2-peace-talks",
    "timestamp": "2025-05-30T13:13:00Z"
  },
  {
    "title": "Trump's 'Big, Beautiful Bill' Could Allow Him To Hit Back With Retaliatory Taxes On Countries Targeting US Tech Giants",
    "description": "The U.S. Congress is reviewing a provision in the ‘Big, Beautiful Bill’ that would grant President Donald Trump the authority to impose retaliatory taxes on countries targeting major U.S. tech companies with digital service taxes.\nWhat Happened: The provision…",
    "link": "https://biztoc.com/x/b45c3e97b88cf020",
    "timestamp": "2025-05-30T13:12:54Z"
  },
  {
    "title": "Government Worker Angry With Trump Tried To Leak Classified Material: FBI",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Defense Intelligence Agency (DIA) employee has been arrested under accusations of attempting to leak classified defense information to a foreign nation because he did not agree with actions taken by Presiden…",
    "link": "https://biztoc.com/x/d5adbbe69841580f",
    "timestamp": "2025-05-30T13:12:51Z"
  },
  {
    "title": "Soldier Pardoned by Trump Shares 'Plandemic' Conspiracy Image",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA soldier pardoned by President Donald Trump shared an image associated with COVID conspiracy theories on his social media when thanking the president for his pardon.\nFormer 1st Lieutenant Mark Bashaw was disc…",
    "link": "https://biztoc.com/x/356a799e58e0559e",
    "timestamp": "2025-05-30T13:12:50Z"
  },
  {
    "title": "MSNBC panel stunned to silence over report on deaths linked to Elon Musk's DOGE",
    "description": "During a panel discussion on Elon Musk's last days of assisting Donald Trump in dismantling the government in search of putative savings, one MSNBC contributor brought up a grim report on deaths that have been attributed to the work done by the billionaire's …",
    "link": "https://www.rawstory.com/doge-deaths-breaking-news-msnbc/",
    "timestamp": "2025-05-30T13:12:40Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Friday",
    "description": "My top 10 things to watch Friday, May 30 1. President Donald Trump said this morning China violated its preliminary trade deal with the U.S. Trump's social media post Friday came after Treasury Secretary Scott Bessent said U.S.-China trade talks \"are a bit st…",
    "link": "https://biztoc.com/x/3f7a0d8bfdcb49c5",
    "timestamp": "2025-05-30T13:12:39Z"
  },
  {
    "title": "Inflation rate slipped to 2.1% in April, lower than expected, Fed’s preferred gauge shows",
    "description": "Inflation barely budged in April as tariffs President Donald Trump implemented in the early part of the month had yet to show up in consumer prices, the Commerce Department reported Friday.\nThe personal consumption expenditures price index, the Federal Reserv…",
    "link": "https://biztoc.com/x/ce1060bf9116f1ee",
    "timestamp": "2025-05-30T13:12:39Z"
  },
  {
    "title": "Donald Trump Accuses China of Violating Deal After He Tried to Be Nice",
    "description": "President Donald Trump has accused China of violating its preliminary trade agreement with the United States agreed on May 12.",
    "link": "https://biztoc.com/x/aae8f7f2a138482f",
    "timestamp": "2025-05-30T13:12:36Z"
  },
  {
    "title": "Britain’s hard-right Reform UK to accept crypto donations",
    "description": "Britain's hard-right Reform UK has become the first political party in the country to accept donations through bitcoin and other cryptocurrencies.\nThe post Britain’s hard-right Reform UK to accept crypto donations appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/britains-hard-right-reform-uk-to-accept-crypto-donations/article",
    "timestamp": "2025-05-30T13:12:34Z"
  },
  {
    "title": "Britain's Hard-right Reform UK To Accept Crypto Donations",
    "description": "Britain's hard-right Reform UK has become the first political party in the country to accept donations through bitcoin and other cryptocurrencies, raising fresh concerns over transparency.",
    "link": "https://www.ibtimes.com/britains-hard-right-reform-uk-accept-crypto-donations-3774935",
    "timestamp": "2025-05-30T13:12:19Z"
  },
  {
    "title": "Alice Marie Johnson Addresses Julie Chrisley, Todd Chrisley's Pardons",
    "description": "The Chrisleys worked for their release.\nAfter Todd Chrisley and Julie Chrisley returned home from prison following unexpected presidential pardons from Donald Trump, the White House credits their...",
    "link": "https://www.eonline.com/news/1418137/why-julie-chrisley-todd-chrisley-were-pardoned",
    "timestamp": "2025-05-30T13:11:41Z"
  },
  {
    "title": "It's finally official: Reports say Barron Trump has a girlfriend he frequently hangs out with in college",
    "description": "Barron Trump, unlike his father, is reportedly enjoying a low-profile college life at NYU, focusing on his studies and personal relationships. Sources indicate he has a girlfriend and a close-knit social circle, shunning the spotlight and political involvemen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/its-finally-official-reports-say-barron-trump-has-a-girlfriend-he-frequently-hangs-out-with-in-college/articleshow/121518204.cms",
    "timestamp": "2025-05-30T13:10:16Z"
  },
  {
    "title": "Trump accuses China of violating Geneva trade agreement",
    "description": "President Donald Trump sent stock futures diving early Friday after he accused China of breaking the handshake pact the two countries made in Geneva earlier this month that had helped reset a trade standoff.",
    "link": "https://www.nbcnews.com/business/business-news/trump-accuses-china-violating-geneva-trade-agreement-rcna209920",
    "timestamp": "2025-05-30T13:10:15Z"
  },
  {
    "title": "Latest Trump nominee called Israel-Palestinian conflict a 'psyop', promoted antisemitic conspiracy theories (Danielle Cohen/Jewish Insider)",
    "description": "Danielle Cohen / Jewish Insider:\nLatest Trump nominee called Israel-Palestinian conflict a ‘psyop’, promoted antisemitic conspiracy theories  —  Paul Ingrassia was tapped to serve as the head of the Office of Special Counsel, which enforces ethics laws  —  Pr…",
    "link": "https://www.memeorandum.com/250530/p30",
    "timestamp": "2025-05-30T13:10:03Z"
  },
  {
    "title": "US inflation gauge cools with little sign of tariff impact, so far",
    "description": "A key U.S. inflation gauge slowed last month.",
    "link": "https://www.bostonherald.com/2025/05/30/us-inflation-gauge-cools/",
    "timestamp": "2025-05-30T13:08:45Z"
  },
  {
    "title": "Consumer prices rose slightly in April amid Trump’s tariffs",
    "description": "The figures show inflation is still declining from its post-pandemic spike, which reached the highest level in four decades in July 2022.",
    "link": "https://www.pbs.org/newshour/economy/consumer-prices-rose-slightly-in-april-amid-trumps-tariffs",
    "timestamp": "2025-05-30T13:08:28Z"
  },
  {
    "title": "Western Journal Founder Fired from Kennedy Center After CNN Prodded About His Christian Beliefs: 'I Refused to Recant'",
    "description": "CNN is taking credit for prompting the firing of The Western Journal founder and former owner Floyd Brown, who only a month ago had taken a senior position at the Kennedy Center for the Performing Arts. The piece by CNN’s Andrew Kaczynski describes Brown as a…",
    "link": "https://freerepublic.com/focus/f-news/4319944/posts",
    "timestamp": "2025-05-30T13:08:27Z"
  },
  {
    "title": "U.S. foreign tax bill sends jitters across Wall Street",
    "description": "While U.S. President Donald Trump’s tariffs play out in U.S. courts, another one of his proposed laws could weaponize the American tax system.",
    "link": "https://www.nbcnews.com/business/business-news/us-foreign-tax-bill-sends-jitters-wall-street-rcna209928",
    "timestamp": "2025-05-30T13:08:14Z"
  },
  {
    "title": "What Is Howard Lutnick Smoking?",
    "description": "Trump's gaslighting Commerce Secretary Howard Lutnick was at it again, this time blowing smoke up everyone's ass on how Trump's illegal tariffs are going to affect the US economy.\nLutnick made an appearance on this Thursday's The Ingraham Angle on Fox, and wa…",
    "link": "https://crooksandliars.com/2025/05/commerce-secretary-lies-10-trillion-worth",
    "timestamp": "2025-05-30T13:07:47Z"
  },
  {
    "title": "Soldier Pardoned by Trump Shares 'Plandemic' Conspiracy Image",
    "description": "A soldier received a Presidential pardon after being court-martialed for refusing to comply with military COVID-19 protocols  in 2022.",
    "link": "https://www.newsweek.com/soldier-pardoned-trump-shares-plandemic-conspiracy-image-2078887",
    "timestamp": "2025-05-30T13:07:47Z"
  },
  {
    "title": "Ukraine says it's ready to restart talks with Russia but needs clarity on Kremlin's terms",
    "description": "Ukraine is prepared to resume direct peace talks with Russia in Istanbul on Monday, pending the receipt of Moscow's proposed memorandum outlining its position on ending the conflict. Ukrainian officials insist on a constructive discussion and clarification of…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ukraine-says-its-ready-to-restart-talks-with-russia-but-needs-clarity-on-kremlins-terms/articleshow/121518214.cms",
    "timestamp": "2025-05-30T13:07:10Z"
  },
  {
    "title": "California town rallies behind Trump as it hosts track and field championship amid trans athlete controversy",
    "description": "Clovis, California, becomes a political battleground as President Donald Trump criticizes trans athletes in girls' sports, sparking a national debate during the state championship this weekend.",
    "link": "https://www.foxnews.com/sports/california-town-erupts-pro-trump-activism-hosts-track-championship-trans-athlete-controversy",
    "timestamp": "2025-05-30T13:07:03Z"
  },
  {
    "title": "Trump ignoring efforts to rescue US from 'river of madness' he created: analysis",
    "description": "President Donald Trump is ‘ignoring’ every effort being made to rescue the United States from the ‘river of madness’ he is creating, according to MSNBC Opinion Editor James Downie\r\n.“Over the four months that Trump has blundered ahead with sweeping tariffs, h…",
    "link": "https://www.rawstory.com/trump-2672234924/",
    "timestamp": "2025-05-30T13:06:56Z"
  },
  {
    "title": "President Trump lashes out at China for violating new trade agreement",
    "description": "Just hours after courts allowed the \"liberation day\" tariffs to continue pending appeal, President Donald Trump is claiming that China has violated a preliminary trade agreement with the US.Apple's stock has been hit hard by the Trump tariff battle with China…",
    "link": "https://appleinsider.com/articles/25/05/30/president-trump-lashes-out-at-china-for-violating-new-trade-agreement",
    "timestamp": "2025-05-30T13:06:39Z"
  },
  {
    "title": "Trump Accuses China of Violating Preliminary Trade Deal",
    "description": "President Donald Trump on Friday said that China has “totally violated its” preliminary trade agreement with the United States, and suggested he would take action in response, CNBC reports. Said Trump, on Truth Social: “So",
    "link": "https://politicalwire.com/2025/05/30/trump-accuses-china-of-violating-preliminary-trade-deal/",
    "timestamp": "2025-05-30T13:04:59Z"
  },
  {
    "title": "\"We're all in\" - Nvidia CEO Jensen Huang praises \"utterly visionary\" Trump tariffs",
    "description": "Jensen Huang praises Trump tariffs, says Nvidia is busy moving production to the US.",
    "link": "https://www.techradar.com/pro/were-all-in-nvidia-ceo-jensen-huang-praises-utterly-visionary-trump-tariffs",
    "timestamp": "2025-05-30T13:04:00Z"
  },
  {
    "title": "Investors were looking for relief from tariffs. Instead, they got more uncertainty.",
    "description": "A federal court halting the tariff strategy that has tortured the market this year isn't a silver bullet for investors.",
    "link": "https://www.businessinsider.com/investors-whipsaw-tariff-chaos-court-ruling-appeal-uncertainty-stocks-2025-5",
    "timestamp": "2025-05-30T13:03:30Z"
  },
  {
    "title": "Government Worker Angry With Trump Tried To Leak Classified Material: FBI",
    "description": "The IT employee who had a top-secret security clearance at the Defense Intelligence Agency was arrested Thursday.",
    "link": "https://www.newsweek.com/government-worker-angry-trump-tried-leak-classified-material-fbi-2078847",
    "timestamp": "2025-05-30T13:03:23Z"
  },
  {
    "title": "Olivia Culpo shows off her pregnancy bikini body but not everyone loves how she did it",
    "description": "Olivia Culpo is once again at the center of controversy. The model and former Miss Universe announced her pregnancy on March 10, 2025, via her official Instagram account with a pos",
    "link": "https://www.marca.com/en/nfl/san-francisco-49ers/2025/05/30/6839251ee2704e454c8b45d4.html",
    "timestamp": "2025-05-30T13:02:50Z"
  },
  {
    "title": "US inflation gauge cools with little sign of tariff impact, so far",
    "description": "A key U.S. inflation gauge slowed last month as President Donald Trump’s tariffs have yet to noticeably push up prices, while American incomes jumped",
    "link": "https://abcnews.go.com/US/wireStory/us-inflation-gauge-cools-sign-tariff-impact-122341942",
    "timestamp": "2025-05-30T13:02:19Z"
  },
  {
    "title": "Trump Accuses China Of Violating U.S. Trade Agreement",
    "description": "Trump did not specify how China violated a deal negotiated with the U.S. earlier this month.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/30/trump-accuses-china-of-violating-us-trade-agreement/",
    "timestamp": "2025-05-30T13:02:08Z"
  },
  {
    "title": "Trump says China has ‘totally violated’ its tariff agreement with the U.S",
    "description": "U.S. President Donald Trump on Friday said China had violated an agreement on tariffs with the United States.\n“China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US. So much for being Mr. NICE GUY!,” Trump said in a post on his T…",
    "link": "https://biztoc.com/x/4a03635e0dd96c53",
    "timestamp": "2025-05-30T13:01:34Z"
  },
  {
    "title": "Donald Trump Accuses China of Violating Deal After He Tried to Be Nice",
    "description": "President Donald Trump has accused China of violating its preliminary trade agreement with the United States agreed on May 12.",
    "link": "https://www.newsweek.com/donald-trump-accuses-china-violating-trade-agreement-deal-tariffs-2078959",
    "timestamp": "2025-05-30T13:01:19Z"
  },
  {
    "title": "SCOOP: Top congressional committees launch probe into Nashville mayor accused of blocking ICE",
    "description": "The House Judiciary Committee and House Homeland Security Committee are launching a probe into Nashville Mayor Freddie O'Connell.",
    "link": "https://www.foxnews.com/politics/scoop-top-congressional-committees-launch-probe-nashville-mayor-accused-blocking-ice",
    "timestamp": "2025-05-30T13:00:02Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez: ‘The People Will Show Me the Way’",
    "description": "Rep. Alexandria Ocasio-Cortez on the Fighting Oligarchy rallies with Bernie Sanders, crypto billionaires, cuts to Medicaid, and taking on Trump",
    "link": "http://www.rollingstone.com/politics/politics-features/alexandria-ocasio-cortez-fighting-oligarchy-interview-1235349605/",
    "timestamp": "2025-05-30T13:00:00Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez: ‘The People Will Show Me the Way’",
    "description": "The New York Congresswoman talks about her Fight Oligarchy tour, artificial intelligence, cuts to Medicaid, and taking on Trump",
    "link": "http://www.rollingstone.com/politics/politics-features/alexandria-ocasio-cortez-fight-oligarchy-interview-1235349605/",
    "timestamp": "2025-05-30T13:00:00Z"
  },
  {
    "title": "Trump Regime Inflicts Chaos on Prestigious Science Agencies",
    "description": "Jocelyn Kaiser wrote in Science magazine about the chaos inflicted on the National Institutes of Health by Trump appointees and Elon Musk’s DOGS (not a misspelling) wrecking crew. Large numbers of scientists were fired, some were rehired, then fired again. Wh…",
    "link": "https://dianeravitch.net/2025/05/30/chaos-imposed-on-prestigious-science-agencies-from-the-start-of-the-trump-era/",
    "timestamp": "2025-05-30T13:00:00Z"
  },
  {
    "title": "2 Good Things in One ‘Big, Beautiful Bill’",
    "description": "The House of Representatives completed an overnight session on May 22 with a vote on the One Big Beautiful Bill Act. It passed by one... Read More\nThe post 2 Good Things in One ‘Big, Beautiful Bill’ appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/30/two-good-things-one-big-beautiful-bill/",
    "timestamp": "2025-05-30T13:00:00Z"
  },
  {
    "title": "Did DOGE, RFK Jr. find 8M fraudulently enrolled in Medicaid? Not exactly",
    "description": "It's more accurate to say that about 8 million people may lose Medicaid coverage if the \"One Big Beautiful Bill Act\" becomes law.",
    "link": "https://www.snopes.com//news/2025/05/30/medicaid-rfk-jr-doge/",
    "timestamp": "2025-05-30T13:00:00Z"
  },
  {
    "title": "Trump Needs to Get Real on Trade",
    "description": "A federal court ruling that the President's tariffs are illegal only underscores that he doesn't have a plan, writes Ryan Hass.",
    "link": "https://time.com/7289950/trump-needs-real-us-china-trade-strategy/",
    "timestamp": "2025-05-30T12:59:03Z"
  },
  {
    "title": "US Crypto Market Structure Bill Is Finally Here: Will It Start an Altcoin Rally?",
    "description": "The House of Representatives has introduced the Digital Asset Market Clarity Act, which looks to adopt a structured legislative approach towards the crypto market. Well, this is exactly what the crypto community was hoping for ever since the appointment of th…",
    "link": "http://www.newsbtc.com/news/us-crypto-market-structure-bill-is-finally-here-will-it-start-an-altcoin-rally/",
    "timestamp": "2025-05-30T12:56:41Z"
  },
  {
    "title": "UPSC Quiz – 2025 : IASbaba’s Daily Current Affairs Quiz 29th May 2025",
    "description": "For Previous Daily Quiz (ARCHIVES) – CLICK HERE The Current Affairs questions are based on sources like ‘The Hindu’, ‘Indian Express’ and ‘PIB’, which are very important sources for UPSC Prelims Exam. The questions are focused on both the concepts and facts. …",
    "link": "https://iasbaba.com/2025/05/upsc-quiz-2025-iasbabas-daily-current-affairs-quiz-29th-may-2025/",
    "timestamp": "2025-05-30T12:55:57Z"
  },
  {
    "title": "Think your return to the office was rough? Musk faces some big challenges",
    "description": "Musk returns to his numerous businesses, each with their own set of issues for the billionaire to address.",
    "link": "https://www.bostonherald.com/2025/05/30/musk-business-return-big-challenges/",
    "timestamp": "2025-05-30T12:54:18Z"
  },
  {
    "title": "US inflation gauge cools with little sign of tariff impact, so far",
    "description": "A key U.S. inflation gauge slowed last month as President Donald Trump’s tariffs have yet to noticeably push up prices, while American incomes jumped",
    "link": "https://abcnews.go.com/Business/wireStory/us-inflation-gauge-cools-sign-tariff-impact-122341943",
    "timestamp": "2025-05-30T12:53:36Z"
  },
  {
    "title": "As more fake citations emerge in the ‘MAHA’ report, White House struggles with a defense",
    "description": "The White House was pressed for an explanation for the fake citations in the administration's \"MAHA\" report. It pointed to “some formatting issues.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/fake-citations-emerge-maha-report-white-house-struggles-defense-rcna209915",
    "timestamp": "2025-05-30T12:52:02Z"
  },
  {
    "title": "Trump's Abuse of Pardons Undermines Entire Justice System: Reagan Official Bruce Fein",
    "description": "President Donald Trump has signed a wave of pardons for people convicted of fraud, including a Virginia sheriff who took tens of thousands of dollars in bribes and a reality TV couple who evaded millions in taxes after defrauding banks. Last month, Trump pard…",
    "link": "https://www.democracynow.org/2025/5/30/trump_pardons",
    "timestamp": "2025-05-30T12:51:57Z"
  },
  {
    "title": "Trump Tells Powell He's 'Making A Mistake' By Not Cutting Rates, Fed Reaffirms Independence",
    "description": "President Donald Trump summoned Federal Reserve Chair Jerome Powell to the White House on Thursday for their first face-to-face meeting since taking office in January. \nTrump informed the central bank chief that he was making a “mistake” by not lowering inter…",
    "link": "https://biztoc.com/x/69a016b73aafac6c",
    "timestamp": "2025-05-30T12:50:49Z"
  }
]