[
  {
    "title": "Older Americans watching their retirement investments fluctuate under Trump: 'I hope he knows what he's doing.'",
    "description": "Business Insider spoke to nearly a dozen older Americans about how they view their retirement amid a wave of market and economic uncertainty.",
    "link": "https://www.businessinsider.com/retirement-stock-market-trump-social-security-investing-401k-economic-policy-2025-3",
    "timestamp": "2025-03-15T08:06:02Z"
  },
  {
    "title": "What a Recession Could Mean for Your 401(k) Retirement Fund",
    "description": "President Donald Trump promised on the campaign trail that he would usher America into a fresh era of economic prosperity.\nBut jitters were felt on Wall Street last week when Trump decided to move forward with 25 percent tariffs on nearly goods imported from …",
    "link": "https://biztoc.com/x/cfe450c025bf77e0",
    "timestamp": "2025-03-15T08:05:22Z"
  },
  {
    "title": "Climate action is becoming less of a priority around the world. Trump isn't helping",
    "description": "The emphasis on climate action and transitioning to cleaner energy has waned in recent years as more emphasis is being placed on energy security and affordability. And that was before Donald Trump returned to the White House.",
    "link": "https://biztoc.com/x/ec1811b7f3a620c6",
    "timestamp": "2025-03-15T08:05:12Z"
  },
  {
    "title": "South African ambassador 'no longer welcome' in US, Rubio says",
    "description": "The US Secretary of State called the ambassador a \"race-baiting politician who hates America\".",
    "link": "https://www.bbc.co.uk/news/articles/crmj8ky3rvno",
    "timestamp": "2025-03-15T08:05:03Z"
  },
  {
    "title": "Le Figaro Speaks with Nate, JD Vance’s First Cousin and a Volunteer Fighter in Ukraine",
    "description": "\"When Nate heard his cousin, U.S. Vice President JD Vance, attack Ukrainian President Volodymyr Zelensky in the White House’s Oval Office, he flew into a rage. In his camper van, lost on the roads of the American West that he has been crisscrossing since he c…",
    "link": "https://freerepublic.com/focus/f-news/4304421/posts",
    "timestamp": "2025-03-15T08:03:19Z"
  },
  {
    "title": "Climate action was already losing momentum. Then Trump returned to office",
    "description": "The emphasis on climate action and transitioning to cleaner energy has waned in recent years as more emphasis is being placed on energy security and affordability. And that was before Donald Trump returned to the White House.",
    "link": "https://www.cbc.ca/news/canada/calgary/bakx-ceraweek-trump-climate-2025-1.7482917",
    "timestamp": "2025-03-15T08:01:00Z"
  },
  {
    "title": "'Cobra Kai's Martin Kove Confident Pal Sly Stallone Can Fix Stagnant Hollywood",
    "description": "Martin Kove is thrilled his old pal Sly Stallone has become a Hollywood ambassador via President Donald Trump ... 'cause he thinks the town has lost its magic by becoming too political -- and who better than \"Rambo\" to straighten things out? TMZ…\n Permalink",
    "link": "https://www.tmz.com/2025/03/15/cobra-kai-martin-kove-sylvester-stallone-fix-hollywood-trump/",
    "timestamp": "2025-03-15T08:00:40Z"
  },
  {
    "title": "Today in History: March 15, Julius Caesar assassinated on ‘ides of March’",
    "description": "On the “ides of March,” Roman dictator Julius Caesar was assassinated by Roman senators, including Brutus and Cassius, who feared Caesar was working to establish a monarchy.",
    "link": "https://www.bostonherald.com/2025/03/15/today-in-history-march-15-julius-caesar-assassinated-on-ides-of-march/",
    "timestamp": "2025-03-15T08:00:23Z"
  },
  {
    "title": "Today in History: March 15, Julius Caesar assassinated on ‘ides of March’",
    "description": "On the “ides of March,” Roman dictator Julius Caesar was assassinated by Roman senators, including Brutus and Cassius, who feared Caesar was working to establish a monarchy.",
    "link": "https://www.denverpost.com/2025/03/15/today-in-history-march-15-julius-caesar-assassinated-on-ides-of-march/",
    "timestamp": "2025-03-15T08:00:23Z"
  },
  {
    "title": "How to Survive a Trump Recession: The Ultimate Guide",
    "description": "\"Avoid taking on more risk,\" said one financial adviser, \"then see where you can reduce.\"",
    "link": "https://www.newsweek.com/guide-how-survive-trump-recession-2025-2045023",
    "timestamp": "2025-03-15T08:00:03Z"
  },
  {
    "title": "What a Recession Could Mean for Your 401(k) Retirement Fund",
    "description": "The probability of a recession, which is a prolonged and widespread decline in economic activity, is growing, analysts said.",
    "link": "https://www.newsweek.com/what-recession-means-401k-retirement-fund-2044892",
    "timestamp": "2025-03-15T08:00:02Z"
  },
  {
    "title": "Why Mark Carney is dropping both his Irish and U.K. passports",
    "description": "Monday might be the last St. Patrick's Day that Mark Carney can truly claim to be Irish, as Canada's newly sworn-in prime minister moves to renounce both his Irish and U.K. citizenships.",
    "link": "https://www.cbc.ca/news/canada/dual-citizenship-prime-minister-carney-1.7481926",
    "timestamp": "2025-03-15T08:00:00Z"
  },
  {
    "title": "As Trump attacks Canada, Downing Street sticks to the sidelines",
    "description": "As U.S. President Donald Trump keeps threatening Canada's sovereignty with his 51st state comments, British Foreign Secretary David Lammy is calling for unity — as the United Kingdom continues to avoid directly pushing back on Trump's annexation talk.",
    "link": "https://www.cbc.ca/news/politics/trump-comments-uk-foreign-secretary-1.7483697",
    "timestamp": "2025-03-15T08:00:00Z"
  },
  {
    "title": "Opposition parties slam Trudeau cabinet's future appointments to government agencies",
    "description": "Opposition MPs are criticizing 88 future appointments made by former prime minister Justin Trudeau's government, some calling for Prime Minister Mark Carney to review those that have not yet gone into effect.",
    "link": "https://www.cbc.ca/news/politics/trudeau-future-appointments-reaction-1.7484422",
    "timestamp": "2025-03-15T08:00:00Z"
  },
  {
    "title": "Map Shows Proposals for Relocating Gaza's Palestinians",
    "description": "After Jordan and Egypt rejected the relocation of Palestinians to their countries, some African territories are now under potential consideration.",
    "link": "https://www.newsweek.com/map-shows-proposals-relocating-gazas-palestinians-2044852",
    "timestamp": "2025-03-15T07:59:38Z"
  },
  {
    "title": "Starship, carrying Tesla's bot, set for Mars by end-2026: Elon Musk",
    "description": "Musk suggested in a post on X that human landings could begin as early as 2029, though 2031 was more likely if the initial landings go well.",
    "link": "https://economictimes.indiatimes.com/tech/technology/starship-carrying-teslas-bot-set-for-mars-by-end-2026-elon-musk/articleshow/119037682.cms",
    "timestamp": "2025-03-15T07:56:18Z"
  },
  {
    "title": "Tesla's year is off to a brutal start",
    "description": "Tesla protests, falling sales, and fierce competition are testing the popular saying, \"You should never bet against Elon Musk.\"",
    "link": "https://www.businessinsider.com/tesla-bad-start-to-year-elon-musk-challenges-2025-3",
    "timestamp": "2025-03-15T07:52:01Z"
  },
  {
    "title": "Elon Musk's business faces the brunt of Donald Trump's tariff policies? Tesla and SpaceX raise concerns to USTR",
    "description": "Elon Musk's Tesla and SpaceX have expressed concerns to the US Trade Representative about the negative impacts of Donald Trump's tariffs.&nbsp;",
    "link": "https://www.livemint.com/companies/elon-musks-business-faces-the-brunt-of-donald-trumps-tariff-policies-tesla-and-spacex-raise-concerns-to-ustr-11742021317662.html",
    "timestamp": "2025-03-15T07:50:31Z"
  },
  {
    "title": "Is Donald Trump a Russian agent?",
    "description": "Donald Trump's policies have been unprecedentedly pro-Russian.\nUntil this week, when the US pressed the Kremlin to commit to a ceasefire, the Trump administration had apparently asked for nothing from President Putin, while making a series of unilateral conce…",
    "link": "https://biztoc.com/x/f044dc086a49d6b8",
    "timestamp": "2025-03-15T07:42:48Z"
  },
  {
    "title": "Is Donald Trump a Russian agent?",
    "description": "'We have to consider the possibility that President Trump is a Russian asset' former Tory minister Graham Stuart tweeted last week. Do we?",
    "link": "https://theweek.com/politics/is-donald-trump-a-russian-agent",
    "timestamp": "2025-03-15T07:41:00Z"
  },
  {
    "title": "Ukraine updates: Starmer to seek support in coalition call",
    "description": "UK's Starmer is set to convene the \"coalition of the willing,\" calling for commitment to support Ukraine as the US attempts to broker a peace deal with Russia. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-updates-starmer-to-seek-support-in-coalition-call/live-71929674",
    "timestamp": "2025-03-15T07:35:00Z"
  },
  {
    "title": "Starship, carrying Tesla's bot, set for Mars by end-2026: Elon Musk",
    "description": "Musk suggested in a post on X that human landings could begin as early as 2029, though 2031 was more likely if the initial landings go well.  Musk told...",
    "link": "https://finance.yahoo.com/news/starship-carrying-teslas-bot-set-073455483.html",
    "timestamp": "2025-03-15T07:34:55Z"
  },
  {
    "title": "Starship, carrying Tesla's bot, set for Mars by end-2026: Elon Musk",
    "description": "Musk suggested in a post on X that human landings could begin as early as 2029, though 2031 was more likely if the initial landings go well.  Musk told...",
    "link": "https://www.yahoo.com/news/starship-carrying-teslas-bot-set-073455718.html",
    "timestamp": "2025-03-15T07:34:55Z"
  },
  {
    "title": "Starship, carrying Tesla's bot, set for Mars by end-2026: Elon Musk",
    "description": "SpaceX founder Elon Musk said on Friday that Starship is set to depart for Mars at the end of next year, carrying Tesla humanoid bot Optimus. Musk suggested in a post on X that human landings could begin as early as 2029, though 2031 was more likely if the in…",
    "link": "https://www.channelnewsasia.com/business/starship-carrying-teslas-bot-set-mars-end-2026-elon-musk-5002541",
    "timestamp": "2025-03-15T07:34:55Z"
  },
  {
    "title": "When will stranded NASA astronauts return to Earth?",
    "description": "Stranded NASA astronauts to return to earth. SpaceX has successful launch. Donald Trump told Elon Musk to bring astronauts home.",
    "link": "https://www.deseret.com/business/2025/03/14/spacex-crew10-successful-launch-iss-boeing-starliner-astronauts-butch-wilmore-suni-williams-nasa-elon-musk-donald-trump/",
    "timestamp": "2025-03-15T07:34:44Z"
  },
  {
    "title": "U.K.'s Starmer convenes 'coalition of the willing' meeting to discuss Ukraine",
    "description": "British Prime Minister Keir Starmer is convening a second meeting of global leaders Saturday to discuss the developments regarding the war in Ukraine.",
    "link": "https://www.npr.org/2025/03/15/g-s1-54079/coalition-of-the-willing-second-meeting",
    "timestamp": "2025-03-15T07:33:24Z"
  },
  {
    "title": "UK Urges Economic Pressure on Russia If Putin Balks at Truce",
    "description": "UK Prime Minister Keir Starmer called on Western nations to ramp up economic pressure on Russian President Vladimir Putin if he delays a ceasefire in Ukraine, as he prepared to host a fresh round of discussions with like-minded leaders about securing a truce.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-urges-economic-pressure-on-russia-if-putin-balks-at-truce",
    "timestamp": "2025-03-15T07:29:14Z"
  },
  {
    "title": "They committed to public service with the hope of student-loan forgiveness. Under Trump, their plans are at risk.",
    "description": "Some student-loan borrowers have just a few payments left until they get Public Service Loan Forgiveness. Trump might put that relief at risk.",
    "link": "https://www.businessinsider.com/trump-limits-public-service-loan-forgiveness-borrowers-react-debt-relief-2025-3",
    "timestamp": "2025-03-15T07:26:01Z"
  },
  {
    "title": "US expels South African ambassador for being 'race-baiting politician'",
    "description": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\".",
    "link": "https://news.sky.com/story/us-expels-south-african-ambassador-for-being-race-baiting-politician-13328948",
    "timestamp": "2025-03-15T07:22:00Z"
  },
  {
    "title": "The 'Wolf of Wall Street' on US stock markets, recession, and Elon Musk",
    "description": "Jordan Belfort dismisses concerns over market volatility and defends Trump's tariffs as beneficial for the U.S. economy. He criticizes mainstream media for creating undue panic and praises both Trump and Elon Musk, expressing admiration for their actions.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-wolf-of-wall-street-on-us-stock-markets-recession-and-elon-musk/articleshow/119036628.cms",
    "timestamp": "2025-03-15T07:20:23Z"
  },
  {
    "title": "Burke: We can do without the Dept. of Education",
    "description": "Overall, federal spending per pupil (adjusted for inflation) has more than doubled since the Education Department’s establishment in 1979. Yet over the same period, high school students’ scores on math and reading haven’t budged.",
    "link": "https://www.bostonherald.com/2025/03/15/burke-we-can-do-without-the-dept-of-education/",
    "timestamp": "2025-03-15T07:19:51Z"
  },
  {
    "title": "Transgender Troops Told To Leave US Navy Or Face Involuntary Discharge",
    "description": "The United States Navy has issued a directive requiring transgender sailors and Marines to either voluntarily separate by March 28 or face involuntary discharge. This policy follows a broader campaign ...\nThe post Transgender Troops Told To Leave US Navy Or F…",
    "link": "https://www.starobserver.com.au/news/transgender-troops-told-to-leave-us-navy-or-face-involuntary-discharge/235860",
    "timestamp": "2025-03-15T07:17:09Z"
  },
  {
    "title": "Recession fears grip Wall Street: Could Trump's tariff war tip US into economic turmoil?",
    "description": "Economic slowdown fears in the U.S. intensify as trade war escalations and tariff hikes fuel market volatility. The Nasdaq enters correction territory, while the Federal Reserve revises GDP forecasts downward, increasing recession concerns. Analysts warn of f…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/recession-fears-grip-wall-street-could-trumps-tariff-war-tip-us-into-economic-turmoil/articleshow/119036453.cms",
    "timestamp": "2025-03-15T07:12:03Z"
  },
  {
    "title": "\"Turned Department Of Justice Into Department Of Injustice\": Trump Jabs Biden",
    "description": "Donald Trump has made attacks on the US media a central part of his message ever since his first election to the presidency in 2016.",
    "link": "https://www.ndtv.com/world-news/donald-trump-jabs-joe-biden-turned-department-of-justice-into-department-of-injustice-7927957",
    "timestamp": "2025-03-15T07:11:39Z"
  },
  {
    "title": "Trump tariffs: What's been done and what is to come?",
    "description": "U.S. President Donald Trump threatened on March 13 to apply 200-percent tariffs on wine, champagne and other alcoholic drinks from France and other EU countries, in the latest twist of an escalating trade war.",
    "link": "https://www.hurriyetdailynews.com/trump-tariffs-whats-been-done-and-what-is-to-come-206917",
    "timestamp": "2025-03-15T07:11:37Z"
  },
  {
    "title": "US expels South African ambassador, saying he ‘hates’ Trump",
    "description": "The US decision to expel South Africa’s ambassador was “regrettable,” the office of the South African president said Saturday, after Washington’s top diplomat accused the envoy of hating America and President Donald Trump. Secretary of State Marco Rubio said …",
    "link": "https://www.digitaljournal.com/world/us-expels-south-african-ambassador-saying-he-hates-trump/article",
    "timestamp": "2025-03-15T07:05:13Z"
  },
  {
    "title": "Astronaut Onishi blasts off on mission as 3rd Japanese to lead ISS",
    "description": "Takuya Onishi and three fellow crew members embarked Friday on a mission to the International Space Station aboard a SpaceX rocket launched from Florida. Onishi, traveling in SpaceX's Crew Dragon capsule with American and Russian colleagues, is making his sec…",
    "link": "https://japantoday.com/category/national/update1-astronaut-onishi-blasts-off-on-mission-as-3rd-japanese-to-lead-iss",
    "timestamp": "2025-03-15T07:04:35Z"
  },
  {
    "title": "ETMarkets Smart Talk: Market panic vs. reality: Rajesh Cheruvu on why investors should stay calm",
    "description": "LGT Wealth India’s CIO Rajesh Cheruvu believes markets will stabilize once panic selling subsides. Despite volatility, Nifty valuations are below the five-year average, suggesting a potential bottom. Midcap and smallcap indices have entered a bear market, wit…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-market-panic-vs-reality-rajesh-cheruvu-on-why-investors-should-stay-calm/articleshow/119036076.cms",
    "timestamp": "2025-03-15T07:04:08Z"
  },
  {
    "title": "US Expels South African Ambassador, Saying He 'Hates' Trump",
    "description": "The US decision to expel South Africa's ambassador was \"regrettable,\" the office of the South African president said Saturday, after Washington's top diplomat accused the envoy of hating America and President Donald Trump.",
    "link": "https://www.ibtimes.com/us-expels-south-african-ambassador-saying-he-hates-trump-3766369",
    "timestamp": "2025-03-15T07:00:13Z"
  },
  {
    "title": "Show me some ‘insanely good’ art by AI – and I will show you someone who is easily impressed",
    "description": "Tech bros' hype is blinding us to the reality that artificial intelligence might not be so smart after all",
    "link": "https://www.irishtimes.com/opinion/2025/03/15/show-me-some-insanely-good-art-by-ai-and-i-will-show-you-someone-who-is-insanely-easily-impressed/",
    "timestamp": "2025-03-15T07:00:00Z"
  },
  {
    "title": "Putin tells Ukraine troops in Russian region to 'surrender'",
    "description": "President Vladimir Putin called on Friday for beleaguered Ukrainian troops in the Russian region of Kursk to \"surrender\" as Ukraine's President Volodymyr Zelensky accused the Russian leader of seeking to sabotage a ceasefire initiative.",
    "link": "https://www.hurriyetdailynews.com/putin-tells-ukraine-troops-in-russian-region-to-surrender-206914",
    "timestamp": "2025-03-15T06:59:00Z"
  },
  {
    "title": "House Democrats to hold 'Day of Action' to push back against GOP-backed spending bill",
    "description": "House Democrats will hold a \"Day of Action\" across the country on Tuesday to push back against the GOP-backed spending bill to avert a government shutdown.",
    "link": "https://www.foxnews.com/politics/house-democrats-hold-day-action-push-back-against-gop-backed-spending-bill",
    "timestamp": "2025-03-15T06:57:59Z"
  },
  {
    "title": "South Africa says US expulsion of its ambassador ‘regrettable’",
    "description": "The United States’ decision to expel South Africa’s ambassador was “regrettable”, the office of the president said Saturday, urging “diplomatic decorum” between the two nations. Secretary of State Marco Rubio said Friday that ambassador Ebrahim Rasool was no …",
    "link": "https://punchng.com/south-africa-says-us-expulsion-of-its-ambassador-regrettable/",
    "timestamp": "2025-03-15T06:52:32Z"
  },
  {
    "title": "Musk gets support from unexpected quarters on Tesla: Kim Kardashian",
    "description": "Kim Kardashian, who has hundreds of millions of followers across the world and on her social media handles, shared photos of herself with a Tesla Cybertruck and Optimus robot.",
    "link": "https://www.livemint.com/companies/people/elon-musk-tesla-takedown-musk-gets-support-from-unexpected-quarters-on-tesla-kim-kardashian-poses-with-tesla-cybertruck-11742019578188.html",
    "timestamp": "2025-03-15T06:47:10Z"
  },
  {
    "title": "Trump administration weighs travel ban on dozens of countries, memo says",
    "description": "The Trump administration is contemplating new travel restrictions for citizens from 41 countries. Some would face full visa suspensions, others partial suspensions. The list, still awaiting approval, includes countries like Afghanistan and Iran, echoing Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administration-weighs-travel-ban-on-dozens-of-countries-memo-says/articleshow/119035755.cms",
    "timestamp": "2025-03-15T06:46:19Z"
  },
  {
    "title": "Ex-Meta employee barred from promoting explosive memoir amid legal battle",
    "description": "Facebook parent company Meta is seeking to silence a former employee who has made scandalous allegations in a new tell-all book, obtaining a ruling to temporarily bar her from promoting the memoir or bad-mouthing the tech giant. In “Careless People: A Caution…",
    "link": "https://punchng.com/ex-meta-employee-barred-from-promoting-explosive-memoir-amid-legal-battle/",
    "timestamp": "2025-03-15T06:37:28Z"
  },
  {
    "title": "US designated South Korea a 'sensitive' country amid talk of nuclear weapons",
    "description": "The U.S. Department of Energy has designated South Korea as a 'sensitive' country following heightened nuclear weapons rhetoric and martial law imposition by its president. This designation involves no new restrictions on bilateral scientific and technologica…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-designated-south-korea-a-sensitive-country-amid-talk-of-nuclear-weapons/articleshow/119035472.cms",
    "timestamp": "2025-03-15T06:37:03Z"
  },
  {
    "title": "'Very possible' Bitcoin consolidates for 8 months again: 10x Research",
    "description": "10x Research’s head crypto researcher isn’t ruling out Bitcoin repeating its 2024 price action, where it spent much of the year consolidating after hitting all-time highs early on.“Very possible,” Markus Thielen told Cointelegraph when asked what the chances …",
    "link": "https://cointelegraph.com/news/bitcoin-consolidation-phase-repeat-2024-price-action-possible-crypto-analyst",
    "timestamp": "2025-03-15T06:35:20Z"
  },
  {
    "title": "Trump, addressing DOJ attorneys, says that those who fight him in court are 'scum' - ABC News",
    "description": "Trump, addressing DOJ attorneys, says that those who fight him in court are 'scum'ABC News Trump hones Justice Department as weapon of revenge; some dull edges remainMSNBC Donald Trump threatens opponents with jail in Justice Department speechAl Jazeera Engli…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176726631",
    "timestamp": "2025-03-15T06:33:24Z"
  },
  {
    "title": "Think. Over the week",
    "description": "In the Editorial section, the decline in the latest retail inflation print was commented upon and an argument was made for a further rate cut by the RBI’s MPC. Other topics analysed in this section were the change in guard in Canada with Mark Carney becoming …",
    "link": "https://www.thehindubusinessline.com/newsletter/nl-opinion/think-over-the-week/article69333030.ece",
    "timestamp": "2025-03-15T06:32:19Z"
  },
  {
    "title": "Elon Musk-Led DOGE Cancels Over 2 Lakh Government Credit Cards. Heres Why",
    "description": "The US Department of Government Efficiency (DOGE), headed by billionaire and White House advisor Elon Musk, has deactivated over 2 lakh federal government credit cards to streamline spending.",
    "link": "https://www.ndtv.com/world-news/elon-musk-led-doge-cancels-over-2-lakh-government-credit-cards-heres-why-7927023",
    "timestamp": "2025-03-15T06:31:50Z"
  },
  {
    "title": "UK's Starmer convenes 'coalition of the willing' for second meeting to discuss Ukraine",
    "description": "British Prime Minister Keir Starmer is convening a meeting of global leaders to discuss the developments regarding the war in Ukraine, following another frantic week of diplomacy aimed at getting Russia to back a 30-day ceasefire",
    "link": "https://abcnews.go.com/International/wireStory/uks-starmer-convenes-coalition-meeting-discuss-ukraine-119825836",
    "timestamp": "2025-03-15T06:30:25Z"
  },
  {
    "title": "Never mind the shamrocks: White House showroom opens for business amid ‘Tesla Chainsaw Massacre’",
    "description": "Planet Business: Prime Video’s Apprentice nostalgia, Porsche executives’ sleepless nights and the EU’s proposed counter-tariffs. It’s another week on Planet Trump",
    "link": "https://www.irishtimes.com/business/2025/03/15/never-mind-the-shamrocks-white-house-showroom-opens-for-business-amid-tesla-chainsaw-massacre/",
    "timestamp": "2025-03-15T06:15:00Z"
  },
  {
    "title": "There was no Oval Office ambush, but that doesn’t mean the danger for Ireland has passed",
    "description": "Conservative commentator Michael Brendan Dougherty and Trinity College professor Daniel Geary debate what might happen next in US-Irish relations",
    "link": "https://www.irishtimes.com/opinion/2025/03/15/there-was-no-oval-office-ambush-but-that-doesnt-mean-the-danger-for-ireland-has-passed/",
    "timestamp": "2025-03-15T06:15:00Z"
  },
  {
    "title": "After Columbia arrests, international college students fall silent",
    "description": "International students and foreign faculty have watched the crackdown on pro-Palestinian protesters at Columbia University with apprehension",
    "link": "https://abcnews.go.com/US/wireStory/after-columbia-arrests-international-college-students-fall-silent-119825212",
    "timestamp": "2025-03-15T06:14:28Z"
  },
  {
    "title": "How Putin is undermining western power through propaganda and sabotage",
    "description": "Worldview: A former German ambassador and head of Nato intelligence says western societies must do more to protect themselves from Russia’s hybrid warfare",
    "link": "https://www.irishtimes.com/opinion/2025/03/15/how-putin-is-undermining-western-power-through-propaganda-and-sabotage/",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Micheál Martin’s week in Washington: Meek Taoiseach and the Trump bomb that never went off",
    "description": "Hard to overstate level of trepidation in Taoiseach’s party before Wednesday’s meetings",
    "link": "https://www.irishtimes.com/politics/2025/03/15/a-week-in-washington-meek-micheal-martin-and-the-trump-bomb-that-never-went-off/",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Report: NASA prioritized WOKENESS over space research during Biden’s presidency",
    "description": "NASA allocated over $2.3 million since 2021 to diversity, equity and inclusion (DEI) initiatives, including $100,000 to enhance diversity in planetary science and $2 million to integrate DEI principles into its culture. A 22-page guide on workplace gender tra…",
    "link": "https://www.naturalnews.com/2025-03-15-report-nasa-prioritized-wokeness-during-biden-presidency.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Maria Zeee and Mike Adams: The rise of digital ID, government censorship and tyranny",
    "description": "Maria Zeee discussed the severe censorship by the Australian eSafety Commissioner, which has stifled free speech, and highlighted similar practices in the U.S. as revealed by the Twitter Files. Mike Adams emphasized his legal battles against government censor…",
    "link": "https://www.naturalnews.com/2025-03-15-zeee-adams-rise-digital-id-censorship-tyranny.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Iran, Russia, China unite against US sanctions, demand end to ‘unlawful’ coercion in global power play",
    "description": "Iran, Russia, and China issued a joint statement condemning US sanctions as “unlawful” during high-level talks in Beijing. The meeting aimed to revive stalled US-Iran nuclear negotiations, which Tehran refuses to engage in under threats and sanctions. US Pres…",
    "link": "https://www.naturalnews.com/2025-03-15-iran-russia-china-unite-against-us-sanctions-demand-end-to-unlawful-coercion-in-global-power-play.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Reform UK undergoes schism amid row linked to Elon Musk and Tommy Robinson",
    "description": "Party leader Nigel Farage has fallen out with MP Rupert Lowe, seen as one of ‘Tommy’s people'",
    "link": "https://www.irishtimes.com/world/uk/2025/03/15/spectres-of-elon-musk-and-tommy-robinson-linger-over-row-in-reform-uk/",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "It appears Democrats have finally picked a hill to die on",
    "description": "Democrats are doubling down on left-wing gender ideology despite their viewpoints being increasingly unpopular with the average American. (Article by Adam Pack republished from DailyCaller.com) The vast majority of Americans support reversing the Biden admini…",
    "link": "https://www.naturalnews.com/2025-03-15-democrats-finally-picked-hill-to-die-on.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Trump to purchase a new Tesla Model S in support of Musk following a 15% stock price drop",
    "description": "President Donald Trump announced plans to purchase a new Tesla Model S as a show of support for Elon Musk and Tesla, following a 15 percent stock price drop –  Tesla’s worst single-day decline in nearly five years. Trump accused “radical left lunatics” of orc…",
    "link": "https://www.naturalnews.com/2025-03-15-trump-purchase-tesla-model-in-support-musk.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Egg prices plummet nearly $2 in just 13 days following Trump administration’s bold plan",
    "description": "Egg prices have fallen dramatically, with the average cost of a dozen eggs dropping by nearly $2.00 in 13 days, providing relief to American consumers after months of historic highs exceeding $8 per dozen. A strategic plan – including a $1 billion investment …",
    "link": "https://www.naturalnews.com/2025-03-15-egg-prices-plummet-after-trump-admin-plan.html",
    "timestamp": "2025-03-15T06:00:00Z"
  },
  {
    "title": "Voltaire, International Newsletter N°124",
    "description": "Voltaire, International Newsletter is a weekly newsletter on international politics. It features 10 to 15 pages of contextualized, sourced news items. Its aim is to enable you to follow the decline of the unipolar world and the emergence of a multipolar syste…",
    "link": "https://www.voltairenet.org/article221928.html",
    "timestamp": "2025-03-15T05:56:41Z"
  },
  {
    "title": "Fact-Checking Trump’s Justice Dept. Speech on Crime, Immigration and His Cases - The New York Times",
    "description": "Fact-Checking Trump’s Justice Dept. Speech on Crime, Immigration and His CasesThe New York Times Trump calls his opponents 'scum' and lawbreakers in bellicose speech at Justice DepartmentPOLITICO Trump hones Justice Department as weapon of revenge; some dull …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176726173",
    "timestamp": "2025-03-15T05:53:14Z"
  },
  {
    "title": "Relief as US Congress averts government shutdown - Economy - The Jakarta Post",
    "description": "The United States averted a government shutdown with hours to spare Friday as lawmakers already reeling from President Donald Trump's radical federal spending cuts voted to keep the lights on through September.",
    "link": "http://www.thejakartapost.com/business/2025/03/15/relief-as-us-congress-averts-government-shutdown-.html",
    "timestamp": "2025-03-15T05:49:56Z"
  },
  {
    "title": "SpaceX launches Nasa crew to space ahead of stuck crew return",
    "description": "<p>WASHINGTON &mdash; SpaceX launched a crew to the International Space Station (ISS) on Friday, a closely watched mission that would allow marooned astronauts Butch Wilmore and Suni Williams to finally return home.</p>",
    "link": "https://www.bangkokpost.com/world/2980516/spacex-launches-nasa-crew-to-space-ahead-of-stuck-crew-return",
    "timestamp": "2025-03-15T05:42:00Z"
  },
  {
    "title": "Trump says he was being a 'bit sarcastic' when he promised to end Russia-Ukraine war in 24 hours (Michelle L. Price/Associated Press)",
    "description": "Michelle L. Price / Associated Press:\nTrump says he was being a ‘bit sarcastic’ when he promised to end Russia-Ukraine war in 24 hours  —  President Donald Trump said Friday that he was “being a little bit sarcastic” when he repeatedly claimed as a candidate …",
    "link": "https://www.memeorandum.com/250315/p1",
    "timestamp": "2025-03-15T05:40:00Z"
  },
  {
    "title": "Carney Reviews Canada’s Order of F-35 Jets Amid Rift With US",
    "description": "Canada’s new Prime Minister Mark Carney ordered a review of the country’s contract with the US’s Lockheed Martin Corp for F-35 fighter jets, a new front in the dispute between the two sides in response to tariffs and expansionist rhetoric from President Donal…",
    "link": "https://www.livemint.com/companies/news/carney-reviews-canada-s-order-of-f-35-jets-amid-rift-with-us-11742016802465.html",
    "timestamp": "2025-03-15T05:33:21Z"
  },
  {
    "title": "Carney Reviews Canada’s Order of F-35 Jets Amid Rift With US",
    "description": "Canada’s new Prime Minister Mark Carney ordered a review of the country’s contract with the US’s Lockheed Martin Corp for F-35 fighter jets, a new front in the dispute between the two sides in response to tariffs and expansionist rhetoric from President Donal…",
    "link": "https://financialpost.com/pmn/business-pmn/carney-reviews-canadas-order-of-f-35-jets-amid-rift-with-us",
    "timestamp": "2025-03-15T05:32:39Z"
  },
  {
    "title": "U.S. designated South Korea a 'sensitive' country amid talk of nuclear weapons",
    "description": "The move after the South Korean president briefly imposed martial law and amid talk of Seoul potentially developing nuclear weapons.",
    "link": "https://www.japantimes.co.jp/news/2025/03/15/asia-pacific/politics/us-south-korea-sensitive-country-nukes/",
    "timestamp": "2025-03-15T05:32:00Z"
  },
  {
    "title": "The Book of Mormon: ‘We put all of these subversive things into a familiar box for people. And we swear a lot’",
    "description": "Trey Parker and Matt Stone’s hit musical is about to begin a month-long Irish run. It features jokes about FMG, Aids and child abuse but has goodness at its core",
    "link": "https://www.irishtimes.com/culture/stage/2025/03/15/the-book-of-mormon-we-put-all-of-these-subversive-things-into-a-familiar-box-for-people-and-we-swear-a-lot/",
    "timestamp": "2025-03-15T05:23:00Z"
  },
  {
    "title": "Native American news roundup March 9 – 14, 2025",
    "description": "WASHINGTON — Tribes and students sue feds over staff cuts at BIE schools\nThree Tribal Nations, along with five Native students, are suing the U.S. Interior Department and the Office of Indian Affairs over mass firings at the Bureau of Indian Education (BIE) a…",
    "link": "https://www.voanews.com/a/native-american-news-roundup-march-9-14-2025-/8010636.html",
    "timestamp": "2025-03-15T05:15:00Z"
  },
  {
    "title": "Who is Ranjani Srinivasan, and why did she self-deport from the US?",
    "description": "Indian PhD student Ranjani Srinivasan self-deported after her visa was revoked for allegedly supporting Hamas and advocating violence and terrorism. DHS Secretary Kristi Noem emphasized that residency and study privileges should be revoked for those supportin…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/who-is-ranjani-srinivasan-and-why-did-she-self-deport-from-the-us/articleshow/119032643.cms",
    "timestamp": "2025-03-15T05:10:07Z"
  },
  {
    "title": "Islamic State leader in Iraq and Syria killed, US says",
    "description": "Abdallah Makki Muslih al-Rifa was head of IS's most senior decision-making body, the US Central Command said.",
    "link": "https://www.bbc.com/news/articles/c9q451y218go",
    "timestamp": "2025-03-15T05:08:52Z"
  },
  {
    "title": "US slaps sanctions on Thai officials over deporting Uyghurs to China",
    "description": "The US has imposed sanctions on Thai officials for their role in deporting at least 40 Uyghurs to China, where the US says the Muslim group will face persecution.",
    "link": "https://www.abc.net.au/news/2025-03-15/us-puts-sanctions-on-thai-officials/105056430",
    "timestamp": "2025-03-15T05:03:46Z"
  },
  {
    "title": "Trump: Islamic State leader killed in Iraq",
    "description": "United States President Donald Trump announced that a leader of the Islamic State in Iraq has been killed.\"The fugitive leader of ISIS in Iraq was killed. He was relentlessly hunted down by our intrep...",
    "link": "https://biztoc.com/x/549dd041bb0f2885",
    "timestamp": "2025-03-15T04:57:54Z"
  },
  {
    "title": "At G7 meeting, U.S. allies’ top diplomats wonder where Rubio stands",
    "description": "The top U.S. diplomat has had to walk a fine line between delivering Trump's \"America First” message while also looking to cultivate allies.",
    "link": "https://www.japantimes.co.jp/news/2025/03/15/world/politics/g7-allies-marco-rubio/",
    "timestamp": "2025-03-15T04:55:00Z"
  },
  {
    "title": "Trump Accidentally Hit in Face with Microphone by Reporter",
    "description": "President Donald Trump appeared to be hit in the face on accident by a reporter’s microphone on Friday, according to several videos posted to social media. In a video posted to X, the end of a microphone appeared to briefly hit Trump in the face near his mout…",
    "link": "https://freerepublic.com/focus/f-chat/4304413/posts",
    "timestamp": "2025-03-15T04:50:01Z"
  },
  {
    "title": "'Islamic State' head in Iraq and Syria killed in strike",
    "description": "The Iraqi prime minister said the head of the \"Islamic State\" in Iraq and Syria was killed in an operation run by Iraqi intelligence and US-led coalition troops. The leader of the so-called \"Islamic State\" (IS) in Iraq and Syria was killed in an operation led…",
    "link": "https://www.dw.com/en/islamic-state-head-in-iraq-and-syria-killed-in-strike/a-71929211",
    "timestamp": "2025-03-15T04:50:00Z"
  },
  {
    "title": "Did not want PM Modi, other world leaders to see tents, graffiti, potholes in Washington DC: President Trump",
    "description": "US President Donald Trump ordered a clean-up of Washington DC to impress visiting world leaders such as Prime Minister Narendra Modi, French President Emmanuel Macron, and UK Prime Minister Keir Starmer. Trump emphasized the importance of having a pristine an…",
    "link": "https://economictimes.indiatimes.com/news/india/did-not-want-pm-modi-other-world-leaders-to-see-tents-graffiti-potholes-in-washington-dc-president-trump/articleshow/119031978.cms",
    "timestamp": "2025-03-15T04:44:39Z"
  },
  {
    "title": "Senior ISIS leader killed in Iraq, Trump says his ‘miserable life was terminated’",
    "description": "The leader of the Islamic State in Iraq and Syria has been killed, Iraq's prime minister announced on Friday.",
    "link": "https://nypost.com/2025/03/15/world-news/islamic-state-leader-abdallah-maki-mosleh-al-rifai-abu-khadija-killed-in-iraq/",
    "timestamp": "2025-03-15T04:42:51Z"
  },
  {
    "title": "Euro gains after German fiscal deal; dollar buoyed with US government shutdown likely averted",
    "description": "The euro gained on Friday after German parties agreed on a fiscal deal that boosts defence spending and infrastructure. The dollar weakened against the euro but strengthened against the Swiss franc and the yen. U.S. inflation expectations rose, hinting at the…",
    "link": "https://economictimes.indiatimes.com/markets/forex/euro-gains-after-german-fiscal-deal-dollar-buoyed-with-us-government-shutdown-likely-averted/articleshow/119031893.cms",
    "timestamp": "2025-03-15T04:41:04Z"
  },
  {
    "title": "Death From Above: US Missile Strike Wipes Out ISIS Chief Of Global Ops",
    "description": "The United States, in coordination with Iraqi Intelligence and Security Forces, announced the killing of Abdallah Makki Muslih al-Rifai, also known as &quot;Abu Khadijah,&quot; in a precision airstrike in Iraq&#039;s Al Anbar Province.",
    "link": "https://www.ndtv.com/world-news/abdallah-makki-muslih-al-rifai-isis-abu-khadijah-death-from-above-us-missile-strike-wipes-out-isis-chief-of-global-ops-7927169",
    "timestamp": "2025-03-15T04:40:04Z"
  },
  {
    "title": "Trump-driven turbulence draws new investors into gold",
    "description": "Investors are increasingly turning to gold ETFs amid political and economic unpredictability under the Trump administration. Gold prices have hit a record high, with a notable increase in U.S. investors moving away from equities. Continuous inflows into gold …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/trump-driven-turbulence-draws-new-investors-into-gold/articleshow/119031740.cms",
    "timestamp": "2025-03-15T04:35:02Z"
  },
  {
    "title": "Trump Announces the Killing of Fugitive ISIS Leader",
    "description": "President Donald Trump has announced that the fugitive leader of ISIS, Abdallah Makki Muslih al-Rifai, in Iraq, has been killed, marking a significant blow to the terror group. In a statement, Trump revealed that the operation was a result of coordinated effo…",
    "link": "https://freerepublic.com/focus/f-news/4304410/posts",
    "timestamp": "2025-03-15T04:31:18Z"
  },
  {
    "title": "Trump’s champagne threat brings fear and denial to French region",
    "description": "The United States is the biggest export market for champagne, made exclusively in its home region in eastern France.\nThe post Trump’s champagne threat brings fear and denial to French region appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/trumps-champagne-threat-brings-fear-and-denial-to-french-region/article",
    "timestamp": "2025-03-15T04:30:29Z"
  },
  {
    "title": "Democrats confront limits of their minority power after bruising shutdown vote",
    "description": "Senate Democrats were grim Friday as they left Washington after a brutal 10-week stretch that consistently showed the limits of their new minority and culminated with a deeply personal rupture over how to best counter President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/democrats-confront-limits-minority-power-after-bruising-shutdown-119824175",
    "timestamp": "2025-03-15T04:30:16Z"
  },
  {
    "title": "Donald Trump health worries grow over 'dark mark' on hand as doctor fears 'hospital stay' - NewsBreak",
    "description": "A mysterious dark mark was spotted on Donald Trump's hand during a meeting with Irish leader Micheál Martin - it comes just weeks after a bruise was seen",
    "link": "https://www.newsbreak.com/share/3854061218823-donald-trump-health-worries-grow-over-dark-mark-on-hand-as-doctor-fears-hospital-stay?s=a2&amp;share_destination_id=MjIzMTUyNTEwLTE3NDIwMTI3ODA0NDg%3D&amp;pd=0F6KA22w&amp;hl=en_US&amp;send_time=1742012780&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_local_strategy_25q1_exp-v6%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v1",
    "timestamp": "2025-03-15T04:27:18Z"
  },
  {
    "title": "Gold tops $3,000 for first time on Trump tariff war, stocks rebound",
    "description": "Gold rose above $3,000 for the first time Friday as President Donald Trump's trade wars boosted demand for safe-haven assets, while stock markets bounced on signs US lawmakers would avert a government shutdown. - Times of uncertainty - Gold, a haven in times …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-tops-3000-for-first-time-on-trump-tariff-war-stocks-rebound/articleshow/119031537.cms",
    "timestamp": "2025-03-15T04:26:50Z"
  }
]