[
  {
    "title": "Defence stocks surge on German spending plan",
    "description": "Iseq index up 2.9% amid big moves for AIB and Kingspan",
    "link": "https://www.irishtimes.com/business/markets/2025/03/05/defence-stocks-surge-on-german-spending-plan/",
    "timestamp": "2025-03-05T18:50:16Z"
  },
  {
    "title": "Sen. Mark Warner Visits MSNBC to Awkwardly Walk Back His Praise of Trump On Fox: ‘My Words Yesterday… Were Not Great’",
    "description": "U.S. Sen. Mark Warner (D-VA) has taken to MSNBC to walk back praise of Trump he made on the Fox Business Network just a day earlier.\nThe post Sen. Mark Warner Visits MSNBC to Awkwardly Walk Back His Praise of Trump On Fox: ‘My Words Yesterday… Were Not Great’…",
    "link": "https://www.mediaite.com/news/sen-mark-warner-visits-msnbc-to-awkwardly-walk-back-his-praise-of-trump-on-fox-my-words-yesterday-were-not-great/",
    "timestamp": "2025-03-05T18:49:15Z"
  },
  {
    "title": "At congressional address, Trump told Chief Justice Roberts he ‘won’t forget’",
    "description": "President Donald Trump greets US Supreme Court Chief Justice John Roberts as Trump to address to a joint session of Congress in the House Chamber of the US Capitol in Washington, DC, on March 4, 2025.",
    "link": "https://biztoc.com/x/2dfa04dd251625a6",
    "timestamp": "2025-03-05T18:48:28Z"
  },
  {
    "title": "Elon Musk Is Now $111 Billion Poorer, Thanks To His Best Bro Donald Trump’s Tariffs",
    "description": "It’s essentially pocket change to the world’s richest man.",
    "link": "https://www.vanityfair.com/style/story/elon-musk-111-billion-poorer-tariffs-tesla-stock",
    "timestamp": "2025-03-05T18:48:21Z"
  },
  {
    "title": "Tariffs on cars from Mexico and Canada delayed by one month",
    "description": "President Donald Trump has granted an exemption on auto tariffs on Mexico and Canada for one month, White House Press Secretary Karoline Leavitt confirmed Wednesday.\n“We spoke with the Big Three auto dealers. We are going to give a one-month exemption on any …",
    "link": "https://biztoc.com/x/436994671aa7ccf7",
    "timestamp": "2025-03-05T18:47:59Z"
  },
  {
    "title": "Calls to fire Nicolle Wallace reach a fever pitch over at MSNBC…",
    "description": "It’s been a while since we’ve seen this level of outrage over a media figure—but right now, the calls to fire MSNBC’s Nicolle Wallace are louder than ever. And honestly, who can blame them? The mainstream media has hit some unbelievable lows, but Wallace’s la…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302272/posts",
    "timestamp": "2025-03-05T18:47:54Z"
  },
  {
    "title": "CNN's Enten: Trump Russia-Ukraine Approval Ratings over Biden on 'Different Planet'",
    "description": "CNN senior political data reporter Harry Enten said Monday on \"NewsCentral\" that Americans supported President Donald Trump more than former President Biden regarding the war in Ukraine.\nThe post CNN’s Enten: Trump Russia-Ukraine Approval Ratings over Biden o…",
    "link": "https://www.breitbart.com/clips/2025/03/05/cnns-enten-trump-russia-ukraine-approval-ratings-over-biden-on-different-planet/",
    "timestamp": "2025-03-05T18:47:45Z"
  },
  {
    "title": "'A jester high on ketamine!' French senator delivers blistering rebuke of Trump and Musk",
    "description": "French Senator Claude Malhuret this week delivered a blistering rebuke of President Donald Trump and X owner Elon Musk, and he compared their reign to that of an infamously debauched Roman emperor.During a speech discussing European support for Ukraine agains…",
    "link": "https://www.rawstory.com/french-senator-musk-trump/",
    "timestamp": "2025-03-05T18:47:28Z"
  },
  {
    "title": "Trudeau not willing to lift Canada's retaliatory tariffs if Trump leaves some tariffs on Canada",
    "description": "A senior Canadian government official says Prime Minister Justin Trudeau is not willing to lift Canada’s retaliatory tariffs if Trump leaves any tariffs on Canada, The official confirmed the stance on condition of anonymity as they were not authorized ...",
    "link": "https://abcnews.go.com/US/wireStory/trudeau-lift-canadas-retaliatory-tariffs-trump-leaves-tariffs-119479621",
    "timestamp": "2025-03-05T18:46:14Z"
  },
  {
    "title": "Trump wants to destroy the EU — and rebuild it in his image",
    "description": "Donald Trump won't deal with the EU. The EU can't deal with Trump.",
    "link": "https://www.politico.eu/article/donald-trump-destroy-european-union-brussels/",
    "timestamp": "2025-03-05T18:45:49Z"
  },
  {
    "title": "Engineering goods exports to US surge 18pc in Jan, but tariff threat looms large: EEPC",
    "description": "KOLKATA, March 5: India’s engineering goods exports to the United States recorded an 18 per cent year-on-year growth in January 2025, reaching USD 1.62 billion, even as overall engineering shipments grew at a modest 7.44 per cent, according to EEPC India. Thi…",
    "link": "https://thehillstimes.in/business/engineering-goods-exports-to-us-surge-18pc-in-jan-but-tariff-threat-looms-large-eepc",
    "timestamp": "2025-03-05T18:45:00Z"
  },
  {
    "title": "'What’s going on here?' Trump floats conspiracy theory after Trudeau phone call",
    "description": "President Donald Trump took to Truth Social Wednesday afternoon to post about his much-anticipated phone call with outgoing Canadian Prime Minister Justin Trudeau.\n\n\"Justin Trudeau, of Canada, called me to ask what could be done about Tariffs,\" Trump wrote. \"…",
    "link": "https://www.rawstory.com/not-good-enough-trump-posts-about-trudeau-call-and-what-it-means-for-tariffs/",
    "timestamp": "2025-03-05T18:43:45Z"
  },
  {
    "title": "Lesotho insulted after Trump says nobody has heard of the country | CNN",
    "description": "Lesotho’s foreign minister said on Wednesday he was shocked and insulted by U.S. President Donald Trump saying nobody has heard of the African country, and invited him to come visit.",
    "link": "https://www.cnn.com/2025/03/05/africa/lesotho-president-trump-congress-int-latam/index.html",
    "timestamp": "2025-03-05T18:43:12Z"
  },
  {
    "title": "Tariffs on cars from Mexico and Canada delayed by one month | CNN Business",
    "description": "President Donald Trump has granted an exemption on auto tariffs on Mexico and Canada for one month, White House Press Secretary Karoline Leavitt confirmed Wednesday.",
    "link": "https://www.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
    "timestamp": "2025-03-05T18:42:41Z"
  },
  {
    "title": "Minnesota Gov. Tim Walz Would Consider Presidential Run",
    "description": "Kamala Harris's running mate isn't ruling out his own run for the presidency.",
    "link": "https://littlethings.com/entertainment/minnesota-gov-tim-walz-says-he-would-certainly-consider-running-for-president-in-2028",
    "timestamp": "2025-03-05T18:42:01Z"
  },
  {
    "title": "Asian shares, US futures higher after Wall St losses wipe out S and P 500’s post-election gains",
    "description": "BANGKOK, March 5: Asian shares and US futures were mostly higher on Wednesday following a rocky session on Wall Street after Canada, Mexico and China were hit by steep US tariffs that took effect on Tuesday. Comments by US President Donald Trump in a speech t…",
    "link": "https://thehillstimes.in/business/asian-shares-us-futures-higher-after-wall-st-losses-wipe-out-s-and-p-500s-post-election-gains",
    "timestamp": "2025-03-05T18:40:00Z"
  },
  {
    "title": "DOJ: Former Catholic priest convicted of child sex abuse will be deported after sentence",
    "description": "U.S. Department of Justice headquarters building in Washington, D.C. / Credit: Bjoertvedt, CC BY-SA 3.0 , via Wikimedia\r\n\n\nWashington, D.C. Newsroom, Mar 5, 2025 / 13:40 pm (CNA).\nA former Catholic priest who was convicted of sexually abusing a minor will be …",
    "link": "https://www.catholicnewsagency.com/news/262569/doj-former-catholic-priest-convicted-of-child-sex-abuse-will-be-deported-after-sentence",
    "timestamp": "2025-03-05T18:40:00Z"
  },
  {
    "title": "Trump could finally get a weaker dollar — but that might not be a great sign for the US",
    "description": "\"We would not have expected these market moves at the start of the year,\" Deutsche Bank, wrote Tuesday, noting the recent decline in the dollar.",
    "link": "https://www.businessinsider.com/trump-tariff-us-dollar-dominance-selloff-trade-war-inflation-exceptionalism-2025-3",
    "timestamp": "2025-03-05T18:39:42Z"
  },
  {
    "title": "Trump’s EPA Is Botching Removal of Toxic Waste From the Los Angeles Fires",
    "description": "Under Trump’s guidance, the EPA is prioritizing speed over public health, refusing to test ash from LA for toxicity.",
    "link": "https://truthout.org/articles/trumps-epa-is-botching-removal-of-toxic-waste-from-the-los-angeles-fires/",
    "timestamp": "2025-03-05T18:39:10Z"
  },
  {
    "title": "Shoppers will see some food prices rise because of tariffs, but not all at once",
    "description": "Now that Canada and the U.S. are in a trade war, shoppers can expect some prices to rise at the grocery store — but not on all products and not all at once. After U.S. President Donald Trump enacted sweeping tariffs on Canadian goods Tuesday, Canada responded…",
    "link": "https://financialpost.com/pmn/shoppers-will-see-some-food-prices-rise-because-of-tariffs-but-not-all-at-once",
    "timestamp": "2025-03-05T18:38:49Z"
  },
  {
    "title": "What Is a Trade War and How Could It Raise Prices?",
    "description": "Trump’s new tariffs on Mexico, Canada and China have launched a trade war as the U.S.’s biggest trade partners retaliate.",
    "link": "https://www.nerdwallet.com/article/finance/what-is-a-trade-war#article",
    "timestamp": "2025-03-05T18:37:42Z"
  },
  {
    "title": "In Maine, gas price increases linked to Trump tariff on Canadian imports",
    "description": "HALIFAX — Experts are linking rising gasoline prices in the U.S. northeast to President Donald Trump’s tariffs on Canadian energy imports, but they warn the trend may also hurt Atlantic Canada’s energy producers. According to Canada’s consulate general in Bos…",
    "link": "https://financialpost.com/pmn/in-maine-gas-price-increases-linked-to-trump-tariff-on-canadian-imports",
    "timestamp": "2025-03-05T18:37:15Z"
  },
  {
    "title": "Trump Promised a Balanced Budget. Don't Believe It",
    "description": "In light of one of the more outlandish claims that President Donald Trump made during Tuesday night's joint address to Congress, an important reminder: There is no plan to balance the budget. \nIn fact, the budget framework currently making its way through Con…",
    "link": "https://biztoc.com/x/637ce39bad71b455",
    "timestamp": "2025-03-05T18:37:00Z"
  },
  {
    "title": "New Filing In Anti-DOGE Lawsuit Cites Trump's Remarks On Musk's Role",
    "description": "New Filing In Anti-DOGE Lawsuit Cites Trump's Remarks On Musk's Role\n \nAuthored by Katabella Roberts via RealInvestmentAdvice.com,\nComments made by President Donald Trump on Tuesday night are being used in a lawsuit challenging the legality of his administrat…",
    "link": "https://biztoc.com/x/cf8f4f46b12950cd",
    "timestamp": "2025-03-05T18:37:00Z"
  },
  {
    "title": "Faith Leaders Blast GOP's Attacks on Poor and Tax Cuts for the Rich",
    "description": "Leaders from various faiths came together in Washington, D.C. on Christians' Ash Wednesday to share an \nopen letter and report calling out efforts by U.S. President Donald Trump's administration and Republicans in Congress to rip resources away from the worki…",
    "link": "https://www.commondreams.org/news/trump-tax-cuts-2025",
    "timestamp": "2025-03-05T18:35:57Z"
  },
  {
    "title": "Trump Loves Our Military. He Just Hates Taking Care of Them",
    "description": "In his address to Congress, Trump said servicemembers “love being in our military again” — as he continued his attacks on veterans’ jobs and benefits",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-military-veterans-job-cuts-benefits-health-care-1235289413/",
    "timestamp": "2025-03-05T18:35:48Z"
  },
  {
    "title": "‘Good Luck Justin!’ Trump Mocks Trudeau After ‘Somewhat Friendly’ Call With Canadian Leader — Accuses Him of Using Trade War to ‘Stay in Power’",
    "description": "resident Donald Trump mocked Canadian Prime Minister Justin Trudeau after the two shared a \"'somewhat' friendly\" call on Wednesday.\nThe post ‘Good Luck Justin!’ Trump Mocks Trudeau After ‘Somewhat Friendly’ Call With Canadian Leader — Accuses Him of Using Tra…",
    "link": "https://www.mediaite.com/trump/good-luck-justin-trump-mocks-trudeau-after-somewhat-friendly-call-with-canadian-leader-accuses-him-of-using-trade-war-to-stay-in-power/",
    "timestamp": "2025-03-05T18:35:38Z"
  },
  {
    "title": "Florida Opens Probe Into Alleged Rapists Trump Let Into Country",
    "description": "Florida’s attorney general has launched an “active criminal investigation” into manosphere bigot Andrew Tate and his brother Tristan, who arrived in the country just last week at Donald Trump’s behest. \r\nThe brothers returned to the U.S. from Romania, where t…",
    "link": "https://newrepublic.com/post/192365/florida-investigation-andrew-tate-donald-trump",
    "timestamp": "2025-03-05T18:35:09Z"
  },
  {
    "title": "Trump Treasury confirms it's eyeing IRS for 'streamlining' shake-up as tax season heats up",
    "description": "The Trump administration's Treasury Department is considering a \"wide range\" of possibilities to streamline the tax agency, Fox News Digital learned.",
    "link": "https://www.foxnews.com/politics/trump-treasury-confirms-its-eyeing-irs-streamlining-shake-up-tax-season-heats-up",
    "timestamp": "2025-03-05T18:34:23Z"
  },
  {
    "title": "How Will Trump’s Tariffs Impact Healthcare? The Key Things To Know",
    "description": "What will be the impact of Trump's tariffs on healthcare? What will this mean for patients?  Where do we get our medical supplies from and who is going to pay the price?",
    "link": "https://www.forbes.com/sites/richardmenger/2025/03/05/how-will-trumps-tariffs-impact-healthcare-the-key-things-to-know/",
    "timestamp": "2025-03-05T18:34:14Z"
  },
  {
    "title": "At congressional address, Trump told Chief Justice Roberts he ‘won’t forget’",
    "description": "Among other Trump-friendly rulings, Chief Justice John Roberts authored last year’s decision that said former presidents enjoy broad immunity from criminal prosecution.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-speech-congress-thanked-supreme-court-john-roberts-rcna194892",
    "timestamp": "2025-03-05T18:33:13Z"
  },
  {
    "title": "Trudeau, Carney defend Canadians who boo American anthem as Joly says 'we're angry'",
    "description": "Poilievre said the focus should be on 'cheering on Canadians.' Meanwhile, Ford recently said, 'Boo the referee. Boo the players if you want. Do not boo the American national anthem'",
    "link": "https://nationalpost.com/news/politicians-on-canadians-booing-american-anthem",
    "timestamp": "2025-03-05T18:32:38Z"
  },
  {
    "title": "TikTok plans to cut up to 300 jobs at Dublin base, government told",
    "description": "TikTok is seeking to let hundreds of workers go from its base in Dublin, which employs 3,000 staff.",
    "link": "https://www.independent.ie/business/technology/tiktok-plans-to-cut-up-to-300-jobs-at-dublin-base-government-told/a386875685.html",
    "timestamp": "2025-03-05T18:32:35Z"
  },
  {
    "title": "'Going to be big': Car dealer warns major price increases coming thanks to Trump",
    "description": "President Donald Trump's tariffs are already causing consternation among car dealers, who are warning that blanket tariffs on all products from Mexico and Canada are going to massively jack up car prices for consumers.In an interview with the Washington Post,…",
    "link": "https://www.rawstory.com/trump-tariffs-2671274565/",
    "timestamp": "2025-03-05T18:32:18Z"
  },
  {
    "title": "‘The Best He’s Ever Done’: Speaker Johnson Praises Trump’s Address to Congress",
    "description": "House Speaker Mike Johnson found himself banging the gavel more than usual during President Donald Trump’s Tuesday address to Congress. But despite several Democrat disruptions,... Read More\nThe post ‘The Best He’s Ever Done’: Speaker Johnson Praises Trump’s …",
    "link": "https://www.dailysignal.com/2025/03/05/the-best-hes-ever-done-speaker-johnson-praises-trumps-address-to-congress/",
    "timestamp": "2025-03-05T18:30:36Z"
  },
  {
    "title": "Greenland’s PM breaks silence after Donald Trump says USA will take country ‘one way or another’",
    "description": "After Donald Trump said the USA would take Greenland 'one way or another', their prime minister responded",
    "link": "https://www.ladbible.com/news/us-news/greenland-pm-donald-trump-take-country-563470-20250305",
    "timestamp": "2025-03-05T18:30:35Z"
  },
  {
    "title": "Sanders Calls Out Trump’s “Outrageous Lie” on Social Security in Scathing Speech",
    "description": "Trump is repeating lies about the crucial anti-poverty program to lay the groundwork for cuts, the senator said.",
    "link": "https://truthout.org/articles/sanders-calls-out-trumps-outrageous-lie-on-social-security-in-scathing-speech/",
    "timestamp": "2025-03-05T18:30:29Z"
  },
  {
    "title": "Panama president calls Trump's talk of 'reclaiming' the Panama Canal a lie",
    "description": "Panama President José Raúl Mulino has accused U.S. President Donald Trump of lying when Trump said in his address to Congress the night before that his administration was “reclaiming” the Panama Canal",
    "link": "https://abcnews.go.com/International/wireStory/panama-president-calls-trumps-talk-reclaiming-panama-canal-119475506",
    "timestamp": "2025-03-05T18:30:28Z"
  },
  {
    "title": "Trump-Powered Rally Triggers Heavy Dumping From XRP Whales, Here’s How Much",
    "description": "XRP’s price movement over the past two weeks has been characterized by sharp fluctuations that have kept traders on edge. The token briefly plunged below $2 before staging a rapid recovery that saw it climb as high as $2.8, all within just a few days.  This i…",
    "link": "https://bitcoinist.com/heavy-xrp-whales-dumping/",
    "timestamp": "2025-03-05T18:30:26Z"
  },
  {
    "title": "Trump says no one has heard of Lesotho. But Musk is trying to do business in the African nation",
    "description": "U.S. President Donald Trump says no one has ever heard of Lesotho",
    "link": "https://abcnews.go.com/International/wireStory/trump-heard-lesotho-musk-business-african-nation-119482065",
    "timestamp": "2025-03-05T18:30:20Z"
  },
  {
    "title": "Trump: It’s Time To End The “Senseless” Ukraine Conflict",
    "description": "United States ruler, President Donald Trump has confirmed that he is determined to stop the bloodshed in Ukraine. He vowed to broker a ceasefire agreement between Ukraine and Russia, hopefully putting an end to the \"senseless\" and ongoing war.",
    "link": "https://www.shtfplan.com/headline-news/trump-its-time-to-end-the-senseless-ukraine-conflict",
    "timestamp": "2025-03-05T18:30:07Z"
  },
  {
    "title": "Sensex surges over 900 points; regains 73k-level in afternoon trade",
    "description": "MUMBAI, March 5: Equity benchmark index Sensex reclaimed the crucial 73,000-mark by jumping over 900 points, and the Nifty was trading above the 22,000 level in afternoon trade on a flurry of buying by investors amid a strong rally in Asian markets. Moreover,…",
    "link": "https://thehillstimes.in/business/sensex-surges-over-900-points-regains-73k-level-in-afternoon-trade",
    "timestamp": "2025-03-05T18:30:00Z"
  },
  {
    "title": "A running list of Trump's executive orders",
    "description": "Donald Trump started his second presidential term with a tornado of executive actions that affect everything from the environment to immigration.",
    "link": "https://www.snopes.com//tracker/trump-executive-orders-list/",
    "timestamp": "2025-03-05T18:29:00Z"
  },
  {
    "title": "Nolte: Disney Slashes 6% of Staff, Shutters 538 Site -- Another Leftist Propaganda Outlet Goes Down!",
    "description": "More layoffs have hit the Disney Grooming Syndicate, a wipe out of about 200 jobs, which represents six percent of the staff in two major divisions. | Entertainment More layoffs have hit the Disney Grooming Syndicate, a wipe out of about 200 jobs, which repre…",
    "link": "https://www.breitbart.com/entertainment/2025/03/05/nolte-disney-slashes-6-of-staff-shutters-538-site-another-leftist-propaganda-outlet-goes-down/",
    "timestamp": "2025-03-05T18:28:52Z"
  },
  {
    "title": "Trump tells Trudeau that Canadian efforts to curb fentanyl flow not good enough",
    "description": "President Trump expressed his dissatisfaction to Canadian Prime Minister Trudeau regarding Ottawa's efforts to stop the flow of fentanyl into the U.S. Trump emphasized the high death toll from fentanyl coming through Canada and Mexico and called for more effe…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tells-trudeau-that-canadian-efforts-to-curb-fentanyl-flow-not-good-enough/articleshow/118742332.cms",
    "timestamp": "2025-03-05T18:28:41Z"
  },
  {
    "title": "Panama President Mulino: Trump's Canal Remarks Are an 'Affront to the Truth and Our Dignity as a Nation'",
    "description": "President of Panama José Raúl Mulino on Wednesday morning accused President Donald Trump of \"lying again\" after Trump reiterated his call to take back control of the Panama Canal in a speech to a joint session of Congress on Tuesday night.\nThe post Panama Pre…",
    "link": "https://www.breitbart.com/latin-america/2025/03/05/panama-calls-trump-canal-remark-in-congress-speech-an-affront-to-the-truth/",
    "timestamp": "2025-03-05T18:27:46Z"
  },
  {
    "title": "U.S. is not currently sharing intelligence with Ukraine, American officials confirm",
    "description": "The U.S. has cut off intelligence-sharing with Kyiv, two American officials said, in a move that could seriously hamper the Ukrainian military's ability to target Russian forces.",
    "link": "https://www.cbc.ca/news/world/us-ukraine-intelligence-sharing-1.7475319",
    "timestamp": "2025-03-05T18:27:45Z"
  },
  {
    "title": "U.S. is not currently sharing intelligence with Ukraine, American officials confirm",
    "description": "The U.S. has cut off intelligence-sharing with Kyiv, two American officials said, in a move that could seriously hamper the Ukrainian military's ability to target Russian forces.",
    "link": "https://www.cbc.ca/news/world/us-ukraine-intelligence-sharin-1.7475319",
    "timestamp": "2025-03-05T18:27:45Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Briefing",
    "description": "White House Press Secretary Karoline Leavitt addresses the media on Wednesday, March 5.\nThe post Watch Live: Karoline Leavitt Holds White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/05/watch-live-karoline-leavitt-holds-white-house-press-briefing-6/",
    "timestamp": "2025-03-05T18:27:14Z"
  },
  {
    "title": "Exclusive-Dealmaker Michael Grimes expected to lead new US sovereign wealth fund, sources say",
    "description": "By Milana Vinn and Alexandra Alper\nNEW YORK (Reuters) -Star technology investment banker Michael Grimes, who left Morgan Stanley to take up a senior role in the U.S. Commerce Department last month, is expected to lead the new U.S. sovereign wealth fund that w…",
    "link": "https://biztoc.com/x/a2b65a5223af62a9",
    "timestamp": "2025-03-05T18:26:12Z"
  },
  {
    "title": "Trump says Trudeau using tariffs to stay in power",
    "description": "United States President Donald Trump confirmed on Wednesday that he discussed tariffs with Canada's Prime Minister Justin Trudeau in a phone call, emphasizing that he realized that Trudeau \"is trying ...",
    "link": "https://biztoc.com/x/891827b5859324cd",
    "timestamp": "2025-03-05T18:26:05Z"
  },
  {
    "title": "The ‘Trump bump’ has effectively disappeared after tariffs spook Wall Street",
    "description": "The ‘Trump bump’ has effectively disappeared after tariffs spook Wall Street\nPresident Donald Trump defended his tariff policy in a join session of Congress on Tuesday.\nRicky Carioti/The Washington Post—Getty Images",
    "link": "https://biztoc.com/x/210d8f1f62df5abf",
    "timestamp": "2025-03-05T18:25:52Z"
  },
  {
    "title": "Supreme Court Rejects Trump on USAID Foreign-Aid Freeze",
    "description": "A divided US Supreme Court dealt a blow to President Donald Trump’s foreign-aid freeze, reinstating a lower court order that requires the quick disbursement of as much as $2 billion owed to contractors for already completed work.\nOver four dissents, the justi…",
    "link": "https://biztoc.com/x/ccc9f1e801c46af8",
    "timestamp": "2025-03-05T18:25:50Z"
  },
  {
    "title": "Canada 'ready and able' to join Ukraine peacekeeping force, defence minister says",
    "description": "Canada is prepared to contribute troops to Britain and France’s “coalition of the willing” peacekeeping force should there be a ceasefire in Ukraine, Defence Minister Bill Blair said Wednesday.",
    "link": "https://www.cbc.ca/news/politics/canada-ukraine-blair-troops-1.7475333",
    "timestamp": "2025-03-05T18:25:36Z"
  },
  {
    "title": "Rachel Maddow Fact Checks Trump’s Speech to Congress: ‘For the Record…’ | Video",
    "description": "\"That's not even scratching the surface of the things that need to be fact-checked there,\" the MSNBC host says after the president's Tuesday night address\nThe post Rachel Maddow Fact Checks Trump’s Speech to Congress: ‘For the Record…’ | Video appeared first …",
    "link": "https://www.thewrap.com/rachel-maddow-fact-checks-trump-speech-congress-msnbc/",
    "timestamp": "2025-03-05T18:25:31Z"
  },
  {
    "title": "Are US Banks Banned in Canada? What We Know About Trump's Claim",
    "description": "Read on to explore the truth behind President Trump's claims about U.S. banks being banned in Canada.",
    "link": "https://www.newsweek.com/are-us-banks-banned-operating-canada-trumps-claim-2040080",
    "timestamp": "2025-03-05T18:25:28Z"
  },
  {
    "title": "Italy Is Getting Cold Feet Over Deal to Use Musk’s Starlink",
    "description": "The Italian government is having growing doubts about closing a €1.5 billion ($1.6 billion) deal with Elon Musk’s Starlink in light of the US pullback from commitments to European security, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/italy-is-getting-cold-feet-over-deal-to-use-musks-starlink",
    "timestamp": "2025-03-05T18:25:27Z"
  },
  {
    "title": "GOP tax leader promises Trump a bill with no tax on tips, overtime. Here’s his aggressive timeline.",
    "description": "A GOP package aims to extend the 2017 Trump tax cuts and include new breaks for seniors and Americans who rely on tips and overtime pay.",
    "link": "https://www.marketwatch.com/story/gop-tax-leader-promises-trump-a-bill-with-no-tax-on-tips-overtime-heres-his-aggressive-timeline-86974560",
    "timestamp": "2025-03-05T18:25:00Z"
  },
  {
    "title": "Trump Agency Pulls 443 Sites Off Market in Real Estate Reversal (Gregory Korte/Bloomberg)",
    "description": "Gregory Korte / Bloomberg:\nTrump Agency Pulls 443 Sites Off Market in Real Estate Reversal  —  The Trump administration has reversed its decision to list nearly 80 million square feet of federal property for possible sale, another setback for President Donald…",
    "link": "https://www.memeorandum.com/250305/p80",
    "timestamp": "2025-03-05T18:25:00Z"
  },
  {
    "title": "Barack Obama Turned Down A Role In ‘Severance’ — But A Famous Actor Filled It Instead",
    "description": "We finally have answers about that voice behind the Severance building.",
    "link": "https://decider.com/2025/03/05/severance-obama-turned-down-role/",
    "timestamp": "2025-03-05T18:23:27Z"
  },
  {
    "title": "'Veterans will die': Critics attack Trump's new move to cut more than 80,000 VA staff",
    "description": "President Donald Trump's administration announced that it would cut over 80,000 employees from the Department of Veterans Affairs.\n\n“At the end of the day, it’s about getting us back to work, focused on the mission and that mission is the Veteran,” new VA Sec…",
    "link": "https://www.rawstory.com/veterans-affairs-budget-cuts/",
    "timestamp": "2025-03-05T18:22:53Z"
  },
  {
    "title": "Musk's DOGE terminates lease at Obama Presidential Library site",
    "description": "DOGE has terminated the lease at the Obama Presidential Library site, although it is unlikely to impact operations there since it is due to shutter later this year and move to Maryland.",
    "link": "https://www.foxnews.com/politics/musks-doge-terminates-lease-at-obama-presidential-library-site",
    "timestamp": "2025-03-05T18:22:40Z"
  },
  {
    "title": "Trump’s Speech Vowed a New “Golden Age,” But His Policies Drive Us Into the Dust",
    "description": "In his speech to Congress, Trump doubled down on the tariffs that economists say may trigger another Great Depression.",
    "link": "https://truthout.org/articles/trumps-speech-vowed-a-new-golden-age-but-his-policies-drive-us-into-the-dust/",
    "timestamp": "2025-03-05T18:19:37Z"
  },
  {
    "title": "What Trump’s $2 Billion Loss At the Supreme Court Really Tells Us",
    "description": "For this to be the outcome of the first huge clash between Trump and the Supreme Court in his second term is quite surprising and extraordinary.",
    "link": "https://slate.com/news-and-politics/2025/03/trump-supreme-court-loss-usaid-musk-john-roberts.html",
    "timestamp": "2025-03-05T18:19:16Z"
  },
  {
    "title": "This Pentagon Press Secretary Has a Long History of Bigoted and Xenophobic Posts",
    "description": "On Donald Trump’s first day in office, the Department of Defense announced a spate of hires, including 26-year-old Kingsley Wilson, who will serve as the Pentagon’s deputy press secretary. Wilson is the daughter of Steve Cortes, a longtime Trump advisor and r…",
    "link": "https://www.motherjones.com/politics/2025/03/kingsley-cortes-wilson-defense-department/",
    "timestamp": "2025-03-05T18:19:04Z"
  },
  {
    "title": "Political Number Cruncher FiveThirtyEight To Be Shuttered",
    "description": "The polling platform has been on a downturn since founder Nate Silver left and took his trademark statistical model with him in 2023.",
    "link": "https://www.huffpost.com/entry/538-polling-site-shutting-down_n_67c87910e4b006fc455c20a8",
    "timestamp": "2025-03-05T18:18:18Z"
  },
  {
    "title": "Wait, What Was Trump Lie-Babbling About Stacey Abrams Last Night?",
    "description": "Pfffft, you already know.",
    "link": "https://www.wonkette.com/p/wait-what-was-trump-lie-babbling",
    "timestamp": "2025-03-05T18:17:56Z"
  },
  {
    "title": "Premier Danielle Smith to announce Alberta's response to American tariffs",
    "description": "Premier Danielle Smith will speak today about how Alberta will respond to U.S. tariffs on Canadian exports, brought into effect on Tuesday by U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-tariffs-danielle-smith-1.7475364",
    "timestamp": "2025-03-05T18:17:44Z"
  },
  {
    "title": "Digg founder teams up with former Reddit rival to buy and revive website",
    "description": "Content aggregator Digg is making a comeback thanks to a partnership with rival and Reddit co-founder Alexis Ohanian.",
    "link": "https://www.cnbc.com/2025/03/05/alexis-ohanian-kevin-rose-team-up-to-buy-and-revive-digg.html",
    "timestamp": "2025-03-05T18:17:15Z"
  },
  {
    "title": "Illinois Gov. Pritzker warns 1 million may lose health care coverage if Medicaid funding cut - NewsBreak",
    "description": "Illinois Governor JB Pritzker has warned that up to a million residents of the state will lose health care coverage if funding for Medicaid is cut as part",
    "link": "https://www.newsbreak.com/share/3841821499333-illinois-gov-pritzker-warns-1-million-may-lose-health-care-coverage-if-medicaid-funding-cut?_f=app_share&amp;pd=03tlSldI&amp;lang=en_US&amp;send_time=1741198575&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v1%2Cns_push_exp_rt_bucketv12-v5&amp;s=i2",
    "timestamp": "2025-03-05T18:16:45Z"
  },
  {
    "title": "BlackRock's $23 Billion Panama Canal Deal: What We Know So Far",
    "description": "The deal will shift control of the pivotal Balboa and Cristobal ports along the waterway.",
    "link": "https://www.newsweek.com/blackrock-panama-canal-deal-what-we-know-2040093",
    "timestamp": "2025-03-05T18:16:35Z"
  },
  {
    "title": "CFTC and SEC confirm joint effort to tackle crypto regulation",
    "description": "Commodity Futures Trading Commission (CFTC) acting chair Caroline Pham revealed that the regulator is cooperating closely with the US Securities and Exchange Commission (SEC) on crypto-related matters. Pham made the statement during the Milken Institute’s “Fu…",
    "link": "https://cryptoslate.com/cftc-and-sec-confirm-joint-effort-to-tackle-crypto-regulation/",
    "timestamp": "2025-03-05T18:15:27Z"
  },
  {
    "title": "Trump Promised a Balanced Budget. Don't Believe It.",
    "description": "In light of one of the more outlandish claims that President Donald Trump made during Tuesday night's joint address to Congress, an important reminder:",
    "link": "https://reason.com/2025/03/05/trump-promised-a-balanced-budget-dont-believe-it/",
    "timestamp": "2025-03-05T18:15:23Z"
  },
  {
    "title": "In State of the Union Speech, Trump Touts Fossil Fuels and Critical Minerals Plan",
    "description": "In his State of the Union Speech, President Trump pushed fossil fuel extraction, a plan for developing critical minerals and an Alaska natural gas pipeline",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/03/05/trump-trumpets-energy-agenda-teases-minerals-plan-cw-00213002",
    "timestamp": "2025-03-05T18:15:00Z"
  },
  {
    "title": "'He barely talked about it': Experts shocked that Trump brushed off major election issue",
    "description": "CNN pundits were shocked to discover how little of President Donald Trump's address to Congress included the issues most important to the American people: inflation and the economy.\n\nInside Politics' Dana Bash produced a bubble graph to illustrate the amount …",
    "link": "https://www.rawstory.com/donald-trump-speech-2671274479/",
    "timestamp": "2025-03-05T18:14:56Z"
  },
  {
    "title": "If your insurance bills get more expensive soon, the Trump admin will likely be the reason",
    "description": "The new Secretary of Health and Human Services Robert F. Kennedy Jr., shakes hands with President Donald Trump after a swearing in ceremony in the Oval Office on Feb. 13, 2025.",
    "link": "https://biztoc.com/x/677a1fcd37998283",
    "timestamp": "2025-03-05T18:14:38Z"
  },
  {
    "title": "‘We’re going to get’ Greenland, Trump said in his address. Prime minister says island isn’t for sale",
    "description": "Múte Bourup Egede has a message for President Donald Trump: “Greenland is ours.”",
    "link": "https://biztoc.com/x/26137c8e0bde8b05",
    "timestamp": "2025-03-05T18:14:25Z"
  },
  {
    "title": "China sticks to an economic growth target of ‘around 5%’ despite a looming trade war with US",
    "description": "The target signals the government’s intention to try to stabilize growth in challenging economic times.",
    "link": "https://www.bostonherald.com/2025/03/05/china-congress-economic-growth/",
    "timestamp": "2025-03-05T18:13:22Z"
  },
  {
    "title": "DJ Daniel, 13-year-old cancer survivor, appointed by Donald Trump to Secret Service",
    "description": "DJ Daniel was diagnosed with brain cancer in 2018. Doctors told the teen he had only five months to live. Despite this grim prognosis, DJ Daniel survived. When Donald Trump mentioned this, Daniel's father lifted him up, and the members of the House of Represe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dj-daniel-13-year-old-cancer-survivor-appointed-by-donald-trump-to-secret-service/articleshow/118741957.cms",
    "timestamp": "2025-03-05T18:12:23Z"
  },
  {
    "title": "Republican, independent voters loved pushback after Al Green disrupted Trump speech",
    "description": "GOP and independent viewers of President Donald Trump's address to Congress had a positive reaction to the pushback after Texas Rep. Al Green's disruption, a focus group found.",
    "link": "https://www.foxnews.com/politics/republican-independent-voters-loved-pushback-after-al-green-disrupted-trump-speech",
    "timestamp": "2025-03-05T18:11:32Z"
  },
  {
    "title": "Are we really getting a government shutdown this time?",
    "description": "Democrats rebel against budget cuts by Trump, Musk",
    "link": "https://theweek.com/politics/government-shutdown-democrats-budget-cuts-musk",
    "timestamp": "2025-03-05T18:11:24Z"
  },
  {
    "title": "Elon Musk Wants SpaceX To Fix Air Traffic Control. Here’s Why It Won’t Work.",
    "description": "Satellite service Starlink doesn’t have the capabilities to be the FAA’s comms backbone. Trump officials may take a $2.4B contract from Verizon and give it to Musk’s company anyway.",
    "link": "https://www.forbes.com/sites/jeremybogaisky/2025/03/05/elon-musk-spacex-faa-verizon/",
    "timestamp": "2025-03-05T18:10:06Z"
  },
  {
    "title": "Trump administration moves to drop Idaho emergency abortion case with national implications (Associated Press)",
    "description": "Associated Press:\nTrump administration moves to drop Idaho emergency abortion case with national implications  —  The Trump administration on Wednesday moved to drop an emergency abortion case in Idaho in one of its first moves on the issue since President Do…",
    "link": "https://www.memeorandum.com/250305/p77",
    "timestamp": "2025-03-05T18:10:01Z"
  },
  {
    "title": "Democratic mayors defend sanctuary cities in heated debate",
    "description": "Republicans accuse the mayors of putting their cities in danger and undermining President Donald Trump’s mass deportation efforts.",
    "link": "https://www.wlwt.com/article/democratic-mayors-defend-sanctuary-cities/64054113",
    "timestamp": "2025-03-05T18:08:37Z"
  },
  {
    "title": "Trump’s Tariffs Are About Securing America’s Future — And No Price Is Too High To Pay For It",
    "description": "Protecting our nation's safety and sovereignty is not an economic disaster. It's a patriotic duty.",
    "link": "https://thefederalist.com/2025/03/05/trumps-tariffs-are-about-securing-americas-future-and-no-price-is-too-high-to-pay-for-it/",
    "timestamp": "2025-03-05T18:08:23Z"
  },
  {
    "title": "Lawyers use Trump's speech before Congress in suit against DOGE",
    "description": "The president said Elon Musk heads the group that has slashed federal jobs.",
    "link": "https://abcnews.go.com/Politics/lawyers-trumps-speech-congress-suit-doge/story?id=119477540",
    "timestamp": "2025-03-05T18:08:22Z"
  },
  {
    "title": "Elon Musk’s actions leading to incidents of arson and vandalism against Tesla vehicles? Here’s the truth",
    "description": "A suspected arson attack at a Tesla Supercharger station in Massachusetts is being investigated by authorities as a case of anti-Tesla vandalism that is sweeping the United States. Protesters angry at Elon Musk's increasing political influence have vandalised…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-actions-leading-to-incidents-of-arson-and-vandalism-against-tesla-vehicles-heres-the-truth/articleshow/118741889.cms",
    "timestamp": "2025-03-05T18:08:17Z"
  },
  {
    "title": "Zelenskiy hails 'positive movement' in relations with US",
    "description": "KYIV (Reuters) - Ukrainian President Volodymyr Zelenskiy said on Wednesday there had been \"positive movement\" in cooperation with the United States that could lead to another meeting between the two sides soon. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/06/zelenskiy-hails-039positive-movement039-in-relations-with-us",
    "timestamp": "2025-03-05T18:07:00Z"
  },
  {
    "title": "‘We’re going to get’ Greenland, Trump said in his address. Prime minister says island isn’t for sale",
    "description": "Múte Bourup Egede has a message for President Donald Trump: “Greenland is ours.”",
    "link": "https://www.pbs.org/newshour/world/were-going-to-get-greenland-trump-said-in-his-address-prime-minister-says-island-isnt-for-sale",
    "timestamp": "2025-03-05T18:06:49Z"
  },
  {
    "title": "Why Some Shoppers Are Launching a 40-Day Target Boycott",
    "description": "Target is one of several major retailers that are facing a flurry of attacks from progressive shoppers.",
    "link": "https://time.com/7264850/40-day-target-boycott-explained/",
    "timestamp": "2025-03-05T18:06:33Z"
  },
  {
    "title": "Greenland's prime minister says island isn't for sale as Trump seeks control 'one way or the other'",
    "description": "Greenland’s prime minister has a message for President Donald Trump: “Greenland is ours.”",
    "link": "https://abcnews.go.com/Business/wireStory/greenlands-prime-minister-island-sale-trump-seeks-control-119479899",
    "timestamp": "2025-03-05T18:06:16Z"
  },
  {
    "title": "Jewellery exporters jittery over reciprocal US tariffs",
    "description": "Jewellery exports from Mumbai's SEEPZ face a potential setback due to US President Trump's proposed reciprocal tariffs, which could significantly impact India's $10 billion annual exports to the US. SEEPZ accounts for 85% of India's diamond-studded jewellery …",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/jewellery-exporters-jittery-over-reciprocal-us-tariffs/articleshow/118741884.cms",
    "timestamp": "2025-03-05T18:05:48Z"
  },
  {
    "title": "Dueling Al Green censure efforts stir frustrations within GOP as Republicans demand consequences",
    "description": "There are three different resolutions circulating to punish Rep. Al Green for repeatedly protesting President Donald Trump's joint address to Congress.",
    "link": "https://www.foxnews.com/politics/dueling-al-green-censure-efforts-stir-frustrations-within-gop-republicans-demand-consequences",
    "timestamp": "2025-03-05T18:05:29Z"
  },
  {
    "title": "As Idaho Pushes to Reform Its Coroner System, Counties Seek to Make It Less Transparent",
    "description": "by Audrey Dutton \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.\n\n \n\n \n\n \n \n\n\n\n \nIdaho lawmaker…",
    "link": "https://www.propublica.org/article/idaho-coroners-system-reform-bill",
    "timestamp": "2025-03-05T18:05:00Z"
  },
  {
    "title": "CHKD provides updates amid changes on gender-affirming care access",
    "description": "CHKD said they will work directly with patients impacted by the changes in availability for gender-affirming care, according to a recent release.",
    "link": "https://www.wtkr.com/news/health/chkd-provides-updates-amid-changes-on-gender-affirming-care-access",
    "timestamp": "2025-03-05T18:04:21Z"
  },
  {
    "title": "Did Vladimir Putin Just Have the Best Month of His 25 Years in Power?",
    "description": "To hear President Donald Trump tell it, the United States has never been more prosperous than now, six weeks into his presidency. In Trump's view, the economy is soaring, U.S. allies are finally stepping up and its foes are shrinking in the face of his \"Ameri…",
    "link": "https://biztoc.com/x/73d03ba3e47b8ab6",
    "timestamp": "2025-03-05T18:03:47Z"
  },
  {
    "title": "Trump's Ukraine Stance Chips Away at His GOP Support",
    "description": "Some Republican lawmakers are condemning President Donald Trump after his recent fallout with Ukrainian leader Volodymyr Zelensky and his decision to halt United States aid to the country.\nWhy It Matters\nTrump's stance on Ukraine marks a significant shift in …",
    "link": "https://biztoc.com/x/3dff583f4076f439",
    "timestamp": "2025-03-05T18:03:27Z"
  }
]