[
  {
    "title": "America's Mad King (Peter Wehner/The Atlantic)",
    "description": "Peter Wehner / The Atlantic:\nAmerica's Mad King … Last monday, Donald Trump, seeking to fortify public support for his massive, across-the-board tariffs, posted: “The United States has a chance to do something that should have been done DECADES AGO.  Don't be…",
    "link": "https://www.memeorandum.com/250417/p126",
    "timestamp": "2025-04-17T21:45:00Z"
  },
  {
    "title": "Japan 'deeply concerned' about global economic fallout from Trump's trade tariffs: Kato",
    "description": "Japan is &quot;deeply concerned&quot; about global economic fallout from U.S. President Donald Trump's trade tariffs, Finance Minister Katsunobu Kato said on Thursday in the government's strongest warning yet as the two nations began trade talks. In an interv…",
    "link": "https://japantoday.com/category/politics/exclusive-japan-finance-minister-%27deeply-concerned%27-over-trump-tariff-impact",
    "timestamp": "2025-04-17T21:44:09Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s 'termination cannot come fast enough'",
    "description": "President Donald Trump slammed Federal Reserve Chair Jerome Powell on Thursday, reiterating his frustration that the Fed has not aggressively cut interest rates and saying that the central bank leader's &quot;termination cannot come fast enough.” Trump hinted…",
    "link": "https://japantoday.com/category/world/trump-says-federal-reserve-chair-powell%E2%80%99s-%27termination-cannot-come-fast-enough%27",
    "timestamp": "2025-04-17T21:43:42Z"
  },
  {
    "title": "Donald Trump suggests UK state visit set for September",
    "description": "Earlier this year, King Charles III invited Donald Trump for an unprecedented second state visit.",
    "link": "https://www.bbc.co.uk/news/articles/cp8k5n33y41o",
    "timestamp": "2025-04-17T21:43:26Z"
  },
  {
    "title": "Trump suggests UK state visit set for September",
    "description": "Earlier this year, King Charles III invited Donald Trump for an unprecedented second state visit.",
    "link": "https://www.bbc.com/news/articles/cp8k5n33y41o",
    "timestamp": "2025-04-17T21:43:26Z"
  },
  {
    "title": "Supreme Court to hear Trump bid to enforce birthright citizenship order",
    "description": "The U.S. Supreme Court said on Thursday it will hear arguments next month over Donald Trump's bid to broadly enforce his executive order to restrict automatic birthright citizenship, a key pillar of the Republican president's hardline approach toward immigrat…",
    "link": "https://japantoday.com/category/world/us-supreme-court-to-hear-trump-bid-to-enforce-birthright-citizenship-order",
    "timestamp": "2025-04-17T21:43:13Z"
  },
  {
    "title": "Judges warn Trump risks public perception of lawlessness in his fight with courts",
    "description": "A U.S. appeals court urged the Trump administration on Thursday to back off from its escalating confrontation with the judiciary, warning that both the executive and judicial branches risk losing public confidence. In a strongly worded unanimous opinion, a th…",
    "link": "https://japantoday.com/category/world/judges-warn-trump-risks-public-perception-of-lawlessness-in-his-fight-with-courts2",
    "timestamp": "2025-04-17T21:42:58Z"
  },
  {
    "title": "Russia strikes Ukrainian city of Dnipro as Kyiv seeks security pledges in Paris",
    "description": "Russian forces launched a massive drone attack on the southeastern Ukrainian city of Dnipro, killing three people, including a child, and wounding dozens, officials said Thursday. The strike late Wednesday was the latest in a string of Russian attacks that ha…",
    "link": "https://japantoday.com/category/world/russia-strikes-ukrainian-city-of-dnipro-as-kyiv-seeks-security-pledges-in-paris",
    "timestamp": "2025-04-17T21:42:51Z"
  },
  {
    "title": "US manufacturing surge: Foxconn's NAM board role amplifies strategic ambitions",
    "description": "US President Donald Trump has introduced a series of policies designed to revitalize American manufacturing and attract industries such as semiconductors to return to the US. While Taiwanese manufacturers have long pursued global diversification, recent polic…",
    "link": "https://www.digitimes.com/news/a20250416PD216/foxconn-usa-manufacturing-policy.html",
    "timestamp": "2025-04-17T21:42:37Z"
  },
  {
    "title": "Trump says he's in 'no rush' to end tariffs as he meets with Italy's Meloni",
    "description": "President Donald Trump said Thursday he is in “no rush” to reach any trade deals because he views tariffs as making the United States wealthy. But he suggested while meeting with Italian Premier Giorgia Meloni that it would be easy to find an agreement with t…",
    "link": "https://japantoday.com/category/world/Trump-says-he%27s-in-%27no-rush%27-to-end-tariffs-as-he-meets-with-Italy%27s-Meloni",
    "timestamp": "2025-04-17T21:42:24Z"
  },
  {
    "title": "2 killed, at least 6 wounded in shooting at Florida State University",
    "description": "A gunman opened fire Thursday at Florida State University, killing two people and wounded at least six others, police said. The 20-year-old gunman is the son of a sheriff’s deputy whose former service weapon was used in the shooting, authorities said. The two…",
    "link": "https://japantoday.com/category/world/2-killed-at-least-6-wounded-in-shooting-at-Florida-State-University",
    "timestamp": "2025-04-17T21:42:16Z"
  },
  {
    "title": "Trump Says Set To Visit UK's King Charles in September",
    "description": "US President Donald Trump said Thursday he expected to meet King Charles III in Britain in September, on an unprecedented second state visit that London hopes will boost transatlantic ties.",
    "link": "https://www.ndtv.com/world-news/trump-says-set-to-visit-uks-king-charles-in-september-8191752",
    "timestamp": "2025-04-17T21:42:10Z"
  },
  {
    "title": "‘We’re all afraid’: Sen. Lisa Murkowski says GOP fears retaliation if they cross Trump",
    "description": "Moderate Alaska Sen. Lisa Murkowski made a chilling admission this week that she and other lawmakers are worried are retaliation for speaking out against some of the Trump administration's policies.",
    "link": "https://nypost.com/2025/04/17/us-news/were-all-afraid-sen-lisa-murkowski-says-gop-fears-retaliation-if-they-cross-trump/",
    "timestamp": "2025-04-17T21:42:04Z"
  },
  {
    "title": "Science caught in crossfire of Trump's fight with universities",
    "description": "Harvard scientist Dr. Donald Ingber, who works where medicine and engineering meet, saw federal funding for some of his projects frozen this week as his university clashed with the administration of U.S. President Donald Trump. While Trump and his advisers po…",
    "link": "https://japantoday.com/category/features/opinions/science-caught-in-crossfire-of-trump%27s-fight-with-universities",
    "timestamp": "2025-04-17T21:39:20Z"
  },
  {
    "title": "2 killed, at least 5 wounded in mass shooting at Florida State University",
    "description": "The 20-year-old gunman was the son of a sheriff's deputy whose former service weapon was used in the shooting, authorities said.",
    "link": "https://www.cbc.ca/news/world/florida-state-shooting-1.7513544",
    "timestamp": "2025-04-17T21:39:01Z"
  },
  {
    "title": "Denver’s investment in the new soccer stadium will help South Broadway (Letters)",
    "description": "\"We’re thrilled the team is spending its own money on a stadium. But we do expect the city to invest to get this right too, and ensure the site is connected to the surrounding area for a year-round attraction.\" -- Victor Ayala, Denver",
    "link": "https://www.denverpost.com/2025/04/17/denver-womens-soccer-stadium-nwsl-neighborhood/",
    "timestamp": "2025-04-17T21:38:03Z"
  },
  {
    "title": "About $300 million in Trump meme coins unlock Thursday — with the crypto down 90% from its all-time high",
    "description": "President Donald Trump’s namesake meme coin traded lower on Thursday, when 40 million of the tokens — recently worth about $300 million — are scheduled to be unlocked, giving the owners of the cryptocurrency the ability to sell it for the first time since it …",
    "link": "https://biztoc.com/x/55f2f99b71a2b584",
    "timestamp": "2025-04-17T21:37:58Z"
  },
  {
    "title": "Trump Station? Feds take control of Penn Station rebuild, kick MTA off the project",
    "description": "President Donald Trump is taking over the reconstruction of Penn Station and kicking the MTA off the project, federal transportation officials announced Thursday.\nThe move was laid out in a letter to MTA Chair Janno Lieber from Federal Railroad Administration…",
    "link": "https://biztoc.com/x/53b431dd7b80051c",
    "timestamp": "2025-04-17T21:37:39Z"
  },
  {
    "title": "EXCLUSIVE: Trump’s Broad Ban On Risky Gain-Of-Function Research Nears Completion",
    "description": "'If not stopped, gain-of-function research on potential pandemic pathogens likely will cause future lab-generated pandemics'",
    "link": "https://dailycaller.com/2025/04/17/trump-executive-order-broad-ban-gain-of-function-research/",
    "timestamp": "2025-04-17T21:33:01Z"
  },
  {
    "title": "Trump says US ‘talking’ to China on tariffs",
    "description": "President Donald Trump said Thursday that the United States was in talks with China on tariffs, adding that he was confident the world’s largest economies could make a deal to end a bitter trade war. “Yeah, we’re talking to China,” Trump told reporters in the…",
    "link": "https://www.digitaljournal.com/world/trump-says-us-talking-to-china-on-tariffs/article",
    "timestamp": "2025-04-17T21:32:34Z"
  },
  {
    "title": "Trump Distances Himself From Abrego Garcia’s Imprisonment: ‘I’m Not Involved In It’",
    "description": "“Well, I'm not involved in it... I've heard many things about him, and we'll have to find out what the truth is,” Trump told reporters\nThe post Trump Distances Himself From Abrego Garcia’s Imprisonment: ‘I’m Not Involved In It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-distances-his-himself-from-abrego-garcias-imprisonment-im-not-involved-in-it/",
    "timestamp": "2025-04-17T21:32:31Z"
  },
  {
    "title": "Can the IRS revoke Harvard’s tax-exempt status?",
    "description": "For over a century, the majority of colleges and universities have not paid most taxes.",
    "link": "https://www.bostonherald.com/2025/04/17/irs-harvard-tax-exempt-status/",
    "timestamp": "2025-04-17T21:32:11Z"
  },
  {
    "title": "Italy's Meloni says Trump will visit Rome and consider meeting EU",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump has agreed to an official visit to Rome and will consider also meeting representatives of the European Union while there, Italy's Prime Minister Giorgia Meloni said on Thursday in the Oval Office. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/18/italy039s-meloni-says-trump-will-visit-rome-and-consider-meeting-eu",
    "timestamp": "2025-04-17T21:32:00Z"
  },
  {
    "title": "Biden’s Social Security Spin",
    "description": "In his first speech since leaving office, former President Joe Biden criticized the Trump administration's staffing cuts and other changes at the Social Security Administration, but he made several misleading claims in the process.\nThe post Biden’s Social Sec…",
    "link": "https://www.factcheck.org/2025/04/bidens-social-security-spin/",
    "timestamp": "2025-04-17T21:31:55Z"
  },
  {
    "title": "Kimmel Jokes Elon Musk Loves Having Babies So Much, He Spent $300 Million to Get One in the White House | Video",
    "description": "The late night host riffs on rumors that the tech billionaire has fathered dozens of unknown children\nThe post Kimmel Jokes Elon Musk Loves Having Babies So Much, He Spent $300 Million to Get One in the White House | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/kimmel-elon-musk-baby-rumors-trump-white-house-joke-abc/",
    "timestamp": "2025-04-17T21:31:13Z"
  },
  {
    "title": "Trump Station? Feds take control of Penn Station rebuild, kick MTA off the project",
    "description": "The Trump administration is taking control of the Penn Station reconstruction.\n \n\nThe reconstruction of the troubled Midtown train hub will be led by the federal government, not the state-run MTA, the Trump administration announced Thursday. [ more › ]",
    "link": "https://gothamist.com/news/trump-station-feds-take-control-of-penn-station-rebuild-kick-mta-off-the-project",
    "timestamp": "2025-04-17T21:31:00Z"
  },
  {
    "title": "Ukraine and the US sign 'memorandum of intent' on minerals deal",
    "description": "The deal will give the US royalty payments on profits from Ukrainian mining of resources and rare minerals.",
    "link": "https://www.thejournal.ie/ukraine-and-us-sign-minerals-deal-6681787-Apr2025/",
    "timestamp": "2025-04-17T21:30:39Z"
  },
  {
    "title": "‘The Gun Doesn’t Do the Shooting’: Trump Says ‘I Have an Obligation To Protect the 2nd Amendment’ After FSU Killings",
    "description": "President Donald Trump said the firearm used in Thursday’s mass shooting at Florida State University is not responsible for the deadly rampage, and he vowed to defend the Second Amendment. Two people were killed at least six were wounded. Police say 20-year-o…",
    "link": "https://www.mediaite.com/trump/the-gun-doesnt-do-the-shooting-trump-says-i-have-an-obligation-to-protect-the-2nd-amendment-after-fsu-killings/",
    "timestamp": "2025-04-17T21:30:37Z"
  },
  {
    "title": "Europe, You Can’t Sit on the Sidelines Anymore",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Europe, You Can’t Sit on the Sidelines Anymore appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/04/17/europe-you-cant-sit-on-the-sidelines-anymore/",
    "timestamp": "2025-04-17T21:30:00Z"
  },
  {
    "title": "Trump rips into Fed Chair Jerome Powell for not lowering interest rates and suggests he'll be fired soon",
    "description": "President Donald Trump took shots at the chair of the Federal Reserve after his comments appeared to lead to a drop in the stock market. Trump lambasted Jerome Powell for announcing Wednesday that the Fed would not be cutting interest rates because of signs o…",
    "link": "https://www.theblaze.com/news/trump-fed-chair-powell-fire",
    "timestamp": "2025-04-17T21:30:00Z"
  },
  {
    "title": "Trump's tariffs leave China's neighbours with an impossible choice",
    "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
    "link": "https://www.bbc.com/news/articles/c0455k6g71eo",
    "timestamp": "2025-04-17T21:29:36Z"
  },
  {
    "title": "Sneak attack: How biased Wikipedia twisted the truth about JD Vance",
    "description": "New report details how Wikipedia's leftist editors launched a massive smear campaign against JD Vance — while Donald Trump was choosing a running mate.",
    "link": "https://nypost.com/2025/04/17/opinion/how-bias-wikipedia-twisted-the-truth-about-jd-vance/",
    "timestamp": "2025-04-17T21:28:51Z"
  },
  {
    "title": "What We Know About the Kilmar Abrego Garcia Deportation Fiasco",
    "description": "The Trump administration mistakenly deported Kilmar Abrego Garcia to El Salvador. Now, it’s refusing to bring him back. Here’s everything we know about the fiasco.",
    "link": "http://www.thecut.com/article/the-kilmar-abrego-garcia-deportation-fiasco-explained.html",
    "timestamp": "2025-04-17T21:27:47Z"
  },
  {
    "title": "Can Trump Fire Jerome Powell?",
    "description": "Legally, the answer is complicated and untested. No Fed chair has ever been removed by a President.",
    "link": "https://time.com/7278723/can-fed-chair-powell-be-fired/",
    "timestamp": "2025-04-17T21:26:40Z"
  },
  {
    "title": "Meloni Invites Trump to Italy for EU Trade Talks",
    "description": "President Donald Trump said during a meeting with Italian Prime Minister Giorgia Meloni that he expects to reach a trade deal with the European Union, but indicated he is in no hurry to finalize an agreement to reduce tariffs.\nMeloni said she aimed to invite …",
    "link": "https://biztoc.com/x/72a214fa4309e553",
    "timestamp": "2025-04-17T21:26:21Z"
  },
  {
    "title": "Leaders’ debate: Tariffs and threats to Canada first theme of the night",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/leaders-debate-tariffs-and-threats-to-canada-first-theme-of-the-night-9.6728142",
    "timestamp": "2025-04-17T21:26:15Z"
  },
  {
    "title": "Tim Cook’s Relationship with Trump Helps Apple Avoid Tariff Impact",
    "description": "Apple CEO Tim Cook has once again managed to shield the company’s flagship products from steep U.S. tariffs, thanks to his ongoing relationship with President Donald Trump. \n\n\n\nAfter Trump announced a 145% tariff on goods imported from China, Cook began worki…",
    "link": "https://www.macobserver.com/news/tim-cooks-relationship-with-trump-helps-apple-avoid-tariff-impact/",
    "timestamp": "2025-04-17T21:26:07Z"
  },
  {
    "title": "US weapons left in Afghanistan sold to militant groups, sources tell BBC",
    "description": "Sources say half a million US weapons obtained by the Taliban have been lost, sold or smuggled to militant groups.",
    "link": "https://www.bbc.com/news/articles/cr78nkg548lo",
    "timestamp": "2025-04-17T21:24:59Z"
  },
  {
    "title": "Roman Reigns Is Getting Superman Punched On X After Admitting He Voted For Donald Trump In ‘Vanity Fair’ Interview",
    "description": "Say it ain't so, tribal chief, say ain't it so. WWE fans are disappointed after Roman Reigns revealed he supported Donald Trump over Kamala Harris in a new Vanity Fair interview.",
    "link": "https://hiphopwired.com/playlist/wwe-roman-reigns-voted-for-donald-trump-vanity-fair-interview-reactions/",
    "timestamp": "2025-04-17T21:24:46Z"
  },
  {
    "title": "Trump Dodges on El Salvador Court Orders: ‘I’m Not Involved’",
    "description": "The president deflected questions about Kilmar Abrego Garcia in the Oval Office on Thursday, telling reporters to talk to the Justice Department",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-dodges-questions-court-order-el-salvador-deportations-1235320245/",
    "timestamp": "2025-04-17T21:24:33Z"
  },
  {
    "title": "Nearly 90% of Consumer Financial Protection Bureau cut as as Trump's government downsizing continues",
    "description": "The Consumer Financial Protection Bureau is being downsized by President Donald Trump. Roughly 1,500 employees will be cut from the CFPB, leaving around 200 people, according to an administration official who wasn’t authorized to disclose the figure publicly …",
    "link": "https://www.seattlepi.com/news/politics/article/layoffs-hit-consumer-financial-protection-bureau-20281755.php",
    "timestamp": "2025-04-17T21:24:26Z"
  },
  {
    "title": "US: 2 killed in shooting at Florida State University",
    "description": "The suspect who opened fire on the Florida University campus has been identified as the 20-year-old son of a local sheriff's deputy. He had access to his mother's weapons in the attack, according to police. The Florida State University (FSU) in Tallahassee wa…",
    "link": "https://www.dw.com/en/us-2-killed-in-shooting-at-florida-state-university/a-72279299",
    "timestamp": "2025-04-17T21:24:00Z"
  },
  {
    "title": "Student journalists wary of getting caught in crossfire as Trump targets universities",
    "description": "As the Trump administration in the U.S. threatens universities and detains student activists, a campus newspaper editor says students are thinking twice before speaking up.",
    "link": "https://www.cbc.ca/radio/asithappens/students-universities-israel-gaza-trump-administration-1.7513324",
    "timestamp": "2025-04-17T21:23:28Z"
  },
  {
    "title": "Steve Bannon Issues Warning Against Donald Trump's Tax Cuts for Wealthy",
    "description": "Bannon warned the tax cuts must be coupled with growth or spending cuts to avoid adding to the deficit.",
    "link": "https://www.newsweek.com/steve-bannon-warning-trump-tax-cuts-2061267",
    "timestamp": "2025-04-17T21:20:09Z"
  },
  {
    "title": "Donald Trump news: US President says he wants Jerome Powell ‘out of there’ as feud with Fed ignites",
    "description": "Federal Reserve Chair Jerome Powell says he has no intention of leaving his post before his tenure is up in May 2026 after Donald Trump said he wants him ‘out of there’.",
    "link": "https://thenightly.com.au/business/donald-trump-news-us-president-says-he-wants-jerome-powell-out-of-there-as-feud-with-fed-ignites-c-18411552",
    "timestamp": "2025-04-17T21:18:51Z"
  },
  {
    "title": "Shein and Temu Announce Price Hikes in Response to Donald Trump's Tariffs",
    "description": "The e-commerce giants plan to increase prices starting April 25, weeks after Trump announced his 'reciprocal' tariffs plan.",
    "link": "https://www.complex.com/style/a/joshua-espinoza/shein-temu-announce-price-hike-donald-trump-tariffs",
    "timestamp": "2025-04-17T21:18:23Z"
  },
  {
    "title": "Salvadoran Soldiers Stop US Senator Near Prison Holding Expelled Migrant",
    "description": "Salvadoran soldiers on Thursday barred a US senator who is in the country to seek the release of a man wrongfully deported by President Donald Trump's administration from visiting the prison where he is held.",
    "link": "https://www.ibtimes.com/salvadoran-soldiers-stop-us-senator-near-prison-holding-expelled-migrant-3770516",
    "timestamp": "2025-04-17T21:18:17Z"
  },
  {
    "title": "Zelensky Says ‘Good Progress’ on U.S.-Ukraine Minerals Deal",
    "description": "Ukrainian President Volodymyr Zelensky on Wednesday reported “good progress” on negotiations for a mineral rights deal between Ukraine and the United States.\nThe post Zelensky Says ‘Good Progress’ on U.S.-Ukraine Minerals Deal appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/17/zelensky-says-good-progress-on-u-s-ukraine-minerals-deal/",
    "timestamp": "2025-04-17T21:18:07Z"
  },
  {
    "title": "Ripple acquisition Hidden Road secures FINRA registration",
    "description": "Prime brokerage Hidden Road, which was recently acquired by Ripple for $1.25 billion, has secured a broker-dealer license from the Financial Industry Regulatory Authority (FINRA) — a move that enhances its capacity in the fixed-income markets. As a FINRA brok…",
    "link": "https://cointelegraph.com/news/ripple-acquisition-hidden-road-secures-finra-registration",
    "timestamp": "2025-04-17T21:17:06Z"
  },
  {
    "title": "'Prayers don't do much': FSU student calls out Trump and DeSantis after mass shooting",
    "description": "A Florida State University student told CNN that students like him need action on protecting their communities from guns — and for politicians who ignore the issue to take notice.\"I mean, prayers to you know, all my peers, the professors, the staff, the commu…",
    "link": "https://www.rawstory.com/fsu-shooting/",
    "timestamp": "2025-04-17T21:16:34Z"
  },
  {
    "title": "Alberta pauses some of its fight-back plan against the U.S. amid tariff dispute",
    "description": "Alberta Premier Danielle Smith's government is pausing the procurement policy it announced more than a month ago to fight U.S. President Donald Trump's tariffs.",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-pauses-some-of-its-fight-back-plan-against-the-u-s-amid-tariff-dispute-1.7513345",
    "timestamp": "2025-04-17T21:16:05Z"
  },
  {
    "title": "Trump: Nippon deal could be part of tariff talks with Japan",
    "description": "United States President Donald Trump said on Thursday that a Nippon deal could be a part of the tariff negotiations with Japan, although he is doubtful about it.\"I think we're going to view it separat...",
    "link": "https://biztoc.com/x/14e304484ab4eabb",
    "timestamp": "2025-04-17T21:15:48Z"
  },
  {
    "title": "In White House meeting, Italian prime minister vows to 'make the West great again'",
    "description": "Italian Prime Minister Giorgia Meloni wants to 'make the West great again,\" she said during a meeting with U.S. President Donald Trump at the White House on ...",
    "link": "https://www.upi.com/Top_News/US/2025/04/17/italys-meloni-voes-to-make-west-great-again/2881744923601/",
    "timestamp": "2025-04-17T21:15:19Z"
  },
  {
    "title": "Bernie Sanders’ private jet expenses fuel hypocrisy claims as he crosses the U.S. to ‘fight oligarchy’",
    "description": "Sen. Bernie Sanders (I-Vt.) is being called out by conservatives for spending almost a quarter-million dollars on private jets as he criss-crosses the country with Rep. Alexandria Ocasio-Cortez (D-N.Y.).\n\n\nThe two progressive lawmakers have been traveling aro…",
    "link": "https://www.dailydot.com/debug/bernie-sanders-private-jet-fight-oligarchy/",
    "timestamp": "2025-04-17T21:13:01Z"
  },
  {
    "title": "Salvadoran soldiers stop US senator near prison holding expelled migrant",
    "description": "Salvadoran soldiers on Thursday barred a US senator who is in the country to seek the release of a man wrongfully deported by President Donald Trump’s administration from visiting the prison where he is held. On the second day of his trip to El Salvador, Demo…",
    "link": "https://www.digitaljournal.com/world/salvadoran-soldiers-stop-us-senator-near-prison-holding-expelled-migrant/article",
    "timestamp": "2025-04-17T21:12:20Z"
  },
  {
    "title": "White House proposes eliminating Head Start funding as part of sweeping budget cuts",
    "description": "The Trump administration is asking Congress to eliminate the Head Start program, a move that would cut early education for some of the nation’s neediest children as part of drastic proposed cuts to federal health funding.",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/17/white-house-proposes-eliminating-head-start-funding-as-part-of-sweeping-budget-cuts/",
    "timestamp": "2025-04-17T21:11:43Z"
  },
  {
    "title": "Suspect in Florida State University shooting is son of sheriff’s deputy",
    "description": "Authorities say the 20-year-old gunman at Florida State University was the son of a sheriff’s deputy and the deputy’s service weapon was found at the scene.",
    "link": "https://www.wpxi.com/news/local/suspect-florida-state-university-shooting-is-son-sheriffs-deputy/DALRTJTYBVGFDLAG2AJIKAR2OQ/",
    "timestamp": "2025-04-17T21:11:36Z"
  },
  {
    "title": "Former Pentagon spokesman tied to online DEI purge was asked to resign, official says (Tara Copp/Associated Press)",
    "description": "Tara Copp / Associated Press:\nFormer Pentagon spokesman tied to online DEI purge was asked to resign, official says  —  Former Pentagon spokesman John Ullyot was asked to resign this week, a senior defense official told The Associated Press on Thursday, in th…",
    "link": "https://www.memeorandum.com/250417/p118",
    "timestamp": "2025-04-17T21:10:00Z"
  },
  {
    "title": "White House proposes eliminating Head Start funding as part of sweeping budget cuts",
    "description": "The Trump administration is asking Congress to eliminate the Head Start program, a move that would cut early education for some of the nation’s neediest children as part of drastic proposed cuts to federal health funding.",
    "link": "https://www.clickorlando.com/news/politics/2025/04/17/white-house-proposes-eliminating-head-start-funding-as-part-of-sweeping-budget-cuts/",
    "timestamp": "2025-04-17T21:08:42Z"
  },
  {
    "title": "The makers of TurboTax gave Trump’s inauguration $1 million. They just got their money’s worth.",
    "description": "The Associated Press reports that the Trump administration “plans to eliminate the IRS’ Direct File program\" – a major win for tax prep companies like Intuit.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-irs-direct-file-turbotax-economy-inauguration-rcna201749",
    "timestamp": "2025-04-17T21:06:21Z"
  },
  {
    "title": "Layoffs hit Consumer Financial Protection Bureau as Trump's government downsizing continues",
    "description": "President Donald Trump is drastically shrinking the size and the mission of the Consumer Financial Protection Bureau, the latest step in an extraordinary...",
    "link": "https://finance.yahoo.com/news/layoffs-hit-consumer-financial-protection-210610104.html",
    "timestamp": "2025-04-17T21:06:10Z"
  },
  {
    "title": "Trump officials' defiance over Abrego Garcia's deportation 'shocking': Appeals court",
    "description": "A federal appeals court says it is “shocking” that The Trump administration claims it can’t do anything to free Kilmar Abrego Garcia from an El Salvador prison and return him to the U.S.",
    "link": "https://www.wmur.com/article/trump-el-salvador-deportation-case-appeals-court-rebuke/64516117",
    "timestamp": "2025-04-17T21:05:49Z"
  },
  {
    "title": "Trump: I don't want tariffs to go higher",
    "description": "US President Donald Trump stated Thursday that he doesn't want to escalate tariffs or see further retaliation from China.He expressed concerns that higher tariffs would reduce consumer demand, saying,...",
    "link": "https://biztoc.com/x/3ac7a36c91af9c20",
    "timestamp": "2025-04-17T21:04:58Z"
  },
  {
    "title": "A 116-year-old law gifted Harvard and most universities with tax-exempt status. Can Trump actually revoke it?",
    "description": "For more than a century, the majority of colleges and universities have not paid most taxes. The Revenue Act of 1909 excused nonprofits operating “exclusively for religious, charitable, or educational purposes” in order to continue acting in the public intere…",
    "link": "https://biztoc.com/x/fac14e748e04d599",
    "timestamp": "2025-04-17T21:04:43Z"
  },
  {
    "title": "A Survey Suggests Most Americans Are Not Keen on Trump's Speech-Based Deportation Initiative",
    "description": "By trying to deport student activists he describes as antisemitic \"terrorist sympathizers,\" you might think, President Donald Trump is cannily choosing unpopular targets who are unlikely to attract much public support. But according to recent polling by the F…",
    "link": "https://biztoc.com/x/a2250d90c88a8653",
    "timestamp": "2025-04-17T21:04:29Z"
  },
  {
    "title": "Chinese Factories Have Entered The Tariff Chat",
    "description": "Fashion’s current business model, which relies heavily on low-cost offshore manufacturing, may hang in the balance — at least in America. As US President Trump charges forth with an aggressive tariff plan on goods coming into the US, neither consumers, brands…",
    "link": "https://hypebeast.com/2025/4/china-us-tariff-trade-war-trump-fashion-shein-temu-chinese-supplier-factory",
    "timestamp": "2025-04-17T21:03:23Z"
  },
  {
    "title": "Haitians face record hunger as gang violence grips country in throes of economic crisis",
    "description": "A new report has found that more than half of Haiti’s population is expected to experience severe hunger through June, and another 8,400 people living in makeshift shelters are projected to starve",
    "link": "https://abcnews.go.com/International/wireStory/haitians-face-record-hunger-gang-violence-grips-country-120925061",
    "timestamp": "2025-04-17T21:02:11Z"
  },
  {
    "title": "Trump officials' defiance over Abrego Garcia's deportation is 'shocking,' appeals court says",
    "description": "A federal appeals court says it is “shocking” that The Trump administration claims it can’t do anything to free Kilmar Abrego Garcia from an El Salvador prison and return him to the U.S. A three-judge panel from the 4th U.S. Circuit Court of Appeals on...",
    "link": "https://abcnews.go.com/US/wireStory/trump-officials-defiance-abrego-garcias-deportation-shocking-appeals-120921403",
    "timestamp": "2025-04-17T21:02:11Z"
  },
  {
    "title": "Trump Admin Pulls the Plug on Construction of New York’s Offshore Wind Projects",
    "description": "Interior Secretary Doug Burgum: “Further review of information that suggests the Biden administration rushed through its approval without sufficient analysis.”\nThe post Trump Admin Pulls the Plug on Construction of New York’s Offshore Wind Projects first appe…",
    "link": "https://legalinsurrection.com/2025/04/trump-admin-pulls-the-plug-on-construction-of-new-yorks-offshore-wind-project/",
    "timestamp": "2025-04-17T21:00:55Z"
  },
  {
    "title": "A Survey Suggests Most Americans Are Not Keen on Trump's Speech-Based Deportation Initiative",
    "description": "By trying to deport student activists he describes as antisemitic \"terrorist sympathizers,\" you might think, President Donald Trump is cannily choosing",
    "link": "https://reason.com/2025/04/17/a-survey-suggests-most-americans-are-not-keen-on-trumps-speech-based-deportation-initiative/",
    "timestamp": "2025-04-17T21:00:54Z"
  },
  {
    "title": "SUSPECT SON OF LOCAL DEPUTY... | | 20 YEAR OLD STUDENT...",
    "description": "THE gunman who allegedly opened fire at the student union building at Florida State University has been identified as the son of a sheriff’s deputy. Phoenix Ikner, a student at the university…",
    "link": "https://www.the-sun.com/news/14052786/florida-state-university-suspect-identified-phoenix-ikner/",
    "timestamp": "2025-04-17T21:00:03Z"
  },
  {
    "title": "Harvard Fights Back After Trump Pulls No Punches",
    "description": "Political schoolyard bullies take note.",
    "link": "https://slate.com/podcasts/political-gabfest/2025/04/politics-harvard-donald-trump-oversight-courts-constiution-college-tariffs-corruption",
    "timestamp": "2025-04-17T21:00:00Z"
  },
  {
    "title": "Rare Earth Dominance Puts China in Powerful Geopolitical Position",
    "description": "Their names are difficult to pronounce, they're essential for modern manufacturing, and they're increasingly at the center of the escalating trade war between the United States and China. The global supply of these rare earths -- an essential group of 17 elem…",
    "link": "https://oilprice.com/Metals/Commodities/Rare-Earth-Dominance-Puts-China-in-Powerful-Geopolitical-Position.html",
    "timestamp": "2025-04-17T21:00:00Z"
  },
  {
    "title": "Unpacking legal & political challenges to Trump's mass deportation plans",
    "description": "A federal judge ruled there is \"probable cause\" to find the Trump administration in contempt for violating an order last month to pause some deportations under the Alien Enemies Act. We discuss what happens next, as well as a new directive on how immigration …",
    "link": "https://www.npr.org/2025/04/17/1245273494/podcast-immigration",
    "timestamp": "2025-04-17T20:58:27Z"
  },
  {
    "title": "Scientists Discover Hints of Life On Distant Planet",
    "description": "The latest discovery has researchers tentatively excited, but proposed budget cuts to NASA could throw a wrench in any future investigations.",
    "link": "https://www.vanityfair.com/news/story/scientists-discover-hints-of-life-on-distant-planet",
    "timestamp": "2025-04-17T20:58:26Z"
  },
  {
    "title": "Real photo shows tied-up, stripped men in Salvadoran prison — just not the one receiving US deportees in 2025",
    "description": "A photograph authentically shows incarcerated men stripped of most clothing and tied together in CECOT, a Salvadoran prison.",
    "link": "https://www.snopes.com//fact-check/prison-salvadoran-us-deportees/",
    "timestamp": "2025-04-17T20:57:00Z"
  },
  {
    "title": "Trump Develops Plan to Pay Illegal Migrants to Self-Deport",
    "description": "President Donald Trump wants to help illegal migrants self-deport from the United States as some of his supporters complain about the slower-than-hoped pace of deportations and Democrats launch a massive resistance.\nThe post Trump Develops Plan to Pay Illegal…",
    "link": "https://www.breitbart.com/politics/2025/04/17/trump-plans-to-pay-migrants-to-self-deport/",
    "timestamp": "2025-04-17T20:56:35Z"
  },
  {
    "title": "Judges Smack Down Trump’s ‘Shocking’ and ‘Lawless’ Arguments in Abrego Garcia Case",
    "description": "An appeals court rejected the administration’s latest efforts to avoid bringing Kilmar Abrego Garcia back from El Salvador, as the Supreme Court demanded",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-abrego-garcia-el-salvador-judges-appeal-lawless-1235320216/",
    "timestamp": "2025-04-17T20:56:08Z"
  },
  {
    "title": "Trump Weaponizes Bureaucratic Review to Stop Offshore Wind Project",
    "description": "What happened to cutting red tape?",
    "link": "https://gizmodo.com/trump-weaponizes-bureaucratic-review-to-stop-offshore-wind-project-2000590921",
    "timestamp": "2025-04-17T20:55:56Z"
  },
  {
    "title": "After winning the Masters, Rory McIlroy could take an important step away from the United States because of his wife Erica Stoll",
    "description": "Rory McIlroy&apos;s triumph at the 2025 Masters was more than just a historic win. \n\nAfter finally capturing the elusive green jacket in his 17th attempt, McIlroy not only complete",
    "link": "https://www.marca.com/en/golf/2025/04/17/680161ad22601d85218b45ae.html",
    "timestamp": "2025-04-17T20:54:36Z"
  },
  {
    "title": "Can the IRS revoke Harvard's tax-exempt status?",
    "description": "For years, President Donald Trump has complained that colleges and universities are “indoctrinating” their students with “radical left” ideas and has said they should lose their tax-exempt status",
    "link": "https://abcnews.go.com/US/wireStory/irs-revoke-harvards-tax-exempt-status-120921578",
    "timestamp": "2025-04-17T20:54:27Z"
  },
  {
    "title": "Letitia James reaps what she sows after leveling 'laughable' case at Trump: expert",
    "description": "A federal housing agency sent a criminal referral to the Department of Justice Monday arguing New York Attorney General Letitia James appeared to have falsified mortgage records.",
    "link": "https://www.foxnews.com/politics/letitia-james-reaps-what-she-sows-after-leveling-laughable-case-trump-expert",
    "timestamp": "2025-04-17T20:53:53Z"
  },
  {
    "title": "Mary Trump Issues Warning About 'Only' Reason Donald Trump Created DOGE",
    "description": "DOGE, run by Elon Musk's allies, is under fire after a whistleblower said employees stole 10 GB of sensitive NLRB data.",
    "link": "https://biztoc.com/x/e62ebad7fbc50882",
    "timestamp": "2025-04-17T20:53:49Z"
  },
  {
    "title": "Republican Judge Issues Warning to Trump in Judicial Rebuke—'Lawlessness'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe 4th U.S. Circuit Court of Appeals rejected on Thursday an effort by President Donald Trump's administration to halt next steps in an ongoing legal saga involving the erroneous deportation of Kilmar Abrego …",
    "link": "https://biztoc.com/x/57cafd8771ad87e1",
    "timestamp": "2025-04-17T20:53:48Z"
  },
  {
    "title": "Trump: Nippon deal could part of tariff talks with Japan",
    "description": "United States President Donald Trump said on Thursday that a Nippon deal could be a part of the tariff negotiations with Japan, although he is doubtful.More to come......",
    "link": "https://biztoc.com/x/96fe25729dfdc906",
    "timestamp": "2025-04-17T20:53:43Z"
  },
  {
    "title": "Trump's Tariff Mania Shows the Folly of Central Planning",
    "description": "After the markets experienced a dramatic rebound last Wednesday, President Donald Trump praised himself for the historic financial upswing. That was the",
    "link": "https://reason.com/2025/04/18/trumps-tariff-mania-shows-why-central-planning-always-fails/",
    "timestamp": "2025-04-17T20:53:30Z"
  },
  {
    "title": "Republicans launch probe into top US university Harvard",
    "description": "Republicans in the US Congress announced an investigation into Harvard University on Thursday, accusing it of flouting civil rights law in an escalation of President Donald Trump's attacks on elite institutions.",
    "link": "https://www.channelnewsasia.com/world/republicans-launch-probe-top-us-university-harvard-5073141",
    "timestamp": "2025-04-17T20:52:00Z"
  },
  {
    "title": "Who Is FSU Shooting Suspect Phoenix Ikner? What We Know",
    "description": "Officials have identified Phoenix Ikner, the son of a Leon County deputy sheriff, as the suspect in the fatal FSU shooting.",
    "link": "https://www.newsweek.com/phoenix-ikner-fsu-shooting-suspect-what-we-know-2061249",
    "timestamp": "2025-04-17T20:51:34Z"
  },
  {
    "title": "Some of the world's most expensive bags are about to cost even more for Americans",
    "description": "Luxury products like Birkin bags are being impacted by trade tensions. Hermès announced plans to raise prices in the US to counteract tariff effects.",
    "link": "https://www.businessinsider.com/hermes-birkin-bags-price-hikes-americans-trump-tariffs-2025-4",
    "timestamp": "2025-04-17T20:51:03Z"
  },
  {
    "title": "SPACs Riding $4 Billion Wave as IPO Market Struggles",
    "description": "With the IPO market struggling, special purpose acquisition companies (SPACs) are enjoying a comeback. That’s according to a report Thursday (April 17) by Bloomberg News, which notes that the so-called “black check” industry has seen a busy year thus far, wit…",
    "link": "https://www.pymnts.com/spac/2025/spacs-riding-4-billion-wave-as-ipo-market-struggles/",
    "timestamp": "2025-04-17T20:50:40Z"
  },
  {
    "title": "Two dead in Florida university shooting, five people in hospital with gunshot wounds",
    "description": "Florida State University mass shooting suspect is in custody",
    "link": "https://www.irishtimes.com/world/us/2025/04/17/two-dead-in-florida-university-shooting-five-people-in-hospital-with-gunshot-wounds/",
    "timestamp": "2025-04-17T20:49:50Z"
  },
  {
    "title": "Republican Judge Issues Warning to Trump in Judicial Rebuke—'Lawlessness'",
    "description": "The Reagan-appointed judge said the Trump administration \"will lose much from a public perception of its lawlessness.\"",
    "link": "https://www.newsweek.com/republican-judge-issues-warning-trump-judicial-rebukelawlessness-2061269",
    "timestamp": "2025-04-17T20:48:32Z"
  }
]