[
  {
    "title": "Paramount Nominates 3 New Board Members Amid Trump Lawsuit, Pending Skydance Deal",
    "description": "Mary Boies, Roanne Sragow Licht, Charles Ryan will stand election at the media giant's annual meeting on July 2\nThe post Paramount Nominates 3 New Board Members Amid Trump Lawsuit, Pending Skydance Deal  appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-mary-boies-roanne-sragow-licht-charles-ryan-board-nominees/",
    "timestamp": "2025-06-02T21:36:14Z"
  },
  {
    "title": "Treasury Secretary confronts CBS host over past tariff inflation predictions as rates hit 4-year-low",
    "description": "CBS's Margaret Brennan challenged Scott Bessent on Trump's tariffs, as retail giants warn of price hikes despite inflation hitting a four-year low.",
    "link": "https://www.foxnews.com/media/treasury-secretary-confronts-cbs-host-over-past-tariff-inflation-predictions-rates-hit-4-year-low",
    "timestamp": "2025-06-02T21:35:25Z"
  },
  {
    "title": "New York Gov. Kathy Hochul gets a primary challenge from Lt. Gov. Antonio Delgado",
    "description": "New York Lt. Gov. Antonio Delgado launched a Democratic primary challenge against Gov.",
    "link": "https://www.nbcnews.com/politics/2026-election/new-york-gov-kathy-hochul-gets-primary-challenge-lt-gov-antonio-delgad-rcna210506",
    "timestamp": "2025-06-02T21:34:01Z"
  },
  {
    "title": "Trump ‘revenge tax’ may open new front in global trade war, with consequences for your wallet",
    "description": "A little-noticed provision in President Donald Trump’s sweeping tax and spending bill could spark the next battle in an escalating global trade war — and potentially unnerve an already rattled market for U.S. Treasurys that is critical to the global economy.",
    "link": "https://biztoc.com/x/b43686ab84cf5f4c",
    "timestamp": "2025-06-02T21:33:58Z"
  },
  {
    "title": "Paramount Schedules Annual Shareholder Meeting, Sets Board Expansion Amid Skydance Merger Watch",
    "description": "Paramount Global has set its annual shareholder meeting for July 2, offering the latest signal that the long-gestating merger with Skydance Media is unlikely to close on schedule. In multiple recent regulatory filings and statements, Paramount has maintained …",
    "link": "http://deadline.com/2025/06/paramount-sets-annual-shareholder-meeting-skydance-merger-1236420893/",
    "timestamp": "2025-06-02T21:33:28Z"
  },
  {
    "title": "Europe’s Billionaires Have Decided to Cross Russia’s Red Lines to WW III. Eric Zuesse",
    "description": "The people who control the U.S. and its allied Governments are their billionaires, not their voters (who are offered ONLY nominees by political Parties whom their billionaires control).\nThe post Europe’s Billionaires Have Decided to Cross Russia’s Red Lines t…",
    "link": "https://www.globalresearch.ca/europe-billionaires-cross-russia-red-lines-ww-iii/5889241",
    "timestamp": "2025-06-02T21:33:26Z"
  },
  {
    "title": "‘It’s cowardice’: Male student allegedly ‘switches gender’ to watch girls change despite competing in boys’ sports",
    "description": "'I never thought I'd have to file a federal complaint just so my daughter could change clothes in a girls' locker room without being stared at by a male student'",
    "link": "https://www.wnd.com/2025/06/its-cowardice-male-student-allegedly-switches-gender-to-watch-girls-change-despite-competing-in-boys-sports/",
    "timestamp": "2025-06-02T21:32:14Z"
  },
  {
    "title": "Karoline Leavitt Literally Does a ‘Both Sides’ on Russia’s War in Ukraine",
    "description": "White House Press Secretary Karoline Leavitt said \"both sides\" in Russia's war on Ukraine have suffered in the conflict and that it is incumbent on the countries' leaders to negotiate an end.\nThe post Karoline Leavitt Literally Does a ‘Both Sides’ on Russia’s…",
    "link": "https://www.mediaite.com/media/tv/karoline-leavitt-literally-does-a-both-sides-on-russias-war-in-ukraine/",
    "timestamp": "2025-06-02T21:31:45Z"
  },
  {
    "title": "Trump administration is convinced massive Alaska energy project will find investors despite steep cost",
    "description": "President Donald Trump is pushing Japan and South Korea to invest in Alaska LNG, threatening them with higher tariffs.",
    "link": "https://www.cnbc.com/2025/06/02/trump-administration-convinced-alaska-lng-will-find-investors-despite-cost.html",
    "timestamp": "2025-06-02T21:31:15Z"
  },
  {
    "title": "Senate GOP leaders face spending squeeze on Trump's big bill: From the Politics Desk",
    "description": "The House-passed legislation for President Donald Trump’s domestic agenda is moving to the Senate, where Majority Leader John Thune, R-S.D., is facing a squeeze from opposing party factions about how to modify it.",
    "link": "https://www.nbcnews.com/politics/politics-news/senate-gop-leaders-spending-squeeze-trump-big-bill-politics-desk-rcna210496",
    "timestamp": "2025-06-02T21:30:00Z"
  },
  {
    "title": "Crypto Bros Celebrate Themselves at Bitcoin’s Most MAGA Convention Yet",
    "description": "Bitcoin 2025 in Las Vegas saw crypto enthusiasts double down on their support of Donald Trump, whose campaign pulled millions from the industry.",
    "link": "http://www.rollingstone.com/culture/culture-features/bitcoin-2025-maga-lovefest-trump-1235352924/",
    "timestamp": "2025-06-02T21:29:36Z"
  },
  {
    "title": "Sen. John Thune reveals GOP plans for Trump’s ‘Big Beautiful Bill’ that narrowly passed House",
    "description": "Senate Majority Leader John Thune teased that Republicans in the upper chamber are looking to make key tax cuts in the One Big Beautiful Bill Act permanent and find additional savings.",
    "link": "https://nypost.com/2025/06/02/us-news/sen-john-thune-reveals-gop-plans-for-trumps-big-beautiful-bill-that-narrowly-passed-house/",
    "timestamp": "2025-06-02T21:27:18Z"
  },
  {
    "title": "Panama Claims 650 Ships Removed from Registry Over Sanctions",
    "description": "Panama's Maritime Authority has removed from its registry more than 650 vessels since 2019 as part of an effort to fulfill U.S. sanctions and enforce stricter rules for the ships it flags, it said on Monday.",
    "link": "https://gcaptain.com/panama-claims-650-ships-removed-from-registry-over-sanctions/",
    "timestamp": "2025-06-02T21:25:30Z"
  },
  {
    "title": "Schumer, Democrats plot coordinated resistance to Trump's 'one ugly bill'",
    "description": "Senate Minority Leader Chuck Schumer wants Democrats to unite to inflict pain on Senate Republicans as they work to ram President Trump’s wish list of policy desires through the Senate.",
    "link": "https://www.foxnews.com/politics/schumer-democrats-plot-coordinated-resistance-trumps-one-ugly-bill",
    "timestamp": "2025-06-02T21:23:32Z"
  },
  {
    "title": "Activists claim to thwart operation to 'abduct' high schoolers — ICE says agents were after murder suspect",
    "description": "A group of community activists claimed to have thwarted a law enforcement operation to \"abduct\" high school students, but federal officials said they instead ruined the cover of agents who were tracking a murder suspect.\n\nAn activist claimed that the communit…",
    "link": "https://www.theblaze.com/news/illegal-alien-ice-murderer-activists",
    "timestamp": "2025-06-02T21:23:29Z"
  },
  {
    "title": "Paramount Global, With Skydance Deal and Trump Lawsuit Pending, Nominates Three New Board Members for Election at July 2 Annual Meeting",
    "description": "Paramount Global and controlling shareholder Shari Redstone had hoped to close the deal to merge the media company with Skydance Media by this point. But as the deal is still pending FCC approval, and with a potential settlement with Donald Trump in his lawsu…",
    "link": "https://variety.com/2025/biz/news/paramount-three-new-board-members-2025-annual-meeting-date-1236416222/",
    "timestamp": "2025-06-02T21:23:14Z"
  },
  {
    "title": "Trump’s Message to Putin: You Blew It",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump’s Message to Putin: You Blew It appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/06/02/trumps-message-to-putin-you-blew-it/",
    "timestamp": "2025-06-02T21:22:12Z"
  },
  {
    "title": "California officials looking into potential Trump-Paramount settlement",
    "description": "California state senators are looking into Paramount’s reported efforts to settle a lawsuit brought by Donald Trump over the editing of a “60 Minutes” interview on CBS with then-Vice President Kamala Harris during last year’s presidential election.",
    "link": "https://biztoc.com/x/5159a8a5e60d76f9",
    "timestamp": "2025-06-02T21:21:59Z"
  },
  {
    "title": "Steve Bannon Calls on Trump to ‘Pull All Support’ for Ukraine After Drone Blitz on Russians",
    "description": "MAGA firebrand Steve Bannon called on President Donald Trump to condemn Ukraine’s weekend drone attack on Russian airbases and “pull all support” after reports that the White House was not informed in advance of the offensive. More than 40 warplanes, includin…",
    "link": "https://freerepublic.com/focus/f-news/4320609/posts",
    "timestamp": "2025-06-02T21:21:33Z"
  },
  {
    "title": "Exclusive: Inside Israel’s Three-Phase Plan To End the Gaza War",
    "description": "TEL AVIV—Israel is in the midst of the second phase of a three-phase Gaza war plan that ends with the military in full control of the strip, according to current and former officials with knowledge of the planning. The sources provided previously undisclosed …",
    "link": "https://freebeacon.com/israel/exclusive-inside-israels-three-phase-plan-to-end-the-gaza-war/",
    "timestamp": "2025-06-02T21:20:42Z"
  },
  {
    "title": "FEMA Head Said He Was Unaware Of U.S. Hurricane Season, Sources Say",
    "description": "It was not clear to agency staff whether he meant it literally, as a joke, or in some other context.",
    "link": "https://www.huffpost.com/entry/fema-richardson-unaware-hurricane-season_n_683e13bfe4b08b77a4612eea",
    "timestamp": "2025-06-02T21:19:39Z"
  },
  {
    "title": "DOGE took over US Institute of Peace. Now, inside looks like zombie movie...",
    "description": "Exclusive: Rodents swarmed the building after DOGE operatives failed to clear out the food left behind by booted staffers, institute security chief Colin O’Brien told The Independent",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/musk-doge-institute-of-peace-vermin-infestation-b2762198.html",
    "timestamp": "2025-06-02T21:19:37Z"
  },
  {
    "title": "Twelve injured in terror attack on Israeli hostage advocates in Colorado...",
    "description": "Twelve injured in terror attack on Israeli hostage advocates in Colorado...\r\n\n \n \n \n (First column, 7th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Man used makeshift flamethrower; Yelled 'Free Palestine'...\r\nSuspect 'overstayed visa'...\r\nMuslim Brotherhood con…",
    "link": "https://www.the-sun.com/news/14380164/pearl-street-terror-attack-boulder-mohamed-sabry-soliman/",
    "timestamp": "2025-06-02T21:19:36Z"
  },
  {
    "title": "Artificial Intelligence Is Making Everything Weird",
    "description": "This week on Reason Roundtable, we explore how artificial intelligence is already reshaping jobs, education, politics, and personal identity.",
    "link": "https://reason.com/podcast/2025/06/02/artificial-intelligence-is-making-everything-weird/",
    "timestamp": "2025-06-02T21:15:41Z"
  },
  {
    "title": "Trump administration convinced massive Alaska energy project will find investors despite steep cost",
    "description": "President Donald Trump is pushing Japan and South Korea to invest in Alaska LNG, threatening them with higher tariffs.",
    "link": "https://www.cnbc.com/2025/06/02/trump-administration-confident-alaska-lng-will-find-investors-despite-cost.html",
    "timestamp": "2025-06-02T21:14:50Z"
  },
  {
    "title": "The Trump administration is delaying a 25% tariff on Chinese-made graphics cards",
    "description": "Graphics cards and motherboards assembled in China are avoiding President Donald Trump’s import taxes, for now.Read more...",
    "link": "https://qz.com/trump-tariff-delay-chinese-graphics-cards-gpu-1851783407",
    "timestamp": "2025-06-02T21:14:00Z"
  },
  {
    "title": "Ritchie Torres Frets Party’s ‘Hysterical’ Trump ‘Resistance’ Could Be Its Undoing",
    "description": "Ritchie Torres expressed concern during a Monday podcast that his party's frenzied opposition to President Donald Trump could damage its electoral prospects.",
    "link": "https://dailycaller.com/2025/06/02/ritchie-torres-frets-partys-hysterical-trump-resistance-could-be-its-undoing/",
    "timestamp": "2025-06-02T21:11:46Z"
  },
  {
    "title": "Frustrated Trump warns 'crazy' Putin",
    "description": "What happened\nPresident Donald Trump's friendly relationship with Vladimir Putin soured last week, after he called the Russian dictator \"absolutely crazy\" for unleashing his largest-ever missile and drone barrage on Ukrainian civilians. The Kremlin dismissed …",
    "link": "https://biztoc.com/x/0975bbeb30d0ce32",
    "timestamp": "2025-06-02T21:11:23Z"
  },
  {
    "title": "Reducing American antisemitism requires more than condemning opposition to Israel and targeting elite universities",
    "description": "The Trump administration’s crusade against antisemitism looks to be mainly about crippling elite universities and blurring the lines between pro-Palestinian activism and antisemitism.",
    "link": "https://theconversation.com/reducing-american-antisemitism-requires-more-than-condemning-opposition-to-israel-and-targeting-elite-universities-257290",
    "timestamp": "2025-06-02T21:11:14Z"
  },
  {
    "title": "Donald Trump's New Official Portrait Compared to His Previous",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe official portrait of President Donald Trump was unveiled Monday, drawing widespread attention. The new portrait shows him in a blue suit and red tie, looking more directly at the camera than his first, whi…",
    "link": "https://biztoc.com/x/5e51b12c62d58380",
    "timestamp": "2025-06-02T21:10:59Z"
  },
  {
    "title": "Alaska on tap: Trump officials tour oil field amid push to expand drilling",
    "description": "Three Trump Cabinet members began a tour at a key point of operations at a prolific oil field near the Arctic Ocean in Alaska on Monday, part of a multiday trip aimed at highlighting President Donald Trump's push to expand oil and gas drilling, mining and log…",
    "link": "https://www.bostonherald.com/2025/06/02/alaska-on-tap-trump-officials-tour-oil-field-amid-push-to-expand-drilling/",
    "timestamp": "2025-06-02T21:09:30Z"
  },
  {
    "title": "ICE expands illegal immigration tip line after Colorado terrorist attack: 'Public safety threats'",
    "description": "ICE enhances its tip line after an antisemitic attack in Boulder, Colorado, highlighting the impact of Biden-era immigration policies and Trump's response.",
    "link": "https://www.foxnews.com/politics/ice-expands-illegal-immigration-tip-line-after-colorado-terrorist-attack",
    "timestamp": "2025-06-02T21:05:10Z"
  },
  {
    "title": "Taliban Claims over 5 Million Afghans Have Come Home amid Iran, Pakistan Mass Deportations",
    "description": "The Taliban claims that over 5 million Afghans have come home since the fall of the U.S.-backed government in the country.\nThe post Taliban Claims over 5 Million Afghans Have Come Home amid Iran, Pakistan Mass Deportations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2025/06/02/taliban-claims-over-5-million-afghans-have-come-home-iran-pakistan-mass-deportations/",
    "timestamp": "2025-06-02T21:04:29Z"
  },
  {
    "title": "Frustrated Trump warns 'crazy' Putin",
    "description": "Trump lashes out online after Putin launches his largest missile and drone attack on Ukraine",
    "link": "https://theweek.com/politics/frustrated-trump-warns-crazy-putin",
    "timestamp": "2025-06-02T21:04:25Z"
  },
  {
    "title": "Graham among senators escalating calls for severe Russia sanctions bill to advance",
    "description": "Sen. Graham said the Senate will move on the Russia sanctions bill this week.",
    "link": "https://abcnews.go.com/Politics/graham-senators-escalating-calls-severe-russia-sanctions-bill/story?id=122415816",
    "timestamp": "2025-06-02T21:03:13Z"
  },
  {
    "title": "Ukraine’s surprise attack shows it may take a ‘major drone strike’ to change US defense policy, experts say",
    "description": "The conflict underscores need for coordinated federal and private efforts to close gaps in homeland drone protection",
    "link": "https://www.foxnews.com/politics/ukraines-surprise-attack-shows-may-take-major-drone-strike-change-us-defense-policy-experts-say",
    "timestamp": "2025-06-02T21:01:29Z"
  },
  {
    "title": "Oilers try to end Canada's NHL title drought by dethroning Panthers",
    "description": "A tension-packed Canada-United States rivalry reaches an emotional high starting Wednesday when the Edmonton Oilers try to become the first Canadian club since 1993 to win the Stanley Cup.Not since the Montreal Canadiens in 1993 has a Canadian team captured t…",
    "link": "https://sports.yahoo.com/article/oilers-try-end-canadas-nhl-210030282.html",
    "timestamp": "2025-06-02T21:00:30Z"
  },
  {
    "title": "S&P/TSX composite cruises to record close on rise in energy stocks",
    "description": "Canada’s main stock index rode energy stocks to a record close Monday, despite a cautious day that followed a month of major gains and a weekend checkered with angst over higher steel tariffs and developments in Ukraine and the Middle East. “There was actuall…",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-cruises-to-record-close-on-rise-in-energy-stocks",
    "timestamp": "2025-06-02T21:00:25Z"
  },
  {
    "title": "Dorinda Cox’s defection from the Greens overshadows defence spending ruckus",
    "description": "The defection of Senator Dorinda Cox from the Greens to Labor has Larissa Waters fuming, and new research into domestic violence reveals some disturbing numbers.\nThe post Dorinda Cox’s defection from the Greens overshadows defence spending ruckus appeared fir…",
    "link": "http://www.crikey.com.au/2025/06/03/dorinda-cox-labor-greens-defence-spending-domestic-violence/",
    "timestamp": "2025-06-02T21:00:19Z"
  },
  {
    "title": "California officials looking into potential Trump-Paramount settlement",
    "description": "California state senators are looking into Paramount’s reported efforts to settle a lawsuit brought by Donald Trump over the editing of a “60 Minutes” interview on CBS with then-Vice President Kamala Harris during last year’s presidential election.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-paramount-settlement-60-minutes-california-probe-rcna210454",
    "timestamp": "2025-06-02T21:00:15Z"
  },
  {
    "title": "GBH cutting 45 employees as Trump administration strips funding",
    "description": "GBH is slashing about 6% of its workforce as the Trump administration strips federal funding from the Boston public station.\nThe media outlet is cutting 45 employees, GBH announced on Monday. This comes amid President Donald Trump’s push to rescind federal fu…",
    "link": "https://biztoc.com/x/849a172ba8894214",
    "timestamp": "2025-06-02T20:59:40Z"
  },
  {
    "title": "Homeland Security’s list of ‘sanctuary cities’ pulled down after sheriffs object",
    "description": "WASHINGTON — The U.S. Department of Homeland Security over the weekend took down a public list of cities and jurisdictions that the Trump administration labeled as “sanctuary” cities, after a sharp rebuke from a group representing 3,000 sheriffs and local law…",
    "link": "https://www.rawstory.com/trump-administration-takes-down-sanctuary-city-list-following-law-enforcement-ba/",
    "timestamp": "2025-06-02T20:59:34Z"
  },
  {
    "title": "Washington Post Article Stresses the Library of Congress's Name, but Largely Ignores Judicial Precedent …",
    "description": "From Saturday's Washington Post story; the subhead is, It's Called the Library of Congress. But Trump Claims It's His The case is the latest example of",
    "link": "https://reason.com/volokh/2025/06/03/wp-article-stresses-library-of-congress-name-but-largely-ignores-precedent/",
    "timestamp": "2025-06-02T20:58:45Z"
  },
  {
    "title": "State Voter Suppression Bills Could Disenfranchise Millions Ahead of Midterms",
    "description": "Trump’s crackdown on immigrants has fueled legislation to restrict access to the ballot in more than two dozen states.",
    "link": "https://truthout.org/articles/state-voter-suppression-bills-could-disenfranchise-millions-ahead-of-midterms/",
    "timestamp": "2025-06-02T20:55:05Z"
  },
  {
    "title": "Finding every deportable immigrant: Inside ICE's Puerto Rico operation",
    "description": "Rebecca González runs one of ICE's local domestic intelligence offices. She told NPR how her agents are tracking down immigrants in Puerto Rico to deliver on President Trump's mass deportation promise.",
    "link": "https://www.npr.org/2025/06/02/nx-s1-5419588/finding-every-deportable-immigrant-inside-ices-puerto-rico-operation",
    "timestamp": "2025-06-02T20:54:40Z"
  },
  {
    "title": "GBH cutting 45 employees as Trump administration strips funding",
    "description": "GBH cutting 45 employees as Trump administration strips funding: 'Layoffs are never our first choice'",
    "link": "https://www.bostonherald.com/2025/06/02/gbh-cutting-45-employees-as-trump-administration-strips-funding/",
    "timestamp": "2025-06-02T20:54:37Z"
  },
  {
    "title": "Trump's Attack on the Federalist Society Is a Bad Omen for Originalism",
    "description": "President Donald Trump remade the Republican Party in his own MAGA image. Will he now do the same to the conservative legal movement? During his first term, Trump benefited immeasurably from his association with Leonard Leo, the former Federalist Society offi…",
    "link": "https://freerepublic.com/focus/f-news/4320605/posts",
    "timestamp": "2025-06-02T20:52:50Z"
  },
  {
    "title": "Ticker: EU preparing tariff ‘countermeasures’; Home cooking on the rise",
    "description": "The European Union on Monday said it is preparing \"countermeasures\" against the United States after the Trump administration's surprise tariffs on steel rattled global markets and complicated the ongoing, wider tariff negotiations between Brussels and Washing…",
    "link": "https://www.bostonherald.com/2025/06/02/ticker-eu-preparing-tariff-countermeasures-home-cooking-on-the-rise/",
    "timestamp": "2025-06-02T20:52:44Z"
  },
  {
    "title": "Colorado rally attack suspect charged with federal hate crime in US",
    "description": "US Attorney General Pam Bondi says alleged attacker Mohamed Sabry Soliman to be prosecuted to law's 'fullest extent'.",
    "link": "https://www.aljazeera.com/news/2025/6/2/colorado-rally-attack-suspect-charged-with-federal-hate-crime-in-us",
    "timestamp": "2025-06-02T20:52:02Z"
  },
  {
    "title": "Feds add ‘hate crime’ charge to Boulder terror suspect who had 16 unlit Molotov cocktails",
    "description": "Trump warns attacks on Jewish interests 'WILL NOT BE TOLERATED'",
    "link": "https://www.wnd.com/2025/06/feds-add-hate-crime-charge-to-boulder-terror-suspect-who-had-16-unlit-molotov-cocktails/",
    "timestamp": "2025-06-02T20:51:54Z"
  },
  {
    "title": "'I Will Never Lie In This Courtroom': Diddy's Ex-Assistant Pushes Back On Doubts About Her Claims",
    "description": "The woman identified only as Mia testified that he assaulted her multiple times over the eight years she worked for him.",
    "link": "https://www.huffpost.com/entry/ap-us-sexual-misconduct-diddy_n_683e0998e4b08b77a4612afc",
    "timestamp": "2025-06-02T20:50:35Z"
  },
  {
    "title": "Suspect in Colorado Anti-Semitic Terror Attack Says He Wanted To 'Kill All Zionist People'",
    "description": "The suspect in Colorado's anti-Semitic terror attack said Monday that he had planned the attack for a year, telling federal investigators that he \"wanted to kill all Zionist people\" and \"would do it again.\"\nThe post Suspect in Colorado Anti-Semitic Terror Att…",
    "link": "https://freebeacon.com/latest-news/suspect-in-colorado-anti-semitic-terror-attack-says-he-wanted-to-kill-all-zionist-people/",
    "timestamp": "2025-06-02T20:50:28Z"
  },
  {
    "title": "Rep. Eric Swalwell Inspires MAGA Tizzy Fit By... Eating A Taco",
    "description": "Trump supporters had a beef with the lawmaker's video, a reference to \"Trump Always Chickens Out.\"",
    "link": "https://www.huffpost.com/entry/rep-eric-swalwell-eats-taco_n_683df5a4e4b0cceca4077b3b",
    "timestamp": "2025-06-02T20:49:47Z"
  },
  {
    "title": "Tariff fight escalates as Trump appeals second court loss",
    "description": "Legal battles intensify over Trump's tariffs, with the administration appealing court decisions that challenge the use of IEEPA for economic policy enforcement.",
    "link": "https://www.foxnews.com/politics/donald-trump-tariffs-federal-court-appeals-international-trade",
    "timestamp": "2025-06-02T20:48:18Z"
  },
  {
    "title": "Trump says he’ll fix the debt but even his allies aren’t convinced",
    "description": "President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package.\nThe response so far from financial ma…",
    "link": "https://biztoc.com/x/2d75325dc873788d",
    "timestamp": "2025-06-02T20:48:03Z"
  },
  {
    "title": "Russia-Ukraine Direct Talks Fail to Reach Cease-Fire Deal",
    "description": "Even after a massive drone operation destroyed dozens of Russian strategic bombers, Moscow is still seeking major concessions.",
    "link": "http://foreignpolicy.com/2025/06/02/russia-ukraine-drone-attack-cease-fire-peace-talks-istanbul/",
    "timestamp": "2025-06-02T20:47:20Z"
  },
  {
    "title": "Dollar dips as tariff worries resurface | Honolulu Star-Advertiser",
    "description": "The U.S. dollar fell across the board today, giving up the previous week’s gains, as markets weighed the outlook for President Donald Trump’s tariff policy and its potential to hurt growth and stoke inflation.",
    "link": "https://www.staradvertiser.com/2025/06/02/breaking-news/dollar-dips-as-tariff-worries-resurface/",
    "timestamp": "2025-06-02T20:46:18Z"
  },
  {
    "title": "White House budget request includes $45 million in additional DOGE funding",
    "description": "The request would support an estimated 150 full time employees, 80% of whom would be paid out of agency reimbursements, rather than DOGE-specific funds.",
    "link": "https://www.nextgov.com/policy/2025/06/white-house-budget-request-includes-45-million-doge-funding/405744/",
    "timestamp": "2025-06-02T20:46:00Z"
  },
  {
    "title": "‘Morning Joe’ Slams GOP for Insisting They’re Fiscally Conservative While Adding $20 Trillion to Federal Debt | Video",
    "description": "\"How any Republican could ever claim to be conservative and vote for a budget that adds $20 trillion to a $37 trillion debt and wrecks our economy is just beyond me,\" host Joe Scarborough says\nThe post ‘Morning Joe’ Slams GOP for Insisting They’re Fiscally Co…",
    "link": "https://www.thewrap.com/morning-joe-spending-bill-mike-johnson-trump-national-debt-republicans/",
    "timestamp": "2025-06-02T20:43:27Z"
  },
  {
    "title": "Stocks Extend May’s Gains as Hopes About Trade Deals Resurface",
    "description": "US equities closed higher Monday, extending the strong gains of May, as technology and energy shares rose, helping to reverse early losses in the session that were spurred by worries around trade friction and signs of economic weakness.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-extend-mays-gains-as-hopes-about-trade-deals-resurface",
    "timestamp": "2025-06-02T20:41:33Z"
  },
  {
    "title": "'Math is hard': Senator trolls Trump budget chief for lying about Medicaid cuts",
    "description": "Sen. Tina Smith (D-MN) has little patience for the false claims President Donald Trump's budget director is making about the One Big Beautiful Bill, Trump's sweeping budget measure that slashes hundreds of billions from Medicaid and food stamps.In a recent in…",
    "link": "https://www.rawstory.com/budget-russ-vought/",
    "timestamp": "2025-06-02T20:37:38Z"
  },
  {
    "title": "The ‘Big, Beautiful’ Question: What Does Trump Want in the Bill?",
    "description": "As the “big, beautiful” budget reconciliation bill moves to the Senate, one major question remains—What exactly does President Donald Trump want in it? Trump has... Read More\nThe post The ‘Big, Beautiful’ Question: What Does Trump Want in the Bill? appeared f…",
    "link": "https://www.dailysignal.com/2025/06/02/big-beautiful-question-what-does-trump-want/",
    "timestamp": "2025-06-02T20:35:33Z"
  },
  {
    "title": "Steve Bannon Says Lindsey Graham Should Be Arrested Over Ukraine Support",
    "description": "Bannon railed against Graham after Graham praised a flurry of unprecedented Ukrainian strikes targeting Russian strategic bombers.",
    "link": "https://www.newsweek.com/steve-bannon-lindsey-graham-ukraine-russia-2080023",
    "timestamp": "2025-06-02T20:35:24Z"
  },
  {
    "title": "‘It’s just beginning and it’s going to get ugly’: Pro-Trump Polish president-elect reflects divided nation",
    "description": "Warsaw’s allies in Europe left wondering who they will be dealing with: a populist head of state or its centrist prime minister",
    "link": "https://www.irishtimes.com/world/europe/2025/06/03/its-just-beginning-and-its-going-to-get-ugly-pro-trump-polish-president-elect-reflects-divided-nation/",
    "timestamp": "2025-06-02T20:34:35Z"
  },
  {
    "title": "Fetterman called to ‘step aside’ by Philadelphia Inquirer if disengaged or mental health issues too severe",
    "description": "The Philadelphia Inquirer called on Sen. John Fetterman to step up or step aside on Sunday amid reports of mental health concerns, which the Democratic lawmaker called a smear campaign.",
    "link": "https://www.foxnews.com/media/fetterman-called-step-aside-philadelphia-inquirer-disengaged-mental-health-issues-too-severe",
    "timestamp": "2025-06-02T20:34:02Z"
  },
  {
    "title": "Schiff again asks White House to disclose officials' financial transactions",
    "description": "Schiff again asks White House for disclosure of senior officials' financial transactions around Trump's sudden pause in April of his sweeping set of tariffs.",
    "link": "https://abcnews.go.com/Politics/democratic-sen-schiff-asks-white-house-officials-disclose/story?id=122322145",
    "timestamp": "2025-06-02T20:33:01Z"
  },
  {
    "title": "The Most Insidious Way That the Supreme Court Has Exploited Trump’s Chaos",
    "description": "Time and again, the justices have dodged head-on conflicts with the administration by crafting dubious compromises that drain the court of its own power.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-analysis-trumps-chaos-john-roberts.html",
    "timestamp": "2025-06-02T20:31:46Z"
  },
  {
    "title": "After 4 Months, Elon Musk Learned What Every American Already Knows, Says Ross Gerber: 'No One In Government Wants To Cut Any Budget'",
    "description": "Tesla (NASDAQ:TSLA) CEO and former Trump administration adviser Elon Musk is learning a hard truth about Washington, according to investor Ross Gerber...",
    "link": "https://finance.yahoo.com/news/4-months-elon-musk-learned-203020790.html",
    "timestamp": "2025-06-02T20:30:20Z"
  },
  {
    "title": "It's time for investors to play the long game",
    "description": "Investing, like golf, is a mix of both the short and the long game. In the wild first half of 2025, investors have mostly focused on the short game, but now that we appear to be entering a period of relative calm, investors can start looking much farther down…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3040626/its-time-for-investors-to-play-the-long-game",
    "timestamp": "2025-06-02T20:30:00Z"
  },
  {
    "title": "Can Thailand engage with Trump's US?",
    "description": "Thailand must be bold and dynamic in recalibrating its diplomatic ties with the United States under President Donald Trump. Asia's oldest relationship with Washington carries little weight in the era of transactional diplomacy. Although the 1833 Treaty of Ami…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3040596/can-thailand-engage-with-trumps-us-",
    "timestamp": "2025-06-02T20:30:00Z"
  },
  {
    "title": "Fox News Guest Defends Trump Pushing Outrageous Conspiracy Theory That Biden Was ‘Executed’ and Replaced By Robotic Clones",
    "description": "A Fox News guest Monday attempted justify President Donald Trump pushing the absurd conspiracy theory that Joe Biden was executed and replaced by a robot.\nThe post Fox News Guest Defends Trump Pushing Outrageous Conspiracy Theory That Biden Was ‘Executed’ and…",
    "link": "https://www.mediaite.com/media/tv/fox-news-guest-defends-trump-pushing-outrageous-conspiracy-theory-that-biden-was-executed-and-replaced-by-robotic-clones/",
    "timestamp": "2025-06-02T20:27:35Z"
  },
  {
    "title": "Colorado terror attack suspect charged with hate crime",
    "description": "FBI documents allege Mohamed Sabry Soliman used a makeshift flamethrower and threw Molotov cocktails at a pro-Israel group in an attack he says he planned for more than a year.",
    "link": "https://www.abc.net.au/news/2025-06-03/colorado-terror-attack-suspect-charged-with-us-hate-crime/105369384",
    "timestamp": "2025-06-02T20:27:20Z"
  },
  {
    "title": "Why Ukraine's Surprise Attack Is Being Called 'Russia's Pearl Harbor'",
    "description": "U.S. military commentators praised Ukraine's \"remarkable\" Trojan Horse-like use of wooden sheds as it bombed as deep into Russia as Siberia.",
    "link": "https://www.huffpost.com/entry/ukraine-drone-attack-trojan-horse-pearl-harbor_n_683dc34fe4b08b77a460e0af",
    "timestamp": "2025-06-02T20:26:55Z"
  },
  {
    "title": "U.S. steel and aluminum prices spike after Trump's new tariffs",
    "description": "U.S. steel and aluminum prices spiked on Monday while shares of foreign steelmakers slumped after U.S. President Donald Trump said he would double tariffs on imports of the two metals to 50 per cent.",
    "link": "https://biztoc.com/x/b1f2d86ff8220eee",
    "timestamp": "2025-06-02T20:26:13Z"
  },
  {
    "title": "Trump’s steel tariffs are unlikely to have a big impact on Australia. But we could be hurt by what happens globally",
    "description": "Most Australians will feel the effects of the tariffs through the indirect effects on US manufacturing and on America’s trading partners.",
    "link": "https://theconversation.com/trumps-steel-tariffs-are-unlikely-to-have-a-big-impact-on-australia-but-we-could-be-hurt-by-what-happens-globally-257959",
    "timestamp": "2025-06-02T20:25:48Z"
  },
  {
    "title": "The Ukrainians Ushered in a New Era of Warfare",
    "description": "Expensive planes, tanks, and ships can be destroyed on the cheap.",
    "link": "https://www.theatlantic.com/international/archive/2025/06/ukraine-new-war-drone-strike/683008/",
    "timestamp": "2025-06-02T20:25:03Z"
  },
  {
    "title": "‘Kill the Boer’ and ‘Free Palestine’ are preludes",
    "description": "The human instinct of a Columbia professor or campus crazies is identical to that of Hamas invaders murdering, burning and raping their way through the Gaza envelope. Opinion.",
    "link": "https://www.israelnationalnews.com/news/409345",
    "timestamp": "2025-06-02T20:24:18Z"
  },
  {
    "title": "'Economic ruination': Trump admits tariffs could backfire",
    "description": "President Donald Trump is warning of possible \"economic ruination\" if the courts do not allow his massive, unilateral tariffs to stay in place, in an apparent admittance they could backfire.The President suggested on Sunday that after he imposed tariffs, and …",
    "link": "https://www.rawstory.com/economic-ruination-trump-admits-tariffs-could-backfire/",
    "timestamp": "2025-06-02T20:21:51Z"
  },
  {
    "title": "Return Of Country Club Dues Deduction Is More Defensible Than SALT",
    "description": "No one is calling for a return of the country club dues tax deduction, but even conservatives say that’s more defensible than boosting the state and local tax deduction.",
    "link": "https://www.forbes.com/sites/patrickgleason/2025/06/02/return-of-country-club-dues-deduction-is-more-defensible-than-salt/",
    "timestamp": "2025-06-02T20:20:41Z"
  },
  {
    "title": "WATCH: GOP strategist shuts down podcast host’s claim that political violence comes from ‘both sides’",
    "description": "'Until they get rid of it, they're gonna have a real problem'",
    "link": "https://www.wnd.com/2025/06/watch-gop-strategist-shuts-down-podcast-hosts-claim-that-political-violence-comes-from-both-sides/",
    "timestamp": "2025-06-02T20:17:48Z"
  },
  {
    "title": "Plan to harness technology for health care delivery DOA, killed by Trump budget cuts  - Arkansas Times",
    "description": "The Central Arkansas Library System will not receive funds to expand telehealth access points at libraries and it's digital navigator program.",
    "link": "http://arktimes.com/arkansas-blog/2025/06/02/plan-to-harness-technology-for-health-care-delivery-doa-killed-by-trump-budget-cuts",
    "timestamp": "2025-06-02T20:16:42Z"
  },
  {
    "title": "Top golfer Bryson DeChambeau shares highlights from Utah trip in new YouTube short",
    "description": "Bryson DeChambeau was at a golf course in Provo and at the Salt Flats as part of his partnership with \"Bucked Up\" energy. Trump golfs with DeChambeau.",
    "link": "https://www.deseret.com/sports/2025/06/02/bryson-dechambeau-youtube-in-utah/",
    "timestamp": "2025-06-02T20:16:30Z"
  },
  {
    "title": "Colorado terrorist wanted to 'kill all Zionists,' plotted for a year",
    "description": "Suspect in firebombing of solidarity event for Israeli hostages faces hate charge for attack that left 8 injured, including a Holocaust survivor.",
    "link": "https://www.israelnationalnews.com/news/409343",
    "timestamp": "2025-06-02T20:15:50Z"
  },
  {
    "title": "'Audacious' Ukrainian drone attack on Russian bombers stuns ahead of peace talks in Istanbul",
    "description": "Officials from Russia and Ukraine met in Istanbul, Turkey, to negotiate on a possible peace deal after a stunning drone operation dubbed \"Spider's Web\" destroyed Russian bombers over the weekend.\n\nUkraine launched an attack through drones that had been secret…",
    "link": "https://www.theblaze.com/news/russia-drone-attack-peace-talks",
    "timestamp": "2025-06-02T20:15:45Z"
  },
  {
    "title": "Wall Street closes mostly higher as markets bet on trade talks",
    "description": "US stocks closed mostly higher on Monday as investors looked beyond escalating global trade tensions.The modest gains came as hopes grew for renewed dialogue between President Donald Trump and China's...",
    "link": "https://biztoc.com/x/a479de8ebe5e5bba",
    "timestamp": "2025-06-02T20:15:07Z"
  },
  {
    "title": "Britain gets a defense boost aimed at sending a message to Russia — and Trump",
    "description": "The U.K. will build new nuclear-powered attack submarines and create an army ready to fight a war in Europe as part of a boost to military spending.",
    "link": "https://www.pbs.org/newshour/world/britain-gets-a-defense-boost-aimed-at-sending-a-message-to-russia-and-trump",
    "timestamp": "2025-06-02T20:15:07Z"
  },
  {
    "title": "US growth likely to slow to 1.6% this year, hobbled by Trump's trade wars, OECD says",
    "description": "U.S. economic growth will slow to 1.6% this year from 2.8% last year as President Donald Trump’s erratic trade wars disrupt global commerce, drive up costs and leave businesses and consumers paralyzed by uncertainty.",
    "link": "https://www.clickondetroit.com/business/2025/06/02/us-growth-likely-to-slow-to-16-this-year-hobbled-by-trumps-trade-wars-oecd-says/",
    "timestamp": "2025-06-02T20:15:03Z"
  },
  {
    "title": "Trump administration asks Supreme Court to allow federal layoffs",
    "description": "President Donald Trump’s administration on Monday renewed its request for the Supreme Court to clear the way for plans to downsize the federal workforce, while a lawsuit filed by labor unions and cities proceeds.\nThe high court filing came after an appeals co…",
    "link": "https://biztoc.com/x/ef724ae06dc04e46",
    "timestamp": "2025-06-02T20:14:55Z"
  },
  {
    "title": "Exclusive — Rand Paul: Democrats are ‘Adrift,’ But Republicans Face Risks if Conservatives Veer from Principle",
    "description": "Sen. Rand Paul (R-KY), the longtime Senator and conservative grassroots leader from Kentucky, told Breitbart News exclusively that he believes the Democrats are “adrift” as a party without an identity right now.\nThe post Exclusive — Rand Paul: Democrats are ‘…",
    "link": "https://www.breitbart.com/politics/2025/06/02/exclusive-rand-paul-democrats-are-adrift-but-republicans-face-risks-if-conservatives-veer-from-principle/",
    "timestamp": "2025-06-02T20:10:24Z"
  },
  {
    "title": "Tim Walz’ Teenage Son Enlightens Him On Why Young Men Gravitate Toward Trump",
    "description": "Former vice president candidate Tim Walz turned to his high school aged son to figure out why President Donald Trump appeals so strongly to young men.",
    "link": "https://dailycaller.com/2025/06/02/tim-walz-son-young-men-trump/",
    "timestamp": "2025-06-02T20:09:47Z"
  },
  {
    "title": "Judge blocks Trump from nixing union bargaining for TSA officers",
    "description": "The lawsuit claims the Trump administration ended collective bargaining for TSA officers as retaliation against the unions for suing over administration policies.",
    "link": "https://www.cnbc.com/2025/06/02/judge-blocks-trump-from-nixing-union-bargaining-for-tsa-officers.html",
    "timestamp": "2025-06-02T20:08:39Z"
  },
  {
    "title": "Trump Blames Biden's 'Open Borders' for Colorado Terror Attack, Fails to Mention Antisemitism Despite Hate Crime Charges",
    "description": "Donald Trump blamed the attack in Boulder on Joe Biden's immigration policy, omitting reference to the antisemitic nature of the attack or hate crime charges.",
    "link": "https://www.ibtimes.com/trump-blames-bidens-open-borders-colorado-terror-attack-fails-mention-antisemitism-despite-3775060",
    "timestamp": "2025-06-02T20:08:07Z"
  },
  {
    "title": "To avoid blackouts, Trump admin keeps another aging power plant online through summer",
    "description": "The U.S. Department of Energy is ordering an oil and gas power plant to keep its turbines running through the hottest summer months as a precaution against electricity shortfalls in the mid-Atlantic grid",
    "link": "https://abcnews.go.com/US/wireStory/prevent-blackouts-trump-administration-aging-power-plant-online-122424542",
    "timestamp": "2025-06-02T20:07:46Z"
  },
  {
    "title": "Is an Autonomous F-35 Fighter Jet Coming Soon?",
    "description": "Lockheed Martin may upgrade the F-35 with autonomous capabilities and sixth-generation tech, creating a “pilot-optional” fighter within years, despite losing major next-gen contracts to Boeing and Northrop Grumman.\nThe post Is an Autonomous F-35 Fighter Jet C…",
    "link": "https://nationalinterest.org/blog/buzz/is-an-autonomous-f-35-fighter-jet-coming-soon",
    "timestamp": "2025-06-02T20:07:35Z"
  },
  {
    "title": "Maxine Waters Punished For Accepting Illegal Donations",
    "description": "California Democratic Rep. Maxine Waters’ congressional campaign has been fined $68,000 for violating several federal campaign finance laws during her 2020 reelection bid. The Federal Election Commission (FEC) recently published investigation documents showin…",
    "link": "https://freerepublic.com/focus/f-news/4320596/posts",
    "timestamp": "2025-06-02T20:07:11Z"
  }
]