[
  {
    "title": "No Kings, No Masters : A Call for Anti-Authoritarian Blocs at the October 18 \"No Kings\" Demonstrations",
    "description": "A call for anti-authoritarian blocs at the October 18 \"No Kings\" demonstrations.",
    "link": "https://crimethinc.com/2025/10/09/no-kings-no-masters-a-call-for-anti-authoritarian-blocs-at-the-october-18-no-kings-demonstrations",
    "timestamp": "2025-10-09T09:55:34Z"
  },
  {
    "title": "Nobel Peace Prize 2025: The last meeting of the deciding committee was held on Monday – What this means for Trump",
    "description": "This timetable suggests that the name of the winner was chosen long before the agreement between Israel and Hamas, which was reached under strong pressure from the American president\nThe post Nobel Peace Prize 2025: The last meeting of the deciding committee …",
    "link": "https://en.protothema.gr/2025/10/09/nobel-peace-prize-2025-the-last-meeting-of-the-deciding-committee-was-held-on-monday-what-this-means-for-trump/",
    "timestamp": "2025-10-09T09:54:58Z"
  },
  {
    "title": "Τουρκία - ΗΠΑ εμβαθύνουν την ενεργειακή τους συνεργασία με συμφωνίες για πυρηνική ενέργεια και LNG",
    "description": "Η Άγκυρα υπέγραψε κρίσιμες συμφωνίες με τις ΗΠΑ για LNG και πυρηνική ενέργεια, ενισχύοντας τη θέση της ως ενεργειακού κόμβου και μειώνοντας την εξάρτησή της από τη Ρωσία.Διονύσης Αντωνέλλος Η Τουρκία κάνει ένα αποφασιστικό βήμα για να γίνει ενεργειακός κόμβος…",
    "link": "https://i-epikaira.blogspot.com/2025/10/lng.html",
    "timestamp": "2025-10-09T09:54:00Z"
  },
  {
    "title": "UKPSC PCS prelims result 2025 declared: Check direct link, next steps for qualified candidates",
    "description": "The UKPSC has announced the PCS Prelims Result 2025. Candidates can check their roll numbers on the official website. Those who cleared the prelims will now prepare for the descriptive Mains examination. This is a crucial step in the recruitment process for a…",
    "link": "https://timesofindia.indiatimes.com/education/news/ukpsc-pcs-prelims-result-2025-declared-check-direct-link-next-steps-for-qualified-candidates/articleshow/124411222.cms",
    "timestamp": "2025-10-09T09:51:42Z"
  },
  {
    "title": "Ideas: Trump Is Successfully Bullying Netanyahu",
    "description": "The more the president puts the prime minister in his place, the more likely it is that the Gaza war will end.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/trump-is-successfully-bullying-netanyahu-e711299/",
    "timestamp": "2025-10-09T09:50:00Z"
  },
  {
    "title": "The Nightmare of Despotism",
    "description": "Hamilton feared the mob. Jefferson warned against unchecked elites. But both thought that the republic could fall.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/11/shays-rebellion-hamilton-jefferson-political-ideologies/684319/",
    "timestamp": "2025-10-09T09:50:00Z"
  },
  {
    "title": "Trump hosts roundtable accusing ‘sick’ media of backing Antifa",
    "description": "Seated in the White House State Dining Room, US President Donald Trump called on far-right content creators to name and shame backers of Antifa, leading a roundtable discussion that quickly devolved into media bashing.  The president had invited “independent …",
    "link": "https://www.digitaljournal.com/world/trump-hosts-roundtable-accusing-sick-media-of-backing-antifa/article",
    "timestamp": "2025-10-09T09:47:49Z"
  },
  {
    "title": "Trump Hosts Roundtable Accusing 'Sick' Media Of Backing Antifa",
    "description": "Seated in the White House State Dining Room, US President Donald Trump called on far-right content creators to name and shame backers of Antifa, leading a roundtable discussion that quickly devolved into media bashing.",
    "link": "https://www.ibtimes.com/trump-hosts-roundtable-accusing-sick-media-backing-antifa-3786282",
    "timestamp": "2025-10-09T09:45:21Z"
  },
  {
    "title": "Yes, Maybe Cutting Medicaid for Millions of People Will Result in Some Yelling",
    "description": "This Republican lawmaker really crashed out at the idea of holding a town hall.",
    "link": "https://slate.com/news-and-politics/2025/10/medicaid-cuts-republican-town-halls-democrats-donald-trump.html",
    "timestamp": "2025-10-09T09:45:00Z"
  },
  {
    "title": "Ukraine's new missiles and drones cause gas shortages in Russia, Zelenskyy says",
    "description": "Ukrainian President Volodymyr Zelenskyy says Ukraine's new long-range missiles and drones are causing significant gas shortages in Russia",
    "link": "https://abcnews.go.com/International/wireStory/ukraines-new-missiles-drones-cause-gas-shortages-russia-126356685",
    "timestamp": "2025-10-09T09:41:53Z"
  },
  {
    "title": "Israel & Hamas Reach Gaza Deal; China Unveils New Rare Earth Curbs",
    "description": "On today's podcast: 1) Israel and Hamas have reached a deal for the release of all hostages held by the militant group in Gaza, a major step toward ending a two-year war that’s devastated the Palestinian territory and triggered multiple conflicts in the Middl…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/israel-hamas-reach-gaza-deal-china-unveils-new-rare-earth-curbs",
    "timestamp": "2025-10-09T09:41:19Z"
  },
  {
    "title": "Uniqlo operator Fast Retailing posts record profit for fourth year, beating forecasts",
    "description": "Uniqlo's parent company, Fast Retailing, has reported its fourth straight year of record profits. Strong sales in Japan and the United States powered this success. The company is expanding in North America and Europe. Future growth is anticipated, with plans …",
    "link": "https://economictimes.indiatimes.com/news/international/business/uniqlo-operator-fast-retailing-posts-record-profit-for-fourth-year-beating-forecasts/articleshow/124411000.cms",
    "timestamp": "2025-10-09T09:39:54Z"
  },
  {
    "title": "Fireworks and a toast to life: Israelis delight at deal to return hostages",
    "description": "\"I can't quite believe this is actually happening, we've been waiting for so long,\" said Gil Dickman, cousin of hostage Carmel Gat.",
    "link": "https://www.bbc.com/news/articles/ce9rl9krm0do",
    "timestamp": "2025-10-09T09:35:49Z"
  },
  {
    "title": "This very important space mission is threatened by the US government shutdown",
    "description": "Faced with the US government shutdown, NASA finds itself in serious difficulty. And one of its most important missions could even disappear, dashing many hopes.",
    "link": "https://www.notebookcheck.net/This-very-important-space-mission-is-threatened-by-the-US-government-shutdown.1134610.0.html",
    "timestamp": "2025-10-09T09:34:00Z"
  },
  {
    "title": "Trump keeps allies guessing on more Russia sanctions, says EU sanctions envoy",
    "description": "BRUSSELS (Reuters) -Sanctions are clearly hurting the Russian economy but U.S. President Donald Trump is keeping his allies guessing whether he will sign off...",
    "link": "https://www.yahoo.com/news/articles/trump-keeps-allies-guessing-more-093337388.html",
    "timestamp": "2025-10-09T09:33:37Z"
  },
  {
    "title": "Russia Blames Europe for Ukraine Peace Talks Stalling as Moscow Panics on Tomahawk Missiles",
    "description": "\"Powerful momentum\" from the Trump-Putin talks has gone, Russia said as it warned of the \"consequences\" of giving Tomahawk missiles to Kyiv.\nThe post Russia Blames Europe for Ukraine Peace Talks Stalling as Moscow Panics on Tomahawk Missiles appeared first on…",
    "link": "https://www.breitbart.com/europe/2025/10/09/russia-claims-european-warmongers-are-behind-ukraine-talks-stalling/",
    "timestamp": "2025-10-09T09:31:17Z"
  },
  {
    "title": "France Hosts Arab, Europe Ministers For Talks On 'Day After' Gaza War",
    "description": "France on Thursday hosts foreign ministers from Arab and European countries for talks on helping the Palestinians once the Gaza conflict between Israel and Hamas ends, a meeting that comes hours after the two sides agreed a ceasefire deal.",
    "link": "https://www.ibtimes.com/france-hosts-arab-europe-ministers-talks-day-after-gaza-war-3786280",
    "timestamp": "2025-10-09T09:30:14Z"
  },
  {
    "title": "Why forecasts of the dollar’s death as the world’s top currency are highly exaggerated",
    "description": "The dollar’s dominance is far from done, even as the yuan chips away at it. Regardless of Trump’s confidence-sapping policies, BIS data shows global finance still pivots around the greenback. So, what does this mean for challengers?",
    "link": "https://www.livemint.com/opinion/online-views/us-dollar-global-finance-bank-for-international-settlements-bis-currency-survey-chinese-yuan-treasury-bonds-donald-trump-11759926003318.html",
    "timestamp": "2025-10-09T09:30:00Z"
  },
  {
    "title": "Celebrazioni a Tel Aviv per l'annuncio dell'accordo di pace",
    "description": "epa12441130 People celebrate after a peace deal is announced at Hostages Square in Tel Aviv, Israel, 09 October 2025. US President Donald Trump announced that Israel and Hamas have agreed to the first phase of a Gaza peace plan. (ANSA)",
    "link": "https://www.ansa.it/sito/photogallery/primopiano/2025/10/09/celebrazioni-a-tel-aviv-per-lannuncio-dellaccordo-di-pace_43a333df-8cdc-40d9-b3b9-bdab6bcef280.html",
    "timestamp": "2025-10-09T09:29:37Z"
  },
  {
    "title": "Publisher pulls book claiming Epstein introduced Trumps",
    "description": "HarperCollins UK has recalled a title repeating a claim that the US president’s wife has said is defamatory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626125-melania-trump-epstein-retraction/",
    "timestamp": "2025-10-09T09:28:55Z"
  },
  {
    "title": "France hosts Arab, Europe ministers for talks on ‘day after’ Gaza war",
    "description": "France on Thursday hosts foreign ministers from Arab and European countries for talks on helping the Palestinians once the Gaza conflict between Israel and Hamas ends, a meeting that comes hours after the two sides agreed a ceasefire deal. Israel and Hamas ea…",
    "link": "https://www.digitaljournal.com/world/france-hosts-arab-europe-ministers-for-talks-on-day-after-gaza-war/article",
    "timestamp": "2025-10-09T09:27:20Z"
  },
  {
    "title": "‘Sending you love from Gaza’: Palestinians hail ceasefire deal",
    "description": "Palestinians in southern Gaza clapped, cheered and danced in the pre-dawn darkness on Thursday, after Israel and Hamas agreed a ceasefire deal to end the devastating two-year war in the territory. A crowd of around a dozen young men shouted joyful chants of “…",
    "link": "https://www.digitaljournal.com/world/sending-you-love-from-gaza-palestinians-hail-ceasefire-deal/article",
    "timestamp": "2025-10-09T09:27:20Z"
  },
  {
    "title": "France hosts Arab, Europe ministers for talks on 'day after' Gaza war",
    "description": "France on Thursday hosts foreign ministers from Arab and European countries for talks on helping the Palestinians once the Gaza conflict between Israel and...",
    "link": "https://www.yahoo.com/news/articles/france-hosts-arab-europe-ministers-092604691.html",
    "timestamp": "2025-10-09T09:26:04Z"
  },
  {
    "title": "'Joy and pain': Palestinians celebrate ceasefire deal - but fear confronting grief",
    "description": "People in Gaza celebrate a potential end to the war, but know it will mean facing the grief they have put aside.",
    "link": "https://www.bbc.com/news/articles/cvgv0gypy75o",
    "timestamp": "2025-10-09T09:25:10Z"
  },
  {
    "title": "The headache with the farmers, the AI harvest, Samaras and the Rafina gatherings, the unmovable (like a needle) Nikos, and Pavlos the Lionheart, the back-and-forth on insurance issues",
    "description": "Blue Books & Green News\nThe post The headache with the farmers, the AI harvest, Samaras and the Rafina gatherings, the unmovable (like a needle) Nikos, and Pavlos the Lionheart, the back-and-forth on insurance issues appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/09/the-headache-with-the-farmers-the-ai-harvest-samaras-and-the-rafina-gatherings-the-unmovable-like-a-needle-nikos-and-pavlos-the-lionheart-the-back-and-forth-on-insurance-issues/",
    "timestamp": "2025-10-09T09:19:56Z"
  },
  {
    "title": "Israel-Hamas Gaza ceasefire agreement takes effect",
    "description": "The Gaza ceasefire between Israel and Hamas formally came into force after US President Donald Trump announced that an agreement had been struck between the warring parties, Egypt's Al Qahera News rep...",
    "link": "https://biztoc.com/x/a5ec532e5e1a6baf",
    "timestamp": "2025-10-09T09:18:49Z"
  },
  {
    "title": "Trump's National Guard deployments face pair of court challenges",
    "description": "CHICAGO (Reuters) -President Donald Trump's aggressive and unprecedented National Guard deployments will be further tested in two court hearings in different U.S. states on Thursday, as governors resisting the militarization of their cities challenge the fede…",
    "link": "https://www.thestar.com.my/news/world/2025/10/09/trump039s-national-guard-deployments-face-pair-of-court-challenges",
    "timestamp": "2025-10-09T09:18:00Z"
  },
  {
    "title": "India extends deadline for first annual US LPG import tender to Oct 17, sources say",
    "description": "Indian state refiners have extended their first joint tender for U.S. LPG imports to October 17, seeking about 2 million metric tons for delivery in 2026. This move aims to boost energy imports from the U.S., diversify India's fuel sources away from the Middl…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-extends-deadline-for-first-annual-us-lpg-import-tender-to-oct-17-sources-say/articleshow/124410504.cms",
    "timestamp": "2025-10-09T09:16:37Z"
  },
  {
    "title": "US container imports drop 8.4% in September as Trump tariffs disrupt global trade",
    "description": "U.S. containerized goods imports declined 8.4% year-over-year in September, with a significant 22.9% drop from China, due to ongoing tariff policies. Despite a strong historical September volume, forecasts predict a fall below 2 million TEUs for the remainder…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-container-imports-drop-in-september-as-trump-tariffs-disrupt-global-trade/articleshow/124410481.cms",
    "timestamp": "2025-10-09T09:16:01Z"
  },
  {
    "title": "Trump's Israel-Hamas ceasefire sparks cautious celebration but future remains unclear for Gaza",
    "description": "The previous ceasefire lasted from Jan. 19 to March 18, when Israel resumed military operations in Gaza.",
    "link": "https://www.nbcnews.com/world/israel/ceasefire-israel-hamas-gaza-palestinians-trump-netanyahu-qatar-rcna217806",
    "timestamp": "2025-10-09T09:15:48Z"
  },
  {
    "title": "Colombia's president says boat struck by US was carrying Colombians",
    "description": "The White House called the allegation \"baseless\", while the US Senate rejected a measure that would bar Trump from using military force against the boats.",
    "link": "https://www.bbc.com/news/articles/c89dz920p0do",
    "timestamp": "2025-10-09T09:13:13Z"
  },
  {
    "title": "Another shot at Nobel? White House's ‘peace’ post after Donald Trump pulls off Israel-Hamas Gaza deal | World News - Hindustan Times",
    "description": "Another shot at Nobel? White House's ‘peace’ post after Donald Trump pulls off Israel-Hamas Gaza deal | World NewsHindustan Times Inside the room where Nobel Peace Prize is decided – but will Trump get his wish?BBC Eric Trump leads MAGA calls for president to…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179725100",
    "timestamp": "2025-10-09T09:12:38Z"
  },
  {
    "title": "Windmill Wars",
    "description": "Opposition from local communities has emerged as a major barrier to expanding wind-power capacity in many countries. While the courts might seem to offer the best path to overcoming this barrier, financial compensation for affected households is likely to be …",
    "link": "https://www.project-syndicate.org/commentary/how-to-overcome-local-community-opposition-to-windmills-by-daniel-gros-2025-10",
    "timestamp": "2025-10-09T09:11:57Z"
  },
  {
    "title": "Cerebras CEO Andrew Feldman says the US's 'patchwork' policies are setting back AI",
    "description": "Cerebras CEO Andrew Feldman says China's centralized policy has fueled its advantage in standing up \"vast amounts of power.\"",
    "link": "https://www.businessinsider.com/cerebras-ceo-andrew-feldman-china-us-ai-race-energy-2025-10",
    "timestamp": "2025-10-09T09:09:01Z"
  },
  {
    "title": "Israel, Hamas agree to 1st phase of Gaza peace plan: Trump on brink of major diplomatic accomplishment",
    "description": "Much could go wrong in coming days, and in the Middle East it often does. The “peace” deal Trump heralded on Truth Social on Wednesday evening may look more like another temporary pause in a war that started with Israel’s founding in 1948",
    "link": "https://indianexpress.com/article/explained/explained-global/israel-hamas-agree-to-1st-phase-of-gaza-peace-plan-trump-10296923/",
    "timestamp": "2025-10-09T09:08:35Z"
  },
  {
    "title": "Donald Trump Visiting Walter Reed Twice in Six Months Under Scrutiny",
    "description": "The White House said the president would visit Walter Reed Medical Center for a \"routine yearly check up.\"",
    "link": "https://biztoc.com/x/d1218a7340ea0eb1",
    "timestamp": "2025-10-09T09:07:48Z"
  },
  {
    "title": "GOP senator demands FBI reveal if surveillance went beyond Jack Smith’s phone tracking",
    "description": "Sen. Cynthia Lummis is demanding answers from the FBI on whether she faced further surveillance after revelations that ex–Special Counsel Jack Smith tracked her phone calls.",
    "link": "https://www.foxnews.com/politics/gop-senator-demands-fbi-reveal-surveillance-went-beyond-jack-smiths-phone-tracking",
    "timestamp": "2025-10-09T09:00:56Z"
  },
  {
    "title": "Trump’s aircraft carrier visit sends China a message: US sea power still rules the waves",
    "description": "President Donald Trump visits USS George H. W Bush aircraft carrier for Navy's 250th Anniversary celebrations, highlighting U.S. naval power against China.",
    "link": "https://www.foxnews.com/opinion/trumps-aircraft-carrier-visit-sends-china-message-us-sea-power-still-rules-waves",
    "timestamp": "2025-10-09T09:00:53Z"
  },
  {
    "title": "Coinbase Rolls Out Ethereum, Solana Staking To New York Users After Approval",
    "description": "Leading US-based cryptocurrency exchange Coinbase today announced that it has rolled out crypto staking services for New York residents after receiving regulatory approval. Notably, Coinbase’s New York-based users can now stake Ethereum (ETH) and Solana (SOL)…",
    "link": "https://bitcoinist.com/coinbase-rolls-ethereum-solana-staking-new-york/",
    "timestamp": "2025-10-09T09:00:42Z"
  },
  {
    "title": "Andrew Cuomo’s Delicate Quest for Republican Votes",
    "description": "Cuomo needs conservatives to vote for him. But he doesn’t want to look like a conservative, reports David Freedlander.",
    "link": "http://nymag.com/intelligencer/article/andrew-cuomos-delicate-quest-for-republican-votes.html",
    "timestamp": "2025-10-09T09:00:41Z"
  },
  {
    "title": "Just 4% Of Americans Believe Trump Claim About Tylenol",
    "description": "Just 4% of Americans definitely believe President Trump's claim that taking Tylenol during pregnancy increases the risk of a child developing autism, a KFF poll shows.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/10/09/just-4-of-americans-believe-trump-claim-about-tylenol/",
    "timestamp": "2025-10-09T09:00:40Z"
  },
  {
    "title": "MORNING GLORY: Senator Chuck Schumer must end his government shutdown",
    "description": "Senate Democrats need five more votes to pass the clean continuing resolution as the government shutdown continues, with Republicans demanding negotiations on spending bills.",
    "link": "https://www.foxnews.com/opinion/morning-glory-senator-chuck-schumer-must-end-his-government-shutdown",
    "timestamp": "2025-10-09T09:00:18Z"
  },
  {
    "title": "Chicago and Portland to fight Trump's National Guard deployments in court showdowns",
    "description": "President Donald Trump’s efforts to deploy National Guard troops in states that don’t want them will be tested in two different courts Thursday",
    "link": "https://www.nbcnews.com/politics/trump-administration/chicago-portland-trump-national-guard-deployments-court-hearings-rcna236201",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "A spirit of rebellion takes over NYC's premier LGBTQ film festival",
    "description": "From “Lesbian Space Princess” to “Come See Me in the Good Light” and “Christy,” the 37th edition of Newfest is flush with films that celebrate resilience, rebellion and art.",
    "link": "https://www.nbcnews.com/nbc-out/out-pop-culture/newfest-new-york-lgbtq-film-festival-rcna236232",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "The swing-state race that shows how Democrats are figuring out their path forward",
    "description": "Democrats’ way back to the House majority could run through a swing district in the nation’s biggest swing state.",
    "link": "https://www.nbcnews.com/politics/2026-election/democratic-party-future-pennsylvania-battleground-house-primary-rcna235400",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "University of California Researchers, Patients Wary of Trump Cuts Even as Some Dollars Flow Again",
    "description": "Biomedical researchers and patients are caught in the middle as the Trump administration continues its campaign to strip grants from universities accused of bias. Courts have restored some frozen funds to California universities, but academics studying brain …",
    "link": "https://kffhealthnews.org/news/article/ucla-california-universities-funding-trump-biomedical-research/",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "Trump Promised a Shipbuilding Boom. He’s Sinking It Instead",
    "description": "After pledging to restore America’s maritime might, the president has gutted the very offices, funding streams, and foreign partnerships that could have made it possible.\nThe post Trump Promised a Shipbuilding Boom. He’s Sinking It Instead appeared first on W…",
    "link": "http://washingtonmonthly.com/2025/10/09/trump-shipbuilding-failure/",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "How to get the most out of the early holiday shopping deals",
    "description": "There has rarely been a more confusing time to be a holiday shopper",
    "link": "https://www.nbcnews.com/business/consumer/early-holiday-shopping-deals-rcna236242",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "Scientists Completed a Toxicity Report on This Forever Chemical. The EPA Hasn’t Released It.",
    "description": "by Sharon Lerner \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nThis spring, scientists at the Environmental Protection Agency completed a rep…",
    "link": "https://www.propublica.org/article/epa-pfna-forever-chemical-report",
    "timestamp": "2025-10-09T09:00:00Z"
  },
  {
    "title": "Europe hails ‘Trump’s Peace Plan’ for Gaza",
    "description": "EU leaders rush to thank the U.S. president for his efforts to end the Israel-Hamas war.",
    "link": "https://www.politico.eu/article/europe-hail-donald-trump-gaza-peace-plan-israel/",
    "timestamp": "2025-10-09T08:59:20Z"
  },
  {
    "title": "Ukraine's new missiles and drones cause gas shortages in Russia, Zelenskyy says",
    "description": "Strikes on Russian oil facilities by Ukraine’s newly developed long-range missiles and drones are causing significant gas shortages in Russia, while on the...",
    "link": "https://www.yahoo.com/news/articles/ukraines-missiles-drones-cause-gas-085855500.html",
    "timestamp": "2025-10-09T08:58:55Z"
  },
  {
    "title": "World leaders welcome first stage of Trump’s Gaza peace deal",
    "description": "UK Prime Minister Keir Starmer, joined by France’s Emmanuel Macron and Turkey’s Recep Tayyip Erdoğan, welcomed President Trump’s Gaza peace deal, calling it a vital step toward ending the war.",
    "link": "https://www.israelnationalnews.com/news/416022",
    "timestamp": "2025-10-09T08:58:34Z"
  },
  {
    "title": "Reporting the Truth When Politicians Lie",
    "description": "Mark Hertsgaard\n\n\n\nWith the global rise of organized misinformation campaigns, outlets should embrace “the truth sandwich” and place a false claim between the actual facts.\r\n\n\r\n\n\nThe post Reporting the Truth When Politicians Lie appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=573082",
    "timestamp": "2025-10-09T08:58:00Z"
  },
  {
    "title": "China Tightens Grip On Rare Earth Exports To Protect 'National Security' As Tech Giants Brace For Impact",
    "description": "China tightened its grip on the export of rare earth minerals and related technologies, escalating tensions with Washington ahead of an expected meeting between President Donald Trump and Chinese leader Xi Jinping later this month.\nChina Says New Rules To Pro…",
    "link": "https://biztoc.com/x/582db076ba626743",
    "timestamp": "2025-10-09T08:56:41Z"
  },
  {
    "title": "Nestle quits global alliance on reducing dairy methane emissions",
    "description": "Food giant Nestle has withdrawn from the Dairy Methane Action Alliance, a global initiative aimed at reducing methane emissions from dairy farming. Despite leaving the alliance, Nestle stated it remains committed to its net-zero targets and will continue work…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nestle-quits-global-alliance-on-reducing-dairy-methane-emissions/articleshow/124410065.cms",
    "timestamp": "2025-10-09T08:56:23Z"
  },
  {
    "title": "What's been agreed in the first phase of the Israel-Hamas ceasefire deal?",
    "description": "Hamas has called on Trump to compel Israel to fully implement the agreement.",
    "link": "https://www.thejournal.ie/whats-been-agreed-in-the-first-phase-of-the-israel-hamas-ceasefire-deal-6839372-Oct2025/",
    "timestamp": "2025-10-09T08:55:58Z"
  },
  {
    "title": "Danielle Smith wants a fight with Canada, not a new pipeline",
    "description": "Alberta's premier has opened the door in her party and province to separatists. Now, she's claiming that other people are the ones threatening Canada's future.",
    "link": "https://www.nationalobserver.com/2025/10/09/opinion/danielle-smith-david-eby-pipelines",
    "timestamp": "2025-10-09T08:55:40Z"
  },
  {
    "title": "Gavin Newsom Has A Field Day With 'DOZY' Trump Moment",
    "description": "The California governor mocked the president for what appeared to be a \"still image.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-gavin-newsom-dozy-don_n_68e76f60e4b0b4458cb7101e",
    "timestamp": "2025-10-09T08:52:07Z"
  },
  {
    "title": "Trump jeopardising US role as scientific leader: Nobel officials",
    "description": "Stockholm (AFP) Oct 2, 2025\n\n\n Donald Trump's assault on science could threaten the United States' position as the world's leading research nation and have knock-on effects worldwide, Nobel Prize officials in Sweden told AFP. \n\nSince taking office in January,…",
    "link": "https://www.spacedaily.com/reports/Trump_jeopardising_US_role_as_scientific_leader_Nobel_officials_999.html",
    "timestamp": "2025-10-09T08:48:54Z"
  },
  {
    "title": "Will Russia implode after Ukraine?",
    "description": "Washington DC (UPI) Oct 8, 2025 \n\n\n Here is a question few have posed or even considered: What will be the fate of Russia after the war in Ukraine ends, as it must sometime? The history of Russia and the USSR after wars ended, and neither was on the winning s…",
    "link": "https://www.spacewar.com/reports/Will_Russia_implode_after_Ukraine_999.html",
    "timestamp": "2025-10-09T08:48:54Z"
  },
  {
    "title": "Nobel peace committee had last meeting on Monday",
    "description": "The Norwegian Nobel Committee held its final meeting for the 2025 Peace Prize on Monday, before the Israel-Hamas ceasefire deal, meaning the agreement did not influence the decision. This year’s prize was awarded to Nihon Hidankyo, a group of Hiroshima and Na…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nobel-peace-committee-had-last-meeting-on-monday/articleshow/124409855.cms",
    "timestamp": "2025-10-09T08:47:58Z"
  },
  {
    "title": "Youth plaintiffs test out a new legal strategy to counter Trump’s support for fossil fuels",
    "description": "They lost their case for a constitutional right to climate protection. Now they’re suing the government again.",
    "link": "https://grist.org/justice/youth-plaintiffs-test-out-a-new-legal-strategy-to-counter-trumps-support-for-fossil-fuels/",
    "timestamp": "2025-10-09T08:45:00Z"
  },
  {
    "title": "Uniqlo's owner sees stronger profit and sales in current fiscal year",
    "description": "Fast Retailing said revenue and profit jumped significantly in the U.S. during the June-August quarter even when the impact of U.S. tariffs set in.",
    "link": "https://www.japantimes.co.jp/business/2025/10/09/companies/uniqlo-profit-strong/",
    "timestamp": "2025-10-09T08:45:00Z"
  },
  {
    "title": "Israel and Hamas agree ceasefire deal – what we know so far: expert Q&A",
    "description": "Middle East expert Scott Lucas addresses the key issues of the Gaza ceasefire deal.",
    "link": "https://theconversation.com/israel-and-hamas-agree-ceasefire-deal-what-we-know-so-far-expert-qanda-267113",
    "timestamp": "2025-10-09T08:42:19Z"
  },
  {
    "title": "Oil little changed as investors weigh Gaza ceasefire, stalled Ukraine talks",
    "description": "LONDON (Reuters) -Oil prices were little changed on Thursday as investors weighed a ceasefire deal in Gaza that could ease geopolitical tensions in the...",
    "link": "https://finance.yahoo.com/news/oil-little-changed-investors-weigh-083240472.html",
    "timestamp": "2025-10-09T08:32:40Z"
  },
  {
    "title": "Democrats say even missed paychecks for US troops won’t be enough to end shutdown alone | CNN Politics",
    "description": "Congressional Democrats are privately preparing to hold their position in the shutdown standoff for several more weeks if Republicans do not agree to their health care demands – and not even a missed paycheck for US troops will force them to yield.",
    "link": "https://www.cnn.com/2025/10/09/politics/democrats-congress-shutdown-military-pay",
    "timestamp": "2025-10-09T08:30:51Z"
  },
  {
    "title": "Blood, bias and the Battle of Florida: how the NHL’s dirtiest rivalry exposed hockey’s old-boy rot",
    "description": "A southern hockey feud has morphed into a clash of styles, politics and privilege that mirrors America itself and exposes how deeply the NHL’s power still skews",
    "link": "https://sports.yahoo.com/article/blood-bias-battle-florida-nhl-083019175.html",
    "timestamp": "2025-10-09T08:30:19Z"
  },
  {
    "title": "Buoyed by a retro revival, Kodak’s dark environmental past is coming to light",
    "description": "A snapshot of Kodak's history includes cameras, military contracts, and a legacy of environmental damage in the communities it is a part of.",
    "link": "https://grist.org/accountability/buoyed-by-a-retro-revival-kodaks-dark-environmental-past-is-coming-to-light/",
    "timestamp": "2025-10-09T08:30:00Z"
  },
  {
    "title": "Why the pro-Palestinian left is wrong to reject Trump's Gaza peace plan",
    "description": "U.S. President Donald Trump's 20-point plan to end Israel's war in Gaza shouldn't be misconstrued as an all-encompassing peace plan, because it's not. It's a cease-fire deal, and the only other option on the table was endless slaughter",
    "link": "https://www.haaretz.com/israel-news/2025-10-09/ty-article/.premium/why-the-pro-palestinian-left-is-wrong-to-reject-trumps-gaza-peace-plan/00000199-c446-d7d2-add9-f5ff75b70000",
    "timestamp": "2025-10-09T08:25:00Z"
  },
  {
    "title": "White House Hails Trump As 'The Peace President' After Israel-Hamas Breakthrough, Fuels Push For Nobel Peace Prize Ahead Of Friday's Announcement",
    "description": "On Wednesday, the White House celebrated Donald Trump's announcement of a historic Israel-Hamas peace agreement — calling him \"The Peace President\" — as momentum builds for the president to receive the 2025 Nobel Peace Prize.\nTrump Announces Hostage Release, …",
    "link": "https://biztoc.com/x/239ffc5167b73b71",
    "timestamp": "2025-10-09T08:23:24Z"
  },
  {
    "title": "Leaders react to agreement on first phase of Trump's Gaza deal",
    "description": "This is a GREAT Day for the Arab and Muslim World, Israel, all surrounding Nations, and the United States of America, and we thank the mediators from Qatar, ...",
    "link": "https://www.yahoo.com/news/articles/leaders-react-agreement-first-phase-081923386.html",
    "timestamp": "2025-10-09T08:19:23Z"
  },
  {
    "title": "China unveils sweeping controls on rare earth exports before Trump talks",
    "description": "The controls on rare earth materials used in phones and defence give Chinese President Xi Jinping more leverage in upcoming talks with US President Donald Trump. They include a measure that mimics a US restriction on exports of chip-related products to China.",
    "link": "https://news.sky.com/story/china-unveils-sweeping-controls-on-rare-earth-exports-before-trump-talks-13447386",
    "timestamp": "2025-10-09T08:18:00Z"
  },
  {
    "title": "Hamas accepts Trump peace plan ending 2 years of war in Gaza, returning hostages",
    "description": "Hamas has agreed to a peace deal pushed by President Donald Trump to end the war in Gaza and return the hostages, two years after the terrorist network attacked Israel on Oct. 7, 2023, sparking not only the bloodiest day for Jews since the Holocaust, but a de…",
    "link": "https://freerepublic.com/focus/f-chat/4345198/posts",
    "timestamp": "2025-10-09T08:16:13Z"
  },
  {
    "title": "Kimmel’s NSFW Punch Line About Stephen Miller’s Interview Glitch Brings The House Down",
    "description": "Kimmel’s NSFW Punch Line About Stephen Miller’s Interview Glitch Brings The House Downhuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-stephen-miller-interview-moment_n_68e7651be4b0d6ab1009c7f1",
    "timestamp": "2025-10-09T08:15:09Z"
  },
  {
    "title": "Modi's 'unqualified praise' for Israeli PM Netanyahu 'morally atrocious': Congress",
    "description": "Prime Minister Narendra Modi welcomed a peace plan agreement for West Asia. The Congress party criticized Modi's praise for Israeli Prime Minister Benjamin Netanyahu. They also pointed out his silence on the future of an independent Palestinian state. The agr…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/modis-unqualified-praise-for-israeli-pm-netanyahu-morally-atrocious-congress/articleshow/124409104.cms",
    "timestamp": "2025-10-09T08:13:09Z"
  },
  {
    "title": "Israel, Hamas Reach Deal to Free Hostages in Gaza Breakthrough",
    "description": "Israel and Hamas have reached a deal for the release of all hostages held by the militant group in Gaza, a major step toward ending a two-year war that’s devastated the Palestinian territory and triggered multiple conflicts in the Middle East as well as prote…",
    "link": "https://financialpost.com/pmn/business-pmn/israel-hamas-reach-deal-to-free-hostages-in-gaza-breakthrough",
    "timestamp": "2025-10-09T08:11:12Z"
  },
  {
    "title": "IMF issues global debt warning",
    "description": "Public debt levels could outgrow the world economy within five years, IMF chief Kristalina Georgieva has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/626117-global-public-debt-imf/",
    "timestamp": "2025-10-09T08:10:39Z"
  },
  {
    "title": "Israel and Hamas reach ceasefire agreement in Gaza — Trump: “All hostages will be home by Monday”",
    "description": "Live updates \nThe post Israel and Hamas reach ceasefire agreement in Gaza — Trump: “All hostages will be home by Monday” appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/09/israel-and-hamas-reach-ceasefire-agreement-in-gaza-trump-all-hostages-will-be-home-by-monday/",
    "timestamp": "2025-10-09T08:05:53Z"
  },
  {
    "title": "The Nobel Prize in literature will be announced on Thursday",
    "description": "The Nobel Prize in literature will be announced on Thursday",
    "link": "https://abcnews.go.com/Entertainment/wireStory/nobel-prize-literature-announced-thursday-126355608",
    "timestamp": "2025-10-09T08:05:43Z"
  },
  {
    "title": "Media reveals outline of Israel-Hamas deal",
    "description": "Israeli forces would reportedly withdraw from most of Gaza, with prisoner exchanges expected within several days Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626124-media-outline-israel-hamas-deal/",
    "timestamp": "2025-10-09T08:01:54Z"
  },
  {
    "title": "IRS Direct Deposit Transition: Taxpayers who do not have a bank account or don’t provide banking details on time may land in big trouble; here’s what you need to know",
    "description": "The Internal Revenue Service is ending paper checks for tax refunds and federal payments. Starting with the 2025 tax year, direct deposit will be mandatory. This change aims to boost efficiency and security. Millions of taxpayers, including those who do not h…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-direct-deposit-transition-taxpayers-who-do-not-have-a-bank-account-or-dont-provide-banking-details-on-time-may-land-in-big-trouble-heres-what-you-need-to-know/articleshow/124408794.cms",
    "timestamp": "2025-10-09T08:01:45Z"
  },
  {
    "title": "Justice Anthony Kennedy wrote the opinion legalizing same-sex marriage. Here’s why he says it won’t be overturned",
    "description": "The current court majority has shown no collective interest in discarding the decade-old landmark. And Kennedy stressed his belief in a core judicial...",
    "link": "https://www.cnn.com/2025/10/09/politics/anthony-kennedy-obergefell-same-sex-marriage-adoption-supreme-court-overturn",
    "timestamp": "2025-10-09T08:00:52Z"
  },
  {
    "title": "Why Trump's team is portraying Antifa as a terrorist threat",
    "description": "U.S. President Donald Trump is trying to persuade Americans that the anti-fascist movement dubbed Antifa poses as grave a threat to the country as designated terrorist organizations such as Hezbollah.",
    "link": "https://www.cbc.ca/news/world/trump-antifa-roundtable-9.6932606",
    "timestamp": "2025-10-09T08:00:00Z"
  },
  {
    "title": "U.S. bill calls for more integration between Canadian, American border agents",
    "description": "The U.S. Congress is being asked to adopt legislation that could lead to Canada and the United States further integrating their enforcement of the border — including allowing U.S. officers to more freely operate on Canadian soil.",
    "link": "https://www.cbc.ca/news/politics/canada-united-states-border-bill-9.6931988",
    "timestamp": "2025-10-09T08:00:00Z"
  },
  {
    "title": "China tightens rare earth export controls",
    "description": "China has tightened its rare earth export controls, expanding restrictions on processing technology and spelling out its intention to limit exports to overseas defence and semiconductor users.",
    "link": "https://www.rte.ie/news/business/2025/1009/1537611-china-tightens-rare-earth-export-controls/",
    "timestamp": "2025-10-09T07:59:41Z"
  },
  {
    "title": "China expands rare earth export restrictions ahead of possible Trump-Xi meeting",
    "description": "China has leveraged its control of the sector in trade talks with the U.S. by threatening a disruptive global shortage of the critically-needed minerals.",
    "link": "https://www.cnbc.com/2025/10/09/china-expands-rare-earth-export-restrictions-ahead-of-possible-trump-xi-meeting.html",
    "timestamp": "2025-10-09T07:57:22Z"
  },
  {
    "title": "French Wine Output to Fall Below 2024 After Fires Ravage Vines",
    "description": "France further cut its estimate for this year’s wine production, putting output below 2024’s historically low level, after summer heat waves and wildfires hit vineyards. With the grape harvest nearly complete, output is now seen at 36 million hectoliters, the…",
    "link": "https://www.insurancejournal.com/news/international/2025/10/09/843086.htm",
    "timestamp": "2025-10-09T07:56:11Z"
  },
  {
    "title": "Trump praised during phone call with hostage families after Hamas agrees to peace plan: video",
    "description": "Loved ones of hostages praised President Trump during a phone call after Hamas accepted his peace plan, ensuring the release of the remaining 48 hostages.",
    "link": "https://www.foxnews.com/us/trump-praised-phone-call-hostage-families-hamas-agrees-peace-plan-video",
    "timestamp": "2025-10-09T07:54:09Z"
  },
  {
    "title": "Zelensky says Russia aims to sow 'chaos' with strikes",
    "description": "President Volodymyr Zelensky accused Russia of wanting to sow \"chaos\" in Ukraine by launching strikes on his country's energy grid and railway infrastructure, in comments published today.",
    "link": "https://www.rte.ie/news/world/2025/1009/1537604-zelensky-russia-ukraine/",
    "timestamp": "2025-10-09T07:48:56Z"
  },
  {
    "title": "엔비디아, 일론 머스크 xAI에 200억 달러 투자 참여",
    "description": "Ross Gerber says he doesn't see the point of buying the new version of the new, cheaper Tesla models. The standard Model 3 sedan will start at $36,990 and the Model Y SUV will start at $39,990 https://t.co/ZreU0G81kK pic.twitter.com/KNTWBtCwls— Bloomberg TV (…",
    "link": "https://ryueyes11.tistory.com/511921",
    "timestamp": "2025-10-09T07:45:58Z"
  }
]