[
  {
    "title": "Senators Sound Alarm As AI Companies Pour Millions Into U.S. Elections",
    "description": "\"The American people are totally unprepared for the transformational and radical impact it's going to have on our society,\" Sen. Bernie Sanders (I-Vt.) said of AI.",
    "link": "https://www.huffpost.com/entry/open-ai-midterm-elections-democrats_n_698fa63fe4b0b886fd324c6f",
    "timestamp": "2026-02-14T11:00:17Z"
  },
  {
    "title": "TikTokers came to Springfield looking for ICE. Then the child trafficking rumors began.",
    "description": "The conspiracy theories have triggered chaos in the Ohio city, where Haitian immigrant families are already on edge",
    "link": "https://www.salon.com/2026/02/14/tiktokers-came-to-springfield-looking-for-ice-then-the-child-trafficking-rumors-began-partner/",
    "timestamp": "2026-02-14T11:00:07Z"
  },
  {
    "title": "Bad Bunny’s Neighborliness Is the Antidote to Ring’s Dystopian Vision",
    "description": "Sunday’s Super Bowl was mostly an exercise in foregone conclusions: Bad Bunny’s halftime show would show off his talent and creativity, the Seahawks would grimly dominate the pitiable Patriots, and I would shout “Get fucked!” at the television when the inevit…",
    "link": "https://newrepublic.com/post/206568/bad-bunny-ring-surveillance-ice",
    "timestamp": "2026-02-14T11:00:00Z"
  },
  {
    "title": "Rubio strikes constructive tone but persists in US criticism of European allies",
    "description": "By Humeyra PamukMUNICH, Feb 14 (Reuters) - U.S. Secretary of State Marco Rubio gave a message of unity to Europeans on Saturday, saying Washington was not looking to aban… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/14/rubio-strikes-constructive-tone-but-persists-in-us-criticism-of-european-allies",
    "timestamp": "2026-02-14T10:56:56Z"
  },
  {
    "title": "AU calls for end to ‘extermination’ of Palestinians, decries African wars",
    "description": "African heads of state gather in Ethiopia's Addis Ababa for the 39th African Union Summit.",
    "link": "https://www.aljazeera.com/news/2026/2/14/au-calls-for-end-to-extermination-of-palestinians-decries-african-wars",
    "timestamp": "2026-02-14T10:51:00Z"
  },
  {
    "title": "Trump reportedly considers senior US Treasury official for German ambassador",
    "description": "John Hurley, currently U.S. undersecretary of the Treasury for terrorism and financial intelligence, has been interviewed for roles including envoy to Germany, the FT reported.",
    "link": "https://www.politico.eu/article/donald-trump-rjohn-hurley-senior-us-treasury-official-german-ambassador/",
    "timestamp": "2026-02-14T10:50:38Z"
  },
  {
    "title": "Wang Yi warns against 'knee-jerk' calls for US-China decoupling",
    "description": "MUNICH: Chinese Foreign Minister Wang Yi warned on Saturday (Feb 14) against \"knee-jerk\" calls for the United States to distance itself from China and said that despite some positive recent signs from the White House, some US voices were undermining the relat…",
    "link": "https://www.channelnewsasia.com/east-asia/china-wang-yi-us-decoupling-munich-security-conference-5931381",
    "timestamp": "2026-02-14T10:50:02Z"
  },
  {
    "title": "Crown prince urges the world to stand with the people of Iran as 250,000 rally in Munich",
    "description": "About 250,000 people demonstrated on Saturday against Iran's government on the sidelines of a gathering of world leaders in Germany, police said, answering a...",
    "link": "https://www.yahoo.com/news/articles/iran-crown-prince-says-ahead-104650284.html",
    "timestamp": "2026-02-14T10:46:50Z"
  },
  {
    "title": "Pam Bondi Crashed Out for a Bizarre Reason. She’s Not Alone.",
    "description": "Pam Bondi is a captive to the “audience of one.” The nation is too.",
    "link": "https://slate.com/news-and-politics/2026/02/pam-bondi-jeanine-pirro-pete-hegseth-donald-trump.html",
    "timestamp": "2026-02-14T10:45:00Z"
  },
  {
    "title": "Starmer says 'Europe must be ready to fight Russia' as WW3 tensions rise",
    "description": "UK Prime Minister Keir Starmer said 'we are not at a crossroads' as he said it's 'straight and clear' ahead.",
    "link": "https://www.ladbible.com/news/uk-news/keir-starmer-europe-russia-war-ready-fight-611238-20260214",
    "timestamp": "2026-02-14T10:39:17Z"
  },
  {
    "title": "Rubio: US And Europe 'Belong Together'",
    "description": "In a speech at the Munich Security Conference, US Secretary of State Marco Rubio has said that the United States and Europe \"belong together.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260214-rferl04.htm",
    "timestamp": "2026-02-14T10:39:02Z"
  },
  {
    "title": "US: Homeland Security shuts down over budget dispute",
    "description": "The budget deadlock in the US Senate comes after highly criticized immigration enforcement operations across several US states. The shutdown has left airport security services working without pay.",
    "link": "https://www.dw.com/en/us-homeland-security-shuts-down-over-budget-dispute/a-75967583",
    "timestamp": "2026-02-14T10:39:00Z"
  },
  {
    "title": "Rubio Wraps Warnings In Warmth As Europe Breathes A Sigh Of Relief",
    "description": "In a hall packed with political and military leaders from across Europe and beyond, US Secretary of State Marco Rubio delivered a speech that managed to do two things at once: reassure anxious allies and issue a stark call for change.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260214-rferl03.htm",
    "timestamp": "2026-02-14T10:37:04Z"
  },
  {
    "title": "Britain will deploy warships to the Arctic",
    "description": "A carrier strike group, led by HMS Prince of Wales, will be sent to the Arctic, the prime minister has told the Munich Security conference.",
    "link": "https://news.sky.com/story/britain-will-deploy-warships-to-the-arctic-starmer-tells-munich-security-conference-13507419",
    "timestamp": "2026-02-14T10:37:00Z"
  },
  {
    "title": "Starmer urges European NATO members to boost ‘hard power’",
    "description": "NATO should move away from “overdependence” on the US and prioritize accumulating “hard power,” Keir Starmer has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632501-starmer-nato-europe-hard-power/",
    "timestamp": "2026-02-14T10:35:54Z"
  },
  {
    "title": "Republicans Worry Shutdown Will Overshadow Trump",
    "description": "“President Donald Trump is barreling ahead with the first State of the Union address of his second term, despite concerns among Republicans that it’s set to hit during a partial government shutdown,” Politico reports. “The speech, set for 11 days from now, is…",
    "link": "https://politicalwire.com/2026/02/14/republicans-worry-shutdown-will-overshadow-trump/",
    "timestamp": "2026-02-14T10:30:00Z"
  },
  {
    "title": "Drone strikes kill 2 in Ukraine and Russia ahead of US-brokered peace talks in Geneva",
    "description": "Drone strikes killed one person in Ukraine and another in Russia on Saturday ahead of fresh U.S.-brokered peace talks",
    "link": "https://abcnews.com/International/wireStory/drone-strikes-kill-2-ukraine-russia-ahead-us-130164619",
    "timestamp": "2026-02-14T10:29:47Z"
  },
  {
    "title": "Rubio tells allies US and Europe 'belong together'",
    "description": "<![CDATA[ \"We do not seek to separate, but to revitalise an old friendship and renew the greatest civilisation in human history,\" said US Secretary of State Marco Rubio. ]]>",
    "link": "https://www.channelnewsasia.com/world/marco-rubio-munich-security-conference-us-europe-5931411",
    "timestamp": "2026-02-14T10:29:00Z"
  },
  {
    "title": "AI tool Claude helped capture Venezuelan dictator Nicolás Maduro in US military raid operation: report",
    "description": "Last month, US special operations forces captured Maduro and his wife, who were brought to the US to face sweeping narcotics charges.",
    "link": "https://www.foxnews.com/us/ai-tool-claude-helped-capture-venezuelan-dictator-maduro-us-military-raid-operation-report%20",
    "timestamp": "2026-02-14T10:26:55Z"
  },
  {
    "title": "Courts have ruled 4,400 times that ICE jailed people illegally. It hasn’t stopped",
    "description": "WASHINGTON, Feb 14 (Reuters) - Hundreds of judges around the country have ruled more than ⁠4,400 times since October that President Donald Trump's administration is detaining immigrants unlawfully, a Reuters review of court records found.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/14/courts-have-ruled-4400-times-that-ice-jailed-people-illegally-it-hasnt-stopped",
    "timestamp": "2026-02-14T10:08:00Z"
  },
  {
    "title": "'Fiction': House Republican campaign chair dismisses Democrats’ expanding GOP target map",
    "description": "House GOP campaign chair scoffs at Democrats' move to expand their midterm battleground map to 44 House districts in this year's battle for the House majority",
    "link": "https://www.foxnews.com/politics/fiction-house-republican-campaign-chair-dismisses-democrats-expanding-gop-target-map",
    "timestamp": "2026-02-14T10:00:40Z"
  },
  {
    "title": "Future kings meet in Saudi Arabia but Andrew-Epstein revelations loom over Prince William",
    "description": "Prince Williams trip to Saudi Arabia to meet with Crown Prince Mohammed bin Salman came at a crucial time for the U.K. but the former Prince Andrew loomed.",
    "link": "https://www.nbcnews.com/world/united-kingdom/prince-william-mohammed-bin-salman-saudi-arabia-epstein-andrew-rcna258954",
    "timestamp": "2026-02-14T10:00:40Z"
  },
  {
    "title": "The Last Fool Standing",
    "description": "This is further proof that Britain is being increasingly left behind by a global rush to dismantle the climate scare. Ed Miliband is now almost alone in accelerating towards decarbonisation. Even if you think he is brave to jump out of the trench and go over …",
    "link": "https://wattsupwiththat.com/2026/02/14/the-last-fool-standing/",
    "timestamp": "2026-02-14T10:00:00Z"
  },
  {
    "title": "Rubio reassures trans-Atlantic ties with Europe at Munich Security Conference",
    "description": "U.S. Secretary of State Marco Rubio delivered a calm and reassuring message to America's allies in Munich, after more than a year of President Donald Trump's often-hostile rhetoric toward allies.",
    "link": "https://www.npr.org/2026/02/14/g-s1-110107/rubio-speech-munich",
    "timestamp": "2026-02-14T09:59:33Z"
  },
  {
    "title": "Judge blocks Trump administration from cutting $600 million in public health funds - NewsBreak",
    "description": "Feb 12 (Reuters) - A federal judge in Chicago temporarily blocked on Thursday the Trump administration from moving ahead with $600 million in cuts to publi",
    "link": "https://www.newsbreak.com/share/4490875901495-judge-blocks-trump-administration-from-cutting-600-million-in-public-health-funds?s=a2&amp;share_destination_id=MTk1MDk1ODMxLTE3NzEwNjMwMjc0OTA%3D&amp;pd=0DCbKx5w&amp;hl=en_US&amp;send_time=1771063027&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.6.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-14T09:58:42Z"
  },
  {
    "title": "Battenfeld: Seth Moulton scores major migrant PR coup in Senate campaign",
    "description": "In the latest installment of Democrats using immigrants as props, U.S. Rep. Seth Moulton – in an obvious bid to bolster his flailing Senate campaign – has scored a publicity coup, getting former teen detainee Marcelo Gomes da Silva to be his guest at the Stat…",
    "link": "https://www.bostonherald.com/2026/02/14/battenfeld-seth-moulton-scores-major-migrant-pr-coup-in-senate-campaign/",
    "timestamp": "2026-02-14T09:54:40Z"
  },
  {
    "title": "Start-stop stiffed: EPA kills annoying automatic engine shutoff",
    "description": "The EPA just delivered news that millions of fed-up American drivers have been waiting for: Automatic start-stop technology is no longer being propped up by federal regulation.On February 12, 2026, President Donald Trump and EPA Administrator Lee Zeldin annou…",
    "link": "https://www.theblaze.com/align/start-stop-stiffed-epa-kills-annoying-automatic-engine-shutoff",
    "timestamp": "2026-02-14T09:30:00Z"
  },
  {
    "title": "Anduril aims for $8 billion fundraising: Bloomberg",
    "description": "US defence firm Anduril Industries is in talks to raise up to $8 billion in a new funding round at a valuation of at least $60 billion, according to Bloomberg. The funding would support its first major weapons-manufacturing facility and the development of an …",
    "link": "https://economictimes.indiatimes.com/tech/funding/anduril-aims-for-8-billion-fundraising-bloomberg/articleshow/128342080.cms",
    "timestamp": "2026-02-14T09:29:32Z"
  },
  {
    "title": "Rubio expresses desire to maintain trans-Atlantic relations despite increasing rift",
    "description": "U.S. Secretary of State Marco Rubio has offered a friendly and reassuring assessment of America’s relations with Europe under President Donald Trump’s administration",
    "link": "https://abcnews.com/International/wireStory/rubio-expresses-desire-maintain-trans-atlantic-relations-despite-130164787",
    "timestamp": "2026-02-14T09:17:50Z"
  },
  {
    "title": "‘We’re so vulnerable’: How Canadians can cope with anxiety in the face of existential threats from the U.S.",
    "description": "U.S. President Donald Trump’s second term has threatened Canada with annexation and economic ruin, leaving some Canadians feeling anxious and concerned. A Winnipeg therapist offers strategies for coping with those emotions.",
    "link": "https://www.cbc.ca/news/canada/united-states-threats-canada-anxiety-coping-9.7083301",
    "timestamp": "2026-02-14T09:00:00Z"
  },
  {
    "title": "Amid 'Buy Canadian' fervour, Canada's top pension funds still heavily invested in U.S.",
    "description": "Despite the U.S. trade war and President Donald Trump's threats to Canadian sovereignty, this country's biggest pension funds remain heavily invested in the U.S. The Canada Pension Plan announced this week that it has grown to a record $780.7 billion in asset…",
    "link": "https://www.cbc.ca/news/investigates/cpp-us-investments-record-assests-9.7088667",
    "timestamp": "2026-02-14T09:00:00Z"
  },
  {
    "title": "From umbrella to uncertainty: Europe and Canada's nuclear deterrence anxiety",
    "description": "European allies are quietly exploring closer nuclear deterrence ties with France amid growing anxiety about the long-term reliability of U.S. security guarantees. Germany and Poland have acknowledged early-stage talks with Paris, while French President Emmanu…",
    "link": "https://www.cbc.ca/news/politics/canada-france-europe-nuclear-weapons-9.7089805",
    "timestamp": "2026-02-14T09:00:00Z"
  },
  {
    "title": "Take the tunnel, Windsor city councilor says as Ambassador Bridge owners lobby against new bridge",
    "description": "A city councilor in Windsor, Ont., is encouraging Canadians who want to buy Canadian to travel from Windsor to Detroit through the Windsor-Detroit tunnel instead of crossing the Ambassador Bridge.",
    "link": "https://www.cbc.ca/news/canada/windsor/marignani-urges-tunnel-use-among-windsorites-9.7089240",
    "timestamp": "2026-02-14T09:00:00Z"
  },
  {
    "title": "Trade deal with U.S. secures best tariff rates, safeguards local sectors: Cabinet",
    "description": "Taiwan has secured highly favorable tariff treatment while protecting key domestic industries under its newly signed reciprocal trade agreement with the United States, the Cabinet said Thursday, at the conclusion of a 10‑month negotiation process on the deal.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2026/taiwan-260213-cna04.htm",
    "timestamp": "2026-02-14T08:59:06Z"
  },
  {
    "title": "Trump Says Zelensky Has to Get Moving, Russia Wants to Make a Deal",
    "description": "US President Donald Trump said on Friday that Volodymyr Zelensky should hurry up because Russia is willing to make a deal, otherwise, an opportunity will be missed. The Ministry of the Interior has launched a project to develop a new feature for the Emergency…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260213-sputnik01.htm",
    "timestamp": "2026-02-14T08:59:06Z"
  },
  {
    "title": "Gaza's civil defense says 8,000 bodies of genocide victims remain under rubble",
    "description": "The civil defense in the Gaza Strip says thousands of bodies are still buried beneath the ruins of destroyed buildings across the Palestinian territory, as rescue teams struggle to reach neighborhoods devastated during the Israeli regime's war of genocide.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260214-presstv01.htm",
    "timestamp": "2026-02-14T08:59:05Z"
  },
  {
    "title": "Funding lapse set to trigger US Department of Homeland Security shutdown",
    "description": "The United States Department of Homeland Security is expected to enter a shutdown after lawmakers failed to pass legislation to keep the agency funded beyond Saturday midnight in Washington, D.C.",
    "link": "https://www.globalsecurity.org/security/library/news/2026/02/sec-260214-presstv01.htm",
    "timestamp": "2026-02-14T08:59:05Z"
  },
  {
    "title": "Andris Sprūds: Latvia will take part in the NATO Arctic Sentry operation",
    "description": "On Wednesday, 11 February, NATO launched Operation Arctic Sentry. The operation is aimed at strengthening NATO's position in the Arctic and the High North, while expanding the Alliance's sustained presence in the region.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260213-latvia-mod02.htm",
    "timestamp": "2026-02-14T08:59:05Z"
  },
  {
    "title": "Trump calls Herzog 'disgraceful' for refusing to pardon Netanyahu",
    "description": "US President Donald Trump called Israeli president Isaac Herzog \"disgraceful\" for refusing to pardon prime minister Benjamin Netanyahu, escalating his public pressure campaign as Netanyahu's corruption trial drags on.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2026/02/israel-260213-presstv01.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "Iran's progress 'miraculous, extraordinary' despite sanctions: Nuclear chief",
    "description": "Head of the Atomic Energy Organization of Iran (AEOI) Mohammad Eslami says the country has succeeded in making remarkable progress in the nuclear industry despite the enemies' all-out pressures.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260213-presstv01.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "China warns of 'measures' following CIA's Chinese-language recruitment drive",
    "description": "Beijing has warned it would take \"all necessary measures\" against foreign spies, hitting back after the US spy agency posted a recruitment video aimed at Chinese military personnel.",
    "link": "https://www.globalsecurity.org/intell/library/news/2026/intell-260213-presstv01.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "Eslami: Enemies pursuing 'pressure from outside, collapse from inside' strategy against Iran",
    "description": "Mohammad Eslami, Vice President and Head of the Atomic Energy Organization of Iran (AEOI), says enemies of Iran are pursuing a strategy of \"pressure from outside and collapse from inside\" against Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260213-irna02.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "Shamkhani warns of 'strong, decisive' response to any adventurism against Iran",
    "description": "Iran will deliver a \"strong, decisive, and appropriate\" response to any adventurism against it, Rear Admiral Ali Shamkhani warned, underscoring Tehran's high military readiness amid increasing US threats.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260213-presstv02.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "UN sounds alarm over US-generated energy crisis in Cuba",
    "description": "The United Nations has sounded the alarm over the energy crisis in Cuba after it was cut off by the US President Donald Trump administration from fuel supplied by Venezuela.",
    "link": "https://www.globalsecurity.org/wmd/library/news/cuba/cuba-260213-presstv01.htm",
    "timestamp": "2026-02-14T08:59:04Z"
  },
  {
    "title": "China, US agree to strengthen dialogue, cooperation in various fields",
    "description": "Chinese Foreign Minister Wang Yi met with US Secretary of State Marco Rubio here Friday on the sidelines of the Munich Security Conference, with both sides agreeing to strengthen dialogue and cooperation in various fields and promote the stable development of…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/02/china-260214-globaltimes02.htm",
    "timestamp": "2026-02-14T08:46:49Z"
  },
  {
    "title": "U.S. readies for weeks-long Iran strikes as Trump weighs attack, officials say",
    "description": "The Pentagon is preparing for a prolonged campaign that could expand beyond nuclear sites to Iranian state and security targets. U.S. officials expect retaliation and escalating reprisals, raising fears of a wider regional war even as talks continue",
    "link": "https://www.haaretz.com/middle-east-news/iran/2026-02-14/ty-article/u-s-readies-for-weeks-long-iran-strikes-as-trump-weighs-attack-sources-say/0000019c-5b01-d349-a9dc-dbfd1f810000",
    "timestamp": "2026-02-14T08:44:22Z"
  },
  {
    "title": "US to spend €32 billion to expand ICE detention centre capacity",
    "description": "The move would increase Immigration and Customs Enforcement’s bed capacity to 92,600 as it anticipates heightened “enforcement operations and arrests in 2026″.",
    "link": "https://www.thejournal.ie/us-to-spend-e32-billion-to-expand-ice-detention-centre-capacity-6957060-Feb2026/",
    "timestamp": "2026-02-14T08:41:22Z"
  },
  {
    "title": "Poll shows about 70% of Americans oppose taking control of Greenland",
    "description": "According to the latest public opinion poll released by the Associated Press, about 70 percent of Americans oppose the United States taking control of Greenland, an autonomous territory of Denmark. Among Republicans who support U.S. President Donald Trump, ab…",
    "link": "https://freerepublic.com/focus/f-news/4366820/posts",
    "timestamp": "2026-02-14T08:29:29Z"
  },
  {
    "title": "At Munich Conference, Merz Urges US, Europe To 'Repair And Revive' Transatlantic Trust",
    "description": "German Chancellor Friedrich Merz opened the Munich Security Conference by describing a geopolitical landscape bereft of its former signposts, saying the old world order \"no longer exists,\" warning of threats posed by Russia and China, and suggesting US-Europe…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260214-rferl02.htm",
    "timestamp": "2026-02-14T08:21:02Z"
  },
  {
    "title": "All Eyes On Rubio: Munich Braces For Transatlantic Reality Check",
    "description": "The first day of the Munich Security Conference (MSC) ended late on February 13 with the world's foreign-policy elite left in a state of suspended animation.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260214-rferl01.htm",
    "timestamp": "2026-02-14T08:18:00Z"
  },
  {
    "title": "Trump Says Regime Change 'Best Thing That Could Happen' In Iran",
    "description": "US President Donald Trump said regime change is the \"best thing that could happen\" in Iran, as he confirmed that a second aircraft carrier would soon join a \"massive\" US armada in the Arabian Sea amid high tensions between the bitter rivals.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260214-rferl01.htm",
    "timestamp": "2026-02-14T08:16:44Z"
  },
  {
    "title": "Ford vs Ferrari, Hunt vs Lauda... Motoring’s biggest rivalries",
    "description": "Competition improves the breed, but sometimes it gets personal. Here are the most explosive battles\n\nThe automotive industry is competitive by nature but some carmakers feud more intensely than others.\r\n\nRacing is often the source of the conflicts that seep i…",
    "link": "https://www.autocar.co.uk/car-news/features/ford-vs-ferrari-hunt-vs-lauda-motoring%E2%80%99s-biggest-rivalries",
    "timestamp": "2026-02-14T08:00:00Z"
  },
  {
    "title": "Iranian security use dragnet spanning the entire country to arrest protesters",
    "description": "A month after Iran launched a crackdown on nationwide protests, widespread arrests are roiling the country",
    "link": "https://abcnews.com/International/wireStory/iranian-security-dragnet-spanning-entire-country-arrest-protesters-130163811",
    "timestamp": "2026-02-14T07:57:23Z"
  },
  {
    "title": "Trump Media files for two new crypto ETFs tied to Bitcoin, Ether, Cronos",
    "description": "Trump Media & Technology Group filed with the SEC to launch two crypto ETFs tied to Bitcoin, Ether and Cronos, partnering with Crypto.com for custody, liquidity and staking services.",
    "link": "https://cointelegraph.com/news/trump-media-files-crypto-etfs-bitcoin-ether-cronos-sec",
    "timestamp": "2026-02-14T07:47:53Z"
  },
  {
    "title": "U.S. military preparing for extended Iran operations: Reuters",
    "description": "U.S. military preparing for extended Iran operations: Reuterscnbc.com",
    "link": "https://www.cnbc.com/2026/02/14/us-military-preparing-for-extended-iran-operations-reuters.html",
    "timestamp": "2026-02-14T07:41:40Z"
  },
  {
    "title": "Cliff Taylor: Ireland may be about to find itself left outside Europe’s inner club",
    "description": "We can’t afford to be seen as also-rans, but there were worrying signs this week",
    "link": "https://www.irishtimes.com/opinion/2026/02/14/cliff-taylor-ireland-may-be-about-to-find-itself-left-outside-europes-inner-club/",
    "timestamp": "2026-02-14T07:05:00Z"
  },
  {
    "title": "Live updates: Marco Rubio delivers speech at Munich Security Conference, Trump administration news",
    "description": "More than 50 members of Congress are attending the Munich Security Conference, which runs through Sunday. Follow for live updates.",
    "link": "https://www.cnn.com/us/live-news/trump-administration-rubio-munich-02-14-26",
    "timestamp": "2026-02-14T07:04:52Z"
  },
  {
    "title": "Culleton case hikes fear among undocumented Irish in US",
    "description": "The case of Kilkenny man Seamus Culleton has raised worries and several questions this week about what a changing United States means for not only the 'undocumented Irish' but also for their loved ones on both sides of the Atlantic.",
    "link": "https://www.rte.ie/news/us/2026/0214/1558438-seamus-culleton-us/",
    "timestamp": "2026-02-14T07:01:02Z"
  },
  {
    "title": "Hurry up and wait: The struggle to boost Europe's economy",
    "description": "When it comes to removing barriers to the internal market the results are, indeed, mixed, writes Europe Editor Tony Connelly.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2026/0214/1558424-european-economy/",
    "timestamp": "2026-02-14T07:00:00Z"
  },
  {
    "title": "US ends temporary protected status for Yemeni refugees, asylum seekers",
    "description": "Homeland Security Secretary Kristi Noem has determined it is safe for Yemenis to return to their war-torn country.",
    "link": "https://www.aljazeera.com/news/2026/2/14/us-ends-temporary-protected-status-for-yemeni-refugees-asylum-seekers",
    "timestamp": "2026-02-14T06:59:55Z"
  },
  {
    "title": "Zelenskyy Meets Son Of Iran's Last Shah In Show Of 'Support'",
    "description": "Ukrainian President Volodymyr Zelenskyy has met Reza Pahlavi, the exiled son of the last shah of Iran - an extremely rare meeting at such a level for the former crown prince who is one of many figures vying for prominence among the fractured Iranian oppositio…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260213-rferl01.htm",
    "timestamp": "2026-02-14T06:59:20Z"
  },
  {
    "title": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel",
    "description": "Cuba’s government appears to be on the brink of economic collapse amid a worsening energy crisis.",
    "link": "https://www.cnbc.com/2026/02/14/cuba-fuel-shortage-trump-tariffs.html",
    "timestamp": "2026-02-14T06:58:06Z"
  },
  {
    "title": "Greenland prepares next generation for mining future",
    "description": "Greenland's mining school trains students to operate heavy machinery, aiming to fuel a lucrative mining future and achieve financial independence from Denmark. Despite potential mineral wealth, questions linger about deposit sizes and the lack of infrastructu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/greenland-prepares-next-generation-for-mining-future/articleshow/128337547.cms",
    "timestamp": "2026-02-14T06:44:59Z"
  },
  {
    "title": "Jeff Bezos: cutting the legs off The Washington Post",
    "description": "A stalwart of American journalism is a shadow of itself after swingeing cuts by its billionaire owner",
    "link": "https://theweek.com/media/jeff-bezos-washington-post-cuts",
    "timestamp": "2026-02-14T06:35:00Z"
  },
  {
    "title": "Politico on the Munich Conference: Europe is spending more on defense and can stand up to the US",
    "description": "As analysts note, this Europe is “a creation of Trump” — and he may ultimately not like it\nThe post Politico on the Munich Conference: Europe is spending more on defense and can stand up to the US appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/02/14/politico-on-the-munich-conference-europe-is-spending-more-on-defense-and-can-stand-up-to-the-us/",
    "timestamp": "2026-02-14T06:22:05Z"
  },
  {
    "title": "Rubio at Munich security meet to address Europeans rattled by Trump",
    "description": "U.S. Secretary of State Marco Rubio was set to address European leaders on Saturday as they try to step up their autonomy in defence while salvaging transatlantic ties badly strained under President Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/rubio-at-munich-security-meet-to-address-europeans-rattled-by-trump-218932",
    "timestamp": "2026-02-14T06:18:21Z"
  },
  {
    "title": "Marco Rubio at Munich security meet to address Europeans rattled by Trump",
    "description": "European leaders are meeting in Munich to boost their defense capabilities. They aim to strengthen ties with the United States amid concerns over past policies. US Secretary of State Marco Rubio will address the conference. The war in Ukraine remains a key fo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/marco-rubio-at-munich-security-meet-to-address-europeans-rattled-by-trump/articleshow/128336490.cms",
    "timestamp": "2026-02-14T06:15:09Z"
  },
  {
    "title": "Trump says change of power in Iran would be 'best thing'",
    "description": "U.S. President Donald Trump said Friday that a change of government in Iran would be the \"best thing that could happen,\" as he sent a second aircraft carrier to the Middle East to ratchet up military pressure on the Islamic republic.",
    "link": "https://www.hurriyetdailynews.com/trump-says-change-of-power-in-iran-would-be-best-thing-218931",
    "timestamp": "2026-02-14T06:15:05Z"
  },
  {
    "title": "Partial shutdown at US Department of Homeland Security",
    "description": "The Department of Homeland Security faces a partial shutdown Saturday as lawmakers are locked in a dispute over funding for President Donald Trump's immigration crackdown. Thousands of government workers face furloughs or unpaid work. The core issue is fundin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-department-of-homeland-security-faces-partial-shutdown-amid-funding-dispute-over-ice-operations/articleshow/128336360.cms",
    "timestamp": "2026-02-14T06:13:02Z"
  },
  {
    "title": "The World This Week | US revises interim trade deal fact sheet, BNP wins Bangladesh elections, and Apple Daily founder sentenced to 20 years",
    "description": "From the White House revising its fact sheet on the India-US interim trade deal to the Bangladesh general elections, here is a look at some of the major global events that took place this week.",
    "link": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/india-us-trade-deal-bangladesh-election-result-jimmy-lai-sentenced-10530903/",
    "timestamp": "2026-02-14T06:05:16Z"
  },
  {
    "title": "Widespread arrests roil Iran weeks after security forces crushed protests",
    "description": "Such arrests have been happening for weeks following the government crackdown last month that crushed the protests calling for the end of the country's theocratic rule",
    "link": "https://www.thehindubusinessline.com/news/world/widespread-arrests-roil-iran-weeks-after-security-forces-crushed-protests/article70631431.ece",
    "timestamp": "2026-02-14T06:00:25Z"
  },
  {
    "title": "Denis Staunton: Washington’s bulldozer diplomacy has nudged Europe closer to China",
    "description": "EU governments weigh question of pursuing closer ties with Beijing and sticking to their values",
    "link": "https://www.irishtimes.com/opinion/2026/02/14/denis-staunton-united-states-donald-trump-diplomacy-europe-closer-china/",
    "timestamp": "2026-02-14T06:00:01Z"
  },
  {
    "title": "Jennifer O'Connell: What do women want on Valentine’s Day? Not a chiding letter about their egg reserves",
    "description": "Would the prospect of a passive-aggressive letter from a middle-ranking Department of Health bureaucrat get you in the mood?",
    "link": "https://www.irishtimes.com/opinion/2026/02/14/jennifer-oconnell-what-do-women-want-on-valentines-day-not-a-chiding-letter-about-their-egg-reserves/",
    "timestamp": "2026-02-14T06:00:01Z"
  },
  {
    "title": "Oscar nominee Wagner Moura: ‘I didn’t want to keep playing drug dealers. Latinos are way more than that’",
    "description": "The ‘Narcos’ star once faced censorship from Brazil’s then president Jair Bolsonaro, and is now the plucky underdog of this year’s Best Actor Oscar race. He speaks to Tom Murray about fighting stereotypes, the political importance of ‘The Secret Agent’, and v…",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/wagner-moura-interview-the-secret-agent-oscars-b2918102.html",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "Trump orders Pentagon to boost coal power purchases",
    "description": "President Donald Trump directed the Pentagon to increase long-term purchases of electricity from coal-fired power plants, framing the move as a boost to energy security and grid reliability. The order instructs the military to seek power from the U.S. coal ge…",
    "link": "https://www.naturalnews.com/2026-02-14-trump-orders-pentagon-to-boost-coal-purchases.html",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "Trump moves to enforce nationwide voter ID requirements ahead of midterms",
    "description": "Trump’s Executive Order Threat: President Donald Trump announced plans to mandate strict voter ID requirements for the 2026 midterms via executive order, bypassing Congress if necessary. He accused Democrats of enabling election fraud by opposing voter verifi…",
    "link": "https://www.naturalnews.com/2026-02-14-trump-to-enforce-nationwide-voter-id-requirements-midterms.html",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "‘I used to snort cocaine off of toilet seats’: The long, strange trip of Robert Kennedy Jr",
    "description": "From fringe protest candidate to Trump’s health secretary, RFK’s unlikely survival story is pure American surrealism",
    "link": "https://www.irishtimes.com/world/us/2026/02/14/the-long-strange-trip-of-robert-kennedy-jr/",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "A small German state’s quiet revolt against Microsoft – and what it means for Europe",
    "description": "How Schleswig-Holstein is challenging big tech dominance and redefining digital sovereignty",
    "link": "https://www.irishtimes.com/world/europe/2026/02/14/a-small-german-states-quiet-revolt-against-microsoft-and-what-it-means-for-europe/",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "Washington smuggled 6,000 Starlink terminals into Iran as regime scrambles to seize 40,000 stations",
    "description": "A digital war is taking place in Iran. The United States government directly facilitated the smuggling of thousands of Starlink satellite internet terminals into Iran earlier this year, aiming to pierce the regime’s digital iron curtain. According to a report…",
    "link": "https://www.naturalnews.com/2026-02-14-washington-smuggled-6000-starlink-terminals-into-iran.html",
    "timestamp": "2026-02-14T06:00:00Z"
  },
  {
    "title": "DAVE BOSIE: Senate Republicans Must Stand Tall And Pass SAVE America Act",
    "description": "It’s welcome news that the U.S. House of Representatives has passed one of President Donald Trump’s top legislative priorities, Republican Texas Rep. Chip Roy’s SAVE America Act.  This commonsense legislation makes long overdue reforms to our broken election …",
    "link": "https://dailycaller.com/2026/02/14/opinion-senate-republicans-must-stand-tall-and-pass-the-save-america-act-dave-bosie-opinion/",
    "timestamp": "2026-02-14T05:58:26Z"
  },
  {
    "title": "American held in Venezuela during Maduro’s last days tells all",
    "description": "James Luckey-Lange has been spending a lot of time looking at the names he carved on a bar of soap he smuggled out of a Venezuelan prison in his underwear.",
    "link": "https://www.cnn.com/2026/02/14/politics/american-detained-venezuela-maduro",
    "timestamp": "2026-02-14T05:45:52Z"
  },
  {
    "title": "Widespread arrests roil Iran weeks after security forces crushed protests",
    "description": "Iranian security forces are detaining thousands following recent protests.  Families are searching for loved ones, with many held incommunicado.  Authorities are using surveillance to identify participants.  Despite the crackdown, defiance continues from vari…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/widespread-arrests-roil-iran-weeks-after-security-forces-crushed-protests/articleshow/128335741.cms",
    "timestamp": "2026-02-14T05:38:49Z"
  },
  {
    "title": "Lindsey Graham’s message to Europeans ‘nervous’ about Trump: ‘Who gives a s–t who owns Greenland?’",
    "description": "\"If you're nervous, have a beer, go see a doctor … stop being nervous,” Graham said.",
    "link": "https://nypost.com/2026/02/14/us-news/lindsey-grahams-message-to-europeans-nervous-about-trump-who-gives-a-s-t-who-owns-greenland/",
    "timestamp": "2026-02-14T05:36:09Z"
  },
  {
    "title": "Rubio to address Europeans at Munich Security Conference",
    "description": "US Secretary of State Marco Rubio was set to address European leaders as they try to step up their autonomy in defence while salvaging transatlantic ties badly strained under US President Donald Trump.",
    "link": "https://www.rte.ie/news/world/2026/0214/1558461-rubio-munich-security-conference/",
    "timestamp": "2026-02-14T05:35:27Z"
  },
  {
    "title": "News Summary-Intelligence Report 2/13/2026*Starr-Epstein*Fed Agents Lying Probe*German Leader Disses MAGA*Trump Warns Iran*British Palestine Group Ban Tossed*Trump Push Netanyahu Pardon*Aussie Opposition Leader Ousted*Tommy Robinson Links Epstein Saudis*",
    "description": "\"It was great having Jeffrey here. He's a prince\" Ken Starr... Three killed in the latest US military attack on... The NAACP threatening to sue Elon Musk's xAI over gas turbines in... Los Angeles police say a federal agent was attacked and hurt this afternoon…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366813/posts",
    "timestamp": "2026-02-14T05:33:07Z"
  },
  {
    "title": "The Irish Independent’s view: Old rules-based world order is gone – what emerges is anyone’s guess",
    "description": "A year has passed since JD Vance’s con­cussive speech stunned Europe, leaving the Continent in no doubt that America was going its own way.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-old-rules-based-world-order-is-gone-what-emerges-is-anyones-guess/a1365346890.html",
    "timestamp": "2026-02-14T05:30:00Z"
  },
  {
    "title": "Exclusive: US military preparing for potentially weeks-long Iran operations (Reuters)",
    "description": "Reuters:\nExclusive: US military preparing for potentially weeks-long Iran operations  —  The U.S. military is preparing for the possibility of sustained, weeks-long operations against Iran if President Donald Trump orders an attack, two U.S. officials told Re…",
    "link": "https://www.memeorandum.com/260214/p3",
    "timestamp": "2026-02-14T05:30:00Z"
  },
  {
    "title": "Europe will still face an aggressive Russia if war in Ukraine ends – Macron",
    "description": "Europe must turn its focus to long-term strategic thinking, including creating deep-strike capabilities and assessing how France’s nuclear deterrent can fit into the bloc’s future security architecture, France’s president said yesterday.",
    "link": "https://www.independent.ie/world-news/europe/europe-will-still-face-an-aggressive-russia-if-war-in-ukraine-ends-macron/a1977162488.html",
    "timestamp": "2026-02-14T05:30:00Z"
  },
  {
    "title": "US DOJ sues Harvard for failing to provide data on race in admissions probe",
    "description": "The university said it has complied with civil rights law under a 2023 Supreme Court decision, which effectively barred universities from using race as a factor in university admissions",
    "link": "https://www.business-standard.com/world-news/us-doj-sues-harvard-for-failing-to-provide-data-on-race-in-admissions-probe-126021400584_1.html",
    "timestamp": "2026-02-14T05:29:30Z"
  }
]