[
  {
    "title": "What Does Trump Want In The ‘Big, Beautiful Bill’?",
    "description": "By George Caldwell, The Daily Signal | June 02, 2025\nAs the “big, beautiful” budget reconciliation bill moves to the Senate, one major question remains: What exactly does President Donald Trump want in it?\nTrump has consistently pushed for the bill’s passage,…",
    "link": "https://biztoc.com/x/ac0168074c816d62",
    "timestamp": "2025-06-04T10:18:41Z"
  },
  {
    "title": "Xi Jinping Reluctant to Meet 'Unpredictable' Trump: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's \"unpredictable\" diplomatic behavior could prevent his meeting his Chinese counterpart, Xi Jinping to end the trade war between the world's two largest economies, it has been reported.\n…",
    "link": "https://biztoc.com/x/3ee5bbd2f362b0a1",
    "timestamp": "2025-06-04T10:18:39Z"
  },
  {
    "title": "US stock futures little changed as investors await trade news, jobs report",
    "description": "President Donald Trump said he expected a call with Chinese leader Xi Jinping this week to discuss trade.",
    "link": "https://www.usatoday.com/story/money/markets/2025/06/04/stocks-trade-news-jobs-report/84021312007/",
    "timestamp": "2025-06-04T10:17:28Z"
  },
  {
    "title": "Xi Jinping Reluctant to Meet 'Unpredictable' Trump: Report",
    "description": "Politico reported that that Trump \"is obsessed with having a call with Xi.\"",
    "link": "https://www.newsweek.com/china-xi-trump-meeting-2080695",
    "timestamp": "2025-06-04T10:13:54Z"
  },
  {
    "title": "Donald Trump doubles US steel and aluminium tariffs to 50%",
    "description": "Trump doubles down on his tariffs, while sparing the UK from the latest duties.",
    "link": "https://www.bbc.co.uk/news/articles/cj3j7z73yv2o",
    "timestamp": "2025-06-04T10:09:41Z"
  },
  {
    "title": "India can increase imports of shale gas, LNG, crude from US: Official",
    "description": "India aims to diversify its import basket by increasing purchases of shale gas, LNG, and crude oil from the US, leveraging lower prices. Trade talks are scheduled amidst uncertainties like potential tariff hikes, with India prioritizing a balanced, mutually b…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-can-increase-imports-of-shale-gas-lng-crude-from-us-official/articleshow/121620821.cms",
    "timestamp": "2025-06-04T10:08:56Z"
  },
  {
    "title": "Trump Ignores Elon Musk Drama",
    "description": "“Donald Trump chose not to acknowledge Elon Musk in his first posts on Truth Social after the billionaire went nuclear on the president’s signature spending bill,” the Daily Beast reports. “The president posted several times",
    "link": "https://politicalwire.com/2025/06/04/trump-ignores-elon-musk-drama/",
    "timestamp": "2025-06-04T10:08:37Z"
  },
  {
    "title": "The Federal Judiciary’s War on Trump Is Not About Protecting Us from Government Overreach",
    "description": "So far, in his second term, Donald Trump’s biggest headaches haven’t come from the Democrats or his fellow Republicans. Nor have they come from the groups that were his biggest enemies in his first term—the media, federal bureaucrats, or the intelligence agen…",
    "link": "https://biztoc.com/x/cc1e7916f1b9c845",
    "timestamp": "2025-06-04T10:07:23Z"
  },
  {
    "title": "‘Modi is not India and India is not Modi’: Congress hits back at BJP's criticism of Rahul Gandhi",
    "description": "The Congress party has intensified its criticism of Prime Minister Narendra Modi, accusing him of repeatedly surrendering India's national interests. Pawan Khera asserted that Modi's actions align with a pattern of cowardice, contrasting it with Indira Gandhi…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/modi-is-not-india-and-india-is-not-modi-congress-hits-back-at-bjps-criticism-of-rahul-gandhi/articleshow/121620757.cms",
    "timestamp": "2025-06-04T10:06:52Z"
  },
  {
    "title": "Positive tariff talks take place between US and EU",
    "description": "EU’s Maros Sefcovic meets with US trade representative Jamieson Greer amid trade tensions",
    "link": "https://www.irishtimes.com/business/2025/06/04/positive-tariff-talks-take-place-between-us-and-eu/",
    "timestamp": "2025-06-04T10:05:29Z"
  },
  {
    "title": "Duffy Wants Innovators To Lead ATC Overhaul",
    "description": "Issues RFI For “Integrator” To Coordinate All Aspects Of Project U.S. Department of Transportation Secretary Sean P. Duffy announced that the FAA is looking for an innovative company to play the role of “integrator” who will lead the build-out of a brand-new,…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=826AFA15-698C-43A8-AB8B-A5376D57AE20",
    "timestamp": "2025-06-04T10:05:00Z"
  },
  {
    "title": "'The biggest political scandal': Trump goes off in overnight Truth Social binge",
    "description": "Donald Trump was up in the wee hours of the morning and fired off three posts on Truth Social that included complaining about having to deal with China and then attacking former President Joe Biden.After spending most of the day silent on his social media pla…",
    "link": "https://www.rawstory.com/trump-political-scandal-rant/",
    "timestamp": "2025-06-04T10:04:57Z"
  },
  {
    "title": "Trump Officials Delayed Farm Trade Report",
    "description": "“Trump administration officials delayed and redacted a government forecast because it predicts an increase in the nation’s trade deficit in farm goods later this year,“ Politico reports. “The numbers run counter to President Donald Trump’s",
    "link": "https://politicalwire.com/2025/06/04/trump-officials-delayed-farm-trade-report/",
    "timestamp": "2025-06-04T10:03:41Z"
  },
  {
    "title": "Social Security COLA 2026: Will Tariffs Impact It?",
    "description": "The cost-of-living adjustment is important for retirees on Social Security to keep up with rising costs of living. Find out if tariffs will impact it for...",
    "link": "https://finance.yahoo.com/news/social-security-cola-2026-tariffs-100235109.html",
    "timestamp": "2025-06-04T10:02:35Z"
  },
  {
    "title": "Kenyan author prosecuted for writing a book about president's daughter",
    "description": "One critic says the \"state machinery\" has been used \"in defence of fragile egos\".",
    "link": "https://www.bbc.com/news/articles/ckgnrlp6vgzo",
    "timestamp": "2025-06-04T10:00:52Z"
  },
  {
    "title": "Over half of top 100 mental health TikTok videos contain misinformation: report",
    "description": "Experts find misinformation in 52 out of 100 top TikTok mental health videos, raising concerns about the impact on viewers and the need for better content regulation.",
    "link": "https://www.foxnews.com/media/over-half-top-100-mental-health-tiktok-videos-contain-misinformation-report",
    "timestamp": "2025-06-04T10:00:50Z"
  },
  {
    "title": "Stefanik Launches 'Save New York' PAC to Help Republicans Ahead of Midterms",
    "description": "House Republican Leadership Chair Elise Stefanik (R-NY) has launched a PAC to \"Save New York\" by supporting Republican candidates across the state and combating Gov. Kathy Hochul's (D) \"failed\" policies.\nThe post Stefanik Launches ‘Save New York’ PAC to Help …",
    "link": "https://www.breitbart.com/politics/2025/06/04/stefanik-launches-save-new-york-pac-help-republicans-ahead-midterms/",
    "timestamp": "2025-06-04T10:00:35Z"
  },
  {
    "title": "Elise Stefanik unveils new PAC as New York governor's race buzz grows",
    "description": "Rep. Elise Stefanik, R-N.Y., has unveiled a new political fundraising machine as she continues to consider a run for New York governor.",
    "link": "https://www.foxnews.com/politics/elise-stefanik-unveils-new-pac-new-york-governors-race-buzz-grows",
    "timestamp": "2025-06-04T10:00:34Z"
  },
  {
    "title": "Could this top Trump ally break Republican's 2-decade losing streak in this key state?",
    "description": "As Elise Stefanik eyes a gubernatorial bid, New York's political scene heats up with Gov. Kathy Hochul facing criticism and a primary challenge from her lieutenant governor.",
    "link": "https://www.foxnews.com/politics/could-top-trump-ally-break-republicans-two-decade-plus-losing-streak-key-state",
    "timestamp": "2025-06-04T10:00:31Z"
  },
  {
    "title": "New Term, New Judges: Trump 2.0 Is Likely Going For Court Picks Loyal To Him",
    "description": "As Trump's first judicial nominees head into their Senate hearing, the political landscape is dramatically different from his first term ― and he's gotten darker.",
    "link": "https://www.huffpost.com/entry/trump-judicial-nominees-senate-hearing_n_683fa2ebe4b0cc376200b437",
    "timestamp": "2025-06-04T10:00:07Z"
  },
  {
    "title": "Chrisley family returns to reality TV with new show but experts warn of comeback risks",
    "description": "Todd and Julie Chrisley’s new docuseries post-prison explores their family’s challenges, but experts weigh in on whether it's the right move for the reality TV stars.",
    "link": "https://www.foxnews.com/entertainment/chrisley-family-returns-reality-tv-experts-warn-comeback-risks",
    "timestamp": "2025-06-04T10:00:05Z"
  },
  {
    "title": "Meet Andrew Cuomo’s Buyers",
    "description": "The notable donors in real-estate and finance — and Billy Joel — who are spending tens of thousands to support Andrew Cuomo’s mayoral run.",
    "link": "http://nymag.com/intelligencer/article/nyc-mayor-race-who-are-andrew-cuomos-donors.html",
    "timestamp": "2025-06-04T10:00:03Z"
  },
  {
    "title": "Trump Tariffs-Induced Volatility Widens CRE Opportunity for Private Credit",
    "description": "As President Donald Trump’s tariff policy sends continued shockwaves through commercial real estate, private credit may stand to benefit from the volatility. Even though the U.S. Court of International Trade on May 28 blocked Trump’s unilateral reciprocal tar…",
    "link": "http://commercialobserver.com/2025/06/trump-tariffs-private-credit/",
    "timestamp": "2025-06-04T10:00:01Z"
  },
  {
    "title": "How To Ruin a Country's Image, Economy, and Global Standing in Six Easy Steps | Opinion",
    "description": "President Donald Trump's first four months in office have brought a whirlwind of unprecedented actions.",
    "link": "https://www.newsweek.com/how-ruin-countrys-image-economy-global-standing-six-easy-steps-opinion-2080454",
    "timestamp": "2025-06-04T10:00:01Z"
  },
  {
    "title": "Prepping Cities for Climate Chaos Isn’t “Woke,” but Team Trump Is Killing EPA Resiliency Grants",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. Thomasville, Georgia, has a water problem. Its treatment system is far out of date, posing serious health and environmental risks. “We have wastewat…",
    "link": "https://www.motherjones.com/politics/2025/06/trump-canceling-epa-climate-resiliency-grants-city-county-local-infrastructure/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "David Hogg’s Fight for the Future of the Democratic Party",
    "description": "“It’s all gas, no brakes.” For David Hogg, a vice chair of the Democratic National Committee, there’s little time away from politics right now, especially considering his $20 million campaign to disrupt his own party.  Hogg, a survivor of the 2018 mass shooti…",
    "link": "https://www.motherjones.com/politics/2025/06/david-hogg-dnc-primary-election-parkland/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Is This the Best the Democrats Can Do?",
    "description": "On Tuesday, the Democratic National Committee served tacos outside the Republican National Committee’s headquarters—a nod to a trendy new acronym spelling out “Trump always chickens out.” If the point was to push a slogan that works perfectly in one area (tar…",
    "link": "https://newrepublic.com/article/196102/schumer-jeffries-leadership-failure-trump",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Women’s Health Care Has a Racism Problem. Trump’s War on DEI Is Making It Worse.",
    "description": "Dr. Emily Hawes-Van Pelt, an OB-GYN working in Minneapolis, didn’t consider herself an expert on fighting racism in health care. Then in May 2020, George Floyd was murdered a few blocks from her hospital. “What we knew about the world, many of us”—she looked …",
    "link": "https://www.motherjones.com/politics/2025/06/womens-health-care-has-a-racism-problem-trumps-war-on-dei-is-making-it-worse/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "What to Expect From a Phone Call Between Trump and Xi",
    "description": "White House officials have said the U.S. and Chinese leaders could speak directly as soon as “this week.”",
    "link": "https://time.com/7291016/trump-xi-phone-call-us-china-trade-tariffs-direct-negotiation/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Who are the candidates running for NYC mayor against Eric Adams?",
    "description": "A crowded field of candidates want to capitalize on the scandal-plagued incumbent mayor's rock-bottom popularity and make the move to Gracie Mansion.",
    "link": "https://nypost.com/2025/06/04/us-news/who-are-the-candidates-running-for-nyc-mayor-against-eric-adams/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Trump Turned Bitcoin Into A Political Weapon. Here’s Why It Matters",
    "description": "Bitcoin’s founding ideals are under pressure as Trump turns crypto into a political tool, raising concerns over centralization and conflicts of interest.",
    "link": "https://www.forbes.com/sites/beccabratcher/2025/06/04/trump-turned-bitcoin-into-a-political-weapon-heres-why-it-matters/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Macron did not hide bag of cocaine from photographers",
    "description": "A video shows French President Emmanuel Macron removing a bag of cocaine from a table as journalists entered the train cabin where he was meeting with German Chancellor Friedrich Merz and British Prime Minister Keir Starmer.",
    "link": "https://www.snopes.com//fact-check/macron-cocaine-photographers/",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "We Analyzed Every Gun Case Since Bruen. The Result Is Horrifying.",
    "description": "Governments that rely on discriminatory statutes are often successful.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-analysis-2022-gun-ruling.html",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "This is John Thune's make-or-break moment",
    "description": "Senate Republicans under John Thune will try to pass Trump's megabill including no taxes on tips and overtime and other MAGA giveaways along Medicaid cuts.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/john-thune-trump-big-beautiful-bill-senate-rcna210677",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Alison Bechdel and the Search for the Beginner’s Mind",
    "description": "With the cartoonist’s new graphic novel, she appears once again to be trying for the “light, fun” book she’s longed to write. Charlie Tyson reviews.",
    "link": "https://www.newyorker.com/books/under-review/alison-bechdel-and-the-search-for-the-beginners-mind",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Meet Elon Musk’s Puppet Master: Russell Vought",
    "description": "Elon Musk may have “left Washington” last week, but the Department of Government Efficiency won’t miss a step. That’s because Musk was never running DOGE in the first place. I’m not suggesting that Amy Gleason was in charge. Gleason, you may recall, is the go…",
    "link": "https://newrepublic.com/article/196092/elon-musk-puppetmaster-russell-vought",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Trump has entered a disturbing new era in his Truth Social obsession",
    "description": "Donald Trump's social media habits, such as his claim on Truth Social that Joe Biden has been replaced by clones, have gotten out of hand.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-truth-social-clone-post-x-rcna210679",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "Mayors Are Making Climate Action Personal. It’s Working.",
    "description": "Cleveland Mayor Justin Bibb looks out from City Hall in Cleveland, Ohio, on July 27, 2022. (Photo by Sarah Rice / The Washington Post via Getty Images via Grist)\n \r\n\n\n \n\n\n\n\n\n\nThis story was originally published by Grist. Sign up for Grist’s weekly newsletter …",
    "link": "https://nextcity.org/urbanist-news/mayors-are-making-climate-action-personal-its-working",
    "timestamp": "2025-06-04T10:00:00Z"
  },
  {
    "title": "New South Korean President Lee faces crucial challenges at home and abroad",
    "description": "New South Korean President Lee Jae-myung described his victory as the start of the country’s return to normalcy, after winning a tense election that capped off months of political turmoil",
    "link": "https://abcnews.go.com/International/wireStory/new-south-korean-president-lee-faces-crucial-challenges-122478649",
    "timestamp": "2025-06-04T09:58:26Z"
  },
  {
    "title": "Navy to rename USNS Harvey Milk during Pride Month",
    "description": "The ship was named after the slain gay rights activist who served as a sailor during the Korean War.",
    "link": "https://www.ketv.com/article/navy-renames-usns-harvey-milk-pride-month/64964570",
    "timestamp": "2025-06-04T09:57:32Z"
  },
  {
    "title": "Navy to rename USNS Harvey Milk during Pride Month",
    "description": "The ship was named after the slain gay rights activist who served as a sailor during the Korean War.",
    "link": "https://www.wmur.com/article/navy-renames-usns-harvey-milk-pride-month/64964570",
    "timestamp": "2025-06-04T09:57:30Z"
  },
  {
    "title": "Old Hat, New Hat: What direction did Sweden's Social Democrats set?",
    "description": "The Local's Nordic Editor Richard Orange surveys the Social Democrat party congress over the weekend and argues that the party swung neither to the left nor to the right, and that while it was not \"totally new\", it didn't stay exactly the same either.",
    "link": "https://www.thelocal.se/20250604/old-hat-new-hat-what-direction-did-swedens-social-democrats-set",
    "timestamp": "2025-06-04T09:57:25Z"
  },
  {
    "title": "Trump memecoin wallet in ‘absolute chaos’ as family org unaware of launch",
    "description": "The announcement of a Trump-branded crypto wallet has been labelled “absolute chaos” as a business linked to the Trumps said it would launch a wallet only to have US President Donald Trump’s sons distance the family from it.\nThe non-fungible token marketplace…",
    "link": "https://biztoc.com/x/a2bbc64ccddd126a",
    "timestamp": "2025-06-04T09:56:18Z"
  },
  {
    "title": "South Korea election: New president Lee Jae-myung pledges to revive democracy and economy",
    "description": "Lee’s decisive victory in snap election stands to usher in sea change in Asia’s fourth-largest economy",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/06/04/south-korea-election-new-president-lee-jae-myung-pledges-to-revive-democracy-and-economy/",
    "timestamp": "2025-06-04T09:55:55Z"
  },
  {
    "title": "Trump says China’s Xi ‘hard to make a deal with’ amid trade dispute",
    "description": "Growing strains in US-China relations over implementation of agreement to roll back tariffs and trade restrictions.",
    "link": "https://www.aljazeera.com/news/2025/6/4/trump-says-chinas-xi-hard-to-make-a-deal-with-amid-trade",
    "timestamp": "2025-06-04T09:55:21Z"
  },
  {
    "title": "Rob Urie: What Do the Western Drone Attacks Mean for US – Russia Relations?",
    "description": "On Ukraine's recent escalations: \"Westerners sanguine about the prospect of nuclear war are fools.\"",
    "link": "https://www.nakedcapitalism.com/2025/06/rob-urie-what-do-the-western-drone-attacks-mean-for-us-russia-relations.html",
    "timestamp": "2025-06-04T09:55:19Z"
  },
  {
    "title": "The U.S. military will cut 7 out of 8 bases in Syria, Trump administration envoy says",
    "description": "The United States will scale down its military presence in Syria to one base from eight and U.S. policies will shift in the country “because none of them worked” over the last century, the new U.S. special envoy has said.",
    "link": "https://www.nbcnews.com/world/syria/us-military-will-cut-7-8-bases-syria-trump-administration-envoy-says-rcna210839",
    "timestamp": "2025-06-04T09:53:03Z"
  },
  {
    "title": "Full List of Senate Republicans Who Might Vote Against Spending Bill",
    "description": "President Donald Trump's \"One Big Beautiful Bill\" is headed to the Senate after narrowly passing the House.",
    "link": "https://www.newsweek.com/full-list-senate-republicans-who-might-vote-against-spending-bill-2080711",
    "timestamp": "2025-06-04T09:51:18Z"
  },
  {
    "title": "We Just Witnessed One of the Greatest Face-Plants of the Trump Era. Savor It.",
    "description": "There is a Big House–sized lesson in here.",
    "link": "https://slate.com/life/2025/06/university-michigan-santa-ono-donald-trump-florida-uf.html",
    "timestamp": "2025-06-04T09:50:00Z"
  },
  {
    "title": "Elon Musk warns excessive spending will plunge US 'into debt slavery'",
    "description": "Billionaire business magnate Elon Musk is sounding the alarm about the nation's debt and spending problems, warning of dire consequences",
    "link": "https://www.foxnews.com/politics/elon-musk-warns-excessive-spending-plunge-us-into-debt-slavery",
    "timestamp": "2025-06-04T09:49:25Z"
  },
  {
    "title": "Jen Psaki Mocks Trump’s Vanishing Act With Brutal 2-Word Blast From The Past",
    "description": "The MSNBC host said the president has taken his longest break from the White House since returning to office.",
    "link": "https://www.huffpost.com/entry/jen-psaki-trump-low-energy_n_683fff33e4b0d48557aa5cbf",
    "timestamp": "2025-06-04T09:49:07Z"
  },
  {
    "title": "Lawrence O’Donnell Reveals Why Trump Hasn't Dared To Clap Back At Elon Musk Yet",
    "description": "The “explosively rageful” president hasn't said a thing and the MSNBC anchor suggested why.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-donald-trump-elon-musk_n_68400e0de4b0cc376200e569",
    "timestamp": "2025-06-04T09:47:50Z"
  },
  {
    "title": "The White House is approving disaster relief funds without notifying FEMA, leading to delays and confusion | CNN Politics",
    "description": "In early April, President Donald Trump approved millions of dollars in assistance from the Federal Emergency Management Agency for Virginia, which was reeling from devastating winter storms and flooding. Gov. Glenn Youngkin, a Republican, issued a press relea…",
    "link": "https://www.cnn.com/2025/06/04/politics/fema-white-house-disaster-relief-funds",
    "timestamp": "2025-06-04T09:47:06Z"
  },
  {
    "title": "Minneapolis to Feds: \"Get the Fuck Out\" : How People in the Twin Cities Responded to a Federal Raid",
    "description": "Two firsthand accounts detailing how people in the Twin Cities responded to a federal raid.",
    "link": "https://crimethinc.com/2025/06/04/minneapolis-to-feds-get-the-fuck-out-how-people-in-the-twin-cities-responded-to-a-federal-raid",
    "timestamp": "2025-06-04T09:47:02Z"
  },
  {
    "title": "Tweed’s youthful makeover resurrects symbol of Scottish heritage",
    "description": "Young weavers revive Harris tweed in Scotland’s Hebrides, blending tradition with modern style and global appeal.",
    "link": "https://www.aljazeera.com/gallery/2025/6/4/tweeds-youthful-makeover-resurrects-symbol-of-scottish-heritage",
    "timestamp": "2025-06-04T09:45:04Z"
  },
  {
    "title": "Florida Pastor In U.S. For 26 Years Detained By ICE at Immigration Appointment",
    "description": "\"If they were the 'real criminals' Trump is supposedly deporting, they wouldn't be representing themselves to a judge,\" the pastor's daughter told Newsweek.",
    "link": "https://www.newsweek.com/florida-pastor-detained-ice-immigration-appointment-2080717",
    "timestamp": "2025-06-04T09:44:52Z"
  },
  {
    "title": "US-China trade talks: Trump calls dealmaking with President Xi ‘extremely hard’ as frictions rise",
    "description": "US President Donald Trump said Chinese leader Xi Jinping was “extremely hard to make a deal with” in a comment that comes as frictions rise between the two countries, weeks after they reached an agreement to de-escalate trade tensions.",
    "link": "https://www.cnn.com/2025/06/04/business/trump-xi-trade-talks-friction-china-hnk-intl",
    "timestamp": "2025-06-04T09:44:09Z"
  },
  {
    "title": "The UK House of Lords denies the government's AI bill for 'state sanctioned theft' of copyrighted data for the fourth time",
    "description": "The UK and US governments seem aligned on letting AI do whatever it wants.",
    "link": "https://www.pcgamer.com/software/ai/the-uk-house-of-lords-denies-the-governments-ai-bill-for-state-sanctioned-theft-of-copyrighted-data-for-the-fourth-time/",
    "timestamp": "2025-06-04T09:42:45Z"
  },
  {
    "title": "Pennsylvania has hired 120 federal workers for the state workforce amid DOGE shake-up",
    "description": "State agencies have hired 119 former federal workers, even amid a hiring freeze on federally funded positions.",
    "link": "https://www.inquirer.com/business/federal-worker-hire-job-pennsylvania-20250604.html",
    "timestamp": "2025-06-04T09:41:36Z"
  },
  {
    "title": "Elon Musk attacks Trump's 'big, beautiful bill': Tesla CEO's sudden outburst explained",
    "description": "Elon Musk , the billionaire tech entrepreneur, has opened a new rift with Donald Trump by denouncing the US president’s tax and spending bill as a “disgusting abomination”. Musk, who had previously voiced criticism of the proposed legislation, quipped that it…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-attacks-trumps-big-beautiful-bill-tesla-ceos-sudden-outburst-explained/articleshow/121620013.cms",
    "timestamp": "2025-06-04T09:41:02Z"
  },
  {
    "title": "From Nigeria to Pakistan, TB testing 'in a coma' after U.S. aid cuts",
    "description": "Moves by U.S. President Donald Trump have stalled vital research in South Africa and left TB survivors lacking support in India.",
    "link": "https://www.japantimes.co.jp/news/2025/06/04/world/science-health/tuberculosis-tb-testing-us-aid-cuts/",
    "timestamp": "2025-06-04T09:39:00Z"
  },
  {
    "title": "Trump Calls Biden's Autopen 'Biggest Political Scandal' in US History After 2020 Vote",
    "description": "US President Donald Trump on Wednesday labeled the purported use of an autopen to sign documents in the administration of his predecessor Joe Biden as one of the biggest political scandals in the United States.",
    "link": "https://sputnikglobe.com/20250604/trump-calls-bidens-autopen-biggest-political-scandal-in-us-history-after-2020-vote-1122188180.html",
    "timestamp": "2025-06-04T09:37:54Z"
  },
  {
    "title": "Andy Mukherjee: Importers hit by Trump tariffs could turn to ‘glocal banks’",
    "description": "Trade finance isn’t just about lubricating cross-border commerce, but also about easing flows of business intelligence. Banks that are both global and local—and specialize in Asian trade financing—could suggest supply source options.",
    "link": "https://www.livemint.com/opinion/online-views/trump-tariffs-us-china-trade-citigroup-jpmorgan-chase-bank-of-america-hsbc-standard-chartered-bnp-paribas-apple-samsung-11748951546365.html",
    "timestamp": "2025-06-04T09:30:06Z"
  },
  {
    "title": "Commercial real estate pros bid farewell to the Trump bump as April sales activity plunges",
    "description": "Dealmakers like Barry Sternlicht of Starwood Capital say 2025 has been a bust for sales of hotels, warehouses, and other commercial real estate.",
    "link": "https://www.businessinsider.com/commercial-real-estate-april-sales-declines-hotels-warehouses-starwood-fortress-2025-6",
    "timestamp": "2025-06-04T09:30:01Z"
  },
  {
    "title": "India’s FDI Rise: A decade of decisive growth and global confidence",
    "description": "India's foreign investment landscape has transformed since 2014. FDI equity inflows have surged, especially between 2019 and 2024. Government reforms like Make in India and Digital India have boosted investor confidence. The digital economy and manufacturing …",
    "link": "https://economictimes.indiatimes.com/news/economy/finance/indias-fdi-rise-a-decade-of-decisive-growth-and-global-confidence/articleshow/121618713.cms",
    "timestamp": "2025-06-04T09:29:53Z"
  },
  {
    "title": "Toronto Home Prices Halt Slide as Buyers Start to Show Interest",
    "description": "Toronto home prices ticked up after five straight months of declines as Canada-US trade tensions eased and valuations at their lowest point in four years began to tempt buyers.",
    "link": "https://financialpost.com/pmn/business-pmn/toronto-home-prices-halt-slide-as-buyers-start-to-show-interest",
    "timestamp": "2025-06-04T09:26:21Z"
  },
  {
    "title": "USA Energy Secretary Issues Emergency Order",
    "description": "'[This] emergency order ensures that Michiganders and the greater Midwest region do not lose critical power generation capability as summer begins', U.S. Energy Secretary Chris Wright said.",
    "link": "https://www.rigzone.com/news/usa_energy_secretary_issues_emergency_order-04-jun-2025-180733-article/",
    "timestamp": "2025-06-04T09:23:53Z"
  },
  {
    "title": "Trump fast-tracks Utah uranium mine but industry comeback may wait until prices go up ‘dramatically’",
    "description": "In the southeastern Utah desert famous for red rock arches and canyon labyrinths, the long-dormant uranium mining industry is looking to revive under President Donald Trump.\nHundreds of abandoned uranium mines dot the West’s arid landscapes, hazardous reminde…",
    "link": "https://biztoc.com/x/23e567c684867bc0",
    "timestamp": "2025-06-04T09:22:50Z"
  },
  {
    "title": "Pakistan reveals Bitcoin reserve plan to Trump’s crypto team at White House",
    "description": "Pakistan’s crypto minister met Trump’s digital assets chief at the White House to discuss Bitcoin reserves, blockchain governance, and crypto-mining plans.",
    "link": "https://cointelegraph.com/news/pakistan-bitcoin-reserve-white-house-meeting-trump-council",
    "timestamp": "2025-06-04T09:22:36Z"
  },
  {
    "title": "UFO sleuths want fewer secrets in Trump-era investigations",
    "description": "Investigators probing hundreds of cases of unidentified anomalous phenomena say the second Trump administration could be a turning point for transparency.",
    "link": "https://abcnews.go.com/Politics/ufo-sleuths-fewer-secrets-trump-era-investigations/story?id=121811368",
    "timestamp": "2025-06-04T09:21:29Z"
  },
  {
    "title": "UK CyberEM Command to spearhead new era of armed conflict",
    "description": "Government details latest initiative following announcement last week Revealing more details about the Cyber and Electromagnetic (CyberEM) military domain, the UK's Ministry of Defence (MoD) says \"there are pockets of excellence\" but improvements must be made…",
    "link": "https://www.theregister.com/2025/06/04/uk_cyberem_command_details/",
    "timestamp": "2025-06-04T09:21:14Z"
  },
  {
    "title": "U.S. CISA adds Multiple Qualcomm chipsets flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Multiple Qualcomm chipsets flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added multiple Qualcomm chipsets flaws to its K…",
    "link": "https://securityaffairs.com/178610/hacking/u-s-cisa-adds-multiple-qualcomm-chipsets-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-06-04T09:16:31Z"
  },
  {
    "title": "'Danger zone': Top companies weather uncertainty as Trump's tariffs fluctuate",
    "description": "Executives at Target, Goldman Sachs and Pepsi have bemoaned \"uncertainty.\"",
    "link": "https://abcnews.go.com/Business/danger-zone-top-companies-weather-uncertainty-trumps-tariffs/story?id=122457678",
    "timestamp": "2025-06-04T09:13:39Z"
  },
  {
    "title": "The Pittsburgh Steelers reached out to fans upset that Donald Trump received a jersey at a rally",
    "description": "PITTSBURGH (AP) — Pittsburgh Steelers legend Rocky Bleier called an audible when he presented President Donald Trump with a Steelers jersey with the No. 47 during a rally in western...",
    "link": "https://www.wfmj.com/story/52825215/the-pittsburgh-steelers-reached-out-to-fans-upset-that-donald-trump-received-a-jersey-at-a-rally",
    "timestamp": "2025-06-04T09:13:36Z"
  },
  {
    "title": "BBC Defends Itself & Calls For “Support” From White House After Donald Trump Administration Accuses Broadcaster Of Taking Down Gaza Story",
    "description": "The BBC has been forced on the defensive after Donald Trump’s White House accused the national broadcaster of taking down a story about the Israel-Hamas war. Yesterday, Trump’s press sec Karoline Leavitt claimed that the BBC had to “correct and take down” an …",
    "link": "http://deadline.com/2025/06/bbc-defends-itself-from-donald-trump-gaza-criticism-1236422857/",
    "timestamp": "2025-06-04T09:10:49Z"
  },
  {
    "title": "Democrats accuse McMahon of stonewalling Department of Education IG",
    "description": "\"The OIG must be allowed to do its job,\" they wrote in a letter to McMahon.",
    "link": "https://abcnews.go.com/Politics/democrats-accuse-mcmahon-stonewalling-department-education-ig/story?id=122462890",
    "timestamp": "2025-06-04T09:10:48Z"
  },
  {
    "title": "Why Did Elon Musk Leave the Trump Administration? Find Out",
    "description": "Musk wrote a statement about his departure shortly after he criticized the president's 'big, beautiful' bill.",
    "link": "https://hollywoodlife.com/2025/06/04/why-did-elon-musk-leave-the-trump-administration/",
    "timestamp": "2025-06-04T09:09:19Z"
  },
  {
    "title": "Trump’s ‘One Big Beautiful Bill’ Continues Assault on Obamacare",
    "description": "Rather than end Obamacare, which would be politically costly, the Trump Administration is working to hollow it out.",
    "link": "https://www.nakedcapitalism.com/2025/06/trumps-one-big-beautiful-bill-continues-assault-on-obamacare.html",
    "timestamp": "2025-06-04T09:05:23Z"
  },
  {
    "title": "Trump Official Predicts MAGA Crowd’s Sycophantic Moment During Army Parade",
    "description": "Monica Crowley said she's \"sure\" it will happen.",
    "link": "https://www.huffpost.com/entry/monica-crowley-trump-army-parade-prediction_n_683ffea7e4b09bb4b588980e",
    "timestamp": "2025-06-04T09:04:21Z"
  },
  {
    "title": "Buford Highway businesses still grappling with fewer sales after ICE arrests",
    "description": "Nearly six months after ICE made arrests across Buford Highway, business owners are still feeling the impact of residents apprehensive to leave their homes.",
    "link": "https://www.ajc.com/news/2025/06/ice-arrests-sparked-fear-on-buford-highway-for-many-business-hasnt-recovered/",
    "timestamp": "2025-06-04T09:02:59Z"
  },
  {
    "title": "Markets shrug off doubled U.S. steel tariffs and Trump complaints of Xi being ‘hard to make a deal with’",
    "description": "Stock markets rose on Wednesday, despite an early morning social media complaint from U.S. President Donald Trump that Chinese President Xi Jinping was “hard to make a deal with,” and a doubling of steel and aluminum tariffs.\n“I like President Xi of China, al…",
    "link": "https://biztoc.com/x/335c1acefc72c6aa",
    "timestamp": "2025-06-04T09:01:18Z"
  },
  {
    "title": "Trump’s hike of steel and aluminum tariffs to 50% just went into effect. Here’s what happens next",
    "description": "U.S. President Donald Trump has promised to hike nearly all of his tariffs on foreign steel and aluminum to a punishing 50% on Wednesday, a move that would hammer businesses from automakers to home builders, and likely push up prices for consumers.\nForeign-ma…",
    "link": "https://biztoc.com/x/049a389f1d65a5c5",
    "timestamp": "2025-06-04T09:00:59Z"
  },
  {
    "title": "UAE AMBASSADOR YOUSEF AL OTAIBA: US and UAE forge groundbreaking high-tech partnership based on AI",
    "description": "Trump's UAE visit marks a new era in U.S.-UAE relations with a strategic alliance in AI, creating jobs and advancing technology through a new AI campus.",
    "link": "https://www.foxnews.com/opinion/uae-ambassador-yousef-al-otaiba-us-uae-forge-groundbreaking-high-tech-partnership-based-ai",
    "timestamp": "2025-06-04T09:00:58Z"
  },
  {
    "title": "U.S. doubles steel and aluminum tariffs as Japan counts on a breakthrough",
    "description": "The United States on Wednesday doubled tariffs on steel and aluminum to 50% as it continued intense negotiations with Japan, which is hoping to reach a trade deal within a couple of weeks.\nThe higher rates imposed Wednesday will support American industry, U.S…",
    "link": "https://biztoc.com/x/245acc840141ad12",
    "timestamp": "2025-06-04T09:00:48Z"
  },
  {
    "title": "SEN BILL HAGERTY: Nashville is not a sanctuary city. I won’t let that happen",
    "description": "The Trump administration's immigration agenda faces challenges in Nashville as media and local officials criticize ICE's efforts to deport criminal illegal aliens.",
    "link": "https://www.foxnews.com/opinion/nashville-not-sanctuary-city-i-wont-let-happen",
    "timestamp": "2025-06-04T09:00:46Z"
  },
  {
    "title": "CNN's Tapper rips media smear campaign against Hur, WSJ report on Biden decline without mentioning own network",
    "description": "CNN's Jake Tapper criticized the media for its attacks on Robert Hur and The Wall Street Journal last year to defend Joe Biden but failed to mention his own network's role in it.",
    "link": "https://www.foxnews.com/media/cnns-tapper-rips-media-smear-campaign-against-hur-wsj-report-biden-decline-without-mentioning-own-network",
    "timestamp": "2025-06-04T09:00:44Z"
  },
  {
    "title": "Founding Fathers understood parental rights are natural rights. Trump knows it, too",
    "description": "President Trump's commitment to parental rights echoes the Founding Fathers, as we mark the centennial of Pierce v. Society of Sisters and its impact on education.",
    "link": "https://www.foxnews.com/opinion/founding-fathers-understood-parental-rights-natural-rights-trump-knows-it-too",
    "timestamp": "2025-06-04T09:00:43Z"
  },
  {
    "title": "Trump memecoin wallet sparks chaos as family denies involvement – What’s really going on?",
    "description": "The project triggered backlash from Donald Trump's sons, exposing internal rifts amid booming token activity.",
    "link": "https://ambcrypto.com/trump-memecoin-wallet-sparks-chaos-as-family-denies-involvement-whats-really-going-on/",
    "timestamp": "2025-06-04T09:00:33Z"
  },
  {
    "title": "CBS anchor Margaret Brennan's latest dust-up with administration official adds to Trump lawsuit drama",
    "description": "Margaret Brennan has repeatedly been shamed on-air by Republicans, generating negative attention for CBS as the company deals with a litany of other significant issues.",
    "link": "https://www.foxnews.com/media/cbs-anchor-margaret-brennans-latest-dust-up-administration-official-adds-trump-lawsuit-drama",
    "timestamp": "2025-06-04T09:00:17Z"
  },
  {
    "title": "Florida Man v Canada: how the Stanley Cup final became a proxy war",
    "description": "Edmonton face the Panthers in the NHL title showdown for the second season in a row. But there are plenty of talking points off the ice too",
    "link": "https://sports.yahoo.com/article/florida-man-v-canada-stanley-090002602.html",
    "timestamp": "2025-06-04T09:00:02Z"
  },
  {
    "title": "The 14 dealmakers investors call when they want to offload their private equity fund stakes",
    "description": "From Blackstone to Goldman Sachs: Meet 14 execs who helped lead private equity's secondaries market to a record $160 billion in deals last year.",
    "link": "https://www.businessinsider.com/private-equity-secondaries-power-players-blackstone-ares-goldman-sachs-clipway2025-5",
    "timestamp": "2025-06-04T09:00:02Z"
  },
  {
    "title": "A sweeping new ICE operation shows how Trump's focus on immigration is reshaping federal law enforcement",
    "description": "In mid-May, White House deputy chief of staff Stephen Miller, frustrated over what he saw as numbers of arrests and deportations of unauthorized immigrants that were too low, berated and threatened to fire senior Immigration and Customs Enforcement officials …",
    "link": "https://www.nbcnews.com/politics/justice-department/ice-operation-trump-focus-immigration-reshape-federal-law-enforcement-rcna193494",
    "timestamp": "2025-06-04T09:00:00Z"
  },
  {
    "title": "Why the U.K. prime minister is calling for a bigger military to face Russia",
    "description": "Key NATO members are upping their defense posture in response to threats from Russia. Experts say the Trump administration's confrontational approach to the alliance is a factor as well.",
    "link": "https://www.npr.org/2025/06/04/nx-s1-5421217/britain-military-spending-ukraine-trump-russia",
    "timestamp": "2025-06-04T09:00:00Z"
  },
  {
    "title": "New Jersey primary sets up the first major fight for the Democratic Party's future",
    "description": "CRANFORD, N.J. — Steve Fulop was almost done answering questions about his campaign for governor Saturday afternoon when he decided to pose a question of his own.",
    "link": "https://www.nbcnews.com/politics/elections/new-jersey-primary-sets-first-major-fight-democratic-partys-future-rcna210418",
    "timestamp": "2025-06-04T09:00:00Z"
  }
]