[
  {
    "title": "Public Health at Risk as Trump Pushes to Slash CDC by 53 Percent - NewsBreak",
    "description": "Public Health at Risk as Trump Pushes to Slash CDC by 53 Percent - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4256341013719-public-health-at-risk-as-trump-pushes-to-slash-cdc-by-53-percent?s=a2&amp;share_destination_id=MTY4MDQ5Mjk1LTE3NTg4NTU4MDgxNjU%3D&amp;pd=0BN7IVSI&amp;hl=en_US&amp;send_time=1758855808&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.38.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-09-26T03:03:57Z"
  },
  {
    "title": "Ryder Cup: How to Watch, What's at Stake, Betting Odds",
    "description": "Get ready for the biggest spectacle in golf when the Ryder Cup is staged at Bethpage Black in New York.",
    "link": "https://www.foxsports.com/stories/golf/ryder-cup-how-to-watch-whats-at-stake-betting-odds",
    "timestamp": "2025-09-26T03:02:12Z"
  },
  {
    "title": "Trump's new Gaza plan has one palpable weak point: It clashes with Netanyahu's promises to his voters",
    "description": "The U.S. President's plan apparently addresses reality on the ground, but giving the PA a foothold in Gaza and ending the war will endanger Netanyahu's coalition ■ At a certain point, pressure from the Gulf states may tip the scales at the White House ■ And t…",
    "link": "https://www.haaretz.com/israel-news/2025-09-26/ty-article/.premium/trumps-new-gaza-plan-has-a-weak-point-it-clashes-with-netanyahus-promises-to-his-voters/00000199-825a-db6e-a5d9-d67e6cf70000",
    "timestamp": "2025-09-26T03:00:14Z"
  },
  {
    "title": "Nippon Steel to invest $300 million in U.S. Steel",
    "description": "The investment in two U.S. Steel plants forms part of the Japanese company's $11 billion commitment to the American steelmaker.",
    "link": "https://www.japantimes.co.jp/business/2025/09/26/companies/nippon-steel-investment/",
    "timestamp": "2025-09-26T02:59:00Z"
  },
  {
    "title": "Trump slaps 100% tariff on branded drugs and some more on other items; Check full list here",
    "description": "US President Donald Trump on Thursday announced a new wave of steep tariffs on a wide range of imported goods, including a 100% duty on branded drugs and 25% tariffs on heavy-duty trucks, set to take effect next week.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-slaps-100-tariff-on-branded-drugs-and-some-more-on-other-items-check-full-list-here/articleshow/124142196.cms",
    "timestamp": "2025-09-26T02:58:54Z"
  },
  {
    "title": "Trump calls Comey 'one of the worst human beings' after former FBI director indicted on felony charges",
    "description": "President Donald Trump celebrated former FBI Director James Comey's indictment on felony charges, calling him \"one of the worst human beings\" after federal grand jury charged Comey with false statements and obstruction of justice related to congressional test…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-calls-comey-one-of-the-worst-human-beings-after-former-fbi-director-indicted-on-felony-charges/articleshow/124142172.cms",
    "timestamp": "2025-09-26T02:56:16Z"
  },
  {
    "title": "Trump to put import taxes on pharmaceutical drugs, kitchen cabinets, furniture and heavy trucks",
    "description": "President Trump said on Truth Social that he is putting a 100% import tax on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on Oct. 1.",
    "link": "https://nypost.com/2025/09/25/us-news/trump-to-put-import-taxes-on-pharmaceutical-drugs-kitchen-cabinets-furniture-and-heavy-trucks/",
    "timestamp": "2025-09-26T02:56:10Z"
  },
  {
    "title": "US Secretary of War orders urgent meeting of top generals",
    "description": "Pete Hegseth has ordered hundreds of generals and admirals from around the world to gather in Quantico, Virginia, next week Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625281-pentagon-generals-meeting-hegseth/",
    "timestamp": "2025-09-26T02:52:23Z"
  },
  {
    "title": "Fight Club Exclusive–Navarro on Comey Indictment: ‘If You Don’t Hold These SOBs Accountable, They Will Do It Again’",
    "description": "Peter Navarro, senior counselor for trade and manufacturing to President Trump, told the Founders' Roundtable on Breitbart Fight Club, \"If you don’t hold these SOBs accountable, they’re going to do it again and again,\" hours after former FBI Director James Co…",
    "link": "https://www.breitbart.com/politics/2025/09/25/fight-club-exclusive-navarro-on-comey-indictment-if-you-dont-hold-these-sobs-accountable-they-will-do-it-again/",
    "timestamp": "2025-09-26T02:50:14Z"
  },
  {
    "title": "Trump says he ‘will not allow’ Israel to annex occupied West Bank",
    "description": "Donald Trump ruling out Israel's annexation of the occupied West Bank will have repercussions for Israeli PM Netanyahu.",
    "link": "https://www.aljazeera.com/news/2025/9/26/trump-says-he-will-not-allow-israel-to-annex-occupied-west-bank",
    "timestamp": "2025-09-26T02:48:01Z"
  },
  {
    "title": "Trump's New Tariff Barrage Targets Drugs, Trucks, Cabinets: President Says Move Will Protect Manufacturers From 'Unfair Outside Competition'",
    "description": "President Donald Trump announced a barrage of new tariffs on Thursday, aimed at pharmaceuticals, heavy trucks and home furnishings in particular, to shore up domestic industry in these sectors, and protect American manufacturers from “unfair outside competiti…",
    "link": "https://biztoc.com/x/ffd3bd776538a071",
    "timestamp": "2025-09-26T02:46:33Z"
  },
  {
    "title": "Former FBI Director James Comey posts video statement, vows to fight charges",
    "description": "James Comey posted a video to Instagram following the Justice Department's indictment on two charges, one count of making false statements and one count of obstruction of justice.",
    "link": "https://www.cbsnews.com/news/james-comey-video-statement-vows-fight-charges/",
    "timestamp": "2025-09-26T02:46:07Z"
  },
  {
    "title": "Federal Bureau of Prisons moves to end union protections for its workers",
    "description": "The federal Bureau of Prisons it is canceling a collective bargaining agreement with its workers and stripping them of union rights, the latest move by the Trump administration to gut labor protections for federal employees",
    "link": "https://abcnews.go.com/Politics/wireStory/federal-bureau-prisons-moves-end-union-protections-workers-125952788",
    "timestamp": "2025-09-26T02:45:52Z"
  },
  {
    "title": "James Comey is no pristine model of ethics, and now he’s staring down karma",
    "description": "On Thursday, James Comey became the first former Director of the Federal Bureau of Investigation to be indicted for a federal crime.",
    "link": "https://nypost.com/2025/09/25/opinion/james-comey-is-no-pristine-model-of-ethics-and-now-hes-staring-down-karma/",
    "timestamp": "2025-09-26T02:40:22Z"
  },
  {
    "title": "Report: Tony Blair to head Gaza authority under US plan",
    "description": "The US reportedly backs a plan for former British PM to lead Gaza’s postwar governance, excluding the PA initially.",
    "link": "https://www.israelnationalnews.com/news/415433",
    "timestamp": "2025-09-26T02:40:05Z"
  },
  {
    "title": "Dollar holds gains as attention turns to spending data for Fed clues",
    "description": "The dollar is strong because U.S. economic data is better than expected. This makes it less likely that the Federal Reserve will cut interest rates soon. The yen is weak after new tariffs from U.S. President Donald Trump. People are watching U.S. consumer spe…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-gains-as-attention-turns-to-spending-data-for-fed-clues/articleshow/124141533.cms",
    "timestamp": "2025-09-26T02:36:20Z"
  },
  {
    "title": "European banks to launch euro stablecoin in bid to counter US dominance",
    "description": "Nine European banks, including ING and UniCredit, are creating a company to launch a euro-backed stablecoin, challenging U.S. dominance in the digital currency market. This initiative aims to provide a European alternative for quick, low-cost payments, even a…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/european-banks-to-launch-euro-stablecoin-in-bid-to-counter-us-dominance/articleshow/124141475.cms",
    "timestamp": "2025-09-26T02:33:44Z"
  },
  {
    "title": "The big contradiction in progressive thinking about Trump",
    "description": "President Donald Trump has brought American democracy to the brink. But Democrats should not moderate any of their positions, for the sake of disempowering him. This is a popular pair of positions among progressives, despite the apparent tension between them.…",
    "link": "https://www.vox.com/politics/462912/trump-authoritarianism-democrats-moderation",
    "timestamp": "2025-09-26T02:32:56Z"
  },
  {
    "title": "Trump says U.S. will impose new tariffs on heavy trucks, drugs and kitchen cabinets - NBC News",
    "description": "Trump says U.S. will impose new tariffs on heavy trucks, drugs and kitchen cabinetsNBC News A 100% tariff on some imported drugs is coming October 1, Trump saysCNN Trump announces new tariffs on trucks, furniture and pharmaceuticalsThe Washington Post Trump s…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179538202",
    "timestamp": "2025-09-26T02:32:31Z"
  },
  {
    "title": "‘Let’s Have A Trial’: Comey Responds To Indictment",
    "description": "Former FBI Director James Comey responded Thursday after the Department of Justice indicted him on two of three counts.",
    "link": "https://dailycaller.com/2025/09/25/james-comey-responds-indictment/",
    "timestamp": "2025-09-26T02:27:07Z"
  },
  {
    "title": "Trump \"loves tariffs, labels himself a tariff man\" since his first term: University of Chicago Professor",
    "description": "Donald Trump, a self-proclaimed \"tariff man,\" is considering imposing heavy tariffs on Russia if it doesn't end the war in Ukraine. He criticized European countries and India for buying Russian oil, which he believes funds Russia's war efforts. Trump also cal…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-loves-tariffs-labels-himself-a-tariff-man-since-his-first-term-university-of-chicago-professor/articleshow/124141274.cms",
    "timestamp": "2025-09-26T02:25:27Z"
  },
  {
    "title": "US lawmakers have questions for Big Tech and others on H-1B hiring practices",
    "description": "Tom Williams/CQ-Roll Call, Inc via Getty Images\nPresident Donald Trump signed an executive order imposing a new $100,000 fee for new H-1B visas.\nBig Tech, consulting, and finance companies are some of the largest employers of H-1B visa workers.\nTwo US senator…",
    "link": "https://biztoc.com/x/f22d1e902d5877d7",
    "timestamp": "2025-09-26T02:24:27Z"
  },
  {
    "title": "Trump says EU-aided Ukraine could regain territory as India signals shift on Russian oil imports",
    "description": "US President Donald Trump stated on September 23 that Ukraine, with support from the EU, could potentially reclaim territory from Russia, marking a departure from his previous stance favoring Ukraine ceding land for peace. Concurrently, Indian media reports s…",
    "link": "https://www.digitimes.com/news/a20250926PD205/ukraine-donald-trump-russia-policy.html",
    "timestamp": "2025-09-26T02:21:58Z"
  },
  {
    "title": "South Korean shares set to snap 4-week rally on US tariff woes",
    "description": "South Korean shares experienced a significant slump on Friday, poised for their first weekly loss in five weeks, influenced by uncertainties surrounding trade negotiations with the U.S. and new tariffs imposed by President Trump. The Korean won weakened to it…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-set-to-snap-4-week-rally-on-us-tariff-woes/articleshow/124141191.cms",
    "timestamp": "2025-09-26T02:21:28Z"
  },
  {
    "title": "Pharma stocks, HAL, Unified Data, Supreme Petrochem, Fabtech Tech, RITES, Solarium Green, NTPC Green, Kothari Industrial, Afcons Infra, Ceigall to remain in focus on Friday",
    "description": "Pharma stocks to come under pressure following Trump’s announcement that 100% tariff would be imposed on imports of branded and patented pharmaceutical products",
    "link": "https://www.thehindubusinessline.com/markets/pharma-stocks-hal-unified-data-supreme-petrochem-fabtech-tech-rites-solarium-green-ntpc-green-kothari-industrial-afcons-infra-ceigall-to-remain-in-focus-on-friday/article70096220.ece",
    "timestamp": "2025-09-26T02:20:59Z"
  },
  {
    "title": "Bruce Springsteen: Trump Should Be ‘Consigned to Trash Heap of History’",
    "description": "The “Born in the U.S.A.” singer reflected on his criticisms of the president, noting that “a good number of Americans are simply comfortable with his politics of power and dominance.”",
    "link": "http://www.hollywoodreporter.com/music/music-news/bruce-springsteen-slams-donald-trump-trash-heap-history-1236386331/",
    "timestamp": "2025-09-26T02:20:31Z"
  },
  {
    "title": "Former FBI director James Comey indicted on two charges",
    "description": "James Comey says he is innocent after being accused of lying to Congress in 2020 while testifying about leaks to the media.",
    "link": "https://www.bbc.com/news/articles/cy50ggv35zpo",
    "timestamp": "2025-09-26T02:17:43Z"
  },
  {
    "title": "Epstein estate turns over new documents (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nEpstein estate turns over new documents … This tranche of materials is the third set of documents from the Epstein estate.  Already, it has turned over the so-called birthday book that allegedly included a message for Epstein written …",
    "link": "https://www.memeorandum.com/250925/p160",
    "timestamp": "2025-09-26T02:15:03Z"
  },
  {
    "title": "President Trump to put import taxes on pharmaceutical drugs, kitchen cabinets, furniture and heavy trucks",
    "description": "WASHINGTON — President Donald Trump said Thursday that he will put import taxes of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on Oct. 1.\nThe posts on his social me…",
    "link": "https://biztoc.com/x/2f9350177cc3de71",
    "timestamp": "2025-09-26T02:13:29Z"
  },
  {
    "title": "Asia trades mostly lower after Trump's new tariffs",
    "description": "Asia-Pacific markets traded mostly lower on Friday after United States President Donald Trump announced a 100% tariff on branded or patented drugs set to take effect on October 1, as well as a 30-50% ...",
    "link": "https://biztoc.com/x/25e00e091550e816",
    "timestamp": "2025-09-26T02:13:25Z"
  },
  {
    "title": "US lawmakers have questions for Big Tech and others on H-1B hiring practices",
    "description": "Sens. Chuck Grassley and Dick Durbin sent letters to large employers of H-1B visa workers to inquire about foreign hiring practices.",
    "link": "https://www.businessinsider.com/h1b-visa-senators-grassley-durbin-letter-big-tech-2025-9",
    "timestamp": "2025-09-26T02:11:03Z"
  },
  {
    "title": "Dollar holds gains as attention turns to spending data for Fed clues",
    "description": "TOKYO :The dollar held on to steep gains on Friday after better-than-forecast U.S. data dampened expectations for further easing by the Federal Reserve this year.The dollar index, which measures the greenback against major peers, climbed 0.6 per cent in the p…",
    "link": "https://www.channelnewsasia.com/business/dollar-holds-gains-attention-turns-spending-data-fed-clues-5370581",
    "timestamp": "2025-09-26T02:09:44Z"
  },
  {
    "title": "Dollar holds gains as attention turns to spending data for Fed clues",
    "description": "TOKYO (Reuters) -The dollar held on to steep gains on Friday after better-than-forecast U.S. data dampened expectations for further easing by the Federal...",
    "link": "https://finance.yahoo.com/news/dollar-holds-gains-attention-turns-020944394.html",
    "timestamp": "2025-09-26T02:09:44Z"
  },
  {
    "title": "Fight Club Exclusive — Navarro on Accountability: We Watched Antifa Burn Cities While FBI Threw J6ers in Prison for Years",
    "description": "Americans watched Antifa burn cities down while the FBI threw January 6 protesters in jail, Counselor to the President Peter Navarro said during a special Founders Roundtable on Breitbart Fight Club on Thursday evening.\nThe post Fight Club Exclusive — Navarro…",
    "link": "https://www.breitbart.com/politics/2025/09/25/fight-club-exclusive-navarro-accountability-watched-antifa-burn-cities-j6ers-prison/",
    "timestamp": "2025-09-26T02:08:46Z"
  },
  {
    "title": "Gold eases as dollar firms; US inflation data awaited",
    "description": "Gold prices slightly decreased to $3,741.71 per ounce as stronger U.S. economic data tempered expectations for Federal Reserve rate cuts, boosting the dollar. Investors are keenly awaiting U.S. inflation data for further market direction. New tariffs imposed …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-eases-as-dollar-firms-us-inflation-data-awaited/articleshow/124140895.cms",
    "timestamp": "2025-09-26T02:08:35Z"
  },
  {
    "title": "Former FBI Director Comey Charged With Lying To Congress",
    "description": "Former FBI Director James Comey was charged in an indictment with lying to Congress and obstruction over testimony he gave in 2020, following increased pressure from President Donald Trump to go after his perceived enemies.",
    "link": "https://www.ndtvprofit.com/world/former-fbi-director-comey-charged-with-lying-to-congress",
    "timestamp": "2025-09-26T02:08:24Z"
  },
  {
    "title": "Breaking: Comey Responds to Indictment, Dramatically Declares He Will Not Live on His Knees",
    "description": "Former FBI Director James Comey issued a response after being indicted by a grand jury on Thursday, issuing a video reply.",
    "link": "https://www.westernjournal.com/breaking-comey-responds-indictment-dramatically-declares-will-not-live-knees/",
    "timestamp": "2025-09-26T02:08:16Z"
  },
  {
    "title": "Trump Tells Netanyahu: 'I Will Not Allow' West Bank Annexation",
    "description": "President Donald Trump has declared that he \"will not allow\" Israeli Prime Minister Benjamin Netanyahu to annex the West Bank, marking a sharp public divergence from a longstanding Israeli political objective. Speaking at a rally, as reported by the BBC, Pres…",
    "link": "https://www.ndtvprofit.com/world/trump-tells-netanyahu-i-will-not-allow-west-bank-annexation",
    "timestamp": "2025-09-26T02:07:47Z"
  },
  {
    "title": "A look at the Trump-Comey relationship and the indictment against the former FBI director",
    "description": "The indictment of former FBI Director James Comey represents the first criminal case against a perceived adversary of President Donald Trump so far in this administration",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-comey-relationship-indictment-former-fbi-director-125952010",
    "timestamp": "2025-09-26T02:06:30Z"
  },
  {
    "title": "Fan taunts Rahm, and Trump may be ‘a force': Ryder Cup Day 4 best lines",
    "description": "A story of a fan taunting Jon Rahm and a player thinking President Donald Trump will be a \"force\" are among the Ryder Cup Day 4 best lines.",
    "link": "https://golf.com/news/fan-taunts-rahm-trump-force-ryder-cup/",
    "timestamp": "2025-09-26T02:05:50Z"
  },
  {
    "title": "Fight Club Exclusive – Peter Navarro: Obama 'Up to His Neck' in RussiaGate",
    "description": "President Barack Obama is culpable in the government's plot to deny President Donald Trump's 2016 election, Senior Counselor for Trade and Manufacturing to President Trump, Peter Navarro, said during a special Founders Roundtable on Breitbart Fight Club on Th…",
    "link": "https://www.breitbart.com/politics/2025/09/25/fight-club-exclusive-peter-navarro-obama-up-to-his-neck-in-russiagate/",
    "timestamp": "2025-09-26T02:05:29Z"
  },
  {
    "title": "France doubles down on threat to build future fighter jet alone",
    "description": "Paris (AFP) Sept 24, 2025\n\n\n France is in a position to develop a next-generation combat aircraft alone should negotiations with Germany and Spain fail, a government official said Wednesday. \n\nThe statement comes a day after the head of French defence company…",
    "link": "https://www.spacedaily.com/reports/France_doubles_down_on_threat_to_build_future_fighter_jet_alone_999.html",
    "timestamp": "2025-09-26T02:03:52Z"
  },
  {
    "title": "NATO sticks to guns as allies talk tough on Russian jets",
    "description": "Brussels, Belgium (AFP) Sept 25, 2025\n\n\n After high-profile violations of NATO airspace by Russia over Poland and Estonia, alliance members have appeared at odds over how forcefully to react. \n\nWhile some have seemed to advocate for shooting down any jets bre…",
    "link": "https://www.spacewar.com/reports/NATO_sticks_to_guns_as_allies_talk_tough_on_Russian_jets_999.html",
    "timestamp": "2025-09-26T02:03:52Z"
  },
  {
    "title": "Can Trump Break The China Adoption Logjam?",
    "description": "By Laura Bryant Hanford via The Daily Signal | September 25, 2025\n300 Chinese children matched with adoptive American families have been stranded in orphanages for six years. Families are pleading with Trump to bring them home.\nAs President Donald Trump condu…",
    "link": "https://biztoc.com/x/0cd311b41ed6ebb2",
    "timestamp": "2025-09-26T02:02:12Z"
  },
  {
    "title": "NEW: Biden Judge Assigned to Comey’s Criminal Case",
    "description": "A Biden-appointed judge was assigned to oversee James Comey’s criminal case on Thursday evening.\nThe post NEW: Biden Judge Assigned to Comey’s Criminal Case appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/new-biden-judge-assigned-comeys-criminal-case/",
    "timestamp": "2025-09-26T02:00:18Z"
  },
  {
    "title": "Escalating trouble – Trump takes on the UN and Europe",
    "description": "Trump says Ukraine can win — but should Europe believe him? At a hectic U.N. General Assembly in New York, U.S. President Donald Trump stunned world leaders with a dramatic rhetorical reversal on the war in Ukraine, mocking Russia as a “paper tiger” and urgin…",
    "link": "https://www.politico.eu/podcast/eu-confidential/escalating-trouble-trump-takes-on-the-un-and-europe/",
    "timestamp": "2025-09-26T02:00:00Z"
  },
  {
    "title": "Donald Trump celebrates as former FBI chief James Comey criminally charged over Russia investigation",
    "description": "Donald Trump celebrates as former FBI chief James Comey criminally charged over Russia investigation7news.com.au",
    "link": "https://7news.com.au/news/donald-trump-celebrates-as-former-fbi-chief-james-comey-criminally-charged-over-russia-investigation-c-20147511",
    "timestamp": "2025-09-26T01:59:25Z"
  },
  {
    "title": "Intel approaches TSMC for investments or partnership, WSJ reports",
    "description": "Intel is reportedly seeking investments and partnerships with TSMC amidst its struggles to compete in the AI race. These efforts, which predate U.S. government interest, have intensified after the U.S. took a 10% stake in Intel. The company is also exploring …",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-approaches-tsmc-for-investments-or-partnership-wsj-reports/articleshow/124140675.cms",
    "timestamp": "2025-09-26T01:59:05Z"
  },
  {
    "title": "Trump announces steep new tariffs, reviving trade war",
    "description": "US President Donald Trump announced Thursday punishing tariffs on pharmaceuticals, big-rig trucks, home renovation fixtures and furniture, reviving his global trade war. The late evening announcement is the harshest trade policy by the president since last Ap…",
    "link": "https://www.digitaljournal.com/world/trump-announces-steep-new-tariffs-reviving-trade-war/article",
    "timestamp": "2025-09-26T01:57:20Z"
  },
  {
    "title": "Trump Announces Steep New Tariffs, Reviving Trade War",
    "description": "US President Donald Trump announced Thursday punishing tariffs on pharmaceuticals, big-rig trucks, home renovation fixtures and furniture, reviving his global trade war.",
    "link": "https://www.ibtimes.com/trump-announces-steep-new-tariffs-reviving-trade-war-3784505",
    "timestamp": "2025-09-26T01:57:09Z"
  },
  {
    "title": "James Comey Says He's Innocent Following DOJ Indictment",
    "description": "Comey stressed that \"fear is the tool of a tyrant\" and called on people to stay engaged.",
    "link": "https://www.huffpost.com/entry/james-comey-indictment-trump_n_68d5e121e4b0185d00681965",
    "timestamp": "2025-09-26T01:56:54Z"
  },
  {
    "title": "Former FBI Director James Comey indicted on perjury and obstruction charges, calls Trump a ‘tyrant’",
    "description": "Former FBI Director James Comey was indicted on charges of making false statements and obstructing a congressional proceeding related to his 2020 testimony regarding the Russia investigation. The indictment, led by Trump's former attorney, faces scrutiny over…",
    "link": "https://economictimes.indiatimes.com/news/international/us/former-fbi-director-james-comey-indicted-on-perjury-and-obstruction-charges-calls-trump-a-tyrant/articleshow/124140482.cms",
    "timestamp": "2025-09-26T01:56:19Z"
  },
  {
    "title": "Trump signs order to keep TikTok alive under US control",
    "description": "Trump signs executive order enabling US investors to buy TikTok from ByteDance, aiming to protect data privacy and national security. The deal awaits final approval from China.",
    "link": "https://www.israelnationalnews.com/news/415431",
    "timestamp": "2025-09-26T01:55:20Z"
  },
  {
    "title": "Trump to put import taxes on pharmaceutical drugs, kitchen cabinets, furniture and heavy trucks",
    "description": "Pharmaceutical drugs to attract 100% import taxes, kitchen cabinets 50%, upholstered furniture 30% and heavy trucks 25% starting October 1",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-put-import-taxes-on-pharmaceutical-drugs-kitchen-cabinets-furniture-and-heavy-trucks/article70096233.ece",
    "timestamp": "2025-09-26T01:54:02Z"
  },
  {
    "title": "Trump Targets UN—Like Shooting Fish In A Barrel",
    "description": "By Debra Saunders via The Daily Signal | September 25, 2025\nThe escalator stopped working as President Donald Trump and the first lady entered the United Nations on Tuesday. Then, as Trump began to deliver his speech to the General Assembly, the teleprompter …",
    "link": "https://biztoc.com/x/923cbc4950e65803",
    "timestamp": "2025-09-26T01:51:18Z"
  },
  {
    "title": "Comey Charges Reportedly Looming Days After Prosecutor With Family Ties To Ex-FBI Chief Resigns",
    "description": "By Katelynn Richardson, Daily Caller News Foundation | September 25, 2025\nFormer FBI Director James Comey could be indicted in the coming days, according to multiple reports.\nPresident Donald Trump appointed Lindsey Halligan, a White House aide and his former…",
    "link": "https://biztoc.com/x/7262f287c3f925fe",
    "timestamp": "2025-09-26T01:50:45Z"
  },
  {
    "title": "James Comey's son-in-law quits Justice Department after former FBI director's indictment",
    "description": "James Comey’s son-in-law resigned as a federal prosecutor minutes after the former FBI director was indicted",
    "link": "https://abcnews.go.com/Politics/wireStory/james-comeys-son-law-quits-justice-department-after-125950466",
    "timestamp": "2025-09-26T01:50:17Z"
  },
  {
    "title": "Trump says Comey 'placed a cloud over the entire nation' with Crossfire Hurricane, reacts to indictment",
    "description": "EXCLUSIVE: President Trump reacted to the indictment of former FBI Director James Comey, telling Fox News Digital during an exclusive interview that he “placed a cloud over the entire nation\" with the bureau’s “Crossfire Hurricane\" probe.",
    "link": "https://www.foxnews.com/politics/trump-reacts-comey-indictment-says-he-placed-cloud-over-entire-nation-crossfire-hurricane",
    "timestamp": "2025-09-26T01:50:17Z"
  },
  {
    "title": "Ex-FBI Director James Comey indicted on charges of lying to Congress and obstruction",
    "description": "James Comey was indicted for allegedly lying to Congress, a move celebrated by Trump as \"JUSTICE FOR AMERICA!\" The indictment, focusing on false statements and obstruction, raises concerns about the Justice Department's weaponization under Attorney General Pa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ex-fbi-director-james-comey-indicted-on-charges-of-lying-to-congress-and-obstruction/articleshow/124140459.cms",
    "timestamp": "2025-09-26T01:49:09Z"
  },
  {
    "title": "Fiery Ryder Cup Start Expected With Trump Set To Attend",
    "description": "The 45th Ryder Cup on Friday with two intense, emotional duos facing off in a potentially explosive opening match and US President Donald Trump set to attend.",
    "link": "https://www.ibtimes.com/fiery-ryder-cup-start-expected-trump-set-attend-3784502",
    "timestamp": "2025-09-26T01:48:19Z"
  },
  {
    "title": "Trump Says He Asked Somalia President If He’d ‘Like To Take’ Ilhan Omar Back",
    "description": "Trump said he asked Somalia President Hassan Sheikh Mohamud if he would \"like to take\" back Democrat Minnesota Rep. Ilhan Omar, but Mohamud declined.",
    "link": "https://dailycaller.com/2025/09/25/trump-says-he-asked-somalia-head-take-ilhan-omar-back/",
    "timestamp": "2025-09-26T01:47:29Z"
  },
  {
    "title": "US to impose 100% tariff on branded, patented drugs unless made domestically, Trump warns tariffs could rise to 250%",
    "description": "Donald Trump announced new tariffs. The US will impose a 100 per cent tariff on specific pharmaceutical products from October 1. There is an exemption for companies building drug manufacturing plants in the US. New trade measures include duties on heavy truck…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-to-impose-100-tariff-on-branded-drugs-earlier-trump-warned-tariff-of-250/articleshow/124140220.cms",
    "timestamp": "2025-09-26T01:44:51Z"
  },
  {
    "title": "Fiery Ryder Cup start expected with Trump set to attend",
    "description": "The 45th Ryder Cup on Friday with two intense, emotional duos facing off in a potentially explosive opening match and US President Donald Trump set to attend.\"The buildup of any Ryder Cup is pretty intense.",
    "link": "https://sports.yahoo.com/article/fiery-ryder-cup-start-expected-014341466.html",
    "timestamp": "2025-09-26T01:43:41Z"
  },
  {
    "title": "Fed's Cook Warns Supreme Court of Market 'Chaos' If She's Fired",
    "description": "Federal Reserve Governor Lisa Cook’s attorneys urged the US Supreme Court to let her stay on the job while she fights President Donald Trump’s attempt to fire her, warning that even her temporary removal risks “chaos and disruption” in financial markets. Gran…",
    "link": "https://www.ndtvprofit.com/markets/feds-cook-warns-supreme-court-of-market-chaos-if-shes-fired",
    "timestamp": "2025-09-26T01:41:10Z"
  },
  {
    "title": "Trump announces a flurry of tariffs on pharmaceuticals, trucks, and furniture",
    "description": "President Donald Trump drops a new round of tariffs on pharmaceuticals, heavy trucks, and furniture starting October 1.\nREUTERS/Brendan McDermid\nTrump announced new tariffs on pharmaceuticals, trucks, and some furniture starting October 1.\nThe tariffs aim to …",
    "link": "https://biztoc.com/x/5738fa362bb50125",
    "timestamp": "2025-09-26T01:40:04Z"
  },
  {
    "title": "Former Fed chairs warn that removing Lisa Cook could lead to inflation boom",
    "description": "A group of the country's top economic leaders, including every living former Federal Reserve chair, filed an amicus brief with the Supreme Court on Thursday in support of Fed governor Lisa Cook, who President Donald Trump is seeking to remove.\nThe group, led …",
    "link": "https://biztoc.com/x/bd82c8457f89835e",
    "timestamp": "2025-09-26T01:39:59Z"
  },
  {
    "title": "Exclusive — Peter Navarro: Trump Has Proven We Can Turn Around U.S. Trade Deficit with Tariff Revenues",
    "description": "Peter Navarro, senior counselor to President Donald Trump for trade and manufacturing, during a special Founders Roundtable on Breitbart Fight Club said that President Donald Trump has proven the country could use tariffs to reduce its trade deficit.\nThe post…",
    "link": "https://www.breitbart.com/politics/2025/09/25/exclusive-peter-navarro-trump-proven-turn-around-u-s-trade-deficit-tariff-revenues/",
    "timestamp": "2025-09-26T01:39:35Z"
  },
  {
    "title": "Trump imposes new import tariffs, citing national security",
    "description": "President Donald Trump is putting import taxes of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on Oct. 1.",
    "link": "https://www.wgal.com/article/trump-import-tariffs-pharmaceuticals-furniture-trucks/68067442",
    "timestamp": "2025-09-26T01:38:24Z"
  },
  {
    "title": "Trump imposes new import tariffs, citing national security",
    "description": "President Donald Trump is putting import taxes of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on Oct. 1.",
    "link": "https://www.ketv.com/article/trump-import-tariffs-pharmaceuticals-furniture-trucks/68067442",
    "timestamp": "2025-09-26T01:37:29Z"
  },
  {
    "title": "James Comey responds to indictment: 'I'm innocent'",
    "description": "Former FBI Director James Comey appeared defiant in a new video released Thursday in response to his indictment, declaring his innocence and saying he has “great confidence in the federal judicial system.”“My family and I have known for years that there are c…",
    "link": "https://www.nbcnews.com/politics/trump-administration/james-comey-responds-indictment-innocent-rcna233822",
    "timestamp": "2025-09-26T01:37:08Z"
  },
  {
    "title": "The Comey Indictment Is Not Just Payback",
    "description": "It’s an advance glimpse of Trump’s next attempted seizure of power.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/09/comey-indictment/684377/",
    "timestamp": "2025-09-26T01:35:45Z"
  },
  {
    "title": "Donald Trump announces 100% tariff on branded pharmaceutical products (Financial Times)",
    "description": "Financial Times:\nDonald Trump announces 100% tariff on branded pharmaceutical products  —  The US president also unveiled levies on heavy trucks, kitchen cabinets and bathroom vanities  —  Donald Trump has announced tariffs of 100 per cent on medicines and ph…",
    "link": "https://www.memeorandum.com/250925/p155",
    "timestamp": "2025-09-26T01:35:01Z"
  },
  {
    "title": "Trump announces a flurry of tariffs on pharmaceuticals, trucks, and furniture",
    "description": "Obtaining medicine, buying trucks, and furnishing your home could all get more expensive starting on October 1, when Trump's new tariffs kick in.",
    "link": "https://www.businessinsider.com/trump-tariffs-pharmaceuticals-trucks-furniture-2025-9",
    "timestamp": "2025-09-26T01:34:53Z"
  },
  {
    "title": "What we know about the indictment filed against ex-FBI chief James Comey",
    "description": "Former FBI Director James Comey has been charged with crimes connected to his Senate testimony back in 2020 about an investigation",
    "link": "https://abcnews.go.com/Politics/wireStory/indictment-filed-fbi-chief-james-comey-125951570",
    "timestamp": "2025-09-26T01:34:27Z"
  },
  {
    "title": "CNBC Daily Open: Trump's new tariffs on drugs and trucks — and bathroom vanities",
    "description": "Tariffs for drugs, trucks and kitchen cabinets begin Oct. 1. Coincidentally, that's the opening date for \"Mad Max: The Pills in Your Cabinet.\" (Not a real movie.)",
    "link": "https://www.cnbc.com/2025/09/26/cnbc-daily-open-trumps-new-tariffs-on-drugs-and-trucks-and-bathroom-vanities.html",
    "timestamp": "2025-09-26T01:31:23Z"
  },
  {
    "title": "Trump announces tariff on branded pharmaceutical imports",
    "description": "In the United States, President Donald Trump has announced a new tariff of 100% on branded pharmaceutical imports from companies that are not building manufacturing plants in the US.",
    "link": "https://www.rte.ie/news/us/2025/0926/1535412-trump-tariff-pharmaceutical/",
    "timestamp": "2025-09-26T01:30:54Z"
  },
  {
    "title": "Ex-FBI Director James Comey indicted on charges of lying to Congress and obstruction (Associated Press)",
    "description": "Associated Press:\nEx-FBI Director James Comey indicted on charges of lying to Congress and obstruction  —  James Comey was charged Thursday with lying to Congress in a criminal case filed days after President Donald Trump appeared to urge his attorney general…",
    "link": "https://www.memeorandum.com/250925/p153",
    "timestamp": "2025-09-26T01:30:01Z"
  },
  {
    "title": "Waltz calls UN mishaps during Trump speech ‘unacceptable,’ vows funding freeze until reforms",
    "description": "Ambassador Mike Waltz demands U.N. reforms after escalator, teleprompter and audio failures disrupted President Donald Trump's speech, with Secret Service investigating.",
    "link": "https://www.foxnews.com/politics/waltz-calls-un-mishaps-trump-speech-unacceptable-vows-funding-freeze-reforms",
    "timestamp": "2025-09-26T01:29:11Z"
  },
  {
    "title": "Pakistani PM Shehbaz Sharif, Army Chief Asim Munir wait for an hour to meet Donald Trump at Oval Office",
    "description": "Ahead of his scheduled meeting with Pakistan's Prime Minister Shehbaz Sharif and Field Marshal, US President Donald Trump addressed reporters from the Oval Office, saying, \"they're coming, and they may be in this room right now. I don't know, because we're la…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pakistani-pm-asim-munir-wait-for-an-hour-to-meet-donald-trump-at-oval-office/articleshow/124140029.cms",
    "timestamp": "2025-09-26T01:29:06Z"
  },
  {
    "title": "Former FBI Director Charged As Trump Steps Up Retribution Drive",
    "description": "Former FBI director and prominent Donald Trump critic James Comey was indicted Thursday on two criminal counts as the US president escalated a campaign of retribution against political foes.",
    "link": "https://www.ibtimes.com/former-fbi-director-charged-trump-steps-retribution-drive-3784494",
    "timestamp": "2025-09-26T01:27:12Z"
  },
  {
    "title": "Hegseth says Wounded Knee soldiers will keep their Medals of Honor",
    "description": "Defense Secretary Pete Hegseth has announced that he has decided that the 20 soldiers who received the Medal of Honor for their actions in 1890 at Wounded Knee will keep their awards",
    "link": "https://abcnews.go.com/Politics/wireStory/hegseth-wounded-knee-soldiers-medals-honor-125950661",
    "timestamp": "2025-09-26T01:26:26Z"
  },
  {
    "title": "Exclusive — Navarro: Comey Was 'the Mastermind or the Useful Idiot’ in Russia Hoax",
    "description": "Senior White House Adviser Peter Navarro told Founder's Roundtable on Breitbart Fight Club in an exclusive interview Thursday that former FBI Director James Comey, who was federally indicted Thursday, was \"the mastermind or the useful idiot\" behind the Russia…",
    "link": "https://www.breitbart.com/politics/2025/09/25/exclusive-navarro-comey-mastermind-useful-idiot-russia-hoax/",
    "timestamp": "2025-09-26T01:26:12Z"
  },
  {
    "title": "Stocks struggle as Trump slaps new tariffs, Fed cut bets unwind",
    "description": "SINGAPORE (Reuters) -Asia shares got off to a shaky start on Friday after U.S. President Donald Trump unveiled a fresh round of punishing tariffs and as...",
    "link": "https://finance.yahoo.com/news/stocks-struggle-trump-slaps-tariffs-012609728.html",
    "timestamp": "2025-09-26T01:26:09Z"
  },
  {
    "title": "A 100% tariff on some imported drugs is coming October 1, Trump says | CNN Business",
    "description": "President Donald Trump announced Thursday that brand-name or patented pharmaceutical products will be subject to a 100% tariff starting October 1 – unless the drugmaker is building a manufacturing plant in the US.",
    "link": "https://www.cnn.com/2025/09/25/business/imported-pharmaceuticals-tariff-trump",
    "timestamp": "2025-09-26T01:25:00Z"
  },
  {
    "title": "Former FBI director James Comey indicted on two charges",
    "description": "James Comey says he is innocent and the charges are politically motivated, as they follow Trump pressure on prosecutors to act.",
    "link": "https://www.bbc.co.uk/news/articles/cy50ggv35zpo",
    "timestamp": "2025-09-26T01:24:16Z"
  },
  {
    "title": "Reform faces questions over tech investor's role in cost-cutting drive",
    "description": "Harriet Green, founder of Basis Capital, is working with the party's cost-cutting unit Doge.",
    "link": "https://www.bbc.com/news/articles/c4gzwn42xdvo",
    "timestamp": "2025-09-26T01:21:21Z"
  },
  {
    "title": "Indicted ex-FBI chief responds to ‘tyrant’ Trump (VIDEO)",
    "description": "Former FBI Director James Comey has vowed to fight criminal charges of lying to Congress and obstruction of justice Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625280-comey-not-afraid-tyrant-trump/",
    "timestamp": "2025-09-26T01:20:16Z"
  },
  {
    "title": "Ex-FBI Director Comey says he is ‘innocent’ after US court indictment",
    "description": "Former FBI Director James Comey is a longtime critic of US President Donald Trump and testified against him in 2020.",
    "link": "https://www.aljazeera.com/news/2025/9/26/ex-fbi-director-comey-says-he-is-innocent-after-us-court-indictment",
    "timestamp": "2025-09-26T01:20:09Z"
  },
  {
    "title": "Civil society helps uphold democracy and provides built-in resistance to authoritarianism",
    "description": "There are growing signs that American civil society is becoming more vulnerable to the president’s preferences and dictates – something that happens in authoritarian countries.",
    "link": "https://theconversation.com/civil-society-helps-uphold-democracy-and-provides-built-in-resistance-to-authoritarianism-265705",
    "timestamp": "2025-09-26T01:18:48Z"
  },
  {
    "title": "Trump Announces 100% Tariff On Imported Pharma Drugs Starting October 1",
    "description": "US President Donald Trump announced Friday he will impose a 100% import tax on pharmaceutical drugs.In a post on Truth Social Trump said that, \"Starting October 1st, 2025, we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product, un…",
    "link": "https://www.ndtvprofit.com/business/trump-announces-100-tariff-on-imported-pharma-drugs-starting-october-1",
    "timestamp": "2025-09-26T01:18:06Z"
  },
  {
    "title": "Doctors debunk Trump's claims on OTC medicines and autism",
    "description": "Montgomery County Executive Marc Elrich called the President's statements dangerous and said they may cause people not seek medical care.",
    "link": "https://www.wusa9.com/article/news/health/montgomery-county-leaders-challenge-trump-drug-vaccine-safety-claims/65-34e2c9f9-bbfc-450f-93cb-61ae132cb9f6",
    "timestamp": "2025-09-26T01:16:14Z"
  },
  {
    "title": "Klobuchar: Trump 'Ordered' Comey Prosecution, He Is Literally Weaponizing DOJ",
    "description": "Thursday on CNN's \"Anderson Cooper 360,\" Sen. Amy Klobuchar (D-MN) claimed the indictment of former FBI Director James Comey was \"ordered\" by President Donald Trump.\nThe post Klobuchar: Trump ‘Ordered’ Comey Prosecution, He Is Literally Weaponizing DOJ appear…",
    "link": "https://www.breitbart.com/clips/2025/09/25/klobuchar-trump-ordered-comey-prosecution-he-is-literally-weaponizing-doj/",
    "timestamp": "2025-09-26T01:15:34Z"
  },
  {
    "title": "Fight Club Exclusive — Peter Navarro: Breitbart ‘Tip of the Spear’ Fighting for Honest Reporting of Trump Agenda",
    "description": "Peter Navarro, senior counselor to President Donald Trump for trade and manufacturing, during a special Founders Roundtable episode of the Breitbart Fight Club, said Breitbart News has been the \"tip of the spear\" fighting for honest reporting of the Trump age…",
    "link": "https://www.breitbart.com/politics/2025/09/25/fight-club-exclusive-peter-navarro-breitbart-tip-of-the-spear-fighting-for-honest-reporting-of-trump-agenda/",
    "timestamp": "2025-09-26T01:14:20Z"
  },
  {
    "title": "'We will not live on our knees': James Comey claps back after DOJ indictment",
    "description": "Former FBI Director James Comey responded to President Donald Trump's DOJ returning an indictment against him from a grand jury in an Instagram post on Thursday. \"My family and I have known for years that there are costs to standing up to Donald Trump, but we…",
    "link": "https://www.rawstory.com/james-comey-2674041308/",
    "timestamp": "2025-09-26T01:11:40Z"
  }
]