[
  {
    "title": "‘That Is Bizarre!’: Tucker Carlson, Ted Cruz Come To Blows Over Trump’s Iran Response",
    "description": "Tucker Carlson and Ted Cruz clashed in a Wednesday interview over President Donald Trump's response to Iran amid its ongoing conflict with Israel.",
    "link": "https://dailycaller.com/2025/06/18/tucker-carlson-ted-cruz-debate-trumps-iran-response/",
    "timestamp": "2025-06-18T19:36:53Z"
  },
  {
    "title": "Democrats Abandon Hearing on Biden Cognitive Decline Coverup",
    "description": "Democrats left a Senate Judiciary Committee hearing on Wednesday after delivering their opening statements, refusing to participate in an inquiry into whether their party helped conceal President Biden’s cognitive decline. Senators Dick Durbin (D-IL) and Pete…",
    "link": "https://freerepublic.com/focus/f-bloggers/4323880/posts",
    "timestamp": "2025-06-18T19:35:14Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden's mental fitness as Democrats boycott",
    "description": "Republican senators are looking into former President Joe Biden's ability to serve in office",
    "link": "https://abcnews.go.com/US/wireStory/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-122985674",
    "timestamp": "2025-06-18T19:34:56Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "Democrats boycotted the hearing and criticized Republicans for 'arm chair diagnosing' Biden.",
    "link": "https://www.bostonherald.com/2025/06/18/congress-biden-mental-fitness/",
    "timestamp": "2025-06-18T19:34:35Z"
  },
  {
    "title": "NYC Comptroller Brad Lander Speaks Out After ICE Arrested Him in Courthouse",
    "description": "“This is part of what authoritarians do,” Lander says. He also discusses the mayoral race and the New York for All Act.",
    "link": "https://www.democracynow.org/2025/6/18/nyc_brad_lander_arrest_by_ice#transcript",
    "timestamp": "2025-06-18T19:32:47Z"
  },
  {
    "title": "Trump: Iran wants to come to WH, I may do that",
    "description": "United States President Donald Trump pointed out on Wednesday during a press briefing from the Oval Office that Iran wants to come to the White House to negotiate a nuclear deal with the US.\"They shou...",
    "link": "https://biztoc.com/x/d4a413f5c39699ed",
    "timestamp": "2025-06-18T19:31:34Z"
  },
  {
    "title": "Powell Doesn't Discuss Trump Criticism or Future Fed Role",
    "description": "3 min ago\nPowell Doesn't Discuss Trump Criticism or Future Fed Role\nFor months, President Donald Trump has made it clear he isn’t happy that the Fed hasn’t cut interest rates since December. During Wednesday’s news conference, a reporter asked Powell to respo…",
    "link": "https://biztoc.com/x/63b765b0ad4ab0ee",
    "timestamp": "2025-06-18T19:31:18Z"
  },
  {
    "title": "Drug overdoses are increasing for the first time in years and health experts are trying to figure out why",
    "description": "Street drug overdoses rise after 17 months, a new report from the CDC states.",
    "link": "https://www.the-independent.com/life-style/us-drugs-overdose-rise-cdc-report-b2772651.html",
    "timestamp": "2025-06-18T19:31:07Z"
  },
  {
    "title": "Iran enters near total internet blackout as Trump remains cryptic over potential US strikes",
    "description": "Israeli attacks on Tehran kill an estimated 585 people by Tuesday, while Iran’s supreme leader calls US president’s rhetoric ‘absurd’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/18/iran-enters-near-total-internet-blackout-as-trump-remains-cryptic-over-potential-us-strikes/",
    "timestamp": "2025-06-18T19:30:59Z"
  },
  {
    "title": "Donald Trump’s No-Strategy Strategy on Iran",
    "description": "Isaac Chotiner interviews Aaron David Miller, of the Carnegie Endowment for International Peace, on how Donald Trump could drag the U.S. into Israel’s war against Iran.",
    "link": "https://www.newyorker.com/news/q-and-a/donald-trumps-no-strategy-strategy-on-iran",
    "timestamp": "2025-06-18T19:30:32Z"
  },
  {
    "title": "Bill Clinton urges Trump to 'defuse' Israel-Iran crisis",
    "description": "Former President Bill Clinton called on President Donald Trump to de-escalate Israel-Iran tensions and expressed concerns about civilian casualties in the region.",
    "link": "https://www.foxnews.com/media/bill-clinton-urges-trump-defuse-israel-iran-crisis",
    "timestamp": "2025-06-18T19:30:27Z"
  },
  {
    "title": "WATCH: Sen. King tells Hegseth restoring Confederate names to military bases is an ‘insult’",
    "description": "Last week, President Donald Trump announced in remarks at Fort Bragg, North Carolina, that the names of seven bases that had changed under the Biden administration would be returned to their former names.",
    "link": "https://biztoc.com/x/b5ee92ca23a4e2e9",
    "timestamp": "2025-06-18T19:30:26Z"
  },
  {
    "title": "Britain’s Third-Richest Person Says Government Is Killing Ambition And Growth",
    "description": "The Labour government is pursuing a “vindictive” agenda that threatens the future prosperity of the nation, according to James Dyson, one of the U.K.’s most successful entrepreneurs.",
    "link": "https://www.forbes.com/sites/robertolsen-1/2025/06/18/britains-third-richest-person-says-government-is-killing-ambition-and-growth/",
    "timestamp": "2025-06-18T19:30:24Z"
  },
  {
    "title": "LA Mayor Lifts Downtown Curfew She Imposed During Protests",
    "description": "Downtown Los Angeles businesses hoped customers would return quickly after Mayor Karen Bass lifted a curfew she had imposed last week to prevent vandalism and break-ins during nighttime protests against President Donald Trump’s immigration crackdown. The prot…",
    "link": "https://www.insurancejournal.com/news/west/2025/06/18/828395.htm",
    "timestamp": "2025-06-18T19:29:59Z"
  },
  {
    "title": "Trump railed against socialism in his campaign. He's flirting with it as president",
    "description": "Trump has been comfortable deploying the power of government to achieve specific economic outcomes, diverging from the GOP's traditional free-market approach",
    "link": "https://qz.com/trump-tariffs-trade-socialism-walmart-apple-us-steel",
    "timestamp": "2025-06-18T19:29:18Z"
  },
  {
    "title": "The Fed holds interest rates steady — and still sees two cuts later this year",
    "description": "The decision and surrounding reasoning, widely expected by markets, leaves the federal funds target rate at its current range of 4.25% to 4.50%",
    "link": "https://qz.com/federal-reserve-interest-rates-steady-cuts",
    "timestamp": "2025-06-18T19:28:21Z"
  },
  {
    "title": "Trump says he just can't get Fed Chair Jerome Powell to cut interest rates: 'I think he hates me'",
    "description": "The president insulted Powell anew and toyed with installing himself as Fed leader before the central bank again held rates steady",
    "link": "https://qz.com/trump-cant-get-fed-chair-jerome-powell-to-cut-interest-rates",
    "timestamp": "2025-06-18T19:28:00Z"
  },
  {
    "title": "Manhattan U.S. Attorney Considers Charging NYC Democrat Mayoral Candidate with Assaulting ICE Agent",
    "description": "The United States Attorney's Office for the Southern District of New York is considering charges against New York City Comptroller and Democrat mayoral candidate Brad Lander for allegedly assaulting an Immigration and Customs Enforcement (ICE) agent and imped…",
    "link": "https://www.breitbart.com/politics/2025/06/18/manhattan-u-s-attorney-considers-charging-nyc-democrat-mayoral-candidate-with-assaulting-ice-agent/",
    "timestamp": "2025-06-18T19:26:21Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.06.18 WEB H264-onX",
    "description": "Season , Episode – \"We've Been Targets For a Long Time' Eric Trump On Assassination Attempts + Running For President\"Protests against raids by immigration officers have sparked protests across the US - including days of unrest in Los Angeles, but Donald Trump…",
    "link": "https://post.rlsbb.ru/piers-morgan-uncensored-2025-06-18-web-h264-onx/",
    "timestamp": "2025-06-18T19:26:08Z"
  },
  {
    "title": "5 Wildest Moments from Tucker Carlson’s Explosive Showdown With Ted Cruz",
    "description": "A preview excerpt posted Tuesday generated a ton of buzz for Wednesday's faceoff between Tucker Carlson and Ted Cruz. And the full interview did not disappoint.\nThe post 5 Wildest Moments from Tucker Carlson’s Explosive Showdown With Ted Cruz first appeared o…",
    "link": "https://www.mediaite.com/media/news/5-wildest-moments-from-tucker-carlsons-explosive-showdown-with-ted-cruz/",
    "timestamp": "2025-06-18T19:24:28Z"
  },
  {
    "title": "No proof Iran is working on a nuclear bomb – UN watchdog",
    "description": "IAEA chief Rafael Grossi’s statement refutes claims made by Israel and US President Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619672-iaea-grossi-iran-israel/",
    "timestamp": "2025-06-18T19:23:48Z"
  },
  {
    "title": "Trump Administration Signals It Could Send The Military To Even More Cities",
    "description": "The DOJ argued Trump has the power to take control of state National Guard units whenever he wants — a chilling preview of what could happen in cities across the U.S.",
    "link": "https://www.huffpost.com/entry/trump-national-guard-los-angeles_n_6852f66ce4b0672778c491a6",
    "timestamp": "2025-06-18T19:23:30Z"
  },
  {
    "title": "Amy Coney Barrett Doesn’t Think the Supreme Court’s Anti-Trans Ruling Went Far Enough",
    "description": "Three conservative justices have signaled they don’t believe the Constitution protects transgender people from discrimination.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-skrmetti-anti-trans-ruling-amy-coney-barrett-john-roberts.html",
    "timestamp": "2025-06-18T19:23:26Z"
  },
  {
    "title": "Supreme Court upholds Tennessee ban on transgender procedures for minors",
    "description": "null / Credit: Wolfgang Schaller|Shutterstock.\n\nCNA Staff, Jun 18, 2025 / 15:23 pm (CNA).\nIn a pivotal 6-3 decision, the U.S. Supreme Court on Wednesday ruled to uphold Tennessee’s ban on medical procedures on transgender-identifying youth.The June 18 ruling …",
    "link": "https://www.catholicnewsagency.com/news/264827/supreme-court-upholds-tennessee-ban-on-transgender-procedures-for-minors",
    "timestamp": "2025-06-18T19:23:00Z"
  },
  {
    "title": "WATCH: Sen. King tells Hegseth restoring Confederate names to military bases is an ‘insult’",
    "description": "Last week, President Donald Trump announced in remarks at Fort Bragg, North Carolina, that the names of seven bases that had changed under the Biden administration would be returned to their former names.",
    "link": "https://www.pbs.org/newshour/politics/watch-sen-king-tells-hegseth-restoring-confederate-names-to-military-bases-is-an-insult",
    "timestamp": "2025-06-18T19:22:50Z"
  },
  {
    "title": "Pentagon Removes Key Middle East Officer Over Posts Blasting Israel as ‘Death Cult’ and America’s ‘Worst Ally’",
    "description": "The Pentagon suspended an official and launched an investigation after a report on anti-Israel posts made by the officer who helped with Middle East strategy.\nThe post Pentagon Removes Key Middle East Officer Over Posts Blasting Israel as ‘Death Cult’ and Ame…",
    "link": "https://www.mediaite.com/media/news/pentagon-suspends-middle-east-officer-over-posts-blasting-israel-as-death-cult-and-americas-worst-ally/",
    "timestamp": "2025-06-18T19:22:14Z"
  },
  {
    "title": "The Fed Didn't Cut Rates, But Your Credit Card's APR Could Still Change. Here's What You Need to Know",
    "description": "Tariffs may be unpredictable, but you definitely need to tackle your credit card debt sooner rather than later.",
    "link": "https://www.cnet.com/personal-finance/the-fed-didnt-cut-rates-but-your-credit-cards-apr-could-still-change-heres-what-you-need-to-know/",
    "timestamp": "2025-06-18T19:22:00Z"
  },
  {
    "title": "Misunderstanding Trump",
    "description": "Many are now demanding that President Donald Trump act abroad in the way they think he had promised and campaigned—which can be mostly defined as... Read More\nThe post Misunderstanding Trump appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/18/misunderstanding-trump/",
    "timestamp": "2025-06-18T19:21:51Z"
  },
  {
    "title": "Trump administration to shut down LGBTQ youth suicide hotline",
    "description": "The Trump administration will shut down the national LGBTQ youth suicide lifeline in 30 days",
    "link": "https://www.nbcnews.com/nbc-out/out-news/trump-administration-shut-lgbtq-youth-suicide-hotline-rcna213815",
    "timestamp": "2025-06-18T19:21:45Z"
  },
  {
    "title": "Can Iran's government survive war with Israel?",
    "description": "Israel launched its war in Iran to keep the Islamic regime from acquiring a nuclear weapon. The question now is whether the regime will survive the onslaught at all, especially with President Donald Trump considering joining the fray.\nA collapse of the Irania…",
    "link": "https://biztoc.com/x/05cd312e2c034888",
    "timestamp": "2025-06-18T19:20:26Z"
  },
  {
    "title": "Trump deploys 2,000 additional National Guard troops to Los Angeles (Erin Doherty/CNBC)",
    "description": "Erin Doherty / CNBC:\nTrump deploys 2,000 additional National Guard troops to Los Angeles … President Donald Trump's administration is ordering an additional 2,000 members of the California Army National Guard to the Los Angeles area under federal command, the…",
    "link": "https://www.memeorandum.com/250618/p106",
    "timestamp": "2025-06-18T19:20:00Z"
  },
  {
    "title": "2nd LD Writethru: U.S. Fed keeps interest rates unchanged as wait-and-see mode continues",
    "description": "NEW YORK, June 18 (Xinhua) -- The U.S. Federal Reserve on Wednesday left the target range for the federal funds rates unchanged at 4.25 percent to 4.5 percent, as solid expansion of economic activity supports the wait-and-see mode. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/19/2nd-ld-writethru-us-fed-keeps-interest-rates-unchanged-as-wait-and-see-mode-continues",
    "timestamp": "2025-06-18T19:20:00Z"
  },
  {
    "title": "Iran's secretive nuclear site and the bomb that could destroy it",
    "description": "If the U.S. decides to support Israel more directly in its attack on Iran, one option would be to provide the “bunker buster” bombs believed necessary to significantly damage the Fordo nuclear fuel enrichment plant built deep into a mountain.",
    "link": "https://www.cbc.ca/news/world/iran-fordow-fordo-site-bunker-buster-1.7564311",
    "timestamp": "2025-06-18T19:19:40Z"
  },
  {
    "title": "Trans, Nonbinary People Win Key Court Victory on Passport Rights",
    "description": "An ACLU spokesperson said the ruling was a win against “efforts to drive transgender people out of public life.”…",
    "link": "https://truthout.org/articles/trans-nonbinary-people-win-key-court-victory-on-passport-rights/",
    "timestamp": "2025-06-18T19:19:21Z"
  },
  {
    "title": "Pope Leo XIV Addresses Iran-Israel Conflict: Reject 'Barbarism,' Embrace Peace",
    "description": "Pope Leo XIV addressed the eruption of active hostilities between Iran and Israel for the first time on Wednesday, urging the world to facilitate peace and reject \"scientific weapons of all kinds,\" an apparent reference to Iran's illicit nuclear program.\nThe …",
    "link": "https://www.breitbart.com/faith/2025/06/18/pope-leo-xiv-addresses-iran-israel-conflict-reject-barbarism-embrace-peace/",
    "timestamp": "2025-06-18T19:19:02Z"
  },
  {
    "title": "Barron Trump’s $40 million crypto windfall? Inside the shocking profits from his father’s digital coin empire",
    "description": "Donald Trump's youngest son, Barron Trump, has reportedly made a significant fortune through cryptocurrency. At 19, Barron's crypto portfolio is valued at $40 million. He is a cofounder and 'Web3 ambassador' at World Liberty Financial.",
    "link": "https://economictimes.indiatimes.com/news/international/us/barron-trumps-40-million-crypto-windfall-inside-the-shocking-profits-from-his-fathers-digital-coin-empire-barron-trump-crypto-news-donald-trump-news/articleshow/121938412.cms",
    "timestamp": "2025-06-18T19:17:40Z"
  },
  {
    "title": "Modi calls out Trump’s narrative on India-Pak conflict; says will never accept mediation",
    "description": "STATE TIMES NEWS KANANASKIS (CANADA): Prime Minister Narendra Modi has told President Donald Trump that India and Pakistan halted their military actions last month following direct talks between their militaries without any mediation by the US, calling out th…",
    "link": "https://statetimes.in/modi-calls-out-trumps-narrative-on-india-pak-conflict-says-will-never-accept-mediation/",
    "timestamp": "2025-06-18T19:12:36Z"
  },
  {
    "title": "Israel’s Long Road to Regional Dominance",
    "description": "First it humiliated the Arabs, then the Iranians—but Israel still needs Trump.",
    "link": "http://foreignpolicy.com/2025/06/18/israel-iran-regional-dominance-us-netanyahu/",
    "timestamp": "2025-06-18T19:12:21Z"
  },
  {
    "title": "Can Iran's government survive war with Israel?",
    "description": "'Regime change' may be on the agenda",
    "link": "https://theweek.com/politics/iran-government-survive-war-israel",
    "timestamp": "2025-06-18T19:12:09Z"
  },
  {
    "title": "'Has Hell frozen over?' Senate GOP leader gets cheeky over holdout Republican",
    "description": "Senate Majority Leader John Thune (R-SD) is desperately trying to wrangle the Republican caucus to pass President Donald Trump's budget, which he refers to as the \"big, beautiful bill.\" Thus far, several Republicans are opposed to the measure over significant…",
    "link": "https://www.rawstory.com/trump-budget-bill/",
    "timestamp": "2025-06-18T19:11:21Z"
  },
  {
    "title": "Iran’s leader rejects call to surrender",
    "description": "Agency DUBAI: Iran’s supreme leader on Wednesday rejected US calls for surrender in the face of blistering Israeli strikes and warned that any military involvement by the Americans would cause “irreparable damage” to them, in recorded video aired by state TV.…",
    "link": "https://statetimes.in/irans-leader-rejects-call-to-surrender/",
    "timestamp": "2025-06-18T19:10:49Z"
  },
  {
    "title": "Andrew Cuomo Is on the Verge of Clawing His Way Back to Power",
    "description": "Since leaving Albany in disgrace, the ex-governor has racked up endorsements and billionaire backers ahead of next week’s mayoral primary. Cuomo insiders speak of his vast experience—and sense of grievance. “He had power ripped away from him, he feels, unjust…",
    "link": "https://www.vanityfair.com/news/story/andrew-cuomo-nyc-mayors-race-2025",
    "timestamp": "2025-06-18T19:10:36Z"
  },
  {
    "title": "Trump Says Russia Sanctions Would Cost US ‘a Lot of Money’",
    "description": "US President Donald Trump indicated at the Group of Seven summit that he is in no rush to impose tougher sanctions on Russia, dismissing pressure from allied leaders eager to do more to push Moscow to the negotiating table.\nThe US president has repeatedly sai…",
    "link": "https://biztoc.com/x/76670fa149e76850",
    "timestamp": "2025-06-18T19:09:56Z"
  },
  {
    "title": "Unless the Trump family secretly built a U.S. factory, industry experts say the $500 Made in America smartphone is a fantasy",
    "description": "Donald Trump’s family business is putting the president’s name behind something that few have dared to produce in years: A Made in America smartphone.\nThe Trump Organization, led by the president’s eldest sons, said on Monday that it has licensed Donald Trump…",
    "link": "https://biztoc.com/x/b8bd6f3ede9d8413",
    "timestamp": "2025-06-18T19:09:48Z"
  },
  {
    "title": "Utah college student detained by ICE after a brief traffic stop to be released on bond",
    "description": "A college student who was detained by immigration authorities following a brief traffic stop earlier this month was granted bond on Wednesday, her attorney, Jon Hyman, confirmed to NBC News",
    "link": "https://www.nbcnews.com/news/latino/utah-college-student-detained-ice-brief-traffic-stop-released-bond-rcna213770",
    "timestamp": "2025-06-18T19:08:37Z"
  },
  {
    "title": "Tucker Carlson Tries to Puff Up His MAGA Bona Fides After Ted Cruz Calls Him Out: I Talked to Trump ‘Last Night!’",
    "description": "\"Look, I like Trump, I campaigned for Trump, I know Trump, I talked to him last night, I'm not against Trump, and you know that.”\nThe post Tucker Carlson Tries to Puff Up His MAGA Bona Fides After Ted Cruz Calls Him Out: I Talked to Trump ‘Last Night!’ first …",
    "link": "https://www.mediaite.com/politics/tucker-carlson-tries-to-puff-up-his-maga-bona-fides-after-ted-cruz-calls-him-out-i-talked-to-trump-last-night/",
    "timestamp": "2025-06-18T19:08:09Z"
  },
  {
    "title": "Israel Would Have No Qualms About USS Liberty-Style FALSE FLAG If Iran Campaign Falters - Analysts",
    "description": "Donald Trump is mulling whether or not to join Israel's aggression against Iran as Tel Aviv faces problems sustaining its defenses against growing counterstrikes, and apparently lacks a realistic game plan for an end to hostilities after failing to achieve it…",
    "link": "https://sputnikglobe.com/20250618/israel-would-have-no-qualms-about-uss-liberty-style-false-flag-if-iran-campaign-falters---analysts-1122283702.html",
    "timestamp": "2025-06-18T19:07:50Z"
  },
  {
    "title": "U.S. Military Build-Up Continues in the Middle East as Attack Decision Looms",
    "description": "While the U.S. evaluates whether to join the strikes on Iran or not, assets continue to flow to the Middle East in preparation for the decision. The U.S. is continuing to move forces to the Central Command (CENTCOM) Area of Operations (AOR) while the Israeli …",
    "link": "https://theaviationist.com/2025/06/18/us-military-build-up-continues-middle-east/",
    "timestamp": "2025-06-18T19:07:31Z"
  },
  {
    "title": "'Unraveling': Ex-Trump associate warns it's the beginning of the end for MAGA",
    "description": "Lev Parnas, a former associate of Donald Trump and Rudy Giuliani, claimed in a new Substack article that the country is witnessing the beginning of the end for the MAGA movement.\"One month ago, I told you cracks were forming,\" Parnas wrote, citing conspiracy …",
    "link": "https://www.rawstory.com/maga-2672396469/",
    "timestamp": "2025-06-18T19:06:42Z"
  },
  {
    "title": "Texas Instruments will invest $60 billion in U.S. chipmaking",
    "description": "The company will expand its operations in Utah and its home state of Texas",
    "link": "https://qz.com/texas-instruments-invest-60-billion-in-us-chipmaking",
    "timestamp": "2025-06-18T19:06:40Z"
  },
  {
    "title": "Federal Reserve once again holds interest rates steady amid pressure from Trump",
    "description": "President rips 'Too Late' Powell: 'He is unbelievable!!! Europe has lowered NINE TIMES!'",
    "link": "https://www.wnd.com/2025/06/federal-reserve-once-again-holds-interest-rates-steady/",
    "timestamp": "2025-06-18T19:06:06Z"
  },
  {
    "title": "Trump Reveals His Amazing “Intelligence” on Iran’s Supposed Nukes",
    "description": "Donald Trump claimed to have intelligence Wednesday … but he doesn’t seem to know what he has intelligence about. \r\nAs tensions continue to build in the Middle East following Israel’s brutal strikes against Iran, the U.S. president took a break from the Situa…",
    "link": "https://newrepublic.com/post/196972/donald-trump-reveals-intelligence-iran-nuclear-weapons",
    "timestamp": "2025-06-18T19:05:45Z"
  },
  {
    "title": "Trump Compared to Diddy by Jimmy Kimmel Amid French President Macron G7 Summit Drama",
    "description": "Jimmy Kimmel is once again dissing President Donald Trump. The Jimmy Kimmel Live host called out the President of the United States for dissing French President Emmanuel Macron, who claimed President Trump “bailed” on the G7 summit in Canada to help broker a …",
    "link": "https://www.justjared.com/2025/06/18/trump-compared-to-diddy-by-jimmy-kimmel-amid-french-president-macron-g7-summit-drama/",
    "timestamp": "2025-06-18T19:03:17Z"
  },
  {
    "title": "What to know about travelling to the US and your rights at the border",
    "description": "The recent case of an Australian writer detained and denied entry to the US after being questioned about his political views has spotlighted the risks facing Australians under the US visa waiver program.",
    "link": "https://www.abc.net.au/news/2025-06-19/us-visa-waiver-program-esta-rights-at-border/105426744",
    "timestamp": "2025-06-18T19:02:29Z"
  },
  {
    "title": "No mediation on Pakistan acceptable: PM Modi to US President Trump",
    "description": "Prime Minister Narendra Modi firmly conveyed to President Donald Trump that India has consistently rejected third-party mediation in its dispute with Pakistan. Modi emphasized that India now considers acts of terrorism as acts of war, marking a significant sh…",
    "link": "https://economictimes.indiatimes.com/news/india/no-mediation-on-pakistan-acceptable-pm-modi-to-us-president-trump/articleshow/121938635.cms",
    "timestamp": "2025-06-18T19:01:29Z"
  },
  {
    "title": "Donald Trump Is SUPER Bothered By Protesters Wearing One Thing In Particular, And People Are Calling Out The Extreme Hypocrisy Of Law Enforcement Wearing It Alllllll The Time",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_91f634b5-da00-4c9f-9b08-2296dfefa250",
    "timestamp": "2025-06-18T19:01:01Z"
  },
  {
    "title": "CEOs haven't felt this gloomy about the economy since the pandemic",
    "description": "A total of 169 CEOs weighed in for The Business Roundtable's economic outlook index, which dropped 15 points, hitting its lowest level in five years.",
    "link": "https://www.businessinsider.com/business-roundtable-ceo-economic-outlook-index-5-year-low-2025-6",
    "timestamp": "2025-06-18T19:00:44Z"
  },
  {
    "title": "Marine veteran disrupts immigration protests with comedy sign, sparks liberal fury",
    "description": "Former Marine Justin Governale sparked backlash by crashing anti-Trump protests in Texas, but said his actual immigration views are more nuanced than people assumed.",
    "link": "https://www.foxnews.com/media/marine-veteran-disrupts-immigration-protests-comedy-sign-sparks-liberal-fury",
    "timestamp": "2025-06-18T19:00:09Z"
  },
  {
    "title": "GOP hawks appear to be winning over Trump on Iran (Politico)",
    "description": "Politico:\nGOP hawks appear to be winning over Trump on Iran  —  The president's comments are increasingly bellicose, but he won't yet say if the US will directly join Israel's fight against Tehran.  —  President Donald Trump, who criticized his predecessor fo…",
    "link": "https://www.memeorandum.com/250618/p103",
    "timestamp": "2025-06-18T19:00:01Z"
  },
  {
    "title": "Did Trump Declare War Against Iran Without Telling Anyone?",
    "description": "Earlier Tuesday on Air Force One, Donald Trump told the people of Tehran to evacuate the city, while tweeting \"we\" have complete and total control of the skies over Iran.\nWho the f*ck is \"we?\"\nThe country thought only Israel was involved in the conflict with …",
    "link": "https://crooksandliars.com/2025/06/did-trump-declare-war-against-iran-without",
    "timestamp": "2025-06-18T19:00:01Z"
  },
  {
    "title": "Democrats to launch 'Worst of Winsome' tour in Charlottesville",
    "description": "Virginia Democrats are launching a \"Worst of Winsome\" tour in Charlottesville Friday, targeting the GOP candidate for governor for her “extreme agenda and record.\"",
    "link": "https://dailyprogress.com/tncms/asset/editorial/019c7595-e214-4dc3-861d-4035a1bd4460/",
    "timestamp": "2025-06-18T19:00:00Z"
  },
  {
    "title": "Australia's status as an aloof observer of faraway events could soon be tested",
    "description": "This is not a normal American administration and these are not normal times. The notion this generation of Australians can stand as aloof observers of far-off events could soon be tested.",
    "link": "https://www.abc.net.au/news/2025-06-19/iran-israel-united-states-australia-involvement-richard-marles/105421214",
    "timestamp": "2025-06-18T19:00:00Z"
  },
  {
    "title": "Zelenskyy opens up about his White House clash with Trump in exclusive interview",
    "description": "Zelenskyy opens up about his clash with Trump in exclusive interview\nUkrainian President Volodymyr Zelenskyy talks about his relationship with Donald Trump, his doubts, and whether Ukraine can win the war with Russia in an interview with the Axel Springer Glo…",
    "link": "https://biztoc.com/x/c73c6ecc7e993061",
    "timestamp": "2025-06-18T18:58:36Z"
  },
  {
    "title": "Dems Duck Hearing On Biden’s Mental Fitness: ‘Admission Of Guilt’",
    "description": "Senate Democrats spurned a hearing on Wednesday on the &#8220;cover-up&#8221; of President Joe Biden&#8217;s mental state when he was in the White House, a boycott which Republicans took to be a confession of guilt.All but two Judiciary Committee Democrats sk…",
    "link": "https://www.dailywire.com/news/democrats-duck-biden-mental-fitness-hearing",
    "timestamp": "2025-06-18T18:58:33Z"
  },
  {
    "title": "US Fed meeting June 2025: Fed holds interest rates steady for 4th time in a row despite Trump pressure — top highlights, key takeaways, rate projections, and inflation forecasts",
    "description": "US Fed meeting June 2025 took center stage as the Federal Reserve held interest rates steady at 4.25%–4.5% for the fourth straight time, resisting strong pressure from President Donald Trump. Despite rising inflation and slower GDP growth forecasts, Fed offic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-fed-meeting-june-2025-fed-holds-interest-rates-steady-for-4th-time-in-a-row-despite-trump-pressure-top-highlights-key-takeaways-rate-projections-and-inflation-forecasts/articleshow/121938464.cms",
    "timestamp": "2025-06-18T18:58:31Z"
  },
  {
    "title": "Iran has amassed even more near weapons-grade uranium, UN watchdog says [05/31/2025]",
    "description": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the U.N. nuclear watchdog said Saturday. In a separate report, the agency called on Tehran to urgently change course and comply with its years-…",
    "link": "https://freerepublic.com/focus/f-news/4323870/posts",
    "timestamp": "2025-06-18T18:58:26Z"
  },
  {
    "title": "Iran has amassed even more near weapons-grade uranium, UN watchdog says [05/31/2025]",
    "description": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the U.N. nuclear watchdog said Saturday. In a separate report, the agency called on Tehran to urgently change course and comply with its years-…",
    "link": "https://freerepublic.com/focus/f-chat/4323870/posts",
    "timestamp": "2025-06-18T18:58:26Z"
  },
  {
    "title": "'Squad' members, GOP lawmaker join forces to reject US involvement in Israel-Iran war",
    "description": "Bipartisan coalition forms as Reps. Massie and Khanna introduce resolution requiring congressional approval for military action against Iran amid escalating Middle East tensions.",
    "link": "https://www.foxnews.com/politics/squad-members-gop-lawmaker-join-forces-reject-us-involvement-israel-iran-war",
    "timestamp": "2025-06-18T18:58:10Z"
  },
  {
    "title": "Zelenskyy opens up about his White House clash with Trump in exclusive interview",
    "description": "Ukrainian President Volodymyr Zelenskyy talks about his relationship with Donald Trump, his doubts, and whether Ukraine can win the war with Russia.",
    "link": "https://www.businessinsider.com/zelenskyy-opens-up-about-his-white-house-clash-2025-6",
    "timestamp": "2025-06-18T18:55:36Z"
  },
  {
    "title": "Trump vows peace online — then plots war? Netizens mock him over old posts as he plans to strike Iran",
    "description": "Donald Trump's Iran policy sees a sharp turn. He once advocated peace, now he threatens military action. Old tweets resurface, highlighting a perceived hypocrisy. The US assisted in shooting down Iranian missiles. Trump demanded Iran's unconditional surrender…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-vows-peace-online-then-plots-war-netizens-mock-him-over-old-posts-as-he-plans-to-strike-iran/articleshow/121938450.cms",
    "timestamp": "2025-06-18T18:55:22Z"
  },
  {
    "title": "Trump calls Fed chair 'stupid' for not cutting rates",
    "description": "President Trump criticized the Federal Reserve and its leader, labeling him \"stupid\" for not lowering interest rates. He insisted that the US economy is experiencing success with no inflation, despite concerns about the impact of new tariffs. Trump expressed …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-fed-chair-stupid-for-not-cutting-rates/articleshow/121938603.cms",
    "timestamp": "2025-06-18T18:52:58Z"
  },
  {
    "title": "Trump calls Fed chief 'stupid', slams central bank for not cutting interest rates",
    "description": "President Trump criticized the Federal Reserve and its leader, labeling him \"stupid\" for not lowering interest rates. He insisted that the US economy is experiencing success without inflation, despite concerns about the impact of new tariffs. Trump expressed …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-fed-chief-stupid-slams-central-bank-for-not-cutting-interest-rates/articleshow/121938578.cms",
    "timestamp": "2025-06-18T18:50:04Z"
  },
  {
    "title": "Trump to launch new round of tariffs, targeting pharma, chips and minerals",
    "description": "The Trump administration plans new tariffs. These tariffs target sectors vital to national security. Semiconductors and pharmaceuticals are included. These tariffs are under Section 232 of the Trade Expansion Act. Tariffs on steel and aluminum already exist. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-launch-new-round-of-tariffs-targeting-pharma-chips-and-minerals/articleshow/121938573.cms",
    "timestamp": "2025-06-18T18:49:47Z"
  },
  {
    "title": "Takeaways from the Supreme Court’s historic decision on transgender care | CNN Politics",
    "description": "The conservative Supreme Court dealt a significant blow to transgender Americans on Wednesday, issuing a sweeping decision that may have implications beyond the medical care that was at center of one of the court’s highest-profile disputes this year.",
    "link": "https://www.cnn.com/2025/06/18/politics/supreme-court-transgender-gender-affirming-skrmetti-takeaways",
    "timestamp": "2025-06-18T18:47:58Z"
  },
  {
    "title": "Trump is turning the U.S. into an EV laggard",
    "description": "U.S. President Donald Trump\n \n \n \n \n \n \n \n \n \n ’s efforts to unravel policies supporting \n \n \n \n \n \n \n \n \n \n electric vehicles\n \n \n \n \n \n \n \n \n \n threatens to turn the U.S. into a laggard for years to come, according to a new report. \n BloombergNEF reduced bo…",
    "link": "https://biztoc.com/x/a5491930b4d4ecea",
    "timestamp": "2025-06-18T18:47:55Z"
  },
  {
    "title": "‘More Guts And Balls Than You’: Democrat Throws Down With Hegseth on Defying a Trump Order to Shoot Protestors",
    "description": "\"A Republican Secretary of Defense, who I give a lot of credit to because he didn't accept the order. He had more guts and balls than you!\"\nThe post ‘More Guts And Balls Than You’: Democrat Throws Down With Hegseth on Defying a Trump Order to Shoot Protestors…",
    "link": "https://www.mediaite.com/politics/more-guts-and-balls-than-you-democrat-throws-down-with-hegseth-on-defying-a-trump-order-to-shoot-protestors/",
    "timestamp": "2025-06-18T18:47:40Z"
  },
  {
    "title": "Trump administration to end 988 suicide prevention specialized service for LGBTQ+ youth in July | CNN",
    "description": "The 988 Suicide & Crisis Lifeline’s specialized services for LGBTQ+ youth will no longer be operation starting July 17, according to a statement from the US Department of Health and Human Services’ Substance Abuse and Mental Health Services Administration (SA…",
    "link": "https://www.cnn.com/2025/06/18/health/trump-ends-988-lgbtq-suicide-prevention-service-wellness",
    "timestamp": "2025-06-18T18:47:00Z"
  },
  {
    "title": "Rod Stewart Says Donald Trump Is No Longer His Friend",
    "description": "Rod Stewart says that his neighbor, President Donald Trump, is no longer his friend after years of living near each other in Florida.",
    "link": "http://www.billboard.com/music/music-news/rod-stewart-donald-trump-no-longer-friend-1236002671/",
    "timestamp": "2025-06-18T18:46:51Z"
  },
  {
    "title": "So Trump’s Delaying the TikTok Ban Again",
    "description": "Donald Trump plans to delay the TikTok ban deadline another 90 days, after previously pushing it from April. We’re tired of this, grandpa.",
    "link": "http://www.vulture.com/article/tiktok-ban-deadline-extended.html",
    "timestamp": "2025-06-18T18:45:15Z"
  },
  {
    "title": "‘Not a serious person’: Pete Hegseth hedges to Congress on honoring court rulings",
    "description": "For the second time in two weeks, Defense Secretary Pete Hegseth hedged on whether he'd follow court rulings he disagreed with.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/not-serious-person-pete-hegseth-hedges-congress-honoring-court-rulings-rcna213797",
    "timestamp": "2025-06-18T18:43:21Z"
  },
  {
    "title": "The Fed is meeting. Don't expect an interest rate cut",
    "description": "While inflation has cooled in recent months, it remains above the Fed’s 2% target and has remained persistently elevated for years",
    "link": "https://qz.com/fed-unlikely-cut-rates-june-meeting-jerome-powell",
    "timestamp": "2025-06-18T18:43:10Z"
  },
  {
    "title": "The Donald Trump–Tucker Carlson Schism and the End of “America First”",
    "description": "As the president seriously considers joining Israel in its war against Iran, and flip-flopping on his isolationist brand, his relationship with his most steadfast media ally has devolved into acrimony. It’s emblematic of a larger divide in the House of MAGA.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-tucker-carlson-schism-iran",
    "timestamp": "2025-06-18T18:42:55Z"
  },
  {
    "title": "WWIII is trending on social media and Gen Z is coping one meme (or loaf) at a time",
    "description": "Israel-Iran War: In a world battered by rising conflict—from Iran to Ukraine to Kashmir—people have found an unexpected coping tool: humour. As fears of World War III surface online, social media users are turning anxiety into memes. Sarcasm now accompanies m…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/wwiii-news-wwiii-is-trending-as-the-iranisrael-war-intensifies-and-gen-z-is-coping-one-meme-or-loaf-at-a-time/articleshow/121937726.cms",
    "timestamp": "2025-06-18T18:42:40Z"
  },
  {
    "title": "Watch: Trump installs enormous US flags at the White House",
    "description": "According the president, the two flag poles are 100ft (30.5m) tall and paid for out of his own pocket.",
    "link": "https://www.bbc.com/news/videos/ckg3n1yl5k8o",
    "timestamp": "2025-06-18T18:42:28Z"
  },
  {
    "title": "Pete Hegseth Tells Senator Her ‘Time Is Up’ When Asked If Laura Loomer is Making Decisions at the Pentagon",
    "description": "A Democratic senator tore into Defense Secretary Pete Hegseth during a contentious Q&A about the involvement of far-right activist and conspiracy theorist Laura Loomer in personnel decision-making at the Pentagon.\nThe post Pete Hegseth Tells Senator Her ‘Time…",
    "link": "https://www.mediaite.com/media/news/pete-hegseth-tells-senator-her-time-is-up-when-asked-if-laura-loomer-is-making-decisions-at-the-pentagon/",
    "timestamp": "2025-06-18T18:40:46Z"
  },
  {
    "title": "Senate Holds Hearing on Biden’s Autopen Usage",
    "description": "The Senate Judicial Committee held a hearing Wednesday to assess the mental fitness of former President Joe Biden when he was in office. Following Biden’s debate with... Read More\nThe post Senate Holds Hearing on Biden’s Autopen Usage appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/06/18/senate-holds-hearing-on-bidens-autopen-usage/",
    "timestamp": "2025-06-18T18:39:38Z"
  },
  {
    "title": "Polls Show Trump’s Approval Rating Slipping Again",
    "description": "Polls show Trump’s approval rating slipping again after a period of stabilization, though pollsters continue to disagree. He is losing ground on immigration, and polling on his budget bill isn’t great either.",
    "link": "http://nymag.com/intelligencer/article/polls-show-trumps-approval-rating-slipping-again.html",
    "timestamp": "2025-06-18T18:38:29Z"
  },
  {
    "title": "US Fed leaves interest rates unchanged amid economic uncertainty",
    "description": "The US central bank held rates steady despite backlash from President Donald Trump.",
    "link": "https://www.aljazeera.com/economy/2025/6/18/us-fed-leaves-interest-rates-unchanged-amid-economic-uncertainty",
    "timestamp": "2025-06-18T18:38:27Z"
  },
  {
    "title": "Democrats Walk Out of Hearing Probing Biden's Mental Fitness When He Was in Office",
    "description": "Democrats Walk Out of Hearing Probing Biden's Mental Fitness When He Was in Officepjmedia.com",
    "link": "https://pjmedia.com/rick-moran/2025/06/18/democrats-walk-out-of-hearing-probing-bidens-mental-fitness-when-he-was-in-office-n4940923",
    "timestamp": "2025-06-18T18:37:53Z"
  },
  {
    "title": "Republicans uncover no new intel on Biden during hearing on his cognitive abilities",
    "description": "The Senate Judiciary Committee is holding a hearing Wednesday examining the cognitive abilities of former President Joe Biden.",
    "link": "https://abcnews.go.com/Politics/republicans-uncover-new-intel-biden-hearing-cognitive-abilities/story?id=122971024",
    "timestamp": "2025-06-18T18:37:39Z"
  },
  {
    "title": "Heed General Mattis’ Warning, D.C.: Less Diplomacy Means “More Ammunition”",
    "description": "To meet President Trump’s goal of ending and avoiding wars, Washington can’t just slash budgets. Soft power matters.",
    "link": "https://www.forbes.com/sites/andrewtisch/2025/06/18/heed-general-mattis-warning-dc-less-diplomacy-means-more-ammunition/",
    "timestamp": "2025-06-18T18:37:23Z"
  },
  {
    "title": "US Federal Reserve holds rates steady, sees two cuts in 2025 amid slower growth and persistent inflation",
    "description": "WASHINGTON: The US Federal Reserve held its benchmark interest rate steady on Wednesday (Jun 18), while signalling that two rate cuts remain on the table for 2025, even as it sca",
    "link": "https://www.channelnewsasia.com/world/us-federal-reserve-holds-rates-steady-sees-two-cuts-2025-amid-slower-growth-and-persistent-inflation-5190531",
    "timestamp": "2025-06-18T18:37:23Z"
  },
  {
    "title": "'It's blowing up': The Iran conflict is sparking a MAGA civil war",
    "description": "As Trump weighs next steps on Iran, there's a big debate among MAGA figures like Steve Bannon, Tucker Carlson and MTG over potential military action.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/18/iran-trump-allies-maga-civil-war/84257433007/",
    "timestamp": "2025-06-18T18:36:27Z"
  },
  {
    "title": "Trump flaunts authoritarian tendencies with yet another TikTok ban delay",
    "description": "The White House announced Tuesday that, for the third time, Donald Trump would not enforce a law that would ban TikTok as a national security threat unless it is sold by its Chinese owners.",
    "link": "https://biztoc.com/x/dea7d3437f817fdf",
    "timestamp": "2025-06-18T18:36:24Z"
  },
  {
    "title": "Federal Reserve holds interest rates, defying Trump’s demand to lower them",
    "description": "Hours before the decision, the president called the Fed’s chair, Jerome Powell, ‘stupid’ for anticipated rate hold\nThe US Federal Reserve kept interest rates on hold, but signaled it might make two cuts this year, as Donald Trump continues to break with prece…",
    "link": "https://biztoc.com/x/911f87216a68f26c",
    "timestamp": "2025-06-18T18:36:24Z"
  }
]