[
  {
    "title": "Iran Sentences Nobel Peace Prize Laureate To More Than 7 Years In Prison",
    "description": "Narges Mohammadi was arrested in December at a ceremony honoring Khosrow Alikordi, a 46-year-old Iranian lawyer and human rights advocate.",
    "link": "https://www.huffpost.com/entry/iran-narges-mohammadi-prison-sentence_n_69895b39e4b02d49a7780c7a",
    "timestamp": "2026-02-09T04:09:23Z"
  },
  {
    "title": "Elmo Getting Trolled by MAGA Over Bad Bunny/SBLX Love (Seriously)",
    "description": "We have a feeling that Bad Bunny could give a rat's ass what Donald Trump thought about his performance during the Super Bowl LX Apple Music Halftime Show – especially when you have the support of Elmo from Sesame Street. \"That Bunny was AMAZING. Elmo thinks …",
    "link": "https://bleedingcool.com/tv/elmo-getting-trolled-by-maga-over-bad-bunny-sblx-love-seriously/",
    "timestamp": "2026-02-09T04:08:09Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl show",
    "description": "Bad Bunny delivered a historic performance at the Levi’s Stadium in Santa Clara, California, for the 2026 Super Bowl halftime show that brought Puerto Rican culture and history to the fore",
    "link": "https://abcnews.go.com/Entertainment/wireStory/review-bad-bunny-brought-puerto-ricos-history-culture-129979091",
    "timestamp": "2026-02-09T03:57:42Z"
  },
  {
    "title": "Super Bowl LX\nBad Bunny's Super Bowl halftime show ignites Trump's fury, divides viewers",
    "description": "The Super Bowl LX halftime show featuring Latin trap artist Bad Bunny was the subject of immense criticism from Americans on Sunday night. President Donald Trump called it \"one of the worst ever.\" The Super Bowl Halftime Show is absolutely terrible, one of th…",
    "link": "https://freerepublic.com/focus/f-chat/4366049/posts",
    "timestamp": "2026-02-09T03:56:48Z"
  },
  {
    "title": "Japan's 'Iron Lady' Sanae Takaichi achieves a historic election victory",
    "description": "Japanese Prime Minister Sanae Takaichi's coalition government achieved a historic victory in Sunday's general election, a result that will pave the way for increased military spending against China and the implementation of tax cut promises that have rattled …",
    "link": "https://english.gossiplankanews.com/2026/02/japans-iron-lady-sanae-takaichi.html",
    "timestamp": "2026-02-09T03:55:22Z"
  },
  {
    "title": "Stephen Miller: The aide driving Donald Trump's most controversial policies - BBC",
    "description": "Stephen Miller: The aide driving Donald Trump's most controversial policiesBBC 'Trump's psyche': The aide driving president's most controversial policiesBBC Stephen Miller’s uses ‘gory’ images to persuade Trump in messages to presidentThe Independent How Step…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180759136",
    "timestamp": "2026-02-09T03:53:13Z"
  },
  {
    "title": "Is Netanyahu's trip to Washington a game of persuasion or an attempt at coordination?",
    "description": "Several high-level Israeli visits to the U.S. may indicate close operational and intelligence coordination between countries, but it seems the U.S. will not carry out an attack on Iran before it has exhausted diplomatic options. So how much does Israel really…",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-09/ty-article/.premium/is-netanyahus-trip-to-washington-a-game-of-persuasion-or-coordination/0000019c-3e99-dfa4-a5bc-3edba53e0000",
    "timestamp": "2026-02-09T03:50:42Z"
  },
  {
    "title": "Bad Bunny makes history at Super Bowl with Spanish performance - as Trump blasts it 'absolutely terrible'",
    "description": "The rapper performed on a heavily Puerto Rican-inspired stage set up at Levi's Stadium in California - with Trump saying 'nobody understands a word this guy is saying'.",
    "link": "https://news.sky.com/story/bad-bunny-makes-history-at-super-bowl-with-spanish-performance-as-trump-blasts-it-absolutely-terrible-13505139",
    "timestamp": "2026-02-09T03:48:00Z"
  },
  {
    "title": "Hamas leader Mashaal rejects Trump disarmament plan",
    "description": "Senior Hamas leader Khaled Mashaal rejects President Trump’s call for Hamas to disarm, vowing to defeat Israel and defending Hamas’s October 7 massacre.",
    "link": "https://www.israelnationalnews.com/news/422141",
    "timestamp": "2026-02-09T03:47:32Z"
  },
  {
    "title": "Trump criticizes Olympic skier who said representing the U.S. 'brings up mixed emotions'",
    "description": "President Donald Trump called U.S.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-criticizes-olympic-skier-hunter-hess-rcna258083",
    "timestamp": "2026-02-09T03:43:18Z"
  },
  {
    "title": "Trump Calls Bad Bunny’s Halftime Performance an “Affront to the Greatness of America”",
    "description": "Trump previously said he planned to watch Kid Rock's \"All-American Halftime Show.\"\nTrump Calls Bad Bunny’s Halftime Performance an “Affront to the Greatness of America”\nScoop Harrison",
    "link": "https://consequence.net/2026/02/trump-bad-bunny-super-bowl/",
    "timestamp": "2026-02-09T03:42:03Z"
  },
  {
    "title": "The Race Is On: Artemis, China and Musk Turn the Moon Into the Next Strategic High Ground",
    "description": "New York NY (SPX) Feb 09, 2026\n\nWhen Artemis II finally lights its engines and arcs away from Cape Canaveral, it will do more than send four astronauts on a ten-day loop around the Moon. It will fire the starting gun on a race that Washington and Beijing stil…",
    "link": "https://www.spacedaily.com/reports/The_Race_Is_On_Artemis_China_and_Musk_Turn_the_Moon_Into_the_Next_Strategic_High_Ground_999.html",
    "timestamp": "2026-02-09T03:39:35Z"
  },
  {
    "title": "India's position in Asia improves with India-US deal, positive for equities and export-oriented sectors: Report",
    "description": "The report stated that India’s external position improves compared to Asian EM peers facing higher US tariffs, boosting sentiment for Indian equities, especially in export-oriented sectors",
    "link": "https://www.thehindubusinessline.com/economy/indias-position-in-asia-improves-with-india-us-deal-positive-for-equities-and-export-oriented-sectors-report/article70609537.ece",
    "timestamp": "2026-02-09T03:36:58Z"
  },
  {
    "title": "India's position in Asia improves with India-US deal, positive for equities and export-oriented sectors: Report",
    "description": "India's external position among Asian peers improves following the interim trade framework announced between India and the United States, with exports expected to rebound and dollar inflows likely to strengthen, according to a report by JM Financial.",
    "link": "https://www.aninews.in/news/business/indias-position-in-asia-improves-with-india-us-deal-positive-for-equities-and-export-oriented-sectors-report20260209081344",
    "timestamp": "2026-02-09T03:35:41Z"
  },
  {
    "title": "Hong Kong court sentences Jimmy Lai to 20 years in jail",
    "description": "A Hong Kong court has sentenced pro-democracy media mogul Jimmy Lai to 20 years in prison following his high-profile national security trial that rights groups and Western nations have condemned as a symbol of the city's shrinking press freedoms.",
    "link": "https://www.rte.ie/news/asia/2026/0209/1557423-jimmy-lai-court/",
    "timestamp": "2026-02-09T03:33:32Z"
  },
  {
    "title": "Western leaders following Zelensky around like ‘nannies’ – Hungarian foreign minister",
    "description": "Western leaders have been acting like “nannies” to Ukraine’s Vladimir Zelensky, Hungary’s top diplomat has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632185-zelensky-european-nannies-leaders/",
    "timestamp": "2026-02-09T03:29:14Z"
  },
  {
    "title": "A Plan for Canada To Join the United States",
    "description": "While Canadian Prime Minister Mark Carney shops his country to China and Qatar, Americans should revisit an idea the Founding Fathers first proposed: welcoming Canada into the Union. Donal",
    "link": "https://www.realclearworld.com/articles/2026/02/06/a_plan_for_canada_to_join_the_united_states_1163269.html",
    "timestamp": "2026-02-09T03:26:05Z"
  },
  {
    "title": "Trump calls Bad Bunny's Super Bowl halftime show a 'slap in the face to our country'",
    "description": "Trump calls Bad Bunny's Super Bowl halftime show a 'slap in the face to our country'go.com",
    "link": "https://abcnews.go.com/US/trump-calls-bad-bunnys-super-bowl-halftime-show/story?id=129980124",
    "timestamp": "2026-02-09T03:26:01Z"
  },
  {
    "title": "Millions tune into Turning Point USA's alternate halftime show despite issue before it even began",
    "description": "Despite running into a big issue before it even started the Turning Point USA alternate Super Bowl show got millions of viewers",
    "link": "https://www.ladbible.com/news/sport/turning-point-usa-alternate-show-issue-217453-20260209",
    "timestamp": "2026-02-09T03:20:43Z"
  },
  {
    "title": "Bad Bunny's Super Bowl Halftime Show Is The Real American Dream",
    "description": "Bad Bunny put on a masterclass in Latino joy with help from Lady Gaga, Ricky Martin and more.",
    "link": "https://www.huffpost.com/entry/bad-bunny-super-bowl-halftime-show-2026_n_69827cc0e4b07fd36aea5f81",
    "timestamp": "2026-02-09T03:20:22Z"
  },
  {
    "title": "Federal judge orders Fulton County Georgia election case documents unsealed by Tuesday",
    "description": "A federal judge in Georgia ordered documents related to a Federal Bureau of Investigation raid on an election facility in Fulton County to be unsealed by Tuesday. The FBI raid that took place late last month was executed under a judicial warrant and resulted …",
    "link": "https://freerepublic.com/focus/f-news/4366044/posts",
    "timestamp": "2026-02-09T03:19:14Z"
  },
  {
    "title": "Trump’s Bad Bunny Halftime Review: ‘Absolutely Terrible’",
    "description": "Trump’s Bad Bunny halftime show review: ‘absolutely terrible.’ Trump posted a nasty response to Bad Bunny on Truth Social shortly after his Super Bowl performance. So much for watching his pal Kid Rock at the Turning Point halftime show.",
    "link": "http://nymag.com/intelligencer/article/trumps-bad-bunny-halftime-review-absolutely-terrible.html",
    "timestamp": "2026-02-09T03:17:12Z"
  },
  {
    "title": "STEVE MILLOY: Trump Already Blamed For Future Cancer From Venezuelan Oil",
    "description": "Venezuelan oil has been refined by one of the largest U.S. refineries operated by Chevron in Pascagoula, Miss. since the 1990s. That refinery may get the",
    "link": "https://dailycaller.com/2026/02/08/opinion-trump-already-blamed-for-future-cancer-from-venezuelan-oil-steve-milloy/",
    "timestamp": "2026-02-09T03:14:00Z"
  },
  {
    "title": "‘One of the worst, EVER!’ Trump torches Super Bowl Halftime Show as a ‘slap in the face’ to America",
    "description": "'Nobody understands a word this guy is saying, and the dancing is disgusting, especially for young children that are watching'",
    "link": "https://www.wnd.com/2026/02/one-worst-ever-trump-torches-super-bowl-halftime/",
    "timestamp": "2026-02-09T03:13:05Z"
  },
  {
    "title": "Of Course, Donald Trump Is Raging About Bad Bunny's Super Bowl Halftime Performance",
    "description": "He sure did react fast for someone who supposedly wasn't going to watch the show.View Entire Post ›",
    "link": "https://www.buzzfeed.com/chelseastewart/donald-trump-reacts-bad-bunny-super-bowl-halftime",
    "timestamp": "2026-02-09T03:12:39Z"
  },
  {
    "title": "'Staff kept incident hidden for 4-5 hours': Newborn baby charred to death in Kanpur hospital fire",
    "description": "A newborn girl tragically perished in a fire that erupted in the NICU of Raja Hospital in Kanpur's Bithoor area. The blaze, reportedly caused by a short circuit, engulfed the infant's bed. Hospital staff allegedly concealed the incident for hours before the d…",
    "link": "https://timesofindia.indiatimes.com/city/kanpur/staff-kept-incident-hidden-for-4-5-hours-newborn-baby-charred-to-death-in-kanpur-hospital-fire/articleshow/128094696.cms",
    "timestamp": "2026-02-09T03:11:35Z"
  },
  {
    "title": "Video: Bad Bunny Ends Spanish-Only Super Bowl Halftime with Political Immigration Message",
    "description": "The much-awaited Bad Bunny Super Bowl Halftime show closed with the Puerto Rican rapper delivering a pro-immigration political message written on a football as reaction comes in to blast the \"terrible\" show in a language most football fans \"can't understand.\"…",
    "link": "https://www.breitbart.com/entertainment/2026/02/08/video-bad-bunny-ends-spanish-only-super-bowl-halftime-with-political-immigration-message/",
    "timestamp": "2026-02-09T03:11:06Z"
  },
  {
    "title": "Truth behind couple who got married during Bad Bunny halftime show",
    "description": "Bad Bunny's halftime performance at the Super Bowl featured what people presumed was a mock wedding - but it turns out it was actually a real ceremony.",
    "link": "https://www.ladbible.com/news/sport/2026-super-bowl-bad-bunny-halftime-show-real-wedding-043275-20260209",
    "timestamp": "2026-02-09T03:11:01Z"
  },
  {
    "title": "India-US trade deal offers tariff cuts, capital goods access to reshape supply chains",
    "description": "New Delhi and Washington have established an interim trade deal framework targeting electronics, intellectual property, and supply chains. The Economic Times reports that this move aims to enhance competitiveness and improve supply chain resilience. This agre…",
    "link": "https://www.digitimes.com/news/a20260209VL208/electronics-technology-automotive.html",
    "timestamp": "2026-02-09T03:08:10Z"
  },
  {
    "title": "Trump Calls Bad Bunny's Super Bowl Halftime Show 'Disgusting'",
    "description": "It seems the president didn't agree with the Grammy winner's message of love during the 2026 Super Bowl.",
    "link": "http://www.hollywoodreporter.com/music/music-news/trump-reacts-bad-bunny-2026-super-bowl-halftime-show-1236500142/",
    "timestamp": "2026-02-09T03:08:03Z"
  },
  {
    "title": "Kid Rock Falls Flat In A Really Long Turning Point Super Bowl Halftime Show",
    "description": "The MAGA-oriented \"All-American Halftime Show\" was no match for the NFL's main event with global superstar Bad Bunny.",
    "link": "https://www.huffpost.com/entry/turning-point-super-bowl-halftime_n_698732f6e4b0dfac87443dfd",
    "timestamp": "2026-02-09T03:07:52Z"
  },
  {
    "title": "New Zealand’s Christchurch mosque killer appeals conviction",
    "description": "A white supremacist who shot and killed 51 people at two New Zealand mosques in 2019 launched an appeal Monday seeking to overturn his conviction. Brenton Tarrant, an Australian former gym instructor, admitted carrying out New Zealand’s deadliest modern-day m…",
    "link": "https://www.digitaljournal.com/world/new-zealands-christchurch-mosque-killer-appeals-conviction/article",
    "timestamp": "2026-02-09T03:07:20Z"
  },
  {
    "title": "Donald Trump Reacts to Bad Bunny's Super Bowl Halftime Show: 'Terrible'",
    "description": "Donald Trump reacted to Bad Bunny’s Super Bowl halftime show in a social media post, calling the performance “absolutely terrible.\"",
    "link": "http://www.billboard.com/music/music-news/donald-trump-reacts-bad-bunny-super-bowl-halftime-1236176183/",
    "timestamp": "2026-02-09T03:04:44Z"
  },
  {
    "title": "'One of the Worst EVER'!: Trump Blasts Bad Bunny's 'Absolutely Terrible' Super Bowl Halftime Show",
    "description": "President Donald Trump criticized the NFL’s Super Bowl LX halftime show with rapper Bad Bunny, labeling it as “absolutely terrible” and “one of the worst, EVER.” In a post on Truth Social, Trump described the halftime show as a “slap\nThe post ‘One of the Wors…",
    "link": "https://www.breitbart.com/sports/2026/02/08/one-of-the-worst-ever-trump-blasts-bad-bunnys-absolutely-terrible-super-bowl-halftime-show/",
    "timestamp": "2026-02-09T03:03:41Z"
  },
  {
    "title": "MAGA Loses It Over Bad Bunny Halftime Show: ‘Support for ICE Just Went Up’",
    "description": "Conservatives on Sunday voiced their outrage in response to Puerto Rican artist Bad Bunny's performance during the Super Bowl halftime show.\nThe post MAGA Loses It Over Bad Bunny Halftime Show: ‘Support for ICE Just Went Up’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/sports/maga-loses-it-over-bad-bunny-halftime-show-support-for-ice-just-went-up/",
    "timestamp": "2026-02-09T03:01:13Z"
  },
  {
    "title": "Trump's review of Bad Bunny's Super Bowl halftime show is in and it's safe to say he didn't like it",
    "description": "President Donald Trump called Bad Bunny's halftime show \"absolutely terrible.\"",
    "link": "https://www.businessinsider.com/trump-did-not-like-bad-bunnys-super-bowl-halftime-show-2026-2",
    "timestamp": "2026-02-09T03:00:58Z"
  },
  {
    "title": "US and India agree framework for interim trade deal to advance bilateral pact talks",
    "description": "The US and India have agreed on a framework for an interim trade agreement aimed at expanding market access and strengthening supply chains, marking a step toward a broader bilateral trade agreement launched earlier this year by President Donald Trump and Pri…",
    "link": "https://www.digitimes.com/news/a20260209VL202/technology-aircraft-market.html",
    "timestamp": "2026-02-09T02:59:46Z"
  },
  {
    "title": "Bad Bunny delivers love letter to Puerto Rico – and a message to America – with dazzling Super Bowl halftime show",
    "description": "Puerto Rican artist gave his all for the history-making halftime show in Santa Clara, from star cameos to surprise guests and a unifying message at its heart",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-super-bowl-puerto-rico-meaning-b2916401.html",
    "timestamp": "2026-02-09T02:58:21Z"
  },
  {
    "title": "Super Bowl LX: Bad Bunny's Halftime Message of Love, Hope Angers Trump",
    "description": "A Super Bowl LX Apple Music Halftime Show that was positive, energetic, and brought anyone with even a speck of rhythm to their feet to dance? Of course, Donald Trump was going to huff and puff on his version of social media about the performance, leaving a s…",
    "link": "https://bleedingcool.com/tv/super-bowl-lx-bad-bunnys-halftime-message-of-love-hope-angers-trump/",
    "timestamp": "2026-02-09T02:58:08Z"
  },
  {
    "title": "Trump Slams Bad Bunny Halftime Performance in Truth Social Rant",
    "description": "Trump shared thoughts Bad Bunny's Super Bowl LVIII halftime performance, calling it 'absolutely terrible' and 'one of the worst, EVER\"",
    "link": "https://screenrant.com/donald-trump-criticizes-bad-bunny-halftime-performance-truth-social/",
    "timestamp": "2026-02-09T02:55:09Z"
  },
  {
    "title": "Trump Got Bad Bunny’s Message — And He Didn’t Like It",
    "description": "President Donald Trump called Bad Bunny's Super Bowl halftime performance \"an affront to the Greatness of America,\" in a Truth Social post.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-bad-bunny-super-bowl-halftime-show-1235513077/",
    "timestamp": "2026-02-09T02:54:26Z"
  },
  {
    "title": "Trump slams Bad Bunny's Super Bowl halftime show as \"one of the worst ever\"",
    "description": "In the end, President Donald Trump did make an appearance at Super Bowl LX, but not inside the stadium. Instead, he showed up on his own social media platform, where he issued a le",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/09/69894b7f46163f423b8b45cd.html",
    "timestamp": "2026-02-09T02:52:09Z"
  },
  {
    "title": "Prime Minister Christopher Luxon holds post-Cabinet press conference",
    "description": "Luxon's press conference will be livesteamed from 4pm.",
    "link": "https://www.nzherald.co.nz/nz/politics/prime-minister-christopher-luxon-holds-post-cabinet-press-conference/T32FZHEFLJEYBM3DBCBXJGJICQ/",
    "timestamp": "2026-02-09T02:50:26Z"
  },
  {
    "title": "Donald Trump Is Already Melting Down Over Bad Bunny",
    "description": "It only took half an hour after the end of Bad Bunny’s Super Bowl halftime show for the president to completely crash out.",
    "link": "http://www.thecut.com/article/donald-trump-did-not-like-bad-bunny-halftime-show.html",
    "timestamp": "2026-02-09T02:47:43Z"
  },
  {
    "title": "Turning Point USA Halftime Show Recap: Here's Everything Kid Rock & More Sang",
    "description": "If you didn’t tune in for the Turning Point USA All American Halftime Show, we have a recap to fill you in on what happened. Nearly 2 million people were tuned in for the show during the countdown to it beginning and the show kicked off at around 8:11pm ET. T…",
    "link": "https://www.justjared.com/2026/02/08/turning-point-usa-halftime-show-recap-heres-everything-kid-rock-more-sang/",
    "timestamp": "2026-02-09T02:45:10Z"
  },
  {
    "title": "Bad Bunny Super Bowl halftime: Full list of songs and celebrity appearances",
    "description": "Bad Bunny’s celebrity guests at Levi’s Stadium included Pedro Pascal and Cardi B",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-super-bowl-celebrity-guests-setlist-b2916380.html",
    "timestamp": "2026-02-09T02:43:18Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl show | Chattanooga Times Free Press",
    "description": "The sun hung low when Bad Bunny emerged in Puerto Rico's sugar cane fields during his halftime show, surrounded by jíbaros in pavas (rural farmers in traditional straw hats), viejitos playing dominos (an affectionate term for older men) and a piragua stand (s…",
    "link": "https://www.timesfreepress.com/news/2026/feb/08/review-bad-bunny-brought-puerto-ricos-history-and-culture-to-a-revolutionary-super-bowl-show-tfp/",
    "timestamp": "2026-02-09T02:43:12Z"
  },
  {
    "title": "Trump Says Bad Bunny’s Mess of Halftime Show Made No Sense: ‘One of the Worst Ever’",
    "description": "\"Nobody understands a word this guy is saying, and the dancing is disgusting, especially for young children that are watching,\" the president adds\nThe post Trump Says Bad Bunny’s Mess of Halftime Show Made No Sense: ‘One of the Worst Ever’ appeared first on T…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-bad-bunny-halftime-show-spanish-super-bowl-reaction/",
    "timestamp": "2026-02-09T02:42:07Z"
  },
  {
    "title": "What does the ‘64’ on Bad Bunny’s Super Bowl 2026 halftime show outfit mean? We have some ideas",
    "description": "While the rapper's white Zara outfit seemed simple, it contained a secret message.",
    "link": "https://pagesix.com/2026/02/08/style/what-does-the-64-on-bad-bunny-super-bowl-2026-halftime-show-outfit-mean/",
    "timestamp": "2026-02-09T02:41:54Z"
  },
  {
    "title": "“Nobody understands what this guy is saying”: Trump slams Bad Bunny’s halftime performance",
    "description": "The president called the halftime show \"one of the worst ever.\"",
    "link": "https://www.salon.com/2026/02/08/nobody-understands-what-this-guy-is-saying-trump-slams-bad-bunnys-halftime-performance/",
    "timestamp": "2026-02-09T02:41:48Z"
  },
  {
    "title": "SpaceX shifts focus from Mars to Moon, Musk says",
    "description": "Washington, United States (AFP) Feb 9, 2026\n\n\n SpaceX is putting its longstanding focus of sending humans to Mars on the backburner to prioritize establishing a settlement on the Moon, founder Elon Musk said Sunday. \n\nThe South Africa-born billionaire's space…",
    "link": "https://www.spacedaily.com/reports/SpaceX_shifts_focus_from_Mars_to_Moon_Musk_says_999.html",
    "timestamp": "2026-02-09T02:40:01Z"
  },
  {
    "title": "Bad Bunny Delivered Love, Puerto Rico, and Pedro Pascal to the Super Bowl LX Halftime Show",
    "description": "The Puerto Rican singer celebrated Spanish-language music alongside Ricky Martin, Lady Gaga, Pedro Pascal, and a message for the Americas as a whole.",
    "link": "https://www.esquire.com/entertainment/music/a70281365/watch-bad-bunny-super-bowl-2026-halftime-show/",
    "timestamp": "2026-02-09T02:38:00Z"
  },
  {
    "title": "Trump defends Minneapolis federal enforcement, says crime plunged after ‘thousands of criminals’ removed",
    "description": "President Trump claims crime has dropped as much as 30% in Minneapolis after federal agents removed thousands of \"hardened criminals\" from the city.",
    "link": "https://www.foxnews.com/politics/trump-defends-minneapolis-federal-enforcement-says-crime-plunged-thousands-criminals-removed",
    "timestamp": "2026-02-09T02:37:42Z"
  },
  {
    "title": "Donald Trump rips Bad Bunny’s Super Bowl LX Halftime Show: ‘Slap in the face’",
    "description": "Donald Trump rips Bad Bunny’s Super Bowl LX Halftime Show: ‘Slap in the face’pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2026/02/donald-trump-rips-bad-bunnys-super-bowl-lx-halftime-show-slap-in-the-face.html",
    "timestamp": "2026-02-09T02:34:48Z"
  },
  {
    "title": "Trump Tears Into Bad Bunny's Halftime Show, Calls It 'One of the Worst Ever'",
    "description": "Donald Trump is unsurprisingly criticizing Bad Bunny‘s 2026 Super Bowl performance. The 79-year-old President of the United States, who just recently posted a racist video before deleting it, tore into the 31-year-old Puerto Rican superstar’s performance on S…",
    "link": "https://www.justjared.com/2026/02/08/trump-tears-into-bad-bunnys-halftime-show-calls-it-one-of-the-worst-ever/",
    "timestamp": "2026-02-09T02:34:15Z"
  },
  {
    "title": "Kid Rock Brutally Roasted for Lip Syncing Through TP USA’s ‘All-American’ Super Bowl Halftime Show: ‘More Egregious Than Ashlee Simpson’",
    "description": "Kid Rock was skewered by many people who noticed he was obviously lip syncing during Turning Point USA's \"All-American\" halftime show on Super Bowl Sunday\nThe post Kid Rock Brutally Roasted for Lip Syncing Through TP USA’s ‘All-American’ Super Bowl Halftime S…",
    "link": "https://www.mediaite.com/media/kid-rock-brutally-roasted-for-lip-syncing-through-tp-usas-all-american-super-bowl-halftime-show-more-egregious-than-ashlee-simpson/",
    "timestamp": "2026-02-09T02:33:51Z"
  },
  {
    "title": "Donald Trump Is Freaking Out Over The Bad Bunny Show On Truth Social",
    "description": "\"Nobody understands a word this guy is saying, and the dancing is disgusting,\" Trump said.",
    "link": "https://www.huffpost.com/entry/trump-bad-bunny-super-bowl-freakout_n_69892ed9e4b0959e2d925ccc",
    "timestamp": "2026-02-09T02:33:06Z"
  },
  {
    "title": "Hong Kong Sentences Jimmy Lai to 20 Years in Landmark Case",
    "description": "A Hong Kong court sentenced former media mogul Jimmy Lai to 20 years in prison, handing the pro-democracy advocate the heaviest penalty ever meted out under a Beijing-imposed national security law.",
    "link": "https://financialpost.com/pmn/business-pmn/hong-kong-sentences-jimmy-lai-to-20-years-in-landmark-case",
    "timestamp": "2026-02-09T02:32:59Z"
  },
  {
    "title": "In Japan, a charismatic leader and three challenges",
    "description": "While the Liberal Democratic Party has been battered by scandals for years, Takaichi has successfully decoupled her personal brand from the party’s baggage.",
    "link": "https://indianexpress.com/article/opinion/columns/in-japan-a-charismatic-leader-and-three-challenges-10521410/",
    "timestamp": "2026-02-09T02:32:54Z"
  },
  {
    "title": "Donald Trump Slams Bad Bunny’s Super Bowl Halftime Show as a ‘Slap in the Face to Our Country’: ‘Nobody Understands a Word This Guy Is Saying’",
    "description": "Donald Trump took to social media during the Super Bowl to criticize Bad Bunny’s halftime show. “The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER!” Trump posted on Truth Social. “It makes no sense, is an affront to the Greatness of …",
    "link": "https://variety.com/2026/music/news/donald-trump-bad-bunny-super-bowl-halftime-show-1236656328/",
    "timestamp": "2026-02-09T02:31:05Z"
  },
  {
    "title": "Jimmy Lai sentenced to 20 years in prison over Hong Kong national security case",
    "description": "Jimmy Lai, the pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, was sentenced to 20 years in prison in one of the most prominent cases prosecuted under a China-imposed national security law that has virtually silenced the city's dis…",
    "link": "https://www.cbc.ca/news/world/jimmy-lai-sentenced-hong-kong-national-security-case-9.7080352",
    "timestamp": "2026-02-09T02:25:30Z"
  },
  {
    "title": "Catholic activist Jimmy Lai sentenced to 20 years in prison in Hong Kong national security trial",
    "description": "The human rights advocate has been convicted and sentenced multiple times since 2020.",
    "link": "https://www.ewtnnews.com/world/catholic-activist-jimmy-lai-sentenced-in-hong-kong-national-security-trial",
    "timestamp": "2026-02-09T02:24:11Z"
  },
  {
    "title": "Catholic activist Jimmy Lai sentenced to 20 years in prison in Hong Kong national security trial",
    "description": "The human rights advocate has been convicted and sentenced multiple times since 2020.",
    "link": "https://www.ewtnnews.com/world/asia-pacific/catholic-activist-jimmy-lai-sentenced-in-hong-kong-national-security-trial",
    "timestamp": "2026-02-09T02:24:11Z"
  },
  {
    "title": "Hong Kong media baron and pro-democracy activist Jimmy Lai sentenced to 20 years in prison",
    "description": "Lai, who had pleaded not guilty to all charges, was among the first prominent figures arrested under Beijing's security law in August 2020.",
    "link": "https://www.cnbc.com/2026/02/09/hong-kong-media-tycoon-democracy-activist-jimmy-lai-sentenced-imprisonment.html",
    "timestamp": "2026-02-09T02:23:31Z"
  },
  {
    "title": "Donald Trump hits out at 'absolutely terrible' Super Bowl half time show in brutal statement",
    "description": "It looks like Donald Trump isn't a fan of the Super Bowl half time show as he called it 'absolutely terrible'",
    "link": "https://www.ladbible.com/news/sport/donald-trump-super-bowl-half-time-751910-20260209",
    "timestamp": "2026-02-09T02:22:19Z"
  },
  {
    "title": "Donald Trump Attacks Bad Bunny’s Super Bowl Halftime Show As A “Slap In The Face To Our Country”",
    "description": "Donald Trump ended up watching the Bad Bunny Super Bowl halftime show, after all, and to little surprise, the president hated it. Trump wrote on Truth Social, “The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER! It makes no sense, is …",
    "link": "http://deadline.com/2026/02/trump-bad-bunny-halftime-show-super-bowl-1236712740/",
    "timestamp": "2026-02-09T02:20:54Z"
  },
  {
    "title": "I Watched the Super Bowl Halftime Show So You Didn’t Have To",
    "description": "When a halftime show is dominated by music performed largely in a language most viewers don’t understand, it can cease to feel like a unifying moment and instead seem disconnected from the audience it’s intended to entertain.\nThe post I Watched the Super Bowl…",
    "link": "https://www.thegatewaypundit.com/2026/02/i-watched-super-bowl-halftime-show-so-you/",
    "timestamp": "2026-02-09T02:20:08Z"
  },
  {
    "title": "Japan’s rock star leader now has the political backing to push a bold agenda. Will she deliver?",
    "description": "Improving living standards in a country with a rapidly shrinking workforce and ageing population will test Prime Minister Sanae Takaichi’s political skills.",
    "link": "https://theconversation.com/japans-rock-star-leader-now-has-the-political-backing-to-push-a-bold-agenda-will-she-deliver-274015",
    "timestamp": "2026-02-09T02:19:57Z"
  },
  {
    "title": "Maxwell to be questioned by US Congress in Epstein probe",
    "description": "Jeffrey Epstein's accomplice Ghislaine Maxwell will be questioned behind closed doors by the US Congress, but she is expected to invoke her right to not answer questions.",
    "link": "https://www.rte.ie/news/us/2026/0209/1557421-maxwell-epstein-congress/",
    "timestamp": "2026-02-09T02:19:04Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl show",
    "description": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl showlocal10.com",
    "link": "https://www.local10.com/entertainment/2026/02/08/review-bad-bunny-brought-puerto-ricos-history-and-culture-to-a-revolutionary-super-bowl-show/",
    "timestamp": "2026-02-09T02:19:02Z"
  },
  {
    "title": "Trump Rages In Vicious Super Bowl Meltdown Trashing Bad Bunny Over Not Speaking English, ‘Disgusting’ Dance",
    "description": "Trump melted down over Bad Bunny's halftime performance, singling out the singer's Spanish-language performance and his dance.\nThe post Trump Rages In Vicious Super Bowl Meltdown Trashing Bad Bunny Over Not Speaking English, ‘Disgusting’ Dance first appeared …",
    "link": "https://www.mediaite.com/media/sports/trump-rages-in-vicious-super-bowl-meltdown-trashing-bad-bunny-over-not-speaking-english-disgusting-dance/",
    "timestamp": "2026-02-09T02:18:31Z"
  },
  {
    "title": "Kid Rock Headlines TPUSA's MAGA Halftime Show: Recap",
    "description": "Rock and fellow performers Brantley Gilbert, Lee Brice and Gabby Barrett looked to give conservatives an alternative to actual Super Bowl halftime performer Bad Bunny.",
    "link": "http://www.hollywoodreporter.com/music/music-news/kid-rock-turning-point-halftime-show-1236497694/",
    "timestamp": "2026-02-09T02:18:19Z"
  },
  {
    "title": "Epstein's Silicon Valley connections went beyond Gates and Musk",
    "description": "The new Epstein files released by the DOJ show that the deceased financier was able to build relationships across Silicon Valley, from Bill Gates to Peter Thiel.",
    "link": "https://www.cnbc.com/2026/02/09/tech-leaders-epstein-records-silicon-valley-sergey-brin-thiel-sinofsky-reid-hoffman-musk-gates.html",
    "timestamp": "2026-02-09T02:14:14Z"
  },
  {
    "title": "Jimmy Lai: Hong Kong media tycoon sentenced to 20 years in prison after landmark national security trial",
    "description": "Former Hong Kong media tycoon Jimmy Lai has been sentenced to 20 years in prison, ending a years-long legal battle that has come to define Beijing’s transformational crackdown on the once-freewheeling financial hub.",
    "link": "https://www.cnn.com/2026/02/08/china/jimmy-lai-sentenced-20-years-intl-hnk",
    "timestamp": "2026-02-09T02:13:59Z"
  },
  {
    "title": "Bad Bunny's Super Bowl halftime show ignites Trump's fury, divides viewers",
    "description": "Latin trap artist Bad Bunny performs Super Bowl halftime show almost entirely in Spanish, sparking backlash from Americans who tied the performance to immigration debates.",
    "link": "https://www.foxnews.com/sports/bad-bunnys-super-bowl-halftime-show-ignites-trumps-fury-divides-viewers",
    "timestamp": "2026-02-09T02:11:11Z"
  },
  {
    "title": "All the celebrities in Bad Bunny’s Super Bowl 2026 Halftime Show: Lady Gaga, Cardi B, more",
    "description": "The \"Monaco\" crooner performed at Levi’s Stadium in Santa Clara, Calif., on Sunday alongside stars including Alix Earle, Karol G and Pedro Pascal.",
    "link": "https://pagesix.com/2026/02/08/celebrity-news/all-the-celebrities-in-bad-bunnys-super-bowl-2026-halftime-show-lady-gaga-cardi-b-more/",
    "timestamp": "2026-02-09T02:08:31Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico’s history and culture to a revolutionary Super Bowl show",
    "description": "Review: Bad Bunny brought Puerto Rican culture to the Super Bowl halftime show in what was always going to be a landmark moment for Latinos.",
    "link": "https://www.mcall.com/2026/02/08/review-bad-bunny-brought-puerto-ricos-history-and-culture-to-a-revolutionary-super-bowl-show/",
    "timestamp": "2026-02-09T02:07:58Z"
  },
  {
    "title": "Jake Paul says he skipped Bad Bunny halftime show: ‘A fake American’",
    "description": "Controversial boxer Jake Paul rips Bad Bunny.",
    "link": "https://www.nj.com/sports/2026/02/controversial-boxer-urges-usa-to-skip-halftime-show-with-fake-american-bad-bunny.html",
    "timestamp": "2026-02-09T02:06:33Z"
  },
  {
    "title": "SpaceX aiming to build a self-growing city on Moon, shifts focus from Mars, Elon Musk says",
    "description": "SpaceX founder Elon Musk announced a shift in focus as the company will now prioritize building a self-growing city on the Moon. This move is expected to be achievable in less than ten years. Mars colonization plans are being deferred. Musk stated that travel…",
    "link": "https://economictimes.indiatimes.com/tech/technology/spacex-shifts-focus-to-build-a-self-growing-city-on-moon-shifts-focus-from-mars-elon-musk-says/articleshow/128094210.cms",
    "timestamp": "2026-02-09T02:04:08Z"
  },
  {
    "title": "SpaceX shifts focus to build a self-growing city on Moon, shifts focus from Mars, Elon Musk says",
    "description": "SpaceX founder Elon Musk announced a shift in focus as the company will now prioritize building a self-growing city on the Moon. This move is expected to be achievable in less than ten years. Mars colonization plans are being deferred. Musk stated that travel…",
    "link": "https://economictimes.indiatimes.com/news/international/business/spacex-shifts-focus-to-build-a-self-growing-city-on-moon-shifts-focus-from-mars-elon-musk-says/articleshow/128092906.cms",
    "timestamp": "2026-02-09T02:04:08Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl show",
    "description": "Bad Bunny delivered a historic performance at the Levi's Stadium in Santa Clara, California, for the 2026 Super Bowl halftime show.",
    "link": "https://www.cbsnews.com/miami/news/review-bad-bunny-brought-puerto-ricos-history-and-culture-to-a-revolutionary-super-bowl-show/",
    "timestamp": "2026-02-09T02:04:00Z"
  },
  {
    "title": "Geo-economics: Why India’s interim trade deal with the US matters more than its tariff math",
    "description": "On balance, the deal’s framework tilts a re-globalizing world in India’s favour even if it has some bits to carp about. But the pact being forged is best seen as an opportunity. It’s now for economic agents to look outwards, raise their game and focus on thei…",
    "link": "https://www.livemint.com/opinion/online-views/geoeconomics-why-india-us-interim-trade-deal-tariff-math-agriculture-exports-imports-11770559048811.html",
    "timestamp": "2026-02-09T02:01:13Z"
  },
  {
    "title": "Hong Kong media mogul Jimmy Lai faces sentencing in national security trial",
    "description": "Founder of the now-defunct Apple Daily newspaper faces possible life in prison on charges of foreign collusion.",
    "link": "https://www.aljazeera.com/news/2026/2/9/hong-kong-media-mogul-jimmy-lai-faces-sentencing-in-national-security-trial",
    "timestamp": "2026-02-09T02:01:08Z"
  },
  {
    "title": "Election officials call out Trump's latest threat: 'Trust has been absolutely destroyed'",
    "description": "A bipartisan cadre of state election officials called out the latest threat against America's elections levied by President Donald Trump's administration. Last week, Trump's FBI sent an email to state election officials in every state, saying they are expecte…",
    "link": "https://www.rawstory.com/trump-fbi-2675195814/",
    "timestamp": "2026-02-09T01:58:42Z"
  },
  {
    "title": "Trump White House Drops Bonkers AI Slop In Middle of Super Bowl",
    "description": "The White House posted an AI-filled video touting President Donald Trump's \"unapologetic\" administration during the middle of the Super Bowl on Sunday\nThe post Trump White House Drops Bonkers AI Slop In Middle of Super Bowl first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-white-house-drops-bonkers-ai-slop-in-middle-of-super-bowl/",
    "timestamp": "2026-02-09T01:57:51Z"
  },
  {
    "title": "Bad Bunny Tan Bueno In Historic Super Bowl Halftime Show With Lady Gaga, Ricky Martin & A Lot Of Latin Love – Review",
    "description": "Tan condenadamente bueno! On Saturday, Gov. Gavin Newsom declared Super Bowl Sunday to be Bad Bunny Day in California. Today, Bad Bunny himself took center field at the Super Bowl halftime show and made the day for everyone, Spanish-speaking and otherwise. As…",
    "link": "http://deadline.com/2026/02/bad-bunny-super-bowl-halftime-review-1236712621/",
    "timestamp": "2026-02-09T01:57:00Z"
  },
  {
    "title": "Iran arrests prominent reformist politicians, cites links to US, Israel",
    "description": "Detainees are accused of trying to disrupt Iran's 'political social order' at a time of threats from the US and Israel.",
    "link": "https://www.aljazeera.com/news/2026/2/9/iran-arrests-prominent-reformists-over-deadly-january-unrest",
    "timestamp": "2026-02-09T01:52:44Z"
  },
  {
    "title": "Bad Bunny Super Bowl Review: A historic halftime show",
    "description": "Bad Bunny delivered a historic performance at the Levi’s Stadium in Santa Clara, California, for the 2026 Super Bowl halftime show that brought Puerto Rican culture and history to the fore. For years Bad Bunny has been one of the most-streamed artists on the …",
    "link": "https://apnews.com/article/bad-bunny-super-bowl-2026-halftime-show-review-fbcd3dff50a4c6b0548bfa4712677eb0",
    "timestamp": "2026-02-09T01:48:18Z"
  },
  {
    "title": "Iran sentences Nobel laureate Narges Mohammadi to 7 more years in prison",
    "description": "Iran has sentenced Nobel Peace Prize winner Narges Mohammadi to over seven years in prison. This comes as the country faces a crackdown on dissent. Mohammadi began a hunger strike due to her worsening health. Meanwhile, Iran's foreign minister adopted a hard-…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/iran-sentences-nobel-laureate-narges-mohammadi-to-7-more-years-in-prison/articleshow/128092673.cms",
    "timestamp": "2026-02-09T01:46:45Z"
  },
  {
    "title": "Bad Bunny Makes History at the Super Bowl — And Brings Out Lady Gaga",
    "description": "The Puerto Rican superstar performed in Spanish, singing song like \"Baile Inolvidable\" and \"Titi Me Pregunto\"",
    "link": "http://www.rollingstone.com/music/music-news/bad-bunny-super-bowl-performance-1235513007/",
    "timestamp": "2026-02-09T01:36:40Z"
  },
  {
    "title": "Mint Quick Edit | Barrier-free entry for Harley-Davidson: A marginal but symbolic revolution",
    "description": "If Trump’s old grouse over ‘tariff king’ India’s barrier to Harley-Davidson mobikes was about rhetoric more than market reality, then their duty-free entry should overturn a larger narrative. It looks like the story of a stick turning into a lever.",
    "link": "https://www.livemint.com/opinion/online-views/mint-quick-edit-barrier-free-entry-harley-davidson-marginal-tariffs-motorbikes-11770558351357.html",
    "timestamp": "2026-02-09T01:31:13Z"
  },
  {
    "title": "Oil Drops as Easing Middle Eastern Tensions Reduce Supply Risks",
    "description": "Oil declined as tensions in the Middle East eased, reducing the near-term chance of potential interruptions to supply.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-drops-as-easing-middle-eastern-tensions-reduce-supply-risks",
    "timestamp": "2026-02-09T01:26:32Z"
  },
  {
    "title": "Trump hails Japan PM Takaichi's \"landslide victory\"; calls election win historic",
    "description": "Donald Trump congratulated Japanese Prime Minister Sanae Takaichi on a \"landslide victory\" in the general election, calling the outcome historic. He praised her leadership and endorsed her conservative agenda, highlighting the two-thirds supermajority her coa…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-hails-japan-pm-takaichis-landslide-victory-calls-election-win-historic/articleshow/128092205.cms",
    "timestamp": "2026-02-09T01:25:24Z"
  },
  {
    "title": "Takaichi Triumph: Japan’s record 56,000 Nikkei surge sends bitcoin to $72,000, gold past $5,000",
    "description": "Japanese mandate sparks surge in equities and safe havens.",
    "link": "https://www.coindesk.com/markets/2026/02/09/takaichi-triumph-japan-s-record-56-000-nikkei-surge-sends-bitcoin-to-usd72-000-gold-past-usd5-000",
    "timestamp": "2026-02-09T01:18:59Z"
  },
  {
    "title": "Kamala HQ Account Blows Up Green Day’s Anti-Trump Epstein Shot During Super Bowl",
    "description": "The recently-revived X account for former Vice President Kamala Harris reposted a video of Green Day referencing Jeffrey Epstein during a pre-Super Bowl show.\nThe post Kamala HQ Account Blows Up Green Day’s Anti-Trump Epstein Shot During Super Bowl first appe…",
    "link": "https://www.mediaite.com/politics/kamala-hq-account-blows-up-green-days-anti-trump-epstein-shot-during-super-bowl/",
    "timestamp": "2026-02-09T01:15:34Z"
  },
  {
    "title": "Unbothered Obamas Ignore Trump’s Trolling As Kamala Harris & Hakeem Jeffries Accuse White House Of ‘Cover-Up’ Over Racist Ape Video",
    "description": "Former President Barack Obama and former First Lady Michelle Obama broke their public silence for the first time since President Donald Trump faced backlash for sharing a racist, AI-generated video depicting them as apes. Yet, they made no reference to the co…",
    "link": "https://bossip.com/4354864/barack-michelle-obama-ignore-trump-ape-video-kamala-harris-hakeem-jeffries-cover-up/",
    "timestamp": "2026-02-09T01:11:28Z"
  }
]