[
  {
    "title": "Sam Altman Got What He Wanted",
    "description": "For now",
    "link": "https://www.theatlantic.com/technology/2025/12/trump-ai-executive-order/685243/",
    "timestamp": "2025-12-12T20:50:22Z"
  },
  {
    "title": "US lifts sanctions on Brazil Supreme Court justice",
    "description": "The US Treasury Department lifts sanctions on Brazilian Supreme Court Justice Alexandre de Moraes, previously imposed by the Trump administration.\n\nRead More: https://punchng.com/us-lifts-sanctions-on-brazil-supreme-court-justice/",
    "link": "https://punchng.com/us-lifts-sanctions-on-brazil-supreme-court-justice/",
    "timestamp": "2025-12-12T20:48:36Z"
  },
  {
    "title": "Kushner returns to team Trump, as ethical questions swirl",
    "description": "His only official job title at the White House is son-in-law. But Jared Kushner has staged a remarkable -- and sometimes controversial -- comeback to President Donald Trump's inner circle. Four years after Kushner left the White House, Trump has handed the hu…",
    "link": "https://japantoday.com/category/features/opinions/kushner-returns-to-team-trump-as-ethical-questions-swirl",
    "timestamp": "2025-12-12T20:48:02Z"
  },
  {
    "title": "House Democrats release new Epstein photos including Trump, Clinton, Prince Andrew",
    "description": "White House spokesperson Abigail Jackson accused Democrats of “selectively releasing\" things to \"try and create a false narrative.\"",
    "link": "https://fortune.com/2025/12/12/house-democrats-release-new-epstein-photos-including-trump-clinton-prince-andrew/",
    "timestamp": "2025-12-12T20:47:00Z"
  },
  {
    "title": "Will Trump’s $12 billion bailout solve the farm crisis?",
    "description": "Agriculture sector says it wants trade, not aid",
    "link": "https://theweek.com/politics/trumps-billion-bailout-solve-farm-crisis-agriculture-trade",
    "timestamp": "2025-12-12T20:45:12Z"
  },
  {
    "title": "Donald Trump is losing. (Garrett M. Graff/Doomsday Scenario)",
    "description": "Garrett M. Graff / Doomsday Scenario:\nDonald Trump is losing.  —  Seven conclusions as 2025 winds down. … Three items to start this morning:  — If you're in or around New York City, please join me Tuesday night at the Roosevelt House for my final book talk of…",
    "link": "https://www.memeorandum.com/251212/p91",
    "timestamp": "2025-12-12T20:45:01Z"
  },
  {
    "title": "What to Make of China’s Trade Surplus",
    "description": "The imbalance raises questions about the global economy and Trump administration policy.",
    "link": "http://foreignpolicy.com/2025/12/12/china-trade-surplus-economics-trump-policy/",
    "timestamp": "2025-12-12T20:42:50Z"
  },
  {
    "title": "Scott Pelley Says ’60 Minutes’ Has Been Free From Corporate Interference Under New Paramount Owners",
    "description": "Most of the honorees at USC Annenberg’s Walter Cronkite Awards, handed out on Friday, were recognized for holding Donald Trump’s administration to account or highlighting the challenges to American democracy. Scott Pelley of 60 Minutes, which found itself at …",
    "link": "http://deadline.com/2025/12/scott-pelley-60-minutes-cbs-paramount-interference-1236647337/",
    "timestamp": "2025-12-12T20:42:00Z"
  },
  {
    "title": "We need to be talking about Trump’s health",
    "description": "The White House is concealing the truth. Reporters need to push harder.",
    "link": "https://www.publicnotice.co/p/we-need-to-be-talking-about-trumps",
    "timestamp": "2025-12-12T20:39:54Z"
  },
  {
    "title": "Scott Pelley Says ’60 Minutes’ Has Received ‘No Corporate Interference’ On Stories Following New Ownership",
    "description": "Scott Pelley said CBS news magazine \"60 Minutes\" has not been unduly influenced by the recent corporate merger between Skydance and Paramount.\nThe post Scott Pelley Says ’60 Minutes’ Has Received ‘No Corporate Interference’ On Stories Following New Ownership …",
    "link": "https://www.mediaite.com/media/news/scott-pelley-says-60-minutes-has-received-no-corporate-interference-on-stories-following-new-ownership/",
    "timestamp": "2025-12-12T20:33:35Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Dec. 6: A West African coup fails, violence flares on the Thailand-Cambodia border, and Lithuania declares a state of emergency.",
    "link": "http://foreignpolicy.com/2025/12/12/news-quiz-west-africa-coup-thailand-cambodia-conflict-lithuania-emergency-trump-semiconductors/",
    "timestamp": "2025-12-12T20:32:48Z"
  },
  {
    "title": "Ranking Member Robert Garcia Statement After Oversight Democrats Receive 95,000 New Photos from Epstein Estate; Includes Images with Donald Trump ... (The Committee on Oversight ...)",
    "description": "The Committee on Oversight and Accountability Democrats:\nRanking Member Robert Garcia Statement After Oversight Democrats Receive 95,000 New Photos from Epstein Estate; Includes Images with Donald Trump, Bill Clinton, Steve Bannon, Bill Gates, Larry Summers  …",
    "link": "https://www.memeorandum.com/251212/p86",
    "timestamp": "2025-12-12T20:30:04Z"
  },
  {
    "title": "House Democrats release photos of Trump, Clinton and Andrew from Epstein's estate",
    "description": "WASHINGTON — House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton and the former Prince Andrew.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_bf3dd438-b14b-5bbc-b1b3-6d53b9bf3a41.html",
    "timestamp": "2025-12-12T20:30:00Z"
  },
  {
    "title": "Student and professor perspectives on Utah redistricting",
    "description": "On Nov. 11, Third District Judge Dianna Gibson adopted new congressional boundaries drawn by voting-rights group League of Women Voters (LWV) and Mormon Women for Ethical Government (MWEG), a Salt Lake City-based nonprofit. The map would create a Democratic-l…",
    "link": "https://dailyutahchronicle.com/2025/12/12/student-and-professor-perspectives-on-utah-redistricting/",
    "timestamp": "2025-12-12T20:29:59Z"
  },
  {
    "title": "As Trump signs an executive order on states’ AI policies, be sure to read the fine print",
    "description": "In recent weeks, Donald Trump has repeatedly complained about states creating their own regulations and safeguards on artificial intelligence, which the president has described as untenable.\n“I will be doing a ONE RULE Executive Order this week,” he wrote onl…",
    "link": "https://biztoc.com/x/fbbdaba6cd83b1ff",
    "timestamp": "2025-12-12T20:28:56Z"
  },
  {
    "title": "Bill Gates Blames Trump Administration for 'Lots of Deaths' Due to Global Aid Cuts",
    "description": "Bill Gates, the Microsoft co-founder reinvented himself as a creepy advocate for climate alarmism and other leftist causes, expressed concern over the projected increase in preventable child deaths, blaming them on cuts in global health funding by the Trump A…",
    "link": "https://www.breitbart.com/tech/2025/12/12/bill-gates-blames-trump-administration-for-lots-of-deaths-due-to-global-aid-cuts/",
    "timestamp": "2025-12-12T20:28:38Z"
  },
  {
    "title": "24 hours that showed the limits of Trump’s power",
    "description": "The Indiana state Senate’s vote against a new congressional map that President Donald Trump had pressured it to adopt was one of the most extraordinary examples to date of Republicans standing up to Trump.",
    "link": "https://www.cnn.com/2025/12/12/politics/power-limitations-trump-analysis",
    "timestamp": "2025-12-12T20:27:27Z"
  },
  {
    "title": "Will Trump 'pull' Italy, Austria, Poland & Hungary from EU?",
    "description": "The US recently published its new National Security Strategy. Now a leaked draft indicates that the US wants to exert its influence over four countries in Europe in particular to destabilize the European Union.",
    "link": "https://www.dw.com/en/will-trump-pull-italy-austria-poland-hungary-from-eu/a-75134777",
    "timestamp": "2025-12-12T20:26:00Z"
  },
  {
    "title": "Palantir Billionaire: Bring Back Public Executions",
    "description": "“If I’m in charge later, we won’t just have a three strikes law,” declares Palantir co-founder, multi-billionaire (net worth: $3.6 billion), and Trump supporter Joe Lonsdale. “We will quickly try and hang men after three violent crimes. And yes, …\nThe post Pa…",
    "link": "https://www.globalresearch.ca/palantir-billionaire-bring-back-public-executions/5908907",
    "timestamp": "2025-12-12T20:24:17Z"
  },
  {
    "title": "Top Disney exec reveals White House didn’t push on Kimmel suspension, says, 'We didn't hear from them'",
    "description": "Disney executive Dana Walden explained Disney's decision to suspend \"Jimmy Kimmel Live!\" was made to reduce tensions after Jimmy Kimmel's controversial Charlie Kirk comments.",
    "link": "https://www.foxnews.com/media/top-disney-exec-reveals-white-house-didnt-push-kimmel-suspension-says-we-didnt-hear-from-them",
    "timestamp": "2025-12-12T20:22:01Z"
  },
  {
    "title": "U.S. Sanctions Nicolas Maduro's 'Narco-Nephews,' Convicted in U.S. Court but Freed by Biden",
    "description": "The U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) on Thursday imposed sanctions on Efrain Antonio Campo Flores and Franqui Francisco Flores de Freitas, Venezuelan dictator Nicolás Maduro's convicted drug-trafficking nephews.\nThe po…",
    "link": "https://www.breitbart.com/national-security/2025/12/12/u-s-sanctions-nicolas-maduros-narco-nephews-convicted-in-u-s-court-but-freed-by-biden/",
    "timestamp": "2025-12-12T20:21:59Z"
  },
  {
    "title": "Scott Jennings Has Prediction For Jasmine Crockett Senate Bid: ‘It’s Very Embarrassing’",
    "description": "Scott Jennings forecast that Jasmine Crockett would win her Senate primary, but lose in the general election.",
    "link": "https://dailycaller.com/2025/12/12/scott-jennings-has-prediction-for-jasmine-crockett-senate-bid-its-very-embarrassing/",
    "timestamp": "2025-12-12T20:20:05Z"
  },
  {
    "title": "‘Scumbags’: RNC Chair’s Interviews Sparks Massive Flame War With Lib Journalists",
    "description": "The Republican National Committee (RNC) is accusing The Bulwark of publishing a piece \"lying\" about recent remarks from RNC Chairman Joe Gruters.",
    "link": "https://dailycaller.com/2025/12/12/andrew-egger-joe-gruters-rnc-midterms/",
    "timestamp": "2025-12-12T20:19:47Z"
  },
  {
    "title": "Preservation group sues White House to stop ballroom construction",
    "description": "A leading national historic preservation group is suing President Donald Trump and several other government officials, seeking to stop the construction of Trump’s planned White House ballroom. \nThe lawsuit, filed Friday in federal district court in D.C. by th…",
    "link": "https://biztoc.com/x/0b6811fbc67d2aad",
    "timestamp": "2025-12-12T20:18:03Z"
  },
  {
    "title": "Tariff revenue falls for the first time since Trump rollout",
    "description": "For the first time since President Donald Trump rolled out his sweeping global tariff program in April, month-over-month customs receipts declined in November.\nLast month, the U.S. government collected $30.75 billion in import duties. This was down from $31.3…",
    "link": "https://biztoc.com/x/54bebea0e293b068",
    "timestamp": "2025-12-12T20:17:51Z"
  },
  {
    "title": "High prices are souring the holiday cheer for most consumers, AP-NORC poll finds",
    "description": "This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains, and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC poll finds.\nThe vast majority of…",
    "link": "https://biztoc.com/x/eefbe919cc315853",
    "timestamp": "2025-12-12T20:17:39Z"
  },
  {
    "title": "Thailand and Cambodia agree to halt fighting, Trump says",
    "description": "The leaders of the two countries have not commented on Trump's announcement which follows days of hostilities.",
    "link": "https://www.bbc.com/news/articles/cd0kkyx3vvxo",
    "timestamp": "2025-12-12T20:16:53Z"
  },
  {
    "title": "Another floor-crossing bookends a transformational year in Canadian politics",
    "description": "To illustrate the incredible upheaval that federal politics has experienced over the last 12 months, one could do worse than to simply look at the last two Liberal caucus Christmas parties.",
    "link": "https://www.cbc.ca/news/politics/ma-carney-poilievre-trump-analysis-9.7013911",
    "timestamp": "2025-12-12T20:16:51Z"
  },
  {
    "title": "‘Rock star’ Newsom steals the show at DNC summit as Democrats hunt for 2028 contender to take on Trump",
    "description": "Gavin Newsom received a \"rock star reception\" at the DNC winter meeting as Democrats eye the 2028 presidential race. But will progressives warm to the California governor?",
    "link": "https://www.foxnews.com/politics/rock-star-newsom-steals-show-dnc-summit-democrats-hunt-2028-contender-take-trump",
    "timestamp": "2025-12-12T20:15:22Z"
  },
  {
    "title": "Brace Yourself for Soaring Obamacare Premiums",
    "description": "Brace yourself for soaring Obamacare premiums. After competing Democratic and GOP health-care bills went down in the Senate, it’s clear Republicans have no interest in a compromise. Costs for 24 million Americans will skyrocket on December 31.",
    "link": "http://nymag.com/intelligencer/article/brace-yourself-for-soaring-obamacare-premiums.html",
    "timestamp": "2025-12-12T20:14:32Z"
  },
  {
    "title": "Green card applicants married to U.S. citizens face new uncertainty amid arrests",
    "description": "A British mother holding an infant, a Ukrainian refugee, the wife of a Navy veteran, a German man about to celebrate his first wedding anniversary.",
    "link": "https://www.nbcnews.com/news/us-news/green-card-applicants-married-us-citizens-arrests-uncertainty-rcna247265",
    "timestamp": "2025-12-12T20:13:43Z"
  },
  {
    "title": "Nicki Minaj and Elon Musk slam Gavin Newsom for 'trans kids' comment",
    "description": "Nicki Minaj is continuing her MAGA spiral in new X posts that criticize trans children.",
    "link": "https://www.out.com/celebs/nicki-minaj-trans-kids",
    "timestamp": "2025-12-12T20:11:15Z"
  },
  {
    "title": "IRS Finds $10.6 Billion in Crimes as Agents Ramp Up Warrants",
    "description": "The Internal Revenue Service uncovered $10.6 billion in financial crimes — a nearly 16% increase from the year prior — even as it deployed agents to Trump administration law enforcement priorities far beyond their usual remit.",
    "link": "https://www.livemint.com/companies/news/irs-finds-10-6-billion-in-crimes-as-agents-ramp-up-warrants-11765570261415.html",
    "timestamp": "2025-12-12T20:11:00Z"
  },
  {
    "title": "‘Tragedy in the making’: Top healthcare exec on why insurance will spike to subsidize a tax cut to millionaires and billionaires",
    "description": "\"If the two sides could talk,\" said UConn Health chair John Driscoll, \"there probably is a way that they could agree on how to to bridge the difference.\"",
    "link": "https://fortune.com/2025/12/12/tragedy-in-the-making-aca-premiums-top-healthcare-exec-billionaires-tax-cut/",
    "timestamp": "2025-12-12T20:09:46Z"
  },
  {
    "title": "‘Tragedy in the making’: Top healthcare exec on why insurance will spike to subsidize a tax cut to millionaires and billionaires",
    "description": "\"If the two sides could talk,\" said UConn Health chair John Driscoll, \"there probably is a way that they could agree on how to to bridge the difference.\"",
    "link": "https://www.yahoo.com/news/articles/tragedy-making-top-healthcare-exec-200946858.html",
    "timestamp": "2025-12-12T20:09:46Z"
  },
  {
    "title": "FactChecking Trump’s economic speech - Roll Call",
    "description": "Factcheck.org takes a look at President Donald Trump’s Dec. 9 campaign-style economic speech in Pennsylvania.",
    "link": "https://rollcall.com/2025/12/12/factchecking-trumps-economic-speech/",
    "timestamp": "2025-12-12T20:08:57Z"
  },
  {
    "title": "What recent Democratic upset wins might mean",
    "description": "Democratic socialist Zohran Mamdani upset the political establishment by winning the mayoralty of New York City but now comes along another upset, this time in the city of Miami in deep-red Florida. Miami’s new mayor, Eileen Higgins, hailed it as “a new day” …",
    "link": "https://freethoughtblogs.com/singham/2025/12/12/what-recent-democratic-upset-wins-might-mean/",
    "timestamp": "2025-12-12T20:08:30Z"
  },
  {
    "title": "No genocide in Nigeria, Tinubu insists",
    "description": "President Bola Tinubu insists there is no genocide in Nigeria, attributing the country’s security challenges to terrorism and criminality, not religious co\n\nRead More: https://punchng.com/no-genocide-in-nigeria-tinubu-insists/",
    "link": "https://punchng.com/?p=2008542",
    "timestamp": "2025-12-12T20:08:14Z"
  },
  {
    "title": "King Charles reveals his cancer treatment will be scaled back as he credits early diagnosis",
    "description": "Britain’s King Charles III has revealed that his cancer treatment will soon be scaled back, crediting an “early diagnosis, effective intervention and adherence to doctors’ orders” for an improvement in his condition.",
    "link": "https://www.nbcnews.com/world/united-kingdom/king-charles-reveals-cancer-treatment-scaled-back-rcna248806",
    "timestamp": "2025-12-12T20:06:11Z"
  },
  {
    "title": "Trump Hosting 1980 'Miracle on Ice' Olympic Hockey Team at White House for 45th Anniversary Honors",
    "description": "President Donald Trump will host members of the U.S. Olympic men’s “Miracle on Ice” hockey team who became famous as the amateur underdogs who defeated the powerful Soviet Union squad in the 1980 games at the height of the Cold War.\nThe post Trump Hosting 198…",
    "link": "https://www.breitbart.com/sports/2025/12/12/trump-hosting-1980-miracle-on-ice-olympic-hockey-team-at-white-house-for-45th-anniversary-honors/",
    "timestamp": "2025-12-12T20:05:21Z"
  },
  {
    "title": "EXCLUSIVE DETAILS: Andrew Lownie Sues Simon & Schuster for Pulling His Explosive Prince Andrew Tell-All — After Melania Trump Threatened $1Billion Lawsuit Over Epstein Allegations",
    "description": "Andrew Lownie best-seller suggested Melania Trump was introduced to her future husband, Donald, by Jeffrey Epstein.",
    "link": "https://radaronline.com/p/andrew-lownie-sues-simon-schuster-prince-andrew-book-melania-trump-lawsuit-jeffrey-epstein/",
    "timestamp": "2025-12-12T20:02:45Z"
  },
  {
    "title": "Trump team email to Epstein: 'Pedophiles, I want you to know how important you are to me' (Alexander Willis/Raw Story)",
    "description": "Alexander Willis / Raw Story:\nTrump team email to Epstein: ‘Pedophiles, I want you to know how important you are to me’  —  An email account belonging to Jeffrey Epstein regularly received alerts from Donald Trump's 2020 campaign and, after Epstein's death, w…",
    "link": "https://www.memeorandum.com/251212/p78",
    "timestamp": "2025-12-12T20:00:04Z"
  },
  {
    "title": "Lawsuit Seeks to Stop Trump's White House Ballroom Construction",
    "description": "President Donald Trump was sued on Friday by preservationists asking a federal court to halt his White House ballroom project until it goes through multiple independent reviews and wins approval from Congress. The National Trust for Historic Preservation is a…",
    "link": "https://freerepublic.com/focus/f-news/4357122/posts",
    "timestamp": "2025-12-12T19:59:54Z"
  },
  {
    "title": "US social media travel checks add to 'continuous vetting'",
    "description": "More visitors to the US will be forced to reveal their social media handles under new plans from Donald Trump's administration. It's the latest in a number of measures aimed at tourists and residents born outside the US.",
    "link": "https://www.dw.com/en/us-social-media-travel-checks-add-to-continuous-vetting/a-75134195",
    "timestamp": "2025-12-12T19:58:00Z"
  },
  {
    "title": "For the first time since Trump’s tariff rollout, import tax revenue has fallen, threatening his lofty plans to slash the $38 trillion national debt",
    "description": "Tariff revenue fell month-over-month for the first time since President Donald Trump imposed his vast import taxes in April, fresh government data shows. \nAccording to the Treasury Department’s monthly statement released on Wednesday, the government collected…",
    "link": "https://biztoc.com/x/397530009fcfb65e",
    "timestamp": "2025-12-12T19:55:37Z"
  },
  {
    "title": "Pete Buttigieg praises Indiana GOP for standing up to Trump: ‘Absolutely extraordinary’",
    "description": "Pete Buttigieg, former mayor of South Bend, Indiana, praised the state’s Republican lawmakers on Thursday after they firmly rejected Donald Trump’s redistricting push.\nThe Indiana Senate voted 31 to 19 against adopting new maps that would favor Republicans in…",
    "link": "https://biztoc.com/x/c9b98802cf4f56a6",
    "timestamp": "2025-12-12T19:55:25Z"
  },
  {
    "title": "Senate Democrats likely to block Trump favorite Halligan (Burgess Everett/Semafor)",
    "description": "Burgess Everett / Semafor:\nSenate Democrats likely to block Trump favorite Halligan  —  Why is President Donald Trump posting about the Senate “blue slip” again?  —  Virginia's two Democratic senators are likely to block his nomination of Lindsey Halligan as …",
    "link": "https://www.memeorandum.com/251212/p76",
    "timestamp": "2025-12-12T19:55:00Z"
  },
  {
    "title": "Trump sued by preservationists seeking reviews and congressional approval for ballroom project (Bill Barrow/Associated Press)",
    "description": "Bill Barrow / Associated Press:\nTrump sued by preservationists seeking reviews and congressional approval for ballroom project  —  President Donald Trump was sued on Friday by preservationists asking a federal court to halt his White House ballroom project un…",
    "link": "https://www.memeorandum.com/251212/p75",
    "timestamp": "2025-12-12T19:55:00Z"
  },
  {
    "title": "Trump careening toward 'real-time collapse' after new Epstein bombshell: commentator",
    "description": "President Donald Trump is headed toward a “real-time collapse,” according to one political commentator, following the Friday release of a new batch of photos from the estate of Jeffrey Epstein, two of them depicting Trump with what appeared to be young women,…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674395240/",
    "timestamp": "2025-12-12T19:54:18Z"
  },
  {
    "title": "Bessent turns up heat on sprawling Minnesota fraud schemes as Treasury personnel deploy on the ground",
    "description": "Treasury Secretary Scott Bessent deploys personnel to Minnesota to investigate money services businesses involved in sprawling fraud schemes.",
    "link": "https://www.foxnews.com/politics/bessent-turns-up-heat-sprawling-minnesota-fraud-schemes-treasury-personnel-deploy-ground",
    "timestamp": "2025-12-12T19:53:49Z"
  },
  {
    "title": "The View’s Ana Navarro admits to being banned from home country Nicaragua over social media",
    "description": "She shared her thoughts about Nicaragua’s government during Friday’s episode of ‘The View’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/the-view-ana-navarro-nicaragua-b2883656.html",
    "timestamp": "2025-12-12T19:52:57Z"
  },
  {
    "title": "Judge tells notorious crypto scammer ‘you have been bitten by the crypto bug’ in handing down 15 year sentence",
    "description": "Do Kwon orchestrated a $40 billion fraud, leading to 2022 crypto crash",
    "link": "https://fortune.com/2025/12/12/judge-tells-notorious-crypto-scammer-you-have-been-bitten-by-the-crypto-bug-in-handing-down-15-year-sentence/",
    "timestamp": "2025-12-12T19:52:07Z"
  },
  {
    "title": "National park gift shops are ordered to purge bias-driven DEI and woke merchandise",
    "description": "America's national parks must review merchandise for DEI compliance by Dec. 19 under a new Trump administration order targeting diversity programs in federal agencies.",
    "link": "https://www.foxnews.com/travel/national-park-gift-shops-ordered-purge-bias-driven-dei-woke-merchandise",
    "timestamp": "2025-12-12T19:49:47Z"
  },
  {
    "title": "Why Disney’s Most Scandalous Deal Is Such a Grim Development",
    "description": "The $1 billion partnership allows users to create A.I.-generated images of the company’s iconic characters. That’s not going to end well for anyone.",
    "link": "https://slate.com/technology/2025/12/disney-openai-deal-chatgpt-artificial-intelligence.html",
    "timestamp": "2025-12-12T19:49:36Z"
  },
  {
    "title": "Fox News AI Newsletter: Hegseth moves to revolutionize American warfighting",
    "description": "The Fox News AI Newsletter gives readers the latest AI technology advancements, covering the challenges and opportunities AI presents.",
    "link": "https://www.foxnews.com/tech/ai-newsletter-hegseth-moves-revolutionize-american-warfighting",
    "timestamp": "2025-12-12T19:49:07Z"
  },
  {
    "title": "Trump's horrifying remarks laid bare his darkest instincts",
    "description": "As the 250th anniversary of the Declaration of Independence nears, President Donald Trump’s escalating attacks on immigrants of color have made his administration the most globally racist, hostile administration for non-white immigrants in U.S. history, on to…",
    "link": "https://www.rawstory.com/trump-racism-2674392231/",
    "timestamp": "2025-12-12T19:47:38Z"
  },
  {
    "title": "Trump hit with demand to 'immediately halt' glitzy ballroom makeover",
    "description": "President Donald Trump has given a significant amount of attention during his second term to the construction of a massive ballroom at the White House, but now, per a report from NBC News, a new lawsuit might see the project \"immediately halted.\"To make way f…",
    "link": "https://www.rawstory.com/alternet-posts/trump-ballroom-construction/",
    "timestamp": "2025-12-12T19:46:30Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.koco.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:45:45Z"
  },
  {
    "title": "You'll Never Believe Who Tim Walz Chose to Attack Over Questions on Somali Scandal - Another Racial Group",
    "description": "In response to a question on Somalis holding themselves accountable, Walz said there are many white people who have committed crime.",
    "link": "https://www.westernjournal.com/never-believe-tim-walz-chose-attack-questions-somali-scandal-another-racial-group/",
    "timestamp": "2025-12-12T19:45:43Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wisn.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:44:58Z"
  },
  {
    "title": "For the first time since Trump’s tariff rollout, import tax revenue has fallen, threatening his lofty plans to slash the $38 trillion national debt",
    "description": "Earlier this month, Trump called the country’s mounting debt \"peanuts\" compared to the money he was bringing in from custom duties.",
    "link": "https://fortune.com/2025/12/12/tariff-revenues-decrease-trump-plans-pay-off-national-debt/",
    "timestamp": "2025-12-12T19:44:53Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.ketv.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:44:30Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wgal.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:44:30Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wlwt.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:44:21Z"
  },
  {
    "title": "Trump’s AI order may be ‘illegal,’ Democrats and consumer advocacy groups claim",
    "description": "President Donald Trump and his tech allies say that his new executive order to establish a national framework for artificial intelligence regulation will give the U.S. an edge over China in the AI war and pave the way for innovation.\nBut Democratic lawmakers …",
    "link": "https://biztoc.com/x/f129e0788da30951",
    "timestamp": "2025-12-12T19:44:13Z"
  },
  {
    "title": "Tim Walz Pivots To Attacking White Men When Asked If Somalis Will Be Held Accountable For Fraud",
    "description": "Democratic Minnesota Gov. Tim Walz started criticizing white men on Friday in response to whether Somalis will be held accountable for the fraud scandal.",
    "link": "https://dailycaller.com/2025/12/12/tim-walz-white-men-somali-fraud/",
    "timestamp": "2025-12-12T19:43:54Z"
  },
  {
    "title": "Royal Family Nightmare: Ex-Prince Andrew Spotted With Bill Gates in Explosive New Epstein Photos — After King Charles Stripped His Title",
    "description": "The former royal was pictured with the Microsoft founder in photos released the same day as Andrew attended his granddaughter's baptism.",
    "link": "https://radaronline.com/p/prince-andrew-epstein-photos-release-bill-gates/",
    "timestamp": "2025-12-12T19:40:00Z"
  },
  {
    "title": "The Nvidia Chip Deal Is a National Security Disaster Waiting to Happen",
    "description": "Trump’s latest proposal would cede the United States’ AI advantage.",
    "link": "http://foreignpolicy.com/2025/12/12/nvidia-chips-national-security-trump-united-states-china-ai/",
    "timestamp": "2025-12-12T19:38:27Z"
  },
  {
    "title": "Tesla US sales drop to nearly 4-year low in November despite launch of cheaper versions",
    "description": "Making a success of the more affordable variants, called Standard, is important for Tesla and a test of its strategy for how to keep selling cars and bring in revenue as it transitions to making robotaxis and building humanoid robots, which are the core reaso…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/tesla-us-sales-drop-to-nearly-4-year-low-in-november-despite-launch-of-cheaper-versions/articleshow/125939911.cms",
    "timestamp": "2025-12-12T19:37:07Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wmtw.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:36:33Z"
  },
  {
    "title": "More photos from Epstein estate show Trump, Clinton and former Prince Andrew",
    "description": "The photos, which do not imply wrongdoing, are part of a trove of images the House Oversight Committee received from Epstein's estate.",
    "link": "https://www.bbc.com/news/articles/crk777lj763o",
    "timestamp": "2025-12-12T19:36:03Z"
  },
  {
    "title": "'Who would have imagined?' Ex-GOP governor in awe as defiant GOP sends Trump clear message",
    "description": "President Donald Trump got a clear message from defiant members of his own party this week.After growing pressure from the president, GOP lawmakers twice on Thursday stood up against Trump and his administration, The Washington Post reported. Trump spent mont…",
    "link": "https://www.rawstory.com/republicans-defy-donald-trump/",
    "timestamp": "2025-12-12T19:35:48Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wbaltv.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:35:25Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wtae.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:35:20Z"
  },
  {
    "title": "Trump sued by preservationists over ballroom project",
    "description": "President Trump has been sued by preservationists seeking an architecture review and congressional approval over his White House ballroom project",
    "link": "https://www.wlky.com/article/trump-white-house-ballroom-lawsuit/69712713",
    "timestamp": "2025-12-12T19:35:15Z"
  },
  {
    "title": "Democrats release Epstein photos showing Trump, Bill Clinton, Woody Allen and ex-prince Andrew",
    "description": "The White House accused Democrats of releasing “cherry-picked” photos from the Epstein estate “to try and create a false narrative.”",
    "link": "https://www.thejournal.ie/democrats-release-photos-jeffrey-epstein-donald-trump-bill-clinton-6902480-Dec2025/",
    "timestamp": "2025-12-12T19:34:00Z"
  },
  {
    "title": "Trump aims to reform federal cannabis law",
    "description": "President Donald Trump has voiced support for reclassifying cannabis and making it a legally obtainable drug -- possibly as soon as next week.",
    "link": "https://www.upi.com/Top_News/US/2025/12/12/cannabis-rescheduling/7591765567007/",
    "timestamp": "2025-12-12T19:33:54Z"
  },
  {
    "title": "Thomas Massie Thinks FBI Arrested Wrong Guy For Pipe Bombs",
    "description": "House Republicans are unsatisfied with the recent arrest of a Virginia man who allegedly built and placed the devices.",
    "link": "https://www.huffpost.com/entry/jan-6-pipe-bomb-arrest-conspiracy-theories_n_693c5efee4b018dc36f19002",
    "timestamp": "2025-12-12T19:33:48Z"
  },
  {
    "title": "Trump’s AI order may be ‘illegal,’ Democrats and consumer advocacy groups claim",
    "description": "President Donald Trump executive order on a national artificial intelligence framework threatens funding for states that pursue AI laws deemed \"onerous.\"",
    "link": "https://www.cnbc.com/2025/12/12/trumps-ai-order-democrats-consumers.html",
    "timestamp": "2025-12-12T19:33:42Z"
  },
  {
    "title": "Thailand, Cambodian leaders agree to renew truce after days of deadly clashes, Trump says",
    "description": "Trump announced the agreement to restart the ceasefire in a social media posting following calls with Thai Prime Minister Anutin Charnvirakul and Cambodian Prime Minister Hun Manet.",
    "link": "https://nypost.com/2025/12/12/world-news/thailand-cambodian-leaders-agree-to-renew-truce-after-days-of-deadly-clashes-trump-says/",
    "timestamp": "2025-12-12T19:33:24Z"
  },
  {
    "title": "'Playing make-believe': Analysis tears into White House's 'demonstrably ridiculous' claims",
    "description": "Lisandra Vazquez, an Atlanta-based comedian, has gone viral with her frequent parodies of White House Press Secretary Karoline Leavitt — who sees the MAGA Republican as a caricature of herself and mocks her relentlessly with her videos on YouTube and TikTok. …",
    "link": "https://www.rawstory.com/alternet-posts/steve-benen-karoline-leavitt/",
    "timestamp": "2025-12-12T19:33:20Z"
  },
  {
    "title": "Declining tariff revenue creates a significant new headache for the White House",
    "description": "When Donald Trump spoke to U.S. generals and admirals in September, the president appeared eager to brag about his trade tariffs. “We’ve taken in trillions of dollars,” he boasted. “We’re rich again.”\nHe continued to echo that refrain in the weeks and months …",
    "link": "https://biztoc.com/x/27f356443f1f4501",
    "timestamp": "2025-12-12T19:33:06Z"
  },
  {
    "title": "What’s at stake in Trump’s executive order aiming to curb state-level AI regulation",
    "description": "In the absence of comprehensive federal AI regulation, states have stepped in. The Trump administration, at Big Tech’s urging, is attempting to roll back many of those laws.",
    "link": "https://theconversation.com/whats-at-stake-in-trumps-executive-order-aiming-to-curb-state-level-ai-regulation-266668",
    "timestamp": "2025-12-12T19:32:15Z"
  },
  {
    "title": "Donald Trump’s $100,000 H-1B visa fee draws legal challenge from California, other states",
    "description": "The lawsuit will be at least the third to challenge the fee announced by Trump in September, which dramatically raises the cost of obtaining H-1B visas.",
    "link": "https://indianexpress.com/article/world/donald-trumps-100000-h-1b-visa-fee-draws-legal-challenge-from-california-10417576/",
    "timestamp": "2025-12-12T19:31:07Z"
  },
  {
    "title": "Russian police and National Guard will stay in Ukraine’s Donbas postwar, a Kremlin official says",
    "description": "Ukraine is likely to reject such a stance as U.S.-led negotiations drag on.",
    "link": "https://www.bostonherald.com/2025/12/12/russia-ukraine-war-donbas/",
    "timestamp": "2025-12-12T19:31:07Z"
  },
  {
    "title": "Trump Advice for Families Struggling This Christmas: Your Kids Are Bad So Maybe They Don't Deserve Presents",
    "description": "WASHINGTON, D.C. — President Donald Trump has just one message for American families struggling economically this Christmas: &#34;Your kids are bad, so maybe they don't deserve presidents.&#34;",
    "link": "https://babylonbee.com/news/trump-advice-for-families-struggling-this-christmas-your-kids-are-bad-so-maybe-they-dont-deserve-presents",
    "timestamp": "2025-12-12T19:30:55Z"
  },
  {
    "title": "Soccer Still Has Some Explaining to Do",
    "description": "Re-read today, Franklin Foer’s 2004 classic inadvertently suggests where globalization went wrong.",
    "link": "http://foreignpolicy.com/2025/12/12/franklin-foer-how-soccer-explains-the-world-globalization-capitalism-fifa-world-cup/",
    "timestamp": "2025-12-12T19:30:42Z"
  },
  {
    "title": "This holiday season isn't very merry for consumers, an AP-NORC poll finds",
    "description": "WASHINGTON — This holiday season isn't quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC…",
    "link": "https://richmond.com/news/nation-world/government-politics/article_a9eaea6b-a40e-5d83-b0b2-b5ed638421e2.html",
    "timestamp": "2025-12-12T19:30:00Z"
  },
  {
    "title": "Rural Health Providers Hit by $100K Trump Visa Fee",
    "description": "Get our weekly newsletter, The Week in Brief, featuring a roundup of our original coverage, Fridays at 2 p.m. ET.",
    "link": "https://kffhealthnews.org/news/article/the-week-in-brief-rural-health-h1b-visa-fee/",
    "timestamp": "2025-12-12T19:30:00Z"
  },
  {
    "title": "Justice Department Sues Fulton County, Georgia, In Effort to Prove that Trump Won in 2020, Not Biden",
    "description": "The Trump vengeance and retribution campaign seems unlikely to end. The Department of Justice sued Fulton County, Georgia, for access to its 2020 votes. Trump wants to prove that the election was rigged, despite numerous investigations that concluded it was f…",
    "link": "https://dianeravitch.net/2025/12/12/justice-department-sues-fulton-county-georgia-in-effort-to-prove-that-trump-won-in-2020-not-biden/",
    "timestamp": "2025-12-12T19:30:00Z"
  },
  {
    "title": "Russian presence in Donbas even after truce: Kremlin",
    "description": "Moscow will give its blessing to a ceasefire only after Ukraine's forces have withdrawn from the front line, Kremlin adviser Yuri Ushakov said in comments published Friday in Russian business daily Kommersant.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russian-presence-in-donbas-even-after-truce-kremlin/articleshow/125939825.cms",
    "timestamp": "2025-12-12T19:29:23Z"
  },
  {
    "title": "Rise of the Mamdani Clones",
    "description": "After the 2024 humiliation, the left is back. It could hurt the party in 2026. Kim Strassel speaks with law professor Jonathan Turley about why the charges were dismissed against James Comey and Letitia James and how Donald Trump is separately using the legal…",
    "link": "https://freerepublic.com/focus/f-news/4357117/posts",
    "timestamp": "2025-12-12T19:29:22Z"
  },
  {
    "title": "‘Knee pads are in the mail’: Republican gov mocked after backing failed Trump ploy",
    "description": "President Donald Trump’s push for Indiana Republican state lawmakers to redraw the state’s congressional districts failed spectacularly\r\n on Thursday after the majority of GOP state senators rejected the proposal, leading Indiana Gov. Mike Braun to voice his …",
    "link": "https://www.rawstory.com/indiana-2674395606/",
    "timestamp": "2025-12-12T19:29:08Z"
  },
  {
    "title": "The 21 Republicans Who Just Crushed Trump’s Big Plan",
    "description": "The humiliating rejection for Trump came after he put the full weight of the White House and Republican Party apparatus to bear on the state Senate.",
    "link": "https://www.huffpost.com/entry/indiana-redistricting-gop-senators_n_693c5864e4b07bcd2543c687",
    "timestamp": "2025-12-12T19:26:42Z"
  }
]