[
  {
    "title": "U.S. hits Canada lumber with 34% duties even before tariffs",
    "description": "The United States is poised to more than double duties on Canadian softwood lumber to 34.45 per cent, putting more pressure on U.S. materials costs even before President Donald Trump places any new tariffs on the sector.\nThe U.S. currently levies countervaili…",
    "link": "https://biztoc.com/x/e5cf2d5994e00788",
    "timestamp": "2025-04-07T17:27:25Z"
  },
  {
    "title": "Bitcoin, stocks crumble after ‘90 day tariff pause’ deemed fake news — BTC whales keep accumulating",
    "description": "Global financial markets continued to tumble on April 7, as US equities dropped more than 3%, wiping more than $2 trillion in value on market open. The pullback saw the S&P 500 drop 2.79%, with the index officially entering a bear market, following a 20% decl…",
    "link": "https://cointelegraph.com/news/bitcoin-stocks-crumble-after-90-day-tariff-pause-deemed-fake-news-btc-whales-keep-accumulating",
    "timestamp": "2025-04-07T17:27:01Z"
  },
  {
    "title": "Trump Defiant on Tariffs, Rejects Recession Fears",
    "description": "President Donald Trump and his economic team dismissed investors’ fears of inflation and recession, offering no apologies for the market turmoil sparked by sweeping global tariffs and defiantly insisting a boom is on the horizon.\nTrump, speaking Sunday on Air…",
    "link": "https://biztoc.com/x/362613b2e2d0036a",
    "timestamp": "2025-04-07T17:26:58Z"
  },
  {
    "title": "Nicaragua Withdraws from ICJ 'Genocide' Case Against Israel, Claiming It's Too Expensive",
    "description": "Nicaragua's communist regime announced over the weekend that it withdrew from South Africa’s \"genocide\" case against Israel at the International Court of Justice (ICJ) due to its \"high financial cost.\"\nThe post Nicaragua Withdraws from ICJ ‘Genocide’ Case Aga…",
    "link": "https://www.breitbart.com/latin-america/2025/04/07/nicaragua-withdraws-from-icj-genocide-case-against-israel-claiming-its-too-expensive/",
    "timestamp": "2025-04-07T17:25:53Z"
  },
  {
    "title": "'SNL' Roasts Morgan Wallen Over Show Exit",
    "description": "The comedy show took aim at the country singer in two separate sketches on Saturday night.",
    "link": "https://www.huffpost.com/entry/saturday-night-live-morgan-wallen_n_67f3e6f5e4b0d28cb3c87e1d",
    "timestamp": "2025-04-07T17:25:33Z"
  },
  {
    "title": "Trump Hits New Levels of Insanity With Fresh China Tariffs",
    "description": "Donald Trump threatened Monday to escalate his trade war with China by ratcheting up tariffs on exports to a staggering 104 percent.\r\nIn a post on Truth Social, Trump threatened to impose an additional 50 percent tariff on China if it did not rescind the reta…",
    "link": "https://newrepublic.com/post/193686/donald-trump-new-china-tariffs",
    "timestamp": "2025-04-07T17:23:32Z"
  },
  {
    "title": "3 tips to prepare in case of a recession",
    "description": "President Donald Trump admits a recession is possible amid his newly imposed tariffs",
    "link": "https://theweek.com/personal-finance/tips-to-prepare-for-recession",
    "timestamp": "2025-04-07T17:22:18Z"
  },
  {
    "title": "Bitcoin forfeits 5% to tariffs chaos",
    "description": "Donald Trump’s trade-war fallout has lobbed about $4,553, or 5.5%, off the price of Bitcoin so far, as markets swing aggressively and billionaires call on the president to pause his tariffs.Read more...",
    "link": "https://qz.com/bitcoin-ether-down-tariffs-1851775076",
    "timestamp": "2025-04-07T17:22:00Z"
  },
  {
    "title": "Print Media to Mass Protests: “Please Turn to Page 18”",
    "description": "On Saturday, April 5, hundreds of thousands of Americans took to the streets across the nation to protest the harmful policies of Donald Trump’s second term. The “Hands Off!” demonstrations represented what organizers called “the largest single day of protest…",
    "link": "https://newrepublic.com/article/193683/print-media-downplay-mass-protests",
    "timestamp": "2025-04-07T17:20:52Z"
  },
  {
    "title": "Kathy Griffin Reveals She Had a Hysterectomy",
    "description": "Kathy Griffin is recovering after a recent surgery. On Monday (April 7), the 64-year-old comedian revealed that she had a hysterectomy last week while also sharing a funny anecdote about her “nurse,” who was seemingly a Donald Trump supporter. “Happy Monday! …",
    "link": "https://www.justjared.com/2025/04/07/kathy-griffin-reveals-she-had-a-hysterectomy/",
    "timestamp": "2025-04-07T17:20:19Z"
  },
  {
    "title": "Press conference between Netanyahu and Trump canceled",
    "description": "A press meeting between Prime Minister Benjamin Netanyahu and US President Donald Trump that was scheduled for",
    "link": "https://www.jpost.com/breaking-news/article-849248",
    "timestamp": "2025-04-07T17:18:07Z"
  },
  {
    "title": "Black Monday to the COVID crash: Worst days in the history of the US stock market",
    "description": "Black Monday to the COVID crash: Worst days in the history of the US stock marketgo.com",
    "link": "https://abcnews.go.com/Business/black-monday-covid-crash-worst-days-history-us/story?id=120559417",
    "timestamp": "2025-04-07T17:16:17Z"
  },
  {
    "title": "Trump says China would approve TikTok deal in '15 minutes' if he cut tariffs",
    "description": "President Donald Trump said China would approve a deal to sell TikTok to an American buyer \"in 15 minutes\" if he \"gave a little cut in tariffs.\" \nTrump made the remark on Air Force One following a report from Reuters that the U.S. was close to making a deal w…",
    "link": "https://biztoc.com/x/44cf95ce5a425e1d",
    "timestamp": "2025-04-07T17:16:11Z"
  },
  {
    "title": "Oil Boss Says Trump Administration Better Have a Plan Amid Rout",
    "description": "A top executive at Diamondback Energy Inc. called on President Donald Trump’s administration to explain how the global trade war will help shale producers, a rare instance of public pushback from a US oil boss.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-boss-says-trump-administration-better-have-a-plan-amid-rout",
    "timestamp": "2025-04-07T17:15:58Z"
  },
  {
    "title": "How Trump Tariffs Shock Compares to Worst Stock Market Crashes in History",
    "description": "Last week's tariff announcements dragged U.S. stocks lower, marking one of the most severe weeks for Wall Street in recent memory.\nStill, even with the tariff tensions, concerns over retaliation from U.S. trading partners and ongoing recession fears leading u…",
    "link": "https://biztoc.com/x/09b35c628f138075",
    "timestamp": "2025-04-07T17:15:58Z"
  },
  {
    "title": "What is China winning from Trump's trade war?",
    "description": "There are a lot of losers in the global trade war that President Donald Trump declared last week. But there is also potentially a big winner: China.\nAmerica's new tariff policy \"could end up making China great again,\" said The Economist. The fallout from Trum…",
    "link": "https://biztoc.com/x/ed560d8f33acff63",
    "timestamp": "2025-04-07T17:15:42Z"
  },
  {
    "title": "List of Stores Being Boycotted in 2025 as Walmart 'Blackout' Begins",
    "description": "Walmart is just one of many large retailers being economically targeted by the working class between now and this summer.",
    "link": "https://www.newsweek.com/boycott-blackout-walmart-amazon-target-mcdonalds-2056368",
    "timestamp": "2025-04-07T17:15:27Z"
  },
  {
    "title": "Tesla Justice? Owner Delivers Karma to Swastika-Scratching Leftist—and It’s Worse Than Jail",
    "description": "Dallas, TX – A Texas Tesla owner is delivering a dose of financial karma to the man who allegedly vandalized his Model X, and conservatives are calling it a masterstroke of justice that might just hit harder than jail time. Jeff Nguyen, whose vehicle was keye…",
    "link": "https://freerepublic.com/focus/f-bloggers/4309454/posts",
    "timestamp": "2025-04-07T17:15:03Z"
  },
  {
    "title": "This is the stock market's worst start to a presidential term in modern history (CNN)",
    "description": "CNN:\nThis is the stock market's worst start to a presidential term in modern history  —  New York CNN —  President Donald Trump warned Americans in 2024 that a vote for Vice President Kamala Harris would be a vote for a market meltdown.  —  “You want to see a…",
    "link": "https://www.memeorandum.com/250407/p81",
    "timestamp": "2025-04-07T17:15:00Z"
  },
  {
    "title": "No more cheap skirts: Trump ends tax exemption for low-value Chinese imports",
    "description": "An executive order he signed will eliminate the “de minimis provision” for goods from China and Hong Kong on May 2. Here's what that means.",
    "link": "https://roanoke.com/news/nation-world/business/article_504c176c-742b-58be-8b1e-1ed9f5eafdef.html",
    "timestamp": "2025-04-07T17:15:00Z"
  },
  {
    "title": "Trump Berates Voters Who Worry About Economic Impact Of Tariffs",
    "description": "\"Don’t be weak! Don’t be stupid! Don’t be a PANICAN (A new party based on weak and stupid people!)\"",
    "link": "https://littlethings.com/entertainment/trump-berates-voters-who-are-worried-about-economic-repercussions-from-tariffs",
    "timestamp": "2025-04-07T17:14:03Z"
  },
  {
    "title": "What is China winning from Trump's trade war?",
    "description": "Beijing offers 'trauma bonding' to America's jilted trade partners",
    "link": "https://theweek.com/politics/china-winning-trump-trade-war",
    "timestamp": "2025-04-07T17:13:18Z"
  },
  {
    "title": "Trump Hits Tiny African Nation Of Lesotho With Highest Tariff Rate. Here's Why - Times Now",
    "description": "Trump Hits Tiny African Nation Of Lesotho With Highest Tariff Rate. Here's WhyTimes Now How tiny Lesotho ended up with the highest US tariffs in the worldAP News 'Shocking': Trump hits Lesotho, Levi's and Calvin Klein denim exporter, with 50% tariffUSA Today …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176955873",
    "timestamp": "2025-04-07T17:13:07Z"
  },
  {
    "title": "‘Hang tough’: Trump placates Americans as stock market continues to drop",
    "description": "‘Sometimes you have to take medicine to fix something’",
    "link": "https://www.wnd.com/2025/04/hang-tough-trump-placates-americans-as-stock-market-continues-to-drop/",
    "timestamp": "2025-04-07T17:13:05Z"
  },
  {
    "title": "News conference between Trump and Netanyahu in Washington DC cancelled",
    "description": "A news conference between Donald Trump and Israeli Prime Minister Benjamin Netanyahu due to take place this evening has been cancelled, the White House has said.",
    "link": "https://news.sky.com/story/news-conference-between-trump-and-netanyahu-in-washington-dc-cancelled-13344027",
    "timestamp": "2025-04-07T17:13:00Z"
  },
  {
    "title": "Chile regulator: copper prices have likely peaked as U.S.-China trade war looms",
    "description": "Chile's state copper commission Cochilco on Monday said that prices for the red metal have likely already peaked this year amid an escalating trade war, as...",
    "link": "https://finance.yahoo.com/news/chile-regulator-copper-prices-likely-171244848.html",
    "timestamp": "2025-04-07T17:12:44Z"
  },
  {
    "title": "How Trump Tariffs Shock Compares to Worst Stock Market Crashes in History",
    "description": "The continued tariff-driven decline in U.S. equities may rival some of the most significant market crashes in American history.",
    "link": "https://www.newsweek.com/how-trump-tariff-shock-compares-great-depression-2056411",
    "timestamp": "2025-04-07T17:12:35Z"
  },
  {
    "title": "‘Bloodbath’: Spooked Republicans warn Trump over US tariffs",
    "description": "With markets nosediving over Donald Trump’s trade war, the protectionist US president is hearing the first rumblings of discontent among his normally steadfast backers in Congress and big business. The Republican leader has roiled Wall Street and the global e…",
    "link": "https://www.digitaljournal.com/?p=3781771",
    "timestamp": "2025-04-07T17:12:33Z"
  },
  {
    "title": "‘Bloodbath’: Spooked Republicans warn Trump over US tariffs",
    "description": "With markets nosediving over Donald Trump’s trade war, the protectionist US president is hearing the first rumblings of discontent among his normally steadfast backers in Congress and big business. The Republican leader has roiled Wall Street and the global e…",
    "link": "https://www.digitaljournal.com/world/bloodbath-spooked-republicans-warn-trump-over-us-tariffs/article",
    "timestamp": "2025-04-07T17:12:33Z"
  },
  {
    "title": "'Bloodbath': Spooked Republicans Warn Trump Over US Tariffs",
    "description": "With markets nosediving over Donald Trump's trade war, the protectionist US president is hearing the first rumblings of discontent among his normally steadfast backers in Congress and big business.",
    "link": "https://www.ibtimes.com/bloodbath-spooked-republicans-warn-trump-over-us-tariffs-3769109",
    "timestamp": "2025-04-07T17:12:21Z"
  },
  {
    "title": "Could the iPhone Double in Price With Trump's Extra 50% Tariff on China?",
    "description": "Trump responds to China's tariffs with even more. But experts say don't panic-buy if it puts you in debt.",
    "link": "https://www.cnet.com/personal-finance/banking/could-the-iphone-double-in-price-with-trumps-extra-50-tariff-on-china/",
    "timestamp": "2025-04-07T17:12:00Z"
  },
  {
    "title": "Oil slumps to $60 a gallon — lowest price since 2021 — as recession fears mount",
    "description": "Oil benchmarks hit their lowest levels since 2021 as investors worried the inflationary risks of tariffs and OPEC's recent surprise supply hike could cause a surplus.",
    "link": "https://nypost.com/2025/04/07/business/oil-slumps-to-60-a-gallon-as-recession-fears-mount/",
    "timestamp": "2025-04-07T17:11:50Z"
  },
  {
    "title": "MAGA billionaires balk at Donald Trump's tariff gambit, warn of 'economic nuclear winter'",
    "description": "International Business News: TOI correspondent from Washington: Prominent Trump acolytes and business leaders are jumping of the MAGA tariff train as the US President's gambit -- .",
    "link": "https://timesofindia.indiatimes.com/business/international-business/maga-billionaires-balk-at-donald-trumps-tariff-gambit-warn-of-economic-nuclear-winter/articleshow/120071896.cms",
    "timestamp": "2025-04-07T17:11:49Z"
  },
  {
    "title": "Some financial executives who backed Trump confront buyers’ remorse",
    "description": "The more Donald Trump’s Wall Street backers recoil in reaction to the agenda they helped advance, the easier it is to wonder what they expected to happen.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/financial-executives-backed-trump-confront-buyers-remorse-rcna200046",
    "timestamp": "2025-04-07T17:11:40Z"
  },
  {
    "title": "Trump Shows Support For LGBTQ Community By Hosting Dodgers At White House",
    "description": "WASHINGTON, D.C. — In a move political analysts say was an olive branch to the LGBTQ community, President Donald Trump hosted the Los Angeles Dodgers at the White House.",
    "link": "https://babylonbee.com/news/trump-shows-support-for-lgbtq-community-by-hosting-dodgers-at-white-house",
    "timestamp": "2025-04-07T17:10:35Z"
  },
  {
    "title": "CEOs think the U.S. is 'probably in a recession right now,' says BlackRock's Larry Fink",
    "description": "The asset management executive also said that the he thinks the tariffs of President Donald Trump could put upward pressure on inflation.",
    "link": "https://www.cnbc.com/2025/04/07/ceos-think-the-us-is-probably-in-a-recession-right-now-says-blackrocks-larry-fink.html",
    "timestamp": "2025-04-07T17:10:34Z"
  },
  {
    "title": "JOHNSTON: Trump’s War Against Corrupt Elite Represents Much-Needed Return To American Exceptionalism",
    "description": "President Trump announced a baseline 10% tariff on all U.S. imports while imposing steeper reciprocal levies on goods from other nations, including traditional geopolitical allies in Europe and Japan.",
    "link": "https://dailycaller.com/2025/04/07/adam-johnston-trumps-trade-war-american-markets/",
    "timestamp": "2025-04-07T17:10:16Z"
  },
  {
    "title": "Ukrainian city mourns victims of Russian missile strike",
    "description": "Delegation will travel to Washington  for negotiations on minerals deal",
    "link": "https://www.irishtimes.com/world/europe/2025/04/07/ukrainian-city-mourns-victims-of-russian-missile-strike/",
    "timestamp": "2025-04-07T17:07:56Z"
  },
  {
    "title": "Trump threatens additional tariffs on China, terminates talks",
    "description": "WASHINGTON/LUXEMBOURG: US President Donald Trump threatened to further increase tariffs on China on Monday (Apr 7), raising the possibility of further escalation in a trade war that has a",
    "link": "https://www.channelnewsasia.com/world/trump-threat-tariffs-china-global-markets-trade-war-5049726",
    "timestamp": "2025-04-07T17:07:22Z"
  },
  {
    "title": "Wall Street's historic meltdown: Investors reeling as Donald Trump sets record for worst stock market debut of any president in modern American history",
    "description": "Trump stock market crash is making headlines as Wall Street reels from the worst market start ever under a modern president. Despite inheriting a booming bull market, Donald Trump's second term is off to a historic low, with the S&P 500 dropping 15% and neari…",
    "link": "https://economictimes.indiatimes.com/news/international/us/wall-streets-historic-meltdown-investors-reeling-as-donald-trump-sets-record-for-worst-stock-market-debut-of-any-president-in-modern-american-history/articleshow/120071394.cms",
    "timestamp": "2025-04-07T17:07:21Z"
  },
  {
    "title": "India's 'applied tariffs' to US only 7-8%, not humongous: Piyush Goyal",
    "description": "Commerce Minister Piyush Goyal on Monday said India’s applied tariffs on the U.S. average just 7–8%, calling them moderate and necessary to guard against unfair trade practices. In contrast, the U.S. recently imposed a 26% reciprocal tariff on India. Goyal de…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indias-applied-tariffs-to-us-only-7-8-not-humongous-piyush-goyal/articleshow/120071762.cms",
    "timestamp": "2025-04-07T17:06:24Z"
  },
  {
    "title": "Elon Musk’s Secret Weapon: the US Marshals Service",
    "description": "As if Elon Musk didn’t already have enough advantages, between his billions and his leverage over President Donald Trump, he appears to have another ace up his sleeve: the US Marshals Service. In February, members of Musk’s private security detail were deputi…",
    "link": "https://www.motherjones.com/politics/2025/04/elon-musk-us-marshals-service-deputy-special-marshals-doge/",
    "timestamp": "2025-04-07T17:06:21Z"
  },
  {
    "title": "Trump Vows Huge New China Tariffs As Markets Nosedive",
    "description": "US President Donald Trump on Monday threatened new tariffs of 50 percent on China, ratcheting up a trade war even as a dramatic selloff in global markets gathered pace.",
    "link": "https://www.ibtimes.com/trump-vows-huge-new-china-tariffs-markets-nosedive-3769107",
    "timestamp": "2025-04-07T17:06:21Z"
  },
  {
    "title": "Bette Midler Celebrates Selling Her Tesla",
    "description": "She's just the most recent celebrity to speak out against Elon Musk.",
    "link": "https://littlethings.com/entertainment/bette-midler-celebrates-selling-her-tesla-calling-it-a-symbol-of-racism-and-greed",
    "timestamp": "2025-04-07T17:05:45Z"
  },
  {
    "title": "Trump hints he'd back longtime critic's bid to flip Dem Senate seat in 2026: 'I hope he runs'",
    "description": "President Donald Trump says that he met with former New Hampshire Gov. Chris Sununu and hinted that he would back the one-time GOP critic if he runs for the Senate in 2026.",
    "link": "https://www.foxnews.com/politics/trump-hints-hed-back-longtime-critics-bid-flip-dem-senate-seat-2026-i-hope-he-runs",
    "timestamp": "2025-04-07T17:05:33Z"
  },
  {
    "title": "The War Group Chat Fiasco Revealed Something No One Talks About Enough",
    "description": "The glaring disparity of how leakers are treated comes into view as some of the highest-ranking members of the Trump administration reel from the group text scandal.",
    "link": "https://www.huffpost.com/entry/signalgate-exposes-hypocrisy-at-high-level_n_67f04983e4b06ba13d226024",
    "timestamp": "2025-04-07T17:04:58Z"
  },
  {
    "title": "Trump tariffs: If you're worried about a bear market, look at this one chart",
    "description": "Investors aren't thrilled about President Donald Trump's new tariff policy.\nThe S&P 500 sold off sharply on Thursday and Friday following the President's announcement of a baseline 10% tariff on all trading partners and duties as high as 50% on countries with…",
    "link": "https://biztoc.com/x/cf44a7ce72f790cc",
    "timestamp": "2025-04-07T17:04:57Z"
  },
  {
    "title": "What is a bear market? Stocks take dive amid Trump tariffs, worries of trade war",
    "description": "USA TODAY and Yahoo may earn commission from links in this article. Pricing and availability subject to change.\nAmid President Donald Trump's tariffs on multiple countries, U.S. stocks dipped low enough Monday to enter a territory known in industry parlance a…",
    "link": "https://biztoc.com/x/3712211d4400232c",
    "timestamp": "2025-04-07T17:04:53Z"
  },
  {
    "title": "EU President says ready to negotiate with US on tariffs, but prepared for retaliation",
    "description": "Ursula von der Leyen, European Commission President, has stated the EU's openness to negotiate with the U.S. regarding President Trump's newly announced import tariffs. While expressing a willingness to engage in talks to resolve the trade dispute, von der Le…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eu-president-says-ready-to-negotiate-with-us-on-tariffs-but-prepared-for-retaliation/articleshow/120071638.cms",
    "timestamp": "2025-04-07T17:04:43Z"
  },
  {
    "title": "Trump Advisors Struggle To Defend, or Even Explain, His Tariff Strategy",
    "description": "President Donald Trump's \"reciprocal\" tariffs went into effect over the weekend, imposing a 10 percent tax on imports from nearly every nation on the planet. (Additional higher tariffs on a subset of countries will go into effect Wednesday.) The U.S. stock ma…",
    "link": "https://biztoc.com/x/8bb7054ee7a5d806",
    "timestamp": "2025-04-07T17:04:38Z"
  },
  {
    "title": "What happens next as Trump's tariffs cause 'bloodbath' wiping trillions from stock market",
    "description": "The tariffs imposed by Donald Trump have caused a 'bloodbath' in the stockmarket, so what happens now?",
    "link": "https://www.ladbible.com/news/us-news/trump-tariffs-stock-market-what-happens-next-703243-20250407",
    "timestamp": "2025-04-07T17:04:37Z"
  },
  {
    "title": "Trump threatens to add another 50% tariff on China—sending the total rate past 100%—unless it backs down from retaliation tomorrow",
    "description": "President Donald Trump gave Beijing one day to withdraw its retaliation to his latest tariff salvo, or else he will add another 50% duty on Chinese imports. Last week, Trump imposed a fresh 34% levy on top of his earlier 20% tariff. If he follows through with…",
    "link": "https://biztoc.com/x/ca121e20e52b9247",
    "timestamp": "2025-04-07T17:04:28Z"
  },
  {
    "title": "What are some reasons you may be denied entry at the U.S. border?",
    "description": "\"One is nowhere more powerless than at a border,\" says Audrey Macklin, University of Toronto law professor.",
    "link": "https://nationalpost.com/news/canada/reasons-entry-denied-united-states",
    "timestamp": "2025-04-07T17:04:09Z"
  },
  {
    "title": "Trump 90-Day Tariff Pause Rumor Causes Stock Whipsaw Before White House Calls It ‘Fake News’—Here’s What Happened",
    "description": "Trump has championed his tariffs despite a historic selloff across U.S. markets, claiming his levies would bring in “billions.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/07/trump-90-day-tariff-pause-rumor-causes-stock-whipsaw-before-white-house-calls-it-fake-news-heres-what-happened/",
    "timestamp": "2025-04-07T17:02:50Z"
  },
  {
    "title": "Trade uncertainty taking a toll on business and consumer confidence: Bank of Canada reports",
    "description": "Central bank's outlook survey shows 32% of firms now planning with the assumption that a recession will happen in Canada in the next year, while job loss fears were dominant for consumers.",
    "link": "https://www.cbc.ca/news/business/boc-surveys-trade-uncertainty-1.7503766",
    "timestamp": "2025-04-07T17:02:50Z"
  },
  {
    "title": "Storms tore up two of America’s most iconic trails. Federal cuts have disrupted repairs",
    "description": "Wildfires and more intense storms have been taking a toll on the legendary trails.",
    "link": "https://www.bostonherald.com/2025/04/07/federal-cuts-americas-trails/",
    "timestamp": "2025-04-07T17:02:49Z"
  },
  {
    "title": "Storms tore up two of America’s most iconic trails. Federal cuts have disrupted repairs",
    "description": "Wildfires and more intense storms have been taking a toll on the legendary trails.",
    "link": "https://www.denverpost.com/2025/04/07/federal-cuts-americas-trails/",
    "timestamp": "2025-04-07T17:02:49Z"
  },
  {
    "title": "Trump vows huge new China tariffs as markets nosedive",
    "description": "US President Donald Trump on Monday threatened new tariffs of 50 percent on China, ratcheting up a trade war even as a dramatic selloff in global markets gathered pace. Trump upended the world economy last week with sweeping tariffs that have raised fears of …",
    "link": "https://www.digitaljournal.com/world/trump-vows-huge-new-china-tariffs-as-markets-nosedive/article",
    "timestamp": "2025-04-07T17:02:22Z"
  },
  {
    "title": "Bill Maher Praises Donald Trump Perhaps Too Much In Chris Cuomo Sit-Down",
    "description": "The \"Real Time\" star gushed about the president after having dinner with him at the White House.",
    "link": "https://www.huffpost.com/entry/bill-maher-donald-trump-compliments_n_67f3d8fce4b0afc2a9d7aee7",
    "timestamp": "2025-04-07T17:01:54Z"
  },
  {
    "title": "‘We’d Lose The War’: Tucker Carlson Warns Against Bombing Iran as Tariff War Tanks Markets",
    "description": "Tucker Carlson raised eyebrows on Monday by arguing that President Donald Trump’s tariffs have made it so the U.S. “can’t afford” a war with Iran.\nThe post ‘We’d Lose The War’: Tucker Carlson Warns Against Bombing Iran as Tariff War Tanks Markets first appear…",
    "link": "https://www.mediaite.com/politics/wed-lose-the-war-tucker-carlson-warns-against-bombing-iran-as-tariff-war-tanks-markets/",
    "timestamp": "2025-04-07T17:00:52Z"
  },
  {
    "title": "Musk's DOGE team can access government data for now, appeals court rules (Jonathan Stempel/Reuters)",
    "description": "Jonathan Stempel / Reuters:\nMusk's DOGE team can access government data for now, appeals court rules  —  A divided federal appeals court set aside a court order that had blocked the government downsizing team created by U.S. President Donald Trump and led by …",
    "link": "https://www.memeorandum.com/250407/p77",
    "timestamp": "2025-04-07T17:00:04Z"
  },
  {
    "title": "FAKE NEWS SWINGS...",
    "description": "Markets were gripped by volatility as investors looked for any clue as to whether the White House might change course.",
    "link": "https://www.semafor.com/article/04/07/2025/us-stocks-whipsaw-on-tariff-uncertainty-social-media-rumors",
    "timestamp": "2025-04-07T17:00:03Z"
  },
  {
    "title": "What the $12b defence spend buys, and what New Zealanders will pay to afford it - Thomas Coughlan",
    "description": "OPINION: $12 billion does not go a long way in the defence world.",
    "link": "https://www.nzherald.co.nz/nz/politics/what-the-12b-defence-spend-buys-and-what-new-zealanders-will-pay-to-afford-it/55JYGNAEXNHBDADXN5IOOGCVLI/",
    "timestamp": "2025-04-07T17:00:00Z"
  },
  {
    "title": "Macron Calls for Strong Measures Against Russia's Continued Aggression",
    "description": "The US ambassador expressed “solidarity” with Kyiv following multiple Russian attacks on civilian areas, a day after Ukrainian President Volodymyr Zelenskyy criticized Washington for what he called a “weak response” to Moscow’s deadly campaign against his cou…",
    "link": "https://oilprice.com/Geopolitics/International/Macron-Calls-for-Strong-Measures-Against-Russias-Continued-Aggression.html",
    "timestamp": "2025-04-07T17:00:00Z"
  },
  {
    "title": "Letters: We fail the Ghandi test when it comes to treatment of our most vulnerable",
    "description": "OPINION: Trump tariffs may make history for all the wrong reasons",
    "link": "https://www.nzherald.co.nz/nz/letters-we-fail-the-ghandi-test-when-it-comes-to-treatment-of-our-most-vulnerable/E3QB6GNWIZAZDAHHDNKWKIE3KY/",
    "timestamp": "2025-04-07T17:00:00Z"
  },
  {
    "title": "How Trump’s tariffs are affecting the global economy – The Front Page",
    "description": "'The world has changed and it’ll be in the history books.'",
    "link": "https://www.nzherald.co.nz/nz/president-vs-penguins-how-trumps-tariffs-are-affecting-the-global-economy-the-front-page/Z57YWAHN4JFHFPWKS3O4JGKVZU/",
    "timestamp": "2025-04-07T17:00:00Z"
  },
  {
    "title": "Trump offers a mixed message on whether he’s trying to push markets off a cliff",
    "description": "Did Donald Trump deliberately want to push markets lower? The more he addresses the question, the murkier the answer becomes.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-offers-mixed-message-whether-s-trying-push-markets-cliff-rcna200011",
    "timestamp": "2025-04-07T16:59:26Z"
  },
  {
    "title": "Billionaire heiress Rep. Sara Jacobs makes a fool of herself in bid to defund DOGE",
    "description": "How stupid do you have to be to try to defund a government agency that doesn't cost anything?Call it Sara Jacobs-stupid, the billionaire heiress who represents my congressional district in San Diego, having come out with what she calls the 'Delete DOGE' Act.I…",
    "link": "https://freerepublic.com/focus/f-news/4309452/posts",
    "timestamp": "2025-04-07T16:59:08Z"
  },
  {
    "title": "EU response to Trump's tariffs: a delicate balancing act",
    "description": "As US tariffs on EU exports escalate, Europe scrambles for a unified response. Trade ministers met in Luxembourg to chart the way forward — and the stakes are high.",
    "link": "https://www.dw.com/en/eu-response-to-trumps-tariffs-a-delicate-balancing-act/a-72166642",
    "timestamp": "2025-04-07T16:58:00Z"
  },
  {
    "title": "Countering Trump's tariffs: EU seeks balanced approach",
    "description": "As US tariffs on EU exports escalate, Europe scrambles for a unified response. Trade ministers met in Luxembourg to chart the way forward — and the stakes are high. It might have been good intuition or simply the inevitable outcome of escalating rhetoric from…",
    "link": "https://www.dw.com/en/eu-trump-tariffs-trade-goods-services/a-72166642",
    "timestamp": "2025-04-07T16:58:00Z"
  },
  {
    "title": "The White House incrementally destabilizes the U.S. intelligence community, too",
    "description": "When thinking about the pillars of modern American life that Donald Trump has destabilized, the U.S. intelligence community belongs high on the list.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-incrementally-destabilizes-us-intelligence-community-rcna200032",
    "timestamp": "2025-04-07T16:57:48Z"
  },
  {
    "title": "Howard Lutnick says he hopes Trump’s tariffs will eliminate China’s ‘army of millions and millions of human beings screwing in little, little screws to make iPhones’ so they can be built in America by robots",
    "description": "The Commerce Secretary said the U.S. government would “protect” companies that “invest in America.”",
    "link": "https://finance.yahoo.com/news/howard-lutnick-says-hopes-trump-165736853.html",
    "timestamp": "2025-04-07T16:57:36Z"
  },
  {
    "title": "Audi’s U.S. Pullback and the New Auto Tariff Turmoil: What It Means for German Luxury Automakers",
    "description": "The landscape for German luxury carmakers in the United States is shifting rapidly in the wake of a sudden and sweeping auto tariff announcement. On April 2, U.S. President Donald Trump declared a 25% tariff...\nFirst published by https://www.bmwblog.com",
    "link": "https://www.bmwblog.com/2025/04/07/audi-tariff-halt-deliveries/",
    "timestamp": "2025-04-07T16:57:29Z"
  },
  {
    "title": "Elon Musk has been indirectly criticizing Donald Trump’s tariffs, here’s what he shared in a new video",
    "description": "Economic experts have continuously cautioned that Trump’s tariffs will likely lead to increased costs for American consumers and a prolonged period of economic uncertainty.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-has-been-indirectly-criticizing-donald-trumps-tariffs-heres-what-he-shared-in-a-new-video/articleshow/120071438.cms",
    "timestamp": "2025-04-07T16:57:24Z"
  },
  {
    "title": "Buy or Wait Guide: 11 Experts Predict How Tariffs Will Change Tech Prices in 2025 and What to Do Now",
    "description": "From electric cars to TVs, phones and cameras, CNET experts weigh in on what you should consider buying now before tariffs increase prices.",
    "link": "https://www.cnet.com/tech/mobile/buy-or-wait-guide-11-experts-predict-how-tariffs-will-change-tech-prices-in-2025-and-what-to-do-now/",
    "timestamp": "2025-04-07T16:56:16Z"
  },
  {
    "title": "Democrat senators: DOE plan to cancel hydrogen hub funding ‘illegal and harmful’",
    "description": "Democrat senators: DOE plan to cancel hydrogen hub funding ‘illegal and harmful’ A total of seven regional hydrogen hubs were earmarked for $7bn in federal funding under BIL – with four hosting developments in blue states. The reports emerged after President …",
    "link": "https://energycentral.com/c/ec/democrat-senators-doe-plan-cancel-hydrogen-hub-funding-%E2%80%98illegal-and-harmful%E2%80%99",
    "timestamp": "2025-04-07T16:56:12Z"
  },
  {
    "title": "Noem's Homeland Security 'unapologetic' about using lie-detector test on suspected intel leakers",
    "description": "The Department of Homeland Security is using polygraph tests on staffers to snuff out internal information from leaking to the public.",
    "link": "https://www.foxnews.com/politics/noems-homeland-security-unapologetic-about-using-lie-detector-test-suspected-intel-leakers",
    "timestamp": "2025-04-07T16:55:45Z"
  },
  {
    "title": "Trump administration labels 90-day trade war pause as 'Fake News,' doubling down on tariff blitz that’s roiling markets",
    "description": "Donald Trump has threatened to impose an additional 50% tariff on China if they do not withdraw their 34% tariff on US goods by April 8th, 2025. The White House press secretary refuted claims of a 90-day pause in the trade war, reaffirming the administration'…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-labels-90-day-trade-war-pause-as-fake-news-doubling-down-on-tariff-blitz-thats-roiling-markets/articleshow/120070521.cms",
    "timestamp": "2025-04-07T16:55:39Z"
  },
  {
    "title": "US Issues Advisory For Its Citizens After Protests Planned In Dhaka",
    "description": "The US Embassy in Dhaka has put out an advisory for American citizens in the country, given the protests planned in Dhaka today.",
    "link": "https://www.ndtv.com/world-news/us-issues-advisory-for-its-citizens-after-protests-planned-in-dhaka-8110738",
    "timestamp": "2025-04-07T16:54:10Z"
  },
  {
    "title": "THE TRASH REPORT: Trump Jr. Got to See Sublime and All I Got Is a Huge Hit on My Retirement Savings",
    "description": "Let's dig into the biggest, steaming pile of gossip of the week. \n \n by Elinor Jones\n \n \n \n Hi there! Welcome back to the Trash Report. I am mother trash panda, Elinor Jones. I hope you have been having a pleasant April spent refreshing your retirement accoun…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/04/07/47724033/the-trash-report-trump-jr-got-to-see-sublime-and-all-i-got-is-a-huge-hit-on-my-retirement-savings",
    "timestamp": "2025-04-07T16:54:00Z"
  },
  {
    "title": "CNN Data Chief Spots How Donald Trump Just Made History — In The Worst Way",
    "description": "CNN’s chief data analyst Harry Enten highlighted just how historically unique the 15% drop in the S&P 500 stock market index is, a plunge sparked by uncertainty over Donald Trump’s incoming tariffs.\nEnten wasn’t buying Republican spin that the dip is “pretty …",
    "link": "https://biztoc.com/x/871d539e61725fe0",
    "timestamp": "2025-04-07T16:53:38Z"
  },
  {
    "title": "EU offered ‘zero-for-zero’ deal to US weeks before tariff announcement",
    "description": "Cars and other goods were to be included, according to EU trade commissioner, who says offer is still on table\nThe EU has said it offered the US a “zero-for-zero” tariff deal on cars and industrial goods weeks before Donald Trump launched his trade war, but t…",
    "link": "https://biztoc.com/x/fbdedb515d80a4f8",
    "timestamp": "2025-04-07T16:53:19Z"
  },
  {
    "title": "‘Assassination culture’: Shocking number of Americans say murdering President Trump is justifiable!",
    "description": "'These attitudes are not fringe – they're grounded in far-left authoritarianism and increasingly normalized in digital discourse'",
    "link": "https://www.wnd.com/2025/04/assassination-culture-shocking-number-of-americans-say-murdering-president-trump-is-justifiable/",
    "timestamp": "2025-04-07T16:52:44Z"
  },
  {
    "title": "Trump tariffs: If you're worried about a bear market, look at this one chart",
    "description": "Zoom out on market history, and even the worst financial calamities look like small bumps in the road.",
    "link": "https://www.cnbc.com/2025/04/07/trump-tariffs-worried-about-a-bear-market-look-at-this-chart.html",
    "timestamp": "2025-04-07T16:52:20Z"
  },
  {
    "title": "President Trump threatens additional 50% tariff on China, effective April 9th",
    "description": "U.S. President Donald Trump on Monday stated on Truth Social that \"if China does not withdraw its 34% increase above their already…\nThe post President Trump threatens additional 50% tariff on China, effective April 9th appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/04/07/president-trump-threatens-additional-50-tariff-on-china-effective-april-9th/",
    "timestamp": "2025-04-07T16:51:50Z"
  },
  {
    "title": "The Modern Triumvirate: Trump, Xi, and Musk",
    "description": "U.S. President Donald Trump, Chinese President Xi Jinping, and Elon Musk are closely intertwined with one another's interests.",
    "link": "https://thediplomat.com/2025/04/the-modern-triumvirate-trump-xi-and-musk/",
    "timestamp": "2025-04-07T16:51:00Z"
  },
  {
    "title": "Trump threatens additional tariffs on China, terminates talks (Reuters)",
    "description": "Reuters:\nTrump threatens additional tariffs on China, terminates talks  —  U.S. President Donald Trump said on Monday he will impose an additional 50% tariff on China if Beijing does not withdraw its retaliatory tariffs on the United States.  —  “Additionally…",
    "link": "https://www.memeorandum.com/250407/p74",
    "timestamp": "2025-04-07T16:50:00Z"
  },
  {
    "title": "How an errant headline about a tariffs 'pause' briefly sent stocks soaring",
    "description": "An unfounded claim that President Donald Trump was considering pausing the implementation of sizable tariffs briefly sent U.S. stocks skyrocketing on Monday, an indication of just how volatile the current economic situation has become.",
    "link": "https://www.nbcnews.com/business/markets/errant-headline-tariffs-pause-briefly-sent-stocks-soaring-rcna200004",
    "timestamp": "2025-04-07T16:49:19Z"
  },
  {
    "title": "China Cuts Off Rare Earth Mineral Exports to U.S. in Trade War with Trump",
    "description": "China’s retaliation against President Donald Trump’s tariffs includes more export controls on rare earth minerals, which are vital to electronics and battery manufacturing.\nThe post China Cuts Off Rare Earth Mineral Exports to U.S. in Trade War with Trump app…",
    "link": "https://www.breitbart.com/asia/2025/04/07/china-cuts-off-rare-earth-mineral-exports-to-u-s-in-trade-war-with-trump/",
    "timestamp": "2025-04-07T16:46:55Z"
  },
  {
    "title": "Trump asks Supreme Court to block order requiring US to bring back man mistakenly deported to El Salvador (CNN)",
    "description": "CNN:\nTrump asks Supreme Court to block order requiring US to bring back man mistakenly deported to El Salvador  —  President Donald Trump's administration urged the Supreme Court on Monday to block a lower court order requiring officials to bring a man who wa…",
    "link": "https://www.memeorandum.com/250407/p73",
    "timestamp": "2025-04-07T16:45:01Z"
  },
  {
    "title": "EU ready to use \"every tool\" against U.S. tariffs: EU trade commissioner",
    "description": "BRUSSELS, April 7 (Xinhua) -- The European Union (EU) is prepared to deploy \"every tool\" to shield itself from the impact of U.S. tariffs imposed by President Donald Trump if negotiations fail, European Commissioner for Trade and Economic Security Maros Sefco…",
    "link": "https://www.thestar.com.my/news/world/2025/04/08/eu-ready-to-use-every-tool-against-us-tariffs-eu-trade-commissioner",
    "timestamp": "2025-04-07T16:45:00Z"
  },
  {
    "title": "Bombshell Study Reveals How Many Leftists Support Killing Trump and Musk",
    "description": "NCRI conducted a nationally representative survey of more than 1,200 U.S. adults, weighted to reflect national census demographics. The findings were stark: Some 38% of respondents said it would be at least \"somewhat justified\" to murder Donald Trump, and 31%…",
    "link": "https://freerepublic.com/focus/f-news/4309448/posts",
    "timestamp": "2025-04-07T16:44:50Z"
  },
  {
    "title": "‘Don’t Be a PANICAN’: Trump Name-calling to End Market Crash",
    "description": "‘Don’t Be a PANICAN’: On Truth Social, Trump tried to end the market crash via name-calling. But people found the meaning of ‘panican’ confusing and markets plunged as Trump threatened new China tariffs.  So we must ‘HANK TOUGH’ a little longer.",
    "link": "http://nymag.com/intelligencer/article/panican-meaning-trump-tariffs-market-crash.html",
    "timestamp": "2025-04-07T16:44:36Z"
  },
  {
    "title": "Former US Rep. Mia Love honored in Utah after brain cancer death",
    "description": "Love was the first Black Republican woman elected to Congress.",
    "link": "https://www.bostonherald.com/2025/04/07/mia-love-memorial/",
    "timestamp": "2025-04-07T16:44:00Z"
  },
  {
    "title": "Business leaders speak out against Trump's trade war with the world",
    "description": "Major figures in the business world have spent the last 48 hours sounding alarms about the economic consequences of President Donald Trump’s trade war — some even reversing their previous supportive stances.",
    "link": "https://www.nbcnews.com/business/business-news/trump-tariffs-business-leaders-criticize-trump-admin-trade-war-rcna199997",
    "timestamp": "2025-04-07T16:43:41Z"
  },
  {
    "title": "Trump to veto tariff bill if it passes Congress",
    "description": "United States President Donald Trump would be using his veto power to block a bill proposed by senators Maria Cantwell and Chuck Grassley that would restrict the presidential authority to impose tarif...",
    "link": "https://biztoc.com/x/379ee4631da1a651",
    "timestamp": "2025-04-07T16:42:23Z"
  },
  {
    "title": "Trump praises Ohtani’s ‘movie star’ looks and attacks senators during Dodgers’ visit",
    "description": "Donald Trump praised Shohei Ohtani’s “movie star” looks while also insulting California’s Democratic senators during the Los Angeles Dodgers’ visit to the White House on Monday. “He looks like a movie star,” said Trump after shaking Ohtani’s hand. Ohtani prop…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5ace3194-2246-44fb-9086-c8df1959cbd2",
    "timestamp": "2025-04-07T16:42:22Z"
  },
  {
    "title": "Netanyahu allegedly to present Iran plan to Trump",
    "description": "Israeli Prime Minister Benjamin Netanyahu plans to outline his vision of what \"a good deal should look like\" to US President Donald Trump during his upcoming White House meeting today, according to Ax...",
    "link": "https://biztoc.com/x/ada4fbb2cbb07e07",
    "timestamp": "2025-04-07T16:42:13Z"
  }
]