[
  {
    "title": "Laughter Chefs Unlimited Entertainment 3's Tejasswi Prakash: This season is about giving Karan a little pre-shaadi rehearsal",
    "description": "Laughter Chefs Unlimited Entertainment returns with its third season, featuring Tejasswi Prakash and Karan Kundrra as contestants. The show promises increased chaos and competition with a new lineup of celebrities. Tejasswi Prakash expresses excitement about …",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/laughter-chefs-unlimited-entertainment-3s-tejasswi-prakash-this-season-is-about-giving-karan-a-little-pre-shaadi-rehearsal/articleshow/125451950.cms",
    "timestamp": "2025-11-20T03:28:04Z"
  },
  {
    "title": "House Votes To Nix Controversial Provision That Could Enrich Senators",
    "description": "The House of Representatives voted unanimously Wednesday evening to repeal a new law allowing senators to sue the federal government for massive sums.",
    "link": "https://dailycaller.com/2025/11/19/house-votes-to-nix-controversial-provision-that-could-enrich-senators/",
    "timestamp": "2025-11-20T03:26:53Z"
  },
  {
    "title": "Prominent Democratic Veterans Urge Troops To Defy 'Illegal Orders'",
    "description": "“No one has to carry out orders that violate the law or our Constitution.”",
    "link": "https://www.huffpost.com/entry/elissa-slotkin-mark-kelly-veterans-video_n_691e6db9e4b0b763ab8dbd39",
    "timestamp": "2025-11-20T03:25:11Z"
  },
  {
    "title": "Jimmy Kimmel blasts Trump over ‘quiet, piggy’ outburst aimed at female reporter",
    "description": "‘Every time he gets asked about Jeffrey Epstein, he loses his mind,’ Kimmel said of Trump’s viral reaction to a reporter on Air Force One last week",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-trump-quiet-piggy-b2868758.html",
    "timestamp": "2025-11-20T03:24:42Z"
  },
  {
    "title": "WHO sets target of 40,000 vaccinations for Gazan children",
    "description": "The World Health Organization (WHO) said that it aims to vaccinate more than 40,000 children against various diseases in Gaza, as it takes advantage of the recent ceasefire.",
    "link": "https://www.rte.ie/news/world/2025/1120/1544895-gaza-who/",
    "timestamp": "2025-11-20T03:17:57Z"
  },
  {
    "title": "WHO sets target of 40,000 vaccinations for Gazan children",
    "description": "The World Health Organization has said that it aims to vaccinate more than 40,000 children against various diseases in Gaza, as it takes advantage of the ceasefire.",
    "link": "https://www.rte.ie/news/world/2025/1120/1544895-gaza-israel/",
    "timestamp": "2025-11-20T03:17:57Z"
  },
  {
    "title": "Fresh Israeli strikes on Gaza, Qatar warns of escalation",
    "description": "Health authorities in Gaza have said that Israeli air strikes killed four people as Qatar warned that renewed attacks threatened to undermine the fragile ceasefire between Israel and Hamas.",
    "link": "https://www.rte.ie/news/middle-east/2025/1120/1544895-gaza-israel/",
    "timestamp": "2025-11-20T03:17:57Z"
  },
  {
    "title": "Trump Takes Credit for Release of Epstein Files in Lengthy Rant Against Democrats: ‘This Latest Hoax Will Backfire’",
    "description": "\"Do not forget, the Biden Administration did not turn over a SINGLE file or page related to Democrat Epstein,\" the president adds\nThe post Trump Takes Credit for Release of Epstein Files in Lengthy Rant Against Democrats: ‘This Latest Hoax Will Backfire’ appe…",
    "link": "https://www.thewrap.com/donald-trump-signs-epstein-files-bill-blames-democrats/",
    "timestamp": "2025-11-20T03:15:51Z"
  },
  {
    "title": "Trump to meet Mamdani on Friday",
    "description": "United States President Donald Trump said he will meet New York City Mayor-elect Zohran Mamdani, whose victory in the mayoral election he disapproved of, at the Oval Office on Friday.\"Communist Mayor ...",
    "link": "https://biztoc.com/x/b6a93dfc709cb7e8",
    "timestamp": "2025-11-20T03:14:17Z"
  },
  {
    "title": "Trump says will welcome skilled immigrants to US, willing to take ‘heat’ for it",
    "description": "Addressing the US-Saudi Investment Forum, Trump said that a large number of plants, including “extremely complex” ones, are being built in the US; \"...They're going to have to bring thousands of people with them, and I'm going to welcome those people,” he sai…",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-will-welcome-skilled-immigrants-to-us-willing-to-take-heat-for-it/article70301595.ece",
    "timestamp": "2025-11-20T03:13:37Z"
  },
  {
    "title": "Nancy Pelosi Tells CNN She Could Have Said ‘Much Worse’ After Calling Trump ‘The Worst Thing on the Face of the Earth’",
    "description": "Rep. Nancy Pelosi told CNN that she could have said \"much worse\" after calling President Trump a \"vile creature\" and \"the worst thing on the face of the Earth.\"\nThe post Nancy Pelosi Tells CNN She Could Have Said ‘Much Worse’ After Calling Trump ‘The Worst Th…",
    "link": "https://www.mediaite.com/media/tv/nancy-pelosi-tells-cnn-she-could-have-said-much-worse-after-calling-trump-the-worst-thing-on-the-face-of-the-earth/",
    "timestamp": "2025-11-20T03:11:44Z"
  },
  {
    "title": "'This is personal': Conservative analyst gives behind-the-scenes look at Trump-MTG feud",
    "description": "A conservative political analyst on Wednesday gave a behind-the-scenes look at Rep. Marjorie Taylor Greene's (R-GA) feud with President Donald Trump during a podcast interview. SE Cupp joined Jamal Simmons on the \"Politicon\" podcast on Wednesday, where the tw…",
    "link": "https://www.rawstory.com/trump-2674311669/",
    "timestamp": "2025-11-20T03:07:01Z"
  },
  {
    "title": "U.S. Congress seeks testimony from Australia's internet regulator",
    "description": "A U.S. congressional committee called on Australia's internet regulator to testify about the country's laws governing the internet, calling her a &quot;noted zealot for global takedowns&quot; who &quot;threatens speech of American citizens.&quot; In a letter …",
    "link": "https://japantoday.com/category/world/us-congress-seeks-testimony-from-australia%27s-internet-regulator",
    "timestamp": "2025-11-20T03:06:19Z"
  },
  {
    "title": "Trump to meet with New York Mayor-elect Zohran Mamdani at White House on Friday",
    "description": "President Donald Trump said on Wednesday night that he will meet with New York City Mayor-elect Zohran Mamdani at the White House on Friday.\nThe meeting comes at the request of Mamdani, a democratic socialist who stunned the U.S. political world in June by be…",
    "link": "https://biztoc.com/x/7dfee489d021e565",
    "timestamp": "2025-11-20T03:03:18Z"
  },
  {
    "title": "Trump Signs Bill To Release Epstein Files After Stunning U-Turn",
    "description": "In an announcement on social media platform Truth Social, US President Donald Trump on Thursday claimed to have signed a bill ordering the release of files on deceased sex offender Jeffrey Epstein. The move comes following mounting pressure from his own party…",
    "link": "https://www.ndtvprofit.com/world/trump-signs-bill-to-release-epstein-files-after-stunningu-turn",
    "timestamp": "2025-11-20T02:56:40Z"
  },
  {
    "title": "Trump signs bill releasing Epstein files",
    "description": "Trump has argued that the Epstein “hoax” would backfire on the Democrats Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628046-trump-signs-bill-epstein-files/",
    "timestamp": "2025-11-20T02:56:19Z"
  },
  {
    "title": "Trump to meet with New York Mayor-elect Zohran Mamdani at White House on Friday",
    "description": "Zohran Mamdani said he plans to talk to President Donald Trump about the problem many New York City residents have with affording to live in the Big Apple.",
    "link": "https://www.cnbc.com/2025/11/19/trump-zohran-mamdani-new-york-mayor-white-house.html",
    "timestamp": "2025-11-20T02:55:56Z"
  },
  {
    "title": "Congress passes measure to reverse Biden-era Alaskan petroleum reserve plan",
    "description": "The measure next goes to Trump for consideration.",
    "link": "https://nypost.com/2025/11/19/us-news/congress-passes-measure-to-reverse-biden-era-alaskan-petroleum-reserve-plan/",
    "timestamp": "2025-11-20T02:54:41Z"
  },
  {
    "title": "House gets back to work and quickly falls into a cycle of punishing its own",
    "description": "The U.S. House is back in session after a multi-week hiatus",
    "link": "https://abcnews.go.com/Politics/wireStory/house-gets-back-work-quickly-falls-cycle-punishing-127691085",
    "timestamp": "2025-11-20T02:53:33Z"
  },
  {
    "title": "Trump to meet NYC Mayor-elect Mamdani, calls him 'Communist'",
    "description": "President Trump says he will meet NYC Mayor-elect Zohran Mamdani on Friday, in a meeting requested by Mamdani.",
    "link": "https://www.israelnationalnews.com/news/418064",
    "timestamp": "2025-11-20T02:52:11Z"
  },
  {
    "title": "Report: Bush Family Plotting Comeback to Retake GOP from Trump",
    "description": "Former President George W. Bush and his family are reportedly planning to retake the Republican Party from President Donald Trump once he is out of office, according to a recent report.\nThe post Report: Bush Family Plotting Comeback to Retake GOP from Trump a…",
    "link": "https://www.breitbart.com/politics/2025/11/19/report-bush-family-plotting-comeback-retake-gop-trump/",
    "timestamp": "2025-11-20T02:45:58Z"
  },
  {
    "title": "Trump says he and Mamdani will meet Friday in Washington, setting up clash of political opposites",
    "description": "President Donald Trump says he will meet with New York City Mayor-elect Zohran Mamdani in Washington later this week",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-mamdani-meet-friday-washington-setting-clash-political-127694605",
    "timestamp": "2025-11-20T02:45:28Z"
  },
  {
    "title": "BREAKING: Trump says he has signed the bill to release the Epstein files",
    "description": "President Donald Trump said he signed the bill to release the Justice Department's files on the late convicted sex offender Jeffrey ...",
    "link": "https://biztoc.com/x/0c1ed0af57276dc8",
    "timestamp": "2025-11-20T02:42:47Z"
  },
  {
    "title": "AFT Pharma boss on revenue surge, Donald Trump’s shifting tariffs",
    "description": "The managing director sees an upside from the US President's shake-up.",
    "link": "https://www.nzherald.co.nz/business/aft-pharma-boss-on-revenue-surge-donald-trumps-shifting-tariffs/premium/EM2S7LEOYZGC7DIRXLLJTE6AXI/",
    "timestamp": "2025-11-20T02:39:26Z"
  },
  {
    "title": "What to know about Larry Summers, who has taken leave from Harvard due to Epstein emails",
    "description": "Larry Summers, once a prominent figure in Washington and academia, has stepped back from his teaching post at Harvard University",
    "link": "https://abcnews.go.com/Politics/wireStory/larry-summers-leave-harvard-due-epstein-emails-127694429",
    "timestamp": "2025-11-20T02:37:49Z"
  },
  {
    "title": "House votes to repeal provision that allows senators to sue over phone record seizures",
    "description": "The House has voted to repeal part of a new law that lets senators sue the federal government for millions of dollars if their personal or office data is accessed without their knowledge",
    "link": "https://abcnews.go.com/Politics/wireStory/house-votes-repeal-provision-allows-senators-sue-phone-127687718",
    "timestamp": "2025-11-20T02:37:36Z"
  },
  {
    "title": "Trump signs bill requiring Epstein files release",
    "description": "WASHINGTON: Donald Trump signed into law on Wednesday (Nov 19) legislation requiring the release of government records on convicted sex offender Jeffrey Epstein, spurring a showdown over whether the US president will allow full disclosure - or return to tryin…",
    "link": "https://www.thestar.com.my/news/world/2025/11/20/trump-signs-bill-requiring-epstein-files-release",
    "timestamp": "2025-11-20T02:34:00Z"
  },
  {
    "title": "China leaves benchmark lending rates unchanged for the sixth straight month",
    "description": "China's central bank held key lending rates steady for the sixth month. This indicates less immediate need for monetary easing. Economic data shows a slowdown. However, a trade truce with the US has eased some pressure. Analysts expect policy adjustments to b…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-leaves-benchmark-lending-rates-unchanged-for-the-sixth-straight-month/articleshow/125451267.cms",
    "timestamp": "2025-11-20T02:33:37Z"
  },
  {
    "title": "Epstein files bill includes exceptions that could affect what gets released and when",
    "description": "Attorney General Pam Bondi said, \"We have released over 33,000 Epstein documents to the Hill, and we will continue to follow the law and to have maximum transparency.\" She spoke at an unrelated news conference alongside FBI Director Kash Patel and Deputy Atto…",
    "link": "https://freerepublic.com/focus/f-news/4353500/posts",
    "timestamp": "2025-11-20T02:32:33Z"
  },
  {
    "title": "Nigeria searches for abducted schoolgirls as gunmen attack church",
    "description": "Security forces were scouring western Nigeria for two dozen kidnapped schoolgirls on Wednesday, a day after gunmen stormed a church service, killing two people in an attack captured on video. Nigerian security forces have been placed on high alert, the inform…",
    "link": "https://www.digitaljournal.com/world/nigeria-searches-for-abducted-schoolgirls-as-gunmen-attack-church/article",
    "timestamp": "2025-11-20T02:32:20Z"
  },
  {
    "title": "Top military lawyer raised legal concerns about boat strikes",
    "description": "WASHINGTON — The senior military lawyer for the combatant command overseeing lethal strikes on alleged drug-smuggling boats near Venezuela disagreed with the Trump administration’s position that the operations are lawful — and his views were sidelined, accord…",
    "link": "https://www.nbcnews.com/politics/national-security/top-military-lawyer-raised-legal-concerns-boat-strikes-rcna243694",
    "timestamp": "2025-11-20T02:32:09Z"
  },
  {
    "title": "Real Vance post about Epstein from 2021 spreads online after email release",
    "description": "On Sept. 4, 2021, now-U.S. Vice President JD Vance posted a tweet complaining that after Jeffrey Epstein's ties with \"our wealthiest and most powerful people\" were made public, and Epstein had died in his jail cell not long after, \"we just don't talk about it…",
    "link": "https://www.snopes.com//fact-check/vance-epstein-post-2021/",
    "timestamp": "2025-11-20T02:30:00Z"
  },
  {
    "title": "Trump Announces New Meeting With Zohran Mamdani",
    "description": "President Donald Trump said he will meet New York City Mayor-elect Zohran Mamdani on Friday, though he signaled the possibility of an uncompromising stand in their talks as he announced the meeting, calling Mamdani the city’s “communist” mayor.\nMamdani, who e…",
    "link": "https://biztoc.com/x/a7867710d8a674a9",
    "timestamp": "2025-11-20T02:29:30Z"
  },
  {
    "title": "Gold gains with traders awaiting US data for fresh Fed cues",
    "description": "Gold prices saw a slight uptick as investors awaited the crucial U.S. jobs report, which could influence the Federal Reserve's interest rate decisions.  Despite a recent rate cut, Fed minutes revealed concerns about inflation.  Meanwhile, other precious metal…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-gains-with-traders-awaiting-us-data-for-fresh-fed-cues/articleshow/125451174.cms",
    "timestamp": "2025-11-20T02:29:21Z"
  },
  {
    "title": "After Trump, BBC apologises to the Princess of Wales over title error",
    "description": "The BBC has issued an apology to Catherine, Princess of Wales, for mistakenly calling her 'Kate Middleton' during Armistice Day coverage. This follows a similar apology to Donald Trump regarding an edited speech. The broadcaster acknowledged the error during …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/bbc-apologises-for-calling-princess-catherine-kate-middleton-on-air-days-after-apologising-to-trump/articleshow/125451001.cms",
    "timestamp": "2025-11-20T02:20:34Z"
  },
  {
    "title": "Trump, Zohran Mamdani to meet Friday in Washington in clash of political opposites",
    "description": "The sit-down, which Trump said on social media would take place Friday in the Oval Office, could possibly represent a detente of sorts between the Republican president and Democratic rising star, as Trump has since Mamdani's win moved toward acceptance of Mam…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-zohran-mamdani-to-meet-friday-in-washington-in-clash-of-political-opposites/articleshow/125451087.cms",
    "timestamp": "2025-11-20T02:19:03Z"
  },
  {
    "title": "Trump teases Oval Office meeting with new 'Communist Mayor'",
    "description": "President Donald Trump announced on Truth Social on Wednesday night that he has agreed to meet with the new \"Communist mayor\" of New York City, Zohran Mamdani. \"Communist Mayor of New York City, Zohran 'Kwame' Mamdani, has asked for a meeting,\" Trump posted. …",
    "link": "https://www.rawstory.com/trump-2674311699/",
    "timestamp": "2025-11-20T02:18:12Z"
  },
  {
    "title": "Trump to meet with Zohran Mamdani in the Oval Office on Friday",
    "description": "President Donald Trump and Zohran Mamdani are set to meet in person on Friday, days after Mamdani, the New York mayor-elect, reached out to the White House to arrange a sit-down",
    "link": "https://www.nbcnews.com/politics/white-house/donald-trump-meet-zohran-mamdani-white-house-oval-office-friday-rcna244898",
    "timestamp": "2025-11-20T02:18:10Z"
  },
  {
    "title": "Nvidia earnings clear lofty hurdle set by analysts amid fears about an AI bubble",
    "description": "Nvidia’s sales of the computing chips powering the artificial intelligence craze surged beyond the lofty bar set by stock market analysts in a performance that may ease recent jitters about a Big Tech boom turning into a bust that topples the world’s most val…",
    "link": "https://www.kiro7.com/news/business/nvidia-earnings-will/LQRPGKZJ5I7AZPTFCHY3HYNGQ4/",
    "timestamp": "2025-11-20T02:17:20Z"
  },
  {
    "title": "House Unanimously Passes Bill To Shut Down Senator Payday Over Jan. 6 Probe",
    "description": "It’s not clear if Senate Majority Leader John Thune (R-S.D.) will give the bill a Senate vote.",
    "link": "https://www.huffpost.com/entry/senate-cause-of-action-damages-jan-6-repeal_n_691e3c4fe4b0dc5d37ac1ec6",
    "timestamp": "2025-11-20T02:15:34Z"
  },
  {
    "title": "FCC Launches Review Of Network-Affiliate Relationships",
    "description": "FCC Chairman Brendan Carr announced a review of the relationships between broadcast networks and their affiliates, calling into question contractural restrictions that penalize stations for pre-empting shows and those that prevent them from airing rival progr…",
    "link": "http://deadline.com/2025/11/trump-fcc-network-affiliate-relationships-1236624134/",
    "timestamp": "2025-11-20T02:12:08Z"
  },
  {
    "title": "Trump Signs Bill Ordering Release Of Epstein Files",
    "description": "President Donald Trump signed the “Epstein Files Transparency Act” into law on Wednesday, ordering Attorney General Pam Bondi to make all related unclassified Department of Justice (DOJ) records public. The process picked up steam after 218 members of Congres…",
    "link": "https://freerepublic.com/focus/f-news/4353497/posts",
    "timestamp": "2025-11-20T02:10:33Z"
  },
  {
    "title": "Trump says he will meet NYC Mayor-elect Zohran Mamdani this week",
    "description": "President Donald Trump announced he will meet with New York Mayor-elect Zohran Mamdani at the White House on Friday, November 21, 2024.",
    "link": "https://www.foxnews.com/politics/trump-says-he-meet-nyc-mayor-elect-zohran-mamdani-week",
    "timestamp": "2025-11-20T02:10:24Z"
  },
  {
    "title": "'Highly abnormal': CNN legal expert flags 'huge loophole' in Epstein law Trump signed",
    "description": "CNN legal expert Elie Honig flagged what he described as a \"huge loophole\" in the bill President Donald Trump just signed to release the Jeffrey Epstein files. Trump announced late Wednesday night that he signed the Epstein Transparency Act, a bill that was s…",
    "link": "https://www.rawstory.com/elie-honig-2674311679/",
    "timestamp": "2025-11-20T02:10:04Z"
  },
  {
    "title": "BREAKING: House Votes to Put Arctic Frost Lawsuit Provision on Ice",
    "description": "The House has passed a bill to repeal a provision in the government shutdown-ending continuing resolution that allowed lawmakers surveilled by the federal government to... Read More\nThe post BREAKING: House Votes to Put Arctic Frost Lawsuit Provision on Ice a…",
    "link": "https://www.dailysignal.com/2025/11/19/breaking-house-votes-to-put-arctic-frost-lawsuit-provision-on-ice/",
    "timestamp": "2025-11-20T02:09:48Z"
  },
  {
    "title": "Trump says he signed a bill to release the Epstein files",
    "description": "Nvidia pushes back on AI bubble narrative as Blackwell drives Q3 beat\nInvesting.com-- U.S. President Donald Trump said on Wednesday evening that he had just signed a bill to release files related to Jeffery Epstein, while accusing his political opponents of h…",
    "link": "https://biztoc.com/x/0819803ab3c1fe5d",
    "timestamp": "2025-11-20T02:06:54Z"
  },
  {
    "title": "House votes to repeal controversial Arctic Frost provision from government shutdown bill",
    "description": "The House overwhelmingly rejected a provision allowing Republican senators to sue the federal government after former Special Counsel Jack Smith seized their phone records.",
    "link": "https://www.foxnews.com/politics/house-votes-repeal-controversial-arctic-frost-provision-from-government-shutdown-bill",
    "timestamp": "2025-11-20T02:02:44Z"
  },
  {
    "title": "Are We Shocked the Biden FBI Did This During the Trump Assassination Investigation?",
    "description": "The Biden Federal Bureau of Investigation did the unthinkable as every agency and Congress were investigating the circumstances that led to the assassination attempt of Donald Trump in Butler, Pennsylvania, last July. Actually, no—it’s totally on par with how…",
    "link": "https://freerepublic.com/focus/f-news/4353494/posts",
    "timestamp": "2025-11-20T01:57:28Z"
  },
  {
    "title": "Trump Says He's Signed Bill To Release Epstein Files",
    "description": "The president made good on his promise to do so even though he could have released the files without an act of Congress.",
    "link": "https://www.huffpost.com/entry/trump-epstein-files-bill_n_691e747de4b0d33fcd9862a9",
    "timestamp": "2025-11-20T01:55:56Z"
  },
  {
    "title": "Donald Trump signs bill to release Jeffrey Epstein files",
    "description": "Move caps months-long saga over disclosure of documents related to late sex offender’s case",
    "link": "https://biztoc.com/x/a2045e05c087c73e",
    "timestamp": "2025-11-20T01:55:26Z"
  },
  {
    "title": "Trump signs legislation to release the Epstein files | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> President Donald Trump today signed legislation to release the files from the Justice Department investigation into the late sex offender Jeffrey Epstein.",
    "link": "https://www.staradvertiser.com/2025/11/19/breaking-news/trump-signs-bill-to-release-epstein-files/",
    "timestamp": "2025-11-20T01:55:07Z"
  },
  {
    "title": "Trump quietly approves Russia-Ukraine peace plan demanding major concessions from Kyiv",
    "description": "The framework was developed jointly by US and Russian officials and then conveyed to Kyiv this week by Trump’s special envoy Steve Witkoff. According to the report, Witkoff met Ukrainian national security chief Rustem Umerov in Miami and made clear the White …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-quietly-approves-russia-ukraine-peace-plan-demanding-major-concessions-from-kyiv/articleshow/125450891.cms",
    "timestamp": "2025-11-20T01:54:19Z"
  },
  {
    "title": "Trump signs bill to release the Epstein files",
    "description": "US President Donald Trump signed the bill to release the files from the US Justice Department investigation into the late sex offender Jeffrey Epstein.",
    "link": "https://www.rte.ie/news/world/2025/1120/1544891-us-epstein/",
    "timestamp": "2025-11-20T01:53:46Z"
  },
  {
    "title": "Donald Trump Signs Bill Ordering Justice Department to Release Epstein Files",
    "description": "We’re one step closer to the Epstein files finally getting released. Following the passing of the Epstein Files Transparency Act in the House and Senate, President Donald Trump announced on Wednesday night (November 19) that he has signed the bill, ordering h…",
    "link": "https://www.justjared.com/2025/11/19/donald-trump-signs-bill-ordering-justice-department-to-release-epstein-files/",
    "timestamp": "2025-11-20T01:53:16Z"
  },
  {
    "title": "Samourai Wallet CTO William Hill Sentenced to Four Years in Prison",
    "description": "The developer will serve 48 months for running an unlicensed money transmitter, after his co-founder received five years earlier this month.",
    "link": "https://decrypt.co/349305/samourai-wallet-cto-william-hill-sentenced-four-years-prison",
    "timestamp": "2025-11-20T01:52:54Z"
  },
  {
    "title": "Trump Takes Aim at State AI Laws in Draft Executive Order",
    "description": "The draft order, obtained by WIRED, instructs the US Justice Department to sue states that pass laws regulating AI.",
    "link": "https://www.wired.com/story/trump-prepares-executive-order-challenging-state-ai-laws/",
    "timestamp": "2025-11-20T01:50:39Z"
  },
  {
    "title": "Trump signs bill to release the DOJ's Epstein files (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nTrump signs bill to release the DOJ's Epstein files  —  The legislation requires Attorney General Pam Bondi to release all unclassified records related to Epstein within 30 days.  —  WASHINGTON — President Donald Trump signed a bill…",
    "link": "https://www.memeorandum.com/251119/p167",
    "timestamp": "2025-11-20T01:50:01Z"
  },
  {
    "title": "The Bill Has Been Signed! Trump Moves Forward With Releasing the Epstein Files Within the Next 30 Days — After Calling the Controversy a 'Democrat Hoax'",
    "description": "Donald Trump signed a bill to release the Epstein files within the next 30 days.",
    "link": "https://radaronline.com/p/donald-trump-epstein-files-release-bill-signed/",
    "timestamp": "2025-11-20T01:48:21Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump on Wednesday signed the bill to release the files from the Justice Department investigation into the late sex offender Jeffrey Epstein. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/20/trump-signs-bill-to-release-epstein-files",
    "timestamp": "2025-11-20T01:47:00Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "US President Donald Trump has said he signed a bill requiring the Justice Department to release files related to convicted sex offender Jeffery Epstein.",
    "link": "https://www.dw.com/en/trump-signs-bill-to-release-epstein-files/a-74814368",
    "timestamp": "2025-11-20T01:46:00Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "President Donald Trump has signed a bill to release files on convicted sex offender Jeffrey Epstein",
    "link": "https://www.wsoctv.com/news/politics/trump-signs-bill/EHRIJXU27I7HTNLKXOBD3J45GM/",
    "timestamp": "2025-11-20T01:45:11Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files after fighting it for months (Seung Min Kim/Associated Press)",
    "description": "Seung Min Kim / Associated Press:\nTrump signs bill to release Jeffrey Epstein case files after fighting it for months  —  President Donald Trump signed legislation Wednesday that compels his administration to release files on convicted sex offender Jeffrey Ep…",
    "link": "https://www.memeorandum.com/251119/p165",
    "timestamp": "2025-11-20T01:45:01Z"
  },
  {
    "title": "Trump Says He Signed Bill to Release Epstein Files: What We Know",
    "description": "President Donald Trump on Wednesday signed into law a bill requiring the Justice Department to publicly release its case files on Jeffrey Epstein, triggering a 30-day countdown that could lead to one of the most sweeping disclosures of investigative records i…",
    "link": "https://biztoc.com/x/c1f5396019c985db",
    "timestamp": "2025-11-20T01:44:30Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files",
    "description": "The bill requires the Justice Department to release all files and communications related to Epstein, as well as any information about the investigation into his death in a federal prison in 2019, within 30 days.",
    "link": "https://www.kcra.com/article/trump-signs-bill-to-release-epstein-files/69490726",
    "timestamp": "2025-11-20T01:44:23Z"
  },
  {
    "title": "Trump signs law requiring DOJ to release all Epstein files",
    "description": "President Trump signs bill requiring the DOJ to release all Epstein-related documents, after it passed Congress with near-unanimous support.",
    "link": "https://www.israelnationalnews.com/news/418062",
    "timestamp": "2025-11-20T01:44:22Z"
  },
  {
    "title": "Trump signs bill to release Epstein files, having given up fighting it",
    "description": "President Donald Trump said he signed the bill to release the Justice Department’s files on the late convicted sex offender Jeffrey Epstein, capping a dramatic reversal on an issue he had tried to make go away. In a Truth Social post Wednesday night, the pres…",
    "link": "https://biztoc.com/x/aae7cd2b6eb75952",
    "timestamp": "2025-11-20T01:44:07Z"
  },
  {
    "title": "Trump signs Bill to release Jeffrey Epstein case files after fighting it for months",
    "description": "The Bill requires the US Justice Department to release all files and communications related to Jeffrey Epstein, as well as any information about the investigation into his death in a federal prison within 30 days.",
    "link": "https://www.channelnewsasia.com/world/donald-trump-signs-bill-release-epstein-case-files-5478751",
    "timestamp": "2025-11-20T01:43:38Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "President Donald Trump has signed a bill to release files on convicted sex offender Jeffrey Epstein",
    "link": "https://www.wsbtv.com/news/politics/trump-signs-bill/EHRIJXU27I7HTNLKXOBD3J45GM/",
    "timestamp": "2025-11-20T01:42:53Z"
  },
  {
    "title": "ABLECHILD: Covering Up the Behavioral Health Links to Mass Murders and Assassinations",
    "description": "Covering Up the Behavioral Health Links to Mass Murders and Assassinations Republished with permission from AbleChild. When violent bloodshed occurs – a school shooting, an assassination, a sudden act of mass violence— behavioral health usually is behind it. …",
    "link": "https://joehoft.com/covering-up-the-behavioral-health-links-to-mass-murders-and-assassinations/",
    "timestamp": "2025-11-20T01:40:12Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "President Donald Trump has signed a bill to release files on convicted sex offender Jeffrey Epstein",
    "link": "https://www.wftv.com/news/politics/trump-signs-bill/EHRIJXU27I7HTNLKXOBD3J45GM/",
    "timestamp": "2025-11-20T01:37:54Z"
  },
  {
    "title": "Trump signs bill ordering justice department to release Epstein files",
    "description": "The bill gives the US Justice Department 30 days to release all the files in a searchable format.",
    "link": "https://www.bbc.com/news/articles/cly2y40lj5go",
    "timestamp": "2025-11-20T01:37:45Z"
  },
  {
    "title": "What's in the 'Epstein files' — and when they might become public",
    "description": "The Epstein files, or documents from the FBI and DOJ investigation into Jeffrey Epstein and Ghislaine Maxwell, are slated to become public in the next 30 days.",
    "link": "https://www.nbcnews.com/politics/justice-department/what-in-epstein-files-when-release-house-bill-vote-trump-sign-rcna244799",
    "timestamp": "2025-11-20T01:37:41Z"
  },
  {
    "title": "Purple Heart recipient and veteran advocate Sgt. Michael Verardo laid to rest with honors at Arlington",
    "description": "U.S. Army Sgt. Michael Verardo was laid to rest at Arlington National Cemetery after surviving two IED blasts in Afghanistan and enduring 120 surgeries over 15 years.",
    "link": "https://www.foxnews.com/us/purple-heart-recipient-veteran-advocate-sgt-michael-verardo-laid-rest-honors-arlington",
    "timestamp": "2025-11-20T01:37:25Z"
  },
  {
    "title": "Trump Signs Bill Ordering Release Of Epstein Files",
    "description": "Trump signed the \"Epstein Files Transparency Act\" into law on XXX, ordering Bondi to make all related unclassified Department of Justice (DOJ) records public.",
    "link": "https://dailycaller.com/2025/11/19/trump-signs-bill-release-epstein-files-doj-pam-bondi-congress/",
    "timestamp": "2025-11-20T01:35:14Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files after fighting it for months",
    "description": "WASHINGTON (AP) — President Donald Trump signed legislation Wednesday that compels his administration to release files on convicted sex offender Jeffrey Epstein, bowing to political pressure from his own party after initially resisting those efforts.",
    "link": "https://apnews.com/article/donald-trump-jeffrey-epstein-justice-department-4872c23a3ed03bf3d4c526581d3aed59",
    "timestamp": "2025-11-20T01:35:00Z"
  },
  {
    "title": "BREAKING: Trump Signs Bill to Release the Epstein Files",
    "description": "President Donald Trump signed a bill to release government files related to his former friend and late sex offender Jeffrey Epstein on Wednesday.\nThe post BREAKING: Trump Signs Bill to Release the Epstein Files first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/breaking-trump-signs-bill-to-release-the-epstein-files/",
    "timestamp": "2025-11-20T01:34:30Z"
  },
  {
    "title": "Donald Trump Says He Has Signed The Bill To Release The Jeffrey Epstein Files",
    "description": "Donald Trump said that he has signed legislation to compel the Justice Department to release investigative files into Jeffrey Epstein. In a Truth Social post, Trump wrote that “I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES! As everyone knows, I ask…",
    "link": "http://deadline.com/2025/11/trump-epstein-files-bill-1236624239/",
    "timestamp": "2025-11-20T01:33:12Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "United States President Donald Trump announced that he has \"just signed\" the bill compelling the Justice Department to release all of its files on Jeffrey Epstein.More to come......",
    "link": "https://biztoc.com/x/060e4d1d2f74a4da",
    "timestamp": "2025-11-20T01:33:04Z"
  },
  {
    "title": "Trump says he signed bill to release Epstein files",
    "description": "US president announces that he has ordered the disclosure of documents related to the late convicted sex offender.",
    "link": "https://www.aljazeera.com/news/2025/11/20/trump-says-he-signed-bill-to-release-epstein-files",
    "timestamp": "2025-11-20T01:32:46Z"
  },
  {
    "title": "Donald Trump Says He Signed Bill to Release Epstein Files",
    "description": "Donald Trump has signed the bill to require the Justice Department to release all unclassified records relating to Jeffrey Epstein. This comes after the bill was put on the House floor Tuesday for a full vote, and it passed 427 to 1 -- sending it…\n Permalink",
    "link": "https://www.tmz.com/2025/11/19/trump-signs-bill-release-epstein-files/",
    "timestamp": "2025-11-20T01:31:15Z"
  },
  {
    "title": "Breaking: Trump signs Epstein files bill into law, triggering 30-day deadline",
    "description": "US President Donald Trump says he has signed off on legislation to force the release of the \"Epstein files\" — the final step required to turn the bill into law.",
    "link": "https://www.abc.net.au/news/2025-11-20/donald-trump-sign-jeffrey-epstein-files-release-bill/106030528",
    "timestamp": "2025-11-20T01:31:07Z"
  },
  {
    "title": "Epstein files to go public as Trump says he signed law authorizing release of records",
    "description": "President Donald Trump signed legislation allowing the Justice Department to release Jeffrey Epstein files, after the House voted 421-1 to approve the measure on Tuesday.",
    "link": "https://www.foxnews.com/politics/epstein-files-go-public-trump-says-he-signed-law-authorizing-release-records",
    "timestamp": "2025-11-20T01:29:05Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files after fighting it for months",
    "description": "The bill requires the Justice Department to release all files and communications related to Epstein.",
    "link": "https://www.denverpost.com/2025/11/19/trump-epstein-files-bill/",
    "timestamp": "2025-11-20T01:28:24Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files after fighting it for months",
    "description": "The bill requires the Justice Department to release all files and communications related to Epstein.",
    "link": "https://www.bostonherald.com/2025/11/19/trump-epstein-files-bill/",
    "timestamp": "2025-11-20T01:28:24Z"
  },
  {
    "title": "Trump signs bill to release Jeffrey Epstein case files after fighting it for months",
    "description": "President Donald Trump has signed a bill. This bill will lead to the release of the Jeffrey Epstein files. The announcement was made on Wednesday. This development is significant. It pertains to sensitive information. The public will soon have access to these…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-bill-to-release-jeffrey-epstein-case-files-after-fighting-it-for-months/articleshow/125450779.cms",
    "timestamp": "2025-11-20T01:27:22Z"
  },
  {
    "title": "Trump signs bill to release Justice Department's Epstein files",
    "description": "The legislation signed by President Trump requires Attorney General Pam Bondi to release all unclassified records related to Jeffrey Epstein within 30 days.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-signs-bill-release-justice-department-jeffrey-epstein-files-rcna244793",
    "timestamp": "2025-11-20T01:27:04Z"
  },
  {
    "title": "Usha Vance Praises Military Families as 'Model for Our Country'",
    "description": "Second lady Usha Vance praised U.S. military families as being a \"model\" for the United States and for her \"own family\" during a visit to Marine Corps Base Camp Lejune in Jacksonville, North Carolina.\nThe post Usha Vance Praises Military Families as ‘Model fo…",
    "link": "https://www.breitbart.com/politics/2025/11/19/usha-vance-praises-military-families-model/",
    "timestamp": "2025-11-20T01:25:22Z"
  },
  {
    "title": "Steph Curry Controls His Destiny After Under Armour Split",
    "description": "When Steph Curry signed with Under Armour in 2013, he became the face of the company. He could have chosen other bigger brands, such as Nike, where high-profile athletes have previously had massive success (and where he was previously signed to). Instead, he …",
    "link": "https://theleadsm.com/steph-curry-controls-his-destiny-after-under-armour-split/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=steph-curry-controls-his-destiny-after-under-armour-split",
    "timestamp": "2025-11-20T01:24:34Z"
  },
  {
    "title": "Trump signs bill approving release of Epstein files",
    "description": "Donald Trump has signed a bill approving the release of files relating to Jeffrey Epstein by the US Justice Department.",
    "link": "https://news.sky.com/story/trump-signs-bill-approving-release-of-epstein-files-13472976",
    "timestamp": "2025-11-20T01:23:00Z"
  },
  {
    "title": "Trump considering executive order to preempt state AI laws",
    "description": "President Trump is considering an executive order to preempt state AI laws through federal lawsuits and by withholding funding. The draft order would task the Attorney General with challenging state regulations and the Commerce Department with reviewing them.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-considering-executive-order-to-preempt-state-ai-laws/articleshow/125450715.cms",
    "timestamp": "2025-11-20T01:17:52Z"
  },
  {
    "title": "미·중 AI 경쟁 속 엔비디아 3분기 실적 발표",
    "description": "Goldman Sachs Group Inc. Chief Executive Officer David Solomon lent his support to the bank’s general counsel after the release of emails showing her close relationship with convicted sex offender Jeffrey Epstein. https://t.co/K39XEI4BAe— Bloomberg (@business…",
    "link": "https://ryueyes11.tistory.com/511976",
    "timestamp": "2025-11-20T01:15:42Z"
  },
  {
    "title": "Trump Makes Vaguely Threatening Joke About Firing His Treasury Secretary",
    "description": "Trump added he'd also \"love to fire\" Jerome Powell, ramping up his attacks on the Federal Reserve chair.",
    "link": "https://www.huffpost.com/entry/trump-scott-bessent-interest-rates_n_691e4eede4b0b763ab8da326",
    "timestamp": "2025-11-20T01:12:13Z"
  },
  {
    "title": "Trump to focus on ending Sudan civil war",
    "description": "US President Trump says he's ready to push for an end to the war in Sudan. During his trip to Washington, Saudi Crown Prince Mohammad bin Salman asked the president to help bring peace to the African country. United States President Donald Trump said on Wedne…",
    "link": "https://www.dw.com/en/trump-to-focus-on-ending-sudan-civil-war/a-74814230",
    "timestamp": "2025-11-20T01:10:00Z"
  },
  {
    "title": "Sudan: Trump says intends to focus on ending civil war",
    "description": "US President Trump says he's ready to push for an end to the war in Sudan. During his trip to Washington, Saudi Crown Prince Mohammad bin Salman asked the president to help bring peace to the African country. United States President Donald Trump said on Wedne…",
    "link": "https://www.dw.com/en/sudan-trump-says-intends-to-focus-on-ending-civil-war/a-74814230",
    "timestamp": "2025-11-20T01:10:00Z"
  },
  {
    "title": "G20 countries' medium-term growth to be weakest since 2009 crisis, IMF says",
    "description": "The International Monetary Fund predicts the world's top 20 economies will see their slowest growth since 2009. Protectionism and policy uncertainty are major concerns. Advanced economies face a 1.4% growth forecast for 2030. Emerging markets are expected to …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g20-countries-medium-term-growth-to-be-weakest-since-2009-crisis-imf-says/articleshow/125450682.cms",
    "timestamp": "2025-11-20T01:07:13Z"
  },
  {
    "title": "CNBC Daily Open: Nvidia CEO suggests AI doesn't look like a bubble",
    "description": "Regardless of what the AI industry might look like in the future, from investors' perspectives, Nvidia's earnings are clearly something to cheer for today.",
    "link": "https://www.cnbc.com/2025/11/20/cnbc-daily-open-nvidia-ceo-suggests-ai-doesnt-look-like-a-bubble.html",
    "timestamp": "2025-11-20T01:04:59Z"
  }
]