[
  {
    "title": "Trump's Advisers Disagree on Possible US Strikes on Iran - Reports",
    "description": "There is no full agreement among US President Donald Trump's closest advisers on possible ​​US participation in the Israeli operation against Iran and its nuclear facilities, the CBS News broadcaster reported on Tuesday.",
    "link": "https://sputnikglobe.com/20250618/trumps-advisers-disagree-on-possible-us-strikes-on-iran---reports-1122276004.html",
    "timestamp": "2025-06-18T03:39:00Z"
  },
  {
    "title": "IAF conducts overnight strikes in Tehran",
    "description": "IDF announces that the IAF is conducting strikes in Tehran. According to reports in Iran, Israel targeted Imam Hussein University, which is linked to the Revolutionary Guards. Earlier, Iran fired 25 missiles in two salvos.",
    "link": "https://www.israelnationalnews.com/news/410211",
    "timestamp": "2025-06-18T03:35:07Z"
  },
  {
    "title": "Tucker Carlson Tears Into Ted Cruz In The Most Gloriously Awkward Interview You'll See",
    "description": "The right-wing media personality got into a shouting match with the Republican senator from Texas.",
    "link": "https://www.huffpost.com/entry/tucker-carlson-ted-cruz_n_68521bdde4b038d013e2b23f",
    "timestamp": "2025-06-18T03:32:19Z"
  },
  {
    "title": "Iran says hypersonic missiles fired at Israel as Trump demands 'unconditional surrender'",
    "description": "Iran claimed early Wednesday to have fired hypersonic missiles at Israel in the latest round of overnight strikes between the archfoes, hours after Donald Trump demanded the Islamic republic's \"unconditional surrender\". Back in Washington on Tuesday, Trump de…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-says-hypersonic-missiles-fired-at-israel-as-trump-demands-unconditional-surrender/articleshow/121921751.cms",
    "timestamp": "2025-06-18T03:29:49Z"
  },
  {
    "title": "Did not have any proof of Iran's effort to move into a nuclear weapon: IAEA Chief",
    "description": "Amid escalating tensions between Iran and Israel, the IAEA Director-General stated they lack proof of Iran pursuing nuclear weapons. This contrasts with reports citing Israeli intelligence suggesting Iran's advanced nuclear weapon design experiments. The US S…",
    "link": "https://economictimes.indiatimes.com/news/defence/did-not-have-any-proof-of-irans-effort-to-move-into-a-nuclear-weapon-iaea-chief/articleshow/121921748.cms",
    "timestamp": "2025-06-18T03:29:35Z"
  },
  {
    "title": "Macron: Violent regime change in Iran would be a mistake",
    "description": "French President says he opposes violent regime change in Iran, warning it would lead to chaos and regional destabilization. His remarks come amidst fears of potential US involvement in Israel's military campaign against Iran.",
    "link": "https://www.israelnationalnews.com/news/410210",
    "timestamp": "2025-06-18T03:24:12Z"
  },
  {
    "title": "Japan's auto exports to US drop after tariffs",
    "description": "TOKYO: Japanese auto exports to the United States fell almost a quarter in May, data showed on Wednesday (Jun 18), as worries over Donald Trump's tariffs continue to grow with no deal yet made between Tokyo and Washington. Roughly 8 per cent of jobs are tied …",
    "link": "https://www.channelnewsasia.com/east-asia/japan-auto-exports-us-donald-trump-tariffs-5188726",
    "timestamp": "2025-06-18T03:23:00Z"
  },
  {
    "title": "Pharma scrips fall on Trump tariff threat",
    "description": "India Business News: Pharmaceutical stocks in India fell sharply following US President Donald Trump’s announcement of potential tariffs on the sector. Key companies like Granules India and Lupin faced significant losses as concerns over revenue impact surfac…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/pharma-scrips-fall-on-trump-tariff-threat/articleshow/121921627.cms",
    "timestamp": "2025-06-18T03:21:27Z"
  },
  {
    "title": "Long India narrative continues but global investors turning impatient: Taimur Baig, DBS Bank",
    "description": "Taimur Baig from DBS Bank discusses the global economy. He says the oil market can handle Middle East tensions. Oil prices are below historical highs. Investors are optimistic about India's growth. They want faster economic progress. The US and UK may sign tr…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/long-india-narrative-continues-but-global-investors-turning-impatient-taimur-baig-dbs-bank/articleshow/121911373.cms",
    "timestamp": "2025-06-18T03:21:00Z"
  },
  {
    "title": "NYC Comptroller Lander: Trump Ratcheting Up Conflict to Turn U.S. into 'Police State'",
    "description": "New York City Comptroller and mayoral candidate Brad Lander said Tuesday on MSNBC's \"All In\" his arrest by Immigration and Customs Enforcement (ICE) agents in Manhattan was part of an attempt by President Donald Trump to turn the United States into a \"police …",
    "link": "https://www.breitbart.com/clips/2025/06/17/nyc-comptroller-lander-trump-ratcheting-up-conflict-to-turn-u-s-into-police-state/",
    "timestamp": "2025-06-18T03:16:54Z"
  },
  {
    "title": "US Senate passes stablecoin bill in milestone for crypto industry",
    "description": "Stablecoins, a type of cryptocurrency designed to maintain a constant value, usually a 1:1 dollar peg, are commonly used by crypto traders to move funds between tokens. Their use has grown rapidly in recent years, and proponents say that they could be used to…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-senate-passes-stablecoin-bill-in-milestone-for-crypto-industry/articleshow/121921606.cms",
    "timestamp": "2025-06-18T03:15:29Z"
  },
  {
    "title": "Trump Demands Iran's 'Unconditional Surrender' — Stock Futures Remain Steady, Defense Shares Trade Higher In After-Hours Trading",
    "description": "U.S. stock futures remain unfazed by President Donald Trump’s calls for an “Unconditional Surrender” by Iran on Tuesday night, as tensions continued to flare in the Middle East.\nStarting with the S&P 500 Futures, which trades at 6,045.00, up 0.11%, followed b…",
    "link": "https://biztoc.com/x/22e59f0391f1519d",
    "timestamp": "2025-06-18T03:14:24Z"
  },
  {
    "title": "How woke doomed Dems on the border",
    "description": "The Biden-era explosion in illegal immigration was a direct consequence of Peak Woke: Democrats, overly responsive to fringe activists, advocated for loosening immigration restrictions to avoid cancel-culture mobs and countersignal Donald Trump. Now, amid Tru…",
    "link": "https://biztoc.com/x/2118a4b68ce99f1f",
    "timestamp": "2025-06-18T03:14:12Z"
  },
  {
    "title": "Oil prices spike, US stocks fall on Israel-Iran crisis",
    "description": "Crude oil prices jump more than 4 percent amid fears the US may join Israel's offensive against Iran.",
    "link": "https://www.aljazeera.com/economy/2025/6/18/oil-prices-spike-us-stocks-fall-on-israel-iran-crisis",
    "timestamp": "2025-06-18T03:10:44Z"
  },
  {
    "title": "Israel launches intensive airstrikes targeting Iranian capital",
    "description": "Intense Israeli airstrikes targeted Iran's capital early Wednesday after it issued a warning about a new area it could target, a day after U.S. President Donald Trump warned Tehran's residents to evacuate and demanded that the country surrender without condit…",
    "link": "https://www.cbc.ca/news/world/intensive-israel-strikes-tehran-1.7564119",
    "timestamp": "2025-06-18T03:01:02Z"
  },
  {
    "title": "Nezza says she doesn't regret National Anthem in Spanish at Dodger Stadium",
    "description": "After Nezza sang the National Anthem in Spanish at Dodger Stadium on Saturday, the singer said she'd do it again, \"a million times.\"",
    "link": "https://www.foxla.com/news/nezza-says-she-doesnt-regret-national-anthem-spanish-dodger-stadium",
    "timestamp": "2025-06-18T03:00:39Z"
  },
  {
    "title": "Oil Stabilises After Surge, Stocks Drop As Mideast Crisis Fuels Jitters",
    "description": "Oil prices stabilised Wednesday after surging the previous day on fears of a US intervention in the Israel-Iran conflict sparked by Donald Trump calling for Tehran's \"unconditional surrender\".",
    "link": "https://www.ibtimes.com/oil-stabilises-after-surge-stocks-drop-mideast-crisis-fuels-jitters-3776050",
    "timestamp": "2025-06-18T03:00:24Z"
  },
  {
    "title": "Tucker Carlson Confronts Ted Cruz on Iran: 'You Don't Know Anything'",
    "description": "Tucker Carlson grilled Ted Cruz about Iran, telling the Texas Republican at one point that he doesn't \"know anything\" about the country.",
    "link": "https://www.newsweek.com/tucker-carlson-ted-cruz-iran-israel-trump-maga-2087084",
    "timestamp": "2025-06-18T02:58:03Z"
  },
  {
    "title": "Oil stabilises after surge, stocks drop as Mideast crisis fuels jitters",
    "description": "Oil prices stabilised Wednesday after surging the previous day on fears of a US intervention in the Israel-Iran conflict sparked by Donald Trump calling for Tehran’s “unconditional surrender”. Iran and Israel exchanged missiles for a sixth day, with the US pr…",
    "link": "https://www.digitaljournal.com/world/oil-stabilises-after-surge-stocks-drop-as-mideast-crisis-fuels-jitters/article",
    "timestamp": "2025-06-18T02:57:32Z"
  },
  {
    "title": "US Fed set to hold rates steady as it guards against inflation",
    "description": "The US central bank is expected to hold interest rates steady Wednesday after its key policy meeting, as officials gauge the impact of tariffs on inflation — and despite President Donald Trump’s calls for rate cuts. The Federal Reserve has kept the benchmark …",
    "link": "https://www.digitaljournal.com/world/us-fed-set-to-hold-rates-steady-as-it-guards-against-inflation/article",
    "timestamp": "2025-06-18T02:57:32Z"
  },
  {
    "title": "Hugh Hewitt Says Striking One Or More Parts Of Iran ‘Will Secure’ Trump’s ‘Place In History As A Peacemaker’",
    "description": "Hugh Hewitt said he believes if President Donald Trump were to destroy Iran's nuclear program then he would \"secure his place in history as a peacemaker.\"",
    "link": "https://dailycaller.com/2025/06/17/hugh-hewitt-iran-israel-war-donald-trump-nuclear-program/",
    "timestamp": "2025-06-18T02:55:56Z"
  },
  {
    "title": "Dear Democrats: I Won't Let You Exhaust Me With Your Diaper-Filling Tantrums",
    "description": "It's pretty safe to say that the Democratic Party's response to all things Trump since 2016 has made the party irredeemable. Conservatives of a certain age (\"Present\") have long talked about the kinds of Democrats we used to know. There was a wistfulness ther…",
    "link": "https://freerepublic.com/focus/f-news/4323723/posts",
    "timestamp": "2025-06-18T02:54:58Z"
  },
  {
    "title": "Clay Travis Rips Ilhan Omar: ‘Why Doesn’t She Go Back to Somalia?’",
    "description": "Clay Travis suggested that Rep. Ilhan Omar should \"go back to Somalia\" after the congresswoman said the United States was becoming \"one of the worst countries.\"\nThe post Clay Travis Rips Ilhan Omar: ‘Why Doesn’t She Go Back to Somalia?’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/clay-travis-rips-ilhan-omar-why-doesnt-she-go-back-to-somalia/",
    "timestamp": "2025-06-18T02:52:37Z"
  },
  {
    "title": "US Military Action On Iran? Odds Rise On Crypto Betting Site Polymarket As Trump Demands 'Unconditional Surrender'",
    "description": "Cryptocurrency bettors on Polymarket were growing confident that the U.S. would take military action against Iran as President Donald Trump demanded \"unconditional surrender.\"\nWhat happened: The odds for the betting contract titled \"US military action against…",
    "link": "https://biztoc.com/x/97edf2d62ae07b50",
    "timestamp": "2025-06-18T02:51:34Z"
  },
  {
    "title": "The Death Of Privacy And The Radical Reshaping Of A Political System",
    "description": "Elon Musk's name will go down in history, not as the man who got us into space, but the man to helped to reshape the U.S. government into a surveillance state.",
    "link": "https://www.forbes.com/sites/hessiejones/2025/06/17/the-death-of-privacy-and-the-radical-reshaping-of-a-political-system/",
    "timestamp": "2025-06-18T02:50:00Z"
  },
  {
    "title": "Signs to police 'negative' history went up at Manzanar. Historians are nervous. (Olivia Hebert/SFGATE)",
    "description": "Olivia Hebert / SFGATE:\nSigns to police ‘negative’ history went up at Manzanar.  Historians are nervous.  —  On the orders of the Donald Trump administration, National Park Service employees hung two highly controversial signs this week at Manzanar National H…",
    "link": "https://www.memeorandum.com/250617/p178",
    "timestamp": "2025-06-18T02:50:00Z"
  },
  {
    "title": "NYT's Maggie Haberman 'struck' as Trump contradicts his own spy chief",
    "description": "New York Times reporter Maggie Haberman said she was “struck” by how President Donald Trump not only dismissed his own intelligence chief’s analysis on Iran’s nuclear activity – but also leaned entirely on his personal opinion.Appearing on The Source with Kai…",
    "link": "https://www.rawstory.com/trump-iran-2672388692/",
    "timestamp": "2025-06-18T02:48:54Z"
  },
  {
    "title": "Kremlin urges diplomacy: Israeli strikes on Iran 'unacceptable'",
    "description": "Russia's Foreign Ministry denounces Israeli attacks on Iran's nuclear sites as \"illegal\" and a threat to global security, urging diplomacy to resolve the nuclear dispute.",
    "link": "https://www.israelnationalnews.com/news/410209",
    "timestamp": "2025-06-18T02:47:21Z"
  },
  {
    "title": "Incredulous Tucker Carlson Has Shouting Match With Ted Cruz Over Basic Iran Facts: ‘You’re Calling for the Overthrow’ | Video",
    "description": "The former Fox News host argues with the Texas Senator over military action against Iran\nThe post Incredulous Tucker Carlson Has Shouting Match With Ted Cruz Over Basic Iran Facts: ‘You’re Calling for the Overthrow’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/tucker-carlson-argues-with-ted-cruz-about-iran/",
    "timestamp": "2025-06-18T02:46:12Z"
  },
  {
    "title": "Texas Defunds Border Wall Construction After Spending More Than $3 Billion to Build 65 Mile",
    "description": "The Texas Legislature cancelled the state’s program to build its own border wall as the legislative session came to a close, having spent more than $3 billion to build only about 65 miles of scattered segments. In December 2021, Texas Gov. Greg Abbott (R) ann…",
    "link": "https://freerepublic.com/focus/f-chat/4323719/posts",
    "timestamp": "2025-06-18T02:43:38Z"
  },
  {
    "title": "US Senate approves GENIUS Act to regulate stablecoins; bill moves to house",
    "description": "US Senate passed the “GENIUS Act” (68-30) to create a regulatory framework for stablecoins. The bill requires stablecoins to be backed by liquid assets and issuers to disclose reserves monthly. This is a major milestone for the crypto industry, which has long…",
    "link": "https://coinjournal.net/news/us-senate-approves-genius-act-to-regulate-stablecoins-bill-moves-to-house/",
    "timestamp": "2025-06-18T02:42:54Z"
  },
  {
    "title": "Iran cannot have a nuclear weapon: US State Department describes Trump as transparent, clear leader",
    "description": "Addressing a press briefing, US State Department Spokesperson Tammy Bruce said that President Donald Trump's commitment to preventing Iran from acquiring nuclear capabilities is a policy consistent since taking office.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-cannot-have-a-nuclear-weapon-us-state-department-describes-trump-as-transparent-clear-leader/articleshow/121921057.cms",
    "timestamp": "2025-06-18T02:42:40Z"
  },
  {
    "title": "Cruz: We Can Destroy Nuke Facility Israel Has Challenge With, It's in Our Interests to Do So",
    "description": "On Tuesday’s broadcast of the Fox News Channel’s “Hannity,” Sen. Ted Cruz (R-TX) stated that American bunker-buster bombs can take out the Fordow Iran nuclear facility, which is the only location where Israel has “a technological challenge” and “it is\nThe pos…",
    "link": "https://www.breitbart.com/clips/2025/06/17/cruz-we-can-destroy-nuke-facility-israel-has-challenge-with-its-in-our-interests-to-do-so/",
    "timestamp": "2025-06-18T02:41:07Z"
  },
  {
    "title": "Tucker Carlson grills Ted Cruz on Iran, highlighting conservative rift",
    "description": "The contentious interview is drawing more attention to the divide between conservatives on military action in the country.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/17/tucker-carlson-ted-cruz-iran-donald-trump-regime/84252622007/",
    "timestamp": "2025-06-18T02:41:04Z"
  },
  {
    "title": "Trump \"Reamed Out\" Pete Hegseth for Disastrous Military Parade (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nTrump “Reamed Out” Pete Hegseth for Disastrous Military Parade … Donald Trump was not impressed by his multimillion-dollar military parade.  —  The president reportedly “reamed” out Defense Secretary Pete Hegseth over…",
    "link": "https://www.memeorandum.com/250617/p177",
    "timestamp": "2025-06-18T02:40:01Z"
  },
  {
    "title": "Head of world’s largest bureaucracy literally cannot manage a military parade",
    "description": "Putting an alcoholic B-tier Fox News host in charge of the Pentagon seemed like a great idea, but the results appear to be disappointing to the president: Donald Trump was not impressed by his multimillion-dollar military parade. The president reportedly “rea…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/head-of-worlds-largest-bureaucracy-literally-cannot-manage-a-military-parade",
    "timestamp": "2025-06-18T02:36:50Z"
  },
  {
    "title": "Elon Musk's X sues New York to block social media hate speech law",
    "description": "New York Attorney General Letitia James, a Democrat who enforces the state's laws, is the named defendant in X's lawsuit. Her office did not immediately respond to requests for comment. Musk, the world's richest person and recently a close adviser to Republic…",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musks-x-sues-new-york-to-block-social-media-hate-speech-law/articleshow/121920895.cms",
    "timestamp": "2025-06-18T02:34:07Z"
  },
  {
    "title": "South African President Ramaphosa Fails to Meet Trump at G7 in Canada",
    "description": "South African President Cyril Ramaphosa traveled to Kananaskis, Alberta, Canada, for the G7 Summit, in the hopes of meeting President Donald Trump, but failed to do so before Trump returned to the United States.\nThe post South African President Ramaphosa Fail…",
    "link": "https://www.breitbart.com/africa/2025/06/17/south-african-president-ramaphosa-fails-to-meet-trump-at-g7-canada/",
    "timestamp": "2025-06-18T02:31:51Z"
  },
  {
    "title": "Mark Cuban Criticizes Bluesky, Gets Welcome Back On X By CEO Yaccarino: 'Welcome Home To The True Global Town Square'",
    "description": "Billionaire Mark Cuban has been one of the largest proponents of social media platform Bluesky, which has grown its user base as an alternative to X. Cuban's...",
    "link": "https://finance.yahoo.com/news/mark-cuban-criticizes-bluesky-gets-023133214.html",
    "timestamp": "2025-06-18T02:31:33Z"
  },
  {
    "title": "ICE arrests New York mayoral candidate for alleged assault",
    "description": "Brad Lander's arrest for the alleged assault of a federal officer is the latest confrontation between US ICE agents and Democratic politicians.",
    "link": "https://www.abc.net.au/news/2025-06-18/ice-arrests-nyc-comptroller-brad-lander-at-court-hearing/105430922",
    "timestamp": "2025-06-18T02:29:06Z"
  },
  {
    "title": "Ilhan Omar claims US turning into one of ‘worst countries’ in the world",
    "description": "The 'Squad' member said America was being destroyed by Trump.",
    "link": "https://nypost.com/2025/06/17/media/ilhan-omar-claims-us-turning-into-one-of-worst-countries-in-the-world/",
    "timestamp": "2025-06-18T02:26:14Z"
  },
  {
    "title": "Dollar wobbles as investors monitor Israel-Iran conflict ahead of Fed decision",
    "description": "The U.S. dollar wavered against most major currencies on Wednesday, as fighting between Israel and Iran left investors nervous ahead of a keenly awaited Federal Reserve decision on interest rates later in the day.Israel has pounded Iran over the past six days…",
    "link": "https://www.channelnewsasia.com/business/dollar-wobbles-investors-monitor-israel-iran-conflict-ahead-fed-decision-5188646",
    "timestamp": "2025-06-18T02:25:26Z"
  },
  {
    "title": "Dollar steady as investors monitor Israel-Iran conflict ahead of Fed",
    "description": "The U.S. dollar held on to gains against major currencies early on Wednesday, buoyed by demand for safety as conflict between Israel and Iran kept investors on edge ahead of a Federal Reserve decision on interest rates later in the day.Israel has pounded Iran…",
    "link": "https://www.channelnewsasia.com/business/dollar-steady-investors-monitor-israel-iran-conflict-ahead-fed-5188646",
    "timestamp": "2025-06-18T02:25:26Z"
  },
  {
    "title": "Dollar steady as investors monitor Israel-Iran conflict ahead of Fed",
    "description": "(Reuters) -The U.S. dollar held on to gains against major currencies early on Wednesday, buoyed by demand for safety as conflict between Israel and Iran kept...",
    "link": "https://finance.yahoo.com/news/dollar-steady-investors-monitor-israel-022526718.html",
    "timestamp": "2025-06-18T02:25:26Z"
  },
  {
    "title": "Padilla: Trump's Immigration Raids Are a 'Clear Partisan Political Attack'",
    "description": "Senator Alex Padilla (D-CA) said Tuesday on MSNBC's \"The Weeknight\" that President Donald Trump's immigration raids in blue cities were a \"clear partisan political attack.\"\nThe post Padilla: Trump’s Immigration Raids Are a ‘Clear Partisan Political Attack’ ap…",
    "link": "https://www.breitbart.com/clips/2025/06/17/padilla-trumps-immigration-raids-are-a-clear-partisan-political-attack/",
    "timestamp": "2025-06-18T02:22:57Z"
  },
  {
    "title": "Trump’s Posture On Israel-Iran War Appears To Reflect His Voters’ Views",
    "description": "Many 2024 Donald Trump voters appear to line up with his support of Israel against Iran while calling for limits, according to polling data.",
    "link": "https://dailycaller.com/2025/06/17/trump-israel-iran-voters-support-weapons-intel-oppose-boots-ground/",
    "timestamp": "2025-06-18T02:22:27Z"
  },
  {
    "title": "Donald Trump to again extend TikTok's reprieve from US ban",
    "description": "Trump, who issued similar delays in January and in April, has given TikTok an unexpected lifeline after its future in the United States appeared to be doomed. The president tried to ban TikTok in his first term but flipped his stance on the app last year -- a…",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-to-again-extend-tiktoks-reprieve-from-us-ban/articleshow/121920700.cms",
    "timestamp": "2025-06-18T02:22:08Z"
  },
  {
    "title": "Trump will push TikTok sale deadline another 90 days",
    "description": "President Donald Trump will grant the popular short-video app TikTok another temporary reprieve so it has time to find a buyer to remain operating in the U.S., according to the White House today. The app, owned by Chinese tech giant ByteDance Ltd., has been a…",
    "link": "https://siliconangle.com/2025/06/17/trump-will-push-tiktok-sale-deadline-another-90-days/",
    "timestamp": "2025-06-18T02:21:50Z"
  },
  {
    "title": "Trump will push TikTok deadline another 90 days",
    "description": "President Donald Trump will grant the popular short-video app TikTok another temporary reprieve so it has time to find a buyer to remain operating in the U.S., according to the White House today. The app, owned by Chinese tech giant ByteDance Ltd., has been a…",
    "link": "https://siliconangle.com/2025/06/17/trump-will-push-tiktok-deadline-another-90-days/",
    "timestamp": "2025-06-18T02:21:50Z"
  },
  {
    "title": "Made In Vietnam: Hanoi Cracks Down On Fake Goods As US Tariffs Loom",
    "description": "Since the United States accused Vietnam of being a hub for counterfeit goods, Tran Le Chi has found it increasingly hard to track down her favourite fake Chanel T-shirts, Gucci sunglasses and Louis Vuitton handbags.",
    "link": "https://www.ibtimes.com.au/made-vietnam-hanoi-cracks-down-fake-goods-us-tariffs-loom-1859263",
    "timestamp": "2025-06-18T02:21:16Z"
  },
  {
    "title": "Made In Vietnam: Hanoi Cracks Down On Fake Goods As US Tariffs Loom",
    "description": "Since the United States accused Vietnam of being a hub for counterfeit goods, Tran Le Chi has found it increasingly hard to track down her favourite fake Chanel T-shirts, Gucci sunglasses and Louis Vuitton handbags.",
    "link": "https://www.ibtimes.com/made-vietnam-hanoi-cracks-down-fake-goods-us-tariffs-loom-3776048",
    "timestamp": "2025-06-18T02:21:11Z"
  },
  {
    "title": "Texas Defunds Border Wall Construction After Spending More Than $3 Billion to Build 65 Miles",
    "description": "The Texas Legislature cancelled the state's program to build its own border wall as the legislative session came to a close, having spent more than $3 billion to build only about 65 miles of scattered segments.\nThe post Texas Defunds Border Wall Construction …",
    "link": "https://www.mediaite.com/politics/texas-defunds-border-wall-construction-after-spending-more-than-3-billion-to-build-65-miles/",
    "timestamp": "2025-06-18T02:20:00Z"
  },
  {
    "title": "Made in Vietnam: Hanoi cracks down on fake goods as US tariffs loom",
    "description": "Since the United States accused Vietnam of being a hub for counterfeit goods, Tran Le Chi has found it increasingly hard to track down her favourite fake Chanel T-shirts, Gucci sunglasses and Louis Vuitton handbags. As Vietnam’s government tries to head off P…",
    "link": "https://www.digitaljournal.com/world/made-in-vietnam-hanoi-cracks-down-on-fake-goods-as-us-tariffs-loom/article",
    "timestamp": "2025-06-18T02:17:20Z"
  },
  {
    "title": "Icons Collide: Lionel Messi meets with former Ballon d'Or Winner",
    "description": "As the FIFA Club World Cup kicks off in the United States, the tournament is bringing global soccer icons together on American soil. Among them, it appeared the Italian legend, Rob",
    "link": "https://www.marca.com/en/football/fifa-club-world-cup/2025/06/18/68520f9b22601d3e138b45c8.html",
    "timestamp": "2025-06-18T02:17:05Z"
  },
  {
    "title": "EU and Australia to negotiate security and defense partnership",
    "description": "Brussels and Canberra also committed to advancing free-trade negotiations.",
    "link": "https://www.politico.eu/article/eu-and-australia-to-negotiate-security-and-defense-partnership/",
    "timestamp": "2025-06-18T02:16:36Z"
  },
  {
    "title": "Starmer Says US Not Targeting Steel Ownership in Trade Talks",
    "description": "The UK does not need to push out British Steel’s Chinese owners in order to cut a deal to reduce US tariffs on steel, Prime Minister Keir Starmer said.",
    "link": "https://www.livemint.com/companies/news/starmer-says-us-not-targeting-steel-ownership-in-trade-talks-11750212923520.html",
    "timestamp": "2025-06-18T02:15:22Z"
  },
  {
    "title": "Border Patrol Didn’t Release a Single Illegal into the U.S. Last Month",
    "description": "Border Patrol agents didn’t release a single migrant into the US last month — a staggering drop after the Biden administration allowed 62,000 illegal crossers in the country in May 2024, The Post can exclusively reveal. Agents caught 8,725 migrants crossing i…",
    "link": "https://freerepublic.com/focus/f-news/4323716/posts",
    "timestamp": "2025-06-18T02:14:54Z"
  },
  {
    "title": "Los Angeles mayor lifts downtown curfew she imposed during protests against immigration raids",
    "description": "Los Angeles Mayor Karen Bass is lifting a curfew in downtown Los Angeles",
    "link": "https://abcnews.go.com/US/wireStory/los-angeles-mayor-lifts-downtown-curfew-imposed-protests-122943928",
    "timestamp": "2025-06-18T02:14:16Z"
  },
  {
    "title": "Homeland Security Secretary Kristi Noem transported to Washington DC-area hospital after allergic reaction",
    "description": "Homeland Security Secretary Kristi Noem was rushed to a Washington, DC, hospital on Tuesday after experiencing an allergic reaction, according to DHS spokeswoman Tricia McLaughlin. Noem, 53, is reported to be alert and recovering. Her role as Homeland Securit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/homeland-security-secretary-kristi-noem-transported-to-washington-dc-area-hospital-after-allergic-reaction/articleshow/121920510.cms",
    "timestamp": "2025-06-18T02:10:21Z"
  },
  {
    "title": "Trump must show remarkable leadership qualities if he makes the tough call – a preemptive strike on Iran to thwart nuke threat",
    "description": "Preemptive action sometimes works, but it requires remarkable leadership qualities.",
    "link": "https://nypost.com/2025/06/17/opinion/will-president-trump-be-able-to-make-the-tough-call-and-take-preemptive-action-towards-iran/",
    "timestamp": "2025-06-18T02:09:48Z"
  },
  {
    "title": "Albanese should be avoiding Trump like the plague. Why is he (and Australia’s toytown media) chasing him?",
    "description": "Why did Anthony Albanese let his attendance at the G7 meeting become all about Trump, rather than our foreign policy priorities? Voters want him to keep away from Trump, not get closer.\nThe post Albanese should be avoiding Trump like the plague. Why is he (an…",
    "link": "http://www.crikey.com.au/2025/06/18/anthony-albanese-donald-trump-media-g7/",
    "timestamp": "2025-06-18T02:09:18Z"
  },
  {
    "title": "OPINION\nDershowitz: Iran Declared War on the United States — casus belli — on numerous occasions against the United States.",
    "description": "Most recently it was responsible for critically injuring an American soldier. Since Hamas' attack Oct. 7 attack on Israel, estimates run as high as 100 Iranian-backed attacks across the Mideast on U.S. bases, ships, and service personnel. Iran has acted throu…",
    "link": "https://freerepublic.com/focus/f-chat/4323714/posts",
    "timestamp": "2025-06-18T02:07:27Z"
  },
  {
    "title": "Bernie Sanders Slams Israel's 'Illegal' Attack On Iran, Says 'Absolutely Imperative That The United States Not Be Dragged Into This War'",
    "description": "On Tuesday, Sen. Bernie Sanders (I-VT) urged the Donald Trump administration to steer clear of Israel's escalating conflict with Iran, calling Israeli Prime Minister Benjamin Netanyahu's latest actions a direct threat to U.S. diplomacy and international law.\n…",
    "link": "https://biztoc.com/x/8f6fea5b6c17e81f",
    "timestamp": "2025-06-18T02:07:23Z"
  },
  {
    "title": "'Oh My God!': CNN Data Chief Is Stunned By These 'Underwater' GOP Polling Numbers",
    "description": "Harry Enten said he's \"really, really surprised\" by \"rarely\" seen figures illustrating the unpopularity of the president's big, beautiful bill.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-republicans-big-beautiful-bill_n_68520170e4b038d013e2a785",
    "timestamp": "2025-06-18T02:05:27Z"
  },
  {
    "title": "Oil prices extend rise as Iran-Israel conflict enters sixth day",
    "description": "Oil prices edged higher due to concerns that the Iran-Israel conflict might disrupt supplies, particularly through the Strait of Hormuz. The U.S. military is increasing its regional presence amid rising tensions. Market analysts suggest the conflict could pro…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-extend-rise-as-iran-israel-conflict-enters-sixth-day/articleshow/121920520.cms",
    "timestamp": "2025-06-18T02:03:20Z"
  },
  {
    "title": "Video captures Israeli attacks on two Iranian cities",
    "description": "Israeli attacks have targeted Isfahan and Tehran in the fifth night of strikes across the country.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/18/video-captures-israeli-attacks-on-two-iranian-cities",
    "timestamp": "2025-06-18T02:03:13Z"
  },
  {
    "title": "Virginia Democrats choose nominee to challenge GOP Attorney General Jason Miyares",
    "description": "Virginia Democrats selected their attorney general nominee to face Republican Jason Miyares in November, with candidates focused on rejecting President Donald Trump's policies.",
    "link": "https://www.foxnews.com/politics/virginia-democrats-choose-nominee-challenge-gop-attorney-general-jason-miyares",
    "timestamp": "2025-06-18T02:02:20Z"
  },
  {
    "title": "The Government Seized Her Home for a Project That Never Happened",
    "description": "Twenty years after Susette Kelo lost at the Supreme Court, the land where her house once stood is still an empty lot.",
    "link": "https://reason.com/2025/06/18/the-government-seized-her-home-for-a-project-that-never-happened/",
    "timestamp": "2025-06-18T02:02:09Z"
  },
  {
    "title": "Regime change is unlikely to bring democracy to Iran. A more threatening force could fill the vacuum",
    "description": "It is possible for Iranians to hold contempt in their hearts for both their leaders and the foreign powers that would upend their lives.",
    "link": "https://www.abc.net.au/news/2025-06-18/iran-regime-change-israel-scenarios/105430628",
    "timestamp": "2025-06-18T02:02:07Z"
  },
  {
    "title": "Iran Threatens U.S. With \"Devastating\" Response Mar 17, 2025",
    "description": "Salami issued a stark statement, saying any act of aggression against Iran would result in a \"tough, decisive and devastating reaction.\" He also said that Tehran takes full responsibility for its actions and will \"overtly\" acknowledge them when necessary. \"If…",
    "link": "https://freerepublic.com/focus/f-news/4323713/posts",
    "timestamp": "2025-06-18T02:01:11Z"
  },
  {
    "title": "Gold steady as Middle East tensions rise, Fed decision on tap",
    "description": "Gold prices remained stable. This happened as tensions between Israel and Iran continued. A stronger dollar also played a role. Investors are waiting for the U.S. Federal Reserve's policy announcement. The Fed is expected to keep interest rates steady. Focus …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-steady-as-middle-east-tensions-rise-fed-decision-on-tap/articleshow/121920506.cms",
    "timestamp": "2025-06-18T02:01:06Z"
  },
  {
    "title": "Biden: US prepared to use force to stop Iran getting nuclear arms \"prepared to use all elements of its national power\" to stop Iran from getting a nuclear weapon\"",
    "description": "Mr Biden made the declaration with Israel's Prime Minister Yair Lapid on the second day of his visit there.... The US and Israel have long accused Iran of state-sponsored terrorism in the Middle East and further afield. Iran provides funding, training and wea…",
    "link": "https://freerepublic.com/focus/f-chat/4323712/posts",
    "timestamp": "2025-06-18T02:01:05Z"
  },
  {
    "title": "Israeli air force attacking targets near Tehran after Iran launches two barrages of missiles",
    "description": "ISRAEL: Five lightly wounded in Iranian missile barrage Tuesday morning; eight killed Monday morning, one still missing ■ 23 people dead, 631 wounded in Israel since Friday ■ IRAN: Trump says 'we have total control of the skies over Iran,' demands Tehran's 'u…",
    "link": "https://www.haaretz.com/israel-news/2025-06-18/ty-article-live/israeli-air-force-attacking-targets-in-tehran-after-iran-launches-two-barrages-of-missiles/00000197-80bb-d9fe-a597-efbfc6fc0000",
    "timestamp": "2025-06-18T01:59:41Z"
  },
  {
    "title": "How the US has shifted military jets and ships in the Middle East",
    "description": "The U.S. is shifting military aircraft and warships into and around the Middle East to protect Israel from Iranian attacks",
    "link": "https://abcnews.go.com/US/wireStory/us-shifted-military-jets-ships-middle-east-122951880",
    "timestamp": "2025-06-18T01:58:30Z"
  },
  {
    "title": "Indexes end lower as conflict between Israel and Iran adds caution",
    "description": "U.S. stocks declined on Tuesday amid escalating tensions in the Middle East, as the Israel-Iran conflict intensified and the U.S. military increased its presence in the region. Investors also reacted to disappointing U.S. retail sales and factory production d…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/indexes-end-lower-as-conflict-between-israel-and-iran-adds-caution/articleshow/121920476.cms",
    "timestamp": "2025-06-18T01:56:48Z"
  },
  {
    "title": "Carney says Canada, India to reappoint high commissioners in apparent diplomatic thaw",
    "description": "In his closing remarks at the G7 Summit, Carney spoke on a number of crises, including Israel's escalating war with Iran, Russia's invasion of Ukraine and global trade instability",
    "link": "https://nationalpost.com/news/mark-carney-g7-summit-canada-india",
    "timestamp": "2025-06-18T01:56:37Z"
  },
  {
    "title": "G7 leaders fail to reach ambitious joint agreements on key issues after Trump's exit",
    "description": "The G7 summit, overshadowed by global conflicts and Trump's early departure, saw leaders discussing the Russia-Ukraine war and the Israel-Iran tensions. While failing to reach a joint statement on Ukraine due to US opposition, the group pledged to combat non-…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g7-leaders-fail-to-reach-ambitious-joint-agreements-on-key-issues-after-trumps-exit/articleshow/121920470.cms",
    "timestamp": "2025-06-18T01:56:25Z"
  },
  {
    "title": "Trump Announces He Will Be 'Putting Up Two Beautiful' Flagpoles on White House Lawns",
    "description": "President Donald Trump announced on Tuesday that he will be \"putting up two beautiful\" flagpoles on the north and south White House lawns.\nThe post Trump Announces He Will Be ‘Putting Up Two Beautiful’ Flagpoles on White House Lawns appeared first on Breitbar…",
    "link": "https://www.breitbart.com/politics/2025/06/17/trump-announces-two-beautiful-flagpoles-white-house-lawns/",
    "timestamp": "2025-06-18T01:56:18Z"
  },
  {
    "title": "As Trump contemplates Iran, he risks a MAGA meltdown",
    "description": "Donald Trump has made a lot of promises on foreign policy, but perhaps the loudest has been America First. If he breaks it, he will have a MAGA-sized problem.",
    "link": "https://www.abc.net.au/news/2025-06-18/united-states-donald-trump-on-iran-israel-conflict/105427146",
    "timestamp": "2025-06-18T01:55:18Z"
  },
  {
    "title": "A digital dollar is a trade war weapon, and Europe may be a primary target",
    "description": "Stablecoins could serve to entrench the existing tech and monetary order dominated by the U.S., as 95% of them are dollar-denominated. The euro commands less than 1%.",
    "link": "https://www.japantimes.co.jp/commentary/2025/06/18/world/digital-dollar-trade-war-weapon/",
    "timestamp": "2025-06-18T01:55:00Z"
  },
  {
    "title": "Israel-Iran air war enters sixth day, Trump calls for Iran's 'unconditional surrender'",
    "description": "Amid escalating tensions, Iran and Israel exchanged missile strikes, marking the sixth day of their air war. Despite President Trump's call for Iran's surrender and warnings of dwindling U.S. patience, the conflict intensified with explosions reported in both…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-iran-air-war-enters-sixth-day-trump-calls-for-irans-unconditional-surrender/articleshow/121920449.cms",
    "timestamp": "2025-06-18T01:53:32Z"
  },
  {
    "title": "Trade, a sudden exit, Middle East conflict - five takeaways from G7",
    "description": "This year's summit in Canada did not go as planned, but leaders of the world's wealthiest nations still secured some wins.",
    "link": "https://www.bbc.com/news/articles/cpqnjx1qw9po",
    "timestamp": "2025-06-18T01:50:53Z"
  },
  {
    "title": "Trump administration weighs adding 36 countries to travel ban, memo says",
    "description": "President Donald Trump’s administration is considering significantly expanding its travel restrictions by potentially banning citizens of 36 additional countries from entering the United States, according to an internal State Department cable seen by Reuters.…",
    "link": "https://freerepublic.com/focus/f-chat/4323710/posts",
    "timestamp": "2025-06-18T01:49:40Z"
  },
  {
    "title": "Senate passes GENIUS stablecoin bill in a win for the crypto industry",
    "description": "In a 68-30 vote on Tuesday evening, the Senate overwhelmingly passed the GENIUS Act with bipartisan support. Eighteen Democrats joined the majority of Republicans in passing the bill, which is the first to establish a federal regulatory framework for stableco…",
    "link": "https://www.theverge.com/cryptocurrency/688903/genius-act-stablecoin-senate-federal-crypto-regulation",
    "timestamp": "2025-06-18T01:48:00Z"
  },
  {
    "title": "Trump to extend TikTok sale deadline for third time, White House says",
    "description": "U.S. President Donald Trump will extend a June 19 deadline for China-based ByteDance to divest the U.S. assets of short video app TikTok for 90 days despite a law that mandated a sale or shutdown absent significant progress, the White House said on Tuesday.\nT…",
    "link": "https://biztoc.com/x/db78471fa615e860",
    "timestamp": "2025-06-18T01:45:07Z"
  },
  {
    "title": "Donald Trump to extend US TikTok ban deadline, White House says",
    "description": "The app was supposed to be banned in the US after its Chinese owner refused to sell it by a January deadline.",
    "link": "https://www.bbc.co.uk/news/articles/cwyqjepq2e1o",
    "timestamp": "2025-06-18T01:44:47Z"
  },
  {
    "title": "Young white men feel the need to ‘walk on eggshells’ and censor themselves at work — here’s why",
    "description": "Nearly two in three white men aged 18 to 29 — around 12 million guys — feel this way.",
    "link": "https://nypost.com/2025/06/17/lifestyle/white-men-say-theyre-scared-to-speak-at-work-poll/",
    "timestamp": "2025-06-18T01:44:02Z"
  },
  {
    "title": "After Iraq There’s No Excuse for Buying the War Lies About Iran",
    "description": "There is absolutely no excuse for buying into the war propaganda about Iran after what we all saw with Iraq.\n“OMG nuclear weapons!” Shut up, idiot. If you’re a grown adult with internet access still swallowing this load of bull …\nThe post After Iraq There’s N…",
    "link": "https://www.globalresearch.ca/no-excuse-buying-war-lies-iran/5891379",
    "timestamp": "2025-06-18T01:42:38Z"
  },
  {
    "title": "Conservative Louisiana state Sen. Blake Miguez announces bid to run for US Sen. Bill Cassidy’s seat",
    "description": "Louisiana state Sen. Blake Miguez, a conservative Republican, has officially launched his bid to run for U.S. Senate in 2026",
    "link": "https://abcnews.go.com/Politics/wireStory/conservative-louisiana-state-sen-blake-miguez-announces-bid-122953746",
    "timestamp": "2025-06-18T01:42:29Z"
  },
  {
    "title": "US Fed Set To Hold Rates Steady As It Guards Against Inflation",
    "description": "The US central bank is expected to hold interest rates steady Wednesday after its key policy meeting, as officials gauge the impact of tariffs on inflation -- and despite President Donald Trump's calls for rate cuts.",
    "link": "https://www.ibtimes.com/us-fed-set-hold-rates-steady-it-guards-against-inflation-3776040",
    "timestamp": "2025-06-18T01:42:27Z"
  },
  {
    "title": "US Fed set to hold rates steady as it guards against inflation",
    "description": "The US central bank is expected to hold interest rates steady Wednesday after its key policy meeting, as officials gauge the impact of tariffs on inflation -...",
    "link": "https://finance.yahoo.com/news/us-fed-set-hold-rates-013814990.html",
    "timestamp": "2025-06-18T01:38:14Z"
  },
  {
    "title": "Donald Trump, the anti-war candidate",
    "description": "With the help of the electorate's short memories, Trump was able to sell himself as a peacemaker. It didn't last.\nThe post Donald Trump, the anti-war candidate appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/18/donald-trump-anti-war-israel-iran-war/",
    "timestamp": "2025-06-18T01:38:02Z"
  },
  {
    "title": "Gavin Newsom's Dishonest Anti-Trump, ICE Op-Ed Debunked",
    "description": "California Gov. Gavin Newsom (D) denounced the Immigration and Customs Enforcement (ICE) raids in Los Angeles in a Tuesday op-ed for Fox News Digital, arguing that they are being carried out by \"an administration that believes in cruelty and intimidation.\"\nTh…",
    "link": "https://www.breitbart.com/immigration/2025/06/17/gavin-newsoms-dishonest-anti-trump-ice-op-ed-debunked/",
    "timestamp": "2025-06-18T01:37:20Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,210",
    "description": "Here are the key events on day 1,210 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/6/18/russia-ukraine-war-list-of-key-events-day-1210",
    "timestamp": "2025-06-18T01:37:10Z"
  },
  {
    "title": "Donald Trump tweet from October 2019",
    "description": "The United States has spent EIGHT TRILLION DOLLARS fighting and policing in the Middle East. Thousands of our Great Soldiers have died or been badly wounded. Millions of people have died on the other side. GOING INTO THE MIDDLE EAST IS THE WORST DECISION EVER…",
    "link": "https://freerepublic.com/focus/f-chat/4323708/posts",
    "timestamp": "2025-06-18T01:36:52Z"
  },
  {
    "title": "Bernie Sanders Makes Rare Endorsement In New York City Mayoral Race",
    "description": "The top progressive is the latest prominent lawmaker to give a boost to the Democratic socialist's mayoral campaign.",
    "link": "https://www.huffpost.com/entry/bernie-sanders-zohran-mamdani-new-york-city-mayor_n_6851f691e4b038d013e29ffd",
    "timestamp": "2025-06-18T01:36:47Z"
  },
  {
    "title": "Tucker Carlson yells at MAGA senator: 'You don't know anything about Iran!'",
    "description": "Former Fox News host Tucker Carlson — who's found himself at odds with President Donald Trump and ex-Fox colleagues in recent days — and Sen. Ted Cruz (R-TX) over the senator's knowledge — or perceived lack thereof — of the country he \"seeks to topple.\"Carlso…",
    "link": "https://www.rawstory.com/tucker-carlson-2672388117/",
    "timestamp": "2025-06-18T01:35:15Z"
  }
]