[
  {
    "title": "Retired general blasts Democratic lawmakers' 'irresponsible' video urging troops to refuse 'illegal' orders",
    "description": "Retired Gen. Jack Keane slams Democratic lawmakers as 'reckless' after their controversial video urging troops to refuse 'illegal' orders from Trump.",
    "link": "https://www.foxnews.com/media/retired-general-blasts-democratic-lawmakers-irresponsible-video-urging-troops-refuse-trumps-orders",
    "timestamp": "2025-11-24T18:54:24Z"
  },
  {
    "title": "Chris Cillizza Floats Theory About Why MTG Quit Congress",
    "description": "Chris Cillizza theorized on Friday that Republican Marjorie Taylor Greene is resigning from Congress because she is \"fed up\" with the MAGA movement.",
    "link": "https://dailycaller.com/2025/11/24/chris-cillizza-mtg-quit-resignation/",
    "timestamp": "2025-11-24T18:52:59Z"
  },
  {
    "title": "Poll Shows 70 Percent in US Disapprove of Striking Venezuela as Trump Mulls War",
    "description": "The US has built up the largest military presence in Latin America in decades off the coast of Venezuela.",
    "link": "https://truthout.org/articles/poll-shows-70-percent-in-us-disapprove-of-striking-venezuela-as-trump-mulls-war/",
    "timestamp": "2025-11-24T18:50:55Z"
  },
  {
    "title": "Trump Rages At ‘Sick Wacko’ Rand Paul, Who Condemned His Call to Execute Democrats",
    "description": "President Donald Trump attacked Sen. Rand Paul (R-KY) as a \"sick Wacko\" on Truth Social Monday for disagreeing with his viewpoint on Democratic \"traitors.\"\nThe post Trump Rages At ‘Sick Wacko’ Rand Paul, Who Condemned His Call to Execute Democrats first appea…",
    "link": "https://www.mediaite.com/media/news/trump-rages-at-sick-wacko-rand-paul-who-condemned-his-call-to-execute-democrats/",
    "timestamp": "2025-11-24T18:50:31Z"
  },
  {
    "title": "Trump says he will visit Beijing in April and host China's Xi for a state visit later next year (Associated Press)",
    "description": "Associated Press:\nTrump says he will visit Beijing in April and host China's Xi for a state visit later next year  —  President Donald Trump said he has accepted an invitation from Chinese leader Xi Jinping to visit Beijing in April and that he reciprocated b…",
    "link": "https://www.memeorandum.com/251124/p56",
    "timestamp": "2025-11-24T18:50:01Z"
  },
  {
    "title": "Donald Trump Satisfies 1 Of His Twisted Urges In New AI Dump",
    "description": "The president, who previously enjoyed virtually pooping on his citizens, turned his attention to a matter that has sucked up his rage recently.",
    "link": "https://www.huffpost.com/entry/trump-ai-kelly-slotkin-behind-bars-guy-fawkes_n_69248109e4b0ea2d5e75ccd5",
    "timestamp": "2025-11-24T18:49:59Z"
  },
  {
    "title": "In the Ukraine peace plan, brutal equations are being considered",
    "description": "A detailed look at the 28-point plan — as it has been reported — shows some very minor concessions to Russia. But it mostly contains all the same points that have always been made with more or less force by Moscow.",
    "link": "https://www.abc.net.au/news/2025-11-25/what-we-know-about-the-28-point-plan-for-peace/106046140",
    "timestamp": "2025-11-24T18:49:45Z"
  },
  {
    "title": "Peace plan presented by the US to Ukraine reflects inexperienced, unrealistic handling of a delicate situation",
    "description": "In a war that’s lasted almost four years, a former diplomat says it’s not realistic to say, ‘In the next week, come up with a very complicated peace deal, sign off on it and it’s going to stick.’",
    "link": "https://theconversation.com/peace-plan-presented-by-the-us-to-ukraine-reflects-inexperienced-unrealistic-handling-of-a-delicate-situation-270488",
    "timestamp": "2025-11-24T18:47:24Z"
  },
  {
    "title": "EXCLUSIVE: How Trump Can 'Blow Up the Playbook' to Save Face After 'Quiet, Piggy' Drama... as PR Expert Offers Prez Wild Plan to 'Hijack the Headlines'",
    "description": "Donald Trump's 'Quiet, piggy' comment has taken over social media, but one PR expert thinks he knows how the president can fix everything.",
    "link": "https://radaronline.com/p/trump-next-move-after-quiet-piggy-hijack-headlines-pr-expert/",
    "timestamp": "2025-11-24T18:45:00Z"
  },
  {
    "title": "Pentagon Launches Investigation Into Democrat Mark Kelly After Video Encouraging Military To Defy Trump Orders",
    "description": "The Pentagon is launching an investigation into Sen. Kelly after he appeared in a video encouraging military members to disobey \"unlawful\" orders from the Trump administration",
    "link": "https://dailycaller.com/2025/11/24/pentagon-launches-investigation-into-democrat-mark-kelly-after-video-encouraging-military-to-defy-trump-orders/",
    "timestamp": "2025-11-24T18:44:24Z"
  },
  {
    "title": "After CDC Backpedals on Debunked Autism–Vaccine Link, Doctors Answer Parents’ Top Questions",
    "description": "CDC changed a webpage to suggest vaccines may cause autism, creating confusion among parents. Pediatricians say hundreds of studies have disproven the link.",
    "link": "https://www.today.com/health/disease/cdc-autism-vaccines-pediatricians-react-rcna245631",
    "timestamp": "2025-11-24T18:44:20Z"
  },
  {
    "title": "Charlamagne The God Loved Trump’s ‘Quiet, Piggy,’ ‘Joke’",
    "description": "A new episode of ‘Brilliant Idiots’ addressed one of the biggest controversies of last week",
    "link": "https://www.cracked.com/article_49272_why-couldnt-charlamagne-the-god-just-call-trumps-quiet-piggy-line-what-it-is.html",
    "timestamp": "2025-11-24T18:44:00Z"
  },
  {
    "title": "Pentagon threatens to court-martial senator for ‘illegal orders’ video",
    "description": "Defense Secretary Pete Hegseth has said Sen. Mark Kelly (D-Ariz.) is still subject to military law, “and he knows that.”",
    "link": "http://taskandpurpose.com/news/pentagon-mark-kelly-review/",
    "timestamp": "2025-11-24T18:43:43Z"
  },
  {
    "title": "Volodymyr Zelensky Open to Peace Deal, but Warns: ‘Borders Cannot Be Changed by Force’",
    "description": "Ukrainian President Volodymyr Zelensky said on Monday that his “main problem” with the 28-point peace plan proposed by the United States is that it legally recognizes territory Russia stole from Ukraine by force during the invasion that began in 2022.\nThe pos…",
    "link": "https://www.breitbart.com/europe/2025/11/24/volodymyr-zelensky-open-to-peace-deal-but-warns-borders-cannot-be-changed-by-force/",
    "timestamp": "2025-11-24T18:42:06Z"
  },
  {
    "title": "Health Insurer Stocks Jump On News Obamacare Subsidies To Be Extended",
    "description": "Health insurer stocks rose on news the Trump administration will float an extension of tax credits for those who buy individual coverage under the Affordable Care Act.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/11/24/health-insurer-stocks-rise-on-reports-obamacare-subsidies-to-be-extended/",
    "timestamp": "2025-11-24T18:41:16Z"
  },
  {
    "title": "'Contagion' fears surface as bitcoin crash unsettles financial markets",
    "description": "It's been a wild ride for bitcoin traders in recent months and, after a weekend of crypto and blockchain enthusiasm at a Sydney convention, sceptics continue to flag the risks.",
    "link": "https://www.abc.net.au/news/2025-11-25/cryptocurrency-fears-as-bitcoin-crash-unsettles-market/106044010",
    "timestamp": "2025-11-24T18:40:27Z"
  },
  {
    "title": "$1 lakh H-1B fee isn't protection, but a regulatory sledgehammer that will hurt Americans",
    "description": "A proposed $1 lakh H-1B entry fee, intended to protect American jobs, is instead increasing costs for employers and weakening US competitiveness in tech and healthcare. Data show a decline in unemployment for skilled workers, contradicting the rationale for t…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/1-lakh-h-1b-fee-isnt-protection-but-a-regulatory-sledgehammer-that-will-hurt-americans/articleshow/125548136.cms",
    "timestamp": "2025-11-24T18:40:17Z"
  },
  {
    "title": "Joe Scarborough Outraged At Democratic Senator For Not Going Far Enough To Confirm His Preferred Anti-Trump Narrative",
    "description": "Joe Scarborough unleashed a temper tantrum targeting Democratic Sen. Elissa Slotkin of Michigan over her response to a question on allegedly illegal orders.",
    "link": "https://dailycaller.com/2025/11/24/joe-scarborough-outraged-at-democratic-senator-for-not-going-far-enough-to-confirm-his-preferred-anti-trump-narrative/",
    "timestamp": "2025-11-24T18:40:02Z"
  },
  {
    "title": "Demolition Man: Trump is overturning decades of oppressive modernism — and could Make America Beautiful Again",
    "description": "Donald Trump is on track to become one of our greatest builder-presidents, in line with Thomas Jefferson and Theodore Roosevelt. His critics bemoan his bold initiatives, but Americans are embracing his classical and traditional undertakings. The only real des…",
    "link": "https://nypost.com/2025/11/24/opinion/demolition-man-trump-is-overturning-decades-of-oppressive-modernism-and-could-make-america-beautiful-again/",
    "timestamp": "2025-11-24T18:39:18Z"
  },
  {
    "title": "'Doesn't look good for her': Halligan gets warning she could now be disbarred",
    "description": "Lindsey Halligan could face potential disbarment over her actions in the cases involving President Donald Trump's enemies former FBI director James Comey and New York Attorney General Letitia James, an analyst said Monday. Bradley Moss, a national security at…",
    "link": "https://www.rawstory.com/lindsey-halligan-disbarment-comey-james/",
    "timestamp": "2025-11-24T18:38:51Z"
  },
  {
    "title": "Quad up for rare earths treasure hunt: Why India should be raring to take the lead",
    "description": "Since the Chinese choke on rare earth exports, billions are getting poured into alternative supply sources, technology and deals involving companies as diverse as Apple, Amazon, Daido Steel to ABB and Honda. Indian companies and policy makers need to desperat…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/quad-up-for-rare-earths-treasure-hunt-why-india-should-be-raring-to-take-the-lead/articleshow/125548087.cms",
    "timestamp": "2025-11-24T18:38:20Z"
  },
  {
    "title": "Court complaint alleges Binance founder facilitated payments to Hamas",
    "description": "Changpeng Zhao, the Binance founder recently pardoned by Donald Trump, has been accused in a court complaint filed by relatives of victims of the October 7 attack on Israel of facilitating payments to Hamas.",
    "link": "https://www.finextra.com/newsarticle/46961/court-complaint-alleges-binance-founder-facilitated-payments-to-hamas",
    "timestamp": "2025-11-24T18:38:00Z"
  },
  {
    "title": "Federal judge dismisses mortgage fraud charges against NY AG Letitia James",
    "description": "New York Attorney General Letitia James stands silently during a press conference in October 2025.\n \n\nJudge Cameron McGowan Currie agreed with James that the Trump-picked prosecutor in the case was unlawfully appointed. [ more › ]",
    "link": "https://gothamist.com/news/federal-judge-dismisses-mortgage-fraud-charges-against-ny-ag-letitia-james",
    "timestamp": "2025-11-24T18:36:00Z"
  },
  {
    "title": "Trump’s healthcare plan could be revealed today. Here’s what we know so far",
    "description": "President Donald Trump looks on track to offer a healthcare plan that addresses expiring Obamacare subsidies, the issue that triggered this fall’s record-breaking government shutdown.",
    "link": "https://biztoc.com/x/462b0ba48800eb16",
    "timestamp": "2025-11-24T18:34:25Z"
  },
  {
    "title": "Pentagon Threatens to Court Martial Democrat Who Warned Troops Against Following Illegal Trump Orders",
    "description": "The US Department of Defense on Monday announced it was launching an investigation into a Democratic senator who had participating in a video warning active-duty troops to not follow illegal orders given by President Donald Trump.In a social media post, the D…",
    "link": "https://www.commondreams.org/news/trump-dod-mark-kelly",
    "timestamp": "2025-11-24T18:33:21Z"
  },
  {
    "title": "Breaking: Court dismisses criminal cases against Trump critics",
    "description": "The criminal cases against two high-profile critics of Donald Trump — former FBI director James Comey and New York attorney-general Letitia James — are thrown out of court.",
    "link": "https://www.abc.net.au/news/2025-11-25/james-comey-letitia-james-court-cases-dismissed/106048580",
    "timestamp": "2025-11-24T18:33:04Z"
  },
  {
    "title": "Bitcoin rises to $88K as Trump’s Xi call fuels optimism across markets",
    "description": "Bitcoin rose to $88K after Trumps upbeat call with Xi boosted market sentiment across crypto and equities.\nThe post Bitcoin rises to $88K as Trump’s Xi call fuels optimism across markets appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/bitcoin-breaks-88000-milestone/",
    "timestamp": "2025-11-24T18:30:09Z"
  },
  {
    "title": "CNN Anchor Fact Checks Jamie Raskin Over Wild Defense of Dem Colleague’s Texts With Epstein",
    "description": "CNN's Pamela Brown fact-checked Rep. Jamie Raskin (D-MD) while grilling him over his defense of Rep. Stacey Plaskett's (D-VI) relationship with Jeffrey Epstein.\nThe post CNN Anchor Fact Checks Jamie Raskin Over Wild Defense of Dem Colleague’s Texts With Epste…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchor-fact-checks-jamie-raskin-over-wild-defense-of-dem-colleagues-texts-with-epstein/",
    "timestamp": "2025-11-24T18:30:01Z"
  },
  {
    "title": "GOP investor is entering the Florida governor's race, challenging Trump's pick",
    "description": "Another GOP contender has launched a bid to succeed Republican Gov. Ron DeSantis as Florida’s next governor",
    "link": "https://abcnews.go.com/Politics/wireStory/gop-investor-james-fishback-entering-florida-governors-race-127831513",
    "timestamp": "2025-11-24T18:29:32Z"
  },
  {
    "title": "President Trump Praises Shedeur Sanders' Victorious NFL Start: 'I Told You So!'",
    "description": "On Monday President Trump jumped to his Truth Social account to praise Shedeur Sanders' amazing NFL start, telling the world \"I told you so!\"\nThe post President Trump Praises Shedeur Sanders’ Victorious NFL Start: ‘I Told You So!’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/11/24/president-trump-praises-shedeur-sanders-victorious-nfl-start-i-told-you-so/",
    "timestamp": "2025-11-24T18:29:06Z"
  },
  {
    "title": "'Sanction and punish!' Critics gloat as judge shuts down Trump's 'revenge' prosecutions",
    "description": "A federal judge dismissed the charges against former FBI Director James Comey and New York Attorney General Letitia James after finding President Donald Trump had unlawfully appointed the U.S. attorney who prosecuted them — and the administration instantly be…",
    "link": "https://www.rawstory.com/james-comey-indictment-2674337962/",
    "timestamp": "2025-11-24T18:28:44Z"
  },
  {
    "title": "Trump To Execute All Turkeys Pardoned By Biden's Autopen",
    "description": "WASHINGTON, D.C. — Anguished gobbles were heard throughout the Beltway this morning, after news broke that President Donald Trump would be executing all the turkeys pardoned by former President Joe Biden's autopen.",
    "link": "https://babylonbee.com/news/trump-to-execute-all-turkeys-pardoned-by-bidens-autopen",
    "timestamp": "2025-11-24T18:28:40Z"
  },
  {
    "title": "Comey and James Cases Dismissed Over Halligan’s Invalid Appointment",
    "description": "Comey and James Cases Dismissed Over Halligan’s Invalid Appointmenttalkingpointsmemo.com",
    "link": "http://talkingpointsmemo.com/news/comey-and-james-cases-dismissed-over-halligans-invalid-appointment",
    "timestamp": "2025-11-24T18:26:49Z"
  },
  {
    "title": "Cornish's Bogus Claim on CNN: 1 in 5 Children in U.S. 'Experiencing Hunger Right Now'",
    "description": "hanksgiving week is an obvious time to roll out the liberal media's tradition of exaggerating the hunger problem in America. On CNN This Morning, host Audie Cornish kicked off the segment by claiming: \"One in five children in the US experiencing hunger right …",
    "link": "https://freerepublic.com/focus/f-bloggers/4354361/posts",
    "timestamp": "2025-11-24T18:26:09Z"
  },
  {
    "title": "Nicki Minaj Salutes Trump (Again), Seemingly Shades Jay-Z In The Process",
    "description": "Nicki Minaj has been making it clear who she rocks with and who she doesn't.",
    "link": "https://hiphopwired.com/2921235/nicki-minaj-trump/",
    "timestamp": "2025-11-24T18:25:49Z"
  },
  {
    "title": "It’s Popular, Great for the Economy, and Surprisingly Good for You. Why Is Congress Trying to Ban It?",
    "description": "Lawmakers want to close a so-called hemp loophole. They might blow up a massive industry in the process.",
    "link": "https://slate.com/business/2025/11/weed-hemp-ban-congress-thc-cbd-rand-paul-nancy-mace.html",
    "timestamp": "2025-11-24T18:25:03Z"
  },
  {
    "title": "US judge dismisses charges against James Comey and Letitia James",
    "description": "Ruling found the appointment of Donald Trump ally Lindsey Halligan as prosecutor was unconstitutional",
    "link": "https://biztoc.com/x/fb4e455ae17cf8ef",
    "timestamp": "2025-11-24T18:23:17Z"
  },
  {
    "title": "Trump says he will visit Beijing in April and host China's Xi for a state visit later next year",
    "description": "President Donald Trump will visit Beijing in April. Chinese leader Xi Jinping will visit the US later next year. The leaders spoke by phone about Ukraine, fentanyl, and soybeans. They also discussed Taiwan, with China asserting its claim. Relations between Ch…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-will-visit-beijing-in-april-and-host-chinas-xi-for-a-state-visit-later-next-year/articleshow/125547723.cms",
    "timestamp": "2025-11-24T18:22:28Z"
  },
  {
    "title": "‘Humiliating Defeat!’ Ex-Prosecutor Trashes Trump DOJ’s Bungling of Comey Case on CNN",
    "description": "An ex-prosecutor called out Trump's DOJ after what she billed a \"humiliating defeat\" — as the indictments of James Comey and Letitia James were thrown out.\nThe post ‘Humiliating Defeat!’ Ex-Prosecutor Trashes Trump DOJ’s Bungling of Comey Case on CNN first ap…",
    "link": "https://www.mediaite.com/media/news/humiliating-defeat-ex-prosecutor-trashes-trump-dojs-bungling-of-comey-case-on-cnn/",
    "timestamp": "2025-11-24T18:21:49Z"
  },
  {
    "title": "Judge tosses DOJ lawsuits against James Comey, Letitia James as Trump’s revenge tour falters",
    "description": "The orders make Lindsey Halligan the latest Trump administration prosecutor to be disqualified because of the manner in which they were appointed.",
    "link": "https://fortune.com/2025/11/24/judge-tosses-doj-lawsuits-against-james-comey-letitia-james-trump-revenge/",
    "timestamp": "2025-11-24T18:20:50Z"
  },
  {
    "title": "Nexstar Says Broadcast TV Station Landscape Is ‘Ripe for Regulatory Reform’: ‘The Status Quo Is No Longer Acceptable’",
    "description": "President Donald Trump has expressed opposition to eliminating or raising the FCC’s 39% cap on broadcast station ownership\nThe post Nexstar Says Broadcast TV Station Landscape Is ‘Ripe for Regulatory Reform’: ‘The Status Quo Is No Longer Acceptable’ appeared …",
    "link": "https://www.thewrap.com/nexstar-president-trump-broadcast-tv-station-ownership-cap-response/",
    "timestamp": "2025-11-24T18:20:19Z"
  },
  {
    "title": "President Donald Trump lauds Shedeur Sanders' performance in first career start: 'I told you so!'",
    "description": "Trump is among Sanders' supporters who is taking a victory lap",
    "link": "https://www.cbssports.com/nfl/news/president-donald-trump-shedeur-sanders-browns/",
    "timestamp": "2025-11-24T18:20:02Z"
  },
  {
    "title": "When is the last time Carney spoke to Trump? 'Who cares?' PM says",
    "description": "The prime minister was in Johannesburg, South Africa, taking part in the G20 Leaders' Summit over the weekend. Trump did not attend.",
    "link": "https://nationalpost.com/news/canada/carney-trump-last-spoke",
    "timestamp": "2025-11-24T18:18:05Z"
  },
  {
    "title": "President Trump lauds Shedeur Sanders performance with 'I told you so'",
    "description": "President Donald Trump could not resist the urge to take a victory lap regarding the play of Browns QB Shedeur Sanders in the team's win over the Raiders.",
    "link": "https://www.beaconjournal.com/story/sports/pro/browns/2025/11/24/pres-trump-takes-victory-lap-for-shedeur-sanders-success-in-debut/87449891007/",
    "timestamp": "2025-11-24T18:17:19Z"
  },
  {
    "title": "Mark Kelly faces Pentagon probe after controversial video",
    "description": "The Pentagon announced Monday it has launched an investigation into Democratic Senator Mark Kelly of Arizona following his appearance in a video that encouraged American troops to refuse unlawful orders. The extraordinary move marks a rare instance of the Def…",
    "link": "https://rollingout.com/2025/11/24/mark-kelly-faces-pentagon-probe-video/",
    "timestamp": "2025-11-24T18:17:13Z"
  },
  {
    "title": "The Radicalization of Gen Z",
    "description": "The Radicalization of Gen ZA rootless generation looks for home in dark places.A friend who works with high school students recently said to me, “I overheard a group of boys talking about ‘international Jewry.’” He was in disbelief to hear these seemingly mil…",
    "link": "https://freerepublic.com/focus/f-news/4354359/posts",
    "timestamp": "2025-11-24T18:16:14Z"
  },
  {
    "title": "Deep-pocketed conservative group once at odds with Trump now all-in to 'help him win'",
    "description": "Club for Growth backs Trump's redistricting push with seven-figure campaign to help GOP defend House majority in 2026 midterm elections nationwide.",
    "link": "https://www.foxnews.com/politics/deep-pocketed-conservative-group-once-odds-trump-now-all-in-help-him-win",
    "timestamp": "2025-11-24T18:16:03Z"
  },
  {
    "title": "Drugs sneaked into Ohio prison soaked into the pages of 'Hillbilly Elegy'",
    "description": "Vice President JD Vance's memoir, “Hillbilly Elegy,” has a storied history as a New York Times bestseller, as the then-31-year-old's introduction to the...",
    "link": "https://www.yahoo.com/news/articles/drugs-sneaked-ohio-prison-soaked-181542100.html",
    "timestamp": "2025-11-24T18:15:42Z"
  },
  {
    "title": "Trump, Xi Hold Call As Taiwan Tensions Rise And Trade Talks Stall",
    "description": "President Donald Trump and Chinese President Xi Jinping held a phone call Monday to discuss trade, Taiwan and the ongoing war in Ukraine, according to statements from both governments. \nChina’s Xinhua news agency said Xi stressed that bringing Taiwan under Be…",
    "link": "https://biztoc.com/x/114302bef9e28e17",
    "timestamp": "2025-11-24T18:12:07Z"
  },
  {
    "title": "Mamdani Understands Something About Trump That European Leaders Don't",
    "description": "The spectacle of last week was the meeting between President Donald Trump and New York Mayor-elect Zohran Mamdani, two politicians been going after each other for months. Trump, who had called Mamdani a \"communist lunatic\" during the mayoral election, now dec…",
    "link": "https://biztoc.com/x/d34c65af85975de9",
    "timestamp": "2025-11-24T18:11:52Z"
  },
  {
    "title": "U.S. President Donald Trump touts 'very good' call with China's Xi Jinping",
    "description": "USA-CHINA-Trump touts 'very good' call with China's Xi",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/u-s-president-donald-trump-touts-very-good-call-with-chinas-xi-jinping/articleshow/125547359.cms",
    "timestamp": "2025-11-24T18:11:50Z"
  },
  {
    "title": "Utter Defeat: Only 8% Say Democrats 'Won' Government Shutdown Battle",
    "description": "Only eight percent of Americans believe Democrats \"won\" the government shutdown battle, a weekly survey from the Economist/YouGov found.\nThe post Utter Defeat: Only 8% Say Democrats ‘Won’ Government Shutdown Battle appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/24/utter-defeat-only-8-say-democrats-won-government-shutdown-battle/",
    "timestamp": "2025-11-24T18:11:13Z"
  },
  {
    "title": "Erika Kirk Was ‘Praying to God’ She Was Pregnant at Time of Charlie …",
    "description": "Reading Time: 3 minutesErika Kirk made a heartbreaking revelation in a recent interview.\nErika Kirk Was ‘Praying to God’ She Was Pregnant at Time of Charlie … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/11/erika-kirk-was-praying-to-god-she-was-pregnant-at-time-of-charlie-kirks-death/",
    "timestamp": "2025-11-24T18:10:32Z"
  },
  {
    "title": "Joint Statement on United States-Ukraine Meeting (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nJoint Statement on United States-Ukraine Meeting  —  On 23 November 2025, representatives of the United States and Ukraine met in Geneva for discussions on the U.S. peace proposal.  The talks were constructive, foc…",
    "link": "https://www.memeorandum.com/251124/p52",
    "timestamp": "2025-11-24T18:10:01Z"
  },
  {
    "title": "'That's The Only Outcome': Bannon Guest Admits Trump Giving Putin 'Everything He Wants'",
    "description": "Former CIA adviser Jim Rickards, a MAGA supporter, admitted that President Donald Trump's plan to end the war in Ukraine was to give Russian President Vladimir Putin \"everything he wants.\"\n\n\n\"The criticism of the plan is that it gives Putin almost everything …",
    "link": "https://crooksandliars.com/2025/11/thats-only-outcome-bannon-guest-admits",
    "timestamp": "2025-11-24T18:08:55Z"
  },
  {
    "title": "Major debate as Trump inflation sees hosts hit Thanksgiving guests with charge",
    "description": "President Donald Trump likes to claim Thanksgiving costs are down this year, but some holiday hosts are considering extraordinary measures to keep their meals under budget.The president has claimed costs for this year's meal are down 25 percent, citing a misl…",
    "link": "https://www.rawstory.com/cost-of-thanksgiving-trump/",
    "timestamp": "2025-11-24T18:08:39Z"
  },
  {
    "title": "Russia rejects European input into peace proposals as US and Ukraine praise progress",
    "description": "Kremlin calls for talks on original plan that Kyiv presidential aide says ‘no longer exists’",
    "link": "https://www.irishtimes.com/world/europe/2025/11/24/russia-rejects-european-input-into-peace-proposals-as-us-and-ukraine-praise-progress/",
    "timestamp": "2025-11-24T18:08:16Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding prosecutor was illegally appointed",
    "description": "A federal judge has dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James.",
    "link": "https://www.wcvb.com/article/judge-dismisses-comey-james-indictments/69531452",
    "timestamp": "2025-11-24T18:08:11Z"
  },
  {
    "title": "Judge dismisses cases against James Comey, Letitia James",
    "description": "A judge has dismissed the cases against former FBI Director James Comey and New York Attorney General Letitia James.",
    "link": "https://www.wftv.com/news/trending/judge-dismisses-cases-against-james-comey-letitia-james/H6I6HD5IQBHZJE4QRTFS2GHD2E/",
    "timestamp": "2025-11-24T18:06:32Z"
  },
  {
    "title": "Judge dismisses cases against James Comey, Letitia James",
    "description": "A judge has dismissed the cases against former FBI Director James Comey and New York Attorney General Letitia James.",
    "link": "https://www.wpxi.com/news/trending/judge-dismisses-cases-against-james-comey-letitia-james/H6I6HD5IQBHZJE4QRTFS2GHD2E/",
    "timestamp": "2025-11-24T18:06:05Z"
  },
  {
    "title": "Russian Tanker Reaches Venezuela After Evading U.S. Warship",
    "description": "A sanctioned Russian shadow fleet tanker has reached Venezuela’s waters after evading a U.S. destroyer. Previously, Bloomberg reported the  sanctioned panamax carrier Seahorse unsuccessfully attempted to approach Venezuela three times, with the U.S. destroyer…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Russian-Tanker-Reaches-Venezuela-After-Evading-US-Warship.html",
    "timestamp": "2025-11-24T18:05:39Z"
  },
  {
    "title": "Mamdani Understands Something About Trump That European Leaders Don't",
    "description": "Donald Trump respects outreach from opponents more than submissive flattery from friends.",
    "link": "https://reason.com/2025/11/24/mamdani-understands-something-about-trump-that-european-leaders-dont/",
    "timestamp": "2025-11-24T18:05:26Z"
  },
  {
    "title": "ICE Sent 600 Immigrant Kids to Detention in Federal Shelters This Year. It’s a New Record.",
    "description": "Under a zero tolerance policy, the first Trump administration separated immigrant children from their families at the U.S.-Mexico border. New data suggests separations are happening all over the country, often after little more than a traffic stop.",
    "link": "http://www.propublica.org/article/ice-detentions-immigrant-kids-family-separations",
    "timestamp": "2025-11-24T18:05:00Z"
  },
  {
    "title": "Judge Dismisses Comey And James Cases Due To 'Unlawfully Appointed' Prosecutor",
    "description": "United States District Judge Cameron McGowan Currie dismissed the federal government's indictments against former FBI Director James Comey and New York Attorney General Letitia James, ruling that President Donald Trump unlawfully appointed his personal attorn…",
    "link": "https://crooksandliars.com/2025/11/judge-dismisses-comey-and-james-cases-due",
    "timestamp": "2025-11-24T18:05:00Z"
  },
  {
    "title": "Despite trouble for Tyson Foods, there's a silver lining for its Lancaster County jobs",
    "description": "Tyson Foods has been in the news for all the wrong reasons lately, but there is a silver lining for the hundreds of Tyson jobs locally.",
    "link": "https://lancasteronline.com/news/local/despite-trouble-for-tyson-foods-theres-a-silver-lining-for-its-lancaster-county-jobs/article_ffb04fb8-a8ea-48cc-a58a-39244d6f1028.html",
    "timestamp": "2025-11-24T18:04:00Z"
  },
  {
    "title": "MTG Snuffs Out 2028 Rumor With Rant About ‘Political Industrial Complex’",
    "description": "\"If you fell for those headlines,\" wrote the Georgia Republican, \"you’re still being lulled everyday into psychosis.\"",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-president-no_n_69247f03e4b0ea2d5e75cbd2",
    "timestamp": "2025-11-24T18:03:11Z"
  },
  {
    "title": "US judge dismisses case against ex-FBI director Comey",
    "description": "A US judge has dismisses the criminal charges against former FBI Director James Comey based on a procedural error, an extraordinary setback for the Justice Department in a case President Donald Trump called for as part of a campaign against perceived politica…",
    "link": "https://www.rte.ie/news/world/2025/1124/1545634-comey-case-dismissed/",
    "timestamp": "2025-11-24T18:02:53Z"
  },
  {
    "title": "Judge Kills Trump’s Revenge Cases Against James Comey, Letitia James",
    "description": "Donald Trump’s revenge prosecutions against former FBI Director James Comey—and New York Attorney General Letitia James—have been thrown out of court. U.S. District Judge Cameron McGowan Currie ruled Monday that interim U.S. Attorney Lindsey Halligan, who had…",
    "link": "https://newrepublic.com/post/203602/federal-judge-kills-trump-revenge-case-james-comey",
    "timestamp": "2025-11-24T18:02:53Z"
  },
  {
    "title": "Europe’s Critical Raw Materials Strategy",
    "description": "With China dominating the global supply of rare-earth magnets and other critical materials, Europe is dangerously vulnerable to shortages and potential export controls. EU institutions, governments, and industry must act quickly to secure these supply chains …",
    "link": "https://www.project-syndicate.org/commentary/europe-critical-raw-materials-rare-earths-strategy-by-nicola-beer-2025-11",
    "timestamp": "2025-11-24T18:02:08Z"
  },
  {
    "title": "Donald Trump praises Shedeur Sanders after Browns win: I told you so",
    "description": "Just hours after the Cleveland Browns secured a 24-10 victory over the Las Vegas Raiders in Week 12 of the 2025 NFL season, President Donald Trump took to Truth Social to heap prai",
    "link": "https://www.marca.com/en/nfl/cleveland-browns/2025/11/24/69248f19268e3eda698b4598.html",
    "timestamp": "2025-11-24T18:01:51Z"
  },
  {
    "title": "Trump’s Obamacare shake-up sends cash straight to consumers, cutting insurers out of the loop - here are details",
    "description": "Trump health care plan: President Trump and Republican lawmakers are pushing a significant change in US health care. They propose sending government health funds directly to consumers, not insurance companies. This shift could involve Health Savings Accounts.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-obamacare-shake-up-sends-cash-straight-to-consumers-cutting-insurers-out-of-the-loop-here-are-details/articleshow/125545845.cms",
    "timestamp": "2025-11-24T18:01:16Z"
  },
  {
    "title": "Trump appoints two Commerce officials to oversee U.S. Steel under 'golden share' agreement",
    "description": "President Donald Trump approved U.S. Steel's controversial acquisition by Nippon in June after securing veto rights over key business decisions.",
    "link": "https://biztoc.com/x/2f298eb1de139825",
    "timestamp": "2025-11-24T18:01:04Z"
  },
  {
    "title": "SECRET TRIBUNAL: Pentagon investigating Sen. Mark Kelly... | Urged troops to defy 'illegal orders'...",
    "description": "The Pentagon says that it is investigating Democratic Sen. Mark Kelly of Arizona for possible breaches of military law after Kelly joined a handful of other lawmakers in a video that called for U.S. troops to refuse unlawful orders. The Pentagon’s statement, …",
    "link": "https://apnews.com/article/pentagon-mark-kelly-troop-investigation-4882f76b05dcdfa3060c284c2c84dd12",
    "timestamp": "2025-11-24T18:00:15Z"
  },
  {
    "title": "Fact check: 78 times Zelensky has expressed gratitude to the US (Daniel Dale/CNN)",
    "description": "Daniel Dale / CNN:\nFact check: 78 times Zelensky has expressed gratitude to the US  —  President Donald Trump claimed on social media on Sunday that “UKRAINE ‘LEADERSHIP’ HAS EXPRESSED ZERO GRATITUDE FOR OUR EFFORTS” in relation to the war there.  —  Trump's …",
    "link": "https://www.memeorandum.com/251124/p48",
    "timestamp": "2025-11-24T18:00:00Z"
  },
  {
    "title": "“I can’t believe you’d disrespect us”: Trump-voting nurse is now begging him to classify nursing degrees as “professional”",
    "description": "A Trump-voting nurse is furious over the current administration's decision to exclude nursing from the list of professional degrees.\n\n\nOne of the most recent controversies stirred up by the Trump administration revolves around what degrees are classified as \"…",
    "link": "https://www.dailydot.com/viral-politics/nurse-furious-trump-excluding-nursing-professional-degrees/",
    "timestamp": "2025-11-24T18:00:00Z"
  },
  {
    "title": "Gulf Coast Pipeline Boom Marks Largest Natural Gas Expansion Since 2008",
    "description": "A massive pipeline buildout is sweeping across Texas, Louisiana, and Oklahoma, marking the largest expansion of Gulf Coast natural-gas capacity since the 2008 shale boom, according to Bloomberg. As many as a dozen projects are slated for completion next year,…",
    "link": "https://oilprice.com/Energy/Energy-General/Gulf-Coast-Pipeline-Boom-Marks-Largest-Natural-Gas-Expansion-Since-2008.html",
    "timestamp": "2025-11-24T18:00:00Z"
  },
  {
    "title": "Ukraine cuts back parts of US peace plan as Europe urges caution",
    "description": "The original plan was written last month by Vladimir Putin’s envoy Kirill Dmitriev and Donald Trump’s representative Steve Witkoff.",
    "link": "https://indianexpress.com/article/world/ukraine-cuts-back-parts-of-us-peace-plan-as-europe-urges-caution-10384048/",
    "timestamp": "2025-11-24T17:57:51Z"
  },
  {
    "title": "Criminal cases against ex-FBI director Comey, Letitia James dismissed in blow to Trump administration",
    "description": "A federal judge has dismissed the criminal cases against former FBI director James Comey and New York Attorney General Letitia James, concluding that the prosecutor who brought the charges at U.S. President Donald Trump's urging was illegally appointed by the…",
    "link": "https://www.cbc.ca/news/world/us-va-case-dismissed-james-comey-9.6990482",
    "timestamp": "2025-11-24T17:56:50Z"
  },
  {
    "title": "Associated Press, Trump argue Oval Office access in federal appeals court",
    "description": "White House barred AP when it declined to refer to the 'Gulf of Mexico' as the 'Gulf of America' after Trump renamed it.",
    "link": "https://www.aljazeera.com/economy/2025/11/24/associated-press-trump-argue-oval-office-access-in-federal-appeals-court",
    "timestamp": "2025-11-24T17:56:40Z"
  },
  {
    "title": "Federal judge dismisses James Comey, Letitia James indictments",
    "description": "Judge Cameron Currie found that Lindsey Halligan could not charge James Comey and Letitia James because she was an invalid U.S. attorney",
    "link": "https://www.foxnews.com/politics/federal-judge-dismisses-james-comey-letitia-james-indictments",
    "timestamp": "2025-11-24T17:55:44Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "A federal judge has dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James, concluding that the prosecutor who brought the charges at President Donald Trump’s urging was illegally appointed by the Just…",
    "link": "https://freerepublic.com/focus/f-news/4354355/posts",
    "timestamp": "2025-11-24T17:55:41Z"
  },
  {
    "title": "Donald Trump and Jeffrey Epstein: a Timeline",
    "description": "The alleged relationship between deceased sex trafficker Jeffrey Epstein and Donald Trump has become one of the most acute threats to the president’s power",
    "link": "https://theweek.com/politics/trump-epstein-relationship-timeline-maxwell",
    "timestamp": "2025-11-24T17:55:10Z"
  },
  {
    "title": "Europe's peace plan for Ukraine 'doesn't suit us', Kremlin says as Trump sets deadline",
    "description": "The initial US plan was drafted without input from Ukraine’s European allies, who were scrambling to make their voices heard and boost Kyiv’s position.",
    "link": "https://www.thejournal.ie/russia-ukraine-us-peace-framework-plan-6883793-Nov2025/",
    "timestamp": "2025-11-24T17:55:00Z"
  },
  {
    "title": "Charlamagne Urges Politicians to Quit Using ‘Fascist’ Following Trump’s Meeting With Mamdani: ‘It Looks Hypocritical’",
    "description": "Following President Donald Trump's meeting with Zohran Mamdani, Charlamagne tha God wants politicians to stop calling each other \"fascists.\"\nThe post Charlamagne Urges Politicians to Quit Using ‘Fascist’ Following Trump’s Meeting With Mamdani: ‘It Looks Hypoc…",
    "link": "https://www.mediaite.com/media/radio/charlamagne-urges-politicians-to-quit-using-fascist-following-trumps-meeting-with-mamdani-it-looks-hypocritical/",
    "timestamp": "2025-11-24T17:52:51Z"
  },
  {
    "title": "Indictments against Comey and James dismissed because 3rd place runner up in Miss Colorado USA pageant invalidly appointed",
    "description": "Remember, we had to get rid of DEI because we’re supposed to be a Meritocracy ™: A federal judge dismissed the indictments against former FBI Director James Comey and New York Attorney General Letitia James on Monday. The judge found that the appointment of i…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/indictments-against-comey-and-james-dismissed-because-3rd-place-runner-up-in-miss-colorado-usa-pageant-invalidly-appointed",
    "timestamp": "2025-11-24T17:51:23Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "The orders make Lindsey Halligan the latest Trump administration prosecutor to be disqualified.",
    "link": "https://www.denverpost.com/2025/11/24/justice-department-comey/",
    "timestamp": "2025-11-24T17:51:22Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "The orders make Lindsey Halligan the latest Trump administration prosecutor to be disqualified.",
    "link": "https://www.bostonherald.com/2025/11/24/justice-department-comey/",
    "timestamp": "2025-11-24T17:51:22Z"
  },
  {
    "title": "Hegseth Threatens To Court-Martial Mark Kelly",
    "description": "Defense Secretary Pete Hegseth's so-called Department of War threatened to court-martial Sen. Mark Kelly (D-AZ) after he appeared in a video stating that U.S. troops have a constitutional duty to refuse illegal orders.\n\n\n\"The Department of War has received se…",
    "link": "https://crooksandliars.com/2025/11/hegseths-department-war-threatens-court",
    "timestamp": "2025-11-24T17:51:00Z"
  },
  {
    "title": "Trump Called On to Secure Release of 16-Year-Old US Citizen Mohammed Ibrahim From Israeli Detention",
    "description": "Democratic lawmakers are ramping up demands for the Trump administration to secure the release of 16-year-old Mohammed Ibrahim, a Florida resident and US citizen, who has been detained and reportedly abused in an Israeli prison for nine months—with Sen. Chris…",
    "link": "https://www.commondreams.org/news/mohammed-ibrahim",
    "timestamp": "2025-11-24T17:50:59Z"
  },
  {
    "title": "US demands digital concessions in return for EU steel tariff relief",
    "description": "Washington argues U.S. companies would invest more in the EU if it rolls back its digital rulebook.",
    "link": "https://www.politico.eu/article/us-steel-tariff-relief-eu-digital-concessions/",
    "timestamp": "2025-11-24T17:50:04Z"
  },
  {
    "title": "Dissenting appeals judge in Texas redistricting case complains winners were George Soros, Gavin Newsom",
    "description": "A federal appeals judge used his dissent in a Texas redistricting case last week to “highlight the pernicious judicial misbehavior” of the judge who wrote the majority opinion and to complain that the main winners in the case are billionaire George Soros and …",
    "link": "https://www.abajournal.com/news/article/dissenting-appeals-judge-in-texas-redistricting-case-complains-winners-were-george-soros-and-gavin-newsom",
    "timestamp": "2025-11-24T17:50:00Z"
  },
  {
    "title": "Judge dismisses cases against ex-FBI Director James Comey, NY AG Tish James",
    "description": "A federal judge dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James Monday, finding that interim US Attorney Lindsey Halligan was improperly appointed to her position. James Comey Lindsey Halligan, …",
    "link": "https://nypost.com/2025/11/24/us-news/judge-dismisses-cases-against-ex-fbi-director-james-comey-ny-ag-tish-james/",
    "timestamp": "2025-11-24T17:49:48Z"
  },
  {
    "title": "US' Ukraine Plan Under Revision: Fewer Points, No Frozen-Asset Confiscation",
    "description": "WASHINGTON (Sputnik) – The US plan to resolve the conflict in Ukraine, initially comprised of 28 points, has been reduced to 19 following recent discussions between American and Ukrainian officials in Geneva over the weekend, The Washington Post reported on M…",
    "link": "https://sputnikglobe.com/20251124/us-ukraine-plan-under-revision-fewer-points-no-frozen-asset-confiscation-1123166639.html",
    "timestamp": "2025-11-24T17:49:42Z"
  },
  {
    "title": "James Comey Indictment Dismissed After Multiple Scandals",
    "description": "The attorney handling the case was not lawfully appointed, the judge ruled.",
    "link": "https://www.huffpost.com/entry/judge-dismisses-james-comey-indictment_n_69160bbae4b0bf453c7c1827",
    "timestamp": "2025-11-24T17:49:25Z"
  },
  {
    "title": "Dismissed: James Comey and Letitia James cases thrown out by judge",
    "description": "United States District Judge Cameron McGowan Currie dismissed the federal government's indictments against former FBI Director James Comey and New York Attorney General Letitia James, ruling that President Donald Trump unlawfully appointed his personal attorn…",
    "link": "https://www.rawstory.com/comey-james-dismissed/",
    "timestamp": "2025-11-24T17:49:10Z"
  },
  {
    "title": "Josh Duggar Gets a Hearing Date to Argue ‘Unfair Trial’ Claims as He Tries to …",
    "description": "Reading Time: 4 minutesRepresenting himself in court, Josh Duggar is insisting that his trial was unfair and his conviction was unconstitutional.\nJosh Duggar Gets a Hearing Date to Argue ‘Unfair Trial’ Claims as He Tries to … was originally published on The H…",
    "link": "http://www.thehollywoodgossip.com/2025/11/josh-duggar-new-hearing-set-endless-appeals/",
    "timestamp": "2025-11-24T17:49:01Z"
  },
  {
    "title": "Trump appoints two Commerce officials to oversee U.S. Steel under 'golden share' agreement",
    "description": "President Donald Trump approved U.S. Steel's controversial acquisition by Nippon in June after securing veto rights over key business decisions.",
    "link": "https://www.cnbc.com/2025/11/24/trump-us-steel-nippon-golden-share.html",
    "timestamp": "2025-11-24T17:48:38Z"
  },
  {
    "title": "US judge tosses case against ex-FBI chief Comey, rebuking Trump prosecutor",
    "description": "By Andrew Goudsward WASHINGTON (Reuters) -A U.S. judge on Monday tossed out criminal charges against former FBI Director James Comey based on a procedural...",
    "link": "https://www.yahoo.com/news/articles/us-judge-tosses-case-against-174821826.html",
    "timestamp": "2025-11-24T17:48:21Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "A federal judge on Monday dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James, concluding that...",
    "link": "https://www.yahoo.com/news/articles/judge-dismisses-comey-james-indictments-174755009.html",
    "timestamp": "2025-11-24T17:47:55Z"
  }
]