[
  {
    "title": "Donald Trump's Juneteenth Message Gets Surprising Response",
    "description": "President Donald Trump complained on Truth Social that there are \"too many non-working holidays in America.\"",
    "link": "https://www.newsweek.com/donald-trump-juneteenth-message-negative-response-truth-social-2088207",
    "timestamp": "2025-06-20T06:39:07Z"
  },
  {
    "title": "Oil dips 2.5% as Trump delays decision on Iran involvement",
    "description": "Crude oil prices fell by over 2.5% on Friday after White House Press Secretary Karoline Leavitt told reporters that United States President Donald Trump will decide within the next two weeks on whethe...",
    "link": "https://biztoc.com/x/9a73b5c053e43cdc",
    "timestamp": "2025-06-20T06:38:30Z"
  },
  {
    "title": "Russia says any use of tactical nuclear weapons by US in Iran would be catastrophic, TASS reports",
    "description": "Kremlin spokesman Dmitry Peskov stated that the use of tactical nuclear weapons by the United States in Iran would be a catastrophic development. This statement follows media reports about the possibility of using such weapons on Iran's Fordow facility. Donal…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-says-any-use-of-tactical-nuclear-weapons-by-us-in-iran-would-be-catastrophic-tass-reports/articleshow/121968961.cms",
    "timestamp": "2025-06-20T06:36:06Z"
  },
  {
    "title": "Billionaire Reveals Why He Turned Down Kamala Harris' Running Mate Shot",
    "description": "The gig eventually went to Tim Walz.",
    "link": "https://www.huffpost.com/entry/kamala-harris-running-mate-turned-down_n_6854fa2ae4b0dd3af0371bfc",
    "timestamp": "2025-06-20T06:32:18Z"
  },
  {
    "title": "US Appeals Court Allows Trump Control Of National Guard In LA",
    "description": "A US appeals court on Thursday ruled that President Donald Trump could continue control of National Guard troops in Los Angeles, over the objections of California Governor Gavin Newsom.",
    "link": "https://www.ibtimes.com/us-appeals-court-allows-trump-control-national-guard-la-3776300",
    "timestamp": "2025-06-20T06:27:13Z"
  },
  {
    "title": "Dollar set for weekly rise as Middle East conflict fuels safe-haven demand",
    "description": "The conflict between Israel and Iran shows no signs of subsiding and market participants are nervous about possible U.S. attacks on Iran, sparking a surge in the greenback",
    "link": "https://www.thehindubusinessline.com/markets/forex/dollar-set-for-weekly-rise-as-middle-east-conflict-fuels-safe-haven-demand/article69716404.ece",
    "timestamp": "2025-06-20T06:27:11Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wmtv15news.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T06:25:29Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to LA",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids.",
    "link": "https://www.thehindubusinessline.com/news/world/appeals-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-la/article69716446.ece",
    "timestamp": "2025-06-20T06:25:18Z"
  },
  {
    "title": "Europe’s Arms Revival Pits Homegrown Wares Against US Stalwarts",
    "description": "Europe’s arms manufacturers are duking it out with American rivals to win their slice of the region’s fast-growing military pie, as governments embark on an unprecedented expansion of defense spending.",
    "link": "https://www.livemint.com/companies/news/europes-arms-revival-pits-homegrown-wares-against-us-stalwarts-11750400663105.html",
    "timestamp": "2025-06-20T06:24:22Z"
  },
  {
    "title": "Orbán's anti-Ukraine campaign targets political rival as Hungary's elections loom",
    "description": "Hungarian Prime Minister Viktor Orbán has launched a sweeping anti-Ukraine campaign he hopes will sway voters ahead of elections next year, and discredit his chief political rival",
    "link": "https://abcnews.go.com/International/wireStory/orbns-anti-ukraine-campaign-targets-political-rival-hungarys-123029988",
    "timestamp": "2025-06-20T06:22:29Z"
  },
  {
    "title": "Stephen Colbert Nails Trump's Most 'Half-Assed' Effort Yet",
    "description": "The \"Late Show\" host lamented that \"this country used to have standards.\"",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-half-assed_n_6854f626e4b0e5115b422eb8",
    "timestamp": "2025-06-20T06:16:50Z"
  },
  {
    "title": "Donald Trump Celebrates Legal Win Over Deploying National Guard",
    "description": "The California deployment was the first by a president of a state National Guard without the governor's permission since 1965.",
    "link": "https://biztoc.com/x/f8b9c358cde89e08",
    "timestamp": "2025-06-20T06:16:26Z"
  },
  {
    "title": "Did Iran Try to Kill Trump? What to Know",
    "description": "Iranian officials have denied trying, but multiple alleged conspirators linked to Tehran have been charged over attempted plots against the U.S. President.",
    "link": "https://time.com/7296125/iran-assassination-plot-trump-kill-khamenei-us-israel-carlson-cruz/",
    "timestamp": "2025-06-20T06:15:00Z"
  },
  {
    "title": "Donald Trump Celebrates Legal Win Over Deploying National Guard",
    "description": "The California deployment was the first by a president of a state National Guard without the governor's permission since 1965.",
    "link": "https://www.newsweek.com/donald-trump-celebrates-legal-win-over-deploying-national-guard-2088206",
    "timestamp": "2025-06-20T06:12:26Z"
  },
  {
    "title": "Iran's foreign minister meeting European counterparts to seek 'diplomatic solution' with Israel",
    "description": "UK’s foreign minister David Lammy said the US’ two-week pause on intervention creates an opportunity for diplomacy.",
    "link": "https://www.thejournal.ie/iran-israel-latest-3-6738290-Jun2025/",
    "timestamp": "2025-06-20T06:12:24Z"
  },
  {
    "title": "Albanese to skip NATO summit as push for Trump meeting and AUKUS talks intensify",
    "description": "Prime Minister Albanese will miss the upcoming NATO summit in The Hague to reschedule a meeting with US President Trump, a meeting that previously failed to materialize at the G7 summit. Despite concerns about Australia being sidelined on critical global issu…",
    "link": "https://economictimes.indiatimes.com/news/international/australia/albanese-to-skip-nato-summit-as-push-for-trump-meeting-and-aukus-talks-intensify/articleshow/121968360.cms",
    "timestamp": "2025-06-20T06:11:05Z"
  },
  {
    "title": "Taiwan chip packaging sector faces triple threat as Trump tariff deadline looms",
    "description": "Taiwan's semiconductor packaging and testing companies confront three major operational challenges in the second half of 2025 as US President Donald Trump's reciprocal tariff suspension expires in less than a month.",
    "link": "https://www.digitimes.com/news/a20250620PD224/taiwan-chipbond-packaging-testing-2025.html",
    "timestamp": "2025-06-20T06:08:16Z"
  },
  {
    "title": "Israel is striking Iran's nuclear sites — are there safety risks?",
    "description": "Israel has targeted five key Iranian nuclear facilities over the past week. Experts say attacks on uranium enrichment plants are mainly a \"chemical problem\", not radiological.",
    "link": "https://www.abc.net.au/news/2025-06-20/israel-attack-iran-nuclear-uranium-enrichment-contamination-risk/105441886",
    "timestamp": "2025-06-20T06:07:59Z"
  },
  {
    "title": "How Trumponomics has shaken global markets",
    "description": "U.S. President Donald Trump has taken just a few months since his election to upend global financial markets with his economic policies.",
    "link": "https://www.hurriyetdailynews.com/how-trumponomics-has-shaken-global-markets-210536",
    "timestamp": "2025-06-20T06:07:48Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott21alivenews.com",
    "link": "https://www.21alivenews.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T06:01:22Z"
  },
  {
    "title": "'Agencies must fall silent': Trump-appointed judge known for anti-abortion opinions overturns rule barring doctors from sharing reproductive health care information",
    "description": "'Agencies must fall silent': Trump-appointed judge known for anti-abortion opinions overturns rule barring doctors from sharing reproductive health care informationnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4060524714124-agencies-must-fall-silent-trump-appointed-judge-known-for-anti-abortion-opinions-overturns-rule-barring-doctors-from-sharing-reproductive-health-care-information?_f=app_share&amp;pd=0M82fYDO&amp;lang=en_US&amp;send_time=1750399086&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.24.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q2-v5%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_blend_exp_25q2-v7&amp;s=i2",
    "timestamp": "2025-06-20T06:00:16Z"
  },
  {
    "title": "Trump demands Iranian Supreme Leader Ayatollah Ali Khamenei’s “unconditional surrender”",
    "description": "President Donald Trump declared on Truth Social that the U.S. knows the location of Iranian Supreme Leader Ayatollah Ali Khamenei and demanded his “unconditional surrender,” amid escalating tensions between Israel and Iran. Trump held a meeting with his natio…",
    "link": "https://www.naturalnews.com/2025-06-20-trump-demands-iranian-supreme-leaders-unconditional-surrender.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "Trump secretly approves U.S. attack plans against Iran but holds final order as tensions escalate",
    "description": "Trump approved attack plans on Iran but delayed the final order, awaiting Tehran’s response on nuclear enrichment. U.S. B-2 bombers armed with bunker-busting bombs are stationed at Diego Garcia and ready to strike Iran’s Fordow nuclear site. Iran vows “irrepa…",
    "link": "https://www.naturalnews.com/2025-06-20-trump-secretly-approves-attack-plans-iran.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "Zionism is not an American principle",
    "description": "Century-long project reached a particular sort of peak Thursday night when Israel launched a massive, ongoing decapitation strike against Iran. As Eli Lake, proud neoconservative and contributor to the Free Press, chortled afterwards “What you guys think Zion…",
    "link": "https://www.naturalnews.com/2025-06-20-zionism-is-not-an-american-principle.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "Iran threatens Strait of Hormuz closure amid Israel conflict, risking global oil price surge",
    "description": "Iran threatens to blockade the Strait of Hormuz, risking a global oil price surge. The strait handles 20% of global oil and 30% of seaborne crude, making it critical for energy trade. A blockade would trigger a supply shock, spiking inflation and disrupting e…",
    "link": "https://www.naturalnews.com/2025-06-20-iran-threatens-hormuz-closure-oil.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "Ford production plants halt manufacturing due to SHORTAGE of rare-earth magnets",
    "description": "Ford Motor Co. has paused production at multiple factories, including its Chicago plant, due to a critical shortage of rare-earth magnets caused by China’s retaliatory export restrictions. Over 90 percent of global rare-earth magnet supply is controlled by Ch…",
    "link": "https://www.naturalnews.com/2025-06-20-ford-halts-manufacturing-shortage-rare-earth-magnets.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "Trump faces scrutiny over deceptive Iran bombing plan as global tensions escalate",
    "description": "Trump accused of deception: Critics claim Trump pretends to deliberate over Iran strikes while secretly coordinating with Netanyahu, using faux negotiations as a ruse to justify imminent military action. Global conflict risks: Analysts warn U.S. bombing could…",
    "link": "https://www.naturalnews.com/2025-06-20-trump-faces-scrutiny-over-deceptive-iran-bombing-plan.html",
    "timestamp": "2025-06-20T06:00:00Z"
  },
  {
    "title": "US eyes UK bases in Greek Cyprus for military support amid Israel-Iran tensions",
    "description": "The United States is reportedly preparing to deploy tanker aircraft to British bases in Greek Cyprus to support potential military operations in the escalating Israel-Iran conflict, according to British media.",
    "link": "https://www.hurriyetdailynews.com/us-eyes-uk-bases-in-greek-cyprus-for-military-support-amid-israel-iran-tensions-210533",
    "timestamp": "2025-06-20T05:59:41Z"
  },
  {
    "title": "Roaming Charges: Neo-Conned Again!",
    "description": "Using Israel's logic for attacking Iran (to protect itself from (non-existent) Iranian nuclear weapons), every country in the Middle East (and beyond) would be justified in attacking Israel and destroying its (still undeclared) arsenal of 90 nuclear warheads.…",
    "link": "https://www.counterpunch.org/2025/06/20/roaming-charges-neo-conned-again/",
    "timestamp": "2025-06-20T05:59:13Z"
  },
  {
    "title": "U.S./Israel-Iran War: The Issue is Palestine; the Issue is Zionism",
    "description": "On the one hand, I feel the need to say something about the US/Israel-Iran war; On the other hand, I saw it coming and said it right after October 7th, 2023, in “Israel’s Solution to Gaza: War on Iran.” And I’m really tired and depressed to see it happening a…",
    "link": "https://www.counterpunch.org/2025/06/20/u-s-israel-iran-war-the-issue-is-palestine-the-issue-is-zionism/",
    "timestamp": "2025-06-20T05:57:01Z"
  },
  {
    "title": "Politicians’ memecoins, dropped court cases fuel crypto ‘crime supercycle’",
    "description": "A crypto “crime supercycle” has been created by politicians’ shilling memecoins, crypto court cases being abandoned and a lack of consequences for scammers, a pair of blockchain sleuths say.",
    "link": "https://cointelegraph.com/news/crypto-crime-supercycle-memecoins-scams-2025",
    "timestamp": "2025-06-20T05:56:52Z"
  },
  {
    "title": "America’s New Industrial Revolution",
    "description": "He lived over 1,000 years ago, but King Canute’s life still has some important lessons for our own time. After conquering England, Denmark, Norway, and part of Sweden, he forged a vast North Sea empire that made him, by the year 1030, the greatest of all the …",
    "link": "https://www.counterpunch.org/2025/06/20/americas-new-industrial-revolution/",
    "timestamp": "2025-06-20T05:56:35Z"
  },
  {
    "title": "Jimmy Kimmel Trolls Trump By Exposing His 'Ultimate' Move",
    "description": "Jimmy Kimmel Trolls Trump By Exposing His 'Ultimate' Movehuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-two-weeks_n_6854e812e4b0af4d580eb0fe",
    "timestamp": "2025-06-20T05:47:46Z"
  },
  {
    "title": "Toward A Theory Of Kevin Roose | Defector",
    "description": "“You can’t be a serious critic,” New York Times technology reporter Kevin Roose wrote on Tuesday, on Bluesky, about artificial intelligence, “if you’re in denial about how useful it is.” Narrowly, in strict terms, this is true: You can’t be a serious critic o…",
    "link": "https://defector.com/toward-a-theory-of-kevin-roose",
    "timestamp": "2025-06-20T05:47:01Z"
  },
  {
    "title": "US court allows Trump to retain control of National Guard",
    "description": "The court said that while Trump did not have unlimited powers to take over California's guard, his administration had a rationale to do so. Trump hailed the decision as a \"BIG WIN\" online.",
    "link": "https://www.dw.com/en/us-court-allows-trump-to-retain-control-of-national-guard/a-72979329",
    "timestamp": "2025-06-20T05:45:00Z"
  },
  {
    "title": "Asia-Pacific markets trade mixed as investors assess China data, escalating Israel-Iran tensions",
    "description": "Asia-Pacific markets mostly rose Friday after China kept benchmark rates steady, while investors monitored escalating tensions between Israel and Iran.\nU.S. President Donald Trump is now weighing on whether to back the Israeli military and strike Tehran. The …",
    "link": "https://biztoc.com/x/eddacfd1ebb62fa5",
    "timestamp": "2025-06-20T05:42:29Z"
  },
  {
    "title": "Trump to Decide Whether to Join Strikes on Iran Within Two Weeks",
    "description": "President Donald Trump will decide within two weeks whether to strike Iran, his spokeswoman said, as Israel hit more Iranian nuclear sites and warned its attacks may bring down the leadership in Tehran.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-decide-whether-to-join-strikes-on-iran-within-two-weeks",
    "timestamp": "2025-06-20T05:34:25Z"
  },
  {
    "title": "Trump hints he'll hold off Iran strike, for now",
    "description": "U.S. President Donald Trump signalled he would give diplomacy a chance before deciding whether to strike Iran. Read more.",
    "link": "https://financialpost.com/news/trump-decide-whether-strikes-iran-two-weeks",
    "timestamp": "2025-06-20T05:34:25Z"
  },
  {
    "title": "Emmanuel the Egregious",
    "description": "Macron is using the ongoing conflict in Gaza and the Iran-Israel standoff not out of genuine concern, but as tools to pander to the Muslim world and a way to preserve French trade with Iran. Op-ed.",
    "link": "https://www.israelnationalnews.com/news/410353",
    "timestamp": "2025-06-20T05:31:50Z"
  },
  {
    "title": "Trump is silent about Juneteenth on a day he previously honored as president",
    "description": "President Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. On this year's Juneteenth holiday on Thursday, the president kept silent.",
    "link": "https://www.npr.org/2025/06/20/g-s1-73675/trump-silent-about-juneteenth",
    "timestamp": "2025-06-20T05:30:21Z"
  },
  {
    "title": "European, Iranian diplomats to meet as US mulls joining Israel campaign",
    "description": "European foreign ministers will hold talks Friday with their Iranian counterpart, hoping to reach a diplomatic solution to the war with Israel as U.S. President Donald Trump mulls the prospect of U.S. involvement.",
    "link": "https://www.hurriyetdailynews.com/european-iranian-diplomats-to-meet-as-us-mulls-joining-israel-campaign-210531",
    "timestamp": "2025-06-20T05:26:33Z"
  },
  {
    "title": "In place of talk comes action",
    "description": "Although he has put off his decision on active US intervention, one thing is for certain, Donald Trump will not let himself be proclaimed the Neville Chamberlain of our century. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410352",
    "timestamp": "2025-06-20T05:14:52Z"
  },
  {
    "title": "Carney warns of retaliatory measures if US fails to strike a new steel and aluminum deal within 30 days",
    "description": "Canada plans to revise tariffs on US steel and aluminum. This will happen if there is no trade deal within 30 days. This announcement follows US increasing tariffs on Canadian metal imports. Mark Carney revealed support for Canada's steel and aluminum industr…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carney-warns-of-retaliatory-measures-if-us-fails-to-strike-a-new-steel-and-aluminum-deal-within-30-days/articleshow/121967122.cms",
    "timestamp": "2025-06-20T05:12:52Z"
  },
  {
    "title": "Investing in Space: Iron Dome's performance could be Golden Dome's opportunity",
    "description": null,
    "link": "https://www.cnbc.com/2025/06/20/investing-in-space-iron-domes-performance-golden-domes-opportunity.html",
    "timestamp": "2025-06-20T05:10:05Z"
  },
  {
    "title": "Trump hails court's National Guard ruling as 'big win'",
    "description": "United States President Donald Trump praised the Circuit Court of Appeals decision allowing him to keep control of the National Guard troops deployed in Los Angeles as a \"big win.\"\"This is a Great Dec...",
    "link": "https://biztoc.com/x/b1574174f8a47735",
    "timestamp": "2025-06-20T05:09:22Z"
  },
  {
    "title": "Global trading giants step up India presence, fuelling talent rush, exchange upgrades",
    "description": "Half a dozen global trading giants are ratcheting up their presence in India's booming derivatives markets, fuelling a hiring spree and pushing exchanges to improve technology.",
    "link": "https://www.thehindubusinessline.com/markets/global-trading-giants-step-up-india-presence-fuelling-talent-rush-exchange-upgrades/article69716190.ece",
    "timestamp": "2025-06-20T05:05:44Z"
  },
  {
    "title": "2 rising ASX 200 shares 'largely unaffected' by US tariffs: fundie",
    "description": "ASX 200 shares that are mostly immune to US tariffs may provide more short-term stability in portfolios.\nThe post 2 rising ASX 200 shares 'largely unaffected' by US tariffs: fundie appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/06/20/2-rising-asx-200-shares-largely-unaffected-by-us-tariffs-fundie/",
    "timestamp": "2025-06-20T05:05:36Z"
  },
  {
    "title": "Crude oil futures decline as Trump delays decision on US involvement in Israel-Iran conflict",
    "description": "Iran has warned against US intervention in the present situation. Any such intervention would lead to further escalation of tensions in West Asia, a key crude oil producing region",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-as-trump-delays-decision-on-us-involvement-in-israel-iran-conflict/article69716204.ece",
    "timestamp": "2025-06-20T05:01:15Z"
  },
  {
    "title": "Amid US-Pakistan thaw, two key challenges: Iran and China",
    "description": "Pakistani army chief Munir’s US trip suggests warming ties after past diplomatic friction. But challenges remain.",
    "link": "https://www.aljazeera.com/news/2025/6/20/amid-us-pakistan-thaw-two-key-challenges-iran-and-china",
    "timestamp": "2025-06-20T05:00:51Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.kptv.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T05:00:44Z"
  },
  {
    "title": "Could a nuclear war kill crypto? AI predicts Bitcoin’s fate in doomsday scenario",
    "description": "Polymarket odds of a nuclear bomb being dropped in 2025 was 18% - But can BTC survive?",
    "link": "https://ambcrypto.com/could-a-nuclear-war-kill-crypto-ai-predicts-bitcoins-fate-in-doomsday-scenario/",
    "timestamp": "2025-06-20T05:00:41Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.kctv5.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T05:00:35Z"
  },
  {
    "title": "How the culture war is remaking advertising",
    "description": "Brands are diluting or scrapping campaigns with social purpose as the movement against DEI intensifies",
    "link": "https://www.irishtimes.com/business/2025/06/20/how-the-culture-war-is-remaking-advertising/",
    "timestamp": "2025-06-20T05:00:00Z"
  },
  {
    "title": "Why I Can’t Celebrate Pride This Year",
    "description": "If you’ve read more than a few of my rants, then you are probably already painfully aware that I am a Queer person and that I take this identity pretty seriously, some of you may even be forgiven for saying annoyingly so. However, you have to understand that …",
    "link": "https://www.counterpunch.org/2025/06/20/why-i-cant-celebrate-pride-this-year/",
    "timestamp": "2025-06-20T04:50:25Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wect.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T04:50:24Z"
  },
  {
    "title": "A U.S. attack on Iran would show the limits of China's power",
    "description": "Despite China's brokered peace deal between Iran and Saudi Arabia, its influence is limited as potential US-Iran conflict looms. China's economic interests, particularly oil imports, are threatened, but military intervention is unlikely. China prioritizes cit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-u-s-attack-on-iran-would-show-the-limits-of-chinas-power/articleshow/121966688.cms",
    "timestamp": "2025-06-20T04:47:40Z"
  },
  {
    "title": "'Laziest Man In The World': Trump Ripped Over 'Pathetic' Complaint About Holidays",
    "description": "The president's critics were standing by with a reality check.",
    "link": "https://www.huffpost.com/entry/trump-holidays-complaint-reaction_n_6854d116e4b0af4d580ea4cb",
    "timestamp": "2025-06-20T04:46:14Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to LA",
    "description": "US News: LOS ANGELES: An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following.",
    "link": "https://timesofindia.indiatimes.com/world/us/appeals-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-la/articleshow/121966311.cms",
    "timestamp": "2025-06-20T04:45:26Z"
  },
  {
    "title": "Ninth Circuit Rules Unanimously Against Newsom: Trump Still Controls National Guard",
    "description": "A three-judge panel of the U.S. Court of Appeals for the Ninth Circuit ruled unanimously Thursday that President Donald Trump can federalize the California National Guard, rejecting Gov. Gavin Newsom's claims.\nThe post Ninth Circuit Rules Unanimously Against …",
    "link": "https://www.breitbart.com/politics/2025/06/19/ninth-circuit-rules-unanimously-against-newsom-trump-controls-national-guard/",
    "timestamp": "2025-06-20T04:44:02Z"
  },
  {
    "title": "Asian shares are mixed and oil gains as world waits to see if US will join Israel's war against Iran",
    "description": "Crude oil prices have climbed and Asian shares are trading mixed as markets await more clarity on whether or not the U.S. will join Israel’s war against Iran",
    "link": "https://abcnews.go.com/US/wireStory/asian-shares-mixed-oil-gains-world-waits-us-123029165",
    "timestamp": "2025-06-20T04:38:29Z"
  },
  {
    "title": "Commerce Ministry to meet stakeholders to assess impact of Iran-Israel conflict on India's trade",
    "description": "The Commerce Ministry will meet with stakeholders to discuss the Iran-Israel conflict's impact on India's foreign trade. The meeting aims to address concerns about rising freight rates and potential disruptions to shipping routes like the Strait of Hormuz and…",
    "link": "https://economictimes.indiatimes.com/news/india/commerce-ministry-to-meet-stakeholders-to-assess-impact-of-iran-israel-conflict-on-indias-trade/articleshow/121966523.cms",
    "timestamp": "2025-06-20T04:35:41Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.fox5vegas.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T04:33:12Z"
  },
  {
    "title": "Trump vs Newsom: federal court rules US President has control over California National Guard in LA protest response",
    "description": "A federal appeals court upheld President Trump's authority over the California National Guard, reversing a lower court ruling. This allows thousands of troops to remain under federal command in Los Angeles due to immigration enforcement protests. Governor New…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-vs-newsom-federal-court-rules-us-president-has-control-over-california-national-guard-in-la-protest-response/articleshow/121966446.cms",
    "timestamp": "2025-06-20T04:32:11Z"
  },
  {
    "title": "Eighth day of the Israel-Iran conflict: Anxiety over Trump’s decisions, mobility in the EU to find a diplomatic solution",
    "description": "Israeli Prime Minister pledges that Iran will \"pay a heavy price\" for the attack on a hospital in Beersheva - Iran also threatens to close the Strait of Hormuz - Trump to decide on US involvement in the coming weeks\nThe post Eighth day of the Israel-Iran conf…",
    "link": "https://en.protothema.gr/2025/06/20/eighth-day-of-the-israel-iran-conflict-anxiety-over-trumps-decisions-mobility-in-the-eu-to-find-a-diplomatic-solution/",
    "timestamp": "2025-06-20T04:29:30Z"
  },
  {
    "title": "Rupee rises 13 paise to 86.60 against US dollar in early trade",
    "description": "The Indian Rupee saw gains against the US dollar in early trading on Friday. This rise is attributed to lower global crude oil prices and a weaker US dollar. On Thursday, the Rupee had fallen to a two-month low. Market experts suggest exporters should sell do…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-rises-13-paise-to-86-60-against-us-dollar-in-early-trade/articleshow/121966361.cms",
    "timestamp": "2025-06-20T04:27:59Z"
  },
  {
    "title": "I grew up on American food. Trust me, it’s the last thing Europe needs | Alexander Hurst",
    "description": "The EU is under pressure to strike a trade deal with Trump, but an influx of mass-produced, low-quality food must be off the table\nAll over European media, the take seems to be similar – that the EU is “under pressure” to conclude some sort of deal with the U…",
    "link": "https://biztoc.com/x/620cfdfc5ebc7405",
    "timestamp": "2025-06-20T04:24:31Z"
  },
  {
    "title": "US stocks drift to a mixed finish as Wall Street closes another week of modest losses",
    "description": "The Dow Jones Industrial Average added 35 points, or 0.1%, and the Nasdaq composite fell 0.5%.  Treasury yields also held relatively steady in the bond...",
    "link": "https://finance.yahoo.com/news/asian-shares-mixed-oil-gains-041800965.html",
    "timestamp": "2025-06-20T04:18:00Z"
  },
  {
    "title": "Arizona Senate Passes Bitcoin Reserve Bill for Seized Crypto, Heads to House for Debate",
    "description": "The bill seeks to establish a state-managed digital asset fund using crypto seized through criminal forfeiture.",
    "link": "https://decrypt.co/326175/arizona-senate-passes-bitcoin-reserve-bill-for-seized-crypto-heads-to-house-for-debate",
    "timestamp": "2025-06-20T04:17:28Z"
  },
  {
    "title": "Cormac Ó hEadhra is a smart guy but he asks some pretty dumb questions",
    "description": "Radio: The RTÉ Drivetime host shouldn’t be startled by the number of people who prefer to avoid the news",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/06/20/cormac-o-headhra-can-ask-some-pretty-dumb-sounding-questions-for-a-smart-guy/",
    "timestamp": "2025-06-20T04:16:00Z"
  },
  {
    "title": "Euro-visions: A Larger Global Role for the Euro?",
    "description": "Peter Bofinger is professor of economics at Würzburg University and a former member of the German Council of Economic Experts",
    "link": "https://www.ipsnews.net/2025/06/euro-visions-larger-global-role-euro/",
    "timestamp": "2025-06-20T04:15:52Z"
  },
  {
    "title": "Uncertainty clouds MCC in Nepal despite US Embassy’s reassuring statement",
    "description": "KATHMANDU: A recent statement by the U.S. Embassy in Nepal regarding the Millennium Challenge Corporation (MCC) Compact has triggered a wave of speculation and optimism, but key officials remain unsure about the future of the grant program amid funding cuts a…",
    "link": "https://english.khabarhub.com/2025/20/478893/",
    "timestamp": "2025-06-20T04:15:45Z"
  },
  {
    "title": "Democrats in Virginia have a hefty fundraising advantage heading into November general election",
    "description": "Democrats in Virginia have built up a hefty fundraising advantage for their effort to reclaim the governor's mansion in November's general election",
    "link": "https://abcnews.go.com/US/wireStory/democrats-virginia-hefty-fundraising-advantage-heading-november-general-123028891",
    "timestamp": "2025-06-20T04:14:47Z"
  },
  {
    "title": "US debate over whether to bomb Iran stirs memories of Iraq war",
    "description": "Shadow of intelligence debacle two decades ago hangs over Donald Trump as he considers joining Israeli attacks",
    "link": "https://biztoc.com/x/6c39a22a6eb351d9",
    "timestamp": "2025-06-20T04:13:44Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids. The decision halts a ruling from a lower court judge who found Trump acted illegally whe…",
    "link": "https://freerepublic.com/focus/f-news/4324177/posts",
    "timestamp": "2025-06-20T04:09:27Z"
  },
  {
    "title": "Israel’s Attacks have Exposed Iran’s Weaknesses, but it is in Little Danger of Collapsing",
    "description": "By Farhang Morady, University of Westminster The Israeli prime minister, Benjamin Netanyahu, has said that his country’s campaign in Iran “could certainly” lead to regime change. In an interview with Fox News on June 15, he called the government in Tehran “ve…",
    "link": "https://www.juancole.com/2025/06/israels-weaknesses-collapsing.html",
    "timestamp": "2025-06-20T04:06:23Z"
  },
  {
    "title": "Donald Trump delays decision on Iran strikes as Keir Starmer calls for restraint",
    "description": "Donald Trump has delayed a decision on whether to join Israeli attacks on Iran as Sir Keir Starmer continues to urge restraint in the Middle East. The US president said he was still hopeful of reaching a negotiated solution with Tehran and would decide on mil…",
    "link": "https://freerepublic.com/focus/f-news/4324176/posts",
    "timestamp": "2025-06-20T04:05:32Z"
  },
  {
    "title": "Donald Trump needs to make a huge decision. Why delay it two weeks?",
    "description": "With Donald Trump delaying his decision on possible US military action in the Middle East, what is he playing at?",
    "link": "https://www.abc.net.au/news/2025-06-20/donald-trump-iran-israel-decision-explainer/105440968",
    "timestamp": "2025-06-20T04:05:12Z"
  },
  {
    "title": "Trump can’t Stop the Green Energy Revolution any More than Horses could Stop the Automobile",
    "description": "( Tomdispatch.com ) - He lived over 1,000 years ago, but King Canute’s life still has some important lessons for our own time. After conquering England, Denmark, Norway, and part of Sweden, he forged a vast North Sea empire that made him, by the year 1030, th…",
    "link": "https://www.juancole.com/2025/06/energy-revolution-automobile.html",
    "timestamp": "2025-06-20T04:04:01Z"
  },
  {
    "title": "Trump-Connected Company Pulls Back From Family Crypto Business",
    "description": "President Donald Trump-linked company DT Marks DeFi LLC has reduced its stake in World Liberty Financial, a cryptocurrency project backed by the U.S. first family.\nWhat Happened: According to World Liberty’s website, DT Marks DeFi holds a 40% equity interest …",
    "link": "https://biztoc.com/x/63e9e5cf54672087",
    "timestamp": "2025-06-20T04:01:58Z"
  },
  {
    "title": "The First Great Mistake",
    "description": "For any of you out there hoping against hope that Israel might stop the bombing of Iran, forget about it. Israel, along with Uncle Sam, who now wears a blondish haircut, will not stop until there is regime change in Iran. As oil prices go through the roof, Is…",
    "link": "https://www.lewrockwell.com/2025/06/taki-theodoracopulos/the-first-great-mistake/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "How America Goes to War: Iraq, Ukraine and Now Iran",
    "description": "After promising during the 2024 election to stop the USA’s ‘forever wars’ in the 21st century, in less than six months in office Donald Trump is about to start another ‘forever’ war with Iran. There’ll be no prior vote in Congress, as required by the US Const…",
    "link": "https://www.lewrockwell.com/2025/06/no_author/how-america-goes-to-war-iraq-ukraine-and-now-iran/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "America’s Choice: National Divorce or Civil War",
    "description": "The current political structure of the United States is not viable long-term. Put simply, there are far too many differences existing among the numerous varieties of peoples who make up America to have them all ruled from one central authority. The same scena…",
    "link": "https://www.lewrockwell.com/2025/06/no_author/americas-choice-national-divorce-or-civil-war/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "Israel’s Attack on Iran: The Violent New World Being Born Is Going To Horrify You",
    "description": "Western politicians and media are tying themselves up in knots trying to spin the impossible: presenting Israel’s unmistakable war of aggression against Iran as some kind of “defensive” move. This time there was no rationalising pretext, as there was for Isra…",
    "link": "https://original.antiwar.com/cook/2025/06/19/israels-attack-on-iran-the-violent-new-world-being-born-is-going-to-horrify-you/",
    "timestamp": "2025-06-20T04:00:59Z"
  },
  {
    "title": "Sensex gains over 250 pts, Nifty above 24,850 as bank, auto stocks lead rally",
    "description": "Indian stock markets saw a positive start on Friday. The BSE Sensex and Nifty50 both showed gains in early trading. Banking and auto sector stocks are performing well. Bajaj Finserv and Mahindra & Mahindra are among the top gainers. However, some stocks like …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-gains-over-250-pts-nifty-above-24850-as-bank-auto-stocks-lead-rally/articleshow/121965918.cms",
    "timestamp": "2025-06-20T04:00:05Z"
  },
  {
    "title": "Destroying Iran’s Nuclear Capability: Once Again, Israel, Thank You",
    "description": "In attacking numerous military targets in Iran on June 13, 2025 as part of its Operation Rising Lion, Israel made good on a 1981 policy announced by then Prime Minister Menachem Begin:\r\n\r\n\r\n‘We shall defend our people with all the means at our ...",
    "link": "https://www.americanthinker.com/articles/2025/06/destroying_iran_s_nuclear_capability_once_again_israel_thank_you.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "The Elites Lose Narrative Control",
    "description": "The state is losing control over the dominant narratives in the competition of prevailing stories. Its apparatus of power responds predictably invasively and reveals its hostility toward dissenting opinions.\r\n\r\nThe German Bundestag’s Vice Presi...",
    "link": "https://www.americanthinker.com/articles/2025/06/the_elites_lose_narrative_control.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Ayatollah Biden’s regime is already changing",
    "description": "They say generals always want to fight the last war. So too, a lot of pundits always want to protest the last war. Tucker Carlson was one of many journalists who supported the Iraq War but is now an isolationist, unlike his buddies Pat Buch...",
    "link": "https://www.americanthinker.com/blog/2025/06/ayatollah_biden_s_regime_is_already_changing.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Saving Persia from Iran",
    "description": "“I have never advocated war except as a means of peace.” — Ulysses S. Grant\r\n\r\nI’ve been following U.S. naval ship movements in the Mediterranean, Red Sea, and Persian Gulf, the bomber build-up at Diego Garcia, and USAF logist...",
    "link": "https://www.americanthinker.com/blog/2025/06/saving_persia_from_iran.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Powell and the Fed are wrong",
    "description": "The Fed chairman, Jerome Powell, announced again that the Fed is going to hold rates where they are, marking the third (or fourth) time that the chairman has stood pat on interest rates since Donald Trump’s inauguration.\r\n\r\nTrump responded,&nbs...",
    "link": "https://www.americanthinker.com/blog/2025/06/powell_and_the_fed_are_wrong.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wtvm.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T03:56:53Z"
  },
  {
    "title": "Japan's trade negotiator says US tariff talks are 'in a fog'",
    "description": "TOKYO (Reuters) -Japan's top trade negotiator Ryosei Akazawa said on Friday that trade negotiations with the U.S. \"remained in a fog\" despite efforts by both...",
    "link": "https://finance.yahoo.com/news/japans-trade-negotiator-says-us-035629589.html",
    "timestamp": "2025-06-20T03:56:29Z"
  },
  {
    "title": "Trump Keeps Control of California National Guard After New Appeals Court Ruling",
    "description": "But the legal battle with California Governor Gavin Newsom continues Friday in a San Francisco district court room\nThe post Trump Keeps Control of California National Guard After New Appeals Court Ruling appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-keeps-control-of-california-national-guard-appeals-court-rules/",
    "timestamp": "2025-06-20T03:54:01Z"
  },
  {
    "title": "Trump allowed to keep using national guard in LA for now",
    "description": "Thursday’s decision isn’t the final ruling on the matter and is likely to be immediately challenged.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/crime-legal/national-guard-la-ruling/",
    "timestamp": "2025-06-20T03:52:00Z"
  },
  {
    "title": "Trump Tax Bill Bails Out Private Equity's Layoff Scheme (Luke Goldstein/The Lever)",
    "description": "Luke Goldstein / The Lever:\nTrump Tax Bill Bails Out Private Equity's Layoff Scheme  —  Lawmakers quietly added a line that effectively subsidizes Wall Street buying up companies, slashing wages, closing factories, and firing workers.  —  Congressional lawmak…",
    "link": "https://www.memeorandum.com/250619/p132",
    "timestamp": "2025-06-20T03:50:00Z"
  },
  {
    "title": "Japan Won’t Fixate on July 9 in US Trade Talks, Akazawa Says",
    "description": "Japan won’t fixate on the looming date for so-called reciprocal tariffs to go back to higher levels, Tokyo’s top trade negotiator said, signaling that the Asian nation stands ready for the possibility that talks will drag on.",
    "link": "https://financialpost.com/pmn/business-pmn/japan-wont-fixate-on-july-9-in-us-trade-talks-akazawa-says",
    "timestamp": "2025-06-20T03:47:38Z"
  },
  {
    "title": "US court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "A US court allowed Donald Trump to keep control of California's National Guard. This happened while Governor Gavin Newsom is challenging Trump's use of troops in Los Angeles. The court paused a ruling that said Trump's action was illegal. Newsom argued Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-los-angeles/articleshow/121965729.cms",
    "timestamp": "2025-06-20T03:44:47Z"
  }
]