[
  {
    "title": "BROADCAST BIAS: Networks skip the news, pretend they're on 'Law & Order' defending Venezuelan gang",
    "description": "For ABC, CBS, and NBC any foreign figures who are being deported by Trump automatically assume the mantle of innocent victim, no matter how criminal their behavior.",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-networds-skip-news-pretend-laworder-defending-venezuelan-gang",
    "timestamp": "2025-03-22T11:00:02Z"
  },
  {
    "title": "Rising costs from Canada-U.S. trade war putting pressure on Brandon construction firms",
    "description": "Skyrocketing costs and unpredictable tariff policies are forcing construction companies to reconsider some projects, with some put on hold or scrapped, an industry spokesman says.",
    "link": "https://www.cbc.ca/news/canada/manitoba/construction-brandon-tariffs-1.7488760",
    "timestamp": "2025-03-22T11:00:00Z"
  },
  {
    "title": "No extra pay for Sunita Williams, Butch William for 278 extra days in space? Trump responds with this",
    "description": "Despite the extended stay, the two NASA astronauts won’t receive any overtime pay. Their status as federal employees means they draw a fixed salary—no weekend bonuses, no holiday pay, and certainly no outer-space overtime",
    "link": "https://www.businesstoday.in/latest/world/story/no-extra-pay-for-sunita-williams-butch-william-for-278-extra-days-in-space-trump-responds-with-this-468913-2025-03-22",
    "timestamp": "2025-03-22T10:59:28Z"
  },
  {
    "title": "The livestream from Gaza’s killing fields resumes",
    "description": "Israel shatters the ceasefire in Gaza and issues 'final warning' to Palestinians.",
    "link": "https://www.aljazeera.com/program/the-listening-post/2025/3/22/the-livestream-from-gazas-killing-fields-resumes",
    "timestamp": "2025-03-22T10:58:52Z"
  },
  {
    "title": "She hoped Trump would revive her farm. Now she worries his policies could bankrupt it",
    "description": "After Donald Trump won the presidency again, Rebecca Carlson was counting on this being the year things turned around for her 1,300-acre farm in northern Michigan.",
    "link": "https://biztoc.com/x/c937cf467bd17f5e",
    "timestamp": "2025-03-22T10:56:11Z"
  },
  {
    "title": "Trump’s makeover of U.S. diplomacy leaves many allies at a loss",
    "description": "Like with most things in Trump’s tenure so far, the president’s second-term playbook on diplomacy marks a significant shift from the past.",
    "link": "https://www.japantimes.co.jp/news/2025/03/22/world/trump-us-allies-at-loss/",
    "timestamp": "2025-03-22T10:52:00Z"
  },
  {
    "title": "Trump moves to dismantle the Education Department, shifting key programs to other agencies",
    "description": "President Trump plans to dismantle Education Department, shifting responsibilities to other agencies, raising concerns about service disruptions.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/trump-moves-to-dismantle-the-education-department-shifting-key-programs-to-other-agencies/article69361355.ece",
    "timestamp": "2025-03-22T10:50:05Z"
  },
  {
    "title": "Trump administration revokes legal status of more than 530,000 Cubans, Haitians, Nicaraguans and Venezuelans",
    "description": "Order cuts short programme introduced by Biden in response to illegal crossings at US-Mexico border",
    "link": "https://www.irishtimes.com/world/us/2025/03/22/trump-administration-revokes-legal-status-of-more-than-530000-cubans-haitians-nicaraguans-and-venezuelans/",
    "timestamp": "2025-03-22T10:49:22Z"
  },
  {
    "title": "Prospects for ceasefire, election in Ukraine, Kiev’s membership in NATO: Key takeaways from Trump envoy’s interview",
    "description": "The US has made “tremendous progress” in settling the conflict during talks with Russia, Steve Witkoff has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614620-witkoff-interview-ukraine-recap/",
    "timestamp": "2025-03-22T10:48:56Z"
  },
  {
    "title": "Social Security Chief Rows Back on Shutting Down Agency",
    "description": "Acting Commissioner Leland Dudek had said he'd \"terminate access by all SSA employees to our IT systems\" following a court order.",
    "link": "https://www.newsweek.com/social-security-chief-rows-back-shutting-down-agency-2048970",
    "timestamp": "2025-03-22T10:48:34Z"
  },
  {
    "title": "Trump Trying to Retrade Minerals Deal with Ukraine",
    "description": "Trump engaging in more self-defeating behavior, assuming he really does want a Ukraine settlement with Russia.",
    "link": "https://www.nakedcapitalism.com/2025/03/trump-trying-to-retrade-minerals-deal-with-ukraine.html",
    "timestamp": "2025-03-22T10:47:33Z"
  },
  {
    "title": "Building something from zero: The women of Beilinson treating returned hostages",
    "description": "'We met returnees from captivity who are admirable figures. They have this sparkle in their eyes. Even though they met such evil, a lack of humanity, they remained human, loving friends with hope.'",
    "link": "https://www.jpost.com/israel-news/article-845789",
    "timestamp": "2025-03-22T10:45:21Z"
  },
  {
    "title": "Don’t Be Shocked If MLB Strikes Out Jackie Robinson Day With DEI Fastball",
    "description": "Jackie Robinson Day? It’s going, going, almost gone. Major League Baseball officials are scared of new governmental mandates against diversity, equity and inclusion.",
    "link": "https://www.forbes.com/sites/terencemoore/2025/03/22/dont-be-shocked-if-mlb-strikes-out-jackie-robinson-day-with-dei-fastball/",
    "timestamp": "2025-03-22T10:45:00Z"
  },
  {
    "title": "Elon Musk tells Tesla staff future is ‘bright’; urges them to hold on to stock",
    "description": "The car maker Tesla’s stock has fallen nearly 50% from its peak in December. Tesla is facing backlash because of Musk’s role in President Donald Trump’s administration as head of the newly-formed Department of Government Efficiency (DOGE), where he has shut d…",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musk-tells-tesla-staff-future-is-bright-urges-them-to-hold-on-to-stock/articleshow/119339379.cms",
    "timestamp": "2025-03-22T10:41:43Z"
  },
  {
    "title": "Billionaire Trump official makes alarming claim about witholding social security checks from Americans",
    "description": "Billionaire Trump official makes alarming claim about witholding social security checks from Americanspennlive.com",
    "link": "https://www.pennlive.com/news/2025/03/billionaire-trump-official-makes-alarming-claim-about-witholding-social-security-checks-from-americans.html",
    "timestamp": "2025-03-22T10:36:16Z"
  },
  {
    "title": "Three Killed in Russian Attacks on Ukraine's Zaporizhzhia Despite Limited Truce",
    "description": "Russia launched a drone attack on the Ukrainian city of Zaporizhzhia, killing three people and wounded 12, Ukrainian officials said Saturday, despite agreeing to a limited ceasefire.\nThe post Three Killed in Russian Attacks on Ukraine’s Zaporizhzhia Despite L…",
    "link": "https://www.breitbart.com/europe/2025/03/22/three-killed-in-russian-attacks-on-ukraines-zaporizhzhia-despite-limited-truce/",
    "timestamp": "2025-03-22T10:34:51Z"
  },
  {
    "title": "Full List of Names Donald Trump Has Stripped of Security Clearance",
    "description": "President Donald Trump revoked the security clearance of several former political rivals, including Joe Biden and Hillary Clinton.",
    "link": "https://biztoc.com/x/45bc2a0ba3c19d45",
    "timestamp": "2025-03-22T10:33:53Z"
  },
  {
    "title": "How a Major Democratic Law Firm Ended Up Bowing to Trump - The New York Times",
    "description": "How a Major Democratic Law Firm Ended Up Bowing to TrumpThe New York Times The Memo: Democrats, lawyers left reeling from Paul, Weiss firm’s Trump dealThe Hill Legal community shaken by a powerful law firm's decision to give in to Trump's demandsNBC News The …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176790583",
    "timestamp": "2025-03-22T10:32:24Z"
  },
  {
    "title": "Five controversies that rocked Disney's 'Snow White' remake before its release",
    "description": "Disney's live-action \"Snow White\" remake, arriving in theaters this weekend, has been shaken by controversy after controversy since it went into production.",
    "link": "https://www.foxnews.com/media/five-controversies-rocked-disneys-snow-white-remake-before-its-release",
    "timestamp": "2025-03-22T10:30:51Z"
  },
  {
    "title": "Full List of Names Donald Trump Has Stripped of Security Clearance",
    "description": "President Donald Trump revoked the security clearance of several former political rivals, including Joe Biden and Hillary Clinton.",
    "link": "https://www.newsweek.com/full-list-names-donald-trump-has-stripped-security-clearance-2048973",
    "timestamp": "2025-03-22T10:24:39Z"
  },
  {
    "title": "한심한 어른아이, 국민 밉상 일론 머스크",
    "description": "European stocks fell for a second day, trimming weekly gains, as sentiment remained fragile over trade tariffs and the state of the economy https://t.co/S8paIy0dcG— Bloomberg Economics (@economics) March 21, 2025 Israel's IDF vowed to respond \"severely\" follo…",
    "link": "https://ryueyes11.tistory.com/511537",
    "timestamp": "2025-03-22T10:23:02Z"
  },
  {
    "title": "Maher: 'Europe Should Pay for Their Own Defense'",
    "description": "On Friday’s broadcast of HBO’s “Real Time,” host Bill Maher said that while President Donald Trump is going about it the wrong way, he’s correct that “Europe should pay for their own defense.” Maher said, “[T]here are some things I\nThe post Maher: ‘Europe Sho…",
    "link": "https://www.breitbart.com/clips/2025/03/22/maher-europe-should-pay-for-their-own-defense/",
    "timestamp": "2025-03-22T10:18:43Z"
  },
  {
    "title": "3 retail investors share what led them to cash out of Tesla on its way to a 50% drop",
    "description": "Three retail investors shared with Business Insider what made them sell before the drop.",
    "link": "https://www.businessinsider.com/tesla-stock-elon-musk-retail-investors-sell-doge-trump-volatility-2025-3",
    "timestamp": "2025-03-22T10:17:01Z"
  },
  {
    "title": "Donald Trump and John Roberts: Two sides of a US judiciary under pressure",
    "description": "(Reuters) -For two of the most powerful men in the United States, Donald Trump and John Roberts, it has been a delicate dance from the start.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/22/donald-trump-and-john-roberts-two-sides-of-a-us-judiciary-under-pressure",
    "timestamp": "2025-03-22T10:16:00Z"
  },
  {
    "title": "US senator and Trump supporter Daines meets Chinese Vice Premier He with warm exchanges",
    "description": "U.S. Senator Steve Daines, a strong supporter of President Donald Trump, met with Chinese Vice Premier He Lifeng with warm exchanges in front of journalists on Saturday as tensions between their countries spiked over trade tariffs and the handling of i...",
    "link": "https://abcnews.go.com/US/wireStory/us-senator-trump-supporter-daines-meets-chinese-vice-120052140",
    "timestamp": "2025-03-22T10:14:31Z"
  },
  {
    "title": "Three people killed in Russian drone strike on Ukraine's Zaporizhzhia",
    "description": "It comes after Russian President Vladimir Putin agreed this week to pause strikes on Ukraine energy targets for 30 days.",
    "link": "https://www.thejournal.ie/three-killed-russian-drone-strike-zaporizhzhia-ukraine-6656471-Mar2025/",
    "timestamp": "2025-03-22T10:07:06Z"
  },
  {
    "title": "EAA Comments On Bedford Nomination As FAA Administrator",
    "description": "Looking Forward To Working With And Inviting Him To AirVenture The Experimental Aircraft Association released comments on Bryan Bedford’s nomination by President Donald Trump to be the next Administrator of the FAA. He is currently the CEO of Republic Airways…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=31AD84A1-B1E8-4BEC-8D4B-8F5F53094329",
    "timestamp": "2025-03-22T10:05:00Z"
  },
  {
    "title": "Russian drone attack kills three in Ukrainian city of Zaporizhzhia",
    "description": "Drone strike comes after Ukraine and Russia agreed a limited ceasefire in principle on Wednesday",
    "link": "https://www.irishtimes.com/world/europe/2025/03/22/ukraine-russia-us-war-latest-updates/",
    "timestamp": "2025-03-22T10:01:21Z"
  },
  {
    "title": "How Poilievre is trying to keep the election about the Liberals, not Donald Trump",
    "description": "In the lead up to Sunday's election call, anxiety and confusion has set in among some Conservatives, including within Poilievre's office",
    "link": "https://nationalpost.com/news/canada/poilievre-election-liberals-not-donald-trump",
    "timestamp": "2025-03-22T10:00:39Z"
  },
  {
    "title": "Migrants, Visitors Anxious Over Trump Travel Ban Debate Heading to US Early",
    "description": "Immigrants and potential visitors from dozens of counties were still waiting Friday for news of a travel ban from President Donald Trump, with some debating whether heading to the United States now would be a good idea.\nAlthough a draft list was reportedly le…",
    "link": "https://biztoc.com/x/f006a494f29a8db8",
    "timestamp": "2025-03-22T10:00:38Z"
  },
  {
    "title": "Bitcoin To Flourish With Or Without Trump's Support, Says Expert: Fed's Rate Cuts Could Make People More 'Inclined' To Buy BTC",
    "description": "Bitcoin (CRYPTO: BTC) is expected to reach a six-figure valuation by 2025, according to Nigel Green, CEO of deVere Group. This prediction comes despite the lack of explicit support from U.S. President Donald Trump.\nWhat Happened: In a recent video update, Gre…",
    "link": "https://biztoc.com/x/3522607e447d0b59",
    "timestamp": "2025-03-22T10:00:38Z"
  },
  {
    "title": "New polls reveal what Americans think about Trump months into his second term",
    "description": "The latest polls gauge President Donald Trump's standing among Americans two months in to his second tour of duty in the White House.",
    "link": "https://www.foxnews.com/politics/new-polls-reveal-what-americans-think-about-trump-months-into-his-second-term",
    "timestamp": "2025-03-22T10:00:27Z"
  },
  {
    "title": "Trump's Health Care Order Will Deliver Big Savings to Patients, Employers | Opinion",
    "description": "With his groundbreaking executive order on health care price transparency, President Donald Trump paved the way to protecting American patients and employers from the inflationary costs of the American health care system.\nRiddled with waste, fraud, and price …",
    "link": "https://biztoc.com/x/1907f3911258b4cc",
    "timestamp": "2025-03-22T10:00:26Z"
  },
  {
    "title": "Cold War redux in more ways than one: Russia and the U.S. look to thaw relations in the hockey rink",
    "description": "This week Russian President Vladimir Putin revived the Cold War tradition of taking geopolitics onto the ice, suggesting in a call to President Donald Trump that American and Russian skaters play matches against each other.diplomacy.",
    "link": "https://www.nbcnews.com/news/world/cold-war-redux-russia-us-thaw-relations-hockey-rink-diplomacy-rcna197220",
    "timestamp": "2025-03-22T10:00:10Z"
  },
  {
    "title": "Migrants, Visitors Anxious Over Trump Travel Ban Debate Heading to US Early",
    "description": "Over 40 countries are reportedly being considered for travel restrictions of some kind.",
    "link": "https://www.newsweek.com/trump-travel-ban-immigrants-visitors-debate-political-fallout-2048897",
    "timestamp": "2025-03-22T10:00:03Z"
  },
  {
    "title": "Trump's Health Care Order Will Deliver Big Savings to Patients, Employers | Opinion",
    "description": "With his groundbreaking executive order on health care price transparency, President Donald Trump paved the way to protecting American patients.",
    "link": "https://www.newsweek.com/trumps-health-care-order-will-deliver-big-savings-patients-employers-opinion-2047435",
    "timestamp": "2025-03-22T10:00:01Z"
  },
  {
    "title": "Trump isn't just attacking judges. Now he's attacking lawyers, too.",
    "description": "President Donald Trump has escalated his attacks on the legal system to include lawyers who've dared to represent the other side in his legal cases.",
    "link": "https://www.msnbc.com/inside-with-jen-psaki/trump-paul-weiss-perkins-coie-rule-law-rcna197524",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Lawmakers fear DOGE cuts will drive away next generation of federal workers",
    "description": "Members of both parties warn that Trump and Musk's efforts will severely hinder the government's ability to recruit young people and technical experts.",
    "link": "https://www.nbcnews.com/politics/congress/lawmakers-fear-doge-cuts-will-drive-away-generation-federal-workers-rcna197085",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Trump's Kennedy Center fantasies are chasing away its primary audiences",
    "description": "President Trump doesn't seem to understand what the Kennedy Center does or the people who regularly pay to watch performances there.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-kennedy-center-audience-rcna197179",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Chuck Schumer is under siege — by his own party",
    "description": "Democrats are calling for Chuck Schumer to resign from leadership after he caved to Trump. Is he in trouble?",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/chuck-schumer-resign-trump-senate-democrats-rcna197375",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Trump’s FCC leader threatens to kill mergers over DEI policies",
    "description": "Trump’s handpicked appointee sitting atop the Federal Communications Commission declared that his agency is prepared to block mergers and attempted acquisitions involving companies that promote diversity policies.",
    "link": "https://www.msnbc.com/top-stories/latest/fcc-chairman-brendan-carr-mergers-dei-media-rcna197567",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Author and Activist Bill McKibben on Climate Progress in the Age of Trump 2.0",
    "description": "This story was originally published by Yale e360 and is reproduced here as part of the Climate Desk collaboration. In the first six weeks of the new Trump administration, it’s become clear that the president intends to undo not just Joe Biden’s environmental …",
    "link": "https://www.motherjones.com/politics/2025/03/author-activist-bill-mckibben-elizabeth-kolbert-interview-climate-progress-second-trump-administration/",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Israel’s “Culture of Cruelty” Inspires the Far Right Worldwide, Says Pankaj Mishra",
    "description": "“The World After Gaza” author on what Israel’s war reveals about power, violence, and who sets the rules on the world stage.\nThe post Israel’s “Culture of Cruelty” Inspires the Far Right Worldwide, Says Pankaj Mishra appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/22/briefing-podcast-pankaj-mishra-gaza/",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "The Media Is Responding to Trump With a Huge Face-Plant",
    "description": "In February of 2021, a fitness instructor named Khing Hnin Wai shot what might be history’s most viral aerobics lesson. Filming herself in front of a major thoroughfare in Myanmar’s capital city, Khing went through her paces, gyrating purposefully to some up-…",
    "link": "https://newrepublic.com/post/193002/media-trump-doge-failure-economy",
    "timestamp": "2025-03-22T10:00:00Z"
  },
  {
    "title": "Italy PM Giorgia Meloni govt’s deal with Elon Musk’s Starlink has stalled, says defence minister",
    "description": "Negotiations between Elon Musk's Starlink and the Italian government for an encrypted communication system have stalled. Italy aims to secure communications for officials in risky areas, but talks have been hindered by geopolitical tensions and opposition con…",
    "link": "https://economictimes.indiatimes.com/news/international/business/italy-pm-giorgia-melonis-govts-deal-with-elon-musks-starlink-has-stalled-says-defence-minister/articleshow/119338328.cms",
    "timestamp": "2025-03-22T09:58:29Z"
  },
  {
    "title": "Cornell student who challenged Trump EOs targeting pro-Palestinian protesters now faces deportation",
    "description": "Cornell student who challenged Trump EOs targeting pro-Palestinian protesters now faces deportationgo.com",
    "link": "https://abcnews.go.com/US/cornell-student-protester-told-turn-ice-asks-court/story?id=120046429",
    "timestamp": "2025-03-22T09:56:27Z"
  },
  {
    "title": "Grapevine: Wandering Jews",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-846711",
    "timestamp": "2025-03-22T09:56:10Z"
  },
  {
    "title": "Judge Boasberg Threatens Trump [semi-satire]",
    "description": "Incensed that he isn't getting obedience from President Trump regarding his several orders related to the deportation of more than 200 members of the Venezuelan gang Tren de Aragua, Federal District Court Judge James Boasberg pointed out \"my term of office is…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306000/posts",
    "timestamp": "2025-03-22T09:48:48Z"
  },
  {
    "title": "Donald Trump Is Making His Judge-Induced Temper Tantrums Everyone’s Problem",
    "description": "It was a long week of escalating constitutional crises.",
    "link": "https://slate.com/news-and-politics/2025/03/trump-boasberg-constitutional-crisis-battle.html",
    "timestamp": "2025-03-22T09:45:00Z"
  },
  {
    "title": "Pro-Trump senator set to meet Chinese premier",
    "description": "Republican Senator Steve Daines will meet Premier Li Qiang on Sunday, a senior Chinese official announced as the strong supporter of US President Donald Trump visits Beijing. The 62-year-old lawmaker has vowed to raise trade tensions and fentanyl smuggling du…",
    "link": "https://www.digitaljournal.com/world/pro-trump-senator-set-to-meet-chinese-premier/article",
    "timestamp": "2025-03-22T09:43:15Z"
  },
  {
    "title": "Pro-Trump senator Steve Daines meets China’s economy tsar He Lifeng amid mounting trade tensions",
    "description": "Daines is the first member of the US Congress to visit Beijing since Donald Trump took office in January, and his office has said he is coordinating closely with the White House and will be “carrying President Trump’s America First agenda”.",
    "link": "https://www.channelnewsasia.com/east-asia/trump-us-china-steve-daines-senator-meet-he-lifeng-tariffs-5017606",
    "timestamp": "2025-03-22T09:41:48Z"
  },
  {
    "title": "Crypto debanking is not over until Jan 2026: Caitlin Long",
    "description": "The cryptocurrency industry may still be facing debanking-related issues in the United States, despite the recent wave of positive legislation, according to crypto regulatory experts and industry leaders.The collapse of crypto-friendly banks in early 2023 spa…",
    "link": "https://cointelegraph.com/news/crypto-debanking-over-jan-2026-caitlin-long",
    "timestamp": "2025-03-22T09:41:39Z"
  },
  {
    "title": "Romanian police launch anti-Georgescu crackdown (VIDEOS)",
    "description": "Romanian police have raided the homes of opposition campaign backers amid voter bribery claims tied to Calin Georgescu Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614619-romanian-police-georgescu-crackdown/",
    "timestamp": "2025-03-22T09:31:50Z"
  },
  {
    "title": "Judge James Boasberg had nonpartisan record before facing Trump’s fury",
    "description": "He’s a former law school roommate of Brett Kavanaugh and his personality has poked through his rulings with quirky references to Star Trek and Fugees lyrics.",
    "link": "https://www.cnn.com/2025/03/22/politics/who-is-judge-james-boasberg/index.html",
    "timestamp": "2025-03-22T09:30:58Z"
  },
  {
    "title": "Mortgage rates are going down. That's not necessarily a good thing.",
    "description": "Mortgage rates have come down from their recent peak, but it could be a sign of overall economic weakness and a potential recession.",
    "link": "https://www.businessinsider.com/mortgage-rates-falling-recession-consumer-confidence-housing-market-homebuyer-tariff-2025-3",
    "timestamp": "2025-03-22T09:27:01Z"
  },
  {
    "title": "US senator and Trump supporter Daines meets Chinese Vice Premier He with warm exchanges",
    "description": "U.S. Senator Steve Daines, a strong supporter of President Donald Trump met with Chinese Vice Premier He Lifeng with warm exchanges in front of journalists on Saturday as tensions between their countries spiked over trade tariffs and the handling of illegal t…",
    "link": "https://www.seattlepi.com/news/world/article/us-senator-and-trump-supporter-daines-meets-20235313.php",
    "timestamp": "2025-03-22T09:20:49Z"
  },
  {
    "title": "Andrew Tate back in Romania after flap over US trip",
    "description": "<p>Self-described &ldquo;misogynist&rdquo; influencer Andrew Tate and his brother Tristan returned to Romania for police checks in an ongoing criminal investigation, denying claims that the Trump administration had pressured authorities to end a travel ban an…",
    "link": "https://www.bangkokpost.com/world/2985386/andrew-tate-back-in-romania-after-flap-over-us-trip",
    "timestamp": "2025-03-22T09:20:00Z"
  },
  {
    "title": "Donald Trump’s major makeover of US diplomacy leaves many allies at a loss",
    "description": "US President Donald Trump's second term has dramatically altered US foreign diplomacy. A significant shift in policies on Russia, climate change, and global trade has created confusion and disrupted communication channels. Some allies find it difficult to adj…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-major-makeover-of-us-diplomacy-leaves-many-allies-at-a-loss/articleshow/119336959.cms",
    "timestamp": "2025-03-22T09:15:38Z"
  },
  {
    "title": "US senator and Trump supporter Daines meets Chinese Vice Premier He with warm exchanges",
    "description": "U.S. Senator Steve Daines, a strong supporter of President Donald Trump, met with Chinese Vice Premier He Lifeng with warm exchanges in front of journalists on Saturday as tensions between their countries spiked over trade tariffs and the handling of illegal …",
    "link": "https://www.clickondetroit.com/business/2025/03/22/us-senator-and-trump-supporter-daines-meets-chinese-vice-premier-he-with-warm-exchanges/",
    "timestamp": "2025-03-22T09:15:24Z"
  },
  {
    "title": "U.S. defense chief Pete Hegseth to visit Japan next week",
    "description": "Hegseth will visit the Pacific island of Iwo Jima to participate in a joint memorial ceremony as Japan and the U.S. mark 80 years since the end of World War II.",
    "link": "https://www.japantimes.co.jp/news/2025/03/22/japan/pete-hegseth-japan-trip/",
    "timestamp": "2025-03-22T09:10:00Z"
  },
  {
    "title": "US senator and Trump supporter Daines meets Chinese Vice Premier He with warm exchanges",
    "description": "BEIJING (AP) — U.S. Senator Steve Daines, a strong supporter of President Donald Trump met with Chinese Vice Premier He Lifeng, with warm exchanges in front of journalists on Saturday even as tensions between their countries spiked over trade tariffs and the …",
    "link": "https://financialpost.com/pmn/us-senator-and-trump-supporter-daines-meets-chinese-vice-premier-he-with-warm-exchanges",
    "timestamp": "2025-03-22T09:07:54Z"
  },
  {
    "title": "Italy's talks with Musk's Starlink have stalled, minister says",
    "description": "ROME :Negotiations on a potential contract between Elon Musk's satellite internet operator Starlink and the Italian government have stalled, reflecting broader geopolitical tensions, Italy's defence minister said on Saturday. Prime Minister Giorgia Meloni's g…",
    "link": "https://www.channelnewsasia.com/business/italys-talks-musks-starlink-have-stalled-minister-says-5017611",
    "timestamp": "2025-03-22T09:04:57Z"
  },
  {
    "title": "Israel Resumes War in Gaza With Plan To Conquer Entire Strip",
    "description": "JERUSALEM—When Israel’s defense minister on Friday threatened to take the Gaza Strip from Hamas piece by piece, he was not just sabre-rattling. \nRather, Israel Katz was describing a war plan that already appeared to be underway. Amid airstrikes across Gaza st…",
    "link": "https://freebeacon.com/israel/israel-resumes-war-in-gaza-with-plan-to-conquer-entire-strip/",
    "timestamp": "2025-03-22T09:00:49Z"
  },
  {
    "title": "Trump and Bibi Issue an Ultimatum. Iran and Hamas Should Heed It.",
    "description": "After more than two weeks of fruitless negotiations for further hostage releases, Israel’s patience ran out. On Tuesday, the Israeli military bombarded Hamas leaders and positions in Gaza, and ground forces soon reentered the Hamas-ruled enclave.\nRenewed figh…",
    "link": "https://freebeacon.com/columns/trump-and-bibi-issue-an-ultimatum-iran-and-hamas-should-heed-it/",
    "timestamp": "2025-03-22T09:00:26Z"
  },
  {
    "title": "Trump policies 'promise' recession if fully implemented, UCLA's economic forecasting center warns",
    "description": "\"Even with the recent correction in stock prices, it's still highly valued and it could still fall further,\" said economist Clement Bohr.",
    "link": "https://www.businessinsider.com/stock-market-crash-trump-tariffs-promise-recession-ucla-anderson-forecast-2025-3",
    "timestamp": "2025-03-22T09:00:01Z"
  },
  {
    "title": "She hoped Trump would revive her farm. Now she worries his policies could bankrupt it.",
    "description": "After Donald Trump won the presidency again, Rebecca Carlson was counting on this being the year things turned around for her 1,300-acre farm in northern Michigan.",
    "link": "https://www.nbcnews.com/politics/economics/hoped-trump-revive-farm-now-worries-policies-bankrupt-rcna197320",
    "timestamp": "2025-03-22T09:00:00Z"
  },
  {
    "title": "Fishing for Canadian seafood at the grocery store? Labels may not tell the whole story",
    "description": "The Canadian Food Inspection Agency requires seafood to be labelled according to where it was processed, not where it was caught.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/fishing-for-canadian-seafood-at-the-grocery-store-labels-may-not-tell-the-whole-story-1.7486665",
    "timestamp": "2025-03-22T09:00:00Z"
  },
  {
    "title": "Charting the Global Economy: Fed, BOJ and BOE Hold Rates as Tariffs Loom",
    "description": "(Bloomberg) -- Central bankers in the US, Japan and UK held the line on interest rates this past week, opting for a patient policy approach in order to gauge...",
    "link": "https://finance.yahoo.com/news/charting-global-economy-fed-boj-090000115.html",
    "timestamp": "2025-03-22T09:00:00Z"
  },
  {
    "title": "US Revokes Legal Status For 500,000 Immigrants",
    "description": "The United States said Friday it was terminating the legal status of hundreds of thousands of immigrants, giving them weeks to leave the country.",
    "link": "https://www.ibtimes.com/us-revokes-legal-status-500000-immigrants-3767273",
    "timestamp": "2025-03-22T08:57:13Z"
  },
  {
    "title": "Hamas can be active politically after it disarms, Witkoff says",
    "description": "“We need to understand what Hamas wants and then think about what we can offer them to make them leave. That is what needs to happen here.\"",
    "link": "https://www.jpost.com/middle-east/article-847107",
    "timestamp": "2025-03-22T08:56:07Z"
  },
  {
    "title": "US revokes legal status for 500,000 immigrants",
    "description": "The United States said Friday it was terminating the legal status of hundreds of thousands of immigrants, giving them weeks to leave the country. President Donald Trump has pledged to carry out the largest deportation campaign in US history and curb immigrati…",
    "link": "https://www.digitaljournal.com/world/us-revokes-legal-status-for-500000-immigrants/article",
    "timestamp": "2025-03-22T08:52:20Z"
  },
  {
    "title": "US Defense Secretary Hegseth to send second aircraft carrier to Middle East",
    "description": "Hegseth's decision comes as the US's strikes on the Houthi terrorist organization in the region have been intensifying.",
    "link": "https://www.jpost.com/middle-east/article-847099",
    "timestamp": "2025-03-22T08:51:44Z"
  },
  {
    "title": "How Columbia gave in to Trump’s demands to get its $400m funding back",
    "description": "The New York university's federal funding was revoked last month over allegations of 'antisemitic harassment' on campus.",
    "link": "https://www.aljazeera.com/news/2025/3/22/how-columbia-gave-in-to-trumps-demands-to-get-its-400m-funding-back",
    "timestamp": "2025-03-22T08:51:14Z"
  },
  {
    "title": "American Glezmann Returns Home After 2-Year Detention In Afghanistan",
    "description": "George Glezmann, an American who was released from detention in Afghanistan on March 20, has arrived in the United States and been reunited with his wife, a State Department spokesperson said.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250321-rferl02.htm",
    "timestamp": "2025-03-22T08:47:41Z"
  },
  {
    "title": "Inside Sweden: Why a trip to Brussels made me more excited to become a Swedish citizen",
    "description": "The Local's Deputy Editor Becky Waterton rounds up the biggest stories of the week in our Inside Sweden newsletter.",
    "link": "https://www.thelocal.se/20250322/inside-sweden-why-a-trip-to-brussels-made-me-more-excited-to-become-a-swedish-citizen",
    "timestamp": "2025-03-22T08:46:21Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "Heathrow Airport ‘fully operational’ after shutdown, confusion over delayed free HRT scheme and George Foreman dies aged 76.",
    "link": "https://www.thejournal.ie/9-at-9-saturday-208-6656448-Mar2025/",
    "timestamp": "2025-03-22T08:45:52Z"
  },
  {
    "title": "US Air Force to Develop F-47, the World's First Sixth-Generation Fighter... With Boeing",
    "description": "US President Donald Trump announced on Friday that the Pentagon has granted Boeing a contract to design and build the world's first sixth-generation fighter jet, which will be named the F-47.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250321-sputnik01.htm",
    "timestamp": "2025-03-22T08:40:45Z"
  },
  {
    "title": "Air Force Awards Contract for Next Generation Air Dominance (NGAD) Platform, F-47",
    "description": "The Department of the Air Force announced today the contract award for the Engineering and Manufacturing Development (EMD) of the Next Generation Air Dominance (NGAD) Platform, marking a major milestone in the advancement of air superiority. The contract, awa…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250321-usaf01.htm",
    "timestamp": "2025-03-22T08:40:32Z"
  },
  {
    "title": "Trump, Hegseth Announce Air Force's Next Generation Fighter Platform",
    "description": "During a press conference at the White House today, President Donald J. Trump and Defense Secretary Pete Hegseth announced that the Air Force would proceed with the production of the Next Generation Air Dominance fighter jet platform.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250321-dodnews01.htm",
    "timestamp": "2025-03-22T08:40:18Z"
  },
  {
    "title": "Lucas: No decency in Democratic party",
    "description": "It’s a wonder crazed Democrats did not attack President Donald Trump for bringing home the two U.S. astronauts that Joe Biden left hanging in space for nine months.",
    "link": "https://www.bostonherald.com/2025/03/22/lucas-no-decency-in-democratic-party/",
    "timestamp": "2025-03-22T08:33:38Z"
  },
  {
    "title": "China raps sanctions, calls for end to U.S. interference in Beijing-Tehran cooperation",
    "description": "China has called on the United States to stop its interference in Beijing's economic cooperation with the Islamic Republic of Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250321-irna01.htm",
    "timestamp": "2025-03-22T08:32:37Z"
  },
  {
    "title": "Iran, like any other country, has the right to peaceful nuclear energy: Kremlin spokesperson",
    "description": "Russia has once again defended Iran's nuclear program, saying it is completely peaceful in nature and complies with international law.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250321-irna02.htm",
    "timestamp": "2025-03-22T08:32:23Z"
  },
  {
    "title": "Kremlin says Iran has right to peaceful nuclear program, urges diplomacy to solve issues",
    "description": "Russia defends Iran's right to peaceful nuclear energy and its lawful activities, urging diplomacy to solve the remaining issues.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250321-presstv01.htm",
    "timestamp": "2025-03-22T08:32:21Z"
  },
  {
    "title": "Manchester City chairman Khaldoon Al Mubarak attends White House meeting with President Donald Trump",
    "description": "The chairman of Manchester City, Khaldoon Al Mubarak has been spotted present at a meeting within the White House alongside US President, Donald Trump.The development comes as the Premier League champ...",
    "link": "https://cityxtra.co.uk/26057/manchester-city-chairman-khaldoon-al-mubarak-attends-white-house-meeting-with-president-donald-trump/",
    "timestamp": "2025-03-22T08:30:00Z"
  },
  {
    "title": "Trump revokes security clearance for Harris, Clinton and others",
    "description": "The US president also confirmed he was revoking the security clearance of Joe Biden and \"any other member\" of the Biden family.",
    "link": "https://www.bbc.com/news/articles/c74kg3e2m08o",
    "timestamp": "2025-03-22T08:27:24Z"
  },
  {
    "title": "A business owner lost a year's income in one day after DOGE cuts: 'I still choke up on my free days'",
    "description": "As a business owner, Brown can't get unemployment. She's working two part-time jobs to pay her bills.",
    "link": "https://www.businessinsider.com/business-owner-loses-annual-income-overnight-due-to-doge-cuts-2025-3",
    "timestamp": "2025-03-22T08:26:01Z"
  },
  {
    "title": "Trump Rescinds Security Clearances From Hillary Clinton, Kamala Harris - White House",
    "description": "The administration of US President Donald Trump has decided to deny access to classified information and the ability to work with it to Kamala Harris, Hillary Clinton and members of former President Joe Biden's family.",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250321-sputnik01.htm",
    "timestamp": "2025-03-22T08:24:29Z"
  },
  {
    "title": "3 people killed in Russian attacks on Ukraine’s Zaporizhzhia despite limited truce",
    "description": "Ukrainian officials say Russian drones have struck the city of Zaporizhzhia, killing three people and wounding 12",
    "link": "https://abcnews.go.com/International/wireStory/3-people-killed-russian-attacks-ukraines-zaporizhzhia-despite-120051754",
    "timestamp": "2025-03-22T08:22:42Z"
  },
  {
    "title": "Chinese FM responds to question on Trump denying US media hype over Musk to be briefed on US military's plan for any potential conflict with China",
    "description": "When asked to comment on US media reports that Elon Musk was scheduled to be granted a briefing on American military's contingency plans in case of a conflict with China, although President Trump has said the briefing now will not occur, Chinese Foreign Minis…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/03/china-250321-globaltimes01.htm",
    "timestamp": "2025-03-22T08:21:58Z"
  },
  {
    "title": "Putin Went To Church To Pray For Trump After Assassination Attempt",
    "description": "According to Witkoff, Putin prayed for Trump&#039;s well-being after the attempted assassination at a campaign rally last summer.",
    "link": "https://www.ndtv.com/world-news/vladimir-putin-went-to-church-to-pray-for-donald-trump-after-assassination-attempt-7983107",
    "timestamp": "2025-03-22T08:21:39Z"
  },
  {
    "title": "Trump Administration's Promotion Of Elon Musk's Tesla Draws Criticism From Experts: 'The Commerce Secretary Is Not Jim Cramer,' Says Former Ethics Counsel",
    "description": "Ethics experts are raising alarm over members of the Donald Trump administration openly promoting Elon Musk's Tesla Inc. (NASDAQ:TSLA), even as the electric vehicle company faces public backlash and its stock continues to slide.\nWhat Happened: On Wednesday, C…",
    "link": "https://biztoc.com/x/46e8932a5b5d4e16",
    "timestamp": "2025-03-22T08:20:10Z"
  },
  {
    "title": "Taiwan's annual military drills to simulate 2027 as year of Chinese invasion",
    "description": "Taiwan's annual military exercises have set 2027 as the potential year of a Chinese invasion - the first time it has specified a particular date for the imagined offensive - as the island's leader promised to increase its defense spending amid U.S. pressure.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250321-rfa01.htm",
    "timestamp": "2025-03-22T08:15:52Z"
  },
  {
    "title": "Betting markets think bitcoin has already peaked this year",
    "description": "One polymarket bet indicates 61% chance that bitcoin reaches $110,000 this year.",
    "link": "https://www.businessinsider.com/betting-markets-bitcoin-price-cryptocurrency-polymarket-trump-selloff-correction-ethereum-2025-3",
    "timestamp": "2025-03-22T08:15:01Z"
  },
  {
    "title": "Trump: Contract on Ukraine Settlement and Land Divisions Being Negotiated Now",
    "description": "US President Donald Trump said on Friday that an agreement on resolving the Ukraine conflict, which includes discussions on territorial divisions, is currently under negotiation.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250321-sputnik01.htm",
    "timestamp": "2025-03-22T08:13:45Z"
  },
  {
    "title": "Ukraine Deliberately Blows Up Sudzha Gas Distribution Station on March 20",
    "description": "leaving the facility significantly damaged, Russian Investigative Committee spokeswoman Svetlana Petrenko told Sputnik on Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250321-sputnik03.htm",
    "timestamp": "2025-03-22T08:13:35Z"
  },
  {
    "title": "Trump's Proposed Ceasefire Already Violated by Ukraine - Russian FM Spokeswoman",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova commented on Ukraine's continued attacks on Russian energy infrastructure, despite the partial ceasefire brokered by US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250321-sputnik04.htm",
    "timestamp": "2025-03-22T08:13:31Z"
  }
]