[
  {
    "title": "Trump warns America’s businesses: Eat my tariffs, or pay the price",
    "description": "President Donald Trump is sending a stern warning to Corporate America: He will use his bully pulpit to publicly shame companies that dare to raise prices because of tariffs.\nAfter Walmart last week said it would have to jack up some prices because of high co…",
    "link": "https://biztoc.com/x/bd81705627cd83c1",
    "timestamp": "2025-05-19T09:14:21Z"
  },
  {
    "title": "How Trump's EPA wrecking ball could also damage new housing",
    "description": "President Donald Trump meeting with his Cabinet in March.\nBRENDAN SMIALOWSKI/AFP via Getty Images\nThe EPA is trying to claw back $20 billion for decarbonization awarded under President Biden\nSome of the money was intended to help finance housing development p…",
    "link": "https://biztoc.com/x/85ddce200526c3f4",
    "timestamp": "2025-05-19T09:14:16Z"
  },
  {
    "title": "Pope Leo XIV And JD Vance Meet Ahead Of Trump's Expected Call With Putin",
    "description": "The Vatican has offered to host any peace talks while continuing humanitarian efforts to facilitate prisoner swaps and reunite Ukrainian children taken by Russia.",
    "link": "https://www.huffpost.com/entry/pope-leo-xiv-meets-jd-vance_n_682af3d9e4b0d60696ed8e29",
    "timestamp": "2025-05-19T09:13:47Z"
  },
  {
    "title": "‘Big Donald Is Watching You’: MSNBC Host Mocks Gigantic Banner Of Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e943e230-755b-4e57-9e35-d6c8472a7ce4",
    "timestamp": "2025-05-19T09:11:35Z"
  },
  {
    "title": "‘Big Donald Is Watching You’: MSNBC Host Mocks Gigantic Banner Of Trump",
    "description": "The massive image of the president that's now glaring down from the Department of Agriculture is a troubling sign of what could be to come, warned Ali Velshi.",
    "link": "https://www.huffpost.com/entry/donald-trump-banner-ali-velshi_n_682ae55fe4b0b2994c198c71",
    "timestamp": "2025-05-19T09:11:35Z"
  },
  {
    "title": "EU downgrades growth estimates after US trade war",
    "description": "U.S. President Donald Trump’s tariffs hit prospects.",
    "link": "https://www.politico.eu/article/donald-trump-tariffs-eu-downgrades-growth-estimates-us-trade-war/",
    "timestamp": "2025-05-19T09:09:41Z"
  },
  {
    "title": "\"Sindoor ka sauda hota raha\", Pawan Khera on Jaishankar, Modi",
    "description": "Congress leader Pawan Khera criticized the government for informing Pakistan before Operation Sindoor. He said this risks India's security and questions why key leaders stayed silent. Khera also raised concerns about justice for terror attacks and government …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/sindoor-ka-sauda-hota-raha-pawan-khera-on-jaishankar-modi/articleshow/121265811.cms",
    "timestamp": "2025-05-19T09:09:08Z"
  },
  {
    "title": "China's economy slows in April as trade war blues hit retail sales, housing and investment",
    "description": "China's economic growth slowed in April due to the impact of the trade war, with weaker retail sales, property investment, and industrial production. Despite a temporary truce, tariffs and trade barriers affected exports, leading to deflationary pressures. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-economy-slows-in-april-as-trade-war-blues-hit-retail-sales-housing-and-investment/articleshow/121265800.cms",
    "timestamp": "2025-05-19T09:08:07Z"
  },
  {
    "title": "Kenan Thompson impersonates Kanye West in SNL, leads to colorful reactions",
    "description": "Saturday Night Live’s season 50 finale reignited the complicated relationship between the show and rapper Kanye West, played by Kenan Thompson, in a memorable sketch alongside Mike Myers. The reunion recalls past controversies while highlighting SNL’s unique …",
    "link": "https://economictimes.indiatimes.com/news/international/us/kenan-thompson-impersonates-kanye-west-in-snl-leads-to-colorful-reactions/articleshow/121265752.cms",
    "timestamp": "2025-05-19T09:04:07Z"
  },
  {
    "title": "Iran's Supreme Leader Calls Trump a 'Disgrace'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIran's Supreme Leader Ayatollah Ali Khamenei has lashed out at U.S. President Donald Trump in a televised address, calling him a \"disgrace,\" accusing him of dishonesty, and declaring \"he lied\" about claims to …",
    "link": "https://biztoc.com/x/064ba08930492c4c",
    "timestamp": "2025-05-19T09:03:11Z"
  },
  {
    "title": "30-year Treasury passes 5% after Moody's downgrades U.S. credit rating",
    "description": "U.S. Treasury yields spiked on Monday after Moody's downgraded the U.S.' credit rating, citing fiscal concerns.",
    "link": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
    "timestamp": "2025-05-19T09:02:41Z"
  },
  {
    "title": "How Trump's EPA wrecking ball could also damage new housing",
    "description": "The EPA says Biden-era grants were marred by \"waste and abuse.\" Nonprofit groups say a clawback of the funds would derail projects to build housing.",
    "link": "https://www.businessinsider.com/housing-projects-epa-climate-financing-trump-2025-5",
    "timestamp": "2025-05-19T09:01:01Z"
  },
  {
    "title": "Trump’s ‘big beautiful bill’ needs a 'fat shot' to end our dangerous debt addiction",
    "description": "The U.S. faces a debt dangerous crisis with Congress's overspending pushing the nation towards a fiscal cliff. Trump has to figure a way to fix things before it's too late.",
    "link": "https://www.foxnews.com/opinion/trumps-big-beautiful-bill-needs-fat-shot-end-our-dangerous-debt-addiction",
    "timestamp": "2025-05-19T09:00:51Z"
  },
  {
    "title": "Victims of explicit deepfakes can now take legal action against people who create it | CNN Business",
    "description": "In recent years, people ranging from Taylor Swift and Rep. Alexandria Ocasio Cortez to high school girls around the country have been victims of non-consensual, explicit deepfakes — images where a person’s face is superimposed on a nude body, using artificial…",
    "link": "https://www.cnn.com/2025/05/19/tech/ai-explicit-deepfakes-trump-sign-take-it-down-act",
    "timestamp": "2025-05-19T09:00:51Z"
  },
  {
    "title": "Lucas: Will Healey show for judge’s hearing? She should",
    "description": "Gov. Maura Healey ought to come to the aid of District Court Judge Shelley Joseph. She could do so by testifying on her behalf before the Massachusetts Commission on Judicial Conduct June 9. So could former Gov. Charlie Baker. Baker appointed her. Healey supp…",
    "link": "https://www.bostonherald.com/2025/05/19/lucas-will-healey-show-for-judges-hearing-she-should/",
    "timestamp": "2025-05-19T09:00:35Z"
  },
  {
    "title": "Owner of Trump’s Qatari Air Force One Linked to Bob Menendez Corruption Scandal",
    "description": "The owner of the Qatari plane that may soon serve as President Donald Trump’s Air Force One, Qatari royal and former prime minister Hamad bin Jassim al Thani (HBJ), is linked to the bribery case involving former senator Bob Menendez.\nThe post Owner of Trump’s…",
    "link": "https://freebeacon.com/national-security/owner-of-trumps-qatari-air-force-one-linked-to-bob-menendez-corruption-scandal/",
    "timestamp": "2025-05-19T09:00:32Z"
  },
  {
    "title": "Trump reshapes US foreign policy with wildly successful, business-first Middle East trip",
    "description": "Trump takes the art of the deal on tour. His Middle East trip secures major business deals, boosts AI leadership and challenges China, shifting U.S. foreign policy.",
    "link": "https://www.foxnews.com/opinion/trump-reshapes-us-foreign-policy-wildly-successful-business-first-middle-east-trip",
    "timestamp": "2025-05-19T09:00:18Z"
  },
  {
    "title": "How Trump Defeated Columbia",
    "description": "Amid student protests, Columbia University’s board of trustees met in secret and opted to completely surrender to the Trump administration’s demands. This is the inside story.",
    "link": "http://nymag.com/intelligencer/article/columbia-university-president-trump-board-of-trustees-students-protests.html",
    "timestamp": "2025-05-19T09:00:13Z"
  },
  {
    "title": "Welcome to Casino Capitalism 2.0",
    "description": "John Semley\n\n\n\nThe legalization and rapid spread of sports betting has made problem gambling everyone’s problem.\r\n\n\r\n\n\nThe post Welcome to Casino Capitalism 2.0 appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/online-gambling-sports/",
    "timestamp": "2025-05-19T09:00:02Z"
  },
  {
    "title": "Why Do MAGA Republicans Hate Europe?",
    "description": "The Trump administration's stance on Europe has grabbed headlines, but the Republican Party's icy posture toward internationalism goes back decades.",
    "link": "https://www.newsweek.com/maga-republicans-donald-trump-jd-vance-europe-2071814",
    "timestamp": "2025-05-19T09:00:02Z"
  },
  {
    "title": "The Return of the Nuclear Threat",
    "description": "Jimmy Tobias\n\n\n\nWhile most of the world looked away, a new nuclear arms race has broken out between the US, Russia, and China, raising the risk of nuclear confrontation to the highest in decades.\r\n\n\r\n\n\nThe post The Return of the Nuclear Threat appeared first …",
    "link": "https://www.thenation.com/article/world/new-nuclear-arms-race/",
    "timestamp": "2025-05-19T09:00:02Z"
  },
  {
    "title": "An Open Letter to Clarence Thomas",
    "description": "Elie Mystal\n\n\n\nAs the Trump administration tries to remake society along apartheid lines, your vote to stop the assault, however unlikely, is absolutely essential.\r\n\n\r\n\n\nThe post An Open Letter to Clarence Thomas appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/an-open-letter-to-clarence-thomas/",
    "timestamp": "2025-05-19T09:00:02Z"
  },
  {
    "title": "'Go go go:' Bankers are telling startups to get their IPOs done fast",
    "description": "As the public markets improve, tech companies are rushing to IPO — knowing more political volatility could be around the corner.",
    "link": "https://www.businessinsider.com/bankers-telling-startups-get-ipos-done-fast-2025-5",
    "timestamp": "2025-05-19T09:00:01Z"
  },
  {
    "title": "Housing, Nutrition in Peril as Trump Pulls Back Medicaid Social Services",
    "description": "About half of states have broadened Medicaid, the state-federal low-income health care program, to pay for social services such as housing and nutritional support. The Trump administration, however, views these experiments as distractions from the core missio…",
    "link": "https://kffhealthnews.org/news/article/medicaid-medi-cal-social-determinants-health-california-guidance-trump-cms/",
    "timestamp": "2025-05-19T09:00:00Z"
  },
  {
    "title": "Trump’s Threats to Defy Courts Go Nuclear as MAGA Rages at New Losses",
    "description": "President Donald Trump has been ranting wildly at the Supreme Court. In a pair of tweets after oral arguments over his effort to end birthright citizenship displeased him, Trump raged that the people are on his side—a dark hint that he will wield the wrath of…",
    "link": "https://newrepublic.com/article/195387/trump-threats-defy-courts-go-nuclear-maga-rages-new-losses",
    "timestamp": "2025-05-19T09:00:00Z"
  },
  {
    "title": "Trump’s War on John and Jackie Kennedy",
    "description": "From ripping up the White House Rose Garden to redoing Air Force One and the Kennedy Center, it’s Mar-a-Lago gilt versus Camelot taste.\nThe post Trump’s War on John and Jackie Kennedy appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/19/trumps-war-on-john-and-jackie-kennedy/",
    "timestamp": "2025-05-19T09:00:00Z"
  },
  {
    "title": "Trump’s Qatar Airplane Problem Keeps Flying",
    "description": "The president’s inability to distinguish between public and private interests reaches new heights with the gift of a foreign 747.\nThe post Trump’s Qatar Airplane Problem Keeps Flying  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/19/trumps-qatar-airplane-problem-keeps-flying/",
    "timestamp": "2025-05-19T09:00:00Z"
  },
  {
    "title": "Trump taps his most trusted officials to do as many as four jobs — at the same time",
    "description": "Trump has taken some Cabinet members and senior administration officials and layered on additional work that calls for wholly different sets of skills.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-taps-trusted-officials-four-jobs-rubio-rcna206500",
    "timestamp": "2025-05-19T09:00:00Z"
  },
  {
    "title": "Iran's Supreme Leader Calls Trump a 'Disgrace'",
    "description": "Ayatollah Ali Khamenei has lashed out at the U.S. president, accusing him of lying about his intentions to use American power for peace.",
    "link": "https://www.newsweek.com/iran-supreme-leader-us-donald-trump-disgrace-lied-2073948",
    "timestamp": "2025-05-19T08:59:59Z"
  },
  {
    "title": "Why the world must move swiftly to denuclearise Pakistan",
    "description": "International News: Can the world watch helplessly when nuclear weapons are in the hands of such a rogue nation and it's dangerous army chief, Gen Asim Munir? Obviously n",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/why-the-world-must-move-swiftly-to-denuclearise-pakistan/articleshow/121263779.cms",
    "timestamp": "2025-05-19T08:57:22Z"
  },
  {
    "title": "Donald Trump's son says Joe Biden's cancer was 'covered up' in controversial reaction to diagnosis",
    "description": "Donald Trump Jr caused controversy with his comments about Joe Biden's prostate cancer diagnosis",
    "link": "https://www.ladbible.com/news/us-news/joe-biden-prostate-cancer-diagnosis-donald-trump-jr-088071-20250519",
    "timestamp": "2025-05-19T08:56:14Z"
  },
  {
    "title": "Israel strikes Gaza after ‘basic’ food aid pledge",
    "description": "Israeli strikes killed at least 22 people in Gaza on Monday, rescuers said, after Israel pledged to let a “basic amount” of food into the territory to avert a hunger crisis. The announcement came hours after the military said it had begun “extensive ground op…",
    "link": "https://www.digitaljournal.com/world/israel-strikes-gaza-after-basic-food-aid-pledge/article",
    "timestamp": "2025-05-19T08:52:21Z"
  },
  {
    "title": "Poland heads to runoff in tight presidential race",
    "description": "Pro-EU Polish presidential candidate Rafal Trzaskowski fell short of victory, with a runoff against conservative Karol Nawrocki set for June Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617812-poland-heads-to-runoff/",
    "timestamp": "2025-05-19T08:51:40Z"
  },
  {
    "title": "What makes Donald Trump so attractive for American voters?",
    "description": "In the informational bubbles that I frequent, the answer is usually that MAGA love him thanks to racism, \"owning the libs\", sexism, the influence of Fox News propaganda, and low information voting. All of this is certainly true, but I don't feel that it expla…",
    "link": "https://ask.metafilter.com/385791/What-makes-Donald-Trump-so-attractive-for-American-voters",
    "timestamp": "2025-05-19T08:51:09Z"
  },
  {
    "title": "‘An economic fallacy’: Rand Paul doesn’t see the benefits of tariffs",
    "description": "Sen. Rand Paul attacked the economic logic of President Donald Trump’s aggressive tariff strategy on Sunday — and agreed that the policies raise constitutional concerns. The Kentucky Republican said Trump’s sweeping tariffs on foreign trading partners are bas…",
    "link": "https://freerepublic.com/focus/f-news/4317815/posts",
    "timestamp": "2025-05-19T08:48:49Z"
  },
  {
    "title": "Despite backlash, more states are considering laws to make Big Oil pay for climate change",
    "description": "After Vermont and New York passed \"climate Superfund\" legislation, 11 states have introduced similar bills this year.",
    "link": "http://grist.org/accountability/climate-superfund-law-maryland-california-vermont-new-york-trump-lawsuits/",
    "timestamp": "2025-05-19T08:45:00Z"
  },
  {
    "title": "China's economy slows in April as trade war blues hit retail sales, housing",
    "description": "Key economic indicators show China's economy slowing somewhat in April, with retail sales, property and investment coming in weaker than economists had forecast",
    "link": "https://abcnews.go.com/Business/wireStory/chinas-economy-slows-april-trade-war-blues-hit-121940366",
    "timestamp": "2025-05-19T08:42:39Z"
  },
  {
    "title": "Ukraine updates: Trump to hold phone call with Putin",
    "description": "The Kremlin said Russia \"highly valued\" US President Donald Trump's efforts to end the fighting. Meanwhile, long-awaited Abrams tanks are \"on their way\" to Ukraine from Australia. DW rounds up the latest.",
    "link": "https://www.dw.com/en/live-updates-trump-to-speak-with-putin-in-push-for-a-ceasefire-deal-to-end-fighting-in-ukraine-follow-dw-for-the-latest/live-72586772",
    "timestamp": "2025-05-19T08:36:00Z"
  },
  {
    "title": "Did Beyoncé take $10 million to appear at Kamala Harris' rally? Trump makes big claim",
    "description": "Did Beyonce take $10 million to appear for former US Vice-President Kamala Harris at a rally? Donald Trump claims so. The US President has called for an investigation into Beyoncé, Bruce Springsteen's performances. Trump has alleged that Harris paid the rock …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-did-beyonc-take-10-million-to-appear-at-kamala-harris-rally-trump-makes-big-claim-bruce-springsteen/articleshow/121264929.cms",
    "timestamp": "2025-05-19T08:34:13Z"
  },
  {
    "title": "Ukraine updates: European leaders phone Trump before Putin call",
    "description": "Friedrich Merz, Emmanuel Macron, Kier Starmer and Giorgia Meloni called for an \"unconditional ceasefire\" in Ukraine. US President Donald Trump is set to hold a call with Russia's Vladimir Putin. DW rounds up the latest. Leaders of Germany, France, the UK and …",
    "link": "https://www.dw.com/en/ukraine-updates-european-leaders-phone-trump-before-putin-call/live-72586772",
    "timestamp": "2025-05-19T08:34:00Z"
  },
  {
    "title": "Bucharest Mayor Dan's Surprise Presidential Win Spells Relief For EU And NATO",
    "description": "After months of political turmoil following annulled elections and a banned front-runner nationalist candidate, Romanians have finally elected a new president. One that will bring a sigh of relief from Brussels.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250519-rferl01.htm",
    "timestamp": "2025-05-19T08:31:58Z"
  },
  {
    "title": "Facing Cuts to Vital Online Resources, School Librarians Look to States for Help",
    "description": "An Oval Office executive order threatens access to trusted databases used by thousands of students in public libraries. “People are angry,” says Deb ...",
    "link": "https://www.edsurge.com/news/2025-05-19-facing-cuts-to-vital-online-resources-school-librarians-look-to-states-for-help",
    "timestamp": "2025-05-19T08:30:00Z"
  },
  {
    "title": "Indian YouTuber arrested for allegedly 'spying' for Pakistan",
    "description": "The father of Jyoti Malhotra, the Indian travel influencer, has denied allegations that she was a spy for Pakistan.",
    "link": "https://www.bbc.com/news/articles/cx2e7xv8v80o",
    "timestamp": "2025-05-19T08:28:52Z"
  },
  {
    "title": "Jyoti Malhotra: Indian YouTuber arrested for allegedly spying for Pakistan",
    "description": "The father of Malhotra, the Indian travel influencer, has denied allegations that she was a spy for Pakistan.",
    "link": "https://www.bbc.co.uk/news/articles/cx2e7xv8v80o",
    "timestamp": "2025-05-19T08:28:52Z"
  },
  {
    "title": "Iran: Precarious Work Means Precarious Life : How the Rajaee Port Disaster Exemplifies the Assault on Baluch Ethnic Minorities",
    "description": "The Rajaee Port disaster reveals how economic and political pressure on ethnic minorities plays a fundamental role in capitalism.",
    "link": "https://crimethinc.com/2025/05/19/iran-precarious-work-means-precarious-life-how-the-rajaee-port-disaster-exemplifies-the-assault-on-baluch-ethnic-minorities",
    "timestamp": "2025-05-19T08:26:33Z"
  },
  {
    "title": "Donald Trump's Spending Bill Makes Progress as Medicaid Faces Cuts",
    "description": "The Congressional Budget Office has said the bill, if enacted, would cause more than 8 million people to lose their coverage.",
    "link": "https://www.newsweek.com/donald-trump-spending-bill-progress-medicaid-cuts-2073954",
    "timestamp": "2025-05-19T08:25:48Z"
  },
  {
    "title": "Nvidia unveils plan for Taiwan's first 'AI supercomputer'",
    "description": "Nvidia boss Jensen Huang announced plans for Taiwan's first \"AI supercomputer\", as he showcased on Monday the company's latest advances in artificial...",
    "link": "https://finance.yahoo.com/news/nvidia-unveils-plan-taiwans-first-044806751.html",
    "timestamp": "2025-05-19T08:23:05Z"
  },
  {
    "title": "Arab summit presses for end to Gaza 'bloodshed'",
    "description": "Baghdad (AFP) May 17, 2025\n\n\n Arab leaders meeting Saturday at a summit in Baghdad urged the international community to press for a Gaza ceasefire, as Israel launched an expanded military offensive in the Palestinian territory. \n\nIn a joint final statement, A…",
    "link": "https://www.spacewar.com/reports/Arab_summit_presses_for_end_to_Gaza_bloodshed_999.html",
    "timestamp": "2025-05-19T08:19:06Z"
  },
  {
    "title": "Israel threatens Huthi leaders after striking Yemen ports",
    "description": "Hodeida, Yemen (AFP) May 17, 2025\n\n\n Israel threatened to target the leadership of Yemen's Iran-backed Huthi rebels after the air force struck two rebel-held ports on Friday, following repeated Huthi missile attacks in recent days. \n\nThe Huthis agreed earlier…",
    "link": "https://www.spacewar.com/reports/Israel_threatens_Huthi_leaders_after_striking_Yemen_ports_999.html",
    "timestamp": "2025-05-19T08:19:06Z"
  },
  {
    "title": "Iran, European powers hold nuclear talks in Turkey",
    "description": "Istanbul (AFP) May 16, 2025\n\n\n Iran met with European powers on Friday to discuss its nuclear negotiations with Washington, while US President Donald Trump issued a new threat unless the Iranians \"move quickly\" towards a deal. \n\nThe meeting in Istanbul follow…",
    "link": "https://www.spacewar.com/reports/Iran_European_powers_hold_nuclear_talks_in_Turkey_999.html",
    "timestamp": "2025-05-19T08:19:06Z"
  },
  {
    "title": "Iran says to keep enriching uranium, even with a deal",
    "description": "Tehran (AFP) May 18, 2025\n\n\n Iran's Foreign Minister Abbas Araghchi said Sunday his country would keep enriching uranium \"with or without a deal\" with world powers, despite ongoing negotiations over its nuclear programme. \n\n\"If the US is interested in ensurin…",
    "link": "https://www.nuclearpowerdaily.com/reports/Iran_says_to_keep_enriching_uranium_even_with_a_deal_999.html",
    "timestamp": "2025-05-19T08:19:06Z"
  },
  {
    "title": "Trump's Middle East Trip Draws Rare Praise From Mike Pence As 'Very Successful' For US Economy Amid 'Historic' Boeing Deal: 'That'll Really Support American Jobs'",
    "description": "Former Vice President Mike Pence has lauded President Donald Trump‘s Middle East visit for its beneficial effects on the U.S. economy, despite his criticism of the diplomatic aspects of the trip. \nWhat Happened: Despite a public fallout with Trump over the 20…",
    "link": "https://biztoc.com/x/39e338a8981e5d84",
    "timestamp": "2025-05-19T08:18:23Z"
  },
  {
    "title": "Johnnie Walker owner Diageo says Trump tariffs could hit profits by $150m",
    "description": "FTSE 100 group, which also owns Tanqueray and Smirnoff, is to cut costs – which could lead to job losses\nBusiness live – latest updates\nDiageo, the drinks business behind Guinness and Johnnie Walker whisky, has said Donald Trump’s tariffs could hit its profit…",
    "link": "https://biztoc.com/x/cb70c244176c1d38",
    "timestamp": "2025-05-19T08:18:22Z"
  },
  {
    "title": "Warsaw Mayor Holds Slim Lead In Polish Presidential Vote, But June 1 Runoff Likely",
    "description": "The contest for the Polish presidency is headed for a June 1 runoff, according to exit polls on May 18, with preliminary forecasts showing Warsaw Mayor Rafal Trzaskowski - backed by Prime Minister Donald Tusk's centrist Civic Coalition - with a narrow lead.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250518-rferl01.htm",
    "timestamp": "2025-05-19T08:12:11Z"
  },
  {
    "title": "Trump to ask Putin to stop 'bloodbath' in Ukraine peace call",
    "description": "President Donald Trump is expected to speak with Russian President Vladimir Putin at around 10 a.m. ET on Monday.",
    "link": "https://abcnews.go.com/International/trump-putin-stop-bloodbath-ukraine-peace-call/story?id=121939395",
    "timestamp": "2025-05-19T08:09:37Z"
  },
  {
    "title": "James Comey is under investigation by Secret Service for a seashell photo showing “8647”",
    "description": "James Comey is under investigation for a seashell photo showing “8647,” seen by some as a coded threat against Trump. Former FBI chief James Comey is under investigation by the Secret Service for sharing an image of seashells arranged to display the numbers ‘…",
    "link": "https://securityaffairs.com/178030/laws-and-regulations/james-comey-is-under-investigation-by-secret-service-for-a-seashell-photo-showing-8647.html",
    "timestamp": "2025-05-19T08:08:45Z"
  },
  {
    "title": "Araghchi warns US of unrealistic demands, says Iran will continue enrichment",
    "description": "Iranian Foreign Minister Abbas Araghchi warns the United States against making \"unrealistic demands\" in talks, saying Tehran will continue its enrichment program with or without a deal with Washington.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250518-presstv03.htm",
    "timestamp": "2025-05-19T08:08:43Z"
  },
  {
    "title": "Computex 2025: Beyond Nvidia, Four Things to Know at Asia’s Biggest Tech Show",
    "description": "Computex kicks off Monday in Taipei, and as in years past will draw industry chieftains from Huang and Qualcomm’s Cristiano Amon to Young Liu of Foxconn, which makes the bulk of the world’s iPhones and Nvidia servers.",
    "link": "https://www.gadgets360.com/laptops/news/computex-2025-taiwan-nvidia-tech-show-asia-foxconn-qualcomm-chatgpt-ai-8451557",
    "timestamp": "2025-05-19T08:07:37Z"
  },
  {
    "title": "Trump's Drug Price Order Hits PBMs Hardest: CVS, Cigna, UNH In Focus As Experts Highlight 'Racket,' Pricing Distortion",
    "description": "After Donald Trump signed an executive order slashing drug prices last week, experts have highlighted how pharmacy benefit managers (PBMs) could be hit the hardest despite pharmaceutical companies facing the potential of compressed margins amid poor pricing p…",
    "link": "https://biztoc.com/x/ea70429a6e8cc927",
    "timestamp": "2025-05-19T08:06:53Z"
  },
  {
    "title": "Syria’s Prospects of Debt Restructuring Entangled in Geopolitical Calculations",
    "description": "Syria’s transitional government has yet to make clear how it will deal with the debts that the former Assad regime incurred with Russia and Iran. In a regime change context, debt restructuring is often framed as part of the broader \r\n\n…\r\n\nThe post Syria’s Pro…",
    "link": "https://www.globalresearch.ca/syria-prospects-debt-restructuring-entangled-geopolitical-calculations/5887524",
    "timestamp": "2025-05-19T08:02:59Z"
  },
  {
    "title": "Witkoff Hopes Trump-Putin Call Will 'Clear Logjam' in Ukraine Talks",
    "description": "US special envoy Steve Witkoff on Sunday expressed hope that the upcoming phone call between US President Donald Trump and Russian President Vladimir Putin will be very successful and will \"clear up some of the logjam\" in the settlement of the Ukraine conflic…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250518-sputnik02.htm",
    "timestamp": "2025-05-19T08:02:21Z"
  },
  {
    "title": "Zelenskyy Meets With Pope As Russia Launches Major Drone Assault On Ukraine",
    "description": "Pope Leo XIV met one-on-one with Volodymyr Zelenskyy, as the Ukrainian leader looked to the Roman Catholic Church's leader to help push for a cessation of fighting in Russia's nearly 39-month-old war on Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250518-rferl02.htm",
    "timestamp": "2025-05-19T08:02:15Z"
  },
  {
    "title": "Former NATO Chief Rasmussen Says Plan For European Force In Ukraine 'Moving Too Slowly'",
    "description": "Former NATO chief Anders Fogh Rasmussen has told RFE/RL that preparations for a European force to deploy to Ukraine after a cease-fire or peace deal are \"moving too slowly\" and that the whole European security model was \"at a turning point.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250519-rferl01.htm",
    "timestamp": "2025-05-19T08:02:09Z"
  },
  {
    "title": "FEMA under fire: Trump slashes, GOP sweats",
    "description": "Many Republicans in Congress are uncomfortable with the Trump administration’s proposed overhaul of the Federal Emergency Management Agency, and some of them are going public with their concerns.\n\n“FEMA needs to be reformed, but it’s an important instrument i…",
    "link": "https://www.rawstory.com/fema-2672071832/",
    "timestamp": "2025-05-19T08:01:03Z"
  },
  {
    "title": "Crypto Watchlist: Top Analyst Reveals 5 Altcoins With Major Upside",
    "description": "In his latest market rundown, Amsterdam-based trader and educator Michaël van de Poppe warns that “retail isn’t here in the markets as of yet” and notes that the widely-followed Altcoin Season Index is still languishing around 29—well below the 50-point thres…",
    "link": "http://www.newsbtc.com/news/crypto-watchlist-top-analyst-5-altcoins-major-upside/",
    "timestamp": "2025-05-19T08:00:52Z"
  },
  {
    "title": "Trump warns big business: Eat my tariffs, or pay the price | CNN Business",
    "description": "President Trump used his bully pulpit to warn America’s businesses about raising prices due to tariffs.",
    "link": "https://www.cnn.com/2025/05/19/business/trump-tariffs-price-consumers",
    "timestamp": "2025-05-19T08:00:50Z"
  },
  {
    "title": "The 9 at 9: Monday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/morning-headlines-107-6708726-May2025/",
    "timestamp": "2025-05-19T08:00:43Z"
  },
  {
    "title": "Legendary investor Ron Baron shares the early contrarian lesson that's helped him return 1,843% over 22 years",
    "description": "Like all of us, billionaire investor Ron Baron was once a beginner, too.",
    "link": "https://www.businessinsider.com/ron-baron-shares-the-first-investing-lesson-he-ever-learned-2025-5",
    "timestamp": "2025-05-19T08:00:02Z"
  },
  {
    "title": "Negotiations in ‘critical hours’: Will Israel intensify war or head to a ceasefire?",
    "description": "Pressure mounts on Netanyahu to choose between ending the war and reaching a deal to free the hostages or escalating further.",
    "link": "https://www.jpost.com/opinion/article-854541",
    "timestamp": "2025-05-19T07:56:54Z"
  },
  {
    "title": "Iran says nuclear talks will fail if US pushes for zero enrichment",
    "description": "DUBAI (Reuters) -Nuclear talks between Iran and the United States \"will lead nowhere\" if Washington insists that Tehran drop its uranium enrichment activity to zero, Deputy Foreign Minister Majid Takhtravanchi was quoted by state media on Monday as saying. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/05/19/iran-says-nuclear-talks-will-fail-if-us-pushes-for-zero-enrichment",
    "timestamp": "2025-05-19T07:56:00Z"
  },
  {
    "title": "Trump accuses Harris of paying for endorsements",
    "description": "United States President Donald Trump on Monday accused Democratic presidential candidate and former Vice President Kamala Harris of paying for endorsements from many celebrities during her presidentia...",
    "link": "https://biztoc.com/x/a8c6a6787b3284f6",
    "timestamp": "2025-05-19T07:55:55Z"
  },
  {
    "title": "Trump set to implore Putin to end the 'bloodbath' in Ukraine in high-stakes phone call",
    "description": "President Donald Trump is set to speak Monday with Vladimir Putin, in what the U.S. president said is an attempt to stop the “bloodbath” of the war in Ukraine.",
    "link": "https://biztoc.com/x/bdf2bab8cfb6f851",
    "timestamp": "2025-05-19T07:55:36Z"
  },
  {
    "title": "'Joe is a fighter': Politicians send messages of support to Biden after cancer diagnosis",
    "description": "Politicians have sent messages of support to Joe Biden, who has been diagnosed with prostate cancer.",
    "link": "https://news.sky.com/story/politicians-send-messages-of-support-to-joe-biden-after-cancer-diagnosis-13370842",
    "timestamp": "2025-05-19T07:53:00Z"
  },
  {
    "title": "Messages of support pour in for Joe Biden after cancer diagnosis",
    "description": "Politicians have sent messages of support to Joe Biden, who has been diagnosed with an aggressive form of prostate cancer.",
    "link": "https://news.sky.com/story/messages-of-support-pour-in-for-joe-biden-after-prostate-cancer-diagnosis-13370842",
    "timestamp": "2025-05-19T07:53:00Z"
  },
  {
    "title": "Pwn2Own Berlin 2025: total prize money reached $1,078,750",
    "description": "Pwn2Own Berlin 2025 wrapped up with $383,750 awarded on the final day, pushing the total prize money to $1,078,750 over three days. On the final day of Pwn2Own Berlin 2025, participants earned $383,750 for demonstrating zero-day in VMware Workstation, ESXi, W…",
    "link": "https://securityaffairs.com/178040/hacking/pwn2own-berlin-2025-total-prize-money-reached-1078750.html",
    "timestamp": "2025-05-19T07:51:23Z"
  },
  {
    "title": "Donald Trump to launch \"major investigation\" into Kamala Harris celebrity endorsements",
    "description": "Donald Trump announced plans for a \"major investigation\" into Kamala Harris, alleging she improperly paid celebrities for endorsements during her failed presidential campaign. Trump specifically questioned payments to Oprah Winfrey and the rumored payment to …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-calls-to-probe-kamala-harris-celebrity-endorsements/articleshow/121264220.cms",
    "timestamp": "2025-05-19T07:50:58Z"
  },
  {
    "title": "Guinness maker Diageo expects US tariffs to cost the company around €133m a year",
    "description": "The drinks giant said it believes its current plans will mitigate around half of the impact of these higher costs.",
    "link": "https://www.thejournal.ie/guinness-maker-diageo-expects-us-tariffs-to-cost-company-e133m-a-year-6708651-May2025/",
    "timestamp": "2025-05-19T07:50:37Z"
  },
  {
    "title": "RNC Chair Michael Whatley Says James Comey Should Be Investigated for '86 47' Post",
    "description": "Republican National Committee (RNC) Chair Michael Whatley suggests James Comey should be investigated for his \"86 47\" post.\nThe post RNC Chair Michael Whatley Says James Comey Should Be Investigated for ’86 47′ Post appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/19/rnc-chair-michael-whatley-says-james-comey-should-be-investigated-for-86-47-post/",
    "timestamp": "2025-05-19T07:45:29Z"
  },
  {
    "title": "Israel strikes Gaza after 'basic' food aid pledge",
    "description": "GAZA CITY (PALESTINIAN TERRITORIES) - Israeli strikes killed at least 22 people in Gaza on Monday, rescuers said, after Israel pledged to let a \"basic amount\" of food into the territory to avert a hunger crisis.",
    "link": "https://www.bangkokpost.com/world/3029102/israel-strikes-gaza-after-basic-food-aid-pledge",
    "timestamp": "2025-05-19T07:45:00Z"
  },
  {
    "title": "What Does a Gleason Score of 9 Mean? Understanding Biden’s Prostate Cancer Diagnosis",
    "description": "A primer on prostate cancer and the former President’s diagnosis.",
    "link": "https://time.com/7286376/biden-prostate-cancer-diagnosis-gleason-score-stage-survival-treatment-explainer/",
    "timestamp": "2025-05-19T07:45:00Z"
  },
  {
    "title": "Trump wants a 'one-stop shopping' deal with South Korea on trade and defense, but there is a cost",
    "description": "Sharing the costs of hosting U.S. troops in allied countries has been a favorite topic of U.S. President Donald Trump since his first term in the White House.\nBut as more countries try to eke out a deal to escape the spectre of tariffs in his second term, Tru…",
    "link": "https://biztoc.com/x/1916843821dac723",
    "timestamp": "2025-05-19T07:44:35Z"
  },
  {
    "title": "Max Hastings: Putin still holds all the cards as Ukraine finished if US cuts aid",
    "description": "While we anguish over Donald Trump’s wars on trade, judges, migrants, aid recipients and universities, spare a thought for Volodymyr Zelensky. Every morning when Ukraine’s president wakes up, he must ask himself whether this is the day the US will again cut o…",
    "link": "https://www.independent.ie/opinion/analysis/max-hastings-putin-still-holds-all-the-cards-as-ukraine-finished-if-us-cuts-aid/a1241961585.html",
    "timestamp": "2025-05-19T07:42:36Z"
  },
  {
    "title": "UK forges new ties with EU in post-Brexit era",
    "description": "U.K. Prime Minister Keir Starmer hailed a new partnership with the EU on Monday, forged at a landmark summit and opening a new chapter in ties after Britain's acrimonious exit from the bloc five years ago.",
    "link": "https://www.hurriyetdailynews.com/eu-uk-reach-deal-to-reset-ties-ahead-of-london-summit-diplomats-209336",
    "timestamp": "2025-05-19T07:41:00Z"
  },
  {
    "title": "Pope Leo XIV and JD Vance meet ahead of US-led diplomatic flurry to reach ceasefire in Ukraine",
    "description": "Vance, a Catholic convert, had led the US delegation to the formal Mass opening the pontificate of the first American pope.",
    "link": "https://nypost.com/2025/05/19/us-news/vance-meets-pope-leo-xiv-at-vatican-ahead-of-trump-putin-ukraine-ceasefire-call/",
    "timestamp": "2025-05-19T07:40:07Z"
  },
  {
    "title": "Trump wants a 'one-stop shopping' deal with South Korea on trade and defense, but there is a cost",
    "description": "South Korea could pay its dues by investing more in its forces, an analyst said, which would allow U.S. troops stationed in the country to focus more on China.",
    "link": "https://www.cnbc.com/2025/05/19/trump-south-korea-pay-more-us-troops-defense-trade-deal.html",
    "timestamp": "2025-05-19T07:38:53Z"
  },
  {
    "title": "Chip Roy Fires New Warning as Trump's Big Bill Moves Forward: 'Scam'",
    "description": "The Trump-dubbed \"one big, beautiful bill\" narrowly got through the House Budget Committee.",
    "link": "https://www.newsweek.com/chip-roy-trump-big-bill-warning-scam-2073956",
    "timestamp": "2025-05-19T07:38:38Z"
  },
  {
    "title": "Democratic Official Reveals 3-Word Key To Beating Republicans",
    "description": "Malcolm Kenyatta also slammed President Trump for \"making life worse and miserable\" for ordinary Americans while enriching himself and his donors.",
    "link": "https://www.huffpost.com/entry/malcolm-kenyatta-beat-republicans_n_682ac2bde4b087727d30f166",
    "timestamp": "2025-05-19T07:37:21Z"
  },
  {
    "title": "Trump, Obama And Other Leaders From Both Parties Send Well Wishes To Biden After Cancer Diagnosis",
    "description": "President Donald Trump, former President Barack Obama and many other leaders from across the political sphere expressed their support for former President Joe Biden an...",
    "link": "https://www.forbes.com/sites/siladityaray/2025/05/19/trump-obama-and-other-leaders-from-both-parties-wish-biden-well-after-cancer-diagnosis/",
    "timestamp": "2025-05-19T07:36:39Z"
  },
  {
    "title": "Trump set to implore Putin to end the 'bloodbath' in Ukraine in high-stakes phone call",
    "description": "President Donald Trump is set to speak Monday with Vladimir Putin, in what the U.S. president said is an attempt to stop the “bloodbath” of the war in Ukraine.",
    "link": "https://www.nbcnews.com/world/russia/trump-set-implore-putin-end-bloodbath-ukraine-high-stakes-phone-call-rcna207612",
    "timestamp": "2025-05-19T07:36:33Z"
  },
  {
    "title": "Israel Strikes Gaza After 'Basic' Food Aid Pledge",
    "description": "Israeli strikes killed at least 22 people in Gaza on Monday, rescuers said, after Israel pledged to let a \"basic amount\" of food into the territory to avert a hunger crisis.",
    "link": "https://www.ibtimes.com/israel-strikes-gaza-after-basic-food-aid-pledge-3773935",
    "timestamp": "2025-05-19T07:36:18Z"
  },
  {
    "title": "Israel Strikes Gaza After 'Basic' Food Aid Pledge",
    "description": "Israeli strikes killed at least 22 people in Gaza on Monday, rescuers said, after Israel pledged to let a \"basic amount\" of food into the territory to avert a hunger crisis.",
    "link": "https://www.ibtimes.com.au/israel-strikes-gaza-after-basic-food-aid-pledge-1858954",
    "timestamp": "2025-05-19T07:36:16Z"
  },
  {
    "title": "Exclusive-Vietnam government document says Trump Organization exploring tower in Ho Chi Minh City",
    "description": "HANOI (Reuters) -The Trump Organization and its local partner are exploring building a skyscraper in Vietnam's business hub Ho Chi Minh City as Eric Trump is expected to visit Vietnam this week, a Vietnamese government document seen by Reuters shows. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/05/19/exclusive-vietnam-government-document-says-trump-organization-exploring-tower-in-ho-chi-minh-city",
    "timestamp": "2025-05-19T07:31:00Z"
  },
  {
    "title": "A double challenge puts Donald trumps credibility on the line. In other news, Donald trump has credibility? [Unlikely]",
    "description": "A double challenge puts Donald trumps credibility on the line. In other news, Donald trump has credibility?",
    "link": "https://www.fark.com/comments/13675968/A-double-challenge-puts-Donald-trumps-credibility-on-line-In-other-news-Donald-trump-has-credibility",
    "timestamp": "2025-05-19T07:30:00Z"
  },
  {
    "title": "Barack Obama says Joe Biden will face cancer diagnosis with ‘resolve and grace’",
    "description": "Donald Trump meanwhile said that he and his wife Melania were ‘saddened to hear about Joe Biden’s recent medical diagnosis’.",
    "link": "https://www.thejournal.ie/obama-says-biden-will-face-cancer-diagnosis-with-resolve-and-grace-6708639-May2025/",
    "timestamp": "2025-05-19T07:26:43Z"
  }
]