[
  {
    "title": "Myriad Moves: How Low Will Bitcoin and Ethereum Go?",
    "description": "Top markets on Myriad this week include predictions on Bitcoin and Ethereum’s next respective stops, plus the outcome of Super Bowl LX.",
    "link": "https://decrypt.co/357123/myriad-moves-how-low-bitcoin-ethereum-go",
    "timestamp": "2026-02-05T20:15:27Z"
  },
  {
    "title": "Fox’s Peter Doocy Asks Karoline Leavitt: Will Trump Be Watching Kid Rock or Bad Bunny Super Bowl Halftime Show?",
    "description": "\"At the Mar-a-Lago Super Bowl party, after the first two quarters, are the TVs going to be on the halftime show with Bad Bunny, or ...Kid Rock?\"\nThe post Fox’s Peter Doocy Asks Karoline Leavitt: Will Trump Be Watching Kid Rock or Bad Bunny Super Bowl Halftime…",
    "link": "https://www.mediaite.com/media/entertainment/foxs-peter-doocy-asks-karoline-leavitt-will-trump-be-watching-kid-rock-or-bad-bunny-super-bowl-halftime-show/",
    "timestamp": "2026-02-05T20:13:17Z"
  },
  {
    "title": "Iran filmmaker Panahi fears Iranians’ interests will be ‘sacrificed’ in US talks",
    "description": "Dissident Iranian film director Jafar Panahi told AFP he believes ordinary Iranians risk being “sacrificed” in talks between Iran and the United States on Friday, with his country still “in shock” over a deadly crackdown on protests. Panahi, Iran’s best-known…",
    "link": "https://www.digitaljournal.com/world/iran-filmmaker-panahi-fears-iranians-interests-will-be-sacrificed-in-us-talks/article",
    "timestamp": "2026-02-05T20:12:20Z"
  },
  {
    "title": "Trump administration to end job protections for up to 50,000 federal workers",
    "description": "WASHINGTON, Feb 5 (Reuters) - U.S. ‌President Donald Trump will have more power to hire and fire up to 50,000 ‌career federal employees in an overhaul of the government's civil service system announced by ‌his administration on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/06/trump-administration-to-end-job-protections-for-up-to-50000-federal-workers",
    "timestamp": "2026-02-05T20:11:00Z"
  },
  {
    "title": "Iran Claims Drone Shot Down by U.S. Was on ‘Routine and Lawful Mission’",
    "description": "Iran claims the drone shot down by the USS Abraham Lincoln was conducting a “routine and lawful mission over international waters.”\nThe post Iran Claims Drone Shot Down by U.S. Was on ‘Routine and Lawful Mission’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2026/02/05/iran-claims-drone-shot-down-by-u-s-was-routine-lawful-mission/",
    "timestamp": "2026-02-05T20:06:55Z"
  },
  {
    "title": "Crypto Guys Who Bought a Huge Gold Trump Statue Now Have a Problem",
    "description": "\"That statue will not leave my foundry until everything they owe me is paid.\"\nThe post Crypto Guys Who Bought a Huge Gold Trump Statue Now Have a Problem appeared first on Futurism.",
    "link": "http://futurism.com/future-society/trump-crypto-gold-statue",
    "timestamp": "2026-02-05T20:04:49Z"
  },
  {
    "title": "Trump administration to end job protections for up to 50,000 federal workers",
    "description": "By Courtney RozenWASHINGTON, Feb 5 (Reuters) - U.S. President Donald Trump will have more power to hire and fire up to 50,000 career federal employees in an overhaul of t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-administration-to-end-job-protections-for-up-to-50-000-federal-workers",
    "timestamp": "2026-02-05T20:04:44Z"
  },
  {
    "title": "DHS Is Hunting Down Trump Critics. The ‘Free Speech’ Warriors Are Mighty Quiet.",
    "description": "For years, we’ve been subjected to an endless parade of hyperventilating claims about the Biden administration’s supposed “censorship industrial complex.” We were told, over and over again, that the government was weaponizing its power to silence conservative…",
    "link": "https://www.techdirt.com/2026/02/05/dhs-is-hunting-down-trump-critics-the-free-speech-warriors-are-mighty-quiet/",
    "timestamp": "2026-02-05T20:03:28Z"
  },
  {
    "title": "This killer was a Klansman — but Trump admin says don't call him racist",
    "description": "The National Park Service has removed visitor brochures from the Medgar & Myrlie Evers Home National Monument. Among the anticipated changes? No longer calling his murderer a “racist.”Edits to the brochure have removed that reference to Byron De La Beckwith, …",
    "link": "https://www.rawstory.com/this-killer-was-a-klansman-but-trump-admin-says-don-t-call-him-racist/",
    "timestamp": "2026-02-05T20:02:02Z"
  },
  {
    "title": "XRP Analyst Points Out ‘Exit Candle’ That Investors Should Watch",
    "description": "XRP investors are closely monitoring market signals as the cryptocurrency navigates turbulent trading conditions and choppy price action. A recent analysis by market analyst Egrag Crypto identifies a critical exit candle, which could signal the next major ste…",
    "link": "http://www.newsbtc.com/analysis/xrp/xrp-exit-candle-to-watch/",
    "timestamp": "2026-02-05T20:00:09Z"
  },
  {
    "title": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History",
    "description": "Melania Trump's new documentary is now the film with the biggest disparity between critic and audience reviews in Rotten Tomatoes history.",
    "link": "http://www.rollingstone.com/politics/politics-news/melania-trump-doc-reviews-rotten-tomatoes-1235511549/",
    "timestamp": "2026-02-05T20:00:00Z"
  },
  {
    "title": "Trump claims DNI Tulsi Gabbard was at Georgia election hub search because AG Pam Bondi wanted her there",
    "description": "President Donald Trump defends DNI Tulsi Gabbard's controversial presence at the FBI search of a Fulton County election facility, citing Attorney General Bondi's request.",
    "link": "https://www.foxnews.com/politics/trump-claims-dni-tulsi-gabbard-georgia-election-hub-search-because-ag-pam-bondi-wanted-her-there",
    "timestamp": "2026-02-05T19:58:06Z"
  },
  {
    "title": "Trump Says He’ll Only Accept 2026 Midterms If He Deems Them “Honest”",
    "description": "Trump’s comments on Wednesday come just days after he called on Republicans to “nationalize” state-managed elections.",
    "link": "https://truthout.org/articles/trump-says-hell-only-accept-2026-midterms-if-he-deems-them-honest/",
    "timestamp": "2026-02-05T19:57:41Z"
  },
  {
    "title": "TV host Savannah Guthrie's missing mother is 'still out there,' police say",
    "description": "US investigators believe the missing mother of Today show host Savannah Guthrie is \"still out there\" despite having no proof she is still alive.",
    "link": "https://www.abc.net.au/news/2026-02-06/samantha-guthrie-today-mother-still-out-there-police-say/106312206",
    "timestamp": "2026-02-05T19:56:47Z"
  },
  {
    "title": "3574 - Trump's War on History; Schumer and Jeffries Start Caving on ICE Reforms w/ Dan Friedman",
    "description": "It's an Emmajority Report Thursday on the Majority Report\r\n  \r\nOn today's program:\r\n  \r\n After the Clintons agree to testify before Congress about their relationship with Jeffrey Epstein, Donald Trump says he feels bad that \"they're going after Bill Clinton,\"…",
    "link": "https://majorityfm.libsyn.com/3574-trumps-war-on-history-schumer-and-jeffries-start-caving-on-ice-reforms-w-dan-friedman",
    "timestamp": "2026-02-05T19:56:00Z"
  },
  {
    "title": "Bitcoin's selloff pushes price below $70,000. What to know",
    "description": "Bitcoin prices have declined significantly, and some analysts warn of more pain ahead.",
    "link": "https://www.cnbc.com/2026/02/05/bitcoin-prices-crypto-crash-selloff-investors.html",
    "timestamp": "2026-02-05T19:55:39Z"
  },
  {
    "title": "Trump vow hits major roadblock as Dems and GOP unite against it in Congress",
    "description": "WASHINGTON — President Donald Trump’s attempts to dramatically slash funding for the U.S. Department of Education amid a broader push to dismantle the agency hit a major roadblock this week in the form of bipartisan approval of a spending law that gives the d…",
    "link": "https://www.rawstory.com/trump-vow-hits-major-roadblock-as-dems-and-gop-unite-against-it-in-congress/",
    "timestamp": "2026-02-05T19:53:02Z"
  },
  {
    "title": "Donald Trump endorses longtime MLB star Mark Teixeira for Congress",
    "description": "With congressional elections happening later this year, President Trump is endorsing candidates, including former MBL star Mark Teixeira.",
    "link": "https://www.usatoday.com/story/sports/mlb/2026/02/05/donald-trump-endorses-mark-teixeira-congress/88530143007/",
    "timestamp": "2026-02-05T19:49:50Z"
  },
  {
    "title": "McEntee discusses Digital Services Act with US officials",
    "description": "The Digital Services Act and its implementation in Ireland and the EU was discussed in a meeting between US Trade Representative Jamieson Greer and Minster for Foreign Affairs, Trade and Defence Helen McEntee.",
    "link": "https://www.rte.ie/news/world/2026/0205/1556998-mcentee-washington-digital-services-act/",
    "timestamp": "2026-02-05T19:46:38Z"
  },
  {
    "title": "Trump grudgingly supports Starmer's Chagos deal",
    "description": "Donald Trump suggested Sir Keir Starmer's Chagos Islands deal was the \"best he could make\" in an apparent signal of support after attacking the agreement last month.",
    "link": "https://news.sky.com/story/trump-grudgingly-supports-starmers-chagos-deal-13503828",
    "timestamp": "2026-02-05T19:44:00Z"
  },
  {
    "title": "AI moratorium was never a ‘long-term solution,’ lawmaker says",
    "description": "Rep. Jay Obernolte, R-Calif., explained that Congress is angling to design a nationwide AI framework that works with state law while offering common guardrails.",
    "link": "https://www.nextgov.com/artificial-intelligence/2026/02/ai-moratorium-was-never-long-term-solution-lawmaker-says/411223/",
    "timestamp": "2026-02-05T19:41:00Z"
  },
  {
    "title": "Noem Faces More Calls to Resign After Gutting FEMA, Abandoning Disaster Victims",
    "description": "A FEMA whistleblower is calling for the agency, which Trump has threatened to phase out, to become independent again.",
    "link": "https://truthout.org/articles/noem-faces-more-calls-to-resign-after-gutting-fema-abandoning-disaster-victims/",
    "timestamp": "2026-02-05T19:40:31Z"
  },
  {
    "title": "Colombian Military Bombs ELN and FARC Disputed Territory Hours After Trump-Petro Meeting",
    "description": "Colombian Military forces on Wednesday carried out a bombing attack in the Catatumbo region against the warring National Liberation Army (ELN) and Revolutionary Armed Forces of Colombia (FARC) Marxist terrorist groups.\nThe post Colombian Military Bombs ELN an…",
    "link": "https://www.breitbart.com/national-security/2026/02/05/colombian-military-bombs-eln-and-farc-disputed-territory-hours-after-trump-petro-meeting/",
    "timestamp": "2026-02-05T19:38:29Z"
  },
  {
    "title": "‘I stand on faith, family and freedom’: Woman who actually supports Trump to guest host ‘The View’",
    "description": "Will sit in for Alyssa Farah Griffin 1 week while she is on maternity leave",
    "link": "https://www.wnd.com/2026/02/i-stand-faith-family-freedom-woman-who-actually/",
    "timestamp": "2026-02-05T19:38:29Z"
  },
  {
    "title": "Carney scraps Canada EV sales mandate, affirms auto sector’s future is electric",
    "description": "Prime Minister Mark Carney on Thursday cancelled a mandate for all vehicles sold in Canada to be electric by 2035, while announcing major investments to support the auto industry’s EV transition. In unveiling his plan to transform the sector, Carney said Cana…",
    "link": "https://www.digitaljournal.com/world/carney-scraps-canada-ev-sales-mandate-affirms-auto-sectors-future-is-electric/article",
    "timestamp": "2026-02-05T19:37:20Z"
  },
  {
    "title": "Woman shot 5 times by DHS to stare down Trump at State of the Union address",
    "description": "A House Democrat has invited Marimar Martinez to attend President Donald Trump's State of the Union address in Washington, D.C., after she was shot by Customs and Border Patrol officers five times.In a court filing this week, attorneys for Martinez said Rep. …",
    "link": "https://www.rawstory.com/martinez-state-of-the-union/",
    "timestamp": "2026-02-05T19:36:02Z"
  },
  {
    "title": "After the Minneapolis ICE shooting of Renee Nicole Good a week of chaos unfolds",
    "description": "Ms Good and her wife moved to Minneapolis \"to make a better life\" with their six-year-old son. But just over two minutes into an encounter with ICE agents she was fatally shot.",
    "link": "https://www.abc.net.au/news/2026-02-06/renee-nicole-good-minneapolis-ice-shooting-timeline/106283054",
    "timestamp": "2026-02-05T19:35:05Z"
  },
  {
    "title": "Savannah’s Mother Nancy Guthrie Is Still Missing, FBI Offers $50,000 Reward",
    "description": "As the search for Savannah Guthrie’s missing mother continues, police have released a detailed timeline of events in the disappearance of Nancy Guthrie.",
    "link": "https://www.today.com/news/savannah-guthire-mom-nancy-missing-timeline-reward-rcna257598",
    "timestamp": "2026-02-05T19:34:30Z"
  },
  {
    "title": "Minneapolis man is charged with threatening and cyberstalking ICE officers",
    "description": "Authorities say Kyle Wagner threatened ICE officers involved in the crackdown in Minnesota.",
    "link": "https://www.bostonherald.com/2026/02/05/immigration-enforcement-minnesota-ice/",
    "timestamp": "2026-02-05T19:33:29Z"
  },
  {
    "title": "House GOP moves to require proof of citizenship, photo ID to vote in federal election",
    "description": "House GOP lawmakers are advancing a bill requiring voter ID and proof of citizenship for federal elections, putting new pressure on the Senate, while Democrats object.",
    "link": "https://www.foxnews.com/politics/house-gop-moves-require-proof-citizenship-photo-id-vote-federal-election",
    "timestamp": "2026-02-05T19:33:02Z"
  },
  {
    "title": "Caucasian Crying: Nike Investigated For ‘Anti-White’ Civil Rights Violations Against Whites Related To DEI Practices",
    "description": "Donald Trump’s agenda against diversity, inclusion, and equity has only helped fuel cries of “reverse racism,” which can be heard all across the manosphere by podcasters and conservative talking heads who insist that America is a meritocracy despite the numer…",
    "link": "https://bossip.com/4346851/nike-investigated-by-eeoc-for-anti-white-dei-practices/",
    "timestamp": "2026-02-05T19:32:59Z"
  },
  {
    "title": "China Resists Calls to Join U.S. and Russia in Trilateral Nuclear Treaty",
    "description": "The Chinese Foreign Ministry on Thursday said Beijing will resist growing international pressure to join discussions with the United States and Russia for a trilateral nuclear arms pact to replace the expiring New START treaty.\nThe post China Resists Calls to…",
    "link": "https://www.breitbart.com/asia/2026/02/05/china-resists-calls-to-join-u-s-and-russia-in-trilateral-nuclear-treaty/",
    "timestamp": "2026-02-05T19:29:39Z"
  },
  {
    "title": "Treasury Sec Admits Americans Are on the Hook for Trump’s $10B Lawsuit",
    "description": "Donald Trump’s frivolous $10 billion lawsuit against the IRS over his leaked tax returns, if he were to win or get a settlement, would be paid entirely by U.S. taxpayers.That’s what Treasury Secretary Scott Bessent said during a Senate Committee on Banking, H…",
    "link": "https://newrepublic.com/post/206211/treasury-secretary-bessent-trump-irs-lawsuit-taxpayers",
    "timestamp": "2026-02-05T19:27:26Z"
  },
  {
    "title": "Here's How Much Bernie Sanders Spent on Private Jets While Fighting Climate Change",
    "description": "Bernie Sanders has made a name for himself as Congress' resident cranky commie. He likes to pretend he's a man of the people and champion of the working class, but the reality is he owns three houses and likes capitalism when he's selling his latest book. He'…",
    "link": "https://freerepublic.com/focus/f-news/4365574/posts",
    "timestamp": "2026-02-05T19:26:19Z"
  },
  {
    "title": "Illinois Representative Asks God to Get Trump to “Do What is Right”",
    "description": "During his address to God at the National Prayer Breakfast on Thursday, Rep. Jonathan Jackson, a democrat from Illinois, called on President Donald Trump to be “invested in the elevation of suffering” of people in this country, including “the families prepari…",
    "link": "https://www.motherjones.com/politics/2026/02/illinois-representative-asks-god-to-get-trump-to-do-what-is-right/",
    "timestamp": "2026-02-05T19:26:19Z"
  },
  {
    "title": "Trump’s plan to ‘nationalize’ US elections",
    "description": "States oversee voting. Will Republicans take over?",
    "link": "https://theweek.com/politics/trump-plan-nationalize-us-elections",
    "timestamp": "2026-02-05T19:26:01Z"
  },
  {
    "title": "Nancy Pelosi swipes at Trump, accusing him of crowning himself as 'king'",
    "description": "Rep. Nancy Pelosi, a Democrat from California, made a jab at President Donald Trump during a speech, saying he had \"crowned himself king.\"",
    "link": "https://www.foxnews.com/politics/nancy-pelosi-swipes-trump-accusing-him-crowning-himself-king",
    "timestamp": "2026-02-05T19:23:31Z"
  },
  {
    "title": "Trump administration to launch TrumpRx website for discounted drugs",
    "description": "TrumpRx is a website to help patients buy prescription drugs directly from manufacturers at discounted rates",
    "link": "https://www.wesh.com/article/trumprx-launch-discount-prescription-drugs/70259644",
    "timestamp": "2026-02-05T19:23:29Z"
  },
  {
    "title": "Bad Bunny doesn’t need the NFL as much as the NFL needs him | CNN",
    "description": "The National Football League is not new to global superstars nor controversy. The Puerto Rican singer’s selection as the halftime show performer has come with both – but will also bring more eyes from around the world onto the sport in a way the league has be…",
    "link": "https://www.cnn.com/2026/02/05/entertainment/bad-bunny-nfl-super-bowl-halftime-show",
    "timestamp": "2026-02-05T19:23:03Z"
  },
  {
    "title": "Los Angeles law firm says offer to evict Billie Eilish from 'stolen land' wasn't 'serious'",
    "description": "Los Angeles-based Sinai Law Firm genuinely planned to evict singer Billie Eilish from her home after Eilish admitted she lives on stolen land in February 2026.",
    "link": "https://www.snopes.com//fact-check/la-law-firm-evict-billie-eilish/",
    "timestamp": "2026-02-05T19:23:00Z"
  },
  {
    "title": "Venezuela amnesty bill excludes gross rights abuses under Chavez, Maduro",
    "description": "Venezuelan MPs on Thursday started examining an amnesty bill which will cover “treason” and other charges used to lock up dissidents, but not “serious violations” committed over 27 years of socialist rule, a draft showed. The bill is an initiative of interim …",
    "link": "https://www.digitaljournal.com/world/venezuela-amnesty-bill-excludes-gross-rights-abuses-under-chavez-maduro/article",
    "timestamp": "2026-02-05T19:22:20Z"
  },
  {
    "title": "US wants world to follow Australia into 'club of nations' to counter China",
    "description": "The US is urging dozens of countries to follow Australia's lead and sign onto a plan to stop relying on China for the critical minerals used in modern technology.",
    "link": "https://www.abc.net.au/news/2026-02-06/us-pitches-new-critical-minerals-trading-bloc/106309202",
    "timestamp": "2026-02-05T19:22:12Z"
  },
  {
    "title": "What the Health? From KFF Health News: HHS Gets Funding, But How Will Trump Spend It?",
    "description": "Congress has passed — and President Trump has signed — the annual spending bill for the Department of Health and Human Services. But it’s unclear whether the administration will spend the money as Congress directed. Anna Edney of Bloomberg News, Joanne Kenen …",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-432-hhs-funding-congress-trump-obamacare-february-5-2026/",
    "timestamp": "2026-02-05T19:22:08Z"
  },
  {
    "title": "Amazon Pulls Melania Trump Documentary from Oregon Theater After Leftists Attack the Film in Their Marquee",
    "description": "Amazon has yanked its documentary on First Lady Melania Trump from an independent theater in Oregon after the venue’s marquee took jabs at the film.\nThe post Amazon Pulls Melania Trump Documentary from Oregon Theater After Leftists Attack the Film in Their Ma…",
    "link": "https://www.thegatewaypundit.com/2026/02/amazon-pulls-melania-trump-documentary-oregon-theater-after/",
    "timestamp": "2026-02-05T19:20:14Z"
  },
  {
    "title": "Watch: Trump slams GOP lawmaker Thomas Massie, who pressed for Epstein files release, as ‘moron’",
    "description": "US News: President Donald Trump on Thursday publicly slammed Republican Congressman Thomas Massie of Kentucky, calling him a “moron” during remarks at the Nati.",
    "link": "https://timesofindia.indiatimes.com/world/us/watch-trump-slams-gop-lawmaker-thomas-massie-who-pressed-for-epstein-files-release-as-moron/articleshow/127951586.cms",
    "timestamp": "2026-02-05T19:19:24Z"
  },
  {
    "title": "Fans race to learn Spanish before Bad Bunny’s Super Bowl halftime show",
    "description": "Bad Bunny's highly anticipated Super Bowl halftime show is set entirely in Spanish.",
    "link": "https://www.denverpost.com/2026/02/05/bad-bunny-spanish-halftime/",
    "timestamp": "2026-02-05T19:17:01Z"
  },
  {
    "title": "Fans race to learn Spanish before Bad Bunny’s Super Bowl halftime show",
    "description": "Bad Bunny's highly anticipated Super Bowl halftime show is set entirely in Spanish.",
    "link": "https://www.bostonherald.com/2026/02/05/bad-bunny-spanish-halftime/",
    "timestamp": "2026-02-05T19:17:01Z"
  },
  {
    "title": "What a crowded congressional primary in N.J. says about the state of Democrats",
    "description": "The contest is one of the first congressional primaries of the year where we will find out what issues are currently resonating with some Democratic voters. Here are some key things to know.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5701337/nj-primary-election-democrats-sherrill",
    "timestamp": "2026-02-05T19:13:50Z"
  },
  {
    "title": "Greek PM: “I haven’t given up on the trans-Atlantic relationship.”",
    "description": "Kyriakos Mitsotakis on Trump, NATO, and how Athens thinks about strategic autonomy.",
    "link": "http://foreignpolicy.com/2026/02/05/greek-pm-mitsotakis-trump-trans-atlantic-relationship/",
    "timestamp": "2026-02-05T19:13:24Z"
  },
  {
    "title": "Agencies lost around 20,000 tech workers last year — and now the Trump admin is hiring",
    "description": "All six departments and agencies that lost the most IT talent currently have open job listings for such roles.",
    "link": "https://www.nextgov.com/people/2026/02/agencies-lost-around-20000-tech-workers-last-year-and-now-trump-admin-hiring/411222/",
    "timestamp": "2026-02-05T19:13:00Z"
  },
  {
    "title": "The Full Orwell: DOJ Weaponization Working Group Finally Gets Off The Ground",
    "description": "I have to admit: the first one-and-a-half paragraphs of this CNN report had me thinking the Trump administration was shedding another pretense and just embracing its inherent shittiness. Justice Department officials are expected to meet Monday to discuss how …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180736478",
    "timestamp": "2026-02-05T19:12:10Z"
  },
  {
    "title": "Epstein files shed light on Steve Bannon’s efforts to influence European politics",
    "description": "Donald Trump’s former adviser told Epstein in 2019 that he was ‘focused on raising money for Le Pen and Salvini’ before European elections",
    "link": "https://www.irishtimes.com/world/us/2026/02/05/epstein-files-shed-light-on-steve-bannons-efforts-to-influence-european-politics/",
    "timestamp": "2026-02-05T19:10:57Z"
  },
  {
    "title": "US treasury secretary declines to rule out future Federal Reserve lawsuits",
    "description": "Scott Bessent used a Senate appearance to defend President Donald Trump's campaign to slash interest and raise tariffs.",
    "link": "https://www.aljazeera.com/news/2026/2/5/us-treasury-secretary-declines-to-rule-out-future-federal-reserve-lawsuits",
    "timestamp": "2026-02-05T19:10:23Z"
  },
  {
    "title": "Trump Awkwardly Stands Behind Democratic Congressman Who Makes Urgent Plea During Prayer",
    "description": "At the National Prayer Breakfast, Rep. Jonathan Jackson (D-Ill.) called on the president to “be invested in the alleviation of suffering” across America.",
    "link": "https://www.huffpost.com/entry/trump-prayer-jonathan-jackson-minneapolis_n_6984d28ce4b0befe3755826b",
    "timestamp": "2026-02-05T19:06:20Z"
  },
  {
    "title": "New Trump Administration Policy Politicizing Federal Workforce Endangers Federal Operations, Largest Federal Employee Union Says",
    "description": "At a moment when the American people are watching government up close, and demanding competence, stability, and professionalism, the Office of Personnel Management’s new rule stripping tens of thousands of federal employees of their due process rights and pro…",
    "link": "https://www.commondreams.org/newswire/new-trump-administration-policy-politicizing-federal-workforce-endangers-federal-operations-largest-federal-employee-union-says",
    "timestamp": "2026-02-05T19:02:40Z"
  },
  {
    "title": "Renée Fleming, Béla Fleck to perform together at Carnegie Hall after dropping out of Kennedy Center",
    "description": "Renée Fleming and Béla Fleck will perform a joint concert at Carnegie Hall in the 2026-27 season",
    "link": "https://abcnews.go.com/Entertainment/wireStory/rene-fleming-bla-fleck-perform-carnegie-hall-after-129891469",
    "timestamp": "2026-02-05T19:01:51Z"
  },
  {
    "title": "TrumpRx set to launch, but savings unclear for most patients",
    "description": "TrumpRx, the Trump administration's much-anticipated direct-to-consumer drug platform, is expected to launch on Thursday, according to two people familiar with the matter.",
    "link": "https://www.abc12.com/news/health/trumprx-set-to-launch-but-savings-unclear-for-most-patients/article_fa613bfa-2807-5b96-815d-5a36285edbe6.html",
    "timestamp": "2026-02-05T19:00:44Z"
  },
  {
    "title": "Vladimir Putin and Xi Jinping Proclaim 'New Blueprint' for Russia and China in Virtual Meeting",
    "description": "Chinese dictator Xi Jinping and his Russian counterpart, Vladimir Putin, held a \"virtual meeting\" on Wednesday in which they celebrated their countries' close bonds and vowed to expand \"high-level exchanges,\" trade, and diplomacy.\nThe post Vladimir Putin and …",
    "link": "https://www.breitbart.com/asia/2026/02/05/vladimir-putin-and-xi-jinping-proclaim-new-blueprint-for-russia-and-china-in-virtual-meeting/",
    "timestamp": "2026-02-05T19:00:27Z"
  },
  {
    "title": "Elon Musk not happy being super rich",
    "description": "Elon Musk, one of the world’s richest people, posts on X that money can’t buy happiness, sparking a wide range of reactions from the public.\n\nRead More: https://punchng.com/elon-musk-not-happy-being-super-rich/",
    "link": "https://punchng.com/elon-musk-not-happy-being-super-rich/",
    "timestamp": "2026-02-05T19:00:22Z"
  },
  {
    "title": "Trump puts FBI at “complete disposal” of authorities searching for Savannah Guthrie’s mom",
    "description": "President Donald Trump ordered federal law enforcement to assist in the ongoing search.",
    "link": "https://www.salon.com/2026/02/05/trump-puts-fbi-at-complete-disposal-of-efforts-to-locate-savannah-guthries-mom/",
    "timestamp": "2026-02-05T18:57:55Z"
  },
  {
    "title": "Bitcoin plunges to 15-month low as $2T wiped from crypto market | Honolulu Star-Advertiser",
    "description": "SINGAPORE/LONDON/NEW YORK >> Bitcoin plunged today, its decline accelerating amid weakening risk sentiment driven in part by volatility in precious metals and a broad selloff in tech shares.",
    "link": "https://www.staradvertiser.com/2026/02/05/breaking-news/bitcoin-plunges-to-15-month-low-as-2t-wiped-from-crypto-market/",
    "timestamp": "2026-02-05T18:56:52Z"
  },
  {
    "title": "Colbert: Donald Trump Is Nothing To Smile About | Mike Johnson vs. Pope Leo XIV | Bezos \"Murders\" Journalism",
    "description": "President Trump made misogynistic comments to CNN's Kaitlan Collins, Speaker Mike Johnson claims to know more about The Bible than the Pope, and journalists are outraged at Jeff Bezos over mass layoffs in the newsroom at The Washington Post. ...",
    "link": "https://littlegreenfootballs.com/article/55262_Colbert-_Donald_Trump_Is_Nothi",
    "timestamp": "2026-02-05T18:56:33Z"
  },
  {
    "title": "The Full Orwell: DOJ Weaponization Working Group Finally Gets Off The Ground",
    "description": "I have to admit: the first one-and-a-half paragraphs of this CNN report had me thinking the Trump administration was shedding another pretense and just embracing its inherent shittiness. Justice Department officials are expected to meet Monday to discuss how …",
    "link": "https://www.techdirt.com/2026/02/05/the-full-orwell-doj-weaponization-working-group-finally-gets-off-the-ground/",
    "timestamp": "2026-02-05T18:52:53Z"
  },
  {
    "title": "Donald Trump Gave A \"Speech\" For Over An Hour Today, And Hoo Boy, I Promise You Are Not Ready For Some Of The Stuff He Said",
    "description": "\"Nothing says 'Prayer Breakfast' like whining as a victim and bragging about having a fragile ego.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/meganeliscomb/trump-national-prayer-breakfast-speech",
    "timestamp": "2026-02-05T18:52:46Z"
  },
  {
    "title": "Germany’s Merz warns of potential escalation as US, Iran prepare for talks",
    "description": "Friedrich Merz said concerns about a further escalation with Iran have dominated his trip to the Gulf region.",
    "link": "https://www.aljazeera.com/news/2026/2/5/germanys-merz-warns-of-potential-escalation-as-us-iran-prepare-for-talks",
    "timestamp": "2026-02-05T18:51:39Z"
  },
  {
    "title": "Larry Kudlow: President Donald Trump was right about tariffs. *Vid-link*",
    "description": "President Trump was right about tariffs, and his policy of trade reciprocity has contributed to the Trumpian economic boom. Friday afternoon president trump posted an op-ed piece on \"the wall street journal\" web site entitled my tariffs have brought America b…",
    "link": "https://freerepublic.com/focus/f-news/4365569/posts",
    "timestamp": "2026-02-05T18:51:22Z"
  },
  {
    "title": "PM call with President Trump of the United States: 5 February 2026",
    "description": "The Prime Minister spoke with the President of the United States, Donald Trump today.",
    "link": "https://www.gov.uk/government/news/pm-call-with-president-trump-of-the-united-states-5-february-2026",
    "timestamp": "2026-02-05T18:50:27Z"
  },
  {
    "title": "Republicans clash over the Senate filibuster and Trump-backed voter ID bill",
    "description": "Republicans clash over the filibuster as President Donald Trump and others push for the SAVE Act to require proof of citizenship to vote in elections.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-clash-filibuster-trump-backed-voter-id-bill-rcna257431",
    "timestamp": "2026-02-05T18:50:03Z"
  },
  {
    "title": "Watch: Pro-wrestling fans loudly chanting 'f*** ICE' goes viral & is the best thing you'll see all day",
    "description": "These fans are making their voices heard!",
    "link": "https://www.pride.com/culture/sports/aew-anti-ice-chant",
    "timestamp": "2026-02-05T18:48:47Z"
  },
  {
    "title": "Warren and Bessent erupt into shouting match over Trump's Warsh joke",
    "description": "Elizabeth Warren sparred with Treasury Secretary Bessent over Trump's joke about suing Fed nominee Kevin Warsh if he doesn't cut interest rates as desired.",
    "link": "https://www.foxnews.com/politics/warren-bessent-erupt-shouting-match-over-trumps-warsh-joke",
    "timestamp": "2026-02-05T18:48:47Z"
  },
  {
    "title": "A Homeland Security shutdown grows more likely as Republicans rebuff Democratic demands for ICE",
    "description": "Short-term funding for DHS lasts through Feb. 13.",
    "link": "https://www.bostonherald.com/2026/02/05/congress-homeland-security/",
    "timestamp": "2026-02-05T18:46:32Z"
  },
  {
    "title": "Age Is Just a Number! Trump, 79, Insists He Feels 29 Years Old — Despite Facing Many Health Issues and 'Dementia' Concerns",
    "description": "Donald Trump once again tried to convince the country he is facing zero health issues, even going as far as to say he feels 29.",
    "link": "https://radaronline.com/p/trump-feels-29-years-old-despite-health-issues-dementia/",
    "timestamp": "2026-02-05T18:45:00Z"
  },
  {
    "title": "US Olympic leaders in Milan set goals to be respectful guests and good team players",
    "description": "Show respect. Be humble and a good Olympic partner. Keep Team USA athletes safe.",
    "link": "https://www.bostonherald.com/2026/02/05/us-team-diplomacy/",
    "timestamp": "2026-02-05T18:44:37Z"
  },
  {
    "title": "Managed Deprivation in Gaza",
    "description": "Until humanitarian conditions improve, Trump’s Board of Peace doesn’t deserve the benefit of the doubt.",
    "link": "http://foreignpolicy.com/2026/02/05/gaza-trump-board-of-peace-humanitarian-hamas-israel/",
    "timestamp": "2026-02-05T18:43:46Z"
  },
  {
    "title": "Imane Khelif Says She’d Take Sex Test to Qualify for 2028 Olympics: “Nothing to Hide”",
    "description": "The Algerian boxer said the 2024 campaign against her caused “psychological trauma, for me, and for my family.”",
    "link": "https://www.them.us/story/imane-khelif-sex-test-qualify-2028-olympics",
    "timestamp": "2026-02-05T18:43:16Z"
  },
  {
    "title": "ICE pullback in Minneapolis shows the limits of Donald Trump’s scare tactics",
    "description": "Donald Trump’s penchant for sowing fear is in danger as ICE Out protests remain peaceful and public anger is directed not at demonstrators, but at violent federal ICE officers.",
    "link": "https://theconversation.com/ice-pullback-in-minneapolis-shows-the-limits-of-donald-trumps-scare-tactics-274933",
    "timestamp": "2026-02-05T18:42:36Z"
  },
  {
    "title": "‘One nation under God’: Trump announces event to rededicate America",
    "description": "Invites Americans to gather on National Mall to pray and give thanks",
    "link": "https://www.wnd.com/2026/02/one-nation-under-god-trump-announces-event-rededicate/",
    "timestamp": "2026-02-05T18:42:17Z"
  },
  {
    "title": "'So Much for the Golden Age of America': Layoffs Hit 17-Year High Under Trump",
    "description": "While President Donald Trump continues to falsely claim that the US economy is the hottest in the world, new data released Thursday shows that announced layoffs in January hit a high not seen since the Great Recession of 2009.The new report by corporate outpl…",
    "link": "https://www.commondreams.org/news/us-layoffs-january-2026",
    "timestamp": "2026-02-05T18:41:18Z"
  },
  {
    "title": "Local officials push back on Trump's threats to 'nationalize' elections in targeted cities",
    "description": "Officials in Atlanta, Philadelphia and Detroit this week vowed to defend local control of elections after President Donald Trump floated the idea that Republicans should \"nationalize\" elections.“The Republicans should say, ‘We want to take over.",
    "link": "https://www.nbcnews.com/politics/elections/local-officials-push-back-trumps-threats-nationalize-elections-targete-rcna257583",
    "timestamp": "2026-02-05T18:41:06Z"
  },
  {
    "title": "Trump’s endorsement of Blake Miguez changes Louisiana race — but doesn’t scare off others",
    "description": "President Donald Trump endorsed Blake Miguez for Congress on Wednesday, once again reshuffling Louisiana politics with a late-night Truth Social post.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/trump-blake-miguez-congress-election/article_8ea95f34-c59a-5836-9f84-9159aa192960.html",
    "timestamp": "2026-02-05T18:40:00Z"
  },
  {
    "title": "Police Offering $50,000 Reward in Search for Savannah Guthrie’s Mom Nancy; Still ‘No Suspects’ or ‘Persons of Interests’ After 5 Days",
    "description": "Sheriff Chris Nanos told reporters during a press conference on Thursday that the police are offering a $50,000 missing person reward in the search for Nancy Guthrie, mother of “Today” co-anchor Savannah Guthrie. Nanos also shared that no suspect has been ide…",
    "link": "https://variety.com/2026/tv/news/savannah-guthrie-mother-nancy-reward-1236652725/",
    "timestamp": "2026-02-05T18:38:29Z"
  },
  {
    "title": "Trump Doesn’t Appear to Notice as Lawmaker Unleashes Veiled Swipes at Him During National Prayer Breakfast Blessing",
    "description": "President Donald Trump didn't seem to notice as Rep. Jonathan Jackson (D-IL) snuck in a few apparent criticisms aimed at the commander in chief during the National Prayer Breakfast on Thursday.\nThe post Trump Doesn’t Appear to Notice as Lawmaker Unleashes Vei…",
    "link": "https://www.mediaite.com/media/news/trump-doesnt-appear-to-notice-as-lawmaker-unleashes-veiled-swipes-at-him-during-national-prayer-breakfast-blessing/",
    "timestamp": "2026-02-05T18:37:19Z"
  },
  {
    "title": "New Project 2025-Backed Trump Rule Guts Protections for 50,000 Federal Workers",
    "description": "The Trump administration on Thursday finalized a major civil service rule change that makes it easier to fire certain federal employees and replace them with political loyalists—a move that critics say increases the likelihood of abuse of power. The new polic…",
    "link": "https://www.commondreams.org/news/opm-rule-change",
    "timestamp": "2026-02-05T18:35:53Z"
  },
  {
    "title": "Woman Who Actually Supports Trump Will Guest Host ‘The View’",
    "description": "Savannah Chrisley, an outspoken supporter of President Donald Trump, will be one of the guest hosts on \"The View.\"",
    "link": "https://dailycaller.com/2026/02/05/savannah-chrisley-the-view-trump/",
    "timestamp": "2026-02-05T18:34:40Z"
  },
  {
    "title": "As Trump reshapes foreign policy, China moves to limit risks, reap gains - NPR",
    "description": "As Trump reshapes foreign policy, China moves to limit risks, reap gainsNPR Donald Trump is making China great again | Steven GreenhouseThe Guardian Podcast: How Trump’s Year of Disruption Has Only Helped ChinaBloomberg.com How Trump is giving China a chance …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180736014",
    "timestamp": "2026-02-05T18:33:06Z"
  },
  {
    "title": "California’s instant EV rebates would require automakers to match state funds",
    "description": "New budget language lays out how Gov. Gavin Newsom plans to structure a $200 million electric vehicle rebate program, including price caps, automaker matching funds and a focus on first-time buyers…",
    "link": "https://www.ocregister.com/2026/02/05/californias-instant-ev-rebates-would-require-automakers-to-match-state-funds/",
    "timestamp": "2026-02-05T18:33:04Z"
  },
  {
    "title": "Fact check: Trump repeats lies about inflation, immigration and elections in NBC interview | CNN Politics",
    "description": "When President Donald Trump claimed to NBC Nightly News anchor Tom Llamas in a Wednesday interview that “I’m getting – starting to get great polls on the economy,” Llamas quickly pushed back by noting that Trump’s polling on the economy is “not great.”",
    "link": "https://www.cnn.com/2026/02/05/politics/fact-check-trump-nbc-interview",
    "timestamp": "2026-02-05T18:30:47Z"
  },
  {
    "title": "Trump to launch TrumpRx.gov, branding his push to lower prescription prices (Dan Diamond/Washington Post)",
    "description": "Dan Diamond / Washington Post:\nTrump to launch TrumpRx.gov, branding his push to lower prescription prices  —  The president has argued his drug-pricing initiative “should win us the midterms.”  Experts say its impact could be positive but limited.  —  Presid…",
    "link": "https://www.memeorandum.com/260205/p68",
    "timestamp": "2026-02-05T18:30:00Z"
  },
  {
    "title": "New poll: Optimism about personal finances on the rise under Trump",
    "description": "'Since the depths of despair in the midst of that government shutdown a couple of months ago, 4 out of 5 polls have shown some improvement'",
    "link": "https://www.wnd.com/2026/02/new-poll-optimism-about-personal-finances-rise-under/",
    "timestamp": "2026-02-05T18:29:23Z"
  },
  {
    "title": "BRIAN MAY On Why QUEEN Won't Tour America Right Now: \"It's A Dangerous Place At The Moment\"",
    "description": "Brian May revealed Queen has no plans to tour the United States in the foreseeable future, citing concerns it's become too dangerous.\nThe post BRIAN MAY On Why QUEEN Won't Tour America Right Now: \"It's A Dangerous Place At The Moment\" appeared first on Metal …",
    "link": "https://metalinjection.net/news/brian-may-on-why-queen-wont-tour-america-right-now-its-a-dangerous-place-at-the-moment",
    "timestamp": "2026-02-05T18:28:54Z"
  },
  {
    "title": "Bitcoin Crash Could Deepen to $38K, Say Analysts—Here's Why",
    "description": "Bitcoin has already tumbled far from its October high, but history suggests the rout could deepen before momentum shifts, according to Stifel.",
    "link": "https://decrypt.co/357089/bitcoin-crash-deepen-38k-analysts-heres-why",
    "timestamp": "2026-02-05T18:27:48Z"
  },
  {
    "title": "Trump administration reclassifies 50,000 federal workers—here's what can happen post this",
    "description": "The Trump administration has issued a rule reclassifying approximately 50,000 senior federal workers into a new \"Schedule Policy/Career\" category. This change aims to make it easier to fire employees involved in policy for poor performance or misconduct. The …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-reclassifies-50000-federal-workersheres-what-can-happen-post-this/articleshow/127948073.cms",
    "timestamp": "2026-02-05T18:25:45Z"
  },
  {
    "title": "Cuba president open to dialogue with US, rejects 'pressure'",
    "description": "The US has prevented oil shipments to Cuba in recent weeks, plunging the country into deeper and more frequent blackouts. Cuba's president said that any talks must be held without interference in its internal affairs.",
    "link": "https://www.dw.com/en/cuba-us-trump-dialogue-talks-blackout-oil/a-75828676",
    "timestamp": "2026-02-05T18:23:00Z"
  }
]