[
  {
    "title": "Trump's renewed threat of U.S. tariff on international films creates more confusion for Alberta industry",
    "description": "U.S. president Donald Trump raised the idea of a 100 per cent tariff on international films for the second time this year, but Alberta's film industry remains confused about how such an idea would even work.",
    "link": "https://www.cbc.ca/news/canada/calgary/alberta-film-baffled-tariff-1.7647529",
    "timestamp": "2025-09-30T20:32:26Z"
  },
  {
    "title": "Trump Admin May Have Eyes On New Regime Change War",
    "description": "Questions arise regarding the U.S.' potential plans for a Venezuelan regime change, following tensions over drugs and the mobilization of forces in the area.",
    "link": "https://dailycaller.com/2025/09/30/trump-admin-regime-change-war-maduro-venezuela/",
    "timestamp": "2025-09-30T20:31:45Z"
  },
  {
    "title": "Judge’s novel free speech opinion doubles as broad indictment of Trump",
    "description": "U.S. District Judge William Young, a Reagan appointee, ruled against the administration’s targeting of noncitizen pro-Palestinians for exercising their free speech in one of the more remarkable opinions in the Trump era.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/judge-trump-free-speech-ruling-pro-palestinian-protesters-rcna234760",
    "timestamp": "2025-09-30T20:31:22Z"
  },
  {
    "title": "Hegseth orders military culture overhaul: ‘if you don’t agree, resign’ | CNN Politics",
    "description": "Before a captive audience of hundreds of senior military officers on Tuesday morning, Defense Secretary Pete Hegseth asserted his vision for how the US military will physically look and act, and offered a stark conclusion: If you don’t agree, resign.",
    "link": "https://www.cnn.com/2025/09/30/politics/hegseth-speech-culture-standards",
    "timestamp": "2025-09-30T20:27:42Z"
  },
  {
    "title": "Erika Kirk: ‘Witch’ Who ‘Cursed’ Charlie Kirk Ahead of Shooting …",
    "description": "Reading Time: 3 minutesThe witch who 'cursed' Charlie Kirk has a message for his widow.\nErika Kirk: ‘Witch’ Who ‘Cursed’ Charlie Kirk Ahead of Shooting … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/erika-kirk-witch-who-cursed-charlie-kirk-ahead-of-shooting-wants-to-apologize-to-his-widow/",
    "timestamp": "2025-09-30T20:26:34Z"
  },
  {
    "title": "Almost 400,000 Americans still get Social Security checks. That’s going away everywhere (except where it isn’t)",
    "description": "The Social Security Administration says it will still issue paper checks if no other options are available.",
    "link": "https://fortune.com/2025/09/30/social-security-payments-government-benefits-trump-administration-checks/",
    "timestamp": "2025-09-30T20:26:30Z"
  },
  {
    "title": "Trump could be open to Kim talks 'without preconditions'",
    "description": "United States President Donald Trump remains willing to talk with North Korean leader Kim Jong-un \"without any preconditions,\" although Washington's policy on North Korea has not changed, South Korea'...",
    "link": "https://biztoc.com/x/02c2b8641b6fed31",
    "timestamp": "2025-09-30T20:24:20Z"
  },
  {
    "title": "Trump has been disqualified from receiving Nobel Prize? Here's the truth",
    "description": "In September 2025, the Nobel Prize Committee announced that U.S. President Donald Trump was permanently disqualified from receiving future awards due to recent remarks to the United Nations General Assembly and his effort to rebrand the Department of Defense …",
    "link": "https://www.snopes.com//fact-check/trump-nobel-prize-disqualified/",
    "timestamp": "2025-09-30T20:24:00Z"
  },
  {
    "title": "Only 48 Percent Of U.S. Adults Under The Age Of 30 Have A Full-Time Job?",
    "description": "I am so glad that I am not a young adult looking for a job in this very difficult economic environment.  Every month, federal bureaucrats tell us that the unemployment rate in this country is low, but at this point everyone knows that the numbers that they gi…",
    "link": "http://theeconomiccollapseblog.com/only-48-percent-of-u-s-adults-under-the-age-of-30-have-a-full-time-job/",
    "timestamp": "2025-09-30T20:23:26Z"
  },
  {
    "title": "ECB chief says eurozone weathering Trump tariff storm",
    "description": "European Central Bank chief Christine Lagarde said Tuesday US tariffs had not hit the eurozone as badly as feared, but warned new risks could lie ahead in an uncertain world. Europe, which runs a hefty trade surplus in goods with the United States, was one of…",
    "link": "https://www.digitaljournal.com/world/ecb-chief-says-eurozone-weathering-trump-tariff-storm/article",
    "timestamp": "2025-09-30T20:22:33Z"
  },
  {
    "title": "Pfizer strikes $70B deal with Trump to cut Medicaid drug prices, expand American manufacturing under tariff threat",
    "description": "“I can’t tell you how big this is,” President Donald Trump said Tuesday.",
    "link": "https://fortune.com/2025/09/30/pfizer-strikes-tariff-deal-trump-70-billion/",
    "timestamp": "2025-09-30T20:20:13Z"
  },
  {
    "title": "5 Netflix Favorite Series Returning With New Seasons Before The End Of 2025",
    "description": "Netflix subscribers have a lot to look forward to as the holidays approach, including the return of five favorite shows with new seasons.",
    "link": "https://www.forbes.com/sites/danafeldman/2025/09/30/5-netflix-favorite-series-returning-with-new-seasons-before-the-end-of-2025/",
    "timestamp": "2025-09-30T20:19:57Z"
  },
  {
    "title": "Your expensive power bill is part of an alarming trend",
    "description": "Like most Americans this month, your most recent power bill may have given you a shock. Residential electricity rates have risen fast across the US — more than 30 percent on average since 2020 and almost double the rate of inflation in the past year — with no…",
    "link": "https://www.vox.com/climate/463277/power-bill-expensive-utility-rising-price-trump",
    "timestamp": "2025-09-30T20:18:47Z"
  },
  {
    "title": "Unraveling Eric Swalwell's claim 5 mass shootings happened over 24 hours in late September 2025",
    "description": "The lawmaker was almost correct: Five mass shootings occurred in a 25.5-hour period in the U.S. the weekend of Sept. 27-28.",
    "link": "https://www.snopes.com//news/2025/09/30/mass-shootings-eric-swalwell/",
    "timestamp": "2025-09-30T20:16:00Z"
  },
  {
    "title": "How Jeff Landry's proposed use of Louisiana National Guard compares to past deployments",
    "description": "Gov. Jeff Landry’s request for a federally-funded deployment of 1,000 National Guard troops to urban centers throughout Louisiana comes amid a controversial push by President Donald J. Trump to use the military to crack down on crime and protests in…",
    "link": "https://www.theadvocate.com/baton_rouge/news/jeff-landry-national-guard-by-the-numbers/article_5d81c762-2a7b-58b0-940f-7ea461150c99.html",
    "timestamp": "2025-09-30T20:15:00Z"
  },
  {
    "title": "Government Shutdown Watch: Imminent As Partisan Stalemate Over Healthcare Remains Ahead Of Midnight Deadline",
    "description": "The government will shut down at midnight Tuesday if Congress doesn't approve a new spending plan.",
    "link": "https://www.forbes.com/sites/saradorn/2025/09/30/government-shutdown-watch-imminent-as-partisan-stalemate-over-healthcare-remains-ahead-of-midnight-deadline/",
    "timestamp": "2025-09-30T20:14:05Z"
  },
  {
    "title": "Open Thread: Could’ve Been An Email",
    "description": "oh dear lol [image or embed] — First Wordle Problems (@fwordleproblems.bsky.social) September 30, 2025 at 10:46 AM At last, Jeb Bush has his revenge! Per the company paper, in the town where the monopoly industry is national politics [gift link]: Live updates…",
    "link": "https://balloon-juice.com/2025/09/30/open-thread-couldve-been-an-email/",
    "timestamp": "2025-09-30T20:13:56Z"
  },
  {
    "title": "Republican duo 'urgently requesting an explanation' for White House move: report",
    "description": "Some top Republican senators are asking the White House to roll back its plans to withhold funding for the Council of the Inspectors General on Integrity and Efficiency, which oversees watchdogs across executive branch agencies.Appropriations Chair Susan Coll…",
    "link": "https://www.rawstory.com/white-house-inspector-general/",
    "timestamp": "2025-09-30T20:13:04Z"
  },
  {
    "title": "Florida officials vote to donate land to Trump library. There’s backlash. - The Washington Post",
    "description": "Florida officials vote to donate land to Trump library. There’s backlash.The Washington Post Florida Hands Over Prime Miami Property for Trump LibraryThe New York Times Trump to build high-rise library ‘visible for miles’ after state gifts Miami landMiami Her…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179605828",
    "timestamp": "2025-09-30T20:12:47Z"
  },
  {
    "title": "Trump and Hegseth spark alarm about domestic use of military",
    "description": "At an unprecedented gathering of the nation's top military brass, Trump and Hegseth spoke of using force in America",
    "link": "https://www.salon.com/2025/09/30/trump-and-hegseth-spark-alarm-about-domestic-use-of-military/",
    "timestamp": "2025-09-30T20:11:52Z"
  },
  {
    "title": "Elon Musk’s Wikipedia Competitor Is Going to Be a Disaster",
    "description": "Remember when Grok praised Adolf Hitler?",
    "link": "https://gizmodo.com/elon-musks-wikipedia-competitor-is-going-to-be-a-disaster-2000665751",
    "timestamp": "2025-09-30T20:10:20Z"
  },
  {
    "title": "Reagan-Appointed Judge Issues Blistering Ruling Against Trump On First Amendment",
    "description": "The case, centering on pro-Palestinian activism, led the judge to a lengthy condemnation of the Trump administration's approach to free speech rights.",
    "link": "https://www.huffpost.com/entry/reagan-appointed-judge-issues-blistering-ruling-against-trump-on-first-amendment_n_68dc158de4b0b11989efafc3",
    "timestamp": "2025-09-30T20:10:05Z"
  },
  {
    "title": "From Trump Tower to EA Tower: Kushner's Plan to Dominate Video Games",
    "description": "Electronic Arts is set for a record $55bn buyout led by Saudi Arabia's PIF, Silver Lake, and Jared Kushner's Affinity Partners, sparking scrutiny over foreign influence in gaming.",
    "link": "https://www.ibtimes.com/trump-tower-ea-tower-kushners-plan-dominate-video-games-3784921",
    "timestamp": "2025-09-30T20:08:25Z"
  },
  {
    "title": "YouTube To Pay $24.5 Million Settlement for Donald Trump Lawsuit Over President's Account Suspension",
    "description": "YouTube agreed to pay $24.5 million as a settlement for a lawsuit by United States President Donald Trump over his 2021 account suspension.",
    "link": "https://www.ibtimes.com/youtube-pay-245-million-settlement-donald-trump-lawsuit-over-presidents-account-suspension-3784919",
    "timestamp": "2025-09-30T20:07:11Z"
  },
  {
    "title": "Chicago Mayor Johnson: President Trump 'Is an Unstable Human Being'",
    "description": "Tuesday on CNN's \"The Situation Room,\" Chicago Mayor Brandon Johnson (D) said President Donald Trump was \"an unstable human being.\"\nThe post Chicago Mayor Johnson: President Trump ‘Is an Unstable Human Being’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/09/30/chicago-mayor-johnson-president-trump-is-an-unstable-human-being/",
    "timestamp": "2025-09-30T20:06:51Z"
  },
  {
    "title": "Trump Says US Cities Should Be Military 'Training Grounds'",
    "description": "US President Donald Trump told a rare meeting of top military officers Tuesday that the country faces a \"war from within\" and suggested American cities be used as \"training grounds\" for troops.",
    "link": "https://www.ibtimes.com.au/trump-says-us-cities-should-military-training-grounds-1860660",
    "timestamp": "2025-09-30T20:06:07Z"
  },
  {
    "title": "Trump Hints At 'Land' Strikes On Venezuelan Cartels: 'Going To Look Very Seriously'",
    "description": "President Donald Trump hinted at potential strikes on \"land\" against Venezuelan cartels as his administration continues to intensify pressure on the country",
    "link": "https://www.ibtimes.com/trump-hints-land-strikes-venezuelan-cartels-going-look-very-seriously-3784909",
    "timestamp": "2025-09-30T20:05:48Z"
  },
  {
    "title": "Judge finds the Trump administration unconstitutionally targeted noncitizens over Gaza war protests",
    "description": "A federal judge says the Trump administration unconstitutionally targeted noncitizens for deportation over pro-Palestinian protests. U.S. District Judge William Young issued the ruling on Tuesday, agreeing with the plaintiffs that the policy they describe as …",
    "link": "https://apnews.com/article/marco-rubio-palestinian-demonstrations-universities-24561e3ee9031aad5a83b09925efd674",
    "timestamp": "2025-09-30T20:05:48Z"
  },
  {
    "title": "Trump’s proposed changes to the H-1B visa program, explained",
    "description": "Business leaders support the visas as a way to bring talent to the U.S., while others say the program allows companies to hire foreign workers at lower wages than they would pay Americans.",
    "link": "https://www.pbs.org/newshour/economy/trumps-proposed-changes-to-the-h-1b-visa-program-explained",
    "timestamp": "2025-09-30T20:05:22Z"
  },
  {
    "title": "Trump Admin Deports Planeload of Iranians Overnight After Striking Rare Deal",
    "description": "The deportees included criminals and others who entered the country illegally, a U.S. official said Tuesday.",
    "link": "https://www.westernjournal.com/trump-admin-deports-planeload-iranians-overnight-striking-rare-deal/",
    "timestamp": "2025-09-30T20:05:12Z"
  },
  {
    "title": "TIM DONNER: Democrats Threatening A Government Shutdown Are Playing With Fire",
    "description": "As we approach the deadline for avoiding a shutdown on Oct. 1, Democrats are stuck squarely between a rock and a hard place.",
    "link": "https://dailycaller.com/2025/09/30/opinion-democrats-threatening-a-government-shutdown-are-playing-with-fire-tim-donner/",
    "timestamp": "2025-09-30T20:04:56Z"
  },
  {
    "title": "Fashion legend Ralph Lauren opening starry Polo Bar in London",
    "description": "The Blighty outpost of the clubby eatery will be located at 1 Hanover Square and launches in 2028.",
    "link": "https://pagesix.com/2025/09/30/society/fashion-icon-ralph-lauren-bringing-starry-polo-bar-to-london/",
    "timestamp": "2025-09-30T20:04:52Z"
  },
  {
    "title": "Trump Says He Taunted Putin About Inability To Win Ukraine War: 'Are You a Paper Tiger?'",
    "description": "President Donald Trump said he taunted Russian counterpart Vladimir Putin over his inability to win the war in Ukraine after more than three years",
    "link": "https://www.ibtimes.com/trump-says-he-taunted-putin-about-inability-win-ukraine-war-are-you-paper-tiger-3784906",
    "timestamp": "2025-09-30T20:04:49Z"
  },
  {
    "title": "Who is Beth Bourne? Moms for Liberty Chairperson Strips To Protect Young Girls From Transgender Locker Room Policy",
    "description": "Moms for Liberty chair Beth Bourne sparked fury at a California school board meeting after stripping to a bikini in protest against transgender locker room policies.",
    "link": "https://www.ibtimes.com/who-beth-bourne-moms-liberty-chairperson-strips-protect-young-girls-transgender-locker-room-3784901",
    "timestamp": "2025-09-30T20:03:10Z"
  },
  {
    "title": "Donald Trump Slammed After Sharing Chuck Schumer Deepfake Racist Video: 'Bigotry Will Get You Nowhere,' Says Jeffries",
    "description": "Donald Trump has triggered outrage after sharing a racist AI-generated video of Democratic leaders Chuck Schumer and Hakeem Jeffries, deepening tensions ahead of a government shutdown deadline.",
    "link": "https://www.ibtimes.com/donald-trump-slammed-after-sharing-chuck-schumer-deepfake-racist-video-bigotry-will-get-you-3784900",
    "timestamp": "2025-09-30T20:02:52Z"
  },
  {
    "title": "Trump Brags On Bling’d Out White House While Grocery Prices Are High As Snoop Dogg",
    "description": "With the government facing an impending shutdown, the Epstein files still not released and no money for cancer research, President Donald Trump took to social media to brag about his golden remake of the Oval Office, and other parts of the White House, which …",
    "link": "https://hiphopwired.com/2853915/trump-brags-on-blingd-out-white-house/",
    "timestamp": "2025-09-30T20:02:23Z"
  },
  {
    "title": "Here are some effects of a government shutdown if Congress and Donald Trump don’t reach a deal",
    "description": "The federal government is nearing a partial shutdown, with a range of effects on public services and the broader U.S. economy.\nEmployee furloughs and potential layoffs would halt some government activities. Other functions — like NASA’s space missions, Presid…",
    "link": "https://biztoc.com/x/6a43a22ad2a6896c",
    "timestamp": "2025-09-30T20:01:56Z"
  },
  {
    "title": "CPB irked with NPR after outlet tries to block $58 million in dispersements to new nonprofit",
    "description": "National Public Radio filed a lawsuit against the Corporation for Public Broadcasting on Friday to block $57.9 million in satellite funding redirection to a new nonprofit.",
    "link": "https://www.foxnews.com/media/cpb-irked-npr-after-outlet-tries-block-58-million-dispersements-new-nonprofit",
    "timestamp": "2025-09-30T20:00:35Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The United Nations Assistance Mission in Afghanistan (UNAMA) today called on the country’s de facto Taliban authorities to immediately and fully restore nationwide Internet and telecommunications access. Since 16 September, Internet access has been interrupte…",
    "link": "https://press.un.org/en/2025/db250930.doc.htm",
    "timestamp": "2025-09-30T20:00:26Z"
  },
  {
    "title": "Secretary-General Welcomes United States-led Gaza Proposal, Calls for Immediate Action towards Peace",
    "description": "The following statement was issued today by the Spokesman for UN Secretary-General António Guterres:",
    "link": "https://press.un.org/en/2025/sgsm22844.doc.htm",
    "timestamp": "2025-09-30T20:00:12Z"
  },
  {
    "title": "Softbank, Cathie Wood’s Ark Among Potential Investors in Tether Fundraising: Report",
    "description": "The USDT stablecoin issuer is reportedly looking to raise up to $20 billion at a valuation of $500 billion, which would make it one of the most valuable private companies in the world. What to know: Tech-focused investment companies SoftBank and Ark Invest ar…",
    "link": "https://www.activistpost.com/softbank-cathie-woods-ark-among-potential-investors-in-tether-fundraising-report/",
    "timestamp": "2025-09-30T20:00:00Z"
  },
  {
    "title": "“Hey! I’m not a U.S. citizen!”: Chicago delivery guy taunts Border Patrol, gets swarmed, escapes in chaotic street chase",
    "description": "A viral video out of Chicago shows a deliveryman on a bicycle taunting a crowd of Border Patrol agents before outpacing them in a chaotic street chase. \n\n\nThere are actually a couple of different versions and angles of the incident in question. First, the man…",
    "link": "https://www.dailydot.com/viral-politics/delivery-man-evades-border-patrol-bicycle-chicago/",
    "timestamp": "2025-09-30T20:00:00Z"
  },
  {
    "title": "Trump Turns Uncle Sam Into a Shareholder: Inside His Shock $11B Intel Stake and the Companies Next on His List",
    "description": "The Trump Administration has been aggressively pursuing equity stakes in major US private firms since July.",
    "link": "https://www.ibtimes.com/trump-turns-uncle-sam-shareholder-inside-his-shock-11b-intel-stake-companies-next-his-list-3784892",
    "timestamp": "2025-09-30T19:59:25Z"
  },
  {
    "title": "How Todd Chrisley Showed Support After A Former Inmate Was Released From Prison Early",
    "description": "Todd Chrisley has entered the realm of prison reform.",
    "link": "https://www.cinemablend.com/television/how-todd-chrisley-showed-support-after-former-inmate-released-from-prison-early",
    "timestamp": "2025-09-30T19:59:18Z"
  },
  {
    "title": "Worship leader Sean Feucht mismanaged millions in ministry funds, former associates say",
    "description": "His real estate acquisitions have raised questions from Christian watchdog groups.",
    "link": "https://www.bostonherald.com/2025/09/30/sean-feucht-financial-allegations/",
    "timestamp": "2025-09-30T19:57:47Z"
  },
  {
    "title": "Sherrill fires back at GOP rival as questions swirl over her military records: 'Hand in the cookie jar'",
    "description": "New Jersey gubernatorial candidates Rep. Mikie Sherrill and Jack Ciattarelli clash over leaked military records from a 1994 Naval Academy cheating scandal controversy.",
    "link": "https://www.foxnews.com/politics/sherrill-fires-back-gop-rival-questions-swirl-over-her-military-records",
    "timestamp": "2025-09-30T19:53:30Z"
  },
  {
    "title": "Trump Pals Revealed In Latest Epstein Files Release",
    "description": "The latest batch of files from Jeffrey Epstein's estate was revealed by congressional Democrats, who noted that Elon Musk, Steve Bannon and Peter Thiel were mentioned prominently in them causing social media to react wildly.",
    "link": "https://hiphopwired.com/playlist/trump-pals-revealed-in-latest-epstein-files-release/",
    "timestamp": "2025-09-30T19:52:36Z"
  },
  {
    "title": "Trump Tells Military Brass US Faces ‘Invasion From Within’",
    "description": "President Donald Trump told top military brass that the US is fighting an “invasion from within,” as he used a highly unusual gathering of officers stationed around the world to deliver a largely political speech that highlighted border security and rooting o…",
    "link": "https://biztoc.com/x/37769c8c403ccfb5",
    "timestamp": "2025-09-30T19:50:14Z"
  },
  {
    "title": "Donald Shocked Military Leadership Won't Clap For Him",
    "description": "Pete \"Drunky McDrunkPants\" Hegseth and Donald Trump had their find little show in front of the military leadership on Tuesday morning. I guess they expected a full on party atmosphere with raucous applause and whooping as they talked about the \"warrior ethos\"…",
    "link": "https://crooksandliars.com/2025/09/trump-shocked-military-leadership-wont",
    "timestamp": "2025-09-30T19:49:53Z"
  },
  {
    "title": "What’s Missing From Trump’s Gaza Peace Plan",
    "description": "Announcing a peace plan is the easy part. Executing it is much harder.",
    "link": "https://www.theatlantic.com/international/archive/2025/09/trump-gaza-peace-plan-netanyahu/684412/",
    "timestamp": "2025-09-30T19:49:35Z"
  },
  {
    "title": "Trump posts deepfake video of Jeffries, Schumer with racist tropes as shutdown looms",
    "description": "President Donald Trump posted a deepfake of Hakeem Jeffries and Chuck Schumer ahead of the government shutdown. Many call the viral video racist.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/30/trump-racist-video-hakeem-schumer/86434370007/",
    "timestamp": "2025-09-30T19:49:32Z"
  },
  {
    "title": "Trump Threatens To Fire Generals If He Doesn’t Like Them",
    "description": "Trump gave the game away before his trip to Quantico this morning to address the Generals. Intimidation and getting them in line for when he needs them. It's what petty tinpot dictators do. Weak men pretending to be strong.\nSource: Newsweek\nPresident Donald T…",
    "link": "https://crooksandliars.com/2025/09/trump-threatens-fire-generals-if-he-doesn",
    "timestamp": "2025-09-30T19:49:31Z"
  },
  {
    "title": "Trump and Hegseth Gathered U.S. Military Leaders for an “Embarrassing” Rant",
    "description": "Defense officials were shocked at the cost and danger of assembling the military’s top officers to listen to meandering tirades.\nThe post Trump and Hegseth Gathered U.S. Military Leaders for an “Embarrassing” Rant appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/30/trump-hegseth-generals-admirals-military-meeting/",
    "timestamp": "2025-09-30T19:49:24Z"
  },
  {
    "title": "Will Israel be banned from the 2026 World Cup? UEFA, FIFA under pressure after UN declares genocide in Gaza",
    "description": "UEFA and FIFA have been urged to take action against Israel after the UN declared a genocide was being committed in Gaza.",
    "link": "https://www.sportingnews.com/us/soccer/news/israel-world-cup-2026-banned-uefa-fifa-gaza/1593e23eb0fa8d0f008de8ce",
    "timestamp": "2025-09-30T19:48:20Z"
  },
  {
    "title": "Trump administration targets Minnesota in latest sanctuary policy lawsuit",
    "description": "Minnesota AG Keith Ellison calls the lawsuit baseless and politically motivated.",
    "link": "https://www.bostonherald.com/2025/09/30/immigration-lawsuit-minnesota/",
    "timestamp": "2025-09-30T19:47:52Z"
  },
  {
    "title": "The Crisis for the Women Who Make Your Clothes",
    "description": "Trump’s tariffs are having major ripple effects on the fashion industry’s female work force.",
    "link": "http://foreignpolicy.com/2025/09/30/women-workers-fashion-textile-manufacturing-trump-tariffs/",
    "timestamp": "2025-09-30T19:47:06Z"
  },
  {
    "title": "Ford’s CEO sees Trump policies cutting U.S. EV market in half",
    "description": "Ford Motor Co.’s leader warned of a bleak outlook for electric vehicles as Trump’s policies breathe new life into gas-powered cars. Read now",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/fords-ceo-sees-trump-policies-cutting-u-s-ev-market-in-half",
    "timestamp": "2025-09-30T19:46:32Z"
  },
  {
    "title": "‘Troller-in-chief’: Joe Scarborough fact-checks JD Vance’s divisive false statements",
    "description": "Joe Scarborough dubbed JD Vance the “troller-in-chief” and fact-checked the vice president over his comments on Jimmy Kimmel's suspension and political violence.",
    "link": "https://www.msnbc.com/top-stories/latest/jd-vance-fact-check-political-violence-jimmy-kimmel-rcna234764",
    "timestamp": "2025-09-30T19:46:11Z"
  },
  {
    "title": "Democrats Spooked by Trump’s Plan to Hand Over Weapons-Grade Plutonium to Private Firms",
    "description": "The move goes against decades of the United States' nonproliferation policy, lawmakers argue.",
    "link": "https://gizmodo.com/democrats-spooked-by-trumps-plan-to-hand-over-weapons-grade-plutonium-to-private-firms-2000665766",
    "timestamp": "2025-09-30T19:45:37Z"
  },
  {
    "title": "Ford’s CEO Sees Trump Policies Cutting US EV Market in Half",
    "description": "Ford Motor Co.’s leader warned of a bleak outlook for electric vehicles as President Donald Trump’s policies breathe new life into gas-powered cars.",
    "link": "https://financialpost.com/pmn/business-pmn/fords-ceo-sees-trump-policies-cutting-us-ev-market-in-half",
    "timestamp": "2025-09-30T19:45:13Z"
  },
  {
    "title": "Would a government shutdown impact your investments?",
    "description": "The federal government is hurtling toward a shutdown on Wednesday morning.",
    "link": "https://abcnews.go.com/Business/government-shutdown-impact-investments/story?id=126071977",
    "timestamp": "2025-09-30T19:44:46Z"
  },
  {
    "title": "Birth Rates: Why are Israel's Rising While Numbers Drop in the West?",
    "description": "What is causing this dramatic decline in births throughout the rich, developed world? And why is Israel an outlier?Where did all the babies go? Why has the birth rate dropped so much almost throughout the world today but not in Israel? Report after report in …",
    "link": "https://freerepublic.com/focus/f-news/4343554/posts",
    "timestamp": "2025-09-30T19:44:29Z"
  },
  {
    "title": "Home remodeling costs jump in the second quarter",
    "description": "If it seems like it’s getting more expensive to replace a broken door, kitchen fixtures, or upgrade a major appliance, you’re not wrong.\n\n\n\nThe cost of home repair and remodeling projects is up compared to a year ago and running ahead of inflation overall, ac…",
    "link": "https://apnews.com/article/home-improvement-remodeling-costs-tariffs-housing-market-79211b2a68477edb0f9129dc8ffd3821",
    "timestamp": "2025-09-30T19:44:07Z"
  },
  {
    "title": "Mike Johnson Refuses to Swear in New Dem, Delaying Epstein Files Bid",
    "description": "Republicans are actively trying to delay the release of the Epstein files.House Speaker Mike Johnson was joined by other GOP leadership Tuesday in rejecting bids to swear in Democratic Representative-elect Adelita Grijalva.Grijalva won the special election in…",
    "link": "https://newrepublic.com/post/201145/mike-johnson-swear-in-new-democrat-shutdown-epstein",
    "timestamp": "2025-09-30T19:44:01Z"
  },
  {
    "title": "U.S.-Turkish Relations Have Gotten Duller, Not Better",
    "description": "Erdogan’s visit to Washington showed that the United States and Turkey just don’t need each other as much as they used to.",
    "link": "http://foreignpolicy.com/2025/09/30/turkey-erdogan-trump-syria-russia-democracy/",
    "timestamp": "2025-09-30T19:43:13Z"
  },
  {
    "title": "Hamas Rejects Deal To End Genocide After Learning It Would Require Them To Stop Killing Jews",
    "description": "GAZA — Despite early reports that the Palestinian terrorist organization was open to accepting the terms of President Donald Trump's brokered peace plan, Hamas rejected the deal to end alleged genocide in the region after learning it would require them to sto…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343553/posts",
    "timestamp": "2025-09-30T19:41:11Z"
  },
  {
    "title": "Louisiana governor asks for national guard deployment to New Orleans (The Guardian)",
    "description": "The Guardian:\nLouisiana governor asks for national guard deployment to New Orleans  —  Jeff Landry's request comes as crime trends analyst says New Orleans has had fewest murders since 1970  —  The Donald Trump-supporting Republican governor of Louisiana has …",
    "link": "https://www.memeorandum.com/250930/p112",
    "timestamp": "2025-09-30T19:40:00Z"
  },
  {
    "title": "Democrats Have No Plan To Escape Imminent Schumer-Caused Shutdown",
    "description": "Democrats are on the verge of sparking a government shutdown, but are declining to share their exit plan to bring a politically perilous funding lapse to an end.  Senate Minority Leader Chuck Schumer is expected to lead Democrats in filibuster a clean governm…",
    "link": "https://dailycaller.com/2025/09/30/democrats-escape-plan-schumer-shutdown/",
    "timestamp": "2025-09-30T19:39:38Z"
  },
  {
    "title": "Trump said to be open to talks with Kim 'without preconditions'",
    "description": "United States President Donald Trump remains \"open\" to talking with North Korean leader Kim Jong-un \"without any preconditions,\" although Washington's policy on North Korea has not changed, South Kore...",
    "link": "https://biztoc.com/x/4b994ec32ffe3112",
    "timestamp": "2025-09-30T19:39:35Z"
  },
  {
    "title": "Read the email federal workers are getting hours before a potential government shutdown",
    "description": "Federal workers received an email Tuesday, saying that a looming government shutdown will come with furloughs.",
    "link": "https://www.businessinsider.com/government-shutdown-federal-workers-read-email-furlough-warning-2025-9",
    "timestamp": "2025-09-30T19:39:12Z"
  },
  {
    "title": "Trump posted AI-generated video about 'med beds.' Here's what to know about fictional health care",
    "description": "A since-deleted post shared to Trump's Truth Social account promised a fake cure-all medical device for all citizens.",
    "link": "https://www.snopes.com//news/2025/09/30/medbed-trump-ai-video/",
    "timestamp": "2025-09-30T19:38:00Z"
  },
  {
    "title": "With all-or-nothing Gaza plan, Trump turns tables for Israel",
    "description": "In presenting a Gaza plan as an ultimatum to Hamas, US President Donald Trump has turned the tables to give Israel the advantage diplomatically — and an even freer rein on the ground if a deal fails. The White House on Monday released a 20-point plan that wou…",
    "link": "https://www.digitaljournal.com/world/with-all-or-nothing-gaza-plan-trump-turns-tables-for-israel/article",
    "timestamp": "2025-09-30T19:37:20Z"
  },
  {
    "title": "Trump announces Pfizer deal he says will lower certain drug prices",
    "description": "The Trump administration on Tuesday announced a deal granting Pfizer a three-year reprieve on planned tariffs as the pharmaceutical giant vowed to voluntarily lower the prices of unspecified drugs for US purchase. President Donald Trump, flanked by top health…",
    "link": "https://www.digitaljournal.com/world/trump-announces-pfizer-deal-he-says-will-lower-certain-drug-prices/article",
    "timestamp": "2025-09-30T19:37:20Z"
  },
  {
    "title": "Estonia PM says Russia incursions aim to distract EU from Ukraine: AFP interview",
    "description": "Estonia’s Prime Minister Kristen Michal warned Tuesday that Russia’s recent air incursions were an attempt to distract Europe from helping Ukraine, ahead of a summit with EU leaders. “Putin wants to have us talking about ourselves, not about Ukraine, not abou…",
    "link": "https://www.digitaljournal.com/world/estonia-pm-says-russia-incursions-aim-to-distract-eu-from-ukraine-afp-interview/article",
    "timestamp": "2025-09-30T19:37:20Z"
  },
  {
    "title": "Trump wants a Supreme Court review of his Birthright Citizenship Executive Order. NOW, get to it conservative justice lackeys [Dumbass]",
    "description": "Trump wants a Supreme Court review of his Birthright Citizenship Executive Order. NOW, get to it conservative justice lackeys",
    "link": "https://www.fark.com/comments/13829326/Trump-wants-a-Supreme-Court-review-of-his-Birthright-Citizenship-Executive-Order-NOW-get-to-it-conservative-justice-lackeys",
    "timestamp": "2025-09-30T19:36:21Z"
  },
  {
    "title": "Trump Announces Pfizer Deal He Says Will Lower Certain Drug Prices",
    "description": "The Trump administration on Tuesday announced a deal granting Pfizer a three-year reprieve on planned tariffs as the pharmaceutical giant vowed to voluntarily lower the prices of unspecified drugs for US purchase.",
    "link": "https://www.ibtimes.com/trump-announces-pfizer-deal-he-says-will-lower-certain-drug-prices-3784882",
    "timestamp": "2025-09-30T19:36:07Z"
  },
  {
    "title": "With All-or-nothing Gaza Plan, Trump Turns Tables For Israel",
    "description": "In presenting a Gaza plan as an ultimatum to Hamas, US President Donald Trump has turned the tables to give Israel the advantage diplomatically -- and an even freer rein on the ground if a deal fails.",
    "link": "https://www.ibtimes.com/all-nothing-gaza-plan-trump-turns-tables-israel-3784879",
    "timestamp": "2025-09-30T19:36:06Z"
  },
  {
    "title": "Trump directs generals to defend US from 'war from within'",
    "description": "The president lamented about the lack of applause from the crowd.",
    "link": "https://abcnews.go.com/Politics/trump-directs-generals-defend-us-war/story?id=126087035",
    "timestamp": "2025-09-30T19:35:36Z"
  },
  {
    "title": "Donald Trump: Democrats Are Shutting Government Down; We Want It Open",
    "description": "President Donald Trump put the looming government shutdown squarely on Democrats Tuesday, emphasizing Republicans want the it to remain open. \nThe post Donald Trump: Democrats Are Shutting Government Down; We Want It Open appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/30/donald-trump-democrats-are-shutting-government-down-we-want-it-open/",
    "timestamp": "2025-09-30T19:35:06Z"
  },
  {
    "title": "‘What Is a Two Spirit Individual?!’ Josh Hawley Fumes as He Demands Biden Official Explain ‘Gobbledegook’ Term",
    "description": "Sen. Josh Hawley got into a heated verbal spat with a former Biden official after the congressman demanded to know what a \"two spirit individual\" is\nThe post ‘What Is a Two Spirit Individual?!’ Josh Hawley Fumes as He Demands Biden Official Explain ‘Gobbledeg…",
    "link": "https://www.mediaite.com/media/what-is-a-two-spirit-individual-josh-hawley-fumes-as-he-demands-biden-official-explain-gobbledegook-term/",
    "timestamp": "2025-09-30T19:33:46Z"
  },
  {
    "title": "Chuck Schumer’s bad shutdown bet",
    "description": "Government shutdowns are Kabuki theater. And the next showing is scheduled to begin on Wednesday at 12:01 am. Conventional D.C. wisdom maintains that the side pushing for passing a clean continuing resolution as a stopgap to fund the government is typically t…",
    "link": "https://freerepublic.com/focus/f-news/4343551/posts",
    "timestamp": "2025-09-30T19:32:28Z"
  },
  {
    "title": "Trump hits Canadian lumber producers with additional 10 per cent tariff",
    "description": "U.S. President Donald Trump has issued new tariffs that could add further pressure on Canadian producers of softwood lumber and furniture. A presidential proclamation on Monday evening set out a 10 per cent duty on imports of softwood timber and lumber, along…",
    "link": "https://financialpost.com/pmn/trump-hits-canadian-lumber-producers-with-additional-10-per-cent-tariff-2",
    "timestamp": "2025-09-30T19:32:21Z"
  },
  {
    "title": "How 'woke' went from an expression in Black culture to a conservative criticism",
    "description": "The expression “stay woke” started out as an affirmation for African Americans.  In the past decade it has been used by some Republicans — and some Democrats...",
    "link": "https://www.yahoo.com/news/articles/woke-went-expression-black-culture-193153918.html",
    "timestamp": "2025-09-30T19:31:53Z"
  },
  {
    "title": "Trump Vows to 'Straighten Out' Dangerous Sanctuary Cities 'One by One'",
    "description": "During his address to top military leaders, Trump pledged to \"straighten out\" the country's dangerous sanctuary cities \"one by one.\"\nThe post Trump Vows to ‘Straighten Out’ Dangerous Sanctuary Cities ‘One by One’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/09/30/trump-vows-to-straighten-out-dangerous-sanctuary-cities-one-by-one/",
    "timestamp": "2025-09-30T19:31:47Z"
  },
  {
    "title": "Trump trusts Blair, others don't - could he govern Gaza?",
    "description": "Sir Tony Blair's presence on the Gaza \"Board of Peace\" comes as no surprise but he remains a divisive figure.",
    "link": "https://www.bbc.com/news/articles/c89d5938w3ko",
    "timestamp": "2025-09-30T19:31:18Z"
  },
  {
    "title": "Trump trade chief Greer says 55% China tariffs a 'good status quo'",
    "description": "WASHINGTON: The United States is content to maintain tariffs of around 55 per cent on Chinese imports, but hopes to carve out areas of freer trade, US Trade Representative Jamieson Greer said on Tuesday (Sep",
    "link": "https://www.channelnewsasia.com/world/trump-trade-chief-greer-says-55-china-tariffs-good-status-quo-5378406",
    "timestamp": "2025-09-30T19:30:00Z"
  },
  {
    "title": "Trump targeting of pro-Palestinian campus activists for deportation is unlawful, US judge rules",
    "description": "BOSTON (Reuters) -A U.S. judge ruled on Tuesday that President Donald Trump's administration had acted unconstitutionally by adopting a policy of revoking...",
    "link": "https://www.yahoo.com/news/articles/trump-targeting-pro-palestinian-campus-192938059.html",
    "timestamp": "2025-09-30T19:29:38Z"
  },
  {
    "title": "Release of unredacted military records could shake up New Jersey gubernatorial race",
    "description": "Rachel Maddow breaks down a \"bombshell\" report involving the Trump administration and Rep. Mikie Sherrill that could shake up New Jersey's gubernatorial race.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-jersey-governor-race-mikie-sherrill-military-records-trump-rcna234721",
    "timestamp": "2025-09-30T19:28:57Z"
  },
  {
    "title": "‘Children Died Waiting’ After Trump Freeze of USAID Operations Stranded Medications",
    "description": "An investigation published Tuesday reveals how the Trump administration's cuts to foreign aid—even those that have been quickly restored under public pressure—have proven deadly for children in poverty-stricken nations.The halting of a global supply chain pro…",
    "link": "https://www.commondreams.org/news/usaid-humanitarian-aid-cuts",
    "timestamp": "2025-09-30T19:27:31Z"
  },
  {
    "title": "US ‘must prepare for war’ – Pentagon chief",
    "description": "The US must be ready for war and urgently get more troops and weapons, the secretary of defense has stated Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625664-us-must-prepare-war-pentagon/",
    "timestamp": "2025-09-30T19:26:37Z"
  },
  {
    "title": "Donald Trump Threatens To Withhold Funds From NYC If Zohran Mamdani Becomes Mayor",
    "description": "Donald Trump is in his dictator bag right now. Dropping racist AI videos, giving the military permission to use \"full force\" against American citizens, and now extortion.",
    "link": "https://hiphopwired.com/2853947/donald-trump-withhold-nyc-funds-threat-zohran-mamdani-victory-details/",
    "timestamp": "2025-09-30T19:26:13Z"
  },
  {
    "title": "Pfizer Gets Three-Year Reprieve From Trump Pharma Tariffs (Bloomberg)",
    "description": "Bloomberg:\nPfizer Gets Three-Year Reprieve From Trump Pharma Tariffs  —  Pfizer Inc. Chief Executive Officer Albert Bourla said the company secured a three-year grace period from President Donald Trump's promised tariffs on pharmaceuticals in a deal that woul…",
    "link": "https://www.memeorandum.com/250930/p109",
    "timestamp": "2025-09-30T19:25:01Z"
  }
]