[
  {
    "title": "Pam Bondi 'not going to say anything else' about Epstein due to 'pending investigation'",
    "description": "Attorney General Pam Bondi suggested that the release of files related to Jeffrey Epstein could be delayed after President Donald Trump ordered a new investigation into Democrats connected to the sex offender.During a press conference on Wednesday, Bondi was …",
    "link": "https://www.rawstory.com/pam-bondi-epstein-investigation-not/",
    "timestamp": "2025-11-19T17:29:13Z"
  },
  {
    "title": "Epstein files bill officially passes in Senate, sending it to Trump",
    "description": "A bill forcing the Department of Justice to release its files on sex offender Jeffrey Epstein officially passed both chambers of Congress on Wednesday, sending it to President Donald Trump to be signed into law.\nThe bipartisan bill, which the House approved o…",
    "link": "https://biztoc.com/x/def4757e0bdb512e",
    "timestamp": "2025-11-19T17:28:26Z"
  },
  {
    "title": "Trump: $270B in deals made with US firms today",
    "description": "US President Donald Trump announced $270 billion worth of agreements and sales were being signed between \"dozens of companies\" today, while speaking at the US-Saudi Investment Forum on Wednesday.Trump...",
    "link": "https://biztoc.com/x/cb858b027b44716a",
    "timestamp": "2025-11-19T17:28:17Z"
  },
  {
    "title": "Trump Says Saudi Arabia Will Buy F-35s in MBS Meeting",
    "description": "President Donald Trump said the US would sell F-35 fighter jets to Saudi Arabia, a major concession to Crown Prince Mohammed bin Salman.\nThe sale of F-35s to Saudi Arabia will require years of negotiations and is not certain, with many obstacles remaining bef…",
    "link": "https://biztoc.com/x/4fab033580fab116",
    "timestamp": "2025-11-19T17:28:09Z"
  },
  {
    "title": "Arrests now top 250 in immigration crackdown across North Carolina",
    "description": "Military and immigration agents have converged on Democratic-run cities.",
    "link": "https://www.bostonherald.com/2025/11/19/north-carolina-immigration-crackdown/",
    "timestamp": "2025-11-19T17:26:22Z"
  },
  {
    "title": "VIDEO: Seth Moulton PRETENDS Epstein Files Will Spare Him from Trump Defamation Lawsuit",
    "description": "VIDEOSorry Seth Moulton! But just because President Donald Trump was merely MENTIONED in Epstein Files does NOT mean you are absolved of your more than obvious DEFAMATION of him when you publicly claimed on Morning Joe that he had improper relations with unde…",
    "link": "https://freerepublic.com/focus/f-bloggers/4353398/posts",
    "timestamp": "2025-11-19T17:25:16Z"
  },
  {
    "title": "Trump defends Saudi prince, shrugs off Khashoggi murder",
    "description": "The president rebuked an ABC News reporter for asking Mohammed bin Salman about the death of a Washington Post journalist at the Saudi Consulate in 2018",
    "link": "https://theweek.com/politics/khashoggi-murder-trump-bin-saudi-crown-prince",
    "timestamp": "2025-11-19T17:25:12Z"
  },
  {
    "title": "Mechanical Mikey and the Theater of War",
    "description": "“If you could hear, at every jolt, the blood/Come gurgling from the froth-corrupted lungs . . . . My friend, you would not tell with such high zest / To children ardent for some desperate glory, / The old lie: …\nThe post Mechanical Mikey and the Theater of Wa…",
    "link": "https://www.globalresearch.ca/mechanical-mikey-theater-war/5906292",
    "timestamp": "2025-11-19T17:23:09Z"
  },
  {
    "title": "Have Donald Trump's Half-Understood AI And Crypto Fantasies Made Us All Rich Yet, And Why Not?",
    "description": "There may be two dolls for Christmas, but Donald Trump is gonna ride AI and crypto to the MOON!",
    "link": "https://www.wonkette.com/p/have-donald-trumps-half-understood",
    "timestamp": "2025-11-19T17:22:01Z"
  },
  {
    "title": "Congress Passes Epstein Files Release — Questions Swirl Over Trump’s Next Moves",
    "description": "The measure to release the files passed with near-unanimous support in both the House and Senate.",
    "link": "https://truthout.org/articles/congress-passes-epstein-files-release-questions-swirl-over-trumps-next-moves/",
    "timestamp": "2025-11-19T17:21:32Z"
  },
  {
    "title": "Who is Catherine Lucey, whom Trump called “piggy,” and what does she do?",
    "description": "President Trump snapped at Bloomberg reporter Catherine Lucey, calling her \"quiet, piggy\" after she questioned him about the Jeffrey Epstein files. This incident follows a previous exchange where Trump aggressively criticized Lucey's questioning. A Bloomberg …",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-catherine-lucey-whom-trump-called-piggy-and-what-does-she-do/articleshow/125441426.cms",
    "timestamp": "2025-11-19T17:21:03Z"
  },
  {
    "title": "UK Pulls Access To Intel Since It Doesn’t Want To Be Part Of Trump’s ‘Murder People In Boats’ Program",
    "description": "This won’t matter to Donald Trump or the dozens of administration officials who live to please him. In all likelihood, it will just lead to Trump and his administration smearing one of this nation’s allies for being weak on crime and too supportive of people …",
    "link": "https://www.techdirt.com/2025/11/19/uk-pulls-access-to-intel-since-it-doesnt-want-to-be-part-of-trumps-murder-people-in-boats-program/",
    "timestamp": "2025-11-19T17:20:46Z"
  },
  {
    "title": "Larry Summers resigns from OpenAI board after Epstein emails | Honolulu Star-Advertiser",
    "description": "Former U.S. Treasury Secretary Larry Summers has resigned from the OpenAI board, he said today, several days after Congress released documents that showed Summers shared a close relationship with the late convicted sex offender Jeffrey Epstein.",
    "link": "https://www.staradvertiser.com/2025/11/19/breaking-news/larry-summers-resigns-from-openai-board-after-epstein-emails/",
    "timestamp": "2025-11-19T17:18:33Z"
  },
  {
    "title": "What happened at Trump’s White House meeting with the Saudi crown prince",
    "description": "A jovial President Donald Trump held a warm and friendly meeting with Saudi Crown Prince Mohammad bin Salman at the White House, packed with plenty of handshakes and back pats. He brushed aside questions about Saudi Arabia’s human rights record, praised the p…",
    "link": "https://biztoc.com/x/026157c5e63a809a",
    "timestamp": "2025-11-19T17:17:23Z"
  },
  {
    "title": "Trump: Saudi non-NATO ally status sign of trust",
    "description": "United States President Donald Trump said on Wednesday that naming Saudi Arabia a \"major non-NATO ally\" reflects a clear \"sign of trust\". More to come......",
    "link": "https://biztoc.com/x/6e7f66ded8f3ae51",
    "timestamp": "2025-11-19T17:17:21Z"
  },
  {
    "title": "What to Know About the Secret U.S.-Russia Peace Plan for Ukraine",
    "description": "Steve Witkoff reportedly hashed the details out with Putin’s envoy in Miami last month.",
    "link": "http://foreignpolicy.com/2025/11/19/us-russia-peace-plan-ukraine-witkoff-dmitriev-trump/",
    "timestamp": "2025-11-19T17:16:47Z"
  },
  {
    "title": "Dunkin’ customers outraged after anonymous Facebook user leaks display showing tariff shrinkflation costing you less coffee in your cup",
    "description": "“Just paid $6+ for a large cookie butter cloud latte, with less ice, to not get filled to the top because their new fill policy says they will not do it, on purpose.\"",
    "link": "https://fortune.com/2025/11/19/does-dunkin-donuts-fill-drinks-without-ice-to-top-tariffs-shrinkflation/",
    "timestamp": "2025-11-19T17:16:21Z"
  },
  {
    "title": "Trump’s Climate Policies Could Cause Mass Death of Global Poor, Analysis Warns",
    "description": "As he skips out on this year’s annual climate summit in Brazil to the chagrin of world leaders, a new analysis shows that President Donald Trump’s climate agenda will cause a massive increase in excess deaths in the poor nations least equipped to deal with—an…",
    "link": "https://www.commondreams.org/news/trump-climate-policy-mass-death",
    "timestamp": "2025-11-19T17:15:03Z"
  },
  {
    "title": "'I'm appalled by him': Epstein survivor slams Mike Johnson for 'theatrics' amid big vote",
    "description": "A Republican voter and woman who is a survivor of Jeffrey Epstein's abuse called out House Speaker Mike Johnson (R-LA) over delaying swearing in of Rep. Adelita Grijalva (D-AZ) and the vote for a bill to release the Epstein files. Epstein survivor Haley Robso…",
    "link": "https://www.rawstory.com/i-m-appalled-by-him-epstein-survivor-slams-mike-johnson-over-delaying-epstein-vote/",
    "timestamp": "2025-11-19T17:13:48Z"
  },
  {
    "title": "Fraudster Trump Pardoned Is Going Back to Prison … for Fraud",
    "description": "A ponzi schemer who Donald Trump saved from prison is headed right back to the clink.Eliyahu “Eli” Weinstein was sentenced Friday to 37 years in prison in a New Jersey courtroom, capping the career criminal’s third fraud conviction. Prosecutors argued that We…",
    "link": "https://newrepublic.com/post/203386/donald-trump-pardon-fraud-going-back-prison",
    "timestamp": "2025-11-19T17:13:27Z"
  },
  {
    "title": "Only Liberal Nationalism Can Defeat the Far Right",
    "description": "Convinced that nationalism belongs to the past, liberals have largely abandoned appeals to cultural identity, allowing far-right political entrepreneurs to fill the void. To counter exclusionary nationalism, liberals must craft a unifying creed that restores …",
    "link": "https://www.project-syndicate.org/commentary/liberals-need-stronger-national-vision-by-filip-milacic-2025-11",
    "timestamp": "2025-11-19T17:13:00Z"
  },
  {
    "title": "Lawyer hired by Donald Trump for deeply mysterious reasons has no idea what she’s doing",
    "description": "Third runner-up, Miss Colorado USA Pageant *Bombshell about grand jury: Interim US Attorney Lindsey Halligan took the stand briefly Wednesday, saying only two grand jurors reviewed the final indictment it handed up against former FBI Director James Comey. Com…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/lawyer-hired-by-donald-trump-for-deeply-mysterious-reasons-has-no-idea-what-shes-doing",
    "timestamp": "2025-11-19T17:12:24Z"
  },
  {
    "title": "‘He Was a Known Sex Offender’: CNN’s Pamela Brown Grills Democrat Lawmaker Over Her Texts With Jeffrey Epstein",
    "description": "CNN's Pamela Brown pressed Stacey Plaskett to explain her text exchanges with Jeffrey Epstein following the lawmaker narrowly escaping being censured.\nThe post ‘He Was a Known Sex Offender’: CNN’s Pamela Brown Grills Democrat Lawmaker Over Her Texts With Jeff…",
    "link": "https://www.mediaite.com/media/tv/he-was-a-known-sex-offender-cnns-pamela-brown-grills-democrat-lawmaker-over-her-texts-with-jeffrey-epstein/",
    "timestamp": "2025-11-19T17:11:47Z"
  },
  {
    "title": "How Trump Lost Control of the Epstein Spin Cycle",
    "description": "Wired: “For almost a decade, President Donald Trump has managed to control the conspiracy theory spin around disgraced financier and registered sex offender Jeffrey Epstein. The conspiracy theories benefited him; they were one of the factors buoying him to of…",
    "link": "https://politicalwire.com/2025/11/19/how-trump-lost-control-of-the-epstein-spin-cycle/",
    "timestamp": "2025-11-19T17:10:45Z"
  },
  {
    "title": "Elon Musk's xAI partners with Saudi Arabia-backed Humain to build 500 MW Data Center",
    "description": "Elon Musk’s AI startup xAI is teaming up with Saudi Arabia’s state-backed Humain to build a massive 500 MW AI data center powered by Nvidia chips. Announced at a US–Saudi investment forum, the project is one of the kingdom’s biggest AI infrastructure moves",
    "link": "https://www.livemint.com/companies/news/elon-musk-announces-500-mw-ai-data-center-in-saudi-arabia-as-xai-partners-with-humain-11763571169052.html",
    "timestamp": "2025-11-19T17:10:17Z"
  },
  {
    "title": "Crypto exchange Kraken confidentially files for US IPO",
    "description": "(Reuters) -Kraken, one of the world's largest cryptocurrency exchanges, said on Wednesday it has confidentially filed for an initial public offering in the...",
    "link": "https://finance.yahoo.com/news/crypto-exchange-kraken-confidentially-files-171011286.html",
    "timestamp": "2025-11-19T17:10:11Z"
  },
  {
    "title": "Watch Live: Donald Trump Speaks at U.S.-Saudi Investment Forum",
    "description": "President Donald Trump speaks at the U.S.-Saudi Investment Forum on Wednesday, November 19.\nThe post Watch Live: Donald Trump Speaks at U.S.-Saudi Investment Forum appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/11/19/watch-live-donald-trump-speaks-at-u-s-saudi-investment-forum/",
    "timestamp": "2025-11-19T17:10:06Z"
  },
  {
    "title": "Trans Activist Displays Complete Lack Of Biology Knowledge At School Board Meeting",
    "description": "A self-described mother of “two transgender sons” told a Colorado School board on Nov. 11 that banning biological men from women’s sports was discrimination.",
    "link": "https://dailycaller.com/2025/11/19/left-wing-activist-lack-biology-knowledge-school-board-meeting/",
    "timestamp": "2025-11-19T17:09:52Z"
  },
  {
    "title": "I Would Never Meow For Anyone / Meow Meow Trend",
    "description": "I Would Never Meow For Anyone or the Meow Meow Trend is a TikTok trend set to the song \"Montagem Miau\" by Lenar where a person or character claims they would never \"meow\" for someone and is then convinced otherwise, followed by them lip dubbing to meowing sou…",
    "link": "https://knowyourmeme.com/memes/i-would-never-meow-for-anyone-meow-meow-trend",
    "timestamp": "2025-11-19T17:09:00Z"
  },
  {
    "title": "Secret Tape That Could Spin Trump Into Another Cover-Up Scandal",
    "description": "The White House is facing calls to release a “shocking and disturbing” phone call between Donald Trump and the Saudi Crown Prince at the centre of the...",
    "link": "https://www.thedailybeast.com/secret-tape-that-could-spin-trump-into-another-cover-up-scandal/",
    "timestamp": "2025-11-19T17:08:12Z"
  },
  {
    "title": "COP30 dragged into clash over gender language",
    "description": "A row over the definition of gender risks complicating the outcome of COP30 climate talks in Brazil, after six governments moved to attach their own interpretations as footnotes to a key text. Negotiators say the effort — by Paraguay, Argentina, Iran, Indones…",
    "link": "https://www.digitaljournal.com/world/cop30-dragged-into-clash-over-gender-language/article",
    "timestamp": "2025-11-19T17:07:20Z"
  },
  {
    "title": "Mystery flight fuels fears of 'agenda to cleanse' Palestinians",
    "description": "The mystery surrounding a plane that arrived in South Africa carrying more than 150 Palestinians deepened Wednesday after the company at the center of the saga responded to media coverage",
    "link": "https://www.nbcnews.com/world/middle-east/palestinians-flight-south-africa-israel-gaza-ethnic-cleansing-al-majd-rcna244561",
    "timestamp": "2025-11-19T17:07:19Z"
  },
  {
    "title": "Treasury Sec Flails When Asked If Trump’s Foreign Investments Are Real",
    "description": "Treasury Secretary Scott Bessent struggled to sell President Donald Trump’s outrageous claims about how much money the United States is making from his trade deals.During an interview on Fox News Tuesday night, host Brett Baier asked Bessent how much money Tr…",
    "link": "https://newrepublic.com/post/203381/treasury-secretary-donald-trump-foreign-investments-real",
    "timestamp": "2025-11-19T17:07:13Z"
  },
  {
    "title": "World Map Shows Where US Has Sold F-35 Fighter Jets",
    "description": "President Donald Trump has announced he will greenlight the sale of advanced F‑35 stealth fighter jets to Saudi Arabia, signaling a major expansion of the U.S.’s global fighter export program.\n“We’ll be selling them F‑35s,” Trump told reporters at the White H…",
    "link": "https://biztoc.com/x/e44c9dd27e485a56",
    "timestamp": "2025-11-19T17:06:34Z"
  },
  {
    "title": "Congress passes bill to force release of Epstein files",
    "description": "The Justice Department will release all files from its Jeffrey Epstein sex-trafficking investigation",
    "link": "https://theweek.com/politics/house-approves-epstein-files-bill",
    "timestamp": "2025-11-19T17:06:27Z"
  },
  {
    "title": "This triple Trump voter has finally had enough. You need to hear him",
    "description": "“I’ve had enough,” Adam from Michigan told me in a call to my SiriusXM show last Friday, after identifying as someone who voted for Donald Trump three times.He plans to vote “against him, up and down the ballot,” next year.He said it’s not just him — it’s his…",
    "link": "https://www.rawstory.com/raw-investigates/trump-voters-2674305807/",
    "timestamp": "2025-11-19T17:05:46Z"
  },
  {
    "title": "Trump Administration’s Plan to Dismantle Department of Education Meets Backlash",
    "description": "Agreements with other departments will transfer many of the Education Department’s responsibilities to those agencies.",
    "link": "https://www.newsfromthestates.com/article/trump-administration-unveils-plan-try-dismantle-department-education",
    "timestamp": "2025-11-19T17:05:20Z"
  },
  {
    "title": "Republicans feud over 'Arctic Frost' accountability measure, but critics offer no clear alternative",
    "description": "A controversial provision allowing senators to sue for $500,000 over subpoenaed phone records may be withdrawn from the government funding bill.",
    "link": "https://www.foxnews.com/politics/defense-senators-ability-sue-over-arctic-frost-subpoenas",
    "timestamp": "2025-11-19T17:04:37Z"
  },
  {
    "title": "Judge pushes for resolution in lawsuit over legal access at Everglades detention center",
    "description": "The lawsuit challenges whether detainees are getting adequate legal access.",
    "link": "https://www.bostonherald.com/2025/11/19/florida-immigration-detention-center-resolution/",
    "timestamp": "2025-11-19T17:02:55Z"
  },
  {
    "title": "Analysis: Trump keeps lying while accusing others of lying | CNN Politics",
    "description": "President Donald Trump tells a lot of lies. Trump also regularly accuses others of lying.",
    "link": "https://www.cnn.com/2025/11/19/politics/donald-trump-lies-false-claims",
    "timestamp": "2025-11-19T17:02:33Z"
  },
  {
    "title": "DOJ Lawyers Admit Two Shocking Details in Comey Case",
    "description": "The Trump administration’s attempt to prosecute former FBI Director James Comey hit two major snags on Wednesday. First, interim U.S. attorney for the Eastern District of Virginia Lindsey Halligan, who brought the indictment, admitted the entire grand jury di…",
    "link": "https://newrepublic.com/post/203388/doj-lawyers-admit-two-shocking-details-comey-case",
    "timestamp": "2025-11-19T17:01:54Z"
  },
  {
    "title": "Ex Treasury boss Summers resigns from OpenAI after named in Epstein files",
    "description": "Harvard University, where Summers is a professor, is also set to open a probe into the allegations against him.",
    "link": "https://www.aljazeera.com/economy/2025/11/19/ex-treasury-boss-summers-resigns-from-openai-after-named-in-epstein-files",
    "timestamp": "2025-11-19T17:01:08Z"
  },
  {
    "title": "'A Poison Pill For Britain's Financial Sector': Nigel Farage Slams Bank of England Stablecoin Ownership Cap",
    "description": "The Bank of England is sabotaging Britain’s position as a global financial leader with proposed caps on individual stablecoin holdings, Reform UK leader...",
    "link": "https://finance.yahoo.com/news/poison-pill-britains-financial-sector-170106769.html",
    "timestamp": "2025-11-19T17:01:06Z"
  },
  {
    "title": "“The Beast in Me” is the perfect story for a predator’s era",
    "description": "This vicious thriller shows how far the wealthy will go to satisfy their bloodlust and bring it out in others.",
    "link": "https://www.salon.com/2025/11/19/the-beast-in-me-is-the-perfect-story-for-a-predators-era/",
    "timestamp": "2025-11-19T17:00:47Z"
  },
  {
    "title": "97% detained in Chicago had no criminal record...",
    "description": "The unprecedented immigration crackdown has entered its third month with a growing number of residents fighting back against the seemingly indiscrimate and heacy handed immigration enforcement",
    "link": "https://www.themirror.com/news/us-news/ice-chicago-stats-criminal-record-1514086",
    "timestamp": "2025-11-19T17:00:15Z"
  },
  {
    "title": "Musk and Huang join Trump’s exclusive Saudi AI summit",
    "description": "Two of the most influential figures in technology are set to take center stage at a major investment forum that brings together American business leaders and Saudi Arabian officials. Tesla CEO Elon Musk and Nvidia CEO Jensen Huang will participate in a discus…",
    "link": "https://rollingout.com/2025/11/19/musk-huang-join-trumps-saudi-ai-summit/",
    "timestamp": "2025-11-19T17:00:01Z"
  },
  {
    "title": "Was Covid Always a CIA Plot?",
    "description": "According to newly released emails, the United States Intelligence Community, led by the CIA and the Office of the Director of National Intelligence, held regular meetings with Dr. Ralph Baric, one of America’s leading coronavirus experts, since at least 2015…",
    "link": "https://www.activistpost.com/was-covid-always-a-cia-plot/",
    "timestamp": "2025-11-19T17:00:00Z"
  },
  {
    "title": "Here’s Why Trump Respects ‘South Park,’ According to This Comedian",
    "description": "By\n Matt Solomon\n Published: November 19th, 2025",
    "link": "https://www.cracked.com/article_49199_heres-why-trump-respects-south-park-according-to-this-comedian.html",
    "timestamp": "2025-11-19T17:00:00Z"
  },
  {
    "title": "America Is Becoming More Like Saudi Arabia",
    "description": "Yesterday’s meeting between Donald Trump and MBS was a grim update on the political changes in the two leaders’ respective countries.",
    "link": "https://www.theatlantic.com/ideas/2025/11/trump-mbs-saudi-arabia-khashoggi/684978/",
    "timestamp": "2025-11-19T17:00:00Z"
  },
  {
    "title": "China, Netherlands move to resolve Nexperia chip row",
    "description": "The Netherlands said Wednesday it had suspended its proposed takeover of Chinese-owned chip maker Nexperia in a sign of “good will”, a move China welcomed as a positive “first step”.  The two sides are moving to resolve a dispute that erupted in September whe…",
    "link": "https://www.digitaljournal.com/world/china-netherlands-move-to-resolve-nexperia-chip-row/article",
    "timestamp": "2025-11-19T16:57:33Z"
  },
  {
    "title": "Congress Votes To Open Up the Epstein Files",
    "description": "There probably is no “client list,” but the files could help answer some pressing questions—and open the door to more revelations.",
    "link": "https://reason.com/2025/11/19/congress-votes-to-open-up-the-epstein-files/",
    "timestamp": "2025-11-19T16:57:17Z"
  },
  {
    "title": "Biden's decision to run in 2024 'erases virtually everything' he did as president, ABC anchor says",
    "description": "ABC News host Jonathan Karl said that former President Biden's decision to run again virtually erased his presidency, and lamented that no formal meeting occurred to discuss the choice.",
    "link": "https://www.foxnews.com/media/bidens-decision-run-2024-erases-virtually-everything-he-did-president-abc-anchor-says",
    "timestamp": "2025-11-19T16:55:14Z"
  },
  {
    "title": "Donald Trump & Greg Abbott’s Racially Gerrymandered Congressional Maps Struck Down In Texas Federal Court",
    "description": "A three-judge panel, which features a judge he appointed, said nah to those maps, calling them an illegal racial gerrymander, delivering a massive blow to the GOP's cheating plans.",
    "link": "https://hiphopwired.com/2914437/donald-trump-greg-abbott-racially-gerrymandered-maps-federal-judge-reactions/",
    "timestamp": "2025-11-19T16:55:11Z"
  },
  {
    "title": "'Backfire': Analysts highlight 'threat' that could force DOJ to comply with Epstein vote",
    "description": "Congress overwhelmingly passed a measure to compel the Department of Justice to release its investigation files on Jeffrey Epstein, but lawmakers have few tools to enforce their legislation.The House and Senate passed a bill Tuesday calling on Attorney Genera…",
    "link": "https://www.rawstory.com/epstein-files-subpoena-pam-bondi/",
    "timestamp": "2025-11-19T16:55:06Z"
  },
  {
    "title": "House And Senate Clear Epstein Files Bill; Trump Expected To Sign",
    "description": "Congress has cleared the final hurdle to force the release of long-sealed Jeffrey Epstein files, sending the bipartisan bill to President Donald Trump’s desk after unanimous Senate approval. \nEpstein bill heading to Trump's desk after clearing final hurdle in…",
    "link": "https://biztoc.com/x/75aac132c65bda02",
    "timestamp": "2025-11-19T16:54:30Z"
  },
  {
    "title": "Watch live: Trump speaks at U.S.-Saudi Investment Forum",
    "description": "Trump's appearance at the Kennedy Center comes a day after he hosted Crown Prince Mohammed bin Salman of Saudi Arabia at the White House.",
    "link": "https://www.cnbc.com/2025/11/19/watch-live-trump-us-saudi-investment-forum-mbs.html",
    "timestamp": "2025-11-19T16:53:24Z"
  },
  {
    "title": "‘The View’s Sunny Hostin Doubts Trump Will Release Epstein Files Without Redactions: “It’s A Corrupt Presidency”",
    "description": "\"It’s really just a monarchy.\"",
    "link": "https://decider.com/2025/11/19/the-view-sunny-hostin-trump-epstein-files-redactions-corrupt/",
    "timestamp": "2025-11-19T16:52:44Z"
  },
  {
    "title": "White House settles GOAT debate with message after Ronaldo visit",
    "description": "Cristiano Ronaldo’s visit to the White House on Tuesday reignited one of football’s most familiar debates, after an official post from the White House’s X account referred to the Portuguese star and Donald Trump as \"Two GOATs.\"",
    "link": "https://www.101greatgoals.com/football/white-house-settles-goat-debate-ronaldo-visit/",
    "timestamp": "2025-11-19T16:51:27Z"
  },
  {
    "title": "The Education Department is dismantling. Here’s what that means",
    "description": "Trump says the department has been overrun by liberal thinking.",
    "link": "https://www.bostonherald.com/2025/11/19/education-department-dismantling/",
    "timestamp": "2025-11-19T16:51:21Z"
  },
  {
    "title": "Kamala Harris returns to campaign trail in Trump country to back ‘AOC of Tennessee’",
    "description": "Former Vice President Kamala Harris returned to the campaign trail for first time since her 2024 election loss, supporting Tennessee congressional candidate Aftyn Behn in a red district.",
    "link": "https://www.foxnews.com/politics/kamala-harris-returns-campaign-trail-trump-country-back-aoc-tennessee",
    "timestamp": "2025-11-19T16:50:17Z"
  },
  {
    "title": "Trump Migrant Crackdown Spurs New Wrongful Deportation Claims (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nTrump Migrant Crackdown Spurs New Wrongful Deportation Claims  —  President Donald Trump's administration continues to face claims that US officials are wrongfully deporting migrants in violation of court orders and other legal protec…",
    "link": "https://www.memeorandum.com/251119/p67",
    "timestamp": "2025-11-19T16:50:00Z"
  },
  {
    "title": "House Advances Rep. Gill Legislation to Expedite Deportations",
    "description": "The House is one step closer to considering Rep. Brandon Gill’s, R-Texas, major legislative overhaul of how illegal aliens are deported from the United States.... Read More\nThe post House Advances Rep. Gill Legislation to Expedite Deportations appeared first …",
    "link": "https://www.dailysignal.com/2025/11/19/house-advances-rep-gill-legislation-to-expedite-deportations/",
    "timestamp": "2025-11-19T16:50:00Z"
  },
  {
    "title": "Democrat Taunts ‘Nepo’ MAGA Colleague With Brutal 6-Word Jab",
    "description": "Rep. Eric Swalwell (D-Calif.) followed his dig at Rep. Brandon Gill (R-Texas) with a warning for two Trump officials.",
    "link": "https://www.huffpost.com/entry/eric-swalwell-brandon-gill-immigration-nepo-ice_n_691ddd6fe4b073def3ef407c",
    "timestamp": "2025-11-19T16:49:55Z"
  },
  {
    "title": "Billionaire MAGA donor Bill Ackman roasted online after offering dating advice to LGBTQ+ people",
    "description": "Billionaire MAGA donor Bill Ackman has been mocked after offering dating advice to LGBTQ+ people.  The hedge fund manager, who endorsed Donald Trump in the 2024 presidential election, took to X/Twitter on Saturday (15 November) to share his words of wisdom, a…",
    "link": "https://www.thepinknews.com/2025/11/19/billionaire-maga-donor-bill-ackman-roasted-online-after-offering-dating-advice-to-lgbtq-people/",
    "timestamp": "2025-11-19T16:49:14Z"
  },
  {
    "title": "Comey’s lawyers say prosecution pushed by Trump is vindictive and case should be tossed",
    "description": "In trying to have the case dismissed, Comey's lawyers are seeking to convince a judge that the prosecution is vindictive and rooted in Trump's hatred of Comey.",
    "link": "https://www.pbs.org/newshour/politics/comeys-lawyers-say-prosecution-pushed-by-trump-is-vindictive-and-case-should-be-tossed",
    "timestamp": "2025-11-19T16:48:00Z"
  },
  {
    "title": "Trump welcomes Saudi crown prince’s diplomatic comeback",
    "description": "Saudi Crown Prince Mohammed bin Salman told US President Donald Trump that he wants Riyadh to join the Abraham Accords, the framework for the normalisation of ties between Israel and several Muslim states, but also wants to secure a “clear path” to Palestinia…",
    "link": "https://www.bbc.co.uk/programmes/w172zssfmm9xyy6",
    "timestamp": "2025-11-19T16:47:00Z"
  },
  {
    "title": "'People are furious': Experts flag evidence the GOP is 'losing faith' in Trump",
    "description": "Experts are warning that Republicans are \"losing faith\" in President Donald Trump as his approval rating drops to its lowest during his second term. Trump's handling of the economy and affordability, combined with his response to the Epstein file release, has…",
    "link": "https://www.rawstory.com/donald-trump-gop-2674309586/",
    "timestamp": "2025-11-19T16:46:59Z"
  },
  {
    "title": "Judge pushes for resolution in lawsuit over legal access at 'Alligator Alcatraz'",
    "description": "A federal judge in Florida is pushing for a resolution in a lawsuit over detainees' access to attorneys at an immigration detention center in the Everglades",
    "link": "https://abcnews.go.com/US/wireStory/judge-pushes-resolution-lawsuit-legal-access-alligator-alcatraz-127673192",
    "timestamp": "2025-11-19T16:45:55Z"
  },
  {
    "title": "I’m a Celeb salary ‘leak’ reveals how much the stars are getting paid",
    "description": "What this year’s campmates will be taking home following ITV jungle appearance",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/im-a-celeb-2025-salaries-paid-how-much-b2868431.html",
    "timestamp": "2025-11-19T16:45:42Z"
  },
  {
    "title": "Ex-Clinton Cabinet Member Larry Summers Resigns From OpenAI Board Over Epstein Scandal",
    "description": "Former Clinton-era Treasury Secretary Larry Summers resigned from the OpenAI board after emails showed his association with sex offender Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/11/19/larry-summers-resigns-openai-board-epstein-files/",
    "timestamp": "2025-11-19T16:44:23Z"
  },
  {
    "title": "Are the Abraham Accords Still a Thing? | Opinion",
    "description": "Saudi Arabian Crown Prince Mohammed bin Salman was in Washington, D.C. yesterday for a high-profile White House visit. President Donald Trump rolled out the red carpet for \"MBS,\" as he is commonly known, much as MBS himself did for Trump when the commander-in…",
    "link": "https://biztoc.com/x/09b8e0d1aa1ca138",
    "timestamp": "2025-11-19T16:43:54Z"
  },
  {
    "title": "Beware of these political land mines, President Trump",
    "description": "'Why would we want to increase the Chinese student population from the current near 300,000 to 600,000?'",
    "link": "https://www.wnd.com/2025/11/beware-these-political-land-mines-president-trump/",
    "timestamp": "2025-11-19T16:42:34Z"
  },
  {
    "title": "Trump nominates new CFPB director, but White House says agency is still closing",
    "description": "President Trump has nominated Stuart Levenbach as the next director of the Consumer Financial Protection Bureau",
    "link": "https://www.wsbtv.com/news/business/trump-nominates/P3GUGDULNE7CBKBVO6YLO4HYFA/",
    "timestamp": "2025-11-19T16:42:11Z"
  },
  {
    "title": "‘Up Like a Rocket!’ CNN Data Guru Finds Trump’s Foreign Policy Rating Leaves Obama and Bush in the Dust",
    "description": "Bush stood at 36% and Obama scored 37% at this stage of their second terms, leaving Trump “the pack” leader among 21st-century two-term presidents.\nThe post ‘Up Like a Rocket!’ CNN Data Guru Finds Trump’s Foreign Policy Rating Leaves Obama and Bush in the Dus…",
    "link": "https://www.mediaite.com/media/tv/up-like-a-rocket-cnn-data-guru-finds-trumps-foreign-policy-rating-leaves-obama-and-bush-in-the-dust/",
    "timestamp": "2025-11-19T16:41:38Z"
  },
  {
    "title": "Larry Summers Announces He Is Resigning From Board As Epstein Fallout Continues",
    "description": "The documents released by lawmakers revealed the former U.S. Treasury secretary regularly exchanged emails with the late sexual predator.",
    "link": "https://www.huffpost.com/entry/larry-summers-resigns-from-openai-board_n_691ddc33e4b0b763ab8cfaf5",
    "timestamp": "2025-11-19T16:41:36Z"
  },
  {
    "title": "New FIFA rankings set top-seed teams in World Cup tournament draw with Germany edging out Croatia",
    "description": "The top-seeded teams for the Dec. 5 World Cup tournament draw, including Germany but not Croatia, were set Wednesday when FIFA published new rankings the day after four continents completed qualifying. Co-hosts the United States, Canada and Mexico will be joi…",
    "link": "https://sports.yahoo.com/article/fifa-rankings-set-top-seed-163918976.html",
    "timestamp": "2025-11-19T16:39:18Z"
  },
  {
    "title": "Justice Department says full grand jury in Comey case didn’t review copy of final indictment",
    "description": "Comey's lawyers said that lapse was grounds for dismissal of the case.",
    "link": "https://www.bostonherald.com/2025/11/19/justice-department-comey-arguments/",
    "timestamp": "2025-11-19T16:39:03Z"
  },
  {
    "title": "Epstein Effect Comes for Trump as His Approval Rating Hits Record Low",
    "description": "Donald Trump’s approval rating is at an all-time low for his second term, and the president has his old pal Jeffrey Epstein to thank—and those pesky grocery prices. Only 38 percent of Americans approve of Trump’s performance in office, according to a Reuters/…",
    "link": "https://newrepublic.com/post/203387/donald-trump-poll-approval-epstein-economy",
    "timestamp": "2025-11-19T16:38:24Z"
  },
  {
    "title": "Sydney Sweeney’s Transformation Into a Right-Wing Meme Was Not a ‘Total Aesthetic Victory’",
    "description": "X users have made her the face of bigotry on the platform.",
    "link": "https://gizmodo.com/sydney-sweeneys-transformation-into-a-right-wing-meme-was-not-a-total-aesthetic-victory-2000685483",
    "timestamp": "2025-11-19T16:35:42Z"
  },
  {
    "title": "GOP Rep. Burchett: 'Democrats in Congress Will Have to Find Another Shiny Object Down the Road to Kick' After Epstein",
    "description": "During Tuesday's broadcast of Fox News Channel's \"The Ingraham Angle,\" Rep. Tim Burchett (R-TN) blasted the media and expressed his skepticism that the legislation passed by Congress earlier in the day on Jeffrey Epstein would have a meaningful impact on Pres…",
    "link": "https://www.breitbart.com/clips/2025/11/19/gop-rep-burchett-democrats-in-congress-will-have-to-find-another-shiny-object-down-the-road-to-kick-after-epstein/",
    "timestamp": "2025-11-19T16:32:22Z"
  },
  {
    "title": "\"What Has Become Of Us\": Rosie O'Donnell May Have Just Handed Trump A Golden Defamation Lawsuit",
    "description": "\"What Has Become Of Us\": Rosie O'Donnell May Have Just Handed Trump A Golden Defamation Lawsuit\n \nAuthored by Jonthan Turley,\nI have previously expressed skepticism over some defamation cases against the media brought by President Donald Trump under existing …",
    "link": "https://biztoc.com/x/3df3077dfaad2ee0",
    "timestamp": "2025-11-19T16:32:02Z"
  },
  {
    "title": "Jensen Huang is the talk of the town — Trump posts three quotes from the Nvidia CEO just before earnings",
    "description": "President Trump highlighted Nvidia founder Jensen Huang's statements crediting his policies for the US-based manufacturing of advanced AI chips. As Nvidia's earnings approach, investors anticipate answers regarding the substantial AI spending and its funding.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jensen-huang-is-the-talk-of-the-town-trump-posts-three-quotes-from-the-nvidia-ceo-just-before-earnings/articleshow/125441736.cms",
    "timestamp": "2025-11-19T16:30:38Z"
  },
  {
    "title": "US Holding Off On Bitcoin Reserve—Waiting For The World To Move First, Crypto Expert Says",
    "description": "According to industry voices, the US is likely to hold off buying Bitcoin until others move first. That view came from crypto entrepreneur Mike Alfred, who said the government will step in only “when there is enough pressure externally.” Related Reading: Bitc…",
    "link": "https://bitcoinist.com/us-holding-off-on-bitcoin-reserve-waiting-for-the-world-to-move-first-crypto-expert-says/",
    "timestamp": "2025-11-19T16:30:35Z"
  },
  {
    "title": "FACT FOCUS: There’s no proof each strike on alleged drug boats saves 25,000 lives, as Trump claims",
    "description": "The numbers to support Trump’s claim don’t add up, and sometimes don’t exist.",
    "link": "https://www.bostonherald.com/2025/11/19/trump-boat-strikes-fact-check/",
    "timestamp": "2025-11-19T16:29:36Z"
  },
  {
    "title": "The UN Embraces Colonialism: Unpacking the Security Council’s mandate for the U.S. colonial administration of Gaza",
    "description": "The Security Council's backing of the Trump plan for Gaza ignores international law, punishes the Palestinians, and rewards those responsible for genocide.",
    "link": "https://mondoweiss.net/2025/11/the-un-embraces-colonialism-unpacking-the-security-councils-mandate-for-the-u-s-colonial-administration-of-gaza/",
    "timestamp": "2025-11-19T16:27:31Z"
  },
  {
    "title": "Nigeria’s democracy not under threat, Wike replies Turaki",
    "description": "FCT Minister Nyesom Wike refutes claims that Nigeria’s democracy is under threat, blaming the PDP’s internal crisis for calls for US intervention.\n\nRead More: https://punchng.com/nigerias-democracy-not-under-threat-wike-replies-turaki/",
    "link": "https://punchng.com/nigerias-democracy-not-under-threat-wike-replies-turaki/",
    "timestamp": "2025-11-19T16:25:52Z"
  },
  {
    "title": "“Golden Opportunity for a Defamation Action”: Rosie O’Donnell’s Anti-Trump Rant “May Have Crossed the Line”",
    "description": "Onetime popular entertainer Rosie O’Donnell has become a one-person attack machine against President Donald Trump these days. She “seems to spend much of her days in a constant rave about Trump, Republicans, and the demise of the United States from her new ho…",
    "link": "https://freerepublic.com/focus/f-bloggers/4353389/posts",
    "timestamp": "2025-11-19T16:25:50Z"
  },
  {
    "title": "AMD, Cisco and Saudi's Humain launch AI joint venture, land first major customer",
    "description": "The yet-to-be-named joint venture will kick off with a 100-megawatt data center project in Saudi Arabia - the computing capacity of which Humain has contracted to supply generative video startup Luma AI, according to Humain CEO Tareq Amin. The size of the pro…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/amd-cisco-and-saudis-humain-launch-ai-joint-venture-land-first-major-customer/articleshow/125441849.cms",
    "timestamp": "2025-11-19T16:25:36Z"
  },
  {
    "title": "Epstein files bill officially passes in Senate, sending it to Trump",
    "description": "The Epstein files bill got overwhelming support in the House and Senate, with only one lawmaker, Republican Rep. Clay Higgins of Louisiana, voting against it.",
    "link": "https://www.cnbc.com/2025/11/19/epstein-files-trump-bill-congress.html",
    "timestamp": "2025-11-19T16:23:15Z"
  },
  {
    "title": "Trump tariff hikes hit US August imports, delayed data shows",
    "description": "President Donald Trump’s tariff hikes on dozens of trading partners hit US imports in August, according to a Wednesday report delayed by a record government shutdown that ended last week. The 43-day stoppage had paused publications of federal economic data ra…",
    "link": "https://www.digitaljournal.com/world/trump-tariff-hikes-hit-us-august-imports-delayed-data-shows/article",
    "timestamp": "2025-11-19T16:22:32Z"
  },
  {
    "title": "Federal Judges Rule Texas Can't Use New Map In Midterm Elections",
    "description": "This is a really big deal, since it means Texas may not benefit from their lopsided map -- and California's new map will remain. The judges issued a blistering opinion that attacked the incompetence of the plaintiffs lawyers. What was really interesting about…",
    "link": "https://crooksandliars.com/2025/11/federal-judges-rule-texas-cant-use-new-map",
    "timestamp": "2025-11-19T16:22:31Z"
  },
  {
    "title": "WH Response To Trump's 'Quiet, Piggy' Remark Somehow Makes It Worse",
    "description": "The White House responded to reports that Donald J. Trump pointed a finger at Bloomberg reporter Catherine Lucey and said, \"Quiet. Quiet, piggy\" on Air Force One on his way to his gaudy Mar-a-Lago resort in Florida. The reporter asked about the Epstein Files,…",
    "link": "https://crooksandliars.com/2025/11/wh-responds-trumps-piggy-remark-reporter",
    "timestamp": "2025-11-19T16:22:31Z"
  }
]