[
  {
    "title": "Senate Pulls All-Nighter on Trump Tax Bill With GOP Divided",
    "description": "Senate Republican leaders continue to scrounge for votes to pass Donald Trump’s $3.3 trillion tax and spending bill as lingering intraparty fights threaten to upend the legislative centerpiece of the president’s domestic agenda.\nSenators voted through Monday …",
    "link": "https://biztoc.com/x/3581a64f9d5932dc",
    "timestamp": "2025-07-01T14:33:35Z"
  },
  {
    "title": "Trump says migrants would need to know 'how to run away from an alligator' to flee Florida facility",
    "description": "Donald Trump is visiting a new immigration detention center in Florida. The facility is nicknamed \"Alligator Alcatraz.\" It is located in a remote area of the Everglades. The site is intended to deter illegal immigration. Protests and support rallies are happe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-migrants-would-need-to-know-how-to-run-away-from-an-alligator-to-flee-florida-facility/articleshow/122186787.cms",
    "timestamp": "2025-07-01T14:33:10Z"
  },
  {
    "title": "Trump says will 'take a look' at deporting Musk",
    "description": "WASHINGTON: United States President Donald Trump said on Tuesday (Jul 1) he could consider deporting Elon Musk, after the South African-born billionaire slammed his flagship spending Bill. Trump also said the Department of Government Efficiency (DOGE), which …",
    "link": "https://www.channelnewsasia.com/world/trump-look-deporting-elon-musk-doge-subsidies-tesla-5214391",
    "timestamp": "2025-07-01T14:32:16Z"
  },
  {
    "title": "Musk-Trump Feud Timeline: Trump Goes After Tesla CEO Over Bill Criticism",
    "description": "Musk and Trump engaged in yet another explosive back-and-forth this week.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/01/musk-trump-feud-timeline-trump-goes-after-tesla-ceo-over-bill-criticism/",
    "timestamp": "2025-07-01T14:32:06Z"
  },
  {
    "title": "Happy 4th! Fidel Castro's Grandson Films Vulgar American Flag Video Mocking Communist Hardship",
    "description": "Sandro Castro, grandson of late Cuban dictator Fidel Castro, published a bizarre video on his social media accounts on Sunday in which he, with an American flag in the background, appears to ridicule the endless blackouts that the Castro regime forces Cubans …",
    "link": "https://www.breitbart.com/latin-america/2025/07/01/happy-4th-fidel-castros-grandson-films-vulgar-american-flag-video-mocking-communist-hardship/",
    "timestamp": "2025-07-01T14:31:49Z"
  },
  {
    "title": "CNN’s Harry Enten Says Trump Is ‘More Beloved’ Among Republicans Than Any Other GOP President In Modern Times",
    "description": "CNN's Harry Enten said on Tuesday that President Donald Trump is \"more beloved\" among his party's voters than any other past Republican presidents.",
    "link": "https://dailycaller.com/2025/07/01/cnn-harry-enten-trump-gop-presidents/",
    "timestamp": "2025-07-01T14:31:39Z"
  },
  {
    "title": "Democrat Colin Allred is running again for US Senate in Texas",
    "description": "Democrat Colin Allred is running again for US Senate in Texaskristv.com",
    "link": "https://www.kristv.com/media/v/content/8d219b9bd7adceec7c82509693561e12",
    "timestamp": "2025-07-01T14:30:36Z"
  },
  {
    "title": "Goldman Sachs Says One Catalyst Could Reverse Stagnant US Manufacturing Productivity – And It’s Not Tariffs: Report",
    "description": "US banking titan Goldman Sachs reportedly says that there’s one catalyst that can spark an American manufacturing resurgence. Goldman says in a note to investors that artificial intelligence (AI) advancements have massive potential to boost US manufacturing, …",
    "link": "https://dailyhodl.com/2025/07/01/goldman-sachs-says-one-catalyst-could-reverse-stagnant-us-manufacturing-productivity-and-its-not-tariffs-report/",
    "timestamp": "2025-07-01T14:30:17Z"
  },
  {
    "title": "Disney World's Animatronic Trump No Longer Looks Like Hillary Clinton",
    "description": "The Hall of Presidents attraction at the Magic Kingdom theme park reopened Sunday with the new figure.",
    "link": "https://www.newsweek.com/trump-hall-presidents-disney-attraction-figure-hillary-clinton-2093105",
    "timestamp": "2025-07-01T14:27:43Z"
  },
  {
    "title": "Trump’s Big Beautiful Bill in the Senate: When will the vote happen, and will it pass?",
    "description": "The US Senate is embroiled in a marathon voting session on President Trump's multitrillion-dollar bill, encompassing tax cuts, Pentagon funding, and safety-net program adjustments. Senators are considering amendments, with Democrats targeting potential GOP vu…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-big-beautiful-bill-in-the-senate-when-will-the-vote-happen-and-will-it-pass-trumps-big-beautiful-bill-latest-news/articleshow/122186069.cms",
    "timestamp": "2025-07-01T14:27:26Z"
  },
  {
    "title": "Revealed — The One Thing That Drives Donald Trump to Tears… And It's Not World War 3 Fears, Gun Rampages or Hatred Over His Immigration Policies",
    "description": "Robert F. Kennedy has revealed what makes Donald Trump cry and it's very unexpected — the music of the late, great Italian opera legend Luciano Pavarotti.",
    "link": "https://radaronline.com/p/one-thing-that-drives-donald-trump-to-tears-revealed-opera-luciano-pavarotti/",
    "timestamp": "2025-07-01T14:27:12Z"
  },
  {
    "title": "Partner of first US woman in space condemns NASA’s DEI rollback",
    "description": "Tam O’Shaughnessy, the partner of the first American woman in space, Sally Ride, has condemned NASA’s rollback of diversity, equity and inclusion (DEI) policies under the Trump administration. Sally Ride flew in the space shuttle Challenger in 1983 – at 32, b…",
    "link": "https://www.thepinknews.com/2025/07/01/tam-oshaughnessy-nasa-trump-dei-sally-ride/",
    "timestamp": "2025-07-01T14:26:19Z"
  },
  {
    "title": "Elon Musk Launches Scathing Attack on Donald Trump as US President Fires Back",
    "description": "Elon Musk reignited his feud with Donald Trump over a controversial spending bill and even threatened to form a political party if the legislation passed.",
    "link": "https://www.tuko.co.ke/world/us/594707-elon-musk-launches-scathing-attack-donald-trump-president-fires-back/",
    "timestamp": "2025-07-01T14:26:06Z"
  },
  {
    "title": "Powell stands by 'wait and see' stance with Trump ramping up attacks on the Federal Reserve",
    "description": "Federal Reserve Chair Jerome Powell is sticking to his position that the central bank will keep its key rate on hold while it waits to see how President Donald Trump’s tariffs effect the economy, defying the steady stream of criticism from the White House, wh…",
    "link": "https://www.seattlepi.com/business/article/powell-stands-by-wait-and-see-stance-with-trump-20402475.php",
    "timestamp": "2025-07-01T14:25:56Z"
  },
  {
    "title": "Is Amazon Stock A Buy? Wall Street Sees Upside For Second-Half Of The Year",
    "description": "Amazon stock closed the first half of 2025 flat. Here's why some analysts expect a stronger final six months of the year.",
    "link": "https://www.investors.com/news/technology/amazon-stock-buy-sell-july-2025/",
    "timestamp": "2025-07-01T14:25:33Z"
  },
  {
    "title": "The truth about weed, June's wildest political moments, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/truth-about-weed",
    "timestamp": "2025-07-01T14:25:31Z"
  },
  {
    "title": "Trump Team Has Full Meltdown Over CNN Story on ICE-Tracking App",
    "description": "Donald Trump’s sycophants are seriously pissed that people are trying to track ICE’s sweeping deportation efforts. \r\nCNN aired a segment Monday night highlighting ICEBlock, an app that allows users to anonymously log sightings of ICE agents, serving as an “ea…",
    "link": "https://newrepublic.com/post/197464/donald-trump-pam-bondi-tom-homan-cnn-ice-tracking-app",
    "timestamp": "2025-07-01T14:23:54Z"
  },
  {
    "title": "Fed's Powell Responds to Trump Attacks",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFederal Reserve Chair Jerome Powell said he is entirely focused on his job when asked if the attacks by U.S. President Donald Trump make his job harder.\n\"I'm very focused on just doing my job,\" Powell said at …",
    "link": "https://biztoc.com/x/5cc97b8ccca11e3b",
    "timestamp": "2025-07-01T14:22:25Z"
  },
  {
    "title": "‘Pull the funding!’ Investigation shows Harvard in violation of federal law for anti-Semitism",
    "description": "'The Trump Administration's work to restore equal enforcement of civil rights on American campuses continues,' says Education Secretary Linda McMahon",
    "link": "https://www.wnd.com/2025/07/pull-funding-investigation-shows-harvard-violation-federal-law/",
    "timestamp": "2025-07-01T14:22:22Z"
  },
  {
    "title": "Jerome Powell says Fed would have lowered rates already if it weren’t for tariffs",
    "description": "After the widespread uncertainty caused by the tariff policy, Powell said the Fed decided the \"prudent thing to do is to wait.\"",
    "link": "https://fortune.com/2025/07/01/jerome-powell-fed-interest-rates-tariffs/",
    "timestamp": "2025-07-01T14:21:39Z"
  },
  {
    "title": "Fed's Powell Responds to Trump Attacks",
    "description": "President Donald Trump has openly criticized Federal Reserve Chair Jerome Powell and demanded lower interest rates.",
    "link": "https://www.newsweek.com/fed-powell-trump-2093111",
    "timestamp": "2025-07-01T14:21:06Z"
  },
  {
    "title": "US job openings unexpectedly rise in May, hiring falls",
    "description": "U.S. job openings unexpectedly rose in May, reaching 7.769 million, while hiring decreased to 5.503 million. Uncertainty surrounding the Trump administration's tariffs, particularly the impending expiration of a 90-day pause on reciprocal duties, is impacting…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-job-openings-unexpectedly-rise-in-may-hiring-falls/articleshow/122186610.cms",
    "timestamp": "2025-07-01T14:20:55Z"
  },
  {
    "title": "Trump might ‘take a look’ at possible Elon Musk deportation",
    "description": "Donald Trump said he would 'take a look’ at the possibility of Elon Musk being deported.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/7/1/trump-might-take-a-look-at-possible-elon-musk-deportation",
    "timestamp": "2025-07-01T14:20:53Z"
  },
  {
    "title": "Elon Musk’s Net Worth Plunges $12 Billion As Trump Targets Musk’s Empire In Feud",
    "description": "\"This BFF situation has now turned into a soap opera that remains an overhang on Tesla's stock,\" bemoaned one Wall Street analyst.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/01/elon-musks-net-worth-plunges-12-billion-as-trump-targets-musks-empire-in-feud/",
    "timestamp": "2025-07-01T14:20:53Z"
  },
  {
    "title": "Powell isn't taking a July rate cut off the table for Fed",
    "description": "Jerome Powell didn’t rule out an interest rate reduction this month but agreed that the Federal Reserve would have cut rates by now if not for the tariffs...",
    "link": "https://finance.yahoo.com/news/powell-isnt-taking-a-july-rate-cut-off-the-table-for-fed-142021668.html",
    "timestamp": "2025-07-01T14:20:21Z"
  },
  {
    "title": "Amazon 'applauds' Canada's scrapping of tech tax",
    "description": "Amazon said Tuesday it \"applauds\" Canada's decision to scrap its digital services tax in order to salvage trade talks with the United States, calling it a win for the online retailer's customers.",
    "link": "https://economictimes.indiatimes.com/tech/technology/amazon-applauds-canadas-scrapping-of-tech-tax/articleshow/122186571.cms",
    "timestamp": "2025-07-01T14:17:34Z"
  },
  {
    "title": "Senators to Vote to Pass Trump’s Tax Bill After Deal, Thune Says",
    "description": "(Bloomberg) -- Senate Majority Leader John Thune said his chamber will soon vote on passage of President Donald Trump’s tax and spending bill after securing ...",
    "link": "https://finance.yahoo.com/news/senators-vote-pass-trump-tax-141720542.html",
    "timestamp": "2025-07-01T14:17:20Z"
  },
  {
    "title": "Trump Says the ‘Concept’ of ‘Alligator Alcatraz’ for Immigrants Is That Escapees Will Be Eaten: ‘This Is Not a Nice Business!’",
    "description": "President Donald Trump on Tuesday suggested that the concept of \"Alligator Alcatraz\" is that escaped detainees will be eaten by the local wildlife.\nThe post Trump Says the ‘Concept’ of ‘Alligator Alcatraz’ for Immigrants Is That Escapees Will Be Eaten: ‘This …",
    "link": "https://www.mediaite.com/politics/trump/trump-says-the-concept-of-alligator-alcatraz-for-immigrants-is-that-escapees-will-be-eaten-this-is-not-a-nice-business/",
    "timestamp": "2025-07-01T14:17:06Z"
  },
  {
    "title": "Musk proposes a new political party, Trump suggests DOGE 'might have to go back and eat Elon'",
    "description": "Elon Musk’s feud with President Donald Trump has reignited, with the tech billionaire threatening to launch a new political party and Trump suggesting Musk could be punished for his opposition.",
    "link": "https://www.ksat.com/news/politics/2025/07/01/musk-proposes-a-new-political-party-trump-suggests-doge-might-have-to-go-back-and-eat-elon/",
    "timestamp": "2025-07-01T14:17:00Z"
  },
  {
    "title": "Tesla shares plunge 8% after Trump's deportation threat to Elon Musk",
    "description": "Tesla shares slumped after U.S. President Donald Trump threatened to deport Elon Musk in response to the billionaire’s sharp criticism of his proposed “big beautiful bill.”",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tesla-shares-plunge-8-after-trumps-deportation-threat-to-elon-musk/articleshow/122186503.cms",
    "timestamp": "2025-07-01T14:16:05Z"
  },
  {
    "title": "Netflix’s Lofty Valuation Has Even Bullish Investors Nervous",
    "description": "(Bloomberg) -- Netflix Inc. investors face a dilemma: Continue to bet on a stock that has delivered best-in-class returns over the past year or reconsider...",
    "link": "https://finance.yahoo.com/news/netflix-lofty-valuation-even-bullish-095619842.html",
    "timestamp": "2025-07-01T14:15:18Z"
  },
  {
    "title": "Musk Walks Back Chainsaw Wielding Display: 'It Lacked Empathy' (Aysha Diallo/Bloomberg)",
    "description": "Aysha Diallo / Bloomberg:\nMusk Walks Back Chainsaw Wielding Display: ‘It Lacked Empathy’  —  Elon Musk is expressing some regret for waving a chainsaw to rile up the crowd during a conservative conference back in February, as his feud with Donald Trump over t…",
    "link": "https://www.memeorandum.com/250701/p41",
    "timestamp": "2025-07-01T14:15:00Z"
  },
  {
    "title": "International Criminal Court says it was hit by sophisticated cyberattack",
    "description": "No details about the incident were given but the media are tentatively linking it to Israel.",
    "link": "https://www.techradar.com/pro/security/international-criminal-court-says-it-was-hit-by-sophisticated-cyberattack",
    "timestamp": "2025-07-01T14:15:00Z"
  },
  {
    "title": "Donald Trump Chuckles About Escaped Prisoners Getting Eaten at 'Alligator Alcatraz'",
    "description": "Donald Trump was in great spirits Tuesday morning ... and why wouldn't he be, 'cause he was talking about one of his favorite subjects -- alligators gobbling up escaped prisoners! The commander-in-chief was about to depart the White House for the…\n Permalink",
    "link": "https://www.tmz.com/2025/07/01/donald-trump-alligator-alcatraz-prisoners-eaten-florida-immigration-detention/",
    "timestamp": "2025-07-01T14:13:55Z"
  },
  {
    "title": "Trump says he’ll ‘take a look’ at deporting Elon Musk",
    "description": "The US president has also suggested getting DOGE to investigate the billionaire, noting that he has received a lot of subsidies Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620843-trump-threatens-musk-deportation/",
    "timestamp": "2025-07-01T14:13:31Z"
  },
  {
    "title": "Why 50 Cent Thinks Diddy’s Legal Team Did Him ‘Dirty’ As Deliberations Begin In His Sex-Trafficking Trial",
    "description": "50 Cent didn't hold back.",
    "link": "https://www.cinemablend.com/streaming-news/why-50-cent-thinks-diddy-legal-team-did-him-dirty-as-deliberations-begin-sex-trafficking-trial",
    "timestamp": "2025-07-01T14:12:55Z"
  },
  {
    "title": "South Africa seeks extension of US tariff hike deadline",
    "description": "Pretoria’s trade ministry says more time is needed to finalize a deal with Washington that includes requests for key export exemptions Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/620842-south-africa-seeks-extension-us-tariff-deadline/",
    "timestamp": "2025-07-01T14:11:39Z"
  },
  {
    "title": "Three killed in Ukrainian drone attack on central Russia",
    "description": "The attack on a factory in the city of Izhevsk was more than 1,000km (620 miles) from the border.",
    "link": "https://www.bbc.co.uk/news/articles/cyvjj9lmq3zo",
    "timestamp": "2025-07-01T14:11:32Z"
  },
  {
    "title": "‘…back home to South Africa’: President Trump takes aim at Elon Musk over EV subsidies; Tesla shares slump",
    "description": "By Jasmine Ng, Bloomberg\nPresident Donald Trump lashed out at Elon Musk on Tuesday, accusing the Tesla Inc. and SpaceX chief executive officer of benefiting excessively from government electric vehicle subsidies. Tesla shares tumbled.\nRelated Articles\n \n \n \n …",
    "link": "https://biztoc.com/x/a6a22145de5e8cb6",
    "timestamp": "2025-07-01T14:11:03Z"
  },
  {
    "title": "Israel steps up campaign in Gaza ahead of Netanyahu's US visit",
    "description": "GAZA CITY: Israel's military said Tuesday (Jul 1) that it had expanded its operations in Gaza, where residents reported fierce gunfire and shelling days ahead of a planned trip to Washington by Prime Minister Benjamin Netanyahu. The intensified operations cam…",
    "link": "https://www.channelnewsasia.com/world/israel-steps-up-campaign-gaza-war-netanyahu-us-visit-5214296",
    "timestamp": "2025-07-01T14:11:00Z"
  },
  {
    "title": "Senate Leaders Pressure Holdouts Ahead of Trump Tax Bill Vote",
    "description": "The Senate worked through the night on President Donald Trump’s $3.3 trillion tax and spending package, with Republican leaders still negotiating with key GOP holdouts into the morning as lawmakers neared a vote expected Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-leaders-pressure-holdouts-ahead-of-trump-tax-bill-vote",
    "timestamp": "2025-07-01T14:10:54Z"
  },
  {
    "title": "Trump Says He'll 'Take A Look' At Deporting Elon Musk",
    "description": "\"So tempting to escalate this,\" the billionaire said in response.",
    "link": "https://www.huffpost.com/entry/trump-deporting-elon-musk_n_6863da7be4b0aa65edbb1185",
    "timestamp": "2025-07-01T14:10:48Z"
  },
  {
    "title": "Trump Hints At Biggest Threat Yet To Elon Musk",
    "description": "President Donald Trump said he will \"take a look\" at deporting Elon Musk after the former federal employee once again criticized his \"Big Beautiful Bill.\"",
    "link": "https://dailycaller.com/2025/07/01/donald-trump-elon-musk-white-house-deport-south-africa-big-beautiful-bill/",
    "timestamp": "2025-07-01T14:10:38Z"
  },
  {
    "title": "State Dept 'No Comment' On Victor Orban Trying To Cancel Pride Parade",
    "description": "Donald Trump's State Department spokesperson Tammy Bruce was mum when asked about Hungarian Prime Minister Victor Orban's attempts to shut down a Pride parade in Budapest.\nThe Mayor of Budapest ignored his ban and over 100,000 people \"marched through the Hung…",
    "link": "https://crooksandliars.com/2025/06/state-dept-no-comment-orban-trying-cancel",
    "timestamp": "2025-07-01T14:10:13Z"
  },
  {
    "title": "Trump wavers on July 4 megabill deadline (Giselle Ruhiyyih Ewing/Politico)",
    "description": "Giselle Ruhiyyih Ewing / Politico:\nTrump wavers on July 4 megabill deadline  —  President Donald Trump appeared to leave room to extend his July 4 deadline for Congress to pass the One Big Beautiful Bill Act, as the Senate scrambles to push through the legisl…",
    "link": "https://www.memeorandum.com/250701/p39",
    "timestamp": "2025-07-01T14:10:00Z"
  },
  {
    "title": "Majority Of Americans Say Political Violence Now A 'Major Problem,' Worried Democracy Is At Risk",
    "description": "Political violence has spiked in the United States over the last decade, and most Americans feel democracy is at risk.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/07/01/majority-of-americans-say-political-violence-now-a-major-problem-worried-democracy-is-at-risk/",
    "timestamp": "2025-07-01T14:09:50Z"
  },
  {
    "title": "The Role of US Foreign Policy in the ICE Protests. The Plight of Impoverished Latin American Seeking a Better Life. Kurt Nimmo",
    "description": "The largest number of immigrants crossing the border are from Mexico, followed by Guatemala, Venezuela, Cuba, Ecuador, and Colombia. How is the US responsible for this migration?\nThe post The Role of US Foreign Policy in the ICE Protests. The Plight of Impove…",
    "link": "https://www.globalresearch.ca/role-us-foreign-policy-ice-protests/5893359",
    "timestamp": "2025-07-01T14:09:01Z"
  },
  {
    "title": "Trump Was Just Asked If He’ll Deport Elon Musk",
    "description": "After Musk attacked his signature spending bill, the U.S. president threatened to turn Musk's own government agency, DOGE, into a \"monster\" that would \"go back and eat\" him.",
    "link": "https://gizmodo.com/trump-was-just-asked-if-hell-deport-elon-musk-2000622737",
    "timestamp": "2025-07-01T14:08:19Z"
  },
  {
    "title": "Trump says buyer group lined up for TikTok’s US operations, details expected in two weeks",
    "description": "US President Donald Trump said he has secured “a group of very wealthy people” to acquire TikTok’s US operations, adding that he plans to disclose details of the deal in roughly two weeks. Trump made the remarks Saturday in an interview with Fox News’ Sunday …",
    "link": "http://technode.com/2025/07/01/trump-says-buyer-group-lined-up-for-tiktoks-us-operations-details-expected-in-two-weeks/",
    "timestamp": "2025-07-01T14:07:37Z"
  },
  {
    "title": "'Total nut job': Trump ridicules Zohran Mamdani in explosive attack, says 'going to have a lot of fun with him'",
    "description": "Donald Trump has escalated his attacks on Zohran Mamdani, the Democratic mayoral frontrunner in New York City, labeling him a \"communist\" and a \"nut job.\" Trump teased plans to challenge Mamdani if he becomes mayor, threatening to cut federal aid to New York …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-zohran-mamdani-total-nut-job-says-going-to-have-a-lot-of-fun-with-him/articleshow/122186391.cms",
    "timestamp": "2025-07-01T14:07:14Z"
  },
  {
    "title": "Trump Threatens to Deport Elon Musk",
    "description": "\"DOGE is the monster that might have to go back and eat Elon.\"\nTrump Threatens to Deport Elon Musk\nScoop Harrison",
    "link": "https://consequence.net/2025/07/trump-threatens-to-deport-elon-musk/",
    "timestamp": "2025-07-01T14:06:16Z"
  },
  {
    "title": "Musk proposes a new political party, Trump suggests DOGE 'might have to go back and eat Elon'",
    "description": "Elon Musk's feud with President Donald Trump — and seemingly any congressional Republicans who support the president's massive tax cuts and spending package ...",
    "link": "https://www.yahoo.com/news/musk-proposes-political-party-trump-140601585.html",
    "timestamp": "2025-07-01T14:06:01Z"
  },
  {
    "title": "Elon Musk Is At It Again",
    "description": "We're looking at Elon Musk's latest Twitter spat with Trump, as well as what's happening to Musk's car company while he's busy having Twitter spats with Trump.",
    "link": "https://www.jalopnik.com/1900583/elon-musk-twitter-fight-donald-trump/",
    "timestamp": "2025-07-01T14:04:12Z"
  },
  {
    "title": "It recognizes human nature as it is and has been throughout the ages",
    "description": "An existential identity crisis now grips the American right: A political movement once united by a commitment to limited government, moral order, and a robust defense of American ideals now appears fractured, its purpose clouded by populist grievances and ide…",
    "link": "https://www.isegoria.net/2025/07/it-recognizes-human-nature-as-it-is-and-has-been-throughout-the-ages/",
    "timestamp": "2025-07-01T14:03:49Z"
  },
  {
    "title": "Truckers Fear Job Loss as New English Language Rules Take Effect",
    "description": "At a trucking school in New Jersey, students are maneuvering 18-wheelers around traffic cones. Other future drivers look under hoods to perform safety checks, narrating as they examine steering hoses for cracks and leaks. An instructor glides between speaking…",
    "link": "https://www.insurancejournal.com/news/national/2025/07/01/829753.htm",
    "timestamp": "2025-07-01T14:02:58Z"
  },
  {
    "title": "US manufacturing mired in weakness as tariffs bite",
    "description": "WASHINGTON (Reuters) -U.S. manufacturing remained sluggish in June, with new orders subdued and prices paid for inputs creeping higher, suggesting that the...",
    "link": "https://finance.yahoo.com/news/us-manufacturing-mired-weakness-tariffs-140243917.html",
    "timestamp": "2025-07-01T14:02:43Z"
  },
  {
    "title": "RFK Jr. Reveals the ‘Most Surprising Thing’ He Learned About Trump to Tucker Carlson",
    "description": "Robert F. Kennedy Jr. told Tucker Carlson that Donald Trump not being a one-dimensional \"narcissist\" is the \"most surprising\" thing he's learned about him.\nThe post RFK Jr. Reveals the ‘Most Surprising Thing’ He Learned About Trump to Tucker Carlson first app…",
    "link": "https://www.mediaite.com/media/podcasts/rfk-jr-reveals-the-most-surprising-thing-he-learned-about-trump-to-tucker-carlson/",
    "timestamp": "2025-07-01T14:01:15Z"
  },
  {
    "title": "Do Democrats Need or Want a Centrist ‘Project 2029’?",
    "description": "A group of centrist wonks is planning to do a ‘Project 2029’ that will develop an agenda for a yet-to-be identified Democratic candidate. It will be interesting to see if they have any buyers.",
    "link": "http://nymag.com/intelligencer/article/do-democrats-need-or-want-a-centrist-project-2029.html",
    "timestamp": "2025-07-01T14:01:01Z"
  },
  {
    "title": "Nearly Half of Americans Believe False Claims, Study Shows",
    "description": "A NewsGuard study finds 49 percent of Americans believe false online claims, with only 7 percent correctly identifying all as untrue.",
    "link": "https://www.newsweek.com/newsguard-study-nearly-half-americans-believe-false-claims-2092838",
    "timestamp": "2025-07-01T14:01:01Z"
  },
  {
    "title": "From a Chicago rooftop to 3,000-mile journey, here's how I'm fighting to restore America's soul",
    "description": "From Chicago's South Side to a cross-country journey, here's my plan to walk 3,000 miles to promote merit and community transformation against damaging liberal policies.",
    "link": "https://www.foxnews.com/opinion/im-marching-across-usa-restore-merit-american-dream",
    "timestamp": "2025-07-01T14:00:36Z"
  },
  {
    "title": "As the Republican megabill faces crunch time, Trump pushes a fraudulent claim about taxes",
    "description": "Donald Trump said his claim about preventing a 68% tax increase is true “according to what they tell me.” But \"they\" have no idea what they're talking about.",
    "link": "https://biztoc.com/x/768b368c745c4e3f",
    "timestamp": "2025-07-01T14:00:33Z"
  },
  {
    "title": "Israel Expands Campaign In Gaza Ahead Of Netanyahu's US Visit",
    "description": "Israel's military said Tuesday that it had expanded its operations in Gaza, where residents reported fierce gunfire and shelling days ahead of a planned trip to Washington by Prime Minister Benjamin Netanyahu.",
    "link": "https://www.ibtimes.com/israel-expands-campaign-gaza-ahead-netanyahus-us-visit-3777346",
    "timestamp": "2025-07-01T14:00:27Z"
  },
  {
    "title": "Why a OnePlus ban could ruin Android phones in the US as we know them",
    "description": "Two US lawmakers have called for a probe into OnePlus phones. I hope this doesn't lead to a ban as that would be awful for US consumers.",
    "link": "https://www.androidauthority.com/oneplus-ban-could-ruin-us-android-phones-3572713/",
    "timestamp": "2025-07-01T14:00:26Z"
  },
  {
    "title": "Lisa Murkowski Holds the Big Beautiful Bill in Her Hands",
    "description": "John Thune put together a sweet deal on Medicaid and SNAP cuts for Lisa Murkowski’s Alaska, but then the Senate parliamentarian vetoed it. Putting it back together could secure Murkowski’s vote and Senate passage of Trump’s big beautiful bill.",
    "link": "http://nymag.com/intelligencer/article/lisa-murkowski-holds-the-big-beautiful-bill-in-her-hands.html",
    "timestamp": "2025-07-01T14:00:23Z"
  },
  {
    "title": "Powell confirms that the Fed would have cut by now were it not for tariffs",
    "description": "Federal Reserve Chair Jerome Powell said Tuesday that the U.S. central bank would have easier monetary policy by now if not for President Donald Trump's tariff plan.\nWhen asked during a panel if the Fed would have lowered rates again by now had Trump not anno…",
    "link": "https://biztoc.com/x/9d14918284fbbada",
    "timestamp": "2025-07-01T14:00:18Z"
  },
  {
    "title": "Dem governor drops F-bomb when trolled for alleged cocaine use",
    "description": "Maine Gov. Janet Mills confronted about alleged cocaine use while DOJ memo surfaces contradicting her long-standing claim that the 1990s investigation was politically motivated.",
    "link": "https://www.foxnews.com/politics/dem-governor-drops-f-bomb-when-trolled-alleged-cocaine-use",
    "timestamp": "2025-07-01T14:00:15Z"
  },
  {
    "title": "Trump threatens to set Doge on Musk as pair feud again over budget plan",
    "description": "Trump threatens to set Doge on Musk as pair feud again over budget plan\nUS President Donald Trump has suggested that Doge, the cost-cutting agency Elon Musk helped set up, could be used to hurt the billionaire's companies - as the former allies continue their…",
    "link": "https://biztoc.com/x/19d876c50c654b96",
    "timestamp": "2025-07-01T14:00:14Z"
  },
  {
    "title": "Israel Expands Campaign In Gaza Ahead Of Netanyahu's US Visit",
    "description": "Israel's military said Tuesday that it had expanded its operations in Gaza, where residents reported fierce gunfire and shelling days ahead of a planned trip to Washington by Prime Minister Benjamin Netanyahu.",
    "link": "https://www.ibtimes.com.au/israel-expands-campaign-gaza-ahead-netanyahus-us-visit-1859486",
    "timestamp": "2025-07-01T14:00:12Z"
  },
  {
    "title": "Trump wavers on July 4 megabill deadline",
    "description": "President Donald Trump appeared to leave room to extend his July 4 deadline for Congress to pass the One Big Beautiful Bill Act, as the Senate scrambles to push through the legislation amid Republican infighting. \n“I'd love to do July 4th, but I think it's ve…",
    "link": "https://biztoc.com/x/b26fb1aa0b9c7517",
    "timestamp": "2025-07-01T14:00:11Z"
  },
  {
    "title": "President Selling $250 Bottles of Cologne and Perfume...",
    "description": "Isn’t this against the law? A sitting US president selling bottles of fragrance on his web site? And yet, Donald Trump is doing just that. Around 8pm Eastern, while the Senate readied to vote on Trump’s bill — one that will gut services in the country irrepar…",
    "link": "https://www.showbiz411.com/2025/06/30/trump-announces-hes-selling-250-bottles-of-cologne-and-perfume-as-the-senate-debates-future-of-his-big-ruinous-bill",
    "timestamp": "2025-07-01T14:00:03Z"
  },
  {
    "title": "3 Uncomfortable Facts about Israel’s War on Civilization that You Won’t Learn from Mainstream Media",
    "description": "And all this time you thought Israel was fighting something called “Hamas”! Poor dears, what else could you think, what with all the U.S. news outlets and “experts” and talking heads telling you the same thing? But they lied. They told you that Israel was fig…",
    "link": "https://www.activistpost.com/3-uncomfortable-facts-about-israels-war-on-civilization-that-you-wont-learn-from-mainstream-media/",
    "timestamp": "2025-07-01T14:00:00Z"
  },
  {
    "title": "Trump Says He Might Bomb Iran Again",
    "description": "Trump’s early declaration of a durable peace in the Middle East appears to be giving way to a multi-sided military buildup.\nThe post Trump Says He Might Bomb Iran Again appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/trump-says-might-bomb-iran-again-bw",
    "timestamp": "2025-07-01T14:00:00Z"
  },
  {
    "title": "Powell confirms that the Fed would have cut by now were it not for tariffs",
    "description": "The U.S. central bank would likely have begun cutting interest rates again if not for the levy plan, the Fed chief said.",
    "link": "https://www.cnbc.com/2025/07/01/powell-confirms-that-the-fed-would-have-cut-by-now-were-it-not-for-tariffs.html",
    "timestamp": "2025-07-01T13:58:40Z"
  },
  {
    "title": "Dana Carvey says he was ‘delicate’ with Joe Biden ‘SNL’ impression because ex-prez was ‘compromised mentally’",
    "description": "Dana Carvey had a tricky task impersonating Joe Biden on \"Saturday Night Live.\"",
    "link": "https://nypost.com/2025/07/01/entertainment/dana-carvey-on-why-he-was-delicate-with-joe-biden-snl-impression/",
    "timestamp": "2025-07-01T13:56:59Z"
  },
  {
    "title": "Todd Chrisley Shares Wild Revelations About Prison Stay on New Podcast",
    "description": "Todd Chrisley is not holding back when it comes to his 28-month stay in prison. Todd, 56, appeared on the Tuesday, July 1, episode of daughter Savannah Chrisley’s “Unlocked” podcast alongside wife Julie Chrisley, which they recorded three weeks following thei…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-shares-details-about-prison-stay-on-new-podcast/#article",
    "timestamp": "2025-07-01T13:56:02Z"
  },
  {
    "title": "Trump to Consider Deporting Musk: ‘We’ll Have to Take a Look,’ Adds That ‘DOGE Is the Monster That Might Have to Go Back and Eat Elon’",
    "description": "The feud between President Donald Trump and Elon Musk is still boiling on the front-burner — with Trump saying he will “take a look” at whether the U.S. will deport the South African-born tech billionaire. Trump and Musk were one-time close political allies b…",
    "link": "https://variety.com/2025/digital/news/trump-considers-deporting-musk-doge-monster-1236445021/",
    "timestamp": "2025-07-01T13:55:05Z"
  },
  {
    "title": "Celebrating Canada Day in St. John's takes on more significance due to tension with U.S.",
    "description": "While crowds showed up on Signal Hill to celebrate Canada Day, ready to celebrate the country’s 158th anniversary, some say it’s taking on new importance in the face of threats.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/canada-day-sunrise-nl-1.7574760",
    "timestamp": "2025-07-01T13:54:39Z"
  },
  {
    "title": "Trump says he'll 'look' at deporting Musk as feud reignites",
    "description": "The feud between Elon Musk and President Donald Trump heated up again Tuesday after the billionaire slammed Republicans over the president's spending bill.",
    "link": "https://abcnews.go.com/Politics/trump-hell-deporting-musk-feud-reignites/story?id=123372908",
    "timestamp": "2025-07-01T13:51:29Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Drops Video Receipts on Trump ‘Broken Promises’ in ‘Big Beautiful Bill’",
    "description": "CNN anchor Kaitlan Collins dropped a handy supercut of visual receipts to call out \"broken promises\" in President Donald Trump's \"Big Beautiful Bill.\"\nThe post CNN’s Kaitlan Collins Drops Video Receipts on Trump ‘Broken Promises’ in ‘Big Beautiful Bill’ first…",
    "link": "https://www.mediaite.com/media/news/cnns-kaitlan-collins-drops-video-receipts-on-trump-broken-promises-in-big-beautiful-bill/",
    "timestamp": "2025-07-01T13:51:11Z"
  },
  {
    "title": "Trump says migrants would need to know ‘how to run away from an alligator’ to flee Florida facility",
    "description": "Trump is heading there on Tuesday.",
    "link": "https://www.bostonherald.com/2025/07/01/trump-immigration-florida/",
    "timestamp": "2025-07-01T13:50:30Z"
  },
  {
    "title": "Trump says migrants would need to know ‘how to run away from an alligator’ to flee Florida facility",
    "description": "Trump is heading there on Tuesday.",
    "link": "https://www.denverpost.com/2025/07/01/trump-immigration-florida/",
    "timestamp": "2025-07-01T13:50:30Z"
  },
  {
    "title": "Iowa's civil rights protections no longer include gender identity as new law takes effect",
    "description": "Iowa became the first state to remove gender identity from its civil rights code under a law that took effect Tuesday,",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/iowas-civil-rights-protections-no-longer-include-gender-identity-new-l-rcna216190",
    "timestamp": "2025-07-01T13:49:48Z"
  },
  {
    "title": "Public companies bought more bitcoin than ETFs did for the third quarter in a row",
    "description": "More companies are trying to benefit from MicroStrategy's bitcoin acquisition playbook in a more crypto-friendly regulatory environment.",
    "link": "https://www.cnbc.com/2025/07/01/public-companies-bought-more-bitcoin-than-etfs-did-for-the-third-quarter-in-a-row.html",
    "timestamp": "2025-07-01T13:49:15Z"
  },
  {
    "title": "Senate works a tense overnight session as Republicans seek support for Trump’s big bill",
    "description": "Thune wants to satisfy Republicans worried the bill's reductions to Medicaid will leave millions more people without care and those in his conservative flank seeking steeper cuts to hold down deficits ballooning with the tax cuts.",
    "link": "https://www.pbs.org/newshour/politics/senate-works-a-tense-overnight-session-as-republicans-seek-support-for-trumps-big-bill",
    "timestamp": "2025-07-01T13:48:43Z"
  },
  {
    "title": "'DOGE is a monster': Trump snarls he could use department to 'eat Elon'",
    "description": "During an impromptu question and answer with reporters on the White House lawn, Donald Trump made more ominous rumblings about what could await Elon Musk if he persists in trying to derail the megabill currently being debated in the Senate.Asked about Musk's …",
    "link": "https://www.rawstory.com/trump-doge-elon/",
    "timestamp": "2025-07-01T13:48:39Z"
  },
  {
    "title": "New US ambassador takes up office, swapping pet goats in New Jersey for deer in the Phoenix Park",
    "description": "Walsh is the founder of a construction company and a former real estate investor with no diplomatic experience.",
    "link": "https://www.thejournal.ie/new-us-ambassador-takes-up-office-ireland-6749053-Jul2025/",
    "timestamp": "2025-07-01T13:48:22Z"
  },
  {
    "title": "Trump Threatens to Sic DOGE on Elon Musk, Maybe Deport Him",
    "description": "President Donald Trump has threatened to cut billionaire Elon Musk off completely by sending his own so-called Department of Government Efficiency after him. In a post on his social media platform Truth Social, Trump pointed out that Musk had long enjoyed cru…",
    "link": "https://futurism.com/trump-threatens-doge-musk",
    "timestamp": "2025-07-01T13:48:06Z"
  },
  {
    "title": "Trump threatens to set Doge on Musk as pair feud again over budget plan",
    "description": "The US president suggests the cost-cutting agency the tech titan helped set up could be used against him.",
    "link": "https://www.bbc.com/news/articles/czdvv2qqlrqo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-01T13:47:58Z"
  },
  {
    "title": "Opinion: A doctor’s notes from the BMA conference",
    "description": "A senior doctor and longstanding member of the BMA describes this year's conference and wrestling with whether to stay or leave the organisation",
    "link": "https://www.jewishnews.co.uk/opinion-a-doctors-notes-from-the-bma-conference/",
    "timestamp": "2025-07-01T13:46:30Z"
  },
  {
    "title": "Lady Gaga a no-show at Jeff Bezos wedding after reported clash over multi-million dollar fee",
    "description": "Jeff Bezos and Lauren Sanchez's wedding in Italy was a grand affair. Initially, Lady Gaga and Elton John were expected to perform. However, both artists reportedly requested a hefty sum of $6 million each. Bezos declined, leading to DJ Cassidy's performance i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/lady-gaga-a-no-show-at-jeff-bezos-wedding-after-reported-clash-over-multi-million-dollar-fee/articleshow/122185751.cms",
    "timestamp": "2025-07-01T13:46:28Z"
  },
  {
    "title": "Powell says the Fed would have cut rates this year if it weren’t for tariffs | CNN Business",
    "description": "The Federal Reserve would likely have lowered interest rates this year if it weren’t for President Donald Trump’s significant policy changes, Chair Jerome Powell said Tuesday.",
    "link": "https://www.cnn.com/2025/07/01/economy/jerome-powell",
    "timestamp": "2025-07-01T13:46:06Z"
  },
  {
    "title": "US stocks drift as Wall Street’s momentum slows and Tesla drops",
    "description": "Tesla helped pull the market lower.",
    "link": "https://www.bostonherald.com/2025/07/01/financial-markets-july-1/",
    "timestamp": "2025-07-01T13:45:42Z"
  },
  {
    "title": "Trump signs an executive order ending US sanctions on Syria",
    "description": "President Donald Trump has signed an executive order ending U.S. sanctions on Syria, following through on a promise",
    "link": "https://www.wsbtv.com/news/world/trump-signs-an/LHDEKFEWERH45BXTGXM4V3MRS4/",
    "timestamp": "2025-07-01T13:45:36Z"
  },
  {
    "title": "Spirit Halloween goes on 50K-person hiring spree despite Trump tariffs",
    "description": "Spirit Halloween said it is hiring 50,000 seasonal workers in the coming months in anticipation of spooky season",
    "link": "https://www.northjersey.com/story/news/business/2025/07/01/spirit-halloween-jobs-nj/84428174007/",
    "timestamp": "2025-07-01T13:44:47Z"
  },
  {
    "title": "Trump 2.0 At 5.3 Months, Plus Gold, Copper and More!",
    "description": "This post Trump 2.0 At 5.3 Months, Plus Gold, Copper and More! appeared first on Daily Reckoning.\nHappy 1st of July. The year is now half over, and we’ve had five and one-third months of President Trump 2.0. His opponents wanted him in jail; instead, he’s in …",
    "link": "https://dailyreckoning.com/trump-2-0-at-5-3-months-plus-gold-copper-and-more/",
    "timestamp": "2025-07-01T13:43:29Z"
  },
  {
    "title": "Trump Teases Deporting Elon: ‘We’ll Have to Take a Look’",
    "description": "Donald Trump is lashing out at Elon Musk, and teasing his deportation, as the former DOGE chief bashes the so-called \"Big Beautiful Bill.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-teases-deporting-elon-musk-feud-tax-bill-1235376309/",
    "timestamp": "2025-07-01T13:43:17Z"
  },
  {
    "title": "How athletes will be paid as July 1 ushers in new era for college sports: NIL changes, enforcement, contracts",
    "description": "Players are eligible to receive direct payment from schools for the first time, but how will this all work?",
    "link": "https://www.cbssports.com/college-football/news/how-athletes-will-be-paid-as-july-1-ushers-in-new-era-for-college-sports-nil-changes-enforcement-contracts/",
    "timestamp": "2025-07-01T13:43:04Z"
  }
]