[
  {
    "title": "Ukraine war: Over 400,000 Russians killed, wounded",
    "description": "Moscow, Jan 3: Russia finished 2025 with what Ukraine described as an information operation designed to avoid engaging in peace […]\nThe post Ukraine war: Over 400,000 Russians killed, wounded appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/01/03/ukraine-war-over-400000-russians-killed-wounded/",
    "timestamp": "2026-01-02T20:15:00Z"
  },
  {
    "title": "Children's Hospital Colorado suspends gender-affirming care, again",
    "description": "Children's Hospital Colorado has suspended gender-affirming care for transgender youth amid a new federal investigation and funding threats.",
    "link": "http://coloradosun.com/2026/01/02/childrens-hospital-colorado-gender-affirming-care-kennedy/",
    "timestamp": "2026-01-02T20:13:25Z"
  },
  {
    "title": "In a tumultuous year, U.S. health policy transforms under RFK Jr.",
    "description": "He has also promoted controversial views on vaccines, including removing the Centers for Disease Control and Prevention's recommendation for COVID-19 vaccines for healthy children and pregnant women.",
    "link": "https://www.pbs.org/newshour/nation/in-a-tumultuous-year-u-s-health-policy-transforms-under-rfk-jr",
    "timestamp": "2026-01-02T20:05:18Z"
  },
  {
    "title": "In a tumultuous year, U.S. health policy transforms under RFK Jr.",
    "description": "He has also promoted controversial views on vaccines, including removing the Centers for Disease Control and Prevention's recommendation for COVID-19 vaccines for healthy children and pregnant women.",
    "link": "https://www.pbs.org/newshour/health/in-a-tumultuous-year-u-s-health-policy-transforms-under-rfk-jr",
    "timestamp": "2026-01-02T20:05:18Z"
  },
  {
    "title": "Jeffries Calls For House Probe Into Trump's Health - Joe.My.God.",
    "description": "The Daily Beast reports: Hakeem Jeffries wants Congress to bring the same investigative rigor to Donald Trump’s ailing health that it brought to the Epstein Files. The 55-year-old Democratic House Min",
    "link": "https://www.joemygod.com/2026/01/jeffries-calls-for-house-probe-into-trumps-health/",
    "timestamp": "2026-01-02T20:04:32Z"
  },
  {
    "title": "Kennedy Center Disputes Media Claims of Low Ratings for Honors Ceremony: 'Performed Extremely Well Across Key Demographics'",
    "description": "The Kennedy Center has disputed media claims of low ratings during its honors ceremony hosted by President Trump several days before Christmas. \nThe post Kennedy Center Disputes Media Claims of Low Ratings for Honors Ceremony: ‘Performed Extremely Well Across…",
    "link": "https://www.breitbart.com/entertainment/2026/01/02/kennedy-center-disputes-media-claims-of-low-ratings-for-honors-ceremony-performed-extremely-well-across-key-demographics/",
    "timestamp": "2026-01-02T20:02:36Z"
  },
  {
    "title": "13 WTF Moments of the Year: 2025 Crypto Edition",
    "description": "The crypto industry delivered some of the most baffling, surreal, and downright degenerate moments in its history in 2025—here’s a few.",
    "link": "https://decrypt.co/351637/13-wtf-moments-year-2025-crypto-edition",
    "timestamp": "2026-01-02T20:01:03Z"
  },
  {
    "title": "Trump Signs Defense Bill Prohibiting China-Based Engineers in Pentagon IT Work",
    "description": "President Donald Trump signed into law this month a measure that prohibits anyone based in China and other adversarial countries from accessing the Pentagon's cloud computing systems. From a report: The ban, which is tucked inside the $900 billion defense pol…",
    "link": "https://news.slashdot.org/story/26/01/02/182247/trump-signs-defense-bill-prohibiting-china-based-engineers-in-pentagon-it-work",
    "timestamp": "2026-01-02T20:01:00Z"
  },
  {
    "title": "'I Don't Like It': Trump, 79, Whines About Exercising Being 'Boring' as His Alarming Junk Food Eating Habits Are Exposed Amid Rising Health Concerns for the Prez",
    "description": "Donald Trump complained that he doesn't like exercise, finding it boring, as a new interview exposed his overall health and eating habits.",
    "link": "https://radaronline.com/p/donald-trump-exercising-boring-junk-food-habits-exposed/",
    "timestamp": "2026-01-02T20:00:00Z"
  },
  {
    "title": "'Too busy partying': Analyst rips Jeanine Pirro for playing 'games' with DC pipe bomb case",
    "description": "The Justice Department finally arrested a suspect in the Jan. 6 pipe bombing case, potentially resolving a five-year mystery of who targeted both the Democratic and Republican National Conventions with improvised explosive devices right around the time a pro-…",
    "link": "https://www.rawstory.com/jeanine-pirro-2674843447/",
    "timestamp": "2026-01-02T19:59:26Z"
  },
  {
    "title": "Kristi Noem Seen Dancing to 'Ice Ice Baby' Alongside Stephen Miller At Trump's NYE Bash",
    "description": "Both Noem and Miller are known for their role in expanding the United States Immigration and Customs Enforcement (ICE), indicating that the choice of song was intentional.",
    "link": "https://www.ibtimes.com/kristi-noem-seen-dancing-ice-ice-baby-alongside-stephen-miller-trumps-nye-bash-3794218",
    "timestamp": "2026-01-02T19:58:29Z"
  },
  {
    "title": "Why is Iran facing its biggest protests in years?",
    "description": "Iranians are taking to the streets as a growing movement of civic unrest threatens a fragile stability",
    "link": "https://theweek.com/world-news/iran-protests-economy",
    "timestamp": "2026-01-02T19:57:52Z"
  },
  {
    "title": "Trump threatens Iran over protest crackdown as deadly unrest flares (Reuters)",
    "description": "Reuters:\nTrump threatens Iran over protest crackdown as deadly unrest flares  —  U.S. President Donald Trump threatened on Friday to come to the aid of protesters in Iran if security forces fired on them, days into unrest that has left several dead and posed …",
    "link": "https://www.memeorandum.com/260102/p41",
    "timestamp": "2026-01-02T19:55:00Z"
  },
  {
    "title": "NASA Forced to Shut Down Largest Library, Throw Invaluable Materials in Trash",
    "description": "\"If you lose that history, you are going to make the same mistakes again.\"\nThe post NASA Forced to Shut Down Largest Library, Throw Invaluable Materials in Trash appeared first on Futurism.",
    "link": "http://futurism.com/space/nasa-library-trash",
    "timestamp": "2026-01-02T19:54:56Z"
  },
  {
    "title": "China’s BYD Passes Tesla to Become World’s Top Electric Vehicle Manufacturer",
    "description": "China's BYD reported a 28% increase in sales for 2025, good enough to surpass Elon Musk's Tesla as the world's top EV manufacturer.\nThe post China’s BYD Passes Tesla to Become World’s Top Electric Vehicle Manufacturer appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2026/01/02/chinas-byd-passes-tesla-to-become-worlds-top-electric-vehicle-manufacturer/",
    "timestamp": "2026-01-02T19:54:50Z"
  },
  {
    "title": "The 14 global trends that will shape the climate in 2026",
    "description": "The future of the energy transition is being shaped by President Donald Trump’s climate policy rollbacks that favor fossil fuels — but also the life support for renewables and batteries paradoxical…",
    "link": "https://www.mercurynews.com/2026/01/02/the-14-global-trends-that-will-shape-the-climate-in-2026/",
    "timestamp": "2026-01-02T19:54:14Z"
  },
  {
    "title": "Kasich: Republicans Are in Trouble Because They Went Too 'Far Right'",
    "description": "Friday on \"MS NOW Reports,\" former Gov. John Kasich (R-OH) said Republicans are in trouble in the upcoming midterm election because they went too far right after President Donald Trump's 2024 win.\nThe post Kasich: Republicans Are in Trouble Because They Went …",
    "link": "https://www.breitbart.com/clips/2026/01/02/kasich-republicans-are-in-trouble-because-they-went-too-far-right/",
    "timestamp": "2026-01-02T19:53:04Z"
  },
  {
    "title": "Grok is undressing anyone, including minors",
    "description": "xAI's Grok is removing clothing from pictures of people without their consent following this week's rollout of a feature that allows X users to instantly edit any image using the bot without needing the original poster's permission. Not only does the original…",
    "link": "https://www.theverge.com/news/853191/grok-explicit-bikini-pictures-minors",
    "timestamp": "2026-01-02T19:52:34Z"
  },
  {
    "title": "Report: Israel weighs Lebanon operation as Hezbollah rebuilds under ceasefire",
    "description": "Israel is weighing a Lebanon operation as Hezbollah rebuilds under the ceasefire. Netanyahu discussed expanded strikes with Trump, while US officials urge waiting to allow further talks with Beirut.",
    "link": "https://www.israelnationalnews.com/news/420313",
    "timestamp": "2026-01-02T19:52:07Z"
  },
  {
    "title": "Report: Iran Using Venezuela to Install Drone Tech in Western Hemisphere",
    "description": "Iran is using Venezuela as a launching point in the Western Hemisphere to embed its drone pipeline closer to U.S. territory, the Center for a Secure Free Society (SFS) warned this week.\nThe post Report: Iran Using Venezuela to Install Drone Tech in Western He…",
    "link": "https://www.breitbart.com/national-security/2026/01/02/report-iran-using-venezuela-to-install-drone-tech-in-western-hemisphere/",
    "timestamp": "2026-01-02T19:45:28Z"
  },
  {
    "title": "Judge orders accused Jan 6 pipe bomber to remain in custody pending trial",
    "description": "Brian Cole, accused of planting pipe bombs outside RNC and DNC headquarters in Washington, will be held in custody pending trial after Friday's decision.",
    "link": "https://www.foxnews.com/us/judge-orders-accused-jan-6-pipe-bomber-remain-custody-pending-trial",
    "timestamp": "2026-01-02T19:44:52Z"
  },
  {
    "title": "Hakeem Jeffries calls for investigation into Trump health",
    "description": "When asked about a potential investigation, Jeffries said said it is not “something that should wait“ until after the midterms.",
    "link": "https://www.newsweek.com/hakeem-jeffries-calls-for-investigation-into-trump-health-11299731",
    "timestamp": "2026-01-02T19:43:35Z"
  },
  {
    "title": "Trump addresses health rumors",
    "description": "The US media has increasingly questioned the president’s health and age after he exhibited visible bruising on his hands Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630354-trump-addresses-health-rumors/",
    "timestamp": "2026-01-02T19:43:33Z"
  },
  {
    "title": "Trump's golf obsession could smash Obama's 8-year tally in just one term",
    "description": "President Donald Trump hit the greens again this week on the taxpayers' dime as a new report found he visited his golf clubs a staggering 88 times in 2025, more than a quarter of the days he's spent in the White House.Trump, an avid golfer, didn't waste a sec…",
    "link": "https://www.rawstory.com/trump-golf-2674843727/",
    "timestamp": "2026-01-02T19:41:40Z"
  },
  {
    "title": "People Spent the Holidays Asking Grok to Generate Sexual Images of Children",
    "description": "Elon Musk's xAI has largely been silent on the matter, but some authorities have noticed.",
    "link": "https://gizmodo.com/people-spent-the-holidays-asking-grok-to-generate-sexual-images-of-children-2000704919",
    "timestamp": "2026-01-02T19:40:06Z"
  },
  {
    "title": "Trump Ending Automatic Green Cards for Migrants Marrying U.S. Citizens",
    "description": "Immigration lawyers are warning that federal agencies are increasingly skeptical when migrants claim to have married Americans.\nThe post Trump Ending Automatic Green Cards for Migrants Marrying U.S. Citizens appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2026/01/02/trump-ending-automatic-green-cards-for-migrants-marrying-u-s-citizens/",
    "timestamp": "2026-01-02T19:39:28Z"
  },
  {
    "title": "Census battle: How this lawsuit could change political power in Congress",
    "description": "Bureaucrats admit undercounting Republicans, overcounting Democrats",
    "link": "https://www.wnd.com/2026/01/census-battle-how-this-lawsuit-could-change-political/",
    "timestamp": "2026-01-02T19:32:20Z"
  },
  {
    "title": "Over 140,000 New Yorkers face 38% health premium hike as federal tax credits expire - NewsBreak",
    "description": "New York (WRGB) — Governor Hochul is criticizing Congressional Republicans for the failure to extend federal premium tax credits, which expired on Dec. 31,",
    "link": "https://www.newsbreak.com/share/4422761616611-over-140-000-new-yorkers-face-38-health-premium-hike-as-federal-tax-credits-expire?_f=app_share&amp;pd=0JcMU8B3&amp;lang=en_US&amp;send_time=1767382141&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.36.0.14%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-02T19:30:22Z"
  },
  {
    "title": "Trump Changes His Story About MRI As Questions Grow About His Health",
    "description": "Donald Trump felt compelled by the growing questions and public pressure surrounding his apparent declining health. The president changed his story on getting an MRI.",
    "link": "https://www.politicususa.com/p/trump-changes-his-story-about-mri",
    "timestamp": "2026-01-02T19:29:24Z"
  },
  {
    "title": "Canadian furniture, cabinet industry still ‘reeling’ after Trump pauses tariff spike",
    "description": "WASHINGTON — The Canadian Kitchen Cabinet Association says while it welcomes U.S. President Donald Trump’s postponement of tariff increases on furniture, cabinets and vanities, the industry is still being devastated by the duties. Trump hit the sector with 25…",
    "link": "https://financialpost.com/pmn/canadian-furniture-cabinet-industry-still-reeling-after-trump-pauses-tariff-spike",
    "timestamp": "2026-01-02T19:26:37Z"
  },
  {
    "title": "Iran crackdown rattles Middle East as analysts weigh US options short of military intervention",
    "description": "Trump threatens U.S. intervention if Iran violently suppresses ongoing protests, escalating tensions after last year's 12-day war between Israel and Iran.",
    "link": "https://www.foxnews.com/politics/iran-crackdown-rattles-middle-east-analysts-weigh-us-options-short-military-intervention",
    "timestamp": "2026-01-02T19:25:21Z"
  },
  {
    "title": "ICE Is Targeting a New Demographic for Recruitment: The Manosphere",
    "description": "The powers that be at U.S. Immigration and Customs Enforcement are planning on a massive recruitment drive in 2026—but the people they’re hoping to attract aren’t your typical feds.The deportation agency has earmarked $100 million for online advertisements ov…",
    "link": "https://newrepublic.com/post/204875/ice-recruitment-manosphere-gun-shows",
    "timestamp": "2026-01-02T19:21:27Z"
  },
  {
    "title": "Trump warned he's at risk of internal bleeding as he ignores his doctors",
    "description": "Reacting to Donald Trump’s admission that he consumes daily doses of aspirin well beyond what his doctors have recommended, Dr. Vin Gupta told an MS NOW host on Friday that the president’s bid to have as thin a blood as possible likely will lead to added heal…",
    "link": "https://www.rawstory.com/trump-health-aspirin/",
    "timestamp": "2026-01-02T19:18:29Z"
  },
  {
    "title": "Trump Wants to Remake the ‘President’s Golf Course’",
    "description": "“President Donald Trump has spent much of his two-week vacation in Florida golfing. But when he gets back to the White House, there’s a military golf course that he’s never played that he’s eyeing for a major construction project,” the AP reports. “Long a fav…",
    "link": "https://politicalwire.com/2026/01/02/trump-wants-to-remake-the-presidents-golf-course/",
    "timestamp": "2026-01-02T19:18:25Z"
  },
  {
    "title": "Trump’s ‘Operation Iranian Freedom’",
    "description": "How many foreign wars does the “America First” president intend to start?",
    "link": "https://www.theatlantic.com/ideas/2026/01/trump-threatens-iran-regime-change-red-line/685476/",
    "timestamp": "2026-01-02T19:17:08Z"
  },
  {
    "title": "Trump DOJ demands Minnesota voting records over same-day registration 'vouching' concerns",
    "description": "The Trump DOJ demands Minnesota voter records amid concerns over a same-day \"vouching\" policy allowing voters to register up to eight others.",
    "link": "https://www.foxnews.com/politics/trump-doj-demands-minnesota-voting-records-over-same-day-registration-vouching-concerns",
    "timestamp": "2026-01-02T19:16:11Z"
  },
  {
    "title": "Republicans Push Back on Trump's Vow to Intervene in Iran: 'We Have Problems At Home'",
    "description": "Figures like Georgia representative Marjorie Taylor Greene and Thomas Massie of Kentucky have served as critics of Trump within his own party.",
    "link": "https://www.ibtimes.com/republicans-push-back-trumps-vow-intervene-iran-we-have-problems-home-3794215",
    "timestamp": "2026-01-02T19:15:38Z"
  },
  {
    "title": "Steve Bannon Says Donald Trump Using Hillary Clinton's Playbook",
    "description": "Bannon said America had its own issues to deal with and should not be getting involved in other nations’ issues.",
    "link": "https://biztoc.com/x/ebd72c8dc126602e",
    "timestamp": "2026-01-02T19:13:55Z"
  },
  {
    "title": "Pregnant Migrants May Suffer Complications From Chronic Stress of ICE Raids",
    "description": "One OB-GYN has already noted “more pre-term births, more hypertension complications, and more postpartum depression.”…",
    "link": "https://rewirenewsgroup.com/2025/12/17/ice-pregnant-immigration-raids-stress-complications/",
    "timestamp": "2026-01-02T19:13:09Z"
  },
  {
    "title": "Marjorie Taylor Greene Rips Trump’s Iran Threat",
    "description": "Rep. Marjorie Taylor Greene (R-GA) attacked President Donald Trump on Friday over his message of solidarity with the pro-democracy protests gripping Iran, Mediaite reports. Said Greene: “An Israeli cybersecurity billionaire demanding to take away Americans gu…",
    "link": "https://politicalwire.com/2026/01/02/marjorie-taylor-greene-rips-trumps-iran-threat/",
    "timestamp": "2026-01-02T19:12:57Z"
  },
  {
    "title": "Tech campaigner decries US ‘punishment’ after visa sanctions",
    "description": "British tech campaigner Imran Ahmed on Friday decried a US visa ban as “punishment” for his organization’s work combating disinformation and holding major online platforms accountable, telling AFP that Washington’s actions amounted to “tyrannical behavior.” A…",
    "link": "https://www.digitaljournal.com/world/tech-campaigner-decries-us-punishment-after-visa-sanctions/article",
    "timestamp": "2026-01-02T19:12:20Z"
  },
  {
    "title": "Trump Keeps Posting About Dead Birds After Story on His Rapid Decline",
    "description": "Just one day after a bombshell Wall Street Journal story on the president’s growing signs of aging, Donald Trump went on a bizarre posting spree about dead birds and wind turbines.Throughout Friday, Trump posted several different photos on Truth Social of dea…",
    "link": "https://newrepublic.com/post/204871/trump-dead-birds-story-rapid-decline-aging",
    "timestamp": "2026-01-02T19:10:25Z"
  },
  {
    "title": "Exclusive -- Alex Bruesewitz: Our Reach 'Is Second to None' as Team Trump Accounts See 5.3 Billion Views in 2025",
    "description": "Team Trump social media accounts dominated the internet in 2025 with a total of 5.3 billion views across platforms and 13 million new followers.\nThe post Exclusive — Alex Bruesewitz: Our Reach ‘Is Second to None’ as Team Trump Accounts See 5.3 Billion Views i…",
    "link": "https://www.breitbart.com/politics/2026/01/02/exclusive-alex-bruesewitz-our-reach-is-second-to-none-as-team-trump-accounts-see-5-3-billion-views-in-2025/",
    "timestamp": "2026-01-02T19:06:59Z"
  },
  {
    "title": "Three Home Goods Stocks Rally As Trump Delays Furniture Tariffs",
    "description": "Some home goods stocks rose close to 10% after President Donald Trump delayed furniture tariffs set to go into effect on Jan. 1.\nThe post Three Home Goods Stocks Rally As Trump Delays Furniture Tariffs appeared first on Investor's Business Daily.",
    "link": "https://biztoc.com/x/c4ebc7fe6619e3af",
    "timestamp": "2026-01-02T19:03:21Z"
  },
  {
    "title": "George Clooney turns Trump’s words against him after he slated ‘mediocre’ actor for new French citizenship",
    "description": "Clooney and Trump have long been trading public jabs",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/george-clooney-trump-feud-french-citizenship-b2893708.html",
    "timestamp": "2026-01-02T19:03:01Z"
  },
  {
    "title": "US authorities arrest 18-year-old accused of plotting ISIL-inspired attack",
    "description": "Officials announced the suspect has been charged with attempting to provide 'material support' for 'terrorism'.",
    "link": "https://www.aljazeera.com/news/2026/1/2/us-authorities-arrest-18-year-old-accused-of-plotting-isil-inspired-attack",
    "timestamp": "2026-01-02T19:02:38Z"
  },
  {
    "title": "Trump’s super PAC builds $300 million cash stockpile, fueling unrivaled fundraising pace | CNN Politics",
    "description": "A super PAC aligned with President Donald Trump has built more than $304 million in cash reserves that it can deploy to help shape this year’s midterm elections, according to information released Friday by the political committee.",
    "link": "https://www.cnn.com/2026/01/02/politics/trump-super-pac-maga-inc-fundraising",
    "timestamp": "2026-01-02T19:00:27Z"
  },
  {
    "title": "Trump is planning to revamp the ‘president’s golf course’",
    "description": "President Donald Trump has spent much of his two-week vacation in Florida golfing. But when he gets back to the White House, there’s a military golf course that he’s never played that he’s eyeing for a major construction project.\n\n\n\nLong a favored getaway for…",
    "link": "https://apnews.com/article/golf-course-renovation-andrews-trump-nicklaus-53ad20f9d1fe4661b109c102f428d112",
    "timestamp": "2026-01-02T19:00:00Z"
  },
  {
    "title": "Top Dem Hakeem Jeffries Demands Congress Investigate Trump’s Health Lies",
    "description": "Top Dem Hakeem Jeffries Demands Congress Investigate Trump’s Health Liesthedailybeast.com",
    "link": "https://www.thedailybeast.com/top-dem-hakeem-jeffries-demands-congress-investigate-trumps-health-lies/",
    "timestamp": "2026-01-02T18:57:45Z"
  },
  {
    "title": "Zelenskyy Promotes Ukraine’s Top Spy Following Corruption Scandal",
    "description": "Ukrainian President Volodymyr Zelenskyy promoted the head of the country’s military intelligence agency to serve as his new chief of staff on Friday — filling a vacancy left by an alleged $100 million corruption scandal. Zelenskyy’s new top aide, Gen. Kyrylo …",
    "link": "https://dailycaller.com/2026/01/02/zelenskyy-kyrylo-budanov-spy-corruption-scandal/",
    "timestamp": "2026-01-02T18:56:24Z"
  },
  {
    "title": "What could stop Democrats from flipping control of Congress",
    "description": "Far-left challenging establishment for control of party in multiple locations",
    "link": "https://www.wnd.com/2026/01/what-could-stop-democrats-flipping-control-congress/",
    "timestamp": "2026-01-02T18:54:02Z"
  },
  {
    "title": "Bitfinex hacker Ilya Lichtenstein credits Trump’s First Step Act for early prison release",
    "description": "The hacker, who pleaded guilty to stealing and laundering nearly 120,000 bitcoin from Bitfinex, said sentence-reduction provisions, not a pardon, led to his release after serving about 14 months.",
    "link": "https://www.coindesk.com/tech/2026/01/02/crypto-hacker-ilya-lichtenstein-credits-trump-s-first-step-act-for-early-prison-release",
    "timestamp": "2026-01-02T18:50:43Z"
  },
  {
    "title": "How did a YouTuber stop federal funding to Minnesota?",
    "description": "And can Zohran Mamdani keep up the momentum as New York mayor?",
    "link": "https://www.bbc.co.uk/sounds/play/p0mrt4yz",
    "timestamp": "2026-01-02T18:50:00Z"
  },
  {
    "title": "‘I got moist eyed’: 8 times liberals literally cried in 2025",
    "description": "Crying jags prompted by Donald Trump's return to the White House",
    "link": "https://www.wnd.com/2026/01/8-times-liberals-literally-cried-2025/",
    "timestamp": "2026-01-02T18:46:44Z"
  },
  {
    "title": "Rolls-Royce revs up customized cars for super rich as EV demand drops",
    "description": "Rolls-Royce is adjusting its electric vehicle plans. Sales of its first electric car, the Spectre, have slowed. The company will continue to build V12 engine cars. This shift aligns with other European automakers. Rolls-Royce will focus on customer demand and…",
    "link": "https://economictimes.indiatimes.com/news/international/business/rolls-royce-revs-up-customized-cars-for-super-rich-as-ev-demand-drops/articleshow/126312210.cms",
    "timestamp": "2026-01-02T18:46:14Z"
  },
  {
    "title": "Rolls-Royce revs up custom cars for super rich as EV demand drops",
    "description": "Early enthusiasm has waned for Rolls-Royce's Spectre, which can reach 60 miles per hour in 4.4 seconds, and sales have slumped. Read more.",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/rolls-royce-custom-cars-super-rich-ev-demand",
    "timestamp": "2026-01-02T18:44:55Z"
  },
  {
    "title": "MS NOW host laughs at Trump being sadly left 'alone in his bedroom' to tweet away",
    "description": "An MS NOW report on Donald Trump’s saber-rattling at Iran led to a moment of levity when national security editor David Rohde made a glib remark about the president sleeping “alone.”Ensconced at his Mar-a-Lago resort for the holidays with his wife Melania, th…",
    "link": "https://www.rawstory.com/trump-alone-in-bedroom/",
    "timestamp": "2026-01-02T18:42:19Z"
  },
  {
    "title": "Stephen Schwartz Says He Won’t Participate In Planned Kennedy Center Event After Trump’s Changes",
    "description": "Stephen Schwartz said that he will not be part of a planned May event at the Kennedy Center after its board voted last month to add Donald Trump’s name to the venue. Schwartz, the composer/lyricist of Wicked, had been on the bill to host the Washington Nation…",
    "link": "http://deadline.com/2026/01/stephen-schwartz-kennedy-center-trump-1236660398/",
    "timestamp": "2026-01-02T18:39:05Z"
  },
  {
    "title": "‘Perfect health’: Trump explains medical test results, cognitive exam",
    "description": "Had CT scan, not MRI, and doctors suggest his condition is that of someone 14 years younger",
    "link": "https://www.wnd.com/2026/01/perfect-health-trump-explains-medical-test-results-cognitive/",
    "timestamp": "2026-01-02T18:34:34Z"
  },
  {
    "title": "SBA Suspends 6900 Borrowers for $400 Million in Suspected Fraudulent Business Loans in Minnesota",
    "description": "More charges of deceitful exploitation of federal government programs continue to emerge in Minnesota with the Small Business Administration (SBA) announcing Thursday it has suspended 6,900 borrowers after finding widespread suspected fraud in pandemic-era lo…",
    "link": "https://www.breitbart.com/law-and-order/2026/01/02/sba-suspends-6900-borrowers-over-400-million-in-suspected-fraudulent-business-loans-in-minnesota/",
    "timestamp": "2026-01-02T18:34:06Z"
  },
  {
    "title": "Marjorie Taylor Greene Rips Trump’s Iran Threat as ‘Everything We Voted Against in ’24’",
    "description": "\"President Trump threatening war and sending in troops to Iran is everything we voted against in ‘24.”\nThe post Marjorie Taylor Greene Rips Trump’s Iran Threat as ‘Everything We Voted Against in ’24’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/marjorie-taylor-greene-rips-trumps-iran-threat-as-everything-we-voted-against-in-24/",
    "timestamp": "2026-01-02T18:32:40Z"
  },
  {
    "title": "Want to Protect Our Democracy? Here Are Three Key Mental Habits.",
    "description": "Long after Trump is gone, the damage will remain. Each of us needs to find a path back.",
    "link": "https://slate.com/news-and-politics/2026/01/trump-democracy-fascism-mental-habits.html",
    "timestamp": "2026-01-02T18:31:49Z"
  },
  {
    "title": "Netanyahu is pushing for another U.S. intervention in Iran. Will Trump take the bait?",
    "description": "Days after his meeting with Israeli Prime Minister Netanyahu, President Trump threatened to intervene in Iran if the country killed any protesters. We broke down recent events and whether another U.S.-Israeli aggression on Iran may be on the horizon.",
    "link": "https://mondoweiss.net/2026/01/netanyahu-is-pushing-for-another-u-s-intervention-in-iran-will-trump-take-the-bait/",
    "timestamp": "2026-01-02T18:31:39Z"
  },
  {
    "title": "Stephen Schwartz Pulls Out of Kennedy Center Lineup, Condemns Renaming: ‘There’s No Way I Would Set Foot In It Now’",
    "description": "“It no longer represents the apolitical place for free artistic expression it was founded to be,\" the \"Wicked\" composer writes\nThe post Stephen Schwartz Pulls Out of Kennedy Center Lineup, Condemns Renaming: ‘There’s No Way I Would Set Foot In It Now’ appeare…",
    "link": "https://www.thewrap.com/culture-lifestyle/culture/stephen-schwartz-pulls-out-kennedy-center-lineup-condemns-renaming/",
    "timestamp": "2026-01-02T18:30:53Z"
  },
  {
    "title": "Zelensky Claims The “Coalition of the Willing” Is Discussing Sending Troop To Ukraine",
    "description": "Ukraine's ruler, Volodymyr Zelensky, has claimed that the United States is discussing sending troops to the conflict. “Of course, we are discussing this with President Trump and with representatives of the ‘coalition of the willing.’ We would like this,” Zele…",
    "link": "https://www.shtfplan.com/war/zelensky-claims-the-coalition-of-the-willing-is-discussing-sending-troop-to-ukraine",
    "timestamp": "2026-01-02T18:30:53Z"
  },
  {
    "title": "SEC’s Crenshaw set to depart, leaving US financial watchdog all Republican",
    "description": "Leaving two empty Democratic seats at the SEC, Caroline Crenshaw's last day will be Jan. 3, having served 18 months beyond the end of her term.",
    "link": "https://cointelegraph.com/news/sec-commissioner-caroline-crenshaw-term-ending",
    "timestamp": "2026-01-02T18:30:33Z"
  },
  {
    "title": "Where Is the US Economy Headed in 2026?",
    "description": "The Big Picture\nIf you ask US President Donald Trump, his first year back in office has been a roaring success. But, while 2025 did not prove as economically catastrophic as many predicted, even Trump’s own supporters are increasingly frustrated, with afforda…",
    "link": "https://biztoc.com/x/8b65b6f365b3ed6d",
    "timestamp": "2026-01-02T18:30:10Z"
  },
  {
    "title": "Trump Reveals New Details About His Health After Limping Into New Years Eve Bash",
    "description": "The U.S. president claimed in a detailed interview with The Wall Street Journal that he takes a higher dose of aspirin every day than his doctors recommend.",
    "link": "https://www.ibtimes.com/trump-reveals-new-details-about-his-health-after-limping-new-years-eve-bash-3794212",
    "timestamp": "2026-01-02T18:29:49Z"
  },
  {
    "title": "‘We are locked and loaded’: Trump threatens Iran over treatment of protesters",
    "description": "One of Donald Trump’s most controversial foreign policy decisions of 2025 came in June, when the president launched a preventive military strike on suspected Iranian nuclear sites. Soon after, the Republican assured the public that Iran’s “key nuclear enrichm…",
    "link": "https://biztoc.com/x/37ace4ea40f71e39",
    "timestamp": "2026-01-02T18:29:48Z"
  },
  {
    "title": "White House ballroom: Trump shops for marble in Florida",
    "description": "President Donald Trump spent his Friday morning perusing samples of stone in Florida for the new White House ballroom, as he pushes ahead on a controversial effort to replace the East Wing.",
    "link": "https://www.cnn.com/2026/01/02/politics/white-house-ballroom-marble-trump",
    "timestamp": "2026-01-02T18:27:24Z"
  },
  {
    "title": "California law gives state more power over workplaces. Trump suing to block it",
    "description": "Backed by California unions, it gives a state board the right to regulate working conditions and labor rights as the federal labor board’s fate is in limbo.",
    "link": "https://www.ocregister.com/2026/01/02/a-new-california-law-gives-the-state-more-power-over-workplaces-trump-is-suing-to-block-it/",
    "timestamp": "2026-01-02T18:27:21Z"
  },
  {
    "title": "Jan 6 pipe bomb suspect to remain in jail ahead of trial",
    "description": "Brian J. Cole Jr. allegedly told investigators that ‘something just snapped,’ according to a new filing",
    "link": "https://www.the-independent.com/news/world/americas/crime/jan-6-pipe-bomb-suspect-brian-cole-jail-b2892331.html",
    "timestamp": "2026-01-02T18:20:37Z"
  },
  {
    "title": "Golf Legend Phil Mickelson Rips California's Massive Welfare Fraud",
    "description": "Along with reporting of fraud in Minnesota, pro golf legend Phil Mickelson doesn't want anyone to forget that the fraud in California.\nThe post Golf Legend Phil Mickelson Rips California’s Massive Welfare Fraud appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/01/02/golf-legend-phil-mickelson-rips-californias-massive-welfare-fraud/",
    "timestamp": "2026-01-02T18:16:56Z"
  },
  {
    "title": "XRP price in action today jumps over 6% — can XRP really reach $8 by 2026? Here’s what Standard Chartered says in its 2026 forecast",
    "description": "XRP price is moving again. The token jumped more than 6% today. Standard Chartered says XRP could climb to $8 by 2026. The bank argues that XRP is entering a new phase after years of legal overhang. According to its research, XRP’s upside comes from demand pr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/xrp-price-in-action-today-jumps-over-6-can-xrp-really-reach-8-by-2026-heres-what-standard-chartered-says-in-its-2026-forecast/articleshow/126311085.cms",
    "timestamp": "2026-01-02T18:16:15Z"
  },
  {
    "title": "Steve Bannon Compares Trump to Hillary Clinton in Stunning Attack",
    "description": "former White House chief strategist Steve Bannon compared President Donald Trump to Hillary Clinton in a scathing attack on his old boss on Friday.\nThe post Steve Bannon Compares Trump to Hillary Clinton in Stunning Attack first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/steve-bannon-compares-trump-to-hillary-clinton-in-stunning-attack/",
    "timestamp": "2026-01-02T18:15:40Z"
  },
  {
    "title": "George Clooney gets French citizenship — and another dust-up with Trump - NPR",
    "description": "George Clooney gets French citizenship — and another dust-up with TrumpNPR French government defends granting citizenship to George and Amal ClooneyAP News George Clooney and wife Amal granted French citizenshipThe Guardian George Clooney Fires Back After Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180503249",
    "timestamp": "2026-01-02T18:12:36Z"
  },
  {
    "title": "Trump gives away the game on his motivations for the first vetoes of his second term (Steve Benen/MS NOW)",
    "description": "Steve Benen / MS NOW:\nTrump gives away the game on his motivations for the first vetoes of his second term  —  After his first term in the White House, Donald Trump had issued fewer vetoes than any American president since Warren Harding, who served only two …",
    "link": "https://www.memeorandum.com/260102/p36",
    "timestamp": "2026-01-02T18:10:00Z"
  },
  {
    "title": "19 Of The Most Anticipated Reality Shows Of 2026",
    "description": "Dancing with the Stars had its biggest year in nearly a decade, Duck Dynasty and Ice Road Truckers returned, and the Chrisley family was back on television after being pardoned by the former host of The Apprentice. Suffice to say, 2025 was a strange year for …",
    "link": "https://deadline.com/lists/most-anticipated-reality-tv-shows-2026/",
    "timestamp": "2026-01-02T18:10:00Z"
  },
  {
    "title": "These House mavericks defied their own parties more than anyone else in 2025",
    "description": "House lawmakers broke party-line votes at varying rates, with Rep. Henry Cuellar leading Democrats at 24.1%, and Rep. Thomas Massie topping Republicans at 22.3%.",
    "link": "https://www.foxnews.com/politics/house-mavericks-defied-own-parties-more-than-anyone-else-2025",
    "timestamp": "2026-01-02T18:09:52Z"
  },
  {
    "title": "Donald Trump’s Health Raises Concerns as Nancy Pelosi Highlights His ‘Mental Incapacity’ - NewsBreak",
    "description": "California Rep. Nancy Pelosi said she skipped watching President Donald Trump’s primetime speech last month for a reason that may already be known to peopl",
    "link": "https://www.newsbreak.com/share/4422104210748-donald-trump-s-health-raises-concerns-as-nancy-pelosi-highlights-his-mental-incapacity?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NjczNzcyOTIzMDQ%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1767377292&amp;actBtn=cardBottom&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.52.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-02T18:09:29Z"
  },
  {
    "title": "European shares hit record high in first trading day of 2026",
    "description": "Iseq All-Share reaches all-time high and FTSE 100 briefly breaches 10,000 for first time",
    "link": "https://www.irishtimes.com/business/2026/01/02/european-shares-hit-record-high-in-first-trading-day-of-2026/",
    "timestamp": "2026-01-02T18:06:34Z"
  },
  {
    "title": "How prediction markets have spread to politics",
    "description": "Everything’s a gamble",
    "link": "https://theweek.com/business/markets/prediction-markets-politics-gambling",
    "timestamp": "2026-01-02T18:05:01Z"
  },
  {
    "title": "Stunner! Poll shows young attending church MORE than seniors",
    "description": "'Showing spiritual curiosity and a desire for belonging'",
    "link": "https://www.wnd.com/2026/01/stunner-poll-shows-young-attending-church-more-than/",
    "timestamp": "2026-01-02T18:03:01Z"
  },
  {
    "title": "Two truths and a lie: inside the China-Taiwan-US triangle",
    "description": "The US has no intention of abandoning Taiwan. But it also has no intention of binding itself to an automatic war commitment on a timeline it does not control.",
    "link": "https://www.abc.net.au/news/2026-01-03/taiwan-china-united-states-military-triangle-lies/106189394",
    "timestamp": "2026-01-02T18:00:00Z"
  },
  {
    "title": "Iran threatens US troops after Trump backs protesters",
    "description": "Iran has threatened to attack American troops in the Middle East if Donald Trump follows through on his threat to intervene in ...",
    "link": "https://biztoc.com/x/309b376fe8c3e554",
    "timestamp": "2026-01-02T17:58:48Z"
  },
  {
    "title": "Trump “aces” yet another dementia screening test",
    "description": "Source: Donald J. Trump @realDonaldTrump The White House Doctors have just reported that I am in “PERFECT HEALTH,” and that I “ACED” (Meaning, was correct on 100% of the questions asked!), for the third straight time, my Cognitive Examination, something which…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/trump-aces-yet-another-dementia-screening-test",
    "timestamp": "2026-01-02T17:52:43Z"
  },
  {
    "title": "Trump’s Motorcade Reportedly Stops At a ‘Random’ FL Strip Mall So He Could Buy Marble For His Ballroom Project",
    "description": "Donald Trump reportedly ordered his motorcade to stop at a Florida strip mall Friday morning so he could purchase supplies for his White House ballroom.\nThe post Trump’s Motorcade Reportedly Stops At a ‘Random’ FL Strip Mall So He Could Buy Marble For His Bal…",
    "link": "https://www.mediaite.com/media/news/trumps-motorcade-reportedly-stops-at-a-random-fl-strip-mall-so-he-could-buy-marble-for-his-ballroom-project/",
    "timestamp": "2026-01-02T17:50:00Z"
  },
  {
    "title": "U.S. stocks fade on concern about ‘expensive’ S&P 500 metrics",
    "description": "U.S. stocks retreated Friday on worries about stretched valuations despite optimism on signs Donald Trump was easing up on tariffs. Read on.",
    "link": "https://financialpost.com/investing/us-stocks-fade-on-concern-about-expensive-sp-500-metrics",
    "timestamp": "2026-01-02T17:49:02Z"
  }
]