[
  {
    "title": "Trump’s big bill advances in rare weekend vote, but conservatives demand more changes",
    "description": "Deficit hawks who had blocked the measure two days earlier are still dissatisfied and want steeper spending cuts.",
    "link": "https://www.bostonherald.com/2025/05/19/trump-budget-bill-clears-hurdle/",
    "timestamp": "2025-05-19T11:42:47Z"
  },
  {
    "title": "US Sidelining Israel: Trump’s Middle East Balancing Act, “Leverage Gamble”",
    "description": "Is US President Donald Trump doing a “balancing act” of sorts in the Middle East? His latest gestures towards the Saudis and Qatar, and even surprising statements about pressuring Israel into allowing humanitarian aid to get to Palestine clearly suggest …\nThe…",
    "link": "https://www.globalresearch.ca/us-sidelining-israel-trump-middle-east-leverage-gamble/5887544",
    "timestamp": "2025-05-19T11:40:41Z"
  },
  {
    "title": "Walmart to hike prices: How much will consumers have to pay if it doesn't 'eat tariffs' as Trump wants?",
    "description": "Walmart is preparing to increase prices on various items due to rising import costs from tariffs, despite a temporary reduction on Chinese goods. CFO John David Rainey indicated that shoppers will see noticeable price increases soon, affecting goods from elec…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/walmart-to-hike-prices-how-much-will-consumers-have-to-pay-if-it-doesnt-eat-tariffs-as-trump-wants/articleshow/121268516.cms",
    "timestamp": "2025-05-19T11:39:46Z"
  },
  {
    "title": "Joe Biden releases first statement after being diagnosed with ‘aggressive’ form of prostate cancer",
    "description": "The former president's office announced the diagnosis yesterday",
    "link": "https://www.ladbible.com/news/us-news/joe-biden-cancer-statement-prostate-aggressive-326820-20250519",
    "timestamp": "2025-05-19T11:39:03Z"
  },
  {
    "title": "Trump to press Putin to end 'bloodbath' in Ukraine",
    "description": "U.S. President Donald Trump will speak separately with Vladimir Putin and Volodymyr Zelenskyy in hopes of ending the \"bloodbath\" in Ukraine.",
    "link": "https://www.cnbc.com/2025/05/19/trump-to-press-putin-to-end-bloodbath-in-ukraine.html",
    "timestamp": "2025-05-19T11:38:28Z"
  },
  {
    "title": "Russia bombards Ukraine with drones hours after Trump announces talks with Putin",
    "description": "Russia fired 273 exploding drones at multiple regions of Ukraine after President Donald Trump announced he would be speaking with Vladimir Putin on Monday.",
    "link": "https://www.foxnews.com/world/russia-bombards-ukraine-drones-hours-after-trump-announces-talks-putin",
    "timestamp": "2025-05-19T11:38:24Z"
  },
  {
    "title": "Enrichment Remains Key Sticking Point in U.S.-Iran Negotiations",
    "description": "The U.S.-Iran talks on a nuclear deal “will lead nowhere” if the United States continues to insist that Iran halts uranium enrichment, a top Iranian official said on Monday.   “Our position on enrichment is clear and we have repeatedly stated that it is a nat…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Enrichment-Remains-Key-Sticking-Point-in-US-Iran-Negotiations.html",
    "timestamp": "2025-05-19T11:38:14Z"
  },
  {
    "title": "President Joe Biden has been diagnosed with an ‘aggressive’ prostate cancer",
    "description": "President Joe Biden has been diagnosed with prostate cancer. His office announced his diagnosis on Sunday, after weeks of the Beltway media and various Democrats desperately trying to relitigate everything that happened in 2024. There’s been an obscene focus …",
    "link": "https://www.celebitchy.com/922889/president_joe_biden_has_been_diagnosed_with_an_aggressive_prostate_cancer/",
    "timestamp": "2025-05-19T11:35:18Z"
  },
  {
    "title": "Nuclear hypersonic missiles from space: US faces its biggest threat from Chinese, Russian FOBS",
    "description": "A recent assessment by the US Defense Intelligence Agency paints a grim picture for  the Americans. The threats from China and Russia is increasing with the former, too, now in a position to hit target all across the US mainland. The large variety of missiles…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nuclear-hypersonic-missiles-from-space-us-faces-its-biggest-threat-from-chinese-russian-fobs/articleshow/121268537.cms",
    "timestamp": "2025-05-19T11:34:23Z"
  },
  {
    "title": "Russia strikes Ukraine ahead of Putin-Trump ceasefire talks",
    "description": "Moscow launched hundreds of drones on Ukraine, the biggest such attack in three years, just hours before a crucial phone call between President Donald Trump and Russian President Vladimir Putin. NBC’s Keir Simmons reports for TODAY.",
    "link": "https://www.today.com/video/russia-strikes-ukraine-ahead-of-putin-trump-ceasefire-talks-239866949505",
    "timestamp": "2025-05-19T11:33:52Z"
  },
  {
    "title": "Nvidia to Build AI Supercomputer and New HQ in Taiwan",
    "description": "The chip manufacturer is set to power Taiwan’s next-gen sovereign AI projects as it deepens its global research footprint.",
    "link": "https://decrypt.co/320840/nvidia-to-build-ai-supercomputer-and-new-hq-in-taiwan",
    "timestamp": "2025-05-19T11:33:42Z"
  },
  {
    "title": "Trump to call Putin in push for Ukraine ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia’s Vladimir Putin as part of the US leader’s effort to end the grinding war set off by Moscow’s 2022 invasion of Ukraine. Trump had vowed during his US election campaign to halt the conflict within a day of t…",
    "link": "https://www.digitaljournal.com/world/trump-to-call-putin-in-push-for-ukraine-ceasefire/article",
    "timestamp": "2025-05-19T11:33:18Z"
  },
  {
    "title": "EU relief as centrist wins Romania vote but tensions remain",
    "description": "Romania’s newly elected president Nicusor Dan on Monday faced an uphill task to bring together a deeply divided country after a tense rerun vote, with Brussels and other European allies welcoming the victory of the centrist. Dan, the pro-EU mayor of Bucharest…",
    "link": "https://www.digitaljournal.com/world/eu-relief-as-centrist-wins-romania-vote-but-tensions-remain/article",
    "timestamp": "2025-05-19T11:33:18Z"
  },
  {
    "title": "Joe Biden and Other World Leaders Battling Cancer in 2025",
    "description": "Former U.S. President Joe Biden was diagnosed with an aggressive form of prostate cancer on May 16,2025 after experiencing urinary symptoms.",
    "link": "https://thekenyatimes.com/health/joe-biden-and-other-prominent-world-leaders-battling-cancer-in-2025/",
    "timestamp": "2025-05-19T11:32:35Z"
  },
  {
    "title": "Trump hopes for ceasefire progress in Russia-Ukraine war in Monday calls with Putin and Zelenskyy",
    "description": "President Trump is scheduled to speak with both sides of the Russia Ukraine war on Monday.",
    "link": "https://www.bostonherald.com/2025/05/19/trump-putin-zelenskyy-monday-calls/",
    "timestamp": "2025-05-19T11:31:58Z"
  },
  {
    "title": "Mark Cuban Sounds Alarm On Tariffs: Here's His 4 Word Warning To American Consumers",
    "description": "Entrepreneur and investor Mark Cuban doesn't often hold back when sharing his opinion with investors or other entrepreneurs on social media or while he's on ...",
    "link": "https://finance.yahoo.com/news/mark-cuban-sounds-alarm-tariffs-113152154.html",
    "timestamp": "2025-05-19T11:31:52Z"
  },
  {
    "title": "Trump calls for ‘major investigation’ into Harris campaign over celeb endorsements, Springsteen performance",
    "description": "In an early morning Truth Social post, the president slammed Harris for her celebrity-filled campaign events leading up to the November election.",
    "link": "https://nypost.com/2025/05/19/us-news/trump-calls-for-major-investigation-into-kamala-harris-campaign-paying-for-celebrity-endorsements/",
    "timestamp": "2025-05-19T11:30:28Z"
  },
  {
    "title": "Transcript: Trump’s Threats to Defy Courts Suddenly Get More Dangerous",
    "description": "The following is a lightly edited transcript of the May 19 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident …",
    "link": "https://newrepublic.com/article/195392/transcript-trump-threats-defy-courts-suddenly-get-dangerous",
    "timestamp": "2025-05-19T11:30:03Z"
  },
  {
    "title": "‘The Phoenician Scheme’ Director Wes Anderson Questions Trump Tariffs: “Does That Mean You Can Hold Up The Movie In Customs?”",
    "description": "Wes Anderson, who shot his fourth Cannes premiere, The Phoenician Scheme, at Studio Babelsberg in Germany, was called to the carpet in the press room about his thoughts on President Donald Trump’s suggested tariffs on film & TV imports. Said Anderson, “Tariff…",
    "link": "http://deadline.com/2025/05/donald-trump-tariffs-wes-anderson-cannes-1236404041/",
    "timestamp": "2025-05-19T11:27:32Z"
  },
  {
    "title": "Wes Anderson Mocks Trump’s Movie Tariffs at Cannes: ‘Can You Hold Up the Movie in Customs? It Doesn’t Ship That Way’",
    "description": "Wes Anderson skewered Donald Trump’s proposed foreign film tariff at a Cannes press conference for his new film “The Phoenician Scheme,” questioning how it will work. “Can you hold up the movie in customs? It doesn’t ship that way,” the director said, evoking…",
    "link": "https://variety.com/2025/film/festivals/wes-anderson-mocks-trumps-movie-tariffs-cannes-1236403035/",
    "timestamp": "2025-05-19T11:27:17Z"
  },
  {
    "title": "Polish centrist's narrow presidential lead sees pro-EU path hanging in the balance",
    "description": "Polish liberals performed worse than expected in a presidential election on Sunday, exit polls showed, as Rafal Trzaskowski from ruling centrists Civic Coalition scraped to victory setting up a close fight for Warsaw's pro-European path.",
    "link": "https://www.cbc.ca/news/world/poland-presidential-elections-1.7538472",
    "timestamp": "2025-05-19T11:27:11Z"
  },
  {
    "title": "No Water, No Peace: A Branding Playbook From The Football Pitch",
    "description": "Football for Peace demonstrates how authentic, purpose-led branding—rooted in belief, not buzzwords—can drive impact and unite the world through sport.",
    "link": "https://www.forbes.com/sites/jeetendrsehdev/2025/05/19/no-water-no-peace-a-branding-playbook-from-the-football-pitch/",
    "timestamp": "2025-05-19T11:26:08Z"
  },
  {
    "title": "‘Joe Biden Could Die in the Next 2 Months’—Trump Ally Laura Loomer Makes Bizarre Claim About Former President’s Health",
    "description": "Joe Biden has been diagnosed with an aggressive form of prostate cancer. Laura Loomer, a close ally of Donald Trump, made some shocking claims about the former president's health.",
    "link": "https://www.inquisitr.com/joe-biden-could-die-in-the-next-2-months-trump-ally-laura-loomer-makes-bizarre-claim-about-former-presidents-health",
    "timestamp": "2025-05-19T11:25:03Z"
  },
  {
    "title": "Global shares slide and US futures and dollar drop after Moody’s downgrade of US credit rating",
    "description": "The impact from Moody's downgrade of U.S. credit rating is being felt by markets early Monday.",
    "link": "https://www.denverpost.com/2025/05/19/stock-market-us-credit-rating/",
    "timestamp": "2025-05-19T11:23:46Z"
  },
  {
    "title": "Global shares slide and US futures and dollar drop after Moody’s downgrade of US credit rating",
    "description": "The impact from Moody's downgrade of U.S. credit rating is being felt by markets early Monday.",
    "link": "https://www.bostonherald.com/2025/05/19/stock-market-us-credit-rating/",
    "timestamp": "2025-05-19T11:23:46Z"
  },
  {
    "title": "In a life defined by tragedy, Biden the ‘fighter’ faces his latest test | CNN Politics",
    "description": "Former President Joe Biden’s cancer diagnosis marks the latest chapter in the family’s tragic history.",
    "link": "https://www.cnn.com/2025/05/19/politics/biden-cancer-tragedy-loss",
    "timestamp": "2025-05-19T11:22:27Z"
  },
  {
    "title": "Trump Wants Investigation Into Springsteen And Beyonce’s Endorsement Of Harris",
    "description": "The president continued his feud with singer Bruce Springsteen and claimed his performance at Kamala Harris’s campaign rally was a “MAJOR AND ILLEGAL CAMPAIGN CONTRIBUTION.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/05/19/trump-wants-investigation-into-springsteen-and-beyonces-endorsement-of-harris/",
    "timestamp": "2025-05-19T11:22:27Z"
  },
  {
    "title": "Biden has been diagnosed with aggressive prostate cancer",
    "description": "Former President Joe Biden has been diagnosed with prostate cancer, his office said Sunday.",
    "link": "https://www.wsoctv.com/news/local/biden-has-been-diagnosed-with-aggressive-prostate-cancer/WD6CKURYYFDF7JRTLFRALHAVA4/",
    "timestamp": "2025-05-19T11:21:16Z"
  },
  {
    "title": "EU Relief As Centrist Wins Romania Vote But Tensions Remain",
    "description": "Romania's newly elected president Nicusor Dan on Monday faced an uphill task to bring together a deeply divided country after a tense rerun vote, with Brussels and other European allies welcoming the victory of the centrist.",
    "link": "https://www.ibtimes.com/eu-relief-centrist-wins-romania-vote-tensions-remain-3773958",
    "timestamp": "2025-05-19T11:21:14Z"
  },
  {
    "title": "Britain Agrees To Trade, Defence Reset With EU",
    "description": "Britain agreed the most significant reset of defence and trade ties with the European Union since Brexit on Monday after US President Donald Trump&#039;s upending of the global order forced the two sides to move on from their acrimonious divorce.",
    "link": "https://www.ndtv.com/world-news/uk-eu-summit-britain-agrees-to-trade-defence-reset-with-eu-8453223",
    "timestamp": "2025-05-19T11:20:37Z"
  },
  {
    "title": "Kremlin reveals timing for Putin-Trump call",
    "description": "The conversation is scheduled for 5pm Moscow time and will be based on the results of recent talks in Istanbul, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617828-kremlin-reveals-timing-putin-trump-call/",
    "timestamp": "2025-05-19T11:20:23Z"
  },
  {
    "title": "Poland election cast as ‘battle to side with Europe’s democracies or troublemakers’",
    "description": "First-round presidential vote sees Donald Tusk’s candidate finish only 1.5 points ahead of populist rival",
    "link": "https://www.irishtimes.com/world/europe/2025/05/19/poland-election-cast-as-battle-to-side-with-europes-democracies-or-troublemakers/",
    "timestamp": "2025-05-19T11:20:22Z"
  },
  {
    "title": "'Second biggest scandal': Trump accused of new grift that puts Qatari plane in shade",
    "description": "WASHINGTON — A $400 million plane offered to President Donald Trump by Qatar\r\n may be a gaudy symbol of graft, but to some Democrats on Capitol Hill it’s also a distraction.As Trump settles back into Washington after a week in the Middle East, Democrats are g…",
    "link": "https://www.rawstory.com/raw-investigates/trump-qatar-plane-2672031382/",
    "timestamp": "2025-05-19T11:20:00Z"
  },
  {
    "title": "‘Tiger King’ Star Joe Exotic’s New Husband Deported Back to Mexico",
    "description": "According to reports, Tiger King star Joe Exotic’s newlywed husband, Jorge Flores Maldonado, has been deported to Mexico by ICE just hours after appearing in an immigration hearing. Maldonado, who was already serving time for immigration-related offenses, was…",
    "link": "https://mediatakeout.com/tiger-king-star-joe-exotics-new-husband-deported-back-to-mexico/",
    "timestamp": "2025-05-19T11:19:48Z"
  },
  {
    "title": "The UK and the EU announce new deals and renew ties, 5 years after Brexit",
    "description": "Britain and the EU have forged new agreements to enhance defence cooperation, streamline food trade, and ease border checks, marking a significant reset in post-Brexit relations. Prime Minister Keir Starmer semphasized that these deals aim to reduce red tape,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-uk-and-the-eu-announce-new-deals-and-renew-ties-5-years-after-brexit/articleshow/121268562.cms",
    "timestamp": "2025-05-19T11:18:37Z"
  },
  {
    "title": "Donald Trump: ‘Since I said ‘I hate Taylor Swift’, she’s no longer hot’",
    "description": "For the past week, America’s political journalism class has been single-mindedly devoted to one subject: the mental acuity of the President of the United States. Not the sitting president, mind you, not the orange guy who speaks in utter gibberish while turni…",
    "link": "https://www.celebitchy.com/922820/donald_trump_since_i_said_i_hate_taylor_swift_shes_no_longer_hot/",
    "timestamp": "2025-05-19T11:18:03Z"
  },
  {
    "title": "A Tiny Bank in Trump Tower Is Enriching the President’s Sons",
    "description": "",
    "link": "https://biztoc.com/x/0b09818a09ab82fe",
    "timestamp": "2025-05-19T11:16:41Z"
  },
  {
    "title": "Sam Altman defends Trump's AI chip deals with UAE and Saudi Arabia, calls critics \"naïve\"",
    "description": "During his tour of the area last week, Trump announced a series of agreements with Gulf states, particularly the United Arab Emirates (UAE) and Saudi Arabia, related to exporting AI chips and developing AI infrastructure.Read Entire Article",
    "link": "https://www.techspot.com/news/107964-sam-altman-defends-trump-ai-chip-deals-uae.html",
    "timestamp": "2025-05-19T11:15:00Z"
  },
  {
    "title": "Trump visit bolsters Saudi AI",
    "description": "A new AI datacentre is among the initiatives the White House announced during the president’s Middle East visits",
    "link": "https://www.computerweekly.com/news/366624095/Trump-visit-bolsters-Saudi-AI",
    "timestamp": "2025-05-19T11:15:00Z"
  },
  {
    "title": "US and Iran Clash Over Nuclear Red Lines",
    "description": "The U.S. and Iran remain locked in a standoff over uranium enrichment ahead of a potential new round nuclear talks.",
    "link": "https://www.newsweek.com/us-iran-clash-uranium-enrichment-nuclear-red-lines-2074003",
    "timestamp": "2025-05-19T11:13:49Z"
  },
  {
    "title": "Putin Heads Into Trump Call Confident",
    "description": "“Vladimir Putin believes he has a strong hand ahead of a phone call Monday with Donald Trump as European leaders are trying to prevent the US president from rushing through a deal,” Bloomberg reports. “Putin",
    "link": "https://politicalwire.com/2025/05/19/putin-heads-into-trump-call-confident/",
    "timestamp": "2025-05-19T11:12:56Z"
  },
  {
    "title": "Opinion: Trump's Durbar: Back To 'Pax Americana' In The Gulf?",
    "description": "For its sheer optics, Trump's Gulf tour was quite over the top, with his three hydrocarbon-rich hosts going overboard in offering him mega-deals.",
    "link": "https://www.ndtv.com/opinion/trumps-durbar-back-to-pax-americana-in-the-gulf-8453127",
    "timestamp": "2025-05-19T11:09:47Z"
  },
  {
    "title": "Gleason score 9: How aggressive is Biden’s prostrate cancer?",
    "description": "Biden, 82, has been diagnosed with prostate cancer, the most common form of cancer in US males.",
    "link": "https://www.aljazeera.com/news/2025/5/19/gleason-score-9-how-aggressive-is-bidens-prostrate-cancer",
    "timestamp": "2025-05-19T11:09:36Z"
  },
  {
    "title": "After 'Backroom Deal' to Make Medicaid Cuts Even Worse, GOP Passes Budget Bill Out of Committee",
    "description": "Republicans pushed their massive reconciliation bill through the House Budget Committee late Sunday after striking a deal with GOP hardliners who tanked a vote on the package late last week, complaining that the measure's proposed cuts to Medicaid and other p…",
    "link": "https://www.commondreams.org/news/house-budget-committee",
    "timestamp": "2025-05-19T11:05:49Z"
  },
  {
    "title": "Trade tensions drive consumers to cut back. 'Something has to give,' analyst says",
    "description": "After a bout of panic buying, more consumers are prepared to rein in their spending and live with less, recent studies show. Even President Donald Trump suggested that Americans should be comfortable with fewer things.\n\"[Americans] don't need to have 250 penc…",
    "link": "https://biztoc.com/x/5159b1d6be8e6683",
    "timestamp": "2025-05-19T11:05:29Z"
  },
  {
    "title": "Joe Biden cancer diagnosis and California fertility center bombing suspect: Morning Rundown",
    "description": "Biden is diagnosed with an aggressive form of prostate cancer.",
    "link": "https://www.nbcnews.com/news/us-news/joe-biden-cancer-fertility-center-bombing-morning-rundown-rcna207613",
    "timestamp": "2025-05-19T11:05:00Z"
  },
  {
    "title": "East Coast Citizen Groups Sue Over Unlawful Authorization of Empire Wind Project",
    "description": "Meanwhile, 17 states sue Trump administration for blocking the development of wind energy and 2 dead whales wash up on Rhode Island shores.\nThe post East Coast Citizen Groups Sue Over Unlawful Authorization of Empire Wind Project first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/05/east-coast-citizen-groups-sue-over-unlawful-authorization-of-empire-wind-project/",
    "timestamp": "2025-05-19T11:00:27Z"
  },
  {
    "title": "REP. SARA JACOBS: Military families deserve IVF coverage and Trump’s support",
    "description": "Our service members risk everything to protect this nation. Rep. Sara Jacobs pushes for the IVF for Military Families Act to address infertility struggles faced by military families.",
    "link": "https://www.foxnews.com/opinion/rep-sara-jacobs-military-families-deserve-ivf-coverage-trumps-support",
    "timestamp": "2025-05-19T11:00:24Z"
  },
  {
    "title": "AOC’s Vanishing Engagement Ring. Plus, Owner of Trump’s Qatari Jet Linked to Menendez Scandal.",
    "description": "Put a ring on it: Rep. Alexandria Ocasio-Cortez (D., N.Y.) hasn't been pictured wearing her engagement ring since October 2023, raising questions about the status of her relationship—and potential ethical concerns tied to her longtime partner, Riley Roberts, …",
    "link": "https://freebeacon.com/issues/aocs-vanishing-engagement-ring-plus-owner-of-trumps-qatari-jet-linked-to-menendez-scandal/",
    "timestamp": "2025-05-19T11:00:15Z"
  },
  {
    "title": "Trade tensions drive consumers to cut back. 'Something has to give,' analyst says",
    "description": "Amid ongoing tariff disputes, consumers are prepared to make fewer discretionary purchases, recent studies show.",
    "link": "https://www.cnbc.com/2025/05/19/trade-tensions-spur-consumers-to-spend-less-on-discretionary-purchases.html",
    "timestamp": "2025-05-19T11:00:01Z"
  },
  {
    "title": "Elon Musk's Super Breeding Ways May Be Part Of A Disturbing New Trend.",
    "description": "What's the deal with Elon Musk and Nick Cannon's never-ending quest to father children? We asked sex therapists and pronatalist experts for answers.",
    "link": "https://www.huffpost.com/entry/elon-musks-super-breeding-ways-may-be-part-of-a-disturbing-new-trend-goog_l_68264c26e4b029d8a6109f21",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Back from ‘complete hell,’ freed American-Israeli hostage is smiling again, parents say",
    "description": "Back home after more than a year in Hamas captivity, Edan Alexander recalled to his parents his conditions as a hostage.",
    "link": "https://www.nbcnews.com/world/middle-east/back-complete-hell-edan-alexander-smiling-parents-say-rcna207573",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Trump-Backed Supreme Court Decision Could Quietly Unleash $150 Trillion “Main Street Bailout”, Says Former CIA Advisor",
    "description": "New Supreme Court ruling could unlock the biggest wealth transfer in U.S. history—while most Americans remain unaware New Supreme Court ruling could unlock the biggest wealth transfer in U.S. history—while most Americans remain unaware",
    "link": "https://www.globenewswire.com/news-release/2025/05/19/3083878/0/en/Trump-Backed-Supreme-Court-Decision-Could-Quietly-Unleash-150-Trillion-Main-Street-Bailout-Says-Former-CIA-Advisor.html",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Polling Was Quietly Still Bad in 2024",
    "description": "After nearly a decade of fine-tuning, the industry still hasn’t figured out how to reach enough Donald Trump supporters.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/polling-2024-trump-bias/682834/",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Inside the Democrats’ Reboot",
    "description": "After the 2024 fiasco, the party is rethinking everything",
    "link": "https://time.com/7286163/inside-the-democratic-party-reboot/",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "'He’s finished, done, gone': GOP insiders reveal the dramatic crash of Elon Musk",
    "description": "“People hate\" Elon Musk — and the GOP is getting the message, according to a Politico report\r\n.“He’s finished, done, gone. He polls terrible. People hate him,” said a GOP operative that Politico granted anonymity. “He’d go to Wisconsin thinking he can buy peo…",
    "link": "https://www.rawstory.com/musk-2672110698/",
    "timestamp": "2025-05-19T10:59:43Z"
  },
  {
    "title": "DAVID BOSSIE: Congress Should Probe Cover-Up Of Biden’s Cognitive Decline",
    "description": "The years-long, wide-reaching cover-up of former President Joe Biden’s obvious cognitive decline is reaching a fever pitch, and the time has come to answer an important question: what should be done about it? Ever since his basement presidential campaign duri…",
    "link": "https://dailycaller.com/2025/05/19/opinion-congress-should-probe-cover-up-of-bidens-cognitive-decline-david-bossie/",
    "timestamp": "2025-05-19T10:59:32Z"
  },
  {
    "title": "Donald Trump Forwards Shocker Of A Plea For Barack Obama",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_74834d02-5304-4bee-bfa2-c98242001d1e",
    "timestamp": "2025-05-19T10:58:50Z"
  },
  {
    "title": "Donald Trump Forwards Shocker Of A Plea For Barack Obama",
    "description": "The president amplified an extreme message about one of his predecessors.",
    "link": "https://www.huffpost.com/entry/donald-trump-barack-obama-military-tribunal_n_682af5f3e4b02ef0f55d4487",
    "timestamp": "2025-05-19T10:58:50Z"
  },
  {
    "title": "Trump faces a trillion-dollar tariff disappointment",
    "description": "Trump faces a trillion-dollar tariff disappointment\nRevenues from border levies will be lower than he expects\nIn the early 20th century, before America introduced an income tax, tariffs paid many of the government’s bills. President Donald Trump wants to revi…",
    "link": "https://biztoc.com/x/59d6b7e314432c64",
    "timestamp": "2025-05-19T10:54:51Z"
  },
  {
    "title": "How Trump's family-linked crypto deals are threatening a 'Hunter Biden-style' scandal at the White House",
    "description": "Donald Trump risks undercutting his presidency with a Hunter Biden-style influence-peddling scandal unless he clamps down on questionable crypto deals that his family has inked with investors in the Middle East and China, experts told The Post.\nTrump is catch…",
    "link": "https://biztoc.com/x/dd7b1a4288a0f7db",
    "timestamp": "2025-05-19T10:54:49Z"
  },
  {
    "title": "Trump ‘amazed’ by Saudi progress, fellow developer says",
    "description": "The News\nUS President Donald Trump was struck by the scale and quality of the palaces and cities he visited in the Gulf last week, according to a Riyadh-based real estate executive who has known him for more than 40 years.\n“He couldn’t believe” how far things…",
    "link": "https://biztoc.com/x/6a9ced3496153b87",
    "timestamp": "2025-05-19T10:54:38Z"
  },
  {
    "title": "As Apple Faces Pressure After Trump Told Tim Cook To Avoid Manufacturing In India, Expert Warns iPhone Maker's 'Value-Added Growth Is In Danger'",
    "description": "Apple Inc. (NASDAQ:AAPL) confronts a strategic manufacturing dilemma as President Donald Trump directly told CEO Tim Cook to avoid building in India.\nWhat Happened: While Apple ramps up iPhone production in India, experts warn that the recent U.S.-China trade…",
    "link": "https://biztoc.com/x/e16dad91f90e9919",
    "timestamp": "2025-05-19T10:54:37Z"
  },
  {
    "title": "US debt and renewed trade fears spook global markets",
    "description": "The News\nAsian and European stocks fell, the dollar dropped, and US Treasury yields rose on concern over the global economy’s prospects after a downgrade of American debt and renewed tariff warnings from Washington.\nMarkets had enjoyed a reprieve after US Pre…",
    "link": "https://biztoc.com/x/097d11d068339e77",
    "timestamp": "2025-05-19T10:54:33Z"
  },
  {
    "title": "Trump order targets barcodes on ballots. They've long been a source of misinformation",
    "description": "President Donald Trump’s executive order seeking to overhaul how U.S. elections are run includes a somewhat obscure reference to the way votes are counted",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-order-targets-barcodes-ballots-long-source-misinformation-121941835",
    "timestamp": "2025-05-19T10:54:27Z"
  },
  {
    "title": "Donald Trump Jr. Raises 'Cover-up' Question Over Joe Biden Cancer Diagnosis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump Jr. has raised questions about a cover-up after former president Joe Biden was diagnosed with an \"aggressive form\" of prostate cancer.\n\"What I want to know is how did Dr. Jill Biden miss stage fiv…",
    "link": "https://biztoc.com/x/19bfd2c6e5a0629e",
    "timestamp": "2025-05-19T10:54:20Z"
  },
  {
    "title": "Doctors say it’s ‘inconceivable’ Biden’s cancer went undetected by his medical team — as Trump Jr. questions if diagnosis is ‘cover-up’",
    "description": "The 82-year-old former president was diagnosed Friday after doctors found a “small nodule” on his prostate during a medical exam earlier this month -- with the cancer cells having spread to the bone, his spokesman revealed Sunday.",
    "link": "https://nypost.com/2025/05/19/us-news/biden-aggressive-prostate-cancer-diagnosis-leaves-medical-experts-stunned/",
    "timestamp": "2025-05-19T10:51:24Z"
  },
  {
    "title": "Pearl Jam's Eddie Vedder leaps into Trump's Bruce Springsteen fight",
    "description": "Pearl Jam’s Eddie Vedder jumped into the ratcheting row between President Donald Trump and Brcue Springsteen.The singer paid tribute to the New Jersey rocker at a Pittsburgh show just hours after the president called Springsteeen “highly overrated,” dumb as a…",
    "link": "https://www.rawstory.com/bruce-springsteen-trump-2672110705/",
    "timestamp": "2025-05-19T10:50:35Z"
  },
  {
    "title": "Trump To Call Putin In Push For Ukraine Ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022 invasion of Ukraine.",
    "link": "https://www.ibtimes.com/trump-call-putin-push-ukraine-ceasefire-3773955",
    "timestamp": "2025-05-19T10:48:07Z"
  },
  {
    "title": "‘Pretty Humiliating’: John Oliver Cringes At 4 Words Trump Won’t Stop Saying",
    "description": "‘Pretty Humiliating’: John Oliver Cringes At 4 Words Trump Won’t Stop Sayinghuffpost.com",
    "link": "https://www.huffpost.com/entry/john-oliver-donald-trump-media_n_682af67de4b0b2994c199260",
    "timestamp": "2025-05-19T10:47:51Z"
  },
  {
    "title": "Iran offers a new regional paradigm for stability",
    "description": "Iran, considered to be the most affected by the recent regional developments following the regime change in Syria and Israel’s attacks targeting its territories, is offering a new approach of cooperation and unity to the countries in its near neighborhood ami…",
    "link": "https://www.hurriyetdailynews.com/iran-offers-a-new-regional-paradigm-for-stability-209354",
    "timestamp": "2025-05-19T10:47:37Z"
  },
  {
    "title": "Donald Trump Jr. Raises 'Cover-up' Question Over Joe Biden Cancer Diagnosis",
    "description": "Former president Joe Biden has been diagnosed with \"an aggressive form\" of prostate cancer.",
    "link": "https://www.newsweek.com/donald-trump-jr-joe-biden-cancer-2073938",
    "timestamp": "2025-05-19T10:47:12Z"
  },
  {
    "title": "Kash Patel Demands Canada ‘Gets to Steppin” to End Fentanyl Trafficking",
    "description": "FBI Director Kash Patel accused Canada of failing to stem the tide of fentanyl entering the U.S., demanding the northern neighbor “gets to steppin'” in stopping “suspected terrorists” crossing the border. Speaking to Fox Business anchor Maria Bartiromo, Patel…",
    "link": "https://www.mediaite.com/tv/kash-patel-demands-canada-gets-to-steppin-to-end-fentanyl-trafficking/",
    "timestamp": "2025-05-19T10:46:37Z"
  },
  {
    "title": "Trump due for high-stakes phone call with Putin to end Ukraine conflict",
    "description": "Donald Trump will speak with Vladimir Putin to address the Ukraine conflict. This follows calls from European leaders urging Trump to push for peace. Previous talks have stalled due to disagreements. Trump also had tense discussions with Volodymyr Zelenskyy. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-due-for-high-stakes-phone-call-with-putin-to-end-ukraine-conflict/articleshow/121267667.cms",
    "timestamp": "2025-05-19T10:45:55Z"
  },
  {
    "title": "Key House committee advances Trump agenda bill after appeasing conservatives (NBC News)",
    "description": "NBC News:\nKey House committee advances Trump agenda bill after appeasing conservatives  —  The House Budget Committee's vote came two days after a group of GOP hard-liners rejected the package.  —  WASHINGTON — The House Budget Committee advanced President Do…",
    "link": "https://www.memeorandum.com/250519/p2",
    "timestamp": "2025-05-19T10:45:00Z"
  },
  {
    "title": "Trump to call Putin in push for Ukraine ceasefire",
    "description": "WASHINGTON - Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022 invasion of Ukraine.",
    "link": "https://www.bangkokpost.com/world/3029307/trump-to-call-putin-in-push-for-ukraine-ceasefire",
    "timestamp": "2025-05-19T10:45:00Z"
  },
  {
    "title": "Crypto Traders Who Secured A Dinner With Donald Trump Walked Away With Major Profits, Says Analysis",
    "description": "A new investigation has revealed how a Trump-themed cryptocurrency contest led to dramatic financial outcomes for participants.\nWhile some traders walked away with sizeable profits, others may be holding significant losses, all while securing a spot at a priv…",
    "link": "https://biztoc.com/x/2495bf0663fb1178",
    "timestamp": "2025-05-19T10:43:13Z"
  },
  {
    "title": "Trump to call Putin in push for Ukraine ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022...",
    "link": "https://www.yahoo.com/news/trump-call-putin-push-ukraine-104219938.html",
    "timestamp": "2025-05-19T10:42:19Z"
  },
  {
    "title": "Bruce Springsteen ignores question about Trump feud while signing autographs",
    "description": "Springsteen previously called Trump administration \"corrupt, incompetent and treasonous\" during Manchester concert.",
    "link": "https://nypost.com/2025/05/19/entertainment/bruce-springsteen-ignores-question-about-trump-feud-while-signing-autographs/",
    "timestamp": "2025-05-19T10:39:28Z"
  },
  {
    "title": "What's in the UK-EU reset deal?",
    "description": "Prime Minister Keir Starmer hosted EU leaders in London, aiming to improve post-Brexit relations. Discussions focused on a defence and security pact, enhanced trade through sanitary and phytosanitary agreements, and youth mobility schemes. Both sides also exp…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/whats-in-the-uk-eu-reset-deal/articleshow/121267697.cms",
    "timestamp": "2025-05-19T10:36:56Z"
  },
  {
    "title": "Pope Leo XIV Meets US Vice President Ahead Of Ukraine Ceasefire Push",
    "description": "Pope Leo XIV received US Vice President JD Vance and US Secretary of State Marco Rubio at the Vatican Monday, ahead of a US-led push to end the Russia-Ukraine conflict.",
    "link": "https://www.ndtv.com/world-news/pope-leo-xiv-meets-us-vice-president-jd-vance-ahead-of-ukraine-ceasefire-push-8452820",
    "timestamp": "2025-05-19T10:33:50Z"
  },
  {
    "title": "Mike Pence Pushes Back After Trump Slams US Foreign Policy, Praises Saudi Crown Prince Mohammed Bin Salman: 'I've Never Been A Fan Of Presidents Criticizing America Abroad'",
    "description": "Former Vice President Mike Pence criticized President Donald Trump during an interview on Sunday for remarks he made during his tour of the Middle East. \nI've never been a fan of American presidents criticizing America on foreign soil,\" Pence said.\nWhat Happe…",
    "link": "https://biztoc.com/x/b61456fcba5a3bfe",
    "timestamp": "2025-05-19T10:32:13Z"
  },
  {
    "title": "Trump's tariff onslaught casts shadow over European economy, even in best case scenario",
    "description": "U.S. President Donald Trump’s tariff offensive has led European officials have cut back their growth forecasts for this year and next, even in a best-case scenario in which the highest rates on most goods could be negotiated away.",
    "link": "https://www.clickondetroit.com/business/2025/05/19/trumps-tariff-onslaught-casts-shadow-over-european-economy-even-in-best-case-scenario/",
    "timestamp": "2025-05-19T10:31:31Z"
  },
  {
    "title": "Trump's tariff onslaught casts shadow over European economy, even in best case scenario",
    "description": "U.S. President Donald Trump’s tariff offensive has led European officials have cut back their growth forecasts for this year and next, even in a best-case scenario in which the highest rates on most goods could be negotiated away",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariff-onslaught-casts-shadow-european-economy-best-121941135",
    "timestamp": "2025-05-19T10:30:28Z"
  },
  {
    "title": "Dem senator says Biden should have dropped out of presidential race much sooner",
    "description": "Sen. Chris Murphy, D-Conn., said Joe Biden should have dropped out of the presidential race sooner, claiming there was 'no doubt' it would have been better for the Democrats had he done so.",
    "link": "https://www.foxnews.com/media/dem-senator-says-biden-should-have-dropped-out-presidential-race-much-sooner",
    "timestamp": "2025-05-19T10:30:27Z"
  },
  {
    "title": "De-escalation and new normals: Does today’s churn have a limit?",
    "description": "Globally, actions once unthinkable are finding acceptance, be it in the arena of trade, terrorism or security. With step-ups, climb-downs and new normals, a big churn is on. But how far can these revolutions go?",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-narendra-modi-china-tariffs-wto-crisis-india-pakistan-conflict-abraham-accords-syria-sanctions-us-inflation-11747553954706.html",
    "timestamp": "2025-05-19T10:30:08Z"
  },
  {
    "title": "Jill Biden Accused of Playing Gatekeeper on Joe’s Health—Trump Jr. Drops the Bombshell",
    "description": "Donald Trump Jr. accuses Jill Biden of hiding the news of Joe Biden's cancer diagnosis. Here's what the President's son said about the announcement.",
    "link": "https://www.inquisitr.com/jill-biden-accused-of-playing-gatekeeper-on-joes-health-trump-jr-drops-the-bombshell",
    "timestamp": "2025-05-19T10:30:08Z"
  },
  {
    "title": "EU leaders relieved after centrist Dan wins Romanian presidency",
    "description": "BUCHAREST - Romania's European allies and markets welcomed centrist Nicusor Dan's presidential election victory over the eurosceptic hard-right on Sunday, relieved that the European Union member avoided a lurch to a Donald Trump-inspired political path.",
    "link": "https://www.bangkokpost.com/world/3029287/eu-leaders-relieved-after-centrist-dan-wins-romanian-presidency",
    "timestamp": "2025-05-19T10:30:00Z"
  },
  {
    "title": "'Corrupt and unlawful!' Trump comes after megastars Beyoncé and Oprah",
    "description": "President Donald Trump called for investigations of big-name performers who backed Kamala Harris in the 2024 election.The president unspooled a late-night rant against Bruce Springsteen, Oprah Winfrey, Beyoncé and Bono for their support of the vice president …",
    "link": "https://www.rawstory.com/bruce-springsteen-trump/",
    "timestamp": "2025-05-19T10:28:46Z"
  },
  {
    "title": "Trump order targets barcodes on ballots. They’ve long been a source of misinformation",
    "description": "ATLANTA (AP) — President Donald Trump’s executive order seeking to overhaul how U.S. elections are run includes a somewhat obscure reference to the way votes are counted. Voting equipment, it says, should not use ballots that include “a barcode or quick-respo…",
    "link": "https://financialpost.com/pmn/trump-order-targets-barcodes-on-ballots-theyve-long-been-a-source-of-misinformation",
    "timestamp": "2025-05-19T10:27:53Z"
  },
  {
    "title": "US borrowing costs top 5% after Moody’s downgrade",
    "description": "Yields on 30-year US Treasuries hit highest level since 2023 and stock futures fall as investor concerns over debt mount",
    "link": "https://www.irishtimes.com/business/2025/05/19/us-borrowing-costs-top-5-after-moodys-downgrade/",
    "timestamp": "2025-05-19T10:27:22Z"
  },
  {
    "title": "China fully respects Denmark's sovereignty on Greenland, foreign minister says",
    "description": "BEIJING: China fully respects Denmark's sovereignty and territorial integrity on the Greenland issue, Foreign Minister Wang Yi told his Danish counterpart on Monday (May 19), urging the European nation to reciprocate over China's own sovereignty concerns. Uni…",
    "link": "https://www.channelnewsasia.com/east-asia/china-fully-respects-denmark-greenland-sovereignty-5139111",
    "timestamp": "2025-05-19T10:24:27Z"
  },
  {
    "title": "Trump-Putin call: What’s holding up a Russia-Ukraine ceasefire?",
    "description": "The US president says only Putin and he can stitch together a ceasefire. Their call on Monday will test that theory.",
    "link": "https://www.aljazeera.com/news/2025/5/19/trump-putin-call-whats-holding-up-a-russia-ukraine-ceasefire",
    "timestamp": "2025-05-19T10:24:21Z"
  },
  {
    "title": "Pro-EU centrist wins tense Romania presidential vote rerun",
    "description": "Dan won close to 54 percent of the vote.",
    "link": "https://www.thejournal.ie/nicusor-dan-romania-election-6708762-May2025/",
    "timestamp": "2025-05-19T10:24:12Z"
  }
]