[
  {
    "title": "Putin Tells Trump He 'Will Have to Respond' To Ukraine Attack",
    "description": "President Donald Trump has shared the details of his 75-minute call with Russian President Vladimir Putin.",
    "link": "https://www.newsweek.com/putin-tells-trump-he-will-have-respond-ukraine-attack-2081004",
    "timestamp": "2025-06-04T17:05:34Z"
  },
  {
    "title": "Trump says he spoke to Putin, predicts no 'immediate' peace for Russia and Ukraine",
    "description": "President Donald Trump on Wednesday said he spoke with Russian leader Vladimir Putin for well over an hour about Ukraine's latest attack on Russian airplanes and nuclear talks with Iran.\nPutin in that call vowed retaliation against Ukraine for the stunning su…",
    "link": "https://biztoc.com/x/63fffa79e4c235e8",
    "timestamp": "2025-06-04T17:04:04Z"
  },
  {
    "title": "What is the CBO? A look at the small office inflaming debate over Trump's tax bill",
    "description": "A small, government office with some 275 employees has found itself caught in the political crossfire as Congress debates President Donald Trump’s “one big beautiful bill.”",
    "link": "https://abcnews.go.com/US/wireStory/cbo-small-office-inflaming-debate-trumps-tax-bill-122498996",
    "timestamp": "2025-06-04T17:02:40Z"
  },
  {
    "title": "Trump speaks with Putin about Ukraine and Iran",
    "description": "Putin told him that he will have to respond to Ukraine's recent drone attacks, Trump said in a social media post.",
    "link": "https://www.bbc.com/news/articles/cx2r108l785o",
    "timestamp": "2025-06-04T17:02:39Z"
  },
  {
    "title": "Trump admin threatens Michigan road funding over immigration enforcement, DEI",
    "description": "Transportation Secretary warns state could lose $2.3 billion annually if it doesn't cooperate with federal policies.",
    "link": "https://www.mlive.com/news/2025/06/trump-admin-threatens-michigan-road-funding-over-immigration-enforcement-dei.html",
    "timestamp": "2025-06-04T17:02:27Z"
  },
  {
    "title": "Trump says Putin told him that Russia will respond to Ukrainian attack on airfields",
    "description": "Trump talked about his lengthy call with Putin in a social media post.",
    "link": "https://www.bostonherald.com/2025/06/04/russia-ukraine-war-trump-talk/",
    "timestamp": "2025-06-04T17:02:14Z"
  },
  {
    "title": "Trump says Putin told him that Russia will respond to Ukrainian attack on airfields",
    "description": "President Donald Trump said Russian President Vladimir Putin told him “very strongly” in a phone call Wednesday that he will respond to Ukraine’s weekend drone attack on Russian airfields",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-putin-told-russia-respond-ukrainian-attack-airfields-122498905",
    "timestamp": "2025-06-04T17:02:10Z"
  },
  {
    "title": "What’s in Canada’s Immigration Bill—and Why It’s Facing Backlash",
    "description": "Canada’s new immigration bill proposes sweeping  changes in policy, giving the Coast Guard authority to conduct security patrols and heavily restricting asylum.",
    "link": "https://time.com/7291118/canada-immigration-bill-strong-borders-act-reactions/",
    "timestamp": "2025-06-04T17:01:57Z"
  },
  {
    "title": "Republicans target the CBO as part of a larger offensive against independent obstacles",
    "description": "The fact that too many Republicans see independent sources of information has partisan targets speaks volumes about the quality of the party’s ideas.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-target-cbo-congressional-budget-office-rcna210938",
    "timestamp": "2025-06-04T17:01:10Z"
  },
  {
    "title": "Comer widens Biden 'cover-up' probe, seeks interviews with Anita Dunn and Ron Klain",
    "description": "House Oversight Committee Chair James Comer is reaching out to five members of former President Joe Biden's inner circle to expand his probe.",
    "link": "https://www.foxnews.com/politics/comer-widens-biden-cover-up-probe-seeks-interviews-anita-dunn-ron-klain",
    "timestamp": "2025-06-04T17:00:46Z"
  },
  {
    "title": "Inside the struggle for technological control in South Africa: The larger concern isn’t domestic equity – but China",
    "description": "In the dawn light of a South African savanna, a team of rangers huddle around a satellite dish aimed skyward. Their phones spring to life with a signal – an unthinkable result just months earlier in this remote, off-grid conservation zone. The source is Starl…",
    "link": "https://freerepublic.com/focus/f-news/4320961/posts",
    "timestamp": "2025-06-04T16:59:57Z"
  },
  {
    "title": "Putin tells Trump Russia will respond to Ukrainian attack on warplanes",
    "description": "President Donald Trump said on Wednesday that he held an hour-long phone call with Russian President Vladimir Putin, where the two leaders discussed recent Ukrainian attacks.",
    "link": "https://www.foxnews.com/politics/putin-tells-trump-russia-respond-ukrainian-attack-warplanes",
    "timestamp": "2025-06-04T16:59:10Z"
  },
  {
    "title": "From mortgage rates to prices, here are 3 housing-market predictions for 2025 from Goldman Sachs",
    "description": "The housing market remains constrained in 2025. Goldman said mortgage rates will stay elevated, raising its year-end target for the 30-year mortgage rate.",
    "link": "https://www.businessinsider.com/goldman-sachs-us-housing-market-outlook-mortgage-rates-trump-trade-2025-6",
    "timestamp": "2025-06-04T16:59:09Z"
  },
  {
    "title": "Putin tells Trump he will respond to Ukraine's strike",
    "description": "US President Donald Trump said on Wednesday that Russian president Vladimir Putin \"very strongly\" told him in a call today that he'll have to respond to Ukraine's recent attack on Russian airfields. \"...",
    "link": "https://biztoc.com/x/c979809c1b8f25e1",
    "timestamp": "2025-06-04T16:58:59Z"
  },
  {
    "title": "Map Shows Where Prisons Are Expanding as Trump Ramps Up Deportations",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPrivate prisons across the United States are increasing their capacity to hold migrants detained by Immigration and Customs Enforcement (ICE) as President Donald Trump's administration ramps up deportations.\nW…",
    "link": "https://biztoc.com/x/fe64748bdcaed44a",
    "timestamp": "2025-06-04T16:58:56Z"
  },
  {
    "title": "Kremlin confirms Putin spoke to Trump",
    "description": "Kremlin spokesperson Dmitry Peskov confirmed Wednesday that Russian President Vladimir Putin had a call with his United States colleague Donald Trump. More to come......",
    "link": "https://biztoc.com/x/f0b74ebd0f2b9505",
    "timestamp": "2025-06-04T16:58:51Z"
  },
  {
    "title": "Trump says he spoke to Putin, predicts no 'immediate' peace for Russia and Ukraine",
    "description": "President Donald Trump said he spoke with Russian leader Vladimir Putin about Ukraine's latest attack on Russian airplanes and nuclear talks with Iran.",
    "link": "https://www.cnbc.com/2025/06/04/trump-putin-ukraine-russia-peace.html",
    "timestamp": "2025-06-04T16:58:00Z"
  },
  {
    "title": "Trump says he spoke to Putin about Ukrainian attacks",
    "description": "US president Donald Trump has said he talked to Russian President Vladimir Putin about Kiev’s recent strikes on Russian aircraft Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618661-trump-putin-phone-call/",
    "timestamp": "2025-06-04T16:57:51Z"
  },
  {
    "title": "ICE Arrests Suspected Al-Qaeda Operative In Major Sanctuary City",
    "description": "ICE agents arrested a suspected Al-Qaeda member residing in Philadelphia, a city notorious for refusing to cooperate with federal immigration authorities.",
    "link": "https://dailycaller.com/2025/06/04/ice-arrests-terrorist-in-philadelphia/",
    "timestamp": "2025-06-04T16:55:59Z"
  },
  {
    "title": "Map Shows Where Prisons Are Expanding as Trump Ramps Up Deportations",
    "description": "Prisons from New Jersey to Nevada are reopening or increasing capacity amid Trump's mass deportations.",
    "link": "https://www.newsweek.com/map-shows-prisons-expanding-trump-ramps-deportations-2080965",
    "timestamp": "2025-06-04T16:54:33Z"
  },
  {
    "title": "Will Wilders’s gamble to withdraw from governing Dutch coalition pay off?",
    "description": "Party for Freedom leader hopes plan to get tough on immigration delivers election victory.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/6/4/will-wilderss-gamble-to-withdraw-from-governing-dutch-coalition-pay-off",
    "timestamp": "2025-06-04T16:53:21Z"
  },
  {
    "title": "Trump’s Commerce Secretary Makes Shocking Confession on Tariffs",
    "description": "Commerce Secretary Howard Lutnick, the architect behind Donald Trump’s chaotic tariff policy, admitted in a Senate hearing Wednesday that there’s no real logic in how the trade talks are being conducted.\r\nIn a damning line of questioning, Republican Senator J…",
    "link": "https://newrepublic.com/post/196121/trump-commerce-secretary-lutnick-confession-tariffs-trade-deals",
    "timestamp": "2025-06-04T16:52:56Z"
  },
  {
    "title": "Trump Cuts Send FEMA Into “Unheard of” Chaos During Crucial Time",
    "description": "Chaos in the White House is preventing federal disaster relief from reaching its recipients, sparking fears that the government may face more delays and lapses during the upcoming hurricane season.\r\nThe Trump administration issued millions of dollars in relie…",
    "link": "https://newrepublic.com/post/196118/donald-trump-cuts-fema-chaos-hurricane-season",
    "timestamp": "2025-06-04T16:52:35Z"
  },
  {
    "title": "Even Trump's Supporters Are Freaking Out Over The News That He May Be Making A 'Citizenship Registry' With Palantir",
    "description": "Trump's 'Palantir Citizenship Database' Controversy refers to discourse and memes that followed a New York Times article alleging that Donald Trump has expanded government contracts with data analysis and technology firm Palantir, which currently holds over $…",
    "link": "https://knowyourmeme.com/memes/events/trumps-palantir-citizenship-database-controversy",
    "timestamp": "2025-06-04T16:51:42Z"
  },
  {
    "title": "Trump trade war delays Apple Intelligence's debut in China",
    "description": "Apple's eventual rollout of Apple Intelligence in China has hit delays, thanks to regulatory issues raised in response to President Trump's tariffs.Apple Intelligence still isn't available in China, and won't be for some timeApple has been working with Alibab…",
    "link": "https://appleinsider.com/articles/25/06/04/trump-trade-war-delays-apple-intelligences-debut-in-china",
    "timestamp": "2025-06-04T16:51:38Z"
  },
  {
    "title": "Elon Musk privately expresses frustration on a range of recent moves by Trump administration: Sources (Associated Press)",
    "description": "Associated Press:\nElon Musk privately expresses frustration on a range of recent moves by Trump administration: Sources  —  Multiple people who have spoken to Trump and Musk described a widening rift.  —  President Donald Trump and Elon Musk attend a press co…",
    "link": "https://www.memeorandum.com/250604/p83",
    "timestamp": "2025-06-04T16:50:00Z"
  },
  {
    "title": "Mexico’s Sheinbaum to Defend Steel Industry If US Tariff Deal Fails",
    "description": "President Claudia Sheinbaum said she will take steps to protect the local steel industry if the government is unable to reach a deal with Donald Trump’s administration to exempt Mexico from heightened steel tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/mexicos-sheinbaum-to-defend-steel-industry-if-us-tariff-deal-fails",
    "timestamp": "2025-06-04T16:49:47Z"
  },
  {
    "title": "Trump says that Putin will take part in nuclear talks with Iran",
    "description": "US President Donald Trump said that Russian President Vladimir Putin will take part in nuclear talks with Iran",
    "link": "https://www.jpost.com/breaking-news/article-856561",
    "timestamp": "2025-06-04T16:49:41Z"
  },
  {
    "title": "House Republicans Shocked to Learn Bill They Didn’t Read Has Stuff in It They Don’t Like",
    "description": "Regrets, they’ve got a few.",
    "link": "https://www.vanityfair.com/news/story/house-republicans-shocked-to-learn-bill-they-didnt-read-has-stuff-in-it-they-dont-like",
    "timestamp": "2025-06-04T16:49:24Z"
  },
  {
    "title": "Iran’s supreme leader criticizes U.S. proposal in nuclear talks but doesn’t reject idea of a deal",
    "description": "Ayatollah Ali Khamenei on Wednesday described the U.S. proposal as \"100% against the idea of 'we can,'\" borrowing from an Iranian government slogan. He also insisted that Tehran needed to keep its ability to enrich uranium. Reaching a deal is one of the sever…",
    "link": "https://www.pbs.org/newshour/world/irans-supreme-leader-criticizes-u-s-proposal-in-nuclear-talks-but-doesnt-reject-idea-of-a-deal",
    "timestamp": "2025-06-04T16:48:56Z"
  },
  {
    "title": "iOS 18.6 Apple Intelligence Launch in China Delayed by U.S.-China Trade Tensions",
    "description": "Apple's efforts to bring Apple Intelligence to the critical Chinese market have been stymied by tension resulting from the tariffs that U.S. President Donald Trump put in place, reports Financial Times.\n\n\n\n\n\nTo deploy ‌Apple Intelligence‌ features in China, A…",
    "link": "https://www.macrumors.com/2025/06/04/apple-intelligence-china-launch-delayed/",
    "timestamp": "2025-06-04T16:48:34Z"
  },
  {
    "title": "Top Stock Movers Now: DR Horton, Wells Fargo, Dollar Tree, and More",
    "description": "In This Article:\nKey Takeaways\n-\nU.S. equities were slightly higher at midday as a new report on private sector hiring missed estimates, sending bond yields down.\n-\nShares of D.R. Horton and rival homebuilders gained on the drop in Treasury yields and a new c…",
    "link": "https://biztoc.com/x/1472b6484bf45f49",
    "timestamp": "2025-06-04T16:48:18Z"
  },
  {
    "title": "Don't fall for fake Trump post that says 'stop calling me names'",
    "description": "A screenshot shared on social media authentically showed a Truth Social post by U.S. President Donald Trump demanding people \"stop calling me names\" and listing nicknames he \"will not tolerate being called.\"",
    "link": "https://www.snopes.com//fact-check/trump-stop-calling-me-names-post/",
    "timestamp": "2025-06-04T16:48:00Z"
  },
  {
    "title": "GOP takes 'talking point' from office that Republicans keep calling 'unreliable'",
    "description": "Republicans may soon be quoting the “totally unreliable” Congressional Budget Office (CBO), after new data shows President Donald Trump’s tariff policies could help to shrink US deficits.The CBO released data on Wednesday claiming Trump’s tariffs will cut the…",
    "link": "https://www.rawstory.com/gop-2672308940/",
    "timestamp": "2025-06-04T16:47:55Z"
  },
  {
    "title": "Trump says Fed’s Powell must lower interest rate in Truth Social post",
    "description": "U.S. President Donald Trump on Wednesday redoubled his calls for Federal Reserve Chair Jerome Powell to lower interest rates, noting that payroll processing firm ADP reported that job creation slowed in May.\n“ADP number out. ’Too Late’ Powell must now lower t…",
    "link": "https://biztoc.com/x/d621607eb8ed120c",
    "timestamp": "2025-06-04T16:47:37Z"
  },
  {
    "title": "Before-and-After Satellite Images Reveal Russian 'Pearl Harbor' Devastation",
    "description": "The operation, codenamed \"Operation Spiderweb,\" saw the deployment of 117 drones that targeted at least four strategic sites deep inside Russian territory.",
    "link": "https://www.newsweek.com/before-after-satellite-images-reveal-russian-pearl-harbor-devastation-2080973",
    "timestamp": "2025-06-04T16:47:32Z"
  },
  {
    "title": "Elon Musk Slams Trump’s “Big, Beautiful Bill,” Calling It “Disgusting Abomination”",
    "description": "Elon Musk took to his X platform this week to critique President Donald Trump's One Big Beautiful Bill Act.",
    "link": "https://hiphopwired.com/playlist/elon-musk-slams-trump-big-beautiful-bill/",
    "timestamp": "2025-06-04T16:46:44Z"
  },
  {
    "title": "Trump Has a New Presidential Portrait",
    "description": "The White House unveiled a new portrait of President Donald Trump this week. The official portrait depicts the President in a blue suit with a red tie set against a very dark background.\n[Read More]",
    "link": "https://petapixel.com/2025/06/04/trump-has-a-new-presidential-portrait/",
    "timestamp": "2025-06-04T16:46:02Z"
  },
  {
    "title": "Carney Holds Back on Tariff Retaliation, Says US-Canada Talks Are Progressing",
    "description": "Prime Minister Mark Carney said Canada won’t respond immediately to the Trump administration’s doubling of steel and aluminum tariffs, and indicated that officials are in “intensive discussions” about the trade relationship between the countries.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-holds-back-on-tariff-retaliation-says-us-canada-talks-are-progressing",
    "timestamp": "2025-06-04T16:44:56Z"
  },
  {
    "title": "Jobs in USA: Massive lay offs could happen soon in USA, warn experts",
    "description": "Job lay offs threat is getting more prominent even as analysts are keeping a close eye on US economic data this week.",
    "link": "https://economictimes.indiatimes.com/news/international/us/jobs-in-usa-massive-lay-offs-could-happen-soon-in-usa-warn-experts/articleshow/121628651.cms",
    "timestamp": "2025-06-04T16:44:41Z"
  },
  {
    "title": "Nolte: Media Fail -- Trump Tops Obama’s Job Approval Rating",
    "description": "More voters approve of the job President Trump is doing than approved of the job former President Barry Obama was doing on this same day during Barry’s second term.\nThe post Nolte: Media Fail — Trump Tops Obama’s Job Approval Rating appeared first on Breitbar…",
    "link": "https://www.breitbart.com/the-media/2025/06/04/nolte-media-fail-trump-tops-obamas-job-approval-rating/",
    "timestamp": "2025-06-04T16:44:19Z"
  },
  {
    "title": "Trump Attacked One of His Top Allies Out of the Blue. We Know Why.",
    "description": "The brute force of Trump’s political power means that, for now at least, the president has the whip hand.",
    "link": "https://slate.com/news-and-politics/2025/06/why-trump-attacks-leonard-leo-explained.html",
    "timestamp": "2025-06-04T16:43:36Z"
  },
  {
    "title": "Big government is still good, even with Trump in power",
    "description": "It’s easy to look at Donald Trump’s second term and conclude that the less power and reach the federal government has, the better. After all, a smaller government might provide Trump or someone like him with fewer opportunities to disrupt people’s lives, leav…",
    "link": "https://biztoc.com/x/8fa3fd9d42a74d9d",
    "timestamp": "2025-06-04T16:43:35Z"
  },
  {
    "title": "MAGA destroys top job applicant who 'debased' himself to hide woke past: report",
    "description": "In a shocking turn of events, University of Michigan President Santa Ono's bid for the top job at the University of Florida went up in flames, thanks to Florida's far-right political machine. Ono, who resigned from his Michigan post in May to pursue the Flori…",
    "link": "https://www.rawstory.com/santa-ono/",
    "timestamp": "2025-06-04T16:42:58Z"
  },
  {
    "title": "Iran's Khamenei rejects US zero uranium enrichment demand as '100% against' its interests",
    "description": "Iran opposes US demands to halt uranium enrichment, with Khamenei asserting Iran’s capability to produce nuclear fuel and its nuclear program as a matter of national pride.",
    "link": "https://www.foxnews.com/world/irans-khamenei-rejects-us-zero-uranium-enrichment-demand-100-against-its-interests",
    "timestamp": "2025-06-04T16:42:57Z"
  },
  {
    "title": "Zelenskyy wants face-to-face talks with Putin. Putin says there’s nothing to talk about after Ukraine’s attacks",
    "description": "Ukrainian President Volodymyr Zelenskyy on Wednesday dismissed Russia's ceasefire proposal as \"an ultimatum\" and renewed his call for direct talks with Russian President Vladimir Putin to break the deadlock over the war, which has dragged on for nearly 3½ yea…",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-wants-face-to-face-talks-with-putin-putin-says-theres-nothing-to-talk-about-after-ukraines-attacks",
    "timestamp": "2025-06-04T16:40:49Z"
  },
  {
    "title": "Step inside \"Trump Burger,\" the Texas chain started by an immigrant obsessed with the president",
    "description": "Amid endless debate over whether or not In-N-Out, Five Guys or Shake Shack puts up the best burger, we have a new — and yuge! — contender entering the crowded upscale burger market. From Deseret News: A Donald Trump impersonator, dozens of American flags and …",
    "link": "https://freerepublic.com/focus/f-chat/4320953/posts",
    "timestamp": "2025-06-04T16:40:15Z"
  },
  {
    "title": "Sen. Democrats Call for Stop to Funneling Money to Starlink in States",
    "description": "Since taking office, Trump and his administration have hit the $42.5 billion Broadband Equity, Access, and Deployment fund with several major roadblocks.",
    "link": "https://gizmodo.com/sen-democrats-call-for-stop-to-funneling-money-to-starlink-in-states-2000611062",
    "timestamp": "2025-06-04T16:40:00Z"
  },
  {
    "title": "We Are No Longer a Serious Country – Paul Krugman",
    "description": "And the world is starting to notice",
    "link": "https://paulkrugman.substack.com/p/we-are-no-longer-a-serious-country",
    "timestamp": "2025-06-04T16:39:36Z"
  },
  {
    "title": "Big government is still good, even with Trump in power",
    "description": "It’s easy to look at Donald Trump’s second term and conclude that the less power and reach the federal government has, the better. After all, a smaller government might provide Trump or someone like him with fewer opportunities to disrupt people’s lives, leav…",
    "link": "https://www.vox.com/policy/415421/big-government-small-government-trump-democracy",
    "timestamp": "2025-06-04T16:39:07Z"
  },
  {
    "title": "Whoopi Goldberg Accuses Elon Musk Of “Destroying Peoples’ Lives” Before Leaving Trump Administration: “Suddenly You Woke Up?”",
    "description": "\"You came out [of] your fog?\"",
    "link": "https://decider.com/2025/06/04/whoopi-goldberg-accuses-elon-musk-destroying-peoples-lives-before-leaving-trump-administration-suddenly-you-woke-up/",
    "timestamp": "2025-06-04T16:38:23Z"
  },
  {
    "title": "Pro-Trump pastor hit by damning allegations of 'psychological abuse'",
    "description": "Evangelical singer/preacher Sean Feucht has been a prominent figure in the MAGA movement, preaching far-right Christian nationalist views and heading the nonprofits Sean Feucht Ministries and Light a Candle. Feucht, according to Rolling Stone, founded the gro…",
    "link": "https://www.rawstory.com/pro-trump-pastor-hit-by-damning-allegations-of-psychological-abuse/",
    "timestamp": "2025-06-04T16:38:23Z"
  },
  {
    "title": "‘The View’: Alyssa Farah Griffin Says Elon Musk Could ‘Tank’ Trump If He Really Wants To | Video",
    "description": "The ABC host argues that Musk standing firm against Trump's spending bill could be \"devastating for his administration\"\nThe post ‘The View’: Alyssa Farah Griffin Says Elon Musk Could ‘Tank’ Trump If He Really Wants To | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-alyssa-farah-griffin-elon-musk-could-tank-trump/",
    "timestamp": "2025-06-04T16:38:16Z"
  },
  {
    "title": "WATCH: Law professor addresses unprecedented nature of judicial attacks under Trump administration",
    "description": "\"I worry that we are on a path toward few, if any, meaningful limits on the president,\" Shaw said.",
    "link": "https://www.pbs.org/newshour/politics/watch-law-professor-addresses-unprecedented-nature-of-judicial-attacks-under-trump-administration",
    "timestamp": "2025-06-04T16:37:35Z"
  },
  {
    "title": "Canada ‘will take some time’ before responding to higher U.S. steel, aluminum tariffs, Carney says",
    "description": "Prime Minister Mark Carney says Canada will not immediately retaliate after U.S. President Donald Trump raised tariffs on steel and aluminum to 50 per cent, citing ongoing negotiations over a new trade and security deal with Washington.\nSpeaking to reporters …",
    "link": "https://biztoc.com/x/e8bf45023254f1a7",
    "timestamp": "2025-06-04T16:36:34Z"
  },
  {
    "title": "Ladies of The View Claim Trump Is ‘Afraid’ of Elon Musk as Tesla Boss Tears Into Big Beautiful Bill",
    "description": "The ladies of The View took a strong stance on President Donald Trump's relationship with Elon Musk, with Whoopi Goldberg and Joy Behar agreeing the commander in chief is \"afraid\" of the Tesla billionaire.\nThe post Ladies of The View Claim Trump Is ‘Afraid’ o…",
    "link": "https://www.mediaite.com/media/tv/ladies-of-the-view-claim-trump-is-afraid-of-elon-musk-as-tesla-boss-tears-into-big-beautiful-bill/",
    "timestamp": "2025-06-04T16:36:21Z"
  },
  {
    "title": "Palantir and the Age of Authoritarian Entrepreneurs",
    "description": "Palantir probably has access to your data, John Herrman writes, and the company has signaled it will do what Trump wants with that data.",
    "link": "http://nymag.com/intelligencer/article/palantir-and-the-age-of-authoritarian-entrepreneurs.html",
    "timestamp": "2025-06-04T16:35:09Z"
  },
  {
    "title": "'In His Digital Wallet': Democrats Blast Latest Trump-Backed Crypto Product During House Hearing",
    "description": "The last time House lawmakers convened to discuss crypto, Trump had announced a private dinner for $TRUMP holders a day before.",
    "link": "https://decrypt.co/323663/in-his-digital-wallet-democrats-blast-latest-trump-backed-crypto-product-house-hearing",
    "timestamp": "2025-06-04T16:34:20Z"
  },
  {
    "title": "Trump’s Budget Would Limit Investigations Into Abuse, Neglect of Disabled People",
    "description": "Dismantling a key HHS agency, gutting important programs, and cuts to Medicaid will roll back decades of progress.",
    "link": "https://truthout.org/articles/trumps-budget-would-limit-investigations-into-abuse-neglect-of-disabled-people/",
    "timestamp": "2025-06-04T16:33:42Z"
  },
  {
    "title": "Hollywood Legend Reveals Trump Bitched Him Out For ‘Wussing Out’ On TV Over Stolen Election Lie",
    "description": "David Mamet revealed that Trump called and lectured him for 20 minutes after he \"wussed out\" on TV and softened on the \"stolen election\" lie.\nThe post Hollywood Legend Reveals Trump Bitched Him Out For ‘Wussing Out’ On TV Over Stolen Election Lie first appear…",
    "link": "https://www.mediaite.com/media/news/hollywood-legend-reveals-trump-bitched-him-out-for-wussing-out-on-tv-over-stolen-election-lie/",
    "timestamp": "2025-06-04T16:32:33Z"
  },
  {
    "title": "'Literally running the show': Shock report reveals full reach of Project 2025",
    "description": "Despite repeatedly attempting to distance himself\r\n from Project 2025 during his reelection campaign, U.S. President Donald Trump's administration employs dozens of senior officials with links to the Heritage Foundation-led plan to expand executive power and …",
    "link": "https://www.rawstory.com/literally-running-the-show-shock-report-reveals-full-reach-of-project-2025/",
    "timestamp": "2025-06-04T16:30:44Z"
  },
  {
    "title": "Bryson DeChambeau is back to competing, preparing for US Open title defense after 'fun side quests'",
    "description": "As much as Bryson DeChambeau loves to practice and compete, the U.S. Open champion also appreciates the limited LIV Golf schedule that gives him time to pursue other interests. DeChambeau arrived at Robert Trent Jones Golf Club for LIV Golf Virginia after a c…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_55a707ba-ba98-464a-9e98-1bda8ef35eeb",
    "timestamp": "2025-06-04T16:29:51Z"
  },
  {
    "title": "Carney hints retaliation is coming for Trump's latest steel and aluminum tariffs",
    "description": "Mark Carney said his government will take 'some time but not much' to respond to Donald Trump’s 50 per cent tariffs on steel and aluminum.",
    "link": "https://nationalpost.com/news/carney-hints-retaliation-is-coming-for-trumps-latest-steel-and-aluminum-tariffs",
    "timestamp": "2025-06-04T16:28:50Z"
  },
  {
    "title": "What is the ‘revenge tax’ in the US tax bill?",
    "description": "Provision allows US to impose additional taxes on entities from countries that it says impose unfair taxes on US firms.",
    "link": "https://www.aljazeera.com/economy/2025/6/4/what-is-the-revenge-tax-in-the-us-tax-bill",
    "timestamp": "2025-06-04T16:26:30Z"
  },
  {
    "title": "Even the Trumps Are Confused About How Many Crypto Offerings They Have",
    "description": "Donald Trump Jr. and Eric Trump are in a fight over the legitimacy of a Trump-branded crypto wallet that they claim is bogus.",
    "link": "http://nymag.com/intelligencer/article/even-the-trumps-are-confused-about-their-many-crypto-deals.html",
    "timestamp": "2025-06-04T16:26:24Z"
  },
  {
    "title": "Trump’s Middle East pivot aims to counter China’s rising influence",
    "description": "Trump is trying to strengthen ties with Gulf states in an attempt to contain China’s growing regional ambitions.",
    "link": "https://theconversation.com/trumps-middle-east-pivot-aims-to-counter-chinas-rising-influence-257366",
    "timestamp": "2025-06-04T16:25:32Z"
  },
  {
    "title": "Trump Calls Xi 'Tough' Ahead Of The Phone Call With Beijing",
    "description": "President Donald Trump on Wednesday called Chinese President Xi Jinping a “very tough” negotiator on social media platform Truth Social. “I like President Xi… but he is extremely hard to make a deal with,” Trump posted. \nThe comment comes as Trump prepares fo…",
    "link": "https://biztoc.com/x/8deba2f4dd3cbce6",
    "timestamp": "2025-06-04T16:25:21Z"
  },
  {
    "title": "Iranian Supreme Leader Lashes Out at Trump Admin Amid Nuclear Talks: ‘Rude and Arrogant Leaders’",
    "description": "Iranian supreme leader Ali Khamenei lashed out at the Trump administration in a defiant Wednesday speech, calling the U.S. nuclear deal proposal \"nonsense\" and taking aim at \"the rude and arrogant leaders of America.\"\nThe post Iranian Supreme Leader Lashes Ou…",
    "link": "https://freebeacon.com/national-security/iranian-supreme-leader-lashes-out-at-trump-admin-amid-nuclear-talks-rude-and-arrogant-leaders/",
    "timestamp": "2025-06-04T16:23:53Z"
  },
  {
    "title": "Pennsylvania sues USDA over cutting funding to $1 billion food aid program for states",
    "description": "Pennsylvania has filed a lawsuit against the U.S. Department of Agriculture, saying the agency, under President Donald Trump, illegally cut off funding through a program designed to distribute more than $1 billion to states",
    "link": "https://abcnews.go.com/US/wireStory/pennsylvania-suing-usda-cutting-funding-1-billion-food-122495388",
    "timestamp": "2025-06-04T16:23:28Z"
  },
  {
    "title": "Trump airs frustrations with Xi and Powell over elusive economic goals",
    "description": "President Donald Trump’s overnight volley of social media posts revealed his frustrations with decision makers whose cooperation he needs to secure some of his top economic objectives.",
    "link": "https://biztoc.com/x/a49d38fb978a4c6b",
    "timestamp": "2025-06-04T16:23:19Z"
  },
  {
    "title": "States Left Without Aid After FEMA Was Not Told Trump Had Signed Off on Disaster Relief: Report",
    "description": "Because the Trump administration is refusing to coordinate directly with FEMA, delays in sending funds to states are putting lives at risk, officials warned.",
    "link": "https://www.ibtimes.com/states-left-without-aid-after-fema-was-not-told-trump-had-signed-off-disaster-relief-report-3775157",
    "timestamp": "2025-06-04T16:22:12Z"
  },
  {
    "title": "These Republicans Now Say They Regret Voting For Trump’s Policy Bill",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., said she won’t vote for the bill again if the Senate doesn’t remove a provision preventing states from implementing artificial intelligence regulations.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/04/these-republicans-now-say-they-regret-voting-for-trumps-policy-bill/",
    "timestamp": "2025-06-04T16:21:19Z"
  },
  {
    "title": "What Happened When the FBI Asked for Dirt on Docs Treating Trans Kids: ‘F-ck Off Nazi Dickheads’",
    "description": "It's the Trump Administration's latest move to target health care providers working with trans youth.",
    "link": "http://www.rollingstone.com/politics/politics-features/trans-youth-health-care-fbi-tip-line-1235354963/",
    "timestamp": "2025-06-04T16:19:55Z"
  },
  {
    "title": "Trump Commerce Secretary Stuns Republican Senator By Undercutting Trump’s Justification For Sweeping Tariffs",
    "description": "Kennedy grilled Lutnick after the Trump cabinet member appeared to undercut Trump’s stated goal for the tariffs – to bring down other countries’ trade barriers on the U.S.\nThe post Trump Commerce Secretary Stuns Republican Senator By Undercutting Trump’s Just…",
    "link": "https://www.mediaite.com/politics/trump-commerce-secretary-stuns-republican-senator-by-undercutting-trumps-justification-for-sweeping-tariffs/",
    "timestamp": "2025-06-04T16:19:24Z"
  },
  {
    "title": "‘Korean Donald Trump’ emerges from the chaos in Seoul",
    "description": "The man now in charge of the Republic of Korea once styled himself after Bernie Sanders but changed his tune – and has won Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618637-south-korean-donald-trump/",
    "timestamp": "2025-06-04T16:19:22Z"
  },
  {
    "title": "Trump-Backed World Liberty Financial Airdrops Millions of Stablecoins to 85,000 Wallets",
    "description": "The airdrop was designed partly to test the platform’s readiness for a full rollout of DeFi services.",
    "link": "https://decrypt.co/323661/trump-backed-world-liberty-financial-airdrops-millions-stablecoins-85000-wallets",
    "timestamp": "2025-06-04T16:18:28Z"
  },
  {
    "title": "Trump’s “Big, Beautiful Bill” Would Massively Expand Government Spending in One Area",
    "description": "Two historic changes in the Republican budget bill haven’t gotten that much attention.",
    "link": "https://slate.com/news-and-politics/2025/06/big-beautiful-bill-donald-trump-government-spending-republicans-immigration.html",
    "timestamp": "2025-06-04T16:17:45Z"
  },
  {
    "title": "As trial opens, Mike Lindell’s attorneys say he spread claims about Dominion official because he was ‘triggered’",
    "description": "Defamation case is based on election conspiracy promoted by MyPillow CEO.",
    "link": "https://www.bostonherald.com/2025/06/04/colorado-defamation-trial-mike-lindell-dominion-election-conspiracy/",
    "timestamp": "2025-06-04T16:17:21Z"
  },
  {
    "title": "Trump administration renegotiating 'overly generous' Biden Chips Act grants",
    "description": "WASHINGTON :President Donald Trump's administration is renegotiating some of former President Joe Biden's grants to semiconductor firms that were \"overly generous,\" U.S. Commerce Secretary Howard Lutnick said at a hearing on Wednesday.Biden's Chips Act aimed …",
    "link": "https://www.channelnewsasia.com/business/trump-administration-renegotiating-overly-generous-biden-chips-act-grants-5166311",
    "timestamp": "2025-06-04T16:17:06Z"
  },
  {
    "title": "Trump renegotiating Biden-era Chips Act grants, Lutnick says",
    "description": "WASHINGTON :President Donald Trump's administration is renegotiating some of former President Joe Biden's grants to semiconductor firms, U.S. Commerce Secretary Howard Lutnick said at a hearing on Wednesday, suggesting some awards may be axed. Some of the Bid…",
    "link": "https://www.channelnewsasia.com/business/trump-renegotiating-biden-era-chips-act-grants-lutnick-says-5166311",
    "timestamp": "2025-06-04T16:17:06Z"
  },
  {
    "title": "Massie calls on Elon Musk to fund primary challenges against Republicans who backed Trump tax bill",
    "description": "Rep. Thomas Massie is calling on Elon Musk to fund election challenges against Republicans who supported President Donald Trump's agenda bill.",
    "link": "https://www.foxnews.com/politics/massie-calls-elon-musk-fund-primary-challenges-against-republicans-who-backed-trump-tax-bill",
    "timestamp": "2025-06-04T16:14:58Z"
  },
  {
    "title": "Harvard Students 'Incredibly Afraid' Over Future Career After Trump's Move",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere has been a chill in the air at Harvard University since President Donald Trump began his unprecedented attack on the college.\nHarvard University is going toe-to-toe against the administration in a high-s…",
    "link": "https://biztoc.com/x/1699d8f1af89f331",
    "timestamp": "2025-06-04T16:14:55Z"
  },
  {
    "title": "Gavin Newsom Defies Trump With Groundbreaking Pollution Program",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCalifornia Governor Gavin Newsom has responded to President Donald Trump's rollback of climate protections by unveiling a \"first-of-its-kind\" pollution monitoring program.\nThe state is launching its Statewide …",
    "link": "https://biztoc.com/x/2dcabaaccf16ce08",
    "timestamp": "2025-06-04T16:14:20Z"
  },
  {
    "title": "Restaurant Worker Wrestled to Ground by ICE Agents in the Middle of Shift",
    "description": "DHS told Newsweek that the man was using a false name and Social Security number.",
    "link": "https://www.newsweek.com/romero-edilzar-yaxcal-tiul-early-bird-worker-detained-ice-2080947",
    "timestamp": "2025-06-04T16:13:44Z"
  },
  {
    "title": "Middle East Leaders Surprisingly Fine With Iran Enriching Uranium, Lankford Says",
    "description": "Leaders in a handful of Middle Eastern countries are surprisingly sanguine about the prospect of Iran enriching its own uranium, Sen. James Lankford, R-Okla., told... Read More\nThe post Middle East Leaders Surprisingly Fine With Iran Enriching Uranium, Lankfo…",
    "link": "https://www.dailysignal.com/2025/06/04/middle-east-leaders-surprisingly-fine-iran-enriching-uranium-lankford-says/",
    "timestamp": "2025-06-04T16:12:05Z"
  },
  {
    "title": "The 4chan-Coded Ideology Behind Elon Musk’s War on Normies",
    "description": "In September, Elon Musk amplified a post from Autism Capital—a pro-Trump X account that he often reposts—that read: “Only high T alpha males and aneurotypical people (hey autists!) are actually free to parse new information with an objective ‘is this true?’ f…",
    "link": "https://www.motherjones.com/politics/2025/06/elon-musk-aspie-supremacy-4chan-autism/",
    "timestamp": "2025-06-04T16:12:01Z"
  },
  {
    "title": "Trump's tax bill would add $2.4 trillion to the debt, says Congress' budget watchdog",
    "description": "The Trump-backed budget bill has come under fire from former DOGE head Elon Musk and some GOP senators as it moves through Congress.",
    "link": "https://www.cnbc.com/2025/06/04/trump-tax-bill-debt.html",
    "timestamp": "2025-06-04T16:10:13Z"
  },
  {
    "title": "Adjusting Imports of Aluminum and Steel into the United States (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nAdjusting Imports of Aluminum and Steel into the United States  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  1. On January 11, 2018, the Secretary of Commerce (Secretary) transmitted to me a report on th…",
    "link": "https://www.memeorandum.com/250604/p69",
    "timestamp": "2025-06-04T16:10:01Z"
  },
  {
    "title": "CBO Projects Trump Tariffs to Cut Budget Gap by $2.8 Trillion",
    "description": "President Donald Trump’s tariff policies in effect as of mid-May would help to shrink US fiscal deficits by an estimated $2.8 trillion, according to the nonpartisan Congressional Budget Office.",
    "link": "https://financialpost.com/pmn/business-pmn/cbo-projects-trump-tariffs-to-cut-budget-gap-by-2-8-trillion",
    "timestamp": "2025-06-04T16:08:56Z"
  },
  {
    "title": "'Act of self-deception': Trump faces crisis as GOP rebels vow to dig in heels",
    "description": "WASHINGTON — President Donald Trump and House Speaker Mike Johnson need to back off — or so argue many Senate Republicans set on overhauling the House-passed\r\n One Big Beautiful Bill Act, which would turn much of Trump's campaign rhetoric into law. After the …",
    "link": "https://www.rawstory.com/raw-investigates/trump-budget-bill-spending-cuts/",
    "timestamp": "2025-06-04T16:07:43Z"
  },
  {
    "title": "Harvard Students 'Incredibly Afraid' Over Future Career After Trump's Move",
    "description": "\"I am incredibly afraid,\" Alfred Williamson, a Harvard student from Wales, who is currently studying in Denmark, told Newsweek.",
    "link": "https://www.newsweek.com/harvard-university-student-afraid-trump-immigration-2080881",
    "timestamp": "2025-06-04T16:07:40Z"
  },
  {
    "title": "Trump airs frustrations with Xi and Powell over elusive economic goals",
    "description": "President Donald Trump’s overnight volley of social media posts revealed his frustrations with decision makers whose cooperation he needs to secure some of his top economic objectives.",
    "link": "https://www.nbcnews.com/business/economy/trump-frustrated-over-china-jerome-powell-elusive-economic-goals-rcna210929",
    "timestamp": "2025-06-04T16:07:14Z"
  },
  {
    "title": "Mar-A-Lago Intruder Busted After Jumping Wall To Marry Trump’s Granddaughter: Police",
    "description": "Anthony Thomas Reyes said he intended to “spread the gospel\" to Trump and marry the president's 18-year-old granddaughter, according to police.",
    "link": "https://www.huffpost.com/entry/mar-a-lago-trespasser-anthony-reyes-kai-trump_n_68404e38e4b0cc37620116e5",
    "timestamp": "2025-06-04T16:07:00Z"
  }
]