[
  {
    "title": "'I wanted to be a good boy': Trump gripes about Supreme Court ruling",
    "description": "President Donald Trump criticized liberal justices following the Supreme Court's 6-3 ruling against his tariff authority. In his first public comments on the decision during a White House press briefing, Trump called the ruling \"deeply disappointing.\" He accu…",
    "link": "https://www.rawstory.com/tariffs-2675289336/",
    "timestamp": "2026-02-20T19:56:23Z"
  },
  {
    "title": "Democrats Call for Refunds for Americans After SCOTUS Strikes Down Tariffs",
    "description": "“Any refunds must end up in the pockets of the Americans who were illegally cheated out of their money,” said Warren.",
    "link": "https://truthout.org/articles/democrats-call-for-refunds-for-americans-after-scotus-strikes-down-tariffs/",
    "timestamp": "2026-02-20T19:56:04Z"
  },
  {
    "title": "Trump announces 10% global tariff following SCOTUS ruling",
    "description": "The United States Supreme Court ruled on Friday that President Donald Trump could not use national emergency powers to levy tariffs during peacetime.",
    "link": "https://cointelegraph.com/news/trump-10-global-tariff-scotus-ruling",
    "timestamp": "2026-02-20T19:55:07Z"
  },
  {
    "title": "‘I can destroy the country!’ Trump doesn't hold back on reaction to Supreme Court ruling",
    "description": "President Donald Trump attacked the Supreme Court's 6-3 ruling against his tariff authority, calling the decision \"ridiculous.\" The court determined Trump acted outside his authority when imposing tariffs under the International Emergency Economic Powers Act,…",
    "link": "https://www.rawstory.com/tariffs-2675289448/",
    "timestamp": "2026-02-20T19:54:56Z"
  },
  {
    "title": "Supreme Court Leaves No Clear Way For Consumers To Get Tariff Refunds",
    "description": "Sen. Elizabeth Warren (D-Mass.) said consumers, not big corporations, should get refunds.",
    "link": "https://www.huffpost.com/entry/trump-tariff-refunds-supreme-court_n_6998b43fe4b041f92b426de8",
    "timestamp": "2026-02-20T19:54:03Z"
  },
  {
    "title": "‘Fake News!’ Trump Rejects Question From CNN After Disputed Report About His Reaction to Tariff Decision",
    "description": "Donald Trump made a point of not calling on CNN's Kristen Holmes at his press conference following the SCOTUS rejection of his sweeping tariffs.\nThe post ‘Fake News!’ Trump Rejects Question From CNN After Disputed Report About His Reaction to Tariff Decision …",
    "link": "https://www.mediaite.com/media/news/fake-news-trump-rejects-question-from-cnn-after-disputed-report-about-his-reaction-to-tariff-decision/",
    "timestamp": "2026-02-20T19:53:33Z"
  },
  {
    "title": "America is at risk of becoming an automotive backwater",
    "description": "For decades, America's auto industry was the envy of the world, driven by mass production, the rise of Detroit's Big Three automakers, and the iconic stylings of the 1950s and '60s. Then, through a series of blunders and missteps, things started to unravel. T…",
    "link": "https://www.theverge.com/transportation/882194/america-auto-backwater-ev-loss-detroit-trump-emissions",
    "timestamp": "2026-02-20T19:52:37Z"
  },
  {
    "title": "Iran prepares counterproposal as Trump weighs strikes",
    "description": "WASHINGTON, ⁠Feb 20 (Reuters) - Iran's foreign minister said on Friday he expected to have a draft counterproposal ready within days following ⁠nuclear talks with the United States this week, while U.S. President Donald Trump said he was considering limited ‌…",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/iran-prepares-counterproposal-as-trump-weighs-strikes",
    "timestamp": "2026-02-20T19:51:00Z"
  },
  {
    "title": "Embraer joins Northrop to devise autonomous boom system for KC-890 tanker",
    "description": "The deal aims to court international buyers and the Air Force as it sketches out its future refueling program.",
    "link": "https://www.defenseone.com/business/2026/02/embraer-joins-northrop-devise-autonomous-boom-system-kc-890-tanker/411576/",
    "timestamp": "2026-02-20T19:50:14Z"
  },
  {
    "title": "Susan Rice Reveals Democrats’ Terrifying Plan for When They Return to Power",
    "description": "Susan Rice has a message for corporate America, and it sounds a lot like a threat. Obama’s scandal-plagued former U.S. Ambassador to the United Nations sat down with former federal prosecutor Preet Bharara on his podcast Stay Tuned and laid out what Democrats…",
    "link": "https://freerepublic.com/focus/f-news/4367651/posts",
    "timestamp": "2026-02-20T19:49:48Z"
  },
  {
    "title": "Canada Faces New, Unpredictable Trump Tools After Tariff Ruling",
    "description": "Canadian businesses can’t relax in light of the US Supreme Court decision striking down President Donald Trump’s emergency tariffs, experts said — the ruling simply moves his America First trade policy into a volatile new phase.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-faces-new-unpredictable-trump-tools-after-tariff-ruling",
    "timestamp": "2026-02-20T19:49:13Z"
  },
  {
    "title": "Trump vows 10% global tariff after stinging court rebuke",
    "description": "US President Donald Trump has vowed to introduce a blanket 10 per cent levy on all imports, after the Supreme Court struck down his use of a 1977 emergency powers law to impose tariffs.",
    "link": "https://www.channelnewsasia.com/world/us-supreme-court-trump-tariff-imports-5943711",
    "timestamp": "2026-02-20T19:49:00Z"
  },
  {
    "title": "Trump orders temporary 10% global tariff to replace duties struck down by US Supreme Court",
    "description": "WASHINGTON, Feb 20 (Reuters) - U.S. ⁠President Donald Trump said on Friday that he would ⁠impose a 10% global tariff for 150 days ‌to replace some of his emergency duties that were struck down by the U.S. Supreme Court. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/trump-orders-temporary-10-global-tariff-to-replace-duties-struck-down-by-us-supreme-court",
    "timestamp": "2026-02-20T19:49:00Z"
  },
  {
    "title": "The CDC Has a Leadership Crisis",
    "description": "A 2023 law championed by Republicans requires the CDC have a director confirmed by the Senate. For months, though, it's had only acting directors—and the White House won't say when that will change.",
    "link": "https://www.wired.com/story/the-cdc-has-a-leadership-crisis/",
    "timestamp": "2026-02-20T19:48:26Z"
  },
  {
    "title": "Yosemite, Arches, and Glacier National Parks Have All Changed Their Entry Requirements for 2026",
    "description": "Planning a last-minute trip to Yosemite or Arches national parks just got easier—at least on paper. The Department of the Interior announced this week that it is canceling the seasonal timed-entry reservation systems at Yosemite National Park in California an…",
    "link": "https://freerepublic.com/focus/f-news/4367650/posts",
    "timestamp": "2026-02-20T19:48:08Z"
  },
  {
    "title": "Trump vows 10% global tariff after stinging court rebuke",
    "description": "After the Supreme Court struck down his use of emergency powers, Donald Trump vowed to impose a new 10% global tariff on all imports to the United States.\n\nRead More: https://punchng.com/trump-vows-10-global-tariff-after-stinging-court-rebuke/",
    "link": "https://punchng.com/trump-vows-10-global-tariff-after-stinging-court-rebuke/",
    "timestamp": "2026-02-20T19:47:23Z"
  },
  {
    "title": "Trump Touts His Reading Comprehension Skills During Tariff Presser: ‘I Read Very Well’",
    "description": "President Donald Trump bizarrely touted his reading comprehension skills on Friday as he ripped into the Supreme Court for killing his tariffs.\nThe post Trump Touts His Reading Comprehension Skills During Tariff Presser: ‘I Read Very Well’ first appeared on M…",
    "link": "https://www.mediaite.com/media/news/trump-touts-his-reading-comprehension-skills-during-tariff-presser-i-read-very-well/",
    "timestamp": "2026-02-20T19:46:49Z"
  },
  {
    "title": "Senate Republican takes a victory lap as Trump gets Supreme Court smackdown",
    "description": "Sen. Mitch McConnell (R-KY) took a victory lap after the U.S. Supreme Court shot down President Donald Trump's tariffs.The court ruled 6-3 that the 79-year-old president had unlawfully invoked the 1977 International Emergency Economic Powers Act to impose swe…",
    "link": "https://www.rawstory.com/mitch-mcconnell-trump-2675289185/",
    "timestamp": "2026-02-20T19:45:02Z"
  },
  {
    "title": "The battle over Trump tariff refunds is next — and it will be messy",
    "description": "The process for IEEPA tariff refunds will likely go through the Court of International Trade. Already, over 1,000 lawsuits are pending.",
    "link": "https://www.businessinsider.com/trump-tariff-refund-process-how-works-court-international-trade-2026-2",
    "timestamp": "2026-02-20T19:44:50Z"
  },
  {
    "title": "What are Sections 232, 301 and 122 of different trade acts? Special sections of US trade laws used by President Donald Trump to impose tariffs explained",
    "description": "What are Sections 232, 301 and 122 of different trade acts? President Trump announced a new 10% global tariff under Section 122 after the Supreme Court struck down some emergency tariffs. Sections 232 and 301 tariffs remain in place. These laws allow presiden…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-are-sections-232-301-and-122-of-different-trade-acts-special-sections-of-us-trade-laws-used-by-president-donald-trump-to-impose-tariffs-explained/articleshow/128622424.cms",
    "timestamp": "2026-02-20T19:43:33Z"
  },
  {
    "title": "Trump Orders New 10 Percent 'Global Tariff' After Supreme Court's Rebuke",
    "description": "The new tariff will be implemented under a 1974 law that gives the president authority to impose tariffs for up to 150 days.",
    "link": "https://reason.com/2026/02/20/trump-orders-new-10-percent-global-tariff-after-supreme-courts-rebuke/",
    "timestamp": "2026-02-20T19:41:14Z"
  },
  {
    "title": "Raw sugar finds support after Supreme Court tariff ruling",
    "description": "Raw sugar futures briefly extended gains after the Supreme Court struck down President Donald Trump’s global tariffs. Read more here",
    "link": "https://financialpost.com/commodities/raw-sugar-finds-support-tariff-ruling",
    "timestamp": "2026-02-20T19:39:54Z"
  },
  {
    "title": "Trump hits out at 'deeply disappointing' Supreme Court decision",
    "description": "The president also said that in an effort to \"protect\" the US, he will charge more under other statutes and announced a new 10% global levy.",
    "link": "https://www.bbc.com/news/videos/ce94vrdxx5ko",
    "timestamp": "2026-02-20T19:39:21Z"
  },
  {
    "title": "'Saudi Arabia may have uranium enrichment chapter in US deal'",
    "description": "Saudi Arabia could develop uranium enrichment facilities under a proposed nuclear agreement with the United States. This development raises concerns about nuclear proliferation, especially with ongoing tensions surrounding Iran's nuclear program. Previous US …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/saudi-arabia-may-have-uranium-enrichment-chapter-in-us-deal/articleshow/128622545.cms",
    "timestamp": "2026-02-20T19:39:15Z"
  },
  {
    "title": "‘Morning Joe’ Says Republicans Are Embarrassed by Trump’s Affordability Tour: ‘Cringing’ | Video",
    "description": "\"Every time the president goes out on one of these trips, they're just praying, 'Please, dear God,'\" journalist John Heilemann says\nThe post ‘Morning Joe’ Says Republicans Are Embarrassed by Trump’s Affordability Tour: ‘Cringing’ | Video appeared first on The…",
    "link": "https://www.thewrap.com/media-platforms/journalism/morning-joe-donald-trump-affordability-tour-republicans/",
    "timestamp": "2026-02-20T19:38:51Z"
  },
  {
    "title": "Trump's face is now on the Justice Department headquarters",
    "description": "While Trump banners have been hung outside other agencies across Washington, the decision to place one on the storied Justice Department building amounted to a striking symbol of the erosion of the department's tradition of independence from White House contr…",
    "link": "https://www.pbs.org/newshour/politics/trumps-face-is-now-on-the-justice-department-headquarters",
    "timestamp": "2026-02-20T19:38:28Z"
  },
  {
    "title": "Hunter Hess crashes out in freestyle halfpipe final after addressing Trump ‘loser’ label",
    "description": "Hunter Hess’ Olympic dream is hanging by a thread.",
    "link": "https://nypost.com/2026/02/20/sports/hunter-hess-crashes-out-in-freestyle-halfpipe-final/",
    "timestamp": "2026-02-20T19:38:11Z"
  },
  {
    "title": "'Huge Relief': Small Business Owners Celebrate Supreme Court Striking Down Trump's Tariffs",
    "description": "The battle against the president's so-called reciprocal tariffs is won, but the war for free trade and a stable business environment continues.",
    "link": "https://reason.com/2026/02/20/small-business-owners-celebrate-supreme-court-striking-down-trumps-tariffs/",
    "timestamp": "2026-02-20T19:37:21Z"
  },
  {
    "title": "‘I Don’t Need to!’ Trump Insists He STILL Doesn’t Need Congress to Approve Tariffs",
    "description": "President Donald Trump on Friday insisted he still didn't need congressional approval for tariffs despite the Supreme Court saying the opposite in its ruling.\nThe post ‘I Don’t Need to!’ Trump Insists He STILL Doesn’t Need Congress to Approve Tariffs first ap…",
    "link": "https://www.mediaite.com/politics/i-dont-need-to-trump-insists-he-still-doesnt-need-congress-to-approve-tariffs/",
    "timestamp": "2026-02-20T19:36:39Z"
  },
  {
    "title": "What is Section 122 of the US Trade Act of 1974, Trump’s latest tariff weapon for 10% extra duty on the world",
    "description": "President Trump announced a 10% global tariff under Section 122 of the Trade Act of 1974, shifting from the International Emergency Economic Powers Act (IEEPA) after a Supreme Court ruling. This new measure, permitted for temporary import surcharges due to in…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-is-section-122-of-the-us-trade-act-of-1974-trumps-latest-tariff-weapon-for-10-extra-duty-on-the-world/articleshow/128622111.cms",
    "timestamp": "2026-02-20T19:36:14Z"
  },
  {
    "title": "Trump Says US Will Release Files Related To Aliens And UFOs",
    "description": "Trump Says US Will Release Files Related To Aliens And UFOslittlethings.com",
    "link": "https://littlethings.com/entertainment/trump-will-release-files-aliens-ufos",
    "timestamp": "2026-02-20T19:35:59Z"
  },
  {
    "title": "US Supreme Court curbs Trump tariffs under IEEPA: What’s struck down, what still stands",
    "description": "The Supreme Court has delivered a surprising verdict, striking down President Trump's tariffs on imported goods. The justices concluded that he had exceeded his legal authority under a specific statute, which led to taxes on products from a range of countries…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-curbs-trump-tariffs-under-ieepa-whats-struck-down-what-still-stands/articleshow/128622435.cms",
    "timestamp": "2026-02-20T19:35:57Z"
  },
  {
    "title": "Trump Goes on Bonkers Riff About Not Wanting to Kiss a Dude — Second ‘No Homo’ Rant in Two Days",
    "description": "Trump went on a bonkers riff about not wanting to kiss a man as he took questions — the day after he delivered a similarly-themed gag in another speech.\nThe post Trump Goes on Bonkers Riff About Not Wanting to Kiss a Dude — Second ‘No Homo’ Rant in Two Days f…",
    "link": "https://www.mediaite.com/media/news/trump-goes-on-bonkers-riff-about-not-wanting-to-kiss-a-dude-second-no-homo-rant-in-two-days/",
    "timestamp": "2026-02-20T19:32:26Z"
  },
  {
    "title": "What's New to Watch on Disney+ and Hulu the Week of Feb. 20, 2026",
    "description": "Scrubs returns, plus the freaky tales of an astronaut returning from deep space and a bunker at the end of the world, all streaming this week.\nDisney+ and Hulu are performing the Dragonball fusion dance this year, and now have a combined login, so you can get…",
    "link": "https://me.pcmag.com/en/old-video-streaming-services/35444/whats-new-to-watch-on-disney-and-hulu-the-week-of-feb-20-2026",
    "timestamp": "2026-02-20T19:31:32Z"
  },
  {
    "title": "What's New to Watch on Disney+ and Hulu the Week of Feb. 20, 2026",
    "description": "Scrubs returns, plus the freaky tales of an astronaut returning from deep space and a bunker at the end of the world, all streaming this week.\nDisney+ and Hulu are performing the Dragonball fusion dance this year, and now have a combined login, so you can get…",
    "link": "https://uk.pcmag.com/video-streaming-services/163281/whats-new-to-watch-on-disney-and-hulu-the-week-of-feb-20-2026",
    "timestamp": "2026-02-20T19:31:32Z"
  },
  {
    "title": "Trump Announces Alternative Tariff Plan After Supreme Court Ruling",
    "description": "President Donald Trump said the Supreme Court ruling against his tariffs actually affirms his authority to levy additional national security tariffs, and announced a 10%... Read More\nThe post Trump Announces Alternative Tariff Plan After Supreme Court Ruling …",
    "link": "https://www.dailysignal.com/2026/02/20/trump-announces-alternative-tariff-plan-after-supreme-court-ruling/",
    "timestamp": "2026-02-20T19:31:00Z"
  },
  {
    "title": "Cracking Down on China’s Trade Cheating the Right Way",
    "description": "As a longtime advocate for free enterprise, economic growth, and policies that put American workers and small businesses first, I’ve cheered President Donald Trump’s decisive crackdown on trade abuses... Read More\nThe post Cracking Down on China’s Trade Cheat…",
    "link": "https://www.dailysignal.com/2026/02/20/cracking-down-on-chinas-trade-cheating-the-right-way/",
    "timestamp": "2026-02-20T19:30:00Z"
  },
  {
    "title": "FCC calls on broadcasters to air ‘pro-America content’ for the country’s 250th anniversary",
    "description": "Federal Communications Commission Chair Brendan Carr is urging broadcasters to air \"patriotic, pro-America content\" in celebration of the US's 250th anniversary. The initiative, called the \"Pledge America Campaign,\" encourages broadcasters to run public servi…",
    "link": "https://www.theverge.com/policy/882250/fcc-brendan-carr-pro-america-content-250-anniversary",
    "timestamp": "2026-02-20T19:29:34Z"
  },
  {
    "title": "Team USA flag bearers revealed for 2026 Winter Olympics Closing Ceremony",
    "description": "The 2026 Winter Olympics have been a resounding success for many Americans and now the Team USA flag bearers have been named for the Closing Ceremony. The Americans have revealed the two members of their large contingent that will carry…",
    "link": "https://www.thebiglead.com/team-usa-flag-bearers-revealed-for-2026-winter-olympics-closing-ceremony/",
    "timestamp": "2026-02-20T19:29:04Z"
  },
  {
    "title": "Trump to Impose 10% Global Tariff After Supreme Court Defeat",
    "description": "President Donald Trump said he would sign an order imposing a 10% global tariff after the Supreme Court struck down the bulk of the levies he imposed last year, and pledged a raft of investigations that could allow him to enact more import taxes.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-impose-10-global-tariff-after-supreme-court-defeat",
    "timestamp": "2026-02-20T19:28:55Z"
  },
  {
    "title": "Donald Trump Says Nancy Guthrie Abduction Gets Too Much Press Coverage: ‘We Have to …",
    "description": "Reading Time: 2 minutesDonald Trump's latest remarks about Nancy Guthrie's disappearance struck many as insensitive.\nDonald Trump Says Nancy Guthrie Abduction Gets Too Much Press Coverage: ‘We Have to … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/donald-trump-says-nancy-guthrie-abduction-gets-too-much-press-coverage-we-have-to-start-reporting-on-other-subjects/",
    "timestamp": "2026-02-20T19:28:43Z"
  },
  {
    "title": "Import the War, Export the Border",
    "description": "If we are to avoid the worst possible outcomes of this conjuncture, we need an electoral left willing to countenance the collapse of liberalism and to be honest about the need to deconstruct our overseas empire.",
    "link": "https://www.nplusonemag.com/online-only/online-only/import-the-war-export-the-border/",
    "timestamp": "2026-02-20T19:28:36Z"
  },
  {
    "title": "Enraged Trump turns on his own Supreme Court picks: 'Embarrassment to their families'",
    "description": "President Donald Trump took a shot at two justices he nominated to be on the Supreme Court — Neil Gorsuch and Amy Coney Barrett — after they ruled that he had illegally imposed massive tariffs.\"Are you surprised in particular by their decision today?\" Trump w…",
    "link": "https://www.rawstory.com/trump-gorsuch-barrett-families/",
    "timestamp": "2026-02-20T19:27:44Z"
  },
  {
    "title": "SCOTUS strikes down Trump tariffs, but 'alternative' plans brewing",
    "description": "The Supreme Court of the United States has ruled against President Trump's authority to impose tariffs under the International Emergency Powers Act (IEEPA).",
    "link": "https://cointelegraph.com/news/scotus-strikes-trump-tariffs-alternative-plan",
    "timestamp": "2026-02-20T19:27:39Z"
  },
  {
    "title": "Trump suggests he won’t refund tariffs after Supreme Court ruling",
    "description": "President Donald Trump suggested he doesn’t plan to refund tariff fees already collected by the US government.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/20/trump-suggests-he-wont-refund-tariffs-after-supreme-court-ruling",
    "timestamp": "2026-02-20T19:27:25Z"
  },
  {
    "title": "US stock market surging big today: What’s fueling Dow Jones, S&P 500 and Nasdaq gains right now? Amazon, Nvidia and Magnificent Seven stocks power rally",
    "description": "US stock market surging big today: The Dow Jones Industrial Average jumped 120 points to 49,515, while the S&P 500 rose 0.57% to 6,900 and the Nasdaq surged 0.85% to 22,875 in a strong US stock market rally today. Investors reacted to the Supreme Court blocki…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-surging-big-today-whats-fueling-dow-jones-sp-500-and-nasdaq-gains-right-now-amazon-nvidia-and-magnificent-seven-stocks-power-rally/articleshow/128622215.cms",
    "timestamp": "2026-02-20T19:27:22Z"
  },
  {
    "title": "Trump on Iran: They’d better negotiate a fair deal",
    "description": "President Trump criticizes Iran's leadership for its violent crackdown on protesters, revealing that 32,000 people were killed. The comments come hours after he appeared to confirm he is considering a limited military strike on Iran to force a nuclear deal on…",
    "link": "https://www.israelnationalnews.com/news/422740",
    "timestamp": "2026-02-20T19:26:00Z"
  },
  {
    "title": "Party to the Conflict: Eugene Fights Back Against the Feds : On Spreading ICE Thin",
    "description": "A participant describes the clashes with federal agents and police that took place in Eugene, Oregon in January 2026—a microcosm of the resistance that is spreading ICE increasingly thin.",
    "link": "https://crimethinc.com/2026/02/20/party-to-the-conflict-eugene-fights-back-against-the-feds-on-spreading-ice-thin",
    "timestamp": "2026-02-20T19:24:33Z"
  },
  {
    "title": "Stocks rise after US Supreme Court ruling against Donald Trump’s tariffs",
    "description": "The Supreme Court decision could boost company earnings around the globe.",
    "link": "https://www.nzherald.co.nz/world/stocks-rise-after-us-supreme-court-ruling-against-donald-trumps-tariffs/JOSBUQ7I7NFTJKSKI2POH45ZT4/",
    "timestamp": "2026-02-20T19:23:55Z"
  },
  {
    "title": "'Happy liberation day': Premier Eby reacts to U.S. ruling against Trump's tariffs",
    "description": "Using President Donald Trump's own words against him, B.C. Premier David Eby reacted with a smug jab Friday morning after the U.S. Supreme Court ruled against Trump’s tariffs.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-eby-trump-tariff-ruling-9.7099563",
    "timestamp": "2026-02-20T19:23:47Z"
  },
  {
    "title": "As Trump Threatens Iran, We’re On the Brink of a Generational Catastrophe",
    "description": "A US war with Iran would be illegal, immoral, and dangerous. We can still stop it.",
    "link": "https://truthout.org/articles/as-trump-threatens-iran-were-on-the-brink-of-a-generational-catastrophe/",
    "timestamp": "2026-02-20T19:22:49Z"
  },
  {
    "title": "Did Trump once say Obama would start war with Iran due to his inability to negotiate?",
    "description": "Donald Trump once said, \"Our president will start a war with Iran because he has absolutely no ability to negotiate. He's weak and he's ineffective.\"",
    "link": "https://www.snopes.com//fact-check/video-trump-iran-obama/",
    "timestamp": "2026-02-20T19:22:00Z"
  },
  {
    "title": "Trump calls Supreme Court justices 'disloyal to the Constitution' over tariffs ruling",
    "description": "WASHINGTON — President Donald Trump on Friday launched an extraordinary attack on the Supreme Court after it ruled against him on tariffs, describing justices in the majority as a “disgrace to our nation\" and “very unpatriotic and disloyal to the Constitution…",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-calls-supreme-court-justices-disloyal-unpatriotic-tariffs-rcna259948",
    "timestamp": "2026-02-20T19:21:17Z"
  },
  {
    "title": "Donald Trump imposes a flat 10% global tariff following Supreme Court ruling",
    "description": "He lashed out at the judges who voted against, saying they are not patriots and calling them “Democrats’ stooges” — “Our opponents are dancing with joy over the decision, but it won’t last long,” he said\nThe post Donald Trump imposes a flat 10% global tariff …",
    "link": "https://en.protothema.gr/2026/02/20/donald-trump-imposes-a-flat-10-global-tariff-following-supreme-court-ruling/",
    "timestamp": "2026-02-20T19:20:53Z"
  },
  {
    "title": "Trump picks former personal lawyer from E. Jean Carroll case for 8th Circuit judicial vacancy",
    "description": "President Donald Trump on Wednesday announced that he has picked a former personal lawyer for a judical vacancy on the 8th U.S. Circuit Court of Appeals at St. Louis.",
    "link": "https://www.abajournal.com/news/article/trump-picks-personal-lawyer-from-e-jean-carroll-case-for-8th-circuit-vacancy",
    "timestamp": "2026-02-20T19:20:00Z"
  },
  {
    "title": "What to know about the Supreme Court ruling on Trump's tariffs",
    "description": "In its 6-3 opinion on Friday, the court ruled Trump's attempt to use an emergency powers law to enact the levies was not valid.",
    "link": "https://www.pbs.org/newshour/politics/what-to-know-about-the-supreme-court-ruling-on-trumps-tariffs",
    "timestamp": "2026-02-20T19:12:06Z"
  },
  {
    "title": "Here's what we know about the buildup of U.S. military assets in the Middle East",
    "description": "The Pentagon is sending the largest force of American warships and aircraft to the Middle East in decades, including two aircraft carrier strike groups, as President Donald Trump warns of possible military action against Iran if talks over its nuclear program…",
    "link": "https://www.pbs.org/newshour/world/heres-what-we-know-about-the-buildup-of-u-s-military-assets-in-the-middle-east",
    "timestamp": "2026-02-20T19:12:05Z"
  },
  {
    "title": "Trump Slaps World With New Tariff After Supreme Court Loss",
    "description": "President Donald Trump announced he was using different legal authorities to continue tariffs Friday after the Supreme Court struck down his use of IEEPA.",
    "link": "https://dailycaller.com/2026/02/20/trump-slaps-world-new-tariff-supreme-court-loss/",
    "timestamp": "2026-02-20T19:11:31Z"
  },
  {
    "title": "Trump Rants About Right to Destroy Countries After Tariffs Ruling",
    "description": "President Donald Trump claimed Friday the Supreme Court had granted him the power to destroy other countries,  after the high court took away his weapon of choice: sweeping reciprocal tariffs. Speaking to reporters, Trump rambled about how “ridiculous” it was…",
    "link": "https://newrepublic.com/post/206868/donald-trump-right-destroy-countries-tariffs-ruling",
    "timestamp": "2026-02-20T19:10:21Z"
  },
  {
    "title": "The Supreme Court Delivers Trump a Humiliating Gift",
    "description": "Finally, a check on the president’s tariff powers.",
    "link": "https://www.theatlantic.com/ideas/2026/02/supreme-court-tariffs-decision/686085/",
    "timestamp": "2026-02-20T19:10:00Z"
  },
  {
    "title": "Trump gives grudging praise to liberal trio who helped sink his tariffs",
    "description": "Supreme Court rules 6-3 that President Donald Trump exceeded authority using emergency powers for tariffs, with conservative justices dissenting from majority decision.",
    "link": "https://www.foxnews.com/politics/trump-gives-grudging-praise-liberal-trio-who-helped-sink-his-tariffs",
    "timestamp": "2026-02-20T19:09:11Z"
  },
  {
    "title": "The night the protests in Iran were co-opted by outside forces",
    "description": "The nights of January 8-9, 2026, saw Iran go up in a coordinated blaze after two weeks of protests. I, and many other Iranians, witnessed the breakdown in public order during those days, and the influence of outside forces instigating the explosion.",
    "link": "https://mondoweiss.net/2026/02/the-night-the-protests-in-iran-were-co-opted-by-outside-forces/",
    "timestamp": "2026-02-20T19:07:38Z"
  },
  {
    "title": "‘I failed to speak up’: Doctor apologizes for not vocally opposing trans surgeries on children",
    "description": "Cites undue influences against professionals who oppose so-called 'treatments'",
    "link": "https://www.wnd.com/2026/02/i-failed-speak-up-doctor-apologizes-not-vocally/",
    "timestamp": "2026-02-20T19:07:29Z"
  },
  {
    "title": "Supreme Court Rules Donald Trump’s Tariffs Are llegal Taxes , Social Media Clowns Him",
    "description": "The usual suspects, Clarence Thomas, Samuel A. Alito, Jr., and Brett M. Kavanaugh, sided with Trump.",
    "link": "https://hiphopwired.com/3046438/supreme-court-rules-donald-trump-tariffs-illegal-taxes-reactions/",
    "timestamp": "2026-02-20T19:07:19Z"
  },
  {
    "title": "Trump calls Supreme Court justices who struck down his tariffs ‘disgrace to our nation’ and vows fresh duties under other laws",
    "description": "\"I'm ashamed of certain members of the court, absolutely ashamed for not having the courage to do what's right for our country,\" Trump told reporters.",
    "link": "https://fortune.com/2026/02/20/trump-supreme-court-justices-ruling-ieepa-tariffs-disgrace-section-122-duties/",
    "timestamp": "2026-02-20T19:06:28Z"
  },
  {
    "title": "Argentina’s Chamber of Deputies passes controversial labour reform bill",
    "description": "Unions have slammed the reforms as an effort under libertarian President Javier Milei to erode protections for workers.",
    "link": "https://www.aljazeera.com/news/2026/2/20/argentinas-chamber-of-deputies-passes-controversial-labour-reform-bill",
    "timestamp": "2026-02-20T19:06:00Z"
  },
  {
    "title": "James Batmasian’s scaled-back Royal Palm Plaza Hotel project moves ahead",
    "description": "Developer James Batmasian’s plans to scale back his proposed Royal Palm Place Hotel project won approval from Boca Raton’s Planning and Zoning Board Thursday. The proposed 12-story hotel at 200 South Federal Highway, 75 Southeast Third Street, and 194 Southea…",
    "link": "https://therealdeal.com/miami/2026/02/20/james-batmasian-gets-green-light-for-royal-palm-plaza-hotel/",
    "timestamp": "2026-02-20T19:05:13Z"
  },
  {
    "title": "John Roberts' Rebuke of Trump's Tariffs Is Withering, Confident, and Genuinely Encouraging (Mark Joseph Stern/Slate)",
    "description": "Mark Joseph Stern / Slate:\nJohn Roberts' Rebuke of Trump's Tariffs Is Withering, Confident, and Genuinely Encouraging … The Supreme Court struck down Donald Trump's sweeping “emergency” tariffs on Friday, ruling 6-3 that they far exceed what federal law allow…",
    "link": "https://www.memeorandum.com/260220/p73",
    "timestamp": "2026-02-20T19:05:05Z"
  },
  {
    "title": "‘I can destroy the country!’ Trump goes ballistic over Supreme Court ruling",
    "description": "President Donald Trump erupted at the Supreme Court on Friday after it ruled against his authority to impose sweeping tariffs, vowing to circumvent its decision with “alternatives” and lambasting the justices for their \"ridiculous opinion,” which he claimed p…",
    "link": "https://www.rawstory.com/trump-tariffs-2675289258/",
    "timestamp": "2026-02-20T19:04:32Z"
  },
  {
    "title": "Planned Parenthood rolls out vasectomies at Mass. health centers",
    "description": "A playful Valentine’s Day announcement unveiled the long-requested service of vasectomies, which are 99% effective at preventing pregnancy.",
    "link": "https://www.boston.com/news/health/2026/02/20/planned-parenthood-rolls-out-vasectomies-at-mass-health-centers/",
    "timestamp": "2026-02-20T19:04:01Z"
  },
  {
    "title": "India Joins U.S. Initiative to Build Secure Technology Supply Chains",
    "description": "India on Friday joined the Pax Silica framework, a U.S.-led effort to create a secure supply chain for critical technologies that would be immune to meddling from China. India’s membership had been in doubt due to trade tensions with the United States under P…",
    "link": "https://www.breitbart.com/national-security/2026/02/20/india-joins-u-s-initiative-to-build-secure-technology-supply-chains/",
    "timestamp": "2026-02-20T19:03:49Z"
  },
  {
    "title": "Trump announces new 10% global tariff after raging over Supreme Court loss",
    "description": "President Donald Trump said Friday he will sign an executive order imposing a new 10% “global tariff,” hours after the Supreme Court struck down his sweeping “reciprocal” import duties in a major rebuke of his trade agenda. The new tariffs will come on top of…",
    "link": "https://freerepublic.com/focus/f-news/4367647/posts",
    "timestamp": "2026-02-20T19:03:20Z"
  },
  {
    "title": "India-US trade deal unchanged, New Delhi still pays tariffs, Trump says",
    "description": "President Donald Trump has confirmed that tariffs on India will stay at 18 percent. This decision comes after a recent legal challenge to his wider tariff policies. India will not see any immediate changes to the current trade terms. Washington aims to keep c…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/donald-trump-says-india-tariffs-to-stay-intact-despite-sc-setback/articleshow/128621490.cms",
    "timestamp": "2026-02-20T19:02:59Z"
  },
  {
    "title": "Supreme Court’s tariff ruling could be good news for device pricing",
    "description": "SCOTUS pulls the plug on most of Trump's tariffs.",
    "link": "https://www.androidauthority.com/scotus-strikes-down-tariffs-3642826/",
    "timestamp": "2026-02-20T19:02:45Z"
  },
  {
    "title": "Trump Attacks Justices as “Unpatriotic and Disloyal” After Tariffs Ruling",
    "description": "Allowing the tariffs to stand would be a “transformative expansion” of unchecked presidential powers, the court ruled.",
    "link": "https://truthout.org/articles/trump-attacks-justices-as-unpatriotic-and-disloyal-after-tariffs-ruling/",
    "timestamp": "2026-02-20T19:02:11Z"
  },
  {
    "title": "In NCLA Win, Supreme Court Agrees Trump Admin. Cannot Use IEEPA to Impose Emergency Tariffs",
    "description": "Learning Resources, Inc. and hand2mind, Inc. v. President Donald J. Trump, et al.; President Donald J. Trump, et al. v. V.O.S. Selections, Inc., et al. Learning Resources, Inc. and hand2mind, Inc. v. President Donald J. Trump, et al.; President Donald J. Trum…",
    "link": "https://www.globenewswire.com/news-release/2026/02/20/3242104/0/en/In-NCLA-Win-Supreme-Court-Agrees-Trump-Admin-Cannot-Use-IEEPA-to-Impose-Emergency-Tariffs.html",
    "timestamp": "2026-02-20T19:02:00Z"
  },
  {
    "title": "Trump Slaps 10% Global Tariff Using New Trade Law After Supreme Court Defeat",
    "description": "U.S. President Donald Trump said on Friday that he would impose a 10% global tariff for 150 days to replace some of his emergency duties that were struck down by the U.S. Supreme Court.",
    "link": "https://gcaptain.com/trump-slaps-10-global-tariff-using-new-trade-law-after-supreme-court-defeat/",
    "timestamp": "2026-02-20T19:01:44Z"
  },
  {
    "title": "Trump Bashes ‘Disloyal’ Supreme Court for Not Letting Him Defy Constitution",
    "description": "President Donald Trump accused the Supreme Court of being \"disloyal\" after the justices ruled against his authority to unilaterally implement tariffs.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-bashes-supreme-court-disloyal-tariff-ruling-1235520144/",
    "timestamp": "2026-02-20T19:01:40Z"
  },
  {
    "title": "Trump’s immediate response to the Supreme Court tariff ruling: 10% global tariffs announced, legal pivot unveiled, ‘disloyal’ justices targeted amid trade turmoil",
    "description": "Trump’s immediate response to the Supreme Court tariff ruling: $160 billion in tariffs vanished instantly following a landmark 6-3 Supreme Court ruling. The Court blocked President Trump’s use of IEEPA for global trade taxes. In response, Trump signed a 10% g…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-immediate-response-to-the-supreme-court-tariff-ruling-10-global-tariffs-announced-legal-pivot-unveiled-disloyal-justices-targeted-amid-trade-turmoil/articleshow/128621229.cms",
    "timestamp": "2026-02-20T19:01:40Z"
  },
  {
    "title": "Trump endorses self-described ‘Nazi-ish’ Texas Republican as Peter Thiel backs his bid for Congress",
    "description": "A Texas Republican congressional candidate who has said critics might call his views “bigoted and backward and oppressive and Nazi-ish” got a high-profile boost this week from President Donald Trump and is already drawing financial backing from Peter Thiel, t…",
    "link": "https://www.advocate.com/politics/national/jace-yarbrough-extremist-texas-candidate",
    "timestamp": "2026-02-20T19:01:21Z"
  },
  {
    "title": "Trump’s order to release evidence for aliens obscures the scientific search for extraterrestrial life",
    "description": "On Thursday the U.S. president ordered the release of federal files related to UFOs and aliens, although no evidence of extraterrestrials visiting Earth is known to exist",
    "link": "https://www.scientificamerican.com/article/trumps-order-to-release-evidence-for-aliens-obscures-the-scientific-search/",
    "timestamp": "2026-02-20T19:00:00Z"
  },
  {
    "title": "India joins U.S. ‘Pax Silica’ semiconductor alliance easing tariff and energy tensions",
    "description": "\"India’s entry into Pax Silica isn’t just symbolic. Its strategic, its essential,” said U.S. Ambassador Sergio Gor.",
    "link": "https://fortune.com/2026/02/20/india-us-pax-silica-semiconductor-alliance-ai-summit/",
    "timestamp": "2026-02-20T18:59:54Z"
  },
  {
    "title": "Trump’s Epic Loss on Tariffs Is Even Worse for Him than You Think",
    "description": "The Supreme Court’s stunning decision invalidating Donald Trump’s tariffs isn’t just a major legal setback, though it certainly is that. The loss before the high court is also another sign that the pillars of Trump’s right-wing nationalist agenda are crumblin…",
    "link": "https://newrepublic.com/article/206866/trump-tariffs-supreme-court-ruling-epic-loss-worse-think",
    "timestamp": "2026-02-20T18:59:40Z"
  },
  {
    "title": "Midlife Women Are a Sleeping Giant Voter Bloc in 2026—Even as the SAVE Act Puts Them at Risk",
    "description": "Since 2024, there has been handwringing among politicos about the rightward shift of young male voters in the United States. And now, a new report from the centrist think tank Third Way predicts many of the “swingy, moderate, low-propensity young men” who sup…",
    "link": "https://msmagazine.com/2026/02/20/midlife-older-women-voters-election-menopause-save-act/",
    "timestamp": "2026-02-20T18:59:10Z"
  },
  {
    "title": "Trump Vows to Use ‘Even Stronger’ Methods to Keep His Tariffs: ‘I Can Destroy the Country’",
    "description": "\"But I am allowed to cut off any and all trade or business with that same country. In other words, I can destroy the trade. I can destroy the country!\"\nThe post Trump Vows to Use ‘Even Stronger’ Methods to Keep His Tariffs: ‘I Can Destroy the Country’ first a…",
    "link": "https://www.mediaite.com/media/tv/trump-vows-to-use-even-stronger-methods-to-keep-his-tariffs-i-can-destroy-the-country/",
    "timestamp": "2026-02-20T18:57:52Z"
  },
  {
    "title": "Illinois officials decry proposed cuts to HIV care",
    "description": "State officials, LGBTQ+ advocates, and public health experts across Illinois are sharply condemning efforts by President Donald Trump’s administration to strip $600 million in public health funding from four Democrat-led states—including nearly $8 million in …",
    "link": "http://chicagoreader.com/news/trump-illinois-hiv-public-health-funding/",
    "timestamp": "2026-02-20T18:57:38Z"
  },
  {
    "title": "Donald Trump says he will impose 10pc global tariff on top of ‘normal tariffs’ after Supreme Court ruling",
    "description": "US President Donald Trump said he would be imposing a 10pc global tariff “over and above our normal tariffs already being charged”, after the Supreme Court struck down his reciprocal levies policy.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-says-he-will-impose-10pc-global-tariff-on-top-of-normal-tariffs-after-supreme-court-ruling/a700587946.html",
    "timestamp": "2026-02-20T18:55:16Z"
  },
  {
    "title": "Robert De Niro Spews Conspiracies About Trump Not Leaving Office: 'It’s Up to Us to Get Rid of Him'",
    "description": "Rabid anti-Trump actor Robert De Niro is once again claiming that President Trump will refuse to leave office when his second term is up.\nThe post Robert De Niro Spews Conspiracies About Trump Not Leaving Office: ‘It’s Up to Us to Get Rid of Him’ appeared fir…",
    "link": "https://www.breitbart.com/entertainment/2026/02/20/robert-de-niro-spews-conspiracies-about-trump-not-leaving-office-its-up-to-us-to-get-rid-of-him/",
    "timestamp": "2026-02-20T18:55:08Z"
  },
  {
    "title": "‘Deceptive advertisement’: Red state battles nonprofit that helps 15-year-old girls get abortion pills",
    "description": "Corporation fighting to promote products despite legal ban",
    "link": "https://www.wnd.com/2026/02/deceptive-advertisement-red-state-battles-nonprofit-that-helps/",
    "timestamp": "2026-02-20T18:54:45Z"
  },
  {
    "title": "Ruling on US tariffs being assessed by EU amid fear that pharma and other sectors could now be hit",
    "description": "US supreme court rules that Donald Trump’s sweeping tariffs were illegal",
    "link": "https://www.irishtimes.com/business/2026/02/20/ruling-on-us-tariffs-being-assessed-by-eu-amid-fear-that-pharma-and-other-sectors-could-now-be-hit/",
    "timestamp": "2026-02-20T18:54:01Z"
  },
  {
    "title": "EXCLUSIVE: Andrew Windsor Assassination Fears Erupt After Arrest — 'They Want Him in Jail So They Can Murder Him… Just Like They Did to Jeffrey Epstein'",
    "description": "Andrew Windsor's dramatic arrest has triggered fears among his allies he could be targeted behind bars.",
    "link": "https://radaronline.com/p/andrew-windsor-arrest-assassination-fears-epstein-comparison/",
    "timestamp": "2026-02-20T18:53:26Z"
  },
  {
    "title": "‘Fools and Lapdogs!’ Trump Unleashes on Three Republican-Appointed Justices — Including Two He Picked",
    "description": "Donald Trump had exceedingly harsh words for the Supreme Court justices who voted to nullify his sweeping emergency tariffs.\nThe post ‘Fools and Lapdogs!’ Trump Unleashes on Three Republican-Appointed Justices — Including Two He Picked first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/fools-and-lapdogs-trump-unleashes-on-three-republican-appointed-justices-including-two-he-picked/",
    "timestamp": "2026-02-20T18:52:32Z"
  },
  {
    "title": "'I can do anything I want': Donald Trump defiant after U.S. Supreme Court tariff blow",
    "description": "President Donald Trump signals defiance after the Supreme Court struck down his tariff policy. He plans to use other legal avenues to advance his trade agenda. Trump announced immediate steps to impose a 10% global tariff and launch new investigations. This i…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/i-can-do-anything-i-want-donald-trump-defiant-after-u-s-supreme-court-tariff-blow/articleshow/128621156.cms",
    "timestamp": "2026-02-20T18:52:32Z"
  },
  {
    "title": "American Hunter Hess responds to Trump’s ‘loser’ criticism with ‘L’ gesture at Milan Cortina Olympics",
    "description": "Olympic skier Hunter Hess made an \"L\" gesture after President Donald Trump criticized him for saying he had \"mixed emotions\" about representing the U.S. at the Milan Cortina Games.",
    "link": "https://www.foxnews.com/sports/american-hunter-hess-responds-trumps-loser-criticism-l-gesture-milan-cortina-olympics",
    "timestamp": "2026-02-20T18:50:17Z"
  }
]