[
  {
    "title": "Ex-Ohio State coach Tressel joins list of sports figures who've moved into politics",
    "description": "Former Ohio State University coach Jim Tressel is being nominated to be the state’s next lieutenant governor",
    "link": "https://abcnews.go.com/US/wireStory/ohio-state-coach-jim-tressel-joins-long-list-118664367",
    "timestamp": "2025-02-10T21:26:07Z"
  },
  {
    "title": "Hot mic shocker: Justin Trudeau warns Donald Trump’s Canada takeover talk isn’t just rhetoric but real",
    "description": "In a latest development, renowned personality Justin Trudeau issued a severe warning regarding the Canada takeover of US President Donald Trump and then claimed that is not just a rhetoric but is actually something real.",
    "link": "https://economictimes.indiatimes.com/news/international/us/hot-mic-shocker-justin-trudeau-warns-donald-trumps-canada-takeover-talk-isnt-just-rhetoric-but-real/articleshow/118127516.cms",
    "timestamp": "2025-02-10T21:21:52Z"
  },
  {
    "title": "DOGE focuses on millions in migrant hotels billed to US taxpayers as DHS Sec. Noem targets key agency",
    "description": "Elon Musk suggested that FEMA, the government's federal disaster relief agency, spent millions on hotels for illegal immigrants just last week.",
    "link": "https://www.foxnews.com/politics/doge-focuses-millions-migrant-hotels-billed-us-taxpayers-dhs-sec-noem-targets-key-agency",
    "timestamp": "2025-02-10T21:21:49Z"
  },
  {
    "title": "11 Signs That A Recession In The U.S. May Have Already Started",
    "description": "The Biden administration has given us an economy in which homelessness is at an all-time high, demand at food banks is at an all-time high, and poverty is growing all around us.  The rising cost of living is absolutely crushing households throughout the natio…",
    "link": "http://theeconomiccollapseblog.com/11-signs-that-a-recession-in-the-u-s-may-have-already-started/",
    "timestamp": "2025-02-10T21:21:36Z"
  },
  {
    "title": "Elon Musk and investors offering $97.4 billion for control of OpenAI, WSJ reports",
    "description": "According to the Wall Street Journal, Elon Musk and a group of investors are offering $97.4 billion to take control of OpenAI.",
    "link": "https://www.cnbc.com/2025/02/10/musk-and-investors-offering-97point4-billion-for-control-of-openai-wsj.html",
    "timestamp": "2025-02-10T21:21:11Z"
  },
  {
    "title": "Israel, Hamas trade accusations",
    "description": "Israel and Hamas accused each other of violating the terms of a ceasefire deal agreed to last month, raising concerns over the durability of the truce about half way through the initial six-week period.",
    "link": "https://www.bostonherald.com/2025/02/10/israel-hamas-trade-accusations/",
    "timestamp": "2025-02-10T21:20:56Z"
  },
  {
    "title": "Two things about this picture: 1. Why are they all in the same bathroom at once? 2. I didn't expect Nancy Pelosi to have a reflection.",
    "description": null,
    "link": "https://freerepublic.com/focus/f-chat/4296526/posts",
    "timestamp": "2025-02-10T21:20:52Z"
  },
  {
    "title": "Will Trump Invite Philadelphia Eagles to the White House?",
    "description": "President Donald Trump became the first president in office to attend a Super Bowl on Sunday. #superbowl #philadelphia #philadelphiaeagles #politics \nAfter flying from Florida to New Orleans, the Republican president met with participants in the honorary coin…",
    "link": "https://biztoc.com/x/9e8ffa10286e5b78",
    "timestamp": "2025-02-10T21:20:51Z"
  },
  {
    "title": "Why Elon Musk is a preposterous choice to lead a Pentagon audit",
    "description": "Donald Trump says he wants an audit of the Department of Defense’s finances — and he’s sending a billionaire defense contractor?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-preposterous-choice-lead-pentagon-audit-rcna191559",
    "timestamp": "2025-02-10T21:20:39Z"
  },
  {
    "title": "Trump dismisses JD Vance as his potential successor",
    "description": "United States President Donald Trump stated that he does not see Vice President JD Vance as his successor in the 2028 presidential race.\"But he is very capable,\" Trump noted during his weekend sitdown...",
    "link": "https://biztoc.com/x/891e37642de555fa",
    "timestamp": "2025-02-10T21:20:29Z"
  },
  {
    "title": "FAA Makes It Official: Gulf of Mexico Is Now Gulf of America",
    "description": "The FAA announced on Monday it will change the Gulf of Mexico to the Gulf of America and Mount Denali to Mount McKinley.",
    "link": "https://www.newsweek.com/faa-gulf-america-mexico-denali-mckinley-donald-trump-2029093",
    "timestamp": "2025-02-10T21:20:08Z"
  },
  {
    "title": "US judge keeps his block on Trump federal buyout plan in place for now",
    "description": "BOSTON/WASHINGTON: A US judge kept his block on President Donald Trump's buyout plan for federal employees in place on Monday (Feb 10) and said he would consider imposing it for a longer period of time. The decision by US District Judge George O'Toole in Bost…",
    "link": "https://www.channelnewsasia.com/world/us-judge-keeps-his-block-trump-federal-buyout-plan-place-now-4929401",
    "timestamp": "2025-02-10T21:19:40Z"
  },
  {
    "title": "'Grim': Trump's revenge tour reportedly eyes another agency",
    "description": "President Donald Trump’s revenge campaign is now taking a swing through staff at the National Archives involved in the efforts to have government documents found at his Mar-a-Lago residence returned, according to Rolling Stone.That includes staffers who playe…",
    "link": "https://www.rawstory.com/trump-revenge-2671128500/",
    "timestamp": "2025-02-10T21:19:35Z"
  },
  {
    "title": "Here's what happened today: Monday",
    "description": "Man in custody for Stoneybatter attack, garda jailed for sexual assault and Hamas suspend hostage exchange with Israel",
    "link": "https://www.thejournal.ie/news-fix-monday-71-6619374-Feb2025/",
    "timestamp": "2025-02-10T21:19:34Z"
  },
  {
    "title": "Adams Told City Officials Not to Bash Trump or Interfere With ICE",
    "description": "Mayor Eric Adams reportedly told top New York City officials not to interfere in federal immigration actions and to avoid public conflict with Trump.",
    "link": "http://nymag.com/intelligencer/article/eric-adams-nyc-officials-criticism-trump-ice-enforcement.html",
    "timestamp": "2025-02-10T21:18:41Z"
  },
  {
    "title": "Elon Musk Offers to Buy OpenAI for $97.4 Billion in Unsolicited Bid: Report",
    "description": "The billionaire oligarch says he wants OpenAI to become a \"safety-focused force for good.\"",
    "link": "https://gizmodo.com/elon-musk-offers-to-buy-openai-for-97-4-billion-in-unsolicited-bid-report-2000561925",
    "timestamp": "2025-02-10T21:18:39Z"
  },
  {
    "title": "Trump's federal worker resignation deadline remains paused",
    "description": "Attorneys for the Trump administration and lawyers for a group of labor unions who filed a lawsuit faced off in a Boston courtroom on Monday.",
    "link": "https://www.businessinsider.com/donald-trump-elon-musk-doge-judge-paused-employee-buyout-offer-2025-2",
    "timestamp": "2025-02-10T21:18:27Z"
  },
  {
    "title": "It's Been Almost 3 Weeks Since Donald Trump Has Taken Office. Here's The Harsh Reality Of How Americans Are Feeling.",
    "description": "\"I understand now how Hitler rose to power. I feel like I'm screaming, and nobody is listening.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-americans-opinion_n_67a62aa6e4b051fae0137d3a",
    "timestamp": "2025-02-10T21:14:18Z"
  },
  {
    "title": "Big Tech is still silent on Trump’s tariffs",
    "description": "President Donald Trump’s 10 percent tariff on goods imported from China has been in effect for nearly a week. Ahead of the tariff going into effect, I wrote that “Big Tech has been silent on Trump’s tariffs” — almost no one in the industry had a public reacti…",
    "link": "https://www.theverge.com/news/609494/trump-tariffs-big-tech-silent-automakers",
    "timestamp": "2025-02-10T21:13:45Z"
  },
  {
    "title": "Donald Trump Calls Kennedy Center Shows “Terrible,” But Admits He’s Never Seen One; Biden-Appointed Board Members Removed From Roster",
    "description": "Donald Trump’s move to fire about half of the board of the Kennedy Center was reflected in the arts organization’s roster, with a list of Joe Biden-appointees no longer named as trustees. Also missing was the center’s chairman, philanthropist David Rubenstein…",
    "link": "http://deadline.com/2025/02/trump-kennedy-center-board-2-1236284599/",
    "timestamp": "2025-02-10T21:13:03Z"
  },
  {
    "title": "At least $570 million in federal funding for Colorado still in limbo amid Trump freeze, officials say",
    "description": "Hundreds of millions of dollars in federal funding tapped for Colorado climate and health projects is still being withheld by the Trump administration, state and federal officials say.",
    "link": "https://www.denverpost.com/2025/02/10/donald-trump-spending-freeze-colorado-impact-energy/",
    "timestamp": "2025-02-10T21:12:47Z"
  },
  {
    "title": "CFPB Workers Protest Elon Musk Outside Bureau Headquarters: 'Arrest Elon'",
    "description": "Around 100 Consumer Finance Protection Bureau workers protested outside the agency's headquarters on Saturday.\nThe post CFPB Workers Protest Elon Musk Outside Bureau Headquarters: ‘Arrest Elon’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/10/cfpb-workers-protest-elon-musk-bureau-headquarters-arrest-elon/",
    "timestamp": "2025-02-10T21:12:45Z"
  },
  {
    "title": "Judge keeps block on Trump’s offer of mass buyouts for US federal workers - NewsBreak",
    "description": "Federal employees claim in lawsuit ‘deferred resignation’ program is illegal because Congress has not approved it",
    "link": "https://www.newsbreak.com/share/3800331614133-judge-keeps-block-on-trump-s-offer-of-mass-buyouts-for-us-federal-workers?s=a2&amp;share_destination_id=MTkwNzI4MDIzLTE3MzkyMjE4NzA5MTE%3D&amp;pd=0CuH4Rl4&amp;hl=en_US&amp;send_time=1739221870&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v6",
    "timestamp": "2025-02-10T21:12:25Z"
  },
  {
    "title": "Sam Altman-Elon Musk Feud Timeline: Musk Reportedly Bids $94.7 Billion For Altman’s OpenAI",
    "description": "Altman and Musk were OpenAI’s founding co-chairs in 2015, but their relationship has devolved into name-calling, lawsuits and now a near $100 billion bid from Musk for OpenAI.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/02/10/sam-altman-elon-musk-feud-timeline-musk-reportedly-bids-947-billion-for-altmans-openai/",
    "timestamp": "2025-02-10T21:11:01Z"
  },
  {
    "title": "Coty’s Sales Decline in Q2 Amid Weak Demand in Asia and Tight Inventory Management Despite Strong Fragrance Performance",
    "description": "Coty Q2 2025 earnings are in: Revenue falls 3 percent, impacted by weak demand in Asia and a slowing mass market.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/cotys-sales-decline-q2-1236921506/",
    "timestamp": "2025-02-10T21:10:00Z"
  },
  {
    "title": "Gold Hits New Record: Trump's Tariffs, Inflation Fears Drive Safe Haven Surge",
    "description": "Gold is up 44% over the last year, outpacing the S&P 500’s 25% return even in a bull market for stocks.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/02/10/gold-hits-new-record-trumps-tariffs-inflation-fears-drive-safe-haven-surge/",
    "timestamp": "2025-02-10T21:09:47Z"
  },
  {
    "title": "Ex-Ukrainian FM tells old colleagues to fear for their lives",
    "description": "Dmitry Kuleba has warned that Ukrainian officials who agree to give up territory to Russia will face either death or political ruin Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612480-kuleba-fear-lives-ukraine/",
    "timestamp": "2025-02-10T21:09:42Z"
  },
  {
    "title": "Pentagon bans transgender people from joining the military",
    "description": "The U.S. military will no longer allow transgender individuals to join the military and will stop performing or facilitating procedures associated with gender transition for service members, according to a memo from Defense Secretary Pete Hegseth filed in cou…",
    "link": "https://biztoc.com/x/db1492b1045ff3fe",
    "timestamp": "2025-02-10T21:09:42Z"
  },
  {
    "title": "Trump Declines to Name JD Vance His Successor in Stunning Moment During Fox News Interview: ‘You Have a Lot of Very Capable People’",
    "description": "President Donald Trump pointedly declined to name Vice President JD Vance as his preferred successor during a sit down with Fox News' Bret Baier.\nThe post Trump Declines to Name JD Vance His Successor in Stunning Moment During Fox News Interview: ‘You Have a …",
    "link": "https://www.mediaite.com/news/trump-declines-to-name-jd-vance-his-successor-in-stunning-moment-during-fox-news-interview-you-have-a-lot-of-very-capable-people/",
    "timestamp": "2025-02-10T21:09:36Z"
  },
  {
    "title": "'We need to hit back hard': Tariffs would put steel and aluminum sector in familiar predicament",
    "description": "United States President Donald Trump is set to announce 25 per cent tariffs on aluminum and steel imports from all countries, replicating a policy move he used in his first term against Canada with mixed results.\nNow, insiders in those sectors are hoping to d…",
    "link": "https://biztoc.com/x/db3cf7e1d5778a53",
    "timestamp": "2025-02-10T21:09:32Z"
  },
  {
    "title": "'I'm Asking Trump Himself To Relocate Us': Gazan Citizens Say They Want Out",
    "description": "As President Donald Trump moves forward with his plan to \"own\" Gaza and relocate its inhabitants, some citizens of the war-torn strip are expressing an eagerness to leave, citing a desolate living situation and an eagerness to live in \"a country where you can…",
    "link": "https://freebeacon.com/israel/im-asking-trump-himself-to-relocate-us-gazan-citizens-say-they-want-out/",
    "timestamp": "2025-02-10T21:09:18Z"
  },
  {
    "title": "Vance triggers Dems by defending Trump's executive authority",
    "description": "Judges across the country took action to block President Donald Trump’s agenda. Vance created a social media frenzy on Sunday for supporting Trump’s executive authority.",
    "link": "https://www.foxnews.com/politics/vance-triggers-dems-defending-trumps-executive-authority",
    "timestamp": "2025-02-10T21:07:44Z"
  },
  {
    "title": "Trump says no right of return for Palestinians under his plan",
    "description": "President Donald Trump said Palestinians in Gaza would not have a right to return under his plan for U.S. \"ownership\" of the war-torn territory, contradicting other officials in his administration who have sought to argue Trump was only calling for the tempor…",
    "link": "https://www.bostonherald.com/2025/02/10/trump-says-no-right-of-return-for-palestinians-under-his-plan/",
    "timestamp": "2025-02-10T21:03:11Z"
  },
  {
    "title": "HPE is notifying individuals affected by a December 2023 attack",
    "description": "Hewlett Packard Enterprise (HPE) has begun notifying individuals affected by a December 2023 attack carried out by Russia-linked threat actors. Hewlett Packard Enterprise has started notifying individuals whose personal information was exposed in a December 2…",
    "link": "https://securityaffairs.com/174057/data-breach/hpe-notifying-individuals-impacted-by-december-2023-attack.html",
    "timestamp": "2025-02-10T21:03:09Z"
  },
  {
    "title": "Twenty-two states sue Trump administration over NIH cuts - Roll Call",
    "description": "Lawsuit comes after Friday's announcement that the NIH would limit the indirect costs it will pay grantees to 15 percent of a grant.",
    "link": "https://rollcall.com/2025/02/10/twenty-two-states-sue-trump-administration-over-nih-cuts/",
    "timestamp": "2025-02-10T21:02:45Z"
  },
  {
    "title": "Congressman: To Keep Its Majority, House GOP Must Rally Around Trump | Opinion",
    "description": "At least three House seats will be up for special election in the coming months. Democrats are ready to fight in these first contests after President Trump's inauguration.",
    "link": "https://www.newsweek.com/congressman-keep-its-majority-house-gop-must-rally-around-trump-opinion-2021552",
    "timestamp": "2025-02-10T21:02:26Z"
  },
  {
    "title": "As Trump Did With Greenland And Panama, He Doubles Down On Seizing Gaza",
    "description": "United States President Donald Trump has doubled down on “buying and owning” the Gaza Strip, which he called a “big real estate site.” He made similar comments after saying the U.S. should own Greenland and the Panama Canal and take them by force if necessary.",
    "link": "https://www.shtfplan.com/headline-news/as-trump-did-with-greenland-and-panama-he-doubles-down-on-seizing-gaza",
    "timestamp": "2025-02-10T21:00:54Z"
  },
  {
    "title": "Trump's latest tariff plans on steel, aluminum and other imports are spreading uncertainty",
    "description": "Trump's latest tariff plans on steel, aluminum and other imports are spreading uncertaintynews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/02/10/trumps-latest-tariff-plans-on-steel-aluminum-and-other-imports-are-spreading-uncertainty/",
    "timestamp": "2025-02-10T21:00:42Z"
  },
  {
    "title": "Industry Expert Sees A ‘Cyclical Valhalla’ Sending Bitcoin’s Price To $700,000 While Solana Targets $1,800",
    "description": "Bill Barhydt recently took to the X social media platform (aka Twitter) to stir the BTC community with a bold Bitcoin price prediction.",
    "link": "https://zycrypto.com/industry-expert-sees-a-cyclical-valhalla-sending-bitcoins-price-to-700000-while-solana-targets-1800/",
    "timestamp": "2025-02-10T21:00:27Z"
  },
  {
    "title": "Altcoin season 2025: 5 must-watch signals that could ignite a massive crypto rally",
    "description": "From market dominance to social media hype, here's what you need to keep an eye out for.",
    "link": "https://ambcrypto.com/altcoin-season-2025-5-must-watch-signals-that-could-ignite-a-massive-crypto-rally/",
    "timestamp": "2025-02-10T21:00:14Z"
  },
  {
    "title": "Musk Treasury Access Raises Global Financial Crisis Concerns",
    "description": "Whether or not you share the zeal for cuts in government spending embraced by President Donald Trump and his billionaire sidekick Elon Musk, you should know that giving Musk and his callow team of computer coders access to payment systems at the U. S. Departm…",
    "link": "https://oilprice.com/Finance/the-Economy/Musk-Treasury-Access-Raises-Global-Financial-Crisis-Concerns.html",
    "timestamp": "2025-02-10T21:00:00Z"
  },
  {
    "title": "NIH Funding Cuts Would Hobble U.S. Medical Research, Insider Says",
    "description": "“Laboratories would literally go dark,” says a medical research insider, if Trump administration cuts to NIH funding go through. Patients will suffer from lost medical advances, he tells Scientific American",
    "link": "https://www.scientificamerican.com/article/nih-funding-cuts-would-hobble-u-s-medical-research-insider-says/",
    "timestamp": "2025-02-10T21:00:00Z"
  },
  {
    "title": "Growth seen resting on investor confidence",
    "description": "<p>Thailand's Finance Minister Pichai Chunhavajira says the country's ability to meet this year's economic growth target of 3.5% would depend on investor confidence.</p>",
    "link": "https://www.bangkokpost.com/business/general/2958500/growth-seen-resting-on-investor-confidence",
    "timestamp": "2025-02-10T21:00:00Z"
  },
  {
    "title": "Crypto’s Debanking Worries Hit Another Big Stage in U.S. House",
    "description": "The industry’s U.S. banking crisis may be retreating as a second congressional committee sheds light on how crypto businesses have been treated by regulators. What to know: The chief lawyer of U.S. crypto exchange Coinbase (COIN) testified about the abuse of …",
    "link": "https://www.activistpost.com/cryptos-debanking-worries-hit-another-big-stage-in-u-s-house/",
    "timestamp": "2025-02-10T21:00:00Z"
  },
  {
    "title": "Veterans at State Department dispirited after DEI crackdown puts affinity group on pause",
    "description": "Since 2014, military veterans employed by the State Department have found kinship in a volunteer resource group known as Veterans@State.",
    "link": "https://www.nbcnews.com/politics/politics-news/veterans-state-department-dei-crackdown-affinity-groups-rcna191192",
    "timestamp": "2025-02-10T20:59:18Z"
  },
  {
    "title": "Judge Rips Supreme Court Immunity Ruling in Records Case Related to Trump",
    "description": "U.S. District Judge Beryl Howell blasted the Supreme Court's presidential immunity ruling on Monday when she ruled that the dismissal of criminal charges against President Donald Trump for concealing classified records has removed a key obstacle to making rec…",
    "link": "https://biztoc.com/x/61bf103bd82b70eb",
    "timestamp": "2025-02-10T20:59:04Z"
  },
  {
    "title": "Donald Trump Set to Pardon Rod Blagojevich",
    "description": "President Donald Trump will pardon former Illinois Governor Rod Blagojevich five years after commuting his sentence on corruption charges, the Associated Press reported.\nThe pardon, expected to be signed Monday, follows Blagojevich's vocal support for Trump d…",
    "link": "https://biztoc.com/x/5a84190ac8f4755d",
    "timestamp": "2025-02-10T20:58:58Z"
  },
  {
    "title": "Prominent Baptist Minister Accuses Trump White House of Anti-Christian Bias",
    "description": "A prominent Baptist minister on Monday accused President Donald Trump's administration of showing an \"anti-Christian bias.\"\nReverend Paul Brandeis Raushenbush, president and CEO of Interfaith Alliance, made the comment during an appearance on CNN while discus…",
    "link": "https://biztoc.com/x/bb6c5277977c8c7d",
    "timestamp": "2025-02-10T20:58:34Z"
  },
  {
    "title": "Trump claims Elon Musk’s DOGE ‘geniuses’ have found ‘very fraudulent stuff’",
    "description": "Trump claims Elon Musk’s DOGE ‘geniuses’ have found ‘very fraudulent stuff’\nPresident Donald Trump said Elon Musk’s discoveries with DOGE could help national debt.\nTing Shen—Bloomberg/Getty Images",
    "link": "https://biztoc.com/x/1464ea6bf69c9962",
    "timestamp": "2025-02-10T20:58:31Z"
  },
  {
    "title": "What the end of the penny means for prices and your piggy bank",
    "description": "Talk to end the penny’s production has been bandied about for decades among government officials and economists. However, the talk became policy when, over the weekend, President Donald Trump ordered the Treasury to stop minting new pennies.\n“For far too long…",
    "link": "https://biztoc.com/x/a1456f10ca30e09a",
    "timestamp": "2025-02-10T20:58:19Z"
  },
  {
    "title": "Judge Rips Supreme Court Immunity Ruling in Records Case Related to Trump",
    "description": "Judge Howell determined that the FBI's previous justification for withholding records related to the probe is no longer valid.",
    "link": "https://www.newsweek.com/judge-rips-supreme-court-immunity-ruling-records-case-related-trump-2029103",
    "timestamp": "2025-02-10T20:57:55Z"
  },
  {
    "title": "US judge orders Trump administration to obey halt on spending freeze",
    "description": "Judge rules US government has defied previous ruling that suspended Trump's sweeping order to freeze federal spending.",
    "link": "https://www.aljazeera.com/news/2025/2/10/us-judge-orders-trump-administration-to-obey-halt-on-spending-freeze",
    "timestamp": "2025-02-10T20:57:43Z"
  },
  {
    "title": "Most countries miss UN climate plan deadline as fears over Trump effect on global diplomacy grow",
    "description": "Most of the world’s nations have missed a UN deadline to set new climate targets as efforts to curb global warming come under pressure following U.S. President Donald Trump's election.",
    "link": "https://www.cbc.ca/news/science/most-countries-miss-un-climate-plan-deadline-as-fears-over-trump-effect-on-global-diplomacy-grow-1.7455310",
    "timestamp": "2025-02-10T20:57:13Z"
  },
  {
    "title": "Actually, Serena Williams Won the Super Bowl 2025",
    "description": "The tennis G.O.A.T. made a lasting impression, and she boosted Taylor Swift after Donald Trump twisted things on Twitter.",
    "link": "https://www.vanityfair.com/style/story/serena-williams-won-super-bowl-2025",
    "timestamp": "2025-02-10T20:57:00Z"
  },
  {
    "title": "‘We need to hit back hard’: Tariffs would put steel and aluminum sector in familiar predicament",
    "description": "Steel and aluminum sector insiders are hoping to draw on past experience to better navigate another trade war with Trump. Find out more.",
    "link": "https://financialpost.com/commodities/mining/tariffs-steel-aluminum-sector-familiar-predicament",
    "timestamp": "2025-02-10T20:56:40Z"
  },
  {
    "title": "SkyBridge Capital’s Anthony Scaramucci Predicts Solana Will Beat Ethereum To Win Tokenization Race – Here’s Why",
    "description": "Donald Trump critic and SkyBridge Capital founder Anthony Scaramucci says Solana (SOL) is his preferred layer-1 over Ethereum (ETH). In a new interview with CNBC, Scaramucci says that while SkyBridge does own some ETH, his investment thesis focuses on SOL bei…",
    "link": "https://dailyhodl.com/2025/02/10/skybridge-capitals-anthony-scaramucci-predicts-solana-will-beat-ethereum-to-win-tokenization-race-heres-why/",
    "timestamp": "2025-02-10T20:55:54Z"
  },
  {
    "title": "Former Lead Recovery Consultants at Hagerty, Firm Hired by Bass, Pleaded Guilty to Stealing Disaster Funds",
    "description": "Two former disaster recovery experts at Hagerty Consulting, which L.A. Mayor Karen Bass appointed to lead rebuilding efforts after the recent wildfires, pleaded guilty in 2022 and 2023 to defrauding New York City of Hurricane Sandy relief funds.\nThe post Form…",
    "link": "https://www.breitbart.com/politics/2025/02/10/former-lead-recovery-consultants-at-hagerty-firm-hired-by-bass-pleaded-guilty-to-stealing-disaster-funds/",
    "timestamp": "2025-02-10T20:55:20Z"
  },
  {
    "title": "Donald Trump Set to Pardon Rod Blagojevich",
    "description": "Blagojevich, who was a Democrat while in office, supported Trump in the 2024 election and attended last July's GOP Convention.",
    "link": "https://www.newsweek.com/donald-trump-pardon-rod-blagojevich-2029014",
    "timestamp": "2025-02-10T20:55:12Z"
  },
  {
    "title": "Vatican charity blasts Trump administration’s plan to ‘recklessly’ gut USAID",
    "description": "Caritas on Monday warned that millions of people could die as a result of the “ruthless” U.S. decision to “recklessly” stop USAID funding.",
    "link": "https://www.pbs.org/newshour/world/vatican-charity-blasts-trump-administrations-plan-to-recklessly-gut-usaid",
    "timestamp": "2025-02-10T20:54:55Z"
  },
  {
    "title": "NY GOP fumes Dems ‘could give a s---’ about democracy as Stefanik seat targeted in new bill",
    "description": "A bill seeking to give Gov. Kathy Hochul the power to merge election dates led minority party lawmakers like New York state Sen. Rob Ortt to rail against it as an affront to voters in the rural, red North Country.",
    "link": "https://www.foxnews.com/politics/ny-gop-fumes-dems-could-give-s-t-about-democracy-stefanik-seat-targeted-new-bill",
    "timestamp": "2025-02-10T20:53:14Z"
  },
  {
    "title": "Prominent Baptist Minister Accuses Trump White House of Anti-Christian Bias",
    "description": "\"We actually need protection from the White House at this point,\" Reverend Paul Brandeis Raushenbush said on CNN.",
    "link": "https://www.newsweek.com/prominent-baptist-minister-accuses-trump-white-house-anti-christian-bias-2029092",
    "timestamp": "2025-02-10T20:52:58Z"
  },
  {
    "title": "'Dark time ahead': Scientists sound alarm at Trump's 'spiteful and targeted' cuts",
    "description": "Scientists are speaking out in fear for the future of their fields as President Donald Trump's suspension of funds for the National Institutes of Health put everything in limbo, the Huffington Post reported Monday.NIH announced over the weekend that \"it is sh…",
    "link": "https://www.rawstory.com/nih/",
    "timestamp": "2025-02-10T20:52:08Z"
  },
  {
    "title": "Life, Liberty, and the Right To Shitpost",
    "description": "Expression has never been more convenient. Censorship has never been easier.  From research papers on arXiv to mukbang videos on YouTube, digital content",
    "link": "https://reason.com/2025/02/10/life-liberty-and-the-right-to-shitpost/",
    "timestamp": "2025-02-10T20:51:08Z"
  },
  {
    "title": "Ana Navarro: ‘Racists Are Welcome in the Trump Administration’",
    "description": "Ana Navarro told her co-hosts Monday on ABC’s “The View” that President Donald Trump’s administration welcomed “racists.” Navarro said, “The way JD Vance, you know, talked about it, ‘I don’t think stupid social media activity should ruin a kid’s life.’ Okay. …",
    "link": "https://freerepublic.com/focus/f-news/4296519/posts",
    "timestamp": "2025-02-10T20:50:12Z"
  },
  {
    "title": "Homeland Security Secretary Kristi Noem backs Trump's idea to 'get rid of FEMA'",
    "description": "Homeland Security Secretary Kristi Noem has backed Trump's suggestion to eliminate the Federal Emergency Management Agency.",
    "link": "https://www.msnbc.com/top-stories/latest/kristi-noem-trump-fema-homeland-security-secretary-doge-rcna191506",
    "timestamp": "2025-02-10T20:49:53Z"
  },
  {
    "title": "US officially changes name of Gulf of Mexico to Gulf of America per Trump's order",
    "description": "The body of water formerly known as the Gulf of Mexico has now been formally renamed in the Geographic Names Information System.",
    "link": "https://www.usatoday.com/story/news/nation/2025/02/10/trump-gulf-of-america-name-change-effective/78128577007/",
    "timestamp": "2025-02-10T20:48:53Z"
  },
  {
    "title": "Elon Musk-Led Group Makes $97.4 Billion Bid For Control Of OpenAI: Reports",
    "description": "A consortium led by Elon Musk said on Monday it has offered $97.4 billion to buy the nonprofit that controls OpenAI, months after the billionaire sued the artificial intelligence startup to block it from transitioning to a for-profit firm.",
    "link": "https://www.ndtv.com/world-news/elon-musk-led-group-makes-97-4-billion-bid-for-control-of-openai-wsj-reports-7681538",
    "timestamp": "2025-02-10T20:48:17Z"
  },
  {
    "title": "'If You Can Keep It': Where Is The Resistance?",
    "description": "President Donald Trump has dominated the news cycle in the earliest days of office, firing off rounds of executive orders, turning billionaire Elon Musk loose on the federal workforce, and blitzing the press.<br><br>But where is the opposition? Democrats lost…",
    "link": "https://www.npr.org/2025/02/10/1230610856/1a-02-10-2025",
    "timestamp": "2025-02-10T20:48:15Z"
  },
  {
    "title": "Trump’s NIH funding cut for research institutions could cost Philly grantees millions",
    "description": "NIH grant recipients receive additional funding to cover \"indirect costs,\" such as building maintenance and administrative expenses.",
    "link": "https://www.inquirer.com/health/national-institutes-health-funding-cuts-trump-upenn-20250210.html",
    "timestamp": "2025-02-10T20:47:58Z"
  },
  {
    "title": "Trump Says Other Countries Caused $36T U.S. Debt—Is He Right?",
    "description": "President Donald Trump used his pre-Superbowl interview to blame foreign nations for America's $36 trillion debt, claiming other countries had taken advantage of the U.S.\nSpeaking to Fox News' Bret Baier, Trump mentioned Mexico and Canada, which he has held h…",
    "link": "https://biztoc.com/x/8a4872ce4634341f",
    "timestamp": "2025-02-10T20:47:39Z"
  },
  {
    "title": "Musk-led group makes $97.4 billion bid for control of OpenAI",
    "description": ":A consortium led by Elon Musk said on Monday it has offered $97.4 billion to buy the nonprofit that controls OpenAI, months after the billionaire sued the artificial intelligence startup to block it from transitioning to a for-profit firm.Musk's bid could ra…",
    "link": "https://www.channelnewsasia.com/business/musk-led-group-makes-974-billion-bid-control-openai-4929386",
    "timestamp": "2025-02-10T20:47:12Z"
  },
  {
    "title": "Wall Street Banks Plot Their Crypto Future in Bet on IPO Boom",
    "description": "After staying on the sidelines, some of Wall Street’s biggest banks are plotting how to win more crypto business, betting President Donald Trump’s embrace of the industry unleashes a wave of IPOs, share sales and convertible bonds.",
    "link": "https://financialpost.com/pmn/business-pmn/wall-street-banks-plot-their-crypto-future-in-bet-on-ipo-boom",
    "timestamp": "2025-02-10T20:47:06Z"
  },
  {
    "title": "Musk-led group makes US$97.4 billion bid for control of OpenAI",
    "description": "A consortium led by Elon Musk said on Monday (Feb 10) it has offered US$97.4 billion to buy the nonprofit that controls OpenAI, months after the billionaire sued the artificial intelligence startup to block it from transitioning to a for-profit firm. Musk's b…",
    "link": "https://www.channelnewsasia.com/world/united-states-elon-musk-group-offer-buy-openai-sam-altman-4929386",
    "timestamp": "2025-02-10T20:47:00Z"
  },
  {
    "title": "Trump's Orders on Gender Put Science Back in the Driver's Seat | Opinion",
    "description": "President Donald Trump has signed a series of executive orders that respect biological reality in areas from medicine to sports to intimate spaces.",
    "link": "https://www.newsweek.com/trumps-orders-gender-put-science-back-drivers-seat-opinion-2027532",
    "timestamp": "2025-02-10T20:46:44Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaintsnews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/02/10/so-long-penny-trump-orders-us-to-ditch-1-cent-coin-after-decades-of-complaints/",
    "timestamp": "2025-02-10T20:45:25Z"
  },
  {
    "title": "Trump Says Other Countries Caused $36T U.S. Debt—Is He Right?",
    "description": "Donald Trump's pre-Superbowl Fox News interview pointed fingers at foreign nations who he said \"take advantage\" of the U.S.",
    "link": "https://www.newsweek.com/trump-says-countries-caused-36-trillion-us-debt-super-bowl-2029040",
    "timestamp": "2025-02-10T20:44:49Z"
  },
  {
    "title": "Elon Musk Reinstates DOGE Member Who Resigned Over Racist Posts",
    "description": "In one of Marko Elez’s many disturbing online posts over the past year, he proudly referred to himself as a racist.",
    "link": "https://truthout.org/articles/elon-musk-reinstates-doge-member-who-resigned-over-racist-posts/",
    "timestamp": "2025-02-10T20:44:02Z"
  },
  {
    "title": "Budget Boss Russ Vought Tells all CFPB Staff to “Stop Work”",
    "description": "Office of Management and Budget (OMB) Director Russ Vought is also the interim Director of the Consumer Financial Protection Bureau (CFPB). The CFPB is under review by DOGE and on Monday morning Russ Vought told CFPB staff not to come to work. {Background Her…",
    "link": "https://freerepublic.com/focus/f-news/4296518/posts",
    "timestamp": "2025-02-10T20:43:38Z"
  },
  {
    "title": "How Elon Musk’s Hostile Takeover Could End Government As We Know It",
    "description": "By Allison Stanger, Middlebury\n\n Elon Musk’s role as the head of the Department of Government Efficiency, also known as DOGE, is on the surface a dramatic effort to overhaul the inefficiencies of federal bureaucracy. But beneath the rhetoric of cost-cutting a…",
    "link": "https://crooksandliars.com/2025/02/how-elon-musk-s-hostile-takeover-could-0",
    "timestamp": "2025-02-10T20:43:29Z"
  },
  {
    "title": "Texas Colleges Rolled Over for Anti-DEI Bill. Now They Face a Broader Attack.",
    "description": "Schools that overcomplied with state bills targeting DEI initiatives are now vulnerable to attacks on curriculum, too.",
    "link": "https://truthout.org/articles/texas-colleges-rolled-over-for-anti-dei-bill-now-they-face-a-broader-attack/",
    "timestamp": "2025-02-10T20:41:53Z"
  },
  {
    "title": "Elon Musk is about to get 'checked' by the very courts he wants to ignore: legal expert",
    "description": "Political officials and analysts are raising concerns about a potential constitutional crisis: what if President Donald Trump refuses to comply with a court ruling? However, one legal expert believes this scenario is unlikely.\"Federal judges have, let's just …",
    "link": "https://www.rawstory.com/elon-musk-2671128027/",
    "timestamp": "2025-02-10T20:41:49Z"
  },
  {
    "title": "Trump Admin's Gaza playbook rolling out as predicted",
    "description": "Trump doubles down on his Gaza ‘real estate’ vision while Rubio challenges regional leaders to step up with their own solutions.",
    "link": "https://www.jpost.com/american-politics/article-841560",
    "timestamp": "2025-02-10T20:41:40Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Somalia, the Office for the Coordination of Humanitarian Affairs warns that drought conditions are looming in several areas of the country due to prolonged extreme dry conditions, with hundreds of thousands of families likely to be impacted.",
    "link": "https://press.un.org/en/2025/db250210.doc.htm",
    "timestamp": "2025-02-10T20:40:29Z"
  },
  {
    "title": "MAGA Leaders Mad Because Kendrick Lamar's Blackety-Black Super bowl Message Went Over Their Heads",
    "description": "Photo: Rolling Stone\r\nAs Black folks continue to celebrate the subversive and powerful Super Bowl performance delivered by the one and only Kendrick Lamar, MAGA supporters have taken to social media to express their confusion and disapproval regarding the hal…",
    "link": "https://www.theroot.com/maga-leaders-mad-because-kendrick-lamars-blackety-black-1851759767",
    "timestamp": "2025-02-10T20:40:00Z"
  },
  {
    "title": "Trump Cabinet Pick Lori Chavez-DeRemer May Be Most At Risk Of Not Getting Confirmed",
    "description": "Some Republican lawmakers are less than enthused about Lori Chavez-Deremer, Trump's nominee for Department of Labor (DOL) secretary, according to reports.",
    "link": "https://dailycaller.com/2025/02/10/trump-cabinet-pick-lori-chavez-deremer-risk/",
    "timestamp": "2025-02-10T20:39:41Z"
  },
  {
    "title": "What the end of the penny means for the economy, your piggy bank, and the way America prices items",
    "description": "Talk to end the penny’s production has been bandied about for decades among government officials and economists.",
    "link": "https://www.nbcnews.com/business/economy/end-penny-means-economy-piggy-bank-way-america-prices-items-rcna191556",
    "timestamp": "2025-02-10T20:39:37Z"
  },
  {
    "title": "CNN’s Barak Ravid Says Trump’s Gaza Proposal ‘Definitely’ Helped Lead to Collapse of Hamas Hostage Release Deal",
    "description": "“Barak, how do those comments have an impact on the situation right now and how could they shape the second phase of the cease-fire deal?”\nThe post CNN’s Barak Ravid Says Trump’s Gaza Proposal ‘Definitely’ Helped Lead to Collapse of Hamas Hostage Release Deal…",
    "link": "https://www.mediaite.com/news/cnns-barak-ravid-says-trumps-gaza-proposal-definitely-helped-lead-to-collapse-of-hamas-hostage-release-deal/",
    "timestamp": "2025-02-10T20:39:08Z"
  },
  {
    "title": "Zelenskyy Says if Ukraine Holds Elections, They Will Lose the War to Russia",
    "description": "I have long said the only thing President Trump needs to do is to tell Ukranian President Volodymyr Zelenskyy he needs to hold an election to showcase his public support for his position. After that, Trump can do nothing except wait for the result and the win…",
    "link": "https://freerepublic.com/focus/f-news/4296516/posts",
    "timestamp": "2025-02-10T20:38:16Z"
  },
  {
    "title": "Newman: Why Trump is killing the penny and ransacking the government",
    "description": "Donald Trump’s early actions as president range from dramatic to trifling. On one hand, he wants to slash billions of dollars in spending on foreign aid, consumer protection, and even healthcare. On the other, he hopes to end production of the penny, which mo…",
    "link": "https://biztoc.com/x/080f71ac7ff1ad14",
    "timestamp": "2025-02-10T20:36:21Z"
  },
  {
    "title": "Video: Donald Trump: The Disruptive and Irrational President. Prof Rodrigue Tremblay",
    "description": "This video can be viewed in eight languages: English, French, Arabic, Chinese, Hebrew, Italian, Spanish and Russian.\nEnglish Français  Español  عرب  中国人 Hebrew, Italiano, Русский \nOur thanks to Lux media for the production of this video.\nTo contribute to …\nTh…",
    "link": "https://www.globalresearch.ca/video-donald-trump-the-disruptive-and-irrational-president-prof-rodrigue-tremblay/5879587",
    "timestamp": "2025-02-10T20:36:14Z"
  },
  {
    "title": "FBI Must Disclose More About Trump Classified Docs Case",
    "description": "A federal judge ruled the FBI must disclose more information about Donald Trump's classified documents case, Politico reports. Interestingly, the judge noted that while the now dropped charges eliminated Trump's criminal exposure, the Supreme Court's",
    "link": "https://politicalwire.com/2025/02/10/fbi-must-disclose-more-about-trump-classified-docs-case/",
    "timestamp": "2025-02-10T20:35:49Z"
  },
  {
    "title": "North Carolina Joins Growing Number of States Pursuing Crypto Investments",
    "description": "Nineteen U.S. states are weighing bills to put public money into digital assets, some of them similar to the federal pursuit of a Strategic Bitcoin Reserve.",
    "link": "https://www.coindesk.com/policy/2025/02/10/north-carolina-joins-growing-number-of-states-pursuing-crypto-investments",
    "timestamp": "2025-02-10T20:35:29Z"
  },
  {
    "title": "Hegseth orders pause on gender-affirming care for transgender service members",
    "description": "Defense Secretary Pete Hegseth ordered an immediate pause on gender-affirming care for all active duty service members in a memo to senior Pentagon and military leaders.",
    "link": "https://abcnews.go.com/Politics/hegseth-orders-immediate-pause-gender-affirming-medical-care/story?id=118662488",
    "timestamp": "2025-02-10T20:35:28Z"
  },
  {
    "title": "The Courts Blocked Trump’s Federal Funding Freeze. Agencies Are Withholding Money Anyway.",
    "description": "by Jake Pearson and Anjeanette Damon \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nWhen the federal courts first blocked the Trump administra…",
    "link": "https://www.propublica.org/article/trump-administration-funding-freeze-workarounds",
    "timestamp": "2025-02-10T20:35:00Z"
  },
  {
    "title": "Trump Is Planning One of His Most Corrupt Pardons Yet",
    "description": "Donald Trump is planning to pardon yet another convicted felon with a history of corruption, former Illinois Governor Rod Blagojevich, a source told The Associated Press.\r\nIn 2011, Blagojevich was sentenced to 14 years in prison on 18 felony counts, over char…",
    "link": "https://newrepublic.com/post/191366/trump-pardon-rod-blagojevich",
    "timestamp": "2025-02-10T20:34:03Z"
  },
  {
    "title": "Donald Trump’s Slash-and-Burn Second Term",
    "description": "DOGE’s war on “waste” looks suspiciously like a war on science.",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-slash-and-burn-second-term",
    "timestamp": "2025-02-10T20:32:42Z"
  },
  {
    "title": "World Athletics planning amendments to female eligibility guidelines",
    "description": "World Athletics has begun a consultation period for an updated set of regulations for transgender and difference of sex development (DSD) athletes, with a cheek swab test among a number of proposals being considered, the governing body said on Monday.In 2023,…",
    "link": "https://www.channelnewsasia.com/sport/world-athletics-planning-amendments-female-eligibility-guidelines-4929361",
    "timestamp": "2025-02-10T20:32:18Z"
  },
  {
    "title": "Ukraine Envoy to Present Trump Peace Options In Coming Weeks",
    "description": "Donald Trump’s envoy for Ukraine and Russia plans to present the president options in the coming weeks to end the war, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-envoy-to-present-trump-peace-options-in-coming-weeks",
    "timestamp": "2025-02-10T20:31:49Z"
  }
]