[
  {
    "title": "Trump renews push to end companies' quarterly reports",
    "description": "The US president urges regulators to adopt a semi-annual schedule for financial reports.",
    "link": "https://www.bbc.com/news/articles/cm2zye8745do",
    "timestamp": "2025-09-15T15:32:30Z"
  },
  {
    "title": "After winning an Emmy, Alan Cumming invites Donald Trump to compete on 'The Traitors'",
    "description": "After nabbing his fourth statue at the Emmy Awards last night, the host of The Traitors, Alan Cumming, spoke to reporters backstage in the press room about potential candidates for a fifth season — naming one unexpected personality who's caught his eye.",
    "link": "https://www.out.com/gay-tv-shows/alan-cumming-donald-trump-traitors",
    "timestamp": "2025-09-15T15:31:48Z"
  },
  {
    "title": "Trump Suggests ‘Shocking’ Mamdani Endorsement From Kathy Hochul Could Have Consequences",
    "description": "President Donald Trump blasted Democratic New York Gov. Kathy Hochul for her endorsement of avowed socialist Zohran Mamdani for New York City mayor.",
    "link": "https://dailycaller.com/2025/09/15/trump-suggests-shocking-mamdani-endorsement-from-kathy-hochul-could-have-consequences/",
    "timestamp": "2025-09-15T15:30:08Z"
  },
  {
    "title": "The Campaign to Punish Those Who Did Not Mourn Charlie Kirk’s Death",
    "description": "People who did not express genuine grief at the murder of Charlie Kirk are in serious trouble. Some have been fired or suspended. Some have been harassed for their views. Before anyone attacks me for acknowledging this phenomenon, let me point out that I did …",
    "link": "https://dianeravitch.net/2025/09/15/the-campaign-to-punish-those-who-did-not-mourn-charlie-kirks-death/",
    "timestamp": "2025-09-15T15:30:00Z"
  },
  {
    "title": "Musk Buys $1 Billion Tesla Shares After Huge Payout Proposal",
    "description": "Elon Musk bought on Friday shares in Tesla worth about $1 billion, a regulatory filing showed on Monday, just over a week after Tesla’s board proposed an unheard of $1-trillion pay package for the Tesla CEO if the EV maker reaches major production, innovation…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Musk-Buys-1-Billion-Tesla-Shares-After-Huge-Payout-Proposal.html",
    "timestamp": "2025-09-15T15:30:00Z"
  },
  {
    "title": "British TV Station to Air Marathon of Trump’s Lies as He Visits UK",
    "description": "British station Channel 4 will broadcast a marathon of Donald Trump's lies during the president's planned state visit with King Charles III.",
    "link": "http://www.rollingstone.com/politics/politics-news/channel-4-marathon-trump-lies-uk-state-visit-1235427529/",
    "timestamp": "2025-09-15T15:26:44Z"
  },
  {
    "title": "Coldplay Sparks Backlash Over Charlie Kirk Comments",
    "description": "Kirk, co‑founder of Turning Point USA and a prominent conservative commentator, was shot dead on Wednesday.",
    "link": "https://www.newsweek.com/coldplay-charlie-kirk-comments-backlash-2129990",
    "timestamp": "2025-09-15T15:25:38Z"
  },
  {
    "title": "WATCH: ‘Better future’ for Gaza cannot begin until Hamas ‘eliminated,’ Rubio says with Netanyahu",
    "description": "On Monday, Israeli Prime Minister Benjamin Netanyahu and U.S. Secretary of State Marco Rubio stood together in Jerusalem, downplaying criticism.",
    "link": "https://www.pbs.org/newshour/politics/watch-better-future-for-gaza-cannot-begin-until-hamas-eliminated-rubio-says-with-netanyahu",
    "timestamp": "2025-09-15T15:25:07Z"
  },
  {
    "title": "Sometimes in Life, You Can Get What You Want",
    "description": "Another day, another story about red state voters shooting themselves in their economic face : As House Agriculture Chair G.T. Thompson prepares to introduce legislation aimed at easing the farm labor crisis, farmers in the Pennsylvania Republican’s district …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/sometimes-in-life-you-can-get-what-you-want",
    "timestamp": "2025-09-15T15:25:03Z"
  },
  {
    "title": "NASA Kicks Chinese Workers Out As It Promises It's Not Losing The Next Moon Race",
    "description": "The philosophy seems to be that NASA should do all Moon stuff, all the Moon time.",
    "link": "https://www.jalopnik.com/1968205/nasa-chinese-workers-losing-moon-race/",
    "timestamp": "2025-09-15T15:25:00Z"
  },
  {
    "title": "What to know about the aftermath of Charlie Kirk’s assassination",
    "description": "Authorities have not provided many details about why they think Robinson carried out the attack on Kirk.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-the-aftermath-of-charlie-kirks-assassination",
    "timestamp": "2025-09-15T15:24:15Z"
  },
  {
    "title": "Fox’s Andrew McCarthy Argues Trump’s Effort to Fire Fed Governor Likely to Fail",
    "description": "\"Trump relied entirely on Pulte’s information to rationalize firing Cook. It now appears that Pulte’s information is either wrong or materially incomplete.\"\nThe post Fox’s Andrew McCarthy Argues Trump’s Effort to Fire Fed Governor Likely to Fail first appeare…",
    "link": "https://www.mediaite.com/media/news/foxs-andrew-mccarthy-argues-trumps-effort-to-fire-fed-governor-likely-to-fail/",
    "timestamp": "2025-09-15T15:22:35Z"
  },
  {
    "title": "For the first time since 2019, the Fed could split both ways on a rate decision",
    "description": "At least two Fed presidents have expressed concerns about inflation.",
    "link": "https://fortune.com/2025/09/15/fed-dissent-both-ways-first-time-2019/",
    "timestamp": "2025-09-15T15:22:22Z"
  },
  {
    "title": "EXCLUSIVE: State Department Sued For Records Related To Man On Trial For Second Attempted Trump Assassination",
    "description": "The State Department was hit with a lawsuit Monday to turn over any records related to communications with alleged attempted Trump assasin Ryan Routh.",
    "link": "https://dailycaller.com/2025/09/15/exclusive-state-department-sued-ryan-routh-second-attempted-trump-assassination/",
    "timestamp": "2025-09-15T15:21:55Z"
  },
  {
    "title": "Trump slams NY Gov. Kathy Hochul over endorsement of Mamdani for mayor",
    "description": "NEW YORK — President Donald Trump Monday slammed Gov. Kathy Hochul for endorsing Zohran Mamdani for mayor, extending his effort to influence the race for...",
    "link": "https://www.nydailynews.com/2025/09/15/trump-slams-hochul-endorsement-mamdani-mayor/",
    "timestamp": "2025-09-15T15:21:00Z"
  },
  {
    "title": "Teens say they can’t escape graphic videos of Charlie Kirk shooting on TikTok, X, Instagram",
    "description": "No matter teens' political opinions, everyone knew Charlie Kirk.",
    "link": "https://fortune.com/2025/09/15/teens-cant-escape-graphic-video-charlie-kirk/",
    "timestamp": "2025-09-15T15:20:02Z"
  },
  {
    "title": "Trump says the US should do away with quarterly earnings reports",
    "description": "President Donald Trump wants to do away with the quarterly earnings report. In a post on Truth Social, Trump said securities regulators should stop requiring companies to issue financial reports every three months and instead switch to a six-month reporting p…",
    "link": "https://apnews.com/article/trump-quarterly-earnings-reports-sec-semiannual-cd5fbed69b72e7525848bc11109d0d35",
    "timestamp": "2025-09-15T15:18:02Z"
  },
  {
    "title": "Ted Cruz Filmed Cleaning Charlie Kirk Graffiti: 'Erasing Evil'",
    "description": "The Texas senator painted over graffiti on a Houston freeway about the right-wing activist, who was shot dead last week.",
    "link": "https://www.newsweek.com/ted-cruz-charlie-kirk-graffiti-texas-2129892",
    "timestamp": "2025-09-15T15:16:33Z"
  },
  {
    "title": "‘Scores are going to be spoken to’: FBI scouring social media chat probing if MORE people involved in Charlie Kirk murder",
    "description": "One message prior to assassination: 'September 10th will be a very interesting day'",
    "link": "https://www.wnd.com/2025/09/scores-are-going-be-spoken-fbi-scouring-social/",
    "timestamp": "2025-09-15T15:16:32Z"
  },
  {
    "title": "DNA evidence found near scene of Charlie Kirk’s shooting matches suspect, FBI director says",
    "description": "Authorities are preparing to file capital murder charges as early as Tuesday.",
    "link": "https://www.denverpost.com/2025/09/15/charlie-kirk-shot-investigation/",
    "timestamp": "2025-09-15T15:15:53Z"
  },
  {
    "title": "DNA evidence found near scene of Charlie Kirk’s shooting matches suspect, FBI director says",
    "description": "Authorities are preparing to file capital murder charges as early as Tuesday.",
    "link": "https://www.bostonherald.com/2025/09/15/charlie-kirk-shot-investigation/",
    "timestamp": "2025-09-15T15:15:53Z"
  },
  {
    "title": "Morning Joe on Charlie Kirk Killer: 'Motives Almost Shouldn't Matter'",
    "description": "[snip] On today's Morning Joe, MSNBC's Jonathan Lemire argued that Tyler Robinson's motives \"almost shouldn't matter.\" Isn't Lemire a \"news\" reporter? Facts don't matter? Employing the James Carville deflection technique of \"look ovah heah, a squirrel!,\" Lemi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4340567/posts",
    "timestamp": "2025-09-15T15:15:16Z"
  },
  {
    "title": "Trump renews threat of hitting Soros with RICO investigation",
    "description": "In the wake of the assassination of Charlie Kirk and the public demonstrations about it, President Donald Trump indicated he would look into those financing the \"professional agitators\" who have taken over the streets in recent years. In a Friday appearance o…",
    "link": "https://www.theblaze.com/news/trump-renews-threat-of-hitting-soros-with-rico-investigation",
    "timestamp": "2025-09-15T15:15:00Z"
  },
  {
    "title": "Fed meeting this week: What to expect on interest rates and voting members",
    "description": "Fed meeting September: The Federal Reserve is meeting this week to decide on interest rate cuts. Uncertainty surrounds the decision due to economic factors like inflation and hiring trends. Political pressure from Donald Trump and potential staffing changes a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/fed-meeting-september-what-to-expect-on-interest-rate-cuts-and-voting-members/articleshow/123903507.cms",
    "timestamp": "2025-09-15T15:14:04Z"
  },
  {
    "title": "Why Wasn’t Charlie Kirk Mentioned at the Emmys?",
    "description": "Reading Time: 3 minutesSome Emmy viewers were shocked that there was no mention of Charlie Kirk during the show.\nWhy Wasn’t Charlie Kirk Mentioned at the Emmys? was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/why-wasnt-charlie-kirk-mentioned-at-the-emmys/",
    "timestamp": "2025-09-15T15:13:31Z"
  },
  {
    "title": "Kash Patel's Chances of Exiting FBI Surge Over Handling of Charlie Kirk",
    "description": "Betting platform Polymarket shows wagers on the director's possible departure before September 30 are increasing.",
    "link": "https://www.newsweek.com/kash-patel-fbi-polymarket-odds-charlie-kirk-2130013",
    "timestamp": "2025-09-15T15:13:16Z"
  },
  {
    "title": "Donald Trump Wants To Scrap Quarterly Earnings Reports For U.S. Companies - Deadline",
    "description": "Donald Trump Wants To Scrap Quarterly Earnings Reports For U.S. CompaniesDeadline Trump endorses dramatic shift to the US economyCNN Trump advocates end to quarterly earnings reportsCNBC Donald Trump calls for US companies to ditch quarterly reportingFinancia…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179261020",
    "timestamp": "2025-09-15T15:12:33Z"
  },
  {
    "title": "‘Who Tried to Firebomb You, Governor?’ Conservatives Bristle Over Josh Shapiro Comments on Political Violence",
    "description": "Pennsylvania Governor Josh Shapiro (D) and his family were targeted earlier this year over his perceived allegiance to Israel.\nThe post ‘Who Tried to Firebomb You, Governor?’ Conservatives Bristle Over Josh Shapiro Comments on Political Violence first appeare…",
    "link": "https://www.mediaite.com/media/news/who-tried-to-firebomb-you-governor-conservatives-bristle-over-josh-shapiro-comments-on-political-violence/",
    "timestamp": "2025-09-15T15:11:52Z"
  },
  {
    "title": "Macron admitted NATO behind Ukraine conflict – Sachs",
    "description": "Jeffrey Sachs claims French President Emmanuel Macron privately blamed NATO for the Ukraine conflict despite publicly accusing Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624687-sachs-macron-nato-ukraine/",
    "timestamp": "2025-09-15T15:10:19Z"
  },
  {
    "title": "South Koreans Honor Charlie Kirk with Seoul Memorials and Vigils: 'Hero of Freedom'",
    "description": "Conservative youth groups in Seoul, South Korea, organized memorial sites for mourners to honor the legacy of commentator and activist Charlie Kirk in the days following his assassination, assembling the largest one yet on Monday before the iconic Sungnyemun …",
    "link": "https://www.breitbart.com/asia/2025/09/15/south-koreans-honor-charlie-kirk-with-seoul-memorials-and-vigils-hero-of-freedom/",
    "timestamp": "2025-09-15T15:10:15Z"
  },
  {
    "title": "Trump vows tough action after gruesome beheading of motel manager in Dallas by employee",
    "description": "President Donald Trump said \"the time for being soft\" on illegal immigration is over after the beheading of motel manager Chandra Nagamallaiah.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/15/trump-beheading-dallas-motel-manager-worker/86163116007/",
    "timestamp": "2025-09-15T15:09:08Z"
  },
  {
    "title": "Trump Files to Cancel Approval of Maryland Offshore Wind Farm",
    "description": "The Trump administration asked a federal court to cancel the approval of a $6 billion wind project planned off the coast of Maryland as part of a wider effort to halt the development of the offshore clean- energy resource. The …",
    "link": "https://www.insurancejournal.com/news/east/2025/09/15/839148.htm",
    "timestamp": "2025-09-15T15:07:52Z"
  },
  {
    "title": "Trump demands NATO allies halt Russian oil purchases before new US sanctions",
    "description": "President Donald Trump threatens major sanctions on Russia, but only if NATO nations first stop buying Russian oil and end their dependence on Moscow’s energy.",
    "link": "https://www.foxnews.com/world/trump-demands-nato-allies-halt-russian-oil-purchases-before-new-us-sanctions",
    "timestamp": "2025-09-15T15:06:23Z"
  },
  {
    "title": "US military observing drill between Russia and key ally (VIDEO)",
    "description": "Representatives from two other NATO countries are also attending the Zapad-2025 exercise, officials in Belarus have said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624686-belarus-games-us-visit/",
    "timestamp": "2025-09-15T15:06:21Z"
  },
  {
    "title": "No\nAvoiding It: Post-Kirk, We Have to Learn About the Groyper Wars",
    "description": "Republican Governor Spencer Cox’s ​U​tah hot take on Charlie Kirk’s assassination Wednesday is still the most candid. “I was praying that if this had to happen here, that [the killer] wouldn’t be one of us,” Cox said, meaning (presumably) that ​the killer wou…",
    "link": "https://newrepublic.com/article/200451/charlie-kirk-fuentes-groyper-wars",
    "timestamp": "2025-09-15T15:03:28Z"
  },
  {
    "title": "Israel attack aimed to halt Gaza talks, Qatar emir tells emergency summit",
    "description": "Qatar’s emir accused Israel of trying to derail Gaza ceasefire efforts with its attack on Hamas in Doha, as Arab and Muslim leaders held emergency talks on Monday to discuss a unified response. The joint Arab League and Organisation of Islamic Cooperation sum…",
    "link": "https://www.digitaljournal.com/world/israel-attack-aimed-to-halt-gaza-talks-qatar-emir-tells-emergency-summit/article",
    "timestamp": "2025-09-15T15:02:20Z"
  },
  {
    "title": "Trump endorses dramatic shift to the US economy",
    "description": "In his latest bid to reshape the American economy, President Donald Trump has endorsed ending the decades-long practice of public companies sharing their financial results once each quarter.\nSuch a move would represent a dramatic shift aimed at combating shor…",
    "link": "https://biztoc.com/x/c16f70fda1a821f5",
    "timestamp": "2025-09-15T15:00:51Z"
  },
  {
    "title": "Elon Musk buys $1 billion worth of Tesla shares",
    "description": "Elon Musk bought $1 billion worth of Tesla shares on Friday, according to a regulatory filing he made early Monday.",
    "link": "https://www.abc12.com/news/business/elon-musk-buys-1-billion-worth-of-tesla-shares/article_631a6b2e-a8f8-5e9e-8ed9-116d6727fde3.html",
    "timestamp": "2025-09-15T15:00:47Z"
  },
  {
    "title": "Trump Issues Update on Zelensky-Putin Talks After Russia Sanctions Threat",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump said that a sticking point in the prospects of talks between Vladimir Putin and Volodymyr Zelensky is the level of enmity between them.\nTrump suggested that he would have to be an i…",
    "link": "https://biztoc.com/x/260fa2e153c65914",
    "timestamp": "2025-09-15T15:00:39Z"
  },
  {
    "title": "Trump says companies should report earnings every six months",
    "description": "President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n said companies should not be forced to deliver \n \n \n \n \n \n \n \n \n \n earnings reports\n \n \n \n \n \n \n \n \n \n on a quarterly basis, saying he preferred a six-month schedule he cast as saving businesses ti…",
    "link": "https://biztoc.com/x/b3f239f9a5ed500c",
    "timestamp": "2025-09-15T15:00:37Z"
  },
  {
    "title": "Noem's Goons Smear Grieving Mom as 'Wanted Killer'...",
    "description": "Kristi Noem’s Department of Homeland Security falsely accused a mom who lost her baby while locked up by ICE of",
    "link": "https://dnyuz.com/2025/09/15/ice-barbies-goons-smeared-grieving-mom-as-wanted-killer/",
    "timestamp": "2025-09-15T15:00:03Z"
  },
  {
    "title": "Report: FBI Looking into Individuals Who Appeared to Know About Charlie Kirk Assassination Beforehand",
    "description": "The FBI is reportedly looking into individuals who appeared to know about the assassination of Turning Point USA founder Charlie Kirk beforehand.\nThe post Report: FBI Looking into Individuals Who Appeared to Know About Charlie Kirk Assassination Beforehand ap…",
    "link": "https://www.breitbart.com/politics/2025/09/15/report-fbi-looking-into-individuals-who-appeared-know-charlie-kirk-assassination-beforehand/",
    "timestamp": "2025-09-15T14:59:56Z"
  },
  {
    "title": "‘Once in a Century’ Man: Netanyahu Responds to Charlie Kirk Assassination",
    "description": "Some people cannot be replaced, Israeli Prime Minister Benjamin Netanyahu said while discussing the assassination of conservative political activist Charlie Kirk.   “Charlie was 31... Read More\nThe post ‘Once in a Century’ Man: Netanyahu Responds to Charlie K…",
    "link": "https://www.dailysignal.com/2025/09/15/once-in-a-century-man-netanyahu-responds-charlie-kirk-assassination/",
    "timestamp": "2025-09-15T14:59:46Z"
  },
  {
    "title": "Suspect in Charlie Kirk shooting had 'obsession' with the influencer, FBI says",
    "description": "The suspect who was arrested for allegedly killing Charlie Kirk had an \"obsession\" with the conservative influencer, the FBI said on Monday.",
    "link": "https://abcnews.go.com/US/charlie-kirk-killing-tyler-robinson-obsession-influencer/story?id=125582085",
    "timestamp": "2025-09-15T14:58:45Z"
  },
  {
    "title": "British politicians condemn Elon Musk’s ‘dangerous’ comments at anti-immigration rally",
    "description": "Starmer's spokesman said the government had no plans to sanction Musk over his comments.",
    "link": "https://www.pbs.org/newshour/world/british-politicians-condemn-elon-musks-dangerous-comments-at-anti-immigration-rally",
    "timestamp": "2025-09-15T14:58:38Z"
  },
  {
    "title": "Trump Issues Update on Zelensky-Putin Talks After Russia Sanctions Threat",
    "description": "The U.S. president told reporters that\"the hatred between Zelensky and Putin is unfathomable.\"",
    "link": "https://www.newsweek.com/trump-update-zelensky-putin-talks-2129886",
    "timestamp": "2025-09-15T14:57:34Z"
  },
  {
    "title": "Trump says US-China trade talks in Europe \"gone very well\", drops big TikTok hint",
    "description": "Donald Trump announced that trade discussions between the US and China in Europe concluded successfully, hinting at a resolution concerning TikTok. He mentioned plans to speak with President Xi Jinping soon, emphasizing the strong relationship between the two…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-china-trade-talks-in-europe-gone-very-well-drops-big-tiktok-hint/articleshow/123904025.cms",
    "timestamp": "2025-09-15T14:57:21Z"
  },
  {
    "title": "Remember That TikTok Ban? A Deal This Week Could Finally Bring Closure",
    "description": "As another TikTok shutdown deadline nears, an agreement with China seems to be imminent.",
    "link": "https://www.cnet.com/news/social-media/remember-that-tiktok-ban-a-deal-this-week-could-finally-bring-closure/",
    "timestamp": "2025-09-15T14:56:24Z"
  },
  {
    "title": "'Something Dark Might Be Coming': Senator Rebukes Right's Weaponization of Kirk Murder to 'Destroy Dissent'",
    "description": "A Democratic US senator over the weekend issued an ominous warning about Republicans using the murder of Charlie Kirk as a pretense to clamp down on political speech.In a lengthy social media post on Sunday, Sen. Chris Murphy (D-Conn.) outlined how President …",
    "link": "https://www.commondreams.org/news/chris-murphy-charlie-kirk",
    "timestamp": "2025-09-15T14:55:54Z"
  },
  {
    "title": "New poll points to Trump voters’ tolerance for authoritarian approach to the rule of law",
    "description": "In 2023, nearly a third of Trump voters endorsed having a president \"willing to break some rules and laws to set things right.\" Two years later, it's worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-poll-points-trump-voters-tolerance-authoritarian-approach-rule-law-rcna231337",
    "timestamp": "2025-09-15T14:55:00Z"
  },
  {
    "title": "Present At The Creation: A Short History Of The SALT Deduction",
    "description": "Joseph J. Thorndike traces the history of the state and local tax deduction.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/09/15/present-at-the-creation-a-short-history-of-the-salt-deduction/",
    "timestamp": "2025-09-15T14:54:46Z"
  },
  {
    "title": "Democratic Senator Warns Of Campaign To Crush Dissent In Wake Of Charlie Kirk’s Death",
    "description": "Recent statements by close allies of President Donald Trump have alarmed Sen. Chris Murphy (D-Conn.).",
    "link": "https://www.huffpost.com/entry/chris-murphy-trump-dissent_n_68c813dee4b0a42499c7660a",
    "timestamp": "2025-09-15T14:54:02Z"
  },
  {
    "title": "Musk buys $1bn worth of Tesla shares",
    "description": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
    "link": "https://www.bbc.com/news/articles/cp982z3xrz7o",
    "timestamp": "2025-09-15T14:53:37Z"
  },
  {
    "title": "Trump Is Back to Threatening New York City",
    "description": "Just one day after Governor Kathy Hochul endorsed Zohran Mamdani for mayor, President Trump said Washington ‘will be watching this situation very closely.’",
    "link": "http://nymag.com/intelligencer/article/trump-renews-threats-against-nyc-after-hochul-backs-mamdani.html",
    "timestamp": "2025-09-15T14:53:08Z"
  },
  {
    "title": "Norway Has More EV Charging Ports Than Gas Nozzles?",
    "description": "Norway is a world leader in electric vehicle adoption. Visit Norway calls the northern European nation the “EV Capital of the World.” Almost 89% of all new cars sold in Norway in 2024 were electric. The Norwegians seem to understand that fossil fuels are harm…",
    "link": "https://cleantechnica.com/2025/09/15/norway-has-more-ev-charging-ports-than-gas-nozzles/",
    "timestamp": "2025-09-15T14:52:27Z"
  },
  {
    "title": "Left-Wing Protesters Disrupt Charlie Kirk Vigil With Song Engraved On Alleged Assassin’s Bullets",
    "description": "Left-wing protesters at a vigil for TPUSA founder Charlie Kirk sang a song engraved on a bullet in the rifle of Kirk’s assassin in video posted to social media.",
    "link": "https://dailycaller.com/2025/09/15/left-wing-protesters-disrupt-charlie-kirk-vigil-with-song-engraved-on-alleged-assassins-bullets/",
    "timestamp": "2025-09-15T14:50:04Z"
  },
  {
    "title": "Trump tariffs are fueling inflation, congressional budget chief says",
    "description": "President Donald Trump's tariffs face an uncertain future as the Supreme Court is poised to hear the administration's appeal of lower court rulings.",
    "link": "https://biztoc.com/x/b136cb454ecaa27b",
    "timestamp": "2025-09-15T14:49:31Z"
  },
  {
    "title": "Trump says the US should do away with quarterly earnings reports",
    "description": "President Donald Trump wants to do away with the quarterly earnings report.\nIn a post on Truth Social, Trump said securities regulators should stop requiring companies to issue financial reports every three months and instead switch to a six-month reporting p…",
    "link": "https://biztoc.com/x/894370121c03d269",
    "timestamp": "2025-09-15T14:49:28Z"
  },
  {
    "title": "Embattled Trump official gets biggest slap in face in bombshell report",
    "description": "A Fox News report found Trump officials are turning on one of their own.",
    "link": "https://www.nj.com/politics/2025/09/embattled-trump-official-gets-biggest-slap-in-face-in-bombshell-report.html",
    "timestamp": "2025-09-15T14:49:15Z"
  },
  {
    "title": "Poland arrests two Belarusians after drone flown over Warsaw presidential palace",
    "description": "Polish authorities neutralise a drone flying above government buildings in Warsaw on Monday night, as the country remains on high alert following recent Russian drone incursions.",
    "link": "https://www.abc.net.au/news/2025-09-16/poland-arrests-belarusians-over-drone-flying-in-warsaw/105776824",
    "timestamp": "2025-09-15T14:48:52Z"
  },
  {
    "title": "RFK Jr. lambasted over bizarre claim about 8-year-old Charlie Kirk: 'Weird even for GOP'",
    "description": "Health and Human Services Secretary Robert F. Kennedy reminisced about his relationship with right-wing influencer Charlie Kirk Sunday in the wake of his killing last week, recounting a 2001 meeting in which he said they became close friends. Online critics, …",
    "link": "https://www.rawstory.com/charlie-kirk-2673995314/",
    "timestamp": "2025-09-15T14:47:40Z"
  },
  {
    "title": "Trump weighs in on blue state governor’s endorsement of 'Liddle Communist'",
    "description": "Trump criticized Hochul's backing of NYC mayoral frontrunner Zohran Mamdani and hinted at restricting federal funding if the democratic socialist wins.",
    "link": "https://www.foxnews.com/politics/trump-weighs-blue-state-governors-endorsement-liddle-communist",
    "timestamp": "2025-09-15T14:47:29Z"
  },
  {
    "title": "Tominey: Prince William ‘should make peace’ with ‘hostage’ Prince Harry",
    "description": "While many Sussex fans consider Telegraph columnist/royalist Camilla Tominey to be one of our biggest opps, she barely even writes about the Windsors or the Sussexes at this point. She’s gone full-throttle into defending British and American ultra-right wing …",
    "link": "https://www.celebitchy.com/940447/tominey_prince_william_should_make_peace_with_hostage_prince_harry/",
    "timestamp": "2025-09-15T14:45:49Z"
  },
  {
    "title": "Bill Maher Torches ‘Assh*les’ on The Left Attacking Him for Hosting Guests Like Charlie Kirk: ‘F*ck Off With This Bullsh*t!’",
    "description": "Maher unloaded on the left-leaning commentators attacking him for having hosted Charlie Kirk and his decision to meet President Donald Trump.\nThe post Bill Maher Torches ‘Assh*les’ on The Left Attacking Him for Hosting Guests Like Charlie Kirk: ‘F*ck Off With…",
    "link": "https://www.mediaite.com/media/tv/bill-maher-torches-asshles-on-the-left-attacking-him-for-hosting-guests-like-charlie-kirk-fck-off-with-this-bullsht/",
    "timestamp": "2025-09-15T14:45:07Z"
  },
  {
    "title": "Trump endorses dramatic shift to the US economy",
    "description": "In his latest bid to reshape the American economy, President Donald Trump has endorsed ending the decades-long practice of public companies sharing their...",
    "link": "https://www.cnn.com/2025/09/15/economy/trump-quarterly-reporting-sec-earnings",
    "timestamp": "2025-09-15T14:44:06Z"
  },
  {
    "title": "Dollar eases as traders await Fed interest rate decision",
    "description": "NEW YORK : The dollar eased across the board on Monday as investors braced for the Federal Reserve to resume interest rate cuts at this week's meeting and President Donald Trump renewed calls for faster monetary policy easing.Trump on Monday called for Fed Ch…",
    "link": "https://www.channelnewsasia.com/business/dollar-eases-traders-await-fed-interest-rate-decision-5349281",
    "timestamp": "2025-09-15T14:44:06Z"
  },
  {
    "title": "Charlie Kirk’s Books And Podcasts Top Charts Following Assassination",
    "description": "Even a song dedicated to Kirk, “CHARLIE,” is topping some streaming charts.",
    "link": "https://www.forbes.com/sites/conormurray/2025/09/15/charlie-kirks-books-and-podcasts-top-charts-following-assassination/",
    "timestamp": "2025-09-15T14:43:38Z"
  },
  {
    "title": "MSNBC Guest Admits She Scoffed at Young Men Feeling ‘Marginalized’ Before Charlie Kirk Death",
    "description": "MSNBC Guest Shaniqua McClendon said the killing of Charlie Kirk reminded her of a key moment where she realized it was not okay to \"blanketly\" judge Trump fans\nThe post MSNBC Guest Admits She Scoffed at Young Men Feeling ‘Marginalized’ Before Charlie Kirk Dea…",
    "link": "https://www.mediaite.com/media/msnbc-guest-admits-she-scoffed-at-young-men-feeling-marginalized-before-charlie-kirk-death/",
    "timestamp": "2025-09-15T14:43:28Z"
  },
  {
    "title": "Can the EU and NATO impose tariffs on India and China, as Trump wants?",
    "description": "In an effort to end Russia’s war in Ukraine, the US president proposes tariffs targeting Putin's major trading partners.",
    "link": "https://www.aljazeera.com/news/2025/9/15/can-the-eu-and-nato-impose-tariffs-on-india-and-china-as-trump-wants",
    "timestamp": "2025-09-15T14:43:07Z"
  },
  {
    "title": "Bomb Found in City Near Kirk Assassination Site: Anti-Trump Suspects Nabbed - Targeted Fox Affiliate News Van",
    "description": "The men showed signs -- literally -- of opposing President Donald Trump. What the FBI found in their home could have been deadly.",
    "link": "https://www.westernjournal.com/bomb-found-city-near-kirk-assassination-site-anti-trump-suspects-nabbed-targeted-fox-affiliate-news-van/",
    "timestamp": "2025-09-15T14:41:24Z"
  },
  {
    "title": "Trump urges for major rate cut as Fed meeting nears",
    "description": "WASHINGTON: President Donald Trump renewed his call on Monday (Sep 15) for a large interest rate cut, furthering pressure on the independent US central bank a day before it opens a key policy meeting.In a post to his Truth Social platform, Trump said that Fed…",
    "link": "https://www.channelnewsasia.com/world/us-federal-reserve-fed-trump-urge-major-rate-cut-5350446",
    "timestamp": "2025-09-15T14:41:00Z"
  },
  {
    "title": "Trump Confirms a Large Group of People Are Under Investigation in Charlie Kirk Assassination Case (VIDEO)",
    "description": "President Donald Trump announced on Sunday that a “large group of people,” specifically tied to the radical left, are now under federal investigation in connection with the assassination of conservative powerhouse Charlie Kirk.\nThe post Trump Confirms a Large…",
    "link": "https://www.thegatewaypundit.com/2025/09/trump-confirms-large-group-people-are-under-investigation/",
    "timestamp": "2025-09-15T14:40:22Z"
  },
  {
    "title": "Qatar hosts summit in response to Israeli strike on Hamas in Doha, seeking to restrain such attacks",
    "description": "Qatar convened Arab and Islamic leaders following Israel's strike on Hamas leaders in Doha, seeking a unified response. Qatar's emir criticized Israel's actions in Gaza, accusing them of genocide and undermining ceasefire negotiations. Despite tensions, Iran …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/qatar-hosts-summit-in-response-to-israeli-strike-on-hamas-in-doha-seeking-to-restrain-such-attacks/articleshow/123903780.cms",
    "timestamp": "2025-09-15T14:39:12Z"
  },
  {
    "title": "Trump Agrees to Restore Deleted HIV, LGBTQ Health Webpages",
    "description": "The Trump administration has agreed to settle a lawsuit by restoring webpages containing health- and science-related information, including resources on HIV and LGBTQ health issues, that had been deleted to comply with a series of executive orders issued by P…",
    "link": "https://freerepublic.com/focus/f-news/4340561/posts",
    "timestamp": "2025-09-15T14:38:49Z"
  },
  {
    "title": "Trump tariffs are fueling inflation, congressional budget chief says",
    "description": "President Donald Trump's tariffs face an uncertain future as the Supreme Court is poised to hear the administration's appeal of lower court rulings.",
    "link": "https://www.cnbc.com/2025/09/15/trump-trade-inflation-tariffs-cbo.html",
    "timestamp": "2025-09-15T14:38:47Z"
  },
  {
    "title": "Trump renews calls for switching to six-month reporting period for companies",
    "description": "President Donald Trump on Monday pushed for the U.S. Securities and Exchange Commission to stop requiring quarterly earnings reports from companies and corporations and to have them report on a six-month basis instead.\n“This will save money, and allow manager…",
    "link": "https://biztoc.com/x/33fe3cbb919c2d8b",
    "timestamp": "2025-09-15T14:38:18Z"
  },
  {
    "title": "US reaches 'framework' TikTok deal with China, Trump and Xi to speak",
    "description": "US President Donald Trump and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days.",
    "link": "https://www.dw.com/en/us-reaches-framework-tiktok-deal-with-china-trump-and-xi-to-speak/a-74002830",
    "timestamp": "2025-09-15T14:38:00Z"
  },
  {
    "title": "US reached 'framework' TikTok deal with China",
    "description": "US President Donald Trump and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days. The United States and China have reached a framework deal regarding TikTok, Treasury Secretary Scott Bessen…",
    "link": "https://www.dw.com/en/us-reached-framework-tiktok-deal-with-china/a-74002830",
    "timestamp": "2025-09-15T14:38:00Z"
  },
  {
    "title": "US says it reached 'framework' TikTok deal with China",
    "description": "US President Donald Trump's and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days. The United States and China have reached a framework deal regarding TikTok, Treasury Secretary Scott Bess…",
    "link": "https://www.dw.com/en/us-says-it-reached-framework-tiktok-deal-with-china/a-74002830",
    "timestamp": "2025-09-15T14:38:00Z"
  },
  {
    "title": "Trump says the US should do away with quarterly earnings reports",
    "description": "President Donald Trump wants to do away with the quarterly earnings report.",
    "link": "https://www.bostonherald.com/2025/09/15/trump-eliminate-quarterly-earnings-reports/",
    "timestamp": "2025-09-15T14:37:52Z"
  },
  {
    "title": "Trump administration drops plan to compensate travelers for flight delays",
    "description": "Travelers will not be eligible for compensation if they experience delays or other issues while flying.",
    "link": "https://www.mlive.com/news/2025/09/trump-administration-drops-plan-to-compensate-travelers-for-flight-delays.html",
    "timestamp": "2025-09-15T14:37:30Z"
  },
  {
    "title": "Nvidia violated antimonopoly laws, China says",
    "description": "The State Administration for Market Regulation also said Monday it would carry out further investigation into Nvidia's acquisition of Mellanox.",
    "link": "https://www.pbs.org/newshour/economy/nvidia-violated-antimonopoly-laws-china-says",
    "timestamp": "2025-09-15T14:36:11Z"
  },
  {
    "title": "Trump Threatens to Declare National Emergency After DC Mayor Caves to 'Pressure from the Radical Left'",
    "description": "After weeks of cooperating with Trump, D.C. Mayor Bowser suddenly changed her tune last week -- and the president isn't happy.",
    "link": "https://www.westernjournal.com/trump-threatens-declare-national-emergency-dc-mayor-caves-pressure-radical-left/",
    "timestamp": "2025-09-15T14:35:43Z"
  },
  {
    "title": "US Political Violence Surges to Record, Bloomberg Analysis Shows",
    "description": "Political violence in a polarized US is surging, with the past five years of assassinations and attempts on the lives of politicians the highest on records dating back to the 1960s, a Bloomberg Geo-Economic analysis shows. Since the start of …",
    "link": "https://www.insurancejournal.com/news/national/2025/09/15/839141.htm",
    "timestamp": "2025-09-15T14:35:33Z"
  },
  {
    "title": "Japanese companies confirm Rs 4,000 cr investment in Karnataka: M B Patil",
    "description": "Karnataka Minister M B Patil announced confirmed investments of Rs 4,000 crore following a recent delegation visit to Japan. These investments from leading Japanese companies are expected to significantly boost Karnataka's industrial ecosystem.",
    "link": "https://economictimes.indiatimes.com/news/india/investments-worth-rs-4000-cr-confirmed-by-japanese-companies-honda-sumitomo-karnataka-minister/articleshow/123903734.cms",
    "timestamp": "2025-09-15T14:35:16Z"
  },
  {
    "title": "Israel continues Gaza assault as Marco Rubio says Hamas surrender is unlikely",
    "description": "US secretary of state visits Israel for talks with Binyamin Netanyahu ahead of trip to Qatar",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/15/israel-continues-gaza-assault-as-marco-rubio-says-hamas-surrender-is-unlikely/",
    "timestamp": "2025-09-15T14:34:57Z"
  },
  {
    "title": "Marco Rubio asks Qatar to help resolve Gaza conflict as Israel continues attacks",
    "description": "US secretary of state visits Israel as Arab leaders meet in Doha to discuss Israeli strike on Qatar",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/15/marco-rubio-asks-qatar-to-help-resolve-gaza-conflict-as-israel-continues-attacks/",
    "timestamp": "2025-09-15T14:34:57Z"
  },
  {
    "title": "US, S. Korea, Japan stage drills amid North's rising threat",
    "description": "The United States, South Korea and Japan are holding air and naval exercises off a South Korean island. Pyongyang has condemned it as a \"reckless muscle-flexing.\"",
    "link": "https://www.dw.com/en/us-s-korea-japan-stage-drills-amid-norths-rising-threat/a-74002960",
    "timestamp": "2025-09-15T14:34:00Z"
  },
  {
    "title": "The US and China might finally have a TikTok deal",
    "description": "The US and China have reached a “framework” deal to divest TikTok from its Chinese parent company, Treasury Secretary Scott Bessent told reporters during trade talks in Madrid on Monday. As noted by Reuters, Bessent confirmed that “the framework is for a swit…",
    "link": "https://www.theverge.com/news/778087/tiktok-ban-framework-deal-us-china-trump",
    "timestamp": "2025-09-15T14:33:45Z"
  },
  {
    "title": "UK police say they have planned for every eventuality ahead of Trump visit",
    "description": "British Prime Minister Keir Starmer will then host Trump on Thursday at his Chequers country residence.",
    "link": "https://indianexpress.com/article/world/uk-police-say-they-have-planned-for-every-eventuality-ahead-of-trump-visit-10251786/",
    "timestamp": "2025-09-15T14:33:20Z"
  }
]