[
  {
    "title": "New AQAP Leader Tries to Mobilize Muslim Americans to Assassinate Trump and His Cabinet: Sick Video",
    "description": "A terrorist group's leader has issued a call for the assassination of President Donald Trump and attacks on America and Jews everywhere.",
    "link": "https://www.westernjournal.com/new-aqap-leader-tries-mobilize-muslim-americans-assassinate-trump-cabinet-sick-video/",
    "timestamp": "2025-06-15T17:32:56Z"
  },
  {
    "title": "Sen. Alex Padilla: If Law Enforcement Detained Me, ‘Imagine What They’re Doing to People Without Titles’",
    "description": "The senator pushed back on Trump administration claims he was trying to make a \"viral moment,\" saying, \"Nothing could be further from the truth\"",
    "link": "http://www.rollingstone.com/politics/politics-news/sen-alex-padilla-speaks-out-detained-1235365111/",
    "timestamp": "2025-06-15T17:32:18Z"
  },
  {
    "title": "Netanyahu reveals Iran marked Trump as 'enemy number one' with assassination plot",
    "description": "Netanyahu reveals Iran attempted to assassinate both him and Trump, discusses Israel's strikes against Iran's nuclear program, and explains the \"imminent threat.\"",
    "link": "https://www.foxnews.com/media/netanyahu-reveals-iran-marked-trump-enemy-number-one-assassination-plot",
    "timestamp": "2025-06-15T17:31:37Z"
  },
  {
    "title": "JUST IN: Trump ‘Vetoed’ Plan By Israel to Kill Iran’s Ayatollah Khamenei, Per Reports",
    "description": "The plan was reportedly brought to Trump after Israeli intelligence identified what it believed to be an opportunity to strike Khamenei directly.\nThe post JUST IN: Trump ‘Vetoed’ Plan By Israel to Kill Iran’s Ayatollah Khamenei, Per Reports first appeared on …",
    "link": "https://www.mediaite.com/media/news/just-in-trump-vetoed-plan-by-israel-to-kill-irans-ayatollah-khamenei-per-reports/",
    "timestamp": "2025-06-15T17:30:47Z"
  },
  {
    "title": "Wife of Suspected Minnesota Lawmaker Killer Vance Boelter Detained by Police",
    "description": "The status of the wife of suspected Minnesota political assassin Vance Boelter remains unclear after she was detained and questioned when police reportedly found a weapon, ammunition, and passports in her car during a traffic stop Saturday morning.\nThe post W…",
    "link": "https://www.breitbart.com/politics/2025/06/15/wife-of-suspected-minnesota-lawmaker-killer-detained-by-police/",
    "timestamp": "2025-06-15T17:23:04Z"
  },
  {
    "title": "Oil Traders Brace for Turmoil as Iran Crisis Imperils Supply",
    "description": "Oil-watchers are bracing for a further price rally after Israeli strikes on Iranian energy assets heightened the risk to Middle East supplies.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-traders-brace-for-turmoil-as-iran-crisis-imperils-supply",
    "timestamp": "2025-06-15T17:17:13Z"
  },
  {
    "title": "Bombardment, strikes, deaths in third day of fierce Israel-Iran conflict",
    "description": "The intensifying conflict has heightened fears of a protracted all-out war and widespread instability in the region.",
    "link": "https://www.aljazeera.com/news/2025/6/15/bombardment-strikes-deaths-in-third-day-of-fierce-israel-iran-conflict",
    "timestamp": "2025-06-15T17:16:14Z"
  },
  {
    "title": "Israel planned to assassinate Iran’s supreme leader Khamenei, but Trump said no: report",
    "description": "Israel had a plan to assassinate Iranian Supreme Leader Ayatollah Ali Khamenei, but President Trump vetoed the operation, according to reports.",
    "link": "https://nypost.com/2025/06/15/world-news/israel-planned-to-assassinate-irans-supreme-leader-khamenei-but-trump-say-no-report/",
    "timestamp": "2025-06-15T17:16:11Z"
  },
  {
    "title": "IAF Destroys Iranian Aerial Tanker 1,400 miles From Israel, Farthest Strike Yet",
    "description": "Israel’s strikes on Tehran are now accelerating after achieving air superiority over the capital, with an eye towards Iran’s east.",
    "link": "https://www.twz.com/news-features/israel-destroys-iranian-aerial-tanker-1400-miles-from-israel-farthest-strike-yet",
    "timestamp": "2025-06-15T17:14:41Z"
  },
  {
    "title": "Netanyahu says regime change in Iran could be result of Israel's attacks",
    "description": "Israeli Prime Minister Benjamin Netanyahu stated that military attacks on Iran could lead to regime change, following Israel's \"Operation Rising Lion\" which targeted Iranian military command and nuclear sites. While Israel aims to dismantle Iran's nuclear and…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-says-regime-change-in-iran-could-be-result-of-israels-attacks/articleshow/121865990.cms",
    "timestamp": "2025-06-15T17:07:57Z"
  },
  {
    "title": "‘Overwhelmingly Peaceful’: Karen Bass Describes Protest From Comfort Of A Helicopter",
    "description": "Democrat LA Mayor Karen Bass stated the downtown city's 'No Kings' protest had been \"overwhelmingly peaceful\" while viewing from the comfort of a helicopter.",
    "link": "https://dailycaller.com/2025/06/15/karen-bass-los-angeles-anti-ice-protest-helicopter-damage/",
    "timestamp": "2025-06-15T17:07:08Z"
  },
  {
    "title": "Trump Vetoed Israeli Plan To Kill Iran’s Supreme Leader, U.S. Officials Say",
    "description": "Donald Trump vetoed an Israeli plan in recent days to kill Iran's Supreme Leader Ayatollah Ali Khamenei, two U.S. officials told Reuters on Sunday.",
    "link": "https://www.huffpost.com/entry/iran-israel-ali-khamenei-plot-kill-trump_n_684efb18e4b03c462a051066",
    "timestamp": "2025-06-15T17:04:18Z"
  },
  {
    "title": "BREAKING: Trump Tells ABC News He’s Mulling an Attack On Iran — Says ‘We Could Get Involved’",
    "description": "Israel has spent the past week launching airstrikes on Iranian nuclear sites and missile facilities, with Iran responding with ballistic missile barrages.\nThe post BREAKING: Trump Tells ABC News He’s Mulling an Attack On Iran — Says ‘We Could Get Involved’ fi…",
    "link": "https://www.mediaite.com/politics/trump/breaking-trump-tells-abc-news-hes-mulling-an-attack-on-iran-says-we-could-get-involved/",
    "timestamp": "2025-06-15T17:03:40Z"
  },
  {
    "title": "Trump Strategist Outlines How Bitcoin Helped Republicans Win the 2024 Election",
    "description": "Trump ally Chris LaCivita said at Coinbase’s Crypto Summit that the Republican Party recognized the importance of the crypto community.",
    "link": "https://decrypt.co/325187/trump-strategist-how-bitcoin-helped-republicans-win-2024-election",
    "timestamp": "2025-06-15T17:01:02Z"
  },
  {
    "title": "Savannah Chrisley Says Father's Day Looks 'Different' After Dad's Pardon",
    "description": "Savannah Chrisley is grateful to celebrate Father’s Day with her dad, Todd Chrisley, for the first time since his presidential pardon and subsequent release from prison. “Father’s Day looks a little different these days ,” Savannah, 27, wrote via Instagram …",
    "link": "https://www.usmagazine.com/celebrity-news/news/savannah-chrisley-says-fathers-day-looks-a-little-different-after-dad-todds-prison-release/#article",
    "timestamp": "2025-06-15T17:00:53Z"
  },
  {
    "title": "Trump Rejects Netanyahu’s Request To Join War, As Israel Needs Large US Bunker Buster Bombs",
    "description": "In the past 48 hours, Israel has asked the Trump administration to join its war effort, per Axios",
    "link": "https://www.shtfplan.com/headline-news/trump-rejects-netanyahus-request-to-join-war-as-israel-needs-large-us-bunker-buster-bombs",
    "timestamp": "2025-06-15T17:00:43Z"
  },
  {
    "title": "Netanyahu Makes Explosive Claim That Iran Was Behind the Two Assassination Attempts Against Trump in Fox News Interview",
    "description": "Israeli Prime Minister Benjamin Netanyahu made the explosive claim that Iran was behind the two attempts on President Donald Trump's life in 2024.\nThe post Netanyahu Makes Explosive Claim That Iran Was Behind the Two Assassination Attempts Against Trump in Fo…",
    "link": "https://www.mediaite.com/media/news/netanyahu-makes-explosive-claim-that-iran-was-behind-the-two-assassination-attempts-against-trump-in-fox-news-interview/",
    "timestamp": "2025-06-15T17:00:34Z"
  },
  {
    "title": "Exclusive: Christopher Luxon on trade with China and getting on President Xi Jinping’s Christmas card list",
    "description": "The PM isn't sure whether he's on President Xi's Christmas card list, like Sir John Key.",
    "link": "https://www.nzherald.co.nz/nz/politics/exclusive-christopher-luxon-on-trade-with-china-and-getting-on-president-xis-christmas-card-list/G5J3C3BMUNCDBGGX764AVUJQ3E/",
    "timestamp": "2025-06-15T17:00:00Z"
  },
  {
    "title": "Minnesota Double-Assassination Latest: Read the Haunting Texts Prime Suspect Vance Boelter Sent After he 'Murdered' Democrat Melissa Hortman and Her Husband 'While Wearing Halloween Mask'",
    "description": "David Carlson, Vance Boelter's best friend and longtime roommate, has recounted the eerie final messages he received from the accused killer.",
    "link": "https://radaronline.com/p/minnesota-assassination-texts-suspect-vance-boelter-melissa-hortman/",
    "timestamp": "2025-06-15T17:00:00Z"
  },
  {
    "title": "Military parade draws patriotic Americans from near and far: 'No better time to come to DC'",
    "description": "Fox News Digital spoke to attendees of the D.C. military parade, some who had traveled hundreds of miles to participate, about why they had come to the nation’s capital for the event.",
    "link": "https://www.foxnews.com/politics/military-parade-draws-patriotic-americans-from-near-far-no-better-time-come-dc",
    "timestamp": "2025-06-15T16:57:27Z"
  },
  {
    "title": "Manhunt in Minnesota lawmaker attacks widens to nearby state",
    "description": "Police broaden their search for the 57-year-old man to nearby South Dakota as a $50,000 reward is issued.",
    "link": "https://www.bbc.com/news/articles/c23m31ly3vko",
    "timestamp": "2025-06-15T16:57:27Z"
  },
  {
    "title": "Trump Touts His Conflict Resolution Skills, Calls for Iran Israel Deal",
    "description": "The \"America First\" president praised his foreign policy record on Sunday while urging a deal between Iran and Israel amid escalating strikes.",
    "link": "https://www.newsweek.com/trump-touts-his-conflict-resolution-skills-calls-iran-israel-deal-2085721",
    "timestamp": "2025-06-15T16:57:08Z"
  },
  {
    "title": "President Trump Discloses $57,355,532 in Crypto Income From World Liberty Financial: Report",
    "description": "President Donald Trump has reportedly pocketed tens of millions of dollars in income from World Liberty Financial (WLFI), his family-backed decentralized-finance platform. According to a new report from the New York Post, records released by the Office of Gov…",
    "link": "https://dailyhodl.com/2025/06/15/president-trump-discloses-57355532-in-crypto-income-from-world-liberty-financial-report/",
    "timestamp": "2025-06-15T16:55:15Z"
  },
  {
    "title": "Donald Trump’s Military Birthday Parade Was a Gross Failure - Rolling Stone",
    "description": "Donald Trump’s Military Birthday Parade Was a Gross FailureRolling Stone More than 30 people hospitalized following DC military paradeFOX 5 DC Trump’s Parade Drafted the Army Into a War of ImagesThe New York Times D.C. onlookers line streets for Trump militar…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178056471",
    "timestamp": "2025-06-15T16:55:02Z"
  },
  {
    "title": "Nearly 1 million illegal immigrants have ‘self deported’ under Trump, which has led to higher wages",
    "description": "DHS can’t arrest and deport 15.4 million illegal aliens, but if it simply enforces the law, many aliens will get the message and leave on their own — as hundreds of thousands apparently already have.",
    "link": "https://nypost.com/2025/06/15/opinion/nearly-1-million-illegal-immigrants-have-self-deported-under-trump-which-has-led-to-higher-wages/",
    "timestamp": "2025-06-15T16:55:00Z"
  },
  {
    "title": "Donald Trump vetoed Israeli plan to kill Iran's supreme leader, US officials say",
    "description": "U.S. officials revealed that President Trump vetoed an Israeli plan to assassinate Iran's Supreme Leader Ayatollah Ali Khamenei. Trump administration officials stated that the U.S. wouldn't consider targeting Iranian political leadership unless Americans were…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-vetoed-israeli-plan-to-kill-irans-supreme-leader-us-officials-say/articleshow/121865738.cms",
    "timestamp": "2025-06-15T16:53:38Z"
  },
  {
    "title": "Internet Trolls Around the World Are Mocking Trump’s Military Birthday Parade",
    "description": "People online questioned whether Donald Trump's Army parade measured up to other military parades in North Korea, France, and elsewhere.",
    "link": "http://www.rollingstone.com/politics/politics-news/internet-trolls-trump-military-birthday-parade-1235365104/",
    "timestamp": "2025-06-15T16:52:19Z"
  },
  {
    "title": "How close is Iran to getting a nuclear bomb — and is that what it wants?",
    "description": "According to Tehran, its nuclear program is purely civilian, though Israel thinks it's aimed at making a nuclear bomb. Iran's high levels of uranium enrichment mean that the step to weapon-grade uranium is very short.",
    "link": "https://www.dw.com/en/how-close-is-iran-to-getting-a-nuclear-bomb-and-is-that-what-it-wants/a-72918689",
    "timestamp": "2025-06-15T16:49:00Z"
  },
  {
    "title": "How close is Iran to getting a nuclear bomb?",
    "description": "According to Tehran, its nuclear program is purely civilian, though Israel thinks it's aimed at making a nuclear bomb. Iran's high levels of uranium enrichment mean that the step to weapon-grade uranium is very short. Israel has justified its recent attacks o…",
    "link": "https://www.dw.com/en/iran-israel-conflict-nuclear-weapons-donald-trump-iaea/a-72918689",
    "timestamp": "2025-06-15T16:49:00Z"
  },
  {
    "title": "Trump Nixed Plan to Kill Iran’s Ayatollah",
    "description": "President Donald Trump vetoed an Israeli plan in recent days to kill the Iran’s Supreme Leader Ayatollah Ali Khamenei, Reuters reports.",
    "link": "https://politicalwire.com/2025/06/15/trump-nixed-plan-to-kill-irans-ayatollah/",
    "timestamp": "2025-06-15T16:45:50Z"
  },
  {
    "title": "Israel Breaks Record with Strike on Airfield in Northeast Iran, 1400 Miles Away",
    "description": "The Israeli Air Force (IAF) broke its own distance record on Sunday with a strike on a refueling plane at the airfield at Mashhad in northeast Iran, at a distance of 2,300 kilometers (over 1,400 miles) from Israel. The Israel Defense Forces said in a statemen…",
    "link": "https://freerepublic.com/focus/f-news/4323207/posts",
    "timestamp": "2025-06-15T16:45:29Z"
  },
  {
    "title": "Trump vetoed an Israeli plan to kill Iran's supreme leader, US officials say (Steve Holland/Reuters)",
    "description": "Steve Holland / Reuters:\nTrump vetoed an Israeli plan to kill Iran's supreme leader, US officials say  —  President Donald Trump vetoed an Israeli plan in recent days to kill the Iran's Supreme Leader Ayatollah Ali Khamenei, two U.S. officials told Reuters on…",
    "link": "https://www.memeorandum.com/250615/p46",
    "timestamp": "2025-06-15T16:45:01Z"
  },
  {
    "title": "FLASHBACK: Trump’s Director of National Intelligence Testified That Iran is NOT Building a Nuke in March",
    "description": "President Donald Trump’s Director of National Intelligence, Tulsi Gabbard, testified in March that the intel community continues to assess that Iran has not resumed trying to build a nuclear weapon since the program was suspended by Supreme Leader Ayatollah A…",
    "link": "https://freerepublic.com/focus/f-news/4323205/posts",
    "timestamp": "2025-06-15T16:44:05Z"
  },
  {
    "title": "India a voice for Global South at G7, says foreign minister",
    "description": "India, whose leader has been invited to the G7 starting on Sunday, is eager to represent the Global South on the world stage, acting as a “bridge” between different countries, Foreign Minister Subrahmanyam Jaishankar said. India is not a member of the G7 — wh…",
    "link": "https://www.digitaljournal.com/world/india-a-voice-for-global-south-at-g7-says-foreign-minister/article",
    "timestamp": "2025-06-15T16:42:20Z"
  },
  {
    "title": "Israel Breaks Record with Strike on Airfield in Northeast Iran, 1400 Miles Away",
    "description": "The Israeli Air Force (IAF) broke its own distance record on Sunday with a strike on a refueling plane at the airfield at Mashhad in northeast Iran, at a distance of 2,300 kilometers (over 1,400 miles) from Israel. The Israel Defense\nThe post Israel Breaks Re…",
    "link": "https://www.breitbart.com/middle-east/2025/06/15/israel-breaks-record-with-strike-on-airfield-in-northeast-iran-1400-miles-away/",
    "timestamp": "2025-06-15T16:39:20Z"
  },
  {
    "title": "Trump’s Military Parade Was a Pathetic Event for a Pathetic President",
    "description": "Three dozen horses, 28 Abrams tanks, 6,700 soldiers, and millions of taxpayer dollars later, and Donald Trump’s military birthday parade was still a flop at best. \r\nA crowd that was well under the administration’s projected 200,000 peppered the National Mall …",
    "link": "https://newrepublic.com/article/196850/trump-birthday-military-parade-pathetic",
    "timestamp": "2025-06-15T16:38:34Z"
  },
  {
    "title": "Pop Star Shakira Incites Panic Saying Being an Immigrant in the U.S. 'Means Living in Constant Fear'",
    "description": "Columbian-born pop megastar Shakria, who moved to the United State when she was 19, told the BBC being an immigrant in the U.S. \"means living in constant fear.\" \nThe post Pop Star Shakira Incites Panic Saying Being an Immigrant in the U.S. ‘Means Living in Co…",
    "link": "https://www.breitbart.com/entertainment/2025/06/15/pop-star-shakira-incites-panic-saying-being-an-immigrant-in-the-u-s-means-living-in-constant-fear/",
    "timestamp": "2025-06-15T16:37:52Z"
  },
  {
    "title": "Report: Trump denied Israel's request to eliminate Iran's Supreme Leader",
    "description": "Israeli official dismisses report of Trump vetoing Khamenei strike, says targeting leadership not currently on the table but situation could shift rapidly.",
    "link": "https://www.israelnationalnews.com/news/410053",
    "timestamp": "2025-06-15T16:35:14Z"
  },
  {
    "title": "Transcript: Sen. Tom Cotton on \"Face the Nation with Margaret Brennan,\" June 15, 2025",
    "description": "The following is the transcript of an interview with Sen. Tom Cotton, Republican of Arkansas, that aired on \"Face the Nation with Margaret Brennan\" on June 15, 2025.",
    "link": "https://www.cbsnews.com/news/tom-cotton-arkansas-republican-face-the-nation-transcript-06-15-2025/",
    "timestamp": "2025-06-15T16:35:10Z"
  },
  {
    "title": "Padilla: Trump Set a Tone of ‘Escalation and Extreme Enforcement Actions’",
    "description": "Senator Alex Padilla (D-CA) said Sunday on CNN’s “State of the Union” that President Donald Trump has set a tone “of escalation and extreme enforcement actions.” Padilla said, “If all the Trump administration was doing was truly focusing on dangerous, violent…",
    "link": "https://freerepublic.com/focus/f-news/4323204/posts",
    "timestamp": "2025-06-15T16:34:33Z"
  },
  {
    "title": "Trump allegedly vetoed Israel's plan to kill Khamenei",
    "description": "United States President Donald Trump vetoed Israel's plan to eliminate Iranian Supreme Leader Ayatollah Ali Khamenei, it was reported on Sunday.More to come......",
    "link": "https://biztoc.com/x/dc0675af5a54e059",
    "timestamp": "2025-06-15T16:32:42Z"
  },
  {
    "title": "Netanyahu vows ‘we will not have a second Holocaust,’ says ‘clear’ intel warned Iran was on verge of a nuclear weapon",
    "description": "Israeli Prime Minister Benjamin Netanyahu was adamant that the intelligence was “absolutely clear” that Iran was on the verge of obtaining a nuclear weapon — and described himself as President Trump’s “junior partner.”",
    "link": "https://nypost.com/2025/06/15/world-news/netanyahu-vows-we-will-not-have-a-second-holocaust-says-clear-intel-warned-iran-was-on-verge-of-a-nuclear-weapon/",
    "timestamp": "2025-06-15T16:30:55Z"
  },
  {
    "title": "Shakira: Being an Immigrant in U.S. 'Means Living in Constant Fear'",
    "description": "Shakira: Being an Immigrant in U.S. 'Means Living in Constant Fear'hollywoodreporter.com",
    "link": "http://www.hollywoodreporter.com/news/general-news/shakira-immigrant-u-s-living-constant-fear-trump-policies-1236291329/",
    "timestamp": "2025-06-15T16:29:35Z"
  },
  {
    "title": "PHOTOS: See the anti-Trump violence that has unfolded on LA's streets across the last week",
    "description": "Los Angeles riots following immigration raids have led to looting, freeway takeovers and clashes, with Trump deploying 2,000 National Guard members.",
    "link": "https://www.foxnews.com/politics/photos-see-anti-trump-violence-has-unfolded-las-streets-across-last-week",
    "timestamp": "2025-06-15T16:28:59Z"
  },
  {
    "title": "Trump Threatens Iran With Unprecedented US Military Action In Case Of Attack: 'If We Are Attacked In Any Way, US Armed Forces Will Come Down On You At Levels Never Seen Before'",
    "description": "President Donald Trump has issued a stern warning to Iran. He has stated that any attack on US forces or land would be met with an unprecedented military response.\nWhat Happened: On Sunday Trump clarified that the US had no involvement in Israel’s recent atta…",
    "link": "https://biztoc.com/x/2f2605ebfc3d0e31",
    "timestamp": "2025-06-15T16:21:53Z"
  },
  {
    "title": "'Not a big fan': GOP lawmaker criticizes Trump military parade, says it 'glorified weapons'",
    "description": "Sen. Rand Paul criticized the June 14 military parade, arguing that it was too expensive and “glorified” weapons.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/15/gop-lawmaker-trump-military-parade-rand-paul/84219037007/",
    "timestamp": "2025-06-15T16:21:49Z"
  },
  {
    "title": "Netanyahu: Trump Iran's enemy number one",
    "description": "Israeli Prime Minister Benjamin Netanyahu described on Sunday United States President Donald Trump as Iran's \"enemy number one\" due to the latter's support for his country and insistence on Tehran to ...",
    "link": "https://biztoc.com/x/9dedf28a639d849f",
    "timestamp": "2025-06-15T16:21:40Z"
  },
  {
    "title": "Erdogan backs diplomacy on Iran-Israel tensions in call with Trump",
    "description": "President Recep Tayyip Erdoğan told U.S. President Donald Trump on Sunday that diplomacy is the only viable path to resolve the spiraling conflict between Iran and Israel, warning of a “catastrophe” if the situation is not brought under control, Türkiye’s pre…",
    "link": "https://www.hurriyetdailynews.com/erdogan-backs-diplomacy-on-iran-israel-tensions-in-call-with-trump-210326",
    "timestamp": "2025-06-15T16:18:43Z"
  },
  {
    "title": "Pilot Covering 'No Kings' Protest Goes Viral With Accidental Admission",
    "description": "The pilot inadvertently broadcast a radio conversation as he flew over L.A. on Saturday, brushing off loneliness with, \"but I got cats.\"",
    "link": "https://www.newsweek.com/pilot-hot-mic-no-king-protest-lonely-2085712",
    "timestamp": "2025-06-15T16:16:41Z"
  },
  {
    "title": "See video of Todd Chrisley’s emotional reunion with daughter Savannah after his prison release",
    "description": "Todd was released from prison after two years at the Federal Prison Camp in Pensacola, Fla., when he was pardoned for his crimes by President Trump.",
    "link": "https://pagesix.com/2025/06/15/celebrity-news/see-video-of-todd-chrisleys-emotional-reunion-with-daughter-savannah-after-his-prison-release/",
    "timestamp": "2025-06-15T16:15:57Z"
  },
  {
    "title": "Minnesota Lawmakers shot: Manhunt for alleged shooter intensifies in US after lawmaker killed, another wounded",
    "description": "Police and FBI agents waged a huge manhunt Sunday for a gunman who killed a Democratic state lawmaker and her husband in Minnesota in what officials called a politically motivated attack. Officials have issued security alerts in South Dakota and other states …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/minnesota-lawmakers-shot-manhunt-for-alleged-shooter-intensifies-in-us-after-lawmaker-killed-another-wounded/articleshow/121865204.cms",
    "timestamp": "2025-06-15T16:14:29Z"
  },
  {
    "title": "WATCH: Minnesota officials give update on search for suspect in lawmaker shootings",
    "description": "Authorities searched a vehicle on a rural road outside Minneapolis on Sunday that they believe had been used by the man wanted in the shootings of two Democratic lawmakers, as a state on edge struggled to make sense of the brazen political violence that left …",
    "link": "https://www.pbs.org/newshour/nation/authorities-share-details-of-minnesota-lawmaker-shootings-as-search-for-suspect-continues",
    "timestamp": "2025-06-15T16:12:00Z"
  },
  {
    "title": "Authorities share details of Minnesota lawmaker shootings as search for suspect continues",
    "description": "A massive search stretched into its second day Sunday for a man who authorities say wore a mask and posed as a police officer while fatally shooting a Democratic state lawmaker in her suburban Minneapolis home, an act Gov. Tim Walz called “a politically motiv…",
    "link": "https://www.pbs.org/newshour/politics/authorities-share-details-of-minnesota-lawmaker-shootings-as-search-for-suspect-continues",
    "timestamp": "2025-06-15T16:12:00Z"
  },
  {
    "title": "Israel’s War On Iran Bears The Echo Of Past American Mistakes",
    "description": "There’s a throughline between President Donald Trump’s enabling of Israel’s increasingly bloody, risky offensive against Iran and the records of past U.S. presidents, particularly George W. Bush and Joe Biden.",
    "link": "https://www.huffpost.com/entry/iraq-war-iran-israel-biden-trump_n_684ee302e4b07f75743a2d7e",
    "timestamp": "2025-06-15T16:11:22Z"
  },
  {
    "title": "Hitting the Streets with ‘No Kings Day’ Protesters",
    "description": "New Yorkers gathered in the rain Saturday to march, dance, and let Trump know ‘nobody likes him.’ See photos from the ‘No Kings Day’ protest in Manhattan here.",
    "link": "http://www.thecut.com/article/photos-no-kings-day-protest-new-york-city.html",
    "timestamp": "2025-06-15T16:09:06Z"
  },
  {
    "title": "Trump tells ABC 'it's possible' US gets involved in Iran-Israel conflict",
    "description": "President Donald Trump indicated the United States might intervene in the ongoing conflict between Iran and Israel. He mentioned being open to Vladimir Putin mediating the situation. Trump stated that discussions regarding Iran's nuclear program are still in …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-tells-abc-its-possible-us-gets-involved-in-iran-israel-conflict/articleshow/121865152.cms",
    "timestamp": "2025-06-15T16:08:01Z"
  },
  {
    "title": "Trump Due In Canada As G7 Confronts Israel-Iran Crisis",
    "description": "Group of Seven leaders including US President Donald Trump headed Sunday to the Canadian Rockies for a summit that takes on new urgency after Israel attacked Iran.",
    "link": "https://www.ibtimes.com/trump-due-canada-g7-confronts-israel-iran-crisis-3775740",
    "timestamp": "2025-06-15T16:06:09Z"
  },
  {
    "title": "Biofuels Policy, a Mainstay of American Agriculture, a Failure for the Climate",
    "description": "A longtime critic of U.S. biofuels says an expansion of biofuels policy under President Donald Trump would lead to more greenhouse gas emissions and fewer food crops.",
    "link": "https://insideclimatenews.org/news/13062025/agriculture-ethanol-biofuel-policy-climate-failure/",
    "timestamp": "2025-06-15T16:02:22Z"
  },
  {
    "title": "'This Helped Me': Dem Emboldened After 'Overweight' Trump's 'Pathetic' Parade",
    "description": "A Democratic caller told C-SPAN that President Donald Trump's military parade helped him see how \"pathetic\" the Republican commander-in-chief was.\n\n\nDuring Sunday's Washington Journal program, a New York Democrat shared his thoughts on the parade that coincid…",
    "link": "https://crooksandliars.com/2025/06/helped-me-dem-emboldened-after-overweight",
    "timestamp": "2025-06-15T16:02:21Z"
  },
  {
    "title": "Happy Father’s Day 2025",
    "description": "Happy Father’s Day to all of the dads out there today.\nThe post Happy Father’s Day 2025 appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/happy-fathers-day-2025/",
    "timestamp": "2025-06-15T16:00:23Z"
  },
  {
    "title": "If Patience Had Value, XRP Holders Would Own The Market—Expert",
    "description": "In a recent market twist, XRP surged almost 600% between November 2024 and January 2025. Based on latest data, that rally made it the top performer among major cryptocurrencies during the US President Donald Trump-led market-wide upswing. Related Reading: Cry…",
    "link": "http://www.newsbtc.com/altcoin/if-patience-had-value-xrp-holders-would-own-the-market-expert/",
    "timestamp": "2025-06-15T16:00:03Z"
  },
  {
    "title": "Trump’s EPA Ending Obama-Biden War on the American Energy Industry",
    "description": "EPA Administrator Lee Zelding proposing end to Obama-Biden \"Clean Power Plan\" and reverting back to more reasonable mercury levels set in 2012, which were amended in 2024.\nThe post Trump’s EPA Ending Obama-Biden War on the American Energy Industry first appea…",
    "link": "https://legalinsurrection.com/2025/06/trumps-epa-ending-obama-biden-war-on-the-american-energy-industry/",
    "timestamp": "2025-06-15T16:00:02Z"
  },
  {
    "title": "Chris Hedges: The Rule of Idiots",
    "description": "The last days of dying empires are dominated by idiots. The Roman, Mayan, French, Habsburg, Ottoman, Romanoff, Iranian and Soviet dynasties crumbled under the stupidity of their decadent rulers who absented themselves from reality, plundered their nations and…",
    "link": "https://www.activistpost.com/chris-hedges-the-rule-of-idiots/",
    "timestamp": "2025-06-15T16:00:00Z"
  },
  {
    "title": "Veteran analyst sends surprising message on stocks, bonds, and gold",
    "description": "The stock market rally has been impressive.\nSince President Donald Trump paused most reciprocal tariffs on April 9, only days after announcing them, stocks have soared. The S&P 500 has gained about 20%, while the tech-stock heavy Nasdaq Composite is up 27%.\nT…",
    "link": "https://biztoc.com/x/6510a3642723b937",
    "timestamp": "2025-06-15T15:59:41Z"
  },
  {
    "title": "Pollak: Not a 'Forever War,' but a War to 'Give Peace a Chance'",
    "description": "Opponents of potential American involvement in the war against Iran argue that the U.S. should not join another \"forever war\" in the Middle East. In fact, this is not a \"forever war,\" but a war for \"forever peace.\"\nThe post Pollak: Not a ‘Forever War,’ but a …",
    "link": "https://www.breitbart.com/middle-east/2025/06/15/pollak-not-forever-war-but-a-war-to-give-peace-a-chance/",
    "timestamp": "2025-06-15T15:59:16Z"
  },
  {
    "title": "WATCH: Famous leftist reporter says Islamic regime in Iran has to go and suggests one name to take over",
    "description": "'Just lobbying missiles into population centers trying to kills as many Jews as they can'",
    "link": "https://www.wnd.com/2025/06/watch-famous-leftist-reporter-says-islamic-regime-in-iran-has-to-go-and-suggests-one-name-to-take-over/",
    "timestamp": "2025-06-15T15:56:51Z"
  },
  {
    "title": "Tiger Woods does not accompany his girlfriend Vanessa Trump to the White House and misses Donald Trump's birthday: Problems?",
    "description": "Tiger Woods&apos; personal life once again finds itself in the public spotlight, not because of his performance on the golf course, but due to his noticeable absence from an import",
    "link": "https://www.marca.com/en/golf/2025/06/15/684ee9e922601de90d8b45bc.html",
    "timestamp": "2025-06-15T15:56:32Z"
  },
  {
    "title": "Everything We Know About Fugitive Minnesota Lawmaker Shooting Suspect Vance Boelter",
    "description": "Details about the primary suspect in the early Saturday morning shooting that left one Minnesota lawmaker dead and another injured paint a somewhat conflicting picture of a man who was appointed to a state board by a Democratic governor but also was a support…",
    "link": "https://www.ibtimes.com/everything-we-know-about-fugitive-minnesota-lawmaker-shooting-suspect-vance-boelter-3775737",
    "timestamp": "2025-06-15T15:50:13Z"
  },
  {
    "title": "Videos, Pictures Show Aftermath of Iranian Strikes on Tel Aviv",
    "description": "\"Iran and Israel should make a deal, and will make a deal,\" President Donald Trump said on Sunday.",
    "link": "https://biztoc.com/x/c3dbba168b80b94a",
    "timestamp": "2025-06-15T15:48:38Z"
  },
  {
    "title": "Watch These Democrats Make Fools of Themselves at 'No Kings' Rallies",
    "description": "Democratic lawmakers gathered on Saturday to protest President Donald Trump during the nationwide “No Kings” rallies. As the president marked his 79th birthday and the 250th anniversary of the U.S. Army, Democrats spent the day criticizing Trump and denouncin…",
    "link": "https://freerepublic.com/focus/f-news/4323196/posts",
    "timestamp": "2025-06-15T15:48:31Z"
  },
  {
    "title": "AUKUS: A Very Antipodean Tripartite Stupidity",
    "description": "Call it abandonment, anxiety, or just latent stupidity. The messy goo of feelings and fuzzy notions behind Australia’s most injudicious strategic decision is yielding its nasty harvest.\nThe post AUKUS: A Very Antipodean Tripartite Stupidity appeared first on …",
    "link": "https://www.globalresearch.ca/aukus-antipodean-stupidity/5891030",
    "timestamp": "2025-06-15T15:47:02Z"
  },
  {
    "title": "Macron visits Greenland in solidarity amid Trump designs on Arctic island",
    "description": "The French president says his US counterpart's Greenland takeover threats are not something allies do.",
    "link": "https://www.aljazeera.com/news/2025/6/15/macron-visits-greenland-in-solidarity-amid-trump-designs-on-arctic-island",
    "timestamp": "2025-06-15T15:44:06Z"
  },
  {
    "title": "Videos, Pictures Show Aftermath of Iranian Strikes on Tel Aviv",
    "description": "\"Iran and Israel should make a deal, and will make a deal,\" President Donald Trump said on Sunday.",
    "link": "https://www.newsweek.com/iran-israel-tel-aviv-strikes-videos-pictures-2085704",
    "timestamp": "2025-06-15T15:43:57Z"
  },
  {
    "title": "Trump’s FAA Nominee Lied About Having a ‘Commercial’ Pilot License",
    "description": "Bryan Bedford, CEO of Republic Airlines, falsely claimed to be licensed to fly commercial aircraft on the company's website for more than a decade",
    "link": "http://www.rollingstone.com/politics/politics-news/trumps-faa-nominee-lied-commercial-pilot-license-1235365087/",
    "timestamp": "2025-06-15T15:41:35Z"
  },
  {
    "title": "Memo from Iran: We Are Ready. Mike Whitney",
    "description": "Nothing one reads about Iran in the western media can be trusted. It is all poisoned with the same, vile anti-Iran hatred and bias. \nSince the 1979 Revolution to today, US policy towards Iran has been an unbroken chain of …\nThe post Memo from Iran: We Are Rea…",
    "link": "https://www.globalresearch.ca/memo-iran-ready-washington-policy/5891033",
    "timestamp": "2025-06-15T15:40:36Z"
  },
  {
    "title": "ATF official ‘absolutely’ confident suspect in Minnesota lawmaker shootings will be caught soon",
    "description": "Manhunt continues for Minnesota gunman who allegedly killed former House Speaker Hortman and her husband, and wounded State Sen. Hoffman and his wife.",
    "link": "https://www.foxnews.com/us/atf-official-absolutely-confident-suspect-minnesota-lawmaker-shootings-caught-soon",
    "timestamp": "2025-06-15T15:38:21Z"
  },
  {
    "title": "India A Voice For Global South At G7, Says Foreign Minister",
    "description": "India, whose leader has been invited to the G7 starting on Sunday, is eager to represent the Global South on the world stage, acting as a \"bridge\" between different countries, Foreign Minister Subrahmanyam Jaishankar said.",
    "link": "https://www.ibtimes.com/india-voice-global-south-g7-says-foreign-minister-3775736",
    "timestamp": "2025-06-15T15:36:21Z"
  },
  {
    "title": "India A Voice For Global South At G7, Says Foreign Minister",
    "description": "India, whose leader has been invited to the G7 starting on Sunday, is eager to represent the Global South on the world stage, acting as a \"bridge\" between different countries, Foreign Minister Subrahmanyam Jaishankar said.",
    "link": "https://www.ibtimes.com.au/india-voice-global-south-g7-says-foreign-minister-1859202",
    "timestamp": "2025-06-15T15:36:06Z"
  },
  {
    "title": "CNN’s Scott Jennings Calls on Trump To Bomb Iranian Nuke Facility: ‘He Would Deserve the Nobel Peace Prize’",
    "description": "Jennings, who has been in Israel during the violence, cited an excerpt from a Times of Israel report on X and strongly endorsed intervention from Trump.\nThe post CNN’s Scott Jennings Calls on Trump To Bomb Iranian Nuke Facility: ‘He Would Deserve the Nobel Pe…",
    "link": "https://www.mediaite.com/politics/trump/cnns-scott-jennings-calls-on-trump-to-bomb-iranian-nuke-facility-he-would-deserve-the-nobel-peace-prize/",
    "timestamp": "2025-06-15T15:35:29Z"
  },
  {
    "title": "Trump hits back at Tucker Carlson for accusing him of abandoning ‘America First’ by supporting Israel: ‘I decide’",
    "description": "President Trump rejected rightwing pundit Tucker Carlson's withering criticism that he is ditching America First principles through his support for Israel amid its military campaign against Iran.",
    "link": "https://nypost.com/2025/06/15/us-news/trump-hits-back-at-tucker-carlson-for-accusing-him-of-abandoning-america-first-by-supporting-israel/",
    "timestamp": "2025-06-15T15:35:25Z"
  },
  {
    "title": "Trump says 'it's possible' US gets involved in Israel-Iran conflict",
    "description": "President Donald Trump said Sunday that the U.S. is not involved in Israel's military strikes, but \"it's possible we could get involved.\"",
    "link": "https://abcnews.go.com/Politics/trump-us-gets-involved-israel-iran-conflict/story?id=122865561",
    "timestamp": "2025-06-15T15:33:52Z"
  },
  {
    "title": "No Kings, no arrests as 70,000 march from Cal Anderson Park",
    "description": "With reporting by Alex Garland Crowds were measured by the mile Saturday as demonstrators marched from Capitol Hill’s Cal Anderson Park in Seattle’s contribution to a weekend of “No Kings” protests across the nation. Officials estimated more than 70,000 here …",
    "link": "https://www.capitolhillseattle.com/2025/06/no-kings-no-arrests-as-70000-march-from-cal-anderson-park/",
    "timestamp": "2025-06-15T15:33:19Z"
  },
  {
    "title": "India a voice for Global South at G7, says foreign minister",
    "description": "India, whose leader has been invited to the G7 starting on Sunday, is eager to represent the Global South on the world stage, acting as a \"bridge\" between...",
    "link": "https://www.yahoo.com/news/india-voice-global-south-g7-153123164.html",
    "timestamp": "2025-06-15T15:31:23Z"
  },
  {
    "title": "Marines Stand Tall in Face of Verbal Onslaught in LA Protest",
    "description": "More than four dozen Marines refused to abandon their post as hundreds of protesters in front of the federal building in downtown Los Angles chanted in unison for them to go home.\nThe post Marines Stand Tall in Face of Verbal Onslaught in LA Protest appeared …",
    "link": "https://www.breitbart.com/immigration/2025/06/15/30317409marines-stand-tall-in-face-of-verbal-onslaught-in-la-protest/",
    "timestamp": "2025-06-15T15:29:23Z"
  },
  {
    "title": "Trump says US ‘could get involved’ in Iran-Israel conflict",
    "description": "President Donald Trump said that it’s possible the US could become involved in the Israel-Iran conflict.\n“It’s possible we could get involved,” Trump said in an interview with ABC News on Sunday. He noted that the US is “not at this moment involved.” \nThe US …",
    "link": "https://biztoc.com/x/5b5cf58e11bc248d",
    "timestamp": "2025-06-15T15:26:12Z"
  },
  {
    "title": "This is the MAGA foreign policy",
    "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are together demonstrating how to deal with a genocidal terrorist regime. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410047",
    "timestamp": "2025-06-15T15:26:00Z"
  },
  {
    "title": "Manhunt for suspect in shootings of Minnesota lawmakers continues for second day",
    "description": "Sen. Amy Klobuchar said that authorities believe the gunman could still be in the Midwest.",
    "link": "https://www.cnbc.com/2025/06/15/minnesota-shootings-suspect-manhunt-.html",
    "timestamp": "2025-06-15T15:24:09Z"
  },
  {
    "title": "Trump wary of increasing US involvement as Israel-Iran conflict escalates | CNN Politics",
    "description": "Amid ongoing strikes between Israel and Iran, Trump is publicly and privately making clear his desire to keep the United States out of the fray for now.",
    "link": "https://www.cnn.com/2025/06/15/politics/us-military-trump-israel-iran",
    "timestamp": "2025-06-15T15:21:33Z"
  },
  {
    "title": "Israel and Iran trade strikes for third day with no signs of de-escalation",
    "description": "Israel unleashed airstrikes across Iran for a third day Sunday and threatened even greater force as some Iranian missiles evaded Israeli air defenses to strike buildings in the heart of the country.",
    "link": "https://www.pbs.org/newshour/world/israel-and-iran-trade-strikes-for-third-day-with-no-signs-of-de-escalation",
    "timestamp": "2025-06-15T15:20:30Z"
  },
  {
    "title": "The Military’s Birthday Parade Rolls Quietly Through Trump’s Washington",
    "description": "Antonia Hitchens on President Donald Trump’s military parade, in Washington, D.C., to celebrate the two-hundred-and-fiftieth anniversary of the U.S. Army.",
    "link": "https://www.newyorker.com/news/the-lede/the-militarys-birthday-parade-rolls-quietly-through-trumps-washington",
    "timestamp": "2025-06-15T15:19:51Z"
  },
  {
    "title": "Iran accuses Israel of trying to spoil nuclear deal with US",
    "description": "Iranian Foreign Minister Abbas Araghchi says nobody can deny Tehran the right to have a peaceful nuclear program Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619374-iran-israel-us-araghchi/",
    "timestamp": "2025-06-15T15:16:38Z"
  },
  {
    "title": "Global Rate Limbo Reigns After 150 Days of Trump",
    "description": "In This Article:\n(Bloomberg) --\nMost Read from Bloomberg\nMultiple central banks are set to keep interest rates frozen in the coming week while continuing to gauge the impact of trade disruptions instigated by US President Donald Trump.\nFrom Washington to Lond…",
    "link": "https://biztoc.com/x/706acaf954018913",
    "timestamp": "2025-06-15T15:15:47Z"
  },
  {
    "title": "US Democrats criticise Trump, but do they have an alternative?",
    "description": "Representative Rohit Khanna says the US needs a ‘21st Century Marshall Plan’ to regain prosperity and unity.",
    "link": "https://www.aljazeera.com/program/the-bottom-line/2025/6/15/us-democrats-criticise-trump-but-do-they-have-an-alternative",
    "timestamp": "2025-06-15T15:09:22Z"
  },
  {
    "title": "Crypto, camo and karaoke: Trump’s military parade surprised everyone and impressed no one",
    "description": "Donald Trump’s military parade in Washington D.C., timed with his 79th birthday and the 250th anniversary of the U.S. Army, turned out to be a subdued and controversial affair. Intended as a show of military pride, the event drew sparse crowds, heavy protest,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/crypto-camo-and-karaoke-trumps-military-parade-surprised-everyone-and-impressed-no-one/articleshow/121864350.cms",
    "timestamp": "2025-06-15T15:08:56Z"
  },
  {
    "title": "Bass: Trump Doesn’t Understand Our Economy ‘Cannot Function’ Without Immigrant Labor",
    "description": "Los Angeles Mayor Karen Bass (D) said Sunday on CNN’s “State of the Union” that President Donald Trump does not understand there were entire sectors of the U.S. economy “cannot function without immigrant labor.” Host Dana Bash said, “Officials say more than 2…",
    "link": "https://freerepublic.com/focus/f-news/4323192/posts",
    "timestamp": "2025-06-15T15:08:05Z"
  },
  {
    "title": "Personal data of immigrant Medicaid enrollees released",
    "description": "An internal memo and emails show that Medicaid officials unsuccessfully sought to block the data transfer, citing legal and ethical concerns.",
    "link": "https://www.wlwt.com/article/trump-administration-immigrant-medicaid-enrollees/65067931",
    "timestamp": "2025-06-15T15:06:54Z"
  }
]