[
  {
    "title": "Congress Aims For New Tech Restrictions Targeting China In NDAA",
    "description": "The annual defense policy bill includes several amendments aimed at limiting China's access to US advanced technology. However, their chances of passing are unclear.",
    "link": "https://www.forbes.com/sites/owentedford/2025/10/21/congress-aims-for-new-tech-restrictions-targeting-china-in-ndaa/",
    "timestamp": "2025-10-21T13:19:25Z"
  },
  {
    "title": "Trump: M. East allies ready to deploy heavy force in Gaza",
    "description": "United States President Donald Trump said on Tuesday that several US allies in the Middle East are ready to deploy military forces into Gaza at his request.\"Numerous of our NOW GREAT ALLIES in the Mid...",
    "link": "https://biztoc.com/x/7a9ac61267e5c685",
    "timestamp": "2025-10-21T13:19:02Z"
  },
  {
    "title": "What Sanae Takaichi Has Said About Donald Trump",
    "description": "Trump is set to visit Tokyo just days after Sanae Takaichi has become Japan's first female prime minister.",
    "link": "https://biztoc.com/x/71ae6a08b13a331c",
    "timestamp": "2025-10-21T13:19:02Z"
  },
  {
    "title": "Veteran GOP Fundraiser Quits Party, Trashes Donald Trump",
    "description": "Miles Bruner said the GOP had become “a cult of personality that mirrors the worst authoritarian regimes” of the past century.",
    "link": "https://biztoc.com/x/84e1dfb321878fe0",
    "timestamp": "2025-10-21T13:18:54Z"
  },
  {
    "title": "'They are winners': Comey's 'immaculate' court filing praised as Trump team put on spot",
    "description": "The dismissal motions filed by former FBI Director James Comey’s legal team aimed at getting the Department of Justice’s case against him tossed are “immaculate,” according to a former U.S. attorney.On her “Civil Discourse” column on Substack, ex-federal pros…",
    "link": "https://www.rawstory.com/comey-defense/",
    "timestamp": "2025-10-21T13:18:48Z"
  },
  {
    "title": "US, Australia sign deal for critical minerals to limit dependence on China",
    "description": "US President Donald Trump and Australian Prime Minster Anthony Albanese have signed a deal for critical minerals.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/21/us-australia-sign-deal-for-critical-minerals-to-limit-dependence-on-china",
    "timestamp": "2025-10-21T13:17:35Z"
  },
  {
    "title": "Four Republicans Turn Against Trump Nominee After Nazi Texts Revealed",
    "description": "Paul Ingrassia—President Donald Trump’s nominee to head the Office of Special Counsel—may not be confirmed after his racist and antisemitic messages were unearthed Monday by Politico, leading some Republican senators to repudiate him.In the private text messa…",
    "link": "https://newrepublic.com/post/202052/republicans-against-trump-nominee-ingrassia-nazi-texts",
    "timestamp": "2025-10-21T13:17:26Z"
  },
  {
    "title": "Schools Find Their Spines",
    "description": "Seven universities rejected a proposal linking federal funds to academic freedom rules, citing threats to institutional independence.",
    "link": "https://reason.com/2025/10/21/schools-find-their-spines/",
    "timestamp": "2025-10-21T13:17:18Z"
  },
  {
    "title": "State Department blasts Dems over shutdown, says national security at risk amid Senate battle",
    "description": "The State Department issued a warning that the government shutdown will \"impact U.S. foreign policy.\"",
    "link": "https://www.foxnews.com/politics/state-department-blasts-dems-over-shutdown-says-national-security-risk-amid-senate-battle",
    "timestamp": "2025-10-21T13:17:02Z"
  },
  {
    "title": "What Triggers The Next Rally In Nvidia Stock?",
    "description": "Historically, Nvidia has staged multiple powerful rallies - from riding the cryptocurrency boom to capitalizing on the Covid-era gaming and remote work surge.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/21/what-triggers-the-next-rally-in-nvidia-stock/",
    "timestamp": "2025-10-21T13:15:56Z"
  },
  {
    "title": "Trump Tried to Get 'the Grim Reaper' Laid at Mar-a-Lago (Ewan Palmer/The Daily Beast)",
    "description": "Ewan Palmer / The Daily Beast:\nTrump Tried to Get ‘the Grim Reaper’ Laid at Mar-a-Lago  —  WEIRD WINGMAN  —  Trump is said to have “weirded out” aides with his obsession about arranging a hook-up for OMB Director Russell Vought.  —  Donald Trump reportedly to…",
    "link": "https://www.memeorandum.com/251021/p22",
    "timestamp": "2025-10-21T13:15:02Z"
  },
  {
    "title": "Unilever Delays Ice Cream Spinoff on US Federal Shutdown",
    "description": "The US Securities and Exchange Commission is unable to declare effective the US registration statement required for the ice-cream company’s shares to be...",
    "link": "https://finance.yahoo.com/news/unilever-delays-ice-cream-spinoff-131455370.html",
    "timestamp": "2025-10-21T13:14:55Z"
  },
  {
    "title": "Most Americans are worried they’ll pay more for health care next year, new poll finds",
    "description": "The AP-NORC poll shows about 6 in 10 Americans are “extremely” or “very” concerned about their health costs going up in the next year, a worry that extends across age groups and includes people with and without health insurance.",
    "link": "https://www.mlive.com/news/2025/10/most-americans-are-worried-theyll-pay-more-for-health-care-next-year-new-poll-finds.html",
    "timestamp": "2025-10-21T13:13:44Z"
  },
  {
    "title": "US vice president JD Vance in Israel to shore up fragile Gaza ceasefire",
    "description": "Ceasefire has teetered following a burst of deadly violence and questions over how to move forward with long-term peace plan",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/21/us-vice-president-jd-vance-in-israel-to-shore-up-fragile-gaza-ceasefire/",
    "timestamp": "2025-10-21T13:09:38Z"
  },
  {
    "title": "China has another lever to pull in showdown with Trump: Factory lines",
    "description": "In the face of ongoing trade conflicts with the United States, China's manufacturing prowess takes center stage as a strategic advantage. With factories delivering affordable products, the nation is seeing a surge in exports to international markets. This man…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-has-another-lever-to-pull-in-showdown-with-trump-factory-lines/articleshow/124722598.cms",
    "timestamp": "2025-10-21T13:07:48Z"
  },
  {
    "title": "Federal Appeals Court Overturns Lower Court Ruling – President Trump Can Deploy National Guard to Portland",
    "description": "SNIP SOURCE A three-judge panel for the 9th U.S. Circuit Court of Appeals voted 2-1 to stay a district court order that had prevented the deployment of National Guard troops to the city. The majority opinion found it was likely that the president had lawfully…",
    "link": "https://freerepublic.com/focus/f-chat/4347701/posts",
    "timestamp": "2025-10-21T13:06:01Z"
  },
  {
    "title": "Concerned carmakers race to beat China's rare earths deadline",
    "description": "By Nick Carey and Christina Amann LONDON/BERLIN (Reuters) -Global automakers are scouring the globe for crucial rare earths ahead of looming Chinese export...",
    "link": "https://finance.yahoo.com/news/concerned-carmakers-race-beat-chinas-130434342.html",
    "timestamp": "2025-10-21T13:04:34Z"
  },
  {
    "title": "Trump Fuels Feud With Colombia, Threatens Ending Subsidies",
    "description": "President Donald Trump attacked Colombia's president on social media, and threatened to eliminate subsidies to the country on Sunday.",
    "link": "https://hiphopwired.com/2877035/trump-fuels-feud-with-colombia-threatens-ending-subsidies/",
    "timestamp": "2025-10-21T13:03:17Z"
  },
  {
    "title": "Fall in China's exports of rare earth magnets stokes supply chain fears",
    "description": "BEIJING (Reuters) -China's exports of rare earth magnets fell in September, reigniting fears that the world's top supplier could wield its dominance over a...",
    "link": "https://finance.yahoo.com/news/fall-chinas-exports-rare-earth-130256164.html",
    "timestamp": "2025-10-21T13:02:56Z"
  },
  {
    "title": "The Latest: Senate Republicans gathering at White House as shutdown effects worsen",
    "description": "In this fourth week of the government shutdown, Senate Republicans are gathering at White House — not for urgent talks on how to end it, but for a display of...",
    "link": "https://www.yahoo.com/news/articles/latest-senate-republicans-gathering-white-130207230.html",
    "timestamp": "2025-10-21T13:02:07Z"
  },
  {
    "title": "‘The Apprentice’ Screenwriter Gabriel Sherman Signs With Cinetic (EXCLUSIVE)",
    "description": "Cinetic, the talent management and media advisory company known for its work with indie auteurs, has signed screenwriter and bestselling author Gabriel Sherman. Sherman, whose work often explores the intersection of politics and media, wrote the original scre…",
    "link": "https://variety.com/2025/film/news/gabriel-sherman-author-apprentice-writer-cinetic-1236557612/",
    "timestamp": "2025-10-21T13:02:00Z"
  },
  {
    "title": "White House Slams TMZ Report Claiming Donald Trump Considering Commutation of Sean “Diddy” Combs — Calls It “Completely Fraudulent”",
    "description": "The White House struck back at a fake news report from TMZ alleging that President Donald Trump was “seriously considering” commuting the prison sentence of disgraced rap mogul Sean “Diddy” Combs.\nThe post White House Slams TMZ Report Claiming Donald Trump Co…",
    "link": "https://www.thegatewaypundit.com/2025/10/white-house-slams-tmz-report-claiming-donald-trump/",
    "timestamp": "2025-10-21T13:00:49Z"
  },
  {
    "title": "Senate Republicans head to the White House in a show of unity as the shutdown enters its fourth week",
    "description": "Senate Republicans are heading to the White House for a display of unity with President Trump as they refuse to negotiate on any Democratic demands.",
    "link": "https://www.bostonherald.com/2025/10/21/government-shutdown-republicans-display-unity/",
    "timestamp": "2025-10-21T13:00:47Z"
  },
  {
    "title": "Jay Jones murder texts latest case of Democrats circling the scandal wagons",
    "description": "From Jay Jones to Larry Craig: how Democrats and Republicans respond differently to party member scandals reveals deep partisan divides in American political accountability.",
    "link": "https://www.foxnews.com/politics/jay-jones-murder-texts-latest-case-democrats-circling-scandal-wagons",
    "timestamp": "2025-10-21T13:00:25Z"
  },
  {
    "title": "FDA Stayed Silent As Internal Reports About Potential Tylenol Risks Piled Up",
    "description": "The FDA defied the advice of its own drug safety experts to warn pregnant women about Tylenol for nearly a decade, internal documents reveal.",
    "link": "https://dailycaller.com/2025/10/21/fda-stayed-silent-potential-tylenol-risks-internal-reports/",
    "timestamp": "2025-10-21T13:00:06Z"
  },
  {
    "title": "Come as You Are, Unless You’re Noticeably Black or Disabled",
    "description": "You’ve Always Been This Way is a column written by Taylor Harris, a late-diagnosed neurodivergent woman and 1980s preschool dropout, who identifies every moment from her past that filled her with shame, and mutters, “Yep, that tracks. I see it all now.” - - -…",
    "link": "https://www.mcsweeneys.net/articles/come-as-you-are-unless-youre-noticeably-black-or-disabled",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "U.S. Surging in Crypto Activity Under Trump: TRM Labs Report",
    "description": "While the growth still trails India's boom, digital assets activity jumped 50% in the U.S. in six months, cementing it further as the top global marketplace.",
    "link": "https://www.coindesk.com/policy/2025/10/20/u-s-surging-in-crypto-activity-under-trump-trm-labs-report",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "He Was a Teen Tech Prodigy. Then He Became the ‘Crypto Godfather’",
    "description": "Adam Iza built the crypto trading platform Zort. Then he fell in with hackers and started a criminal conspiracy including extortion schemes with cops.",
    "link": "http://www.rollingstone.com/culture/culture-features/crypto-godfather-adam-iza-criminal-hackers-la-cops-1235443569/",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "Democrats Still Haven’t Learned Any Lessons",
    "description": "On Thursday, Senate Democrats voted for the 10th time to prolong the federal government shutdown. They also voted against funding the military, thereby necessitating that... Read More\nThe post Democrats Still Haven’t Learned Any Lessons appeared first on The …",
    "link": "https://www.dailysignal.com/2025/10/21/democrats-still-havent-learned-any-lessons/",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "Europe’s Terminal Decline: The Philosopher Queens and Their Ruinous Rule",
    "description": "The geopolitical humiliation of Europe is already manifest. The continent once balanced the world’s powers; it is now a mere appendage of American strategy. Its energy policy is dictated by Washington’s sanctions; its foreign policy by NATO’s dictates. Even a…",
    "link": "https://wattsupwiththat.com/2025/10/21/europes-terminal-decline-the-philosopher-queens-and-their-ruinous-rule/",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "Mommy He Hit Me Back",
    "description": "Yes just to spite Trump:\n\nHow China weaponized soybeans to squeeze U.S. farmers — and spite Trump\nIt's all about pressure before a meeting. Nothing happened before that?\nFor Beijing, halting U.S. soybean imports has been an easy and relatively cost-free way t…",
    "link": "https://www.eschatonblog.com/2025/10/mommy-he-hit-me-back_01780168702.html",
    "timestamp": "2025-10-21T13:00:00Z"
  },
  {
    "title": "Anti-Trump Republican Thomas Massie gets challenger hand-picked by the president",
    "description": "'The president doesn't need obstacles in Congress – he needs backup'",
    "link": "https://www.wnd.com/2025/10/anti-trump-republican-thomas-massie-gets-challenger-hand/",
    "timestamp": "2025-10-21T12:59:10Z"
  },
  {
    "title": "GM raises outlook as strong truck demand dulls pain from tariffs",
    "description": "General Motors posted third-quarter results that topped Wall Street estimates on better-than-expected pickup truck sales. Read more.",
    "link": "https://financialpost.com/transportation/autos/gm-raises-outlook-as-strong-truck-demand-dulls-tariff-pain",
    "timestamp": "2025-10-21T12:58:52Z"
  },
  {
    "title": "Root causes of Ukraine conflict must be addressed – Lavrov",
    "description": "Moscow is seeking a lasting peace with Ukraine rather than a temporary pause in the hostilities, the top diplomat has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626768-lavrov-ukraine-lasting-peace/",
    "timestamp": "2025-10-21T12:57:27Z"
  },
  {
    "title": "After the October 10 Crypto Flash Crash, Expect A Wave of Lawsuits: Wintermute CEO",
    "description": "October 10 was no ordinary day in crypto. Yes, Donald Trump “retaliated” after China announced new plans curbing rare earth metal exports. Truth Social, X, that’s classic Trump. The president won’t hesitate to show how mighty the United States is.\nThe truth o…",
    "link": "https://biztoc.com/x/cd39009482d150b0",
    "timestamp": "2025-10-21T12:57:05Z"
  },
  {
    "title": "Demolition Begins at White House for Trump's New Ballroom",
    "description": "Construction crews have begun demolishing part of the historic East Wing facade of the White House to make room for President Donald Trump’s new $250 million ballroom. Back in July, Trump pledged that the project wouldn't \"interfere with the current building.…",
    "link": "https://biztoc.com/x/bb431604641f659a",
    "timestamp": "2025-10-21T12:56:53Z"
  },
  {
    "title": "Diddy Pardon Expected SOON … Family Flies To NY To Meet Him!",
    "description": "BREAKING: Diddy May Be Coming Home SOON — Trump Reportedly Considering Commuting His Sentence, Family Flies Into New York! It looks like Sean “Diddy” Combs might be a free man again — and very soon. Media Take Out has learned that Diddy’s legal team and famil…",
    "link": "https://mediatakeout.com/diddy-pardon-expected-soon-family-flies-to-ny-to-meet-him/",
    "timestamp": "2025-10-21T12:56:23Z"
  },
  {
    "title": "At the White House, Trump's destructive impulses take a literal turn",
    "description": "Donald Trump’s critics have accused him of making a mess at the White House. As he destroys part of the East Wing, those assessments have now become literal.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-trumps-destructive-impulses-take-literal-turn-rcna238839",
    "timestamp": "2025-10-21T12:55:41Z"
  },
  {
    "title": "Marco Rubio's Deal With El Salvador Even More Evil Than You Thought",
    "description": "The devil always wants to dance!",
    "link": "https://www.wonkette.com/p/marco-rubios-deal-with-el-salvador",
    "timestamp": "2025-10-21T12:55:04Z"
  },
  {
    "title": "'I will kill him': Pardoned Jan. 6 rioter charged in plot to murder Hakeem Jeffries",
    "description": "A Jan. 6 rioter who received a pardon from President Donald Trump is in legal trouble again — this time for allegedly threatening to assassinate House Minority Leader Hakeem Jeffries (D-NY).According to CBS News correspondent Scott MacFarlane, \"court document…",
    "link": "https://www.rawstory.com/maga-rioter-charged/",
    "timestamp": "2025-10-21T12:54:38Z"
  },
  {
    "title": "Tuesday, October 21, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/tuesday-october-21-2025/",
    "timestamp": "2025-10-21T12:53:45Z"
  },
  {
    "title": "GM raises profit guidance on lower exposure to Trump tariffs",
    "description": "US carmaker to pass on more costs to consumers through price rises",
    "link": "https://www.irishtimes.com/business/2025/10/21/gm-raises-profit-guidance-on-lower-exposure-to-trump-tariffs/",
    "timestamp": "2025-10-21T12:53:05Z"
  },
  {
    "title": "Donald Trump May Commute Diddy’s Sentence This Week",
    "description": "Reading Time: 4 minutesAccording to a White House source, Donald Trump could commute Diddy's prison sentence soon, as early as this week. Oh no!\nDonald Trump May Commute Diddy’s Sentence This Week was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/donald-trump-diddy-commutation-this-week/",
    "timestamp": "2025-10-21T12:49:49Z"
  },
  {
    "title": "Kenny Loggins shuts down Donald Trump’s use of ‘Danger Zone’ in controversial AI ‘dumping’ video: “Too many people are trying to divide us”",
    "description": "Kenny Loggins has hit out at Donald Trump for using his song ‘Danger Zone’ in a controversial video regarding US protests. The classic ‘80s song was heard playing in a video shared by the US president on his Truth Social account over the weekend. In the clip,…",
    "link": "https://freerepublic.com/focus/f-chat/4347700/posts",
    "timestamp": "2025-10-21T12:49:26Z"
  },
  {
    "title": "Pardoned Jan. 6 rioter accused of threatening US Democratic leader Jeffries",
    "description": "WASHINGTON (Reuters) -A Jan. 6 rioter pardoned by U.S. President Donald Trump has been charged with threatening to kill House of Representatives Democratic leader Hakeem Jeffries, according to a court document. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/pardoned-jan-6-rioter-accused-of-threatening-us-democratic-leader-jeffries",
    "timestamp": "2025-10-21T12:49:00Z"
  },
  {
    "title": "When it comes to Ukraine peace negotiations, it’s all over the map",
    "description": "Donald Trump is reportedly ‘sick’ of being presented with maps of Ukraine’s battlefronts. The problem may be he and Ukraine’s Volodymyr Zelenskyy are looking at different things.",
    "link": "https://theconversation.com/when-it-comes-to-ukraine-peace-negotiations-its-all-over-the-map-265798",
    "timestamp": "2025-10-21T12:47:19Z"
  },
  {
    "title": "Trump proposes monumental ‘Arc de Trump’ in Washington D.C.",
    "description": "U.S. President Donald Trump has unveiled plans for a monumental gateway arch in the nation’s capital, a project already informally dubbed the “Arc de Trump.” Presented Wednesday evening during a fundraising dinner at the White House, the proposed structure is…",
    "link": "https://archinect.com/news/article/150505333/trump-proposes-monumental-arc-de-trump-in-washington-d-c",
    "timestamp": "2025-10-21T12:47:00Z"
  },
  {
    "title": "White House remodeling begins with Trump’s demolition in the East Wing",
    "description": "The White House on Monday started tearing down part of the East Wing, the traditional base of operations for the first lady, to build President Donald Trump’s $250 million ballroom despite lacking approval for construction from the federal agency that oversee…",
    "link": "https://newsroom.ap.org/detail/TheWhiteHousestartsdemolishingpartoftheEastWingtobuildTrumpsballroom/a3efb2973d4d4e45f98b02e55210c538/text",
    "timestamp": "2025-10-21T12:46:18Z"
  },
  {
    "title": "Yen falls to one-week low after Takaichi elected as Japan PM, dollar firms",
    "description": "NEW YORK/LONDON :The yen eased to a one-week low on Tuesday after hardline conservative Sanae Takaichi was elected as Japan's prime minister, with traders betting her government could muddy the interest rate outlook and bring about a greater fiscal largesse.T…",
    "link": "https://www.channelnewsasia.com/business/yen-falls-one-week-low-after-takaichi-elected-japan-pm-dollar-firms-5414211",
    "timestamp": "2025-10-21T12:46:03Z"
  },
  {
    "title": "Yen falls to one-week low after Takaichi elected as Japan's PM, dollar firms",
    "description": "LONDON : The yen eased to a one-week low after hardline conservative Sanae Takaichi was elected as Japan's prime minister, with traders betting her government could muddy the interest rate outlook and bring about a greater fiscal largesse.Takaichi, first fema…",
    "link": "https://www.channelnewsasia.com/business/yen-falls-one-week-low-after-takaichi-elected-japans-pm-dollar-firms-5414211",
    "timestamp": "2025-10-21T12:46:03Z"
  },
  {
    "title": "Yen drops after Takaichi elected as Japan PM, dollar firms",
    "description": "NEW YORK :The yen eased to a one-week low on Tuesday after hardline conservative Sanae Takaichi was elected as Japan's prime minister, with traders betting her government could muddy the interest rate outlook and bring about a greater fiscal largesse.Takaichi…",
    "link": "https://www.channelnewsasia.com/business/yen-drops-after-takaichi-elected-japan-pm-dollar-firms-5414211",
    "timestamp": "2025-10-21T12:46:03Z"
  },
  {
    "title": "Anti-Fascists In Cutesy Animal Costumes Are Warm And Cuddly, According To NYT, WaPo",
    "description": "By Tim Graham via The Daily Signal | October 17, 2025\nThe “fact-checkers” who pick apart President Donald Trump on a daily basis took exception to this recent presidential overstatement: “Portland [Oregon] is burning to the ground, it’s insurrectionists all o…",
    "link": "https://biztoc.com/x/0dd491933a4387f4",
    "timestamp": "2025-10-21T12:45:39Z"
  },
  {
    "title": "Donald Trump ripped out the White House’s East Wing to make room for his ballroom",
    "description": "This year has been full of so many castrophically evil stories, almost all of which are happening because of Donald Trump and his fascist minions. It feels weird to complain about issues which are somewhat superficial, but I still find this stuff extremely de…",
    "link": "https://www.celebitchy.com/946210/donald_trump_ripped_out_the_white_houses_east_wing_to_make_room_for_his_ballroom/",
    "timestamp": "2025-10-21T12:40:14Z"
  },
  {
    "title": "\"Retribution,\" by Jonathan Karl: Hunter Biden was furious at Obama (Mike Allen/Axios)",
    "description": "Mike Allen / Axios:\n“Retribution,” by Jonathan Karl: Hunter Biden was furious at Obama  —  ABC News' Jonathan Karl reports in “Retribution: Donald Trump and the Campaign That Changed America,” out next Tuesday, that Hunter Biden was furious with former Presid…",
    "link": "https://www.memeorandum.com/251021/p18",
    "timestamp": "2025-10-21T12:40:01Z"
  },
  {
    "title": "Thomas Massie Gets Challenger Hand-Picked By President Trump",
    "description": "Republican Kentucky Rep. Thomas Massie will face a serious primary challenge from a Trump-endorsed opponent during the midterms. Former Navy SEAL and fifth-generation Kentucky farmer Ed Gallrein declared his candidacy to unseat Massie on Tuesday morning with …",
    "link": "https://dailycaller.com/2025/10/21/thomas-massie-primary-challenge-donald-trump/",
    "timestamp": "2025-10-21T12:38:03Z"
  },
  {
    "title": "Gender is not an ideology – but conservative groups know learning about it empowers people to think for themselves",
    "description": "From book bans and firing teachers to taking over university administrations altogether, right-wing politicians and activists worldwide have been keen on rooting out gender from schools. Why is that?",
    "link": "https://theconversation.com/gender-is-not-an-ideology-but-conservative-groups-know-learning-about-it-empowers-people-to-think-for-themselves-265549",
    "timestamp": "2025-10-21T12:37:07Z"
  },
  {
    "title": "Trump urges Virginians to vote for Earle-Sears",
    "description": "President Donald Trump, speaking with reporters on Air Force One, did not mention Lt. Gov. Winsome Earle-Sears by name, but said \"the Republican candidate is very good\" and should win.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_6d270d61-a2c0-420c-a478-1104cf73211c.html",
    "timestamp": "2025-10-21T12:37:00Z"
  },
  {
    "title": "Trump had another fiery meeting with Zelensky on Friday where he shouted at him all the time - here are the details",
    "description": "Ukrainian President Volodymyr Zelensky indicated willingness to join Donald Trump and Vladimir Putin for trilateral discussions in Hungary if summoned. The news followed an intense in White House meeting where Trump cautioned that Putin would “destroy” Ukrain…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-had-another-fiery-meeting-with-zelensky-on-friday-where-he-shouted-at-him-all-the-time-here-are-the-details/articleshow/124721734.cms",
    "timestamp": "2025-10-21T12:36:30Z"
  },
  {
    "title": "Novo Nordisk fights to keep Medicaid paying for weight-loss drugs",
    "description": "(Reuters) -Novo Nordisk, which lobbied to win Medicaid reimbursement for its obesity drug Wegovy, is fighting to keep that coverage as some U. states...",
    "link": "https://finance.yahoo.com/news/novo-nordisk-fights-keep-medicaid-123548051.html",
    "timestamp": "2025-10-21T12:35:48Z"
  },
  {
    "title": "Trump’s words aren’t stopping China, Brazil and many other countries from setting higher climate goals, but progress is slow",
    "description": "A review of countries’ new climate pledges shows who is leading efforts to protect the climate their economies were built on and who is sliding.",
    "link": "https://theconversation.com/trumps-words-arent-stopping-china-brazil-and-many-other-countries-from-setting-higher-climate-goals-but-progress-is-slow-267194",
    "timestamp": "2025-10-21T12:35:09Z"
  },
  {
    "title": "Trump Considering Commuting Sentence This Week",
    "description": "Donald Trump is considering commuting Diddy's sentence as early as this week, according to a high-ranking White House official.According to our source, the President is \"vacillating\" on a commutation. We're told some of the W.H. staff are urging Trump not to …",
    "link": "https://freerepublic.com/focus/f-chat/4347695/posts",
    "timestamp": "2025-10-21T12:32:02Z"
  },
  {
    "title": "Trump Considering Commuting Sentence This Week",
    "description": "Donald Trump is considering commuting Diddy's sentence as early as this week, according to a high-ranking White House official.According to our source, the President is \"vacillating\" on a commutation. We're told some of the W.H. staff are urging Trump not to …",
    "link": "https://freerepublic.com/focus/f-news/4347695/posts",
    "timestamp": "2025-10-21T12:32:02Z"
  },
  {
    "title": "White House Siding Demolished to Build Donald Trump's Ballroom: Photos",
    "description": "A bulldozer demolished the facade of the East Wing of the White House on Monday (October 20). You see, Donald Trump wants to build a ballroom and this requires construction to take place on the historic Washington, DC building. Trump posted on Truth Social, “…",
    "link": "https://www.justjared.com/2025/10/21/white-house-siding-demolished-to-build-donald-trumps-ballroom-photos/",
    "timestamp": "2025-10-21T12:31:27Z"
  },
  {
    "title": "Push for swift UN resolution on Gaza peace mission",
    "description": "Cairo has expressed the urgent need for an U.N. Security Council resolution to authorize the deployment of an international peacekeeping force in Gaza, as progress on the U.S.-backed peace plan continues to face mounting hurdles and slowdowns.",
    "link": "https://www.hurriyetdailynews.com/push-for-swift-un-resolution-on-gaza-peace-mission-214880",
    "timestamp": "2025-10-21T12:30:26Z"
  },
  {
    "title": "Texas Farming",
    "description": "I honestly have no idea how I got signed up for Texas Monthly, but this was a pretty interesting read: As we broiled beneath a relentless sun in the Chihuahuan Desert, next to countless rows of improbably green cotton plants, I expected Ramon Tirres to tell m…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/texas-farming",
    "timestamp": "2025-10-21T12:30:00Z"
  },
  {
    "title": "‘Sold Us Out’: Farmers Outraged At Trump’s Argentina Beef Deal",
    "description": "Cattle farmers and agricultural groups are voicing opposition to President Donald Trump’s plan to import Argentine beef in an effort to address record-high prices.\nTrump said he was exploring the option on Sunday while aboard Air Force One, defending it as a …",
    "link": "https://biztoc.com/x/b8081f361693f0fb",
    "timestamp": "2025-10-21T12:23:41Z"
  },
  {
    "title": "Socialized UK Health Service Determined Southport Killer Was Not Dangerous Days Before Stabbing Spree.",
    "description": "PULSE POINTS WHAT HAPPENED: An official inquiry into the stabbing spree targeting young girls in Southport, England, by Axel Rudakubana has found that he",
    "link": "https://thenationalpulse.com/2025/10/21/socialized-uk-health-service-determined-southport-killer-was-not-dangerous-days-before-stabbing-spree/",
    "timestamp": "2025-10-21T12:23:15Z"
  },
  {
    "title": "Trump Pick Paul Ingrassia Faces Republican Backlash Over Offensive Messages",
    "description": "President Donald Trump’s nominee to lead the Office of Special Counsel, Paul Ingrassia, is facing mounting Republican opposition following the release of racist and offensive text messages attributed to him, Politico reported.\nSenators Rick Scott (R-Fla.) and…",
    "link": "https://biztoc.com/x/41c8e8da881dce55",
    "timestamp": "2025-10-21T12:23:10Z"
  },
  {
    "title": "And it’s been the ruin of many a poor boy",
    "description": "Here’s a very interesting essay (gift link) on how three forms of gambling — sports, prediction markets, and financial markets — are merging on the smart phones of, in particular, young men. What’s happening here is that open political corruption, in the form…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/and-its-been-the-ruin-of-many-a-poor-boy",
    "timestamp": "2025-10-21T12:20:59Z"
  },
  {
    "title": "Coca-Cola earnings grow, but consumer demand remains tepid",
    "description": "The world's largest soda maker saw flat sales volumes in North and Latin America and a decline in Asia Pacific in the third quarter",
    "link": "https://qz.com/coca-colas-growth-is-coming-from-prices-not-people-drinking-more-soda",
    "timestamp": "2025-10-21T12:20:43Z"
  },
  {
    "title": "Trump, Albanese Build A Link In The Rare Earth Minerals Chain",
    "description": "The deal to invest in a variety of rare earth minerals projects boosts President Donald Trumps leverage in upcoming negotations with Xi Jinping.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/10/21/trump-albanese-build-a-link-in-the-rare-earth-minerals-chain/",
    "timestamp": "2025-10-21T12:20:17Z"
  },
  {
    "title": "House Republicans preparing report on Biden’s use of autopen after months of investigation",
    "description": "The report centers on contested and thus far unsubstantiated claims that Biden declined to a degree that allowed White House officials to enact policies without his knowledge.",
    "link": "https://www.bostonherald.com/2025/10/21/house-oversight-biden-autopen-investigation/",
    "timestamp": "2025-10-21T12:19:39Z"
  },
  {
    "title": "Japan: New PM Sanae Takaichi faces economic, security tests",
    "description": "Japan's first female prime minister has formed a coalition and is setting out a policy agenda that includes economic reform, wage growth, and national security priorities.",
    "link": "https://www.dw.com/en/japan-new-pm-sanae-takaichi-faces-economic-security-tests/a-74438590",
    "timestamp": "2025-10-21T12:15:00Z"
  },
  {
    "title": "General Motors lifts forecast as tariff outlook improves, shares surge 10%",
    "description": "(Reuters) -General Motors lifted its financial outlook for the year and slightly lowered its expected hit from tariffs, as the automaker awaits expected...",
    "link": "https://finance.yahoo.com/news/general-motors-lifts-forecast-tariff-121411562.html",
    "timestamp": "2025-10-21T12:14:11Z"
  },
  {
    "title": "\"We Are Under Attack\": Rep. Delia Ramirez on Immigration Crackdown in Chicago, Gov't Shutdown & More",
    "description": "“We are under attack by our own federal government,” says Democratic Congressmember for Illinois Delia Ramirez about Trump’s immigration crackdown in Chicago. “What we’re seeing is an agency that has gone rogue, that has been emboldened and that thinks that t…",
    "link": "https://www.democracynow.org/2025/10/21/rep_delia_ramirez",
    "timestamp": "2025-10-21T12:14:08Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Planned 'Extreme' Fake Separation From Cheryl Hines After 'Sexting' Scandal Left their Marriage on Brink of Collapse",
    "description": "Robert F. Kennedy Jr. plotted 'fake separation' from Cheryl Hines to take the 'heat off her' during his 2024 election campaign, overshadowed by sexting scandal.",
    "link": "https://radaronline.com/p/robert-f-kennedy-jr-planned-fake-separation-from-cheryl-hines-amid-sexting-scandal/",
    "timestamp": "2025-10-21T12:13:14Z"
  },
  {
    "title": "Bernie Sanders On Daily Show: Trump Is Right, The System Is Broken",
    "description": "On The Daily Show last night, Bernie Sanders was urging Democrats to acknowledge the same truths that Trump has become adept at exploiting. Via the Independent:\n“Donald Trump, he may be crazy, he may be a pathological liar, but he’s not stupid,” Sanders said.…",
    "link": "https://crooksandliars.com/2025/10/bernie-sanders-daily-show-trump-right",
    "timestamp": "2025-10-21T12:13:00Z"
  },
  {
    "title": "What to know about Trump’s plan to build $250m White House ballroom",
    "description": "It's the first major structural change to the mansion since extensive renovations under President Truman in 1948.",
    "link": "https://www.aljazeera.com/news/2025/10/21/what-to-know-about-trumps-plan-to-build-250m-white-house-ballroom",
    "timestamp": "2025-10-21T12:12:12Z"
  },
  {
    "title": "RTX raises 2025 forecast as strong demand offsets tariff worries",
    "description": "(Reuters) -Aerospace and defense giant RTX raised its full-year profit and revenue forecast on Tuesday, as rising demand for its missiles and aftermarket...",
    "link": "https://finance.yahoo.com/news/rtx-raises-2025-forecast-strong-121129696.html",
    "timestamp": "2025-10-21T12:11:29Z"
  },
  {
    "title": "Liberals, Greens, NDP say Poilievre should apologize over RCMP comments",
    "description": "Conservative Leader Pierre Poilievre returned to the House of Commons on Monday afternoon to a chorus of calls from across the aisle for him to apologize over comments he made last week about the RCMP.",
    "link": "https://www.nationalobserver.com/2025/10/21/news/liberals-greens-ndp-say-poilievre-should-apologize-over-rcmp-comments",
    "timestamp": "2025-10-21T12:11:26Z"
  },
  {
    "title": "Pro-Ukraine activist sentenced to 21 years for attempted murder of Slovak PM",
    "description": "A Slovak court has sentenced the man who shot Prime Minister Robert Fico last year to 21 years in prison on terrorism charges Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626757-fico-shooter-sentenced-terrorism/",
    "timestamp": "2025-10-21T12:08:55Z"
  },
  {
    "title": "Posthaste: Gap between Canada and the United States economies is widening — and Trump’s not only to blame",
    "description": "Moody's Analytics charted the path of the two economies and discovered a growing gap that it predicts will only get wider. Read more",
    "link": "https://financialpost.com/news/gap-between-canada-united-states-economies-widening",
    "timestamp": "2025-10-21T12:06:52Z"
  },
  {
    "title": "A rickety dictatorship — Trump's hand of cards is weaker than it appears. (David R. Lurie/Public Notice)",
    "description": "David R. Lurie / Public Notice:\nA rickety dictatorship  —  Trump's hand of cards is weaker than it appears.  —  Public Notice is supported by paid subscribers.  Become one ⬇️  —  ✊ Subscribe to PN ✊  —  Donald Trump is vying to become a dictator just as the c…",
    "link": "https://www.memeorandum.com/251021/p13",
    "timestamp": "2025-10-21T12:05:00Z"
  },
  {
    "title": "Donald Trump Has Lost Touch With Reality (Paul Krugman)",
    "description": "Paul Krugman:\nDonald Trump Has Lost Touch With Reality  —  And it's getting worse.  When will we acknowledge the obvious?  —  The other day I learned a new term: “AI sycophancy,” also sometimes called “chatbot sycophancy.”  —  I already knew about the phenome…",
    "link": "https://www.memeorandum.com/251021/p12",
    "timestamp": "2025-10-21T12:05:00Z"
  },
  {
    "title": "Trump is going to Asia — what happens next is anyone’s guess",
    "description": "President Trump is preparing for a significant trip to Asia, aiming to address international trade tensions.",
    "link": "https://www.bostonherald.com/2025/10/21/trump-asia-trip-trade-tensions/",
    "timestamp": "2025-10-21T12:02:02Z"
  },
  {
    "title": "Trump's Operation Warp Speed sparks GOP call for Nobel Peace Prize after ceasefire snub",
    "description": "Sen. Bill Cassidy, R-La., and Senate Majority Whip John Barrasso, R-Wyo., plan to nominate President Donald Trump for the Nobel Peace Prize for launching Operation Warp Speed.",
    "link": "https://www.foxnews.com/politics/trumps-operation-warp-speed-sparks-gop-call-nobel-peace-prize-after-ceasefire-snub",
    "timestamp": "2025-10-21T12:00:51Z"
  },
  {
    "title": "Violent symbolism, threats steal show at nationwide 'No Kings' protests",
    "description": "Viral videos from 'No Kings' protests show people making threats against Charlie Kirk and President Donald Trump, prompting investigations by authorities.",
    "link": "https://www.foxnews.com/us/violent-symbolism-threats-steal-show-nationwide-no-kings-protests",
    "timestamp": "2025-10-21T12:00:48Z"
  },
  {
    "title": "The Risk of a New Ethiopian-Eritrean War Is Growing",
    "description": "Changing dynamics in Tigray could erode the current balance of uncertainty.",
    "link": "http://foreignpolicy.com/2025/10/21/ethiopia-eritrea-tigray-horn-east-africa/",
    "timestamp": "2025-10-21T12:00:26Z"
  },
  {
    "title": "Most Americans are concerned about higher health care costs next year, an AP-NORC poll finds",
    "description": "Most Americans are concerned about higher health care costs next year, an AP-NORC poll findsclickondetroit.com",
    "link": "https://www.clickondetroit.com/business/2025/10/21/most-americans-are-concerned-about-higher-health-care-costs-next-year-an-ap-norc-poll-finds/",
    "timestamp": "2025-10-21T12:00:23Z"
  },
  {
    "title": "Mark Wahlberg joins President Trump, Sylvester Stallone, Sydney Sweeney with $37M Florida mansion purchase",
    "description": "Mark Wahlberg became the latest Hollywood celebrity to relocate to Florida, buying a $37 million mansion in the exclusive Palm Beach area.",
    "link": "https://www.foxnews.com/entertainment/mark-wahlberg-joins-president-trump-sylvester-stallone-sydney-sweeney-37m-florida-mansion-purchase",
    "timestamp": "2025-10-21T12:00:14Z"
  },
  {
    "title": "Day 1,336 of WW3. In pursuit of peace, the Kremlin rejects Stinky's plan for freezing the war at the current line of contact. Legislation to ban russian oil and gas imports goes to EU's Parliament. This is your Tuesday Ukraine War thread [News]",
    "description": "Day 1,336 of WW3. In pursuit of peace, the Kremlin rejects Stinky's plan for freezing the war at the current line of contact. Legislation to ban russian oil and gas imports goes to EU's Parliament. This is your Tuesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13851770/Day-1336-of-WW3-In-pursuit-of-peace-Kremlin-rejects-Stinkys-plan-for-freezing-war-at-current-line-of-contact-Legislation-to-ban-russian-oil-gas-imports-goes-to-EUs-Parliament-This-is-your-Tuesday-Ukraine-War-thread",
    "timestamp": "2025-10-21T12:00:00Z"
  },
  {
    "title": "The ‘Smart’ People Can’t Accept Trump Isn’t Stalin or Hamas",
    "description": "Liberals always present themselves as smarter than conservatives. But even their attempts to “own” the conservatives can mangle the facts. On CNN‘s “NewsNight,” 22-year-old MeidasTouch... Read More\nThe post The ‘Smart’ People Can’t Accept Trump Isn’t Stalin o…",
    "link": "https://www.dailysignal.com/2025/10/21/smart-people-cant-accept-trump-isnt-stalin-or-hamas/",
    "timestamp": "2025-10-21T12:00:00Z"
  },
  {
    "title": "Demolition Begins at White House for Trump's New Ballroom",
    "description": "Construction crews have begun demolishing part of the historic East Wing facade of the White House to make room for President Donald Trump’s new $250 million ballroom. Back in July, Trump pledged that the project wouldn't \"interfere with the current building.…",
    "link": "https://www.today.com/video/crews-begin-tearing-down-wh-east-wing-for-trump-ballroom-250289221952",
    "timestamp": "2025-10-21T12:00:00Z"
  },
  {
    "title": "Hunter Biden Was Furious with Obama",
    "description": "“ABC News' Jonathan Karl reports in Retribution: Donald Trump and the Campaign That Changed America, out next Tuesday, that Hunter Biden was furious with former President Obama for taking President Biden's hand to lead him",
    "link": "https://politicalwire.com/2025/10/21/1886898/",
    "timestamp": "2025-10-21T12:00:00Z"
  },
  {
    "title": "California’s Bigger Tax Credits Reel In ‘Jumanji,’ Warner Films",
    "description": "The doubling of California’s film and TV tax credits to $750 million a year is showing promise in bringing production back to the state.",
    "link": "https://financialpost.com/pmn/business-pmn/californias-bigger-tax-credits-reel-in-jumanji-warner-films",
    "timestamp": "2025-10-21T11:58:09Z"
  }
]