[
  {
    "title": "Ties with Europe on the rocks, but Trump wants 'a big piece of ice'",
    "description": "US President Trump demanded that Europe cede control of Greenland, citing national security and missile defence requirements. He warned of consequences if NATO countries refused, describing the request as a modest one in exchange for decades of US defence sup…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ties-with-europe-on-the-rocks-but-trump-wants-a-big-piece-of-ice/articleshow/127036606.cms",
    "timestamp": "2026-01-21T22:52:00Z"
  },
  {
    "title": "Another GOP congressional map ordered to be redrawn — to favor Dems",
    "description": "Democrats may have just gotten a surprise victory in the redistricting wars — this time in New York.On Wednesday, New York County Supreme Court Justice Jeffrey Pearlman ordered the state's redistricting commission to redraw the 11th Congressional District, a …",
    "link": "https://www.rawstory.com/new-york-2674954668/",
    "timestamp": "2026-01-21T22:51:26Z"
  },
  {
    "title": "Johnson Defends Trump’s Bonkers Nobel Prize Letter: He’s the ‘Most Deserving Individual’",
    "description": "“Eight to ten wars and conflicts have been resolved by President Trump, and he got snubbed, so…” Johnson added.\nThe post Johnson Defends Trump’s Bonkers Nobel Prize Letter: He’s the ‘Most Deserving Individual’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/johnson-defends-trumps-bonkers-nobel-prize-letter-hes-the-most-deserving-individual/",
    "timestamp": "2026-01-21T22:51:24Z"
  },
  {
    "title": "Breitbart Business Digest: Lisa Cook’s Supreme Court Case Shines Spotlight on the Senate’s Forgotten Fed Veto",
    "description": "The constitutional answer in the Trump v. Cook case isn't an expansive judicial review of the president's removal decisions. It's trusting the Senate to do the job the framers assigned it.\nThe post Breitbart Business Digest: Lisa Cook’s Supreme Court Case Shi…",
    "link": "https://www.breitbart.com/economy/2026/01/21/breitbart-business-digest-lisa-cooks-supreme-court-case-shines-spotlight-on-the-senates-forgotten-fed-veto/",
    "timestamp": "2026-01-21T22:48:36Z"
  },
  {
    "title": "Trump Questions If Marriage to Wife Melania 'Will Work' Out During Resurfaced Interview Following Their Engagement",
    "description": "A recently resurfaced clip from her show revisited the time in 2004 when Donald introduced Melania to his soon-to-be nemesis, Ellen.",
    "link": "https://radaronline.com/p/donald-trump-marriage-wife-melania-resurfaced-interview-engagement/",
    "timestamp": "2026-01-21T22:48:29Z"
  },
  {
    "title": "A timeline of the US semiconductor market in 2025 | TechCrunch",
    "description": "From leadership changes at legacy semiconductor companies to wishy washy policy around chip exports, a lot has happened already.",
    "link": "https://techcrunch.com/2026/01/21/a-timeline-of-the-u-s-semiconductor-market-in-2025/",
    "timestamp": "2026-01-21T22:48:14Z"
  },
  {
    "title": "Bruce Lee play and Vocal Arts DC join growing list of Kennedy Center cancellations",
    "description": "The producers of a Bruce Lee-inspired stage play and Vocal Arts DC have canceled shows at the Kennedy Center",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bruce-lee-play-vocal-arts-dc-join-growing-129435636",
    "timestamp": "2026-01-21T22:45:28Z"
  },
  {
    "title": "The Most Startling Line From Trump's Davos Speech (Philip Elliott/Time)",
    "description": "Philip Elliott / Time:\nThe Most Startling Line From Trump's Davos Speech  —  President Donald Trump assured nervous European allies on Wednesday he “won't use force” to take Greenland while adding a not-so-subtle threat that the world's largest island will ev…",
    "link": "https://www.memeorandum.com/260121/p129",
    "timestamp": "2026-01-21T22:45:01Z"
  },
  {
    "title": "Only Messing with the Fed Can Make Chief Justice John Roberts This Grumpy.",
    "description": "Unfortunately, Brett Kavanaugh’s newfound gift of foresight Is limited to the Fed.",
    "link": "https://slate.com/podcasts/amicus/2026/01/trumps-not-getting-the-keys-to-the-fed-from-scotus",
    "timestamp": "2026-01-21T22:45:00Z"
  },
  {
    "title": "Preview: Fed Up",
    "description": "In this member-exclusive episode, co-hosts Dahlia Lithwick and Mark Joseph Stern discuss the Supreme Court’s fact-free foray into Trump v. Cook, a case that economists warn could crater the economy. President Donald Trump spent the first weeks of his second s…",
    "link": "https://shows.acast.com/amicus-with-dahlia-lithwick-law-justice-and-the-courts/episodes/697151c5d00eff242df2382f",
    "timestamp": "2026-01-21T22:42:51Z"
  },
  {
    "title": "Stocks stage dramatic rebound after Trump announces Greenland framework",
    "description": "\"The signal from Donald Trump coming out of Davos is coordination, not confrontation, and that matters,\" an analyst says of the market rally.",
    "link": "https://www.channelnewsasia.com/world/stocks-stage-dramatic-rebound-after-trump-announces-greenland-framework-5875026",
    "timestamp": "2026-01-21T22:42:00Z"
  },
  {
    "title": "Sex Pistols’ Glen Matlock Calls Trump-Supporting Punks “Weird,” Commends Kneecap’s Activism",
    "description": "The bassist's remarks stand in sharp contrast to those of former bandmate John Lydon.\nSex Pistols’ Glen Matlock Calls Trump-Supporting Punks “Weird,” Commends Kneecap’s Activism\nHeavy Consequence Staff",
    "link": "https://consequence.net/2026/01/glen-matlock-trump-supporting-punks-weird/",
    "timestamp": "2026-01-21T22:41:02Z"
  },
  {
    "title": "Canada’s prime minister just declared the end of the world as we know it",
    "description": "This story appeared in Today, Explained, a daily newsletter that helps you understand the most compelling news and stories of the day. Subscribe here. Canada’s prime minister delivered a blistering and remarkable speech at the World Economic Forum this week, …",
    "link": "https://www.vox.com/today-explained-newsletter/475992/canada-mark-carney-davos-speech",
    "timestamp": "2026-01-21T22:40:47Z"
  },
  {
    "title": "Trump To Convert Entire City Of Minneapolis Into Insane Asylum",
    "description": "WASHINGTON, D.C. — As part of the executive order to bring back mental institutions, President Trump announced this morning that he would begin by converting the entire city of Minneapolis into an insane asylum. The new executive order aims to stem violence f…",
    "link": "https://freerepublic.com/focus/f-chat/4363322/posts",
    "timestamp": "2026-01-21T22:38:31Z"
  },
  {
    "title": "Barron Trump reportedly saved woman's life after witnessing violent assault on FaceTime call",
    "description": "Barron Trump allegedly helped save a woman's life by calling UK police after witnessing her brutal assault during a FaceTime call, London court hears.",
    "link": "https://www.foxnews.com/politics/barron-trump-reportedly-saved-womans-life-witnessing-violent-assault-facetime-call",
    "timestamp": "2026-01-21T22:38:17Z"
  },
  {
    "title": "Trump Tells Davos ‘Sometimes You Need a Dictator’ — But Says He Isn’t One",
    "description": "President Donald Trump riffed in Davos that \"sometimes you need a dictator\" — but not to worry, because he has no plans on being one.\nThe post Trump Tells Davos ‘Sometimes You Need a Dictator’ — But Says He Isn’t One first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-tells-davos-sometimes-you-need-a-dictator-but-says-he-isnt-one/",
    "timestamp": "2026-01-21T22:37:12Z"
  },
  {
    "title": "16 Years After Citizens United, Critics Say Trump Exemplifies Dangers of Corporate Political Spending",
    "description": "The consumer watchdog group Public Citizen on Wednesday highlighted how President Donald Trump not only has taken advantage of the \"torrent of corporate spending\" unleashed by the US Supreme Court's Citizens United ruling 16 years ago, but also is now working…",
    "link": "https://www.commondreams.org/news/citizens-united-16-years-trump",
    "timestamp": "2026-01-21T22:37:07Z"
  },
  {
    "title": "Mark Carney’s Davos speech marks a major departure from Canada’s usual approach to the U.S.",
    "description": "Mark Carney clearly hopes a new global world order may emerge that’s not only more resilient to diverse and unpredictable threats, but is more honest and just.",
    "link": "https://theconversation.com/mark-carneys-davos-speech-marks-a-major-departure-from-canadas-usual-approach-to-the-u-s-274090",
    "timestamp": "2026-01-21T22:37:03Z"
  },
  {
    "title": "Trump claims 'deal' on Greenland - with European leaders to meet after shock U-turn",
    "description": "Donald Trump has said everyone is \"very happy\" after claiming to have struck a deal over the future of Greenland and scrapping a threat to impose tariffs on European allies.",
    "link": "https://news.sky.com/story/trump-claims-deal-on-greenland-with-european-leaders-to-meet-after-shock-u-turn-13497382",
    "timestamp": "2026-01-21T22:37:00Z"
  },
  {
    "title": "Trump, 79, Struggles on Air Force One Stairs After Landing in Switzerland Fueling Fresh Health and Dementia Fears - NewsBreak",
    "description": "Trump, 79, Struggles on Air Force One Stairs After Landing in Switzerland Fueling Fresh Health and Dementia Fears - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4453230223823-trump-79-struggles-on-air-force-one-stairs-after-landing-in-switzerland-fueling-fresh-health-and-dementia-fears?_f=app_share&amp;pd=08mKzGOp&amp;lang=en_US&amp;send_time=1769034841&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-21T22:36:16Z"
  },
  {
    "title": "ICE reels in the worst of the worst with 'Operation Catch of the Day' in Maine",
    "description": "ICE launched \"Operation Catch of the Day\" in Maine, arresting over 50 people with 1,400 targets identified under Trump's immigration enforcement crackdown.",
    "link": "https://www.foxnews.com/us/ice-reels-worst-worst-operation-catch-day-maine",
    "timestamp": "2026-01-21T22:35:45Z"
  },
  {
    "title": "The U.S. Is Poised To Lose Its Measles Elimination Status. Even The Trump Admin Seems To Know That’s A Problem.",
    "description": "Curbing transmission of the deadly disease will be particularly challenging with vaccine skeptics in charge of public health, experts say.",
    "link": "https://www.huffpost.com/entry/us-lose-measles-elimination-status_n_69713eb7e4b0dfed7798240c",
    "timestamp": "2026-01-21T22:33:34Z"
  },
  {
    "title": "Trump can learn a lot from this forgotten president as he sizes up Greenland",
    "description": "Like Trump, James K. Polk was a cold-eyed American expansionist — but even he compromised with allies to add to US territory.",
    "link": "https://nypost.com/2026/01/21/opinion/trump-can-learn-a-lot-from-this-forgotten-president-as-he-sizes-up-greenland/",
    "timestamp": "2026-01-21T22:33:29Z"
  },
  {
    "title": "Gov. Gavin Newsom denied entry to a fireside chat at Davos",
    "description": "California Gov. Gavin Newsom was denied entry to an event at Davos, according to posts he made on social media.",
    "link": "https://www.businessinsider.com/gov-gavin-newsom-denied-entry-fireside-chat-davos-social-media-2026-1",
    "timestamp": "2026-01-21T22:33:05Z"
  },
  {
    "title": "America Needs Greenland. No—Iceland. Actually, Never Mind!",
    "description": "This is definitely all going to plan.",
    "link": "https://www.theatlantic.com/newsletters/2026/01/trump-greenland-iceland-plan-confusion/685701/",
    "timestamp": "2026-01-21T22:32:00Z"
  },
  {
    "title": "Gen Z conservatives reveal hopes — and frustrations — for future of Republican party: ‘There was a cultural shift in 2024, but the fight isn’t over’",
    "description": "The Post spoke to six young people on the Right about what they believe, where they turn to for news and how they really feel about the Trump presidency.",
    "link": "https://nypost.com/2026/01/21/us-news/gen-z-republicans-reveal-hopes-for-partys-future/",
    "timestamp": "2026-01-21T22:30:53Z"
  },
  {
    "title": "Trump Shill Scott Jennings Roasted By Fellow CNN Panelist",
    "description": "On Tuesday (Jan. 20), a panel discussion on CNN’s Newsnight program turned into a humiliating moment for Scott Jennings, who is an avid supporter of President Donald Trump. Host John Berman had posed the question about whether the Department of Justice would …",
    "link": "https://hiphopwired.com/3010823/scott-jennings-roasted-by-fellow-cnn-panelist/",
    "timestamp": "2026-01-21T22:28:14Z"
  },
  {
    "title": "House panel advances contempt measures against Clintons in Epstein probe | Honolulu Star-Advertiser",
    "description": "U.S. House of Representatives panel today recommended former President Bill Clinton and former Secretary of State Hillary Clinton be found in contempt of Congress for refusing to testify about ties to the late sex offender Jeffrey Epstein, which could lead to…",
    "link": "https://www.staradvertiser.com/2026/01/21/breaking-news/house-panel-advances-contempt-measures-against-clintons-in-epstein-probe/",
    "timestamp": "2026-01-21T22:26:25Z"
  },
  {
    "title": "JPMorgan’s Dimon calls credit card interest rate caps a ‘economic disaster’",
    "description": "JPMorgan CEO Dimon said that Trump's push to cap rates at 10 percent would result in consumers losing access to credit.",
    "link": "https://www.aljazeera.com/economy/2026/1/21/jpmorgans-dimon-calls-credit-card-interest-rate-caps-a-economic-disaster",
    "timestamp": "2026-01-21T22:26:16Z"
  },
  {
    "title": "Trump admin to stop enforcing certain criminal Clean Air Act cases",
    "description": "The Trump administration Wednesday announced it would stop enforcing certain criminal violations of the Clean Air Act.The move signals President Donald Trump and his administration's latest action to pull back previous environmental protections under the fede…",
    "link": "https://www.rawstory.com/clean-air-act-2674961433/",
    "timestamp": "2026-01-21T22:23:11Z"
  },
  {
    "title": "House votes to recommend holding Bill and Hillary Clinton in contempt for refusing Epstein testimony",
    "description": "A Republican-led U.S. House of Representatives panel on Wednesday recommended former U.S. president Bill Clinton and former secretary of state Hillary Clinton be found in contempt of Congress for refusing to testify about ties to the late sex offender Jeffrey…",
    "link": "https://www.cbc.ca/news/world/house-vote-contempt-bill-clinton-hillary-clinton-epstein-testimony-9.7055247",
    "timestamp": "2026-01-21T22:22:29Z"
  },
  {
    "title": "“Trump always chickens out,” briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Donald Trump is once again moving markets — and being …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/476000/donald-trump-taco-greenland-stock-market-explained",
    "timestamp": "2026-01-21T22:22:22Z"
  },
  {
    "title": "Trump to reportedly meet with sports commissioners about America 250 plans",
    "description": "President Donald Trump is planning to meet with NBA, NFL, MLB and NHL commissioners about the country's 250th anniversary celebration.",
    "link": "https://www.usatoday.com/story/sports/2026/01/21/president-trump-sports-commissioners-meet-america-250/88288357007/",
    "timestamp": "2026-01-21T22:22:02Z"
  },
  {
    "title": "Venezuelan Crude Is Europe-Bound for First Time in Almost a Year",
    "description": "Europe is set to receive some of its first shipments of Venezuelan oil in nearly a year after traders rolled out offers worldwide to sell cargoes at the behest of the Trump administration.",
    "link": "https://financialpost.com/pmn/business-pmn/venezuelan-crude-is-europe-bound-for-first-time-in-almost-a-year",
    "timestamp": "2026-01-21T22:21:50Z"
  },
  {
    "title": "Bruce Lee stage play and Vocal Arts DC cancel shows at Kennedy Center",
    "description": "The producers of a Bruce Lee-inspired stage play and Vocal Arts DC have canceled shows at the Kennedy Center. This follows President Trump's controversial decision to rename it the Trump-Kennedy Center, a change experts say requires Congress's approval. Lin-M…",
    "link": "https://apnews.com/article/kennedy-center-cancel-vocal-arts-bruce-lee-44b6ebf2b058f66533946b5744367efd",
    "timestamp": "2026-01-21T22:21:49Z"
  },
  {
    "title": "ICE Officially Launches Operation 'Catch of the Day' as Maine Braces for Authoritarian Surge",
    "description": "\"Even the name\" chosen for the Trump administration's ramp-up of immigration enforcement in Maine was denounced as \"racist and degrading\" by one state politician on Wednesday as reports mounted about federal agents arresting dozens of people in the Portland a…",
    "link": "https://www.commondreams.org/news/ice-arrests-in-maine",
    "timestamp": "2026-01-21T22:21:01Z"
  },
  {
    "title": "Trump Admin Mocks Newsom for Being Stuck in ‘Cuck Chair’ at Davos After State Dept. Reportedly Blocked His Entry",
    "description": "The \"Rapid Response 47\" account mocked California Gov. Gavin Newsom (D) sitting in a back row at Davos -- after reports it was Trump's own State Department that blocked him and relegated him to that exiled position.\nThe post Trump Admin Mocks Newsom for Being…",
    "link": "https://www.mediaite.com/online/trump-admin-mocks-newsom-for-being-stuck-in-cuck-chair-at-davos-after-state-dept-reportedly-blocked-his-entry/",
    "timestamp": "2026-01-21T22:20:59Z"
  },
  {
    "title": "Scott Bessent Roasts Gavin Newsom by Saying He’s an ‘American Psycho’ Version of a Sparkle Beach Ken Doll",
    "description": "Davos felt like more of one of those golden age Dean Martin celebrity roast specials from decades ago. On Wednesday,...",
    "link": "https://twitchy.com/warren-squire/2026/01/21/scott-bessent-gavin-newsom-sparkle-beach-ken-jason-bateman-american-psycho-soros-roast-davos-n2424197",
    "timestamp": "2026-01-21T22:20:26Z"
  },
  {
    "title": "Mexico's president says it was 'sovereign decision' to send cartel members to U.S.",
    "description": "Mexico sent 37 cartel members to the United States at the request of the U.S. Justice Department, with Mexican President Claudia Sheinbaum saying Wednesday that it was a \"sovereign decision\" by her government.",
    "link": "https://www.cbc.ca/news/world/mexico-cartels-us-transfers-9.7055254",
    "timestamp": "2026-01-21T22:19:24Z"
  },
  {
    "title": "US judge bars government from reviewing seized Washington Post materials",
    "description": "The Washington Post has demanded the immediate return of materials seized from reporter Hannah Natanson.",
    "link": "https://www.aljazeera.com/news/2026/1/21/us-judge-bars-government-from-reviewing-seized-washington-post-materials",
    "timestamp": "2026-01-21T22:18:22Z"
  },
  {
    "title": "Trump Tells Davos: Big Migration Is Bad Economics",
    "description": "Mass migration is terrible economics, President Donald Trump told an audience of Europeans at the World Economic Forum on Wednesday.\nThe post Trump Tells Davos: Big Migration Is Bad Economics appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2026/01/21/trump-tells-davos-big-migration-is-bad-economics/",
    "timestamp": "2026-01-21T22:17:23Z"
  },
  {
    "title": "Trump says agreed ‘framework’ for US deal over Greenland",
    "description": "US President Donald Trump says he has reached a framework for a deal over Greenland following a meeting with NATO chief Mark Rutte, and that he will therefore waive tariffs scheduled to hit European allies. “We have formed the framework of a future deal with …",
    "link": "https://freerepublic.com/focus/f-news/4363317/posts",
    "timestamp": "2026-01-21T22:16:47Z"
  },
  {
    "title": "Trump’s (second) first year: a review",
    "description": "President Donald Trump had an extraordinary first year in his second term in office. The question is whether he can turn the economy around in time to keep control of Congress.",
    "link": "https://nypost.com/2026/01/21/opinion/trumps-second-first-year-a-review/",
    "timestamp": "2026-01-21T22:16:24Z"
  },
  {
    "title": "Trump drops threat of tariffs over Greenland after Nato talks in Davos",
    "description": "President Trump says he will not initiate tariffs on those countries opposed to his acquiring Greenland. He was speaking after talks with Nato leaders meeting at Davos. Also in the programme: The Nigerian government plans to restart drilling for oil in the Ni…",
    "link": "https://www.bbc.co.uk/programmes/w172zssjx14z4mn",
    "timestamp": "2026-01-21T22:15:00Z"
  },
  {
    "title": "Jack White Mocks Trump's 'Accomplishments' in Scathing IG Post",
    "description": "He also advised MAGA supporters to listen to Ted Nugent and Kid Rock instead. Continue reading…",
    "link": "https://loudwire.com/jack-white-mocks-trump-accomplishments/",
    "timestamp": "2026-01-21T22:13:19Z"
  },
  {
    "title": "Mexico Sends 37 Cartel Members to U.S. amid Pressure from Trump Administration",
    "description": "Mexico flew 37 cartel members to the United States on Tuesday as the Trump administration intensified pressure on foreign governments to crack down on their criminal drug trafficking networks.\nThe post Mexico Sends 37 Cartel Members to U.S. amid Pressure from…",
    "link": "https://www.breitbart.com/latin-america/2026/01/21/mexico-sends-37-cartel-members-to-u-s-amid-pressure-from-trump-administration/",
    "timestamp": "2026-01-21T22:12:18Z"
  },
  {
    "title": "New details trickle out in Trump's mysterious Greenland deal",
    "description": "New details emerged Wednesday afternoon in President Donald Trump's mysterious Greenland deal. The deal reportedly involves the United States having \"small pockets of land\" on the Arctic island, according to The New York Times. Trump said that he had reached …",
    "link": "https://www.rawstory.com/trump-greenland-2674957915/",
    "timestamp": "2026-01-21T22:11:37Z"
  },
  {
    "title": "Trump Claims ‘Concept of a Deal’ Reached for Greenland, Says He’ll Cancel New Tariffs",
    "description": "The president says he \"assumes\" Denmark knows about the deal.",
    "link": "https://gizmodo.com/trump-claims-concept-of-a-deal-reached-for-greenland-says-hell-cancel-new-tariffs-2000712673",
    "timestamp": "2026-01-21T22:10:11Z"
  },
  {
    "title": "Bitcoin, stocks rally after Trump halts Greenland tariffs",
    "description": "The halt in tariffs alleviates trade tension fears, boosting investor confidence and market stability, highlighting global economic interdependence.\nThe post Bitcoin, stocks rally after Trump halts Greenland tariffs appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/trump-halts-greenland-tariffs/",
    "timestamp": "2026-01-21T22:09:42Z"
  },
  {
    "title": "Bitcoin briefly erases gains posted since the start of the year",
    "description": "Bitcoin briefly erased all of its gains registered since the start of the year, with investors remaining on the defensive. Read more here",
    "link": "https://financialpost.com/fp-finance/cryptocurrency/bitcoin-briefly-erases-gains",
    "timestamp": "2026-01-21T22:08:56Z"
  },
  {
    "title": "‘His Life Won’t Be Very Happy’: Trump Threatens Powell If He Refuses to Quit the Fed",
    "description": "President Donald Trump seemed to suggest he'd make things difficult for Jerome Powell if he doesn't leave the Federal Reserve once his time as Fed chair is up.\nThe post ‘His Life Won’t Be Very Happy’: Trump Threatens Powell If He Refuses to Quit the Fed first…",
    "link": "https://www.mediaite.com/media/news/his-life-wont-be-very-happy-trump-threatens-powell-if-he-refuses-to-quit-the-fed/",
    "timestamp": "2026-01-21T22:08:55Z"
  },
  {
    "title": "Trump Awkwardly Throws Shade at Pregnant Karoline Leavitt, 28, at Her Own White House Briefing — After She Gushed Over The 'Special' Prez",
    "description": "The president called out his communications team for not doing a better job of messaging, including Leavitt, at her own briefing.",
    "link": "https://radaronline.com/p/donald-trump-awkwardly-shade-pregnant-karoline-leavitt-video/",
    "timestamp": "2026-01-21T22:07:34Z"
  },
  {
    "title": "Brett Kavanaugh Says Trump Threatens Federal Reserve Independence",
    "description": "Trump’s legal arguments “would weaken, if not shatter, the independence of the Federal Reserve,” the justice said.",
    "link": "https://reason.com/2026/01/22/brett-kavanaugh-says-trump-threatens-federal-reserve-independence/",
    "timestamp": "2026-01-21T22:06:18Z"
  },
  {
    "title": "REPORT: Barron Trump Called UK Police After Friend Was Allegedly Being Beaten By Romantic Partner On FaceTime",
    "description": "Barron Trump reportedly saved a female friend's life when he contacted British police to say she was being beaten by her ex-boyfriend.",
    "link": "https://dailycaller.com/2026/01/21/report-barron-trump-police-uk-friend-domestic-violence/",
    "timestamp": "2026-01-21T22:06:08Z"
  },
  {
    "title": "Time For 25th Amendment: Trump Will Cause WWIII And Economic Ruin",
    "description": "It's way past time for the 25th Amendment. Trump must go or the United States faces economic ruin and WWIII. The picture above was posted by the White House. In the year of our Lord 2026. \nEric Swalwell and other Democrats are calling for Trump to be removed …",
    "link": "https://crooksandliars.com/2026/01/time-25th-amendment-trump-will-cause-wwiii",
    "timestamp": "2026-01-21T22:05:44Z"
  },
  {
    "title": "Politics Girl Humiliates Another Wingnut",
    "description": "Scott Jennings was probably still smarting from being dressed down the previous night, so the hapless wingnut Ben Ferguson took his turn in the box this Tuesday.\nDuring yet another one of their shout-fest panel discussions on CNN's NewsNight, this time on Tru…",
    "link": "https://crooksandliars.com/2026/01/politics-girl-humiliates-another-wingnut",
    "timestamp": "2026-01-21T22:05:43Z"
  },
  {
    "title": "Top five takeaways from Trump's interview with CNBC",
    "description": "Trump earlier in the day said he reached a framework with NATO Secretary Mark Rutte that appears to stave off Trump's threats to Greenland.",
    "link": "https://www.cnbc.com/2026/01/21/trump-cnbc-greenland-fed-iran-credit-cards-homes.html",
    "timestamp": "2026-01-21T22:05:42Z"
  },
  {
    "title": "Trump announces Greenland 'framework', backing off force and tariffs",
    "description": "DAVOS: US President Donald Trump said Wednesday he had reached a framework of a deal that satisfies him on Greenland, as he backed down both on threats to seize the island by force from Den",
    "link": "https://www.channelnewsasia.com/world/trump-announces-greenland-framework-backing-force-and-tariffs-5874951",
    "timestamp": "2026-01-21T22:03:39Z"
  },
  {
    "title": "Trump announces Greenland 'framework', backing off force and tariffs",
    "description": "The Greenland deal \"gets everything we wanted\" and will be in force \"forever\", says US President Donald Trump.",
    "link": "https://www.channelnewsasia.com/world/trump-greenland-framework-tariffs-european-allies-force-5874951",
    "timestamp": "2026-01-21T22:03:00Z"
  },
  {
    "title": "\"Dementia? What is? NO! Trump smart, pass brain test, name giraffe!\" Jack White mercilessly mocks Donald Trump over his \"365 wins in 365 days\" claims",
    "description": "The White Stripes' founder has promised to block any followers who tell him to \"stick to music\"",
    "link": "https://www.loudersound.com/bands-artists/jack-white-mocks-donald-trump-again",
    "timestamp": "2026-01-21T22:02:54Z"
  },
  {
    "title": "“Bigger than Oasis”: Tenacious D’s Gass says band will return following Trump gaffe",
    "description": "Tenacious D co-founder Kyle Gass said the act will return after a Trump joke spurred an unexpected hiatus.",
    "link": "https://www.salon.com/2026/01/21/bigger-than-oasis-tenacious-ds-gass-says-band-will-return-following-trump-gaffe/",
    "timestamp": "2026-01-21T22:02:49Z"
  },
  {
    "title": "Majority of Canadians concerned about U.S. takeover of Greenland and want Ottawa to protest",
    "description": "Asked whether Canada should be concerned about U.S. ambitions toward Greenland, 71 per cent of Canadians said yes",
    "link": "https://nationalpost.com/news/canada/majority-of-canadians-concerned-about-u-s-takeover-of-greenland-and-want-ottawa-to-protest",
    "timestamp": "2026-01-21T22:02:28Z"
  },
  {
    "title": "Sunny Hostin urges 'defamed' alleged criminals arrested by ICE to sue Trump",
    "description": "On Wednesday, \"The View,\" co-host Sunny Hostin claimed President Donald Trump may have defamed criminals arrested by ICE after he held up their mugshots during a press conference.",
    "link": "https://www.foxnews.com/media/sunny-hostin-urges-defamed-alleged-criminals-arrested-ice-sue-trump",
    "timestamp": "2026-01-21T22:00:34Z"
  },
  {
    "title": "How Venezuela Went from U.S. Ally to National Security Threat",
    "description": "President Donald Trump’s crusade to topple Venezuela’s illegitimate President Nicolas Maduro, which culminated with his capture in a daring night raid by U.S. troops, started with a massive August 2025 naval buildup in the Caribbean. That escalated to airstri…",
    "link": "https://oilprice.com/Energy/Crude-Oil/How-Venezuela-Went-from-US-Ally-to-National-Security-Threat.html",
    "timestamp": "2026-01-21T22:00:00Z"
  },
  {
    "title": "5 Top ICE 'Corporate Collaborators' Saved $19 Billion in Taxes Under Trump: Report",
    "description": "A campaign launched Wednesday by an economic justice coalition highlights how five major US corporations saved a collective $19 billion in annual tax cuts under President Donald Trump, while also aiding in his Immigration and Customs Enforcement operations.Am…",
    "link": "https://www.commondreams.org/news/ice-corporate-collaborators",
    "timestamp": "2026-01-21T21:57:57Z"
  },
  {
    "title": "Trump Talks Greenland at Davos, Announces ‘Framework’ Deal",
    "description": "The U.S. president said he and the NATO secretary-general “formed the framework of a future deal” but provided few details.",
    "link": "http://foreignpolicy.com/2026/01/21/donald-trump-world-economic-forum-davos-speech-greenland/",
    "timestamp": "2026-01-21T21:57:53Z"
  },
  {
    "title": "Stocks recover on tariff walk-back",
    "description": "NEW YORK — The U.S. stock market bounced back from its worst day since October on Wednesday after President Donald Trump said he reached the framework for a deal about Greenland, an island he’s long coveted, and won’t impose tariffs he had threatened on sever…",
    "link": "https://www.bostonherald.com/2026/01/21/stocks-recover-on-tariff-walk-back/",
    "timestamp": "2026-01-21T21:57:47Z"
  },
  {
    "title": "Trump to host major sports commissioners in Oval Office for America 250 planning: report",
    "description": "Sports commissioners from the NFL, NBA, MLB and NHL are reportedly meeting with President Donald Trump at the White House to discuss America's 250th anniversary plans.",
    "link": "https://www.foxnews.com/sports/trump-host-major-sports-commissioners-oval-office-america-250-planning-report",
    "timestamp": "2026-01-21T21:57:08Z"
  },
  {
    "title": "Trump Appears to Advocate for Dictators in Davos",
    "description": "Donald Trump appeared to advocate for dictators at an event at the World Economic Forum in Davos, Switzerland, on Wednesday. The president was speaking at the CEO reception and dinner event and reflected on his speech from earlier in the day, in…\n Permalink",
    "link": "https://www.tmz.com/2026/01/21/trump-talks-dictators-at-davos/",
    "timestamp": "2026-01-21T21:55:59Z"
  },
  {
    "title": "Trump DOJ Misses Epstein Files Deadline, GOP Shrugs",
    "description": "GOP shrugs as Trump DOJ misses deadline to release the Epstein files Republicans helped pass a law demanding the full release of. Now they’ve lost interest in seeing it enforced.",
    "link": "http://nymag.com/intelligencer/article/trump-doj-misses-epstein-files-deadline-gop-shrugs.html",
    "timestamp": "2026-01-21T21:55:36Z"
  },
  {
    "title": "Trump-Greenland Deals Reportedly Includes U.S. ‘Sovereignty Over Small Pockets’ of Territory",
    "description": "The NATO statement came amid new reporting from the New York Times that deal may include the U.S. being given “sovereignty over small pockets” of land in Greenland.\nThe post Trump-Greenland Deals Reportedly Includes U.S. ‘Sovereignty Over Small Pockets’ of Te…",
    "link": "https://www.mediaite.com/media/news/trump-greenland-deals-reportedly-includes-u-s-sovereignty-over-small-pockets-of-territory/",
    "timestamp": "2026-01-21T21:55:12Z"
  },
  {
    "title": "Trump simply gave Davos elites some ‘tough love’ — to finally wake them up",
    "description": "President Trump was blunt. Europe, he told the crowd, has squandered its inheritance.",
    "link": "https://nypost.com/2026/01/21/opinion/trump-simply-gave-davos-elites-some-tough-love-to-finally-wake-them-up/",
    "timestamp": "2026-01-21T21:54:35Z"
  },
  {
    "title": "Mockery as Trump swings U-turn on Greenland threats: 'TACO Tuesdays are back!'",
    "description": "The internet mocked President Donald Trump on Wednesday after he backed down on his demands to seize Greenland. Trump reversed his plot to seize the Arctic island country and Danish territory — after major pushback from NATO allies, world leaders and a plumme…",
    "link": "https://www.rawstory.com/trump-greenland-2674952509/",
    "timestamp": "2026-01-21T21:54:01Z"
  },
  {
    "title": "Whoopi Goldberg: 'It's Time' to Remove Trump with the 25th Amendment",
    "description": "Wednesday on ABC's \"The View,\" co-host Whoopi Goldberg said it was time for President Donald Trump to be removed from the White House over his mental fitness.\nThe post Whoopi Goldberg: ‘It’s Time’ to Remove Trump with the 25th Amendment appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2026/01/21/whoopi-goldberg-its-time-to-remove-trump-with-the-25th-amendment/",
    "timestamp": "2026-01-21T21:53:20Z"
  },
  {
    "title": "Trump promises health care cash directly to you, but one expert says plan to pay 'small checks' a 'joke' as costs jump",
    "description": "Trump promises health care cash directly to you, but one expert says plan to pay 'small checks' a 'joke' as costs jumpnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4451476836411-trump-promises-health-care-cash-directly-to-you-but-one-expert-says-plan-to-pay-small-checks-a-joke-as-costs-jump?s=a2&amp;share_destination_id=MjA4NDA5Njc1LTE3NjkwMzIzMTMyMjE%3D&amp;pd=0E6SsNAP&amp;hl=en_US&amp;send_time=1769032313&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.2.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-21T21:52:43Z"
  },
  {
    "title": "The Irish Times view on Trump at Davos: the US president climbs down",
    "description": "A withdrawal of the tariff threats due to progress on the future of Greenland ended an extraordinary day",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/21/the-irish-times-view-on-trump-at-davos-the-us-president-climbs-down/",
    "timestamp": "2026-01-21T21:52:00Z"
  },
  {
    "title": "Mexico's president says it was 'sovereign decision' to send cartel members to US",
    "description": "Mexican President Claudia Sheinbaum says that her government sent 37 cartel members to the United States at the request of the U.S. Justice Department",
    "link": "https://abcnews.go.com/Business/wireStory/mexicos-president-sovereign-decision-send-cartel-members-us-129427874",
    "timestamp": "2026-01-21T21:49:55Z"
  },
  {
    "title": "The Supreme Court Sounds More Frustrated With Trump Than Ever Before",
    "description": "Chief Justice John Roberts also wants to end this nonsense for once and for all.",
    "link": "https://slate.com/news-and-politics/2026/01/supreme-court-federal-reserve-donald-trump-brett-kavanaugh.html",
    "timestamp": "2026-01-21T21:48:45Z"
  },
  {
    "title": "ICE activity increases in Maine as anxiety grows in immigrant communities",
    "description": "The Trump administration is now targeting Maine in its mass deportation campaign, a state with relatively few residents in the United States illegally but a notable presence refugees in its largest cities, particularly from Africa. Reports of immigration arre…",
    "link": "https://japantoday.com/category/world/ice-activity-increases-in-maine-as-anxiety-grows-in-immigrant-communities",
    "timestamp": "2026-01-21T21:47:10Z"
  },
  {
    "title": "Supreme Court seems inclined to keep Lisa Cook on Fed board despite Trump attempt to fire her",
    "description": "The Supreme Court on Wednesday seemed inclined to keep Federal Reserve governor Lisa Cook in her job, casting doubt on President Donald Trump’s bid to wrest control of the nation's central bank. The justices heard arguments over Trump’s effort to fire Cook ba…",
    "link": "https://japantoday.com/category/world/supreme-court-seems-inclined-to-keep-lisa-cook-on-fed-board-despite-trump-attempt-to-fire-her1",
    "timestamp": "2026-01-21T21:47:04Z"
  },
  {
    "title": "Iran says 3,117 killed in protests",
    "description": "Iranian authorities on Wednesday said 3,117 people were killed during protests that first erupted in late December, but activists said the actual toll risked being many times higher due to a crackdown that suppressed the demonstrations. Demonstrations and str…",
    "link": "https://japantoday.com/category/world/iran-says-3-117-killed-during-protests-activists-fear-%27far-higher%27-toll",
    "timestamp": "2026-01-21T21:46:59Z"
  },
  {
    "title": "'Who can say no?' Trump's Board of Peace tests doubters' resolve in Davos",
    "description": "Donald Trump's Board of Peace, seen by some as a rival to the United Nations, has caught officials at some of the countries invited off guard, with several saying they felt compelled ‌to sign up rather than risk the U.S. president's wrath. Reuters canvassed 1…",
    "link": "https://japantoday.com/category/world/%27who-can-say-no-%27-trump%27s-board-of-peace-tests-doubters%27-resolve-in-davos",
    "timestamp": "2026-01-21T21:46:53Z"
  },
  {
    "title": "Israeli fire kills 11, including journalists and children, Gaza medics say",
    "description": "Israeli fire killed 11 Palestinians including two boys and three journalists in separate incidents in Gaza on Wednesday, local medics said, in the latest violence to undermine ‌a three-month-old ceasefire in the war-shattered enclave. Palestinian health offic…",
    "link": "https://japantoday.com/category/world/israeli-fire-kills-11-including-journalists-and-children-gaza-medics-say",
    "timestamp": "2026-01-21T21:46:40Z"
  },
  {
    "title": "Lawmakers can sue to ensure release of Epstein files, but not as part of Maxwell case, judge says",
    "description": "Congressional cosponsors of a law forcing the Justice Department to release its files on Jeffrey Epstein and Ghislaine Maxwell can file a lawsuit seeking a court-appointed observer to ensure compliance, but they lack the legal right to append their demand to …",
    "link": "https://japantoday.com/category/world/judge-rules-against-lawmakers-pressing-for-monitor-to-ensure-release-of-epstein-files",
    "timestamp": "2026-01-21T21:46:35Z"
  },
  {
    "title": "House Republicans take first step to hold Clintons in contempt of Congress in Epstein probe",
    "description": "House Republicans advanced a resolution Wednesday to hold former President Bill Clinton and former Secretary of State Hillary Clinton in contempt of Congress over the Jeffrey Epstein investigation, opening the prospect of the House using one of its most power…",
    "link": "https://japantoday.com/category/world/house-republicans-begin-push-to-hold-the-clintons-in-contempt-of-congress-over-the-epstein-probe",
    "timestamp": "2026-01-21T21:46:20Z"
  },
  {
    "title": "Trump to meet with Zelenskyy as Ukraine endures bitter winter after Russian attacks",
    "description": "About 4,000 buildings in Kyiv remained without heating Wednesday, and nearly 60% of the Ukrainian capital was without power, Ukraine's President Volodymyr Zelenskyy said, after days of Russian bombardment of Ukraine’s power grid and as U.S. President Donald T…",
    "link": "https://japantoday.com/category/world/ukraine-endures-a-bitter-winter-after-russian-attacks-as-peace-efforts-overshadowed",
    "timestamp": "2026-01-21T21:46:00Z"
  },
  {
    "title": "Trump rules out force, tariffs; says Greenland deal framework in sight",
    "description": "U.S. President Donald Trump abruptly stepped back on Wednesday from threats to impose tariffs as leverage to seize Greenland, ruled out the use ‌of force, and said a deal was in sight to end a dispute over the Danish territory that risked the deepest rupture …",
    "link": "https://japantoday.com/category/world/trump-rules-out-force-tariffs-says-greenland-deal-framework-reached1",
    "timestamp": "2026-01-21T21:45:53Z"
  },
  {
    "title": "After Carney's Davos speech, Conservatives ponder how Poilievre can meet the foreign policy moment",
    "description": "'I think confronting that reality that (Trump's) not just going to go away, it's unpleasant, and it's less than ideal, but I think it is reality,' said Woodfinden",
    "link": "https://nationalpost.com/news/politics/after-carneys-davos-speech-conservatives-ponder-how-poilievre-can-meet-the-foreign-policy-moment",
    "timestamp": "2026-01-21T21:45:47Z"
  },
  {
    "title": "IOC president says no contact yet with Trump's White House, will meet Vance at Winter Olympics",
    "description": "Olympic leader Kirsty Coventry said Wednesday she is yet to have formal contact with U.S. President Donald Trump’s administration but is looking forward to meeting Vice President JD Vance in Milan next month at the Winter Games opening ceremony. The Internati…",
    "link": "https://japantoday.com/category/sports/ioc-president-says-no-contact-yet-with-trump%27s-white-house-will-meet-vance-at-winter-olympics",
    "timestamp": "2026-01-21T21:44:50Z"
  },
  {
    "title": "French President Calls For More Chinese Investment in Response to Trump Threats",
    "description": "French President Emmanuel Macron called for more Chinese investments in France at the Davos International Summit in Switzerland.",
    "link": "https://www.ibtimes.com/french-president-calls-more-chinese-investment-response-trump-threats-3795961",
    "timestamp": "2026-01-21T21:44:32Z"
  },
  {
    "title": "Trump on Iran: We hope there’s not going to be further action",
    "description": "Speaking to CNBC, Trump says Iran canceled 837 planned executions after his threat of military action, urges Tehran to stop pursuing nuclear weapons.",
    "link": "https://www.israelnationalnews.com/news/421274",
    "timestamp": "2026-01-21T21:44:22Z"
  },
  {
    "title": "Tenacious D’s Kyle Gass Says Trump Shooting Remark Was ‘Terrible,’ Speaks on Relationship With Jack Black: ‘We Had to Take the Break’",
    "description": "Tenacious D’s Kyle Gass sparked controversy back in July 2024 after commenting on the attempted assassination of President Donald Trump during a concert in Australia. A year-and-a-half later, Gass is speaking out about the moment that caused his duo with Jack…",
    "link": "https://variety.com/2026/music/news/tenacious-d-kyle-gass-trump-shooting-remark-was-terrible-1236637249/",
    "timestamp": "2026-01-21T21:43:55Z"
  },
  {
    "title": "Glenn Beck Blasts Top Trump Official In 14-Minute-Long Tirade",
    "description": "Beck, a former Fox News host, deemed the attorney general \"incompetent\" and called for her to \"be replaced.\"",
    "link": "https://www.huffpost.com/entry/glenn-beck-pam-bondi-epstein-files-rant_n_69711189e4b0f8f3759e8c81",
    "timestamp": "2026-01-21T21:43:32Z"
  }
]