[
  {
    "title": "Ishiba says Japan considering role in security guarantees for Ukraine",
    "description": "The “coalition of the willing,” which groups 30 nations backing Ukraine that includes Japan, has been working for months to craft a comprehensive package of security guarantees.",
    "link": "https://www.japantimes.co.jp/news/2025/08/19/japan/politics/japan-ukraine-security-guarantees/",
    "timestamp": "2025-08-19T05:29:00Z"
  },
  {
    "title": "Responding to Trump invasion comments, Taiwan says must rely on itself for security",
    "description": "TAIPEI: Taiwan must rely on itself for its security, the island's foreign ministry said on Tuesday (Aug 19), responding to US President Donald Trump saying Chinese President Xi Jinping told him he would not invade the island while Trump was in office. Democra…",
    "link": "https://www.channelnewsasia.com/east-asia/responding-donald-trump-invasion-comments-taiwan-defence-security-china-5302026",
    "timestamp": "2025-08-19T05:28:30Z"
  },
  {
    "title": "External Affairs Minister Jaishankar embarks on 3-day visit to Russia",
    "description": "The MEA, announcing Jaishankar's trip, said he will co-chair the 26th Session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation to be held on Wednesday",
    "link": "https://www.thehindubusinessline.com/economy/external-affairs-minister-jaishankar-embarks-on-3-day-visit-to-russia/article69950283.ece",
    "timestamp": "2025-08-19T05:27:16Z"
  },
  {
    "title": "Italian PM Giorgia Meloni’s priceless reaction to Germany Chancellor Merz’s lecture and Trump’s joke goes viral. Watch videos",
    "description": "Italian Prime Minister Giorgia Meloni's reactions during a White House meeting have gone viral, showing her eye-rolling at a joke by Donald Trump and making a face while Germany’s Chancellor Friedrich Merz discussed the Ukraine conflict. This isn't the first …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/italian-pm-giorgia-melonis-priceless-reaction-to-germany-chancellor-merzs-lecture-and-trumps-joke-goes-viral-watch-videos/articleshow/123378601.cms",
    "timestamp": "2025-08-19T05:22:11Z"
  },
  {
    "title": "Japan’s SoftBank to take $2 billion stake in computer chip maker Intel",
    "description": "BANGKOK (AP) — Japanese technology giant SoftBank Group plans to take a $2 billion stake in computer chip maker Intel as it deepens its involvement in U.S. semiconductor manufacturing and other advanced technology in the United States, the companies said Mond…",
    "link": "https://financialpost.com/pmn/japans-softbank-to-take-2-billion-stake-in-computer-chip-maker-intel",
    "timestamp": "2025-08-19T05:20:49Z"
  },
  {
    "title": "What to know about Trump’s talks with Zelenskyy and European leaders",
    "description": "US president proposes Putin-Zelenskyy summit in latest push to end the war in Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/8/19/what-to-know-about-trumps-talks-with-zelenskyy-and-european-leaders",
    "timestamp": "2025-08-19T05:18:17Z"
  },
  {
    "title": "US says UK has agreed to drop encryption ‘back door’ demands against Apple",
    "description": "US and UK end diplomatic row over UK  encryption ‘back door’ order against Apple, but it remains unclear whether Apple will restore advance encryption services to UK users",
    "link": "https://www.computerweekly.com/news/366629434/US-says-UK-has-agreed-to-drop-encryption-back-door-demands-against-Apple",
    "timestamp": "2025-08-19T05:12:00Z"
  },
  {
    "title": "Putin wasn't at the White House, but his influence was - key moments which reveal his hold over Trump",
    "description": "For Moscow, the aim now is to keep Donald Trump on their path to peace, which is settlement first, ceasefire later. It believes that's the best way of securing its goals, because it has more leverage so long as the fighting continues.",
    "link": "https://news.sky.com/story/putin-wasnt-at-the-white-house-but-his-influence-was-key-moments-which-reveal-his-hold-over-trump-13414421",
    "timestamp": "2025-08-19T05:08:00Z"
  },
  {
    "title": "SoftBank Makes Surprise $2 Billion Bet on Intel’s AI Revival",
    "description": "SoftBank Group Corp. agreed to buy $2 billion of Intel Corp. stock, a surprise deal to shore up a struggling US name while boosting its own chip ambitions.",
    "link": "https://financialpost.com/pmn/business-pmn/softbank-makes-surprise-2-billion-bet-on-intels-ai-revival",
    "timestamp": "2025-08-19T05:06:37Z"
  },
  {
    "title": "European markets set to open higher amid positive reaction to Trump-Zelenskyy talks",
    "description": "European stocks are expected to open broadly higher on Tuesday as global markets reacted positively to the latest U.S.-Ukraine talks.",
    "link": "https://www.cnbc.com/2025/08/19/european-markets-on-aug-19-stoxx-600-ftse-dax-trump-talks-fed.html",
    "timestamp": "2025-08-19T05:06:34Z"
  },
  {
    "title": "India's Modi to meet China's top diplomat as Asian powers rebuild ties",
    "description": "Indian Prime Minister Narendra Modi will meet with China’s top diplomat on Tuesday in a sign of easing tensions after a yearslong standoff between the nuclear-armed neighbors",
    "link": "https://abcnews.go.com/International/wireStory/indias-modi-meet-chinas-top-diplomat-asian-powers-124767459",
    "timestamp": "2025-08-19T05:02:11Z"
  },
  {
    "title": "John Bolton Spots Sure Sign Trump Was 'Clearly On Edge' Ahead Of Key Moment",
    "description": "Trump's former national security adviser flagged how the \"optics\"-obsessed president put his \"nerves\" on display.",
    "link": "https://www.huffpost.com/entry/john-bolton-trump-putin-alaska-summit-ukraine-talks_n_68a3e51be4b0d0ff2bd6e0eb",
    "timestamp": "2025-08-19T05:01:24Z"
  },
  {
    "title": "Republic of Ireland not a ‘truly rich’ country, according to The Economist",
    "description": "Publisher’s ranking of 178 countries excludes Ireland due to GDP calculations ‘polluted by tax arbitrage’",
    "link": "https://www.irishtimes.com/business/2025/08/19/ireland-not-a-truly-rich-country-according-to-the-economist/",
    "timestamp": "2025-08-19T05:01:00Z"
  },
  {
    "title": "Newsmax Settles Dominion Defamation Case for $67 Million; Says It Couldn’t Get Fair Trial",
    "description": "Newsmax Media has agreed to pay $67 million to Dominion Voting Systems to settle a $1.6 billion defamation lawsuit over false claims that the voting machine company rigged the 2020 election against U.S. President Donald Trump, it said on Monday. …",
    "link": "https://www.insurancejournal.com/news/national/2025/08/19/836152.htm",
    "timestamp": "2025-08-19T05:00:56Z"
  },
  {
    "title": "Judge Strikes Down Trump Guidance Against DEI at Schools and Colleges",
    "description": "A federal judge last Thursday struck down two Trump administration actions aimed at eliminating diversity, equity and inclusion programs at the nation’s schools and universities. In her ruling, U.S. District Judge Stephanie Gallagher in Maryland found that th…",
    "link": "https://www.insurancejournal.com/news/national/2025/08/19/836156.htm",
    "timestamp": "2025-08-19T05:00:27Z"
  },
  {
    "title": "EAM Jaishankar embarks on 3-day visit to Russia",
    "description": "External Affairs Minister S. Jaishankar began a three-day visit to Moscow to reinforce the strong India-Russia partnership amid rising tensions with the US over increased tariffs on Indian goods and Russian oil imports. He will co-chair the 26th India-Russia …",
    "link": "https://economictimes.indiatimes.com/news/india/eam-jaishankar-embarks-on-3-day-visit-to-russia/articleshow/123378244.cms",
    "timestamp": "2025-08-19T05:00:22Z"
  },
  {
    "title": "China, India seek closer ties to counter US 'bullying'",
    "description": "US President Donald Trump’s tariffs on both countries’ exports, as well as threats to penalize India for buying Russian oil, are adding urgency to normalise ties",
    "link": "https://www.bloomberg.com/news/articles/2025-08-18/china-india-seek-better-ties-as-us-policies-add-to-uncertainty",
    "timestamp": "2025-08-19T04:59:51Z"
  },
  {
    "title": "European markets set to open higher amid positive reaction to Trump-Zelenskyy talks",
    "description": "LONDON — European stocks are expected to open broadly higher on Tuesday as global markets reacted positively to the outcome of talks between U.S. President Donald Trump, Ukrainian President Volodymyr Zelenskyy and European leaders at the White House on Monday…",
    "link": "https://biztoc.com/x/56083f94243e8820",
    "timestamp": "2025-08-19T04:57:17Z"
  },
  {
    "title": "Ranking Member Smith Statement on Trump-Putin Summit",
    "description": "U.S. Representative Adam Smith (D-Wash.), Ranking Member of the House Armed Services Committee, issued the following statement in response to President Donald Trump's August 15th meeting with Russian President Vladimir Putin.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250816-hasc-democrats01.htm",
    "timestamp": "2025-08-19T04:55:35Z"
  },
  {
    "title": "Guard Assisting Law Enforcement in Making D.C. Safe",
    "description": "On Aug. 11, 2025, President Donald J. Trump declared a crime emergency in the nation's capital and vowed to make streets there safe again.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/08/sec-250818-dodnews01.htm",
    "timestamp": "2025-08-19T04:55:35Z"
  },
  {
    "title": "Iran warns of 'endless wars' in region if Israeli expansionism goes unchecked",
    "description": "Foreign Ministry spokesperson Esmaeil Baqaei says Israel constitutes an existential threat to the security and stability of West Asia due to its boundless expansionism, warning that the region could face endless wars if the regime is not contained.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250818-irna03.htm",
    "timestamp": "2025-08-19T04:55:35Z"
  },
  {
    "title": "Security Guarantees for Ukraine Do Not Require Deployment of US Troops - US NATO Envoy",
    "description": "Potential security guarantees for Ukraine may not require the deployment of US troops and are expected to be primarily focused on a command-and-control role, US Ambassador to NATO Matthew Whitaker stated on Monday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-sputnik05.htm",
    "timestamp": "2025-08-19T04:54:58Z"
  },
  {
    "title": "Trump meets Zelensky, European leaders on Ukraine crisis; attire and map details draw attention",
    "description": "US President Donald Trump said he's begun arranging a meeting between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin after a summit with Zelensky and European leaders at the White House on Monday, according to multiple media repor…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250819-globaltimes01.htm",
    "timestamp": "2025-08-19T04:54:58Z"
  },
  {
    "title": "More young lives lost in Ukraine, as UN chief repeats call for a 'just, comprehensive and sustainable peace'",
    "description": "Russian drone strikes on Ukraine overnight including in the cities of Kharkiv and Zaporizhzhia reportedly killed at least 14 people - including three children.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-unnews01.htm",
    "timestamp": "2025-08-19T04:54:58Z"
  },
  {
    "title": "South Korea's Lee meets business leaders to discuss summit with Trump",
    "description": "SEOUL (Reuters) -South Korean President Lee Jae Myung met on Tuesday the leaders of some of the country's biggest conglomerates who will accompany Lee to...",
    "link": "https://www.yahoo.com/news/articles/south-koreas-lee-meets-business-045449852.html",
    "timestamp": "2025-08-19T04:54:49Z"
  },
  {
    "title": "Trump: Zelensky can end Ukraine war if he abandons NATO membership, Crimea reclamation",
    "description": "US President Donald Trump says his Ukrainian counterpart, Volodymyr Zelensky, can immediately end the Russia-Ukraine war if he abandons Crimea reclamation and NATO membership.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-presstv02.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Trump-Zelensky Talks: Key Statements",
    "description": "Following his meeting with Ukraine's Zelensky, US President Donald Trump declared that there are decent odds of finally ending the Ukrainian conflict.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-sputnik02.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Trump Anticipates 'A Big Day In The White House' As Zelenskyy, European Leaders Arrive For Talks",
    "description": "US President Donald Trump has written that it's going to be \"a big day in the White House\" as his Ukrainian counterpart, Volodymyr Zelenskyy, and European leaders were arriving for talks on ending the fighting in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-rferl04.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Trump meets Zelensky, European leaders on resolving Ukrainian crisis",
    "description": "U.S. President Donald Trump hosted Ukrainian President Volodymyr Zelensky and seven European leaders at the White House on Monday, with a focus on resolving the Ukrainian crisis.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250819-pdo01.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Remarks by NATO Secretary General, Mark Rutte, at the start of the multilateral meeting hosted by the President of the United States, Donald J. Trump, with the President of Ukraine, Volodymyr Zelenskyy, and other European leaders in Washington, D.C.",
    "description": "I will be very brief. I really want to thank you, President of the United States, dear Donald, for the fact that you, as I said before, broke the deadlock, basically, with President Putin by starting that dialog; and I think it was in February that you had th…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-nato01.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Trump, Zelenskyy, World Leaders Meet at White House to Negotiate Peace Deal",
    "description": "At the White House today, President Donald J. Trump met with Ukrainian President Volodymyr Zelenskyy and a host of European leaders to discuss how the ongoing violent war between Russia and Ukraine might be resolved. Defense Secretary Pete Hegseth also attend…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-dodnews01.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Trump, Zelensky, European leaders hold critical Ukraine war talks",
    "description": "US President Donald Trump says he believes that Russian President Vladimir Putin wants to end the war in Ukraine, as he met with President Volodymyr Zelensky and his European allies at the White House.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250818-presstv01.htm",
    "timestamp": "2025-08-19T04:54:45Z"
  },
  {
    "title": "Hamas accepts ceasefire proposal as Trump backs Israeli plans to occupy Gaza",
    "description": "Hamas has reportedly accepted a proposed ceasefire and prisoner exchange deal with Israel, even as US President Donald Trump declared that Israel's captives will be freed only after Hamas is \"destroyed,\" backing the regime's ongoing plans to occupy Gaza City.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/08/mil-250818-presstv02.htm",
    "timestamp": "2025-08-19T04:54:44Z"
  },
  {
    "title": "Iraq to end presence of US-led military coalition by September: Prime minister's aide",
    "description": "The Iraqi government plans to end the presence of the US-led military forces in the capital Baghdad and at the Ain al-Asad airbase in the western al-Anbar province by the end of September, according to an aide to Prime Minister Mohammed Shia' al-Sudani.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/08/mil-250818-presstv06.htm",
    "timestamp": "2025-08-19T04:54:44Z"
  },
  {
    "title": "Regional states now see true face of Israel's expansionist nature: Iran's Foreign Ministry",
    "description": "The latest developments have unmasked the Israeli regime's \"domineering and expansionist\" nature for regional countries more than ever, says the spokesman for Iran's Foreign Ministry.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250818-presstv03.htm",
    "timestamp": "2025-08-19T04:54:44Z"
  },
  {
    "title": "Las Vegas tourism is down. Some blame Trump's tariffs and immigration crackdown",
    "description": "Tourism in Las Vegas is slumping this summer, with resorts and convention centers reporting fewer visitors compared to last year, especially from abroad, and some officials are blaming the Trump administration’s tariffs and immigration policies for the...",
    "link": "https://abcnews.go.com/Business/wireStory/las-vegas-tourism-blame-trumps-tariffs-immigration-crackdown-124766633",
    "timestamp": "2025-08-19T04:54:25Z"
  },
  {
    "title": "Las Vegas tourism is down. Some blame Trump's tariffs and immigration crackdown",
    "description": "Tourism in Las Vegas is slumping this summer, with resorts and convention centers reporting fewer visitors compared to last year, especially from abroad, and some officials are blaming the Trump administration’s tariffs and immigration policies for the...",
    "link": "https://abcnews.go.com/US/wireStory/las-vegas-tourism-blame-trumps-tariffs-immigration-crackdown-124766632",
    "timestamp": "2025-08-19T04:54:24Z"
  },
  {
    "title": "Pope to Ukrainian Greek Catholics: 'Your faith is being put to the test'",
    "description": "Pope Leo XIV acknowledges that the faith of Ukrainian Greek Catholics is being put to a severe test, \"amid this senseless war,\" but stresses that the Lord will have the final word and life will triumph over death. The Holy Father also greeted and blessed some…",
    "link": "https://freerepublic.com/focus/f-religion/4335371/posts",
    "timestamp": "2025-08-19T04:53:39Z"
  },
  {
    "title": "Crude oil futures fall amid positive signals from US-Ukraine talks",
    "description": "October Brent oil futures were at $66.17, down by 0.65%, and October crude oil futures on West Texas Intermediate were at $62.25, down by 0.72%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-fall-amid-positive-signals-from-us-ukraine-talks/article69950201.ece",
    "timestamp": "2025-08-19T04:50:57Z"
  },
  {
    "title": "Trump Tariffs Seen Fostering New China-Global South Trade Order",
    "description": "President Donald Trump’s tariff war is accelerating Beijing’s trade and investment push into developing nations known as the Global South, according to research by S&P Global, potentially creating a new trade order dominated by Chinese firms.",
    "link": "https://www.ndtvprofit.com/world/trump-tariffs-seen-fostering-new-china-global-south-trade-order",
    "timestamp": "2025-08-19T04:46:33Z"
  },
  {
    "title": "SoftBank bets $2 billion on Intel’s comeback",
    "description": "SoftBank is set to invest $2 billion in Intel, becoming one of the company’s top-10 shareholders. The investment will be made at $23 per share, giving SoftBank a stake of just under 2% in the U.S. chipmaker. (Source: Reuters) Key Highlights",
    "link": "https://m.economictimes.com/markets/stocks/news/softbank-bets-2-billion-on-intels-comeback/key-highlights/slideshow/123378190.cms",
    "timestamp": "2025-08-19T04:45:57Z"
  },
  {
    "title": "Gavin Newsom Surges in 2028 Presidential Primary Poll",
    "description": "The poll comes as Newsom has taken a more aggressive position in standing up to President Donald Trump.",
    "link": "https://biztoc.com/x/9df37249529a9e74",
    "timestamp": "2025-08-19T04:45:53Z"
  },
  {
    "title": "Gavin Newsom Surges in 2028 Presidential Primary Poll",
    "description": "The poll comes as Newsom has taken a more aggressive position in standing up to President Donald Trump.",
    "link": "https://www.newsweek.com/primary-presidential-poll-newsom-surge-2115412",
    "timestamp": "2025-08-19T04:43:29Z"
  },
  {
    "title": "Tiffany Haddish Jokes She’s Running for President: ‘I’m Rich, I’ve Been Arrested a Few Times, I Always Say Crazy S–‘ | Video",
    "description": "\"I also will make it a crime to show up on time to a dinner party,\" the comedian says while guest-hosting \"Jimmy Kimmel Live\" \nThe post Tiffany Haddish Jokes She’s Running for President: ‘I’m Rich, I’ve Been Arrested a Few Times, I Always Say Crazy S–‘ | Vide…",
    "link": "https://www.thewrap.com/tiffany-haddish-jimmy-kimmel-live-run-for-president/",
    "timestamp": "2025-08-19T04:41:14Z"
  },
  {
    "title": "Responding to Trump invasion comments, Taiwan says must rely on itself for security",
    "description": "TAIPEI (Reuters) -Taiwan must rely on itself for its security, the island's foreign ministry said on Tuesday, responding to U.S. President Donald Trump...",
    "link": "https://www.yahoo.com/news/articles/responding-trump-invasion-comments-taiwan-043953289.html",
    "timestamp": "2025-08-19T04:39:53Z"
  },
  {
    "title": "Gold is more like Manhattan real estate than oil, according to Goldman Sachs",
    "description": "Unlike oil or gas, gold isn't consumed. It's accumulated.",
    "link": "https://markets.businessinsider.com/news/commodities/gold-price-today-forecast-goldman-sachs-manhattan-real-estate-comparison-2025-8",
    "timestamp": "2025-08-19T04:36:05Z"
  },
  {
    "title": "U.S. spy chief Gabbard says UK agreed to drop 'back door' mandate for Apple",
    "description": "U.S. Director of National Intelligence Tulsi Gabbard said on Monday the U.K. had agreed to drop its mandate for iPhone maker Apple to provide a \"back door\".",
    "link": "https://www.cnbc.com/2025/08/19/us-spy-chief-gabbard-says-uk-agreed-to-drop-back-door-mandate-for-apple.html",
    "timestamp": "2025-08-19T04:35:22Z"
  },
  {
    "title": "Morning Bid: Suits and smiles define new Ukraine talks",
    "description": "Volodymyr Zelenskiy dressed for success in his latest meeting with U.S. President Donald Trump at the White House.  Trump complimented Zelenskiy on his black...",
    "link": "https://finance.yahoo.com/news/morning-bid-suits-smiles-define-043515381.html",
    "timestamp": "2025-08-19T04:35:15Z"
  },
  {
    "title": "Trump Loyalist Andrew Bailey Joins FBI Leadership As Co-Deputy Director Amid Dan Bongino Epstein Clash And DOJ Turmoil",
    "description": "Missouri Attorney General Andrew Bailey, a staunch ally of President Donald Trump, has been appointed co-deputy director of the Federal Bureau of Investigation, joining conservative commentator Dan Bongino in a rare power-sharing arrangement at the bureau's t…",
    "link": "https://biztoc.com/x/3bb8dda9b8424514",
    "timestamp": "2025-08-19T04:34:24Z"
  },
  {
    "title": "Democrats get police escorts to prevent a new redistricting walkout as California moves to retaliate",
    "description": "Texas Democrats have ended a two-week walkout that stalled efforts to redraw congressional districts as part of a national partisan brawl over President Donald Trump’s desire to reshape U.S. House maps to his advantage",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-police-escorts-prevent-new-redistricting-walkout-california-124766827",
    "timestamp": "2025-08-19T04:34:06Z"
  },
  {
    "title": "Sam Altman says there was a big reason OpenAI released its open-weight models",
    "description": "\"It was clear that if we didn't do it, the world was gonna be mostly built on Chinese open source models,\" Altman said.",
    "link": "https://www.businessinsider.com/sam-altman-one-reason-openai-released-open-weight-models-2025-8",
    "timestamp": "2025-08-19T04:32:17Z"
  },
  {
    "title": "Intel gets $2 billion lifeline in the form of SoftBank equity investment",
    "description": "SoftBank is investing $2 billion in Intel. This will make SoftBank a top shareholder. However, SoftBank will not seek a board seat. Also, they will not commit to buying Intel chips. Intel shares are expected to rise. SoftBank shares are expected to fall. This…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/intel-gets-2-billion-lifeline-in-the-form-of-softbank-equity-investment/articleshow/123377759.cms",
    "timestamp": "2025-08-19T04:30:19Z"
  },
  {
    "title": "Dollar nudges higher ahead of Jackson Hole meeting and war talks",
    "description": "Wall Street and European shares were flat to marginally lower ­yesterday before a potentially eventful week for US interest-rate policy, even as attention turned to Washington where Ukraine’s Volodymyr Zelensky and European leaders were meeting US president D…",
    "link": "https://www.independent.ie/business/world/dollar-nudges-higher-ahead-of-jackson-hole-meeting-and-war-talks/a1503407896.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "Ksenia Samotiy: To Donald Trump, Russia is rich and powerful and Ukrainians are expendable chumps",
    "description": "Another few days of big meetings with uncertain outcomes. In following what is happening, as a Ukrainian, for me it’s an exhausting time – but it’s also a frustratingly wearying time just to be a European.",
    "link": "https://www.independent.ie/opinion/comment/ksenia-samotiy-to-donald-trump-russia-is-rich-and-powerful-and-ukrainians-are-expendable-chumps/a37861313.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "Thousands of Palestinians flee Gaza City ahead of new IDF offensive",
    "description": "Fearing an imminent Israeli ground offensive, thousands of Palestinians have left their homes in eastern areas of Gaza City, now under constant Israeli bombardment, for points to the west and south in the shattered territory.",
    "link": "https://www.independent.ie/world-news/middle-east/thousands-of-palestinians-flee-gaza-city-ahead-of-new-idf-offensive/a1320006258.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "Donald Trump targets mail ballots and voting machines ahead of next year’s mid-term election",
    "description": "US president Donald Trump pledged yesterday to issue an executive order to end the use of mail-in ballots and voting machines ahead of the 2026 mid-term elections, a move likely to disproportionately favour his Republican Party and spark legal challenges by s…",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-targets-mail-ballots-and-voting-machines-ahead-of-next-years-mid-term-election/a719590345.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Europe must not be supplicants in frightening new Trump-Putin world order",
    "description": "Volodymyr Zelensky’s return to Washington, with a posse of European heads of state in tow, was a symbol of solidarity.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-europe-must-not-be-supplicants-in-frightening-new-trump-putin-world-order/a789790681.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "Letters: Ukrainians just need to look to Crimea to see what reality of a ‘deal’ would be",
    "description": "Just imagine this scenario. An aggravated burglary has taken place and your children and belongings have been taken.",
    "link": "https://www.independent.ie/opinion/letters/letters-ukrainians-just-need-to-look-to-crimea-to-see-what-reality-of-a-deal-would-be/a194430154.html",
    "timestamp": "2025-08-19T04:30:00Z"
  },
  {
    "title": "Rupee rises 19 paise to 87.20 against US dollar in early trade",
    "description": "The rupee strengthened to 87.20 against the US dollar, buoyed by optimism surrounding domestic reforms and a rally in equities following PM Modi's tax reforms. Investor sentiment was further supported by suspected RBI intervention and cautious optimism regard…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-rises-19-paise-to-87-20-against-us-dollar-in-early-trade/articleshow/123377706.cms",
    "timestamp": "2025-08-19T04:27:09Z"
  },
  {
    "title": "Rupee rises 19 paise to 87.20 against US dollar in early trade",
    "description": "At the interbank foreign exchange market, the rupee opened at 87.24 against the US dollar, then touched 87.20, registering a gain of 19 paise over its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-rises-19-paise-to-8720-against-us-dollar-in-early-trade/article69950160.ece",
    "timestamp": "2025-08-19T04:25:44Z"
  },
  {
    "title": "PM Modi to meet China's top diplomat Wang Yi as Asian powers rebuild ties",
    "description": "Narendra Modi will meet with China's top diplomat amid easing tensions. The meeting aims to address the disputed border and trade resumption. This occurs alongside strained India-U.S. relations due to tariffs. Modi will also visit China for a summit. Both nat…",
    "link": "https://economictimes.indiatimes.com/news/defence/pm-modi-to-meet-chinas-top-diplomat-wang-yi-as-asian-powers-rebuild-ties/articleshow/123377667.cms",
    "timestamp": "2025-08-19T04:24:43Z"
  },
  {
    "title": "Trump administration in talks to take 10% stake in Intel: Reports",
    "description": "Trump, who said the meeting with Tan was \"very interesting,\" has taken an unprecedented approach to corporate interventions.",
    "link": "https://indianexpress.com/article/technology/trump-administration-in-talks-to-take-10-stake-in-intel-reports-10197779/",
    "timestamp": "2025-08-19T04:22:05Z"
  },
  {
    "title": "Trump tariffs seen fostering new China-Global South trade order",
    "description": "The tariff-led push comes while Chinese firms are seeking new markets abroad as the world’s second-largest economy slows, and as its companies seek to carve out manufacturing hubs for goods from electric vehicles to electronics",
    "link": "https://www.bloomberg.com/news/articles/2025-08-19/trump-tariffs-seen-fostering-new-china-global-south-trade-order",
    "timestamp": "2025-08-19T04:08:41Z"
  },
  {
    "title": "China says it will address India’s needs for fertilizers, rare earths, tunnel boring machines: Sources",
    "description": "The visit of the Chinese leader to India provides the two countries with an opportunity to review the bilateral ties, and it is also an appropriate time to exchange views on the global situation and some issues of mutual interest: Jaishankar",
    "link": "https://www.thehindubusinessline.com/news/world/china-says-it-will-address-indias-needs-for-fertilizers-rare-earths-tunnel-boring-machines-sources/article69950129.ece",
    "timestamp": "2025-08-19T04:05:45Z"
  },
  {
    "title": "Ukraine’s army should face no size limits – Macron",
    "description": "France has rejected Russia’s demand to impose size limits on the Ukrainian army Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623263-macron-ukrainian-army-size/",
    "timestamp": "2025-08-19T04:02:14Z"
  },
  {
    "title": "Democrats get police escorts to prevent a new redistricting walkout as California moves to retaliate",
    "description": "Texas Democrats who ended a walkout found themselves shadowed by law enforcement officers to keep them from repeating the protest that stalled Republican...",
    "link": "https://www.yahoo.com/news/articles/democrats-police-escorts-prevent-redistricting-040153287.html",
    "timestamp": "2025-08-19T04:01:53Z"
  },
  {
    "title": "Will ‘Peace’ In Ukraine Also Bring a New Détente?",
    "description": "Some observers in the lead-up to last week’s meeting between President Donald Trump and President Vladimir Putin in Anchorage Alaska hoped that a dialogue might be established where the broader issue of creating a new European security model that would reduce…",
    "link": "https://www.lewrockwell.com/2025/08/phil-giraldi/will-peace-in-ukraine-also-bring-a-new-detente/",
    "timestamp": "2025-08-19T04:01:00Z"
  },
  {
    "title": "The Haves and Have-Yachts. Dispatches on the Ultrarich: How Trump exploited mass-manipulation to stoke culture wars",
    "description": "Evan Osnos shows how social media is at the core of Republicans’ drive to destroy human empathy with maximum misinformation and minimum civil discourse",
    "link": "https://www.irishtimes.com/culture/books/review/2025/08/16/the-haves-and-have-yachts-dispatches-on-the-ultrarich-how-trump-exploited-mass-manipulation-to-stoke-culture-wars/",
    "timestamp": "2025-08-19T04:01:00Z"
  },
  {
    "title": "Europe Demands ‘Security Guarantees’ for Ukraine … Russia Can Give Those",
    "description": "Later today U.S. President Donald Trump will meet the (former) Ukrainian President Vladimir Zelenski to talk about the results of last week’s summit between Trump and Russia’s President Vladimir Putin. As a result of that summit both sides declared that the w…",
    "link": "https://www.lewrockwell.com/2025/08/no_author/europe-demands-security-guarantees-for-ukraine-russia-can-give-those/",
    "timestamp": "2025-08-19T04:01:00Z"
  },
  {
    "title": "Why Trump deserves credit for his Ukraine push — and why it may all fall apart",
    "description": "It was the best day Ukraine has had in a very long time. But it’s still hard to see how the war unleashed by Russia’s brutal invasion ends any time soon.",
    "link": "https://www.cnn.com/2025/08/19/politics/trump-zelensky-meeting-oval-office-putin-war-analysis",
    "timestamp": "2025-08-19T04:00:41Z"
  },
  {
    "title": "Tetramer Gets $12.5M For Soldier Protective Fabrics | DoS Approves M142 Sale To Bahrain | Germany Targets Over 8,000 Drones",
    "description": "Americas South Carolina-based company Tetramer Technologies has received a $12.5-million contract to integrate advanced metal-organic framework (MOF) bead technology into protective fabrics of combat-ready suits. Funded by the Pentagon-backed innovation netwo…",
    "link": "https://www.defenseindustrydaily.com/tetramer-gets-12-5m-for-soldier-protective-fabrics-dos-approves-m142-sale-to-bahrain-germany-targets-over-8000-drones-0243390/",
    "timestamp": "2025-08-19T04:00:37Z"
  },
  {
    "title": "WaPo joins Trump, comes out in favor of involuntary commitment",
    "description": "On Monday, August 18th, the Washington Post editorial board went fascist.  Or authoritarian.  I’m not sure which.  Some kind of -ist or -arian, I’m sure.\r\n\r\nBut in the context of homelessness they j...",
    "link": "https://www.americanthinker.com/blog/2025/08/wapo_joins_trump_comes_out_in_favor_of_involuntary_commitment.html",
    "timestamp": "2025-08-19T04:00:00Z"
  },
  {
    "title": "The obtuse Democrats",
    "description": "As we watch all those foreign leaders arrive at the White House, we realized that something else is going on in the District of Columbia. Not far from the scene, President Trump is winning another battle with the Democrats. Trump is talking about put...",
    "link": "https://www.americanthinker.com/blog/2025/08/the_illusive_democrats.html",
    "timestamp": "2025-08-19T04:00:00Z"
  },
  {
    "title": "Are James Comey's Taylor Swift ravings a new political con, or is he just weird?",
    "description": "Are James Comey's sudden babblings about how pop-tart singer Taylor Swift was his guide to life a sign that he knows he's legally up to his neck in alligators? Or is he just a weirdo? Seems both arguments have some truth. ...",
    "link": "https://www.americanthinker.com/blog/2025/08/are_comey_s_taylor_swift_ravings_a_new_political_con_or_is_he_just_weird.html",
    "timestamp": "2025-08-19T04:00:00Z"
  },
  {
    "title": "The DoJ's Record of Bias",
    "description": "The back-in-the-news Horowitz Report critiqued Robert Mueller’s investigation of the 2016 election, which alleged substantial “Russian interference,” further alleged to be aided and abetted by Donald Trump.\r\n\r\nWith that report ...",
    "link": "https://www.americanthinker.com/articles/2025/08/the_doj_s_record_of_bias.html",
    "timestamp": "2025-08-19T04:00:00Z"
  },
  {
    "title": "Comey’s passion for Taylor Swift explains so much about him and Democrats generally",
    "description": "James Comey, the 64-year-old former FBI director who was one of the most prominent players in the Russia Hoax, outed himself the other day: He’s a Taylor Swift fan. And he’s not just someone who says, “Her tunes are catchy.” O...",
    "link": "https://www.americanthinker.com/blog/2025/08/comey_s_passion_for_taylor_swift_explains_so_much_about_him_and_democrats_generally.html",
    "timestamp": "2025-08-19T04:00:00Z"
  },
  {
    "title": "Trump is playing both sides - but has taken peace talks a distance not seen since the war began",
    "description": "Talks between Donald Trump, Volodymyr Zelenskyy and European leaders have taken place at the White House, aimed at finding an end to the war in Ukraine.",
    "link": "https://news.sky.com/story/trump-is-playing-both-sides-but-has-taken-peace-talks-a-distance-not-seen-since-the-war-began-13414413",
    "timestamp": "2025-08-19T03:59:00Z"
  },
  {
    "title": "RIL, Airtel lift Sensex 200 pts higher, Nifty above 24,900",
    "description": "Indian stock markets, Sensex and Nifty, opened higher on Tuesday, building on Monday's gains, fueled by optimism surrounding potential GST reforms and progress in Russia-Ukraine peace talks. Reliance Industries and Bharti Airtel led the advances. Geojit Inves…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-airtel-lift-sensex-200-pts-higher-nifty-above-24900/articleshow/123377184.cms",
    "timestamp": "2025-08-19T03:58:40Z"
  },
  {
    "title": "Takeaways From Trump's Meeting With Zelenskyy And Europeans: Praise, Security Talks, More Meetings",
    "description": "President Donald Trump says the U.S. could support a European force in Ukraine to maintain a lasting peace in Russia's war.",
    "link": "https://www.huffpost.com/entry/russia-ukraine-war-what-to-know_n_68a3f5fae4b0c2c76f84bf0c",
    "timestamp": "2025-08-19T03:58:32Z"
  },
  {
    "title": "Ukraine: Zelenskyy 'ready' for talks with Putin",
    "description": "US President Donald Trump said he has contacted Russian President Vladimir Putin to arrange a meeting with Ukrainian President Volodymyr Zelenskyy, to be followed by a trilateral summit. Follow DW for the latest. US President Donald Trump is arranging a meeti…",
    "link": "https://www.dw.com/en/ukraine-zelenskyy-ready-for-talks-with-putin/live-73674493",
    "timestamp": "2025-08-19T03:54:00Z"
  },
  {
    "title": "‘I’m Glad He Took a Beating for the Rest of the City’: Jesse Watters Says Trump Had To Send National Guard to D.C. After ‘Big Balls’ Beatdown",
    "description": "Fox News host Jesse Watters claimed that President Donald Trump had no choice but to send the National Guard to Washington, D.C. after a \"Department of Government Efficiency\" employee got beaten up.\nThe post ‘I’m Glad He Took a Beating for the Rest of the Cit…",
    "link": "https://www.mediaite.com/media/tv/im-glad-he-took-a-beating-for-the-rest-of-the-city-jesse-watters-says-trump-had-to-send-national-guard-to-d-c-after-big-balls-beatdown/",
    "timestamp": "2025-08-19T03:51:35Z"
  },
  {
    "title": "Zelenskyy says he is ready for bilateral meeting with Putin to end war",
    "description": "WASHINGTON: Ukrainian President Volodymyr Zelenskyy said on Monday (Aug 19) he was willing to meet directly with his Russian counterpart to end the war. Speaking to reporters after talks with",
    "link": "https://www.channelnewsasia.com/world/volodymyr-zelenskyy-ready-bilateral-meeting-putin-end-war-russia-ukraine-donald-trump-us-europe-5301856",
    "timestamp": "2025-08-19T03:50:00Z"
  },
  {
    "title": "Las Vegas tourism is down. Some blame Trump’s tariffs and immigration crackdown",
    "description": "LAS VEGAS (AP) — Tourism in Las Vegas is slumping this summer, with resorts and convention centers reporting fewer visitors compared to last year, especially from abroad, and some officials are blaming the Trump administration’s tariffs and immigration polici…",
    "link": "https://financialpost.com/pmn/las-vegas-tourism-is-down-some-blame-trumps-tariffs-and-immigration-crackdown",
    "timestamp": "2025-08-19T03:46:56Z"
  },
  {
    "title": "North Korea's Kim calls for rapid nuclear buildup amid U.S.-South Korea exercises",
    "description": "North Korean leader Kim Jong Un said his country needed to rapidly expand its nuclear armament and called U.S.-South Korea military exercises an &quot;obvious expression of their will to provoke war,&quot; state media KCNA reported on Tuesday. South Korea and…",
    "link": "https://japantoday.com/category/world/north-korea%27s-kim-calls-for-rapid-nuclear-buildup-amid-us-south-korea-exercises",
    "timestamp": "2025-08-19T03:42:36Z"
  },
  {
    "title": "US spy chief Tulsi Gabbard says UK agreed to drop 'backdoor' mandate for Apple",
    "description": "US intelligence chief Tulsi Gabbard announced the UK has dropped its demand for Apple to create a backdoor to access encrypted data of American citizens. The decision follows months of talks involving Gabbard, President Trump, and Prime Minister Starmer. Appl…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-spy-chief-tulsi-gabbard-says-uk-agreed-to-drop-backdoor-mandate-for-apple/articleshow/123377035.cms",
    "timestamp": "2025-08-19T03:42:08Z"
  },
  {
    "title": "What is NATO’s Article 5, the collective defense guideline which Trump says will be used to protect Ukraine and can US attack Russia if war continues?",
    "description": "Trump announced Ukraine will receive US protection, foregoing NATO membership. Special U.S. Envoy Steve Witkoff claimed that Putin agreed to a US.-led security guarantee for Ukraine during the Alaska summit, resembling NATO's Article 5. While NATO membership …",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-natos-article-5-the-collective-defense-guideline-which-trump-says-will-be-used-to-protect-ukraine-and-can-us-attack-russia-if-war-continues/articleshow/123376923.cms",
    "timestamp": "2025-08-19T03:40:43Z"
  },
  {
    "title": "Commentary: TSMC shows no fear despite 300% tariff threat",
    "description": "US President Donald Trump recently announced that semiconductor tariffs could reach 300%, yet this has not triggered panic in the chip industry. Supply chain players stress that the market's primary concern is the impact on TSMC, but in reality, whether the t…",
    "link": "https://www.digitimes.com/news/a20250819PD215/tsmc-usa-manufacturing-donald-trump-tariffs.html",
    "timestamp": "2025-08-19T03:39:44Z"
  },
  {
    "title": "Zelensky says ready for bilateral meeting with Putin to end war",
    "description": "Ukrainian President Volodymyr Zelensky said Monday he was willing to meet directly with his Russian counterpart to end the war. Zelensky has come under increasing pressure to cede territory to end the grinding war, as Russia makes a series of advances.",
    "link": "https://economictimes.indiatimes.com/news/defence/zelensky-says-ready-for-bilateral-meeting-with-putin-to-end-war/articleshow/123376944.cms",
    "timestamp": "2025-08-19T03:37:44Z"
  },
  {
    "title": "Trump vows to change how elections are run. The US Constitution doesn't give him that power",
    "description": "President Donald Trump is vowing more changes to the way elections are conducted in the U.S., but based on the Constitution there is little to nothing he can do on his own",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-vows-change-elections-run-us-constitution-give-124758669",
    "timestamp": "2025-08-19T03:34:29Z"
  },
  {
    "title": "China assures India to address needs of rare earths, fertilisers, tunnel boring machines: Sources",
    "description": "During Chinese Foreign Minister Wang Yi’s visit to India, China assured it will address three key Indian concerns: access to rare earths, fertilisers, and tunnel boring machines. The assurance came in talks with Indian External Affairs Minister Dr. S. Jaishan…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/china-assures-india-to-address-needs-of-rare-earths-fertilisers-tunnel-boring-machines-sources/articleshow/123376766.cms",
    "timestamp": "2025-08-19T03:28:04Z"
  },
  {
    "title": "Battle for Ukraine becomes as much about Trump as it is the battlefield",
    "description": "On the tortured and land-mined road to peace in Ukraine, this remarkable day of lobbying at the White House is as close to a good day as you can get.",
    "link": "https://www.abc.net.au/news/2025-08-19/donald-trump-vital-to-ending-ukraine-war/105670818",
    "timestamp": "2025-08-19T03:27:33Z"
  },
  {
    "title": "H-1B crisis: Indian workers face mass green card denials amid PERM ‘sabotage’ blitz",
    "description": "As H-1B visa holders navigate mounting uncertainty under Donald Trump’s immigration crackdown, foreign tech workers now face a new threat: mass sabotage of the PERM process—crucial for securing U.S. green cards. A post on Team Blind, an anonymous professional…",
    "link": "https://freerepublic.com/focus/f-news/4335364/posts",
    "timestamp": "2025-08-19T03:22:22Z"
  },
  {
    "title": "Rubio Shares What One Thing Ukraine Needs ‘To Believe’ Before Conflict With Russia Can Officially End",
    "description": "Rubio said that for the conflict between Ukraine and Russia to officially end, key elements must include Ukraine feeling \"safe moving forward.\"",
    "link": "https://dailycaller.com/2025/08/18/marco-rubio-ukraine-negotiations-russia-donald-trump/",
    "timestamp": "2025-08-19T03:20:41Z"
  }
]