[
  {
    "title": "Trump Tariff on India: 25% tax to affect Apple's manufacturing plans? Will iPhones now cost more? What experts say",
    "description": "Trump on Wednesday announced a 25 per cent tariff on India, plus unspecified penalties for importing Russian oil. The Trump tariffs on India are slated to kick in from August 1.",
    "link": "https://www.livemint.com/companies/news/trump-tariff-on-india-25-tax-to-affect-apples-manufacturing-plans-will-iphones-now-cost-more-what-experts-say-11753932643244.html",
    "timestamp": "2025-07-31T05:07:15Z"
  },
  {
    "title": "Trump tariff on Indian goods will hike essential drugs costs in US: Pharmexcil",
    "description": "Pharmexcil warns that President Trump's 25% tariff on Indian goods, effective August 1, will increase the cost of essential drugs in the US. India supplies nearly 47% of US pharmaceutical needs, particularly in generics. Finding alternative sources matching I…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/trump-tariff-on-indian-goods-will-hike-essential-drugs-costs-in-us-pharmexcil/articleshow/123011477.cms",
    "timestamp": "2025-07-31T05:07:14Z"
  },
  {
    "title": "Trump says U.S.-Canada trade deal may be difficult after plan to back Palestine statehood",
    "description": "U.S. President Donald Trump said on Thursday it will be difficult to make a trade deal with Canada after the country announced it is backing Palestinian statehood.\nPrime Minster Mark Carney’s office did not immediately respond to a request for comment.",
    "link": "https://biztoc.com/x/f2c96b96ecf87b7e",
    "timestamp": "2025-07-31T05:05:03Z"
  },
  {
    "title": "The Muslim world has been strong on rhetoric, short on action over Gaza and Afghanistan",
    "description": "The Organisation of Islamic Cooperation is meant to be the ‘collective voice’ of the Muslim world. Yet it has been toothless on the most important crises.",
    "link": "https://theconversation.com/the-muslim-world-has-been-strong-on-rhetoric-short-on-action-over-gaza-and-afghanistan-262121",
    "timestamp": "2025-07-31T05:04:44Z"
  },
  {
    "title": "Trump administration to launch private health tracking system to improve records access",
    "description": "Trump administration to launch private health tracking system to improve records accessalaskasnewssource.com",
    "link": "https://www.alaskasnewssource.com/2025/07/31/trump-administration-launch-private-health-tracking-system-improve-records-access/",
    "timestamp": "2025-07-31T05:03:35Z"
  },
  {
    "title": "India oil refiners squeezed by anti-Russia push from US and EU",
    "description": "Indian refiners are facing pressure as the US and EU intensify efforts to curb Russian oil flows. President Trump announced a 25% tariff on Indian exports, criticizing its Russian imports. State-run refiners are rushing to secure alternative crude, including …",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-oil-refiners-squeezed-by-anti-russia-push-from-us-and-eu/articleshow/123011349.cms",
    "timestamp": "2025-07-31T05:01:58Z"
  },
  {
    "title": "Who’s most at risk from Trump’s 25% India tariffs and penalty",
    "description": "US tariffs crush New Delhi’s hopes of preferential treatment over the regional peers despite being among the first to engage Washington in trade talks",
    "link": "https://www.bloomberg.com/news/articles/2025-07-31/who-s-most-at-risk-from-trump-s-25-india-tariffs-and-penalty",
    "timestamp": "2025-07-31T05:00:49Z"
  },
  {
    "title": "Brown Reaches $50 Million Deal With White House to Restore Funds",
    "description": "Brown University has reached an agreement with President Donald Trump’s administration to restore research funding, becoming the latest elite university to strike a deal in the White House’s campaign to remake higher education. Brown said it will pay $50 mill…",
    "link": "https://www.insurancejournal.com/news/east/2025/07/31/833892.htm",
    "timestamp": "2025-07-31T05:00:01Z"
  },
  {
    "title": "Dr Morgan McMonagle: As a surgeon in Ireland, I had never seen “wounded child, no surviving family” on a hospital chart",
    "description": "A former colleague in Gaza is getting his children to lick salt before bed to stave off the hunger pangs. Even last spring, children were eating weeds and grass",
    "link": "https://www.irishtimes.com/opinion/2025/07/31/an-irish-surgeon-in-gaza-i-have-seen-tiny-bodies-ripped-apart-children-eating-grass/",
    "timestamp": "2025-07-31T05:00:01Z"
  },
  {
    "title": "The Jehovah’s Witnesses who left the faith and never looked back: ‘I was 37 and had only ever held a boy’s hand’",
    "description": "There can be severe social consequences to leaving your religion behind, but many continue to do it, spurred on by a desire to live and learn independently. Taz Ali meets the people who’ve used their freedom from faith to discover themselves for the very firs…",
    "link": "https://www.the-independent.com/life-style/jehovahs-witnesses-leaving-apostasy-b2798731.html",
    "timestamp": "2025-07-31T05:00:00Z"
  },
  {
    "title": "US AI policy risks disaster because of Trump",
    "description": "US president risks digital dust bowl with new rules",
    "link": "https://www.irishtimes.com/business/innovation/2025/07/31/us-ai-policy-risks-disaster-because-of-trump/",
    "timestamp": "2025-07-31T05:00:00Z"
  },
  {
    "title": "Credit Agricole Sa: Results for the second quarter and first half 2025 - The Group is accelerating its development",
    "description": "This press release comments on the results of Crédit Agricole S.A. and those of Crédit Agricole Group, which comprises the Crédit Agricole S.A. entities and the Crédit Agricole Regional Banks, which own 63.5% of Crédit Agricole S.A.",
    "link": "https://www.globenewswire.com/news-release/2025/07/31/3124646/0/en/Credit-Agricole-Sa-Results-for-the-second-quarter-and-first-half-2025-The-Group-is-accelerating-its-development.html",
    "timestamp": "2025-07-31T05:00:00Z"
  },
  {
    "title": "'China is preparing to invade Taiwan' - but there are questions over whether the island is ready",
    "description": "At a critical port on the Taiwanese island of Penghu, there is a sudden bang of explosions.",
    "link": "https://news.sky.com/story/china-is-preparing-to-invade-is-taiwan-ready-for-war-13394457",
    "timestamp": "2025-07-31T05:00:00Z"
  },
  {
    "title": "Trump Lashes Out at ‘Dead Economy’ India, Threatens ‘Failed Former President of Russia’ Dmitry Medvedev",
    "description": "President Donald Trump lashed out at India and threatened former Russian President Dmitry Medvedev in a late-night Truth Social post on Wednesday.\nThe post Trump Lashes Out at ‘Dead Economy’ India, Threatens ‘Failed Former President of Russia’ Dmitry Medvedev…",
    "link": "https://www.mediaite.com/politics/trump-lashes-out-at-dead-economy-india-threatens-failed-former-president-of-russia-dmitry-medvedev/",
    "timestamp": "2025-07-31T04:59:44Z"
  },
  {
    "title": "We can’t be sure 25% will be Trump’s final tariff; India should have taken tougher stand like China: Swaminathan Aiyar",
    "description": "Swaminathan Aiyar believes India's soft approach to Trump's trade policies failed. He contrasts this with China's firm stance. Aiyar suggests India should have been tougher from the start. He anticipates short-term market setbacks due to tariffs. He also note…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/we-cant-be-sure-25-will-be-trumps-final-tariff-india-should-have-taken-tougher-stand-like-china-swaminathan-aiyar/articleshow/123011287.cms",
    "timestamp": "2025-07-31T04:59:34Z"
  },
  {
    "title": "‘The NYPD Knows Exactly Who This Guy Is’: Lara Trump Warns Voters About Consequences Of Ignoring Mamdani’s Record",
    "description": "Lara Trump warned if voters overlook Mamdani’s shifting stance on law enforcement, the city will see a surge in crime.",
    "link": "https://dailycaller.com/2025/07/31/lara-trump-new-york-city-zohran-mamdani-voters-crime-nypd/",
    "timestamp": "2025-07-31T04:56:07Z"
  },
  {
    "title": "White House warns Starmer: Stop threatening US tech companies’ free speech",
    "description": "The White House has warned Sir Keir Starmer to stop threatening American tech companies amid mounting backlash over Britain’s online safety law. Members of Donald Trump’s administration are monitoring the Online Safety Act with “great interest and concern” af…",
    "link": "https://freerepublic.com/focus/f-news/4331772/posts",
    "timestamp": "2025-07-31T04:55:12Z"
  },
  {
    "title": "Trump says 'hard' to make deal with Canada after their Palestine decision",
    "description": "United States President Donald Trump criticized Canada after Prime Minister Mark Carney announced support for Palestinian statehood.\n\"Wow! Canada has just announced that it is backing statehood ...",
    "link": "https://biztoc.com/x/7276392b9382eea4",
    "timestamp": "2025-07-31T04:54:02Z"
  },
  {
    "title": "Trump’s Aug 1 tariff deadline is fast approaching. Here’s where the world stands.",
    "description": "United States President Donald Trump’s latest tariff deadline is rapidly approaching. Set to take effect on Friday (Aug 1), time is running out for countries to make a trade deal with Washington. Trump in April unveiled sweeping import taxes on goods coming i…",
    "link": "https://www.channelnewsasia.com/world/trump-aug-1-tariff-deadline-trade-deals-5269006",
    "timestamp": "2025-07-31T04:52:52Z"
  },
  {
    "title": "Trump says US does very little business with India, almost none with Russia",
    "description": "\"I don't care what India does with Russia\", he said in a Truth Social post on Thursday, adding that \"they can take their dead economies down together, for...",
    "link": "https://www.yahoo.com/news/articles/trump-says-us-does-very-045225480.html",
    "timestamp": "2025-07-31T04:52:25Z"
  },
  {
    "title": "India 10-year bond yield tests key level amid weaker rupee, hawkish Fed",
    "description": "Indian government bonds experienced a decline in early trading. This was influenced by a weakening rupee and cautious remarks from the U.S. Federal Reserve. The benchmark 10-year bond yield faced pressure. The rupee hit a six-month low. Investors are also wat…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/india-10-year-bond-yield-tests-key-level-amid-weaker-rupee-hawkish-fed/articleshow/123011210.cms",
    "timestamp": "2025-07-31T04:51:33Z"
  },
  {
    "title": "Crude oil trades lower after Wednesday’s gains",
    "description": "Crude oil futures, which rose on Wednesday due to US threats of secondary tariffs on countries importing crude oil from Russia, traded lower on Thursday morning. The decline followed an increase in US crude oil inventories last week.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-trades-lower-after-wednesdays-gains/article69876830.ece",
    "timestamp": "2025-07-31T04:48:40Z"
  },
  {
    "title": "Which Six Indian Companies Face US Sanctions Over Iran Oil Trade - Details Here",
    "description": "The United States has imposed sanctions on six Indian companies for allegedly engaging in trade involving oil and petrochemical products from Iran. The action is part of a broader crackdown on entities globally that the US claims are helping Iran bypass its s…",
    "link": "https://www.ndtvprofit.com/nation/which-six-indian-companies-face-us-sanctions-over-iran-oil-trade-details-here",
    "timestamp": "2025-07-31T04:47:42Z"
  },
  {
    "title": "Ford said it expects Trump's tariffs to set it back $2 billion and hand Japanese automakers a 'meaningful' edge",
    "description": "Jim Farley, Ford's CEO, said a Toyota 4Runner made in Japan could cost $10,000 less than a Ford Bronco made in Michigan.",
    "link": "https://www.businessinsider.com/ford-trump-tariffs-cost-2-billion-benefit-japanese-rivals-2025-7",
    "timestamp": "2025-07-31T04:44:42Z"
  },
  {
    "title": "Sensex, Nifty drop in opening trade on Trump’s 25% India tariff, penalty",
    "description": "Indian stock markets plummet after US tariffs announcement, sparking investor concerns and fears of economic slowdown.",
    "link": "https://www.thehindubusinessline.com/markets/sensex-nifty-drop-in-opening-trade-on-trumps-25-india-tariff-penalty/article69876816.ece",
    "timestamp": "2025-07-31T04:42:56Z"
  },
  {
    "title": "Trump Tariff: Petroleum Ministry Evaluates Russia Penalty; Awaits Executive Directive",
    "description": "The Ministry of Petroleum and Natural Gas is currently assessing the potential impact of U.S. President Donald Trump’s newly announced 25% tariff on Indian exports, which includes unspecified penalties for countries importing Russian crude. Senior government …",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariff-exclusive-petroleum-ministry-evaluates-russia-penalty-awaits-executive-directive",
    "timestamp": "2025-07-31T04:42:22Z"
  },
  {
    "title": "Samsung says US tariff agreement with South Korea reduces uncertainty, expects Tesla deal to boost orders",
    "description": "Samsung Electronics anticipates increased chip orders following a $16.5 billion deal with Tesla, despite reporting a significant drop in second-quarter operating profit due to AI chip delays and export restrictions. A new U.S. semiconductor factory in Texas i…",
    "link": "https://economictimes.indiatimes.com/news/international/business/samsung-says-us-tariff-agreement-reduces-uncertainty-expects-tesla-deal-to-boost-orders-trump/articleshow/123011037.cms",
    "timestamp": "2025-07-31T04:42:10Z"
  },
  {
    "title": "Triumphant in trade talks, Trump and his tariffs still face a challenge in federal court",
    "description": "President Donald Trump may have gotten his way with tariffs on some countries, but his overhaul of American trade policy has not gone unchallenged",
    "link": "https://abcnews.go.com/Business/wireStory/triumphant-trade-talks-trump-tariffs-face-challenge-federal-124231933",
    "timestamp": "2025-07-31T04:38:28Z"
  },
  {
    "title": "Chinese researchers suggest lasers and sabotage to counter Musk’s Starlink satellites",
    "description": "Chinese scientists have been developing strategies to counter Elon Musk's Starlink satellites, which they see as a threat",
    "link": "https://abcnews.go.com/Business/wireStory/chinese-researchers-suggest-lasers-sabotage-counter-musks-starlink-124231934",
    "timestamp": "2025-07-31T04:38:27Z"
  },
  {
    "title": "Asian shares are mixed after US stocks fall on weakened hopes for a September interest rate cut",
    "description": "MANILA, Philippines (AP) — Asian shares were mixed on Thursday after most U.S. stocks slipped, as doubts rose on Wall Street about whether the Federal Reserve will deliver economy-juicing cuts to interest rates by September. Japan’s Nikkei 225 rose 0.9% to 41…",
    "link": "https://financialpost.com/pmn/asian-shares-are-mixed-after-us-stocks-fall-on-weakened-hopes-for-a-september-interest-rate-cut",
    "timestamp": "2025-07-31T04:38:14Z"
  },
  {
    "title": "Trump Slams India-Russia Relations, Calls Both 'Dead Economies'",
    "description": "US President Donald Trump on Thursday said that he does not care about India's relations with Russia. Trump posted on Truth Social that India and Russia have \"dead economies\" and that the US has done very little business with India because of high tariffs.",
    "link": "https://www.ndtvprofit.com/economy-finance/dont-care-what-india-does-trump-slams-india-amid-relations-with-russia",
    "timestamp": "2025-07-31T04:34:43Z"
  },
  {
    "title": "Trump to announce US tariff rates tomorrow, will attend Asean Summit in Oct, says PM",
    "description": "Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/31/trump-to-announce-us-tariff-rates-tomorrow-will-attend-asean-summit-in-oct-says-pm",
    "timestamp": "2025-07-31T04:32:00Z"
  },
  {
    "title": "Trump blasts Medvedev, calls Indian, Russian economies 'dead'",
    "description": "United States President Donald Trump criticized India and Russia on Thursday, saying he doesn't care about their growing ties. He said the two countries could \"take their dead economies down ...",
    "link": "https://biztoc.com/x/cb3506955d442e8e",
    "timestamp": "2025-07-31T04:31:51Z"
  },
  {
    "title": "Russian Missile Strike Hits Ukrainian Military Training Area, Killing 3 Soldiers",
    "description": "Russian troops launched a missile strike on a Ukrainian military training unit, killing three and wounding at least 18, the Ukrainian military said on July 29.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250730-rferl03.htm",
    "timestamp": "2025-07-31T04:30:19Z"
  },
  {
    "title": "The long arc of an India-US trade deal could end in a win-win",
    "description": "Talks have turned complex as Trump seems bent on a one-sided deal that New Delhi may find hard to justify. Playing for extra-time past Trump’s 1 August bilateral deal deadline would afford us space to seek concessions that could soften a tariff blow.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariffs-india-us-trade-vietnam-deal-eu-negotiations-scott-bessent-china-talks-piyush-goyal-sitharaman-fm-11753858941510.html",
    "timestamp": "2025-07-31T04:30:03Z"
  },
  {
    "title": "Letters: My plan to help fix the housing crisis is outside the box, but it’s worth a shot",
    "description": "President Franklin D Roosevelt came up with a solution for the shortage of labour to build large projects when he ordered the construction of dams, highways and schools all over America. Workers flocked to these sites and were housed in temporary’ compounds b…",
    "link": "https://www.independent.ie/opinion/letters/letters-my-plan-to-help-fix-the-housing-crisis-is-outside-the-box-but-its-worth-a-shot/a9946578.html",
    "timestamp": "2025-07-31T04:30:00Z"
  },
  {
    "title": "Tata Motors shares drop over 2%: What’s behind the decline and is it time to invest?",
    "description": "Tata Motors shares: Investor sentiment took a hit under the pressure of U.S. President Donald Trump’s proposed 25% reciprocal tariffs, dragging the stock lower.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-drop-over-2-whats-behind-the-decline-and-is-it-time-to-invest/articleshow/123010725.cms",
    "timestamp": "2025-07-31T04:19:45Z"
  },
  {
    "title": "India, Russia can take their 'dead' economies down together: Trump attacks New Delhi-Moscow ties amid US tariff move",
    "description": "Donald Trump has sharply criticized India and Russia, labeling them as \"dead economies\" and expressing a lack of interest in trade relations. He announced a 25% tariff on India and additional penalties for strategic trade with Russia. Trump claimed minimal bu…",
    "link": "https://economictimes.indiatimes.com/news/india/india-russia-can-take-their-dead-economies-down-together-trump-attacks-new-delhi-moscow-ties-amid-us-tariff-move/articleshow/123010590.cms",
    "timestamp": "2025-07-31T04:13:30Z"
  },
  {
    "title": "Hoax on Hoax? Ex-CIA Official Susan Miller Was Not an Author of Key Intelligence Community Assessment, as Claimed",
    "description": "In response to last week’s damning official document release about a now-infamous intelligence document that helped launch years of Russiagate madness, CNN wrote: Retired CIA official Susan Miller, an author of the agency’s 2017 intelligence report on Russian…",
    "link": "https://freerepublic.com/focus/f-news/4331765/posts",
    "timestamp": "2025-07-31T04:10:44Z"
  },
  {
    "title": "From lasers to deepfakes: Inside China’s battle plan to counter world's richest man, Elon Musk's Starlink",
    "description": "Chinese military and government researchers have published dozens of studies detailing how to counter Elon Musk’s Starlink satellite network. From space lasers to supply chain interference, Beijing is working on multiple fronts to tackle what it sees as a gro…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/from-lasers-to-deepfakes-inside-chinas-battle-plan-to-counter-worlds-richest-man-elon-musks-starlink/articleshow/123010615.cms",
    "timestamp": "2025-07-31T04:10:37Z"
  },
  {
    "title": "Trump tariff on Indian goods will hike essential drugs costs in US: Pharmexcil",
    "description": "US market heavily reliant on India for Active Pharmaceutical Ingredients and low-cost generics, will struggle to find alternative sources, says Pharmexcil Chairman Namit Joshi",
    "link": "https://www.thehindubusinessline.com/news/world/trump-tariff-on-indian-goods-will-hike-essential-drugs-costs-in-us-pharmexcil/article69876769.ece",
    "timestamp": "2025-07-31T04:07:57Z"
  },
  {
    "title": "US-Malaysia tariff deal expected after Trump-Anwar phone call, says report",
    "description": "PETALING JAYA: With the Aug 1 deadline looming for the 25 per cent US tariffs on Malaysian goods, a phone call between the White House and Putrajaya has helped strike a deal to slash the import tax, according to a news report. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/31/us-malaysia-tariff-deal-expected-after-trump-anwar-phone-call-says-report",
    "timestamp": "2025-07-31T04:07:00Z"
  },
  {
    "title": "Do Palestinians deserve a State only if they are Genocided?",
    "description": "Voices around the world are saying: it’s now or never for a Palestinian state. ( Foreign Policy in Focus ) - Most Israelis are too focused on the atrocities that Hamas committed on October 7 to acknowledge, much less denounce, the atrocities their government …",
    "link": "https://www.juancole.com/2025/07/palestinians-deserve-genocided.html",
    "timestamp": "2025-07-31T04:06:51Z"
  },
  {
    "title": "Trump may be Abandoning Climate Fight, but New Leaders, including China, are Emerging",
    "description": "By Shannon Gibson, USC Dornsife College of Letters, Arts and Sciences (The Conversation) - When President Donald Trump announced in early 2025 that he was withdrawing the U.S. from the Paris climate agreement for the second time, it triggered fears that the m…",
    "link": "https://www.juancole.com/2025/07/abandoning-including-emerging.html",
    "timestamp": "2025-07-31T04:04:12Z"
  },
  {
    "title": "D-Street investors lose over Rs 5 lakh crore in 15 mins as Sensex tumbles 600 pts on Trump’s tariff move",
    "description": "Indian benchmark indices experienced a sharp decline on Thursday morning following President Trump's threat to impose a 25% tariff on Indian goods starting August 1, coupled with an unspecified penalty. The BSE Sensex fell by 0.74% and the Nifty50 dropped by …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-investors-lose-over-rs-5-lakh-crore-in-15-mins-as-sensex-tumbles-600-pts-on-trumps-tariff-move/articleshow/123010479.cms",
    "timestamp": "2025-07-31T04:04:08Z"
  },
  {
    "title": "Juan Williams Suggests Real Reason Kamala Isn’t Running For Governor",
    "description": "Juan Williams suggested on Fox News Wednesday thatKamala Harris' decision not to run for governor of California stems from internal polling numbers.",
    "link": "https://dailycaller.com/2025/07/31/juan-williams-kamala-harris-running-governor/",
    "timestamp": "2025-07-31T04:03:38Z"
  },
  {
    "title": "Chinese researchers suggest lasers and sabotage to counter Musk’s Starlink satellites",
    "description": "Chinese government and military scientists, concerned about Starlink’s potential use by adversaries in a military confrontation and for spying, have...",
    "link": "https://www.yahoo.com/news/articles/chinese-researchers-suggest-lasers-sabotage-040227175.html",
    "timestamp": "2025-07-31T04:02:27Z"
  },
  {
    "title": "Over $25 billion of Indian exports dodge Trump’s new tariffs as pharma, smartphones stay duty-free",
    "description": "The rise in US's share in Indian exports were driven not just by exporters front-loading shipments ahead of upcoming tariffs, but also thanks to the exemptions granted to key sectors like smartphones and pharmaceuticals from the 10% baseline levy. These secto…",
    "link": "https://www.moneycontrol.com/news/business/over-25-billion-of-indian-exports-dodge-trump-s-new-tariffs-as-pharma-smartphones-stay-duty-free-13353586.html",
    "timestamp": "2025-07-31T04:01:35Z"
  },
  {
    "title": "Trump’s frayed relationships with Putin and Netanyahu are impeding his foreign agenda",
    "description": "President Donald Trump hasn’t found his recent phone calls with war-entangled leaders encouraging.",
    "link": "https://www.cnn.com/2025/07/31/politics/trump-putin-netanyahu-war-russia-israel",
    "timestamp": "2025-07-31T04:00:42Z"
  },
  {
    "title": "Why the EU-US ‘deal’ hasn’t really been agreed",
    "description": "Disagreements over steel, pharma, and alcohol exports \"reflect the extremely short time-frame and generally chaotic nature of the deal – if you want to call it that, because it’s not really a deal,” one analyst noted",
    "link": "https://www.euractiv.com/section/economy-jobs/news/why-the-eu-us-is-deal-hasnt-really-been-agreed/",
    "timestamp": "2025-07-31T04:00:09Z"
  },
  {
    "title": "Trump Accounts: 'The backdoor for privatizing Social Security'",
    "description": "Herman Cain lives!\r\n\r\nThe late great Republican Tea Party leader, CEO, and former chairman of the Kansas City Federal Reserve was derided in his 2012 presidential campaign for his",
    "link": "https://www.americanthinker.com/blog/2025/07/trump_accounts_the_backdoor_for_privatizing_social_security.html",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene ran against the swamp. Then she got rich in it",
    "description": "Rep. Marjorie Taylor Greene, a Republican representing Georgia, built her brand by claiming to fight for forgotten Americans. She stormed into Congress on the promise of taking down the elites and draining the swamp. But when you follow the...",
    "link": "https://www.americanthinker.com/blog/2025/07/marjorie_taylor_greene_ran_against_the_swamp_then_she_got_rich_in_it.html",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "Today’s Advertising: The Good, The Bad and the Really Bone-Deep Ugly",
    "description": "There are television ads – and ad trends – that confuse many viewers. \r\n\r\nEither they don’t know who the ad is targeting … could it be them? … or if it really works at all? \r\n\r\nIf you don’t have experie...",
    "link": "https://www.americanthinker.com/articles/2025/07/today_s_advertising_the_good_the_bad_and_the_really_bone_deep_ugly.html",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "Elect Curtis Sliwa New York City Mayor",
    "description": "Custis Sliwa CAN win New York City’s mayoral race in November.\r\n\r\nLet’s go back to June 2015, in the days immediately after Donald Trump descended the Trump Tower escalator and announced he was running for president. Do you remember all t...",
    "link": "https://www.americanthinker.com/articles/2025/07/elect_curtis_sliwa_new_york_city_mayor.html",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "European unity would have broken down in a trade war with the US",
    "description": "France is attacking 15% tariff deal, yet like Ireland had wanted Brussels to water down retaliatory measures",
    "link": "https://www.irishtimes.com/world/europe/2025/07/31/european-unity-would-have-broken-down-in-a-trade-war-with-the-us/",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "Brussels’ partisan warfare",
    "description": "The trade agreement between the U.S. and the EU seemed like a done deal. But now, voices in Brussels and EU capitals are demanding renegotiations. A weeks-long impasse over digital censorship and climate policy looms.\r\n\r\nThe EU’s negotiation st...",
    "link": "https://www.americanthinker.com/blog/2025/07/brussels_partisan_warfare.html",
    "timestamp": "2025-07-31T04:00:00Z"
  },
  {
    "title": "Search for answers after Texas' deadly floods brings lawmakers to devastated Hill Country",
    "description": "Texas lawmakers are expected to question local Kerr County officials on Thursday over their preparedness and response to the deadly July 4 floods that killed at least 136 people",
    "link": "https://abcnews.go.com/Politics/wireStory/search-answers-after-texas-deadly-floods-brings-lawmakers-124231174",
    "timestamp": "2025-07-31T03:58:32Z"
  },
  {
    "title": "How Brazil came so close to a coup",
    "description": "Brazil is a good example of how Trump thinks that he can use the power of the US government to pursue his personal vendettas. In this case, he is imposing tariffs on that country because it is prosecuting the former president Jair Bolsonaro for fomenting a co…",
    "link": "https://freethoughtblogs.com/singham/2025/07/30/how-brazil-came-so-close-to-a-coup/",
    "timestamp": "2025-07-31T03:57:44Z"
  },
  {
    "title": "Kamala Harris announces if she’ll run for California governor: ‘I love this state and its promise’",
    "description": "Former Vice President Kamala Harris has weighed in on whether she’ll run for California governor in the 2026 gubernatorial race.  There have been months of speculation on whether the former Democratic nominee would join the 2026 gubernatorial race in the race…",
    "link": "https://www.thepinknews.com/2025/07/31/kamala-harris-california-governor/",
    "timestamp": "2025-07-31T03:56:38Z"
  },
  {
    "title": "NYT NUMBSKULLERY: Today's 3 Percent Growth Is Bad, 1.1 Percent Under Biden Was Good",
    "description": "No matter what happens in President Donald Trump’s economy, you can bet your bottom dollar that The New York Times hacks will find some way to splatter it with bad news, even when it's easily demonstrated these partisans offered a very different spin under De…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331763/posts",
    "timestamp": "2025-07-31T03:56:29Z"
  },
  {
    "title": "Canada plans to recognize Palestinian state in September, PM Carney says",
    "description": "Canada plans to recognize a Palestinian state in September during a meeting of the United Nations, Canadian Prime Minister Mark Carney said.",
    "link": "https://www.foxnews.com/world/canada-plans-recognize-palestinian-state-september-pm-carney-says",
    "timestamp": "2025-07-31T03:54:25Z"
  },
  {
    "title": "Trump’s deal with Pakistan raises a big question: Does India’s arch-rival really have large oil reserves? Here’s what we know",
    "description": "Trump Pakistan Deal: Donald Trump announced a new energy deal between the U.S. and Pakistan, hinting at potential oil sales to India despite recent tariffs. Pakistan's current proven reserves are modest, but seismic surveys suggest significant offshore potent…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trumps-deal-with-pakistan-raises-a-big-question-does-indias-arch-rival-really-have-large-oil-reserves-heres-what-we-know/articleshow/123010126.cms",
    "timestamp": "2025-07-31T03:52:30Z"
  },
  {
    "title": "Epstein Victim's Family Calls Trump Comment on Virginia Giuffre 'Shocking'",
    "description": "The family said the president should not pardon imprisoned sex offender Ghislaine Maxwell.",
    "link": "https://www.newsweek.com/trump-epstein-giuffre-maxwell-2106744",
    "timestamp": "2025-07-31T03:52:13Z"
  },
  {
    "title": "Laos Braced For Blow Of Trump Tariff Threat",
    "description": "Hawking clothes outside the garment factory where her daughter toils inside, a Laos vendor weighs US President Donald Trump's threat of trade tariffs that may soon snarl both their livelihoods.",
    "link": "https://www.ibtimes.com/laos-braced-blow-trump-tariff-threat-3779886",
    "timestamp": "2025-07-31T03:51:19Z"
  },
  {
    "title": "Laos Braced For Blow Of Trump Tariff Threat",
    "description": "Hawking clothes outside the garment factory where her daughter toils inside, a Laos vendor weighs US President Donald Trump's threat of trade tariffs that may soon snarl both their livelihoods.",
    "link": "https://www.ibtimes.com.au/laos-braced-blow-trump-tariff-threat-1859902",
    "timestamp": "2025-07-31T03:51:14Z"
  },
  {
    "title": "Trump’s tariff deadline is near. Here’s a look at countries that have a deal — and those that don't",
    "description": "The U.S. has managed to make only eight deals in 120 days, including one with the 27-member European Union.",
    "link": "https://www.cnbc.com/2025/07/31/trumps-aug-1-tariff-deadline-those-who-have-and-havent-signed-deal.html",
    "timestamp": "2025-07-31T03:49:02Z"
  },
  {
    "title": "India Oil Refiners Squeezed by Anti-Russia Push From US and EU",
    "description": "Indian oil refiners are being hemmed in by both the US and European Union’s stepped-up efforts to target Russian energy flows, with processors scrambling to buy crude from other sources.",
    "link": "https://financialpost.com/pmn/business-pmn/india-oil-refiners-squeezed-by-anti-russia-push-from-us-and-eu",
    "timestamp": "2025-07-31T03:47:46Z"
  },
  {
    "title": "Pakistan says deal concluded with US on tariffs, Trump cites oil reserves agreement",
    "description": "The U.S. and Pakistan have reached an agreement involving reduced tariffs for Pakistan and U.S. assistance in developing Pakistan's oil reserves. The trade deal aims to foster economic collaboration in energy, IT, and other sectors, potentially lowering tarif…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pakistan-says-deal-concluded-with-us-on-tariffs-trump-cites-oil-reserves-agreement/articleshow/123010257.cms",
    "timestamp": "2025-07-31T03:47:42Z"
  },
  {
    "title": "Trump announces massive oil deal with Pakistan",
    "description": "‘We are in the process of choosing the oil company that will lead this partnership; Who knows, maybe they’ll be selling oil to India some day’",
    "link": "https://www.thehindubusinessline.com/news/world/trump-announces-massive-oil-deal-with-pakistan/article69876732.ece",
    "timestamp": "2025-07-31T03:47:29Z"
  },
  {
    "title": "Trump Leaves 'Good Friend' India In The Cold, Strikes Trade Deal With Arch Rival Pakistan Over 'Massive Oil Reserves'",
    "description": "President Donald Trump announced that the United States has concluded a deal with Pakistan, centered around developing the nation’s “massive oil reserves.”\nWhat Happened: On Wednesday, in a post on Truth Social, Trump said, “We have just concluded a Deal with…",
    "link": "https://biztoc.com/x/5b3fdf28c6aa15a1",
    "timestamp": "2025-07-31T03:47:08Z"
  },
  {
    "title": "US senator plans trip to Taiwan as Trump’s interest in island cools: Report",
    "description": "Report says US Senator Roger Wicker may visit Taiwan after President William Lai Ching-te cancelled Latin America trip.",
    "link": "https://www.aljazeera.com/news/2025/7/31/us-senator-plans-trip-to-taiwan-as-trumps-interest-in-island-cools-report",
    "timestamp": "2025-07-31T03:44:50Z"
  },
  {
    "title": "Rupee At Five-Month Low On Trump Tariffs Impact",
    "description": "The Indian rupee opened weaker on Thursday at 87.69 against the U.S. dollar, slipping from Wednesday’s close of 87.42 and marking its lowest level in five months.  The decline follows heightened geopolitical and trade tensions triggered by U.S. President Dona…",
    "link": "https://www.ndtvprofit.com/markets/trump-tariffs-impact-rupee-hits-five-month-low",
    "timestamp": "2025-07-31T03:39:07Z"
  },
  {
    "title": "TikTok launches crowd-sourced debunking tool in US",
    "description": "Washington (AFP) July 30, 2025 -\n\n TikTok on Wednesday rolled out a crowd-sourced debunking system in the United States, becoming the latest tech platform to adopt a community-driven approach to combating online misinformation.\n\nFootnotes, a feature that the …",
    "link": "https://www.spacewar.com/reports/TikTok_launches_crowd-sourced_debunking_tool_in_US_999.html",
    "timestamp": "2025-07-31T03:37:49Z"
  },
  {
    "title": "Trump allegedly won't extend trade deal deadline",
    "description": "United States President Donald Trump will sign executive orders on Thursday to impose higher tariffs on countries that fail to secure trade agreements by Friday's deadline, Politico reported, citi...",
    "link": "https://biztoc.com/x/16e9c04f025865d0",
    "timestamp": "2025-07-31T03:36:12Z"
  },
  {
    "title": "China summons chip giant Nvidia over alleged security risks",
    "description": "Beijing (AFP) July 31, 2025 -\n\n Chinese authorities summoned Nvidia representatives on Thursday to discuss \"serious security issues\" over some of its artificial intelligence chips, as the US tech giant finds itself entangled in trade tensions between Beijing …",
    "link": "https://www.spacedaily.com/reports/China_summons_chip_giant_Nvidia_over_alleged_security_risks_999.html",
    "timestamp": "2025-07-31T03:35:28Z"
  },
  {
    "title": "‘Sleepy Don’: People Sure Think Trump Was Starting To Doze Off On Camera",
    "description": "The president had a case of heavy eyelids during a White House event.",
    "link": "https://www.huffpost.com/entry/trump-asleep-event_n_688acd47e4b015c1f1ba341e",
    "timestamp": "2025-07-31T03:34:46Z"
  },
  {
    "title": "Senate Confirms Special Forces Vet Joe Kent to Lead National Counterterrorism Center",
    "description": "The Senate voted 52-44 to confirm former special operations soldier Joe Kent to serve as the Director of the National Counterterrorism Center (NCTC).\nThe post Senate Confirms Special Forces Vet Joe Kent to Lead National Counterterrorism Center appeared first …",
    "link": "https://www.breitbart.com/politics/2025/07/30/senate-confirms-special-forces-vet-joe-kent-to-lead-national-counterterrorism-center/",
    "timestamp": "2025-07-31T03:34:22Z"
  },
  {
    "title": "Ford says Trump tariffs to cost it $2bn this year",
    "description": "It is the latest indication of the impact of US President Donald Trump's tariffs on big American firms.",
    "link": "https://www.bbc.co.uk/news/articles/cn47v5gj1nvo",
    "timestamp": "2025-07-31T03:33:14Z"
  },
  {
    "title": "Abby Phillip Reaches Wits’ End With MAGA Pundit Scott Jennings: ‘Completely Disingenuous’",
    "description": "CNN NewsNight host Abby Phillip called out colleague Scott Jennings for some sleight of hand when defending President Donald Trump's tariffs on Wednesday's show. \nThe post Abby Phillip Reaches Wits’ End With MAGA Pundit Scott Jennings: ‘Completely Disingenuou…",
    "link": "https://www.mediaite.com/media/tv/abby-phillip-reaches-wits-end-with-maga-pundit-scott-jennings-completely-disingenuous/",
    "timestamp": "2025-07-31T03:32:17Z"
  },
  {
    "title": "Ford says Trump tariffs to cost it about $2bn this year",
    "description": "It is the latest indication of the impact of US President Donald Trump's tariffs on big American firms.",
    "link": "https://www.bbc.com/news/articles/cn47v5gj1nvo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-31T03:32:15Z"
  },
  {
    "title": "California governor signs executive order to support boys and men and improve their mental health",
    "description": "California Gov. Gavin Newsom has signed an executive order aimed at supporting men and boys and improving their mental health outcomes.",
    "link": "https://www.pressdemocrat.com/article/news/california-governor-signs-executive-order-to-support-boys-and-men-and-impro/",
    "timestamp": "2025-07-31T03:31:21Z"
  },
  {
    "title": "Porsche profits fall 67% to RM4.9bil in 1H 2025 over slumping demand in China, impact from US tariffs",
    "description": "Porsche is well known for being one of the most profitable carmakers in the world, but even it can’t shake off global trade headwinds. The sports car maker posted a 6.7% decrease in sales revenue […]\nThe post Porsche profits fall 67% to RM4.9bil in 1H 2025 ov…",
    "link": "https://paultan.org/2025/07/31/porsche-profits-fall-67-to-rm4-9bil-in-1h-2025-over-slumping-demand-in-china-impact-from-us-tariffs/",
    "timestamp": "2025-07-31T03:30:30Z"
  },
  {
    "title": "Most Markets Down As Fed Holds And Trump Announces Fresh Tariffs",
    "description": "Asian markets mostly fell Thursday while the dollar held most of its gains as traders weighed a cautious Federal Reserve with strong tech earnings and Donald Trump's tariffs on key economies South Korea and India.",
    "link": "https://www.ibtimes.com/most-markets-down-fed-holds-trump-announces-fresh-tariffs-3779883",
    "timestamp": "2025-07-31T03:30:17Z"
  },
  {
    "title": "Seth Meyers Has Finally Found A World Where Late-Night Talk Shows Are Thriving",
    "description": "It’s in ‘Digman!,’ the animated series starring his old ‘SNL’ pal Andy Samberg",
    "link": "https://www.cracked.com/article_47632_seth-meyers-has-finally-found-a-world-where-late-night-talk-shows-are-thriving.html",
    "timestamp": "2025-07-31T03:30:00Z"
  },
  {
    "title": "Most markets down as Fed holds and Trump announces fresh tariffs",
    "description": "Asian markets mostly fell Thursday while the dollar held most of its gains as traders weighed a cautious Federal Reserve with strong tech earnings and Donald...",
    "link": "https://finance.yahoo.com/news/most-markets-down-fed-holds-032850960.html",
    "timestamp": "2025-07-31T03:28:50Z"
  },
  {
    "title": "PM would not want to take accountability for 25% tariffs: Congress MP Pramod Tiwari",
    "description": "Amidst opposition walkout, Congress MP Pramod Tiwari criticizes PM Modi regarding US tariffs. Donald Trump stated trade negotiations with India are ongoing. Trump announced a 25% tariff on India starting August 1, citing high tariffs and Russian oil purchases…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pm-would-not-want-to-take-accountability-for-25-tariffs-congress-mp-pramod-tiwari/articleshow/123009916.cms",
    "timestamp": "2025-07-31T03:20:45Z"
  },
  {
    "title": "Trump-Russia probe whistleblower ‘pressured’ by Obama intel officials to sign off of 2016 election report: ‘I need you to say you agree’",
    "description": "“Isn’t it possible Putin has something on Trump, to blackmail and coerce him?” the whistleblower was told. ”You need to TRUST ME on this.”",
    "link": "https://nypost.com/2025/07/30/us-news/trump-russia-probe-whistleblower-pressured-by-obama-intel-officials-to-sign-off-of-2016-election-report-i-need-you-to-say-you-agree/",
    "timestamp": "2025-07-31T03:17:27Z"
  },
  {
    "title": "US Congressmen Point to Trade Potential After Sheinbaum Meeting",
    "description": "Two US lawmakers who met with Mexico’s President Claudia Sheinbaum Wednesday pointed to opportunities to expand trade between the two countries, days before higher American tariffs are set to come into effect.",
    "link": "https://financialpost.com/pmn/business-pmn/us-congressmen-point-to-trade-potential-after-sheinbaum-meeting",
    "timestamp": "2025-07-31T03:17:08Z"
  },
  {
    "title": "Trump tariff threat to hurt Indian rupee, bonds to see spillover impact",
    "description": "Indian government bonds are predicted to decline, potentially pushing yields past key levels, influenced by a weakening rupee and hawkish signals from the U.S. Federal Reserve. Concerns arise from potential tariffs threatened by President Trump, adding strain…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/trump-tariff-threat-to-hurt-indian-rupee-bonds-to-see-spillover-impact/articleshow/123009865.cms",
    "timestamp": "2025-07-31T03:16:48Z"
  },
  {
    "title": "Trump signs order to justify 50% tariffs on Brazil",
    "description": "Donald Trump has imposed tariffs on Brazil. He claims an economic emergency. This is due to Brazil's policies and the prosecution of Jair Bolsonaro. The tariffs are 50%. Some goods are excluded. The US had a trade surplus with Brazil last year. The US Treasur…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-order-to-justify-50-tariffs-on-brazil/articleshow/123009756.cms",
    "timestamp": "2025-07-31T03:08:10Z"
  },
  {
    "title": "Trump’s 25% Tariff Shock: IT, Pharma, Steel Among Sectors Likely To Be Hit",
    "description": "Trump's 25% tariff on all Indian imports from August 1 is expected to trigger volatility in key export-driven sectors with significant US exposure",
    "link": "https://www.news18.com/business/markets/trumps-25-tariff-shock-it-pharma-steel-among-sectors-likely-to-be-hit-stocks-in-focus-9474661.html",
    "timestamp": "2025-07-31T03:07:50Z"
  },
  {
    "title": "Mark Carney Says Canada for Palestinian State; Hostage Families Condemn",
    "description": "Families of Israeli hostages condemned the premature move to recognize a Palestinian state while their loved ones were still in captivity.\nThe post Mark Carney Says Canada for Palestinian State; Hostage Families Condemn appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/07/30/mark-carney-says-canada-for-palestinian-state-hostage-families-condemn/",
    "timestamp": "2025-07-31T03:03:31Z"
  },
  {
    "title": "Utahns weigh in on Trump’s job performance and key issues six months in",
    "description": "In a new Deseret News/Hinckley Institute poll voters in Utah were split on how the president is doing on key issues.",
    "link": "https://www.deseret.com/politics/2025/07/30/utahns-split-trump-economic-promises-survey/",
    "timestamp": "2025-07-31T03:01:26Z"
  },
  {
    "title": "Trump says Canada's Palestine stance may hurt trade deal",
    "description": "US President Donald Trump has said it will be difficult to make a trade deal with Canada, after the country announced it is backing Palestinian statehood.",
    "link": "https://www.rte.ie/news/world/2025/0731/1526226-canada-middle-east/",
    "timestamp": "2025-07-31T03:00:00Z"
  }
]