[
  {
    "title": "We’re Not Saying You Should Ruin Trump’s White House Christmas, But …",
    "description": "First lady Melania Trump—who five years ago asked, “Who gives a fuck about Christmas?”—is hosting open auditions for the White House’s upcoming Christmas celebration.Now we’re not saying that you should apply, get selected, and then not show up on the date of…",
    "link": "https://newrepublic.com/post/198807/trump-white-house-christmas-auditions",
    "timestamp": "2025-08-04T20:57:41Z"
  },
  {
    "title": "Save Evyatar, Mr. President | Red Hot Takes",
    "description": "Hamas forced emaciated Israeli hostage Evyatar David to dig his own grave in a sick new propaganda video, as the twisted terror group continued to stall negotiations to release the remaining living captives. In the nearly 5-minute clip released on Aug. 1, the…",
    "link": "https://nypost.com/video/save-evyatar-mr-president-red-hot-takes/",
    "timestamp": "2025-08-04T20:57:33Z"
  },
  {
    "title": "Trump Admin Says It Will Hold Disaster Prep Dollars From Cities, States Boycotting Israel",
    "description": "Cities and states that boycott Israeli companies will be ineligible for federal disaster preparedness aid, according to new DHS funding guidelines.",
    "link": "https://dailycaller.com/2025/08/04/trump-admin-hold-disaster-prep-dollars-cities-states-boycotting-israel/",
    "timestamp": "2025-08-04T20:56:12Z"
  },
  {
    "title": "From Gawker sex tape to MAGA turn: Hulk Hogan was no stranger to controversy inside and outside the ring",
    "description": "Hogan was a wrestling icon, but he was never far from scandal, writes Kevin E G Perry",
    "link": "https://www.the-independent.com/arts-entertainment/tv/features/hulk-hogan-controversies-sex-tape-maga-wrestling-b2801846.html",
    "timestamp": "2025-08-04T20:55:54Z"
  },
  {
    "title": "Ex-ABC News reporter Terry Moran admits network, traditional media biased against Trump: ‘A kind of deafness’",
    "description": "ABC News has not diversified when it comes to hiring people in favor of President Trump, which is “bound to impact coverage” from “what is a kind of deafness,” Terry Moran wrote in a post on his Substack channel.",
    "link": "https://nypost.com/2025/08/04/media/ex-abc-news-reporter-terry-moran-admits-network-traditional-media-biased-against-trump-a-kind-of-deafness/",
    "timestamp": "2025-08-04T20:53:32Z"
  },
  {
    "title": "India hits back at West over Russia oil trade hypocrisy",
    "description": "The US and the EU do far more business with Moscow, New Delhi has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622487-india-russian-oil-us-tariffs/",
    "timestamp": "2025-08-04T20:52:44Z"
  },
  {
    "title": "Saquon Barkley breaks silence on Donald Trump and clarifies his position",
    "description": "Saquon Barkley, one of the most prominent players in the NFL and a key figure for the Philadelphia Eagles, was recently embroiled in political controversy after being wrongly linke",
    "link": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/08/04/68911bef22601dd17f8b45dc.html",
    "timestamp": "2025-08-04T20:51:59Z"
  },
  {
    "title": "Brownley to Introduce Legislation to Block Trump Administration’s Rollback of Veterans’ Access to Reproductive Health Care - Congresswoman Julia Brownley",
    "description": "In direct response to the Trump administration’s proposed rule to roll back abortion access for veterans, Congresswoman Julia Brownley announced the introduction of the Reproductive Freedom for Veterans Act, which would guarantee that veterans and eligible de…",
    "link": "https://juliabrownley.house.gov/brownley-to-introduce-legislation-to-block-trump-administrations-rollback-of-veterans-access-to-reproductive-health-care/",
    "timestamp": "2025-08-04T20:47:46Z"
  },
  {
    "title": "India Calls New Tariff Threat ‘Unjustified and Unreasonable’",
    "description": "India said it had no plans to stop buying and reselling Russian oil despite an announcement by President Trump on Monday that he would “substantially” increase the 25 percent tariffs he imposed on Indian goods because of the practice. India’s foreign ministry…",
    "link": "https://freerepublic.com/focus/f-news/4332648/posts",
    "timestamp": "2025-08-04T20:47:02Z"
  },
  {
    "title": "Ali Velshi cautions Harvard to avoid Trump’s ‘trap’ after it shoots down deal with admin",
    "description": "Not all American universities are completely capitulating to Trump. Ali Velshi shares new developments in Harvard's ongoing battle for academic freedom.",
    "link": "https://www.msnbc.com/top-stories/latest/harvard-university-dei-trump-deal-academic-freedom-rcna222963",
    "timestamp": "2025-08-04T20:44:18Z"
  },
  {
    "title": "Gavin Newsom, Karen Bass Declare NIMBY Martial Law To Stop Duplexes in the Palisades",
    "description": "Plus: Oregon's radical YIMBY centralization, yet another challenge to inclusionary zoning, and DOGE's cuts to fair housing grants get overturned in court.",
    "link": "https://reason.com/2025/08/05/gavin-newsom-karen-bass-declare-nimby-martial-law-to-stop-duplexes-in-the-palisades/",
    "timestamp": "2025-08-04T20:44:06Z"
  },
  {
    "title": "'Unreasonable': India hits back at Trump tirade on Russian oil",
    "description": "India News: In its first direct public pushback against US President Donald Trump's repeated targeting of India over trade with Russia, the Centre termed his crit.",
    "link": "https://timesofindia.indiatimes.com/india/unreasonable-india-hits-back-at-trump-tirade-on-russian-oil/articleshow/123104332.cms",
    "timestamp": "2025-08-04T20:44:05Z"
  },
  {
    "title": "Pete Hegseth Brings in Worst Person Ever on Paranoid Hunt for Leakers",
    "description": "Far-right extremist Laura Loomer says that she is now working with the federal government to identify individuals within the Department of Defense who are leaking information to the press.Speaking with CNN in an interview published Monday, Loomer claimed that…",
    "link": "https://newrepublic.com/post/198801/pete-hegseth-laura-loomer-hunt-leakers",
    "timestamp": "2025-08-04T20:43:47Z"
  },
  {
    "title": "Donald Trump Praises Sydney Sweeney",
    "description": "\"Does he not have more important things to worry about?\"",
    "link": "https://littlethings.com/entertainment/donald-trump-sydney-sweeney",
    "timestamp": "2025-08-04T20:43:39Z"
  },
  {
    "title": "Rep. Ann Wagner backing Trump redistricting push despite political perils",
    "description": "Senate President Cindy O'Laughlin earlier said a special session is \"likely.\"",
    "link": "https://www.stltoday.com/news/local/government-politics/article_f9a41195-1bb0-4020-abbc-829c1e18511f.html",
    "timestamp": "2025-08-04T20:43:00Z"
  },
  {
    "title": "Videos of Israeli Hostages in Gaza Spark Global Condemnation",
    "description": "But negotiations to secure a hostage release deal have largely stalled on both sides.",
    "link": "http://foreignpolicy.com/2025/08/04/israel-hostages-videos-hamas-gaza-starvation-hunger-crisis/",
    "timestamp": "2025-08-04T20:42:39Z"
  },
  {
    "title": "STEPHEN MOORE: How To Make Sure US Dominates 21st Century Telecommunications",
    "description": "STEPHEN MOORE: How To Make Sure US Dominates 21st Century Telecommunications",
    "link": "https://dailycaller.com/2025/08/04/opinion-how-to-make-sure-u-s-dominates-21st-century-telecommunications-stephen-moore/",
    "timestamp": "2025-08-04T20:41:40Z"
  },
  {
    "title": "Eagles’ Saquon Barkley says he’s not part of Trump’s sports council: ‘Definitely a little shocked when my name was mentioned’",
    "description": "Philadelphia Eagles star running back Saquon Barkley said Monday he was surprised to learn he had been named to the President’s Council on Sports, Fitness and Nutrition because he had turned down the opportunity earlier this year.",
    "link": "https://www.cnn.com/2025/08/04/sport/saquon-barkley-trump-sports-council-spt",
    "timestamp": "2025-08-04T20:39:46Z"
  },
  {
    "title": "Candace Owens Says Trump Tried to Get Her to Stop Calling Brigitte Macron Trans",
    "description": "Candace Owens claims Donald Trump personally intervened in her quest to expose France's First Lady Brigitte Macron as an alleged trans woman -- but CO says she never backed down to 47's demands. Owens went on Tucker Carlson's podcast last week and…\n Permalink",
    "link": "https://www.tmz.com/2025/08/04/candace-owens-donald-trump-brigitte-macron-transgender-conspiracy/",
    "timestamp": "2025-08-04T20:36:38Z"
  },
  {
    "title": "Trump threatens India with 'substantial' tariff hike for buying Russian oil",
    "description": "The US president says India doesn't care \"how many people in Ukraine are being killed\" - but India calls the tariff threat \"unjustified\".",
    "link": "https://www.bbc.com/news/articles/cly647wx9l3o",
    "timestamp": "2025-08-04T20:31:46Z"
  },
  {
    "title": "BREAKING: AG Pam Bondi Orders Federal Prosecutor to Present Evidence to Grand Jury in Russia Collusion Hoax",
    "description": "US Attorney General Pam Bondi has ordered an unnamed federal prosecutor to present evidence to a grand jury in the Russia collusion hoax in response to a criminal referral from DNI Tulsi Gabbard.\nThe post BREAKING: AG Pam Bondi Orders Federal Prosecutor to Pr…",
    "link": "https://www.thegatewaypundit.com/2025/08/breaking-ag-pam-bondi-orders-federal-prosecutor-present/",
    "timestamp": "2025-08-04T20:30:33Z"
  },
  {
    "title": "Ex-Obama officials face federal grand jury probe into whether they promoted false Trump-Russia ties",
    "description": "The major legal development opens the door to criminal charges against prominent Cabinet members who served then-President Barack Obama, including former Director of National Intelligence James Clapper, former CIA Director John Brennan and former FBI Director…",
    "link": "https://nypost.com/2025/08/04/us-news/ex-obama-officials-face-federal-grand-jury-probe-into-whether-they-promoted-false-trump-russia-ties/",
    "timestamp": "2025-08-04T20:30:20Z"
  },
  {
    "title": "Modi and Trump once called each other good friends. Now the US-India relationship is getting bumpy",
    "description": "In India, the bonhomie between Prime Minister Narendra Modi and U.S. President Donald Trump was seen as a relationship like no other.  From Trump’s tariffs...",
    "link": "https://www.yahoo.com/news/articles/modi-trump-once-called-other-202918161.html",
    "timestamp": "2025-08-04T20:29:18Z"
  },
  {
    "title": "The master play here is to indict Brennan, Comey and Clapper and then get them to flip on Hillary and Obama.",
    "description": "That’s how the two-headed snake finally gets its comeuppance",
    "link": "https://freerepublic.com/focus/f-chat/4332645/posts",
    "timestamp": "2025-08-04T20:28:27Z"
  },
  {
    "title": "Why were US job numbers which riled Trump revised down by so much?",
    "description": "President Trump has fired the head of the US Bureau of Labor Statistics after the department revised down job numbers which he said were \"rigged\".",
    "link": "https://www.bbc.com/news/articles/c9wyp2kk1e5o",
    "timestamp": "2025-08-04T20:28:09Z"
  },
  {
    "title": "US House Speaker Mike Johnson visits Israeli West Bank settlement",
    "description": "Johnson becomes the highest-ranking US official to visit an illegal settlement in the occupied Palestinian territory.",
    "link": "https://www.aljazeera.com/news/2025/8/4/us-house-speaker-mike-johnson-visits-israeli-west-bank-settlement",
    "timestamp": "2025-08-04T20:26:59Z"
  },
  {
    "title": "Charlamagne begs “donkey” Trump to keep “Epstein files” promise",
    "description": "The radio host said that the president is going back on his campaign promises to his base.",
    "link": "https://www.salon.com/2025/08/04/charlamagne-begs-donkey-trump-to-keep-epstein-files-promise/",
    "timestamp": "2025-08-04T20:25:50Z"
  },
  {
    "title": "GOP senator derails 3 Trump nominees as duo clash again",
    "description": "Sen. Chuck Grassley (R-IA) announced on Monday he's placing a hold on three of President Donald Trump's nominees to the Department of the Treasury — because he fears the Trump administration is going to violate his own just-passed tax cut megabill's rules on …",
    "link": "https://www.rawstory.com/chuck-grassley-2673856889/",
    "timestamp": "2025-08-04T20:25:41Z"
  },
  {
    "title": "Tariffs, Tax Cuts, And Tips: A Public Opinion Update",
    "description": "Polls these days seem to be generating more confusion than clarity. How Donald Trump will fare requires looking at longer-term polling trends.",
    "link": "https://www.forbes.com/sites/bowmanmarsico/2025/08/04/tariffs-tax-cuts-and-tips-a-public-opinion-update/",
    "timestamp": "2025-08-04T20:24:39Z"
  },
  {
    "title": "Saquon Barkley declines Trump's invitation to serve on Council on Sports, Fitness and Nutrition",
    "description": "Saquon Barkley was 'shocked' to hear his name mentioned for Trump's fitness council after his team had already rejected the invitation months earlier.",
    "link": "https://www.foxnews.com/sports/saquon-barkley-declines-trumps-invitation-serve-council-sports-fitness-nutrition",
    "timestamp": "2025-08-04T20:23:19Z"
  },
  {
    "title": "WATCH: Texas Democrats delay redistricting vote by leaving the state",
    "description": "The Republican-dominated House was unable to establish the quorum of lawmakers required to do business.",
    "link": "https://www.pbs.org/newshour/politics/watch-texas-democrats-delay-redistricting-vote-by-leaving-the-state",
    "timestamp": "2025-08-04T20:22:53Z"
  },
  {
    "title": "MTG Has an Original Thought for Once in Her Life",
    "description": "MAGA isn’t MAGA enough anymore for Marjorie Taylor Greene, who seems as surprised as we do at her break with the party that gave her a pulpit.“I don’t know if the Republican Party is leaving me, or if I’m kind of not relating to the Republican Party as much a…",
    "link": "https://newrepublic.com/post/198799/marjorie-taylor-greene-split-donald-trump",
    "timestamp": "2025-08-04T20:22:48Z"
  },
  {
    "title": "Report: Netanyahu Decides on Full Re-occupation of Gaza Strip",
    "description": "Israeli Prime Minister has decided that the Israel Defense Forces (IDF) will fully occupy the Gaza Strip, given the lack of progress in ceasefire talks and Hamas's refusal to disarm and to leave the territory willingly.\nThe post Report: Netanyahu Decides on F…",
    "link": "https://www.breitbart.com/middle-east/2025/08/04/report-netanyahu-decides-on-full-re-occupation-of-gaza-strip/",
    "timestamp": "2025-08-04T20:21:59Z"
  },
  {
    "title": "Meidas Podcast: Texas Democrats Fight Back, GOP Leaders Lose Their Shit",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump, Texas Governor Greg Abbott, MAGA Mike Johnson, and other GOP leader losing it on LIVE TV as Democratic Governors like Pritzker, Hochul, and Newsom and the Texas Democratic Representatives are fighting bac…",
    "link": "https://littlegreenfootballs.com/article/54810_Meidas_Podcast-_Texas_Democrat",
    "timestamp": "2025-08-04T20:19:49Z"
  },
  {
    "title": "Victim in Epstein case decries ‘political warfare’ in effort to release grand jury transcripts | CNN Politics",
    "description": "Two victims of Jeffrey Epstein’s abuse have filed letters to the court condemning the Justice Department’s request to unseal grand jury testimony and cited the lack of respect they feel has been showed toward them by President Donald Trump and his administrat…",
    "link": "https://www.cnn.com/2025/08/04/politics/epstein-victims-statements-grand-jury",
    "timestamp": "2025-08-04T20:17:03Z"
  },
  {
    "title": "If You Hold a Rally and No One Comes …",
    "description": "What has happened to Trump Derangement Syndrome? Has there been some new cure discovered or are we just developing herd immunity? Saturday, Aug. 2, was... Read More\nThe post If You Hold a Rally and No One Comes … appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/04/if-you-hold-a-rally-and-no-one-comes/",
    "timestamp": "2025-08-04T20:16:48Z"
  },
  {
    "title": "Forget the Space Force! Trump needs to create a Cyber Force, says think tank",
    "description": "One new military branch per term would have to be some sort of record\nThe US Space Force won't be the only new military branch Donald Trump has created if forthcoming recommendations from a group of retired military and civilian leadership end up being adopte…",
    "link": "https://biztoc.com/x/55ee10fdb8ea1d79",
    "timestamp": "2025-08-04T20:15:54Z"
  },
  {
    "title": "It Seems Like The President Who Brags About How Smart He Is Cannot Do Arithmetic",
    "description": "Trump repeated his mystifying claim that he is reducing drug prices by “1500%.”",
    "link": "https://www.huffpost.com/entry/trump-trouble-with-percents_n_68910579e4b0da7485d50c8f",
    "timestamp": "2025-08-04T20:15:50Z"
  },
  {
    "title": "Sydney Sweeney Viciously Heckled At An Event Over 'Racist' American Eagle Ad",
    "description": "Sydney Sweeney has continued to face backlash over her controversial American Eagle ad. The actress was most recently heckled by a female while attending the premiere of her film \"Americana,\" according to reports Sydney Sweeney has remained silent in the face…",
    "link": "https://freerepublic.com/focus/f-chat/4332644/posts",
    "timestamp": "2025-08-04T20:13:52Z"
  },
  {
    "title": "Commentary: How the US Weaponised Pakistan Against India",
    "description": "Many in New Delhi welcomed President Donald Trump’s return to power, expecting him to take the Indo-US relationship to new heights. They must wonder where it all went wrong, given that Trump launched an unprecedented broadside against India this week – threat…",
    "link": "https://freerepublic.com/focus/f-news/4332642/posts",
    "timestamp": "2025-08-04T20:13:20Z"
  },
  {
    "title": "Democrat Voter Drop in PA Shrinks Party Advantage Ahead of 2026",
    "description": "Despite President Donald Trump’s 1.71-point victory in Pennsylvania in 2024, newly released voter registration data from Decision Desk HQ shows Democrats barely maintaining their lead, now just 59,135 voters, as their numbers plummet heading into the 2026 mid…",
    "link": "https://www.breitbart.com/politics/2025/08/04/democrat-voter-drop-in-pa-shrinks-party-advantage-ahead-of-2026/",
    "timestamp": "2025-08-04T20:12:05Z"
  },
  {
    "title": "All major Las Vegas Strip casinos are unionized, defying the national trend",
    "description": "The Culinary Workers Union representing 60,000 hospitality workers in Nevada has achieved a historic victory on the Las Vegas Strip. For the first time in its 90-year history, all major casinos on the Strip are unionized.",
    "link": "https://www.pbs.org/newshour/nation/all-major-las-vegas-strip-casinos-are-unionized-defying-the-national-trend",
    "timestamp": "2025-08-04T20:09:39Z"
  },
  {
    "title": "Were you expecting a Social Security COLA this year? hahahahaha... Sorry about that. We've fired all the math people responsible for making those calculations. Better luck next election [Scary]",
    "description": "Were you expecting a Social Security COLA this year? hahahahaha... Sorry about that. We've fired all the math people responsible for making those calculations. Better luck next election",
    "link": "https://www.fark.com/comments/13765256/Were-you-expecting-a-Social-Security-COLA-this-year-hahahahaha-Sorry-about-that-Weve-fired-all-math-people-responsible-for-making-those-calculations-Better-luck-next-election",
    "timestamp": "2025-08-04T20:08:17Z"
  },
  {
    "title": "The right has filled a void on antisemitism – leaving the Jewish left without a language to talk about it",
    "description": "Left-wing Jewish political journalist Rachel Shabi delivers a nuanced take on antisemitism, legitimate criticism of Israel and the role of race and colonialism.",
    "link": "https://theconversation.com/the-right-has-filled-a-void-on-antisemitism-leaving-the-jewish-left-without-a-language-to-talk-about-it-261105",
    "timestamp": "2025-08-04T20:07:55Z"
  },
  {
    "title": "Forget the Space Force! Trump needs to create a Cyber Force, says think tank",
    "description": "One new military branch per term would have to be some sort of record\nThe US Space Force won't be the only new military branch Donald Trump has created if forthcoming recommendations from a group of retired military and civilian leadership end up being adopte…",
    "link": "https://www.theregister.com/2025/08/04/think_tank_military_cyber_force/",
    "timestamp": "2025-08-04T20:07:49Z"
  },
  {
    "title": "Exclusive-Fed's Daly says time is nearing for rate cuts, may need more than two",
    "description": "(Reuters) -San Francisco Federal Reserve Bank President Mary Daly on Monday said that given mounting evidence that the U.S. job market is softening and no...",
    "link": "https://finance.yahoo.com/news/exclusive-feds-daly-says-time-200727156.html",
    "timestamp": "2025-08-04T20:07:27Z"
  },
  {
    "title": "​Registered Republican Sydney Sweeney roasted for red carpet look: 'Her gays hate her'",
    "description": "The Euphoria actress took some fashion flak following her controversial American Eagle \"great jeans\" campaign.",
    "link": "https://www.out.com/celebs/sydney-sweeney-registered-republican-red-carpet",
    "timestamp": "2025-08-04T20:06:27Z"
  },
  {
    "title": "Jasmine Crockett claims Trump is a 'piece of ****,' demands 'ethics guardrails' for Supreme Court",
    "description": "\"Listen, Donald Trump is a piece of ****, okay? We know that. Yes, yes, he is. But in a functioning democracy, he still would not be able to get away with this.\" =========================================================================== At a rally in Arizona…",
    "link": "https://freerepublic.com/focus/f-bloggers/4332640/posts",
    "timestamp": "2025-08-04T20:05:23Z"
  },
  {
    "title": "Trump, Stubb talk Ukraine peace, security cooperation",
    "description": "Finnish President Alexander Stubb said on Monday that he had a \"productive phone call\" with US President Donald Trump, during which the two leaders discussed the ongoing war in Ukraine and the path to...",
    "link": "https://biztoc.com/x/7acb76c3ff127706",
    "timestamp": "2025-08-04T20:04:44Z"
  },
  {
    "title": "Poop showdown! Furious farmers drench squatters with manure to reclaim their land - video goes viral",
    "description": "French farmers in Hautes-Vosges used tractors to spray manure on squatters. They claimed the squatters illegally occupied their land. Farmers alleged they received no help from the police. A similar incident happened in the United Kingdom. A farmer there soak…",
    "link": "https://economictimes.indiatimes.com/news/international/us/poop-showdown-furious-farmers-drench-squatters-with-manure-to-reclaim-their-land-video-goes-viral/articleshow/123104071.cms",
    "timestamp": "2025-08-04T20:04:44Z"
  },
  {
    "title": "House Dems Trash America At Radical Summit In Mexico",
    "description": "Several Democrats traveled to Mexico for a summit aimed at challenging U.S. global dominance, organized by the director of an openly anti-American group.",
    "link": "https://dailycaller.com/2025/08/04/house-dems-trash-america-radical-left-wing-summit-mexico-city/",
    "timestamp": "2025-08-04T20:04:37Z"
  },
  {
    "title": "DOJ launching grand jury investigation into Russiagate conspiracy allegations: sources",
    "description": "Bondi directed her staff to act on the criminal referral from Director of National Intelligence Tulsi Gabbard related to the alleged conspiracy to tie President Donald Trump to Russia, and the Department of Justice is now opening a grand jury investigation in…",
    "link": "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations-source",
    "timestamp": "2025-08-04T20:04:27Z"
  },
  {
    "title": "Now That They’re Free: Venezuelan Men Sent To CECOT On What They Endured",
    "description": "This story was originally published by ProPublica, along with The Texas Tribune, Alianza Rebelde Investiga, and Cazadores de Fake News. Republished under ProPublica’s CC BY-NC-ND 3.0 license. Now that he’s free, Leonardo José Colmenares Solórzano, a 31-year-o…",
    "link": "https://www.techdirt.com/2025/08/04/now-that-theyre-free-venezuelan-men-sent-to-cecot-on-what-they-endured/",
    "timestamp": "2025-08-04T20:03:13Z"
  },
  {
    "title": "MAGA Melts Down After Jasmine Crockett Calls Trump a “Piece of S***”",
    "description": "Representative Jasmine Crockett has struck a nerve in the MAGA-verse after calling President Trump a “piece of shit” at a Sunday event by the progressive group MoveOn.The Texas representative spoke about the need for Democrats to get “aggressive” with their r…",
    "link": "https://newrepublic.com/post/198797/maga-jasmine-crockett-trump-piece-shit",
    "timestamp": "2025-08-04T20:02:33Z"
  },
  {
    "title": "Confirmed Liar Jeremy Ben-Ami of Soros-Backed J Street Joins Team 'Genocide'",
    "description": "Jeremy Ben-Ami, the leader of the far-left, George Soros-backed J Street, who lied for years about whether his group had taken money from the billionaire, now says Israel's war of self-defense in Gaza is a \"genocide.\"\nThe post Confirmed Liar Jeremy Ben-Ami of…",
    "link": "https://www.breitbart.com/middle-east/2025/08/04/confirmed-liar-jeremy-ben-ami-of-soros-backed-j-street-joins-team-genocide/",
    "timestamp": "2025-08-04T20:02:11Z"
  },
  {
    "title": "EU concedes to President Trump; will delay planned U.S. tariffs for six months",
    "description": "The European Union will pause its planned countermeasures against President Donald Trump’s tariffs, originally scheduled to start…\nThe post EU concedes to President Trump; will delay planned U.S. tariffs for six months appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/04/eu-concedes-to-president-trump-will-delay-planned-u-s-tariffs-for-six-months/",
    "timestamp": "2025-08-04T20:00:12Z"
  },
  {
    "title": "McConnell legacy comes under fire in Kentucky race to replace him in Senate...",
    "description": null,
    "link": "https://apnews.com/article/mitch-mcconnell-nate-morris-kentucky-senate-campaign-1df56e3f0680c3782ef014d8da0e6c9e",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Ex-football coach entering Georgia race...",
    "description": "Dooley's campaign is betting on his newcomer status to appeal to voters.",
    "link": "https://abcnews.go.com/Politics/former-football-coach-derek-dooley-entering-georgia-senate/story?id=124326644",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Trump just debunked his own lie—and it should get him sued",
    "description": "Walmart, Apple , and Amazon, the most successful companies\r\n in the U.S., base their corporate strategies on data: consumer behavior data, market research, financial, product, and competitive analysis data. Any CEO who deliberately relied on falsified data, o…",
    "link": "https://www.rawstory.com/raw-investigates/trump-2673857218/",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Tankers Deliver Russian Crude to India Despite USA and EU Pressure",
    "description": "At least four tankers discharged millions of barrels of Russian crude at Indian refineries at the weekend.",
    "link": "https://www.rigzone.com/news/wire/tankers_deliver_russian_crude_to_india_despite_usa_and_eu_pressure-04-aug-2025-181362-article/",
    "timestamp": "2025-08-04T20:00:00Z"
  },
  {
    "title": "Home battery sales are booming, but Tesla is fast losing market share",
    "description": "After surrendering its dominance of Australian electric vehicle sales, Tesla is also now also rapidly losing ground in the home battery market.",
    "link": "https://www.abc.net.au/news/science/2025-08-05/teslas-share-of-home-battery-market-plummeting-as-sales-boom/105596408",
    "timestamp": "2025-08-04T20:00:00Z"
  },
  {
    "title": "Saquon Barkley declines White House sports council invite; 'shocked' by President Donald Trump's mention",
    "description": "Barkley explained his decision to decline the president's invite",
    "link": "https://www.cbssports.com/nfl/news/saquon-barkley-declines-white-house-sports-council-invite-shocked-by-president-donald-trumps-mention/",
    "timestamp": "2025-08-04T19:59:27Z"
  },
  {
    "title": "Texas Gov. Greg Abbott says Democrats have ‘forfeited’ offices by fleeing state",
    "description": "Republican Texas Gov. Greg Abbott says he will begin trying to remove Democratic lawmakers from office Monday if they do not return after dozens of them left the state in an attempt to block the adoption of redrawn U.S. House maps sought by President Donald T…",
    "link": "https://www.bostonherald.com/2025/08/04/texas-gov-says-dems-have-forfeited-offices/",
    "timestamp": "2025-08-04T19:59:26Z"
  },
  {
    "title": "India brushes off Trump tariff threat over Russian oil",
    "description": "India has pushed back against US President Donald Trump's threat to impose higher tariffs on Indian goods. New Delhi condemned Western criticism of its buying oil from Moscow, vowing to protect its national interests.",
    "link": "https://www.dw.com/en/india-brushes-off-trump-tariff-threat-over-russian-oil/a-73528185",
    "timestamp": "2025-08-04T19:58:00Z"
  },
  {
    "title": "U.S. tariffs put 30,000 South African jobs at risk, officials say",
    "description": "South African authorities have warned that U.S. reciprocal tariffs could put an estimated 30,000 jobs at risk. The U.S. plans to impose a 30% tariff on South African goods, creating uncertainty for export industries.",
    "link": "https://www.pbs.org/newshour/world/u-s-tariffs-put-30000-south-african-jobs-at-risk-officials-say",
    "timestamp": "2025-08-04T19:57:08Z"
  },
  {
    "title": "Jasmine Crockett Says Trump May Be A ‘Piece Of S**t’ — But He’s Not The Only Problem",
    "description": "While her contempt for the president was clear, Crockett told Democrats why he's not the only threat to democracy.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-trump-supreme-court_n_6890d474e4b0ef7cc79e1dbc",
    "timestamp": "2025-08-04T19:56:57Z"
  },
  {
    "title": "Crowd erupts as Jasmine Crockett lets fly with profanity-laced anti-Trump tirade",
    "description": "Rep. Jasmine Crockett (D-TX) got the crowd going at a progressive event over the weekend when she launched into President Donald Trump with a profanity-laced attack, according to The Daily Beast.Speaking at a MoveOn event in Arizona, the Texas congresswoman d…",
    "link": "https://www.rawstory.com/jasmine-crockett-2673857890/",
    "timestamp": "2025-08-04T19:56:44Z"
  },
  {
    "title": "Historian: Trump wrong to bring back ‘problematic’ Presidential Fitness Test | The College Fix",
    "description": "Historian: Trump wrong to bring back ‘problematic’ Presidential Fitness Test | The College Fixthecollegefix.com",
    "link": "https://www.thecollegefix.com/historian-trump-wrong-to-bring-back-problematic-presidential-fitness-test/",
    "timestamp": "2025-08-04T19:52:28Z"
  },
  {
    "title": "Argentina’s Milei vetoes pension and disability spending increases, citing fiscal deficit pledge",
    "description": "BUENOS AIRES, Argentina (AP) — Libertarian President Javier Milei on Monday vetoed an attempt to increase spending on pensions in Argentina and a law expanding protections for people with disabilities, saying the legislation would have undermined his flagship…",
    "link": "https://financialpost.com/pmn/milei-vetoes-pension-and-disability-spending-increases-citing-fiscal-deficit-pledge",
    "timestamp": "2025-08-04T19:51:00Z"
  },
  {
    "title": "'Let's just be clear!' CNN host gets stern as former Trump official protests fact check",
    "description": "Economist Stephen Moore, who served as senior economic advisor during Donald Trump's first term, appeared on CNN to support the president's claim that the latest job report put out by the Bureau of Labor Statistics was \"rigged\" against him.Trump fired BLS hea…",
    "link": "https://www.rawstory.com/jobs-report-2673858124/",
    "timestamp": "2025-08-04T19:50:50Z"
  },
  {
    "title": "The Making of Mamdani",
    "description": "A close reading of a new book by New York politician Zohran Mamdani’s father reveals a generational yearning for community and inclusion.",
    "link": "http://foreignpolicy.com/2025/08/04/zohran-mahmood-mamdani-new-york-mayoral-race-politics-book/",
    "timestamp": "2025-08-04T19:49:15Z"
  },
  {
    "title": "Milei vetoes pension and disability spending increases, citing fiscal deficit pledge",
    "description": "Libertarian President Javier Milei on Monday vetoed an attempt to increase spending on pensions in Argentina and a law expanding protections for people with ...",
    "link": "https://www.yahoo.com/news/articles/milei-vetoes-pension-disability-spending-194746491.html",
    "timestamp": "2025-08-04T19:47:46Z"
  },
  {
    "title": "Trump's tariff power grab barrels toward Supreme Court",
    "description": "Legal experts predict Supreme Court appeal in case challenging President Donald Trump's use of IEEPA to impose sweeping tariffs on U.S. trading partners.",
    "link": "https://www.foxnews.com/politics/trumps-tariff-power-grab-barrels-toward-supreme-court",
    "timestamp": "2025-08-04T19:47:05Z"
  },
  {
    "title": "Mitch McConnell’s legacy comes under fire in Kentucky Senate race to replace him",
    "description": "Towering over Kentucky politics for decades, McConnell is regarded as the master strategist behind the GOP’s rise to power in a state long dominated by Democrats.",
    "link": "https://www.pbs.org/newshour/politics/mitch-mcconnells-legacy-comes-under-fire-in-kentucky-senate-race-to-replace-him",
    "timestamp": "2025-08-04T19:47:01Z"
  },
  {
    "title": "New Mexico stays the course in climate change regulation policies amid federal priority shifts (Follows CA lead down the rabbit hole)",
    "description": "New Mexico’s clean energy and environmental advocates are recoiling from energy policy shifts set in motion by the Trump administration this week, including the possible rollback of a major scientific finding about climate change and the delay of rules regula…",
    "link": "https://freerepublic.com/focus/f-chat/4332637/posts",
    "timestamp": "2025-08-04T19:45:51Z"
  },
  {
    "title": "Trump Mega-Bill Total Cost Skyrockets to Add Staggering $4.1 TRILLION to Debt: CBO Analysis",
    "description": "Trump’s One Big Beautiful Bill Act will actually add over $4 trillion to the deficit, some $700 billion more than previously estimated.\nThe post Trump Mega-Bill Total Cost Skyrockets to Add Staggering $4.1 TRILLION to Debt: CBO Analysis first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/trump-mega-bill-total-cost-skyrockets-to-add-staggering-4-1-trillion-to-debt-cbo-analysis/",
    "timestamp": "2025-08-04T19:45:48Z"
  },
  {
    "title": "Team Trump Calls Biographer 'Lying Sack of S---' Who 'Routinely Fabricates Stories' From 'His Peanut-sized Brain' — After 'Fraud' Writer Suggested Prez Ranted He ‘Didn't Have Epstein Killed'",
    "description": "Donald Trump's handlers are once again defending the controversial president over the most recent claim about his connection to pedophile Jeffrey Epstein.",
    "link": "https://radaronline.com/p/trump-michael-wolff-epstein-fabricates-stories-steven-cheung/",
    "timestamp": "2025-08-04T19:45:00Z"
  },
  {
    "title": "Sore-Loser Democrats Fueled Trump-Hating Russia Hoax",
    "description": "The U.S. Justice Department is 100% justified to conduct a criminal investigation of Obama, former CIA directors John Brennan and James Clapper, former FBI Director... Read More\nThe post Sore-Loser Democrats Fueled Trump-Hating Russia Hoax appeared first on T…",
    "link": "https://www.dailysignal.com/2025/08/04/sore-loser-democrats-fueled-trump-hating-russia-hoax/",
    "timestamp": "2025-08-04T19:44:28Z"
  },
  {
    "title": "US stock market rally explodes: Dow soars 500 points, S&P 500 & Nasdaq roar back as Microsoft, Nvidia, Apple, Palantir surge—weak jobs report fuels Fed cut buzz, Trump fires BLS chief in shock move",
    "description": "Stock market rally today has captured Wall Street’s attention as the Dow Jones jumped 500 points, with the S&P 500 and Nasdaq also posting strong gains. This sharp rebound follows a weak U.S. payroll report, which has increased hopes for Federal Reserve rate …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-rally-explodes-dow-soars-500-points-sp-500-nasdaq-roar-back-as-microsoft-nvidia-apple-palantir-surgeweak-jobs-report-fuels-fed-cut-buzz-trump-fires-bls-chief-in-shock-move/articleshow/123103923.cms",
    "timestamp": "2025-08-04T19:44:13Z"
  },
  {
    "title": "Trump mocked after defying basic math: ‘Utterly innumerate’",
    "description": "President Donald Trump left social media users baffled after he claimed on Sunday that he had lowered prescription drug prices by up to 1,500%.\nWhile in Allentown, Pennsylvania, Trump told reporters that Republicans will turn their attention to the “tremendou…",
    "link": "https://biztoc.com/x/02bfef7611d99c3f",
    "timestamp": "2025-08-04T19:41:52Z"
  },
  {
    "title": "The Case for Retaining Faith in Courts That Trump Is Slowly Corrupting",
    "description": "These three judges give reason for hope.",
    "link": "https://slate.com/news-and-politics/2025/08/trump-corruption-emil-bove-vs-good-judges.html",
    "timestamp": "2025-08-04T19:41:38Z"
  },
  {
    "title": "White House anticipates 'ultimate victory' against child sex-change regime despite Letitia James-led lawsuit",
    "description": "President Donald Trump declared war on gender ideology and the corresponding child sex-change regime upon retaking office. Despite the efforts of non-straight activists and overreaching federal judges, the campaign is off to a great start.Pursuant to the pres…",
    "link": "https://www.theblaze.com/news/white-house-anticipates-ultimate-victory-against-child-sex-change-regime-despite-letitia-james-led-lawsuit",
    "timestamp": "2025-08-04T19:40:00Z"
  },
  {
    "title": "Champagne, Anand travelling to Mexico to strengthen Canada's trade ties: sources",
    "description": "Finance Minister François-Philippe Champagne says he and Foreign Affairs Minister Anita Anand will be travelling to Mexico City to look at strengthening Canada’s economic partnership with Mexico.",
    "link": "https://www.cbc.ca/news/politics/champagne-anand-travelling-to-mexico-to-strengthen-canada-s-trade-ties-sources-1.7601077",
    "timestamp": "2025-08-04T19:39:59Z"
  },
  {
    "title": "Champagne, Anand travelling to Mexico to strengthen Canada's trade ties",
    "description": "Finance Minister François-Philippe Champagne says he and Foreign Affairs Minister Anita Anand will travel to Mexico City to look at strengthening Canada’s economic partnership with Mexico.",
    "link": "https://www.cbc.ca/news/politics/champagne-anand-mexico-trip-1.7601077",
    "timestamp": "2025-08-04T19:39:59Z"
  },
  {
    "title": "Oil Slips on Fresh OPEC+ Barrels",
    "description": "Oil fell as traders weighed OPEC+'s supply hike and Trump's renewed tariff threats against India.",
    "link": "https://www.rigzone.com/news/wire/oil_slips_on_fresh_opec_barrels-04-aug-2025-181366-article/",
    "timestamp": "2025-08-04T19:38:18Z"
  },
  {
    "title": "Jeffries: Texas Redistricting an Effort 'Steal the Midterm Elections'",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) said Monday on MSNBC's \"Ana Cabrera Reports\" that Republicans in Texas are attempting to steal the 2026 midterm elections with their redistricting effort.\nThe post Jeffries: Texas Redistricting an Effort ‘Steal the…",
    "link": "https://www.breitbart.com/clips/2025/08/04/jeffries-texas-redistricting-an-effort-steal-the-midterm-elections/",
    "timestamp": "2025-08-04T19:35:55Z"
  },
  {
    "title": "Who is Yeonsoo Go? South Korean student and a priest’s daughter detained by US immigration officials",
    "description": "Yeonsoo Go, a South Korean student, was detained by ICE agents after a routine immigration court visit in New York. The arrest of the 20-year-old, who was in the process of switching to a student visa, has sparked protests. Supporters are demanding her releas…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-yeonsoo-go-south-korean-student-and-a-priests-daughter-detained-by-us-immigration-officials/articleshow/123103982.cms",
    "timestamp": "2025-08-04T19:35:21Z"
  },
  {
    "title": "Trump's sons launch investment vehicle to target a US manufacturer (George Steer/Financial Times)",
    "description": "George Steer / Financial Times:\nTrump's sons launch investment vehicle to target a US manufacturer  —  Blank cheque firm will look for companies able to benefit from federal tax credits or contracts  —  Eric Trump and Donald Trump Jr are backing a new blank c…",
    "link": "https://www.memeorandum.com/250804/p82",
    "timestamp": "2025-08-04T19:35:00Z"
  },
  {
    "title": "American Eagle Stock Jumps 23% After Trump Praises Controversial Sydney Sweeney Ad",
    "description": "Trump also slammed billionaire singer Taylor Swift, luxury vehicle company Jaguar and beer brand Bud Light, all of which he called “woke.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/04/american-eagle-stock-jumps-23-after-trump-praises-controversial-sydney-sweeney-ad/",
    "timestamp": "2025-08-04T19:34:27Z"
  },
  {
    "title": "Warren: 'Would-Be King' Trump Is Setting U.S. Credibility on Fire",
    "description": "Monday on CNBC's \"Squawk on the Street,\" Sen. Elizabeth Warren (D-MA) said \"would-be king\" President Donald Trump's decision to fire Erika McEntarfer as the commissioner of labor statistics was setting the United States' credibility in data collection \"on fir…",
    "link": "https://www.breitbart.com/clips/2025/08/04/warren-would-be-king-trump-is-setting-u-s-credibility-on-fire/",
    "timestamp": "2025-08-04T19:34:06Z"
  }
]