[
  {
    "title": "Netflix bows out of Warner Bros. bid, Paramount set to win",
    "description": "Netflix has dropped out of a bid for Warner Bros, paving the way for Paramount Skydance to acquire its renowned Hollywood rival. The takeover will significantly change the Hollywood and US media landscape. Paramount Skydance is poised to emerge as the winner …",
    "link": "https://www.dw.com/en/netflix-bows-out-of-warner-bros-bid-paramount-set-to-win/a-76143761",
    "timestamp": "2026-02-27T04:25:00Z"
  },
  {
    "title": "Gorton and Denton was a disaster for Labour - can Starmer find a way back?",
    "description": "The first ever Green by-election win, their first ever MP in the north of England, all in the first electoral test for the relatively new Green leader Zack Polanski. This is his moment - and reasonably so.",
    "link": "https://news.sky.com/story/gorton-and-denton-was-a-disaster-for-labour-can-starmer-find-a-way-back-13512791",
    "timestamp": "2026-02-27T04:22:00Z"
  },
  {
    "title": "2 Months Into 2026 We Are Over Half 2025’s Total Count Of Measles Cases",
    "description": "Measles. Yes, yes, I know youre sick of hearing about it. For that, though, you must lay the blame at the feet of Donald Trump, RFK Jr., and this entire administration of clown-tools that isnt bothering to do anything about what has become the worst continuou…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180866222",
    "timestamp": "2026-02-27T04:12:39Z"
  },
  {
    "title": "China’s ‘The US hacks itself to make us look bad’ theorists return with a crypto conspiracy",
    "description": "Apparently Uncle Sam busted Binance to shore up the dollar, balance the budget, and achieve world domination The Chinese agency that has accused the USA of cyberattacks on its own infrastructure to make Beijing look bad is back with another theory: Washington…",
    "link": "https://www.theregister.com/2026/02/27/chinas_the_us_hacks_itself/",
    "timestamp": "2026-02-27T04:10:06Z"
  },
  {
    "title": "Jake Tapper Breaks Paramount-WBD News to CNN Peers on Air: ‘Affects Everybody I’m Looking At’ | Video",
    "description": "“We have some breaking news in our national lead that affects everybody I’m looking at right now in the studio,\" the CNN anchor says\nThe post Jake Tapper Breaks Paramount-WBD News to CNN Peers on Air: ‘Affects Everybody I’m Looking At’ | Video appeared first …",
    "link": "https://www.thewrap.com/industry-news/deals-ma/jake-tapper-reacts-paramount-wbd-bid-live-cnn/",
    "timestamp": "2026-02-27T04:09:29Z"
  },
  {
    "title": "Schiff: Trump Building an ICE Army 'That's Going to Be Policing American Streets'",
    "description": "Thursday on MS NOW's \"The Last Word,\" Sen. Adam Schiff (D-CA) said President Donald Trump was building Immigration and Customs Enforcement (ICE) into an army \"that's going to be policing American streets.\"\nThe post Schiff: Trump Building an ICE Army ‘That’s G…",
    "link": "https://www.breitbart.com/clips/2026/02/26/schiff-trump-building-an-ice-army-thats-going-to-be-policing-american-streets/",
    "timestamp": "2026-02-27T04:09:08Z"
  },
  {
    "title": "Raskin: Trump 'Has No Role at All in Administering Midterm Elections'",
    "description": "Thursday on MS NOW's \"The Briefing,\" Rep. Jamie Raskin (D-MD) said that President Donald Trump \"has no role constitutionally\" in administering midterm elections.\nThe post Raskin: Trump ‘Has No Role at All in Administering Midterm Elections’ appeared first on …",
    "link": "https://www.breitbart.com/clips/2026/02/26/raskin-trump-has-no-role-at-all-in-administering-midterm-elections/",
    "timestamp": "2026-02-27T04:04:10Z"
  },
  {
    "title": "2 Months Into 2026 We Are Over Half 2025’s Total Count Of Measles Cases",
    "description": "Measles. Yes, yes, I know you’re sick of hearing about it. For that, though, you must lay the blame at the feet of Donald Trump, RFK Jr., and this entire administration of clown-tools that isn’t bothering to do anything about what has become the worst continu…",
    "link": "https://www.techdirt.com/2026/02/26/2-months-into-2026-we-are-over-half-2025s-total-count-of-measles-cases/",
    "timestamp": "2026-02-27T04:02:24Z"
  },
  {
    "title": "Report: U.S. Central Command commander briefs Trump on possible attacks on Iran",
    "description": "Report: U.S. Central Command Commander Briefs Trump on Possible Attacks on Iran. Palestinian Sources: Six People Were Killed as a Result of IDF Attacks in the Gaza Strip. Report: Omani Foreign Minister Heads to Washington With U.S. Vice President Vance",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-27/ty-article-live/report-u-s-central-command-commander-briefs-trump-on-possible-attacks-on-iran/0000019c-9d63-d981-a1be-9ffb0e270000",
    "timestamp": "2026-02-27T04:00:00Z"
  },
  {
    "title": "U.S. may not be able to defeat Iran quickly",
    "description": "Trump doesn't appear eager to attack, but may feel pressed to do so in the near future",
    "link": "https://www.haaretz.com/us-news/2026-02-27/ty-article/.premium/u-s-may-not-be-able-to-defeat-iran-quickly/0000019c-9bb3-d930-ad9f-fff70b080000",
    "timestamp": "2026-02-27T04:00:00Z"
  },
  {
    "title": "Trump Iranian missile claim unsupported by U.S. intelligence, say sources",
    "description": "WASHINGTON, Feb 26 (Reuters) - ⁠U.S. President Donald Trump's claim ⁠that Iran will soon have a ‌missile that can hit the United States is not backed by U.S. intelligence reports and appears ​to be exaggerated, according ⁠to three sources ⁠familiar with intel…",
    "link": "https://www.thestar.com.my/news/world/2026/02/27/trump-iranian-missile-claim-unsupported-by-us-intelligence-say-sources",
    "timestamp": "2026-02-27T03:58:00Z"
  },
  {
    "title": "NAILED IT: Scott Jennings Says for Democrats, the Epstein Files Are the New Steele Dossier (VIDEO)",
    "description": "During a recent segment on CNN, Scott Jennings – the lone conservative voice on the entire network – suggested that for Democrats, the Epstein Files are the new Steele Dossier.\nThe post NAILED IT: Scott Jennings Says for Democrats, the Epstein Files Are the N…",
    "link": "https://www.thegatewaypundit.com/2026/02/nailed-it-scott-jennings-says-democrats-epstein-files/",
    "timestamp": "2026-02-27T03:40:46Z"
  },
  {
    "title": "MAGA billionaires win battle to buy CNN and turn it Trumpy",
    "description": "MAGA-aligned billionaires Larry Ellison and his son David have dramatically won a bidding war for CNN’s parent company—and are now on track to turn it Trumpy. Their Paramount Skydance company suddenly has won its bidding war against Netflix to acquire Warner …",
    "link": "https://freerepublic.com/focus/f-chat/4368476/posts",
    "timestamp": "2026-02-27T03:38:37Z"
  },
  {
    "title": "Trump pushes Congress to pass SAVE Act during State of the Union; no meddling with tariffs",
    "description": "Republican divisions emerge over Trump's tariff policies as the president pushes Congress to pass the SAVE Act and restrict congressional stock trading.",
    "link": "https://www.foxnews.com/politics/trump-pushes-congress-pass-save-act-during-state-of-the-union-no-meddling-tariffs",
    "timestamp": "2026-02-27T03:31:53Z"
  },
  {
    "title": "Trump pushes Congress to pass SAVE Act during State of the Union: 'So we'll see how it goes'",
    "description": "Republican divisions emerge over Trump's tariff policies as the president pushes Congress to pass the SAVE Act and restrict congressional stock trading.",
    "link": "https://www.foxnews.com/politics/trump-pushes-congress-pass-save-act-state-of-the-union-see-how-it-goes",
    "timestamp": "2026-02-27T03:31:53Z"
  },
  {
    "title": "Trump Reportedly Viewed Noem’s Shooting of Family Dog as an ‘Asset’ in a DHS Secretary",
    "description": "President Donald Trump reportedly viewed Secretary of Homeland Security Kristi Noem’s story about shooting a family dog as an “asset” for a DHS chief. When The Guardian obtained a copy of Noem’s then-unreleased book were released in the run-up to the 2024 ele…",
    "link": "https://www.mediaite.com/media/news/trump-reportedly-viewed-noems-shooting-of-family-dog-as-an-asset-in-a-dhs-secretary/",
    "timestamp": "2026-02-27T03:31:16Z"
  },
  {
    "title": "US and Iran wrap up latest nuclear talks without a deal as the risk of war looms",
    "description": "Iran and the United States held indirect talks on Tehran's nuclear program. No deal was reached, increasing the risk of war. Oman mediated the discussions. Iran insists on enriching uranium and lifting sanctions. The US seeks to constrain Iran's nuclear activ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-and-iran-wrap-up-latest-nuclear-talks-without-a-deal-as-the-risk-of-war-looms/articleshow/128835823.cms",
    "timestamp": "2026-02-27T03:22:48Z"
  },
  {
    "title": "Panama officials conduct search at Hong Kong-based CK Hutchison's local office, says report; shares fall nearly 1%",
    "description": "The raid on CK Hutchison's Panama Ports Company (PPC) did not relate to a government decision to annul deals that gave the company control of two strategic port canals in Panama",
    "link": "https://www.livemint.com/companies/news/panama-officials-conduct-search-at-hong-kong-based-ck-hutchisons-local-office-says-report-shares-fall-nearly-1-11772161199561.html",
    "timestamp": "2026-02-27T03:22:26Z"
  },
  {
    "title": "Here are Donald Trump’s picks for fix college sports roundtable, including Nick Saban, two Heisman winners and Condoleezza Rice among others",
    "description": "The president will try to fix many issues with many different viewpoints.",
    "link": "https://www.sportingnews.com/us/ncaa-football/news/here-are-donald-trumps-picks-fix-college-sports-roundtable-including-nick-saban-two-heisman-winners-and-condoleezza-rice-among-others/5c9576a0f28528b80227f6b9",
    "timestamp": "2026-02-27T03:19:53Z"
  },
  {
    "title": "A Bunch Of Musical Artists Said No To Appearing In The Melania Doc: 'Definitely A Disappointment'",
    "description": "Not every song got greenlighted.",
    "link": "https://www.cinemablend.com/movies/bunch-musical-artists-said-melania-trump-doc-guns-n-roses-grace-jones",
    "timestamp": "2026-02-27T03:10:00Z"
  },
  {
    "title": "Hillary Clinton issues blistering attack after Epstein grilling as she reveals 'vile' Pizza-gate question",
    "description": "'I don't know how many times I had to say I did not know Jeffrey Epstein. I never went to his island. I never went to his homes,' Hillary said after her testimony on Thursday. 'It then got, at the end, quite unusual because I started being asked about UFOs an…",
    "link": "https://freerepublic.com/focus/f-news/4368473/posts",
    "timestamp": "2026-02-27T03:08:38Z"
  },
  {
    "title": "President Trump to convene panel focused on future of college sports: Sources",
    "description": "President Donald Trump plans to convene a panel next week focused on the future of college athletics, sources briefed on the event confirmed Thursday. The roundtable, scheduled for March 6, includes an invite list with dozens of important figures and sports c…",
    "link": "https://sports.yahoo.com/articles/president-trump-convene-panel-focused-030105443.html",
    "timestamp": "2026-02-27T03:01:05Z"
  },
  {
    "title": "Watch Hillary Clinton Flee After Reporter Asks Why Ghislaine Maxwell Attended Chelsea’s Wedding",
    "description": "Former Secretary of State Hillary Clinton abruptly ended speaking to reporters Thursday when pressed why Ghislaine Maxwell attended her daughter’s wedding.",
    "link": "https://dailycaller.com/2026/02/26/hillary-clinton-flee-why-ghislaine-maxwell-attended-chelseas-wedding/",
    "timestamp": "2026-02-27T02:59:19Z"
  },
  {
    "title": "Pelosi: All of Our Democratic and Republican Presidents Have Been Patriots Until Now",
    "description": "On Thursday's \"Spectrum News One,\" Rep. Nancy Pelosi (D-CA) said all of our Democratic and Republican presidents have been patriots, except for President Donald Trump.\nThe post Pelosi: All of Our Democratic and Republican Presidents Have Been Patriots Until N…",
    "link": "https://www.breitbart.com/clips/2026/02/26/pelosi-all-of-our-democratic-and-republican-presidents-have-been-patriots-until-now/",
    "timestamp": "2026-02-27T02:56:07Z"
  },
  {
    "title": "Ottawa Senators captain Brady Tkachuk slams White House video showing him hurling anti-Canada slur as ‘fake’",
    "description": "Ottawa Senators captain Brady Tkachuk has refuted an AI-generated White House video that falsely depicted him making derogatory remarks about Canada. Tkachuk clarified that the voice and words in the fabricated clip were not his own. He also denied claims of …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/ottawa-senators-captain-brady-tkachuk-slams-white-house-video-showing-him-hurling-anti-canada-slur-as-fake/articleshow/128835233.cms",
    "timestamp": "2026-02-27T02:52:14Z"
  },
  {
    "title": "U.S. and Iran wrap up 'most intense' nuclear talks with no deal — more negotiations ahead",
    "description": "Iran's nuclear program, enrichment of uranium and its ballistic-missle development program have been at the crux of the negotiations.",
    "link": "https://www.cnbc.com/2026/02/27/us-iran-nuclear-talks-oil-middle-east.html",
    "timestamp": "2026-02-27T02:49:16Z"
  },
  {
    "title": "As Paramount Skydance Grabs Warner Bros. and Netflix Bows Out, the Mood Inside All Three: Champagne Toasts vs. ‘Gut Punch’",
    "description": "The surprise news Thursday that Netflix was ending its pursuit of Warner Bros. caught nearly everyone in Hollywood off guard, including staffers inside Warner Bros., Paramount and Netflix. The reaction, of course, varied — depending on which side of the Holly…",
    "link": "https://variety.com/2026/biz/news/paramount-skydance-warner-bros-netflix-bid-mood-1236674199/",
    "timestamp": "2026-02-27T02:46:37Z"
  },
  {
    "title": "Hillary Clinton Claims She 'Had No Idea' of Jeffrey Epstein's Crimes",
    "description": "Former Secretary of State Hillary Clinton told the House Oversight Committee on Thursday that she had no idea about Jeffrey Epstein's crimes. \nThe post Hillary Clinton Claims She ‘Had No Idea’ of Jeffrey Epstein’s Crimes appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/26/hhillary-clinton-claims-she-had-no-idea-of-jeffrey-epsteins-crimes/",
    "timestamp": "2026-02-27T02:44:01Z"
  },
  {
    "title": "Dealers Are Abuzz at Frieze LA’s VIP Day: ‘It’s a Frenzy’",
    "description": "The aisles were packed with collectors, museum trustees and, of course, actors at the latest edition of the Frieze Los Angeles fair.",
    "link": "https://www.artnews.com/art-news/market/dealers-abuzz-frieze-los-angeles-vip-day-frenzy-1234774824/",
    "timestamp": "2026-02-27T02:39:33Z"
  },
  {
    "title": "U.S. Readies First ‘One‑Way’ Kamikaze Drones as Iran Talks End with No Deal",
    "description": "The United States has positioned its first dedicated “one-way” kamikaze drone unit for potential use against Iran, as the latest round of nuclear negotiations in Geneva wrapped without a deal and Tehran reportedly rejected Washington’s core demands.\nThe post …",
    "link": "https://www.breitbart.com/politics/2026/02/26/u-s-readies-first-oneway-kamikaze-drone-iran-talks-stall/",
    "timestamp": "2026-02-27T02:38:22Z"
  },
  {
    "title": "“Not A Done Deal”: California AG Warns Paramount + WBD Merger Far From Certain",
    "description": "The champagne corks may be popping right now at Paramount over the David Ellison-owned company’s successful bid for Warner Bros Discovery, but up in Sacramento the mood is far from celebratory  over the latest possible Hollywood mega-merger. “Paramount/Warner…",
    "link": "http://deadline.com/2026/02/paramount-warner-merger-california-attorney-general-1236738292/",
    "timestamp": "2026-02-27T02:31:16Z"
  },
  {
    "title": "Trump's Religious Liberty Commission Was Hijacked by an Antisemite (The Free Press)",
    "description": "The Free Press:\nTrump's Religious Liberty Commission Was Hijacked by an Antisemite  —  As antisemitism grows on both sides of the political spectrum, we should be wary of those who use their faith to spread Jew hate.  —  Upgrade to Listen  —  Last year, Presi…",
    "link": "https://www.memeorandum.com/260226/p127",
    "timestamp": "2026-02-27T02:30:00Z"
  },
  {
    "title": "Cuba slams US for 'impunity' on speedboat attack suspects",
    "description": "SANTA CLARA, Cuba, Feb 26 (Reuters) - Cuba criticized the ⁠U.S. government for allowing anti-Cuban groups to operate with impunity on Thursday, as Cuban exiles wounded in an apparent attack aboard a Florida-registered speedboat convalesced at a provincial Cub…",
    "link": "https://www.thestar.com.my/news/world/2026/02/27/cuba-slams-us-for-039impunity039-on-speedboat-attack-suspects",
    "timestamp": "2026-02-27T02:21:00Z"
  },
  {
    "title": "Far-right outlet fumes over Senate GOP's dog PR stunt while key Trump bill flounders",
    "description": "The far-right website The Federalist furiously reported on Thursday that the Senate had time to pass a resolution marking a dog parade, but not President Donald Trump's voter restriction bill.\"The Republican-controlled Senate passed a resolution on Feb. 12 so…",
    "link": "https://www.rawstory.com/trump-vote-2675343583/",
    "timestamp": "2026-02-27T02:15:10Z"
  },
  {
    "title": "Paramount Skydance wins Warner; as Netflix walks away, its shares jump",
    "description": "Paramount Skydance wins Warner; as Netflix walks away, its shares jumpnikkei.com",
    "link": "https://asia.nikkei.com/business/business-deals/paramount-skydance-wins-warner-as-netflix-walks-away-its-shares-jump",
    "timestamp": "2026-02-27T02:13:55Z"
  },
  {
    "title": "Family of St. Lucia fishing boat captain seeks answers after deadly US strike in Caribbean",
    "description": "Relatives of a boat captain from the eastern Caribbean island of St. Lucia tell The Associated Press that he is missing after a recent U.S. strike on a suspected drug vessel in the region",
    "link": "https://abcnews.com/International/wireStory/family-st-lucia-fishing-boat-captain-seeks-answers-130549224",
    "timestamp": "2026-02-27T02:13:34Z"
  },
  {
    "title": "Vance: 'No chance' US strikes on Iran would lead to long-term war",
    "description": "VP JD Vance tells The Washington Post that potential strikes on Iran would not lead to a prolonged US war, outlines diplomatic and military options.",
    "link": "https://www.israelnationalnews.com/news/423063",
    "timestamp": "2026-02-27T02:10:25Z"
  },
  {
    "title": "Scott Jennings Says Democrats Misuse Epstein Files The Same Way They Did Steele Dossier",
    "description": "Salem Radio Network host Scott Jennings said Thursday that the Democrats are weaponizing the Jeffrey Epstein files for political gain.",
    "link": "https://dailycaller.com/2026/02/26/scott-jennings-democrats-misuse-epstein-files-steele-dossier/",
    "timestamp": "2026-02-27T02:09:08Z"
  },
  {
    "title": "Oil prices edge lower after US, Iran extend talks",
    "description": "Oil prices dipped Friday, heading for a weekly fall as US-Iran nuclear talks in Geneva showed progress.  While initial concerns of conflict eased, the extended negotiations leave little time to reach a deal before a March deadline.  Technical discussions are …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-edge-lower-after-us-iran-extend-talks/articleshow/128834692.cms",
    "timestamp": "2026-02-27T02:06:50Z"
  },
  {
    "title": "'Want to make it home alive?' Prison accused of threatening trans inmate suing Trump admin",
    "description": "Eight officials in the Bureau of Prisons face civil contempt charges after they made a stunning threat to a trans inmate who is suing President Donald Trump's administration. On Thursday, federal Judge Royce Lamberth in Washington, D.C., ordered the governmen…",
    "link": "https://www.rawstory.com/trump-2675343620/",
    "timestamp": "2026-02-27T02:03:50Z"
  },
  {
    "title": "Vulnerable House Dem lashes out at Trump's 'racist' SOTU challenge: 'That was uncomfortable'",
    "description": "Rep. Janelle Bynum called Trump's State of the Union challenge \"racist\" after he asked Congress to stand for prioritizing American citizens over immigrants.",
    "link": "https://www.foxnews.com/politics/vulnerable-house-dem-lashes-out-trumps-racist-sotu-challenge-that-was-uncomfortable",
    "timestamp": "2026-02-27T01:58:40Z"
  },
  {
    "title": "Larry Leaves Hawaii, Relocates To Trump's Palm Beach Backyard...",
    "description": "Larry Leaves Hawaii, Relocates To Trump's Palm Beach Backyard...\r\n\n \n \n \n (Top headline, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:SHOPPING: ELLISONS BUY WARNER BROS...\r\nWILL NOW RUN CBS AND CNN...\r\nBUT PARAMOUNT LOSSES ALREADY PILING UP; PROFITS VANISH..…",
    "link": "https://www.forbes.com/sites/phoebeliu/2026/02/25/larry-ellison-oracle-relocates-to-florida-trumps-backyard/",
    "timestamp": "2026-02-27T01:58:36Z"
  },
  {
    "title": "Oil heads for weekly decline as US, Iran extend talks",
    "description": "Feb 27 : Oil prices inched down on Friday and were on track for a weekly decline after the United States and Iran extended nuclear talks, easing concerns about potential hostilities that could disrupt supply, while OPEC+ may resume output hike at its Sunday m…",
    "link": "https://www.channelnewsasia.com/business/oil-heads-weekly-decline-us-iran-extend-talks-5957081",
    "timestamp": "2026-02-27T01:57:10Z"
  },
  {
    "title": "Oil prices edge lower after US, Iran extend talks",
    "description": "(Corrects dateline to Feb 27)By Nicole JaoFeb 27 : Oil prices fell on Friday and were on track for a weekly decline after the United States and Iran extended talks over the OPEC member's nuclear programme, easing concerns about potential hostilities that coul…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-edge-lower-after-us-iran-extend-talks-5957081",
    "timestamp": "2026-02-27T01:57:10Z"
  },
  {
    "title": "Dem Rep. Kennedy on DHS Shutdown Not Impacting ICE: We Have to 'Drive' 'Message' to Get Accountability, It's GOP's Fault",
    "description": "On Thursday’s broadcast of CNN International’s “The Brief,” Rep. Timothy Kennedy (D-NY) responded to a question on if the DHS shutdown is doing anything about ICE given that ICE has a ton of money already by blaming Republicans and stating\nThe post Dem Rep. K…",
    "link": "https://www.breitbart.com/clips/2026/02/26/dem-rep-kennedy-on-dhs-shutdown-not-impacting-ice-we-have-to-drive-message-to-get-accountability-its-gops-fault/",
    "timestamp": "2026-02-27T01:53:29Z"
  },
  {
    "title": "“Left in the stench:” South San Diego communities frustrated as federal response ramps up for Potomac sewage spill",
    "description": "Residents in South San Diego said they also deserve a rapid response from the federal government after President Trump declares the Potomac collapse an emergency.",
    "link": "https://www.kpbs.org/news/environment/2026/02/26/left-in-the-stench-south-san-diego-communities-frustrated-as-federal-response-ramps-up-for-potomac-sewage-spill",
    "timestamp": "2026-02-27T01:52:17Z"
  },
  {
    "title": "CNBC Daily Open: Netflix bows out from Warner Bros. Discovery bidding war",
    "description": "Netflix on Thursday stateside said it declined to raise a counteroffer for Warner Bros. Discovery's studio and streaming assets.",
    "link": "https://www.cnbc.com/2026/02/27/cnbc-daily-open-netflix-bows-out-from-warner-bros-discovery-bidding-war.html",
    "timestamp": "2026-02-27T01:44:45Z"
  },
  {
    "title": "Trump DOJ's 'significant' court admissions could doom major deportation case: expert",
    "description": "Lawyers in President Donald Trump's Department of Justice made some \"significant\" admissions in court on Thursday that could doom its prosecution of Kilmar Abrego Garcia, according to one expert.The Trump administration has been in an intense legal fight with…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2675343552/",
    "timestamp": "2026-02-27T01:43:24Z"
  },
  {
    "title": "White House Slams Jimmy Kimmel's Response to Trump's SOTU: 'A Sad, Angry, Insufferable Idiot'",
    "description": "White House Director of Communications Steven Cheung slammed Jimmy Kimmel's response to President Donald Trump's State of the Union address, calling the left-wing TV host \"a sad, angry, and insufferable idiot,\" before reminding the public that Kimmel has prev…",
    "link": "https://www.breitbart.com/entertainment/2026/02/26/white-house-slams-jimmy-kimmels-response-to-trumps-sotu-a-sad-angry-insufferable-idiot/",
    "timestamp": "2026-02-27T01:38:25Z"
  },
  {
    "title": "Ted Went All That Way For Nuthin’: Netflix Lost WB While Sarandos Was Pitching Deal At The White House",
    "description": "Ted Sarandos’s White House visit today proved an exercise in real-time realpolitik for the Netflix co-CEO as Paramount won the multibillion-dollar bid for Warner Bros Discovery. Usually Sarandos is such a good pitch man he can pretty much sell ice to polar be…",
    "link": "http://deadline.com/2026/02/sarandos-netflix-warner-bros-deal-fall-through-1236737892/",
    "timestamp": "2026-02-27T01:38:08Z"
  },
  {
    "title": "Anthropic CEO 'Cannot in Good Conscience Accede' to Pentagon's AI Demand",
    "description": "Defense Secretary Pete Hegseth gave Anthropic until Friday evening to agree to let the Pentagon use the company's artificial intelligence technology however it wants, or else. Roughly 24 hours ahead of the deadline, CEO Dario Amodei announced that \"we cannot …",
    "link": "https://www.commondreams.org/news/anthropic-ceo-cannot-in-good-conscience-accede-to-pentagon-s-ai-demand",
    "timestamp": "2026-02-27T01:32:52Z"
  },
  {
    "title": "Netflix walks out of Warner Bros Discovery deal, clears path for Paramount Skydance — ‘No longer financially attractive’",
    "description": "Netflix's pullout from the deal — which faced a months-long three-pronged dilemma about who is going to acquire the studio and streaming assets of WBD — clears the path for Paramount Skydance to gain control of Warner Bros Discovery in a $111 billion historic…",
    "link": "https://www.livemint.com/companies/news/netflix-walks-out-of-warner-bros-discovery-deal-clears-path-for-paramount-skydance-no-longer-financially-attractive-11772153409803.html",
    "timestamp": "2026-02-27T01:31:05Z"
  },
  {
    "title": "Mint Quick Edit | Why replacing America’s income tax mop-up with tariff revenues is a flawed fiscal idea",
    "description": "Donald Trump used his State of the Union speech to pitch tariff revenues as a way to eliminate income tax in the US. This would result in regressive taxation. For America’s sake, it’s an idea whose time should never come.",
    "link": "https://www.livemint.com/opinion/online-views/mint-quick-edit-why-replacing-america-income-tax-tariff-revenues-flawed-fiscal-idea-donald-trump-11772125582615.html",
    "timestamp": "2026-02-27T01:30:28Z"
  },
  {
    "title": "With Paramount set to take over WBD, Trump just steered a major news outlet into the hands of a crony (Matt Gertz/Media Matters for America)",
    "description": "Matt Gertz / Media Matters for America:\nWith Paramount set to take over WBD, Trump just steered a major news outlet into the hands of a crony  —  Another major media conglomerate teeters on the precipice of being absorbed by a deep-pocketed ally of President …",
    "link": "https://www.memeorandum.com/260226/p122",
    "timestamp": "2026-02-27T01:30:00Z"
  },
  {
    "title": "Ted Cruz takes revenge on GOP congressman who helped torpedo his legislation: report",
    "description": "Sen. Ted Cruz (R-TX) dealt a blow to one of the Texas GOP's most embattled incumbent congressmen, Rep. Dan Crenshaw, by endorsing his primary challenger — and according to CNN, it's the culmination of years of escalating bad blood between the two that saw Cre…",
    "link": "https://www.rawstory.com/ted-cruz-dan-crenshaw/",
    "timestamp": "2026-02-27T01:29:27Z"
  },
  {
    "title": "It's easy to understand why Netflix walked away from WBD",
    "description": "We are going to have lots of questions about the WBD-Paramount tie-up. But explaining why Netflix bailed is more straightfoward.",
    "link": "https://www.businessinsider.com/why-netflix-walked-wbd-paramount-trump-sarandos-ellison-2026-2",
    "timestamp": "2026-02-27T01:26:55Z"
  },
  {
    "title": "Trump and Mamdani meet for second time, discuss housing and detention of student",
    "description": "New York City Mayor Zohran Mamdani met with President Donald Trump at the White House to discuss housing and the detention of a Columbia University student. Mamdani reported a productive meeting, noting Trump's assurance of the student's imminent release. Bot…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-and-mamdani-meet-for-second-time-discuss-housing-and-detention-of-student/articleshow/128834064.cms",
    "timestamp": "2026-02-27T01:25:54Z"
  },
  {
    "title": "US aims to bring in 4,500 white South Africans per month as refugees, document says",
    "description": "The U.S. plans to process 4,500 white South African refugees monthly, significantly exceeding its stated goals, by establishing a modular processing village on embassy property in Pretoria. This ambitious target faces administrative backlogs, temporarily halt…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-aims-to-bring-in-4500-white-south-africans-per-month-as-refugees-document-says/articleshow/128833974.cms",
    "timestamp": "2026-02-27T01:17:56Z"
  },
  {
    "title": "Seizing Physical Control of China’s Container Terminals”: Does Panama’s Constitutional Rationale Justify Taking Assets in a De Facto Expropriation?",
    "description": "The week of February 23, 2026, marked a definitive and dramatic escalation in the long-simmering dispute over the crown jewels of Panamanian infrastructure: the container terminals of Balboa and Cristobal. In a swift and forceful action, the Panamanian govern…",
    "link": "https://www.globalresearch.ca/panama-taking-assets-without-compensation-de-facto-expropriation/5917279",
    "timestamp": "2026-02-27T01:15:13Z"
  },
  {
    "title": "Mideast tensions rise as Iran-US nuclear talks fail to produce agreement",
    "description": "Iran and the US held intense nuclear talks in Geneva but failed to reach an agreement, keeping the risk of regional conflict and war fears high.",
    "link": "https://www.thehindubusinessline.com/news/world/mideast-tensions-rise-as-iran-us-nuclear-talks-fail-to-produce-agreement/article70682403.ece",
    "timestamp": "2026-02-27T01:12:41Z"
  },
  {
    "title": "Kelce brothers celebrate Team USA women's hockey dominance following Olympic triumph",
    "description": "Olympic glory at the Milano-Cortina 2026 Winter Games was painted in red, white, and blue thanks to an unprecedented performance by the United States women&apos;s ice hockey team a",
    "link": "https://www.marca.com/en/olympic-games/2026/02/27/69a0ef03268e3e567a8b45f7.html",
    "timestamp": "2026-02-27T01:11:20Z"
  },
  {
    "title": "Minnesota Lawmakers File Articles of Impeachment Against Gov. Tim Walz, AG Keith Ellison",
    "description": "Minnesota lawmakers have filed articles of impeachment against Attorney General Keith Ellison and Gov. Tim Walz. State Reps. Drew Roach, Ben Davis, and Mike Wiener, of the Minnesota Freedom Caucus, filed the documents. The lawmakers allege that the leaders al…",
    "link": "https://freerepublic.com/focus/f-news/4368467/posts",
    "timestamp": "2026-02-27T01:08:38Z"
  },
  {
    "title": "Report: Trump briefed on military options in Iran amid talks",
    "description": "Navy Adm. Brad Cooper briefs President Trump on military options regarding Iran, as US-Iran talks in Geneva show progress, according to ABC News.",
    "link": "https://www.israelnationalnews.com/news/423062",
    "timestamp": "2026-02-27T01:08:08Z"
  },
  {
    "title": "Former DOJ Lawyer Dismantles Trump’s ‘Madcap’ Scheme To Take Over Elections: ‘He Can’t Legally Do It’",
    "description": "Ryan Goodman blasted the idea that President Donald Trump could legally federalize elections.\nThe post Former DOJ Lawyer Dismantles Trump’s ‘Madcap’ Scheme To Take Over Elections: ‘He Can’t Legally Do It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/former-doj-lawyer-dismantles-trumps-madcap-scheme-to-take-over-elections-he-cant-legally-do-it/",
    "timestamp": "2026-02-27T01:05:05Z"
  },
  {
    "title": "Former Israeli prime minister argues Iran is trying to 'buy time' with Geneva talks",
    "description": "Former Israeli Prime Minister Naftali Bennett warns Iran is developing intercontinental ballistic missiles capable of reaching the U.S. as nuclear talks continue in Geneva.",
    "link": "https://www.foxnews.com/media/former-israeli-prime-minister-argues-iran-trying-buy-time-geneva-talks",
    "timestamp": "2026-02-27T01:03:54Z"
  },
  {
    "title": "US Warned Ukraine about Terrorist Attacks in the Black Sea",
    "description": "It was revealed that the US formally condemned, albeit discreetly, a terrorist action committed by the Ukrainian regime. \nThe post US Warned Ukraine about Terrorist Attacks in the Black Sea appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/us-warned-ukraine-terrorist-attacks-black-sea/5917290",
    "timestamp": "2026-02-27T01:01:03Z"
  },
  {
    "title": "Kennedy warns Ayatollah wants to 'drink our blood out of a boot' as Iran tensions escalate",
    "description": "A Senate Republican warned against Iran's nuclear threat as President Donald Trump's deadline for a deal with the country fast approaches.",
    "link": "https://www.foxnews.com/politics/kennedy-warns-ayatollah-wants-drink-our-blood-out-boot-iran-tensions-escalate",
    "timestamp": "2026-02-27T01:00:37Z"
  },
  {
    "title": "'The View' guest co-host corrects liberal panel about stock market liking Trump policies",
    "description": "CNBC's Sara Eisen told \"The View\" panel that President Donald Trump's deregulation policies boost stock market growth, while defending tariffs as less harmful than expected by investors.",
    "link": "https://www.foxnews.com/media/the-view-guest-co-host-corrects-liberal-panel-about-stock-market-liking-trump-policies",
    "timestamp": "2026-02-27T01:00:28Z"
  },
  {
    "title": "John Piper prompts pushback from Jack Hibbs, others over Leviticus tweet on \"welcoming the stranger\": 'Irresponsible theology'",
    "description": "'This folly must stop'Reformed Baptist theologian and retired pastor John Piper faced overwhelmingly negative responses to a Wednesday X post that quoted an Old Testament verse about welcoming the stranger, which many took as a veiled take on U.S. immigration…",
    "link": "https://freerepublic.com/focus/f-religion/4368466/posts",
    "timestamp": "2026-02-27T00:59:37Z"
  },
  {
    "title": "Pentagon pick to lead homeland defense policy grilled over election security",
    "description": "The heated debate follows President Trump’s calls to “nationalize” elections.",
    "link": "https://www.defenseone.com/threats/2026/02/pentagon-pick-lead-homeland-defense-policy-grilled-over-election-security/411740/",
    "timestamp": "2026-02-27T00:56:03Z"
  },
  {
    "title": "Netflix walks away from Warner Bros deal, clearing path for Paramount takeover",
    "description": "On Thursday, after Warner's board announced that Skydance-owned Paramount's offer was superior to the agreement it had previously struck with Netflix, the streaming giant said the new price it would have to pay to acquire Warner would make the deal \"no longer…",
    "link": "https://www.pbs.org/newshour/economy/netflix-walks-away-from-warner-bros-deal-clearing-path-for-paramount-takeover",
    "timestamp": "2026-02-27T00:55:34Z"
  },
  {
    "title": "US tax agency broke privacy law ‘approximately 42,695 times’, judge says",
    "description": "Federal judge rules that the Internal Revenue Service violated its code by giving immigration agency confidential data.",
    "link": "https://www.aljazeera.com/news/2026/2/27/us-tax-agency-broke-privacy-law-approximately-42695-times-judge-says",
    "timestamp": "2026-02-27T00:55:31Z"
  },
  {
    "title": "'Troubling': Trump's niece claims he's 'acting like a guilty man' in Epstein scandal",
    "description": "President Donald Trump's niece didn't hold back in an interview on Thursday when discussing the administration's handling of the Jeffrey Epstein files. Mary Trump, a psychologist and author, has often criticized her uncle's administration and the president hi…",
    "link": "https://www.rawstory.com/mary-trump-2675343469/",
    "timestamp": "2026-02-27T00:55:24Z"
  },
  {
    "title": "Panthers’ Matthew Tkachuk has ‘so much respect’ for women’s hockey team, amid controversy over Trump’s comment",
    "description": "FORT LAUDERDALE, Fla. — Soon after the USA men’s hockey team sparked celebrations across the country with Jack Hughes’ gold-medal-winning goal against Canada on Sunday, the team was engulfed in a political controversy. FBI Director Kash Patel was seen on vide…",
    "link": "https://www.sun-sentinel.com/2026/02/26/panthers-tkachuk-womens-team/",
    "timestamp": "2026-02-27T00:52:00Z"
  },
  {
    "title": "US Treasury To Allow Resale Of Venezuelan Oil To Cuba to Ease Island's Fuel Crunch",
    "description": "The U.S. Treasury Department on Wednesday announced a new licensing policy to streamline the resale of Venezuelan oil to Cuba, with the goal of supporting the island’s private sector and bolstering humanitarian efforts amid ongoing fuel crises. The Office of …",
    "link": "https://freerepublic.com/focus/f-news/4368464/posts",
    "timestamp": "2026-02-27T00:50:42Z"
  },
  {
    "title": "On the Way to the New Feudalism",
    "description": "The international order of states is currently being dismantled in a shock process. The ideological accompaniment to this is called: The Dark Enlightenment\nThe post On the Way to the New Feudalism appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/way-new-feudalism/5917011",
    "timestamp": "2026-02-27T00:49:14Z"
  },
  {
    "title": "Can Trump Use Executive Authority to Require Voter ID?",
    "description": "President Donald Trump is reportedly considering an executive order to secure American elections without relying on Congress passing legislation. Trump has directed his counsel’s office... Read More\nThe post Can Trump Use Executive Authority to Require Voter …",
    "link": "https://www.dailysignal.com/2026/02/26/can-trump-use-executive-authority-to-require-voter-id/",
    "timestamp": "2026-02-27T00:47:39Z"
  },
  {
    "title": "Top Democrats accuse Bondi and DOJ of Epstein files 'cover-up'",
    "description": "DOJ said it's reviewing if files were \"found to have been improperly tagged.\"",
    "link": "https://abcnews.com/Politics/top-democrats-accuse-bondi-doj-epstein-files-cover/story?id=130541245",
    "timestamp": "2026-02-27T00:46:56Z"
  },
  {
    "title": "With Paramount As A Potential New Owner, CNN CEO Mark Thompson Urges Employees, “Don’t Jump To Conclusions About The Future”",
    "description": "With Paramount emerging as the winning bidder for a potential deal for Warner Bros. Discovery, one of its prizes would be CNN. That has triggered a new level of consternation at the network, not just because of the every present worries about cutbacks at a ti…",
    "link": "http://deadline.com/2026/02/cnn-paramount-warner-bros-merger-1236738177/",
    "timestamp": "2026-02-27T00:46:46Z"
  },
  {
    "title": "About a dozen FBI staff who worked on Trump documents case fired, sources say",
    "description": "At least 10 FBI employees were fired Wednesday, after FBI Director Kash Patel alleged former special counsel Jack Smith had subpoenaed his phone records.",
    "link": "https://www.cbsnews.com/news/about-a-dozen-fbi-staff-who-worked-on-trump-documents-case-fired-over-two-days-sources-say/",
    "timestamp": "2026-02-27T00:44:00Z"
  },
  {
    "title": "Now We Wait For War With Iran To Begin As A Rare 6 Planet Parade And A Blood Moon Eclipse Loom",
    "description": "Negotiations with Iran have reached a breaking point just as a parade of 6 planets is appearing in the night sky and a major blood moon eclipse is approaching next week. The skeptics will continue to insist that this is “just a coincidence” even as the missil…",
    "link": "http://theeconomiccollapseblog.com/now-we-wait-for-war-with-iran-to-begin-as-a-rare-6-planet-parade-and-a-blood-moon-eclipse-loom/",
    "timestamp": "2026-02-27T00:42:51Z"
  },
  {
    "title": "Watch out for video of US women's hockey captain Hilary Knight declining White House invite",
    "description": "A video shared to social media in February 2026 authentically showed U.S. women's ice hockey team captain Hilary Knight's response to President Donald Trump's comment about the team, saying the team declined an invitation to the White House.",
    "link": "https://www.snopes.com//fact-check/hilary-knight-white-house/",
    "timestamp": "2026-02-27T00:42:00Z"
  },
  {
    "title": "Oil sales under US-Venezuela deal expected to reach $2 billion by end of February",
    "description": "U.S. oil supply agreement sales with Venezuela are projected to hit $2 billion by month's end, with 40 million barrels expected to be sold. Trading houses Vitol and Trafigura are marketing the oil, while partners like Chevron boost output. The crude and fuel …",
    "link": "https://economictimes.indiatimes.com/news/international/business/oil-sales-under-us-venezuela-deal-expected-to-reach-2-billion-by-end-of-february/articleshow/128833480.cms",
    "timestamp": "2026-02-27T00:41:53Z"
  },
  {
    "title": "BBC explains the Trump-related Epstein files the DOJ is accused of withholding",
    "description": "The BBC's Tom Bateman explains what Trump-Related Epstein files the Department of Justice is accused of withholding.",
    "link": "https://www.bbc.com/news/videos/ckgzyvzprj4o",
    "timestamp": "2026-02-27T00:40:37Z"
  },
  {
    "title": "How Much Was the Government LYING About the Illegal Immigrant Crime Wave? Did the crackdown on illegal immigrants coincide with a huge drop in crime?",
    "description": "“Nobody knows nothin’.”—Jack BogleThe legendary Jack Bogle was referring to the financial market, but his sentiment also applies to crime statistics: Nobody really knows the actual crime rate — or who’s committing the crimes.For about 10 years, I did PR for a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4368463/posts",
    "timestamp": "2026-02-27T00:40:35Z"
  },
  {
    "title": "Flavor Flav to host Las Vegas event honoring US women's hockey team in July",
    "description": "Feb 26 : Rapper Flavor Flav will host a Las Vegas event in July to honour the U.S. women's ice hockey team's gold medal victory at the Milano Cortina Olympics.The Hall of Fame rapper announced on social media platform X on Thursday that he will host a \"She Go…",
    "link": "https://www.channelnewsasia.com/sport/flavor-flav-host-las-vegas-event-honoring-us-womens-hockey-team-in-july-5956971",
    "timestamp": "2026-02-27T00:35:25Z"
  },
  {
    "title": "Canada warns USMCA could face annual reviews, fueling uncertainty and chilling investment",
    "description": "Canada’s minister for U.S. trade says the Canada-U.S.-Mexico Agreement could be subject to annual review and that uncertainty could be the objective of the Trump administration",
    "link": "https://abcnews.com/Business/wireStory/canada-warns-usmca-face-annual-reviews-fueling-uncertainty-130546473",
    "timestamp": "2026-02-27T00:29:57Z"
  },
  {
    "title": "Canada warns USMCA could face annual reviews, fueling uncertainty and chilling investment",
    "description": "Canada’s minister for U.S. trade says the Canada-U.S.-Mexico Agreement could be subject to annual review and that uncertainty could be the objective of the Trump administration",
    "link": "https://abcnews.com/US/wireStory/canada-warns-usmca-face-annual-reviews-fueling-uncertainty-130546471",
    "timestamp": "2026-02-27T00:29:55Z"
  },
  {
    "title": "Paramount Skydance wins Warner Bros; Netflix walks away and its shares jump",
    "description": "Netflix has withdrawn its bid for Warner Bros. Discovery, deeming the acquisition financially unattractive after Paramount Skydance raised its offer. Paramount's revised $31-a-share proposal is now considered superior, though the deal faces potential antitrus…",
    "link": "https://economictimes.indiatimes.com/news/international/business/paramount-skydance-wins-warner-bros-netflix-walks-away-and-its-shares-jump/articleshow/128833304.cms",
    "timestamp": "2026-02-27T00:27:58Z"
  },
  {
    "title": "Republican voter ID bill stalls in Senate despite Trump demands",
    "description": "Election-year legislation to impose strict new proof-of-citizenship requirements on voting appears stalled in the Senate, for now, despite President Donald Trump’s call in his State of the Union speech that Republicans in Congress pass the bill “before...",
    "link": "https://abcnews.com/Politics/wireStory/republican-voter-id-bill-stalls-senate-despite-trump-130546216",
    "timestamp": "2026-02-27T00:23:54Z"
  },
  {
    "title": "Congo and US agree to $1.2 billion health partnership",
    "description": "The United States signs a $1.2 billion health partnership with Congo that ties new funding to Congo spending more at home",
    "link": "https://abcnews.com/Health/wireStory/congo-us-agree-12-billion-health-partnership-130546593",
    "timestamp": "2026-02-27T00:23:32Z"
  },
  {
    "title": "Iranian FM: Progress made in 'intense' talks with US",
    "description": "In a post on social media, Iran's Foreign Minister Abbas Araghchi reports progress in US-Iran talks in Geneva, with technical teams set to meet in Vienna soon.",
    "link": "https://www.israelnationalnews.com/news/423061",
    "timestamp": "2026-02-27T00:23:09Z"
  },
  {
    "title": "Donald Trump plans celebrity panel to tackle college sports issues",
    "description": "American president Donald Trump has a massive love for sports, and he’s taking it upon himself to get involved in the growing college sports discussion with NIL becoming so prevalent. Trump recently showed love to U.S. athletes after their recent…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_fd228f22-6fa2-4398-8603-36b31d4bd5af",
    "timestamp": "2026-02-27T00:21:31Z"
  },
  {
    "title": "Donald Trump plans celebrity panel to tackle college sports issues",
    "description": "American president Donald Trump has a massive love for sports, and he's taking it upon himself to get involved in the growing college sports discussion with NIL becoming so prevalent. Trump recently showed love to U.S. athletes after their recent success at t…",
    "link": "https://www.thebiglead.com/donald-trump-plans-celebrity-panel-tackle-college-sports-issues/",
    "timestamp": "2026-02-27T00:21:31Z"
  },
  {
    "title": "ED gets sanction to prosecute P Chidambaram; laundering probe based on FIRs by CBI",
    "description": "The Enforcement Directorate has secured clearance from the home ministry to prosecute former finance minister P. Chidambaram in the Aircel-Maxis and INX Media money laundering cases. These proceedings, pending for nearly 15 years due to multiple legal challen…",
    "link": "https://timesofindia.indiatimes.com/city/delhi/ed-to-court-got-sanction-to-prosecute-chidambaram/articleshow/128833052.cms",
    "timestamp": "2026-02-27T00:20:02Z"
  },
  {
    "title": "‘Breaking News… That Affects Everybody I’m Looking At in the Studio’: Jake Tapper Tells Viewers CNN May Be on Verge of Takeover by David Ellison",
    "description": "Jake Tapper broke some unique news to viewers on Thursday's edition of The Lead, telling them that Paramount Skydance is poised to acquire Warner Bros. Discovery, and with it, CNN.\nThe post ‘Breaking News… That Affects Everybody I’m Looking At in the Studio’:…",
    "link": "https://www.mediaite.com/media/tv/breaking-news-that-affects-everybody-im-looking-at-in-the-studio-jake-tapper-tells-viewers-cnn-may-be-on-verge-of-takeover-by-david-ellison/",
    "timestamp": "2026-02-27T00:18:28Z"
  },
  {
    "title": "Netflix Says Nevermind to Warner Bros., Ceding Spoils to Paramount",
    "description": "If approved by regulators, David Ellison's latest megabucks acquisition will give Paramount the richest sports portfolio this side of ESPN.",
    "link": "https://www.sportico.com/business/media/2026/netflix-warner-brothers-discovery-paramount-1234885823/",
    "timestamp": "2026-02-27T00:13:33Z"
  }
]