[
  {
    "title": "Kennedy Center Apparently Scrubs Pages For Most Egregious Left-Wing Content After Trump Threatens Takeover",
    "description": "The John F. Kennedy Center for the Performing Arts seems to have deleted left-wing content from their website as Donald Trump accelerates his takeover.",
    "link": "https://dailycaller.com/2025/02/10/kennedy-center-scrubs-left-wing-shows-donald-trump-takeover/",
    "timestamp": "2025-02-10T22:57:18Z"
  },
  {
    "title": "Liberal Magazine: Hitler Knew How to Fund Science, Unlike Trump (David Strom/HotAir)",
    "description": "David Strom / HotAir:\nLiberal Magazine: Hitler Knew How to Fund Science, Unlike Trump  —  Adolf Hitler was really a pretty good guy, according to the American Prospect.  At least he knew that funding universities was a good investment and that scientific rese…",
    "link": "https://www.memeorandum.com/250210/p117",
    "timestamp": "2025-02-10T22:55:00Z"
  },
  {
    "title": "Trump says Ric Grenell will be Kennedy Center’s interim executive director | CNN Politics",
    "description": "President Donald Trump said Monday he is naming Ric Grenell, a longtime confidant already serving in multiple administration positions, to lead the Kennedy Center for the Performing Arts on a temporary basis after declaring himself the institution’s chairman …",
    "link": "https://www.cnn.com/2025/02/10/politics/ric-grenell-kennedy-center-interim-executive-director/index.html",
    "timestamp": "2025-02-10T22:54:57Z"
  },
  {
    "title": "Speaker Johnson Refuses To Say Whether Trump Should Comply With Court Orders",
    "description": "Speaker Mike Johnson declined to say whether President Donald Trump and his administration should comply with court rulings.\nThe post Speaker Johnson Refuses To Say Whether Trump Should Comply With Court Orders first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/speaker-johnson-refuses-to-say-whether-trump-should-comply-with-court-orders/",
    "timestamp": "2025-02-10T22:54:27Z"
  },
  {
    "title": "Trump's Education Department investigates schools for trans inclusion in sports",
    "description": "Donald Trump wants to get rid of the Department of Education, but in the meantime his administration is weaponizing it against schools that have allowed transgender women and girls to play on female sports teams.",
    "link": "https://www.advocate.com/sports/trump-education-department-transgender-sports",
    "timestamp": "2025-02-10T22:53:05Z"
  },
  {
    "title": "‘Back to plastic’: Trump pushes for plastic straws as he declares paper ones ‘don’t work’",
    "description": "WASHINGTON (AP) — President Donald Trump is moving to reverse a federal push away from plastic straws, declaring that paper straws “don’t work.” Trump signed an executive order Monday, saying: “It’s a ridiculous situation. We’re going back to plastic straws” …",
    "link": "https://financialpost.com/pmn/back-to-plastic-trump-pushes-for-plastic-straws-as-he-declares-paper-ones-dont-work",
    "timestamp": "2025-02-10T22:52:51Z"
  },
  {
    "title": "EU to mimic Trump’s approach to foreign aid – Bloomberg",
    "description": "The EU will revamp its multi-billion-euro foreign aid program amid concerns over its budget, Bloomberg has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612481-eu-foreign-aid-strategic-interests/",
    "timestamp": "2025-02-10T22:52:17Z"
  },
  {
    "title": "Critical health and science research is on the chopping block as Trump actions trigger shutdowns and confusion | CNN",
    "description": "Universities that do breakthrough-level studies are scrambling to understand the effects as their funding agencies slash their budgets.",
    "link": "https://www.cnn.com/2025/02/10/climate/trump-threatens-health-science-research/index.html",
    "timestamp": "2025-02-10T22:51:33Z"
  },
  {
    "title": "Google Officially Changes Name Of Gulf of Mexico to ‘Gulf Of America’",
    "description": "Google Maps officially changed the name of The Gulf of Mexico to The Gulf of America on Monday, weeks after the company said it would do so in compliance with an executive order signed by President Donald Trump. Trump proclaimed he would be changing the name …",
    "link": "https://www.mediaite.com/news/google-officially-changes-name-of-gulf-of-mexico-to-gulf-of-america/",
    "timestamp": "2025-02-10T22:50:57Z"
  },
  {
    "title": "'Back to plastic': Trump signs order for plastic straws as he declares paper ones 'don’t work'",
    "description": "President Donald Trump says he is banning federal use of paper straws, saying they “don’t work” and don’t last very long.",
    "link": "https://www.ksat.com/business/2025/02/10/back-to-plastic-trump-pushes-for-plastic-straws-as-he-declares-paper-ones-dont-work/",
    "timestamp": "2025-02-10T22:50:08Z"
  },
  {
    "title": "Transgender Recruits and Gender-Affirming Health Care Restricted by Hegseth Memo",
    "description": "All military services must pause accepting recruits with histories of gender dysphoria and halt some gender-affirming health care for transgender service members, Defense Secretary Pete Hegseth ordered in a memo revealed Monday.",
    "link": "https://www.military.com/daily-news/2025/02/10/transgender-recruits-and-gender-affirming-health-care-restricted-hegseth-memo.html",
    "timestamp": "2025-02-10T22:49:56Z"
  },
  {
    "title": "Open AI Chief Sam Altman Rejects $97.4 Billion Offer From Elon Musk, Ari Emanuel and Other Investors for Control of AI Giant",
    "description": "Open AI CEO Sam Altman and Elon Musk sparred publicly Monday after the Wall Street Journal reported that Musk and other investors have fielded a $97.4 billion offer to take control of the AI giant. The Journal published a story on the deal Monday. By midday, …",
    "link": "https://variety.com/2025/biz/news/open-ai-sam-altman-elon-musk-reject-ai-1236303087/",
    "timestamp": "2025-02-10T22:49:33Z"
  },
  {
    "title": "Trump to consider exemption for Australia on steel tariffs, PM says",
    "description": "U.S. President Donald Trump has agreed to consider an exemption for Australia over steel and aluminium tariffs, Prime Minister Anthony Albanese said on Tuesday.",
    "link": "https://biztoc.com/x/50f89885d392870b",
    "timestamp": "2025-02-10T22:49:30Z"
  },
  {
    "title": "Asian Stocks Set to Gain as US Brushes Off Tariffs: Markets Wrap",
    "description": "Stocks in Asia are set to advance after US traders looked past concerns over tariff threats and toward Federal Reserve comments and inflation data. The dollar strengthened and gold hit a record.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-set-to-gain-as-us-brushes-off-tariffs-markets-wrap",
    "timestamp": "2025-02-10T22:49:10Z"
  },
  {
    "title": "Trump imposes 25% tariff on steel, aluminum",
    "description": "United States President Donald Trump signed an executive order placing a 25% tariff on steel and aluminum, as he had previously announced.Furthermore, Trump ruled out the possibility that there would ...",
    "link": "https://biztoc.com/x/e554f71933b50a7a",
    "timestamp": "2025-02-10T22:48:52Z"
  },
  {
    "title": "A Trump executive order reportedly has ended a racial discrimination probe at Tesla",
    "description": "A recent executive order kneecapped a key Labor Department office responsible for investigating federal contractors — including Elon Musk’s Tesla — that have been accused of workplace discrimination.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/elon-musk-tesla-discrimination-trump-order-eeoc-rcna191545",
    "timestamp": "2025-02-10T22:47:12Z"
  },
  {
    "title": "Chiefs Fans, Swifties Blame Donald Trump For Embarrassing Loss In The Super Bowl: “His Demonic Presence Is Blocking Tay’s Prayers”",
    "description": "You sure it wasn’t the quarterback’s fault? Despite going into the Super Bowl as the favorites to win their third straight Lombardi Trophy, the Kansas Cit",
    "link": "https://www.newsbreak.com/share/3800272383802-chiefs-fans-swifties-blame-donald-trump-for-embarrassing-loss-in-the-super-bowl-his-demonic-presence-is-blocking-tay-s-prayers?s=a2&share_destination_id=NDYyODg5NTEtMTczOTIyNzQwNzQ3OA%3D%3D&pd=038DrzfL&hl=en_US&send_time=1739227407&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v6",
    "timestamp": "2025-02-10T22:45:14Z"
  },
  {
    "title": "Trump reveals whether he sees JD Vance as his successor (Fox News)",
    "description": "Fox News:\nTrump reveals whether he sees JD Vance as his successor  —  President Donald Trump sits down with Fox News anchor Bret Baier for an exclusive interview.",
    "link": "https://www.memeorandum.com/250210/p112",
    "timestamp": "2025-02-10T22:45:01Z"
  },
  {
    "title": "I am pleased to announce that Ric Grenell will serve as the Interim Executive Director of The Kennedy Center.",
    "description": "I am pleased to announce that Ric Grenell will serve as the Interim Executive Director of The Kennedy Center. Ric shares my Vision for a GOLDEN AGE of American Arts and Culture, and will be overseeing the daily operations of the Center. NO MORE DRAG SHOWS, OR…",
    "link": "https://freerepublic.com/focus/f-news/4296545/posts",
    "timestamp": "2025-02-10T22:45:00Z"
  },
  {
    "title": "No, That's Not Patrick Mahomes: Millions View Deepfake Super Bowl Video",
    "description": "'I'm a choker, I'm a trash can. Jalen Hurts absolutely destroyed me tonight,\" the fake Mahomes says.",
    "link": "https://www.cnet.com/tech/no-thats-not-patrick-mahomes-millions-view-deepfake-super-bowl-video/",
    "timestamp": "2025-02-10T22:44:00Z"
  },
  {
    "title": "American Bar Association Rips Trump And Musk In Scathing Statement For Acting ‘Contrary to the Rule of Law’",
    "description": "\"This is chaotic. It may appeal to a few. But it is wrong. And most Americans recognize it is wrong. It is also contrary to the rule of law.\"\nThe post American Bar Association Rips Trump And Musk In Scathing Statement For Acting ‘Contrary to the Rule of Law’ …",
    "link": "https://www.mediaite.com/politics/american-bar-association-rips-trump-and-musk-for-acting-contrary-to-the-rule-of-law/",
    "timestamp": "2025-02-10T22:43:38Z"
  },
  {
    "title": "Trump’s all-out assault on woke is tearing down the left’s cultural sway",
    "description": "Fashionable progressive ideas that have long been ascendant, including DEI and gender ideology, have received hammer blows since Trump’s inauguration, and there’s more to come.",
    "link": "https://nypost.com/2025/02/10/opinion/trumps-war-on-woke-is-tearing-down-the-lefts-cultural-sway/",
    "timestamp": "2025-02-10T22:43:10Z"
  },
  {
    "title": "What's wrong with US shipbuilding? A top Trump advisor called it an 'absolute mess' as Musk's DOGE eyes military waste",
    "description": "The US Navy's shipbuilding problems are widespread and not easily solvable, and many of its top programs are over budget and delayed.",
    "link": "https://www.businessinsider.com/doge-is-eyeing-dod-trump-team-calls-out-shipbuilding-mess-2025-2",
    "timestamp": "2025-02-10T22:42:02Z"
  },
  {
    "title": "PBS Closes DEI Office to Comply With Trump Executive Order",
    "description": "The decision comes three weeks after the President terminated DEI programs in the federal workforce\nThe post PBS Closes DEI Office to Comply With Trump Executive Order appeared first on TheWrap.",
    "link": "https://www.thewrap.com/pbs-closes-dei-offices-after-trump-executive-order/",
    "timestamp": "2025-02-10T22:41:25Z"
  },
  {
    "title": "Apple fixes iPhone and iPad bug exploited in ‘extremely sophisticated attacks’",
    "description": "Apple released iOS and iPadOS updates to address a zero-day likely exploited in extremely sophisticated attacks targeting specific individuals. Apple released emergency security updates to address a zero-day vulnerability, tracked as CVE-2025-24200, that the …",
    "link": "https://securityaffairs.com/174066/hacking/apple-fixes-iphone-and-ipad-bug-exploited-in-extremely-sophisticated-attacks.html",
    "timestamp": "2025-02-10T22:41:22Z"
  },
  {
    "title": "Trump calls for halting penny production, saying it's too expensive",
    "description": "RICHMOND, VIRGINIA — The lowly penny, the forgotten mainstay of coin jars and car cupholders everywhere, may soon be no more.\n\n\nPresident Donald Trump announced Sunday he's ordered his administration to cease production of the 1-cent coin, whose buying power …",
    "link": "https://www.voanews.com/a/trump-calls-for-halting-penny-production-saying-it-s-too-expensive-/7969975.html",
    "timestamp": "2025-02-10T22:39:24Z"
  },
  {
    "title": "Trump to Order Crackdown on D.C. Crime",
    "description": "\"President Donald Trump is expected to issue an executive order commanding federal agencies to pursue tougher penalties for both violent and petty crimes, clear homeless camps, and clean graffiti in the District of Columbia,\" the",
    "link": "https://politicalwire.com/2025/02/10/trump-to-order-crackdown-on-d-c-crime/",
    "timestamp": "2025-02-10T22:38:59Z"
  },
  {
    "title": "Trump’s Federal Worker “Buyout” Hits Yet Another Legal Hurdle",
    "description": "A federal judge has indefinitely extended the deadline for federal workers to accept Donald Trump’s buyout offer.\r\nThe president had posed a “fork in the road” ultimatum for federal employees via the Office of Personnel Management late last month: Either opt …",
    "link": "https://newrepublic.com/post/191374/donald-trump-federal-worker-buyout-legal-hurdle",
    "timestamp": "2025-02-10T22:38:57Z"
  },
  {
    "title": "Canadian businesses already feeling the effects of Trump's steel, aluminum tariff threat",
    "description": "Canadian steel and aluminum businesses are already feeling the consequences — and the déjà vu — of Donald Trump's latest tariff threat, several years after he targeted the same industries with a punishing import tax.",
    "link": "https://www.cbc.ca/news/business/steel-aluminum-industry-reaction-1.7455286",
    "timestamp": "2025-02-10T22:38:50Z"
  },
  {
    "title": "FBI finds secret JFK assassination records after Trump order",
    "description": "The FBl just discovered about 2,400 records tied to President Kennedy's assassination that were never provided to a board tasked with reviewing and disclosing the documents, Axios has learned. • The still-secret records are contained in 14,000 pages of docume…",
    "link": "https://freerepublic.com/focus/f-news/4296543/posts",
    "timestamp": "2025-02-10T22:38:38Z"
  },
  {
    "title": "It’s Time to Worry About DOGE’s AI Plans",
    "description": "Welcome to the end of the human civil servant.",
    "link": "https://www.theatlantic.com/technology/archive/2025/02/doge-ai-plans/681635/",
    "timestamp": "2025-02-10T22:38:19Z"
  },
  {
    "title": "Democratic Governor Praises Trump's 'Great' Penny Decision",
    "description": "Colorado's Democratic Governor Jared Polis praised Donald Trump after the president said he instructed the secretary of the U.S. Treasury to stop minting pennies due to cost.\nNewsweek reached out to Polis' office via email on Monday for comment.\nWhy It Matter…",
    "link": "https://biztoc.com/x/7b4493e3f06724dd",
    "timestamp": "2025-02-10T22:38:05Z"
  },
  {
    "title": "Trump’s latest tariff plans on steel, aluminum and other imports sow uncertainty",
    "description": "President Donald Trump plans to on Monday formally announce 25 percent tariffs on steel and aluminum imports as part of an aggressive effort to remake the existing terms of world trade that so far has compounded economic uncertainty.",
    "link": "https://biztoc.com/x/c6064124506f09a6",
    "timestamp": "2025-02-10T22:38:00Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "RICHMOND, Va. — The lowly penny, the forgotten mainstay of coin jars and car cupholders everywhere, may soon be no more.\nPresident Donald Trump announced Sunday he’s ordered his administration to cease production of the 1-cent coin, whose buying power is long…",
    "link": "https://biztoc.com/x/047bf6dc7dd53353",
    "timestamp": "2025-02-10T22:37:57Z"
  },
  {
    "title": "RFK Jr. HHS Confirmation Live Updates: Sen. Susan Collins Says She’ll Support Kennedy",
    "description": "RFK Jr. passed a key Senate committee vote after a holdout GOP lawmaker, Sen. Bill Cassidy, backed him.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/10/rfk-jr-hhs-confirmation-live-updates-sen-susan-collins-says-shell-support-kennedy/",
    "timestamp": "2025-02-10T22:37:43Z"
  },
  {
    "title": "Elon Musk-led group makes $97.4bn bid for OpenAI",
    "description": "Musk's bid could ratchet up longstanding tensions with OpenAI CEO Sam Altman over the future of the startup.",
    "link": "https://www.aljazeera.com/economy/2025/2/10/elon-musk-led-group-makes-97-4bn-bid-for-openai",
    "timestamp": "2025-02-10T22:37:07Z"
  },
  {
    "title": "Trump’s latest tariff plans on steel, aluminum and other imports sow uncertainty",
    "description": "President Donald Trump plans to on Monday formally announce 25 percent tariffs on steel and aluminum imports as part of an aggressive effort to remake the existing terms of world trade that so far has compounded economic uncertainty.",
    "link": "https://www.pbs.org/newshour/economy/trumps-latest-tariff-plans-on-steel-aluminum-and-other-imports-sow-uncertainty",
    "timestamp": "2025-02-10T22:36:36Z"
  },
  {
    "title": "More Than 100 Groups Slam Trump Over Plan To Ethnically Cleanse Gaza",
    "description": "The letter condemns the president's startling remarks about taking control of Gaza and permanently removing Palestinians with no right to return to their homeland.",
    "link": "https://www.huffpost.com/entry/100-groups-slam-trump-ethnically-cleanse-gaza_n_67aa56aee4b0ade4a9a375dc",
    "timestamp": "2025-02-10T22:36:30Z"
  },
  {
    "title": "USAID Employees Barred From Entering Headquarters Despite Judge Blocking Trump's Purge of Agency",
    "description": "USAID employees were denied entry to their headquarters despite a judge's ruling blocking Trump's purge.",
    "link": "https://www.ibtimes.com/usaid-employees-barred-entering-headquarters-despite-judge-blocking-trumps-purge-agency-3763179",
    "timestamp": "2025-02-10T22:36:23Z"
  },
  {
    "title": "5 of the Worst USAID Scandals in History",
    "description": "The agency's low points, from working with child sex abusers to enabling drug traffickingTo build the case for taking down the U.S. Agency for International Development (USAID), the White House has highlighted some of the most egregious-sounding diversity, eq…",
    "link": "https://freerepublic.com/focus/f-news/4296540/posts",
    "timestamp": "2025-02-10T22:35:17Z"
  },
  {
    "title": "DOGE vs. Deep State",
    "description": "In this week's Reason Roundtable, we assess the first steps taken by the Department of Government Efficiency to cut government spending.",
    "link": "https://reason.com/podcast/2025/02/10/doge-vs-deep-state/",
    "timestamp": "2025-02-10T22:33:29Z"
  },
  {
    "title": "Donald Trump Admits He Doesn't See JD Vance As His Successor",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_28aa1cd9-9e1c-421d-b13c-f4fb51cf03d7",
    "timestamp": "2025-02-10T22:33:00Z"
  },
  {
    "title": "No, Trump didn't blame Chiefs' 2025 Super Bowl loss on DEI, USAID and Taylor Swift",
    "description": "In a social media post, President Donald Trump blamed the Kansas City Chiefs’ Super Bowl loss on DEI, USAID and Taylor Swift.",
    "link": "https://www.snopes.com//fact-check/super-bowl-trump-taylor-swift/",
    "timestamp": "2025-02-10T22:33:00Z"
  },
  {
    "title": "Donald Trump Admits He Doesn't See JD Vance As His Successor",
    "description": "After Brett Baier asked Trump if he saw Vance as his successor, the president quickly said, \"No,\" though he conceded his vice president was \"very capable.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-jd-vance-not-my-successor_n_67aa7179e4b038077c882007",
    "timestamp": "2025-02-10T22:33:00Z"
  },
  {
    "title": "Democratic Governor Praises Trump's 'Great' Penny Decision",
    "description": "Colorado Governor Jared Polis cheered Trump's move for additional environmental benefits if the penny's production is haulted.",
    "link": "https://www.newsweek.com/democratic-governor-praises-trumps-great-penny-decision-2029122",
    "timestamp": "2025-02-10T22:32:55Z"
  },
  {
    "title": "I Worked on Employment Law Until Trump Fired Me. Here’s the Truth About DEI.",
    "description": "In rush to eliminate all traces of DEIA programs from the government, it seems almost inevitable that more employers will violate the civil rights laws.",
    "link": "https://slate.com/news-and-politics/2025/02/donald-trump-fired-me-dei-truth.html",
    "timestamp": "2025-02-10T22:31:58Z"
  },
  {
    "title": "How U.S. planned to annexed Canada if victorious in a larger war with Britain",
    "description": "If the U.S. lost, they assumed Canada would ask for 'Alaska be awarded to her,' notes short-lived 1930s war strategy War Plan Red",
    "link": "https://nationalpost.com/news/canada/war-plan-red-us-canada-britain",
    "timestamp": "2025-02-10T22:31:49Z"
  },
  {
    "title": "Trump's ban on gender-affirming care for young people puts hospitals in a bind",
    "description": "Hospitals and clinics that have offered gender-affirming treatments to transgender youth reacted in a variety of ways to an executive order that aims to halt the care.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/02/10/nx-s1-5292390/trump-transgender-gender-affirming-care-hospital",
    "timestamp": "2025-02-10T22:31:03Z"
  },
  {
    "title": "Elon Musk will decide the fate of Social Security and Medicare. Time to panic. | Opinion - NewsBreak",
    "description": "If you rely on Social Security or Medicare or Medicaid , it’s time to panic. If you care about your personal data – like your Social Security number or ba",
    "link": "https://www.newsbreak.com/share/3798093635201-elon-musk-will-decide-the-fate-of-social-security-and-medicare-time-to-panic-opinion?_f=app_share&amp;pd=07ZaHgKj&amp;lang=en_US&amp;send_time=1739214159&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.51.0.21%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_rank_exp_25q1-v5&amp;s=i0",
    "timestamp": "2025-02-10T22:30:59Z"
  },
  {
    "title": "Trump Wins Again: Electric-Focused Car Ads Absent from Super Bowl After Exploding on Biden's Watch",
    "description": "Donald Trump made history on Sunday as the first sitting president to attend the Super Bowl. The NFL celebrated Trump's appearance by removing the phrase \"End Racism\" from the end zones for the first time since 2021, an acknowledgment of the president's succe…",
    "link": "https://freebeacon.com/culture/trump-wins-again-electric-focused-car-ads-absent-from-super-bowl-after-exploding-on-bidens-watch/",
    "timestamp": "2025-02-10T22:30:36Z"
  },
  {
    "title": "Final Curtain: Trump Ousts KJP, Other Biden Appointees From Kennedy Center Board",
    "description": "The John F. Kennedy Center for the Performing Arts removed more than a dozen Joe Biden-appointed board members after President Donald Trump announced plans to fire \"multiple individuals.\"\nThe post Final Curtain: Trump Ousts KJP, Other Biden Appointees From Ke…",
    "link": "https://freebeacon.com/latest-news/final-curtain-trump-ousts-kjp-other-biden-appointees-from-kennedy-center-board/",
    "timestamp": "2025-02-10T22:30:11Z"
  },
  {
    "title": "Elon Musk-led group makes $97.4bn bid for OpenAI",
    "description": "Offer comes months after billionaire sued AI start-up to block it from transitioning to a for-profit firm",
    "link": "https://www.irishtimes.com/world/us/2025/02/10/elon-musk-led-group-makes-974bn-bid-for-openai/",
    "timestamp": "2025-02-10T22:30:03Z"
  },
  {
    "title": "GOP rebels mutiny against House leaders as Trump budget bill talks hit impasse",
    "description": "House Freedom Caucus members released their own plan for the budget reconciliation process on Monday amid an impasse between Senate and House leaders.",
    "link": "https://www.foxnews.com/politics/gop-rebels-mutiny-against-house-leaders-trump-budget-bill-talks-hit-impasse",
    "timestamp": "2025-02-10T22:29:32Z"
  },
  {
    "title": "Lockheed Martin will pay Pentagon millions over F-35 overcharging allegations",
    "description": "For the second time, Lockheed Martin will pay the Pentagon over alleged unfair pricing on F-35 contracts.",
    "link": "https://www.usatoday.com/story/news/politics/2025/02/10/lockheed-martin-doj-settle-f35-overcharge-claims/78385079007/",
    "timestamp": "2025-02-10T22:29:23Z"
  },
  {
    "title": "China’s Green Bond Debut Is Chance to Capitalize on US Retreat",
    "description": "China’s impending listing of an inaugural sovereign green bond in London will test appetite among international investors to shift climate bets to the world’s top polluter.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-green-bond-debut-is-chance-to-capitalize-on-us-retreat",
    "timestamp": "2025-02-10T22:28:49Z"
  },
  {
    "title": "With Education Department Under Threat, What Student Loan Borrowers Can Do",
    "description": "President Trump and Elon Musk are threatening the Education Department. Nothing has concretely changed for borrowers, yet. Download your student loan repayment history and monitor your credit report to be proactive.",
    "link": "https://www.nerdwallet.com/article/loans/student-loans/education-department-threats-and-what-borrowers-can-do#article",
    "timestamp": "2025-02-10T22:28:33Z"
  },
  {
    "title": "Australia's PM: Trump considering tariff exemption",
    "description": "Australia's Prime Minister Anthony Albanese spoke on the phone with United States President Donald Trump and stated that the latter leader agreed to consider exempting Australia from tariffs on steel ...",
    "link": "https://biztoc.com/x/d9136e722283dd52",
    "timestamp": "2025-02-10T22:27:19Z"
  },
  {
    "title": "'Shocking': Fox News host taken aback as Trump snubs his own VP for potential successor",
    "description": "President Donald Trump isn’t ready to commit to making his vice president the successor of the MAGA movement – at least not yet.Trump on Sunday night refused to throw his support behind his vice president ascending to the top of the Republican Party ticket in…",
    "link": "https://www.rawstory.com/trump-vance-2671128637/",
    "timestamp": "2025-02-10T22:27:03Z"
  },
  {
    "title": "Elon Musk-led group makes $97.4bn bid for ChatGPT maker OpenAI",
    "description": "The billionaire's attorney, Marc Toberoff, confirmed he submitted the bid for \"all assets\" of the company on Monday.",
    "link": "https://www.bbc.co.uk/news/articles/cpdx75zgg88o",
    "timestamp": "2025-02-10T22:25:37Z"
  },
  {
    "title": "Trump Removes Government Ethics Chief",
    "description": "“President Donald Trump has removed the director of the Office of Government Ethics, an official tasked with ensuring government workers comply with conflict of interest and ethics requirements,” Politico reports.",
    "link": "https://politicalwire.com/2025/02/10/trump-removes-government-ethics-chief/",
    "timestamp": "2025-02-10T22:25:28Z"
  },
  {
    "title": "Tariff exemption for Australian steel and aluminium exports 'under consideration'",
    "description": "Prime Minister Anthony Albanese says he and US President Donald Trump agreed to work \"constructively together\" during a crucial phone call this morning.",
    "link": "https://www.abc.net.au/news/2025-02-11/albanese-trump-phone-call-steel-and-aluminium-tariffs/104921760",
    "timestamp": "2025-02-10T22:25:12Z"
  },
  {
    "title": "Trump administration appeals federal judge's order to unfreeze federal funds",
    "description": "U.S. District Judge John McConnell issued a new motion ordering the Trump administration to unfreeze federal funds, after already doing so in January.",
    "link": "https://www.foxnews.com/politics/trump-administration-appeals-federal-judges-order-unfreeze-federal-funds",
    "timestamp": "2025-02-10T22:24:27Z"
  },
  {
    "title": "FBI Warns Android & IPhone Smartphone Users To Delete Text Messages Containing Road Toll Scam",
    "description": "The FBI warned about a scam involving text messages demanding recipients pay unpaid road tolls and that users should delete it asap.",
    "link": "https://hiphopwired.com/2603998/fbi-warns-about-road-toll-text-message-scame-detials/",
    "timestamp": "2025-02-10T22:24:21Z"
  },
  {
    "title": "Tiger Woods withdraws from his signature event as he processes death of his mother",
    "description": "Tiger Woods abruptly withdrew from the Genesis Invitational at Torrey Pines on Monday, saying he was still processing the death of his mother.",
    "link": "https://www.kpbs.org/news/local/2025/02/10/tiger-woods-withdraws-from-his-signature-event-as-he-processes-death-of-his-mother",
    "timestamp": "2025-02-10T22:24:05Z"
  },
  {
    "title": "Do You Still Have to Pay Student Loans if Department of Education is Abolished?",
    "description": "Federal student loan borrowers may wonder whether they must still pay student loans if the Department of Education is abolished.",
    "link": "https://www.newsweek.com/do-you-still-pay-student-loans-if-department-education-abolished-2028990",
    "timestamp": "2025-02-10T22:23:10Z"
  },
  {
    "title": "China’s Retaliatory Tariffs Take Effect on $14 Billion in U.S. Goods",
    "description": "China’s retaliation against President Donald Trump’s tariffs went into effect on Monday, imposing levies of 10% to 15% on a range of key American goods, including liquefied natural gas (LNG), coal, agricultural equipment, and automotive products.\nThe post Chi…",
    "link": "https://www.breitbart.com/asia/2025/02/10/chinas-retaliatory-tariffs-take-effect-on-14-billion-in-u-s-goods/",
    "timestamp": "2025-02-10T22:23:00Z"
  },
  {
    "title": "Trump removes director of government ethics office",
    "description": "President Donald Trump removed David Huitema as director of the U.S. Office of Government Ethics, the agency said.",
    "link": "https://www.cnbc.com/2025/02/10/trump-removes-director-of-government-ethics-office.html",
    "timestamp": "2025-02-10T22:22:59Z"
  },
  {
    "title": "Trump removes top government ethics czar | CNN Politics",
    "description": "President Donald Trump is removing the head of the Office of Government Ethics from his post, the agency said Monday – the latest example of Trump acting against a government watchdog.",
    "link": "https://www.cnn.com/2025/02/10/politics/office-of-government-ethics-david-huitema-trump/index.html",
    "timestamp": "2025-02-10T22:21:46Z"
  },
  {
    "title": "FTC Names General Counsel and Heads of Consumer Protection and Competition Bureaus",
    "description": "The Federal Trade Commission has a new general counsel and two new heads of bureaus. FTC Chairman Andrew N. Ferguson announced the appointments Monday (Feb. 10). The new director of the FTC’s Bureau of Consumer Protection is Christopher Mufarrige, a consumer …",
    "link": "https://www.pymnts.com/news/regulation/2025/ftc-names-general-counsel-heads-consumer-protection-competition-bureaus/",
    "timestamp": "2025-02-10T22:21:25Z"
  },
  {
    "title": "Trump Just Utterly Humiliated JD Vance",
    "description": "Vice President JD Vance is exactly as irrelevant to Donald Trump as he is to everyone else. \r\nIn an interview Sunday with Fox News’s Bret Baier, Trump threw Vance under the bus when asked about the future for the former never-Trump Republican who sold out his…",
    "link": "https://newrepublic.com/post/191372/donald-trump-jd-vance-humiliated",
    "timestamp": "2025-02-10T22:21:14Z"
  },
  {
    "title": "HIV infections could jump over 6 times if US support is dropped and not replaced, UNAIDS chief says",
    "description": "The head of the U.N. AIDS agency says the number of new HIV infections could jump more than six times by 2029 if American support of the biggest AIDS program is dropped.",
    "link": "https://www.ksat.com/health/2025/02/10/hiv-infections-could-jump-over-6-times-if-us-support-is-dropped-and-not-replaced-unaids-chief-says/",
    "timestamp": "2025-02-10T22:20:24Z"
  },
  {
    "title": "17,000 South Africans Apply for Refugee Status as Local Afrikaners Urge Trump: “Help us Here” and Elon Musk Calls for Arrest of Radical Who Sang “Kill the Boer”",
    "description": "As 17,000 South Africans seek refugee status following President Trump's Executive Order, tensions rise as Afrikaners voice urgent pleas for autonomy amidst escalating violence and calls for accountability against radical rhetoric.\nThe post 17,000 South Afric…",
    "link": "https://www.thegatewaypundit.com/2025/02/17000-south-africans-apply-refugee-status-as-local/",
    "timestamp": "2025-02-10T22:20:13Z"
  },
  {
    "title": "Super Bowl halftime performer 'banned for life' from NFL events after waving flags in protest - NewsBreak",
    "description": "The NFL said the person was part of the 400-member field cast and had hidden the flag on himself before the halftime show began Sunday night.",
    "link": "https://www.newsbreak.com/share/3799768440230-super-bowl-halftime-performer-banned-for-life-from-nfl-events-after-waving-flags-in-protest?s=a2&amp;share_destination_id=MjQ2MjkwOTU0LTE3MzkyMjU5MjcwNTk%3D&amp;pd=0GfPWkuH&amp;hl=en_US&amp;send_time=1739225927&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v7",
    "timestamp": "2025-02-10T22:19:55Z"
  },
  {
    "title": "What the polls can tell us about the early days of Trump's second term: From the Politics Desk",
    "description": "What the polls shows the public thinks about the early days of President Donald Trump's administration.",
    "link": "https://www.nbcnews.com/politics/polls-early-days-trump-second-term-politics-desk-rcna191561",
    "timestamp": "2025-02-10T22:19:44Z"
  },
  {
    "title": "Judge Rules Trump Officials Are Defying Order to Reverse Funding Freeze",
    "description": "Some Trump officials have said they may ignore future court rulings, which could result in a constitutional crisis.",
    "link": "https://truthout.org/articles/judge-rules-trump-officials-are-defying-order-to-reverse-funding-freeze/",
    "timestamp": "2025-02-10T22:18:51Z"
  },
  {
    "title": "Super Bowl 2026 Location: Where Is Game 60 Being Played?",
    "description": "With the win from the Philadelphia Eagles at Super Bowl LIX, learn more about the 2026 Super Bowl below.",
    "link": "https://hollywoodlife.com/feature/where-is-super-bowl-60-being-played-5369569/",
    "timestamp": "2025-02-10T22:18:00Z"
  },
  {
    "title": "Trump is Sending IRS Agents to the Border",
    "description": "George @BehizyTweets HOLY COW! President Trump wasn't joking about sending IRS agents to the border. DHS just deputized them as immigration agents. THIS IS HILARIOUS TO ME  “It is DHS's understanding that the Department of the Treasury has qualified law enf…",
    "link": "https://freerepublic.com/focus/f-news/4296538/posts",
    "timestamp": "2025-02-10T22:17:50Z"
  },
  {
    "title": "Trump is Sending IRS Agents to the Border",
    "description": "George @BehizyTweets HOLY COW! President Trump wasn't joking about sending IRS agents to the border. DHS just deputized them as immigration agents. THIS IS HILARIOUS TO ME  “It is DHS's understanding that the Department of the Treasury has qualified law enf…",
    "link": "https://freerepublic.com/focus/f-bloggers/4296538/posts",
    "timestamp": "2025-02-10T22:17:50Z"
  },
  {
    "title": "Trump to Impose Sweeping Tariffs on Steel, Aluminum Imports",
    "description": "Further reciprocal tariffs are expected later this week.",
    "link": "https://foreignpolicy.com/2025/02/10/trump-tariffs-steel-aluminum-canada-mexico-china/",
    "timestamp": "2025-02-10T22:17:39Z"
  },
  {
    "title": "Today’s update: doing what I can to stop Tulsi Gabbard, Trump’s disastrous pick to protect our national security as DNI.",
    "description": null,
    "link": "https://freerepublic.com/focus/f-chat/4296537/posts",
    "timestamp": "2025-02-10T22:16:16Z"
  },
  {
    "title": "Today’s update: doing what I can to stop Tulsi Gabbard, Trump’s disastrous pick to protect our national security as DNI.",
    "description": null,
    "link": "https://freerepublic.com/focus/f-news/4296537/posts",
    "timestamp": "2025-02-10T22:16:16Z"
  },
  {
    "title": "Musk-led group makes $97.4bn bid for ChatGPT maker OpenAI",
    "description": "The billionaire's attorney, Marc Toberoff, confirmed he submitted the bid for \"all assets\" of the company on Monday.",
    "link": "https://www.bbc.com/news/articles/cpdx75zgg88o",
    "timestamp": "2025-02-10T22:16:05Z"
  },
  {
    "title": "Democrat super-lawyer behind Steele dossier slaps employees with unexpected blow: ‘He’s frankly an a–hole’ (Marc Elias)",
    "description": "WASHINGTON — Democrats are buzzing about powerful party-linked attorney Marc Elias springing a mandatory arbitration clause on employees of his law firm — with insiders speculating about whether the firm has something to hide and accusing Elias of hypocritica…",
    "link": "https://freerepublic.com/focus/f-news/4296536/posts",
    "timestamp": "2025-02-10T22:15:38Z"
  },
  {
    "title": "Fired head of the agency that protects whistleblowers sues Trump, saying he was ousted illegally (Associated Press)",
    "description": "Associated Press:\nFired head of the agency that protects whistleblowers sues Trump, saying he was ousted illegally  —  The recently fired head of the Office of Special Counsel, a federal agency dedicated to protecting whistleblowers, sued President Donald Tru…",
    "link": "https://www.memeorandum.com/250210/p108",
    "timestamp": "2025-02-10T22:15:00Z"
  },
  {
    "title": "Federal judge in NH temporarily blocks executive order that would end birthright citizenship - New Hampshire Public Radio",
    "description": "Federal judge in NH temporarily blocks executive order that would end birthright citizenshipNew Hampshire Public Radio This Man Won Birthright Citizenship for AllThe New York Times How Trump citizenship orders could affect Native AmericansAxios 12:30 Report —…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176174739",
    "timestamp": "2025-02-10T22:13:24Z"
  },
  {
    "title": "Fox News Releases More of Donald Trump’s Super Bowl Interview",
    "description": "The second part of Fox News' Super Bowl interview with President Donald Trump is set to air Monday at 6 p.m. ET on Special Report with Bret Baier. Previews of the interview aired throughout the day on Monday, with the first preview airing on Fox & Friends. Th…",
    "link": "https://www.adweek.com/tvnewser/donald-trump-bret-baier-super-bowl-gaza-strip/",
    "timestamp": "2025-02-10T22:11:18Z"
  },
  {
    "title": "Trump administration ordered to restore all frozen federal spending",
    "description": "A U.S. judge on Monday ordered the Trump administration to fully comply with a previous order lifting its broad freeze on federal spending, after a group of 23 Democratic state attorneys general last week said that some funds remained frozen. \n\n\nU.S. District…",
    "link": "https://www.voanews.com/a/trump-administration-ordered-to-restore-all-frozen-federal-spending/7969952.html",
    "timestamp": "2025-02-10T22:11:17Z"
  },
  {
    "title": "If FEMA didn't exist, could states handle the disaster response alone?",
    "description": "Imagine a world in which a hurricane devastates the Gulf Coast, and the U.S. has no federal agency prepared to quickly send supplies, financial aid and temporary housing assistance.",
    "link": "https://phys.org/news/2025-02-fema-didnt-states-disaster-response.html",
    "timestamp": "2025-02-10T22:10:01Z"
  },
  {
    "title": "A Tour of Black Historical Homes, The Truth About The Red Summer of 1919, Black History Facts You Never Heard About, Unforgettable Moments in Black History and More Unapologetically Black History Month Content",
    "description": "Graphic: Images: Unidentified Photographer, June 1921, Instagram, Afro American Newspapers, Ron Sachs-Pool\r\nYou Heard of the Tulsa Massacre, But I Bet Nobody Told You About Red Summer of 1919.Photo: Unidentified Photographer, June 1921 (Getty Images)\r\nMost Bl…",
    "link": "https://www.theroot.com/a-tour-of-black-historical-homes-the-truth-about-the-r-1851759924",
    "timestamp": "2025-02-10T22:10:00Z"
  },
  {
    "title": "‘Good Use of the Law Degree!’ Chris Cuomo Responds to Megyn Kelly’s Explicit Rant, Invites Her on Show For Debate",
    "description": "NewsNation’s Chris Cuomo responded after Megyn Kelly called him out by name on her radio show last week in a segment about President Donald Trump’s executive order banning transgender athletes from women’s and girls’ sports. Cuomo argued that Kelly attacking …",
    "link": "https://www.mediaite.com/tv/good-use-of-the-law-degree-chris-cuomo-responds-to-megyn-kellys-explicit-rant-invites-her-on-show-for-debate/",
    "timestamp": "2025-02-10T22:08:56Z"
  },
  {
    "title": "I was besmirched as a ‘DEI hire’ at the State Department — well before Trump’s attacks",
    "description": "The U.S. State Department not acknowledging Black History Month is a break from tradition — not only from previous presidents, but also from Trump’s first term.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/state-department-trump-darren-beattie-rcna191552",
    "timestamp": "2025-02-10T22:07:40Z"
  },
  {
    "title": "Venezuelan Government Planes Enter US Airspace to Pick Up Migrants",
    "description": "The flights signaled a rare moment of deportation cooperation between Washington and Caracas despite years of diplomatic tensions.",
    "link": "https://www.newsweek.com/venezuelan-government-planes-us-airspace-migrants-2029100",
    "timestamp": "2025-02-10T22:07:02Z"
  },
  {
    "title": "Trump's citizenship order leaves expecting Indian immigrant parents in limbo",
    "description": "Thousands of Indian-origin couples in the US are anxious over Trump's plan to end birthright citizenship.",
    "link": "https://www.bbc.com/news/articles/c8xq70lw8kvo",
    "timestamp": "2025-02-10T22:07:00Z"
  }
]