[
  {
    "title": "Sam Altman defends Trump's AI chip deals with UAE and Saudi Arabia, calls critics \"naïve\"",
    "description": "During his tour of the area last week, Trump announced a series of agreements with Gulf states, particularly the United Arab Emirates (UAE) and Saudi Arabia, related to exporting AI chips and developing AI infrastructure.Read Entire Article",
    "link": "https://www.techspot.com/news/107964-sam-altman-defends-trump-ai-chip-deals-uae.html",
    "timestamp": "2025-05-19T11:15:00Z"
  },
  {
    "title": "Trump visit bolsters Saudi AI",
    "description": "A new AI datacentre is among the initiatives the White House announced during the president’s Middle East visits",
    "link": "https://www.computerweekly.com/news/366624095/Trump-visit-bolsters-Saudi-AI",
    "timestamp": "2025-05-19T11:15:00Z"
  },
  {
    "title": "US and Iran Clash Over Nuclear Red Lines",
    "description": "The U.S. and Iran remain locked in a standoff over uranium enrichment ahead of a potential new round nuclear talks.",
    "link": "https://www.newsweek.com/us-iran-clash-uranium-enrichment-nuclear-red-lines-2074003",
    "timestamp": "2025-05-19T11:13:49Z"
  },
  {
    "title": "Putin Heads Into Trump Call Confident",
    "description": "“Vladimir Putin believes he has a strong hand ahead of a phone call Monday with Donald Trump as European leaders are trying to prevent the US president from rushing through a deal,” Bloomberg reports. “Putin",
    "link": "https://politicalwire.com/2025/05/19/putin-heads-into-trump-call-confident/",
    "timestamp": "2025-05-19T11:12:56Z"
  },
  {
    "title": "Opinion: Trump's Durbar: Back To 'Pax Americana' In The Gulf?",
    "description": "For its sheer optics, Trump's Gulf tour was quite over the top, with his three hydrocarbon-rich hosts going overboard in offering him mega-deals.",
    "link": "https://www.ndtv.com/opinion/trumps-durbar-back-to-pax-americana-in-the-gulf-8453127",
    "timestamp": "2025-05-19T11:09:47Z"
  },
  {
    "title": "Gleason score 9: How aggressive is Biden’s prostrate cancer?",
    "description": "Biden, 82, has been diagnosed with prostate cancer, the most common form of cancer in US males.",
    "link": "https://www.aljazeera.com/news/2025/5/19/gleason-score-9-how-aggressive-is-bidens-prostrate-cancer",
    "timestamp": "2025-05-19T11:09:36Z"
  },
  {
    "title": "After 'Backroom Deal' to Make Medicaid Cuts Even Worse, GOP Passes Budget Bill Out of Committee",
    "description": "Republicans pushed their massive reconciliation bill through the House Budget Committee late Sunday after striking a deal with GOP hardliners who tanked a vote on the package late last week, complaining that the measure's proposed cuts to Medicaid and other p…",
    "link": "https://www.commondreams.org/news/house-budget-committee",
    "timestamp": "2025-05-19T11:05:49Z"
  },
  {
    "title": "Trade tensions drive consumers to cut back. 'Something has to give,' analyst says",
    "description": "After a bout of panic buying, more consumers are prepared to rein in their spending and live with less, recent studies show. Even President Donald Trump suggested that Americans should be comfortable with fewer things.\n\"[Americans] don't need to have 250 penc…",
    "link": "https://biztoc.com/x/5159b1d6be8e6683",
    "timestamp": "2025-05-19T11:05:29Z"
  },
  {
    "title": "Joe Biden cancer diagnosis and California fertility center bombing suspect: Morning Rundown",
    "description": "Biden is diagnosed with an aggressive form of prostate cancer.",
    "link": "https://www.nbcnews.com/news/us-news/joe-biden-cancer-fertility-center-bombing-morning-rundown-rcna207613",
    "timestamp": "2025-05-19T11:05:00Z"
  },
  {
    "title": "East Coast Citizen Groups Sue Over Unlawful Authorization of Empire Wind Project",
    "description": "Meanwhile, 17 states sue Trump administration for blocking the development of wind energy and 2 dead whales wash up on Rhode Island shores.\nThe post East Coast Citizen Groups Sue Over Unlawful Authorization of Empire Wind Project first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/05/east-coast-citizen-groups-sue-over-unlawful-authorization-of-empire-wind-project/",
    "timestamp": "2025-05-19T11:00:27Z"
  },
  {
    "title": "REP. SARA JACOBS: Military families deserve IVF coverage and Trump’s support",
    "description": "Our service members risk everything to protect this nation. Rep. Sara Jacobs pushes for the IVF for Military Families Act to address infertility struggles faced by military families.",
    "link": "https://www.foxnews.com/opinion/rep-sara-jacobs-military-families-deserve-ivf-coverage-trumps-support",
    "timestamp": "2025-05-19T11:00:24Z"
  },
  {
    "title": "AOC’s Vanishing Engagement Ring. Plus, Owner of Trump’s Qatari Jet Linked to Menendez Scandal.",
    "description": "Put a ring on it: Rep. Alexandria Ocasio-Cortez (D., N.Y.) hasn't been pictured wearing her engagement ring since October 2023, raising questions about the status of her relationship—and potential ethical concerns tied to her longtime partner, Riley Roberts, …",
    "link": "https://freebeacon.com/issues/aocs-vanishing-engagement-ring-plus-owner-of-trumps-qatari-jet-linked-to-menendez-scandal/",
    "timestamp": "2025-05-19T11:00:15Z"
  },
  {
    "title": "Trade tensions drive consumers to cut back. 'Something has to give,' analyst says",
    "description": "Amid ongoing tariff disputes, consumers are prepared to make fewer discretionary purchases, recent studies show.",
    "link": "https://www.cnbc.com/2025/05/19/trade-tensions-spur-consumers-to-spend-less-on-discretionary-purchases.html",
    "timestamp": "2025-05-19T11:00:01Z"
  },
  {
    "title": "Elon Musk's Super Breeding Ways May Be Part Of A Disturbing New Trend.",
    "description": "What's the deal with Elon Musk and Nick Cannon's never-ending quest to father children? We asked sex therapists and pronatalist experts for answers.",
    "link": "https://www.huffpost.com/entry/elon-musks-super-breeding-ways-may-be-part-of-a-disturbing-new-trend-goog_l_68264c26e4b029d8a6109f21",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Trump-Backed Supreme Court Decision Could Quietly Unleash $150 Trillion “Main Street Bailout”, Says Former CIA Advisor",
    "description": "New Supreme Court ruling could unlock the biggest wealth transfer in U.S. history—while most Americans remain unaware New Supreme Court ruling could unlock the biggest wealth transfer in U.S. history—while most Americans remain unaware",
    "link": "https://www.globenewswire.com/news-release/2025/05/19/3083878/0/en/Trump-Backed-Supreme-Court-Decision-Could-Quietly-Unleash-150-Trillion-Main-Street-Bailout-Says-Former-CIA-Advisor.html",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Polling Was Quietly Still Bad in 2024",
    "description": "After nearly a decade of fine-tuning, the industry still hasn’t figured out how to reach enough Donald Trump supporters.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/polling-2024-trump-bias/682834/",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Back from ‘complete hell,’ freed American-Israeli hostage is smiling again, parents say",
    "description": "Back home after more than a year in Hamas captivity, Edan Alexander recalled to his parents his conditions as a hostage.",
    "link": "https://www.nbcnews.com/world/middle-east/back-complete-hell-edan-alexander-smiling-parents-say-rcna207573",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "Inside the Democrats’ Reboot",
    "description": "After the 2024 fiasco, the party is rethinking everything",
    "link": "https://time.com/7286163/inside-the-democratic-party-reboot/",
    "timestamp": "2025-05-19T11:00:00Z"
  },
  {
    "title": "'He’s finished, done, gone': GOP insiders reveal the dramatic crash of Elon Musk",
    "description": "“People hate\" Elon Musk — and the GOP is getting the message, according to a Politico report\r\n.“He’s finished, done, gone. He polls terrible. People hate him,” said a GOP operative that Politico granted anonymity. “He’d go to Wisconsin thinking he can buy peo…",
    "link": "https://www.rawstory.com/musk-2672110698/",
    "timestamp": "2025-05-19T10:59:43Z"
  },
  {
    "title": "DAVID BOSSIE: Congress Should Probe Cover-Up Of Biden’s Cognitive Decline",
    "description": "The years-long, wide-reaching cover-up of former President Joe Biden’s obvious cognitive decline is reaching a fever pitch, and the time has come to answer an important question: what should be done about it? Ever since his basement presidential campaign duri…",
    "link": "https://dailycaller.com/2025/05/19/opinion-congress-should-probe-cover-up-of-bidens-cognitive-decline-david-bossie/",
    "timestamp": "2025-05-19T10:59:32Z"
  },
  {
    "title": "Donald Trump Forwards Shocker Of A Plea For Barack Obama",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_74834d02-5304-4bee-bfa2-c98242001d1e",
    "timestamp": "2025-05-19T10:58:50Z"
  },
  {
    "title": "Donald Trump Forwards Shocker Of A Plea For Barack Obama",
    "description": "The president amplified an extreme message about one of his predecessors.",
    "link": "https://www.huffpost.com/entry/donald-trump-barack-obama-military-tribunal_n_682af5f3e4b02ef0f55d4487",
    "timestamp": "2025-05-19T10:58:50Z"
  },
  {
    "title": "Trump faces a trillion-dollar tariff disappointment",
    "description": "Trump faces a trillion-dollar tariff disappointment\nRevenues from border levies will be lower than he expects\nIn the early 20th century, before America introduced an income tax, tariffs paid many of the government’s bills. President Donald Trump wants to revi…",
    "link": "https://biztoc.com/x/59d6b7e314432c64",
    "timestamp": "2025-05-19T10:54:51Z"
  },
  {
    "title": "How Trump's family-linked crypto deals are threatening a 'Hunter Biden-style' scandal at the White House",
    "description": "Donald Trump risks undercutting his presidency with a Hunter Biden-style influence-peddling scandal unless he clamps down on questionable crypto deals that his family has inked with investors in the Middle East and China, experts told The Post.\nTrump is catch…",
    "link": "https://biztoc.com/x/dd7b1a4288a0f7db",
    "timestamp": "2025-05-19T10:54:49Z"
  },
  {
    "title": "Trump ‘amazed’ by Saudi progress, fellow developer says",
    "description": "The News\nUS President Donald Trump was struck by the scale and quality of the palaces and cities he visited in the Gulf last week, according to a Riyadh-based real estate executive who has known him for more than 40 years.\n“He couldn’t believe” how far things…",
    "link": "https://biztoc.com/x/6a9ced3496153b87",
    "timestamp": "2025-05-19T10:54:38Z"
  },
  {
    "title": "As Apple Faces Pressure After Trump Told Tim Cook To Avoid Manufacturing In India, Expert Warns iPhone Maker's 'Value-Added Growth Is In Danger'",
    "description": "Apple Inc. (NASDAQ:AAPL) confronts a strategic manufacturing dilemma as President Donald Trump directly told CEO Tim Cook to avoid building in India.\nWhat Happened: While Apple ramps up iPhone production in India, experts warn that the recent U.S.-China trade…",
    "link": "https://biztoc.com/x/e16dad91f90e9919",
    "timestamp": "2025-05-19T10:54:37Z"
  },
  {
    "title": "US debt and renewed trade fears spook global markets",
    "description": "The News\nAsian and European stocks fell, the dollar dropped, and US Treasury yields rose on concern over the global economy’s prospects after a downgrade of American debt and renewed tariff warnings from Washington.\nMarkets had enjoyed a reprieve after US Pre…",
    "link": "https://biztoc.com/x/097d11d068339e77",
    "timestamp": "2025-05-19T10:54:33Z"
  },
  {
    "title": "Trump order targets barcodes on ballots. They've long been a source of misinformation",
    "description": "President Donald Trump’s executive order seeking to overhaul how U.S. elections are run includes a somewhat obscure reference to the way votes are counted",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-order-targets-barcodes-ballots-long-source-misinformation-121941835",
    "timestamp": "2025-05-19T10:54:27Z"
  },
  {
    "title": "Donald Trump Jr. Raises 'Cover-up' Question Over Joe Biden Cancer Diagnosis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump Jr. has raised questions about a cover-up after former president Joe Biden was diagnosed with an \"aggressive form\" of prostate cancer.\n\"What I want to know is how did Dr. Jill Biden miss stage fiv…",
    "link": "https://biztoc.com/x/19bfd2c6e5a0629e",
    "timestamp": "2025-05-19T10:54:20Z"
  },
  {
    "title": "Doctors say it’s ‘inconceivable’ Biden’s cancer went undetected by his medical team — as Trump Jr. questions if diagnosis is ‘cover-up’",
    "description": "The 82-year-old former president was diagnosed Friday after doctors found a “small nodule” on his prostate during a medical exam earlier this month -- with the cancer cells having spread to the bone, his spokesman revealed Sunday.",
    "link": "https://nypost.com/2025/05/19/us-news/biden-aggressive-prostate-cancer-diagnosis-leaves-medical-experts-stunned/",
    "timestamp": "2025-05-19T10:51:24Z"
  },
  {
    "title": "Pearl Jam's Eddie Vedder leaps into Trump's Bruce Springsteen fight",
    "description": "Pearl Jam’s Eddie Vedder jumped into the ratcheting row between President Donald Trump and Brcue Springsteen.The singer paid tribute to the New Jersey rocker at a Pittsburgh show just hours after the president called Springsteeen “highly overrated,” dumb as a…",
    "link": "https://www.rawstory.com/bruce-springsteen-trump-2672110705/",
    "timestamp": "2025-05-19T10:50:35Z"
  },
  {
    "title": "Trump To Call Putin In Push For Ukraine Ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022 invasion of Ukraine.",
    "link": "https://www.ibtimes.com/trump-call-putin-push-ukraine-ceasefire-3773955",
    "timestamp": "2025-05-19T10:48:07Z"
  },
  {
    "title": "‘Pretty Humiliating’: John Oliver Cringes At 4 Words Trump Won’t Stop Saying",
    "description": "‘Pretty Humiliating’: John Oliver Cringes At 4 Words Trump Won’t Stop Sayinghuffpost.com",
    "link": "https://www.huffpost.com/entry/john-oliver-donald-trump-media_n_682af67de4b0b2994c199260",
    "timestamp": "2025-05-19T10:47:51Z"
  },
  {
    "title": "Iran offers a new regional paradigm for stability",
    "description": "Iran, considered to be the most affected by the recent regional developments following the regime change in Syria and Israel’s attacks targeting its territories, is offering a new approach of cooperation and unity to the countries in its near neighborhood ami…",
    "link": "https://www.hurriyetdailynews.com/iran-offers-a-new-regional-paradigm-for-stability-209354",
    "timestamp": "2025-05-19T10:47:37Z"
  },
  {
    "title": "Donald Trump Jr. Raises 'Cover-up' Question Over Joe Biden Cancer Diagnosis",
    "description": "Former president Joe Biden has been diagnosed with \"an aggressive form\" of prostate cancer.",
    "link": "https://www.newsweek.com/donald-trump-jr-joe-biden-cancer-2073938",
    "timestamp": "2025-05-19T10:47:12Z"
  },
  {
    "title": "Kash Patel Demands Canada ‘Gets to Steppin” to End Fentanyl Trafficking",
    "description": "FBI Director Kash Patel accused Canada of failing to stem the tide of fentanyl entering the U.S., demanding the northern neighbor “gets to steppin'” in stopping “suspected terrorists” crossing the border. Speaking to Fox Business anchor Maria Bartiromo, Patel…",
    "link": "https://www.mediaite.com/tv/kash-patel-demands-canada-gets-to-steppin-to-end-fentanyl-trafficking/",
    "timestamp": "2025-05-19T10:46:37Z"
  },
  {
    "title": "Trump due for high-stakes phone call with Putin to end Ukraine conflict",
    "description": "Donald Trump will speak with Vladimir Putin to address the Ukraine conflict. This follows calls from European leaders urging Trump to push for peace. Previous talks have stalled due to disagreements. Trump also had tense discussions with Volodymyr Zelenskyy. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-due-for-high-stakes-phone-call-with-putin-to-end-ukraine-conflict/articleshow/121267667.cms",
    "timestamp": "2025-05-19T10:45:55Z"
  },
  {
    "title": "Key House committee advances Trump agenda bill after appeasing conservatives (NBC News)",
    "description": "NBC News:\nKey House committee advances Trump agenda bill after appeasing conservatives  —  The House Budget Committee's vote came two days after a group of GOP hard-liners rejected the package.  —  WASHINGTON — The House Budget Committee advanced President Do…",
    "link": "https://www.memeorandum.com/250519/p2",
    "timestamp": "2025-05-19T10:45:00Z"
  },
  {
    "title": "Trump to call Putin in push for Ukraine ceasefire",
    "description": "WASHINGTON - Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022 invasion of Ukraine.",
    "link": "https://www.bangkokpost.com/world/3029307/trump-to-call-putin-in-push-for-ukraine-ceasefire",
    "timestamp": "2025-05-19T10:45:00Z"
  },
  {
    "title": "Crypto Traders Who Secured A Dinner With Donald Trump Walked Away With Major Profits, Says Analysis",
    "description": "A new investigation has revealed how a Trump-themed cryptocurrency contest led to dramatic financial outcomes for participants.\nWhile some traders walked away with sizeable profits, others may be holding significant losses, all while securing a spot at a priv…",
    "link": "https://biztoc.com/x/2495bf0663fb1178",
    "timestamp": "2025-05-19T10:43:13Z"
  },
  {
    "title": "Trump to call Putin in push for Ukraine ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022...",
    "link": "https://www.yahoo.com/news/trump-call-putin-push-ukraine-104219938.html",
    "timestamp": "2025-05-19T10:42:19Z"
  },
  {
    "title": "Bruce Springsteen ignores question about Trump feud while signing autographs",
    "description": "Springsteen previously called Trump administration \"corrupt, incompetent and treasonous\" during Manchester concert.",
    "link": "https://nypost.com/2025/05/19/entertainment/bruce-springsteen-ignores-question-about-trump-feud-while-signing-autographs/",
    "timestamp": "2025-05-19T10:39:28Z"
  },
  {
    "title": "What's in the UK-EU reset deal?",
    "description": "Prime Minister Keir Starmer hosted EU leaders in London, aiming to improve post-Brexit relations. Discussions focused on a defence and security pact, enhanced trade through sanitary and phytosanitary agreements, and youth mobility schemes. Both sides also exp…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/whats-in-the-uk-eu-reset-deal/articleshow/121267697.cms",
    "timestamp": "2025-05-19T10:36:56Z"
  },
  {
    "title": "Pope Leo XIV Meets US Vice President Ahead Of Ukraine Ceasefire Push",
    "description": "Pope Leo XIV received US Vice President JD Vance and US Secretary of State Marco Rubio at the Vatican Monday, ahead of a US-led push to end the Russia-Ukraine conflict.",
    "link": "https://www.ndtv.com/world-news/pope-leo-xiv-meets-us-vice-president-jd-vance-ahead-of-ukraine-ceasefire-push-8452820",
    "timestamp": "2025-05-19T10:33:50Z"
  },
  {
    "title": "Mike Pence Pushes Back After Trump Slams US Foreign Policy, Praises Saudi Crown Prince Mohammed Bin Salman: 'I've Never Been A Fan Of Presidents Criticizing America Abroad'",
    "description": "Former Vice President Mike Pence criticized President Donald Trump during an interview on Sunday for remarks he made during his tour of the Middle East. \nI've never been a fan of American presidents criticizing America on foreign soil,\" Pence said.\nWhat Happe…",
    "link": "https://biztoc.com/x/b61456fcba5a3bfe",
    "timestamp": "2025-05-19T10:32:13Z"
  },
  {
    "title": "Trump's tariff onslaught casts shadow over European economy, even in best case scenario",
    "description": "U.S. President Donald Trump’s tariff offensive has led European officials have cut back their growth forecasts for this year and next, even in a best-case scenario in which the highest rates on most goods could be negotiated away.",
    "link": "https://www.clickondetroit.com/business/2025/05/19/trumps-tariff-onslaught-casts-shadow-over-european-economy-even-in-best-case-scenario/",
    "timestamp": "2025-05-19T10:31:31Z"
  },
  {
    "title": "Trump's tariff onslaught casts shadow over European economy, even in best case scenario",
    "description": "U.S. President Donald Trump’s tariff offensive has led European officials have cut back their growth forecasts for this year and next, even in a best-case scenario in which the highest rates on most goods could be negotiated away",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariff-onslaught-casts-shadow-european-economy-best-121941135",
    "timestamp": "2025-05-19T10:30:28Z"
  },
  {
    "title": "Dem senator says Biden should have dropped out of presidential race much sooner",
    "description": "Sen. Chris Murphy, D-Conn., said Joe Biden should have dropped out of the presidential race sooner, claiming there was 'no doubt' it would have been better for the Democrats had he done so.",
    "link": "https://www.foxnews.com/media/dem-senator-says-biden-should-have-dropped-out-presidential-race-much-sooner",
    "timestamp": "2025-05-19T10:30:27Z"
  },
  {
    "title": "Jill Biden Accused of Playing Gatekeeper on Joe’s Health—Trump Jr. Drops the Bombshell",
    "description": "Donald Trump Jr. accuses Jill Biden of hiding the news of Joe Biden's cancer diagnosis. Here's what the President's son said about the announcement.",
    "link": "https://www.inquisitr.com/jill-biden-accused-of-playing-gatekeeper-on-joes-health-trump-jr-drops-the-bombshell",
    "timestamp": "2025-05-19T10:30:08Z"
  },
  {
    "title": "De-escalation and new normals: Does today’s churn have a limit?",
    "description": "Globally, actions once unthinkable are finding acceptance, be it in the arena of trade, terrorism or security. With step-ups, climb-downs and new normals, a big churn is on. But how far can these revolutions go?",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-narendra-modi-china-tariffs-wto-crisis-india-pakistan-conflict-abraham-accords-syria-sanctions-us-inflation-11747553954706.html",
    "timestamp": "2025-05-19T10:30:08Z"
  },
  {
    "title": "EU leaders relieved after centrist Dan wins Romanian presidency",
    "description": "BUCHAREST - Romania's European allies and markets welcomed centrist Nicusor Dan's presidential election victory over the eurosceptic hard-right on Sunday, relieved that the European Union member avoided a lurch to a Donald Trump-inspired political path.",
    "link": "https://www.bangkokpost.com/world/3029287/eu-leaders-relieved-after-centrist-dan-wins-romanian-presidency",
    "timestamp": "2025-05-19T10:30:00Z"
  },
  {
    "title": "'Corrupt and unlawful!' Trump comes after megastars Beyoncé and Oprah",
    "description": "President Donald Trump called for investigations of big-name performers who backed Kamala Harris in the 2024 election.The president unspooled a late-night rant against Bruce Springsteen, Oprah Winfrey, Beyoncé and Bono for their support of the vice president …",
    "link": "https://www.rawstory.com/bruce-springsteen-trump/",
    "timestamp": "2025-05-19T10:28:46Z"
  },
  {
    "title": "Trump order targets barcodes on ballots. They’ve long been a source of misinformation",
    "description": "ATLANTA (AP) — President Donald Trump’s executive order seeking to overhaul how U.S. elections are run includes a somewhat obscure reference to the way votes are counted. Voting equipment, it says, should not use ballots that include “a barcode or quick-respo…",
    "link": "https://financialpost.com/pmn/trump-order-targets-barcodes-on-ballots-theyve-long-been-a-source-of-misinformation",
    "timestamp": "2025-05-19T10:27:53Z"
  },
  {
    "title": "US borrowing costs top 5% after Moody’s downgrade",
    "description": "Yields on 30-year US Treasuries hit highest level since 2023 and stock futures fall as investor concerns over debt mount",
    "link": "https://www.irishtimes.com/business/2025/05/19/us-borrowing-costs-top-5-after-moodys-downgrade/",
    "timestamp": "2025-05-19T10:27:22Z"
  },
  {
    "title": "China fully respects Denmark's sovereignty on Greenland, foreign minister says",
    "description": "BEIJING: China fully respects Denmark's sovereignty and territorial integrity on the Greenland issue, Foreign Minister Wang Yi told his Danish counterpart on Monday (May 19), urging the European nation to reciprocate over China's own sovereignty concerns. Uni…",
    "link": "https://www.channelnewsasia.com/east-asia/china-fully-respects-denmark-greenland-sovereignty-5139111",
    "timestamp": "2025-05-19T10:24:27Z"
  },
  {
    "title": "Trump-Putin call: What’s holding up a Russia-Ukraine ceasefire?",
    "description": "The US president says only Putin and he can stitch together a ceasefire. Their call on Monday will test that theory.",
    "link": "https://www.aljazeera.com/news/2025/5/19/trump-putin-call-whats-holding-up-a-russia-ukraine-ceasefire",
    "timestamp": "2025-05-19T10:24:21Z"
  },
  {
    "title": "Pro-EU centrist wins tense Romania presidential vote rerun",
    "description": "Dan won close to 54 percent of the vote.",
    "link": "https://www.thejournal.ie/nicusor-dan-romania-election-6708762-May2025/",
    "timestamp": "2025-05-19T10:24:12Z"
  },
  {
    "title": "Trump's tariff onslaught casts shadow over European economy, even in best case scenario",
    "description": "U.S. President Donald Trump’s tariff offensive has led European officials have cut back their growth forecasts for this year and next, even in a best-case scenario in which the highest rates on most goods could be negotiated away. The forecast for this year f…",
    "link": "https://www.seattlepi.com/news/world/article/trump-s-tariff-onslaught-casts-shadow-over-20334447.php",
    "timestamp": "2025-05-19T10:23:15Z"
  },
  {
    "title": "Global shares slide and US futures and dollar drop after Moody's downgrade of US credit rating",
    "description": "Global shares are lower after Moody's Ratings downgraded the sovereign credit rating for the United States",
    "link": "https://abcnews.go.com/Business/wireStory/global-shares-slide-us-futures-dollar-drop-after-121937576",
    "timestamp": "2025-05-19T10:22:15Z"
  },
  {
    "title": "Kremlin Confirms Putin-Trump Phone Call Time",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Kremlin said Russian President Vladimir Putin would speak to U.S. President Donald Trump by phone at 5 p.m. Moscow time (10 a.m. ET) on Monday.\nTrump has said he wants to meet with Putin as soon as possibl…",
    "link": "https://biztoc.com/x/c083c7f3d1e72185",
    "timestamp": "2025-05-19T10:21:25Z"
  },
  {
    "title": "Sagui Dekel-Chen embraces fellow hostage Edan Alexander: 'Our fates were bound in hell'",
    "description": "Following heartfelt hospital visit, former hostage Sagui Dekel-Chen recounts shared captivity with newly-released Edan Alexander, who revealed harrowing details of Hamas abuse and the moment he learned his family was fighting for him worldwide.",
    "link": "https://www.israelnationalnews.com/news/408598",
    "timestamp": "2025-05-19T10:21:21Z"
  },
  {
    "title": "Trump's Former VP Mike Pence Calls Qatari Royal Family's Boeing Jet Gift A 'Bad Idea,' Urges President To Reject $400 Million 'Flying Palace'",
    "description": "Former Vice President Mike Pence is urging President Donald Trump to reject a controversial $400 million Boeing Co. (NYSE:BA) 747-8 jumbo jet gift from Qatar’s royal family, citing national security risks and ethical concerns over what would be the largest fo…",
    "link": "https://biztoc.com/x/957a2861eb099348",
    "timestamp": "2025-05-19T10:21:16Z"
  },
  {
    "title": "Kremlin Confirms Putin-Trump Phone Call Time",
    "description": "President Donald Trump is due to speak with Russian President Vladimir Putin about the war in Ukraine.",
    "link": "https://www.newsweek.com/kremlin-confirms-putin-trump-phone-call-time-2074020",
    "timestamp": "2025-05-19T10:19:39Z"
  },
  {
    "title": "Opinion: US-China Deal Is a Lesson for the Global South",
    "description": "The US-China temporary trade agreement is a blunt reminder: Washington&#039;s foreign policy under President Donald Trump is transactional. Deals matter, values don&#039;t.",
    "link": "https://www.ndtv.com/opinion/us-china-deal-is-a-lesson-for-the-global-south-8452672",
    "timestamp": "2025-05-19T10:19:26Z"
  },
  {
    "title": "US Supreme Court may broaden religious rights in looming rulings",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court in a trio of rulings expected in the coming weeks appears inclined to extend its trend of taking an expansive view of religious rights while potentially dealing a sharp blow to the principle of separation of church…",
    "link": "https://www.thestar.com.my/news/world/2025/05/19/us-supreme-court-may-broaden-religious-rights-in-looming-rulings",
    "timestamp": "2025-05-19T10:18:00Z"
  },
  {
    "title": "Trump hopes for ceasefire progress in Russia-Ukraine war in Monday calls with Putin and Zelensky",
    "description": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelensky will make progress toward a ceasefire in the war in Ukraine.",
    "link": "https://nypost.com/2025/05/19/us-news/trump-phone-calls-with-putin-zelensky-hope-to-make-progress-in-russia-ukraine-war/",
    "timestamp": "2025-05-19T10:17:13Z"
  },
  {
    "title": "Texas judge strikes down protections for trans people in the workplace",
    "description": "A federal judge in Texas ruled that Title VII no longer protects LGBTQ+ people from discrimination at work. US District Judge Matthew Kacsmaryk of the Northern District of Texas ruled on Thursday (15 May) that the Equal Employment Opportunity Commission (EEOC…",
    "link": "https://www.thepinknews.com/2025/05/19/texas-judge-rules-title-vii-discrimination-at-work/",
    "timestamp": "2025-05-19T10:16:45Z"
  },
  {
    "title": "How shoddy science is fueling a charge to restrict abortion pill access",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr.",
    "link": "https://www.nbcnews.com/health/womens-health/shoddy-science-fueling-charge-restrict-abortion-pill-access-rcna207034",
    "timestamp": "2025-05-19T10:15:00Z"
  },
  {
    "title": "Right-wing populists hopeful after first round of Polish presidential election",
    "description": "There’s a long way to go yet in Poland’s presidential election but Sunday’s first round was a good day for candidates on the right and far right",
    "link": "https://abcnews.go.com/International/wireStory/wing-populists-hopeful-after-round-polish-presidential-election-121939680",
    "timestamp": "2025-05-19T10:14:25Z"
  },
  {
    "title": "Market Wrap: IT stocks drag D-Street lower; Sensex sheds 271 pts, Nifty below 25,000",
    "description": "Indian benchmark indices Sensex and Nifty closed lower in a subdued session on Monday, dragged down by losses in information technology stocks after Moody’s downgraded the U.S. government’s credit rating.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-it-stocks-drag-d-street-lower-sensex-sheds-271-pts-nifty-below-25000/articleshow/121267191.cms",
    "timestamp": "2025-05-19T10:14:11Z"
  },
  {
    "title": "Sarah Silverman’s father told her that her grandad killed her infant brother ‘in a rage’",
    "description": "Comedian shared the shocking revelation her father told her as she prepares to release a new comedy special, ‘PostMortem’, on Netflix",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/sarah-silverman-dad-brother-jeffrey-death-cause-b2753631.html",
    "timestamp": "2025-05-19T10:13:25Z"
  },
  {
    "title": "How Trump's crypto business partners left their old clients in the lurch",
    "description": "Jonathan Lopez lost $1 million in Dough Finance due to a hack. Dough's founders, Chase Herro and Zak Folkman, then launched World Liberty Financial with the Trumps. Lopez is suing Herro for fraud.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-trumps-crypto-business-partners-left-their-old-clients-in-the-lurch/articleshow/121267140.cms",
    "timestamp": "2025-05-19T10:12:02Z"
  },
  {
    "title": "The ugly truth about Trump’s big, beautiful bill",
    "description": "Speaker of the House Mike Johnson (R-LA) and President Donald Trump at the White House on March 24, 2025. | Jabin Botsford/The Washington Post via Getty Images\nPresident Donald Trump’s second term has so far been dominated by his aggressive use of executive p…",
    "link": "https://biztoc.com/x/2dd729bf3ad4b6a2",
    "timestamp": "2025-05-19T10:09:58Z"
  },
  {
    "title": "Trump Demands ‘Major Investigation’ Into Springsteen, Beyoncé, Oprah for Backing Kamala Harris: ‘CORRUPT & UNLAWFUL!’",
    "description": "President Donald Trump has called for a “major investigation” into Bruce Springsteen night after the rock legend delivered a scathing critique of the president during his UK tour. In a Truth Social post late Sunday night, Trump accused Springsteen of having b…",
    "link": "https://www.mediaite.com/news/trump-demands-major-investigation-into-springsteen-beyonce-oprah-for-backing-kamala-harris-corrupt-unlawful/",
    "timestamp": "2025-05-19T10:08:58Z"
  },
  {
    "title": "China says it respects Denmark’s sovereignty on Greenland, seeks reciprocity on Taiwan",
    "description": "The diplomatic exchange comes amid renewed friction in China-Denmark ties, which have historically been strained by Denmark’s informal relations with Taiwan.",
    "link": "https://www.thehindubusinessline.com/news/world/china-says-it-respects-denmarks-sovereignty-on-greenland-seeks-reciprocity-on-taiwan/article69593476.ece",
    "timestamp": "2025-05-19T10:08:34Z"
  },
  {
    "title": "US Supreme Court may broaden religious rights in looming rulings",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court in a trio of rulings expected in the coming weeks appears inclined to extend its trend of taking an expansive...",
    "link": "https://uk.news.yahoo.com/us-supreme-court-may-broaden-100640241.html",
    "timestamp": "2025-05-19T10:06:40Z"
  },
  {
    "title": "Biden's post-presidency: From Social Security talk in Chicago to appearing on 'The View'",
    "description": "After maintaining a low profile since leaving the White House, former President Joe Biden recently emerged with media interviews and an April speech.",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/19/joe-biden-cancer-post-presidency-white-house/83716404007/",
    "timestamp": "2025-05-19T10:05:33Z"
  },
  {
    "title": "Trump tariffs force EU to cut 2025 eurozone growth forecast",
    "description": "The EU has significantly lowered its eurozone economic growth forecast for 2025, projecting a 0.9 percent increase due to global trade tensions exacerbated by US tariffs. This revision, down from the previous 1.3 percent, reflects concerns over a weakening gl…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tariffs-force-eu-to-cut-2025-eurozone-growth-forecast/articleshow/121266855.cms",
    "timestamp": "2025-05-19T10:02:39Z"
  },
  {
    "title": "Centrist Dan wins Romanian presidency over hard-right pro-Trump rival",
    "description": "Romania’s centrist Bucharest mayor, Nicusor Dan, won the country’s presidential election on Sunday in a shock upset over a hard-right, nationalist rival.",
    "link": "https://www.nbcnews.com/world/europe/centrist-dan-wins-romanian-presidency-hard-right-trump-rival-rcna207618",
    "timestamp": "2025-05-19T10:02:16Z"
  },
  {
    "title": "The death toll keeps rising in Gaza as Netanyahu says Israel is 'moving toward full control'",
    "description": "Israeli Prime Minister Netanyahu said his military was “moving toward full control” of Gaza as its air and ground operation killed dozens more people overnight.",
    "link": "https://www.nbcnews.com/world/gaza/gaza-israel-netanyahu-airstrikes-ground-aid-war-peace-death-blockade-rcna207614",
    "timestamp": "2025-05-19T10:01:32Z"
  },
  {
    "title": "Trump nominates unconventional doctor as new surgeon general",
    "description": "US president Donald Trump has nominated a new surgeon general after abruptly withdrawing his first selection, Janette Nesheiwat, after questions about her credentials and her support for masking during the covid-19 pandemic.1The new nominee, Casey Means, is a…",
    "link": "https://www.bmj.com/content/389/bmj.r1024",
    "timestamp": "2025-05-19T10:01:22Z"
  },
  {
    "title": "Trump’s order to bring down drug prices has the public split. Here's what they're saying",
    "description": "President Donald Trump's order to for pharmaceutical companies to cut drug prices received mixed reactions, with some members of the public wary of government market intervention.",
    "link": "https://www.foxnews.com/media/trumps-order-bring-down-drug-prices-has-public-split-heres-what-theyre-saying",
    "timestamp": "2025-05-19T10:00:42Z"
  },
  {
    "title": "Kid Rock hails Trump as 'dragon slayer' battling wokeness and cancel culture",
    "description": "Kid Rock praises Trump as the \"dragon slayer\" for combating wokeness and cancel culture, while promoting his \"Rock N Rodeo\" event as a pro-American celebration.",
    "link": "https://www.foxnews.com/entertainment/kid-rock-hails-trump-dragon-slayer-battling-wokeness-cancel-culture",
    "timestamp": "2025-05-19T10:00:03Z"
  },
  {
    "title": "Pope Leo’s Election Is a Victory for the Constitution",
    "description": "I still cannot quite believe that there is an American pope. Two hundred and sixty-seven men have served as the bishop of Rome over the last two thousand years. There have been Medici popes and Borgia popes, warrior popes and scholar popes, wise ones and vena…",
    "link": "https://newrepublic.com/article/195386/leo-xiv-catholicism-baseball-constitution",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "The Red Scare Still Haunts America",
    "description": "Since Donald Trump retook office on January 20, he’s weaponized the federal government to execute his war on “woke,” targeting diversity, equity, and inclusion programs, LGBTQ+ rights, and higher education—all in the name of restoring America’s status as a gl…",
    "link": "https://newrepublic.com/article/194991/red-scare-still-haunts-america-clay-risen-history",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "2 MPPs have proposed an Ontario foodbelt. Could it help tariff-proof the ag sector?",
    "description": "Two MPPs have proposed Ontario create a foodbelt of protected farmland. Two former Markham councillors pitched the same idea in 2009 for their area and say it's time the province takes action.",
    "link": "https://www.cbc.ca/news/canada/kitchener-waterloo/foodbelt-reaction-schreiner-markham-councillors-1.7536995",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "Don't fall for Exxon sign that says 'Free gas any day Trump doesn't say something stupid'",
    "description": "An image authentically depicts a sign at an Exxon gas station that reads \"Free gas any day Trump doesn't say something stupid.\"",
    "link": "https://www.snopes.com//fact-check/trump-free-gas-exxon/",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "Does the United States Need an Official Language?",
    "description": "Graciela Mochkofsky on how Donald Trump’s executive order to make English the country’s official language succeeds where decades of right-wing efforts have failed.",
    "link": "https://www.newyorker.com/news/the-lede/does-the-united-states-need-an-official-language",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "The Talented Mr. Vance",
    "description": "J. D. Vance could have brought the country’s conflicting strands together. Instead, he took a divisive path to the peak of power.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/07/jd-vance-reinvention-power/682828/",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "How to Really Fix Air-Traffic Control",
    "description": "There’s a fundamental flaw in the way the United States guides airplanes around the country.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/air-traffic-control-system-faa/682842/",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "How Trump’s family-linked crypto deals are threatening a ‘Hunter Biden-style’ scandal at the White House",
    "description": "Donald Trump risks undercutting his presidency with a Hunter Biden-style influence-peddling scandal unless he clamps down on questionable crypto deals that his family has inked with investors in the Middle East and China, experts told The Post.",
    "link": "https://nypost.com/2025/05/19/business/how-trumps-family-linked-crypto-deals-are-threatening-a-hunter-biden-style-scandal-at-the-white-house/",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "I confronted Sec. Noem because our democracy is threatened like never before",
    "description": "President Trump shared an edited image of the knuckles of Kilmar Abrego Garcia, a Maryland resident with protected status wrongfully sent to a Salvadoran detention facility.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/eric-swalwell-kristi-noem-kilmar-abrego-garcia-rcna207275",
    "timestamp": "2025-05-19T10:00:00Z"
  },
  {
    "title": "Trump’s Pick to Lead Workplace Safety Agency Will Derail Heat Protections, Advocates Fear",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. As the US prepares for what could be another record-breaking hot summer, Donald Trump and his pick to lead the nation’s workplace safety agen…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-osha-nominee-david-keeling-ups-amazon-workplace-heat-protections-workers/",
    "timestamp": "2025-05-19T10:00:00Z"
  }
]