[
  {
    "title": "DNC chair turns tables in Fox News interview: Trump's approval rating is 'in the toilet'",
    "description": "Democratic National Committee Chair Ken Martin appeared on Fox News and pointed out that President Donald Trump's poll numbers were \"in the toilet\" ahead of the midterm elections.Fox News host Dana Perino ended Martin's interview on Wednesday by observing tha…",
    "link": "https://www.rawstory.com/ken-martin-trump-approval/",
    "timestamp": "2025-08-06T14:58:15Z"
  },
  {
    "title": "This Group’s Definition of Antisemitism Is Providing Cover for Genocide",
    "description": "Aviva Chomsky\n\n\n\nThe definition hardly refers to inequality or structural discrimination—rather, it's a thinly veiled tool for prohibiting criticism of any sort about Israel.\r\n\n\r\n\n\nThe post This Group’s Definition of Antisemitism Is Providing Cover for Genoci…",
    "link": "https://www.thenation.com/article/world/international-holocaust-remembrance-alliance-antisemitism/",
    "timestamp": "2025-08-06T14:57:02Z"
  },
  {
    "title": "Howard Stern’s SiriusXM show in jeopardy as $500M contract nears its end: report",
    "description": "After relaunching in 2006, Stern's controversial show decreased from millions of listeners a day to a reported 125,000.",
    "link": "https://pagesix.com/2025/08/06/celebrity-news/howard-sterns-siriusxm-show-in-jeopardy-as-500m-contract-nears-its-end-report/",
    "timestamp": "2025-08-06T14:56:14Z"
  },
  {
    "title": "Marsha Blackburn launches historic Tennessee governor bid",
    "description": "Sen. Marsha Blackburn has officially entered the race for Tennessee governor, launching her campaign with a message that firmly aligns her political future with President Donald Trump’s agenda. The Republican senator announced her bid Wednesday to succeed ter…",
    "link": "https://rollingout.com/2025/08/06/marsha-blackburn-tennessee-governor-bid/",
    "timestamp": "2025-08-06T14:55:13Z"
  },
  {
    "title": "On Texas Republicans’ redistricting scheme, Trump gives away the game",
    "description": "Donald Trump said he feels “entitled” to a partisan reward, and he expects Texas Republicans to give it to him in the form of a redistricting scheme.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/texas-redistricting-republicans-trump-reward-rcna223348",
    "timestamp": "2025-08-06T14:55:02Z"
  },
  {
    "title": "US Weighs Options for Penalizing Russia Beyond India Tariffs",
    "description": "President Donald Trump’s additional 25% tariff on India for its purchases of Russian oil could be just the first shot he aims at Moscow’s energy revenues ahead of a Friday deadline, as the US weighs options to get President Vladimir Putin to end the war again…",
    "link": "https://financialpost.com/pmn/business-pmn/us-weighs-options-for-penalizing-russia-beyond-india-tariffs",
    "timestamp": "2025-08-06T14:54:09Z"
  },
  {
    "title": "Apple CEO Tim Cook to join President Trump at White House for American manufacturing investment announcement",
    "description": "Apple CEO Tim Cook will join President Donald Trump to announce a $100 billion investment commitment by Apple in U.S. manufacturing…\nThe post Apple CEO Tim Cook to join President Trump at White House for American manufacturing investment announcement appeared…",
    "link": "https://macdailynews.com/2025/08/06/apple-ceo-tim-cook-to-join-president-trump-at-white-house-for-american-manufacturing-investment-announcement/",
    "timestamp": "2025-08-06T14:53:06Z"
  },
  {
    "title": "Trump will highlight Apple’s plans to invest $100 billion more in US, raising total to $600 billion",
    "description": "Apple had previously said it intended to invest $500 billion domestically, a figure it'll now increase to $600 billion",
    "link": "https://www.bostonherald.com/2025/08/06/trump-apple-domestic-investment/",
    "timestamp": "2025-08-06T14:52:58Z"
  },
  {
    "title": "Comer's Epstein Probe Pretends It's Only Democrats On There",
    "description": "House Oversight Chair James Comer, a staunch Trump ally, issued subpoenas Tuesday after three Republicans joined with Democrats in a subcommittee vote late last month to release the Epstein files. So, Comer zeroed in on high-profile Democrats, noticeably leav…",
    "link": "https://crooksandliars.com/2025/08/comer-subpoenas-everyone-trump-doesnt",
    "timestamp": "2025-08-06T14:52:48Z"
  },
  {
    "title": "Exclusive -- Poll: Ninety-Two Percent of Trump Voters Want FDA to Protect Americans from Unsafe Chinese Drugs",
    "description": "Ninety-two percent of Trump voters want the FDA to do more to protect Americans from unsafe prescription drugs, a poll found.\nThe post Exclusive — Poll: Ninety-Two Percent of Trump Voters Want FDA to Protect Americans from Unsafe Chinese Drugs appeared first …",
    "link": "https://www.breitbart.com/politics/2025/08/06/exclusive-poll-ninety-two-percent-trump-voters-want-fda-protect-americans-from-unsafe-chinese-drugs/",
    "timestamp": "2025-08-06T14:52:09Z"
  },
  {
    "title": "Trump will highlight Apple’s plans to invest $100 billion more in US, raising total to $600 billion",
    "description": "WASHINGTON (AP) — President Donald Trump on Wednesday is expected to celebrate at the White House a commitment by Apple to increase its U.S. investments by an additional $100 billion over the next four years. “Today’s announcement with Apple is another win fo…",
    "link": "https://financialpost.com/pmn/trump-will-highlight-apples-plans-to-invest-100-billion-more-in-us-raising-total-to-600-billion",
    "timestamp": "2025-08-06T14:52:08Z"
  },
  {
    "title": "DOJ bombshell: Ghislaine Maxwell says Trump wasn't involved in Epstein drama — here’s what she said",
    "description": "Ghislaine Maxwell testified she never witnessed Donald Trump engaging in any wrongdoing connected to Jeffrey Epstein. The Trump administration is considering releasing grand jury transcripts from the Epstein and Maxwell cases, a move opposed by Maxwell. While…",
    "link": "https://economictimes.indiatimes.com/news/international/us/doj-bombshell-ghislaine-maxwell-says-trump-wasnt-involved-in-epstein-drama-heres-what-she-said/articleshow/123144516.cms",
    "timestamp": "2025-08-06T14:51:16Z"
  },
  {
    "title": "Kremlin aide reveals deatils of Putin-Witkoff meeting",
    "description": "Russian President Vladimir Putin and the US envoy have discussed Ukraine and Moscow is now awaiting Trump’s response, Yuri Ushakov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622570-ushakov-putin-witkoff-meeting/",
    "timestamp": "2025-08-06T14:50:33Z"
  },
  {
    "title": "As US tariffs loom, Lupin looks at measures to mitigate impact",
    "description": "Lupin prepares for potential US tariffs with tech-transfer and strategic measures amid strong Q1 results.",
    "link": "https://www.thehindubusinessline.com/companies/as-us-tariffs-loom-lupin-looks-at-measures-to-mitigate-impact/article69901981.ece",
    "timestamp": "2025-08-06T14:50:17Z"
  },
  {
    "title": "Trump Tariffs On India LIVE: US Hikes Levies To 50% Over Russian Oil Imports",
    "description": "Hello, and welcome to NDTV Profit's live coverage on the latest levies imposed by American President Donald Trump on India. Trump has slapped an additional 25% tariffs on India for the purchase of Russian crude oil, the White House said in a statement on Wedn…",
    "link": "https://www.ndtvprofit.com/business/india-us-trade-deal-live-latest-news-updates-donald-trump-50-pc-tariffs-threat-pm-modi-liveblog",
    "timestamp": "2025-08-06T14:50:04Z"
  },
  {
    "title": "Trump hits India with extra 25% tariff for buying Russian oil",
    "description": "This will bring the tariff rate on India to 50%, among the highest rates imposed by the US.",
    "link": "https://www.bbc.com/news/articles/c1dxr1g4y7yo",
    "timestamp": "2025-08-06T14:49:27Z"
  },
  {
    "title": "Vance To Hold Meeting With Top FBI, DOJ Officials To Discuss Epstein Strategy",
    "description": "Vance is expected to meet with top DOJ and FBI officials to discuss whether they should release the administration's interview with Maxwell, CNN first reported.",
    "link": "https://dailycaller.com/2025/08/06/jd-vance-fbi-doj-strategy-meeting-epstein-fallout-ghislaine-maxwell/",
    "timestamp": "2025-08-06T14:48:52Z"
  },
  {
    "title": "Trump Doubles India Tariffs To 50% In Retaliation For Russian Oil Purchases",
    "description": "Trump signed an executive order accusing India of “directly or indirectly importing Russian Federation oil.”",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/06/trump-doubles-india-tariffs-to-50-in-retaliation-for-russian-oil-purchases/",
    "timestamp": "2025-08-06T14:48:17Z"
  },
  {
    "title": "Trump Calls Into CNBC to Tout High Poll Numbers, Cites Analyst Who Immediately Refutes Him: ‘2nd Lowest on Record’ | Video",
    "description": "\"I give him a fair shake. I don't give him a positive spin,\" CNN's Harry Enten says\nThe post Trump Calls Into CNBC to Tout High Poll Numbers, Cites Analyst Who Immediately Refutes Him: ‘2nd Lowest on Record’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-touts-poll-numbers-analyst-refutes-cnn-cnbc/",
    "timestamp": "2025-08-06T14:48:00Z"
  },
  {
    "title": "The Week the World Woke Up to the Genocide in Gaza",
    "description": "Pressure is mounting against Israel in the U.S. and around the world. Will it mean anything on the ground in Palestine?\nThe post The Week the World Woke Up to the Genocide in Gaza appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/06/israel-palestine-gaza-war-politics/",
    "timestamp": "2025-08-06T14:47:09Z"
  },
  {
    "title": "Trump Hikes Tariffs On India To 50%: Read Full Text Of Order",
    "description": "US President Donald Trump on Tuesday has slapped an additional 25% tariff on India for the purchase of Russian crude oil, days after he had announced 25% reciprocal tariffs. The additional tariff will come into effect on Aug. 27.",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-hikes-tariffs-on-india-read-full-text-of-order",
    "timestamp": "2025-08-06T14:46:53Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "Trump has signed an executive order to place an additional 25% tariff on India for its purchases of Russian oil",
    "link": "https://abcnews.go.com/US/wireStory/trump-put-additional-25-import-taxes-india-bringing-124412697",
    "timestamp": "2025-08-06T14:46:31Z"
  },
  {
    "title": "The Latest: Putin hosts Trump envoy Witkoff for crucial talks on Ukraine peace deal",
    "description": "Russian President Vladimir Putin is hosting U.S. President Donald Trump’s special envoy Steve Witkoff for talks, days before the White House’s deadline for Russia to reach a peace deal with Ukraine or potentially face severe economic penalties that cou...",
    "link": "https://abcnews.go.com/US/wireStory/latest-putin-hosts-trump-envoy-witkoff-crucial-talks-124408284",
    "timestamp": "2025-08-06T14:46:29Z"
  },
  {
    "title": "Survivors of Israel's pager attack on Hezbollah last year struggle to recover",
    "description": "The Associated Press explores the human toll of Sept. 17, 2024, when thousands of pagers distributed to the Hezbollah group blew up across Lebanon, remotely detonated by Israel",
    "link": "https://abcnews.go.com/International/wireStory/survivors-israels-pager-attack-hezbollah-year-struggle-recover-124409865",
    "timestamp": "2025-08-06T14:46:23Z"
  },
  {
    "title": "Crude Oil Rebounds From Five-Week Low, WTI Hits Intraday High After Trump Doubles Tariff On India To 50%",
    "description": "Trump Tariff Impact: Crude Oil Rebounds From Five-Week Low, WTI Hits Intraday High After Trump Doubles Tariff On India To 50%",
    "link": "https://www.ndtvprofit.com/markets/crude-oil-rebounds-from-five-week-low-wti-hits-intraday-high-after-trump-doubles-tariff-on-india-to-50",
    "timestamp": "2025-08-06T14:46:18Z"
  },
  {
    "title": "Trump envoy Witkoff meets Putin ahead of Russia-Ukraine peace deadline, the Kremlin says",
    "description": "The Kremlin says Russian President Vladimir Putin is holding talks with U.S. President Donald Trump's special envoy Steve Witkoff. A meeting between Putin and Witkoff lasted about three hours Wednesday. Neither side gave an immediate readout of the talks.",
    "link": "https://biztoc.com/x/3a483a0b482f2dd7",
    "timestamp": "2025-08-06T14:46:15Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "By JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump signed an executive order Wednesday to place an additional 25% tariff on India for its purchases of Russian oil, bringing the combined tariffs imposed by the United States on India to 50%…",
    "link": "https://biztoc.com/x/f3972173aa23d1ef",
    "timestamp": "2025-08-06T14:46:09Z"
  },
  {
    "title": "Donald Trump Imposes 25 Percent Additional Tariff on India: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump on Wednesday announced an additional 25 percent tariff on India, days after he already imposed a 25 percent levy on the South Asian nation, which is a major trading partner of the U.S.\n\"…",
    "link": "https://biztoc.com/x/ef2d702ab841fab8",
    "timestamp": "2025-08-06T14:45:48Z"
  },
  {
    "title": "Trump Administration Walks Back Plan To Withhold $1.9 billion in FEMA Aid to Anti-Israel States and Cities",
    "description": "Whether or not the administration blocks aid to anti-Israel localities and states, this is far from the first time FEMA has faced scrutiny.",
    "link": "https://reason.com/2025/08/06/trump-administration-walks-back-plan-to-withhold-1-9-billion-in-fema-aid-to-anti-israel-states-and-cities/",
    "timestamp": "2025-08-06T14:45:31Z"
  },
  {
    "title": "Half-Yearly Results",
    "description": "Octopus AIM VCT 2 plc  Half-Yearly Results  Octopus AIM VCT 2 plc announces its unaudited half-yearly results for the six months ended 31 May 2025. ......",
    "link": "https://www.globenewswire.com/news-release/2025/08/06/3128455/0/en/Half-Yearly-Results.html",
    "timestamp": "2025-08-06T14:45:00Z"
  },
  {
    "title": "Trump Claims He Had No Clue About New Ghislaine Maxwell Developments",
    "description": "Donald Trump claimed he’s been left out of the loop by his own administration regarding its handling of the Epstein case yet again.Speaking with reporters at the White House Tuesday, the president said that the Justice Department had left him in the dark abou…",
    "link": "https://newrepublic.com/post/198851/donald-trump-ghislaine-maxwell-prison-transfer",
    "timestamp": "2025-08-06T14:44:40Z"
  },
  {
    "title": "Emerging Currencies Rise, Stocks Trim Losses Amid Risk-On Mood",
    "description": "Emerging-market currencies extended their earlier gains, while stocks trimmed losses as the latest remarks by Federal Reserve official Neel Kashkari weighed on the dollar and boosted risk appetite.",
    "link": "https://financialpost.com/pmn/business-pmn/emerging-currencies-rise-stocks-trim-losses-amid-risk-on-mood",
    "timestamp": "2025-08-06T14:44:04Z"
  },
  {
    "title": "Switzerland is in a uniquely difficult position when it comes to tariffs. Here's why",
    "description": "Swiss goods could soon be slapped with 39% tariffs — but Switzerland has further challenges to face when it comes to the Trump administration.",
    "link": "https://www.cnbc.com/2025/08/06/trump-tariffs-why-switzerland-faces-a-unique-struggle.html",
    "timestamp": "2025-08-06T14:43:02Z"
  },
  {
    "title": "Trump slaps additional 25% tariff on India over Russian oil",
    "description": "US President Donald Trump has increased the tariffs to be imposed on Indian imports to a total of 50%. The announcement comes a day before the Trump tariffs are due to come into effect. DW has more.",
    "link": "https://www.dw.com/en/trump-slaps-additional-25-tariff-on-india-over-russian-oil/live-73550668",
    "timestamp": "2025-08-06T14:43:00Z"
  },
  {
    "title": "Trump envoy Witkoff meets Putin ahead of Russia-Ukraine peace deadline, the Kremlin says",
    "description": "The Kremlin says Russian President Vladimir Putin is holding talks with U.S. President Donald Trump's special envoy Steve Witkoff. A meeting between Putin and Witkoff lasted about three hours Wednesday. Neither side gave an immediate readout of the talks.",
    "link": "https://www.pbs.org/newshour/politics/trump-envoy-witkoff-meets-putin-ahead-of-russia-ukraine-peace-deadline-the-kremlin-says",
    "timestamp": "2025-08-06T14:42:20Z"
  },
  {
    "title": "Six Eras Of Change: Kimberly Guilfoyle’s “Before And After” Explained",
    "description": "Explore Kimberly Guilfoyle's evolving career & image. From prosecutor to Donald Trump circles, see how her appearance has changed before and after. Has Guilfoyle undergone plastic surgery?",
    "link": "https://www.boredpanda.com/kimberly-guilfoyle-before-and-after/",
    "timestamp": "2025-08-06T14:41:55Z"
  },
  {
    "title": "Trump imposes 25 percent tariff on Indian goods over Russian oil",
    "description": "Trump cited ‘national security’ concerns as a reason for the import tax hike, sparking tensions in US-India relations.",
    "link": "https://www.aljazeera.com/news/2025/8/6/trump-imposes-25-percent-tariff-on-indian-goods-over-russian-oil",
    "timestamp": "2025-08-06T14:41:51Z"
  },
  {
    "title": "Diddy’s Defense Team Has ‘Had Conversations’ With Donald Trump About A Pardon As He Awaits Sentencing",
    "description": "Sean 'Diddy' Combs' legal team has reportedly been in contact with President Trump about a pardon for the disgraced music mogul.\nThe post Diddy’s Defense Team Has ‘Had Conversations’ With Donald Trump About A Pardon As He Awaits Sentencing appeared first on B…",
    "link": "https://bossip.com/3699778/diddy-pardon-trump-conversations-legal-team/",
    "timestamp": "2025-08-06T14:41:33Z"
  },
  {
    "title": "US Stock Market prediction for August: These dates will impact S&P 500, Nasdaq. Check here",
    "description": "US Stock Market outlook for the month of August is here and U.S. President Donald Trump's tariff policies have not only roiled global financial markets but also taken investors on a roller-coaster ride.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-prediction-for-august-these-dates-will-impact-sp-500-nasdaq-check-here/articleshow/123144917.cms",
    "timestamp": "2025-08-06T14:41:20Z"
  },
  {
    "title": "Instant View: Trump order imposes additional 25% tariff on goods from India",
    "description": "MUMBAI (Reuters) -U.S. President Donald Trump issued an executive order on Wednesday imposing an additional 25% tariff on goods from India, saying the...",
    "link": "https://finance.yahoo.com/news/instant-view-trump-order-imposes-144114412.html",
    "timestamp": "2025-08-06T14:41:14Z"
  },
  {
    "title": "Trump's Tariff Tsunami Reshapes Global Trade As US Households Face Rising Costs",
    "description": "As of this week, sweeping new tariffs of 10% to 41% are in effect for 69 countries, with transshipment penalties of 40% and steel tariffs at 50%.",
    "link": "https://www.ibtimes.com/trumps-tariff-tsunami-reshapes-global-trade-us-households-face-rising-costs-3780324",
    "timestamp": "2025-08-06T14:40:53Z"
  },
  {
    "title": "Trump Hits India With Additional 25% Tariff Over Russia Oil",
    "description": "US President Donald Trump imposed an additional 25% tariff on Indian goods over its purchase of Russian energy, the White House said Wednesday, hours after talks between the Washington and Moscow over the war in Ukraine failed to yield a breakthrough.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-hits-india-with-additional-25-tariff-over-russia-oil",
    "timestamp": "2025-08-06T14:38:58Z"
  },
  {
    "title": "Trump’s Mobile Carrier Sparks Oversight Fears Among Democrats",
    "description": "Democrats are asking how Trump Mobile will be regulated, fearing political interference and conflicts of interest from the administration.",
    "link": "https://www.androidheadlines.com/2025/08/trumps-mobile-carrier-sparks-oversight-fears-among-democrats.html",
    "timestamp": "2025-08-06T14:38:12Z"
  },
  {
    "title": "Trump imposes additional 25pc tariff on India for importing Russian oil",
    "description": "The US president has signed an executive order imposing the additional levy, which comes after days of threats to punish New Delhi for importing Russian oil.",
    "link": "https://www.abc.net.au/news/2025-08-07/donald-trump-slaps-25-per-cent-additional-tariff-on-indian-goods/105622132",
    "timestamp": "2025-08-06T14:37:52Z"
  },
  {
    "title": "Florida Reportedly Eyeing Another ‘Alligator Alcatraz’ at Former WWII POW Camp as Deportations Mount",
    "description": "The state of Florida is looking to expand its immigration crackdown and build another “Alligator Alcatraz” detention facility, as deportations continue to mount. A second detention center known as the “North Detention Facility” is being planned for Camp Bland…",
    "link": "https://freerepublic.com/focus/f-news/4333007/posts",
    "timestamp": "2025-08-06T14:37:44Z"
  },
  {
    "title": "Trump doubles tariff on India to 50% for trade with Russia | Full text of the order",
    "description": "Trump signed an Executive Order imposing an additional 25% tariff on India in response to its purchase of Russian oil.",
    "link": "https://indianexpress.com/article/world/trump-doubles-tariff-on-india-to-50-percent-for-trade-with-russia-full-text-of-order-10173956/",
    "timestamp": "2025-08-06T14:37:30Z"
  },
  {
    "title": "Rússia diz que Putin e Witkoff tiveram conversa “útil”; prazo de Trump se aproxima",
    "description": "Rússia diz que Putin e Witkoff tiveram conversa \"útil\"; prazo das sanções de Trump se aproxima\nThe post Rússia diz que Putin e Witkoff tiveram conversa “útil”; prazo de Trump se aproxima appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mundo/russia-diz-que-putin-e-witkoff-tiveram-conversa-util-prazo-de-trump-se-aproxima/",
    "timestamp": "2025-08-06T14:37:23Z"
  },
  {
    "title": "'I Am Currently Incarcerated': Diddy Lends A Hand In He And His Son's Yacht Lawsuit While In Prison",
    "description": "This is one of several suits Diddy is involved in.",
    "link": "https://www.cinemablend.com/streaming-news/diddy-lends-hand-he-son-christian-yacht-lawsuit-while-in-prison",
    "timestamp": "2025-08-06T14:37:11Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "The tariffs would go into effect 21 days after the signing of the order.",
    "link": "https://www.bostonherald.com/2025/08/06/trump-increases-india-tariffs-threat/",
    "timestamp": "2025-08-06T14:37:10Z"
  },
  {
    "title": "John Oliver slams Jay Leno’s late-night TV advice: ‘Hard pass’",
    "description": "The late-night hosts are fighting.",
    "link": "https://nypost.com/2025/08/06/entertainment/john-oliver-responds-to-jay-leno-slamming-late-night-tv-hosts/",
    "timestamp": "2025-08-06T14:36:53Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "President Donald Trump signed an executive order Wednesday to place an additional 25% tariff on India for its purchases of Russian oil, bringing the combined...",
    "link": "https://finance.yahoo.com/news/trump-put-additional-25-import-143515712.html",
    "timestamp": "2025-08-06T14:35:15Z"
  },
  {
    "title": "Apple Commits $100 Billion More To U.S. Manufacturing",
    "description": "Apple is set to invest an additional $100 billion in the United States, President Donald Trump will announce Wednesday, according to the White House. This comes after the tech giant committed $500 billion earlier this year to expand its American operations.\nT…",
    "link": "https://biztoc.com/x/6a7723d939e2542a",
    "timestamp": "2025-08-06T14:34:43Z"
  },
  {
    "title": "In letter to Trump, alcohol groups say tariffs put $2 billion in sales at risk",
    "description": "LONDON (Reuters) -The United States' 15% tariff on EU goods could reduce the value of alcohol sales by almost $2 billion and put 25,000 U.S. jobs at risk, a ...",
    "link": "https://finance.yahoo.com/news/letter-trump-alcohol-groups-tariffs-143442335.html",
    "timestamp": "2025-08-06T14:34:42Z"
  },
  {
    "title": "Apple expected to announce another $100B U.S. manufacturing investment",
    "description": "After an early-morning tease, further reports claim that Apple will invest another $100 billion into manufacturing in the United States, and President Donald Trump is expected to announce it on Wednesday alongside CEO Tim Cook.Tim Cook [left], President Donal…",
    "link": "https://appleinsider.com/articles/25/08/06/apple-expected-to-announce-another-100b-us-manufacturing-investment",
    "timestamp": "2025-08-06T14:34:39Z"
  },
  {
    "title": "White House Sets Additional 25% Tariff on India Over Russian Oil Imports",
    "description": "12 min ago\nWhite House Sets Additional 25% Tariff on India Over Russian Oil Imports\nPresident Donald Trump set an additional 25% tariff on India on Wednesday, following through on an earlier threat to hike levies over the nation's imports of Russian oil.\nTrum…",
    "link": "https://biztoc.com/x/520cdf31236b516e",
    "timestamp": "2025-08-06T14:34:38Z"
  },
  {
    "title": "Trump hikes India tariffs to 50% for buying Russian oil",
    "description": "President Donald Trump said he was doubling tariffs on India from 25% to 50%.",
    "link": "https://biztoc.com/x/9b871aff7ba3225d",
    "timestamp": "2025-08-06T14:34:36Z"
  },
  {
    "title": "Trump Hits India With Additional 25% Tariff Over Russia Oil Purchases",
    "description": "U.S. President Donald Trump signed an Executive Order today imposing a 25% tariff on imports from India, citing the country’s continued purchase of Russian oil. The order, effective 21 days...",
    "link": "https://gcaptain.com/trump-hits-india-with-additional-25-tariff-over-russia-oil-purchases/",
    "timestamp": "2025-08-06T14:33:45Z"
  },
  {
    "title": "Car Insurance Costs Could Rise in 2025",
    "description": "Car insurance rates recently began to dip across the country, but experts say they will go up again by the end of the year.",
    "link": "https://www.newsweek.com/car-insurance-costs-could-rise-2025-2109623",
    "timestamp": "2025-08-06T14:32:46Z"
  },
  {
    "title": "ADDRESSING THREATS TO THE UNITED STATES BY THE GOVERNMENT OF THE RUSSIAN FEDERATION",
    "description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 et seq.), sec…",
    "link": "https://freerepublic.com/focus/f-chat/4333004/posts",
    "timestamp": "2025-08-06T14:31:22Z"
  },
  {
    "title": "“I thought people were going to die”: Anti-ICE protesters say they were attacked by police",
    "description": "Supporters of detained chaplain Ayman Soliman say cops assaulted them at a recent protest, but they're not deterred",
    "link": "https://www.salon.com/2025/08/06/police-brutality-wont-stop-ice-protests/",
    "timestamp": "2025-08-06T14:30:49Z"
  },
  {
    "title": "Former ‘Alligator Alcatraz' worker describes ‘inhumane' conditions inside",
    "description": "In an exclusive report, NBC6 spoke with a former corrections officer who says she saw hundreds held in cages with no sunlight, backed up toilets and little access to showers.",
    "link": "https://www.nbcnews.com/news/us-news/alligator-alcatraz-former-officer-inhumane-conditions-rcna223355",
    "timestamp": "2025-08-06T14:30:34Z"
  },
  {
    "title": "Trump ally Blackburn announces bid for Tennessee governor",
    "description": "WASHINGTON (Reuters) -U.S. Senator Marsha Blackburn, one of President Donald Trump's staunchest allies in Congress, on Wednesday launched a run for governor ...",
    "link": "https://www.yahoo.com/news/articles/trump-ally-blackburn-announces-bid-143024551.html",
    "timestamp": "2025-08-06T14:30:24Z"
  },
  {
    "title": "Trump, Apple to Announce Fresh $100 Billion US Investment (Hadriana Lowenkron/Bloomberg)",
    "description": "Hadriana Lowenkron / Bloomberg:\nTrump, Apple to Announce Fresh $100 Billion US Investment  —  President Donald Trump will announce that Apple Inc. will commit to spend another $100 billion on domestic manufacturing, the latest pledge by the tech giant to incr…",
    "link": "https://www.memeorandum.com/250806/p44",
    "timestamp": "2025-08-06T14:30:02Z"
  },
  {
    "title": "Sen. Warren asks FTC to consider blocking Dick's-Foot Locker merger over antitrust concerns",
    "description": "Sen. Elizabeth Warren asked the FTC and DOJ to consider blocking Dick's Sporting Goods proposed acquisition of Foot Locker over antitrust concerns.",
    "link": "https://www.cnbc.com/2025/08/06/warren-asks-ftc-to-consider-blocking-dicks-foot-locker-merger.html",
    "timestamp": "2025-08-06T14:30:01Z"
  },
  {
    "title": "Sen. Marsha Blackburn Enters Tennessee Governor Race",
    "description": "Tennessee Republican Sen. Marsha Blackburn announced her run to be governor in her home state Wednesday, making her the third senator this Congress to announce... Read More\nThe post Sen. Marsha Blackburn Enters Tennessee Governor Race appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/08/06/sen-marsha-blackburn-enters-tennessee-governor-race/",
    "timestamp": "2025-08-06T14:30:00Z"
  },
  {
    "title": "Ukraine Won’t Surrender",
    "description": "Tim Mak and Adrian Karatnycky on battlefield reality, stalled U.S. support, and why Ukraine won’t give up",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/08/david-frum-show-ukraine-tim-mak-adrian-karatnycky/683772/",
    "timestamp": "2025-08-06T14:30:00Z"
  },
  {
    "title": "What’s Going on With the Gerrymandering Chaos in Texas?",
    "description": "Donald Trump is urging Texas Republicans to redraw the state's congressional map to give him a boost ahead of the 2026 midterm elections.",
    "link": "http://www.rollingstone.com/politics/politics-features/gerrymandering-texas-republicans-map-trump-explained-1235401621/",
    "timestamp": "2025-08-06T14:30:00Z"
  },
  {
    "title": "Witkoff Meets With Putin In Last-Ditch Effort For Peace",
    "description": "U.S. Special Envoy Steve Witkoff met with Russian President Vladimir Putin Wednesday in a last ditch effort to bring Russia to the peace table.",
    "link": "https://dailycaller.com/2025/08/06/witkoff-putin-last-ditch-effort-peace/",
    "timestamp": "2025-08-06T14:29:58Z"
  },
  {
    "title": "Bank Honcho Declares ‘I Welcome Getting This Fixed’ After Trump Trashes Company for Rejecting Him",
    "description": "CNBC's Andrew Ross Sorkin confronted Bank of America CEO Brian Moynihan with President Donald Trump's complaint that he was rejected as a customer.\nThe post Bank Honcho Declares ‘I Welcome Getting This Fixed’ After Trump Trashes Company for Rejecting Him firs…",
    "link": "https://www.mediaite.com/media/tv/bank-honcho-declares-i-welcome-getting-this-fixed-after-trump-trashes-company-for-rejecting-him/",
    "timestamp": "2025-08-06T14:29:39Z"
  },
  {
    "title": "Republican Popularity Falls to Lowest Level in Years",
    "description": "According to a new poll, the proportion of people who intend to vote for the Republican Party has declined.",
    "link": "https://www.newsweek.com/republican-popularity-gop-poll-yougov-2109513",
    "timestamp": "2025-08-06T14:29:24Z"
  },
  {
    "title": "Trump hits India with extra 25% tariff for buying Russian oil",
    "description": "Trump hits India with extra 25% tariff for buying Russian oilbbc.co.uk",
    "link": "https://www.bbc.co.uk/news/articles/c1dxr1g4y7yo",
    "timestamp": "2025-08-06T14:29:04Z"
  },
  {
    "title": "Trump imposes added 25% tariff on India over Russian oil purchases",
    "description": "The tariff is set to take effect in three weeks and would be added on top of a separate 25% tariff entering into force on Thursday",
    "link": "https://www.euractiv.com/section/politics/news/trump-imposes-added-25-tariff-on-india-over-russian-oil-purchases/",
    "timestamp": "2025-08-06T14:28:43Z"
  },
  {
    "title": "King of the Hill",
    "description": "Last night I plowed into the new season of King of the Hill, which revisits Arlen after Hank and Peggy’s fifteen year absence selling propane and propane accessories for ARAMCO in Saudi Arabia. My general feeling about these kinds of efforts is that they’re a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/king-of-the-hill",
    "timestamp": "2025-08-06T14:28:35Z"
  },
  {
    "title": "Here's How India Stack Up Against Asian Peers",
    "description": "US President Donald Trump slapped an additional 25% tariff on India on Wednesday for the purchase of Russian crude oil, days after he had announced 25% reciprocal tariffs. The additional tariffs will take effect from Aug. 27. This latest move places India in …",
    "link": "https://www.ndtvprofit.com/economy-finance/donald-trump-us-tariff-on-india-hike-asian-peers",
    "timestamp": "2025-08-06T14:27:59Z"
  },
  {
    "title": "Trump hikes India tariffs to 50% for buying Russian oil",
    "description": "President Donald Trump said he was doubling tariffs on India from 25% to 50%.",
    "link": "https://www.nbcnews.com/business/business-news/trump-hikes-india-tariffs-50-percent-buying-russian-oil-rcna223374",
    "timestamp": "2025-08-06T14:27:35Z"
  },
  {
    "title": "Trump Hits India With Additional 25% Tariff Over Russia Oil Buys",
    "description": "US President Donald Trump signed an executive order imposing an additional 25% tariff on India over its purchase of Russian energy, the White House said Wednesday hours after talks between the US and Russia over the war in Ukraine failed to yield a breakthrou…",
    "link": "https://gcaptain.com/trump-hits-india-with-additional-25-tariff-over-russia-oil-buys/",
    "timestamp": "2025-08-06T14:26:53Z"
  },
  {
    "title": "US envoy Steve Witkoff held 'useful' talks with Vladimir Putin, Kremlin says",
    "description": "The US envoy and the Russian President had a three-hour meeting in Moscow.",
    "link": "https://www.abc.net.au/news/2025-08-07/us-envoy-steve-witkoff-meets-with-vladimir-putin/105622042",
    "timestamp": "2025-08-06T14:26:24Z"
  },
  {
    "title": "Russian and Chinese Navies Practice Destroying ‘Enemy Submarine’, Days After Trump Move",
    "description": "The Russian and Chinese navies have practiced hunting and destroying an enemy submarine in the Sea of Japan, Russia's defense ministry said on Wednesday, days after U.S. President Donald Trump said he had moved two U.S. nuclear subs closer to Russia.",
    "link": "https://gcaptain.com/russian-and-chinese-navies-practice-destroying-enemy-submarine-days-after-trump-move/",
    "timestamp": "2025-08-06T14:23:52Z"
  },
  {
    "title": "Putin Meets Witkoff at Kremlin for Ukraine Talks",
    "description": "Vladimir Putin exchanged “signals” with Donald Trump on the war in Ukraine at Kremlin talks with US envoy Steve Witkoff, a top Russian official said Wednesday.\n“On our part, in particular, some signals were conveyed on the Ukrainian issue,” the Russian presid…",
    "link": "https://biztoc.com/x/fd17d4172720e363",
    "timestamp": "2025-08-06T14:23:26Z"
  },
  {
    "title": "Trump slaps India with additional 25% tariffs",
    "description": "United States President Donald Trump signed an executive order on Wednesday imposing a 25% additional tariff on Indian goods, bringing the total duties currently hitting the nation to a staggering 50%...",
    "link": "https://biztoc.com/x/54ff5bcd686c8683",
    "timestamp": "2025-08-06T14:23:19Z"
  },
  {
    "title": "Trump raises tariffs on goods from India to 50% over Russian oil purchases",
    "description": "The additional 25 per cent tariff was \"necessary and appropriate\", said the White House.",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-india-russia-oil-ukraine-white-house-5280786",
    "timestamp": "2025-08-06T14:21:00Z"
  },
  {
    "title": "Minister condemns 'idiot' councils that don't believe they have grooming gang problem",
    "description": "Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.",
    "link": "https://news.sky.com/story/jess-phillips-condemns-idiot-councils-that-dont-believe-they-have-grooming-gang-problem-13407809",
    "timestamp": "2025-08-06T14:20:00Z"
  },
  {
    "title": "Trump doubles tariff on India to 50% for buying Russian oil",
    "description": "Trump signed an executive order imposing the additional tariff less than 14 hours before his initial tariffs were to come into effect",
    "link": "https://www.thehindubusinessline.com/economy/trump-order-imposes-additional-25-tariff-on-goods-from-india/article69902016.ece",
    "timestamp": "2025-08-06T14:20:00Z"
  },
  {
    "title": "Dollar falls as traders bet on more rate cuts",
    "description": "NEW YORK :The dollar dropped on Wednesday and the euro hit a one-week high as traders bet that the Federal Reserve will cut rates more times than previously expected this year, following weaker than expected jobs data for July.With no major U.S. economic rele…",
    "link": "https://www.channelnewsasia.com/business/dollar-falls-traders-bet-more-rate-cuts-5279426",
    "timestamp": "2025-08-06T14:19:01Z"
  },
  {
    "title": "Trump raises India tariffs to 50% over Russian oil purchases",
    "description": "Trump last week said that India would pay a tariff of 25%, in addition to a \"penalty\" over the country's purchase of military equipment and energy from Russia.",
    "link": "https://www.cnbc.com/2025/08/06/trump-trade-india-tariffs-russia.html",
    "timestamp": "2025-08-06T14:18:25Z"
  },
  {
    "title": "One Stock Strategist Says Tesla’s Stock Valuation Is ‘Insane’ — Is It Time To Sell?",
    "description": "Elon Musk’s Tesla comeback may spark hype, but analysts warn of some potential headwinds, like robotaxi delays, a rich valuation and rising competition.",
    "link": "https://finance.yahoo.com/news/one-stock-strategist-says-tesla-141809684.html",
    "timestamp": "2025-08-06T14:18:09Z"
  },
  {
    "title": "Apple Invests Another $100 Billion Into The U.S., White House Says—As Shares Jump 3%",
    "description": "Tim Cook announced a $500 billion commitment earlier this year, including plans for a new U.S.-based factory and tens of thousands of new jobs.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/06/apple-invests-another-100-billion-into-the-us-white-house-says-as-shares-jump-3/",
    "timestamp": "2025-08-06T14:16:49Z"
  },
  {
    "title": "Ghislaine Maxwell Reportedly Told DOJ Trump Never Did Anything ‘Concerning’ Around Her",
    "description": "Those of us who have been closely following all the reports and document dumps regarding the Jeffrey Epstein trafficking ring know that Donald J.\nThe post Ghislaine Maxwell Reportedly Told DOJ Trump Never Did Anything ‘Concerning’ Around Her appeared first on…",
    "link": "https://www.thegatewaypundit.com/2025/08/ghislaine-maxwell-reportedly-told-doj-trump-never-did/",
    "timestamp": "2025-08-06T14:15:43Z"
  },
  {
    "title": "Trump slaps additional 25% tariff on India over Russian oil purchases — bringing total rate to 50%",
    "description": "WASHINGTON -- President Trump took executive action Wednesday to hammer India with an additional 25% tariff due to its continued purchases of Russian oil.",
    "link": "https://nypost.com/2025/08/06/us-news/trump-slaps-additional-25-tariff-on-india-over-russian-oil-purchases-bringing-total-rate-to-50/",
    "timestamp": "2025-08-06T14:14:46Z"
  },
  {
    "title": "Trump order imposes additional 25% tariff on goods from India",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump issued an executive order on Wednesday imposing an additional 25% tariff on goods from India, saying the country directly or indirectly imported Russian oil. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/06/trump-order-imposes-additional-25-tariff-on-goods-from-india",
    "timestamp": "2025-08-06T14:13:00Z"
  },
  {
    "title": "Apple plans to invest another $100 billion in US manufacturing amid tariff pressure",
    "description": "US President Donald Trump is expected to soon make an announcement in this regard in the presence of Apple chief executive Tim Cook. The White House is reportedly planning to roll out a new manufacturing programme to bring Apple’s business to the US.",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-plans-to-invest-another-100-billion-in-us-manufacturing-amid-tariff-pressure/articleshow/123144455.cms",
    "timestamp": "2025-08-06T14:12:53Z"
  },
  {
    "title": "Trump slaps India with additional 25% tariff",
    "description": "United States President Donald Trump signed an executive order on Wednesday imposing an additional 25% tariff on India in response to its continued purchase of Russian oil.More to come......",
    "link": "https://biztoc.com/x/c1a79d9120094ea3",
    "timestamp": "2025-08-06T14:12:36Z"
  }
]