[
  {
    "title": "Gaza Strip 'uninhabitable' due to undetonated explosives, US says",
    "description": "GAZA AFFAIRS | The UN Mine Action Service estimates that between one in 10 and one in 20 Israeli bombs fired into Gaza did not detonate.",
    "link": "https://www.jpost.com/middle-east/article-850481",
    "timestamp": "2025-04-18T16:59:32Z"
  },
  {
    "title": "California Voters Do Not Want Gavin Newsom To Run for President: Poll",
    "description": "\"With voters looking for someone to blame, [Newsom] and the president are natural targets,\" an Emerson College pollster told Newsweek.",
    "link": "https://www.newsweek.com/gavin-newsom-trump-president-poll-democrats-2061500",
    "timestamp": "2025-04-18T16:59:23Z"
  },
  {
    "title": "Saudi Arabia and Abraham Accords: Normalization with Israel is in Riyadh's best interests",
    "description": "If Saudi Arabia does join the Abraham Accords, it would signal a brave new Middle East, where peace and prosperity between Jews and Arabs can become the new norm.",
    "link": "https://www.jpost.com/opinion/article-850210",
    "timestamp": "2025-04-18T16:58:12Z"
  },
  {
    "title": "Career diplomat becomes the face of Trump’s ‘America First’ agenda at the UN",
    "description": "Dorothy Shea will stay in place after Trump’s unusual decision to withdraw his nominee.",
    "link": "https://www.bostonherald.com/2025/04/18/united-nations-us-ambassador/",
    "timestamp": "2025-04-18T16:57:35Z"
  },
  {
    "title": "U.S. Launches Deadliest Strike on Yemen’s Ras Isa Fuel Terminal",
    "description": "ADEN/WASHINGTON, April 17 (Reuters) – U.S. strikes on Yemen’s Ras Isa fuel terminal on the Red Sea coast have killed at least 74 people in the deadliest attack since the U.S. started its...",
    "link": "https://gcaptain.com/u-s-launches-deadliest-strike-on-yemens-ras-isa-fuel-terminal/",
    "timestamp": "2025-04-18T16:56:08Z"
  },
  {
    "title": "White House deletes COVID resource site—to launch ‘lab leak’ promo page",
    "description": "The Trump administration replaced a COVID-19 resource site with a new design promoting the lab leak theory and bashing Dr. Anthony Fauci.\n\n\nPreviously, the same website, COVID.gov, was used to host guidance on masking and treatment options, including vaccines…",
    "link": "https://www.dailydot.com/debug/white-house-covid-lab-leak/",
    "timestamp": "2025-04-18T16:55:32Z"
  },
  {
    "title": "Hoping to install solar? You may have a harder time due to Trump tariffs",
    "description": "Experts say the cost of projects will rise..",
    "link": "https://www.bostonherald.com/2025/04/18/trump-tariffs-solar-costs/",
    "timestamp": "2025-04-18T16:54:21Z"
  },
  {
    "title": "MAGA Influencer Laura Loomer Claims FSU Shooter ‘Hated Trump’ — Despite Mountain of Unsubtle Clues He Was Trump Fan",
    "description": "Laura Loomer insisted that Florida State University mass shooting suspect Phoenix Ikner \"hated Trump\" despite clear clues he supports President Donald Trump.\nThe post MAGA Influencer Laura Loomer Claims FSU Shooter ‘Hated Trump’ — Despite Mountain of Unsubtle…",
    "link": "https://www.mediaite.com/news/maga-influencer-laura-loomer-claims-fsu-shooter-hated-trump-despite-mountain-of-unsubtle-clues-he-was-trump-fan/",
    "timestamp": "2025-04-18T16:53:55Z"
  },
  {
    "title": "Federal judge pausing Trump administration’s plans for mass layoffs at the CFPB",
    "description": "Judge pauses Trump administration’s plans for mass layoffs at Consumer Financial Protection Bureau\nWASHINGTON (AP) — A federal judge who blocked President Donald Trump’s administration from dismantling the Consumer Financial Protection Bureau ruled Friday tha…",
    "link": "https://biztoc.com/x/ae6460eba2da9cc8",
    "timestamp": "2025-04-18T16:52:40Z"
  },
  {
    "title": "Meet Trump’s radical new antisemitism envoy",
    "description": "Meet Rabbi Yehuda Kaploun. A long-time friend of Miriam Adelson, he has deep ties to the far-right of the Jewish community. Soon, he will be leading the charge to criminalize Palestine solidarity as Donald Trump's envoy to \"combat antisemitism.\"",
    "link": "https://mondoweiss.net/2025/04/meet-trumps-radical-new-antisemitism-envoy/",
    "timestamp": "2025-04-18T16:50:08Z"
  },
  {
    "title": "How AI is aiding Trump's immigration crackdown",
    "description": "Under President Trump, the U.S. is increasing its use of AI and surveillance to track and arrest immigrants, raising concerns about accuracy and privacy. Agencies like DHS and CBP are using tools like facial recognition and social media monitoring to track im…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-ai-is-aiding-trumps-immigration-crackdown/articleshow/120412921.cms",
    "timestamp": "2025-04-18T16:49:20Z"
  },
  {
    "title": "VIDEO: Leftwing Tantrum Boy Reporter in Canada Goes BERSERK",
    "description": "VIDEOImagine sitting in the press room following a debate in Montreal between the party leaders for the upcoming Parliamentary election in Canada and one of the \"reporters\" there starts throwing a BERSERK tantrum lasting over five minutes over the mere presen…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311825/posts",
    "timestamp": "2025-04-18T16:48:48Z"
  },
  {
    "title": "‘Light on the truth’: Tulsi Gabbard announces RFK files released",
    "description": "RFK Jr.: 'I commend President Trump for his courage and his commitment to transparency'",
    "link": "https://www.wnd.com/2025/04/light-on-the-truth-tulsi-gabbard-announces-rfk-files-released/",
    "timestamp": "2025-04-18T16:47:35Z"
  },
  {
    "title": "The Suppression of Christianity in Its Birthplace",
    "description": "My rewrite of the famous quote by Lord Palmerston regarding “interests” to have it reflect the reality of Israel and its powerful friends would go something like this: \n“I say that it is a narrow policy to suppose that Israel …\nThe post The Suppression of Chr…",
    "link": "https://www.globalresearch.ca/suppression-christianity-birthplace/5884809",
    "timestamp": "2025-04-18T16:46:57Z"
  },
  {
    "title": "Lawyer Warns Trump Is Moving to Deport Teen to El Salvador for Photo of Water Pistol",
    "description": "The Trump administration is moving to deport a teenager who was accused by the of being a member of Tren de Aragua over a photo featuring a toy pistol.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-deport-teenager-water-pistol-1235320693/",
    "timestamp": "2025-04-18T16:46:21Z"
  },
  {
    "title": "Mass layoffs at CFPB put on hold after judge blocks Trump administration",
    "description": "During a hearing on Friday, U.S. District Judge Amy Berman Jackson expressed concern that administration officials aren't complying with her earlier order that maintains the agency's existence until she rules on the merits of a lawsuit seeking to preserve the…",
    "link": "https://www.pbs.org/newshour/politics/mass-layoffs-at-cfpb-put-on-hold-after-judge-blocks-trump-administration",
    "timestamp": "2025-04-18T16:45:49Z"
  },
  {
    "title": "Trump Tariffs Hit Oil Companies despite Administration‘s Support for Fossil Fuels",
    "description": "Liberty Energy, founded by Secretary of Energy Chris Wright,  reports falling profits, and the industry cites tariffs as a driver",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/04/18/chris-wright-promised-a-golden-age-for-oil-his-old-company-is-preparing-for-a-storm-00296755",
    "timestamp": "2025-04-18T16:45:00Z"
  },
  {
    "title": "PM call with President Trump of the United States: 18 April 2025",
    "description": "Prime Minister Keir Starmer spoke to the President of the United States Donald Trump.",
    "link": "https://www.gov.uk/government/news/pm-call-with-president-trump-of-the-united-states-18-april-2025",
    "timestamp": "2025-04-18T16:44:45Z"
  },
  {
    "title": "EXCLUSIVE: Fauci’s First Year Of ‘Retirement’ Was A Money Making Bonanza, Docs Show",
    "description": "Fauci grew his net worth by $3.5 in \"retirement.\"",
    "link": "https://dailycaller.com/2025/04/18/anthony-fauci-retirement-net-worth-congress/",
    "timestamp": "2025-04-18T16:44:26Z"
  },
  {
    "title": "DOGE is slashing 90% of a federal agency designed to prevent another financial crisis",
    "description": "The Consumer Financial Protection Bureau terminated 90% of its staff.\n- A termination notice seen by BI said employees would lose access to work systems on Friday night.\n- It's Trump's latest move to gut a federal agency created to prevent another financial c…",
    "link": "https://biztoc.com/x/9c44b7da14dcb185",
    "timestamp": "2025-04-18T16:42:20Z"
  },
  {
    "title": "Trump Torched On Social Media For Comment About Congo: 'I Don't Know What That Is'",
    "description": "Trump was asked Thursday about wrongfully deporting Maryland man Kilmar Abrego Garcia — and prompted viral mockery with his baffling comment.",
    "link": "https://www.huffpost.com/entry/donald-trump-congo-comment-social-media-reactions_n_680255e5e4b01dc12d4bb78c",
    "timestamp": "2025-04-18T16:42:15Z"
  },
  {
    "title": "International Travel to the U.S. Falls Sharply",
    "description": "\"Overseas travel to the United States has declined sharply since President Donald Trump returned to office,\" the Washington Post reports. \"Industry experts say some of the reasons are plain to see: Reports of detentions and",
    "link": "https://politicalwire.com/2025/04/18/international-travel-to-the-u-s-falls-sharply/",
    "timestamp": "2025-04-18T16:42:05Z"
  },
  {
    "title": "‘I love chess’: Trump allies, Democrats clash over Van Hollen’s El Salvador visit",
    "description": "Democrats are celebrating Sen. Chris Van Hollen’s meeting with Kilmar Abrego Garcia as a victory in their fight to secure the wrongfully deported man's release. \nBut President Donald Trump is claiming the meeting as a win, too. \nThe two parties are locked int…",
    "link": "https://biztoc.com/x/4411db6605ee0446",
    "timestamp": "2025-04-18T16:42:02Z"
  },
  {
    "title": "The Conservative Case for Leaving Harvard Alone",
    "description": "The Supreme Court precedent allowing the IRS to revoke a university’s tax-exempt status is a textualist’s nightmare.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/harvard-trump-irs-nonprofit/682507/",
    "timestamp": "2025-04-18T16:42:00Z"
  },
  {
    "title": "Ask Jordan: Is presidential immunity still an open issue?",
    "description": "My understanding of the immunity case was that SCOTUS sent the case back to the lower courts to better define the scope of the president’s official responsibilities.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-supreme-court-presidential-immunity-ask-jordan-rcna201873",
    "timestamp": "2025-04-18T16:41:37Z"
  },
  {
    "title": "Trump and Bukele Mock Senator Who Visited Wrongfully Deported Man",
    "description": "The president and his administration are bashing, and trolling, Sen. Chris Hollen for visiting Kilmar Abrego Garcia in El Salvador",
    "link": "http://www.rollingstone.com/politics/politics-news/chris-van-hollen-mocked-trump-bukele-abrego-garcia-1235320723/",
    "timestamp": "2025-04-18T16:41:20Z"
  },
  {
    "title": "REPORT: Rogue FBI Agents ‘Opting Out’ Of Deportation Raids, Leaving ICE ‘Stranded’",
    "description": "Rogue agents within the Federal Bureau of Investigation are reportedly chafing at being asked to participate in arresting illegal immigrants, a slight that’s leaving immigration agents “stranded” in the field without backup during dangerous raids. A report by…",
    "link": "https://freerepublic.com/focus/f-news/4311824/posts",
    "timestamp": "2025-04-18T16:40:11Z"
  },
  {
    "title": "Trump, Britain's Starmer discuss bilateral trade, Ukraine, Middle East security",
    "description": "US President Donald Trump discussed bilateral trade, Ukraine peace talks and regional security in the Middle E",
    "link": "https://www.jpost.com/breaking-news/article-850631",
    "timestamp": "2025-04-18T16:38:32Z"
  },
  {
    "title": "PM Modi speaks to Elon Musk; collaboration in technology, innovation discussed",
    "description": "NEW DELHI: Prime Minister Narendra Modi spoke to Elon Musk, world’s richest person with a strong influence in the US administration, on Friday as they discussed the immense potential for collaboration in areas of technology and innovation. Modi said on X afte…",
    "link": "https://statetimes.in/pm-modi-speaks-to-elon-musk-collaboration-in-technology-innovation-discussed/",
    "timestamp": "2025-04-18T16:37:01Z"
  },
  {
    "title": "A season of resurrection.",
    "description": "For Christians this is an important week. It’s when Christians observe the crucifixion and resurrection of Jesus Christ. It is the resurrection – rather than the crucifixion or even the nativity – that stands at the heart of the Christian faith. Jesus’s follo…",
    "link": "https://freerepublic.com/focus/f-chat/4311823/posts",
    "timestamp": "2025-04-18T16:36:53Z"
  },
  {
    "title": "Israeli strikes kill at least 25 in Gaza and Huckabee makes first appearance as US ambassador",
    "description": "The strikes came a day after more than two dozen people died in Gaza.",
    "link": "https://www.bostonherald.com/2025/04/18/mideast-wars-huckabee/",
    "timestamp": "2025-04-18T16:36:19Z"
  },
  {
    "title": "Israeli strikes kill at least 25 in Gaza and Huckabee makes first appearance as US ambassador",
    "description": "The strikes came a day after more than two dozen people died in Gaza.",
    "link": "https://www.denverpost.com/2025/04/18/mideast-wars-huckabee/",
    "timestamp": "2025-04-18T16:36:19Z"
  },
  {
    "title": "Harvard's battle with the Trump administration is creating a thorny financial situation",
    "description": "Harvard’s brewing conflict with the Trump administration could come at a steep cost — even for the nation’s richest university.",
    "link": "https://www.nbcnews.com/business/business-news/harvards-battle-trump-administration-creating-thorny-financial-situati-rcna201894",
    "timestamp": "2025-04-18T16:36:02Z"
  },
  {
    "title": "‘This Should Be Shocking’: Conservative Judge Blasts White House As Senator Finally Accesses Abrego Garcia",
    "description": "“This should be shocking not only to judges, but to the intuitive sense of liberty that Americans far removed from courthouses still hold dear.” Those words came not from a liberal jurist or a civil liberties activist, but from Judge J. Harvie Wilkinson III, …",
    "link": "https://www.techdirt.com/2025/04/18/this-should-be-shocking-conservative-judge-blasts-white-house-as-senator-finally-accesses-abrego-garcia/",
    "timestamp": "2025-04-18T16:35:57Z"
  },
  {
    "title": "Apple's iPhone is losing ground in China while local rivals surge",
    "description": "New numbers are out for China's highly competitive smartphone market — and they're a troubling sign for Apple.",
    "link": "https://www.businessinsider.com/apple-iphone-china-market-share-shipments-data-2025-4",
    "timestamp": "2025-04-18T16:35:54Z"
  },
  {
    "title": "Legal team calls out USDA for even MORE race-based programs",
    "description": "Dairyman: 'It is outrageous that some farmers get a better deal based on race'",
    "link": "https://www.wnd.com/2025/04/legal-team-calls-out-usda-for-even-more-race-based-programs/",
    "timestamp": "2025-04-18T16:35:37Z"
  },
  {
    "title": "White House Seeks to Bring Financial Regulators Under Its Sway",
    "description": "The White House is stepping up its efforts to bring independent agencies — including the Securities and Exchange Commission and the Commodity Futures Trading Commission — under its control, requiring allies of President Donald Trump to approve all new regulat…",
    "link": "https://financialpost.com/pmn/business-pmn/white-house-seeks-to-bring-financial-regulators-under-its-sway",
    "timestamp": "2025-04-18T16:35:02Z"
  },
  {
    "title": "Dem Senator Facing Possible Logan Act Charges Over Attempt to Free MS-13 Linked Deportee",
    "description": "Senator Chris Van Hollen is facing accusations of violating the Logan Act after his recent trip to El Salvador to lobby for the release of MS-13-linked illegal alien Kilmar Abrego Garcia. The U.S. law from 1799 is aimed at preventing unauthorized foreign nego…",
    "link": "https://freerepublic.com/focus/f-news/4311822/posts",
    "timestamp": "2025-04-18T16:34:58Z"
  },
  {
    "title": "WATCH LIVE: Sen. Van Hollen holds briefing after meeting with wrongfully deported man in El Salvador",
    "description": "Van Hollen posted a photo of the meeting Thursday on X, saying he also called Abrego Garcia's wife \"to pass along his message of love.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-live-sen-van-hollen-holds-briefing-after-meeting-with-wrongfully-deported-man-in-el-salvador",
    "timestamp": "2025-04-18T16:33:16Z"
  },
  {
    "title": "Internal Trump administration document reveals massive budget cut proposal for federal health agencies - NewsBreak",
    "description": "The Trump administration is formulating plans to cut roughly a third of the federal health budget, eliminate dozens of programs and vastly whittle down hea",
    "link": "https://www.newsbreak.com/share/3965984680806-internal-trump-administration-document-reveals-massive-budget-cut-proposal-for-federal-health-agencies?s=a99&amp;share_destination_id=MTc4MDQwNTAxLTE3NDQ5OTE5MTQzNzA%3D&amp;pd=0C32Szt5&amp;hl=en_US&amp;send_time=1744991914&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.16.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v2%2Cns_foryou_blend_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v2%2Cns_foryou_model_exp_25q1-v2%2Cns_foryou_recall_exp_25q2-v4",
    "timestamp": "2025-04-18T16:33:11Z"
  },
  {
    "title": "'Light on the truth': Gabbard announces RFK files released months after Trump's order",
    "description": "DNI Director Tulsi Gabbard announced the release of the first batch of Robert F. Kennedy assassination files on Friday after having previously teased the news during a cabinet meeting earlier this month.",
    "link": "https://www.foxnews.com/politics/light-truth-gabbard-announces-rfk-files-released-months-after-trumps-order",
    "timestamp": "2025-04-18T16:31:17Z"
  },
  {
    "title": "Trump's Approval Rating Worst Among All Post-WWII Presidents—Except Himself",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump had an average approval rating of 45 percent during the first quarter of his second term in the White House, according to an analysis of polling conducted by Gallup. This was the second-…",
    "link": "https://biztoc.com/x/eb7f94a7408086c5",
    "timestamp": "2025-04-18T16:31:01Z"
  },
  {
    "title": "'F*cking Disgusting': This White House Tweet Is A Huge Self-Own",
    "description": "The Trump White House launched a tweet to say, \"We are not the same\" with a photo of Donald with Patty Morin, whose daughter Rachel was murdered in Maryland by a member of MS-13. They included an unrelated photo of Sen. Chris Van Hollen meeting with Maryland …",
    "link": "https://crooksandliars.com/2025/04/fcking-disgusting-white-house-tweet-huge",
    "timestamp": "2025-04-18T16:31:00Z"
  },
  {
    "title": "Blackwater Founder Reaches a Security Deal With DR Congo",
    "description": "Erik Prince, a businessman and longtime supporter of President Donald Trump, has reportedly agreed to help the Democratic Republic of Congo (DRC) secure and tax its vast mineral wealth.\nAccording to Reuters, he reached the agreement before the M23 rebel group…",
    "link": "https://biztoc.com/x/e5e113f480e761ab",
    "timestamp": "2025-04-18T16:30:50Z"
  },
  {
    "title": "Slog AM: Trump Tries to Weaponize the IRS, Ferguson Complains About Taxes, and Salmon Might Need a Chill Pill",
    "description": "The Stranger's morning news roundup.\n \n by Hannah Murphy Winter\n \n \n \n Good morning! It’s Friday. The sun’s out. The birds are singing. We’re hitting 71 degrees today. So let’s ruin it by talking about the news.\nTrump Tries to Use IRS as a Weapon: Do I need t…",
    "link": "https://www.thestranger.com/slog-am/2025/04/18/80019107/slog-am-trump-tries-to-weaponize-the-irs-ferguson-complains-about-taxes-and-salmon-might-need-a-chill-pill",
    "timestamp": "2025-04-18T16:30:00Z"
  },
  {
    "title": "Heartbroken FSU students mourn victims of deadly campus shooting",
    "description": "By Friday morning, memorials of candles and flowers dotted the campus, and students and professors began returning to retrieve their belongings.",
    "link": "https://nypost.com/2025/04/18/us-news/heartbroken-fsu-students-mourn-victims-of-deadly-campus-shooting/",
    "timestamp": "2025-04-18T16:29:58Z"
  },
  {
    "title": "Farmer fooled by tariff talk? Upstate NY farmer stunned as Trump tariffs hit hard, admits he thought Canada, not U.S. farmers, would foot the bill",
    "description": "Upstate NY farmer Nicholas Gilbert got a shocking $2,200 bill on a feed order from Canada—thanks to Trump’s tariffs. The dairy farmer from Potsdam mistakenly thought Canada would pay the tariff, not realizing American importers bear the cost. With no cheaper …",
    "link": "https://economictimes.indiatimes.com/news/international/us/farmer-fooled-by-tariff-talk-upstate-ny-farmer-stunned-as-trump-tariffs-hit-hard-admits-he-thought-canada-not-u-s-farmers-would-foot-the-bill/articleshow/120410583.cms",
    "timestamp": "2025-04-18T16:29:07Z"
  },
  {
    "title": "Don’t hide behind tariffs, use new opportunities to grow, says Maruti Suzuki chairman Bhargava",
    "description": "Maruti Suzuki chairman RC Bhargava advocates for India to lower tariff barriers to achieve its economic goals, emphasizing that protectionist measures hinder growth. He urges collaboration between the government and industry to enhance the competitiveness of …",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/dont-hide-behind-tariffs-use-new-opportunities-to-grow-says-maruti-suzuki-chairman-bhargava/articleshow/120412659.cms",
    "timestamp": "2025-04-18T16:27:27Z"
  },
  {
    "title": "GOP Roasts Van Hollen Over Meeting with Abrego Garcia in El Salvador",
    "description": "GOP lawmakers expressed outrage on social media after Maryland Democrat Sen. Chris Van Hollen met with a deported illegal alien in El Salvador on Thursday.... Read More\nThe post GOP Roasts Van Hollen Over Meeting with Abrego Garcia in El Salvador appeared fir…",
    "link": "https://www.dailysignal.com/2025/04/18/gop-roasts-van-hollen-over-meeting-with-abrego-garcia-in-el-salvador/",
    "timestamp": "2025-04-18T16:27:09Z"
  },
  {
    "title": "West lost proxy war to Russia – Orban",
    "description": "EU states are “hesitant to admit” failure in Ukraine, with the US in a better position due to Donald Trump, the Hungarian PM has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615968-orban-west-lost-proxy-war-russia-ukraine/",
    "timestamp": "2025-04-18T16:25:56Z"
  },
  {
    "title": "Tariffs to go away? Trade deal with China going to happen soon, says Donald Trump; here's how Americans and the world can benefit",
    "description": "Donald Trump anticipates finalizing a trade agreement with China soon. He is also confident about reaching a trade deal with the European Union. Many countries are interested in negotiating trade agreements with the US. Giorgia Meloni supports the trade talks…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tariffs-to-go-away-trade-deal-with-china-going-to-happen-soon-says-donald-trump-heres-how-americans-and-the-world-can-benefit/articleshow/120410866.cms",
    "timestamp": "2025-04-18T16:25:34Z"
  },
  {
    "title": "US lawmakers’ bipartisan Taiwan visit signals support despite harsh words and tariffs from Trump",
    "description": "The Taiwanese say they are working to strike new deals that suit the Trump administration.",
    "link": "https://www.bostonherald.com/2025/04/18/taiwan-us-senators/",
    "timestamp": "2025-04-18T16:25:09Z"
  },
  {
    "title": "JD Vance Attends Good Friday Service at Vatican with His Family",
    "description": "U.S. Vice President JD Vance and his family were at the Vatican for Good Friday services to celebrate Easter. The convalescing pope did not attend.\nThe post JD Vance Attends Good Friday Service at Vatican with His Family appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/18/jd-vance-attends-good-friday-service-at-vatican-with-his-family/",
    "timestamp": "2025-04-18T16:24:59Z"
  },
  {
    "title": "COP30 President Expects China to Set ‘Ambitious’ Climate Targets",
    "description": "After a week of meetings in Beijing, the man running global climate negotiations this year says he expects China to set ambitious targets and help contribute to a successful summit even after the US abandoned the process.",
    "link": "https://financialpost.com/pmn/business-pmn/cop30-president-expects-china-to-set-ambitious-climate-targets",
    "timestamp": "2025-04-18T16:24:49Z"
  },
  {
    "title": "Trump's Approval Rating Worst Among All Post-WWII Presidents—Except Himself",
    "description": "Trump had an average approval rating of 41 percent during the first quarter of his first term, according to Gallup.",
    "link": "https://www.newsweek.com/trumps-approval-rating-worst-among-all-post-wwii-presidents-except-himself-2061508",
    "timestamp": "2025-04-18T16:24:19Z"
  },
  {
    "title": "Newsletter:  Did you order bloody chicken wings?",
    "description": "<!-- /wp:separator -->\n\r\n\nInternet culture is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s web_crawlr newsletter here. You’ll get the best (and worst) of the internet straight into your inbox.\r\n\n\r\n\n\r\n\n\r\n\n\n\nHello fell…",
    "link": "https://www.dailydot.com/newsletters/daily-dot-newsletter-web-crawlr-04-18-2025/",
    "timestamp": "2025-04-18T16:24:10Z"
  },
  {
    "title": "Trump's Tariffs Are Starting To Kill Jobs",
    "description": "Goldman Sachs estimates that the tariffs will create about 100,000 manufacturing jobs while destroying 500,000 others. In Pennsylvania, it's already starting.",
    "link": "https://reason.com/2025/04/18/trumps-tariffs-are-starting-to-kill-jobs/",
    "timestamp": "2025-04-18T16:23:34Z"
  },
  {
    "title": "New US ambassador to Japan says hes optimistic a tariffs deal can be reached",
    "description": "New US ambassador to Japan says he's optimistic a tariffs deal can be reached",
    "link": "https://www.livemint.com/companies/news/new-us-ambassador-to-japan-says-hes-optimistic-a-tariffs-deal-can-be-reached-11744993370243.html",
    "timestamp": "2025-04-18T16:22:49Z"
  },
  {
    "title": "US seeks to turn deportations into an efficient business ‘like Amazon’",
    "description": "The world's largest immigration detention system is on the cusp of explosive growth as President Donald Trump pursues his signature campaign promise of mass deportations. The deportations represent a potential bonanza for private prison companies and a challe…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-administration-seeks-explosive-expansion-of-20282289.php",
    "timestamp": "2025-04-18T16:21:10Z"
  },
  {
    "title": "CHERNIN: Randi Weingarten’s Latest Op-Ed Isn’t About Students — It’s About Power and Fear",
    "description": "President Randi Weingarten unleashes a hyperventilating attack on Donald Trump’s executive order to dismantle the Department of Education (DOE).",
    "link": "https://dailycaller.com/2025/04/18/chernin-randi-weingartens-oped-student-fear-power/",
    "timestamp": "2025-04-18T16:20:37Z"
  },
  {
    "title": "Judge pauses Trump administration's plans for mass layoffs at Consumer Financial Protection Bureau",
    "description": "A federal judge who blocked the Trump administration from dismantling the Consumer Financial Protection Bureau has ruled that the agency can’t go forward immediately with plans to mass fire hundreds of employees.",
    "link": "https://www.ksat.com/business/2025/04/18/federal-judge-pausing-trump-administrations-plans-for-mass-layoffs-at-the-cfpb/",
    "timestamp": "2025-04-18T16:20:24Z"
  },
  {
    "title": "Meet Kevin Warsh, the financier rumored to be Trump's next pick for the Fed",
    "description": "President Trump is reportedly considering former Fed governor Kevin Warsh to replace Jerome Powell as the Federal Reserve Chair.",
    "link": "https://www.businessinsider.com/who-kevin-warsh-trump-fed-chair-replace-jerome-powell-2025-4",
    "timestamp": "2025-04-18T16:18:45Z"
  },
  {
    "title": "Wrestling Superstar Reveals Support For Trump, And The Internet Isn’t Happy",
    "description": "Wrestling superstar Roman Reigns revealed his support of Donald Trump in an April 17 interview with Vanity Fair.",
    "link": "https://dailycaller.com/2025/04/18/roman-reigns-joe-anoai-wwe-supports-donald-trump-politics/",
    "timestamp": "2025-04-18T16:17:15Z"
  },
  {
    "title": "Elon Musk Is in Huge Trouble Over Donald Trump's Tariffs",
    "description": "President Donald Trump's escalating tariff war could put Tesla in serious danger. As Politico reports, the trade war has put Tesla CEO Elon Musk in an extremely awkward position politically. While the president's top henchman's businesses are largely insulate…",
    "link": "https://futurism.com/elon-musk-trouble-donald-trump-tariffs",
    "timestamp": "2025-04-18T16:16:57Z"
  },
  {
    "title": "Kilmar Abrego Garcia suspected of human trafficking in report obtained by Fox News",
    "description": "The Homeland Security report states that \"official law enforcement investigations\" revealed Garcia was a member of the notorious gang MS-13.",
    "link": "https://www.foxnews.com/us/kilmar-abrego-garcia-suspected-human-trafficking-report-obtained-fox-news",
    "timestamp": "2025-04-18T16:15:25Z"
  },
  {
    "title": "Ex-Obama Official Tommy Vietor Wants Biden to Stop Talking: ‘It Is Enraging’",
    "description": "Pod Save America's Tommy Vietor made it clear the last person Democrats need to be hearing from right now is former President Joe Biden.\nThe post Ex-Obama Official Tommy Vietor Wants Biden to Stop Talking: ‘It Is Enraging’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/podcasts/ex-obama-official-tommy-vietor-wants-biden-to-stop-talking-it-is-enraging/",
    "timestamp": "2025-04-18T16:13:44Z"
  },
  {
    "title": "Judge pauses Trump administration’s plans for mass layoffs at Consumer Financial Protection Bureau",
    "description": "The judge says she will bar officials from cutting off employees’ access to agency computer systems.",
    "link": "https://www.bostonherald.com/2025/04/18/trump-cfpb/",
    "timestamp": "2025-04-18T16:13:36Z"
  },
  {
    "title": "Firing Head of Federal Reserve Would Be Incredibly Stupid, So Look For Trump To Do It Soon",
    "description": "Always assume the dumbest-case scenario.",
    "link": "https://www.wonkette.com/p/firing-head-of-federal-reserve-would",
    "timestamp": "2025-04-18T16:12:20Z"
  },
  {
    "title": "Iran-US talks over Tehran’s nuclear program hinge on a billionaire and a seasoned diplomat",
    "description": "Whether the two men find common ground could mean success or failure in the talks.",
    "link": "https://www.bostonherald.com/2025/04/18/iran-us-the-negotiators/",
    "timestamp": "2025-04-18T16:11:22Z"
  },
  {
    "title": "Chinese firm aiding Houthi attacks on US vessels, as airstrikes kill 74",
    "description": "The State Department is accusing a Chinese satellite firm of providing imagery to support Houthi rebel attacks in the Red Sea, escalating tensions amid ongoing maritime security concerns in the region.",
    "link": "https://www.foxnews.com/world/chinese-firm-aiding-houthi-attacks-us-vessels-airstrikes-kill-74",
    "timestamp": "2025-04-18T16:10:18Z"
  },
  {
    "title": "Nintendo Won’t Raise Switch 2 Price Amid Trump Tariffs—But Some Accessories Face Price Hike",
    "description": "The company had delayed pre-orders for its highly anticipated new console to evaluate the impact of President Donald Trump’s tariffs.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/18/nintendo-wont-raise-switch-2-price-amid-trump-tariffs-but-some-accessories-face-price-hike/",
    "timestamp": "2025-04-18T16:10:12Z"
  },
  {
    "title": "Trump Trade: President said to end IRS Direct File, block DeepSeek",
    "description": "In This Article:\nCatch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly:\nStay Ahead of the Market:\n-\nDiscover ou…",
    "link": "https://biztoc.com/x/6e5d6f489d37dfd1",
    "timestamp": "2025-04-18T16:09:24Z"
  },
  {
    "title": "Thousands of pages of documents relating to killing of Robert F Kennedy released",
    "description": "Robert F Kennedy jnr praises Donald Trump for ‘lifting the veil’ on investigation",
    "link": "https://www.irishtimes.com/world/us/2025/04/18/thousands-of-pages-of-documents-relating-to-killing-of-robert-f-kennedy-released/",
    "timestamp": "2025-04-18T16:08:48Z"
  },
  {
    "title": "This Week in Women’s Representation: Women Outperformed Expectations in Battleground Congressional Races in 2024; Gen Z Women Shake Up Congress",
    "description": "Weekend Reading for Women's Representation is a compilation of stories about women's representation. \nThis week: The 2024 election is not yet over for North Carolina Supreme Court Justice Allison Riggs; Kat Abughazaleh in Illinois and Deja Foxx in Arizona are…",
    "link": "https://msmagazine.com/2025/04/18/women-politics-representation-women-outperformed-expectations-battleground-congressional-races-2024-gen-z-women-shake-up-congress/",
    "timestamp": "2025-04-18T16:08:08Z"
  },
  {
    "title": "Houthis Say 74 Dead After U.S. Strikes Ras Isa Port",
    "description": "The U.S. said it attacked the port in an attempt “to “degrade the economic source of power of the Houthis.”",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/18/houthis-say-74-dead-after-us-strikes-ras-isa-port/",
    "timestamp": "2025-04-18T16:07:26Z"
  },
  {
    "title": "Official White House Account Makes Abrego Garcia Meeting a Sick Joke",
    "description": "Donald Trump’s administration won’t stop making horrific jokes about Senator Chris Van Hollen’s meeting with Kilmar Abrego Garica, whom the government wrongly deported to a notorious prison in El Salvador last month. \r\nVan Hollen was able to meet with Abrego …",
    "link": "https://newrepublic.com/post/194148/donald-trump-white-house-kilmar-abrego-garcia-meeting-sick-joke",
    "timestamp": "2025-04-18T16:06:37Z"
  },
  {
    "title": "Vice President JD Vance attends Vatican Good Friday service",
    "description": "U.S. Vice President JD Vance (right) and his family attend the Vatican’s Liturgy for the Lord’s Passion in St. Peter’s Basilica on Good Friday, April 18, 2025. / Credit: Daniel Ibañez/CNA\n\nVatican City, Apr 18, 2025 / 12:05 pm (CNA).\nU.S. Vice President JD Va…",
    "link": "https://www.catholicnewsagency.com/news/263475/us-vice-president-jd-vance-attends-vatican-good-friday-service",
    "timestamp": "2025-04-18T16:05:00Z"
  },
  {
    "title": "Karl Rove Warns That ‘Americans Are Already Exhausted’ by Trump and His Thirst for ‘Revenge’: This ‘Will End Badly for Him’",
    "description": "Legendary GOP political operative Karl Rove warned that \"Americans are already exhausted\" by President Donald Trump and his thirst for revenge.\nThe post Karl Rove Warns That ‘Americans Are Already Exhausted’ by Trump and His Thirst for ‘Revenge’: This ‘Will E…",
    "link": "https://www.mediaite.com/news/karl-rove-warns-that-americans-are-already-exhausted-by-trump-and-his-thirst-for-revenge-this-will-end-badly-for-him/",
    "timestamp": "2025-04-18T16:04:15Z"
  },
  {
    "title": "Trump tariffs have the US at risk of a stagflationary recession it will be ill-equipped to fight, economist says",
    "description": "\"If we get inflation, the Fed will be behind the curve,\" top economist Adam Posen warned.",
    "link": "https://www.businessinsider.com/us-economic-recession-stagflation-trump-tariff-impact-outlook-adam-posen-2025-4",
    "timestamp": "2025-04-18T16:02:49Z"
  },
  {
    "title": "Trump Wants Lower Egg Prices. He's Also Putting Tariffs on Imported Eggs.",
    "description": "The Trump administration can't seem to decide whether it wants the price of eggs to fall or rise. That might tell you something about the White House's",
    "link": "https://reason.com/2025/04/19/trump-wants-lower-egg-prices-hes-also-putting-tariffs-on-imported-eggs/",
    "timestamp": "2025-04-18T16:02:06Z"
  },
  {
    "title": "Kid Rock Unleashes on Mainstream Media: “In my Book, You Motherf***ers are Public Enemy Number One” (Video)",
    "description": "In a fiery response to media scrutiny, Kid Rock passionately defends his connections with Bill Maher and Donald Trump, igniting debate about celebrity influence in politics and media integrity.\nThe post Kid Rock Unleashes on Mainstream Media: “In my Book, You…",
    "link": "https://www.thegatewaypundit.com/2025/04/kid-rock-unleashes-mainstream-media-my-book-you/",
    "timestamp": "2025-04-18T16:00:57Z"
  },
  {
    "title": "Trump’s ‘lone ranger’: How Steve Witkoff became the defacto point man on America’s foreign policy challenges | CNN Politics",
    "description": "Last month a private jet belonging to Middle East envoy Steve Witkoff winged its way from Abu Dhabi to Doha to Moscow and Baku, before finally flying to Palm Beach, where Witkoff briefed President Donald Trump on his meeting with Russian President Vladimir Pu…",
    "link": "https://www.cnn.com/2025/04/18/politics/steve-witkoff-trump-defacto-point-man-foreign-policy/index.html",
    "timestamp": "2025-04-18T16:00:38Z"
  },
  {
    "title": "MAGA 'Mean Girls' are Trump's loyal foot soldiers (Myra Adams/The Hill)",
    "description": "Myra Adams / The Hill:\nMAGA ‘Mean Girls’ are Trump's loyal foot soldiers  —  Donald Trump 2.0 is the first “I can do anything” president.  To facilitate that governing philosophy, his squad of four powerful female enablers mirror his cocky, bullying leadershi…",
    "link": "https://www.memeorandum.com/250418/p62",
    "timestamp": "2025-04-18T16:00:38Z"
  },
  {
    "title": "Top Dem asks Noem how TSA will prevent 'major disruptions' as many travelers still lack REAL ID",
    "description": "Democrat Sen. Jack Reed of Rhode Island sent a letter to DHS Secretary Kristi Noem asking for a contingency plan in case travelers get stranded due to the REAL ID mandate.",
    "link": "https://www.foxnews.com/politics/top-dem-asks-noem-how-tsa-prevent-major-disruptions-many-travelers-still-lack-real-id",
    "timestamp": "2025-04-18T16:00:13Z"
  },
  {
    "title": "White House budget plan would reportedly scrap all funding for Head Start",
    "description": "If Donald Trump and his team have their way, Head Start might lose literally all of its federal funding.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-budget-plan-reportedly-scrap-funding-head-start-rcna201884",
    "timestamp": "2025-04-18T16:00:12Z"
  },
  {
    "title": "Ten thousand pages of RFK assassination records released",
    "description": "About 10,000 pages of records related to the assassination of Robert F Kennedy (RFK) nearly 60 years ago have been released publicly for the first time.",
    "link": "https://news.sky.com/story/ten-thousand-pages-of-robert-f-kennedy-assassination-records-released-13351223",
    "timestamp": "2025-04-18T16:00:00Z"
  },
  {
    "title": "'Kidnapping incident': Analyst highlights 'interesting history' of shooter tied to Trump",
    "description": "The suspected gunman in a deadly Florida State University mass shooting was kicked out of a political debate club for pushing white supremacist views.Phoenix Ikner, 20, allegedly used one of his stepmother's guns to kill two people and wound five others in a …",
    "link": "https://www.rawstory.com/phoenix-ikner-maga/",
    "timestamp": "2025-04-18T15:59:06Z"
  },
  {
    "title": "150 Economists Sign Letter Opposing Trump's Protectionist Agenda",
    "description": "President Donald Trump issued his executive order on regulating imports via \"reciprocal tariffs\" on April 2, which has been paused, substantially amended, or walked back in the two weeks since, wreaking havoc on the global economy. Economist Don Boudreaux, ec…",
    "link": "https://biztoc.com/x/d8a1880c35343524",
    "timestamp": "2025-04-18T15:57:48Z"
  },
  {
    "title": "Trump team 'studying' Fed Chair's 'matter,' aide says",
    "description": "US National Economic Council director Kevin Hassett said Friday that President Donald Trump and his team are reviewing whether they can remove Federal Reserve Chair Jerome Powell. \"The president and h...",
    "link": "https://biztoc.com/x/282640b3e1fa6eb4",
    "timestamp": "2025-04-18T15:57:30Z"
  },
  {
    "title": "Supreme Court Agrees to Hear Case Involving Birthright Citizenship Clause",
    "description": "The Supreme Court will hear oral arguments on the case on May 15.",
    "link": "https://truthout.org/articles/supreme-court-agrees-to-hear-case-involving-birthright-citizenship-clause/",
    "timestamp": "2025-04-18T15:57:01Z"
  },
  {
    "title": "Former Google CEO Eric Schmidt says Trump has launched an 'attack on science'",
    "description": "Former Google CEO Eric Schmidt said Trump's funding cuts could chill US tech development just as competition with China is ramping up.",
    "link": "https://www.businessinsider.com/eric-schmidt-google-trump-attack-on-science-research-funding-harvard-2025-4",
    "timestamp": "2025-04-18T15:56:27Z"
  },
  {
    "title": "US rushed Afghan pullout allowed Taliban to traffic US weapons to Houthis",
    "description": "Sources claim that half the weapons left behind by the US have been lost, sold or smuggled.",
    "link": "https://www.jpost.com/middle-east/article-850628",
    "timestamp": "2025-04-18T15:55:42Z"
  }
]