[
  {
    "title": "‘Spending like drunken sailors’: ICE $1B over budget ahead of new deportations",
    "description": "Although President Donald Trump’s Immigration and Customs Enforcement agency is deporting people at a slower pace than President Joe Biden did last year, ICE, under the direction of Homeland Security Secretary Kristi Noem, is reportedly $1 billion over budget…",
    "link": "https://www.rawstory.com/ice-deportations-2672380494/",
    "timestamp": "2025-06-16T21:49:46Z"
  },
  {
    "title": "Netanyahu Won’t Rule Out Targeting Khamenei, Suggesting It Would ‘End the Conflict’",
    "description": "Israeli Prime Minister Benjamin Netanyahu declared that eliminating Ayatollah Ali Khamenei would not escalate tensions, but rather would help “end the conflict” by removing the threat posed by the theocratic regime, likening Iran’s leader to “a modern Hitler”…",
    "link": "https://www.breitbart.com/politics/2025/06/16/netanyahu-wont-rule-out-targeting-khamenei-suggesting-it-would-end-conflict/",
    "timestamp": "2025-06-16T21:49:37Z"
  },
  {
    "title": "Oil prices fall $1 per barrel on reports Iran seeks truce with Israel",
    "description": "NEW YORK: Oil prices slipped US$1 per barrel on Monday (Jun 16) in volatile trading after reports that Iran is seeking an end to hostilities with Israel, raising the possibility of",
    "link": "https://www.channelnewsasia.com/business/oil-prices-fall-1-barrel-reports-iran-seeks-truce-israel-5185911",
    "timestamp": "2025-06-16T21:48:00Z"
  },
  {
    "title": "Oil prices fall US$1 per barrel on reports Iran seeks truce with Israel",
    "description": "NEW YORK: Oil prices slipped US$1 per barrel on Monday (Jun 16) in volatile trading after reports that Iran is seeking an end to hostilities with Israel, raising the possibility of",
    "link": "https://www.channelnewsasia.com/business/oil-prices-fall-us1-barrel-reports-iran-seeks-truce-israel-5185911",
    "timestamp": "2025-06-16T21:48:00Z"
  },
  {
    "title": "Crypto Is Now Trump's Second-Most Lucrative Source of Income",
    "description": "The president made more money off crypto than most income streams in 2024—before he re-assumed the White House and made billions more off the sector.",
    "link": "https://decrypt.co/325440/crypto-is-now-trumps-second-most-lucrative-source-income",
    "timestamp": "2025-06-16T21:46:53Z"
  },
  {
    "title": "Joni Ernst’s Sick Response to Medicaid Cuts Has Tanked Her Career",
    "description": "Will Iowa Senator Joni Enst call it quits after her humiliating defense of Donald Trump’s budget bill?\r\nSeveral Republican aides, consultants, and strategists told The Wall Street Journal that there was widespread speculation Ernst would not seek another term…",
    "link": "https://newrepublic.com/post/196894/joni-ernst-response-medicaid-cuts-reelection",
    "timestamp": "2025-06-16T21:45:43Z"
  },
  {
    "title": "US and UK say they've cemented a trade agreement that Trump calls fair for both nations",
    "description": "U.S. President Donald Trump and British Prime Minister Keir Starmer say they have signed a trade deal that will slash tariffs on U.K. auto and aerospace industry imports, but they are still discussing how to handle steel production.",
    "link": "https://www.wsls.com/business/2025/06/16/us-and-uk-say-theyve-cemented-a-trade-agreement-that-trump-calls-fair-for-both-nations/",
    "timestamp": "2025-06-16T21:44:49Z"
  },
  {
    "title": "Trump Says Russia Sanctions Would Cost US ‘a Lot of Money’",
    "description": "US President Donald Trump indicated at the Group of Seven summit that he is in no rush to impose tougher sanctions on Russia, dismissing pressure from allied leaders eager to do more to push Moscow to the negotiating table.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-russia-sanctions-would-cost-us-a-lot-of-money",
    "timestamp": "2025-06-16T21:44:42Z"
  },
  {
    "title": "Tucker Carlson and Steve Bannon Lead MAGA Resistance to Iran War",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs President Donald Trump is caught in a tug-of-war over the U.S. potentially wading into the escalating conflict between Israel and Iran, former Fox News host Tucker Carlson and ex-White House chief strategis…",
    "link": "https://biztoc.com/x/43d83ce7c9647fe5",
    "timestamp": "2025-06-16T21:44:39Z"
  },
  {
    "title": "Based Bill Maher SCHOOLS Woke Sean Penn For Insane TDS",
    "description": "Bill Maher ridicules actor Sean Penn over his answer on whether he would meet President Donald Trump. Rob McGreevy breaks it down on Media Madness.",
    "link": "https://dailycaller.com/2025/06/16/bill-maher-schools-woke-sean-penn-insane-tds-chavez-castro/",
    "timestamp": "2025-06-16T21:42:21Z"
  },
  {
    "title": "Senate Republicans release Trump agenda bill text on Medicaid, Medicare and SALT",
    "description": "The legislation keeps some House provisions, like new Medicaid rules, while making significant changes in other areas, including Medicare and the state and local tax deduction.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-release-trump-agenda-bill-text-medicaid-medicare-sa-rcna213243",
    "timestamp": "2025-06-16T21:42:11Z"
  },
  {
    "title": "Trump formalizes tariff cuts for U.K. as trade talks continue",
    "description": "President Donald Trump on Monday signed an agreement formally lowering some tariffs on imports from the United Kingdom as the two countries continue working toward a formal trade deal",
    "link": "https://www.nbcnews.com/business/business-news/trump-formalizes-tariff-cuts-uk-trade-talks-continue-rcna213370",
    "timestamp": "2025-06-16T21:41:42Z"
  },
  {
    "title": "G7 skirts touchy AI safety discussion",
    "description": "As they acknowledge the energy costs for artificial intelligence, G7 leaders abandon deeper language on AI.",
    "link": "https://www.politico.eu/article/g7-ai-safety-discussion-tech-summit-canada-leaders/",
    "timestamp": "2025-06-16T21:41:18Z"
  },
  {
    "title": "Attorney General Mayes Sues Trump Administration Over Illegal Funding Cuts and Delays for Medical and Public Health Research",
    "description": "PHOENIX – Attorney General Kris Mayes today joined a coalition of 16 attorneys general in suing the Trump Administration in the U.S. District Court for Massachusetts over its unlawful attempt to disrupt grant funding issued by the National Institutes of Healt…",
    "link": "https://www.azag.gov/press-release/attorney-general-mayes-sues-trump-administration-over-illegal-funding-cuts-and-delays",
    "timestamp": "2025-06-16T21:41:04Z"
  },
  {
    "title": "WATCH: Israeli Journalist Explains Trump's 'Fabulous' Response to Israeli Strikes on Iran",
    "description": "President Donald Trump took a page straight from the Iranian diplomatic playbook when he claimed the United States had nothing to do with Israel’s preemptive strike on Tehran and urged the country’s hardline leadership to sit back down at the bargaining table…",
    "link": "https://freebeacon.com/israel/watch-israeli-journalist-explains-trumps-fabulous-response-to-israeli-strikes-on-iran/",
    "timestamp": "2025-06-16T21:40:57Z"
  },
  {
    "title": "Duffy to Sanctuary Cities: No Riot Relief on Taxpayer's Dime",
    "description": "Transportation Secretary Sean Duffy announced that sanctuary cities will be denied federal tax dollars to repair damage caused by the recent anti-ICE riots. Duffy made it clear that cities refusing to cooperate with federal immigration enforcement shouldn’t e…",
    "link": "https://freerepublic.com/focus/f-news/4323459/posts",
    "timestamp": "2025-06-16T21:40:21Z"
  },
  {
    "title": "Trump's 14-year history opposing Iranian nukes counters media spin he'd allow them",
    "description": "Despite previous media reporting the Trump administration is open to allowing Iran to continue its uranium enrichment program, President Trump has repeatedly said otherwise.",
    "link": "https://www.foxnews.com/politics/trumps-14-year-history-opposing-iranian-nukes-counters-media-spin-hed-allow-them",
    "timestamp": "2025-06-16T21:39:08Z"
  },
  {
    "title": "Tucker Carlson and Steve Bannon Lead MAGA Resistance to Iran War",
    "description": "Carlson and Bannon are the face of the MAGA wing staunchly opposed to the U.S. wading into the Israel-Iran conflict.",
    "link": "https://www.newsweek.com/tucker-carlson-steve-bannon-maga-trump-iran-israel-war-2086346",
    "timestamp": "2025-06-16T21:38:54Z"
  },
  {
    "title": "Ishiba and Trump meet on sidelines of G7 amid tariff concerns",
    "description": "Prime Minister Shigeru Ishiba and U.S. President Donald Trump met Monday on the sidelines of the annual G7 gathering in Canada, as Tokyo sought an easing of onerous tariffs.",
    "link": "https://www.japantimes.co.jp/news/2025/06/17/japan/politics/ishiba-trump-g7-meeting/",
    "timestamp": "2025-06-16T21:38:00Z"
  },
  {
    "title": "Is the Gold Trump Mobile T1 Phone Real? Sort Of!",
    "description": "Is the gold Trump mobile T1 phone real? Sort of! The Trump Organization really is launching a smartphone along with its Trump mobile cell service. But much of what they’ve said about the ‘Made in America’ T1 phone is impossible.",
    "link": "http://nymag.com/intelligencer/article/is-gold-trump-mobile-t1-phone-real.html",
    "timestamp": "2025-06-16T21:37:42Z"
  },
  {
    "title": "Trump Rails Against Trudeau For Kicking Russia Out of the G8 — But It Was Actually His Conservative Predecessor Who Led the Charge",
    "description": "Russia being expelled from the G8 was also a very popular move among American conservatives at the time\nThe post Trump Rails Against Trudeau For Kicking Russia Out of the G8 — But It Was Actually His Conservative Predecessor Who Led the Charge first appeared …",
    "link": "https://www.mediaite.com/politics/trump-rails-against-trudeau-for-kicking-russia-out-of-the-g8-but-it-was-actually-his-conservative-predecessor-who-led-the-charge/",
    "timestamp": "2025-06-16T21:37:21Z"
  },
  {
    "title": "What Was Caitlyn Jenner Doing in Israel?",
    "description": "The reality star and conservative celebrity’s plans were cut short after war broke out between Israel and Iran.",
    "link": "http://www.thecut.com/article/caitlyn-jenner-israel-iran-strikes.html",
    "timestamp": "2025-06-16T21:37:14Z"
  },
  {
    "title": "Trump Refuses to Sign G7 Statement on Iran; Wants Total End to Nuclear Enrichment",
    "description": "President Donald Trump rejected the G7's proposed statement on Iran because it called for monitoring of Iran's nuclear activities, rather than an outright halt to Iran's program of nuclear enrichment.\nThe post Trump Refuses to Sign G7 Statement on Iran; Wants…",
    "link": "https://www.breitbart.com/middle-east/2025/06/16/trump-refuses-to-sign-g7-statement-on-iran-wants-total-end-to-nuclear-enrichment/",
    "timestamp": "2025-06-16T21:37:12Z"
  },
  {
    "title": "An Executive Order from Trump Now Allows V.A. Doctors to Refuse Care to Democrats",
    "description": "If the president loves the troops as much as he claims, he wouldn’t politicize medical care for veterans.",
    "link": "https://www.esquire.com/news-politics/politics/a65080210/veterans-affairs-care-transgender-people-democrats/",
    "timestamp": "2025-06-16T21:36:00Z"
  },
  {
    "title": "Senate Republicans Unveil Key Part Of 'Big Beautiful Bill' — And It’s Unlikely To Go Over Well",
    "description": "The new proposal sets up a clash with House Republicans and some GOP senators too.",
    "link": "https://www.huffpost.com/entry/senate-finance-committee-big-beautiful-bill_n_68508419e4b072f3c80de92f",
    "timestamp": "2025-06-16T21:35:05Z"
  },
  {
    "title": "ICE detains Utah college student after brief traffic stop, raising questions",
    "description": "University of Utah student Caroline Dias Goncalves was briefly pulled over by a sheriff's deputy in Colorado before  immigration agents detained her; now county officials are conducting a review.",
    "link": "https://www.nbcnews.com/news/latino/ice-detains-utah-university-student-traffic-stop-colorado-rcna213231",
    "timestamp": "2025-06-16T21:35:02Z"
  },
  {
    "title": "American Bar Association sues Trump administration over executive orders targeting law firms (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nAmerican Bar Association sues Trump administration over executive orders targeting law firms  —  It claims the executive orders pursued by the White House have cast a chill across the legal industry.  —  The American Bar Associ…",
    "link": "https://www.memeorandum.com/250616/p123",
    "timestamp": "2025-06-16T21:35:00Z"
  },
  {
    "title": "US And UK Say They Reached Trade Agreement That Trump Calls 'Fair'",
    "description": "The deal, however, does not address tariffs on steel.",
    "link": "https://www.huffpost.com/entry/us-and-uk-say-they-reached-trade-agreement-that-trump-calls-fair_n_68508cf5e4b0e06f8e60439d",
    "timestamp": "2025-06-16T21:34:41Z"
  },
  {
    "title": "Ishiba, Trump hold talks on sidelines of G7 summit",
    "description": "Japanese Prime Minister Shigeru Ishiba and U.S. President Donald Trump held talks Monday on the sidelines of the Group of Seven leaders' summit in Canada, a Japanese official said. Their half-hour meeting followed rounds of tariff negotiations at the minister…",
    "link": "https://japantoday.com/category/politics/update1-japan-u.s.-leaders-hold-talks-on-g7-fringes",
    "timestamp": "2025-06-16T21:34:27Z"
  },
  {
    "title": "G7 leaders struggle for unity as Trump says removing Russia from group was a mistake",
    "description": "Group of Seven leaders met on Monday seeking a common approach on wars in Ukraine and the Middle East but faced early challenges as U.S. President Donald Trump said removing Russia from the former Group of Eight over a decade ago had been a mistake. The once …",
    "link": "https://japantoday.com/category/world/g7-leaders-struggle-for-unity-as-trump-says-removing-russia-from-group-was-a-mistake2",
    "timestamp": "2025-06-16T21:34:13Z"
  },
  {
    "title": "Trump signs order confirming parts of UK-US tariff deal",
    "description": "Trump signs order confirming parts of UK-US tariff deal\nUS President Donald Trump has signed documents to reduce tariffs on UK cars, which will bring into force parts of a tariff pact agreed between the two countries last month.\nSpeaking at the G7 summit in C…",
    "link": "https://biztoc.com/x/ee9e6cca14719ac5",
    "timestamp": "2025-06-16T21:33:25Z"
  },
  {
    "title": "US and UK say they’ve cemented a trade agreement that Trump calls fair for both nations",
    "description": "By JILL LAWLESS, Associated Press\nBANFF, Alberta (AP) — President Donald Trump and Prime Minister Keir Starmer said Monday that they are signing a trade deal that will slash tariffs on goods from both countries.\nThe deal does not include tariffs on steel, an …",
    "link": "https://biztoc.com/x/5e0ba1f117787ccf",
    "timestamp": "2025-06-16T21:33:16Z"
  },
  {
    "title": "WATCH: Trump, Starmer announce trade deal at G7 summit",
    "description": "President Donald Trump and Prime Minister Keir Starmer said Monday that they are signing a trade deal that will slash tariffs on goods from both countries.",
    "link": "https://biztoc.com/x/4526db8f861fc7ed",
    "timestamp": "2025-06-16T21:33:03Z"
  },
  {
    "title": "China factory output slumps but consumption offers bright spot",
    "description": "China's factory output grew slower than expected last month as trade war pressures bit, official data showed Monday, while a bump in a key gauge of domestic consumption offered a rare bright spot for the economy. The United States and China this month agreed …",
    "link": "https://japantoday.com/category/business/china-factory-output-slumps-but-consumption-offers-bright-spot",
    "timestamp": "2025-06-16T21:32:50Z"
  },
  {
    "title": "The Trump Administration Is Quietly Pushing Through A Change To A 50-Year-Old Law",
    "description": "Civil rights advocates warn the new rule would harm cisgender women and trans athletes alike.",
    "link": "https://www.huffpost.com/entry/trump-administration-civil-rights-department-of-energy_n_685077c0e4b003eec670dbc8",
    "timestamp": "2025-06-16T21:32:30Z"
  },
  {
    "title": "Officers who cover their faces could be charged with a misdemeanor under California proposal",
    "description": "Local, state, and federal law enforcement officers who cover their faces while conducting official business could face a misdemeanor charge in California under a new proposal announced Monday. The bill would require all law enforcement officials show their fa…",
    "link": "https://japantoday.com/category/world/officers-who-cover-their-faces-could-be-charged-with-a-misdemeanor-under-california-proposal",
    "timestamp": "2025-06-16T21:32:14Z"
  },
  {
    "title": "Suspect in Minnesota lawmaker killing visited other legislators' homes, prosecutors say",
    "description": "The suspect accused of assassinating a Minnesota lawmaker and shooting another this weekend drove to the homes of at least four state politicians as part of a planned killing spree, U.S. authorities said on Monday. Vance Boelter, 57, faces state and federal m…",
    "link": "https://japantoday.com/category/world/suspect-in-minnesota-lawmaker-killing-visited-other-legislators%27-homes-prosecutors-say3",
    "timestamp": "2025-06-16T21:32:00Z"
  },
  {
    "title": "Judge extends order suspending Trump's block on Harvard's incoming foreign students",
    "description": "President Donald Trump’s order to block incoming foreign students from attending Harvard University will remain on hold temporarily following a hearing Monday, when a lawyer for the Ivy League school said Trump was using its students as “pawns.” U.S. District…",
    "link": "https://japantoday.com/category/world/judge-extends-order-suspending-trump%27s-block-on-harvard%27s-incoming-foreign-students",
    "timestamp": "2025-06-16T21:31:51Z"
  },
  {
    "title": "Russia says U.S. has canceled next round of talks on easing tensions",
    "description": "Russia said on Monday that the United States had canceled the next round of talks between the two countries, an apparent setback in a process launched by presidents Vladimir Putin and Donald Trump to improve bilateral ties. In a statement, Foreign Ministry sp…",
    "link": "https://japantoday.com/category/world/russia-says-us-has-cancelled-next-round-of-talks-on-easing-tensions1",
    "timestamp": "2025-06-16T21:31:44Z"
  },
  {
    "title": "Iran urges Trump to make Israel halt war",
    "description": "An Israeli strike hit Iran's state broadcaster on Monday while the head of the U.N. nuclear watchdog indicated extensive damage to Iran's biggest uranium enrichment plant and Iran called on the U.S. to force a ceasefire in the four-day-old aerial war. Late on…",
    "link": "https://japantoday.com/category/world/iranian-state-broadcaster-hit-as-iran-urges-trump-to-make-israel-halt-war2",
    "timestamp": "2025-06-16T21:31:27Z"
  },
  {
    "title": "UK-US trade deal is ‘done’, Donald Trump says as he meets Keir Starmer at G7 summit",
    "description": "In recent months, the UK has held a series of engagements aimed at securing a reduction in the tariffs Trump imposed on Britain and the rest of the world on 2 April.",
    "link": "https://www.thejournal.ie/trump-keir-starmer-us-uk-trade-deal-6735007-Jun2025/",
    "timestamp": "2025-06-16T21:29:40Z"
  },
  {
    "title": "WATCH: Trump says ‘not a bad idea’ to include China in G7, removing Russia ‘a mistake’",
    "description": "The U.S. leader indicated that he would rather have the G7 become the G8 or possibly even the G9, although Russia and China would notably be authoritarian governments in an organization whose members are democracies.",
    "link": "https://www.pbs.org/newshour/world/watch-trump-says-not-a-bad-idea-to-include-china-in-g7-removing-russia-a-mistake",
    "timestamp": "2025-06-16T21:29:02Z"
  },
  {
    "title": "EXCLUSIVE: University Consultants Debated Creating ‘LGBTQ+ Church’ To Skirt Trump’s Orders",
    "description": "Consultants and university administrators are discussing ways to skirt the Trump administration's orders to cater to transgender students.",
    "link": "https://dailycaller.com/2025/06/16/exclusive-university-consultants-lgbtq-church/",
    "timestamp": "2025-06-16T21:28:43Z"
  },
  {
    "title": "US and UK say they’ve cemented a trade agreement that Trump calls fair for both nations",
    "description": "The deal does not include tariffs on steel, an especially important piece of bilateral trade.",
    "link": "https://www.denverpost.com/2025/06/16/us-uk-trade/",
    "timestamp": "2025-06-16T21:27:23Z"
  },
  {
    "title": "US and UK say they’ve cemented a trade agreement that Trump calls fair for both nations",
    "description": "The deal does not include tariffs on steel, an especially important piece of bilateral trade.",
    "link": "https://www.bostonherald.com/2025/06/16/us-uk-trade/",
    "timestamp": "2025-06-16T21:27:23Z"
  },
  {
    "title": "Trump does not intend to sign G7 statement on Iran as of now: Sources",
    "description": "President Donald Trump said on Monday that Iran wants to \"talk\" about deescalation as deadly aerial attacks between Tehran and Israel continue.",
    "link": "https://abcnews.go.com/Politics/trump-iran-talk-winning-conflict-israel/story?id=122905664",
    "timestamp": "2025-06-16T21:27:17Z"
  },
  {
    "title": "No deal as Ishiba, Trump end trade talks with pledge to keep negotiating",
    "description": "KANANASKIS, Alberta: Japanese Prime Minister Shigeru Ishiba and US President Donald Trump agreed to push ahead with trade talks on Monday (Jun 16), but failed to achieve a breakthrough that would lower or eliminate tariffs that threaten to hobble the Japanese…",
    "link": "https://www.channelnewsasia.com/east-asia/no-deal-ishiba-trump-end-trade-talks-pledge-keep-negotiating-5185826",
    "timestamp": "2025-06-16T21:27:00Z"
  },
  {
    "title": "The Rise of Political Violence and Targeting of Lawmakers in the U.S.",
    "description": "The shootings of two Minnesota lawmakers and their spouses are the latest instances of political violence that has risen across the country.",
    "link": "https://time.com/7294891/political-violence-rise-america/",
    "timestamp": "2025-06-16T21:26:26Z"
  },
  {
    "title": "WATCH: Trump, Starmer announce trade deal at G7 summit",
    "description": "President Donald Trump and Prime Minister Keir Starmer said Monday that they are signing a trade deal that will slash tariffs on goods from both countries.",
    "link": "https://www.pbs.org/newshour/world/watch-trump-starmer-announce-trade-deal-at-g7-summit",
    "timestamp": "2025-06-16T21:25:43Z"
  },
  {
    "title": "Trump signs order confirming parts of UK-US tariff deal",
    "description": "The pact between the US and UK means tariffs will be reduced on certain goods such as cars entering the US.",
    "link": "https://www.bbc.com/news/articles/cy8gxp7dvepo",
    "timestamp": "2025-06-16T21:25:19Z"
  },
  {
    "title": "The Trump-Musk Split Is a Gift to the Left",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Trump-Musk Split Is a Gift to the Left appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/06/16/the-trump-musk-split-is-a-gift-to-the-left/",
    "timestamp": "2025-06-16T21:24:38Z"
  },
  {
    "title": "Israel Strikes Iran. Is Escalation Inevitable?",
    "description": "The Reason Roundtable discusses the fallout from Israel's strike on Iran, the likelihood of escalation, and what role the U.S. is already playing.",
    "link": "https://reason.com/podcast/2025/06/16/israel-strikes-iran-is-escalation-inevitable/",
    "timestamp": "2025-06-16T21:23:21Z"
  },
  {
    "title": "US and UK say they've cemented a trade agreement that Trump calls fair for both nations",
    "description": "President Donald Trump and Prime Minister Keir Starmer say they are signing a trade deal to ease tariffs between goods from the U.S. and the United Kingdom. The deal does not include tariffs on steel, an especially important piece of bilateral trade. Instead,…",
    "link": "https://www.seattlepi.com/news/politics/article/us-and-uk-say-they-ve-cemented-a-trade-agreement-20380104.php",
    "timestamp": "2025-06-16T21:22:50Z"
  },
  {
    "title": "Trump, Starmer finalize trade deal",
    "description": "United States President Donald Trump and United Kingdom Prime Minister Keir Starmer presented a signed trade deal to reporters at the G7 summit in Alberta, with Trump describing it as a \"fair dea...",
    "link": "https://biztoc.com/x/e564df9bf6bcfe3d",
    "timestamp": "2025-06-16T21:22:08Z"
  },
  {
    "title": "Donald Trump is the first president in 116 years to not be invited to the NAACP convention",
    "description": "The NAACP announced Monday the group will not invite President Donald Trump to its national convention next month in Charlotte, North Carolina, the first time the prominent civil rights organization has opted to exclude a sitting president in its 116-year his…",
    "link": "https://biztoc.com/x/bc53f04bf962f954",
    "timestamp": "2025-06-16T21:22:01Z"
  },
  {
    "title": "EXCLUSIVE: NIH Renews Grants for Harvard Monkey Lab, Fauci’s Beagle and Primate Tests",
    "description": "Despite President Donald Trump’s Department of Veterans Affairs and Navy moving to end cruel animal testing, the National Institutes of Health, under Director Jay Bhattacharya, has renewed millions in funding for controversial experiments, including THC tests…",
    "link": "https://www.thegatewaypundit.com/2025/06/exclusive-nih-renews-grants-harvard-monkey-lab-faucis/",
    "timestamp": "2025-06-16T21:20:25Z"
  },
  {
    "title": "Fired ABC News Journalist Defends Anti-Trump Tweet, “Accurate and True”",
    "description": "For years, Donald Trump has been at odds with ABC News and frequently accuses the network of being “unfair” and “dishonest.” He has also demanded that Disney CEO Bob Iger fire everybody who works there. Despite those accusations, he continues to interview wit…",
    "link": "https://insidethemagic.net/2025/06/fired-abc-reporter-defends-anti-trump-tweet-accurate-and-true-ks1/",
    "timestamp": "2025-06-16T21:20:21Z"
  },
  {
    "title": "'It's wrong': Hawley warns Senate GOP not to boot Americans from Medicaid in Trump megabill",
    "description": "Sen. Josh Hawley wants his colleagues to follow the president's lead on preserving Medicaid benefits as the Senate Finance Committee prepares its version of Trump's budget bill",
    "link": "https://www.foxnews.com/politics/its-wrong-hawley-warns-senate-gop-not-boot-americans-from-medicaid-trump-megabill",
    "timestamp": "2025-06-16T21:19:58Z"
  },
  {
    "title": "No Kings for a Day",
    "description": "Donald Trump’s long-desired military parade in Washington was overshadowed by millions of Americans speaking out in thousands of towns and cities. Let’s hope Democratic leaders were paying attention.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-no-kings-politics",
    "timestamp": "2025-06-16T21:17:38Z"
  },
  {
    "title": "Donald Trump is the first president in 116 years to not be invited to the NAACP convention",
    "description": "The NAACP announced Monday the group will not invite President Donald Trump to its national convention next month in Charlotte, North Carolina, the first time the prominent civil rights organization has opted to exclude a sitting president in its 116-year his…",
    "link": "https://www.pbs.org/newshour/politics/donald-trump-is-the-first-president-in-116-years-to-not-be-invited-to-the-naacp-convention",
    "timestamp": "2025-06-16T21:17:12Z"
  },
  {
    "title": "The Left’s ‘No Kings’ Protests Were All About Sanctimony",
    "description": "“No Kings” protests of various sizes broke in mostly blue cities on Saturday. The defining feature of these rather tame demonstrations—that appeared to be mostly... Read More\nThe post The Left’s ‘No Kings’ Protests Were All About Sanctimony appeared first on …",
    "link": "https://www.dailysignal.com/2025/06/16/the-lefts-no-kings-protests-were-all-about-sanctimony/",
    "timestamp": "2025-06-16T21:16:47Z"
  },
  {
    "title": "Trump Orders ICE to Ravage Democratic Cities After Countrywide Protests",
    "description": "Trump says he’s ordering his entire administration to attack cities he calls “the Democrat Power Center.”…",
    "link": "https://truthout.org/articles/trump-orders-ice-to-ravage-democratic-cities-after-countrywide-protests/",
    "timestamp": "2025-06-16T21:15:19Z"
  },
  {
    "title": "Trump: Iran wants to make a deal, a deal will be signed",
    "description": "US President tells reporters at G7 summit that Iran is back at the negotiating table and will sign an agreement: They would be foolish not to.",
    "link": "https://www.israelnationalnews.com/news/410134",
    "timestamp": "2025-06-16T21:15:00Z"
  },
  {
    "title": "As a state lawmaker, I’ve faced death threats but refuse to let political assassinations, like the ones in Minnesota, silence me (Opinion)",
    "description": "In Trump’s America, when you fight to defend your neighbors, when you stand up for justice and truth, you become a target.",
    "link": "https://www.denverpost.com/2025/06/16/minnesota-assassination-political-violence-julie-gonzales/",
    "timestamp": "2025-06-16T21:13:49Z"
  },
  {
    "title": "MAGA Desperately Scrambles to Claim Minnesota Assassin Is a Democrat",
    "description": "Vance Boelter allegedly shot and killed Democratic Minnesota state Representative Melissa Hortman and her husband Saturday. Hours later, conservatives were twisting Boelter’s political ideology to shield MAGA, claiming that the suspected cop/masked killer was…",
    "link": "https://newrepublic.com/post/196885/maga-claim-conspiracy-minnesota-assassination-democrat",
    "timestamp": "2025-06-16T21:13:43Z"
  },
  {
    "title": "Trump Organization launches mobile service, touting a $499 phone",
    "description": "U.S. President Donald Trump's family business licensed its name to launch a mobile service in the United States and a $499 US smartphone.",
    "link": "https://www.cbc.ca/news/world/trump-mobile-phone-service-1.7562631",
    "timestamp": "2025-06-16T21:12:37Z"
  },
  {
    "title": "Trump, Starmer sign trade deal",
    "description": "United States President Donald Trump and United Kingdom Prime Minister Keir Starmer presented a signed trade deal to reporters at the G7 summit, with Trump describing it as a \"fair deal for both....",
    "link": "https://biztoc.com/x/24141191bc73396b",
    "timestamp": "2025-06-16T21:11:14Z"
  },
  {
    "title": "US Senate Republicans unveil proposed changes to Trump tax-cut bill",
    "description": "WASHINGTON (Reuters) -Republicans who control the U.S. Senate Finance Committee unveiled changes to President Donald Trump's sweeping tax-cut and spending...",
    "link": "https://www.yahoo.com/news/us-senate-republicans-unveil-proposed-211109212.html",
    "timestamp": "2025-06-16T21:11:09Z"
  },
  {
    "title": "Stating the obvious: Mass protests are not going to help Trump (Philip Bump/Washington Post)",
    "description": "Philip Bump / Washington Post:\nStating the obvious: Mass protests are not going to help Trump  —  Republicans continue to stand by Trump, while the rest of the country is getting fed up.  —  It's understandable that media coverage of Saturday's events would f…",
    "link": "https://www.memeorandum.com/250616/p119",
    "timestamp": "2025-06-16T21:10:01Z"
  },
  {
    "title": "President Donald Trump set to implement UK trade deal",
    "description": "UK Prime Minister Keir Starmer is set to agree Monday with U.S. President Donald Trump to implement a trade deal announced last month…\nThe post President Donald Trump set to implement UK trade deal appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/06/16/president-donald-trump-set-to-implement-uk-trade-deal/",
    "timestamp": "2025-06-16T21:09:16Z"
  },
  {
    "title": "3 takeaways from the NBC News Decision Desk poll: From the Politics Desk",
    "description": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/takeaways-nbc-news-decision-desk-poll-politics-desk-rcna213328",
    "timestamp": "2025-06-16T21:08:46Z"
  },
  {
    "title": "A hillside of white crosses fuels a misleading story about South Africa’s farm killings",
    "description": "Nearly 3,000 white crosses on a hill in South Africa are a memorial to white people killed on farms over the last three decades. It's a visceral snapshot seized on by some in South Africa to drive a discredited narrative that white farmers in the majority Bla…",
    "link": "https://www.pbs.org/newshour/world/a-hillside-of-white-crosses-fuels-a-misleading-story-about-south-africas-farm-killings",
    "timestamp": "2025-06-16T21:07:15Z"
  },
  {
    "title": "Trump Roasted For ‘Tone Deaf’ Attack on Minnesota Governor When Asked About Assassinations",
    "description": "President Donald Trump sparked outrage on social media for his criticism of Minnesota Gov. Tim Walz in the response to the shootings of state lawmakers.\nThe post Trump Roasted For ‘Tone Deaf’ Attack on Minnesota Governor When Asked About Assassinations first …",
    "link": "https://www.mediaite.com/politics/trump-roasted-for-tone-deaf-attack-on-minnesota-governor-when-asked-about-assassinations/",
    "timestamp": "2025-06-16T21:07:15Z"
  },
  {
    "title": "Trump Says Trade Will Be 'Our Primary Focus' of G7 Summit",
    "description": "President Donald Trump said Monday that trade would be the primary focus of the G7 meetings in Alberta, Canada.\nThe post Trump Says Trade Will Be ‘Our Primary Focus’ of G7 Summit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/16/trump-says-trade-will-be-our-primary-focus-of-g7-summit/",
    "timestamp": "2025-06-16T21:07:00Z"
  },
  {
    "title": "‘The Age of Trump’ Enters Its Second Decade",
    "description": "New York Times: “It has been 10 years now, as of Monday, since Donald Trump descended to the lobby of his namesake tower to announce his campaign for president. Ten years of jaw-dropping, woke-busting, scandal-defying,",
    "link": "https://politicalwire.com/2025/06/16/the-age-of-trump-enters-its-second-decade/",
    "timestamp": "2025-06-16T21:07:00Z"
  },
  {
    "title": "Judge deems Trump's cuts to National Institutes of Health illegal",
    "description": "A federal judge in Boston on Monday said the termination of National Institutes of Health grants for research on diversity-related topics by President Donald Trump's administration was “void and illegal,” and accused the government of discriminating against r…",
    "link": "https://www.nbcnews.com/science/science-news/judge-deems-trumps-cuts-national-institutes-health-illegal-rcna213360",
    "timestamp": "2025-06-16T21:05:29Z"
  },
  {
    "title": "5 Million People Attended “No Kings” Protests. How Can We Build on This?",
    "description": "The protests were inspired by the idea that 3.5% of a population must rise up to successfully reject authoritarianism.",
    "link": "https://truthout.org/articles/5-million-people-attended-no-kings-protests-how-can-we-build-on-this/",
    "timestamp": "2025-06-16T21:04:54Z"
  },
  {
    "title": "Netanyahu refuses to rule out Khamenei assassination",
    "description": "Killing the Iranian supreme leader would end the conflict, the Israeli prime minister has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619478-netanyahu-israel-khamenei-assassination/",
    "timestamp": "2025-06-16T21:04:42Z"
  },
  {
    "title": "DACA Turns 13 In Uncertain Times, As Obama Voices Support",
    "description": "Former President Barack Obama voiced his support for the DACA program again as it turned 13 on Sunday. Other Democratic lawmakers and immigration advocates also shared their support on social media.",
    "link": "https://hiphopwired.com/playlist/daca-turns-13-in-uncertain-times-as-obama-voices-support/",
    "timestamp": "2025-06-16T21:03:43Z"
  },
  {
    "title": "Trump Seeks to Reward Loyalty of Federal Workforce",
    "description": "“President Donald Trump is accelerating efforts to transform the nonpartisan, merit-based federal workforce into one that demands and rewards loyalty to the president,” the Washington Post reports. “The ongoing shift would ditch decades-old rules that",
    "link": "https://politicalwire.com/2025/06/16/trump-seeks-to-reward-loyalty-of-federal-workforce/",
    "timestamp": "2025-06-16T21:03:00Z"
  },
  {
    "title": "G7 leaders scramble for stance on Israel-Iran conflict",
    "description": "World leaders at the G7 summit in Alberta, Canada are preparing a combined statement on the war between Israel and Iran, and Anthony Albanese's big moment with Donald Trump is almost here.\nThe post G7 leaders scramble for stance on Israel-Iran conflict appear…",
    "link": "http://www.crikey.com.au/2025/06/17/g7-summit-israel-iran-war-anthony-albanese-donald-trump/",
    "timestamp": "2025-06-16T21:02:27Z"
  },
  {
    "title": "Bitcoin Gold Rush 2.0? Treasuries Swell With 60 New Players",
    "description": "Companies around the globe made 60 Bitcoin announcements in five days, signaling a surge in corporate interest. Between June 9 and 13, companies added thousands of BTC to their balance sheets and revealed plans for billions more. This week’s activity shows th…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-gold-rush-2-0-treasuries-swell-with-60-new-players/",
    "timestamp": "2025-06-16T21:00:58Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ Will Literally Kill, Study Warns",
    "description": "Millions of Americans are expected to lose their Medicaid coverage under the current version of the bill, and many will suffer or die as a result, a new analysis shows.",
    "link": "https://gizmodo.com/trumps-big-beautiful-bill-will-literally-kill-study-warns-2000616454",
    "timestamp": "2025-06-16T21:00:44Z"
  },
  {
    "title": "Musk climbs down after messy MAGA breakup",
    "description": "The Tesla CEO apologized after facing backlash for a series of social media posts criticizing Donald Trump",
    "link": "https://theweek.com/politics/musk-trump-messy-maga-breakup",
    "timestamp": "2025-06-16T21:00:43Z"
  },
  {
    "title": "The U.S. Must Force Israel to End Its War on Iran",
    "description": "Israel is the main destabilizing force in the Middle East, and its attacks on Iran are being made possible by U.S. support. We bear special responsibility to work to end the bombing.",
    "link": "https://inthesetimes.com/article/israel-iran-gaza-trump-netanyahu-war",
    "timestamp": "2025-06-16T21:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Donald and Melania Trump's 'Secret Divorce' Revealed — Expert Rocks President By Branding Their Marriage a Sham as First Lady 'F------ Hates His Guts'",
    "description": "One expert on the First Family has revealed there is a reason President Donald Trump's wife Melania has been missing from events.",
    "link": "https://radaronline.com/p/donald-melania-trump-secret-divorce-president-marriage-first-lady/",
    "timestamp": "2025-06-16T21:00:00Z"
  },
  {
    "title": "Trump Organization enters mobile phone business",
    "description": "Trump Organization enters mobile phone business\nDonald Trump's family business is launching a new Trump-branded phone service, in its latest plan to cash in on the US president's name.\nThe Trump Organization, which is run by his sons, said it planned to sell …",
    "link": "https://biztoc.com/x/b42e082ea108cb15",
    "timestamp": "2025-06-16T20:59:37Z"
  },
  {
    "title": "Why Trump Mobile’s $499 smartphone likely won’t be made in the USA — at least not yet",
    "description": "The Trump Mobile T1 Phone has features and specs that would rival Apple's iPhone -- for a fraction of the price.",
    "link": "https://nypost.com/2025/06/16/business/why-trumps-499-smartphone-likely-wont-be-made-in-the-usa-yet/",
    "timestamp": "2025-06-16T20:59:22Z"
  },
  {
    "title": "Gold Phone and Mobile Service Blasted as Latest 'Trump Family Profiteering'",
    "description": "The Trump Organization on Monday announced the creation of a new cellular phone service named after U.S. President Donald Trump and teased the upcoming release of a gold, $499 smartphone—news that elicited swift rebuke from two watchdog groups.\"The limit to T…",
    "link": "https://www.commondreams.org/news/trump-mobile-phone-public-citizen",
    "timestamp": "2025-06-16T20:57:46Z"
  },
  {
    "title": "JPMorgan’s Europe boss set to quit London for NYC — as UK hit with executive departures",
    "description": "Gori, 50, who previously headed the company's Asia region is also the co-head of JPMorgan's global banking unit alongside John Simmons.",
    "link": "https://nypost.com/2025/06/16/business/jpmorgans-europe-boss-set-to-quit-london-for-nyc/",
    "timestamp": "2025-06-16T20:57:24Z"
  },
  {
    "title": "Jack Ciattarelli Within Striking Distance of Mikie Sherrill in N.J.—Poll",
    "description": "The Democratic congresswoman held a narrow lead in the Ciattarelli campaign's latest internal poll of the gubernatorial race.",
    "link": "https://www.newsweek.com/jack-ciattarelli-within-striking-distance-mikie-sherrill-internal-poll-2086356",
    "timestamp": "2025-06-16T20:57:16Z"
  },
  {
    "title": "Hillary Clinton’s Plea To China: \"Since Russia is clearly backing republicans, why don't we ask China to back us?\" \"China, if you're listening, why don't you get Trump's tax returns? I'm sure our media would RICHLY reward you.\"",
    "description": "China puppet suggests asking China to “back” the Democrats. Little slow on the draw there, doll.",
    "link": "https://freerepublic.com/focus/f-news/4323457/posts",
    "timestamp": "2025-06-16T20:57:14Z"
  }
]