[
  {
    "title": "Brazil Sentences Former President Jair Bolsonaro to 27 Years in Prison for Fabricated 'Crimes Against Democracy'",
    "description": "Brazil's Supreme Federal Tribunal (STF) on Thursday convicted conservative former President Jair Bolsonaro and sentenced him to 27 years and 3 months prison for his alleged role in a \"failed coup attempt,\" marking the first time that a former president of Bra…",
    "link": "https://www.breitbart.com/latin-america/2025/09/12/brazil-sentences-former-president-jair-bolsonaro-to-27-years-in-prison-for-fabricated-crimes-against-democracy/",
    "timestamp": "2025-09-12T13:56:17Z"
  },
  {
    "title": "Michael Tracey: Cutting Through the Jeffrey Epstein Fog",
    "description": "Journalist Michael Tracey discusses problems with what he call the \"Epstein mythology\" on the latest episode of Just Asking Questions.",
    "link": "https://reason.com/podcast/2025/09/12/michael-tracey-cutting-through-the-jeffrey-epstein-fog/",
    "timestamp": "2025-09-12T13:55:03Z"
  },
  {
    "title": "A message from Brian Roberts, Mike Cavanagh, and Mark Lazarus to all Comcast NBCUniversal employees on Friday, September 12, 2025",
    "description": "The following letter was sent to all Comcast NBCUniversal employees on Friday, September 12, 2025. Dear Comcast NBCUniversal Team, The tragic loss of Charlie Kirk, a 31-year-old father, husband, and advocate for open debate, whose faith was important to him, …",
    "link": "https://freerepublic.com/focus/f-news/4339976/posts",
    "timestamp": "2025-09-12T13:54:36Z"
  },
  {
    "title": "Live updates: Suspect in custody for Charlie Kirk shooting",
    "description": "The suspect in custody in connection with the assassination of Charlie Kirk is a 22-year-old from Utah, a law enforcement official told The Associated Press. Authorities have identified the suspect as Tyler Robinson, said the official, who spoke on the condit…",
    "link": "https://www.pbs.org/newshour/politics/live-updates-suspect-in-custody-for-charlie-kirk-shooting",
    "timestamp": "2025-09-12T13:54:00Z"
  },
  {
    "title": "US joins UN Security Council condemnation of Israeli strikes on Qatar",
    "description": "The US traditionally blocks actions against its close ally Israel at the United Nations.",
    "link": "https://www.bbc.com/news/articles/c740kk7vxkdo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-12T13:52:41Z"
  },
  {
    "title": "Watch: Officials give update after arresting suspected Charlie Kirk shooter",
    "description": "Officials have promised an update on the arrest of a man they say killed conservative commentator Charlie Kirk.Donald Trump announced on Friday that authorities had detained a man from Utah named Tyler Robinson in connection with the attack.Trump also said so…",
    "link": "https://www.rawstory.com/watch-kirk-live-update-shooting/",
    "timestamp": "2025-09-12T13:51:49Z"
  },
  {
    "title": "What campus crusader Charlie Kirk meant to Trump",
    "description": "Charlie Kirk's untimely death at 31 has reverberated through conservative circles. As the founder of Turning Point USA, he cultivated a powerful youth movement, blending Christian conservatism, free-market principles, and nationalism. Kirk's efforts significa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-campus-crusader-charlie-kirk-meant-to-trump/articleshow/123853977.cms",
    "timestamp": "2025-09-12T13:50:41Z"
  },
  {
    "title": "Gov. Josh Shapiro Puts Trump On Blast For 'Dangerous' Response To Charlie Kirk's Killing (Marita Vlachou/HuffPost)",
    "description": "Marita Vlachou / HuffPost:\nGov. Josh Shapiro Puts Trump On Blast For ‘Dangerous’ Response To Charlie Kirk's Killing  —  “The president missed the mark,” the Pennsylvania governor said.  —  Pennsylvania Gov. Josh Shapiro (D) on Thursday called out President Do…",
    "link": "https://www.memeorandum.com/250912/p48",
    "timestamp": "2025-09-12T13:50:00Z"
  },
  {
    "title": "Prince William and Kate Middleton Will Play a Major Role in Donald Trump’s Visit to Britain",
    "description": "The itinerary for next week’s trip includes a joint engagement for the Princess of Wales and Melania Trump.",
    "link": "https://www.vanityfair.com/style/story/prince-william-and-kate-middleton-will-play-a-major-role-in-donald-trumps-visit-to-britain",
    "timestamp": "2025-09-12T13:49:54Z"
  },
  {
    "title": "Kavanaugh says no one has too much power in US system. Critics see Supreme Court bowing to Trump",
    "description": "Kavanaugh says the genius of the American system of government is that no one should have too much power.",
    "link": "https://www.bostonherald.com/2025/09/12/kavanaugh-speech-protests-trump-criticism/",
    "timestamp": "2025-09-12T13:49:43Z"
  },
  {
    "title": "Republicans go ‘nuclear’ to help Trump nominees, invite Democratic backlash",
    "description": "Senate Republicans have now triggered the “nuclear option” three times (and counting) in the last eight years. The consequences are likely to matter.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-go-nuclear-help-trump-nominees-invite-democratic-backlash-rcna230778",
    "timestamp": "2025-09-12T13:48:47Z"
  },
  {
    "title": "The AI drug breakthrough is taking a long time to arrive for reasons that may have little to do with the technology’s limits",
    "description": "“No matter how much data you have, human biology is still a mystery,” one analyst said.",
    "link": "https://fortune.com/2025/09/12/the-ai-drug-breakthrough-is-taking-a-long-time-to-arrive-for-reasons-that-may-have-little-to-do-with-the-technologys-limits/",
    "timestamp": "2025-09-12T13:48:31Z"
  },
  {
    "title": "Stephen King Apologizes After Claiming Charlie Kirk “Advocated Stoning Gays To Death”",
    "description": "Stephen King, the renowned American horror author, has apologized after claiming that Charlie Kirk “advocated stoning gays to death.” In the hours after conservative provocateur Kirk was assassinated, The Shining author took issue with Fox News host Jesse Wat…",
    "link": "http://deadline.com/2025/09/stephen-king-apology-charlie-kirk-stoning-gays-1236529789/",
    "timestamp": "2025-09-12T13:48:02Z"
  },
  {
    "title": "Trump Credits ‘Terrible’ Mainstream Media for Charlie Kirk Coverage and Admitting ‘This Can’t Be Allowed To Happen’",
    "description": "President Donald Trump said that even \"terrible\" mainstream media organizations are sensitive to coverage and rhetoric around the killing of Charlie Kirk.\nThe post Trump Credits ‘Terrible’ Mainstream Media for Charlie Kirk Coverage and Admitting ‘This Can’t B…",
    "link": "https://www.mediaite.com/media/tv/trump-credits-terrible-mainstream-media-for-charlie-kirk-coverage-and-admitting-this-cant-be-allowed-to-happen/",
    "timestamp": "2025-09-12T13:47:42Z"
  },
  {
    "title": "Rubio To Offer Israel Support Despite Qatar Strike",
    "description": "US Secretary of State Marco Rubio will leave Saturday on a trip to Israel to offer support before French-led moves to recognize a Palestinian state, the State Department said.",
    "link": "https://www.ibtimes.com/rubio-offer-israel-support-despite-qatar-strike-3783215",
    "timestamp": "2025-09-12T13:45:14Z"
  },
  {
    "title": "Nolte: Everyone Who Celebrates Charlie Kirk’s Assassination Must Be Exposed and Fired",
    "description": "It is long past time to aggressively expose those celebrating Charlie Kirk's assassination, followed by a righteous blacklisting.\nThe post Nolte: Everyone Who Celebrates Charlie Kirk’s Assassination Must Be Exposed and Fired appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/12/nolte-everyone-who-celebrates-charlie-kirks-assassination-must-be-exposed-and-fired/",
    "timestamp": "2025-09-12T13:44:48Z"
  },
  {
    "title": "Trump says his patience with Putin is running out",
    "description": "NEW YORK (Reuters) - U.S. President Donald Trump on Friday said his patience with Russian President Vladimir Putin was running out, but stopped short of threatening new sanctions over the Ukraine war. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/12/trump-says-his-patience-with-putin-is-running-out",
    "timestamp": "2025-09-12T13:43:00Z"
  },
  {
    "title": "Tyler Robinson identified as Charlie Kirk’s alleged killer, who is the 22-year-old Utah man now in custody",
    "description": "Tyler Robinson, a 22-year-old Utah resident, has been named as the prime suspect in the assassination of conservative activist and businessman Charlie Kirk. The announcement followed a nationwide manhunt that had gripped the United States since Kirk was fatal…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tyler-robinson-identified-as-charlie-kirks-alleged-killer-who-is-the-22-year-old-utah-man-now-in-custody/articleshow/123853888.cms",
    "timestamp": "2025-09-12T13:42:29Z"
  },
  {
    "title": "Rubio to offer Israel support despite Qatar strike",
    "description": "US Secretary of State Marco Rubio will leave Saturday on a trip to Israel to offer support before French-led moves to recognize a Palestinian state, the State Department said. Rubio is going ahead with the visit despite President Donald Trump gently reprimand…",
    "link": "https://www.digitaljournal.com/world/rubio-to-offer-israel-support-despite-qatar-strike/article",
    "timestamp": "2025-09-12T13:42:20Z"
  },
  {
    "title": "Trump says Charlie Kirk shooting suspect in custody",
    "description": "US President Donald Trump on Friday announced that the suspect had been taken into custody over the killing of right-wing activist Charlie Kirk after a massive manhunt. Trump said the suspect had been turned in by a person close to him — and added that he hop…",
    "link": "https://www.digitaljournal.com/world/trump-says-charlie-kirk-shooting-suspect-in-custody/article",
    "timestamp": "2025-09-12T13:42:20Z"
  },
  {
    "title": "Texas A&M Fires Professor for Discussing Gender Identity in Class",
    "description": "A professor at Texas A&M University was fired this week for discussing gender identity in a children’s literature course. Two administrators were also stripped of their titles. \nThe actions came after a video of a student confronting a professor over discussi…",
    "link": "https://msmagazine.com/2025/09/12/texas-am-fires-professor-gender/",
    "timestamp": "2025-09-12T13:41:07Z"
  },
  {
    "title": "Trump’s stain on America may be permanent",
    "description": "Panicked by the Epstein \"hoax\" he can't explain away, the president declares war on his own country",
    "link": "https://www.salon.com/2025/09/12/trumps-stain-on-america-may-be-permanent/",
    "timestamp": "2025-09-12T13:40:19Z"
  },
  {
    "title": "Officials plead for help in finding Charlie Kirk's shooter (Associated Press)",
    "description": "Associated Press:\nOfficials plead for help in finding Charlie Kirk's shooter  —  The suspect in the Charlie Kirk assassination has been captured, President Donald Trump said Friday, representing a significant breakthrough in the investigation into a targeted …",
    "link": "https://www.memeorandum.com/250912/p42",
    "timestamp": "2025-09-12T13:40:00Z"
  },
  {
    "title": "Law enforcement has individual in custody in Charlie Kirk shooting",
    "description": "After a manhunt lasting more than 24 hours, authorities have taken an individual into custody in connection with the fatal shooting of Charlie Kirk at a Utah university event on Wednesday.",
    "link": "https://www.msnbc.com/top-stories/latest/charlie-kirk-shooting-tyler-robinson-rcna230622",
    "timestamp": "2025-09-12T13:39:32Z"
  },
  {
    "title": "Stephen King Speaks Out on Charlie Kirk Post Death",
    "description": "Writer Stephen King has spoken about Charlie Kirk following the death of the conservative political activist.",
    "link": "https://www.comingsoon.net/pop-culture/news/2026449-stephen-king-charlie-kirk-gay-men-death",
    "timestamp": "2025-09-12T13:39:15Z"
  },
  {
    "title": "'I don't want to talk about it': Trump warns US to pay trillions if he doesn't get his way",
    "description": "President Donald Trump got tight lipped Friday during an appearance on Fox News when pressed on what his administration would do were the courts to overturn his tariff policy.“Well, I don't want to talk about it,” Trump told Fox and Friends host Lawrence Jone…",
    "link": "https://www.rawstory.com/trump-2673988949/",
    "timestamp": "2025-09-12T13:39:12Z"
  },
  {
    "title": "South Korean workers return home after days in detention following US immigration raid",
    "description": "Their roundup and the U.S. release of video showing some Korean workers shackled with chains around their hands, ankles and waists have caused public outrage and a sense of betrayal in South Korea, a key U.S. ally.",
    "link": "https://www.pbs.org/newshour/world/south-korean-workers-return-home-after-days-in-detention-following-us-immigration-raid",
    "timestamp": "2025-09-12T13:38:20Z"
  },
  {
    "title": "Who is 4chan, who linked Skye Valadez to Charlie Kirk shooter? Here's complete online speculation explained",
    "description": "Who is 4chan, who linked Skye Valadez to Charlie Kirk shooter? Online users speculated about a SoundCloud track, shared images, and debated whether Skye Valadez is connected, though authorities have not confirmed.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-4chan-who-linked-skye-valadez-to-charlie-kirk-shooter-death-utah-valley-university-speculation-online-discussions-musician-soundcloud-song-account-charlie-kirk-dead-at-31/articleshow/123853418.cms",
    "timestamp": "2025-09-12T13:38:19Z"
  },
  {
    "title": "Trump offers detained South Koreans chance to stay in US after major Georgia ICE raid",
    "description": "President Donald Trump has offered the 300 South Koreans rounded up and detained during an Immigrations and Customs Enforcement (ICE) raid in Georgia the opportunity to stay in the U.S. \"Each person was allowed to choose, and the U.S. government said essentia…",
    "link": "https://freerepublic.com/focus/f-chat/4339972/posts",
    "timestamp": "2025-09-12T13:37:17Z"
  },
  {
    "title": "Trump Mocks Democratic NYC Mayoral Candidate Mamdani as ‘My Little Communist’",
    "description": "Trump mocked Zohran Mamdani, revealing he calls the hopeful “my little communist” and cast Mamdani’s unexpected rise as a broader “rebellion” by voters.\nThe post Trump Mocks Democratic NYC Mayoral Candidate Mamdani as ‘My Little Communist’ first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/trump-mocks-democratic-nyc-mayoral-candidate-mamdani-as-my-little-communist/",
    "timestamp": "2025-09-12T13:36:44Z"
  },
  {
    "title": "Kremlin Says Ukraine Peace Talks Frozen As Trump Warns Putin",
    "description": "Moscow said Friday that peace talks with Ukraine were on \"pause\" as US President Donald Trump again warned he was fast running out of patience with his Russian counterpart Vladimir Putin.",
    "link": "https://www.ibtimes.com.au/kremlin-says-ukraine-peace-talks-frozen-trump-warns-putin-1860487",
    "timestamp": "2025-09-12T13:36:18Z"
  },
  {
    "title": "Pa. lawmaker to introduce bill that establishes Charlie Kirk Day as state holiday",
    "description": "Pennsylvania Rep. Russ Diamond announced plans to introduce legislation to establish Charlie Kirk Day as an official state holiday on the first Monday of August each year.",
    "link": "https://www.wgal.com/article/pennsylvania-legislation-introduce-bill-charlie-kirk-day-state-holiday/66065148",
    "timestamp": "2025-09-12T13:35:50Z"
  },
  {
    "title": "Kremlin says Ukraine peace talks frozen as Trump warns Putin",
    "description": "U.S. President Donald Trump said Friday his patience with Russia's Vladimir Putin was running out and hinted at tough sanctions over the war in Ukraine - while suggesting Kiev also needed to compromise.",
    "link": "https://www.hurriyetdailynews.com/trump-says-patience-with-putin-running-out-fast-213532",
    "timestamp": "2025-09-12T13:35:00Z"
  },
  {
    "title": "Complying With Trump Administration’s Attack on DEI Could Get Employers Into Legal Trouble",
    "description": "Since the Trump administration made diversity, equality and inclusion \"immoral\" and \"illegal,\" a large part of workplace discrimination in the country still remains to be experienced by women and members of racial minority groups. Now, these groups have less …",
    "link": "https://msmagazine.com/2025/09/12/trump-dei-employers-law-discrimination-diversity-equity-inclusion/",
    "timestamp": "2025-09-12T13:34:14Z"
  },
  {
    "title": "UK Fires US Ambassador Due To Epstein Ties",
    "description": "The United Kingdom’s ambassador to the United States was fired after it was revealed that he had controversial ties to convicted abuser Jeffrey Epstein.",
    "link": "https://hiphopwired.com/2833507/uk-fires-us-ambasasor-lord-peter-mandelson-epstein-ties/",
    "timestamp": "2025-09-12T13:33:50Z"
  },
  {
    "title": "Tyler Robinson: Charlie Kirk’s murder suspect is in custody, Utah governor confirms",
    "description": "US president Donald Trump has told Fox & Friends that Tyler Robinson, the individual suspected of shooting right-wing pundit Charlie Kirk, is in custody, in advance of an FBI news conference confirming the news. The suspect was subsequently named as 22-year-o…",
    "link": "https://www.thepinknews.com/2025/09/12/charlie-kirk-suspect-custody-trump-claims-tyler-robinson/",
    "timestamp": "2025-09-12T13:33:30Z"
  },
  {
    "title": "Charlie Kirk murder suspect in custody named as 22-year-old Tyler Robinson",
    "description": "A suspect in custody in connection with the death of Charlie Kirk is a 22-year-old from Utah named Tyler Robinson, sources have claimed.",
    "link": "https://www.ladbible.com/news/us-news/charlie-kirk-shooter-suspect-named-identified-latest-468377-20250912",
    "timestamp": "2025-09-12T13:31:32Z"
  },
  {
    "title": "Trump says Charlie Kirk shooting suspect in custody",
    "description": "The gunman fired a single, fatal shot killing Kirk – a 31-year-old who rallied youth support for Trump – during an appearance at a Utah university on Wednesday",
    "link": "https://www.euractiv.com/news/trump-says-charlie-kirk-shooting-suspect-in-custody/",
    "timestamp": "2025-09-12T13:31:06Z"
  },
  {
    "title": "Trump says his patience with Putin is running out",
    "description": "U.S. President Donald Trump on Friday said his patience with Russian President Vladimir Putin was running out, but stopped short of threatening new sanctions...",
    "link": "https://uk.news.yahoo.com/trump-says-patience-putin-running-133050298.html",
    "timestamp": "2025-09-12T13:30:50Z"
  },
  {
    "title": "Trump says he’ll send National Guard to Memphis to address crime concerns",
    "description": "Since sending the National Guard to Los Angeles and Washington, the Republican president has openly mused about sending troops to other cities, claiming they're needed to crack down on crime.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-hell-send-national-guard-to-memphis-to-address-crime-concerns",
    "timestamp": "2025-09-12T13:30:36Z"
  },
  {
    "title": "Trump says 'with a high degree of certainty' that suspect in Charlie Kirk killing has been caught",
    "description": "Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/12/trump-says-039with-a-high-degree-of-certainty039-that-suspect-in-charlie-kirk-killing-has-been-caught",
    "timestamp": "2025-09-12T13:30:00Z"
  },
  {
    "title": "Who is Tyler Robinson? Charlie Kirk Shooting Suspect Identified",
    "description": "Authorities identified Tyler Robinson as the alleged gunman in Wednesday's fatal shooting of conservative influencer Charlie Kirk, according to the Associated Press.",
    "link": "https://www.newsweek.com/tyler-robinson-charlie-kirk-shooting-suspect-utah-2128910",
    "timestamp": "2025-09-12T13:29:45Z"
  },
  {
    "title": "Trump Says Charlie Kirk Murder Suspect in Custody as Name Emerges",
    "description": "This is a developing story... Please check back for possible updates...US President Donald Trump was the first to assert Friday morning that law enforcement officials have apprehended a suspect in the murder of right-wing activist Charlie Kirk.During an appea…",
    "link": "https://www.commondreams.org/news/charlie-kirk-murder-suspect",
    "timestamp": "2025-09-12T13:29:01Z"
  },
  {
    "title": "Brazil’s Bolsonaro gets 27-year prison sentence for ‘attempted coup’",
    "description": "Brazil’s Supreme Court has sentenced former President Jair Bolsonaro to 27 years in prison for plotting a coup.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/12/brazils-bolsonaro-gets-27-year-prison-sentence-for-attempted",
    "timestamp": "2025-09-12T13:27:13Z"
  },
  {
    "title": "Trump Claims Person Who Shot Charlie Kirk Has Been Arrested",
    "description": "President Donald Trump announced Friday that the suspected killer of conservative activist Charlie Kirk has been apprehended.“I think, with a high degree of certainty, we have him in custody,” Trump said on Fox and Friends.“Essentially, somebody that was very…",
    "link": "https://newrepublic.com/post/200372/trump-fox-shooter-charlie-kirk-arrested",
    "timestamp": "2025-09-12T13:26:30Z"
  },
  {
    "title": "Trump says he'll send the National Guard to Memphis",
    "description": "President Donald Trump says he'll send the National Guard to Memphis to address crime concerns there with the support of the mayor and the governor.",
    "link": "https://www.ketv.com/article/donald-trump-national-guard-memphis/66065226",
    "timestamp": "2025-09-12T13:26:21Z"
  },
  {
    "title": "INTERVIEW: Trump’s energy secretary sees ‘long-term’ EU dependence on US",
    "description": "US Energy Secretary Chris Wright tells Euractiv that $750 billion of EU purchases of American energy is just the start",
    "link": "https://www.euractiv.com/news/interview-trumps-energy-secretary-sees-long-term-eu-dependence-on-us/",
    "timestamp": "2025-09-12T13:26:13Z"
  },
  {
    "title": "Kash Patel Is Screwing Up Kirk Investigation, Per Trump’s Ex-FBI Head",
    "description": "Former FBI Director Andrew McCabe is perplexed by current FBI Director Kash Patel’s decision to head to Utah himself to search for Charlie Kirk’s assassin.“That one’s really hard to figure out. There are many good reasons why you wouldn’t go if you’re the dir…",
    "link": "https://newrepublic.com/post/200375/kash-patel-charlie-kirk-investigation-fbi-head-mccabe",
    "timestamp": "2025-09-12T13:25:40Z"
  },
  {
    "title": "Trump says patience with Putin 'running out fast'",
    "description": "US President Donald Trump expressed dwindling patience with Russia's Vladimir Putin regarding the Ukraine conflict. Hinting at potential tough sanctions, Trump emphasized the need for both Russia and Ukraine to compromise for resolution. He noted the shifting…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-patience-with-putin-running-out-fast/articleshow/123853646.cms",
    "timestamp": "2025-09-12T13:25:16Z"
  },
  {
    "title": "BREAKING: Charlie Kirk Murder Suspect Identified",
    "description": "The suspect in the murder of Turning Point USA founder Charlie Kirk was identified by Orem Police on Wednesday evening as Tyler Robinson.\nThe post BREAKING: Charlie Kirk Murder Suspect Identified first appeared on Mediaite.",
    "link": "https://www.mediaite.com/crime/breaking-charlie-kirk-murder-suspect-identified/",
    "timestamp": "2025-09-12T13:24:46Z"
  },
  {
    "title": "USA Urges G7 Sanctions on Russian Oil",
    "description": "The U.S. will urge its allies in the Group of Seven to impose tariffs as high as 100 percent on China and India for their purchases of Russian oil.",
    "link": "https://www.rigzone.com/news/wire/usa_urges_g7_sanctions_on_russian_oil-12-sep-2025-181784-article/",
    "timestamp": "2025-09-12T13:24:42Z"
  },
  {
    "title": "South Korean workers return home after days of detention in Georgia following immigration raid",
    "description": "A plane carrying more than 300 South Korean workers released after days of detention in Georgia has landed in South Korea.",
    "link": "https://www.bostonherald.com/2025/09/12/hyundai-workers-return-to-south-korea/",
    "timestamp": "2025-09-12T13:24:01Z"
  },
  {
    "title": "Trump says 'with a high degree of certainty' that suspect in Charlie Kirk killing has been caught",
    "description": "The suspect in custody in connection with Kirk's killing is Tyler Robinson, a 22-year-old from Utah, a law enforcement official told The Associated Press.",
    "link": "https://richmond.com/news/nation-world/article_257cde33-f7b4-57a0-bae9-509abb2ac390.html",
    "timestamp": "2025-09-12T13:22:00Z"
  },
  {
    "title": "Trump says ‘with a high degree of certainty’ that suspect in Charlie Kirk killing has been caught",
    "description": "The FBI and the Justice Department did not immediately comment, but a news conference in Utah, where the killing took place on a college campus this week, was planned for later Friday.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-with-a-high-degree-of-certainty-that-suspect-in-charlie-kirk-killing-has-been-caught",
    "timestamp": "2025-09-12T13:21:38Z"
  },
  {
    "title": "Two More Staffers Fired from Kennedy Center, and More: Morning Links for September 12, 2025",
    "description": "The Kennedy Center has fired the head of its jazz programming, as well as the last member of its social impact team.",
    "link": "https://www.artnews.com/art-news/news/staffers-fired-from-kennedy-center-morning-links-september-12-2025-1234751701/",
    "timestamp": "2025-09-12T13:20:08Z"
  },
  {
    "title": "UAE summons Israel envoy over ‘cowardly’ Qatar attack",
    "description": "Friday's rare summoning was the strongest in a chorus of condemnations as anger boils in the Gulf over Israel's strike on a region long shielded from Middle Eastern conflicts",
    "link": "https://www.euractiv.com/news/uae-summons-israel-envoy-over-cowardly-qatar-attack/",
    "timestamp": "2025-09-12T13:18:51Z"
  },
  {
    "title": "Suspect in the Killing of Charlie Kirk is in custody - according to some guy who called into Fox News [Live]",
    "description": "Suspect in the Killing of Charlie Kirk is in custody - according to some guy who called into Fox News",
    "link": "https://www.fark.com/comments/13809200/Suspect-in-Killing-of-Charlie-Kirk-is-in-custody-according-to-some-guy-who-called-into-Fox-News",
    "timestamp": "2025-09-12T13:18:24Z"
  },
  {
    "title": "Iran Offers Qatar Missile Protection If It Expels US Forces",
    "description": "An Iranian lawmaker's call for Qatar to kick out U.S. forces underscores rising tensions after Israel's strike in Doha on Tuesday.",
    "link": "https://www.newsweek.com/iran-lawmaker-qatar-expel-us-host-irgc-missiles-2128817",
    "timestamp": "2025-09-12T13:17:46Z"
  },
  {
    "title": "Charlie Kirk’s Alleged Assassin Revealed",
    "description": "'Rhetoric is directly responsible'",
    "link": "https://dailycaller.com/2025/09/12/charlie-kirks-alleged-assassin-revealed/",
    "timestamp": "2025-09-12T13:17:41Z"
  },
  {
    "title": "Trump Says Losing Patience With Putin, Eying Bank, Oil Sanctions",
    "description": "US President Donald Trump said that his patience with Russian President Vladimir Putin was “running out fast” and threatened Moscow with new economic sanctions as efforts to broker ceasefire talks with Ukraine have faltered.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-losing-patience-with-putin-eying-bank-oil-sanctions",
    "timestamp": "2025-09-12T13:17:15Z"
  },
  {
    "title": "LIVE STREAM VIDEO: FBI Director Kash Patel to Hold Press Conference on Arrest of Charlie Kirk Shooting Suspect – Moved to 9:30 AM",
    "description": "FBI Director Kash Patel and local Utah authorities hold a press conference on the investigation into the shooting death of conservative activist Charlie Kirk.\nThe post LIVE STREAM VIDEO: FBI Director Kash Patel to Hold Press Conference on Arrest of Charlie Ki…",
    "link": "https://www.thegatewaypundit.com/2025/09/live-stream-video-fbi-director-kash-patel-hold/",
    "timestamp": "2025-09-12T13:17:06Z"
  },
  {
    "title": "'Like a military operation': Koreans describe anxiety after US immigration raid",
    "description": "INCHEON, South Korea (Reuters) -South Korean workers who returned home on Friday after being detained for a week by U.S. immigration authorities described their horror over the raid at their workplace in the state of Georgia and their relief at being reunited…",
    "link": "https://www.thestar.com.my/news/world/2025/09/12/039like-a-military-operation039-koreans-describe-anxiety-after-us-immigration-raid",
    "timestamp": "2025-09-12T13:17:00Z"
  },
  {
    "title": "Ilhan Omar Claims Without Evidence Republicans Want Kamala Harris Dead",
    "description": "Democratic Rep. Ilhan Omar of Minnesota accused Republicans of trying to get former Vice President Kamala Harris killed during a Thursday interview.",
    "link": "https://dailycaller.com/2025/09/12/ilhan-omar-claims-without-evidence-republicans-want-kamala-harris-dead/",
    "timestamp": "2025-09-12T13:16:52Z"
  },
  {
    "title": "Trump announces plan to deploy forces to Memphis, claims it’s ‘deeply troubled’",
    "description": "Donald Trump would've \"preferred\" sending federal forces to Chicago, but after facing resistance, he's settled on Memphis, instead.",
    "link": "https://biztoc.com/x/a57b4f3ec7ef3476",
    "timestamp": "2025-09-12T13:16:29Z"
  },
  {
    "title": "Swatch takes a swipe at Trump’s 39% tariff with switched-up watch",
    "description": "President Donald Trump announced shock 39% levies on Switzerland on Aug. 1. Swatch has hit back.",
    "link": "https://biztoc.com/x/89ebe6f54ff3bda3",
    "timestamp": "2025-09-12T13:16:13Z"
  },
  {
    "title": "Suspect in Charlie Kirk's killing identified: Sources",
    "description": "The person accused of fatally shooting conservative activist Charlie Kirk is 22-year-old Utah resident Tyler Robinson, according to five law enforcement officials briefed on the matter",
    "link": "https://www.nbcnews.com/news/us-news/suspect-charlie-kirk-shooting-tyler-robinson-rcna230504",
    "timestamp": "2025-09-12T13:15:59Z"
  },
  {
    "title": "Poland says Russian drone attack was 'no mistake' after Trump comments",
    "description": "WARSAW (Reuters) -Polish Prime Minister Donald Tusk said on Friday that this week's drone incursions into his country's airspace were not a mistake by Russia, despite U.S. President Donald Trump's suggestion that the incident could have been accidental. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/09/12/poland-says-russian-drone-attack-was-039no-mistake039-after-trump-comments",
    "timestamp": "2025-09-12T13:15:00Z"
  },
  {
    "title": "Arrest Made of Man Suspected of Assassinating Charlie Kirk, Trump Says",
    "description": "President Donald Trump confirmed that police have arrested the suspected assassin of conservative leader Charlie Kirk. “I think with a high-degree of certainty, we have... Read More\nThe post Arrest Made of Man Suspected of Assassinating Charlie Kirk, Trump Sa…",
    "link": "https://www.dailysignal.com/2025/09/12/arrest-made-of-man-suspected-of-assassinating-charlie-kirk-in-utah-trump-says/",
    "timestamp": "2025-09-12T13:14:44Z"
  },
  {
    "title": "Friday, September 12, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/friday-september-12-2025/",
    "timestamp": "2025-09-12T13:12:35Z"
  },
  {
    "title": "Charlie Kirk Shooting: Suspect In Custody, Trump Says (Live Updates)",
    "description": "The president said the arrest was made after authorities received a tip off from a minister who recognized the suspect from his photos.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/09/12/charlie-kirk-shooting-suspect-in-custody-trump-says-live-updates/",
    "timestamp": "2025-09-12T13:12:13Z"
  },
  {
    "title": "Ice cream player Vadilal Industries US unit to boost local production, cut imports from India",
    "description": "Vadilal Industries' U.S. subsidiary will begin manufacturing ice cream locally by year-end to mitigate the impact of tariffs imposed on Indian goods and reduce reliance on imports. The move aims to boost sales and protect market share amidst rising costs. The…",
    "link": "https://economictimes.indiatimes.com/news/international/business/ice-cream-player-vadilal-industries-us-unit-to-boost-local-production-cut-imports-from-india/articleshow/123853462.cms",
    "timestamp": "2025-09-12T13:11:29Z"
  },
  {
    "title": "Beaver Creek: ‘Paper gold is over’ as BRICS build dollar-free payments",
    "description": "Beaver Crrek, Colo. – Canadian dealmaker Frank Giustra says the age of paper gold is ending as BRICS nations stand up a parallel financial system that routes around the U.S. dollar and prizes deliverable metal. “We’re now, believe it or not, in the era of har…",
    "link": "https://freerepublic.com/focus/f-news/4339965/posts",
    "timestamp": "2025-09-12T13:10:13Z"
  },
  {
    "title": "Trump says he'll send the National Guard to Memphis to address crime concerns (Associated Press)",
    "description": "Associated Press:\nTrump says he'll send the National Guard to Memphis to address crime concerns  —  President Donald Trump said Friday he'll send the National Guard to Memphis to address crime concerns there with the support of the mayor and the governor.  Tr…",
    "link": "https://www.memeorandum.com/250912/p38",
    "timestamp": "2025-09-12T13:10:00Z"
  },
  {
    "title": "Chris Cuomo Attacks Musk, Says He Wouldn’t Be ‘Surprised’ If He Were ‘Murdered’ After Kirk Assassination",
    "description": "NewsNation host Chris Cuomo on \"The Chris Cuomo Project\" Thursday condemned X CEO Elon Musk for his comments following the assassination of Charlie Kirk.",
    "link": "https://dailycaller.com/2025/09/12/chris-cuomo-attacks-elon-musk-after-charlie-kirk-assassination/",
    "timestamp": "2025-09-12T13:09:21Z"
  },
  {
    "title": "Is THIS The Charlie Kirk Shooter, This Time?",
    "description": "Third time's the charm?",
    "link": "https://www.wonkette.com/p/is-this-the-charlie-kirk-shooter",
    "timestamp": "2025-09-12T13:08:20Z"
  },
  {
    "title": "Swatch takes a swipe at Trump’s 39% tariff with switched-up watch",
    "description": "President Donald Trump announced shock 39% levies on Switzerland on Aug. 1. Swatch has hit back.",
    "link": "https://www.cnbc.com/2025/09/12/swatch-takes-a-swipe-at-trumps-39percent-tariff-with-switched-up-watch.html",
    "timestamp": "2025-09-12T13:07:50Z"
  },
  {
    "title": "Trump Says He’ll Send The National Guard To Memphis",
    "description": "He said the city is “deeply troubled” and “we’re going to fix that just like we did Washington,” where he’s sent National Guard and surged federal law enforcement.",
    "link": "https://www.huffpost.com/entry/trump-says-send-national-guard-memphis_n_68c41a47e4b072943c567c9d",
    "timestamp": "2025-09-12T13:07:27Z"
  },
  {
    "title": "FOX NEWS CHANNEL TO PRESENT SPECIAL TRIBUTE PROGRAM “CHARLIE KIRK: AN AMERICAN ORIGINAL” HOSTED BY JESSE WATTERS",
    "description": "Tribute to Air on Saturday, September 13th at 7 PM/ET    NEW YORK – September 12, 2025 — FOX News Channel (FNC) will present a primetime special entitled Charlie Kirk: An American Original hosted by FOX News Channel’s Jesse Watters on Saturday, September 13th…",
    "link": "https://press.foxnews.com/2025/09/fox-news-channel-to-present-special-tribute-program-charlie-kirk-an-american-original-hosted-by-jesse-watters",
    "timestamp": "2025-09-12T13:06:55Z"
  },
  {
    "title": "Charlie Kirk Suspect Finally ID’d After His Father Turned Him In, Trump Reveals",
    "description": "A suspect is in custody for the shooting of Charlie Kirk.",
    "link": "https://www.boredpanda.com/suspect-in-custody-charlie-kirk-shooting/",
    "timestamp": "2025-09-12T13:06:02Z"
  },
  {
    "title": "Trump says National Guard will deploy to Memphis next, sidestepping Chicago",
    "description": "President Donald Trump said Friday that he will send the National Guard to Memphis, Tennessee one month after he federalized law enforcement in Washington, D.C. and deployed soldiers across the city in an effort to address crime.\n\"We're going to Memphis,\" Tru…",
    "link": "https://biztoc.com/x/8fa3e63354a588b3",
    "timestamp": "2025-09-12T13:05:17Z"
  },
  {
    "title": "Democrats are on the verge of a dangerous mistake (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nDemocrats are on the verge of a dangerous mistake  —  Mere hours after the killing of Charlie Kirk, President Donald Trump blamed the “radical left” and signaled a crackdown was coming — despite the killer's identity and motives remaining…",
    "link": "https://www.memeorandum.com/250912/p35",
    "timestamp": "2025-09-12T13:05:00Z"
  },
  {
    "title": "Matthew Dowd’s MSNBC Ouster Over Charlie Kirk Comments Speaks Volumes About When to Shut Up",
    "description": "The pressure in cable news is to have an instant opinion. The MSNBC contributor illustrated why it's OK – even prudent – to say you don't\nThe post Matthew Dowd’s MSNBC Ouster Over Charlie Kirk Comments Speaks Volumes About When to Shut Up appeared first on Th…",
    "link": "https://www.thewrap.com/matthew-dowd-charlie-kirk-comments-msnbc-firing-analysis/",
    "timestamp": "2025-09-12T13:05:00Z"
  },
  {
    "title": "Trump says he's sending the National Guard into Memphis to 'fix' crime like D.C.",
    "description": "President Donald Trump said Friday that he's planning to send federal law enforcement and the National Guard into Memphis, Tennessee, to lower crime in the city following his surge into Washington, D.C. over the last month.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-says-sending-national-guard-memphis-fix-crime-dc-rcna230784",
    "timestamp": "2025-09-12T13:04:39Z"
  },
  {
    "title": "Secret Service Agent Says Charlie Kirk Deserved His Fate, Couldn’t ‘Circumvent Karma’",
    "description": "A current Secret Service agent believes that Charlie Kirk deserved the assassin’s bullet that took his life. Anthony Pough, in a Facebook post shared by Susan Crabtree of Real Clear Politics identifying Pough as a Secret Service Agent, said karma is to blame …",
    "link": "https://freerepublic.com/focus/f-chat/4339964/posts",
    "timestamp": "2025-09-12T13:04:03Z"
  },
  {
    "title": "Trump: 'We've got 67 hostages back without paying any money'",
    "description": "President Donald Trump said 67 hostages were freed without ransom, contrasting his approach with Biden’s, 'Biden would pay $6 billion for 5 hostages ... I told Hamas, 'We want our hostages back,''",
    "link": "https://www.israelnationalnews.com/news/414836",
    "timestamp": "2025-09-12T13:03:17Z"
  },
  {
    "title": "US to deploy National Guard to Memphis, Trump says",
    "description": "NEW YORK (Reuters) -U.S. President Donald Trump said on Friday he would send National Guard troops to Memphis, Tennessee to combat crime, following his administration's unprecedented police takeover in Washington last month. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/12/us-to-deploy-national-guard-to-memphis-trump-says",
    "timestamp": "2025-09-12T13:03:00Z"
  },
  {
    "title": "Peter Mandelson was always a high risk appointment – his departure will not end the matter for Keir Starmer",
    "description": "Mandelson took the UK’s most important diplomatic post knowing he was sitting on a ticking bomb – and Starmer will pay the price.",
    "link": "https://theconversation.com/peter-mandelson-was-always-a-high-risk-appointment-his-departure-will-not-end-the-matter-for-keir-starmer-265159",
    "timestamp": "2025-09-12T13:02:46Z"
  },
  {
    "title": "G-7 finance chiefs to talk China, India tariffs over Russia oil",
    "description": "G7 finance ministers will discuss possible sanctions on India and China. The discussion is regarding their purchase of Russian oil. They will also talk about using immobilized Russian assets. Donald Trump suggested new tariffs on India and China. This is to p…",
    "link": "https://economictimes.indiatimes.com/news/india/g-7-finance-chiefs-to-talk-china-india-tariffs-over-russia-oil/articleshow/123853121.cms",
    "timestamp": "2025-09-12T13:01:36Z"
  },
  {
    "title": "Trump Says Suspect in Charlie Kirk's Killing Is In Custody (Hadriana Lowenkron/Bloomberg)",
    "description": "Hadriana Lowenkron / Bloomberg:\nTrump Says Suspect in Charlie Kirk's Killing Is In Custody  —  President Donald Trump said a suspect in the killing of conservative activist Charlie Kirk was in custody on Friday after an extensive manhunt for the shooter.  —  …",
    "link": "https://www.memeorandum.com/250912/p32",
    "timestamp": "2025-09-12T13:01:14Z"
  },
  {
    "title": "Youth leaders mourn 'the Godfather of campus conservatism' Charlie Kirk following assassination",
    "description": "Charlie Kirk's shocking assassination at the Utah Valley University campus has devastated many youth political activists, with some calling him the \"Godfather of campus conservatism.\"",
    "link": "https://www.foxnews.com/media/youth-leaders-mourn-the-godfather-campus-conservatism-charlie-kirk-following-assassination",
    "timestamp": "2025-09-12T13:00:46Z"
  },
  {
    "title": "Trump announces plan to deploy forces to Memphis, claims it’s ‘deeply troubled’",
    "description": "Donald Trump would've \"preferred\" sending federal forces to Chicago, but after facing resistance, he's settled on Memphis, instead.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-announces-plan-deploy-forces-memphis-claims-s-deeply-troubled-rcna230787",
    "timestamp": "2025-09-12T13:00:40Z"
  },
  {
    "title": "The $10 Million Bitcoin Roadmap: Eric Yakes Explains The Path",
    "description": "On the latest episode of What Bitcoin Did, Eric Yakes, co-founder of Epoch, a Bitcoin Venture Capital firm, laid out a sweeping—if controversial—thesis for how Bitcoin could reach $10 million per coin, arguing the asset is powered by a unique mass movement, a…",
    "link": "https://bitcoinist.com/10-million-bitcoin-roadmap-eric-yakes/",
    "timestamp": "2025-09-12T13:00:29Z"
  },
  {
    "title": "Trump reveals Charlie Kirk shooting suspect is in custody",
    "description": "Donald Trump has revealed that the person who allegedly assassinated Charlie Kirk during an event at Utah Valley University is now in custody. 'I think with a high degree of certainty we have him in custody,' the president told Fox & Friends on Friday morning…",
    "link": "https://freerepublic.com/focus/f-news/4339962/posts",
    "timestamp": "2025-09-12T13:00:07Z"
  },
  {
    "title": "Forensic Expert Explains How 3D Laser Scanning Could Reconstruct the Charlie Kirk Shooting",
    "description": "Forensic scientist Michael Haag explains how laser scanners could be used to lock down the crime scenes where Charlie Kirk was fatally shot, letting investigators revisit angles, trajectories and vantage points long after the fact.",
    "link": "https://www.scientificamerican.com/article/forensic-expert-explains-how-3d-laser-scanning-could-reconstruct-the-charlie/",
    "timestamp": "2025-09-12T13:00:00Z"
  },
  {
    "title": "Fake video shows Trump and Epstein with young girls at party",
    "description": "Social media users shared an AI-generated video that animated an authentic image and added minors who were not present.",
    "link": "https://www.snopes.com//fact-check/video-trump-epstein-young-girls/",
    "timestamp": "2025-09-12T13:00:00Z"
  },
  {
    "title": "Biden's Library Proving to Be a Tough Sell",
    "description": "When former President Biden's team announced last week that fundraising would begin for his future presidential library, the Washington Post noted it would be a \"monumental task\" to drum up money from \"beleaguered Democrats.\" On Friday, NBC News is out with a…",
    "link": "https://www.newser.com/story/375109/bidens-library-is-a-tough-sell-for-major-donors.html",
    "timestamp": "2025-09-12T12:59:33Z"
  },
  {
    "title": "How the US will break China’s rare earth dominance—and how to play it",
    "description": "China controls about 85% of global processing capacity. The Department of Defense has a plan to rectify that.",
    "link": "https://www.livemint.com/industry/how-the-us-will-break-china-s-rare-earth-dominance-and-how-to-play-it-11757681524699.html",
    "timestamp": "2025-09-12T12:59:22Z"
  },
  {
    "title": "Fox’s Brian Kilmeade Says FBI ‘in Disarray’ While Investigating Charlie Kirk Killing",
    "description": "Fox & Friends co-host Brian Kilmeade declared the FBI may be \"in disarray\" as the agency remains engaged in a manhunt for the assassin who fatally shot Charlie Kirk in Utah.\nThe post Fox’s Brian Kilmeade Says FBI ‘in Disarray’ While Investigating Charlie Kirk…",
    "link": "https://www.mediaite.com/media/news/foxs-brian-kilmeade-says-fbi-in-disarray-while-investigating-charlie-kirk-killing/",
    "timestamp": "2025-09-12T12:58:50Z"
  }
]