[
  {
    "title": "Opinion: Is Donald Trump Interested In Pakistan?",
    "description": "Unless the situation in Pakistan poses a threat to American interests, US-Pakistan intelligence-sharing and counter-terrorism efforts will be relegated to the back burner.",
    "link": "https://www.ndtv.com/opinion/is-donald-trump-interested-in-pakistan-7655153",
    "timestamp": "2025-02-07T07:45:41Z"
  },
  {
    "title": "Grapevine February 7, 2025: Trumpeting a Middle East utopia",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-841041",
    "timestamp": "2025-02-07T07:43:56Z"
  },
  {
    "title": "Asian shares mixed as DeepSeek lifts Chinese tech stocks",
    "description": "Asian shares Friday were mixed, with Chinese technology stocks rising as most other Asian equities declined. Japan’s benchmark Nikkei 225 dipped nearly 0.72% in afternoon trading to 38,787.02. Australia’s S&amp;P/ASX 200 slid just 0.11% to 8,511.40. South Kor…",
    "link": "https://japantoday.com/category/business/stock-market-today-asian-shares-mixed-as-deepseek-lifts-chinese-tech-stocks",
    "timestamp": "2025-02-07T07:43:06Z"
  },
  {
    "title": "Hungary's Orban says U.S. funding to NGOs and media must be revealed",
    "description": "BUDAPEST (Reuters) - Hungary will take steps to ensure that all aid funding coming from the United States to NGOs and media critical of the government would be revealed, Prime Minister Viktor Orban told state radio on Friday, referring to the USAID programmes…",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/hungary039s-orban-says-us-funding-to-ngos-and-media-must-be-revealed",
    "timestamp": "2025-02-07T07:40:00Z"
  },
  {
    "title": "Trump Fires FEC Chair Ellen Weintraub; She Calls It Illegal",
    "description": "Appointed by President George W. Bush in 2002, Weintraub has served on the FEC for over two decades.",
    "link": "https://www.ibtimes.com/trump-fires-fec-chair-ellen-weintraub-she-calls-it-illegal-3762735",
    "timestamp": "2025-02-07T07:39:05Z"
  },
  {
    "title": "Trump must keep arming Ukraine if he wants a good peace deal",
    "description": "Europe must do its fair share, but it cannot carry the burden alone.",
    "link": "https://www.defenseone.com/ideas/2025/02/trump-must-keep-arming-ukraine-if-he-wants-good-peace-deal/402827/",
    "timestamp": "2025-02-07T07:37:19Z"
  },
  {
    "title": "On eve of summit with Japan PM, Trump reportedly meets U.S. Steel CEO",
    "description": "U.S. President Donald Trump reportedly met with United States Steel Corp CEO David Burritt at the White House on Thursday, the eve of his first summit with Japanese Prime Minister Shigeru Ishiba. Trump's predecessor Joe Biden blocked Nippon Steel Corp's plann…",
    "link": "https://japantoday.com/category/politics/on-eve-of-summit-with-japan-pm-trump-reportedly-meets-u.s.-steel-ceo",
    "timestamp": "2025-02-07T07:34:53Z"
  },
  {
    "title": "The USAID shutdown could make China more powerful. Beijing is already pouring billions into countries around the world.",
    "description": "The end of USAID could mean more space for China to expand globally. BI analyzed where China invests the most and how it compares to US aid.",
    "link": "https://www.businessinsider.com/usaid-shutdown-china-trump-musk-investment-belt-and-road-initiative-2025-2",
    "timestamp": "2025-02-07T07:33:49Z"
  },
  {
    "title": "‘Free Puff’: Kanye West urges Trump to free ‘my brother’ Diddy from jail - Hindustan Times",
    "description": "‘Free Puff’: Kanye West urges Trump to free ‘my brother’ Diddy from jailHindustan Times Kanye West unfollows Taylor Swift, follows Diddy instead, asks Donald Trump to 'free my brother'The Times of India Kanye West Defends Sean ‘Diddy’ Combs, Pleads With Trump…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176148711",
    "timestamp": "2025-02-07T07:32:18Z"
  },
  {
    "title": "What Canada Defence Minister Said On Trump's Plan To Develop \"Iron Dome\"",
    "description": "Donald Trump has signed an order to start planning for an &quot;Iron Dome&quot; air defense system for the US, like the one that Israel uses to intercept rockets.",
    "link": "https://www.ndtv.com/world-news/what-canada-minister-bill-blair-said-on-trumps-plan-to-develop-iron-dome-missile-shield-7655017",
    "timestamp": "2025-02-07T07:30:27Z"
  },
  {
    "title": "CNBC Daily Open: Global central banks are lowering rates — the Fed might not be as inclined",
    "description": "Many economies seem to be settling into a lower-rate environment. That’s in stark contrast with the Federal Reserve, which has to deal with volatile policies.",
    "link": "https://www.cnbc.com/2025/02/07/cnbc-daily-open-central-banks-are-lowering-rates-fed-may-not-do-so.html",
    "timestamp": "2025-02-07T07:30:02Z"
  },
  {
    "title": "Australian politician changes his name to 'Aussie Trump'",
    "description": "An Australian politician has legally changed his name to Austin Trump in a move inspired by Donald Trump - in what he said was a protest against the country's ruling centre-left Labor Party.",
    "link": "https://news.sky.com/story/australian-politician-changes-his-name-to-aussie-trump-13304500",
    "timestamp": "2025-02-07T07:23:00Z"
  },
  {
    "title": "OpenAI Eyes 16 States For Massive Data Centers Tied To Trump's Stargate AI Project",
    "description": "OpenAI plans to build more data centers in states like Arizona, California, Florida, Louisiana, Maryland, Nevada, New York, Ohio, Oregon, Pennsylvania, Utah, Texas, Virginia, Washington, Wisconsin, and West Virginia.",
    "link": "https://www.ibtimes.com/openai-eyes-16-states-massive-data-centers-tied-trumps-stargate-ai-project-3762732",
    "timestamp": "2025-02-07T07:20:04Z"
  },
  {
    "title": "Anwar, Erdogan to discuss Gaza recovery plans next week",
    "description": "IPOH: The recovery and reconstruction of Gaza is one of the main issues expected to be discussed between Prime Minister Datuk Seri Anwar Ibrahim and Turkish President Recep Tayyip Erdogan, who will be visiting Malaysia next week. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/07/anwar-erdogan-to-discuss-gaza-recovery-plans-next-week",
    "timestamp": "2025-02-07T07:16:00Z"
  },
  {
    "title": "Relief For Indians In US! Court Blocks Trump's Citizenship Order Indefinitely",
    "description": "In a big relief for Indian students and professionals living in the United States on visas and awaiting green cards, a federal judge in Seattle has indefinitely blocked President Donald Trump&#039;s executive order that seeks to end birthright citizenship",
    "link": "https://www.ndtv.com/world-news/relief-for-indians-in-us-court-blocks-donald-trumps-citizenship-order-indefinitely-7654901",
    "timestamp": "2025-02-07T07:15:29Z"
  },
  {
    "title": "OpenAI looks across US for sites to build its Donald Trump-backed Stargate AI data centres",
    "description": "The creators of ChatGPT issued a request for proposals for land, electricity, engineers, and architects, and started touring potential sites in Oregon, Pennsylvania, and Wisconsin this week. Shortly after returning to the White House last month, Trump praised…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-looks-across-us-for-sites-to-build-its-trump-backed-stargate-ai-data-centres/articleshow/118005831.cms",
    "timestamp": "2025-02-07T07:13:54Z"
  },
  {
    "title": "Stock market today: Asian shares mixed as DeepSeek lifts Chinese tech stocks",
    "description": "Asian shares Friday were mixed, with Chinese technology stocks rising even as most Asian equities declined.",
    "link": "https://www.clickondetroit.com/business/2025/02/07/stock-market-today-asian-shares-mixed-as-deepseek-lifts-chinese-tech-stocks/",
    "timestamp": "2025-02-07T07:13:36Z"
  },
  {
    "title": "Kremlin confirms Putin and Trump have yet to discuss a possible meeting",
    "description": "MOSCOW (Reuters) - Russian President Vladimir Putin and U.S. President Donald Trump have yet to discuss a possible meeting, CNN quoted Kremlin spokesman Dmitry Peskov as saying. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/kremlin-confirms-putin-and-trump-have-yet-to-discuss-a-possible-meeting",
    "timestamp": "2025-02-07T07:13:00Z"
  },
  {
    "title": "Netanyahu gifts President Trump a golden pager in Washington DC",
    "description": "The Israelis last year used booby-trapped pagers to target Hezbollah, though civilians were also among the victims.",
    "link": "https://www.bbc.co.uk/news/videos/cg7zp1dgmxmo",
    "timestamp": "2025-02-07T07:05:51Z"
  },
  {
    "title": "As the Gaza Agenda Moves Forward, the Imperial Narrative Shifts with It",
    "description": "White House Press Secretary Karoline Leavitt acted shocked and appalled by questions from reporters about Trump’s ethnic cleansing plan for Gaza on Wednesday, saying it was “evil” to suggest that these poor victims of Israel’s destruction should be allowed to…",
    "link": "https://www.globalresearch.ca/gaza-agenda-moves-forward-imperial-narrative-shifts/5879389",
    "timestamp": "2025-02-07T07:00:59Z"
  },
  {
    "title": "Sylvester Stallone putting money into artificial intelligence after 'Godfather' warning",
    "description": "Sylvester Stallone is the latest celebrity to invest money into an AI company, a move that comes after the announcement that he will be a \"special ambassador\" to Hollywood.",
    "link": "https://www.foxnews.com/entertainment/sylvester-stallone-putting-money-artificial-intelligence-after-godfather-warning",
    "timestamp": "2025-02-07T07:00:53Z"
  },
  {
    "title": "Roaming Charges: Who’s the Boss?",
    "description": "We've reached that terminal point of imperial decay when the highest ambition of most members of Congress is to be a sycophant (though few of them could spell or define the word without consulting ChatGTP.) It's rather bracing to watch nearly the entire Congr…",
    "link": "https://www.counterpunch.org/2025/02/07/roaming-charges-whos-the-boss/",
    "timestamp": "2025-02-07T07:00:38Z"
  },
  {
    "title": "Trump sanctions ICC for ‘illegitimate’ Israel, US probes",
    "description": "United States President Donald Trump slapped sanctions on the International Criminal Court Thursday for “illegitimate and baseless” investigations targeting America and its ally Israel, the White House said. Trump signed an executive order saying the court in…",
    "link": "https://punchng.com/trump-sanctions-icc-for-illegitimate-israel-us-probes/",
    "timestamp": "2025-02-07T07:00:17Z"
  },
  {
    "title": "The poverty of extreme wealth",
    "description": "The poverty of extreme wealth\n\n \n Channel\n Comment\n \nbrendan\n7th February 2025\n\n\n \n Teaser Media",
    "link": "https://theecologist.org/2025/feb/07/poverty-extreme-wealth",
    "timestamp": "2025-02-07T07:00:00Z"
  },
  {
    "title": "This Week’s Most Popular Articles",
    "description": "New Peer-reviewed Study Again Confirms Childhood Vaccines Are Likely Responsible for Nearly 80% of the Autism Cases in US Steve Kirsch, January 29, 2025 “They’re burning from the inside out.” Robert Brame on the Unusual Properties of the Pacific Palisades Fir…",
    "link": "https://www.globalresearch.ca/this-weeks-most-popular-articles-166/5879327",
    "timestamp": "2025-02-07T06:59:59Z"
  },
  {
    "title": "The Right to Remain in the Face of Genocide",
    "description": "Ahead of Israeli Prime Minister Benjamin Netanyahu’s visit to the White House, US President Donald Trump said Palestinians have “no alternative” but to leave Gaza. When the two leaders met in the oval office, Trump declared that after Palestinians from the Ga…",
    "link": "https://www.counterpunch.org/2025/02/07/the-right-to-remain-in-the-face-of-genocide/",
    "timestamp": "2025-02-07T06:59:46Z"
  },
  {
    "title": "The US Shifts From Progressive to Authoritarian Neoliberalism",
    "description": "“Shock and Awe,” “Fear and Chaos,” “Carnage”—these are just some of the more typical ways mainstream media have described the mood after Donald Trump’s first few weeks in office. From the latest announcements about removing Palestinians from Gaza and the drac…",
    "link": "https://www.counterpunch.org/2025/02/07/the-us-shifts-from-progressive-to-authoritarian-neoliberalism/",
    "timestamp": "2025-02-07T06:59:06Z"
  },
  {
    "title": "‘Inhuman’: As Modi visits Trump, outrage over shackled Indian deportees",
    "description": "On Wednesday, the US deported 104 Indians on the longest such military flight used so far, before Modi's visit.",
    "link": "https://www.aljazeera.com/features/2025/2/7/inhuman-as-modi-visits-trump-outrage-over-shackled-indian-deportees",
    "timestamp": "2025-02-07T06:58:50Z"
  },
  {
    "title": "U.S. federal judge temporarily blocks Trump's \"buyout\" plan for gov't workers",
    "description": "WASHINGTON, Feb. 6 (Xinhua) -- A federal judge in the U.S. city of Boston on Thursday temporarily bl",
    "link": "http://en.people.cn/n3/2025/0207/c90000-20273680.html",
    "timestamp": "2025-02-07T06:57:46Z"
  },
  {
    "title": "Bitcoin Price Drops to $97,800 Alongside Most Altcoins Amid Ongoing Market Slump",
    "description": "The overall capitalisation of the crypto market slipped by 0.90 percent in the last 24 hours. Bitcoin and Ether both reflected losses on February 7. Solana, Cardano, and Avalanche joined most altcoins in logging losses amid the ongoing trade war between the U…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-today-altcoins-losses-ongoing-market-slump-7654763",
    "timestamp": "2025-02-07T06:57:45Z"
  },
  {
    "title": "The End of the United Nations at a League of Nations Moment?",
    "description": "“The League is dead,” Robert Cecil solemnly declared on April 18, 1946, addressing delegates from 34 countries at the League of Nations headquarters in Geneva. The death of the League was not the immediate end of a worldwide international organization dedicat…",
    "link": "https://www.counterpunch.org/2025/02/07/the-end-of-the-united-nations-at-a-league-of-nations-moment/",
    "timestamp": "2025-02-07T06:57:24Z"
  },
  {
    "title": "Trump’s Coup Started on Day One and Continues Apace",
    "description": "COUP D’ETAT: A sudden decisive exercise of force in politics and especially the alteration of an existing government by a small group. During last year’s campaign, Donald Trump faced growing scrutiny over his increasingly authoritarian and violent rhetoric.  …",
    "link": "https://www.counterpunch.org/2025/02/07/trumps-coup-started-on-day-one-and-continues-apace/",
    "timestamp": "2025-02-07T06:57:21Z"
  },
  {
    "title": "Trump and Ethnic Cleansing of Gaza",
    "description": "US President Donald Trump’s declaration to remove the Palestinians from Gaza reveals the two truths. First, history repeats itself, but in doing so, it does in farcical ways. Second, whatever shred of rules-based order that was imposed by the United States on…",
    "link": "https://www.counterpunch.org/2025/02/07/trump-and-ethnic-cleansing-of-gaza/",
    "timestamp": "2025-02-07T06:56:42Z"
  },
  {
    "title": "Resisting Trump’s Immigration Policy",
    "description": "It is a new day for federal immigration enforcement in the USA. The Donald J. Trump administration’s recent announcement on immigration enforcement is ending the longstanding “sensitive locations” policy, and allows federal immigration arrests at schools, chu…",
    "link": "https://www.counterpunch.org/2025/02/07/resisting-trumps-immigration-policy/",
    "timestamp": "2025-02-07T06:55:59Z"
  },
  {
    "title": "Trump Seizes Power in DC",
    "description": "Donald Trump has launched a scorched earth campaign to carry out an authoritarian nationalist transformation of U.S. society and its state. In contrast to his first term, this time Trump has a loyal cabinet, a Republican Party reincarnated in his image, and a…",
    "link": "https://www.counterpunch.org/2025/02/07/trump-seizes-power/",
    "timestamp": "2025-02-07T06:55:57Z"
  },
  {
    "title": "Kamala’s Loss Echoes Wendy Davis’ Doomed Run for Texas Governor in 2014.  Can Democrats Learn?",
    "description": "When Kamala Harris lost her bid for the White House to Donald Trump, she quickly turned to Hillary Clinton for consolation. At one level, it made sense. Clinton, of course, knows a thing or two about under-performing as a feminist standard-bearer in the face …",
    "link": "https://www.counterpunch.org/2025/02/07/kamalas-loss-echoes-wendy-davis-doomed-run-for-texas-governor-in-2014-can-democrats-learn/",
    "timestamp": "2025-02-07T06:55:10Z"
  },
  {
    "title": "A Litany of Horrors in the New Age of Trump",
    "description": "This past weekend my partner and I got together with a group of friends. We’ve been meeting every six weeks or so since 1982. Originally, this group of lesbians convened to talk about sex: what we were doing, what we wanted to do, what we fantasized about doi…",
    "link": "https://www.counterpunch.org/2025/02/07/a-litany-of-horrors-in-the-new-age-of-trump/",
    "timestamp": "2025-02-07T06:54:27Z"
  },
  {
    "title": "Trump signs order to fight 'anti-Christian bias'",
    "description": "President Donald Trump signed an executive order aimed at eliminating anti-Christian bias within federal agencies and appointed Attorney General Pam Bondi to lead a Justice Department task force. Critics argue the order could misuse religious freedom. Trump a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-order-to-fight-anti-christian-bias/articleshow/118005270.cms",
    "timestamp": "2025-02-07T06:54:06Z"
  },
  {
    "title": "Opposition lawmakers protest alleged mistreatment of Indian deportees by US",
    "description": "One deportee, Jaspal Singh, said the immigrants’ handcuffs and leg chains were taken off only at the Amritsar airport in India.",
    "link": " https://en.setopati.com/International/164260 ",
    "timestamp": "2025-02-07T06:53:41Z"
  },
  {
    "title": "'Lottery ticket': Crypto investors brace for bumpy ride under Trump",
    "description": "cryptocurrencies, buoyed since Donald Trump's November 5 election win, were in freefall.  The value of Bitcoin, by far the most important crypto which has broken record after record and gained around 50 percent since Trump's election, dropped six percent at t…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/lottery-ticket-crypto-investors-brace-for-bumpy-ride-under-trump/articleshow/118005244.cms",
    "timestamp": "2025-02-07T06:53:05Z"
  },
  {
    "title": "Trump and Musk’s plan for world domination – podcast",
    "description": "Between Donald Trump’s suggestion that the US could take control of the Gaza Strip, forcibly removing Palestinians from their homes, and Elon Musk’s continued efforts to dismantle the US federal government, the critics are lining up. The Democrat senator Andy…",
    "link": "https://biztoc.com/x/cd5afcb8c9edc30e",
    "timestamp": "2025-02-07T06:52:37Z"
  },
  {
    "title": "Bucharest to the Ottoman Empire",
    "description": "This is the eleventh part in a series about riding night trains across Europe and the Near East to Armenia — to spend some time in worlds beyond the pathological obsessions of President Donald Trump. (This week the president has been redeveloping Gaza into an…",
    "link": "https://www.counterpunch.org/2025/02/07/bucharest-to-the-ottoman-empire/",
    "timestamp": "2025-02-07T06:51:28Z"
  },
  {
    "title": "Cryptocurrency investors are bracing for bumpy ride",
    "description": "Nick was enjoying his Saturday off work in Pennsylvania when he received an unexpected and alarming message: cryptocurrencies, buoyed since Donald Trump's Nov. 5 election win, were in freefall.",
    "link": "https://www.hurriyetdailynews.com/cryptocurrency-investors-are-bracing-for-bumpy-ride-205543",
    "timestamp": "2025-02-07T06:51:14Z"
  },
  {
    "title": "Ex-USAID Head Says America Will 'Pay The Price' From Musk, Trump Attacking Agency",
    "description": "Andrew Natsios, a Republican who served under George W. Bush, knocked the pair for pushing \"a lot of garbage\" in their efforts to gut the agency.",
    "link": "https://www.huffpost.com/entry/former-usaid-administrator-trump-elon-musk-cuts-agency_n_67a58f06e4b011cd6d36d1ae",
    "timestamp": "2025-02-07T06:49:03Z"
  },
  {
    "title": "100 Days of DOGE",
    "description": "In their attempt to create a separate power structure inside the government, Musk and his team are running the risk of bringing the government to a standstill. Who knew that the Office of Personnel Management (OPM) could be such an interesting place? The nond…",
    "link": "https://nationalinterest.org/blog/jacob-heilbrunn/100-days-of-doge/",
    "timestamp": "2025-02-07T06:48:17Z"
  },
  {
    "title": "Palestinian March of Defiance and Israeli Trashing of International Conventions",
    "description": "Palestinians for decades have stood their ground and against all odds have continued to live where they rightfully belong: their ancestral homeland. Beginning with the current ceasefire of 19 January, they have begun their march of defiance north to a Gaza wh…",
    "link": "https://www.counterpunch.org/2025/02/07/palestinian-march-of-defiance-and-israeli-trashing-of-international-conventions/",
    "timestamp": "2025-02-07T06:46:21Z"
  },
  {
    "title": "Ted Cruz: Biden admin. poured 'millions of dollars' into Hamas",
    "description": "“They secretly poured literally uncountable hundreds of millions of dollars toward Hamas, including tens of millions of cash they could never account for,” Cruz said.",
    "link": "https://www.jpost.com/american-politics/article-841089",
    "timestamp": "2025-02-07T06:45:30Z"
  },
  {
    "title": "The Trump-Musk Outlaw Regime–The Scorecard So Far",
    "description": "In just two weeks, Donald Trump, Elon Musk, and their minions have managed to alienate, disrupt, disparage, and defy Americans and foreign friends alike. They have openly mocked Congress, the Constitution, the rule of law, and the virtues of diplomacy, all fo…",
    "link": "https://www.counterpunch.org/2025/02/07/the-trump-musk-outlaw-regime-the-scorecard-so-far/",
    "timestamp": "2025-02-07T06:44:36Z"
  },
  {
    "title": "Elon Musk calls drones, AI the future of war",
    "description": "<p>NEW YORK &mdash; Elon Musk, the CEO of SpaceX, said that the future of warfare is artificial intelligence (AI) and drones in a newly released video of his conversation last summer at the United States Military Academy in West Point, New York.</p>",
    "link": "https://www.bangkokpost.com/life/tech/2956235/musk-calls-drones-ai-the-future-of-war-in-west-point-interview",
    "timestamp": "2025-02-07T06:44:00Z"
  },
  {
    "title": "Memo To Congress: Pass The FoRGED Act",
    "description": "FoRGED Act calls for the most sweeping defense acquisition reform in a generation.  FoRGED Act ensures we spend wisely but a generational investment is also required.",
    "link": "https://www.forbes.com/sites/mikebrown/2025/02/07/memo-to-congress-pass-the-forged-act/",
    "timestamp": "2025-02-07T06:43:37Z"
  },
  {
    "title": "DEI Until I Die",
    "description": "I share Donald Trump’s conviction that the near-miss bullet fired at his head by Thomas Matthew Crooks was a divine intervention. It was God stepping in to punish us. Perhaps for the indiscriminate massacre of Palestinians by the resistance party, an atrocity…",
    "link": "https://www.counterpunch.org/2025/02/07/dei-until-i-die/",
    "timestamp": "2025-02-07T06:43:06Z"
  },
  {
    "title": "'Trump' thrills fans at Hong Kong theatre's last hurrah",
    "description": "A Cantonese opera in Hong Kong reimagines the attempted assassination of Donald Trump as part of an absurdist play, attracting audiences to the Sunbeam Theatre. Despite efforts to modernize and rejuvenate the art form, the historic venue faces closure and con…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-thrills-fans-at-hong-kong-theatres-last-hurrah/articleshow/118004818.cms",
    "timestamp": "2025-02-07T06:42:11Z"
  },
  {
    "title": "Netanyahu thanks Trump for ICC sanction",
    "description": "Israeli Prime Minister Benjamin Netanyahu's office praised US President Donald Trump's order targeting the International Criminal Court (ICC) due to its probe for Gaza-related crimes.\"Thank you, Presi...",
    "link": "https://biztoc.com/x/5a6b72805e8a8938",
    "timestamp": "2025-02-07T06:42:02Z"
  },
  {
    "title": "In the Age of Trump, All Queer People Should Be Anarchists",
    "description": "Well, it’s official dearest motherfuckers, according to the President of the United States I don’t fucking exist and neither does anyone else who falls outside of that country club rapist’s definition of male and female. I had my suspicions; people do seem to…",
    "link": "https://www.counterpunch.org/2025/02/07/in-the-age-of-trump-all-queer-people-should-be-anarchists/",
    "timestamp": "2025-02-07T06:40:42Z"
  },
  {
    "title": "ELF's CEO says people bought less makeup last month because they were too fixated on TikTok's turmoil",
    "description": "ELF's CEO, Tarang Amin, said that \"consumer mindset\" was focused on the LA wildfires and \"uncertainty around the TikTok platform.\"",
    "link": "https://www.businessinsider.com/budget-beauty-company-elf-blames-tiktok-turmoil-for-slow-sales-2025-2",
    "timestamp": "2025-02-07T06:40:38Z"
  },
  {
    "title": "Trump’s New Cuba Policy: Bad for Cuba and Migrants",
    "description": "On his return to the presidency on January 20, Donald Trump rescinded his predecessor Joe Biden’s short-lived removal of Cuba from the State Sponsor of Terrorism (SSOT) designation. The SSOT designation will further isolate Cuba diplomatically and economicall…",
    "link": "https://www.counterpunch.org/?p=353388",
    "timestamp": "2025-02-07T06:40:13Z"
  },
  {
    "title": "Amid RBI rate cut cheers, did you miss RBI's warning that threatens India’s economy?",
    "description": "RBI MPC Policy: The Reserve Bank of India (RBI) has cut interest rates for the first time in nearly five years, reducing the repo rate to 6.25% to support economic growth. However, Governor Sanjay Malhotra warned of global risks that could impact India's fina…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/amid-rbi-rate-cut-cheers-did-you-miss-sanjay-malhotras-warning-about-global-economic-risks-that-could-shake-indias-economy/articleshow/118003833.cms",
    "timestamp": "2025-02-07T06:37:31Z"
  },
  {
    "title": "'Daily Show' Cooks Up The Most Stomach-Turning Description Of Trump You'll Ever Hear",
    "description": "Desi Lydic also spotted a Trump official experiencing an \"important rite of passage.\"",
    "link": "https://www.huffpost.com/entry/desi-lydic-trump-norovirus_n_67a581ece4b06fc72ae299de",
    "timestamp": "2025-02-07T06:35:36Z"
  },
  {
    "title": "Trump imposes sanctions on International Criminal Court, accusing it of targeting US and Israel",
    "description": "Order accuses ICC of ‘illegitimate and baseless actions’ against the US and ‘close ally’ Israel",
    "link": "https://www.irishtimes.com/world/us/2025/02/07/trump-imposes-sanctions-on-international-criminal-court-accusing-it-of-targeting-us-and-israel/",
    "timestamp": "2025-02-07T06:29:16Z"
  },
  {
    "title": "FEC Chair Says Trump Has Ordered Her Removal As She Signals Intent To Fight",
    "description": "FEC Commissioner and Chair Ellen Weintraub questioned the legal validity of President Donald Trump’s bid to remove her from the role.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/02/07/fec-chair-says-trump-has-moved-to-remove-her-as-she-signals-intent-to-fight/",
    "timestamp": "2025-02-07T06:27:20Z"
  },
  {
    "title": "Risks Digest 34.54",
    "description": "Posted by RISKS List Owner on Feb 06RISKS-LIST: Risks-Forum Digest Thursday 6 Jan 2025 Volume 34 : Issue 54\n\nACM FORUM ON RISKS TO THE PUBLIC IN COMPUTERS AND RELATED SYSTEMS (comp.risks)\nPeter G. Neumann, founder and still moderator\n\n***** See last item for …",
    "link": "https://seclists.org/risks/2025/q1/2",
    "timestamp": "2025-02-07T06:21:26Z"
  },
  {
    "title": "News Summary-Intelligence Report 2/6/2025*Newsdump Thursday*Trump Orders Sanctions On International Court*New US Sanctions On Iran Target Oil For China*US Warships Get Free Panama Canal Passage*",
    "description": "The National Collegiate Athletic Association (NCAA) prohibiting individuals born male... Forces of the new jihadist government in Syria in deadly clashes along the border with Lebanon... Israeli air strikes in Lebanon tonight... A US federal judge issuing an …",
    "link": "https://freerepublic.com/focus/f-bloggers/4295671/posts",
    "timestamp": "2025-02-07T06:21:24Z"
  },
  {
    "title": "Trump to create religious office in White House, target 'anti-Christian bias'",
    "description": "U.S. President Donald Trump said on Thursday he would create a White House faith office and direct Attorney General Pam Bondi to lead a task force on eradicating what he called anti-Christian bias within the federal government.\n\n\nTrump delivered remarks at th…",
    "link": "https://www.voanews.com/a/trump-to-create-religious-office-in-white-house-target-anti-christian-bias-/7966209.html",
    "timestamp": "2025-02-07T06:21:21Z"
  },
  {
    "title": "Avolon settles insurer lawsuits over planes seized in Russia",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/02/07/avolon-settles-insurer-lawsuits-over-planes-seized-in-russia/",
    "timestamp": "2025-02-07T06:21:02Z"
  },
  {
    "title": "China-focused NGOs reel from U.S. foreign funding freeze",
    "description": "NEW YORK -- China-related research crucial to understanding one of the most heavily censored countries in the world is under threat from the Donald Trump administration's freeze on foreign aid programs and grants.\nThere are dozens of China-focused nongovernme…",
    "link": "https://biztoc.com/x/c03298c4de7572bb",
    "timestamp": "2025-02-07T06:19:35Z"
  },
  {
    "title": "Google scraps its diversity hiring goals as it complies with Trump's new government contractor rules",
    "description": "Google is scrapping some of its diversity hiring targets, joining a lengthening list of U.S. companies that have abandoned or scaled back their diversity, equity and inclusion programs.",
    "link": "https://6abc.com/post/google-scraps-diversity-hiring-goals-complies-trumps-new-government-contractor-rules/15873983/",
    "timestamp": "2025-02-07T06:19:08Z"
  },
  {
    "title": "Trump names former 'Post' publisher Tom Rose US ambassador to Poland",
    "description": "US President Donald Trump named Tom Rose, a one-time publisher and CEO of The Jerusalem Post, as the US ambass",
    "link": "https://www.jpost.com/breaking-news/article-841090",
    "timestamp": "2025-02-07T06:18:40Z"
  },
  {
    "title": "Democratic Federal Election Commission chair shares the termination notice she received from Trump: ‘You are hereby removed’",
    "description": "The succinct letter that Weintraub included in her post was dated Jan. 31 and included the 78-year-old president’s distinctive signature.",
    "link": "https://nypost.com/2025/02/07/us-news/trump-fires-democratic-federal-election-commission-chairwoman-ellen-weintraub/",
    "timestamp": "2025-02-07T06:18:18Z"
  },
  {
    "title": "Trump’s First Iran Sanctions Hit Three Ships in China Trade",
    "description": "President Donald Trump’s maiden sanctions package targeting a handful of vessels carrying Iranian oil stopped short of the “maximum pressure” campaign his administration had pledged, according to shippers and analysts.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-first-iran-sanctions-hit-three-ships-in-china-trade",
    "timestamp": "2025-02-07T06:17:44Z"
  },
  {
    "title": "Drop in alternative-fuel ship orders in 2025",
    "description": "The new year started with fewer orders for ships with alternative fuels. More specifically, a drop of around 70% was recorded in new orders in January compared to the corresponding…\nDrop in alternative-fuel ship orders in 2025 - Η ΝΑΥΤΕΜΠΟΡΙΚΗ",
    "link": "https://www.naftemporiki.gr/english/1906498/drop-in-alternative-fuel-ship-orders-in-2025/",
    "timestamp": "2025-02-07T06:17:35Z"
  },
  {
    "title": "Tanzanians with HIV Left in Crisis as USAID Funding Ends",
    "description": "At 9 a.m. on Monday, Mariam Msemwa clutched her clinic card tightly as she stood in line at Bagamoyo District Hospital’s HIV Clinic in Tanzania’s coastal region. The 19-year-old had been here many times before, picking up monthly doses of antiretroviral (ARV)…",
    "link": "https://www.ipsnews.net/2025/02/tanzanians-with-hiv-left-in-crisis-as-u-s-aid-ends/",
    "timestamp": "2025-02-07T06:16:28Z"
  },
  {
    "title": "Trump’s outlandish Gaza plan may spare Middle East from past mistakes",
    "description": "The Arab world has no real interest in the people of Gaza, so while Trump’s idea is radical, it should not be dismissed as unrealistic.",
    "link": "https://www.jpost.com/opinion/article-841006",
    "timestamp": "2025-02-07T06:15:46Z"
  },
  {
    "title": "Thanks to Trump, true peace in the Middle East can finally be achieved",
    "description": "We can not continually look at the same problem and seek the same solution, expecting different results.",
    "link": "https://www.jpost.com/opinion/article-841026",
    "timestamp": "2025-02-07T06:15:01Z"
  },
  {
    "title": "Bank of Ireland tempers bonus hopes amid Trump and UK car finance risks",
    "description": "Rewards capped at 10% of an individual’s salary",
    "link": "https://www.irishtimes.com/business/2025/02/07/bank-of-ireland-tempers-bonus-hopes-amid-trump-and-uk-car-finance-risks/",
    "timestamp": "2025-02-07T06:15:00Z"
  },
  {
    "title": "‘Treated like criminals’: Shackling of Indians aboard 40-hour migrant flight sparks new outrage against Trump | CNN",
    "description": "US officials kept around 100 deported Indian migrants in shackles for their 40-hour flight home, including during bathroom breaks, in the latest incident to spark anger overseas at President Donald Trump’s migration crackdown.",
    "link": "https://www.cnn.com/2025/02/07/india/india-trump-shackles-deportations-intl-hnk/index.html",
    "timestamp": "2025-02-07T06:14:55Z"
  },
  {
    "title": "Trump plan puts an end to the Palestinian state fantasy",
    "description": "Moving Palestinians out of the Gaza Strip may not happen so easily, but at least, there will be a four-year respite from pressure to achieve the unachievable. Opinion.",
    "link": "https://www.israelnationalnews.com/news/403560",
    "timestamp": "2025-02-07T06:11:00Z"
  },
  {
    "title": "Iran condemns new US shipping-related sanctions",
    "description": "The US Treasury said it was imposing new sanctions on a few individuals and tankers helping to ship millions of barrels of Iranian crude oil per year to China.",
    "link": "https://www.jpost.com/breaking-news/article-841088",
    "timestamp": "2025-02-07T06:10:44Z"
  },
  {
    "title": "Puntland offensive deals blow to Islamic State in Somalia",
    "description": "BALIDHIDIN, Somalia (Reuters) - Forces from Somalia's semi-autonomous Puntland region have captured swathes of territory from Islamic State during a weeks-long offensive they hope will draw increased international support, according to officials and Reuters r…",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/puntland-offensive-deals-blow-to-islamic-state-in-somalia",
    "timestamp": "2025-02-07T06:09:00Z"
  },
  {
    "title": "Trump orders government agency to scrap all media contracts following outcry over federal tax dollars going to news outlets: report",
    "description": "The Trump administration ordered a critical agency that assists other government departments to cancel all of its media contracts amid outrage over federal tax dollars flowing to news outlets, according to a report. A White House official made the request to …",
    "link": "https://nypost.com/2025/02/07/us-news/trump-orders-government-agency-to-scrap-all-media-contracts-after-federal-tax-outcry/",
    "timestamp": "2025-02-07T06:07:02Z"
  },
  {
    "title": "Judge pauses Musk plan for mass cull of US govt workers",
    "description": "A judge on Thursday suspended a scheme masterminded by billionaire Elon Musk to slash the size of the U.S. government by encouraging federal workers to quit through a mass buyout.",
    "link": "https://www.hurriyetdailynews.com/judge-pauses-musk-plan-for-mass-cull-of-us-govt-workers-205539",
    "timestamp": "2025-02-07T06:06:54Z"
  },
  {
    "title": "Trump imposes sanctions on International Criminal Court",
    "description": "WASHINGTON — U.S. President Donald Trump on Thursday authorized economic and travel sanctions targeting people who work on International Criminal Court investigations of U.S. citizens or U.S. allies such as Israel, repeating action he took during his first te…",
    "link": "https://www.voanews.com/a/trump-imposes-sanctions-on-international-criminal-court/7966207.html",
    "timestamp": "2025-02-07T06:06:51Z"
  },
  {
    "title": "OpenAI’s Stargate AI Venture Is Scouting for US Data Center Sites",
    "description": "ChatGPT maker OpenAI said on Thursday it is evaluating U.S. states as potential artificial intelligence data center locations for its massive Stargate venture, framing the project as a matter of urgency for the United States to beat China in the …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/07/811154.htm",
    "timestamp": "2025-02-07T06:04:22Z"
  },
  {
    "title": "Israel orders army plan for ‘voluntary departure’ of Gazans",
    "description": "Israel's defense minister ordered the army on Thursday to prepare for \"voluntary\" departures from Gaza, as US President Donald Trump ruled out sending American troops to the territory.",
    "link": "https://www.hurriyetdailynews.com/israel-orders-army-plan-for-voluntary-departure-of-gazans-205538",
    "timestamp": "2025-02-07T06:02:28Z"
  },
  {
    "title": "Some US Adoptees Fear Stricter Immigration Policies, Mass Deportations",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Buttons is one of thousands of children adopted from abroad by American parents, many of them military service members, who were left without citizenship by loopholes in American law, Henderson, Nevada, June 24, 2024…",
    "link": "https://www.hrw.org/news/2025/02/07/some-us-adoptees-fear-stricter-immigration-policies-mass-deportations",
    "timestamp": "2025-02-07T06:01:00Z"
  },
  {
    "title": "RBI cuts repo rate by 25 basis points, first rate cut since 2020",
    "description": "The Reserve Bank of India's Monetary Policy Committee cut the repo rate by 25 basis points to 6.25%, citing declining inflation and a positive growth outlook. Governor Sanjay Malhotra maintained a neutral stance due to global uncertainties and highlighted the…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/rbi-cuts-repo-rate-by-25-basis-points-first-rate-cut-since-2020/articleshow/118003722.cms",
    "timestamp": "2025-02-07T06:00:24Z"
  },
  {
    "title": "If the Government capitulates to Donald Trump, it will have the blood of children on its hands",
    "description": "Throughout the general election campaign, voters were assured that a future Fianna Fáil-Fine Gael government would support the existing Bill. Yet soon after Christmas, the mood music changed",
    "link": "https://www.irishtimes.com/opinion/2025/02/07/if-the-government-capitulates-to-donald-trump-it-will-have-the-blood-of-children-on-its-hands/",
    "timestamp": "2025-02-07T06:00:05Z"
  },
  {
    "title": "Trump’s tariff threat to Ireland: More bark than bite?",
    "description": "Ireland could be caught in the middle of a devastating US-EU trade war",
    "link": "https://www.irishtimes.com/business/2025/02/07/trumps-tariff-threat-to-ireland-more-bark-than-bite/",
    "timestamp": "2025-02-07T06:00:01Z"
  },
  {
    "title": "How America runs Britain",
    "description": "US investment already owns much of the British high street. Are \"ignorant\" politicians \"selling the UK down the river\"?As Donald Trump announces new tariffs on trading partners around the world, Hannah Barnes and Rachel Cunliffe are joined by Angus Hanton, au…",
    "link": "https://shows.acast.com/newstatesman/episodes/how-america-runs-britain",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Protests erupt as Trump meets Netanyahu and calls for Gaza “takeover” plan",
    "description": "Hundreds protest Trump’s meeting with Netanyahu at the White House, condemning it as a betrayal of American values. Demonstrators criticize Trump’s proposal to depopulate Gaza and turn it into a U.S.-controlled territory. Netanyahu’s presence in D.C. is seen …",
    "link": "https://www.naturalnews.com/2025-02-07-protests-trump-meets-netanyahu-gaza-takeover-plan.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "The International Republican Institute: A Deep State proxy funded by USAID and open borders NGOs",
    "description": "The International Republican Institute (IRI) has received significant funding from the U.S. Agency for International Development (USAID) and migration-focused NGOs, totaling over $130.7 million and currently holding $9.2 million in active grants. Critics argu…",
    "link": "https://www.naturalnews.com/2025-02-07-iri-a-deep-state-proxy-funded-by-usaid.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "South African minister calls for MINERAL BOYCOTT in response to U.S. aid cuts",
    "description": "South Africa’s Minister of Mineral and Petroleum Resources Gwede Mantashe calls for African nations to withhold mineral exports to the U.S. in response to President Trump’s decision to cut aid over land expropriation policies. The conflict stems from South Af…",
    "link": "https://www.naturalnews.com/2025-02-07-south-african-minister-calls-for-mineral-boycott.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Number of Palestinians seeking asylum in Ireland rises eight-fold",
    "description": "Israel must respect that ‘Ireland is for Irish people and Palestine is for Palestinians’, says Palestinian ambassador to Ireland",
    "link": "https://www.irishtimes.com/ireland/social-affairs/2025/02/07/number-of-palestinians-seeking-asylum-in-ireland-rises-eight-fold/",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "FBI hands over details of 5,000 employees involved in Jan. 6 investigations: A new chapter in political scrutiny",
    "description": "The FBI has provided the DOJ with details of over 5,000 employees involved in the Jan. 6, 2021 Capitol Hill riots investigation, in compliance with a DOJ demand. FBI agents are concerned about potential retribution and have filed lawsuits to protect their ide…",
    "link": "https://www.naturalnews.com/2025-02-07-fbi-hands-over-details-5000-employees-j6-investigations.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Bitcoin’s $75K plunge looms as Trump tariffs reignite trade war chaos",
    "description": "The probability of Bitcoin (BTC) dropping to $75,000 has doubled to 22% within a week, driven by President Trump’s aggressive tariff policies. Trump’s tariffs of 25% on Canadian and Mexican imports and 10% on Chinese goods have rekindled a global trade war, p…",
    "link": "https://www.naturalnews.com/2025-02-07-bitcoins-75k-plunge-looms-trump-tariffs-trade-war.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "NATO seeks to OUST Zelensky amid Ukraine’s waning war prospects, Russian intelligence claims",
    "description": "The Russian Foreign Intelligence Service (SVR) claims that NATO is preparing to discredit and remove Ukrainian President Volodymyr Zelensky through a smear campaign ahead of potential elections this fall. The SVR alleges that NATO plans to release damaging in…",
    "link": "https://www.naturalnews.com/2025-02-07-russian-svr-nato-seeks-to-oust-zelensky.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Federal crackdown on sanctuary cities intensifies as AG Bondi suspends their funding",
    "description": "In a significant move, U.S. Attorney General Pam Bondi has directed the Department of Justice (DOJ) to suspend federal funding to sanctuary cities, marking an escalation in the federal government’s immigration enforcement efforts. Bondi’s directive, issued un…",
    "link": "https://www.naturalnews.com/2025-02-07-federal-crackdown-on-sanctuary-cities-intensifies-ag-bondi-suspends-funding.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Government criticises ‘provocative’ Israeli comments on Irish ‘obligation’ to Gaza refugees",
    "description": "Controversy comes as figures show the number of Palestinians seeking asylum in Ireland has increased more than eightfold",
    "link": "https://www.irishtimes.com/politics/2025/02/07/government-criticises-provocative-israeli-comments-on-irish-obligation-to-gaza-refugees/",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Italy joins U.S. in exiting WHO: A bold stand for national sovereignty and health freedom",
    "description": "Italy, led by Deputy Prime Minister Matteo Salvini, has introduced a bill to withdraw from the World Health Organization (WHO), following the U.S. in leaving the organization. Salvini argues that Italy should no longer be subject to the WHO’s influence, citin…",
    "link": "https://www.naturalnews.com/2025-02-07-italy-joins-us-in-exiting-who.html",
    "timestamp": "2025-02-07T06:00:00Z"
  },
  {
    "title": "Trump set to withdraw U.S. from UNHRC and cut funding to UNRWA",
    "description": "President Donald Trump is set to issue an executive order pulling the United States out of the UNHRC and halting funding to UNRWA, the agency providing aid to Palestinian refugees. The decision follows reports of UNRWA staffers’ involvement in the Oct. 7 Hama…",
    "link": "https://www.naturalnews.com/2025-02-07-trump-set-to-withdraw-us-from-unhrc.html",
    "timestamp": "2025-02-07T06:00:00Z"
  }
]