[
  {
    "title": "Death penalty charge faced by suspect in Charlie Kirk assassination",
    "description": "Prosecutors brought a murder charge Tuesday against the man accused of assassinating Charlie Kirk and outlined evidence, including a text message confession to his partner and a note left beforehand saying he had the opportunity to kill one of the nation's le…",
    "link": "https://www.bostonherald.com/2025/09/16/death-penalty-charge-faced-by-suspect-in-charlie-kirk-assassination/",
    "timestamp": "2025-09-16T23:51:30Z"
  },
  {
    "title": "Texts Between Accused Charlie Kirk Shooter and Roommate Hint at Motive",
    "description": "Alleged text messages sent between accused shooter Tyler Robinson and his roommate reveal a potential motive for the murder of political commentator Charlie Kirk. During a Tuesday, September 16, press conference, prosecutors shared details of the official cha…",
    "link": "https://www.usmagazine.com/celebrity-news/news/accused-charlie-kirk-shooters-possible-motive-revealed-via-alleged-texts/#article",
    "timestamp": "2025-09-16T23:50:03Z"
  },
  {
    "title": "The White House triples down on ousting Lisa Cook as a major Fed meeting kicks off",
    "description": "The White House triples down on ousting Lisa Cook as a major Fed meeting kicks off\nA move to keep pursuing the matter virtually guarantees a major decision from the Supreme Court that will determine Cook's fate at the central bank\nPresident Donald Trump speak…",
    "link": "https://biztoc.com/x/bac7bcada037e765",
    "timestamp": "2025-09-16T23:47:05Z"
  },
  {
    "title": "Ex-BLS chief says her firing by Trump marked ’dangerous step’ for economy",
    "description": "Stock market today: S&P 500 retreats from record levels as Fed rate decision looms\n(Reuters) -Former Bureau of Labor Statistics Commissioner Erika McEntarfer, in her first public remarks since getting abruptly dismissed last month by President Donald Trump, s…",
    "link": "https://biztoc.com/x/6d74781bcc24db04",
    "timestamp": "2025-09-16T23:47:01Z"
  },
  {
    "title": "More details emerge on potential TikTok deal between U.S., China",
    "description": "New details about a deal with China over the future of TikTok in the United States emerged Tuesday.\nAfter Treasury Secretary Scott Bessent met with a Chinese delegation in Madrid on Monday, he said the two countries had agreed on a deal “framework.” President…",
    "link": "https://biztoc.com/x/8aa39f40e7ddf3a2",
    "timestamp": "2025-09-16T23:46:48Z"
  },
  {
    "title": "President Donald Trump’s $15B lawsuit claims New York Times disparaged his crypto project",
    "description": "US President Donald Trump has launched a $15 billion lawsuit against The New York Times, claiming the newspaper and several reporters intentionally harmed his reputation and the TRUMP memecoin project. In a statement posted on Truth Social, Trump accused the …",
    "link": "https://cryptoslate.com/president-donald-trumps-15b-lawsuit-claims-new-york-times-disparaged-his-crypto-project/",
    "timestamp": "2025-09-16T23:45:44Z"
  },
  {
    "title": "EXCLUSIVE: Arizona Cops on High Alert and Bracing for Charlie Kirk Funeral Chaos at State Farm Stadium — 'Same Ordeal' as Super Bowl Planning",
    "description": "Glendale, Arizona, police will be on high alert for Charlie Kirk's funeral, revealing it will be an 'ordeal' like the Super Bowl.",
    "link": "https://radaronline.com/p/charlie-kirk-funeral-preparations-glendale-police-high-alert/",
    "timestamp": "2025-09-16T23:45:00Z"
  },
  {
    "title": "Fani Willis permanently removed from prosecuting Trump election interference case after losing appeal",
    "description": "Fulton County District Attorney Fani Willis has been permanently sidelined from prosecuting President Donald Trump’s election interference case in Georgia after she lost an appeal at the state’s highest court. The Georgia Court of Appeals in December ruled th…",
    "link": "https://freerepublic.com/focus/f-news/4340928/posts",
    "timestamp": "2025-09-16T23:44:15Z"
  },
  {
    "title": "More details emerge on potential TikTok deal between U.S., China",
    "description": "New details about a deal with China over the future of TikTok in the United States emerged Tuesday",
    "link": "https://www.msnbc.com/top-stories/latest/tiktok-deal-trump-china-bessent-algorithm-rcna231754",
    "timestamp": "2025-09-16T23:40:29Z"
  },
  {
    "title": "Prince Andrew makes rare public appearance at Duchess of Kent funeral",
    "description": "King Charles, Prince William and Kate joined mourners at Westminster Cathedral.",
    "link": "https://www.nzherald.co.nz/lifestyle/prince-andrew-makes-rare-public-appearance-at-duchess-of-kent-funeral/A334XBX2OVBHVN5GN4XHJSU2RE/",
    "timestamp": "2025-09-16T23:40:29Z"
  },
  {
    "title": "Jane Fonda Says Friend Robert Redford ‘Stood’ For 1 Thing ‘We Have To Keep Fighting For’",
    "description": "The two actors shared a friendship that spanned over six decades, and worked together on numerous projects like “The Chase” and “Barefoot in the Park.”",
    "link": "https://www.huffpost.com/entry/jane-fonda-robert-redford-patriotism_n_68c9c0ece4b0765c8250b3b4",
    "timestamp": "2025-09-16T23:40:26Z"
  },
  {
    "title": "'I've Never Seen Anything Like It': Trump Policies Leave US Farmers in Dire Straits",
    "description": "As anticipated, US President Donald Trump's economic and immigration policies are harming American farmers' ability to earn a living—and testing the loyalty of one of the president's staunchest bases of support, according to reports published this week.After …",
    "link": "https://www.commondreams.org/news/farmers-harmed-by-trump-policies",
    "timestamp": "2025-09-16T23:39:19Z"
  },
  {
    "title": "Leaked Chats Show Alleged Kirk Killer 'Doesn't Fit Into Any Tidy Narrative'",
    "description": "Independent journalist Ken Klippenstein on Tuesday challenged conflicting narratives circulating about Tyler Robinson by obtaining online chats and speaking with a childhood friend of the 22-year-old man accused of assassinating far-right activist Charlie Kir…",
    "link": "https://www.commondreams.org/news/tyler-robinson",
    "timestamp": "2025-09-16T23:38:39Z"
  },
  {
    "title": "Trump arrives in London for second state visit to the UK",
    "description": "US President Donald Trump and First Lady Melania Trump arrived in London &#111;n Tuesday evening for their second state visit to the United Kingdom.They were greeted at London Stansted Airport by members of the Royal Air Force and British officials, including…",
    "link": "https://www.israelnationalnews.com/flashes/666652",
    "timestamp": "2025-09-16T23:37:22Z"
  },
  {
    "title": "Four arrested after Trump, Epstein images projected onto Britain's Windsor Castle",
    "description": "LONDON (Reuters) -Four people were arrested on Tuesday following a projection of images of Donald Trump alongside sex offender Jeffrey Epstein onto the royal Windsor Castle, where the U.S. President is set to be hosted by King Charles during his state visit t…",
    "link": "https://www.thestar.com.my/news/world/2025/09/17/four-arrested-after-trump-epstein-images-projected-onto-britain039s-windsor-castle",
    "timestamp": "2025-09-16T23:37:00Z"
  },
  {
    "title": "Trump administration clears first Ukraine arms aid paid for by allies, sources say",
    "description": "Since taking office, the Trump administration has only sold weapons to Ukraine or shipped donations which were authorized by former President Joe Biden.",
    "link": "https://www.japantimes.co.jp/news/2025/09/17/world/politics/trump-ukraine-arms-aid-allies/",
    "timestamp": "2025-09-16T23:35:00Z"
  },
  {
    "title": "Trump administration sued over actions against University of California",
    "description": "WASHINGTON (Reuters) -Labor unions, faculty and students in the University of California education system sued President Donald Trump's administration on...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-sued-over-actions-233417586.html",
    "timestamp": "2025-09-16T23:34:17Z"
  },
  {
    "title": "Fox News Contributor Criticizes Trump’s Venezuelan Boat Bombings: ‘Things Can Go Very Badly Here’",
    "description": "Fox News contributor Kennedy criticized President Donald Trump for blowing up ships allegedly carrying drugs in the Caribbean. \nThe post Fox News Contributor Criticizes Trump’s Venezuelan Boat Bombings: ‘Things Can Go Very Badly Here’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/fox-news-contributor-criticizes-trumps-venezuelan-boat-bombings-things-can-go-very-badly-here/",
    "timestamp": "2025-09-16T23:33:16Z"
  },
  {
    "title": "South Park Season 27 Episode 5: Why new episode faced delays? Here's release date, time, where to watch, plot and what to expect",
    "description": "South Park Season 27 Episode 5 will air on Comedy Central on September 17, 2025, at 10 PM ET, followed by its streaming release on Paramount+ the next day. The show’s delay comes from production needs, with creators adjusting schedules while fans await what s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/south-park-season-27-episode-5-release-date-time-where-to-watch-plot-what-to-expect-streaming-details-delay-explained-paramount-plus-comedy-central-why-new-episode-faced-delays-how-to-watch/articleshow/123932666.cms",
    "timestamp": "2025-09-16T23:32:32Z"
  },
  {
    "title": "UK protesters arrested after beaming Epstein video ahead of Trump visit",
    "description": "The shots included Donald Trump's mugshot, portraits of Epstein, newspaper headlines, and footage of the two men dancing together.",
    "link": "https://www.abc.net.au/news/2025-09-17/protesters-beam-epstein-video-as-trump-visits-uk/105782420",
    "timestamp": "2025-09-16T23:32:29Z"
  },
  {
    "title": "The way we live now",
    "description": "Speaking of things that would destroy any normal (work with me here) presidency, the $15 billion dollar “lawsuit” three members of the bar — one who is named Epstein, come on now — filed against the New York Times, Penguin RandomHouse, and several individual …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/the-way-we-live-now-2",
    "timestamp": "2025-09-16T23:30:57Z"
  },
  {
    "title": "Who Is Howard-John Wesley? Pastor Goes Viral for Anti-Charlie Kirk Sermon",
    "description": "Wesley's sermon has been viewed millions of times online and has invited a mixed response.",
    "link": "https://www.newsweek.com/howard-john-wesley-charlie-kirk-sermon-viral-2130614",
    "timestamp": "2025-09-16T23:29:33Z"
  },
  {
    "title": "A female president leads Mexican Independence celebrations for the first time",
    "description": "Mexican President Claudia Sheinbaum has become the first female leader to preside over the country’s independence celebrations in 215 years",
    "link": "https://abcnews.go.com/International/wireStory/female-president-leads-mexican-independence-celebrations-time-125643952",
    "timestamp": "2025-09-16T23:29:21Z"
  },
  {
    "title": "Trump Hits The New York Times With $15B Libel Lawsuit",
    "description": "U.S. President Donald Trump sued The New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion, claiming defamation and libel, and citing reputational damage, a Florida court filing showed. Trump's suit cites a series …",
    "link": "https://freerepublic.com/focus/f-news/4340927/posts",
    "timestamp": "2025-09-16T23:29:01Z"
  },
  {
    "title": "America’s enemies want us at each other’s throats over Charlie Kirk — don’t take the bait",
    "description": "Russian officials, the Kremlin’s state news outlet and Chinese bots pounced to manipulate Americans’ heightened emotions as a way to incite further domestic conflict.",
    "link": "https://nypost.com/2025/09/16/opinion/americas-enemies-aim-to-divide-us-over-charlie-kirks-murder-dont-take-the-bait/",
    "timestamp": "2025-09-16T23:28:05Z"
  },
  {
    "title": "Rebel Republican rips GOP bid to charge teens as adults — while ignoring Epstein abusers",
    "description": "Rep. Thomas Massie (R-KY), a frequent thorn in the side of President Donald Trump and his Republican colleagues on major issues, took to X on Tuesday to criticize his party's current priorities — particularly with regard to an upcoming bill that would impose …",
    "link": "https://www.rawstory.com/thomas-massie-2674000620/",
    "timestamp": "2025-09-16T23:27:02Z"
  },
  {
    "title": "Al Gore Says Trump’s Energy Policies Are a ‘Tragedy’ for the US",
    "description": "The Trump administration’s desire to amp up the production of oil, gas and coal while dismantling policies that back clean energy is hurting US competitiveness, according to Al Gore.",
    "link": "https://financialpost.com/pmn/business-pmn/al-gore-says-trumps-energy-policies-are-a-tragedy-for-the-us",
    "timestamp": "2025-09-16T23:23:50Z"
  },
  {
    "title": "Here Are The Biggest Lies Leftists Keep Repeating About Charlie Kirk",
    "description": "In the wake of Charlie Kirk's assassination, high-profile individuals with large social media followings have spread lies about the late conservative activist.",
    "link": "https://dailycaller.com/2025/09/16/biggest-lies-said-about-charlie-kirk/",
    "timestamp": "2025-09-16T23:21:37Z"
  },
  {
    "title": "Microsoft Announces $30 Billion Investment In AI Infrastructure, Operations In UK",
    "description": "Microsoft will invest $30 billion in the U.K. through 2028 to expand AI infrastructure and operations, including building the country's largest supercomputer with 23,000 GPUs in partnership with Nscale. CNBC reports: On a call with reporters on Tuesday, Micro…",
    "link": "https://news.slashdot.org/story/25/09/16/2032219/microsoft-announces-30-billion-investment-in-ai-infrastructure-operations-in-uk",
    "timestamp": "2025-09-16T23:20:00Z"
  },
  {
    "title": "5 Takeaways From FBI Director Patel’s Senate Panel Hearing",
    "description": "FBI Director Kash Patel’s testimony to the Senate Judiciary Committee on Tuesday was testy at times, as topics of the Charlie Kirk assassination, the Jeffrey... Read More\nThe post 5 Takeaways From FBI Director Patel’s Senate Panel Hearing appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/09/16/5-takeaways-from-fbi-director-patels-senate-panel-hearing/",
    "timestamp": "2025-09-16T23:17:13Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "Why the US is expected to cut interest rates\nIt's finally happening.\nAfter months of economic debate and mounting attacks from US President Donald Trump, the US central bank is poised to cut interest rates on Wednesday.\nThe Federal Reserve is widely expected …",
    "link": "https://biztoc.com/x/effb367467b649f3",
    "timestamp": "2025-09-16T23:13:25Z"
  },
  {
    "title": "Trump's Former AG Reveals President's Response to Jeffrey Epstein's Death",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFormer Attorney General William Barr told a House committee he spoke twice with Donald Trump about Jeffrey Epstein during Trump's first term, including after the financier died by suicide in a New York jail ce…",
    "link": "https://biztoc.com/x/b06540d4049b80db",
    "timestamp": "2025-09-16T23:13:07Z"
  },
  {
    "title": "Trump's Former AG Reveals President's Response to Jeffrey Epstein's Death",
    "description": "Barr said in a deposition released by the House Oversight Committee that he called Trump immediately after learning of Epstein's death.",
    "link": "https://www.newsweek.com/epstein-update-barr-trump-attorney-general-2130936",
    "timestamp": "2025-09-16T23:10:42Z"
  },
  {
    "title": "DNA on rifle, other items matches man accused of trying to assassinate Trump, FBI analyst testifies",
    "description": "An FBI analyst has testified that DNA sampled from a rifle, as well as multiple other items, found near where President Donald Trump was playing golf in South Florida last year matches that of a man accused of trying to assassinate Trump that day",
    "link": "https://abcnews.go.com/US/wireStory/dna-rifle-items-matches-man-accused-assassinate-trump-125644228",
    "timestamp": "2025-09-16T23:10:29Z"
  },
  {
    "title": "Deal reached to keep TikTok operating in the U.S., Trump says",
    "description": "U.S. President Donald Trump on Tuesday announced an agreement between the U.S. and China to keep TikTok operating in the United States, with three sources familiar with the matter saying the deal was similar to one discussed earlier this year.",
    "link": "https://www.cbc.ca/news/world/us-china-tiktok-deal-1.7635620",
    "timestamp": "2025-09-16T23:10:28Z"
  },
  {
    "title": "Trump just exposed his 'deep bottomless hole of insecurity' with massive threat: analyst",
    "description": "A former senior advisor to President Barack Obama slammed President Donald Trump's latest lawsuit during a podcast interview on Tuesday. Dan Pfeiffer, who worked with Obama from 2013 to 2015, discussed Trump's lawsuit against The New York Times, alleging the …",
    "link": "https://www.rawstory.com/trump-2674000654/",
    "timestamp": "2025-09-16T23:10:02Z"
  },
  {
    "title": "GSK plans $30 billion US investment as pharma tariff threat looms",
    "description": "(Reuters) -GSK said on Wednesday it plans to invest $30 billion in research and development and supply chain infrastructure in the United States over the...",
    "link": "https://finance.yahoo.com/news/gsk-plans-30-billion-us-230754541.html",
    "timestamp": "2025-09-16T23:07:54Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "The Federal Reserve is expected to make its first cut to interest rates since 2024.",
    "link": "https://www.bbc.com/news/articles/c3e75y90pw0o",
    "timestamp": "2025-09-16T23:04:14Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "The Federal Reserve is expected to make its first cut to interest rates since 2024.",
    "link": "https://www.bbc.com/news/articles/c3e75y90pw0o",
    "timestamp": "2025-09-16T23:04:01Z"
  },
  {
    "title": "'No credible information' Epstein trafficked victims to other players: FBI boss",
    "description": "FBI Director Kash Patel told a U.S. Senate panel on Tuesday there was no credible information that Jeffrey Epstein trafficked women and underage girls to anyone but himself, seeking to defuse criticism of the Trump administration's move to end its review of t…",
    "link": "https://www.cbc.ca/news/world/kash-patel-fbi-epstein-senate-panel-1.7635660",
    "timestamp": "2025-09-16T23:02:44Z"
  },
  {
    "title": "Trump brings tech CEOs on UK state visit",
    "description": "US President Donald Trump will be joined by Silicon Valley top brass on his state visit to the UK beginning today, highlighting a wave of tech investments in Washington’s leading European ally.\nGoogle’s president is accompanying Trump, and announced $6.8 bill…",
    "link": "https://biztoc.com/x/af2d0b04f778c8df",
    "timestamp": "2025-09-16T23:02:00Z"
  },
  {
    "title": "Why is Trump suing the New York Times?",
    "description": "President Donald Trump is seen on the South Lawn of the White House on September 14, 2025. | Francis Chung/Politico/Bloomberg via Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration w…",
    "link": "https://biztoc.com/x/f35a0af5681b3502",
    "timestamp": "2025-09-16T23:01:42Z"
  },
  {
    "title": "Record-Low 35% in U.S. Satisfied With K-12 Education Quality",
    "description": "Americans' satisfaction with the quality of K-12 education in the U.S. is at a record-low 35%, and just 26% say it is headed in the right direction.",
    "link": "https://news.gallup.com/poll/695174/record-low-satisfied-education-quality.aspx",
    "timestamp": "2025-09-16T23:01:00Z"
  },
  {
    "title": "Patel: ‘No credible information’ others involved in Epstein crimes | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> FBI Director Kash Patel told a U.S. Senate panel on Tuesday there was no credible information that Jeffrey Epstein trafficked women and underage girls to anyone but himself, seeking to defuse criticism of the Trump administration’s move to end i…",
    "link": "https://www.staradvertiser.com/2025/09/16/breaking-news/patel-no-credible-information-others-involved-in-epstein-crimes/",
    "timestamp": "2025-09-16T23:00:56Z"
  },
  {
    "title": "Jimmy Kimmel suggests Charlie Kirk assassin was one of the 'MAGA gang' despite reports of leftist leanings",
    "description": "ABC late-night host Jimmy Kimmel implied during his show that Charlie Kirk’s alleged assassin was a Republican despite reports of him having a “leftist ideology.\"",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-suggests-charlie-kirk-assassin-one-maga-gang-despite-reports-leftist-leanings",
    "timestamp": "2025-09-16T23:00:11Z"
  },
  {
    "title": "Chevron’s Comeback Faces the Heat of U.S.–Venezuela Conflict",
    "description": "Chevron has returned to Venezuela, but the move may prove problematic given the frictions in the US–Venezuela relations. What appears at first as an oil company regaining lost ground could be in fact another failed attempt to normalize oil production in Venez…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Chevrons-Comeback-Faces-the-Heat-of-USVenezuela-Conflict.html",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "What's on? Top 10 TV and streaming tips for Wednesday",
    "description": "Who's Building Ireland? meets the tradespeople doing just that, Trump v The Truth looks at the US president's proclivity for porkies, Molly Parker stars in US medical drama Doc, and The Morning Show returns . . .",
    "link": "https://www.rte.ie/entertainment/2025/0917/1533736-whats-on-top-10-tv-and-streaming-tips-for-wednesday/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Royal engagements planned for second day of Trump visit",
    "description": "The first full day of US President Donald Trump's state visit to the UK gets underway this morning.",
    "link": "https://www.rte.ie/news/uk/2025/0917/1533865-trump-uk/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Royal engagements planned for second day of Trump visit",
    "description": "The first full day of US President Donald Trump's state visit to the UK gets under way this morning.",
    "link": "https://www.rte.ie/news/uk/2025/0917/1533865-donald-trump-uk/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Live in Faith and Truth: The Charlie Kirk Legacy",
    "description": "“Blessed are you when people hate you, and when they exclude and insult you, and denounce your name as evil on account of the Son... Read More\nThe post Live in Faith and Truth: The Charlie Kirk Legacy appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/16/live-in-faith-and-truth-the-charlie-kirk-legacy/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Why is Trump suing the New York Times?",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump is suing the New York Times for…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/461764/trump-new-york-times-defamation-lawsuit-press-freedom",
    "timestamp": "2025-09-16T22:55:55Z"
  },
  {
    "title": "Trump Shutting Down Cancer Research",
    "description": "America's place as a hotbed for important cancer research is on its death bed. In a devastating report, The New York Times published a deep (and often depressing) dive into how President Donald Trump has dramatically slashed funding to American cancer researc…",
    "link": "https://futurism.com/neoscope/trump-shutting-down-cancer-research",
    "timestamp": "2025-09-16T22:51:02Z"
  },
  {
    "title": "“She should be put in jail”: Trump celebrates Willis’ removal from Georgia case",
    "description": "The president hailed the \"great decision\" by the Georgia Supreme Court.",
    "link": "https://www.salon.com/2025/09/16/she-should-be-put-in-jail-trump-celebrates-willis-removal-from-georgia-case/",
    "timestamp": "2025-09-16T22:50:22Z"
  },
  {
    "title": "US President Donald Trump arrives in UK for second state visit",
    "description": "The visit comes as the UK and US prepare to sign a landmark technology agreement.",
    "link": "https://www.aljazeera.com/news/2025/9/16/us-president-donald-trump-arrives-in-uk-for-second-state-visit",
    "timestamp": "2025-09-16T22:47:03Z"
  },
  {
    "title": "Trump admin reportedly removes slavery history from national parks (Ja'han Jones/MSNBC)",
    "description": "Ja'han Jones / MSNBC:\nTrump admin reportedly removes slavery history from national parks  —  The administration's efforts to censor references to slavery and racist inequality appear to have ramped up with the reported removal of several signs and exhibits.  …",
    "link": "https://www.memeorandum.com/250916/p139",
    "timestamp": "2025-09-16T22:45:01Z"
  },
  {
    "title": "Republican bill would fund extra security for Supreme Court but omits lower court judges",
    "description": "A Republican spending bill snubbed federal judges who asked for additional security funds as a result of a recent spike in violent threats.",
    "link": "https://www.nbcnews.com/politics/politics-news/republican-bill-funds-extra-security-supreme-court-omits-lower-courts-rcna231418",
    "timestamp": "2025-09-16T22:43:45Z"
  },
  {
    "title": "House approves bills to reshape DC's criminal justice system",
    "description": "The House passed legislation Tuesday that would overhaul how youth who commit crimes are prosecuted in the District of Columbia as congressional Republicans ...",
    "link": "https://www.yahoo.com/news/articles/house-approves-bills-reshape-dcs-224213015.html",
    "timestamp": "2025-09-16T22:42:13Z"
  },
  {
    "title": "Democrats must denounce the lefties cheering Charlie Kirk’s killer and Luigi Mangione",
    "description": "The left continued its celebration of murder and mayhem Tuesday outside Manhattan Supreme Court, where Luigi Mangione appeared before a judge in his case.",
    "link": "https://nypost.com/2025/09/16/opinion/democrats-must-denounce-the-lefties-cheering-charlie-kirks-killer-and-luigi-mangione/",
    "timestamp": "2025-09-16T22:42:03Z"
  },
  {
    "title": "AI could boost UK economy by 10% in five years, says Microsoft boss",
    "description": "Boss Satya Nadella said it was the biggest investment the firm had made outside of the US.",
    "link": "https://www.bbc.com/news/articles/c7016ljre03o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-16T22:40:09Z"
  },
  {
    "title": "American Bitcoin, Backed by Eric and Donald Trump Jr., Joins Crowded Crypto Field",
    "description": "",
    "link": "https://biztoc.com/x/e4e6808ed9192b07",
    "timestamp": "2025-09-16T22:39:46Z"
  },
  {
    "title": "She Pushed To Overturn Trump’s Loss In The 2020 Election. Now She’ll Help Oversee U.S. Election Security.",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. Heather Honey, a high-profile denier of Donald Trump’s loss in the 2020 election, has been appointed to a senior position in the U.S. Department of Homeland Securi…",
    "link": "https://www.techdirt.com/2025/09/16/she-pushed-to-overturn-trumps-loss-in-the-2020-election-now-shell-help-oversee-u-s-election-security/",
    "timestamp": "2025-09-16T22:37:16Z"
  },
  {
    "title": "Prosecutors seek death penalty for suspect in Charlie Kirk assassination | Honolulu Star-Advertiser",
    "description": "PROVO, Utah >> Utah prosecutors said today they will seek the death penalty for the suspect in conservative activist Charlie Kirk’s assassination and revealed some of the evidence against him, including alleged text messages in which he appeared to confess to…",
    "link": "https://www.staradvertiser.com/2025/09/16/breaking-news/prosecutors-seek-death-penalty-for-suspect-in-charlie-kirk-assassination/",
    "timestamp": "2025-09-16T22:35:53Z"
  },
  {
    "title": "Mayor Brandon Johnson Signs ‘Right To Protest’ Order As Trump Admin Targets City",
    "description": "Democratic Chicago Mayor Brandon Johnson signed a sweeping executive order Tuesday that seeks to fortify protest protections in Chicago.",
    "link": "https://dailycaller.com/2025/09/16/brandon-johnson-signs-right-protest-order-trump-admin/",
    "timestamp": "2025-09-16T22:34:47Z"
  },
  {
    "title": "Former AG Bill Barr floats ‘supposition’ on Jeffrey Epstein-CIA link",
    "description": "The former attorney general said that he doesn’t believe that the pedophile was formally “working for” the agency, according to a transcript made public Tuesday.",
    "link": "https://nypost.com/2025/09/16/us-news/former-ag-bill-barr-floats-supposition-on-jeffrey-epstein-cia-link/",
    "timestamp": "2025-09-16T22:34:25Z"
  },
  {
    "title": "Trump’s Reforms to Asylum System Need to Be Codified Into Law, Immigration Experts Say",
    "description": "The Trump administration has made major changes to the U.S. asylum system, but a future administration could immediately reverse those reforms, cautions immigration expert Lora... Read More\nThe post Trump’s Reforms to Asylum System Need to Be Codified Into La…",
    "link": "https://www.dailysignal.com/2025/09/16/trumps-reforms-asylum-system-need-be-codified-law-immigration-experts-say/",
    "timestamp": "2025-09-16T22:33:49Z"
  },
  {
    "title": "Mr. Trump Goes To Windsor",
    "description": "British Prime Minister Keir Starmer broke the norm when he handed President Donald Trump an invitation <a href=\"https://www.royal.uk/news-and-activity/2025-07-14/state-visit-by-the-president-and-first-lady-of-the-united-states\"target=\"_blank\"   >for a </a><a …",
    "link": "https://www.npr.org/2025/09/16/nx-s1-5543501/mr-trump-goes-to-windsor",
    "timestamp": "2025-09-16T22:32:50Z"
  },
  {
    "title": "Price Inflation Rose Again in August, but the Fed Doesn’t Care",
    "description": "The Federal Reserve is set to lower the target policy interest rate this week in spite of the fact that price inflation rose again in August. The Fed has, for many years, insisted that it is equally committed to both sides of its so-called “dual mandate” of p…",
    "link": "https://www.shtfplan.com/headline-news/price-inflation-rose-again-in-august-but-the-fed-doesnt-care",
    "timestamp": "2025-09-16T22:30:49Z"
  },
  {
    "title": "Steve Deace: 3 things America MUST do after Charlie Kirk’s assassination",
    "description": "Just a couple of months ago, Steve Deace spoke at an event at Dream City Church in Phoenix, Arizona, where Charlie Kirk regularly worshipped and collaborated on initiatives. Right before he walked on stage, Charlie leaned down and whispered a word of encourag…",
    "link": "https://www.theblaze.com/shows/steve-deace-show/steve-deace-three-things-america-must-do-after-charlie-kirks-assassination",
    "timestamp": "2025-09-16T22:30:00Z"
  },
  {
    "title": "Donald Trump blasts Australian journalist in heated exchange at White House",
    "description": "Donald Trump blasts Australian journalist in heated exchange at White House7news.com.au",
    "link": "https://7news.com.au/news/donald-trump-blasts-australian-journalist-in-heated-exchange-at-white-house-c-20044535",
    "timestamp": "2025-09-16T22:29:33Z"
  },
  {
    "title": "WATCH LIVE: Powell holds news conference after Fed’s highly anticipated interest rate decision",
    "description": "The Fed on Wednesday is widely expected to cut its key rate by a quarter point to about 4.1%, which would be the first reduction since last December.",
    "link": "https://www.pbs.org/newshour/economy/watch-live-powell-holds-news-briefing-after-feds-highly-anticipated-interest-rate-decision",
    "timestamp": "2025-09-16T22:28:59Z"
  },
  {
    "title": "Hochul argues Zohran Mamdani would be best candidate to ‘stand up’ to Trump — as she defends shock endorsement in NYC mayoral race",
    "description": "She’s standing by her Mam. Gov. Kathy Hochul defended her shocking endorsement of Zohran Mamdani, arguing Tuesday the socialist mayoral contender is the best candidate to fight Donald Trump. New York City’s next mayor needs to “stand up” against Trump’s desir…",
    "link": "https://nypost.com/2025/09/16/us-news/hochul-argues-zohran-mamdani-would-be-best-candidate-to-stand-up-to-trump-as-she-defends-shock-endorsement-in-nyc-mayoral-race/",
    "timestamp": "2025-09-16T22:28:55Z"
  },
  {
    "title": "Trump extends TikTok deadline for 4th time after reaching framework deal with China",
    "description": "President Donald Trump formally extended the deadline to keep the social media app TikTok available in the United States until Dec. 16.",
    "link": "https://biztoc.com/x/cf73c2402ee5205e",
    "timestamp": "2025-09-16T22:28:35Z"
  },
  {
    "title": "Trump Says US Military Hit Third Drug Boat From Venezuela",
    "description": "US President Donald Trump said the US military had “knocked off” a third drug boat from Venezuela and had a message for President Nicolas Maduro. “Stop sending drugs into the United States,” Trump said Tuesday as he departed Washington for a trip to London. “…",
    "link": "https://biztoc.com/x/fe23a2f1a1e6067b",
    "timestamp": "2025-09-16T22:28:20Z"
  },
  {
    "title": "Press Conference by Secretary-General António Guterres at United Nations Headquarters",
    "description": "Following is the transcript of UN Secretary-General António Guterres’ press conference in New York today:",
    "link": "https://press.un.org/en/2025/sgsm22806.doc.htm",
    "timestamp": "2025-09-16T22:28:15Z"
  },
  {
    "title": "'OMG!' Expert torches DHS for trashing innocent US citizen as 'criminal illegal alien'",
    "description": "The Department of Homeland Security publicly attacked a Chicago-area man as an unlawful immigrant and a criminal — even while knowing he was neither of these things, American Immigration Council fellow Aaron Reichlin-Melnick revealed in a lengthy thread poste…",
    "link": "https://www.rawstory.com/dhs-raid/",
    "timestamp": "2025-09-16T22:26:03Z"
  },
  {
    "title": "The TikTok ban got delayed again, but Trump says the deal to create new, U.S.-owned app is done",
    "description": "If you've been following the long, drawn-out saga of the U.S. government's attempt to shake up TikTok's ownership, then I have bad news and good news for you: The bad news is that President Donald Trump has yet again pushed back the start date for the Biden-e…",
    "link": "https://www.tubefilter.com/2025/09/16/tiktok-ban-delay-deal-new-us-app/",
    "timestamp": "2025-09-16T22:23:08Z"
  },
  {
    "title": "Report shines a light on the Trump family’s crypto dealings with the UAE",
    "description": "Plus, Apple appears to have acquiesced to Trump yet again, Elizabeth Warren is worried about xAI, and more — all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-crypto-uae-evergreen-apple-epstein-charlie-kirk-rcna231767",
    "timestamp": "2025-09-16T22:22:57Z"
  },
  {
    "title": "Trump to Hamas: If Hamas is using hostages as human shields, all bets are off",
    "description": "US President Donald Trump published a post on Truth Social on Monday, in which he once again called on the Hamas terrorist organization to release all the hostages it is holding. \"I have just read a News Report that Hamas has moved the hostages above ground t…",
    "link": "https://freerepublic.com/focus/f-news/4340917/posts",
    "timestamp": "2025-09-16T22:20:38Z"
  },
  {
    "title": "Fearful NY migrants are skipping doctors' visits and food help, advocates say",
    "description": "Federal immigration enforcement agents take a man into custody at 26 Federal Plaza in Manhattan on Sept. 8, 2025.\n \n\nA City Council hearing examines how migrants are holding up under President Trump's deportation effort. [ more › ]",
    "link": "https://gothamist.com/news/fearful-ny-migrants-are-skipping-doctors-visits-and-food-help-advocates-say",
    "timestamp": "2025-09-16T22:18:00Z"
  },
  {
    "title": "Police arrest 4 over Trump‑Epstein display on Windsor Castle",
    "description": "Four people have been arrested on \"suspicion of malicious communications,\" after images of United States President Donald Trump and the late convicted sex offender Jeffrey Epstein were proje...",
    "link": "https://biztoc.com/x/7f5fc903c6dd566d",
    "timestamp": "2025-09-16T22:17:21Z"
  },
  {
    "title": "Trump extends TikTok deadline for 4th time after reaching framework deal with China",
    "description": "President Donald Trump formally extended the deadline to keep the social media app TikTok available in the United States until Dec. 16.",
    "link": "https://www.pbs.org/newshour/politics/trump-extends-tiktok-deadline-for-4th-time-after-reaching-framework-deal-with-china",
    "timestamp": "2025-09-16T22:17:13Z"
  },
  {
    "title": "The Irony of Using Charlie Kirk’s Murder to Silence Debate",
    "description": "The conservative activist couldn’t have risen to prominence without robust free speech.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/charlie-kirk-free-speech-republican-party/684235/",
    "timestamp": "2025-09-16T22:17:00Z"
  },
  {
    "title": "Don’t wait for NATO, Pres. Trump: Hit Russia & Co. with ‘severe’ sanctions NOW",
    "description": "President Donald Trump says he's ready to do \"major\" sanction on Russia and its trading partners to squeeze Vladimir Putin to end the war.",
    "link": "https://nypost.com/2025/09/16/opinion/dont-wait-for-nato-pres-trump-hit-russia-amp-co-with-severe-sanctions-now/",
    "timestamp": "2025-09-16T22:15:52Z"
  },
  {
    "title": "The third Red Scare",
    "description": "Across the country, ordinary Americans are being fired for expressing their opinions about Charlie Kirk’s killing. Sometimes, those opinions are despicable — like support for his assassination. But in other cases they are anodyne, like expressing distaste for…",
    "link": "https://www.vox.com/on-the-right-newsletter/461722/charlie-kirk-killing-trump-vance-miller-free-speech-cancel",
    "timestamp": "2025-09-16T22:15:34Z"
  },
  {
    "title": "Collins Leads GOP Contenders to Take on Georgia’s Ossoff for Senate, Poll Finds",
    "description": "A new Georgia poll finds Rep. Mike Collins, R-Ga., leading among top GOP contenders when faced in a matchup against incumbent Sen. Jon Ossoff, D-Ga.... Read More\nThe post Collins Leads GOP Contenders to Take on Georgia’s Ossoff for Senate, Poll Finds appeared…",
    "link": "https://www.dailysignal.com/2025/09/16/mike-collins-leads-gop-contenders-ossoff-matchup/",
    "timestamp": "2025-09-16T22:15:00Z"
  },
  {
    "title": "MAGA senator lights up 'Zuckerberg and his friends' after hearing snub",
    "description": "Sen. Josh Hawley (R-MO) called out Big Tech, including Meta owner Mark Zuckerberg and other social platform leaders who refuse to show up and discuss the companies' alleged use of AI chatbots exploiting children, pushing some to self-harm and suicide.\"Zuckerb…",
    "link": "https://www.rawstory.com/josh-hawley-2674000467/",
    "timestamp": "2025-09-16T22:12:14Z"
  },
  {
    "title": "Federal Reserve cuts key rate by quarter-point and signals two more cuts this year",
    "description": "WASHINGTON (AP) — The Federal Reserve cut its key interest rate by a quarter-point Wednesday and projected it would do so twice more this year as concern grows at the central bank about the health of the nation's labor market.",
    "link": "https://www.wral.com/story/federal-reserve-wrestles-with-how-many-interest-rate-cuts-to-make-and-how-fast/22162408/",
    "timestamp": "2025-09-16T22:11:54Z"
  },
  {
    "title": "US officers tied us up and pointed guns at us, South Korean engineers tell BBC",
    "description": "Korean workers who were detained in the US say they were treated like criminals and are still in shock.",
    "link": "https://www.bbc.com/news/articles/c07v1j98ydvo",
    "timestamp": "2025-09-16T22:10:59Z"
  },
  {
    "title": "US info on Venezuela drug boats likely coming from Mexican cartel chief: source",
    "description": "\"It's clear to me that El Mayo Zambada cut some deals with the US government,\" said Texas-based security consultant Robert Almonte.",
    "link": "https://nypost.com/2025/09/16/world-news/us-info-on-venezuela-drug-boats-likely-coming-from-mexican-cartel-chief-source/",
    "timestamp": "2025-09-16T22:10:42Z"
  },
  {
    "title": "Our New Era of Political Theater",
    "description": "From social media meltdowns to televised feuds with world leaders, Donald Trump's never shied away from a performance. And as the country weathers MAGA's Act II, the rest of Washington is joining onstage. It's as beloved child star Shirley Temple once said: \"…",
    "link": "https://www.vanityfair.com/culture/story/our-new-era-of-political-theater",
    "timestamp": "2025-09-16T22:09:08Z"
  },
  {
    "title": "7NEWS live updates: Hunt for arsonist after national park fire, man stabbed to death on street",
    "description": "7NEWS live updates: Hunt for arsonist after national park fire, man stabbed to death on street7news.com.au",
    "link": "https://7news.com.au/news/7news-live-updates-hunt-for-arsonist-after-national-park-fire-man-stabbed-to-death-on-street-c-19247566",
    "timestamp": "2025-09-16T22:08:38Z"
  },
  {
    "title": "Can Luigi Mangione get too big to jail?",
    "description": "The first people in line on Tuesday, I was told, started camping out on the sidewalk two days ago. Luigi Mangione, the man accused of gunning down UnitedHealthcare CEO Brian Thompson in December 2024, was due in court at 9AM ET for a hearing in one of three c…",
    "link": "https://www.theverge.com/report/779351/luigi-mangione-hearing-new-york-social-media-ecosystem",
    "timestamp": "2025-09-16T22:08:13Z"
  },
  {
    "title": "The Democrats’ mask is slipping off",
    "description": "'Socialism's only sure outcome is misery for the many under the power of the few'",
    "link": "https://www.wnd.com/2025/09/democrats-mask-is-slipping/",
    "timestamp": "2025-09-16T22:07:37Z"
  },
  {
    "title": "Debunking the Left’s Series of Lies Following Charlie Kirk’s Assassination",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Debunking the Left’s Series of Lies Following Charlie Kirk’s Assassinat…",
    "link": "https://www.dailysignal.com/2025/09/16/debunking-the-lefts-series-of-lies-following-charlie-kirks-assassination/",
    "timestamp": "2025-09-16T22:07:20Z"
  },
  {
    "title": "Macaulay Culkin Announces Home Alone 35th Anniversary Tour",
    "description": "Culkin promises \"terrible trivia questions\" and \"Joe Pesci stories\" during the 14-city tour. \nMacaulay Culkin Announces Home Alone 35th Anniversary Tour\nScott Sterling",
    "link": "https://consequence.net/2025/09/macaulay-culkin-nostalgic-2025-home-alone-35th-anniversary-tour-dates/",
    "timestamp": "2025-09-16T22:07:09Z"
  },
  {
    "title": "Vast Majority Of House Democrats Oppose Legislative Push To Combat Pressing DC Crime Problem",
    "description": "Nearly all House Democrats voted against GOP legislation aimed at reducing juvenile crime in the District of Columbia on Tuesday evening. The House of Representatives passed two bills to roll back soft-on-crime policies in the district that Republicans argue …",
    "link": "https://dailycaller.com/2025/09/16/majority-house-dems-oppose-legislation-dc-crime/",
    "timestamp": "2025-09-16T22:05:03Z"
  }
]