[
  {
    "title": "Most Asian Markets Rise On Hopes For Bill To Avert US Shutdown",
    "description": "Asian investors fought Friday to grind out gains at the end of a painful week for markets as they welcomed signs US lawmakers will avert a government shutdown but remained fearful over Donald Trump's trade war.",
    "link": "https://www.ibtimes.com/most-asian-markets-rise-hopes-bill-avert-us-shutdown-3766242",
    "timestamp": "2025-03-14T03:00:24Z"
  },
  {
    "title": "Most Asian Markets Rise On Hopes For Bill To Avert US Shutdown",
    "description": "Asian investors fought Friday to grind out gains at the end of a painful week for markets as they welcomed signs US lawmakers will avert a government shutdown but remained fearful over Donald Trump's trade war.",
    "link": "https://www.ibtimes.com.au/most-asian-markets-rise-hopes-bill-avert-us-shutdown-1856856",
    "timestamp": "2025-03-14T03:00:13Z"
  },
  {
    "title": "March 13, 2025: Defense Highlights",
    "description": "... Read more",
    "link": "https://www.wnd.com/2025/03/march-13-2025-defense-highlights/",
    "timestamp": "2025-03-14T03:00:10Z"
  },
  {
    "title": "Harvard, Yale, Columbia fall in line after funding threats",
    "description": "U.S. universities are taking a harder line following threats of funding cuts by the White House over their criticized handling of pro-Palestine rallies last year.",
    "link": "https://www.japantimes.co.jp/news/2025/03/14/world/society/us-universities-trump-funding-threats/",
    "timestamp": "2025-03-14T03:00:00Z"
  },
  {
    "title": "When politicians fight the law and the law wins",
    "description": "As Mike Amesbury bows out of his career as a Labour MP after being caught on tape assaulting a constituent, this week’s episode of Westminster Insider goes inside politicians’ wrangles with the law. Host Sascha O’Sullivan finds out if winding up in front of a…",
    "link": "https://www.politico.eu/podcast/westminster-insider/when-politicians-fight-the-law-and-the-law-wins/",
    "timestamp": "2025-03-14T03:00:00Z"
  },
  {
    "title": "Watch JD Vance Get Viciously Booed By Kennedy Center Crowd",
    "description": "The vice president and his wife, Usha Vance, got hit with a harsh tune as they took their seats for a concert.",
    "link": "https://www.huffpost.com/entry/jd-vance-booed-kennedy-center-crowd-dc_n_67d387d4e4b0e72dd7ff13be",
    "timestamp": "2025-03-14T03:00:00Z"
  },
  {
    "title": "It Is Long Past Time For Democrats To Start Pounding The Impeachment Drum",
    "description": "The big deal today is Democrats’ threatened capitulation to the GOP on the continuing resolution to keep the government open—but entirely on Trump’s terms, no matter who it bankrupts (hello, DC police and fire departments!). But the larger point made here sta…",
    "link": "https://www.techdirt.com/2025/03/13/it-is-long-past-time-for-democrats-to-start-pounding-the-impeachment-drum/",
    "timestamp": "2025-03-14T03:00:00Z"
  },
  {
    "title": "Most Asian markets rise on hopes for bill to avert US shutdown",
    "description": "Asian investors fought Friday to grind out gains at the end of a painful week for markets as they welcomed signs US lawmakers will avert a government shutdown but remained fearful over Donald Trump’s trade war. Equities have been pummelled in recent weeks and…",
    "link": "https://www.digitaljournal.com/world/most-asian-markets-rise-on-hopes-for-bill-to-avert-us-shutdown/article",
    "timestamp": "2025-03-14T02:57:33Z"
  },
  {
    "title": "Peace Through Pressure: Trump’s Ukraine Recalibration",
    "description": "Trump’s strategy is not about surrendering Ukraine to Russia—it is about reshaping America’s role through a recalibration of leadership and strategic leverage.\nThe post Peace Through Pressure: Trump’s Ukraine Recalibration appeared first on The National Inter…",
    "link": "https://nationalinterest.org/blog/politics/peace-through-pressure-trumps-ukraine-recalibration/",
    "timestamp": "2025-03-14T02:57:32Z"
  },
  {
    "title": "Trump’s National Security Advisor Tells Fox News That Putin Can Have Eastern Ukraine",
    "description": "National Security Advisor Mike Waltz made a shocking public disclosure on Thursday, telling Fox News that a peace deal between Russia and Ukraine would almost certainly involve the cession of the Donbas region to Russia.\nThe post Trump’s National Security Adv…",
    "link": "https://www.mediaite.com/tv/trumps-national-security-advisor-tells-fox-news-that-putin-can-have-eastern-ukraine/",
    "timestamp": "2025-03-14T02:57:17Z"
  },
  {
    "title": "Greenland PM calls for ‘tougher rejection’ of Trump’s plan to take island",
    "description": "Outgoing Prime Minister Mute Egede says 'disrespect' for Greenland must stop as US president says he wants island.",
    "link": "https://www.aljazeera.com/news/2025/3/14/greenland-pm-calls-for-tougher-rejection-of-trumps-plan-to-take-island",
    "timestamp": "2025-03-14T02:56:44Z"
  },
  {
    "title": "Trump ‘would like to meet’ Putin",
    "description": "US President Donald Trump has expressed his readiness to meet and speak with his Russian counterpart Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614191-trump-like-meet-putin/",
    "timestamp": "2025-03-14T02:55:59Z"
  },
  {
    "title": "Democrat Governor Gretchen Whitmer 'Grateful' After Meeting With Trump",
    "description": "Democrat Governor Gretchen Whitmer of Michigan said she was \"grateful\" to speak with President Donald Trump on Thursday for a \"productive meeting\" that included discussions about jobs and tariffs. Since taking office for his second administration, Trump has p…",
    "link": "https://freerepublic.com/focus/f-news/4304152/posts",
    "timestamp": "2025-03-14T02:54:39Z"
  },
  {
    "title": "J.D. Vance Booed As He Takes His Seat At The Kennedy Center",
    "description": "President Donald Trump may have purged the Kennedy Center board and had himself elected its new chairman, but the venue’s patrons don’t seem to have gotten the message. As Trump’s Vice President J.D. Vance walked to his seat in the balcony, a chorus of boos b…",
    "link": "http://deadline.com/2025/03/j-d-vance-booed-kennedy-center-1236326215/",
    "timestamp": "2025-03-14T02:54:06Z"
  },
  {
    "title": "High stakes as Iran nuclear issue reaches crunch moment",
    "description": "Almost a decade after its historic deal with world powers, Iran is closer than ever to being able to make a nuclear bomb.",
    "link": "https://www.bbc.com/news/articles/c86pvyd2qeno",
    "timestamp": "2025-03-14T02:53:34Z"
  },
  {
    "title": "Foxconn to post higher Q4 profit on AI server demand",
    "description": "Net profit for October-December for Apple's top iPhone assembler and Nvidia's AI server maker likely came in at T$54.4 billion ($1.65 billion), according to an LSEG consensus estimate of 15 analysts, versus T$53.15 billion a year earlier.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/foxconn-to-post-higher-q4-profit-on-ai-server-demand/articleshow/119001002.cms",
    "timestamp": "2025-03-14T02:53:05Z"
  },
  {
    "title": "Achieving a noble mission...: Putin thanks PM Modi, Trump for efforts in Ukraine peace push",
    "description": "Russian President Vladimir Putin expressed gratitude to US President Trump and other world leaders for their efforts in mediating the Russia-Ukraine conflict. Putin acknowledged Ukraine's willingness for a ceasefire, emphasizing the need for long-term peace a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/putin-thanks-modi-trump-for-efforts-in-ukraine-peace-push/articleshow/119000940.cms",
    "timestamp": "2025-03-14T02:49:23Z"
  },
  {
    "title": "Cop City Is Everywhere : Learning from the Movement to Defend the Forest",
    "description": "The movement to stop Cop City was one of the most important social struggles of the Biden era. Its trajectory tells us a lot about the challenges we confront today.",
    "link": "https://crimethinc.com/2025/03/14/cop-city-is-everywhere-learning-from-the-movement-to-defend-the-forest",
    "timestamp": "2025-03-14T02:48:22Z"
  },
  {
    "title": "MSNBC host Lawrence O’Donnell reveals he’s taking a week off — citing exhaustion from Trump’s presidency",
    "description": "MSNBC host Lawrence O'Donnell revealed on Wednesday night that he was exhausted by covering President Donald Trump and that he was taking a week off from hosting his show, \"The Last Word.\"",
    "link": "https://nypost.com/2025/03/13/media/msnbc-host-lawrence-odonnell-reveals-hes-taking-a-week-off-citing-exhaustion-from-trumps-presidency/",
    "timestamp": "2025-03-14T02:48:21Z"
  },
  {
    "title": "Trump threatens 200% tariffs on European spirits",
    "description": "WASHINGTON DC: U.S. President Donald Trump on Thursday threatened the European Union with 200% tariffs on wine, champagne and other spirits produced in the 27-nation bloc after the EU levied what he said was “a nasty 50% tariff” on American-distilled whiskey.…",
    "link": "https://english.khabarhub.com/2025/14/444291/",
    "timestamp": "2025-03-14T02:45:21Z"
  },
  {
    "title": "Columbia University Expels Some Students Who Seized Building Last Year",
    "description": "The university said a judicial board brought sanctions against students who occupied Hamilton Hall in 2024 to protest the war in Gaza.",
    "link": "https://time.com/7268085/columbia-university-expels-student-protestors-gaza-palestine-israel/",
    "timestamp": "2025-03-14T02:45:00Z"
  },
  {
    "title": "Global markets sink, bonds rise in demand as Trump's threats trigger more tariff angst",
    "description": "Global equities declined, with the S&P 500 confirming a correction amid tariff threats from President Trump, boosting inflation fears. U.S. Treasury prices rose as investors sought safer assets. The Nasdaq Composite is down over 14% from its recent record, as…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-sink-bonds-rise-in-demand-as-trumps-threats-trigger-more-tariff-angst/articleshow/119000821.cms",
    "timestamp": "2025-03-14T02:44:42Z"
  },
  {
    "title": "US stock market takes another tumble as Trump threatens tariffs on wine",
    "description": "Benchmark S&P 500 falls 1.39 percent, dragging index more than 10 percent below its February peak.",
    "link": "https://www.aljazeera.com/economy/2025/3/14/us-stock-market-takes-another-tumble-as-trump-threatens-tariffs-on-wine",
    "timestamp": "2025-03-14T02:44:17Z"
  },
  {
    "title": "Musk's dressing down: For Trump, suits mean success, so why does his most empowered deputy dress like an intern?",
    "description": "Elon Musk's recent appearances in a suit at key U.S. government meetings have sparked discussion about power dynamics and dress codes in Washington. Traditionally known for his casual 'tech support' T-Shirt, his formal attire signals a potential shift in adhe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/musks-dressing-down-for-trump-suits-mean-success-so-why-does-his-most-empowered-deputy-dress-like-an-intern/articleshow/119000788.cms",
    "timestamp": "2025-03-14T02:43:24Z"
  },
  {
    "title": "Russia Is Right to Be Proud of Its S-500 Missile Defense System",
    "description": "Russia’s newest “Prometheus” S-500 variant is considered to be top-notch by most analysts.\nThe post Russia Is Right to Be Proud of Its S-500 Missile Defense System appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/russia-is-right-to-be-proud-of-its-s-500-missile-defense-system/",
    "timestamp": "2025-03-14T02:43:08Z"
  },
  {
    "title": "BRUTAL: MSNBC’s Rachel Maddow Has Lost Roughly a Quarter of Her Audience Since the 2024 Election",
    "description": "Rachel Maddow's audience has plummeted by nearly 25% since the 2024 election, reflecting viewer disillusionment after years of unfulfilled expectations. The reasons behind this significant decline warrant a closer examination.\nThe post BRUTAL: MSNBC’s Rachel …",
    "link": "https://www.thegatewaypundit.com/2025/03/brutal-msnbcs-rachel-maddow-has-lost-roughly-quarter/",
    "timestamp": "2025-03-14T02:40:14Z"
  },
  {
    "title": "Mahmoud Khalil Isn’t the Only Green-Card Holder Targeted for Arrest",
    "description": "The Trump administration has identified another legal permanent resident it wants deported.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/trump-deportation-green-card-holder-mahmoud-khalil/682037/",
    "timestamp": "2025-03-14T02:40:00Z"
  },
  {
    "title": "CNBC Daily Open: The S&P 500 joins the Nasdaq in correction territory",
    "description": "After Thursday’s sell-off, the S&P 500 has joined the Nasdaq Composite in correction territory, which is typically taken to mean a decline of 10% or more from a recent high.\nInvestors looking to distract themselves with a drink might, in fact, feel even more …",
    "link": "https://biztoc.com/x/a0ba5dada4a82e2c",
    "timestamp": "2025-03-14T02:31:02Z"
  },
  {
    "title": "Columbia suspends and expels pro-Palestinian students who occupied building",
    "description": "The university disciplines protesters after a threat from US President Donald Trump to withhold funding.",
    "link": "https://www.bbc.com/news/articles/c0rz4eqx4g7o",
    "timestamp": "2025-03-14T02:30:04Z"
  },
  {
    "title": "Tánaiste calls Government Trade Forum meeting amid growing trade war between EU and US",
    "description": "Tánaiste Simon Harris will hold a meeting of the Government Trade Forum to discuss the latest developments in the ongoing escalation of trade tensions between the EU and US.",
    "link": "https://www.independent.ie/irish-news/tanaiste-calls-government-trade-forum-meeting-amid-growing-trade-war-between-eu-and-us/a238593185.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Dublin office market expected to recover as city-centre locations risk rising rent and space crunch",
    "description": "Dublin’s office market is expected to see a strong recovery this year but increasing demand in city centre locations could mean rising rent and companies choosing to move elsewhere.",
    "link": "https://www.independent.ie/business/dublin-office-market-expected-to-recover-as-city-centre-locations-risk-rising-rent-and-space-crunch/a516214584.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Letters: Irish spirit in the air as US and Canada prepare for St Patrick’s Day parades",
    "description": "St Patrick’s Day parades have long been celebrated in the US. Canada has an equally strong tradition. Its 2016 census recorded 4.6 million ­Canadians with Irish ancestry – about 12pc of the population.",
    "link": "https://www.independent.ie/opinion/letters/letters-irish-spirit-in-the-air-as-us-and-canada-prepare-for-st-patricks-day-parades/a1472170665.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Donald Trump told Micheál Martin to ‘pick up the phone’ if Ireland has any problems",
    "description": "Taoiseach Micheál Martin has said ­“gracious host” Donald Trump told him if Ireland had any problems: “Don’t ­hesitate to pick up the phone.”",
    "link": "https://www.independent.ie/irish-news/donald-trump-told-micheal-martin-to-pick-up-the-phone-if-ireland-has-any-problems/a1804277297.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Judge orders Trump to rehire thousands of fired probationary staff let go from government agencies",
    "description": "A federal judge yesterday ordered President Donald Trump’s administration to reinstate thousands — if not tens of thousands — of probationary workers let go in mass firings across multiple agencies last month, saying that the terminations were directed by a p…",
    "link": "https://www.independent.ie/world-news/north-america/judge-orders-trump-to-rehire-thousands-of-fired-probationary-staff-let-go-from-government-agencies/a873258020.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: US must put pressure on Moscow for an equitable peace deal to be reached",
    "description": "There are solid reasons why war is cynically referred to as “the gambling table of governments”. When Vladimir Putin launched his illegal invasion of Ukraine three years ago, he bet everything on it being wrapped up within days.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-us-must-put-pressure-on-moscow-for-an-equitable-peace-deal-to-be-reached/a511482644.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Drug giants in Ireland remain silent on future despite Donald Trump’s aim to bring manufacturing back to the US",
    "description": "Major pharmaceutical companies with operations in Ireland maintained an official silence yesterday after US president ­Donald Trump said he would try to bring back drugs manufacturing to the US.",
    "link": "https://www.independent.ie/irish-news/drug-giants-in-ireland-remain-silent-on-future-despite-donald-trumps-aim-to-bring-manufacturing-back-to-the-us/a80724817.html",
    "timestamp": "2025-03-14T02:30:00Z"
  },
  {
    "title": "Nearly 100 protesters arrested at Trump Tower over Palestinian activist's arrest",
    "description": "NEW YORK, March 13 (Xinhua) -- Nearly 100 people were arrested after staging a sit-in at the Trump T",
    "link": "http://en.people.cn/n3/2025/0314/c90000-20289497.html",
    "timestamp": "2025-03-14T02:28:17Z"
  },
  {
    "title": "Dollar holds firm, euro drifts as global trade tensions escalate",
    "description": "TOKYO : The U.S. dollar was broadly firmer on Friday with the euro pulling further away from a five-month peak as markets grappled with escalating global trade tensions and risks of a sharp economic downturn. Sowing more volatility across markets, U.S. Presid…",
    "link": "https://www.channelnewsasia.com/business/dollar-holds-firm-euro-drifts-global-trade-tensions-escalate-4999906",
    "timestamp": "2025-03-14T02:26:37Z"
  },
  {
    "title": "USPS agrees to work with DOGE on reform, planning to cut 10,000 workers",
    "description": "Postmaster General Louis DeJoy has agreed to cut 10,000 workers and billions of dollars from the U.S. Postal Service budget",
    "link": "https://abcnews.go.com/Politics/wireStory/usps-agrees-work-doge-reform-planning-cut-10000-119780174",
    "timestamp": "2025-03-14T02:22:29Z"
  },
  {
    "title": "‘Story Wasn’t Totally True’: Vance Douses Tension Claims, Calls Out ‘Random Staffer’ For Leaking Rubio-Musk Meeting",
    "description": "VP Vance pushed back on claims of tension between some of Trump's cabinet members and Musk, stating the story \"wasn't totally true.\"",
    "link": "https://dailycaller.com/2025/03/13/jd-vance-elon-musk-tension-marco-rubio-story-fox-news/",
    "timestamp": "2025-03-14T02:21:15Z"
  },
  {
    "title": "PA spokesman: Trump’s disavowal of the deportation of Gaza residents is encouraging",
    "description": "Mahmoud Abbas’ spokesman hopes for “the continuation of balanced statements from the American administration” to enable progress toward the Arab Peace Initiative.",
    "link": "https://www.israelnationalnews.com/news/405354",
    "timestamp": "2025-03-14T02:21:06Z"
  },
  {
    "title": "Analysis-Donald Trump makes Chinese stocks (somewhat) great again",
    "description": "",
    "link": "https://biztoc.com/x/f24bfed634c31091",
    "timestamp": "2025-03-14T02:21:01Z"
  },
  {
    "title": "Vladimir Putin suggests US ceasefire idea for Ukraine needs serious reworking",
    "description": "President Vladimir Putin has expressed support for a U.S. ceasefire proposal in Ukraine, though he emphasized the need for key clarifications and conditions. While U.S. President Donald Trump views Putin's statement as promising, Ukrainian President Volodymyr…",
    "link": "https://economictimes.indiatimes.com/news/defence/vladimir-putin-suggests-us-ceasefire-idea-for-ukraine-needs-serious-reworking/articleshow/119000309.cms",
    "timestamp": "2025-03-14T02:19:56Z"
  },
  {
    "title": "Enoch Burke's family forcibly removed from St Patrick's Day event in Washington DC",
    "description": "The family did not have tickets to the event and attempted to disrupt the speeches.",
    "link": "https://www.thejournal.ie/enoch-burke-washington-dc-6649478-Mar2025/",
    "timestamp": "2025-03-14T02:17:54Z"
  },
  {
    "title": "Dem Sen. Merkley: 'Now Is the Moment' to 'Take on Tyrant' Trump",
    "description": "Senator Jeff Merkley (D-OR) said Thursday on CNN's \"The Arena\" that his fellow Democrats need to \"take on\" President Donald Trump.\nThe post Dem Sen. Merkley: ‘Now Is the Moment’ to ‘Take on Tyrant’ Trump appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/03/13/dem-sen-merkley-now-is-the-moment-to-take-on-tyrant-trump/",
    "timestamp": "2025-03-14T02:16:26Z"
  },
  {
    "title": "Fox’s Jesse Watters Reveals Trump Cut Funding to His Sister’s Work: ‘My Mom’s Upset’",
    "description": "Fox News host Jesse Watters told viewers on Thursday night that spending cuts enacted by President Donald Trump have hit his sister's place of employment. \nThe post Fox’s Jesse Watters Reveals Trump Cut Funding to His Sister’s Work: ‘My Mom’s Upset’ first app…",
    "link": "https://www.mediaite.com/tv/foxs-jesse-watters-reveals-trump-cut-funding-to-his-sisters-work-my-moms-upset/",
    "timestamp": "2025-03-14T02:14:33Z"
  },
  {
    "title": "Schumer: Shutdown Would Let 'Vicious, Nasty' Musk and Trump Ruin Democracy",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) said Thursday on MSNBC's \"All In\" that the repercussions of shutting down the federal government would be worse than voting for the House funding bill.\nThe post Schumer: Shutdown Would Let ‘Vicious, Nasty’ Musk and …",
    "link": "https://www.breitbart.com/clips/2025/03/13/schumer-shutdown-would-let-vicious-nasty-musk-and-trump-ruin-democracy/",
    "timestamp": "2025-03-14T02:14:29Z"
  },
  {
    "title": "Tesla warns it could face retaliatory tariffs",
    "description": "Tesla has expressed concerns over potential retaliatory tariffs that could result from President Trump's aggressive use of tariffs. The company emphasizes the risk to U.S. exporters, particularly in the EV sector, and warns of the challenges in sourcing compo…",
    "link": "https://economictimes.indiatimes.com/news/international/business/tesla-warns-it-could-face-retaliatory-tariffs/articleshow/119000184.cms",
    "timestamp": "2025-03-14T02:13:59Z"
  },
  {
    "title": "North Carolina GOP town hall gets rowdy as attendees hurl scathing questions on Trump",
    "description": "Before answering an attendee's question about President Donald Trump's “destructive and disastrous trade war,” Rep. Chuck Edwards made a plea to the rowdy...",
    "link": "https://www.yahoo.com/news/north-carolina-gop-town-hall-021222462.html",
    "timestamp": "2025-03-14T02:12:22Z"
  },
  {
    "title": "Lawyer Who Defended Abortion Pills Under Biden Resigns as FDA Chief Counsel",
    "description": "In a pro-life victory, the lawyer who defended abortion pills in court for the Biden administration has resigned as Chief Counsel for the FDA. Acting general Sean Keveney in the Department of Health and Human Services (HHS) picked an attorney as the agency’s …",
    "link": "https://freerepublic.com/focus/f-chat/4304142/posts",
    "timestamp": "2025-03-14T02:11:59Z"
  },
  {
    "title": "Second Judge Orders Trump Administration To Rehire Probationary Workers Let Go In Mass Firings",
    "description": "A judge in Maryland has blocked for now the mass firings of probationary federal workers and ordered thousands of fired probationary workers to be reinstated, marking the second decision of its kind in a day.",
    "link": "https://www.huffpost.com/entry/us-mass-firings-judge-maryland_n_67d38ef9e4b036ac32ca064a",
    "timestamp": "2025-03-14T02:09:01Z"
  },
  {
    "title": "Undocumented migrants in terror on frontline of Trump sweep",
    "description": "by Romain FONSEGRIVESConstruction worker Maoro has lived happily in Colorado for almost four decades, but for the last month he has hardly left his house, afraid that US immigration officials will swoop and deport him.\"It's worse than a prison,\" the undocumen…",
    "link": "https://www.rawstory.com/undocumented-immigrants/",
    "timestamp": "2025-03-14T02:06:38Z"
  },
  {
    "title": "‘Slap In The Face’: Democrats Rage At Chuck Schumer After His Shutdown Fold",
    "description": "The Democrat-on-Democrat criticism of the Senate minority leader came from across the party’s ideological wings.",
    "link": "https://www.huffpost.com/entry/chuck-schumer-democrats-govt-shutdown_n_67d3879ae4b00eb3dcd205a0",
    "timestamp": "2025-03-14T02:05:46Z"
  },
  {
    "title": "President Putin officially agrees to a ceasefire with Ukraine thanks to Donald Trump",
    "description": "BREAKING  President Putin officially agrees to a ceasefire with Ukraine thanks to Donald Trump  Donald Trump has done the impossible and will go down in history as saving the World God Bless Trump",
    "link": "https://freerepublic.com/focus/f-news/4304139/posts",
    "timestamp": "2025-03-14T02:02:53Z"
  },
  {
    "title": "Amid Trump’s latest tariff threats the S&P 500 tumbles into correction territory just three weeks after smashing record highs",
    "description": "Amid Trump’s latest tariff threats, the S&P 500 tumbles into correction territory just three weeks after smashing record highs\nPresident Donald Trump answers reporters' questions hosting Irish Taoiseach Michael Martin\nChip Somodevilla—Getty Images",
    "link": "https://biztoc.com/x/9040d89644ae257f",
    "timestamp": "2025-03-14T02:02:41Z"
  },
  {
    "title": "Analysis-Donald Trump makes Chinese stocks (somewhat) great again",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0bd076b7-a168-40da-8d01-6175626e3e83",
    "timestamp": "2025-03-14T02:02:40Z"
  },
  {
    "title": "Shein CEO Says 'Zero Conversations' About Slashing $66B Valuation Ahead Of IPO, Backers Unfazed Amid Trump Tariff Woes",
    "description": "Donald Tang, the Executive Chair of Chinese fast-fashion retailer Shein, assured that the company is preparing for a London listing while dismissing concerns about the company’s valuation.\nWhat Happened: Shein initially planned a New York listing for late 202…",
    "link": "https://biztoc.com/x/804f3ac279e3932e",
    "timestamp": "2025-03-14T02:01:09Z"
  },
  {
    "title": "Is XRP About To Shock The Market? Analyst Says $110 Is Possible",
    "description": "Ripple’s XRP, one of the top-performing cryptos last year, is trading between $2.15 and $2.30. The token’s current price is a far cry from its 52-week high of $3.38 last January 17th, which was spurred by the industry’s excitement over US President Donald Tru…",
    "link": "http://www.newsbtc.com/altcoin/is-xrp-about-to-shock-the-market-analyst-says-110-is-possible/",
    "timestamp": "2025-03-14T02:00:33Z"
  },
  {
    "title": "Truth or dare: Close the deficit in clarity over the impact of Trump’s tariffs",
    "description": "The White House has been telling Americans that it’s taxing foreign exporters. However, tariffs hit the poor at home the hardest. America’s trade policy is evidently being packaged for a post-truth world.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariffs-karoline-leavitt-us-trade-war-maga-trade-policy-white-house-gst-direct-tax-indirect-tax-imports-11741896324410.html",
    "timestamp": "2025-03-14T02:00:05Z"
  },
  {
    "title": "US judges order Trump administration to reinstate thousands of fired workers",
    "description": "Federal judges in California and Maryland have ordered the Trump administration to reinstate thousands of probationary federal workers who were recently terminated in mass layoffs. The judges ruled that the government agencies violated regulations governing l…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-judges-order-trump-administration-to-reinstate-thousands-of-fired-workers/articleshow/118999924.cms",
    "timestamp": "2025-03-14T01:59:58Z"
  },
  {
    "title": "US transfers immigrants out of Guantanamo Bay to Louisiana as court weighs legality",
    "description": "Authorities have removed U.S. immigrants from detention facilities at Guantanamo Bay as a federal court in Washington weighs a challenge by civil rights advocates to holding immigrants at the offshore military station",
    "link": "https://abcnews.go.com/Politics/wireStory/us-transfers-immigrants-guantanamo-bay-louisiana-court-weighs-119779770",
    "timestamp": "2025-03-14T01:58:20Z"
  },
  {
    "title": "Stop the Radical Abortion Agenda in Wisconsin, Vote for Brad Schimel",
    "description": "The Wisconsin Supreme Court election on Tuesday, April 1, 2025 is drawing national attention. The race will provide the first statewide test of voter sentiment since Donald Trump narrowly carried the crucial battleground (0.86% margin of victory) in November.…",
    "link": "https://freerepublic.com/focus/f-news/4304136/posts",
    "timestamp": "2025-03-14T01:57:48Z"
  },
  {
    "title": "Newsmax Agreed To Pay $40 Million To Settle Smartmatic’s Defamation Lawsuit",
    "description": "Newsmax paid $40 million to settle election systems company Smartmatic’s defamation lawsuit last year, according a recent regulatory filing made by the media outlet. When the settlement was announced last year, just days before a trial was to start, the terms…",
    "link": "http://deadline.com/2025/03/newsmax-smartmatic-settlement-trump-1236326208/",
    "timestamp": "2025-03-14T01:57:09Z"
  },
  {
    "title": "All eyes on Democrats as US barrels toward shutdown deadline",
    "description": "WASHINGTON: The United States government, already shaken by Donald Trump's radical reforms, could begin shutting down entirely this weekend as Democrats grapple with the politically risky option of opposing the president's federal funding plans. With a Friday…",
    "link": "https://www.channelnewsasia.com/world/united-states-trump-democrats-government-shutdown-senate-house-4999811",
    "timestamp": "2025-03-14T01:57:00Z"
  },
  {
    "title": "UAE Official to Press US on Ability to Buy More Nvidia AI Chips",
    "description": "A top UAE official plans to visit Washington to press for easier access to American technology and discuss investment in the US, according to people familiar with the matter, seeking to sway the Trump administration on export controls governing the advanced s…",
    "link": "https://www.livemint.com/companies/news/uae-official-to-press-us-on-ability-to-buy-more-nvidia-ai-chips-11741917415173.html",
    "timestamp": "2025-03-14T01:56:54Z"
  },
  {
    "title": "AOC Rages at Democrats for 'Betrayal' Amid Government Shutdown Talks",
    "description": "The New York congresswoman said it was \"unthinkable\" for Senate Democrats to hand away leverage on Medicare, Medicaid and Social Security.",
    "link": "https://www.newsweek.com/alexandria-ocasio-cortez-democrats-government-shutdown-2044648",
    "timestamp": "2025-03-14T01:55:41Z"
  },
  {
    "title": "Judge orders thousands of probationary employees fired by Trump be reinstated",
    "description": "U.S. District Judge James Bredar granted a temporary restraining order against numerous agencies and departments affected by the administration's reduction in workforce efforts.",
    "link": "https://www.nbcnews.com/politics/trump-administration/judge-orders-thousands-probationary-employees-fired-trump-reinstated-rcna196366",
    "timestamp": "2025-03-14T01:55:12Z"
  },
  {
    "title": "Josh Hawley Says It’s Time To Pull Strings On Universities Abusing Taxpayer Dollars Against Jewish Students",
    "description": "Josh Hawley said on Fox News Thursday that it is time to pull strings on universities that misuse taxpayer dollars to discriminate against Jewish students.",
    "link": "https://dailycaller.com/2025/03/13/josh-hawley-universities-jewish-students/",
    "timestamp": "2025-03-14T01:52:35Z"
  },
  {
    "title": "Senate Dems brace to vote for a bill they hate — to block Elon Musk",
    "description": "Senate Democrats appear poised to vote for a spending bill they hate to avoid a worse fate: Allowing a government shutdown that could enable President Donald Trump and Elon Musk to make deeper cuts to federal agencies. \nThe announcement late Thursday by Senat…",
    "link": "https://biztoc.com/x/b365fd19181661e5",
    "timestamp": "2025-03-14T01:50:41Z"
  },
  {
    "title": "Trump's Irish golf course vandalized by pro-Palestinian group days after Scottish course marked",
    "description": "Donald Trump's Irish golf course was attacked by pro-Palestinian vandals on Wednesday, after his Scottish course was targeted on Saturday.",
    "link": "https://www.jpost.com/international/article-846043",
    "timestamp": "2025-03-14T01:50:32Z"
  },
  {
    "title": "Popular clothing company won't raise prices amid tariffs",
    "description": "In February, President Donald Trump announced he would implement a 25% additional tariff on all goods imported into the U.S. from Canada and Mexico, a 10% tariff on China, and a 10% levy just announced a few weeks ago.\n⏰Get expert insights and actionable trad…",
    "link": "https://biztoc.com/x/132ed24cea52146c",
    "timestamp": "2025-03-14T01:50:05Z"
  },
  {
    "title": "4 ASX All Ords stocks shrugging off the looming 2025 market correction and charging higher",
    "description": "If the ASX All Ords enters a 2025 market correction, don’t blame these soaring stocks!\nThe post 4 ASX All Ords stocks shrugging off the looming 2025 market correction and charging higher appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/03/14/4-asx-all-ords-stocks-shrugging-off-the-looming-2025-market-correction-and-charging-higher/",
    "timestamp": "2025-03-14T01:49:10Z"
  },
  {
    "title": "Top US university John Hopkins says ending 2,000 positions due to Donald Trump cuts",
    "description": "Johns Hopkins University is laying off over 2,000 employees due to significant cuts in foreign aid funding by the Trump administration. This reduction has a major impact on several key programs including the university's medical school, public health school, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/top-us-university-john-hopkins-says-ending-2000-positions-due-to-donald-trump-cuts/articleshow/118999661.cms",
    "timestamp": "2025-03-14T01:47:19Z"
  },
  {
    "title": "Samsung SDI to Sell $1.4 Billion Shares for Battery Plants",
    "description": "Samsung SDI Co. will raise 2 trillion won ($1.4 billion) selling new shares to fund investments in US and European facilities, as the South Korean battery maker bets on long-term growth of the electric-vehicle industry.",
    "link": "https://financialpost.com/pmn/business-pmn/samsung-sdi-to-sell-1-4-billion-shares-for-battery-plants",
    "timestamp": "2025-03-14T01:46:25Z"
  },
  {
    "title": "G7 seeks unity as Trump's tariffs, Ukraine stance weighs on ties",
    "description": "Diplomats from G7 nations are negotiating a joint statement in Canada to present a united front amidst tensions with President Trump over his disruptive trade and security policies. Discussions include Ukraine's ceasefire, U.S. tariffs, responses to Russia an…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g7-seeks-unity-as-trumps-tariffs-ukraine-stance-weighs-on-ties/articleshow/118999618.cms",
    "timestamp": "2025-03-14T01:44:54Z"
  },
  {
    "title": "Donald Trump's Fall in Polls Is Accelerating, Nate Silver Warns",
    "description": "Pollster Nate Silver finds the president's approval rating in a steady decline.",
    "link": "https://www.newsweek.com/donald-trumps-fall-polls-accelerating-nate-silver-warns-2044643",
    "timestamp": "2025-03-14T01:44:26Z"
  },
  {
    "title": "Trump's ambassador pick to press Japan to spend more to host U.S. troops",
    "description": "The remarks by George Glass were the latest volley from the Trump administration to target Japan, following comments by other nominees for top posts — and the president himself.",
    "link": "https://www.japantimes.co.jp/news/2025/03/14/japan/politics/george-glass-us-japan-ambassador-cost-sharing/",
    "timestamp": "2025-03-14T01:43:00Z"
  },
  {
    "title": "White House Instructs Agencies To Avoid Firing Cybersecurity Staff",
    "description": "The White House is urging federal agencies to refrain from laying off their cybersecurity teams, as they scramble to comply with a Thursday deadline to submit mass layoff plans to slash their budgets, according to an email seen by Reuters.",
    "link": "https://www.ndtv.com/world-news/white-house-instructs-agencies-to-avoid-firing-cybersecurity-staff-7920274",
    "timestamp": "2025-03-14T01:42:16Z"
  },
  {
    "title": "S&P 500 slides into correction territory as Trump trade wars spook investors",
    "description": "The S&P 500, a key US stock market index, closed in correction territory on Thursday as the volatility of Donald Trump’s trade wars rattled investors.\nThe index closed more than 10% down from its 19 February peak as Wall Street approaches the end of a second …",
    "link": "https://biztoc.com/x/2c6a09989653c23b",
    "timestamp": "2025-03-14T01:41:53Z"
  },
  {
    "title": "American Airlines jet burns as passengers evacuate onto wing",
    "description": "Footage shows passengers huddled on the wing of the commercial airliner, which was on the tarmac, as flames burn under the aircraft.",
    "link": "https://www.bbc.co.uk/news/articles/c981j6e34wwo",
    "timestamp": "2025-03-14T01:37:01Z"
  },
  {
    "title": "Meta says it’s almost ready to start testing Community Notes",
    "description": "Meta Platforms Inc., parent company of Facebook, Instagram, and Threads, announced today that it will begin testing its crowd-sourced fact-checking program, Community Notes, on March 18. The old system of third-party fact-checking has been with the company si…",
    "link": "https://siliconangle.com/2025/03/13/meta-says-almost-ready-start-testing-community-notes/",
    "timestamp": "2025-03-14T01:35:21Z"
  },
  {
    "title": "'Hard To Comprehend': Sean Hannity Rips 'Skittish' Markets For Dropping On Trump's Watch",
    "description": "Hannity questioned why Wall Street isn't in step with the president's \"thinking.\"",
    "link": "https://www.huffpost.com/entry/sean-hannity-donald-trump-stock-market-plunging_n_67d36e2be4b00eb3dcd20131",
    "timestamp": "2025-03-14T01:31:07Z"
  },
  {
    "title": "US Should Fund Bitcoin Buys With $2 Trillion Bit Bonds, Says Newmarket CEO",
    "description": "In a keynote speech at the Bitcoin For America event hosted by the Bitcoin Policy Institute (BPI) on March 11, Andrew Hohns, CEO of Newmarket Capital, laid out a thought experiment for a new type of treasury instrument he calls “Bit Bonds.” Hohns presented a …",
    "link": "https://bitcoinist.com/us-should-fund-bitcoin-buys-2-trillion-bit-bonds/",
    "timestamp": "2025-03-14T01:30:34Z"
  },
  {
    "title": "Tiger Woods moves even closer to Donald Trump and shocks the golf world with new romantic relationship",
    "description": "It&apos;s a trying time in Tiger Woods&apos; life at the moment. On the personal side, Woods has been dealing with the death of his mother, Kultida Woods, who passed away at the ag",
    "link": "https://www.marca.com/en/golf/2025/03/14/67d3832e46163fcb998b457f.html",
    "timestamp": "2025-03-14T01:30:02Z"
  },
  {
    "title": "DOJ official says she was fired after opposing the restoration of Mel Gibson's gun rights",
    "description": "The former U.S. pardon attorney, Elizabeth G. Oyer, was terminated Friday after she opposed restoring actor Mel Gibson’s rights to carry a gun, her spokesperson and two Justice Department officials familiar with the matter told NBC News. A spokesperson for Oy…",
    "link": "https://freerepublic.com/focus/f-news/4304132/posts",
    "timestamp": "2025-03-14T01:29:13Z"
  },
  {
    "title": "OpenAI calls on Trump to eliminate restrictions on the AI industry",
    "description": "OpenAI has submitted a lengthy proposal to the U.S. government, aiming to influence its upcoming AI Action Plan, a strategy report that many believe will guide President Donald Trump’s policy on artificial intelligence technology. The proposal from America’s …",
    "link": "https://siliconangle.com/2025/03/13/openai-calls-trump-eliminate-restrictions-ai-industry/",
    "timestamp": "2025-03-14T01:29:03Z"
  },
  {
    "title": "​Vance loudly booed for 30 seconds straight by Kennedy Center crowd",
    "description": "Vice President JD Vance recently got an icy reception at the Kennedy Center for the Performing Arts after attendees spotted him sitting down in a VIP box with Second Lady Usha Vance.Guardian reporter Andrew Roth tweeted a video of the second couple entering t…",
    "link": "https://www.rawstory.com/kennedy-center-2671325629/",
    "timestamp": "2025-03-14T01:28:26Z"
  },
  {
    "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
    "description": "The president once derided attempts to develop new green technology as a \"green new scam\" - but his deal could help boost the US's potential in the sector",
    "link": "https://www.bbc.com/news/articles/c30mjedjzgpo",
    "timestamp": "2025-03-14T01:26:54Z"
  },
  {
    "title": "Trump confident US will annex Greenland, says NATO chief Rutte could be \"instrumental\"",
    "description": "US President Donald Trump has once again floated the idea of annexing Greenland, suggesting that NATO could play a role in the acquisition. His remarks have drawn sharp criticism from Greenland’s leaders, who are focused on securing independence from Denmark …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-confident-us-will-annex-greenland-says-nato-chief-rutte-could-be-instrumental/articleshow/118999227.cms",
    "timestamp": "2025-03-14T01:24:02Z"
  },
  {
    "title": "網傳「中國學生劉麗君簽證被撤銷及逮捕」說法並無根據",
    "description": "內容: \r\n媒體\r\n自由標籤: \r\n中國\r\n留學生\r\n美國簽證\r\n摘要\r\n\n＊2025年1月底，網上流傳「中國學生劉麗君簽證被撤銷及逮捕」，並附上一名亞裔示威者被捕的影片。\n＊經查證，有關影片為2024年5月2日UCLA示威被清場的新聞影片，並非2025年逮捕片段。\n＊稱片中亞裔示威者為「中國學生劉麗君」及關於其身份的說法可追溯至2024年5月4日在X上流傳的帖文，惟有關帖文無提供證據，僅得一張疑似社交媒體留言截圖。\n＊從有關帖文判斷，說法或來自中國的社交媒體，惟現時已無法找到出處。\n＊根據南加州大學學生媒體《A…",
    "link": "https://www.inmediahk.net/node/%E5%AA%92%E9%AB%94/%E7%B6%B2%E5%82%B3%E3%80%8C%E4%B8%AD%E5%9C%8B%E5%AD%B8%E7%94%9F%E5%8A%89%E9%BA%97%E5%90%9B%E7%B0%BD%E8%AD%89%E8%A2%AB%E6%92%A4%E9%8A%B7%E5%8F%8A%E9%80%AE%E6%8D%95%E3%80%8D%E8%AA%AA%E6%B3%95%E4%B8%A6%E7%84%A1%E6%A0%B9%E6%93%9A",
    "timestamp": "2025-03-14T01:22:58Z"
  },
  {
    "title": "Americans worry Trump is too closely aligned with Russia, poll finds",
    "description": "The two-day poll also found little appetite among Americans for Trump's expansionist agenda.",
    "link": "https://www.japantimes.co.jp/news/2025/03/14/world/politics/trump-russia-closeness-poll/",
    "timestamp": "2025-03-14T01:20:00Z"
  },
  {
    "title": "Trump seeks ‘military options’ to control Panama Canal – media",
    "description": "President Donald Trump has reportedly directed the US military to develop plans to secure American access to the Panama Canal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614187-trump-panama-military-options/",
    "timestamp": "2025-03-14T01:18:22Z"
  },
  {
    "title": "Ocasio-Cortez mobilizes Democrats against Schumer plan as colleagues privately urge her to consider primary challenge | CNN Politics",
    "description": "Rep. Alexandria Ocasio-Cortez said Thursday that she plans to mobilize her massive base of followers to oppose what she described as an “acquiesce” by Senate Minority Leader Chuck Schumer to accept the House GOP funding bill.",
    "link": "https://www.cnn.com/2025/03/13/politics/ocasio-cortez-schumer-democratic-shutdown-plan/index.html",
    "timestamp": "2025-03-14T01:15:15Z"
  },
  {
    "title": "Ocasio-Cortez mobilizes Democrats against Schumer plan as colleagues privately urge her to consider primary challenge",
    "description": "Rep. Alexandria Ocasio-Cortez said Thursday that she plans to mobilize her massive base of followers to oppose what she described as an “acquiesce” by Senate...",
    "link": "https://www.cnn.com/2025/03/13/politics/ocasio-cortez-schumer-democratic-shutdown-plan?cid=external-feeds_iluminar_yahoo",
    "timestamp": "2025-03-14T01:15:15Z"
  },
  {
    "title": "Politics\n‘God used Donald Trump to save me’: Ex-Tenn. senator gets pardon 15 days after entering prison",
    "description": "President Donald Trump issued a pardon to former Tennessee state Sen. Brian Kelsey, just 15 days after that Republican began serving a 21-month prison sentence for a campaign finance conspiracy criminal conviction. “God used Donald Trump to save me,” Kelsey, …",
    "link": "https://freerepublic.com/focus/f-news/4304130/posts",
    "timestamp": "2025-03-14T01:13:26Z"
  },
  {
    "title": "Tiger Woods' New Girlfriend Answers a Lot of Questions",
    "description": "Tiger Woods has been abnormally close to the Trump family lately, to the point where he recently attended a golf tournament with Kai Trump. Well, there's a good reason for that: Tiger is reportedly dating Vanessa Trump, Kai's mom and...\nRead more...",
    "link": "https://www.pajiba.com/pajiba_love/tiger-woods-new-girlfriend-answers-a-lot-of-questions.php",
    "timestamp": "2025-03-14T01:10:36Z"
  },
  {
    "title": "‘Sorry’: Chuck Schumer Apologizes After Calling Republicans ‘Bastards’ on MSNBC",
    "description": "Senate minority leader Chuck Schumer apologized on Thursday after he referred to Republicans as \"bastards\" live on MSNBC. \nThe post ‘Sorry’: Chuck Schumer Apologizes After Calling Republicans ‘Bastards’ on MSNBC first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/sorry-chuck-schumer-apologizes-after-calling-republicans-bastards-on-msnbc/",
    "timestamp": "2025-03-14T01:10:13Z"
  },
  {
    "title": "Trump salutes ‘fearless’ military, police dogs on K-9 Veterans Day: 'canine courage'",
    "description": "President Donald Trump on Thursday saluted the heroic canines who \"defend our citizens and our homeland.\"",
    "link": "https://www.foxnews.com/politics/trump-salutes-fearless-military-police-dogs-k-9-veterans-day-canine-courage",
    "timestamp": "2025-03-14T01:10:11Z"
  }
]