[
  {
    "title": "Moore: Trump Should Index the Capital Gains Tax for Inflation",
    "description": "President Donald Trump should follow up on his historic \"big, beautiful\" tax bill with an extra booster shot for the economy by immediately indexing the capital gains taxes for inflation.",
    "link": "https://www.bostonherald.com/2025/07/20/moore-trump-should-index-the-capital-gains-tax-for-inflation/",
    "timestamp": "2025-07-20T08:46:46Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
    "description": "The Indian market closed lower on Friday, weighed down by broad-based selling and weak earnings in key sectors. Out of 4,208 stocks on the BSE, 2,394 declined amid bearish sentiment. Stocks like DB Realty, Axis Bank, and Alok Industries saw sharp selling pres…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/122795428.cms",
    "timestamp": "2025-07-20T08:43:26Z"
  },
  {
    "title": "Soothers with choking-hazards, sunglasses with no UV filters: McGrath shocked by dangers of some Shein, Temu goods",
    "description": "EU justice commissioner has vowed to crack down on the sale of goods that blatantly break the law",
    "link": "https://www.irishtimes.com/world/europe/2025/07/20/soothers-with-choking-hazards-sunglasses-with-no-uv-filters-raincoats-with-toxic-chemicals-mcgrath-shocked-by-dangers-of-some-shein-temu-goods/",
    "timestamp": "2025-07-20T08:36:32Z"
  },
  {
    "title": "Israel seeking US help to realize Gaza 'relocation' scheme: Report",
    "description": "The Israeli regime has reportedly asked the United States to help it realize its so-called plan to bring about \"relocation\" of the Gaza Strip's population to other countries.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250719-presstv08.htm",
    "timestamp": "2025-07-20T08:35:09Z"
  },
  {
    "title": "Trump Threatens to Destroy New Iran Nuclear Objects",
    "description": "On the social network Truth Social, US President Donald Trump said he would blast any new facilities if they were built.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250719-sputnik02.htm",
    "timestamp": "2025-07-20T08:33:46Z"
  },
  {
    "title": "Manu Joseph: Why there’s a difference between power and influence",
    "description": "Influence operates like a currency in a market but power flows from popular misconceptions. Trump’s America has plenty to learn from third-world countries, especially its billionaires who mix up the two.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-elon-musk-jack-ma-putin-mohammed-bin-salman-america-billionaires-authoritarian-democracy-judiciary-oligarch-11752838388647.html",
    "timestamp": "2025-07-20T08:30:10Z"
  },
  {
    "title": "Kremlin shrugs off new EU sanctions, citing Russia's built-up immunity",
    "description": "Russia says it has developed a degree of resilience to Western sanctions and learned to adapt, following the EU's 18th round of punitive measures targeting Moscow's oil industry.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/07/russia-250719-presstv01.htm",
    "timestamp": "2025-07-20T08:28:14Z"
  },
  {
    "title": "Ukraine's Zelensky seeks cease-fire meeting next week",
    "description": "Washington DC (UPI) Jul 19, 2025 \n\n\n Ukrainian President Volodymyr Zelensky wants cease-fire negotiations with Russia next week and said he would be willing to meet directly and Russian President Vladimir Putin. \n Ukrainian officials have proposed cease-fire …",
    "link": "https://www.spacewar.com/reports/Ukraines_Zelensky_seeks_cease-fire_meeting_next_week_999.html",
    "timestamp": "2025-07-20T08:27:34Z"
  },
  {
    "title": "Ex-U.S. admiral praises Taiwan's mobilization of reservists in Han Kuang drills",
    "description": "A retired U.S. Navy rear admiral on Friday praised Taiwan for mobilizing more than 20,000 reservists in its annual Han Kuang military exercises this year.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250719-cna02.htm",
    "timestamp": "2025-07-20T08:26:34Z"
  },
  {
    "title": "How Trump’s trade tariffs could affect the cost of coffee in the US – visualized | CNN Business",
    "description": "America’s love for coffee has made the dark brewed beverage the most popular drink in the country. Here’s a look at US coffee-drinking habits and why your cup of coffee could be more expensive very soon, if Trump goes ahead with his latest tariff plan.",
    "link": "https://www.cnn.com/2025/07/20/business/us-coffee-prices-doubled-tariffs-hk-vis",
    "timestamp": "2025-07-20T08:26:28Z"
  },
  {
    "title": "Nearly 400 Drones, Missiles Fired At Ukraine As Russia Shows No Signs Of Let-Up",
    "description": "Russian drones and missiles hammered the Black Sea port of Odesa and other Ukrainian towns and cities, killing at least one person and wounding others, emergency officials said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250719-rferl02.htm",
    "timestamp": "2025-07-20T08:25:52Z"
  },
  {
    "title": "Rahul Gandhi speaks like \"Leader of Pakistan,\" says BJP national spokesperson CR Kesavan",
    "description": "Bharatiya Janata Party leader CR Kesavan criticized Rahul Gandhi for his remarks. Kesavan alleged that Gandhi's statements supported a pro-Pakistan agenda. He claimed Gandhi questioned Prime Minister Narendra Modi about Donald Trump's claims. Kesavan stated G…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/rahul-gandhi-speaks-like-leader-of-pakistan-says-bjp-national-spokesperson-cr-kesavan/articleshow/122795197.cms",
    "timestamp": "2025-07-20T08:06:45Z"
  },
  {
    "title": "5 suspiciously good cartoons about the Epstein files",
    "description": "Political cartoonists take on the relationship between Donald Trump and Jeffrey Epstein.",
    "link": "https://theweek.com/cartoons/cartoons-donald-trump-epstein-files",
    "timestamp": "2025-07-20T08:02:00Z"
  },
  {
    "title": "Trump is slashing public radio funding. Here's why it will hit rural communities hardest",
    "description": "Gwen Johnson of Jackhorn, Ky., isn't one to hit snooze after being awoken by public radio, as listening to FM through the day has always comforted her. Now, however, stations like the ones the 67-year-old enjoys are set to lose financial support as the Trump …",
    "link": "https://www.cbc.ca/news/world/trump-public-broadcasting-cuts-rural-communities-1.7587683",
    "timestamp": "2025-07-20T08:00:00Z"
  },
  {
    "title": "Digital contracts are the norm today. Is there still power in a written signature?",
    "description": "These days, it's far more common for most of us to sign our names on a touch screen, or to simply click a box on an online form, than to sign your name with a pen on paper.",
    "link": "https://www.cbc.ca/radio/sunday/electronic-signatures-human-experience-1.7584925",
    "timestamp": "2025-07-20T08:00:00Z"
  },
  {
    "title": "Barack Obama-Michelle finally address divorce rumours: 'There hasn’t been one moment in our marriage...'",
    "description": "Former President Barack Obama and Michelle Obama brushed off recent divorce rumors on an episode of her podcast. The former first lady asserted \"there hasn't been one moment in our marriage where I thought about quitting my man.\" The Obamas had faced increase…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barack-obama-michelle-finally-address-divorce-rumours-there-hasnt-been-one-moment-in-our-marriage-/articleshow/122795009.cms",
    "timestamp": "2025-07-20T07:50:36Z"
  },
  {
    "title": "Top Hegseth aide Justin Fulcher resigns from Pentagon after 6 months of service: ‘Incredibly inspiring’",
    "description": "Justin Fulcher announced his departure Saturday afternoon in a message posted to X.",
    "link": "https://nypost.com/2025/07/20/us-news/top-hegseth-aide-justin-fulcher-resigns-from-pentagon-after-6-months-of-service-incredibly-inspiring/",
    "timestamp": "2025-07-20T07:36:37Z"
  },
  {
    "title": "Jon Jones Confident He'll Fight At Trump's White House UFC Event, 'Strong Feeling'",
    "description": "Jon Jones is confident he'll be fighting at Donald Trump's White House UFC event whenever it goes down ... telling TMZ Sports on Thursday he's got \"a very strong feeling\" he'll be on the historic card. Of course, the shindig doesn't have an…\n Permalink",
    "link": "https://www.tmz.com/2025/07/20/jon-jones-talks-return-trump-white-house-ufc-event/",
    "timestamp": "2025-07-20T07:25:28Z"
  },
  {
    "title": "Trump once hosted party for 'young women' where Epstein was the only guest, says report (Graeme Massie/The Independent)",
    "description": "Graeme Massie / The Independent:\nTrump once hosted party for ‘young women’ where Epstein was the only guest, says report  —  President under pressure to release all files related to his former friend Epstein  —  Donald Trump once hosted a party with “young wo…",
    "link": "https://www.memeorandum.com/250720/p3",
    "timestamp": "2025-07-20T07:25:00Z"
  },
  {
    "title": "The ideology behind the ‘New America’ is more dangerous than it looks",
    "description": "The superhumans are coming – and so is the danger Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621702-ideology-behind-new-america/",
    "timestamp": "2025-07-20T07:11:29Z"
  },
  {
    "title": "Trump diagnosed with chronic venous insufficiency - what are the symptoms and how is it treated?",
    "description": "US President Donald Trump has been diagnosed with chronic venous insufficiency, the White House has confirmed.",
    "link": "https://news.sky.com/story/what-is-chronic-venous-insufficiency-symptoms-and-treatment-after-trump-diagnosed-13399152",
    "timestamp": "2025-07-20T07:08:00Z"
  },
  {
    "title": "Who dares to defy Trump? Why the world is haunted by this White House",
    "description": "Donald Trump's unpredictable leadership style has created global uncertainty, impacting international relations and economic stability. His policy shifts, driven by personal whims, leave nations and corporations struggling to adapt. Trump's protectionist trad…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-dares-to-defy-trump-why-the-world-is-haunted-by-this-white-house/articleshow/122794607.cms",
    "timestamp": "2025-07-20T07:04:39Z"
  },
  {
    "title": "Tulsi Gabbard calls for Obama to be prosecuted over 2016 election claims",
    "description": "Tulsi Gabbard, the director of national intelligence, has called for Barack Obama and former senior US national security officials to be prosecuted after accusing them of a “treasonous conspiracy” intended to show that Donald Trump’s 2016 presidential electio…",
    "link": "https://freerepublic.com/focus/f-news/4329696/posts",
    "timestamp": "2025-07-20T07:03:37Z"
  },
  {
    "title": "US Banking Associations Oppose License For Crypto Custody Firms – Details",
    "description": "Several US banking associations have pushed against the issuance of a banking license to crypto custody firms, citing a need for public input in such a change in industry policy, among other reasons. This development comes as the cryptocurrency industry conti…",
    "link": "https://bitcoinist.com/us-banks-against-license-crypto-custody-firms/",
    "timestamp": "2025-07-20T07:00:54Z"
  },
  {
    "title": "How Meghan Markle's US Popularity Compares to Royals",
    "description": "Meghan Markle's popularity with the American public has been a roller-coaster ride during her five years back in America.",
    "link": "https://www.newsweek.com/meghan-markle-us-popularity-royals-polling-2097035",
    "timestamp": "2025-07-20T07:00:01Z"
  },
  {
    "title": "FPIs exit secondary market in July, but stay active in IPOs. What’s fueling the shift?",
    "description": "Foreign portfolio investors (FPIs) have turned net sellers in India’s secondary markets in July, offloading over Rs 10,000 crore in equities amid valuation concerns and underperformance. However, their primary market investments remain strong, indicating a sh…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-exit-secondary-market-in-july-but-stay-active-in-ipos-whats-fueling-the-shift/articleshow/122794621.cms",
    "timestamp": "2025-07-20T06:59:36Z"
  },
  {
    "title": "Trump sues Wall Street Journal for libel after Epstein birthday letter story (Emily Hallas/Washington Examiner)",
    "description": "Emily Hallas / Washington Examiner:\nTrump sues Wall Street Journal for libel after Epstein birthday letter story  —  President Donald Trump on Friday filed a lawsuit against the Wall Street Journal and related parties for publishing a story regarding his rela…",
    "link": "https://www.memeorandum.com/250720/p2",
    "timestamp": "2025-07-20T06:55:07Z"
  },
  {
    "title": "Ukraine proposes fresh peace talks with Russia next week",
    "description": "Kiev has proposed to Moscow a new round of peace talks next week, Ukraine's President Volodymyr Zelensky said Saturday, hours after Russian strikes across Ukraine claimed more lives.",
    "link": "https://www.hurriyetdailynews.com/ukraine-proposes-fresh-peace-talks-with-russia-next-week-211649",
    "timestamp": "2025-07-20T06:49:12Z"
  },
  {
    "title": "\"Continuous failure has plunged Rahul Gandhi into an abyss of ideological emptiness\": Dharmendra Pradhan",
    "description": "Dharmendra Pradhan attacked Rahul Gandhi. He accused Gandhi of tarnishing India's image. Pradhan cited Gandhi's remarks favoring Pakistan. He also mentioned Gandhi promoting other countries' narratives. Pradhan called Gandhi the most unsuccessful leader. He s…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/continuous-failure-has-plunged-rahul-gandhi-into-an-abyss-of-ideological-emptiness-dharmendra-pradhan/articleshow/122794555.cms",
    "timestamp": "2025-07-20T06:49:05Z"
  },
  {
    "title": "Indonesia not taking anti-West stance after joining BRICS: Deputy FM",
    "description": "Deputy Foreign Minister Arif Havas Oegroseno emphasized that Indonesia is not taking an anti-West stance after joining BRICS, an economic cooperation group ...",
    "link": "https://en.antaranews.com/news/367609/indonesia-not-taking-anti-west-stance-after-joining-brics-deputy-fm",
    "timestamp": "2025-07-20T06:45:37Z"
  },
  {
    "title": "Only one in six Italians ready to fight – survey",
    "description": "A poll has found that most Italian citizens would avoid combat, as the EU pushes militarization Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621711-only-1-in-6-italians/",
    "timestamp": "2025-07-20T06:29:18Z"
  },
  {
    "title": "Crypto sector breaches $4 trillion in market value during pivotal week",
    "description": "The crypto sector's market value hit $4 trillion on Friday, according to CoinGecko, marking a milestone that reflects its shift from a nascent asset class to a central part of the global investment landscape.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/crypto-sector-breaches-4-trillion-in-market-value-during-pivotal-week/articleshow/122794298.cms",
    "timestamp": "2025-07-20T06:17:12Z"
  },
  {
    "title": "Cliff Taylor: We need to face up to the fact that not all middle-earners are squeezed",
    "description": "Here’s what to look out for next week as the Government signals its big budget moves",
    "link": "https://www.irishtimes.com/opinion/2025/07/20/cliff-taylor-we-need-to-face-up-to-the-fact-that-not-all-middle-earners-are-squeezed/",
    "timestamp": "2025-07-20T06:07:00Z"
  },
  {
    "title": "What you need to know about Jensen Huang, the AI visionary in a leather jacket",
    "description": "Wildly popular yet unassuming, he was shaped by his tough education in the US. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/what-you-need-to-know-about-jensen-huang-the-ai-visionary-in-a-leather-jacket",
    "timestamp": "2025-07-20T06:04:40Z"
  },
  {
    "title": "Can the West force Russia to stop its war in Ukraine?",
    "description": "Monday's announcement by US President Donald Trump that Russia needs to halt its war within 50 days or face heavy sanctions was the clearest indication yet that he and his administration have lost patience with Moscow.",
    "link": "https://www.rte.ie/news/2025/0720/1524203-can-the-west-force-russia-to-stop-its-war-in-ukraine/",
    "timestamp": "2025-07-20T06:00:16Z"
  },
  {
    "title": "Elon Musk's America Party: a billionaire's folly?",
    "description": "One-time Trump ally has acquired a taste for political power and clearly wants more of it",
    "link": "https://theweek.com/politics/elon-musks-america-party-a-billionaires-folly",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Trump says he has no plans to fire Fed Chair Powell",
    "description": "President Donald Trump said it is “highly unlikely” he will fire Fed Chair Jerome Powell, walking back from private discussions the night before where he appeared open to the idea. At a White House meeting on July 15, Trump discussed the “concept” of removing…",
    "link": "https://www.naturalnews.com/2025-07-20-trump-has-no-plans-to-fire-powell.html",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Health Ranger Report: Seth Holehouse on the AI arms race and navigating the future",
    "description": "DeepSeek, a powerful Chinese open-source AI model, has been released for free – raising questions about China’s motives. While some see it as a goodwill gesture, others suspect it’s part of a strategic move in the AI arms race, potentially undermining U.S. te…",
    "link": "https://www.naturalnews.com/2025-07-20-seth-holehouse-ai-arms-race-navigating-future.html",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Federal appeals court upholds Arkansas ban on Critical Race Theory in classrooms",
    "description": "The 8th U.S. Circuit Court of Appeals ruled that Arkansas can enforce its ban on critical race theory in public school classrooms, stating the First Amendment does not grant students the right to demand specific curriculum content. The court vacated a previou…",
    "link": "https://www.naturalnews.com/2025-07-20-federal-appeals-court-upholds-arkansas-ban-crt.html",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Trump signs HALT Fentanyl Act into law",
    "description": "President Donald Trump signed the HALT Fentanyl Act on July 16, permanently classifying fentanyl analogues as Schedule I substances, which carry the harshest federal penalties. The bipartisan legislation, led by Sen. Chuck Grassley (R-IA), targets traffickers…",
    "link": "https://www.naturalnews.com/2025-07-20-trump-signs-halt-fentanyl-act-into-law.html",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Border security works: Illegal crossings hit RECORD LOW for second straight month",
    "description": "Illegal border crossings hit a record low for the second straight month, with only 25,228 nationwide encounters in June – the lowest ever recorded. Apprehensions also dropped sharply, including a single-day low of 136 arrests. President Donald Trump’s executi…",
    "link": "https://www.naturalnews.com/2025-07-20-illegal-crossings-record-low-second-straight-month.html",
    "timestamp": "2025-07-20T06:00:00Z"
  },
  {
    "title": "Obama, Russia, and a coup? Tulsi Gabbard claims plot to derail Donald Trump’s 2016 win",
    "description": "Director of National Intelligence Tulsi Gabbard has accused top officials from the Obama administration of orchestrating a conspiracy to discredit Donald Trump's 2016 election win. Based on newly declassified documents, Gabbard claims intelligence was politic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/obama-russia-and-a-coup-dni-tulsi-gabbard-claims-plot-to-derail-donald-trumps-2016-win/articleshow/122793534.cms",
    "timestamp": "2025-07-20T05:51:26Z"
  },
  {
    "title": "Getting off US tech: a guide - by Paris Marx - Disconnect",
    "description": "I’m in the process of dropping US tech services. Here’s how I did it, and options you should consider.",
    "link": "https://www.disconnect.blog/p/getting-off-us-tech-a-guide",
    "timestamp": "2025-07-20T05:47:01Z"
  },
  {
    "title": "The Oligarchs' Coup Against the Free Press Is Happening Now",
    "description": "The American information space is not merely changing; it is undergoing a hostile takeover. It is a deliberate, coordinated campaign by a new class of oligarchs out of Silicon Valley that includes Jeff Bezos, Elon Musk, Larry Ellison, and Mark Zuckerberg acti…",
    "link": "https://www.thedissident.news/the-oligarchs-coup-against-the-free-press-is-happening-now/",
    "timestamp": "2025-07-20T05:47:01Z"
  },
  {
    "title": "Zelenskyy proposes new round of peace talks to Moscow",
    "description": "Kyiv’s offer comes as fresh Russian strikes across Ukraine killed three people.",
    "link": "https://www.euractiv.com/section/politics/news/zelenskyy-proposes-new-round-of-peace-talks-to-moscow/",
    "timestamp": "2025-07-20T05:41:57Z"
  },
  {
    "title": "Global week ahead: Banking bellwethers and a tariffs waiting game",
    "description": "From Frankfurt to Milan, and Paris to London, next week it's all about the banks.",
    "link": "https://www.cnbc.com/2025/07/20/global-week-ahead-banking-bellwethers-and-a-tariffs-waiting-game.html",
    "timestamp": "2025-07-20T05:38:56Z"
  },
  {
    "title": "Jensen Huang, AI visionary in a leather jacket",
    "description": "Unknown to the general public just three years ago, Jensen Huang is now one of the most powerful entrepreneurs in the world.\nThe post Jensen Huang, AI visionary in a leather jacket appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/jensen-huang-ai-visionary-in-a-leather-jacket/article",
    "timestamp": "2025-07-20T05:36:14Z"
  },
  {
    "title": "Trump says he doesn't 'draw pictures.' But many of his sketches sold at auction",
    "description": "Donald Trump refuted a Wall Street Journal report alleging he sent Jeffrey Epstein a sexually suggestive drawing in 2003, claiming he doesn't draw. However, evidence suggests Trump regularly donated drawings to New York charities in the early 2000s.",
    "link": "https://timesofindia.indiatimes.com/world/us/epstein-files-trump-says-he-doesnt-draw-pictures-but-many-of-his-sketches-sold-at-auction/articleshow/122793256.cms",
    "timestamp": "2025-07-20T05:28:44Z"
  },
  {
    "title": "3 people are still missing from deadly floods in Texas county, down from nearly 100",
    "description": "Officials in a Texas hill country community pummeled by deadly flooding July 4 said Saturday that just three people remain missing, down from nearly 100, after people who had previously been reported missing have since been accounted for.",
    "link": "https://www.npr.org/2025/07/20/nx-s1-5473878/missing-floods-drops-3-kerr-county",
    "timestamp": "2025-07-20T05:13:37Z"
  },
  {
    "title": "Israeli estimate: Hostage deal could be reached in coming week",
    "description": "Israeli official says a significant obstacle in the hostage deal talks has been overcome, but cautions that Hamas often creates new demands when a deal is in sight.",
    "link": "https://www.israelnationalnews.com/news/411933",
    "timestamp": "2025-07-20T05:01:00Z"
  },
  {
    "title": "Barron Trump 'humiliated' at NYU? Professor, peers make shocking statement about US President's son",
    "description": "Donald Trump and Melania Trump's youngest son Barron Trump maintains a low-key life and stays away from the public limelight. Barron enrolled at NYU in September 2024, and struggled to fit in, but things have taken a turn for the better, it's being reported. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-humiliated-at-nyu-professor-peers-make-shocking-statement-about-us-presidents-son/articleshow/122793662.cms",
    "timestamp": "2025-07-20T05:00:34Z"
  },
  {
    "title": "What to know about the trial of Brazil’s former President Jair Bolsonaro",
    "description": "Brazil’s Supreme Court has ordered former President Jair Bolsonaro to wear an electronic ankle monitor",
    "link": "https://abcnews.go.com/International/wireStory/trial-brazils-former-president-jair-bolsonaro-123900406",
    "timestamp": "2025-07-20T04:38:22Z"
  },
  {
    "title": "Publication of Epstein Hearings Likely to Be Delayed, Documents to Be Redacted - Reports",
    "description": "WASHINGTON (Sputnik) - The US President Donald Trump-requested publication of transcripts of the court hearings in the case of financier Jeffrey Epstein, accused of sexual exploitation of minors, may be delayed for months, and the final documents will be reda…",
    "link": "https://sputnikglobe.com/20250720/publication-of-epstein-hearings-likely-to-be-delayed-documents-to-be-redacted---reports-1122460264.html",
    "timestamp": "2025-07-20T04:30:41Z"
  },
  {
    "title": "Declan Lynch: Donald Trump is trapped in a mix of Groundhog Day and Seinfeld, but nobody’s laughing",
    "description": "One of the unintended consequences of the Covid pandemic is that we were given an extended masterclass in the dark arts of the post-truth populists. Donald Trump — and ­indeed Boris Johnson in his own reckless way — were constantly ­engaged in a game of promo…",
    "link": "https://www.independent.ie/opinion/declan-lynch-donald-trump-is-trapped-in-a-mix-of-groundhog-day-and-seinfeld-but-nobodys-laughing/a1997545464.html",
    "timestamp": "2025-07-20T04:30:00Z"
  },
  {
    "title": "Government starts fund to help businesses hardest hit by US trade war as 15pc-20pc tariffs loom",
    "description": "The Government is planning to do “everything it possibly can” to avoid a recession, as the Sunday Independent can reveal details of a new fund for those Irish businesses worst ­affected by US tariffs.",
    "link": "https://www.independent.ie/irish-news/government-starts-fund-to-help-businesses-hardest-hit-by-us-trade-war-as-15pc-20pc-tariffs-loom/a247532009.html",
    "timestamp": "2025-07-20T04:30:00Z"
  },
  {
    "title": "Government scrambling to avoid recession as fund to help businesses hardest hit by US trade war established",
    "description": "The Government is planning to do “everything it possibly can” to avoid a recession, as the Sunday Independent can reveal details of a new fund for those Irish businesses worst ­affected by US tariffs.",
    "link": "https://www.independent.ie/irish-news/government-scrambling-to-avoid-recession-as-fund-to-help-businesses-hardest-hit-by-us-trade-war-established/a247532009.html",
    "timestamp": "2025-07-20T04:30:00Z"
  },
  {
    "title": "Julia Molony: Jeffrey Epstein returns to haunt Donald Trump as MAGA followers draw their own conclusions",
    "description": "You would almost feel sorry for Donald Trump’s bewildered MAGA base. Through five years of permacrisis and turbulence, their trust in the righteousness of their supreme leader hasn’t wavered. But now, as his administration is rocked by its mishandling of the …",
    "link": "https://www.independent.ie/opinion/comment/julia-molony-jeffrey-epstein-returns-to-haunt-donald-trump-as-maga-followers-draw-their-own-conclusions/a151511646.html",
    "timestamp": "2025-07-20T04:30:00Z"
  },
  {
    "title": "Costco locations begin to make the switch from Pepsi to Coca-Cola at food courts",
    "description": "The transition to Coca-Cola drinks is expected to be completed at all locations by the fall.",
    "link": "https://nypost.com/2025/07/20/business/costco-locations-begin-to-make-the-switch-from-pepsi-to-coca-cola-at-food-courts/",
    "timestamp": "2025-07-20T04:26:23Z"
  },
  {
    "title": "US right-wingers fear Superman’s woke ideology. Trust me, they’ll be grand",
    "description": "Former Trump advisor Kellyanne Conway has decried the new movie and even an ex-Superman has implied the man of steel could go broke by going woke",
    "link": "https://www.irishtimes.com/culture/2025/07/20/us-right-wingers-fear-supermans-woke-ideology-trust-me-guys-youll-be-grand/",
    "timestamp": "2025-07-20T04:20:00Z"
  },
  {
    "title": "Zelenskiy Says Ukraine Proposed Russia Meeting Next Week",
    "description": "Ukrainian President Volodymyr Zelenskiy said his country had proposed holding a meeting with Russia next week, more than a month after the previous round of direct talks.",
    "link": "https://www.ndtvprofit.com/world/zelenskiy-says-ukraine-proposed-russia-meeting-next-week",
    "timestamp": "2025-07-20T04:19:11Z"
  },
  {
    "title": "Trump Tariffs Spell Trouble For Hawaii's Few Coffee Farmers",
    "description": "Hawaiian coffee farmers have a message for President Donald Trump: Steep tariffs on major exporters such as Brazil will end up hurting them, too.",
    "link": "https://www.ndtvprofit.com/world/trump-tariffs-spell-trouble-for-hawaiis-few-coffee-farmers",
    "timestamp": "2025-07-20T04:18:26Z"
  },
  {
    "title": "Brazil Weighs Measures On US Dividends, Tech Firms, Reports Say",
    "description": "Brazil’s government is studying potential responses to further sanctions by US President Donald Trump, including a limit on dividend payments by US companies with operations in Brazil, according to O Estado de S. Paulo newspaper.",
    "link": "https://www.ndtvprofit.com/global-economics/brazil-weighs-measures-on-us-dividends-tech-firms-reports-say",
    "timestamp": "2025-07-20T04:18:01Z"
  },
  {
    "title": "In the Czech Republic, a new law attacks one of the world’s great evils",
    "description": "For a very brief time, Americans once understood just how evil statist ideologies are, no matter the names under which they existed—Marxism, fascism, socialism, communism, Maoism, etc. Decades of leftism have made us forget that. Central Europe...",
    "link": "https://www.americanthinker.com/blog/2025/07/in_the_czech_republic_a_new_law_attacks_one_of_the_world_s_great_evils.html",
    "timestamp": "2025-07-20T04:00:00Z"
  },
  {
    "title": "Democrats and immigration: attack ICE!",
    "description": "Congressional Democrats, at all all-time low of 19% approval have decided to do what they do best: double down on insanity and disaster. They obviously believe the problem could not possibly be their policies and values. \r\n\r\n\r\n\r\nGraphic: Twitter...",
    "link": "https://www.americanthinker.com/blog/2025/07/democrats_and_immigration_attack_ice.html",
    "timestamp": "2025-07-20T04:00:00Z"
  },
  {
    "title": "It’s Bigly Hitting the Fan Week",
    "description": "The three biggest stories this week expose judicial hijinks, the willingness of the Wall Street Journal to publish defamatory anti-Trump nonsense in violation of all journalism ethics, and Tulsi Gabbard’s public declassification ...",
    "link": "https://www.americanthinker.com/articles/2025/07/it_s_bigly_hitting_the_fan_week.html",
    "timestamp": "2025-07-20T04:00:00Z"
  },
  {
    "title": "Remember how Hillary Clinton called Tulsi Gabbard 'a Russian asset'?",
    "description": "Now that President Trump's National Intelligence Director, Tulsi Gabbard, is exposing the depths of the Democrat deep state's disinformation operation against President Trump as a Russian agent as he entered office in 2021, it's wort...",
    "link": "https://www.americanthinker.com/blog/2025/07/remember_how_hillary_clinton_called_tulsi_gabbard_a_russian_asset.html",
    "timestamp": "2025-07-20T04:00:00Z"
  },
  {
    "title": "Number of missing plummets to 3 in hard-hit Kerr County in wake of Texas floods",
    "description": "The number of people reported missing in the wake of historic July 4 flooding in Kerr County, Texas, has dropped from a peak of more than 160 to three, with many now verified as being safe, officials said Saturday.\"Extensive follow-up work\" and \"extraordinary…",
    "link": "https://www.nbcnews.com/news/us-news/number-missing-plummets-3-hard-hit-kerr-county-texas-floods-rcna219827",
    "timestamp": "2025-07-20T03:40:23Z"
  },
  {
    "title": "Israel asks US to support relocation of Palestinians from Gaza to third countries",
    "description": "Mossad chief David Barnea has requested U.S. assistance in persuading countries like Ethiopia and Indonesia to accept displaced Palestinians from Gaza. This push supports Israel's controversial plan for \"voluntary\" relocation. While Netanyahu insists on \"free…",
    "link": "https://economictimes.indiatimes.com/news/international/us/israel-asks-us-to-support-relocation-of-palestinians-from-gaza-to-third-countries/articleshow/122793112.cms",
    "timestamp": "2025-07-20T03:38:49Z"
  },
  {
    "title": "3 people are still missing from deadly July 4 floods in Texas county, down from nearly 100",
    "description": "Officials in a Texas hill country community pummeled by deadly flooding on July 4 say just three people remain missing, down from nearly 100",
    "link": "https://abcnews.go.com/US/wireStory/3-people-missing-deadly-july-4-floods-texas-123900035",
    "timestamp": "2025-07-20T03:34:25Z"
  },
  {
    "title": "Arizona governor tours wildfire destruction along Grand Canyon's North Rim",
    "description": "Democratic Gov. Katie Hobbs has toured the destruction left by a wildfire along the Grand Canyon’s North Rim",
    "link": "https://abcnews.go.com/US/wireStory/arizona-governor-tours-wildfire-destruction-grand-canyons-north-123898942",
    "timestamp": "2025-07-20T03:34:20Z"
  },
  {
    "title": "Arkansas health insurers propose 26.2% rate increases for individual plans | Northwest Arkansas Democrat-Gazette",
    "description": "Premiums for individual health insurance plans in Arkansas, including those offered through healthcare.gov, would increase an average of 26.2% in 2026 under proposed rates filed by the insurers with the Arkansas Insurance Department.",
    "link": "https://www.nwaonline.com/news/2025/jul/19/arkansas-health-insurers-propose-262-rate/",
    "timestamp": "2025-07-20T03:32:44Z"
  },
  {
    "title": "Arkansas health insurers propose 26.2% rate increases for individual plans",
    "description": "Premiums for individual health insurance plans in Arkansas, including those offered through healthcare.gov, would increase an average of 26.2% in 2026 under proposed rates filed by the insurers with the Arkansas Insurance Department.",
    "link": "https://www.arkansasonline.com/news/2025/jul/19/arkansas-health-insurers-propose-262-rate/",
    "timestamp": "2025-07-20T03:32:13Z"
  },
  {
    "title": "CNN Data Analyst Declares Elon Musk’s New Third Party is ‘Pretty Much Dead on Arrival’ (VIDEO)",
    "description": "Have you heard much about Elon Musk’s new third party, the ‘America Party’ in the news lately?\nThe post CNN Data Analyst Declares Elon Musk’s New Third Party is ‘Pretty Much Dead on Arrival’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/cnn-data-analyst-declares-elon-musks-new-third/",
    "timestamp": "2025-07-20T03:30:55Z"
  },
  {
    "title": "Barack Obama Now Squarely in Russiagate Crosshairs",
    "description": "New disclosures from a Tulsi Gabbard-led working group point directly to the top, as the legacy of \"Hope and Change\" begins a plunge to the ocean floor Barack Obama entered national politics with a smile that looked like Hope and Change. Amid rumors of family…",
    "link": "https://freerepublic.com/focus/f-chat/4329675/posts",
    "timestamp": "2025-07-20T03:16:13Z"
  },
  {
    "title": "Peek into surprise RBA decision as rate cut on cards",
    "description": "Borrowers are hoping for clarity on the Reserve Bank's next moves as an unexpected jump in unemployment firms the case for an interest rate cut.",
    "link": "https://thenightly.com.au/business/governor-michelle-bullock-to-offer-peek-into-surprise-rba-decision-as-rate-cut-on-cards-c-19414828",
    "timestamp": "2025-07-20T03:15:37Z"
  },
  {
    "title": "Ukraine proposes new round of peace talks with Russia",
    "description": "Kyiv has sent Moscow an offer to hold a new round of peace talks next week, just hours after Russian strikes across Ukraine claimed more lives.",
    "link": "https://www.abc.net.au/news/2025-07-20/ukraine-russia-ceasefire-talks-drone-attacks/105552164",
    "timestamp": "2025-07-20T03:12:11Z"
  },
  {
    "title": "Japan votes in a key election as Prime Minsiter Ishiba faces a loss and political uncertainty",
    "description": "Japanese voters are casting ballots in a key parliamentary election",
    "link": "https://abcnews.go.com/International/wireStory/japan-votes-key-election-prime-minsiter-ishiba-faces-123899489",
    "timestamp": "2025-07-20T03:02:17Z"
  },
  {
    "title": "SCOOP: Top Hegseth aide resigns from Pentagon after 6 months of service: 'Incredibly inspiring'",
    "description": "Justin Fulcher confirmed to Fox News Digital that he voluntarily resigned after six months as a senior advisor to Defense Secretary Pete Hegseth, calling his service “inspiring.\"",
    "link": "https://www.foxnews.com/politics/scoop-top-hegseth-aide-resigns-pentagon-6-months-service-incredibly-inspiring",
    "timestamp": "2025-07-20T02:55:24Z"
  },
  {
    "title": "Court blocks Trump order sanctioning ICC workers, citing 'rights violations'",
    "description": "US federal judge blocks President Trump's executive order imposing sanctions on those aiding ICC investigations, calling it an unconstitutional breach of free speech.",
    "link": "https://www.israelnationalnews.com/news/411929",
    "timestamp": "2025-07-20T02:49:10Z"
  },
  {
    "title": "Trump tariffs spell trouble for Hawaii’s few coffee farmers",
    "description": "Hawaiian coffee farmers have a message for President Donald Trump: Steep tariffs on major exporters such as Brazil will end up hurting them, too.\nHawaii at first glance might seem the obvious beneficiary of tariffs on coffee. It is the only state in the count…",
    "link": "https://biztoc.com/x/661db9218227517f",
    "timestamp": "2025-07-20T02:48:33Z"
  },
  {
    "title": "더불어해리스(민주당) 슈머의힘(국민의힘)",
    "description": "New York City Mayor Eric Adams told @tracyalloway and @TheStalwart that he would love to see what’s in the Epstein files – and said that the “deep state” should “outrage every American” while echoing an earlier endorsement of FBI Director Kash Patel’s book ht…",
    "link": "https://ryueyes11.tistory.com/511736",
    "timestamp": "2025-07-20T02:47:07Z"
  },
  {
    "title": "Japan votes in a key election as Prime Minsiter Ishiba faces a loss and political uncertainty",
    "description": "Japanese were voting Sunday for seats in the smaller of Japan's two parliamentary houses in a key election with Prime Minister Shigeru Ishiba and his ruling ...",
    "link": "https://www.yahoo.com/news/japan-votes-key-election-prime-024449310.html",
    "timestamp": "2025-07-20T02:44:49Z"
  },
  {
    "title": "Jensen Huang, AI Visionary In A Leather Jacket",
    "description": "Unknown to the general public just three years ago, Jensen Huang is now one of the most powerful entrepreneurs in the world as head of chip giant Nvidia.",
    "link": "https://www.ibtimes.com.au/jensen-huang-ai-visionary-leather-jacket-1859726",
    "timestamp": "2025-07-20T02:42:20Z"
  },
  {
    "title": "Jensen Huang, AI Visionary In A Leather Jacket",
    "description": "Unknown to the general public just three years ago, Jensen Huang is now one of the most powerful entrepreneurs in the world as head of chip giant Nvidia.",
    "link": "https://www.ibtimes.com/jensen-huang-ai-visionary-leather-jacket-3778942",
    "timestamp": "2025-07-20T02:42:18Z"
  },
  {
    "title": "More than 30 killed after Israeli forces open fire on people seeking food in Gaza, health ministry says",
    "description": "(CNN) — Israeli troops opened fire on Gazans seeking food aid in the territory, killing at least 32 people, the Palestinian health ministry and witnesses said.",
    "link": "https://www.channel3000.com/news/more-than-30-killed-after-israeli-forces-open-fire-on-people-seeking-food-in-gaza/article_7a508088-fb84-5193-a26c-094c96899581.html",
    "timestamp": "2025-07-20T02:38:13Z"
  },
  {
    "title": "SNL 50 Rewind: Third Time's a Charm for Host/Musical Guest Chalamet",
    "description": "As we await word on when NBC's Saturday Night Live will return for its 51st season and what the make-up of next season's cast will be, we've got a summer of encore airings of shows from SNL's milestone 50th season. Tonight, we jump back to January 25, 2025, w…",
    "link": "https://bleedingcool.com/tv/snl-50-rewind-third-times-a-charm-for-host-musical-guest-chalamet/",
    "timestamp": "2025-07-20T02:37:03Z"
  },
  {
    "title": "Jensen Huang, AI visionary in a leather jacket",
    "description": "Unknown to the general public just three years ago, Jensen Huang is now one of the most powerful entrepreneurs in the world as head of chip giant...",
    "link": "https://finance.yahoo.com/news/jensen-huang-ai-visionary-leather-023643990.html",
    "timestamp": "2025-07-20T02:36:43Z"
  },
  {
    "title": "XLM to follow XRP’s bullish rally, Trump’s big crypto nod: Hodler’s Digest, July 13 – 19 - Cointelegraph",
    "description": "XLM to follow XRP’s bullish rally, Trump’s big crypto nod: Hodler’s Digest, July 13 – 19Cointelegraph The week when crypto won big in AmericaNPR Fact Sheet: President Donald J. Trump Signs GENIUS Act into LawThe White House (.gov) What's next after the stable…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178421126",
    "timestamp": "2025-07-20T02:34:31Z"
  },
  {
    "title": "'America has to come first': Trump wins favor with Native Americans",
    "description": "Fed up with rising gas prices, Nita Mexican voted last November for Donald Trump, who is increasingly popular among Native American communities which have...",
    "link": "https://www.yahoo.com/news/america-come-first-trump-wins-023205988.html",
    "timestamp": "2025-07-20T02:32:05Z"
  },
  {
    "title": "Ripple CEO Says Likens GENIUS Act To Major Regulation After 2008 Finanical Crisis",
    "description": "In a landmark moment for both Ripple and the broader crypto industry, US President Donald Trump has officially signed the Guiding and Establishing National Innovation for US Stablecoins Act, or the “GENIUS Act.” Notably, Ripple’s Chief Executive Officer (CEO)…",
    "link": "https://bitcoinist.com/ripple-ceo-on-the-genius-act/",
    "timestamp": "2025-07-20T02:30:36Z"
  },
  {
    "title": "Trump Asks Senate Leader to Cancel Summer Recess to Confirm His ‘Incredible Nominees’",
    "description": "Trump asked the Senate to skip their summer break to confirm his 'incredible nominees,' which include some controversial picks.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-senate-cancel-summer-recess-confirm-nominees-1235389607/",
    "timestamp": "2025-07-20T02:27:54Z"
  },
  {
    "title": "XLM to follow XRP’s bullish rally, Trump’s big crypto nod: Hodler’s Digest, July 13 – 19",
    "description": "Top Stories of The Week\nCrypto execs center stage as Trump signs stablecoin bill into law\nUS President Donald Trump signed one of the first bills related to crypto and blockchain of his administration into law on Friday after delays due to debates in the Hous…",
    "link": "https://biztoc.com/x/99cd8f5daff691a8",
    "timestamp": "2025-07-20T02:26:36Z"
  },
  {
    "title": "'Direct retaliation': Hispanic journalist detained by ICE speaks out (Lautaro Grinspan/Atlanta Journal ...)",
    "description": "Lautaro Grinspan / Atlanta Journal-Constitution:\n‘Direct retaliation’: Hispanic journalist detained by ICE speaks out  —  In an exclusive interview from an ICE detention facility, Mario Guevara talks about his month behind bars and his once positive feelings …",
    "link": "https://www.memeorandum.com/250719/p60",
    "timestamp": "2025-07-20T02:15:00Z"
  },
  {
    "title": "FTT rockets 43% on false report that Trump has pardoned Sam Bankman-Fried",
    "description": "The incident highlights the volatility and susceptibility of crypto markets to misinformation, impacting investor trust and market stability.\nThe post FTT rockets 43% on false report that Trump has pardoned Sam Bankman-Fried appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/ftt-price-surge-false-pardon/",
    "timestamp": "2025-07-20T02:11:31Z"
  },
  {
    "title": "First Nations leaders walk out of Mark Carney meeting on Building Canada Act",
    "description": "Several First Nations leaders have walked out of a meeting with Mark Carney, as an event the Canadian prime minister hoped would assuage their concerns over his Building Canada Act instead left many with growing concern that it would violate their rights. Car…",
    "link": "https://freerepublic.com/focus/f-news/4329670/posts",
    "timestamp": "2025-07-20T02:02:07Z"
  },
  {
    "title": "WH said to have investigated SpaceX contracts",
    "description": "The administration of United States President Donald Trump is reportedly reviewing SpaceX's federal government contracts, the Wall Street Journal reported, citing people familiar with the matter.The r...",
    "link": "https://biztoc.com/x/19d06469004721d4",
    "timestamp": "2025-07-20T01:52:31Z"
  }
]