[
  {
    "title": "Major economy facing sharpest slowdown named",
    "description": "The Organization for Economic Co-operation and Development has slashed US growth outlook amid tariff-related policy uncertainty Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618592-us-growth-forecast-slashed/",
    "timestamp": "2025-06-03T15:34:40Z"
  },
  {
    "title": "Here’s why she lost — Bernie Sanders bluntly dissects Kamala Harris’s collapse against Donald Trump in 2024",
    "description": "Bernie Sanders said Kamala Harris lost the 2024 election because her team didn’t focus on working-class issues. He blamed bad advice, rich allies, and celebrity support for making the campaign feel out of touch with everyday people.",
    "link": "https://economictimes.indiatimes.com/news/international/us/heres-why-she-lost-bernie-sanders-bluntly-dissects-kamala-harriss-collapse-against-donald-trump-in-2024/articleshow/121601840.cms",
    "timestamp": "2025-06-03T15:34:38Z"
  },
  {
    "title": "GHF names Rev. Dr. Johnnie Moore as Executive Chairman amid expanding aid efforts",
    "description": "Moore was interviewed by The Jerusalem Post earlier in May, where he spoke about Evangelical Christians and support for Israel.",
    "link": "https://www.jpost.com/middle-east/article-856426",
    "timestamp": "2025-06-03T15:34:03Z"
  },
  {
    "title": "Flurry of Executions Scheduled Over Four Days",
    "description": "Four men are scheduled to be executed in four states between June 10 and 13.",
    "link": "https://www.newsweek.com/flurry-executions-four-days-2080275",
    "timestamp": "2025-06-03T15:33:04Z"
  },
  {
    "title": "Swimming world body to banish athletes of PED-fueled Enhanced Games",
    "description": "Swimmers and officials who compete in and support The Enhanced Games will suffer consequences in the form of banishment, says the governing body for World Aquatics.",
    "link": "https://www.foxsports.com/stories/other/swimming-world-body-banish-athletes-ped-fueled-enhanced-games",
    "timestamp": "2025-06-03T15:32:25Z"
  },
  {
    "title": "Tory Leader Blurts Out the Truth: Britain Is at the Heart of Gaza ‘Proxy War’",
    "description": "If you have spent the past 20 months wondering why British leaders on both sides of the aisle have barely criticised Israel, even as it slaughtered and starved Gaza’s population of more than two million people, you finally got an answer last week. Conservativ…",
    "link": "https://www.antiwar.com/blog/2025/06/03/tory-leader-blurts-out-the-truth-britain-is-at-the-heart-of-gaza-proxy-war/",
    "timestamp": "2025-06-03T15:32:17Z"
  },
  {
    "title": "Wall Street stocks close higher, dollar bounces back amid tariff talks, economic data",
    "description": "NEW YORK :U.S. stocks advanced and the dollar rebounded on Tuesday as investors weighed progress in ongoing U.S. tariff talks and lowered economic expectations ahead of Friday's crucial U.S. employment report.All three major U.S. stock indexes ended the sessi…",
    "link": "https://www.channelnewsasia.com/business/wall-street-stocks-close-higher-dollar-bounces-back-amid-tariff-talks-economic-data-5163566",
    "timestamp": "2025-06-03T15:32:02Z"
  },
  {
    "title": "Wall Street advances, dollar bounces back amid tariff talks, economic data",
    "description": "NEW YORK :Wall Street stocks rose and the dollar rebounded on Tuesday as investors weighed progress in ongoing U.S. tariff talks and lowered economic expectations ahead of Friday's crucial U.S. employment report.All three major U.S. stock indexes advanced, wi…",
    "link": "https://www.channelnewsasia.com/business/wall-street-advances-dollar-bounces-back-amid-tariff-talks-economic-data-5163566",
    "timestamp": "2025-06-03T15:32:02Z"
  },
  {
    "title": "Trump's foreign student policies alarm Rep. Ro Khanna: They're 'embedded in Silicon Valley'",
    "description": "The warning from Silicon Valley's representative in Congress comes as the Trump administration rolls out visa restrictions targeting foreign students.",
    "link": "https://www.cnbc.com/2025/06/03/ro-khanna-silicon-valley-elon-musk-international-students.html",
    "timestamp": "2025-06-03T15:31:54Z"
  },
  {
    "title": "Illinois school board meeting madness continues as tensions escalate over trans athletes in girls' sports",
    "description": "Protests at Illinois school board meeting over trans athletes in girls' sports sparked national attention, with debates on federal law and state rights.",
    "link": "https://www.foxnews.com/sports/illinois-school-board-meeting-madness-continues-tensions-escalate-over-trans-athletes-girls-sports",
    "timestamp": "2025-06-03T15:30:49Z"
  },
  {
    "title": "DNC trolls Trump on tariffs with free 'TACO' truck parked outside RNC headquarters",
    "description": "The DNC rolled out a taco truck outside RNC headquarters to troll President Donald Trump on tariffs, using the Wall Street term \"TACO\" – \"Trump Always Chickens Out\" – to spotlight how he's backed off from tariffs.",
    "link": "https://www.foxnews.com/politics/dnc-trolls-trump-tariffs-free-taco-truck-parked-outside-rnc-headquarters",
    "timestamp": "2025-06-03T15:30:12Z"
  },
  {
    "title": "Trump Is Headed to War With the Federalist Society—and It’s Gonna Be Huge",
    "description": "Elie Mystal\n\n\n\nThe fight might between the president and the conservative old guard might just be the biggest legal development of Trump’s second term.\r\n\n\r\n\n\nThe post Trump Is Headed to War With the Federalist Society—and It’s Gonna Be Huge appeared first on …",
    "link": "https://www.thenation.com/article/politics/trump-war-federalist-society-leo/",
    "timestamp": "2025-06-03T15:29:58Z"
  },
  {
    "title": "Jasmine Crockett agrees during town hall that 'Republicans want poor people to die'",
    "description": "Rep. Jasmine Crockett agreed with former police officer who defended the U.S. Capitol on Jan. 6, 2021, that “Republicans want poor people to die as quickly as humanly possible,\" on Monday.",
    "link": "https://www.foxnews.com/politics/jasmine-crockett-agrees-during-town-hall-republicans-want-poor-people-die",
    "timestamp": "2025-06-03T15:29:16Z"
  },
  {
    "title": "Florida meteorologist halts forecast to give dire on-air warning against Trump",
    "description": "Miami meteorologist John Morales‬ issued a dire warning Monday about hurricane season as it begins this month. He began with a clip of Hurricane Dorian slowly moving due west directly towards Florida in 2019. Morales promised it would turn north and dodge Flo…",
    "link": "https://www.rawstory.com/hurricane-season-forcasting-noaa-nws/",
    "timestamp": "2025-06-03T15:28:45Z"
  },
  {
    "title": "US economic outlook slashed by OECD as Trump's tariffs upend global growth",
    "description": "\"Global economic prospects are weakening,\" the OECD said.",
    "link": "https://abcnews.go.com/Business/us-economic-outlook-slashed-oecd-trumps-tariffs-upend/story?id=122443152",
    "timestamp": "2025-06-03T15:28:21Z"
  },
  {
    "title": "50 Cent Shares Clips of Diddy Criticizing Trump Amid Pardon Speculation: 'Run Your Mouth Too Much'",
    "description": "Trump previously said he would \"look at the facts\" in the case.",
    "link": "https://www.complex.com/music/a/tracewilliamcowen/50-cent-shares-clips-diddy-criticizing-trump-amid-pardon-speculation",
    "timestamp": "2025-06-03T15:26:15Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
    "description": "Markets closed lower on Tuesday with IT, financials, and rate-sensitive stocks dragging indices down. Investors remain cautious ahead of RBI’s policy and global fiscal concerns.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/121601848.cms",
    "timestamp": "2025-06-03T15:24:57Z"
  },
  {
    "title": "Newark Mayor Ras Baraka sues Alina Habba, alleging ‘false arrest and malicious prosecution’",
    "description": "Alina Habba's criminal case against Ras Baraka collapsed quickly. Now, the tables have turned, and the Newark mayor is suing the Trump-appointed prosecutor.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/newark-mayor-ras-baraka-sues-alina-habba-ice-arrest-rcna210629",
    "timestamp": "2025-06-03T15:21:32Z"
  },
  {
    "title": "Trump reaffirms hard line on Iran nuclear deal: 'will not allow any enrichment of uranium'",
    "description": "President Donald Trump denies U.S. proposal for Iran's uranium enrichment, contradicting reports as Iran insists on its right to enrich uranium amid nuclear talks.",
    "link": "https://www.foxnews.com/world/trump-reaffirms-hard-line-iran-nuclear-deal-will-not-allow-any-enrichment-uranium",
    "timestamp": "2025-06-03T15:20:44Z"
  },
  {
    "title": "Rand Paul Fires Back After Trump’s Brutal Attack: ‘Kentuckians Sent Me Here to Fight Reckless Debt’",
    "description": "Sen. Rand Paul (R-KY) hit back at President Donald Trump by doubling down on the criticism of the president's budget bill that set off Trump in the first place.\nThe post Rand Paul Fires Back After Trump’s Brutal Attack: ‘Kentuckians Sent Me Here to Fight Reck…",
    "link": "https://www.mediaite.com/media/tv/rand-paul-hits-back-following-trumps-brutal-attack-kentuckians-sent-me-here-to-fight-reckless-debt/",
    "timestamp": "2025-06-03T15:20:18Z"
  },
  {
    "title": "Trump criticizes Rand Paul over tax bill opposition: 'Votes no on everything'",
    "description": "Trump criticizes Rand Paul for opposing his \"big, beautiful bill,\" highlighting a GOP divide over the package's impact on national debt and fiscal policy.",
    "link": "https://www.foxnews.com/politics/trump-criticizes-rand-paul-over-tax-bill-opposition-votes-no-everything",
    "timestamp": "2025-06-03T15:19:58Z"
  },
  {
    "title": "The D Brief: DOD civilians, on the move; Ukraine-strike details; Trump’s nuke offer to Iran; Syria’s jihadis, in uniform?; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/06/the-d-brief-june-03-2025/405760/",
    "timestamp": "2025-06-03T15:19:51Z"
  },
  {
    "title": "MAGA Really, Really, Really, Really, Really, Really, Really Doesn't Like Tim Walz Saying We Need To \"Bully The Sh—t Out\" Of Donald Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_ece2e266-61e2-4742-b284-683489d1e4ab",
    "timestamp": "2025-06-03T15:19:16Z"
  },
  {
    "title": "MAGA Really, Really, Really, Really, Really, Really, Really Doesn't Like Tim Walz Saying We Need To \"Bully The Sh—t Out\" Of Donald Trump",
    "description": "As you can imagine, MAGA was not pleased.View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/tim-walz-bully-trump",
    "timestamp": "2025-06-03T15:19:16Z"
  },
  {
    "title": "6 Nobel prize-winning economists wrote a letter opposing Trump's budget bill: 'We have grave concerns'",
    "description": "Economists are asking Congress to reconsider cuts to Medicaid and SNAP, which they say would hurt low-income Americans.",
    "link": "https://www.cnbc.com/2025/06/03/why-nobel-prize-winning-economists-oppose-trumps-budget-bill.html",
    "timestamp": "2025-06-03T15:19:11Z"
  },
  {
    "title": "Trump Says New Iran Deal Will Not Allow Uranium Enrichment, Contradicting Reports",
    "description": "President Donald Trump said Monday night the administration's new Iran nuclear deal would not include any uranium enrichment, contradicting prior reports.",
    "link": "https://dailycaller.com/2025/06/03/trump-says-new-iran-deal-will-not-allow-uranium-enrichment-contradicting-reports/",
    "timestamp": "2025-06-03T15:18:21Z"
  },
  {
    "title": "Senate Republics Battle Democrat Obstruction on Trump Nominees",
    "description": "One of the Senate’s biggest fights is happening right now, but it is not getting much attention. President Donald Trump still has around 100 nominees... Read More\nThe post Senate Republics Battle Democrat Obstruction on Trump Nominees appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/06/03/senate-republics-battle-democrat-obstruction-trump-nominees/",
    "timestamp": "2025-06-03T15:17:41Z"
  },
  {
    "title": "Trump Pardons 2 Divers Who Freed 19 Sharks Off Florida Coast",
    "description": "Tanner Mansell and John Moore Jr. were pardoned Monday after being convicted in 2022 for theft of property within special maritime jurisdiction.",
    "link": "https://www.huffpost.com/entry/trump-pardons-2-divers-who-freed-19-sharks-off-florida-coastons_n_683f0fb4e4b02a49cce71cdd",
    "timestamp": "2025-06-03T15:17:05Z"
  },
  {
    "title": "Democrats Will Hand Out Free Tacos to Mock Trump",
    "description": "The Democratic Party has commissioned a taco truck to serve free lunch outside the Republican National Committee’s DC headquarters beginning at noon on Tuesday. “Trump always chickens out—we’re just bringing the tacos to match.” The giveaway is not just to ma…",
    "link": "https://www.motherjones.com/politics/2025/06/taco-truck-donald-trump-always-chickens-out/",
    "timestamp": "2025-06-03T15:15:00Z"
  },
  {
    "title": "‘The Ban Is Lifted!’ Steve Bannon’s Podcast Returns to Spotify Five Years After Beheadings Controversy",
    "description": "Spotify has over 268 million subscribers and has been a key driver behind the rise of podcasting and alternative media in recent years\nThe post ‘The Ban Is Lifted!’ Steve Bannon’s Podcast Returns to Spotify Five Years After Beheadings Controversy first appear…",
    "link": "https://www.mediaite.com/media/podcasts/the-ban-is-lifted-steve-bannons-podcast-returns-to-spotify-five-years-after-beheadings-controversy/",
    "timestamp": "2025-06-03T15:14:35Z"
  },
  {
    "title": "Trump DOJ Probes Biden Pardons Amid Autopen, Competency Questions",
    "description": "President Donald Trump’s Justice Department is investigating last-minute pardons issued by former President Joe Biden to his family members and federal death row inmates.\nIn an internal email seen by Reuters, Pardon Attorney Ed Martin said he was directed to …",
    "link": "https://biztoc.com/x/cb6d7798dd54042f",
    "timestamp": "2025-06-03T15:13:36Z"
  },
  {
    "title": "U.S. to scale down its military bases in Syria, envoy says",
    "description": "The new envoy to Syria says the U.S. is changing its century-old policy in Damascus. Military equipment and vehicles have already been moved out of the eastern Deir el-Zor",
    "link": "https://www.haaretz.com/israel-news/2025-06-03/ty-article/u-s-to-scale-down-its-military-bases-in-syria-envoy-says/00000197-3624-da41-a9f7-3fa40e0c0000",
    "timestamp": "2025-06-03T15:13:35Z"
  },
  {
    "title": "Trump tells Iran sanctions will remain until it ends nuclear programme",
    "description": "US demands Iran end all uranium-enrichment activities, including those relating to power generation and medical treatment",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/03/us-iran-uranium/",
    "timestamp": "2025-06-03T15:13:17Z"
  },
  {
    "title": "Elon Musk backer Tim Draper says Bitcoin will rule retail — dollar’s days may be numbered, he warns",
    "description": "Venture capitalist Tim Draper forecasts a decline in the US dollar's value. He anticipates a shift towards Bitcoin as retailers begin to favor it. Draper, a long-time Bitcoin advocate, highlights its potential stability. The US Dollar Index faces challenges, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-backer-tim-draper-says-bitcoin-will-rule-retail-dollars-days-may-be-numbered-he-warns-bitcoin-news-us-dollar-news/articleshow/121601112.cms",
    "timestamp": "2025-06-03T15:13:01Z"
  },
  {
    "title": "Russia says no quick breakthrough in ‘complex’ Ukraine talks",
    "description": "Russia on Tuesday said it was wrong to expect a quick breakthrough in Ukraine talks, a day after Moscow rejected Kyiv’s call for an unconditional ceasefire at negotiations in Istanbul. The sides agreed on a large-scale swap of captured soldiers and exchanged …",
    "link": "https://www.digitaljournal.com/world/russia-says-no-quick-breakthrough-in-complex-ukraine-talks/article",
    "timestamp": "2025-06-03T15:12:20Z"
  },
  {
    "title": "Ukraine's Drones Just Took Down a Chunk of Russia's Bomber Fleet. What Does That Mean for America?",
    "description": "When anyone can have an air force, superpowers aren't as powerful as they used to be.",
    "link": "https://reason.com/2025/06/03/ukraines-drones-just-took-down-a-chunk-of-russias-bomber-fleet-what-does-that-mean-for-america/",
    "timestamp": "2025-06-03T15:08:35Z"
  },
  {
    "title": "CNBC Drops Brutal Breakdown on ‘Real Cost’ of Trump Tariffs",
    "description": "CNBC senior retail reporter Courtney Reagan dropped a brutal and exclusive breakdown on the \"real cost\" of Trump's tariffs. Spoiler alert: it's a lot.\nThe post CNBC Drops Brutal Breakdown on ‘Real Cost’ of Trump Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnbc-drops-brutal-breakdown-on-real-cost-of-trump-tariffs/",
    "timestamp": "2025-06-03T15:06:27Z"
  },
  {
    "title": "Indo-Pak conflict: PM Modi surrendered after Trump's call, says Rahul Gandhi",
    "description": "Rahul Gandhi alleged that Prime Minister Modi surrendered to US pressure during a military conflict with Pakistan, contrasting it with Indira Gandhi's firm stance in 1971. He accused the BJP-RSS of undermining the Constitution and favoring select industrialis…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/indo-pak-conflict-pm-modi-surrendered-after-trumps-call-says-rahul-gandhi/articleshow/121601624.cms",
    "timestamp": "2025-06-03T15:06:26Z"
  },
  {
    "title": "Trump rages against Amy Coney Barrett in meltdowns over rulings: sources",
    "description": "A new CNN report claims \r\nPresident Donald Trump “has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda.”The outlet cites multiple sources who are familiar with more than one conversation. Justices…",
    "link": "https://www.rawstory.com/trump-scotus-2672255846/",
    "timestamp": "2025-06-03T15:05:33Z"
  },
  {
    "title": "Palantir defies tech gloom as Trump momentum powers stellar share gains",
    "description": "Palantir Technologies has succeeded where most tech stocks have struggled this year: staying hot in a cooling market.The company's military-grade AI tools along with its deep defense ties and high-level government connections at a time when the U.S. is boosti…",
    "link": "https://www.channelnewsasia.com/business/palantir-defies-tech-gloom-trump-momentum-powers-stellar-share-gains-5164566",
    "timestamp": "2025-06-03T15:05:08Z"
  },
  {
    "title": "HHS ends Biden-era COVID-19 testing program that bled taxpayers years after pandemic",
    "description": "The Department of Health and Human Services announced it is shuttering a nationwide program that offered free COVID-19 tests to community organizations, citing it bled taxpayer funds despite the pandemic's end.",
    "link": "https://www.foxnews.com/politics/hhs-ends-biden-era-covid-19-testing-program-bled-taxpayers-years-after-pandemic",
    "timestamp": "2025-06-03T15:05:06Z"
  },
  {
    "title": "Don Jr. GRILLED by CNBC Hosts About Trump Meme Coin: ‘As Bad as Hunter’s Art’",
    "description": "The hosts of CNBC's Squawk Box grilled Donald Trump Jr. about the $TRUMP meme coin — which has been heavily criticized by ethics watchdogs\nThe post Don Jr. GRILLED by CNBC Hosts About Trump Meme Coin: ‘As Bad as Hunter’s Art’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/don-jr-grilled-by-cnbc-hosts-about-trump-meme-coin-as-bad-as-hunters-art/",
    "timestamp": "2025-06-03T15:03:38Z"
  },
  {
    "title": "US Wants Vietnam To Cut Trade With China As Part Of Tariff Deal",
    "description": "The Donald Trump government wants Vietnam to cut back on its imports from China if it wants to avoid 46% “reciprocal” tariffs on shipments to the United States.\nThe demand is part of a “long” list of “tough” requests the Trump administration has sent to Vietn…",
    "link": "https://biztoc.com/x/33cffce392e23e0e",
    "timestamp": "2025-06-03T15:02:36Z"
  },
  {
    "title": "Rand Paul Doesn’t Get The Big Growth Bill: Trump",
    "description": "President Donald Trump on Tuesday slammed Senator Rand Paul for opposing the administration’s sweeping Big, Beautiful, Bill (BBB), accusing the Kentucky Republican of offering “crazy” ideas and blocking progress without alternatives. \nIn a post on Truth Socia…",
    "link": "https://biztoc.com/x/79e1bae6393700f8",
    "timestamp": "2025-06-03T15:02:29Z"
  },
  {
    "title": "Gold price prediction: Why did gold fall after hitting a 4-week high and could it rebound soon amid U.S. dollar strength, trade tensions, and key economic data?",
    "description": "Gold prices retreat after briefly hitting a four-week high on June 3, as a stronger U.S. dollar and profit-taking pressure the market. Spot gold dropped 0.7% to $3,356.75 an ounce, while U.S. futures slipped 0.5%. Investors are closely watching trade tensions…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-why-did-gold-fall-after-hitting-a-4-week-high-and-could-it-rebound-soon-amid-u-s-dollar-strength-trade-tensions-and-key-economic-data/articleshow/121598505.cms",
    "timestamp": "2025-06-03T15:00:37Z"
  },
  {
    "title": "Trump privately complains about Amy Coney Barrett and other Supreme Court justices he nominated",
    "description": "President Donald Trump has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda, according to multiple sources familiar with the conversations. But he has directed particular ire at Justice Amy Coney …",
    "link": "https://freerepublic.com/focus/f-news/4320726/posts",
    "timestamp": "2025-06-03T15:00:37Z"
  },
  {
    "title": "RFK Jr. gives his Covid vaccine advice | June 3 editorial cartoons",
    "description": "Tuesday's political cartoons include RFK Jr. and the CDC, Elon Musk's DOGE exit, and Donald Trump versus academic freedom",
    "link": "https://theweek.com/cartoons/june-3-editorial-cartoons",
    "timestamp": "2025-06-03T15:00:00Z"
  },
  {
    "title": "Pentagon Aligns Greenland with the U.S.",
    "description": "\"The Pentagon is poised to shift its oversight of Greenland by putting it under U.S. Northern Command, a symbolic gesture that would more closely align the island territory with the U.S. as President Donald Trump",
    "link": "https://politicalwire.com/2025/06/03/pentagon-aligns-greenland-with-the-u-s/",
    "timestamp": "2025-06-03T14:59:02Z"
  },
  {
    "title": "Swimming world body to banish athletes and supporters of doping-fueled event in Las Vegas",
    "description": "Swimmers and officials who compete in and support a doping-fueled sports event planned in Las Vegas will be banished from the sport, the governing body World Aquatics said on Tuesday. Organizers of the Enhanced Games scheduled next May promise $1 million bonu…",
    "link": "https://sports.yahoo.com/article/swimming-world-body-banish-athletes-145855411.html",
    "timestamp": "2025-06-03T14:58:55Z"
  },
  {
    "title": "Murder Rates Plummet Under President Trump",
    "description": "President Donald Trump’s law and order agenda is to thank for the murder rate dropping by 20% this year so far, the White House said... Read More\nThe post Murder Rates Plummet Under President Trump appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/03/murder-rates-plummet-under-president-trump/",
    "timestamp": "2025-06-03T14:56:51Z"
  },
  {
    "title": "US Stocks Wobble at the Open as Growth Concerns Return",
    "description": "US equities fluctuated at the open on Tuesday, as concerns about growth resurfaced after Paris-based OECD warned that Donald Trump’s trade policies have tipped the world economy into a downturn.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-wobble-at-the-open-as-growth-concerns-return",
    "timestamp": "2025-06-03T14:56:17Z"
  },
  {
    "title": "Savannah Chrisley Details Todd and Julie Chrisley’s Life After Prison",
    "description": "Todd Chrisley and Julie Chrisley have been making up for lost time.\nNearly a week after the Chrisley Knows Best alums were released from prison after receiving pardons from President Donald Trump,...",
    "link": "https://www.eonline.com/news/1418258/savannah-chrisley-details-todd-julies-life-after-prison",
    "timestamp": "2025-06-03T14:55:30Z"
  },
  {
    "title": "Trump ramps up criticism of Republican senators who could stall his funding bill",
    "description": "Trump is ramping up his criticism of GOP senators who are threatening to complicate the passage of the \"One Big Beautiful Bill Act.\"",
    "link": "https://abcnews.go.com/Politics/trump-ramps-criticism-republican-senators-stall-funding-bill/story?id=122447199",
    "timestamp": "2025-06-03T14:54:12Z"
  },
  {
    "title": "CDC Decides America’s Children Could Do With More Lead In Their Blood",
    "description": "With all the conversations weve had in the past few months about the decline of the Department of Health and Human Services (HHS) under the leadership, or lack thereof, of RFK Jr. and Donald Trump, you might have been left with the impression that everything …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177908825",
    "timestamp": "2025-06-03T14:52:27Z"
  },
  {
    "title": "Exit poll shows liberal candidate Lee forecast to win South Korean presidential election",
    "description": "The exit poll by South Korea's three major TV stations showed Lee projected to get 51.7% of the total votes cast during Tuesday's election, beating conservative candidate Kim Moon Soo with 39.3%.",
    "link": "https://www.pbs.org/newshour/world/exit-poll-shows-liberal-candidate-lee-forecast-to-win-south-korean-presidential-election",
    "timestamp": "2025-06-03T14:52:07Z"
  },
  {
    "title": "Former ‘Anonymous’ Author Files Legal Challenge Over Trump Memo Targeting Him",
    "description": "Miles Taylor filed a complaint urging DHS and DOJ to investigate Trump for allegedly weaponizing government to punish political dissent.",
    "link": "https://time.com/7290748/trump-miles-taylor-treason-legal-challenge/",
    "timestamp": "2025-06-03T14:51:42Z"
  },
  {
    "title": "Hunter Biden’s Favorite Prostitute Charged With Manslaughter",
    "description": "One of Hunter Biden’s favorite prostitutes and drug buddies was charged with manslaughter in Nevada this year after allegedly bringing drugs into a jail, leading to another inmate’s death. Cheryl Ann Deboves was arraigned on involuntary manslaughter and drug …",
    "link": "https://freerepublic.com/focus/f-chat/4320724/posts",
    "timestamp": "2025-06-03T14:50:58Z"
  },
  {
    "title": "Republicans cling to brazen falsehoods to sell their far-right megabill",
    "description": "The question Americans should ask themselves is simple: If the Republicans' domestic policy package is so great, why can’t the party tell the truth about it?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-cling-brazen-falsehoods-sell-far-right-megabill-rcna210607",
    "timestamp": "2025-06-03T14:50:50Z"
  },
  {
    "title": "This Pride Month, Let’s Fight Back by Learning From History of Trans Resistance",
    "description": "In the fight for dignity and democracy, trans people have much to teach.",
    "link": "https://tomdispatch.com/the-war-on-trans-people/",
    "timestamp": "2025-06-03T14:50:36Z"
  },
  {
    "title": "'He Chose Billionaires': New Ad Targets Vulnerable Republican Over Vote to Gut Medicaid",
    "description": "Republican Rep. Don Bacon of Nebraska, one of the House lawmakers most vulnerable to losing their seats in the 2026 midterms, was the target of a new ad that aired Tuesday as part of a nationwide campaign to draw public attention and outrage to the GOP plan t…",
    "link": "https://www.commondreams.org/news/don-bacon-medicaid-cuts",
    "timestamp": "2025-06-03T14:49:24Z"
  },
  {
    "title": "The Truth About Diddy Might Be Darker Than the Rumors",
    "description": "The conspiratorial guesswork distracts from the all-too-ordinary issues at the center of his case.",
    "link": "https://www.theatlantic.com/culture/archive/2025/06/diddy-trial-allegations-rumors/683015/",
    "timestamp": "2025-06-03T14:48:32Z"
  },
  {
    "title": "Trump Loses It at Rand Paul as GOP Budget Bill Seems Doomed in Senate",
    "description": "Donald Trump decided to start his Tuesday morning by attacking Republican Senator Rand Paul.\r\n“Rand Paul has very little understanding of the BBB, especially the tremendous GROWTH that is coming,” Trump angrily posted on Truth Social, referring to the budget …",
    "link": "https://newrepublic.com/post/196040/trump-rand-paul-republican-budget-bill-deficit",
    "timestamp": "2025-06-03T14:47:39Z"
  },
  {
    "title": "ICE Arrests Migrant for Drunk Driving. He Has No Car and Can't Drive",
    "description": "Masked agents grabbed the man from his work site on Maple Avenue in Great Barrington, Massachusetts.",
    "link": "https://www.newsweek.com/ice-arrests-migrant-drunk-driving-no-car-2080265",
    "timestamp": "2025-06-03T14:46:31Z"
  },
  {
    "title": "Inmate admits writing Trump threat letters to frame migrant, court filing says",
    "description": "According to a court filing Monday, Ramon Morales-Reyes was framed by another inmate so he would no longer be able to testify against him in an upcoming trial.",
    "link": "https://abcnews.go.com/US/inmate-admits-writing-trump-threat-letters-frame-migrant/story?id=122448893",
    "timestamp": "2025-06-03T14:46:12Z"
  },
  {
    "title": "‘Stories We Want Them to Know’: Faith Finally Returns To Kennedy Center After Trump Breaks Liberal Stranglehold",
    "description": "WASHINGTON — Hundreds of families attended two free sold-out showings at the Kennedy Center to view an adaptation of famous novelist Charles Dickens’ story detailing the life story of Jesus Christ.  The film, titled “The King of Kings” and produced by South K…",
    "link": "https://dailycaller.com/2025/06/03/the-king-of-kings-brings-family-faith-to-kennedy-center/",
    "timestamp": "2025-06-03T14:45:28Z"
  },
  {
    "title": "While staging a military parade, Trump wages war on real U.S. strength (Max Boot/Washington Post)",
    "description": "Max Boot / Washington Post:\nWhile staging a military parade, Trump wages war on real U.S. strength  —  The president's assault on science dangerously undermines America's superpower status.  —  the 250th birthday of the U.S. Army and, not so coincidentally, t…",
    "link": "https://www.memeorandum.com/250603/p54",
    "timestamp": "2025-06-03T14:45:02Z"
  },
  {
    "title": "CNET's Tariff Price Tracker: I'm Following 11 Key Products Daily for Price Changes",
    "description": "Trump's tariff plans could potentially be upended by the Supreme Court, but they've still caused some very real price inflation.",
    "link": "https://www.cnet.com/tech/cnets-tariff-price-tracker-im-following-11-key-products-daily-for-price-changes/",
    "timestamp": "2025-06-03T14:45:00Z"
  },
  {
    "title": "Meteorologist Warns Trump’s Cuts Will Have Consequences on Live TV",
    "description": "A meteorologist at NBC6 in Miami took time from his weather report to call out the “gutting” federal cuts that have left the National Weather Service understaffed, underinformed,  and with a quality of forecast that is considerably lower than it’s been in rec…",
    "link": "https://newrepublic.com/post/196034/meteorologist-warns-trump-cuts-consequences-hurricane-forecast",
    "timestamp": "2025-06-03T14:43:08Z"
  },
  {
    "title": "Election investigation uncovers alleged illegal voting by noncitizens and double voters in multiple states",
    "description": "Ohio's election integrity investigation finds noncitizen and double voting, leading to potential prosecutions in eight states and Washington, D.C.",
    "link": "https://www.foxnews.com/politics/election-investigation-uncovers-alleged-illegal-voting-noncitizens-double-voters-multiple-states",
    "timestamp": "2025-06-03T14:43:03Z"
  },
  {
    "title": "Donald Trump's Approval Rating Shifts in Multiple Polls",
    "description": "Multiple recent polls show an uptick in Trump's approval rating—though most fall within the margin of error.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2080335",
    "timestamp": "2025-06-03T14:42:20Z"
  },
  {
    "title": "WATCH LIVE: White House holds news briefing as Trump pushes tax and spending bill through Senate",
    "description": "The president fired off a series of angry posts on social media Tuesday morning about Paul’s opposition to Trump’s big tax breaks and spending cuts package.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-news-briefing-as-trump-pushes-tax-and-spending-bill-through-senate",
    "timestamp": "2025-06-03T14:41:43Z"
  },
  {
    "title": "Trump privately complains about Amy Coney Barrett and other Supreme Court justices he nominated (CNN)",
    "description": "CNN:\nTrump privately complains about Amy Coney Barrett and other Supreme Court justices he nominated  —  President Donald Trump has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda, according to m…",
    "link": "https://www.memeorandum.com/250603/p52",
    "timestamp": "2025-06-03T14:40:01Z"
  },
  {
    "title": "Trump Blasts Rand Paul as 'Crazy' for Resisting Tax-Cut Bill Over Debt Limit (Erik Wasson/Bloomberg)",
    "description": "Erik Wasson / Bloomberg:\nTrump Blasts Rand Paul as ‘Crazy’ for Resisting Tax-Cut Bill Over Debt Limit  —  President Donald Trump attacked fiscal conservative Rand Paul as “crazy” Tuesday morning as he pressed reluctant Republican senators to move forward swif…",
    "link": "https://www.memeorandum.com/250603/p51",
    "timestamp": "2025-06-03T14:40:01Z"
  },
  {
    "title": "The West’s Self-Destructive Peace and Conflict Illiteracy",
    "description": "The Western world has lost its consciousness, perception, and instruments of conflict analysis, resolution, peace-making, and reconciliation.\nThe post The West’s Self-Destructive Peace and Conflict Illiteracy appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/west-self-destructive-peace-conflict-illiteracy/5889422",
    "timestamp": "2025-06-03T14:38:41Z"
  },
  {
    "title": "Arch Globalist Polish PM Tusk Calls for Confidence Vote After Stunning Defeat in Presidential Elections",
    "description": "Polish Prime Minister Donald Tusk announced Tuesday plans to hold a vote of confidence as he seeks to lend his government some legitimacy after his globalist party's stunning defeat in the presidential elections over the weekend.\nThe post Arch Globalist Polis…",
    "link": "https://www.breitbart.com/europe/2025/06/03/arch-globalist-polish-pm-tusk-calls-for-confidence-vote-after-stunning-defeat-in-presidential-elections/",
    "timestamp": "2025-06-03T14:38:36Z"
  },
  {
    "title": "Washington Post mocked after reporting on ‘mysterious’ decline in fentanyl crossing the border",
    "description": "The Washington Post is being mocked online and by the White House for \"pathetic\" reporting on what the liberal-leaning news outlet calls a \"mysterious\" decline in fentanyl flowing across the border.",
    "link": "https://nypost.com/2025/06/03/us-news/washington-post-mocked-after-reporting-on-mysterious-decline-in-fentanyl-crossing-the-border/",
    "timestamp": "2025-06-03T14:38:07Z"
  },
  {
    "title": "Nvidia has soared 45% in 2 months. These forces are reviving the hype for Wall Street's favorite AI play.",
    "description": "Nvidia stock has rallied 45% since hitting a low in April, adding $1 trillion in market value in about two months.",
    "link": "https://www.businessinsider.com/nvidia-stock-price-nvda-rally-ai-chips-china-tariffs-capex-2025-6",
    "timestamp": "2025-06-03T14:35:57Z"
  },
  {
    "title": "Trump is giving people the economic recovery they voted for (Michael Faulkender/Washington Examiner)",
    "description": "Michael Faulkender / Washington Examiner:\nTrump is giving people the economic recovery they voted for  —  Before COVID-19, President Donald Trump built a thriving economy that was a model for the rest of the world.  A return to the prosperity of that economy …",
    "link": "https://www.memeorandum.com/250603/p48",
    "timestamp": "2025-06-03T14:35:05Z"
  },
  {
    "title": "Trump re-ups July 4 deadline for passage of massive tax and immigration bill (Washington Post)",
    "description": "Washington Post:\nTrump re-ups July 4 deadline for passage of massive tax and immigration bill  —  President Donald Trump re-upped his call Monday night for Congress to send to his desk by July 4 the massive tax and immigration package that is pending in the S…",
    "link": "https://www.memeorandum.com/250603/p47",
    "timestamp": "2025-06-03T14:35:05Z"
  },
  {
    "title": "FBI Hounded for Epstein Files Update After Launching Tip Line to 'Protect Children' From Gender-Affirming Care: 'You Care More About Votes'",
    "description": "Users harassed the FBI for the release of the agency's files on Jeffrey Epstein following an announcement that it was taking tips on gender-affirming care.",
    "link": "https://www.ibtimes.com/fbi-hounded-epstein-files-update-after-launching-tip-line-protect-children-gender-affirming-3775085",
    "timestamp": "2025-06-03T14:34:12Z"
  },
  {
    "title": "Nick Offerman blasts Michael Flynn’s son for using Parks and Rec clip in homophobic post",
    "description": "Son of the embattled former National Security Advisor is known for sharing controversial posts on X",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/nick-offerman-michael-flynn-homophobic-post-b2762745.html",
    "timestamp": "2025-06-03T14:32:59Z"
  },
  {
    "title": "Steelers respond to fans angered by Mason Rudolph’s presence at Donald Trump rally",
    "description": "The “stick to sports” door swings both ways. While the term rose to significance as a catchphrase for conservative voices who hoped to shout down athletes and media with conflicting beliefs (athletes and media who agreed were and are exempt from being told to…",
    "link": "https://freerepublic.com/focus/f-chat/4320721/posts",
    "timestamp": "2025-06-03T14:32:49Z"
  },
  {
    "title": "Oil Extends Gains as Canada Wildfires Offset OPEC+ Output Hike",
    "description": "(Bloomberg) -- Oil rose for a second day as supply disruptions from Canada’s wildfires countered OPEC’s latest bumper supply increase.Most Read from...",
    "link": "https://finance.yahoo.com/news/oil-holds-gains-canada-wildfires-091740439.html",
    "timestamp": "2025-06-03T14:32:34Z"
  },
  {
    "title": "Should academia practice “political DEI” and hire more conservatives?",
    "description": "The Atlantic article below, by staff writer Rose Horowitch, points out a fact the whole world knows: academia in America comprises nearly exclusively faculty of a liberal persuasion. Conservative professors are as rare as hen’s teeth. This has led to a dearth…",
    "link": "https://whyevolutionistrue.com/2025/06/03/should-academia-practice-political-dei-and-hire-more-conservatives/",
    "timestamp": "2025-06-03T14:30:13Z"
  },
  {
    "title": "WATCH: Escaped Louisiana Inmate, Still at Large, Releases Video Begging Trump and Lil Wayne for Help",
    "description": "A Louisiana inmate who escaped from a New Orleans jail last month and remains on the run has released a video begging President Donald Trump and rapper Lil Wayne for help.\nThe post WATCH: Escaped Louisiana Inmate, Still at Large, Releases Video Begging Trump …",
    "link": "https://www.thegatewaypundit.com/2025/06/watch-escaped-louisiana-inmate-still-large-releases-video/",
    "timestamp": "2025-06-03T14:30:09Z"
  },
  {
    "title": "Big Tech Is Part of Trump’s Threat to the Global Order",
    "description": "Silicon Valley is turning into an instrument of U.S. coercion, and that’s a danger to each and every country.",
    "link": "http://foreignpolicy.com/2025/06/03/trump-big-tech-companies-silicon-valley-threat-geopolitics-digital-sovereignty/",
    "timestamp": "2025-06-03T14:29:14Z"
  },
  {
    "title": "U.S. tariffs slowed down China's manufacturing in May",
    "description": "A new survey of Chinese manufacturers released Tuesday showed factory activity shrank in May, dropping to the lowest level in nearly three years after a barrage of tariffs from the Trump administration dented the sector.Read more...",
    "link": "https://qz.com/china-manufacturing-activity-may-pmi-report-tariffs-1851783462",
    "timestamp": "2025-06-03T14:29:00Z"
  },
  {
    "title": "US to scale down its military bases in Syria, envoy says",
    "description": "ANKARA (Reuters) -The United States will scale down its military presence in Syria to one base from eight and U.S. policies will shift in the country \"because none of them worked\" over the last century, the new U.S. special envoy has said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/03/us-to-scale-down-its-military-bases-in-syria-envoy-says",
    "timestamp": "2025-06-03T14:29:00Z"
  },
  {
    "title": "Carney Unveils Infrastructure Boost as Trump Targets Canada's Economy",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCanadian Prime Minister Mark Carney announced that his government would push legislation to speed up \"nation-building\" infrastructure projects across the country, following a surge in tariffs by U.S. President…",
    "link": "https://biztoc.com/x/6a305cc2cd9169b0",
    "timestamp": "2025-06-03T14:28:30Z"
  },
  {
    "title": "Dutch government falls apart over immigration; New elections upcoming",
    "description": "A dispute about a migration crackdown has led to political chaos in the Netherlands.",
    "link": "https://www.bostonherald.com/2025/06/03/netherlands-politics-caretaker-administration/",
    "timestamp": "2025-06-03T14:27:10Z"
  },
  {
    "title": "Still a No: Rand Paul says $5T debt increase in 'Big, Beautiful Bill' a deal-breaker",
    "description": "Sen. Rand Paul, R-Ky., said the debt limit increase included in the One Big Beautiful Bill Act is still a deal-breaker for him, saying it goes against conservative values, despite discussions with President Donald Trump about his concerns. Paul told reporters…",
    "link": "https://freerepublic.com/focus/f-news/4320718/posts",
    "timestamp": "2025-06-03T14:26:18Z"
  },
  {
    "title": "James Carville Dumps on Progressive ‘Pom Pom Caucus’ for Going to Coachella",
    "description": "James Carville dumped on his party's progressive \"pom pom caucus\" while urging them to join in on spoiling President Donald Trump's planned military parade.\nThe post James Carville Dumps on Progressive ‘Pom Pom Caucus’ for Going to Coachella first appeared on…",
    "link": "https://www.mediaite.com/media/podcasts/james-carville-dumps-on-progressive-pom-pom-caucus-for-going-to-coachella/",
    "timestamp": "2025-06-03T14:26:03Z"
  },
  {
    "title": "Trump Makes Delusional Claim About Tariffs as Economy Deteriorates",
    "description": "The U.S. economy is falling apart in front of our very eyes—but you wouldn’t know that to hear Donald Trump tell it.\r\nThe U.S. president took to social media in the wee hours of Tuesday morning to claim that his tariffs are the best thing ever.\r\n“Because of T…",
    "link": "https://newrepublic.com/post/196038/donald-trump-tariffs-economy-oecd-growth",
    "timestamp": "2025-06-03T14:24:27Z"
  },
  {
    "title": "Whistleblower aide Miles Taylor files formal complaint over Trump's retaliation",
    "description": "Former Trump administration security official and whistleblower Miles Taylor is filing a formal complaint with the inspectors general of the Departments of Justice and Homeland Security, alleging that President Donald Trump's memorandum declaring him a \"trait…",
    "link": "https://www.rawstory.com/miles-taylor-2672255090/",
    "timestamp": "2025-06-03T14:23:46Z"
  }
]