[
  {
    "title": "In Brief: Reviving the U.S. Shipbuilding Industry",
    "description": "On April 9, President Donald Trump signed a new executive order aimed at boosting the country’s shipbuilding capacity. Some members of Congress also are seeking to promote U.S. shipbuilding, including re-introducing the Shipbuilding and Harbor Infrastructure …",
    "link": "https://warontherocks.com/2025/05/in-brief-reviving-the-u-s-shipbuilding-industry/",
    "timestamp": "2025-05-06T17:30:52Z"
  },
  {
    "title": "Karoline Leavitt berates CNN for airing ‘despicable’ interview with Mexican cartel member",
    "description": "During an interview on Fox News Channel's \"Hannity,\" White House press secretary Karoline Leavitt slammed CNN for airing a \"softball\" interview with a Mexican cartel member.",
    "link": "https://www.foxnews.com/media/karoline-leavitt-berates-cnn-airing-despicable-interview-mexican-cartel-member",
    "timestamp": "2025-05-06T17:30:46Z"
  },
  {
    "title": "Alberta Premier’s chief of staff defends business class flight from Trump visit",
    "description": "EDMONTON — The chief of staff to Alberta Premier Danielle Smith is defending a business class flight he charged to taxpayers, citing a health condition that increases his risk of blood clots. The flight in question was a return flight he took from Fort Lauder…",
    "link": "https://financialpost.com/pmn/alberta-premiers-chief-of-staff-defends-business-class-flight-from-trump-visit",
    "timestamp": "2025-05-06T17:30:45Z"
  },
  {
    "title": "New Hampshire Becomes First State to Approve Crypto Reserve Law",
    "description": "Governor Kelly Ayotte signed a bill into law that allows the investment of a portion of the state's public funds in precious metals and crypto assets.",
    "link": "https://www.coindesk.com/policy/2025/05/06/new-hampshire-becomes-first-state-to-approve-crypto-reserve-law",
    "timestamp": "2025-05-06T17:25:59Z"
  },
  {
    "title": "WATCH: Police Arrest 30 During Fiery Anti-Israel Protest at University of Washington",
    "description": "At least 30 anti-Israel protesters were arrested Monday after occupying an engineering building at the University of Washington in Seattle.\nThe post WATCH: Police Arrest 30 During Fiery Anti-Israel Protest at University of Washington appeared first on Breitba…",
    "link": "https://www.breitbart.com/education/2025/05/06/watch-police-arrest-30-during-fiery-anti-israel-protest-at-university-of-washington/",
    "timestamp": "2025-05-06T17:25:28Z"
  },
  {
    "title": "Houthis Surrender, U.S. Bombings To Stop “Immediately”",
    "description": "President Donald Trump announced Tuesday that the United States will stop bombing Yemen’s Houthi rebels, saying the Iran-backed group has agreed to halt attacks on shipping lanes in the Middle East. “They don’t want to fight anymore,” Trump told reporters at …",
    "link": "https://biztoc.com/x/253f580cbe51c640",
    "timestamp": "2025-05-06T17:24:54Z"
  },
  {
    "title": "US trade deficit hits record high ahead of Trump tariffs",
    "description": "The U.S. trade deficit soared to a monthly record of $140.5 billion in March, signaling a rush for imports from businesses and consumers alike ahead of President Donald Trump’s latest — and most sweeping — tariffs taking effect",
    "link": "https://abcnews.go.com/US/wireStory/us-trade-deficit-hits-record-high-businesses-consumers-121525965",
    "timestamp": "2025-05-06T17:24:30Z"
  },
  {
    "title": "WATCH: Trump says Houthis ‘don’t want to fight anymore,’ U.S. will stop bombings",
    "description": "President Donald Trump announced Tuesday that Houthi rebel forces in Yemen had signaled to the United States that “they don't want to fight anymore.”",
    "link": "https://biztoc.com/x/9883e5dfaa493b44",
    "timestamp": "2025-05-06T17:24:27Z"
  },
  {
    "title": "‘Capitulated’: Trump Says US Will Cease Bombing Operations Against Houthis",
    "description": "President Donald Trump announced Tuesday that the US will end bombing campaigns against Houthi rebels in Yemen.",
    "link": "https://dailycaller.com/2025/05/06/capitulated-trump-says-us-will-cease-bombing-operations-against-houthis/",
    "timestamp": "2025-05-06T17:24:23Z"
  },
  {
    "title": "European Stocks Snap 10-Day Winning Streak With DAX in Retreat",
    "description": "European stocks snapped a ten-day winning streak on concern Germany’s Friedrich Merz will come into power with diminished authority to push forward his agenda.",
    "link": "https://financialpost.com/pmn/business-pmn/european-stocks-snap-10-day-winning-streak-with-dax-in-retreat",
    "timestamp": "2025-05-06T17:24:19Z"
  },
  {
    "title": "‘My Social Security is my Social Security’: With Trump, Musk and DOGE, will it stay that way?",
    "description": "OAKLAND — A hand-crafted sign outside the downtown Social Security Administration office mimicked a street sign, depicting the intersection of “Prosecute” and “Trump.” The chants came from about 50 people surrounding it, holding furious signs aimed at Preside…",
    "link": "https://biztoc.com/x/485b2caffc9b5a72",
    "timestamp": "2025-05-06T17:24:13Z"
  },
  {
    "title": "Lawrence O’Donnell Insists Trump’s Foreign Movies Tariff Will Never Happen: ‘Nothing to See Here’ | Video",
    "description": "\"It's just more Trumpian nonsense,\" the MSNBC anchor says\nThe post Lawrence O’Donnell Insists Trump’s Foreign Movies Tariff Will Never Happen: ‘Nothing to See Here’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-foreign-movies-tariff-lawrence-odonnell-never-happen/",
    "timestamp": "2025-05-06T17:23:36Z"
  },
  {
    "title": "Australian MAGA cafe closes after just six weeks of operation, owner blames ‘snowflakes’",
    "description": "A cafe owner has closed his business just six weeks after opening in Sydney’s inner west, blaming “snowflakes” for the failure of his latest venture.",
    "link": "https://nypost.com/2025/05/06/world-news/australian-maga-cafe-closes-after-just-6-weeks-of-operation/",
    "timestamp": "2025-05-06T17:23:28Z"
  },
  {
    "title": "Republicans Are Terrified MTG Might Run for Senate",
    "description": "At least one thing has Republicans in D.C. on edge: Representative Marjorie Taylor Greene’s quest for power.\r\nNow that Governor Brian Kemp is officially out of the race, the fervent MAGA acolyte is rumored to be one of a dozen conservatives considering a run …",
    "link": "https://newrepublic.com/post/194914/mtg-republicans-terrified-run-senate",
    "timestamp": "2025-05-06T17:23:27Z"
  },
  {
    "title": "Canadian prime minister to Trump: We're not for sale",
    "description": "Mark Carney told Donald Trump that in real estate, \"some places that are never for sale\" — that includes Canada.",
    "link": "https://www.businessinsider.com/canadian-prime-minister-mark-carney-trump-canada-not-for-sale-2025-5",
    "timestamp": "2025-05-06T17:23:11Z"
  },
  {
    "title": "CNN: Americans Think Trump Handling Crime 'Far Better Than Joe Biden'",
    "description": "On Tuesday's \"CNN This Morning,\" network contributor Harry Enten noted an ABC-IPSOS poll showing Americans viewing President Donald Trump's efforts to address crime significantly \"better\" than former President Joe Biden.\nThe post CNN: Americans Think Trump Ha…",
    "link": "https://www.breitbart.com/clips/2025/05/06/cnn-americans-think-trump-handling-crime-far-better-than-joe-biden/",
    "timestamp": "2025-05-06T17:22:18Z"
  },
  {
    "title": "Threatened by Trump tariffs, Japan walks a delicate tightrope between US and China",
    "description": "Among all U.S. allies being wooed by Beijing, Japan stands out.",
    "link": "https://www.bostonherald.com/2025/05/06/tariffs-japan-china/",
    "timestamp": "2025-05-06T17:22:07Z"
  },
  {
    "title": "Jon Voight Says He Met With Trump To Recommend Tariff Plans To 'Rescue Hollywood’",
    "description": "The president initially called for a 100% tariff on films produced outside the U.S. after claiming foreign incentives for U.S. filmmakers a “National Security threat.”",
    "link": "https://www.huffpost.com/entry/jon-voight-hollywood-tariff-trump_n_681a2d16e4b0981671adb775",
    "timestamp": "2025-05-06T17:22:03Z"
  },
  {
    "title": "Kamala Harris stuns as the sole politician at Met Gala 2025; here's what she wore and why everyone's talking about it",
    "description": "Kamala Harris attended the Met Gala this year. She wore a bespoke black-and-white Off-White dress. The dress was designed by IB Kamara. It was a floor-length gown with a built-in scarf. Harris completed her look with a clutch and emerald jewellery. This was h…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kamala-harris-stuns-as-the-sole-politician-at-met-gala-2025-heres-what-she-wore-and-why-everyones-talking-about-it/articleshow/120938321.cms",
    "timestamp": "2025-05-06T17:21:19Z"
  },
  {
    "title": "Elon Musk's Urgent Concern: That the Earth Is Going to Get Swallowed by the Sun",
    "description": "Instead of meaningfully addressing a growing climate crisis and actively stripping environmental regulations, actions that could have devastating consequences for humanity in the short term, billionaire Elon Musk is far more concerned about delivering humanit…",
    "link": "https://futurism.com/elon-musk-earth-swallowed-sun",
    "timestamp": "2025-05-06T17:20:33Z"
  },
  {
    "title": "Key Trump campaign vow makes it to House floor — and it's much 'narrower' than promised",
    "description": "A key campaign promise from Donald Trump is making its way to the House floor — but it's a much diluted version of what he'd proposed.Sen. Roger Marshall (R-KS) is introducing a ‘narrower’ take on the vow not to tax overtime pay, according to an exclusive rep…",
    "link": "https://www.rawstory.com/no-tax-on-tips-2671899589/",
    "timestamp": "2025-05-06T17:19:37Z"
  },
  {
    "title": "Trump signs executive order restricting research that could trigger pandemics",
    "description": "After Biden 'allowed gain-of-function' work 'without sufficient oversight'",
    "link": "https://www.wnd.com/2025/05/trump-signs-executive-order-restricting-research-that-could-trigger-pandemics/",
    "timestamp": "2025-05-06T17:19:29Z"
  },
  {
    "title": "WATCH: Trump says Houthis ‘don’t want to fight anymore,’ U.S. will stop bombings",
    "description": "President Donald Trump announced Tuesday that Houthi rebel forces in Yemen had signaled to the United States that “they don't want to fight anymore.”",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-says-houthis-dont-want-to-fight-anymore-u-s-will-stop-bombings",
    "timestamp": "2025-05-06T17:19:15Z"
  },
  {
    "title": "Canadian province could hold secession referendum – premier",
    "description": "Albertan Premier Danielle Smith has said a vote on separation will be held next year if a petition gains enough support Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616869-alberta-break-away-vote-canada/",
    "timestamp": "2025-05-06T17:18:56Z"
  },
  {
    "title": "‘Never Say Never’: Trump Refuses to Give Up On Canada Joining the U.S.",
    "description": "President Donald Trump is not ready to let go of Canada becoming America’s 51st state, arguing “never say never” as reporters pressed on the issue during an Oval Office meeting between Trump and Canada’s new prime minister. After PM Mark Carney once again dec…",
    "link": "https://www.mediaite.com/news/never-say-never-trump-refuses-to-give-up-on-canada-joining-the-u-s-in-front-of-new-pm/",
    "timestamp": "2025-05-06T17:18:55Z"
  },
  {
    "title": "On the attack: Trump’s media response in Abrego Garcia story is notably vigorous",
    "description": "It reflects a leader whose hostility toward the press is no secret.",
    "link": "https://www.bostonherald.com/2025/05/06/media-trump-abrego-garcia/",
    "timestamp": "2025-05-06T17:18:50Z"
  },
  {
    "title": "As Trump battles elite colleges, House GOP looks to hike endowment tax by tenfold or more",
    "description": "As Congress looks to slash spending and raise revenue for President Donald Trump’s tax bill, Republicans have turned attention to the huge endowments amassed by the country’s wealthiest colleges",
    "link": "https://abcnews.go.com/Business/wireStory/trump-battles-elite-colleges-house-gop-hike-endowment-121526028",
    "timestamp": "2025-05-06T17:18:47Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "NEW YORK (AP) — The U.S. trade deficit soared to a record $140.5 billion in March as consumers and businesses alike tried to get ahead of President Donald Trump’s latest and most sweeping tariffs — with federal data showing an enormous stockpiling of pharmace…",
    "link": "https://financialpost.com/pmn/us-trade-deficit-hits-record-high-as-businesses-consumers-try-to-get-ahead-of-trump-tariffs",
    "timestamp": "2025-05-06T17:18:25Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "The U.S. trade deficit soared to a monthly record of $140.5 billion in March, signaling a rush for imports from businesses and consumers alike ahead of President Donald Trump’s latest — and most sweeping — tariffs taking effect",
    "link": "https://abcnews.go.com/Business/wireStory/us-trade-deficit-hits-record-high-businesses-consumers-121524907",
    "timestamp": "2025-05-06T17:18:24Z"
  },
  {
    "title": "Latest Hegseth Controversy: Pentagon Chief Reportedly Halted Ukraine Aid Flights Without Trump’s Permission",
    "description": "The Pentagon is reportedly in disarray under Hegseth’s leadership, according to multiple reports.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/06/latest-hegseth-controversy-pentagon-chief-reportedly-halted-ukraine-aid-flights-without-trumps-permission/",
    "timestamp": "2025-05-06T17:17:24Z"
  },
  {
    "title": "Canada trade shifts away from US amid trade tensions",
    "description": "New data show both imports and exports with US fall as Canada expands trading relationships with other countries.",
    "link": "https://www.aljazeera.com/economy/2025/5/6/canada-trade-shifts-away-from-us-amid-trade-tensions",
    "timestamp": "2025-05-06T17:16:12Z"
  },
  {
    "title": "Tariffs: Hard And Soft Data Tell Two Very Different Stories, For Now",
    "description": "Reported economic data has remained robust despite broad pessimistic predictions about tariffs on the economy. But upcoming releases may be more informative.",
    "link": "https://www.forbes.com/sites/simonmoore/2025/05/06/tariffs-hard-and-soft-data-tell-two-very-different-stories-for-now/",
    "timestamp": "2025-05-06T17:15:46Z"
  },
  {
    "title": "Two more judges block the Trump administration’s use of the Alien Enemies Act to deport migrants | CNN Politics",
    "description": "Two more federal judges on Tuesday blocked the Trump administration’s use of deportations under the Alien Enemies Act, saying the wartime power shouldn’t be used.",
    "link": "https://www.cnn.com/2025/05/06/politics/judge-blocks-trump-administration-deport-migrants",
    "timestamp": "2025-05-06T17:15:23Z"
  },
  {
    "title": "‘My Social Security is my Social Security’: With Trump, Musk and DOGE, will it stay that way?",
    "description": "\"I think that's really the biggest concern we all have. Is it gonna be there for me? You hear what Musk and these other people say, and it really makes you wonder.\"",
    "link": "https://www.bostonherald.com/2025/05/06/social-security-doge-trump-elon-musk-bay-area/",
    "timestamp": "2025-05-06T17:15:23Z"
  },
  {
    "title": "Bill O’Reilly Winces At Trump’s ‘Dopey’ Photo Depicting Himself as Pope: ‘The Guy Just Died!’",
    "description": "Bill O'Reilly slammed President Donald Trump posting an AI-generated image of himself as the pope as \"dopey\" and not the best message for his base.\nThe post Bill O’Reilly Winces At Trump’s ‘Dopey’ Photo Depicting Himself as Pope: ‘The Guy Just Died!’ first ap…",
    "link": "https://www.mediaite.com/tv/bill-oreilly-winces-at-trumps-dopey-photo-depicting-himself-as-pope-the-guy-just-died/",
    "timestamp": "2025-05-06T17:14:49Z"
  },
  {
    "title": "\"They Will Drop It To Nothing\": Trump's Big Claim On India Tariffs",
    "description": "US President Donald Trump on Tuesday claimed India will its tariffs on imports from the US to &quot;nothing&quot;. He shared no details on goods and sectors affected.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-big-claim-on-india-tariffs-they-will-drop-it-to-nothing-8347362",
    "timestamp": "2025-05-06T17:14:44Z"
  },
  {
    "title": "Harvard president pressed on why Americans hate university, acknowledges 'real problems we should address'",
    "description": "Alan Garber, the president of Harvard University was asked about why Americans hate Harvard and other elite institutions during an interview with the WSJ.",
    "link": "https://www.foxnews.com/media/harvard-president-pressed-why-americans-hate-university-acknowledges-real-problems-we-should-address",
    "timestamp": "2025-05-06T17:13:39Z"
  },
  {
    "title": "Republicans May Have Just Tanked A Controversial Trump Nominee",
    "description": "The president’s pick for D.C.'s top U.S. attorney, an election denier who dropped cases against Jan. 6 defendants, doesn’t have the votes to advance.",
    "link": "https://www.huffpost.com/entry/ed-martin-dc-us-attorney-republicans_n_6818db88e4b01ad5174d59be",
    "timestamp": "2025-05-06T17:13:38Z"
  },
  {
    "title": "Trump's crypto ventures cause tensions to bubble over as Democratic lawmaker scuttles key hearing",
    "description": "Tensions on Capitol Hill over President Donald Trump's various cryptocurrency ventures escalated on Tuesday and threatened to derail the digital asset sector's hope of legislation by the end of this year as a top Democratic lawmaker stalled efforts to debate …",
    "link": "https://www.channelnewsasia.com/business/trumps-crypto-ventures-cause-tensions-bubble-over-democratic-lawmaker-scuttles-key-hearing-5112601",
    "timestamp": "2025-05-06T17:13:10Z"
  },
  {
    "title": "Carney tells Trump that Canada ‘won’t be for sale ever’",
    "description": "President Donald Trump told reporters he still believes Canada should become the 51st state while sitting next to Canadian Prime Minister Mark Carney. Carney then responded that Canada “won’t be for sale ever,” but was open to more collaboration on security.",
    "link": "https://biztoc.com/x/5eb77f8960b11257",
    "timestamp": "2025-05-06T17:13:01Z"
  },
  {
    "title": "Israel blindsided by Trump's Houthi announcement, sources tell 'Post'",
    "description": "\"They said please don't bomb us anymore and we're not going to attack your ships,\" Trump said.",
    "link": "https://www.jpost.com/breaking-news/article-852897",
    "timestamp": "2025-05-06T17:12:42Z"
  },
  {
    "title": "Teamsters Applaud Trump’s Movie Tariff Proposal As A Way To End Studios’ “Un-American Addiction To Outsourcing Our Members’ Work”",
    "description": "The Teamsters have thrown their support behind Donald Trump’s plan to save Hollywood, which sent most of the industry into a tizzy Monday after the President proposed 100% tariffs on movies made outside the U.S. “We thank President Trump for boldly supporting…",
    "link": "http://deadline.com/2025/05/teamsters-support-trump-movie-tariff-proposal-1236387045/",
    "timestamp": "2025-05-06T17:12:10Z"
  },
  {
    "title": "Voters Reject President Trump's Dystopian Plans for \"Public Safety\"",
    "description": "President Donald Trump has been pushing mass deportations, aggressive law enforcement measures, and a sweeping expansion of the death penalty as the path to public safety— all while cutting the very programs that actually make communities safer.\nVoters aren’t…",
    "link": "https://www.aclu.org/news/civil-liberties/voters-reject-president-trumps-dystopian-plans-for-public-safety",
    "timestamp": "2025-05-06T17:12:09Z"
  },
  {
    "title": "Greenland belongs to Greenlanders, EU’s top diplomat warns",
    "description": "Kaja Kallas used her opening address to the European Parliament to rebuke Donald Trump's plans to seize the self-ruling Danish territory.",
    "link": "https://www.politico.eu/article/greenland-trump-kaja-kallas-determination-european-union/",
    "timestamp": "2025-05-06T17:11:46Z"
  },
  {
    "title": "Can Trump Deport Immigrants Without Due Process? What To Know After President And Stephen Miller Suggest They Can",
    "description": "Federal immigration law has long held that immigrants present in the U.S. have due process rights protecting them from automatic deportation.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/05/06/can-trump-deport-immigrants-without-due-process-what-to-know-after-president-and-stephen-miller-suggest-they-can/",
    "timestamp": "2025-05-06T17:10:25Z"
  },
  {
    "title": "Disabled workers have faced prejudice. Now they face DOGE firings",
    "description": "Disabled employees are among those being let go in Trump's mass layoffs.",
    "link": "https://www.bostonherald.com/2025/05/06/disabled-workers-fired/",
    "timestamp": "2025-05-06T17:10:04Z"
  },
  {
    "title": "FBI Swept Congressional Baseball Game Shooter’s Left-Wing Extremist Motives Under Rug, House Report Says",
    "description": "A Tuesday report alleged the FBI withheld critical information confirming the political motivation of the 2017 Congressional baseball game shooting.",
    "link": "https://dailycaller.com/2025/05/06/fbi-swept-congressional-baseball-game-shooters-left-wing-extremist-motives-under-rug-house-report-says/",
    "timestamp": "2025-05-06T17:07:34Z"
  },
  {
    "title": "What happens to Hollywood if Trump targets movies made abroad",
    "description": "President Donald Trump said he would impose a 100% tariff on movies made outside the US. But what does that mean for Hollywood? We break it down.",
    "link": "https://www.businessinsider.com/what-happens-to-hollywood-if-trump-targets-movies-made-abroad-2025-5",
    "timestamp": "2025-05-06T17:07:02Z"
  },
  {
    "title": "Hollywood confounded by Trump's film tariff idea",
    "description": "President Trump proposed a '100% tariff' on movies 'produced in foreign lands'",
    "link": "https://theweek.com/politics/trump-movie-tariffs-hollywood",
    "timestamp": "2025-05-06T17:04:56Z"
  },
  {
    "title": "Africa’s Dream of Political and Economic Independence",
    "description": "The full thrust of independence is non-negotiable, as summed up in political activities and exploits etched permanently in books the founder of Ghana, Osagyefo Kwame Nkrumah, unmistakably pointed out with relative ease.\nUnder no circumstances should the indep…",
    "link": "https://www.globalresearch.ca/africa-dream-political-economic-independence/5884970",
    "timestamp": "2025-05-06T17:04:33Z"
  },
  {
    "title": "Trump Says He’ll Set Trade Terms, Doesn’t Need Tariff Deals",
    "description": "US President Donald Trump said he would dictate tariff levels for US trading partners looking to avoid higher duties, appearing to move away from the idea that he would engage in back-and-forth negotiations.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-hell-set-trade-terms-doesnt-need-tariff-deals",
    "timestamp": "2025-05-06T17:03:54Z"
  },
  {
    "title": "\"Never Say Never\": Trump To Carney's Canada Will \"Never Be For Sale\" Remark",
    "description": "US President Donald Trump began his first talks with Canadian Prime Minister Mark Carney on Tuesday and vowed to bring up &quot;tough points&quot; that are dividing the two countries since Trump imposed tariffs.",
    "link": "https://www.ndtv.com/world-news/never-say-never-says-trump-to-mark-carneys-canada-will-never-be-for-sale-comment-at-white-house-8347259",
    "timestamp": "2025-05-06T17:03:29Z"
  },
  {
    "title": "‘Just the way it is.’ Trump says Canada’s prime minister can do nothing to reduce tariffs today | CNN Business",
    "description": "President Donald Trump, in his first Oval Office meeting with new Canadian Prime Minister Mark Carney, said there was nothing Carney could say to him Tuesday that would convince the president to reduce tariffs on Canadian goods.",
    "link": "https://www.cnn.com/2025/05/06/business/trump-carney-tariffs",
    "timestamp": "2025-05-06T17:03:13Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "By WYATTE GRANTHAM-PHILIPS, AP Business Writer\nNEW YORK (AP) — The U.S. trade deficit soared to a record $140.5 billion in March as consumers and businesses alike tried to get ahead of President Donald Trump’s latest and most sweeping tariffs.\nRelated Article…",
    "link": "https://biztoc.com/x/87390c47db0b3a69",
    "timestamp": "2025-05-06T17:02:04Z"
  },
  {
    "title": "Ohio governor moves to keep the state GOP from endorsing Trump-backed Vivek Ramaswamy to succeed him",
    "description": "CLEVELAND — President Donald Trump endorsed Vivek Ramaswamy on the night he kicked off his campaign to be Ohio’s next governor.",
    "link": "https://www.nbcnews.com/politics/2026-election/ohio-governor-moves-keep-state-gop-endorsing-trump-backed-vivek-ramasw-rcna205146",
    "timestamp": "2025-05-06T17:01:17Z"
  },
  {
    "title": "Bitcoin Reserve Report Delayed: US Treasury Silent After May 5 Deadline",
    "description": "Two months after US President Donald J. Trump signed an executive order to establish a Strategic Bitcoin Reserve (SBR), the US Treasury Department has missed its most consequential deadline yet, declining to release—or even acknowledge—the mandated evaluation…",
    "link": "https://bitcoinist.com/bitcoin-reserve-report-delayed-us-treasury/",
    "timestamp": "2025-05-06T17:00:28Z"
  },
  {
    "title": "Trump: U.S. Will Stop Bombing Yemen After Houthis ‘Capitulated’",
    "description": "\"They just don't want to fight. And we will honor that and we will stop the bombings.\"\nThe post Trump: U.S. Will Stop Bombing Yemen After Houthis ‘Capitulated’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-u-s-will-stop-bombing-yemen-after-houthis-capitulated/",
    "timestamp": "2025-05-06T17:00:02Z"
  },
  {
    "title": "Trump Accidentally Admits He Hasn’t Made Any Trade Deals",
    "description": "President Donald Trump claimed Tuesday that the U.S. doesn’t “have to sign” any trade deals, inadvertently admitting that his administration hasn’t made any progress during the 90-day pause on his disastrous tariffs. \r\nDuring a tense meeting to discuss tariff…",
    "link": "https://newrepublic.com/post/194920/donald-trump-admits-no-trade-deals",
    "timestamp": "2025-05-06T16:58:49Z"
  },
  {
    "title": "US Attorney’s Nomination In Jeopardy After Key GOP Senator Comes Out Against Him",
    "description": "Interim U.S. attorney for the District of Columbia Ed Martin's nomination to serve as the district's top prosecutor is in serious jeopardy.",
    "link": "https://dailycaller.com/2025/05/06/us-attorneys-nomination-in-jeopardy-after-key-gop-senator-comes-out-against-him/",
    "timestamp": "2025-05-06T16:58:37Z"
  },
  {
    "title": "Elon Musk Discovers That Serious Spending Cuts Are 'Really Difficult'",
    "description": "As he shifts his focus away from DOGE, he acknowledges the need for hard choices and congressional action.",
    "link": "https://reason.com/2025/05/07/elon-musk-discovers-that-serious-spending-cuts-are-really-difficult/",
    "timestamp": "2025-05-06T16:58:31Z"
  },
  {
    "title": "New Jersey Assembly lawmakers to weigh bills aimed at easing impact of electricity prices",
    "description": "Among the bills are measures that would alter how state regulators set profit margins for utilities, create training requirements for those regulators, and require the Board of Public Utilities to study the impact data centers have on electricity prices.",
    "link": "https://newjerseymonitor.com/2025/05/05/assembly-lawmakers-to-weigh-bills-aimed-at-easing-impact-of-electricity-prices/",
    "timestamp": "2025-05-06T16:57:47Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "The latest jump arrived as trade wars deepened abroad.",
    "link": "https://www.denverpost.com/2025/05/06/us-trade-deficit-record/",
    "timestamp": "2025-05-06T16:57:40Z"
  },
  {
    "title": "Trump Is Right: The European Scheme Has Collapsed",
    "description": "Everyone from Trump to Europeans themselves know that the precursor to the EU was created with the so-called “ideal” of unifying the European people after two horribly devastating world wars. The saying goes that we wanted to keep the Russians out, the US in,…",
    "link": "https://freerepublic.com/focus/f-news/4315362/posts",
    "timestamp": "2025-05-06T16:57:40Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "The latest jump arrived as trade wars deepened abroad.",
    "link": "https://www.bostonherald.com/2025/05/06/us-trade-deficit-record/",
    "timestamp": "2025-05-06T16:57:40Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "The U.S. trade deficit soared to a monthly record of $140.5 billion in March, signaling a rush for imports from businesses and consumers alike ahead of President Donald Trump’s latest — and most sweeping — tariffs taking effect.",
    "link": "https://www.clickondetroit.com/business/2025/05/06/us-trade-deficit-hits-record-high-as-businesses-consumers-try-to-get-ahead-of-trump-tariffs/",
    "timestamp": "2025-05-06T16:56:09Z"
  },
  {
    "title": "‘I’m Not Profiting From Anything’ – Trump Denies Personal Gains From Administration’s Pro-Crypto Stance",
    "description": "US President Donald Trump is rejecting allegations that he is personally benefiting from his administration’s crypto-friendly policies. In a new NBC News interview, Trump says one of the reasons for his administration’s pro-crypto stance is to avoid ceding gr…",
    "link": "https://dailyhodl.com/2025/05/06/im-not-profiting-from-anything-trump-denies-personal-gains-from-administrations-pro-crypto-stance/",
    "timestamp": "2025-05-06T16:55:16Z"
  },
  {
    "title": "WATCH: Trump claims Houthis ‘don’t want to fight,’ says U.S. will stop bombing ‘effective immediately’",
    "description": "'They just don't want to, and we will honor that'",
    "link": "https://www.wnd.com/2025/05/watch-trump-claims-houthis-dont-want-to-fight-says-u-s-will-stop-bombing-effective-immediately/",
    "timestamp": "2025-05-06T16:52:12Z"
  },
  {
    "title": "Trump says US ‘will stop’ bombing Yemen’s Houthis, claims ‘they don’t want to fight anymore’",
    "description": "The Houthis have been sporadically firing off missiles and drone strikes against ships traversing the Red Sea.",
    "link": "https://nypost.com/2025/05/06/us-news/trump-says-us-will-stop-bombing-yemens-houthis-claims-they-dont-want-to-fight-anymore/",
    "timestamp": "2025-05-06T16:51:24Z"
  },
  {
    "title": "Two surprising companies aren't scared of the trade war",
    "description": "For months, many people throughout the United States and beyond have been considering a pressing question with no clear answer: how much will the trade war impact my finances?\nSince President Donald Trump quickly made good on his promise to levy tariffs again…",
    "link": "https://biztoc.com/x/357c7eff2e05290e",
    "timestamp": "2025-05-06T16:51:02Z"
  },
  {
    "title": "How Utah dentists are preparing patients for the first statewide fluoride ban",
    "description": "President Donald Trump gave Canada's new prime minister, Mark Carney, a frosty welcome to the White House on Tuesday, saying on social media just before his arrival that the United States doesn't need “ANYTHING” from its northern neighbor.",
    "link": "https://biztoc.com/x/a5280acad662494e",
    "timestamp": "2025-05-06T16:50:50Z"
  },
  {
    "title": "Trump: Houthis told US they will not fight anymore",
    "description": "United States President Donald Trump revealed on Tuesday that the Houthis informed Washington that they \"don't want to fight anymore.\"\"We will honor that and we will stop the bombings [effective immed...",
    "link": "https://biztoc.com/x/f2cbdf8f66b87c46",
    "timestamp": "2025-05-06T16:50:45Z"
  },
  {
    "title": "U.K., India seal trade deal amid fallout of Trump tariff wars",
    "description": "India and the UK agreed to a landmark trade deal slashing tariffs on cosmetics, vehicles, alcoholic beverages and other goods, as both sides look for wins to offset the disruption of President Donald Trump’s protectionist policies. \nPrime Minister Keir Starme…",
    "link": "https://biztoc.com/x/de82f6575ce7ba79",
    "timestamp": "2025-05-06T16:50:43Z"
  },
  {
    "title": "Trump teases massive mystery announcement coming within days: 'As big as it gets'",
    "description": "President Donald Trump teased a \"very big announcement\" as he met at the White House with newly elected Canadian Prime Minister Mark Carney Tuesday.The U.S. president told reporters in the Oval Office that Houthi rebels had agreed to stop fighting, a day afte…",
    "link": "https://www.rawstory.com/donald-trump-very-big-announcement/",
    "timestamp": "2025-05-06T16:50:41Z"
  },
  {
    "title": "Trump can't go it alone on his next big test",
    "description": "Now that the 100-day mark has passed, the next big milestone for President Donald Trump will be to pass what he calls his \"big beautiful tax bill.\"\nUnlike the flurry of executive orders he's signed already, this time he will have to get Congress to cooperate.…",
    "link": "https://biztoc.com/x/00d515334954d838",
    "timestamp": "2025-05-06T16:50:35Z"
  },
  {
    "title": "Whoopi Goldberg Fires Back at Donald Trump Over Movie Tariffs and Says ‘Please Stop’: ‘Could You Lower the Price of Eggs Before You Start This?’",
    "description": "Whoopi Goldberg is telling Donald Trump to “please stop” when it comes to Hollywood and movie tariffs. Trump caused shock and confusion in the film and TV industries this week by writing on social media that he had authorized the U.S. Trade Representative and…",
    "link": "https://variety.com/2025/film/news/whoopi-goldberg-slams-donald-trump-movie-tariffs-1236388633/",
    "timestamp": "2025-05-06T16:49:57Z"
  },
  {
    "title": "Republicans Silent as Trump Refuses to Commit to Upholding Constitution",
    "description": "Rolling Stone reached out to all 53 GOP senators after the president said he didn't know whether he needs to honor the nation's founding document. None replied",
    "link": "http://www.rollingstone.com/politics/politics-news/republicans-silent-trump-refuses-commit-constitution-1235332711/",
    "timestamp": "2025-05-06T16:49:50Z"
  },
  {
    "title": "US stocks sink again as more companies detail damage they're taking because of Trump's trade war",
    "description": "US stocks fell as AI enthusiasm cooled and companies, including Ford and Clorox, withdrew forecasts due to Trump’s tariff uncertainty. The S&P 500 dropped 0.5%, led by declines in Palantir and Nvidia. Market caution grows amid economic unpredictability and po…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-stocks-sink-again-as-more-companies-detail-damage-theyre-taking-because-of-trumps-trade-war/articleshow/120938819.cms",
    "timestamp": "2025-05-06T16:49:36Z"
  },
  {
    "title": "Ex-NFL reporter slams Kamala Harris as 'completely inauthentic'",
    "description": "Former NFL reporter Michele Tafoya blasted Kamala Harris as the former vice president begins to get back into the political arena following her presidential defeat.",
    "link": "https://www.foxnews.com/sports/ex-nfl-reporter-slams-kamala-harris-completely-inauthentic",
    "timestamp": "2025-05-06T16:48:21Z"
  },
  {
    "title": "Carney says Canada won't ever be for sale, with Trump responding 'never say never'",
    "description": "Trump has regularly said that he wants Canada to become a U.S. state, but Canada isn't interested.",
    "link": "https://www.foxnews.com/politics/carney-says-canada-wont-ever-sale-trump-responding-never-say-never",
    "timestamp": "2025-05-06T16:48:03Z"
  },
  {
    "title": "Meet the 64-Year-Old Social Worker Who Was Booted From a Republican Town Hall",
    "description": "Emily Feiner is not a diehard Democrat. The 64-year-old semi-retired social worker, who previously worked for the Department of Veterans Affairs, is not registered with either of the US’s major political parties. Feiner has voted for Republicans in the past, …",
    "link": "https://www.motherjones.com/politics/2025/05/emily-feiner-mike-lawler-town-hall/",
    "timestamp": "2025-05-06T16:47:10Z"
  },
  {
    "title": "Republican senator turns against key Trump nominee, potentially empowering activist Judge Boasberg",
    "description": "Republican Sen. Thom Tillis of North Carolina said he will not be supporting Ed Martin, President Donald Trump's nominee for U.S. attorney for Washington, D.C., which could lead to some unintended consequences. After meeting with Martin Monday night, Tillis t…",
    "link": "https://www.theblaze.com/news/republican-senator-turns-against-key-trump-nominee-potentially-empowering-activist-judge-boasberg",
    "timestamp": "2025-05-06T16:46:15Z"
  },
  {
    "title": "Israel approves plan to take over Gaza indefinitely",
    "description": "Benjamin Netanyahu says the country is 'on the eve of a forceful entry'",
    "link": "https://theweek.com/world-news/israel-occupy-gaza-netanyahu",
    "timestamp": "2025-05-06T16:45:54Z"
  },
  {
    "title": "Oil Jumps as Traders Buy the Dip",
    "description": "1m ago 11:49am CST Oil Stages Robust Comeback on Tuesday Oil prices staged a robust comeback on Tuesday, clawing back ground lost after OPEC’s surprise weekend announcement to boost production quotas by more than expected. WTI surged more than 4% on the day, …",
    "link": "https://oilprice.com/Energy/Oil-Prices/Oil-Jumps-as-Traders-Buy-the-Dip.html",
    "timestamp": "2025-05-06T16:45:51Z"
  },
  {
    "title": "Republicans scramble to pretend reopening Alcatraz is a good idea (but it’s really not)",
    "description": "The problem isn't that Donald Trump pitched an absurd idea about reopening Alcatraz. The problem are his sycophants who are playing along.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-scramble-pretend-reopening-alcatraz-good-idea-s-really-not-rcna205137",
    "timestamp": "2025-05-06T16:45:14Z"
  },
  {
    "title": "Carney meets Trump, stresses Canada will never be for sale",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump began his first talks with Canadian Prime Minister Mark Carney on Tuesday and vowed to bring up \"tough points\" that are dividing the two countries since Trump imposed tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/07/carney-meets-trump-stresses-canada-will-never-be-for-sale",
    "timestamp": "2025-05-06T16:45:00Z"
  },
  {
    "title": "Federal firings, economic uncertainty stain REIT outlooks",
    "description": "Equity Residential CEO Mark Parrell, AvalonBay CEO Sean Breslin and Camden Property Trust CEO Ric Campo (Getty, Equity Residential, AvalonBay, Federal...",
    "link": "https://finance.yahoo.com/news/federal-firings-economic-uncertainty-stain-164437923.html",
    "timestamp": "2025-05-06T16:44:37Z"
  },
  {
    "title": "Lawrence O’Donnell Slams Trump For 'Stupidest Thing' Any President 'Has Ever Said'",
    "description": "\"The Last Word\" host excoriated the president Monday in a segment spanning 26 minutes.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-torches-trump-stupidity-tktk_n_6819fe6be4b0d52939ee9092",
    "timestamp": "2025-05-06T16:44:01Z"
  },
  {
    "title": "House Democrats Walk Out on Digital Assets Hearing Over ‘Trump’s Crypto Corruption’",
    "description": "A hearing meant to discuss crypto legislation devolved into a tense shouting match Tuesday, underscoring new threats to bipartisan support for industry-related bills.",
    "link": "https://decrypt.co/318115/house-democrats-walk-out-digital-assets-hearing-trump-crypto",
    "timestamp": "2025-05-06T16:43:58Z"
  },
  {
    "title": "Carney says Canada is not for sale, Trump says 'never say never'",
    "description": "Canadian Prime Minister Mark Carney told President Donald Trump on Tuesday during a meeting at the White House",
    "link": "https://www.jpost.com/breaking-news/article-852895",
    "timestamp": "2025-05-06T16:43:46Z"
  },
  {
    "title": "Wait, That's Why Tillis Is Nuking One of Trump's Nominees?",
    "description": "No one wants to be the person who could nuke a Trump nomination. Sen. Thom Tillis (R-NC) has earned that (dis)honor, going public with his decision to vote against Ed Martin, President Trump’s nominee for U.S. Attorney for the District of Columbia. The reason…",
    "link": "https://freerepublic.com/focus/f-news/4315359/posts",
    "timestamp": "2025-05-06T16:43:06Z"
  },
  {
    "title": "Fighters vs wimps: Swing-state Democrat \nsees a new divide in the party",
    "description": "After appearing alongside Bernie Sanders in Pennsylvania, Rep. Chris Deluzio said the old moderate vs. progressive framework is no longer relevant.",
    "link": "https://www.nbcnews.com/politics/politics-news/fighters-wimps-swing-state-democrat-chris-deluzio-rcna204818",
    "timestamp": "2025-05-06T16:42:57Z"
  },
  {
    "title": "After Tough Talk On Social Media, Trump Radiates Warmth In Person For Canada's New Prime Minister",
    "description": "Trump welcomed Canada’s new prime minister, Mark Carney, with a bit of menace on social media, only to then turn on the charm and hospitality once the two leaders were sitting together in the Oval Office on Tuesday.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-canada-mark-carney_n_681a3a0fe4b0c2b15d967ac5",
    "timestamp": "2025-05-06T16:42:37Z"
  },
  {
    "title": "Donald Trump's Approval Rating Suffers 'Complete Inversion'",
    "description": "New polling shows Trump's approval among disengaged voters has dropped faster and more dramatically than among any other group.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2068659",
    "timestamp": "2025-05-06T16:42:08Z"
  },
  {
    "title": "Poll: Democrats Pledging to Impeach Trump Could Help Their 2026 Midterm Chances",
    "description": "A majority of voters in the US — including 1 in 5 Republican voters — say they support impeaching Trump.",
    "link": "https://truthout.org/articles/poll-democrats-pledging-to-impeach-trump-could-help-their-2026-midterm-chances/",
    "timestamp": "2025-05-06T16:41:40Z"
  },
  {
    "title": "'Major Economic Disaster' Amid Trump Tariffs: American Small Business Owners Face Closures, Price Hikes, And Losses",
    "description": "President Donald Trump's announcement of new tariffs on April 2 sent shockwaves across global financial markets and continues to weigh on market sentiment. Economists are now warning of an increased risk of recession as nations respond with retaliatory duties…",
    "link": "https://biztoc.com/x/fd619462e69fbb7f",
    "timestamp": "2025-05-06T16:40:05Z"
  },
  {
    "title": "Trump: We don't do much business with Canada",
    "description": "During a meeting at the Oval Office with Canadian Prime Minister Mark Carney, United States President Donald Trump analyzed the trade balance between the two countries.\"We don't do much business with ...",
    "link": "https://biztoc.com/x/32f102afd3a10657",
    "timestamp": "2025-05-06T16:39:51Z"
  },
  {
    "title": "Trump: We don't have to sign trade deals",
    "description": "US President Donald Trump pointed out on Tuesday that \"we don't have to sign trade deals,\" while adding that the US is \"losing nothing\" by not trading with China.\"Think of us as a super luxury store. ...",
    "link": "https://biztoc.com/x/3be01dbc482acaa9",
    "timestamp": "2025-05-06T16:39:43Z"
  }
]