[
  {
    "title": "The not-so-subtle 2028 shadow primary intensifies: From the Politics Desk",
    "description": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/not-subtle-2028-shadow-primary-intensifies-politics-desk-rcna218137",
    "timestamp": "2025-07-10T21:13:03Z"
  },
  {
    "title": "Terry Gilliam Says Satire Was “Basically Dead,” But Trump “Destroyed” It",
    "description": "The Monty Python filmmaker says Trump's second term in office has basically \"killed my movie\" -- in more ways than one.\nTerry Gilliam Says Satire Was “Basically Dead,” But Trump “Destroyed” It\nBen Kaye",
    "link": "https://consequence.net/2025/07/terry-gilliam-donald-trump-killed-satire/",
    "timestamp": "2025-07-10T21:12:24Z"
  },
  {
    "title": "Trump to Use His Authority to Send Weapons to Ukraine",
    "description": "\"President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, a move suggesting new interest by the president in defending",
    "link": "https://politicalwire.com/2025/07/10/trump-to-use-his-authority-to-send-weapons-to-ukraine/",
    "timestamp": "2025-07-10T21:10:54Z"
  },
  {
    "title": "Trump Admins Ends Taxpayer Subsidies For Illegal Aliens",
    "description": "The wide-ranging move ends a nearly 30-year period of government incentivizing illegal immigration by allowing illegals to benefit from programs meant for Americans.",
    "link": "https://thefederalist.com/2025/07/10/trump-admins-ends-taxpayer-subsidies-for-illegal-aliens/",
    "timestamp": "2025-07-10T21:10:30Z"
  },
  {
    "title": "Trump Finds Retreating From World Stage Is Easier Said Than Done",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWhen Donald Trump campaigned for the presidency in 2016, 2020 and 2024, he made one overarching promise to voters: no more costly overseas entanglements.\nIn a video rolling out his foreign policy agenda during…",
    "link": "https://biztoc.com/x/1d41db2111483399",
    "timestamp": "2025-07-10T21:10:08Z"
  },
  {
    "title": "BRICS in Rio: From Global South to global power",
    "description": "The 17th BRICS summit was more than a photo op. It was a coordinated rejection of Western power – and a declaration of intent Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621315-brics-in-rio-global-power/",
    "timestamp": "2025-07-10T21:09:31Z"
  },
  {
    "title": "Trump to use presidential authority to send weapons to Ukraine, sources say",
    "description": "President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, two sources familiar with the decision said on Thursday, a move suggesting new interest by the preside…",
    "link": "https://freerepublic.com/focus/f-chat/4327982/posts",
    "timestamp": "2025-07-10T21:09:28Z"
  },
  {
    "title": "CASEY RYAN: Woke Universities Cave To Trump Administration",
    "description": "Despite talking a big game in recent years, universities that once championed biological men playing in women’s sports are now backing down amid the Trump administration’s threats to defund them. During the previous administration and even before, universitie…",
    "link": "https://dailycaller.com/2025/07/10/opinion-woke-universities-cave-to-trump-administration-casey-ryan/",
    "timestamp": "2025-07-10T21:07:18Z"
  },
  {
    "title": "Car Shopping? The ‘Big, Beautiful Bill’ May Change What You Pay",
    "description": "For car buyers, the one big, beautiful bill can be a gain or loss. The new law reintroduces an auto loan interest tax deduction but ends the EV tax credit.",
    "link": "https://www.nerdwallet.com/article/loans/auto-loans/big-beautiful-bill-car-buyers#article",
    "timestamp": "2025-07-10T21:07:17Z"
  },
  {
    "title": "Joe Rogan Met Up With Trump Days Before Trashing His ICE Raids",
    "description": "Joe Rogan, podcaster and prominent supporter of Donald Trump’s presidential bid, is souring on the administration’s immigration agenda.The Washington Post reported Wednesday that Rogan, who dined with the president on June 30, “has discussed immigration polic…",
    "link": "https://newrepublic.com/post/197837/joe-rogan-trump-dinner-ice-criticism",
    "timestamp": "2025-07-10T21:06:53Z"
  },
  {
    "title": "Rosenberg: Putin determined to press on despite threat of tougher sanctions",
    "description": "Despite pressure from Donald Trump's White House, Russia remain committed to its war effort in Ukraine.",
    "link": "https://www.bbc.com/news/videos/cz9kqe5v379o",
    "timestamp": "2025-07-10T21:05:58Z"
  },
  {
    "title": "Trump's New Ambassador Pick Loves Hooters, Casual Misogyny And 'Foursomes With The Boys'",
    "description": "Self-described \"alpha man\" Nick Adams will be the U.S. ambassador to Malaysia if confirmed.",
    "link": "https://www.huffpost.com/entry/trumps-ambassador-nick-adams_n_68700c1ce4b00de383c0034d",
    "timestamp": "2025-07-10T21:05:56Z"
  },
  {
    "title": "John Brennan, James Comey Perjured Themselves, New CIA Memo Appears To Show",
    "description": "John Brennan and James Comey may have perjured themselves when insisting that the discredited Steele Dossier did not serve as the basis for RussiaGate.",
    "link": "https://dailycaller.com/2025/07/10/obama-james-comey-john-brennan-john-ratcliffe-james-clapper-russiagate-steele-dossier/",
    "timestamp": "2025-07-10T21:05:50Z"
  },
  {
    "title": "Higher premiums and lost coverage: How Trump's budget will change health care in California (CalMatters)",
    "description": "CalMatters:\nHigher premiums and lost coverage: How Trump's budget will change health care in California  —  Lower-income people will be the hardest hit.  Over the next 10 years, 3.4 million Californians could lose coverage. … The new federal budget signed int…",
    "link": "https://www.memeorandum.com/250710/p123",
    "timestamp": "2025-07-10T21:05:02Z"
  },
  {
    "title": "Trump administration launches probe of DEI policy at George Mason University",
    "description": "The probe is based on a complaint by George Mason University professors who allege that personnel decisions underrepresented groups.",
    "link": "https://www.cnbc.com/2025/07/10/trump-dei-george-mason-gregory-washington.html",
    "timestamp": "2025-07-10T21:04:26Z"
  },
  {
    "title": "A ‘blueprint for silencing dissent’: Fears for free speech in envoy’s antisemitism crackdown",
    "description": "Special envoy to combat antisemitism Jillian Segal has laid out her plan to tackle antisemitism in Australia. Some Jewish groups have welcomed the recommendations, but there are wider fears of threats to freedom of expression. \nThe post A ‘blueprint for silen…",
    "link": "http://www.crikey.com.au/2025/07/11/antisemitism-envoy-jillian-segal-aukus-israel-free-speech/",
    "timestamp": "2025-07-10T21:03:39Z"
  },
  {
    "title": "Trump Finds Retreating From World Stage Is Easier Said Than Done",
    "description": "President Trump is learning that campaigning on isolationism is easy. Following through is another matter.",
    "link": "https://www.newsweek.com/america-first-trump-foreign-policy-russia-ukraine-iran-2097302",
    "timestamp": "2025-07-10T21:03:38Z"
  },
  {
    "title": "Billy Bush Says He Offered Matt Lauer Moral Support for #MeToo Firing — Despite His Cold Shoulder After Trump Tape | Video",
    "description": "The \"Hot Mics\" podcast host adds he confronted Lauer for not publicly defending him after the 2016 Trump scandal got him fired from \"Today\"\nThe post Billy Bush Says He Offered Matt Lauer Moral Support for #MeToo Firing — Despite His Cold Shoulder After Trump …",
    "link": "https://www.thewrap.com/billy-bush-supported-matt-lauer-metoo-firing-today-show-nbc/",
    "timestamp": "2025-07-10T21:01:33Z"
  },
  {
    "title": "As Supreme Court hands more power to Trump, labor may lose, union officials say",
    "description": "A move in May by the Supreme Court may signal the end of the NLRB’s independence, labor leaders say.",
    "link": "https://www.usatoday.com/story/money/2025/07/10/labor-boards-independence-threatened/84497129007/",
    "timestamp": "2025-07-10T21:01:22Z"
  },
  {
    "title": "FOX News Absolutely Crushing Competition in Ratings, Including Broadcast Networks",
    "description": "\"Fox News averaged 2.8 million viewers during weekday primetime during the week of June 30 through July 6, compared to 2.4 million for NBC, two million for CBS and 1.9 million for ABC.\"\nThe post FOX News Absolutely Crushing Competition in Ratings, Including B…",
    "link": "https://legalinsurrection.com/2025/07/fox-news-absolutely-crushing-competition-in-ratings-including-broadcast-networks/",
    "timestamp": "2025-07-10T21:00:39Z"
  },
  {
    "title": "Senate Confirms Jonathan Gould as Comptroller of the Currency",
    "description": "The U.S. Senate voted Thursday (July 10) to confirm the nomination of Jonathan Gould to be comptroller of the currency for a five-year term. [contact-form-7] Gould was confirmed by a vote of 50- 45, with five senators not voting, according to the Senate’s rol…",
    "link": "http://www.pymnts.com/news/regulation/2025/senate-confirms-jonathan-gould-comptroller-currency-occ/",
    "timestamp": "2025-07-10T21:00:25Z"
  },
  {
    "title": "Hunting for clergy to work in Gitmo...",
    "description": "Exclusive: The chaplain will earn between $28 and $32 an hour and will minister to ‘major Christian denominations,’ as well as ‘Islam, Hinduism, Rastafarian, Judaism, etc,’ according to an ICE solicitation reviewed by The Independent",
    "link": "https://www.the-independent.com/news/world/americas/ice-immigration-deported-guantanamo-religion-b2786738.html",
    "timestamp": "2025-07-10T21:00:03Z"
  },
  {
    "title": "Elon Musk Attempts to Launch a Viable Third Party Via Social Media Post",
    "description": "Does he have the coherent ideology or attention span to pull it off?",
    "link": "https://slate.com/podcasts/political-gabfest/2025/07/politics-elon-musk-faces-uphill-battle-in-establishing-a-third-party",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "A fourth Democrat, lawyer Melvin Tull, seeks to challenge Wittman",
    "description": "A fourth candidate, attorney Melvin Tull,, has joined the list of Democrats seeking to challenge Rep. Rob Wittman, R-1st.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_1e808df6-5417-465f-8d37-6981a627ecf1.html",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "The One Place Where Nuclear War Isn’t Abstract",
    "description": "A conversation with Ross Andersen about what he saw in Hiroshima",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/japan-hiroshima-nagasaki-nuclear-warfare/683501/",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "Most Fed Officials Expect 2025 Rate Cuts Despite Tariff Inflation Concerns, Minutes Show",
    "description": "Topline\nThe Federal Reserve still believes tariffs complicate the interest rate cut picture, even as President Donald Trump attacks the central bank.\nKey Facts\n“Most” Fed staff believe the central bank will lower interest rates in 2025, according to minutes r…",
    "link": "https://biztoc.com/x/332c9bb23682b8d8",
    "timestamp": "2025-07-10T20:58:56Z"
  },
  {
    "title": "Ruble hits two-year high against dollar",
    "description": "The Russian currency has also surged against the euro, boosted by government policy support Read Full Article at RT.com",
    "link": "https://www.rt.com/business/621317-ruble-growth-dollar-euro/",
    "timestamp": "2025-07-10T20:58:56Z"
  },
  {
    "title": "Jon Jones hit with new charge and duplicate charge related to car accident in February, attorney files to dismiss",
    "description": "Jon Jones was hit with new charges related to a car accident back in February where he’s accused of leaving the scene of an accident but the second case also alleges a new charge, which is attorney has filed to get dismissed.",
    "link": "https://www.mmafighting.com/2025/7/10/24465374/jon-jones-hit-new-charge-duplicate-charge-related-car-accident-in-february-attorney-files-to-dismiss",
    "timestamp": "2025-07-10T20:57:42Z"
  },
  {
    "title": "Why the plan to wipe out antisemitism on Australian campuses is not a simple one",
    "description": "Jillian Segal’s plan to combat antisemitism recommends giving herself a role in vetoing funding to universities and their researchers.",
    "link": "https://www.abc.net.au/news/2025-07-11/university-antisemitism-funding-cuts-analysis/105518780",
    "timestamp": "2025-07-10T20:56:26Z"
  },
  {
    "title": "Breitbart Business Digest: How to Think About Trump’s Unorthodox Monetary Policy",
    "description": "In a recent series of Truth Social posts, the president made the case that the strength of the U.S. economy justifies lower interest rates.\nThe post Breitbart Business Digest: How to Think About Trump’s Unorthodox Monetary Policy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/10/breitbart-business-digest-how-to-think-about-trumps-unorthodox-monetary-policy/",
    "timestamp": "2025-07-10T20:55:46Z"
  },
  {
    "title": "Mahmoud Khalil Seeking $20 Million in Damages from Trump Administration",
    "description": "Pro-Palestinian activist Mahmoud Khalil is seeking $20 million in damages from President Donald Trump's administration after months in custody.\nThe post Mahmoud Khalil Seeking $20 Million in Damages from Trump Administration first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/mahmoud-khalil-seeking-20-million-in-damages-from-trump-administration/",
    "timestamp": "2025-07-10T20:54:04Z"
  },
  {
    "title": "Progressives, Democrats Vow Fight as Senate GOP Aims to Claw Back Billions in Federal Funding",
    "description": "The U.S. Senate will soon vote on whether President Donald Trump can claw back billions of dollars that have already been appropriated by Congress.Last month, the House narrowly voted to allow Trump to rescind $9.4 billion in funds that were meant to fund glo…",
    "link": "https://www.commondreams.org/news/senate-gop-rescissions-bill",
    "timestamp": "2025-07-10T20:51:09Z"
  },
  {
    "title": "Andrew Schulz UNLOADS on Donald Trump: What a Hypocrite and Liar!",
    "description": "Reading Time: 3 minutesAndrew Schulz sounds like he wishes he had NOT voted for Donald Trump in November. Check out what the comedian says here about the President.\nAndrew Schulz UNLOADS on Donald Trump: What a Hypocrite and Liar! was originally published on …",
    "link": "http://www.thehollywoodgossip.com/2025/07/andrew-schulz-unloads-on-donald-trump-what-a-hypocrite-and-liar/",
    "timestamp": "2025-07-10T20:50:48Z"
  },
  {
    "title": "LIVE: ICE agents, protesters clash during raid at Ventura County farm",
    "description": "Several federal agents were seen at a farm in Ventura County Thursday morning.",
    "link": "https://freerepublic.com/focus/f-bloggers/4327977/posts",
    "timestamp": "2025-07-10T20:48:32Z"
  },
  {
    "title": "WaPo enlists actual clown to set the record straight in scathing op-ed: Trump is not one of us",
    "description": "The Washington Post published an opinion piece defending the good name of clowns everywhere, fervently insisting President Trump doesn't deserve the harlequin moniker his rivals frequently foist upon him.",
    "link": "https://nypost.com/2025/07/10/us-news/wapo-enlists-actual-clown-to-set-the-record-straight-in-scathing-op-ed-trump-is-not-one-of-us/",
    "timestamp": "2025-07-10T20:47:26Z"
  },
  {
    "title": "Fight over new FBI headquarters site stalls government funding bill",
    "description": "A fight over where to relocate the FBI’s headquarters ground the Senate appropriations process to a halt on Thursday ahead of a Sept. 30 deadline.",
    "link": "https://www.nbcnews.com/politics/congress/fight-new-fbi-headquarters-location-stalls-government-funding-bill-rcna218134",
    "timestamp": "2025-07-10T20:46:04Z"
  },
  {
    "title": "Brazilian oil could find new destinations in the face of Trump's tariffs",
    "description": "RIO DE JANEIRO (Reuters) -Brazil has logistical and commercial flexibility to preserve the competitiveness of its oil on the international market if the 50% ...",
    "link": "https://finance.yahoo.com/news/brazilian-oil-could-destinations-face-204553052.html",
    "timestamp": "2025-07-10T20:45:53Z"
  },
  {
    "title": "Trump's tariffs on Brazil could make your coffee even more expensive",
    "description": "President Donald Trump’s proposed 50% tariff on Brazilian imports is bad news for coffee drinkers",
    "link": "https://www.nbcnews.com/business/business-news/trumps-tariffs-brazil-make-coffee-even-expensive-rcna218127",
    "timestamp": "2025-07-10T20:45:44Z"
  },
  {
    "title": "‘Sovereign’ Review: In the Rare Thriller That’s Truly Political, Nick Offerman Is Powerful as a Lost Soul of the New Right",
    "description": "What \"Sovereign\" dramatizes is that in the face of a controlling technological bureaucratic society (the tech isn’t incidental — it’s the means of control), the desire for authority, for dignity, for sovereignty, for a basic sense of power over one’s life is …",
    "link": "https://variety.com/2025/film/reviews/sovereign-review-nick-offerman-jacob-tremblay-1236450661/",
    "timestamp": "2025-07-10T20:45:09Z"
  },
  {
    "title": "How Trump is crushing DEI in law and medical schools",
    "description": "How Trump is crushing DEI in law and medical schoolstheblaze.com",
    "link": "https://www.theblaze.com/news/trump-linda-mcmahon-harvard-dei",
    "timestamp": "2025-07-10T20:45:00Z"
  },
  {
    "title": "Trump-obsessed conspiracy theorist beheaded his dad on YouTube after making ‘citizens arrest’",
    "description": "Justin Mohn claimed his father was trying to stop him from becoming the next Donald Trump, and accused him of committing treason",
    "link": "https://www.the-independent.com/news/world/americas/crime/trump-conspiracy-theorist-trial-beheaded-father-b2786767.html",
    "timestamp": "2025-07-10T20:44:35Z"
  },
  {
    "title": "'Laughing at us': War vet slams Trump after jarring gaffe with foreign leader",
    "description": "President Donald Trump had a cringeworthy moment with world leaders this week, an MSNBC panel argued on Thursday. Trump was meeting with five African leaders, including Liberian President Joseph Boakai. “Where did you learn to speak so beautifully?” Trump gus…",
    "link": "https://www.rawstory.com/trump-liberia-2673067956/",
    "timestamp": "2025-07-10T20:44:04Z"
  },
  {
    "title": "Trump’s New Tariffs Could Cost Households $2,400 This Year, Analysis Finds",
    "description": "Prices of clothing and shoes are expected to be particularly impacted by the tariffs, Yale University’s Budget Lab found.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/10/trumps-new-tariffs-could-cost-households-2400-this-year-analysis-finds/",
    "timestamp": "2025-07-10T20:43:24Z"
  },
  {
    "title": "Joe Rogan’s Latest Post Amplifies Epstein Conspiracy Theories",
    "description": "The podcast king takes a cryptic shot at Trump and the Justice Department, reigniting suspicions of a government cover-up in the Epstein saga.",
    "link": "https://gizmodo.com/joe-rogans-latest-post-amplifies-epstein-conspiracy-theories-2000627774",
    "timestamp": "2025-07-10T20:41:38Z"
  },
  {
    "title": "Veteran Washington Post Columnist Eviscerates Trump ‘Supplicant’ Jeff Bezos In Scathing Resignation Post",
    "description": "\"Bezos’s policies and activities have projected the image of a Donald Trump supplicant. The result – fleeing journalists, plummeting morale\"\nThe post Veteran Washington Post Columnist Eviscerates Trump ‘Supplicant’ Jeff Bezos In Scathing Resignation Post firs…",
    "link": "https://www.mediaite.com/politics/veteran-washington-post-columnists-eviscerates-trump-supplicant-jeff-bezos-in-scathing-resignation-post/",
    "timestamp": "2025-07-10T20:41:29Z"
  },
  {
    "title": "John Fetterman Throws His Family Under the Bus to Suck Up to Trump",
    "description": "Senator John Fetterman has once again turned his back on undocumented immigrants with the rubber stamp from Donald Trump. “ICE performs an important job for our country,” Fetterman wrote on X Thursday. “Any calls to abolish ICE are  inappropriate and outrag…",
    "link": "https://newrepublic.com/post/197831/john-fetterman-donald-trump-immigration-ice",
    "timestamp": "2025-07-10T20:38:27Z"
  },
  {
    "title": "US-Brazil Trade Battle Puts Shoe Firms in the Middle Of the Crossfire",
    "description": "The US tariff threat of a 50 percent duty on Brazilian imports puts pressure on shoe firms that manufacture in Brazil.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/us-tariff-threat-brazilian-imports-pressure-shoe-firms-1237976001/",
    "timestamp": "2025-07-10T20:38:24Z"
  },
  {
    "title": "Trump reveals crucial, split-second moment that saved his life during Butler assassination attempt",
    "description": "President Donald Trump remembers surviving the Butler assassination attempt, honoring the sniper who stopped the gunman and mourning the father who was killed, on \"My View with Lara Trump.\"",
    "link": "https://www.foxnews.com/media/trump-reveals-crucial-split-second-moment-saved-his-life-during-butler-assassination-attempt",
    "timestamp": "2025-07-10T20:38:16Z"
  },
  {
    "title": "Thom Tillis: Pete Hegseth Has No Idea What He’s Doing. Also Thom Tillis: No I Don’t Regret Confirming Him",
    "description": "The outgoing GOP Senator acknowledges that installing Hegseth as Secretary of Defense turned out to be a bad idea, but also doesn't blame himself for confirming the guy.",
    "link": "https://www.vanityfair.com/news/story/thom-tillis-pete-hegseth-has-no-idea-what-hes-doing-also-thom-tillis-no-i-dont-regret-confirming-him",
    "timestamp": "2025-07-10T20:36:34Z"
  },
  {
    "title": "Petition demands new storm warning system in flood-ravaged Texas Hill Country",
    "description": "\"No more excuses,\" says the creator of a petition seeking a new early warning siren system for floods, tornadoes and life-threatening emergencies.",
    "link": "https://www.usatoday.com/story/news/nation/2025/07/10/petition-early-warning-siren-system-texas/84521838007/",
    "timestamp": "2025-07-10T20:34:32Z"
  },
  {
    "title": "'Isolationist Voices' Might Have Lost Footing With Trump After Iran: Pence",
    "description": "\"I think they may have lost some of their footing with the president,\" Pence told CNN about isolationists in the White House.",
    "link": "https://www.newsweek.com/mike-pence-trump-russia-ukraine-putin-iran-2097480",
    "timestamp": "2025-07-10T20:33:14Z"
  },
  {
    "title": "EPA rolls out info on claim ‘chemtrails’ are used for weather manipulation",
    "description": "Administrator Lee Zeldin: 'Everything we know about contrails to solar geoengineering will be in there'",
    "link": "https://www.wnd.com/2025/07/epa-rolls-info-claim-chemtrails-are-used-weather/",
    "timestamp": "2025-07-10T20:31:19Z"
  },
  {
    "title": "Facing A $57 Million Federal Tax Bill, Washington University Chancellor Worriers About Other “Existential Threats”",
    "description": "The budget bill signed into law by President Donald Trump will dramatically increase endowment taxes for about a dozen private universities. But that’s just part of their problems.",
    "link": "https://www.forbes.com/sites/emmawhitford/2025/07/10/facing-a-57-million-federal-tax-bill-washington-university-chancellor-worriers-about-other-existential-threats/",
    "timestamp": "2025-07-10T20:31:00Z"
  },
  {
    "title": "Brazil's Lula warns of 50% tariffs on U.S. goods after Trump trade threat",
    "description": "Brazil's President Lula is firing back at Trump's 50% tariff threat — saying Brazil is ready to match any U.S. import taxes, dollar for dollar.",
    "link": "https://www.npr.org/2025/07/10/nx-s1-5463508/brazil-lula-trump-tariffs",
    "timestamp": "2025-07-10T20:30:32Z"
  },
  {
    "title": "500% secondary tariffs won’t derail Russian policy – Moscow",
    "description": "Russia knows how to work under sanctions, Russian Deputy Foreign Minister Sergey Ryabkov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621318-tariffs-wont-derail-policy-moscow/",
    "timestamp": "2025-07-10T20:29:27Z"
  },
  {
    "title": "Obama officials admitted they had no 'empirical evidence' of Trump-Russia collusion: House Intel transcripts",
    "description": "Obama-era officials acknowledged that they had no “empirical evidence\" of a conspiracy between the Trump campaign and Russia in the 2016 election, but continued to push the collusion \"narrative.\"",
    "link": "https://www.foxnews.com/politics/obama-officials-admitted-had-no-empirical-evidence-trump-russia-collusion-house-intel-transcripts",
    "timestamp": "2025-07-10T20:28:44Z"
  },
  {
    "title": "'Needs a beating!' Trump terror chief once probed for threat in HS love triangle",
    "description": "President Donald Trump's 22-year-old appointee to a key Homeland Security counterterrorism post got into a high school love triangle fight on social media five years ago that resulted in the police being called, The Daily Beast reported on Thursday.Thomas Fug…",
    "link": "https://www.rawstory.com/thomas-fugate/",
    "timestamp": "2025-07-10T20:27:58Z"
  },
  {
    "title": "Trump picks Sydney-born 'alpha male' influencer as ambassador to Malaysia",
    "description": "A Sydney councillor-turned-MAGA influencer, who faced suspension from the Liberal Party after swearing at a TV journalist, wins Donald Trump's nomination to become US ambassador to Malaysia.",
    "link": "https://www.abc.net.au/news/2025-07-11/donald-trump-nick-adams-malaysia-ambassador/105519888",
    "timestamp": "2025-07-10T20:27:20Z"
  },
  {
    "title": "‘Story Is Actually Getting Bigger’: Charlie Kirk Rips Trump Admin’s ‘Perplexing’ Epstein Rollout",
    "description": "Charlie Kirk on Thursday criticized the public relations (PR) of President Donald Trump's administration around deceased pedophile Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/07/10/charlie-kirk-rips-trump-admins-perplexing-epstein-rollout/",
    "timestamp": "2025-07-10T20:27:08Z"
  },
  {
    "title": "Trump to host Jensen Huang at White House as Nvidia tops $4 trillion market cap",
    "description": "Nvidia CEO Jensen Huang will meet with President Donald Trump at the White House on Thursday, CNBC's Megan Cassella reported.\nThe meeting comes as Nvidia rose slightly on Thursday, becoming the first company to close a trading day with a market cap over $4 tr…",
    "link": "https://biztoc.com/x/e2936c671c3bedf6",
    "timestamp": "2025-07-10T20:25:17Z"
  },
  {
    "title": "Levi Strauss raises sales guidance, says it will absorb some tariff costs for now",
    "description": "Levi Strauss issued a rosy outlook for the duration of the year but the jeans maker could see costs rise as President Donald Trump continues to raise tariffs.",
    "link": "https://biztoc.com/x/038e6a088828fe4e",
    "timestamp": "2025-07-10T20:24:45Z"
  },
  {
    "title": "Judge Blocks Trump’s Birthright Citizenship Order, In-Line With SCOTUS Limits",
    "description": "The judge indicated that his reasoning in issuing the injunction was “not a close call to the court.”…",
    "link": "https://truthout.org/articles/judge-blocks-trumps-birthright-citizenship-order-in-line-with-scotus-limits/",
    "timestamp": "2025-07-10T20:24:37Z"
  },
  {
    "title": "Apples vs Pears: Nutritional differences, fiber content & health benefits",
    "description": "Apples and pears are nutritious fruits with similar calories and carbohydrates. Pears contain more fiber than apples, benefiting gut health and digestion. Apples also provide fiber and support heart health. Both fruits offer vitamin C and potassium. Pears hav…",
    "link": "https://economictimes.indiatimes.com/news/international/us/apples-vs-pears-nutritional-differences-fiber-content-health-benefits/articleshow/122373374.cms",
    "timestamp": "2025-07-10T20:24:36Z"
  },
  {
    "title": "Trump to host Jensen Huang at White House as Nvidia tops $4 trillion market cap",
    "description": "Nvidia has been grappling with export controls on its AI chips implemented by the Trump administration in April for national security reasons.",
    "link": "https://www.cnbc.com/2025/07/10/nvidia-jensen-huang-donald-trump-4-trillion.html",
    "timestamp": "2025-07-10T20:22:57Z"
  },
  {
    "title": "Jamie Dimon Warns Markets Against Underestimating Interest Rates Hikes",
    "description": "JPMorgan’s CEO is worried Wall Street is underestimating the potential for higher interest rates. [contact-form-7] Such a thing is a “cause for concern,” said Jamie Dimon, whose comments Thursday (July 10) at an event hosted by Ireland’s Department of Foreign…",
    "link": "http://www.pymnts.com/economy/2025/jamie-dimon-warns-markets-against-underestimating-interest-rates-hikes/",
    "timestamp": "2025-07-10T20:22:14Z"
  },
  {
    "title": "Levi Strauss raises sales guidance, says it will absorb some tariff costs for now",
    "description": "Levi Strauss issued a rosy outlook for the duration of the year but the jeans maker could see costs rise as President Donald Trump continues to raise tariffs.",
    "link": "https://www.cnbc.com/2025/07/10/levi-strauss-levi-earnings-q2-2025.html",
    "timestamp": "2025-07-10T20:22:04Z"
  },
  {
    "title": "Trump has flagged 200% tariffs on Australian pharmaceuticals. What do we produce here, and what’s at risk?",
    "description": "The US is Australia’s biggest export market for pharmaceuticals. If the tariffs go ahead, manufacturing could suffer.",
    "link": "https://theconversation.com/trump-has-flagged-200-tariffs-on-australian-pharmaceuticals-what-do-we-produce-here-and-whats-at-risk-260909",
    "timestamp": "2025-07-10T20:20:31Z"
  },
  {
    "title": "How Hard Are World Leaders Laughing At El Dumbass's Brazilian Tariff Shakedown Letter Right Now?",
    "description": "Evil and megalomaniacal like Krugman said? Yes. But also just so brazenly, laughably stupid.",
    "link": "https://www.wonkette.com/p/how-hard-are-world-leaders-laughing",
    "timestamp": "2025-07-10T20:20:19Z"
  },
  {
    "title": "What We Know About How FEMA Officials Are Failing Texas",
    "description": "The devastating floods that hit central Texas last Friday have now killed at least 120 people, including dozens of children, according to authorities, and left at least 150 missing. But the leaders at the Federal Emergency Management Agency (FEMA) tasked with…",
    "link": "https://www.motherjones.com/politics/2025/07/what-we-know-about-how-fema-officials-are-failing-texas/",
    "timestamp": "2025-07-10T20:20:19Z"
  },
  {
    "title": "Albanese’s China mission - managing a complex relationship in a world of shifting alliances",
    "description": "The PM will use his visit to China to focus on trade ties, while trying to avoid being dragged into growing geopolitical rivalry between Beijing and Washington.",
    "link": "https://theconversation.com/albaneses-china-mission-managing-a-complex-relationship-in-a-world-of-shifting-alliances-260404",
    "timestamp": "2025-07-10T20:20:03Z"
  },
  {
    "title": "Was Jeffrey Epstein a government ‘asset’? Some are fully convinced",
    "description": "Federal prosecutor says: 'I was told Epstein 'belonged to intelligence' and to leave it alone'",
    "link": "https://www.wnd.com/2025/07/was-jeffrey-epstein-government-asset-some-are-fully/",
    "timestamp": "2025-07-10T20:19:18Z"
  },
  {
    "title": "Meta Puts $3.5 Billion Into Partner EssilorLuxottica, XPANCEO, Arago, Kartel Raise New Rounds",
    "description": "Trump hints his allies may buy TikTok. Meta invests $3.5B in Ray-Ban maker. XPANCEO, Arago, and Kartel raise funds. Smart glasses, AI chips, and AR contact lenses heat up.",
    "link": "https://www.forbes.com/sites/charliefink/2025/07/10/meta-puts-35-billion-into-partner-essilorluxottica-xpanceo-arago-kartel-raise-new-rounds/",
    "timestamp": "2025-07-10T20:18:46Z"
  },
  {
    "title": "Trump Pushes Texas Republicans Into Risky Midterms Power Grab",
    "description": "Trump is pushing the Texas GOP into a risky midterms power grab. It will be tough for the GOP to hang on to the House in 2026. Tilting the map via redistricting in Texas and Ohio could help.",
    "link": "http://nymag.com/intelligencer/article/trump-pushes-texas-gop-into-risky-midterms-power-grab.html",
    "timestamp": "2025-07-10T20:18:19Z"
  },
  {
    "title": "EXCLUSIVE: Marsha Blackburn Pushes Back On Dems’ ‘Fearmongering’ About Trump’s ‘Beautiful’ Law",
    "description": "'Very pleased with one big, beautiful bill'",
    "link": "https://dailycaller.com/2025/07/10/marsha-blackburn-democrats-fearmongering-big-beautiful-bill/",
    "timestamp": "2025-07-10T20:17:48Z"
  },
  {
    "title": "John Fetterman Rips Zohran Mamdani’s Policies: ‘He’s Not Even a Democrat’",
    "description": "John Fetterman also called Zohran Mamdani’s win in the Democratic primary last month, calling it “Christmas in July for the GOP.”\nThe post John Fetterman Rips Zohran Mamdani’s Policies: ‘He’s Not Even a Democrat’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/john-fetterman-rips-zohran-mamdanis-policies-hes-not-even-a-democrat/",
    "timestamp": "2025-07-10T20:17:15Z"
  },
  {
    "title": "White House accuses Powell of mismanaging Federal Reserve, citing headquarters renovation",
    "description": "President Donald Trump’s budget chief on Thursday said that Federal Reserve Chairman Jerome Powell “has grossly mismanaged the Fed” and suggested he had misled Congress about a pricey and “ostentatious” renovation of the central bank’s headquarters",
    "link": "https://www.nbcnews.com/business/business-news/white-house-accuses-powell-mismanaging-federal-reserve-citing-headquar-rcna218123",
    "timestamp": "2025-07-10T20:14:57Z"
  },
  {
    "title": "Trump to Meet with 1st Responders, Families Affected by Tragic Flooding During Texas Trip",
    "description": "President Donald Trump on Friday will set out for Texas, where flooding in the Hill Country tragically killed at least 120 people and left another 173 in the state missing last week.\nThe post Trump to Meet with 1st Responders, Families Affected by Tragic Floo…",
    "link": "https://www.breitbart.com/politics/2025/07/10/trump-to-meet-with-1st-responders-families-affected-by-tragic-flooding-during-texas-trip/",
    "timestamp": "2025-07-10T20:14:04Z"
  },
  {
    "title": "S&P 500 Nears Record High, Dow Jumps as Airline Stocks Take Off",
    "description": "Delta Ignites Stock Surge: Dow Rallies, S&P 500 on Brink of New High",
    "link": "https://finance.yahoo.com/news/p-500-nears-record-high-201219990.html",
    "timestamp": "2025-07-10T20:12:19Z"
  },
  {
    "title": "Stock markets rise to new records thanks to the one-two punch of airlines and Big Tech",
    "description": "Despite looming tariffs, \"the market has demonstrated a remarkable ability to hear what it wants to hear, see what it wants to see,\" AllianceBernstein's chief U.S. economist said.",
    "link": "https://fortune.com/2025/07/10/stock-markets-close-records-delta-airlines-nvidia-kellogg-jpmorgan-tariff-deadline/",
    "timestamp": "2025-07-10T20:11:23Z"
  },
  {
    "title": "Trump’s 50% Copper Tariff Risks Squeezing American Metal Buyers",
    "description": "US buyers of copper will pay a high price if President Donald Trump pushes ahead with a 50% tariff on refined metal as opposed to products such as wiring, according to producers and analysts.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-50-copper-tariff-risks-squeezing-american-metal-buyers",
    "timestamp": "2025-07-10T20:10:34Z"
  },
  {
    "title": "Angela Paxton files for divorce from Texas Attorney General Ken Paxton after 38 years of marriage",
    "description": "Texas state Sen. Angela Paxton, the wife of Republican Texas Attorney General Ken Paxton, filed for divorce on Thursday, seeking to end 38 years of marriage ...",
    "link": "https://www.yahoo.com/news/angela-paxton-files-divorce-texas-200902127.html",
    "timestamp": "2025-07-10T20:09:02Z"
  },
  {
    "title": "New Hampshire resident and Canadian citizen stuck in Canada after U.S. border patrol refuses reentry",
    "description": "Chris Landry was stopped crossing the into Maine, accompanied by three of his children after a visit with extended family in N.B.",
    "link": "https://nationalpost.com/news/canada/new-hampshire-resident-and-canadian-citizen-stuck-in-canada-after-u-s-border-patrol-refuses-reentry",
    "timestamp": "2025-07-10T20:08:39Z"
  },
  {
    "title": "Secret Service report outlines changes since attempted Trump assassination",
    "description": "Secret Service report outlines changes since attempted Trump assassinationgo.com",
    "link": "https://abcnews.go.com/Politics/secret-service-report-outlines-attempted-trump-assassination/story?id=123648964",
    "timestamp": "2025-07-10T20:08:25Z"
  },
  {
    "title": "Sierra Club: “Make America Beautiful Again” Greenwashes Most Anti-Environment Administration in History",
    "description": "Days after its Congressional allies sought to privatize vast swaths of public lands across the country, the Trump administration is launching a new commission charged with making those landscapes “beautiful.”In a brief executive order, Donald Trump called for…",
    "link": "https://www.commondreams.org/newswire/sierra-club-make-america-beautiful-again-greenwashes-most-anti-environment-administration-in-history",
    "timestamp": "2025-07-10T20:06:25Z"
  },
  {
    "title": "Trump nominates self-described 'alpha male' influencer Nick Adams as ambassador to Malaysia",
    "description": "WASHINGTON — President Donald Trump on Wednesday nominated a right-wing influencer known for his bombastic posts about his devotion to the president and tips on being an \"alpha male\" to be the next U.S. ambassador to Malaysia",
    "link": "https://www.nbcnews.com/politics/white-house/trump-nominates-self-described-alpha-male-influencer-nick-adams-ambass-rcna218024",
    "timestamp": "2025-07-10T20:05:26Z"
  },
  {
    "title": "Investors push past tariff angst to power stocks to fresh all-time highs",
    "description": "US stocks hit records, and Nvidia closed above a $4 trillion market cap for the first time. Investors looked past tariffs and toward earnings season.",
    "link": "https://www.businessinsider.com/stock-market-today-sp500-record-high-tariffs-nvda-dal-2025-7",
    "timestamp": "2025-07-10T20:05:26Z"
  },
  {
    "title": "Securities On-Chain? There's Only One True Way, Says BlackRock-Backed Firm's CEO",
    "description": "There’s only one way to truly represent securities on-chain, said Securitize CEO Carlos Domingo, and that’s through “native” tokenization.",
    "link": "https://decrypt.co/329605/securities-onchain-only-one-true-way-blackrock-backed-ceo",
    "timestamp": "2025-07-10T20:04:51Z"
  },
  {
    "title": "Los Angeles judge weighs severe limits on Trump's immigration enforcement in California",
    "description": "A Los Angeles judge will hear arguments on whether to grant restraining orders against ICE over alleged constitutional violations during immigration arrests in California.",
    "link": "https://www.foxnews.com/politics/los-angeles-judge-weighs-severe-limits-trumps-immigration-enforcement-california",
    "timestamp": "2025-07-10T20:04:48Z"
  },
  {
    "title": "Trump’s push for Israel-Syria peace gets major backing as activist brings message to Jerusalem",
    "description": "Syrian activist relays discussion with Syrian President Ahmed al-Sharaa about his interest in peace deal with Israel, but several key issues remain between the two countries.",
    "link": "https://www.foxnews.com/world/trumps-push-israel-syria-peace-gets-major-backing-activist-brings-message-jerusalem",
    "timestamp": "2025-07-10T20:04:00Z"
  },
  {
    "title": "Bannon Tells Trump To Appoint Special Prosecutor To Release Epstein Files",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFormer White House chief strategist and longtime MAGA loyalist Steve Bannon has called on President Donald Trump to appoint a special prosecutor to release all government files related to the disgraced financi…",
    "link": "https://biztoc.com/x/4b601a0d1640fbd4",
    "timestamp": "2025-07-10T20:02:41Z"
  },
  {
    "title": "What’s next for President Donald Trump’s birthright citizenship order in the courts",
    "description": "Here's what to know about birthright citizenship and what happens next.",
    "link": "https://www.bostonherald.com/2025/07/10/birthright-citizenship-courts/",
    "timestamp": "2025-07-10T20:02:22Z"
  },
  {
    "title": "New Hampshire Dad of 5 Reverses Trump Support After He’s Denied Entry to U.S.",
    "description": "A New Hampshire dad of five has reneged on his support for President Donald Trump after he was denied entry to the United States and allegedly “treated like ...",
    "link": "https://www.thedailybeast.com/new-hampshire-dad-of-5-reverses-trump-support-after-hes-denied-entry-to-us/",
    "timestamp": "2025-07-10T20:01:55Z"
  },
  {
    "title": "Billy Bush Says He Warned of 'Animal' Trump Comments Years Before Scandal (Tom Latchem/The Daily Beast)",
    "description": "Tom Latchem / The Daily Beast:\nBilly Bush Says He Warned of ‘Animal’ Trump Comments Years Before Scandal  —  BUS BEAST  —  The host phoned a producer in 2005 after the president bragged about seducing co-anchor Nancy O'Dell.  —  Former Access Hollywood anchor…",
    "link": "https://www.memeorandum.com/250710/p111",
    "timestamp": "2025-07-10T20:00:35Z"
  },
  {
    "title": "Stock market today: S&P 500, Nasdaq notch fresh records, Nvidia closes at $4T market cap",
    "description": "Wall Street looked to keep momentum from a tech-fueled rally that saw Nvidia leap to become the world's first $4 trillion public company.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-eke-out-fresh-records-nvidia-closes-at-4t-market-cap-200027558.html",
    "timestamp": "2025-07-10T20:00:27Z"
  }
]