[
  {
    "title": "Trump Resumes Domestic Travel Hoping to Calm Affordability Worry",
    "description": "President Donald Trump is headed to the Poconos for the first foray in a domestic travel push designed to address persistent voter frustration over inflation and affordability concerns.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-resumes-domestic-travel-hoping-to-calm-affordability-worry",
    "timestamp": "2025-12-09T10:19:29Z"
  },
  {
    "title": "Trump Warns Europe Heading in 'Very Bad Directions'",
    "description": "President Donald Trump warned Europe on Monday it is heading in \"very bad directions\" just days after he excoriated the continent over its unrestrained mass migration flood and looming \"civilizational erasure.\"\nThe post Trump Warns Europe Heading in ‘Very Bad…",
    "link": "https://www.breitbart.com/europe/2025/12/09/trump-warns-europe-heading-in-very-bad-directions/",
    "timestamp": "2025-12-09T10:16:57Z"
  },
  {
    "title": "U.S., Australian Cooperation on Land, Air, Sea, Industrial Base Top Topics at 40th AUSMIN",
    "description": "The U.S. and longtime ally Australia met at the State Department in Washington today for the 40th annual Australia-United States Ministerial Consultations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/australia/2025/australia-251208-dodnews01.htm",
    "timestamp": "2025-12-09T10:15:05Z"
  },
  {
    "title": "Joint Fact Sheet on Australia-U.S. Ministerial Consultations (AUSMIN) 2025",
    "description": "The text of the following joint fact sheet was released by the Governments of the United States and Australia on the occasion of the 35th Australia-U.S. Ministerial Consultations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/australia/2025/australia-251208-state02.htm",
    "timestamp": "2025-12-09T10:15:05Z"
  },
  {
    "title": "US denial of Iran's uranium enrichment rights remains main sticking point: Araghchi",
    "description": "Iran's Foreign Minister Abbas Araghchi says the central point of disagreement with the US is Washington's refusal to acknowledge Iran's right to peaceful nuclear technology, emphasizing that Tehran remains fully committed to its nuclear program despite the US…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/12/iran-251208-presstv03.htm",
    "timestamp": "2025-12-09T10:14:33Z"
  },
  {
    "title": "50 Iranian nationals freed from US detention head home",
    "description": "Abulfazl Mehrabadi, caretaker head of Iran's Interests Section in Washington, DC, has announced that 50 Iranian nationals freed from US detention have already departed the country on their way to Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/12/iran-251208-irna03.htm",
    "timestamp": "2025-12-09T10:14:33Z"
  },
  {
    "title": "Honduras seeks arrest of ex-president Hernández after Trump pardon",
    "description": "Juan Orlando Hernández had been sentenced in US federal court last year to 45 years in prison for helping move tons of cocaine to the United States.",
    "link": "https://www.abc.net.au/news/2025-12-09/honduras-seeks-arrest-of-ex-president-hernandez/106122456",
    "timestamp": "2025-12-09T10:14:32Z"
  },
  {
    "title": "US will allow sale of advanced Nvidia AI chips to China",
    "description": "President Donald Trump has said that he would allow Nvidia to sell an advanced type of computer chip used in the development of artificial intelligence to “approved customers” in China.",
    "link": "https://www.hurriyetdailynews.com/us-will-allow-sale-of-advanced-nvidia-ai-chips-to-china-216608",
    "timestamp": "2025-12-09T10:13:59Z"
  },
  {
    "title": "Nvidia, AMD Rise In Premarket After Trump Greenlights Sale Of Advanced AI Chips To China",
    "description": "Trump said he had “informed President Xi, of China,” that the U.S. will allow NVIDIA to export its H200 products to \"approved customers in China.\"",
    "link": "https://www.forbes.com/sites/siladityaray/2025/12/09/nvidia-amd-rise-in-premarket-after-trump-greenlights-sale-of-advanced-ai-chips-to-china/",
    "timestamp": "2025-12-09T10:11:16Z"
  },
  {
    "title": "DoJ takes down sophisticated network smuggling $160m worth of AI chips to China",
    "description": "Chips are still going to China, just not through illegal channels.",
    "link": "https://www.techradar.com/pro/security/doj-takes-down-sophisticated-network-smuggling-usd160m-worth-of-ai-chips-to-china",
    "timestamp": "2025-12-09T10:10:00Z"
  },
  {
    "title": "Trump greenlights Nvidia AI chip exports to China, touts 25% US share",
    "description": "President Donald Trump announced Monday that the U.S. will permit Nvidia to export its artificial-intelligence (AI) chips to China and other countries, partially reversing a Biden-era restriction on high-end chip exports. Trump said the U.S. will gain a 25% s…",
    "link": "https://freerepublic.com/focus/f-news/4356590/posts",
    "timestamp": "2025-12-09T10:09:12Z"
  },
  {
    "title": "Most arrests for violating immigration in Hawaii unwarranted, attorneys say | Honolulu Star-Advertiser",
    "description": "The majority of people arrested by federal agents for violations of U.S. immigration law in Hawaii have no criminal record despite assertions by federal officials, immigration attorneys told a state lawmaker Monday.",
    "link": "https://www.staradvertiser.com/2025/12/09/hawaii-news/most-arrests-for-violating-immigration-in-hawaii-unwarranted-attorneys-say/",
    "timestamp": "2025-12-09T10:08:30Z"
  },
  {
    "title": "US work permit validity reduced to 18 months, here is who will be directly affected and who will not",
    "description": "The US has reduced the validity of Employment Authorization Documents (EADs) from five years to 18 months for certain immigrant categories, including adjustment-of-status applicants, refugees, asylees, and those under humanitarian protections. The change affe…",
    "link": "https://timesofindia.indiatimes.com/education/news/us-work-permit-validity-reduced-to-18-months-here-is-who-will-be-directly-affected-and-who-will-not/articleshow/125867313.cms",
    "timestamp": "2025-12-09T10:08:27Z"
  },
  {
    "title": "Zelenskyy Holds Talks With European Allies, Says No Deal Yet On The Donbas",
    "description": "Ukrainian President Volodymyr Zelenskyy met with European leaders seeking to ensure a US-led effort to end Russia's war on Ukraine does not result in a lopsided deal that would reward Moscow for its aggression against its neighbor and leave Kyiv vulnerable to…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251208-rferl01.htm",
    "timestamp": "2025-12-09T10:08:15Z"
  },
  {
    "title": "New Clashes on Cambodia-Thailand Border: What We Know",
    "description": "New flare-ups occurred on the Cambodia-Thailand border after both sides accused one another of breaching a ceasefire agreement, according to Thai army spokesman Major General Winthai Suvaree.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251208-sputnik03.htm",
    "timestamp": "2025-12-09T10:08:15Z"
  },
  {
    "title": "Venezuelan army recruits 5,600 new troops amid US military threats",
    "description": "Venezuela's armed forces have added 5,600 new troops as Washington intensifies its military pressure on the Latin American country.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251208-presstv07.htm",
    "timestamp": "2025-12-09T10:08:15Z"
  },
  {
    "title": "Israel's military chief describes Gaza's dividing 'yellow line' as 'new border'",
    "description": "Israeli military chief of staff Eyal Zamir has openly described the so-called \"yellow line\", a north-south axis cutting through the Gaza Strip and marking the point of Israel's pullback, as \"a new border line\" with Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251208-presstv04.htm",
    "timestamp": "2025-12-09T10:08:15Z"
  },
  {
    "title": "Gov. Josh Shapiro to speak on a panel about political violence",
    "description": "The panel will be hosted by NBC Today co-anchor Savannah Guthrie in Washington, D.C.",
    "link": "https://www.wgal.com/article/governor-josh-shapiro-to-speak-on-panel-about-political-violence/69669467",
    "timestamp": "2025-12-09T10:07:32Z"
  },
  {
    "title": "Thailand Strikes Cambodian City of Samraong Using F-16 Jets – Reports",
    "description": "MOSCOW (Sputnik) - Thailand carried out an airstrike on Tuesday targeting the center of the Cambodian city of Samraong in Oddar Meanchey province using F-16 fighter jets, Cambodian newspaper Khmer Times reported.",
    "link": "https://sputnikglobe.com/20251209/thailand-strikes-cambodian-city-of-samraong-using-f-16-jets--reports-1123262195.html",
    "timestamp": "2025-12-09T10:07:09Z"
  },
  {
    "title": "Eileen Higgins will win Miami mayor’s race, CNN projects, breaking a nearly 30-year GOP hold | CNN Politics",
    "description": "Eileen Higgins will be the next mayor of the city of Miami, according to a projection from CNN’s Decision Desk, breaking a nearly 30-year Republican streak in holding the nonpartisan seat and giving Democrats another example of strong performance in elections…",
    "link": "https://www.cnn.com/2025/12/09/politics/miami-mayor-runoff-election",
    "timestamp": "2025-12-09T10:01:00Z"
  },
  {
    "title": "I’m one of the Beach Boys. Here's how Trump can support American music",
    "description": "The American Music Fairness Act would help working musicians get paid for radio play, with supporters asking President Donald J. Trump for his backing.",
    "link": "https://www.foxnews.com/opinion/im-one-beach-boys-heres-how-trump-can-support-american-music",
    "timestamp": "2025-12-09T10:00:43Z"
  },
  {
    "title": "A billion-dollar plan to bolster rural health in CT",
    "description": "DSS requested the funds for its 5-year plan from the Rural Health Transformation Program, which is part of Trump's One Big Beautiful Bill Act.",
    "link": "http://ctmirror.org/2025/12/09/a-billion-dollar-plan-to-bolster-rural-health-in-ct/",
    "timestamp": "2025-12-09T10:00:30Z"
  },
  {
    "title": "The Supreme Court is going to give President Trump a major opening on immigration",
    "description": "President Trump proposes ending birthright citizenship and implementing merit-based immigration system to address the country's broken immigration laws.",
    "link": "https://www.foxnews.com/opinion/supreme-court-give-president-trump-major-opening-immigration",
    "timestamp": "2025-12-09T10:00:08Z"
  },
  {
    "title": "Google Hit by EU Abuse of Dominance Probe Over AI Tools",
    "description": "In another move likely to stoke White House criticism, EU watchdogs said they will examine whether the Alphabet Inc. unit imposed unfair terms on content...",
    "link": "https://finance.yahoo.com/news/google-hit-eu-abuse-dominance-083158203.html",
    "timestamp": "2025-12-09T10:00:03Z"
  },
  {
    "title": "JD Vance's hedging on 2028 run could imperil his campaign finance Supreme Court case",
    "description": "A campaign finance case before the Supreme Court may hinge on Vice President JD Vance's equivocation on running for president in 2028.",
    "link": "https://www.nbcnews.com/politics/supreme-court/jd-vance-decision-2028-presidential-run-supreme-court-campaign-finance-rcna247619",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "Rural Health Providers Could Be Collateral Damage From $100K Trump Visa Fee",
    "description": "Dozens of health care organizations have asked the Trump administration to shield the doctors, nurses, and techs they need to fill shortages from the president’s new $100,000 visa fee for skilled foreign workers. So far, there’s no sign of a reprieve.",
    "link": "https://kffhealthnews.org/news/article/h1b-visa-fee-rural-hospitals-foreign-worker-shortages-north-dakota/",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "Wave of Tax Cuts Has Left Many States Vulnerable to Trump SNAP and Medicaid Crisis",
    "description": "President Donald Trump’s so-called One Big Beautiful Bill Act will shift billions in costs for SNAP and Medicaid to states. But with 26 having cut or eliminated state income taxes just since 2021, they may not have the money to continue the programs.",
    "link": "http://www.propublica.org/article/food-stamps-crisis-snap-big-beautiful-bill-state-tax-cuts",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "A Year in Reading: When We Are Redefined",
    "description": "From bull rides to military parades, the world transforms us in surprising ways. The best stories get close enough to document our transformation.",
    "link": "http://longreads.com/2025/12/09/when-we-are-redefined/",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "Trump’s Idea for Health Accounts Has Been Tried. Millions of Patients Have Ended Up in Debt.",
    "description": "Republican calls to give Americans cash instead of health insurance subsidies double down on a decades-old strategy of moving people into high-deductible plans with health savings accounts.",
    "link": "https://kffhealthnews.org/news/article/trump-health-accounts-hsa-cash-patient-debt-high-deductible-insurance/",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "Miami has had Republican mayors for decades, but the office is up for grabs Tuesday",
    "description": "Welcome to Miami, where the two major parties are watching the latest Republican-held office that Democrats are making a last-minute push to flip this year — the city’s mayoralty.",
    "link": "https://www.nbcnews.com/politics/elections/miami-republican-mayors-decades-office-grabs-tuesday-rcna247992",
    "timestamp": "2025-12-09T10:00:00Z"
  },
  {
    "title": "Trump Approves Nvidia Sale To China; ADFW 2025 | Horizons Middle East & Africa 12/09/2025",
    "description": "US President Donald Trump has granted Nvidia permission to ship its H200 AI chip to China in exchange for a 25% surcharge.",
    "link": "https://biztoc.com/x/35154271e89b0b52",
    "timestamp": "2025-12-09T09:57:13Z"
  },
  {
    "title": "As inflation persists, Trump attempts a messaging pivot",
    "description": "With his approval ratings on the economy sagging and Republicans increasingly anxious about next year’s midterm elections, President Donald Trump will travel to Pennsylvania today in an attempt to rewrite the political narrative on inflation — the issue that …",
    "link": "https://biztoc.com/x/a321e431c7d997d1",
    "timestamp": "2025-12-09T09:56:02Z"
  },
  {
    "title": "Israeli PM to meet Trump on December 29 over Gaza ceasefire",
    "description": "Israeli PM Benjamin Netanyahu will meet President Donald Trump on December 29 to discuss the second phase of the US-sponsored Gaza ceasefire plan.\n\nRead More: https://punchng.com/israeli-pm-to-meet-trump-on-december-29-over-gaza-ceasefire/",
    "link": "https://punchng.com/israeli-pm-to-meet-trump-on-december-29-over-gaza-ceasefire/",
    "timestamp": "2025-12-09T09:54:16Z"
  },
  {
    "title": "Honduras Seeks Arrest Of Ex-President Juan Orlando Hernández Pardoned By Trump",
    "description": "\"This is obviously a strictly political move,\" his lawyer said.",
    "link": "https://www.huffpost.com/entry/honduras-seeks-arrest-of-ex-president-pardoned-by-trump_n_6937ef71e4b064dbeef02359",
    "timestamp": "2025-12-09T09:50:59Z"
  },
  {
    "title": "Zelenskyy refuses to cede land to Russia as he rallies European support",
    "description": "Ukrainian President Volodymyr Zelenskyy says his country will not cede territory to Russia",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-refuses-cede-land-russia-rallies-european-support-128232856",
    "timestamp": "2025-12-09T09:49:25Z"
  },
  {
    "title": "'Will Take 15-30 Years': Raghuram Rajan On India's Growth Catching Up With US, China",
    "description": "Former Reserve Bank of India (RBI) Governor Raghuram Rajan spoke candidly about India’s economic prospects at a recent public forum, offering a critical view on the nation’s aspirations to become a global leader. Rajan highlighted the cautious optimism among …",
    "link": "https://www.ndtvprofit.com/economy-finance/will-take-15-30-years-raghuram-rajan-on-indias-growth-catching-up-with-us-china",
    "timestamp": "2025-12-09T09:45:43Z"
  },
  {
    "title": "President Putin and Prime Minister Modi Share a Future Strategy That’s No Joke for President Trump",
    "description": "Even with the Putin-Modi lovefest and shared strategic aims, meeting their trade targets will be a heavy lift.",
    "link": "https://www.nakedcapitalism.com/2025/12/president-putin-and-prime-minister-modi-share-a-future-strategy-thats-no-joke-for-president-trump.html",
    "timestamp": "2025-12-09T09:45:24Z"
  },
  {
    "title": "Fighting between Thailand and Cambodia threatens Trump-brokered ceasefire",
    "description": "The fighting between Thailand and Cambodia could deal a serious blow to a ceasefire agreement brokered by President Donald Trump with help from Malaysia's Prime Minister Anwar Ibrahim.",
    "link": "https://www.npr.org/2025/12/09/nx-s1-5637347/fighting-between-thailand-and-cambodia-threatens-trump-brokered-ceasefire",
    "timestamp": "2025-12-09T09:45:13Z"
  },
  {
    "title": "Garbage: Racist Shits 'R Us",
    "description": "Improbably, the White-Nationalist-In-Chief still plunges to lower, ranker, more nakedly racist depths as he tries to deflect from his failings, lies, naps and crimes. The fake Peace President’s ugly apogee, topping murders at sea, banning migrants “non-compat…",
    "link": "https://www.commondreams.org/further/garbage-racist-shits-r-us",
    "timestamp": "2025-12-09T09:44:43Z"
  },
  {
    "title": "Kimmel Takes Trump’s ‘Talent’ Jab And Turns It Brutally Back Around: 'I Mean, The Man Can...'",
    "description": "The late-night comedian responded to the president's latest attacks in the most sarcastic way.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-donald-trump-kennedy-honors_n_6937e193e4b064dbeef01ea1",
    "timestamp": "2025-12-09T09:42:36Z"
  },
  {
    "title": "Cambodia vows to fight after renewed clashes with Thailand",
    "description": "Fighting along the frontier between Thailand and Cambodia has escalated, with both militaries accusing the other of firing first. The renewed fighting threatens to unravel a fragile, US-supported ceasefire.",
    "link": "https://www.dw.com/en/cambodia-vows-to-fight-after-renewed-clashes-with-thailand/a-75072655",
    "timestamp": "2025-12-09T09:41:00Z"
  },
  {
    "title": "Cambodia-Thailand border clashes intensify, death toll up",
    "description": "Fighting along the frontier between Thailand and Cambodia has escalated, with both militaries accusing the other of firing first. The renewed fighting threatens to unravel a fragile, US-supported ceasefire.",
    "link": "https://www.dw.com/en/cambodia-thailand-border-clashes-intensify-death-toll-up/a-75072655",
    "timestamp": "2025-12-09T09:41:00Z"
  },
  {
    "title": "US flat premarket as Trump okays Nvidia chip sales to China",
    "description": "Wall Street's stock futures were little changed on Tuesday morning after US President Donald Trump's announcement that Nvidia will be allowed to ship its H200 artificial intelligence chips to \"approve...",
    "link": "https://biztoc.com/x/ba064adc0bd9a83d",
    "timestamp": "2025-12-09T09:33:58Z"
  },
  {
    "title": "World must jointly tackle issues of climate change, pollution, UN says",
    "description": "The United Nations says the world needs a new way of thinking about environmental crises threatening the health of people and the planet",
    "link": "https://abcnews.go.com/US/wireStory/world-jointly-tackle-issues-climate-change-pollution-biodiversity-128232703",
    "timestamp": "2025-12-09T09:31:09Z"
  },
  {
    "title": "Everyone knows social media is hurting children: When will policymakers act in their defence?",
    "description": "Whistleblowers, parents and state prosecutors in the US say Big Tech has done little to shield children from the harms of social media, evidence of which is too glaring to ignore. Are policymakers much too beholden to Big Tech?",
    "link": "https://www.livemint.com/opinion/online-views/social-media-hurting-children-policymakers-us-big-tech-meta-instagram-google-tiktok-youtube-11765199731368.html",
    "timestamp": "2025-12-09T09:30:14Z"
  },
  {
    "title": "Higher tariff on Indian rice will burden US consumers, India looking for new markets: Experts",
    "description": "The GTRI said the announcement made on December 8 alongside a new US farm relief package appears to be election-season communication targeted at U.S. farmers",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/higher-tariff-on-indian-rice-will-burden-us-consumers-india-looking-for-new-markets-experts/article70375268.ece",
    "timestamp": "2025-12-09T09:27:22Z"
  },
  {
    "title": "Jimmy Kimmel Extends Late Night Contract For A Year",
    "description": "Jimmy Kimmel has extended his contract with Disney-owned ABC for a year, sources said Monday, months after his late-night show was yanked off the air in a confrontation with President Donald Trump's administration.",
    "link": "https://www.channelstv.com/2025/12/09/jimmy-kimmel-extends-late-night-contract-for-a-year/",
    "timestamp": "2025-12-09T09:24:26Z"
  },
  {
    "title": "Donald Trump sparks more health questions after stepping out on red carpet with bandaged hand again - NewsBreak",
    "description": "Donald Trump sparks more health questions after stepping out on red carpet with bandaged hand again - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4387277448078-donald-trump-sparks-more-health-questions-after-stepping-out-on-red-carpet-with-bandaged-hand-again?_f=app_share&amp;pd=05JR3wtB&amp;lang=en_US&amp;send_time=1765272207&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-09T09:24:08Z"
  },
  {
    "title": "UN says world must jointly tackle issues of climate change, pollution, biodiversity and land loss",
    "description": "The United Nations says the world needs a new way of thinking about environmental crises threatening the health of people and the planet.",
    "link": "https://www.clickondetroit.com/business/2025/12/09/un-says-world-must-jointly-tackle-issues-of-climate-change-pollution-biodiversity-and-land-loss/",
    "timestamp": "2025-12-09T09:18:00Z"
  },
  {
    "title": "Chinese premier cites damage from US tariffs, as surplus surpasses $1 trillion",
    "description": "China's premier says higher tariffs have dealt a “severe blow” to the world economy, even as China's own trade surplus has surged past $1 trillion",
    "link": "https://abcnews.go.com/Business/wireStory/chinese-premier-cites-damage-us-tariffs-chinas-surplus-128232614",
    "timestamp": "2025-12-09T09:15:13Z"
  },
  {
    "title": "Ukrainians raise flag to show BBC the fight goes on in city claimed by Russia",
    "description": "Ukraine barely has a hold on Pokrovsk, but its forces are keen to show they are still resisting Russia's advance.",
    "link": "https://www.bbc.com/news/articles/cd6x3vv7y60o",
    "timestamp": "2025-12-09T09:13:18Z"
  },
  {
    "title": "Trump clears way for Nvidia to sell powerful AI chips to China",
    "description": "Commerce department finalizing deal to allow H200 chips to be sold to China as strict Biden-era restrictions relaxed\nDonald Trump has cleared the way for Nvidia to begin selling its powerful AI computer chips to China, marking a win for the chip maker and its…",
    "link": "https://biztoc.com/x/948320fae71cdd50",
    "timestamp": "2025-12-09T09:10:49Z"
  },
  {
    "title": "Chinese premier cites damage from US tariffs, as China’s surplus surpasses $1 trillion",
    "description": "BANGKOK (AP) — Higher tariffs have dealt a “severe blow” to the world economy, China’s premier said Tuesday, even as China’s own trade surplus has surged past $1 trillion. Premier Li Qiang made the remarks at a forum of top international organizations held in…",
    "link": "https://financialpost.com/pmn/chinese-premier-cites-damage-from-us-tariffs-as-chinas-surplus-surpasses-1-trillion",
    "timestamp": "2025-12-09T09:08:26Z"
  },
  {
    "title": "UN says world must jointly tackle issues of climate change, pollution, biodiversity and land loss",
    "description": "The world needs a new approach to environmental crises threatening the health of people and the planet by adopting policies to jointly tackle climate change, biodiversity loss, land degradation and pollution, according to a U.N. report released Tuesday. Those…",
    "link": "https://financialpost.com/pmn/un-says-world-must-jointly-tackle-issues-of-climate-change-pollution-biodiversity-and-land-loss",
    "timestamp": "2025-12-09T09:06:54Z"
  },
  {
    "title": "UN urges new approach to the most urgent environmental issues",
    "description": "The most comprehensive global environment assessment ever undertaken calls for a new approach to jointly tackle the most pressing environmental issues including climate change and biodiversity loss that threaten over 1 million plant and animal species with ex…",
    "link": "https://apnews.com/article/un-environment-report-climate-crises-584715f6fd7ed32a8cf993120ef2a8aa",
    "timestamp": "2025-12-09T09:03:54Z"
  },
  {
    "title": "What to expect from the last Fed meeting of 2025 — and what a rate cut could mean for your wallet",
    "description": "Jerome Powell will soon announce the next Fed decision on a potential interest rate cut. The Fed is missing key economic data on jobs and inflation.",
    "link": "https://www.businessinsider.com/fed-rate-cut-decision-december-what-to-know-2025-12",
    "timestamp": "2025-12-09T09:03:01Z"
  },
  {
    "title": "The rise of the electrostate: By dominating clean energy, China is leading on climate action",
    "description": "China’s massive lead in clean technologies has shifted the climate fight from one of big pledges and international diplomacy toward a technological revolution in cheaper energy, analysts say.",
    "link": "https://www.cbc.ca/news/science/china-energy-solar-electric-vehicle-climate-9.7005003",
    "timestamp": "2025-12-09T09:00:00Z"
  },
  {
    "title": "Can Carney still put together a credible climate plan? Does it matter?",
    "description": "If Mark Carney's first nine months as prime minister have revealed a difference of opinion over how the federal government should go about fighting climate change, he now has to prove that his approach can put Canada on a credible path to net-zero emissions b…",
    "link": "https://www.cbc.ca/news/politics/carney-climate-guilbeault-analysis-9.7007724",
    "timestamp": "2025-12-09T09:00:00Z"
  },
  {
    "title": "Canada 'continues to monitor' U.S. boat strikes in Caribbean as questions swirl and allies squirm",
    "description": "As U.S. officials argue about whether a series of deadly strikes on suspected drug boats are even legal, Canada faces a tough decision — continue to partner with the U.S. in the Caribbean, or walk away from a long-standing mission and face the consequences.",
    "link": "https://www.cbc.ca/news/politics/venezuela-boat-strikes-caribbean-operation-caribbe-canada-9.7006766",
    "timestamp": "2025-12-09T09:00:00Z"
  },
  {
    "title": "The Main Beneficiaries of Trump’s Pardons? White-Collar Criminals Like Him",
    "description": "Trump’s clemency record should be viewed alongside his deregulatory agenda, putting global markets at risk.\nThe post The Main Beneficiaries of Trump’s Pardons? White-Collar Criminals Like Him  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/12/09/trump-pardons-white-collar-crime-deregulation/",
    "timestamp": "2025-12-09T09:00:00Z"
  },
  {
    "title": "Bitcoin's 2025 rollercoaster may end on a low",
    "description": "With a series of record highs and crushing sell-offs, 2025 has been a rollercoaster ride for bitcoin, the world's largest cryptocurrency, which is at risk of ending the year with its first annual decline since 2022.",
    "link": "https://www.rte.ie/news/business/2025/1209/1548007-bitcoins-2025-rollercoaster-may-end-on-a-low/",
    "timestamp": "2025-12-09T08:55:07Z"
  },
  {
    "title": "Donald Trump's basmati bluster: Will it matter to India?",
    "description": "Donald Trump's hinting of new tariffs on Indian rice imports has sent shockwaves through Indian markets, causing rice stock prices to plummet. While the US is a small export market, the move signals potential trade friction ahead of upcoming bilateral talks. …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/donald-trumps-basmati-bluster-will-it-matter-to-india/articleshow/125865794.cms",
    "timestamp": "2025-12-09T08:54:17Z"
  },
  {
    "title": "Gaza ‘yellow line’ is new border, Israeli military chief says in shift from ceasefire deal",
    "description": "Move would give Israel control of more than half of Gaza, including most agricultural land and the border crossing with Egypt",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/09/gaza-yellow-line-is-new-border-israeli-military-chief-says-in-shift-from-ceasefire-deal/",
    "timestamp": "2025-12-09T08:47:18Z"
  },
  {
    "title": "'This Is Sick S**t': Nicolle Wallace Shreds Trump's Latest Troubling Pattern",
    "description": "The MS NOW host warned against normalizing the president's behavior.",
    "link": "https://www.huffpost.com/entry/nicolle-wallace-donald-trump-troubling-pattern_n_6937cfb9e4b013f1f7d2e14f",
    "timestamp": "2025-12-09T08:42:07Z"
  },
  {
    "title": "White House Reveals Change of Strategy For Midterms",
    "description": "White House chief of staff Susie Wiles has revealed the Republican Party is set to change its strategy for the 2026 midterm elections by putting President Donald Trump on the campaign trail.\nSpeaking on The Mom View podcast, Wiles said that while midterm elec…",
    "link": "https://biztoc.com/x/9a0c2ac7b7aeef64",
    "timestamp": "2025-12-09T08:37:17Z"
  },
  {
    "title": "Most markets track Wall St losses as jitters set in ahead of Fed",
    "description": "Most stocks fell in Asia on Tuesday as investors grew nervous about the Federal Reserve’s plans for interest rates next year following an expected cut this week. With traders fully confident of a reduction Wednesday, observers said they would be keeping a clo…",
    "link": "https://www.digitaljournal.com/world/most-markets-track-wall-st-losses-as-jitters-set-in-ahead-of-fed/article",
    "timestamp": "2025-12-09T08:32:20Z"
  },
  {
    "title": "Billionaire Trump fan Babis returns to power as Czech prime minister",
    "description": "Andrej Babis, a billionaire supporter of US President Donald Trump, returned to power as Czech prime minister on Tuesday, signalling a possible end to Ukraine aid and potentially rockier ties with the European Union. Babis’s ANO movement, which won October pa…",
    "link": "https://www.digitaljournal.com/world/billionaire-trump-fan-babis-returns-to-power-as-czech-prime-minister/article",
    "timestamp": "2025-12-09T08:32:20Z"
  },
  {
    "title": "Michael Burry owns ‘sizable’ Fannie Mae and Freddie Mac common stock, believes re-listing for both ‘nearly upon us’",
    "description": "Investor Michael Burry in his blog Cassandra Unchained, said he holds sizable positions in both Fannie Mae and Freddie Mac common stock. He also believes that a re-listing of the two US housing-finance giants is a close possibility.&nbsp;",
    "link": "https://www.livemint.com/companies/people/michael-burry-owns-sizable-fannie-mae-freddie-mac-common-stock-believes-relisting-both-us-housing-finance-giants-near-11765264592770.html",
    "timestamp": "2025-12-09T08:29:45Z"
  },
  {
    "title": "Honduras Issues International Arrest Warrant For Ex-President Pardoned By Trump",
    "description": "Hernandez, who had been extradited to the U.S. in 2022, was serving a 45-year sentence on drug trafficking when Trump pardoned him.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/12/09/honduras-issues-international-arrest-warrant-for-ex-president-pardoned-by-trump/",
    "timestamp": "2025-12-09T08:27:06Z"
  },
  {
    "title": "Detrimental Outside Influence",
    "description": "Last week, the US published its new National Security Strategy (one is produced each presidential term; this is Trump’s second). ‘After years of...",
    "link": "https://www.lrb.co.uk/blog/2025/december/detrimental-outside-influence",
    "timestamp": "2025-12-09T08:26:33Z"
  },
  {
    "title": "Higher tariff on Indian rice will burden US consumers, India looking for new markets: Experts",
    "description": "US tariffs on Indian rice are impacting American consumers. India continues to expand trade partnerships globally. Experts suggest US tariff threats are political, not policy. Indian rice exports remain resilient due to strong demand in other markets. The US …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/higher-tariff-on-indian-rice-will-burden-us-consumers-india-looking-for-new-markets-experts/articleshow/125865498.cms",
    "timestamp": "2025-12-09T08:19:51Z"
  },
  {
    "title": "Trump: Tariffs made US 'financially strongest country'",
    "description": "United States President Donald Trump stated on Tuesday that the country has become \"the financially strongest country\" due to tariffs. More to come......",
    "link": "https://biztoc.com/x/66331cb2c4406a8c",
    "timestamp": "2025-12-09T08:15:11Z"
  },
  {
    "title": "Trump Approves Export of Powerful US Chips to China—What to Know",
    "description": "President Donald Trump says he has informed Chinese President Xi Jinping that his administration will greenlight NVIDIA's H200 artificial intelligence chip for export to China, a move that critics say will erode the U.S.'s edge in its tech rivalry with China.…",
    "link": "https://biztoc.com/x/2feef54b518c96a1",
    "timestamp": "2025-12-09T08:15:01Z"
  },
  {
    "title": "Donald Trump Caught on Hot Mic Tearing into Republicans",
    "description": "President Donald Trump was heard in a video posted on social media complaining about his U.S. attorney appointments being blocked.",
    "link": "https://biztoc.com/x/fd032aa327778258",
    "timestamp": "2025-12-09T08:14:44Z"
  },
  {
    "title": "Death roll rises as renewed hostilities flare along Thai-Cambodia border",
    "description": "Both sides have decided to continue the fighting, as the Thai navy launches an operation to expel Cambodian troops.",
    "link": "https://www.aljazeera.com/news/2025/12/9/death-roll-rises-as-renewed-hostilities-flare-along-thai-cambodia-border",
    "timestamp": "2025-12-09T08:12:43Z"
  },
  {
    "title": "Jet spray vs. toilet paper: Which is better for hygiene and skin health",
    "description": "A growing debate questions toilet paper's effectiveness against jet sprays for hygiene. While paper is convenient, water-based cleaning offers superior residue removal and gentler care, especially for sensitive skin and medical conditions. Experts suggest wat…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/jet-spray-vs-toilet-paper-which-is-better-for-hygiene-and-skin-health/articleshow/125864887.cms",
    "timestamp": "2025-12-09T07:56:39Z"
  },
  {
    "title": "Jimmy Kimmel Responds to Trump Calling Him a ‘Horrible’ Host: ‘I’m Starting to Think He Might Have a Crush on Me’",
    "description": "Jimmy Kimmel responded to Donald Trump calling him a \"horrible\" host on the latest episode of 'Jimmy Kimmel Live.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-donald-trump-horrible-host-response-1235480694/",
    "timestamp": "2025-12-09T07:53:57Z"
  },
  {
    "title": "Trump accused of ‘colossal economic and national security failure’ for allowing Nvidia to sell powerful AI chips to China – business live",
    "description": "Rolling coverage of the latest economic and financial news\nGood morning, and welcome to our rolling coverage of business, the financial markets and the world economy.\nDonald Trump has been accused of a “colossal economic and national security failure” for all…",
    "link": "https://biztoc.com/x/ea7d32e9acc89139",
    "timestamp": "2025-12-09T07:52:31Z"
  },
  {
    "title": "Seth Meyers Spills How Trump's Lies Totally Secured Him This 'Fake Award'",
    "description": "The \"Late Night\" host hit the president with a not-so-prized blast from the past.",
    "link": "https://www.huffpost.com/entry/seth-meyers-trump-michigan-man-of-the-year-award-fifa_n_69379c15e4b064dbeeeffaa3",
    "timestamp": "2025-12-09T07:41:57Z"
  },
  {
    "title": "Bernie Sanders Says Trump Hates Democracies And Prefers Saudi Arabia's 'Brutal Dictatorship,' Accuses President of Betraying 'American Values'",
    "description": "Sen. Bernie Sanders (I-Vt.) accused President Donald Trump of siding with authoritarian power while turning against democratic allies.\nSanders Slams Trump's Saudi Arabia Praise\nOn Monday, in a post on X, the Vermont independent said Trump \"hates Europe's demo…",
    "link": "https://biztoc.com/x/aea91c852d6e055e",
    "timestamp": "2025-12-09T07:41:20Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy",
    "description": "A federal judge has struck down President Donald Trump’s executive order blocking wind energy projects, saying the effort to halt virtually all leasing of wind farms on federal lands and waters was “arbitrary and capricious” and violates U.S. law",
    "link": "https://biztoc.com/x/8e17fa75307615cf",
    "timestamp": "2025-12-09T07:41:18Z"
  },
  {
    "title": "US to allow Nvidia H200 chip shipments to China - Trump",
    "description": "The US will allow Nvidia's H200 processors, its second-best artificial intelligence chip, to be exported to China and collect a 25% fee on such sales, US President Donald Trump has said.",
    "link": "https://www.rte.ie/news/business/2025/1209/1547993-us-to-allow-nvidia-h200-chip-shipments-to-china-trump/",
    "timestamp": "2025-12-09T07:32:32Z"
  },
  {
    "title": "List of Conditions U.S. Must Meet in New Health Deal with Kenya Amid Data Security Concerns",
    "description": "Kenyans expressed concern after claims emerged that their health data would be shared with the United States under the new multibillion-shilling agreement.",
    "link": "https://www.kenyans.co.ke/news/118866-list-conditions-us-must-meet-new-health-deal-kenya-amid-data-security-concerns",
    "timestamp": "2025-12-09T07:30:53Z"
  },
  {
    "title": "Elizabeth Warren Says Americans Are 'Getting The Boot' As Shoe Prices Go Up 15%, Blames Trump Admin For 'One Possible Reason'",
    "description": "Sen. Elizabeth Warren (D-Mass.) on Monday blamed the Justice Department under President Donald Trump for allowing Dick's Sporting Goods to acquire Foot Locker, calling the merger \"one possible reason\" shoe prices are up 15% heading into the holiday season.\nWa…",
    "link": "https://biztoc.com/x/c314732f24cb5d4e",
    "timestamp": "2025-12-09T07:30:28Z"
  },
  {
    "title": "Chuck Schumer Says Moscow Is Endorsing Trump's National Security Strategy As President Sells Out European Allies And Puts Russia First",
    "description": "Senate Majority Leader Chuck Schumer (D-N.Y.) criticized President Donald Trump on Monday, accusing him of favoring Russia over U.S. allies in Europe as part of his new National Security Strategy.\nTrump Accused Of Prioritizing Russia Over US Allies In Europe\n…",
    "link": "https://biztoc.com/x/022b69ca96a52b1a",
    "timestamp": "2025-12-09T07:30:27Z"
  },
  {
    "title": "CNBC Daily Open: The Warner Bros. Discovery deal — a cliffhanger in the making?",
    "description": "Even as Paramount and Warner Bros saw shares soar, the broader market declined as investors awaited the Fed's rate-setting meeting on Wednesday.",
    "link": "https://www.cnbc.com/2025/12/09/cnbc-daily-open-the-warner-bros-discovery-deal-a-cliffhanger-in-the-making.html",
    "timestamp": "2025-12-09T07:30:01Z"
  },
  {
    "title": "When accreditation becomes agenda: New report alleges ideological capture in social work education in US",
    "description": "A new report from Defending Education claims that the accreditation system guiding social work programmes in the US has adopted compulsory ideological frameworks, embedding anti-racism and social justice language across key standards. The watchdog warns that …",
    "link": "https://timesofindia.indiatimes.com/education/news/when-accreditation-becomes-agenda-new-report-alleges-ideological-capture-in-social-work-education-in-us/articleshow/125864091.cms",
    "timestamp": "2025-12-09T07:29:50Z"
  },
  {
    "title": "Nigeria’s security situation requires more effort — US congressman",
    "description": "United States Congressman Riley Moore has said “much work still to be done” as he raised concerns over rising terrorism and ongoing killings during a meeting with Nigeria’s National Security Adviser, Nuhu Ribadu. In a statement posted on X on Monday, Moore sa…",
    "link": "https://thechronicle.com.gh/nigerias-security-situation-requires-more-effort-us-congressman/",
    "timestamp": "2025-12-09T07:27:44Z"
  },
  {
    "title": "Asian shares slip after Wall Street pulls back from its record heights",
    "description": "Asian shares mostly fell Tuesday after U.S. stocks pulled away from their record heights, while U.S. futures edged higher. Tokyo's Nikkei 225 index was the main outlier, gaining 0.1% to 50,655.10. Chinese markets declined as investors watched for news from th…",
    "link": "https://japantoday.com/category/business/asian-shares-slip-after-wall-street-pulls-back-from-its-record-heights",
    "timestamp": "2025-12-09T07:27:16Z"
  },
  {
    "title": "Kimmel blasts 'deeply pathetic' Trump for FIFA World Cup Peace Prize appearance",
    "description": "Talk show host Jimmy Kimmel has hit out at Donald Trump after the president received the first-ever FIFA Peace Prize.Trump received the accolade last weekend at the John F. Kennedy Center for Performing Arts. FIFA president Gianni Infantino presented Trump wi…",
    "link": "https://www.rawstory.com/trump-kimmel-2674381060/",
    "timestamp": "2025-12-09T07:25:34Z"
  },
  {
    "title": "Asian shares slip after Wall Street pulls back from its record heights",
    "description": "Asian shares are mostly lower after U.S. stocks pulled away from their record heights",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-slip-after-wall-street-pulls-back-128230584",
    "timestamp": "2025-12-09T07:25:31Z"
  }
]