[
  {
    "title": "Chinese customers are rejecting new jets due to tariffs, Boeing confirms",
    "description": "Boeing faces order cancellations from Chinese customers due to tariffs, with several jets being returned to the U.S. China's retaliatory tariffs on U.S. goods are impacting deliveries, particularly for the 737 MAX model. Boeing is now exploring options to re-…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinese-customers-are-rejecting-new-jets-due-to-tariffs-boeing-confirms/articleshow/120569045.cms",
    "timestamp": "2025-04-24T02:57:55Z"
  },
  {
    "title": "Zelensky Reacts to Ben Shapiro's Concerns Over US Military Aid",
    "description": "Zelensky sat down with conservative commentator Ben Shapiro in Kyiv this week to discuss America's involvement in the Russia-Ukraine war.",
    "link": "https://www.newsweek.com/zelensky-reacts-ben-shapiros-concerns-over-us-military-aid-2063381",
    "timestamp": "2025-04-24T02:56:41Z"
  },
  {
    "title": "Chinese customers are rejecting new jets due to tariffs, Boeing confirms",
    "description": "SEOUL (Reuters) -Boeing's Chinese customers are refusing delivery of new planes built for them due to tariffs, the U.S. planemaker has confirmed, as a third ...",
    "link": "https://finance.yahoo.com/news/chinese-customers-rejecting-jets-due-025618567.html",
    "timestamp": "2025-04-24T02:56:18Z"
  },
  {
    "title": "Veteran Greets Trump In Oval Office Wearing Prosthetic Leg That Carries Slogan Mocking Joe Biden",
    "description": "Trump laughed at a \"picture\" depicting former President Joe Biden with a slogan next to it after pointing it out on one veteran's prosthetic leg.",
    "link": "https://dailycaller.com/2025/04/23/lets-go-brandon-veteran-prosthetic-leg-donald-trump/",
    "timestamp": "2025-04-24T02:55:12Z"
  },
  {
    "title": "ADL CEO Jonathan Greenblatt Praises Trump’s War on Harvard: ‘It’s a Good Thing’",
    "description": "Anti-Defamation League (ADL) CEO Jonathan Greenblatt praised President Donald Trump's war against Harvard University, Wednesday, calling it a \"good thing.\"\nThe post ADL CEO Jonathan Greenblatt Praises Trump’s War on Harvard: ‘It’s a Good Thing’ first appeared…",
    "link": "https://www.mediaite.com/tv/adl-ceo-jonathan-greenblatt-praises-trumps-war-on-harvard-its-a-good-thing/",
    "timestamp": "2025-04-24T02:54:21Z"
  },
  {
    "title": "Bessent says ‘no currency targets’ in Japan tariff talks",
    "description": "US Treasury Secretary Scott Bessent said Wednesday that Washington has “no currency targets” in its talks with Japan on tariffs, after repeated calls from President Donald Trump for a stronger yen. Japanese media reported meanwhile that a second round of talk…",
    "link": "https://www.digitaljournal.com/world/bessent-says-no-currency-targets-in-japan-tariff-talks/article",
    "timestamp": "2025-04-24T02:52:33Z"
  },
  {
    "title": "Asia shares trade mixed as uncertainty persists over Trump’s tariff plans",
    "description": "TOKYO (AP) — Asian shares traded mixed Thursday, as worries crept back following a Wall Street rally that came after President Donald Trump appeared to back off his criticism of the Federal Reserve and his tough talk in his trade war. Japan’s benchmark Nikkei…",
    "link": "https://financialpost.com/pmn/asia-shares-trade-mixed-as-uncertainty-persists-over-trumps-tariff-plans",
    "timestamp": "2025-04-24T02:50:53Z"
  },
  {
    "title": "Oil Holds Decline With Focus on OPEC+ Supply and Tariff Outlook",
    "description": "Oil held a decline as investors weighed the prospect of more OPEC+ supply and the fallout from trade tensions between the US and China.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-decline-with-focus-on-opec-supply-and-tariff-outlook",
    "timestamp": "2025-04-24T02:49:08Z"
  },
  {
    "title": "Donald Trump may exempt carmakers from some US tariffs: Report",
    "description": "President Trump is considering tariff exemptions for car parts from China, following industry lobbying, while maintaining duties on imported steel, aluminum, and foreign-made cars. The 25% tariff on foreign-imported car parts is expected to continue, impactin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-to-exempt-carmakers-from-some-us-tariffs-report/articleshow/120568609.cms",
    "timestamp": "2025-04-24T02:46:30Z"
  },
  {
    "title": "Yemen's Huthis Seek Propaganda Boost From Deadly US Strikes",
    "description": "As America's escalated bombing campaign and economic sanctions hit Yemen hard, the Iran-backed Huthi rebels in Washington's crosshairs are trying to mine the situation for propaganda and recruitment, analysts said.",
    "link": "https://www.ibtimes.com/yemens-huthis-seek-propaganda-boost-deadly-us-strikes-3771163",
    "timestamp": "2025-04-24T02:45:10Z"
  },
  {
    "title": "Huge crowds expected for second day of pope lying in state",
    "description": "VATICAN CITY - Huge crowds were expected at St Peter&rsquo;s Basilica on Thursday for a glimpse of Pope Francis&rsquo;s body on the second day of public tributes ahead of the Catholic leader&rsquo;s weekend burial.",
    "link": "https://www.bangkokpost.com/world/3010240/huge-crowds-expected-for-second-day-of-pope-lying-in-state",
    "timestamp": "2025-04-24T02:45:00Z"
  },
  {
    "title": "Trump praises Elon Musk as ‘patriot, a brilliant guy, and a friend of mine’ amid DOGE exit",
    "description": "Trump praised Elon Musk as a “great patriot\" amid his DOGE semi-retirement and Tesla backlash, saying “he didn’t need to do this—he did it\" and said he deserves better treatment.",
    "link": "https://www.foxnews.com/politics/trump-praises-elon-musk-patriot-brilliant-guy-friend-mine-amid-doge-exit",
    "timestamp": "2025-04-24T02:43:55Z"
  },
  {
    "title": "Trump's Approval Rating Plummets With Nearly All Key Groups: Poll",
    "description": "President Trump's approval rating is below water across nearly all demographics and groups, a new Pew Research Center poll shows.",
    "link": "https://www.newsweek.com/trumps-approval-rating-plummets-nearly-all-key-groups-poll-2063382",
    "timestamp": "2025-04-24T02:43:06Z"
  },
  {
    "title": "Yemen's Houthis seek propaganda boost from deadly US strikes",
    "description": "Amid escalated US bombing and sanctions, Yemen's Houthi rebels exploit the situation for propaganda, showcasing military prowess and anti-US/Israel sentiment to boost recruitment. While US strikes damage Huthi infrastructure and leadership faces hiding, the e…",
    "link": "https://economictimes.indiatimes.com/news/defence/yemens-houthis-seek-propaganda-boost-from-deadly-us-strikes/articleshow/120568456.cms",
    "timestamp": "2025-04-24T02:42:57Z"
  },
  {
    "title": "Yemen’s Huthis seek propaganda boost from deadly US strikes",
    "description": "As America’s escalated bombing campaign and economic sanctions hit Yemen hard, the Iran-backed Huthi rebels in Washington’s crosshairs are trying to mine the situation for propaganda and recruitment, analysts said.  On Monday, four days after 80 people were k…",
    "link": "https://www.digitaljournal.com/world/yemens-huthis-seek-propaganda-boost-from-deadly-us-strikes/article",
    "timestamp": "2025-04-24T02:42:20Z"
  },
  {
    "title": "Boeing ready to resell China-bound jets if trade war worsens",
    "description": "Boeing is actively seeking alternative buyers for China-bound aircraft amidst ongoing trade disputes with the US, impacting jet deliveries and earnings recovery. CEO Kelly Ortberg confirmed halted deliveries to China and is exploring remarketing options. Desp…",
    "link": "https://economictimes.indiatimes.com/news/international/business/boeing-ready-to-resell-china-bound-jets-if-trade-war-worsens/articleshow/120567402.cms",
    "timestamp": "2025-04-24T02:36:29Z"
  },
  {
    "title": "UK Hosts Global Energy Summit With Renewables Under Attack",
    "description": "An international summit on the future of energy security opens in London on Thursday amidst major disagreements over the role of renewables in satisfying the world's thirst for energy.",
    "link": "https://www.ibtimes.com/uk-hosts-global-energy-summit-renewables-under-attack-3771161",
    "timestamp": "2025-04-24T02:36:18Z"
  },
  {
    "title": "Trump will hold a rally in Michigan next week to mark his first 100 days in office (Joey Cappelletti/Associated Press)",
    "description": "Joey Cappelletti / Associated Press:\nTrump will hold a rally in Michigan next week to mark his first 100 days in office  —  President Donald Trump will mark his first 100 days in office next week with a rally in Michigan, his first since returning to the Whit…",
    "link": "https://www.memeorandum.com/250423/p151",
    "timestamp": "2025-04-24T02:35:03Z"
  },
  {
    "title": "Jake Tapper launches brutal attack on CBS owner Shari Redstone for caving to Trump amid 60 Minutes lawsuit",
    "description": "CNN's Jake Tapper launched a scathing attack on CBS owner Shari Redstone for 'bending the knee' to Donald Trump on Tuesday, following the resignation of longtime 60 Minutes producer Bill Owens. Owens, 58, had been the executive producer of the CBS news magazi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312900/posts",
    "timestamp": "2025-04-24T02:33:53Z"
  },
  {
    "title": "Huge Crowds Expected For Second Day Of Pope Lying In State",
    "description": "Huge crowds were expected at St Peter's Basilica on Thursday for a glimpse of Pope Francis's body on the second day of public tributes ahead of the Catholic leader's weekend burial.",
    "link": "https://www.ibtimes.com/huge-crowds-expected-second-day-pope-lying-state-3771156",
    "timestamp": "2025-04-24T02:33:11Z"
  },
  {
    "title": "UK hosts global energy summit with renewables under attack",
    "description": "An international summit on the future of energy security opens in London on Thursday amidst major disagreements over the role of renewables in satisfying the world’s thirst for energy. The two-day International Energy Agency (IEA) meeting takes place amid glo…",
    "link": "https://www.digitaljournal.com/world/uk-hosts-global-energy-summit-with-renewables-under-attack/article",
    "timestamp": "2025-04-24T02:32:21Z"
  },
  {
    "title": "Huge crowds expected for second day of pope lying in state",
    "description": "Huge crowds were expected at St Peter’s Basilica on Thursday for a glimpse of Pope Francis’s body on the second day of public tributes ahead of the Catholic leader’s weekend burial. Close to 20,000 people filtered past the Argentine’s open, red-lined wooden c…",
    "link": "https://www.digitaljournal.com/world/huge-crowds-expected-for-second-day-of-pope-lying-in-state/article",
    "timestamp": "2025-04-24T02:32:21Z"
  },
  {
    "title": "Elizabeth Warren Slams Tim Cook Over Alleged Backdoor Deal With Trump To Shield Apple From Crushing China Tariffs: 'Creates The Appearance Of Impropriety'",
    "description": "On Wednesday, Sen. Elizabeth Warren (D-Mass.) requested answers from Apple Inc. (NASDAQ:AAPL) CEO Tim Cook, citing a pattern of \"influence-peddling\" between the iPhone-maker and the Donald Trump administration over the trade negotiations with China.\nWhat Happ…",
    "link": "https://biztoc.com/x/b18e2b4fa80416fb",
    "timestamp": "2025-04-24T02:30:17Z"
  },
  {
    "title": "Italy harbors doubts about hitting 2 percent NATO target",
    "description": "Rome outwardly says it can easily reach politically unpopular defense spending targets without cutting vital services.",
    "link": "https://www.politico.eu/article/italy-harbors-private-doubts-over-hitting-2-percent-nato-limit/",
    "timestamp": "2025-04-24T02:30:00Z"
  },
  {
    "title": "‘The Office’ Star Rainn Wilson Says ‘Left-Leaning News’ Has a ‘Passion’ Against Trump That It Lacked During the Biden Administration: They Act Like ‘Cleopatra, Queen of Denial’",
    "description": "Rainn Wilson is sharing his thoughts about the current political climate in the United States. During her recent appearance on Wilson’s “Soul Boom” podcast, MSNBC host Stephanie Ruhle said that she believes President Donald Trump is making a “concerted effort…",
    "link": "https://variety.com/2025/tv/news/rainn-wilson-left-leaning-news-trump-biden-denial-1236376734/",
    "timestamp": "2025-04-24T02:28:58Z"
  },
  {
    "title": "‘THE MAN WITH NO CARDS TO PLAY’: Americans, Russians and Even Ukrainians TORCH Zelensky for Grandstanding in the Face of a Catastrophe",
    "description": "Prodded by the Euro-Globalists like UK’s Keir Starmer and France’s Emmanuel Macron, and cheered by the world’s USAID-media, Ukrainian leader Volodymyr Zelensky keeps undercutting the peace process with his grandstanding, making all kinds of demands that he wi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312898/posts",
    "timestamp": "2025-04-24T02:28:28Z"
  },
  {
    "title": "Paramount’s Shari Redstone Says Freedom of the Press Means ‘Giving the Facts, Not Opinions’ | Exclusive",
    "description": "The non-executive chairwoman spoke with TheWrap at the premiere of the documentary “Children of October 7,” hours after “60 Minutes” EP Bill Owens quit the newsmagazine show Just hours after the surprise resignation of “60 Minutes” boss Bill Owens, Paramount …",
    "link": "https://freerepublic.com/focus/f-bloggers/4312897/posts",
    "timestamp": "2025-04-24T02:27:49Z"
  },
  {
    "title": "$TRUMP Coin Dinner: All you need to know about Trump's exclusive dinner date, and its perks",
    "description": "Donald Trump is set to host a private dinner for the top 220 holders of his $TRUMP meme coin on May 22nd at Trump National Golf Club. The top 25 investors will also receive a White House tour. Launched in January 2025, the $TRUMP coin quickly soared in value,…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/trump-coin-dinner-all-you-need-to-know-about-trumps-exclusive-dinner-date-and-its-perks/articleshow/120567456.cms",
    "timestamp": "2025-04-24T02:26:08Z"
  },
  {
    "title": "Federal Reserve at a policy, political crossroads poses global risks",
    "description": "A divergence between the Fed and other central banks could stress dollar funding markets and make financing more expensive for less-developed countries.",
    "link": "https://www.japantimes.co.jp/business/2025/04/24/economy/fed-crossroads-global-risks/",
    "timestamp": "2025-04-24T02:26:00Z"
  },
  {
    "title": "Army suspends base’s commander after Trump portrait was flipped to wall",
    "description": "The U.S. Army has suspended a base’s first female commander after portraits of President Donald Trump and Defense Secretary Pete Hegseth were flipped around to face a wall",
    "link": "https://www.nbcnews.com/news/us-news/army-suspends-bases-commander-trump-portrait-was-flipped-wall-rcna202723",
    "timestamp": "2025-04-24T02:25:42Z"
  },
  {
    "title": "Inside the '60 Minutes' Storm",
    "description": "Status obtained the audio of Tuesday’s stunning “60 Minutes” meeting where Bill Owens, fighting back tears, said he’s become “the corporation’s problem”—and made it clear he wasn’t leaving by choice. Late Tuesday morning, chatter started spreading through the…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312896/posts",
    "timestamp": "2025-04-24T02:24:36Z"
  },
  {
    "title": "Shari Redstone kept tabs on ‘60 Minutes’ segments on Trump",
    "description": "Paramount owner Shari Redstone in recent days sought to know which upcoming 60 Minutes stories were about President Donald Trump, according to two people familiar with the situation — triggering a series of events that ended with the Tuesday resignation of th…",
    "link": "https://freerepublic.com/focus/f-chat/4312895/posts",
    "timestamp": "2025-04-24T02:22:02Z"
  },
  {
    "title": "Gold falls, silver up on Trump talk",
    "description": "India-Business News: Gold prices softened marginally after US President Donald Trump indicated he may not press for the removal of US Fed chief Jerome Powell and negotiate.",
    "link": "https://timesofindia.indiatimes.com/business/india-business/gold-falls-silver-up-on-trump-talk/articleshow/120567579.cms",
    "timestamp": "2025-04-24T02:20:48Z"
  },
  {
    "title": "Trump will hold a rally in Michigan next week to mark his first 100 days in office",
    "description": "President Donald Trump will travel to Michigan next week to celebrate his first 100 days in office",
    "link": "https://abcnews.go.com/US/wireStory/trump-hold-rally-michigan-week-mark-100-days-121109196",
    "timestamp": "2025-04-24T02:20:06Z"
  },
  {
    "title": "Putin gifted Trump a portrait of GOP leader defiantly raising his fist after surviving assassination attempt: report",
    "description": "“It was important to me to show the blood, the scar and his bravery during the attempt on his life,” Russian artist Nikas Safronov said.",
    "link": "https://nypost.com/2025/04/23/us-news/putin-gifted-trump-a-portrait-of-gop-leader-defiantly-raising-his-fist-after-surviving-assassination-attempt-report/",
    "timestamp": "2025-04-24T02:20:02Z"
  },
  {
    "title": "Bitcoin, Ethereum Rise, Dogecoin Falls As Trump Reverses Course On China Tariffs: Analyst Says BTC Setup Bullish But 'It's Like Walking On Thin Ice'",
    "description": "Leading cryptocurrencies gained on Wednesday amid reports that President Donald Trump was considering reducing China tariffs.\nCryptocurrency\nGains +/-\nPrice (Recorded at 8:45 p.m. ET)\nBitcoin (CRYPTO: BTC)\n+0.47%\n$93,643.53\nEthereum (CRYPTO: ETH) \n+2.38%\n$1,7…",
    "link": "https://biztoc.com/x/829138de2c6dc430",
    "timestamp": "2025-04-24T02:19:28Z"
  },
  {
    "title": "Former South Korean President Moon Jae-in indicted for corruption: Prosecution",
    "description": "SEOUL: South Korea's prosecutors said Thursday (Apr 24) they have indicted former president Moon Jae-in on corruption charges related to the employment of his son-in-law at an airline. Moon was \"indicted for corruption for receiving 217 million won (US$150,00…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-moon-jae-indicted-corruption-courts-5085176",
    "timestamp": "2025-04-24T02:19:00Z"
  },
  {
    "title": "US Officials Mull Easing Tariffs Targeting the Auto Industry",
    "description": "The Trump administration is considering whether to reduce certain tariffs targeting the auto industry that carmaker executives have warned would deal a severe blow to profits and jobs.",
    "link": "https://financialpost.com/pmn/business-pmn/us-officials-mull-easing-tariffs-targeting-the-auto-industry",
    "timestamp": "2025-04-24T02:18:41Z"
  },
  {
    "title": "Trump says Commanders’ controversial former name was 'superior'",
    "description": "WASHINGTON — President Donald Trump prefers the Washington Commanders’ controversial former name, he told reporters Tuesday evening.",
    "link": "https://www.nbcnews.com/sports/nfl/trump-commanders-rfk-stadium-name-nfl-rcna202728",
    "timestamp": "2025-04-24T02:18:39Z"
  },
  {
    "title": "Cantor teams up with Tether, Softbank for $3.6 billion crypto venture",
    "description": "Cantor Fitzgerald, Tether, and SoftBank are launching a $3.6 billion crypto venture, Twenty One Capital, to acquire bitcoin, anticipating increased interest under President Trump. Tether and Bitfinex will hold majority ownership, while SoftBank will have a mi…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/cantor-teams-up-with-tether-softbank-for-3-6-billion-crypto-venture/articleshow/120567570.cms",
    "timestamp": "2025-04-24T02:18:22Z"
  },
  {
    "title": "Trump Comments on U.S. Tourism Decline – Travelers Cite Trump's Policies",
    "description": "President Donald Trump offered one reason on why he thinks tourism to the U.S. may be down: He said it could be nationalism.",
    "link": "http://skift.com/2025/04/23/trump-comments-on-u-s-tourism-decline-travelers-cite-trumps-policies/",
    "timestamp": "2025-04-24T02:18:21Z"
  },
  {
    "title": "Gov. Tim Walz pledges to protect Minnesota from the 'chaos' he says Trump unleashed",
    "description": "Minnesota Gov. Tim Walz has pledged to do everything in his power to protect Minnesotans from the chaos that he says President Donald Trump has unleashed on the country and world",
    "link": "https://abcnews.go.com/Politics/wireStory/gov-tim-walz-pledges-protect-minnesota-chaos-trump-121108696",
    "timestamp": "2025-04-24T02:17:52Z"
  },
  {
    "title": "'Absolutely blowing it': MSNBC's Rachel Maddow shares key lesson of Trump's first 100 days",
    "description": "As President Donald Trump prepares to mark the first 100 days of his second White House term, MSNBC’s Rachel Maddow shared what she views as the “clear lesson” of the last three months as she dropped news of her own.The primetime host in the opening minutes o…",
    "link": "https://www.rawstory.com/trump-first-100-days/",
    "timestamp": "2025-04-24T02:16:04Z"
  },
  {
    "title": "Trump must be looking like a paper tiger to China",
    "description": "It seems to be the conventional wisdom that the tariff war between the US and China is not good for anybody, least of all the two countries concerned. And yet, here we are with China having tariffs of 125% on US goods and the US having tariffs of 145% on Chin…",
    "link": "https://freethoughtblogs.com/singham/2025/04/23/trump-must-be-looking-like-a-paper-tiger-to-china/",
    "timestamp": "2025-04-24T02:15:41Z"
  },
  {
    "title": "Dinner with the president: Trump meme coin surges on offer to top buyers",
    "description": "Donald Trump's meme coin, $TRUMP, surged after an announcement promising top holders a dinner with the former president. This event, coupled with Trump's crypto ventures and promises to be a \"crypto president,\" raises conflict of interest concerns. Ethics wat…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/dinner-with-the-president-trump-meme-coin-surges-on-offer-to-top-buyers/articleshow/120567492.cms",
    "timestamp": "2025-04-24T02:15:31Z"
  },
  {
    "title": "‘This Is Life And Death For The House Republican Party’: Newt Gingrich Says GOP Must Get Act Together Before July 4",
    "description": "Newt Gingrich said on Fox Business Wednesday that House Republicans are facing a crucial moment that could determine their political survival.",
    "link": "https://dailycaller.com/2025/04/23/newt-gingrich-gop-senate-trump/",
    "timestamp": "2025-04-24T02:11:31Z"
  },
  {
    "title": "Reinstating Common Sense School Discipline Policies (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nReinstating Common Sense School Discipline Policies  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to ensure safety and order in American classr…",
    "link": "https://www.memeorandum.com/250423/p149",
    "timestamp": "2025-04-24T02:10:00Z"
  },
  {
    "title": "Trump wants our minerals but giving them to him is harder than it sounds",
    "description": "The phrase \"critical minerals\" reflects the demand for them around the world, but China's market dominance means there are traps for new players such as Australia.",
    "link": "https://www.abc.net.au/news/2025-04-24/critical-minerals-election-campaign-explainer/105210740",
    "timestamp": "2025-04-24T02:08:12Z"
  },
  {
    "title": "Apple, Meta hit by US$798 million in EU tech fines after Trump threats",
    "description": "Apple Inc. and Meta Platforms Inc. were hit by relatively modest European Union fines totaling EUR700 million (US$798 million) for violating tough new antitrust rules for Big Tech, following warnings of harsh retaliation from US President Donald Trump.",
    "link": "https://www.digitimes.com/news/a20250424VL201/meta-eu-apple-antitrust.html",
    "timestamp": "2025-04-24T02:06:51Z"
  },
  {
    "title": "US President Donald Trump Sued For Imposing Sweeping Tariffs",
    "description": "As many as 12 American states, most of them led by Democrats, sued President Donald Trump and his administration over his unprecedented tariffs on all US trading partners, especially China, that sparked global economic turmoil.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-sued-for-imposing-sweeping-tariffs-8241309",
    "timestamp": "2025-04-24T02:05:12Z"
  },
  {
    "title": "‘We don’t want your cars': Trump says 25% tariff on cars made in Canada could go up",
    "description": "U.S. President Donald Trump has intensified his rhetoric on Canadian car imports, threatening to raise existing tariffs beyond 25%. Speaking days before Canada's federal election, Trump claimed Canada \"would cease to exist\" without U.S. trade. His remarks hav…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-dont-want-your-cars-trump-says-25-tariff-on-cars-made-in-canada-could-go-up/articleshow/120567199.cms",
    "timestamp": "2025-04-24T02:03:53Z"
  },
  {
    "title": "Trump says lower tariffs depend on China, as US states sue over trade war",
    "description": "Wall Street rallies for second day on hopes of a de-escalation in trade tensions between world's two largest economies.",
    "link": "https://www.aljazeera.com/economy/2025/4/24/trump-says-lower-tariffs-depend-on-china-as-us-states-sue-over-trade-war",
    "timestamp": "2025-04-24T02:03:39Z"
  },
  {
    "title": "Rubio says Iran must give up nuclear enrichment in any deal with the US",
    "description": "Marco Rubio says Iran must end all nuclear enrichment for a deal with the Trump administration. Talks are ongoing to prevent armed conflict. Iran insists its program is for energy, not weapons. Trump seeks a tougher agreement, but Iran wants sanctions eased. …",
    "link": "https://economictimes.indiatimes.com/news/defence/rubio-says-iran-must-give-up-nuclear-enrichment-in-any-deal-with-the-us/articleshow/120567342.cms",
    "timestamp": "2025-04-24T02:03:16Z"
  },
  {
    "title": "IMF outlook: The good, the bad and the unsaid",
    "description": "The International Monetary Fund’s April 2025 ‘World Economic Outlook’ is both reassuring and disturbing. It reflects the uncertain times through which the world is passing—and calls for reflection.",
    "link": "https://www.livemint.com/opinion/online-views/imf-world-economic-outlook-2025-global-economic-growth-forecast-us-tariff-impact-global-trade-slowdown-india-gdp-trump-11745424277384.html",
    "timestamp": "2025-04-24T02:00:08Z"
  },
  {
    "title": "Trump signs executive orders targeting colleges, plus schools' equity efforts (Associated Press)",
    "description": "Associated Press:\nTrump signs executive orders targeting colleges, plus schools' equity efforts  —  President Donald Trump has ordered sharper scrutiny of America's colleges and the accreditors that oversee them, part of his escalating campaign to end what he…",
    "link": "https://www.memeorandum.com/250423/p147",
    "timestamp": "2025-04-24T02:00:01Z"
  },
  {
    "title": "Relief rally stutters as markets take stock of Trump's U-turns",
    "description": "Global markets experienced mixed signals as investors grappled with President Trump's inconsistent stances on tariffs and Federal Reserve leadership. Asian shares dipped slightly, contrasting with Wall Street's gains fueled by hopes of easing U.S.-China trade…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/relief-rally-stutters-as-markets-take-stock-of-trumps-u-turns/articleshow/120567309.cms",
    "timestamp": "2025-04-24T01:59:09Z"
  },
  {
    "title": "US President Donald Trump targets college accreditation process in executive order",
    "description": "President Trump signed an executive order targeting college accreditation, aiming to remove \"ideological overreach\" and promote \"intellectual diversity.\" This move allows colleges to switch accreditors easily, potentially increasing competition. Simultaneousl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-president-donald-trump-targets-college-accreditation-process-in-executive-order/articleshow/120567296.cms",
    "timestamp": "2025-04-24T01:57:45Z"
  },
  {
    "title": "'Foolish': WSJ's conservative editors take a swipe at MAGA media 'echo chamber'",
    "description": "President Donald Trump is finally being battered by the consequences of his own disastrous policy choices, the Wall Street Journal editorial board wrote in a scathing analysis published on Wednesday evening — and the bubble that is the MAGA media sphere is lo…",
    "link": "https://www.rawstory.com/wsj-maga-media/",
    "timestamp": "2025-04-24T01:54:37Z"
  },
  {
    "title": "Dollar rebound loses steam with trade in focus",
    "description": "The dollar stabilized on Thursday after a surge, following positive signals from President Trump regarding the Federal Reserve and potential easing of China tariffs. It rebounded against the yen, reaching 143.25. Treasury Secretary Bessent's comments on curre…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-rebound-loses-steam-with-trade-in-focus/articleshow/120567271.cms",
    "timestamp": "2025-04-24T01:54:33Z"
  },
  {
    "title": "NIH bans grants for schools that boycott Israeli companies",
    "description": "The new NIH policy is the latest restriction placed on US campuses, which have faced intense scrutiny from the Trump administration over their responses to antisemitism.",
    "link": "https://www.jpost.com/diaspora/article-851304",
    "timestamp": "2025-04-24T01:54:22Z"
  },
  {
    "title": "Gold prices bounce back from one-week low on dip buying",
    "description": "Gold prices saw an increase as investors purchased after a dip. Earlier, prices had fallen to one-week lows. Donald Trump's comments on the Federal Reserve and China trade talks influenced the market. US Treasury Secretary Scott Bessent mentioned that high ta…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-bounce-back-from-one-week-low-on-dip-buying/articleshow/120567256.cms",
    "timestamp": "2025-04-24T01:52:11Z"
  },
  {
    "title": "Wall Street ends higher on hopes of trade war de-escalation",
    "description": "Wall Street shares saw gains on Wednesday. There is optimism about US-China trade talks. Donald Trump said he would not fire Jerome Powell. This eased market worries. First-quarter earnings season is in progress. Tesla shares rose despite a profit drop. Boein…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-on-hopes-of-trade-war-de-escalation/articleshow/120567240.cms",
    "timestamp": "2025-04-24T01:50:23Z"
  },
  {
    "title": "Two major law firms urge judges to permanently block Trump's executive orders",
    "description": "Two major law firms have asked separate judges to permanently block President Donald Trump’s executive orders that were designed to punish them and harm their business operations",
    "link": "https://abcnews.go.com/Politics/wireStory/major-law-firms-urge-judges-permanently-block-trumps-121072756",
    "timestamp": "2025-04-24T01:50:21Z"
  },
  {
    "title": "Trump Says Baby Bonus For Moms \"Sounds Like A Good Idea\"",
    "description": "Trump Says Baby Bonus For Moms \"Sounds Like A Good Idea\"\n \nAuthored by Jack Phillips via The Epoch Times,\nPresident Donald Trump has signaled a willingness to issue a financial bonus to mothers when they give birth.\nThe president was asked by reporters on Tue…",
    "link": "https://biztoc.com/x/1d14611440c7a0d5",
    "timestamp": "2025-04-24T01:46:00Z"
  },
  {
    "title": "Apple and Meta hit by $798 million in EU tech fines after Trump threats",
    "description": "The punishments are far lower than previous ones under traditional EU competition law, and are likely to be seen as an attempt to avoid provoking Trump.",
    "link": "https://www.japantimes.co.jp/business/2025/04/24/companies/apple-meta-eu-law-fine/",
    "timestamp": "2025-04-24T01:37:00Z"
  },
  {
    "title": "Japan plans to send foreign minister to Pope's funeral",
    "description": "The head of the Catholic Church died Monday at the age of 88. His funeral is due to take place at the Vatican on Saturday.",
    "link": "https://www.japantimes.co.jp/news/2025/04/24/japan/pope-funeral-foreign-minister/",
    "timestamp": "2025-04-24T01:37:00Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker moves to boycott El Salvador for aiding Trump over Kilmar Abrego Garcia’s detention",
    "description": "Illinois state agencies have been ordered to review investments and contracts with business linked to El Salvador, Gov. J.B. Pritzker said.",
    "link": "https://www.foxnews.com/politics/illinois-gov-jb-pritzker-moves-boycott-el-salvador-aiding-trump-over-kilmar-abrego-garcias-detention",
    "timestamp": "2025-04-24T01:36:32Z"
  },
  {
    "title": "Transparency Regarding Foreign Influence at American Universities (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nTransparency Regarding Foreign Influence at American Universities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1…",
    "link": "https://www.memeorandum.com/250423/p144",
    "timestamp": "2025-04-24T01:35:01Z"
  },
  {
    "title": "'We have a deal with Russia': Trump pressures Ukraine to cede Crimea to Russia as his 'patience runs thin'",
    "description": "President Donald Trump is pressing Ukraine to accept a U.S.-designed peace proposal that would legitimise Russia’s control over Crimea and other occupied territories, while blocking Ukraine’s path to NATO. Ukrainian President Volodymyr Zelenskyy has rejected …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-have-a-deal-with-russia-trump-pressures-ukraine-to-cede-crimea-to-russia-as-his-patience-runs-thin/articleshow/120567074.cms",
    "timestamp": "2025-04-24T01:31:09Z"
  },
  {
    "title": "Pastor calls for 'full Target boycott' over concerns about diversity, equity, inclusion",
    "description": "The pastor of a Georgia megachurch who led a nationwide 40-day “fast” against Target stores is now calling for a “full Target boycott.”.",
    "link": "https://www.news4jax.com/business/2025/04/23/pastor-calls-for-full-target-boycott-over-concerns-about-diversity-equity-inclusion/",
    "timestamp": "2025-04-24T01:30:33Z"
  },
  {
    "title": "Trump says he won't fire Fed chair, urges him to lower rates",
    "description": "WASHINGTON, April 23 (Xinhua) -- U.S. President Donald Trump said Tuesday that he has no intention o",
    "link": "http://en.people.cn/n3/2025/0424/c90000-20306560.html",
    "timestamp": "2025-04-24T01:30:12Z"
  },
  {
    "title": "Mint Quick Edit | After the Greenspan put, the Powell stay-put",
    "description": "To the relief of markets, Trump said he doesn’t intend to fire the Federal Reserve chief. Is this because the US president changed his mind, the law won’t let him or a fall-guy is needed for an economic slowdown?",
    "link": "https://www.livemint.com/opinion/online-views/trump-jerome-powell-conflict-federal-reserve-independence-us-interest-rate-cuts-us-recession-fears-monetary-policy-fed-11745421257617.html",
    "timestamp": "2025-04-24T01:30:07Z"
  },
  {
    "title": "Donald Trump accuses Volodymyr Zelensky of prolonging ‘killing field’ for refusing to give up Crimea",
    "description": "US president Donald Trump yesterday lashed out at Ukrainian president Volodymyr Zelensky, saying Mr Zelensky is prolonging the “killing field” after he pushed back on ceding Crimea to Russia as part of a potential peace plan.",
    "link": "https://www.independent.ie/world-news/donald-trump-accuses-volodymyr-zelensky-of-prolonging-killing-field-for-refusing-to-give-up-crimea/a1571289716.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "Today’s top TV and streaming choices: Ambulance, Priscilla and Bullet Train Explosion",
    "description": "Planning a night on the couch? Here are today’s top TV and streaming picks:",
    "link": "https://www.independent.ie/entertainment/television/todays-top-tv-and-streaming-choices-ambulance-priscilla-and-bullet-train-explosion/a2111913137.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "Oracle believes impact of Donald Trump’s tariffs will be ‘minimal’",
    "description": "The directors of the main Irish arm of Oracle, the firm co-founded by Larry Ellison, believe the direct impact of US and EU tariffs and non-tariff measures will be minimal.",
    "link": "https://www.independent.ie/business/irish/oracle-believes-impact-of-donald-trumps-tariffs-will-be-minimal/a1106242030.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "Euro’s surprise strength against the dollar has created a new set of challenges for Irish exporters",
    "description": "Irish exporters are facing unexpected headwinds as the euro has strengthened in recent weeks, hurting competitiveness just as US tariffs kicked in.",
    "link": "https://www.independent.ie/business/small-business/euros-surprise-strength-against-the-dollar-has-created-a-new-set-of-challenges-for-irish-exporters/a1432221967.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "Markets rebound stalls as talk of easing tariffs on China cools yet again",
    "description": "A broad recovery across financial markets that began on Tuesday ran out of steam on Wednesday after the latest White House interjection on tariffs.",
    "link": "https://www.independent.ie/business/world/markets-rebound-stalls-as-talk-of-easing-tariffs-on-china-cools-yet-again/a1818086827.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "Letters: Pope Francis’s humane response to refugee crisis was a high point of his pontificate",
    "description": "While wishing that the Catholic Church would allow ordination of women and pursue other long overdue reforms, I have the greatest respect for the late Pope Francis.",
    "link": "https://www.independent.ie/opinion/letters/letters-pope-franciss-humane-response-to-refugee-crisis-was-a-high-point-of-his-pontificate/a2117738723.html",
    "timestamp": "2025-04-24T01:30:00Z"
  },
  {
    "title": "How Zelensky Responded To Trump's Demand Of Ceding Crimea To Russia",
    "description": "After another explosive exchange with the US President Donald Trump, Ukraine&#039;s Volodymyr Zelenskiy posted a 2018 declaration from Trump&#039;s first term, which said Crimea is a Ukrainian territory.",
    "link": "https://www.ndtv.com/world-news/how-ukraines-volodymyr-zelensky-responded-to-trumps-demand-of-ceding-crimea-to-russia-8241188",
    "timestamp": "2025-04-24T01:27:14Z"
  },
  {
    "title": "Audit shadows BluSmart’s books; Zomato leadership rejig",
    "description": "Happy Thursday! BluSmart’s board has engaged consultancy firm Grant Thorntonto conduct a forensic audit of the ride-hailing startup’s financials. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/audit-shadows-blusmarts-books-zomato-leadership-rejig/articleshow/120567009.cms",
    "timestamp": "2025-04-24T01:27:00Z"
  },
  {
    "title": "Reforming Accreditation to Strengthen Higher Education (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nReforming Accreditation to Strengthen Higher Education  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.…",
    "link": "https://www.memeorandum.com/250423/p143",
    "timestamp": "2025-04-24T01:25:00Z"
  },
  {
    "title": "CNBC Daily Open: Trump starts trade war but also blinks first",
    "description": "The president's softer tone towards China despite no formal talks was in stark contrast to his more combative rhetoric earlier in April",
    "link": "https://www.cnbc.com/2025/04/24/cnbc-daily-open-trump-starts-trade-war-but-also-blinks-first.html",
    "timestamp": "2025-04-24T01:23:08Z"
  },
  {
    "title": "Citadel CEO Ken Griffin Warns Trump’s Tariffs Are Tarnishing the ‘American Brand’",
    "description": "\"When you tarnish that brand, it can take a lifetime to repair the damage that has been done.\"",
    "link": "https://observer.com/2025/04/citadel-ceo-ken-griffin-trump-tariff/",
    "timestamp": "2025-04-24T01:22:28Z"
  },
  {
    "title": "'Significant vulnerabilities': Trump admin attorney warned against risky $20B plot",
    "description": "The Trump administration had been cautioned that they were treading shaky legal ground as they plotted to block eight nonprofits from using $20 billion in Biden-era climate grants that had already been disbursed, according to a new report in Politico.But Envi…",
    "link": "https://www.rawstory.com/trump-administration-2671834346/",
    "timestamp": "2025-04-24T01:21:23Z"
  },
  {
    "title": "Twelve states sue Trump over tariffs, claiming they’re ‘illegal’ and harmful to US economy",
    "description": "Twelve states are suing President Trump over sweeping tariffs, claiming they’re unconstitutional, economically harmful and imposed without congressional approval.",
    "link": "https://www.foxnews.com/politics/twelve-states-sue-trump-over-tariffs-claiming-theyre-illegal-harmful-us-economy",
    "timestamp": "2025-04-24T01:20:16Z"
  },
  {
    "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
    "description": "A federal judge has found the U.S. government liable to the state of North Dakota for nearly $28 million in the state's lawsuit for recouping money spent on policing the protest of the Dakota Access Pipeline",
    "link": "https://abcnews.go.com/US/wireStory/judge-rules-federal-government-owes-28-million-north-121105535",
    "timestamp": "2025-04-24T01:18:17Z"
  },
  {
    "title": "Trump Launches AI Education Push With Latest Executive Order",
    "description": "Trump’s executive order will establish a task force and training grants to advance AI learning for students and educators.",
    "link": "https://decrypt.co/316080/trump-launches-ai-education-push-latest-executive-order",
    "timestamp": "2025-04-24T01:17:45Z"
  },
  {
    "title": "Dinner with the president: Trump meme coin surges on offer to top buyers",
    "description": "NEW YORK :President Donald Trump's meme coin surged more than 60 per cent on Wednesday after a post announcing \"the most EXCLUSIVE INVITATION in the world\" promised the top 220 buyers of $TRUMP a private gala dinner with the president on May 22. In addition t…",
    "link": "https://www.channelnewsasia.com/business/dinner-president-trump-meme-coin-surges-offer-top-buyers-5085221",
    "timestamp": "2025-04-24T01:17:27Z"
  },
  {
    "title": "IMF urges BOJ flexibility on rates as tariffs dent outlook",
    "description": "Along with downgraded global growth projections, the IMF's forecast for Japan’s expansion in 2025 was trimmed by 0.5 percentage points to 0.6%.",
    "link": "https://www.japantimes.co.jp/business/2025/04/24/economy/imf-urge-boj-flexibility/",
    "timestamp": "2025-04-24T01:16:00Z"
  },
  {
    "title": "Trump signs orders on university accreditation, foreign gifts",
    "description": "WASHINGTON: In his latest step pressuring US universities, President Donald Trump on Wednesday (Apr 23) signed an order intended to toughen standards for college accreditation, a requirement for accessing billions of dollars in federal student financial aid. …",
    "link": "https://www.channelnewsasia.com/world/trump-signs-orders-university-accreditation-foreign-gifts-5085216",
    "timestamp": "2025-04-24T01:15:11Z"
  },
  {
    "title": "Trump to host dinner with top holders of his meme coin (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nTrump to host dinner with top holders of his meme coin  —  “$TRUMP Power!  The Biggest and Most Important $TRUMP Holders will Proudly have a Gala Dinner with the President,” the meme coin's website announced.  “Will You Be One …",
    "link": "https://www.memeorandum.com/250423/p142",
    "timestamp": "2025-04-24T01:15:01Z"
  },
  {
    "title": "Bill Owens And 10 Other Media Figures Who Quit Because Of Trump",
    "description": "The '60 Minutes' producer is just the latest high-profile person to quit in protest of Trump administration policies or actions or other reasons related to president.",
    "link": "https://www.forbes.com/sites/tonifitzgerald/2025/04/23/bill-owens-and-10-other-media-figures-who-quit-because-of-trump/",
    "timestamp": "2025-04-24T01:14:32Z"
  },
  {
    "title": "\"Economically Reckless\": 12 US States Sue Trump Over Tariffs",
    "description": "A coalition of 12 American states filed a lawsuit Wednesday to challenge the Trump administration&#039;s tariffs, saying the president cannot institute the levies without the approval of Congress.",
    "link": "https://www.ndtv.com/world-news/12-us-states-sue-donald-trump-over-tariffs-8241141",
    "timestamp": "2025-04-24T01:14:20Z"
  },
  {
    "title": "'Fed up': CNN reporter 'alarmed' as FEMA sheds 20% of staff facing MAGA attacks",
    "description": "President Donald Trump and tech billionaire Elon Musk have caused a mass exodus of experienced staffers at the Federal Emergency Management Agency, or FEMA — just in time for what could be a brutal hurricane season, CNN's Gabe Cohen told anchor Jake Tapper on…",
    "link": "https://www.rawstory.com/fema-layoffs/",
    "timestamp": "2025-04-24T01:13:00Z"
  },
  {
    "title": "Americanism and Zionism are inseparable",
    "description": "Mike Huckabee’s appointment as US Ambassador to Israel highlights the deep religious connection between the two nations, with a focus on Zionism and Americanism as intertwined ideologies.",
    "link": "https://www.jpost.com/opinion/article-851255",
    "timestamp": "2025-04-24T01:12:46Z"
  },
  {
    "title": "Trump's cabinet ready to take back power with Musk stepping back, sources say",
    "description": "Elon Musk plans to reduce his government time commitment to one or two days a week to focus on his battered car company, Tesla.",
    "link": "https://www.japantimes.co.jp/news/2025/04/24/world/politics/trump-cabinet-power-musk-step-back/",
    "timestamp": "2025-04-24T01:12:00Z"
  },
  {
    "title": "Trump says Zelensky's statement \"very harmful to the peace negotiations with Russia\"",
    "description": "WASHINGTON, April 23 (Xinhua) -- U.S. President Donald Trump on Wednesday slammed Ukrainian Presiden",
    "link": "http://en.people.cn/n3/2025/0424/c90000-20306531.html",
    "timestamp": "2025-04-24T01:09:13Z"
  }
]