[
  {
    "title": "Putin lauds ‘heroism’ of North Koreans in liberating Kursk, Pyongyang says",
    "description": "Call between the two leaders comes days ahead of US President Donald Trump's summit with Putin in Alaska.",
    "link": "https://www.aljazeera.com/news/2025/8/13/putin-lauds-heroism-of-north-koreans-in-liberating-kursk-pyongyang-says",
    "timestamp": "2025-08-13T02:54:13Z"
  },
  {
    "title": "India Reels From US Tariff Hike Threat",
    "description": "Indian exporters are scrambling for options to mitigate the fallout of US President Donald Trump's threatened tariff salvo against the world's most populous nation.",
    "link": "https://www.ibtimes.com.au/india-reels-us-tariff-hike-threat-1860091",
    "timestamp": "2025-08-13T02:48:12Z"
  },
  {
    "title": "'Chaos Ahead’: India reels from US tariff hike threat, exporters warn of mass job losses",
    "description": "Indian exporters are scrambling for options to mitigate the fallout of US President Donald Trump's threatened tariff salvo against the world's most populous nation. Since Trump's tariff threats, Prime Minister Narendra Modi has spoken to both Putin and Ukrain…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/chaos-ahead-india-reels-from-us-tariff-hike-threat-exporters-warn-of-mass-job-losses/articleshow/123270190.cms",
    "timestamp": "2025-08-13T02:46:28Z"
  },
  {
    "title": "Trump admin orders Smithsonian museums to be reviewed for ‘Americanism’",
    "description": "White House says the review is in line with Trump's executive order on 'Restoring Truth and Sanity to American History'.",
    "link": "https://www.aljazeera.com/news/2025/8/13/trump-admin-orders-smithsonian-museums-to-be-reviewed-for-americanism",
    "timestamp": "2025-08-13T02:46:28Z"
  },
  {
    "title": "Mexico hands over 26 cartel figures to US",
    "description": "Mexico has sent 26 high-ranking cartel figures to the United States in the latest major deal with the Trump administration.",
    "link": "https://www.abc.net.au/news/2025-08-13/mexico-hands-over-26-cartel-figures-to-us-custody/105646540",
    "timestamp": "2025-08-13T02:45:53Z"
  },
  {
    "title": "India Reels From US Tariff Hike Threat",
    "description": "Indian exporters are scrambling for options to mitigate the fallout of US President Donald Trump's threatened tariff salvo against the world's most populous nation.",
    "link": "https://www.ibtimes.com/india-reels-us-tariff-hike-threat-3780773",
    "timestamp": "2025-08-13T02:45:23Z"
  },
  {
    "title": "India reels from US tariff hike threat",
    "description": "Indian exporters are scrambling for options to mitigate the fallout of US President Donald Trump's threatened tariff salvo against the world's most populous ...",
    "link": "https://finance.yahoo.com/news/india-reels-us-tariff-hike-024223848.html",
    "timestamp": "2025-08-13T02:42:23Z"
  },
  {
    "title": "European Leaders To Hold Ukraine Online Summit Before Trump-Putin Meet",
    "description": "European leaders will hold online talks with US President Donald Trump on Wednesday, hoping to convince him to respect Ukraine's interests when he discusses the war with Russia's Vladimir Putin in Alaska on Friday.",
    "link": "https://www.ibtimes.com/european-leaders-hold-ukraine-online-summit-before-trump-putin-meet-3780767",
    "timestamp": "2025-08-13T02:42:17Z"
  },
  {
    "title": "Maryland Governor 'Embarrassed' and 'Heartbroken' for National Guard in DC",
    "description": "Maryland's governor said Trump is using the National Guard as a \"tool to be able to advance his political purposes.\"",
    "link": "https://www.newsweek.com/trump-national-guard-washington-maryland-governor-heartbroken-2112634",
    "timestamp": "2025-08-13T02:41:57Z"
  },
  {
    "title": "Michael Goodwin: Mamdani’s NYC borough tour attacking Trump smacks of amateur hour",
    "description": "It seems as if it was only yesterday that Zohran Mamdani was running to be mayor of New York on an agenda he vowed would solve the “affordability crisis.”",
    "link": "https://nypost.com/2025/08/12/opinion/michael-goodwin-mamdanis-nyc-borough-tour-attacking-trump-smacks-of-amateur-hour/",
    "timestamp": "2025-08-13T02:41:42Z"
  },
  {
    "title": "European leaders to hold Ukraine online summit before Trump-Putin meet",
    "description": "European leaders will hold online talks with US President Donald Trump on Wednesday, hoping to convince him to respect Ukraine's interests when he discusses ...",
    "link": "https://www.yahoo.com/news/articles/european-leaders-hold-ukraine-online-023840231.html",
    "timestamp": "2025-08-13T02:38:40Z"
  },
  {
    "title": "Zelensky refuses to leave Donbass",
    "description": "Ceding territory to Russia would only lead to a new war, the Ukrainian leader claims Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622819-zelensky-donbass-ceding-territorry/",
    "timestamp": "2025-08-13T02:36:19Z"
  },
  {
    "title": "Trump's 50-hour ultimatum to Lip-Bu Tan reshaped Intel's future",
    "description": "On August 7, 2025, Eastern Time, US President Donald Trump publicly accused Intel CEO Lip-Bu Tan of a conflict of interest due to his investments in China and demanded that he resign immediately. Intel and Tan quickly responded with an open letter to employee…",
    "link": "https://www.digitimes.com/news/a20250813PD222/intel-2025-donald-trump-ceo-tsmc.html",
    "timestamp": "2025-08-13T02:36:04Z"
  },
  {
    "title": "National Guard troops appear in Washington as Trump’s takeover of DC law enforcement begins",
    "description": "Mayor Muriel Bowser is said to work alongside the federal officials President Trump has tasked with overseeing the city’s law enforcement.",
    "link": "https://indianexpress.com/article/world/national-guard-in-washington-trump-takeover-dc-law-enforcement-10185885/",
    "timestamp": "2025-08-13T02:33:37Z"
  },
  {
    "title": "Trump’s DC gambit is “distraction” from his “involvement in pedophile ring,” Philly DA says",
    "description": "Larry Krasner thinks Trump is trying to push one scandal out of the headlines with another.",
    "link": "https://www.salon.com/2025/08/12/trumps-dc-gambit-is-distraction-from-his-involvement-in-pedophile-ring-philly-da-says/",
    "timestamp": "2025-08-13T02:30:09Z"
  },
  {
    "title": "Jim Jordan Shares Primary Reason Why He Believes Schiff Whistleblower",
    "description": "Republican Ohio Rep. Jim Jordan said on Fox News Tuesday that he believes the whistleblower accusing Adam Schiff of misconduct is credible.",
    "link": "https://dailycaller.com/2025/08/12/jim-jordan-shares-primary-reason-why-he-believes-schiff-whistleblower/",
    "timestamp": "2025-08-13T02:29:33Z"
  },
  {
    "title": "India PM Modi likely to visit US next month, meet Trump, Indian Express reports",
    "description": "Indian Prime Minister Narendra Modi is likely to visit the United States next month to attend the UN General Assembly meeting and also hold talks with...",
    "link": "https://www.yahoo.com/news/articles/india-pm-modi-likely-visit-022317319.html",
    "timestamp": "2025-08-13T02:23:17Z"
  },
  {
    "title": "“Treasonous” and “Illegal”: Whistleblower Accused Schiff of Intentionally Leaking Classified Information",
    "description": "FBI Director Kash Patel has released a bombshell report that a Democratic whistleblower accused now California Sen. Adam Schiff of approving the leaking of classified information to target President Donald Trump. While this is only the unverified allegation o…",
    "link": "https://freerepublic.com/focus/f-news/4334275/posts",
    "timestamp": "2025-08-13T02:22:48Z"
  },
  {
    "title": "Asian shares rise, dollar defensive after mild inflation data",
    "description": "TOKYO :Stocks in Asia climbed and the U.S. dollar was subdued on Wednesday, as data showed both resilience in major economies and the need for central banks to remain accommodative.Wall Street scaled new heights on Tuesday, driven by increasing certainty the …",
    "link": "https://www.channelnewsasia.com/business/asian-shares-rise-dollar-defensive-after-mild-inflation-data-5291881",
    "timestamp": "2025-08-13T02:22:36Z"
  },
  {
    "title": "Trump-Putin Summit: All Eyes On Anchorage Military Base As Historic Meet Nears",
    "description": "President Donald Trump will meet Russian President Vladimir Putin in Anchorage, Alaska, on Friday, marking the first U.S.-Russia leaders' summit in over four years. \nJoint Base Elmendorf-Richardson was chosen for security reasons, despite initial hopes for a …",
    "link": "https://biztoc.com/x/1332da70d32acba2",
    "timestamp": "2025-08-13T02:19:20Z"
  },
  {
    "title": "National Guard troops now on DC streets told to maintain presence near National Mall",
    "description": "National Guard troops called on to active-duty by President Donald Trump arrived on the footsteps of the Washington Monument on Tuesday.",
    "link": "https://abcnews.go.com/Politics/guard-members-waiting-orders-begin-gather-dc/story?id=124587539",
    "timestamp": "2025-08-13T02:17:25Z"
  },
  {
    "title": "India Has Been 'Recalcitrant' In Trade Talks, Says US Treasury's Bessent",
    "description": "US Treasury Secretary Scott Bessent said on Tuesday that India has been \"a bit recalcitrant\" in talks with the United States das after Donald Trump announced an additional 25% tariffs on the south Asian nation's imports.",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariff-tensions-india-has-been-recalcitrant-in-trade-talks-says-us-treasury-secretary-scott-bessent",
    "timestamp": "2025-08-13T02:15:29Z"
  },
  {
    "title": "Washingtonians Tired Of Crime But Skeptical Of Trump Takeover",
    "description": "A 15-minute walk from the White House, Tony and Mike stood on the sidewalk near the spot where a man was killed on Monday, the 100th murder of the year in Washington.",
    "link": "https://www.ibtimes.com.au/washingtonians-tired-crime-skeptical-trump-takeover-1860085",
    "timestamp": "2025-08-13T02:15:18Z"
  },
  {
    "title": "Philly D.A. Krasner on Rise in Some Crime Categories: 'Trump Is the Public Safety Emergency'",
    "description": "On Tuesday’s broadcast of CNN’s “The Source,” Philadelphia District Attorney Larry Krasner (D) responded to a question on the rise in some crime categories in the city and what he would say to someone concerned about that by saying that\nThe post Philly D.A. K…",
    "link": "https://www.breitbart.com/clips/2025/08/12/philly-d-a-krasner-on-rise-in-some-crime-categories-trump-is-the-public-safety-emergency/",
    "timestamp": "2025-08-13T02:13:37Z"
  },
  {
    "title": "‘Crazy!!’: How Labor Statistics staff reacted to Trump firing commissioner after dismal jobs report",
    "description": "‘Crazy!!’: How Labor Statistics staff reacted to Trump firing commissioner after dismal jobs report\nWASHINGTON (AP) — “Depressing.”\n“CRAZY!!”\nThat’s how staff at the Bureau of Labor Statistics reacted after President Donald Trump fired its commissioner, Erika…",
    "link": "https://biztoc.com/x/2c8d1d53c17b1d8f",
    "timestamp": "2025-08-13T02:08:16Z"
  },
  {
    "title": "National Guard troops arrive in DC under Trump's order to fight crime, homelessness",
    "description": "Mayor Muriel Bowser sought to reassure residents in the nation's capital, adding that the National Guard deployment was unnecessary.",
    "link": "https://www.usatoday.com/story/news/nation/2025/08/12/donald-trump-washington-dc-national-guard-troops/85635442007/",
    "timestamp": "2025-08-13T02:06:07Z"
  },
  {
    "title": "CNBC Daily Open: Will the other shoe drop when it comes to U.S. inflation?",
    "description": "Markets hit record highs as investors saw inflation numbers as a sign the Fed has room to cut rates more — or that tariffs might not drive prices much higher.",
    "link": "https://www.cnbc.com/2025/08/13/cnbc-daily-open-will-the-other-shoe-drop-when-it-comes-to-us-inflation.html",
    "timestamp": "2025-08-13T02:02:36Z"
  },
  {
    "title": "Chainlink Surges Past $21: Whale Buys and SWIFT Partnership Could Ignite a Run to $30",
    "description": "Chainlink (LINK) has surged over 27% in the past week, breaking above $21, as institutional adoption and whale accumulation fuel bullish momentum. Related Reading: Crypto News: What’s Operation Chokepoint And Why Did Donald Trump Shut It Down? The oracle netw…",
    "link": "https://bitcoinist.com/chainlink-surges-past-21-whale-buys-and-swift/",
    "timestamp": "2025-08-13T02:00:09Z"
  },
  {
    "title": "Top U.S. diplomat Landau to attend Uribe funeral in Colombia",
    "description": "Deputy Secretary of State Christopher Landau will visit Colombia to show concern over the death of Colombian Senator Miguel Uribe Turbay",
    "link": "https://www.upi.com/Top_News/US/2025/08/12/landau-colombia/5151755046783/",
    "timestamp": "2025-08-13T01:59:57Z"
  },
  {
    "title": "Trump-Putin meeting set for Alaska military base",
    "description": "United States President Donald Trump and Russian President Vladimir Putin are likely to meet at Joint Base Elmendorf-Richardson in Anchorage on Friday, CNN reported, citing White House officials.\nThe...",
    "link": "https://biztoc.com/x/70e1a07081d5d08b",
    "timestamp": "2025-08-13T01:57:15Z"
  },
  {
    "title": "Why Was 'The Late Show With Stephen Colbert' Canceled?",
    "description": "Stephen Colbert announced in July that CBS will be canceling “The Late Show” in May 2026, more than 10 years after he took over as host.",
    "link": "https://www.today.com/popculture/tv/why-was-the-late-show-stephen-colbert-canceled-rcna224144",
    "timestamp": "2025-08-13T01:56:54Z"
  },
  {
    "title": "‘Petty or Racist?’ Former White House Photographer Bashes Trump for Moving Obama Portrait Out of Sight",
    "description": "Pete Souza, the former Chief Official White House Photographer, wrote a post on Instagram Tuesday bashing President Donald Trump for what he deemed a \"pretty petty\" move to hide former President Barack Obama's portrait.\nThe post ‘Petty or Racist?’ Former Whit…",
    "link": "https://www.mediaite.com/media/news/petty-or-racist-former-white-house-photographer-bashes-trump-for-moving-obama-portrait-out-of-sight/",
    "timestamp": "2025-08-13T01:55:39Z"
  },
  {
    "title": "S&P 500, Nasdaq end at record closing highs as moderate inflation lifts rate hopes",
    "description": "Stock indexes rise on rate cut hopes; tech stocks soar; Alphabet up on $34.5 billion offer for Chrome browser.",
    "link": "https://www.thehindubusinessline.com/markets/sp-500-nasdaq-end-at-record-closing-highs-as-moderate-inflation-lifts-rate-hopes/article69927031.ece",
    "timestamp": "2025-08-13T01:52:33Z"
  },
  {
    "title": "Gold firms as soft US data pressures dollar, fuels rate-cut bets",
    "description": "Gold prices saw a slight increase due to a weaker dollar. This followed tame United States inflation data, increasing bets for a September interest rate cut. A trade truce between Washington and Beijing limited gold's gains. The United States and China extend…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-firms-as-soft-us-data-pressures-dollar-fuels-rate-cut-bets/articleshow/123269707.cms",
    "timestamp": "2025-08-13T01:51:50Z"
  },
  {
    "title": "Asian Markets Follow US Stocks Rally, Treasuries Fall",
    "description": "Stocks climbed to a record after an in-line US inflation reading bolstered speculation the Federal Reserve will have room to cut rates in September. The MSCI All Country World Index rose 0.1% to an all-time high, tracking Wall Street’s surge to fresh peaks. A…",
    "link": "https://www.ndtvprofit.com/markets/global-stock-markets-asian-indices-hang-sheng-nikkei-dax-ftse-nasdaq-s-and-p-dow-jones-news-today-13-auguest-2025",
    "timestamp": "2025-08-13T01:47:58Z"
  },
  {
    "title": "Oil prices little changed as industry report points to slowing US demand",
    "description": "Oil prices showed minimal movement on Wednesday, following a decline triggered by a U.S. crude stockpile increase, signaling the approaching end of peak summer demand. Brent crude saw a slight gain, while U.S. West Texas Intermediate futures dipped marginally…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-little-changed-as-industry-report-points-to-slowing-us-demand/articleshow/123269643.cms",
    "timestamp": "2025-08-13T01:45:01Z"
  },
  {
    "title": "'He’s lying': Nobel-winner Paul Krugman calls out Trump's new 'malicious nonsense'",
    "description": "Nobel Prize-winning economist turned political pundit Paul Krugman hit back after President Donald Trump attacked him by name on his Truth Social platform over the weekend.\"Paul Krugman of the New York Times has been predicting Doom and Gloom ever since my gr…",
    "link": "https://www.rawstory.com/trump-krugman-2673879858/",
    "timestamp": "2025-08-13T01:43:05Z"
  },
  {
    "title": "S&P 500, Nasdaq end at record closing highs as moderate inflation lifts rate hopes",
    "description": "The S&P 500 and Nasdaq reached record closing highs following news of expected July inflation figures, bolstering anticipation of a Federal Reserve interest rate cut next month. Encouraged by easing trade tensions and strong tech earnings, U.S. stocks rallied…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-end-at-record-closing-highs-as-moderate-inflation-lifts-rate-hopes/articleshow/123269604.cms",
    "timestamp": "2025-08-13T01:42:32Z"
  },
  {
    "title": "Donald Trump News Updates: US President to sign executive orders on Wednesday afternoon",
    "description": "U.S. President Donald Trump will sign executive orders at the White House on Wednesday at 1600 ET (2000 GMT), the White House said late on Tuesday.",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-live-updates-august-13-donald-trump-pm-modi-russia-ukraine-israel-gaza-weather-rain-monsoon-parliament-monsoon-session/liveblog/123269601.cms",
    "timestamp": "2025-08-13T01:42:26Z"
  },
  {
    "title": "MSNBC's Scarborough: 'So Many' Democrats Secretly Cheering Trump's D.C. Crackdown",
    "description": "MSNBC host Joe Scarborough said Tuesday on \"Morning Joe\" that \"so many\" Democrats secretly support President Donald Trump's takeover of the police force in Washington, D.C.\nThe post MSNBC’s Scarborough: ‘So Many’ Democrats Secretly Cheering Trump’s D.C. Crack…",
    "link": "https://www.breitbart.com/clips/2025/08/12/msnbcs-scarborough-so-many-democrats-secretly-cheering-trumps-d-c-crackdown/",
    "timestamp": "2025-08-13T01:41:28Z"
  },
  {
    "title": "Dollar slips as investors eye September Fed cut",
    "description": "The dollar weakened due to tame U.S. inflation data, increasing expectations of a Federal Reserve rate cut next month. President Trump's attempts to influence the Fed further undermined the currency. While investors are pricing in a high probability of a rate…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-slips-as-investors-eye-september-fed-cut/articleshow/123269571.cms",
    "timestamp": "2025-08-13T01:40:47Z"
  },
  {
    "title": "Musk Has Gone Quiet About the Launch of His ‘America Party’ — Here’s What We Know",
    "description": "Maybe Elon Musk is more interested in planets than politics.\nThe post Musk Has Gone Quiet About the Launch of His ‘America Party’ — Here’s What We Know appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/musk-gone-quiet-launch-america-party-know/",
    "timestamp": "2025-08-13T01:40:28Z"
  },
  {
    "title": "Millions to lose health insurance and food stamps from GOP tax bill: CBO - NewsBreak",
    "description": "The Congressional Budget Office said Tuesday that millions of low-income people will lose health insurance and food stamps following changes to entitlement",
    "link": "https://www.newsbreak.com/share/4169344453685-millions-to-lose-health-insurance-and-food-stamps-from-gop-tax-bill-cbo?s=a2&amp;share_destination_id=ODg1MTU1ODEtMTc1NTA0OTExMzk0NQ%3D%3D&amp;pd=05zOwfH7&amp;hl=en_US&amp;send_time=1755049113&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q3-v1%2Cns_foryou_blend_exp_25q3-v9%2Cns_foryou_model_exp_25q3-v8%2Cns_foryou_recall_exp_25q3-v1",
    "timestamp": "2025-08-13T01:38:58Z"
  },
  {
    "title": "Sharpton: Trump 'Race-Baiting' by Targeting Black Majority Cities",
    "description": "MSNBC political commentator Al Sharpton said Tuesday on \"Chris Jansing Reports\" that President Donald Trump taking federal control of the police department in Washington, D.C. and calling out crime in other majority black cities is \"race-baiting.\"\nThe post Sh…",
    "link": "https://www.breitbart.com/clips/2025/08/12/sharpton-trump-race-baiting-by-targeting-black-majority-cities/",
    "timestamp": "2025-08-13T01:38:37Z"
  },
  {
    "title": "Ukraine's Zelensky Says Putin Will Benefit From Trump Meeting in 3 Ways",
    "description": "Volodymyr Zelensky said in a new interview that he believes Vladimir Putin will significantly \"benefit\" from his meeting with Trump.",
    "link": "https://www.newsweek.com/ukraine-zelensky-putin-benefits-trump-alaska-summit-2112615",
    "timestamp": "2025-08-13T01:36:14Z"
  },
  {
    "title": "Marlow: Lawfare Judge Lewis A. Kaplan Hid E. Jean Carroll Had Dog Named 'Tits,' Thinks Rape Considered 'Sexy'",
    "description": "On Tuesday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow discussed the E. Jean Carroll case. Marlow stated that Carroll said “she wouldn’t initially call it rape, because…rapes are sexy. … Trump wanted to introduce evidence that would s…",
    "link": "https://www.breitbart.com/clips/2025/08/12/marlow-lawfare-judge-lewis-a-kaplan-hid-e-jean-carroll-had-dog-named-tits-thinks-rape-considered-sexy/",
    "timestamp": "2025-08-13T01:35:43Z"
  },
  {
    "title": "Target shooter 'coldly executed girl, 4, in back seat of car after making her watch as he murdered her grandpa'",
    "description": "A tragic image showed the 4-year-old girl who was tragically shot dead by a crazed gunman outside of Target moments after she watched her grandfather murdered. Astrid Chow was shot in front of her grandmother along with grandfather Adam Chow, 65, in the parki…",
    "link": "https://freerepublic.com/focus/f-news/4334269/posts",
    "timestamp": "2025-08-13T01:35:22Z"
  },
  {
    "title": "Before Trump Federalized D.C. Police, White House Reporters Complained for Years About Crime in Capital",
    "description": "White House correspondents and reporters have complained and cited instances of violent crime taking place in Washington, DC, throughout the past several years.\nThe post Before Trump Federalized D.C. Police, White House Reporters Complained for Years About Cr…",
    "link": "https://www.breitbart.com/politics/2025/08/12/before-trump-federalized-d-c-police-white-house-reporters-complained-for-years-about-crime-in-capital/",
    "timestamp": "2025-08-13T01:34:50Z"
  },
  {
    "title": "Ex-Harris aide argues more police won’t make streets safer, citing experience as a ‘Black woman in America’",
    "description": "Ex-Harris spokesperson Sanders-Townsend pushed back against Trump's crime initiative, arguing increased police presence doesn't improve safety for everyone in America.",
    "link": "https://www.foxnews.com/media/ex-harris-aide-argues-more-police-wont-make-streets-safer-citing-experience-black-woman-america",
    "timestamp": "2025-08-13T01:30:56Z"
  },
  {
    "title": "'Stop Production': Small US Firms Battered By Shifting Tariffs",
    "description": "When US President Donald Trump announced tariffs on almost all trading partners in April, Ben Knepler contacted the factory in Cambodia producing his company's outdoor furniture.",
    "link": "https://www.ibtimes.com/stop-production-small-us-firms-battered-shifting-tariffs-3780762",
    "timestamp": "2025-08-13T01:30:20Z"
  },
  {
    "title": "Trump didn't say Ireland would 'bear consequences' over Israel boycott proposal. Some Republicans want him to",
    "description": "In 2025, U.S. President Donald Trump said to Ireland: \"If you try to economically isolate Israel, you will bear consequences.\"",
    "link": "https://www.snopes.com//fact-check/trump-quote-israel-ireland-boycott/",
    "timestamp": "2025-08-13T01:30:00Z"
  },
  {
    "title": "Putin is about to outplay Trump again in Alaska",
    "description": "Trump isn’t wrong to try sitting down with U.S. foes and rivals, even where more conventional leaders would avoid the risk. But hastily arranged encounters rarely result as hoped.",
    "link": "https://www.japantimes.co.jp/commentary/2025/08/13/world/putin-trump-alaska-meeting/",
    "timestamp": "2025-08-13T01:28:00Z"
  },
  {
    "title": "Trial Begins Over Trump's Use Of National Guard In California",
    "description": "Trial Begins Over Trump's Use Of National Guard In California\n \nA federal court began hearing testimony on Aug. 11 in a trial to determine whether President Donald Trump illegally used National Guard troops for law enforcement in California.\nThe trial is part…",
    "link": "https://biztoc.com/x/423ec1a601d1dd9c",
    "timestamp": "2025-08-13T01:23:55Z"
  },
  {
    "title": "Marlow: Charging Letitia James Would Represent 'Justice Being Served for President Trump'",
    "description": "New York Attorney General Letitia James emerged as the most \"shamelessly\" blatant abuser of lawfare against President Donald Trump, but now the legal tables are turning against her, Breitbart News Editor-in-Chief Alex Marlow explained on \"The Megyn Kelly Show…",
    "link": "https://www.breitbart.com/politics/2025/08/12/marlow-charges-against-letitia-james-represent-justice-being-served-for-president-trump/",
    "timestamp": "2025-08-13T01:22:22Z"
  },
  {
    "title": "Putin reaffirms 'friendship' with North Korea ahead of Trump talks",
    "description": "Kim Jong Un provides Moscow with artillery, missiles - and as a BBC investigation shows, labourers working in 'slave-like' condition.",
    "link": "https://www.bbc.com/news/articles/ckge2kr85wzo",
    "timestamp": "2025-08-13T01:18:36Z"
  },
  {
    "title": "Newsom Tells Donald “TACO” Trump His Time’s Up In All Caps Message",
    "description": "California Governor Gavin Newsom told Donald Trump today that the president had missed the deadline to pull back from creating “illegal crooked maps” in red states to manipulate coming elections. As a result, Newsom indicated the nation’s most populous state …",
    "link": "http://deadline.com/2025/08/newsom-trump-gerrymandering-deadline-1236485050/",
    "timestamp": "2025-08-13T01:18:06Z"
  },
  {
    "title": "Trump-Putin summit to take place at U.S. military base in Anchorage",
    "description": "President Donald Trump and Russian President Vladimir Putin are expected to meet at the U.S. military base in Anchorage, Alaska on Friday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-putin-summit-location-joint-base-elmendorf-richardson-anchorage-rcna224656",
    "timestamp": "2025-08-13T01:17:10Z"
  },
  {
    "title": "California says Trump sent military to 'silence' LA protests",
    "description": "The US government's unprecedented use of National Guard troops in Los Angeles to protect officers carrying out President Donald Trump's immigration crackdown was illegal and should be ended, a lawyer for the state of California told a federal judge on Tuesday…",
    "link": "https://www.channelnewsasia.com/world/california-national-guard-troops-los-angeles-la-silence-protests-trump-5291711",
    "timestamp": "2025-08-13T01:16:49Z"
  },
  {
    "title": "‘Some alpha males these are!’ GOP lawmakers ridiculed over fear of 'walking outside'",
    "description": "A progressive lawyer brutally mocked the GOP on Tuesday for its hypocrisy over crime in Washington, D.C.Marc Elias, founder of Democracy Docket, joined progressive YouTuber Brian Tyler Cohen on \"Democracy Watch\" to discuss Trump's move to federalize law enfor…",
    "link": "https://www.rawstory.com/marc-elias-2673879807/",
    "timestamp": "2025-08-13T01:13:54Z"
  },
  {
    "title": "Oil prices little changed as industry report points to slowing US demand",
    "description": "Oil prices were little changed on Wednesday after falling in the previous session after an industry report showed U.S. crude stockpiles climbed last week illustrating the end of the seasonal summer demand period is nearing. Brent crude futures gained 3 cents …",
    "link": "https://www.channelnewsasia.com/business/oil-prices-little-changed-industry-report-points-slowing-us-demand-5291791",
    "timestamp": "2025-08-13T01:11:40Z"
  },
  {
    "title": "Report: Israel is in talks to possibly resettle Palestinians from Gaza in South Sudan",
    "description": "If implemented, plans would amount to transferring people from one war-ravaged land at risk of famine to another - raising human rights concerns",
    "link": "https://www.haaretz.com/israel-news/2025-08-13/ty-article/report-israel-is-in-talks-to-possibly-resettle-palestinians-from-gaza-in-south-sudan/00000198-a0e4-dff4-a39e-a9ffea000000",
    "timestamp": "2025-08-13T01:10:38Z"
  },
  {
    "title": "Mexico transfers 26 more cartel members to US",
    "description": "Mexico has sent more than two dozen suspected cartel members to the US, amid rising pressure from President Donald Trump on Mexico to dismantle the country's powerful drug organisations.",
    "link": "https://www.rte.ie/news/us/2025/0813/1528168-us-mexico-extradition/",
    "timestamp": "2025-08-13T01:09:46Z"
  },
  {
    "title": "Jimmy Kimmel Gets Italian Citizenship Due to U.S. Politics",
    "description": "Jimmy Kimmel could be saying ciao to a new country.\nThe Jimmy Kimmel Live! host revealed that he’s obtained Italian citizenship amid his feud with President Donald Trump.\n“I did get Italian...",
    "link": "https://www.eonline.com/news/1421085/jimmy-kimmel-gets-italian-citizenship",
    "timestamp": "2025-08-13T01:09:46Z"
  },
  {
    "title": "Trump sent military to ‘silence’ LA protests, says California as judge questions president’s authority on troop deployment",
    "description": "In June, Trump had ordered the deployment of 4,000 National Guard troops and 700 Marines to Los Angeles in order to contain days of protests and unrest triggered by mass immigration raids.",
    "link": "https://indianexpress.com/article/world/trump-sent-military-to-silence-la-protests-says-california-10185823/",
    "timestamp": "2025-08-13T01:07:43Z"
  },
  {
    "title": "Russia Advancing",
    "description": "Not great, Bob. Ukraine surged some of its most combat-hardened forces to the eastern Donetsk region to blunt a Russian advance some fear could lead to a large-scale collapse on that part of the front. The battlefield moves come days ahead of a planned meetin…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/russia-advancing",
    "timestamp": "2025-08-13T01:07:23Z"
  },
  {
    "title": "David Axelrod Warns of Trump’s ‘Stalinist’ Strong-Arming of the Smithsonian: ‘A Soviet Feel to It’",
    "description": "CNN commentator David Axelrod deemed President Donald Trump's latest directive to the Smithsonian Institution \"Stalinist\" in nature.\nThe post David Axelrod Warns of Trump’s ‘Stalinist’ Strong-Arming of the Smithsonian: ‘A Soviet Feel to It’ first appeared on …",
    "link": "https://www.mediaite.com/media/tv/david-axelrod-warns-of-trumps-stalinist-strong-arming-of-the-smithsonian-a-soviet-feel-to-it/",
    "timestamp": "2025-08-13T01:07:08Z"
  },
  {
    "title": "Asian stocks gain after US CPI fuels Fed rate cut bets",
    "description": "Global stocks reached record highs following a US inflation report that fueled speculation of a potential Federal Reserve rate cut in September. The data suggested the Fed could ease policy without triggering significant price increases, despite underlying in…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-after-us-cpi-fuels-fed-rate-cut-bets/articleshow/123269119.cms",
    "timestamp": "2025-08-13T01:07:00Z"
  },
  {
    "title": "Trump's Washington D.C. crime crackdown leads to 23 arrests on first day",
    "description": "Trump invokes federal control over D.C. police amid crime surge, with National Guard spotted leaving armory as authorities arrest 23 suspects",
    "link": "https://www.foxnews.com/us/national-guard-troops-spotted-washington-d-c-trump-launches-crackdown-street-crime",
    "timestamp": "2025-08-13T01:05:47Z"
  },
  {
    "title": "‘Crazy!!’: How Labor Statistics staff reacted to Trump firing commissioner after dismal jobs report",
    "description": "Staff at the Bureau of Labor Statistics called President Donald Trump's firing of its commissioner “depressing” and “CRAZY.",
    "link": "https://www.clickondetroit.com/business/2025/08/12/crazy-how-labor-statistics-staff-reacted-to-trump-firing-commissioner-after-dismal-jobs-report/",
    "timestamp": "2025-08-13T01:00:36Z"
  },
  {
    "title": "Jeanine Pirro shuts down reporters questioning Trump’s DC crime crackdown",
    "description": "Jeanine Pirro defended D.C. crime response efforts by referencing families of murder victims and assault cases during heated media exchange.",
    "link": "https://www.foxnews.com/media/jeanine-pirro-shuts-down-reporters-questioning-trumps-dc-crime-crackdown",
    "timestamp": "2025-08-13T01:00:28Z"
  },
  {
    "title": "Stablecoin Leader Circle Beats Q2 Expectations, CRCL Stock Climbs 5%",
    "description": "Circle Internet Financial, the issuer of the USDC stablecoin, has seen its newly listed stock, CRCL, gain 5% on Tuesday after reporting robust revenue figures in the second quarter of the year following its initial public offering (IPO).  USDC Circulation Soa…",
    "link": "http://www.newsbtc.com/news/stablecoin-leader-circle-beats-q2-expectations-crcl-stock-climbs-5/",
    "timestamp": "2025-08-13T01:00:17Z"
  },
  {
    "title": "Oil Holds Decline With Focus on Trump-Putin Meeting on Ukraine",
    "description": "Oil was steady after dropping in thin trading on Tuesday, with investors looking to talks between the US and Russian leaders on Friday for fresh impetus.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-decline-with-focus-on-trump-putin-meeting-on-ukraine",
    "timestamp": "2025-08-13T00:58:17Z"
  },
  {
    "title": "'Committed to both': After Munir's nuke threat, US says ties with India and Pakistan remain unchanged",
    "description": "The US State Department says its relationship with Pakistan and India remains good. Diplomats are committed to both nations. This statement follows concerns about potential conflict. The US cites successful diplomatic efforts to prevent escalation. The US and…",
    "link": "https://economictimes.indiatimes.com/news/india/committed-to-both-after-munirs-nuke-threat-us-says-ties-with-india-and-pakistan-remain-unchanged/articleshow/123268946.cms",
    "timestamp": "2025-08-13T00:53:32Z"
  },
  {
    "title": "UN Security Council Sounds Alarm on Rising Threats to Maritime Security",
    "description": "The United Nations Security Council convened Monday for a critical debate on maritime security, highlighting the escalating challenges facing global shipping lanes amid geopolitical tensions, piracy, and emerging cyber threats....",
    "link": "https://gcaptain.com/un-security-council-sounds-alarm-on-rising-threats-to-maritime-security/",
    "timestamp": "2025-08-13T00:52:42Z"
  },
  {
    "title": "‘Not welcome’: English town protests against JD Vance’s holiday",
    "description": "Dozens of activists and locals protested on Tuesday against a visit by US Vice President JD Vance to an idyllic rural region of southwest England, where he is on holiday with family. Around 60 people gathered for the demonstration in the town of Charlbury in …",
    "link": "https://www.digitaljournal.com/world/not-welcome-english-town-protests-against-jd-vances-holiday/article",
    "timestamp": "2025-08-13T00:52:20Z"
  },
  {
    "title": "Washingtonians tired of crime but skeptical of Trump takeover",
    "description": "A 15-minute walk from the White House, Tony and Mike stood on the sidewalk near the spot where a man was killed on Monday, the 100th murder of the year in Washington. The shooting broke out just a few hours after President Donald Trump announced a federal tak…",
    "link": "https://www.digitaljournal.com/world/washingtonians-tired-of-crime-but-skeptical-of-trump-takeover/article",
    "timestamp": "2025-08-13T00:52:20Z"
  },
  {
    "title": "Trump's tariffs keep coming. Stock markets don't seem to care.",
    "description": "At least for now, the U.S. stock market is on board with President Donald Trump’s increasingly aggressive use of executive power",
    "link": "https://www.nbcnews.com/business/markets/how-trump-tariffs-impact-stock-market-investors-rcna224521",
    "timestamp": "2025-08-13T00:46:13Z"
  },
  {
    "title": "How to beat Trump tariffs",
    "description": "Speed up FTAs and diversify export markets",
    "link": "https://www.thehindubusinessline.com/opinion/how-to-beat-trump-tariffs/article69925612.ece",
    "timestamp": "2025-08-13T00:45:00Z"
  },
  {
    "title": "Trump may allow lawsuit against Powell, over Fed renovation, amid rate tension",
    "description": "The renovation work has become a flash point in Trump’s pressure campaign against Powell and the central bank for not lowering borrowing costs.",
    "link": "https://www.japantimes.co.jp/news/2025/08/13/world/politics/trump-lawsuit-powell-fed-renovation/",
    "timestamp": "2025-08-13T00:44:00Z"
  },
  {
    "title": "Pentagon Golden Dome to have 4-layer defense system",
    "description": "The Trump administration plans a multi-layered missile defense system. It is called Golden Dome. The system will have satellite and land-based components. Eleven short-range batteries will be located across the US. The project faces a 2028 deadline. It draws …",
    "link": "https://economictimes.indiatimes.com/news/defence/pentagon-golden-dome-to-have-4-layer-defense-system/articleshow/123268780.cms",
    "timestamp": "2025-08-13T00:40:03Z"
  },
  {
    "title": "‘Bobby and I trust and love each other’: RFK Jr’s wife Cheryl Hines breaks silence after his sexting scandal with journalist Olivia Nuzzi",
    "description": "Cheryl Hines breaks her silence on marriage to RFK Jr., brushing off affair rumors with Olivia Nuzzi nearly a year after the sexting scandal shook his presidential campaign.",
    "link": "https://indianexpress.com/article/entertainment/hollywood/rfk-jrs-wife-cheryl-hines-breaks-silence-after-his-sexting-scandal-with-journalist-olivia-nuzzi-10185800/",
    "timestamp": "2025-08-13T00:39:51Z"
  },
  {
    "title": "Texas House Democrats Relent And Head Home",
    "description": "Texas House Democrats will end their weeks-long standoff Tuesday and return to Austin.",
    "link": "https://dailycaller.com/2025/08/12/texas-house-democrats-return-austin/",
    "timestamp": "2025-08-13T00:38:18Z"
  },
  {
    "title": "War for Ukraine Day 1,265: The Next Part of Russia’s Maskirovka",
    "description": "It has been a very long, very unpleasant day, so I’m just going to run through the basics tonight. Russia has telegraphed the next portion of the maskirovka line of effort in their influence campaign. Russia announces its next war crime [image or embed] — Kat…",
    "link": "https://balloon-juice.com/2025/08/12/war-for-ukraine-day-1265-the-next-part-of-russias-maskirovka/",
    "timestamp": "2025-08-13T00:38:00Z"
  },
  {
    "title": "CNN Data Chief Spots How Trump Is 'Too Involved' On This 1 Issue",
    "description": "Harry Enten said residents in this community don't exactly see the president as a \"conquering hero\" on the issue.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-washington-dc-trump-federalize-police-troops_n_689bbf75e4b09184403f3a44",
    "timestamp": "2025-08-13T00:36:13Z"
  },
  {
    "title": "Mexico transfers 26 cartel figures wanted by U.S. authorities in deal with Trump administration",
    "description": "Mexico sent 26 high-ranking cartel figures to the United States Tuesday in the latest major deal with the Trump administration as American authorities ratchet up pressure on criminal networks smuggling drugs across the border. Those being handed over to U.S. …",
    "link": "https://japantoday.com/category/world/mexico-expels-26-cartel-figures-wanted-by-us-authorities-in-deal-with-trump-administration",
    "timestamp": "2025-08-13T00:33:29Z"
  },
  {
    "title": "White House orders review of exhibits at Smithsonian museums ahead of nation's 250th birthday",
    "description": "The White House is ordering a wide-ranging review of the Smithsonian museums and exhibitions ahead of the country's 250th birthday with a goal of aligning the institution's content with President Donald Trump's interpretation of American history. In a letter …",
    "link": "https://japantoday.com/category/world/white-house-orders-a-review-of-exhibits-at-smithsonian-museums-ahead-of-nation%27s-250th-birthday",
    "timestamp": "2025-08-13T00:32:19Z"
  },
  {
    "title": "When Will ‘South Park’ Season 27 Return With Episode 3?",
    "description": "It’s still unclear if \"South Park\" Season 27, Episode 3 will be on Comedy Central and Paramount+ this week.",
    "link": "https://www.forbes.com/sites/timlammers/2025/08/12/when-will-south-park-season-27-return-with-episode-3/",
    "timestamp": "2025-08-13T00:32:07Z"
  },
  {
    "title": "White House orders a review of exhibits at Smithsonian museums ahead of nation's 250th birthday",
    "description": "The White House is ordering a review of the Smithsonian museums to align content with President Donald Trump's interpretation of American history.",
    "link": "https://roanoke.com/life-entertainment/nation-world/art-theater/article_ec544a22-a29b-55b8-8a32-b31c23a56a9a.html",
    "timestamp": "2025-08-13T00:30:00Z"
  },
  {
    "title": "White House orders a review of exhibits at Smithsonian museums ahead of nation's 250th birthday",
    "description": "The White House is ordering a review of the Smithsonian museums to align content with President Donald Trump's interpretation of American history.",
    "link": "https://richmond.com/life-entertainment/nation-world/art-theater/article_4c87cbf7-c22c-5a68-a671-4a5678a4be67.html",
    "timestamp": "2025-08-13T00:30:00Z"
  },
  {
    "title": "Exclusive - Huckabee: Christians Doubting Israel 'Come Out of Weak Churches'",
    "description": "U.S. Ambassador to Israel Mike Huckabee told Breitbart News on Tuesday that Christians who deny the Biblical basis for supporting Israel have been \"indoctrinated\" at universities or \"come out of weak churches.\"\nThe post Exclusive – Huckabee: Christians Doubti…",
    "link": "https://www.breitbart.com/faith/2025/08/12/exclusive-huckabee-christians-israel/",
    "timestamp": "2025-08-13T00:26:52Z"
  },
  {
    "title": "Myanmar region sees 'dramatic' hunger rise after aid cutbacks",
    "description": "The situation was exacerbated in April when the World Food Program was forced to cut aid to 1 million people nationwide.",
    "link": "https://www.japantimes.co.jp/news/2025/08/13/asia-pacific/myanmar-hunger-aid-cutbacks/",
    "timestamp": "2025-08-13T00:25:00Z"
  },
  {
    "title": "DEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC",
    "description": "DEA head Terry Cole outlined the “unified effort\" to reduce crime in Washington, D.C. after Trump declared a federal takeover of local police.",
    "link": "https://www.foxnews.com/media/dea-head-touts-getting-phone-calls-from-all-over-country-from-fed-agents",
    "timestamp": "2025-08-13T00:23:41Z"
  },
  {
    "title": "Trump nominates conservative economist to head agency that compiles jobs, inflation data",
    "description": "Trump nominates conservative economist to head agency that compiles jobs, inflation datawftv.com",
    "link": "https://www.wftv.com/news/trump-nominates/5SOYHJ3BEFFR5AUHPRKAOCIUMU/",
    "timestamp": "2025-08-13T00:22:47Z"
  },
  {
    "title": "In an Echo of L.A., Trump Deploys National Guard to D.C.",
    "description": "President Donald Trump took federal control of the police force in Washington D.C. this week, deploying 800 National Guard troops. The president claims the city is plagued by violent crime despite data showing it at a 30-year low. This comes amid the three-da…",
    "link": "https://www.kqed.org/news/12051916/in-an-echo-of-l-a-trump-deploys-national-guard-to-d-c",
    "timestamp": "2025-08-13T00:18:26Z"
  },
  {
    "title": "White House To Host Cage Fight On July 4: UFC Boss",
    "description": "The White House is to play host to a mixed martial arts bout on July 4 next year, the day the United States marks the 250th anniversary of its founding, UFC boss Dana White said Tuesday.",
    "link": "https://www.ibtimes.com/white-house-host-cage-fight-july-4-ufc-boss-3780757",
    "timestamp": "2025-08-13T00:15:16Z"
  },
  {
    "title": "Washingtonians Tired Of Crime But Skeptical Of Trump Takeover",
    "description": "A 15-minute walk from the White House, Tony and Mike stood on the sidewalk near the spot where a man was killed on Monday, the 100th murder of the year in Washington.",
    "link": "https://www.ibtimes.com/washingtonians-tired-crime-skeptical-trump-takeover-3780754",
    "timestamp": "2025-08-13T00:15:14Z"
  },
  {
    "title": "Trump's DC public safety sweep results in 23 arrests including murder suspect on opening day",
    "description": "FBI Director Kash Patel reports 23 arrests as part of Trump's initiative to federalize Washington D.C. police and tackle crime in the nation's capital.",
    "link": "https://www.foxnews.com/us/trumps-dc-public-safety-sweep-results-23-arrests-including-murder-suspect-opening-day",
    "timestamp": "2025-08-13T00:14:42Z"
  },
  {
    "title": "Mamdani pressed on pledge to be Trump's 'worst nightmare' and landlord pushback on rent freeze plan",
    "description": "New York City socialist mayoral candidate Zohran Mamdani is defending his attacks on President Trump along with his plan to \"freeze\" rent, which has drawn some criticism.",
    "link": "https://www.foxnews.com/politics/mamdani-pressed-on-pledge-to-be-trumps-worst-nightmare-and-landlord-pushback-on-rent-freeze-plan",
    "timestamp": "2025-08-13T00:13:44Z"
  },
  {
    "title": "Panama Canal to Enter Port Business With Dual-Terminal Tender",
    "description": "The Panama Canal is planning to enter the ports business with a tender for two terminals, a move that comes amid a high-profile clash between the US and China over the waterway.",
    "link": "https://gcaptain.com/panama-canal-to-enter-port-business-with-dual-terminal-tender/",
    "timestamp": "2025-08-13T00:13:19Z"
  }
]