[
  {
    "title": "The U.S. dollar has fallen to its lowest value since 1973. Here's what that means",
    "description": "President Donald Trump wants the U.S. to increase its exports and lower its imports. Thanks to a historic decline in the value of the U.S. dollar, he may get his wish — but at a cost he may not have anticipated.\nOver the past six months, the dollar has declin…",
    "link": "https://biztoc.com/x/f0b1a76785bd4e66",
    "timestamp": "2025-07-02T17:33:54Z"
  },
  {
    "title": "Californians Call on Donald Trump To Declare State of Emergency",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCalifornia state lawmakers have formally requested that President Donald Trump declare a national state of emergency to address ongoing sewage pollution from Mexico that has impacted the Tijuana River Valley a…",
    "link": "https://biztoc.com/x/725093789aff40e1",
    "timestamp": "2025-07-02T17:33:45Z"
  },
  {
    "title": "The First Amendment Protects CNN's Reporting on ICEBlock and Iran",
    "description": "President Donald Trump has routinely taken umbrage with journalists exercising their freedom of expression to report on the news, which the First Amendment absolutely protects. CNN is the president's latest target.\nAt a Tuesday press conference, Homeland Secu…",
    "link": "https://biztoc.com/x/3c2b9923db2016f5",
    "timestamp": "2025-07-02T17:33:35Z"
  },
  {
    "title": "Visualizing the Plunge in Border Crossings Under Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAfter a slight rise in May, arrests of immigrants illegally crossing the United States border with Mexico are back on the decline, reaching near-record lows.\nOn Tuesday, President Donald Trump's border czar, T…",
    "link": "https://biztoc.com/x/73f237d5f9eb747d",
    "timestamp": "2025-07-02T17:33:32Z"
  },
  {
    "title": "Paramount Will Pay President Trump $16 Million to Settle 60 Minutes Lawsuit",
    "description": "“It is a dark day for independent journalism,” says Sen. Bernie Sanders.",
    "link": "https://www.cjr.org/news/paramount-will-pay-president-trump-16-million-to-settle-60-minutes-lawsuit.php",
    "timestamp": "2025-07-02T17:31:55Z"
  },
  {
    "title": "Californians Call on Donald Trump To Declare State of Emergency",
    "description": "Sewage crisis along the U.S.-Mexico border has resulted in more than 100 billion gallons of contaminated water crossing into California since 2018.",
    "link": "https://www.newsweek.com/californians-call-donald-trump-declare-state-emergency-2093647",
    "timestamp": "2025-07-02T17:31:29Z"
  },
  {
    "title": "Jason Bateman Blasted Live On Fox News Over Donald Trump Comments",
    "description": "Jason Bateman is facing backlash from Fox News stars after commenting on the supporters of U.S. President Donald Trump.",
    "link": "https://www.yahoo.com/news/jason-bateman-blasted-live-fox-173028036.html",
    "timestamp": "2025-07-02T17:30:28Z"
  },
  {
    "title": "Analysis shows Trump's tariffs would cost US employers $82.3 billion",
    "description": "The sum could potentially be managed through price hikes, layoffs, hiring freezes or lower profit margins.",
    "link": "https://roanoke.com/news/nation-world/business/article_6585eab7-b319-5d9f-853f-ea3a738fac73.html",
    "timestamp": "2025-07-02T17:30:00Z"
  },
  {
    "title": "Analysis shows Trump's tariffs would cost US employers $82.3 billion",
    "description": "The sum could potentially be managed through price hikes, layoffs, hiring freezes or lower profit margins.",
    "link": "https://richmond.com/news/nation-world/business/article_4fa64d51-73a6-5a33-92f2-34cee2eb27ca.html",
    "timestamp": "2025-07-02T17:30:00Z"
  },
  {
    "title": "As Trump pressures Republicans on budget bill, Democrats eye 2026 pickups: Analysis",
    "description": "The political fallout from President Donald Trump’s budget reconciliation bill may create openings for Democrats as the party rebuilds in the wake of its 2024 losses.",
    "link": "https://abcnews.go.com/Politics/trump-pressures-republicans-budget-bill-democrats-eye-2026/story?id=123351153",
    "timestamp": "2025-07-02T17:29:20Z"
  },
  {
    "title": "Apple’s Top App Is Now ICEBlock After White House Criticism",
    "description": "ICEBlock, a free app that alerts users to nearby Immigration and Customs Enforcement (ICE) activity, has surged to the top of the App Store’s social networking chart. The spike follows strong criticism from the White House, drawing more attention to a platfor…",
    "link": "https://www.macobserver.com/news/apples-top-app-is-now-iceblock-after-white-house-criticism/",
    "timestamp": "2025-07-02T17:29:15Z"
  },
  {
    "title": "North Carolina Republican Senate Nomination Seems To Be All Lara Trump’s — If She Wants It",
    "description": "Speculation is growing that Lara Trump could return to North Carolina for a Senate bid—with President Donald Trump's backing, the seat may be hers to claim.",
    "link": "https://dailycaller.com/2025/07/02/lara-trump-pat-harrigan-richard-hudson-north-carolina-gubernatorial-race-donald-trump/",
    "timestamp": "2025-07-02T17:28:16Z"
  },
  {
    "title": "Trump announces Vietnam trade deal with 20% import tariff",
    "description": "Deal with Vietnam would be just the third announced following agreements with the U.K. and China ahead of the July 9 deadline. Read more",
    "link": "https://financialpost.com/news/trump-vietnam-trade-deal-20-percent-tariff",
    "timestamp": "2025-07-02T17:27:58Z"
  },
  {
    "title": "AOC Rails Against Trump’s No Tax on Tips ‘Scam’ in ‘Deal with the Devil’ Budget Bill",
    "description": "Alexandria Ocasio-Cortez called President Donald Trump's Big Beautiful Bill a \"deal with the devil\" and claimed his long-promised \"no tax on tips\" is a scam.\nThe post AOC Rails Against Trump’s No Tax on Tips ‘Scam’ in ‘Deal with the Devil’ Budget Bill first a…",
    "link": "https://www.mediaite.com/media/tv/aoc-rails-against-trumps-no-tax-on-tips-scam-in-deal-with-the-devil-budget-bill/",
    "timestamp": "2025-07-02T17:27:10Z"
  },
  {
    "title": "CBS settlement with Trump slammed by journalists, commentators as 'appalling' surrender",
    "description": "Members of the press, political commentators and more raged against Paramount Global and CBS News for settling President Donald Trump's lawsuit against the network.",
    "link": "https://www.foxnews.com/media/cbs-settlement-trump-slammed-journalists-commentators-appalling-surrender",
    "timestamp": "2025-07-02T17:27:05Z"
  },
  {
    "title": "The First Amendment Protects CNN's Reporting on ICEBlock and Iran",
    "description": "The Justice Department cannot constitutionally prosecute a news outlet for covering the news.",
    "link": "https://reason.com/2025/07/02/the-first-amendment-protects-cnns-reporting-on-iceblock-and-iran/",
    "timestamp": "2025-07-02T17:26:55Z"
  },
  {
    "title": "Lawfare strikes again: Rogue judge ignores SCOTUS, shields 500,000 from Trump's immigration crackdown",
    "description": "Another district judge sought to block the Trump administration's mass deportation efforts by preventing the Department of Homeland Security from stripping Temporary Protected Status from over 500,000 immigrants, despite the administration's recent Supreme Co…",
    "link": "https://www.theblaze.com/news/lawfare-strikes-again-rogue-judge-ignores-scotus-shields-500000-from-trump-s-immigration-crackdown",
    "timestamp": "2025-07-02T17:25:00Z"
  },
  {
    "title": "Iran deployed bots to post 240K times to block US strikes on nuclear facilities",
    "description": "Iran deployed a massive bot network to sway U.S. opinion against Trump’s Iran strike.",
    "link": "https://nypost.com/2025/07/02/world-news/iranian-bots-posted-240k-times-to-block-us-strikes/",
    "timestamp": "2025-07-02T17:24:59Z"
  },
  {
    "title": "New Vietnam trade deal means Apple will pay at least five times more in tariffs",
    "description": "President Donald Trump's new trade deal with Vietnam raises dramatically hikes import costs for Apple's hardware including AirPods, almost all iPads, and the Mac mini.Tim Cook at a Foxconn plant in Vietnam — image credit: AppleFollowing Apple's massive global…",
    "link": "https://appleinsider.com/articles/25/07/02/new-vietnam-trade-deal-means-apple-will-pay-at-least-five-times-more-in-tariffs",
    "timestamp": "2025-07-02T17:24:39Z"
  },
  {
    "title": "Shoe Stocks Mixed as US-Vietnam Trade Deal Framework Revealed",
    "description": "Wall Street is still digesting what the tariff implications are for shoe firms now that there is a basic framework for a US-Vietnam trade deal.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/shoe-stocks-tariff-framework-us-vietnam-trade-deal-1237964876/",
    "timestamp": "2025-07-02T17:22:58Z"
  },
  {
    "title": "'Extremely upset': CNN host presses GOP lawmaker on popularity of Medicaid cuts",
    "description": "CNN's Dana Bash pressed Rep. Jason Smith (R-MO), chair of the House Ways and Means Committee, about the proposed Medicaid cuts in the mega spending bill being taken up by the House Wednesday.The Senate passed the bill Tuesday with an 80-hour per month work re…",
    "link": "https://www.rawstory.com/medicaid-cuts-2672557757/",
    "timestamp": "2025-07-02T17:22:58Z"
  },
  {
    "title": "Sean “Diddy” Combs convicted on prostitution charges — not guilty of sex trafficking, racketeering",
    "description": "Combs faces a maximum sentence of 20 years after the split jury verdict [UPDATED]",
    "link": "https://www.salon.com/2025/07/02/sean-diddy-combs-convicted-on-prostitution-charges-not-guilty-of-sex-trafficking-racketeering/",
    "timestamp": "2025-07-02T17:22:55Z"
  },
  {
    "title": "Visualizing the Plunge in Border Crossings Under Trump",
    "description": "June saw another major drop in border apprehensions to near-record lows.",
    "link": "https://www.newsweek.com/us-mexico-border-illegal-crossings-june-trump-2093712",
    "timestamp": "2025-07-02T17:22:53Z"
  },
  {
    "title": "US Tariff Whiplash Hits Importers as Maersk Warns of Overpayments",
    "description": "In This Article:\nMaersk estimates that U.S. businesses are currently paying an average 21 percent tariff relative to container load on all imports, marking a reprieve from the 54 percent average in mid-April after President Donald Trump escalated tariffs on C…",
    "link": "https://biztoc.com/x/03cd98fc05c4a4bf",
    "timestamp": "2025-07-02T17:22:30Z"
  },
  {
    "title": "Trump Announces Vietnam Trade Deal With 20% Import Tariff",
    "description": "President Donald Trump said he had reached a trade deal with Vietnam following weeks of intense diplomacy between the nations and ahead of a deadline next week that would have seen higher tariffs imposed on the country’s imports.\nA 20% tariff will be placed o…",
    "link": "https://biztoc.com/x/a889eb5cf9dec64f",
    "timestamp": "2025-07-02T17:22:25Z"
  },
  {
    "title": "‘Support is soft’: Kamala Harris manages to bore California voters into Republican curiosity",
    "description": "'We're in a period of disappointment and distrust. No one seems happy with anything'",
    "link": "https://www.wnd.com/2025/07/support-is-soft-kamala-harris-manages-bore-california/",
    "timestamp": "2025-07-02T17:22:25Z"
  },
  {
    "title": "16 key provisions in Trump’s tax bill that passed the Senate",
    "description": "By Alicia Diaz, Bloomberg\nPresident Donald Trump’s multitrillion-dollar tax and spending package moved closer to reality after it passed the Senate Tuesday.\nRELATED: Bay Area Democratic leaders assail Trump tax and policy bill after Senate passes it\nRepublica…",
    "link": "https://biztoc.com/x/9802bbd3c0b3c30b",
    "timestamp": "2025-07-02T17:22:15Z"
  },
  {
    "title": "Paramount Settles Trump ‘60 Minutes’ Lawsuit For $16 Million",
    "description": "Paramount has agreed to pay $16 million to settle a lawsuit brought by President Donald Trump over the editing of a 2024 “60 Minutes” interview with then–Vice President Kamala Harris. Trump alleged CBS News misrepresented Harris’ answers, causing “mental angu…",
    "link": "https://biztoc.com/x/7ca9c9377c806362",
    "timestamp": "2025-07-02T17:22:12Z"
  },
  {
    "title": "Three in Four Americans Concerned Iran Will Retaliate on US",
    "description": "A majority of Democrats, Republicans and independents expressed some degree of worry, a recent poll found.",
    "link": "https://www.newsweek.com/americans-iran-israel-military-retaliation-nuclear-2093639",
    "timestamp": "2025-07-02T17:22:03Z"
  },
  {
    "title": "Iran Ends Cooperation With UN Nuclear Watchdog After Israel, US Strikes",
    "description": "Iran on Wednesday officially suspended its cooperation with the UN nuclear watchdog, a move the world body described as \"obviously concerning\".",
    "link": "https://www.ibtimes.com.au/iran-ends-cooperation-un-nuclear-watchdog-after-israel-us-strikes-1859511",
    "timestamp": "2025-07-02T17:21:17Z"
  },
  {
    "title": "Trump says his relationship with one-time rival DeSantis now a '9.9'",
    "description": "Trump and Gov. DeSantis showcase their renewed relationship at \"Alligator Alcatraz,\" a migrant detention center built in eight days as part of Trump's immigration policy.",
    "link": "https://www.foxnews.com/politics/trump-says-his-relationship-one-time-rival-desantis-now-9-9",
    "timestamp": "2025-07-02T17:20:59Z"
  },
  {
    "title": "Want Cheaper Solar Panels, Home Batteries or a Heat Pump? Better Act Soon",
    "description": "Trump’s tax bill passed by the Senate would end some clean energy tax credits after Dec. 31. Homeowners and installers are racing to meet the deadline.",
    "link": "https://financialpost.com/pmn/business-pmn/want-cheaper-solar-panels-home-batteries-or-a-heat-pump-better-act-soon",
    "timestamp": "2025-07-02T17:20:47Z"
  },
  {
    "title": "Jobs, block clubs, investment: How Chicagoans are interrupting violence at its roots",
    "description": "On a recent Tuesday, dozens of people lined the block waiting their turn at a food pantry that shares a building with the Institute for Nonviolence Chicago (INVC). The long line was a stark reminder of the connections between poverty and violence cited by res…",
    "link": "http://chicagoreader.com/news/feature-news-politics/gun-violence-chicago-change/",
    "timestamp": "2025-07-02T17:16:47Z"
  },
  {
    "title": "Trump ramps up pressure on House Republicans to pass major tax cut and spending bill",
    "description": "Several House Republicans arrived White House on Wednesday morning for meetings as the president presses his party to pass the sweeping legislation.",
    "link": "https://abcnews.go.com/Politics/trump-ramps-pressure-house-republicans-pass-major-tax/story?id=123413001",
    "timestamp": "2025-07-02T17:14:18Z"
  },
  {
    "title": "Trump shuts down fish restoration pact that took decades to build",
    "description": "The Donald Trump administration has pulled the federal government out of a Joe Biden-era plan to invest more than $1 billion in restoring endangered Columbia River fish runs. The original memorandum signed in December 2023 by Biden charged a group of federal …",
    "link": "https://freerepublic.com/focus/f-news/4326537/posts",
    "timestamp": "2025-07-02T17:13:36Z"
  },
  {
    "title": "Trump’s crypto ventures have added $620M to his net worth — Report",
    "description": "With the US president’s ties to his family-backed business, World Liberty Financial, and a memecoin launch, Donald Trump has seen his personal wealth increase by millions in 2025.",
    "link": "https://cointelegraph.com/news/donald-trump-crypto-ventures-net-worth",
    "timestamp": "2025-07-02T17:13:05Z"
  },
  {
    "title": "Climate and empowering women must be a priority, development bank bosses say",
    "description": "SEVILLE, Spain (Reuters) -Multilateral development banks need to sharpen their focus on delivering climate action and on empowering women, the heads of two major MDBs in Asia and Europe told Reuters, as they face calls to be bolder, more flexible and inclusiv…",
    "link": "https://www.thestar.com.my/news/world/2025/07/03/climate-and-empowering-women-must-be-a-priority-development-bank-bosses-say",
    "timestamp": "2025-07-02T17:13:00Z"
  },
  {
    "title": "Could Kamala Harris Lose California Gubernatorial Race? What New Poll Says",
    "description": "Four in 10 California voters are undecided about who they'll support in next year's gubernatorial race, according to a new poll.",
    "link": "https://www.newsweek.com/kamala-harris-california-gubernatorial-race-new-poll-undecided-voters-2093691",
    "timestamp": "2025-07-02T17:12:58Z"
  },
  {
    "title": "North Carolina’s clean energy sector raises alarm on cuts in ‘Big Beautiful Bill’",
    "description": "As Republicans work to pass President Donald Trump’s “Big Beautiful Bill” before the self-imposed July 4 deadline, North Carolina’s clean energy sector is sounding the alarm about provisions in the bill focused on clean energy they say could undermine job gro…",
    "link": "https://www.wsoctv.com/news/local/north-carolinas-clean-energy-sector-raises-alarm-cuts-big-beautiful-bill/DDDDT4QKJRHT3MOCQ53UJATRVA/",
    "timestamp": "2025-07-02T17:12:10Z"
  },
  {
    "title": "Feeding the Warfare State: We Lose, the Weapon Makers Win",
    "description": "The US Senate has passed the distinctly misnamed “big beautiful bill.” It is, in fact, one of the ugliest pieces of legislation to come out of Congress in living memory. The House of Representatives passed a previous version on May 22, 2025, which would cut $…",
    "link": "https://www.fairobserver.com/politics/feeding-the-warfare-state-we-lose-the-weapon-makers-win/",
    "timestamp": "2025-07-02T17:11:23Z"
  },
  {
    "title": "Bitcoin Rebounds Toward $110K, Presaging What Could Be a Volatile July",
    "description": "Bitcoin BTC is bouncing hard towards $110,000 on Wednesday, shrugging off Tuesday's brief risk-off wave that dragged the price below $106,000.\nRecently, the largest crypto traded at its strongest price since June 11, around $109,500, up 3.5% over the past 24 …",
    "link": "https://biztoc.com/x/540d80866185ff7e",
    "timestamp": "2025-07-02T17:11:18Z"
  },
  {
    "title": "Trump’s tariffs would cost US employers $82.3 billion, potentially causing price hikes and layoffs",
    "description": "President Donald Trump says he's reached a trade deal with Vietnam. Trump says Vietnam will pay a 20% tariff on goods sent into U.S. territory and a 40% tariff on transshipping, which usually means exports from China that pass through Vietnam.",
    "link": "https://biztoc.com/x/b6040750831918da",
    "timestamp": "2025-07-02T17:11:12Z"
  },
  {
    "title": "Sources: US Halts Some Ukraine Missile Shipments Over Low Stockpiles",
    "description": "The Pentagon has halted some shipments of air defense missiles and other precision munitions to Ukraine over concerns that U.S. stockpiles are too low, two people familiar with the decision said Tuesday. The slowing of some weapons shipments promised to Kyiv …",
    "link": "https://freerepublic.com/focus/f-news/4326536/posts",
    "timestamp": "2025-07-02T17:11:06Z"
  },
  {
    "title": "Trump Asks Supreme Court To Reinstate Consumer Board Firings",
    "description": "President Donald Trump’s administration has asked the U.S. Supreme Court to allow the removal of three Consumer Product Safety Commission (CPSC) members appointed by Joe Biden, after a lower court ordered their reinstatement in May. The administration seeks a…",
    "link": "https://biztoc.com/x/2841d27d655004c5",
    "timestamp": "2025-07-02T17:10:57Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say?s=a2&amp;share_destination_id=ODE4MzE0MzQtMTc1MTQ3NjE2NzMxNQ%3D%3D&amp;pd=05XM5qNW&amp;hl=en_US&amp;send_time=1751476167&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v5%2Cns_foryou_recall_exp_25q3-v2%2Cns_foryou_blend_exp_25q2-control%2Cns_foryou_rank_exp_25q2-v2",
    "timestamp": "2025-07-02T17:09:53Z"
  },
  {
    "title": "Daughter of assassinated civil rights leader sees painful echoes of political violence in America",
    "description": "Medgar Evers was assassinated by a white supremacist in 1963.",
    "link": "https://www.bostonherald.com/2025/07/02/medgar-evers-birthday/",
    "timestamp": "2025-07-02T17:09:39Z"
  },
  {
    "title": "Trump announces Vietnam trade deal, dropping 90% tariff",
    "description": "Comes just days before July 9 deadline for agreements, and cuts assessments on clothes, shoes, electronics and furniture shipped into the U.S.",
    "link": "https://www.wnd.com/2025/07/trump-announces-vietnam-trade-deal-dropping-90-tariff/",
    "timestamp": "2025-07-02T17:07:26Z"
  },
  {
    "title": "Lauren Sanchez & Jeff Bezos' Wedding Angers America's Loudest Beer Heiress",
    "description": "Lauren Sanchez and Jeff Bezos' wedding exists in a weird space. On the one hand, you have left-leaning guests like Oprah Winfrey, Leonardo DiCaprio, and Katy Perry, who couldn't make it. On the other, freaking Donald Trump was invited, but...\nRead more...",
    "link": "https://www.pajiba.com/news/lauren-sanchez-jeff-bezos-wedding-angers-meghan-mccain.php",
    "timestamp": "2025-07-02T17:06:55Z"
  },
  {
    "title": "Trump’s America Burning More Coal As Power Demand Surges",
    "description": "The United States generated more electricity from coal between January and April 2025 than it did during the same period in 2024.",
    "link": "https://dailycaller.com/2025/07/02/trump-america-burning-more-coal-rising-power-demand/",
    "timestamp": "2025-07-02T17:06:42Z"
  },
  {
    "title": "HART: Mid-Year Lookback",
    "description": "'It is complex, but all I know is that none of these warring factions drink bourbon or eat bacon. So, this is not my war.'",
    "link": "https://dailycaller.com/2025/07/02/ron-hart-biden-trump-mid-year-lookback/",
    "timestamp": "2025-07-02T17:05:59Z"
  },
  {
    "title": "President Trump announces Vietnam trade deal; 20% tariff on Vietnam, 0% on U.S.",
    "description": "President Donald Trump announced on Wednesday a new trade agreement with Vietnam, imposing a 20% tariff on Vietnamese imports to the U.S.…\nThe post President Trump announces Vietnam trade deal; 20% tariff on Vietnam, 0% on U.S. appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/07/02/president-trump-announces-vietnam-trade-deal-20-tariff-on-vietnam-0-on-u-s/",
    "timestamp": "2025-07-02T17:05:38Z"
  },
  {
    "title": "Hamas Issues Warning to Arab Countries as It Mulls Trump Ceasefire Deal",
    "description": "A senior Hamas official warned \"normalization with the occupation does not bring prosperity.\"",
    "link": "https://www.newsweek.com/hamas-warning-arab-countries-trump-ceasefire-israel-2093773",
    "timestamp": "2025-07-02T17:05:13Z"
  },
  {
    "title": "Trump is 'working the phones' to get megabill over the finish line (Megan Messerly/Politico)",
    "description": "Megan Messerly / Politico:\nTrump is ‘working the phones’ to get megabill over the finish line  —  President Donald Trump is ramping up a pressure campaign on House Freedom Caucus members as he tries to get his “Big Beautiful Bill” across the finish line ahead…",
    "link": "https://www.memeorandum.com/250702/p85",
    "timestamp": "2025-07-02T17:05:00Z"
  },
  {
    "title": "Penn Caves to Trump Administration on Transgender Athletes",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/07/02/penn-transgender-athletes-trump/",
    "timestamp": "2025-07-02T17:03:51Z"
  },
  {
    "title": "MSNBC, CNN see dramatic declines in viewership — while Fox News continues to dominate: Nielsen",
    "description": "Fox News Channel extended its reign as the most-watched cable news network in both total day and primetime viewership, according to Nielsen data.",
    "link": "https://nypost.com/2025/07/02/media/msnbc-cnn-see-declines-in-viewership-as-fox-news-keeps-lead/",
    "timestamp": "2025-07-02T17:01:58Z"
  },
  {
    "title": "‘South Park’ Creators Blame Season 27 Delay on ‘Shitshow’ Paramount Merger",
    "description": "Paramount and Skydance inked the $8 billion deal almost a year ago, but have yet to receive FCC approval. Meanwhile, South Park is also stuck in limbo regarding its future streaming home",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/south-park-season-27-delay-paramount-merger-1235377650/",
    "timestamp": "2025-07-02T17:01:46Z"
  },
  {
    "title": "Trump’s tariffs would cost US employers $82.3 billion, potentially causing price hikes and layoffs",
    "description": "President Donald Trump says he's reached a trade deal with Vietnam. Trump says Vietnam will pay a 20% tariff on goods sent into U.S. territory and a 40% tariff on transshipping, which usually means exports from China that pass through Vietnam.",
    "link": "https://www.pbs.org/newshour/economy/trumps-tariffs-would-cost-us-employers-82-3-billion-potentially-causing-price-hikes-and-layoffs",
    "timestamp": "2025-07-02T17:01:16Z"
  },
  {
    "title": "A Bull in the China Policy Shop",
    "description": "The “move fast and break things” approach of Trump’s second term has undermined some of his administration’s own China goals.",
    "link": "http://foreignpolicy.com/2025/07/02/trump-china-policy-tariffs-strategy-trade-aid-cuts/",
    "timestamp": "2025-07-02T17:00:59Z"
  },
  {
    "title": "Trump Announces Trade Deal With Vietnam, Including ‘Access to Their Markets’",
    "description": "30% of Vietnam's exports go to America, which makes the country \"vulnerable to Trump's tariffs.\"\nThe post Trump Announces Trade Deal With Vietnam, Including ‘Access to Their Markets’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/trump-announces-trade-deal-with-vietnam-including-access-to-their-markets/",
    "timestamp": "2025-07-02T17:00:58Z"
  },
  {
    "title": "Carney Meets With Automakers as Canada’s Factories Show Tariff Strain",
    "description": "Canadian Prime Minister Mark Carney is meeting with automotive executives Wednesday to discuss how to help auto plants that have been choked by US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-meets-with-automakers-as-canadas-factories-show-tariff-strain",
    "timestamp": "2025-07-02T17:00:20Z"
  },
  {
    "title": "Carney meets with automakers as Canada's factories show tariff strain",
    "description": "Exports of cars and light trucks plunge as automakers GM and Stellantis reduce shifts and Ford idles a plant near Toronto. Keep reading here",
    "link": "https://financialpost.com/transportation/autos/carney-meets-with-automakers-as-canadas-factories-show-tariff-strain",
    "timestamp": "2025-07-02T17:00:20Z"
  },
  {
    "title": "Letters: Do politicians know how bad our rural roads are? Ethan Blackadder will be a future All Black",
    "description": "OPINION: Seymour is a little fish in this big ocean, who knows how to swim with the tide.",
    "link": "https://www.nzherald.co.nz/nz/letters-do-politicians-know-how-bad-our-rural-roads-are-ethan-blackadder-will-be-a-future-all-black/2BUXHG4DYJHJVCQHNI5BTQ5ZRQ/",
    "timestamp": "2025-07-02T17:00:00Z"
  },
  {
    "title": "Trump’s Betrayal of Ukraine",
    "description": "Bridget Brink, the former ambassador to Ukraine, on that country’s war with Russia, America’s betrayal of Ukraine, and why she resigned",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/07/david-frum-show-trump-ukraine-russia-bridget-brink/683399/",
    "timestamp": "2025-07-02T17:00:00Z"
  },
  {
    "title": "Trump’s plan to replace clean energy with fossil fuels has some major problems",
    "description": "The first solar cell ever made was built in the United States. Tesla, based in the US, was once the largest EV manufacturer in the world. The lithium ion battery was codeveloped in the US. But today, China — not the US — is the largest manufacturer of solar c…",
    "link": "https://www.vox.com/climate/418563/trump-big-beautiful-bill-clean-energy-fossil-climate",
    "timestamp": "2025-07-02T16:59:33Z"
  },
  {
    "title": "Colorado Capitol replaces 'distorted' Trump portrait following monthslong backlash",
    "description": "A new presidential portrait has been installed at Colorado state Capitol in Denver after President Donald Trump claimed the previous piece \"distorted\" him.",
    "link": "https://www.foxnews.com/politics/colorado-capitol-replaces-distorted-trump-portrait-following-months-long-backlash",
    "timestamp": "2025-07-02T16:58:48Z"
  },
  {
    "title": "Ukraine looks to jointly produce weapons with allies as the US halts some shipments",
    "description": "Analysts say Europe can help fill some gaps but lacks alternatives to key U.S. systems.",
    "link": "https://www.bostonherald.com/2025/07/02/russia-ukraine-war-weapon-production/",
    "timestamp": "2025-07-02T16:57:43Z"
  },
  {
    "title": "Greenland has a message for the rest of the world: Come visit",
    "description": "The mineral-rich Arctic island is open for tourism.",
    "link": "https://www.bostonherald.com/2025/07/02/greenland-tourism/",
    "timestamp": "2025-07-02T16:57:36Z"
  },
  {
    "title": "Greenland has a message for the rest of the world: Come visit",
    "description": "The mineral-rich Arctic island is open for tourism.",
    "link": "https://www.denverpost.com/2025/07/02/greenland-tourism/",
    "timestamp": "2025-07-02T16:57:36Z"
  },
  {
    "title": "Student Loan Repayments Changed by Trump's Big Beautiful Bill: What to Know",
    "description": "The bill, if signed into law by President Donald Trump, would bring about major changes to the federal loan system.",
    "link": "https://www.newsweek.com/student-loan-repayments-trump-big-beautiful-bill-2093676",
    "timestamp": "2025-07-02T16:56:57Z"
  },
  {
    "title": "Student loan borrowers will have fewer repayment options under GOP megabill",
    "description": "The Senate narrowly passed it massive spending bill on July 1. Here's what it could mean for student loan borrowers if the bill becomes law.",
    "link": "https://www.cnbc.com/2025/07/02/what-the-gops-megabill-means-for-federal-student-loan-borrowers.html",
    "timestamp": "2025-07-02T16:56:47Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/law-crime-520571/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say",
    "timestamp": "2025-07-02T16:56:13Z"
  },
  {
    "title": "Nike, other retailer stocks rise on Trump's trade deal with Vietnam to reduce tariffs",
    "description": "(Reuters) -Shares of Nike and other apparel makers rose on Wednesday after U.S. President Donald Trump said he had struck a trade deal with Vietnam that...",
    "link": "https://finance.yahoo.com/news/nike-other-retailer-stocks-rise-165558120.html",
    "timestamp": "2025-07-02T16:55:58Z"
  },
  {
    "title": "Trump announces a U.S. trade deal with Vietnam",
    "description": "Against a ticking clock, President Donald Trump said Wednesday the United States has reached a trade agreement with Vietnam, pulling off the administration's third significant deal ahead of a self-imposed",
    "link": "https://www.abc12.com/news/business/trump-announces-a-u-s-trade-deal-with-vietnam/article_68070602-6e00-54b7-bb2f-42ce5a69941b.html",
    "timestamp": "2025-07-02T16:55:49Z"
  },
  {
    "title": "Paramount caves to Trump '60 Minutes' suit. Pathetic",
    "description": "Paramount's $16M settlement with Donald Trump over Kamala Harris' '60 Minutes' interview on CBS sets a scary precedent for free speech and journalism.",
    "link": "https://www.azcentral.com/story/entertainment/media/2025/07/02/paramount-trump-60-minutes-lawsuit/84440949007/",
    "timestamp": "2025-07-02T16:55:35Z"
  },
  {
    "title": "‘40 Acres’ Director Says Film Reminds People of Color That ‘We Have to Learn Our Own History’ Amid Politically Driven Erasures",
    "description": "As Trump-led attacks on DEI and efforts to remove non-white history continue across the country, filmmaker R.T. Thorne and star Danielle Deadwyler share their thoughts\nThe post ‘40 Acres’ Director Says Film Reminds People of Color That ‘We Have to Learn Our O…",
    "link": "https://www.thewrap.com/40-acres-danielle-deadwyler-rt-thorne-trump-dei-interview/",
    "timestamp": "2025-07-02T16:55:13Z"
  },
  {
    "title": "Alina Habba net worth: How much does Trump’s attorney nominee for New Jersey earns",
    "description": "Alina Habba, known for defending Donald Trump, has been nominated as U.S. Attorney for New Jersey, despite her background primarily in civil and corporate law. Habba, a first-generation Arab American, has become a prominent figure in Republican circles and co…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/alina-habba-net-worth-how-much-does-trumps-attorney-nominee-for-new-jersey-earns/articleshow/122210546.cms",
    "timestamp": "2025-07-02T16:55:00Z"
  },
  {
    "title": "Satellite Images Reveal Iranian Activity at Nuclear Site Trump Bombed",
    "description": "Analysts said the imagery by Maxar shows vehicles at the Fordo nuclear facility.",
    "link": "https://www.newsweek.com/iran-activity-nuclear-site-bombed-fordow-satellite-images-2093681",
    "timestamp": "2025-07-02T16:52:34Z"
  },
  {
    "title": "Trump’s Last-Minute Legal Maneuver Attempts To Dodge Iowa’s New Anti-SLAPP Law",
    "description": "After Donald Trump won the election, he was still so full of hatred, bile, and spite, that he sued the pollster Ann Selzer as well as the Des Moines Register. Selzer, who has been one of the most trusted names in polling, released a poll slightly before the e…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178254684",
    "timestamp": "2025-07-02T16:52:05Z"
  },
  {
    "title": "Dem Lawmakers In White Coats Protest Trump Megabill — Proceed To Get Drowned Out By Passing Tourists",
    "description": "The Democratic Doctors Caucus held a press event to protest Donald Trump's \"Big, Beautiful Bill,\" but were drowned out as tourists walked in front of them.",
    "link": "https://dailycaller.com/2025/07/02/dem-lawmakers-in-white-coats-protest-trump-megabill-proceed-to-get-drowned-out-by-passing-tourists/",
    "timestamp": "2025-07-02T16:51:54Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say?s=a2&amp;share_destination_id=MjUwMjM2Njk4LTE3NTE0NzQ5MzAzMTM%3D&amp;pd=0GvxzmGW&amp;hl=en_US&amp;send_time=1751474930&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v2%2Cns_foryou_blend_exp_25q2-v7%2Cns_foryou_recall_exp_25q3-v3",
    "timestamp": "2025-07-02T16:50:30Z"
  },
  {
    "title": "Kristi Noem looks to purge DHS staff that 'don't support' deportation policy",
    "description": "Department of Homeland Security Secretary Kristi Noem is looking to purge DHS staff that don’t support President Donald Trump’s deportation policies.Speaking Wednesday at the first meeting of the Homeland Security Advisory Council under the Trump administrati…",
    "link": "https://www.rawstory.com/kristi-noem-2672557812/",
    "timestamp": "2025-07-02T16:49:49Z"
  },
  {
    "title": "Denmark says Europeans should continue buying US military equipment",
    "description": "The Danish defence minister also said he sees “no imminent threat” to Denmark’s territorial integrity, despite Trump’s repeated threats to annex Greenland.",
    "link": "https://www.euractiv.com/section/defence/news/denmark-says-europeans-should-continue-buying-us-military-equipment/",
    "timestamp": "2025-07-02T16:49:33Z"
  },
  {
    "title": "First Trump-Africa summit to be held next week",
    "description": "The first African leaders’ summit of US President Donald Trump’s second term will be held next week in Washington, with heads of state from Gabon, Guinea-Bissau, Liberia, Mauritania, and Senegal. The news was first reported by African Intelligence and confirm…",
    "link": "https://biztoc.com/x/c46b047e964ca19d",
    "timestamp": "2025-07-02T16:48:55Z"
  },
  {
    "title": "House GOP Divided As Trump’s Spending Bill Faces Crucial Test",
    "description": "President Donald Trump and House Republican leaders are racing to rally support ahead of a pivotal vote on Trump’s tax and spending bill. With no public events on his schedule, Trump is holding meetings with GOP holdouts at the White House as the House prepar…",
    "link": "https://biztoc.com/x/4d150070d937087f",
    "timestamp": "2025-07-02T16:48:50Z"
  },
  {
    "title": "Steve Bannon Calls Out ‘Feckless’ Republicans for ‘Hiding’ From Democrats On Trump Budget Bill: ‘Offense! Offense! Offense!’",
    "description": "Steve Bannon was not pleased with Republicans on Wednesday as he watched Democrats blast President Donald Trump's Big Beautiful Bill on the House floor.\nThe post Steve Bannon Calls Out ‘Feckless’ Republicans for ‘Hiding’ From Democrats On Trump Budget Bill: ‘…",
    "link": "https://www.mediaite.com/media/podcasts/steve-bannon-calls-out-feckless-republicans-for-hiding-from-democrats-on-trump-budget-bill-offense-offense-offense/",
    "timestamp": "2025-07-02T16:48:43Z"
  },
  {
    "title": "Border Czar Homan Credits ‘Trump Effect’ for June’s Low Illegal-Alien Encounter Numbers",
    "description": "Border czar Tom Homan is praising the “Trump effect” after another drop in illegal-alien encounters at the southern border in June.   “Total Border Patrol... Read More\nThe post Border Czar Homan Credits ‘Trump Effect’ for June’s Low Illegal-Alien Encounter Nu…",
    "link": "https://www.dailysignal.com/2025/07/02/border-czar-homan-credits-trump-effect-junes-low-border-encounter-numbers/",
    "timestamp": "2025-07-02T16:48:36Z"
  },
  {
    "title": "Diddy trial sparks wild theories, and celebs are worried they are next on the list",
    "description": "Diddy faced trial with serious charges. He was not guilty of sex trafficking or racketeering. However, he was guilty of transporting women for prostitution. Wild theories then linked Diddy to Obama, Kamala Harris, and others. Some even connected him to the Pa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/diddy-trial-sparks-wild-theories-and-celebs-are-worried-they-are-next-on-the-list/articleshow/122210307.cms",
    "timestamp": "2025-07-02T16:47:22Z"
  },
  {
    "title": "Support Illinois students experiencing homelessness or housing instability with your purchase of a “7X Bingo Multiplier” Instant Ticket from the Illinois Lottery",
    "description": "The Illinois Lottery is nationally recognized for its pioneering work with specialty lottery tickets dedicated to raising awareness and funding for specific worthy causes that impact local communities. Nearly 20 years since it introduced its first-in-the-nati…",
    "link": "http://chicagoreader.com/reader-partners/support-illinois-students-experiencing-homelessness-housing-instability/",
    "timestamp": "2025-07-02T16:43:40Z"
  },
  {
    "title": "US Tariff Whiplash Hits Importers as Maersk Warns of Overpayments",
    "description": "Maersk estimates that U.S. businesses are currently paying an average 21 percent tariff, but often pay 5 to 6 percent more than they should.",
    "link": "https://sourcingjournal.com/topics/logistics/maersk-us-tariff-rate-21-percent-whiplash-overpayments-vietnam-china-inventory-imports-customs-1234754138/",
    "timestamp": "2025-07-02T16:43:07Z"
  },
  {
    "title": "With trade war hanging overhead, economic experts say N.L. has reason to be optimistic",
    "description": "Experts say the ongoing trade war with the United States means Canada's economic future is uncertain — but Newfoundland and Labrador's unique position to the ocean and new energy projects is cause for some optimism.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/nl-economy-boost-1.7575273",
    "timestamp": "2025-07-02T16:42:53Z"
  },
  {
    "title": "'People are going to die': Rain floods 'hurricane proof' Alligator Alcatraz",
    "description": "New video showed a \"garden-variety South Florida summer rainstorm\" flooding tents and drowning out Gov. Ron DeSantis (R) as he touted the \"Alligator Alcatrez\" detention facility he claimed was ready to house deportees, according to The Miami Herald.Rain began…",
    "link": "https://www.rawstory.com/alligator-alcatraz-2672557600/",
    "timestamp": "2025-07-02T16:42:43Z"
  },
  {
    "title": "Trump’s ‘big beautiful Bill’ may not be a cure-all for Republicans?",
    "description": "Legislative victory for president could damage party, given the tax-and-spend measure’s low popularity",
    "link": "https://www.irishtimes.com/world/us/2025/07/02/trumps-big-beautiful-bill-may-not-be-a-cure-all-for-republicans/",
    "timestamp": "2025-07-02T16:42:38Z"
  },
  {
    "title": "Obama’s Trump-Russia collusion report was corrupt from start: CIA review",
    "description": "A bombshell new CIA review of the Obama administration’s spy agencies assessment that Russia interfered in the 2016 presidential election to help Donald Trump was deliberately corrupted by then-CIA Director John Brennan, FBI Director James Comey, and Director…",
    "link": "https://freerepublic.com/focus/f-news/4326529/posts",
    "timestamp": "2025-07-02T16:42:21Z"
  },
  {
    "title": "Global shares little changed after UK market rout",
    "description": "Unexpectedly weak US jobs reports adds to atmosphere of caution",
    "link": "https://www.irishtimes.com/business/2025/07/02/global-shares-little-changed-after-uk-market-rout/",
    "timestamp": "2025-07-02T16:41:58Z"
  },
  {
    "title": "Director of north Gaza hospital killed alongside his family in Israeli strike on apartment",
    "description": "The director of one of north Gaza's largest hospitals was killed, along with his wife, daughter and sister, in an Israeli strike on their apartment, medical officials said Wednesday.",
    "link": "https://www.cbc.ca/news/world/hospital-director-north-gaza-israeli-strike-1.7575148",
    "timestamp": "2025-07-02T16:41:13Z"
  },
  {
    "title": "The “Big, Beautiful Bill” Is Not What America Asked For",
    "description": "Republicans did not have a mandate for this.",
    "link": "https://slate.com/news-and-politics/2025/07/big-beautiful-bill-donald-trump-republican-budget-medicaid-ice-tax-cuts.html",
    "timestamp": "2025-07-02T16:41:06Z"
  },
  {
    "title": "Bitcoin Rebounds Toward $110K, Presaging What Could Be a Volatile July",
    "description": "BTC's price could be driven by upcoming Trump policies, including the budget bill, tariff deadline and update on the crypto strategic reserve, a K33 analyst said.",
    "link": "https://www.coindesk.com/markets/2025/07/02/bitcoin-rebounds-toward-110k-presaging-what-could-be-a-volatile-july",
    "timestamp": "2025-07-02T16:40:12Z"
  }
]