[
  {
    "title": "Milei now wants Argentina to quit the Paris Agreement",
    "description": "After pulling his country from the World Health Organization (WHO), Argentine President Javier Milei admitted Wednesday in an interview with a French outlet that he intended to withdraw from the 2015 Paris Agreement to limit greenhouse gas emmissions to prese…",
    "link": "https://freerepublic.com/focus/f-chat/4296213/posts",
    "timestamp": "2025-02-09T14:37:54Z"
  },
  {
    "title": "Trump dumps woke intern program after Biden officials hid signs of DEI",
    "description": "'Undergraduate and graduate students from backgrounds underrepresented in federal government are encouraged to apply'",
    "link": "https://www.wnd.com/2025/02/trump-dumps-woke-intern-program-after-biden-officials-hid-signs-of-dei/",
    "timestamp": "2025-02-09T14:36:00Z"
  },
  {
    "title": "Efforts to put CO2 underground face less support in Trump’s second term, GOP control of Congress",
    "description": "CHEYENNE, Wyo. (AP) — Putting carbon dioxide from power plants and industrial facilities underground where it won’t contribute to global warming could see less federal support and enthusiasm under President Donald Trump. But experts and industry advocates dou…",
    "link": "https://financialpost.com/pmn/efforts-to-put-co2-underground-face-less-support-in-trumps-second-term-gop-control-of-congress",
    "timestamp": "2025-02-09T14:32:25Z"
  },
  {
    "title": "Trump to Launch Investigation Into California’s “$130 Billion” High-Speed Rail Disaster Project",
    "description": "President Trump has announced a sweeping investigation into California's high-speed rail project, criticizing its mismanagement and staggering costs. This bold move raises questions about the future of one of the nation's most controversial infrastructure eff…",
    "link": "https://www.thegatewaypundit.com/2025/02/trump-launch-investigation-californias-130-billion-high-speed/",
    "timestamp": "2025-02-09T14:30:29Z"
  },
  {
    "title": "Democratic Sen. Chris Murphy warns of 'assault on the Constitution'",
    "description": "In an interview on ABC News' \"This Week\" on Sunday, Connecticut Sen. Chris Murphy warned of an \"assault on the Constitution\" under President Donald Trump.",
    "link": "https://abcnews.go.com/Politics/democratic-sen-chris-murphy-warns-assault-constitution/story?id=118605827",
    "timestamp": "2025-02-09T14:28:26Z"
  },
  {
    "title": "Elon Musk reveals what are his plans for buying TikTok",
    "description": "Apple and Google are yet to restore TikTok to their app stores after implementing the US law.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-reveals-what-are-his-plans-for-buying-tiktok/articleshow/118092205.cms",
    "timestamp": "2025-02-09T14:26:57Z"
  },
  {
    "title": "The Observer view: Vengeful and reckless, Donald Trump must not go unchallenged (The Guardian)",
    "description": "The Guardian:\nThe Observer view: Vengeful and reckless, Donald Trump must not go unchallenged  —  The 47th president of the United States is a danger to his country, Britain and the world.  Who would have thought that sentence would ever be written?  And yet,…",
    "link": "https://www.memeorandum.com/250209/p16",
    "timestamp": "2025-02-09T14:25:01Z"
  },
  {
    "title": "Trump Doubles CBS 60 Minutes ‘Kamala Harris Interview’ Lawsuit from $10 Billion to $20 Billion",
    "description": "Donald Trump was suing the network for $10 billion, stating that 60 Minutes edited the video to make Harris look and sound better. Upon having time to review the raw footage, Trump amended his lawsuit to $20 billion, thus doubling the original amount.",
    "link": "https://freerepublic.com/focus/f-chat/4296207/posts",
    "timestamp": "2025-02-09T14:24:04Z"
  },
  {
    "title": "Trump Hits the Links With Tiger Woods Ahead of Trip to Super Bowl",
    "description": "President Donald Trump is beginning a very sports-centric Sunday by hitting the links with golf legend Tiger Woods in Florida.\nThe post Trump Hits the Links With Tiger Woods Ahead of Trip to Super Bowl first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-hits-the-links-with-tiger-woods-ahead-of-trip-to-super-bowl/",
    "timestamp": "2025-02-09T14:21:39Z"
  },
  {
    "title": "Security Affairs newsletter Round 510 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. PlayStation Ne…",
    "link": "https://securityaffairs.com/174019/breaking-news/security-affairs-newsletter-round-510-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-02-09T14:20:54Z"
  },
  {
    "title": "Steve Soboroff Agrees to Work for Free, After $500,000 Salary Exposed",
    "description": "Los Angeles “Chief Recovery Officer” Steve Soboroff said Saturday night that he would work for free, after coming under fire for earning $500,000 for three months of work, even though his salary was to have been paid privately. Earlier in the day, as Breitbar…",
    "link": "https://freerepublic.com/focus/f-news/4296206/posts",
    "timestamp": "2025-02-09T14:19:19Z"
  },
  {
    "title": "Trump’s pause on tariffs, Buy Canadian sentiment and the latest job numbers: Must-read business and investing stories",
    "description": "Trump hits pause on trade war – for now\nThis week, U.S. President Donald Trump agreed to a 30-day pause on tariffs against Canada after the federal government promised to invest $200-million more in fighting organized crime and drugs. Canada also pledged to a…",
    "link": "https://biztoc.com/x/74f8dd76059339b3",
    "timestamp": "2025-02-09T14:18:14Z"
  },
  {
    "title": "Donald Trump Demands Answers Over Assassination Attempts",
    "description": "\"I'm entitled to know. And they held it back long enough, the president said, \"no excuses.\"",
    "link": "https://biztoc.com/x/13f43bcaddd14bab",
    "timestamp": "2025-02-09T14:18:00Z"
  },
  {
    "title": "Elon Musk dodges DOGE scrutiny while expanding his power in Washington",
    "description": "Elon Musk, appointed by Donald Trump to make the government more efficient, has embedded himself deeply into federal agencies with little transparency. His Department of Government Efficiency (DOGE) has sidelined career officials while avoiding public scrutin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-dodges-doge-scrutiny-while-expanding-his-power-in-washington/articleshow/118092058.cms",
    "timestamp": "2025-02-09T14:13:46Z"
  },
  {
    "title": "Donald Trump Demands Answers Over Assassination Attempts",
    "description": "\"I'm entitled to know. And they held it back long enough, the president said, \"no excuses.\"",
    "link": "https://www.newsweek.com/donald-trump-assassination-attempt-secret-service-answers-investigation-2028409",
    "timestamp": "2025-02-09T14:13:41Z"
  },
  {
    "title": "Security expert gives insight on what Super Bowl protection, experience may be like with Trump's attendance",
    "description": "President Donald Trump's expected appearance at Super Bowl LIX will make it trickier for fans to get into the game, says Hyperion founder Adam Gonzales.",
    "link": "https://www.foxnews.com/sports/security-expert-gives-insight-what-super-bowl-protection-experience-may-like-trumps-attendance",
    "timestamp": "2025-02-09T14:07:48Z"
  },
  {
    "title": "Market pros tell us why they're not worried about tariff whiplash — and why stocks are poised to keep rallying",
    "description": "Markets were buffeted by tariff fears last week, with more uncertainty looming.\nYet, market sources tell BI they're not worried, and see trade jitters creating opportunity.\n\"If you've got a longer-term view, some of these dips taking place are buying opportun…",
    "link": "https://biztoc.com/x/e531ab4ac1a7104c",
    "timestamp": "2025-02-09T14:07:09Z"
  },
  {
    "title": "Saudi Arabia slams Netanyahu’s suggestion it should host Palestinian state",
    "description": "The kingdom reiterated that 'the Palestinian people have a right to their land' and cannot be 'expelled'.",
    "link": "https://www.aljazeera.com/news/2025/2/9/saudi-arabia-slams-netanyahus-suggestion-it-should-host-palestinian-state",
    "timestamp": "2025-02-09T14:07:08Z"
  },
  {
    "title": "'It's a no-no': Fox News reefer madness segment warns of 'lazy' potheads",
    "description": "Fox News host Rachel Campos-Duffy warned of \"lazy\" potheads during a segment on smoking marijuana.\n\n\nDuring a Sunday Fox & Friends discussion about a Canadian study that linked marijuana use to schizophrenia, Duffy and Fox News medical contributor Dr. Nicole …",
    "link": "https://www.rawstory.com/fox-news-lazy-potheads/",
    "timestamp": "2025-02-09T14:04:11Z"
  },
  {
    "title": "What Time Is The Super Bowl? How To Watch And More.",
    "description": "The Kansas City Chiefs and Philadelphia Eagles will face off in a Super Bowl rematch two years after the Chiefs defeated the Eagles and began a Super Bowl winning streak.",
    "link": "https://www.forbes.com/sites/conormurray/2025/02/09/what-time-is-the-super-bowlhow-to-watch-and-more/",
    "timestamp": "2025-02-09T14:02:37Z"
  },
  {
    "title": "Director Judd Apatow Takes Aim at Trump, Musk: ‘Please Go F**k Yourself’",
    "description": "Filmmaker Judd Apatow added his name to a growing, tear-stained list of inconsolable Hollywood celebrities still appalled President Donald Trump is back in the White House during his opening monologue Saturday night at the 77th annual DGA Awards.\nThe post Dir…",
    "link": "https://www.breitbart.com/entertainment/2025/02/09/director-judd-apatow-takes-aim-at-trump-musk-please-go-fk-yourself/",
    "timestamp": "2025-02-09T14:01:18Z"
  },
  {
    "title": "Trump Meme Coin Mania: Market Overrun By 700+ Clones – Report",
    "description": "When Donald Trump dabbled in memecoins last month, it set off a floodgate of imitators in the cryptocurrency market. With the re-elected US president’s entry into the cryptocurrency market, there has been a dramatic increase in the number of opportunistic tok…",
    "link": "https://bitcoinist.com/trump-meme-coin-mania-market-overrun-by-700-clones-report/",
    "timestamp": "2025-02-09T14:00:47Z"
  },
  {
    "title": "Transgender Athletes Face New Hurdles as NCAA Adopts Stricter Policy, Citing Trump Order",
    "description": "The NCAA ban comes after federal education officials announced an investigation into San José State University for alleged Title IX violations.",
    "link": "https://www.kqed.org/news/12026189/transgender-athletes-face-new-hurdles-as-ncaa-adopts-stricter-policy-citing-trump-order",
    "timestamp": "2025-02-09T14:00:42Z"
  },
  {
    "title": "'Mexico will survive': What Mexicans are telling me about Trump",
    "description": "\"Canadians right now have to look at the possibilities,” my guide tells me. “Invest in Mexico, try to work with Latin American countries.\"",
    "link": "https://nationalpost.com/news/mexico-will-survive-what-mexicans-are-telling-me-about-trump",
    "timestamp": "2025-02-09T14:00:18Z"
  },
  {
    "title": "Trump Makes Himself Chair Of Kennedy Center",
    "description": "The John F. Kennedy Center for the Performing Arts is one the jewels in the United States performing arts scene. It is the official residence of the National Symphony Orchestra and the Washington National Opera. A madman will now take it over.\nSource: Wall St…",
    "link": "https://crooksandliars.com/2025/02/trump-makes-himself-chair-kennedy-center",
    "timestamp": "2025-02-09T14:00:01Z"
  },
  {
    "title": "Palestinians in the West Bank Describe How Israeli Settlers Are Seizing Land",
    "description": "Farming outposts are mushrooming across the West Bank, enabling Israeli settlers to displace Palestinians and grab large swaths of land.",
    "link": "http://www.rollingstone.com/politics/politics-features/west-bank-israel-palestinians-pastoral-settlement-herding-1235260258/",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "Three Months After Missouri Voted to Make Abortion Legal, Access Is Still Being Blocked",
    "description": "Reproductive rights are now enshrined in the state Constitution, but Missouri’s main abortion provider is fighting legal hurdles to resume offering the procedure. Meanwhile, antiabortion lawmakers strategize to prevent a return of abortion services.\nThe post …",
    "link": "https://msmagazine.com/2025/02/09/missouri-abortion-republicans/",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "Heather Cox Richardson: Does the Constitution Matter Anymore?",
    "description": "Heather Cox Richardson is a historian with deep knowledge of the nation’s institutions and its Constitution. It is not surprising that she is appalled by Trump’s calculated and mean-spirited assault on the agencies and departments of the federal government, i…",
    "link": "https://dianeravitch.net/2025/02/09/heather-cox-richardson-does-the-constitution-matter/",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "The Media Spawned McCarthyism. Now History Is Repeating Itself",
    "description": "Some of today's most influential figures in politics won power the way McCarthy did: willingness to say things that capture attention.",
    "link": "https://time.com/7213586/media-mccarthyism/",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "This Week, I Made One Small Step in Figuring Out How to Follow Trump News",
    "description": "Yes, Trump will probably hate the cover.",
    "link": "https://slate.com/news-and-politics/2025/02/trump-elon-musk-time-magazine-cover.html",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "Trump Goes All-In On Stealing Gaza For His Zionist Owners",
    "description": "Asked how many people he was talking about removing, Trump replied, “All of them.” Listen to a reading of this article (reading by Tim Foley): Grinning like the cat that ate the canary, Hague fugitive Benjamin Netanyahu sat beside Donald Trump as the US presi…",
    "link": "https://www.activistpost.com/trump-goes-all-in-on-stealing-gaza-for-his-zionist-owners/",
    "timestamp": "2025-02-09T14:00:00Z"
  },
  {
    "title": "Trump Will Reportedly Strip Security Clearances, Deny Access To Federal Buildings To Slew Of Former, Current Officials",
    "description": "President Donald Trump has ordered that some former and current federal officials lose their security clearance, according to the New York Post",
    "link": "https://dailycaller.com/2025/02/09/president-donald-trump-security-cleace-antony-blinken-alvin-bragg-letitia-james-jake-sullivan/",
    "timestamp": "2025-02-09T13:57:38Z"
  },
  {
    "title": "Donald Trump Set To Make 2025 Daytona 500 Appearance - Report",
    "description": "President Donald Trump is expected to attend the 2025 Daytona 500 next weekend.",
    "link": "https://www.newsweek.com/sports/racing/donald-trump-set-make-2025-daytona-500-appearance-report-2028412",
    "timestamp": "2025-02-09T13:57:26Z"
  },
  {
    "title": "Elon Musk dodges DOGE scrutiny while expanding his power in Washington",
    "description": "Elon Musk made a clear promise after Donald Trump decided to put him in charge of making the government more efficient.\n“It’s not going to be some sort of backroom secret thing,” Musk said last year. “It will be as transparent as possible,\" maybe even streame…",
    "link": "https://biztoc.com/x/5787907c72b83f1e",
    "timestamp": "2025-02-09T13:55:58Z"
  },
  {
    "title": "'No thanks', white South Africans turn down Trump's immigration offer",
    "description": "JOHANNESBURG (Reuters) - U.S. President Donald Trump's offer to rehouse white South Africans as refugees fleeing persecution may not spur quite the rush he anticipates, as even right-wing white lobby groups want to \"tackle the injustices\" of Black majority ru…",
    "link": "https://www.thestar.com.my/news/world/2025/02/09/039no-thanks039-white-south-africans-turn-down-trump039s-immigration-offer",
    "timestamp": "2025-02-09T13:55:00Z"
  },
  {
    "title": "China's tit-for-tat tariffs on US set to take effect",
    "description": "Beijing's move comes after President Donald Trump imposed a 10% levy on goods imported from China.",
    "link": "https://www.bbc.com/news/articles/cvg8zg7ll09o",
    "timestamp": "2025-02-09T13:54:36Z"
  },
  {
    "title": "Donald Trump to make history attending Super Bowl LIX; Which team does the POTUS root for?",
    "description": "President Donald Trump will be the first sitting US President to attend the Super Bowl, cheering on the Kansas City Chiefs on February 9, 2025. Despite not showing much interest in American Football, Trump has praised Chiefs quarterback Patrick Mahomes and th…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trump-to-make-history-attending-super-bowl-lix-which-team-does-the-potus-root-for/articleshow/118091721.cms",
    "timestamp": "2025-02-09T13:54:09Z"
  },
  {
    "title": "Elon Musk dodges DOGE scrutiny while expanding his power in Washington",
    "description": "Elon Musk has promised transparency as President Donald Trump's leader in making the federal government more efficient. But it hasn't worked out that way so far. Musk is used to doing things his own way as the world's richest person, and he's been avoiding pu…",
    "link": "https://www.seattlepi.com/news/politics/article/elon-musk-dodges-doge-scrutiny-while-expanding-20157026.php",
    "timestamp": "2025-02-09T13:48:32Z"
  },
  {
    "title": "Pardoned January 6 rioter on run from solicitation of minor charge arrested - NewsBreak",
    "description": "Pardoned January 6 rioter on run from solicitation of minor charge arrested - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3795631571714-pardoned-january-6-rioter-on-run-from-solicitation-of-minor-charge-arrested?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1739108817&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-control&amp;s=i2",
    "timestamp": "2025-02-09T13:47:30Z"
  },
  {
    "title": "“I’m Entitled to Know” — President Trump Orders Secret Service to Provide “Every Bit” of Information on His Two Would-Be Assassins",
    "description": "President Trump's directive for the Secret Service to disclose all information about assassination attempts against him sheds light on a pivotal moment in his administration, promising insights into the ongoing security challenges he faces.\nThe post “I’m Enti…",
    "link": "https://www.thegatewaypundit.com/2025/02/im-entitled-know-president-trump-orders-secret-service/",
    "timestamp": "2025-02-09T13:45:48Z"
  },
  {
    "title": "JOSH HAMMER: There May Be More To Trump’s Gaza Plan Than Meets The Eye",
    "description": "He's done this before. Let's be patient and watch the shibboleth-buster in action. He may very well surprise us yet again.",
    "link": "https://dailycaller.com/2025/02/09/opinion-there-may-be-more-to-trumps-gaza-plan-than-meets-eye-josh-hammer/",
    "timestamp": "2025-02-09T13:44:25Z"
  },
  {
    "title": "Donald Trump-Vladimir Putin phone call cancelled? Russia reveals details",
    "description": "Vladimir Putin-Donald Trump phone call or meeting is keenly awaited. However, anything is yet to be materialized.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-vladimir-putin-phone-call-cancelled-russia-reveals-details/articleshow/118091472.cms",
    "timestamp": "2025-02-09T13:44:15Z"
  },
  {
    "title": "Netanyahu Backs Trump’s Gaza Plan, Says Residents Could Return if They ‘Disavow Terrorism’",
    "description": "Netanyahu: \"You want to come back? You have to disavow terrorism.\"\nThe post Netanyahu Backs Trump’s Gaza Plan, Says Residents Could Return if They ‘Disavow Terrorism’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/netanyahu-backs-trumps-gaza-plan-says-residents-could-return-if-they-disavow-terrorism/",
    "timestamp": "2025-02-09T13:41:04Z"
  },
  {
    "title": "Musk Denies Potential TikTok Bid",
    "description": "The X owner denied the rumors he could buy TikTok and claims he's not familiar with the platform and doesn't “have any plans\" on what he would do with it.\nAfter being touted as a potential buyer earlier this year, Tesla CEO Elon Musk has denied interest in ac…",
    "link": "https://uk.pcmag.com/social-media/156627/musk-denies-potential-tiktok-bid",
    "timestamp": "2025-02-09T13:40:17Z"
  },
  {
    "title": "Musk Denies Potential TikTok Bid",
    "description": "The X owner denied the rumors he could buy TikTok and claims he's not familiar with the platform and doesn't “have any plans\" on what he would do with it.\nAfter being touted as a potential buyer earlier this year, Tesla CEO Elon Musk has denied interest in ac…",
    "link": "https://me.pcmag.com/en/social-media-1/28326/musk-denies-potential-tiktok-bid",
    "timestamp": "2025-02-09T13:40:17Z"
  },
  {
    "title": "Big Tech is powering Trump’s immigration crackdown",
    "description": "And the only way to resist it is grassroots mobilisation against the all-powerful broligarchy.",
    "link": "https://www.aljazeera.com/opinions/2025/2/9/big-tech-is-powering-trumps-immigration-crackdown",
    "timestamp": "2025-02-09T13:33:43Z"
  },
  {
    "title": "Steve Soboroff Agrees to Work for Free, After $500,000 Salary Exposed",
    "description": "Los Angeles \"Chief Recovery Officer\" Steve Soboroff said Saturday night that he would work for free, after coming under fire for earning $500,000 for three months of work, even though his salary was to have been paid privately.\nThe post Steve Soboroff Agrees …",
    "link": "https://www.breitbart.com/politics/2025/02/09/steve-soboroff-agrees-work-for-free-after-500000-salary-exposed/",
    "timestamp": "2025-02-09T13:31:24Z"
  },
  {
    "title": "More Profiles of Courage, Patriotism and Resistance in standing up to Trump (Dean Obeidallah/The Dean's Report)",
    "description": "Dean Obeidallah / The Dean's Report:\nMore Profiles of Courage, Patriotism and Resistance in standing up to Trump  —  These are inspiring moments for us!  —  If you just watched corporate news—and I sincerely hope you watch more than that—you would think Donal…",
    "link": "https://www.memeorandum.com/250209/p12",
    "timestamp": "2025-02-09T13:30:01Z"
  },
  {
    "title": "Texmaco targets more export of rail components to the US",
    "description": "Texmaco Rail & Engineering aims to boost exports to US and Europe amid changing geopolitical conditions.",
    "link": "https://www.thehindubusinessline.com/economy/logistics/texmaco-targets-more-export-of-rail-components-to-the-us/article69199534.ece",
    "timestamp": "2025-02-09T13:29:48Z"
  },
  {
    "title": "Expert: How I know Trump is about to open the floodgates when it comes to UFOs (Steven Greer)",
    "description": "Donald Trump could be poised to pull back the curtain on UFOs, according to an expert. Dr Steven Greer, one of the driving forces behind the UFO disclosure movement, claims the new administration is considering executive orders that would publicize the govern…",
    "link": "https://freerepublic.com/focus/f-chat/4296196/posts",
    "timestamp": "2025-02-09T13:27:51Z"
  },
  {
    "title": "How Elon Musk's access to the Treasury system could affect your Social Security benefits?",
    "description": "The United States of America appears to be being governed in a way that has never happened before. \nWhilst President Donald Trump is the man in power, there is a huge amount of mys",
    "link": "https://www.marca.com/en/lifestyle/us-news/personal-finance/2025/02/09/67a89016e2704e8d148b4571.html",
    "timestamp": "2025-02-09T13:27:09Z"
  },
  {
    "title": "Gavin Newsom approves $50 million ‘Trump proof’ funds after begging him for federal help just days before",
    "description": "'None of the funding in this bill is intended to be used for immigration-related legal services for noncitizens convicted of serious violent felonies'",
    "link": "https://www.wnd.com/2025/02/gavin-newsom-approves-50-million-trump-proof-funds-after-begging-him-for-federal-help-just-days-before/",
    "timestamp": "2025-02-09T13:24:55Z"
  },
  {
    "title": "Why Trump blinked before imposing his ‘beautiful’ tariffs on Canada and Mexico",
    "description": "Trump has teased two of the US’s biggest trading partners with levies but has moved the goalpost at least three times in two weeks\nDonald Trump was in his element in the Oval Office this week. Surrounded by cameras, flanked by billionaire allies and confronte…",
    "link": "https://biztoc.com/x/43f30d1572c6566d",
    "timestamp": "2025-02-09T13:22:46Z"
  },
  {
    "title": "Trump faces pushback as he works to reshape federal government",
    "description": "Meet the Press moderator Kristen Welker joins Joe Fryer on Sunday TODAY to discuss the two dozen lawsuits against President Donald Trump that are aimed at slowing down his attempts to reshape the federal government, cut jobs, freeze domestic and foreign spend…",
    "link": "https://www.today.com/video/trump-faces-pushback-as-he-works-to-reshape-federal-government-231498309714",
    "timestamp": "2025-02-09T13:20:22Z"
  },
  {
    "title": "How Republican skeptics in the Senate got to 'yes' on RFK Jr. and Gabbard",
    "description": "Republican skepticism in the Senate of President Donald Trump’s Cabinet nominees has been worn down",
    "link": "https://abcnews.go.com/US/wireStory/republican-skeptics-senate-rfk-jr-gabbard-118619157",
    "timestamp": "2025-02-09T13:18:22Z"
  },
  {
    "title": "Trump says he’s spoken with Putin about Ukraine war",
    "description": "President Donald Trump is set to become the first sitting president to ever attend the Super Bowl, making security even tighter than usual at the big game. Meanwhile, the President says he has spoken with Russia’s President Vladimir Putin as the three-year an…",
    "link": "https://www.today.com/video/trump-set-to-become-first-sitting-president-to-attend-super-bowl-231495749747",
    "timestamp": "2025-02-09T13:16:52Z"
  },
  {
    "title": "Designating Cartels As Terrorists Will Have Huge Consequences, Say Analysts",
    "description": "Designating Cartels As Terrorists Will Have Huge Consequences, Say Analysts\n \nAuthored by Chris Summers via The Epoch Times,\nOn Jan. 20, President Donald Trump signed an executive order that started a process by which international organized crime cartels wou…",
    "link": "https://biztoc.com/x/4555701cf8c8c8bb",
    "timestamp": "2025-02-09T13:11:49Z"
  },
  {
    "title": "Trump is bringing back the least useful Obama-era ritual",
    "description": "President Donald Trump’s chat with Fox News’ Bret Baier, airing before the Super Bowl kickoff time will give us little valuable information.",
    "link": "https://biztoc.com/x/524586f92a1ad58e",
    "timestamp": "2025-02-09T13:11:39Z"
  },
  {
    "title": "As Trump steamrolls Washington, courts flex their power to slow him down (Kyle Cheney/Politico)",
    "description": "Kyle Cheney / Politico:\nAs Trump steamrolls Washington, courts flex their power to slow him down  —  Numerous federal district judges around the country have blocked major portions of Trump's early agenda — but Supreme Court showdowns loom.  —  President Dona…",
    "link": "https://www.memeorandum.com/250209/p10",
    "timestamp": "2025-02-09T13:10:02Z"
  },
  {
    "title": "DEI needs to fix systems, not people",
    "description": "Experts argue that bias is systemic, and solutions should focus on changing policies and structures, not just individual behaviour.",
    "link": "https://theconversation.com/dei-needs-to-fix-systems-not-people-247877",
    "timestamp": "2025-02-09T13:09:06Z"
  },
  {
    "title": "Why Canada must seize the moment and launch its long-awaited Africa strategy",
    "description": "Africa’s rise is unfolding now. Canada has the tools, the values and the economic imperative to form strong partnerships on the continent in the face of Donald Trump’s threats.",
    "link": "https://theconversation.com/why-canada-must-seize-the-moment-and-launch-its-long-awaited-africa-strategy-249255",
    "timestamp": "2025-02-09T13:08:28Z"
  },
  {
    "title": "Bolstering Canada’s right to repair could shield it against U.S. tariffs and trade uncertainty",
    "description": "The right to repair can increase the amount of well-paying Canadian jobs and reduce Canada’s dependence on unpredictable global markets.",
    "link": "https://theconversation.com/bolstering-canadas-right-to-repair-could-shield-it-against-u-s-tariffs-and-trade-uncertainty-248970",
    "timestamp": "2025-02-09T13:08:07Z"
  },
  {
    "title": "How China Dominated Nuclear Energy",
    "description": "China is on a clear course to become the world’s first “electrostate\" — and is likely to eclipse the U.S. in atomic power in the next decade.",
    "link": "https://www.huffpost.com/entry/china-nuclear-power_n_67a29a03e4b0b9a29af3dd3b",
    "timestamp": "2025-02-09T13:02:13Z"
  },
  {
    "title": "What will Trump’s “Unleashing American Energy” mean for Colorado, nation?",
    "description": "The \"drill, baby, drill\" mantra could become reality if President Donald Trump's executive orders succeed in ramping up oil and gas production in Colorado and nationwide.",
    "link": "https://www.denverpost.com/2025/02/09/trump-drill-baby-oil-gas-fossil-fuels-energy-public-lands-colorado/",
    "timestamp": "2025-02-09T13:00:54Z"
  },
  {
    "title": "A presidential first: Trump at the Super Bowl, latest chapter in a complicated legacy with football",
    "description": "By DARLENE SUPERVILLE WEST PALM BEACH, Fla. (AP) — As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a kn…",
    "link": "https://www.denverpost.com/2025/02/09/a-presidential-first-trump-at-the-super-bowl-latest-chapter-in-a-complicated-legacy-with-football/",
    "timestamp": "2025-02-09T13:00:43Z"
  },
  {
    "title": "A presidential first: Trump at the Super Bowl, latest chapter in a complicated legacy with football",
    "description": "As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a knee during the national anthem as part of a social j…",
    "link": "https://www.denverpost.com/2025/02/09/super-bowl-2025-trump-football-end-racism/",
    "timestamp": "2025-02-09T13:00:43Z"
  },
  {
    "title": "USAID Helped Dems Steal 2020 Election by Funding Wuhan Lab That Created COVID, the Ultimate Excuse for Illegal Election Tampering",
    "description": "Amid increasing scrutiny, this analysis uncovers how USAID's funding may have inadvertently influenced the 2020 election landscape, intertwining pandemic response with political maneuvering in a compelling narrative of accountability and consequence.\nThe post…",
    "link": "https://www.thegatewaypundit.com/2025/02/usaid-helped-dems-steal-2020-election-funding-wuhan/",
    "timestamp": "2025-02-09T13:00:33Z"
  },
  {
    "title": "Despite Trump’s anti-public lands stance, Colorado advocates still hope to protect Dolores River canyonlands",
    "description": "Colorado largely supports federal lands as neighboring Utah and Wyoming seek to claw back control.",
    "link": "https://www.denverpost.com/2025/02/09/donald-trump-public-lands-colorado-dolores-river-monument/",
    "timestamp": "2025-02-09T13:00:20Z"
  },
  {
    "title": "Trump Wants to Reduce the Trade Deficit. Here's Why That Matters",
    "description": "President Donald Trump has long sought to tackle the country's overall trade deficit.\n- The combined goods and services trade deficit hit $918.4 billion in 2024, a big increase from 2023.\n- There hasn't been a trade surplus in the United States since 1975.\nTh…",
    "link": "https://biztoc.com/x/995835fb26063538",
    "timestamp": "2025-02-09T13:00:10Z"
  },
  {
    "title": "Air traffic controllers in peril nationwide: 'Work force missing'...",
    "description": "Elon Musk and his band of DOGE techies have been asked to upgrade the nation's aviation system in the wake of the midair crash near Washington, D.C.",
    "link": "https://www.sfgate.com/travel/article/musk-doge-tapped-overhaul-air-traffic-control-20149118.php",
    "timestamp": "2025-02-09T13:00:05Z"
  },
  {
    "title": "The real estate of empire: How colonial gentrification fuels Trump's Gaza plan",
    "description": "By Peter Bloom/Common DreamsU.S. President Donald Trump's latest proposal concerning the future of Gaza has sent shockwaves throughout the international community. The plan, which envisions the mass displacement of Palestinians to make way for large-scale rea…",
    "link": "https://www.rawstory.com/the-real-estate-of-empire-how-colonial-gentrification-fuels-trump-s-gaza-plan/",
    "timestamp": "2025-02-09T13:00:03Z"
  },
  {
    "title": "Market pros tell us why they're not worried about tariff whiplash — and why stocks are poised to keep rallying",
    "description": "The economy could be too strong for Trump's tariffs to derail the outlook for stocks, investors and economists told BI.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-trump-tariffs-inflation-sp500-buying-opportunity-dip-2025-2",
    "timestamp": "2025-02-09T13:00:01Z"
  },
  {
    "title": "‘A Very Christian Concept’",
    "description": "The faith’s mandate is more arduous than J. D. Vance’s account seems to allow.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/catholic-charities-trump/681610/",
    "timestamp": "2025-02-09T13:00:00Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 9 February 2025",
    "description": "The Talk Shows February 9th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Sen. Bill Hagerty (R-Tenn.); Rep. Ilhan Omar (D-Somalia.) … Rep. Michael McCaul (R-Texas) … Samantha Vinograd, DHS…",
    "link": "https://freerepublic.com/focus/f-news/4296189/posts",
    "timestamp": "2025-02-09T12:56:44Z"
  },
  {
    "title": "Parents of American murdered by Hamas make 'plea' to Trump after latest hostage release",
    "description": "The parents of murdered Israeli-American hostage Hersh Goldberg-Polin pleaded with President Donald Trump to get the remaining 76 hostages home.",
    "link": "https://www.foxnews.com/world/parents-american-murdered-hamas-make-plea-trump-latest-hostage-release",
    "timestamp": "2025-02-09T12:56:28Z"
  },
  {
    "title": "US and China teeter on edge of trade war as tariff deadline looms",
    "description": "Donald Trump’s shock tactics may have pushed Beijing away from negotiating table, experts say",
    "link": "https://www.irishtimes.com/business/economy/2025/02/09/us-and-china-teeter-on-edge-of-trade-war-as-tariff-deadline-looms/",
    "timestamp": "2025-02-09T12:51:52Z"
  },
  {
    "title": "Ukraine's rare earths are key to its bargaining power",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too.",
    "link": "https://www.dw.com/en/ukraines-rare-earths-are-key-to-its-bargaining-power/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Ukraine's rare earths are key to its bargaining power",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too. US President Donald Trump has placed new con…",
    "link": "https://www.dw.com/en/ukraines-rare-earths-are-key-to-its-bargaining-power/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Ukraine's rare minerals the US, EU and Russia want access to",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too. US President Donald Trump has placed new con…",
    "link": "https://www.dw.com/en/ukraine-russia-war-mineral-wealth-us-eu-v2/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "This is post 29,998! Welcome to the Sabbath for goyische cats: it’s Sunday, February 9, 2025, and National Pizza Day.  Chicago the Mecca of American Pizzas, and the only pizza I deliberately seek out is the famous stuffed pizza, which cannot be duplicated in …",
    "link": "https://whyevolutionistrue.com/2025/02/09/sunday-hili-dialogue-520/",
    "timestamp": "2025-02-09T12:45:22Z"
  },
  {
    "title": "Israel withdraws from key road cutting through Gaza as pregnant woman shot dead in West Bank",
    "description": "Egypt will host a summit of Arab nations on 27 February to discuss “the latest serious developments” concerning the Palestinian territories.",
    "link": "https://www.thejournal.ie/israeli-forces-withdraw-from-key-road-cutting-through-gaza-ahead-of-phase-two-of-ceasefire-deal-6618001-Feb2025/",
    "timestamp": "2025-02-09T12:43:53Z"
  },
  {
    "title": "Chiefs vs. Bills: Super Bowl 2025 preview, prediction, what to watch for",
    "description": "An inside look at the Chiefs-Eagles Super Bowl 2025 battle in New Orleans on Sunday night:",
    "link": "https://nypost.com/2025/02/09/sports/chiefs-vs-eagles-super-bowl-2025-preview-prediction-what-to-watch-for/",
    "timestamp": "2025-02-09T12:38:30Z"
  },
  {
    "title": "From Dogecoin to $Trump: everything you need know about the wild world of meme coins",
    "description": "Are they the same as crypto, why has the US president launched one, and who’s really coining it in? Here’s a complete guide to the latest digital money mania\nThree days before his inauguration as US president, Donald Trump made an unusual move. He launched $T…",
    "link": "https://biztoc.com/x/f68241f2ca5e49ac",
    "timestamp": "2025-02-09T12:38:10Z"
  },
  {
    "title": "Some US health clinics grapple with federal funding squeeze",
    "description": "A Reuters analysis found that tens of billions of dollars in congressionally approved spending for programs across industries, such as clean energy, remain frozen under various Trump administration orders",
    "link": "https://www.rappler.com/world/some-us-health-clinics-grapple-federal-funding-squeeze-february-9-2025/",
    "timestamp": "2025-02-09T12:37:54Z"
  },
  {
    "title": "Ben Stiller Denies Taking USAID Money: 'Lies Coming from Russian Media'",
    "description": "A report claimed that actor Ben Stiller and other celebrities received millions of taxpayer dollars to visit Ukraine.",
    "link": "https://www.westernjournal.com/ben-stiller-denies-taking-usaid-money-lies-coming-russian-media/",
    "timestamp": "2025-02-09T12:37:35Z"
  },
  {
    "title": "Digitising house-buying process eyed as way to speed up transactions",
    "description": "Digitising more of the house-buying process is being explored by the government as a way to speed up transactions.",
    "link": "https://news.sky.com/story/digitising-house-buying-process-eyed-as-way-to-speed-up-transactions-13306006",
    "timestamp": "2025-02-09T12:35:00Z"
  },
  {
    "title": "Prince Harry's criticism of 'weak moral character' felt like a jibe at Trump",
    "description": "Prince Harry's memoir dropped so many bombshells, his admission of drug-taking certainly was not the most jaw-dropping revelation.",
    "link": "https://news.sky.com/story/prince-harrys-criticism-of-weak-moral-character-at-invictus-games-felt-like-a-jibe-at-donald-trump-13305960",
    "timestamp": "2025-02-09T12:34:00Z"
  },
  {
    "title": "New Evidence Could Be About To Blow Up The Mystery Of Bitcoin’s Satoshi Nakamoto",
    "description": "A Coinbase executive has claimed Satoshi Nakamoto’s identity may be known by the rival crypto exchange Kraken...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/02/09/new-evidence-could-be-about-to-blow-up-the-mystery-of-bitcoins-satoshi-nakamoto/",
    "timestamp": "2025-02-09T12:31:27Z"
  },
  {
    "title": "China to roll back clean power subsidies after boom",
    "description": "BEIJING: China's top economic planning agency said on Sunday (Feb 9) it was taking steps to scale back subsidies for renewable energy projects after a boom in solar and wind power installations. China broke its own records for new solar installations in 2024 …",
    "link": "https://www.channelnewsasia.com/business/china-scale-back-subsidies-renewable-energy-projects-4926786",
    "timestamp": "2025-02-09T12:27:27Z"
  },
  {
    "title": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY [Facepalm]",
    "description": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY",
    "link": "https://www.fark.com/comments/13555650/Dear-Diary-Today-I-was-let-out-of-prison-after-three-years-charges-of-seditious-conspiracy-acts-Now-Im-thinking-about-entering-politics-PS-Donald-Trump-is-so-DREAMY",
    "timestamp": "2025-02-09T12:20:43Z"
  },
  {
    "title": "As the Trump upheaval continues, are there restraints that could slow him down? (Dan Balz/Washington Post)",
    "description": "Dan Balz / Washington Post:\nAs the Trump upheaval continues, are there restraints that could slow him down?  —  Questions remain on what constitutional or other checks can be put on the president and his wide-ranging actions.  —  Rare is the president who doe…",
    "link": "https://www.memeorandum.com/250209/p4",
    "timestamp": "2025-02-09T12:20:00Z"
  },
  {
    "title": "Some US health clinics grapple with federal funding squeeze",
    "description": "President Donald Trump's executive orders have begun to disrupt patient care in the United States, as some providers cannot access essential federal funding, according to interviews with a dozen healthcare providers and policy advocates. Facilities in Virgini…",
    "link": "https://www.channelnewsasia.com/world/us-health-clinics-federal-funding-trump-4926896",
    "timestamp": "2025-02-09T12:19:18Z"
  },
  {
    "title": "Lutnick Says EU ESG Regulations Will Harm U.S. Energy Producers",
    "description": "Commerce Secretary Howard Lutnick promises to use all the tools at his disposal to address concerns about new ESG regulations imposed by the EU on U.S. businesses.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/02/09/lutnick-says-eu-esg-regulations-will-harm-us-energy-producers/",
    "timestamp": "2025-02-09T12:19:06Z"
  }
]