[
  {
    "title": "Exploring claim Trump wants to replace PBS with PragerU",
    "description": "The claim spread following Trump's decision to end all federal support for the Corporation for Public Broadcasting, which funds PBS and NPR.",
    "link": "https://www.snopes.com//news/2025/08/15/trump-prageru-pbs-replacement/",
    "timestamp": "2025-08-15T23:13:00Z"
  },
  {
    "title": "Donald Trump Leaves Vladimir Putin Summit Without a Deal in Hand",
    "description": "Trump says \"some great progress\" was made with Putin, and he will speak with European leaders and Ukraine's Volodymyr Zelensky soon.",
    "link": "https://www.newsweek.com/trump-putin-alaska-press-conference-russia-ukraine-war-2114358",
    "timestamp": "2025-08-15T23:12:44Z"
  },
  {
    "title": "Trump, Putin reach an 'understanding' on Ukraine",
    "description": "President Trump and Vladimir Putin met in Alaska to discuss ending the war in Ukraine, raising concerns among Ukrainian and European leaders. Despite a warm reception, including a ride in \"The Beast,\" the summit excluded Zelenskyy and focused on potential dea…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-putin-reach-an-understanding-on-ukraine/articleshow/123327250.cms",
    "timestamp": "2025-08-15T23:10:25Z"
  },
  {
    "title": "Putin & Associate Press Conference Updates",
    "description": "Energy: Desperate-to-be-popular kid finally persuades slightly more popular kid to come over to his house [image or embed] — Radley Balko (@radleybalko.bsky.social) August 15, 2025 at 6:28 PM === Putin is a cowardly little man in Alaska Journalist: \"Mr. Putin…",
    "link": "https://balloon-juice.com/2025/08/15/putin-associate-press-conference-updates/",
    "timestamp": "2025-08-15T23:09:06Z"
  },
  {
    "title": "11 New Artifacts Trump Ordered The Smithsonian To Display",
    "description": "In addition to ordering a comprehensive review of the Smithsonian museums to root out \"wokeness,\" President Donald Trump has reportedly provided the institutions with a list of new items to display instead. The Babylon Bee has obtained an exclusive copy of th…",
    "link": "https://freerepublic.com/focus/f-chat/4334847/posts",
    "timestamp": "2025-08-15T23:08:31Z"
  },
  {
    "title": "Putin: We could come to an end of the conflict",
    "description": "Russian President Vladimir Putin said Friday that the war in Ukraine could be brought to an end, speaking at a joint press conference with United States President Donald Trump in Alaska.\nMore to come...",
    "link": "https://biztoc.com/x/ef384812646faa6d",
    "timestamp": "2025-08-15T23:07:44Z"
  },
  {
    "title": "Putin, Trump start press conference after Alaska talks",
    "description": "Russian President Vladimir Putin and United States President Donald Trump began a joint press conference in Alaska on Friday, addressing the ongoing war in Ukraine as their first priority.\nPutin said...",
    "link": "https://biztoc.com/x/de17231229a2f9d9",
    "timestamp": "2025-08-15T23:07:43Z"
  },
  {
    "title": "India Says U.S. Arms Deals Still on Track, but No Compromise on Trade",
    "description": "Indian Prime Minister Narendra Modi on Friday repeated his vow to protect Indian farmers from competition with tariffs and trade barriers, even as President Donald Trump’s punishing retaliatory tariffs of up to 50 percent on Indian goods threaten to take effe…",
    "link": "https://www.breitbart.com/asia/2025/08/15/india-says-u-s-arms-deals-still-on-track-but-no-compromise-on-trade/",
    "timestamp": "2025-08-15T23:03:13Z"
  },
  {
    "title": "US authorities raid ransomware operator, seize $2.8M in crypto",
    "description": "The U.S. Justice Department authorized the seizure of more than $2.8 million in cryptocurrency, cash, and other assets from a suspected ransomware operator, according to an Aug. 14 announcement. Federal prosecutors unsealed six warrants tied to Ianis Aleksand…",
    "link": "https://cryptoslate.com/us-authorities-raid-ransomware-operator-seize-2-8m-in-crypto/",
    "timestamp": "2025-08-15T23:00:27Z"
  },
  {
    "title": "Ex-Trump aide stunned as journalist predicts Trump hatched plot to arrest Putin on US soil",
    "description": "A journalist and political commentator stunned a former communications head for President Donald Trump after boldly predicting Trump would have Russian President Vladimir Putin arrested for being a \"war criminal\" during a high-stakes summit in Alaska.Trump me…",
    "link": "https://www.rawstory.com/trump-putin-2673888855/",
    "timestamp": "2025-08-15T22:58:04Z"
  },
  {
    "title": "Alaskans Rally for Ukraine as Trump Meets Putin",
    "description": "Protesters rallied in support of Ukraine in Anchorage, Alaska, Friday as US President Donald Trump and Russian President Vladimir Putin held face-to-face talks without Ukrainian President Volodymyr Zelenskiy. #politics #russia #trump #ukraine #worldnews #us #…",
    "link": "https://biztoc.com/x/cfca5ee1ea68a7c2",
    "timestamp": "2025-08-15T22:56:37Z"
  },
  {
    "title": "Why Did Tom Cruise Reportedly Refuse Kennedy Center Honor? What to Know",
    "description": "Getting Tom Cruise to accept a 2025 Kennedy Center Honor is proving to be mission impossible. The Top Gun actor was offered the 2025 prestigious award but declined, according to multiple Kennedy Center employees who spoke to The Washington Post. President Don…",
    "link": "https://www.usmagazine.com/celebrity-news/news/why-did-tom-cruise-reportedly-refuse-kennedy-center-honor/#article",
    "timestamp": "2025-08-15T22:56:15Z"
  },
  {
    "title": "Watch Live: Donald Trump Speaks at Alaska Peace Summit with Putin",
    "description": "President Donald Trump holds a press conference with Vladimir Putin in Anchorage, Alaska, on Friday, August 15.\nThe post Watch Live: Donald Trump Speaks at Alaska Peace Summit with Putin appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/08/15/watch-live-donald-trump-speaks-at-alaska-peace-summit-with-putin/",
    "timestamp": "2025-08-15T22:55:14Z"
  },
  {
    "title": "Trump and Putin hold press conference after summit",
    "description": "SINGAPORE: United States President Donald Trump and Russia's President Vladimir Putin have concluded a high-risk summit that will test the US president's promise to end the bloody war in Ukraine. They are now holding a press conference. Follow live:",
    "link": "https://www.channelnewsasia.com/world/trump-putin-summit-press-conference-live-5297506",
    "timestamp": "2025-08-15T22:55:00Z"
  },
  {
    "title": "LIVE: Putin-Trump Hold Joint Presser",
    "description": "The closed-door talks between Russian President Vladimir Putin and US President Donald Trump has concluded at Joint Base Elmendorf-Richardson near Anchorage, Alaska.",
    "link": "https://sputnikglobe.com/20250815/live-putin-trump-hold-joint-presser-1122624380.html",
    "timestamp": "2025-08-15T22:54:42Z"
  },
  {
    "title": "Emanuel: Trump Likely Putting Personal Interests Ahead of America‘s National Security",
    "description": "Friday on CNN's \"The Arena,\" former Chicago Mayor Rahm Emanuel said he was worried President Donald Trump was putting his own interests above America's national security interests during his Anchorage, Alaska summit with Russian President Vladimir Putin.\nThe …",
    "link": "https://www.breitbart.com/clips/2025/08/15/emanuel-trump-likely-putting-personal-interests-ahead-of-americas-national-security/",
    "timestamp": "2025-08-15T22:54:14Z"
  },
  {
    "title": "Trump-Putin direct talks over Ukraine conclude as summit stretches on",
    "description": "ANCHORAGE, Alaska: US President Donald Trump and Russian President Vladimir Putin met face-to-face for almost three hours over Moscow's war in Ukraine on Friday, the Kremlin said, as the two world leaders sought an end to the deadliest conflict in Europe in 8…",
    "link": "https://www.channelnewsasia.com/world/trump-putin-alaska-summit-ukraine-war-5297501",
    "timestamp": "2025-08-15T22:54:05Z"
  },
  {
    "title": "Carefully and Gracefully",
    "description": "And so, now, in Alaska, Mr. Trump sits down with Vlad Putin to attempt a settling of Ukraine’s hash. This war has been a three-year bloody grind, millions killed, mostly Ukrainians, provoked underhandedly by US State Dept / CIA neocons, Britain’s MI6 apparatu…",
    "link": "https://freerepublic.com/focus/f-chat/4334844/posts",
    "timestamp": "2025-08-15T22:52:45Z"
  },
  {
    "title": "Carefully and Gracefully",
    "description": "And so, now, in Alaska, Mr. Trump sits down with Vlad Putin to attempt a settling of Ukraine’s hash. This war has been a three-year bloody grind, millions killed, mostly Ukrainians, provoked underhandedly by US State Dept / CIA neocons, Britain’s MI6 apparatu…",
    "link": "https://freerepublic.com/focus/f-news/4334844/posts",
    "timestamp": "2025-08-15T22:52:45Z"
  },
  {
    "title": "Gavin Newsom Is Going Full Trump-Mode, but It’s Actually a Good Thing",
    "description": "The California governor is certainly trying something new to push back against the MAGA horde.",
    "link": "https://www.esquire.com/news-politics/politics/a65794624/gavin-newsom-trump-tweets/",
    "timestamp": "2025-08-15T22:52:00Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump Boasts Prince Andrew Is 'A lot of Fun to Be With,' Author Claims — As Prez and Disgraced Royal's Connection Links Back to Pedo Jeffrey Epstein",
    "description": "The president allegedly handed Andrew a list of masseuses after the pair engaged in a lewd conversation.",
    "link": "https://radaronline.com/p/donald-trump-prince-andrew-royal-jeffrey-epstein-exclusive/",
    "timestamp": "2025-08-15T22:49:00Z"
  },
  {
    "title": "Watch Trump React To Hillary Clinton's Surprising Nobel Peace Prize Endorsement",
    "description": "The president seemed pleased with the former first lady's possible endorsement, but seemed to ignore what he'd actually have to do to get it from her.",
    "link": "https://www.huffpost.com/entry/donald-trump-responds-to-hillary-clintons-nobel-prize-praise_n_689f9ae9e4b0ef392c22886a",
    "timestamp": "2025-08-15T22:48:51Z"
  },
  {
    "title": "Ukrainians watched in disbelief as America rolled out the red carpet for Vladimir Putin",
    "description": "Russian president appeared to shrug as reporters in Alaska asked if he will ‘stop killing civilians’",
    "link": "https://www.irishtimes.com/world/us/2025/08/15/ukrainians-watched-in-disbelief-as-america-rolled-out-the-red-carpet-for-vladimir-putin/",
    "timestamp": "2025-08-15T22:48:41Z"
  },
  {
    "title": "Republican Senator Questions Trump’s Red Carpet Treatment of Putin: ‘Are We Being Too Conciliatory?’",
    "description": "Senator Lisa Murkowski (R-AK) questioned the optics of President Donald Trump’s summit with Russian President Vladimir Putin, saying, “Are we being too conciliatory?” in a Friday appearance on CNN’s The Lead With Jake Tapper. Murkowski met briefly with Trump …",
    "link": "https://www.mediaite.com/media/tv/republican-senator-questions-trumps-red-carpet-treatment-of-putin-are-we-being-too-conciliatory/",
    "timestamp": "2025-08-15T22:46:16Z"
  },
  {
    "title": "EXCLUSIVE: What Alaska’s Governor Expects From Trump-Putin Summit",
    "description": "FIRST ON DAILY SIGNAL—Reports that the Trump administration might strike a deal granting Russia access to Alaskan minerals are “fake news,” Alaska Gov. Mike Dunleavy... Read More\nThe post EXCLUSIVE: What Alaska’s Governor Expects From Trump-Putin Summit appea…",
    "link": "https://www.dailysignal.com/2025/08/15/exclusive-what-alaskas-governor-expects-trump-putin-summit/",
    "timestamp": "2025-08-15T22:40:55Z"
  },
  {
    "title": "Bodycam footage shows Dem South Carolina gubernatorial hopeful’s rant, calling himself ‘Superman’ and ‘God’",
    "description": "Bizarre bodycam footage has been released showing a Democratic candidate for South Carolina governor going on a profanity-filled rant from the back of a police patrol car.",
    "link": "https://www.foxnews.com/us/wild-bodycam-shows-sc-democrat-gov-hopefuls-rant-claims-superman",
    "timestamp": "2025-08-15T22:35:37Z"
  },
  {
    "title": "Gregg Jarrett Breaks Down What Conditions Russia And Ukraine Need Met ‘To Say They’re Winners’",
    "description": "Jarrett said if both Putin and Zelenskyy could reach an agreement over territory control, they could both say \"they’re winners.\"",
    "link": "https://dailycaller.com/2025/08/15/gregg-jarrett-conditions-russia-ukraine-negotiations-donald-trump-ceasefire/",
    "timestamp": "2025-08-15T22:31:50Z"
  },
  {
    "title": "Trump and Putin end their meeting that started with a warm handshake belying bloodshed in Ukraine",
    "description": "President Trump and Vladimir Putin met in Alaska for peace talks regarding the war in Ukraine, a meeting marked by a warm reception that raised concerns among Ukrainian and European leaders. The summit, held on U.S. soil, aimed to find a resolution, but signi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-and-putin-end-their-meeting-that-started-with-a-warm-handshake-belying-bloodshed-in-ukraine/articleshow/123327015.cms",
    "timestamp": "2025-08-15T22:30:34Z"
  },
  {
    "title": "Hakeem Jeffries: More Is More — While Donald Trump delivers chaos, cruelty, and corruption ... (Tim Miller/The Bulwark)",
    "description": "Tim Miller / The Bulwark:\nHakeem Jeffries: More Is More  —  While Donald Trump delivers chaos, cruelty, and corruption—and Republicans play the facts-and-hypocrisy don't matter game— Democrats have to do more rallies, more town halls, and more hearings, on an…",
    "link": "https://www.memeorandum.com/250815/p98",
    "timestamp": "2025-08-15T22:30:00Z"
  },
  {
    "title": "I Feel Bad for the Pete Davidson BDE Commentary Now",
    "description": "By\n Opheli Garcia Lawler\n Published: August 15th, 2025",
    "link": "https://www.cracked.com/article_47908_i-feel-bad-for-the-pete-davidson-bde-commentary-now.html",
    "timestamp": "2025-08-15T22:30:00Z"
  },
  {
    "title": "Chuck Todd says Biden's presidency was so 'weak and ineffective' it made people go back to Trump",
    "description": "Chuck Todd blamed former President Biden's \"weak and ineffective\" presidency for enabling President Trump's historic return to power after losing re-election in 2020.",
    "link": "https://www.foxnews.com/media/chuck-todd-says-bidens-presidency-so-weak-ineffective-made-people-go-back-trump",
    "timestamp": "2025-08-15T22:28:45Z"
  },
  {
    "title": "Trump says war in Ukraine was 'heading to a third World War' before his election | Fox News Video",
    "description": "Fox News chief political anchor Bret Baier talks to President Donald Trump about his expectations for peace ahead of his meeting with Russian President Vladimir Putin on ’Special Report.’",
    "link": "https://www.foxnews.com/video/6376968557112",
    "timestamp": "2025-08-15T22:28:34Z"
  },
  {
    "title": "Putin-Trump talks in Alaska have ended, Kremlin says",
    "description": "MOSCOW (Reuters) -The talks between Russian President Vladimir Putin and his U.S. counterpart Donald Trump in Alaska have ended, the Kremlin said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/16/putin-trump-talks-in-alaska-have-ended-kremlin-says",
    "timestamp": "2025-08-15T22:28:00Z"
  },
  {
    "title": "U.S. Inflation Held Steady in July",
    "description": "The annualized U.S. inflation rate for the month of July remained unchanged from last month at 2.7 percent, according to a Bureau of Labor Statistics report released Tuesday. Lower gasoline prices helped to hold costs for Americans down, while car parts, used…",
    "link": "https://freerepublic.com/focus/f-news/4334840/posts",
    "timestamp": "2025-08-15T22:27:58Z"
  },
  {
    "title": "White House Creates Loyalty Rating System For 553 U.S. Companies—Here’s What Trump Has Said In The Past",
    "description": "Factors in the rating system, which revolves around companies’ efforts to support Trump’s “Big Beautiful Bill,” reportedly includes attendance at White House events, social media posts and advertisements.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/15/white-house-creates-loyalty-rating-system-for-553-us-companies-heres-what-trump-has-said-in-the-past/",
    "timestamp": "2025-08-15T22:26:06Z"
  },
  {
    "title": "Alaskans Give Putin And Trump The Welcome They Deserve",
    "description": "Donald Trump began slobbering over the war criminal he gave VIP treatment to right off the bat in Alaska.\nBut before the elderly conman and sexual predator completely capitulated to a much smarter Vladimir Putin, Alaskans showed up and showed out.\nEven Politi…",
    "link": "https://crooksandliars.com/2025/08/alaskans-give-putin-and-trump-welcome-they",
    "timestamp": "2025-08-15T22:24:33Z"
  },
  {
    "title": "New York’s top lawyer said Ethereum is a security. A crypto lawyer is coming for her job",
    "description": "New York Attorney General Letitia James has warned against the unchecked growth of the crypto industry. A former Coinbase attorney is eyeing a longshot bid...",
    "link": "https://www.dlnews.com/articles/regulation/crypto-lawyer-eyes-longshot-bid-to-oust-ny-attorney-general/",
    "timestamp": "2025-08-15T22:24:07Z"
  },
  {
    "title": "Red carpet, jet fly-over and a ride in 'The Beast': Putin gets a warm welcome in Alaska",
    "description": "President Donald Trump greets Russian President Vladimir Putin as he arrives at Joint Base Elmendorf-Richardson on Aug. 15, 2025 in Anchorage, Alaska.",
    "link": "https://biztoc.com/x/b95d1fa8e96d90ce",
    "timestamp": "2025-08-15T22:23:15Z"
  },
  {
    "title": "Podcaster Praised For Saying MAGA Should Be ‘Banned’ From ‘Best Thing’ About America",
    "description": "“This is the most savage takedown of anyone I've ever heard in my life,” one social media user said in response.",
    "link": "https://www.huffpost.com/entry/podcaster-explains-why-white-trump-voters-should-only-be-allowed-to-eat-at-cracker-barrel_n_689f7ddbe4b032da430d8d94",
    "timestamp": "2025-08-15T22:21:59Z"
  },
  {
    "title": "Democrats doubt Trump will secure Ukraine cease-fire in Alaska summit with Putin",
    "description": "Congressional Democrats wanted President Donald Trump to stand firm against Russian President Vladimir Putin, but raised doubts that the he would reach a deal on a ceasefire.",
    "link": "https://www.foxnews.com/politics/democrats-doubt-trump-secure-ukraine-cease-fire-alaska-summit-putin",
    "timestamp": "2025-08-15T22:21:22Z"
  },
  {
    "title": "Judge Rules FTC Investigation Of Media Matters Violates First Amendment",
    "description": "A federal judge has restricted the Federal Trade Commission’s investigation of Media Matters, the progressive watchdog group, finding that the agency was likely engaged in retaliatory conduct in violation of the First Amendment. U.S. District Judge Sparkle L.…",
    "link": "http://deadline.com/2025/08/media-matters-ftc-elon-musk-1236489854/",
    "timestamp": "2025-08-15T22:20:40Z"
  },
  {
    "title": "DEVELOPING: Nasty Biden Judge Reyes Scolds Justice Department Lawyers as She Orders DOJ to Walk Back Directive That Made DEA Chief in Charge of DC Police",
    "description": "Judge Ana Reyes, a Biden appointee, held a hearing on Friday to consider DC’s emergency bid to block President Trump’s federal takeover of DC’s police department.\nThe post DEVELOPING: Nasty Biden Judge Reyes Scolds Justice Department Lawyers as She Orders DOJ…",
    "link": "https://www.thegatewaypundit.com/2025/08/developing-nasty-biden-judge-reyes-scolds-justice-department/",
    "timestamp": "2025-08-15T22:20:18Z"
  },
  {
    "title": "Judge orders RFK Jr.'s health department to stop sharing Medicaid data with deportation officials - NewsBreak",
    "description": "WASHINGTON (AP) — A federal judge ordered the nation’s health department to stop giving deportation officials access to the personal information — includin",
    "link": "https://www.newsbreak.com/share/4175369879394-judge-orders-rfk-jr-s-health-department-to-stop-sharing-medicaid-data-with-deportation-officials?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NTUyOTYyOTgyNjA%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1755296298&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q3-v2%2Cns_foryou_rank_exp_25q3-v2%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_model_exp_25q3-v5",
    "timestamp": "2025-08-15T22:18:55Z"
  },
  {
    "title": "Lawrence O’Donnell Praises Newsom’s Redistricting Push: ‘This Is What Fighting Donald Trump Looks Like’ | Video",
    "description": "The governor \"is now leading California to the rescue of the United States of America,\" the \"Last Word\" host says\nThe post Lawrence O’Donnell Praises Newsom’s Redistricting Push: ‘This Is What Fighting Donald Trump Looks Like’ | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/lawrence-odonnell-gavin-newsom-redistricting-california-trump/",
    "timestamp": "2025-08-15T22:14:14Z"
  },
  {
    "title": "Dan Lanning weighs idea of athletes as employees, how to distribute NIL dollars",
    "description": "Through the early weeks of the revenue-sharing era in college athletics, the idea of athlete employment continues to come up. Collective bargaining and employment are seen as some of the next big questions in the post-House settlement landscape. Oregon head c…",
    "link": "https://www.on3.com/nil/news/dan-lanning-weighs-idea-athletes-employees-how-to-distribute-nil-dollars-oregon/",
    "timestamp": "2025-08-15T22:12:20Z"
  },
  {
    "title": "Trump and Putin Begin Ukraine Talks in Alaska",
    "description": "President Donald Trump and Russian counterpart Vladimir Putin began discussions at a highly anticipated summit with the US leader looking to secure an end to the war in Ukraine. #politics #russia #trump #ukraine #worldnews #us #putin #zelensky \nReporters late…",
    "link": "https://biztoc.com/x/e0ad6aaf7ddd6d62",
    "timestamp": "2025-08-15T22:12:02Z"
  },
  {
    "title": "‘Rubbing Ukraine the wrong way’: Media obsessed with Trump literally rolling out the red carpet for Putin",
    "description": "David Muir, Martha Raddatz charge that the optics would benefit Russian president",
    "link": "https://www.wnd.com/2025/08/rubbing-ukraine-wrong-way-media-obsessed-trump-literally/",
    "timestamp": "2025-08-15T22:11:50Z"
  },
  {
    "title": "DC reaches legal settlement with Trump administration over federal police takeover",
    "description": "Federal court dispute ends with compromise allowing Trump administration police control while blocking DEA chief appointment and maintaining local police leadership structure.",
    "link": "https://www.foxnews.com/us/dc-reaches-legal-settlement-trump-administration-over-federal-police-takeover",
    "timestamp": "2025-08-15T22:09:41Z"
  },
  {
    "title": "Florida Tech aerospace professor addresses federal space infrastructure order",
    "description": "President Donald Trump has signed a new executive order aimed at expanding U.S. leadership in commercial space by clearing regulatory barriers and speeding up approvals.",
    "link": "https://www.wftv.com/news/local/florida-tech-aerospace-professor-addresses-federal-space-infrastructure-order/T5YMITFN6ZGPFA7XLGRXNMJTNA/",
    "timestamp": "2025-08-15T22:07:51Z"
  },
  {
    "title": "Putin gets warm welcome from Trump at Alaska summit, including a ride in 'The Beast'",
    "description": "Russian President Vladimir Putin couldn’t have asked for a better reception",
    "link": "https://www.nbcnews.com/politics/trump-administration/putin-gets-warm-welcome-trump-ride-beast-alaska-summit-ukraine-rcna225310",
    "timestamp": "2025-08-15T22:06:30Z"
  },
  {
    "title": "WATCH LIVE: DC Mayor Bowser and attorney general hold briefing on bid to reverse Trump’s takeover",
    "description": "U.S. District Judge Ana Reyes indicated the law likely doesn’t allow the Trump administration power to fully take over city police, but it probably does give the president more power than the city might like.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-dc-mayor-bowser-and-attorney-general-hold-briefing-on-bid-to-reverse-trumps-takeover",
    "timestamp": "2025-08-15T22:06:07Z"
  },
  {
    "title": "U.S. stocks close mixed to end the week",
    "description": "NEW YORK, Aug. 15 (Xinhua) -- U.S. stocks ended mixed on Friday as Wall Street tempered expectations for near-term interest rate cuts following a week of economic data. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/16/us-stocks-close-mixed-to-end-the-week",
    "timestamp": "2025-08-15T22:05:00Z"
  },
  {
    "title": "Trump and Putin enter third hour of high-stakes Ukraine talks in Alaska",
    "description": "The US and Russian leaders exchanged two handshakes before travelling together in Trump's limo to the summit.",
    "link": "https://www.bbc.com/news/live/c2kzn1nw1d4t?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-15T22:04:47Z"
  },
  {
    "title": "Trump tax law could cause Medicare cuts if Congress doesn’t act, CBO says",
    "description": "Trump and Republicans pledged not to cut Medicare as part of the legislation.",
    "link": "https://www.bostonherald.com/2025/08/15/cbo-analysis-trump-tax-law-medicare/",
    "timestamp": "2025-08-15T22:04:26Z"
  },
  {
    "title": "Trump Putin Alaska Summit: Why Russian Empire sold Alaska to United States?",
    "description": "Trump Putin Alaska Summit has drawn global attention, bringing back discussions on the historic 1867 Alaska Purchase. This explainer talks about why the Russian Empire sold Alaska to the United States, covering political, economic, and strategic reasons behin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-putin-alaska-summit-why-russian-empire-sold-alaska-to-united-states-ownership-leaders-meet-purchase-agreement-why-buying-alaska-proved-beneficial-for-us/articleshow/123326807.cms",
    "timestamp": "2025-08-15T22:04:16Z"
  },
  {
    "title": "‘U.S. dominance’: Trump greets Putin with B-2 stealth bomber, F-35 flyover",
    "description": "Russian leader 'reminded' of American firepower on arrival at summit",
    "link": "https://www.wnd.com/2025/08/u-s-dominance-trump-greets-putin-b-2/",
    "timestamp": "2025-08-15T22:03:30Z"
  },
  {
    "title": "WATCH: ‘Nothing set in stone,’ Trump says aboard Air Force One en route to meeting with Putin",
    "description": "Speaking aboard Air Force One on his way to meeting with Putin in Alaska, Trump told reporters he wants “to see a ceasefire rapidly.”",
    "link": "https://www.pbs.org/newshour/politics/watch-nothing-set-in-stone-trump-says-aboard-air-force-one-en-route-to-meeting-with-putin",
    "timestamp": "2025-08-15T22:02:06Z"
  },
  {
    "title": "Putin and Trump share presidential limo to Alaska summit venue",
    "description": "The US and Russian leaders appeared to have shared a chuckle after getting into the vehicle Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623001-putin-trump-share-limo-summit/",
    "timestamp": "2025-08-15T22:01:36Z"
  },
  {
    "title": "Photocall erupts into chaos...",
    "description": "THIS is the moment Donald Trump and Vladimir Putin’s photocall descended into chaos – forcing the Russian tyrant to shout over journalists. It came after both leaders shook hands and sm…",
    "link": "https://www.the-sun.com/news/14984205/trump-putin-alaska-meet-ukraine/",
    "timestamp": "2025-08-15T22:00:04Z"
  },
  {
    "title": "Is It Unfair to Canada That ‘South Park’ Made Trump Canadian?",
    "description": "President Donald ‘Saddam Hussein’ Trump is not Canada’s buddy, guy!",
    "link": "https://www.cracked.com/article_47897_is-it-unfair-to-canada-that-south-park-made-trump-canadian.html",
    "timestamp": "2025-08-15T22:00:00Z"
  },
  {
    "title": "Trump Gives Putin a First-Rate Welcome at Alaska Summit",
    "description": "The U.S. president welcomed his Russian counterpart to their Ukraine war summit with bonhomie.",
    "link": "http://foreignpolicy.com/2025/08/15/trump-putin-summit-alaska-russia-ukraine-red-carpet/",
    "timestamp": "2025-08-15T21:57:11Z"
  },
  {
    "title": "Trump Rolls Out the Red Carpet for Putin in Alaska",
    "description": "The U.S. president welcomed his Russian counterpart to their Ukraine war summit with bonhomie.",
    "link": "http://foreignpolicy.com/2025/08/15/trump-putin-summit-alaska-russia-ukraine-red-carpet-cease-fire/",
    "timestamp": "2025-08-15T21:56:44Z"
  },
  {
    "title": "Student Loan Update: Trump Plan Could Cut Off Forgiveness for Some Workers",
    "description": "The Education Department says it addressed some concerns, saying it will not bar organizations for exercising First Amendment rights.",
    "link": "https://www.newsweek.com/student-loan-update-trump-teachers-nurses-forgiveness-2114339",
    "timestamp": "2025-08-15T21:56:38Z"
  },
  {
    "title": "How tall is Putin really? Alaska summit photos with Trump invite fresh debate over Russian leader’s height",
    "description": "During a high-stakes meeting in Alaska, the height difference between Donald Trump and Vladimir Putin became a major talking point online. Trump, noticeably taller, appeared to have a dominant physical presence, sparking discussions about body language and po…",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-tall-is-putin-really-alaska-summit-photos-with-trump-invite-fresh-debate-over-russian-leaders-height/articleshow/123326805.cms",
    "timestamp": "2025-08-15T21:56:18Z"
  },
  {
    "title": "Tom Cruise Rejected Getting a Kennedy Center Honor From Trump (Report) (James Hibberd/The Hollywood Reporter)",
    "description": "James Hibberd / The Hollywood Reporter:\nTom Cruise Rejected Getting a Kennedy Center Honor From Trump (Report)  —  The ‘Top Gun: Maverick’ star has turned down the prestigious arts award, as the president says he plans to personally host this year's ceremony.…",
    "link": "https://www.memeorandum.com/250815/p93",
    "timestamp": "2025-08-15T21:55:00Z"
  },
  {
    "title": "A B-2 bomber buzzed over Putin to open summit in Alaska",
    "description": "The Air Force staged a show of power with a flyover featuring a B-2 bomber ahead of the meeting between Trump and Putin in Alaska.",
    "link": "https://taskandpurpose.com/news/air-force-b2-trump-putin/",
    "timestamp": "2025-08-15T21:54:30Z"
  },
  {
    "title": "'Absolutely incredible': B-2 bomber, F-35 escort set stage for Trump-Putin talks in Alaska",
    "description": "B-2 bomber flyover marks Trump-Putin Alaska summit where presidents discuss Ukraine ceasefire and future talks including Zelenskyy at military base.",
    "link": "https://www.foxnews.com/politics/absolutely-incredible-b-2-bomber-f-35-escort-set-stage-trump-putin-talks-alaska",
    "timestamp": "2025-08-15T21:53:29Z"
  },
  {
    "title": "Some workers would be excluded from student loan forgiveness program for ‘illegal’ activity",
    "description": "The proposal allows the education secretary to decide which organizations are excluded.",
    "link": "https://www.bostonherald.com/2025/08/15/trump-student-loan-forgiveness-excluded-workers/",
    "timestamp": "2025-08-15T21:46:14Z"
  },
  {
    "title": "Boston pushes back on Trump's sanctuary city ultimatum",
    "description": "The U.S. Attorney General has warned communities across the country to comply with President Donald Trump's immigration policies or face prosecution, escalating tensions between the White House and sanctuary cities.",
    "link": "https://www.wcvb.com/article/boston-mayor-wu-immigration-policy-response/65793845",
    "timestamp": "2025-08-15T21:44:26Z"
  },
  {
    "title": "'D.C. Is Ours': Residents Vow To Fight Trump’s Takeover Of City's Police",
    "description": "“Making noise is resistance!” a Free DC activist said to cheers from protesters in front of D.C. police headquarters. “Making noise is freedom!”",
    "link": "https://www.huffpost.com/entry/dc-protest-trump-police-takeover_n_689e32fde4b048e97f078236",
    "timestamp": "2025-08-15T21:44:25Z"
  },
  {
    "title": "Fox News Guest Warns Putin Has Proven His Word Is Meaningless and He ‘Doesn’t Care if More Russians Die’",
    "description": "\"My initial take, though, is that no matter what comes out of it, Putin's word can never be trusted,” argued Brett Velicovich\nThe post Fox News Guest Warns Putin Has Proven His Word Is Meaningless and He ‘Doesn’t Care if More Russians Die’ first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/fox-news-guest-warns-putin-has-proven-his-word-is-meaningless-and-he-doesnt-care-if-more-russians-die/",
    "timestamp": "2025-08-15T21:42:56Z"
  },
  {
    "title": "Trump-appointed judge rebukes Oklahoma’s Ryan Walters",
    "description": "Oklahoma’s right-wing schools chief, Ryan Walters, received a stern rebuke this week as a Trump-appointed federal judge tossed out a baseless lawsuit filed by Walters to try to silence a religious freedom organization",
    "link": "https://www.msnbc.com/top-stories/latest/ryan-walters-oklahoma-judge-lawsuit-religious-freedom-rcna225290",
    "timestamp": "2025-08-15T21:41:22Z"
  },
  {
    "title": "Pope Leo XIV and Orthodox Patriarch Kirill Pray for Peace on This Assumption Day Marked by Alaska Peace Summit",
    "description": "Pray for peace.\nThe post Pope Leo XIV and Orthodox Patriarch Kirill Pray for Peace on This Assumption Day Marked by Alaska Peace Summit appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/pope-leo-xiv-orthodox-patriarch-kirill-pray-peace/",
    "timestamp": "2025-08-15T21:40:41Z"
  },
  {
    "title": "Why Have the Teamsters Gone Far Right?",
    "description": "The Teamsters leadership has in no way regretted its embrace of Donald Trump: The Teamsters is a union as decentralized as the country. Like the median voter, most union members aren’t closely following what Teamsters President Sean O’Brien is saying. But the…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/why-have-the-teamsters-gone-far-right",
    "timestamp": "2025-08-15T21:40:00Z"
  },
  {
    "title": "Putin Will Try to Charm Trump in Alaska Meeting, Bolton Says",
    "description": "Russia's Vladimir Putin will try to \"charm\" President Donald Trump and use KGB-style tactics to earn his trust when they meet in Alaska, says former US national security adviser John Bolton. #politics #russia #trump #ukraine #worldnews #us #putin #zelensky \nT…",
    "link": "https://biztoc.com/x/f018b2d295dea2d0",
    "timestamp": "2025-08-15T21:38:49Z"
  },
  {
    "title": "Trump, Putin meeting said to have passed 90 minutes",
    "description": "The meeting between United States President Donald Trump and Russian President Vladimir Putin has lasted over 90 minutes so far, according to Sky News.\nA White House official informed the news outlet...",
    "link": "https://biztoc.com/x/a95d3a262df3652c",
    "timestamp": "2025-08-15T21:38:45Z"
  },
  {
    "title": "Donald Trump Praised For 'Domination' Move Over Putin at Alaska Summit",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is getting praise online after a B-2 Stealth Bomber plane flew over both him and Russian President Vladimir Putin as the two greeted each other on the tarmac ahead of a summit in Alaska.…",
    "link": "https://biztoc.com/x/531b96ebc5b4f856",
    "timestamp": "2025-08-15T21:38:30Z"
  },
  {
    "title": "Donald Trump Praised For 'Domination' Move Over Putin at Alaska Summit",
    "description": "The high stakes bilateral meeting is aimed at advancing a potential ceasefire agreement in the war in Ukraine.",
    "link": "https://www.newsweek.com/donald-trump-praised-domination-putin-alaska-summit-2114327",
    "timestamp": "2025-08-15T21:37:56Z"
  },
  {
    "title": "Trump-linked American Bitcoin seeks Asia acquisitions to boost BTC holdings: Report",
    "description": "According to a new report, American Bitcoin, a Trump-linked BTC mining company, is seeking to buy at least one company in Asia to boost its Bitcoin reserves.",
    "link": "https://cointelegraph.com/news/trump-linked-american-bitcoin-asia-acquisitions-btc",
    "timestamp": "2025-08-15T21:34:40Z"
  },
  {
    "title": "Federal Judge Scraps Education Department Directives Removing DEI from Schools",
    "description": "A federal judge on Thursday sided with the American Federation of Teachers and struck down two Trump administration memos aimed at eliminating diversity, equity and inclusion (DEI) programs in U.S. schools and universities. U.S. District Judge Stephanie Galla…",
    "link": "https://www.breitbart.com/education/2025/08/15/federal-judge-scraps-education-department-directives-removing-dei-from-schools/",
    "timestamp": "2025-08-15T21:34:04Z"
  },
  {
    "title": "Man struck and killed on freeway after fleeing immigration agents, California official says",
    "description": "A vigil was planned for Friday by immigrant advocates.",
    "link": "https://www.bostonherald.com/2025/08/15/immigration-pedestrian-killed/",
    "timestamp": "2025-08-15T21:33:31Z"
  },
  {
    "title": "Putin and Trump discuss fate of Ukraine as summit gets underway",
    "description": "The summit opened with a highly-choreographed spectacle that saw the U.S. president greet Putin on American soil for their first face-to-face meeting of Trump’s second term.",
    "link": "https://www.japantimes.co.jp/news/2025/08/16/world/politics/us-russia-trump-putin-alaska/",
    "timestamp": "2025-08-15T21:33:00Z"
  },
  {
    "title": "Trump DOJ Sues California Over Clean Truck Deal, Saying It Seeks to Undermine US Law",
    "description": "The complaints from the Department of Justice are the latest attempt by the Trump administration to prevent California from enforcing its own clean-air standards.",
    "link": "https://www.kqed.org/news/12052390/trump-doj-sues-california-over-clean-truck-deal-saying-it-seeks-to-undermine-us-law",
    "timestamp": "2025-08-15T21:31:23Z"
  },
  {
    "title": "Schwarzenegger taunts Newsom with message targeting Dem redistricting push",
    "description": "Former California Gov. Arnold Schwarzenegger has mobilized to fight Gavin Newsom's redistricting push as Democrats aim to counter Trump's Texas congressional map changes.",
    "link": "https://www.foxnews.com/politics/schwarzeneggers-taunts-newsom-staunch-message-targeting-dem-redistricting-push",
    "timestamp": "2025-08-15T21:30:05Z"
  },
  {
    "title": "Fact focus: No, taxpayers will not receive new stimulus checks this summer",
    "description": "Congress has not passed legislation to authorize such payments and the IRS says no new stimulus checks will be distributed in coming weeks.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_36da34dd-cba0-57b9-9db4-27595e004b8e.html",
    "timestamp": "2025-08-15T21:30:00Z"
  },
  {
    "title": "China's economy lags in July under pressure from tariffs and a weak property market",
    "description": "China's economy showed signs of slowing in July as factory output and retail sales slowed and housing prices dropped further, according to data released Friday.  Uncertainty over tariffs on exports to the United States is still looming over the world's second…",
    "link": "https://japantoday.com/category/business/china%27s-economy-lags-in-july-under-pressure-from-tariffs-and-a-weak-property-market",
    "timestamp": "2025-08-15T21:28:52Z"
  },
  {
    "title": "Japan's economy grows annualized real 1.0% in April-June",
    "description": "Japan's economy grew an annualized real 1.0 percent in the April-June period, marking the fifth consecutive quarterly expansion, helped in part by solid capital investment, though weak consumer spending continued to drag on growth, government data showed Frid…",
    "link": "https://japantoday.com/category/business/update1-japan%27s-economy-grows-annualized-real-1.0-in-april-june",
    "timestamp": "2025-08-15T21:28:46Z"
  },
  {
    "title": "Retail sales in U.S. rise a solid 0.5% in July from June as shoppers appear to shrug off tariff pressures",
    "description": "Shoppers spent at a healthy pace in July, particularly at the nation’s auto dealerships, as they appear to shrug off President Donald Trump's tariffs, which are starting to take a toll on jobs and lead to some price increases. Retail sales rose a solid 0.5% l…",
    "link": "https://japantoday.com/category/business/retail-sales-rise-a-solid-0.5-in-july-from-june-helped-by-rebounding-auto-sales",
    "timestamp": "2025-08-15T21:28:32Z"
  },
  {
    "title": "‘CBS Evening News’ Executive Producer Guy Campanile to Return to ’60 Minutes’",
    "description": "Guy Campanile, a longtime “60 Minutes” producer who was tasked with managing a significant overhaul of the venerable “CBS Evening News,” is returning to his old stomping grounds. Campanile is expected to take up duties at “60 Minutes” in days to come, accordi…",
    "link": "https://variety.com/2025/tv/news/cbs-evening-news-producer-guy-campanile-return-60-minutes-1236490786/",
    "timestamp": "2025-08-15T21:27:46Z"
  },
  {
    "title": "Trump’s Inflation Promises May Finally Be Catching Up to Him",
    "description": "Trump’s inflation promises may finally be catching up to him. If tariff-driven inflation is truly arriving, already low estimations of Trump’s handling of prices could really plunge.",
    "link": "http://nymag.com/intelligencer/article/trumps-inflation-promises-may-finally-be-catching-up-to-him.html",
    "timestamp": "2025-08-15T21:27:42Z"
  },
  {
    "title": "Trump Admin Makes Concession After Lawsuit Filed in Washington, D.C",
    "description": "Earlier Friday, the nation's capital filed a lawsuit to block Republican President Donald Trump's takeover of its police department.",
    "link": "https://biztoc.com/x/ec4a09feb4a2318b",
    "timestamp": "2025-08-15T21:27:38Z"
  },
  {
    "title": "Blue states plan new tax hikes on wealthy residents in response to Trump's federal tax legislation",
    "description": "Blue states around the U.S. are planning tax hikes on wealthy residents to bring in additional revenue through a variety of proposals, including one state's so-called \"Taylor Swift tax.\"\nThe moves come after the enactment of the One Big Beautiful Bill Act (OB…",
    "link": "https://biztoc.com/x/e828515032764d54",
    "timestamp": "2025-08-15T21:27:25Z"
  },
  {
    "title": "DC Homeless Guy Doesn’t Regret Voting For Trump Even Though His Tents Got Thrown Out",
    "description": "A homeless man living in Washington, D.C. told the NYT on Friday that he does not regret voting for President Donald Trump, despite his tents being tossed out.",
    "link": "https://dailycaller.com/2025/08/15/dc-homeless-voting-trump-tents/",
    "timestamp": "2025-08-15T21:26:23Z"
  }
]