[
  {
    "title": "RFK Jr. fought pesticides for years. Now he’s backing their production",
    "description": "Kennedy is falling in line with an executive order that's aimed at boosting glyphosate’s production.",
    "link": "https://www.bostonherald.com/2026/02/23/maha-pesticides/",
    "timestamp": "2026-02-23T22:49:18Z"
  },
  {
    "title": "Sen. Amy Klobuchar bringing Moorhead brewery owner to State of the Union",
    "description": "Sen. Amy Klobuchar, D-Minn., will bring Sean Syverson, owner of Swing Barrel Brewing Co., as her guest. Sen. Kevin Cramer, R-N.D., plans to bring radio host Scott Hennen.",
    "link": "https://www.inforum.com/news/moorhead/sen-amy-klobuchar-bringing-moorhead-brewery-owner-to-state-of-the-union",
    "timestamp": "2026-02-23T22:44:39Z"
  },
  {
    "title": "RFK Jr. fought pesticides for years. Now he's backing their production",
    "description": "Robert F. Kennedy Jr. is doubling down on his support for an executive order that would aim to boost the production of a controversial weedkiller ingredient called glyphosate, even though it is widening a political fault line for the administration ahead of t…",
    "link": "https://www.ksat.com/health/2026/02/23/rfk-jr-fought-pesticides-for-years-now-hes-backing-their-production/",
    "timestamp": "2026-02-23T22:44:36Z"
  },
  {
    "title": "Bill Maher Gets Indiana’s Own John Mellencamp to do a Double Take By Telling Him ‘Trump Wrote a Lot of Checks to Farmers’",
    "description": "Bill Maher had to stop John Mellencamp for one moment during their Club Random podcast to point out one thing: \"Trump wrote a lot of checks to farmers\"\nThe post Bill Maher Gets Indiana’s Own John Mellencamp to do a Double Take By Telling Him ‘Trump Wrote a Lo…",
    "link": "https://www.mediaite.com/media/bill-maher-gets-indianas-own-john-mellencamp-to-do-a-double-take-by-telling-him-trump-wrote-a-lot-of-checks-to-farmers/",
    "timestamp": "2026-02-23T22:44:21Z"
  },
  {
    "title": "US men's hockey star Matthew Tkachuk reflects on Trump's phone call with team",
    "description": "Team USA men's hockey star Matthew Tkachuk reflected on receiving a phone call from President Donald Trump after winning the gold medal.",
    "link": "https://www.foxnews.com/sports/us-mens-hockey-star-matthew-tkachuk-reflects-trumps-phone-call-team",
    "timestamp": "2026-02-23T22:43:47Z"
  },
  {
    "title": "Trump at Event for Families of Dead Americans: ‘I Suffer for the Country’",
    "description": "President Donald Trump ranted about election fraud during a speech to \"Angel Families,\" whose loved ones were killed by undocumented migrants.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-event-angel-families-suffer-country-1235521326/",
    "timestamp": "2026-02-23T22:41:41Z"
  },
  {
    "title": "WSJ smacks down Trump's claim that a hospital ship is headed to Greenland",
    "description": "President Donald Trump announced last week that a U.S. Naval hospital ship was en route to Greenland, sparking outrage at yet another imperialist move on the Danish territory despite its residents' repeated insistence they have no interest in joining the Unit…",
    "link": "https://www.rawstory.com/trump-greenland-2675300045/",
    "timestamp": "2026-02-23T22:39:30Z"
  },
  {
    "title": "‘Refreshing change’: Trump boosts religious rights in schools with new guidance",
    "description": "'Marks a significant reversal of Biden-era guidance that minimized the constitutional rights of pubic school students, parents, and employees'",
    "link": "https://www.wnd.com/2026/02/refreshing-change-trump-boosts-religious-rights-schools-new/",
    "timestamp": "2026-02-23T22:39:18Z"
  },
  {
    "title": "EU pauses U.S. trade deal as it seeks clarity over Trump's new 15% global tariffs",
    "description": "Frustrated European officials pushed Monday for clarification on how U.S. President Donald Trump's declaration of a 15% global tax on imports would affect the trade deal they struck with Trump this summer as EU legislators hit pause on the deal's ratification…",
    "link": "https://www.pbs.org/newshour/world/eu-pauses-u-s-trade-deal-as-it-seeks-clarity-over-trumps-new-15-global-tariffs",
    "timestamp": "2026-02-23T22:38:53Z"
  },
  {
    "title": "Who sits where at Trump's State of the Union address: A visual guide",
    "description": "When President Trump delivers his State of the Union address on Tuesday night, Vice President JD Vance and House Speaker Mike Johnson are expected to be seated behind him on either side. Here's where other important figures will sit.",
    "link": "https://www.wmur.com/article/seating-chart-trump-state-of-the-union-2026/70459556",
    "timestamp": "2026-02-23T22:36:09Z"
  },
  {
    "title": "Margin of Error: 100% — CNN’s Cornish Cites ‘One Republican’ to Question Trump Support",
    "description": "Give me a phone and a list of registered Democrats, and I’ll find you one who thinks Donald Trump's the greatest thing since sliced bread — and Gavin Newsom is the devil incarnate. That’s essentially the level of polling rigor Audie Cornish brought to Tuesday…",
    "link": "https://freerepublic.com/focus/f-news/4368039/posts",
    "timestamp": "2026-02-23T22:34:37Z"
  },
  {
    "title": "Margin of Error: 100% — CNN’s Cornish Cites ‘One Republican’ to Question Trump Support",
    "description": "Give me a phone and a list of registered Democrats, and I’ll find you one who thinks Donald Trump's the greatest thing since sliced bread — and Gavin Newsom is the devil incarnate. That’s essentially the level of polling rigor Audie Cornish brought to Tuesday…",
    "link": "https://freerepublic.com/focus/f-chat/4368039/posts",
    "timestamp": "2026-02-23T22:34:37Z"
  },
  {
    "title": "Anderson Cooper’s South Africa Report Whitewashed Brutal Reality Of Afrikaner Murders",
    "description": "“60 Minutes” correspondent Anderson Cooper visited South Africa to investigate President Donald Trump’s claim of genocide and reported on rampant crime.",
    "link": "https://dailycaller.com/2026/02/23/anderson-cooper-trump-south-africa-afrikaners-farmers-killings/",
    "timestamp": "2026-02-23T22:33:09Z"
  },
  {
    "title": "Stephen Miller's staying power: From the Politics Desk",
    "description": "In today’s edition, we have a deeply reported look at Stephen Miller’s wide-ranging influence at the White House.",
    "link": "https://www.nbcnews.com/politics/politics-news/stephen-millers-staying-power-politics-desk-rcna260328",
    "timestamp": "2026-02-23T22:31:58Z"
  },
  {
    "title": "Environmentalists Put Leftwing Partisanship Before Restoration",
    "description": "Environmental protection is long, hard work, and it usually involves managing complex systems. If politics takes center stage–as it did at this year’s Everglades Coalition... Read More\nThe post Environmentalists Put Leftwing Partisanship Before Restoration ap…",
    "link": "https://www.dailysignal.com/2026/02/23/environmentalists-put-leftwing-partisanship-before-restoration/",
    "timestamp": "2026-02-23T22:30:00Z"
  },
  {
    "title": "Trump’s Name Totally Absent from Truth Social HQ, Columnist Finds",
    "description": "At the headquarters for Trump Media & Technology Group in Sarasota, Florida, the president's brand is \"oddly missing,\" reported the Sarasota Herald-Tribune.\nThe post Trump’s Name Totally Absent from Truth Social HQ, Columnist Finds first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trumps-name-totally-absent-from-truth-social-hq-columnist-finds/",
    "timestamp": "2026-02-23T22:28:44Z"
  },
  {
    "title": "Brazil vs. US: Two insurrections, different results",
    "description": "On January 8, 2023, thousands of supporters of Brazil’s right-wing former President Jair Bolsonaro stormed federal buildings in the country’s capital. Their goal? Overthrow the results of an election they claimed was rigged, despite no credible evidence of fr…",
    "link": "https://www.vox.com/videos/480115/brazil-vs-us-two-insurrections-different-results",
    "timestamp": "2026-02-23T22:28:14Z"
  },
  {
    "title": "US women’s hockey decline State of the Union invite by Trump",
    "description": "The US women's hockey team declined an invite from Donald Trump to attend Tuesday's State of the Union after winning gold in Milan.",
    "link": "https://www.boston.com/sports/pwhl/2026/02/23/us-womens-hockey-mens-olympics-gold-medal-canada-donald-trump-invite-state-of-the-union/",
    "timestamp": "2026-02-23T22:27:53Z"
  },
  {
    "title": "Texts show Rep. Tony Gonzales sent sexually explicit messages to staffer",
    "description": "Rep. Tony Gonzales, R-Texas, sent sexual text messages to a former aide with whom he allegedly had an affair before her death by suicide last year, messages obtained by NBC News show.",
    "link": "https://www.nbcnews.com/politics/congress/texts-show-rep-tony-gonzales-sent-sexually-explicit-messages-staffer-rcna260256",
    "timestamp": "2026-02-23T22:23:49Z"
  },
  {
    "title": "U.S. women's gold medal-winning team declines invitation from Trump to attend State of Union address",
    "description": "The U.S. women's hockey gold medal-winning team has politely declined an invitation from President Donald Trump to attend his State of the Union address on Tuesday. “We are sincerely grateful for the invitation extended to our gold medal–winning U.S. Women’s …",
    "link": "https://sports.yahoo.com/articles/u-womens-gold-medal-winning-222150573.html",
    "timestamp": "2026-02-23T22:21:50Z"
  },
  {
    "title": "Supreme Court given opportunity to rule on Democrats’ Russiagate conspiracy theory",
    "description": "Claims about President Trump disrupted his 2016 campaign and his 1st term in the White House",
    "link": "https://www.wnd.com/2026/02/supreme-court-given-opportunity-rule-democrats-russiagate-conspiracy/",
    "timestamp": "2026-02-23T22:19:22Z"
  },
  {
    "title": "Trump Says War With Iran Is Totally Still on the Table",
    "description": "The possibility of war with Iran is still very much a possibility, according to Donald Trump.Top U.S. military officials have reportedly warned the White House against dragging the country into war with Iran, arguing that it could entangle America in a prolon…",
    "link": "https://newrepublic.com/post/206944/donald-trump-war-iran-still-option",
    "timestamp": "2026-02-23T22:18:53Z"
  },
  {
    "title": "US sheds light on its allegation of Chinese nuclear test and urges nations to push for disarmament",
    "description": "Christopher Yeaw says Beijing has “massively expanded” its nuclear arsenal.",
    "link": "https://www.bostonherald.com/2026/02/23/us-china-russia-nuclear-weapons/",
    "timestamp": "2026-02-23T22:18:33Z"
  },
  {
    "title": "'El Mencho' tracked to secret rendezvous with romantic partner before deadly raid",
    "description": "Mexico's most-wanted fentanyl kingpin \"El Mencho\" reportedly killed after military forces tracked his romantic partner to secret meeting location.",
    "link": "https://www.foxnews.com/world/el-mencho-tracked-secret-rendezvous-romantic-partner-before-deadly-raid",
    "timestamp": "2026-02-23T22:18:18Z"
  },
  {
    "title": "RFK Jr. backs production of pesticides he fought for years",
    "description": "Robert F. Kennedy Jr. is doubling down on his support for an executive order that would aim to boost the production of a controversial weedkiller ingredient called glyphosate, even though it is widening a political fault line for the administration ahead of t…",
    "link": "https://apnews.com/article/maha-glyphosate-rfk-kennedy-trump-pesticides-3d23d4771dba743a976543ca6cfa69d9",
    "timestamp": "2026-02-23T22:16:37Z"
  },
  {
    "title": "U.S. women's hockey team declines invitation to attend the State of the Union",
    "description": "The team was invited after winning the gold medal at the Winter Olympics",
    "link": "https://www.cbssports.com/olympics/news/usa-womens-hockey-team-declines-invitation-state-of-the-union/",
    "timestamp": "2026-02-23T22:16:30Z"
  },
  {
    "title": "Below zero: Fed governor wouldn’t be surprised at negative job growth number",
    "description": "Christopher Waller warned that January's 130,000 job pickup could have been a one-time deal.",
    "link": "https://fortune.com/2026/02/23/fed-governor-christopher-waller-march-rate-cut-job-market/",
    "timestamp": "2026-02-23T22:15:39Z"
  },
  {
    "title": "JENN PELLEGRINO And JORGE MARTINEZ: President Trump Delivers For America’s Forgotten",
    "description": "On the eve of the State of the Union, the American people are not looking for lofty promises. They are looking for proof. They want to know whether the government",
    "link": "https://dailycaller.com/2026/02/23/opinion-president-trump-delivers-for-americas-forgotten-jenn-pellegrino-and-jorge-martinez/",
    "timestamp": "2026-02-23T22:15:30Z"
  },
  {
    "title": "Trump honors Laken Riley alongside her mother on 2nd anniversary of death",
    "description": "President Donald Trump is preparing to deliver his State of the Union address Tuesday night in Washington, as he faces some of the lowest polling numbers of either his first or second term.",
    "link": "https://www.wsbtv.com/news/local/trump-honors-laken-riley-alongside-her-mother-2nd-anniversary-death/6J6FYI5EZ5FX3LGYYTOOK76Q7Q/",
    "timestamp": "2026-02-23T22:13:57Z"
  },
  {
    "title": "Mexican Drug Lord’s Killing Sparks Widespread Violence",
    "description": "Local authorities are scrambling to restore order amid a mounting death toll.",
    "link": "http://foreignpolicy.com/2026/02/23/mexico-cartel-leader-oseguera-cervantes-killed-violence-jalisco-el-mencho/",
    "timestamp": "2026-02-23T22:12:58Z"
  },
  {
    "title": "Jack Hughes cements his place as an Olympic — and American — hero",
    "description": "With a chipped front tooth and blood spilling from his mouth, wrapped in the American flag and elation, 24-year-old Jack Hughes is already an Olympic legend.",
    "link": "https://nypost.com/2026/02/23/opinion/jack-hughes-cements-his-place-as-an-olympic-and-american-hero/",
    "timestamp": "2026-02-23T22:12:02Z"
  },
  {
    "title": "Dozens of Dems plan to skip Trump’s State of the Union as party can’t decide on rival programming",
    "description": "Dozens of Democrats will be boycotting President Trump's State of the Union, as the rebellious pols splinter across two major counter-rallies and face pressure from leadership to behave.",
    "link": "https://nypost.com/2026/02/23/us-news/dozens-of-dems-plan-to-skip-president-trumps-state-of-the-union-as-party-splits-on-how-to-protest/",
    "timestamp": "2026-02-23T22:10:11Z"
  },
  {
    "title": "Top 5 Political Questions from a Supposedly Apolitical Trump Interview Conducted By College Football Podcaster Josh Pate",
    "description": "President Donald Trump appeared on the podcast of top college football analyst Josh Pate, and the promise of an apolitical conversation was quickly broken.\nThe post Top 5 Political Questions from a Supposedly Apolitical Trump Interview Conducted By College Fo…",
    "link": "https://www.mediaite.com/media/sports/top-5-political-questions-from-a-supposedly-apolitical-trump-interview-conducted-by-college-football-podcaster-josh-pate/",
    "timestamp": "2026-02-23T22:09:20Z"
  },
  {
    "title": "Kash Patel and the U.S. Men’s Hockey Team Deserve Each Other",
    "description": "These Olympics were joyful and uplifting. Then the FBI director showed up.",
    "link": "https://slate.com/culture/2026/02/kash-patel-trump-maga-us-mens-hockey-team.html",
    "timestamp": "2026-02-23T22:07:39Z"
  },
  {
    "title": "Stocks drop after Trump ramps up new tariffs and investors dump potential AI losers",
    "description": "U.S. stocks slumped Monday after President Donald Trump ramped up his newest tariffs, while investors continued to punish companies that could be losers in the artificial-intelligence revolution.",
    "link": "https://www.pbs.org/newshour/economy/stocks-drop-after-trump-ramps-up-new-tariffs-and-investors-dump-potential-ai-losers",
    "timestamp": "2026-02-23T22:07:04Z"
  },
  {
    "title": "US women's ice hockey team decline State of the Union invite, reports say",
    "description": "Feb 23 : The U.S. women's ice hockey team that beat rivals Canada for gold at the Milano Cortina Olympics have declined an invitation to attend President Donald Trump's State of the Union address in Washington this week citing schedule conflicts, according to…",
    "link": "https://www.channelnewsasia.com/sport/us-womens-ice-hockey-team-decline-state-union-invite-reports-say-5948121",
    "timestamp": "2026-02-23T22:02:13Z"
  },
  {
    "title": "The highlights and lowlights of the 2026 Winter Olympics",
    "description": "At every Olympic Games, there are winners, and there are many more losers. Dozens of gold, silver, bronze…and a whole bunch of people who walk away with nothing. Officially, Norway won the most in Milan and Cortina, with 41 total medals, 18 of which were gold…",
    "link": "https://www.vox.com/culture/480181/alysa-liu-eileen-gu-winter-olympics-gold-medal-winenrs-losers",
    "timestamp": "2026-02-23T22:01:56Z"
  },
  {
    "title": "Isaac Hayes Estate Settles With Trump Over Rally Use of ‘Hold On, I’m Coming’",
    "description": "Isaac Hayes' estate has reached a private settlement with President Trump over his unauthorized use of 'Hold On, I'm Coming' at political rallies.",
    "link": "http://www.rollingstone.com/music/music-news/isaac-hayes-estate-settles-trump-hold-on-rallies-copyright-1235521228/",
    "timestamp": "2026-02-23T22:00:33Z"
  },
  {
    "title": "Megyn Kelly Praises Alysa Liu and Bashes Liberals for Emphasizing Her Left-Wing Politics: ‘She Loves America, That’s Enough’",
    "description": "Megyn Kelly ripped liberals for criticizing conservatives that enjoyed Alysa Liu's gold medal-winning performance, despite the skater's left-wing views\nThe post Megyn Kelly Praises Alysa Liu and Bashes Liberals for Emphasizing Her Left-Wing Politics: ‘She Lov…",
    "link": "https://www.mediaite.com/media/news/megyn-kelly-praises-alysa-liu-and-bashes-liberals-for-emphasizing-her-left-wing-politics-she-loves-america-thats-enough/",
    "timestamp": "2026-02-23T21:59:42Z"
  },
  {
    "title": "Trump Predicts Supreme Court 'Will Find a Way to Come to the Wrong Conclusion' on Birthright Citizenship",
    "description": "President Donald Trump predicted on Monday that the U.S. Supreme Court will likely not rule in his favor on the birthright citizenship issue.",
    "link": "https://www.westernjournal.com/trump-predicts-supreme-court-will-find-way-come-wrong-conclusion-birthright-citizenship/",
    "timestamp": "2026-02-23T21:56:36Z"
  },
  {
    "title": "USA women’s hockey team chose homework over State of Union invite",
    "description": "The Team USA women's hockey team that won gold declined their State of the Union invite and cited \"academic and professional commitments.\"",
    "link": "https://ftw.usatoday.com/story/sports/olympics/2026/02/23/usa-women-hockey-state-of-union-invite/88832185007/",
    "timestamp": "2026-02-23T21:55:32Z"
  },
  {
    "title": "U.S. women's hockey team declines Trump's invitation to the State of the Union - NBC News",
    "description": "U.S. women's hockey team declines Trump's invitation to the State of the UnionNBC News Trump Mocks Women’s Hockey Team While Congratulating Men on GoldRolling Stone Winter Olympics 2026: Team USA women's hockey declines President Donald Trump's invite to Stat…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180848046",
    "timestamp": "2026-02-23T21:52:37Z"
  },
  {
    "title": "Trump Loves Golden Dome. His Own White House Is Slow-Rolling Spending",
    "description": "Billions in approved spending held up by Office of Management and Budget.",
    "link": "http://foreignpolicy.com/2026/02/23/golden-dome-spending-omb-budget-pentagon-trump-missile-defense-drones/",
    "timestamp": "2026-02-23T21:49:28Z"
  },
  {
    "title": "From dabblers to day traders, small investors' impact on Wall Street grows even in volatile market",
    "description": "For years, retail investors were dismissed by some on Wall Street as “dumb money.” That typically referred to those prone to trading on hype, or chasing trends rather than company or industry fundamentals, or responding late to big market moves. That's no lon…",
    "link": "https://japantoday.com/category/business/from-dabblers-to-day-traders-small-investors%27-impact-on-wall-street-grows-even-in-volatile-market",
    "timestamp": "2026-02-23T21:46:55Z"
  },
  {
    "title": "US Women's Hockey Team Declines Invite...",
    "description": "US Women's Hockey Team Declines Invite...\r\n\n \n \n \n (First column, 11th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:STATE OF THE UNION: Most say worse off...\r\nHistoric Turnaround? Here Are Facts...\r\nXi gains upper hand as trade war plunged into chaos...\r\nTrump O…",
    "link": "https://www.newsweek.com/state-union-2026-donald-trump-us-hockey-invitation-11568813",
    "timestamp": "2026-02-23T21:46:37Z"
  },
  {
    "title": "Bitcoin may reverse course and rally to $75K: Here’s how",
    "description": "Traders struggle to determine if the crypto market bottom is in, but liquidity fears, AI industry valuation worries, and BTC mining strength could send Bitcoin back to $75,000.",
    "link": "https://cointelegraph.com/news/bitcoin-may-reverse-course-and-rally-to-75k-here-s-how",
    "timestamp": "2026-02-23T21:45:00Z"
  },
  {
    "title": "Canadian PM heads to India, Japan, Australia seeking new trade partners",
    "description": "Prime Minister Mark Carney heads to Asia this week seeking to broaden international trade, part of his plan to reduce Canadian reliance on the United States, which he says has left the country vulnerable. Carney leaves Thursday for India, the first stop on a …",
    "link": "https://japantoday.com/category/politics/canada-pm-heads-to-asia-seeking-new-trade-partners-as-us-ties-fray",
    "timestamp": "2026-02-23T21:44:34Z"
  },
  {
    "title": "Trump fumes over 'fake' reports top general claimed US is headed to war",
    "description": "President Donald Trump raged on Monday at alleged \"fake news\" reports that his administration is considering going to war with Iran. Speculation grew last week that the Trump administration would approve a new series of strikes against Iran. The New York Time…",
    "link": "https://www.rawstory.com/trump-2675299285/",
    "timestamp": "2026-02-23T21:44:10Z"
  },
  {
    "title": "Zimbabwe rejects $350m US health deal, citing sovereignty concerns - Zimbabwe News Now",
    "description": "Zimbabwe rejects $350m US health deal, citing sovereignty concerns - Zimbabwe News Nowzimlive.com",
    "link": "https://www.zimlive.com/zimbabwe-rejects-350m-us-health-deal-citing-sovereignty-concerns/",
    "timestamp": "2026-02-23T21:43:54Z"
  },
  {
    "title": "Fashion Notes: Melania Trump Makes Black Tie Modern in Dolce & Gabbana",
    "description": "First Lady Melania Trump modernized black tie attire in a silk blouse and brocade trousers by one of her favorite fashion houses for dinner in the East Room of the White House, hosting the nation's governors and their spouses.\nThe post Fashion Notes: Melania …",
    "link": "https://www.breitbart.com/entertainment/2026/02/23/fashion-notes-melania-trump-dolce-and-gabbana-black-tie-modern/",
    "timestamp": "2026-02-23T21:43:40Z"
  },
  {
    "title": "Trump’s Pre-State of the Union Polling Numbers Among the Worst He’s Ever Had",
    "description": "Trump receives negative marks on the economy, foreign policy matters, his handling of immigration, and more.",
    "link": "https://truthout.org/articles/trumps-pre-state-of-the-union-polling-numbers-among-the-worst-hes-ever-had/",
    "timestamp": "2026-02-23T21:42:48Z"
  },
  {
    "title": "Trump warns countries that 'play games' with U.S. trade deals will face higher tariffs",
    "description": "U.S. President Donald Trump on Monday warned countries against backing away from recently negotiated trade deals with the U.S. after the Supreme Court struck ‌down his emergency tariffs, saying that he would hit them with much higher duties under different tr…",
    "link": "https://japantoday.com/category/business/trump-warns-countries-that-%27play-games%27-with-us-trade-deals-will-face-higher-tariffs",
    "timestamp": "2026-02-23T21:42:43Z"
  },
  {
    "title": "More Democrats to Ditch Trump’s SOTU Address",
    "description": "Mode Democrats are joining a boycott of President Donald Trump’s State of the Union address on Tuesday. Sen. Adam Schiff, D-Calif., and Sen. Ruben Gallego... Read More\nThe post More Democrats to Ditch Trump’s SOTU Address appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/23/more-democrats-to-ditch-trumps-sotu-address/",
    "timestamp": "2026-02-23T21:40:00Z"
  },
  {
    "title": "After Supreme Court rebuke, Democrats call for government to refund billions in Trump tariff money",
    "description": "Senate Democrats are unveiling a bill to have the government refund about $175 billion in Trump-era tariff money after the Supreme Court ruled that President Donald Trump's emergency tariffs were illegal. The bill from Senators Ron Wyden, Ed Markey, and…",
    "link": "https://apnews.com/article/trump-tariffs-refunds-senate-democrats-supreme-court-c2fc0ed663858a90bd2ddabf60aeda56",
    "timestamp": "2026-02-23T21:40:00Z"
  },
  {
    "title": "ICE arrests convicted pedophiles, violent assailants as Trump meets with Angel Families",
    "description": "After President Donald Trump met with Angel Families this weekend, DHS announced it had arrested more illegal pedophiles, rapists and violent assailants in its latest crackdown.",
    "link": "https://www.foxnews.com/politics/ice-arrests-convicted-pedophiles-violent-assailants-trump-meets-angel-families",
    "timestamp": "2026-02-23T21:39:29Z"
  },
  {
    "title": "US orders exit of Beirut embassy personnel amid Iran tension",
    "description": "The United States ordered non-emergency staff to leave its embassy in Beirut as US President Donald Trump threatens possible strikes on Iran.",
    "link": "https://www.channelnewsasia.com/world/iran-us-strikes-trump-military-beirut-lebanon-5948081",
    "timestamp": "2026-02-23T21:39:00Z"
  },
  {
    "title": "South Africa accepts Trump's new U.S. ambassador",
    "description": "South Africa on Monday said it accepted a conservative envoy highly critical of Pretoria as the new U.S. ambassador to the country, amid frayed relations with President Donald Trump. The two countries' governments have been at odds over a series of internatio…",
    "link": "https://japantoday.com/category/world/south-africa-accepts-trump%27s-new-us-ambassador",
    "timestamp": "2026-02-23T21:38:00Z"
  },
  {
    "title": "Supreme Court agrees to hear from oil and gas companies trying to block climate change lawsuits",
    "description": "The Supreme Court said Monday that it will hear from oil and gas companies trying to block lawsuits seeking to hold the industry liable for billions of dollars in damage linked to climate change. The conservative-majority court agreed to take up a case from B…",
    "link": "https://japantoday.com/category/world/supreme-court-agrees-to-hear-from-oil-and-gas-companies-trying-to-block-climate-change-lawsuits1",
    "timestamp": "2026-02-23T21:37:31Z"
  },
  {
    "title": "State Department orders nonessential U.S. diplomats to leave Lebanon as tensions with Iran soar",
    "description": "The United States has ordered nonessential diplomats and their family members at the U.S. Embassy in Beirut to leave Lebanon, the State Department said Monday, as tensions over Iran rise with the threat of a potentially imminent military strike. The departmen…",
    "link": "https://japantoday.com/category/world/state-department-orders-nonessential-us-diplomats-to-leave-lebanon-as-tensions-with-iran-soar",
    "timestamp": "2026-02-23T21:37:10Z"
  },
  {
    "title": "Ontario's premier says 'walls are closing in' on Trump after Supreme Court tariff decision",
    "description": "The leader of Canada’s most populous province said Monday “the walls are closing in” on President Donald Trump after the U.S. Supreme Court struck down many of Trump’s tariffs and said he’s also looking forward to the U.S. midterm elections in November which …",
    "link": "https://japantoday.com/category/world/ontario%27s-premier-says-%27the-walls-are-closing-in%27-on-trump-after-supreme-court-tariff-decision",
    "timestamp": "2026-02-23T21:37:04Z"
  },
  {
    "title": "EU diplomats meet Board of Peace director over Gaza's future",
    "description": "The European Union's top diplomats met Monday in Brussels with the director of the Board of Peace after a shaky and controversial embrace of U.S. President Donald Trump's efforts to secure and rebuild the war-ravaged Gaza Strip. Nikolay Mladenov, a former Bul…",
    "link": "https://japantoday.com/category/world/eu-diplomats-to-meet-board-of-peace-director-over-gaza%27s-future",
    "timestamp": "2026-02-23T21:36:54Z"
  },
  {
    "title": "U.S. military builds up largest force of warships and aircraft in Middle East in decades",
    "description": "The Pentagon is building up the largest force of American warships and aircraft in the Middle East in decades, including two aircraft carrier strike groups, as President Donald Trump warns of possible military action against Iran if talks over its nuclear pro…",
    "link": "https://japantoday.com/category/world/us-military-builds-up-the-largest-force-of-warships-and-aircraft-in-the-middle-east-in-decades",
    "timestamp": "2026-02-23T21:36:41Z"
  },
  {
    "title": "U.S. strike on alleged drug boat in Caribbean kills 3",
    "description": "The attack by the military comes less than a week after the head of U.S. Southern Command visited Caracas.",
    "link": "https://www.nbcnews.com/politics/trump-administration/us-strike-alleged-drug-trafficking-boat-caribbean-kills-3-rcna260327",
    "timestamp": "2026-02-23T21:36:28Z"
  },
  {
    "title": "US ambassador to France fails to show up for diplomatic summons",
    "description": "Foreign Affairs Minister Jean-Noël Barrot blasts Charles Kushner over what he described as the U.S. envoy's \"apparent misunderstanding of the basic expectations of an ambassador who has the honor of representing his country.\"",
    "link": "https://www.politico.eu/article/us-ambassador-to-france-fails-to-show-up-for-diplomatic-summons/",
    "timestamp": "2026-02-23T21:33:52Z"
  },
  {
    "title": "Trump Says He’d ‘Rather Have a Deal’ On Iran — Slams Reports Top General Is Wary of Full-Blown War",
    "description": "\"I would rather have a Deal than not but, if we don’t make a Deal, it will be a very bad day for that Country and, very sadly, its people\"\nThe post Trump Says He’d ‘Rather Have a Deal’ On Iran — Slams Reports Top General Is Wary of Full-Blown War first appear…",
    "link": "https://www.mediaite.com/media/news/trump-says-hed-rather-have-a-deal-on-iran-slams-reports-top-general-is-wary-of-full-blown-war/",
    "timestamp": "2026-02-23T21:32:46Z"
  },
  {
    "title": "Queer and Trans Activists Have Been at the Heart of Anti-ICE Work in Minneapolis",
    "description": "LGBTQ communities played a central role in coordinating mutual aid, ICE watch shifts, and the general strike.",
    "link": "https://truthout.org/articles/queer-and-trans-activists-have-been-at-the-heart-of-anti-ice-work-in-minneapolis/",
    "timestamp": "2026-02-23T21:31:12Z"
  },
  {
    "title": "10 memorable moments from the Winter Olympics",
    "description": "With 116 medal events over 16 days spread across northern Italy, the Milan Cortina Winter Olympics delivered many unforgettable moments. Here are 10 of the biggest, from heartbreak to triumph. U.S. skier Lindsey Vonn’s Olympic story was supposed to be one of …",
    "link": "https://japantoday.com/category/milano-cortina-2026-winter-olympics/10-memorable-moments-from-the-milan-cortina-winter-olympics",
    "timestamp": "2026-02-23T21:31:11Z"
  },
  {
    "title": "Dem lawmaker claims Kash Patel 'does not love America' when asked about FBI head cheering Team USA at Olympics",
    "description": "Rep. Seth Moulton declared on Monday that FBI Director Kash Patel \"does not love America\" after Patel celebrated with Team USA hockey after their gold medal win.",
    "link": "https://www.foxnews.com/media/dem-lawmaker-claims-kash-patel-does-not-love-america-when-asked-fbi-head-cheering-team-usa-olympics",
    "timestamp": "2026-02-23T21:30:35Z"
  },
  {
    "title": "Mar-a-Lago intruder not political, cousin says",
    "description": "The 21-year-old North Carolina man who entered a gate at President Donald Trump's Mar-a-Lago resort with a shotgun before he was shot and killed worked as a golf course groundskeeper and liked to sketch.",
    "link": "https://www.bostonherald.com/2026/02/23/mar-a-lago-intruder-not-political-cousin-says/",
    "timestamp": "2026-02-23T21:30:24Z"
  },
  {
    "title": "Busted: Nicki Minaj's MAGA rise powered by 'sophisticated army of bots'",
    "description": "One of MAGA's most prominent supporters seems to have gained notoriety within the movement on the backs of social media bots, according to a report. Nicki Minaj, a Grammy Award-winning rapper, has spent the last year or more steadily shifting her brand toward…",
    "link": "https://www.rawstory.com/nicki-minaj-2675299180/",
    "timestamp": "2026-02-23T21:28:50Z"
  },
  {
    "title": "Puerto Vallarta became a favorite escape for Americans. Now, some are rethinking Mexico travel.",
    "description": "After cartel violence shut down flights and blocked roads in Puerto Vallarta, Americans are canceling vacations and rethinking future travel plans.",
    "link": "https://www.businessinsider.com/puerto-vallarta-tourism-boom-cartel-violence-americans-rethinking-2026-2",
    "timestamp": "2026-02-23T21:28:37Z"
  },
  {
    "title": "Congress contemplates its role on tariffs after Supreme Court decision",
    "description": "Some congressional Republicans had already cooled to the president's trade policy before the Supreme Court decision on Friday.",
    "link": "https://www.cnbc.com/2026/02/23/trump-trade-supreme-court-congress-tariffs.html",
    "timestamp": "2026-02-23T21:28:32Z"
  },
  {
    "title": "Ex-Navy SEAL puts 'deranged' Mexican drug cartel on notice amid violent weekend: 'More like ISIS'",
    "description": "Rep. Dan Crenshaw said its time for expanded military action against Mexican cartels after a joint raid killed a \"El Mencho\" on Sunday.",
    "link": "https://www.foxnews.com/politics/ex-navy-seal-puts-deranged-mexican-cartel-on-notice-amid-violent-weekend-more-like-isis",
    "timestamp": "2026-02-23T21:27:49Z"
  },
  {
    "title": "President Trump Just Shaded the (Gold Medal-Winning) US Women’s Hockey Team",
    "description": "A video of the president’s congratulatory call to the national men’s team—in which he shades the women’s team—has set off widespread backlash.",
    "link": "https://www.cosmopolitan.com/politics/a70468136/trump-us-womens-hockey-team/",
    "timestamp": "2026-02-23T21:26:41Z"
  },
  {
    "title": "Watch: What to watch for during Trump's State of the Union address",
    "description": "BBC Washington correspondent Daniel Bush on who may skip the speech, why the president is fuming at the Supreme Court, and what policies could, or couldn’t, be in for a shake‑up.",
    "link": "https://www.bbc.com/news/videos/c77e6824pgxo",
    "timestamp": "2026-02-23T21:26:39Z"
  },
  {
    "title": "Why Team USA women’s hockey turned down invitation to White House State of the Union address",
    "description": "Here's why the women's hockey team will not be in Washington D.C. on Tuesday night.",
    "link": "https://www.sportingnews.com/us/nhl/news/why-team-usa-womens-hockey-invitation-white-house-state-union-address/56e4d1036748cf5fef299efc",
    "timestamp": "2026-02-23T21:25:24Z"
  },
  {
    "title": "Poor judgment or a principled stand? Susan Rice's spat with Trump dissected",
    "description": "Governance watchers say Susan Rice's critique of Donald Trump is complicating Netflix's bid for Warner Bros., while others call her stance principled.",
    "link": "https://www.businessinsider.com/susan-rice-critique-trump-fuels-debate-on-board-members-speech-2026-2",
    "timestamp": "2026-02-23T21:24:59Z"
  },
  {
    "title": "“Brandi Carlile Says Donald Trump Voters 'Got F-king Scammed,' But 'They Can Still Change Their Minds'”\n\n“Brandi Carlile says Donald Trump voters 'got f-king scammed,' but 'they can still change their minds.”",
    "description": "\"It's very clear that this administration is not interested in legal immigration,\" she told the publication backstage at the Target Center. “They're interested in violent theater,\" Carlile continued. \"Violent theater and dominance over other people. I don't b…",
    "link": "https://freerepublic.com/focus/f-chat/4368021/posts",
    "timestamp": "2026-02-23T21:24:46Z"
  },
  {
    "title": "Robert de Niro Breaks Down in Tears After Mocking Trump's Masculinity in Raving Interview with Nicolle Wallace",
    "description": "Rabid leftist Hollywood actor Robert De Niro choked back tears on an MS NOW podcast claiming that President Donald Trump is \"destroying America\" -- just minutes after taking jabs at the Commander-in-Chief's masculinity.\nThe post Robert de Niro Breaks Down in …",
    "link": "https://www.breitbart.com/entertainment/2026/02/23/robert-de-niro-breaks-down-in-tears-after-mocking-trumps-masculinity-in-raving-interview-with-nicolle-wallace/",
    "timestamp": "2026-02-23T21:23:06Z"
  },
  {
    "title": "USA women’s hockey team declines Trump’s State of the Union invite after Olympic gold medal win",
    "description": "The U.S. women’s hockey team, fresh off a gold medal victory against Canada at the 2026 Winter Olympics, has declined President Donald Trump’s invitation to attend his State of the Union address, taking place at the U.S. Capitol in Washington, D.C., on Tuesda…",
    "link": "https://freerepublic.com/focus/f-news/4368018/posts",
    "timestamp": "2026-02-23T21:22:59Z"
  },
  {
    "title": "Trump denies top general is against Iran strike",
    "description": "Trump rejects media reports claiming General Caine opposed strikes on Iran, reiterating his position that without a deal, the situation could escalate into a devastating outcome for Iran.",
    "link": "https://www.israelnationalnews.com/news/422881",
    "timestamp": "2026-02-23T21:22:00Z"
  },
  {
    "title": "UNHINGED: Far-Left Keith Olbermann Calls U.S. Men’s Hockey Team “Self-Absorbed Scumbag Misogynists” for Accepting Trump’s SOTU Invite — Praises Women’s Team as “Patriots” for “Snubbing the President”",
    "description": "The radical left is having another total meltdown, and as usual, failed sports commentator and professional rage-tweeter Keith Olbermann is leading the charge.\nThe post UNHINGED: Far-Left Keith Olbermann Calls U.S. Men’s Hockey Team “Self-Absorbed Scumbag Mis…",
    "link": "https://www.thegatewaypundit.com/2026/02/unhinged-far-left-keith-olbermann-calls-u-s/",
    "timestamp": "2026-02-23T21:20:57Z"
  },
  {
    "title": "Trump Gonna Ignore Mean Supreme Court, Tax Dolls And Pencils EVEN MORE",
    "description": "Biggest loser says what?",
    "link": "https://www.wonkette.com/p/trump-gonna-ignore-mean-supreme-court",
    "timestamp": "2026-02-23T21:20:36Z"
  },
  {
    "title": "Report — Chairman of the Joint Chiefs of Staff Warns Trump of Deep and Serious Risks If U.S. Strikes Iran",
    "description": "As President Donald Trump considers whether and how to conduct military strikes against Iran ahead of another round of talks in Geneva, Joint Chiefs Chairman Gen. Dan Caine has advised the president and senior officials that such action could carry significan…",
    "link": "https://www.breitbart.com/middle-east/2026/02/23/report-chairman-of-the-joint-chiefs-of-staff-warns-trump-of-deep-and-serious-risks-if-u-s-strikes-iran/",
    "timestamp": "2026-02-23T21:19:50Z"
  },
  {
    "title": "We Talked to an AI Trained on Jeffrey Epstein’s Emails. Here's What It Said",
    "description": "Someone fine-tuned an AI on the Jeffrey Epstein email dump. We ran it locally. It called us \"goyim\" and invited us to a party.",
    "link": "https://decrypt.co/358872/ai-trained-jeffrey-epstein-emails-mechaepstein-8000",
    "timestamp": "2026-02-23T21:19:23Z"
  },
  {
    "title": "Stocks diverge, dollar down over Trump tariffs uncertainty",
    "description": "Global markets were mixed and the dollar fell after the US Supreme Court blocked part of US President Donald Trump’s tariff plans, while gold and oil prices rose amid uncertainty.",
    "link": "https://www.channelnewsasia.com/world/trump-us-tariff-stock-market-eu-gold-oil-5948061",
    "timestamp": "2026-02-23T21:19:00Z"
  },
  {
    "title": "Judge Blocks 2nd Volume of Jack Smith's Report in Trump Case from Release",
    "description": "A federal judge has handed President Donald Trump and his co-defendants a victory regarding the second volume of Jack Smith's report.\nThe post Judge Blocks 2nd Volume of Jack Smith’s Report in Trump Case from Release appeared first on Breitbart.",
    "link": "https://www.breitbart.com/2020-election/2026/02/23/judge-blocks-2nd-volume-jack-smiths-report-trump-case-release/",
    "timestamp": "2026-02-23T21:18:57Z"
  },
  {
    "title": "Supreme Court will hear Big Oil’s attempt to block lawsuits seeking to hold it liable for climate change",
    "description": "The court will take up a case alleging the companies deceived the public about how fossil fuels contribute to climate change.",
    "link": "https://fortune.com/2026/02/23/supreme-court-big-oil-climate-liability-trump-environmental-regulations-exxon-suncor-energy/",
    "timestamp": "2026-02-23T21:12:38Z"
  },
  {
    "title": "Gold medal-winning women's hockey team declines Trump's State of Union invite",
    "description": "The U.S. women's Olympic hockey team declined an invitation to attend President Donald Trump's State of the Union speech on Tuesday. USA Hockey released a statement expressing gratitude for the invitation and acknowledging the team's gold medal achievement, t…",
    "link": "https://www.rawstory.com/us-hockey/",
    "timestamp": "2026-02-23T21:08:33Z"
  },
  {
    "title": "ROOKE: Trump Assassination Plot Goes Unnoticed As Media Refuses To Look In Mirror",
    "description": "The left-wing media's rapid dismissal of the story exposes their desire to prevent any narrative that might humanize Trump or Republicans.",
    "link": "https://dailycaller.com/2026/02/23/rooke-trump-assassination-attempt-democrats-media-palm-beach-austin-tucker-martin/",
    "timestamp": "2026-02-23T21:07:36Z"
  }
]