[
  {
    "title": "Trump nominates conservative economist to head agency that compiles jobs, inflation data",
    "description": "E.J. Antoni is chief economist at the conservative Heritage Foundation.",
    "link": "https://www.bostonherald.com/2025/08/11/heritage-foundation-chief-economist-bls/",
    "timestamp": "2025-08-11T23:19:11Z"
  },
  {
    "title": "Bowser suggests Trump’s view of DC crime stems from ‘COVID era’",
    "description": "Washington, D.C., Mayor Muriel Bowser said Monday it is true that the city underwent a “crime spike” following the COVID-19 pandemic, but argued a “huge decrease” in crime has occurred since. President Donald Trump announced Monday he is federalizing the dist…",
    "link": "https://freerepublic.com/focus/f-news/4334048/posts",
    "timestamp": "2025-08-11T23:18:46Z"
  },
  {
    "title": "'There's nothing novel' about Trump's deal with Nvidia and AMD, Jim Cramer says",
    "description": "CNBC's Jim Cramer gave his take on President Donald Trump's deal with Nvidia and AMD.",
    "link": "https://www.cnbc.com/2025/08/11/cramer-nothing-novel-trumps-deal-with-nvidia-amd.html",
    "timestamp": "2025-08-11T23:16:28Z"
  },
  {
    "title": "Fresh tariff blow to diamond export hub Surat",
    "description": "Industry seeks help of Govt, hopes US partners will bear part of burden.",
    "link": "https://indianexpress.com/article/cities/ahmedabad/fresh-tariff-blow-to-diamond-export-hub-surat-10183649/",
    "timestamp": "2025-08-11T23:15:47Z"
  },
  {
    "title": "Why government should not intervene in business (Washington Post)",
    "description": "Washington Post:\nWhy government should not intervene in business  —  Trump's side deal with Nvidia deepens companies dependence on government.  —  Just now  —  The deal that Nvidia CEO Jensen Huang hammered out with President Donald Trump in the Oval Office W…",
    "link": "https://www.memeorandum.com/250811/p112",
    "timestamp": "2025-08-11T23:15:01Z"
  },
  {
    "title": "Trump taps E.J. Antoni as next labor data chief",
    "description": "United States President Donald Trump said he will nominate economist E.J. Antoni as the next commissioner of the Bureau of Labor Statistics (BLS). \nTrump praised Antoni as \"highly respected&quot...",
    "link": "https://biztoc.com/x/84dd667704c0ed3c",
    "timestamp": "2025-08-11T23:13:37Z"
  },
  {
    "title": "Trump praises Intel's CEO, days after calling for him to resign",
    "description": "President Donald Trump met with Intel CEO Lip-Bu Tan and praised his \"success\" on Truth Social.\nAndrej Sokolow/picture alliance via Getty Images\nPresident Donald Trump met with Intel CEO Lip-Bu Tan, praising his \"success\" on Truth Social.\nThe meeting follows …",
    "link": "https://biztoc.com/x/252e6c8c3a3d5663",
    "timestamp": "2025-08-11T23:13:15Z"
  },
  {
    "title": "Trump dealt a legal blow from his own appointee: 'Neither reasoned nor rational'",
    "description": "President Donald Trump was dealt a court loss Monday afternoon from a federal judge he appointed during his first term.Trump nominated Dabney Friedrich as a United States district judge in 2017 and she was confirmed in November of that year. On Monday, that d…",
    "link": "https://www.rawstory.com/trump-judge-2673876368/",
    "timestamp": "2025-08-11T23:12:06Z"
  },
  {
    "title": "People Call Jimmy Fallon ‘Pathetic’ After He Interviewed A Fox News Star On His Show",
    "description": "The “Tonight Show” host is getting backlash — again — for being what one social media user called a “‘yes to everyone’ man” with “zero convictions.”",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-backlash-fox-news-interview_n_689a4d1ae4b0be3f5edc6fb6",
    "timestamp": "2025-08-11T23:10:40Z"
  },
  {
    "title": "Trump to nominate E.J. Antoni as new commissioner of labor statistics",
    "description": "President Donald Trump said Monday that he planned to nominate E.J. Antoni as the new commissioner of the Bureau of Labor Statistics.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-plans-nominate-ej-antoni-bureau-labor-statistics-commissioner-rcna224438",
    "timestamp": "2025-08-11T23:09:56Z"
  },
  {
    "title": "DC Resident Tells Washington Post City Is Safe After Outlet Grants Him Anonymity For Safety",
    "description": "A Washington, D.C., resident told The Washington Post on Monday that the federal city is \"safe,\" but asked for anonymity over \"concerns of personal safety.\"",
    "link": "https://dailycaller.com/2025/08/11/washington-dc-resident-city-safe-washingotn-post-anonymous-federalization-national-guard/",
    "timestamp": "2025-08-11T23:09:30Z"
  },
  {
    "title": "Trump praises Intel's CEO, days after calling for him to resign",
    "description": "Last week, President Donald Trump called Intel CEO Lip-Bu Tan \"highly CONFLICTED\" on Truth Social. On Monday, he posted calling Tan a \"success.\"",
    "link": "https://www.businessinsider.com/trump-meets-praises-intel-ceo-days-after-calling-for-resignation-2025-8",
    "timestamp": "2025-08-11T23:09:07Z"
  },
  {
    "title": "‘Move Out, Immediately:' Trump's vision for ridding DC streets of homeless",
    "description": "The president has vowed to use \"involuntary commitment\" to detain people sleeping on the streets of DC.",
    "link": "https://www.usatoday.com/story/news/nation/2025/08/11/trump-homeless-crime-dc/85612383007/",
    "timestamp": "2025-08-11T23:04:49Z"
  },
  {
    "title": "Wind Blade Maker TPI Composites Files for Bankruptcy in Texas",
    "description": "Wind turbine blade manufacturer TPI Composites Inc. has filed for Chapter 11 to restructure its debt with support from lender Oaktree Capital Management.",
    "link": "https://www.livemint.com/companies/news/wind-blade-maker-tpi-composites-files-for-bankruptcy-in-texas-11754953449221.html",
    "timestamp": "2025-08-11T23:04:08Z"
  },
  {
    "title": "Taiwan's IC packaging and testing supply chain may avoid tariffs, but US expansion remains challenging",
    "description": "When US President Donald Trump announced increased investment in domestic manufacturing alongside Apple CEO Tim Cook, he also declared a 100% tariff on all chips and semiconductors entering the US. However, he noted that companies \"building in the US or have …",
    "link": "https://www.digitimes.com/news/a20250808PD231/donald-trump-testing-taiwan-ic-packaging-investment.html",
    "timestamp": "2025-08-11T23:03:16Z"
  },
  {
    "title": "Who Is E.J. Antoni? Trump Taps New Labor Statistics Chief",
    "description": "Antoni has served as the Chief Economist for the Heritage Foundation.",
    "link": "https://www.newsweek.com/who-ej-antoni-trump-taps-new-labor-statistics-chief-2112055",
    "timestamp": "2025-08-11T23:01:37Z"
  },
  {
    "title": "Trump Floats Deploying National Guard to New York, Chicago, and LA After DC Crack Down",
    "description": "President Donald Trump said his administration is going to look at deploying the U.S. military to other American cities, including Chicago, New York, and Los Angeles, at a press conference where he announced that he was taking federal control of the police de…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334047/posts",
    "timestamp": "2025-08-11T23:01:14Z"
  },
  {
    "title": "Brian Cox touts Peaky Blinders star Cillian Murphy to be next James Bond: ‘He’s very real’",
    "description": "The Succession star asked if Murphy was being recommended for the role",
    "link": "https://www.the-independent.com/arts-entertainment/films/cillian-murphy-james-bond-peaky-blinders-brian-cox-b2805766.html",
    "timestamp": "2025-08-11T23:01:00Z"
  },
  {
    "title": "China and the US clash at the UN over the Panama Canal, a focus of Trump’s attention",
    "description": "Panama’s President José Raúl Mulino stressed the neutrality of the canal and his country’s ownership.",
    "link": "https://www.bostonherald.com/2025/08/11/united-states-china-panama-canal/",
    "timestamp": "2025-08-11T23:00:51Z"
  },
  {
    "title": "China and the US clash at the UN over the Panama Canal, a focus of Trump’s attention",
    "description": "Panama’s President José Raúl Mulino stressed the neutrality of the canal and his country’s ownership.",
    "link": "https://www.denverpost.com/2025/08/11/united-states-china-panama-canal/",
    "timestamp": "2025-08-11T23:00:51Z"
  },
  {
    "title": "Trump Admin Rescinds Biden Approval for Idaho Wind Farm Project",
    "description": "Secretary Doug Burgum on Lava Ridge Wind Project: “This decisive action defends the American taxpayer, safeguards our land, and averts what would have been one of the largest, most irresponsible wind projects in the nation.”\nThe post Trump Admin Rescinds Bide…",
    "link": "https://legalinsurrection.com/2025/08/trump-admin-rescinds-biden-approval-for-idaho-wind-farm-project/",
    "timestamp": "2025-08-11T23:00:32Z"
  },
  {
    "title": "MSNBC contributor rages at Trump's federal takeover of DC police to fight crime",
    "description": "President Trump places D.C.'s 3,400 police officers under federal control using emergency powers and proposes legislation to end no-cash bail practices.",
    "link": "https://www.foxnews.com/media/msnbc-contributor-rages-trumps-federal-takeover-dc-police-fight-crime",
    "timestamp": "2025-08-11T23:00:31Z"
  },
  {
    "title": "Crypto Rules Should Shield People, Not Amplify Corruption In Government: US Senator",
    "description": "Senator Elizabeth Warren is stepping up her call for strict cryptocurrency regulation, worried that industry-backed legislation can undermine consumer protections and weaken oversight. Related Reading: From Gold To Bitcoin: Michael Saylor’s ‘Indiana Jones’ Mo…",
    "link": "https://bitcoinist.com/crypto-rules-should-shield-people-not-amplify-corruption-in-government-us-senator/",
    "timestamp": "2025-08-11T23:00:24Z"
  },
  {
    "title": "Prince Andrew 'too terrified' for US return as book claims Queen 'knew what was going on'",
    "description": "Disgraced Prince Andrew may “never set foot” on US soil again, sources say, as lawmakers press for him to provide testimony under oath about his friendship with Jeffrey Epstein. The Duke of York, once branded “Air Miles Andy” for his relentless jet-set lifest…",
    "link": "https://freerepublic.com/focus/f-chat/4334046/posts",
    "timestamp": "2025-08-11T23:00:06Z"
  },
  {
    "title": "Pile on pressure to stop Israeli aggression, world urged",
    "description": "PETALING JAYA: The world must be more effective against ethnocratic Israel as its continued aggression against the Pales­tinians is making a mockery of global peace, say experts. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/08/12/pile-on-pressure-to-stop-israeli-aggression-world-urged",
    "timestamp": "2025-08-11T23:00:00Z"
  },
  {
    "title": "Trump picks conservative economist to lead jobs data agency",
    "description": "The president said that EJ Antoni would ensure the jobs numbers were \"HONEST and ACCURATE\".",
    "link": "https://www.bbc.com/news/articles/c93ddrp17zko",
    "timestamp": "2025-08-11T22:58:10Z"
  },
  {
    "title": "Trump nominates new Bureau of Labor Statistics commissioner | CNN Business",
    "description": "President Donald Trump on Monday nominated E.J. Antoni to be the new commissioner for the Bureau of Labor Statistics, the agency that collects and publishes data about jobs and inflation, after firing the previous commissioner, whom he accused without evidenc…",
    "link": "https://www.cnn.com/2025/08/11/business/bls-nominee-trump",
    "timestamp": "2025-08-11T22:57:16Z"
  },
  {
    "title": "Food stamps: 2.4 million people will lose benefits due to Trump agenda broadened work requirements",
    "description": "Some 2.4 million fewer Americans, including families with children, are forecast to receive food stamps benefits in an average month after Republican lawmakers expanded work requirements to some parents, older enrollees and others as part of President Donald …",
    "link": "https://www.cnn.com/2025/08/11/politics/food-stamps-work-requirements-trump-bill",
    "timestamp": "2025-08-11T22:57:13Z"
  },
  {
    "title": "India committed to contribute in ending Ukraine conflict: Modi to Zelenskyy",
    "description": "NEW DELHI, Aug 11: Days ahead of a much-anticipated US-Russia summit on the Ukraine war, Prime Minister Narendra Modi on Monday conveyed to Ukrainian President Volodymyr Zelenskyy in a phone conversation that India remains committed to making every possible c…",
    "link": "https://thehillstimes.in/national/india-committed-to-contribute-in-ending-ukraine-conflict-modi-to-zelenskyy",
    "timestamp": "2025-08-11T22:55:00Z"
  },
  {
    "title": "Canada alone in G7 with call for prisoner release as Armenia, Azerbaijan in peace talks",
    "description": "The federal government is calling for the release of Armenian detainees and prisoners of war in Azerbaijan as it praised the road to peace paved by a White House-brokered meeting last week between the two countries locked in decades of conflict.",
    "link": "https://www.cbc.ca/news/politics/azerbaijan-call-for-prisoner-release-1.7606313",
    "timestamp": "2025-08-11T22:53:58Z"
  },
  {
    "title": "JD Vance On 'Complicated' Relationship With Elon Musk",
    "description": "JD Vance On 'Complicated' Relationship With Elon Musklittlethings.com",
    "link": "https://littlethings.com/entertainment/jd-vance-elon-musk-trump-relationship",
    "timestamp": "2025-08-11T22:53:33Z"
  },
  {
    "title": "Here’s What Marijuana Insiders Think About Trump And Weed Reclassification",
    "description": "Some people in the bud biz are cautiously optimistic about cannabis reform, but others think he's “pandering to people on an issue everyone agrees on.”",
    "link": "https://www.huffpost.com/entry/what-marijuana-insiders-think-about-trumps-weed-reclassification_n_689a4af6e4b08fd59b642171",
    "timestamp": "2025-08-11T22:53:16Z"
  },
  {
    "title": "Trump selects Heritage Foundation's Antoni to head Bureau of Labor Statistics",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump on Monday said he was nominating economist E.J. Antoni as the new Bureau of Labor Statistics commissioner, ...",
    "link": "https://www.yahoo.com/news/articles/trump-selects-heritage-foundations-antoni-225306486.html",
    "timestamp": "2025-08-11T22:53:06Z"
  },
  {
    "title": "Trump says he's nominating E.J. Antoni as Bureau of Labor Statistics commissioner",
    "description": null,
    "link": "https://www.cnbc.com/2025/08/11/trump-antoni-bls-statistics.html",
    "timestamp": "2025-08-11T22:51:15Z"
  },
  {
    "title": "Intel: Looking forward to working closely with Trump",
    "description": "Intel Corporation hailed Monday's meeting between its CEO Lip-Bu Tan and United States President Donald Trump as a \"candid and productive\" discussion on the chip maker's commitment t...",
    "link": "https://biztoc.com/x/0c2d22add7636cfd",
    "timestamp": "2025-08-11T22:51:06Z"
  },
  {
    "title": "Massive revisions shook the jobs report. Tuesday’s inflation data could get cloudy, too",
    "description": "The next batch of inflation data from the Bureau of Labor Statistics was already shaping up to be a high-profile affair due to the expected impact of President Donald Trump’s hefty tariffs. But after Trump fired the agency’s top statistician, Tuesday’s report…",
    "link": "https://biztoc.com/x/d4c841590dc2ed56",
    "timestamp": "2025-08-11T22:51:05Z"
  },
  {
    "title": "Intel Stock Pops In After-Hours Monday After Trump Changes Tone On 'Highly Conflicted' CEO",
    "description": "Intel Corp (NASDAQ:INTC) shares are rising in Monday’s after-hours session following a change in tone from President Donald Trump after a meeting with Intel CEO Lip-Bu Tan at the White House.\nINTC is up after-hours. See what’s happening now.\nWhat Happened: Tr…",
    "link": "https://biztoc.com/x/e15838996539d922",
    "timestamp": "2025-08-11T22:51:04Z"
  },
  {
    "title": "JD Vance puts a weird twist on Team Trump’s line on the Epstein files",
    "description": "When it comes to talking points on the Epstein files, Donald Trump and JD Vance are not exactly on the same page.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jd-vance-puts-weird-twist-team-trumps-line-epstein-files-rcna224381",
    "timestamp": "2025-08-11T22:49:41Z"
  },
  {
    "title": "Keir Starmer warns Donald Trump that Vladimir Putin can't be trusted 'as far as you can throw him' ahead of US President's talks with Russian leader",
    "description": "Sir Keir Starmer today warned Donald Trump that Vladimir Putin cannot be trusted 'as far as you can throw him'. The US President is set to meet the Russian leader in Alaska later this week for peace talks over Ukraine. Mr Trump has signalled he thinks Ukraine…",
    "link": "https://freerepublic.com/focus/f-news/4334043/posts",
    "timestamp": "2025-08-11T22:49:34Z"
  },
  {
    "title": "Trump fell, as shown by this image?",
    "description": "Meta's social media platform Threads reported on its \"trending now\" list on Aug. 11, 2025, that the U.S. president had recently taken a fall.",
    "link": "https://www.snopes.com//fact-check/trump-fall-image/",
    "timestamp": "2025-08-11T22:47:00Z"
  },
  {
    "title": "Gunman fired more than 180 shots at CDC headquarters, but no staff wounded",
    "description": "The man who attacked the U.S. Centers for Disease Control (CDC) headquarters in Atlanta on Friday fired more than 180 shots and broke about 150 windows, piercing \"blast-resistant\" panes and spattering glass shards into numerous rooms, according to information…",
    "link": "https://www.cbc.ca/news/world/cdc-headquarters-attack-gunman-1.7606291",
    "timestamp": "2025-08-11T22:46:53Z"
  },
  {
    "title": "Street Protests Have Already Begun As The Mainstream Media Stirs Up A Backlash To Trump’s D.C. Takeover",
    "description": "The stage is being set for a dramatic showdown on the streets of the largest cities in the United States.  The mainstream media is freaking out about President Trump’s takeover of Washington D.C, and protests have already begun.  Needless to say, Washington D…",
    "link": "http://theeconomiccollapseblog.com/street-protests-have-already-begun-as-the-mainstream-media-stirs-up-a-backlash-to-trumps-d-c-takeover/",
    "timestamp": "2025-08-11T22:45:46Z"
  },
  {
    "title": "TMTG moves closer to launching spot Bitcoin ETF with amended S-1 filing",
    "description": "Trump Media and Technology Group (TMTG) has filed its first amended registration statement with the Securities and Exchange Commission (SEC) for the Truth Social Bitcoin ETF, advancing plans to enter the fast-growing spot Bitcoin ETF market. The ETF, to be li…",
    "link": "https://cryptoslate.com/tmtg-moves-closer-to-launching-spot-bitcoin-etf-with-amended-s-1-filing/",
    "timestamp": "2025-08-11T22:45:28Z"
  },
  {
    "title": "New ‘Make America Healthy Again’ report to be released in weeks | CNN",
    "description": "Americans will have to wait several weeks for the Trump administration’s next steps in its agenda to “Make America Healthy Again,” according to three people familiar with the matter.",
    "link": "https://www.cnn.com/2025/08/11/health/maha-report-release-wait",
    "timestamp": "2025-08-11T22:43:33Z"
  },
  {
    "title": "Dana White On How UFC Landed Its Blockbuster $7.7 Billion Streaming Deal With Paramount",
    "description": "UFC's CEO reveals why he wanted David Ellison's muscle behind his MMA giant, why pay-per-view events no longer work, and what a potential UFC fight at the White House would look like on CBS.",
    "link": "https://www.forbes.com/sites/mattcraig/2025/08/11/dana-white-on-how-ufc-landed-its-blockbuster-77-billion-streaming-deal-with-paramount/",
    "timestamp": "2025-08-11T22:41:02Z"
  },
  {
    "title": "Trump's Moves Toward Taking Over Washington Are Unprecedented. Here's What The Law Says",
    "description": "President Donald Trump took unprecedented steps Monday toward federalizing Washington, D.C.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-district-laws-explainer_n_689a6f56e4b08fd59b64372a",
    "timestamp": "2025-08-11T22:40:06Z"
  },
  {
    "title": "‘We’re allowed to be partisan’ in drawing congressional maps, Texas Republican says",
    "description": "Texas Gov. Greg Abbott says he’ll extend the standoff over redistricting for as long as necessary. The Republican effort is being pushed by President Trump and Abbott, who called a special session. Democrats have called foul, and they’re trying to run out the…",
    "link": "https://www.pbs.org/newshour/show/were-allowed-to-be-partisan-in-drawing-congressional-maps-texas-republican-says",
    "timestamp": "2025-08-11T22:40:05Z"
  },
  {
    "title": "5 Cities With More Homicides Than Washington",
    "description": "President Donald Trump announced Monday he’s taking decisive action to reduce crime in Washington, D.C., drawing attention to violent crime rates not only in the... Read More\nThe post 5 Cities With More Homicides Than Washington appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/08/11/5-cities-with-more-homicides-washington/",
    "timestamp": "2025-08-11T22:40:00Z"
  },
  {
    "title": "Trump's Farcical D.C. Crackdown (Quinta Jurecic/The Atlantic)",
    "description": "Quinta Jurecic / The Atlantic:\nTrump's Farcical D.C. Crackdown  —  In the summer of 2020, as demonstrators gathered in Washington, D.C., to protest against the murder of George Floyd, President Donald Trump directed the National Guard and officers from variou…",
    "link": "https://www.memeorandum.com/250811/p104",
    "timestamp": "2025-08-11T22:40:00Z"
  },
  {
    "title": "Donald Trump Doesn't Really Care About Crime (Jonathan Chait/The Atlantic)",
    "description": "Jonathan Chait / The Atlantic:\nDonald Trump Doesn't Really Care About Crime  —  Donald Trump is famously reluctant to commit troops abroad but salivates at the prospect of using them against Americans at home.  That is the context in which one must understand…",
    "link": "https://www.memeorandum.com/250811/p103",
    "timestamp": "2025-08-11T22:40:00Z"
  },
  {
    "title": "Asian Stocks Look Subdued Ahead of US Inflation: Markets Wrap",
    "description": "Asian stocks were poised for a subdued open, weighed down by a risk-off mood on Wall Street ahead of a key inflation report likely to shape the Federal Reserve’s path on interest rates.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-look-subdued-ahead-of-us-inflation-markets-wrap",
    "timestamp": "2025-08-11T22:37:35Z"
  },
  {
    "title": "Idiot thinks Alaska is part of Russia, likely will be by Saturday morning [Dumbass]",
    "description": "Idiot thinks Alaska is part of Russia, likely will be by Saturday morning",
    "link": "https://www.fark.com/comments/13773944/Idiot-thinks-Alaska-is-part-of-Russia-likely-will-be-by-Saturday-morning",
    "timestamp": "2025-08-11T22:36:37Z"
  },
  {
    "title": "Trump has federalized DC’s police force. Now what? | CNN Politics",
    "description": "The Metropolitan Police along with federal agencies tasked with helping curb crime in the nation’s capital are scrambling to figure out roles and strategy following President Donald Trump’s decision to declare a crime emergency and federalize DC’s police forc…",
    "link": "https://www.cnn.com/2025/08/11/politics/trump-federalized-dc-police-now-what",
    "timestamp": "2025-08-11T22:35:53Z"
  },
  {
    "title": "JD Vance: U.S. Working to Arrange Trump-Putin-Zelensky Meeting as Alaska Summit Nears",
    "description": "Vice President JD Vance said Sunday the White House is seeking to arrange a meeting between President Donald Trump, Russian President Vladimir Putin, and Ukrainian President Volodymyr Zelensky to discuss ending the war in Ukraine, as Trump prepares to meet wi…",
    "link": "https://www.breitbart.com/politics/2025/08/11/jd-vance-u-s-working-to-arrange-trump-putin-zelensky-meeting-as-alaska-summit-nears/",
    "timestamp": "2025-08-11T22:34:20Z"
  },
  {
    "title": "Trump meets with Intel CEO after demanding he resign",
    "description": "US President Donald Trump on Monday said he had a \"very interesting\" meeting with the chief of US chip maker Intel, just days after calling for his...",
    "link": "https://finance.yahoo.com/news/trump-meets-intel-ceo-demanding-223416708.html",
    "timestamp": "2025-08-11T22:34:16Z"
  },
  {
    "title": "GOP Congressman Trump Threatened to Primary Is Mulling a Run for Texas AG",
    "description": "Rep. Chip Roy (R-TX) is seriously considering leaving Congress to run for Texas Attorney General, a source familiar with the congressman's thinking confirmed to Mediaite.\nThe post GOP Congressman Trump Threatened to Primary Is Mulling a Run for Texas AG first…",
    "link": "https://www.mediaite.com/politics/gop-congressman-trump-threatened-to-primary-over-budget-battles-is-mulling-a-run-for-texas-ag/",
    "timestamp": "2025-08-11T22:29:20Z"
  },
  {
    "title": "Trump says Intel CEO has ‘amazing story,’ sets Cabinet talks",
    "description": "President Donald Trump said members of his Cabinet would continue discussions with Lip-Bu Tan in the coming days after meeting with the Intel Corp. chief executive officer at the White House on Monday.\n“The meeting was a very interesting one,” Trump said in a…",
    "link": "https://biztoc.com/x/89b967132d2d85c1",
    "timestamp": "2025-08-11T22:29:06Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswxii12.com",
    "link": "https://www.wxii12.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:26:10Z"
  },
  {
    "title": "Europe races to try to influence U.S. position ahead of Trump-Putin talks",
    "description": "Kyiv and its EU allies fear that Trump, keen to claim credit for peace and lucrative deals with Moscow, could cut a one-sided deal with Putin.",
    "link": "https://www.japantimes.co.jp/news/2025/08/12/world/politics/europe-us-trump-putin-talks/",
    "timestamp": "2025-08-11T22:26:00Z"
  },
  {
    "title": "The airline industry's dirty secret: Clean jet fuel failures",
    "description": "An analysis has found that the airline industry's plans to go green before regulators start penalizing them are little more than a pipe dream.",
    "link": "https://www.japantimes.co.jp/environment/2025/08/12/energy/airline-industry-clean-jet-fuel/",
    "timestamp": "2025-08-11T22:24:00Z"
  },
  {
    "title": "‘Jumped’: Watch ABC News anchor recall on-air being attacked 2 blocks from D.C. studio after Trump announces crime crackdown",
    "description": "'Just this morning one of my coworkers said her car was stolen a block away from the bureau. So we can talk about the numbers going down, but crime is happening every single day because we're all experiencing it firsthand while working and living down here'",
    "link": "https://www.wnd.com/2025/08/jumped-watch-abc-news-anchor-recall-air-being/",
    "timestamp": "2025-08-11T22:23:54Z"
  },
  {
    "title": "Is crime in Washington DC 'out of control', as Trump claims?",
    "description": "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
    "link": "https://www.bbc.com/news/articles/c8600x7dnn4o",
    "timestamp": "2025-08-11T22:23:22Z"
  },
  {
    "title": "D.C. Mayor Calls Trump's Police Takeover ‘Unsettling And Unprecedented’",
    "description": "“I’m going to work every day to make sure it’s not a complete disaster,” said Muriel Bowser, who refrained from attacking Trump for infringing on her role.",
    "link": "https://www.huffpost.com/entry/muriel-bowser-trump-dc-police-takeover_n_68942c67e4b0a1fdf7a9e611",
    "timestamp": "2025-08-11T22:23:08Z"
  },
  {
    "title": "Trump-Appointed Judge Deals Legal Blow To The White House",
    "description": "A Trump-appointed judge ruled against the administration, concluding that it improperly withheld congressionally-approved funds.",
    "link": "https://www.newsweek.com/trump-appointed-judge-ruling-national-endowment-democracy-2112048",
    "timestamp": "2025-08-11T22:22:49Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswdsu.com",
    "link": "https://www.wdsu.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:22:30Z"
  },
  {
    "title": "China, U.S. clash at U.N. over Panama Canal",
    "description": "The United States and China clashed over the Panama Canal at the United Nations on Monday, with the U.S. warning that Beijing’s influence over the key waterway could threaten global trade and security and China calling U.S. accusations a pretext to take over …",
    "link": "https://japantoday.com/category/world/china-and-the-us-clash-at-the-un-over-the-panama-canal-a-focus-of-trump%27s-attention",
    "timestamp": "2025-08-11T22:22:00Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowsketv.com",
    "link": "https://www.ketv.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:21:29Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswlwt.com",
    "link": "https://www.wlwt.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:20:32Z"
  },
  {
    "title": "Trump Warns Fascist D.C. Takeover Is Just the Beginning (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nTrump Warns Fascist D.C. Takeover Is Just the Beginning … Donald Trump's usurpation of law enforcement in the nation's capital carried a warning for America's liberal bastions.  —  Speaking at a White House press brie…",
    "link": "https://www.memeorandum.com/250811/p99",
    "timestamp": "2025-08-11T22:20:01Z"
  },
  {
    "title": "Trump’s D.C. Takeover Was Actually Years in the Making",
    "description": "Are the feds really going to take over the capital because of “Big Balls”?",
    "link": "https://slate.com/business/2025/08/donald-trump-washington-dc-takeover-national-guard-metropolitan-police.html",
    "timestamp": "2025-08-11T22:19:56Z"
  },
  {
    "title": "Tom Aspinall on title defense pressure at UFC 321: 'That's when I've had my most devastating performances'",
    "description": "UFC heavyweight champion Tom Aspinall told Uncrowned's Ariel Helwani that pressure has only made him perform better in his MMA career, which could spell trouble for Ciryl Gane at UFC 321.",
    "link": "https://sports.yahoo.com/mma/article/tom-aspinall-on-title-defense-pressure-at-ufc-321-thats-when-ive-had-my-most-devastating-performances-221830727.html",
    "timestamp": "2025-08-11T22:18:30Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowskcra.com",
    "link": "https://www.kcra.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:18:29Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowskmbc.com",
    "link": "https://www.kmbc.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:18:29Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows4029tv.com",
    "link": "https://www.4029tv.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:18:27Z"
  },
  {
    "title": "Trump says Intel CEO has ‘amazing story,’ sets Cabinet talks",
    "description": "\"Mr. Tan and my Cabinet members are going to spend time together, and bring suggestions to me during the next week.\"",
    "link": "https://fortune.com/2025/08/11/trump-intel-ceo-lip-bu-tan-white-house-meeting-cabinet-talks/",
    "timestamp": "2025-08-11T22:18:20Z"
  },
  {
    "title": "Trump’s takeover of the DC police force, briefly explained",
    "description": "President Donald Trump at a press conference at the White House on August 11, 2025.﻿ | Yasin Ozturk/Anadolu via Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting pol…",
    "link": "https://biztoc.com/x/18772d6303284b4c",
    "timestamp": "2025-08-11T22:18:03Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswmur.com",
    "link": "https://www.wmur.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:16:37Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswbaltv.com",
    "link": "https://www.wbaltv.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:16:33Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswlky.com",
    "link": "https://www.wlky.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:16:33Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswisn.com",
    "link": "https://www.wisn.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:16:32Z"
  },
  {
    "title": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windowswesh.com",
    "link": "https://www.wesh.com/article/atlanta-gunman-cdc-windows-attack/65657797",
    "timestamp": "2025-08-11T22:16:31Z"
  },
  {
    "title": "What to Know About Trump’s Washington, D.C., Takeover",
    "description": "President Trump announced he is federalizing local law enforcement in Washington, D.C., and deploying the National Guard to “liberate” the nation’s capital, where crime is at a 30-year record low. Here’s what you need to know.",
    "link": "http://www.thecut.com/article/why-is-trump-deploying-the-national-guard-to-d-c.html",
    "timestamp": "2025-08-11T22:16:27Z"
  },
  {
    "title": "US puts Balochistan armed group in Pakistan on ‘foreign terrorist’ list",
    "description": "The designation comes as US President Donald Trump seeks closer ties with Pakistani government.",
    "link": "https://www.aljazeera.com/news/2025/8/11/us-puts-balochistan-armed-group-in-pakistan-on-foreign-terrorist-list",
    "timestamp": "2025-08-11T22:13:54Z"
  },
  {
    "title": "Fox News Liberal Harold Ford Praises Trump for Sending National Guard to D.C., Says He’s ‘Pleased and Encouraged’",
    "description": "Harold Ford Jr. praised President Donald Trump for deploying the National Guard to Washington, D.C., ostensibly to assist in crimefighting.\nThe post Fox News Liberal Harold Ford Praises Trump for Sending National Guard to D.C., Says He’s ‘Pleased and Encourag…",
    "link": "https://www.mediaite.com/media/tv/fox-news-liberal-harold-ford-praises-trump-for-sending-national-guard-to-d-c-says-hes-pleased-and-encouraged/",
    "timestamp": "2025-08-11T22:13:51Z"
  },
  {
    "title": "After demanding his resignation, Trump meets with Intel CEO",
    "description": "The Trump administration and its conservative allies are pushing for the ouster of Intel CEO Lip-Bu Tan as the MAGA movement advances its authoritarian assault on free enterprise.",
    "link": "https://www.msnbc.com/top-stories/latest/intel-ceo-trump-resignation-lip-bu-tan-rcna224385",
    "timestamp": "2025-08-11T22:12:13Z"
  },
  {
    "title": "Trump signs order extending China tariff truce by 90 days, White House says",
    "description": "The timing of the extension buys crucial time for the seasonal autumn surge of imports for the Christmas season at lower tariff rates.",
    "link": "https://www.japantimes.co.jp/business/2025/08/12/markets/trump-china-tariff-truce-90-days/",
    "timestamp": "2025-08-11T22:12:00Z"
  },
  {
    "title": "Laura Loomer Fires Back at Marjorie Taylor Greene: 'Low Life Degenerate'",
    "description": "Loomer went scorched earth on Greene, calling her a \"whore,\" a \"degenerate\" and questioning her Christian faith.",
    "link": "https://www.newsweek.com/laura-loomer-marjorie-taylor-greene-feud-trump-israel-2112015",
    "timestamp": "2025-08-11T22:10:37Z"
  },
  {
    "title": "China and the US clash at the UN over the Panama Canal, a focus of Trump's attention",
    "description": "The United States and China clashed over the Panama Canal at the United Nations on Monday, with the U.S. warning that Beijing’s influence over the key...",
    "link": "https://www.yahoo.com/news/articles/china-us-clash-un-over-221013733.html",
    "timestamp": "2025-08-11T22:10:13Z"
  },
  {
    "title": "Paramount inks deal to host UFC",
    "description": "Paramount will become the new home to Ultimate Fighting Championship events across the U.S. next year, through a seven-year agreement announced with TKO Group on Monday.",
    "link": "https://www.bostonherald.com/2025/08/11/paramount-inks-deal-to-host-ufc/",
    "timestamp": "2025-08-11T22:09:36Z"
  },
  {
    "title": "Grok Claims It Was Briefly Suspended From X After Accusing Israel of Genocide",
    "description": "Elon Musk's unpredictable chatbot was briefly banned from his social media platform, X, and returned claiming it was silenced for criticizing Israel.",
    "link": "http://www.rollingstone.com/culture/culture-news/grok-suspended-x-israel-genocide-1235405343/",
    "timestamp": "2025-08-11T22:08:50Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks rose Tuesday as investors breathed a sigh of relief over a tamer-than-expected inflation report.",
    "link": "https://www.cnbc.com/2025/08/11/stock-market-today-live-updates-.html",
    "timestamp": "2025-08-11T22:08:10Z"
  },
  {
    "title": "Liberals Claim DC Violent Crime Is Down With Stats Excluding Entire Categories Of Assaults",
    "description": "Media outlets are fact-checking President Donald Trump's concerns about violence in Washington, D.C., by pointing to misleading crime statistics.",
    "link": "https://dailycaller.com/2025/08/11/liberals-dc-violent-crime-down-stats-excluding-categories-assaults/",
    "timestamp": "2025-08-11T22:07:18Z"
  },
  {
    "title": "Student Loan Update: Warning Issued Over Trump's New Plan",
    "description": "RAP was introduced under the \"Big Beautiful Bill\" that President Donald Trump signed into law last month.",
    "link": "https://biztoc.com/x/bbdbcfa80aa6a32d",
    "timestamp": "2025-08-11T22:06:48Z"
  },
  {
    "title": "Man fired 180 shots, breaking 150 windows, in CDC attack",
    "description": "It could take months to clean up the damage at the CDC.",
    "link": "https://www.denverpost.com/2025/08/11/cdc-campus-shooting/",
    "timestamp": "2025-08-11T22:06:22Z"
  },
  {
    "title": "Man fired 180 shots, breaking 150 windows, in CDC attack",
    "description": "It could take months to clean up the damage at the CDC.",
    "link": "https://www.bostonherald.com/2025/08/11/cdc-campus-shooting/",
    "timestamp": "2025-08-11T22:06:22Z"
  },
  {
    "title": "Trump’s Presidential Jackpot",
    "description": "From the daily newsletter: the staggering total, seven months in. Plus: Eric Adams the real internet star of the mayoral race; and James Baldwin’s lovers.",
    "link": "https://www.newyorker.com/newsletter/the-daily/trumps-presidential-jackpot",
    "timestamp": "2025-08-11T22:00:00Z"
  },
  {
    "title": "Trump’s takeover of the DC police force, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump announced today that he will fe…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/457579/trump-washington-dc-police-national-guard-takeover-crime",
    "timestamp": "2025-08-11T21:59:38Z"
  }
]