[
  {
    "title": "Supreme Court rejects toy company's push for a quick decision on Trump's tariffs",
    "description": "The Supreme Court on Friday rejected a push from an Illinois toy company asking for a quick decision on the legality of President Donald Trump’s tariffs...",
    "link": "https://www.yahoo.com/news/supreme-court-rejects-toy-companys-184914029.html",
    "timestamp": "2025-06-20T18:49:14Z"
  },
  {
    "title": "62 Percent of Democrats Want Current Party Leaders to Be Replaced, Poll Finds",
    "description": "Democrats recently ousted David Hogg from leadership after he criticized the party for complacency.",
    "link": "https://truthout.org/articles/62-percent-of-democrats-want-current-party-leaders-to-be-replaced-poll-finds/",
    "timestamp": "2025-06-20T18:49:13Z"
  },
  {
    "title": "Can NATO Keep It Together?",
    "description": "Nine thinkers on next week’s summit and the alliance’s uncertain future.",
    "link": "http://foreignpolicy.com/2025/06/20/nato-summit-hague-trump-russia-ukraine-alliance-defense-spending/",
    "timestamp": "2025-06-20T18:49:10Z"
  },
  {
    "title": "Senate parliamentarian deals blow to GOP plan to gut consumer bureau in tax bill",
    "description": "It signals a tough road ahead as GOP leaders push toward a vote next week.",
    "link": "https://www.bostonherald.com/2025/06/20/congress-tax-bill/",
    "timestamp": "2025-06-20T18:46:56Z"
  },
  {
    "title": "Rod Stewart Explains Why He No Longer Considers Donald Trump a Friend",
    "description": "Rod Stewart says his friendship with Donald Trump over. The 80-year-old British singer and the 79-year-old President used to be friendly and often hung out together as they’re neighbors in Florida. However, in a new interview, Rod said that he no longer consi…",
    "link": "https://www.justjared.com/2025/06/20/rod-stewart-explains-why-he-no-longer-considers-donald-trump-a-friend/",
    "timestamp": "2025-06-20T18:43:02Z"
  },
  {
    "title": "Illegal immigrants not showing up to work for fear of ICE raids: ‘It’s sheer panic’",
    "description": "A crackdown on undocumented workers by the Trump administration has sent shockwaves through the nation’s farms, factories and food supply chains — prompting warnings of worker shortages and higher prices. Texas Agriculture Commissioner Sid Miller sounded the …",
    "link": "https://freerepublic.com/focus/f-news/4324307/posts",
    "timestamp": "2025-06-20T18:42:42Z"
  },
  {
    "title": "Opinion: We needed to get rid of the dairy cartel, not sanctify it in law",
    "description": "Supply management complicates trade policy at a crucial time and blocks interprovincial trade, which the Liberals say they want to encourage",
    "link": "https://financialpost.com/opinion/we-needed-to-get-rid-of-the-dairy-cartel-not-sanctify-it-in-law",
    "timestamp": "2025-06-20T18:42:35Z"
  },
  {
    "title": "Senate parliamentarian deals blow to GOP plan to gut consumer bureau in tax bill",
    "description": "Republicans have suffered a sizable setback on one key aspect of President Donald Trump's big bill after their plans to gut the Consumer Finance Protection...",
    "link": "https://www.yahoo.com/news/senate-parliamentarian-deals-blow-gop-184050499.html",
    "timestamp": "2025-06-20T18:40:50Z"
  },
  {
    "title": "Mag 5.1 quake hits Iran...",
    "description": "Mag 5.1 quake hits Iran...\r\n\n \n \n \n (Top headline, 7th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TEL AVIV: 'We can't sleep underground forever'...\r\nIDF chief hints at prolonged war...\r\nHuge Crowds Rally Across Middle East, Venting Anger at Israel...\r\nERDOGAN:…",
    "link": "https://www.the-sun.com/news/14527445/earthquake-strikes-iran-israel-fordow/",
    "timestamp": "2025-06-20T18:40:36Z"
  },
  {
    "title": "Influential Southern Dem Who Boosted Biden in 2020 Backs Andrew Cuomo for NYC Mayor",
    "description": "Rep. James Clyburn (D-SC), often called the “kingmaker” of the South, endorsed former New York Gov. Andrew Cuomo for mayor of New York City.\nThe post Influential Southern Dem Who Boosted Biden in 2020 Backs Andrew Cuomo for NYC Mayor appeared first on Breitba…",
    "link": "https://www.breitbart.com/politics/2025/06/20/influential-southern-dem-who-boosted-biden-2020-backs-cuomo-nyc-mayor/",
    "timestamp": "2025-06-20T18:40:23Z"
  },
  {
    "title": "Fed starts to split on when to begin cutting US interest rates",
    "description": "Pressure from Donald Trump and concerns over economic growth open schism among central bank’s officials",
    "link": "https://biztoc.com/x/13f5b3f52e61e17d",
    "timestamp": "2025-06-20T18:38:47Z"
  },
  {
    "title": "Judge orders Columbia University protester Mahmoud Khalil freed from immigration detention center",
    "description": "Khalil was the first arrest under President Donald Trump's crackdown on students who joined campus protests against Israel's devastating war in Gaza.",
    "link": "https://www.pbs.org/newshour/politics/judge-orders-columbia-university-protester-mahmoud-khalil-freed-from-immigration-detention-center",
    "timestamp": "2025-06-20T18:36:44Z"
  },
  {
    "title": "US Weighs Deeper Involvement in Israel’s Illegal Attacks Against Iran",
    "description": "Trump says he will decide within two weeks whether to join Israel’s war on Iran.",
    "link": "https://truthout.org/articles/us-weighs-deeper-involvement-in-israels-illegal-attacks-against-iran/",
    "timestamp": "2025-06-20T18:35:49Z"
  },
  {
    "title": "Judge blocks Trump’s attempt to withhold transportation funds",
    "description": "A federal judge has blocked the Trump administration from withholding billions of dollars in transportation funds from states that don't agree to participate in some immigration enforcement actions.",
    "link": "https://www.wcvb.com/article/federal-judge-blocks-trump-transportation-funds/65125127",
    "timestamp": "2025-06-20T18:35:16Z"
  },
  {
    "title": "Wyoming stablecoin commission names Aptos highest-ranking blockchain",
    "description": "Aptos tops Wyoming’s blockchain shortlist for its WYST stablecoin. As the GENIUS Act advances, stablecoins gain traction with lawmakers and Fortune 500 firms.",
    "link": "https://cointelegraph.com/news/wyoming-stablecoin-pilot-aptos-sei",
    "timestamp": "2025-06-20T18:35:00Z"
  },
  {
    "title": "No Matter How Much The Left Wants To Riot, Americans Still Support ICE And Want Deportations",
    "description": "No matter how much left-wing agitators want to riot to oppose enforcing immigration law, the American people still support Immigration and Customs Enforcement (ICE) officers and deporting illegals. That is the takeaway from a new Harvard/Harris poll taken in …",
    "link": "https://freerepublic.com/focus/f-news/4324304/posts",
    "timestamp": "2025-06-20T18:34:54Z"
  },
  {
    "title": "The 9th Circuit Rejects Trump's Audacious Claim That He Can Use the National Guard However He Likes",
    "description": "Although the appeals court said the president probably complied with the law he invoked to justify his California deployment, it emphasized that such decisions are subject to judicial review.",
    "link": "https://reason.com/2025/06/20/the-9th-circuit-rejects-trumps-audacious-claim-that-he-can-use-the-national-guard-however-he-likes/",
    "timestamp": "2025-06-20T18:33:14Z"
  },
  {
    "title": "Trump tariff challenge: Supreme Court won't speed decision for toy importer",
    "description": "The high court denied a request by a family-owned toy company to expedite a review of their tariff challenge.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/20/trump-toy-tariffs-supreme-court/84289787007/",
    "timestamp": "2025-06-20T18:32:55Z"
  },
  {
    "title": "Savona: 'Le criptovalute come il campo dei miracoli di Pinocchio'",
    "description": "Allarme Consob. Dal risiko 54 esposti. Norme Ue per golden power (ANSA)",
    "link": "https://www.ansa.it/sito/notizie/economia/aziende/2025/06/20/savona-le-criptovalute-come-il-campo-dei-miracoli-di-pinocchio_1ab84140-7594-4bc5-b355-55fa02ed1f17.html",
    "timestamp": "2025-06-20T18:32:46Z"
  },
  {
    "title": "Israel-Iran Conflict: Negotiations With European Leaders Fall Flat As Strikes Continue (Live Updates)",
    "description": "The White House says Trump will decide how to respond to Iran within two weeks.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/06/20/israel-iran-conflict-negotiations-with-european-leaders-fall-flat-as-strikes-continue-live-updates/",
    "timestamp": "2025-06-20T18:32:30Z"
  },
  {
    "title": "With Enhanced Subsidies Set To Expire, Consumers Could Face Higher Obamacare Costs",
    "description": "Get our weekly newsletter, The Week in Brief, featuring a roundup of our original coverage, Fridays at 2 p.m. ET.",
    "link": "https://kffhealthnews.org/news/article/the-week-in-brief-obamacare-insurance-costs-could-rise-subsidies-expiring/",
    "timestamp": "2025-06-20T18:30:00Z"
  },
  {
    "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
    "description": "Stablecoins are enjoying a moment in U.S. policy circles as the Senate just passed a regulation bill with major bipartisan numbers. As that moment approached, President Donald Trump and his family apparently offloaded about 20% of their stake in the parent co…",
    "link": "https://biztoc.com/x/e303445e983cd41e",
    "timestamp": "2025-06-20T18:27:25Z"
  },
  {
    "title": "China Tries Getting Rich In America’s Backyard",
    "description": "Some major Chinese companies are attempting to gain a foothold in new markets such as Brazil, the New York Times reported on Friday.",
    "link": "https://dailycaller.com/2025/06/20/chinese-companies-getting-rich-brazil/",
    "timestamp": "2025-06-20T18:26:48Z"
  },
  {
    "title": "JUST IN: Pro-Palestinian Activist Mahmoud Khalil Ordered Out Of Detention",
    "description": "A federal judge announced Friday that he will order the release of Palestinian activist and Columbia University student Mahmoud Khalil. Khalil was first detained by immigration authorities at his campus apartment in March. Officials within President Donald Tr…",
    "link": "https://www.mediaite.com/media/news/just-in-pro-palestinian-activist-mahmoud-khalil-ordered-out-of-detention/",
    "timestamp": "2025-06-20T18:26:32Z"
  },
  {
    "title": "The US can end Iran conflict with one call, official from Iran’s presidency says | CNN",
    "description": "Diplomacy with Iran can “easily” be started again if US President Donald Trump orders Israel’s leadership to stop its strikes on Iran, Majid Farahani, an official with the Iranian presidency told CNN on Friday.",
    "link": "https://www.cnn.com/2025/06/20/middleeast/iran-israel-conflict-trump-intl-latam",
    "timestamp": "2025-06-20T18:26:25Z"
  },
  {
    "title": "9th Circuit Rules In Favor Of Trump Administration Over National Guard Deployment",
    "description": "Donald Trump can continue to control the National Guard in California for the time being.",
    "link": "https://www.kqed.org/news/12045192/9th-circuit-rules-in-favor-of-trump-administration-over-national-guard-deployment",
    "timestamp": "2025-06-20T18:22:28Z"
  },
  {
    "title": "Trump hits those supplying Iranian military with sanctions",
    "description": "8 companies targeted for their involved in 'procurement' for rogue regime's defense",
    "link": "https://www.wnd.com/2025/06/trump-hits-those-supplying-iranian-military-sanctions/",
    "timestamp": "2025-06-20T18:22:05Z"
  },
  {
    "title": "Federal judge will order Mahmoud Khalil released from immigration detention",
    "description": "Lawyers for the Columbia graduate had asked a federal judge to immediately release him on bail from a Louisiana jail.",
    "link": "https://nypost.com/2025/06/20/us-news/federal-judge-will-order-mahmoud-khalil-released-from-immigration-detention/",
    "timestamp": "2025-06-20T18:22:04Z"
  },
  {
    "title": "Democrats Chances of Flipping Virginia as Spanberger Gets Fundraising Boost",
    "description": "Democrat Abigail Spanberger is outraising Republican Lt. Governor Winsome Earle-Sears in the critical gubernatorial race.",
    "link": "https://www.newsweek.com/democrats-chances-flipping-virginia-abigail-spanberger-fundraising-boost-2088558",
    "timestamp": "2025-06-20T18:21:23Z"
  },
  {
    "title": "A Tale of Yaay! and Hmm: Is India’s growth story impressive, or disappointing — or a bit of both?",
    "description": "India's economic rise to the 5th largest globally is tempered by its low per-capita ranking and unmet $5 trillion GDP target. While India shows promise in AI and manufacturing, it lags in investment and R&D compared to China and the US. Despite its global pre…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/a-tale-of-yaay-and-hmm-is-indias-growth-story-impressive-or-disappointing-or-a-bit-of-both/articleshow/121981056.cms",
    "timestamp": "2025-06-20T18:19:39Z"
  },
  {
    "title": "'Tariff stacking' is creating problems for businesses",
    "description": "Imports from China are the most heavily affected",
    "link": "https://theweek.com/business/economy/tariff-stacking-businesses-trump-china",
    "timestamp": "2025-06-20T18:19:09Z"
  },
  {
    "title": "Man Arrested After Ohio Rep. Max Miller Reports He Was ‘Run Off the Road’",
    "description": "The suspect allegedly threatened the Congressmen with antisemitic slurs and called for the death of Israel and the lawmaker's family.",
    "link": "https://time.com/7296278/rep-max-miller-threat-arrest/",
    "timestamp": "2025-06-20T18:18:28Z"
  },
  {
    "title": "Iran Could Still Roil Energy Markets",
    "description": "The global economic impact of the Israel-Iran war has been contained—so far.",
    "link": "http://foreignpolicy.com/2025/06/20/iran-israel-oil-global-economy/",
    "timestamp": "2025-06-20T18:18:08Z"
  },
  {
    "title": "FBI increases surveillance of Iran-backed operatives in US: source",
    "description": "The FBI is increasing surveillance of Iran-backed operatives in the U.S. as President Donald Trump considers getting involved in the conflict between Tehran and Israel.",
    "link": "https://www.foxnews.com/us/fbi-increases-surveillance-iran-backed-operatives-us-source",
    "timestamp": "2025-06-20T18:18:07Z"
  },
  {
    "title": "Trump to Decide on US Strike in Iran Within Two Weeks",
    "description": "White House press secretary Karoline Leavitt quotes a statement from Trump saying he will make a decision on potential strikes on Iran “within the next two weeks.” US President Donald Trump signaled he would give diplomacy a chance before deciding whether to …",
    "link": "https://biztoc.com/x/ac88f6f0d2c6c464",
    "timestamp": "2025-06-20T18:16:31Z"
  },
  {
    "title": "Putin warns about World War III, points to war with Ukraine, Israel-Iran conflict in Middle East",
    "description": "Vladimir Putin expressed worry about a possible World War III. He cited conflicts in Ukraine and the Middle East. Putin mentioned talks with Benjamin Netanyahu, Masoud Pezeshkian, and Donald Trump. He criticized Western dominance and promoted a balanced world…",
    "link": "https://economictimes.indiatimes.com/news/international/us/putin-warns-about-world-war-iii-points-to-ukraine-war-and-israel-iran-conflict-middle-in-east/articleshow/121980947.cms",
    "timestamp": "2025-06-20T18:16:13Z"
  },
  {
    "title": "Hank Johnson Posts Cringe Video Performance of Anti-Trump Song",
    "description": "June is Black Music Month. This year, I decided to come back with another jam session for you all. Here is my rendition of \"Hey Joe\" by the Godfather of Rock, Jimi Hendrix.",
    "link": "https://freerepublic.com/focus/f-bloggers/4324299/posts",
    "timestamp": "2025-06-20T18:16:07Z"
  },
  {
    "title": "Can MAGA survive a US war on Iran?",
    "description": "Trump's wavering sparks debate about 'America First'",
    "link": "https://theweek.com/politics/maga-survive-us-war-iran",
    "timestamp": "2025-06-20T18:15:02Z"
  },
  {
    "title": "US judge orders release of pro-Palestinian activist Khalil",
    "description": "NEW YORK: A US judge ordered on Friday (Jun 20) that Columbia University graduate Mahmoud Khalil be released from immigration custody, a major victory for rights groups that challenged what they called the",
    "link": "https://www.channelnewsasia.com/world/us-judge-orders-release-pro-palestinian-activist-khalil-5194821",
    "timestamp": "2025-06-20T18:14:09Z"
  },
  {
    "title": "Tel Aviv Journalist Reveals Aftermath of Iranian Missile Strike on Her Home: 'I'm Deeply Disturbed'",
    "description": "An American journalist living in Tel Aviv revealed the destruction left behind after an Iranian missile struck her apartment as the war continues.",
    "link": "https://www.ibtimes.com/tel-aviv-journalist-reveals-aftermath-iranian-missile-strike-her-home-im-deeply-disturbed-3776368",
    "timestamp": "2025-06-20T18:13:13Z"
  },
  {
    "title": "Almost Half of Democrats Say a Third Party Is Necessary—Poll",
    "description": "Nearly half of Democrats surveyed in a new YouGov poll believe a third party is necessary in the U.S.",
    "link": "https://www.newsweek.com/almost-half-democrats-say-third-party-necessary-poll-2088491",
    "timestamp": "2025-06-20T18:12:31Z"
  },
  {
    "title": "Stellantis Evaluates Maserati's Future, Including Potential Sale -- Reuters",
    "description": "Stellantis has hired McKinsey to assess Maserati and Alfa Romeo strategies",
    "link": "https://finance.yahoo.com/news/stellantis-evaluates-maseratis-future-including-181151607.html",
    "timestamp": "2025-06-20T18:11:51Z"
  },
  {
    "title": "Musk labels key Trump aide 'a snake' as White House feud simmers",
    "description": "Billionaire Elon Musk on Wednesday lashed out at a key aide to President Donald Trump who was rumored to have played a role in contributing to the feud that broke out between the CEO and the president. Musk responded to a report by the New York Post that said…",
    "link": "https://freerepublic.com/focus/f-news/4324298/posts",
    "timestamp": "2025-06-20T18:11:39Z"
  },
  {
    "title": "Religious Liberty Commission chair shares outlook after first hearing",
    "description": "Texas Lt. Gov. Dan Patrick, chair of the United States’ recently created Religious Liberty Commission, talks with Raymond Arroyo on “The World Over” on June 19, 2025. / Credit: “The World Over with Raymond Arroyo”/Screenshot\n\nWashington, D.C. Newsroom, Jun 20…",
    "link": "https://www.catholicnewsagency.com/news/264901/religious-liberty-commission-chair-shares-outlook-after-first-hearing",
    "timestamp": "2025-06-20T18:11:00Z"
  },
  {
    "title": "Supreme Court rejects toy makers' request to fast track challenge to Trump's tariffs",
    "description": "The Supreme Court on Friday rejected a request from two toy companies to expedite their challenge to President Donald Trump’s tariffs",
    "link": "https://www.nbcnews.com/business/consumer/supreme-court-rejects-fast-track-trump-tariff-challenge-rcna214155",
    "timestamp": "2025-06-20T18:10:15Z"
  },
  {
    "title": "Harry Reid-Appointed Official Puts Key Parts Of Trump Bill On Chopping Block",
    "description": "Key parts of Trump's \"big, beautiful bill\" on the chopping block — and more provisions could be in danger of being struck due to one powerful unelected official",
    "link": "https://dailycaller.com/2025/06/20/elizabeth-macdonough-big-beautiful-bill-chopping-block/",
    "timestamp": "2025-06-20T18:09:18Z"
  },
  {
    "title": "Iran Peace Talks Last Over Four Hours, Euro Ministers Urge Tehran to Talk to Washington",
    "description": "The UK, France, and Germany met with Iran on Friday and said they'd urged Tehran to open dialogue with the United States for peace.\nThe post Iran Peace Talks Last Over Four Hours, Euro Ministers Urge Tehran to Talk to Washington appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/06/20/iran-peace-talks-last-over-four-hours-euros-urge-tehran-to-talk-to-u-s/",
    "timestamp": "2025-06-20T18:09:15Z"
  },
  {
    "title": "Stephen Colbert floats masked ICE agents possibly getting shot in states with 'Stand Your Ground' laws",
    "description": "Stephen Colbert and Rep. Maxwell Frost discussed dangers of masked ICE agents in \"Stand Your Ground\" states on Thursday, with Frost calling deportations \"taxpayer-funded kidnapping.\"",
    "link": "https://www.foxnews.com/media/stephen-colbert-floats-masked-ice-agents-possibly-getting-shot-states-stand-your-ground-laws",
    "timestamp": "2025-06-20T18:09:08Z"
  },
  {
    "title": "News\nUnearthed emails reveal Biden regime’s sick obsession with jailing President Trump…",
    "description": "Remember when the United States used to mock banana republics for jailing their political opponents? Well, thanks to Joe Biden’s America, we became exactly that. Ever since President Trump announced he was running in 2024, the radical left pulled every filthy…",
    "link": "https://freerepublic.com/focus/f-bloggers/4324297/posts",
    "timestamp": "2025-06-20T18:08:57Z"
  },
  {
    "title": "Chernobyl-like nuclear warnings, Fattah missile strikes, and an ‘Islamic Bomb’ have left the Middle East on edge",
    "description": "Israel's strikes have devastated Iran's military leadership and nuclear assets, while Iran responds with advanced missile fire and nuclear threats. The conflict has left hundreds dead, sparked fears of wider escalation, and drawn in regional actors including …",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-chernobyl-like-nuclear-warnings-fattah-missile-strikes-and-an-islamic-bomb-have-left-the-middle-east-on-edge/articleshow/121980213.cms",
    "timestamp": "2025-06-20T18:08:01Z"
  },
  {
    "title": "European Leaders Seek Diplomacy in Talks With Iran as Trump Weighs Strike",
    "description": "European ministers met with an Iranian delegation in Geneva in hopes of reaching an agreement over the conflict between Israel and Iran.",
    "link": "https://time.com/7296249/iran-israel-europe-talks/",
    "timestamp": "2025-06-20T18:06:46Z"
  },
  {
    "title": "US Supreme Court Lets Fuel Producers Challenge California Emissions Standards",
    "description": "The U.S. Supreme Court sided on Friday with fuel producers that had opposed California’s standards for vehicle emissions and electric cars under a federal air pollution law, agreeing that their legal challenge to the mandates should not have been dismissed. …",
    "link": "https://www.insurancejournal.com/news/west/2025/06/20/828649.htm",
    "timestamp": "2025-06-20T18:04:35Z"
  },
  {
    "title": "The Scoop: The meteoric rise of Labubu - PR Daily",
    "description": "Plus: The truth behind CapCut’s new terms of service; casual restaurants communicate updates to old-school audiences.",
    "link": "https://www.prdaily.com/the-scoop-the-meteoric-rise-of-labubu/",
    "timestamp": "2025-06-20T18:04:26Z"
  },
  {
    "title": "US judge orders release of Palestine advocate Mahmoud Khalil",
    "description": "This is a breaking news story.",
    "link": "https://www.aljazeera.com/news/2025/6/20/us-judge-orders-release-of-palestine-advocate-mahmoud-khalil",
    "timestamp": "2025-06-20T18:03:08Z"
  },
  {
    "title": "Florida Attorney General Proposes Sending Migrants to Swamp Pokey Known as ‘Alligator Alcatraz’",
    "description": "Florida Attorney General James Uthmeier has proposed sending detained migrants to a facility deep in the Florida Everglades he calls \"Alligator Alcatraz.\"\nThe post Florida Attorney General Proposes Sending Migrants to Swamp Pokey Known as ‘Alligator Alcatraz’…",
    "link": "https://www.mediaite.com/media/news/florida-attorney-general-proposes-sending-migrants-to-swamp-pokey-known-as-alligator-alcatraz/",
    "timestamp": "2025-06-20T18:03:00Z"
  },
  {
    "title": "Judge says he will order Columbia University protester Mahmoud Khalil freed from detention",
    "description": "Judge Michael Farbiarz made the ruling Friday.",
    "link": "https://www.bostonherald.com/2025/06/20/mahmoud-khalil-freed-detention/",
    "timestamp": "2025-06-20T18:02:49Z"
  },
  {
    "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
    "description": "Based on close readings of World Liberty Financial's website disclosures, the family of President Donald Trump may have dropped out of its majority holding.",
    "link": "https://www.coindesk.com/policy/2025/06/20/as-u-s-stablecoins-see-wave-of-good-news-trumps-may-have-sold-platform-stake",
    "timestamp": "2025-06-20T18:02:32Z"
  },
  {
    "title": "The Metternich of the Bronx",
    "description": "Witkoff’s diplomacy has spectacularly failed, but he is likely to continue to play a major role.",
    "link": "http://foreignpolicy.com/2025/06/20/steve-witkoff-trump-putin-russia-war-negotiations-diplomacy-peace-cease-fire-ukraine-iran-israel-hamas/",
    "timestamp": "2025-06-20T18:00:47Z"
  },
  {
    "title": "Fed's Waller Says Fed Could Begin Cutting Rates in July",
    "description": "Federal Reserve Governor Christopher Waller said Friday that the central bank could begin lowering interest rates as soon as next month, arguing that inflation has cooled and that policymakers should not wait for the labor market to weaken before acting.\nThe …",
    "link": "https://www.breitbart.com/economy/2025/06/20/feds-waller-says-fed-could-begin-cutting-rates-in-july/",
    "timestamp": "2025-06-20T18:00:43Z"
  },
  {
    "title": "Judge Frees Mahmoud Khalil in Biggest Blow to Trump Yet",
    "description": "Mahmoud Khalil is finally being released from ICE custody, more than three months after he was detained for his involvement in Columbia University’s pro-Palestine protests.  \r\nIn a hearing Friday, U.S. District Judge Michael Farbiarz found that Khalil did not…",
    "link": "https://newrepublic.com/post/197064/judge-frees-mahmoud-khalil-donald-trump-free-speech-gaza",
    "timestamp": "2025-06-20T18:00:37Z"
  },
  {
    "title": "The Mamdani Coalition",
    "description": "In June 2020—three months after the Covid-19 pandemic shut down New York City, killing at least 18,600 residents to that point, in the midst of the Black Lives Matter movement, the biggest social uprising in the city’s history—a wave of democratic socialist p…",
    "link": "http://www.nybooks.com/online/2025/06/20/the-zohran-mamdani-coalition/",
    "timestamp": "2025-06-20T18:00:18Z"
  },
  {
    "title": "“I Hate to Hurt Your Ears”: Rep. Hank Johnson Posts Cringe Video Performance of Anti-Trump Song",
    "description": "70-year-old Rep.\nThe post “I Hate to Hurt Your Ears”: Rep. Hank Johnson Posts Cringe Video Performance of Anti-Trump Song appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/i-hate-hurt-your-ears-rep-hank-johnson/",
    "timestamp": "2025-06-20T18:00:01Z"
  },
  {
    "title": "Hurricane Hunter Flights Improve Hurricane Forecasts, But Trump Budget Cuts Could Threaten Them",
    "description": "NOAA’s Hurricane Hunter airplane missions significantly increase the accuracy of hurricane forecasts, but President Trump’s proposed budget cuts jeopardize the data-gathering efforts and other forecasting tools",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/06/20/study-noaa-hurricane-hunter-flights-significantly-improve-forecasts-00413329",
    "timestamp": "2025-06-20T18:00:00Z"
  },
  {
    "title": "Israel warns of 'prolonged war' with Iran, as missile strikes Haifa",
    "description": "Eight days after Israel launched its first strikes, military chief Eyal Zamir warned of a lengthy and \"complex campaign\".",
    "link": "https://www.abc.net.au/news/2025-06-21/israel-prolonged-war-iran/105444640",
    "timestamp": "2025-06-20T17:59:48Z"
  },
  {
    "title": "Kristi Noem Showcases 'Worst of the Worst' Illegals Arrested: 12 Different Sex Offenses Against Children",
    "description": "Department of Homeland Security Secretary Kristi Noem highlighted some of the illegal immigrants detained by immigration enforcement over the past several days, showcasing their crimes which include \"12 different sex offenses against children.\"\nThe post Krist…",
    "link": "https://www.breitbart.com/politics/2025/06/20/kristi-noem-showcases-worst-of-the-worst-illegals-arrested-12-different-sex-offenses-against-children/",
    "timestamp": "2025-06-20T17:59:07Z"
  },
  {
    "title": "Mexico's Sheinbaum Claims Drop In Homicides, Experts Dubious",
    "description": "Mexican President Claudia Sheinbaum has claimed a sharp drop in homicides in the first eight months of her term, but analysts wonder whether the figures are trustworthy and, if so, can keep coming down.",
    "link": "https://www.ibtimes.com/mexicos-sheinbaum-claims-drop-homicides-experts-dubious-3776366",
    "timestamp": "2025-06-20T17:57:09Z"
  },
  {
    "title": "Man Who Came to US as Young Child Faces Deportation After Over 30 Years",
    "description": "Karem Tadros, who was born in Egypt, has lived in New Jersey for over three decades and now faces deportation to a third country.",
    "link": "https://www.newsweek.com/man-faces-deportation-after-30-years-2088572",
    "timestamp": "2025-06-20T17:57:08Z"
  },
  {
    "title": "Americans Want to Force Presidents to Release Health Records After Trump’s Bonkers Golf Brag Memo - NewsBreak",
    "description": "Andrew Harnik / Getty Images The vast majority of Americans believe the president should be legally required to disclose their medical records to the publi",
    "link": "https://www.newsbreak.com/share/4062338411848-americans-want-to-force-presidents-to-release-health-records-after-trump-s-bonkers-golf-brag-memo?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NTA0NDIxNjE3ODg%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1750442161&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.25.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v7%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v1%2Cns_foryou_model_exp_25q2_v2-v8",
    "timestamp": "2025-06-20T17:56:59Z"
  },
  {
    "title": "Syria Makes First International Bank Transfers Since Fall of Assad",
    "description": "Syrian central bank governor Abdelkader Husriyeh said on Thursday the new government reached a milestone by performing its first international bank transfer using the SWIFT system.\nThe post Syria Makes First International Bank Transfers Since Fall of Assad ap…",
    "link": "https://www.breitbart.com/middle-east/2025/06/20/syria-makes-first-international-bank-transfers-since-fall-of-assad/",
    "timestamp": "2025-06-20T17:54:31Z"
  },
  {
    "title": "Turkey's Erdogan: More Migrants and 'Nuclear Leakage' Could Reach Europe if Iran Regime Falls",
    "description": "Turkish strongman Recep Tayyip Erdogan reportedly warned in a conversation with German Chancellor Friedrich Merz on Friday that Europe could face a new mass migration wave and \"nuclear leakage\" if the conflict between Iran and Israel escalates.\nThe post Turke…",
    "link": "https://www.breitbart.com/middle-east/2025/06/20/turkeys-erdogan-more-migrants-and-nuclear-leakage-could-reach-europe-if-iran-regime-falls/",
    "timestamp": "2025-06-20T17:54:24Z"
  },
  {
    "title": "The Daily Show's Head Writer Explains Why They Had To Completely Change How They Do Callback Jokes",
    "description": "It makes sense when you think about it.",
    "link": "https://www.cinemablend.com/interviews/the-daily-shows-head-writer-explains-why-completely-change-how-they-do-callback-jokes",
    "timestamp": "2025-06-20T17:48:55Z"
  },
  {
    "title": "Americans Want to Force Presidents to Release Health Records After Trump’s Bonkers Golf Brag Memo - NewsBreak",
    "description": "Andrew Harnik / Getty Images The vast majority of Americans believe the president should be legally required to disclose their medical records to the publi",
    "link": "https://www.newsbreak.com/share/4062338411848-americans-want-to-force-presidents-to-release-health-records-after-trump-s-bonkers-golf-brag-memo?s=a2&amp;share_destination_id=MTc0NjgxNTIwLTE3NTA0NDE2MTkyNTU%3D&amp;pd=0BowdsUz&amp;hl=en_US&amp;send_time=1750441619&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.23.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q2-control",
    "timestamp": "2025-06-20T17:48:55Z"
  },
  {
    "title": "Supreme Court Upholds Tennessee’s Discriminatory Ban on Transgender Health Care for Youth in Skrmetti Ruling | GLAAD",
    "description": "The U.S. Supreme Court on Wednesday, June 18, issued a decision in U.S. v. Skrmetti, a closely watched case concerning the constitutionality of state-level bans on health care for transgender people.",
    "link": "https://glaad.org/supreme-court-skrmetti/",
    "timestamp": "2025-06-20T17:47:16Z"
  },
  {
    "title": "Americans Want to Force Presidents to Release Health Records After Trump’s Bonkers Golf Brag Memo - NewsBreak",
    "description": "Andrew Harnik / Getty Images The vast majority of Americans believe the president should be legally required to disclose their medical records to the publi",
    "link": "https://www.newsbreak.com/share/4062338411848-americans-want-to-force-presidents-to-release-health-records-after-trump-s-bonkers-golf-brag-memo?s=a2&amp;share_destination_id=MTc0NjgxNTIwLTE3NTA0NDE1NzEyODc%3D&amp;pd=0BowdsUz&amp;hl=en_US&amp;send_time=1750441571&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.23.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-control",
    "timestamp": "2025-06-20T17:47:09Z"
  },
  {
    "title": "Texan Republicans Tip Off State Department That Austin Has Nuclear Weapons",
    "description": "WASHINGTON, D.C. — According to sources within the Trump administration, Texas Republicans tipped off the State Department about the city of Austin being in possession of nuclear weapons. Senator Ted Cruz of Texas was seen meeting with Secretary of State Marc…",
    "link": "https://freerepublic.com/focus/f-chat/4324292/posts",
    "timestamp": "2025-06-20T17:45:30Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.ketv.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:44:50Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.wcvb.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:44:27Z"
  },
  {
    "title": "Gold set for weekly loss as U.S. delays decision on Israel-Iran conflict",
    "description": "Gold prices were steady on Friday and poised for a weekly loss after U.S. President Donald Trump delayed a decision on entering the Israel-Iran conflict.\nSpot gold was little changed at US$3,369.63 an ounce, as of 11:57 a.m. ET, its lowest since June 12, whil…",
    "link": "https://biztoc.com/x/2332e9495b42823a",
    "timestamp": "2025-06-20T17:43:42Z"
  },
  {
    "title": "Europe Admits \"Trump Is Right\", China Is The Problem As Beijing Unleashes Global EV Dump",
    "description": "Europe Admits \"Trump Is Right\", China Is The Problem As Beijing Unleashes Global EV Dump\n \nWhile Donald Trump has been warning about China's mercenary, mercantilist trade practices for much of the past decade - 'ripping us off' and hollowing out the middle cl…",
    "link": "https://biztoc.com/x/2fd48985c2b3a6b2",
    "timestamp": "2025-06-20T17:43:17Z"
  },
  {
    "title": "Supreme Court rejects fast track of Trump tariff challenge by toy companies",
    "description": "Legal challenges to President Donald Trump’s April 2 tariffs have introduced uncertainty around a central piece of his trade agenda.",
    "link": "https://biztoc.com/x/275915accb285ce4",
    "timestamp": "2025-06-20T17:43:12Z"
  },
  {
    "title": "Supreme Court Hands Donald Trump a Legal Win Over Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Supreme Court on Friday declined to fast-track a legal challenge to former President Donald Trump's tariffs, rejecting a motion to expedite the case and delaying consideration despite a push from affected …",
    "link": "https://biztoc.com/x/63a602e1e1fac3c3",
    "timestamp": "2025-06-20T17:43:10Z"
  },
  {
    "title": "Trump’s two-week delay on Iran strike decision leaves Israel in limbo | CNN",
    "description": "US President Donald Trump’s self-imposed two-week delay to decide whether to strike Iran has sparked confusion and conjecture in Israel.",
    "link": "https://www.cnn.com/2025/06/20/middleeast/trump-iran-strike-delay-israel-latam-intl",
    "timestamp": "2025-06-20T17:42:08Z"
  },
  {
    "title": "Thanks, Guv for helping us all understand these federal cuts (Letters)",
    "description": "\"Thank you to the governor for collating and publishing the information ... What has been published to date on the dashboard is likely only the tip of the iceberg.\" -- Lynn K. Rhodes Fritz, Lakewood",
    "link": "https://www.denverpost.com/2025/06/20/federal-cuts-dashboard-colorado-gov-jared-polis/",
    "timestamp": "2025-06-20T17:41:34Z"
  },
  {
    "title": "Supreme Court Hands Donald Trump a Legal Win Over Tariffs",
    "description": "The Supreme Court on Friday declined to fast-track a legal challenge to President Donald Trump's tariffs.",
    "link": "https://www.newsweek.com/supreme-court-wont-fast-track-trump-tariffs-challenge-2088582",
    "timestamp": "2025-06-20T17:41:21Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.wmur.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:41:01Z"
  },
  {
    "title": "No Kings protest takes toll: Trump's approval rating hits -6, marking sharpest drop in months",
    "description": "Donald Trump's approval ratings have declined following the widespread \"No Kings\" protests across the United States. A Newsweek tracker indicates his net approval fell to -6 points, with disapproval outweighing approval. Millions participated in demonstration…",
    "link": "https://economictimes.indiatimes.com/news/international/us/no-kings-protest-takes-toll-trumps-approval-rating-hits-6-marking-sharpest-drop-in-months-donald-trump-approval-ratings-news/articleshow/121978780.cms",
    "timestamp": "2025-06-20T17:38:24Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.kcci.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:37:36Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.kmbc.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:37:36Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.kcra.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:37:32Z"
  },
  {
    "title": "Trump calls for special prosecutor to investigate 2020 election",
    "description": "Trump calls for a special prosecutor to investigate 2020 election, reigniting his fraud allegations",
    "link": "https://www.wtae.com/article/trump-special-prosecutor-2020-election-fraud/65131694",
    "timestamp": "2025-06-20T17:37:29Z"
  },
  {
    "title": "Trump presided over national security meeting on Iran, US official says",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump presided over a national security meeting about Iran with top aides at the White House on Friday, a U.S. official said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/21/trump-presided-over-national-security-meeting-on-iran-us-official-says",
    "timestamp": "2025-06-20T17:37:00Z"
  },
  {
    "title": "Supreme Court rejects fast track of Trump tariff challenge by toy companies",
    "description": null,
    "link": "https://www.cnbc.com/2025/06/20/supreme-court-rejects-fast-track-of-trump-tariff-challenge-by-toy-companies.html",
    "timestamp": "2025-06-20T17:36:53Z"
  },
  {
    "title": "Elon Musk Isn’t Done With White House Drama",
    "description": "He took to X to call a senior official a “snake.”",
    "link": "https://www.vanityfair.com/news/story/elon-musk-isnt-done-with-white-house-drama",
    "timestamp": "2025-06-20T17:35:43Z"
  },
  {
    "title": "Iranian-backed militias threaten US amid rising tensions in Iraq over Iran-Israel conflict",
    "description": "Tensions in Iraq have grown in the wake of the Israeli attack on Iran on June 13. Pro-Iranian Iraqi militias have increased their threats against US forces and held rallies against the US presence in Iraq. The Iraqi government has sent security forces to Nine…",
    "link": "https://www.longwarjournal.org/archives/2025/06/iranian-backed-militias-threaten-us-amid-rising-tensions-in-iraq-over-iran-israel-conflict.php",
    "timestamp": "2025-06-20T17:34:32Z"
  },
  {
    "title": "‘Maddening’: Jen Psaki calls out the media over falling for Trump’s ‘two weeks’ trick",
    "description": "Jen Psaki breaks down the important context missing from the media’s reporting on Trump's comments over possible U.S. military action in Iran to support Israel.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-iran-promise-two-week-trick-media-rcna214112",
    "timestamp": "2025-06-20T17:34:25Z"
  },
  {
    "title": "Florida Proposes 'Alligator Alcatraz' to House Detained Migrants and Speed Up Deportations",
    "description": "Florida's attorney general proposed using a 30-square-mile part of the Everglades to house, process, and deport detained migrants.",
    "link": "https://reason.com/2025/06/20/florida-proposes-alligator-alcatraz-to-house-detained-migrants-and-speed-up-deportations/",
    "timestamp": "2025-06-20T17:34:14Z"
  },
  {
    "title": "Supreme Court declines to fast-track consideration of a speedy challenge to Trump’s tariffs",
    "description": "The Supreme Court on Friday declined to fast-track its consideration of whether to take up a challenge to President Donald Trump’s tariffs, though this isn’t the final word on whether or when the court might review the crucial issue",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-trump-tariffs-toy-companies-challenge-rcna213850",
    "timestamp": "2025-06-20T17:34:00Z"
  }
]