[
  {
    "title": "JD Vance arrives in India for a 4-day visit that includes personal engagements and talks on trade",
    "description": "U.S. Vice President JD Vance has arrived in India for a four-day visit as New Delhi looks to avoid U.S. tariffs and negotiate a bilateral trade deal with Washington. Vance will meet Prime Minister Narendra Modi on the first day of his largely personal visit. …",
    "link": "https://www.seattlepi.com/news/world/article/jd-vance-arrives-in-india-for-a-4-day-visit-that-20285883.php",
    "timestamp": "2025-04-21T04:39:20Z"
  },
  {
    "title": "‘Drop Dead City’ Review: A Gripping Look at How New York City Almost Went Bankrupt in 1975, Foreshadowing the Current Moment",
    "description": "The reason I call \"Drop Dead City\" wonkish is that the film isn’t a seamy urban-cultural biography; it really is about the money. And the more the film follows the money, the more it tells a story larger than New York — a story with direct application to toda…",
    "link": "https://variety.com/2025/film/reviews/drop-dead-city-review-1236373372/",
    "timestamp": "2025-04-21T04:36:29Z"
  },
  {
    "title": "Trump administration reverses long-held guidance on 'road diets' for traffic safety",
    "description": "In Kansas City, a stylist's near miss highlights the dangers of speeding traffic. Road diets, which reduce lanes, aim to improve safety. Many cities have seen positive results. However, the Trump administration is skeptical. Some argue road diets shift traffi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-reverses-long-held-guidance-on-road-diets-for-traffic-safety/articleshow/120472486.cms",
    "timestamp": "2025-04-21T04:34:15Z"
  },
  {
    "title": "Russia, Ukraine Trade Accusations Of Truce Violations On Easter",
    "description": "Russia and Ukraine on Sunday accused each other of violating an Easter truce as US President Donald Trump surprisingly announced that the war rivals could make a &quot;deal&quot; this week.",
    "link": "https://www.ndtv.com/world-news/russia-and-ukraine-trade-accusations-of-truce-violations-on-easter-8215246",
    "timestamp": "2025-04-21T04:33:49Z"
  },
  {
    "title": "Market volatility hits high beta stocks as 92% scrips fall up to 66% from peaks. These 2 risks loom",
    "description": "Amidst market volatility, high beta stocks experienced steeper declines, with many falling significantly from their peaks. Low beta stocks demonstrated greater resilience, declining less on average. Factors like global trade tensions, FII selling, and concern…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-volatility-hits-high-beta-stocks-as-92-scrips-fall-up-to-66-from-peaks-these-2-risks-loom/articleshow/120472442.cms",
    "timestamp": "2025-04-21T04:33:36Z"
  },
  {
    "title": "Gary Black Shares Polymarket Data, Says Trump Tariffs Have Pushed Odds Of 2025 Recession To 57%",
    "description": "Noted investment adviser Gary Black drew attention Sunday to the rising odds of a recession in 2025 due to President Donald Trump’s tariff measures.\nWhat Happened: Black, managing partner at The Future Fund, highlighted the increasing likelihood of the U.S. s…",
    "link": "https://biztoc.com/x/bdbff00044dde344",
    "timestamp": "2025-04-21T04:30:01Z"
  },
  {
    "title": "How much 'weaponization' can the global economy take?",
    "description": "Global trade, energy and financial networks are increasingly being leveraged as strategic tools by nations.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/21/world/weaponization-can-the-global-economy/",
    "timestamp": "2025-04-21T04:30:00Z"
  },
  {
    "title": "JD Vance arrives in India for a 4-day visit that includes personal engagements and talks on trade",
    "description": "NEW DELHI (AP) — U.S. Vice President JD Vance arrived in India on Monday for a four-day visit as New Delhi looks to avoid U.S. tariffs and negotiate a bilateral trade deal with Washington. Vance will meet Prime Minister Narendra Modi on the first day of his l…",
    "link": "https://financialpost.com/pmn/jd-vance-arrives-in-india-for-a-4-day-visit-that-includes-personal-engagements-and-talks-on-trade",
    "timestamp": "2025-04-21T04:29:47Z"
  },
  {
    "title": "Secondhand stores are poised to benefit if US tariffs drive up new clothing costs",
    "description": "NEW YORK (AP) — Stores selling secondhand clothes, shoes and accessories are poised to benefit from President Donald Trump’strade war even as businesses the world over race to avert potential damage, according to industry experts. American styles carry intern…",
    "link": "https://financialpost.com/pmn/secondhand-stores-are-poised-to-benefit-if-us-tariffs-drive-up-new-clothing-costs",
    "timestamp": "2025-04-21T04:26:41Z"
  },
  {
    "title": "The ‘worst thing’: Meloni interpreter apologizes after stumble at White House",
    "description": "Giorgia Meloni’s interpreter has apologized for faltering during a high-stakes meeting with Donald Trump earlier this week, prompting the Italian prime minister to jump in and translate her own comments about NATO and defense spending. Valentina Maiolini-Roth…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312254/posts",
    "timestamp": "2025-04-21T04:26:24Z"
  },
  {
    "title": "JD Vance arrives in India for a 4-day visit that includes personal engagements and talks on trade",
    "description": "U.S. Vice President JD Vance arrived in India on Monday for a four-day visit as New Delhi looks to avoid U.S. tariffs and negotiate a bilateral trade deal...",
    "link": "https://www.yahoo.com/news/jd-vance-arrives-india-4-042444356.html",
    "timestamp": "2025-04-21T04:24:44Z"
  },
  {
    "title": "Former Hegseth aide in op-ed: ‘Total chaos at the Pentagon’",
    "description": "WASHINGTON — An aide to Defense Secretary Pete Hegseth published an op-ed Sunday in which he was highly critical ofcriticized his former boss and suggested that President Donald Trump might soon remove Hegseth following weeks of turmoildrama, including leaked…",
    "link": "https://www.nbcnews.com/politics/national-security/john-ullyot-op-ed-pete-hegseth-rcna202071",
    "timestamp": "2025-04-21T04:23:38Z"
  },
  {
    "title": "Big Tech's \"Magnificent Seven\" heads into earnings season reeling from Trump turbulence",
    "description": "As Big Tech kicks off its quarterly earnings season this week, the industry’s bellwether companies have been thrust into a cauldron of uncertainty and turmoil that they didn’t anticipate when Donald Trump re-entered the White House less than 100 days ago",
    "link": "https://abcnews.go.com/Technology/wireStory/big-techs-magnificent-heads-earnings-season-reeling-trump-121001387",
    "timestamp": "2025-04-21T04:22:18Z"
  },
  {
    "title": "Vance Heads To India For Tough Talks On Trade",
    "description": "US Vice President JD Vance begins a four-day visit to India on Monday as New Delhi looks to seal an early trade deal and stave off punishing US tariffs.",
    "link": "https://www.ibtimes.com/vance-heads-india-tough-talks-trade-3770734",
    "timestamp": "2025-04-21T04:21:17Z"
  },
  {
    "title": "Coulter: I Think We're 'Kind of Lucky' Trump Lost in 2020",
    "description": "During a recent interview that aired on CSPAN, conservative commentator Ann Coulter applauded the early days of Donald Trump's second presidency and contrasted it with his first term.\nThe post Coulter: I Think We’re ‘Kind of Lucky’ Trump Lost in 2020 appeared…",
    "link": "https://www.breitbart.com/clips/2025/04/20/coulter-i-think-were-kind-of-lucky-trump-lost-in-2020/",
    "timestamp": "2025-04-21T04:19:32Z"
  },
  {
    "title": "Service members killed in border crash were California-based U.S. Marines",
    "description": "Two men killed last week during a border security mission in New Mexico were identified as Lance Cpl. Albert Aguilera, 22, and Lance Cpl. Marcelino Gamino, 28.",
    "link": "https://www.nbcnews.com/news/us-news/service-members-killed-border-crash-california-based-us-marines-rcna202077",
    "timestamp": "2025-04-21T04:19:17Z"
  },
  {
    "title": "Indonesia March trade surplus, wider than expected, hits 4-month high",
    "description": "JAKARTA : Indonesia reported on Monday a $4.33 billion trade surplus in March, more than expected and the widest in four months as shipments beat estimates on strong palm oil and nickel exports as well as a rush to beat the start date for U.S. tariffs.A Reute…",
    "link": "https://www.channelnewsasia.com/business/indonesia-march-trade-surplus-wider-expected-hits-4-month-high-5077816",
    "timestamp": "2025-04-21T04:18:00Z"
  },
  {
    "title": "The White House just kicked a World Cup own-goal",
    "description": "Next year’s FIFA World Cup will test whether the U.S. — with President Donald Trump pushing tariffs and tough immigration policies — can draw global fans or drive them away.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/21/world/white-house-world-cup-own-goal/",
    "timestamp": "2025-04-21T04:15:00Z"
  },
  {
    "title": "Zelenskyy says Russia is trying to create an 'impression of a ceasefire' as attacks continue",
    "description": "Ukrainian President Volodymyr Zelenskyy has accused Russia of trying to create an “impression of a ceasefire,” saying Russian forces continued attacks after President Vladimir Putin’s declaration of an Easter truce",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-russia-create-impression-ceasefire-attacks-continue-120999805",
    "timestamp": "2025-04-21T04:14:17Z"
  },
  {
    "title": "Trump tariffs: Billionaires cash out shares early before market plunge",
    "description": "Meta’s Mark Zuckerberg, Oracle’s Safra Catz and banker Jamie Dimon cashed out billions of dollars before Trump’s tariff announcements roiled markets.",
    "link": "https://www.smh.com.au/business/markets/billionaires-cash-out-shares-early-before-trump-s-tariff-plunge-20250421-p5lt28.html",
    "timestamp": "2025-04-21T04:14:07Z"
  },
  {
    "title": "Big Tech's \"Magnificent Seven\" heads into earnings season reeling from Trump turbulence",
    "description": "Big Tech’s “Magnificent Seven” have lost $3.8 trillion in value since Donald Trump’s January 20 inauguration, as tariffs and regulatory actions fuel uncertainty. Tariff threats, antitrust lawsuits, and export bans have battered supply chains and profits, leav…",
    "link": "https://economictimes.indiatimes.com/tech/technology/big-techs-magnificent-seven-heads-into-earnings-season-reeling-from-trump-turbulence/articleshow/120471649.cms",
    "timestamp": "2025-04-21T04:12:35Z"
  },
  {
    "title": "Beijing warns countries against colluding with US to restrict trade with China | CNN Business",
    "description": "Beijing has warned its trading partners against succumbing to US pressure to restrict trade with China in exchange for exemption from President Donald Trump’s “reciprocal” tariffs.",
    "link": "https://www.cnn.com/2025/04/20/business/china-warns-countries-us-trade-war-intl-hnk/index.html",
    "timestamp": "2025-04-21T04:08:41Z"
  },
  {
    "title": "The two Australian giants winning from Trump’s ’fast track",
    "description": "President Donald Trump’s administration is speeding up approvals for critical mineral projects in its trade war with China.",
    "link": "https://www.smh.com.au/business/companies/the-two-australian-giants-winning-from-trump-s-fast-track-20250420-p5lszd.html",
    "timestamp": "2025-04-21T04:08:35Z"
  },
  {
    "title": "Big Tech’s ‘Magnificent Seven’ heads into earnings season reeling from Trump turbulence",
    "description": "SAN FRANCISCO (AP) — As Big Tech kicks off its quarterly earnings season this week, the industry’s bellwether companies have been thrust into a cauldron of uncertainty and turmoil that they didn’t anticipate when Donald Trump re-entered the White House nearly…",
    "link": "https://financialpost.com/pmn/big-techs-magnificent-seven-heads-into-earnings-season-reeling-from-trump-turbulence",
    "timestamp": "2025-04-21T04:08:20Z"
  },
  {
    "title": "'Magnificent Seven' head into earnings season reeling from Trump turbulence",
    "description": "As Big Tech kicks off earnings season this week, the industry's bellwether companies have been thrust into uncertainty. Read more.",
    "link": "https://financialpost.com/investing/big-tech-magnificent-seven-earnings-season-trump-turbulence",
    "timestamp": "2025-04-21T04:08:20Z"
  },
  {
    "title": "Top Pentagon Spokesperson Quits, Then Drops 'Bombshell' Warning About Pete Hegseth",
    "description": "John Ullyot said the Defense Department is in \"total disarray\" under Hegseth.",
    "link": "https://www.huffpost.com/entry/john-ullyot-pete-hegseth-warning_n_6805b753e4b079fefa2798de",
    "timestamp": "2025-04-21T04:07:31Z"
  },
  {
    "title": "South Korea finds 'Made in Korea' breaches intended to bypass U.S. tariffs",
    "description": "South Korea has found increased attempts to disguise foreign products as Korean exports, primarily from China, to avoid tariffs.",
    "link": "https://www.cnbc.com/2025/04/21/south-korea-finds-made-in-korea-breaches-intended-to-bypass-us-tariffs.html",
    "timestamp": "2025-04-21T04:06:35Z"
  },
  {
    "title": "China's Big Warning For Countries Signing Trade Deals With US",
    "description": "China has warned other countries against making a broader trade deal with the United States at Beijing&#039;s expense, ratcheting up its rhetoric in a spiralling tariff war between the world&#039;s two biggest economies.",
    "link": "https://www.ndtv.com/world-news/chinas-big-warning-for-countries-signing-trade-deals-with-us-8215088",
    "timestamp": "2025-04-21T04:06:10Z"
  },
  {
    "title": "Trump Harvests Autocratic Powers Planted by Bush and Cheney",
    "description": "( Tomdispatch.com ) - In 2003, the Macedonian police arrested Khaled el-Masri, a German citizen vacationing in their country. They handed the unfortunate man over to the CIA, who shipped him off to one of their “black sites.” For those too young to remember (…",
    "link": "https://www.juancole.com/2025/04/harvests-autocratic-planted.html",
    "timestamp": "2025-04-21T04:04:03Z"
  },
  {
    "title": "Exclusive-EU explores tweaking methane rules for US gas to help trade talks, sources say",
    "description": "BRUSSELS (Reuters) -The European Union is looking at ways to make it easier for U.S. gas exports to comply with its methane emissions rules, as the bloc...",
    "link": "https://finance.yahoo.com/news/exclusive-eu-explores-tweaking-methane-040321674.html",
    "timestamp": "2025-04-21T04:03:21Z"
  },
  {
    "title": "Tariffs Aren’t Enough to Bring Back the Glory Days of U.S. Manufacturing",
    "description": "Job security and economic benefits came about because of unions.",
    "link": "http://foreignpolicy.com/2025/04/21/tariffs-trump-manufacturing-unions-industry/",
    "timestamp": "2025-04-21T04:01:07Z"
  },
  {
    "title": "‘There’s no such thing as recession-proofing’: Small businesses grapple with shifting economy",
    "description": "As economic uncertainty looms, small businesses face mounting challenges. Experts say there's no true way to recession-proof — only adapt.",
    "link": "http://digiday.com/marketing/theres-no-such-thing-as-recession-proofing-small-businesses-grapple-with-shifting-economy/",
    "timestamp": "2025-04-21T04:01:00Z"
  },
  {
    "title": "WTF is the digital services tax?",
    "description": "Digiday breaks down what the DST is, how the U.S. has responded to it so far, and what it could mean for the advertising industry.",
    "link": "http://digiday.com/marketing/wtf-is-the-digital-services-tax/",
    "timestamp": "2025-04-21T04:01:00Z"
  },
  {
    "title": "Beneath the Surface: Is the Trump-Netanyahu ‘Unthinkable’ About To Erupt?",
    "description": "Israeli Prime Minister Benjamin Netanyahu’s recent visit to Washington was no ordinary trip. The consensus among Israeli analysts, barring a few remaining loyalists, is that Netanyahu was not invited but, rather, summoned by US President Donald Trump. All evi…",
    "link": "https://original.antiwar.com/ramzy-baroud/2025/04/20/beneath-the-surface-is-the-trump-netanyahu-unthinkable-about-to-erupt/",
    "timestamp": "2025-04-21T04:00:52Z"
  },
  {
    "title": "Trump’s Unconstitutional, Presidential War Against Yemen",
    "description": "For Americans who still labor under the delusion that Donald Trump is an advocate of realism and restraint in foreign policy, the events in Yemen should come as a rude awakening.  Unfortunately, the most prominent indicator took a form that enabled the presid…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/04/20/trumps-unconstitutional-presidential-war-against-yemen/",
    "timestamp": "2025-04-21T04:00:26Z"
  },
  {
    "title": "Democrats Dying on the Most Desolate Hills",
    "description": "The phrase “the hill you choose to die on” is an expression meaning a belief, opinion, or position that one is fiercely committed to defending, even when it is impractical or contrary to one’s long-term goals. It suggests a willingn...",
    "link": "https://www.americanthinker.com/articles/2025/04/democrats_dying_on_the_most_desolate_hills.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "Not in Kansas Any More",
    "description": "As America and the world deal with the phenomenon of Trump 2.0, with the Left slinging the ACLU at the court system and educated liberal ladies demanding HANDS OFF! and Standing up for Free Speech, and the rest of us wondering if our Democratic frien...",
    "link": "https://www.americanthinker.com/articles/2025/04/not_in_kansas_any_more.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "Democrat's Cloward-Piven default",
    "description": "Post-election lawfare, particularly that designed to prevent the deportation of illegal aliens, is revealing what may be Biden’s Handler’s intention all along. I hate to give them more credit for intelligence than they deserve, and it may...",
    "link": "https://www.americanthinker.com/blog/2025/04/democrat_s_cloward_piven_default.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "The Pope’s death is leading to yet more anti-Israel and anti-Trump propaganda",
    "description": "Pope Francis interpreted his faith through a Marxist lens. He had strong criticism for national borders, a generic leftist position. And of course, he strongly supported Gaza, and Gaza is Hamas. Now that this old, sick man has passed away, the leftis...",
    "link": "https://www.americanthinker.com/blog/2025/04/the_pope_s_death_is_leading_to_yet_more_anti_israel_and_anti_trump_propaganda.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "A New Mexico judge resigned over allegations that he kept a Tren de Aragua member in his home",
    "description": "The Breitbart headline looks like something ripped straight from the Babylon Bee: “New Mexico Democrat Judge Resigns After ICE Arrests Alleged Tren de Aragua Gang Member in His Home.” But it’s not satire about the Democrat party&rsq...",
    "link": "https://www.americanthinker.com/blog/2025/04/a_new_mexico_judge_resigned_over_allegations_that_he_kept_a_tren_de_aragua_member_in_his_home.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "The Starliner: worse than we thought",
    "description": "In Astronauts carefully tell the truth, I noted astronaut Butch Wilmore confirmed Elon Musk’s assertion that he and Suni Williams really were stranded on the ISS, and that Musk offered to bring them home during Biden’s Handler&r...",
    "link": "https://www.americanthinker.com/blog/2025/04/the_starliner_worse_than_we_thought.html",
    "timestamp": "2025-04-21T04:00:00Z"
  },
  {
    "title": "Asian markets are mixed as US tech companies are due to release earnings",
    "description": "Asian shares are mixed following the Easter weekend holiday, with some markets still closed",
    "link": "https://abcnews.go.com/Business/wireStory/asian-markets-mixed-us-tech-companies-due-release-121000828",
    "timestamp": "2025-04-21T03:58:27Z"
  },
  {
    "title": "15 years after Deepwater Horizon oil spill, lawsuits stall and restoration is incomplete",
    "description": "Fifteen years after the Deepwater Horizon disaster off the Gulf Coast, the effects of the largest oil spill in U.S. history are still being felt",
    "link": "https://abcnews.go.com/Business/wireStory/15-years-after-deepwater-horizon-oil-spill-lawsuits-120986128",
    "timestamp": "2025-04-21T03:58:16Z"
  },
  {
    "title": "Gold hits record, dollar drops as tariff fears dampen sentiment",
    "description": "Gold prices hit a fresh record Monday while the dollar weakened further and stocks were mixed amid worries about Donald Trump's tariff blitz and bubbling row with the Federal Reserve. With several markets still closed for the Easter holiday, business was limi…",
    "link": "https://japantoday.com/category/business/gold-hits-record-dollar-drops-as-tariff-fears-dampen-sentiment",
    "timestamp": "2025-04-21T03:57:59Z"
  },
  {
    "title": "China warns countries against teaming up with Trump",
    "description": "SHANGHAI -- The Chinese government on Monday warned that countries that negotiate trade deals with U.S. President Donald Trump will be hit with countermeasures if they harm its interests.\nThe statement comes as Beijing and Washington race to court trading par…",
    "link": "https://biztoc.com/x/3493cfbf5d9c6402",
    "timestamp": "2025-04-21T03:56:59Z"
  },
  {
    "title": "JD Vance Begins 4-Day India Visit Today, To Meet PM Modi",
    "description": "US Vice President JD Vance will begin his four-day official visit to India from today, running from April 21 to 24. Accompanied by his Indian-origin wife, Usha Vance and their children, this marks Vance&#039;s first trip to India.",
    "link": "https://www.ndtv.com/india-news/jd-vance-begins-4-day-india-visit-today-to-meet-pm-modi-8214761",
    "timestamp": "2025-04-21T03:55:50Z"
  },
  {
    "title": "JD Vance begins 4-day India visit today, to meet PM Modi",
    "description": "US Vice President JD Vance embarks on official visit to India, meeting PM Modi and visiting iconic sites.",
    "link": "https://www.thehindubusinessline.com/news/jd-vance-begins-4-day-india-visit-today-to-meet-pm-modi/article69473166.ece",
    "timestamp": "2025-04-21T03:48:46Z"
  },
  {
    "title": "Nintendo Switch 2 pre-orders start this week, accessories get price hike",
    "description": "The Nintendo Switch 2 is starting retail pre-orders this week on April 24 in the US. It will be priced at USD 450 (~PHP 25,000) for its console-only package and USD 500 (~PHP 28,000) with its bundle including Mario Kart World. However, the company has increas…",
    "link": "https://www.yugatech.com/news/nintendo-switch-2-pre-orders-start-this-week-accessories-get-price-hike/",
    "timestamp": "2025-04-21T03:45:12Z"
  },
  {
    "title": "US defence chief shared sensitive information in second Signal chat: US media",
    "description": "WASHINGTON - US Defense Secretary Pete Hegseth shared information on forthcoming US air strikes on Yemen in a private Signal chat group that included his wife, brother and personal lawyer, the New York Times and CNN reported on Sunday.",
    "link": "https://www.bangkokpost.com/world/3007529/us-defence-chief-shared-sensitive-information-in-second-signal-chat-us-media",
    "timestamp": "2025-04-21T03:45:00Z"
  },
  {
    "title": "Trump tariffs stunt US toy imports as sellers play for time",
    "description": "COLUMBUS (UNITED STATES) - Josh Staph fears the fun-packed shelves of his toy warehouse might start looking joyless in the months ahead, with made-in-China flying discs and model gliders grounded -&ndash; like much of his product line &ndash;- by Donald Trump…",
    "link": "https://www.bangkokpost.com/business/general/3007524/trump-tariffs-stunt-us-toy-imports-as-sellers-play-for-time",
    "timestamp": "2025-04-21T03:45:00Z"
  },
  {
    "title": "JD Vance's India visit: Meeting with PM Modi, visiting Taj Mahal, here's what the US Vice President is scheduled to do",
    "description": "US Vice President JD Vance, accompanied by his family, will visit India from April 21-24 amid rising trade tensions. Discussions with Prime Minister Modi will focus on strengthening bilateral ties and trade agreements. Vance's itinerary includes visits to New…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/jd-vances-india-visit-meeting-with-pm-modi-visiting-taj-mahal-heres-what-the-us-vice-president-is-scheduled-to-do/articleshow/120470368.cms",
    "timestamp": "2025-04-21T03:41:49Z"
  },
  {
    "title": "Gold Prices Hit Record High, Dollar Weakens Amid Trump's Tariff Fears",
    "description": "Concerns about the global economic outlook pushed safe haven assets higher, with gold hitting a new record high above $3,384.",
    "link": "https://www.ndtv.com/world-news/gold-prices-hit-record-high-dollar-weakens-amid-trumps-tariff-fears-8214928",
    "timestamp": "2025-04-21T03:37:30Z"
  },
  {
    "title": "Kyiv, half of Ukraine under air raid alerts hours after one-day Russia ceasefire ends",
    "description": "(Reuters) - Ukraine issued air raid alerts for Kyiv and the country's eastern half as blasts shook the city of Mykolaiv early on Monday, authorities said, hours after the one-day Easter ceasefire declared by Russian President Vladimir Putin came to an end. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/21/kyiv-half-of-ukraine-under-air-raid-alerts-hours-after-one-day-russia-ceasefire-ends",
    "timestamp": "2025-04-21T03:35:00Z"
  },
  {
    "title": "El Salvador: Bukele suggests prisoner swap with Venezuela",
    "description": "Venezuela's attorney general has described as \"cynical\" the Salvadoran President Nayib Bukele's proposal to exchange 252 Venezuelan migrants expelled by the United States. El Salvador President Nayib Bukele proposed a prisoner exchange with Venezuela on Sunda…",
    "link": "https://www.dw.com/en/el-salvador-bukele-suggests-prisoner-swap-with-venezuela/a-72295555",
    "timestamp": "2025-04-21T03:35:00Z"
  },
  {
    "title": "El Salvador: Bukele suggests prisoner swap with Venezuela",
    "description": "Venezuela's attorney general has described as \"cynical\" the Salvadoran President Nayib Bukele's proposal to exchange 252 Venezuelan migrants expelled by the United States.",
    "link": "https://www.dw.com/en/el-salvador-bukele-suggests-prisoner-swap-with-venezuela/a-72295555",
    "timestamp": "2025-04-21T03:35:00Z"
  },
  {
    "title": "Did Japan really drop bowling balls on US cars? Donald Trump thinks so",
    "description": "In a provocative Easter Sunday message, Donald Trump revived a bizarre claim about Japan’s so-called “bowling ball test,” alleging it’s used to block American-made cars from entering the Japanese market. The remark, first made in 2018, was part of a larger li…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/japans-bowling-ball-test-did-japan-really-drop-bowling-balls-on-us-cars-trump-thinks-so/articleshow/120469812.cms",
    "timestamp": "2025-04-21T03:32:33Z"
  },
  {
    "title": "Ukraine reports many Russian drone attacks after truce ends",
    "description": "Air raid alerts are issued for Kyiv and other regions as blasts are reported in Mykolaiv, a southern city.",
    "link": "https://www.bbc.com/news/articles/cy5r9yppykeo",
    "timestamp": "2025-04-21T03:31:17Z"
  },
  {
    "title": "Bitter truth: Why has chocolate become so expensive?",
    "description": "High temperatures, ageing trees and disease have lowered cocoa supplies and raised prices.",
    "link": "https://www.aljazeera.com/news/2025/4/21/bitter-easter-truth-why-has-chocolate-become-so-expensive",
    "timestamp": "2025-04-21T03:29:44Z"
  },
  {
    "title": "India's Modi to host JD Vance for trade talks",
    "description": "The US Vice President is visiting India to discuss trade but looming US tariffs on the country will also likely come up. New Delhi says it's \"positive\" that the visit will boost bilateral trade. US Vice President JD Vance's visit to India begins Monday with a…",
    "link": "https://www.dw.com/en/indias-modi-to-host-jd-vance-for-trade-talks/a-72295648",
    "timestamp": "2025-04-21T03:22:00Z"
  },
  {
    "title": "S.Korean ministers to hold trade talks in US this week",
    "description": "South Korea's acting president said Monday that his finance and trade ministers will hold high-level trade talks in Washington this week as they look to avoid Donald Trump's steep tariffs. \"During a phone call with President Donald Trump on the eighth, we agr…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/s-korean-ministers-to-hold-trade-talks-in-us-this-week/articleshow/120469973.cms",
    "timestamp": "2025-04-21T03:21:50Z"
  },
  {
    "title": "Wall Street ‘cops are gone’ after Trump overhaul, Democratic senator warns",
    "description": "The moves to purge federal regulatory agencies would leave consumers and markets vulnerable to fraud and corruption, Sen. Elizabeth Warren says.",
    "link": "https://www.japantimes.co.jp/business/2025/04/21/markets/warren-wall-street-cops-trump/",
    "timestamp": "2025-04-21T03:18:00Z"
  },
  {
    "title": "Anti-Trump Resistance Sees Another Leader As Dems' Leadership Carousel Turns",
    "description": "Chris Van Hollen has emerged, for now, as a leading figure in the resistance to President Donald Trump.",
    "link": "https://www.huffpost.com/entry/democrats-van-hollen-anti-trump-resistance_n_6805b6fde4b079fefa2798da",
    "timestamp": "2025-04-21T03:16:26Z"
  },
  {
    "title": "China warns nations against 'appeasing' US in trade deals",
    "description": "Beijing was responding to a report that the US will pressure other nations to restrict trade with China.",
    "link": "https://www.bbc.com/news/articles/cx2708dl9n1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-21T03:14:17Z"
  },
  {
    "title": "Trump’s global trade war hangs over Don’s second-in-command’s India visit",
    "description": "JD Vance's India visit occurs amid US-India trade tensions, with potential tariff increases looming. Talks with Prime Minister Modi are crucial for India's global leadership ambitions. Vance's family's cultural visits aim to strengthen ties, while trade negot…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/jd-vance-india-trip-donald-trumps-global-trade-war-with-us-tariffs-hangs-over-donalds-second-in-commands-india-visit/articleshow/120469678.cms",
    "timestamp": "2025-04-21T03:13:48Z"
  },
  {
    "title": "Trump’s global trade war hangs over Don’s second-in-command’s India visit",
    "description": "JD Vance's India visit occurs amid US-India trade tensions, with potential tariff increases looming. Talks with Prime Minister Modi are crucial for India's global leadership ambitions. Vance's family's cultural visits aim to strengthen ties, while trade negot…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/jd-vance-india-trip-donald-trumps-global-trade-war-with-us-tariffs-hangs-over-donalds-second-in-commands-india-visit/articleshow/120469929.cms",
    "timestamp": "2025-04-21T03:13:48Z"
  },
  {
    "title": "This week will signal if tariffs are hurting",
    "description": "Ever since President Donald Trump announced his big tariff plans on April 2, battles have raged about how the tariff may hurt the U.S. and the global economy. \nThe financial markets have offered deep skepticism about that the plan will do much for the economy…",
    "link": "https://biztoc.com/x/e6836f315a549343",
    "timestamp": "2025-04-21T03:12:54Z"
  },
  {
    "title": "Pentagon Spokesman Sean Parnell Responds to Establishment Media Relaunching Signal-Gate: 'Another Old Story'",
    "description": "Chief Pentagon Spokesman Sean Parnell responded to the establishment news media relaunching Signal-gate attacks against Secretary of Defense Pete Hegseth, noting that it is \"another old story\" that is \"back from the dead.\"\nThe post Pentagon Spokesman Sean Par…",
    "link": "https://www.breitbart.com/politics/2025/04/20/pentagon-spokesman-sean-parnell-media-relaunching-signal-gate-old-story/",
    "timestamp": "2025-04-21T03:07:22Z"
  },
  {
    "title": "The Board Game Industry Is Burning – and It's Their Own Fault",
    "description": "“Are board game tariffs really 245%? Or is the industry being played? This deep-dive exposes the truth behind the panic, with real HTS codes, broken math, and a ruthless takedown of Gloomhaven publisher Cephalofair.",
    "link": "https://www.highnoongame.com/post/the-boardgame-industry-is-burning",
    "timestamp": "2025-04-21T03:07:04Z"
  },
  {
    "title": "Jensen Huang's high-stakes gambit: Defying Washington to safeguard Nvidia's future in China",
    "description": "Jensen Huang, the indomitable chief executive of Nvidia, recently grappled with the mercurial and formidable force of US President Donald Trump, whose unpredictability defies conventional analysis. Contrary to widespread speculation that Huang had conceded, h…",
    "link": "https://www.digitimes.com/news/a20250421PD211/nvidia-jensen-huang-market-beijing-donald-trump.html",
    "timestamp": "2025-04-21T03:04:56Z"
  },
  {
    "title": "Asian markets are mixed as US tech companies are due to release earnings",
    "description": "Asian shares were mixed on Monday following the Easter weekend holiday, with some markets still closed. U.S. futures were lower as U.S. tech companies prepared to release their earnings after the recent spate of market turmoil brought on by President Donald T…",
    "link": "https://financialpost.com/pmn/asian-markets-are-mixed-as-us-tech-companies-are-due-to-release-earnings",
    "timestamp": "2025-04-21T03:03:33Z"
  },
  {
    "title": "Gold Hits Record, Dollar Drops As Tariff Fears Dampen Sentiment",
    "description": "Gold prices hit a fresh record Monday while the dollar weakened further and stocks were mixed amid worries about Donald Trump's tariff blitz and bubbling row with the Federal Reserve.",
    "link": "https://www.ibtimes.com/gold-hits-record-dollar-drops-tariff-fears-dampen-sentiment-3770728",
    "timestamp": "2025-04-21T03:03:20Z"
  },
  {
    "title": "Gold Hits Record, Dollar Drops As Tariff Fears Dampen Sentiment",
    "description": "Gold prices hit a fresh record Monday while the dollar weakened further and stocks were mixed amid worries about Donald Trump's tariff blitz and bubbling row with the Federal Reserve.",
    "link": "https://www.ibtimes.com.au/gold-hits-record-dollar-drops-tariff-fears-dampen-sentiment-1858055",
    "timestamp": "2025-04-21T03:03:06Z"
  },
  {
    "title": "Bitcoin Leads XRP, ETH, and ADA Higher as Perceived Threat to Fed Independence Sends Dollar Crashing",
    "description": "outshined the otherwise volatile alternative cryptocurrencies early Monday as the dollar index crashed to a three-year low on reports that President Donald Trump is exploring ways to remove the Federal Reserve Chairman Jerome Powell.\nBTC rose over 2% to $87,2…",
    "link": "https://biztoc.com/x/fc19b187a6dce683",
    "timestamp": "2025-04-21T03:01:38Z"
  },
  {
    "title": "Trump Planning Another Strike On Harvard? $1 Billion Funding May Be Slashed",
    "description": "The Trump administration is reportedly planning another financial strike on Harvard University following a week of escalating fireworks between the two sides after America&#039;s wealthiest educational institution refused to follow the government&#039;s diktat",
    "link": "https://www.ndtv.com/world-news/why-trump-administration-wants-to-pull-1-billion-more-from-harvard-funding-8214740",
    "timestamp": "2025-04-21T02:59:32Z"
  },
  {
    "title": "Trump Issues 8-Pointer 'Non-Tariff Cheating' Warning Amid 90-Day Pause",
    "description": "On April 9, Trump announced a 90-day pause on his sweeping tariffs on all countries, barring China - a move that had seemed nearly impossible.",
    "link": "https://www.ndtv.com/world-news/trump-issues-8-pointer-non-tariff-cheating-warning-amid-90-day-pause-8214737",
    "timestamp": "2025-04-21T02:58:49Z"
  },
  {
    "title": "Trump tariffs stunt US toy imports as sellers play for time",
    "description": "Josh Staph fears the fun-packed shelves of his toy warehouse might start looking joyless in the months ahead, with made-in-China flying discs and model gliders grounded -– like much of his product line –- by Donald Trump’s tariffs. “Things have ground to a ha…",
    "link": "https://www.digitaljournal.com/world/trump-tariffs-stunt-us-toy-imports-as-sellers-play-for-time/article",
    "timestamp": "2025-04-21T02:57:32Z"
  },
  {
    "title": "Gold hits record, dollar drops as tariff fears dampen sentiment",
    "description": "Gold prices hit a fresh record Monday while the dollar weakened further and stocks were mixed amid worries about Donald Trump’s tariff blitz and bubbling row with the Federal Reserve. With several markets still closed for the Easter holiday, business was limi…",
    "link": "https://www.digitaljournal.com/world/gold-hits-record-dollar-drops-as-tariff-fears-dampen-sentiment/article",
    "timestamp": "2025-04-21T02:57:32Z"
  },
  {
    "title": "Speculative traders boost bullish yen bets to a record on tariffs",
    "description": "The yen climbed to its strongest level since September against the dollar on Monday, briefly trading in the range of ¥140.",
    "link": "https://www.japantimes.co.jp/business/2025/04/21/japan-bullish-against-dollar/",
    "timestamp": "2025-04-21T02:55:00Z"
  },
  {
    "title": "Second Boeing jet starts return from China, tracker shows",
    "description": "Amid escalating trade tensions between the U.S. and China, two Boeing 737 MAX jets, initially destined for Chinese airlines, are being returned to the United States. This reversal highlights the disruption to aircraft deliveries due to newly imposed tariffs, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/second-boeing-jet-starts-return-from-china-tracker-shows/articleshow/120469490.cms",
    "timestamp": "2025-04-21T02:54:15Z"
  },
  {
    "title": "Tesla bull warns of 'code red' if Elon Musk sticks with DOGE",
    "description": "Wedbush analyst Dan Ives urges Elon Musk to prioritize Tesla amid concerns that his involvement with the Department of Government Efficiency (DOGE) and association with Trump's policies are damaging the brand. Ives believes Tesla faces a critical moment, with…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tesla-bull-warns-of-code-red-if-elon-musk-sticks-with-doge/articleshow/120469383.cms",
    "timestamp": "2025-04-21T02:53:07Z"
  },
  {
    "title": "Second Boeing jet starts return from China, tracker shows",
    "description": "SEOUL (Reuters) -A second Boeing jet intended for use by a Chinese airline was heading back to the U.S. on Monday, flight tracking data showed, in what...",
    "link": "https://finance.yahoo.com/news/second-boeing-jet-starts-return-024910573.html",
    "timestamp": "2025-04-21T02:49:10Z"
  },
  {
    "title": "Trump draft proposes radical reshaping of U.S. State Department",
    "description": "The order would eliminate dozens of positions and departments, including those dealing with climate, refugees, democracy and Africa.",
    "link": "https://www.japantimes.co.jp/news/2025/04/21/world/politics/trump-us-state-department/",
    "timestamp": "2025-04-21T02:47:00Z"
  },
  {
    "title": "El Salvador proposes swapping US-deported Venezuelans for Venezuelan 'political prisoners'",
    "description": "SAN SALVADOR: El Salvador President Nayib Bukele on Sunday (Apr 20) proposed sending 252 Venezuelans deported from the US and imprisoned in his country to Venezuela, in exchange for taking \"political prisoners\" held by Venezuela. In a post on X, Bukele asked …",
    "link": "https://www.channelnewsasia.com/world/el-salvador-proposes-swapping-us-deported-venezuelans-venezuelan-political-prisoners-5077391",
    "timestamp": "2025-04-21T02:46:41Z"
  },
  {
    "title": "Is Donald Trump Breaking the Law? Seven Experts Weigh In. (The Free Press)",
    "description": "The Free Press:\nIs Donald Trump Breaking the Law?  Seven Experts Weigh In.  —  Trump critics say we are in a constitutional crisis.  The White House says that's hysterical.  What do our top legal minds say?  —  The first 90 days of President Trump's second te…",
    "link": "https://www.memeorandum.com/250420/p61",
    "timestamp": "2025-04-21T02:45:00Z"
  },
  {
    "title": "US Defense Chief Shared Sensitive Information In Second Signal Chat: US Media",
    "description": "US Defense Secretary Pete Hegseth shared information on forthcoming US air strikes on Yemen in a private Signal chat group that included his wife, brother and personal lawyer, the New York Times and CNN reported on Sunday.",
    "link": "https://www.ibtimes.com/us-defense-chief-shared-sensitive-information-second-signal-chat-us-media-3770724",
    "timestamp": "2025-04-21T02:42:21Z"
  },
  {
    "title": "Bitcoin Leads XRP, ETH, and ADA Higher as Perceived Threat to Fed Independence Sends Dollar Crashing",
    "description": "Perceived threat to Fed's independence saw traders sell dollar, pushing BTC and gold higher.",
    "link": "https://www.coindesk.com/markets/2025/04/21/bitcoin-leads-xrp-eth-and-ada-higher-as-perceived-threat-to-fed-independence-sends-dollar-crashing",
    "timestamp": "2025-04-21T02:42:21Z"
  },
  {
    "title": "Hopefully Russia, Ukraine will make a deal this week: Donald Trump",
    "description": "US President Donald Trump has said he expects a peace agreement between Russia and Ukraine “this week,” while warning that the United States could abandon its mediation efforts if talks remain deadlocked. A draft framework includes a ceasefire and possible US…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-says-he-hopes-ukraine-russia-will-make-a-deal-this-week-signals-us-may-take-a-pass-if-talks-stall/articleshow/120468893.cms",
    "timestamp": "2025-04-21T02:41:13Z"
  },
  {
    "title": "Free Press Symposium on \"Is Donald Trump Breaking the Law?\"",
    "description": "(Lex Villena; Midjourney) \nToday, the Free Press published a symposium on \"Is Donald Trump Breaking the Law?\" \nParticipants include (in addition to myself), several prominent constitutional law scholars and legal commentators : Jonathan Adler (Case Western/Vo…",
    "link": "https://biztoc.com/x/af0b7bab030d0bc9",
    "timestamp": "2025-04-21T02:39:12Z"
  },
  {
    "title": "MELTDOWN: Fmr Pentagon Spox Drops Brutal Bombshell on ‘Baffling Purges’ and ‘Total Chaos’ at Hegseth DOD – ‘Hard to See Him Remaining’",
    "description": "\"Many in the secretary’s own inner circle will applaud quietly\" if President Trump fires Pete Hegseth, a former spox wrote at Politico on Sunday.\nThe post MELTDOWN: Fmr Pentagon Spox Drops Brutal Bombshell on ‘Baffling Purges’ and ‘Total Chaos’ at Hegseth DOD…",
    "link": "https://www.mediaite.com/news/meltdown-fmr-pentagon-spox-drops-brutal-bombshell-on-baffling-purges-and-total-chaos-at-hegseth-dod-hard-to-see-him-remaining/",
    "timestamp": "2025-04-21T02:37:44Z"
  },
  {
    "title": "US defense chief shared sensitive information in second Signal chat: US media",
    "description": "US Defense Secretary Pete Hegseth shared information on forthcoming US air strikes on Yemen in a private Signal chat group that included his wife, brother and personal lawyer, the New York Times and CNN reported on Sunday. AFP was not able to independently ve…",
    "link": "https://www.digitaljournal.com/world/us-defense-chief-shared-sensitive-information-in-second-signal-chat-us-media/article",
    "timestamp": "2025-04-21T02:37:20Z"
  },
  {
    "title": "Hunter Biden Whistleblower Replaced As Acting IRS Commissioner Just Days Into Job",
    "description": "The acting commissioner of the Internal Revenue Service (IRS) was replaced Friday, only three days after assuming the role, as his appointment triggered a power struggle between Treasury Secretary Scott Bessent and Elon Musk of the Department of Government Ef…",
    "link": "https://freerepublic.com/focus/f-news/4312244/posts",
    "timestamp": "2025-04-21T02:35:35Z"
  },
  {
    "title": "South Korea's Hyundai, Posco agree to cooperate on US steel plant",
    "description": "Hyundai Motor Group and Posco Holdings have signed an agreement for cooperation on Hyundai's planned U.S. steel plant, with Posco making an equity investment in the Louisiana factory project. Posco is also considering purchasing steel produced at the plant, w…",
    "link": "https://economictimes.indiatimes.com/news/international/business/south-koreas-hyundai-posco-agree-to-cooperate-on-us-steel-plant/articleshow/120468915.cms",
    "timestamp": "2025-04-21T02:35:05Z"
  },
  {
    "title": "World stocks slide as Trump's Fed attacks jangle nerves",
    "description": "Gold prices have reset record highs while stocks slid as investors fret over tariffs and President Donald Trump's criticism of the Federal Reserve chair.",
    "link": "https://thenightly.com.au/business/markets/world-stocks-slide-as-trumps-fed-attacks-jangle-nerves-c-18438575",
    "timestamp": "2025-04-21T02:33:16Z"
  },
  {
    "title": "Donald Trump raised $239 million for inauguration, more than doubling his own record",
    "description": "President Donald Trump’s 2025 inauguration raised a record-breaking $239 million, surpassing all previous amounts. Major corporations and wealthy individuals, including allies of Elon Musk, contributed heavily. The unprecedented sum has reignited concerns ove…",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-raised-239-million-for-inauguration-more-than-doubling-his-own-record/articleshow/120468892.cms",
    "timestamp": "2025-04-21T02:32:57Z"
  },
  {
    "title": "US’s Hegseth shared military plans in second Signal chat, reports say",
    "description": "Reports come after defence chief attracted scrutiny last month over discussions of military plans in another group chat.",
    "link": "https://www.aljazeera.com/news/2025/4/21/uss-hegseth-shared-military-plans-in-second-signal-chat-reports-say",
    "timestamp": "2025-04-21T02:30:48Z"
  }
]