[
  {
    "title": "Trump And Putin Want To Talk Business Once The Ukraine War Ends. Here's Why It Won't Be Easy",
    "description": "After more than three years of war, Trump has held out the prospect of restoring U.S.-Russia trade if there’s ever a peace settlement.",
    "link": "https://www.huffpost.com/entry/ap-russia-us-business_n_683b022ae4b08af1a43ce2c4",
    "timestamp": "2025-05-31T13:39:02Z"
  },
  {
    "title": "Welcome to the new Dark Ages",
    "description": "I used to see this fake graph all over the place in my New Atheist days. It’s troubling because…well, look at the Y axis. No units? How do you quantify “scientific advancement” to a single dimension, anyway? Also that dashed line extrapolation implies that sc…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/05/31/welcome-to-the-new-dark-ages/",
    "timestamp": "2025-05-31T13:38:19Z"
  },
  {
    "title": "Iran has increased its near weapons-grade uranium stockpile, watchdog says",
    "description": "The U.N. nuclear watchdog says Iran has further increased its stockpile of uranium enriched to near weapons-grade levels.",
    "link": "https://www.cbsnews.com/news/iran-has-amassed-even-more-near-weapons-grade-uranium-un-watchdog-says/",
    "timestamp": "2025-05-31T13:33:52Z"
  },
  {
    "title": "Dozens of UN food lorries raided as desperation mounts in Gaza Strip",
    "description": "Three-month Israeli blockade has pushed population to the brink of famine",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/31/dozens-of-un-food-lorries-raided-as-desperation-mounts-in-gaza-strip/",
    "timestamp": "2025-05-31T13:30:51Z"
  },
  {
    "title": "State of Crypto: Someone Tried to Scam Me (Probably)",
    "description": "I got a call from someone claiming to represent Coinbase, wanting to help me secure my account.",
    "link": "https://www.coindesk.com/policy/2025/05/31/state-of-crypto-someone-tried-to-scam-me-probably",
    "timestamp": "2025-05-31T13:30:00Z"
  },
  {
    "title": "The Seven Ugliest Provisions in Trump’s ‘Big Beautiful Bill’",
    "description": "Weakened courts, happy heirs, and work requirements. The House-passed version of Donald Trump's tax plan takes from poor, gives to rich.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-tax-bill-big-beautiful-seven-ugly-provisions-2025-1235351717/",
    "timestamp": "2025-05-31T13:30:00Z"
  },
  {
    "title": "Who is Barron Trump's new girlfriend? Mystery surrounds the girl the first son is often seen with",
    "description": "Barron Trump, the youngest Trump, is reportedly navigating his freshman year at NYU with a low profile and a budding social life. Despite rumors of struggling to fit in, recent reports suggest he has a girlfriend and close friendships. He remains largely apol…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-barron-trumps-new-girlfriend-mystery-surrounds-the-girl-the-first-son-is-often-seen-with/articleshow/121536419.cms",
    "timestamp": "2025-05-31T13:28:56Z"
  },
  {
    "title": "Trump to double steel, aluminium tariffs; exporters worried",
    "description": "Trump plans to double tariffs on steel and aluminium, impacting global trade and hitting Indian exports hard.",
    "link": "https://www.thehindubusinessline.com/economy/trump-to-double-steel-aluminium-tariffs-exporters-worried/article69641784.ece",
    "timestamp": "2025-05-31T13:28:16Z"
  },
  {
    "title": "Turmoil, worry swirl over cuts to key federal agencies as hurricane season begins",
    "description": "As hurricane season begins, experts in storms and disasters are worried about massive cuts to the federal system that forecasts, tracks and responds to the storms.",
    "link": "https://www.clickondetroit.com/tech/2025/05/31/turmoil-worry-swirl-over-cuts-to-key-federal-agencies-as-hurricane-season-begins/",
    "timestamp": "2025-05-31T13:26:23Z"
  },
  {
    "title": "Amid Trump's 'ceasefire' claims, Kamal Nath hails Indira Gandhi for resisting US pressure during 1971 war",
    "description": "Kamal Nath praised Indira Gandhi's strength during the 1971 India-Pakistan war. He highlighted her resistance to US pressure. Nath criticized the current state of Madhya Pradesh. He cited issues like corruption and unemployment. He also mentioned the Congress…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/amid-trumps-ceasefire-claims-kamal-nath-hails-indira-gandhi-for-resisting-us-pressure-during-1971-war/articleshow/121536443.cms",
    "timestamp": "2025-05-31T13:22:47Z"
  },
  {
    "title": "Huckabee slams French-backed Palestinian statehood push at UN, says US-Israel are 'inseparably' linked",
    "description": "Ambassador Huckabee criticized France’s push for a Palestinian state, affirmed U.S.-Israel ties, expressed hope for U.S.-Iran talks, but warned Tehran remains 'one of the greatest threats to world peace.'",
    "link": "https://www.foxnews.com/world/huckabee-slams-french-backed-palestinian-statehood-push-un-says-us-israel-inseparably-linked",
    "timestamp": "2025-05-31T13:19:33Z"
  },
  {
    "title": "Representation in Justice: Judge Williams’ Words Rekindle Debate Over Inclusivity in U.S. Courts",
    "description": "Federal Judge Tanya Williams has sparked a new wave of national debate following remarks that, while intended to promote inclusion, have been viewed by many conservative sectors as a troubling sign of the ideological bias creeping into the U.S.\nThe post Repre…",
    "link": "https://gatewayhispanic.com/video/representation-in-justice-judge-williams-words-rekindle-debate-over-inclusivity-in-u-s-courts/",
    "timestamp": "2025-05-31T13:15:43Z"
  },
  {
    "title": "Trump’s local deportation army: New ICE strategy alarms local police",
    "description": "During his first few months in office, President Donald Trump has been establishing a framework for deporting undocumented immigrants\r\n en masse\r\n. It’s something he has previously vowed\r\n will be “the largest deportation operation in the history of our count…",
    "link": "https://www.rawstory.com/trumps-local-deportation-army-new-ice-strategy-alarms-local-police/",
    "timestamp": "2025-05-31T13:11:56Z"
  },
  {
    "title": "Gabbard considering ways to revamp Trump's intelligence briefing (NBC News)",
    "description": "NBC News:\nGabbard considering ways to revamp Trump's intelligence briefing  —  One idea is to make the briefing, which according to his schedule Trump has been taking less often than his predecessors, a video that looks like Fox News.  —  WASHINGTON — Preside…",
    "link": "https://www.memeorandum.com/250531/p10",
    "timestamp": "2025-05-31T13:10:00Z"
  },
  {
    "title": "EU slams US over 50% steel, aluminum tariffs",
    "description": "The European Commission strongly criticized the plans of the administration of United States President Donald Trump to hike tariffs on steel and aluminum to 50%.\"We strongly regret the announced incre...",
    "link": "https://biztoc.com/x/fcf2bf58236836e3",
    "timestamp": "2025-05-31T13:09:32Z"
  },
  {
    "title": "Place your bets: Donald Trump vs. the bond markets. The odds favour the bonds",
    "description": "You would think that U.S. President Donald Trump would know better. Here is a man who built his fortunes largely on real estate and such empires are not concocted with cash. They are financed by commercial mortgages and bonds are backed by them. In other word…",
    "link": "https://biztoc.com/x/7651c1c9e7309b8c",
    "timestamp": "2025-05-31T13:09:15Z"
  },
  {
    "title": "The Futile Quest to Build a “Liberal Joe Rogan”",
    "description": "Experts question Democrats’ $20 million plan to make content with an “aspirational vision of manhood that aligns with Democratic values.\"\nThe post The Futile Quest to Build a “Liberal Joe Rogan”  appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/31/liberal-joe-rogan-democrats-men/",
    "timestamp": "2025-05-31T13:08:40Z"
  },
  {
    "title": "IAEA warns Iran has upped enriched uranium production",
    "description": "The international nuclear watchdog said Iran's stocks of 60% enriched uranium have increased to over 400 kilograms. It also criticized Iran for a \"lack of cooperation.\" The UN's International Atomic Energy Agency (IAEA) said that Iran has increased its produc…",
    "link": "https://www.dw.com/en/iaea-warns-iran-has-upped-enriched-uranium-production/a-72744504",
    "timestamp": "2025-05-31T13:08:00Z"
  },
  {
    "title": "OPEC+ announces sharp increase in July oil production",
    "description": "Saudi Arabia, Russia and six other key OPEC+ members announced on Saturday a huge increase in crude production for July. They will produce an additional 411,000 barrels a day — the same target set for May and then June — according to a statement, which is mor…",
    "link": "https://www.digitaljournal.com/world/opec-announces-sharp-increase-in-july-oil-production/article",
    "timestamp": "2025-05-31T13:07:33Z"
  },
  {
    "title": "DAVID BLACKMON: Did Trump And Hochul Just Swap An Offshore Wind Farm For A Pipeline?",
    "description": "When I wrote about the potential revival of the Constitution Pipeline project here two weeks ago, I received several notes assuring me it would never be permitted by the New York state government, with others asking who would be willing to risk the capital to…",
    "link": "https://dailycaller.com/2025/05/31/opinion-did-trump-and-hochul-just-swap-an-offshore-wind-farm-for-a-pipeline-david-blackmon/",
    "timestamp": "2025-05-31T13:02:34Z"
  },
  {
    "title": "Iran has amassed even more near weapons-grade uranium, U.N. watchdog says",
    "description": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the U.N. nuclear watchdog said Saturday.",
    "link": "https://www.nbcnews.com/world/iran/iran-uranium-weapons-grade-nuclear-deal-talks-trump-khamenei-watchdog-rcna210113",
    "timestamp": "2025-05-31T13:02:16Z"
  },
  {
    "title": "Homebuying options remain slim for middle-income earners",
    "description": "High interest rates and prices in a still-competitive market makes it tough for buyers.",
    "link": "https://www.denverpost.com/2025/05/31/middle-income-homebuying-options/",
    "timestamp": "2025-05-31T13:00:47Z"
  },
  {
    "title": "Homebuying options remain slim for middle-income earners",
    "description": "High interest rates and prices in a still-competitive market makes it tough for buyers.",
    "link": "https://www.bostonherald.com/2025/05/31/middle-income-homebuying-options/",
    "timestamp": "2025-05-31T13:00:47Z"
  },
  {
    "title": "Trump calls out Putin, accuses China of not honoring trade deal terms during 19th week in office",
    "description": "President Donald Trump put Russian President Vladimir Putin on notice, and issued some harsh words to China and their ongoing trade negotiations during his 19th week in office.",
    "link": "https://www.foxnews.com/politics/trump-calls-out-putin-walks-back-trade-deal-china-during-19th-week-office",
    "timestamp": "2025-05-31T13:00:09Z"
  },
  {
    "title": "Father Of DJ Daniel Gives Heartbreaking Health Update About Son - TFPP Wire",
    "description": "DJ Daniel, the 13-year-old cancer patient known nationwide for being sworn into over 1,300 law enforcement agencies, is now facing a serious new health challenge. His father revealed DJ is battling three new tumors as Americans offer prayers for this […]",
    "link": "https://tfppwire.com/father-of-dj-daniel-gives-heartbreaking-health-update-about-son/",
    "timestamp": "2025-05-31T13:00:05Z"
  },
  {
    "title": "Watch: Nearly 79-Year-Old President Trump Takes Reporters’ Questions in the Pouring Rain Without an Umbrella at the End of a Long Day",
    "description": "Wearing just a MAGA hat and an overcoat to keep himself dry, President Donald Trump capped a long day by talking to reporters for over six minutes in the pouring rain without an umbrella Friday night as he returned to D.C.\nThe post Watch: Nearly 79-Year-Old P…",
    "link": "https://www.thegatewaypundit.com/2025/05/watch-nearly-79-year-old-president-trump-takes/",
    "timestamp": "2025-05-31T13:00:02Z"
  },
  {
    "title": "Trump left West Point graduation early. Here's what we know about rumor he played golf afterward",
    "description": "Following U.S. President Donald Trump's May 24, 2025, commencement address at the U.S. Military Academy at West Point, he departed early without honoring a tradition of staying during the diploma ceremony, with a video showing him shortly thereafter golfing o…",
    "link": "https://www.snopes.com//fact-check/golf-trump-west-point-graduation/",
    "timestamp": "2025-05-31T13:00:00Z"
  },
  {
    "title": "Bitcoin all-time high, five US states enact crypto laws: May in Charts",
    "description": "This month, Bitcoin hit $111,000, crypto laws in the United States blazed ahead yet again, and Coinbase joined the S&P 500.",
    "link": "https://cointelegraph.com/news/111k-bitcoin-all-time-high-states-crypto-laws-may-charts",
    "timestamp": "2025-05-31T13:00:00Z"
  },
  {
    "title": "Iran has amassed even more near weapons-grade uranium, UN watchdog says",
    "description": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the UN nuclear watchdog said Saturday, and called on Tehran to urgently change course and comply with the agency's probe.",
    "link": "https://www.cbc.ca/news/world/iran-nuclear-weapons-report-1.7549075",
    "timestamp": "2025-05-31T12:53:29Z"
  },
  {
    "title": "Trump Hikes Steel Tariffs to 50% in Rally Pledge And Embraces Nippon Takeover",
    "description": "Trump announced a dramatic hike in tariffs on steel imports to 50%, hailing it as a boost for American workers, while backing the Nippon Steel acquisition.\nThe post Trump Hikes Steel Tariffs to 50% in Rally Pledge And Embraces Nippon Takeover first appeared o…",
    "link": "https://www.mediaite.com/media/tv/trump-hikes-steel-tariffs-to-50-in-rally-pledge-and-embraces-nippon-takeover/",
    "timestamp": "2025-05-31T12:52:46Z"
  },
  {
    "title": "A Tense Poland Votes as the World Watches",
    "description": "Poland will hold a presidential runoff election on Sunday, with polls indicating a neck-and-neck race between a liberal pro-European Union mayor and a Trump-backed conservative from...",
    "link": "https://www.realclearpolitics.com/articles/2025/05/31/a_tense_poland_votes_as_world_watches_152864.html",
    "timestamp": "2025-05-31T12:47:35Z"
  },
  {
    "title": "US judge prevents Trump from invalidating 5,000 Venezuelans' legal documents",
    "description": "(Reuters) -A federal judge prevented the Trump administration from invalidating work permits and other documents granting lawful status to about 5,000 Venezuelans, a subset of the nearly 350,000 whose temporary legal protections the U.S. Supreme Court last we…",
    "link": "https://www.thestar.com.my/news/world/2025/05/31/us-judge-prevents-trump-from-invalidating-5000-venezuelans039-legal-documents",
    "timestamp": "2025-05-31T12:42:00Z"
  },
  {
    "title": "Hamas seeks amendments to the US ceasefire proposal for Gaza",
    "description": "By SAM MEDNICK and SAMY MAGDY TEL AVIV, Israel (AP) — Hamas has responded to the latest U.S. ceasefire proposal for Gaza, and a senior official with the group tells The Associated Press they are seeking amendments to it. “There some notes and amendments to so…",
    "link": "https://www.denverpost.com/2025/05/31/hamas-seeks-amendments-to-the-us-ceasefire-proposal-for-gaza/",
    "timestamp": "2025-05-31T12:41:16Z"
  },
  {
    "title": "Hamas seeks amendments to Gaza ceasefire proposal but US envoy calls it ‘unacceptable’",
    "description": "By SAM MEDNICK and SAMY MAGDY TEL AVIV, Israel (AP) — Hamas has responded to the latest U.S. ceasefire proposal for Gaza, and a senior official with the group tells The Associated Press they are seeking amendments to it. “There some notes and amendments to so…",
    "link": "https://www.denverpost.com/2025/05/31/hamas-seeks-amendments-to-gaza-ceasefire-proposal-but-us-envoy-calls-it-unacceptable/",
    "timestamp": "2025-05-31T12:41:16Z"
  },
  {
    "title": "Pete Hegseth reassures allies that U.S. will support them against China",
    "description": "U.S. Defense Secretary Pete Hegseth​ reassured allies in the Indo-Pacific on Saturday that they will not be left alone to face increasing military and economic pressure from China.",
    "link": "https://www.cbsnews.com/news/pete-hegseth-reassures-allies-us-will-support-them-pressure-china/",
    "timestamp": "2025-05-31T12:37:26Z"
  },
  {
    "title": "Iran has increased stockpile of highly enriched uranium, watchdog reveals",
    "description": "UN nuclear agency reiterates urgent call for co-operation",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/31/iran-has-increased-stockpile-of-highly-enriched-uranium-watchdog-reveals/",
    "timestamp": "2025-05-31T12:34:59Z"
  },
  {
    "title": "Viral, raunchy ‘ParkTok’ trend aims to raise awareness of spending cuts to national parks | CNN Business",
    "description": "The 10-second video begins with a close-up on the abs of a sweaty, shirtless man wearing low-slung, gray sweatpants. But three seconds in, it cuts to a panoramic video of Havasu Falls in Arizona, with its striking turquoise water cascading down from red rocks.",
    "link": "https://www.cnn.com/2025/05/31/tech/parktok-tiktok-trend-trump-national-parks",
    "timestamp": "2025-05-31T12:33:10Z"
  },
  {
    "title": "Iran has increased stockpile of highly enriched uranium, UN's nuclear watchdog says",
    "description": "IAEA chief Rafael Mariano Grossi has warned that ‘Iran is the only non-nuclear weapon state enriching to this level’.",
    "link": "https://www.thejournal.ie/iran-uranium-6720495-May2025/",
    "timestamp": "2025-05-31T12:31:07Z"
  },
  {
    "title": "Trump Jokes When Reporter Confronts Him About Breach Of Chief’s Phone",
    "description": "Trump joked with a reporter when he was asked about a reported breach of a phone belonging to White House Chief of Staff Susie Wiles.\nThe post Trump Jokes When Reporter Confronts Him About Breach Of Chief’s Phone first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-jokes-when-reporter-confronts-him-about-breach-of-chiefs-phone/",
    "timestamp": "2025-05-31T12:27:37Z"
  },
  {
    "title": "Trump tells US steelworkers he’s going to double tariffs on foreign steel to 50%",
    "description": "President Donald Trump says he’s doubling the tariff rate on steel to 50%, a dramatic increase that could further push up prices for a metal used to make housing, autos and other goods",
    "link": "https://www.wsbtv.com/news/trump-tells-us/7HAO5KRWGRAU5KSC2EYN4GKBQA/",
    "timestamp": "2025-05-31T12:26:26Z"
  },
  {
    "title": "Trump called TACO, now his press secretary gets her own nickname — here’s who coined it and why it matters",
    "description": "Trump’s press secretary Karoline Leavitt called some judges unfair. A former Trump lawyer, Ty Cobb, didn’t like it and gave her a nickname.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-called-taco-now-his-press-secretary-gets-her-own-nickname-heres-who-coined-it-and-why-it-matters/articleshow/121535583.cms",
    "timestamp": "2025-05-31T12:26:14Z"
  },
  {
    "title": "Pete Hegseth calls on Asia to boost military spending in face of ‘imminent’ threat from China",
    "description": "US defence secretary says China is ‘rehearsing for the real deal’",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/05/31/pete-hegseth-calls-on-asia-to-boost-military-spending-in-face-of-imminent-threat-from-china/",
    "timestamp": "2025-05-31T12:15:01Z"
  },
  {
    "title": "Top EU Diplomat Praises Trump's 'Tough Love' Demands to Spend More on Defence",
    "description": "The European Union's diplomatic chief Kaja Kallas said Saturday the continent was beefing up defence spending after \"tough love\" from the Trump administration, as she called for stronger ties to counter China's \"economic might\".\nThe post Top EU Diplomat Prais…",
    "link": "https://www.breitbart.com/europe/2025/05/31/top-eu-diplomat-praises-trumps-tough-love-demands-to-spend-more-on-defence/",
    "timestamp": "2025-05-31T12:13:22Z"
  },
  {
    "title": "Former Democrat Strategist Points to Party's Biden Problem: Nobody Will Say 'Hey Joe, This Isn't Good for You'",
    "description": "Former Democrat Strategist Points to Party's Biden Problem: Nobody Will Say 'Hey Joe, This Isn't Good for You'westernjournal.com",
    "link": "https://www.westernjournal.com/nobody-can-get-stop-fmr-democrat-strategist-baffled-bidens-latest-remarks-democracy/",
    "timestamp": "2025-05-31T12:12:34Z"
  },
  {
    "title": "Israel's Netanyahu says international community 'must act now to stop Iran' after IAEA report",
    "description": "Following a UN watchdog report claiming that Iran has further increased its stockpile of uranium enriched to near weapons-grade, Israeli PM Netanyahu  said Tehran is 'totally determined to complete its nuclear weapons program'",
    "link": "https://www.haaretz.com/israel-news/2025-05-31/ty-article/israels-netanyahu-says-intl-community-must-act-now-to-stop-iran-after-iaea-report/00000197-2630-da41-a9f7-3fb4ce450000",
    "timestamp": "2025-05-31T12:08:40Z"
  },
  {
    "title": "Trump advises the Macrons on face-shoving incident, says they need to ensure the door remains closed",
    "description": "A playful shove by Brigitte Macron on a plane sparked global buzz, drawing unsolicited advice from Donald Trump. Trump, alongside Elon Musk, downplayed marital trouble rumors, joking about keeping private matters 'behind closed doors.'",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-advises-the-macrons-on-face-shoving-incident-says-they-need-to-ensure-the-door-remains-closed/articleshow/121535464.cms",
    "timestamp": "2025-05-31T12:07:54Z"
  },
  {
    "title": "Trump fast-tracks Utah uranium mine, but industry revival may wait for higher prices",
    "description": "In the southeastern Utah desert famous for red rock arches and canyon labyrinths, the long-dormant uranium mining industry is looking to revive under...",
    "link": "https://www.yahoo.com/news/trump-fast-tracks-utah-uranium-120714597.html",
    "timestamp": "2025-05-31T12:07:14Z"
  },
  {
    "title": "Trump fast-tracks Utah uranium mine, but industry revival may wait for higher prices",
    "description": "By MEAD GRUVER and HANNAH SCHOENBAUM SALT LAKE CITY (AP) — In the southeastern Utah desert famous for red rock arches and canyon labyrinths, the long-dormant uranium mining industry is looking to revive under President Donald Trump. Hundreds of abandoned uran…",
    "link": "https://www.denverpost.com/2025/05/31/trump-fast-tracks-utah-uranium-mine-but-industry-revival-may-wait-for-higher-prices/",
    "timestamp": "2025-05-31T12:07:14Z"
  },
  {
    "title": "Tim Scott Smears It On Thick For Elon Musk",
    "description": "This is an otherworldly segment on Fox Business...\nSen. Tim Scott went into over-the-top praise mode for Elon Musk and DOGE. Elon, that guy who lied and said 300-year-olds were receiving Social Security benefits. They were not.\nAt one time Sen. Tim Scott was …",
    "link": "https://crooksandliars.com/2025/05/sen-tim-scott-lies-service-elon-musk",
    "timestamp": "2025-05-31T12:03:30Z"
  },
  {
    "title": "Peter Navarro Complains That Trump Appoints Rogue Judges",
    "description": "Former jailbird and Trump advisor Peter Navarro attacked the Court of International Trade judges for halting Trump's 'illegal\" tariffs by calling them \"rogue judges,\" including the judge appointed by Trump.\nThe Trump administration is in a panic over the late…",
    "link": "https://crooksandliars.com/2025/05/peter-navarro-trump-appoints-rogue-judges",
    "timestamp": "2025-05-31T12:03:16Z"
  },
  {
    "title": "Brent Slides Below $64 as Trump and OPEC Rattle Crude Markets",
    "description": "A turbulent week for global energy markets saw oil prices slide amid OPEC+ uncertainty and escalating U.S.-China tensions.\nThe double whammy of OPEC+’s unpredictability and Donald Trump’s heated rhetoric over China ‘totally violating its agreement’ with the U…",
    "link": "https://biztoc.com/x/1258e0a0f3140eb7",
    "timestamp": "2025-05-31T12:02:57Z"
  },
  {
    "title": "DOUG SCHOEN: I'm a Harvard grad. Here's my take what Trump's doing right and wrong",
    "description": "Amidst antisemitism concerns, Harvard's policies are under fire from Trump, with some advocating for reforms without harming scientific research.",
    "link": "https://www.foxnews.com/opinion/doug-schoen-im-harvard-grad-heres-my-take-what-trumps-doing-right-wrong",
    "timestamp": "2025-05-31T12:00:58Z"
  },
  {
    "title": "The 47 Best Memes This Month: All Of May’s Funniest Memes In One Place",
    "description": "It is hard to believe the month of May is over today but time flies when we’re having fun. To close out May, we have the 47 best memes this month for everyone to enjoy on this fine Saturday. As expected, a lot of the memes below are from throughout this entir…",
    "link": "https://brobible.com/culture/article/47-best-memes-this-month-may-2025/",
    "timestamp": "2025-05-31T12:00:33Z"
  },
  {
    "title": "‘Mid-Century Modern’ Star Reimagines A Judy Garland Classic — For A Great Cause",
    "description": "The star of Hulu's “Mid-Century Modern” will be celebrated at the 13th annual “Night of a Thousand Judys,” set to take place June 2 in New York.",
    "link": "https://www.huffpost.com/entry/nathan-lee-graham-judy-garland-nyc-concert_n_6837da5ce4b06202aa90e600",
    "timestamp": "2025-05-31T12:00:08Z"
  },
  {
    "title": "Here are the retailers raising prices as Trump tariffs take hold",
    "description": "Retailers including Costco and Best Buy have already raised prices as a way to mitigate the tariff impact.",
    "link": "https://www.cnbc.com/2025/05/31/trump-tariffs-here-are-the-retailers-raising-prices.html",
    "timestamp": "2025-05-31T12:00:01Z"
  },
  {
    "title": "Many Black Colleges Lack Adequate Internet Access. One Group Is Trying to Change That",
    "description": "Many of the country's top historically Black colleges and universities can't access high-speed internet but non-federal sources are helping close this broadband gap.",
    "link": "https://www.cnet.com/home/internet/many-black-colleges-lack-adequate-internet-access-one-group-is-trying-to-change-that/",
    "timestamp": "2025-05-31T12:00:00Z"
  },
  {
    "title": "CBS Is Tortured by Trump, Puts Rage Into ‘60 Minutes’",
    "description": "CBS News thinks the crown jewel of its news division is “60 Minutes,” the alleged gold standard of investigative journalism on television. But when it... Read More\nThe post CBS Is Tortured by Trump, Puts Rage Into ‘60 Minutes’ appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/05/31/cbs-is-tortured-by-trump-puts-rage-into-60-minutes/",
    "timestamp": "2025-05-31T12:00:00Z"
  },
  {
    "title": "Centrica Expands to New York With Build-Out of Gas Trading Unit",
    "description": "Centrica Plc is opening a trading office in New York.",
    "link": "https://www.rigzone.com/news/wire/centrica_expands_to_new_york_with_buildout_of_gas_trading_unit-31-may-2025-180696-article/",
    "timestamp": "2025-05-31T12:00:00Z"
  },
  {
    "title": "Tariffs Explained: Everything You Need to Know as Trump's Policies Go to Court",
    "description": "Donald Trump's wide-ranging taxes on imports were reinstated this week after being deemed illegal by a trade court. Their ultimate fate is yet to be decided.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-everything-you-need-to-know-as-trumps-policies-go-to-court/",
    "timestamp": "2025-05-31T12:00:00Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday,  shabbos for Jewish cats, and we’re nearly into June. as it’s May 31, 2025.  It’s National Macaroon Day, and don’t mistake the American brand—soft, chewy, and tasty coconut cookies—for the frou-frou French macarons, which are overpri…",
    "link": "https://whyevolutionistrue.com/2025/05/31/saturday-hili-dialogue-534/",
    "timestamp": "2025-05-31T11:45:44Z"
  },
  {
    "title": "Transgender teenager athlete sparks medal decision after criticism from US President Donald Trump",
    "description": "California’s high school track-and-field state finals will award one extra medal in events where a transgender athlete places in the top three, in a rule change that may be the first of its kind nationally by a high school sports governing body.",
    "link": "https://www.independent.ie/sport/other-sports/athletics/transgender-teenager-athlete-sparks-medal-decision-after-criticism-from-us-president-donald-trump/a1257687931.html",
    "timestamp": "2025-05-31T11:45:38Z"
  },
  {
    "title": "Trump Responds to Potential Sean 'Diddy' Combs Pardon",
    "description": "President Donald Trump on Friday did not rule out pardoning Sean “Diddy” Combs if the music mogul was found guilty of racketeering and sex trafficking. Trump said he’d “look at the facts,” noting he and Combs used to have a friendly relationship but the two h…",
    "link": "https://www.today.com/video/trump-addresses-if-he-d-consider-sean-diddy-combs-pardon-240652869956",
    "timestamp": "2025-05-31T11:45:08Z"
  },
  {
    "title": "Ukraine expands evacuations amid offensive fears",
    "description": "KYIV - Ukraine ordered the evacuation of 11 more villages in its Sumy region bordering Russia on Saturday amid fears Moscow was gearing up for a fresh ground assault.",
    "link": "https://www.bangkokpost.com/world/3038926/ukraine-expands-evacuations-amid-offensive-fears",
    "timestamp": "2025-05-31T11:45:00Z"
  },
  {
    "title": "Elon Musk departs DOGE with a horrific legacy",
    "description": "Elon Musk’s time with the Department of Government Efficiency has ended, but not before a press availability at the White House alongside President Donald Trump.",
    "link": "https://biztoc.com/x/6bae6a4ab06d0627",
    "timestamp": "2025-05-31T11:40:29Z"
  },
  {
    "title": "Wall Street warns Trump aides the GOP tax bill could jolt bond markets",
    "description": "The Republican tax bill, a top legislative priority for President Donald Trump, could damage the broader economy and rattle the U.S. bond market, according to Wall Street experts.",
    "link": "https://biztoc.com/x/9a7e2a88d00e7a2c",
    "timestamp": "2025-05-31T11:40:25Z"
  },
  {
    "title": "Travelers are taking ‘a more frugal approach’ to summer vacations this year, expert says",
    "description": "Earlier this spring, consumers were feeling good about their summer vacation prospects. More people were planning to take a trip compared to last year, and summer travel budgets were up, too, according to a new report from Deloitte.\nBut just a few weeks later…",
    "link": "https://biztoc.com/x/c51148abbce4b815",
    "timestamp": "2025-05-31T11:40:04Z"
  },
  {
    "title": "Todd Chrisley Makes First Public Comments After Trump Pardon",
    "description": "Todd Chrisley is speaking out after he and his wife Julie Chrisley were released from prison following a pardon from President Donald Trump. With his daughter Savannah by his side, he said he’s grateful to the White House and that he plans to “expose the corr…",
    "link": "https://www.today.com/video/todd-chrisley-speaks-out-for-first-time-since-his-prison-release-240654917792",
    "timestamp": "2025-05-31T11:38:31Z"
  },
  {
    "title": "\"Le mot, c'est moi\"",
    "description": "\"Why the president must not be lexicographer-in-chief\", The Economist 5/30/2025: ON MAY 28TH a specialist American court for international trade struck down many of Donald Trump’s tariffs. It did so on several legal grounds, including linguistic ones. As in s…",
    "link": "https://languagelog.ldc.upenn.edu/nll/?p=69340",
    "timestamp": "2025-05-31T11:37:28Z"
  },
  {
    "title": "Travelers are taking ‘a more frugal approach’ to summer vacations this year, expert says",
    "description": "More people plan to take a leisure vacation this summer. But some have pulled back on their budgets.",
    "link": "https://www.cnbc.com/2025/05/31/how-to-save-on-summer-travel-in-2025.html",
    "timestamp": "2025-05-31T11:30:01Z"
  },
  {
    "title": "Saylor's bitcoin buying strategy is 'exploding' globally, but Wall Street is skeptical",
    "description": "Michael Saylor applauds efforts by other companies to replicate his strategy of using cash to buy bitcoin.",
    "link": "https://www.cnbc.com/2025/05/31/saylor-bitcoin-buying-strategy-exploding-but-wall-street-skeptical.html",
    "timestamp": "2025-05-31T11:30:01Z"
  },
  {
    "title": "What happens to Trump's tariffs now that a court has knocked them down?",
    "description": "The legal challenge to Trump's tariff is widely expected to end up at the U.S. Supreme Court.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_38cfe74f-05a7-51aa-b103-14e6a8db2ee0.html",
    "timestamp": "2025-05-31T11:30:00Z"
  },
  {
    "title": "What happens to Trump's tariffs now that a court has knocked them down?",
    "description": "The legal challenge to Trump's tariff is widely expected to end up at the U.S. Supreme Court.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_677b00ed-4ade-5c8d-b263-68cc1564b7f8.html",
    "timestamp": "2025-05-31T11:30:00Z"
  },
  {
    "title": "Trump's Approval Rating Hits Second-Term Low With Most Accurate Pollster",
    "description": "AtlasIntel was ranked the most accurate polling company of the 2024 election by survey veteran Nate Silver.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2079291",
    "timestamp": "2025-05-31T11:26:57Z"
  },
  {
    "title": "Kyiv’s allies have lifted restrictions on Ukraine attacking targets inside Russia – here’s what that means for the war",
    "description": "Kyiv is hoping that being able to hit targets inside Russia will give it the strategic edge it has lacked until now.",
    "link": "https://theconversation.com/kyivs-allies-have-lifted-restrictions-on-ukraine-attacking-targets-inside-russia-heres-what-that-means-for-the-war-257841",
    "timestamp": "2025-05-31T11:25:51Z"
  },
  {
    "title": "Investors are calling Trump a chicken – here’s why that matters",
    "description": "Trump clearly resents the jibe – and if it encourages him to double down on bad decisions the economic results could be serious.",
    "link": "https://theconversation.com/investors-are-calling-trump-a-chicken-heres-why-that-matters-257926",
    "timestamp": "2025-05-31T11:25:48Z"
  },
  {
    "title": "Kibbutz tractors roll into Tel Aviv, demand return of 58 hostages",
    "description": "Tractors were decorated with flags and signs of the remaining captive hostages.",
    "link": "https://www.jpost.com/breaking-news/article-856146",
    "timestamp": "2025-05-31T11:23:30Z"
  },
  {
    "title": "Iran has increased stockpile of highly enriched uranium, watchdog says",
    "description": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the UN nuclear watchdog said.",
    "link": "https://www.independent.ie/world-news/middle-east/iran-has-increased-stockpile-of-highly-enriched-uranium-watchdog-says/a854506374.html",
    "timestamp": "2025-05-31T11:22:49Z"
  },
  {
    "title": "Trump Says US Will Double Steel Import Tariffs to 50%",
    "description": "President Donald Trump says he will double tariffs on steel imported into the United States despite his trade war hitting legal setbacks. It comes as Trump also expresses anger over the ongoing trade talks with China, saying the country “has totally violated …",
    "link": "https://www.today.com/video/trump-raises-steel-tariffs-to-50-slams-china-over-trade-talks-240652869895",
    "timestamp": "2025-05-31T11:21:48Z"
  },
  {
    "title": "At least 10 killed, 33 injured in Russian attacks across Ukraine overnight, officials say",
    "description": "At least 10 killed, 33 injured in Russian attacks across Ukraine overnight, officials saygo.com",
    "link": "https://abcnews.go.com/International/10-killed-33-injured-russian-attacks-ukraine-overnight/story?id=122375968",
    "timestamp": "2025-05-31T11:15:14Z"
  },
  {
    "title": "Iran has amassed even more near weapons-grade uranium, UN watchdog says",
    "description": "The U.N. nuclear watchdog says Iran has further increased its stockpile of uranium enriched to near weapons-grade levels",
    "link": "https://abcnews.go.com/International/wireStory/iran-amassed-weapons-grade-uranium-watchdog-122375967",
    "timestamp": "2025-05-31T11:14:41Z"
  },
  {
    "title": "Iran’s Near Bomb-Grade Uranium Stockpile Grows by a Record",
    "description": "Iran manufactured a record volume of uranium enriched just below the levels needed for nuclear weapons, complicating efforts to negotiate a peaceful resolution to international concerns over the Islamic Republic’s atomic ambitions.",
    "link": "https://financialpost.com/pmn/business-pmn/irans-near-bomb-grade-uranium-stockpile-grows-by-a-record",
    "timestamp": "2025-05-31T11:13:50Z"
  },
  {
    "title": "'Beat it until it's dead': Ex-prosecutor singles out pardon that may haunt Trump",
    "description": "During a recent interview with journalist Jim Acosta (formerly of CNN), former assistant U.S. Attorney Glenn Kirschner — who prosecuted cases in the prestigious District of Columbia office during both the George W. Bush and Barack Obama administrations — argu…",
    "link": "https://www.rawstory.com/trump-pardon-2672239912/",
    "timestamp": "2025-05-31T11:13:11Z"
  },
  {
    "title": "Ukraine expands evacuations in Sumy region amid offensive fears",
    "description": "Ukraine ordered the evacuation of 11 more villages in its Sumy region bordering Russia on Saturday amid fears Moscow was gearing up for a fresh ground assault. Russia claims to have captured several villages in the northeastern region in recent weeks, and has…",
    "link": "https://www.digitaljournal.com/world/ukraine-expands-evacuations-in-sumy-region-amid-offensive-fears/article",
    "timestamp": "2025-05-31T11:12:20Z"
  },
  {
    "title": "Ukraine expands evacuations in Sumy region amid offensive fears",
    "description": "Ukraine ordered the evacuation of 11 more villages in its Sumy region bordering Russia on Saturday amid fears Moscow was gearing up for a fresh ground...",
    "link": "https://www.yahoo.com/news/ukraine-expands-evacuations-sumy-region-111011240.html",
    "timestamp": "2025-05-31T11:10:11Z"
  },
  {
    "title": "OPEC+ Agrees on Third Oil Supply Surge to Deepen Price Slump",
    "description": "OPEC+ agreed to surge oil output by 411,000 barrels a day for the third month in a row, doubling down on a historic policy shift that has sent crude prices sinking.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-agrees-on-third-oil-supply-surge-to-deepen-price-slump",
    "timestamp": "2025-05-31T11:08:32Z"
  },
  {
    "title": "The Nuclear Trump Factor",
    "description": "Hardly a day goes by without the phrase \"Donald Trump is a danger to the world\" being given new life. The threat posed by the U.S. president applies of course to the U.S. itself, which is in danger of sliding into fascist authoritarianism, and to the planetar…",
    "link": "https://www.commondreams.org/opinion/trump-nuclear-war",
    "timestamp": "2025-05-31T11:07:03Z"
  },
  {
    "title": "MAGA’s ideological export to Romania failed. What now?",
    "description": "The historic victory of Romania’s president-elect, the pro-European centrist Nicușor Dan, shows the limits of the MAGA (Make America Great Again) project in Eastern Europe. His opponent, right-wing candidate George Simion, openly aligned himself with US Presi…",
    "link": "https://www.fairobserver.com/region/europe/magas-ideological-export-to-romania-failed-what-now/",
    "timestamp": "2025-05-31T11:06:35Z"
  },
  {
    "title": "CNN Anchor Confronts Attorney for Misgendering in Heated Clash Over Trans Athlete: ‘Who Is Her?!’",
    "description": "Hamill and CNN anchor Brianna Keilar sparred over transgender participation in high school sports as they debated the case of A.B. Hernandez.\nThe post CNN Anchor Confronts Attorney for Misgendering in Heated Clash Over Trans Athlete: ‘Who Is Her?!’ first appe…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchor-confronts-attorney-for-misgendering-in-heated-clash-over-trans-athlete-who-is-her/",
    "timestamp": "2025-05-31T11:06:34Z"
  },
  {
    "title": "6 Things Experts Say Could Happen To Social Security Over The Next 10 Years",
    "description": "Social Security benefits are a source of income for 68 million seniors, totaling more than $1.5 trillion in payouts annually, according to the Social...",
    "link": "https://finance.yahoo.com/news/experts-6-things-could-happen-120115100.html",
    "timestamp": "2025-05-31T11:01:08Z"
  },
  {
    "title": "BROADCAST BIAS: Media coverage of NPR lawsuit against Trump hides what public media really is",
    "description": "NPR defends against Trump's defunding efforts, citing First Amendment rights. The lawsuit reveals media bias and the lack of diverse viewpoints in coverage.",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-media-coverage-npr-lawsuit-against-trump-hides-what-public-media-really",
    "timestamp": "2025-05-31T11:00:48Z"
  },
  {
    "title": "How Putin Perplexed Trump. Plus, Three Cheers for Assault at Harvard Commencement.",
    "description": "Patience running thin: As spring turns to summer, Russia's offensive in Ukraine is growing stronger, and Donald Trump is growing frustrated. It's easy to see why, writes the Hudson Institute's Mike Watson. The Trump administration, Watson observes, \"believed …",
    "link": "https://freebeacon.com/newsletters/how-putin-perplexed-trump-plus-three-cheers-for-assault-at-harvard-commencement/",
    "timestamp": "2025-05-31T11:00:06Z"
  }
]