[
  {
    "title": "Pakistan Faces Diplomatic and Economic Crisis Following Deadly Attack in Jammu and Kashmir",
    "description": "…\nThe post Pakistan Faces Diplomatic and Economic Crisis Following Deadly Attack in Jammu and Kashmir appeared first on Global Research.",
    "link": "https://infobrics.org/post/44010",
    "timestamp": "2025-04-27T06:55:16Z"
  },
  {
    "title": "Ankara ready to work closely with Washington: Trade minister",
    "description": "Türkiye's Trade Minister Ömer Bolat said Friday that his country is closely following the new U.S. trade policies and is ready to remain and work in close dialogue.",
    "link": "https://www.hurriyetdailynews.com/ankara-ready-to-work-closely-with-washington-trade-minister-208511",
    "timestamp": "2025-04-27T06:52:16Z"
  },
  {
    "title": "It might be Carney vs. Poilievre to lead Canada, but Trump is unofficially on the ballot",
    "description": "Donald Trump might as well be on the ballot when Canadians vote for a new government",
    "link": "https://abcnews.go.com/International/wireStory/carney-poilievre-lead-canada-trump-unofficially-ballot-121208573",
    "timestamp": "2025-04-27T06:46:32Z"
  },
  {
    "title": "Shocked by US peace proposal, Ukrainians say they will not accept any formal surrender of Crimea",
    "description": "A peace proposal by the Trump administration that includes recognizing Russian authority over Crimea shocked Ukrainian officials",
    "link": "https://abcnews.go.com/International/wireStory/shocked-us-peace-proposal-ukrainians-accept-formal-surrender-121208481",
    "timestamp": "2025-04-27T06:46:26Z"
  },
  {
    "title": "Opinion: Are US And Taliban Drawing Up A 'Secret' Deal?",
    "description": "Against the labyrinthine workings of Afghan politics, the Americans are demanding weapons handover or control over Bagram.",
    "link": "https://www.ndtv.com/opinion/are-us-and-taliban-secretly-drawing-up-a-deal-8267903",
    "timestamp": "2025-04-27T06:34:13Z"
  },
  {
    "title": "Bitcoin breaks new highs, PAIRMiner helps you easily earn stable income!",
    "description": "While the global market is in turmoil due to the latest trade policy of US […]",
    "link": "https://ambcrypto.com/bitcoin-breaks-new-highs-pairminer-helps-you-easily-earn-stable-income/",
    "timestamp": "2025-04-27T06:30:01Z"
  },
  {
    "title": "US economy was already sputtering before trade pain from Trump's tariffs kicked in",
    "description": "Global economy faces challenges in early 2025. US GDP growth slows down significantly. Trade tensions and tariff policies impact international markets. Canada anticipates election amid trade war with US. China's industrial profits rebound, but tariffs pose ri…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-economy-was-already-sputtering-before-trade-pain-from-trumps-tariffs-kicked-in/articleshow/120662193.cms",
    "timestamp": "2025-04-27T06:29:05Z"
  },
  {
    "title": "After meeting with Zelenskyy, Trump questions Putin’s willingness to stop Ukraine war",
    "description": "WASHINGTON DC: US President Donald Trump has questioned his Russian counterpart, Vladimir Putin’s willingness to stop the war and criticised recent missile strikes in Ukraine, CNN reported. Trump said after his meeting with Ukrainian President Volodymyr Zelen…",
    "link": "https://english.khabarhub.com/2025/27/461898/",
    "timestamp": "2025-04-27T06:26:53Z"
  },
  {
    "title": "Playing neutral or free hand to India? Teasing out Trump's post-Pahalgam comment",
    "description": "Following the Pahalgam attack, Donald Trump commented on India-Pakistan tensions. He mentioned the long-standing conflict over Kashmir. Trump believes they will resolve the situation. Some interpret his words as neutrality. Others see it as support for India …",
    "link": "https://economictimes.indiatimes.com/news/india/playing-neutral-or-free-hand-to-india-teasing-out-trumps-post-pahalgam-comment/articleshow/120662384.cms",
    "timestamp": "2025-04-27T06:21:57Z"
  },
  {
    "title": "Shocked by US peace proposal, Ukrainians say they will not accept any formal surrender of Crimea",
    "description": "A Trump administration peace proposal recognising Russian authority over Crimea has sparked outrage in Ukraine, with officials vowing never to formally surrender the peninsula. Experts say such a move is politically and legally impossible, requiring constitut…",
    "link": "https://economictimes.indiatimes.com/news/defence/shocked-by-us-peace-proposal-ukrainians-say-they-will-not-accept-any-formal-surrender-of-crimea/articleshow/120662286.cms",
    "timestamp": "2025-04-27T06:18:04Z"
  },
  {
    "title": "North Korean leader Kim Jong Un touts new naval destroyer with daughter, blames US for tensions",
    "description": "Kim criticized recent efforts by the United States and South Korea to expand joint military exercises and update their nuclear deterrence strategies, portraying them as preparations for war.",
    "link": "https://nypost.com/2025/04/27/world-news/north-korean-leader-kim-touts-new-naval-destroyer-blames-us-for-tensions/",
    "timestamp": "2025-04-27T06:17:59Z"
  },
  {
    "title": "It might be Carney vs Poilievre to lead Canada, but Trump is unofficially on ballot",
    "description": "Canada's election sees Donald Trump's influence. His trade war and remarks fueled nationalism. This helped the Liberal Party. Mark Carney leads polls after Justin Trudeau's exit. Pierre Poilievre faces challenges. Trump's stance impacts ideological allies. Bo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/it-might-be-carney-vs-poilievre-to-lead-canada-but-trump-is-unofficially-on-ballot/articleshow/120662217.cms",
    "timestamp": "2025-04-27T06:15:23Z"
  },
  {
    "title": "A Trump-Zelensky Meet At Vatican Basilica, Then A \"Dealt With\" Jab At Putin",
    "description": "US President Donald Trump has raised doubts about his Russian counterpart Vladimir Putin&#039;s willingness to end the war in Ukraine. Trump suggested Putin has been &quot;tapping me along&quot; and said the Russian leader &quot;has to be dealt with different…",
    "link": "https://www.ndtv.com/world-news/trump-zelensky-putin-vatican-a-trump-zelensky-meet-at-vatican-basilica-then-a-dealt-with-jab-at-putin-8267759",
    "timestamp": "2025-04-27T06:11:02Z"
  },
  {
    "title": "Texas launches its own state agency modeled after Elon Musk’s DOGE",
    "description": "Texas Gov. Greg Abbott signed Senate Bill 14, creating the Texas Regulatory Efficiency Office, inspired by President Donald Trump’s federal Department of Government Efficiency (DOGE). Like its federal counterpart, Texas DOGE aims to cut red tape, reduce waste…",
    "link": "https://www.naturalnews.com/2025-04-27-texas-launches-state-agency-modeled-after-doge.html",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "Trump administration scraps Kerryâ\u0080\u0099s climate office, citing ideological overreach",
    "description": "The Trump administration formally shut down the Office of the Special Presidential Envoy for Climate (led by John Kerry under Biden) in April 2025, ending a $17M/year operation. The move aligns with Trump’s push to reduce bureaucracy, prioritize economic grow…",
    "link": "https://www.naturalnews.com/2025-04-27-trump-administration-scraps-kerrys-climate-office.html",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "This subtly scathing Trump illustration nails minimalist design",
    "description": "A picture is worth a thousand words.",
    "link": "https://www.creativebloq.com/design/this-subtly-scathing-trump-illustration-nails-minimalist-design",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "Trump administration opposes Colorado bill that seeks to remove custody from parents on the basis of “MISGENDERING”",
    "description": "The Trump administration opposes Colorado’s Kelly Loving Act, which would allow courts to strip custody from parents who refuse to use a child’s preferred pronouns or gender identity, classifying such actions as “coercive control.” The bill has also sparked b…",
    "link": "https://www.naturalnews.com/2025-04-27-trump-admin-opposes-bill-remove-custody-misgendering.html",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "Former Biden-era disinfo czar urges Brussels to “stand firm” against criticism of censorship laws",
    "description": "Nina Jankowicz, former head of Biden’s disbanded Disinformation Governance Board, urged the EU to resist U.S. pressure – particularly under Trump’s second administration – to abandon digital censorship laws, reduce support for Ukraine and ease accountability …",
    "link": "https://www.naturalnews.com/2025-04-27-jankowicz-urges-brussels-resist-criticism-censorship-laws.html",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "Historic Vatican meeting: Trump and Zelensky seek peace amid Ukraine-Russia conflict",
    "description": "U.S. President Donald Trump and Ukrainian President Volodymyr Zelensky met for a 15-minute discussion in St. Peter’s Basilica, aiming to address the ongoing three-year war in Ukraine. The impromptu meeting, held in a chapel before a funeral mass, focused on s…",
    "link": "https://www.naturalnews.com/2025-04-27-trump-zelensky-seek-peace-ukraine-russia-conflict.html",
    "timestamp": "2025-04-27T06:00:00Z"
  },
  {
    "title": "Is mine the first generation thicker than our parents?",
    "description": "Just as every generation is a little taller than the previous one, each is mentally sharper than their predecessors. Until now",
    "link": "https://www.irishtimes.com/opinion/2025/04/27/is-mine-the-first-generation-thicker-than-our-parents/",
    "timestamp": "2025-04-27T05:55:00Z"
  },
  {
    "title": "The Crowning of Executive Power",
    "description": "Since taking office in January, Donald Trump has been hard at work rounding up innocent people for deportation, citing bogus, pretextual reasons related to alleged ties to drug cartels and terrorist organizations. Naturally, Trump does not want these claims t…",
    "link": "https://www.counterpunch.org/2025/04/27/the-crowning-of-executive-power/",
    "timestamp": "2025-04-27T05:48:31Z"
  },
  {
    "title": "Law students organize to give Trump-caving firms a recruitment problem",
    "description": "Politico then reported that these individual choices resonated industry-wide, speaking to students, recruiters, and partners at major law firms.\n\nNow, the firms themselves have tried to lobby the student organizers directly to get their rankings changed.\n\n“Fi…",
    "link": "https://www.allrisenews.com/p/skadden-students-georgetown",
    "timestamp": "2025-04-27T05:47:01Z"
  },
  {
    "title": "Trump trade war pushes firms to consider stockpiling",
    "description": "Trump trade war pushes firms to consider stockpilingenca.com",
    "link": "https://www.enca.com/business/trump-trade-war-pushes-firms-consider-stockpiling",
    "timestamp": "2025-04-27T05:41:55Z"
  },
  {
    "title": "Carney’s Liberals in pole position as Canada set to vote under Trump's shadow",
    "description": "Canada's election sees rising distrust of the US. A recent poll shows unfavorable views towards Donald Trump. Liberals gain support, positioning themselves against Trump's policies. Conservatives face challenges due to perceived alignment with the US Presiden…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carneys-liberals-in-pole-position-as-canada-set-to-vote-under-trumps-shadow/articleshow/120661229.cms",
    "timestamp": "2025-04-27T05:41:27Z"
  },
  {
    "title": "America will 'lead the pack' in strike on Iran if no deal is reached, Trump tells TIME",
    "description": "In a wide-ranging interview with TIME Magazine, the US President discussed the possibility of a broader conflict in the Middle East.",
    "link": "https://www.jpost.com/american-politics/article-851634",
    "timestamp": "2025-04-27T05:39:11Z"
  },
  {
    "title": "Trump Demands Free Passage For US Vessels Through Panama, Suez Canals",
    "description": "President Donald Trump on April 26 said US commercial and military vessels should be able to travel without charge through the Panama and Suez Canals, two of the world's most important waterway shortcuts.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250427-rferl02.htm",
    "timestamp": "2025-04-27T05:28:01Z"
  },
  {
    "title": "Former Malaysian PM warns U.S. tariffs will backfire",
    "description": "The continued imposition of unreasonable tariffs by the U.S. will backfire, with the administration of President Donald Trump likely to face mounting domestic pressure to reverse the policy, former Malaysian Prime Minister Mahathir Mohamad has warned.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250427-pdo01.htm",
    "timestamp": "2025-04-27T05:27:01Z"
  },
  {
    "title": "Indian, Pakistani Troops Exchange Fire In Kashmir Amid Mounting Tensions",
    "description": "Pakistani and Indian troops exchanged fire across the Line of Control in disputed Kashmir, officials said on April 25 as tensions between the two neighbors continued to increase following the killing of 26 tourists in Indian-administered Kashmir.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250426-rferl02.htm",
    "timestamp": "2025-04-27T05:26:42Z"
  },
  {
    "title": "No talks on tariffs between China, US: Chinese Foreign Ministry",
    "description": "A Chinese Foreign Ministry spokesperson said on Friday that there had been no talks between Beijing and Washington on tariffs.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250426-presstv01.htm",
    "timestamp": "2025-04-27T05:21:21Z"
  },
  {
    "title": "Trump Says 'Most Major Point' on Ukraine Agreed",
    "description": "US President Donald Trump has called on Russia and Ukraine to hold high-level talks to conclude a peace deal, with \"major points\" already agreed to.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250426-sputnik05.htm",
    "timestamp": "2025-04-27T05:19:14Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*Trump-Zelensky Talks*Trump Is On The 'Love Train'*The Real You Is In Your Heart*\"The Proud, The Avaricious, The Self-Righteous, Are In That Danger\"*",
    "description": "Newsdump Alerts: Trump, Zelensky Meet... Hundreds Hurt In Explosion In Iranian Port City... New Round Of US-Iran Talks Slated For Next Weekend... Another attempt at media excellence your host with you again \"Senator Dick Turban\" announcing his retirement this…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313531/posts",
    "timestamp": "2025-04-27T05:17:44Z"
  },
  {
    "title": "Trump, Zelenskyy Talk Peace Deal On Sidelines Of Pope Francis Funeral",
    "description": "US President Donald Trump met with his Ukrainian counterpart, Volodymyr Zelenskyy, ahead of the funeral of Pope Francis at the Vatican, as the two leaders look to make progress on high-stakes peace talks for the war in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250426-rferl03.htm",
    "timestamp": "2025-04-27T05:15:09Z"
  },
  {
    "title": "Trump, Zelensky hold 'productive' talks ahead of Pope's funeral in Rome",
    "description": "US President Donald Trump and Ukraine's President Volodymyr Zelenskyy have met one-on-one inside St Peter's Basilica, minutes before the start of the funeral of Pope Francis in the Vatican on Saturday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250426-presstv01.htm",
    "timestamp": "2025-04-27T05:15:07Z"
  },
  {
    "title": "After US Snubs London Meeting, What's Europe's Game Plan For Ukraine-Russia Peace Talks?",
    "description": "Over the past week, European nations largely represented by France, Germany, and the United Kingdom have tried their best to engage in talks between the United States, Ukraine, and Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250427-rferl01.htm",
    "timestamp": "2025-04-27T05:14:40Z"
  },
  {
    "title": "\"Evils Of Terrorism\": FBI Chief Kash Patel Condemns Pahalgam Terror Attack",
    "description": "FBI Chief Kash Patel described the deadly assault as a &quot;reminder of the constant threats our world faces from the evils of terrorism.&quot;",
    "link": "https://www.ndtv.com/india-news/evils-of-terrorism-fbi-chief-kash-patel-condemns-pahalgam-terror-attack-8267476",
    "timestamp": "2025-04-27T05:10:30Z"
  },
  {
    "title": "US Deports 3 American Children, Including Cancer Patient: Rights Groups",
    "description": "Three American children aged two, four and seven -- one of whom has a rare form of cancer -- have been deported from the United States alongside their undocumented immigrant mothers.",
    "link": "https://www.ndtv.com/world-news/us-deports-3-american-children-including-cancer-patient-rights-groups-8267448",
    "timestamp": "2025-04-27T05:05:37Z"
  },
  {
    "title": "White House journalists use annual press dinner to celebrate First Amendment",
    "description": "White House journalists use annual press dinner to celebrate First Amendmentclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/27/white-house-journalists-use-annual-press-dinner-to-celebrate-first-amendment/",
    "timestamp": "2025-04-27T05:05:30Z"
  },
  {
    "title": "Japan PM goes to Vietnam, the Philippines to talk tariffs",
    "description": "TOKYO: Japanese Prime Minister Shigeru Ishiba left Sunday (Apr 27) for a four-day trip to Vietnam and the Philippines, as Tokyo seeks to shore up regional ties after United States President Donald Trump's tariff onslaught. Ishiba's trip comes after China's Pr…",
    "link": "https://www.channelnewsasia.com/east-asia/japan-pm-vietnam-philippines-tariffs-5092581",
    "timestamp": "2025-04-27T05:04:28Z"
  },
  {
    "title": "Campgrounds and visitor centres at federal lakes are closing amid Trump's budget cuts",
    "description": "Due to Trump administration's efforts to shrink the government, the US Army Corps of Engineers is closing or curtailing hours at recreational facilities across six states, including campgrounds and visitor centers. Staffing shortages and budget cuts are forci…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/doge-impact-campgrounds-and-visitor-centres-at-federal-lakes-are-closing-amid-trumps-budget-cuts/articleshow/120660341.cms",
    "timestamp": "2025-04-27T05:01:37Z"
  },
  {
    "title": "Taiwanese firms in China shift focus amid rising US tariffs",
    "description": "Companies operating in China that primarily export to the US and rely on low gross profit margins are among the most severely affected by the tariff changes",
    "link": "https://www.thehindubusinessline.com/news/world/taiwanese-firms-in-china-shift-focus-amid-rising-us-tariffs/article69496892.ece",
    "timestamp": "2025-04-27T05:01:14Z"
  },
  {
    "title": "FG free malaria treatment for pregnant women suffers setback",
    "description": "Expectant mothers patronising public hospitals still pay for antimalarials out-of-pocket as fear of the impact of the United States aid cut heightens.",
    "link": "https://punchng.com/fg-free-malaria-treatment-for-pregnant-women-suffers-setback/",
    "timestamp": "2025-04-27T05:00:58Z"
  },
  {
    "title": "Maligned By Trump, White House Reporters Hold Subdued Annual Gala",
    "description": "The White House Correspondents&#039; Association staged its annual gala in a muted celebration amid mounting concerns about press freedom under Trump.",
    "link": "https://www.ndtv.com/world-news/maligned-by-trump-white-house-reporters-hold-subdued-annual-gala-8267409",
    "timestamp": "2025-04-27T05:00:28Z"
  },
  {
    "title": "Senator Elizabeth Warren warns of ‘extraordinary conflict’ as Trump expands crypto influence",
    "description": "Are the White House's assurances enough to quell growing concerns about Trump’s crypto interests?",
    "link": "https://ambcrypto.com/senator-elizabeth-warren-warns-of-extraordinary-conflict-as-trump-expands-crypto-influence/",
    "timestamp": "2025-04-27T05:00:10Z"
  },
  {
    "title": "Massive blow to Trump as Japanese car giant moves manufacturing OUT of US in tariff twist (Ben Shimkus/Daily Mail)",
    "description": "Ben Shimkus / Daily Mail:\nMassive blow to Trump as Japanese car giant moves manufacturing OUT of US in tariff twist  —  President Donald Trump's tariffs just cost America a chunk of Canadian business.  —  Subaru, which sold 68,043 cars in Canada in 2024, is r…",
    "link": "https://www.memeorandum.com/250427/p3",
    "timestamp": "2025-04-27T05:00:06Z"
  },
  {
    "title": "\"This is Not Normal\": Democrats Miss An Obvious Problem With The Arrest Of The Wisconsin Judge",
    "description": "“This is not normal.” Those words from Sen. Amy Klobuchar, D-Minn., are undeniably true after the arrest of Wisconsin Judge Hannah Dugan. However, the reason it is not normal is far more debatable. Dugan is accused of becoming a lawbreaker in seeking to obstr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313529/posts",
    "timestamp": "2025-04-27T04:40:50Z"
  },
  {
    "title": "Campgrounds and visitor centers at federal lakes are closing amid Trump's budget cuts",
    "description": "Campgrounds, boat ramps and other facilities in at least 30 locations at federal lakes and reservoirs in six states will be closed or have their hours curtailed as of mid-May",
    "link": "https://abcnews.go.com/US/wireStory/campgrounds-visitor-centers-federal-lakes-closing-amid-trumps-121207745",
    "timestamp": "2025-04-27T04:38:18Z"
  },
  {
    "title": "Labor Secretary Warns States Could Lose Federal Funding If Illegal Immigrants Get Unemployment Benefits",
    "description": "U.S. Secretary of Labor Lori Chavez-DeRemer warned states of losing federal funding if they fail to comply with President Donald Trump’s directives on rewarding illegal immigrants with tax dollars, according to an April 25 statement issued by the Department o…",
    "link": "https://freerepublic.com/focus/f-news/4313528/posts",
    "timestamp": "2025-04-27T04:37:51Z"
  },
  {
    "title": "TikTok to enter Japan's ecommerce industry: Nikkei report",
    "description": "TikTok will launch its online shopping platform, TikTok Shop, in Japan in June 2025, inviting local companies and individuals to join as sellers. The platform, known for discounted products and live-stream sales, is expanding globally as TikTok faces uncertai…",
    "link": "https://economictimes.indiatimes.com/tech/technology/tiktok-to-enter-japans-ecommerce-industry-nikkei-report/articleshow/120660060.cms",
    "timestamp": "2025-04-27T04:31:01Z"
  },
  {
    "title": "America's Second-Largest Grocery Chain Reportedly Isn't Stressing About Trump Tariffs",
    "description": "Albertsons, America's second-largest grocery chain, is reportedly informing suppliers that will be affected by the new Trump administration tariffs that it's not the company's problem, according to a recent letter:Albertsons, which owns 2,200 grocery stores a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313524/posts",
    "timestamp": "2025-04-27T04:25:17Z"
  },
  {
    "title": "Trump says Putin may not want peace, may need to be ‘dealt with differently’",
    "description": "President Donald Trump said Saturday that Russia&rsquo;s escalating bombardment of Ukraine had left him concerned that Russia did not want to end the war as he issued an unusually stern rebuke of President Vladimir Putin and threatened new sanctions on Moscow.",
    "link": "https://www.bangkokpost.com/world/3012242/trump-says-putin-may-not-want-peace-may-need-to-be-dealt-with-differently",
    "timestamp": "2025-04-27T04:24:00Z"
  },
  {
    "title": "Japan's Nintendo fans test Switch 2 ahead of launch amid tariff worries",
    "description": "Nintendo’s Switch 2 pre-launch event in Tokyo drew huge crowds, with fans eager to try new titles like Mario Kart World and Donkey Kong Bonanza. Despite tariff worries potentially raising prices, demand remains high-2.2 million applied for Japan’s lottery. Th…",
    "link": "https://economictimes.indiatimes.com/tech/technology/japans-nintendo-fans-test-switch-2-ahead-of-launch-amid-tariff-worries/articleshow/120659953.cms",
    "timestamp": "2025-04-27T04:17:34Z"
  },
  {
    "title": "Trump, the Suez Canal, and the end of Eisenhower’s World Order",
    "description": "Ann Arbor (Informed Comment) - AFP reports that Trump has said, 'American ships, both military and commercial, should be allowed to travel, free of charge, through the Panama and Suez canals!” He went on to allege that 'both routes' would not exist in the fir…",
    "link": "https://www.juancole.com/2025/04/trump-canal-eisenhowers.html",
    "timestamp": "2025-04-27T04:15:09Z"
  },
  {
    "title": "Trump has lowest 100-day approval rating in 80 years: POLL",
    "description": "Majorities of voters disapprove of many of Trump's policies, the poll found.",
    "link": "https://abcnews.go.com/Politics/trump-lowest-100-day-approval-rating-80-years/story?id=121165473",
    "timestamp": "2025-04-27T04:08:53Z"
  },
  {
    "title": "Maligned by Trump, White House reporters hold subdued annual gala",
    "description": "The White House Correspondents’ Association staged its annual gala on Saturday in a muted celebration amid mounting concerns about press freedom under President Donald Trump.  The dinner, while still as packed as previous years, took on a more somber, underst…",
    "link": "https://www.digitaljournal.com/world/maligned-by-trump-white-house-reporters-hold-subdued-annual-gala/article",
    "timestamp": "2025-04-27T04:03:15Z"
  },
  {
    "title": "Maligned By Trump, White House Reporters Hold Subdued Annual Gala",
    "description": "The White House Correspondents' Association staged its annual gala on Saturday in a muted celebration amid mounting concerns about press freedom under President Donald Trump.",
    "link": "https://www.ibtimes.com/maligned-trump-white-house-reporters-hold-subdued-annual-gala-3771536",
    "timestamp": "2025-04-27T04:00:26Z"
  },
  {
    "title": "Forget Trump’s blue suit. What about those so-called ‘transgender’ mourners at the Pope’s funeral?",
    "description": "The left has been all over the fact that Donald Trump dared to show up at Pope Francis’s funeral, not dressed in black, but instead wearing a very restrained blue suit and tie. Believe me, this is a non-story. What’s a bit more interestin...",
    "link": "https://www.americanthinker.com/blog/2025/04/forget_trump_s_blue_suit_what_about_those_so_called_transgender_mourners_at_the_pope_s_funeral.html",
    "timestamp": "2025-04-27T04:00:00Z"
  },
  {
    "title": "‘That’s a Tesla,’ my daughter said. ‘We don’t like them’",
    "description": "What we are living through now is truly grotesque, unbelievable, bizarre and unprecedented. And it’s getting more Gubu-ish by the day",
    "link": "https://www.irishtimes.com/life-style/people/2025/04/27/thats-a-tesla-my-daughter-said-we-dont-like-them/",
    "timestamp": "2025-04-27T04:00:00Z"
  },
  {
    "title": "Recruiting mysteriously, dramatically, increases",
    "description": "During the Biden’s Handler’s Administration, our armed forces experienced debilitating declines in recruiting. And if that wasn’t bad enough, our Idi Amin-resembling Secretary of Defense ejected some 8000 from the military for refus...",
    "link": "https://www.americanthinker.com/blog/2025/04/recruiting_mysteriously_dramatically_increases.html",
    "timestamp": "2025-04-27T04:00:00Z"
  },
  {
    "title": "Trump Demands Free Passage for US Ships Through Suez and Panama",
    "description": "US military and commercial ships should be able to cross the Panama and Suez canals free of charge because they \"would not exist without the United States,\" US President Donald Trump said on Saturday.",
    "link": "https://sputnikglobe.com/20250427/trump-demands-free-passage-for-us-ships-through-suez-and-panama-1121940858.html",
    "timestamp": "2025-04-27T03:59:00Z"
  },
  {
    "title": "Trump Trade War Pushes Firms To Consider Stockpiling",
    "description": "Stockpiling is the reflex response by firms to the imposition of tariffs, but with the rapidly-changing position of the Trump administration, companies are finding that it isn't so straightforward this time around.",
    "link": "https://www.ibtimes.com/trump-trade-war-pushes-firms-consider-stockpiling-3771534",
    "timestamp": "2025-04-27T03:45:22Z"
  },
  {
    "title": "Trump trade war pushes firms to consider stockpiling",
    "description": "PARIS - Stockpiling is the reflex response by firms to the imposition of tariffs, but with the rapidly-changing position of the Trump administration, companies are finding that it isn't so straightforward this time around.",
    "link": "https://www.bangkokpost.com/business/general/3012221/trump-trade-war-pushes-firms-to-consider-stockpiling",
    "timestamp": "2025-04-27T03:45:00Z"
  },
  {
    "title": "Trump trade war pushes firms to consider stockpiling",
    "description": "Stockpiling is the reflex response by firms to the imposition of tariffs, but with the rapidly-changing position of the Trump administration, companies are finding that it isn’t so straightforward this time around. Whether it’s the luxury, electronics or phar…",
    "link": "https://www.digitaljournal.com/world/trump-trade-war-pushes-firms-to-consider-stockpiling/article",
    "timestamp": "2025-04-27T03:42:32Z"
  },
  {
    "title": "White House journalists use annual press dinner to celebrate First Amendment",
    "description": "The stripped-down festivities at the White House Correspondents' Association's annual dinner were a reflection of the somber tone in Washington at the beginning of President Donald Trump’s second term.",
    "link": "https://www.nbcnews.com/politics/white-house/white-house-journalists-annual-press-dinner-rcna203180",
    "timestamp": "2025-04-27T03:41:20Z"
  },
  {
    "title": "Trump says US ships should have free use of Panama and Suez canals - The Guardian",
    "description": "Trump says US ships should have free use of Panama and Suez canalsThe Guardian Trump says US ships should be allowed to travel through the Panama and Suez canals for freeReuters Trump Says US Ships Need Free Travel Through Panama, Suez CanalsBloomberg.com Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177165631",
    "timestamp": "2025-04-27T03:32:42Z"
  },
  {
    "title": "Axios reporter hits media for whiffing on coverage of Biden’s decline at White House Correspondents’ Dinner",
    "description": "Axios reporter Alex Thompson called out the media at the White House Correspondents’ Dinner for failing to report on President Biden’s declining health.",
    "link": "https://www.foxnews.com/media/axios-reporter-hits-media-whiffing-coverage-bidens-decline-white-house-correspondents-dinner",
    "timestamp": "2025-04-27T03:29:09Z"
  },
  {
    "title": "US and Iran make progress in nuclear negotiations, plan further talks in Europe",
    "description": "American and Iranian negotiators complete a third round of nuclear talks in Muscat, described as \"positive and productive.\"",
    "link": "https://www.israelnationalnews.com/news/407436",
    "timestamp": "2025-04-27T03:28:08Z"
  },
  {
    "title": "Who is Kimbal Musk? Elon’s brother in spotlight after swipe at Trump over tariffs",
    "description": "Elon Musk's brother, Kimbal Musk, worth around $900 million, is an entrepreneur and chef, known for his involvement in Tesla and SpaceX. Check details here… &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;",
    "link": "https://www.livemint.com/companies/people/elon-musk-brother-who-is-kimbal-musk-net-worth-900-million-rich-donald-trump-tariffs-tesla-spacex-business-chef-us-news-11745398446183.html",
    "timestamp": "2025-04-27T03:26:39Z"
  },
  {
    "title": "Shedeur Sanders Selected by Cleveland Browns in Fifth Round of NFL Draft",
    "description": "Shedeur Sanders, the son of NFL legend Deion Sanders, was selected by the Cleveland Browns during the fifth round of the NFL Draft after slipping during the previous rounds.\nThe post Shedeur Sanders Selected by Cleveland Browns in Fifth Round of NFL Draft app…",
    "link": "https://www.breitbart.com/sports/2025/04/26/shedeur-sanders-selected-by-cleveland-browns-in-fifth-round-nfl-draft/",
    "timestamp": "2025-04-27T03:24:10Z"
  },
  {
    "title": "Trump-backed crypto venture partners with Pakistan Crypto Council to boost blockchain adoption",
    "description": "Pakistan Crypto Council and World Liberty Financial signed key agreements to boost crypto investment and innovation in Pakistan. Supported by top officials, the partnership aims to advance blockchain, stablecoins, and decentralised finance. The move positions…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-backed-crypto-venture-partners-with-pakistan-crypto-council-to-boost-blockchain-adoption/articleshow/120659429.cms",
    "timestamp": "2025-04-27T03:22:56Z"
  },
  {
    "title": "Massive Blast At Iranian Port Leaves 14 Dead, 750 Injured Amid US-Iran Talks In Oman",
    "description": "A massive explosion purportedly linked to a shipment of a chemical ingredient used to make missile propellant killed at least 14 people and injured more than 750 others in the southern Iranian port city of Bandar Abbas.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250426-rferl01.htm",
    "timestamp": "2025-04-27T03:08:17Z"
  },
  {
    "title": "White House Correspondents’ Dinner Flies First Amendment Flag High Even With Trump Snub, Few Hollywood Power Players In Attendance",
    "description": "A chorus line of past presidents from past years showed up via old video to give an edited mash-up speech, but there was no current POTUS, no VP, no roast by a comedian and few Hollywood power players at the White House Correspondents’ Dinner tonight in Washi…",
    "link": "http://deadline.com/2025/04/white-house-correspondents-dinner-trump-snub-first-amendment-1236377908/",
    "timestamp": "2025-04-27T03:03:53Z"
  },
  {
    "title": "Catholics Turn on the Democrats",
    "description": "With the death of Pope Francis, the attention of the world naturally turns toward the Church, and mostly toward Rome. But this focus on Catholicism should also prod an examination of the massive Catholic shift away from Democrats across America. Specifically,…",
    "link": "https://freerepublic.com/focus/f-religion/4313516/posts",
    "timestamp": "2025-04-27T02:57:21Z"
  },
  {
    "title": "Trump’s Approval Rating Hits New Low, Capping Week of Dismal Polling",
    "description": "Trump’s policies on economy, immigration, executive overreach, and court defiance have contributed to his approval rating going below 40 percent.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-polling-plummets-approval-rating-new-low-1235325964/",
    "timestamp": "2025-04-27T02:54:54Z"
  },
  {
    "title": "Polish PM wants ‘strongest army’",
    "description": "The Polish prime minister has outlined a plan to strengthen the country’s military and economy under a new national doctrine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616380-poland-miracle-strongest-army/",
    "timestamp": "2025-04-27T02:47:42Z"
  },
  {
    "title": "Metallic Strappy Sandals Trend at the 2025 White House Correspondents’ Dinner Red Carpet",
    "description": "A number of attendees to the 2025 White House Correspondents' Dinner wore strappy, metallic open-toe sandal shoes from wedges to stilettos on April 26.",
    "link": "http://footwearnews.com/fashion/celebrity-style/metallic-strappy-sandals-trend-white-house-dinner-2025-1234803100/",
    "timestamp": "2025-04-27T02:42:38Z"
  },
  {
    "title": "Trump and Zelenskyy have 'very productive' talk as they attend Pope Francis' funeral (Rachel Wolf/Fox News)",
    "description": "Rachel Wolf / Fox News:\nTrump and Zelenskyy have ‘very productive’ talk as they attend Pope Francis' funeral  —  Trump and Zelenskyy were both in Rome for Pope Francis' funeral  —  President Donald Trump and Ukrainian President Volodymyr Zelenskyy met face-to…",
    "link": "https://www.memeorandum.com/250426/p58",
    "timestamp": "2025-04-27T02:40:01Z"
  },
  {
    "title": "Russia to fund construction of new nuclear plant in Iran",
    "description": "On top of funding the construction of a new nuclear plant in Iran, Russia will supply Iran with 55 billion cubic meters per year.",
    "link": "https://www.jpost.com/international/article-851626",
    "timestamp": "2025-04-27T02:35:52Z"
  },
  {
    "title": "Trump says US ships should be allowed to travel through the Panama and Suez canals for free - Reuters",
    "description": "Trump says US ships should be allowed to travel through the Panama and Suez canals for freeReuters Trump says US ships should have free use of Panama and Suez canalsThe Guardian Trump Says US Ships Need Free Travel Through Panama, Suez CanalsBloomberg.com Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177164883",
    "timestamp": "2025-04-27T02:32:47Z"
  },
  {
    "title": "Citigroup Predicts Stablecoin Market To Grow By $1.6 Trillion By 2030 – Details",
    "description": "American banking giant Citigroup has shared a highly bullish forecast of the stablecoin market in its latest market perspective report. Alongside this intriguing insight, Citigroup has also highlighted potential hurdles and roadblocks for these fiat-peg virtu…",
    "link": "https://bitcoinist.com/citigroup-predicts-stablecoin-to-grow-1-6-trillion/",
    "timestamp": "2025-04-27T02:30:44Z"
  },
  {
    "title": "'I do not hate men': J.K. Rowling gets in public fight with Boy George",
    "description": "Author J.K. Rowling on Saturday got into a very public spat with singer/songwriter Boy George.\n\nBoy George responded to an anonymous social media user, saying, \"Stop this nonsense that if you don't agree with [J.K. Rowling] you hate women.\"\n\n\"She hates men. T…",
    "link": "https://www.rawstory.com/jk-rowling-boy-george-fight/",
    "timestamp": "2025-04-27T02:23:34Z"
  },
  {
    "title": "How three Americans allegedly conspired to overthrow the DRC government",
    "description": "Football teammates from Utah become cellmates in a foreign prison after allegedly joining rebel forces in the Democratic Republic of Congo.",
    "link": "https://www.abc.net.au/news/2025-04-27/us-friends-charged-in-congo-coup/105170888",
    "timestamp": "2025-04-27T02:22:25Z"
  },
  {
    "title": "Shedeur Sanders NFL Draft: Stephen A. Smith, Meek Mill, Tristan Thompson, and More React",
    "description": "Every corner of the internet had an opinion on Sanders’ draft slip.",
    "link": "https://www.complex.com/sports/a/treyalston/shedeur-sanders-nfl-browns-draft-reactions",
    "timestamp": "2025-04-27T02:19:23Z"
  },
  {
    "title": "Canada leaders make closing pitches in campaign upended by Trump",
    "description": "Canadian leaders campaigned in battleground districts Saturday, two days before a vote electrified by US President Donald Trump’s threats, with Prime Minister Mark Carney favored after assuring voters he can stand up to Washington. A victory for Carney’s Libe…",
    "link": "https://www.digitaljournal.com/world/canada-leaders-make-closing-pitches-in-campaign-upended-by-trump/article",
    "timestamp": "2025-04-27T02:17:20Z"
  },
  {
    "title": "Trump-Aligned Club for Ultra Rich Launches in D.C.",
    "description": "“A new club is coming to Washington — and you probably can’t get in,” Politico reports. “Donald Trump Jr., megadonor Omeed Malik and several other investors are launching an invite-only club that costs more than",
    "link": "https://politicalwire.com/2025/04/26/trump-aligned-club-for-ultra-rich-launches-in-d-c/",
    "timestamp": "2025-04-27T02:13:56Z"
  },
  {
    "title": "'Kicking butt' or 'going too fast'? Donald Trump voters reflect on 100 days - BBC",
    "description": "'Kicking butt' or 'going too fast'? Donald Trump voters reflect on 100 daysBBC Trump 100 days: Former president's success created measuring stick for future leadersUSA Today Exclusive: Inside Trump’s First 100 DaysTime Magazine Justice Dept. Policy Now Allows…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177164573",
    "timestamp": "2025-04-27T02:12:22Z"
  },
  {
    "title": "White House Correspondents' Dinner: The Journalist Gathering Bows to Trump",
    "description": "White House Correspondents' Dinner: The Journalist Gathering Bows to Trumpvariety.com",
    "link": "https://variety.com/2025/politics/columns/whcd-white-house-correspondents-dinner-1236379380/",
    "timestamp": "2025-04-27T02:10:36Z"
  },
  {
    "title": "US deports 3 American children, including cancer patient: rights groups",
    "description": "by Jonathan BROWNThree American children aged two, four and seven -- one of whom has a rare form of cancer -- have been deported from the United States alongside their undocumented immigrant mothers, campaigners announced Saturday.The deportations from the so…",
    "link": "https://www.rawstory.com/us-deports-3-american-children-including-cancer-patient-rights-groups/",
    "timestamp": "2025-04-27T02:09:05Z"
  },
  {
    "title": "DHS Spox Touts ‘Major Success’ In Florida After Nabbing Nearly 800 Illegals In 4 Days",
    "description": "Tricia McLaughlin described the arrest records of some illegal immigrants arrested by ICE as part of “a large-scale operation” during an appearance on Fox News.",
    "link": "https://dailycaller.com/2025/04/26/dhs-spox-touts-major-success-in-florida-after-nabbing-nearly-800-illegals-in-4-days/",
    "timestamp": "2025-04-27T02:08:38Z"
  },
  {
    "title": "Lawsuit says migrants endure isolation and intimidation at US' Guantanamo detention center",
    "description": "Civil rights advocates have renewed concerns that immigrants detained at the Guantanamo Bay U.S. Naval Base on Cuba are being held in extreme isolation, cut off from meaningful access to legal counsel or candid communication with relatives",
    "link": "https://abcnews.go.com/US/wireStory/lawsuit-migrants-endure-isolation-intimidation-us-guantanamo-detention-121206638",
    "timestamp": "2025-04-27T02:06:16Z"
  },
  {
    "title": "A stunning reversal of fortunes in Canada's historic election",
    "description": "After a campaign upended by Trump’s threats, the Liberals hope they can hold onto power.",
    "link": "https://www.bbc.com/news/articles/c78jv246n91o",
    "timestamp": "2025-04-27T02:05:20Z"
  },
  {
    "title": "Trump administration opens investigation on UC Berkeley over foreign funding",
    "description": "One order called for harder enforcement of Section 117, a federal law requiring colleges to disclose foreign gifts and contracts valued at $250,000 or more.",
    "link": "https://www.wmur.com/article/trump-administration-opens-investigation-on-uc-berkeley/64593113",
    "timestamp": "2025-04-27T02:01:25Z"
  },
  {
    "title": "How America’s indebtedness is trimming Donald Trump’s wings – Jenée Tibshraeny",
    "description": "Market turbulence is seen as more than a bout of volatility.",
    "link": "https://www.nzherald.co.nz/business/markets/how-the-uss-indebtedness-is-trimming-donald-trumps-wings-jenee-tibshraeny/UHJT7ZWQPRGUDH64STP25ZB7PQ/",
    "timestamp": "2025-04-27T02:00:00Z"
  },
  {
    "title": "WHCA president opens dinner highlighting Trump’s absence and ‘extremely difficult’ year for the press",
    "description": "White House Correspondents’ Association President Eugene Daniels opened the annual dinner by criticizing Trump’s absence and highlighting a difficult year for the press.",
    "link": "https://www.foxnews.com/media/whca-president-opens-dinner-highlighting-trumps-absence-extremely-difficult-year-press",
    "timestamp": "2025-04-27T01:58:32Z"
  },
  {
    "title": "US deports 3 American children, including cancer patient: rights groups",
    "description": "Three American children aged two, four and seven -- one of whom has a rare form of cancer -- have been deported from the United States alongside their...",
    "link": "https://www.yahoo.com/news/us-deports-3-american-children-015612747.html",
    "timestamp": "2025-04-27T01:56:12Z"
  },
  {
    "title": "Taiwan envoy said he prayed for president to be able to attend new pope's inauguration",
    "description": "TAIPEI: Taiwan's envoy to the funeral of Pope Francis said he prayed for President Lai Ching-te to be able to attend the inauguration of the new pontiff, and that he had met Japan's foreign minister, easing the island's diplomatic isolation. The Vatican is on…",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-envoy-said-he-prayed-president-be-able-attend-new-popes-inauguration-5092371",
    "timestamp": "2025-04-27T01:53:02Z"
  },
  {
    "title": "Blanchet's Canada \"Artificial Country\" remark sparks identity debate in election",
    "description": "Bloc Québécois leader Yves-François Blanchet ignited controversy by calling Canada an \"artificial country,\" sparking widespread condemnation from political leaders. Nova Scotia Premier Tim Houston deemed the statement \"insulting,\" while Prime Minister Mark Ca…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/blanchets-canada-artificial-country-remark-sparks-identity-debate-in-election/articleshow/120658626.cms",
    "timestamp": "2025-04-27T01:51:13Z"
  },
  {
    "title": "Welcome to Israel, Ambassador Huckabee",
    "description": "Great days are promised to people who strive to help Israel and her people, and may Ambassador Huckabee always be a steward of that great blessing.",
    "link": "https://www.jpost.com/opinion/article-851598",
    "timestamp": "2025-04-27T01:47:36Z"
  }
]