[
  {
    "title": "Donald Trump's Epstein Problem Not Going Away: 'Massive Unforced Error'",
    "description": "Online searches for Jeffrey Epstein increased by 1,900 percent within a week.",
    "link": "https://www.newsweek.com/donald-trump-jeffrey-epstein-google-search-trends-2098632",
    "timestamp": "2025-07-14T14:41:11Z"
  },
  {
    "title": "EU sanctions against Israel: here’s what’s on the table",
    "description": "Europe has the means to prevent further suffering in Gaza, but political will is lacking.",
    "link": "https://theconversation.com/eu-sanctions-against-israel-heres-whats-on-the-table-260982",
    "timestamp": "2025-07-14T14:40:27Z"
  },
  {
    "title": "Biden chief of staff reportedly gave approval for autopen pardons on final day in office",
    "description": "President Donald Trump has claimed that the thousands of pardons signed during the Biden administration are void, due to alleged autopen usage.",
    "link": "https://www.foxnews.com/politics/biden-chief-staff-reportedly-gave-approval-autopen-pardons-final-day-office",
    "timestamp": "2025-07-14T14:39:06Z"
  },
  {
    "title": "Biden chief of staff gave reportedly gave approval for autopen pardons on final day in office",
    "description": "President Donald Trump has claimed that the thousands of pardons signed during the Biden administration are void, due to alleged autopen usage.",
    "link": "https://www.foxnews.com/politics/biden-chief-staff-gave-reportedly-gave-approval-autopen-pardons-final-day-office",
    "timestamp": "2025-07-14T14:39:06Z"
  },
  {
    "title": "Thomas Massie Gets Influx of New Donors",
    "description": "Rep. Thomas Massie (R-KY) \"has raked in a slew of new financial supporters despite his recent public spats with President Donald Trump,\" the Cincinnati Enquirer reports. Massie has raised $584,325 in the July 2025 quarterly",
    "link": "https://politicalwire.com/2025/07/14/thomas-massie-gets-influx-of-new-donors/",
    "timestamp": "2025-07-14T14:36:57Z"
  },
  {
    "title": "Trump $1,000 account for children: How it works, who is eligible and all the details",
    "description": "President Donald Trump’s “One Big Beautiful Bill” will establish a savings account for millions of babies born in the U.S. The so-called “Trump accounts” will “afford a generation of children the chance to experience the miracle of compounded growth and set t…",
    "link": "https://biztoc.com/x/68e189acf4e5d818",
    "timestamp": "2025-07-14T14:35:33Z"
  },
  {
    "title": "How Republican officials in one state are trying to veto the will of voters (again)",
    "description": "Missouri voters approved paid sick leave and a minimum wage increase. Republican officials in the state decided not to care what voters chose to do.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republican-officials-one-state-are-trying-veto-will-voters-rcna218639",
    "timestamp": "2025-07-14T14:35:10Z"
  },
  {
    "title": "UK to roll out red carpet in ‘unprecedented’ second Trump visit hosted by King Charles",
    "description": "President Donald Trump accepts invitation for a historic second state visit to the U.K. in September at Windsor Castle, marking the first time a U.S. president has received such an honor.",
    "link": "https://www.foxnews.com/world/uk-roll-out-red-carpet-unprecedented-second-trump-visit-hosted-prince-charles",
    "timestamp": "2025-07-14T14:35:04Z"
  },
  {
    "title": "How QAnon and Epstein sparked Trump's political crisis (Judd Legum/Popular Information)",
    "description": "Judd Legum / Popular Information:\nHow QAnon and Epstein sparked Trump's political crisis  —  Some of Donald Trump's fiercest supporters are adherents to the QAnon conspiracy theory — the fabricated claim that top Democrats are secretly involved in a Satanic p…",
    "link": "https://www.memeorandum.com/250714/p49",
    "timestamp": "2025-07-14T14:35:00Z"
  },
  {
    "title": "'She Hated Every Minute Of It': Melania and Donald Trump Spotted Holding Hands, Fans Notice How Quickly She Seemed to Have Pulled Away",
    "description": "'She Hated Every Minute Of It': Melania and Donald Trump Spotted Holding Hands, Fans Notice How Quickly She Seemed to Have Pulled Awayatlantablackstar.com",
    "link": "https://atlantablackstar.com/2025/07/14/melania-trump-pulls-away-when-donald-trump-hold-hands/",
    "timestamp": "2025-07-14T14:34:51Z"
  },
  {
    "title": "Mark Cuban Warns Dems’ ‘Trump Sucks’ Mentality Is Not A Winning Strategy",
    "description": "Mark Cuban criticized Democrats during a Sunday podcast for constantly attacking President Donald Trump rather than than offering solutions to help Americans.",
    "link": "https://dailycaller.com/2025/07/14/mark-cuban-dems-trump-sucks-losing-strategy/",
    "timestamp": "2025-07-14T14:34:34Z"
  },
  {
    "title": "350.org Slams Utility Rate Hikes Driven by AI and Data Center Boom",
    "description": "As U.S. utilities push for billions with steep rate hikes, citing the need to repair climate-damaged infrastructure and upgrade the aging power grid to meet rising demand, campaigners are sounding the alarm. While utilities argue these investments are necessa…",
    "link": "https://www.commondreams.org/newswire/350-org-slams-utility-rate-hikes-driven-by-ai-and-data-center-boom",
    "timestamp": "2025-07-14T14:34:05Z"
  },
  {
    "title": "Trump shuts down major airport 'so he could watch a soccer game': report",
    "description": "President Donald Trump's attendance at the FIFA Club World Cup soccer match in New Jersey on Sunday reportedly caused Newark Airport to be shut down for hours.As Trump arrived at the major international hub, transportation reporter Sam Deutsch noted that all …",
    "link": "https://www.rawstory.com/trump-club-world-cup-2673158336/",
    "timestamp": "2025-07-14T14:33:07Z"
  },
  {
    "title": "US pledges more support for Ukraine; Sinner wins Wimbledon | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_925debc8-c61f-5d9b-b0f7-8d3884a977f6.html",
    "timestamp": "2025-07-14T14:30:00Z"
  },
  {
    "title": "Europe walks tightrope amid intensifying US-China rivalry",
    "description": "Can the EU still trust the US after Trump's latest tariff threat? And can it risk closer ties with China? The European bloc is caught between a hard and a rock place. Last week, China's Foreign Minister Wang Yi held talks with US Secretary of State Marco Rubi…",
    "link": "https://www.dw.com/en/europe-walks-tightrope-amid-intensifying-us-china-rivalry/a-73273914",
    "timestamp": "2025-07-14T14:30:00Z"
  },
  {
    "title": "US pledges more support for Ukraine; Sinner wins Wimbledon | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_e2fa035a-38f0-5091-9e16-7a9e1b636186.html",
    "timestamp": "2025-07-14T14:30:00Z"
  },
  {
    "title": "Indonesia Ties Purchase of More U.S. Oil to Reduced Tariffs",
    "description": "Indonesia will buy billions of U.S. dollars worth of American oil and oil products if the U.S. tariffs on Indonesian goods are lowered, Indonesia’s Energy Minister Bahlil Lahadalia said on Monday. Indonesia could scrap plans to import energy commodities from …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indonesia-Ties-Purchase-of-More-US-Oil-to-Reduced-Tariffs.html",
    "timestamp": "2025-07-14T14:30:00Z"
  },
  {
    "title": "China Is Winning Trump’s Trade War",
    "description": "Since the Sino-American trade conflict began in 2018, China has developed a playbook with defensive and offensive strategies. The Chinese government has maintained an edge during US President Donald Trump’s second administration by doubling down on these stra…",
    "link": "https://www.project-syndicate.org/commentary/china-winning-trump-trade-war-by-developing-advanced-technology-by-zongyuan-zoe-liu-2025-07",
    "timestamp": "2025-07-14T14:29:17Z"
  },
  {
    "title": "Earnings, inflation, and the trade war — it's about to be a big week for markets",
    "description": "Bank earnings, inflation, and new crypto regulation are some of the things on the investors' radar this week.",
    "link": "https://www.businessinsider.com/stock-market-today-trump-tariffs-inflation-cpi-bank-earnings-crypto-2025-7",
    "timestamp": "2025-07-14T14:29:06Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is estimated to leave millions without health care. He insists ‘it’s not going to cause death’",
    "description": "President Donald Trump defended his “Big, Beautiful, Bill” during a Fox News interview broadcast on Saturday night, claiming \"it's not going to cause death",
    "link": "https://www.newsbreak.com/share/4104549240121-trump-s-big-beautiful-bill-is-estimated-to-leave-millions-without-health-care-he-insists-it-s-not-going-to-cause-death?_f=app_share&amp;pd=0CbPR7nS&amp;lang=en_US&amp;send_time=1752503300&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.21.0.32%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v5%2Cns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v3&amp;s=i2",
    "timestamp": "2025-07-14T14:29:04Z"
  },
  {
    "title": "‘It Kind of Wrecks Dan’s Career’: Tucker Carlson Holds Funeral for Bongino’s Credibility After Epstein Blow-Up",
    "description": "Tucker Carlson all but held a funeral for FBI Deputy Director Dan Bongino's career amid the MAGA civil war over the Jeffrey Epstein case.\nThe post ‘It Kind of Wrecks Dan’s Career’: Tucker Carlson Holds Funeral for Bongino’s Credibility After Epstein Blow-Up f…",
    "link": "https://www.mediaite.com/media/news/it-kind-of-wrecks-dans-career-tucker-carlson-holds-funeral-for-bonginos-credibility-after-epstein-blow-up/",
    "timestamp": "2025-07-14T14:28:44Z"
  },
  {
    "title": "Trump promises 'very sophisticated' equipment for Kyiv",
    "description": "Ukraine's President Zelensky has thanked the United States for its support, ahead of Donald Trump's expected announcement of more military hardware, to be paid for by the European Union.\n\nAlso in the programme: Taiwan doubles the length of its annual military…",
    "link": "https://www.bbc.co.uk/programmes/w172zss58g5343z",
    "timestamp": "2025-07-14T14:28:00Z"
  },
  {
    "title": "It's Crypto Week: These are the key dates to watch",
    "description": "US House leaders have designated this week as “crypto week,” during which lawmakers will vote on three major digital asset bills. Here's what to expect.",
    "link": "https://cointelegraph.com/news/crypto-week-key-dates-genius-clarity",
    "timestamp": "2025-07-14T14:27:32Z"
  },
  {
    "title": "Donald Trump’s heading back to Britain. Cue a load of complaining.",
    "description": "Trump's Brit fans want a proper address to parliament — while the government insists it's not shielding the US president from scrutiny.",
    "link": "https://www.politico.eu/article/donald-trump-heading-back-britain-load-complaining/",
    "timestamp": "2025-07-14T14:27:17Z"
  },
  {
    "title": "Donald Trump has no hesitation in naming the greatest soccer player of all time... and he doesn't choose Messi",
    "description": "US President Donald Trump attended the MetLife Stadium to witness the Club World Cup final between Paris Saint-Germain and Chelsea, where the English side were crowned champions wi",
    "link": "https://www.marca.com/en/football/fifa-club-world-cup/2025/07/14/6875117e268e3e6e7c8b4591.html",
    "timestamp": "2025-07-14T14:27:09Z"
  },
  {
    "title": "India should pursue services-focused trade deal with US: NITI Aaayog",
    "description": "NITI Aayog suggests India pursue a services-oriented trade deal with the US, mirroring the India-UK agreement, focusing on IT, finance, and education. The proposal includes improved visa access for Indian professionals and market access commitments in cyberse…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-should-pursue-services-focused-trade-deal-with-us-niti-aaayog/articleshow/122446741.cms",
    "timestamp": "2025-07-14T14:26:58Z"
  },
  {
    "title": "Donald Trump Jr. and Bettina Anderson pack on the PDA while waiting for the president",
    "description": "The two made their first appearance as a couple in January",
    "link": "https://www.the-independent.com/life-style/donald-trump-jr-bettina-anderson-pda-b2788661.html",
    "timestamp": "2025-07-14T14:24:32Z"
  },
  {
    "title": "The Real Reason Trump Has Hated Rosie O’Donnell for 19 Years",
    "description": "If President Donald Trump, like Richard Nixon, kept an enemies list, one seemingly unlikely name would be right at the top — not a lawmaker or one of his predecessors, but the funny lady who tossed Koosh balls into the audience, and who speaks in frank and un…",
    "link": "https://variety.com/2025/tv/columns/trump-rosie-odonnell-feud-citizenship-1236459595/",
    "timestamp": "2025-07-14T14:24:14Z"
  },
  {
    "title": "Bitcoin breaks $120,000 barrier on regulatory hope",
    "description": "The world’s largest cryptocurrency shattered expectations Monday, climbing past the $120,000 threshold for the first time in its history. Bitcoin peaked at $122,571 before settling at $121,953, representing a substantial 2.4% increase that sent ripples throug…",
    "link": "https://rollingout.com/2025/07/14/bitcoin-soars-past-120000-crypto-week/",
    "timestamp": "2025-07-14T14:22:33Z"
  },
  {
    "title": "Trump jokes about executive order to call soccer 'football' in US, names greatest player of all time",
    "description": "President Donald Trump joked about signing an executive order to call soccer \"football\" as he watched the FIFA Club World Cup final on Sunday.",
    "link": "https://www.foxnews.com/sports/trump-jokes-about-executive-order-call-soccer-football-us-names-greatest-player-all-time",
    "timestamp": "2025-07-14T14:22:13Z"
  },
  {
    "title": "Trump Goons Have Lying Contest On Sunday Shows, Everybody Wins! (America Loses)",
    "description": "Those currently hiding the Epstein files are not featured in this post.",
    "link": "https://www.wonkette.com/p/trump-goons-have-lying-contest-on",
    "timestamp": "2025-07-14T14:21:26Z"
  },
  {
    "title": "Trump gathers CEOs for unprecedented faith, economy meeting to renew US 'spiritually and financially'",
    "description": "FIRST ON FOX: President Donald Trump will recognize CEOs and business leaders who donate their time to faith-based charitable works and encourage them to continue investing with the White House Faith Office during a luncheon at the White House Monday.",
    "link": "https://www.foxnews.com/politics/trump-gathers-ceos-unprecedented-faith-economy-meeting-renew-us-spiritually-financially",
    "timestamp": "2025-07-14T14:20:21Z"
  },
  {
    "title": "The FIFA Club World Cup and the Global Sports Spectacle in the Age of Trump 2.0",
    "description": "Soccer’s international governing body staged a halftime show that hinted at its cultural aspirations for next year’s North American–hosted World Cup proper. The president made sure to intervene in the entertainment.",
    "link": "https://www.vanityfair.com/style/story/fifa-club-world-cup-trump-global-sports-spectacle",
    "timestamp": "2025-07-14T14:20:11Z"
  },
  {
    "title": "'Haven't the foggiest idea': Trump's new 'weird tantrum' baffles MSNBC analyst",
    "description": "President Donald Trump has realized that the Jeffrey Epstein sex trafficking case saga is tearing apart the MAGA base — so he is trying to tamp down the conspiracy theories with a new — even more bizarre — one, Steve Benen wrote in an analysis for MSNBC.For y…",
    "link": "https://www.rawstory.com/epstein-files-2673157035/",
    "timestamp": "2025-07-14T14:20:10Z"
  },
  {
    "title": "Tariff Impact Seen Ending Streak of Benign US Inflation Readings",
    "description": "Economists have long been warning of a tariff-driven boost to US inflation. The next report on consumer prices will put their conviction to the test.",
    "link": "https://financialpost.com/pmn/business-pmn/tariff-impact-seen-ending-streak-of-benign-us-inflation-readings",
    "timestamp": "2025-07-14T14:19:28Z"
  },
  {
    "title": "Gavin Newsom Taunts JD Vance Over Disneyland Vacation With Family: 'Probably to Detain Mickey Mouse'",
    "description": "Gavin Newsom taunted JD Vance over his recent family vacation to Disneyland, with his jabs referencing the Trump administration's crackdown on immigration.",
    "link": "https://www.ibtimes.com/gavin-newsom-taunts-jd-vance-over-disneyland-vacation-family-probably-detain-mickey-mouse-3778426",
    "timestamp": "2025-07-14T14:19:13Z"
  },
  {
    "title": "Bitcoin soars to new all-time high as US lawmakers focus on pro-crypto legislation",
    "description": "Bitcoin continued its rapid climb and hit another all-time high Monday as U.S. lawmakers begin a week focused on passing pro-crypto legislation.  The world’s...",
    "link": "https://finance.yahoo.com/news/bitcoin-soars-time-high-us-141906025.html",
    "timestamp": "2025-07-14T14:19:06Z"
  },
  {
    "title": "Here’s How Rich You’d Be if You Bought Tesla Stock Instead of a New Car in 2012",
    "description": "When Tesla first hit the market in 2008, CEO Elon Musk didn't just introduce a new car to the world, he changed the industry by redefining what a car could...",
    "link": "https://finance.yahoo.com/news/rich-d-bought-tesla-stock-141723694.html",
    "timestamp": "2025-07-14T14:17:23Z"
  },
  {
    "title": "NYT Biden Interview Confirms: POTUS Had No Idea Who Was Being Pardoned Specifically, Despite Claiming He Made 'Every Single' Decision",
    "description": "NYT Biden Interview Confirms: POTUS Had No Idea Who Was Being Pardoned Specifically, Despite Claiming He Made 'Every Single' Decisionwesternjournal.com",
    "link": "https://www.westernjournal.com/nyt-biden-interview-confirms-potus-no-idea-pardoned-specifically-despite-claiming-made-every-single-decision/",
    "timestamp": "2025-07-14T14:15:44Z"
  },
  {
    "title": "How Trump Can Secretly Disarm Fed Chair Powell | WSJ",
    "description": "President Donald Trump has signaled he's already looking to replace Federal Reserve Chair Jerome Powell far earlier than usual ...",
    "link": "https://biztoc.com/x/3d376e216eec987a",
    "timestamp": "2025-07-14T14:14:33Z"
  },
  {
    "title": "Trump TURNS on Putin, announces he'll send Patriot missiles to Ukraine",
    "description": "President Donald Trump said last night that the U.S. will send Patriot missiles to Ukraine to help it defend itself against Russian ...",
    "link": "https://biztoc.com/x/faa956b62c6eb69a",
    "timestamp": "2025-07-14T14:14:13Z"
  },
  {
    "title": "These Are The Americans Turning on Trump’s Immigration Policies",
    "description": "President Donald Trump was elected to office in November 2024 on a platform centered largely on immigration. Trump’s hardline stance on border security and deporting undocumented migrants stood in stark contrast to the Biden administration, under which illega…",
    "link": "https://biztoc.com/x/f5e1c6f41b2705eb",
    "timestamp": "2025-07-14T14:14:00Z"
  },
  {
    "title": "Shoddy that Donald Trump can't address MPs, says Nigel Farage",
    "description": "The US president's state visit later this year has been scheduled during a House of Commons recess.",
    "link": "https://www.bbc.co.uk/news/articles/cx2l1gjw49yo",
    "timestamp": "2025-07-14T14:13:42Z"
  },
  {
    "title": "Insane amount you would have today if you invested £100 in Bitcoin 10 years ago as price reaches all time high",
    "description": "Bitcoin is at its highest all-time value, fuelled by US president Donald Trump's tariffs and bitcoin strategy",
    "link": "https://www.ladbible.com/news/world-news/bitcoin-latest-value-2025-worth-815839-20250714",
    "timestamp": "2025-07-14T14:11:35Z"
  },
  {
    "title": "Trump marks anniversary of assassination attempt at the FIFA Club World Cup final",
    "description": "EAST RUTHERFORD, N.J. — President Donald Trump on Sunday marked the one-year anniversary of a failed attempt on his life, joining family, friends and close advisers to witness Chelsea's dominating FIFA Club World Cup final victory over Paris Saint-Germain. Th…",
    "link": "https://freerepublic.com/focus/f-chat/4328607/posts",
    "timestamp": "2025-07-14T14:10:40Z"
  },
  {
    "title": "Trump’s Truth Social Plea on Epstein Sets an Embarrassing New Record",
    "description": "President Donald Trump has set a new milestone he might not want to brag about after getting “ratioed” on his own social media platform in spectacular...",
    "link": "https://www.thedailybeast.com/donald-trumps-truth-social-plea-on-jeffrey-epstein-sets-an-embarrassing-new-record/",
    "timestamp": "2025-07-14T14:09:37Z"
  },
  {
    "title": "‘Tell her story’: Ghislaine Maxwell ready to blow lid off Epstein files and pedophile network, report says",
    "description": "'No one from the government has ever asked her to share what she knows. She remains the only person to be jailed in connection to Epstein and she would welcome the chance to tell the American public the truth'",
    "link": "https://www.wnd.com/2025/07/tell-her-story-ghislaine-maxwell-ready-blow-lid/",
    "timestamp": "2025-07-14T14:08:45Z"
  },
  {
    "title": "'Somebody that nobody cares about': What's going on with MAGA, Trump and the 'Epstein files'?",
    "description": "The president appeared exasperated when he was asked by a reporter about Epstein at a cabinet meeting last Tuesday.",
    "link": "https://www.thejournal.ie/whats-going-on-with-maga-trump-and-the-epstein-files-6762418-Jul2025/",
    "timestamp": "2025-07-14T14:07:06Z"
  },
  {
    "title": "Can Trump revoke Rosie O'Donnell's US citizenship?",
    "description": "In an escalating feud, the US-born actor fired back at the president's threat to take away her citizenship. But could he even legally do it? \"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consi…",
    "link": "https://www.dw.com/en/can-trump-revoke-rosie-odonnells-us-citizenship/a-73271497",
    "timestamp": "2025-07-14T14:07:00Z"
  },
  {
    "title": "Trump to send Patriot missiles to Ukraine, Kyiv to get new prime minister",
    "description": "KYIV: Ukrainian President Volodymyr Zelenskyy held talks with a US envoy on Monday (Jul 14) on increasing weapons production and arms purchases after President Donald Trump said he would send Patriot air",
    "link": "https://www.channelnewsasia.com/world/trump-send-patriot-missiles-ukraine-kyiv-get-new-prime-minister-5237171",
    "timestamp": "2025-07-14T14:06:04Z"
  },
  {
    "title": "TikTok CEO asks to meet with industry minister over shutdown order",
    "description": "The CEO of TikTok is asking Industry Minister Melanie Joly for an urgent meeting about the federal government's order directing the company to shut down its Canadian operations.",
    "link": "https://www.cbc.ca/news/politics/tiktok-ceo-wants-to-meet-joly-1.7584301",
    "timestamp": "2025-07-14T14:05:27Z"
  },
  {
    "title": "Nursing Homes Struggle With Trump’s Immigration Crackdown",
    "description": "Nursing homes already struggling to recruit staff are now grappling with President Donald Trump’s attack on one of their few reliable sources of workers: immigration. Facilities for older adults and disabled people are reporting the sporadic loss of employees…",
    "link": "https://www.insurancejournal.com/news/national/2025/07/14/831442.htm",
    "timestamp": "2025-07-14T14:05:18Z"
  },
  {
    "title": "Inside Linda Yaccarino’s rocky two-year stint as X CEO under Elon Musk — and the deal that forced their breaking point",
    "description": "Multiple people close to the situation described Yaccarino's tenure as riddled with conflict, stress and power struggles, according to a report.",
    "link": "https://nypost.com/2025/07/14/business/inside-linda-yaccarinos-tumultuous-tenure-at-x-under-elon-musk/",
    "timestamp": "2025-07-14T14:05:01Z"
  },
  {
    "title": "Ellen DeGeneres Defends Rosie O’Donnell Against Donald Trump",
    "description": "Ellen DeGeneres is trying to bury the hatchet with Rosie O’Donnell. \nAfter President Donald Trump shared a post on Truth Social saying he was considering “revoking” O’ Donnell's United States...",
    "link": "https://www.eonline.com/news/1419803/ellen-degeneres-defends-rosie-odonnell-against-donald-trump",
    "timestamp": "2025-07-14T14:05:00Z"
  },
  {
    "title": "What is the US’s Crypto Week? Why has Bitcoin hit a record high?",
    "description": "A number of important digital asset laws are set to be voted on in the US this week.",
    "link": "https://www.aljazeera.com/economy/2025/7/14/what-is-the-uss-crypto-week-why-has-bitcoin-hit-a-record-high",
    "timestamp": "2025-07-14T14:04:55Z"
  },
  {
    "title": "Elmo Gets Hacked on Social Media, Goes on Antisemitic Tirade and Says Trump Is on Epstein List",
    "description": "\"They hacked Elmo on a Sunday morning y’all know that violate the truce,\" Roy Wood Jr. wrote following the incident\nThe post Elmo Gets Hacked on Social Media, Goes on Antisemitic Tirade and Says Trump Is on Epstein List appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elmo-hacked-twitter-antisemitic-posts-trump-epstein/",
    "timestamp": "2025-07-14T14:03:33Z"
  },
  {
    "title": "Bitcoin hits all-time high of $123,000 as Washington declares \"crypto week\"",
    "description": "For the first time in its history, Bitcoin surpassed $120,000 on Monday. The virtual currency went as far as $123,153.22, Reuters reports, before experiencing a slight decrease to $122,000.Read Entire Article",
    "link": "https://www.techspot.com/news/108656-bitcoin-hits-all-time-high-123000-washington-declares.html",
    "timestamp": "2025-07-14T14:01:00Z"
  },
  {
    "title": "Columbia Nearing Deal With Trump Admin to Unlock Federal Funding",
    "description": "\"Trump administration officials and officials from Columbia are expected to meet next week at the White House, the source said.\"\nThe post Columbia Nearing Deal With Trump Admin to Unlock Federal Funding first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/columbia-nearing-deal-with-trump-admin-to-unlock-federal-funding/",
    "timestamp": "2025-07-14T14:00:52Z"
  },
  {
    "title": "Trump Criticizes Putin Ahead of Ukraine War Announcement",
    "description": "US President Donald Trump has pledged to send additional Patriot air-defense systems to Ukraine, a policy shift coinciding with what he promised would be a \"major statement\" regarding Washington's approach to Russia. In comments late on July 13, Trump did not…",
    "link": "https://oilprice.com/Geopolitics/International/Trump-Criticizes-Putin-Ahead-of-Ukraine-War-Announcement.html",
    "timestamp": "2025-07-14T14:00:00Z"
  },
  {
    "title": "Chelsea captain Reece James issues clear World Cup warning after lifting trophy in the shadow of Trump",
    "description": "James shared his concerns ahead of next summer’s World Cup",
    "link": "https://www.fourfourtwo.com/news/chelsea-captain-reece-james-issues-clear-world-cup-warning-after-lifting-trophy-in-the-shadow-of-trump",
    "timestamp": "2025-07-14T14:00:00Z"
  },
  {
    "title": "“Nowhere in the Constitution does it say”: The White House claims they have the right to post “banger memes,” the internet disagrees",
    "description": "In a move that felt more middle school than Oval Office, on July 12, the White House X account declared, \"Nowhere in the Constitution does it say we can’t post banger memes \" And yes, that is a direct quote.\n\n\nAttached was an image of a white poster board s…",
    "link": "https://www.dailydot.com/viral-politics/white-house-banger-memes/",
    "timestamp": "2025-07-14T14:00:00Z"
  },
  {
    "title": "Trump’s DOJ Won’t Let Go of One of His Biggest Losers in Court. I Know Why.",
    "description": "The order is legal trash, violating the Constitution in ways that are astonishingly obvious to anyone who has experience litigating these types of issues.",
    "link": "https://slate.com/news-and-politics/2025/07/trump-doj-bondi-biggest-loser-explained.html",
    "timestamp": "2025-07-14T14:00:00Z"
  },
  {
    "title": "‘Morning Joe’ Rolls Montage of Team Trump’s Damning Epstein Comments",
    "description": "MSNBC’s flagship morning show has rolled a damning montage of just some of the countless times Donald Trump and his allies bashed Democrats for their...",
    "link": "https://www.thedailybeast.com/msnbcs-morning-joe-rolls-damning-montage-of-donald-trump-and-maga-allies-comments-on-jeffrey-epstein/",
    "timestamp": "2025-07-14T13:59:10Z"
  },
  {
    "title": "Iranian crowdfunding campaign claims to raise $40M as reward for assassinating Trump",
    "description": "A movement in Iran has allegedly raised more than $40 million to reward Trump's assassination, according to the Middle East Media Research Institute.",
    "link": "https://www.foxnews.com/world/iranian-crowdfunding-campaign-claims-raise-40m-reward-assassinating-trump",
    "timestamp": "2025-07-14T13:55:59Z"
  },
  {
    "title": "Los Angeles To Give Cash Assistance To Immigrants Impacted By Trump Raids",
    "description": "\"You have people who don't want to leave their homes, who are not going to work, and they are in need of cash,\" Mayor Karen Bass said at a press conference.",
    "link": "https://www.newsweek.com/los-angeles-cash-assistance-immigation-ice-raids-2098642",
    "timestamp": "2025-07-14T13:55:21Z"
  },
  {
    "title": "Trump Reportedly To Ship Offensive Weapons To Ukraine In Major Pivot",
    "description": "President Donald Trump will reportedly announce a new plan Monday to support Ukraine with offensive weapons, sources told Axios.",
    "link": "https://dailycaller.com/2025/07/14/trump-reportedly-ship-offensive-weapons-ukraine-major-pivot/",
    "timestamp": "2025-07-14T13:54:12Z"
  },
  {
    "title": "Biden Says He Made the Clemency Decisions That Were Recorded With Autopen",
    "description": "Donald J. Trump and his allies have begun investigations to support their claims that Joseph R. Biden Jr. was incapacitated and his staff conspired to take presidential actions in his name. Former President Joseph R. Biden Jr. is escalating his battle against…",
    "link": "https://freerepublic.com/focus/f-chat/4328598/posts",
    "timestamp": "2025-07-14T13:54:09Z"
  },
  {
    "title": "Planning to attend law school? New student loan restrictions may affect the decision",
    "description": "Financing law school will become more difficult for many students as a result of federal loan restrictions in the budget megabill signed by President Donald Trump on July 4.",
    "link": "https://www.abajournal.com/news/article/planning-to-attend-law-school-new-student-aid-restrictions-may-affect-the-decision",
    "timestamp": "2025-07-14T13:53:00Z"
  },
  {
    "title": "Who Is To Blame For Texas Flooding Tragedy? Latest: Kristi Noem Defends FEMA’s Response",
    "description": "Politics played a pivotal role in Kerr County’s lack of a flood warning system—including local distrust of Biden-era handouts.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/07/14/who-is-to-blame-for-texas-flooding-tragedy-latest-kristi-noem-defends-femas-response/",
    "timestamp": "2025-07-14T13:53:00Z"
  },
  {
    "title": "South Korea, India and EU Scramble to Avoid 20-30% US Tariffs",
    "description": "Officials from South Korea, India and Europe said on Monday they were rushing to reach framework trade deals with the US to reduce hefty tariffs that President Donald Trump has threatened to impose at the start of next month.\nTrump ramped up tariff rhetoric o…",
    "link": "https://biztoc.com/x/f0d151eff6fea202",
    "timestamp": "2025-07-14T13:51:04Z"
  },
  {
    "title": "S&P 500, Nasdaq Edge Lower As Tariff Tensions Weigh On Wall Street",
    "description": "The main Wall Street indices edged lower on Monday as US President Donald Trump intensified his tariff warnings against the European Union and Mexico. The S&P 500 fell 0.71%, tech-heavy Nasdaq Composite declined 0.18%, and Dow Jones Industrial Average was dow…",
    "link": "https://www.ndtvprofit.com/markets/us-stock-markets-today-sp-500-nasdaq-edge-lower-as-tariff-tensions-weigh-on-wall-street",
    "timestamp": "2025-07-14T13:49:34Z"
  },
  {
    "title": "Sesame Street Slams “Disgusting” Posts on Elmo’s Account After Hack",
    "description": "Elmo’s social media has been hacked.\nA series of posts containing antisemitic language and criticisms of President Donald Trump appeared on the Sesame Street character’s official X (formerly...",
    "link": "https://www.eonline.com/news/1419806/sesame-street-addresses-elmo-social-media-hack",
    "timestamp": "2025-07-14T13:49:33Z"
  },
  {
    "title": "Shoddy that Trump can't address MPs, says Farage",
    "description": "The US president's state visit later this year has been scheduled during a House of Commons recess.",
    "link": "https://www.bbc.com/news/articles/cx2l1gjw49yo",
    "timestamp": "2025-07-14T13:48:31Z"
  },
  {
    "title": "Elmo's X account hacked, posted 'disgusting messages': Sesame Workshop",
    "description": "Elmo's X account, which is known for expressing positivity, was hacked and infiltrated with antisemitic messages, Sesame Street said.",
    "link": "https://www.usatoday.com/story/tech/2025/07/14/elmo-x-hacked-sesame-street/85189473007/",
    "timestamp": "2025-07-14T13:45:37Z"
  },
  {
    "title": "Trump to send Patriot missiles to Ukraine, US envoy visits Kyiv (Reuters)",
    "description": "Reuters:\nTrump to send Patriot missiles to Ukraine, US envoy visits Kyiv  —  Donald Trump's Ukraine envoy Keith Kellogg began talks in Kyiv on Monday on security and sanctions against Russia after the U.S. president said he would send Patriot air defence miss…",
    "link": "https://www.memeorandum.com/250714/p41",
    "timestamp": "2025-07-14T13:45:00Z"
  },
  {
    "title": "Stocks mixed after Trump issues tariffs on EU, Mexico",
    "description": "Trump said 30% tariffs on the European Union and Mexico will take effect Aug. 1.",
    "link": "https://abcnews.go.com/US/stocks-mixed-after-trump-issues-tariffs-eu-mexico/story?id=123735774",
    "timestamp": "2025-07-14T13:44:36Z"
  },
  {
    "title": "Boys & Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "Programs that provide summer and after-school programming are at risk because of a Trump administration freeze on education grants.",
    "link": "https://www.denverpost.com/2025/07/14/boys-and-girls-club-trump/",
    "timestamp": "2025-07-14T13:44:13Z"
  },
  {
    "title": "Boys & Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "Programs that provide summer and after-school programming are at risk because of a Trump administration freeze on education grants.",
    "link": "https://www.bostonherald.com/2025/07/14/boys-and-girls-club-trump/",
    "timestamp": "2025-07-14T13:44:13Z"
  },
  {
    "title": "Trump's Approval Rating Holds As Immigration Support Dips: Live Updates",
    "description": "Trump's approval steady at -6.7%; immigration support plummets to -27 amid raids and growing public backlash. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-administration-poll-live-updates-2098622",
    "timestamp": "2025-07-14T13:42:16Z"
  },
  {
    "title": "Why Trump wants 5 African nations to take US deportees",
    "description": "President Donald Trump’s ambitious immigration overhaul has taken an unexpected turn, with his administration actively pressuring African nations to accept deportees who aren’t even their own citizens. The controversial strategy has created a diplomatic fires…",
    "link": "https://rollingout.com/2025/07/14/trump-wants-african-nations-deportees/",
    "timestamp": "2025-07-14T13:40:42Z"
  },
  {
    "title": "New 30 Percent Tariff Threats",
    "description": "What's his game plan? On Saturday, President Donald Trump threatened to impose 30 percent tariffs on Mexico and all European Union countries, for seemingly no reason whatsoever.\n\"Mexico has been helping me secure the border, BUT, what Mexico has done, is not …",
    "link": "https://biztoc.com/x/6dbe66418dbe714f",
    "timestamp": "2025-07-14T13:40:22Z"
  },
  {
    "title": "Trump encounters rare uproar from ardent rightwing allies over Jeffrey Epstein",
    "description": "White House claim it didn’t have list of Epstein’s alleged clients and that he wasn’t murdered has caused tumult even within administration",
    "link": "https://www.yahoo.com/news/trump-encounters-rare-uproar-ardent-133935481.html",
    "timestamp": "2025-07-14T13:39:35Z"
  },
  {
    "title": "Trump Admin To Kill Another Massive Green Boondoggle, Hawley Says",
    "description": "Republican Missouri Sen. Josh Hawley announced Thursday that the Department of Energy (DOE) is canceling its Grain Belt Express project. Hawley’s X post announcing the DOE’s decision to cancel the project followed a conversation with President Donald Trump an…",
    "link": "https://freerepublic.com/focus/f-news/4328592/posts",
    "timestamp": "2025-07-14T13:37:54Z"
  },
  {
    "title": "State `well positioned’ despite uncertain markets, NTMA says",
    "description": "Republic still has still has debt of more than €200bn",
    "link": "https://www.irishtimes.com/business/2025/07/14/state-well-positioned-despite-uncertain-markets-ntma-says/",
    "timestamp": "2025-07-14T13:37:09Z"
  },
  {
    "title": "Ola Electric’s reset; Copper chaos could hit home",
    "description": "Ola Electric changed strategy after its revenue halved and profit slumped by almost a quarter in Q1. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/ola-electrics-reset-copper-chaos-could-hit-home/articleshow/122443739.cms",
    "timestamp": "2025-07-14T13:35:29Z"
  },
  {
    "title": "Senate GOP lawmakers consider Trump’s request to claw back $9.4 billion in spending",
    "description": "Trump's Republican administration is employing a rarely used tool that allows the president to transmit a request to cancel previously approved funding authority. The request triggers a 45-day clock under which the funds are frozen. If Congress fails to act w…",
    "link": "https://www.pbs.org/newshour/politics/senate-gop-lawmakers-consider-trumps-request-to-claw-back-9-4-billion-in-spending",
    "timestamp": "2025-07-14T13:35:20Z"
  },
  {
    "title": "Trump Lawyer Says He Asked Epstein in Final Days If He Had Dirt on His Client",
    "description": "David Schoen, who represented Epstein in the weeks before his death in 2019 and later Trump, revealed in June that he asked his client if he had dirt on Trump.\nThe post Trump Lawyer Says He Asked Epstein in Final Days If He Had Dirt on His Client first appear…",
    "link": "https://www.mediaite.com/media/news/trump-lawyer-says-he-asked-epstein-in-final-days-if-he-had-dirt-on-his-client/",
    "timestamp": "2025-07-14T13:32:43Z"
  },
  {
    "title": "Boys & Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "Programs that provide summer and after-school programming to more than 1 million students are at risk because of a Trump administration freeze on education grants.",
    "link": "https://www.news4jax.com/business/2025/07/14/boys-and-girls-club-programs-threatened-by-trump-grant-freeze-serve-thousands-of-families/",
    "timestamp": "2025-07-14T13:31:39Z"
  },
  {
    "title": "Unilever names Jochanan Senf as new Ben & Jerry’s CEO",
    "description": "The appointment comes amid reports of ongoing tension between Unilever and the board at Ben & Jerry’s.",
    "link": "https://www.just-food.com/news/unilever-names-jochanan-senf-as-new-ben-jerrys-ceo/",
    "timestamp": "2025-07-14T13:31:20Z"
  },
  {
    "title": "Targeting a critic, Trump claims a power he does not have in new authoritarian move",
    "description": "Donald Trump suggested he has the power to take away Rosie O'Donnell's U.S. citizenship. He has no such legal authority, which is why the threat matters.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rosie-odonnell-trump-threatens-citizenship-power-rcna218623",
    "timestamp": "2025-07-14T13:30:15Z"
  },
  {
    "title": "Israeli Ex-Leader Answers Tucker Carlson's Epstein Mossad Question",
    "description": "MAGA is angered by what they see as a Jeffrey Epstein cover-up, one continued by the Trump Administration.",
    "link": "https://www.newsweek.com/jeffrey-epstein-mossad-israel-bennett-tucker-carlson-2098630",
    "timestamp": "2025-07-14T13:30:09Z"
  },
  {
    "title": "Advertisers flock to Fox seeking an 'audience of one' — Donald Trump (Financial Times)",
    "description": "Financial Times:\nAdvertisers flock to Fox seeking an ‘audience of one’ — Donald Trump  —  Political ads drive booming sales revenues at network on back of record audience numbers  —  Advertisers are flocking to Fox News to reach “an audience of one”, accordin…",
    "link": "https://www.memeorandum.com/250714/p37",
    "timestamp": "2025-07-14T13:30:04Z"
  }
]