[
  {
    "title": "'New York Times' Finally Admits Trump Was Right About Migrant Gang Taking Over Colorado Apartment Complex",
    "description": "The 'New York Times' has finally admitted that Donald Trump was right when he warned that Tren de Aragua had taken over a Colorado apartment.\nThe post ‘New York Times’ Finally Admits Trump Was Right About Migrant Gang Taking Over Colorado Apartment Complex ap…",
    "link": "https://www.breitbart.com/immigration/2025/07/11/new-york-times-finally-admits-trump-was-right-about-migrant-gang-taking-over-colorado-apartment-complex/",
    "timestamp": "2025-07-11T20:56:52Z"
  },
  {
    "title": "A Year Later, Butler Shooting Marks the Defining Moment of Trump's Political Comeback (Eric Cortellessa/Time)",
    "description": "Eric Cortellessa / Time:\nA Year Later, Butler Shooting Marks the Defining Moment of Trump's Political Comeback … Trump's champions see his near-death experience as the moment he won over the country.  “It's Donald Trump being Donald Trump,” says Lara Trump, t…",
    "link": "https://www.memeorandum.com/250711/p84",
    "timestamp": "2025-07-11T20:55:01Z"
  },
  {
    "title": "McDonald's worker's blood-curdling Instagram post shortly before 'MURDERING' her manager",
    "description": "A McDonald's employee posted an unhinged Instagram rant accusing her manager of bullying her a day before she stabbed her to death. Afeni Muhammad, 26, stabbed her manager Jennifer 'Jamma' Harris at least 15 times at the Detroit area McDonald's on Thursday af…",
    "link": "https://freerepublic.com/focus/f-chat/4328181/posts",
    "timestamp": "2025-07-11T20:53:54Z"
  },
  {
    "title": "'Evil person': Trump lashes out as reporter asks about flood alert failure",
    "description": "A Texas CBS News reporter asked President Donald Trump about recent revelations that FEMA documents showed emergency alerts about devastating floods were not sent to cell phones as previously indicated. While the National Oceanic and Atmospheric Administratio…",
    "link": "https://www.rawstory.com/trump-texas-flood/",
    "timestamp": "2025-07-11T20:53:38Z"
  },
  {
    "title": "Pentagon acknowledges Iran’s attack on Qatar air base hit dome used for U.S. communications",
    "description": "The Iranian attack on Al Udeid Air Base outside of Doha, Qatar's capital, on June 23 came as a response to the American bombing of three nuclear sites in Iran.",
    "link": "https://www.pbs.org/newshour/world/pentagon-acknowledges-irans-attack-on-qatar-air-base-hit-dome-used-for-u-s-communications",
    "timestamp": "2025-07-11T20:51:02Z"
  },
  {
    "title": "California Mobs Wave Mexican Flags to Block ICE Enforcement",
    "description": "A mob waved foreign flags as it tried to block the enforcement of the nation’s popular laws at a pot-growing farm in rural California. The foreign affiliations of the mobs’ flags were spotlighted by Stephen Miller, top aide to President Donald Trump, and by t…",
    "link": "https://freerepublic.com/focus/f-news/4328179/posts",
    "timestamp": "2025-07-11T20:50:27Z"
  },
  {
    "title": "Newsom donor's cannabis farm under federal investigation for 'child labor violations'",
    "description": "The President of Glass House Farms, the cannabis farm that federal immigration authorities raided in California on Thursday despite protests, has donated thousands to Democrats in California. Co-founder, president, and board director Graham Farrar, who self-i…",
    "link": "https://freerepublic.com/focus/f-news/4328178/posts",
    "timestamp": "2025-07-11T20:50:04Z"
  },
  {
    "title": "The real reason Trump’s so publicly frustrated with Putin",
    "description": "President Donald Trump and Russia's President Vladimir Putin arrive to attend a joint press conference after a meeting at the Presidential Palace in Helsinki, on July 16, 2018.",
    "link": "https://biztoc.com/x/d539056ee0e7bf4f",
    "timestamp": "2025-07-11T20:49:21Z"
  },
  {
    "title": "Trump Announces New Tariff Rate For Canada",
    "description": "President Donald Trump on Thursday announced that he will impose a 35% tariff on goods imported from Canada starting August ...",
    "link": "https://biztoc.com/x/ac9f80a2f042d5f1",
    "timestamp": "2025-07-11T20:49:06Z"
  },
  {
    "title": "Director of federal agency suggests Fed Chairman Powell is considering resigning",
    "description": "A Trump administration official on Friday suggested that Federal Reserve Chair Jerome Powell is reportedly considering resigning.\nFederal Housing Finance Agency Director Bill Pulte – a vocal critic of Powell who has backed President Donald Trump's efforts to …",
    "link": "https://biztoc.com/x/2a034a37058236ed",
    "timestamp": "2025-07-11T20:49:02Z"
  },
  {
    "title": "Five questions about Trump’s 35% tariff threat to Canada",
    "description": "U.S. President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n one-upped himself on Thursday, using his social media account to release an open letter to Prime Minister \n \n \n \n \n \n \n \n \n \n Mark Carney\n \n \n \n \n \n \n \n \n \n threatening to impose \n \n \n \n \n \n \n…",
    "link": "https://biztoc.com/x/dc4f627b7600dda5",
    "timestamp": "2025-07-11T20:49:02Z"
  },
  {
    "title": "Space and defense firm Firefly Aerospace files for US IPO",
    "description": "Space and defense technology company Firefly Aerospace on Friday filed for an initial public offering in the United States. The U.S. IPO market is witnessing...",
    "link": "https://finance.yahoo.com/news/space-firm-firefly-aerospace-files-204831426.html",
    "timestamp": "2025-07-11T20:48:31Z"
  },
  {
    "title": "US Democrats push back on digital asset bills with ‘anti-crypto corruption week’",
    "description": "The US House of Representatives is expected to consider the CLARITY Act, GENIUS Act, and Anti-CBDC Surveillance State Act as part of Republicans’ push for crypto legislation.",
    "link": "https://cointelegraph.com/news/us-democrats-crypto-bills-anti-corruption-week",
    "timestamp": "2025-07-11T20:47:08Z"
  },
  {
    "title": "Trump Lashes Out at ‘Evil Person’ Who Asked About Flood Victims Upset Over Late Warnings",
    "description": "\"Only a bad person would ask a question like that, to be honest with you. I don't know who you are, but only a very evil person would ask a question like that\"\nThe post Trump Lashes Out at ‘Evil Person’ Who Asked About Flood Victims Upset Over Late Warnings f…",
    "link": "https://www.mediaite.com/politics/trump-lashes-out-at-evil-person-who-asked-about-flood-victims-upset-over-late-warnings/",
    "timestamp": "2025-07-11T20:45:54Z"
  },
  {
    "title": "Trump is carrying out a power grab the likes of which the U.S. has never seen",
    "description": "Ari Melber lays out the danger of Trump's aggressive, autocratic power grab after a federal court knocked down his birthright citizenship executive order.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-power-grab-executive-orders-rcna218291",
    "timestamp": "2025-07-11T20:45:42Z"
  },
  {
    "title": "Bitcoin tops $118,000 for the first time, as the cryptocurrency continues to climb to new heights",
    "description": "Bitcoin has reached yet another all-time high, surpassing $118,000 for the first time on Friday — as a flood of money continues to move into spot bitcoin ETFs, all while U.S. President Donald Trump's crypto-friendly influence makes its way through Washington.…",
    "link": "https://japantoday.com/category/business/bitcoin-tops-118-000-for-the-first-time-as-the-cryptocurrency-continues-to-climb-to-new-heights",
    "timestamp": "2025-07-11T20:45:22Z"
  },
  {
    "title": "Brazil downplays tariff impact as Trump says he will speak to Lula at some point",
    "description": "WASHINGTON/BRASILIA/SAO PAULO: Brazil's government on Friday (July 11) downplayed the impact of the 50% tariff US President Donald Trump threatened to impose on imports from that coun",
    "link": "https://www.channelnewsasia.com/world/brazil-downplays-tariff-impact-trump-says-he-will-speak-lula-some-point-5234346",
    "timestamp": "2025-07-11T20:45:17Z"
  },
  {
    "title": "PM warns Japan should not be underestimated, stoking tariff concern",
    "description": "Prime Minister Shigeru Ishiba's recent remark that Japan should not be &quot;underestimated&quot; by the United States is raising concerns among politicians and government officials at home about potential adverse effects on ongoing tariff negotiations. The c…",
    "link": "https://japantoday.com/category/politics/pm-warns-japan-should-not-be-underestimated-stoking-tariff-concern",
    "timestamp": "2025-07-11T20:43:26Z"
  },
  {
    "title": "UFC's Dana White hints that recently retired Jon Jones, Conor McGregor could return for White House fights",
    "description": "Dana White revealed that Jon Jones is back in the drug-testing pool for a potential White House fight, and Conor McGregor \"could be\" joining.",
    "link": "https://www.foxnews.com/sports/ufcs-dana-white-hints-recently-retired-jon-jones-conor-mcgregor-could-return-white-house-fights",
    "timestamp": "2025-07-11T20:41:17Z"
  },
  {
    "title": "Judge scolds Justice Department for 'refusal' to detail deportation plans for Kilmar Abrego Garcia",
    "description": "A federal judge in Maryland scolded the Trump administration on Friday for its “utter refusal” to detail its deportation plans for Kilmar Abrego Garcia, including where the government plans to send him and whether he’ll get a chance to fight his expulsion bef…",
    "link": "https://japantoday.com/category/world/judge-scolds-justice-department-for-%27refusal%27-to-detail-deportation-plans-for-kilmar-abrego-garcia",
    "timestamp": "2025-07-11T20:40:16Z"
  },
  {
    "title": "Trump arrives in Texas to survey flood damage as questions over response swirl",
    "description": "President Donald Trump arrived in Texas on Friday to survey the damage caused by flash flooding and to meet with local officials, first responders and relatives of some of the 120 people killed in the July 4 disaster. His visit comes at the end of a week of m…",
    "link": "https://japantoday.com/category/world/trump-arrives-in-texas-to-survey-flood-damage-as-questions-over-response-swirl",
    "timestamp": "2025-07-11T20:40:02Z"
  },
  {
    "title": "State Department is laying off over 1,300 employees under Trump administration plan",
    "description": "The U.S. State Department said Friday it is firing more than 1,300 employees in line with a dramatic reorganization plan from the Trump administration that critics say will damage America's global leadership and efforts to counter threats abroad. The departme…",
    "link": "https://japantoday.com/category/world/state-department-is-firing-over-1-300-employees-under-trump-administration-plan",
    "timestamp": "2025-07-11T20:39:55Z"
  },
  {
    "title": "Rubio meets China's Wang amid trade tensions, says good chance of Trump-Xi talks",
    "description": "U.S. Secretary of State Marco Rubio said on Friday he had &quot;positive and constructive&quot; talks with Chinese Foreign Minister Wang Yi, as the two major powers vied to push their agendas in Asia at a time of tension over Washington's tariff offensive. Th…",
    "link": "https://japantoday.com/category/world/rubio-meets-china%27s-wang-amid-trade-tensions-says-good-chance-of-trump-xi-talks1",
    "timestamp": "2025-07-11T20:39:47Z"
  },
  {
    "title": "Conservative Conference Attendees Take Turns Ripping Trump on Epstein",
    "description": "The Trump administration’s complete dismissal of the Jeffrey Epstein case continues to backfire as some of the most intense, involved members of his voting base think they’ve lost him to the “deep state.” As the Student Action Summit conference hosted by Char…",
    "link": "https://newrepublic.com/post/197890/turning-point-usa-conservative-conference-trump-epstein-deep-state",
    "timestamp": "2025-07-11T20:39:06Z"
  },
  {
    "title": "Inside New Orleans’ plan to fix its energy-hogging buildings",
    "description": "After a 10-year delay, the city passed an ordinance to benchmark its largest buildings in hopes of lowering bills and cutting emissions.",
    "link": "http://grist.org/buildings/inside-new-orleans-plan-to-fix-its-energy-hogging-buildings/",
    "timestamp": "2025-07-11T20:38:59Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez Calls Trump a 'Rapist,' Accuses Him of Withholding Epstein Files",
    "description": "Alexandria Ocasio-Cortez says the public should've known President Donald Trump wouldn't release the Epstein files ... after all, his track record with sexual abuse ain't spotless! The Congresswoman from New York posted to X Friday morning ...…\n Permalink",
    "link": "https://www.tmz.com/2025/07/11/aoc-x-post-trump-hiding-epstein-files/",
    "timestamp": "2025-07-11T20:38:56Z"
  },
  {
    "title": "'Superman' Aims To Save Flagging Film Franchise, Not Just Humanity",
    "description": "Superman is often called upon to save the world from evildoers, but in his latest big-screen incarnation, he's also being asked to swoop in and save a franchise.",
    "link": "https://www.ibtimes.com/superman-aims-save-flagging-film-franchise-not-just-humanity-3778281",
    "timestamp": "2025-07-11T20:36:22Z"
  },
  {
    "title": "'Superman' Aims To Save Flagging Film Franchise, Not Just Humanity",
    "description": "Superman is often called upon to save the world from evildoers, but in his latest big-screen incarnation, he's also being asked to swoop in and save a franchise.",
    "link": "https://www.ibtimes.com.au/superman-aims-save-flagging-film-franchise-not-just-humanity-1859630",
    "timestamp": "2025-07-11T20:36:14Z"
  },
  {
    "title": "Five questions about Trump’s 35% tariff threat to Canada",
    "description": "Canada was nearing a deal deadline of July 21 with the U.S. But then the U.S. president made a social post",
    "link": "https://financialpost.com/news/economy/5-questions-donald-trump-35-tariff-threat-canada",
    "timestamp": "2025-07-11T20:34:52Z"
  },
  {
    "title": "Trump Lashes Out at Reporter Over Texas Floods Question: 'Evil Person'",
    "description": "Joined by First Lady Melania Trump and officials, Trump surveyed devastation and met with victims' families and emergency responders.",
    "link": "https://www.newsweek.com/donald-trump-texas-flooding-reporter-evil-person-2098051",
    "timestamp": "2025-07-11T20:34:37Z"
  },
  {
    "title": "Trump announces new tariffs and gets Supreme Court's OK on layoff plans",
    "description": "The Supreme Court gave President Trump the green light to move forward with plans to lay off thousands of federal workers. We discuss the potential impacts of the ruling, plus new tariffs Trump announced this week. \nThis episode: political correspondent Ashle…",
    "link": "https://www.npr.org/2025/07/11/1255526954/podcast-tariff-scotus-layoffs",
    "timestamp": "2025-07-11T20:32:07Z"
  },
  {
    "title": "Nick Offerman Says ‘Dumb People Insist Ron Swanson’ Voted for Trump: Ron ‘Would Despise’ Trump ‘Because He’s Disrespectful to Women’",
    "description": "Nick Offerman said in an interview with IndieWire while promoting his film “Sovereignty” that only “dumb people” think Ron Swanson, his beloved “Parks and Recreation” character, is a Donald Trump supporter. Offerman played Ron on all seven seasons of the NBC …",
    "link": "https://variety.com/2025/tv/news/nick-offerman-ron-swanson-trump-vote-dumb-people-1236453536/",
    "timestamp": "2025-07-11T20:31:49Z"
  },
  {
    "title": "The Trump Administration Is Fracturing Over the Epstein Files",
    "description": "FBI Deputy Director Dan Bongino may be planning to resign amid major MAGA backlash over the Department of Justice’s Jeffrey Epstein investigation according to one of Donald Trump’s slimiest allies. Laura Loomer, a prominent MAGA influencer in the president’s …",
    "link": "https://newrepublic.com/post/197892/trump-administration-fracturing-jeffrey-epstein-files-dan-bongino-laura-loomer-pam-bondi",
    "timestamp": "2025-07-11T20:30:57Z"
  },
  {
    "title": "Trump’s Response To Disaster In A Red State Doesn’t Bode Well For Others",
    "description": "After catastrophic flooding in central Texas left the area devastated, the Trump administration’s lackluster response offers a chilling glimpse of what’s in store for when the next disaster strikes.",
    "link": "https://www.huffpost.com/entry/trump-fema-response-texas-flood_n_687162c2e4b07da2c081a6c5",
    "timestamp": "2025-07-11T20:30:17Z"
  },
  {
    "title": "Trump to tour Texas flood damage but is quiet about his pledge to shutter FEMA",
    "description": "President Donald Trump arrived Friday in Texas for a firsthand look at the devastation from the state's catastrophic flooding, but remains quiet about his promises to do away with FEMA.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_3f9c4d4a-f506-52ff-b89f-88accde21c00.html",
    "timestamp": "2025-07-11T20:30:00Z"
  },
  {
    "title": "BANNON: This is America’s last chance (to take down the Deep State)",
    "description": "@gc22gc BANNON: The only way we win is to tell them nothing else happens until we take Epstein on. If we don’t take down the deep state in this term, it’s over. This is America’s last chance.",
    "link": "https://freerepublic.com/focus/f-chat/4328175/posts",
    "timestamp": "2025-07-11T20:28:38Z"
  },
  {
    "title": "The real reason Trump’s so publicly frustrated with Putin",
    "description": "President Trump wanted to play hero in the Russia-Ukraine war. Vladimir Putin won't allow it.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-putin-ukraine-russia-nato-weapons-peace-deal-rcna218117",
    "timestamp": "2025-07-11T20:28:18Z"
  },
  {
    "title": "Evangelicals for Harris posts apology for misusing Billy Graham’s image for their politics",
    "description": "'The long and short of it is that they used these clips of Billy Graham, but didn't get permission … To avoid being sued into oblivion for lifting these clips and using them for partisan purposes to support an abortion-loving Democratic candidate, they've apo…",
    "link": "https://www.wnd.com/2025/07/evangelicals-harris-posts-apology-misusing-billy-grahams-image/",
    "timestamp": "2025-07-11T20:28:02Z"
  },
  {
    "title": "Trump Camp Blasts ‘The View’ Co-Host Ana Navarro for Condemning Florida ICE Detention Tourism: ‘Can’t Get Any Dumber’",
    "description": "The White House responds after the ABC personality called Alligator Alcatraz visitors \"racist\" and \"horrible\"\nThe post Trump Camp Blasts ‘The View’ Co-Host Ana Navarro for Condemning Florida ICE Detention Tourism: ‘Can’t Get Any Dumber’ appeared first on TheW…",
    "link": "https://www.thewrap.com/donald-trump-ana-navarro-alligator-alcatraz-ice-visitors-response/",
    "timestamp": "2025-07-11T20:27:20Z"
  },
  {
    "title": "White House Slams ‘The View’s Ana Navarro For Criticizing Alligator Alcatraz: She “Can’t Get Any Dumber”",
    "description": "Navarro recently claimed Trump wants to \"make America white again\" through his controversial immigration policies.",
    "link": "https://decider.com/2025/07/11/white-house-slams-views-ana-navarro-criticizing-alligator-alcatraz/",
    "timestamp": "2025-07-11T20:26:45Z"
  },
  {
    "title": "Tron's Justin Sun says he's buying another $100 million of Trump's memecoin",
    "description": "Crypto billionaire Justin Sun is buying another $100 million worth of $TRUMP, doubling his total known stake of digital coins tied to President Donald Trump.\nSun, who founded the TRON blockchain and is working to resolve a civil fraud case with the Securities…",
    "link": "https://biztoc.com/x/c5a7e1a7fb8775e1",
    "timestamp": "2025-07-11T20:26:29Z"
  },
  {
    "title": "Trump's 'big beautiful bill' could deliver 45.5% 'SALT torpedo' for high earners, tax pro says",
    "description": "President Donald Trump, center, during a signing ceremony for the One Big Beautiful Bill Act on the South Lawn of the White House in Washington, D.C., on July 04.",
    "link": "https://biztoc.com/x/6fbb0130f713e09d",
    "timestamp": "2025-07-11T20:26:27Z"
  },
  {
    "title": "U.S. Apparel Imports From China Fell to a 22-Year Low in May Amid Trade War Escalation",
    "description": "China's share of the U.S. apparel sourcing market fell below 10 percent for the first time in more than two decades.",
    "link": "http://wwd.com/business-news/government-trade/us-apparel-imports-china-fall-trade-tariffs-trump-sheng-lu-2-1237978925/",
    "timestamp": "2025-07-11T20:25:03Z"
  },
  {
    "title": "Battleground Georgia to Clean 478,000 Ineligible Voters From Rolls",
    "description": "The battleground state of Georgia is undertaking an effort to remove about 478,888 inactive or ineligible voters from the rolls, which includes people that appear... Read More\nThe post Battleground Georgia to Clean 478,000 Ineligible Voters From Rolls appeare…",
    "link": "https://www.dailysignal.com/2025/07/11/battleground-georgia-to-clean-478000-ineligible-voters-from-rolls/",
    "timestamp": "2025-07-11T20:23:57Z"
  },
  {
    "title": "Justice Ketanji Brown Jackson says ‘state of our democracy’ keeps her up at night",
    "description": "Ketanji Brown Jackson may be the most junior justice on the Supreme Court, but she has no qualms about making her voice heard.",
    "link": "https://www.msnbc.com/top-stories/latest/ketanji-brown-jackson-democracy-dissents-supreme-court-rcna218353",
    "timestamp": "2025-07-11T20:23:24Z"
  },
  {
    "title": "Infuriating and Gripping, Apocalypse in the Tropics Must Be Seen",
    "description": "The Brazilian filmmaker Petra Costa has been documenting the turmoil in her country for years now. In the extraordinary ‘Apocalypse in the Tropics,’ she charts the rise of Evangelical Christianity and its growing influence on Brazil’s politics.",
    "link": "http://www.vulture.com/article/review-netflixs-infuriating-apocalypse-in-the-tropics.html",
    "timestamp": "2025-07-11T20:22:15Z"
  },
  {
    "title": "Dem Sen. Jeanne Shaheen Doesn’t Budge When Asked If Party Should Become ‘Anti-War’",
    "description": "Jeanne Shaheen said that her party should not seize the chance to become \"the anti-war party\" after America's bombing of Iranian nuclear facilities.",
    "link": "https://dailycaller.com/2025/07/11/dem-sen-jeanne-shaheen-doesnt-budge-anti-war/",
    "timestamp": "2025-07-11T20:21:56Z"
  },
  {
    "title": "Malfunction As Animatronic Trump Keeps Rounding Up All The Mexican Guests And Deporting Them From Disney World",
    "description": "ORLANDO, FL — What began as a normal day at the Magic Kingdom descended into a near-riot atmosphere, as — due to a malfunction — The Hall of Presidents' animatronic Donald Trump kept rounding up all of the Mexican guests and attempting to deport them from Dis…",
    "link": "https://babylonbee.com/news/malfunction-as-animatronic-trump-keeps-rounding-up-all-the-mexican-guests-and-deporting-them-from-disney-world",
    "timestamp": "2025-07-11T20:21:54Z"
  },
  {
    "title": "Judicial Nominee Bove Deemed 'Unfit' Over Answers on Jan. 6, Third Trump Term",
    "description": "Emil Bove, a former attorney for U.S. President Donald Trump who has been nominated to serve as a judge on the U.S. Court of Appeals for the 3rd Circuit, was denounced as \"unfit\" on Friday due to answers he gave on a Senate questionnaire.As reported by CBS Ne…",
    "link": "https://www.commondreams.org/news/emil-bove-3rd-circuit-nomination",
    "timestamp": "2025-07-11T20:21:33Z"
  },
  {
    "title": "Influencer tries to cancel 113-year-old San Francisco oyster house over MAGA hat... but owners fire back",
    "description": "A food influencer tried to shame and bully a 113 year-old mom and pop oyster house over a pro-Trump hat propped on the restaurant's shelf - but sound found herself blasted over her performative woke antics. California-based creator Kat Ensign shared a snap of…",
    "link": "https://freerepublic.com/focus/f-chat/4328174/posts",
    "timestamp": "2025-07-11T20:20:14Z"
  },
  {
    "title": "Jasmine Crockett rips Trump ‘regime,’ vows ‘solidarity’ with Biden witnesses during House probe",
    "description": "Crockett made a second surprise appearance at House Oversight Committee proceedings this week.",
    "link": "https://nypost.com/2025/07/11/media/jasmine-crockett-rips-trump-regime-vows-solidarity-with-biden-witnesses-during-house-probe/",
    "timestamp": "2025-07-11T20:18:37Z"
  },
  {
    "title": "White House ramps up pressure on Fed's Powell three weeks before next interest rate decision",
    "description": "President Donald Trump’s pressure campaign against the Federal Reserve and Chair Jerome Powell to lower interest rates entered a new front this week",
    "link": "https://www.nbcnews.com/business/economy/trump-admin-attacks-federal-reserve-chair-jerome-powell-what-to-know-rcna218343",
    "timestamp": "2025-07-11T20:16:45Z"
  },
  {
    "title": "Iranian Group Reportedly Offers $40 Million Bounty On Trump For ‘Cause Of Allah’",
    "description": "An Iranian group promoted on state television claims to have raised $40 million as a reward for Donald Trump's assassination, according to a new report.",
    "link": "https://dailycaller.com/2025/07/11/iranian-group-reportedly-placing-massive-40-million-bounty-donald-trump/",
    "timestamp": "2025-07-11T20:16:03Z"
  },
  {
    "title": "Trump Meets Texas Flood First Responders in Kerrville",
    "description": "President Donald Trump in Texas on Friday viewed firsthand the devastation left by extreme flooding that killed at least 120 people and left scores still missing in the state’s Hill Country region, seeking to reassure residents of the federal response to the …",
    "link": "https://biztoc.com/x/6770d3c6d311e3eb",
    "timestamp": "2025-07-11T20:15:33Z"
  },
  {
    "title": "Markets wobble after Trump threatens Canada with 35% tariff over alleged ‘flow of Fentanyl’",
    "description": "The S&P 500 followed a record-breaking Thursday by dipping 0.33% Friday after President Donald Trump said he would impose a 35% tariff on Canada on August 1.\nThe stock market dipped on Friday after President Donald Trump issued his latest tariff threat agains…",
    "link": "https://biztoc.com/x/fcee16a55a115274",
    "timestamp": "2025-07-11T20:15:18Z"
  },
  {
    "title": "Reports: Dan Bongino ‘may’ resign from FBI over Epstein fallout",
    "description": "Among Trump supporters enraged over DOJ statement that no more information coming out about convicted sex offender",
    "link": "https://www.wnd.com/2025/07/reports-dan-bongino-may-resign-fbi-epstein-fallout/",
    "timestamp": "2025-07-11T20:15:09Z"
  },
  {
    "title": "Blue State Blues: Netanyahu Seals His Place in History",
    "description": "Netanyahu will be remembered as a victorious wartime leader and statesman after his success in the 12 Day War against Iran.\nThe post Blue State Blues: Netanyahu Seals His Place in History appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/07/11/blue-state-blues-netanyahu-seals-his-place-in-history/",
    "timestamp": "2025-07-11T20:14:01Z"
  },
  {
    "title": "City of Portland: Broadway Main Street project on ice due to Trump budget bill",
    "description": "The safe streets liberals must be stopped!",
    "link": "https://bikeportland.org/2025/07/11/city-of-portland-broadway-main-street-project-on-ice-due-to-trump-budget-bill-395420",
    "timestamp": "2025-07-11T20:13:25Z"
  },
  {
    "title": "L.A. will provide cash assistance to immigrants affected by raids",
    "description": "Mayor Karen Bass announced a plan Friday to provide direct cash assistance to people who have been affected by the Trump administration’s sweeping immigration raids. The aid will be distributed using cash cards with a “couple hundred” dollars on them, which s…",
    "link": "https://freerepublic.com/focus/f-news/4328173/posts",
    "timestamp": "2025-07-11T20:12:30Z"
  },
  {
    "title": "Dan Bongino Might Quit FBI as ‘Epstein Files’ Scandal Boils Over: Reports",
    "description": "One source told Axios \"he ain't coming back.\"",
    "link": "https://gizmodo.com/dan-bongino-might-quit-fbi-as-epstein-files-scandal-boils-over-reports-2000628238",
    "timestamp": "2025-07-11T20:10:49Z"
  },
  {
    "title": "Trump lied and didn’t want Americans to know - Iran hit top-secret US communications dome at Qatar airbase",
    "description": "Satellite imagery analysis revealed that Iran's missile strike on Al Udeid Air Base in Qatar, despite being downplayed by the Trump administration, severely damaged a geodesic dome housing a $15 million US secure communications system. The attack, a response …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-lied-and-didnt-want-americans-to-know-iran-hit-top-secret-us-communications-dome-at-qatar-airbase-us-iran-attack-donald-trump-news/articleshow/122394845.cms",
    "timestamp": "2025-07-11T20:10:12Z"
  },
  {
    "title": "NH green card holder denied reentry to U.S. after visiting native Canada",
    "description": "The man, who supported President Donald Trump though he can't vote, says he \"feels differently\" now and blames the administration for his immigration plight.",
    "link": "https://www.nbcnews.com/news/us-news/nh-green-card-holder-denied-reentry-canada-trump-rcna218345",
    "timestamp": "2025-07-11T20:08:57Z"
  },
  {
    "title": "Russian drones strike Ukraine, damaging a maternity hospital",
    "description": "KYIV: A Russian drone barrage targeted the centre of Kharkiv on Friday (July 11), injuring nine people and damaging a maternity hospital in Ukraine’s second-largest city, offi",
    "link": "https://www.channelnewsasia.com/asia/russian-drones-strike-ukraine-damaging-maternity-hospital-5233706",
    "timestamp": "2025-07-11T20:08:35Z"
  },
  {
    "title": "Russian drones strike Ukraine, damaging maternity hospital",
    "description": "KYIV: A Russian drone barrage targeted the centre of Kharkiv on Friday (Jul 11), injuring nine people and damaging a maternity hospital in Ukraine’s second-largest city, offic",
    "link": "https://www.channelnewsasia.com/world/russian-drones-strike-ukraine-damaging-maternity-hospital-5233706",
    "timestamp": "2025-07-11T20:08:00Z"
  },
  {
    "title": "‘Trainwreck!’ Megyn Kelly and MAGA Influencer Embarrassed at Epstein Binder Flop Torch Pam Bondi",
    "description": "Megyn Kelly and MAGA commentator Liz Wheeler took turns beating up on Attorney General Pam Bondi over her handling of the Jeffrey Epstein case on Thursday.\nThe post ‘Trainwreck!’ Megyn Kelly and MAGA Influencer Embarrassed at Epstein Binder Flop Torch Pam Bon…",
    "link": "https://www.mediaite.com/media/news/trainwreck-megyn-kelly-and-maga-influencer-embarrassed-at-epstein-binder-flop-torch-pam-bondi/",
    "timestamp": "2025-07-11T20:07:02Z"
  },
  {
    "title": "Trump didn't ask people to focus on girls who died in Texas floods over Epstein files",
    "description": "U.S. President Donald Trump wrote on Truth Social: “Could you all just FOCUS on the very many other more important things to discuss than whether or not I may or MAY NOT be all over the Epstein Files? There was a BIG FLOOD in Texas. Huge flood as it relates t…",
    "link": "https://www.snopes.com//fact-check/trump-texas-floods-epstein-files/",
    "timestamp": "2025-07-11T20:07:00Z"
  },
  {
    "title": "Markets wobble after Trump threatens Canada with 35% tariff over alleged ‘flow of Fentanyl’",
    "description": "The S&P 500 fell 0.33%, the Nasdaq dropped 0.23%, and the Dow dipped 0.63%.",
    "link": "https://fortune.com/2025/07/11/stock-market-today-sp500-nasdaq-dow-trump-canada-tariffs-mark-carney/",
    "timestamp": "2025-07-11T20:06:47Z"
  },
  {
    "title": "How Trump can stop killings in Ukraine and score a win for the US — and himself",
    "description": "Even before a Russian attack drone murdered an innocent 1-year-old Wednesday and highlighted Vladimir Putin’s savagery, President Donald Trump seemed headed in the right direction on Ukraine.",
    "link": "https://nypost.com/2025/07/11/opinion/how-trump-can-stop-killings-in-ukraine-and-score-a-win-for-the-us-and-himself/",
    "timestamp": "2025-07-11T20:05:07Z"
  },
  {
    "title": "Wall Street closes lower over trade uncertainty",
    "description": "Major Wall Street stock markets traded lower at the closing bell on Friday after a turbulent week dominated by trade uncertainty that arose as a result of United States President Donald Trump imposing...",
    "link": "https://biztoc.com/x/4ab949ebdd037f42",
    "timestamp": "2025-07-11T20:04:41Z"
  },
  {
    "title": "Why does the AI-powered chatbot Grok post false, offensive things on X?",
    "description": "Grok, Elon Musk’s AI chatbot, has praised Hitler, dabbled in Holocaust denialism and ranted about “white genocide” in South Africa. That’s happening because of Grok’s instructions and training material, experts say.",
    "link": "https://www.pbs.org/newshour/politics/why-does-the-ai-powered-chatbot-grok-post-false-offensive-things-on-x",
    "timestamp": "2025-07-11T20:04:38Z"
  },
  {
    "title": "The CBO Breakdown on Medicaid Losses, Increase in Uninsured",
    "description": "The Congressional Budget Office estimated that the House version of the One Big Beautiful Bill Act would reduce Medicaid enrollment and cause millions of people to become uninsured by 2034. It didn’t say that “5 million” of the people who are “going to lose i…",
    "link": "https://www.factcheck.org/2025/07/the-cbo-breakdown-on-medicaid-losses-increase-in-uninsured/",
    "timestamp": "2025-07-11T20:04:35Z"
  },
  {
    "title": "Surprise! The US Treasury just posted a surplus for June thanks to tariffs",
    "description": "I am sure that Donald Trump and Treasury Secretary Scott Bessent don't want to say \"I told you so,\" but... Yes, according to CNBC the United States just posted some big economic dubs, with the budget hitting a surplus thanks to the tariffs that - one day, I a…",
    "link": "https://freerepublic.com/focus/f-news/4328172/posts",
    "timestamp": "2025-07-11T20:03:59Z"
  },
  {
    "title": "Russ Vought 'Confident' $9.4 Billion Package to Codify DOGE Cuts to PBS, NPR, and USAID Will Pass Congress",
    "description": "Director of the U.S. Office of Management and Budget Russ Vought said he is confident the 9.4 billion rescissions package to codify DOGE cuts to PBS, NPR, and USAID will pass Congress. \nThe post Russ Vought ‘Confident’ $9.4 Billion Package to Codify DOGE Cuts…",
    "link": "https://www.breitbart.com/politics/2025/07/11/vought-confident-9-4-billion-rescissions-package-will-pass-congress/",
    "timestamp": "2025-07-11T20:03:40Z"
  },
  {
    "title": "Trump blocks acquisition of equipment supplier Jupiter Systems by Hong Kong firm",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump issued an order blocking the acquisition of audiovisual equipment supplier Jupiter Systems by Hong Kong...",
    "link": "https://www.yahoo.com/news/trump-blocks-acquisition-equipment-supplier-200253483.html",
    "timestamp": "2025-07-11T20:02:53Z"
  },
  {
    "title": "Ex-CNN Producer Celebrates 47th Birthday Behind Bars as Convicted Pedophile",
    "description": "Former CNN producer John Griffin turns 47 today. It is not yet known whether his former boss, disgraced former anchor Chris Cuomo, sometimes referred to as \"Fredo,\" sent Griffin a care package via the commissary at his current residence in federal prison, whe…",
    "link": "https://freebeacon.com/media/ex-cnn-producer-celebrates-47th-birthday-behind-bars-as-convicted-pedophile/",
    "timestamp": "2025-07-11T20:00:27Z"
  },
  {
    "title": "Everything we know about Texas floods that have killed at least 121 as Trump arrives at disaster site",
    "description": "President Donald Trump is visiting Texas, one week after the horror floods plunged the state into crisis, killing 121 and leaving over 170 unaccounted for.",
    "link": "https://www.ladbible.com/news/us-news/texas-floods-latest-death-toll-search-efforts-donald-trump-visit-690325-20250711",
    "timestamp": "2025-07-11T19:59:26Z"
  },
  {
    "title": "He's lived in the U.S. since he was 3. At 46, he was denied re-entry at the border",
    "description": "When Christopher Landry was making his annual trip to New Brunswick from New Hampshire, he didn't think he would run into any problems. But on his way home crossing the border to the U.S. in Houlton, Maine, he found out he wasn’t allowed back.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/us-man-denied-entry-1.7583146",
    "timestamp": "2025-07-11T19:59:13Z"
  },
  {
    "title": "Trump ends whirlwind week with billions in new tariff revenue and a more complicated trade war",
    "description": "Donald Trump capped off a whirlwind series of tariff threats with confirmation that he has broken yet another tariff revenue record, ending a week where his ...",
    "link": "https://finance.yahoo.com/news/trump-ends-whirlwind-week-with-billions-in-new-tariff-revenue-and-a-more-complicated-trade-war-195745056.html",
    "timestamp": "2025-07-11T19:57:45Z"
  },
  {
    "title": "Trump arrives in Texas to survey flood devastation but stays quiet on pledge to shut disaster agency",
    "description": "US president Donald Trump arrived on Friday in Texas for a firsthand look at the devastation from the state's catastrophic flooding, but he has remained conspicuously quiet about his previous promises to do away with the federal agency in charge of disaster r…",
    "link": "https://www.independent.ie/world-news/north-america/trump-arrives-in-texas-to-survey-flood-devastation-but-stays-quiet-on-pledge-to-shut-disaster-agency/a407890663.html",
    "timestamp": "2025-07-11T19:57:29Z"
  },
  {
    "title": "FBI's 'KGB-style' tactic on own agents astounds expert: 'Death of Stalin stuff'",
    "description": "International affairs specialist and retired Naval War College professor Tom Nichols is astounded by reports that the FBI was demanding polygraphs for agents to prove their loyalty. Speaking to host Katy Tur on Friday, Nichols and ex-FBI agent Jim Davidson, w…",
    "link": "https://www.rawstory.com/fbi/",
    "timestamp": "2025-07-11T19:54:39Z"
  },
  {
    "title": "How to Lose Friends and Alienate Partners",
    "description": "Dismantling Afghan immigration policies and CARE undermines U.S. security.",
    "link": "http://foreignpolicy.com/2025/07/11/immigration-afghanistan-united-states-national-security-trump/",
    "timestamp": "2025-07-11T19:53:36Z"
  },
  {
    "title": "Trump uses tariffs to upend Brazil's domestic politics",
    "description": "President Donald Trump's surprise announcement on Wednesday that the White House planned to levy a 50% tariff on Brazilian imports has sent shockwaves through both countries, leaving consumers and producers scrambling to assess the full impact. But as Trump m…",
    "link": "https://biztoc.com/x/3063c4206c416e01",
    "timestamp": "2025-07-11T19:53:15Z"
  },
  {
    "title": "Jamie Dimon breaks with ‘idiots’ in Democratic Party, saying they ‘have big hearts and little brains’",
    "description": "\"They do not understand how the real world works,\" said the JPMorgan Chase CEO. \"Almost every single policy rolled out failed.\"",
    "link": "https://fortune.com/2025/07/11/jamie-dimon-democratic-party-idiots-dei-social-issues/",
    "timestamp": "2025-07-11T19:51:47Z"
  },
  {
    "title": "Jamie Dimon breaks with ‘idiots’ in Democratic Party, saying they ‘have big hearts and little brains’",
    "description": "\"They do not understand how the real world works,\" said the JPMorgan Chase CEO. \"Almost every single policy rolled out failed.\"",
    "link": "https://finance.yahoo.com/news/jamie-dimon-breaks-idiots-democratic-195147498.html",
    "timestamp": "2025-07-11T19:51:47Z"
  },
  {
    "title": "Trump administration has floated deporting third-party nationals to Africa. Here's what we know",
    "description": "South Sudan has accepted eight third-country deportees from the U.S. and Rwanda says it’s in talk with the administration of President Donald Trump on a similar deal",
    "link": "https://abcnews.go.com/International/wireStory/trump-administration-floated-deporting-party-nationals-africa-123687714",
    "timestamp": "2025-07-11T19:50:42Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with Officials, First Responders After Texas Floods",
    "description": "President Donald Trump travels to Kerrville, Texas, to meet with first responders and officials following devastating Independence Day floods.\nThe post Watch Live: Donald Trump Meets with Officials, First Responders After Texas Floods appeared first on Breitb…",
    "link": "https://www.breitbart.com/weather/2025/07/11/watch-live-donald-trump-meets-with-officials-first-responders-after-texas-floods/",
    "timestamp": "2025-07-11T19:49:35Z"
  },
  {
    "title": "As millions adopt Grok to fact-check, misinformation abounds",
    "description": "As Grok provides instant fact checks to users on X, its ability to make things up is outstripping its usefulness.",
    "link": "https://www.aljazeera.com/economy/2025/7/11/as-millions-adopt-grok-to-fact-check-misinformation-abounds",
    "timestamp": "2025-07-11T19:48:07Z"
  },
  {
    "title": "Trump’s budget chief pushes luxury jet reno while slashing CDC and schools",
    "description": "Russell Vought, President Donald Trump’s Director of the Office of Management and Budget, is defending plans to spend an estimated $1 billion retrofitting an aging luxury 747 jetliner for use as Air Force One—even though it will be in service for only about a…",
    "link": "https://www.rawstory.com/trump-jet-2673129080/",
    "timestamp": "2025-07-11T19:48:02Z"
  },
  {
    "title": "Relations with US will never be the same – von der Leyen",
    "description": "Relations with the US may never recover, EU chief Ursula von der Leyen has said, as Washington gets ready to set 20% tariffs on EU imports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621363-relations-us-never-same-again-leyen/",
    "timestamp": "2025-07-11T19:47:33Z"
  },
  {
    "title": "Greg Abbott is making a mockery of the Voting Rights Act",
    "description": "Texas Gov. Greg Abbott called a special session to potentially redistrict ahead of the midterms to help Trump keep the GOP majority in the House.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-texas-abbott-redistricting-congressional-maps-rcna218120",
    "timestamp": "2025-07-11T19:46:35Z"
  },
  {
    "title": "Oil Rises on Looming US Russia Sanction Threats",
    "description": "Oil rose nearly 3% as traders braced for new US sanctions on Russian energy.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_on_looming_us_russia_sanction_threats-11-jul-2025-181122-article/",
    "timestamp": "2025-07-11T19:46:15Z"
  },
  {
    "title": "As Trump and Netanyahu meet in Washington, Israel unveils a concentration camp in southern Gaza",
    "description": "Benjamin Netanyahu visited Washington this week to meet with Trump administration officials following the countries' joint attack on Iran. The lack of transparency about what was actually discussed could be a very dangerous sign.",
    "link": "https://mondoweiss.net/2025/07/as-trump-and-netanyahu-meet-in-washington-israel-unveils-a-concentration-camp-in-southern-gaza/",
    "timestamp": "2025-07-11T19:45:44Z"
  },
  {
    "title": "9/11 Attackers Can Be Subject To Death Penalty, Court Rules",
    "description": "An appeals court ruled that the Defense Secretary can scrap plea agreements shielding three Sept. 11 terrorists from the death penalty.",
    "link": "https://dailycaller.com/2025/07/11/9-11-attackers-death-penalty-court-rules-plea-deal-biden-lloyd-austin/",
    "timestamp": "2025-07-11T19:41:22Z"
  },
  {
    "title": "Putin’s elite commander of bloodthirsty brigade accused of horror war crimes and massacres wiped out in Ukraine strike",
    "description": "VLADIMIR Putin's brutal war machine was dealt another blow today as Moscow confirmed the death of another top Russian military chief. Russian authorities have confirmed the death of Colonel Sergei Ilyin, commander of Russia's notorious 155th Marine Brigade. T…",
    "link": "https://freerepublic.com/focus/f-chat/4328170/posts",
    "timestamp": "2025-07-11T19:41:17Z"
  },
  {
    "title": "Trump uses tariffs to upend Brazil's domestic politics",
    "description": "By slapping a 50% tariff on Brazil for its criminal investigation into Bolsonaro, the Trump administration is brazenly putting its fingers on the scales of a key foreign election",
    "link": "https://theweek.com/politics/trump-brazil-bolsonaro-tariff",
    "timestamp": "2025-07-11T19:40:40Z"
  },
  {
    "title": "World War III brewing? At Trump’s command, Hegseth orders Pentagon to act fast — massive drone surge begins",
    "description": "Under Donald Trump's direction, the Pentagon is aggressively accelerating its drone program to surpass China and Russia. Defense Secretary Pete Hegseth has eliminated bureaucratic obstacles, empowering field commanders to independently acquire, test, and depl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/world-war-iii-brewing-at-trumps-command-hegseth-orders-pentagon-to-act-fast-massive-drone-surge-begins/articleshow/122394111.cms",
    "timestamp": "2025-07-11T19:40:34Z"
  }
]