[
  {
    "title": "Cristiano Ronaldo avoids 2026 World Cup suspension in new FIFA ruling",
    "description": "Cristiano Ronaldo was at risk of missing Portugal's opening match of the 2026 World Cup due to a recent red card before FIFA's decision.",
    "link": "https://www.usatoday.com/story/sports/soccer/worldcup/2025/11/25/cristiano-ronaldo-world-cup-ban-red-card-fifa-ruling/87470411007/",
    "timestamp": "2025-11-25T21:31:21Z"
  },
  {
    "title": "Trump says he's sending his envoys to see Putin and Ukrainians after fine-tuning plan",
    "description": "President Donald Trump said Tuesday his plan to end the war in Ukraine was \"fine-tuned\" and he's sending his representatives to meet Russian and Ukrainian officials.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_c5865e58-c7e2-596b-ae16-dfc909217846.html",
    "timestamp": "2025-11-25T21:30:00Z"
  },
  {
    "title": "Japan fires back at 'unsubstantiated' Chinese letter to U.N.",
    "description": "Japan has dismissed a Chinese letter to the United Nations accusing Tokyo of threatening armed intervention over Taiwan as &quot;inconsistent with the facts and unsubstantiated&quot;. Japan's U.N. ambassador, Kazuyuki Yamazaki, was responding to a letter Chin…",
    "link": "https://japantoday.com/category/politics/Japan-dismisses-unsubstantiated-Chinese-letter-to-UN",
    "timestamp": "2025-11-25T21:29:37Z"
  },
  {
    "title": "Democratic congressman’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "U.S. Rep. Eric Swalwell sued Federal Housing Finance Agency Director Bill Pulte.",
    "link": "https://www.bostonherald.com/2025/11/25/justice-department-mortgage-fraud-lawsuit/",
    "timestamp": "2025-11-25T21:29:22Z"
  },
  {
    "title": "Best Buy ups sales outlook heading into holiday shopping ramp-up",
    "description": "Best Buy raised its profit and sales expectations ahead of the holiday shopping ramp-up on Black Friday after a strong third quarter. Comparable-store sales at the nation's largest consumer electronics chain rose 2.7%, fueled by computing, gaming and mobile p…",
    "link": "https://japantoday.com/category/business/best-buy-ups-sales-outlook-heading-into-holiday-shopping-ramp-up",
    "timestamp": "2025-11-25T21:27:56Z"
  },
  {
    "title": "U.S. retail sales lose steam, consumer confidence falls as costs bite",
    "description": "U.S. retail sales lost momentum in September and firms grappled with an uptick in business costs, government data showed Tuesday, underscoring growing concerns about affordability in the world's biggest economy. Beyond these delayed economic figures -- indica…",
    "link": "https://japantoday.com/category/business/us-retail-sales-miss-expectations-as-consumers-see-higher-costs",
    "timestamp": "2025-11-25T21:27:44Z"
  },
  {
    "title": "Trump EPA moves to abandon rule that sets soot pollution standards",
    "description": "The Trump administration is seeking to abandon a rule that sets tough standards for deadly soot pollution, arguing that the Biden administration did not have the authority to set the tighter standard.",
    "link": "https://www.wmur.com/article/trump-epa-soot-pollution-standard/69546664",
    "timestamp": "2025-11-25T21:26:50Z"
  },
  {
    "title": "Trump Push Gets ‘Rush Hour 4’ Greenlit by Close Ally At Paramount, Report Says",
    "description": "Due to an unexpected push from President Donald Trump to make it happen, Paramount has reportedly greenlit the production of a new Rush Hour movie.\nThe post Trump Push Gets ‘Rush Hour 4’ Greenlit by Close Ally At Paramount, Report Says first appeared on Media…",
    "link": "https://www.mediaite.com/media/entertainment/trump-push-gets-rush-hour-4-greenlit-by-close-ally-at-paramount-report-says/",
    "timestamp": "2025-11-25T21:26:46Z"
  },
  {
    "title": "2026 World Cup draw can separate top-ranked Spain, Argentina, France and England until semifinals",
    "description": "The 2026 World Cup draw next week will reward the four highest-ranked teams — Spain, Argentina, France and England — who will be placed in separate sections of a new tennis-style seeded tournament bracket. FIFA said Tuesday the top four teams in the latest me…",
    "link": "https://japantoday.com/category/sports/2026-world-cup-draw-can-separate-top-ranked-spain-argentina-france-and-england-until-semifinals",
    "timestamp": "2025-11-25T21:26:22Z"
  },
  {
    "title": "Neither of Sudan's warring factions has accepted truce plan, Trump advisor says",
    "description": "The United States has presented Sudan's warring parties with a proposal for a truce but neither side has formally accepted it, U.S. envoy Massad Boulos said on Tuesday, as the army accused its rivals of staging an attack despite declaring a ceasefire. Boulos …",
    "link": "https://japantoday.com/category/world/neither-of-sudan%27s-warring-factions-has-accepted-truce-plan-trump-advisor-says1",
    "timestamp": "2025-11-25T21:26:10Z"
  },
  {
    "title": "Trump EPA moves to abandon rule that sets soot pollution standards",
    "description": "The Trump administration is seeking to abandon a rule that sets tough standards for deadly soot pollution, arguing that the Biden administration did not have the authority to set the tighter standard.",
    "link": "https://www.wgal.com/article/trump-epa-soot-pollution-standard/69546664",
    "timestamp": "2025-11-25T21:25:58Z"
  },
  {
    "title": "X’s new feature raises questions about the foreign origins of some popular US political accounts",
    "description": "They go by names like @TRUMP_ARMY— or @MAGANationX, and their verified accounts proudly display portraits of President Donald Trump, voter rallies and American flags. And they’re constantly posting about U.S. politics to their followers, sounding like diehard…",
    "link": "https://biztoc.com/x/c7085a04acea184d",
    "timestamp": "2025-11-25T21:25:41Z"
  },
  {
    "title": "Brazil's former President Bolsonaro begins 27-year prison sentence for coup attempt",
    "description": "Former Brazilian President Jair Bolsonaro started on Tuesday to serve his 27-year prison sentence for leading a coup attempt designed to keep him in office after losing the 2022 presidential elections, a move that many in the South American nation doubted wou…",
    "link": "https://japantoday.com/category/world/brazil%27s-former-president-jair-bolsonaro-begins-27-year-prison-sentence-for-coup-attempt",
    "timestamp": "2025-11-25T21:25:40Z"
  },
  {
    "title": "Talking turkey: Trump turns pardon ritual into political roast",
    "description": "Donald Trump turned Washington's fluffiest tradition into something a little tougher to carve on Tuesday -- swapping holiday cheer for political score-settling as he pardoned two turkeys in the annual White House Thanksgiving ceremony. Since Abraham Lincoln's…",
    "link": "https://japantoday.com/category/world/talking-turkey-trump-turns-pardon-ritual-into-political-roast",
    "timestamp": "2025-11-25T21:25:27Z"
  },
  {
    "title": "Zelenskyy says Ukraine ready to advance peace plan, will discuss disputed points with Trump",
    "description": "President Volodymyr Zelenskyy said on Tuesday Ukraine was ready to advance a U.S.-backed framework for ending the war with Russia and discuss disputed points with U.S. President Donald Trump in talks he said should include European allies. U.S. and Ukrainian …",
    "link": "https://japantoday.com/category/world/zelenskiy-says-ukraine-ready-to-advance-peace-plan-will-discuss-disputed-points-with-trump2",
    "timestamp": "2025-11-25T21:25:18Z"
  },
  {
    "title": "Democratic congressman's lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "A federal lawsuit filed Tuesday by U.S. Rep. Eric Swalwell accuses the Trump administration’s top housing regulator of abusing his position to misuse private...",
    "link": "https://www.yahoo.com/news/articles/democratic-congressmans-lawsuit-claims-trump-212448001.html",
    "timestamp": "2025-11-25T21:24:48Z"
  },
  {
    "title": "Bitcoin wavers under $88K as traders brace for $14B BTC options expiry",
    "description": "Traders take a wait-and-see approach as $14 billion in Bitcoin options are set to expire on Friday. Will the expiry result in the $90,000 cap on BTC price being lifted?",
    "link": "https://cointelegraph.com/news/bitcoin-wavers-under-dollar88k-as-dollar14b-btc-options-expiry-draws-near",
    "timestamp": "2025-11-25T21:24:07Z"
  },
  {
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto",
    "description": "Acting CFTC chair Caroline Pham’s proposed “CEO Innovation Council” could extend beyond her time at the financial regulator if the Senate votes on Michael Selig soon.",
    "link": "https://cointelegraph.com/news/cftc-ceos-crypto-adviser-council",
    "timestamp": "2025-11-25T21:23:40Z"
  },
  {
    "title": "Trump says Biden turkey pardons were “totally invalid” at annual pre-Thanksgiving ceremony",
    "description": "The president said Biden's pardons of the turkeys were \"void\" due to the use of an autopen.",
    "link": "https://www.salon.com/2025/11/25/trump-says-biden-turkey-pardons-were-totally-invalid-at-annual-pre-thanksgiving-ceremony/",
    "timestamp": "2025-11-25T21:22:24Z"
  },
  {
    "title": "Fox News Politics Newsletter: Former Army captain warns Dems’ ‘unpatriotic’ video could spark chaos",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-former-army-captain-warns-dems-unpatriotic-video-could-spark-chaos",
    "timestamp": "2025-11-25T21:21:48Z"
  },
  {
    "title": "Trump calls Chicago ‘out of control’ after train attack left woman critically burned",
    "description": "President Donald Trump blasted so-called \"liberal judges\" after a woman was set on fire allegedly by a repeat offender. He is also demanding troop deployment.",
    "link": "https://www.foxnews.com/politics/trump-calls-chicago-out-control-after-train-attack-left-woman-critically-burned",
    "timestamp": "2025-11-25T21:21:15Z"
  },
  {
    "title": "Michelle Obama Says She Felt 'Confused' by the East Wing’s Demolition",
    "description": "Former First Lady Michelle Obama has struggled to understand the decision to demolish the East Wing of the White House, where she and other first ladies before her took office. “It’s not about me. It’s about us and our traditions and what they stand for,” Oba…",
    "link": "https://www.usmagazine.com/celebrity-news/news/michelle-obama-says-she-felt-confused-by-east-wing-demolition/#article",
    "timestamp": "2025-11-25T21:19:03Z"
  },
  {
    "title": "Trump takes 6-day vacation to Mar-a-Lago while Americans struggle with skyrocketing prices",
    "description": "President Donald Trump is heading to his Florida estate on Tuesday to get a jump on the Thanksgiving holiday. The president and First Lady will be staying at Mar-a-Lago for an extended break, returning to the White House early Sunday evening.As the First Fami…",
    "link": "https://www.rawstory.com/alternet-posts/trump-vacation-high-prices/",
    "timestamp": "2025-11-25T21:18:56Z"
  },
  {
    "title": "Why is Black female unemployment soaring? Experts gather in Boston to discuss 7.5% unemployment rate",
    "description": "“Black women are at the center of the Venn diagram that is our society,” said Anna Gifty Opoku-Agyeman, a PhD candidate at the Harvard Kennedy School.",
    "link": "https://fortune.com/2025/11/25/why-is-black-female-unemployment-so-high-7-5-percent/",
    "timestamp": "2025-11-25T21:15:55Z"
  },
  {
    "title": "Can Europe save frozen Russian assets from Donald Trump?",
    "description": "After Trump's Ukraine peace proposal called for using frozen Russian assets to benefit the US, Europeans say only they can decide what to do with assets located in Europe. Experts say to move fast on a loan to Ukraine. Europeans are seething over US President…",
    "link": "https://www.dw.com/en/can-europe-save-frozen-russian-assets-from-donald-trump/a-74885380",
    "timestamp": "2025-11-25T21:15:00Z"
  },
  {
    "title": "MAGA Demands Bondi’s Head After Failed Comey Indictment",
    "description": "MAGA is furious at U.S. Attorney Pam Bondi and the Department of Justice over the entirely “avoidable” botched indictments of President Donald Trump’s political enemies. A federal judge on Monday dropped the criminal indictments against former FBI Director Ja…",
    "link": "https://newrepublic.com/post/203686/maga-pam-bondi-failed-comey-indictment",
    "timestamp": "2025-11-25T21:14:43Z"
  },
  {
    "title": "Trump pardons turkeys at White House while joking they should be named Chuck and Nancy: ‘I would never pardon those people’",
    "description": "President Donald Trump didn’t bring much holiday cheer Tuesday when bestowing ceremonial pardons on two Thanksgiving turkeys, dispensing more insults than goodwill at the traditional White House ritual.\nHe joked about sending the turkeys to an infamous prison…",
    "link": "https://biztoc.com/x/cad7d82c0af11e4b",
    "timestamp": "2025-11-25T21:14:37Z"
  },
  {
    "title": "Brazil's ex-president Jair Bolsonaro begins 27-year prison sentence",
    "description": "Former Brazilian president Jair Bolsonaro began a 27-year prison sentence on Tuesday for leading a coup attempt after losing the 2022 presidential election.",
    "link": "https://news.sky.com/story/brazils-ex-president-jair-bolsonaro-begins-27-year-prison-sentence-for-coup-attempt-13475415",
    "timestamp": "2025-11-25T21:13:00Z"
  },
  {
    "title": "Trump EPA moves to abandon rule that sets soot pollution standards",
    "description": "The Trump administration is seeking to abandon a rule that sets tough standards for deadly soot pollution, arguing that the Biden administration did not have the authority to set the tighter standard.",
    "link": "https://www.wlky.com/article/trump-epa-soot-pollution-standard/69546664",
    "timestamp": "2025-11-25T21:13:00Z"
  },
  {
    "title": "Martha Stewart becomes latest face of American Eagle after Sydney Sweeney jeans controversy",
    "description": "Stewart partnered with the jeans brand in honor of the holiday season",
    "link": "https://www.the-independent.com/life-style/martha-stewart-american-eagle-campaign-b2872467.html",
    "timestamp": "2025-11-25T21:11:12Z"
  },
  {
    "title": "'Rush Hour' Movie Reportedly Confirmed After Trump Push",
    "description": "The revival will star its original cast, Jackie Chan and Chris Tucker.",
    "link": "https://www.huffpost.com/entry/rush-hour-movie-reported-revival_n_6925eb59e4b063285310e444",
    "timestamp": "2025-11-25T21:11:10Z"
  },
  {
    "title": "Japan’s New Prime Minister Is Already Facing Her First Crisis",
    "description": "Sanae Takaichi may be relishing confrontation with China.",
    "link": "http://foreignpolicy.com/2025/11/25/sanae-takaichi-china-japan-taiwan/",
    "timestamp": "2025-11-25T21:09:40Z"
  },
  {
    "title": "Cook County law enforcement agencies get more money in 2026",
    "description": "In early October, a coalition of 68 organizations representing policy advocates, faith leaders, and social service providers sent a letter to the Cook County Board of Commissioners. As the 2026 budgeting process got underway, they wanted lawmakers to freeze s…",
    "link": "http://chicagoreader.com/news/politics/cook-county-budget-2026/",
    "timestamp": "2025-11-25T21:09:04Z"
  },
  {
    "title": "White House denies Trump weighing ousting FBI's Patel",
    "description": "The White House has denied that US President Donald Trump was considering removing Kash Patel as director of the FBI.",
    "link": "https://www.rte.ie/news/world/2025/1125/1545842-trump-patel-us/",
    "timestamp": "2025-11-25T21:08:09Z"
  },
  {
    "title": "Government shutdown sends consumer confidence plunging to April ‘liberation day’ levels",
    "description": "The figures from the Conference Board suggest Americans are increasingly wary of high costs and sluggish job gains, with labor market perception worsening.",
    "link": "https://fortune.com/2025/11/25/government-shutdown-sends-consumer-confidence-plunging-to-april-liberation-day-levels/",
    "timestamp": "2025-11-25T21:07:20Z"
  },
  {
    "title": "Exclusive: War Dept. Battles Internal Resistance To Reinstate 86 Soldiers Ejected By Covid Shot Mandate",
    "description": "'I tasked in no uncertain terms to the services that they will treat each of the members with the dignity that they deserve,' War Undersecretary Anthony Tata told The Federalist.",
    "link": "https://thefederalist.com/2025/11/25/exclusive-war-dept-battles-internal-resistance-to-reinstate-86-soldiers-ejected-by-covid-shot-mandate/",
    "timestamp": "2025-11-25T21:07:16Z"
  },
  {
    "title": "David Sacks tried to kill state AI laws — and it blew up in his face",
    "description": "On Wednesday, a rumor began popping up in Washington about a momentous policy change: the White House, it was said, would issue an executive order on Friday that would finally preempt state AI laws, handing over those regulatory powers to the federal governme…",
    "link": "https://www.theverge.com/ai-artificial-intelligence/829179/david-sacks-ai-executive-order",
    "timestamp": "2025-11-25T21:06:08Z"
  },
  {
    "title": "Liberal 'View' co-host agrees with Trump transportation sec on call to dress better while traveling",
    "description": "\"The View\" co-host Ana Navarro agreed with President Donald Trump's transportation secretary on airline dress codes and civility during travel during the show on Tuesday.",
    "link": "https://www.foxnews.com/media/liberal-view-co-host-agrees-trump-transportation-sec-call-dress-better-while-traveling",
    "timestamp": "2025-11-25T21:04:19Z"
  },
  {
    "title": "These Crypto Giants Sent Trump Money. His Administration Let Them Off Easy",
    "description": "It took more than fame for Donald Trump and his sons to build a crypto empire. They got a lot of help from industry insiders, many of whom happened to need a hand from the president.\nShortly after Donald Trump pardoned crypto’s richest man, Changpeng Zhao, th…",
    "link": "https://biztoc.com/x/b8c3d23e42106f91",
    "timestamp": "2025-11-25T21:03:38Z"
  },
  {
    "title": "Trump pardons turkeys at White House while joking they should be named Chuck and Nancy: ‘I would never pardon those people’",
    "description": "Trump also claimed that last year's turkey pardons, issued by President Joe Biden, were invalid because he used an autopen, adding: “Where's Hunter?”",
    "link": "https://fortune.com/2025/11/25/trump-pardons-turkeys-chuck-nancy-biden-autopen-hunter-thanksgiving/",
    "timestamp": "2025-11-25T21:03:37Z"
  },
  {
    "title": "Elon Musk might have just accidentally revealed that a lot of MAGA influencers are based in South Asia, Africa and Eastern Europe",
    "description": "They go by names like @TRUMP_ARMY— or @MAGANationX, and their verified accounts proudly display portraits of President Donald Trump, voter rallies and American flags. And they’re constantly posting about U.S. politics to their followers, sounding like diehard…",
    "link": "https://biztoc.com/x/d03c71f620bef12a",
    "timestamp": "2025-11-25T21:03:26Z"
  },
  {
    "title": "House Republican Rips Trump’s ‘Reprehensible’ Comments on Russia, Calls For Congress to Lead on Ukraine Talks",
    "description": "\"The Thursday 28-point surrender plan was disgusting. We don’t want to see Trump and Neville Chamberlain always mentioned in the same breath.”\nThe post House Republican Rips Trump’s ‘Reprehensible’ Comments on Russia, Calls For Congress to Lead on Ukraine Tal…",
    "link": "https://www.mediaite.com/politics/house-republican-rips-trumps-reprehensible-comments-on-russia-calls-for-congress-to-lead-on-ukraine-talks/",
    "timestamp": "2025-11-25T21:02:11Z"
  },
  {
    "title": "Victor Davis Hanson Breaks Out Jasmine Crockett Impression While Roasting Her Over Flub",
    "description": "Victor Davis Hanson imitated Jasmine Crockett while mocking her for a claim she made about a redaction in a document tied to Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/11/25/victor-davis-hanson-jasmine-crockett-impression/",
    "timestamp": "2025-11-25T21:00:59Z"
  },
  {
    "title": "Sen. Gallego Unleashes Profanity-Laced Rant Over Potential Court-Martial of Sen. Kelly",
    "description": "\"This is f***ing insane. We should all point out how f***ing insane this is.\"\nThe post Sen. Gallego Unleashes Profanity-Laced Rant Over Potential Court-Martial of Sen. Kelly first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/gallego-unleashes-profanity-laced-rant-over-potential-court-martial-of-kelly/",
    "timestamp": "2025-11-25T21:00:32Z"
  },
  {
    "title": "Azerbaijan’s Entry Turns Central Asia’s C5 Into a Geopolitical Heavyweight",
    "description": "On 16 November 2025, at the Seventh Consultative Meeting of the Heads of State of Central Asia, the presidents of the “C5,” the Central Asia republics of Kazakhstan, the Kyrgyz Republic, Tajikistan, Turkmenistan, and Uzbekistan, announced the Republic of Azer…",
    "link": "https://oilprice.com/Geopolitics/Asia/Azerbaijans-Entry-Turns-Central-Asias-C5-Into-a-Geopolitical-Heavyweight.html",
    "timestamp": "2025-11-25T21:00:00Z"
  },
  {
    "title": "'Disappointment and irritation': Saudi crown prince slaps down Trump over Israel strategy",
    "description": "President Donald Trump and Saudi Crown Prince Mohammed bin Salman (MBS) had a tense disagreement behind closed doors last week over Saudi Arabia's relationship with Israel and the president's desire for the country to join the Abraham Accords. Trump had asked…",
    "link": "https://www.rawstory.com/mohammed-bin-salman-donald-trump-2674341957/",
    "timestamp": "2025-11-25T20:59:11Z"
  },
  {
    "title": "Oil Closes the Day Near Month Low",
    "description": "Crude settled sharply lower as signs of Ukraine-Russia peace progress raised expectations for continued Russian supply.",
    "link": "https://www.rigzone.com/news/wire/oil_closes_the_day_near_month_low-25-nov-2025-182389-article/",
    "timestamp": "2025-11-25T20:58:29Z"
  },
  {
    "title": "FBI seeks interviews with six Democrats Trump accused of 'seditious behavior'",
    "description": "WASHINGTON — The FBI is working to schedule interviews with the six Democratic lawmakers who appeared in a video urging members of the military and intelligence community not to comply with illegal orders, according to a person familiar with the efforts",
    "link": "https://www.nbcnews.com/politics/justice-department/fbi-seeks-interviews-six-democrats-trump-accused-seditious-behavior-rcna245880",
    "timestamp": "2025-11-25T20:58:13Z"
  },
  {
    "title": "Elon Musk might have just accidentally revealed that a lot of MAGA influencers are based in South Asia, Africa and Eastern Europe",
    "description": "Elon Musk’s X unveiled a feature Saturday that lets users see where an account is based. Oops.",
    "link": "https://fortune.com/2025/11/25/elon-musk-x-maga-supporters-influencers-overseas-locations/",
    "timestamp": "2025-11-25T20:57:56Z"
  },
  {
    "title": "As Trailer Drops For 50 Cent's Netflix Doc About Diddy Controversies, Fans Cannot Believe It Actually Exists",
    "description": "It seems some people thought he was kidding.",
    "link": "https://www.cinemablend.com/streaming-news/trailer-drops-for-50-cent-netflix-doc-diddy-controversies-fans-cant-believe-it-exists",
    "timestamp": "2025-11-25T20:53:03Z"
  },
  {
    "title": "Trump takes awkward photo with FBI Director to push back on 'totally false' report",
    "description": "President Donald Trump insisted that claims that he had considered firing FBI Director Kash Patel were \"totally false.\"Multiple sources told MS NOW that the president was considering removing Patel as soon as December, according to a report on Tuesday. In a p…",
    "link": "https://www.rawstory.com/trump-denies-patel-firing/",
    "timestamp": "2025-11-25T20:51:14Z"
  },
  {
    "title": "EU can no longer consider US an ally – ex-bloc foreign policy chief",
    "description": "The EU can no longer consider the US an ally after being sidelined on the Ukraine peace plan, ex-foreign policy chief, Josep Borrell, said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628415-borrell-us-eu-ally-ukraine/",
    "timestamp": "2025-11-25T20:51:11Z"
  },
  {
    "title": "A look at previous failed pipeline projects in Canada",
    "description": "CALGARY — Alberta’s push for a new oil pipeline has been dredging up the ghosts of projects past. Here is a look at what happened with three ill-fated projects: KEYSTONE XL First proposed in 2008, TransCanada Corp.’s Keystone XL extension would have expanded …",
    "link": "https://financialpost.com/pmn/a-look-at-previous-failed-pipeline-projects-in-canada",
    "timestamp": "2025-11-25T20:49:29Z"
  },
  {
    "title": "Leavitt Says “All” Military Orders by Trump Must Be “Presumed to Be Legal”",
    "description": "The dubious claim comes despite officials within the administration saying that the boat strike operation is unlawful.",
    "link": "https://truthout.org/articles/leavitt-says-all-military-orders-by-trump-must-be-presumed-to-be-legal/",
    "timestamp": "2025-11-25T20:48:40Z"
  },
  {
    "title": "Jair Bolsonaro ordered to start 27-year prison sentence for plotting coup in Brazil",
    "description": "Plot to assassinate his successor, Lula, and his running mate, failed when military chiefs refused to take part",
    "link": "https://www.irishtimes.com/world/americas/2025/11/25/jair-bolsonaro-ordered-to-start-27-year-prison-sentence-for-plotting-coup-in-brazil/",
    "timestamp": "2025-11-25T20:47:00Z"
  },
  {
    "title": "Conservative reveals how GOP may abandon Trump if they lose big in the midterms",
    "description": "Even though President Donald Trump has thoroughly dominated the Republican Party since his 2016 election victory, the GOP may finally walk away from him if they suffer major losses in next year's midterm elections.That's according to conservative columnist Jo…",
    "link": "https://www.rawstory.com/alternet-posts/conservative-gop-abandon-trump/",
    "timestamp": "2025-11-25T20:46:58Z"
  },
  {
    "title": "Trump Is a ‘Pathetic’ Loser After ‘Political Surrender’ of Mamdani Meeting, Lawrence O’Donnell Says | Video",
    "description": "\"Trump desperately needed to do something to change the tone. And the next person in the door was the person he called a communist lunatic,\" the \"Last Word\" host says\nThe post Trump Is a ‘Pathetic’ Loser After ‘Political Surrender’ of Mamdani Meeting, Lawrenc…",
    "link": "https://www.thewrap.com/lawrence-odonnell-shreds-donald-trump-zohran-mamdani-meeting/",
    "timestamp": "2025-11-25T20:44:57Z"
  },
  {
    "title": "X’s new feature raises questions about the foreign origins of some popular US political accounts",
    "description": "Elon Musk’s X unveiled a feature that lets users see where an account is based.",
    "link": "https://www.bostonherald.com/2025/11/25/x-political-accounts/",
    "timestamp": "2025-11-25T20:42:21Z"
  },
  {
    "title": "X’s new feature raises questions about the foreign origins of some popular US political accounts",
    "description": "Elon Musk’s X unveiled a feature that lets users see where an account is based.",
    "link": "https://www.denverpost.com/2025/11/25/x-political-accounts/",
    "timestamp": "2025-11-25T20:42:21Z"
  },
  {
    "title": "Director James Cameron says he can still work with Elon Musk despite political differences",
    "description": "Director James Cameron said in a new interview that he could continue to work with Elon Musk on shared priorities despite their political differences.",
    "link": "https://www.foxnews.com/media/director-james-cameron-says-he-can-still-work-elon-musk-despite-political-differences",
    "timestamp": "2025-11-25T20:41:25Z"
  },
  {
    "title": "Trump, MbS meeting said to have escalated over Israel",
    "description": "The meeting between United States President Donald Trump and Saudi Crown Prince Mohammed bin Salman (MbS), held last week at the White House, became tense when they addressed the normalization of rela...",
    "link": "https://biztoc.com/x/4007a4bf645ad1b9",
    "timestamp": "2025-11-25T20:41:01Z"
  },
  {
    "title": "On Canada and tariffs, watch what Trump does, not what he says",
    "description": "In late October, months of trade talks between the United States and Canada came to an abrupt halt for the dumbest of reasons: Officials in a Canadian province aired a television ad that hurt Donald Trump’s feelings.\nThe commercial wasn’t especially provocati…",
    "link": "https://biztoc.com/x/e4b8da35cbee94ba",
    "timestamp": "2025-11-25T20:40:59Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/news-fix-472-6885634-Nov2025/",
    "timestamp": "2025-11-25T20:40:23Z"
  },
  {
    "title": "Bowser ends decade-long reign as DC mayor after 3 terms in office, won't seek fourth",
    "description": "Washington, D.C. Mayor Muriel Bowser announced she won't seek a fourth term, ending her decade-long leadership of nation's capital ahead of 2026 election.",
    "link": "https://www.foxnews.com/politics/bowser-ends-decade-long-reign-dc-mayor-after-3-terms-office-wont-seek-fourth",
    "timestamp": "2025-11-25T20:39:34Z"
  },
  {
    "title": "Trump touts 'tremendous progress' but says he'll meet Putin and Zelenskyy 'ONLY when' peace deal is final",
    "description": "President Trump reports tremendous progress on Russia-Ukraine peace talks, with diplomats saying negotiations are closest to agreement since war began.",
    "link": "https://www.foxnews.com/world/trump-touts-tremendous-progress-says-hell-meet-putin-zelenskyy-only-when-peace-deal-final",
    "timestamp": "2025-11-25T20:39:13Z"
  },
  {
    "title": "US Under Trump Can No Longer Be Considered EU Ally — Borrell",
    "description": "According to the former head of European diplomacy, the EU should recognize the shift in American policy and respond accordinglyBRUSSELS, November 25. /TASS/. Europe can no longer consider the United States an ally after American President Donald Trump put fo…",
    "link": "https://freerepublic.com/focus/f-news/4354594/posts",
    "timestamp": "2025-11-25T20:38:26Z"
  },
  {
    "title": "After a 40-year hiatus, the Communist Party USA is back on the ballot — and already has three people in office",
    "description": "It’s the red dawn of a new day. After a four-decade-long break, the Communist Party USA has picked up the hammer and sickle to resume the glorious struggle of electoral politics — and they’re already seeing success. Three candidates the CPUSA ran in the Nov. …",
    "link": "https://nypost.com/2025/11/25/us-news/communist-party-wins-big-in-local-elections-after-40-year-break/",
    "timestamp": "2025-11-25T20:37:15Z"
  },
  {
    "title": "'Miserable' House Republicans tell ex-colleague of 'toxic' work conditions under Trump",
    "description": "An ex-GOP lawmaker came clean on what it's like to work for \"toxic\" President Donald Trump — and what he believes is happening behind the scenes among Republicans. Former Rep. David Trott (R-MI), in an opinion piece published in The Daily Beast on Tuesday, wr…",
    "link": "https://www.rawstory.com/donald-trump-republicans-miserable/",
    "timestamp": "2025-11-25T20:36:45Z"
  },
  {
    "title": "Former Brazilian president Jair Bolsonaro begins serving 27-year prison sentence",
    "description": "Brazil's Supreme Court on  Tuesday ordered former president Jair Bolsonaro to begin a  prison sentence of more than 27 years for plotting a coup in 2022, according to a court document.",
    "link": "https://www.cbc.ca/news/world/bolsonaro-27-year-sentence-9.6992044",
    "timestamp": "2025-11-25T20:35:57Z"
  },
  {
    "title": "CNN Has Awkward On-Air Hiccup Thanks To Trump — And Their Guest’s Face Says it All",
    "description": "A Yale University professor didn’t need to say a single word after the White House postponed a big announcement at the last second.",
    "link": "https://www.huffpost.com/entry/cnn-has-awkward-on-air-moment-while-talking-about-trump-and-their-guests-face-says-it-all_n_6925e775e4b05f521ddad4d9",
    "timestamp": "2025-11-25T20:33:18Z"
  },
  {
    "title": "Political consultant defies court order in lawsuit over AI robocalls that mimicked Biden",
    "description": "He said he won't pay $22,500 to three voters despite a recent federal court order.",
    "link": "https://www.bostonherald.com/2025/11/25/election-2024-ai-robocalls-biden/",
    "timestamp": "2025-11-25T20:30:43Z"
  },
  {
    "title": "Republicans try to quash concerns of more exits following Marjorie Taylor Greene's surprise resignation",
    "description": "House Republicans sought to quash concerns that there could be more resignations in the wake of Rep. Majorie Taylor Greene's, R-Ga., plans to exit early next year.",
    "link": "https://www.foxnews.com/politics/republicans-try-quash-concerns-more-exits-following-marjorie-taylor-greenes-surprise-resignation",
    "timestamp": "2025-11-25T20:30:06Z"
  },
  {
    "title": "Bolsonaro ordered to begin serving 27-year prison sentence for attempted coup | CNN",
    "description": "Brazil’s former President Jair Bolsonaro must begin serving his 27-year prison sentence for plotting an attempted coup, Supreme Court Justice Alexandre de Moraes ruled Tuesday.",
    "link": "https://www.cnn.com/2025/11/25/americas/brazil-bolsonaro-begins-prison-sentence-latam-intl",
    "timestamp": "2025-11-25T20:29:26Z"
  },
  {
    "title": "DC Mayor Muriel Bowser Passes On Run For 4th Term",
    "description": "Democratic Washington D.C. Mayor Muriel Bowser will not run for a fourth term after overseeing the nation’s capital for over a decade, the Washington Post first reported Tuesday afternoon. Bowser, 53, told the outlet the previous night she determined it was t…",
    "link": "https://dailycaller.com/2025/11/25/muriel-bowser-washington-dc-crime-reelection/",
    "timestamp": "2025-11-25T20:27:38Z"
  },
  {
    "title": "Brazil’s Bolsonaro begins 27-year jail term for coup bid",
    "description": "Brazil’s Supreme Court on Tuesday ordered far-right former president Jair Bolsonaro to begin serving a 27-year sentence for plotting a failed coup, after he exhausted all appeals. The brash former army captain who fired up Brazil’s right and reshaped the coun…",
    "link": "https://www.digitaljournal.com/world/brazils-bolsonaro-begins-27-year-jail-term-for-coup-bid/article",
    "timestamp": "2025-11-25T20:27:20Z"
  },
  {
    "title": "International funding cuts disrupted global response to HIV, UN report says",
    "description": "UNAIDS says millions across the world lost access to treatment and preventive care due to financial shortfalls.",
    "link": "https://www.aljazeera.com/news/2025/11/25/international-funding-cuts-disrupted-global-response-to-hiv-un-report-says",
    "timestamp": "2025-11-25T20:26:16Z"
  },
  {
    "title": "Carney says he made a mistake by dismissing Trump questions with 'who cares?'",
    "description": "Prime Minister Mark Carney said Tuesday he should not have been dismissive of reporters' questions about speaking to U.S. President Donald Trump, conceding he used \"a poor choice of words.\"",
    "link": "https://www.cbc.ca/news/politics/carney-mistake-who-cares-9.6992050",
    "timestamp": "2025-11-25T20:25:59Z"
  },
  {
    "title": "Witkoff Advised Russia on How to Pitch Ukraine Plan to Trump (Flavia Krause-Jackson/Bloomberg)",
    "description": "Flavia Krause-Jackson / Bloomberg:\nWitkoff Advised Russia on How to Pitch Ukraine Plan to Trump  —  US presidential envoy Steve Witkoff, fresh from the triumph of the Gaza peace deal, held a phone call last month with a senior Kremlin official to suggest they…",
    "link": "https://www.memeorandum.com/251125/p101",
    "timestamp": "2025-11-25T20:25:04Z"
  },
  {
    "title": "‘Dr. Doom’ Nouriel Roubini breaks with the crowd on the AI bubble, saying the U.S. is headed for a ‘growth recession’ and not a market crash",
    "description": "“The now common view,” according to the NYU Stern School of Business professor emeritus, “is incorrect over the medium term.”",
    "link": "https://fortune.com/2025/11/25/dr-doom-nouriel-roubini-says-no-ai-bubble-growth-recession-american-exceptionalism/",
    "timestamp": "2025-11-25T20:24:57Z"
  },
  {
    "title": "Brazil’s Supreme Court orders Jair Bolsonaro to begin prison sentence",
    "description": "The ex-president was sentenced to more than 27 years in prison for trying to foment a coup after his election loss.",
    "link": "https://www.aljazeera.com/news/2025/11/25/brazils-supreme-court-orders-jair-bolsonaro-to-begin-prison-sentence",
    "timestamp": "2025-11-25T20:24:20Z"
  },
  {
    "title": "Republicans can’t wuss out like Marjorie Taylor Greene — knuckle down and GOVERN",
    "description": "Unhappy Republicans in Congress must heed Trump's most important lesson — and write their own destiny instead of echoing politics past.",
    "link": "https://nypost.com/2025/11/25/opinion/republicans-cant-wuss-out-like-mtg-knuckle-down-and-govern/",
    "timestamp": "2025-11-25T20:22:36Z"
  },
  {
    "title": "The Most Humiliating Failure of the New Trump Administration Has Come to a Sad, Fitting Close",
    "description": "It failed at every one of its stated goals while still managing to do tremendous damage to millions of people.",
    "link": "https://slate.com/news-and-politics/2025/11/elon-musk-doge-dead-trump.html",
    "timestamp": "2025-11-25T20:20:43Z"
  },
  {
    "title": "Gaza Economy at 13 Percent of Pre-Genocide Level, With Worst Collapse on Record",
    "description": "“Multidimensional poverty now engulfs all Gazans,” one UN official said.",
    "link": "https://truthout.org/articles/gaza-economy-at-13-percent-of-pre-genocide-level-with-worst-collapse-on-record/",
    "timestamp": "2025-11-25T20:20:41Z"
  },
  {
    "title": "Karoline Leavitt Says Trump ‘Laughed’ At ‘Fake News’ Report on Firing Kash Patel",
    "description": "President Trump \"laughed\" at a \"totally false\" report he was considering firing FBI Director Kash Patel, White House Press Secretary Karoline Leavitt said\nThe post Karoline Leavitt Says Trump ‘Laughed’ At ‘Fake News’ Report on Firing Kash Patel first appeared…",
    "link": "https://www.mediaite.com/politics/karoline-leavitt-says-trump-laughed-at-fake-news-report-on-firing-kash-patel/",
    "timestamp": "2025-11-25T20:20:30Z"
  },
  {
    "title": "Americans are really concerned about democracy",
    "description": "\"Americans share deep concern for our democracy, but we do not all have the same reasons.\"",
    "link": "https://www.futurity.org/americans-democracy-concerns-3307522/",
    "timestamp": "2025-11-25T20:20:29Z"
  },
  {
    "title": "The Trump administration’s plans to dismantle the Department of Education",
    "description": "As the Trump administration sets its plans in motion to reallocate the responsibilities of the Education Department, the initial steps are illuminating how President Donald Trump could fulfill his campaign pledge to bulldoze the department entirely. Education…",
    "link": "https://biztoc.com/x/ea8add25db9c2493",
    "timestamp": "2025-11-25T20:19:00Z"
  },
  {
    "title": "WH slams story of Trump firing Patel as 'made up'",
    "description": "White House Press Secretary Karoline Leavitt dismissed in post on X on Tuesday the report that United States President Donald Trump was considering firing Federal Bureau of Investigation (FBI) Directo...",
    "link": "https://biztoc.com/x/193d653cf97ddf04",
    "timestamp": "2025-11-25T20:18:56Z"
  },
  {
    "title": "Senator Mark Kelly Is in the Wrong Job",
    "description": "He should be secretary of defense.",
    "link": "https://www.theatlantic.com/ideas/2025/11/mark-kelly-military-trump/685065/",
    "timestamp": "2025-11-25T20:17:25Z"
  },
  {
    "title": "Soaring Medicare Part B Premium Takes Big Bite Out of Social Security Increase",
    "description": "With much of the nation's focus on skyrocketing Affordable Care Act costs, the Trump administration recently announced a Medicare Part B premium increase of nearly 10% for next year—an amount that will swallow a significant chunk of Social Security recipients…",
    "link": "https://www.commondreams.org/news/medicare-part-b-premiums",
    "timestamp": "2025-11-25T20:17:05Z"
  },
  {
    "title": "New Russian fighter destroys ‘Patriots’ days after delivery from Germany",
    "description": "In the unforgiving battlefields of the NATO-orchestrated Ukrainian conflict, the Kiev regime is yet to learn that any perceived superiority complex is nothing but that – a set of dangerous delusions that may seem “real” (or even “crystal clear”, “natural”, et…",
    "link": "https://www.globalresearch.ca/new-russian-fighter-destroys-patriots-days-after-delivery-from-germany/5906898",
    "timestamp": "2025-11-25T20:15:45Z"
  },
  {
    "title": "The GOP Planned Its Midterm Strategy Around Mamdani. Then He Met With Trump.",
    "description": "Prior to Trump’s meeting, Republicans had actually strategized around making Mamdani—and his Muslim background—a serious political target going forward.",
    "link": "https://slate.com/news-and-politics/2025/11/gop-midterm-strategy-mamdani-trump-meeting-islamophobia.html",
    "timestamp": "2025-11-25T20:15:30Z"
  },
  {
    "title": "‘These People Who Hate America’: Trump Demands New Gerrymander in Off-the-Rails Marathon Rant",
    "description": "President Donald Trump demanded that Indiana Republicans commit to a mid-decade gerrymandering effort in a wild Truth Social tirade.\nThe post ‘These People Who Hate America’: Trump Demands New Gerrymander in Off-the-Rails Marathon Rant first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/these-people-who-hate-america-trump-demands-new-gerrymander-in-off-the-rails-marathon-rant/",
    "timestamp": "2025-11-25T20:14:33Z"
  }
]