[
  {
    "title": "Sharad Pawar suggests all-party meet instead of special Parliament session amid growing opposition demand",
    "description": "Amid opposition calls for a special Parliament session regarding the Pahalgam attack and Operation Sindoor, Sharad Pawar suggests an all-party meeting instead, cautioning against public debate on sensitive national security matters. He also addressed Donald T…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/sharad-pawar-suggests-all-party-meet-instead-of-special-parliament-session-amid-growing-opposition-demand/articleshow/121112196.cms",
    "timestamp": "2025-05-12T13:17:09Z"
  },
  {
    "title": "Trump Melts Down Over Damning Report on Qatar Giving Him a Private Jet",
    "description": "Donald Trump is trying desperately to defend receiving a $400 million luxury jet as a gift from Qatar.\r\nIn an angry post on Truth Social Sunday night, Trump claimed that he’d done nothing wrong by agreeing to take a Boeing 747-8 jumbo jet from the Qatari roya…",
    "link": "https://newrepublic.com/post/195113/donald-trump-damning-report-qatar-private-jet",
    "timestamp": "2025-05-12T13:16:55Z"
  },
  {
    "title": "Fight over Medicaid cuts heats up as House Republicans release bill",
    "description": "House Republicans released legislative text of a key portion of their party-line agenda bill that includes cuts and other changes to Medicaid, one of the most contentious issues they face in trying to advance President Donald Trump’s agenda in one sweeping pa…",
    "link": "https://www.nbcnews.com/politics/congress/fight-medicaid-cuts-heats-house-republicans-release-bill-rcna206210",
    "timestamp": "2025-05-12T13:16:38Z"
  },
  {
    "title": "Supreme Court Likely To Curtail Judges' Powers To Stop Trump: What To Know",
    "description": "Court will weigh in on injunctions after arguments on cases challenging president's attempt to restrict birthright citizenship.",
    "link": "https://www.newsweek.com/supreme-court-curtail-judges-powers-trump-2070841",
    "timestamp": "2025-05-12T13:16:24Z"
  },
  {
    "title": "Karoline Leavitt Defends Qatari Quid Pro Quo Allegations: Trump ‘Only Works With the Interests of the American Public in Mind’",
    "description": "Brian Kilmeade shared concerns with Karoline Leavitt over the appearance of a quid pro quo between the Qatari government and President Trump over a luxury jetliner gift.\nThe post Karoline Leavitt Defends Qatari Quid Pro Quo Allegations: Trump ‘Only Works With…",
    "link": "https://www.mediaite.com/tv/karoline-leavitt-defends-qatari-quid-pro-quo-allegations-trump-only-works-with-the-interests-of-the-american-public-in-mind/",
    "timestamp": "2025-05-12T13:15:57Z"
  },
  {
    "title": "Cannes 2025 lineup shines in the shadow of Trump tariffs",
    "description": "Wes Anderson, Diane Kruger, Spike Lee: These are just some big names featured at the world's most important film festival. But while celebrating cinema, attendees will also grapple with an uncertain future to come. The 78th edition of the Cannes Film Festival…",
    "link": "https://www.dw.com/en/cannes-2025-lineup-shines-in-the-shadow-of-trump-tariffs/a-72485869",
    "timestamp": "2025-05-12T13:14:00Z"
  },
  {
    "title": "Stock Market Today: Stocks soar as the U.S. and China agree tariff pause",
    "description": "A cooling of trade tensions between the world's two biggest economies has U.S. stocks set to soar in early Monday trading.",
    "link": "https://www.thestreet.com/investing/stock-market-today-stocks-soar-as-the-u-s-and-china-agree-tariff-pause",
    "timestamp": "2025-05-12T13:14:00Z"
  },
  {
    "title": "US-China Tariff Deal Resolves Uncertainty, Sends Stock Markets Soaring",
    "description": "Stock markets have positively responded to the news of the US-China tariff deal. The greatest positive effect leading to the rise may be the lower economic uncertainty.",
    "link": "https://www.forbes.com/sites/nathangoldman/2025/05/12/us-china-tariff-deal-resolves-uncertainty-sends-stock-markets-soaring/",
    "timestamp": "2025-05-12T13:12:51Z"
  },
  {
    "title": "Is a US-China Trade Agreement Really Possible?",
    "description": "The US and China trade deal is fragile, limited in scope, and likely still vulnerable to sabotage or collapse. Add to that the damage Donald Trump’s tariffs have already done to global supply chains, and businesses, consumers, and investors should brace for c…",
    "link": "https://www.project-syndicate.org/commentary/us-china-trade-deal-will-not-reverse-trump-tariff-damage-to-global-supply-chains-by-angela-huyue-zhang-and-s-alex-yang-2025-05",
    "timestamp": "2025-05-12T13:11:49Z"
  },
  {
    "title": "Edan Alexander to meet with Trump in Qatar after being released from captivity",
    "description": "If his health allows it and he is willing, American-Israeli hostage Edan Alexander will fly to Qatar to meet with President Donald Trump and the Emir of Qatar.",
    "link": "https://www.israelnationalnews.com/news/408230",
    "timestamp": "2025-05-12T13:09:51Z"
  },
  {
    "title": "‘I’m in good health’: Questions surround Fetterman’s fitness for office after report - NewsBreak",
    "description": "The allegations about Fetterman surfaced as Democrats broadly have faced criticism for sweeping concerns about members’ fitness for office under the rug.",
    "link": "https://www.newsbreak.com/share/4003737439476-i-m-in-good-health-questions-surround-fetterman-s-fitness-for-office-after-report?s=a2&share_destination_id=MjA0ODE3NzExLTE3NDcwNTUxNjk5MjM%3D&pd=0DrORT4B&hl=en_US&send_time=1747055169&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.18.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-control%2Cns_foryou_recall_exp_25q2-v5%2Cns_foryou_blend_exp_25q2-v9%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v2",
    "timestamp": "2025-05-12T13:09:28Z"
  },
  {
    "title": "Legal expert reveals why centuries-old law is crucial for Trump admin in immigration fight",
    "description": "A Republican attorney said that from her perspective, many federal judges are questioning the president’s ability to actually decide what is considered an alien enemy.",
    "link": "https://www.foxnews.com/politics/legal-expert-reveals-why-centuries-old-law-crucial-trump-admin-immigration-fight",
    "timestamp": "2025-05-12T13:09:09Z"
  },
  {
    "title": "Pharmaceutical industry criticizes the drug pricing plan Trump says he'll sign",
    "description": "President Donald Trump has signed a sweeping executive order setting a 30-day deadline for drugmakers to lower the cost of prescription drugs in the U.S. or face new limits over what the government will pay.",
    "link": "https://www.news4jax.com/business/2025/05/12/pharmaceutical-industry-criticizes-the-drug-pricing-plan-trump-says-hell-sign/",
    "timestamp": "2025-05-12T13:08:22Z"
  },
  {
    "title": "Eric Trump-backed American Bitcoin to go public through all-stock merger",
    "description": "In This Article:\nBy Ateev Bhandari\n(Reuters) -American Bitcoin, a new bitcoin miner backed by U.S. President Donald Trump's two eldest sons, said on Monday it will list on the Nasdaq via an all-stock merger with Gryphon Digital Mining.\nExisting shareholders o…",
    "link": "https://biztoc.com/x/a5b88c95277c3a67",
    "timestamp": "2025-05-12T13:06:46Z"
  },
  {
    "title": "Trump to sign order to cut some U.S. drug prices to match those abroad",
    "description": "President Donald Trump on Monday will revive a controversial policy that aims to slash drug costs by tying the amount the government pays for some medicines to lower prices abroad, White House officials said.\n\"For too long, foreign nations have been able to f…",
    "link": "https://biztoc.com/x/2a2f261f3a4cff1d",
    "timestamp": "2025-05-12T13:06:26Z"
  },
  {
    "title": "Iowa politics: Rob Sand running for governor in 2026",
    "description": "Democratic state auditor Rob Sand is officially running for governor. He says his campaign will focus on bipartisanship, accountability and bringing Iowans relief from rising costs.",
    "link": "https://www.kcci.com/article/iowa-democrat-rob-sand-launches-campaign-for-governor/64731955",
    "timestamp": "2025-05-12T13:05:27Z"
  },
  {
    "title": "Roche to invest $700 million in new drug manufacturing facility in North Carolina",
    "description": "The new facility will ultimately support Roche and its unit Genentech's future portfolio of next-generation obesity medicines and \"this initial investment...",
    "link": "https://finance.yahoo.com/news/roche-invest-700-million-drug-130516201.html",
    "timestamp": "2025-05-12T13:05:16Z"
  },
  {
    "title": "‘Trump Was Forced to Back Off’: Fox Business Reporter Drops Blunt Analysis of Trump Trade Cave",
    "description": "A prominent Fox Business reporter threw cold water on the idea that President Donald Trump has anything to celebrate following the US-China trade truce.\nThe post ‘Trump Was Forced to Back Off’: Fox Business Reporter Drops Blunt Analysis of Trump Trade Cave fi…",
    "link": "https://www.mediaite.com/news/trump-was-forced-to-back-off-fox-business-reporter-drops-blunt-analysis-of-trump-trade-cave/",
    "timestamp": "2025-05-12T13:03:45Z"
  },
  {
    "title": "Consumers' new spending habits show they're preparing for the worst, and the luxury market is taking the brunt of it",
    "description": "Shoppers are shifting spending habits to make themselves more resilient if a recession hits.",
    "link": "https://www.businessinsider.com/luxury-market-brunt-consumers-spending-habits-rich-habits-2025-5",
    "timestamp": "2025-05-12T13:03:13Z"
  },
  {
    "title": "Art of the Deal: Trump Defeats China as Communists Agree to His Terms After Just 2 Days of Meeting",
    "description": "Art of the Deal: Trump Defeats China as Communists Agree to His Terms After Just 2 Days of Meetingwesternjournal.com",
    "link": "https://www.westernjournal.com/art-deal-trump-defeats-china-communists-agree-terms-just-2-days-meeting/",
    "timestamp": "2025-05-12T13:03:03Z"
  },
  {
    "title": "Qatar and US in talks over offer of luxury plane to use as Air Force One",
    "description": "Democrats and good government advocates say it is unethical and likely unconstitutional for Trump to accept.",
    "link": "https://www.aljazeera.com/news/2025/5/12/qatar-and-us-in-talks-over-offer-of-luxury-plane-to-use-as-air-force-one",
    "timestamp": "2025-05-12T13:02:36Z"
  },
  {
    "title": "Trump-linked American Bitcoin secures Nasdaq listing through merger with Gryphon Digital Mining",
    "description": "The merger highlights the growing trend of Bitcoin firms leveraging public markets for rapid expansion and capital access, impacting industry dynamics.\nThe post Trump-linked American Bitcoin secures Nasdaq listing through merger with Gryphon Digital Mining ap…",
    "link": "https://cryptobriefing.com/american-bitcoin-merger-gryphon/",
    "timestamp": "2025-05-12T13:02:11Z"
  },
  {
    "title": "FO° Talks: Why US Soft Power Is Now Declining Dramatically",
    "description": "Atul Singh: Welcome to FO° Talks. With me is John Feffer — a friend, an author, a spokesman and a nature lover. He’s written many articles for Fair Observer. He has a great understanding of international affairs, and he’s indeed a citizen of the world. Today,…",
    "link": "https://www.fairobserver.com/world-news/us-news/fo-talks-why-us-soft-power-is-now-declining-dramatically/",
    "timestamp": "2025-05-12T13:01:52Z"
  },
  {
    "title": "US and China Scale Back Tariffs in 90-Day Truce",
    "description": "America's 145% tariff on Chinese goods will drop to 30%, while China's tariff on American-made products will fall from 125% to 10%\nThe post US and China Scale Back Tariffs in 90-Day Truce appeared first on TheWrap.",
    "link": "https://www.thewrap.com/us-china-scale-back-tariffs-90-day-truce-trade-deal/",
    "timestamp": "2025-05-12T13:01:26Z"
  },
  {
    "title": "Bitcoin To $400,000, Solana To $420, Ethereum Dead Weight, Says Fund Manager",
    "description": "In an interview that spanned everything from macro-economics to meme-coin mania, veteran trader and Asymmetric founder Joe McCann laid out a forceful—but narrowly targeted—thesis: Bitcoin’s institutional flows can propel it to the high six-figure range, Solan…",
    "link": "http://www.newsbtc.com/news/bitcoin-400000-solana-420-dump-ethereum/",
    "timestamp": "2025-05-12T13:00:50Z"
  },
  {
    "title": "How 50 Days of Joel Gilbert’s “Letitia Files” at The Gateway Pundit Helped Restore Justice in America",
    "description": "Investigative journalism can make a difference.\nThe post How 50 Days of Joel Gilbert’s “Letitia Files” at The Gateway Pundit Helped Restore Justice in America appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/how-50-days-joel-gilberts-letitia-files-gateway/",
    "timestamp": "2025-05-12T13:00:38Z"
  },
  {
    "title": "EXCLUSIVE: Biden ATF promoted agents involved in 'illegal' scheme to inflate salaries, GOP senators say",
    "description": "Two Senate Republicans are calling for immediate corrective action at the ATF where they say supervisory officials turned a blind eye to criminal misconduct on Biden's watch.",
    "link": "https://www.foxnews.com/politics/exclusive-biden-atf-promoted-agents-involved-illegal-scheme-inflate-salaries-gop-senators-say",
    "timestamp": "2025-05-12T13:00:01Z"
  },
  {
    "title": "Sigma to Raise Prices of Its Lenses From June",
    "description": "Since the announcement of tariffs, things have been shaky across various industries. Rising prices and an uncertain future are some of the factors that are affecting business, with the brunt being the most on smaller businesses. The photo industry, in that re…",
    "link": "https://www.thephoblographer.com/2025/05/12/sigma-to-raise-prices-of-its-lenses-from-june/",
    "timestamp": "2025-05-12T13:00:00Z"
  },
  {
    "title": "Democrat Seeks 'Immediate' Ethics Probe Into Qatar Gifting Trump a Luxury Plane: 'A Flying Grift'",
    "description": "Democratic Rep. Ritchie Torres is seeking for different entities to investigate whether Qatar giving the Trump administration a $400 million plane would violate federal ethics rules or the Emoluments Clause of the U.S. Constitution.",
    "link": "https://www.ibtimes.com/democrat-seeks-immediate-ethics-probe-qatar-gifting-trump-luxury-plane-flying-grift-3773245",
    "timestamp": "2025-05-12T12:59:58Z"
  },
  {
    "title": "Israel: Military Pressure Crucial to Hamas Release of American-Israeli Hostage",
    "description": "Israeli government spokesman David Mencer told reporters on Monday, ahead of the expected release of American-Israeli hostage Edan Alexander by Hamas terrorists in Gaza, that sustained military pressure had been crucial.\nThe post Israel: Military Pressure Cru…",
    "link": "https://www.breitbart.com/middle-east/2025/05/12/israel-military-pressure-hostage-release/",
    "timestamp": "2025-05-12T12:59:08Z"
  },
  {
    "title": "South Africa's Democratic Alliance fights new equity law",
    "description": "South Africa's amended Employment Equity Act has sparked heated debate. Supporters see it as essential for social transformation, while the Democratic Alliance says it's unconstitutional and economically harmful.",
    "link": "https://www.dw.com/en/south-africas-democratic-alliance-fights-new-equity-law/a-72441196",
    "timestamp": "2025-05-12T12:59:00Z"
  },
  {
    "title": "South Africa's DA fights new equity law in court",
    "description": "South Africa's amended Employment Equity Act has sparked heated debate. Supporters see it as essential for transformation, while the Democratic Alliance says it's unconstitutional and economically harmful.",
    "link": "https://www.dw.com/en/south-africas-da-fights-new-equity-law-in-court/a-72441196",
    "timestamp": "2025-05-12T12:59:00Z"
  },
  {
    "title": "Cryptocurrency price latest: Around 600,000 wallets have lost nearly whopping $4 billion so far in President Donald Trump’s $TRUMP meme coin, claims report",
    "description": "$TRUMP coins' current market value is $2.74 billion. About 600,000 other wallets have lost $3.87 billion so far, with $117 million of losses occurring after Trump announced the dinner on social media",
    "link": "https://economictimes.indiatimes.com/news/international/us/cryptocurrency-price-latest-around-600000-wallets-have-lost-nearly-whopping-4-billion-so-far-in-president-donald-trumps-trump-meme-coin-claims-report/articleshow/121111663.cms",
    "timestamp": "2025-05-12T12:58:46Z"
  },
  {
    "title": "The Amateur Hour Presidency: Tariffs, Trade, and the High Cost of Chaos | Opinion",
    "description": "America's trade policy is being run like a weekend garage sale. Prices change by the hour, rules are made up on the fly—but unlike a garage sale, no one seems to know who's in charge.",
    "link": "https://www.newsweek.com/amateur-hour-presidency-tariffs-trade-high-cost-chaos-opinion-2070921",
    "timestamp": "2025-05-12T12:57:48Z"
  },
  {
    "title": "Kremlin issues update on proposed Ukraine peace talks",
    "description": "Moscow is serious about finding a lasting solution to the conflict, spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617422-kremlin-ukraine-peace-talks/",
    "timestamp": "2025-05-12T12:57:06Z"
  },
  {
    "title": "Putin's Offer for Direct Talks With Ukraine 'Very Good Move' - Indian Politician",
    "description": "MOSCOW (Sputnik) - Russian President Vladimir Putin's offer for direct talks with Ukraine is a \"very good move\" that can help address the root causes of the conflict, Savio Rodrigues, a representative of India's ruling Bharatiya Janata Party (BJP), told Sputn…",
    "link": "https://sputnikglobe.com/20250512/putins-offer-for-direct-talks-with-ukraine-very-good-move---indian-politician-1122038371.html",
    "timestamp": "2025-05-12T12:56:25Z"
  },
  {
    "title": "Europe and US briefly upped the pressure on Russia over Ukraine. Trump upended that",
    "description": "For about 30 hours, the illusion of transatlantic unity over Ukraine was maintained. Europe and Ukraine had demanded a deal on the 30-day unconditional ceasefire the Trump administration proposed two months earlier. European leaders said US President Donald T…",
    "link": "https://freerepublic.com/focus/f-news/4316478/posts",
    "timestamp": "2025-05-12T12:55:23Z"
  },
  {
    "title": "Donald Trump Scores Four Diplomatic Victories",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe family of the final American citizen held captive by Hamas in Gaza has thanked Donald Trump following news their relative would be released, delivering the latest foreign policy boost for the U.S. presiden…",
    "link": "https://biztoc.com/x/4493bb5dded832b0",
    "timestamp": "2025-05-12T12:55:18Z"
  },
  {
    "title": "Trump's Visit Is Set to Boost Middle East’s AI Ambitions, Deals",
    "description": "",
    "link": "https://biztoc.com/x/d363ccd3ee42ace6",
    "timestamp": "2025-05-12T12:55:06Z"
  },
  {
    "title": "Prescription Drugs Will Drop 59% Under New Order: Trump",
    "description": "President Donald Trump announced he will sign an executive order to slash prescription drug prices by up to 59%, reviving a “most favored nation” policy that would tie U.S. prices to the lowest paid globally. In posts on Truth Social, Trump said Americans hav…",
    "link": "https://biztoc.com/x/02cc3bd60d8bb8b0",
    "timestamp": "2025-05-12T12:55:06Z"
  },
  {
    "title": "Trump to sign order to cut some U.S. drug prices to match those abroad",
    "description": "The order is a blow to the pharmaceutical industry, which is already bracing for Trump's planned tariffs on prescription drugs.",
    "link": "https://www.cnbc.com/2025/05/12/trump-drug-pricing-order-most-favored-nation.html",
    "timestamp": "2025-05-12T12:54:42Z"
  },
  {
    "title": "Donald Trump Scores Four Diplomatic Victories",
    "description": "The issues of China trade talks, a ceasefire between Pakistan and India, the Ukraine war and Gaza hostages have been in the president's in-tray.",
    "link": "https://www.newsweek.com/donald-trump-diplomatic-victories-india-pakistan-hamas-ukraine-2070808",
    "timestamp": "2025-05-12T12:53:56Z"
  },
  {
    "title": "KindlyMD shares skyrocket 600% after merger with Trump crypto advisor David Bailey's bitcoin investment company",
    "description": "High-profile backers include bitcoin pioneers Adam Back, Balaji Srinivasan, Jihan Wu, and Mexican billionaire Ricardo Salinas.",
    "link": "https://www.cnbc.com/2025/05/12/kindlymd-trump-crypto-david-bailey-nakamoto.html",
    "timestamp": "2025-05-12T12:53:27Z"
  },
  {
    "title": "'Checks that he can't cash': Trump blowing up House GOP bill with 'impossible' demands",
    "description": "President Donald Trump's \"big, beautiful bill\" on tax cuts, energy deregulation, and border security is in constant jeopardy and struggling to come together in the House — and a big part of why is the \"impossible\" demands Trump is heaping on GOP leadership fo…",
    "link": "https://www.rawstory.com/trump-tax-cuts-2671936006/",
    "timestamp": "2025-05-12T12:53:10Z"
  },
  {
    "title": "Eric Trump-backed American Bitcoin to go public through all-stock merger",
    "description": "American Bitcoin, a new bitcoin miner backed by U.S. President Donald Trump's two eldest sons, said on Monday it will list on the Nasdaq via an all-stock merger with Gryphon Digital Mining.Existing shareholders of American Bitcoin, including co-founder Eric T…",
    "link": "https://www.channelnewsasia.com/business/eric-trump-backed-american-bitcoin-go-public-through-all-stock-merger-5124276",
    "timestamp": "2025-05-12T12:51:24Z"
  },
  {
    "title": "Eric Trump-backed American Bitcoin to go public through all-stock merger",
    "description": "(Reuters) -American Bitcoin, a new bitcoin miner backed by U.S. President Donald Trump's two eldest sons, said on Monday it will list on the Nasdaq via an...",
    "link": "https://finance.yahoo.com/news/eric-trump-backed-american-bitcoin-125013463.html",
    "timestamp": "2025-05-12T12:50:13Z"
  },
  {
    "title": "Congressional Republicans hedge as the White House targets habeas corpus",
    "description": "Any chance congressional Republicans would stick up for the rule of law as the White House considers suspending habeas corpus? Evidently not.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/congressional-republicans-hedge-white-house-targets-habeas-corpus-rcna206216",
    "timestamp": "2025-05-12T12:49:21Z"
  },
  {
    "title": "Solana Meme Coin Moo Deng Flies 530% in a Week Amid 'Macro Hopium'",
    "description": "With trade war tensions easing, \"macro hopium\" is seeing volatile meme coin assets outpace the wider crypto market.",
    "link": "https://decrypt.co/318973/solana-meme-coin-moo-deng-flies-530-in-a-week-amid-macro-hopium",
    "timestamp": "2025-05-12T12:48:54Z"
  },
  {
    "title": "Trump China tariff truce ignites stock markets – will it also pump up president's poll numbers?",
    "description": "The stock markets are soaring, but will President Donald Trump also enjoy a political payoff in public opinion polling in the wake of a tariff truce with China?",
    "link": "https://www.foxnews.com/politics/trump-china-tariff-truce-ignites-stock-markets-also-pump-up-presidents-poll-numbers",
    "timestamp": "2025-05-12T12:48:06Z"
  },
  {
    "title": "China's official media welcome US tariff deal, others sceptical",
    "description": "BEIJING/HONG KONG (Reuters): A tariff deal between the United States and China on Monday (May 12) was greeted with scepticism on Chinese social media, while official commentary welcomed the news. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/05/12/china039s-official-media-welcome-us-tariff-deal-others-sceptical",
    "timestamp": "2025-05-12T12:47:00Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Monday",
    "description": "Stocks are soaring after the U.S. and China agreed to temporarily slash their tariff rates.",
    "link": "https://www.cnbc.com/2025/05/12/jim-cramers-top-10-things-to-watch-in-the-stock-market-monday.html",
    "timestamp": "2025-05-12T12:46:08Z"
  },
  {
    "title": "Trump’s Ukraine Push Comes to a Head With Challenge to Putin",
    "description": "Donald Trump’s effort to secure peace in Ukraine is reaching a decisive moment with Ukraine’s Volodymyr Zelenskiy challenging Vladimir Putin to engage in talks this week.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-ukraine-push-comes-to-a-head-with-challenge-to-putin",
    "timestamp": "2025-05-12T12:45:00Z"
  },
  {
    "title": "Pharmaceutical industry criticizes the drug pricing plan Trump will sign",
    "description": "President Donald Trump’s plan to change the pricing model for some medications is facing fierce criticism from the pharmaceutical industry before he’s even signed an executive order he says will lower the costs of drugs",
    "link": "https://abcnews.go.com/Health/wireStory/pharmaceutical-industry-criticizes-drug-pricing-plan-trump-hell-121705643",
    "timestamp": "2025-05-12T12:44:55Z"
  },
  {
    "title": "Media Alert: Federal Court to Hear Liberty Justice Center’s Lawsuit Challenging Legality of President Trump’s Liberation Day Tariffs",
    "description": "On Tuesday, May 13, the U.S. Court of International Trade will hear oral arguments in the case of V.O.S. Selections, Inc. v. Trump. This case challenges the legality of certain tariffs imposed on imported goods, raising important questions about the scope of …",
    "link": "https://freerepublic.com/focus/f-bloggers/4316477/posts",
    "timestamp": "2025-05-12T12:44:35Z"
  },
  {
    "title": "Amid Boeing delays, Donald Trump eyes Qatari gift as new Air Force One",
    "description": "The White House is exploring an unconventional solution to Air Force One delays.",
    "link": "https://biztoc.com/x/f3e84549f77a3b18",
    "timestamp": "2025-05-12T12:44:05Z"
  },
  {
    "title": "Trump vs. China: another tariff U-turn?",
    "description": "America and China have agreed to slash their reciprocal tariffs on exports, in what some see as a trade U-turn from Donald Trump, and others laud as Washington strong-arming Beijing to the negotiating table.\nAfter a weekend of talks in Geneva, US Treasury Sec…",
    "link": "https://biztoc.com/x/38bc1cebf5230440",
    "timestamp": "2025-05-12T12:44:03Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to sign order that U.S. pays same drug prices as other nations",
    "description": "President Donald Trump says he'll sign an executive order on Monday that, if implemented, could bring down the costs of some medications — reviving a failed effort from his first term on an issue he's talked up since even before becoming president.",
    "link": "https://biztoc.com/x/c836d1fe10591cf9",
    "timestamp": "2025-05-12T12:43:52Z"
  },
  {
    "title": "Trump Hails Air Force One 'Gift' After Qatari Luxury Jet Reports",
    "description": "Donald Trump on Sunday defended plans to receive a new Air Force One as a gift, after reports he will accept a luxury Boeing jet from Qatar despite strict rules on presents for US presidents.",
    "link": "https://www.ibtimes.com.au/trump-hails-air-force-one-gift-after-qatari-luxury-jet-reports-1858759",
    "timestamp": "2025-05-12T12:40:13Z"
  },
  {
    "title": "Markets Rally After China, US Slash Tariffs",
    "description": "Stock markets, the dollar and oil prices rallied Monday after Chinese and US officials slashed tit-for-tat tariffs for 90 days, fuelling hopes the two sides will pull back from a standoff that has rattled global markets.",
    "link": "https://www.ibtimes.com.au/markets-rally-after-china-us-slash-tariffs-1858758",
    "timestamp": "2025-05-12T12:40:11Z"
  },
  {
    "title": "Drones Hit Ukraine As Zelensky Awaits Putin Reply On Talks",
    "description": "Russia fired more than 100 drones at Ukraine overnight, Kyiv said Monday as it awaits the Kremlin's response to Volodymyr Zelensky's call for a personal meeting with Vladimir Putin this week.",
    "link": "https://www.ibtimes.com.au/drones-hit-ukraine-zelensky-awaits-putin-reply-talks-1858756",
    "timestamp": "2025-05-12T12:40:09Z"
  },
  {
    "title": "Trump is hoping to quietly gut the social safety net (Abdallah Fayyad/Vox)",
    "description": "Abdallah Fayyad / Vox:\nTrump is hoping to quietly gut the social safety net  —  There are two things you should know about President Donald Trump's recently released budget proposal: First, it would significantly boost funding for Homeland Security and the De…",
    "link": "https://www.memeorandum.com/250512/p28",
    "timestamp": "2025-05-12T12:40:00Z"
  },
  {
    "title": "Nakamoto Holdings merges with KindlyMD to build Bitcoin treasury",
    "description": "Healthcare services provider KindlyMD merged with Bitcoin-native holding company Nakamoto Holdings to build a BTC treasury.According to a May 12 announcement, Nakamoto Holdings — a new company founded by David Bailey, a crypto adviser to US President Donald T…",
    "link": "https://cointelegraph.com/news/nakamoto-holdings-kindlymd-bitcoin-treasury-merger",
    "timestamp": "2025-05-12T12:38:13Z"
  },
  {
    "title": "Supreme Court justice's stunning premonition of Trump era: 'How Roman Republic fell'",
    "description": "Long before President Donald Trump ran for his first term in office, conservative Supreme Court Justice David Souter appeared to glimpse the future in a stunning warning of how democracy could die. The judge, who retired from the High Court in 2009, died last…",
    "link": "https://www.rawstory.com/constitution/",
    "timestamp": "2025-05-12T12:37:34Z"
  },
  {
    "title": "American-Israeli hostage Edan Alexander released, Hamas says",
    "description": "Hamas says it has released Edan Alexander, an Israeli soldier who holds American citizenship, as part of ongoing efforts to achieve a permanent ceasefire with Israel.",
    "link": "https://news.sky.com/story/american-israeli-hostage-edan-alexander-released-hamas-says-13366638",
    "timestamp": "2025-05-12T12:36:00Z"
  },
  {
    "title": "MAGA activist Laura Loomer calls out Donald Trump for accepting new Air Force One gift from Qatar, says, \"We cannot accept a $400 million ‘gift’ from jihadists in suits\"",
    "description": "Donald Trump faces unexpected backlash from his MAGA base over a $400 million Boeing 747-8 gift from Qatar, intended as his new Air Force One. Critics, including Laura Loomer and Mark Levin, cite Qatar's alleged ties to terrorism as a major concern. Democrats…",
    "link": "https://economictimes.indiatimes.com/news/international/us/maga-activist-laura-loomer-calls-out-donald-trump-for-accepting-new-air-force-one-gift-from-qatar-says-we-cannot-accept-a-400-million-gift-from-jihadists-in-suits/articleshow/121110761.cms",
    "timestamp": "2025-05-12T12:35:15Z"
  },
  {
    "title": "Donald Trump's Approval Rating Changes Direction",
    "description": "A new poll suggests the president's standing is improving slightly.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-latest-2070803",
    "timestamp": "2025-05-12T12:34:39Z"
  },
  {
    "title": "Canadians, your milk and beef might soon cost you a fortune",
    "description": "Canadians are grappling with soaring food prices, particularly for dairy and beef, straining family budgets. Rising transportation, labor costs, and trade uncertainties, exacerbated by US trade policies, contribute to the financial pressure. While supporting …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canadians-your-milk-and-beef-might-soon-cost-you-a-fortune/articleshow/121111031.cms",
    "timestamp": "2025-05-12T12:33:23Z"
  },
  {
    "title": "Trump vs. China: another tariff U-turn?",
    "description": "Washington and Beijing make huge tariff cuts, as both sides seek 'exit ramp' from escalating trade war",
    "link": "https://theweek.com/business/economy/trump-vs-china-another-tariff-u-turn",
    "timestamp": "2025-05-12T12:33:21Z"
  },
  {
    "title": "Europe and US briefly upped the pressure on Russia over Ukraine. Trump upended that",
    "description": "For about 30 hours, the illusion of transatlantic unity over Ukraine was maintained. But US President Donald Trump’s response to a proposal from Russia’s Vladimir Putin shattered that.",
    "link": "https://www.cnn.com/2025/05/12/europe/europe-us-pressure-russia-trump-ukraine-intl-cmd",
    "timestamp": "2025-05-12T12:33:14Z"
  },
  {
    "title": "Pharmaceutical industry criticizes drug pricing plan Trump says he’ll sign",
    "description": "President Donald Trump’s plan to change the pricing model for some medications is already facing fierce criticism from the pharmaceutical industry before he’s even signed the executive order set for Monday that, if implemented, could lower the cost of some dr…",
    "link": "https://biztoc.com/x/bae80f7254ccab38",
    "timestamp": "2025-05-12T12:32:38Z"
  },
  {
    "title": "\"Un-American\": Rep. Bonnie Watson Coleman on DHS Threats to Arrest Her for Visiting ICE Jail in Newark",
    "description": "We speak with Congressmember Bonnie Watson Coleman, one of three Democratic lawmakers the Department of Homeland Security has threatened to arrest after they went Friday to inspect a newly reopened private ICE jail. They are accused of assaulting ICE officers…",
    "link": "https://www.democracynow.org/2025/5/12/bonnie_watson_coleman",
    "timestamp": "2025-05-12T12:32:23Z"
  },
  {
    "title": "Can Trump Secure a New Iran Deal?",
    "description": "Although Iran and the United States remain far apart on major questions regarding the Islamic Republic's nuclear program, a new round of indirect talks indicates that both sides view diplomacy as preferable to escalation. The window for achieving nuclear de-e…",
    "link": "https://www.project-syndicate.org/commentary/trump-iran-deal-narrow-but-real-window-for-diplomacy-by-ian-bremmer-2025-05",
    "timestamp": "2025-05-12T12:32:14Z"
  },
  {
    "title": "'I don't love it': Trump's $1,000 self-deportation plan draws mixed reaction from House GOP",
    "description": "House Republicans spoke with Fox News Digital about President Trump's plan to offer illegal immigrants a stipend to self-deport.",
    "link": "https://www.foxnews.com/politics/i-dont-love-it-trumps-1000-self-deportation-plan-draws-mixed-reaction-from-house-gop",
    "timestamp": "2025-05-12T12:30:52Z"
  },
  {
    "title": "Putin Pushes for Direct Peace Talks in Istanbul as Ukraine & Euroglobalists Demand Preconditioned Truce",
    "description": "Russian President Vladimir Putin has called for the resumption of direct peace talks with Ukraine, proposing a meeting in Istanbul on May 15 without any preconditions.\nThe post Putin Pushes for Direct Peace Talks in Istanbul as Ukraine & Euroglobalists Demand…",
    "link": "https://www.thegatewaypundit.com/2025/05/putin-pushes-direct-peace-talks-istanbul-as-ukraine/",
    "timestamp": "2025-05-12T12:30:13Z"
  },
  {
    "title": "Consumer Confidence Rises in Canada After Carney’s Election Win",
    "description": "Canadians are growing more optimistic about the economy, as the conclusion of a national election relieves some anxiety around the country’s direction and US President Donald Trump’s threats.",
    "link": "https://financialpost.com/pmn/business-pmn/consumer-confidence-rises-in-canada-after-carneys-election-win",
    "timestamp": "2025-05-12T12:30:09Z"
  },
  {
    "title": "This Week Will Begin A Process That Will Either Lead To Peace Or World War 3",
    "description": "Are we about to see Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy sitting across from each other at a negotiating table in Turkey?  It looks like that could actually happen this week.  If both leaders really do show up, there wi…",
    "link": "https://www.shtfplan.com/headline-news/this-week-will-begin-a-process-that-will-either-lead-to-peace-or-world-war-3",
    "timestamp": "2025-05-12T12:30:03Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to sign order that U.S. pays same drug prices as other nations",
    "description": "President Donald Trump says he'll sign an executive order on Monday that, if implemented, could bring down the costs of some medications — reviving a failed effort from his first term on an issue he's talked up since even before becoming president.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-expected-to-sign-order-that-u-s-pays-same-drug-prices-as-other-nations",
    "timestamp": "2025-05-12T12:30:02Z"
  },
  {
    "title": "If you really want to close the US trade deficit, try boosting innovation in rural manufacturing",
    "description": "New research shows that rural America has untapped export potential. Taking advantage of it could be a more effective way to narrow the trade deficit than tariffs.",
    "link": "https://theconversation.com/if-you-really-want-to-close-the-us-trade-deficit-try-boosting-innovation-in-rural-manufacturing-255851",
    "timestamp": "2025-05-12T12:27:23Z"
  },
  {
    "title": "Trump Family Backed American Bitcoin To Go Public via Merger With Gryphon Digital",
    "description": "Pre-market spikes follow news of strategic stock-for-stock transaction.",
    "link": "https://www.coindesk.com/markets/2025/05/12/trump-family-backed-american-bitcoin-to-go-public-via-merger-with-gryphon-digital",
    "timestamp": "2025-05-12T12:27:09Z"
  },
  {
    "title": "As Trump heads to the Gulf, Israel asks where it stands",
    "description": "Donald Trump's recent actions, including bypassing Israel on a Middle East trip and halting bombings in Yemen, have stirred unease in Israel regarding its standing with the U.S. The U.S. brokered a hostage release with Hamas without Israel's involvement, furt…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-trump-heads-to-the-gulf-israel-asks-where-it-stands/articleshow/121111003.cms",
    "timestamp": "2025-05-12T12:24:43Z"
  },
  {
    "title": "Breon Peace, Ex-Brooklyn US Attorney, Rejoins Cleary Gottlieb",
    "description": "Breon Peace is rejoining the law firm Cleary Gottlieb Steen & Hamilton as co-leader of the firm’s litigation group after spending four years as the Brooklyn US attorney overseeing one of the largest prosecutor offices in the country.",
    "link": "https://financialpost.com/pmn/business-pmn/breon-peace-ex-brooklyn-us-attorney-rejoins-cleary-gottlieb",
    "timestamp": "2025-05-12T12:24:37Z"
  },
  {
    "title": "Trump Welcomes White South African Refugees to US: Live Updates",
    "description": "A U.S.-funded flight carrying 49 white South Africans lands as Trump fast-tracks refugee status for Afrikaners, sparking backlash. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-administration-tariffs-refugees-live-updates-2070905",
    "timestamp": "2025-05-12T12:24:30Z"
  },
  {
    "title": "Labor Market Stays Resilient, but Workers Less Productive in Q1",
    "description": "The number of Americans filing new applications for unemployment benefits fell sharply as the spring break-related boost from the prior week faded, suggesting the labor market continued to chug along, though risks are mounting from tariffs. Employers are hoar…",
    "link": "https://www.insurancejournal.com/news/national/2025/05/12/823322.htm",
    "timestamp": "2025-05-12T12:22:10Z"
  },
  {
    "title": "Pharmaceutical industry criticizes the drug pricing plan Trump says he’ll sign",
    "description": "By AMANDA SEITZ and WILL WEISSERT, Associated Press\nWASHINGTON (AP) — President Donald Trump’s plan to change the pricing model for some medications is already facing fierce criticism from the pharmaceutical industry before he’s even signed the executive orde…",
    "link": "https://biztoc.com/x/3876c5074aed81f6",
    "timestamp": "2025-05-12T12:21:37Z"
  },
  {
    "title": "Dow Jones Futures Surge 1,000 Points On Trump-China Tariff Deal; Apple, Nvidia, Tesla Rally",
    "description": "Futures for the Dow Jones Industrial Average and other major stock indexes surged Monday after President Donald Trump and the U.S. reached a trade deal with China to slash tariff rates. Meanwhile, Apple (AAPL), Nvidia (NVDA) and Tesla (TSLA) were among the bi…",
    "link": "https://biztoc.com/x/e1e63360dd9a5930",
    "timestamp": "2025-05-12T12:21:28Z"
  },
  {
    "title": "Trump scrambles to defend luxury jet from Qatar he’ll use as Air Force One",
    "description": "Donald Trump tried to defend an apparent plan in which he'll get to use a luxury jet from the government of Qatar as Air Force One. It didn't go well.",
    "link": "https://biztoc.com/x/8e4e6889e70e3784",
    "timestamp": "2025-05-12T12:21:12Z"
  },
  {
    "title": "The Federalist Society is surprisingly ambivalent about Trump (Ian Millhiser/Vox)",
    "description": "Ian Millhiser / Vox:\nThe Federalist Society is surprisingly ambivalent about Trump  —  Few organizations have profited as handsomely off of President Donald Trump's rise to power as the Federalist Society, a kind of bar association for right-wing lawyers.  — …",
    "link": "https://www.memeorandum.com/250512/p19",
    "timestamp": "2025-05-12T12:20:00Z"
  },
  {
    "title": "How Donald Trump Jr. is cashing in on his dad's presidency (Bethany McLean/Business Insider)",
    "description": "Bethany McLean / Business Insider:\nHow Donald Trump Jr. is cashing in on his dad's presidency  —  Last November, only six days after his father was elected president, Donald Trump Jr. made a career move that, on the surface at least, seemed a bit odd.  He bec…",
    "link": "https://www.memeorandum.com/250512/p22",
    "timestamp": "2025-05-12T12:20:00Z"
  },
  {
    "title": "Trump Has Cut National Debt Growth by 92 Percent",
    "description": "Trump has been in office for only a few months and has already managed to cut national debt growth by 92 percent. This is definitely one of the things that would cause people to say, ‘I voted for this.’While the left rants and raves over cuts to various gover…",
    "link": "https://freerepublic.com/focus/f-news/4316471/posts",
    "timestamp": "2025-05-12T12:19:59Z"
  },
  {
    "title": "The Risk Of Israeli-Turkish Mock Dogfights Over Syria",
    "description": "'Under the new circumstances, it is likely to see mock dogfights between the Israeli and the Turkish Air Force over Syria.'",
    "link": "https://www.forbes.com/sites/pauliddon/2025/05/12/the-risk-of-israeli-turkish-mock-dogfights-over-syria/",
    "timestamp": "2025-05-12T12:19:44Z"
  },
  {
    "title": "US hostage release move gets mixed reaction in Israel, highlights rift",
    "description": "Israel's Prime Minister Benjamin Netanyahu Monday said there would be no ceasefire in exchange for Hamas's release of a U.S.-Israeli hostage in a decision to spark unease in Israel and unveil another sign of the growing rift.",
    "link": "https://www.hurriyetdailynews.com/us-hostage-release-move-gets-mixed-reaction-in-israel-highlights-rift-209075",
    "timestamp": "2025-05-12T12:18:16Z"
  },
  {
    "title": "The Latest: The White House releases Trump's schedule for Monday",
    "description": "The White House has released President Donald Trump's schedule for Monday.  Trump will visit Saudi Arabia, Qatar and the United Arab Emirates, though his...",
    "link": "https://www.yahoo.com/news/latest-white-house-releases-trumps-121735353.html",
    "timestamp": "2025-05-12T12:17:35Z"
  },
  {
    "title": "Is US-China trade war over or tariff cuts may be just a temporary fix? All your FAQs answered",
    "description": "The US and China have agreed a deal that will significantly cut the import tariffs they have imposed on each other, in a major de-escalation of their trade war. US Treasury Secretary Scott Bessent said both countries would lower their reciprocal tariffs by 11…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-is-us-china-trade-war-over-or-tariff-cuts-may-be-just-a-temporary-fix-all-your-faqs-answered/articleshow/121110601.cms",
    "timestamp": "2025-05-12T12:17:15Z"
  },
  {
    "title": "Trump to make announcement on drug prices before departing for Mideast (Washington Post)",
    "description": "Washington Post:\nTrump to make announcement on drug prices before departing for Mideast  —  President Donald Trump plans to hold a news conference on drug prices Monday before departing on a four-day trip to Saudi Arabia, Qatar and the United Arab Emirates.  …",
    "link": "https://www.memeorandum.com/250512/p17",
    "timestamp": "2025-05-12T12:15:00Z"
  }
]