[
  {
    "title": "The American system of democracy has crashed",
    "description": "Once upon a time in America, there was a tyrant. And Congress rejected him totally. The tyrant, of course, was King George III, the target of the Declaration of Independence. We take it for granted now, but the Declaration was an enormous political innovation…",
    "link": "https://www.theverge.com/policy/697301/trump-supreme-court-founding-fathers-july-4",
    "timestamp": "2025-07-04T13:05:02Z"
  },
  {
    "title": "President plans UFC fight at White House...",
    "description": "DONALD TRUMP has revealed sensational plans to host a UFC event at the White House next year. Trump, 79, has been a regular attendee of events staged by mixed martial arts’ premier promotion …",
    "link": "https://www.the-sun.com/sport/14625805/donald-trump-ufc-fight-white-house-dana-white/",
    "timestamp": "2025-07-04T13:04:37Z"
  },
  {
    "title": "Putin pounds Ukraine with record war blitz moments after Trump call...",
    "description": "Putin pounds Ukraine with record war blitz moments after Trump call...\r\n\n \n \n \n (Third column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Plots Summer of Relentless Attacks...\r\nKGB-linked oil tycoon mysteriously plunges 180ft to death...",
    "link": "https://www.the-sun.com/news/14624773/trump-putin-kyiv-russia-attack/",
    "timestamp": "2025-07-04T13:04:37Z"
  },
  {
    "title": "18 Big, Beautiful Trump Victories as America Celebrates Independence Day",
    "description": "President Donald Trump has been on a serious winning streak nearly six months into his second term.\nThe post 18 Big, Beautiful Trump Victories as America Celebrates Independence Day appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/04/18-big-beautiful-trump-victories-as-america-celebrates-independence-day/",
    "timestamp": "2025-07-04T13:00:59Z"
  },
  {
    "title": "Big changes ahead! How Trump’s Big Beautiful Bill could impact your Income Tax and wallet",
    "description": "Trump’s Big Beautiful Bill 2025 brings major changes to how Americans will pay taxes starting in 2026. President Donald Trump’s new “big, beautiful bill” includes permanent tax cuts for the wealthy, temporary deductions for the middle class, and small breaks …",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-changes-ahead-how-trumps-big-beautiful-bill-could-impact-your-income-tax-and-wallet/articleshow/122251164.cms",
    "timestamp": "2025-07-04T13:00:59Z"
  },
  {
    "title": "Law Schools Quietly Adjusting Messaging on DEI Policies",
    "description": "\"Adjusting their recruiting and messaging approach to avoid becoming a target, raising questions over the future of diversity in the legal profession.\"\nThe post Law Schools Quietly Adjusting Messaging on DEI Policies first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/law-schools-quietly-adjusting-messaging-on-dei-policies/",
    "timestamp": "2025-07-04T13:00:23Z"
  },
  {
    "title": "Trump v. California: Sanctuary cities to EV bans, Trump puts left-wing state under repeated scrutiny",
    "description": "President Trump has battled California Gov. Newsom over wildfires, immigration, environmental rules, and vehicle mandates as the administration targets progressive policies.",
    "link": "https://www.foxnews.com/politics/trump-vs-california-from-sanctuary-cities-ev-bans-trump-puts-left-wing-state-under-repeated-scrutiny",
    "timestamp": "2025-07-04T13:00:16Z"
  },
  {
    "title": "‘Worst of any prime minister’: Ten moments that defined Labour’s first year in power in the UK",
    "description": "From a ‘loveless landslide’ to excessive gloom and a climbdown forced by his own MPs, the UK prime minister has endured a torrid first 12 months in office",
    "link": "https://www.irishtimes.com/world/uk/2025/07/04/worst-of-any-prime-minister-ten-moments-that-defined-labours-first-year-in-power-in-the-uk/",
    "timestamp": "2025-07-04T13:00:00Z"
  },
  {
    "title": "“The Declaration of Independence Applied To The Communications World”: Ken Burns Defends PBS, Tells CBS News That Defunding Public Media Is “Foolhardy”",
    "description": "As Congress considers legislation that would strip federal funding from public media, filmmaker Ken Burns is speaking out on the prospect, calling it “foolhardy” and telling CBS News’ John Dickerson, “I couldn’t do any of the films I’ve done without them bein…",
    "link": "http://deadline.com/2025/07/ken-burns-pbs-trump-1236449912/",
    "timestamp": "2025-07-04T13:00:00Z"
  },
  {
    "title": "Trump Celebrates Fourth of July by Deporting Veterans and Their Families",
    "description": "Donald Trump is carrying out the cruelest and most sweeping mass deportation program in modern U.S. history — and he’s even targeting veterans.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-veterans-immigration-deportations-fourth-of-july-1235378979/",
    "timestamp": "2025-07-04T13:00:00Z"
  },
  {
    "title": "Germany plans six-month voluntary military service, sources say",
    "description": "BERLIN (Reuters) -Germany plans to introduce a voluntary six-month military service scheme, sources familiar with the plan said on Friday, as Berlin tries to train more reservists and bolster national defences over security concerns about Russia. Read full st…",
    "link": "https://www.thestar.com.my/news/world/2025/07/04/germany-plans-six-month-voluntary-military-service-sources-say",
    "timestamp": "2025-07-04T12:57:00Z"
  },
  {
    "title": "Trump says he is about to raise tariffs as high as 70% on some countries | CNN Business",
    "description": "With just five days remaining in the tariff moratorium, the White House is expected to begin delivering a message to a dozen or so countries: Time is up, and here’s your new rate.",
    "link": "https://www.cnn.com/2025/07/04/business/tariff-letters-trump",
    "timestamp": "2025-07-04T12:56:35Z"
  },
  {
    "title": "EU and Germany push for a new World Trade Organization",
    "description": "Brussels and Berlin have launched a new initiative aimed at bypassing the long-standing paralysis of the World Trade Organization (WTO) caused by the United States. But how viable is such a solution? A proposal, introduced by European Commission President Urs…",
    "link": "https://www.dw.com/en/eu-and-germany-push-for-a-new-world-trade-organization/a-73143928",
    "timestamp": "2025-07-04T12:54:00Z"
  },
  {
    "title": "As Millions Lose Health Care, Melania Trump Smiles for the Cameras at Children’s Hospital - Inquisitr News",
    "description": "First Lady Melania Trump spent the day smiling for camera crews at a children's hospital in Washington, D.C., while Republican lawmakers rammed a nearly $1",
    "link": "https://www.inquisitr.com/as-millions-lose-health-care-melania-trump-smiles-for-the-cameras-at-childrens-hospital",
    "timestamp": "2025-07-04T12:50:19Z"
  },
  {
    "title": "Donald Trump's team sound alarm over president's health after 6 worrying signs - NewsBreak",
    "description": "Members of Donald Trump's inner circle have said they 'don’t think he’s in good physical health' as several White House insiders have pointed to key behavi",
    "link": "https://www.newsbreak.com/share/4088939814186-donald-trump-s-team-sound-alarm-over-president-s-health-after-6-worrying-signs?_f=app_share&amp;pd=0Hkk0WBv&amp;lang=en_US&amp;send_time=1751633318&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.26.0.30%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v8%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v2&amp;s=i2",
    "timestamp": "2025-07-04T12:49:33Z"
  },
  {
    "title": "Russia launches drone, missile attacks against Kyiv",
    "description": "Waves of drone and missile attacks targeted Kyiv overnight into Friday in the largest aerial assault since Russia's invasion of Ukraine began more than three years ago, officials said, amid a renewed Russian push to capture more of its neighbor's land.",
    "link": "https://www.pbs.org/newshour/world/russia-launches-drone-missile-attacks-against-kyiv",
    "timestamp": "2025-07-04T12:48:12Z"
  },
  {
    "title": "US Secretary of Defense Hegseth Takes Unilateral Step to Reduce Military Aid to Ukraine",
    "description": "WASHINGTON (Sputnik) - US Secretary of Defense Pete Hegseth has made the decision to partially suspend US military assistance to Ukraine unilaterally, ignoring an analysis by senior military officers, the NBC broadcaster reported on Friday, citing officials.",
    "link": "https://sputnikglobe.com/20250704/us-secretary-of-defense-hegseth-takes-unilateral-step-to-reduce-military-aid-to-ukraine-1122395301.html",
    "timestamp": "2025-07-04T12:47:23Z"
  },
  {
    "title": "‘It’s A Blood Sport’: Here Are 6 Times Harris Faulkner Lit Guests Up Like The 4th Of July",
    "description": "Fox News host Harris Faulkner has touched off plenty of figurative fireworks in the first six months of 2025.",
    "link": "https://dailycaller.com/2025/07/04/6-times-harris-faulkner-lit-dem-guests-4th-july/",
    "timestamp": "2025-07-04T12:46:48Z"
  },
  {
    "title": "One of America's most important companies slashes 20,000 jobs and offers huge buyouts",
    "description": "UPS is offering voluntary buyouts to its full-time US drivers following its decision to slash 20,000 jobs and close 73 facilities. The Atlanta-based company will be providing its laid off employees with various benefits, including pensions and healthcare. The…",
    "link": "https://freerepublic.com/focus/f-news/4326846/posts",
    "timestamp": "2025-07-04T12:44:20Z"
  },
  {
    "title": "Inside Trump’s Kick-Off Of America’s 249th Birthday",
    "description": "DES MOINES, Iowa — Trump visited the Iowa State Fair on Thursday, fulfilling a campaign promise and touting all his administration has accomplished.",
    "link": "https://dailycaller.com/2025/07/04/trump-white-house-iowa-fourth-july-big-beautiful-bill/",
    "timestamp": "2025-07-04T12:42:17Z"
  },
  {
    "title": "Massive corporate giant applies for 6,000 guest worker visas amid mass layoffs",
    "description": "Microsoft applied for as many as 6,000 specialized migrant worker visas leading up to a decision to terminate 9,000 jobs globally, according to new reports. The global tech giant revealed this week it would cut around 4 percent of its global workforce as it r…",
    "link": "https://freerepublic.com/focus/f-news/4326845/posts",
    "timestamp": "2025-07-04T12:41:09Z"
  },
  {
    "title": "Stocks, dollar drop as tariff talk dominates",
    "description": "Stock markets mostly fell alongside a retreating dollar Friday as international tensions over tariffs dominated sentiment.\nThe post Stocks, dollar drop as tariff talk dominates appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/stocks-dollar-drop-as-tariff-talk-dominates/article",
    "timestamp": "2025-07-04T12:40:56Z"
  },
  {
    "title": "Former CIA Official Says What We're All Thinking About John Brennan After Bombshell 'Russiagate' Report",
    "description": "One of former CIA Director John Brennan’s ex-employees has called for him to be prosecuted after the agency released a bombshell report outlining how he sought to use the agency to promote the Russia collusion hoax. The report discussed the details surroundin…",
    "link": "https://freerepublic.com/focus/f-news/4326844/posts",
    "timestamp": "2025-07-04T12:40:37Z"
  },
  {
    "title": "Trump targets international national park visitors in latest order",
    "description": "Deep inside the 130-page 2026 budget proposal for the Department of the Interior that President Donald Trump published earlier this spring is a section titled \"recreational fee program\" — in it, the budget proposes a \"surcharge for foreign visitors that is es…",
    "link": "https://biztoc.com/x/2907b1bb5d68bfc9",
    "timestamp": "2025-07-04T12:39:30Z"
  },
  {
    "title": "Trump plans to start notifying countries of U.S. tariffs up to 70%",
    "description": "US President Donald Trump said his administration will probably start notifying trading partners Friday of the new US tariff on their exports effective Aug. 1, while reiterating a preference for simplicity over complicated negotiations five days before his de…",
    "link": "https://biztoc.com/x/6e6a4ddea95697e0",
    "timestamp": "2025-07-04T12:39:20Z"
  },
  {
    "title": "Russia is paying schoolgirls to have babies. Why is pronatalism on the rise around the world?",
    "description": "Public opinion is split in Russia over a new move to pay schoolgirls who have babies.",
    "link": "https://theconversation.com/russia-is-paying-schoolgirls-to-have-babies-why-is-pronatalism-on-the-rise-around-the-world-258979",
    "timestamp": "2025-07-04T12:38:42Z"
  },
  {
    "title": "Chase Chrisley Jokes Dad Todd 'Should've Taken Driver's Ed' in Prison",
    "description": "Chase Chrisley is having some fun at his dad Todd’s expense! The reality star, 29, shared an Instagram video of his father driving him to a meeting on Thursday, July 3, but he wasn’t too impressed with Todd’s driving skills. “Going into a meeting and my dad d…",
    "link": "https://www.usmagazine.com/celebrity-news/news/chase-chrisley-jokes-dad-todd-shouldve-taken-drivers-ed-in-prison-doesnt-know-how-to-drive/#article",
    "timestamp": "2025-07-04T12:38:24Z"
  },
  {
    "title": "Russia Hammers Kyiv In Largest Missile And Drone Barrage Since Ukraine War Began",
    "description": "“It was a harsh, sleepless night,” Ukraine President Volodymyr Zelenskyy said.",
    "link": "https://www.huffpost.com/entry/russia-hammers-kyiv-with-missile-drone-barrage_n_6867c922e4b0eb2c5aed7cf3",
    "timestamp": "2025-07-04T12:36:58Z"
  },
  {
    "title": "Trump plans to start notifying countries of U.S. tariffs up to 70%",
    "description": "Trump told reporters that about “10 or 12” letters would go out Friday, with additional letters coming “over the next few days.”",
    "link": "https://fortune.com/2025/07/04/trump-plans-to-start-notifying-countries-of-u-s-tariffs-up-to-70/",
    "timestamp": "2025-07-04T12:35:44Z"
  },
  {
    "title": "Trump Signs The Bill Today: 4 Winners Of The New ‘Big Beautiful Bill’",
    "description": "Wage increases, tax cuts, credits and deductions. These are some of the benefits Trump will likely mention as he signs his “big, beautiful bill” into law today.",
    "link": "https://www.forbes.com/sites/terinaallen/2025/07/04/trump-signs-the-bill-today-4-winners-of-the-new-big-beautiful-bill/",
    "timestamp": "2025-07-04T12:35:37Z"
  },
  {
    "title": "Hamas give 'positive' response on ceasefire proposal",
    "description": "Hamas has submitted its response to a US-brokered Gaza ceasefire proposal, a Palestinian official familiar with the negotiations has said, describing the response as a positive one that should \"facilitate reaching a deal.\"",
    "link": "https://www.rte.ie/news/2025/0704/1521868-middle-east-gaza/",
    "timestamp": "2025-07-04T12:34:52Z"
  },
  {
    "title": "15 killed in Gaza, US waits for Hamas ceasefire response",
    "description": "At least 15 Palestinians have been killed overnight in an Israeli airstrike in Gaza, according to local health officials, as US President Donald Trump said he expected Hamas to respond to his \"final proposal\" for a ceasefire in Gaza in the next 24 hours.",
    "link": "https://www.rte.ie/news/2025/0704/1521868-middle-east/",
    "timestamp": "2025-07-04T12:34:52Z"
  },
  {
    "title": "When will Trump’s ‘Big Beautiful Bill’ take effect? Here’s what comes next",
    "description": "Donald Trump’s bill will raise top-tier wealth, erode healthcare for poor people and raise the deficit by $3 trillion.",
    "link": "https://www.aljazeera.com/news/2025/7/4/when-will-trumps-big-beautiful-bill-take-effect-heres-what-comes-next",
    "timestamp": "2025-07-04T12:32:07Z"
  },
  {
    "title": "Congress Passes Big Beautiful Border Security Reimbursement for States",
    "description": "The passage by Congress of the \"One Big Beautiful Bill Act\" includes a provision for the reimbursement of funds spent by states on border security. Texas led the nation in state border security spending and could receive up to $11 billion in reimbursements.\nT…",
    "link": "https://www.breitbart.com/border/2025/07/04/congress-passes-big-beautiful-border-security-reimbursement-for-states/",
    "timestamp": "2025-07-04T12:31:48Z"
  },
  {
    "title": "Trump to sign ‘big, beautiful’ bill on US Independence Day",
    "description": "US President Donald Trump will sign his flagship tax and spending bill Friday in a pomp-laden Independence Day ceremony.\nThe post Trump to sign ‘big, beautiful’ bill on US Independence Day appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/trump-to-sign-big-beautiful-bill-on-us-independence-day/article",
    "timestamp": "2025-07-04T12:31:29Z"
  },
  {
    "title": "Anthony Albanese to champion 'Australian independence' within US alliance",
    "description": "The PM's speech comes at a delicate moment in Australia’s key strategic relationship, as the federal government grapples with an unpredictable White House.",
    "link": "https://www.abc.net.au/news/2025-07-04/anthony-albanese-champions-australian-independence-/105497350",
    "timestamp": "2025-07-04T12:31:00Z"
  },
  {
    "title": "The Fourth of July",
    "description": "\"I can negotiate with a man who wants to make money. I can't negotiate with a communist who wants to kill me.\" — Josh Lippincott on \"X\"",
    "link": "https://www.kunstler.com/p/the-fourth-of-july",
    "timestamp": "2025-07-04T12:29:55Z"
  },
  {
    "title": "EU-US trade talks: Crunch time looms with no deal in sight",
    "description": "July 9 is almost upon us. That's when 50% tariffs could kick in on EU goods sold to the US if the two sides don't strike a deal beforehand.\nUS President Donald Trump hit EU goods with a baseline tariff of 10% on April 2, and a rate of 25% on imported cars and…",
    "link": "https://biztoc.com/x/71102bf4a8dc5ac5",
    "timestamp": "2025-07-04T12:28:42Z"
  },
  {
    "title": "Anti-Trump protests to hit US streets as 'Free America' rallies planned on July 4: All FAQs answered",
    "description": "Millions of people are expected to hit the streets in US on July 4, Friday to protest against the policies of Donald Trump and his administration. The Women's March is encouraging protesters to plan marches, banner drops, street parades, art builds and more. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-anti-trump-protests-to-hit-us-streets-as-free-america-rallies-planned-on-july-4-all-faqs-answered/articleshow/122250796.cms",
    "timestamp": "2025-07-04T12:28:39Z"
  },
  {
    "title": "Donald Trump's team sound alarm over president's health after 6 worrying signs - NewsBreak",
    "description": "Members of Donald Trump's inner circle have said they 'don’t think he’s in good physical health' as several White House insiders have pointed to key behavi",
    "link": "https://www.newsbreak.com/share/4088939814186-donald-trump-s-team-sound-alarm-over-president-s-health-after-6-worrying-signs?s=a2&amp;share_destination_id=MjA4MTUxNTItMTc1MTYzMTk0MjgwOA%3D%3D&amp;pd=01PKyGbu&amp;hl=en_US&amp;send_time=1751631942&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-control%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v5",
    "timestamp": "2025-07-04T12:26:53Z"
  },
  {
    "title": "White House Mac Fight? ‘I Would Be Honored’",
    "description": "Conor McGregor has already reached out to UFC CEO Dana White about participating in the America 250 July 4th fight on the White House lawn.",
    "link": "https://www.mmamania.com/2025/7/4/24461530/conor-mcgregor-wants-in-on-white-house-ufc-fight-i-would-be-honored",
    "timestamp": "2025-07-04T12:25:53Z"
  },
  {
    "title": "Democratic Congressman Suozzi’s $50,000 stock sale took advantage of a loophole in Congressional disclosure rules",
    "description": "The New York rep never disclosed owning the stock, prompting the question of how he managed to sell a security he didn’t appear to own in the first place.",
    "link": "https://fortune.com/2025/07/04/democratic-rep-tom-suozzis-stock-sale-loophole-congressional-disclosure/",
    "timestamp": "2025-07-04T12:23:57Z"
  },
  {
    "title": "AOC Warns of ICE 'Explosion' After Trump Bill Passes",
    "description": "Taking to social media after the bill passed, Ocasio-Cortez expressed concerns with what the bill now means in terms of funding for ICE. \"I don't think anyone is prepared for what they just did w/ICE,\" the New York lawmaker posted on Bluesky. \"This is not a s…",
    "link": "https://freerepublic.com/focus/f-news/4326843/posts",
    "timestamp": "2025-07-04T12:23:56Z"
  },
  {
    "title": "Altcoins XRP, SOL, DOGE Slump as Trump Reignites Trade Tensions, Passes ‘Big, Beautiful Bill’",
    "description": "Altcoins are down after U.S. President Donald Trump announced plans to send letters to trading partners setting out tariff rates.",
    "link": "https://decrypt.co/328596/altcoins-xrp-sol-doge-slump-as-trump-reignites-trade-tensions-passes-big-beautiful-bill",
    "timestamp": "2025-07-04T12:23:19Z"
  },
  {
    "title": "Trump says tariff rates could be up to 70% as letters ship out",
    "description": "As the 9 July tariff deadline looms, US President Donald Trump has said that rates could be up to 70% for certain counties.",
    "link": "https://www.finextra.com/newsarticle/46251/trump-says-tariff-rates-could-be-up-to-70-as-letters-ship-out",
    "timestamp": "2025-07-04T12:22:25Z"
  },
  {
    "title": "UN atomic agency pulls inspectors out of Iran amid threats",
    "description": "Departure follows Tehran's suspension of cooperation with UN atomic agency and rising threats against IAEA leadership.",
    "link": "https://www.israelnationalnews.com/news/411144",
    "timestamp": "2025-07-04T12:22:14Z"
  },
  {
    "title": "American bombs in Iran also reverberate in China and North Korea",
    "description": "President Donald Trump campaigned on keeping the United States out of foreign wars, but it didn’t take long to convince him to come to the direct aid of Israel",
    "link": "https://abcnews.go.com/International/wireStory/american-bombs-iran-reverberate-china-north-korea-123476545",
    "timestamp": "2025-07-04T12:20:08Z"
  },
  {
    "title": "Trump Says White House Will Host a UFC Championship Fight as Part of U.S.’s 250th Anniversary Celebration",
    "description": "In 2026, as part of festivities surrounding the 250th anniversary of the signing of the Declaration of Independence, the White House will be home to a top-ranked UFC mixed martial arts fight, President Donald Trump said. “We’re gonna have a UFC fight, think o…",
    "link": "https://variety.com/2025/tv/news/trump-white-house-ufc-championship-fight-2026-america-250-1236447342/",
    "timestamp": "2025-07-04T12:19:36Z"
  },
  {
    "title": "If Poor Black, White People Unite, They’d Be An Unstoppable Force, But Here’s Why The Powers That Be Won’t Let Them",
    "description": "We need to understand that America's current racial political divisions did not happen naturally. People in power did not want Black and white people to work together. \nThe post If Poor Black, White People Unite, They’d Be An Unstoppable Force, But Here’s Why…",
    "link": "https://www.theroot.com/if-poor-black-white-people-unite-theyd-be-an-unstoppa-if-poor-black-white-people-united-theyd-be-an-unstoppable-force",
    "timestamp": "2025-07-04T12:18:48Z"
  },
  {
    "title": "Slate Auto's budget EV truck jumps above $20,000 as Trump's bill ends federal tax credits",
    "description": "There's been plenty of excitement surrounding the Slate Truck, the first vehicle from the Jeff Bezos-backed Slate Auto. Thanks to its no-frills design, including plastic body panels, a lack of touchscreen, radio, or Bluetooth, and other stripped-down elements…",
    "link": "https://www.techspot.com/news/108560-slate-auto-budget-ev-truck-jumps-above-20000.html",
    "timestamp": "2025-07-04T12:18:00Z"
  },
  {
    "title": "Donald Trump Gets Polling Boost From Hispanics",
    "description": "A YouGov/Yahoo poll shows Trump's net approval rating among Hispanic voters at -30 points, up 7 points from the previous month.",
    "link": "https://biztoc.com/x/6aeeb3d22cebf8f1",
    "timestamp": "2025-07-04T12:17:04Z"
  },
  {
    "title": "Donald Trump Gets Polling Boost From Hispanics",
    "description": "A YouGov/Yahoo poll shows Trump's net approval rating among Hispanic voters at -30 points, up 7 points from the previous month.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-polls-hispanics-2094652",
    "timestamp": "2025-07-04T12:13:22Z"
  },
  {
    "title": "White House to host UFC fight, US President Donald Trump says - BBC",
    "description": "White House to host UFC fight, US President Donald Trump saysBBC Donald Trump: White House to host UFC event, says US PresidentBBC Donald Trump to Host UFC Fight on White House Grounds: What to KnowNewsweek Full 'Idiocracy': Trump's Bonkers Plan For White Hou…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178279316",
    "timestamp": "2025-07-04T12:12:45Z"
  },
  {
    "title": "Trump announces White House UFC fight",
    "description": "US President Donald Trump has announced plans to hold a UFC fight with up to 25,000 spectators at the White House next year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620991-trump-white-house-ufc/",
    "timestamp": "2025-07-04T12:12:35Z"
  },
  {
    "title": "Trump announces White House UFC fight",
    "description": "US President Donald Trump has announced plans to hold a UFC fight with up to 25,000 spectators at the White House next year Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/620991-trump-ufc-white-house/",
    "timestamp": "2025-07-04T12:12:35Z"
  },
  {
    "title": "Loving someone undocumented in Trump’s America",
    "description": "As ICE ramps up its crackdown, undocumented people and their loved ones face daily uncertainty, fear and the threat of being torn apart",
    "link": "https://www.dazeddigital.com/life-culture/article/68184/1/loving-someone-undocumented-in-trump-america-ice-immigration-crackdown?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=loving-someone-undocumented-in-trump-s-america",
    "timestamp": "2025-07-04T12:08:00Z"
  },
  {
    "title": "Red Sox players visit Trump at White House despite manager's previous disapproval",
    "description": "Members of the Boston Red Sox took advantage of an off day in Washington, D.C., to meet President Donald Trump in the White House on Thursday.",
    "link": "https://www.foxnews.com/sports/red-sox-players-visit-trump-white-house-despite-managers-previous-disapproval",
    "timestamp": "2025-07-04T12:07:26Z"
  },
  {
    "title": "Posthaste: Canadian dollar could hit 78 cents U.S. and sooner than expected, says Scotiabank analyst",
    "description": "The loonie has clocked a strong run over the last six months and more upside is expected as headwinds build for its U.S. counterpart",
    "link": "https://financialpost.com/news/canadian-dollar-could-hit-78-us-cents-scotiabank",
    "timestamp": "2025-07-04T12:06:28Z"
  },
  {
    "title": "Trump 'doesn't care' if abandoned GOP seats are won by Democrats: ex-senator",
    "description": "According to a former Republican lawmaker who fell out of favor with Donald Trump, walked away from his seat in the U.S. Senate and then saw a Democrat take his place, the president is unfazed by the GOP caucus taking another possible loss.In a deep dive into…",
    "link": "https://www.rawstory.com/trump-lost-gop-seats/",
    "timestamp": "2025-07-04T12:06:01Z"
  },
  {
    "title": "Crowd Laughs as Trump Makes Assassination Joke Over Loud Noises at Rally",
    "description": "President Donald Trump drew laughter from a rally crowd when he joked about being assassinated in response to some loud noises. Hours after the passage of his so-called “Big Beautiful Bill,” Trump held a rally at the  Iowa State Fairgrounds in Des Moines and …",
    "link": "https://www.mediaite.com/media/news/crowd-laughs-as-trump-makes-assassination-joke-over-loud-noises-at-rally/",
    "timestamp": "2025-07-04T12:03:34Z"
  },
  {
    "title": "New Book Takes A Look Back At Fire Island's Queer History",
    "description": "The limited-edition photo book “Safe/Haven” features 77 glorious pages of seemingly carefree gay life in 1950s New York.",
    "link": "https://www.huffpost.com/entry/safe-haven-book-fire-island-cherry-grove-queer-mecca_n_685b6222e4b0c3bb7b64d1ea",
    "timestamp": "2025-07-04T12:01:09Z"
  },
  {
    "title": "What Queer Americans Can Learn From Hungary",
    "description": "We believe that Hungary represents the kind of country Trump and his allies want the United States to become.\nThe post What Queer Americans Can Learn From Hungary appeared first on Autostraddle.",
    "link": "http://www.autostraddle.com/what-queer-americans-can-learn-from-hungary/",
    "timestamp": "2025-07-04T12:00:41Z"
  },
  {
    "title": "BRICS Envoys Flock to Rio",
    "description": "At the bloc’s annual summit, Brazil hopes to focus on economic development rather than anti-Western antagonism.",
    "link": "http://foreignpolicy.com/2025/07/04/brics-leaders-summit-brazil-rio-economics-climate-lula/",
    "timestamp": "2025-07-04T12:00:25Z"
  },
  {
    "title": "RFK Jr. Says We'll Soon Know What's Fueling The Autism Epidemic. His Prediction Is Wild.",
    "description": "He set a timeline of five months for identifying the growth of a disorder that has been heavily researched for decades across the globe.",
    "link": "https://www.huffpost.com/entry/rfk-autism-stud_n_6865369ce4b0a744f2dda771",
    "timestamp": "2025-07-04T12:00:20Z"
  },
  {
    "title": "Trump’s FBI Deputy Director Is A Podcaster Who Thinks The Election Was Stolen",
    "description": "“Folks, the FBI is at it again. I don’t trust these people at all,” the conspiracy theorist once wrote on social media.",
    "link": "https://www.huffpost.com/entry/dan-bongino-conspiracy-theories_n_6865393ee4b06a8312549a45",
    "timestamp": "2025-07-04T12:00:20Z"
  },
  {
    "title": "Let The Haters Hate: America Is Still The Greatest Country On Earth",
    "description": "Sometimes, it’s hard to disagree with the haters: America is not a good place anymore.",
    "link": "https://dailycaller.com/2025/07/04/mr-right-usa-independence-day-freedom-donald-trump/",
    "timestamp": "2025-07-04T12:00:03Z"
  },
  {
    "title": "Some international LGBTQ+ travelers pull back on U.S. trips: 'Why would I go there?'",
    "description": "Despite some pullbacks in corporate sponsorships, pride organizations across the U.S. said attendance is still strong.",
    "link": "https://www.cnbc.com/2025/07/04/travel-pride-lgbtq-united-states.html",
    "timestamp": "2025-07-04T12:00:01Z"
  },
  {
    "title": "More ICE Deaths 'Inevitable' as Detention Numbers Soar",
    "description": "This is set to become one of the deadliest years for deaths in ICE custody.",
    "link": "https://www.newsweek.com/ice-detention-center-migrant-deaths-rising-2093770",
    "timestamp": "2025-07-04T12:00:01Z"
  },
  {
    "title": "Ben Folds, Who Stepped Down From Kennedy Center One Minute After Trump Took Over, Releases Defiant Live Album With National Symphony Orchestra",
    "description": "After announcing his resignation as the first-ever artistic adviser to the National Symphony Orchestra in February, just one minute after President Donald Trump’s administrative regime change took hold at the Kennedy Center, Ben Folds has surprise-released th…",
    "link": "https://variety.com/2025/music/news/ben-folds-releases-defiant-live-album-trump-kennedy-center-1236447091/",
    "timestamp": "2025-07-04T12:00:00Z"
  },
  {
    "title": "Day 1,227 of WW3. After DonOld sent Pooty Poot a signal by suspending air defense deliveries to Ukraine, Pooty Poot signals back by launching massive attack on Kyiv during the Big Beautiful Phone Call. This is your Friday Ukraine War thread [News]",
    "description": "Day 1,227 of WW3. After DonOld sent Pooty Poot a signal by suspending air defense deliveries to Ukraine, Pooty Poot signals back by launching massive attack on Kyiv during the Big Beautiful Phone Call. This is your Friday Ukraine War thread",
    "link": "https://www.fark.com/comments/13729526/Day-1227-of-WW3-After-DonOld-sent-Pooty-Poot-a-signal-by-suspending-air-defense-deliveries-to-Ukraine-Pooty-Poot-signals-back-by-launching-massive-attack-on-Kyiv-during-Big-Beautiful-Phone-Call-This-is-your-Friday-Ukraine-War-thread",
    "timestamp": "2025-07-04T12:00:00Z"
  },
  {
    "title": "EXCLUSIVE INVESTIGATION: ABC News Disaster! How Tarnished Brand Is Fighting to Put Out One Fire After Another",
    "description": "ABC News is battling to restore its tarnished brand while struggling to contain ongoing disasters.",
    "link": "https://radaronline.com/p/abc-news-battles-tarnished-brand-struggles-contain-disasters/",
    "timestamp": "2025-07-04T12:00:00Z"
  },
  {
    "title": "Americans Want a Feminist Future—But in Order to Make it Happen, We Have to Rethink Our Entire Political System",
    "description": "Donald Trump has insisted that he has a “mandate” from voters to peddle his wildly unpopular policies — and, apparently, to stop at nothing to enforce them. But in reality, Americans by and large want a feminist future.\nI talked to experts in gender and polit…",
    "link": "https://msmagazine.com/2025/07/04/first-episode-history-podcast-politics-women-president-trump-harris/",
    "timestamp": "2025-07-04T12:00:00Z"
  },
  {
    "title": "International Insider: Glastonbury Firestorm; Paramount’s Trump Deal; Corden Studio Loses Backer",
    "description": "Hello, all. It’s Insider time. Jesse Whittock here from a cooling London that was earlier this week among the hottest places on Earth. All the big international TV and film news to follow. Let’s begin. Sign up for the newsletter here. Glastonbury Firestorm Fa…",
    "link": "http://deadline.com/2025/07/international-insider-glastonbury-firestorm-1236447690/",
    "timestamp": "2025-07-04T12:00:00Z"
  },
  {
    "title": "Trump touts 'very popular' domestic policy bill ahead of White House signing",
    "description": "President Trump's sweeping domestic policy bill passes Congress with tax cuts, immigration measures, and Medicaid restructuring, despite polls showing most Americans oppose the package.",
    "link": "https://www.foxnews.com/politics/trump-touts-very-popular-domestic-policy-bill-ahead-white-house-signing",
    "timestamp": "2025-07-04T11:58:09Z"
  },
  {
    "title": "Middle East in Crisis. M. K. Bhadrakumar",
    "description": "Trump’s options are limited. He is insisting that the air strikes of June 22 “obliterated” Iran’s nuclear sites. That is to say, the Iranian bomb is no longer a compelling reality. \nThe post Middle East in Crisis. M. K. Bhadrakumar appeared first on Global Re…",
    "link": "https://www.globalresearch.ca/middle-east-crisis-m-k-bhadrakumar/5893835",
    "timestamp": "2025-07-04T11:58:04Z"
  },
  {
    "title": "Macron to co-chair Ukraine talks with Europe leaders while in UK: Elysee",
    "description": "President Emmanuel Macron and British Prime Minister Keir Starmer will during the French leader’s visit next week to the UK co-chair talks with other European leaders on boosting Ukraine’s defences, the Elysee Palace said on Friday. “There will certainly be a…",
    "link": "https://www.digitaljournal.com/world/macron-to-co-chair-ukraine-talks-with-europe-leaders-while-in-uk-elysee/article",
    "timestamp": "2025-07-04T11:57:19Z"
  },
  {
    "title": "Kiev can’t turn tide on battlefield – spy chief",
    "description": "Ukraine’s top military intelligence official Kirill Budanov has admitted Kiev is unable to reverse Russian military gains Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620990-budanov-lost-territories-talks/",
    "timestamp": "2025-07-04T11:57:15Z"
  },
  {
    "title": "Will Bibi Ask Trump to Nuke Iran? Ritter Says “Yes.” Mike Whitney",
    "description": "You can usually tell which side won a war by simply observing ‘what happens’ after the hostilities end. Following the announcement of a ceasefire between Iran and Israel, millions of Iranians poured onto the streets of Tehran, chanting patriotic songs …\nThe p…",
    "link": "https://www.globalresearch.ca/bibi-ask-trump-nuke-iran-ritter-says-yes/5893791",
    "timestamp": "2025-07-04T11:56:53Z"
  },
  {
    "title": "EU-US trade talks: Crunch time looms with no deal in sight",
    "description": "EU and US negotiators are attempting to finalize a deal on tariffs before an impending deadline on July 9. Experts say a no-deal scenario is possible.",
    "link": "https://www.dw.com/en/eu-us-trade-talks-crunch-time-looms-with-no-deal-in-sight/a-73151994",
    "timestamp": "2025-07-04T11:56:00Z"
  },
  {
    "title": "Trump tariffs: Crunch time looms in US-EU trade talks with no deal in sight",
    "description": "EU and US negotiators are attempting to finalize a deal on tariffs before an impending deadline on July 9. Experts say a no-deal scenario is possible.",
    "link": "https://www.dw.com/en/trump-tariffs-crunch-time-looms-in-us-eu-trade-talks-with-no-deal-in-sight/a-73151994",
    "timestamp": "2025-07-04T11:56:00Z"
  },
  {
    "title": "Texas braces for impact of Medicaid funding cuts and new rules",
    "description": "In Texas, Medicaid covers a third of all children, half of all pregnant women, the elderly in long-term care, and the disabled. Critics say new requirements in the bill will disrupt lives, while supporters argue it will prevent people from scamming the system.",
    "link": "https://www.click2houston.com/news/local/2025/07/04/texas-braces-for-impact-of-medicaid-funding-cuts-and-new-rules/",
    "timestamp": "2025-07-04T11:55:51Z"
  },
  {
    "title": "Trump's Vietnam pact takes aim at China — but it raises more questions than answers",
    "description": "U.S. President Donald Trump announced a trade pact with Vietnam on Wednesday, but its scant details have left economists wondering about what it would mean for the flow of Chinese goods rerouted through the country.\nTrump said Wednesday there would be a 20% t…",
    "link": "https://biztoc.com/x/746d60ea67e1b6d2",
    "timestamp": "2025-07-04T11:54:59Z"
  },
  {
    "title": "In Today’s GOP, There Is No Choice at All",
    "description": "The so-called Big Beautiful Bill was always destined to pass, and it’s instructive to realize why: for Republican lawmakers, this was an up-or-down vote on President Donald Trump. \nThe sprawling measure — which at its core was really one big, beautiful tax ex…",
    "link": "https://biztoc.com/x/c757e5c983e1c899",
    "timestamp": "2025-07-04T11:54:50Z"
  },
  {
    "title": "Exclusive—Rep. Jason Smith: This Fourth of July, Americans Celebrate the Largest Tax Cut in History",
    "description": "This July 4th, President Trump is signing not just a bill, but a promise kept – a declaration that the American people will once again chart their own destiny and will not allow ourselves to be defined by decline or defeat.\nThe post Exclusive—Rep. Jason Smith…",
    "link": "https://www.breitbart.com/politics/2025/07/04/exclusive-rep-jason-smith-this-fourth-of-july-americans-celebrate-the-largest-tax-cut-in-history/",
    "timestamp": "2025-07-04T11:50:09Z"
  },
  {
    "title": "Zelenskyy’s attire divides Polymarket with $79M at stake",
    "description": "Initial ruling of “yes” on 24 June appearance has been formally challenged. Debate centres on lack of tie, trainers, and formality of attire. Background includes past bet confusion and political pressure from Trump. Ukrainian President Volodymyr Zelenskyy’s a…",
    "link": "https://coinjournal.net/news/zelenskyys-attire-divides-polymarket-with-79m-at-stake/",
    "timestamp": "2025-07-04T11:48:08Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to America’s holiday: the Fourth of July, 2025, also known as Independence Day. As Wikipedia notes, the holiday. . . . . . . commemorates the ratification of the Declaration of Independence by the Second Continental Congress on July 4, 1776, establish…",
    "link": "https://whyevolutionistrue.com/2025/07/04/friday-hili-dialogue-533/",
    "timestamp": "2025-07-04T11:45:09Z"
  },
  {
    "title": "With Environmental Regulatory Reform, California Gov. Gavin Newsom Finally Does Something Substantial",
    "description": "Gov. Gavin Newsom isn't afraid to step into the political fray when it comes to standing up to President Donald Trump over national issues that impact California. He's not always wrong when he sues the administration or speaks out against, say, ICE raids in L…",
    "link": "https://biztoc.com/x/25a2915ae91adf59",
    "timestamp": "2025-07-04T11:44:09Z"
  },
  {
    "title": "2028 Primary: Gavin Newsom to Test Presidential Waters in Rural South Carolina",
    "description": "California Gov. Gavin Newsom is wasting no time in testing the waters for a presidential run in 2028, planning a visit next week to rural South Carolina, hoping to find a warm reception among poor, black voters.\nThe post 2028 Primary: Gavin Newsom to Test Pre…",
    "link": "https://www.breitbart.com/politics/2025/07/04/2028-primary-gavin-newsom-to-test-presidential-waters-in-rural-south-carolina/",
    "timestamp": "2025-07-04T11:43:52Z"
  },
  {
    "title": "Trump Takes Victory Lap After House Passes His Spending Bill",
    "description": "President Donald Trump took a victory lap after the passage of his so-called “Big Beautiful Bill” while also lashing out at Democrats for opposing it. \"They wouldn't vote only because they hate Trump but I hate them too,\" he said at a rally in Iowa. After wee…",
    "link": "https://biztoc.com/x/6fab4808b42bf407",
    "timestamp": "2025-07-04T11:43:46Z"
  },
  {
    "title": "Fourth of July: Songs that celebrate, define the essence of America",
    "description": "From sea to shining sea, music has defined how Americans see themselves -- and their country. On the Fourth of July, these songs and artists have captured the essence of the United States.",
    "link": "https://www.wpxi.com/news/trending/fourth-july-songs-that-celebrate-define-essence-america/OI4S3WR7DNFCHFVK6JTMLKVMBU/",
    "timestamp": "2025-07-04T11:41:03Z"
  },
  {
    "title": "Are Starbucks, McDonalds, Dunkin’ Donuts, Walmart open on July 4 in US? Check details",
    "description": "July 4 US holiday: Americans are gearing up to celebrate July 4, Independence Day in US. Many national retailers, grocery stores and restaurant chains will be open on the Fourth of July, however banks, post offices, and the stock market will be closed. Are St…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-july-4-federal-holiday-are-starbucks-mcdonalds-dunkin-donuts-walmart-open-on-july-4-in-us-check-details/articleshow/122249781.cms",
    "timestamp": "2025-07-04T11:36:34Z"
  },
  {
    "title": "Russia Brushes Off Talks, Launches Largest Assault On Ukraine",
    "description": "The Kremlin said on Friday that it sees no immediate diplomatic way out of the war in Ukraine, hours after launching its largest ever drone and missile barrage of the invasion.",
    "link": "https://www.ibtimes.com.au/russia-brushes-off-talks-launches-largest-assault-ukraine-1859534",
    "timestamp": "2025-07-04T11:36:31Z"
  },
  {
    "title": "Hegseth 'blindsided' State Dept. with weapons claim: NBC",
    "description": "Defense Secretary Pete Hegseth is reportedly the one responsible for halting aid to Ukraine, blindsiding the U.S. State Department. According to NBC News, no one, including members of Congress, officials in Kyiv, and allies in Europe, knew that the allocated …",
    "link": "https://www.rawstory.com/pete-hegseth-ukraine-2672629787/",
    "timestamp": "2025-07-04T11:36:02Z"
  },
  {
    "title": "Donald Trump's team sound alarm over president's health after 6 worrying signs - NewsBreak",
    "description": "Members of Donald Trump's inner circle have said they 'don’t think he’s in good physical health' as several White House insiders have pointed to key behavi",
    "link": "https://www.newsbreak.com/share/4088939814186-donald-trump-s-team-sound-alarm-over-president-s-health-after-6-worrying-signs?s=a2&amp;share_destination_id=MzA3ODg1MTc3LTE3NTE2Mjg4OTA2Nzc%3D&amp;pd=0KpqzxIY&amp;hl=en_US&amp;send_time=1751628890&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v8%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_recall_exp_25q3-v3",
    "timestamp": "2025-07-04T11:35:24Z"
  },
  {
    "title": "Trump shows his dominance over Congress in passing the 'big, beautiful bill' (NBC News)",
    "description": "NBC News:\nTrump shows his dominance over Congress in passing the ‘big, beautiful bill’  —  President Donald Trump, assisted by Vice President JD Vance, remained in talks with lawmakers throughout the week to coax them into voting for the legislation.  —  WASH…",
    "link": "https://www.memeorandum.com/250704/p11",
    "timestamp": "2025-07-04T11:35:01Z"
  },
  {
    "title": "Germany considers buying US air defence systems for Ukraine",
    "description": "Germany was exploring the possibility of purchasing more Patriot air defence systems from the United States for Ukraine, a government spokesman said Friday, as Russia intensifies its aerial attacks.",
    "link": "https://www.thelocal.de/20250704/germany-considering-buying-us-air-defence-systems-for-ukraine",
    "timestamp": "2025-07-04T11:34:40Z"
  }
]