[
  {
    "title": "Bears tighten grip on the markets, indices record biggest weekly fall in 2025",
    "description": "Market capitalisation worth nearly ₹9 lakh crore wiped out in biggest weekly fall of 2025, driven by bearish sentiments.",
    "link": "https://www.thehindubusinessline.com/markets/bears-tighten-grip-on-the-markets-indices-record-biggest-weekly-fall-in-2025/article69275257.ece",
    "timestamp": "2025-02-28T13:34:03Z"
  },
  {
    "title": "North Korea tests strategic missiles (PHOTOS)",
    "description": "Pyongyang has said the launch drill is a warning to “enemies” who are violating the country’s security Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613431-north-korea-missile-test/",
    "timestamp": "2025-02-28T13:33:22Z"
  },
  {
    "title": "James Cameron Calls Donald Trump’s Re-Election ‘Horrifying’ - Rolling Stone",
    "description": "James Cameron Calls Donald Trump’s Re-Election ‘Horrifying’Rolling Stone James Cameron says US under Trump is ‘horrifying’ as he becomes New Zealand citizenThe Guardian James Cameron's New Zealand Citizenship Is \"Imminent\" Amid Trump TermDeadline James Camero…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176569485",
    "timestamp": "2025-02-28T13:33:22Z"
  },
  {
    "title": "Meta's leak problem just cost 20 employees their jobs, with more firings expected",
    "description": "Zuckerberg highlighted the problem of company leaks during an all-hands meeting last month. Ironically, his rant leaked online almost immediately.Read Entire Article",
    "link": "https://www.techspot.com/news/106965-meta-leak-problem-cost-20-employees-their-jobs.html",
    "timestamp": "2025-02-28T13:33:00Z"
  },
  {
    "title": "Social Security Administration could cut up to 50% of its workforce",
    "description": "Advocates warn that layoffs will reduce the agency’s ability to serve recipients in a timely manner.",
    "link": "https://www.denverpost.com/2025/02/28/social-security-layoffs-doge/",
    "timestamp": "2025-02-28T13:32:02Z"
  },
  {
    "title": "Doug Ford's PCs win third majority government — Crombie loses in her riding",
    "description": "Doug Ford's Progressive Conservatives chugged to a third majority government on Thursday, propelled by his visible crusade against economic uncertainty emanating from the U.S., though falling short of the increased majority he urged.",
    "link": "https://www.nationalobserver.com/2025/02/28/news/doug-ford-pc-win-third-majority-government-crombie-loses-seat",
    "timestamp": "2025-02-28T13:31:53Z"
  },
  {
    "title": "House Judiciary GOP X account slammed for ‘morally bankrupt’ Epstein ‘Rickroll’ prank",
    "description": "The X account of the House Judiciary Committee Republicans has been widely condemned for pranking users with a link it claimed contained the Epstein client list, however, but was actually a Rick Astley music video. Jeffery Epstein, an American financier, was …",
    "link": "https://www.thepinknews.com/2025/02/28/epstein-files-rickroll-gop-house-judiciary/",
    "timestamp": "2025-02-28T13:30:49Z"
  },
  {
    "title": "EPSTEIN FILES TODAY: AG Pam Bondi Announces Thursday Release As 250 Victim Names Redacted",
    "description": "Attorney General Pam Bondi announced on Wednesday evening that she's going to release DOJ files on dead pedophile Jeffrey Epstein.",
    "link": "https://www.shtfplan.com/headline-news/epstein-files-today-ag-pam-bondi-announces-thursday-release-as-250-victim-names-redacted",
    "timestamp": "2025-02-28T13:30:24Z"
  },
  {
    "title": "'I can't believe I said that': Donald Trump health fears reignited after his remarks on Zelenskyy",
    "description": "US President Donald Trump claimed he can't remember calling Volodymyr Zelensky a dictator as he greeted Keir Starmer to the White House. Asked by a reporter is he still thought that Zelensky was a dictator after making the claim against the Ukrainian leader, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-calls-volodymyr-zelenskyy-dictator-i-cant-believe-i-said-that-donald-trump-health-fears-reignited-after-his-remarks-on-zelenskyy/articleshow/118630774.cms",
    "timestamp": "2025-02-28T13:29:07Z"
  },
  {
    "title": "Former leader of NATO nation slams President Trump in blunt interview: 'No longer an ally'",
    "description": "Former French President François Hollande asserts that President Donald Trump and his administration are \"no longer\" allies, saying a U.S.-Europe \"divorce\" could be on the horizon.",
    "link": "https://www.foxnews.com/world/former-leader-nato-nation-slams-president-trump-blunt-interview-no-longer-ally",
    "timestamp": "2025-02-28T13:27:58Z"
  },
  {
    "title": "Doug Ford's Ontario PCs cruise to victory as tariffs loom",
    "description": "Doug Ford's Progressive Conservatives won't have long to sit back and bask in the glow of winning a third majority government, with an imminent tariff threat around the corner.",
    "link": "https://www.nationalobserver.com/2025/02/28/news/doug-ford-ontario-pc-victory-tariffs",
    "timestamp": "2025-02-28T13:24:43Z"
  },
  {
    "title": "Epstein Files Release Sparks Rage, Disappointment: 'Nothing Juicy'",
    "description": "AG Pam Bondi has released the first phase of the \"Epstein Files,\" but they were nothing more than heavily-redacted lists and a blacked-out masseuse list as well as information that appears to have been previously released.",
    "link": "https://www.ibtimes.com.au/epstein-files-release-sparks-rage-disappointment-nothing-juicy-1856561",
    "timestamp": "2025-02-28T13:22:16Z"
  },
  {
    "title": "Neurotechnologies Enabling Remote Control of the Activity of Human Brains",
    "description": "A group of American conservative politicians issued a statement on June 3, 1997, titled “Project for the New American Century.” Among the signatories of this statement were ten members of the future American Bush administration, including Dick Cheney, Donald …",
    "link": "https://www.globalresearch.ca/declassification-neurotechnologies-enabling-remote-control-activity-human-brains/5881082",
    "timestamp": "2025-02-28T13:18:33Z"
  },
  {
    "title": "US to make $20 billion from Ukraine deal – Trump aide",
    "description": "The rare-earth minerals deal is expected to generate $20 billion for the US, Trump’s economic adviser, Kevin Hassett, says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613434-us-ukraine-deal-billions/",
    "timestamp": "2025-02-28T13:18:26Z"
  },
  {
    "title": "Canadian Lawmaker Spots How Trump's 'Rage' Has Fueled This Massive Political Shift",
    "description": "Charlie Angus thanked the U.S. president for doing Canada a \"favor\" in the face of \"pitchfork politics.\"",
    "link": "https://www.huffpost.com/entry/canadian-lawmaker-charlie-angus-conservative-party-trump-attacks_n_67c1963ae4b01834869f558d",
    "timestamp": "2025-02-28T13:18:08Z"
  },
  {
    "title": "Emmanuel Macron used every diplomatic trick in the book at the White House – but Trump writes his own rules",
    "description": "Trump’s diplomatic how-to guide boasts new chapters on the arts of bullying, harassment, gaslighting and, of course, the deal.",
    "link": "https://theconversation.com/emmanuel-macron-used-every-diplomatic-trick-in-the-book-at-the-white-house-but-trump-writes-his-own-rules-250832",
    "timestamp": "2025-02-28T13:16:48Z"
  },
  {
    "title": "White House spat with AP over ‘Gulf of America’ ignites fears for press freedom in second Trump era",
    "description": "The Trump administration has moved to control which journalists have access to the US president.",
    "link": "https://theconversation.com/white-house-spat-with-ap-over-gulf-of-america-ignites-fears-for-press-freedom-in-second-trump-era-251163",
    "timestamp": "2025-02-28T13:16:47Z"
  },
  {
    "title": "How to make a political Oscars speech that doesn’t flop – according to rhetorical theory",
    "description": "From the cold war to civil rights to Trump 2.0, award ceremonies have always been stages for activism.",
    "link": "https://theconversation.com/how-to-make-a-political-oscars-speech-that-doesnt-flop-according-to-rhetorical-theory-250949",
    "timestamp": "2025-02-28T13:16:46Z"
  },
  {
    "title": "Might Makes Right: Matt Duss on Trump's Foreign Policy Doctrine, from Ukraine to Gaza",
    "description": "We speak with foreign policy analyst Matt Duss about increasingly fraught relations between the United States and Ukraine, which have undergone a seismic shift under the second Trump administration. Ukrainian President Volodymyr Zelensky is meeting with Presi…",
    "link": "https://www.democracynow.org/2025/2/28/matt_duss_trump_admin_policy_ukraine",
    "timestamp": "2025-02-28T13:16:01Z"
  },
  {
    "title": "The Putinization of America...",
    "description": "The Putinization of America...\r\n\n \n \n \n (Second column, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:ZELENSKY IN WASHINGTON... DEVELOPING...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://dnyuz.com/2025/02/28/the-putinization-of-america/",
    "timestamp": "2025-02-28T13:10:36Z"
  },
  {
    "title": "'This is the problem!' CNN conservative ripped for defending Musk's conflict of interest",
    "description": "A Republican strategist drew heavy flak on \"CNN This Morning\" for defending tech billionaire Elon Musk's dual role as a government contractor and federal budget slasher.Donald Trump's megadonor-turned-close adviser posted on his X platform that Verizon's comm…",
    "link": "https://www.rawstory.com/elon-musk-conflict-of-interest-2671239499/",
    "timestamp": "2025-02-28T13:10:22Z"
  },
  {
    "title": "Europe’s leaders lined up to sway Trump on Ukraine - but did it work?",
    "description": "From Dáil speaking rights row to the German elections, it's your essential end-of-week politics catch-up",
    "link": "https://www.irishtimes.com/politics/2025/02/28/europes-leaders-lined-up-to-sway-trump-on-ukraine-but-did-it-work/",
    "timestamp": "2025-02-28T13:10:06Z"
  },
  {
    "title": "Outrage and protests in Iowa as lawmakers pass bill removing trans civil rights protections",
    "description": "Hundreds of Iowa residents have filled the Iowa Capitol building waving Pride flags to protest an anti-trans bill that seeks to remove gender identity as a protected class in the state’s civil rights act. Iowa House members voted 60-36 on Thursday to pass Sen…",
    "link": "https://www.thepinknews.com/2025/02/28/iowa-trans-bill-protests/",
    "timestamp": "2025-02-28T13:09:57Z"
  },
  {
    "title": "How to Turn an “Economic Blackout” Into an All-Out War on Corporate Power",
    "description": "Friday’s economic boycott is a one-day attack on corporate interests. The degrowth movement calls for a broader societal shift.\nThe post How to Turn an “Economic Blackout” Into an All-Out War on Corporate Power appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/02/28/no-buy-nothing-corporation-boycott-capitalism-degrowth/",
    "timestamp": "2025-02-28T13:09:34Z"
  },
  {
    "title": "Six major tech lawsuits to keep tabs on in 2025",
    "description": "Tech giants will head to court to address antitrust cases, data privacy, content moderation and copyright. These cases may set key legal precedents for the future of tech.",
    "link": "https://www.techtarget.com/whatis/feature/Major-tech-lawsuits-to-keep-tabs-on",
    "timestamp": "2025-02-28T13:08:00Z"
  },
  {
    "title": "The Tates and Trump's inner circle: How the deepening ties led to controversial influencers flying to freedom",
    "description": "On 7 November 2024, days after Donald Trump was elected president, Andrew Tate posted a prediction on X.",
    "link": "https://news.sky.com/story/the-tates-and-trumps-inner-circle-the-deepening-ties-that-led-to-the-controversial-influencers-flying-to-freedom-in-america-13318676",
    "timestamp": "2025-02-28T13:06:00Z"
  },
  {
    "title": "Meeting Cancellations Mount as Trump Administration Orders Take Effect",
    "description": "The Providence Warwick Convention & Visitors Bureau in Rhode Island received its first business meeting cancellation on January 27. The conference, A growing wave of meeting cancellations signals trouble for the business events industry. Providence is one des…",
    "link": "http://meetings.skift.com/2025/02/28/meeting-cancellations-mount-as-trump-administration-orders-take-effect/",
    "timestamp": "2025-02-28T13:05:52Z"
  },
  {
    "title": "Majority of US Republicans hostile to Zelensky – poll",
    "description": "The unfavorable perception of Zelensky among Republicans rose from 40% to 56% in just one week, according to an Economist/YouGov poll Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613442-majority-republicans-hostile-zelensky/",
    "timestamp": "2025-02-28T13:05:40Z"
  },
  {
    "title": "UK minister quits after Keir Starmer slashes aid to boost defense spending",
    "description": "Anneliese Dodds said it would be \"impossible to maintain\" support in Sudan, Ukraine and Gaza — and warned Russia may take advantage of the cuts.",
    "link": "https://www.politico.eu/article/uk-minister-anneliese-dodds-quit-keir-starmer-slashe-aid-boost-defense-spending/",
    "timestamp": "2025-02-28T13:05:01Z"
  },
  {
    "title": "How Elon Musk has lost £41,000,000,000 since the start of 2025",
    "description": "Elon Musk's net worth has plummeted by $52 billion (£41 billion) due to a worldwide slump in Tesla sales, however he remains the world's richest man.",
    "link": "https://www.ladbible.com/news/technology/elon-musk-tesla-stock-net-worth-decline-104028-20250228",
    "timestamp": "2025-02-28T13:03:50Z"
  },
  {
    "title": "India and EU commit to year-end deadline for a free trade pact, amid Trump tariff threats",
    "description": "India and the European Union have committed to finalizing a free trade agreement by year's end, aiming to mitigate impacts of U.S. tariff hikes. The deal, covering sectors like technology and green growth, demands significant concessions from both sides, with…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-and-eu-commit-to-year-end-deadline-for-a-free-trade-pact-amid-trump-tariff-threats/articleshow/118630385.cms",
    "timestamp": "2025-02-28T13:03:06Z"
  },
  {
    "title": "Trump Says Border Tariffs on Canada, Mexico Coming Into Force on March 4",
    "description": "President Donald Trump said his administration will go ahead with 25 percent tariffs on Canada and Mexico on March 4, saying the two countries have not done enough on drug smuggling.\nIn a post on his Truth Social platform on …\nThe post Trump Says Border Tarif…",
    "link": "https://www.globalresearch.ca/trump-border-tariffs-canada-mexico-march-4/5881096",
    "timestamp": "2025-02-28T13:02:19Z"
  },
  {
    "title": "UK's international development minister quits after foreign aid cut",
    "description": "The British Cabinet minister responsible for international development has quit in the wake of Prime Minister Keir Starmer’s decision earlier this week to ramp up defense spending by slashing the foreign aid budget",
    "link": "https://abcnews.go.com/International/wireStory/uks-international-development-minister-quits-after-foreign-aid-119285846",
    "timestamp": "2025-02-28T13:02:15Z"
  },
  {
    "title": "Live updates: Trump and Zelensky meeting devolves into shouting match over Ukraine war | CNN Politics",
    "description": "A meeting between President Donald Trump and President Volodymyr Zelensky devolved into a shouting match at the Oval Office today, with the US president berating Ukraine’s leader and Vice President JD Vance questioning whether Zelensky had demonstrated enough…",
    "link": "https://www.cnn.com/politics/live-news/trump-zelensky-news-02-28-25/index.html",
    "timestamp": "2025-02-28T13:01:39Z"
  },
  {
    "title": "Attempted Regime Change in Venezuela Incoming? Trump Cancels Chevron’s Oil License. “US Does No Need Venezuelan Oil”",
    "description": "Back in 2023, Trump was speaking at a press conference in North Carolina and said, \n“When I left, Venezuela was ready to collapse. We would have taken it over; we would have gotten all that oil.”  \nTrump’s Secretary of State, …\nThe post Attempted Regime Chang…",
    "link": "https://www.globalresearch.ca/venezuela-trump-cancels-chevron-oil-license/5881101",
    "timestamp": "2025-02-28T13:01:20Z"
  },
  {
    "title": "Independent Journalism Will Pay the Price as Trump and Musk Squash USAID",
    "description": "As President Trump and Elon Musk slash USAID funding, they argue that the money is wasted on hyper-progressive culture wars. This narrative absurdly misrepresents the strategic importance of USAID's work.\nThe post Independent Journalism Will Pay the Price as …",
    "link": "https://www.mediaite.com/opinion/independent-journalism-will-pay-the-price-as-trump-and-musk-squash-usaid/",
    "timestamp": "2025-02-28T13:00:46Z"
  },
  {
    "title": "Posthaste: Bank of Canada would freeze rate cuts on Trump blanket 25% tariffs, economists say",
    "description": "Policymakers, already burned by inflation, will hold off on rates cuts after March if widespread tariffs hit, says economist. Keep reading.",
    "link": "https://financialpost.com/news/bank-of-canada-freeze-rate-cuts-trump-blanket-25-tariffs",
    "timestamp": "2025-02-28T13:00:26Z"
  },
  {
    "title": "Robert Kennedy canceled the FDA & CDC meeting about this year’s flu shot",
    "description": "Here are a couple of photos of Robert Kennedy Jr. at President Elon Musk’s cabinet meeting this week. Kennedy is head of Health and Human Services, which gives him broad oversight over the Centers for Disease Control, the Administration for Strategic Prepared…",
    "link": "https://www.celebitchy.com/911305/robert_kennedy_canceled_the_fda_cdc_meeting_about_this_years_flu_shot/",
    "timestamp": "2025-02-28T13:00:12Z"
  },
  {
    "title": "Latin America Recalibrates After Trump’s Pivot to Russia",
    "description": "Washington has long criticized the region for its relations with Moscow. Now what?",
    "link": "https://foreignpolicy.com/2025/02/28/trump-russia-latin-america-ukraine-talks-brazil-lula-un/",
    "timestamp": "2025-02-28T13:00:07Z"
  },
  {
    "title": "International Insider: London’s New-Look TV Week; Charlotte Moore Shocker; Ukraine & Gaza In Spotlight",
    "description": "It’s that time of the week, Insiders. Jesse Whittock here to take you through the headlines from international film and TV. London’s Big TV Week A permanent alteration?: Since the London TV Screenings began in 2021, more and more international buyers have bee…",
    "link": "http://deadline.com/2025/02/international-insider-london-tv-screenings-mip-london-1236303617/",
    "timestamp": "2025-02-28T13:00:00Z"
  },
  {
    "title": "L.A. fire captain who fought California wildfires to attend joint address to Congress",
    "description": "Palisades and Eaton fire survivors still need help. That's the message California Sen. Alex Padilla hopes to send to Congress next week at President Donald Trump's first joint address.",
    "link": "https://www.nbcnews.com/politics/politics-news/la-fire-captain-california-wildfires-trump-joint-address-congress-rcna194150",
    "timestamp": "2025-02-28T13:00:00Z"
  },
  {
    "title": "Day 1,101 of WW3. UK reportedly willing to provide \"tripwire\" troops to support a Ukrainian peace deal. UAF can now jam orc glide bombs, and France forces Stinky to surrender on Zelenskyy visit to Washington. This is your Friday Ukraine War thread [News]",
    "description": "Day 1,101 of WW3. UK reportedly willing to provide \"tripwire\" troops to support a Ukrainian peace deal. UAF can now jam orc glide bombs, and France forces Stinky to surrender on Zelenskyy visit to Washington. This is your Friday Ukraine War thread",
    "link": "https://www.fark.com/comments/13579462/Day-1101-of-WW3-UK-reportedly-willing-to-provide-tripwire-troops-to-support-a-Ukrainian-peace-deal-UAF-can-now-jam-orc-glide-bombs-France-forces-Stinky-to-surrender-on-Zelenskyy-visit-to-Washington-This-is-your-Friday-Ukraine-War-thread",
    "timestamp": "2025-02-28T13:00:00Z"
  },
  {
    "title": "Germany will seek to revive relations with France and Poland",
    "description": "Friedrich Merz, Germany's likely next head of government, is already trying to shape foreign policy. He is especially concerned about Germany's ailing relationships with France and Poland.",
    "link": "https://www.dw.com/en/germany-will-seek-to-revive-relations-with-france-and-poland/a-71782855",
    "timestamp": "2025-02-28T12:59:00Z"
  },
  {
    "title": "Donald Trump leaves UK Prime Minister Keir Starmer speechless with shocking Russia question; here's what it is",
    "description": "UK Prime Minister Keir Starmer was left speechless by a sudden shocking interjection by US President Donald Trump which included a curt question about a hypothetical situation if the UK could take on Russia all by themselves",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-leaves-uk-prime-minister-keir-starmer-speechless-with-shocking-russia-question-heres-what-it-is/articleshow/118630229.cms",
    "timestamp": "2025-02-28T12:58:43Z"
  },
  {
    "title": "Donald Trump family educational qualification: Which colleges did his parents, siblings and kids go to?",
    "description": "This article explores the educational backgrounds of Donald Trump's family members, from his parents to his grandchildren. It highlights his father, Fred Trump's early influence, and his mother's Scottish roots. The piece also covers the educational paths of …",
    "link": "https://timesofindia.indiatimes.com/education/news/donald-trump-family-educational-qualification-which-colleges-did-his-parents-siblings-and-kids-go-to/articleshow/118628262.cms",
    "timestamp": "2025-02-28T12:55:45Z"
  },
  {
    "title": "'That's Enough': Trump Interjects As Keir Starmer Answers Question On Canada",
    "description": "The two leaders held a joint press conference following their meeting at the White House.",
    "link": "https://www.huffpost.com/entry/trump-interjects-keir-starmer-canada_n_67c18b56e4b01834869f5146",
    "timestamp": "2025-02-28T12:54:00Z"
  },
  {
    "title": "Voltaire, International Newsletter N°122",
    "description": "Voltaire, International Newsletter is a weekly newsletter on international politics. It features 10 to 15 pages of contextualized, sourced news items. Its aim is to enable you to follow the decline of the unipolar world and the emergence of a multipolar syste…",
    "link": "https://www.voltairenet.org/article221874.html",
    "timestamp": "2025-02-28T12:53:46Z"
  },
  {
    "title": "People are convinced Trump can’t read after he hands back King Charles letter to Keir Starmer",
    "description": "People are convinced that US president Donald Trump can’t read after he asked UK prime minister Keir Starmer to read a letter from King Charles III out loud to him. During the prime minister’s visit to the White House, Starmer handed a letter to Trump in the …",
    "link": "https://www.thepinknews.com/2025/02/28/king-charles-letter-to-trump/",
    "timestamp": "2025-02-28T12:52:57Z"
  },
  {
    "title": "Musk calls Vance ‘future president’",
    "description": "Elon Musk said Friday that US Vice President JD Vance will one day follow in his boss Donald Trump’s footsteps as “future president.” “Best VP ever and our future President,” tech billionaire Musk posted on his social media platform X. Musk, the world’s riche…",
    "link": "https://punchng.com/musk-calls-vance-future-president/",
    "timestamp": "2025-02-28T12:45:29Z"
  },
  {
    "title": "Chaos Is Bad for Business (Paul Krugman)",
    "description": "Paul Krugman:\nChaos Is Bad for Business  —  Ignorance, megalomania and the economic future  —  Early this month Donald Trump announced that he was about to impose 25 percent tariffs on Canada and Mexico.  Then he put them on pause for 30 days.  So are they on…",
    "link": "https://www.memeorandum.com/250228/p18",
    "timestamp": "2025-02-28T12:40:01Z"
  },
  {
    "title": "Kash Patel Wants To Bring UFC In To Train FBI Agents",
    "description": "Kash Patel wants to bring in trainers from the Ultimate Fighting Championship to beef up agents' martial arts and self-defense skills. Huh. This is what we ladies think of as \"classic small dick energy,\" where height-deficient underachievers like Kash and Dan…",
    "link": "https://crooksandliars.com/2025/02/kash-patel-wants-bring-ufc-train-fbi",
    "timestamp": "2025-02-28T12:37:00Z"
  },
  {
    "title": "Iran Tried To Put A Bullet In My Head Because I Support The West’s Pressure Against The Regime",
    "description": "Trump has correctly adopted a maximum pressure policy. The United Kingdom, the European Union, and its member states should follow suit.",
    "link": "https://thefederalist.com/2025/02/28/iran-tried-to-put-a-bullet-in-my-head-because-i-support-the-wests-pressure-against-the-regime/",
    "timestamp": "2025-02-28T12:36:22Z"
  },
  {
    "title": "Adoption Is The Pro-Life Antidote To The IVF Onslaught",
    "description": "In addition to educating Americans on the major ethical problems with IVF, pro-lifers need to offer a solution to the many couples who want to have children but are not able to do so.",
    "link": "https://thefederalist.com/2025/02/28/adoption-is-the-pro-life-antidote-to-the-ivf-onslaught/",
    "timestamp": "2025-02-28T12:36:15Z"
  },
  {
    "title": "Russia offers to restore direct air links with the US, during Istanbul talks",
    "description": "Russia’s Foreign Ministry says it has suggested restoring direct air links between Russia and the United States during the latest round of consultations with Washington",
    "link": "https://abcnews.go.com/Business/wireStory/russia-offers-restore-direct-air-links-us-istanbul-119285387",
    "timestamp": "2025-02-28T12:35:46Z"
  },
  {
    "title": "Canada should seek nuclear protection against US – ex-FM",
    "description": "European nuclear powers could protect Canada against possible US threats, Former Foreign Minister Chrystia Freeland has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613432-canada-nuclear-umbrella-freeland/",
    "timestamp": "2025-02-28T12:35:20Z"
  },
  {
    "title": "Congress Must Crack Down On The Improper Payments That Cost Your Family $14,000 Every 10 Years",
    "description": "In the last decade alone, the federal government has sent $1.9 trillion of improper payments to the wrong people in the wrong amounts.",
    "link": "https://thefederalist.com/2025/02/28/time-to-end-big-governements-improper-payments-that-cost-you-14000-every-10-years/",
    "timestamp": "2025-02-28T12:34:32Z"
  },
  {
    "title": "Zelensky, Trump to sign minerals deal at White House",
    "description": "Donald Trump has agreed to host Ukrainian President Volodymyr Zelensky at the White House to sign a deal allowing the US access to Ukraine's rare minerals. This move comes after Trump initially criticized Zelensky, calling him a 'dictator.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-trump-to-sign-minerals-deal-at-white-house/articleshow/118629784.cms",
    "timestamp": "2025-02-28T12:34:27Z"
  },
  {
    "title": "Economic blackout: Will a 24-hour boycott make a difference?",
    "description": "Here are some details about the various events and experts' thoughts on whether having consumers keep their wallets closed is an effective tool for influencing the positions corporations take.",
    "link": "https://roanoke.com/news/nation-world/business/economy/article_de5211f5-6a21-5c41-8c90-df0994e1dd43.html",
    "timestamp": "2025-02-28T12:30:00Z"
  },
  {
    "title": "Every celebrity named in new Jeffrey Epstein files as first batch of documents are released",
    "description": "Every big name mentioned in the first phase of Jeffrey Epstein's files has been revealed",
    "link": "https://www.ladbible.com/news/us-news/jeffrey-epstein-files-phase-1-release-celebrities-315735-20250228",
    "timestamp": "2025-02-28T12:29:15Z"
  },
  {
    "title": "Economic Blackout day: Here’s what to know about the shopping boycott, protest",
    "description": "A grassroots organization is encouraging U.S. residents not to spend any money Friday as an act of “economic resistance.”",
    "link": "https://www.pennlive.com/business/2025/02/economic-blackout-day-heres-what-to-know-about-the-shopping-boycott-protest.html",
    "timestamp": "2025-02-28T12:27:10Z"
  },
  {
    "title": "Trump backpedals Zelenskyy ‘dictator’ comment ahead of meeting",
    "description": "As President Donald Trump is set to meet with Ukrainian president Volodymyr Zelenskyy to broker a deal to end the war overseas and give the United States access to their rare earth minerals, Trump backpedals on his combative comments, including calling Zelens…",
    "link": "https://www.today.com/video/trump-set-to-meet-with-zelenskyy-to-broker-peace-mineral-deal-233165893900",
    "timestamp": "2025-02-28T12:25:30Z"
  },
  {
    "title": "In India-EU Talks, Free Trade Pact Gets Deadline, Europe Corridor Gets Push",
    "description": "India and the European Union have set a year-end deadline for a historic free trade agreement, which has been in the works for quite a few years.",
    "link": "https://www.ndtv.com/world-news/in-india-eu-talks-free-trade-pact-gets-deadline-europe-corridor-gets-push-7816463",
    "timestamp": "2025-02-28T12:25:14Z"
  },
  {
    "title": "Jeffrey Epstein’s star-studded contact list unveiled: Justice Department's released files reveal big celebrity connections",
    "description": "Newly released files from the U.S. Justice Department reveal high-profile names linked to Jeffrey Epstein, including Michael Jackson, Alec Baldwin, Naomi Campbell, Mick Jagger, and Prince Andrew. Although none have been charged with crimes related to Epstein,…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/jeffrey-epsteins-star-studded-contact-list-unveiled-justice-departments-released-files-reveal-big-celebrity-connections/articleshow/118629403.cms",
    "timestamp": "2025-02-28T12:24:46Z"
  },
  {
    "title": "Tariff hammer drops! Donald Trump blames China for drug crisis in U.S, hits back hard with double tariffs in latest salvo; stock markets tank",
    "description": "US President Donald Trump announced tariffs on imports from Canada, Mexico, and China will start on March 4, attributing the measure to combat drugs entering the US. The economic impacts are already felt in rising consumer concerns and stock market shakiness.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tariff-hammer-drops-donald-trump-blames-china-for-drug-crisis-in-u-s-hits-back-hard-with-double-tariffs-in-latest-salvo-stock-markets-tank/articleshow/118628647.cms",
    "timestamp": "2025-02-28T12:20:42Z"
  },
  {
    "title": "Tatum O’Neal’s abusive father Ryan O’Neal cut her out of his will",
    "description": "Tatum O’Neal covers the latest issue of Variety. I didn’t realize that Tatum is in such poor health these days. She overdosed in 2020 and suffered a stroke, and five years later, she’s still walking with a cane and she has noticeable memory lapses. She’s 61 y…",
    "link": "https://www.celebitchy.com/911288/tatum_oneals_abusive_father_ryan_oneal_cut_her_out_of_his_will/",
    "timestamp": "2025-02-28T12:20:28Z"
  },
  {
    "title": "Trump to host Zelenskyy; foreign aid freeze heads to the Supreme Court",
    "description": "Follow live updates as President Donald Trump receives Ukraine's Volodymyr Zelenskyy at the White House and the foreign aid freeze appeal is due at the Supreme Court.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-zelenskyy-russia-ukraine-white-house-live-updates-rcna193942",
    "timestamp": "2025-02-28T12:18:37Z"
  },
  {
    "title": "Musk Calls JD Vance As \"Best VP Ever And Future President\" Of US",
    "description": "Elon Musk said Friday that US Vice President JD Vance will one day follow in his boss Donald Trump&#039;s footsteps as &quot;future president.&quot;",
    "link": "https://www.ndtv.com/world-news/musk-calls-jd-vance-as-best-vp-ever-and-future-president-of-us-7816404",
    "timestamp": "2025-02-28T12:18:13Z"
  },
  {
    "title": "Transcript: Trump Hit by Brutal Poll as Panicked GOPers Nix Town Halls",
    "description": "The following is a lightly edited transcript of the February 28 episode of The Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent. \r\nPres…",
    "link": "https://newrepublic.com/article/192129/transcript-trump-hit-brutal-poll-panicked-gopers-nix-town-halls",
    "timestamp": "2025-02-28T12:17:16Z"
  },
  {
    "title": "British Drugmaker GSK Abandons Diversity Targets Following Trump Pressure",
    "description": "British drugmaker GSK will no longer set diversity targets, it said on Thursday, as it became the latest company to scale back or abandon such goals in response to the U.S. president’s opposition to them. President Donald Trump has issued …",
    "link": "https://www.insurancejournal.com/news/international/2025/02/28/813758.htm",
    "timestamp": "2025-02-28T12:16:25Z"
  },
  {
    "title": "Trump calls for ‘ceasefire now’ between Russia and Ukraine",
    "description": "Zelenskyy says Ukraine won’t enter peace talks with Russia until it has security guarantees.",
    "link": "https://www.denverpost.com/2025/02/28/trump-zelenskyy-meet-minerals-russia/",
    "timestamp": "2025-02-28T12:16:25Z"
  },
  {
    "title": "Skipping your tax return due to IRS cutbacks? Here’s why that could cost you big time",
    "description": "Skipping Your Tax Return due to IRS cutbacks? Think again. As the IRS faces budget cuts and layoffs, some taxpayers believe they can avoid filing this season. However, penalties for not filing can be severe, with fines reaching up to 25% of unpaid taxes. Expe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-tax-return-penalties-cutbacks/articleshow/118628884.cms",
    "timestamp": "2025-02-28T12:15:01Z"
  },
  {
    "title": "Crypto Daybook Americas: Bitcoin Meltdown Worsens as Macro Jitters Overshadow Positives",
    "description": "The day ahead in crypto: Feb. 28, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/02/28/crypto-daybook-americas-bitcoin-meltdown-worsens-as-macro-jitters-overshadow-positives",
    "timestamp": "2025-02-28T12:15:00Z"
  },
  {
    "title": "US District Judge William Alsup: \"'OPM does not have any authority whatsoever, under any statute in the history of the universe,' to hire or fire any employees but its own\" [Obvious]",
    "description": "US District Judge William Alsup: \"'OPM does not have any authority whatsoever, under any statute in the history of the universe,' to hire or fire any employees but its own\"",
    "link": "https://www.fark.com/comments/13579222/US-District-Judge-William-Alsup-OPM-does-not-have-any-authority-whatsoever-under-any-statute-in-history-of-universe-to-hire-fire-any-employees-but-its-own",
    "timestamp": "2025-02-28T12:15:00Z"
  },
  {
    "title": "Crypto prices tumble as Trump-fuelled euphoria fades",
    "description": "Cryptocurrency prices are down sharply in recent weeks and not expected to rebound soon, with some of the biggest digital currencies erasing nearly all of the gains they made after Donald Trump's election win triggered a wave of excitement across the industry.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-prices-tumble-as-trump-fuelled-euphoria-fades/articleshow/118629325.cms",
    "timestamp": "2025-02-28T12:12:25Z"
  },
  {
    "title": "Bitcoin hits three-month low",
    "description": "From the BBC World Service: Fears are growing among bitcoin investors after the cryptocurrency’s price fell below the $80,000 threshold Friday. It comes after U.S. President Donald Trump’s latest tariff threats triggered a fresh flight from risk. Meanwhile, U…",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/bitcoin-hits-three-month-low/",
    "timestamp": "2025-02-28T12:12:17Z"
  },
  {
    "title": "Kash Patel Lied, Told FBI Agents His Deputy Would Be Experienced Agent",
    "description": "Wow, someone on Team Trump LIED? Say it isn't so. Now, that will be a stain on Bloaty McBatshit, the most honest and transparent co-president in history's legacy. As Susie Madrak reported, Dan Bongino, former U.S. Secret Service agent, podcaster, and conspira…",
    "link": "https://crooksandliars.com/2025/02/kash-patel-lied-told-fbi-agents-his-deputy",
    "timestamp": "2025-02-28T12:11:49Z"
  },
  {
    "title": "This Month’s (February) Most Popular Articles",
    "description": "New Peer-reviewed Study Again Confirms Childhood Vaccines Are Likely Responsible for Nearly 80% of the Autism Cases in US Steve Kirsch, January 29, 2025 Rothschild’s Gaza Land Grab Dean Henderson, February 12, 2025 Why Does Donald Trump Want to Transform Gaza…",
    "link": "https://www.globalresearch.ca/this-months-february-most-popular-articles/5881040",
    "timestamp": "2025-02-28T12:11:06Z"
  },
  {
    "title": "No Matter How Many Orders Trump Signs, Equality Is in Our History—and Our Future",
    "description": "As Black History Month comes to a close, the celebrations and acknowledgements have felt less vibrant and more reserved. It is whiplash inducing to witness how quickly the outcry of public, corporate, and political support for racial equality quickly reverted…",
    "link": "https://www.commondreams.org/opinion/equality-history-and-future",
    "timestamp": "2025-02-28T12:11:04Z"
  },
  {
    "title": "UK media praise Starmer for pulling out ‘Trump card’ at yesterday’s White House meeting",
    "description": "The Daily Mail said the pair struck up an “unlikely bromance”.",
    "link": "https://www.thejournal.ie/uk-media-praise-starmer-for-pulling-out-trump-card-at-white-house-meeting-6635894-Feb2025/",
    "timestamp": "2025-02-28T12:06:38Z"
  },
  {
    "title": "Stormy Weather for NOAA as Efficiency Cuts Claim Hundreds of Jobs",
    "description": "Hundreds of staffers on probationary status at the National Oceanic and Atmospheric Administration (NOAA) were laid off Thursday as the Trump administration's Department of Government Efficiency (DOGE) continues to slash the federal workforce.\nThe post Stormy…",
    "link": "https://www.breitbart.com/environment/2025/02/28/stormy-weather-for-noaa-as-efficiency-cuts-claim-hundreds-of-jobs/",
    "timestamp": "2025-02-28T12:06:15Z"
  },
  {
    "title": "Former U.S. defense chiefs slam Trump dismissal of Pentagon officials",
    "description": "Five former U.S. defense secretaries on Thursday addressed a letter to lawmakers denouncing as \"reckless\" the recent firings of senior Pentagon officials by President Donald Trump.Trump this month launched a sweeping shakeup of the U.S. Defense Department, fi…",
    "link": "https://www.rawstory.com/former-u-s-defense-chiefs-slam-trump-dismissal-of-pentagon-officials/",
    "timestamp": "2025-02-28T12:04:17Z"
  },
  {
    "title": "India took ‘right approach’ on Ukraine conflict – Russian envoy",
    "description": "Russian Ambassador Denis Alipov has lauded New Delhi’s neutral stance on the conflict despite pressure from the West Read Full Article at RT.com",
    "link": "https://www.rt.com/india/613435-india-took-right-approach-ukraine-russian-ambassador/",
    "timestamp": "2025-02-28T12:04:03Z"
  },
  {
    "title": "Tatum O'Neal rips father Ryan O'Neal after he cut her out of will: ‘Keep it’",
    "description": "Tatum O'Neal shared her scornful response to being cut out of her father Ryan O'Neal's will. The two, who co-starred in 1973's \"Paper Moon,\" had a turbulent relationship.",
    "link": "https://www.foxnews.com/entertainment/tatum-oneal-rips-father-ryan-oneal-after-he-cut-her-out-will-keep-it",
    "timestamp": "2025-02-28T12:00:49Z"
  },
  {
    "title": "Zelensky lands in US ahead of crucial meeting with Trump",
    "description": "The two world leaders are expected to discuss the rare earths deal, protection from Russia and how European nations can share the burden of the costs of security for Ukraine.",
    "link": "https://nypost.com/2025/02/28/us-news/zelensky-arrives-in-us-ahead-of-trump-meeting/",
    "timestamp": "2025-02-28T12:00:23Z"
  },
  {
    "title": "50 Cent Clowns Floyd Mayweather For Calling Donald Trump The 'Best President Ever'",
    "description": "50 Cent has continued trolling Floyd Mayweather after the boxing legend claimed that Donald Trump was the 'best president' America has ever had.",
    "link": "https://hiphopdx.com/news/50-cent-clowns-floyd-mayweather-donald-trump-best-president",
    "timestamp": "2025-02-28T12:00:15Z"
  },
  {
    "title": "Meta fires employees for leaks amid Zuckerberg's Trump pivot",
    "description": "Meta on Thursday said it had laid off 20 workers for leaking information to the media, as the social media giant faces pressure over the recent political shift of its boss Mark Zuckerberg towards US President Donald Trump.\"We tell employees when they join the…",
    "link": "https://www.rawstory.com/meta-fires-employees-for-leaks-amid-zuckerberg-s-trump-pivot-2671239457/",
    "timestamp": "2025-02-28T12:00:14Z"
  },
  {
    "title": "Inside Israel's Plan To Resume the War and 'Eradicate Hamas.' Plus, Trump's Press Pool Takeover Is Not an Assault on the First Amendment.",
    "description": "\"It's going to be decisive. Israel will use every tool it has to conquer Gaza and eradicate Hamas.\" That's how Amir Avivi, a former Israeli brigadier general who has advised the Israeli government and military during the war, described the Jewish state's plan…",
    "link": "https://freebeacon.com/newsletters/inside-israels-plan-to-resume-the-war-and-eradicate-hamas-plus-trumps-press-pool-takeover-is-not-an-assault-on-the-first-amendment/",
    "timestamp": "2025-02-28T12:00:10Z"
  },
  {
    "title": "Boobs in space?",
    "description": "Donald Trump met with Emmanuel Macron at the White House this week, and told the French president to say hello to his \"beautiful wife\" Brigitte. The Washington Free Beacon is committed to holding our president accountable regardless of party, so we decided to…",
    "link": "https://freebeacon.com/newsletters/boobs-in-space/",
    "timestamp": "2025-02-28T12:00:07Z"
  },
  {
    "title": "Florida Republicans Welcoming Andrew Tate Sparks Fury...",
    "description": "The Tampa Bay Young Republicans defended the move, saying they are \"free speech absolutists.\"",
    "link": "https://www.newsweek.com/florida-republicans-invite-andrew-tate-tampa-bay-2037633",
    "timestamp": "2025-02-28T12:00:03Z"
  },
  {
    "title": "How Trans Teens Are Dealing With Trump 2.0, in Their Words",
    "description": "Canceled gender-affirming-care appointments, deadnaming, and adults protesting a high-school soccer game: 11 trans teens tell the Cut how they’re dealing with Trump 2.0.",
    "link": "http://www.thecut.com/article/trans-teens-gender-affirming-care-trump-orders-bans-stories.html",
    "timestamp": "2025-02-28T12:00:01Z"
  },
  {
    "title": "California Judge Blocks Mass Firings Of Probationary Federal Workers",
    "description": "District Judge William Alsup declared that the U.S. Office of Personnel Management (OPM) does not have the authority to mandate the firing of federal employees, including probationary staff, who have less than a year of experience.",
    "link": "https://www.ibtimes.com/california-judge-blocks-mass-firings-probationary-federal-workers-3764998",
    "timestamp": "2025-02-28T12:00:01Z"
  },
  {
    "title": "Imran Khan Writes From Prison: Why the World Must Pay Attention To Pakistan",
    "description": "A destabilized Pakistan threatens regional security, disrupts trade, and weakens global democratic values, writes Imran Khan for TIME.",
    "link": "https://time.com/7262072/imran-khan-writes-from-prison-pakistan/",
    "timestamp": "2025-02-28T12:00:00Z"
  },
  {
    "title": "The Putinization of America",
    "description": "Trump’s deference to the Russian dictator has become full-blown imitation.",
    "link": "https://www.theatlantic.com/international/archive/2025/02/putinization-america/681837/",
    "timestamp": "2025-02-28T12:00:00Z"
  },
  {
    "title": "Oval Office Ugliness",
    "description": "<ul>\n<li>Rooting For Trump</li>\n<li>Mike Johnson's Roommate</li>\n<li>A Win For The Manosphere</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/oval-office-ugliness",
    "timestamp": "2025-02-28T12:00:00Z"
  },
  {
    "title": "Alleged NYT piece by Josh Shapiro about 'college buddy' is fake",
    "description": "An authentic New York Times headline for an essay written by Pennsylvania Gov. Josh Shapiro reads, \"How sucking my college buddy's p**** made me a better father, husband, and beekeeper.\"",
    "link": "https://www.snopes.com//fact-check/fake-nyt-piece-josh-shapiro/",
    "timestamp": "2025-02-28T12:00:00Z"
  },
  {
    "title": "Cisco fixed command injection and DoS flaws in Nexus switches",
    "description": "Cisco addressed command injection and denial-of-service (DoS) vulnerabilities in some models of its Nexus switches. Cisco released security updates to address command injection and DoS vulnerabilities in Nexus switches, including a high-severity flaw. The mos…",
    "link": "https://securityaffairs.com/174753/security/cisco-fixed-command-injection-and-dos-flaws-in-nexus-switches.html",
    "timestamp": "2025-02-28T11:59:31Z"
  }
]