[
  {
    "title": "Trump's highest tariff will kill tiny African kingdom of Lesotho, economist says (Marafaele Mohloboli/Reuters)",
    "description": "Marafaele Mohloboli / Reuters:\nTrump's highest tariff will kill tiny African kingdom of Lesotho, economist says  —  A 50% reciprocal trade tariff on Lesotho, the highest levy on U.S. President Donald Trump's long list of target economies, will kill the tiny S…",
    "link": "https://www.memeorandum.com/250403/p165",
    "timestamp": "2025-04-03T23:55:01Z"
  },
  {
    "title": "Bay Area tech CEOs who sucked up to Trump just got rocked by new tariffs",
    "description": "When the upper brass of Bay Area tech flocked east to pay their respects to Donald Trump earlier this year, they surely expected some preferential treatment in return. But instead, the president just hit them where it hurts. Trump revealed sweeping new tariff…",
    "link": "https://freerepublic.com/focus/f-news/4308707/posts",
    "timestamp": "2025-04-03T23:51:48Z"
  },
  {
    "title": "Federal judge says she will temporarily block billions in health funding cuts to states",
    "description": "A federal judge will temporarily block President Donald Trump’s administration from cutting billions in federal dollars that support COVID-19 initiatives and public health projects throughout the country.",
    "link": "https://www.wpxi.com/news/local/federal-judge-says-she-will-temporarily-block-billions-health-funding-cuts-states/AXSVBB4AXNA3ZGM7QKU5UY57GA/",
    "timestamp": "2025-04-03T23:50:58Z"
  },
  {
    "title": "Republicans charge ahead on Trump budget, setting up marathon Senate votes",
    "description": "Republicans in the Senate started the process for passing a new version of President Donald Trump's budget to tackle the southern border and extend the 2017 tax cuts.",
    "link": "https://www.foxnews.com/politics/republicans-charge-ahead-trump-budget-setting-up-marathon-senate-votes",
    "timestamp": "2025-04-03T23:49:41Z"
  },
  {
    "title": "Illinois governor seeks assurances from Joint Chiefs of Staff after Signal incident",
    "description": "Illinois Gov. JB Pritzker asked the Joint Chiefs of Staff for assurances about steps being taken to protect national security after sensitive plans were shared on Signal.",
    "link": "https://abcnews.go.com/US/illinois-gov-jb-pritzker-seeks-assurances-joint-chiefs/story?id=120470236",
    "timestamp": "2025-04-03T23:47:35Z"
  },
  {
    "title": "Trump's tariffs rollout beset by confusion, uncertainty and mixed messages",
    "description": "President Donald Trump delivers remarks on reciprocal tariffs as Secretary of Commerce Howard Lutnick holds a chart during an event in the Rose Garden entitled \"Make America Wealthy Again\" at the White House on April 2, 2025.",
    "link": "https://biztoc.com/x/49ff7844755a7ba7",
    "timestamp": "2025-04-03T23:47:10Z"
  },
  {
    "title": "SCARE: Trump switches helicopters after flat tire... Developing...",
    "description": "President Donald Trump arrived at Miami airport on Thursday afternoon aboard Air Force One, but his presidential helicopter had a tire issue.",
    "link": "https://www.palmbeachpost.com/story/news/trump/2025/04/03/trump-lands-at-miami-airport-and-heads-to-his-resort-in-dor-but-presidential-chopper-has-wheel-issue/82789946007/",
    "timestamp": "2025-04-03T23:46:37Z"
  },
  {
    "title": "How Trump’s Tariffs Were Honed in Final Hours Before Rollout",
    "description": "President Donald Trump’s trade salvo was years in the making. The details came down to the final moments.",
    "link": "https://financialpost.com/pmn/business-pmn/how-trumps-tariffs-were-honed-in-final-hours-before-rollout",
    "timestamp": "2025-04-03T23:45:51Z"
  },
  {
    "title": "US Tariffs Pose \"Significant Risk To Global Outlook\", Warns IMF",
    "description": "Following US President Donald Trump&#039;s announcement of reciprocal tariffs, International Monetary Fund (IMF) Managing Director Kristalina Georgieva expressed concern over the impact on the global economy.",
    "link": "https://www.ndtv.com/world-news/trump-tariffs-us-tariffs-pose-significant-risk-to-global-outlook-warns-imf-8082333",
    "timestamp": "2025-04-03T23:45:47Z"
  },
  {
    "title": "Trump tariffs will \"have a real and detrimental impact\" on games industry, says US trade group",
    "description": "The Entertainment Software Association (ESA), which represents all major gaming companies in the US, has responded to US president Donald Trump's sweeping trade tariffs, saying the measures will \"have a real and detrimental impact\" on the games industry.\n Rea…",
    "link": "https://www.eurogamer.net/trump-tariffs-will-have-a-real-and-detrimental-impact-on-games-industry-says-us-trade-group",
    "timestamp": "2025-04-03T23:44:48Z"
  },
  {
    "title": "No more cheap skirts: Trump ends tax exemption for low-value Chinese imports",
    "description": "The tariff costs threaten the U.S. operations of companies like Shein and Temu.",
    "link": "https://www.bostonherald.com/2025/04/03/trump-tariffs-ending-exemption-shein-temu/",
    "timestamp": "2025-04-03T23:44:12Z"
  },
  {
    "title": "No more cheap skirts: Trump ends tax exemption for low-value Chinese imports",
    "description": "The tariff costs threaten the U.S. operations of companies like Shein and Temu.",
    "link": "https://www.denverpost.com/2025/04/03/trump-tariffs-ending-exemption-shein-temu/",
    "timestamp": "2025-04-03T23:44:12Z"
  },
  {
    "title": "Trump presidency a key concern for Southeast Asia, survey shows",
    "description": "Trump took third place at 46.9% in top concerns for Southeast Asians, according to a ISEAS-Yusof Ishak Institute survey published Thursday.",
    "link": "https://www.japantimes.co.jp/news/2025/04/04/asia-pacific/politics/trump-presidency-southeast-asia-survey/",
    "timestamp": "2025-04-03T23:42:00Z"
  },
  {
    "title": "Trump Tariff Implosion Is the ‘Worst Self-Inflicted Wound’ Seen in US Economy History, Obama Advisor Says | Video",
    "description": "\"For literally no reason you have taken a steady soft landing and now created trillions of dollars of wealth loss,\" Gene Sperling says\nThe post Trump Tariff Implosion Is the ‘Worst Self-Inflicted Wound’ Seen in US Economy History, Obama Advisor Says | Video a…",
    "link": "https://www.thewrap.com/trump-tariffs-self-inflicted-wound-obama-advisor-msnbc/",
    "timestamp": "2025-04-03T23:41:48Z"
  },
  {
    "title": "'Not a fan': Even Ted Cruz is dubious of Trump's plan",
    "description": "Sen. Ted Cruz (R-TX) is a big supporter of President Donald Trump — but not so much his tariffs.Cruz, who back in February expressed hope that the tariffs wouldn't go into effect at all, still tried to put a spin of supporting Trump's policy on Fox Business w…",
    "link": "https://www.rawstory.com/ted-cruz-tariffs/",
    "timestamp": "2025-04-03T23:39:22Z"
  },
  {
    "title": "Trump's tariffs rollout beset by confusion, uncertainty and mixed messages",
    "description": "Trump has fulfilled a campaign promise to unleash sweeping tariffs, which has sparked fears of a global trade war and prompted a question: What's his endgame?",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-tariffs-rollout-beset-confusion-uncertainty-mixed-messages-rcna199553",
    "timestamp": "2025-04-03T23:38:58Z"
  },
  {
    "title": "Republicans moving ahead with Trump's 'big' bill of tax breaks and spending cuts amid tariff uproar",
    "description": "After a long wait, the Senate is launching action on President Donald Trump’s ”“big, beautiful bill” of tax breaks and spending cuts. But it's coming at a risky moment for the U.S. and global economy after his announcement of steep tariffs. More than a month …",
    "link": "https://www.seattlepi.com/news/politics/article/republicans-moving-ahead-with-trump-s-big-bill-20257833.php",
    "timestamp": "2025-04-03T23:38:56Z"
  },
  {
    "title": "Eli Lilly boss: 'Tariffs are pivotal moment and hard to come back from'",
    "description": "The Chief Executive of Eli Lilly has told the BBC that he is doubtful tariffs could bring manufacturing jobs to the US whilst raising billions in tax revenue",
    "link": "https://www.bbc.com/news/articles/c0qndqz41jxo",
    "timestamp": "2025-04-03T23:37:18Z"
  },
  {
    "title": "The Conspiracy Theorist Advising Trump",
    "description": "The chaos inside the White House national-security team persists.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/04/the-conspiracy-theorist-advising-trump/682289/",
    "timestamp": "2025-04-03T23:37:00Z"
  },
  {
    "title": "US Job Market Seen Holding Up in March Before Toll From Tariffs",
    "description": "US hiring likely remained healthy last month and the unemployment rate held steady at a historically low level, pointing to a stable labor market ahead of an expected tariff-induced economic slowdown later this year.",
    "link": "https://financialpost.com/pmn/business-pmn/us-job-market-seen-holding-up-in-march-before-toll-from-tariffs",
    "timestamp": "2025-04-03T23:35:39Z"
  },
  {
    "title": "What Trump says he's trying to accomplish with tariffs",
    "description": "President Donald Trump has cited a host of reasons to impose steep new tariffs on U.S. trading partners. Some of the justifications are at odds with each other, economists said.\nTrump on Wednesday announced a new 10% tariff on all imports, plus additional lev…",
    "link": "https://biztoc.com/x/1038abc9963bc168",
    "timestamp": "2025-04-03T23:35:35Z"
  },
  {
    "title": "This is the dubious way Trump calculated his 'reciprocal' tariffs (David Goldman/CNN)",
    "description": "David Goldman / CNN:\nThis is the dubious way Trump calculated his ‘reciprocal’ tariffs  —  President Donald Trump's massive tariffs announced on dozens of nations Wednesday were pitched as “reciprocal,” matching what other countries charge the United States d…",
    "link": "https://www.memeorandum.com/250403/p159",
    "timestamp": "2025-04-03T23:35:01Z"
  },
  {
    "title": "‘National Security Issue’: Retired UAW Member Says Trump Restored Manufacturing Base That Another President Gave Up On",
    "description": "Pannebecker credited President Donald Trump on Fox Business Thursday for boosting a manufacturing base that, he claims, the Obama administration had abandoned.",
    "link": "https://dailycaller.com/2025/04/03/brian-pannebecker-trump-manufacturing-obama/",
    "timestamp": "2025-04-03T23:34:31Z"
  },
  {
    "title": "Labor leads in three recent national polls, four weeks from the election",
    "description": "While the polls remain tight, Labor is ahead after the first week of campaigning.",
    "link": "https://theconversation.com/labor-leads-in-three-recent-national-polls-four-weeks-from-the-election-253541",
    "timestamp": "2025-04-03T23:33:43Z"
  },
  {
    "title": "Trump’s Misleading Tariff Chart",
    "description": "In his Rose Garden announcement of sweeping new \"reciprocal tariffs,\" President Donald Trump held aloft a misleading chart that claimed to give a breakdown of the tariffs other countries charge the U.S. and the corresponding tariff that the U.S. will now impo…",
    "link": "https://www.factcheck.org/2025/04/trumps-misleading-tariff-chart/",
    "timestamp": "2025-04-03T23:32:24Z"
  },
  {
    "title": "EXCLUSIVE: Number of Unaccompanied Alien Children Arriving at Border Hits Record Low Under Trump",
    "description": "FIRST ON THE DAILY SIGNAL—The number of migrant children arriving alone at the southern border reached an all-time low in March.   Border Patrol encountered... Read More\nThe post EXCLUSIVE: Number of Unaccompanied Alien Children Arriving at Border Hits Record…",
    "link": "https://www.dailysignal.com/2025/04/03/exclusive-number-unaccompanied-children-arriving-border-reaches-record-low-under-trump/",
    "timestamp": "2025-04-03T23:32:05Z"
  },
  {
    "title": "NYC mayoral candidates take aim at Trump during Al Sharpton-led forum: ‘Existential threat’",
    "description": "Mayoral candidates all but declared war on President Trump during a forum organized by Rev. Al Sharpton Thursday.",
    "link": "https://nypost.com/2025/04/03/us-news/nyc-mayoral-candidates-take-aim-at-trump-during-al-sharpton-led-forum-existential-threat/",
    "timestamp": "2025-04-03T23:30:10Z"
  },
  {
    "title": "Alberta premier says latest U.S. tariffs hard to celebrate, but give time for talks",
    "description": "Alberta Premier Danielle Smith says U.S. President Donald Trump's latest tariff announcement might push a trade agreement renegotiation until after the April 28 federal election.",
    "link": "https://www.cbc.ca/news/canada/calgary/premier-tariff-talks-alberta-renegotiation-1.7501606",
    "timestamp": "2025-04-03T23:29:32Z"
  },
  {
    "title": "Senate Republicans vote to advance a massive budget blueprint for Trump's agenda",
    "description": "The Republican-led Senate voted 52-48 on Thursday to begin debate on a budget blueprint for a multitrillion-dollar package to pass President Donald Trump’s agenda.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-vote-advance-massive-budget-blueprint-trumps-agenda-rcna199509",
    "timestamp": "2025-04-03T23:28:59Z"
  },
  {
    "title": "Republicans moving ahead with Trump's 'big' bill of tax breaks and spending cuts amid tariff uproar",
    "description": "After a long wait, the Senate is launching action on President Donald Trump's \"big, beautiful bill” of tax breaks and spending cuts at a risky moment for the...",
    "link": "https://www.yahoo.com/news/republicans-moving-ahead-trumps-big-232840017.html",
    "timestamp": "2025-04-03T23:28:40Z"
  },
  {
    "title": "Trump Is A Mobster, Part Infinity",
    "description": "The top Democrat on the U.S. House Oversight Committee on Wednesday led calls for the resignation of acting Social Security Administration Commissioner Leland Dudek following the revelation of internal emails confirming that the SSA canceled contracts with th…",
    "link": "https://crooksandliars.com/2025/04/trump-mobster-part-infinity",
    "timestamp": "2025-04-03T23:27:09Z"
  },
  {
    "title": "Treasury Secretary Warns Countries Not To Retaliate Against Trump Tariffs",
    "description": "Treasury Secretary Scott Bessent basically told the rest of the world to just sit back and take it during an interview with Fox's Bret Baier. This guy already admitted that there very well could be a Trump recession, and that was before Trump's insane \"libera…",
    "link": "https://crooksandliars.com/2025/04/treasury-secretary-warns-countries-not",
    "timestamp": "2025-04-03T23:26:58Z"
  },
  {
    "title": "Mike Pence Hates Trump’s Tariffs. Which Means Trump Is Right",
    "description": "PULSE POINTS:❓What Happened: Former Vice President Mike Pence, who is pushing the GOP to reembrace unpopular globalist economic policies, is criticizing President Donald J. Trump’s imposition of extensive global tariffs, claiming they represent the largest pe…",
    "link": "https://freerepublic.com/focus/f-news/4308702/posts",
    "timestamp": "2025-04-03T23:24:48Z"
  },
  {
    "title": "Jerusalem Post Editor Speaks Out After Arrest as Qatar Probe Turns into Deep State Debacle",
    "description": "The editor of the Jerusalem Post is speaking out after he was detained by investigators pursuing allegations that Qatar bribed aides to Israeli Prime Minister Benjamin Netanyahu, saying he was unjustly detained by the police.\nThe post Jerusalem Post Editor Sp…",
    "link": "https://www.breitbart.com/middle-east/2025/04/03/jerusalem-post-editor-speaks-out-after-arrest-as-qatar-probe-turns-into-deep-state-debacle/",
    "timestamp": "2025-04-03T23:23:54Z"
  },
  {
    "title": "Fiserv CEO closes New York Stock Exchange on its worst day since 2020",
    "description": "A Wisconsin-based company rang the closing bell at the New York Stock Exchange Thursday — the worst day for Wall Street since 2020.",
    "link": "https://www.jsonline.com/story/money/business/2025/04/03/fiserv-ceo-bisignano-closes-new-york-stock-exchange-on-worst-day-since-2020/82800783007/",
    "timestamp": "2025-04-03T23:21:18Z"
  },
  {
    "title": "AppLovin bids for TikTok in all markets outside of China",
    "description": "Marketing platform AppLovin said on Thursday (Apr 3) it has submitted a bid for TikTok assets outside of China, ahead of the Apr 5 deadline set by US President Donald Trump to find a non-Chinese buyer for the short video app used by 170 million Americans. App…",
    "link": "https://www.channelnewsasia.com/world/applovin-bids-tiktok-all-markets-outside-china-5043551",
    "timestamp": "2025-04-03T23:20:04Z"
  },
  {
    "title": "Fox’s Ben Domenech Blasts Trump’s ‘Stupid’ Tariffs: ‘They’re Backwards’",
    "description": "Fox News contributor Ben Domenech offered a blunt reaction to the massive tariffs imposed by President Donald Trump.\nThe post Fox’s Ben Domenech Blasts Trump’s ‘Stupid’ Tariffs: ‘They’re Backwards’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/foxs-ben-domenech-blasts-trumps-stupid-tariffs-theyre-backwards/",
    "timestamp": "2025-04-03T23:19:55Z"
  },
  {
    "title": "Senate GOP Fuels Privatization Fears by Confirming 'Quack Grifter' Dr. Oz",
    "description": "Echoing a party-line vote by the U.S. Senate Finance Committee last week, the chamber's Republicans on Thursday confirmed President Donald Trump's nominee to head the Centers for Medicare and Medicaid Services, former televison host Dr. Mehmet Oz.\n\nSince Trum…",
    "link": "https://www.commondreams.org/news/dr-oz-confirmation",
    "timestamp": "2025-04-03T23:19:14Z"
  },
  {
    "title": "'This country is doomed': Trump meeting with conspiracy theorist sparks shock and horror",
    "description": "On Wednesday afternoon, April 2, President Donald Trump had a visitor in the White House Oval Office: far-right conspiracy theorist Laura Loomer, a self-described \"proud Islamophobe\" who is controversial even among fellow Trump supporters.During the meeting, …",
    "link": "https://www.rawstory.com/laura-loomer-trump-2671672198/",
    "timestamp": "2025-04-03T23:17:33Z"
  },
  {
    "title": "Lincoln businesses share anxiety, uncertainty after broad tariff announcement",
    "description": "On Thursday, 10/11 News called roughly 30 local businesses to ask what might be changing for them in the near future.",
    "link": "https://www.1011now.com/2025/04/03/lincoln-businesses-share-anxiety-uncertainty-after-broad-tariff-announcement/",
    "timestamp": "2025-04-03T23:15:36Z"
  },
  {
    "title": "Donald Trump’s Ego Melts the Global Economy",
    "description": "Susan B. Glasser writes about Donald Trump’s tariffs and the unaccountable power he holds over such a large swath of the world economy.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/donald-trumps-ego-melts-the-global-economy",
    "timestamp": "2025-04-03T23:14:11Z"
  },
  {
    "title": "Trump says he thinks Iran wants direct talks with US",
    "description": "US president says Iran initially wanted talks through intermediaries, but he thinks Tehran has changed its position.",
    "link": "https://www.aljazeera.com/news/2025/4/3/trump-says-he-thinks-iran-wants-direct-talks-with-us",
    "timestamp": "2025-04-03T23:14:08Z"
  },
  {
    "title": "Analyst unveils startling Nvidia stock forecast amid tariffs",
    "description": "The stock market took another hit after President Donald Trump announced sweeping tariffs of 10% or higher on some countries, escalating fears of a global trade war and adding pressure to an already struggling U.S. economy.\nThe S&P 500 dropped 4%. The tech-he…",
    "link": "https://biztoc.com/x/862fd32ffe859dec",
    "timestamp": "2025-04-03T23:13:39Z"
  },
  {
    "title": "Tariff fallout: ‘Not freaking out is a good idea’",
    "description": "If Wednesday was indeed Liberation Day in America, perhaps Thursday represents the hangover from the unofficial occasion.",
    "link": "https://www.bostonherald.com/2025/04/03/trump-says-the-economy-is-healing-as-tariffs-hammer-markets/",
    "timestamp": "2025-04-03T23:13:35Z"
  },
  {
    "title": "Russian envoy says Trump admin understands Moscow",
    "description": "Russia's Special Representative for Economic Cooperation with Foreign Countries Kirill Dmitriev (pictured centre) said the administration of United States President Donald Trump understands Moscow...",
    "link": "https://biztoc.com/x/1788b4f02b29864b",
    "timestamp": "2025-04-03T23:13:34Z"
  },
  {
    "title": "Trump Tariffs Fuel Worst S&P 500 Day Since 2020",
    "description": "The “America First” trade is unraveling in the sweeping turmoil in global markets, with stocks acutely exposed to the US economy sinking alongside the dollar. As Wall Street’s rebellion against Donald Trump’s tariff war intensifies, traders are rushing into f…",
    "link": "https://biztoc.com/x/e0d9bd93fc2cb80b",
    "timestamp": "2025-04-03T23:13:32Z"
  },
  {
    "title": "Tracking President Trump's love for charts over the years",
    "description": "From policy announcements, to campaign promises and jabs at political opponents - we look at the president’s use of visual aids.",
    "link": "https://www.bbc.com/news/videos/cn80g8dpkj7o",
    "timestamp": "2025-04-03T23:12:57Z"
  },
  {
    "title": "Higher inflation, shaky markets: What to expect from Trump's tariff policies, according to economists",
    "description": "Trump's tariffs are likely to roil the economy, experts say. But they shouldn't derail your long-term plans.",
    "link": "https://www.cnbc.com/2025/04/03/what-to-expect-from-trumps-tariff-policies-according-to-economists.html",
    "timestamp": "2025-04-03T23:12:49Z"
  },
  {
    "title": "It’s still a ‘mystery’ who came up with President Trump’s ‘Liberation Day’ tariff formula",
    "description": "But at the heart of the decision-making is Trump himself — who has agitated for tough tariffs for more than 40 years.",
    "link": "https://nypost.com/2025/04/03/us-news/author-of-trump-tariff-formula-remains-a-mystery/",
    "timestamp": "2025-04-03T23:11:44Z"
  },
  {
    "title": "IShowSpeed Meets 'Chinese Trump' Impressionist During His Visit to China",
    "description": "Speed's encounter with the infamous Trump impressionist during his tour of China.",
    "link": "https://www.complex.com/pop-culture/a/alex-ocho/ishowspeed-meets-chinese-trump-while-visiting-china",
    "timestamp": "2025-04-03T23:11:30Z"
  },
  {
    "title": "Trump says he supports proxy voting for new parents in Congress",
    "description": "Trump’s position puts him at odds with House Speaker Mike Johnson.",
    "link": "https://www.bostonherald.com/2025/04/03/trump-congress-proxy-voting/",
    "timestamp": "2025-04-03T23:11:13Z"
  },
  {
    "title": "Trump’s Truth Social Stake Drops $40 Million—Still Beats Market Post-Tariff",
    "description": "Trump Media stock fell 1.87% Thursday—less than the Dow, Nasdaq and S&P 500, which tumbled after Trump’s sweeping Liberation Day tariff announcement.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/04/03/trump-tariffs-truth-social-media-stock-price/",
    "timestamp": "2025-04-03T23:11:05Z"
  },
  {
    "title": "What Trump says he's trying to accomplish with tariffs",
    "description": "President Donald Trump contends tariffs will pay for tax cuts, lower foreign trade barriers, revive U.S. factories, curb fentanyl and reduce the national debt.",
    "link": "https://www.cnbc.com/2025/04/03/trump-tariffs-goals-deficit-jobs.html",
    "timestamp": "2025-04-03T23:10:44Z"
  },
  {
    "title": "Deadly storms kill at least four across US South",
    "description": "A series of storms that brought high winds and flash floods is expected to last for days.",
    "link": "https://www.bbc.com/news/articles/c9djld2q7l7o",
    "timestamp": "2025-04-03T23:09:04Z"
  },
  {
    "title": "Kentucky Bourbon industry caught in middle of global tariff war",
    "description": "Kentucky Bourbon industry caught in middle of global tariff wargo.com",
    "link": "https://abcnews.go.com/Business/kentucky-bourbon-industry-caught-middle-global-tariff-war/story?id=119675707",
    "timestamp": "2025-04-03T23:08:07Z"
  },
  {
    "title": "Live Oak teachers say education funding reform ‘can’t wait’",
    "description": "“This is catching a groundswell of folks that are just trying to look out for the future. We have to invest in our kids, plain and simple,” one demonstrator told the Sentinel. “It…",
    "link": "https://www.santacruzsentinel.com/2025/04/03/live-oak-teachers-say-education-funding-reform-cant-wait/",
    "timestamp": "2025-04-03T23:06:35Z"
  },
  {
    "title": "Nissan will pause US orders of Mexican-built Infiniti SUVs after Trump tariffs",
    "description": "Nissan Motor said on Thursday it will halt new orders of two Mexican-built Infiniti SUVs for the U.S. market after new auto tariffs imposed by President Donald Trump took effect.Nissan also said as a result it will maintain two shifts of production of the Rog…",
    "link": "https://www.channelnewsasia.com/business/nissan-will-pause-us-orders-mexican-built-infiniti-suvs-after-trump-tariffs-5043686",
    "timestamp": "2025-04-03T23:06:09Z"
  },
  {
    "title": "Trump Backs Luna’s Bill to Allow New Parents in Congress to Vote by Proxy",
    "description": "President Donald Trump has endorsed the bill that Rep. Anna Paulina Luna, R-Fla., left the House Freedom Caucus over, which would allow proxy voting for... Read More\nThe post Trump Backs Luna’s Bill to Allow New Parents in Congress to Vote by Proxy appeared f…",
    "link": "https://www.dailysignal.com/2025/04/03/trump-endorses-anna-paulina-lunas-bill-allow-new-moms-congress-proxy-vote/",
    "timestamp": "2025-04-03T23:03:22Z"
  },
  {
    "title": "Where Trump's Tariffs Could Hurt Americans' Wallets",
    "description": "As global financial markets plunge in the wake of US President Donald Trump's \"Liberation Day\" tariffs, Americans must also grapple with the potentially long-lasting impact of the move on household budgets.",
    "link": "https://www.ibtimes.com/where-trumps-tariffs-could-hurt-americans-wallets-3768763",
    "timestamp": "2025-04-03T23:03:14Z"
  },
  {
    "title": "Trump tariffs on Mexico: the good, the bad, the unknown",
    "description": "by Yussel GONZALEZ / Jean ARCEAt first glance, Mexico got off lightly from Donald Trump's \"Liberation Day\" tariffs blitz.The US president has repeatedly threatened the United States' top trading partner with punishing tariffs over illegal migration and drug s…",
    "link": "https://www.rawstory.com/trump-tariffs-2671672167/",
    "timestamp": "2025-04-03T23:03:05Z"
  },
  {
    "title": "Fact-Check: Did RFK Jr. Use Steroids to Build Muscle? Here's What We Know",
    "description": "Robert F. Kennedy Jr., now serving as Secretary of Health and Human Services under President Donald Trump, continues to face renewed scrutiny over his use of testosterone replacement therapy—an anabolic steroid—after posting a series of shirtless workout vide…",
    "link": "https://biztoc.com/x/f4ecbe41100c0ecc",
    "timestamp": "2025-04-03T23:02:56Z"
  },
  {
    "title": "Where Trump’s tariffs could hurt Americans’ wallets",
    "description": "The tariffs -- which are paid in the first instance by US importers -- will likely push up the price of many household items in the U.S.\nThe post Where Trump’s tariffs could hurt Americans’ wallets appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/life/where-trumps-tariffs-could-hurt-americans-wallets/article",
    "timestamp": "2025-04-03T23:02:33Z"
  },
  {
    "title": "NASA’s Jet Propulsion Laboratory Lays Off 900, Kept Chief DEI Officer",
    "description": "Neela Rajendra has been rebranded as \"Chief of the Office of Team Excellence and Employee Success.\" The move is a clear attempt to bypass the restrictions against DEI now being implemented.\nThe post NASA’s Jet Propulsion Laboratory Lays Off 900, Kept Chief DE…",
    "link": "https://legalinsurrection.com/2025/04/nasas-jet-propulsion-laboratory-lays-off-900-kept-chief-dei-officer/",
    "timestamp": "2025-04-03T23:00:57Z"
  },
  {
    "title": "Bitcoin Coinbase Spot Price Lags Despite Large BTC Purchases – Is US Demand Weakening?",
    "description": "Bitcoin experienced intense volatility yesterday, surging above $88,000 before plunging below $82,000 within hours. The massive swing came as U.S. President Donald Trump announced new tariffs on what he declared “Liberation Day,” sparking fresh fear across gl…",
    "link": "https://bitcoinist.com/bitcoin-coinbase-spot-price-lags-despite-large-btc-purchases-is-us-demand-weakening/",
    "timestamp": "2025-04-03T23:00:35Z"
  },
  {
    "title": "“Lack of Standing”: Federal Court in Georgia Rules That Voters Have a Right to Cast a Vote, But Not To Ensure It Is Accurately Counted",
    "description": "A recent federal court ruling in Georgia has sparked significant debate, affirming voters' right to cast ballots while controversially denying their right to ensure accurate counting. This decision raises critical questions about electoral integrity and voter…",
    "link": "https://www.thegatewaypundit.com/2025/04/lack-standing-federal-court-georgia-rules-that-voters/",
    "timestamp": "2025-04-03T23:00:29Z"
  },
  {
    "title": "Hochul Says Trump’s Tariffs Are Already Hurting New York Economy",
    "description": "President Donald Trump’s sweeping tariff push is already hitting New York’s economy, with falling Canadian tourism and cross-border shopping driving down sales tax revenue, Governor Kathy Hochul said.",
    "link": "https://financialpost.com/pmn/business-pmn/hochul-says-trumps-tariffs-are-already-hurting-new-york-economy",
    "timestamp": "2025-04-03T23:00:19Z"
  },
  {
    "title": "US President Donald Trump Trump announces 27 per cent reciprocal tariff on India",
    "description": "NEW YORK/WASHINGTON/NEW DELHI, April 3: The US has announced 27 per cent reciprocal tariffs on India saying New Delhi imposes high import duties on American goods, as the Donald Trump administration aims to reduce the country’s trade deficit and boost manufac…",
    "link": "https://thehillstimes.in/international/us-president-donald-trump-trump-announces-27-per-cent-reciprocal-tariff-on-india",
    "timestamp": "2025-04-03T23:00:00Z"
  },
  {
    "title": "Trump 'In Favor' of Proxy Voting for New Parents, But Stops Short of Endorsing Luna's Resolution",
    "description": "President Donald Trump said Thursday he is in favor of allowing new parents serving in the House of Representatives to vote remotely, dealing a blow to Speaker Mike Johnson (R-LA). Johnson shut down the House floor for the week Tuesday\nThe post Trump ‘In Favo…",
    "link": "https://www.breitbart.com/politics/2025/04/03/trump-in-favor-of-proxy-voting-for-new-parents-but-stops-short-of-endorsing-lunas-resolution/",
    "timestamp": "2025-04-03T22:59:50Z"
  },
  {
    "title": "Fact-Check: Did RFK Jr. Use Steroids to Build Muscle? Here's What We Know",
    "description": "In a popular YouTube video Greg Doucette discusses whether or not Robert F. Kennedy Jr. takes steroids and how much it impacts his physique.",
    "link": "https://www.newsweek.com/fact-check-rfk-jr-steroids-muscle-claims-2055117",
    "timestamp": "2025-04-03T22:59:28Z"
  },
  {
    "title": "New Haven/Cambridge galaxy brain syndrome",
    "description": "The Bezos’d op-ed section has come up with a new way of trying to legitimize Trump seeking a third term: does violating the constitution in order to retain our mad king fall in the \"personal liberty\" vertical or the \"free market\" vertical? [image or embed] — …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/new-haven-cambridge-galaxy-brain-syndrome",
    "timestamp": "2025-04-03T22:59:25Z"
  },
  {
    "title": "For Trump, tariff gamble brings political risk",
    "description": "If his promises to recast the economy don't work out, it could cause political headwinds for his party and economic pain for his constituents.",
    "link": "https://www.japantimes.co.jp/news/2025/04/04/world/politics/trump-tariff-political-gamble/",
    "timestamp": "2025-04-03T22:59:00Z"
  },
  {
    "title": "How your ASX shares may be impacted by US tariffs",
    "description": "Aside from a likely short-term hit to share prices, there will be an impact on companies' financial metrics. \nThe post How your ASX shares may be impacted by US tariffs appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/04/how-your-asx-shares-may-be-impacted-by-us-tariffs/",
    "timestamp": "2025-04-03T22:58:23Z"
  },
  {
    "title": "Global markets in turmoil as Trump tariffs wipe $2.5trillion off Wall Street",
    "description": "“I think it’s going very well,” US president tells journalist on way to play golf",
    "link": "https://www.irishtimes.com/world/americas/2025/04/03/global-markets-in-turmoil-as-trump-tariffs-wipe-25trillion-off-wall-street/",
    "timestamp": "2025-04-03T22:57:00Z"
  },
  {
    "title": "Trump wants Musk to stay with admin, says DOGE found something 'horrible' today",
    "description": "President Donald Trump said he wants Elon Musk to stay on his team \"as long as possible\" during a conversation with reporters Thursday, noting that DOGE had found something \"horrible,\" without divulging further details.",
    "link": "https://www.foxnews.com/politics/trump-wants-musk-stay-admin-says-doge-found-something-horrible-today",
    "timestamp": "2025-04-03T22:55:33Z"
  },
  {
    "title": "'Trying to understand': CNN anchor struggles to keep straight face as Trump aide rambles",
    "description": "President Donald Trump's manufacturing adviser, Peter Navarro, known for his unconventional ideas about trade, went on CNN to explain to anchor Phil Mattingly about the administration's thinking behind the \"Liberation Day\" tariffs sending shockwaves through m…",
    "link": "https://www.rawstory.com/peter-navarro-2671671771/",
    "timestamp": "2025-04-03T22:54:01Z"
  },
  {
    "title": "USA Fencing disqualifies Stephanie Turner for refusing to fence transgender athlete",
    "description": "USA Fencing disqualifies Stephanie Turner for refusing to fence transgender athletego.com",
    "link": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
    "timestamp": "2025-04-03T22:54:00Z"
  },
  {
    "title": "Fox Host Defends Trump Tanking the Stock Market: ‘I Don’t Really Care About My 401(k)’",
    "description": "The Five co-host Jeanine Pirro declared bluntly that she didn't \"really care\" about her 401(k) after the stock market nosedived in response to Trump's tariffs.\nThe post Fox Host Defends Trump Tanking the Stock Market: ‘I Don’t Really Care About My 401(k)’ fir…",
    "link": "https://www.mediaite.com/tv/fox-host-defends-trump-tanking-the-stock-market-i-dont-really-care-about-my-401k/",
    "timestamp": "2025-04-03T22:52:08Z"
  },
  {
    "title": "Live updates: Trump’s new tariffs lead to the biggest Dow wipeout since 2020",
    "description": "Live updates: Trump’s new tariffs lead to the biggest Dow wipeout since 2020\nFollow the latest news from President Donald Trump and his administration | April 3, 2025\nFinancial markets around the world reeled following President Donald Trump’s latest and most…",
    "link": "https://biztoc.com/x/33ec09f2c40b3514",
    "timestamp": "2025-04-03T22:51:41Z"
  },
  {
    "title": "Pentagon watchdog to investigate Hegseth's use of Signal app",
    "description": "In a memorandum addressed to US Defense Secretary Pete Hegseth, the Inspector General's office said it would examine whether the use of Signal met Defense Department guidelines.",
    "link": "https://www.abc.net.au/news/2025-04-04/pentagon-watchdog-investigating-hegseth-signal-chat-usage/105136558",
    "timestamp": "2025-04-03T22:51:40Z"
  },
  {
    "title": "Officials in 19 states sue to block Trump’s election order, saying it’s unconstitutional",
    "description": "Democratic officials in 19 states filed a lawsuit Thursday against President Donald Trump's attempt to reshape elections across the U.S., calling it an unconstitutional invasion of states' clear authority to run their own elections.",
    "link": "https://www.pbs.org/newshour/politics/officials-in-19-states-sue-to-block-trumps-election-order-saying-its-unconstitutional",
    "timestamp": "2025-04-03T22:51:27Z"
  },
  {
    "title": "How Companies Could Respond To The Crisis Created By Trump’s Tariffs",
    "description": "The ability of executives to respond to the impact of President Donald Trump’s tariffs could determine whether and how their companies survive this crisis.",
    "link": "https://www.forbes.com/sites/edwardsegal/2025/04/03/how-companies-could-respond-to-the-crisis-created-by-trumps-tariffs/",
    "timestamp": "2025-04-03T22:51:23Z"
  },
  {
    "title": "Trump Says 'Very Close To A Deal' On TikTok",
    "description": "President Donald Trump said his administration was \"very close\" to a deal to find a buyer for TikTok, which faces a US ban if not sold by its Chinese owner by the weekend.",
    "link": "https://www.ibtimes.com/trump-says-very-close-deal-tiktok-3768760",
    "timestamp": "2025-04-03T22:51:06Z"
  },
  {
    "title": "Breitbart Business Digest: The Tariff Tantrum Sends Economists into Frenzy of Fear",
    "description": "If bull markets are breeding grounds for irrational exuberance, bear markets tend to produce prophets of doom.\nThe post Breitbart Business Digest: The Tariff Tantrum Sends Economists into Frenzy of Fear appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/03/breitbart-business-digest-the-tariff-tantrum-sends-economists-into-frenzy-of-fear/",
    "timestamp": "2025-04-03T22:50:31Z"
  },
  {
    "title": "Trump administration is considering freezing $510 million in grants to Brown University | CNN",
    "description": "More than half a billion dollars in grant money is on the line at Brown University as the Trump administration reviews the Ivy League university’s Diversity, Equity and Inclusion policies and its response to antisemitism, a White House official told CNN. News…",
    "link": "https://www.cnn.com/2025/04/03/us/brown-university-trump-administration-freeze/index.html",
    "timestamp": "2025-04-03T22:49:44Z"
  },
  {
    "title": "The End of Pax Americana",
    "description": "Jonathan Last: “We cannot overstate what has just happened. It took just 71 days for Donald Trump to wreck the American economy, mortally wound NATO, and destroy the American-led world order.” “He did this with",
    "link": "https://politicalwire.com/2025/04/03/the-end-of-pax-americana/",
    "timestamp": "2025-04-03T22:49:43Z"
  },
  {
    "title": "Trump says ‘very close to a deal’ on TikTok",
    "description": "President Donald Trump said his administration was “very close” to a deal to find a buyer for TikTok, which faces a US ban if not sold by its Chinese owner by the weekend. “We’re very close to a deal with a very good group of people,” Trump told reporters abo…",
    "link": "https://www.digitaljournal.com/world/trump-says-very-close-to-a-deal-on-tiktok/article",
    "timestamp": "2025-04-03T22:47:34Z"
  },
  {
    "title": "Trump says ‘very close to a deal’ on TikTok",
    "description": "President Donald Trump said his administration was \"very close\" to a deal to find a buyer for TikTok.\nThe post Trump says ‘very close to a deal’ on TikTok appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/trump-says-very-close-to-a-deal-on-tiktok/article",
    "timestamp": "2025-04-03T22:47:34Z"
  },
  {
    "title": "Trump says things are 'going very well' after worst stock market drop in years over tariffs",
    "description": "President Donald Trump is sounding an upbeat note about his tariffs even as the stock market reacted by falling more than 1,600 points.",
    "link": "https://www.clickorlando.com/news/politics/2025/04/03/trump-says-things-are-going-very-well-after-worst-stock-market-drop-in-years-over-tariffs/",
    "timestamp": "2025-04-03T22:46:26Z"
  },
  {
    "title": "Trump says 'very close to a deal' on TikTok",
    "description": "President Donald Trump said his administration was \"very close\" to a deal to find a buyer for TikTok, which faces a US ban if not sold by its Chinese owner...",
    "link": "https://finance.yahoo.com/news/trump-says-very-close-deal-224504674.html",
    "timestamp": "2025-04-03T22:45:04Z"
  },
  {
    "title": "Trump tariffs hammer global stocks, dollar and oil",
    "description": "<p>NEW YORK - Stock markets and the dollar tumbled Thursday after President Donald Trump's latest worldwide tariff salvo fanned a trade war that many fear will spark recession and ramp up inflation.</p>",
    "link": "https://www.bangkokpost.com/business/general/2995457/trump-tariffs-hammer-global-stocks-dollar-and-oil",
    "timestamp": "2025-04-03T22:45:00Z"
  },
  {
    "title": "Rating uplift boosts Gulf's confidence",
    "description": "<p>Gulf Development Plc (Gulf), recently established through the merger of Gulf Energy Development Plc and Intouch Holdings Plc, expects bright business prospects, thanks to a better credit rating and continual financial support over the next five years.</p>",
    "link": "https://www.bangkokpost.com/business/general/2995321/rating-uplift-boosts-gulfs-confidence",
    "timestamp": "2025-04-03T22:45:00Z"
  },
  {
    "title": "States sue to block Trump’s election order, saying it violates the Constitution",
    "description": "The lawsuit is the fourth against the executive order issued just a week ago.",
    "link": "https://www.bostonherald.com/2025/04/03/trump-elections-lawsuit/",
    "timestamp": "2025-04-03T22:44:08Z"
  },
  {
    "title": "Why Does Bitcoin Trade Like a Tech Stock: Experts Weigh In",
    "description": "Barstool Sports founder Dave Portnoy questioned why Bitcoin, an asset trumpeted as independent from financial systems, was tracking stocks.",
    "link": "https://decrypt.co/313243/why-bitcoin-trade-tech-stock-experts-weigh-in",
    "timestamp": "2025-04-03T22:43:33Z"
  },
  {
    "title": "Trump’s tariffs will deliver a big blow to climate tech",
    "description": "US president Donald Trump’s massive, sweeping tariffs sent global stock markets tumbling on Thursday, setting the stage for a worldwide trade war and ratcheting up the dangers of a punishing recession.  Experts fear that the US cleantech sector is especially …",
    "link": "https://www.technologyreview.com/2025/04/03/1114209/trumps-tariffs-will-deliver-a-big-blow-to-climate-tech/",
    "timestamp": "2025-04-03T22:43:19Z"
  },
  {
    "title": "Trump tariffs on Mexico: the good, the bad, the unknown",
    "description": "At first glance, Mexico got off lightly from Donald Trump’s “Liberation Day” tariffs blitz. The US president has repeatedly threatened the United States’ top trading partner with punishing tariffs over illegal migration and drug smuggling. So it was a surpris…",
    "link": "https://www.digitaljournal.com/world/trump-tariffs-on-mexico-the-good-the-bad-the-unknown/article",
    "timestamp": "2025-04-03T22:42:33Z"
  },
  {
    "title": "Trump Tariffs On Mexico: The Good, The Bad, The Unknown",
    "description": "At first glance, Mexico got off lightly from Donald Trump's \"Liberation Day\" tariffs blitz.",
    "link": "https://www.ibtimes.com/trump-tariffs-mexico-good-bad-unknown-3768759",
    "timestamp": "2025-04-03T22:42:12Z"
  }
]