[
  {
    "title": "Joni Ernst Vows To Rubber Stamp Trump’s Iran Decision",
    "description": "Sen. Joni “We’re all going to die” Ernst visited Fox Business Thursday morning to join host Maria Bartiromo in a Trump-fluffing segment after a brutal poll for Dear Leader was released by the network.\nUnfortunately for Americans, democracy and the Constitutio…",
    "link": "https://crooksandliars.com/2025/06/sen-ernst-vows-rubber-stamp-trump-s-iran",
    "timestamp": "2025-06-20T09:31:29Z"
  },
  {
    "title": "Trick or TACO? Why has Trump set a 2-week deadline for Iran?",
    "description": "US President Donald Trump announced he will decide within two weeks whether the U.S. will intervene in the Israel-Iran conflict, hinting at potential negotiations while demanding \"unconditional surrender.\" This delay could be a strategic move to deceive Iran,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tiran-israel-war-us-threat-of-attack-trick-or-taco-why-has-trump-set-a-2-week-deadline-for-iran/articleshow/121972363.cms",
    "timestamp": "2025-06-20T09:31:06Z"
  },
  {
    "title": "Newt Gingrich Breaks Down Why Every Iran Deal Is Doomed Unless One Thing Happens",
    "description": "By Mariane Angela, Daily Caller News Foundation | June 16, 2025\nFormer House Speaker Newt Gingrich warned on Fox Business Monday that any nuclear deal with Iran is doomed to fail unless the Islamic Republic undergoes regime change.\nPresident Donald Trump left…",
    "link": "https://biztoc.com/x/df1510685dc46041",
    "timestamp": "2025-06-20T09:30:22Z"
  },
  {
    "title": "Gregg Jarrett Provides One Long-Established Reason Judges Lack Legal Authority To Block Trump Nationwide",
    "description": "By Mariane Angela, Daily Caller News Foundation | June 16, 2025\nFox News legal analyst Gregg Jarrett said Monday that activist judges have no constitutional authority to impose nationwide injunctions to block President Donald Trump’s agenda.\nThe Supreme Court…",
    "link": "https://biztoc.com/x/00475faafc5a939a",
    "timestamp": "2025-06-20T09:30:17Z"
  },
  {
    "title": "This man killed more Americans than anybody in history. Trump's now his toady",
    "description": "Robert E. Lee killed more Americans than Hitler. More than Khrushchev. More than King George III, Ho Chi Minh, or Kim Il Sung. He killed more Americans than we’ve lost in every war since the American Revolution, combined. He was the largest mass murderer of A…",
    "link": "https://www.rawstory.com/raw-investigates/robert-e-lee/",
    "timestamp": "2025-06-20T09:30:03Z"
  },
  {
    "title": "A False Start on the Road to an All-American Bitcoin",
    "description": "Donald Trump pledged to cement the US as the bitcoin mining capital of the planet. The president’s sweeping tariffs stand to simultaneously undermine and advance that ambition in one swoop.",
    "link": "https://www.wired.com/story/a-false-start-on-the-road-to-an-all-american-bitcoin/",
    "timestamp": "2025-06-20T09:30:00Z"
  },
  {
    "title": "Iran-Israel war: latest developments",
    "description": "Israel and Iran exchanged fire again on Friday, a week into the war between the longtime enemies. Here are the latest developments: – Iran meetings – European top diplomats are meeting with Iran’s Foreign Minister Abbas Araghchi in Geneva on Friday to discuss…",
    "link": "https://www.digitaljournal.com/world/iran-israel-war-latest-developments-3/article",
    "timestamp": "2025-06-20T09:27:20Z"
  },
  {
    "title": "US appeals court allows Trump control of National Guard in LA",
    "description": "A US appeals court on Thursday ruled that President Donald Trump could continue control of National Guard troops in Los Angeles, over the objections of California Governor Gavin Newsom. Trump ordered the deployment of thousands of National Guard troops and hu…",
    "link": "https://www.digitaljournal.com/world/us-appeals-court-allows-trump-control-of-national-guard-in-la/article",
    "timestamp": "2025-06-20T09:27:20Z"
  },
  {
    "title": "Top Iran, EU diplomats to hold nuclear talks",
    "description": "European foreign ministers will hold nuclear talks with their Iranian counterpart on Friday, as President Donald Trump mulls the prospect of US involvement in the Iran-Israel war. Israel, saying Iran was on the verge of developing a nuclear weapon, launched a…",
    "link": "https://www.digitaljournal.com/world/top-iran-eu-diplomats-to-hold-nuclear-talks/article",
    "timestamp": "2025-06-20T09:27:20Z"
  },
  {
    "title": "Top Iran, EU Diplomats To Hold Nuclear Talks",
    "description": "European foreign ministers will hold nuclear talks with their Iranian counterpart on Friday, as President Donald Trump mulls the prospect of US involvement in the Iran-Israel war.",
    "link": "https://www.ibtimes.com.au/top-iran-eu-diplomats-hold-nuclear-talks-1859306",
    "timestamp": "2025-06-20T09:27:17Z"
  },
  {
    "title": "Top Iran, EU Diplomats To Hold Nuclear Talks",
    "description": "European foreign ministers will hold nuclear talks with their Iranian counterpart on Friday, as President Donald Trump mulls the prospect of US involvement in the Iran-Israel war.",
    "link": "https://www.ibtimes.com/top-iran-eu-diplomats-hold-nuclear-talks-3776310",
    "timestamp": "2025-06-20T09:27:15Z"
  },
  {
    "title": "Linux flaws chain allows Root access across major distributions",
    "description": "Researchers discovered two local privilege escalation flaws that could let attackers gain root access on systems running major Linux distributions. Qualys researchers discovered two local privilege escalation (LPE) vulnerabilities, an attacker can exploit the…",
    "link": "https://securityaffairs.com/179174/security/linux-flaws-chain-allows-root-access-across-major-distributions.html",
    "timestamp": "2025-06-20T09:22:03Z"
  },
  {
    "title": "Trump to make Iran war decision in 'next two weeks'",
    "description": "US President Donald Trump said he would allow for two weeks of diplomacy before deciding whether to strike Iran.\nWashington and Tehran are in contact, the White House said Thursday, signaling possible negotiations: The US’ Middle East envoy and Iran’s foreign…",
    "link": "https://biztoc.com/x/170c3e1b9a0eb1c2",
    "timestamp": "2025-06-20T09:20:10Z"
  },
  {
    "title": "Bitcoin Pepe price outlook as analysts worry BTC may see some pressure",
    "description": "Bitcoin Pepe is seen as one of the most closely watched crypto presales of 2025. The Bitcoin Pepe presale has raised over $15 million. The project’s native token is currently priced at $0.0416. Bitcoin (BTC) held steady above $106,000 on Friday, as the broade…",
    "link": "https://coinjournal.net/news/bitcoin-pepe-price-outlook-as-analysts-worry-btc-may-see-some-pressure/",
    "timestamp": "2025-06-20T09:20:05Z"
  },
  {
    "title": "Trump Announces Trade Deal and Drops Plans To Revoke Chinese Student Visas",
    "description": "By Virginia Allen, The Daily Signal | June 11, 2025\nPresident Donald Trump says the U.S. has reached a trade deal with China and is ditching plans to revoke Chinese student visas.\n“Our deal with China is done, subject to final approval with President Xi [Jinp…",
    "link": "https://biztoc.com/x/43b9046372b5c308",
    "timestamp": "2025-06-20T09:19:55Z"
  },
  {
    "title": "US to resume student visas but orders social media vetting: media",
    "description": "The US State Department said it is restarting the suspended process for foreigners applying for student visas but all applicants will now be required to unlock their social media accounts for government review, AP reported.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/06/sec-250619-globaltimes01.htm",
    "timestamp": "2025-06-20T09:19:43Z"
  },
  {
    "title": "Ayatollah Sistani slams Israeli aggression against Iran, threats against Ayatollah Khamenei",
    "description": "Iraq's top Shia cleric, Ayatollah Sistani, has strongly condemned the continued Israeli aggression against Iran as well as threats to assassinate the Leader of the Islamic Revolution, Ayatollah Seyyed Ali Khamenei.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250619-presstv11.htm",
    "timestamp": "2025-06-20T09:19:43Z"
  },
  {
    "title": "Chief of Army Staff (COAS) of Pakistan, Field Marshal Syed Asim Munir, met with President of the United States, Donald J. Trump, at the White House.",
    "description": "Chief of Army Staff (COAS) of Pakistan, Field Marshal Syed Asim Munir, met with President of the United States, Donald J. Trump, at the White House.",
    "link": "https://www.globalsecurity.org/wmd/library/news/pakistan/2025/pakistan-250619-pk-ispr02.htm",
    "timestamp": "2025-06-20T09:19:43Z"
  },
  {
    "title": "New South Korean government unlikely to commit to Taiwan's defense: Expert",
    "description": "An international security expert said Wednesday that newly elected South Korean President Lee Jae-myung's rhetoric suggests his administration is more likely to pursue economic cooperation with Taiwan than a defense alliance.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250619-cna04.htm",
    "timestamp": "2025-06-20T09:19:43Z"
  },
  {
    "title": "Chinese FM responds to US' enhanced screening of student visa applicants' social media accounts",
    "description": "Responding to the US Department of State's announcement to resume student visa interviews while requiring all applicants to make their social media accounts publicly accessible for enhanced screening, a Chinese Foreign Ministry spokesperson said on Thursday t…",
    "link": "https://www.globalsecurity.org/security/library/news/2025/06/sec-250619-globaltimes02.htm",
    "timestamp": "2025-06-20T09:19:43Z"
  },
  {
    "title": "Israel warns Hezbollah to stay out of its fight against Iran: ‘Leader hasn’t learned from his predecessors’",
    "description": "“The Hezbollah leader hasn’t learned from his predecessors and is threatening to act against Israel.”",
    "link": "https://nypost.com/2025/06/20/world-news/israel-warns-hezbollah-to-stay-out-of-its-fight-against-iran-leader-hasnt-learned-from-his-predecessors/",
    "timestamp": "2025-06-20T09:19:36Z"
  },
  {
    "title": "Seth Meyers Points Out Trump’s Hilarious Struggle With X-Rated Word",
    "description": "The president claimed he'd be \"run out of town\" for saying it, but the \"Late Night\" comedian disagreed.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-nsfw-word_n_68551d31e4b0dd3af0372c7d",
    "timestamp": "2025-06-20T09:19:16Z"
  },
  {
    "title": "Zelenskyy Says Russia 'Chooses To Kill' As Putin Repeats Hard-Line Demands",
    "description": "Ukrainian President Volodymyr Zelenskyy said that a massive Russian drone and missile attack on Kyiv, which claimed dozens of civilian lives, is a reminder that Russia is disregarding cease-fire efforts and \"chooses to kill.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250619-rferl02.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "Trump Suggests Striking Iran If Destruction of Fordow Enrichment Facility Assured - Reports",
    "description": "US President Donald Trump has suggested to strike Iran only if guaranteed that bunker buster bombs will destroy the Fordow Fuel Enrichment Plant, media reported on Thursday, citing sources.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250619-sputnik03.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "Trump To Decide 'Within 2 Weeks' On US Action As Israel Threatens Khamenei, Vows Further Attacks on Iran",
    "description": "The White House said President Donald Trump will make a decision \"within two weeks\" on whether to get directly involved in the Israeli-Iran conflict, while Israel threatened further attacks against Iran's nuclear and ballistic missile assets as the violence s…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250620-rferl01.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "Trump to decide on Iran action in 2 weeks: White House",
    "description": "U.S. President Donald Trump will make a decision on whether he will order a strike against Iran in the next two weeks, White House Press Secretary Karoline Leavitt said at a briefing on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250620-pdo02.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "Spanish Prime Minister Rejects NATO Call to Raise Defense Spending to 5% of GDP",
    "description": "Spanish Prime Minister Pedro Sanchez told NATO Secretary General Mark Rutte that Madrid would not support the proposal to increase the alliance's defense spending to 5% of gross domestic product (GDP) by 2032, according to a letter published by El Pais newspa…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250619-sputnik01.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "Strait of Hormuz closure in event of US aggression against Iran to paralyze world economy",
    "description": "As regional tensions escalate amid the Israeli regime's brutal aggression against the Islamic Republic, the possibility of the closure of Strait of Hormuz is a possibility, according to experts.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250619-presstv07.htm",
    "timestamp": "2025-06-20T09:10:20Z"
  },
  {
    "title": "With his ‘golden share’ in U.S. Steel, Trump turns to a mechanism more common elsewhere in the world",
    "description": "U.S. President Donald Trump turned to a little-used mechanism—the “golden share”—to ensure that a Japanese-owned U.S. Steel doesn’t become a threat to national security. Nippon Steel, the U.S. steelmaker’s soon-to-be owner, is granting Washington special auth…",
    "link": "https://biztoc.com/x/6ca15fcaa3f23bda",
    "timestamp": "2025-06-20T09:09:59Z"
  },
  {
    "title": "Appeals court rules Trump had defensible rationale to seize California National Guard troops and can keep control",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids.\nThe decision halts a ruling from a lower court judge who found Trump acted illegally whe…",
    "link": "https://biztoc.com/x/1770cd015faff871",
    "timestamp": "2025-06-20T09:09:49Z"
  },
  {
    "title": "Opposition parties curtail some special powers in Carney’s Bill C-5",
    "description": null,
    "link": "https://www.nationalobserver.com/2025/06/20/news/opposition-parties-curtail-special-powers-carneys-bill-c-5",
    "timestamp": "2025-06-20T09:09:05Z"
  },
  {
    "title": "Israel, Iran show no signs of backing down as conflict enters its second week",
    "description": "Israel and Iran's air war entered a second week on Friday and European officials sought to draw Tehran back to the negotiating table after U.S. President Donald Trump said any decision on potential U.S. involvement would be made within two weeks.",
    "link": "https://www.cbc.ca/news/world/iran-israel-second-week-1.7566464",
    "timestamp": "2025-06-20T09:06:13Z"
  },
  {
    "title": "Appeals court rules Trump had defensible rationale to seize California National Guard troops and can keep control",
    "description": "The deployment was the first by a president of a state National Guard without the governor’s permission since 1965.",
    "link": "https://fortune.com/2025/06/20/appeals-court-trump-defensible-rationale-california-national-guard-control/",
    "timestamp": "2025-06-20T09:04:53Z"
  },
  {
    "title": "Not just $Trump: Several top administration officials have put their money into crypto",
    "description": "From JD Vance to Pete Hegseth to Tulsi Gabbard, several top administration officials have put thousands of dollars into cryptocurrency.",
    "link": "https://www.businessinsider.com/trump-administration-officials-investments-cryptocurrency-bitcoin-2025-6",
    "timestamp": "2025-06-20T09:03:01Z"
  },
  {
    "title": "Star Trek: Strange New Worlds Is Ending, And Now I’m More Skeptical That A Spinoff Is In The Works For Several Reasons",
    "description": "I don't feel confident we're getting another adventure.",
    "link": "https://www.cinemablend.com/streaming-news/star-trek-strange-new-worlds-ending-more-skeptical-spinoff-in-works-several-reasons",
    "timestamp": "2025-06-20T09:02:00Z"
  },
  {
    "title": "One slide takedown of Trump?",
    "description": "I am giving a presentation on the U.S. It is geared for Japanese university ESL students and is a general overview of American society. During my short explanation of U.S. politics, I want to put in a slide dissing one Donald Trump and the Republican party...…",
    "link": "https://ask.metafilter.com/386188/One-slide-takedown-of-Trump",
    "timestamp": "2025-06-20T09:01:10Z"
  },
  {
    "title": "Trump's unpredictable Middle East moves actually follow a brilliant master plan",
    "description": "Trump's Middle East moves may be part of a strategy to revive the India-Middle East-Europe Corridor, a major infrastructure project designed to bypass China",
    "link": "https://www.foxnews.com/opinion/trumps-unpredictable-middle-east-moves-actually-follow-brilliant-master-plan",
    "timestamp": "2025-06-20T09:00:53Z"
  },
  {
    "title": "Israel's missile shield is failing, and shows Trump's Golden Dome unlikely to protect US from Russian and Chinese hypersonic nuke threats",
    "description": "Israel's air defenses face challenges from a barrage of Iranian missiles. Interception rates have decreased, and costs are rising. This raises concerns about the feasibility of the US's proposed Golden Dome space-based defense system. The US faces more advanc…",
    "link": "https://economictimes.indiatimes.com/news/international/us/israels-missile-shield-is-failing-and-shows-trumps-golden-dome-unlikely-to-protect-us-from-russian-and-chinese-hypersonic-nuke-threats/articleshow/121967781.cms",
    "timestamp": "2025-06-20T09:00:51Z"
  },
  {
    "title": "MAGA is split over potential U.S. involvement in the Middle East",
    "description": "Republican strategist Sarah Longwell says getting involved in the Israel-Iran conflict would be an \"unforgivable sin\" to many Trump supporters.",
    "link": "https://www.npr.org/2025/06/20/nx-s1-5439184/maga-divide-trump-strike-iran",
    "timestamp": "2025-06-20T09:00:50Z"
  },
  {
    "title": "REP RO KHANNA: A commonsense, bipartisan plan for immigration",
    "description": "Federal intervention in Los Angeles raises constitutional concerns as officials resist court orders. It highlights need for reform that respects immigrants",
    "link": "https://www.foxnews.com/opinion/rep-ro-khanna-commonsense-bipartisan-plan-immigration",
    "timestamp": "2025-06-20T09:00:49Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wave3.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T09:00:35Z"
  },
  {
    "title": "'I don't see any other way': Republicans push for gun tax cut in Trump's 'big, beautiful bill'",
    "description": "Senate Republicans aim to remove taxes on guns in Trump's \"big, beautiful bill,\" while Democrats plan to challenge \"ideological trophies\" through Senate rules.",
    "link": "https://www.foxnews.com/politics/i-dont-see-any-other-way-republicans-push-gun-tax-cut-trumps-big-beautiful-bill",
    "timestamp": "2025-06-20T09:00:16Z"
  },
  {
    "title": "The Terror of Life Under ICE",
    "description": "People snatched off the streets. Residents in hiding. This has been the past week in Los Angeles under one ICE raid after another.",
    "link": "http://nymag.com/intelligencer/article/ice-raids-los-angeles-terror.html",
    "timestamp": "2025-06-20T09:00:08Z"
  },
  {
    "title": "How opponents on the left are banding together to try to stop Andrew Cuomo in New York City",
    "description": "As high-profile longtime New York Democrats flock to Gov.",
    "link": "https://www.nbcnews.com/politics/elections/opponents-left-are-banding-together-try-stop-andrew-cuomo-new-york-cit-rcna212967",
    "timestamp": "2025-06-20T09:00:00Z"
  },
  {
    "title": "With his ‘golden share’ in U.S. Steel, Trump turns to a mechanism more common elsewhere in the world",
    "description": "Nippon Steel offered Washington a \"golden share,\" which gives the government oversight over some decisions, to get approval for its takeover of U.S. Steel.",
    "link": "https://fortune.com/asia/2025/06/20/golden-shares-us-steel-china-europe-russia-trump/",
    "timestamp": "2025-06-20T09:00:00Z"
  },
  {
    "title": "Bill Cassidy: A Profile in Cowardice",
    "description": "Gregg Gonsalves\n\n\n\nThe Louisiana Republican knew better than to vote for public health enemy RFK Jr. He did it anyway.\r\n\n\r\n\n\nThe post Bill Cassidy: A Profile in Cowardice appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=560751",
    "timestamp": "2025-06-20T09:00:00Z"
  },
  {
    "title": "Donald Trump Slams Fox News Over His Approval Ratings—'Why MAGA HATES'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said \"MAGA HATES\" Fox News after the network's latest pollin suggested he had an unfavorable approval rating.\nThe poll, conducted June 13-16 among 1,003 registered voters, found 54 perce…",
    "link": "https://biztoc.com/x/8ff55aa08619bccc",
    "timestamp": "2025-06-20T08:59:15Z"
  },
  {
    "title": "TikTok denies TRUMP memecoin buys in reply to congressman’s accusations",
    "description": "Bitcoin hater Brad Sherman has accused US President Donald Trump of accepting a $300 million bribe from TikTok, but TikTok denied it has anything to do with it.",
    "link": "https://cointelegraph.com/news/tiktok-denies-trump-memecoin-buy-brad-sherman",
    "timestamp": "2025-06-20T08:58:47Z"
  },
  {
    "title": "Best crypto to buy now as Arizona Senate revives BTC reserve bill",
    "description": "Bitcoin Pepe seeks to integrate Bitcoin’s security with the scalability of platforms like Solana. The BPEP token is currently priced at $0.0416. As per the team behind the project, the BPEP token will be listed on MEXC and BitMart. Bitcoin (BTC) remained stea…",
    "link": "https://coinjournal.net/news/best-crypto-to-buy-now-as-arizona-senate-revives-btc-reserve-bill/",
    "timestamp": "2025-06-20T08:58:36Z"
  },
  {
    "title": "Donald Trump Slams Fox News Over His Approval Ratings—'Why MAGA HATES'",
    "description": "The president took to his social media platform, Truth Social, to react to an unfavorable Fox News poll.",
    "link": "https://www.newsweek.com/donald-trump-slams-fox-news-approval-rating-maga-2088238",
    "timestamp": "2025-06-20T08:57:59Z"
  },
  {
    "title": "US lawmakers probe University of Michigan over Chinese nationals accused in agroterrorism fungus smuggling case",
    "description": "US Congress is investigating the University of Michigan. The probe focuses on research ties to Chinese nationals. These individuals are accused of smuggling a harmful fungus. The fungus poses a threat to crops. Lawmakers are concerned about security lapses. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-lawmakers-probe-university-of-michigan-over-chinese-nationals-accused-in-agroterrorism-fungus-smuggling-case/articleshow/121971729.cms",
    "timestamp": "2025-06-20T08:55:59Z"
  },
  {
    "title": "Conor McGregor aligns himself with world's highest IQ holder",
    "description": "Conor McGregor publicly supported a viral statement by YoungHoon Kim, who claims to hold the world’s highest IQ. Kim declared the Bible to be “perfect” and “final,” prompting McGregor to repost it with a simple affirmation. The fighter’s endorsement has spark…",
    "link": "https://economictimes.indiatimes.com/news/international/us/conor-mcgregor-aligns-himself-with-worlds-highest-iq-holder/articleshow/121971651.cms",
    "timestamp": "2025-06-20T08:55:09Z"
  },
  {
    "title": "Kremlin declines to predict when Putin and Trump may meet",
    "description": "Kremlin spokesman Dmitry Peskov stated on Friday that he cannot forecast a meeting between Russian President Vladimir Putin and U.S. President Donald Trump this year. Peskov expressed hope for an agreement with the United States on resuming negotiations to ad…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/kremlin-declines-to-predict-when-putin-and-trump-may-meet/articleshow/121971641.cms",
    "timestamp": "2025-06-20T08:51:30Z"
  },
  {
    "title": "Social Security Changes Direction After Mass Removals",
    "description": "Between May 2023 and 2024, the number of people claiming these benefits dropped by more than 100,000.",
    "link": "https://www.newsweek.com/social-security-ssi-claims-changes-direction-2088226",
    "timestamp": "2025-06-20T08:48:51Z"
  },
  {
    "title": "Missiles, Militants, and Markets: Pakistan’s quiet alliance with Iran runs deeper than you think",
    "description": "Amidst escalating tensions between Israel and Iran, Pakistan has openly condemned Israeli aggression, expressing solidarity with Iran. This alignment stems from shared security concerns, historical ties, and economic dependencies, particularly regarding energ…",
    "link": "https://economictimes.indiatimes.com/news/defence/pakistan-alliance-iran-israel-war-khamenei-shabaz-sharif-asim-munir-energy-security-baluchistan-geopolitics/articleshow/121971288.cms",
    "timestamp": "2025-06-20T08:47:30Z"
  },
  {
    "title": "How Trump Happened",
    "description": "By most accounts, wages play some part in the working-class disillusionment that fueled the rise of Donald Trump as a singularly destructive political force. But to get the diagnosis right requires a proper understanding of what lay behind the past half-centu…",
    "link": "https://www.project-syndicate.org/onpoint/roots-of-trump-destruction-of-organized-working-class-manufacturing-by-james-k-galbraith-2025-06",
    "timestamp": "2025-06-20T08:47:26Z"
  },
  {
    "title": "Taiwan May export orders rise on robust AI demand; geopolitical risks seen",
    "description": "Orders for goods from Taiwan, home to the world's largest contract chipmaker TSMC and other tech companies, are considered a bellwether of global technology demand. Export orders rose 18.5% year on year in May to $57.93 billion for a fourth consecutive monthl…",
    "link": "https://economictimes.indiatimes.com/tech/technology/taiwan-may-export-orders-rise-on-robust-ai-demand-geopolitical-risks-seen/articleshow/121971558.cms",
    "timestamp": "2025-06-20T08:46:56Z"
  },
  {
    "title": "White House floats a new funding trick — and GOP lawmakers grimace",
    "description": "The Republicans in charge of funding the government don't like what they're hearing from President Donald Trump's budget chief.",
    "link": "https://www.politico.com/news/2025/06/20/pocket-rescissions-white-house-funding-trick-00410444",
    "timestamp": "2025-06-20T08:45:00Z"
  },
  {
    "title": "Trump extends TikTok divestment deadline for another 90 days without clear legal basis—or legal challenges",
    "description": "President Donald Trump on Thursday signed an executive order to keep TikTok running in the U.S. for another 90 days to give his administration more time to broker a deal to bring the social media platform under American ownership.\nTrump disclosed the executiv…",
    "link": "https://biztoc.com/x/8636125c60680a72",
    "timestamp": "2025-06-20T08:39:13Z"
  },
  {
    "title": "IT stocks up 35% in less than 2 months. Can it withstand Fed caution and geopolitical risk?",
    "description": "Coforge has surged nearly 35%, with Tech Mahindra and LTIMindtree each rising 28%. Persistent Systems, HCLTech, Oracle Financial Services Software (OFSS), and Mphasis have recorded gains between 16% and 22%. Even large-cap players like Infosys and Wipro have …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-up-35-in-less-than-2-months-can-it-withstand-fed-caution-and-geopolitical-risk/articleshow/121971400.cms",
    "timestamp": "2025-06-20T08:37:07Z"
  },
  {
    "title": "Israel And Iran Launch Strikes A Week Into The War As New Diplomatic Effort Takes Shape",
    "description": "Britain’s foreign secretary said he met with U.S. Secretary of State Marco Rubio and envoy Steve Witkoff to discuss the potential for a deal.",
    "link": "https://www.huffpost.com/entry/israel-iran-conflict_n_68551b29e4b0dd3af0372bab",
    "timestamp": "2025-06-20T08:36:02Z"
  },
  {
    "title": "Europeans see a 'opportunity' for diplomacy as they meet Iran's top diplomat",
    "description": "Iran’s foreign minister plans to meet in Geneva with leading European counterparts, who hope to open a window for a diplomatic solution to the week-old military conflict that has seen Israeli airstrikes target Iranian nuclear and military sites and Teh...",
    "link": "https://abcnews.go.com/International/wireStory/europeans-window-opportunity-diplomacy-meet-irans-top-diplomat-123030800",
    "timestamp": "2025-06-20T08:34:19Z"
  },
  {
    "title": "Meet SOCOM, the special US forces that may enter Iran to take care of 'loose nukes'",
    "description": "President Trump is considering military action against Iran, with a decision expected within two weeks, contingent on potential negotiations. The U.S. is concerned about Iran's nuclear program, particularly the possibility of unsecured nuclear material. SOCOM…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/meet-socom-the-special-us-forces-that-may-enter-iran-to-take-care-of-loose-nukes/articleshow/121971247.cms",
    "timestamp": "2025-06-20T08:30:57Z"
  },
  {
    "title": "Zelensky Says Ukraine Needs $40 Billion Annually in 'Budgetary Support' to Keep Up Fight Against Russia",
    "description": "Volodymyr Zelensky said that Ukraine will need at least $40 billion per year from Western allies to ensure that it can keep up the fight against Russia and has called for additional pressure from the Trump administration on Moscow.\nThe post Zelensky Says Ukra…",
    "link": "https://www.breitbart.com/europe/2025/06/20/zelensky-says-ukraine-needs-40-billion-annually-in-budgetary-support-to-keep-up-fight-against-russia/",
    "timestamp": "2025-06-20T08:28:30Z"
  },
  {
    "title": "Iran, Europe set for first talks since Israel launched attacks on Tehran",
    "description": "Iran, UK, Germany, France and EU foreign ministers to meet in bid to avoid further escalation between Israel and Iran.",
    "link": "https://www.aljazeera.com/news/2025/6/20/iran-europe-set-for-first-talks-since-israel-launched-attacks-on-tehran",
    "timestamp": "2025-06-20T08:26:27Z"
  },
  {
    "title": "How Israelis view the conflict with Iran",
    "description": "As people in Israel wait out repeated missile attacks, some wonder how the conflict with Iran will impact the war in Gaza and the fate of hostages still held there. In one of Tel Aviv's underground bomb shelters — little more than a narrow corridor with thick…",
    "link": "https://www.dw.com/en/how-israelis-view-the-conflict-with-iran/a-72977256",
    "timestamp": "2025-06-20T08:26:00Z"
  },
  {
    "title": "Reid Hoffman: \"Even I am afraid\"",
    "description": "LinkedIn founder Reid Hoffman is one of the few Silicon Valley billionaires to openly oppose Donald Trump. He speaks about how he wants to convince others to do the same.",
    "link": "https://www.zeit.de/digital/2025-06/reid-hoffman-linkedin-donald-trump-tech-industry-silicon-valley",
    "timestamp": "2025-06-20T08:25:41Z"
  },
  {
    "title": "Trump extends TikTok divestment deadline for another 90 days without clear legal basis—or legal challenges",
    "description": "It is not clear how many times Trump can — or will — keep extending the ban as the government continues to try to negotiate a deal for TikTok, which is owned by China’s ByteDance.",
    "link": "https://fortune.com/2025/06/20/trump-extends-tiktok-divestment-deadline-90-days-legal-basis-challenges/",
    "timestamp": "2025-06-20T08:24:29Z"
  },
  {
    "title": "Putin Offers to 'Mediate' Israel-Iran War But Warns U.S. Against Involvement",
    "description": "Russia has \"stable, trusting ties\" with Israel and partnership with Iran, they claimed this week as it warned the U.S. against \"interfering\". \nThe post Putin Offers to ‘Mediate’ Israel-Iran War But Warns U.S. Against Involvement appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/06/20/russia-offers-to-mediate-israel-iran-war-warns-u-s-against-involvement/",
    "timestamp": "2025-06-20T08:21:48Z"
  },
  {
    "title": "US Banks That Fueled Ireland’s Finance Rebound Face Tariff Angst",
    "description": "US tariffs pose challenges for multinationals in Ireland, a country reliant on them for over 10% of jobs. CEOs from major banks like JPMorgan and Citi express optimism about growth despite trade uncertainties. With Ireland's economy tied to US negotiations, r…",
    "link": "https://www.livemint.com/companies/news/us-banks-that-fueled-ireland-s-finance-rebound-face-tariff-angst-11750407706965.html",
    "timestamp": "2025-06-20T08:21:46Z"
  },
  {
    "title": "Iran Uses Trump's Own Words Against Him",
    "description": "Trump has given himself two weeks to decide if the U.S. should strike Iran, a window of time for Tehran to make a new nuclear deal.",
    "link": "https://www.newsweek.com/iran-trump-words-israel-2088229",
    "timestamp": "2025-06-20T08:15:05Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wbrc.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T08:14:24Z"
  },
  {
    "title": "Trump Mobile’s ‘Made In USA’ T1 Phone Actually Made In China, Mirrors REVVL 7 Pro, Rebranded With Minor U.S. Tweaks And Nationalistic Marketing Spin",
    "description": "Ever since the Trump Organization officially launched its Trump Mobile on June 16, 2025, at the Trump Tower in New York City, the hype has been around the plans to unveil its first smartphone, the T1, that is considered to be an iPhone 17 competitor and comin…",
    "link": "https://wccftech.com/trump-mobiles-made-in-usa-t1-phone-actually-made-in-china-mirrors-revvl-7-pro-rebranded-with-minor-u-s-tweaks-and-nationalistic-marketing-spin/",
    "timestamp": "2025-06-20T08:11:58Z"
  },
  {
    "title": "Trump's strange neck marks beneath ruffled hair spark further health concerns - NewsBreak",
    "description": "The apparent health concern comes after rumors about the president's dementia dominated social media in recent months",
    "link": "https://www.newsbreak.com/share/4058582111802-trump-s-strange-neck-marks-beneath-ruffled-hair-spark-further-health-concerns?_f=app_share&amp;pd=07LsiGP6&amp;lang=en_US&amp;send_time=1750407042&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.24.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v8%2Cns_foryou_blend_exp_25q2-v3%2Cns_foryou_recall_exp_25q2-v8%2Cns_foryou_recall_exp_25q3-v6&amp;s=i2",
    "timestamp": "2025-06-20T08:11:20Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycottfoxcarolina.com",
    "link": "https://www.foxcarolina.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T08:09:10Z"
  },
  {
    "title": "Trump says U.S. businesses can’t afford all these holidays costing ‘billions of dollars’ as Americans mark end of slavery with Juneteenth",
    "description": "President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “very famous.”\nBut on this year’s Juneteenth holiday on Thursday, the usually talkative presi…",
    "link": "https://biztoc.com/x/e92c4766133f0272",
    "timestamp": "2025-06-20T08:08:42Z"
  },
  {
    "title": "Jen Psaki Uses Not 1 — But 2 — Supercuts To Undermine Trump’s Latest Claim",
    "description": "The MSNBC anchor also slammed the \"age-old mistake\" the media just made with the president.",
    "link": "https://www.huffpost.com/entry/jen-psaki-donald-trump-supercuts_n_68550dbce4b0af4d580ebfba",
    "timestamp": "2025-06-20T08:08:17Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.witn.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T08:03:58Z"
  },
  {
    "title": "Rod Stewart says he can no longer consider Donald Trump a friend since he became president",
    "description": "‘He became another guy. Somebody I didn't know,’ singer said",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/rod-stewart-donald-trump-elon-musk-glastonbury-b2773646.html",
    "timestamp": "2025-06-20T08:02:33Z"
  },
  {
    "title": "Trump says U.S. businesses can’t afford all these holidays costing ‘billions of dollars’ as Americans mark end of slavery with Juneteenth",
    "description": "But most retailers are open on Juneteenth while most federal workers get a day off because the government is closed.",
    "link": "https://fortune.com/2025/06/20/trump-businesses-cant-afford-holidays-billions-dollars-juneteenth/",
    "timestamp": "2025-06-20T08:02:14Z"
  },
  {
    "title": "Businesses confront mixed messages from Trump on whether their workers will be targeted by immigration raids",
    "description": "President Trump and his team have offered a series of pivots in recent weeks on how they are approaching immigration raids that are destabilizing industries ...",
    "link": "https://finance.yahoo.com/news/businesses-confront-mixed-messages-from-trump-on-whether-their-workers-will-be-targeted-by-immigration-raids-080052866.html",
    "timestamp": "2025-06-20T08:00:52Z"
  },
  {
    "title": "Democrats must find a message beyond constant attacks on Trump and ICE, says former Dem advisor",
    "description": "Former Democratic advisor Dan Turrentine criticizes the party for lacking an agenda, focusing on Trump instead of addressing real issues like Iran, the economy and immigration",
    "link": "https://www.foxnews.com/media/democrats-must-find-message-beyond-constant-attacks-trump-ice-says-former-dem-adviser",
    "timestamp": "2025-06-20T08:00:25Z"
  },
  {
    "title": "As the U.S. trade war drags, calls grow for Canada to cautiously improve ties with China",
    "description": "As Prime Minister Mark Carney's government works to reshape its economic policies amid an unpredictable administration south of the border, Canadian businesses that trade with China say Ottawa needs to find ways to expand exports there — and fast.",
    "link": "https://www.cbc.ca/news/canada/china-trade-canada-carney-trump-tariffs-1.7563570",
    "timestamp": "2025-06-20T08:00:00Z"
  },
  {
    "title": "Ex-Russian president warns of new Chernobyl",
    "description": "Former Russian President Dmitry Medvedev has warned that strikes on Iran could spark a nuclear catastrophe similar to Chernobyl Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/619927-medvedev-iran-chernobyl-disaster/",
    "timestamp": "2025-06-20T07:57:19Z"
  },
  {
    "title": "Iranian foreign minister holds talks with European counterparts after Trump's two-week deadline",
    "description": "Iranian Foreign Minister Abbas Araghchi is meeting in Geneva with his counterparts from Britain, France, Germany and the E.U. in an effort to end the weeklong conflict with Israel.",
    "link": "https://www.nbcnews.com/world/middle-east/live-blog/israel-iran-live-updates-trump-two-week-deadline-us-action-uk-eu-talk-rcna214040",
    "timestamp": "2025-06-20T07:53:40Z"
  },
  {
    "title": "Australian military deployed to help Middle East evacuees",
    "description": "More than 2000 Australians have registered for assistance to leave Iran, and there are still more than 1200 Australians registered for assistance to depart Israel.",
    "link": "https://7news.com.au/news/australian-military-deployed-to-help-middle-east-evacuees-c-19100780",
    "timestamp": "2025-06-20T07:50:18Z"
  },
  {
    "title": "Baseball team LA Dodgers refuse federal agents access to stadium amid US immigration raids",
    "description": "Images and video shared on social media showed a line of unmarked trucks and masked agents at one Dodger Stadium entrance.",
    "link": "https://www.thejournal.ie/la-dodgers-refuse-ice-agents-access-to-stadium-immigration-raids-6738354-Jun2025/",
    "timestamp": "2025-06-20T07:49:44Z"
  },
  {
    "title": "Are Israel’s attacks against Iran legal?",
    "description": "International law proscribes the use of force except in self-defence - but what constitutes self-defence?",
    "link": "https://www.aljazeera.com/news/2025/6/20/are-israels-attacks-against-iran-legal",
    "timestamp": "2025-06-20T07:47:19Z"
  },
  {
    "title": "US joining Israeli strikes would cause HELL, Iranian minister tells BBC",
    "description": "The US joining Israeli strikes would cause \"hell for the whole region\", Iran's deputy foreign minister has told the BBC. Saeed Khatibzadeh said this is \"not America's war\" and if US President Donald Trump does get involved, he will always be remembered as \"a …",
    "link": "https://freerepublic.com/focus/f-news/4324188/posts",
    "timestamp": "2025-06-20T07:42:29Z"
  },
  {
    "title": "Trump 'Golden Dome' plan tricky and expensive: experts",
    "description": "Le Bourget, France (AFP) June 19, 2025\n\n\n President Donald Trump's proposed \"Golden Dome\" defence system is a plan that will face mammoth technical and financial hurdles, and could increase global insecurity, experts say. \n\nTrump announced plans for the space…",
    "link": "https://www.spacewar.com/reports/Trump_Golden_Dome_plan_tricky_and_expensive_experts_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "Can NATO keep Trump on-message about Russia threat?",
    "description": "Brussels, Belgium (AFP) June 20, 2025\n\n\n When leaders from NATO's 32 countries gather for a summit in The Hague next week, most want to send a clear message: Russia is the main threat to their alliance. \n\nBut the loudest voice in the room likely won't be on t…",
    "link": "https://www.spacewar.com/reports/Can_NATO_keep_Trump_on-message_about_Russia_threat_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "British FM says 'window now exists' for diplomacy with Iran",
    "description": "Washington (AFP) June 19, 2025\n\n\n On the eve of European talks with Iran over its nuclear program, Britain's Foreign Secretary David Lammy said Thursday after meeting high-level US officials that there is still time to reach a diplomatic solution with Tehran.…",
    "link": "https://www.spacewar.com/reports/British_FM_says_window_now_exists_for_diplomacy_with_Iran_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "Russia warns US against 'military intervention' in Iran-Israel war",
    "description": "Moscow (AFP) June 19, 2025\n\n\n Russia on Thursday warned the United States not to take military action against Iran, amid speculation over whether Washington would enter the war alongside Israel. \n\nIsrael launched an unprecedented wave of strikes at Iran last …",
    "link": "https://www.spacewar.com/reports/Russia_warns_US_against_military_intervention_in_Iran-Israel_war_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "US military aircraft no longer visible at base in Qatar: satellite images",
    "description": "Washington (AFP) June 19, 2025\n\n\n Dozens of US military aircraft are no longer on the tarmac at a major US base in Qatar, satellite images show - a possible move to shield them from eventual Iranian air strikes, as Washington weighs whether to intervene in Te…",
    "link": "https://www.spacedaily.com/reports/US_military_aircraft_no_longer_visible_at_base_in_Qatar_satellite_images_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "Israel changing 'the world' with Iran war as Netanyahu welcomes 'all help'",
    "description": "Jerusalem (AFP) June 19, 2025\n\n Israeli Prime Minister Benjamin Netanyahu said Thursday that Israel was \"changing the face of the world\" in its war with Iran, as he welcomed \"all help\" in destroying the Islamic republic's nuclear sites. \n\n\"I said that we're c…",
    "link": "https://www.spacewar.com/reports/Israel_changing_the_world_with_Iran_war_Netanyahu_999.html",
    "timestamp": "2025-06-20T07:42:10Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.fox19.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T07:34:38Z"
  },
  {
    "title": "Crude Sinks As Trump Delays Decision On Iran Strike",
    "description": "Oil prices tumbled Friday and equity traders fought to end a volatile week on a positive note after Donald Trump said he would consider over the next two weeks whether to join Israel's attacks on Iran.",
    "link": "https://www.ibtimes.com/crude-sinks-trump-delays-decision-iran-strike-3776301",
    "timestamp": "2025-06-20T07:33:17Z"
  }
]