[
  {
    "title": "Crypto Analysts Cite Market Recovery After $19B Liquidations – Bitcoin Hyper Presale Nears $24M",
    "description": "Quick Facts: 1️⃣ Despite $19B in recent liquidations, CryptoQuant and Glassnode report growing signs of market recovery. 2️⃣ The analysts highlight a surge in $USDT supply, major whale buys and consistent ETF inflows as bullish signals for the crypto sector’s…",
    "link": "https://bitcoinist.com/analysts-foresee-market-recovery-hyper-nears-24m/",
    "timestamp": "2025-10-15T10:54:55Z"
  },
  {
    "title": "Barron Trump tipped for top job at TikTok? US President shares rare update on his NYU struggles as rumours swirl online",
    "description": "Barron Trump, son of Donald and Melania Trump, is being considered for a board position at TikTok. This comes as the social media platform faces a potential sale to American investors. The move aims to enhance TikTok's appeal to young users. Donald Trump hims…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-tipped-for-top-job-at-tiktok-us-president-shares-rare-update-on-his-nyu-struggles-as-rumours-swirl-online/articleshow/124575179.cms",
    "timestamp": "2025-10-15T10:52:13Z"
  },
  {
    "title": "Prince Andrew Allegedly Told Jeff Epstein ‘We’ll Play Some More Soon’ After Virginia Giuffre Photo Leaked Online",
    "description": "Newly surfaced emails suggest Prince Andrew maintained contact with Jeffrey Epstein even after publicly cutting ties with the convicted sex offender. According to The Guardian, an email dated February 28, 2011, shows the Duke of York telling Epstein, “We are …",
    "link": "https://mediatakeout.com/prince-andrew-allegedly-told-jeff-epstein-well-play-some-more-soon-after-virginia-giuffre-photo-leaked-online/",
    "timestamp": "2025-10-15T10:47:52Z"
  },
  {
    "title": "US stocks jump today: Dow, S&P 500, Nasdaq futures gain over 0.5% as Wall Street bets on rate cuts; Tesla and AMD rally, gold hits record high, bank earnings drive market buzz",
    "description": "US stock futures are climbing fast today. Investors are betting on interest-rate cuts. The Dow rose about 0.4%, the S&P 500 added 0.6%, and Nasdaq futures surged 0.8%. Fed Chair Jerome Powell hinted the economy faces risks, boosting hopes for rate cuts. The e…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-jump-today-15-october-2025-dow-sp-500-nasdaq-futures-gain-over-0-5-as-wall-street-bets-on-rate-cuts-tesla-and-amd-rally-gold-hits-record-high-bank-earnings-drive-market-buzz/articleshow/124574825.cms",
    "timestamp": "2025-10-15T10:47:30Z"
  },
  {
    "title": "Trump officials back firm in fight over California offshore oil drilling after huge spill",
    "description": "One of California’s worst oil spills occurred off the Santa Barbara coast in 2015, when a corroded pipeline burst",
    "link": "https://abcnews.go.com/Business/wireStory/trump-officials-back-firm-fight-california-offshore-oil-126534918",
    "timestamp": "2025-10-15T10:45:26Z"
  },
  {
    "title": "MAGA’s fake Super Bowl halftime show reveals their real failures",
    "description": "Turning Point USA's followers are pitifully out-of-touch with pop culture",
    "link": "https://www.salon.com/2025/10/15/magas-fake-super-bowl-halftime-show-reveals-their-real-failures/",
    "timestamp": "2025-10-15T10:45:19Z"
  },
  {
    "title": "‘Arc De Trump’: Prez Plans Paris-Style Monument in DC as His Next Big Build",
    "description": "Trump is taking his taste for grandeur to a new level and is planning an “Arc de Trump” on the edge of Washington, D.C., inspired by Paris’s Arc de Triomphe.\nThe post ‘Arc De Trump’: Prez Plans Paris-Style Monument in DC as His Next Big Build first appeared o…",
    "link": "https://www.mediaite.com/media/news/arc-de-trump-prez-plans-paris-style-monument-in-dc-as-his-next-big-build/",
    "timestamp": "2025-10-15T10:43:15Z"
  },
  {
    "title": "Szijjarto Says Hungary Will Not Allow Anyone to Dictate on Energy Resource Purchases",
    "description": "MOSCOW (Sputnik) - Hungary will not allow anyone to dictate where Budapest can purchase energy resources, Hungarian Foreign Minister Peter Szijjarto said on Wednesday.",
    "link": "https://sputnikglobe.com/20251015/szijjarto-says-hungary-will-not-allow-anyone-to-dictate-on-energy-resource-purchases-1122964258.html",
    "timestamp": "2025-10-15T10:42:09Z"
  },
  {
    "title": "Transcript: Trump Erupts in “Mad King” Tirades as Presser Goes Awry",
    "description": "The following is a lightly edited transcript of the October 15 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. President…",
    "link": "https://newrepublic.com/article/201782/transcript-trump-erupts-mad-king-tirades-presser-goes-awry",
    "timestamp": "2025-10-15T10:41:20Z"
  },
  {
    "title": "Morning Bid: Fed balm soothes trade war jabs",
    "description": "and global markets today , Editor-At-Large, Finance and Markets Edgier world markets appeared to bat away the latest testy exchanges in the re-heated U...",
    "link": "https://finance.yahoo.com/news/morning-bid-fed-balm-soothes-103652904.html",
    "timestamp": "2025-10-15T10:36:52Z"
  },
  {
    "title": "Netanyahu in court for graft trial appearance",
    "description": "TEL AVIV: Israel's Prime Minister Benjamin Netanyahu was back in a Tel Aviv court on Wednesday (Oct 15) for the latest hearing in his long-running corruption trial, which opened in May 2020.The prime minister kept a smiling face as he and his entourage of sev…",
    "link": "https://www.channelnewsasia.com/world/israel-benjamin-netanyahu-court-graft-trial-trump-pardon-5404011",
    "timestamp": "2025-10-15T10:36:17Z"
  },
  {
    "title": "‘Absurd’: Noem claim to have arrested ‘antifa’ founder’s girlfriend stirs ridicule",
    "description": "A dramatic claim by Homeland Security Secretary Kristi Noem to have arrested “the girlfriend of one of the founders of antifa,” therefore putting the Trump administration in position to “eliminate” the leftwing “network,” was dismissed by both the activist th…",
    "link": "https://www.rawstory.com/kristi-noem-2674185165/",
    "timestamp": "2025-10-15T10:32:36Z"
  },
  {
    "title": "Stephen Colbert Offers Trump a More ‘Flattering’ Time Cover Mock-Up – With a Brutal Twist",
    "description": "Colbert offered Trump an alternative cover that he’d mocked up featuring the president standing with convicted pedophile Jeffrey Epstein.\nThe post Stephen Colbert Offers Trump a More ‘Flattering’ Time Cover Mock-Up – With a Brutal Twist first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-offers-trump-a-more-flattering-time-cover-mock-up-with-a-brutal-twist/",
    "timestamp": "2025-10-15T10:32:10Z"
  },
  {
    "title": "John Roberts is slowly dismantling America",
    "description": "Twenty years of the Roberts Court has wreaked shocking damage. Is the Voting Rights Act next?",
    "link": "https://www.salon.com/2025/10/15/john-roberts-is-slowly-dismantling-america/",
    "timestamp": "2025-10-15T10:30:44Z"
  },
  {
    "title": "EU scramble for anti-Russia 'drone wall' hits political, technical hurdles",
    "description": "Europe is urgently seeking enhanced drone protection following recent airspace incursions. An EU proposal, initially met with skepticism, is evolving to a continent-wide initiative, drawing on Ukraine's combat experience. The plan aims to integrate advanced s…",
    "link": "https://economictimes.indiatimes.com/news/defence/eu-scramble-for-anti-russia-drone-wall-hits-political-technical-hurdles/articleshow/124574761.cms",
    "timestamp": "2025-10-15T10:30:38Z"
  },
  {
    "title": "Canadian economy falling into recession thanks to Trump tariffs, Crown corporation forecasts",
    "description": "Export Development Canada is forecasting economic growth of just 0.9 per cent for 2025, inching up next year to just one per cent",
    "link": "https://nationalpost.com/news/canada/canadian-economy-falling-into-recession-thanks-to-trump-tariffs-federal-agency-forecasts",
    "timestamp": "2025-10-15T10:30:23Z"
  },
  {
    "title": "Trump Saved This Vietnamese Real Estate Mogul’s Fortune. Now They Are Opening A Golf Resort Together",
    "description": "Dang Thanh Tam’s business got a boost from Donald Trump’s first-term trade wars. New tariffs might hurt him, but he has an ace up his sleeve: a $1.5 billion luxury project with Trump.",
    "link": "https://www.forbes.com/sites/giacomotognini/2025/10/15/trump-saved-this-vietnamese-real-estate-moguls-fortune-now-they-are-opening-a-golf-resort-together/",
    "timestamp": "2025-10-15T10:30:00Z"
  },
  {
    "title": "Why No One Really Knows How Much Money The Trumps Are Making Right Now",
    "description": "A crypto company has taken in more money than almost any other entity in the president’s empire. But thanks to a secretive agreement, it remains unclear who is really receiving the cash.",
    "link": "https://www.forbes.com/sites/danalexander/2025/10/15/why-no-one-really-knows-how-much-money-the-trumps-are-making-right-now/",
    "timestamp": "2025-10-15T10:30:00Z"
  },
  {
    "title": "Could Tomahawk missiles be a game-changer for Ukraine and could they strike Moscow?",
    "description": "There's speculation Donald Trump is about to rubber stamp long-range Tomahawk missiles for Ukraine. It would be a major boost to Kyiv - but Russia has warned of a \"serious escalation\".",
    "link": "https://news.sky.com/story/could-tomahawks-be-game-changer-for-ukraine-and-could-they-strike-moscow-13450521",
    "timestamp": "2025-10-15T10:24:00Z"
  },
  {
    "title": "Why is Donald Trump considering ban on Chinese cooking oil, and how are trade tensions affecting US farmers?",
    "description": "President Donald Trump intensified trade tensions with China on Tuesday, warning of a possible ban on cooking oil imports after Beijing stopped buying U.S. soybeans.",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-donald-trump-considering-ban-on-chinese-cooking-oil-and-how-are-trade-tensions-affecting-us-farmers/articleshow/124574341.cms",
    "timestamp": "2025-10-15T10:23:32Z"
  },
  {
    "title": "US Revokes Six Visas Over Charlie Kirk Death Amid Social Media Crackdown",
    "description": "The US revokes six foreign visas after individuals celebrate Charlie Kirk's death online, warning that glorifying violence will not be tolerated.",
    "link": "https://www.ibtimes.com/us-revokes-six-visas-over-charlie-kirk-death-amid-social-media-crackdown-3787086",
    "timestamp": "2025-10-15T10:22:48Z"
  },
  {
    "title": "Trump in a 'far darker' place than he admits — and GOP has 'no way' to escape: analyst",
    "description": "President Donald Trump and his Republican caucus have revealed that they are in a \"far darker\" political place than they currently admit publicly as the current budget fight continues to fracture the base, according to one political strategist. Simon Rosenber…",
    "link": "https://www.rawstory.com/trump-2674185264/",
    "timestamp": "2025-10-15T10:21:01Z"
  },
  {
    "title": "Florida judge halts transfer of downtown Miami land for Trump’s presidential library",
    "description": "A Florida judge on Tuesday temporarily blocked the planned transfer of prime downtown Miami land for President Donald Trump’s future presidential library",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-presidential-library-judge-blocks-miami-land-transfer-rcna237725",
    "timestamp": "2025-10-15T10:20:36Z"
  },
  {
    "title": "RBI sees rupee under speculative attack, will intervene further",
    "description": "On Wednesday, the rupee surged almost 1% after the RBI intervened, before paring its gain to trade at 88.31 per dollar",
    "link": "https://www.bloomberg.com/news/articles/2025-10-15/rbi-sees-rupee-under-speculative-attack-will-intervene-further",
    "timestamp": "2025-10-15T10:20:07Z"
  },
  {
    "title": "Body that Hamas returned to Israel is not one of the hostages, Israel says",
    "description": "A body Hamas returned to Israel as part of President Trump's ceasefire deal is not that of any of the hostages, the Israel Defense Forces said Wednesday.",
    "link": "https://www.nbcnews.com/world/gaza/body-returned-hamas-not-hostage-israel-says-rcna237720",
    "timestamp": "2025-10-15T10:18:47Z"
  },
  {
    "title": "Prabowo seen as global peacemaker at Gaza Summit: Minister",
    "description": "President Prabowo Subianto is regarded as a resourceful and peace-driven figure by leaders at various international forums, Foreign Affairs Minister Sugiono ...",
    "link": "https://en.antaranews.com/news/386137/prabowo-seen-as-global-peacemaker-at-gaza-summit-minister",
    "timestamp": "2025-10-15T10:12:57Z"
  },
  {
    "title": "Venezuelan Nobel Winner Dedicates Peace Prize to Donald Trump — Says He Deserved It More",
    "description": "Venezuelan opposition leader María Corina Machado, awarded the 2025 Nobel Peace Prize for her fight for democracy, surprised many by dedicating the honor to Donald Trump. Her remarks praised his 'decisive support' for Venezuela's opposition, drawing both admi…",
    "link": "https://www.ibtimes.com/venezuelan-nobel-winner-dedicates-peace-prize-donald-trump-says-he-deserved-it-more-3787118",
    "timestamp": "2025-10-15T10:10:41Z"
  },
  {
    "title": "Hamas will disarm or ‘we will disarm them’ – Trump",
    "description": "The disarmament of Hamas should take place within a “reasonable period of time,” the US president has warned\n\n  Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626463-trump-hamas-disarmament/",
    "timestamp": "2025-10-15T10:10:19Z"
  },
  {
    "title": "US government shutdown is putting a strain on the aviation system",
    "description": "The U.S. government shutdown’s strain on the aviation system is starting to show. An air traffic control tower near Los Angeles closed for six hours less than a week into the shutdown because of a controller shortage. Since the shutdown began Oct. 1, the FAA …",
    "link": "https://apnews.com/article/us-government-shutdown-travel-aviation-flight-delays-211022120bf96ab95dc6861ca5a7e32d",
    "timestamp": "2025-10-15T10:09:56Z"
  },
  {
    "title": "Aid cuts ‘risk pushing 13.7 mln people into extreme hunger’",
    "description": "The U.N.'s World Food Program warned on Wednesday that \"staggering\" cuts to its funding risked pushing up to 13.7 million people currently receiving food aid into \"emergency\" levels of hunger, one step before famine.",
    "link": "https://www.hurriyetdailynews.com/aid-cuts-risk-pushing-13-7-mln-people-into-extreme-hunger-214698",
    "timestamp": "2025-10-15T10:09:00Z"
  },
  {
    "title": "JPMorgan plans $600bn asset growth in Asia-Pacific within five years-report",
    "description": "Australia, China, and Japan are expected to be the primary contributors to this growth target.",
    "link": "https://www.privatebankerinternational.com/news/jpmorgan-asia-pacific/",
    "timestamp": "2025-10-15T10:08:47Z"
  },
  {
    "title": "Don the Builder: Inside Trump's White House makeover (Marc Caputo/Axios)",
    "description": "Marc Caputo / Axios:\nDon the Builder: Inside Trump's White House makeover  —  Donald Trump is obsessing over remodeling the White House like no other president.  — He has gilded the Oval Office, replaced trees, paved the Rose Garden lawn, hung art and mirrors…",
    "link": "https://www.memeorandum.com/251015/p14",
    "timestamp": "2025-10-15T10:05:01Z"
  },
  {
    "title": "Denmark To Beef Up Defense With 16 More F-35s",
    "description": "Part Of Overall Security Buildup In Greenland, Faroe Islands Denmark announced it will purchase 16 more F-35 Lightning II jets as part of its military spending package that will include two new Arctic-ready ships, patrol aircraft, drones, an early warning rad…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=0DA7C71D-5FCE-48AE-945B-03309538DB7D",
    "timestamp": "2025-10-15T10:05:00Z"
  },
  {
    "title": "기약 없는 셧다운, APEC 앞두고 관세협상 불투명",
    "description": "Trump pushes mass firings at HUD amid shutdown https://t.co/Cv8JrJcOpl— Bloomberg CityLab (@CityLab) October 14, 2025 The biggest blow will fall on Canada. The two countries have been locked in a decades-long dispute over US claims that Canada unfairly subsid…",
    "link": "https://ryueyes11.tistory.com/511933",
    "timestamp": "2025-10-15T10:04:02Z"
  },
  {
    "title": "Trump Drags Middle East Toward Peace—Maybe | Opinion",
    "description": "By sheer force of will and a style bordering on mafia-like, President Donald Trump appears to have dragged the Middle East to the brink of an unlikely peace. Basking in applause at the Knesset on Monday, he declared that Israel’s long war was over. It was per…",
    "link": "https://biztoc.com/x/cd099d9318422dff",
    "timestamp": "2025-10-15T10:02:47Z"
  },
  {
    "title": "Aid pro quo: Trump weaponises foreign help",
    "description": "After cancelling much of America’s international development funding, President Donald Trump is now using that money to boost friends, allies against China and buy goods and influence. Ukraine is striking Russia’s fuel infrastructure deep inside the country. …",
    "link": "https://biztoc.com/x/1fe22872eb5a8f90",
    "timestamp": "2025-10-15T10:02:16Z"
  },
  {
    "title": "Rep. Seth Moulton invokes age in launching Democratic primary challenge against Sen. Ed Markey of Massachusetts | CNN Politics",
    "description": "Invoking the specter of Joe Biden and decrying Democrats whom he says have “clung to the status quo, insisted on using the same old playbook – and isn’t fighting hard enough,” Rep. Seth Moulton launched a primary challenge on Wednesday against Massachusetts S…",
    "link": "https://www.cnn.com/2025/10/15/politics/seth-moulton-launches-senate-primary-ed-markey",
    "timestamp": "2025-10-15T10:01:51Z"
  },
  {
    "title": "Trump’s swipe at ‘weak’ leaders highlights the shifting global influence of Western nations",
    "description": "Amid Trump’s visit to Egypt and Israel to celebrate the release of hostages held by Hamas and to usher in a new era of Mideast peace, some say Western influence is waning.",
    "link": "https://www.foxnews.com/world/trumps-swipe-weak-leaders-highlights-shifting-global-influence-western-nations",
    "timestamp": "2025-10-15T10:00:45Z"
  },
  {
    "title": "Joe Oliver: Canada’s survival depends on treating Alberta fairly",
    "description": "Ottawa needs to tread lightly on two issues: oil and gas and the notwithstanding clause. Is Mark Carney wise and strong enough to back off?",
    "link": "https://financialpost.com/opinion/joe-oliver-canadas-survival-depends-on-treating-alberta-fairly",
    "timestamp": "2025-10-15T10:00:21Z"
  },
  {
    "title": "Israeli military says one of the bodies handed over by Hamas is not that of hostage",
    "description": "Tensions rise over a fragile ceasefire as Israel's military states one of four bodies returned by Hamas is not a hostage. This follows the release of the last living hostages, with Israel awaiting the return of 28 deceased individuals. Prime Minister Netanyah…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-military-says-one-of-the-bodies-handed-over-by-hamas-is-not-that-of-hostage/articleshow/124574029.cms",
    "timestamp": "2025-10-15T10:00:07Z"
  },
  {
    "title": "A House of Dynamite Explodes the Missile Defense Myth",
    "description": "Kathryn Bigelow’s riveting new thriller, A House of Dynamite, begins with a soothing reminder of our recent past. White letters scroll across a black screen: “At the end of the Cold War, nations reached consensus that we should have fewer nuclear weapons.” Th…",
    "link": "https://newrepublic.com/article/201658/house-dynamite-explodes-missile-defense-myth",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Sask. looks to diversify canola export markets as Chinese, U.S. tariffs bite",
    "description": "According to data from the Canola Council of Canada, China and the United States together comprised more than 83 per cent of Saskatchewan's canola exports. Amid tariff woes and trade uncertainty, the province is looking to diversify export markets.",
    "link": "https://www.cbc.ca/news/canada/saskatchewan/sask-eyes-asean-canola-market-while-diversifying-9.6938761",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "How a Climate Doomsayer Became an Unexpected Optimist",
    "description": "Bill McKibben isn’t known for his rosy outlook on climate change. Back in 1989, he wrote The End of Nature, which is considered the first mainstream book warning of global warming’s potential effects on the planet. Since then, he’s been an ever-present voice …",
    "link": "https://www.motherjones.com/politics/2025/10/climate-change-bill-mckibben-solar-power-renewable-energy/",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "NYC mayoral hopeful Sliwa blasts Mamdani and Cuomo, urges Trump to stay out of race",
    "description": "New York City Republican mayoral candidate Curtis Sliwa told CBS News President Trump should stay out of the race — arguing that he's strengthening Zohran Mamdani.",
    "link": "https://www.cbsnews.com/newyork/news/nyc-mayor-race-curtis-sliwa-zohran-mamdani-andrew-cuomo/",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Hiltzik: Corporate tax breaks are exploding the federal deficit, but who gets the benefits?",
    "description": "Business tax breaks cut federal revenues by $77 billion this year, fattening the pockets of rich corporate insiders.",
    "link": "https://finance.yahoo.com/news/hiltzik-corporate-tax-breaks-exploding-100000845.html",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "The Media Is Blowing a Big Story in Venezuela",
    "description": "How’s this for history repeating? The mainstream American media is botching its coverage of the Trump administration’s mounting military threats to Venezuela, and that failure is contributing to what looks to be a prolonged and violent disaster for both natio…",
    "link": "https://newrepublic.com/article/201512/media-courting-colossal-failure-venezuela",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Don’t Blame the Democrats for Trump’s Revenge Tour",
    "description": "Defending Trump’s lawfare as just deserts misremembers what actually happened.",
    "link": "https://www.theatlantic.com/politics/archive/2025/10/trump-political-prosecution-democrats/684556/",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Why Shame No Longer Works in American Politics",
    "description": "The various reactions to Charlie Kirk’s murder expose something both unsettling and defining about our political era: Shame is gone for good. Like his ally Donald Trump, Kirk was a far-right provocateur who spent years targeting vulnerable groups and helping …",
    "link": "https://newrepublic.com/article/201513/shame-no-longer-works-american-politics",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "The Voting Rights Act is at further risk as the Roberts Court hears Louisiana map appeal",
    "description": "The justices will hear oral argument Wednesday in Louisiana v. Callais, a case that could further gut the landmark law that the Roberts-led court has already weakened.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-voting-rights-act-supreme-louisiana-map-redistricting-rcna237637",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "How I Became a Populist",
    "description": "I.I got the call a little before 5 p.m. on a Friday. My wife, Sima, and I were sitting on the couch with our kids, probably watching Curious George. The White House vetting process had gone on for months. Yet, despite the Zooms and document requests and endle…",
    "link": "https://newrepublic.com/article/201171/alvaro-bedoya-ftc-became-populist",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Democrats want to play it safe in Maine’s white-hot Senate race. That’s a mistake.",
    "description": "Democrats should embrace an open primary field in the race to beat Maine GOP Sen. Susan Collins.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/susan-collins-maine-primary-election-democrats-janet-mills-rcna237576",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "How Apple gave ICE agents the ‘Blue Lives Matter’ treatment",
    "description": "The tech giant removed an app that helped communities log immigration law enforcement activity, in part because agents could be part of a “targeted group.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/apple-ice-agents-blue-lives-matter-app-store-rcna236990",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Donald Trump Absolutely Loves Attention. So Does James Comey",
    "description": "The former FBI director just wouldn’t yield the stage—which is surely one reason he drives Trump so crazy.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-absolutely-loves-attention-so-does-james-comey",
    "timestamp": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Millions Set to Lose Obamacare Subsidies",
    "description": "Washington Post: “Some 22 million Americans are set to lose health insurance subsidies by the end of the year...” “About 80 percent of the people who benefit from them live in states that Donald Trump",
    "link": "https://politicalwire.com/2025/10/15/millions-set-to-lose-obamacare-subsidies/",
    "timestamp": "2025-10-15T09:59:57Z"
  },
  {
    "title": "The government shutdown putting spotlight on the cracks in the US aviation system",
    "description": "The U.S. government shutdown’s strain on the aviation system is starting to show",
    "link": "https://abcnews.go.com/Business/wireStory/government-shutdown-putting-renewed-spotlight-cracks-us-aviation-126537651",
    "timestamp": "2025-10-15T09:57:58Z"
  },
  {
    "title": "Rise and Fall: Manisha Rani picks Akriti Negi over Aarush Bhola to rise in penthouse, leaving everyone shocked",
    "description": "The grand finale week of Rise and Fall is underway, with Workers facing a shocking announcement: the Basement could shut down anytime. They must now hand over a pin to the contestant they believe deserves to move to the Penthouse, leading to unexpected allian…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/rise-and-fall-manisha-rani-picks-akriti-negi-over-aarush-bhola-to-rise-in-penthouse-leaving-everyone-shocked/articleshow/124571755.cms",
    "timestamp": "2025-10-15T09:57:36Z"
  },
  {
    "title": "Trump likely to aid GOP nominee for NJ governor",
    "description": "United States President Donald Trump is planning to boost his support for Jack Ciattarelli, the Republican Party's nominee in the upcoming gubernatorial election in New Jersey, scheduled for November ...",
    "link": "https://biztoc.com/x/0796513bd65c8584",
    "timestamp": "2025-10-15T09:51:13Z"
  },
  {
    "title": "IDF: One of the Bodies Returned by Hamas Terrorists Is Not a Hostage",
    "description": "One of the bodies handed over by Hamas terrorists as part of the Middle East ceasefire deal is not one of the hostages who was held in Gaza, the Israeli military said Wednesday.\nThe post IDF: One of the Bodies Returned by Hamas Terrorists Is Not a Hostage app…",
    "link": "https://www.breitbart.com/europe/2025/10/15/idf-one-of-the-bodies-returned-by-hamas-terrorists-is-not-a-hostage/",
    "timestamp": "2025-10-15T09:49:22Z"
  },
  {
    "title": "Trump renews threat to cut 'Democrat Programs' during shutdown",
    "description": "Two weeks into the government shutdown, President Trump is leveraging the stalemate for political advantage, aiming to pressure Democrats while shielding his administration. He has threatened to cut funding for \"Democratic programs\" while sparing \"Republican …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-renews-threat-to-cut-democrat-programs-during-shutdown/articleshow/124573772.cms",
    "timestamp": "2025-10-15T09:48:38Z"
  },
  {
    "title": "He Fought Trump’s Texas Power Grab. Now He’s Defending Himself in Court.",
    "description": "A veteran of the state’s politics explains why his case matters, why Texas hasn’t gone from red to purple, and why he hasn’t given up hope.",
    "link": "https://slate.com/news-and-politics/2025/10/beto-orourke-2026-midterms-trump.html",
    "timestamp": "2025-10-15T09:45:00Z"
  },
  {
    "title": "Aid trucks roll into Gaza as dispute over hostage bodies is paused",
    "description": "JERUSALEM/CAIRO (Reuters) -Aid trucks rolled into Gaza on Wednesday and Israel resumed preparations to open the main Rafah crossing after a dispute over the ...",
    "link": "https://www.yahoo.com/news/articles/aid-trucks-roll-gaza-dispute-094412043.html",
    "timestamp": "2025-10-15T09:44:12Z"
  },
  {
    "title": "Climate denial and the defence of modernity",
    "description": "What we are lacking is an inspiring vision of our lives, collective futures, and spiritual reality in a world in which we cannot keep growing forever. As much as we need policy wonks, scientists, and campaigners, now is the time for religious thinkers, philos…",
    "link": "https://www.resilience.org/stories/2025-10-15/climate-denial-and-the-defence-of-modernity/",
    "timestamp": "2025-10-15T09:43:27Z"
  },
  {
    "title": "Oil down as market weighs excess supply and US-China trade tensions",
    "description": "LONDON (Reuters) -Oil prices edged lower on Wednesday, as investors weighed the International Energy Agency's prediction of a supply surplus in 2026 and...",
    "link": "https://finance.yahoo.com/news/oil-down-market-weighs-excess-094156357.html",
    "timestamp": "2025-10-15T09:41:56Z"
  },
  {
    "title": "Jason Kelce is embroiled in a racist controversy involving Bad Bunny and the Super Bowl show",
    "description": "Jason Kelce became the unexpected focus of controversy after a fake quote attributed to him went viral on social media in the uproar following the NFL&apos;s announcement that glob",
    "link": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/10/15/68ef6bd8ca4741f0108b45a7.html",
    "timestamp": "2025-10-15T09:41:24Z"
  },
  {
    "title": "Finland to purchase US arms for Ukraine",
    "description": "The government has not disclosed how much Finland will contribute financially.",
    "link": "https://yle.fi/a/74-20188481",
    "timestamp": "2025-10-15T09:38:02Z"
  },
  {
    "title": "Wednesday Morning Open Thread: They Break Upon Us",
    "description": "mike johnson’s son currently confiscating his phone and deleting all his news apps [image or embed] — GHOULLIKEHELLMACHINE (@golikehellmachine.com) October 14, 2025 at 7:53 PM === i am making a THEY DO NOT BREAK US THEY BREAK UPON US flag that i will wave as …",
    "link": "https://balloon-juice.com/2025/10/15/wednesday-morning-open-thread-they-break-upon-us/",
    "timestamp": "2025-10-15T09:33:41Z"
  },
  {
    "title": "Hamas is battling powerful clans for control in Gaza – who are these groups and what threat do they pose?",
    "description": "Many clans and gangs are taking advantage of a security vacuum in Gaza to reassert their authority – some backed by Israel.",
    "link": "https://theconversation.com/hamas-is-battling-powerful-clans-for-control-in-gaza-who-are-these-groups-and-what-threat-do-they-pose-267446",
    "timestamp": "2025-10-15T09:31:20Z"
  },
  {
    "title": "Jimmy Kimmel Trashes Eric Trump’s New Memoir With Perfectly Crude Title Twist",
    "description": "Jimmy Kimmel Trashes Eric Trump’s New Memoir With Perfectly Crude Title Twisthuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-eric-trump-book_n_68ef5cb3e4b0642cc7b3e25a",
    "timestamp": "2025-10-15T09:31:18Z"
  },
  {
    "title": "Here's how to bring Trump and his lawless thugs to justice",
    "description": "We are witnessing lawlessness on a scale none of us has seen in our lifetimes. It’s so bad that over the weekend, even Kamala Harris was forced to admit she’s lost faith in the American system of justice.“I don’t know if we can trust what’s coming out of the …",
    "link": "https://www.rawstory.com/raw-investigates/trump-lawless/",
    "timestamp": "2025-10-15T09:30:02Z"
  },
  {
    "title": "Trump threatens China with cooking oil embargo as soybean spat escalates",
    "description": "US President Donald Trump on Tuesday called China \"economically hostile\" for not buying American soybeans and threatened to halt imports of cooking oil and...",
    "link": "https://finance.yahoo.com/news/trump-threatens-china-cooking-oil-093000614.html",
    "timestamp": "2025-10-15T09:30:00Z"
  },
  {
    "title": "Senate's Russia hawks optimistic about Trump's Ukraine pivot",
    "description": "The Senate’s Russia hawks are encouraging President Donald Trump to provide Ukraine with American-made Tomahawk missiles, after he signaled over the weekend he’s considering it.\n“I’m all for it,” Sen. John Cornyn, R-Texas, told Semafor Tuesday, ahead of Presi…",
    "link": "https://biztoc.com/x/a0b43af1b9a3a28c",
    "timestamp": "2025-10-15T09:29:03Z"
  },
  {
    "title": "IDF says body turned over by Hamas doesn't match any hostages",
    "description": "The Israel Defense Forces announced that a corpse surrendered by Hamas was not a match for any of the hostages who are supposed to be released",
    "link": "https://www.foxnews.com/world/idf-says-body-turned-over-hamas-doesnt-match-any-hostages",
    "timestamp": "2025-10-15T09:28:48Z"
  },
  {
    "title": "Trump threatens vulnerable countries before key shipping emissions vote",
    "description": "American officials have threatened supporters of measure to reduce emissions with tariffs and other retaliatory action\nDonald Trump’s government is putting intense pressure on vulnerable countries to vote against measures that would force shipping companies t…",
    "link": "https://biztoc.com/x/e2afe83341dab844",
    "timestamp": "2025-10-15T09:28:44Z"
  },
  {
    "title": "Trump demands Hamas disarm, as group moves against 'collaborators' in Gaza",
    "description": "BBC Verify analyses footage of Hamas fighters in Gaza, including one of an execution in the centre of Gaza City.",
    "link": "https://www.bbc.com/news/articles/cjr034p5prlo",
    "timestamp": "2025-10-15T09:24:36Z"
  },
  {
    "title": "US playing with Russian nuclear fire by planning to sending Tomahawk missiles to Ukraine? Putin's aide Medvedev warns 'will end badly for Trump himself'",
    "description": "Ukraine may receive American Tomahawk missiles. These powerful weapons can strike deep into Russia. Russia expresses extreme concern over this possibility. The missiles could be controlled by the United States. This development raises tensions in the ongoing …",
    "link": "https://economictimes.indiatimes.com/news/international/us/dmitry-medvedev-warns-trump-against-sending-tomahawk-missiles-to-ukraine-nuclear-warhead-of-conventional-armed/articleshow/124567243.cms",
    "timestamp": "2025-10-15T09:23:21Z"
  },
  {
    "title": "Spanish FM: No doubt about Spain's commitment to NATO",
    "description": "Spanish Foreign Minister Jose Manuel Albares responded to yesterday's remarks made by United States President Donald Trump on Wednesday, stating that there is \"no doubt\" about his country's commitment...",
    "link": "https://biztoc.com/x/dc290e196c00b23e",
    "timestamp": "2025-10-15T09:18:03Z"
  },
  {
    "title": "Republican Reps. Draft Bill to Allow Some Foreign Truck Drivers",
    "description": "A group of Republican legislators is pushing legislation that would allow states to grant licenses to migrants who want to drive 18-wheeler trucks.\nThe post Republican Reps. Draft Bill to Allow Some Foreign Truck Drivers appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/15/republican-reps-push-bill-to-allow-foreign-truck-drivers/",
    "timestamp": "2025-10-15T09:17:42Z"
  },
  {
    "title": "Auto industry raises the alarm as China tightens export rules for rare earths",
    "description": "Automotive industry groups have sounded the alarm over China’s latest move to impose restrictions on the export of rare earths.",
    "link": "https://www.cnbc.com/2025/10/15/auto-industry-raises-the-alarm-as-china-tightens-rare-earth-curbs.html",
    "timestamp": "2025-10-15T09:14:00Z"
  },
  {
    "title": "Parampara Series: An ode to the classical arts",
    "description": "Parampara Series celebrated India's classical arts with renowned performers at Kamani Auditorium.",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/delhi/parampara-series-an-ode-to-the-classical-arts/articleshow/124571906.cms",
    "timestamp": "2025-10-15T09:13:02Z"
  },
  {
    "title": "Donald Trump threatens to move 2026 World Cup games and strip LA of 2028 Olympics",
    "description": "United States president Donald Trump says his FIFA counterpart Gianni Infantino would \"very easily\" move 2026 World Cup matches away from designated host cities if he asked him to.",
    "link": "https://www.independent.ie/sport/soccer/international-soccer/donald-trump-threatens-to-move-2026-world-cup-games-and-strip-la-of-2028-olympics/a897730767.html",
    "timestamp": "2025-10-15T09:12:12Z"
  },
  {
    "title": "‘If I feel there are unsafe conditions, I would call Gianni’ – Donald Trump will move 2026 World Cup matches from host cities",
    "description": "United States president Donald Trump says his FIFA counterpart Gianni Infantino would \"very easily\" move 2026 World Cup matches away from designated host cities if he asked him to.",
    "link": "https://www.independent.ie/sport/soccer/international-soccer/if-i-feel-there-are-unsafe-conditions-i-would-call-gianni-donald-trump-will-move-2026-world-cup-matches-from-host-cities/a897730767.html",
    "timestamp": "2025-10-15T09:12:11Z"
  },
  {
    "title": "Steve Bannon: The Qatari air force \"facility\" in US soil and a collective defense agreement was the price Trump paid for the Gaza peace deal",
    "description": "The MAGA die-hard insisted that no foreign power should have a military base on U.S. soil.Janna Brancolini (Oct. 13 2025)Trump loyalist Steve Bannon blasted Defense Secretary Pete Hegseth’s announcement that the U.S. military will provide Qatar with access to…",
    "link": "https://i-epikaira.blogspot.com/2025/10/steve-bannon-qatari-air-force-facility.html",
    "timestamp": "2025-10-15T09:12:00Z"
  },
  {
    "title": "Israeli Military Says 1 Of The Bodies Handed Over By Hamas Is Not That Of A Hostage",
    "description": "The development is adding to tensions over a fragile ceasefire in the two-year war in Gaza.",
    "link": "https://www.huffpost.com/entry/israel-hamas-fragile-ceasefire_n_68ef6354e4b0a6936a12caf6",
    "timestamp": "2025-10-15T09:10:55Z"
  },
  {
    "title": "Map and List of ‘No Kings’ Protests Against Trump on October 18",
    "description": "Demonstrators will once again take to the streets of cities across the United States for “No Kings” protests against President Donald Trump’s administration and its policies on October 18.\nWhy It Matters\nThe protests are the latest nationwide demonstrations s…",
    "link": "https://biztoc.com/x/2d31e40209182359",
    "timestamp": "2025-10-15T09:07:32Z"
  },
  {
    "title": "Don the Builder: Inside Trump's White House makeover",
    "description": "Donald Trump is obsessing over remodeling the White House like no other president.\nHe has gilded the Oval Office, replaced trees, paved the Rose Garden lawn, hung art and mirrors all over, erected flagpoles and begun work on a $250 million ballroom.\nHe's not …",
    "link": "https://biztoc.com/x/72185b43134ff71b",
    "timestamp": "2025-10-15T09:07:14Z"
  },
  {
    "title": "Don the Builder: Inside Trump's White House makeover",
    "description": "Donald Trump is obsessing over remodeling the White House like no other president.\nHe has gilded the Oval Office, replaced trees, paved the Rose Garden lawn, hung art and mirrors all over, erected flagpoles and begun work on a $250 million ballroom.\nHe's not …",
    "link": "https://biztoc.com/x/72185b43134ff71b",
    "timestamp": "2025-10-15T09:07:14Z"
  },
  {
    "title": "VOLTAGE: Von der Leyen’s risky ‘Nein’ to Donald Trump",
    "description": "In today's edition: Energy taxation, cabin baggage, net-zero shipping",
    "link": "https://biztoc.com/x/93707e765b4b46d8",
    "timestamp": "2025-10-15T09:07:03Z"
  }
]