[
  {
    "title": "Oh My God, TAKE IT DOWN Kills Parody",
    "description": "Donald Trump is a notorious media bully. He uses lawsuits, executive power, and political pressure to punish critics and bend institutions to his will. Disney, Meta, and Paramount have since paid out multi-million-dollar settlements over content disputes. CBS…",
    "link": "https://www.techdirt.com/2025/07/28/oh-my-god-take-it-down-kills-parody/",
    "timestamp": "2025-07-28T17:48:21Z"
  },
  {
    "title": "Former Democratic Gov. Roy Cooper announces run for Senate in North Carolina",
    "description": "Former Democratic Gov. Roy Cooper will run for the U.S. Senate in North Carolina, giving Democrats a proven statewide winner in an open-seat race that is expected to be one of the most competitive 2026 contests.",
    "link": "https://www.pbs.org/newshour/politics/former-democratic-gov-roy-cooper-announces-run-for-senate-in-north-carolina",
    "timestamp": "2025-07-28T17:45:50Z"
  },
  {
    "title": "Von der Leyen ducks Trump’s trade blitz – but deal exposes EU’s faultlines",
    "description": "Europe may have staved off an economic clash, but the compromise leaves the bloc facing higher tariffs and internal discord\nThere is no doubt that Ursula von der Leyen was under intense pressure on Sunday when she sat next to Donald Trump in the ballroom at h…",
    "link": "https://biztoc.com/x/c1f66c616d3fc71c",
    "timestamp": "2025-07-28T17:45:44Z"
  },
  {
    "title": "Facing Russia’s war on Ukraine, the EU couldn’t risk fighting a trade war with the US, analyst says",
    "description": "The US-EU trade deal has been blasted as too lopsided in favor of President Donald Trump, as it sets tariffs higher than Europe wanted and pledges hundreds of billions of dollars to be spent in America. But according to an analyst at the Brookings Institution…",
    "link": "https://biztoc.com/x/f141a12fdb569f66",
    "timestamp": "2025-07-28T17:45:32Z"
  },
  {
    "title": "The US-EU trade deal in numbers - how it compares to UK deal",
    "description": "Donald Trump has struck an agreement with the European Union to reduce tariffs - what will that mean for the UK?",
    "link": "https://www.bbc.com/news/articles/cdxyre8jvk7o",
    "timestamp": "2025-07-28T17:45:28Z"
  },
  {
    "title": "Trump: I’m Not a ‘Drawing Person,’ Epstein Furor Is Fake",
    "description": "President Donald Trump dismissed renewed scrutiny over his past ties to Jeffrey Epstein, calling the controversy a “hoax” and claiming he’s not “overly interested” in the matter. \nSpeaking about reports that his name may appear in Epstein-related files, Trump…",
    "link": "https://biztoc.com/x/6d0d6453217088cb",
    "timestamp": "2025-07-28T17:45:26Z"
  },
  {
    "title": "Trump House ally Nancy Mace moves closer to Republican run for governor",
    "description": "Republican Rep. Nancy Mace of South Carolina, in two Fox News interviews over the weekend, said a decision coming in the \"next couple of days\" on whether to run for South Carolina governor.",
    "link": "https://www.foxnews.com/politics/nancy-mace-says-shes-leaning-towards-running-south-carolina-governor-upcoming-2026-election",
    "timestamp": "2025-07-28T17:44:20Z"
  },
  {
    "title": "Donald Trump Really, Really, Really Hates This One Particular Thing About Europe",
    "description": "\"You're ruining your countries. I really mean it. It's so sad.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/donald-trumps-least-favorite-things",
    "timestamp": "2025-07-28T17:43:19Z"
  },
  {
    "title": "Donald Trump Really, Really, Really Hates This One Particular Thing About Europe",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_1a5393ef-7c83-431c-a774-5dd3afd33b69",
    "timestamp": "2025-07-28T17:43:19Z"
  },
  {
    "title": "Ukrainians Wonder When Americans Will Hit the Streets",
    "description": "Mass protests have often transformed Ukraine—but rarely the United States.",
    "link": "http://foreignpolicy.com/2025/07/28/ukraine-trump-protest-america-kyiv/",
    "timestamp": "2025-07-28T17:42:46Z"
  },
  {
    "title": "EU-US trade deal could add up to $19 billion in pharma industry costs, analysts say",
    "description": "(Reuters) -The European Union's trade deal with the United States could cost the pharmaceutical industry between $13 billion and $19 billion as branded...",
    "link": "https://uk.finance.yahoo.com/news/eu-us-trade-deal-could-174146296.html",
    "timestamp": "2025-07-28T17:41:46Z"
  },
  {
    "title": "Gunman Opens Fire Outside Reno Casino, Shooting Multiple People",
    "description": "The gunman was taken into custody after the shooting at the Grand Sierra Resort, police said.",
    "link": "https://www.huffpost.com/entry/reno-casino-shooting_n_6887b573e4b0b5f7e9082ff9",
    "timestamp": "2025-07-28T17:40:59Z"
  },
  {
    "title": "XRP and Dogecoin Erase Explosive Weekly Gains—Should Traders Worry?",
    "description": "XRP price is down more than 12% on the week, and Dogecoin is down even worse. The charts show differing paths for altcoins. Here's why.",
    "link": "https://decrypt.co/332097/xrp-dogecoin-price-weekly-gains-analysis",
    "timestamp": "2025-07-28T17:40:38Z"
  },
  {
    "title": "Crypto Payments Are Coming to PayPal",
    "description": "The digital payments platform is getting over 100 other cryptocurrencies as a payment option.",
    "link": "https://gizmodo.com/crypto-payments-are-coming-to-paypal-2000635696",
    "timestamp": "2025-07-28T17:40:27Z"
  },
  {
    "title": "Trump Says US Will Obliterate Iran's Nuclear Facilities Again If Tehran Tries Restarting Program",
    "description": "President Donald Trump warned Monday that the United States would destroy Iran's uranium enrichment sites again if Tehran tries to restart its nuclear program.\nThe post Trump Says US Will Obliterate Iran's Nuclear Facilities Again If Tehran Tries Restarting P…",
    "link": "https://freebeacon.com/latest-news/trump-says-us-will-obliterate-irans-nuclear-facilities-again-if-tehran-tries-restarting-program/",
    "timestamp": "2025-07-28T17:40:13Z"
  },
  {
    "title": "Trump Demands Speedy Deposition From Rupert Murdoch Because He May Die Before Trial",
    "description": "President Donald Trump filed a motion Monday requesting an expedited deposition of Rupert Murdoch, listing as his first argument the fact that the News Corp owner is 94 years old and has had health issues, implying he would die before he could testify at tria…",
    "link": "https://www.mediaite.com/lawcrime/trump-demands-speedy-deposition-from-rupert-murdoch-because-he-may-die-before-trial/",
    "timestamp": "2025-07-28T17:38:20Z"
  },
  {
    "title": "Judge blocks Trump’s efforts to defund Planned Parenthood",
    "description": "A federal judge says Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding.",
    "link": "https://www.pbs.org/newshour/nation/judge-blocks-trumps-efforts-to-defund-planned-parenthood",
    "timestamp": "2025-07-28T17:36:08Z"
  },
  {
    "title": "Trump seeks swift deposition of Murdoch in Epstein defamation case",
    "description": "NEW YORK: US President Donald Trump on Monday (Jul 28) asked a federal court to quickly depose media mogul Rupert Murdoch in his defamation lawsuit against the Wall Street Journal, following the newspaper’s report that Trump’s name appeared on a 2003 birthday…",
    "link": "https://www.channelnewsasia.com/world/trump-seeks-swift-deposition-murdoch-in-epstein-defamation-case-5263346",
    "timestamp": "2025-07-28T17:36:00Z"
  },
  {
    "title": "Trump seeks Murdoch deposition, denies ties to Epstein’s island amid defamation fight",
    "description": "NEW YORK: US President Donald Trump on Monday (Jul 28) asked a federal court to quickly depose media mogul Rupert Murdoch in his defamation lawsuit against the Wall Street Journal, following the newspaper’s report that Trump’s name appeared on a 2003 birthday…",
    "link": "https://www.channelnewsasia.com/world/trump-seeks-murdoch-deposition-denies-ties-epsteins-island-amid-defamation-fight-5263346",
    "timestamp": "2025-07-28T17:36:00Z"
  },
  {
    "title": "SEC Delays Decision on Trump-Linked Truth Social Bitcoin ETF Until September",
    "description": "The U.S. Securities and Exchange Commission (SEC) has pushed back its decision on whether to approve an exchange-traded fund (ETF) proposed by Truth Social, the social media platform affiliated with Donald Trump.\nThe delay, announced Monday, gives the agency …",
    "link": "https://biztoc.com/x/903a285fdb41a935",
    "timestamp": "2025-07-28T17:34:57Z"
  },
  {
    "title": "Medvedev: Trump 'Steamrolled, Humiliated' Europe With One-Sided Deal",
    "description": "Medvedev: Trump 'Steamrolled, Humiliated' Europe With One-Sided Deal\n \nFollowing high-stakes talks in Scotland between President Donald Trump and European Commission President Ursula von der Leyen, the two sides reached a landmark deal which sets a 15% US tar…",
    "link": "https://biztoc.com/x/53f5f89c9e9d8f1d",
    "timestamp": "2025-07-28T17:34:53Z"
  },
  {
    "title": "Trump eyes 'world tariff' of 15-20% for most countries",
    "description": "President Trump announced potential tariffs of 15% to 20% on exports to the U.S. for countries without trade deals, impacting approximately 200 nations. This follows recent trade agreements with the EU and Japan, featuring substantial investments and energy p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-eyes-world-tariff-of-15-20-for-most-countries/articleshow/122958825.cms",
    "timestamp": "2025-07-28T17:34:42Z"
  },
  {
    "title": "Lindsey Graham spars with NBC anchor, says Tulsi Gabbard’s Russiagate claims being ‘swept under the rug’",
    "description": "NBC \"Meet the Press\" host Kristen Welker asked Sen. Lindsey Graham if he was trying to \"distract from the Epstein matter\" during a heated exchange on Sunday.",
    "link": "https://nypost.com/2025/07/28/media/lindsey-graham-spars-with-nbc-anchor-over-tulsi-gabbards-new-russiagate-allegations/",
    "timestamp": "2025-07-28T17:34:33Z"
  },
  {
    "title": "Facing Russia’s war on Ukraine, the EU couldn’t risk fighting a trade war with the US, analyst says",
    "description": "\"At the end of the day, the EU needs U.S. weapons to keep Ukraine afloat into its struggle for survival against Russia.\"",
    "link": "https://fortune.com/2025/07/28/us-eu-trade-deal-russia-war-ukraine-weapons-tariffs-trump-putin/",
    "timestamp": "2025-07-28T17:34:16Z"
  },
  {
    "title": "Trump moves to lift visa restrictions for Argentina in boost to right-wing ally",
    "description": "The United States and Argentina have announced plans to allow Argentine tourists to travel to the U.S. without a visa",
    "link": "https://abcnews.go.com/International/wireStory/trump-moves-lift-visa-restrictions-argentina-boost-wing-124145285",
    "timestamp": "2025-07-28T17:33:54Z"
  },
  {
    "title": "Donald Trump: I Never Went to Epstein Island … But Bill Clinton Did!",
    "description": "Reading Time: 3 minutesDonald Trump is once again addressing the Jeffrey Epstein scandal.\nDonald Trump: I Never Went to Epstein Island … But Bill Clinton Did! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/07/donald-trump-i-never-went-to-epstein-island-but-bill-clinton-did/",
    "timestamp": "2025-07-28T17:33:19Z"
  },
  {
    "title": "John Brennan’s own words ‘remain an indictment’ of his role in grand conspiracy against Trump, expert confirms",
    "description": "He 'may be protected from perjury charges by the five-year statute of limitations. However, he is likely to be called again before Congress and asked the same questions'",
    "link": "https://www.wnd.com/2025/07/john-brennans-own-words-remain-indictment-his-role/",
    "timestamp": "2025-07-28T17:33:11Z"
  },
  {
    "title": "JD Vance Scolds Corporate Media For ‘Not Giving A Damn’ About ‘Scumbag Pedophile’ Epstein Until Now",
    "description": "Vice President J.D. Vance tore into the corporate media on Monday for \"not giving a damn\" about the case surrounding sex offender Jeffrey Epstein until now.",
    "link": "https://dailycaller.com/2025/07/28/jd-vance-corporate-media-epstein/",
    "timestamp": "2025-07-28T17:32:22Z"
  },
  {
    "title": "Georgia Rep. Mike Collins Announces Bid for Senate",
    "description": "Republican Rep. Mike Collins launched his campaign Monday for the U.S. Senate, setting up a high-stakes Republican primary in Georgia with the ultimate goal of... Read More\nThe post Georgia Rep. Mike Collins Announces Bid for Senate appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/07/28/georgia-congressman-mike-collins-announces-bid-senate-seat/",
    "timestamp": "2025-07-28T17:31:01Z"
  },
  {
    "title": "Vance Goes off on Fake News After AP Reporter Asks Him If GOP is Protecting P*dophiles by ‘Shielding’ Epstein List (VIDEO)",
    "description": "Vice President JD Vance went off on an AP reporter during remarks on tax cuts in Canton, Ohio, at a steel factory.\nThe post Vance Goes off on Fake News After AP Reporter Asks Him If GOP is Protecting P*dophiles by ‘Shielding’ Epstein List (VIDEO) appeared fir…",
    "link": "https://www.thegatewaypundit.com/2025/07/vance-goes-fake-news-after-ap-reporter-asks/",
    "timestamp": "2025-07-28T17:30:39Z"
  },
  {
    "title": "Donald Trump brands Sadiq Khan a 'nasty person' who has 'done a terrible job' as London mayor...before Keir Starmer is forced to awkwardly step in and defend his 'friend'",
    "description": "Sir Keir Starmer awkwardly stepped in to defend his 'friend' Sir Sadiq Khan today after Donald Trump branded the London mayor a 'nasty person'. The Prime Minister attempted to intervene as the US President ranted about Sir Sadiq at his Trump Turnberry golf re…",
    "link": "https://freerepublic.com/focus/f-news/4331249/posts",
    "timestamp": "2025-07-28T17:30:02Z"
  },
  {
    "title": "Court Declines US Tariff Relief on Low-Cost Goods, for Now (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nCourt Declines US Tariff Relief on Low-Cost Goods, for Now  —  A US trade court has for now denied an effort to restore a tariff exemption for small-value packages from China that President Donald Trump ended earlier this year.  —  Th…",
    "link": "https://www.memeorandum.com/250728/p65",
    "timestamp": "2025-07-28T17:30:00Z"
  },
  {
    "title": "Tariffs threaten Asian beauty product boom in US",
    "description": "Asian skin care has been a booming global business for a more than a decade, with consumers snapping up creams, serums and balms from South Korea, Japan and China.",
    "link": "https://roanoke.com/news/nation-world/business/article_18406349-59b4-54f7-a3a1-7de7a0a031a1.html",
    "timestamp": "2025-07-28T17:30:00Z"
  },
  {
    "title": "Sure, Donald, Whatever You Say",
    "description": "I assume all the people engaging in \"trade deals\" with Trump know it's all bullshit he can change tomorrow, so they can just agree to nonsense.\nThe agreement calls for EU imports of U.S. energy, which currently are mainly crude oil and liquefied natural gas (…",
    "link": "https://www.eschatonblog.com/2025/07/sure-donald-whatever-you-say.html",
    "timestamp": "2025-07-28T17:30:00Z"
  },
  {
    "title": "Trump seeks quick deposition of Rupert Murdoch in Jeffrey Epstein letter defamation case (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump seeks quick deposition of Rupert Murdoch in Jeffrey Epstein letter defamation case … Lawyers for President Donald Trump asked a judge on Monday to order Rupert Murdoch to sit for a deposition soon in Trump's $10 billion lawsuit accusi…",
    "link": "https://www.memeorandum.com/250728/p64",
    "timestamp": "2025-07-28T17:30:00Z"
  },
  {
    "title": "Vance to AP: ‘The Media Didn’t Give a Damn About’ Epstein Under Biden",
    "description": "\"If you want to criticize the people who aren't showing full transparency, you ought to go after the administrations that went easy on Jeffrey Epstein...\"\nThe post Vance to AP: ‘The Media Didn’t Give a Damn About’ Epstein Under Biden first appeared on Le·gal …",
    "link": "https://legalinsurrection.com/2025/07/vance-to-ap-the-media-didnt-give-a-damn-about-epstein-under-biden/",
    "timestamp": "2025-07-28T17:28:33Z"
  },
  {
    "title": "Starmer shares Gaza peace blueprint with Trump",
    "description": "Downing Street says the proposals follow a call with France and Germany over the weekend.",
    "link": "https://www.bbc.com/news/articles/cly6zgyy0wjo",
    "timestamp": "2025-07-28T17:28:11Z"
  },
  {
    "title": "BELLOTTI: Trump Fighting Off Entrenched Bureaucrats Who Want To Conduct Cruel Puppy Experiments",
    "description": "President Donald Trump is saving animals from cruel and wasteful lab testing, but entrenched Obama and Biden bureaucrats are trying to hamstring his efforts",
    "link": "https://dailycaller.com/2025/07/28/donald-trump-ending-animal-cruelty-bureaucrats-spending-anthony-bellotti-white-coat-waste/",
    "timestamp": "2025-07-28T17:25:54Z"
  },
  {
    "title": "Son Of Alleged Would-Be Trump Assassin Joins Father In Federal Prison After Child Porn Conviction",
    "description": "The son of the man charged with trying to kill President Donald Trump in Florida in 2024 was sentenced Friday to federal prison on child pornography charges.",
    "link": "https://dailycaller.com/2025/07/28/ryan-routh-son-oran-sentenced-child-porn/",
    "timestamp": "2025-07-28T17:24:02Z"
  },
  {
    "title": "MK Illouz: 'Those who learn Torah should be first to serve in the IDF'",
    "description": "In a wide-ranging interview, MK Dan Illouz calls for expanding IDF enlistment to include haredi youth, warns of political consequences if soldiers are ignored, and urges full victory in Gaza.",
    "link": "https://www.israelnationalnews.com/news/412384",
    "timestamp": "2025-07-28T17:24:00Z"
  },
  {
    "title": "Global auto leaders say U.S. trade deals not good for industry",
    "description": "Global auto industry representatives are warning about the negative impact of a trade deal between the European Union and the United States ahead of the Aug. 1 deadline for an agreement between Canada and the U.S. \nU.S. President Donald Trump and European Com…",
    "link": "https://biztoc.com/x/97e79ec2353eedc7",
    "timestamp": "2025-07-28T17:23:27Z"
  },
  {
    "title": "Israeli human rights organisations accuse country of genocide",
    "description": "Two Israeli human rights organisations have said the country is committing genocide against Palestinians in Gaza.",
    "link": "https://news.sky.com/story/israeli-human-rights-organisations-accuse-country-of-genocide-13403174",
    "timestamp": "2025-07-28T17:22:00Z"
  },
  {
    "title": "Europe's Carmakers Still Nervous Despite EU-US Trade Deal",
    "description": "Europe's auto industry is relieved that the EU-US trade deal reduces short-term uncertainty but many, particularly in the struggling German sector, remain deeply worried about the long-term impact.",
    "link": "https://www.ibtimes.com/europes-carmakers-still-nervous-despite-eu-us-trade-deal-3779641",
    "timestamp": "2025-07-28T17:21:24Z"
  },
  {
    "title": "Thailand And Cambodia Truce Agreement Comes Into Effect",
    "description": "A truce agreement between Thailand and Cambodia came into effect in the early hours of Tuesday, testing whether it will halt five days of open combat that have engulfed their jungle-clad frontier.",
    "link": "https://www.ibtimes.com/thailand-cambodia-truce-agreement-comes-effect-3779638",
    "timestamp": "2025-07-28T17:21:21Z"
  },
  {
    "title": "‘Let him crash’: Hegseth critics quietly wait for Trump favorite to self-destruct",
    "description": "Defense Secretary Pete Hegseth has created turmoil within the Pentagon in his brief six-month tenure, drawing fire for reckless use of classified information, the abrupt firing of top aides over questionable leak accusations, and his chaotic management style …",
    "link": "https://www.rawstory.com/hegseth-2673773439/",
    "timestamp": "2025-07-28T17:20:17Z"
  },
  {
    "title": "Russia's Medvedev says Trump's 'ultimatum' could lead to war",
    "description": "Former Russian President Dmitry Medvedev said in a post on X on Monday that U.S. President Donald Trump was playing \"the ultimatum game\" with Russia, and that such an approach could lead to a war involving the United States. Medvedev wrote: \"Each new ultimatu…",
    "link": "https://freerepublic.com/focus/f-chat/4331247/posts",
    "timestamp": "2025-07-28T17:19:11Z"
  },
  {
    "title": "“They Look Very Hungry” and a Familiar American Excuse",
    "description": "As excruciating reports of unmitigated disaster and starving Gazans, including infants and babies, continue to pour in, President Donald Trump on Monday appeared to recognize reality. “That’s real starvation stuff,” Trump told reporters. “I see it. You can’t …",
    "link": "https://www.motherjones.com/politics/2025/07/trump-gaza-hunger-starvation-israel-they-look-hungry-familiar-american-excuse/",
    "timestamp": "2025-07-28T17:19:04Z"
  },
  {
    "title": "Fujifilm Appears First to Reveal Higher Prices Due to New 15% Tariffs",
    "description": "Thanks to a new \"massive\" deal, camera companies will be subject to a new higher tariff starting on August 1. And because tariffs are import taxes, those prices will largely fall on the consumer if a company can't absord additional cost. Fujifilm appears to b…",
    "link": "https://petapixel.com/2025/07/28/fujifilm-appears-first-to-reveal-higher-prices-due-to-new-15-tariffs/",
    "timestamp": "2025-07-28T17:15:22Z"
  },
  {
    "title": "Democrat Roy Cooper launches Senate bid in North Carolina for Tillis' seat",
    "description": "Democrat Roy Cooper launches Senate bid in North Carolina for Tillis' seatgo.com",
    "link": "https://abcnews.go.com/Politics/democrat-roy-cooper-launches-senate-bid-north-carolina/story?id=124141497",
    "timestamp": "2025-07-28T17:15:00Z"
  },
  {
    "title": "Donald Trump tells Moscow to reach peace deal with Kyiv in 10-12 days or face severe tariffs",
    "description": "US president’s patience with Kremlin wearing thin at lack of progress in ending Europe’s largest armed conflict since 1945",
    "link": "https://www.irishtimes.com/world/europe/2025/07/28/donald-trump-tells-moscow-to-reach-peace-deal-with-kyiv-in-10-12-days-or-face-severe-tariffs/",
    "timestamp": "2025-07-28T17:14:17Z"
  },
  {
    "title": "Trump Shortens Deadline for Russia to End War in Ukraine",
    "description": "U.S. President Donald Trump said Monday he is giving Russian President Vladimir Putin 10 to 12 days to stop the killing in Ukraine, shortening a 50-day deadline he had given the Russian leader two weeks ago.\nThe post Trump Shortens Deadline for Russia to End …",
    "link": "https://www.breitbart.com/europe/2025/07/28/trump-shortens-deadline-for-russia-to-end-war-in-ukraine/",
    "timestamp": "2025-07-28T17:13:40Z"
  },
  {
    "title": "Trump Prioritizes Getting Food to the Hungry in Gaza",
    "description": "President Donald Trump says getting food to the hungry in Gaza is a top priority. He says Hamas has been very difficult to deal with in the last few days, because they are still holding Israeli's hostage. Trump says the US, UK and European Union will work tog…",
    "link": "https://biztoc.com/x/94c34a2cf15c233c",
    "timestamp": "2025-07-28T17:12:22Z"
  },
  {
    "title": "Trump hosts Starmer in Scotland, promoting his own golf club (Washington Post)",
    "description": "Washington Post:\nTrump hosts Starmer in Scotland, promoting his own golf club  —  President Donald Trump's meetings at his Scottish golf course provide the latest example of how he uses his presidential power in ways that help his family businesses.  —  EDINB…",
    "link": "https://www.memeorandum.com/250728/p63",
    "timestamp": "2025-07-28T17:10:01Z"
  },
  {
    "title": "Republican Nancy Mace says she enjoys watching ICE deportation videos, sparks outrage",
    "description": "South Carolina Republican Nancy Mace has come under heavy criticism after saying she enjoys watching YouTube clips of ICE agents arresting undocumented migrants in court. In a Fox News interview, she praised the Trump administration’s immigration policies and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/republican-nancy-mace-says-she-enjoys-watching-ice-deportation-videos-sparks-outrage/articleshow/122958242.cms",
    "timestamp": "2025-07-28T17:08:52Z"
  },
  {
    "title": "‘Outraged and Terrified’: Mark Halperin Sounds the Alarm Over Trump’s ‘Intimidation of Media’ and CBS’s ‘Bended Knee’",
    "description": "Mark Halperin sounded the alarm over President Donald Trump's \"intimidation tactics\" and the media industry's \"bended knee.\"\nThe post ‘Outraged and Terrified’: Mark Halperin Sounds the Alarm Over Trump’s ‘Intimidation of Media’ and CBS’s ‘Bended Knee’ first a…",
    "link": "https://www.mediaite.com/media/news/outraged-and-terrified-mark-halperin-sounds-the-alarm-over-trumps-intimidation-of-media-and-cbss-bended-knee/",
    "timestamp": "2025-07-28T17:03:39Z"
  },
  {
    "title": "China aims for 'reciprocity' in trade talks with US",
    "description": "Chinese and U.S. officials held a fresh round of talks in Stockholm on July 28, with the world's top two economies looking to extend a fragile trade truce in the face of U.S. President Donald Trump's global tariff war.",
    "link": "https://www.hurriyetdailynews.com/china-aims-for-reciprocity-in-trade-talks-with-us-211964",
    "timestamp": "2025-07-28T17:03:00Z"
  },
  {
    "title": "The Brief – How Trump trounced Ursula",
    "description": "Sunday's deal is the almost inevitable outcome of a declining great power placing its faith in an economically illiterate, mendacious, image-obsessed narcissist – and then asking that person to negotiate with Donald Trump.",
    "link": "https://biztoc.com/x/43abcc9f89a9614c",
    "timestamp": "2025-07-28T17:01:02Z"
  },
  {
    "title": "Trump Seeks Quick Deposition of Rupert Murdoch",
    "description": "Lawyers for President Donald Trump asked a judge on Monday to order Rupert Murdoch to sit for a deposition soon in Trump’s $10 billion lawsuit accusing the media mogul of defaming him in a Wall",
    "link": "https://politicalwire.com/2025/07/28/trump-seeks-quick-deposition-of-rupert-murdoch/",
    "timestamp": "2025-07-28T17:00:37Z"
  },
  {
    "title": "US tariff tussles stuff of nightmares for Bordeaux winemakers",
    "description": "Bordeaux's US market accounts for 20% of its total wine exports.",
    "link": "https://www.nzherald.co.nz/world/us-tariff-tussles-stuff-of-nightmares-for-bordeaux-winemakers/Q7I5AOJLVZA3RDYVGJOH3RPWMY/",
    "timestamp": "2025-07-28T17:00:00Z"
  },
  {
    "title": "Green MP Tamatha Paul on trying to navigate a fine line - Audrey Young",
    "description": "The MP is the youngest of 7, was school Dux, and first in her family to go to university.",
    "link": "https://www.nzherald.co.nz/nz/politics/green-mp-tamatha-paul-on-trying-to-navigate-a-fine-line-audrey-young/BJ6PRHUXIBHI3DUIAZ5GXHXGDY/",
    "timestamp": "2025-07-28T17:00:00Z"
  },
  {
    "title": "Energy Secretary Wright Threatens To Take U.S. Out of International Energy Agency over Climate-Cult Supporting Forecasts",
    "description": "Instead of sipping champagne while making up fantasy stories of melting polar ice and dying polar bears, Wright challenges narratives and promotes policies that will not only help our nation, but the rest of the world.",
    "link": "https://wattsupwiththat.com/2025/07/28/energy-secretary-wright-threatens-to-take-u-s-out-of-international-energy-agency-over-climate-cult-supporting-forecasts/",
    "timestamp": "2025-07-28T17:00:00Z"
  },
  {
    "title": "Court Declines Tariff Relief on Low-Cost Goods",
    "description": "“A U.S. trade court has for now denied an effort to restore a tariff exemption for small-value packages from China that President Donald Trump ended earlier this year,” Bloomberg reports.",
    "link": "https://politicalwire.com/2025/07/28/court-declines-tariff-relief-on-low-cost-goods/",
    "timestamp": "2025-07-28T16:58:42Z"
  },
  {
    "title": "The Brief – How Trump trounced Ursula",
    "description": "Sunday's deal is the almost inevitable outcome of a declining great power placing its faith in an economically illiterate, mendacious, image-obsessed narcissist – and then asking that person to negotiate with Donald Trump.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-how-trumps-triumph-ursulas-shame-europes-nightmare/",
    "timestamp": "2025-07-28T16:57:25Z"
  },
  {
    "title": "Presidential C A P: Donald Trump Repeats Lie That Beyoncé Was Paid $11 Million To Endorse Kamala Harris, Calls For Her Prosecution, X Calls It A Distraction From Jeffrey Epstein",
    "description": "In his latest attempt at throwing stuff at the wall and seeing if it sticks, Felon 47, aka Donald Trump, is now pushing an already debunked claim that Kamala Harris paid Beyoncé $11 million to get an endorsement from the singer in October 2024.",
    "link": "https://hiphopwired.com/playlist/donald-trump-prosecute-beyonce-kamala-harris-campaing-endorsement-reacrtions/",
    "timestamp": "2025-07-28T16:56:27Z"
  },
  {
    "title": "CNN’s Harry Enten Stunned Americans Trust GOP Over Dems On Foreign Policy",
    "description": "Harry Enten expressed surprise on Monday about how Americans continue to have more faith in Republicans than Democrats when it comes to foreign policy.",
    "link": "https://dailycaller.com/2025/07/28/cnn-harry-enten-shocked-americans-trust-gop-over-dems-on-foreign-policy/",
    "timestamp": "2025-07-28T16:52:42Z"
  },
  {
    "title": "Chilean investigators close in on the notorious Venezuelan gang targeted by Trump",
    "description": "Chilean prosecutors brought an unprecedented number of gang members to trial last year.",
    "link": "https://www.bostonherald.com/2025/07/28/chile-taking-on-tren-de-aragua/",
    "timestamp": "2025-07-28T16:52:20Z"
  },
  {
    "title": "Trump Takes Break From $10 Million Golf Vacation To Put Forward New Jeffrey Epstein Explanation",
    "description": "The president also announced new taxes on American importers and consumers during his trip to Scotland.",
    "link": "https://www.huffpost.com/entry/donald-trump-jeffrey-epstein-hired-help_n_6887a11ae4b067dd8147578e",
    "timestamp": "2025-07-28T16:51:14Z"
  },
  {
    "title": "Trump admin rebuffs Schiff, reopening massive Pacific oil reserve capable of 80% of regional production",
    "description": "The Trump administration reopens Santa Ynez Unit with 190 million barrels of recoverable oil after 2015 spill, facing resistance from Sen. Adam Schiff and Rep. Salud Carbajal, citing climate concerns.",
    "link": "https://www.foxnews.com/politics/burgum-reopens-massive-pacific-oil-reserve-rebuffing-schiffs-warning-enviro-threats",
    "timestamp": "2025-07-28T16:50:44Z"
  },
  {
    "title": "'Not So Interested in Talking Anymore': Trump Shortens Putin's Deadline, Says Russia Must End Ukraine War in '10 or 12 Days'",
    "description": "President Donald Trump announced Monday that he is reducing his deadline for Russian president Vladimir Putin to reach a ceasefire in Ukraine to \"10 or 12 days,\" citing a lack of progress and saying he is \"not so interested in talking anymore.\"\nThe post 'Not …",
    "link": "https://freebeacon.com/latest-news/not-so-interested-in-talking-anymore-trump-shortens-putins-deadline-says-russia-must-end-ukraine-war-in-10-or-12-days/",
    "timestamp": "2025-07-28T16:50:37Z"
  },
  {
    "title": "Trump, Starmer call for immediate ceasefire in Gaza",
    "description": "United States President Donald Trump and British Prime Minister Keir Starmer reiterated on Monday the call for an immediate ceasefire in Gaza. Following a meeting between the two leaders earlier today...",
    "link": "https://biztoc.com/x/9713763a5d1b9882",
    "timestamp": "2025-07-28T16:50:13Z"
  },
  {
    "title": "Trump seeks faster deposition for Murdoch",
    "description": "United States President Donald Trump's lawyers filed a request on Monday asking the US District for the Southern District of Florida to allow them to depose media mogul Rupert Murdoch within the next ...",
    "link": "https://biztoc.com/x/93b760a1c45a7c13",
    "timestamp": "2025-07-28T16:50:07Z"
  },
  {
    "title": "European shares dip as US tariff reality sets in",
    "description": "Automakers Volkswagen, BMW plunge with trade agreement set to lock in 15% tariffs on exports to US",
    "link": "https://www.irishtimes.com/business/2025/07/28/european-shares-dip-as-us-tariff-reality-sets-in/",
    "timestamp": "2025-07-28T16:47:15Z"
  },
  {
    "title": "Democrats Currently Facing ‘Lowest’ Favorability Ratings ‘On Record,’ CNN’s Harry Enten Says",
    "description": "CNN senior data reporter Harry Enten reported on Sunday that Democrats' net favorability ratings are currently at their \"lowest on record.\"",
    "link": "https://dailycaller.com/2025/07/28/democrats-lowest-favorability-cnn-harry-enten/",
    "timestamp": "2025-07-28T16:47:07Z"
  },
  {
    "title": "Thailand and Cambodia agree to ‘unconditional’ ceasefire to end border fighting, Malaysian PM says",
    "description": "As part of the ceasefire deal, military commanders from both sides will hold talks Tuesday to defuse tensions while Cambodia will host a border committee meeting on Aug. 4., said Malaysia's prime minister.",
    "link": "https://www.pbs.org/newshour/world/thailand-and-cambodia-agree-to-unconditional-ceasefire-to-end-border-fighting-malaysian-pm-says",
    "timestamp": "2025-07-28T16:45:31Z"
  },
  {
    "title": "Who Would You Vote For: Lindsey Graham or This Project 2025 Architect?",
    "description": "Paul Dans, the architect of the far-right plan Project 2025, will primary Republican Senator Linsdey Graham in South Carolina next year. Dans’s campaign muddies the ideological waters of MAGA, as he admonishes Graham for being a “swamp critter” while Presiden…",
    "link": "https://newrepublic.com/post/198507/lindsey-graham-project-2025-architect-paul-dans-election-senate",
    "timestamp": "2025-07-28T16:43:40Z"
  },
  {
    "title": "Goodbye stagflation: 3 reasons BofA sees the US economy avoiding a worst-case scenario",
    "description": "Trump's pro-growth agenda, the manufacturing push, and growing AI spend are some of the factors that could stoke a fresh economic boom, BofA said.",
    "link": "https://www.businessinsider.com/us-economic-outlook-stagflation-boom-inflation-growth-bank-of-america-2025-7",
    "timestamp": "2025-07-28T16:43:28Z"
  },
  {
    "title": "DOJ’s Civil Rights Division has lost hundreds of employees in ‘mass exodus’",
    "description": "The U.S. Department of Justice's Civil Rights Division has lost 368 employees since President Donald Trump took office in January, according to figures provided to a Democratic senator.",
    "link": "https://www.abajournal.com/news/article/dojs-civil-rights-division-loses-hundreds-of-employees-in-mass-exodus",
    "timestamp": "2025-07-28T16:43:00Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
    "description": "The Indian market closed negatively on Monday. Sensex and Nifty both experienced losses. Weak earnings and stalled trade talks with the US impacted the market. IT sector layoffs and foreign investor outflows added to the negative sentiment. Analysts suggest m…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/122957779.cms",
    "timestamp": "2025-07-28T16:42:08Z"
  },
  {
    "title": "Evacuees cautiously welcome Thai-Cambodia truce, brace for return to uncertainty",
    "description": "SURIN, THAILAND: Thai evacuees welcomed news of a ceasefire with Cambodia on Monday (Jul 28) with a mix of relief and scepticism, as the midnight truce loomed after five days of deadly cross-",
    "link": "https://www.channelnewsasia.com/world/evacuees-cautiously-welcome-thai-cambodia-truce-brace-return-uncertainty-5263276",
    "timestamp": "2025-07-28T16:42:00Z"
  },
  {
    "title": "Behind the Story: What now amid Trump's Turnberry tariffs",
    "description": "A trade deal between the European Union and the US could see certain Irish exporters \"at the same position\" as they are now, an economist has said.",
    "link": "https://www.rte.ie/news/ireland/2025/0728/1525781-behind-the-story/",
    "timestamp": "2025-07-28T16:41:46Z"
  },
  {
    "title": "A federal judge just dealt a blow to RFK Jr.’s strategy to defund Planned Parenthood",
    "description": "Planned Parenthood must keep getting Medicaid funds from the government as it fights attempts to cut off money for its health clinics.",
    "link": "https://fortune.com/2025/07/28/planned-parenthood-medicaid-funds-judge-indira-talwani-rfk-jr/",
    "timestamp": "2025-07-28T16:40:41Z"
  },
  {
    "title": "Trump’s tariffs to cost global economy $2 trn – Bloomberg",
    "description": "The US president’s trade policy is slowing investment and reshaping supply chains, according to the outlet Read Full Article at RT.com",
    "link": "https://www.rt.com/business/622094-trump-tariffs-global-economic-hit/",
    "timestamp": "2025-07-28T16:39:26Z"
  },
  {
    "title": "BREAKING: Federal judge blocks Trump's ban on Medicaid Funding for Planned Parenthood",
    "description": "A federal judge has blocked the Trump Administration's policy preventing Medicaid funding from going to abortion providers such as Planned Parenthood.",
    "link": "https://www.advocate.com/politics/planned-parenthood-funding-medicaid-blocked",
    "timestamp": "2025-07-28T16:37:24Z"
  },
  {
    "title": "Israeli PM Binyamin Netanyahu may be running out of ideas",
    "description": "Clear indications that prime minister’s plan to bring about release of the hostages has failed",
    "link": "https://www.irishtimes.com/world/middle-east/2025/07/28/israeli-pm-binyamin-netanyahu-may-be-running-out-of-ideas/",
    "timestamp": "2025-07-28T16:36:58Z"
  },
  {
    "title": "Sydney Sweeney’s Parents: Learn About Her Mom & Dad",
    "description": "Sydney Sweeney grew up in Washington with her mom Lisa, a lawyer, and her dad Steven, who worked in hospitality. Learn more about her family background here.",
    "link": "https://hollywoodlife.com/feature/about-sydney-sweeney-parents-family-5420773/",
    "timestamp": "2025-07-28T16:36:40Z"
  },
  {
    "title": "All hail Emperor Trump | Politics with Tom McTague",
    "description": "As Donald Trump visits Scotland, world leaders - including Keir Starmer - flock to pay tribute at the emperor's feet.Subscribe on YouTube: https://www.youtube.com/channel/UC2DHAQOeEg-Z-4trARDXHRA?sub_confirmation=1The US President is on a 4-day trip to his go…",
    "link": "https://shows.acast.com/newstatesman/episodes/trump-in-scotland",
    "timestamp": "2025-07-28T16:35:51Z"
  },
  {
    "title": "Exclusive -- Rep. Marlin Stutzman: Trump Has 'Reset the Global Stage When it Comes to Trade'",
    "description": "President Trump has \"reset the global stage when it comes to trade,\" and these trade deals are \"huge for the Midwest,\" Rep. Marlin Stutzman said.\nThe post Exclusive — Rep. Marlin Stutzman: Trump Has ‘Reset the Global Stage When it Comes to Trade’ appeared fir…",
    "link": "https://www.breitbart.com/politics/2025/07/28/exclusive-rep-marlin-stutzman-trump-has-reset-global-stage-trade/",
    "timestamp": "2025-07-28T16:35:44Z"
  },
  {
    "title": "Project 2025 architect Paul Dans to challenge Lindsey Graham for Senate in South Carolina | CNN Politics",
    "description": "Paul Dans, the main force behind the polarizing conservative blueprint Project 2025, is planning to challenge South Carolina Sen. Lindsey Graham in next year’s Republican primary.",
    "link": "https://www.cnn.com/2025/07/28/politics/project-2025-paul-dans-lindsey-graham-south-carolina-senate",
    "timestamp": "2025-07-28T16:35:29Z"
  },
  {
    "title": "Planned Parenthood Closes Five Northern California Centers After Defunding",
    "description": "The Planned Parenthood abortion business is closing more centers – with another 5 closing in northern California thanks to the defunding bill President trump signed that took $300 million in taxpayer dollars away from the abortion giant. California’s Planned …",
    "link": "https://freerepublic.com/focus/f-news/4331240/posts",
    "timestamp": "2025-07-28T16:34:34Z"
  },
  {
    "title": "Trump Gives Strange Explanation of Why Epstein Friendship Ended",
    "description": "Donald Trump dodged an easy question Monday about his rift with alleged sex trafficker Jeffrey Epstein.During a press conference with British Prime Minister Keir Starmer in Scotland, the president was asked to explain what caused the “breach” between the pres…",
    "link": "https://newrepublic.com/post/198511/donald-trump-explanation-epstein-friendship-ended",
    "timestamp": "2025-07-28T16:33:08Z"
  },
  {
    "title": "South Park Might Actually Be In Danger of Being Cancelled This Time",
    "description": "South Park Studios\nSouth Park has always toed the line in the way it has pushed itself to the point of potential legal action, but it might actually be in danger of potentially being cancelled this time after Season 27’s wild premiere. South Park made its ret…",
    "link": "http://comicbook.com/tv-shows/news/trump-south-park-canceled-theory/",
    "timestamp": "2025-07-28T16:30:41Z"
  },
  {
    "title": "2nd Whistleblower Confirms Trump Judge Pick Told DOJ To Say ‘Fuck You’ To Federal Courts Opposing Mass Deportation Efforts",
    "description": "Sure, “Department of Justice” has always been a misnomer, what with its blessing of things like civil asset forfeiture, bogus CFAA prosecutions, cop junk science, the 1033 program, and the complete inability to successfully sue federal officers for blatant Co…",
    "link": "https://www.techdirt.com/2025/07/28/2nd-whistleblower-confirms-trump-judge-pick-told-doj-to-say-fuck-you-to-federal-courts-opposing-mass-deportation-efforts/",
    "timestamp": "2025-07-28T16:30:00Z"
  },
  {
    "title": "Trump Gives Totally Different Answer Than White House For Epstein Split",
    "description": "For once, Trump might be telling the truth.",
    "link": "https://www.huffpost.com/entry/trump-epstein-split-white-house_n_688789f9e4b0b5f7e908143d",
    "timestamp": "2025-07-28T16:29:24Z"
  },
  {
    "title": "Trump Believes Israeli Hostages Are Treated Like Jews Were Treated by Nazis 'In the Movies'",
    "description": "As Israel's war in Gaza continues, President Donald Trump seemingly compared Hamas' hostage situation with the Nazis treatment of the Jews in World War II.",
    "link": "https://www.ibtimes.com/trump-believes-israeli-hostages-are-treated-like-jews-were-treated-nazis-movies-3779635",
    "timestamp": "2025-07-28T16:29:16Z"
  },
  {
    "title": "Judge blocks Trump administration's efforts to defund Planned Parenthood",
    "description": "A federal judge says Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding",
    "link": "https://abcnews.go.com/US/wireStory/judge-blocks-trump-administrations-efforts-defund-planned-parenthood-124140034",
    "timestamp": "2025-07-28T16:28:29Z"
  },
  {
    "title": "‘Past The Point Of No Return’: Doctor Describes How Starvation In Gaza Is Driving Mass Death",
    "description": "\"In August and September, there are probably still going to be ... large numbers of deaths because children have already passed the tipping point,\" Mark Brauner, who volunteered in Gaza last month, told HuffPost.",
    "link": "https://www.huffpost.com/entry/gaza-starvation-doctor-israel-palestinians_n_6886aff0e4b04be5e46823d6",
    "timestamp": "2025-07-28T16:28:22Z"
  }
]