[
  {
    "title": "Exclusive: Andrew Weissmann in Crosshairs as War on Big Law Continues",
    "description": "Longtime deputy to Robert Mueller and key Trump-Russia investigator Andrew Weissmann is in the crosshairs of federal prosecutors. For years, Andrew Weissmann was one of the most visible and vociferous critics of Donald Trump, as a former deputy to Special Pro…",
    "link": "https://freerepublic.com/focus/f-chat/4305060/posts",
    "timestamp": "2025-03-18T13:37:30Z"
  },
  {
    "title": "Despite Michael Flynn’s radicalism, Trump welcomes retired general back into the fold",
    "description": "In a normal administration, Mike Flynn would be kept at arm’s length. In the Trump administration, he’s been rewarded with a new appointment.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/michael-flynns-radicalism-trump-welcomes-retired-general-back-fold-rcna196866",
    "timestamp": "2025-03-18T13:37:22Z"
  },
  {
    "title": "Trump calls for judge in deportation legal battle to be impeached",
    "description": "Without specifically naming the judge he was speaking about, Trump declared, \"This judge, like many of the Crooked Judges’ I am forced to appear before, should be IMPEACHED!!!\"",
    "link": "https://www.foxnews.com/politics/trump-calls-judge-deportation-legal-battle-impeached",
    "timestamp": "2025-03-18T13:36:41Z"
  },
  {
    "title": "Actor Jon Cryer Claims ‘Trump Is Attacking the U.S. More Effectively’ Than 9/11 Terrorists Ever Could",
    "description": "Hollywood actor Jon Cryer accused President Trump of committing terrorism in his day-to-day efforts to drain the swamp in Washington, DC.",
    "link": "https://www.breitbart.com/entertainment/2025/03/18/actor-jon-cryer-claims-trump-is-attacking-the-u-s-more-effectively-than-9-11-terrorists-ever-could/",
    "timestamp": "2025-03-18T13:34:53Z"
  },
  {
    "title": "'We Are Not Stopping'",
    "description": "Plus: Texas midwife arrested for violating abortion ban, JFK files, Gaza bombings, astronauts finally rescued, and more...",
    "link": "https://reason.com/2025/03/18/we-are-not-stopping/",
    "timestamp": "2025-03-18T13:34:51Z"
  },
  {
    "title": "Trump Administration Plans To Construct Nearly 4 Million Affordable Homes On Federal Land",
    "description": "To address the U.S. housing shortage, President Donald Trump has proposed utilizing a portion of the 650 million acres of federal land for new housing development.\nWhat Happened: The Trump administration is setting up a task force to locate federal land that …",
    "link": "https://biztoc.com/x/03b4dab1f6d7216f",
    "timestamp": "2025-03-18T13:34:35Z"
  },
  {
    "title": "'Constitutional Crisis' Feared as Trump DOJ Seeks Ouster of Judge in Deportation Case",
    "description": "An attorney representing immigrants facing possible deportation under President Donald Trump's lawless use of the Alien Enemies Act warned Monday that the United States is on the verge of a constitutional crisis, with the administration openly defying and see…",
    "link": "https://www.commondreams.org/news/trump-deportation-judge",
    "timestamp": "2025-03-18T13:34:28Z"
  },
  {
    "title": "complete list of Trump’s actions in his eighth week in office",
    "description": "President Donald Trump took his most dramatic step to claim executive powers in his eighth week in office, invoking the Alien Enemies Act to begin deporting noncitizens without giving them a chance to go before a judge.",
    "link": "https://biztoc.com/x/3f50823f79531a75",
    "timestamp": "2025-03-18T13:34:02Z"
  },
  {
    "title": "Trump Attacks Judge in Immigration Case in Unhinged Online Tirade: ‘Should Be IMPEACHED!!!’",
    "description": "President Donald Trump attacked Judge James Boasberg, who is at the center of a weekend ruling that attempted to block the immigration of Venezuelan migrants.\nThe post Trump Attacks Judge in Immigration Case in Unhinged Online Tirade: ‘Should Be IMPEACHED!!!’…",
    "link": "https://www.mediaite.com/news/trump-attacks-judge-in-immigration-case-in-unhinged-online-tirade-should-be-impeached/",
    "timestamp": "2025-03-18T13:33:16Z"
  },
  {
    "title": "Trump and Putin to hold a call on Russia, Ukraine cease-fire — but Zelensky is skeptical",
    "description": "President Donald Trump is to hold talks on Tuesday with Russian President Vladimir Putin as he looks to get buy-in on a U.S. cease-fire proposal he hopes can create a pathway to ending Russia’s devastating war on Ukraine.",
    "link": "https://nypost.com/2025/03/18/world-news/zelensky-skeptical-over-trump-putin-peace-talks-to-end-ukraine-war/",
    "timestamp": "2025-03-18T13:33:05Z"
  },
  {
    "title": "Kiev thinks Trump ‘can’t stand’ Ukraine – Economist",
    "description": "Ukrainian officials previously slammed the US president for temporarily halting military aid after his falling-out with Zelensky Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614397-trump-cant-stand-ukraine/",
    "timestamp": "2025-03-18T13:31:58Z"
  },
  {
    "title": "Semisonic Shreds Trump White House for Using Their Song in Deportation Clip: ‘Missed the Point Entirely!’",
    "description": "Grammy-nominated rock band Semisonic condemned the Trump White House for using their 1998 hit song “Closing Time” in a social media video showcasing deportations. The White House shared the clip Monday, just days after controversially deporting hundreds of al…",
    "link": "https://www.mediaite.com/news/semisonic-shreds-trump-white-house-for-using-their-song-in-deportation-clip-missed-the-point-entirely/",
    "timestamp": "2025-03-18T13:30:09Z"
  },
  {
    "title": "Presidents have used autopens for decades. Now Trump objects to Biden's use of one",
    "description": "Trump is claiming some of Biden's recent pardons don't count because he used an autopen.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_73d2e5c3-c935-541b-8b8e-08e5fdc12944.html",
    "timestamp": "2025-03-18T13:30:00Z"
  },
  {
    "title": "Presidents have used autopens for decades. Now Trump objects to Biden's use of one",
    "description": "Trump is claiming some of Biden's recent pardons don't count because he used an autopen.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_c8061893-21ae-5c47-a2b8-6d9cf3afb661.html",
    "timestamp": "2025-03-18T13:30:00Z"
  },
  {
    "title": "GDC’s #1ReasonToBe panel will celebrate women game devs in a tough climate",
    "description": "The #1ReasonToBe panel is returning to GDC in a climate in the U.S. that may not feel so welcoming for panelists this year.",
    "link": "https://venturebeat.com/games/gdcs-1reasontobe-panel-will-celebrate-women-game-devs-in-a-tough-climate/",
    "timestamp": "2025-03-18T13:30:00Z"
  },
  {
    "title": "Elon Musk Highlights 'Maybe the Biggest Scam of All Time'",
    "description": "Musk described how the government could give money to nonprofits with very little control over the expenses.",
    "link": "https://www.newsweek.com/elon-musk-doge-biggest-scam-all-time-2046341",
    "timestamp": "2025-03-18T13:27:04Z"
  },
  {
    "title": "Forever 21 in US files for bankruptcy again, to start liquidation sales",
    "description": "The company will continue to engage with potential buyers who wish to purchase some or all of its US business. Its international stores remain unaffected by the bankruptcy.",
    "link": "https://www.rappler.com/business/forever-21-files-bankruptcy-again-march-2025/",
    "timestamp": "2025-03-18T13:26:29Z"
  },
  {
    "title": "'Should be impeached!!!' Trump lashes out at judge in furious caps-heavy Truth Social rant",
    "description": "President Donald Trump on Tuesday lashed out at the judge who ordered his administration to halt flights bringing immigrants to a prison in El Salvador.Writing on his Truth Social page, Trump attacked Judge James Boasberg for blocking the administration from …",
    "link": "https://www.rawstory.com/trump-judge-2671349025/",
    "timestamp": "2025-03-18T13:26:28Z"
  },
  {
    "title": "Pentagon restores a few webpages honoring servicemembers but still defends DEI purge",
    "description": "The Pentagon is staunchly defending its overall campaign to strip out content singling out the contributions by women and minority groups.",
    "link": "https://www.bostonherald.com/2025/03/18/pentagon-defends-dei-purge/",
    "timestamp": "2025-03-18T13:23:42Z"
  },
  {
    "title": "Pentagon restores a few webpages honoring servicemembers but still defends DEI purge",
    "description": "The Pentagon is staunchly defending its overall campaign to strip out content singling out the contributions by women and minority groups.",
    "link": "https://www.denverpost.com/2025/03/18/pentagon-defends-dei-purge/",
    "timestamp": "2025-03-18T13:23:42Z"
  },
  {
    "title": "Tourists say ‘No Thanks’ to U.S. under Donald Trump; President's America first approach backfires as foreign tourism plummets, costing economy an estimated $18 billion",
    "description": "Foreign visitors are cancelling their US trips due to President Trump's policies, with tourism losses potentially reaching $64 billion by 2025. Issues include stricter immigration rules, trade tensions, and controversial proposals involving Canada and Greenla…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tourists-say-no-thanks-to-u-s-under-donald-trump-presidents-america-first-approach-backfires-as-foreign-tourism-plummets-costing-economy-an-estimated-18-billion/articleshow/119163277.cms",
    "timestamp": "2025-03-18T13:23:36Z"
  },
  {
    "title": "What to Watch for in Potential Trump-Putin Talks",
    "description": "President Donald Trump said he’ll speak with Russian President Vladimir Putin on Tuesday as the US presses for an end to fighting in Ukraine and European nations rush to bolster their support for Kyiv.\n“We are doing pretty well I think with Russia,” Trump tol…",
    "link": "https://biztoc.com/x/6da53eefc3cdc604",
    "timestamp": "2025-03-18T13:22:41Z"
  },
  {
    "title": "Trump Demands Impeachment of 'Crooked' Judge",
    "description": "President Donald Trump attacked what he called the \"crooked\" judge who blocked his deportation of Venezuelans and demanded his impeachment.\nU.S. District Judge James E. Boasberg temporarily blocked the Trump Administration from using an 18th-century wartime l…",
    "link": "https://biztoc.com/x/9b9bb34db1ed2777",
    "timestamp": "2025-03-18T13:22:36Z"
  },
  {
    "title": "The American and European Publics Still Stand With Ukraine",
    "description": "Despite the high cost of defending Ukraine, voters on both sides of the Atlantic – including Republicans in the United States – remain surprisingly united in their support for the country – and for the broader transatlantic alliance. If NATO unravels, its und…",
    "link": "https://www.project-syndicate.org/commentary/trump-ukraine-strategy-out-of-step-with-majorities-in-us-europe-by-mathieu-lefevre-and-tim-dixon-2025-03",
    "timestamp": "2025-03-18T13:22:04Z"
  },
  {
    "title": "FACT CHECK: No, Trump Did Not Refer To Nikola Tesla As A ‘Modern-Day Isaac Neutron’",
    "description": "A viral video shared on Instagram claims President Donald Trump purportedly referred to Serbian-American scientist and inventor Nikola Tesla as a “modern-day Isaac Neutron.” Verdict: False There is no evidence suggesting Trump made the purported remark. Both …",
    "link": "https://checkyourfact.com/2025/03/18/fact-check-trump-tesla-modern-isaac-neutron/",
    "timestamp": "2025-03-18T13:21:06Z"
  },
  {
    "title": "Putin to hold phone call with Trump",
    "description": "The Russian president met leaders of the nation’s industries ahead of a crucial conversation with his US counterpart Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614396-putin-trump-call-ukraine/",
    "timestamp": "2025-03-18T13:20:52Z"
  },
  {
    "title": "Veterans Group Wants to Make Elon the Supervillain of the Midterms (Joe Perticone/The Bulwark)",
    "description": "Joe Perticone / The Bulwark:\nVeterans Group Wants to Make Elon the Supervillain of the Midterms  —  AS PROGRESSIVES START WORKING IN EARNEST on their midterm elections playbook, it appears that Elon Musk, not Donald Trump, will be the primary target.  —  Vote…",
    "link": "https://www.memeorandum.com/250318/p28",
    "timestamp": "2025-03-18T13:20:01Z"
  },
  {
    "title": "FACT CHECK: Facebook Post Falsely Claims Elon Musk Has Acquired MSNBC For $900 Million",
    "description": "A post shared on Facebook claims Department of Government Efficiency (DOGE) lead and Tesla CEO Elon Musk has purportedly acquired MSNBC for $900 million. Verdict: False The purported remark is not referenced on Musk’s verified X account @elonmusk, and there i…",
    "link": "https://checkyourfact.com/2025/03/18/fact-check-post-musk-acquired-msnbc-900-million/",
    "timestamp": "2025-03-18T13:19:44Z"
  },
  {
    "title": "Israel Pounds Gaza With Airstrikes After Hamas Ceasefire Breaks Down Over Hostage Talks",
    "description": "Israel launched a massive wave of airstrikes on Gaza Monday night as a fragile ceasefire broke down amid stalling hostage release negotiations with Hamas.",
    "link": "https://dailycaller.com/2025/03/18/israel-pounds-gaza-with-airstrikes-after-hamas-ceasefire-breaks-down-over-hostage-talks/",
    "timestamp": "2025-03-18T13:17:53Z"
  },
  {
    "title": "Hashdex Seeks SEC Permission To Add Ripple’s XRP, Cardano, And Solana To Its Crypto ETF Index",
    "description": "Brazil-based asset manager Hashdex has amended its S-1 regulatory filing with the U.S. Securities and Exchange Commission to expand its crypto index ETF with seven additional altcoins, including XRP, Solana, and Cardano.  The submission comes three months aft…",
    "link": "https://zycrypto.com/hashdex-seeks-sec-permission-to-add-ripples-xrp-cardano-and-solana-to-its-crypto-etf-index/",
    "timestamp": "2025-03-18T13:17:51Z"
  },
  {
    "title": "Simon Harris says Conor McGregor 'represents the very worst of toxic masculinity'",
    "description": "The fallout from McGregor’s visit to Donald Trump at the White House continued today.",
    "link": "https://www.thejournal.ie/conor-mcgregor-trump-6652590-Mar2025/",
    "timestamp": "2025-03-18T13:17:37Z"
  },
  {
    "title": "Outside the Box: AI’s Honest Take on Europe’s Ambiguity, Part 2",
    "description": "In Part 1, we discussed the current surprisingly extreme rhetoric used by some European leaders in reaction to their sense of having been betrayed by the United States’s new Trump administration concerning the war in Ukraine. ChatGPT judged that “the current …",
    "link": "https://www.fairobserver.com/more/science/outside-the-box-ais-honest-take-on-europes-ambiguity-part-2/",
    "timestamp": "2025-03-18T13:17:34Z"
  },
  {
    "title": "Actor Mark Ruffalo Claims America on 'March to Dictatorship' After Brown Prof. Who Attended Hezbollah Leader's Funeral Is Deported",
    "description": "Mark Ruffalo melted down over the deportation of Lebanese Brown University professor Dr. Rasha Alawieh, whom the Department of Homeland Security said attended the funeral of Hezbollah leader Hassan Nasrallah.",
    "link": "https://www.breitbart.com/entertainment/2025/03/18/actor-mark-ruffalo-claims-america-on-march-to-dictatorship-after-brown-prof-who-attended-hezbollah-leaders-funeral-is-deported/",
    "timestamp": "2025-03-18T13:16:19Z"
  },
  {
    "title": "WATCH: Gregg Jarrett says this one thing could help Trump expose Biden’s alleged false signatures",
    "description": "'You can't really ask him because he doesn't remember what he had for breakfast'",
    "link": "https://www.wnd.com/2025/03/watch-gregg-jarrett-says-this-one-thing-could-help-trump-expose-bidens-alleged-false-signatures/",
    "timestamp": "2025-03-18T13:15:37Z"
  },
  {
    "title": "Stephen Miller Unloads on Andrew Weissmann: ‘He is an Absolute Moron, He is a Fool, and He’s a Degenerate’ for Defending Illegal Alien Terrorists",
    "description": "In a fiery exchange, Stephen Miller condemns Andrew Weissmann's defense of illegal alien terrorists, asserting that such positions endanger American lives. This clash highlights the intense divisions over national security and immigration policy.\nThe post Ste…",
    "link": "https://www.thegatewaypundit.com/2025/03/stephen-miller-unloads-andrew-weissmann-he-is-absolute/",
    "timestamp": "2025-03-18T13:15:28Z"
  },
  {
    "title": "CNN’s Scott Jennings Admits Trump Likely Can’t ‘Void’ Pardons as Abby Phillip Assails His Argument",
    "description": "Scott Jennings admitted President Donald Trump likely can't \"void\" President Joe Biden's pardons even as he sparred with anchor Abby Phillip.\nThe post CNN’s Scott Jennings Admits Trump Likely Can’t ‘Void’ Pardons as Abby Phillip Assails His Argument first app…",
    "link": "https://www.mediaite.com/news/cnns-scott-jennings-admits-trump-likely-cant-void-pardons-as-abby-phillip-assails-his-argument/",
    "timestamp": "2025-03-18T13:15:20Z"
  },
  {
    "title": "Trump filmed stumbling up Marine One steps as health fears continue to grow - NewsBreak",
    "description": "People have compared Donald Trump to former President Joe Biden after the new leader of the White House was caught on camera stumbling up steps of his Mari",
    "link": "https://www.newsbreak.com/share/3857318792394-trump-filmed-stumbling-up-marine-one-steps-as-health-fears-continue-to-grow?_f=app_share&amp;pd=02rcitGi&amp;lang=en_US&amp;send_time=1742303626&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.10.2.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_rank_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v3%2Cns_foryou_recall_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v1&amp;s=i2",
    "timestamp": "2025-03-18T13:14:25Z"
  },
  {
    "title": "Death Toll Rises from Unusually Vicious Storms in Midwest, Southern States",
    "description": "(AP) — Unusually vicious and damaging weather across multiple U.S. states spawned violent tornadoes, blinding dust storms and fast-moving wildfires over the weekend, leaving at least 39 people dead. In the latest tally of the destruction, the Oklahoma Departm…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/03/18/815948.htm",
    "timestamp": "2025-03-18T13:13:02Z"
  },
  {
    "title": "Trump Demands Impeachment of 'Crooked' Judge",
    "description": "Donald Trump lashed out at the judge who tried to block his deportation of Venezuelans.",
    "link": "https://www.newsweek.com/trump-demands-impeachment-crooked-judge-2046423",
    "timestamp": "2025-03-18T13:12:51Z"
  },
  {
    "title": "The cost of U.S. imports jump in February. Is it the Trump tariff effect?",
    "description": "The cost of imports rose faster than usual in February, perhaps a result of U.S. companies rushing to bring in foreign goods ahead of President Donald Trump’s tariffs.",
    "link": "https://biztoc.com/x/51c0ac17d67e34ed",
    "timestamp": "2025-03-18T13:12:09Z"
  },
  {
    "title": "Nolte: Disgraced AP Lies About Tulsi Gabbard Describing Trump and Putin as ‘Very Good Friends’",
    "description": "The disgraced, far-left Associated Press’s latest lying piece of fake news involves spreading the blatant falsehood that Director of National Intelligence Tulsi Gabbard described President Trump and Russian President Vladimir Putin as “very good friends.”\nThe…",
    "link": "https://www.breitbart.com/the-media/2025/03/18/nolte-disgraced-ap-lies-about-tulsi-gabbard-describing-trump-and-putin-as-very-good-friends/",
    "timestamp": "2025-03-18T13:11:20Z"
  },
  {
    "title": "Audi weighs price increases to soften US tariff blow",
    "description": "Audi is considering whether to pass on the cost of U.S. import tariffs to customers and expects a decision this year on localising production in North America. The company aims to find a balance between price increases and production volume adjustments amidst…",
    "link": "https://economictimes.indiatimes.com/news/international/business/audi-weighs-price-increases-to-soften-us-tariff-blow/articleshow/119165153.cms",
    "timestamp": "2025-03-18T13:11:08Z"
  },
  {
    "title": "Is Trump helping other world leaders gain popularity back home?",
    "description": "Trudeau, Zelenskyy, Sheinbaum and other leaders have seen a boost in approval ratings amid negotiations with Trump.",
    "link": "https://www.aljazeera.com/news/2025/3/18/is-trump-helping-other-world-leaders-gain-popularity-back-home",
    "timestamp": "2025-03-18T13:11:06Z"
  },
  {
    "title": "Flying to Mars: Russia anticipates space sector collaboration with US and Elon Musk",
    "description": "Russian President Vladimir Putin aims to collaborate with the United States, particularly in the space sector, with upcoming discussions involving SpaceX's Elon Musk about Mars missions. Russian envoy Kirill Dmitriev announces intentions to strengthen Roscosm…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-flying-to-mars-russia-anticipates-space-sector-collaboration-with-us-and-elon-musk-putin-envoy-kirill-dmitriev/articleshow/119165061.cms",
    "timestamp": "2025-03-18T13:08:40Z"
  },
  {
    "title": "Web pages about heroic WWII Native American code talkers become latest victims of anti-DEI purge",
    "description": "US president Donald Trump’s desire to eradicate diversity, equity and inclusion (DEI) initiatives have prompted the military to begin removing web pages dedicated to WWII Navajo code talkers. The Independent reports that at least 10 pages dedicated to the ing…",
    "link": "https://www.thepinknews.com/2025/03/18/navajo-code-talkers-dei/",
    "timestamp": "2025-03-18T13:08:00Z"
  },
  {
    "title": "Israel Consulted Trump White House Before Renewing Attacks on Hamas",
    "description": "Israel consulted with President Donald Trump's administration before renewing its attack on Hamas in Gaza, White House Press Secretary Karoline Leavitt told Fox News on Monday night.\nThe post Israel Consulted Trump White House Before Renewing Attacks on Hamas…",
    "link": "https://www.breitbart.com/middle-east/2025/03/18/israel-consulted-trump-white-house-before-renewing-attacks-on-hamas/",
    "timestamp": "2025-03-18T13:06:02Z"
  },
  {
    "title": "Natalie Winters Brings the Receipts: Soros-Funded Group Indivisible is PAYING Far-Left Activists to Protest at Tesla Dealerships",
    "description": "For weeks now Democrat Party proxy groups have been violently protesting at Tesla dealerships around the country. Democrats are outraged that President Donald Trump, Elon Musk, and his DOGE team have found over $100 billion in waste and fraud in the US govern…",
    "link": "https://freerepublic.com/focus/f-news/4305050/posts",
    "timestamp": "2025-03-18T13:05:58Z"
  },
  {
    "title": "Two Hour Trump-Putin Ukraine Ceasefire Call Taking Place Tuesday Morning",
    "description": "Trump scheduled to speak to his Russian counterpart for two hours on Tuesday as they seek an answer to a potential ceasefire in Ukraine.\nThe post Two Hour Trump-Putin Ukraine Ceasefire Call Taking Place Tuesday Morning appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/03/18/two-hour-trump-putin-ukraine-ceasefire-call-tuesday-morning/",
    "timestamp": "2025-03-18T13:02:22Z"
  },
  {
    "title": "Trump Says He’ll Release ‘All’ 80,000 JFK Files Today",
    "description": "Trump previously issued an executive order mandating the release of government records pertaining to the assassinations of Kennedy, his brother Robert F. Kennedy and Martin Luther King Jr.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/18/trump-says-hell-release-all-80000-jfk-files-today/",
    "timestamp": "2025-03-18T13:01:21Z"
  },
  {
    "title": "Who Can Donald Trump Revoke Secret Service Protection From? What To Know",
    "description": "President Donald Trump has revoked Secret Service protection for Joe Biden's two adult children.\nWhy It Matters\nRevoking Secret Service protection for Biden's two adult children would place them at greater risk of a physical attack. That applies especially to…",
    "link": "https://biztoc.com/x/8d3410809081b0be",
    "timestamp": "2025-03-18T13:01:13Z"
  },
  {
    "title": "Revealed: Donald Trump once offered his bed to MAGA star, but told her not to tell Melania",
    "description": "A new book by Axios reporter Alex Isenstadt reveals Donald Trump's private conversations, including his sarcastic remarks about allies and rivals. The book contains anecdotes such as Trump jokingly offering Rep. Anna Luna his bed and critical comments about L…",
    "link": "https://economictimes.indiatimes.com/news/international/us/revealed-donald-trump-once-offered-his-bed-to-maga-star-but-told-her-not-to-tell-melania/articleshow/119164546.cms",
    "timestamp": "2025-03-18T13:00:53Z"
  },
  {
    "title": "Fact Check: Has Elon Musk Been 'Demoted' by Donald Trump?",
    "description": "On March 8, MSNBC News broadcast a segment presented by Ari Melber which included \"Musk demoted!\" in its title.\nThe piece was based on a New York Times article published the previous day which reported there was a confrontation during a White House Cabinet Ro…",
    "link": "https://biztoc.com/x/05921628e8deae13",
    "timestamp": "2025-03-18T13:00:48Z"
  },
  {
    "title": "Trump says 80,000 files about 1963 JFK assassination are about to be released with no redactions—but it’s unclear how many are new",
    "description": "President Donald Trump says files related to the 1963 assassination of President John F. Kennedy will be released Tuesday without any redactions, making good on a promise he made during his campaign.\nTrump told reporters Monday that his administration will be…",
    "link": "https://biztoc.com/x/4f44d331a6d2f3d3",
    "timestamp": "2025-03-18T13:00:40Z"
  },
  {
    "title": "Musk said 'The fundamental weakness of Western civilization is empathy.' Here's his full quote",
    "description": "Elon Musk, the billionaire adviser to U.S. President Donald Trump, said: “The fundamental weakness of Western civilization is empathy.”",
    "link": "https://www.snopes.com//fact-check/musk-empathy-quote/",
    "timestamp": "2025-03-18T13:00:00Z"
  },
  {
    "title": "Smarter Flood Protection Is Inspired by Nature",
    "description": "The U.S. Army Corps of Engineers has uncharacteristically been working with nature instead of bulldozing it into submission. Will this enlightened approach prevail?",
    "link": "https://www.scientificamerican.com/article/smarter-flood-protection-is-inspired-by-nature/",
    "timestamp": "2025-03-18T13:00:00Z"
  },
  {
    "title": "House Republicans Zero in on 26 ‘Vulnerable’ Democrat Incumbents",
    "description": "DAILY CALLER NEWS FOUNDATION—Twenty-six House Democrats have been deemed “vulnerable” in the 2026 midterm elections by the National Republican Congressional Committee, posing a prime opportunity... Read More\nThe post House Republicans Zero in on 26 ‘Vulnerabl…",
    "link": "https://www.dailysignal.com/2025/03/18/house-republicans-zero-in-on-26-vulnerable-democrat-incumbents/",
    "timestamp": "2025-03-18T13:00:00Z"
  },
  {
    "title": "By the Book: Benjamin Hall on Zelenskyy’s Oval Office Meeting, Confronting Challenges, and Staying ‘Resolute’",
    "description": "By the Book is a feature series where journalists discuss their works of fiction and non-fiction. It's the kind of full circle moment that another journalist might have approached as their mic drop story. In November 2023, Fox News senior correspondent Benjam…",
    "link": "https://www.adweek.com/tvnewser/benjamin-hall-fox-news-zelenskyy-trump-resolute/",
    "timestamp": "2025-03-18T13:00:00Z"
  },
  {
    "title": "Dropkick Murphys Banned From X on St. Patrick’s Day After Singer Told MAGA Fan to ‘Shut the F**k Up’ During Concert Rant",
    "description": "Dropkick Murphys were suspended from X following the singer Ken Casey telling a MAGA follower to \"shut the f**k up\" during a series of St. Patrick's Day shows.\nThe post Dropkick Murphys Banned From X on St. Patrick’s Day After Singer Told MAGA Fan to ‘Shut th…",
    "link": "https://www.mediaite.com/entertainment/x-suspends-celtic-band-dropkick-murphys-on-st-patricks-day-following-singer-telling-maga-fan-to-shut-the-fk-up-during-anti-trump-concert-rant/",
    "timestamp": "2025-03-18T12:59:38Z"
  },
  {
    "title": "Dropkick Murphys Singer Berates Fan Showing Off MAGA Hat During St. Patrick’s Day Concert: ‘Shut the F**k Up!’",
    "description": "The lead singer of the popular Celtic punk band Dropkick Murphys told a MAGA follower to \"shut the fuck up\" during a series of St. Patrick's Day shows.\nThe post Dropkick Murphys Singer Berates Fan Showing Off MAGA Hat During St. Patrick’s Day Concert: ‘Shut t…",
    "link": "https://www.mediaite.com/entertainment/dropkick-murphys-singer-berates-fan-showing-off-maga-hat-during-st-patricks-day-concert-shut-the-fk-up/",
    "timestamp": "2025-03-18T12:59:38Z"
  },
  {
    "title": "Ireland’s exports to US soared in January, as Trump tariffs loom",
    "description": "Exports of medical and pharmaceutical products rose by €6bn in January, in a further illustration of Ireland’s vulnerability to trade tariffs.",
    "link": "https://www.independent.ie/business/irelands-exports-to-us-soared-in-january-as-trump-tariffs-loom/a420978263.html",
    "timestamp": "2025-03-18T12:59:19Z"
  },
  {
    "title": "Some US firms stockpiling Irish pharmaceuticals, as Trump tariffs loom",
    "description": "There are indications that some US importers have been stockpiling Irish pharmaceutical products in advance of the tariffs threatened by President Donald Trump.",
    "link": "https://www.independent.ie/business/some-us-firms-stockpiling-irish-pharmaceuticals-as-trump-tariffs-loom/a420978263.html",
    "timestamp": "2025-03-18T12:59:19Z"
  },
  {
    "title": "What Next for Gaza Ceasefire As Israel Renews Strikes",
    "description": "Israel should be held \"fully responsible for violating and overturning the agreement,\" a Hamas spokesperson said in a statement shared with Newsweek.",
    "link": "https://www.newsweek.com/israel-gaza-attack-hamas-ceasefire-2046243",
    "timestamp": "2025-03-18T12:58:28Z"
  },
  {
    "title": "Rachel Zegler sparks backlash for honoring original ‘Snow White’ actress after bashing 1937 film",
    "description": "Rachel Zegler got called out online for the \"nasty stuff\" she's said about the original \"Snow White.\"",
    "link": "https://nypost.com/2025/03/18/entertainment/rachel-zegler-sparks-backlash-with-snow-white-tribute-to-original-actress/",
    "timestamp": "2025-03-18T12:57:25Z"
  },
  {
    "title": "New Brunswick Liberals present first budget today as trade war continues",
    "description": "The budget comes as Canada is in a trade war with the United States, and Premier Susan Holt has said the economic uncertainty has made balancing the budget an \"exceptionally difficult\" task.",
    "link": "https://www.nationalobserver.com/2025/03/18/news/new-brunswick-liberals-budget-trade-war",
    "timestamp": "2025-03-18T12:55:21Z"
  },
  {
    "title": "Top House Democrats are seeking DOGE details under the Freedom of Information Act",
    "description": "The Democrats question whether the Trump administration’s DOGE Service is operating “outside the bounds of federal law.”",
    "link": "https://www.bostonherald.com/2025/03/18/house-democrats-doge-details-fisa/",
    "timestamp": "2025-03-18T12:53:14Z"
  },
  {
    "title": "A brief history of Medicaid and America’s long struggle to establish a health care safety net",
    "description": "Left out of FDR’s New Deal, the health insurance program for the poor was finally established in 1965.",
    "link": "https://theconversation.com/a-brief-history-of-medicaid-and-americas-long-struggle-to-establish-a-health-care-safety-net-251776",
    "timestamp": "2025-03-18T12:53:12Z"
  },
  {
    "title": "Social movements constrained Trump in his first term – more than people realize",
    "description": "Pushback works.",
    "link": "https://theconversation.com/social-movements-constrained-trump-in-his-first-term-more-than-people-realize-248843",
    "timestamp": "2025-03-18T12:52:59Z"
  },
  {
    "title": "Who Can Donald Trump Revoke Secret Service Protection From? What To Know",
    "description": "Trump cannot remove Joe Biden's protection, but may be able to do so for Hunter and Ashley Biden.",
    "link": "https://www.newsweek.com/president-donald-trump-secret-service-protection-hunter-biden-ashley-biden-joe-biden-executive-order-2046301",
    "timestamp": "2025-03-18T12:51:54Z"
  },
  {
    "title": "California fishermen turn to boat tourism as salmon ban continues",
    "description": "Barred from catching salmon off the California coast, fishermen have been running boat tours to stay afloat.",
    "link": "https://www.cbsnews.com/news/california-salmon-ban-fishermen-boat-tourism/",
    "timestamp": "2025-03-18T12:51:33Z"
  },
  {
    "title": "FO° Talks: Trump and Co. Sell Europe Up the River. Now What?",
    "description": "Discussing the implications of US policies on Europe and the growing threat to European unity, Atul Singh and Sebastian Schäffer explore the geopolitical challenges Europe faces and its role in the unfolding global order. Sebastian paints a grim picture for E…",
    "link": "https://www.fairobserver.com/politics/fo-talks-trump-and-co-sell-europe-up-the-river-now-what/",
    "timestamp": "2025-03-18T12:50:55Z"
  },
  {
    "title": "Fact Check: Has Elon Musk Been 'Demoted' by Donald Trump?",
    "description": "An MSNBC report said Musk had been \"demoted\" after clashing with a number of President Trump's cabinet secretaries.",
    "link": "https://www.newsweek.com/fact-check-has-elon-musk-been-demoted-donald-trump-2046334",
    "timestamp": "2025-03-18T12:50:06Z"
  },
  {
    "title": "On Kennedy Center Stage, Folk Musicians Nora Brown & Stephanie Coleman Protest Trump's Takeover",
    "description": "One of President Donald Trump’s most intense fixations since returning to the White House has been to take over and overhaul the Kennedy Center, the national arts and culture institution in Washington, D.C. Trump fired the president of the Kennedy Center, rep…",
    "link": "https://www.democracynow.org/2025/3/18/kennedy_center",
    "timestamp": "2025-03-18T12:48:56Z"
  },
  {
    "title": "Attacks in Gaza and Yemen leave Iran in confusion over its next moves",
    "description": "If Tehran is not careful it will wake up to find all its proxies have had their wings clipped - then they become a liability, instead of an asset.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-846566",
    "timestamp": "2025-03-18T12:48:54Z"
  },
  {
    "title": "1 kg of gold could buy a Maruti 800 in 1990. Now you can purchase a BMW or an Audi",
    "description": "Gold hit a record high of Rs 88,672 per 10 grams, enough to buy luxury cars like BMW and Audi. Its three-year rally, driven by central bank purchases and geopolitical tensions, continues in 2024. Analysts predict further gains amid global uncertainties and st…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/1-kg-of-gold-could-buy-a-maruti-800-in-1990-now-you-can-purchase-a-bmw-or-an-audi/articleshow/119164187.cms",
    "timestamp": "2025-03-18T12:48:48Z"
  },
  {
    "title": "Controversy-stricken Wayne Gretzky now suing someone over chewing gum",
    "description": "Wayne Gretzky is once again back in the news for a not-so-glamourous reason.\r\n'The Great One' has come under fire over the past few months due to his close relationship with U.S. President Donald Trump amid tensions between the United States and Canada.\r\nGret…",
    "link": "https://dailyhive.com/toronto/gretzky-suing-business-partner-weight-loss-gum",
    "timestamp": "2025-03-18T12:46:48Z"
  },
  {
    "title": "Morning Joe Pundit Names Only 2 Supreme Court Justices Not ‘Lost On MAGA Island’ Who Can Fight Trump’s ‘Big Government Overreach’",
    "description": "Morning Joe pundit Claire McCaskill named Supreme Court judges John Roberts and Amy Coney Barrett as the two justices who aren’t “lost on MAGA island” and have “shown a willingness” to fight back against President Donald Trump’s “Big Government overreach.” Tr…",
    "link": "https://www.mediaite.com/tv/morning-joe-pundit-names-only-2-supreme-court-justices-not-lost-on-maga-island-who-can-fight-trumps-big-government-overreach/",
    "timestamp": "2025-03-18T12:46:00Z"
  },
  {
    "title": "Joe Exotic Asks Trump for Pardon, Says Mexican Partner Will Deport Himself",
    "description": "His partner is a fellow inmate currently serving time for immigration related offenses.",
    "link": "https://www.newsweek.com/joe-exotic-tiger-king-husband-will-deport-himself-2046294",
    "timestamp": "2025-03-18T12:45:35Z"
  },
  {
    "title": "Catholic clergy, laypeople to gather for prayer at Trump’s Mar-a-Lago",
    "description": "Catholics for Catholics held its first event at Mar-a-Lago in 2024. / Credit: Courtesy of John Yep\n\nWashington, D.C. Newsroom, Mar 18, 2025 / 08:45 am (CNA).\nNearly 100 members of the Catholic clergy are expected to be among those praying for President Donald…",
    "link": "https://www.catholicnewsagency.com/news/262815/catholic-clergy-laypeople-to-gather-for-prayer-at-trumps-mar-a-lago",
    "timestamp": "2025-03-18T12:45:00Z"
  },
  {
    "title": "Social Security May Stop Payments To 170,000 As Musk Targets Fraud",
    "description": "Social Security Administration officials are considering a policy that could effectively strip Social Security benefits from thousands of people.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/03/18/social-security-may-cut-payments-to-170000-under-musks-crackdown/",
    "timestamp": "2025-03-18T12:45:00Z"
  },
  {
    "title": "Dropkick Murphys X Feed Suspended After Singer Slams 'Rat' Donald Trump",
    "description": "Dropkick Murphys singer slammed 'rat and a coward' Donald Trump during a St. Patrick's Day show in Boston.",
    "link": "http://www.billboard.com/music/rock/dropkick-murphys-x-account-suspended-singer-trump-rat-coward-1235924543/",
    "timestamp": "2025-03-18T12:44:43Z"
  },
  {
    "title": "Podcaster Gavin Newsom Needs Another $2.8 Billion Loan for Medi-Cal to Cover Illegal Aliens",
    "description": "California Gov. Gavin Newsom (D) is asking for another $2.8 billion loan to keep Medi-Cal, the state's Medicaid plan, afloat after asking for $3.44 billion last week to cover a program that has expanded to include illegal aliens for free.\nThe post Podcaster G…",
    "link": "https://www.breitbart.com/politics/2025/03/18/podcaster-gavin-newsom-needs-another-2-8-billion-loan-for-medi-cal-to-cover-illegal-aliens/",
    "timestamp": "2025-03-18T12:42:37Z"
  },
  {
    "title": "A (nearly) complete list of Trump’s actions in his eighth week in office",
    "description": "President Donald Trump took his most dramatic step to claim executive powers in his eighth week in office, invoking the Alien Enemies Act to begin deporting noncitizens without giving them a chance to go before a judge.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-alien-enemies-act-pardons-week-review-rcna196001",
    "timestamp": "2025-03-18T12:41:19Z"
  },
  {
    "title": "Bill Gates warns White House he can't fill shortfalls in US global health funding",
    "description": "Bill Gates has been actively lobbying Trump administration officials to maintain funding for global health programs, including childhood vaccinations and HIV treatment. He emphasized that the Gates Foundation cannot replace U.S. government support. Gates met …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bill-gates-warns-white-house-he-cant-fill-shortfalls-in-us-global-health-funding/articleshow/119163860.cms",
    "timestamp": "2025-03-18T12:38:55Z"
  },
  {
    "title": "Putin Demands Halt To All Western Arms For Ukraine Ahead Of Trump Call",
    "description": "Putin Demands Halt To All Western Arms For Ukraine Ahead Of Trump Call\n \nJust ahead of the high-stakes phone call between Donald Trump and Vladimir Putin on Tuesday, Bloomberg is reporting that the Russian leader will stipulate that all weapons deliveries to …",
    "link": "https://biztoc.com/x/e9840460c2979b23",
    "timestamp": "2025-03-18T12:38:35Z"
  },
  {
    "title": "China Halts US LNG Imports as Trade War Reroutes Deliveries",
    "description": "China hasn’t imported liquefied natural gas from the US for 40 days, the longest gap in almost two years, as traders are forced to divert shipments elsewhere to avoid Beijing’s tariffs on the super-chilled fuel.",
    "link": "https://gcaptain.com/china-halts-us-lng-imports-as-trade-war-reroutes-deliveries/",
    "timestamp": "2025-03-18T12:35:10Z"
  },
  {
    "title": "Trump to hold call with Putin in test of deal-making strength (Jeff Mason/Reuters)",
    "description": "Jeff Mason / Reuters:\nTrump to hold call with Putin in test of deal-making strength  —  U.S. President Donald Trump will speak with Russian President Vladimir Putin on Tuesday in an attempt to convince his counterpart to accept a ceasefire in Russia's war wit…",
    "link": "https://www.memeorandum.com/250318/p23",
    "timestamp": "2025-03-18T12:35:01Z"
  },
  {
    "title": "UN migration agency warns of severe impact on migrants as US cuts force shutdowns",
    "description": "GENEVA (Reuters) - The U.N. migration agency said on Tuesday that unprecedented cuts in donor funding this year will force it to scale back or shut down projects around the world, resulting in a severe impact on migrants and affecting over 6,000 staff. Read f…",
    "link": "https://www.thestar.com.my/news/world/2025/03/18/un-migration-agency-warns-of-severe-impact-on-migrants-as-us-cuts-force-shutdowns",
    "timestamp": "2025-03-18T12:35:00Z"
  },
  {
    "title": "Ukraine Mulls Lifting Russia Sanctions in Exchange for 'Lasting' Peace",
    "description": "Ukraine's top sanctions official said doing so might help Russia \"make a deal on lasting peace.\"",
    "link": "https://www.newsweek.com/ukraine-mulls-lifting-russia-sanctions-putin-exchange-lasting-peace-2046272",
    "timestamp": "2025-03-18T12:34:47Z"
  },
  {
    "title": "Everything That Could Happen When Prince Harry's Controversy-Shrouded Visa Papers Are Finally Made Public TODAY — From Diplomatic Emergency Measures to Royal Exile Being BARRED From U.S.",
    "description": "Prince Harry's visa papers will be made available today – as Donald Trump is urged to banish the Royal from the U.S if it's proven he's lied about drug taking.",
    "link": "https://radaronline.com/p/prince-harry-visa-papers-finally-made-public-today-royal-facing-barred-from-us/",
    "timestamp": "2025-03-18T12:33:57Z"
  },
  {
    "title": "Trump's Latest Move Against Biden Is Aimed At Ex-President's Family",
    "description": "\"I'm going to take a look at that,\" the president said before the White House announced its action.",
    "link": "https://www.huffpost.com/entry/donald-trump-secret-service-hunter-biden-ashley-biden_n_67d96355e4b09e1e6e0b3fde",
    "timestamp": "2025-03-18T12:33:56Z"
  },
  {
    "title": "DOGE, XRP Down 3% as Bitcoin Traders Eye Wednesday Fed Decision",
    "description": "Analysts from QCP Capital suggest that while a rate cut is unlikely, any dovish signal could ignite upside momentum for bitcoin, potentially lifting altcoins in its wake.",
    "link": "https://www.coindesk.com/markets/2025/03/18/doge-xrp-down-3-as-bitcoin-traders-eye-wednesday-fed-decision",
    "timestamp": "2025-03-18T12:32:35Z"
  }
]