[
  {
    "title": "4 Ways Trump Is Going After Legal Immigrants",
    "description": "Trump campaigned on deporting illegal immigrants. But now he’s attempting to restrict legal immigration too by revoking TPS status, deporting visa holders, ending birthright citizenship, and denaturalizing U.S. citizens.",
    "link": "http://nymag.com/intelligencer/article/4-ways-trump-is-going-after-legal-immigrants.html",
    "timestamp": "2025-03-20T16:56:37Z"
  },
  {
    "title": "How Trump Could Snatch a Third Term — Despite the 22nd Amendment\nFour ways Trump could stay in power beyond 2028.",
    "description": "If Trump decided he wanted to hold onto power past 2028, there are at least four paths he could try:",
    "link": "https://freerepublic.com/focus/f-news/4305615/posts",
    "timestamp": "2025-03-20T16:55:56Z"
  },
  {
    "title": "Donald Trump doubles down on Canada as 51st State, claims U.S. subsidizes it by $200 billion, calls former PM Justin Trudeau’s staff nasty",
    "description": "President Donald Trump has renewed his demand for Canada to become America's '51st state' and criticized former Canadian Prime Minister Justin Trudeau's aides as 'nasty.' Trump exaggerated the American trade deficit and claimed the US is not dependent on Cana…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-doubles-down-on-canada-as-51st-state-claims-u-s-subsidizes-it-by-200-billion-calls-former-pm-justin-trudeaus-staff-nasty/articleshow/119264079.cms",
    "timestamp": "2025-03-20T16:55:54Z"
  },
  {
    "title": "Democrats’ ‘defamatory’ billboards now taken down",
    "description": "Made false claims about Republican 'cuts' to Medicaid",
    "link": "https://www.wnd.com/2025/03/democrats-defamatory-billboards-now-taken-down/",
    "timestamp": "2025-03-20T16:55:17Z"
  },
  {
    "title": "Kirsty Coventry becomes first woman to chair the International Olympic Committee",
    "description": "Kirsty Coventry wrote her name forever in the universal encyclopedias by becoming the first woman in history to chair the International Olympic Committee in its 131-year existence.",
    "link": "https://www.marca.com/en/olympic-games/breaking/2025/03/20/67dc470e268e3ed2348b457e.html",
    "timestamp": "2025-03-20T16:54:55Z"
  },
  {
    "title": "Trump’s bluntness powered a White House comeback. Now his words are getting him in trouble in court",
    "description": "The president's shoot-from-the-lip style has undermined his administration's legal positions.",
    "link": "https://www.bostonherald.com/2025/03/20/trump-words-count/",
    "timestamp": "2025-03-20T16:54:51Z"
  },
  {
    "title": "Taiwan's president says the defense budget will exceed 3% of GDP in military overhaul",
    "description": "Taiwanese President William Lai Ching-te said Thursday that the island’s defense budget will exceed 3% of its economic output as it overhauls its military in the face of the rising threat from China",
    "link": "https://abcnews.go.com/US/wireStory/taiwans-president-defense-budget-exceed-3-gdp-military-119991556",
    "timestamp": "2025-03-20T16:54:26Z"
  },
  {
    "title": "Trump Is Taking On the Fed—With Crypto as the Tip of the Spear",
    "description": "Anticipated moves by President Trump and Senate Republicans appear intent on using crypto policy to achieve a broader goal: ending the Fed’s independence.",
    "link": "https://decrypt.co/310882/trump-taking-on-fed-crypto-tip-spear",
    "timestamp": "2025-03-20T16:53:41Z"
  },
  {
    "title": "Ex-GOP Official Calls Out Karoline Leavitt: 'Critical Thinking Has Died'",
    "description": "The White House press secretary argued Wednesday that a federal judge who has frequently ruled in favor of Trump is \"a Democrat activist.\"",
    "link": "https://www.huffpost.com/entry/ex-gop-official-calls-out-karoline-leavitt-critical-thinking-has-died_n_67dc0a5ee4b038b4d0a6565b",
    "timestamp": "2025-03-20T16:53:17Z"
  },
  {
    "title": "Conservative Candidate Is Within ‘Striking Distance’ Of Liberal Opponent In Swing State Judicial Contest: POLL",
    "description": "Conservative Wisconsin State Supreme Court candidate Brad Schimel is within \"striking distance\" of his left-wing opponent.",
    "link": "https://dailycaller.com/2025/03/20/conservative-brad-schimel-striking-distance-liberal-opponent-wisconsin-race/",
    "timestamp": "2025-03-20T16:53:15Z"
  },
  {
    "title": "USA's iconic Amtrak rail service to be privatized? Elon Musk suggests so, CEO steps down; here's what Donald Trump could do next",
    "description": "Amtrak CEO resigns amid privatization debates led by Elon Musk and Trump administration tensions. Discover how record 2024 ridership clashes with calls to privatize US rail services.",
    "link": "https://economictimes.indiatimes.com/news/international/us/usas-iconic-amtrak-rail-service-to-be-privatized-elon-musk-suggests-so-ceo-steps-down-heres-what-donald-trump-could-do-next/articleshow/119266260.cms",
    "timestamp": "2025-03-20T16:51:35Z"
  },
  {
    "title": "California’s wine industry leery of tariffs, but some growers hope they help",
    "description": "Some winegrape growers in the Golden State are hoping for a silver lining.",
    "link": "https://www.bostonherald.com/2025/03/20/california-wine-tariffs/",
    "timestamp": "2025-03-20T16:50:46Z"
  },
  {
    "title": "10 places where Tesla vehicles, dealerships were attacked this year",
    "description": "Tesla dealerships and vehicles are being vandalized and destroyed over Elon Musk's work with the Trump administration and the Department of Government Efficiency.",
    "link": "https://www.foxnews.com/us/10-places-where-tesla-vehicles-dealerships-were-attacked-year",
    "timestamp": "2025-03-20T16:50:34Z"
  },
  {
    "title": "Donald Trump imposes sanctions on Chinese companies over Iranian oil shipments",
    "description": "Measures from the US Treasury department are latest salvo in a ‘maximum pressure’ campaign on Tehran",
    "link": "https://biztoc.com/x/7b4a4a017037c643",
    "timestamp": "2025-03-20T16:49:54Z"
  },
  {
    "title": "Donald Trump puts pressure on Pochettino and the US national team ahead of the 2026 World Cup",
    "description": "One of the great illusions that they have in American soccer is to one day shine in world soccer, but due to their level and how they carry out their local league, that has been pr",
    "link": "https://www.marca.com/en/football/2025/03/20/67dc44a846163fd55e8b4592.html",
    "timestamp": "2025-03-20T16:49:44Z"
  },
  {
    "title": "Boris Johnson, one of Donald Trump’s best-known supporters, breaks ranks, slams president over failed Putin talks, says Russian leader is ‘laughing at us’",
    "description": "Boris Johnson, previously a staunch Trump supporter, has criticized the former U.S. president's handling of negotiations with Vladimir Putin. Johnson highlighted Putin's mockery and refusal to cease-fire in Ukraine, undermining hopes for peace. He expressed d…",
    "link": "https://economictimes.indiatimes.com/news/international/us/boris-johnson-one-of-donald-trumps-best-known-supporters-breaks-ranks-slams-president-over-failed-putin-talks-says-russian-leader-is-laughing-at-us/articleshow/119266173.cms",
    "timestamp": "2025-03-20T16:49:41Z"
  },
  {
    "title": "Joe Biden's 7 Grandchildren: All About His Granddaughters and Grandsons (and First Great-Grandchild!)",
    "description": "Joe Biden might be president of the United States, but to his grandchildren, he's just \"Pop.\" Biden has seven grandchildren by way of his four kids. The president's son Hunter Biden shares daughters Naomi, 31, Finnegan, 24, and Maisy, 23, with ex-wife Kathlee…",
    "link": "https://freerepublic.com/focus/f-chat/4305612/posts",
    "timestamp": "2025-03-20T16:49:09Z"
  },
  {
    "title": "South African central bank keeps repo rate unchanged at 7.5 pct",
    "description": "JOHANNESBURG, March 20 (Xinhua) -- The South African Reserve Bank (SARB) has kept the repo rate unchanged at 7.5 percent due to inflation remaining within the target range, the central bank announced on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/21/south-african-central-bank-keeps-repo-rate-unchanged-at-75-pct",
    "timestamp": "2025-03-20T16:47:00Z"
  },
  {
    "title": "Prince William meets Estonia's president amid tensions with Russia",
    "description": "The Prince of Wales has held talks with Estonia's president on the role of British troops as the UK seeks to bolster its ties to the Baltic state.",
    "link": "https://news.sky.com/story/prince-william-meets-estonias-president-amid-tensions-with-russia-13332676",
    "timestamp": "2025-03-20T16:46:00Z"
  },
  {
    "title": "US citizen George Glezmann released from detention in Afghanistan",
    "description": "<p>KABUL - Taliban authorities on Thursday freed US citizen George Glezmann after more than two years of detention, in a deal brokered by Qatar, US Secretary of State Marco Rubio announced.</p>",
    "link": "https://www.bangkokpost.com/world/2984250/us-citizen-george-glezmann-released-from-detention-in-afghanistan",
    "timestamp": "2025-03-20T16:45:00Z"
  },
  {
    "title": "Zelensky Plays Down US Proposal Of Ownership Of Ukraine's Nuclear Plants",
    "description": "Ukrainian President Volodymyr Zelensky on Thursday said he could not legally negotiate ownership of the occupied Zaporizhzhia nuclear power station, which President Donald Trump suggested Washington could take over.",
    "link": "https://www.ndtv.com/world-news/zelensky-plays-down-us-proposal-of-ownership-of-ukraines-nuclear-plants-7970840",
    "timestamp": "2025-03-20T16:44:52Z"
  },
  {
    "title": "‘Caught off guard’: EPA proposes to fire hundreds of scientists",
    "description": "“This is not designed to cut expenses, it's designed to destroy,” one official said.",
    "link": "http://grist.org/politics/caught-off-guard-epa-proposes-to-fire-hundreds-of-scientists/",
    "timestamp": "2025-03-20T16:42:45Z"
  },
  {
    "title": "Amtrak CEO abruptly resigns from the nation’s passenger railroad",
    "description": "The resignation comes after billionaire Elon Musk floated the idea of privatizing Amtrak.",
    "link": "https://www.bostonherald.com/2025/03/20/amtrak-ceo-resigns/",
    "timestamp": "2025-03-20T16:41:09Z"
  },
  {
    "title": "Amtrak CEO abruptly resigns from the nation’s passenger railroad",
    "description": "The resignation comes after billionaire Elon Musk floated the idea of privatizing Amtrak.",
    "link": "https://www.denverpost.com/2025/03/20/amtrak-ceo-resigns/",
    "timestamp": "2025-03-20T16:41:09Z"
  },
  {
    "title": "Trump Admin Working To Make Food Poisoning Great Again",
    "description": "The New York Times has a lengthy article reporting the many, many ways that DOGE cuts are threatening the safety of Americans’ food.\nIn the last few years, foodborne pathogens have had devastating consequences that alarmed the public. Bacteria in infant formu…",
    "link": "https://crooksandliars.com/2025/03/trump-admin-working-make-food-poisoning",
    "timestamp": "2025-03-20T16:41:07Z"
  },
  {
    "title": "Rescuing America’s Economy from Trump",
    "description": "Having witnessed Donald Trump's aggression toward Mexico and Canada despite their previous willingness to renegotiate the North American Free Trade Agreement, the rest of the world is now thinking about how to mitigate the risk from the United States. The US …",
    "link": "https://www.project-syndicate.org/commentary/trump-tariffs-threats-incentive-for-canada-mexico-and-everyone-else-to-break-free-by-j-bradford-delong-2025-03",
    "timestamp": "2025-03-20T16:40:57Z"
  },
  {
    "title": "Fact check: Do trans women have unfair athletic advantage?",
    "description": "Many sports federations now exclude transgender women from participating in female competitions. These steps are hotly debated in the sports world.",
    "link": "https://www.dw.com/en/do-trans-women-have-an-unfair-athletic-advantage/a-58583988",
    "timestamp": "2025-03-20T16:40:00Z"
  },
  {
    "title": "EU pushes back tariff response to Trump duties",
    "description": "The bloc postponed retaliatory tariffs on US goods for two weeks to allow more time for negotiations. US duties on EU steel and aluminum have already gone into effect. A second wave of US tariffs is also expected.",
    "link": "https://www.dw.com/en/eu-pushes-back-tariff-response-to-trump-duties/a-71988793",
    "timestamp": "2025-03-20T16:39:00Z"
  },
  {
    "title": "Trump Will Order Plan to Dismantle the Education Department, Advancing Campaign Promise",
    "description": "Trump has derided the Education Department as wasteful and polluted by liberal ideology.",
    "link": "https://time.com/7270216/trump-will-order-plan-to-dismantle-education-department/",
    "timestamp": "2025-03-20T16:38:57Z"
  },
  {
    "title": "Russia has ‘very valuable earth’ — Trump",
    "description": "US President Trump is advocating for restoring economic ties with Moscow following his latest call with Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614549-trump-russia-valuable-earth/",
    "timestamp": "2025-03-20T16:38:29Z"
  },
  {
    "title": "Trump pauses $175M for Penn over trans athlete",
    "description": "What happened\nThe White House said Wednesday that President Donald Trump was withholding $175 million in federal funds from the University of Pennsylvania over its decision to allow a transgender swimmer to compete at the school in 2021 and 2022.\nSeparately, …",
    "link": "https://biztoc.com/x/527f64c98a9e71b1",
    "timestamp": "2025-03-20T16:38:10Z"
  },
  {
    "title": "EU delays plans to retaliate against Trump tariffs",
    "description": "EU delays plans to retaliate against Trump tariffs\nThe European Union (EU) has delayed plans to hit back at US President Donald Trump's steel and aluminium tariffs until the middle of next month.\nThe trading bloc was set to impose duties on US products, inclu…",
    "link": "https://biztoc.com/x/1ef719daee2a2290",
    "timestamp": "2025-03-20T16:37:53Z"
  },
  {
    "title": "GOP Rep. Drowned Out by Boos After Defending Elon Musk in Town Hall",
    "description": "Republicans are learning fast that the Department of Government Efficiency’s federal cuts are not popular.\r\nRepresentative Harriet Hagemen was booed and chanted down by a crowd of her constituents during a Wyoming town hall Wednesday night as she attempted to…",
    "link": "https://newrepublic.com/post/192980/republican-representative-boos-town-hall-elon-musk",
    "timestamp": "2025-03-20T16:37:41Z"
  },
  {
    "title": "Russia and US to Discuss Black Sea Shipping on Monday",
    "description": "Russian and U.S. experts will discuss ways to ensure the safety of shipping in the Black Sea at talks on a possible Ukrainian peace settlement in Riyadh on Monday, the Kremlin said.",
    "link": "https://gcaptain.com/russia-and-us-to-discuss-black-sea-shipping-on-monday/",
    "timestamp": "2025-03-20T16:37:29Z"
  },
  {
    "title": "JFK Files Released: Why Now and Where You Can Find Them",
    "description": "The Trump administration has released the remaining handful of files from the government investigation into the assassination of John F. Kennedy.",
    "link": "https://www.cnet.com/news/politics/jfk-files-released-why-now-and-where-you-can-find-them/",
    "timestamp": "2025-03-20T16:36:23Z"
  },
  {
    "title": "Italy Says Baku Steel Submits 'Best Offer' For Ex-Ilva Plant",
    "description": "A year after ousting ArcelorMittal, Italy is preparing to hand over control of its giant ex-Ilva steelworks to Azerbaijan's Baku Steel, the industry minister said Thursday.",
    "link": "https://www.ibtimes.com/italy-says-baku-steel-submits-best-offer-ex-ilva-plant-3767100",
    "timestamp": "2025-03-20T16:36:12Z"
  },
  {
    "title": "'Stunning': Dem senator accuses Trump of 'coordinated legal assault on political dissent'",
    "description": "Sen. Chris Murphy (D-CT) on Thursday outlined what he described as a \"coordinated, relentless legal assault on political dissent\" by President Donald Trump and his allies.Writing on BlueSky, Murphy made the case that the Trump administration is trying to make…",
    "link": "https://www.rawstory.com/chris-murphy-2671371451/",
    "timestamp": "2025-03-20T16:35:15Z"
  },
  {
    "title": "Man Doesn’t Regret Trump Vote After Wife Is Arrested",
    "description": "\"A man who voted for President Donald Trump says he does not regret his decision, even after federal immigration authorities arrested his wife as the couple returned home from their honeymoon,\" the Newsweek reports. \"Bradley",
    "link": "https://politicalwire.com/2025/03/20/man-doesnt-regret-trump-vote-after-wife-is-arrested/",
    "timestamp": "2025-03-20T16:33:21Z"
  },
  {
    "title": "White House Faces Opposition to Efforts to Reduce CDFI Fund",
    "description": "White House efforts to cut spending on a low-income lending program, the Community Development Financial Institutions Fund (CDFI Fund), are reportedly encountering opposition. Bankers, industry executives, lawmakers and Treasury Secretary Scott Bessent have e…",
    "link": "https://www.pymnts.com/politics/2025/white-house-faces-opposition-to-efforts-to-reduce-cdfi-fund/",
    "timestamp": "2025-03-20T16:31:47Z"
  },
  {
    "title": "Lia Thomas’ former UPenn teammates react to $175M federal funding pause: ‘Cost to openly harming female students’",
    "description": "President Trump's administration has ramped up its crackdown on trans athlete inclusion in women's sports, and many women impacted by the issue are speaking out in support.",
    "link": "https://nypost.com/2025/03/20/us-news/lia-thomas-former-teammates-react-to-upenn-federal-funding-pause/",
    "timestamp": "2025-03-20T16:31:11Z"
  },
  {
    "title": "Brett Favre asks for help to find out what really happened in the assassination of John F. Kennedy after his interested reaction",
    "description": "The decision by President of the United States Donald Trump to release the remaining files on the assassination of John F. Kennedy has gotten plenty of people talking on social med",
    "link": "https://www.marca.com/en/nfl/2025/03/20/67dc23b922601d61488b456c.html",
    "timestamp": "2025-03-20T16:30:46Z"
  },
  {
    "title": "Trump stunned by son Barron’s ability to turn on laptop, netizens ask 'this guy is leading our country?'",
    "description": "US President Donald Trump has heaped praise on his teenage son Barron Trump for one skill in particular that the young man possesses, particularly when it comes to computers. On Barron's birthday, Trump appreciated his son's academic abilities and called him …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-birthday-donald-trump-stunned-by-son-barrons-ability-to-turn-on-laptop-netizens-ask-this-guy-is-leading-our-country/articleshow/119265675.cms",
    "timestamp": "2025-03-20T16:30:40Z"
  },
  {
    "title": "Tesla vandals are terrorists, according to President Trump",
    "description": "President Donald Trump’s administration is trying to expand the definition of domestic terrorism as it aims to crack down on a wave of attacks in which Teslas have been shot and set on fire, apparently to protest CEO Elon Musk’s powerful but murky role in cut…",
    "link": "https://freerepublic.com/focus/f-news/4305608/posts",
    "timestamp": "2025-03-20T16:29:26Z"
  },
  {
    "title": "Step Aside, Schumer. The Nation Can’t Survive With You In Charge.",
    "description": "Dear Senator Schumer: There is no question that you are a dedicated public servant. You believe in our democracy. You believe in the norms that maintain it. You believe in its mission of bringing us together to promote the general welfare. There are many, man…",
    "link": "https://www.techdirt.com/2025/03/20/step-aside-schumer-the-nation-cant-survive-with-you-in-charge/",
    "timestamp": "2025-03-20T16:29:03Z"
  },
  {
    "title": "Trump Will Reportedly Sign Executive Order To Shut Down Department Of Education",
    "description": "Congress would need to act to fully eliminate the critical agency, but Trump could stop many of its key functions.",
    "link": "https://www.huffpost.com/entry/trump-executive-order-abolish-department-education_n_67c9d920e4b07a45b4c34f7c",
    "timestamp": "2025-03-20T16:29:03Z"
  },
  {
    "title": "Trump pauses $175M for Penn over trans athlete",
    "description": "The president is withholding federal funds from the University of Pennsylvania because it once allowed a transgender swimmer to compete",
    "link": "https://theweek.com/politics/university-pennsylvania-federal-funding-freeze-trans-athletes",
    "timestamp": "2025-03-20T16:28:58Z"
  },
  {
    "title": "School choice activists warn parents about blue state's homeschool bill with jail-time provision",
    "description": "A bill in the Illinois legislature proposing new regulations on homeschooling and punishable by misdemeanor jail time, is sparking concern over parental rights and school choice.",
    "link": "https://www.foxnews.com/politics/school-choice-activists-warn-parents-about-blue-states-homeschool-bill-jail-time-provision",
    "timestamp": "2025-03-20T16:28:18Z"
  },
  {
    "title": "Accenture becomes first IT services company to call out macro uncertainty",
    "description": "Accenture’s dim outlook stokes further uncertainty for India’s five largest software service providers including Tata Consultancy Services, Infosys, HCL Technologies, Wipro, and Tech Mahindra, which are expected to announce their FY25 earnings next month",
    "link": "https://www.livemint.com/companies/accenture-q1-results-it-services-company-it-results-fy25-earnings-tcs-infosys-hcl-technologies-tech-mahindra-11742481767578.html",
    "timestamp": "2025-03-20T16:26:56Z"
  },
  {
    "title": "Zelenskiy Says Putin Is 'Always Unhappy'",
    "description": "President Donald Trump has suggested to Ukrainian President Volodymyr Zelenskyy that the U.S. should take ownership of Ukrainian power plants to ensure the critical facilities' security.\nAccording to a White House statement, Trump told Zelenskyy during a call…",
    "link": "https://biztoc.com/x/19a6485d0f68f4f4",
    "timestamp": "2025-03-20T16:26:12Z"
  },
  {
    "title": "'We have a lot of work to do': No huge revelations so far as historians pore over JFK files",
    "description": "More than 1,100 files have been released, it will take some time to go through all the documents.",
    "link": "https://www.thejournal.ie/pages-jfk-documents-6654562-Mar2025/",
    "timestamp": "2025-03-20T16:26:03Z"
  },
  {
    "title": "China Is No Climate Savior",
    "description": "The numbers don’t lie: Beijing will not drive a global energy transition.",
    "link": "http://foreignpolicy.com/2025/03/20/china-climate-emissions-renewable-energy-solar-coal-trump/",
    "timestamp": "2025-03-20T16:25:19Z"
  },
  {
    "title": "Houthis show they are not yet defeated by US airstrikes",
    "description": "The attack on Israel is an attempt by the group to show that they can continue to target Israel, even under the watchful eyes of the US.",
    "link": "https://www.jpost.com/middle-east/article-846922",
    "timestamp": "2025-03-20T16:24:36Z"
  },
  {
    "title": "'My plan is to blow the whistle': Fired FTC official puts Trump on notice",
    "description": "Appearing on MSNBC on Thursday afternoon, former Federal Trade Commissioner Alvaro Bedoya lashed out at Donald Trump for purportedly illegally firing him and noted he would be going on the road to tell people about the corruption he sees occurring within the …",
    "link": "https://www.rawstory.com/trump-bedoya/",
    "timestamp": "2025-03-20T16:24:14Z"
  },
  {
    "title": "Ben Shapiro Mocks Conspiracists Combing JFK Files For ‘Smoking Gun’: ‘Spoiler Alert – It Was Lee Harvey Oswald!’",
    "description": "Ben Shapiro wasted no time bluntly dismantling the latest wave of conspiracy speculation following the Trump administration’s full release of classified government files on the 1963 assassination of President John F. Kennedy. On Wednesday’s edition of The Ben…",
    "link": "https://www.mediaite.com/tv/ben-shapiro-mocks-conspiracists-combing-jfk-files-for-smoking-gun-spoiler-alert-it-was-lee-harvey-oswald/",
    "timestamp": "2025-03-20T16:23:56Z"
  },
  {
    "title": "GOP lawmaker booed at town hall for saying crowd is 'obsessed; with the government",
    "description": "LARAMIE, Wyo. — Republican Rep. Harriet Hageman faced a torrent of heckles and boos during a town hall in deep red Wyoming as she repeatedly tried to downplay constituents' concerns about the Trump administration's actions.",
    "link": "https://www.nbcnews.com/politics/congress/republican-lawmaker-booed-rowdy-town-hall-complaining-crowd-obsessed-g-rcna197278",
    "timestamp": "2025-03-20T16:23:51Z"
  },
  {
    "title": "Bizarre Tesla stock endorsement by Donald Trump’s commerce secretary Howard Lutnick; instead, shares plummet even further",
    "description": "Howard Lutnick, the Secretary of Commerce, publicly endorsed Tesla stock on Fox News despite Tesla's recent stock decline. He praised Elon Musk as the best technologist and entrepreneur. Lutnick's endorsement comes amid controversy over Musk's involvement in …",
    "link": "https://economictimes.indiatimes.com/news/international/us/bizarre-tesla-stock-endorsement-by-donald-trumps-commerce-secretary-howard-lutnick-instead-shares-plummet-even-further/articleshow/119264776.cms",
    "timestamp": "2025-03-20T16:23:41Z"
  },
  {
    "title": "Retirees Furious Over Social Security In-Person ID Checks",
    "description": "The Social Security Administration's plan to require in-person identity checks for millions of new and existing recipients while simultaneously closing government offices has sparked a furor among lawmakers, advocacy groups and program recipients who are worr…",
    "link": "https://freerepublic.com/focus/f-news/4305606/posts",
    "timestamp": "2025-03-20T16:21:42Z"
  },
  {
    "title": "Newsletter:   Fake $100 tip is a Trump ad",
    "description": "<!-- /wp:separator -->\n\r\n\nInternet culture is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s web_crawlr newsletter here. You’ll get the best (and worst) of the internet straight into your inbox.\r\n\n\r\n\n\r\n\n\r\n\n\n\nHello fell…",
    "link": "https://www.dailydot.com/newsletters/daily-dot-newsletter-web-crawlr-03-20-202/",
    "timestamp": "2025-03-20T16:21:04Z"
  },
  {
    "title": "Elon Musk’s Estranged Daughter On His Salute: ‘We're Going To Call A Fig A Fig’",
    "description": "Vivian Wilson, who came out as trans when she was a teenager, called out Musk's “Nazi salute s**t” at Donald Trump's inauguration event.",
    "link": "https://www.huffpost.com/entry/elon-musks-estranged-daughter-on-his-nazi-salute-were-going-to-call-a-fig-a-fig_n_67dc2776e4b034ade1e803b8",
    "timestamp": "2025-03-20T16:20:42Z"
  },
  {
    "title": "Trump 'fully supports' Israeli actions in Gaza: White House",
    "description": "US President Donald Trump fully supports Israel's air and ground operations in Gaza, attributing the resurgence of violence to Hamas. White House Press Secretary Karoline Leavitt emphasized that Hamas is at fault for their October 2023 attack on Israel and ur…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-fully-supports-israeli-actions-in-gaza-white-house/articleshow/119265570.cms",
    "timestamp": "2025-03-20T16:19:22Z"
  },
  {
    "title": "Dem senator on Schumer future: 'Important' to know 'when it's time to go'",
    "description": "A Democratic senator appeared less than confident in Leader Schumer during a town hall, remarking on the importance of knowing when to step back.",
    "link": "https://www.foxnews.com/politics/dem-senator-schumer-future-important-know-when-its-time-go",
    "timestamp": "2025-03-20T16:18:14Z"
  },
  {
    "title": "'Mark on His Head' — Tommy Robinson's Isolation in Prison Is 'Destroying' His Mental Health.",
    "description": "Citizen journalist and anti-grooming gangs activist Tommy Robinson, serving a draconian 18-month sentence for contempt of court due to breaching a prior",
    "link": "https://thenationalpulse.com/2025/03/20/mark-on-his-head-tommy-robinsons-isolation-in-prison-is-destroying-his-mental-health/",
    "timestamp": "2025-03-20T16:18:02Z"
  },
  {
    "title": "Trump administration removes ban on ‘segregated facilities’ such as waiting rooms and restaurants",
    "description": "Donald Trump’s administration has revoked a ban preventing federal contracts being awarded to companies who practice segregation, a move that has been condemned for “undoing decades of federal anti-discrimination policy”. The directive, issued by the US Gener…",
    "link": "https://www.thepinknews.com/2025/03/20/donald-trump-segregation/",
    "timestamp": "2025-03-20T16:17:49Z"
  },
  {
    "title": "Donald Trump Names The 'Only Thing' He Admired About Joe Biden",
    "description": "The president said it was a \"wonderful\" thing about his predecessor.",
    "link": "https://www.huffpost.com/entry/donald-trump-only-thing-i-admired-joe-biden-sleep-beach_n_67dc1cbbe4b0cc14ca4299ab",
    "timestamp": "2025-03-20T16:17:44Z"
  },
  {
    "title": "Spy Chief's Visit to Trump Shows Middle East Ally's Growing Power",
    "description": "The UAE is an ally in curbing Iran's influence, improving Arab relations with Israel and advancing technological cooperation",
    "link": "https://www.newsweek.com/uae-trump-iran-israel-saudi-arab-2047937",
    "timestamp": "2025-03-20T16:17:31Z"
  },
  {
    "title": "France Cancels Order For Modern 'Beauty And The Beast' For Schoolchildren",
    "description": "France&#039;s education ministry has cancelled an order for &quot;Beauty and the Beast&quot; with modern illustrations, saying a cartoonist&#039;s 21st-century version including a police sniffer dog and smartphones was inappropriate for tweens.",
    "link": "https://www.ndtv.com/world-news/france-cancels-order-for-modern-beauty-and-the-beast-for-schoolchildren-7970659",
    "timestamp": "2025-03-20T16:17:11Z"
  },
  {
    "title": "Gentlemen, You Can't Do An Armed Invasion Here! This Is The US Institute Of Peace!",
    "description": "It's a nonprofit, not an executive branch anything! All the more reason for Trump to want it gone.",
    "link": "https://www.wonkette.com/p/gentlemen-you-cant-do-an-armed-invasion",
    "timestamp": "2025-03-20T16:15:44Z"
  },
  {
    "title": "Trump Sends Rare Goodwill Message at Iranian New Year",
    "description": "President Donald Trump has marked Nowruz, the Persian New Year, with a message of goodwill, acknowledging the occasion's deep cultural significance while tensions between Washington and Tehran remain high.\nHis statement, released by the White House, celebrate…",
    "link": "https://biztoc.com/x/30d7fbc51288d5dd",
    "timestamp": "2025-03-20T16:15:37Z"
  },
  {
    "title": "Amtrak CEO abruptly resigns from the nation's passenger railroad",
    "description": "Amtrak CEO Stephen Gardner abruptly resigned from his top post at the U.S. passenger railroad this week.",
    "link": "https://www.news4jax.com/business/2025/03/20/amtrak-ceo-abruptly-resigns-from-the-nations-passenger-railroad/",
    "timestamp": "2025-03-20T16:15:31Z"
  },
  {
    "title": "Donald Trump to Have Highway Named After Him Under Republican Bill",
    "description": "A Texas House Republican has introduced a bill to the state legislature that would rename the section of Interstate 35 that goes through Travis County as the \"President Donald J. Trump Highway.\"\nThe legislation was introduced by state Representative Joanne Sh…",
    "link": "https://biztoc.com/x/a440e84e9a850937",
    "timestamp": "2025-03-20T16:15:15Z"
  },
  {
    "title": "WH: Trump 'fully supports' Israel's actions in Gaza",
    "description": "United States President Donald Trump supports all of Israel's recent actions in the Gaza Strip after resuming the fighting against Hamas, White House Press Secretary Karoline Leavitt told reporters on...",
    "link": "https://biztoc.com/x/9891723a57599da4",
    "timestamp": "2025-03-20T16:15:15Z"
  },
  {
    "title": "WH may reverse decision to kill Biden-Maduro oil deal, apply tariffs instead to avoid hurting US firms",
    "description": "FIRST ON FOX: President Donald Trump has signaled an openness to holding off on killing an oil deal forged between former President Joe Biden and Venezuelan dictator Nicolás Maduro, after he previously ordered Chevron and other U.S. firms to close up shop in …",
    "link": "https://biztoc.com/x/52efb719d555658b",
    "timestamp": "2025-03-20T16:15:04Z"
  },
  {
    "title": "Democrats Finally Have a Plan to Fight Back",
    "description": "Republicans in Congress are refusing to hold town halls in their districts out of fear of criticism, and now Democrats are swooping in.\r\nIn Wisconsin, Representative Derrick Van Orden didn’t show up at a town hall meeting Tuesday in his district in Viroqua, s…",
    "link": "https://newrepublic.com/post/192978/democrats-finally-plan-fight-back",
    "timestamp": "2025-03-20T16:14:49Z"
  },
  {
    "title": "CK Hutchison Flags Political Risk as Port Deal Upsets China",
    "description": "CK Hutchison Holdings Ltd. warned of a deteriorating global business environment due to geopolitical and trade tensions, as the Hong Kong conglomerate reported weaker-than-expected profit while a ports sale plan faces uncertainty after infuriating Beijing.",
    "link": "https://gcaptain.com/ck-hutchison-flags-political-risk-as-port-deal-upsets-china/",
    "timestamp": "2025-03-20T16:13:36Z"
  },
  {
    "title": "The Mar-a-Lago Accord",
    "description": "Adam Tooze has a very good article today on the Mar-a-Lago Accord. What is the Mar-a-Lago accord, you may ask. Here’s how Torsten Slock characterizes it, from Tooze’s article. According to Gillian Tett in an interview with Ezra Klein, it’s not really a thing,…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/the-mar-a-lago-accord",
    "timestamp": "2025-03-20T16:13:04Z"
  },
  {
    "title": "US Citizen George Glezmann Released From Detention In Afghanistan",
    "description": "Taliban authorities on Thursday freed US citizen George Glezmann after more than two years of detention, in a deal brokered by Qatar, US Secretary of State Marco Rubio announced.",
    "link": "https://www.ibtimes.com/us-citizen-george-glezmann-released-detention-afghanistan-3767097",
    "timestamp": "2025-03-20T16:12:17Z"
  },
  {
    "title": "Kirsty Coventry elected first woman president of Olympic movement",
    "description": "Kirsty Coventry, a two-time Olympic swimming champion from Zimbabwe, has been elected as the president of the International Olympic Committee, becoming the first woman and African to hold this position. She succeeds Thomas Bach and was chosen over competitors…",
    "link": "https://economictimes.indiatimes.com/news/sports/kirsty-coventry-elected-first-woman-president-of-olympic-movement/articleshow/119265368.cms",
    "timestamp": "2025-03-20T16:12:15Z"
  },
  {
    "title": "Student Loan Recertification Extensions Announced For Borrowers",
    "description": "New guidance for student loan borrowers on IBR, ICR, and PAYE for when income and family size recertification will be required.",
    "link": "https://www.forbes.com/sites/robertfarrington/2025/03/20/student-loan-recertification-extensions-announced-for-borrowers/",
    "timestamp": "2025-03-20T16:11:41Z"
  },
  {
    "title": "Donald Trump to Have Highway Named After Him Under Republican Bill",
    "description": "Republican lawmakers have introduced bills in several states to rename buildings and infrastructure after President Donald Trump.",
    "link": "https://www.newsweek.com/donald-trump-have-highway-named-after-him-under-republican-bill-2047854",
    "timestamp": "2025-03-20T16:10:53Z"
  },
  {
    "title": "EU delays plans to retaliate against Trump tariffs",
    "description": "Its tit-for-tat tariffs had prompted Trump to threaten a 200% tariff on European alcohol and wine.",
    "link": "https://www.bbc.com/news/articles/c62z157jvd8o",
    "timestamp": "2025-03-20T16:10:19Z"
  },
  {
    "title": "Trump Sends Rare Goodwill Message at Iranian New Year",
    "description": "The festival of Nowruz, the Persian New Year, is Iran's most important holiday and celebrated in more ten other countries in the region.",
    "link": "https://www.newsweek.com/trump-sends-nowruz-greetings-iran-nuclear-2047908",
    "timestamp": "2025-03-20T16:09:57Z"
  },
  {
    "title": "'Hard, red line': GOP chairs deliver warning shot to Trump",
    "description": "The United States, for more than 70 years, has played a key role in the North Atlantic Treaty Organization (NATO) — with four-star U.S. generals being chosen to oversee NATO's U.S. operations in Europe. But NBC News reported this week that the second Trump Ad…",
    "link": "https://www.rawstory.com/hard-red-line-gop-chairs-deliver-warning-shot-to-trump/",
    "timestamp": "2025-03-20T16:09:56Z"
  },
  {
    "title": "Kirsty Coventry Elected IOC President, Becoming First Woman, First African to Lead Global Olympic Body",
    "description": "She has become the first woman and first African to get perhaps the biggest job in global sports.",
    "link": "https://time.com/7270196/kirsty-coventry-elected-ioc-president/",
    "timestamp": "2025-03-20T16:09:45Z"
  },
  {
    "title": "Donald Trump's Reason For Wanting To Pave The Rose Garden Is Going Viral",
    "description": "\"The women with the high heels. It's just too much.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/heres-why-donald-trump-is-going-to-pave-the-white-house",
    "timestamp": "2025-03-20T16:07:26Z"
  },
  {
    "title": "Police Arrest Suspect in Viral Video of Tesla Vandalism",
    "description": "San Jose police have arrested a man suspected of keying a white Tesla vehicle in a Costco parking lot, an incident that was captured on video and went viral on the internet. The alleged vandal has been charged with a felony over the incident which was capture…",
    "link": "https://www.breitbart.com/tech/2025/03/20/police-arrest-suspect-in-viral-video-of-tesla-vandalism/",
    "timestamp": "2025-03-20T16:06:59Z"
  },
  {
    "title": "Trump sets Iran deal deadline – media",
    "description": "Washington could resort to other options if its demands on Iran are not met, the US deputy national security adviser has told news outlets Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614546-trump-set-iran-deal-deadline/",
    "timestamp": "2025-03-20T16:06:51Z"
  },
  {
    "title": "Seeking To Bypass Congress, Donald To Sign EO To Eliminate Dept Of Education",
    "description": "Donald is expected to sign an executive order today to shutter the Education Department. Imagine hiring an Education Secretary like Linda McMahon to close the Education Department. Seems weird to me!\nUSA Today reports:\nTrump is expected to sign the order, whi…",
    "link": "https://crooksandliars.com/2025/03/donald-seeking-bypass-congress-will-sign",
    "timestamp": "2025-03-20T16:06:50Z"
  },
  {
    "title": "Coventry the first woman elected as IOC pres.",
    "description": "Kirsty Coventry has been elected president of the International Olympic Committee, becoming the first woman and first African to hold the post.",
    "link": "https://www.espn.com/olympics/story/_/id/44329660/kirsty-coventry-becomes-first-woman-elected-ioc-president",
    "timestamp": "2025-03-20T16:06:19Z"
  },
  {
    "title": "Kirsty Coventry Elected First Woman President Of Olympic Movement",
    "description": "Zimbabwean Kirsty Coventry became the first woman and African to be elected president of the International Olympic Committee on Thursday, declaring it to be an \"extraordinary moment\".",
    "link": "https://www.ibtimes.com/kirsty-coventry-elected-first-woman-president-olympic-movement-3767096",
    "timestamp": "2025-03-20T16:06:16Z"
  },
  {
    "title": "Moody's Chief Economist Says It 'Feels Like We're Being Pushed Into Recession'",
    "description": "\"The recession risks are uncomfortably high and they're rising,\" Mark Zandi said.",
    "link": "https://www.newsweek.com/moodys-economist-trump-pushing-us-recession-global-trump-tariffs-fed-2047883",
    "timestamp": "2025-03-20T16:06:06Z"
  },
  {
    "title": "Florida Dems stage town halls in GOP districts featuring 'missing' posters of their colleagues",
    "description": "Florida Democrats launched statewide town halls this weekend as part of a coordinated effort by the Democratic Party to host \"People's Town Halls\" in all 50 states.",
    "link": "https://www.foxnews.com/politics/florida-dems-stage-town-halls-gop-districts-missing-posters-colleagues",
    "timestamp": "2025-03-20T16:06:04Z"
  },
  {
    "title": "You're 'Going to Have a Heart Attack,' Lawmaker Tells Crowd",
    "description": "Town hall meetings have been getting raucous lately , and one in Wyoming on Wednesday night may have been the rowdiest yet. Attendees let GOP Rep. Harriet Hageman have it via shouts, profanities, and rounds of loud booing, but she let them have it right back.…",
    "link": "https://www.newser.com/story/365976/youre-going-to-have-a-heart-attack-lawmaker-tells-crowd.html",
    "timestamp": "2025-03-20T16:05:00Z"
  },
  {
    "title": "EXCLUSIVE: Trump's Blistering Attack on Rupert Murdoch Revealed — With The Don Branding Media Mogul a 'Piece of S---' and 'Cold'",
    "description": "Donald Trump and Rupert Murdoch's relationship has gone downhill since the night of the 2020 election – and Isenstadt's new book delves into their fiery feud.",
    "link": "https://radaronline.com/p/donald-trump-slams-rupert-murdoch-liberal-son-new-book/",
    "timestamp": "2025-03-20T16:04:25Z"
  },
  {
    "title": "SCOOP: Bill preventing activist judges from blocking Trump's agenda backed by White House",
    "description": "Fox News Digital heard from two sources who said President Donald Trump backs a bill by Rep. Darrell Issa to block lower level federal judges from nationwide injunctions.",
    "link": "https://www.foxnews.com/politics/scoop-bill-preventing-activist-judges-from-blocking-trumps-agenda-backed-white-house",
    "timestamp": "2025-03-20T16:04:04Z"
  },
  {
    "title": "Trump promises US will ‘dominate crypto’",
    "description": "Trump promises US will ‘dominate crypto’\nThe first sitting president to address a crypto conference says the US is positioned to “dominate crypto and the next generation of financial technologies”\nAttendees at Blockworks’ Digital Asset Summit looked on as Don…",
    "link": "https://biztoc.com/x/0b1afaba9d01e2a4",
    "timestamp": "2025-03-20T16:03:47Z"
  },
  {
    "title": "Hamas fires at Tel Aviv in first riposte to deadly Israel assault",
    "description": "Hamas said it fired rockets at Israeli commercial hub Tel Aviv on Thursday in its first military response to the growing civilian death toll from Israel’s resumption of air and ground operations in Gaza. Israel said it had closed off the territory’s main nort…",
    "link": "https://www.digitaljournal.com/world/hamas-fires-at-tel-aviv-in-first-riposte-to-deadly-israel-assault-2/article",
    "timestamp": "2025-03-20T16:03:27Z"
  }
]