[
  {
    "title": "James Carden on Generalissimo Kagan",
    "description": "Reprinted with permission from The Realist Review. That Robert Kagan is among the most consistent – and consistently wrong – foreign policy analysts in Washington will not come as news. That he continues to command so much attention twenty-odd years since the…",
    "link": "https://www.antiwar.com/blog/2025/05/07/james-carden-on-generalissimo-kagan/",
    "timestamp": "2025-05-07T21:50:15Z"
  },
  {
    "title": "Trump poised to declare war on powerful industry — and set up 'major confrontation'",
    "description": "President Donald Trump is preparing to go to war with the pharmaceutical industry as the White House plans to unveil a sweeping plan to slash Medicare drug prices by linking them to lower costs abroad, according to a new report in Politico.Trump is expected t…",
    "link": "https://www.rawstory.com/trump-big-pharma/",
    "timestamp": "2025-05-07T21:49:15Z"
  },
  {
    "title": "Tufts student challenging immigration detention must be sent to Vermont, court rules",
    "description": "A federal appeals court has ordered President Donald Trump's administration to transfer a Turkish student at Tufts University to Vermont for a bail hearing from Louisiana, where she is being detained by immigration authorities after engaging in pro-Palestinia…",
    "link": "https://japantoday.com/category/world/tufts-student-challenging-immigration-detention-must-be-sent-to-vermont-court-rules4",
    "timestamp": "2025-05-07T21:48:54Z"
  },
  {
    "title": "Vance says Russia was 'asking for too much' in its initial Ukraine peace offer",
    "description": "U.S. Vice President JD Vance said Wednesday that Russia was “asking for too much” in its initial peace offer as the United States looks to bring about an end to the war in Ukraine. The vice president, speaking at a Washington meeting hosted by the Munich Secu…",
    "link": "https://japantoday.com/category/world/vance-says-russia-was-%27asking-for-too-much%27-in-its-initial-ukraine-peace-offer",
    "timestamp": "2025-05-07T21:48:27Z"
  },
  {
    "title": "Merz hails reset in ties with neighbors on first trip as German chancellor",
    "description": "Germany's new chancellor Friedrich Merz signaled a new start in relations with European partners France and Poland, but there were signs of tough discussions ahead on thorny issues like illegal migration and defense financing. Wednesday's trip came a day afte…",
    "link": "https://japantoday.com/category/world/merz-hails-reset-in-ties-with-neighbours-on-first-trip-as-german-chancellor",
    "timestamp": "2025-05-07T21:48:16Z"
  },
  {
    "title": "U.S.-Houthi ceasefire deal does not include Israel, says Houthi spokesperson",
    "description": "A ceasefire deal between Yemen's Houthis and the U.S. does not include sparing Israel, the group said on Wednesday, suggesting its shipping attacks that have disrupted global trade and challenged world powers will not come to a complete halt. President Donald…",
    "link": "https://japantoday.com/category/world/us-houthi-ceasefire-deal-does-not-include-israel-says-houthi-spokesperson2",
    "timestamp": "2025-05-07T21:48:09Z"
  },
  {
    "title": "Pakistan vows retaliation after Indian strike over tourist deaths",
    "description": "India hit Pakistan and Pakistani Kashmir with missiles on Wednesday and Pakistan vowed to retaliate saying it shot down five Indian aircraft, in the worst clash in more than two decades between the nuclear-armed neighbors. India told more than a dozen foreign…",
    "link": "https://japantoday.com/category/world/pakistan-vows-retaliation-after-indian-strike-over-tourist-deaths",
    "timestamp": "2025-05-07T21:47:53Z"
  },
  {
    "title": "China's Xi arrives in Moscow in show of support for Putin",
    "description": "Chinese President Xi Jinping flew into Moscow on Wednesday for talks with President Vladimir Putin and a pomp-filled visit that Kyiv has made clear it opposes after Ukrainian drones targeted Moscow shortly before he touched down. Xi, whose country buys more R…",
    "link": "https://japantoday.com/category/world/china%27s-xi-arrives-in-moscow-in-show-of-support-for-putin-after-ukrainian-drones-target-capital",
    "timestamp": "2025-05-07T21:47:46Z"
  },
  {
    "title": "Pete Buttigieg Assures Jen Psaki That Trump ‘Can, In Fact, Be Stopped’ From Breaking the Law | Video",
    "description": "The former transportation secretary cites recent legal victories against the president's sweeping agenda\nThe post Pete Buttigieg Assures Jen Psaki That Trump ‘Can, In Fact, Be Stopped’ From Breaking the Law | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/pete-buttigieg-trump-legal-victories-jen-psaki-msnbc/",
    "timestamp": "2025-05-07T21:46:43Z"
  },
  {
    "title": "Chris Cuomo Tears Into 'Coward' Republican After Bailing Minutes Before Live Interview: 'What a Punk A-- Move'",
    "description": "Chris Cuomo railed against Sen. John Kennedy for abruptly bailing on a scheduled live interview, accusing him of being too afraid to face tough questions.",
    "link": "https://www.ibtimes.com/chris-cuomo-tears-coward-republican-after-bailing-minutes-before-live-interview-what-punk-3772857",
    "timestamp": "2025-05-07T21:46:07Z"
  },
  {
    "title": "White House pulls nomination for surgeon general a day before Senate confirmation hearing",
    "description": "President Donald Trump announced Wednesday that Dr. Casey Means will replace Dr. Janette Nesheiwat as his nominee for U.S. Surgeon General.",
    "link": "https://biztoc.com/x/ad57d1e8c8e4e53f",
    "timestamp": "2025-05-07T21:45:40Z"
  },
  {
    "title": "Trump announces Surgeon General nominee",
    "description": "United States President Donald Trump nominated Dr. Casey Means for the position of US Surgeon General.In a post on Truth Social, Trump praised Means' career and academic achievements as well as her \"i...",
    "link": "https://biztoc.com/x/48f6fef9a144d9b9",
    "timestamp": "2025-05-07T21:45:38Z"
  },
  {
    "title": "More than 90 killed in Gaza strikes including journalist who just became dad",
    "description": "Journalist Yahya Sobeih had just posted a photo of his newborn daughter when he was killed by Israeli strikes on a crowded market.",
    "link": "https://www.abc.net.au/news/2025-05-08/at-least-92-killed-in-gaza-city-strikes/105266612",
    "timestamp": "2025-05-07T21:45:37Z"
  },
  {
    "title": "New report shows chilling effect of Trump's targeting of big law firms",
    "description": "President Donald Trump speaks during an executive order signing ceremony in the Oval Office of the White House on March 6, 2025.",
    "link": "https://biztoc.com/x/59488dfa6e7e14db",
    "timestamp": "2025-05-07T21:45:27Z"
  },
  {
    "title": "New report shows chilling effect of Trump's targeting of big law firms",
    "description": "President Donald Trump speaks during an executive order signing ceremony in the Oval Office of the White House on March 6, 2025.",
    "link": "https://biztoc.com/x/59488dfa6e7e14db",
    "timestamp": "2025-05-07T21:45:27Z"
  },
  {
    "title": "India will 'pay the price' for 'blatant mistake' says Pakistan PM",
    "description": "Pakistan's prime minister has pledged to retaliate after India's deadly missile strike, saying the country will \"now have to pay the price\" for their \"blatant mistake\".",
    "link": "https://news.sky.com/story/india-will-pay-the-price-for-blatant-mistake-says-pakistan-pm-13363609",
    "timestamp": "2025-05-07T21:45:00Z"
  },
  {
    "title": "Pakistan warns will 'avenge' deaths from Indian strikes",
    "description": "MUZAFFARABAD (PAKISTAN) - Pakistan has warned it will \"avenge\" those killed by Indian air strikes that New Delhi said were in response to an attack in Kashmir, signalling an imminent escalation in the worst violence in decades between the nuclear-armed neighb…",
    "link": "https://www.bangkokpost.com/world/3020521/pakistan-warns-will-avenge-deaths-from-indian-strikes",
    "timestamp": "2025-05-07T21:45:00Z"
  },
  {
    "title": "China’s Xi Jinping Travels to Russia for Victory Day",
    "description": "With 29 foreign leaders in attendance, Moscow is hoping to demonstrate that Western isolation efforts have largely failed.",
    "link": "http://foreignpolicy.com/2025/05/07/china-xi-moscow-putin-victory-day-ukraine-drones-india-pakistan-strikes-kashmir/",
    "timestamp": "2025-05-07T21:43:10Z"
  },
  {
    "title": "Trump’s tariffs put the Fed in a tough spot on interest rates and inflation",
    "description": "The Federal Reserve is holding interest rates steady as it navigates uncertainty kicked up by a president who keeps pressuring the central bank to lower them.",
    "link": "https://www.nbcnews.com/business/economy/trumps-tariffs-put-fed-tough-spot-interest-rates-inflation-rcna205469",
    "timestamp": "2025-05-07T21:43:00Z"
  },
  {
    "title": "'50 times worse!' Economist sounds alarm over Trump 2.0 as 'everything we buy is at risk'",
    "description": "University of Michigan Economics Professor Justin Wolfers warned that things are going to be a lot worse than Americans understand as a result of President Donald Trump's tariffs. Speaking to MSNBC's Nicolle Wallace on Wednesday, Wolfers said the best thing t…",
    "link": "https://www.rawstory.com/trump-tariffs-2671913084/",
    "timestamp": "2025-05-07T21:42:39Z"
  },
  {
    "title": "What does Trump mean by ‘total dismantling’ of Iran’s nuclear program?",
    "description": "Trump has returned to office with a clear message: Iran will never possess nuclear weapons. But clarity on what that entails—and how to achieve it—is still lacking.",
    "link": "https://www.jpost.com/opinion/article-853100",
    "timestamp": "2025-05-07T21:41:22Z"
  },
  {
    "title": "Who is Casey Means? Trump Nominates Wellness Influencer as Surgeon General",
    "description": "The move to nominate Means comes as Trump withdrew Dr. Janette Nesheiwat's nomination amid growing scrutiny.",
    "link": "https://www.newsweek.com/who-casey-means-trump-nominates-wellness-influencer-surgeon-general-2069344",
    "timestamp": "2025-05-07T21:41:18Z"
  },
  {
    "title": "Trump's White House creates own media universe",
    "description": "From influencer-only briefings to memes of Donald Trump as the pope and a &quot;Star Wars&quot; Jedi master, the White House is creating its own alternate media reality. Since Trump's return to the U.S. presidency in January, his team has given right-wing &qu…",
    "link": "https://japantoday.com/category/features/opinions/trump%27s-white-house-creates-own-media-universe",
    "timestamp": "2025-05-07T21:39:18Z"
  },
  {
    "title": "LNG Industry Warns U.S.-Built Ship Mandate Could Derail Energy Exports",
    "description": "U.S. energy groups are asking President Donald Trump's administration to exempt liquefied natural gas tankers from a new rule that will require producers to move an increasing percentage of their exports on U.S.-built vessels as part of a broader push to revi…",
    "link": "https://gcaptain.com/lng-industry-warns-u-s-built-ship-mandate-could-derail-energy-exports/",
    "timestamp": "2025-05-07T21:38:42Z"
  },
  {
    "title": "World's richest 10% caused two thirds of global warming: study",
    "description": "The world's wealthiest 10 percent of individuals are responsible for two thirds of global warming since 1990, researchers said on Wednesday. How the rich consume and invest has substantially increased the risk of deadly heatwaves and drought, they reported in…",
    "link": "https://japantoday.com/category/features/environment/world%27s-richest-10-caused-two-thirds-of-global-warming-study",
    "timestamp": "2025-05-07T21:38:01Z"
  },
  {
    "title": "They voted for Trump because they thought he cared about the little guy. They are being disabused [Obvious]",
    "description": "They voted for Trump because they thought he cared about the little guy. They are being disabused",
    "link": "https://www.fark.com/comments/13662392/They-voted-for-Trump-because-they-thought-he-cared-about-little-guy-They-are-being-disabused",
    "timestamp": "2025-05-07T21:37:42Z"
  },
  {
    "title": "US envoy Witkoff briefs UN Security Council on Gaza, other issues",
    "description": "US envoy Steve Witkoff briefed members of the UN Security Council on Wednesday about various topics, including Gaza, participants in the closed-door talks said. The informal meeting in New York came a day after Witkoff was formally sworn in as President Donal…",
    "link": "https://www.digitaljournal.com/world/us-envoy-witkoff-briefs-un-security-council-on-gaza-other-issues/article",
    "timestamp": "2025-05-07T21:37:20Z"
  },
  {
    "title": "'How long can this go on?' Republican pressed after admitting Americans will feel 'pain'",
    "description": "Rep. Darin LaHood (R-IL) told CNN's Brianna Keilar that he isn't shocked that American automakers are hiking prices because President Donald Trump said that there would be \"some short-term pain\" as a result of his tariffs. LaHood committed to Trump's language…",
    "link": "https://www.rawstory.com/trump-tariff-2671912867/",
    "timestamp": "2025-05-07T21:37:03Z"
  },
  {
    "title": "Jon Voight Says He's Worried Hollywood Will Go 'Down the Drain Like Detroit'",
    "description": "Jon Voight says he and President Donald Trump are working together to save Hollywood ... 'cause the way things are going, he thinks the whole thing could go down the drain -- just like Detroit, Michigan. The actor gave his first interview to…\n Permalink",
    "link": "https://www.tmz.com/2025/05/07/jon-voight-interview-trump-hollywood-like-detroit/",
    "timestamp": "2025-05-07T21:36:52Z"
  },
  {
    "title": "Business confidence drops dramatically over ‘recent political developments’",
    "description": "Confidence among the Bay State’s employers plummeted in April amid worries over tariffs and an unpredictable economic future, according to the Associated Industries of Massachusetts.",
    "link": "https://www.bostonherald.com/2025/05/07/business-confidence-drops-dramatically-over-recent-political-developments/",
    "timestamp": "2025-05-07T21:36:42Z"
  },
  {
    "title": "Anguished families are losing hope as they can’t reach loved ones sent to El Salvador mega-prison",
    "description": "Carmen Bonilla can't sleep, fearing for her son. Families say the U.S. and El Salvador offer no answers about the men taken to prison.",
    "link": "https://www.nbcnews.com/news/us-news/trump-administration-backlash-migrants-el-salvador-prison-families-dar-rcna201514",
    "timestamp": "2025-05-07T21:36:31Z"
  },
  {
    "title": "Trump offers tepid support for his pick for DC US attorney (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nTrump offers tepid support for his pick for DC US attorney  —  “That's really up to the senators; if they feel that way, they have to vote the way they vote,” Trump said of Ed Martin's nomination.  —  President Donald Trump on …",
    "link": "https://www.memeorandum.com/250507/p123",
    "timestamp": "2025-05-07T21:35:09Z"
  },
  {
    "title": "Trump's ambassador to China sworn in ahead of high-stakes talks in Switzerland",
    "description": "President Donald Trump's pick for U.S. ambassador to China was sworn in on Wednesday, days before White House officials are set to meet with their Chinese counterparts for the first time since Trump announced his 145% tariffs.\n\"What timing ... what timing, on…",
    "link": "https://biztoc.com/x/29e6cea379663ae2",
    "timestamp": "2025-05-07T21:34:27Z"
  },
  {
    "title": "Trump Says US Doesn't Need Tariff Deals, He'll Dictate Terms",
    "description": "US President Donald Trump said he would prescribe tariff levels and trade concessions for partners looking to avoid higher duties, appearing to move away from the idea that he would engage in back-and-forth negotiations.\n“We’re going to put very fair numbers …",
    "link": "https://biztoc.com/x/57d804122dbb5697",
    "timestamp": "2025-05-07T21:34:16Z"
  },
  {
    "title": "Pakistan warns will ‘avenge’ deaths from Indian strikes",
    "description": "Pakistan has warned it will “avenge” those killed by Indian air strikes that New Delhi said were in response to an attack in Kashmir, signalling an imminent escalation in the worst violence in decades between the nuclear-armed neighbours. At least 43 deaths h…",
    "link": "https://www.digitaljournal.com/world/pakistan-warns-will-avenge-deaths-from-indian-strikes/article",
    "timestamp": "2025-05-07T21:32:20Z"
  },
  {
    "title": "Social Media Goes Nuts Over Trump’s Mystery ‘Earth-Shattering’ Announcement",
    "description": "President Donald Trump’s upcoming “earth-shattering” announcement has sent social media into a frenzy. During a meeting with Canadian Prime Minister Mark...",
    "link": "https://www.thedailybeast.com/social-media-goes-nuts-over-trumps-mystery-earth-shattering-announcement/",
    "timestamp": "2025-05-07T21:31:55Z"
  },
  {
    "title": "Billionaire Ken Griffin calls tariffs a 'painfully regressive tax,' hitting working class Americans the hardest",
    "description": "The Wall Street titan said there is a \"modest\" risk of stagflation as tariffs create inflationary pressures and slow down the economy.",
    "link": "https://www.cnbc.com/2025/05/07/griffin-calls-tariffs-a-painfully-regressive-tax-hitting-working-class-the-hardest.html",
    "timestamp": "2025-05-07T21:31:06Z"
  },
  {
    "title": "C-SPAN Asks Supreme Court To Televise Birthright Citizenship Arguments",
    "description": "Cameras are barred from the court, but the network wants to film a case of “profound national significance” as Trump attempts to end the guarantee.",
    "link": "https://www.huffpost.com/entry/c-span-supreme-court-birthright-citizenship_n_681ba7f5e4b0a7eb6002046c",
    "timestamp": "2025-05-07T21:30:28Z"
  },
  {
    "title": "Falling DXY part of US financial system’s ‘long-term transition’ — Will Bitcoin continue to shine?",
    "description": "What to know:<ul><li>Lyn Alden says a weaker dollar is necessary for the US to stabilize its financial system.\r\n</li><li>Bitcoin and gold are well-positioned to benefit from de-dollarization.\r\n</li><li>Sovereign wealth funds and various nations are already in…",
    "link": "https://cointelegraph.com/news/falling-dxy-part-of-us-financial-system-s-long-term-transition-will-bitcoin-continue-to-shine",
    "timestamp": "2025-05-07T21:30:00Z"
  },
  {
    "title": "Some ‘Les Misérables’ Cast Members To Boycott Trump’s Attendance At Kennedy Center – Report",
    "description": "Some cast members of the Kennedy Center performance of Les Misérables plan to skip the show on June 11 when President Donald Trump is in attendance, according to an exclusive CNN report. According to CNN, at least 10 to 12 performers plan to sit out the June …",
    "link": "http://deadline.com/2025/05/les-miserables-kennedy-center-trump-1236389125/",
    "timestamp": "2025-05-07T21:29:23Z"
  },
  {
    "title": "IRS reverses staffing gains made under Biden",
    "description": "The tax agency has shed over 20,000 employees through the deferred resignation program, and more significant cuts are still expected.",
    "link": "https://www.nextgov.com/people/2025/05/irs-reverses-staffing-gains-made-under-biden/405146/",
    "timestamp": "2025-05-07T21:28:00Z"
  },
  {
    "title": "Pakistan Warns Will 'Avenge' Deaths From Indian Strikes",
    "description": "Pakistan has warned it will \"avenge\" those killed by Indian air strikes that New Delhi said were in response to an attack in Kashmir, signalling an imminent escalation in the worst violence in decades between the nuclear-armed neighbours.",
    "link": "https://www.ibtimes.com/pakistan-warns-will-avenge-deaths-indian-strikes-3772854",
    "timestamp": "2025-05-07T21:27:12Z"
  },
  {
    "title": "Pakistan Warns Will 'Avenge' Deaths From Indian Strikes",
    "description": "Pakistan has warned it will \"avenge\" those killed by Indian air strikes that New Delhi said were in response to an attack in Kashmir, signalling an imminent escalation in the worst violence in decades between the nuclear-armed neighbours.",
    "link": "https://www.ibtimes.com.au/pakistan-warns-will-avenge-deaths-indian-strikes-1858610",
    "timestamp": "2025-05-07T21:27:11Z"
  },
  {
    "title": "Jake Paul organizes helicopter flight to place deodorant on Statue of Liberty in outrageous move",
    "description": "Jake Paul, the YouTube star turned professional boxer, has been making waves in and out of the ring as he prepares for his next big fight. On June 28, 2025, Paul (11-1, 7 KOs) will",
    "link": "https://www.marca.com/en/boxing/2025/05/07/681bae1e46163fe83b8b45c9.html",
    "timestamp": "2025-05-07T21:26:15Z"
  },
  {
    "title": "Web archivists scramble to save US public data from deletion",
    "description": "As President Donald Trump's administration purges public records since storming back to power, experts and volunteers are preserving thousands of web pages and government sites devoted to climate change, health or LGBTQ rights and other issues.Resources on AI…",
    "link": "https://www.rawstory.com/web-archivists-scramble-to-save-us-public-data-from-deletion/",
    "timestamp": "2025-05-07T21:26:03Z"
  },
  {
    "title": "'Wow!’ Expert stunned as judge exposes Trump admin's bid to skirt detainee's rights",
    "description": "President Donald Trump was called out by a federal judge explicitly for trying to deny basic due process rights to a detainee under his deportation dragnet — and a legal expert was stunned by the brazenness of it all.The case in question concerns Badar Khan S…",
    "link": "https://www.rawstory.com/trump-judge-ruling/",
    "timestamp": "2025-05-07T21:25:45Z"
  },
  {
    "title": "Studio Execs Say California Needs to Be More Competitive to Bring Production Back to Hollywood",
    "description": "\"It’s almost more a California issue, honestly, than a U.S. issue,\" Sony Pictures CEO Ravi Ahuja says at the Milken Institute Global Conference\nThe post Studio Execs Say California Needs to Be More Competitive to Bring Production Back to Hollywood appeared fi…",
    "link": "https://www.thewrap.com/hollywood-execs-california-production-tax-incentives/",
    "timestamp": "2025-05-07T21:25:36Z"
  },
  {
    "title": "Newly Confirmed Social Security Commissioner Faces Bipartisan Pressure Over DOGE Cuts",
    "description": "Sen. Elizabeth Warren (D-Mass.) led Democrats in a letter demanding answers from Frank Bisignano.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-social-security-frank-bisignano_n_681bb812e4b0f8cbd16d4313",
    "timestamp": "2025-05-07T21:25:28Z"
  },
  {
    "title": "Why Senator Kirsten Gillibrand Went on a Christian Podcast to Spread the Anti-Trump Gospel",
    "description": "The New York senator made an unexpected appearance recently on the popular Christian show ‘Holy Post,’ a sign that she is looking to unlikely sources for anti-Trump support.",
    "link": "https://www.vanityfair.com/style/story/why-senator-kirsten-gillibrand-went-on-a-christian-podcast",
    "timestamp": "2025-05-07T21:24:11Z"
  },
  {
    "title": "Trump: Iran must 'blow up' nukes peacefully—or face force",
    "description": "President Trump warns Iran to dismantle its nuclear program voluntarily or face destruction, saying the regime must “blow them up nicely or blow them up viciously.”",
    "link": "https://www.israelnationalnews.com/news/408006",
    "timestamp": "2025-05-07T21:24:06Z"
  },
  {
    "title": "Trump downplays Europe's role in WWII as he unveils 'Victory Day'",
    "description": "US President Donald Trump downplayed the role of European countries in World War II on Wednesday as he formally designated May 8 as a day to celebrate victory over Nazi Germany.\"The victory was mostly accomplished because of us, like it or not,\" Trump said at…",
    "link": "https://www.rawstory.com/trump-downplays-europe-s-role-in-wwii-as-he-unveils-victory-day/",
    "timestamp": "2025-05-07T21:23:37Z"
  },
  {
    "title": "What do Canadians make of Carney's meeting with Trump?",
    "description": "The prime minister reiterated that Canada \"is not for sale\" during Tuesday's meeting at the White House.",
    "link": "https://www.bbc.com/news/videos/cj3x36zpg13o",
    "timestamp": "2025-05-07T21:22:47Z"
  },
  {
    "title": "President Donald Trump Taps Wellness Influencer Close To RFK Jr. For Surgeon General",
    "description": "President Donald Trump is tapping wellness influencer Casey Means as his nominee for surgeon general.",
    "link": "https://www.huffpost.com/entry/trump-surgeon-general-casey-means_n_681bce1ce4b0b11c4979477d",
    "timestamp": "2025-05-07T21:22:39Z"
  },
  {
    "title": "Scott Jennings Says Trump Admin Believes American Dream Shouldn’t Be Dependent On Buying ‘Cheapest Junk’ From ‘Enemy’",
    "description": "Scott Jennings said that Donald Trump's administration is not defining the American Dream by the ability to purchase \"the cheapest junk\" possible from China.",
    "link": "https://dailycaller.com/2025/05/07/scott-jennings-trump-admin-believes-american-dream-shouldnt-dependent-buying-cheapest-enemy/",
    "timestamp": "2025-05-07T21:22:23Z"
  },
  {
    "title": "US, Ukraine can immediately begin capitalizing on mineral deal through natural gas sales: Kyiv’s energy minister",
    "description": "\"The US-Ukraine deal gives the possibility to increase production of resources, which is in really demand in the European market — which is a huge market.\"",
    "link": "https://nypost.com/2025/05/07/world-news/us-ukraine-can-immediately-begin-capitalizing-on-mineral-deal-through-natural-gas-sales-kyivs-energy-minister/",
    "timestamp": "2025-05-07T21:22:20Z"
  },
  {
    "title": "Kremlin: Three-day ceasefire in Ukraine takes effect ahead of Victory Day commemoration",
    "description": "Putin announced the truce last month as a “humanitarian” gesture.",
    "link": "https://www.thejournal.ie/three-day-ceasefire-in-ukraine-takes-effect-ahead-of-victory-day-commemoration-6698598-May2025/",
    "timestamp": "2025-05-07T21:21:39Z"
  },
  {
    "title": "House GOP backing off some Medicaid cuts as report shows millions of people would lose health care - NewsBreak",
    "description": "WASHINGTON (AP) — House Republicans appear to be backing off some, but not all, of the steep reductions to the Medicaid program as part of their big tax br",
    "link": "https://www.newsbreak.com/share/3996112001246-house-gop-backing-off-some-medicaid-cuts-as-report-shows-millions-of-people-would-lose-health-care?_f=app_share&pd=03DNXOum&lang=en_US&send_time=1746652656&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.17.1.6%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q2-v7%2Cns_foryou_recall_exp_25q2-v2%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v7&s=i2",
    "timestamp": "2025-05-07T21:21:21Z"
  },
  {
    "title": "White House pulls nomination for surgeon general a day before Senate confirmation hearing",
    "description": "President Donald Trump announced Wednesday that Dr. Casey Means will replace Dr. Janette Nesheiwat as his nominee for U.S. Surgeon General.",
    "link": "https://www.nbcnews.com/politics/white-house/white-house-surgeon-general-nominee-casey-means-janette-nesheiwat-rcna205476",
    "timestamp": "2025-05-07T21:21:15Z"
  },
  {
    "title": "Ex-SafeMoon CEO claims innocence, blames founder as trial begins",
    "description": "Braden John Karony, the former CEO of crypto firm SafeMoon, made an out-of-court statement claiming innocence as his criminal trial began in New York.In a May 6 X post after court proceedings had likely ended for the day, Karony said he was innocent and “did …",
    "link": "https://cointelegraph.com/news/safemoon-trial-john-karony-blames-founder",
    "timestamp": "2025-05-07T21:21:00Z"
  },
  {
    "title": "How 5 Potential Medicaid Cuts Would Change Coverage for Millions",
    "description": "Congressional Republicans are weighing a series of cost-cutting proposals that could reshape Medicaid and Medicare coverage for tens of millions of Americans.",
    "link": "https://www.newsweek.com/how-5-potential-medicare-cuts-would-change-coverage-millions-2069290",
    "timestamp": "2025-05-07T21:20:49Z"
  },
  {
    "title": "Trump changes mind on surgeon general pick, tapping wellness influencer close to RFK Jr.",
    "description": "Dr. Casey Means is now Trump's surgeon general nominee, while the president said his initial pick will now work at Health and Human Services",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/07/trump-surgeon-general-nominee-casey-means-rfk/83500780007/",
    "timestamp": "2025-05-07T21:20:25Z"
  },
  {
    "title": "Trump to pitch sweeping Medicare drug price plan (Politico)",
    "description": "Politico:\nTrump to pitch sweeping Medicare drug price plan  —  Trump wanted to advance the ‘most favored nation’ policy in his first term but faced resistance from industry and the courts.  —  President Donald Trump plans to revive an effort to dramatically s…",
    "link": "https://www.memeorandum.com/250507/p120",
    "timestamp": "2025-05-07T21:20:01Z"
  },
  {
    "title": "As GOP concerns grow about Medicaid cuts, hardliners pressure Speaker Mike Johnson on lower deficits",
    "description": "Republicans are scrambling to resolve intense divisions over Medicaid as they hammer out a key piece of their massive bill for President Donald Trump’s agenda.",
    "link": "https://www.nbcnews.com/politics/congress/gop-concerns-medicaid-cuts-hardliners-pressure-johnson-deficits-rcna205390",
    "timestamp": "2025-05-07T21:19:58Z"
  },
  {
    "title": "Pro-Trump Pastor Questions Supreme Court Justices",
    "description": "MAGA pastor Lance Wallnau ripped into the courts and Democrats in a video on Wednesday, calling out \"judicial activism.\"",
    "link": "https://www.newsweek.com/pro-trump-pastor-questions-supreme-court-justices-lance-wallnau-2069314",
    "timestamp": "2025-05-07T21:18:28Z"
  },
  {
    "title": "Trump pulls surgeon general nominee after questions about medical education",
    "description": "Former Fox News medical contributor Dr. Janette Nesheiwat had been scheduled to appear Thursday for her confirmation hearing before a Senate committee.",
    "link": "https://www.cnbc.com/2025/05/07/trump-surgeon-general-nesheiwat.html",
    "timestamp": "2025-05-07T21:17:44Z"
  },
  {
    "title": "Trump announces Dr. Casey Means will be nominated as the next US Surgeon General",
    "description": "Trump said Means will work closely with Health and Human Services Secretary Robert F. Kennedy Jr. and \"Make America Healthy Again.\"",
    "link": "https://justthenews.com/politics-policy/health/trump-announces-dr-casey-means-will-be-nominated-next-us-surgeon-general",
    "timestamp": "2025-05-07T21:16:59Z"
  },
  {
    "title": "US court says student activist Rumeysa Ozturk must be sent to Vermont",
    "description": "The Trump administration was also ordered in the case of Mahmoud Khalil to justify its use of a Cold War-era law.",
    "link": "https://www.aljazeera.com/news/2025/5/7/us-court-says-student-activist-rumeysa-ozturk-must-be-sent-to-vermont",
    "timestamp": "2025-05-07T21:15:19Z"
  },
  {
    "title": "What does the truce between the Houthis and the US mean for Yemenis?",
    "description": "President Donald Trump says US attacks on Houthi targets in Yemen will stop.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/5/7/what-does-the-truce-between-the-houthis-and-the-us-mean-for-yemenis",
    "timestamp": "2025-05-07T21:15:14Z"
  },
  {
    "title": "Trump warns of ‘decisions’ on Russia-Ukraine talks",
    "description": "The US-brokered negotiations around the Ukraine conflict need to come to a head, President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616988-trump-warns-russia-ukraine/",
    "timestamp": "2025-05-07T21:15:05Z"
  },
  {
    "title": "Judge says deporting migrants to Libya would violate his order",
    "description": "A judge has ruled that deporting noncitizens to Libya without due process would violate his court order, after sources said the White House has discussed such plans.",
    "link": "https://abcnews.go.com/US/judge-deporting-migrants-libya-violate-order/story?id=121567596",
    "timestamp": "2025-05-07T21:13:20Z"
  },
  {
    "title": "Judge warns Trump 'would clearly violate' court order with plan to ship migrants to Libya",
    "description": "U.S. District Court Judge Brian E. Murphy clarified this week that President Donald Trump's administration \"would clearly violate\" his order if it follows through with a reported plan to send migrants to Libya.U.S. officials confirmed to multiple outlets that…",
    "link": "https://www.rawstory.com/libya-deportations-court-order/",
    "timestamp": "2025-05-07T21:13:19Z"
  },
  {
    "title": "President Donald Trump taps wellness influencer close to Robert F. Kennedy Jr. for surgeon general",
    "description": "President Donald Trump taps wellness influencer close to Robert F. Kennedy Jr. for surgeon generaltwincities.com",
    "link": "https://www.twincities.com/2025/05/07/trump-surgeon-general/",
    "timestamp": "2025-05-07T21:12:48Z"
  },
  {
    "title": "The US and China can't even agree on who initiated their upcoming trade talks",
    "description": "President Donald Trump said the US did not instigate upcoming trade talks between the two nations.\nAnna Moneymaker/Getty Images\nChina says the US requested an upcoming trade talk, but President Trump begs to differ.\nAmerican and Chinese officials are set to m…",
    "link": "https://biztoc.com/x/e64f4e17ceccedc3",
    "timestamp": "2025-05-07T21:11:57Z"
  },
  {
    "title": "Daily Wire's Michael Knowles Applauds Trans Military Ban, Calls Identity 'Illness'",
    "description": "Popular conservative commentator Michael Knowles says the Supreme Court upholding President Donald Trump's ban on transgender people serving in the military is a smart move ... 'cause he thinks it's a serious disease that affects their combat readiness.",
    "link": "https://www.tmz.com/2025/05/07/michael-knowles-supports-trans-military-ban/",
    "timestamp": "2025-05-07T21:11:26Z"
  },
  {
    "title": "New report shows chilling effect of Trump's targeting of big law firms",
    "description": "The president's vengeance also affects firms that haven't been directly targeted by him or cut deals with him.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/gibson-dunn-trump-immigration-big-law-rcna205445",
    "timestamp": "2025-05-07T21:11:17Z"
  },
  {
    "title": "DOGE committee goes off the rails after Democrats suggest Marjorie Taylor Greene engaged in insider trading",
    "description": "Democrats have argued that Greene and other Republicans may have known about Trump's tariff moves ahead of time, allowing them to profit.",
    "link": "https://www.businessinsider.com/marjorie-taylor-greene-stock-trades-democrats-committee-2025-5",
    "timestamp": "2025-05-07T21:10:43Z"
  },
  {
    "title": "‘Much worse than expected’: Trump infuriated by CBS Emmy nomination for deceptively edited Kamala interview",
    "description": "'A total slap in the face to anyone who believes in TRUTH and Honest Journalism'",
    "link": "https://www.wnd.com/2025/05/much-worse-than-expected-trump-infuriated-by-cbs-emmy-nomination-for-deceptively-edited-kamala-interview/",
    "timestamp": "2025-05-07T21:10:35Z"
  },
  {
    "title": "Trump’s NIH Axed Research Grants Even After a Judge Blocked the Cuts, Internal Records Show",
    "description": "by Annie Waldman \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nFor more than two months, the Trump administration has been subject to a feder…",
    "link": "https://www.propublica.org/article/trump-nih-cuts-transgender-research-grants",
    "timestamp": "2025-05-07T21:10:00Z"
  },
  {
    "title": "US Fed pauses rate cuts again and flags inflation, unemployment risks",
    "description": "Policymakers voted unanimously to hold the US central bank’s key lending rate at between 4.25 per cent and 4.5 per cent. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/us-fed-pauses-rate-cuts-again-and-flags-inflation-unemployment-risks",
    "timestamp": "2025-05-07T21:09:05Z"
  },
  {
    "title": "Is there a 'woke right'?",
    "description": "Is there a 'woke right'?\r\n\n \n \n \n (Second column, 10th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Salt Lake City issues new Pride flag to get around Utah ban...",
    "link": "https://www.deseret.com/politics/2025/05/06/james-lindsay-and-jordan-peterson-explain-the-woke-right/",
    "timestamp": "2025-05-07T21:07:38Z"
  },
  {
    "title": "Some American Companies May Be Trying To Sidestep Trump’s DEI Crackdown, Scholars Warn",
    "description": "While many companies have been retreating from DEI in recent months, there has been reports that some have simply been rebranding their diversity efforts.",
    "link": "https://dailycaller.com/2025/05/07/american-companies-may-sidestep-trump-dei-crackdown/",
    "timestamp": "2025-05-07T21:06:06Z"
  },
  {
    "title": "Leaked Report of US Intel Agencies Eyeing Greenland Irks Denmark",
    "description": "Danish Foreign Minister Lars Lokke Rasmussen said Wednesday he would call the U.S. ambassador to Denmark following a report in The Wall Street Journal that... Read More\nThe post Leaked Report of US Intel Agencies Eyeing Greenland Irks Denmark appeared first o…",
    "link": "https://www.dailysignal.com/2025/05/07/leaked-report-us-intel-agencies-eyeing-greenland-irks-denmark/",
    "timestamp": "2025-05-07T21:05:56Z"
  },
  {
    "title": "Why MAGA May Have Lost Its Appetite for Slashing Medicaid",
    "description": "As House Republicans mull Medicaid cuts to pay for Trump’s agenda, MAGA activists like Stephen Bannon and Laura Loomer are reminding them that a lot of Trump supporters now rely on Medicaid, in part because the Affordable Care Act included them.",
    "link": "http://nymag.com/intelligencer/article/why-maga-may-have-lost-its-appetite-for-slashing-medicaid.html",
    "timestamp": "2025-05-07T21:05:51Z"
  },
  {
    "title": "‘You’re Accusing Me Of Committing Perjury!’ FBI Director Kash Patel Rages Over House Dem Suggesting He Lied at Confirmation Hearing",
    "description": "FBI Director Kash Patel lost it Wednesday when Rep. Madeleine Dean (D-PA) suggested he lied during his senate confirmation hearing.\nThe post ‘You’re Accusing Me Of Committing Perjury!’ FBI Director Kash Patel Rages Over House Dem Suggesting He Lied at Confirm…",
    "link": "https://www.mediaite.com/politics/youre-accusing-me-of-committing-perjury-fbi-director-kash-patel-rages-over-house-dem-suggesting-he-lied-at-confirmation-hearing/",
    "timestamp": "2025-05-07T21:05:16Z"
  },
  {
    "title": "Trump now wants everyone to stop asking when the trade deals are coming",
    "description": "Trump and his team were touting the countries eager to make deals with the U.S. on trade. They changed their tune when it became clear such deals wouldn't materialize quickly.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-trade-deals-coming-rcna205340",
    "timestamp": "2025-05-07T21:05:12Z"
  },
  {
    "title": "Binance's BNB Chain rebounds amid institutional, DeFi adoption",
    "description": "Binance-affiliated BNB Chain has rebounded after a period of stagnation in 2023 amid accelerating institutional and decentralized finance (DeFi) adoption. During the past year, BNB Chain has benefited from multibillion-dollar inflows into DeFi, US exchange-tr…",
    "link": "https://cointelegraph.com/news/binance-bnbchain-stages-comeback-institutional-defi-adoption",
    "timestamp": "2025-05-07T21:05:11Z"
  },
  {
    "title": "White House withdraws another key nomination with last-minute pivot to MAHA influencer for US surgeon general | CNN",
    "description": "The White House announced Thursday that President Donald Trump is pulling Dr. Janette Nesheiwat’s nomination to be surgeon general and replacing her with Dr. Casey Means. The news came the day before Nesheiwat’s Senate confirmation hearing was set to begin.",
    "link": "https://www.cnn.com/2025/05/07/health/trump-surgeon-general-nesheiwat-means",
    "timestamp": "2025-05-07T21:04:53Z"
  },
  {
    "title": "‘Wasting My Time’: MTG Puts Her Gavel To Good Use As Dem Rep Won’t Stop Talking During Hearing",
    "description": "Marjorie Taylor Greene repeatedly banged her gavel Wednesday after Democrat New Mexico Rep. Melanie Stansbury refused to stop speaking.",
    "link": "https://dailycaller.com/2025/05/07/marjorie-taylor-greene-democrat-melanie-stansbury-men-womens-sports/",
    "timestamp": "2025-05-07T21:04:09Z"
  },
  {
    "title": "Taxpayers could be forced to fund Trump foe Letitia James’ legal defense if Dem budget item passes",
    "description": "A proposed budget amendment pushed by New York State Democrats would set up a legal defense fund for AG Letitia James that could be used for her mortgage fraud case.",
    "link": "https://www.foxnews.com/politics/taxpayers-could-forced-fund-trump-foe-letitia-james-legal-defense-dem-budget-item-passes",
    "timestamp": "2025-05-07T21:03:21Z"
  },
  {
    "title": "Trump to Pitch Sweeping Medicare Drug Price Plan",
    "description": "\"President Donald Trump plans to revive an effort to dramatically slash drug costs by tying the amount the government pays for some medicines to lower prices abroad,\" Politico reports. \"Trump early next week is expected",
    "link": "https://politicalwire.com/2025/05/07/trump-to-pitch-sweeping-medicare-drug-price-plan/",
    "timestamp": "2025-05-07T21:01:15Z"
  },
  {
    "title": "Trump administration to rescind Biden-era AI chip export curbs",
    "description": "U.S. President Donald Trump’s administration plans to rescind Biden-era curbs on the export of advanced artificial intelligence chips, a spokesperson for the U.S. Department of Commerce said on Wednesday.\nThe Framework for Artificial Intelligence Diffusion, a…",
    "link": "https://biztoc.com/x/f4ded563073706df",
    "timestamp": "2025-05-07T21:01:09Z"
  },
  {
    "title": "Trump: Not sure if US, China will get along",
    "description": "United States President Donald Trump shared on Wednesday that he is unsure whether Washington will be getting along with China in the next four years.Speaking to Hugh Hewitt, Trump said that the relat...",
    "link": "https://biztoc.com/x/0ba2765d09160a4d",
    "timestamp": "2025-05-07T21:00:45Z"
  }
]