[
  {
    "title": "Second federal court rules against Trump’s signature tariffs, intensifying legal battle",
    "description": "A second federal judge has ruled against President Donald Trump’s sweeping use of emergency tariffs, intensifying the legal and political battle over one of the administration’s signature economic policies.",
    "link": "https://nypost.com/2025/05/29/business/second-federal-court-rules-against-trumps-signature-tariffs-intensifying-legal-battle/",
    "timestamp": "2025-05-29T18:20:19Z"
  },
  {
    "title": "Fox Anchor Accuses Reporters Of ‘Taunting’ Trump By ‘Using The Term Chickening Out’",
    "description": "Maria Bartiromo accused reporters of trying to \"taunt\" Trump by \"using the term chickening out\" — a term that has become popular with stock professionals.\nThe post Fox Anchor Accuses Reporters Of ‘Taunting’ Trump By ‘Using The Term Chickening Out’ first appea…",
    "link": "https://www.mediaite.com/media/news/fox-anchor-accuses-reporters-of-taunting-trump-by-using-the-term-chickening-out/",
    "timestamp": "2025-05-29T18:19:57Z"
  },
  {
    "title": "Donald Trump's Air Force One deal with Qatar isn't final as gift may turn into legal liability",
    "description": "Trump wants a luxury jet from Qatar as a gift for Air Force One, but the legal paperwork isn't finished yet. Qatar wants to avoid future blame. There's political pushback in the U.S., and fixing the old jet could cost billions.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-air-force-one-deal-with-qatar-isnt-final-as-gift-may-turn-into-legal-liability/articleshow/121497434.cms",
    "timestamp": "2025-05-29T18:18:11Z"
  },
  {
    "title": "‘Doctor Odyssey’ Star Joshua Jackson Says He’s “Made It” After John Oliver Showed His Support For A Season 2 Renewal On ‘Last Week Tonight’",
    "description": "Oliver likened the ABC dramedy to \"sexy ER\" and \"The Pitt with sharks\" in a hilarious rant.",
    "link": "https://decider.com/2025/05/29/doctor-odyssey-joshua-jackson-made-it-john-oliver-support-season-2/",
    "timestamp": "2025-05-29T18:18:10Z"
  },
  {
    "title": "Federal judge blocks 5 Trump tariff executive orders",
    "description": "Judge Contreras sides with a toy company, halting Trump's tariffs under IEEPA, as the administration considers an appeal, affecting trade and businesses.",
    "link": "https://www.foxnews.com/politics/federal-judge-blocks-5-trump-tariff-executive-orders",
    "timestamp": "2025-05-29T18:17:20Z"
  },
  {
    "title": "Karoline Leavitt Twists Herself in Knots to Avoid Answering Question on Elon Musk Slamming Trump Budget Bill",
    "description": "Karoline Leavitt went out of her way to avoid answering a question about Elon Musk slamming the budget bill backed by President Donald Trump.\nThe post Karoline Leavitt Twists Herself in Knots to Avoid Answering Question on Elon Musk Slamming Trump Budget Bill…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-twists-herself-in-knots-to-avoid-answering-question-on-elon-musk-slamming-trump-budget-bill/",
    "timestamp": "2025-05-29T18:17:05Z"
  },
  {
    "title": "President Trump - do not forget the Iranian people!",
    "description": "The regime’s deepest anxiety stems from the potential resurgence of widespread domestic anger and unrest—from a nation that is oppressed, impoverished, and seething with rage. Opinion.",
    "link": "https://www.israelnationalnews.com/news/409201",
    "timestamp": "2025-05-29T18:15:41Z"
  },
  {
    "title": "New Study Reveals Why Trump Is So Popular Among Minority Voters",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA new study could shed light on one reason President Donald Trump may have gained ground with minority voters, who previously supported Democrats, in the 2024 presidential race.\nWhy It Matters\nTrump's 2024 vic…",
    "link": "https://biztoc.com/x/93df98d7d839869d",
    "timestamp": "2025-05-29T18:15:20Z"
  },
  {
    "title": "Trump Bristles at ‘TACO Trade’ That Bets on Him Backing Down",
    "description": "President Donald Trump bristled at suggestions that Wall Street believes he’s ultimately unwilling to follow through on extreme tariff threats, saying his repeated retreats are instead part of a strategy to exert trade concessions.\n“It’s called negotiation,” …",
    "link": "https://biztoc.com/x/e4de9b37d8f8499a",
    "timestamp": "2025-05-29T18:15:05Z"
  },
  {
    "title": "DOJ Sues North Carolina Over Voter Registration issues",
    "description": "The Justice Department sued North Carolina on Wednesday, alleging the battleground state failed to maintain accurate voter registration lists.  The litigation advances President Donald Trump’s Executive... Read More\nThe post DOJ Sues North Carolina Over Voter…",
    "link": "https://www.dailysignal.com/2025/05/29/doj-sues-north-carolina-over-voter-registration-issues/",
    "timestamp": "2025-05-29T18:15:00Z"
  },
  {
    "title": "Court blocks Trump from imposing tariffs under emergency powers law",
    "description": "A federal court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law.",
    "link": "https://biztoc.com/x/6653082dfee9e975",
    "timestamp": "2025-05-29T18:14:51Z"
  },
  {
    "title": "Trump’s Tariff Agenda Is Suddenly on Life Support",
    "description": "The ruling against Trump's tariff regime is seismic for more reasons than one.",
    "link": "https://slate.com/news-and-politics/2025/05/supreme-court-analysis-trump-tariff-agenda-kaput.html",
    "timestamp": "2025-05-29T18:13:43Z"
  },
  {
    "title": "Julie Chrisley makes first public outing after Trump pardon",
    "description": "On Thursday, Julie Chrisley, 52, was seen leaving a butcher store in Nashville, Tennessee just one day after being released from federal prison.",
    "link": "https://www.foxnews.com/entertainment/julie-chrisley-makes-first-public-outing-after-trump-pardon",
    "timestamp": "2025-05-29T18:13:20Z"
  },
  {
    "title": "Trump pardons rapper NBA Youngboy, who was sentenced for gun-related charges",
    "description": "The rapper is among a number of high-profile people Trump pardoned this week.",
    "link": "https://www.bostonherald.com/2025/05/29/nba-youngboy-pardon/",
    "timestamp": "2025-05-29T18:12:27Z"
  },
  {
    "title": "Senator reveals: Biden failed to investigate 65,000 cases of border kids flagged for ‘concern’",
    "description": "'Not a single child should continue to suffer because of the previous administration’s failures'",
    "link": "https://www.wnd.com/2025/05/senator-reveals-biden-failed-to-investigate-65000-cases-of-border-kids-flagged-for-concern/",
    "timestamp": "2025-05-29T18:12:24Z"
  },
  {
    "title": "After Donald Trump, UK’s Keir Starmer to lay off 50,000 civil service jobs",
    "description": "Sir Keir Starmer and Rachel Reeves are preparing to reduce the UK civil service. Reports indicate a plan to cut about 50,000 jobs by 2030. This aims to reduce government running costs by 15 percent. The goal is to save £2 billion annually. The Chancellor will…",
    "link": "https://economictimes.indiatimes.com/news/international/uk/after-donald-trump-uks-keir-starmer-to-lay-off-50000-civil-service-jobs-uk-government-job-news/articleshow/121496496.cms",
    "timestamp": "2025-05-29T18:12:14Z"
  },
  {
    "title": "Chris Cillizza's Tesla Violently Stickered To Death, But Don't Worry It Got Better",
    "description": "He needs to talk about some things.",
    "link": "https://www.wonkette.com/p/chris-cillizzas-tesla-violently-stickered",
    "timestamp": "2025-05-29T18:11:56Z"
  },
  {
    "title": "Court blocks Trump from imposing tariffs under emergency powers law",
    "description": "A federal court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law.",
    "link": "https://www.pbs.org/newshour/nation/court-blocks-trump-from-imposing-tariffs-under-emergency-powers-law",
    "timestamp": "2025-05-29T18:11:03Z"
  },
  {
    "title": "New Study Reveals Why Trump Is So Popular Among Minority Voters",
    "description": "A new study lays out one potential reason for why Trump gained ground with Latino, Black and Asian voters in 2024..",
    "link": "https://www.newsweek.com/new-study-reveals-why-trump-popular-minority-voters-2078601",
    "timestamp": "2025-05-29T18:10:10Z"
  },
  {
    "title": "‘Intimidated By a CNN Story’: Trump Official Fired By Ric Grenell Over Anti-Gay Posts Lashes Out",
    "description": "Floyd Brown says he was fired from the Kennedy Center by Ric Grenell hours after CNN asked about his past anti-gay comments and statements on marriage.\nThe post ‘Intimidated By a CNN Story’: Trump Official Fired By Ric Grenell Over Anti-Gay Posts Lashes Out f…",
    "link": "https://www.mediaite.com/politics/intimidated-by-a-cnn-story-trump-official-fired-by-ric-grenell-over-anti-gay-posts-lashes-out/",
    "timestamp": "2025-05-29T18:09:53Z"
  },
  {
    "title": "Karoline Leavitt Freaks Out After Two Brutal Tariff Losses in 24 Hours",
    "description": "Washington doesn’t know what to do about its tariff plan anymore.\r\nComponents of the White House’s tariff plan were shot down by two different judges on Wednesday and Thursday, sending the Trump administration’s controversial economic strategy—and its subsequ…",
    "link": "https://newrepublic.com/post/195870/karoline-leavitt-donald-trump-two-tariff-losses-negotiations",
    "timestamp": "2025-05-29T18:08:57Z"
  },
  {
    "title": "State Department notifies Congress of reorganization plan with bigger cuts to programs and staff",
    "description": "The State Department has notified Congress of an updated reorganization of the massive agency",
    "link": "https://abcnews.go.com/US/wireStory/state-department-notifies-congress-reorganization-plan-bigger-cuts-122320313",
    "timestamp": "2025-05-29T18:06:47Z"
  },
  {
    "title": "Trump meets with the Federal Reserve chairman he has repeatedly scorned",
    "description": "President Donald Trump met with Federal Reserve Chair Jerome Powell and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said",
    "link": "https://abcnews.go.com/Business/wireStory/trump-meets-federal-reserve-chairman-repeatedly-scorned-122318422",
    "timestamp": "2025-05-29T18:06:26Z"
  },
  {
    "title": "I’m A Urologist: Something Isn’t Right With Biden’s Diagnosis",
    "description": "It is paramount that the American people trust that the commander-in-chief and candidate for the highest office in the country receives a comprehensive, complete, and transparent examination. This includes all of the necessary blood work, physical, and diagno…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319812/posts",
    "timestamp": "2025-05-29T18:04:57Z"
  },
  {
    "title": "Myriad Moves: Can Ethereum Stay Hot? Plus Predictions on the Polish Election and French Open",
    "description": "Myriad's most interesting markets this week include predictions on the price of Ethereum, the Polish election, and the French Open.",
    "link": "https://decrypt.co/322793/myriad-moves-ethereum-price-polish-election-french-open",
    "timestamp": "2025-05-29T18:04:43Z"
  },
  {
    "title": "Fed Chair Powell meets with Trump at the White House",
    "description": "Federal Reserve Chair Jerome Powell on Thursday met with President Donald Trump at the White House for the first time in the president's second term.\n\"At the President's invitation, Chair Powell met with the President today at the White House to discuss econo…",
    "link": "https://biztoc.com/x/21c854b6b4b06e89",
    "timestamp": "2025-05-29T18:04:13Z"
  },
  {
    "title": "Global Military Spending Surges As Arms Control Mechanisms Collapse",
    "description": "Global military spending surges as arms control mechanisms collapse.  What types of weapons are countries investing in, and why is this so dangerous?",
    "link": "https://www.forbes.com/sites/natashalindstaedt/2025/05/29/global-military-spending-surges-as-arms-control-mechanisms-collapse/",
    "timestamp": "2025-05-29T18:04:05Z"
  },
  {
    "title": "Trump meets with the Federal Reserve chairman he has repeatedly scorned",
    "description": "By CHRISTOPHER RUGABER, AP Economics Writer\nWASHINGTON (AP) — President Donald Trump met with Federal Reserve Chair Jerome Powell on Thursday and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said.\nRelated Articles\n \n \n \n …",
    "link": "https://biztoc.com/x/182f315350b9eda7",
    "timestamp": "2025-05-29T18:04:03Z"
  },
  {
    "title": "U.S. court ruling deals legal blow to Trump’s tariffs, but no relief for Canada just yet",
    "description": "The United States Court of International Trade dealt a legal blow to \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n ’s justification for \n \n \n \n \n \n tariffs\n \n \n \n \n \n on Wednesday, but industry watchers say it will ultimately not bring the \n \n \n \n \n \n U.S. trade war\n \n…",
    "link": "https://biztoc.com/x/dd4bebe2eea2498c",
    "timestamp": "2025-05-29T18:03:57Z"
  },
  {
    "title": "Harvard's international students get a temporary reprieve",
    "description": "A federal judge has handed President Donald Trump a loss in his battle against Harvard over international students.",
    "link": "https://biztoc.com/x/b3cceff0d6851525",
    "timestamp": "2025-05-29T18:03:40Z"
  },
  {
    "title": "White House Appeals Trade Court Ruling That Blocked Most Tariffs",
    "description": "The Trump administration reportedly asked the U.S. Court of Appeals to overturn a Wednesday (May 29) court ruling that largely blocked its tariffs and will take the case to the U.S. Supreme Court if the appeals court does not do so. The Justice Department sai…",
    "link": "http://www.pymnts.com/legal/2025/white-house-appeals-trade-court-ruling-that-blocked-most-tariffs/",
    "timestamp": "2025-05-29T18:03:18Z"
  },
  {
    "title": "White House Calls on Jill Biden to Testify to Congress Over 'Coverup'",
    "description": "Comer, a Republican from Kentucky, is calling for transcribed interviews with senior staffers from former President Biden's admin.",
    "link": "https://www.newsweek.com/white-house-calls-jill-biden-testify-congress-over-coverup-2078646",
    "timestamp": "2025-05-29T18:01:58Z"
  },
  {
    "title": "BREAKING: Obama Judge Rules Trump’s Tariffs Are Unlawful",
    "description": "A federal judge on Thursday issued a preliminary injunction and ruled President Trump’s tariffs are unlawful under the International Emergency Economic Powers Act (IEEPA). US District Judge Rudolph Contreras, an Obama appointee said Trump’s tariffs are “unlaw…",
    "link": "https://freerepublic.com/focus/f-news/4319811/posts",
    "timestamp": "2025-05-29T18:01:08Z"
  },
  {
    "title": "White House discloses who will lead DOGE efforts after Musk's departure",
    "description": "President Donald Trump and members of his Cabinet will continue to lead DOGE's efforts to slash waste, fraud and abuse in the federal government, the White House said.",
    "link": "https://www.foxnews.com/politics/white-house-discloses-who-lead-doge-efforts-after-musks-departure",
    "timestamp": "2025-05-29T18:00:56Z"
  },
  {
    "title": "Trump's pardon czar says Todd and Julie Chrisley were victims of a weaponized justice system",
    "description": "Trump's pardon czar Alice Marie Johnson defends pardoning Todd and Julie Chrisley, citing a weaponized justice system and their nonviolent first-time offenses.",
    "link": "https://www.foxnews.com/media/trumps-pardon-czar-says-todd-julie-chrisley-were-victims-weaponized-justice-system",
    "timestamp": "2025-05-29T18:00:38Z"
  },
  {
    "title": "Fox Contributor Mollie Hemingway Opens White House Press Briefing By Complaining About Media Coverage of Trump",
    "description": "Federalist editor-in-chief Mollie Hemingway called out members of the media to their faces from the \"new media seat\" at Thursday's White House press briefing.\nThe post Fox Contributor Mollie Hemingway Opens White House Press Briefing By Complaining About Medi…",
    "link": "https://www.mediaite.com/media/news/fox-contributor-mollie-hemingway-opens-white-house-press-briefing-by-complaining-about-media-coverage-of-trump/",
    "timestamp": "2025-05-29T18:00:26Z"
  },
  {
    "title": "U.S. court ruling deals legal blow to Trump’s tariffs, but no relief for Canada just yet",
    "description": "The court dealt a legal blow to Donald Trump’s justification for tariffs, but it will ultimately not bring the trade war to an end. Read on.",
    "link": "https://financialpost.com/news/economy/court-ruling-legal-blow-trump-tariffs-no-relief",
    "timestamp": "2025-05-29T18:00:24Z"
  },
  {
    "title": "Musk-Altman AI rivalry is complicating Trump's dealmaking in Middle East",
    "description": "Elon Musk tried to derail a major AI infrastructure deal in the Middle East, a source confirmed to CNBC",
    "link": "https://www.cnbc.com/2025/05/29/musk-altman-ai-rivalry-complicating-trumps-dealmaking-in-middle-east.html",
    "timestamp": "2025-05-29T18:00:10Z"
  },
  {
    "title": "The Christian Right’s 250-Year Fight Against America",
    "description": "Many religious groups have wanted to destroy liberal democracy, explains author Jerome Copulsky. But before Trump, none had taken power.",
    "link": "https://inthesetimes.com/article/christian-right-founding-fathers-conservative-movement-trump-american-heretics",
    "timestamp": "2025-05-29T18:00:00Z"
  },
  {
    "title": "Trump’s War on Leaks: Is Journalism the Next Casualty?",
    "description": "When Donald Trump returned to office in 2025, he vowed to “end the weaponization of government censorship once and for all.” His Executive Order — Restoring Freedom of Speech and Ending Federal Censorship — was welcomed by many, including myself. As a journal…",
    "link": "https://www.activistpost.com/trumps-war-on-leaks-is-journalism-the-next-casualty/",
    "timestamp": "2025-05-29T18:00:00Z"
  },
  {
    "title": "‘The Rookie’ Creator Alexi Hawley on How and Why Broadcast TV Is Attracting a Younger Audience, Now More Than Ever",
    "description": "The first time it happened was during the strike. A writer came up to me on the picket line to tell me that their 13-year-old loved “The Rookie.” Since then, I’ve heard that same sentiment over and over again (with the age often lowered to 10 and 11). I have …",
    "link": "https://variety.com/2025/tv/news/alexi-hawley-broadcast-tv-the-rookie-1236409441/",
    "timestamp": "2025-05-29T18:00:00Z"
  },
  {
    "title": "Europe is trying to put pressure on Israel to stop the Gaza slaughter. Will Trump let them?",
    "description": "Netanyahu is facing increasing pressure from European states, including the threat of sanctions. The unanswered question is whether Trump will actually let Europe take action, or will he once again shield Israel from any accountability.",
    "link": "https://mondoweiss.net/2025/05/europe-is-trying-to-put-pressure-on-israel-to-stop-the-gaza-slaughter-will-trump-let-them/",
    "timestamp": "2025-05-29T18:00:00Z"
  },
  {
    "title": "Harvard commencement speaker pushes message of unity amid university's battle with Trump",
    "description": "Harvard’s commencement celebrated diversity and truth amid legal battles with the Trump administration, marking a defiant moment for the university.",
    "link": "https://www.nbcnews.com/news/us-news/harvard-2025-commencement-diversity-legal-battle-trump-rcna209672",
    "timestamp": "2025-05-29T17:59:39Z"
  },
  {
    "title": "The Obama Wing of Democratic Party Is Losing Power and Prestige",
    "description": "There is no such thing as a \"normal\" president--there have only been 45 people in history to have held the job and \"normal\" people don't rise to that level of political power. But some presidents are more normal than others. You have the machine politicians l…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319810/posts",
    "timestamp": "2025-05-29T17:59:08Z"
  },
  {
    "title": "Fox's Doocy grills Leavitt on new ruling: 'Ask Republicans... to make a new law'",
    "description": "White House correspondent Peter Doocy asked Press Secretary Karoline Leavitt why President Donald Trump did not ask Republicans in control of Congress to \"make a new law\" after a panel of judges struck down his ability to impose emergency tariffs.\"So many of …",
    "link": "https://www.rawstory.com/leavitt-doocy-tariff-ruling-grill/",
    "timestamp": "2025-05-29T17:56:58Z"
  },
  {
    "title": "Second Federal Court in Less Than 24 Hours Strikes Down 'Unlawful' Trump Tariffs",
    "description": "For the second time in less than 24 hours, a federal court Thursday blocked tariffs imposed by President Donald Trump earlier this year, ruling he exceeded his presidential authority with the sweeping and arbitrary nature of the orders.U.S District Judge Rudo…",
    "link": "https://www.commondreams.org/news/trump-tariffs-struck-down",
    "timestamp": "2025-05-29T17:56:24Z"
  },
  {
    "title": "Federal court blocks Trump from imposing sweeping tariffs under emergency powers law",
    "description": "A federal court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law",
    "link": "https://www.wsbtv.com/news/federal-court-blocks/XHEBUTB5LJHRFONIE4W5ULYGME/",
    "timestamp": "2025-05-29T17:56:11Z"
  },
  {
    "title": "The Trump administration's 'MAHA Report' cites nonexistent scientific studies (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nThe Trump administration's ‘MAHA Report’ cites nonexistent scientific studies  —  There's new evidence that the White House's “The MAHA Report: Making Our Children Healthy Again” relied in part on scientific research that doesn't exist.  …",
    "link": "https://www.memeorandum.com/250529/p73",
    "timestamp": "2025-05-29T17:55:01Z"
  },
  {
    "title": "Trump meets with the Federal Reserve chairman he has repeatedly scorned",
    "description": "They discussed the economy but not interest rates.",
    "link": "https://www.bostonherald.com/2025/05/29/trump-federal-reserve-powell/",
    "timestamp": "2025-05-29T17:54:49Z"
  },
  {
    "title": "Trump Pardons Military Officer Mark Bashaw Who Refused To Follow COVID Mandates",
    "description": "President Donald Trump pardoned former 1st Lt. Mark Bashaw after he was convicted in 2022 for violating COVID-19 mandates.",
    "link": "https://dailycaller.com/2025/05/29/donald-trump-mark-bashaw-michael-grimm-john-rowland-pardons-clemency-covid-19/",
    "timestamp": "2025-05-29T17:54:12Z"
  },
  {
    "title": "Source: The Fix Was In (Two Weeks Ago) to Torpedo Trump’s Tariffs in New York Trade Court",
    "description": "The fix appears to be in for two court cases against President Donald Trump’s tariffs, according to a very knowledgeable source. Last month, five domestic businesses filed a lawsuit in a little known trade court in New York challenging Trump’s tariffs, arguin…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319809/posts",
    "timestamp": "2025-05-29T17:53:41Z"
  },
  {
    "title": "Trump meets with Jerome Powell, the Federal Reserve chair he has repeatedly scorned",
    "description": "President Donald Trump met with Federal Reserve Chair Jerome Powell on Thursday and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said. Powell told Trump that the central bank would make decisions about the short-term inte…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-meets-with-jerome-powell-the-federal-20351577.php",
    "timestamp": "2025-05-29T17:53:36Z"
  },
  {
    "title": "The Guardian view on Trump’s tariffs: the courts have drawn a line. So must Congress | Editorial",
    "description": "The worst of all outcomes would be for US legislators to agree to strengthen the president’s executive powers\nIf one thing is more challenging to the rule of law than a genuine emergency, it is the invention of a phoney one. Since returning to the White House…",
    "link": "https://biztoc.com/x/cf14968f5e20fdec",
    "timestamp": "2025-05-29T17:52:53Z"
  },
  {
    "title": "WH: Trump wants to see Ukraine conflict solved",
    "description": "White House Press Secretary Karoline Leavitt said on Thursday that United States President Donald Trump wants the conflict between Russia and Ukraine to be solved \"on the negotiating table, not on the...",
    "link": "https://biztoc.com/x/d882a837d745d725",
    "timestamp": "2025-05-29T17:52:49Z"
  },
  {
    "title": "Trump Commutes Sentence of Larry Hoover, Pardons Rapper NBA YoungBoy, Others",
    "description": "President Donald Trump commuted the federal sentence of former Chicago gang leader Larry Hoover on Wednesday and issued pardons for others.\nThe post Trump Commutes Sentence of Larry Hoover, Pardons Rapper NBA YoungBoy, Others appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/29/trump-commutes-sentence-of-larry-hoover-pardons-mark-charles-bashaw/",
    "timestamp": "2025-05-29T17:51:50Z"
  },
  {
    "title": "Trump Rightly Pardons 2 Florida Divers Who Became Federal Felons Because of an Honest Mistake",
    "description": "Here are some things you don't do when you know you are committing a crime. You don't do it in broad daylight in front of witnesses. You don't enlist the",
    "link": "https://reason.com/2025/05/29/trump-rightly-pardons-2-florida-divers-who-became-federal-felons-because-of-an-honest-mistake/",
    "timestamp": "2025-05-29T17:51:06Z"
  },
  {
    "title": "In a victory for Palmer Luckey, Meta and Anduril work on mixed reality headsets for the military | TechCrunch",
    "description": "Anduril and Meta plan to build VR/AR extended reality headsets for the military as part of the the contract that Anduril took over from Microsoft.",
    "link": "https://techcrunch.com/2025/05/29/in-a-victory-for-palmer-luckey-meta-and-anduril-work-on-mixed-reality-headsets-for-the-military/",
    "timestamp": "2025-05-29T17:49:48Z"
  },
  {
    "title": "Karoline Leavitt Comes Out Swinging Against Judges Who ‘Usurped’ Trump’s Power to Impose Tariffs",
    "description": "White House Press Secretary Karoline Leavitt began Thursday's briefing by railing against judges for blocking President Donald Trump's tariffs.\nThe post Karoline Leavitt Comes Out Swinging Against Judges Who ‘Usurped’ Trump’s Power to Impose Tariffs first app…",
    "link": "https://www.mediaite.com/politics/karoline-leavitt-comes-out-swinging-against-judges-who-usurped-trumps-power-to-impose-tariffs/",
    "timestamp": "2025-05-29T17:49:20Z"
  },
  {
    "title": "Trump personally told Fed Chair Powell it was a mistake to not lower rates, White House says",
    "description": "President Donald Trump told Federal Reserve Chair Jerome Powell in a private meeting on Thursday that he was making a \"mistake\" by not lowering key interest ...",
    "link": "https://finance.yahoo.com/news/trump-personally-told-fed-chair-174856584.html",
    "timestamp": "2025-05-29T17:48:56Z"
  },
  {
    "title": "MIT President Shuts Down University's DEI Office as Trump Admin Investigates Alleged Racial Discrimination",
    "description": "The Massachusetts Institute of Technology's (MIT) diversity, equity, and inclusion (DEI) office is no more following a lengthy assessment, the news coming as President Donald Trump's administration works to combat such practices.\nThe post MIT President Shuts …",
    "link": "https://www.breitbart.com/education/2025/05/29/mit-president-shuts-down-universitys-dei-office-as-trump-admin-investigates-alleged-racial-discrimination/",
    "timestamp": "2025-05-29T17:48:08Z"
  },
  {
    "title": "Franklin Graham Meets Ukraine's Zelensky: 'Only God Can Solve This'",
    "description": "Franklin Graham, president of the Billy Graham Evangelistic Association and Samaritan’s Purse, met with Ukrainian President Volodymyr Zelensky in Berlin on Wednesday.\nThe post Franklin Graham Meets Ukraine’s Zelensky: ‘Only God Can Solve This’ appeared first …",
    "link": "https://www.breitbart.com/faith/2025/05/29/franklin-graham-meets-ukraines-zelensky-only-god-can-solve-this/",
    "timestamp": "2025-05-29T17:48:03Z"
  },
  {
    "title": "Surge of ICE agreements with local police aim to increase deportations, but many police forces have found they undermine public safety",
    "description": "History shows that building the trust of immigrants is an effective tactic in combating local crime and making entire communities safer.",
    "link": "https://theconversation.com/surge-of-ice-agreements-with-local-police-aim-to-increase-deportations-but-many-police-forces-have-found-they-undermine-public-safety-255937",
    "timestamp": "2025-05-29T17:47:33Z"
  },
  {
    "title": "Harvard's international students get a temporary reprieve",
    "description": "A federal judge has handed President Donald Trump a loss in his battle against Harvard over international students.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-harvard-injunction-international-students-rcna209504",
    "timestamp": "2025-05-29T17:47:00Z"
  },
  {
    "title": "People can't believe who young boy is that went on to become one of most famous people in world",
    "description": "People who've seen a photo of a young Donald Trump can't believe they're looking at the man who would grow up to be one of the world's most notorious people",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-as-child-picture-270927-20250529",
    "timestamp": "2025-05-29T17:46:15Z"
  },
  {
    "title": "Fed Says Powell Met With Trump at White House",
    "description": "Federal Reserve Chair Jerome Powell met with President Donald Trump at the White House, their first such meeting since the ...",
    "link": "https://biztoc.com/x/f2fccb8bc815c5c2",
    "timestamp": "2025-05-29T17:45:44Z"
  },
  {
    "title": "INVESTIGATION: How Chinese 'Infiltrators' Are at Center of Fresh U.S. Spy Ring Fears — By Using James Bond Hotel to 'Monitor America’",
    "description": "The iconic British Colonial Hotel in Nassau, Bahamas, is now at the center of what may be a spy ring ran by the Chinese, and America is concerned.",
    "link": "https://radaronline.com/p/chinese-spy-ring-james-bond-hotel-british-colonial-nassau/",
    "timestamp": "2025-05-29T17:45:00Z"
  },
  {
    "title": "Liberals freaked out over Vance's Munich speech. Just wait till they read the State Department's Substack.",
    "description": "The US under President Donald Trump has once again taken up the mantle of Western civilization. The State Department raised some eyebrows when it launched a Substack last month. Its latest Substack essay highlighting both the importance of renewing Western ci…",
    "link": "https://freerepublic.com/focus/f-news/4319806/posts",
    "timestamp": "2025-05-29T17:43:58Z"
  },
  {
    "title": "Trump Commutes Sentence of ‘Gangster Disciples’ Founder",
    "description": "In one of his most unorthodox moves to date, President Donald Trump commuted the federal life sentences of ex-convict Larry Hoover, 74, who was a... Read More\nThe post Trump Commutes Sentence of ‘Gangster Disciples’ Founder appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/29/trump-commutes-sentence-of-gangster-disciples-founder/",
    "timestamp": "2025-05-29T17:43:02Z"
  },
  {
    "title": "Washington bishops sue over law forcing priests to violate seal of confession",
    "description": "null / Credit: asiandelight/Shutterstock\n\nCNA Staff, May 29, 2025 / 13:42 pm (CNA).\nThe Catholic bishops of Washington state filed a lawsuit Thursday challenging a new law that requires priests to report child abuse learned during the sacrament of confession …",
    "link": "https://www.catholicnewsagency.com/news/264407/washington-bishops-sue-over-law-forcing-priests-to-violate-seal-of-confession",
    "timestamp": "2025-05-29T17:42:00Z"
  },
  {
    "title": "Powell Meets Trump, Rebuffs Pressure On Rate Cuts",
    "description": "Federal Reserve Chair Jerome Powell met with President Donald Trump at the White House to discuss the U.S. economy, but pushed back on calls for interest rate cuts, the Fed said in a statement. \nThe central bank noted that Powell “did not discuss his expectat…",
    "link": "https://biztoc.com/x/9ca7c6f86a32577f",
    "timestamp": "2025-05-29T17:41:47Z"
  },
  {
    "title": "WH: Trump told Powell not cutting rates is a mistake",
    "description": "White House Press Secretary Karoline Leavitt said on Thursday that United States President Donald Trump told Federal Reserve Chair Jerome Powell during their meeting earlier in the day that he thinks ...",
    "link": "https://biztoc.com/x/205cf4bd84f9c95e",
    "timestamp": "2025-05-29T17:41:44Z"
  },
  {
    "title": "Penn ceases gender-affirming surgery for patients under age 19",
    "description": "The move comes after an executive order from President Donald Trump that directed agencies to cease grants and other funding that could be used for gender-affirming care.",
    "link": "https://www.inquirer.com/health/penn-medicine-ends-gender-affirming-surgery-20250529.html",
    "timestamp": "2025-05-29T17:41:41Z"
  },
  {
    "title": "Economists blame Trump tariffs, AI explosion for threatening global economy",
    "description": "Businesses need to adopt AI, says WEF, but uncertainty is a blocker\nThere are two things keeping chief economists awake around the globe, if the World Economic Forum's latest survey is any indicator: US President Donald Trump's trade policies and AI.…",
    "link": "https://biztoc.com/x/293adde423df41db",
    "timestamp": "2025-05-29T17:41:32Z"
  },
  {
    "title": "Trump's super-charged pardon push raises eyebrows and concerns",
    "description": "During his first term, President Donald Trump peppered his tenure with controversial pardons to friends and notables whose freedom was as much a byproduct of their personal proximity to the Oval Office as anything else. Now, Trump's penchant for politically m…",
    "link": "https://biztoc.com/x/492e10177aa4674c",
    "timestamp": "2025-05-29T17:41:28Z"
  },
  {
    "title": "Judge extends order blocking Trump's attempt to bar Harvard from enrolling foreign students",
    "description": "Harvard graduates celebrated commencement on Thursday at a pivotal time for the Ivy League school, as a federal judge extended an order blocking President Donald Trump administration's attempt to bar the university from enrolling foreign students.",
    "link": "https://www.cbc.ca/news/world/harvard-graduation-court-hearing-1.7547046",
    "timestamp": "2025-05-29T17:41:02Z"
  },
  {
    "title": "After 2024 Losses, San Francisco Democrats Want to Focus More on Men. Will It Land?",
    "description": "San Francisco’s Democratic Party passed a resolution on Wednesday night urging Democrats to acknowledge and address issues facing boys and young men, the majority of whom voted for Donald Trump in 2024.",
    "link": "https://www.kqed.org/news/12041884/after-2024-losses-san-francisco-democrats-want-to-focus-more-on-men-will-it-land",
    "timestamp": "2025-05-29T17:40:13Z"
  },
  {
    "title": "‘Bias Reigns’: Most Americans ‘Definitely Agree’ With Trump There’s a Big Problem in Higher Ed in New Poll",
    "description": "A new CNN poll shows confidence in higher education has collapsed, with most Americans agreeing with Trump that colleges have a serious bias problem.\nThe post ‘Bias Reigns’: Most Americans ‘Definitely Agree’ With Trump There’s a Big Problem in Higher Ed in Ne…",
    "link": "https://www.mediaite.com/media/tv/bias-reigns-most-americans-definitely-agree-with-trump-theres-a-big-problem-in-higher-ed-in-new-poll/",
    "timestamp": "2025-05-29T17:38:40Z"
  },
  {
    "title": "Trump Slaps Down CBS News Lawsuit Settlement Offer - He Wants More Than Money",
    "description": "President Donald Trump has rejected a settlement offer from CBS related to its editing of a Kamala Harris interview last year.",
    "link": "https://www.westernjournal.com/trump-slaps-cbs-news-lawsuit-settlement-offer-wants-money/",
    "timestamp": "2025-05-29T17:38:31Z"
  },
  {
    "title": "Contrarian Commercial Real Estate Investors Can’t Get Enough of the Uncertainty",
    "description": "On May 19, 2025, the commercial real estate capital markets might have inaugurated a new era.  That afternoon, RXR CEO and Chairman Scott Rechler signed a letter of intent to buy 590 Madison Avenue, a 1 million-square-foot office property in the heart of Midt…",
    "link": "http://commercialobserver.com/2025/05/contrarian-commercial-real-estate-investors-uncertainty/",
    "timestamp": "2025-05-29T17:37:59Z"
  },
  {
    "title": "Karl Rove Says This ‘Muddled Mess’ Trump Policy Will Cost The GOP Next Year’s Midterms",
    "description": "“Voters won’t blame foreign countries for higher prices or fewer goods. They’ll blame Donald Trump and his Republican Party,” Karl Rove said.",
    "link": "https://www.huffpost.com/entry/karl-rove-trump-tariff-hits-gop-midterm_n_6838869ee4b06202aa916fdd",
    "timestamp": "2025-05-29T17:37:30Z"
  },
  {
    "title": "Kash Patel: Comey’s ’86 47′ stunt triggered flood of copycats",
    "description": "People think they can threaten the president 'because he did it'",
    "link": "https://www.wnd.com/2025/05/kash-patel-comeys-86-47-stunt-triggered-flood-of-copycats/",
    "timestamp": "2025-05-29T17:36:55Z"
  },
  {
    "title": "White House slams 'blatantly wrong' court decision blocking Trump tariffs",
    "description": "A federal court has blocked many of President Trump's tariffs, deeming them an overreach of executive authority, a move the White House fiercely contests and plans to appeal. This ruling, impacting numerous countries, has sparked reactions from China, Canada,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-slams-blatantly-wrong-court-decision-blocking-trump-tariffs/articleshow/121496692.cms",
    "timestamp": "2025-05-29T17:36:53Z"
  },
  {
    "title": "Cosmetics company E.l.f acquires Hailey Bieber’s Rhode beauty brand for $1 billion",
    "description": "E.l.f. Beauty has acquired Hailey Bieber’s Rhode beauty brand in a $1 billion deal.",
    "link": "https://www.bostonherald.com/2025/05/29/elf-acquires-rhode-hailey-bieber/",
    "timestamp": "2025-05-29T17:36:03Z"
  },
  {
    "title": "Hegseth guts the Pentagon's weapons testing office",
    "description": "A sweeping reorganization is weakening the Pentagon office that tests weapons before they get into soldiers' hands.",
    "link": "https://www.businessinsider.com/hegseth-announces-cuts-at-pentagons-weapons-testing-office-2025-5",
    "timestamp": "2025-05-29T17:35:50Z"
  },
  {
    "title": "Economists blame Trump tariffs, AI explosion for threatening global economy",
    "description": "Businesses need to adopt AI, says WEF, but uncertainty is a blocker\nThere are two things keeping chief economists awake around the globe, if the World Economic Forum's latest survey is any indicator: US President Donald Trump's trade policies and AI.…",
    "link": "https://www.theregister.com/2025/05/29/economists_blame_trump_tariffs_ai/",
    "timestamp": "2025-05-29T17:34:11Z"
  },
  {
    "title": "Meta and Anduril defense startup partner on VR, AR project intended for U.S. Army",
    "description": "Meta and Anduril defense-tech startup founded by Palmer Luckey formed a partnership to create virtual reality and augmented reality devices for the U.S. army.",
    "link": "https://www.cnbc.com/2025/05/29/meta-anduril-partner-on-vr-ar-project-intended-for-us-army.html",
    "timestamp": "2025-05-29T17:34:10Z"
  },
  {
    "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
    "description": "Brockbank asked for a sentence of time served.",
    "link": "https://www.bostonherald.com/2025/05/29/election-officials-threats/",
    "timestamp": "2025-05-29T17:31:48Z"
  },
  {
    "title": "Trump's super-charged pardon push raises eyebrows and concerns",
    "description": "Never shy about using his pardon ability for political leverage, Trump's spate of amnesty announcements suggests the White House is taking things to a new level",
    "link": "https://theweek.com/politics/trump-pardon-martin-chrisley-public-integrity",
    "timestamp": "2025-05-29T17:31:46Z"
  },
  {
    "title": "Will There Be a Trump Tariff Refund?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe federal court ruling aimed at striking down the majority of President Donald Trump's tariffs could force the government to pay back billions of dollars in import duties that have already been collected.\nNe…",
    "link": "https://biztoc.com/x/daef053ba5df4604",
    "timestamp": "2025-05-29T17:30:19Z"
  },
  {
    "title": "Shifting Baselines and the New Normal of the Trump Era",
    "description": "Among a number of things I’ve read online that I think about all the time is David Roberts’ 2020 piece for Vox about",
    "link": "https://kottke.org/25/05/shifting-baselines-and-the-new-normal-of-the-trump-era",
    "timestamp": "2025-05-29T17:28:16Z"
  },
  {
    "title": "Trump Met with Fed Chair",
    "description": "Federal Reserve Chair Jerome Powell met with President Donald Trump at the White House this morning on the president’s request, according to a Fed statement. From the statement: \"Chair Powell said that he and his",
    "link": "https://politicalwire.com/2025/05/29/trump-met-with-fed-chair/",
    "timestamp": "2025-05-29T17:28:14Z"
  },
  {
    "title": "Legal expert shows how GOP Supreme Court justices are like a 'Mean Girls' clique",
    "description": "University of Michigan Law School Professor Leah Litman spoke to Mehdi Hasan on Thursday about her new book, which details the way that conservatives on the Supreme Court have \"embraced\" \"unabashed lawlessness.\" The book, Lawless: How the Supreme Court Runs o…",
    "link": "https://www.rawstory.com/supreme-court-mean-girls-2672230202/",
    "timestamp": "2025-05-29T17:26:47Z"
  },
  {
    "title": "Trump immigration enforcement hampered by detention capacity, Florida sheriff warns",
    "description": "A Florida sheriff said law enforcement is \"waiting at go\" to assist the Trump administration with immigration enforcement, but worries about the lack of detention capacity.",
    "link": "https://nypost.com/2025/05/29/us-news/trump-immigration-enforcement-hampered-by-detention-capacity-florida-sheriff-warns/",
    "timestamp": "2025-05-29T17:26:19Z"
  },
  {
    "title": "Jake Tapper Slams ‘Problematic’ Lawfare Against Trump — and the Media for Indulging It",
    "description": "CNN's Jake Tapper called out the legal action taken against Donald Trump by New York Attorney General Letitia James and Manhattan District Attorney Alvin Bragg.\nThe post Jake Tapper Slams ‘Problematic’ Lawfare Against Trump — and the Media for Indulging It fi…",
    "link": "https://www.mediaite.com/media/news/jake-tapper-slams-problematic-lawfare-against-trump-and-the-media-for-indulging-it/",
    "timestamp": "2025-05-29T17:25:57Z"
  },
  {
    "title": "Map shows states with the highest increase in unemployment",
    "description": "Massachusetts and Connecticut saw the highest jumps in unemployment percentage of all the states.",
    "link": "https://www.newsweek.com/map-shows-states-highest-increase-unemployment-2078612",
    "timestamp": "2025-05-29T17:24:52Z"
  }
]