[
  {
    "title": "Is the US making a great gamble to reshape Iraq?",
    "description": "The Trump administration seeks to recalibrate US influence in the Middle East and wants to 'make Iraq great again'.",
    "link": "https://www.aljazeera.com/opinions/2025/12/22/is-the-us-making-a-great-gamble-to-reshape-iraq",
    "timestamp": "2025-12-22T07:37:30Z"
  },
  {
    "title": "Flight rules make ‘Home Alone 2’ plot less plausible today",
    "description": "The “Home Alone” movies turned holiday travel chaos into comedy",
    "link": "https://abcnews.go.com/US/wireStory/home-2-nailed-holiday-travel-chaos-flight-rules-128611455",
    "timestamp": "2025-12-22T07:32:54Z"
  },
  {
    "title": "German auto exports hit hard by Trump tariffs - study",
    "description": "German car exports to the US slumped by almost 14% in the first three quarters of 2025, making it the hardest-hit branch of German industry in US President Donald Trump's trade war, according to a study seen by Reuters today.",
    "link": "https://www.rte.ie/news/business/2025/1222/1550131-german-car-exports/",
    "timestamp": "2025-12-22T07:22:28Z"
  },
  {
    "title": "Venezuela Honoring Obligations to US Despite Tanker Seizures - Vice President",
    "description": "MEXICO CITY (Sputnik) - Venezuela continues to ship oil to the United States, despite the seizure of tankers carrying Venezuelan crude by the US military, Vice President Delcy Rodriguez said on Monday.",
    "link": "https://sputnikglobe.com/20251222/venezuela-honoring-obligations-to-us-despite-tanker-seizures---vice-president-1123343437.html",
    "timestamp": "2025-12-22T07:05:25Z"
  },
  {
    "title": "Southeast Asia bloc meets to press Thailand, Cambodia on truce",
    "description": "Renewed fighting this month has killed at least 22 people in Thailand and 19 in Cambodia, and displaced more than 900,000 on both sides, officials said.",
    "link": "https://www.channelnewsasia.com/asia/cambodia-thailand-tensions-asean-talks-truce-ceasefire-kl-5667541",
    "timestamp": "2025-12-22T07:03:09Z"
  },
  {
    "title": "Vance refuses to set red lines over bigotry at Turning Point USA's convention",
    "description": "Vice President JD Vance acknowledged the controversies that dominated the Turning Point conference, but he did not define any boundaries for the conservative movement besides patriotism.",
    "link": "https://www.npr.org/2025/12/22/g-s1-103284/vance-at-turning-point",
    "timestamp": "2025-12-22T06:53:43Z"
  },
  {
    "title": "Confusion at NATO: Rutte, Russia and Delusions about Trump",
    "description": "It was a speech unhinged in millenarian zeal.  It was unapologetically hysterical in urging war while claiming to protect peace.  It was also delivered with a note of profound self-denial: the US administration’s 2025 National Security Strategy had belittled …",
    "link": "https://www.counterpunch.org/2025/12/22/confusion-at-nato-rutte-russia-and-delusions-about-trump/",
    "timestamp": "2025-12-22T06:53:30Z"
  },
  {
    "title": "US visa restrictions not to penalise Nigerians — Envoy",
    "description": "The US Ambassador clarifies that recent US visa restrictions are for security, not to penalize Nigerians. Learn about the new measures and exemptions.\n\nRead More: https://punchng.com/us-visa-restrictions-not-to-penalise-nigerians-envoy/",
    "link": "https://punchng.com/us-visa-restrictions-not-to-penalise-nigerians-envoy/",
    "timestamp": "2025-12-22T06:52:48Z"
  },
  {
    "title": "German auto exports hit hard by Trump tariffs, study shows",
    "description": "BERLIN, Dec 22 (Reuters) - German car exports to the United States slumped by almost 14% in the first three quarters of 2025, making it the hardest-hit...",
    "link": "https://uk.finance.yahoo.com/news/german-auto-exports-hit-hard-063844479.html",
    "timestamp": "2025-12-22T06:38:44Z"
  },
  {
    "title": "CBS News chief Bari Weiss pulls '60 Minutes' story, sparking outcry",
    "description": "CBS News Editor-in-Chief Bari Weiss pulled a 60 Minutes segment on allegations of abuses at an El Salvador detention center where the Trump administration sent hundreds of Venezuelan migrants.",
    "link": "https://www.npr.org/2025/12/22/g-s1-103282/cbs-chief-bari-weiss-pulls-60-minutes-story",
    "timestamp": "2025-12-22T06:31:28Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*Honduran Vote Count Finalizing Amid US Visa Sanctions*I Left The \"FBI\" Too*Taiwan A New Ukraine*Rob Reiner Dead Am I Next?*Is MAGA \"One Toke Over The Line\"?*Wiles Spins The Files*Great Joy*",
    "description": "Newsdump Alert: A Second Release Of Jeffrey Epstein Related Files... Newsdump Alert: Almost Complete Honduran Vote Count Revealed This Weekend As US Sanctions Honduran Officials Over Vote Count... Newsdump Alert: Syrian War Monitoring Group Says US Has Killed…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358503/posts",
    "timestamp": "2025-12-22T06:30:21Z"
  },
  {
    "title": "US Catholic bishops president says deportations instilling 'fear' in 'widespread manner': 'Concerns us all'",
    "description": "Archbishop Paul Coakley criticized President Donald Trump's mass deportations for spreading fear and uncertainty in immigrant communities.",
    "link": "https://www.foxnews.com/politics/us-catholic-bishops-president-says-deportations-instilling-fear-widespread-manner-concerns-us-all",
    "timestamp": "2025-12-22T06:25:12Z"
  },
  {
    "title": "Irish woman held by ICE freed after court hearing",
    "description": "An Irish citizen who had been held by immigration authorities in the United States for almost five months has been freed and is back at the family home in Missouri.",
    "link": "https://www.rte.ie/news/ireland/2025/1222/1550121-hughes-brown-ireland/",
    "timestamp": "2025-12-22T06:21:48Z"
  },
  {
    "title": "CPC tag won’t weaken US, Nigeria ties — Congress",
    "description": "A US Congressional delegation reassures Nigeria that its CPC designation for religious freedom is to encourage reform and will not weaken US, Nigeria relat\n\nRead More: https://punchng.com/cpc-tag-wont-weaken-us-nigeria-ties-congress/",
    "link": "https://punchng.com/cpc-tag-wont-weaken-us-nigeria-ties-congress/",
    "timestamp": "2025-12-22T06:21:45Z"
  },
  {
    "title": "Cambodia-Thai tensions: Asean must to diffuse situation, says Tok Mat",
    "description": "KUALA LUMPUR: As tensions rise between Thailand and Cambodia, Asean must do whatever is necessary to maintain regional peace and stability, says Datuk Seri Mohamad Hasan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/12/22/cambodia-thai-tensions-asean-must-to-diffuse-situation-says-tok-mat",
    "timestamp": "2025-12-22T06:21:00Z"
  },
  {
    "title": "Trump Taps Louisiana Gov To Serve As U.S. Special Envoy To Greenland",
    "description": "The president has not ruled out military force to take control of the mineral-rich, strategically located Arctic island.",
    "link": "https://www.huffpost.com/entry/trump-greenland-jeff-landry_n_6948de85e4b0133565314955",
    "timestamp": "2025-12-22T06:05:18Z"
  },
  {
    "title": "VIDEO: Why I spoke out for Nigerian Christians — Nicki Minaj",
    "description": "Rapper Nicki Minaj explains her decision to speak out on the persecution of Nigerian Christians, citing personal ties and reports of violence.\n\nRead More: https://punchng.com/video-why-i-spoke-out-for-nigerian-christians-nicki-minaj/",
    "link": "https://punchng.com/?p=2016483",
    "timestamp": "2025-12-22T06:05:14Z"
  },
  {
    "title": "Trump shook up global trade this year; some uncertainty may persist in 2026",
    "description": "Dec 22 () - President Donald Trump's return to the White House in 2025 kicked off a frenetic year for global trade, with waves of tariffs on U. trading...",
    "link": "https://finance.yahoo.com/news/trump-shook-global-trade-uncertainty-060313193.html",
    "timestamp": "2025-12-22T06:03:13Z"
  },
  {
    "title": "Southeast Asia bloc meets to press Thailand, Cambodia on truce",
    "description": "Southeast Asian foreign ministers met Monday in Malaysia for crisis talks aimed at halting deadly border clashes between Thailand and Cambodia, which pressed on despite regional and international diplomacy. Renewed fighting this month has killed at least 22 p…",
    "link": "https://www.digitaljournal.com/world/southeast-asia-bloc-meets-to-press-thailand-cambodia-on-truce-2/article",
    "timestamp": "2025-12-22T06:02:20Z"
  },
  {
    "title": "DOJ releases new batch of Epstein files amid intensifying legal and political firestorm",
    "description": "The DOJ released 119 pages of Jeffrey Epstein-related grand jury materials with “minimal redactions,” following intense criticism for initially publishing a fully redacted version of the same file. The release is a response to the Epstein Files Transparency A…",
    "link": "https://www.naturalnews.com/2025-12-22-doj-releases-new-batch-of-epstein-files.html",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "Netanyahu to seek Trump’s approval for new Iran strikes at Mar-a-Lago meeting",
    "description": "Netanyahu will ask Trump for approval to strike Iran’s missile program. Israeli intelligence warns Iran is rapidly rebuilding missile production. Iran’s missile arsenal is now seen as a more immediate threat than its nuclear program. A previous Iranian missil…",
    "link": "https://www.naturalnews.com/2025-12-22-netanyahu-trump-approval-iran-strikes-meeting.html",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "Trump administration escalates denaturalization efforts, targeting immigrants with criminal convictions",
    "description": "The Trump DOJ is prioritizing stripping citizenship from naturalized immigrants convicted of serious crimes (terrorism, violent offenses, financial fraud). Denaturalization cases have tripled since 2016, with USCIS now pushing for 100–200 cases per month in F…",
    "link": "https://www.naturalnews.com/2025-12-22-trump-admin-targets-immigrants-with-criminal-convictions.html",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "Record U.S. arms sale to Taiwan escalates tensions; China warns of “military confrontation”",
    "description": "The Trump administration approved an unprecedented $11.1 billion weapons package for Taiwan, the largest U.S. arms sale to the island, including advanced missile systems capable of striking deep into mainland China. Beijing condemned the sale, warning it turn…",
    "link": "https://www.naturalnews.com/2025-12-22-us-arms-sale-taiwan-china-military-confrontation.html",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "Eoin Lenihan’s Vandalising Ireland proposes an idiosyncratic new direction for Ireland",
    "description": "Unthinkable: We’re all anti-globalist now: an idea of the left has became a rallying call of the right",
    "link": "https://www.irishtimes.com/opinion/2025/12/22/joe-humphreys-on-eoin-lenihans-idiosyncratic-new-direction-for-ireland/",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "Trump halts Diversity Visa Lottery following revelations that the Brown University and MIT shooter exploited flawed program to enter U.S.",
    "description": "The Trump administration suspended the Diversity Visa Lottery Program following revelations that the shooter responsible for the Brown University and MIT killings entered the U.S. through the program. The administration argues the program lacks sufficient vet…",
    "link": "https://www.naturalnews.com/2025-12-22-trump-halts-diversity-visa-lottery-brown-mit-gunman.html",
    "timestamp": "2025-12-22T06:00:00Z"
  },
  {
    "title": "10 hard-rocking Christmas songs, from AC/DC to Christopher Lee",
    "description": "If you’re sick of hearing the same old festive cheese at this time of year, allow Kevin E G Perry to suggest an alternative playlist of full-throttle seasonal songs guaranteed to blow away the Christmas cobwebs",
    "link": "https://www.the-independent.com/arts-entertainment/music/features/christmas-songs-rock-metal-acdc-christopher-lee-b2888739.html",
    "timestamp": "2025-12-22T05:56:57Z"
  },
  {
    "title": "US in 'pursuit' of third oil tanker in Caribbean: official",
    "description": "The U.S. Coast Guard was pursuing another allegedly sanctioned tanker on Sunday, a U.S. official told AFP, as Washington ramps up its pressure campaign targeting Venezuela's vital oil sector.",
    "link": "https://www.hurriyetdailynews.com/us-in-pursuit-of-third-oil-tanker-in-caribbean-official-217051",
    "timestamp": "2025-12-22T05:56:38Z"
  },
  {
    "title": "‘God bless us, every one!’ The five best film versions of Dickens’ A Christmas Carol",
    "description": "The classic festive tale of humbug and redemption has been adapted countless times for film and TV since the very first silent version in 1901 - but which ones are actually worth watching? The Ghost of Christmas Past takes Kevin E G Perry back to visit the to…",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/christmas-carol-dickens-movies-scrooge-muppets-b2888733.html",
    "timestamp": "2025-12-22T05:45:43Z"
  },
  {
    "title": "Oil is at the heart of the branding of Presidents Trump and Maduro",
    "description": "Venezuela's economy is at risk of suffocation after repeated US operations targeting oil-laden ships\nThe post Oil is at the heart of the branding of Presidents Trump and Maduro appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/12/22/oil-is-at-the-heart-of-the-branding-of-presidents-trump-and-maduro/",
    "timestamp": "2025-12-22T05:38:11Z"
  },
  {
    "title": "Conservative Infighting Explodes At Turning Point USA's AmericaFest",
    "description": "Divides over how to address conspiracy theories and antisemitism were put on full display.",
    "link": "https://www.huffpost.com/entry/turning-point-usa-ben-shapiro-tucker-carlson_n_6948be6be4b099a75cbd47c6",
    "timestamp": "2025-12-22T05:27:53Z"
  },
  {
    "title": "‘Home Alone 2’ nailed holiday travel chaos, but flight rules make movie’s plot less plausible today",
    "description": "Panic erupts in the McCallister household as soon as the day begins. The parents’ alarm clock never rings, bags and coats spill across the floor, and the family barrels out the door to catch a flight to Florida. The pandemonium intensifies at the airport. The…",
    "link": "https://financialpost.com/pmn/home-alone-2-nailed-holiday-travel-chaos-but-flight-rules-make-movies-plot-less-plausible-today",
    "timestamp": "2025-12-22T05:19:43Z"
  },
  {
    "title": "Trump announces he's appointing Louisiana Gov. Jeff Landry to serve as US special envoy to Greenland",
    "description": "President Donald Trump has announced he is appointing Louisiana Gov. Jeff Landry to serve as the U.S. special envoy to Greenland, the vast, semi-autonomous territory of Denmark that Trump has said the U.S. needs to take over",
    "link": "https://abcnews.go.com/US/wireStory/trump-announces-appointing-louisiana-gov-jeff-landry-serve-128610284",
    "timestamp": "2025-12-22T05:17:27Z"
  },
  {
    "title": "California’s New Law Outlawing Criticism of Israel Quashes Academic Freedom, Criminalizes Teachers",
    "description": "Oakland, Ca. (Special to Informed Comment; Feature) - A California District Court hearing on was held on Wednesday, December 17, over an injunction sought by plaintiffs represented by the American-Arab Anti-Discrimination Committee (ADC) against a new law, Ca…",
    "link": "https://www.juancole.com/2025/12/californias-outlawing-criminalizes.html",
    "timestamp": "2025-12-22T05:15:48Z"
  },
  {
    "title": "Donald Trump’s baby bonds: a policy idea worth taking seriously?",
    "description": "The so-called Trump Accounts begin at birth with the US government depositing $1,000 in index funds",
    "link": "https://www.irishtimes.com/your-money/2025/12/22/donald-trumps-baby-bonds-a-policy-idea-worth-taking-seriously/",
    "timestamp": "2025-12-22T05:12:00Z"
  },
  {
    "title": "The “President of Peace” Prepares for War: The Donroe Doctrine Hits Home",
    "description": "( Tomdispatch.com ) - Earlier this month, the Trump administration released its new National Security Strategy, or NSS. Normally, such documents are poor predictors of what’s likely to happen in the real world. They are more like branding tools that communica…",
    "link": "https://www.juancole.com/2025/12/president-prepares-doctrine.html",
    "timestamp": "2025-12-22T05:04:57Z"
  },
  {
    "title": "US says talks with Russia, Ukraine in Miami ‘constructive, productive’",
    "description": "US envoy holds separate meetings with Russian and Ukrainian negotiators in Miami on ending Russia's war in Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/22/us-talks-with-russia-ukraine-in-miami-constructive-productive",
    "timestamp": "2025-12-22T05:02:54Z"
  },
  {
    "title": "Crude oil futures rise as US-Venezuela tensions fuel supply concerns",
    "description": "Crude oil futures traded higher on Monday morning as markets feared supply disruptions due to the increase in tensions between the US and Venezuela.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-us-venezuela-tensions-fuel-supply-concerns/article70424799.ece",
    "timestamp": "2025-12-22T04:50:29Z"
  },
  {
    "title": "Trump Taps Louisiana Governor Landry as Greenland Envoy (Jennifer A Dlouhy/Bloomberg)",
    "description": "Jennifer A Dlouhy / Bloomberg:\nTrump Taps Louisiana Governor Landry as Greenland Envoy  —  President Donald Trump said he's nominating Louisiana Governor Jeff Landry as US special envoy to Greenland, in the latest signal that the president retains designs on …",
    "link": "https://www.memeorandum.com/251221/p69",
    "timestamp": "2025-12-22T04:50:01Z"
  },
  {
    "title": "Gold hits record high on rate cut bets, geopolitical strife",
    "description": "Precious metals are capping a historic year, with gold prices up by two-thirds and silver more than double. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/gold-rises-to-record-high-on-rate-cut-bets-geopolitical-strife",
    "timestamp": "2025-12-22T04:45:00Z"
  },
  {
    "title": "US and Ukraine call Miami talks productive despite no breakthrough",
    "description": "Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans.",
    "link": "https://www.bbc.com/news/articles/cn5lnzlvqg2o",
    "timestamp": "2025-12-22T04:37:29Z"
  },
  {
    "title": "Oil Advances as US Pursues Third Tanker in Venezuela Blockade",
    "description": "Brent climbed to around $61 a barrel, after two weekly declines, while West Texas Intermediate was near $57.  The US Coast Guard boarded the Centuries tanker...",
    "link": "https://finance.yahoo.com/news/oil-advances-us-pursues-third-043138265.html",
    "timestamp": "2025-12-22T04:31:38Z"
  },
  {
    "title": "South East Asian bloc to seek end to Thailand-Cambodia fighting",
    "description": "Asean ministers hope to revive a ceasefire that was brokered with the help of US President Donald Trump.",
    "link": "https://www.bbc.com/news/articles/c5ydej888n9o",
    "timestamp": "2025-12-22T04:27:38Z"
  },
  {
    "title": "Google, Apple Warn US Visa Employees To Avoid International Travel Amid Embassy Delays: Report",
    "description": "The travel advisory applies to holders of H-1B, H-4, F, J and M visas, according to Google's internal memo.",
    "link": "https://www.ndtvprofit.com/technology/google-apple-warn-us-visa-employees-to-avoid-international-travel-amid-embassy-delays-report",
    "timestamp": "2025-12-22T04:26:37Z"
  },
  {
    "title": "Trump announces appoints Louisiana Gov Jeff Landry to serve as U.S. special envoy to Greenland",
    "description": "President Donald Trump ‍on Sunday ​announced ​he ⁠is appointing Louisiana Gov Jeff Landry to serve as the U.S. ‌special envoy to Greenland, the vast, semi-autonomous territory of Denmark that Trump has said the U.S. needs to take over. “Jeff understands how e…",
    "link": "https://japantoday.com/category/world/trump-announces-he%27s-appointing-louisiana-gov.-jeff-landry-to-serve-as-us-special-envoy-to-greenland",
    "timestamp": "2025-12-22T04:15:47Z"
  },
  {
    "title": "Trump Hijacks Ultimate Relaxation Hack With MAGA Boasting",
    "description": "President Donald Trump has turned something millions use to relax into yet another arm of his messaging machine. The White House’s trend-chasing X account on...",
    "link": "https://www.thedailybeast.com/trump-hijacks-ultimate-relaxation-hack-with-maga-boasting/",
    "timestamp": "2025-12-22T04:09:16Z"
  },
  {
    "title": "Donald Trump names Louisiana governor Landry as Greenland special envoy, says territory essential for US national security",
    "description": "President Donald Trump has appointed Louisiana Governor Jeff Landry as a special envoy to Greenland. Trump believes Landry will advance US interests in Greenland for national security. Landry previously supported Trump's idea of Greenland joining the United S…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-names-louisiana-governor-landry-as-greenland-special-envoy-says-territory-essential-for-us-national-security/articleshow/126113927.cms",
    "timestamp": "2025-12-22T04:05:00Z"
  },
  {
    "title": "Trump announces he's appointing Louisiana Gov. Jeff Landry to serve as US special envoy to Greenland",
    "description": "President Donald Trump ‍on Sunday ​announced ​he ⁠is appointing Louisiana Gov. Jeff Landry to serve as the U.S. ‌special envoy to Greenland, the vast, semi...",
    "link": "https://www.yahoo.com/news/articles/trump-announces-hes-appointing-louisiana-040427836.html",
    "timestamp": "2025-12-22T04:04:27Z"
  },
  {
    "title": "Mock funeral held for the penny at Lincoln Memorial as 230-year coin production ends",
    "description": "Mock funeral held at Lincoln Memorial marks end of penny production after President Trump's announcement to halt minting due to rising production costs.",
    "link": "https://www.foxnews.com/us/mock-funeral-held-penny-lincoln-memorial-230-year-coin-production-ends",
    "timestamp": "2025-12-22T04:02:26Z"
  },
  {
    "title": "Despite Trump's 2019 claim, ISIS thrives in Syria's power vacuum",
    "description": "The American attack on roughly 70 Islamic State targets on Saturday was an impressive display of power, but it is far from posing a challenge to the organization",
    "link": "https://www.haaretz.com/middle-east-news/2025-12-22/ty-article/.premium/despite-trumps-2019-claim-isis-thrives-in-syrias-power-vacuum/0000019b-4295-dbc2-adbb-cbb769650000",
    "timestamp": "2025-12-22T03:59:48Z"
  },
  {
    "title": "Israel Warns US That Iran's Missile Exercises Could Be Attack Preparation - Reports",
    "description": "Israeli officials warned the administration of US President Donald Trump over the weekend that missile exercises by Iran's Islamic Revolutionary Guard Corps (IRGC) could be a preparation for a strike on Israel, Axios reported citing sources.",
    "link": "https://sputnikglobe.com/20251222/israel-warns-us-that-irans-missile-exercises-could-be-attack-preparation---reports-1123342964.html",
    "timestamp": "2025-12-22T03:58:00Z"
  },
  {
    "title": "Trump backs Jewish politician Bruce Blakeman for NY Governor after Stefanik drops out",
    "description": "Trump endorses Nassau County Executive Bruce Blakeman for New York governor, a day after Elise Stefanik ended her campaign.",
    "link": "https://www.israelnationalnews.com/news/419709",
    "timestamp": "2025-12-22T03:45:12Z"
  },
  {
    "title": "60 Minutes Correspondent: Pulling Trump Segment Was \"Political\" Move",
    "description": "UPDATE: Only hours before a segment criticizing the Trump Administration's handling of Venezuelan individuals who were detained in El Salvador's CECOT was set to air on CBS News' 60 Minutes, the segment was pulled and listed as airing during a \"future broadca…",
    "link": "https://bleedingcool.com/tv/60-minutes-correspondent-pulling-trump-segment-was-political-move/",
    "timestamp": "2025-12-22T03:43:04Z"
  },
  {
    "title": "Trump names Louisiana governor Landry as Greenland special envoy (Reuters)",
    "description": "Reuters:\nTrump names Louisiana governor Landry as Greenland special envoy  —  U.S. President Donald Trump on Sunday announced he is appointing Louisiana Governor Jeff Landry as the special envoy to Greenland.  —  “Jeff understands how essential Greenland is t…",
    "link": "https://www.memeorandum.com/251221/p65",
    "timestamp": "2025-12-22T03:40:00Z"
  },
  {
    "title": "Fresh clashes erupt on Thai-Cambodia border as ASEAN convenes peace talks",
    "description": "Fighting resumes hours before regional foreign ministers meet in Malaysia to discuss steps to de-escalate hostilities.",
    "link": "https://www.aljazeera.com/news/2025/12/22/fresh-clashes-erupt-on-thai-cambodia-border-as-asean-convenes-peace",
    "timestamp": "2025-12-22T03:39:41Z"
  },
  {
    "title": "US tech giants advising foreign workers not to leave country – media",
    "description": "Google, Apple and Microsoft have internally warned H-1B visa holders they could get stuck abroad for months, Business Insider reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629858-us-tech-foreign-workers/",
    "timestamp": "2025-12-22T03:37:02Z"
  },
  {
    "title": "SNL mocks Trump over Epstein file redactions, cognitive tests and renaming Kennedy Center in scathing Christmas episode cold open",
    "description": "James Austin Johnson continued his streak as the president and ridiculed the Trump administration over its claim to be the ‘most transparent in history’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/snl-cold-open-trump-epstein-files-b2888706.html",
    "timestamp": "2025-12-22T03:34:42Z"
  },
  {
    "title": "Trump Taps Louisiana Governor Landry as Greenland Envoy",
    "description": "President Donald Trump said he’s nominating Louisiana Governor Jeff Landry as US special envoy to Greenland, in the latest signal that the president retains designs on increasing US influence over the island he’s suggested he wants to purchase.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-taps-louisiana-governor-landry-as-greenland-envoy",
    "timestamp": "2025-12-22T03:25:16Z"
  },
  {
    "title": "Miranda Devine: Trump’s ‘loud’ speech rightly counted off all the ways his admin delivered for America in 2025",
    "description": "“I inherited a mess, and I’m fixing it,” was Trump’s theme, with a modest pitch for an optimistic outlook in 2026.",
    "link": "https://nypost.com/2025/12/21/opinion/trumps-loud-speech-rightly-counted-off-all-the-ways-his-admin-delivered-for-america-in-2025/",
    "timestamp": "2025-12-22T03:15:32Z"
  },
  {
    "title": "Trump says he is naming Louisiana Gov. Jeff Landry special envoy to Greenland",
    "description": "President Donald Trump said on social media Sunday evening that he was appointing Gov. Jeff Landry as the United States Special Envoy to Greenland.",
    "link": "https://www.theadvocate.com/news/politics/trump-landry-greenland/article_091f93b3-a539-530c-a42d-d3e68ad8fc0d.html",
    "timestamp": "2025-12-22T03:11:00Z"
  },
  {
    "title": "CBS News Abruptly Pulls '60 Minutes' Segment About Trump Admin Sending Immigrants To CECOT",
    "description": "A spokesperson told HuffPost that the segment \"needed additional reporting.\"",
    "link": "https://www.huffpost.com/entry/cbs-news-60-minutes-cecot-prison_n_69488892e4b099a75cbd3755",
    "timestamp": "2025-12-22T03:08:55Z"
  },
  {
    "title": "Nicki Minaj Praises Trump, Vance at Arizona Event",
    "description": "Nicki Minaj appeared at gathering of conservatives in Arizona memorializing Charlie Kirk, praising President Donald Trump and Vice President JD Vance.",
    "link": "http://www.billboard.com/music/music-news/nicki-minaj-trump-vance-arizona-turning-point-usa-1236144043/",
    "timestamp": "2025-12-22T03:06:08Z"
  },
  {
    "title": "Bourbon maker Jim Beam halts production at main distillery for a year",
    "description": "US distillers face uncertainty after President Trump imposed tariffs on countries around the world.",
    "link": "https://www.bbc.com/news/articles/cy5gv5z24n2o",
    "timestamp": "2025-12-22T03:05:17Z"
  },
  {
    "title": "The Drumbeats Of War Are Getting Louder",
    "description": "Hundreds of millions of people all over the western world are enjoying the holiday season as if nothing has changed.  But meanwhile the pounding of the war drums just continues to intensify.  If the world keeps going down this path, next year’s holiday season…",
    "link": "http://theeconomiccollapseblog.com/the-drumbeats-of-war-are-getting-louder/",
    "timestamp": "2025-12-22T03:02:27Z"
  },
  {
    "title": "Save the Dividend, Warriors. You May Lose Your Health Care - NewsBreak",
    "description": "In his primetime speech to the nation on Wednesday, Donald Trump bragged that he would give military service members a so-called “warrior dividend” of $1,7",
    "link": "https://www.newsbreak.com/share/4404875429361-save-the-dividend-warriors-you-may-lose-your-health-care?s=a2&amp;share_destination_id=NjM4NTQxMzMtMTc2NjM3MjM3NzYzMQ%3D%3D&amp;pd=04JvNNa0&amp;hl=en_US&amp;send_time=1766372377&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.51.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-22T03:00:25Z"
  },
  {
    "title": "Nicki Minaj praises Trump, JD Vance at TPUSA event, says she has 'utmost respect' for them",
    "description": "Nicki Minaj praised President Donald Trump and JD Vance at Turning Point USA's AmericaFest conference on Sunday, saying Trump gives people hope to \"beat the bad guys.\"",
    "link": "https://www.foxnews.com/media/nicki-minaj-praises-trump-jd-vance-tpusa-event-says-she-has-utmost-respect-them",
    "timestamp": "2025-12-22T02:53:33Z"
  },
  {
    "title": "Exclusive: Jan 6 Defendants' Dad Recalls 'Violent' Raid on Family Home",
    "description": "The father of two January 6, 2021, defendants who went on the run from the FBI before being pardoned by President Donald Trump recounted what his family went through in an exclusive interview on Breitbart News Saturday.\nThe post Exclusive: Jan 6 Defendants’ D…",
    "link": "https://www.breitbart.com/radio/2025/12/21/exclusive-jan-6-defendants-dad-recalls-violent-raid-family-home/",
    "timestamp": "2025-12-22T02:41:05Z"
  },
  {
    "title": "Ex US national security adviser accuses CIA of working against Trump",
    "description": "Michael Flynn has alleged collusion between the CIA and European intelligence services to undermine President Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629857-flynn-cia-eu-collusion/",
    "timestamp": "2025-12-22T02:41:04Z"
  },
  {
    "title": "60 minutes pulls El Salvador Megaprison segment 2 Hours Before Airtime",
    "description": "BREAKING: CBS just pulled this episode of 60 Minutes claiming it is “postponed” Here is the trailer that was pulled for the now “postponed” segment. Make sure everyone sees it. It’s remarkable how much harm Pro-Trump Bari Weiss has managed to inflict on CBS N…",
    "link": "https://ohnotheydidnt.livejournal.com/131665693.html",
    "timestamp": "2025-12-22T02:31:30Z"
  },
  {
    "title": "Silver rises to record high on rate-cut bets, geopolitical strife",
    "description": "Gold and silver have touched new record highs. This surge is driven by global geopolitical tensions and anticipation of interest rate cuts by the Federal Reserve. Platinum prices are also climbing steadily. Investors are showing increased interest in these pr…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/silver-rises-to-record-high-on-rate-cut-bets-geopolitical-strife/articleshow/126112694.cms",
    "timestamp": "2025-12-22T02:28:03Z"
  },
  {
    "title": "US in ‘pursuit’ of third oil tanker in Caribbean: official",
    "description": "The US Coast Guard was pursuing another allegedly sanctioned tanker on Sunday, a US official told AFP, as Washington ramps up its pressure campaign targeting Venezuela’s vital oil sector. The “active pursuit” in the Caribbean Sea was happening a day after the…",
    "link": "https://www.digitaljournal.com/world/us-in-pursuit-of-third-oil-tanker-in-caribbean-official/article",
    "timestamp": "2025-12-22T02:22:20Z"
  },
  {
    "title": "Trump’s Inflation Trap",
    "description": "What can Donald Trump do to stop morphing into Joe Biden? The two presidents could hardly be more different in most ways—but in the one that counts most with voters, Trump is in danger of resembling his predecessor. Americans rejected Biden and the Democrats …",
    "link": "https://freerepublic.com/focus/f-news/4358484/posts",
    "timestamp": "2025-12-22T02:17:11Z"
  },
  {
    "title": "JD Vance Tells Haters Like Nick Fuentes They Can ‘Eat Sh*t’ for Racist Attacks on Wife",
    "description": "Vice President JD Vance said he has an official policy for the haters like Hitler-loving Nick Fuentes who bash his wife: they can “eat sh*t.” That was the Vance’s response to Fuentes and other critics — including ex-Biden Administration Press Secretary Jen Ps…",
    "link": "https://www.mediaite.com/media/jd-vance-tells-haters-like-nick-fuentes-they-can-eat-sht-for-racist-attacks-on-wife/",
    "timestamp": "2025-12-22T02:16:48Z"
  },
  {
    "title": "US Pursuit of Third Oil Tanker Intensifies Venezuela Blockade",
    "description": "The US has pursued a third oil tanker off the coast of Venezuela, intensifying a blockade that the Trump administration hopes will cut off a vital economic lifeline for the country and isolate the government of President Nicolás Maduro.",
    "link": "https://financialpost.com/pmn/business-pmn/us-pursuit-of-third-oil-tanker-intensifies-venezuela-blockade",
    "timestamp": "2025-12-22T02:14:13Z"
  },
  {
    "title": "LARRY ELDER: What Rob Reiner Said About And Did To Donald Trump",
    "description": "'one-stop shop'",
    "link": "https://dailycaller.com/2025/12/21/opinion-what-rob-reiner-said-about-and-did-to-donald-trump-larry-elder/",
    "timestamp": "2025-12-22T02:12:24Z"
  },
  {
    "title": "Vance rallies conservatives, honors Charlie Kirk at Turning Point USA convention",
    "description": "JD Vance closed out the final day of Turning Point USA's AmericaFest convention, rallying conservatives around themes of Christianity and the “America First” movement.",
    "link": "https://abcnews.go.com/Politics/vice-president-jd-vance-rallies-conservatives-honors-charlie/story?id=128605789",
    "timestamp": "2025-12-22T02:08:37Z"
  },
  {
    "title": "Trump news at a glance: justice department restores Epstein files image featuring Trump after outcry",
    "description": "Todd Blanche says removal of images has ‘nothing to do’ with the president, and removal of 16 photos came at request of victim advocacy groups – key US...",
    "link": "https://www.yahoo.com/news/articles/trump-news-glance-justice-department-020014714.html",
    "timestamp": "2025-12-22T02:00:14Z"
  },
  {
    "title": "Children and staff abducted from Nigerian school released",
    "description": "No group has claimed responsibility for the November 21 abduction of more than 300 children and staff from a Nigerian Catholic school.",
    "link": "https://www.abc.net.au/news/2025-12-22/nigerian-school-children-and-staff-released/106170280",
    "timestamp": "2025-12-22T01:52:11Z"
  },
  {
    "title": "Colorado gov accuses Trump of playing 'political games' on disaster requests",
    "description": "Colorado Gov. Jared Polis has accused President Donald Trump of playing “political games” after the Trump administration denied disaster declaration requests made by the state",
    "link": "https://abcnews.go.com/US/wireStory/colorado-governor-accuses-trump-playing-political-games-after-128607092",
    "timestamp": "2025-12-22T01:45:24Z"
  },
  {
    "title": "'60 Minutes' postpones segment on migrant inmates from El Salvador's CECOT prison",
    "description": "CBS' \"60 Minutes\" delayed a segment about Venezuelan migrants deported to El Salvador's maximum-security prison hours before the episode was set to air.",
    "link": "https://www.foxnews.com/media/60-minutes-postpones-segment-migrant-inmates-from-el-salvadors-cecot-prison",
    "timestamp": "2025-12-22T01:39:46Z"
  },
  {
    "title": "Tariff Refund Could Pose ‘Administrative Problem’ for White House",
    "description": "The Supreme Court is weighing the legality of the White House’s wide-ranging tariffs. But if the justices decide against the Trump administration, a ruling requiring repayment of the duties would be a major challenge, the president’s top economic adviser said…",
    "link": "https://www.pymnts.com/legal/2025/tariff-refund-could-pose-administrative-problem-for-white-house/",
    "timestamp": "2025-12-22T01:32:41Z"
  },
  {
    "title": "Southeast Asia bloc meets to press Thailand, Cambodia on truce",
    "description": "Southeast Asian foreign ministers are set to meet Monday in Malaysia for crisis talks aimed at halting deadly border clashes between Thailand and Cambodia, which pressed on despite regional and international diplomacy. Renewed fighting between the two neighbo…",
    "link": "https://www.digitaljournal.com/world/southeast-asia-bloc-meets-to-press-thailand-cambodia-on-truce/article",
    "timestamp": "2025-12-22T01:27:20Z"
  },
  {
    "title": "After GOP fights about antisemitism, JD Vance rejects ‘purity tests’ and says there’s ‘more important work to do than canceling each other’",
    "description": "“I didn’t bring a list of conservatives to denounce or to de-platform,” Vance said during the Turning Point convention’s closing speech.",
    "link": "https://fortune.com/2025/12/21/gop-antisemitism-jd-vance-purity-tests-turning-point-usa-convention-erika-kirk/",
    "timestamp": "2025-12-22T01:25:29Z"
  },
  {
    "title": "Coast Guard chasing another oil tanker",
    "description": "The U.S. Coast Guard on Sunday was pursuing another sanctioned oil tanker in the Caribbean Sea as the Trump administration appeared to be intensifying its targeting of such vessels connected to the Venezuelan government.",
    "link": "https://www.bostonherald.com/2025/12/21/coast-guard-chasing-another-oil-tanker/",
    "timestamp": "2025-12-22T01:22:21Z"
  },
  {
    "title": "Critics Lash Out at Bari Weiss After 60 Minutes Yanks Segment on Trump Deportations Last Minute: ‘SHAME, SHAME, SHAME!’",
    "description": "Critics lashed out at Bari Weiss after a 60 Minutes segment on Trump deportations to El Salvador was pulled from air at the last minute on Sunday.\nThe post Critics Lash Out at Bari Weiss After 60 Minutes Yanks Segment on Trump Deportations Last Minute: ‘SHAME…",
    "link": "https://www.mediaite.com/media/critics-lash-out-at-bari-weiss-after-60-minutes-yanks-segment-on-trump-deportations-last-minute-shame-shame-shame/",
    "timestamp": "2025-12-22T01:18:40Z"
  },
  {
    "title": "Cheap Trick Issues Statement Explaining Kennedy Center Honors Performance in Support of Kiss (Trump)",
    "description": "Cheap Trick has issued a statement in response to criticism they received for performing at last week's Kennedy Center Honors in support of Kiss. The Rockford, Illinois-based rockers paid tribute to their longtime musical compatriots and 2025 Kennedy Center h…",
    "link": "https://freerepublic.com/focus/f-chat/4358477/posts",
    "timestamp": "2025-12-22T01:09:17Z"
  },
  {
    "title": "Justice Department restores Trump photo to public database of Epstein files",
    "description": "A photo of Donald Trump, initially removed from released Jeffrey Epstein files, was restored after officials confirmed no victims were depicted. The Justice Department stated the image was flagged out of an abundance of caution to protect potential victims, b…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/justice-department-restores-trump-photo-to-public-database-of-epstein-files/articleshow/126112261.cms",
    "timestamp": "2025-12-22T01:04:11Z"
  },
  {
    "title": "Oil Advances As US Pursues Third Tanker In Venezuela Blockade",
    "description": "Oil rose as President Donald Trump intensified a blockade on Venezuela, with US forces boarding one tanker and pursuing another within weeks of first capturing a vessel.",
    "link": "https://www.ndtvprofit.com/markets/oil-advances-as-us-pursues-third-tanker-in-venezuela-blockade",
    "timestamp": "2025-12-22T00:58:14Z"
  },
  {
    "title": "Jim Beam Shutters Main Distillery For 2026 As Sales Falter Due To Trump Trade War",
    "description": "Jim Beam is pausing whiskey production at its major Kentucky distillery beginning Jan. 1, 2026, as sales falter due in part to the trade war with Canada.\nThe post Jim Beam Shutters Main Distillery For 2026 As Sales Falter Due To Trump Trade War first appeared…",
    "link": "https://www.mediaite.com/media/news/jim-beam-shutters-main-distillery-for-2026-as-sales-falter-due-to-trump-trade-war/",
    "timestamp": "2025-12-22T00:54:14Z"
  },
  {
    "title": "Nicki Minaj appears at Turning Point USA event to praise ‘handsome’ and ‘dashing’ Donald Trump",
    "description": "She voiced her support at the conservative AmericaFest event in Arizona.",
    "link": "https://www.nzherald.co.nz/entertainment/nicki-minaj-appears-at-turning-point-usa-event-to-praise-handsome-and-dashing-donald-trump/SGU6EIGVMJGTZEMH5RENDJLYQE/",
    "timestamp": "2025-12-22T00:53:48Z"
  },
  {
    "title": "Asian stocks gain as hopes for year-end rally grow",
    "description": "Asian equities opened higher, mirroring gains in US stocks and fueling hopes for a year-end rally. Investors are closely watching China's loan prime rates and upcoming economic data from the UK, US, and Japan for clues on central bank policy. Meanwhile, oil p…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-as-hopes-for-year-end-rally-grow/articleshow/126112207.cms",
    "timestamp": "2025-12-22T00:51:48Z"
  },
  {
    "title": "Egypt’s Foreign Minister: We trust Trump, hope for next phase of Gaza agreement in January",
    "description": "Egyptian Foreign Minister Badr Abdelatty stated that “Cairo trusts the involvement of US President Donald Trump regarding halting the Israeli violations of the Gaza agreement.”He added, “We hope there will be an announcement on entering the second phase of th…",
    "link": "https://www.israelnationalnews.com/flashes/672871",
    "timestamp": "2025-12-22T00:51:33Z"
  }
]