[
  {
    "title": "Trevor Noah Takes Shot At Nicki Minaj During Final Grammys Monologue: “She Is Still At The White House With Donald Trump”",
    "description": "Amid the opening monologue schmoozing, Trevor Noah, back for one last go-round as host of the Grammy Awards his sixth and final time, took a shot at MAGA barbie herself Nicki Minaj, deriding the embattled rapper. “Nicki Minaj is not here, she is not here, uh,…",
    "link": "http://deadline.com/2026/02/trevor-noah-grammys-opening-monologue-nicki-minaj-trump-1236705264/",
    "timestamp": "2026-02-02T01:23:32Z"
  },
  {
    "title": "‘Hum hain na,’ PM Modi assures followers of Guru Ravidas",
    "description": "PM Modi addressed the followers at Dera Sachkhand Ballan soon after naming Adampur airport after the social reformer on his birth anniversary, lauding his message of equality. “I am confident that we will continue to strengthen the roots of our society with t…",
    "link": "https://timesofindia.indiatimes.com/india/hum-hain-na-modi-assures-followers-of-guru-ravidas/articleshow/127850206.cms",
    "timestamp": "2026-02-02T01:22:31Z"
  },
  {
    "title": "Trevor Noah Roasts Nicki Minaj at Grammys for Going MAGA: ‘She’s Still at the White House With Donald Trump’",
    "description": "Although Trevor Noah usually keeps his Grammy hosting duties free of political discussion, he used his enthusiastic opening monologue to poke fun at Nicki Minaj’s recent turn to fawning over Donald Trump. After lightly joking with scores of superstars in the …",
    "link": "https://variety.com/2026/music/news/trevor-noah-nicki-minaj-grammys-trump-maga-1236641769/",
    "timestamp": "2026-02-02T01:19:31Z"
  },
  {
    "title": "Trump says he is closing Kennedy Center arts complex for two years",
    "description": "U.S. President Donald Trump announced Sunday he is closing the Kennedy Center arts complex in Washington for two years, beginning on July 4 -- the nation's 250th anniversary -- for a thorough renovation. Since returning to office, Trump has launched a forcefu…",
    "link": "https://japantoday.com/category/entertainment/trump-says-closing-kennedy-center-arts-complex-for-two-years",
    "timestamp": "2026-02-02T01:19:28Z"
  },
  {
    "title": "60 Minutes Goes Hard At Trump Crackdown That Sparked Killings And Unrest",
    "description": "60 Minutes did not spare the Trump administration in its story about ICE shootings that featured an interview with Sen. Rand Paul (R-KY).\nThe post 60 Minutes Goes Hard At Trump Crackdown That Sparked Killings And Unrest first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/60-minutes-goes-hard-at-trump-crackdown-that-sparked-killings-and-unrest/",
    "timestamp": "2026-02-02T01:13:59Z"
  },
  {
    "title": "Gold extends biggest fall in over a decade",
    "description": "Gold prices plunge in Asia, extending its biggest fall in over a decade as precious metals snap back from a record-breaking rally. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/gold-extends-biggest-fall-in-over-a-decade",
    "timestamp": "2026-02-02T01:12:39Z"
  },
  {
    "title": "Ex-Gov. Chris Christie claims Trump is political liability in NJ after Mikie Sherrill win: ‘We forgot how to win’",
    "description": "President Trump's unpopularity in New Jersey contributed to the drubbing Republicans took in Garden State elections last year, ex-GOP Gov. Chris Christie said.",
    "link": "https://nypost.com/2026/02/01/us-news/trump-is-political-liability-for-gop-in-nj-ex-gov-christie-says/",
    "timestamp": "2026-02-02T01:12:32Z"
  },
  {
    "title": "Trump: Don Lemon’s Arrest Is ‘The Best Thing That Could Have Happened To Him’",
    "description": "The president also called the independent journalist a “sleazebag.”",
    "link": "https://www.huffpost.com/entry/trump-don-lemon-arrest_n_697f7821e4b0bdc5d2a91460",
    "timestamp": "2026-02-02T01:11:40Z"
  },
  {
    "title": "Pre-market action: Here's the trade setup for today's session",
    "description": "The Union Budget for FY27 maintained capex growth at 12% despite revenue challenges, with short-term borrowings rising. The Nifty saw a 2% correction on Budget Day, with analysts predicting limited further downside. A rupee recovery and an early India-US trad…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127850131.cms",
    "timestamp": "2026-02-02T01:09:05Z"
  },
  {
    "title": "I’ve seen insurgencies up close — and anti-ICE actions look eerily familiar",
    "description": "Americans remain bitterly divided over the chaos that’s engulfed Minneapolis as President Donald Trump seeks to deport illegal-immigrant criminals. Some see the protesters thwarting the enforcement of immigration law as “protecting friends and neighbors” — a …",
    "link": "https://freerepublic.com/focus/f-news/4365075/posts",
    "timestamp": "2026-02-02T01:08:09Z"
  },
  {
    "title": "‘We’ll find out’: Trump responds to Khamenei’s warning",
    "description": "President Donald Trump has said the world would soon see whether Iran’s Supreme Leader Ayatollah Ali Khamenei was correct in his warning Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631843-iran-attack-warning-trump/",
    "timestamp": "2026-02-02T01:05:17Z"
  },
  {
    "title": "Trump Announces Kennedy Center Closing on July 4 for Two Years for Renovations",
    "description": "President Trump announced that the Kennedy Center in Washington, D.C., will be closing later this year on July 4 due to renovations.\nThe post Trump Announces Kennedy Center Closing on July 4 for Two Years for Renovations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2026/02/01/trump-closing-the-kennedy-center-on-july-4-for-two-years-due-to-renovations/",
    "timestamp": "2026-02-02T01:03:52Z"
  },
  {
    "title": "Mockery abounds after Trump's latest Kennedy Center proclamation: 'He’s East-Winging it'",
    "description": "Mockery abounded on Sunday night after President Donald Trump announced that the embattled Kennedy Center would close for two years as a wave of performers cancelled their dates. Trump has been trying for several months to rebrand the Kennedy Center as the \"T…",
    "link": "https://www.rawstory.com/kennedy-center-2675067362/",
    "timestamp": "2026-02-02T01:02:50Z"
  },
  {
    "title": "Asian shares drop as gold plunge deepens, dollar gains",
    "description": "Global markets experienced a downturn on Monday. Stocks and precious metals saw significant losses. The Japanese yen weakened considerably. This sentiment follows a volatile week and precedes crucial central bank decisions and economic reports. Investors are …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-drop-as-gold-plunge-deepens-dollar-gains/articleshow/127850043.cms",
    "timestamp": "2026-02-02T01:01:03Z"
  },
  {
    "title": "'Melania' documentary shocks Hollywood press with 'face-saving' debut that 'over-performed' expectations",
    "description": "The \"Melania\" documentary surprised members of Hollywood's entertainment media after posting the best opening weekend for a documentary in over a decade.",
    "link": "https://www.foxnews.com/media/melania-documentary-shocks-hollywood-press-face-saving-debut-over-performed-expectations",
    "timestamp": "2026-02-02T01:00:46Z"
  },
  {
    "title": "Grammy Awards 2026 Winners LIVE Updates: Kendrick Lamar wins Best Rap Album, Sabrina Carpenter performs ‘Manchild’",
    "description": "Grammy Awards 2026 Winners LIVE Updates: Follow the 68th Annual Grammy Awards winners list, nominees, predictions, host details, red carpet highlights, and the latest from music’s biggest night.",
    "link": "https://indianexpress.com/article/entertainment/music/grammy-awards-2026-winners-live-updates-predictions-nominees-10501724/",
    "timestamp": "2026-02-02T01:00:03Z"
  },
  {
    "title": "Iran stages Khamenei photos to mask cracks in IRGC, opposition groups say",
    "description": "Iranian regime projects strength through staged images of Supreme Leader Ayatollah Ali Khamenei at prayers, a senior official with the National Council of Resistance of Iran said.",
    "link": "https://www.foxnews.com/world/iran-stages-khamenei-photos-mask-cracks-irgc-opposition-groups-say",
    "timestamp": "2026-02-02T00:52:54Z"
  },
  {
    "title": "CNBC Daily Open: Markets see Warsh as a safe pick for Fed chair — causing gold and silver to plunge",
    "description": "The U.S. dollar strengthened, signaling the market's approval of Warsh's credibility and perceived autonomy, but safe-haven assets gold and silver plummeted.",
    "link": "https://www.cnbc.com/2026/02/02/cnbc-daily-open-markets-see-warsh-as-safe-pick-for-fed-chair-gold-and-silver-plunged.html",
    "timestamp": "2026-02-02T00:52:12Z"
  },
  {
    "title": "Health officials offer new Nipah virus warning as devastating fatality rate revealed - NewsBreak",
    "description": "The Nipah virus has a mortality rate ranging from 40 to 75 percent and there is no verified specific treatment available for those who contract the deadly",
    "link": "https://www.newsbreak.com/share/4470062012051-health-officials-offer-new-nipah-virus-warning-as-devastating-fatality-rate-revealed?s=a7&amp;share_destination_id=MTk3Mjc0ODQ0LTE3Njk5OTMzMTIyMjk%3D&amp;pd=0DLkCKpN&amp;hl=en_US&amp;send_time=1769993312&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.4.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-02T00:51:14Z"
  },
  {
    "title": "Trump’s right on the UK’s ‘great stupidity’",
    "description": "President Donald Trump's justifiably scathing remarks about Britain's insane plan to hand control of the Chagos Islands to the Republic of Mauritius seem to have hit their mark.",
    "link": "https://nypost.com/2026/02/01/opinion/trumps-right-on-the-uks-great-stupidity/",
    "timestamp": "2026-02-02T00:49:51Z"
  },
  {
    "title": "Trump says Kennedy Center will close in July for two years for renovations",
    "description": "The Kennedy Center for the Performing Arts in Washington will close for roughly two years to allow for extensive renovations, President Donald Trump said Sunday. Trump said on social media he determined that the closure, slated for July 4, “will produce a muc…",
    "link": "https://freerepublic.com/focus/f-chat/4365073/posts",
    "timestamp": "2026-02-02T00:47:20Z"
  },
  {
    "title": "The celebrities who didn’t hold back on ICE at the 2026 Grammys — and what they said",
    "description": "Justin Bieber, Kehlani, and Joni Mitchell are a few artists wearing pins to protest ICE",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/grammys-ice-red-carpet-2026-b2911878.html",
    "timestamp": "2026-02-02T00:47:13Z"
  },
  {
    "title": "Trump Shutting Down Kennedy Center for 2 Years: \"Complete Rebuilding\"",
    "description": "Donald Trump's renaming of the Kennedy Center to the Trump Kennedy Center (\"The Donald J. Trump and John F. Kennedy Memorial Center for the Performing Arts,\" to be precise) has proven to be such a success that Trump announced on Sunday night via his social me…",
    "link": "https://bleedingcool.com/tv/trump-shutting-down-kennedy-center-for-2-years-complete-rebuilding/",
    "timestamp": "2026-02-02T00:42:08Z"
  },
  {
    "title": "JUST IN: President Trump Announces Two-Year Closure of Trump Kennedy Center for Renovations",
    "description": "President Trump on Sunday announced that the Trump Kennedy Center would be shuttered for two years for major renovations.\nThe post JUST IN: President Trump Announces Two-Year Closure of Trump Kennedy Center for Renovations appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/president-trump-announces-two-year-closure-trump-kennedy/",
    "timestamp": "2026-02-02T00:40:40Z"
  },
  {
    "title": "Strategy’s Saylor signals buy after BTC briefly dips below cost basis",
    "description": "Strategy executive chairman Michael Saylor hints the firm capitalized on the weekend dip with another Bitcoin purchase as the price of BTC briefly fell below Strategy’s cost basis.",
    "link": "https://cointelegraph.com/news/strategy-hints-bought-bitcoin-after-weekend-crash",
    "timestamp": "2026-02-02T00:39:41Z"
  },
  {
    "title": "Trump-Loving Singer Trades MAGA Fashion For A New 2-Word Statement",
    "description": "Joy Villa often uses the Grammys red carpet to make some sort of political statement.",
    "link": "https://www.huffpost.com/entry/trump-loving-singer-trades-maga-fashion-for-a-new-2-word-statement_n_697fe607e4b00b8d44e30988",
    "timestamp": "2026-02-02T00:37:59Z"
  },
  {
    "title": "Kennedy Center to close for 2 years for renovations after a wave of canceled shows due to Trump adding his name to the building",
    "description": "Trump announced the closure days after the premiere of “Melania” a documentary of the first lady was shown at the storied venue.",
    "link": "https://fortune.com/2026/02/01/kennedy-center-closure-2-years-renovations-canceled-shows-trump-name-change-building/",
    "timestamp": "2026-02-02T00:37:13Z"
  },
  {
    "title": "Trump says Kennedy Center to close for 2 years for renovations",
    "description": "Trump's announcement comes as the arts venue faces a series of event cancellations after Trump launched a forceful takeover of the center and added his name to its facade.",
    "link": "https://www.dw.com/en/trump-says-kennedy-center-to-close-for-2-years-for-renovations/a-75755452",
    "timestamp": "2026-02-02T00:36:00Z"
  },
  {
    "title": "Trump announces two-year closure of embattled Kennedy Center",
    "description": "President Donald Trump announced on Sunday that the embattled Kennedy Center will close for two-years as it undergoes renovations. \"After a one year review of The Trump Kennedy Center, that has taken place with Contractors, Musical Experts, Art Institutions, …",
    "link": "https://www.rawstory.com/trump-2675067339/",
    "timestamp": "2026-02-02T00:35:59Z"
  },
  {
    "title": "Bernie Sanders, Elizabeth Warren, Other Democrats Push To Slash $75 Billion ICE Funding, Restore Health Care Cuts In Trump's Spending Law",
    "description": "Sen. Bernie Sanders (I-Vt.) and fellow Democrats are pressing Congress to cut billions in funding for Immigration and Customs Enforcement and redirect the",
    "link": "https://www.newsbreak.com/share/4471070968777-bernie-sanders-elizabeth-warren-other-democrats-push-to-slash-75-billion-ice-funding-restore-health-care-cuts-in-trump-s-spending-law?s=a2&amp;share_destination_id=NjM4NTQxMzMtMTc2OTk5MjI3NzY4Ng%3D%3D&amp;pd=04JvNNa0&amp;hl=en_US&amp;send_time=1769992277&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.4.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-02T00:31:53Z"
  },
  {
    "title": "US prosecutors see no more charges after final Epstein file dump",
    "description": "US prosecutors see no more charges after final Epstein file dumptimesofmalta.com",
    "link": "https://timesofmalta.com/article/us-prosecutors-see-no-charges-final-epstein-file-dump.1123436",
    "timestamp": "2026-02-02T00:28:35Z"
  },
  {
    "title": "Kennedy Center to cease entertainment operations for two years, Trump says",
    "description": "The center ‌historically has hosted over 2,000 events per year, according to the website, although ‌many performers have pulled ‍out ⁠of ​planned shows since Trump's shakeup began.",
    "link": "https://indianexpress.com/article/world/us-news/kennedy-center-to-cease-entertainment-operations-for-two-years-trump-says-10508258/",
    "timestamp": "2026-02-02T00:25:41Z"
  },
  {
    "title": "Trump Drops Big News About His ‘Trump Kennedy Center’ — It’s Closing For 2 Years",
    "description": "Donald Trump announced renovation plans for the Kennedy Center For The Performing Arts that will require him to close the facility for a full two years.\nThe post Trump Drops Big News About His ‘Trump Kennedy Center’ — It’s Closing For 2 Years first appeared o…",
    "link": "https://www.mediaite.com/media/news/trump-drops-big-news-about-his-trump-kennedy-center-its-closing-for-2-years/",
    "timestamp": "2026-02-02T00:25:13Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations in July, Trump says, after performers backlash (Michelle L. Price/Associated Press)",
    "description": "Michelle L. Price / Associated Press:\nKennedy Center will close for 2 years for renovations in July, Trump says, after performers backlash  —  President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years st…",
    "link": "https://www.memeorandum.com/260201/p70",
    "timestamp": "2026-02-02T00:25:00Z"
  },
  {
    "title": "Stock market today: S&P 500, Nasdaq futures sink as AI doubts swirl, precious metals whipsaw around",
    "description": "Wall Street is on edge after Friday's sharp reversal ahead of a week defined by Trump's Fed pick, jobs data and more Big Tech earnings.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-futures-slide-as-ai-doubts-swirl-precious-metals-whipsaw-002413190.html",
    "timestamp": "2026-02-02T00:24:13Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures sink after gold sell-off as AI doubts creep in",
    "description": "Wall Street is on edge after Friday's sharp reversal ahead of a week defined by Trump's Fed pick, jobs data and more Big Tech earnings.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-sink-after-gold-sell-off-as-ai-doubts-creep-in-002413033.html",
    "timestamp": "2026-02-02T00:24:13Z"
  },
  {
    "title": "Donald Trump Announces Plans To Close Kennedy Center For Two Years, Says It Is Due To Renovations",
    "description": "Donald Trump announced plans on Sunday to close the Kennedy Center for performances for about two years, what the president said was due to construction and renovation. Trump posted on Truth Social, “The Trump Kennedy Center will close on July 4th, 2026, in h…",
    "link": "http://deadline.com/2026/02/trump-closes-kennedy-center-1236705370/",
    "timestamp": "2026-02-02T00:23:17Z"
  },
  {
    "title": "Report: US tells Iran it is open to negotiating a deal",
    "description": "US official tells Axios that the Trump administration has conveyed to Iran that it is open to a meeting to negotiate a deal. Regional states push to broker a meeting.",
    "link": "https://www.israelnationalnews.com/news/421807",
    "timestamp": "2026-02-02T00:16:36Z"
  },
  {
    "title": "Trump to Close Kennedy Center for Two Years",
    "description": "Trump cited necessary renovations, not the ongoing artist boycott, as the reason for the Kennedy Center's closure.\nTrump to Close Kennedy Center for Two Years\nAlex Young",
    "link": "https://consequence.net/2026/02/trump-closing-kennedy-center/",
    "timestamp": "2026-02-02T00:15:34Z"
  },
  {
    "title": "Trump to Close Kennedy Center for 2-Year Renovation Project",
    "description": "\"The fastest way to bring The Trump Kennedy Center to the highest level of Success, Beauty, and Grandeur, is to cease Entertainment Operations for an approximately two year period,\" the president writes\nThe post Trump to Close Kennedy Center for 2-Year Renova…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-to-close-kennedy-center-for-2-year-renovation-project/",
    "timestamp": "2026-02-02T00:15:16Z"
  },
  {
    "title": "Trump’s plan to make housing affordable is faltering",
    "description": "“We’re not going to destroy the value of their homes so somebody who didn’t work very hard can buy a home,” Trump said.",
    "link": "https://fortune.com/2026/02/01/trump-plan-affordable-housing-mortgage-rates-home-prices/",
    "timestamp": "2026-02-02T00:15:09Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations, Trump says",
    "description": "President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://www.wmur.com/article/kennedy-center-will-close-for-2-years-trump-says/70213977",
    "timestamp": "2026-02-02T00:14:48Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations, Trump says",
    "description": "President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://www.kcra.com/article/kennedy-center-will-close-for-2-years-trump-says/70213977",
    "timestamp": "2026-02-02T00:14:40Z"
  },
  {
    "title": "Trump says Kennedy Center will close for two years for renovations",
    "description": "President Donald Trump announced Sunday that he has determined that the Kennedy Center for the Performing Arts in Washington, D.C., should temporarily close for approximately two years",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-says-kennedy-center-will-close-two-years-renovations-rcna256982",
    "timestamp": "2026-02-02T00:14:21Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations in July, President Trump says",
    "description": "President Donald Trump said Sunday he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction.",
    "link": "https://www.wpxi.com/news/national/kennedy-center-will-close-2-years-renovations-july-president-trump-says/M7OAH5K2UBFU7JTBY7RSK2B6UQ/",
    "timestamp": "2026-02-02T00:14:08Z"
  },
  {
    "title": "Kennedy Center to close for 2 years for renovations in July, Trump says, after performers' backlash",
    "description": "President Donald Trump says he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://abcnews.go.com/US/wireStory/kennedy-center-close-2-years-renovations-july-trump-129761553",
    "timestamp": "2026-02-02T00:13:45Z"
  },
  {
    "title": "Donald Trump Announces Kennedy Center Will Close for 2 Years, Explains Why",
    "description": "Donald Trump just made an announcement: he’s closing the building formerly known as the Kennedy Center for two years. He explained that it is a temporary closure, and it is due to construction. He made the decision that, if they did not close the building and…",
    "link": "https://www.justjared.com/2026/02/01/donald-trump-announces-kennedy-center-will-close-for-2-years-explains-why/",
    "timestamp": "2026-02-02T00:11:14Z"
  },
  {
    "title": "Gloria Estefan Speaks Out On Trump Crackdown at Grammys — Cites Lessons From Holocaust",
    "description": "Gloria Estefan spoke out about President Donald Trump's immigration crackdown after winning a Grammy, citing a lesson she took from studying the Holocaust.\nThe post Gloria Estefan Speaks Out On Trump Crackdown at Grammys — Cites Lessons From Holocaust first a…",
    "link": "https://www.mediaite.com/media/entertainment/gloria-estefan-speaks-out-on-trump-crackdown-at-grammys-cites-lessons-from-holocaust/",
    "timestamp": "2026-02-02T00:09:17Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations, Trump says",
    "description": "President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://www.wgal.com/article/kennedy-center-will-close-for-2-years-trump-says/70213977",
    "timestamp": "2026-02-02T00:08:18Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations, Trump says",
    "description": "President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://www.wcvb.com/article/kennedy-center-will-close-for-2-years-trump-says/70213977",
    "timestamp": "2026-02-02T00:08:02Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations, Trump says",
    "description": "President Donald Trump says he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction",
    "link": "https://www.wtae.com/article/kennedy-center-will-close-for-2-years-trump-says/70213977",
    "timestamp": "2026-02-02T00:07:50Z"
  },
  {
    "title": "Trump says Kennedy Center will close in July for two years for renovations | CNN Politics",
    "description": "The Kennedy Center for the Performing Arts in Washington will close for roughly two years to allow for extensive renovations, President Donald Trump said Sunday.",
    "link": "https://www.cnn.com/2026/02/01/politics/kennedy-center-trump-close",
    "timestamp": "2026-02-02T00:05:39Z"
  },
  {
    "title": "Trump Announces Plans To Close Kennedy Center For Two Years In July",
    "description": "The closure and pause on arts programming comes as many artists have withdrawn their programming from the center amid Trump's takeover.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/trump-close-kennedy-center-renovation-two-years-1236491794/",
    "timestamp": "2026-02-02T00:04:52Z"
  },
  {
    "title": "Donald Trump Will Close the Kennedy Center for Two Years for a ‘Complete Rebuilding’",
    "description": "President Donald Trump, after affixing his name to Washington, D.C.’s Kennedy Center and prompting multiple artists to cancel their performances the arts center, said he has decided that the facility must be shut down for two years to undergo a “complete rebu…",
    "link": "https://variety.com/2026/legit/news/donald-trump-close-kennedy-center-two-years-1236648812/",
    "timestamp": "2026-02-02T00:00:54Z"
  },
  {
    "title": "‘F*ck ICE!’ Parade of Music Stars Slam Trump’s Raids at Grammy Pre-Show",
    "description": "The 2026 Grammy Premiere Ceremony doubled as a star-studded protest against President Trump and his ICE raids on Sunday, with singer Kehlani yelling \"F*ck ICE!\"\nThe post ‘F*ck ICE!’ Parade of Music Stars Slam Trump’s Raids at Grammy Pre-Show first appeared on…",
    "link": "https://www.mediaite.com/media/fck-ice-parade-of-music-stars-slam-trumps-raids-at-grammy-pre-show/",
    "timestamp": "2026-02-02T00:00:44Z"
  },
  {
    "title": "Trump Is Broadening His Use of Economic Warfare",
    "description": "“Tariffs,” President Donald Trump is fond of reminding us, “is the most beautiful word to me in the dictionary.” It’s the most beautiful word “because tariffs are going to make us rich as hell. It’s going to bring our countries businesses back that left us.” …",
    "link": "https://original.antiwar.com/ted_snider/2026/02/01/trump-is-broadening-his-use-of-economic-warfare/",
    "timestamp": "2026-02-02T00:00:44Z"
  },
  {
    "title": "Fetterman Breaks With Democrats on ICE, Slams Nazi Rhetoric",
    "description": "“He really ought to lighten up, Francis,” Fetterman said. “Don’t call people and compare people to Nazis. That should be kind of fundamental at this point.”\nThe post Fetterman Breaks With Democrats on ICE, Slams Nazi Rhetoric first appeared on Le·gal In·sur·r…",
    "link": "https://legalinsurrection.com/2026/02/fetterman-breaks-with-democrats-on-ice-slams-nazi-rhetoric/",
    "timestamp": "2026-02-02T00:00:34Z"
  },
  {
    "title": "Report: 'Crazy' MS-13 Gang Member Linked to Murders in El Salvador Arrested in Virginia",
    "description": "U.S. Immigration and Customs Enforcement (ICE) officials have reportedly nabbed an MS-13 gang member accused of mass murder in El Salvador. \nThe post Report: ‘Crazy’ MS-13 Gang Member Linked to Murders in El Salvador Arrested in Virginia appeared first on Bre…",
    "link": "https://www.breitbart.com/crime/2026/02/01/report-crazy-ms-13-gang-member-linked-to-el-salvador-murders-arrested-in-virginia/",
    "timestamp": "2026-02-02T00:00:21Z"
  },
  {
    "title": "Not a Trump Anomaly: The Board of Peace and America’s Crisis-Driven Power Plays",
    "description": "The history of American power is, in many ways, the history of reinventing rules – or designing new ones – to fit US strategic interests. This may sound harsh, but it is a necessary realization, particularly in light of US President Donald Trump’s latest poli…",
    "link": "https://original.antiwar.com/ramzy-baroud/2026/02/01/not-a-trump-anomaly-the-board-of-peace-and-americas-crisis-driven-power-plays/",
    "timestamp": "2026-02-02T00:00:05Z"
  },
  {
    "title": "Why Sitharaman’s ninth budget chose continuity over courage",
    "description": "Nirmala Sitharaman's ninth budget emphasized continuity, focusing on GDP growth and increased capital expenditure. While fiscal consolidation continues slowly, the budget introduced a securities transaction tax hike on derivatives and taxed buybacks, aiming t…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/why-sitharamans-ninth-budget-chose-continuity-over-courage/articleshow/127850019.cms",
    "timestamp": "2026-02-02T00:00:00Z"
  },
  {
    "title": "Why Sitharaman’s ninth budget chose continuity over courage",
    "description": "Nirmala Sitharaman's ninth budget emphasized continuity, focusing on GDP growth and increased capital expenditure. While fiscal consolidation continues slowly, the budget introduced a securities transaction tax hike on derivatives and taxed buybacks, aiming t…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/why-sitharamans-ninth-budget-chose-continuity-over-courage/articleshow/127847311.cms",
    "timestamp": "2026-02-02T00:00:00Z"
  },
  {
    "title": "China’s relationship with foreign scientific powers is changing rapidly",
    "description": "A study that examines career histories of the country’s elite scholars reveals that the nation is turning inwards in its search for talent.",
    "link": "https://www.nature.com/articles/d41586-026-00196-6",
    "timestamp": "2026-02-02T00:00:00Z"
  },
  {
    "title": "Kennedy Center to cease entertainment operations for two years, Trump says (Reuters)",
    "description": "Feb 1 (Reuters) - The John F. Kennedy Memorial Center for Performing Arts ‍should not host any events for two years, ⁠starting on July 4, President Donald Tr...",
    "link": "https://www.smartnews.com/en-us/article/4908903549884181207",
    "timestamp": "2026-02-01T23:59:48Z"
  },
  {
    "title": "Chinese speculators set the stage for gold and silver crash on Jan 30",
    "description": "Silver’s 26 per cent plunge was the biggest on record, while gold dropped 9 per cent in its worst day in more than a decade. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/chinese-speculators-set-the-stage-for-gold-and-silver-crash-on-jan-30",
    "timestamp": "2026-02-01T23:56:41Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations in July, Trump says",
    "description": "President Donald Trump says he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction. Trump’s announcement on social media Sunday night follows a wave of cancellations since Trump ousted the previ…",
    "link": "https://apnews.com/article/trump-kennedy-center-closing-renovations-c6dba4a46e71b0d0e48d46501195366c",
    "timestamp": "2026-02-01T23:56:15Z"
  },
  {
    "title": "Students debate immigration, healthcare and affordability",
    "description": "Over 50 students gathered at the Hinckley Institute on Wednesday afternoon for a debate between the College Republicans and College Democrats. Debaters responded to three topics, with a Q&A session at the end. For each section, teams had four-minute opening s…",
    "link": "https://dailyutahchronicle.com/2026/02/01/students-debate-immigration-healthcare-and-affordability/",
    "timestamp": "2026-02-01T23:53:17Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations in July, Trump says, after performers backlash",
    "description": "The announcement follows a wave of cancellations since Trump ousted the previous leadership.",
    "link": "https://www.bostonherald.com/2026/02/01/kennedy-center-close-renovations/",
    "timestamp": "2026-02-01T23:51:21Z"
  },
  {
    "title": "Kennedy Center will close for 2 years for renovations in July, Trump says, after performers backlash",
    "description": "President Donald Trump says he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction.",
    "link": "https://richmond.com/life-entertainment/nation-world/art-theater/article_5a357cc6-bf04-5f21-9a43-e46f666ed89b.html",
    "timestamp": "2026-02-01T23:51:00Z"
  },
  {
    "title": "A list of powerful men named in the Epstein files, from Elon Musk to former Prince Andrew",
    "description": "A who's who of powerful men make appearances in the huge trove of documents released by the Justice Department in connection with its investigations of Jeffrey Epstein.",
    "link": "https://www.pbs.org/newshour/nation/a-list-of-powerful-men-named-in-the-epstein-files-from-elon-musk-to-former-prince-andrew",
    "timestamp": "2026-02-01T23:50:53Z"
  },
  {
    "title": "Grammy Winner Says 'ICE Out' Pin Almost Said Something Very Different",
    "description": "R&B singer Kehlani was one of several artists who spoke out against the agency at Sunday's awards.",
    "link": "https://www.huffpost.com/entry/kehlani-grammys-ice-out-pin_n_697fceace4b00b8d44e20c2d",
    "timestamp": "2026-02-01T23:43:27Z"
  },
  {
    "title": "Joy Villa Wears 'Scientology Kills' Outfit at 2026 Grammys",
    "description": "Joy Villa is making a statement with her 2026 Grammy Awards outfit. The 39-year-old singer wore bold outfit to the award ceremony held at Crypto.com Arena in on Sunday (February 1) in Los Angeles. Keep reading to find out more… She stepped out in a light blue…",
    "link": "https://www.justjared.com/2026/02/01/joy-villa-wears-scientology-kills-outfit-at-2026-grammys/",
    "timestamp": "2026-02-01T23:41:08Z"
  },
  {
    "title": "Open-source AI is a global security nightmare waiting to happen, say researchers",
    "description": "Also, South Korea gets a pentesting F, US Treasury says bye bye to BAH, North Korean hackers evolve, and more Infosec in Brief  As if AI weren't enough of a security concern, now researchers have discovered that open-source AI deployments may be an even bigge…",
    "link": "https://www.theregister.com/2026/02/01/opensource_ai_is_a_global/",
    "timestamp": "2026-02-01T23:40:10Z"
  },
  {
    "title": "Trump announces two-year closure of Trump Kennedy Center for major renovations",
    "description": "President Donald Trump said the Trump Kennedy Center will close on July 4, 2026, in order to carry out a two-year renovation project, promising a grand reopening.",
    "link": "https://www.foxnews.com/politics/trump-announces-two-year-closure-trump-kennedy-center-major-renovations",
    "timestamp": "2026-02-01T23:36:48Z"
  },
  {
    "title": "Blanche Whitewashes Trump's Latest Corruption With 'Spy Sheikh': Biden Did It Too",
    "description": "NARRATOR: \"No, he didn't.\" If the Biden family had done something this openly corrupt, Republicans would have been holding impeachment hearings yesterday.\nHow pathetic is it that these sort of stories coming out are just shrugged at or ignored by most of our …",
    "link": "https://crooksandliars.com/2026/02/blanche-whitewashes-trumps-latest",
    "timestamp": "2026-02-01T23:34:22Z"
  },
  {
    "title": "Rick Shiels reveals what Donald Trump was really like when he met the US president for the first time",
    "description": "Rick Shiels recently discussed his unlikely encounter with United States President Donald Trump. The Englishman is one of the most popular golfers on YouTube, with over three million subscribers.",
    "link": "https://www.hitc.com/rick-shiels-reveals-what-donald-trump-was-really-like-when-he-met-the-us-president-for-the-first-time/",
    "timestamp": "2026-02-01T23:30:00Z"
  },
  {
    "title": "Is 'MELANIA' The Worst Film Ever Made?",
    "description": "Is 'MELANIA' The Worst Film Ever Made?\r\n\n \n \n \n (First column, 6th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Launchpad for lifestyle empire...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://mattlabash.substack.com/p/is-melania-the-worst-film-ever-made",
    "timestamp": "2026-02-01T23:28:37Z"
  },
  {
    "title": "The Grammys bring more celebrity pushback to the Trump administration's immigration crackdown",
    "description": "Artists at the Grammys and Sundance wore ICE OUT protest pins and spoke out as Minneapolis faces mass deportations, highlighting celebrity activism and organizing.",
    "link": "https://www.kcra.com/article/celebrities-protest-ice-grammys-2026/70213513",
    "timestamp": "2026-02-01T23:25:58Z"
  },
  {
    "title": "The Grammys bring more celebrity pushback to the Trump administration's immigration crackdown",
    "description": "Artists at the Grammys and Sundance wore ICE OUT protest pins and spoke out as Minneapolis faces mass deportations, highlighting celebrity activism and organizing.",
    "link": "https://www.wtae.com/article/celebrities-protest-ice-grammys-2026/70213513",
    "timestamp": "2026-02-01T23:25:58Z"
  },
  {
    "title": "The Grammys bring more celebrity pushback to the Trump administration's immigration crackdown",
    "description": "Artists at the Grammys and Sundance wore ICE OUT protest pins and spoke out as Minneapolis faces mass deportations, highlighting celebrity activism and organizing.",
    "link": "https://www.wcvb.com/article/celebrities-protest-ice-grammys-2026/70213513",
    "timestamp": "2026-02-01T23:24:28Z"
  },
  {
    "title": "The Grammys bring more celebrity pushback to the Trump administration's immigration crackdown",
    "description": "Artists at the Grammys and Sundance wore ICE OUT protest pins and spoke out as Minneapolis faces mass deportations, highlighting celebrity activism and organizing.",
    "link": "https://www.wlky.com/article/celebrities-protest-ice-grammys-2026/70213513",
    "timestamp": "2026-02-01T23:23:42Z"
  },
  {
    "title": "Oil prices fall by 3% on US-Iran de-escalation",
    "description": "TOKYO, Feb 2 : Oil prices fell 3 per cent on Monday as U.S. President Donald Trump said over the weekend Iran was \"seriously talking\" with Washington, signalling de-escalation with an OPEC member after risks of a military strike drove prices to multi-month hi…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-fall-3-us-iran-de-escalation-5899821",
    "timestamp": "2026-02-01T23:20:19Z"
  },
  {
    "title": "Oil falls by over $1 per barrel as Iran talks in focus",
    "description": "TOKYO, Feb 2 : Oil prices fell by over $1 per barrel on Monday as U.S. President Donald Trump said over the weekend Iran was \"seriously talking\" with Washington. Brent crude futures were down $1.8 per barrel, losing 2.7 per cent, to $67.48 per barrel, at 2311…",
    "link": "https://www.channelnewsasia.com/business/oil-falls-over-1-barrel-iran-talks-in-focus-5899821",
    "timestamp": "2026-02-01T23:20:19Z"
  },
  {
    "title": "Oil falls by nearly 3% on Iran talks, OPEC+ production pause",
    "description": "TOKYO, Feb 2 : Oil prices fell by nearly 3 per cent on Monday as U.S. President Donald Trump said over the weekend Iran was \"seriously talking\" with Washington.Brent crude futures were down $1.90 per barrel, losing 2.8 per cent, to $67.39 per barrel at 2350 G…",
    "link": "https://www.channelnewsasia.com/business/oil-falls-nearly-3-iran-talks-opec-production-pause-5899821",
    "timestamp": "2026-02-01T23:20:19Z"
  },
  {
    "title": "Further charges unlikely in Epstein case, top prosecutor says",
    "description": "Deputy Attorney-General Todd Blanche says the existence of \"horrible photographs\" and troubling emails in the latest cache of released files does not necessarily mean prosecutions can go ahead.",
    "link": "https://www.abc.net.au/news/2026-02-02/us-deputy-attorney-general-downplays-more-epstein-files-charges/106294066",
    "timestamp": "2026-02-01T23:20:18Z"
  },
  {
    "title": "Donald Trump Has “Killed His Presidency”. Make America Great Again (MAGA) is Dead",
    "description": "Donald Trump has officially killed his presidency and the Make America Great Again (MAGA) movement or what’s left of it. Despite Trump’s remaining support from MAGA cult loyalists in his second term, it’s undeniable that he betrayed all of the …\nThe post Dona…",
    "link": "https://www.globalresearch.ca/death-maga-movement/5914341",
    "timestamp": "2026-02-01T23:17:25Z"
  },
  {
    "title": "Two CBP Agents Identified in Alex Pretti Shooting",
    "description": "The two federal immigration agents who fired on Minneapolis protester Alex Pretti are identified in government records as Border Patrol agent Jesus Ochoa and Customs and Border Protection officer Raymundo Gutierrez.The records viewed by ProPublica list Ochoa,…",
    "link": "https://www.rawstory.com/alex-pretti-2675067269/",
    "timestamp": "2026-02-01T23:16:50Z"
  },
  {
    "title": "Mexico's Sheinbaum pledges to send humanitarian aid to Cuba",
    "description": "Trump said he asked the Mexican leader to suspend oil shipments to Cuba.",
    "link": "https://abcnews.go.com/International/wireStory/mexicos-sheinbaum-pledges-send-humanitarian-aid-cuba-129759101",
    "timestamp": "2026-02-01T23:15:25Z"
  },
  {
    "title": "Texas Democrat's win a 'wake-up call' for Republicans ahead of 2026 elections",
    "description": "WASHINGTON, Feb 1 (Reuters) - A Democratic candidate won a special ‌election for the Texas state senate by a double-digit margin, taking control from Republicans for the first time in decades in a result the losing candidate ‌on Sunday called \"a wake-up call\"…",
    "link": "https://www.thestar.com.my/news/world/2026/02/02/texas-democrat039s-win-a-039wake-up-call039-for-republicans-ahead-of-2026-elections",
    "timestamp": "2026-02-01T23:15:00Z"
  },
  {
    "title": "Elected govt in Manipur soon? NDA MLAs from hill state summoned to Delhi",
    "description": "India News: Manipur’s NDA lawmakers have been summoned to New Delhi, triggering fresh speculation that an elected govt could be restored in the violence-scarred s.",
    "link": "https://timesofindia.indiatimes.com/india/elected-govt-in-manipur-soon-nda-mlas-from-hill-state-summoned-to-delhi/articleshow/127849639.cms",
    "timestamp": "2026-02-01T23:10:56Z"
  },
  {
    "title": "New York Times Uncovers 5,300+ Epstein Files Mentioning Trump in Exhaustive Analysis",
    "description": "The New York Times reported Sunday that President Donald Trump's named appeared in more than 5,300 of the documents, including more than a dozen FBI tips.\nThe post New York Times Uncovers 5,300+ Epstein Files Mentioning Trump in Exhaustive Analysis first appe…",
    "link": "https://www.mediaite.com/media/news/new-york-times-uncovers-5300-epstein-files-mentioning-trump-in-exhaustive-analysis/",
    "timestamp": "2026-02-01T23:10:21Z"
  },
  {
    "title": "Dooming the Chagos Deal: The UK-Mauritius Deal, The Dilemma of the U.S. Diego Garcia Military Base",
    "description": "When remote islands start to interest chatterboxes in think tanks and bureaucrats in foreign ministries, we can only assume that some matters will be exaggerated over others. With the Chagos Islands, there is one matter that is hard to exaggerate. …\nThe post …",
    "link": "https://www.globalresearch.ca/dooming-chagos-deal-diego-garcia-dilemma/5914383",
    "timestamp": "2026-02-01T23:09:56Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "More than 100 S&P 500 companies are due to report this week, including Amazon, Alphabet and Disney.",
    "link": "https://www.cnbc.com/2026/02/01/stock-market-today-live-updates.html",
    "timestamp": "2026-02-01T23:06:32Z"
  }
]