[
  {
    "title": "Trump suddenly at risk of losing a ‘pillar’ of his trade strategy and having to refund a big chunk of $159 billion from tariff revenues",
    "description": "Trump's tariffs remain in place despite a 7-4 appeals court decision that they're illegal, as his administration has vowed to appeal to the Supreme Court.",
    "link": "https://fortune.com/2025/08/30/trump-tariffs-illegal-what-it-means-explainer-supreme-court-illegal/",
    "timestamp": "2025-08-30T15:34:57Z"
  },
  {
    "title": "Dana White confirms White House UFC event 'is on' despite people calling out 'trashy' event",
    "description": "White and Trump have promised a different type of event for the 4th of July",
    "link": "https://www.ladbible.com/news/sport/dana-white-ufc-4-july-donald-trump-249747-20250830",
    "timestamp": "2025-08-30T15:34:43Z"
  },
  {
    "title": "EXCLUSIVE: Trump Lays ‘America First’ Plan For Helping Ukraine End War, Casts Doubt On Putin-Zelenskyy Meeting",
    "description": "Trump told the Daily Caller that a Putin-Zelenskyy meeting seems unlikely, while explaining why he is considering using American jets to end the war.",
    "link": "https://dailycaller.com/2025/08/30/donald-trump-daily-caller-interview-russia-ukraine-zelenskyy-putin/",
    "timestamp": "2025-08-30T15:33:09Z"
  },
  {
    "title": "FBI Director’s Girlfriend Sues Podcaster Over Claim She’s a Spy for Israel",
    "description": "\"Ms. Wilkins is not even Jewish, much less Israeli, and has never set foot in Israel,\" according to the lawsuit.",
    "link": "https://gizmodo.com/fbi-directors-girlfriend-sues-podcaster-over-claim-shes-a-spy-for-israel-2000650859",
    "timestamp": "2025-08-30T15:30:38Z"
  },
  {
    "title": "Trump spotted on Golf Course after wild internet rumors claimed he was dead",
    "description": "Rumors of Donald Trump's death spread online after he was not seen publicly for days. Social media buzzed with speculation. The hashtag #whereistrump trended. Trump reappeared on Saturday morning. He was seen leaving the White House with his granddaughter Kai…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-spotted-on-golf-course-after-wild-internet-rumors-claimed-he-was-dead/articleshow/123604018.cms",
    "timestamp": "2025-08-30T15:30:35Z"
  },
  {
    "title": "Trump's Intel stake sparks cries of 'socialism' from his party, but he vows more deals are coming",
    "description": "Donald Trump has a message for critics who think turning the U.S. government into a major stockholder of Intel is a “socialist” move: More is coming.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_87b2d4ce-6565-5ed6-bdc4-e57c422337e2.html",
    "timestamp": "2025-08-30T15:30:00Z"
  },
  {
    "title": "U.S. Amb. to NATO: Trump Will Give Putin 'as Much Time as He Thinks Is Necessary'",
    "description": "On Friday’s broadcast of the Fox News Channel’s “The Story,” U.S. Ambassador to NATO Matt Whitaker responded to a question on how long President Donald Trump will give Vladimir Putin to meet with Ukrainian President Volodymyr Zelensky by saying that\nThe post …",
    "link": "https://www.breitbart.com/clips/2025/08/30/u-s-amb-to-nato-trump-will-give-putin-as-much-time-as-he-thinks-is-necessary/",
    "timestamp": "2025-08-30T15:26:23Z"
  },
  {
    "title": "U.S. Amb. to NATO: 'Most Likely' Ukrainians Will Use 'Deeper Strike Capabilities' We're Giving, It's 'Much Different' from Biden",
    "description": "On Friday’s broadcast of the Fox News Channel’s “The Story,” U.S. Ambassador to NATO Matt Whitaker responded to a question on how President Donald Trump’s policies on the Russia-Ukraine war are different from the Biden administration’s by saying we aren’t\nThe…",
    "link": "https://www.breitbart.com/clips/2025/08/30/u-s-amb-to-nato-most-likely-ukrainians-will-use-deeper-strike-capabilities-were-giving-its-much-different-from-biden/",
    "timestamp": "2025-08-30T15:26:21Z"
  },
  {
    "title": "Donald Trump’s Health: His Chronic Venous Insufficiency Explained",
    "description": "Trump's physician released a memo revealing his 2025 chronic venous insufficiency condition. Learn about the president's overall health here.",
    "link": "https://hollywoodlife.com/feature/donald-trump-health-5429125/",
    "timestamp": "2025-08-30T15:25:39Z"
  },
  {
    "title": "Trump Simpson Clip: Prediction goes viral amid Donald Trump health rumours. Here’s what the video says",
    "description": "Trump Simpson Clip has gone viral after claims that The Simpsons predicted Donald Trump’s death in 2025. The video, alongside health reports and online speculation, has fuelled trending rumours about the US President.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-simpson-clip-donald-trump-health-simpsons-prediction-2025-trump-is-dead-trend-jd-vance-us-flag-half-mast-trump-chronic-venous-insufficiency-social-media-rumours/articleshow/123604002.cms",
    "timestamp": "2025-08-30T15:25:30Z"
  },
  {
    "title": "Thanks to John Roberts & Co., it’s quite literally the case that JD Vance has the legal power to make himself president, and nobody could do anything about it",
    "description": "Following up on my cheery disquisitions from this morning, the following statements about the current state of American constitutional law are absolutely unimpeachable: (1) Under the 25th amendment, if JD Vance gets half of the cabinet to sign a letter declar…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/thanks-to-john-roberts-its-quite-literally-the-case-that-jd-vance-has-the-legal-power-to-make-himself-president-and-nobody-could-do-anything-about-it",
    "timestamp": "2025-08-30T15:24:45Z"
  },
  {
    "title": "Crenshaw Heckled About Trump, Epstein Files At Bonkers Town Hall",
    "description": "Trump ally Rep. Dan Crenshaw faced utter chaos at a town hall where he was heckled constantly about President Donald Trump and Jeffrey Epstein.\nThe post Crenshaw Heckled About Trump, Epstein Files At Bonkers Town Hall first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/crenshaw-heckled-about-trump-epstein-files-at-bonkers-town-hall/",
    "timestamp": "2025-08-30T15:21:38Z"
  },
  {
    "title": "Palestinian Authority urges US to reinstate Abbas’s visa before UNGA",
    "description": "Mahmoud Abbas's spokesman calls on countries to exert pressure on Washington before next month's UN annual meetings.",
    "link": "https://www.aljazeera.com/news/2025/8/30/palestinian-authority-urges-us-to-reinstate-abbass-visa-before-unga",
    "timestamp": "2025-08-30T15:18:19Z"
  },
  {
    "title": "Karoline Leavitt Says It Was Trump's Idea for Cracker Barrel To Keep Logo",
    "description": "Karoline Leavitt Says It Was Trump's Idea for Cracker Barrel To Keep Logocafemom.com",
    "link": "https://cafemom.com/entertainment/karoline-leavitt-says-trump-idea-cracker-barrel-keep-old-logo",
    "timestamp": "2025-08-30T15:16:25Z"
  },
  {
    "title": "'Peace And Stability': PM Modi Speaks To Ukraine's Zelenskyy Ahead Of Talks With Putin In China",
    "description": "\"We exchanged views on the ongoing conflict, its humanitarian aspect, and efforts to restore peace and stability. India extends full support to all efforts in this direction,\" Modi said.",
    "link": "https://www.ndtvprofit.com/world/peace-and-stability-pm-modi-speaks-to-ukraines-zelenskyy-ahead-of-talks-with-putin-in-china",
    "timestamp": "2025-08-30T15:10:52Z"
  },
  {
    "title": "Minneapolis shooter Robin Westman’s mom once starred in a film directed by daughter she gave up for adoption",
    "description": "The mother of transgender Minneapolis mass shooter Robin Westman once appeared in a movie made by her daughter — who she gave up for adoption as a child, a report revealed. Mary Grace Westman, 67, starred in the short film “Mary Meets Grace,” written and dire…",
    "link": "https://freerepublic.com/focus/f-chat/4337636/posts",
    "timestamp": "2025-08-30T15:07:49Z"
  },
  {
    "title": "President Trump is alive and well after online rumors of his death",
    "description": "Trump was photographed in a white polo, black pants and his signature red MAGA hat about 8:45 a.m. , appearing alongside his granddaughter, Kai Trump, as they loaded up in a vehicle headed for his golf club in Sterling, Va.",
    "link": "https://nypost.com/2025/08/30/us-news/president-trump-is-alive-and-well-after-online-rumors-of-his-death/",
    "timestamp": "2025-08-30T15:07:32Z"
  },
  {
    "title": "Where is Donald Trump today and what are his plans for Labor Day amid his death rumors",
    "description": "Speculation surrounding U.S. President Donald Trump’s whereabouts surged on Saturday, dominating Google search trends and sparking a wave of social media chatter. Hashtags like “Trump missing” and “where is Trump” quickly climbed to the top of trending lists …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-death-rumours-where-is-donald-trump-today-and-when-was-he-last-seen/articleshow/123602824.cms",
    "timestamp": "2025-08-30T15:01:21Z"
  },
  {
    "title": "Are Trump’s Tariffs Still In Effect? What To Know After Court Rules Most Levies Are Illegal",
    "description": "Trump challenged the appellate court ruling and claimed the Supreme Court would likely keep his tariffs in place.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/30/are-trumps-tariffs-still-in-effect-what-to-know-after-court-rules-most-levies-are-illegal/",
    "timestamp": "2025-08-30T15:00:10Z"
  },
  {
    "title": "Married Rapper 21 Savage Spotted Out With GF Latto!",
    "description": "21 Savage Spotted On Vacation With Latto … Even Though He’s Still Legally Married! It looks like 21 Savage and Latto are still going strong — despite the fact that their situation is as messy as it gets. Media Take Out has learned that the two rappers were sp…",
    "link": "https://mediatakeout.com/married-rapper-21-savage-spotted-out-with-gf-latto/",
    "timestamp": "2025-08-30T14:58:30Z"
  },
  {
    "title": "‘15 times higher than Delhi’: Trump admin flags surge in murders in Chicago",
    "description": "The White House’s comments come in the aftermath of a school shooting in Minnesota, as it seeks to push for greater federal intervention in the city",
    "link": "https://indianexpress.com/article/delhi/15-times-higher-than-delhi-trump-flags-surge-in-murders-in-chicago-10220833/",
    "timestamp": "2025-08-30T14:57:44Z"
  },
  {
    "title": "Racist Lies About College “Quotas” Stoke Support for Trump’s War on Higher Ed",
    "description": "College quotas haven’t existed since 1978, but the right keeps people misinformed.",
    "link": "https://truthout.org/articles/racist-lies-about-college-quotas-stoke-support-for-trumps-war-on-higher-ed/",
    "timestamp": "2025-08-30T14:55:12Z"
  },
  {
    "title": "Federal court strikes Trump’s tariffs — will consumers finally see cheaper imports",
    "description": "The federal appeals court’s decision against Trump’s sweeping tariffs has thrown U.S. trade policy into limbo — but not prices at the checkout line. Despite the ruling, tariffs are still in force until mid-October, leaving Americans stuck with costlier cars, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/federal-court-strikes-trumps-tariffs-will-consumers-finally-see-cheaper-imports/articleshow/123602672.cms",
    "timestamp": "2025-08-30T14:51:53Z"
  },
  {
    "title": "Transgender Maniac Called “Republican MAGA Person”",
    "description": "It would be difficult to overstate the extent to which true believer moonbats insulate themselves from reality. They live in an alternative universe that rarely overlaps with ours. This is facilitated by immersion in the liberal establishment media, which pro…",
    "link": "https://moonbattery.com/transgender-maniac-called-republican-maga-person/",
    "timestamp": "2025-08-30T14:51:33Z"
  },
  {
    "title": "On Ukraine, Ignore What Trump Says - Watch What He Does",
    "description": "On Ukraine, Ignore What Trump Says - Watch What He Does\n \nAuthored by Larry C. Johnson\nI continue to believe that it is more important to watch what Donald Trump does rather than focus on what he says. However, his remarks during the meeting of his cabinet ea…",
    "link": "https://biztoc.com/x/46d4795851c7266a",
    "timestamp": "2025-08-30T14:46:22Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a U.S. appeals court has struck them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products.\nNow a federal appeals court has thrown a roadblock in his path.",
    "link": "https://biztoc.com/x/fb09e86028648015",
    "timestamp": "2025-08-30T14:46:05Z"
  },
  {
    "title": "MIKE DAVIS: Here's what can be done about the dump that is DC",
    "description": "D.C. grand jury declines to indict Justice Department lawyer Sean Dunn for assaulting federal officers, highlighting partisan legal system issues under Trump reforms.",
    "link": "https://www.foxnews.com/opinion/mike-davis-can-anything-done-about-dumpd",
    "timestamp": "2025-08-30T14:42:14Z"
  },
  {
    "title": "Foreign students are vital revenue source for colleges, including many small Christian schools. Now enrollment is sinking amid Trump policies",
    "description": "International students represent at least 20% of enrollment at more than 100 colleges with endowments of less than $250,000 per student.",
    "link": "https://fortune.com/2025/08/30/foreign-students-revenue-source-colleges-christian-schools-enrollment-trump-policies/",
    "timestamp": "2025-08-30T14:39:58Z"
  },
  {
    "title": "CNN’s Scott Jennings Smirks As SE Cupp Goes Off On Him Over Vaccines: ‘You Seem To Be Very Angry With Me’",
    "description": "Scott Jennings smirked when S.E. Cupp lost it on him during an argument about vaccine misinformation and \"pregnant people,\" accusing him of spouting \"B.S.\"\nThe post CNN’s Scott Jennings Smirks As SE Cupp Goes Off On Him Over Vaccines: ‘You Seem To Be Very Ang…",
    "link": "https://www.mediaite.com/media/tv/cnns-scott-jennings-smirks-as-se-cupp-goes-off-on-him-over-vaccines-you-seem-to-be-very-angry-with-me/",
    "timestamp": "2025-08-30T14:37:01Z"
  },
  {
    "title": "Donald Trump Spotted Heading to Golf Course Amid False Online Death Rumors",
    "description": "Donald Trump looks alive and well ... this after ridiculous online rumors have been circling about his current status -- and even questioning if he's alive. The prez was seen boarding his motorcade on the South Lawn of the White House Saturday…",
    "link": "https://www.tmz.com/2025/08/30/donald-trump-golf-course-seen-not-dead-rumors/",
    "timestamp": "2025-08-30T14:31:36Z"
  },
  {
    "title": "'Horrifying': Senator lays into 'nutcase' RFK Jr for 'dismantling' public health - NewsBreak",
    "description": "Sen. Peter Welch (D-VT) used his Thursday interview with MSNBC's Chris Hayes to tear into Secretary of Health and Human Services Robert F. Kennedy Jr., the",
    "link": "https://www.newsbreak.com/share/4202869054849-horrifying-senator-lays-into-nutcase-rfk-jr-for-dismantling-public-health?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1756564025&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.35.0.34%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-08-30T14:27:30Z"
  },
  {
    "title": "Germany's Merz: Ukraine allies must ensure Russia can no longer economically wage war",
    "description": "BERLIN (Reuters) -German Chancellor Friedrich Merz said on Saturday he expected that Russia would only stop its war against Ukraine once it could no longer wage it for economic and military reasons, given that diplomatic efforts in recent weeks had failed. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/germany039s-merz-ukraine-allies-must-ensure-russia-can-no-longer-economically-wage-war",
    "timestamp": "2025-08-30T14:25:00Z"
  },
  {
    "title": "Where in the world is Donald Trump? Rumors swirl heading into the holiday weekend",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_686fcc33-0222-4d3c-8364-8eae39f7557a",
    "timestamp": "2025-08-30T14:24:41Z"
  },
  {
    "title": "Al-Qaeda strikes back in 2025: They’re not done with us yet",
    "description": "A decade after its defeat in Yemen, the terror group is back with new tactics, global targets, and a digital playbook Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623705-comeback-jihad-al-qaeda/",
    "timestamp": "2025-08-30T14:23:26Z"
  },
  {
    "title": "Missouri is next to answer Trump's call for redrawn maps that boost GOP in 2026",
    "description": "Republican Gov. Mike Kehoe said Friday that he is calling Missouri lawmakers into a special session to redraw the state’s U.S. House districts as part of a growing national battle between Republicans and Democrats seeking an edge in next year’s congressional …",
    "link": "https://freerepublic.com/focus/f-news/4337631/posts",
    "timestamp": "2025-08-30T14:22:02Z"
  },
  {
    "title": "Germany's Merz: Ukraine allies must ensure Russia can no longer economically wage war",
    "description": "BERLIN (Reuters) -German Chancellor Friedrich Merz said on Saturday he expected that Russia would only stop its war against Ukraine once it could no longer...",
    "link": "https://www.yahoo.com/news/articles/germanys-merz-ukraine-allies-must-141815288.html",
    "timestamp": "2025-08-30T14:18:15Z"
  },
  {
    "title": "In Just Six Words, Trump Shuts Down Crime Debate with Maryland Governor: 'Stop Talking and ...'",
    "description": "President Donald Trump has been sparring with Moore about crime levels in his state, shutting him down with six simple words.",
    "link": "https://www.westernjournal.com/just-six-words-trump-shuts-crime-debate-maryland-governor-stop-talking/",
    "timestamp": "2025-08-30T14:11:37Z"
  },
  {
    "title": "Report: Joni 'We're-All-Going-To-Die' Ernst Not Running For Re-Election",
    "description": "This move puts Iowa Republicans in a bit of a pickle. The ambitious and well-known among them have announced or are considering running for Governor, as Kim Reynolds is also stepping down. It's just not a great time to be a Republican in Iowa these days.\nSour…",
    "link": "https://crooksandliars.com/2025/08/report-joni-were-all-going-die-ernst-not",
    "timestamp": "2025-08-30T14:11:13Z"
  },
  {
    "title": "GOP Rep Flees Town Hall Through Back Door",
    "description": "Republican Alabama Rep. Barry Moore hit the back door to exit a heated town hall.\nHis first mistake was trying to defend Donald Trump. \nMoore's constituents in Daphne were angry, and when chants of 'shame!' rang out, Moore abandoned the town hall where the ra…",
    "link": "https://crooksandliars.com/2025/08/gop-flees-town-hall-back-door",
    "timestamp": "2025-08-30T14:10:56Z"
  },
  {
    "title": "카멀라 해리스와 CBS 미쳤구만",
    "description": "FEMA workers, former disaster officials, and watchdogs warn President Donald Trump’s downsizing efforts have decimated institutional knowledge, cut off the talent pipeline, and hobbled morale among those left, testing the country’s ability to withstand future…",
    "link": "https://ryueyes11.tistory.com/511813",
    "timestamp": "2025-08-30T14:09:01Z"
  },
  {
    "title": "Russia wages non-stop offensive along Ukraine front line, says military chief",
    "description": "(Reuters) -Russian forces are waging a non-stop offensive along almost the entire front line in Ukraine and have the \"strategic initiative\", the chief of Russia's general staff said on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/russia-wages-non-stop-offensive-along-ukraine-front-line-says-military-chief",
    "timestamp": "2025-08-30T14:09:00Z"
  },
  {
    "title": "Trump 'no longer has plans' to visit India for Quad Summit: NYT",
    "description": "Donald Trump reportedly canceled his planned India visit for the Quad Summit, signaling a deterioration in relations with Narendra Modi. The NYT reports that Trump's claims of resolving the India-Pakistan conflict and his unsubtle pursuit of a Nobel Peace Pri…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-no-longer-has-plans-to-visit-india-for-quad-summit-nyt/articleshow/123603543.cms",
    "timestamp": "2025-08-30T14:08:53Z"
  },
  {
    "title": "Is Trump really dead at 79 — What’s fueling the shocking death hoax as the president vanishes from public view?",
    "description": "Rumors claiming Trump died at 79 have gone viral, fueled by his brief public absence, JD Vance’s remarks, and wild Simpsons theories. But the president was just spotted golfing, alive and well. Here’s what really sparked the shocking ‘Trump death’ hoax and wh…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-trump-really-dead-at-79-whats-fueling-the-shocking-death-hoax-as-the-president-vanishes-from-public-view/articleshow/123603428.cms",
    "timestamp": "2025-08-30T14:06:26Z"
  },
  {
    "title": "Big money and names power the campaign to influence California voters over a new congressional map",
    "description": "California voters will decide in November whether to OK a new congressional map that would benefit Democrats",
    "link": "https://abcnews.go.com/Politics/wireStory/big-money-names-power-campaign-influence-california-voters-125122346",
    "timestamp": "2025-08-30T14:06:26Z"
  },
  {
    "title": "Burying the Bruises ... On Monday, press photographers gathered in the Oval Office ... (Jon Passantino/Status)",
    "description": "Jon Passantino / Status:\nBurying the Bruises … On Monday, press photographers gathered in the Oval Office to capture President Donald Trump meeting with South Korean President Lee Jae Myung when one unusual detail stood out.  A large bruise on the back of Tru…",
    "link": "https://www.memeorandum.com/250830/p20",
    "timestamp": "2025-08-30T14:05:00Z"
  },
  {
    "title": "Sorry economists, the foreign policy experts are right on Trump",
    "description": "The experts advocate a firm stance, urging India to resist yielding to pressure to abandon its independent foreign policy, particularly regarding Russia. Countermeasures, like reconsidering US arms purchases and leveraging pharmaceutical patents, are proposed…",
    "link": "https://timesofindia.indiatimes.com/toi-plus/business-economy/sorry-economists-the-foreign-policy-experts-are-right-on-trump/articleshow/123603272.cms",
    "timestamp": "2025-08-30T14:02:03Z"
  },
  {
    "title": "Trump could retreat from Ukraine negotiations",
    "description": "United States President Donald Trump is considering stepping back from efforts to mediate the conflict between Ukraine and Russia after weeks of stalled talks, Axios reported, citing senior White Hous...",
    "link": "https://biztoc.com/x/040d6b46d58f8cc6",
    "timestamp": "2025-08-30T14:01:16Z"
  },
  {
    "title": "EMPTY SCHEDULE RAISES EYEBROWS",
    "description": "Here's what to know about the social media speculation heading into Labor Day Weekend.",
    "link": "https://www.pennlive.com/news/2025/08/where-is-donald-trump-wild-rumors-swirl-around-president-heading-into-weekend.html",
    "timestamp": "2025-08-30T14:00:07Z"
  },
  {
    "title": "Trump Vowed to ‘Stand Behind’ New Orleans After Katrina — Then Let Real Estate Project Die",
    "description": "Donald Trump vowed to \"stand by\" New Orleans after Hurricane Katrina, but let a real estate project he said would help rebuild the city die.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-vowed-new-orleans-katrina-real-estate-project-1235418837/",
    "timestamp": "2025-08-30T14:00:00Z"
  },
  {
    "title": "CHP to protect ex-VP Kamala Harris after Trump pulls Secret Service detail, sources say (Richard Winton/Los Angeles Times)",
    "description": "Richard Winton / Los Angeles Times:\nCHP to protect ex-VP Kamala Harris after Trump pulls Secret Service detail, sources say  —  Former Vice President Kamala Harris will receive protection from the California Highway Patrol after President Donald Trump revoked…",
    "link": "https://www.memeorandum.com/250830/p19",
    "timestamp": "2025-08-30T13:50:01Z"
  },
  {
    "title": "NEWS: Trump is \"Fine\" and Golfing Amid Health Speculation",
    "description": "Trump is \"fine\" and golfing amid health rumors, Trump says ending tariffs will be the downfall of America, Republicans are heckled across the country at town halls, extremists discuss using drones",
    "link": "https://aaronparnas.substack.com/p/news-trump-is-fine-and-golfing-amid",
    "timestamp": "2025-08-30T13:45:54Z"
  },
  {
    "title": "DOJ staffer fired after shocking obscene gesture at National Guard in DC caught on camera",
    "description": "A justice department official was fired for making a vulgar gesture to members of the national guard deployed in Washington DC on her way to work. The employee, Elizabeth Baxter, was a paralegal at the department’s environmental defense section. Elizabeth Bax…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-doj-staffer-elizabeth-baxter-fired-after-shocking-obscene-gesture-at-national-guard-in-dc-caught-on-camera/articleshow/123603274.cms",
    "timestamp": "2025-08-30T13:45:26Z"
  },
  {
    "title": "The calculated silence of America's business and finance leaders (Financial Times)",
    "description": "Financial Times:\nThe calculated silence of America's business and finance leaders  —  As Donald Trump has launched a series of blunt interventions in the corporate and financial worlds, he has received little pushback from industry or investors  —  When Zohra…",
    "link": "https://www.memeorandum.com/250830/p18",
    "timestamp": "2025-08-30T13:45:00Z"
  },
  {
    "title": "Trump’s secret weapon: What is IEEPA, the Law he used to slap tariffs on America’s friends and foes?",
    "description": "Donald Trump’s sweeping use of emergency powers to impose global tariffs has ignited a fierce legal and economic battle. Courts are questioning whether presidents can stretch emergency laws to set trade policy, while businesses, consumers, and global markets …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-secret-weapon-what-is-ieepa-the-law-he-used-to-slap-tariffs-on-americas-friends-and-foes/articleshow/123602310.cms",
    "timestamp": "2025-08-30T13:44:07Z"
  },
  {
    "title": "US Court of Appeal rules Trump tariffs illegal",
    "description": "President Trump has reacted furiously to an appeals court ruling that found his tariffs policy to be mostly illegal. He said if the judgement was allowed to stand it would destroy the United States. The court ruled that the president had unlawfully invoked em…",
    "link": "https://www.bbc.co.uk/programmes/w172zss7g227dkc",
    "timestamp": "2025-08-30T13:44:00Z"
  },
  {
    "title": "Trump officials shift blame for failed Ukraine peace talks on unwitting party: report",
    "description": "Amid the stalled peace talks kicked off by President Donald Trump to end the Russo-Ukraine War, a number of Trump officials are now casting blame elsewhere in a move that has left some of America’s allies “puzzled,” Axios reported Saturday.\"The Europeans don'…",
    "link": "https://www.rawstory.com/ukraine-2673942931/",
    "timestamp": "2025-08-30T13:42:23Z"
  },
  {
    "title": "PM Modi Refused To Speak To Trump 'Several Times' Post War Mediation Claims: NYT",
    "description": "The Donald Trump-led administration, in recent days, has targeted India with additional tariffs, and statements that directly link the country with the ongoing Russia-Ukraine war. Amid Trump's tirade, a New York Times article on Saturday claimed that the US p…",
    "link": "https://www.ndtvprofit.com/nation/pm-modi-refused-to-speak-to-trump-several-times-declined-washington-visit-nyt",
    "timestamp": "2025-08-30T13:41:39Z"
  },
  {
    "title": "BREAKING: Trump Spotted After Widespread And Giddy Speculation He Is Secretly Dead Or Dying",
    "description": "President Donald Trump was spotted Saturday morning after a day of speculation by gleeful opponents that he may have been dead or dying.\nThe post BREAKING: Trump Spotted After Widespread And Giddy Speculation He Is Secretly Dead Or Dying first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/trump-spotted-after-widespread-and-giddy-speculation-he-is-secretly-dead-or-dying/",
    "timestamp": "2025-08-30T13:39:20Z"
  },
  {
    "title": "Trump Pictured Heading to Play Golf After Baseless Viral Death Speculation",
    "description": "False rumors that President Donald Trump had died went viral across social media.",
    "link": "https://biztoc.com/x/2cc2e04286a806d6",
    "timestamp": "2025-08-30T13:38:46Z"
  },
  {
    "title": "Massive Trump Cutbacks Bring the 'Green New Deal' Crashing Down, Biden's Offshore Wind Agenda Officially Over",
    "description": "Massive Trump Cutbacks Bring the 'Green New Deal' Crashing Down, Biden's Offshore Wind Agenda Officially Overwesternjournal.com",
    "link": "https://www.westernjournal.com/trump-admin-deals-massive-blow-bidens-offshore-wind-dreams/",
    "timestamp": "2025-08-30T13:37:32Z"
  },
  {
    "title": "“Fire RFK Jr. Now.”",
    "description": "180 shots fired, 150 broken windows. Tumultuous firings and resignations at the Centers for Disease Control and Prevention. The installation of a techno-optimist with a history of pushing unproven medical treatments. The month of August 2025 may go down as th…",
    "link": "https://www.motherjones.com/politics/2025/08/fire-rfk-jr-now/",
    "timestamp": "2025-08-30T13:37:13Z"
  },
  {
    "title": "Hating the artist, hating the art",
    "description": "(Disclaimer: to the extent that this article was inspired by a specific creator, it’s not a creator you’ve heard of, and not one that I mention anywhere in the article! I mention a few authors as examples, but I was not setting out to specifically comment on …",
    "link": "https://freethoughtblogs.com/atrivialknot/2025/08/30/hating-the-artist-hating-the-art/",
    "timestamp": "2025-08-30T13:35:18Z"
  },
  {
    "title": "Trump Pictured Heading to Play Golf After Baseless Viral Death Speculation",
    "description": "False rumors that President Donald Trump had died went viral across social media.",
    "link": "https://www.newsweek.com/donald-trump-playing-golf-baseless-viral-death-rumors-2122068",
    "timestamp": "2025-08-30T13:33:20Z"
  },
  {
    "title": "Taylor Swift Wedding Location: New Zealand Makes a Plea!",
    "description": "Reading Time: 2 minutesTaylor Swift might get married in... New Zealand??? We have a strong reason to believe this may be the case.\nTaylor Swift Wedding Location: New Zealand Makes a Plea! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/08/taylor-swift-wedding-location-new-zealand-makes-a-plea/",
    "timestamp": "2025-08-30T13:32:35Z"
  },
  {
    "title": "The Offshore Wind Industry Is Forever (Offshore Wind Jobs, Not So Much)",
    "description": "On August 29, US Transportation Secretary Sean Duffy announced that 12 portside projects in support of the US offshore wind industry will lose their federal funding.\nThe post The Offshore Wind Industry Is Forever (Offshore Wind Jobs, Not So Much) appeared fir…",
    "link": "https://cleantechnica.com/2025/08/30/the-offshore-wind-industry-is-forever-offshore-wind-jobs-not-so-much/",
    "timestamp": "2025-08-30T13:30:51Z"
  },
  {
    "title": "Happy Labor Day: Marco Rubio Gives OMB Director Russ Vought One of His Four Jobs; Will Oversee ‘Closeout’ of USAID",
    "description": "Secretary of State, National Security Advisor and National Archivist Marco Rubio announced going into the Labor Day holiday weekend he has given his fourth job, that of head of USAID, to Russ Vought, the director of the Office of Management and Budget and act…",
    "link": "https://www.thegatewaypundit.com/2025/08/happy-labor-day-marco-rubio-gives-omb-director/",
    "timestamp": "2025-08-30T13:30:23Z"
  },
  {
    "title": "Inside the billion-dollar pipeline funding the deep state",
    "description": "In a column earlier this month, I argued the deep state is no longer deniable, thanks to Director of National Intelligence Tulsi Gabbard. I outlined the structural design of the deep state as revealed by two recent declassifications: Gabbard’s ODNI report and…",
    "link": "https://www.theblaze.com/columns/opinion/inside-the-billion-dollar-pipeline-funding-the-deep-state",
    "timestamp": "2025-08-30T13:30:00Z"
  },
  {
    "title": "Trump Bid to Block $4.9 Billion With 'Pocket Rescission' Blasted as 'Authoritarianism 101'",
    "description": "Democracy defenders and members of Congress are condemning US President Donald Trump's effort to use a \"pocket rescission\" process to block $4.9 billion in foreign aid as authoritarian and illegal. The Office of Management and Budget (OMB) on Friday shared on…",
    "link": "https://www.commondreams.org/news/pocket-rescission",
    "timestamp": "2025-08-30T13:28:26Z"
  },
  {
    "title": "The Disappearance Machine",
    "description": "\"What is done cannot be undone, but one can prevent it from happening again.\"—Anne FrankUS President Donald Trump has federalized the DC police department and put more than 2,000 National Guard troops on city streets, even as crime remains at historic lows. I…",
    "link": "https://www.commondreams.org/opinion/immigration-disappearance-machine",
    "timestamp": "2025-08-30T13:24:02Z"
  },
  {
    "title": "Russia & China Sync Up on US Strategy Ahead of Putin–Xi Talks",
    "description": "Russia and China are closer than ever in their approach to the United States, said Beijing-based expert, author and columnist Francesco Sisci.",
    "link": "https://sputnikglobe.com/20250830/russia--china-sync-up-on-us-strategy-ahead-of-putinxi-talks-1122688451.html",
    "timestamp": "2025-08-30T13:23:49Z"
  },
  {
    "title": "Weird Trump Music Pool Reports Drop Amid Furor Over Empty Schedule",
    "description": "Several weird pool reports about music wafting from the Rose Garden of the White House dropped as President Donald Trump's schedule raises eyebrows.\nThe post Weird Trump Music Pool Reports Drop Amid Furor Over Empty Schedule first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/print/weird-trump-music-pool-reports-drop-amid-furor-over-empty-schedule/",
    "timestamp": "2025-08-30T13:20:07Z"
  },
  {
    "title": "Trump hasn’t been seen in public for 4 days and social media has completely lost its mind",
    "description": "Trump hasn’t been seen in public for 4 days and social media has completely lost its mindnj.com",
    "link": "https://www.nj.com/news/2025/08/trump-hasnt-been-seen-in-public-for-4-days-and-social-media-has-completely-lost-its-mind.html",
    "timestamp": "2025-08-30T13:16:02Z"
  },
  {
    "title": "Andrew Cuomo enthusiastically gave us the no-bail law",
    "description": "The ex-gov is whiplashing himself all over the place on his record of criminal-justice reform as he pretends against all evidence — and sanity — to be the pro-public-safety mayoral candidate.",
    "link": "https://nypost.com/2025/08/30/opinion/andrew-cuomo-was-the-author-of-bail-reform-in-new-york/",
    "timestamp": "2025-08-30T13:12:27Z"
  },
  {
    "title": "Will the National Parks Survive Trump?",
    "description": "From layoffs to billion-dollar budget cuts and ideological battles over history itself, the National Park Service is facing one of the most turbulent moments in its 109-year history. On this week’s Reveal, reporter Heath Druzin hikes deep into Yellowstone Nat…",
    "link": "https://www.motherjones.com/politics/2025/08/will-the-national-parks-survive-trump/",
    "timestamp": "2025-08-30T13:10:32Z"
  },
  {
    "title": "Russian strikes batter Ukraine as Zelenskyy accuses Putin of stalling peace talks",
    "description": "Russia launched another massive attack across Ukraine as President Volodymyr Zelensky accused Moscow of dragging out peace negotiations.",
    "link": "https://www.nbcnews.com/world/ukraine/russia-strikes-ukraine-zelenskyy-putin-stalling-peace-talks-trump-rcna228169",
    "timestamp": "2025-08-30T13:10:11Z"
  },
  {
    "title": "Trump was diagnosed with Chronic venous insufficiency after visible swelling and bruises. How serious is it?",
    "description": "In July, US President Donald Trump was diagnosed with chronic venous insufficiency (CVI) after swelling and bruises were spotted on his hands and legs. Public speculation about Trump's health has grown over time after bruises were spotted on his hand. Rumors …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-dead-rumours-was-diagnosed-with-chronic-venous-insufficiency-after-swelling-and-bruises-how-serious-is-it/articleshow/123602897.cms",
    "timestamp": "2025-08-30T13:09:02Z"
  },
  {
    "title": "Gryphon Digital Mining to Merge with Trump-Linked American Bitcoin",
    "description": "Gryphon Digital Mining has secured shareholder approval to merge with American Bitcoin, a mining firm connected to the Trump family, in a stock-for-stock...",
    "link": "https://cryptonews.com/news/gryphon-digital-mining-to-merge-with-trump-linked-american-bitcoin/",
    "timestamp": "2025-08-30T13:09:00Z"
  },
  {
    "title": "Here's what it really means for Trump to get control of the Federal Reserve board",
    "description": "President Donald Trump's effort to sack Federal Reserve Governor Lisa Cook is about more than firing someone: It's a maneuver that, if successful, would mark a seismic shift for an institution that for ages had been considered above politics.\nSince taking off…",
    "link": "https://biztoc.com/x/70377b01eb0dd964",
    "timestamp": "2025-08-30T13:04:48Z"
  },
  {
    "title": "‘Not a fact-based human’: Trump busted by ex-Atlanta mayor over crime claims",
    "description": "As President Donald Trump continues to tease the idea of deploying federal officers and National Guard members to Chicago, Illinois to crack down on crime, Kasim Reed, the former mayor of Atlanta, Georgia, is calling out the president on what he characterized…",
    "link": "https://www.rawstory.com/chicago/",
    "timestamp": "2025-08-30T13:01:54Z"
  },
  {
    "title": "Will Trump Tariffs Be Removed? Federal Appeals Court Confirms President's Sweeping Tariff Policies are Illegal",
    "description": "A federal appeals court in Washington, DC, announced that US President Donald Trump's tariffs are actually illegal. The ruling is considered to be the biggest blow against Trump's tariff policies.",
    "link": "https://www.ibtimes.com/will-trump-tariffs-removed-federal-appeals-court-confirms-presidents-sweeping-tariff-policies-3782002",
    "timestamp": "2025-08-30T13:01:32Z"
  },
  {
    "title": "Why Eric Trump Thinks Bitcoin Will Hit $1 Million",
    "description": "Eric Trump, son of U.S. President Donald Trump, shared why there's \"no question\" to him that Bitcoin will rise to a price of $1 million.",
    "link": "https://decrypt.co/337349/why-eric-trump-thinks-bitcoin-hit-1-million",
    "timestamp": "2025-08-30T13:01:03Z"
  },
  {
    "title": "Saudi Arabia's 40-year-old disruptor: How MBS rewired the Kingdom in 10 short years",
    "description": "MBS turned 40 this month and as he marks 10 years in power he can claim a domestic record few leaders have matched in a single decade.",
    "link": "https://www.foxnews.com/opinion/saudi-arabias-40-year-old-disruptor-how-mbs-rewired-kingdom-10-short-years",
    "timestamp": "2025-08-30T13:00:50Z"
  },
  {
    "title": "New Texas maps: Doom for Democrats — or do they hold a hidden prize?",
    "description": "New House maps in Texas are meant to help GOP in DC — but they could benefit Democrats in big statewide races",
    "link": "https://www.salon.com/2025/08/30/new-texas-maps-doom-for-democrats-or-do-they-hold-a-hidden-prize/",
    "timestamp": "2025-08-30T13:00:42Z"
  },
  {
    "title": "Boston whistleblower warns of migrant crime spillover as Trump’s crackdown looms",
    "description": "As Democratic leaders triple down on resistance against federal intervention, a migrant shelter whistleblower is sounding the alarm about an increase in crime.",
    "link": "https://www.foxnews.com/politics/boston-whistleblower-warns-migrant-crime-spillover-trumps-crackdown-looms",
    "timestamp": "2025-08-30T13:00:36Z"
  },
  {
    "title": "Christian worship event in deep blue city faces fierce backlash from LGBTQ leaders",
    "description": "Christian worship leader Sean Feucht is holding a rally in Seattle despite LGBTQ activists urging city officials to revoke his permit. Counter-protests are planned.",
    "link": "https://www.foxnews.com/media/christian-worship-event-deep-blue-city-faces-fierce-backlash-from-lgbtq-leaders",
    "timestamp": "2025-08-30T13:00:10Z"
  },
  {
    "title": "FO° Podcast: The Story of Millions of Syrian Refugees and Why They Can Never Return Home",
    "description": "Fair Observer Founder, CEO & Editor-in-Chief Atul Singh and foreign affairs analyst William McChesney discuss why millions of Syrian refugees remain unwilling or unable to return home. The conversation explores the history of Syria’s war, the collapse of the …",
    "link": "https://www.fairobserver.com/world-news/middle-east-news/fo-podcast-the-story-of-millions-of-syrian-refugees-and-why-they-can-never-return-home/",
    "timestamp": "2025-08-30T13:00:10Z"
  },
  {
    "title": "Up 60% in a Year, How Much Farther Can Coinbase Stock Go?",
    "description": "After a 60% surge over the past 12 months, does Coinbase have more room to run?",
    "link": "https://www.barchart.com/story/news/34502991/up-60-in-a-year-how-much-farther-can-coinbase-stock-go",
    "timestamp": "2025-08-30T13:00:02Z"
  },
  {
    "title": "It Was Meant to Solve the Housing Crisis. Trump Is Using It to Create an Enemies List.",
    "description": "Thanks to Donald, the most dangerous file in Washington is … your mortgage application?",
    "link": "https://slate.com/news-and-politics/2025/08/trump-fed-lisa-cook-mortgages-enemies-list-history.html",
    "timestamp": "2025-08-30T13:00:00Z"
  },
  {
    "title": "Stephen Miler called Democratic Party a 'domestic, extremist organization'",
    "description": "On Aug. 25, 2025, U.S. President Donald Trump's Deputy Chief of Staff for Policy Stephen Miller called the Democratic Party a \"domestic, extremist organization\" on Fox News.",
    "link": "https://www.snopes.com//fact-check/stephen-miller-democrats-extremist/",
    "timestamp": "2025-08-30T13:00:00Z"
  },
  {
    "title": "Here's what it really means for Trump to get control of the Federal Reserve board",
    "description": "Since taking office in January, Trump has placed the Fed directly in the crosshairs of executive power.",
    "link": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
    "timestamp": "2025-08-30T12:54:03Z"
  },
  {
    "title": "‘Racist as hell’: Trump’s cabinet is almost all white, and he keeps firing Black officials",
    "description": "President’s targeting of Fed governor Lisa Cook highlights his efforts to remove diverse voices from government\nA day after Donald Trump announced that he was firing Lisa Cook, the first Black woman to serve on the board of governors of the Federal Reserve, t…",
    "link": "https://biztoc.com/x/302b0c311c2be457",
    "timestamp": "2025-08-30T12:53:41Z"
  },
  {
    "title": "Egypt's GDP Grows 4.5% in 2024-25",
    "description": "Egypt's real gross domestic product grew by 4.5% in the 2024-25 financial year, up from 2.4% the previous year, Finance Minister Ahmed Kouchouk said on Saturday, boosted by reforms tied to IMF financing and increased manufacturing activity. The Arab world's m…",
    "link": "https://english.aawsat.com/business/5180808-egypts-gdp-grows-45-2024-25",
    "timestamp": "2025-08-30T12:50:24Z"
  },
  {
    "title": "Prof. Schlevogt’s Compass No. 23: The art of political tragicomedy – Zelensky’s playbook",
    "description": "European leaders on war footing flocked to the White House to plea for protection. Ukraine’s president brought self-parody to center stage. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623709-political-tragicomedy-zelensky-playbook/",
    "timestamp": "2025-08-30T12:50:20Z"
  },
  {
    "title": "Trump is Dead Trend: Here's viral memes on X as Donald Trump health rumours and The Simpsons predictions spread",
    "description": "Trump is Dead memes have gone viral on X with more than 56,900 posts. The trend links Donald Trump’s health rumours, JD Vance’s remarks, and The Simpsons predictions, fuelling speculation despite White House statements.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-is-dead-memes-donald-trump-health-rumours-jd-vance-the-simpsons-prediction-social-media-trend/articleshow/123602437.cms",
    "timestamp": "2025-08-30T12:48:52Z"
  }
]