[
  {
    "title": "Nobel Peace Prize winner calls for military attack on her own country",
    "description": "The US anti-drug campaign off Venezuela’s coast could help oust “illegitimate” Nicolas Maduro, Maria Corina Machado says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627253-venezuela-machado-us-military/",
    "timestamp": "2025-11-02T08:56:45Z"
  },
  {
    "title": "New York braces for first Muslim mayor",
    "description": "New Yorkers will pick a new mayor tomorrow after an unpredictable race that has drawn attention from far beyond the largest city in the United States, with President Donald Trump branding frontrunner Zohran Mamdani \"a communist.\"",
    "link": "https://www.hurriyetdailynews.com/new-york-braces-for-first-muslim-mayor-215279",
    "timestamp": "2025-11-02T08:53:37Z"
  },
  {
    "title": "What did Trump, Xi agree to on tariffs, export controls and fentanyl - Reuters",
    "description": "What did Trump, Xi agree to on tariffs, export controls and fentanylReuters Trump’s big concession to Xi is loaded with red flagsCNN White House discloses details of China trade trucePolitico Donald Trump and Xi Jinping agree to a trade truceThe Economist The…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179937286",
    "timestamp": "2025-11-02T08:52:49Z"
  },
  {
    "title": "‘Even Trump doesn’t know what could happen tomorrow’: Army Chief Upendra Dwivedi says future threats unpredictable",
    "description": "He said the armed forces face the same challenges \"whether at the borders, through terrorism, natural disasters, cyber warfare, or the new frontiers like space warfare involving satellites, and chemical, biological, and radiological threats”.",
    "link": "https://indianexpress.com/article/india/trump-tomorrow-army-chief-upendra-dwivedi-future-threats-unpredictable-10341542/",
    "timestamp": "2025-11-02T08:52:08Z"
  },
  {
    "title": "Trump to host Syria’s al-Sharaa for talks at White House in November",
    "description": "Al-Sharaa's trip, confirmed by Damascus, will be the first official visit by a Syrian president to the US.",
    "link": "https://www.aljazeera.com/news/2025/11/2/trump-to-host-syrias-al-sharaa-for-talks-at-white-house-envoy-says-2",
    "timestamp": "2025-11-02T08:42:40Z"
  },
  {
    "title": "APEC leaders pledge stronger cooperation amid challenges",
    "description": "Leaders of 21 Asia-Pacific Rim nations wrapped up their annual summit with a statement underscoring regional economic cooperation.",
    "link": "https://www.hurriyetdailynews.com/apec-leaders-pledge-stronger-cooperation-amid-challenges-215272",
    "timestamp": "2025-11-02T08:29:59Z"
  },
  {
    "title": "Israel warns of intensifying attacks against Hezbollah",
    "description": "Israel has warned that its military would step up its attacks against Hezbollah in southern Lebanon, a day after the Lebanese health ministry reported four people killed in an Israeli air strike.",
    "link": "https://www.rte.ie/news/world/2025/1102/1541702-israel-lebanon/",
    "timestamp": "2025-11-02T08:21:45Z"
  },
  {
    "title": "Trump threatens US military action in Nigeria",
    "description": "US President Donald Trump said he has asked the Department of War to prepare for possible \"fast\" military action in Nigeria if it fails to crack down on the killing of Christians.",
    "link": "https://www.rte.ie/news/us/2025/1102/1541701-us-nigeria/",
    "timestamp": "2025-11-02T08:17:43Z"
  },
  {
    "title": "US, China agree to open direct military hotline after Xi-Trump summit",
    "description": "War Secretary Pete Hegseth says he had a \"positive\" meeting with China’s defense chief Dong Jun as both sides agreed to open military channels to ease tensions.",
    "link": "https://www.foxnews.com/politics/us-china-agree-open-direct-military-hotline-after-xi-trump-summit",
    "timestamp": "2025-11-02T08:14:18Z"
  },
  {
    "title": "Supreme Court Faces Decision on Major Donald Trump Policy This Week",
    "description": "The U.S. Supreme Court is set to hear oral arguments challenging President Donald Trump’s power to use the International Emergency Economic Powers Act (IEEPA) to impose sweeping tariffs, a core pillar of his economic policy since taking office in January.\nThe…",
    "link": "https://biztoc.com/x/bd118ddeff3b49bc",
    "timestamp": "2025-11-02T08:05:35Z"
  },
  {
    "title": "Student-loan borrowers could lose access to public service debt relief under a new Trump rule. Here's what's changing",
    "description": "President Donald Trump's administration is limiting eligibility for the Public Service Loan Forgiveness program.\nThai Liang Lim/Getty Images\nTrump's administration finalized its rule to limit the Public Service Loan Forgiveness program.\nThe rule will prohibit…",
    "link": "https://biztoc.com/x/2eb0038ba1a36e5f",
    "timestamp": "2025-11-02T08:05:16Z"
  },
  {
    "title": "Global week ahead: Is Novo Nordisk past 'peak uncertainty'?",
    "description": "CNBC's Charlotte Reed will travel to Copenhagen to speak with Novo Nordisk's new CEO after a bumpy few months.",
    "link": "https://www.cnbc.com/2025/11/02/global-week-ahead-is-novo-nordisk-past-its-peak-uncertainty.html",
    "timestamp": "2025-11-02T08:04:50Z"
  },
  {
    "title": "Kamala Harris reveals how refusing to take ‘no’ for an answer served her career",
    "description": "\"I don't rest easy with the idea that something is not possible,\" former Vice President Kamala Harris said on Steven Bartlett's Diary of a CEO podcast.",
    "link": "https://www.cnbc.com/2025/11/02/kamala-harris-on-why-never-taking-no-for-answer-served-her-career.html",
    "timestamp": "2025-11-02T08:04:47Z"
  },
  {
    "title": "Trump says his tariffs will help American businesses. So why are they suing?",
    "description": "President Trump argues his sweeping tariffs will bring jobs back to the United States. The businesses challenging the tariffs say they're doing more harm...",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/02/trump-tariffs-small-businesses-supreme-court/86991235007/",
    "timestamp": "2025-11-02T08:01:08Z"
  },
  {
    "title": "Student-loan borrowers could lose access to public service debt relief under a new Trump rule. Here's what's changing.",
    "description": "Trump's Department of Education finalized a rule that would narrow eligibility for the Public Service Loan Forgiveness program.",
    "link": "https://www.businessinsider.com/what-are-the-pslf-loan-forgiveness-changes-trump-debt-relief-2025-11",
    "timestamp": "2025-11-02T08:01:01Z"
  },
  {
    "title": "Democratic socialist Zohran Mamdani shoots to stardom ‘like a young Obama'",
    "description": "The overnight sensation leading NYC polls has a lot in common with another telegenic young politician who skyrocketed to fame.",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/02/zohran-mamdani-nyc-mayor-frontrunner-obama/86627657007/",
    "timestamp": "2025-11-02T08:00:53Z"
  },
  {
    "title": "Bihar election 2025: Modi afraid of Trump, also controlled by 'select industrialists', alleges Rahul Gandhi",
    "description": "Bihar election 2025: Rahul Gandhi criticized Modi during a rally in Bihar. He alleged the Prime Minister fears US President Donald Trump and is influenced by select industrialists. Gandhi promised that the INDIA alliance would form the government in Bihar and…",
    "link": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/bihar-election-2025-narendra-modi-afraid-of-donald-trump-also-controlled-by-select-industrialists-alleges-congress-rahul-gandhi-in-bihar-rally/articleshow/125029913.cms",
    "timestamp": "2025-11-02T07:58:12Z"
  },
  {
    "title": "'SNL' Mocks NYC Mayoral Debate With Miles Teller as Andrew Cuomo - Variety",
    "description": "'SNL' Mocks NYC Mayoral Debate With Miles Teller as Andrew CuomoVariety ‘SNL’ Goes Full Zohran Mamdani Vs. Donald Trump In Big Apple Cold Open With Help From Ramy Youssef And Shane GillisDeadline ‘SNL’ Holds Mock New York City Mayoral Debate With Miles Teller…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179936882",
    "timestamp": "2025-11-02T07:52:19Z"
  },
  {
    "title": "War Department escalates campaign against narco-terror at sea with 15th strike: 'They will not succeed'",
    "description": "The U.S. military has launched its 15th maritime strike targeting narco-terror groups, as War Secretary Pete Hegseth vows continued action to stop cartels.",
    "link": "https://www.foxnews.com/world/war-department-escalates-campaign-against-narco-terror-sea-15th-strike-they-not-succeed",
    "timestamp": "2025-11-02T07:47:27Z"
  },
  {
    "title": "'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean",
    "description": "The US military has carried out a fresh strike on what it claims are drug smugglers in the Caribbean Sea - as tensions with Venezuela remain high.",
    "link": "https://news.sky.com/story/we-will-treat-them-exactly-how-we-treated-al-qaeda-us-carries-out-another-lethal-strike-in-caribbean-13462365",
    "timestamp": "2025-11-02T07:35:00Z"
  },
  {
    "title": "SNL Cold Open: 'Zohran Mamdani' steals the show, says 'hit me up at the ballot box, girl' - The Times of India",
    "description": "SNL Cold Open: 'Zohran Mamdani' steals the show, says 'hit me up at the ballot box, girl'The Times of India ‘SNL’ Goes Full Zohran Mamdani Vs. Donald Trump In Big Apple Cold Open With Help From Ramy Youssef And Shane GillisDeadline ‘SNL’ Holds Mock New York C…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179936786",
    "timestamp": "2025-11-02T07:32:27Z"
  },
  {
    "title": "Massie Calls Out ‘Rich and Powerful’ US Men as Prince Andrew Loses Titles",
    "description": "Republican U.S. Representative Thomas Massie, a longtime critic of both President Donald Trump and House Speaker Mike Johnson, has accused America’s political and business elite of benefiting from “immunities and privileges exceeding those of Royalty in Brita…",
    "link": "https://freerepublic.com/focus/f-news/4350179/posts",
    "timestamp": "2025-11-02T07:24:52Z"
  },
  {
    "title": "Zohran Mamdani: Who is the likely new Mayor of New York?",
    "description": "He was almost unheard of a year ago, now Zohran Mamdani is on the verge of becoming mayor of New York. The 34-year-old's immigrant background and socialist principles appeal to many New Yorkers, but not to Donald Trump.",
    "link": "https://www.dw.com/en/zohran-mamdani-who-is-the-likely-new-mayor-of-new-york/a-74572160",
    "timestamp": "2025-11-02T07:24:00Z"
  },
  {
    "title": "Trump’s White House ballroom: a threat to the republic?",
    "description": "Trump be far from the first US president to leave his mark on the Executive Mansion, but to critics his remodel is yet more overreach",
    "link": "https://theweek.com/politics/trumps-white-house-ballroom-a-threat-to-the-republic",
    "timestamp": "2025-11-02T07:11:00Z"
  },
  {
    "title": "Trump Says Will Order Pentagon to Prepare Attack Plan on Nigeria Over Christian Crisis",
    "description": "The United States will immediately cease all aid to Nigeria if the killing of Christians continues, US President Donald Trump said on Saturday, adding that he will instruct the Pentagon to prepare for a possible attack in the African country to \"wipe out Isla…",
    "link": "https://sputnikglobe.com/20251102/trump-says-will-order-pentagon-to-prepare-attack-plan-on-nigeria-over-christian-crisis-1123052465.html",
    "timestamp": "2025-11-02T07:09:39Z"
  },
  {
    "title": "Trump threatens military action in Nigeria over killing of Christians",
    "description": "U.S. President Donald Trump threatened on Saturday to send the military into Nigeria with \"guns-a-blazing\" if Africa's most populous country does not stem what he described as the killing of Christians by Islamists.",
    "link": "https://www.hurriyetdailynews.com/trump-threatens-military-action-in-nigeria-over-killing-of-christians-215268",
    "timestamp": "2025-11-02T07:06:54Z"
  },
  {
    "title": "Ukraine's defence of Pokrovsk reaches a crucial phase",
    "description": "For much of the past year, Russian forces have bombarded the strategically important city of Pokrovsk in Donetsk. Groups of Russian troops are now reportedly operating in the city centre, while Ukrainian troops in the wider area are heavily outnumbered. The b…",
    "link": "https://www.rte.ie/news/2025/1102/1541557-ukraine-pokrovsk/",
    "timestamp": "2025-11-02T07:01:09Z"
  },
  {
    "title": "US launches new strike on alleged narco-trafficking boat",
    "description": "At least three people were killed in a US strike on drug smugglers in the Caribbean, US Defense Secretary Pete Hegseth has announced. The news comes after the United Nations urged Washington to halt such attacks. A US strike on an alleged drug smuggling boat …",
    "link": "https://www.dw.com/en/us-launches-new-strike-on-alleged-narco-trafficking-boat/a-74588892",
    "timestamp": "2025-11-02T06:59:00Z"
  },
  {
    "title": "Barack Obama, Kamala Harris campaign for Democrats, as Donald Trump's political operation invests in turnout - ABC News",
    "description": "Barack Obama, Kamala Harris campaign for Democrats, as Donald Trump's political operation invests in turnoutABC News As Barack Obama stumps for other Democrats, the party gets to see what it lostThe Guardian NJ Governor’s Race Draws Obama and Hannity but Not …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179936534",
    "timestamp": "2025-11-02T06:52:36Z"
  },
  {
    "title": "Trump hails meeting with Xi as step toward ‘everlasting peace’",
    "description": "US President Donald Trump has said his recent summit with Chinese President Xi Jinping will usher in “everlasting peace” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627252-meeting-with-xi-will-lead/",
    "timestamp": "2025-11-02T06:52:34Z"
  },
  {
    "title": "Crypto market sentiment stays in 'Fear' following Trump's deal with China",
    "description": "The Crypto Fear & Greed Index posted a “Fear” score of 37 on Sunday, remaining in the Fear zone despite US President Donald Trump reaching a trade agreement with China.",
    "link": "https://cointelegraph.com/news/crypto-market-sentiment-fear-donald-trump-trade-deal-bitcoin-ether",
    "timestamp": "2025-11-02T06:46:46Z"
  },
  {
    "title": "Breda O'Brien: The vibes-based politics that elected Catherine Connolly are ultimately empty",
    "description": "Can she be president for voters who stayed at home as well as those who came out to vote in protest?",
    "link": "https://www.irishtimes.com/opinion/2025/11/02/breda-obrien-vibes-based-politics-that-elected-catherine-connolly-are-powerful-but-rarely-sustainable/",
    "timestamp": "2025-11-02T06:35:00Z"
  },
  {
    "title": "This Is Tariff Terrorism Against India: Baba Ramdev on Donald Trump's economic war, pushes for swadeshi",
    "description": "\"Tariff is terrorism, it is very deadly. After World War 2 if World War 3 is there then it is this economic war. In this, atleast the poor countries, developing countries should be taken care of. The people in power have been so samrajyawadi (imperialist) and…",
    "link": "https://economictimes.indiatimes.com/news/india/this-is-tariff-terrorism-against-india-baba-ramdev-on-donald-trumps-economic-war-pushes-for-swadeshi/articleshow/125029746.cms",
    "timestamp": "2025-11-02T06:11:10Z"
  },
  {
    "title": "Pentagon Chief Claims New US Strike on Drug Trafficking Vessel in Caribbean",
    "description": "Pentagon chief Pete Hegseth claimed a new US strike on a vessel that, according to him, was used for drug trafficking in the Caribbean Sea and belonged to a \"terrorist organization.\"",
    "link": "https://sputnikglobe.com/20251102/pentagon-chief-claims-new-us-strike-on-drug-trafficking-vessel-in-caribbean-1123052196.html",
    "timestamp": "2025-11-02T06:06:31Z"
  },
  {
    "title": "Trump congratulates LA Dodgers on victory",
    "description": "United States President Donald Trump congratulated the Los Angeles Dodgers on their World Series victory over the Blue Jays, calling them \"incredible CHAMPIONS!!!\"In a post on Truth Social, Trump wrot...",
    "link": "https://biztoc.com/x/b3d94e254a39e848",
    "timestamp": "2025-11-02T06:04:18Z"
  },
  {
    "title": "Pussy Riot’s Maria Alyokhina: ‘It’s a strange feeling: willing your country to lose’",
    "description": "Co-founder of protest and performance-art group describes Russia’s descent under Putin into dictatorship and war",
    "link": "https://www.irishtimes.com/life-style/people/2025/11/02/pussy-riots-maria-alyokhina-its-a-strange-feeling-willing-your-country-to-lose/",
    "timestamp": "2025-11-02T06:01:00Z"
  },
  {
    "title": "Pentagon admits it doesn’t know identities of those killed in Latin American drug interdiction strikes",
    "description": "The Pentagon has admitted to Congress that it does not know the identities of at least 61 people killed in U.S. military strikes targeting suspected drug-smuggling vessels near Venezuela and in the Eastern Pacific Ocean. This lack of transparency has sparked …",
    "link": "https://www.naturalnews.com/2025-11-02-pentagon-admits-not-knowing-identities-killed-latin-american.html",
    "timestamp": "2025-11-02T06:00:00Z"
  },
  {
    "title": "US uncertainty offers Dublin and Ottawa potential to boost bilateral trade",
    "description": "Chance exists to increase trade in goods by €1.2bn annually and expand activity in services by almost €500m, notes report",
    "link": "https://www.irishtimes.com/business/economy/2025/11/02/us-uncertainty-offers-dublin-and-ottawa-potential-to-boost-bilateral-trade/",
    "timestamp": "2025-11-02T06:00:00Z"
  },
  {
    "title": "DOJ defends outdated gun law in suppressor case, clashing with Trump’s pro-2A agenda",
    "description": "The DOJ under Attorney General Pam Bondi is upholding the 1934 National Firearms Act (NFA), contradicting President Trump’s pro-Second Amendment stance. The NFA imposes burdensome registration, taxes and wait times for suppressors. Suppressors (often called “…",
    "link": "https://www.naturalnews.com/2025-11-02-doj-defends-outdated-gun-law-suppressor-case.html",
    "timestamp": "2025-11-02T06:00:00Z"
  },
  {
    "title": "Nvidia shatters records as first $5 trillion company amid AI boom, but bubble fears loom",
    "description": "Driven by AI demand, Nvidia’s stock surged, transforming from a gaming hardware supplier to the dominant force in AI infrastructure, powering everything from ChatGPT to military supercomputers. Nvidia’s stock rose 51 percent YTD, with 500B in AI chip orders, …",
    "link": "https://www.naturalnews.com/2025-11-02-nvidia-historic-trillion-valuation-amid-ai-boom.html",
    "timestamp": "2025-11-02T06:00:00Z"
  },
  {
    "title": "Putin unveils operational Burevestnik nuclear-powered missile: A game-changer in modern warfare?",
    "description": "Russian President Vladimir Putin announced the completion of testing for Russia’s nuclear-powered Burevestnik cruise missile, claiming it is “unique” and “invincible” with unlimited range due to its miniature nuclear reactor. The missile’s reactor is 1,000 ti…",
    "link": "https://www.naturalnews.com/2025-11-02-putin-unveils-operational-burevestnik-nuclear-powered-missile.html",
    "timestamp": "2025-11-02T06:00:00Z"
  },
  {
    "title": "Late Night Open Thread: Trump’s Fine Corinthian Marble Sh*tter",
    "description": "He is posting this while he is on his way to Palm Beach for an extended golf weekend. [image or embed] — Ron Filipkowski (@ronfilipkowski.bsky.social) October 31, 2025 at 1:11 PM In the ‘Lincoln Era’, as many people have pointed out, what’s now the Lincoln Be…",
    "link": "https://balloon-juice.com/2025/11/02/late-night-open-thread-trumps-fine-corinthian-marble-shtter/",
    "timestamp": "2025-11-02T05:55:40Z"
  },
  {
    "title": "Nigeria run by lawless govt, relying on thugs - Binance's Tigran Gambaryan",
    "description": "Tigran Gambaryan, former Binance Holdings Limited’s head of financial Compliance, has said Nigeria is run by a lawless government. Gambaryan disclosed that the Nigerian government depends on criminals and thugs more interested in enriching themselves. He was …",
    "link": "https://dailypost.ng/2025/11/02/nigeria-run-by-lawless-govt-relying-on-thugs-binances-tigran-gambaryan/",
    "timestamp": "2025-11-02T05:46:28Z"
  },
  {
    "title": "‘SNL’ Weekend Update Trashes Trump’s White House Renovations, ‘Weird’ Halloween Habits",
    "description": "SNL's Colin Jost and Michael Che pick apart the president's Halloween \"at what's left of the White House\"",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-weekend-update-trump-white-house-renovations-halloween-1235458227/",
    "timestamp": "2025-11-02T05:39:18Z"
  },
  {
    "title": "Barry O’Halloran: Donald Trump has shown uncharacteristic patience in trying to bring peace to Gaza",
    "description": "Donald Trump’s 20-point peace plan for Gaza has many vaguely worded and ill-defined elements.",
    "link": "https://www.independent.ie/opinion/barry-ohalloran-donald-trump-has-shown-uncharacteristic-patience-in-trying-to-bring-peace-to-gaza/a195759231.html",
    "timestamp": "2025-11-02T05:30:00Z"
  },
  {
    "title": "Record number of house sales fell through in Dublin this year, says agent",
    "description": "A record number of homes that went sale agreed fell through during the summer and into the autumn months, a leading Dublin estate agent has said.",
    "link": "https://www.independent.ie/irish-news/record-number-of-house-sales-fell-through-in-dublin-this-year-says-agent/a336762531.html",
    "timestamp": "2025-11-02T05:30:00Z"
  },
  {
    "title": "Any Other Business: Octogenarian Wilbur Ross is still well able to dodge the money question",
    "description": "Although he turns 88 later this month, Wilbur Ross – Donald Trump’s former commerce secretary – is still capable of some fancy footwork.",
    "link": "https://www.independent.ie/business/irish/any-other-business-octogenarian-wilbur-ross-is-still-well-able-to-dodge-the-money-question/a897364535.html",
    "timestamp": "2025-11-02T05:30:00Z"
  },
  {
    "title": "Tracking the ICE tactics used in Trump's mass deportation drive",
    "description": "BBC Verify has gathered more than 70 videos to track how President Trump's illegal immigration crackdown has unfolded so far.",
    "link": "https://www.bbc.com/news/videos/c6299nrj76yo",
    "timestamp": "2025-11-02T05:29:22Z"
  },
  {
    "title": "Jennifer Lawrence Explains Why She Doesn't Publicly Talk Politics Anymore After Being Outspoken Against Trump",
    "description": "Jennifer Lawrence has been outspoken against Donald Trump in the past, but she’s been silent on politics lately and there’s a reason. The 35-year-old Oscar-winning actress is explaining why she has stopped talking publicly about her political stance. Keep rea…",
    "link": "https://www.justjared.com/2025/11/02/jennifer-lawrence-explains-why-she-doesnt-publicly-talk-politics-anymore-after-being-outspoken-against-trump/",
    "timestamp": "2025-11-02T05:29:07Z"
  },
  {
    "title": "Israeli air strike kills four in Lebanon, straining fragile ceasefire",
    "description": "Israel has carried out regular attacks on southern Lebanon despite a ceasefire agreed with Hezbollah last November.",
    "link": "https://www.aljazeera.com/news/2025/11/2/israeli-air-strike-kills-four-in-lebanon-straining-fragile-ceasefire",
    "timestamp": "2025-11-02T05:25:16Z"
  },
  {
    "title": "‘SNL’ Weekend Update: Michael Che Jokes About Prince Andrew Losing His Title, Bowen Yang’s George Santos Reveals He Robbed the Louvre",
    "description": "Bowen Yang appeared as former U.S. congressman George Santos during “Weekend Update” on “Saturday Night Live.” During the segment, co-host Colin Jost referenced the upcoming New York City marathon happening before reluctantly introducing Santos as “the world’…",
    "link": "https://variety.com/2025/tv/news/snl-weekend-update-prince-andrew-losing-title-bowen-yang-george-santos-louvre-heist-1236567776/",
    "timestamp": "2025-11-02T05:21:10Z"
  },
  {
    "title": "What did Trump, Xi agree to on tariffs, export controls and fentanyl",
    "description": "The deal, which also includes resumption of Chinese purchases of American soybeans, averts Trump's threatened 100 per cent tariff on Chinese goods and extends a delicate trade truce between the world's two largest economies for about a year.",
    "link": "https://www.thehindubusinessline.com/news/world/what-did-trump-xi-agree-to-on-tariffs-export-controls-and-fentanyl/article70231898.ece",
    "timestamp": "2025-11-02T05:18:51Z"
  },
  {
    "title": "Voters divided on midterms despite broad Trump disapproval, poll finds (Washington Post)",
    "description": "Washington Post:\nVoters divided on midterms despite broad Trump disapproval, poll finds  —  Most Americans disapprove President Trump's handling of top issues, and a majority say he has gone too far in exercising his powers.  —  Just now  —  Americans broadly…",
    "link": "https://www.memeorandum.com/251102/p2",
    "timestamp": "2025-11-02T05:15:01Z"
  },
  {
    "title": "‘SNL’ Goes Full Zohran Mamdani Vs. Donald Trump In Big Apple Cold Open - Deadline",
    "description": "‘SNL’ Goes Full Zohran Mamdani Vs. Donald Trump In Big Apple Cold OpenDeadline ‘SNL’ Holds Mock New York City Mayoral Debate With Miles Teller, Ramy Youssef and Shane GillisThe Hollywood Reporter ‘SNL’ Cold Open: Trump Crashes NYC Mayoral Debate to Roast Each…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179935858",
    "timestamp": "2025-11-02T05:12:20Z"
  },
  {
    "title": "SNL cold open features NYC mayoral debate with Zohran Mamdani, Donald Trump appearances",
    "description": "Saturday Night Live Season 51 opened November 2, 2025 with fictional New York City mayoral debate. Ramy Youssef played frontrunner Zohran Mamdani, Miles Teller portrayed Andrew Cuomo, and James Austin Johnson appeared as President Donald Trump ahead of Novemb…",
    "link": "https://economictimes.indiatimes.com/news/international/us/snl-cold-open-features-nyc-mayoral-debate-with-zohran-mamdani-donald-trump-appearances/articleshow/125029155.cms",
    "timestamp": "2025-11-02T05:08:09Z"
  },
  {
    "title": "SNL host Miles Teller net worth: How rich is Top Gun: Maverick star?",
    "description": "Ramy Youssef, as Queens assemblyman Zohran Mamdani, delivered the sharpest line of the night: “I’m ready to spend the next hour hearing my opponents pronounce my name in ways you couldn’t imagine.” Shane Gillis channeled Curtis Sliwa’s streetwise bravado, and…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/snl-host-miles-teller-net-worth-how-rich-is-top-gun-maverick-star/articleshow/125029085.cms",
    "timestamp": "2025-11-02T05:04:17Z"
  },
  {
    "title": "John Swinney meets with US ambassador on Scotch whisky tariffs",
    "description": "John Swinney has discussed cutting tariffs on Scotch whisky in a meeting with the US ambassador to the UK",
    "link": "https://www.thenational.scot/news/25588872.john-swinney-meets-us-ambassador-scotch-whisky-tariffs/",
    "timestamp": "2025-11-02T05:02:10Z"
  },
  {
    "title": "US strike on alleged drug vessel kills three in Caribbean",
    "description": "A US strike on an alleged drug-trafficking vessel in the Caribbean killed three people, Pentagon chief Pete Hegseth has said, the latest such attack in international waters.",
    "link": "https://www.rte.ie/news/us/2025/1102/1541697-us-caribbean-vessel/",
    "timestamp": "2025-11-02T04:59:09Z"
  },
  {
    "title": "SNL Video: Miles Teller Plays Both Property Brothers As They Help Trump Tear Down The White House",
    "description": "The Property Brothers helped Donald Trump renovate the White House (in a big way) this week on SNL - watch video.",
    "link": "https://www.tvline.com/2014241/snl-video-property-brothers-trump-white-house/",
    "timestamp": "2025-11-02T04:56:38Z"
  },
  {
    "title": "The Property Brothers Help Trump Remodel the White House With a Budget ‘Between $350 Million and Infinity’ on ‘SNL’",
    "description": "Host Miles Teller portrayed both Jonathan and Drew Scott – the Property Brothers from the show of the same name – as the twins showed up at the White House to help Donald Trump remodel the White House on “Saturday Night Live.” Americans have been aghast at wa…",
    "link": "https://variety.com/2025/tv/news/saturday-night-live-property-brothers-trump-miles-teller-1236567759/",
    "timestamp": "2025-11-02T04:36:38Z"
  },
  {
    "title": "Miles Teller Plays Cuomo in SNL's Mock NYC Mayoral Debate with Two Very Special Guest Stars!",
    "description": "Miles Teller is hosting the latest episode of Saturday Night Live and he also participated in the cold open! The actor played Andrew Cuomo in a mock New York City mayoral debate, which also featured two special guests – Ramy Youssef as Zohran Mamdani and Shan…",
    "link": "https://www.justjared.com/2025/11/02/miles-teller-plays-cuomo-in-snls-mock-nyc-mayoral-debate-with-two-very-special-guest-stars/",
    "timestamp": "2025-11-02T04:35:16Z"
  },
  {
    "title": "Trump to host al-Sharaa in first-ever visit by Syrian president to White House, official says",
    "description": "The official, who was not authorised to comment publicly about the yet to be formally announced engagement, said that the meeting is expected to take place Nov 10.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-host-al-sharaa-in-first-ever-visit-by-syrian-president-to-white-house-official-says/article70231896.ece",
    "timestamp": "2025-11-02T04:34:52Z"
  },
  {
    "title": "Twin Miles Tellers Spoof ‘Property Brothers’ Tackling Trump’s White House East Wing Demolition & New Ballroom",
    "description": "Miles Teller pulled double-duty (in a way) by portraying twin brothers Jonathan and Drew Scott in a pre-taped Saturday Night Live sketch spoofing the Canadian reality TV series Property Brothers. This time, the two real estate property developers field the ga…",
    "link": "http://deadline.com/2025/11/miles-teller-property-brothers-snl-sketch-white-house-trump-1236604895/",
    "timestamp": "2025-11-02T04:32:46Z"
  },
  {
    "title": "Pick of BL commodities - November 2, 2025",
    "description": "Last week, data from the World Gold Council showed that the demand for gold in the September quarter declined 16% year-on-year as its prices soard. The American Spices Trade Association says the US industry is suffering due to the Donald Trump administration’…",
    "link": "https://www.thehindubusinessline.com/newsletter/pick-of-bl-commodities/pick-of-bl-commodities-november-2-2025/article70229373.ece",
    "timestamp": "2025-11-02T04:30:00Z"
  },
  {
    "title": "Nation's largest fleet of police Cybertrucks to patrol Las Vegas",
    "description": "The nation’s largest police fleet of Tesla Cybertrucks is set to begin patrolling the streets of Las Vegas in November",
    "link": "https://abcnews.go.com/US/wireStory/nations-largest-fleet-police-cybertrucks-patrol-las-vegas-127102391",
    "timestamp": "2025-11-02T04:29:34Z"
  },
  {
    "title": "‘SNL’ Cold Open: Trump Crashes NYC Mayoral Debate to Roast Each Candidate",
    "description": "SNL's Donald Trump waded into the NYC mayoral race, mocking Andrew Cuomo (Miles Teller), Curtis Sliwa (Shane Gillis) and Zohran Mamdani (Marcello Hernandez)",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-trump-crashes-nyc-mayoral-debate-cuomo-sliwa-mamdani-1235458265/",
    "timestamp": "2025-11-02T04:17:47Z"
  },
  {
    "title": "Toyota refutes Trump's claim about $10B investment in US",
    "description": "During his late-October 2025 visit to Japan, U.S. President Donald Trump claimed that Toyota would invest \"over $10 billion\" to build new auto plants \"all over the United States.\" He said the figure came from Japan's newly elected prime minister, Sanae Takaic…",
    "link": "https://biztoc.com/x/999d6720ba9d1ebd",
    "timestamp": "2025-11-02T04:13:36Z"
  },
  {
    "title": "Syrian President to visit Washington for first time, may join coalition against ISIS",
    "description": "Syrian President Sharaa will visit Washington for the first time. The US hopes Syria will join the anti-ISIS coalition and finalize a security deal with Israel to halt airstrikes and withdraw troops.",
    "link": "https://www.israelnationalnews.com/news/417153",
    "timestamp": "2025-11-02T04:13:28Z"
  },
  {
    "title": "SNL Brings Back Shane Gillis And Ramy Youssef For NYC Mayoral Debate — Watch",
    "description": "Shane Gillis and Ramy Youssef returned to SNL to play NYC mayoral candidates Curtis Sliwa and Zohran Mamdani in a debate sketch - watch it here.",
    "link": "https://www.tvline.com/2014236/snl-video-shane-gillis-ramy-youssef-new-york-mayor-debate/",
    "timestamp": "2025-11-02T04:11:01Z"
  },
  {
    "title": "Nation’s largest fleet of police Cybertrucks to patrol Las Vegas",
    "description": "LAS VEGAS (AP) — The nation’s largest police fleet of Tesla Cybertrucks is set to begin patrolling the streets of Las Vegas in November thanks to a donation from a U.S. tech billionaire, raising concerns about the blurring of lines between public and private …",
    "link": "https://financialpost.com/pmn/nations-largest-fleet-of-police-cybertrucks-to-patrol-las-vegas",
    "timestamp": "2025-11-02T04:08:08Z"
  },
  {
    "title": "Most Americans say country is on the wrong track, blame Trump for inflation: Poll",
    "description": "Over 6 in 10 say Trump and GOP are out of touch. Even more say that about Dems.",
    "link": "https://abcnews.go.com/Politics/americans-country-wrong-track-blame-trump-inflation-poll/story?id=127064620",
    "timestamp": "2025-11-02T04:04:17Z"
  },
  {
    "title": "‘SNL’ roasts NYC mayoral candidates in star-studded mock debate — days before election",
    "description": "Saturday Night Live roasted the New York City mayoral candidates in a mock debate choc-ful of New York references that sent-up the characteristic foibles of each of the Gracie Mansion hopefuls.",
    "link": "https://nypost.com/2025/11/02/entertainment/snl-cold-open-mocks-nyc-mayoral-election-2025-race-between-mamdani-cuomo-sliwa/",
    "timestamp": "2025-11-02T04:03:29Z"
  },
  {
    "title": "Nation's largest fleet of police Cybertrucks to patrol Las Vegas",
    "description": "The nation's largest police fleet of Tesla Cybertrucks is set to begin patrolling the streets of Las Vegas in November thanks to a donation from a U.S. tech ...",
    "link": "https://www.yahoo.com/news/articles/nations-largest-fleet-police-cybertrucks-040150117.html",
    "timestamp": "2025-11-02T04:01:50Z"
  },
  {
    "title": "‘SNL’: Miles Teller, Ramy Youssef and Shane Gillis Debate as New York Mayor Candidates in Cold Open | Video",
    "description": "Voters want to know what Zohran Mamdani, Andrew Cuomo and Curtis Sliwa will do to tackle New York's biggest problem: Trump\nThe post ‘SNL’: Miles Teller, Ramy Youssef and Shane Gillis Debate as New York Mayor Candidates in Cold Open | Video appeared first on T…",
    "link": "https://www.thewrap.com/snl-cold-open-new-york-mayor-candidates-miles-teller-cuomo-ramy-youssef-mamdani-shane-gillis-sliwa/",
    "timestamp": "2025-11-02T04:01:10Z"
  },
  {
    "title": "The Nigerian government agrees to Trump’s help against Islamic terrorists",
    "description": "I doubt most people realize that Nigeria, located in West Africa, is the world’s sixth most populous country, with around 213.5 million people. Over 53% of the population is Muslim. That’s never a good thing for the remaining population i...",
    "link": "https://www.americanthinker.com/blog/2025/11/the_nigerian_government_agrees_to_trump_s_help_against_islamic_terrorists.html",
    "timestamp": "2025-11-02T04:00:00Z"
  },
  {
    "title": "After massacres of Christians in Nigeria, Trump does the pope's job for him",
    "description": "President Trump issued a strong statement of support for Nigeria's beleaguered Christians, some 7,000 of whom have been massacred this year alone, mostly by Boko Haram Islamist terrorists.",
    "link": "https://www.americanthinker.com/blog/2025/11/after_massacres_of_christians_in_nigeria_trump_does_the_pope_s_job_for_him.html",
    "timestamp": "2025-11-02T04:00:00Z"
  },
  {
    "title": "It's past time to arrest politicians impeding immigration enforcement",
    "description": "Democrats led by Joe Biden’s handlers, in violation of multiple federal immigration laws, allowed as many as 20 million illegal aliens into the United States in just four years. Donald Trump was reelected on the promise to deport those illegal ...",
    "link": "https://www.americanthinker.com/blog/2025/11/it_s_past_time_to_arrest_politicians_impeding_immigration_enforcement.html",
    "timestamp": "2025-11-02T04:00:00Z"
  },
  {
    "title": "US-China Trade Deal: Rare Earth Curbs Suspended, 100% Tariff Paused-White House Fact Sheet At A Glance",
    "description": "US-China Trade Deal: China will effectively suspend implementation of additional export controls on rare earth metals and terminate investigations targeting US companies in the semiconductor supply chain, the White House announced.",
    "link": "https://www.ndtvprofit.com/business/china-to-suspend-some-rare-earth-curbs-probes-on-us-chip-firms",
    "timestamp": "2025-11-02T03:55:49Z"
  },
  {
    "title": "‘SNL’ Goes Full Zohran Mamdani Vs. Donald Trump In Big Apple Cold Open",
    "description": "The federal government is still shut down, food stamps are being cut off for millions of Americans, the LA Dodgers are still grinding it out with the Toronto Blue Jays in the World Series finale and there’s big elections in NYC, Virginia and New Jersey on Nov…",
    "link": "http://deadline.com/2025/11/snl-cold-open-zohran-mamdani-trump-1236604869/",
    "timestamp": "2025-11-02T03:53:25Z"
  },
  {
    "title": "US urges ASEAN to be firm in countering China in South China Sea",
    "description": "Hours later, he struck a notably softer tone online, saying that US–China ties have “never been better” and that both sides agreed to set up direct military communication channels",
    "link": "https://www.thehindubusinessline.com/news/world/us-urges-asean-to-be-firm-in-countering-china-in-south-china-sea/article70231887.ece",
    "timestamp": "2025-11-02T03:51:23Z"
  },
  {
    "title": "Obama, Harris hit the campaign trail; Trump's political operation invests in NJ, VA",
    "description": "Barack Obama and Kamala Harris, in separate rallies on Saturday, called to turn out to vote -- as Donald Trump’s political operation invests millions in voter turnout.",
    "link": "https://abcnews.go.com/Politics/barack-obama-kamala-harris-campaign-democrats-donald-trumps/story?id=127101044",
    "timestamp": "2025-11-02T03:47:57Z"
  },
  {
    "title": "US, China agree to set up military-to-military channels, Hegseth says",
    "description": "Move comes after Trump-Xi summit yields progress on trade war and pledges to calm tensions.",
    "link": "https://www.aljazeera.com/news/2025/11/2/us-china-agree-to-set-up-military-to-military-channels-hegseth-says",
    "timestamp": "2025-11-02T03:45:07Z"
  },
  {
    "title": "US military kills three in another strike on Caribbean vessel",
    "description": "Defence secretary says the strike was carried out on Trump's orders and targeted 'narco-terrorists'.",
    "link": "https://www.aljazeera.com/news/2025/11/2/us-military-kills-three-in-another-strike-on-caribbean-vessel",
    "timestamp": "2025-11-02T03:41:03Z"
  },
  {
    "title": "Gabbard Says Trump Has Ended America's Era Of 'Regime Change'",
    "description": "Gabbard Says Trump Has Ended America's Era Of 'Regime Change'\n \nAuthored by Tom Ozimek via The Epoch Times (emphasis ours),\nTulsi Gabbard, the U.S. national intelligence director, said on Oct. 31 that America’s former strategy of “regime change or nation buil…",
    "link": "https://biztoc.com/x/f6bfde5b9de198fd",
    "timestamp": "2025-11-02T03:40:50Z"
  },
  {
    "title": "Nexperia's China unit says it has 'sufficient inventories' after Dutch parent's supply suspension",
    "description": "Dutch chipmaker Nexperia’s China branch said it has enough stock and secure supply chains despite its Dutch parent stopping wafer shipments over a payment dispute. After Dutch authorities seized control from Chinese owner Wingtech, tensions rose, but China ma…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nexperias-china-unit-says-it-has-sufficient-inventories-after-dutch-parents-supply-suspension/articleshow/125028496.cms",
    "timestamp": "2025-11-02T03:38:22Z"
  },
  {
    "title": "Fetterman calls for bipartisan cooperation as he continues working across party lines on key issues",
    "description": "Pennsylvania Sen. John Fetterman explained why he supports working across party lines, citing his co-sponsorship of the Laken Riley Act and opposition to shutdowns.",
    "link": "https://www.foxnews.com/media/fetterman-calls-bipartisan-cooperation-he-continues-working-across-party-lines-key-issues",
    "timestamp": "2025-11-02T03:36:14Z"
  },
  {
    "title": "US military kills three in strike on drug-trafficking vessel in Caribbean, Hegseth says",
    "description": "(Reuters) -U.S. Defense Secretary Pete Hegseth said on Sunday that the U.S. military conducted a lethal strike on a vessel operated by a drug trafficking organization in the Caribbean, killing three men aboard. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/02/us-military-kills-three-in-strike-on-drug-trafficking-vessel-in-caribbean-hegseth-says",
    "timestamp": "2025-11-02T03:20:00Z"
  },
  {
    "title": "Trump threatens US military action in Nigeria over treatment of Christians",
    "description": "Trump called Nigeria a \"disgraced country\" and warned its government must move quickly.",
    "link": "https://indianexpress.com/article/world/trump-threatens-us-military-action-in-nigeria-10341062/",
    "timestamp": "2025-11-02T03:15:58Z"
  },
  {
    "title": "‘I can’t eat’: Millions risk losing food aid during US shutdown",
    "description": "The food bank's president Brian Greene told AFP that the SNAP stoppage affects \"about 425,000 households just in the Houston area.\"\nThe post ‘I can’t eat’: Millions risk losing food aid during US shutdown appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/i-cant-eat-millions-risk-losing-food-aid-during-us-shutdown/article",
    "timestamp": "2025-11-02T03:15:30Z"
  },
  {
    "title": "The logic of Trump resuming nuclear weapons testing",
    "description": "In this fraught international context, Trump is acting totally saneDonald Trump has exercised the nuclear option, sort of. Sitting somewhere in South Korea, the President launched a Truth Social post on the topic of nukes: “Because of other countries testing …",
    "link": "https://freerepublic.com/focus/f-news/4350165/posts",
    "timestamp": "2025-11-02T03:12:50Z"
  },
  {
    "title": "DAVE BOSSIE: Arctic Frost Accountability Starts With Impeaching Judge Boasberg",
    "description": "Newly disclosed facts surrounding the Biden Administration’s \\weaponization of the DOJ and FBI has once again reached a fever pitch.",
    "link": "https://dailycaller.com/2025/11/01/opinion-arctic-frost-accountability-starts-with-impeaching-judge-boasberg-dave-bossie/",
    "timestamp": "2025-11-02T03:06:08Z"
  },
  {
    "title": "‘Swing for the fences’: Carney promises bold budget as US threat grows",
    "description": "Carney said his government would propose a budget that addresses the stark new geopolitical realities facing Canada.\nThe post ‘Swing for the fences’: Carney promises bold budget as US threat grows appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/swing-for-the-fences-carney-promises-bold-budget-as-us-threat-grows/article",
    "timestamp": "2025-11-02T02:56:38Z"
  }
]