[
  {
    "title": "New DAA boss facing into a hard landing after Kenny Jacobs exit",
    "description": "Contentious issues include the Dublin Airport passenger cap, rules on airport noise and the need for new infrastructure",
    "link": "https://www.irishtimes.com/business/2026/02/13/new-daa-boss-facing-into-a-hard-landing-after-kenny-jacobs-exit/",
    "timestamp": "2026-02-13T05:55:00Z"
  },
  {
    "title": "New DAA boss facing into a hard landing after Kenny Jacobs exit",
    "description": "Contentious issues include the Dublin Airport passenger cap, rules on airport noise and the need for new infrastructure",
    "link": "https://www.irishtimes.com/business/2026/02/13/agenda/",
    "timestamp": "2026-02-13T05:55:00Z"
  },
  {
    "title": "World's largest aircraft carrier sent to Middle East amid Iran tensions",
    "description": "The world's largest aircraft carrier, is sailing to the Middle East. This move by the USS Gerald R. Ford, places two carriers in the region as US President Donald Trump considers military action against Iran. The USS Abraham Lincoln carrier group is already p…",
    "link": "https://economictimes.indiatimes.com/news/defence/worlds-largest-aircraft-carrier-deployed-to-middle-east-amid-rising-iran-tensions-military-escalation-or-strategic-strategy/articleshow/128290522.cms",
    "timestamp": "2026-02-13T05:52:57Z"
  },
  {
    "title": "AI’s bitter rivalry heads to Washington",
    "description": "Founded in 2021 by former AI researchers, Anthropic has grown into a world-leading AI company focused on businesses and software developers.\nThe post AI’s bitter rivalry heads to Washington appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/ais-bitter-rivalry-heads-to-washington/article",
    "timestamp": "2026-02-13T05:52:49Z"
  },
  {
    "title": "Message to Iran: USS Gerald R. Ford redeployed to Middle East",
    "description": "The USS Gerald R. Ford and its escort ships are being sent from the Caribbean to the Middle East to join the USS Abraham Lincoln strike group, amid tensions with Iran.",
    "link": "https://www.israelnationalnews.com/news/422369",
    "timestamp": "2026-02-13T05:49:00Z"
  },
  {
    "title": "USS Ford ordered to the Middle East, the second aircraft carrier being sent to the region",
    "description": "The USS Gerald R. Ford aircraft carrier was ordered to the Middle East as President Donald Trump weighs military action against Iran amid rising regional tensions.",
    "link": "https://www.foxnews.com/world/uss-ford-ordered-middle-east-second-aircraft-carrier-being-sent-region",
    "timestamp": "2026-02-13T05:48:16Z"
  },
  {
    "title": "Britain’s Starmer set to call for multinational defence initiative, FT says",
    "description": "Feb 13 (Reuters) - British Prime Minister Kier Starmer is set to make the case for Britain and its Western allies to launch a multinational defence initiative that could … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/britain-s-starmer-set-to-call-for-multinational-defence-initiative-ft-says",
    "timestamp": "2026-02-13T05:47:36Z"
  },
  {
    "title": "Trump dismantles legal basis for US climate rules",
    "description": "President Donald Trump on Thursday revoked a landmark scientific finding underpinning U.S. regulations to curb planet-warming pollution, marking his biggest rollback of climate policy to date.",
    "link": "https://www.hurriyetdailynews.com/trump-dismantles-legal-basis-for-us-climate-rules-218899",
    "timestamp": "2026-02-13T05:40:04Z"
  },
  {
    "title": "Malaysia's economy grows at fastest pace in 3 years in 2025, exceeding expectations",
    "description": "KUALA LUMPUR, Feb 13 : Malaysia's economy expanded at its fastest pace in three years in 2025, surpassing expectations as strong domestic demand, exports and investment propelled growth, with momentum likely to continue this year, the central bank said on Fri…",
    "link": "https://www.channelnewsasia.com/business/malaysias-economy-grows-fastest-pace-in-3-years-in-2025-exceeding-expectations-5928816",
    "timestamp": "2026-02-13T05:37:33Z"
  },
  {
    "title": "Multilateralism has role to play in tumultuous times: World Bank president",
    "description": "\"The private sector and private capital mobilisation, combined with the money you can get from the public sector, combined with philanthropy, that's a good combination to work with,\" Banga said",
    "link": "https://www.business-standard.com/world-news/multilateralism-has-role-to-play-in-tumultuous-times-world-bank-president-126021300594_1.html",
    "timestamp": "2026-02-13T05:36:52Z"
  },
  {
    "title": "UN climate chief says 'new world disorder' threatens cooperation",
    "description": "The U.N.'s climate chief on Thursday urged countries to unite against an \"unprecedented threat\" to international cooperation from pro-fossil fuel forces — issuing the appeal as US President Donald Trump rattles the global order.",
    "link": "https://www.hurriyetdailynews.com/un-climate-chief-says-new-world-disorder-threatens-cooperation-218898",
    "timestamp": "2026-02-13T05:34:56Z"
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says (Konstantin Toropin/Associated Press)",
    "description": "Konstantin Toropin / Associated Press:\nSecond US aircraft carrier is being sent to the Middle East, AP source says  —  The world's largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans sa…",
    "link": "https://www.memeorandum.com/260213/p2",
    "timestamp": "2026-02-13T05:30:01Z"
  },
  {
    "title": "Donald Trump agrees to end Minnesota ICE crackdown, says border tsar",
    "description": "US president Donald Trump has agreed to end his hotly protested deportation surge in Minnesota, White House border tsar Tom Homan said yesterday, with many ICE agents set to return to their home states over the next week.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-agrees-to-end-minnesota-ice-crackdown-says-border-tsar/a822510689.html",
    "timestamp": "2026-02-13T05:30:00Z"
  },
  {
    "title": "Catherine Prasifka: If we really want to punch above our weight this St Patrick’s Day, we should cancel White House visit",
    "description": "On St Patrick’s Day 1952, the first box of shamrock was delivered to the White House. Seventy-four years later, Taoiseach Micheál Martin has accepted this year’s invitation to meet with US president Donald Trump.",
    "link": "https://www.independent.ie/opinion/comment/catherine-prasifka-if-we-really-want-to-punch-above-our-weight-this-st-patricks-day-we-should-cancel-white-house-visit/a947834095.html",
    "timestamp": "2026-02-13T05:30:00Z"
  },
  {
    "title": "USS Gerald R. Ford aircraft carrier headed from Caribbean to Middle East: Officials",
    "description": "The USS Gerald R. Ford carrier strike group is expected to leave the Caribbean and head towards the Middle East in the coming days, according to three U.S. officials.",
    "link": "https://abcnews.com/International/uss-gerald-ford-aircraft-carrier-headed-caribbean-middle/story?id=130127299",
    "timestamp": "2026-02-13T05:22:14Z"
  },
  {
    "title": "Another US' aircraft carrier likely being sent to Middle East amid tensions",
    "description": "The world's largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans said Thursday, as US President Donald Trump considers whether to take possible military action against Iran.\nThe move by …",
    "link": "https://www.business-standard.com/world-news/another-us-aircraft-carrier-likely-being-sent-to-middle-east-amid-tensions-126021300495_1.html",
    "timestamp": "2026-02-13T05:19:39Z"
  },
  {
    "title": "Too Late, Mr. Trump. You Cannot Undo the Multi-Racial, Multi-National Real America",
    "description": "White people are not being \"replaced\" by invading non-whites, who  have been here all along--because the U.S. incorporated them as we expanded",
    "link": "https://www.juancole.com/2026/02/cannot-national-america.html",
    "timestamp": "2026-02-13T05:15:14Z"
  },
  {
    "title": "‘The Daily Show’ Audience Audibly Groans After Biting Titan Submersible Joke: ‘I Know, Facts Hurt’ | Video",
    "description": "The OceanGate vessel imploded in 2023 while taking guests down to the wreck of the Titanic\nThe post ‘The Daily Show’ Audience Audibly Groans After Biting Titan Submersible Joke: ‘I Know, Facts Hurt’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/the-daily-show-audience-reaction-titan-submersible-joke/",
    "timestamp": "2026-02-13T05:11:44Z"
  },
  {
    "title": "US Market Today | Too tight or just right? Fed policy path sparks fresh divide",
    "description": "Federal Reserve Governor Stephen Miran cautions that current monetary policy may be too restrictive. He believes inflation is not a major concern, citing subdued shelter inflation. Miran advocates for looser policy to support the labor market as supply condit…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-today-too-tight-or-just-right-fed-policy-path-sparks-fresh-divide/articleshow/128289542.cms",
    "timestamp": "2026-02-13T05:10:31Z"
  },
  {
    "title": "From Greenland to the Great Lakes, Secession is Our Best Hope for Escaping Tyranny",
    "description": "“We will have everything we want; we’re getting everything we want, at no cost!” the President of Babylon barked triumphantly over his latest diplomatic conquest in Greenland. After weeks of mounting tensions between our dear leader and his on-again-off-again…",
    "link": "https://www.counterpunch.org/2026/02/13/from-greenland-to-the-great-lakes-secession-is-our-best-hope-for-escaping-tyranny/",
    "timestamp": "2026-02-13T05:07:41Z"
  },
  {
    "title": "Capito praises Trump’s support for coal industry",
    "description": "WHEELING — U.S. Sen. Shelley Moore Capito said a move this week by President Donald Trump will help keep some coal-fired power plants open longer in West Virginia. During a press call with reporters across the state on Thursday, Capito was asked to provide in…",
    "link": "https://www.newsandsentinel.com/news/business/2026/02/capito-praises-trumps-support-for-coal-industry/",
    "timestamp": "2026-02-13T05:05:48Z"
  },
  {
    "title": "The rupee after a 6-month-long storm: trade relief, fresh hope, old constraints",
    "description": "The rupee’s six-month slide, driven by U.S. tariffs and policy uncertainty, reversed sharply after signals of a friendlier trade deal. While improved sentiment, sectoral gains, and potential foreign inflows offer support, unresolved agreement details, oil dyn…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-rupee-after-a-6-month-long-storm-trade-relief-fresh-hope-old-constraints/articleshow/128289278.cms",
    "timestamp": "2026-02-13T05:05:10Z"
  },
  {
    "title": "MAGA Outgrows Isolationism: And Yet America First Means America Alone",
    "description": "Donald Trump considers international law nothing more than a trifling impediment by which the weak try to drag down the strong.",
    "link": "https://www.juancole.com/2026/02/outgrows-isolationism-america.html",
    "timestamp": "2026-02-13T05:04:03Z"
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East: Source",
    "description": "The move by the USS Gerald R Ford will put two carriers and their accompanying warships in the region as US President Donald Trump increases pressure on Iran to make a deal over its nuclear programme.",
    "link": "https://www.channelnewsasia.com/world/us-aircraft-carrier-uss-gerald-r-ford-middle-east-military-action-iran-5928691",
    "timestamp": "2026-02-13T05:03:40Z"
  },
  {
    "title": "Jordan Klepper Nails The 'F**king Idiot' Trump Put In Charge Of A Crucial Agency",
    "description": "The \"Daily Show\" host tore into the president for stripping away key environmental protections.",
    "link": "https://www.huffpost.com/entry/jordan-klepper-trump-coal_n_698ea652e4b09bc097f9b979",
    "timestamp": "2026-02-13T05:01:50Z"
  },
  {
    "title": "Arms Control Was Once Trump’s Signature Issue",
    "description": "What is needed in this multipolar nuclear era is a president with the vision of his younger self.",
    "link": "http://foreignpolicy.com/2026/02/13/trump-nuclear-order-arms-control/",
    "timestamp": "2026-02-13T05:01:28Z"
  },
  {
    "title": "Trump administration reaches a trade deal to lower Taiwan's tariff barriers",
    "description": "Taiwan has reached a trade deal with the United States that cuts almost all of its tariff barriers",
    "link": "https://abcnews.com/Business/wireStory/trump-administration-reaches-trade-deal-lower-taiwans-tariff-130119661",
    "timestamp": "2026-02-13T05:01:27Z"
  },
  {
    "title": "Trump’s $10 billion lawsuit against BBC set for trial in 2027",
    "description": "US judge rules that President Trump’s $10 billion defamation lawsuit against the BBC over the editing of his January 6, 2021 speech will proceed to trial in 2027.",
    "link": "https://www.israelnationalnews.com/news/422367",
    "timestamp": "2026-02-13T04:52:16Z"
  },
  {
    "title": "Second U.S. Aircraft Carrier Is Being Sent To The Middle East, Source Says",
    "description": "The world’s largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans said Thursday.",
    "link": "https://www.huffpost.com/entry/united-states-iran-military-aircraft-carrier_n_698ead3be4b08d2eb24cfdd7",
    "timestamp": "2026-02-13T04:51:56Z"
  },
  {
    "title": "CNN Panel Battles Over ICE Pullback in Minnesota: ‘Look Alex Pretti’s Mother in the Face!’",
    "description": "A raucous CNN panel reached a boiling point on Thursday when longtime Trump supporter Joe Borelli claimed that the recent federal immigration surge operation in Minneapolis was a success.\nThe post CNN Panel Battles Over ICE Pullback in Minnesota: ‘Look Alex P…",
    "link": "https://www.mediaite.com/media/news/cnn-panel-battles-over-ice-pullback-in-minnesota-look-alex-prettis-mother-in-the-face/",
    "timestamp": "2026-02-13T04:50:47Z"
  },
  {
    "title": "Factbox-What to watch at North Korea’s Ninth Party Congress",
    "description": "SEOUL, Feb 13 (Reuters) - North Korea is expected to convene the Ninth Congress of the ruling Workers’ Party this month, the country’s biggest political gathering that re… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/factbox-what-to-watch-at-north-korea-s-ninth-party-congress",
    "timestamp": "2026-02-13T04:48:35Z"
  },
  {
    "title": "North Korea's Kim to tout power and military gains at party congress",
    "description": "SEOUL, Feb 13 (Reuters) - North Korea will convene ⁠the Ninth Party Congress this month, a major political undertaking aimed at showcasing leader Kim Jong Un's absolute grip on power and his image as a benevolent leader at ⁠home and as head of a world-class m…",
    "link": "https://www.thestar.com.my/news/world/2026/02/13/north-korea039s-kim-to-tout-power-and-military-gains-at-party-congress",
    "timestamp": "2026-02-13T04:48:00Z"
  },
  {
    "title": "Global Markets | The Great Rebalancing: How global powers are redrawing the investment map",
    "description": "Global markets are responding to a fragmentation of U.S.-led economic leadership, with investors seeing opportunities in a more multipolar framework. Allies are rethinking strategic positioning, leading to increased exposure to non-U.S. equity markets, energy…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-markets-the-great-rebalancing-how-global-powers-are-redrawing-the-investment-map/articleshow/128288749.cms",
    "timestamp": "2026-02-13T04:45:22Z"
  },
  {
    "title": "North Korea’s Kim to tout power and military gains at party congress",
    "description": "By Heejin Kim and Kyu-seok ShimSEOUL, Feb 13 (Reuters) - North Korea will convene the Ninth Party Congress this month, a major political undertaking aimed at showcasing l… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/north-korea-s-kim-to-tout-power-and-military-gains-at-party-congress",
    "timestamp": "2026-02-13T04:44:24Z"
  },
  {
    "title": "Crude futures edge lower as IEA sees global oil surplus in 2026",
    "description": "Global oil supply likely to exceed demand by 3.73 million barrels a day in 2026, says IEA’s Oil Market Report",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-futures-edge-lower-as-iea-sees-global-oil-surplus-in-2026/article70627091.ece",
    "timestamp": "2026-02-13T04:43:36Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking (Associated Press)",
    "description": "Associated Press:\nTrump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking  —  President Donald Trump on Thursday pardoned five former professional football players — one posthumously — for various crimes ranging from perjury to …",
    "link": "https://www.memeorandum.com/260212/p140",
    "timestamp": "2026-02-13T04:40:00Z"
  },
  {
    "title": "Connecticut leaders chastise President Trump’s repeal of EPA endangerment finding",
    "description": "Gov. Ned Lamont, AG William Tong and DEEP Commissioner Katie Dykes each criticized the Trump Administration for rescinding the landmark Obama-era regulation.",
    "link": "https://www.fox61.com/article/news/health/connecticut-leaders-condemn-president-trumps-repeal-of-epa-endangerment-finding/520-88d3a1b3-3a71-4720-bb50-340a7ccb8705",
    "timestamp": "2026-02-13T04:37:33Z"
  },
  {
    "title": "The measles vaccine: A product of two centuries of science and public health reform",
    "description": "For much of the 20th century, measles was regarded as an unavoidable illness of childhood, even as it killed millions of people worldwide each year. The development of a safe and effective vaccine fundamentally changed that reality.",
    "link": "https://www.wsws.org/en/articles/2026/02/13/svqo-f13.html",
    "timestamp": "2026-02-13T04:36:31Z"
  },
  {
    "title": "JUST IN: Trump Says Pam Bondi’s Congressional Testimony on Epstein Files was “Fantastic”",
    "description": "President Trump on Thursday reacted to Pam Bondi’s House Judiciary Committee testimony on Wednesday, commending her for what he described as a “fantastic” performance during questioning over the Epstein Files. “Bondi, under intense fire from the Trump Derange…",
    "link": "https://freerepublic.com/focus/f-chat/4366666/posts",
    "timestamp": "2026-02-13T04:29:42Z"
  },
  {
    "title": "The Decline and Fall of Donald Trump",
    "description": "New York NY (SPX) Feb 13, 2026\n\n\nAs Donald Trump's decline begins, his fall is unlikely to look like a thunderclap so much as a tide going out. One by one, the people and institutions that once swore they would follow him anywhere are stepping back, hedging, …",
    "link": "https://www.spacewar.com/reports/The_Decline_and_Fall_of_Donald_Trump_999.html",
    "timestamp": "2026-02-13T04:25:58Z"
  },
  {
    "title": "Jyotiraditya Scindia slams Rahul Gandhi for ‘maligning’ India",
    "description": "Union Minister Jyotiraditya Scindia has accused Rahul Gandhi of damaging India's image. Scindia stated that Gandhi's constant criticism on every platform will not benefit Congress or himself. He highlighted India's progress under Prime Minister Narendra Modi.…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/jyotiraditya-scindia-slams-rahul-gandhi-for-maligning-india/articleshow/128287959.cms",
    "timestamp": "2026-02-13T04:21:22Z"
  },
  {
    "title": "Trump nominee stalls after GOP senator challenges him on remarks about Jews and Israel",
    "description": "Sen. John Curtis said he opposes Jeremy Carl for a State Department post in part because of his \"anti-Israel views and insensitive remarks about the Jewish people.\"",
    "link": "https://www.nbcnews.com/politics/trump-administration/state-department-nominee-jeremy-carl-senator-john-curtis-israel-jews-rcna258858",
    "timestamp": "2026-02-13T04:20:30Z"
  },
  {
    "title": "Cardi B Throws Down with DHS in Bonkers Tweet Brawl Over ICE, Epstein Files",
    "description": "Rapper Cardi B battled via tweet with the Department of Homeland Security after the agency criticized comments she made about ICE at her concert.\nThe post Cardi B Throws Down with DHS in Bonkers Tweet Brawl Over ICE, Epstein Files first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/cardi-b-throws-down-with-dhs-in-bonkers-tweet-brawl-over-ice-epstein-files/",
    "timestamp": "2026-02-13T04:17:19Z"
  },
  {
    "title": "Trump revokes basis of US climate regulation, ends vehicle emission standards",
    "description": "It is the most sweeping climate change policy rollback by the administration to date, after a string of regulatory cuts and ‌other moves intended to unfetter fossil fuel development and stymie the rollout of clean energy",
    "link": "https://www.thehindubusinessline.com/news/world/trump-revokes-basis-of-us-climate-regulation-ends-vehicle-emission-standards/article70626956.ece",
    "timestamp": "2026-02-13T04:11:42Z"
  },
  {
    "title": "DOJ moves to drop charges against men arrested after Minneapolis ICE shooting",
    "description": "By Kanishka SinghWASHINGTON, Feb 12 (Reuters) - The U.S. Justice Department has moved to drop charges against two men charged with assaulting Immigration and Customs Enfo… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/doj-moves-to-drop-charges-against-men-arrested-after-minneapolis-ice-shooting",
    "timestamp": "2026-02-13T04:09:46Z"
  },
  {
    "title": "How low can he go?",
    "description": "Who among the MAGA cult will admit buyer’s remorse? Surely not all of you have abandoned morality and social conscience to follow this man.",
    "link": "https://www.ncspin.com/how-low-can-he-go",
    "timestamp": "2026-02-13T04:09:29Z"
  },
  {
    "title": "Friday, the 13th effect? D-Street investors suffer over Rs 4 lakh crore shock as Sensex sinks over 800 points",
    "description": "Indian stock markets opened sharply lower on Friday. The Sensex and Nifty saw significant drops. This decline was driven by a major selloff in IT stocks. Investor sentiment was rattled by fears of Artificial Intelligence disruption. Major IT companies experie…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-friday-the-13th-effect-d-street-investors-suffer-over-rs-4-lakh-crore-shock-as-sensex-nifty-fall-1/articleshow/128287282.cms",
    "timestamp": "2026-02-13T04:07:05Z"
  },
  {
    "title": "Author reveals a strange detail about the Trumps' marriage: 'Of a different nature'",
    "description": "An author who has written four books about President Donald Trump revealed a strange detail about the president's marriage. Journalist Michael Wolff said during an interview on \"Inside Trump's Head,\" a podcast he co-hosted with Hugh Dougherty, executive edito…",
    "link": "https://www.rawstory.com/melania-trump-2675265294/",
    "timestamp": "2026-02-13T04:02:15Z"
  },
  {
    "title": "No code of common decency",
    "description": "Trump is able to successfully and fiendishly hide his indecency behind a false mask of patriotism, using the power of the presidency to perpetuate.",
    "link": "https://www.ncspin.com/no-code-of-common-decency",
    "timestamp": "2026-02-13T04:01:47Z"
  },
  {
    "title": "Trump’s upheaval of the Atlantic alliance to loom over Munich security forum",
    "description": "By Sarah Marsh and Andrew GrayBERLIN/MUNICH, Feb 13 (Reuters) - One year after U.S. Vice President JD Vance attacked European allies at the Munich Security Conference, Wa… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/trump-s-upheaval-of-the-atlantic-alliance-to-loom-over-munich-security-forum",
    "timestamp": "2026-02-13T04:01:28Z"
  },
  {
    "title": "India will buy US LNG if offered at reasonable price, Petronet CEO says",
    "description": "Last week, President Trump announced he will reduce tariffs on Indian imports from 50% to 18%, while requesting India to more than double its annual imports from the US",
    "link": "https://www.thehindubusinessline.com/markets/commodities/india-will-buy-us-lng-if-offered-at-reasonable-price-petronet-ceo-says/article70626924.ece",
    "timestamp": "2026-02-13T04:01:26Z"
  },
  {
    "title": "US Banking Lobby Urges OCC To Delay Crypto Charter Applications Approval",
    "description": "The US’s largest banking lobby has requested the Office of the Comptroller of the Currency (OCC) delay its approval of crypto bank charter applications, suggesting the regulator wait until regulatory uncertainty is cleared. Related Reading: Hong Kong Unveils …",
    "link": "https://bitcoinist.com/us-banking-lobby-occ-crypto-charter-approval/",
    "timestamp": "2026-02-13T04:00:17Z"
  },
  {
    "title": "‘We’re Coming for You’: Tom Homan Issues Warning on Heels of Minnesota Pullout",
    "description": "Tom Homan said that the recent pullback of immigration enforcement officials from Minneapolis would by no means mark an end to ICE operations across the country.\nThe post ‘We’re Coming for You’: Tom Homan Issues Warning on Heels of Minnesota Pullout first app…",
    "link": "https://www.mediaite.com/media/tv/were-coming-for-you-tom-homan-issues-warning-on-heels-of-minnesota-pullout/",
    "timestamp": "2026-02-13T03:53:33Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "description": "President Donald Trump has pardoned five former NFL players for crimes that include perjury, counterfeiting and drug trafficking",
    "link": "https://abcnews.com/US/wireStory/trump-pardons-5-former-nfl-players-crimes-ranging-130126109",
    "timestamp": "2026-02-13T03:49:42Z"
  },
  {
    "title": "GOP Senator took donations from Epstein conspirator before voting to block files: report",
    "description": "A Republican Senator from Ohio voted to block the release of the Jeffrey Epstein files after receiving a campaign donation from one of the convicted sex criminal's co-conspirators, according to a report. Sen. Jon Husted (R-OH) received a $3,500 donation from …",
    "link": "https://www.rawstory.com/jeffrey-epstein-2675265263/",
    "timestamp": "2026-02-13T03:46:22Z"
  },
  {
    "title": "The 5 Wildest Revelations From Bombshell Kristi Noem-Corey Lewandowski Exposé",
    "description": "The Wall Street Journal dropped a bombshell exposé about DHS Secretary Kristi Noem and Corey Lewandowski, on Thursday evening\nThe post The 5 Wildest Revelations From Bombshell Kristi Noem-Corey Lewandowski Exposé first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/the-5-wildest-revelations-from-bombshell-kristi-noem-corey-lewandowski-expose/",
    "timestamp": "2026-02-13T03:38:37Z"
  },
  {
    "title": "Trump's Board of Peace Welcomes Israel as Founding Member",
    "description": "Israel officially joined the Board of Peace before the first formal meeting of the body.",
    "link": "https://sputnikglobe.com/20260213/trumps-board-of-peace-welcomes-israel-as-founding-member-1123627203.html",
    "timestamp": "2026-02-13T03:37:00Z"
  },
  {
    "title": "Kathy Griffin Considers Herself “Uncanceled” After Trump Severed Head Photo: “Ahead Of My Time”",
    "description": "Nearly nine years later, Kathy Griffin is moving on with her career after a bloody anti-Trump protest photo went too far for many. The 2x Emmy-winning comedian said that although “people still define me by” the 2017 photo of Griffin holding a fake severed hea…",
    "link": "http://deadline.com/2026/02/kathy-griffin-uncanceled-trump-severed-head-photo-1236718214/",
    "timestamp": "2026-02-13T03:36:00Z"
  },
  {
    "title": "Canadian physics professor steps back from job over Epstein questions",
    "description": "A highly regarded theoretical physicist has \"agreed to pause his working relationship\" with the Perimeter Institute in Waterloo, Ont., which he helped found, over questions about his presence in the Jeffrey Epstein files released by the U.S. government last m…",
    "link": "https://www.cbc.ca/news/investigates/canadian-scholars-entrepreneurs-epstein-network-9.7087789",
    "timestamp": "2026-02-13T03:35:17Z"
  },
  {
    "title": "Canadian physics professor steps back from job over Epstein questions",
    "description": "A highly regarded theoretical physicist has \"agreed to pause his working relationship\" with the Perimeter Institute in Waterloo, Ont., which he helped found, over questions about his presence in the Jeffrey Epstein files released by the U.S. government last m…",
    "link": "https://www.cbc.ca/news/investigates/lee-smolin-perimeter-institute-epstein-files-9.7087789",
    "timestamp": "2026-02-13T03:35:17Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "description": "President Donald Trump on Thursday pardoned five former professional football players — one posthumously — for various crimes ranging from perjury to drug trafficking. The pardons were announced by White House pardon czar Alice Marie Johnson. Ex-NFL players J…",
    "link": "https://sports.yahoo.com/articles/trump-pardons-5-former-nfl-033359034.html",
    "timestamp": "2026-02-13T03:33:59Z"
  },
  {
    "title": "Cardi B Calls Out Trump’s DHS in Online Feud: ‘Why Y’all Don’t Wanna Talk About the Epstein Files?’",
    "description": "The rapper slammed the Department of Homeland Security after it mocked her for saying she'd \"jump\" ICE if they came after her fans during a show",
    "link": "http://www.rollingstone.com/music/music-news/cardi-b-tour-homeland-security-ice-trump-1235515728/",
    "timestamp": "2026-02-13T03:31:52Z"
  },
  {
    "title": "This Week’s Most Popular Articles",
    "description": "Video: Epstein Atrocities and the Fate of Our Children. “Epsteinization”: The Criminalization of Politics Drago Bosnic, February 7, 2026 Epstein Files: Kosovo Narco-terrorists helped Traffic over a Million Children for Deranged Western Elites Drago Bosnic, Fe…",
    "link": "https://www.globalresearch.ca/this-weeks-most-popular-articles-207/5915674",
    "timestamp": "2026-02-13T03:25:33Z"
  },
  {
    "title": "ICE blocked detainee lawyer access in Minnesota, judge",
    "description": "A federal judge has ordered US Immigration and Customs Enforcement (ICE) to ensure that detainees have access to their attorneys ⁠in Minnesota, after finding that the agency had blocked thousands of people from seeing their lawyers during a recent enforcement…",
    "link": "https://www.rte.ie/news/world/2026/0213/1558262-minnesota-ice-judge/",
    "timestamp": "2026-02-13T03:24:08Z"
  },
  {
    "title": "ICE blocked detainee lawyer access in Minnesota, judge",
    "description": "A federal judge has ordered US Immigration and Customs Enforcement to ensure that detainees have access to their attorneys ⁠in Minnesota.",
    "link": "https://www.rte.ie/news/world/2026/0213/1558262-minnesota-ice/",
    "timestamp": "2026-02-13T03:24:08Z"
  },
  {
    "title": "'It is going to be very traumatic': Trump threatens Iran over nuclear deal",
    "description": "Trump emphasised the need for a nuclear deal with Iran, warning that failure to reach one would bring a 'very traumatic' outcome",
    "link": "https://www.business-standard.com/world-news/it-is-going-to-be-very-traumatic-trump-threatens-iran-over-nuclear-deal-126021300063_1.html",
    "timestamp": "2026-02-13T03:23:40Z"
  },
  {
    "title": "AOC to Give Talk on Foreign Policy at the Munich Security Conference for Some Reason",
    "description": "Far left New York Rep.\nThe post AOC to Give Talk on Foreign Policy at the Munich Security Conference for Some Reason appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/aoc-give-talk-foreign-policy-munich-security-conference/",
    "timestamp": "2026-02-13T03:20:38Z"
  },
  {
    "title": "Prime Minister Netanyahu lands in Israel",
    "description": "Prime Minister Benjamin Netanyahu and his entourage landed in Israel, following the visit to Washington and Netanyahu's meeting with US President Donald Trump.",
    "link": "https://www.israelnationalnews.com/flashes/676225",
    "timestamp": "2026-02-13T03:16:00Z"
  },
  {
    "title": "Venezuela defies U.S., vows continued alliance with Russia and China",
    "description": "In a bold rebuke to Washington, Venezuela’s government is asserting its sovereign right to maintain critical economic and strategic partnerships with Russia and China following the unprecedented U.S. military capture of its president. The dramatic events of e…",
    "link": "https://www.activistpost.com/venezuela-defies-u-s-vows-continued-alliance-with-russia-and-china/",
    "timestamp": "2026-02-13T03:16:00Z"
  },
  {
    "title": "Western countries see World War III coming",
    "description": "Voters in leading allied states broadly support higher defense spending, but balk when faced with policy trade-offs.",
    "link": "https://www.politico.eu/article/world-war-iii-defense-spending-europe-poll/",
    "timestamp": "2026-02-13T03:02:00Z"
  },
  {
    "title": "Judge says US must help bring back some of the Venezuelans deported to notorious prison",
    "description": "A federal judge has ordered the Trump administration to make arrangements to allow some of the Venezuelan migrants flown to a notorious prison in El Salvador to return to the U",
    "link": "https://abcnews.com/US/wireStory/judge-us-bring-back-venezuelans-deported-notorious-prison-130119707",
    "timestamp": "2026-02-13T03:01:31Z"
  },
  {
    "title": "Is Starmer really ‘Never Here Keir’?",
    "description": "As Keir Starmer flies to Germany for the Munich Security Conference, Westminster Insider Host Sascha O’Sullivan finds out if the Prime Minister’s time abroad has damaged him here at home – and if it has, if it’s been worth it.  Sascha spoke to half a dozen cu…",
    "link": "https://www.politico.eu/podcast/westminster-insider/is-starmer-really-never-here-keir/",
    "timestamp": "2026-02-13T03:00:00Z"
  },
  {
    "title": "300GB of data stolen: Napier law firm Langley Twigg gains injunction as hacker appears to offer files online – Tech Insider",
    "description": "PLUS: Eroad boss quits, David Kirk scores, Judith Collins' parting gift to Rocket Lab.",
    "link": "https://www.nzherald.co.nz/business/300gb-of-data-stolen-napier-law-firm-langley-twigg-gains-injunction-as-hacker-appears-to-offer-files-online-tech-insider/premium/SRAUR6EUY5DWRGUK3UISK5OPUQ/",
    "timestamp": "2026-02-13T03:00:00Z"
  },
  {
    "title": "Crisis-hit Starmer seeks solace on the world stage",
    "description": "The British leader’s allies believe his clout on the world stage can shore him up — but his own side will take some convincing.",
    "link": "https://www.politico.eu/article/crisis-hit-starmer-seeks-solace-on-the-world-stage/",
    "timestamp": "2026-02-13T03:00:00Z"
  },
  {
    "title": "Union ministers say Rahul Gandhi spreading falsehoods on US-India trade deal",
    "description": "Posting video messages on X, Goyal and Chouhan said major crops, fruits, spices, basmati rice, cotton textiles, tea, and marine products would benefit from new export opportunities, boosting farmers’ income.",
    "link": "https://www.thehindubusinessline.com/news/union-ministers-say-rahul-gandhi-spreading-falsehoods-on-us-india-trade-deal/article70626939.ece",
    "timestamp": "2026-02-13T02:59:38Z"
  },
  {
    "title": "Trump-Appointed Judge Rules ICE Violated Constitutional Rights of Minnesota Detainees — Drops Hammer in Strict Order",
    "description": "A federal judge appointed by President Trump issued a sharply-worded opinion ruling that ICE had violated the constitutional rights of detainees in Minnesota.\nThe post Trump-Appointed Judge Rules ICE Violated Constitutional Rights of Minnesota Detainees — Dro…",
    "link": "https://www.mediaite.com/lawcrime/trump-appointed-judge-rules-ice-violated-constitutional-rights-of-minnesota-detainees-drops-hammer-in-strict-order/",
    "timestamp": "2026-02-13T02:57:32Z"
  },
  {
    "title": "CK Hutchison threatens legal action against Maersk as Panama Canal ports dispute escalates",
    "description": "The simmering dispute has become a geopolitical flashpoint between Washington and Beijing, with Panama caught in the crossfires.",
    "link": "https://www.cnbc.com/2026/02/13/panama-ports-us-china-ck-hutchison-trump.html",
    "timestamp": "2026-02-13T02:54:39Z"
  },
  {
    "title": "Kremlin signals possible US–Russia trade deal under Trump administration: Bloomberg News",
    "description": "Dated this year, the document highlights seven sectors for US–Russia cooperation, including fossil fuels, natural gas, offshore petroleum, and strategic minerals, potentially benefiting American firms",
    "link": "https://www.thehindubusinessline.com/news/world/kremlin-signals-possible-usrussia-trade-deal-under-trump-administration-bloomberg-news/article70626928.ece",
    "timestamp": "2026-02-13T02:51:18Z"
  },
  {
    "title": "Global EV sales hampered by China, US slowdown in January",
    "description": "Global carmakers with large exposure to the U.S. market have booked some $55 billion in writedowns in the past year as they ‌scale back electric ⁠vehicle ambitions ⁠on a tough U.S. market under President Donald Trump, price wars in China and a more ​complex m…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/global-ev-sales-hampered-by-china-us-slowdown-in-january/articleshow/128285087.cms",
    "timestamp": "2026-02-13T02:46:59Z"
  },
  {
    "title": "Global EV sales hampered by China, US slowdown in January",
    "description": "Global carmakers with large exposure to the U.S. market have booked some $55 billion in writedowns in the past year as they ‌scale back electric ⁠vehicle ambitions ⁠on a tough U.S. market under President Donald Trump, price wars in China and a more ​complex m…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/global-ev-sales-hampered-by-china-us-slowdown-in-january/articleshow/128285253.cms",
    "timestamp": "2026-02-13T02:46:59Z"
  },
  {
    "title": "Will Bangladesh emerge as South Asia's new strategic power player?",
    "description": "Bangladesh is central to India's security, bordering its sensitive northeastern states. For China, it's a significant node in its Belt and Road Initiative",
    "link": "https://www.business-standard.com/world-news/will-bangladesh-emerge-as-south-asia-s-new-strategic-power-player-126021300101_1.html",
    "timestamp": "2026-02-13T02:44:19Z"
  },
  {
    "title": "US Details New China Limits for Clean Energy Tax Credits",
    "description": "The Trump administration issued new guidance on the use of foreign materials and components in US clean energy projects, in a move that would further limit access to lucrative tax credits.",
    "link": "https://financialpost.com/pmn/business-pmn/us-details-new-china-limits-for-clean-energy-tax-credits",
    "timestamp": "2026-02-13T02:35:44Z"
  },
  {
    "title": "Border Patrol agent under criminal investigation after shooting Montessori teacher 5 times",
    "description": "The Border Patrol agent who shot a Chicago teacher five times is now under criminal investigation, MS NOW reported on Thursday.\"Christopher Parente, an attorney for Marimar Martinez, said an assistant U.S. attorney in Indiana confirmed to him that Border Patr…",
    "link": "https://www.rawstory.com/marimar-martinez/",
    "timestamp": "2026-02-13T02:18:00Z"
  },
  {
    "title": "Two injured after US warship collides with supply vessel in the Carribean",
    "description": "US President Donald Trump ordered a massive naval buildup in the Caribbean in recent months to support his campaign against drug traffickers in the region",
    "link": "https://www.business-standard.com/world-news/two-injured-after-us-warship-collides-with-supply-vessel-in-the-carribean-126021300079_1.html",
    "timestamp": "2026-02-13T02:15:01Z"
  },
  {
    "title": "Oil set for weekly drop as Iran risks recede, oversupply concerns",
    "description": "On Friday, oil prices remained stable, marking a likely second consecutive weekly decline. Tensions surrounding a conflict with Iran have subsided, leading analysts to predict that this year, oil supply will surpass global demand. Gains made earlier in the da…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-set-for-weekly-drop-as-iran-risks-recede-oversupply-concerns/articleshow/128284206.cms",
    "timestamp": "2026-02-13T02:13:50Z"
  },
  {
    "title": "Joe Rogan Says Trump Administration ‘Looks F*cking Terrible’ Handling Epstein Files",
    "description": "Joe Rogan tore into the Trump administration’s handling of the Jeffrey Epstein files.",
    "link": "https://dailycaller.com/2026/02/12/joe-rogan-trump-administration-fcking-terrible-handling-epstein-files/",
    "timestamp": "2026-02-13T02:13:43Z"
  },
  {
    "title": "Oil set for weekly drop as Iran risks recede, oversupply concerns",
    "description": "BEIJING, Feb 13 : Oil prices were little changed on Friday after falling in the previous session, and are set for their second weekly decline, on receding concerns of an Iranian conflict that could affect supply and on forecasts supply will exceed demand this…",
    "link": "https://www.channelnewsasia.com/business/oil-set-weekly-drop-iran-risks-recede-oversupply-concerns-5928376",
    "timestamp": "2026-02-13T02:10:40Z"
  },
  {
    "title": "Oil set for second straight weekly drop as Iran risks recede",
    "description": "Feb 13 : Oil prices slipped on Friday and were on track for a second weekly decline on receding concerns of a U.S.-Iran conflict that could affect supply.Brent crude oil futures were down 6 cents, or 0.1 per cent, at $67.46 a barrel at 0448 GMT after falling …",
    "link": "https://www.channelnewsasia.com/business/oil-set-second-straight-weekly-drop-iran-risks-recede-5928376",
    "timestamp": "2026-02-13T02:10:00Z"
  },
  {
    "title": "Disney’s ‘Snow White’ film lost $170M, excluding marketing costs: One of the ‘biggest film financial disasters in Hollywood history’",
    "description": "Almost a year after Disney’s 2025 live-action remake of \"Snow White\" was released, final accounting has revealed that the progressive film “went over its initial production budget,” with costs for filming reaching $336.5 million.",
    "link": "https://www.oann.com/newsroom/disneys-snow-white-film-lost-170m-excluding-marketing-costs-one-of-the-biggest-film-financial-disasters-in-hollywood-history/",
    "timestamp": "2026-02-13T02:07:17Z"
  },
  {
    "title": "Arizona GOP candidate drops out of primary, narrowing field to two",
    "description": "President Donald Trump-endorsed housing developer Karrin Taylor Robson suspended her campaign Thursday for Arizona governor",
    "link": "https://abcnews.com/Politics/wireStory/arizona-gop-candidate-drops-primary-narrowing-field-130120726",
    "timestamp": "2026-02-13T02:05:26Z"
  },
  {
    "title": "Detroit Auto Rep Warns Carney That China EV Plan Risks US Trade",
    "description": "The Canadian government’s deal with China to allow Chinese-made electric vehicles into the country is putting more important trade negotiations with the US at risk, according to a representative for American automakers.",
    "link": "https://financialpost.com/pmn/business-pmn/detroit-auto-rep-warns-carney-that-china-ev-plan-risks-us-trade",
    "timestamp": "2026-02-13T02:05:06Z"
  },
  {
    "title": "ICE blocked detainees’ access to lawyers in Minnesota, judge finds",
    "description": "Feb 12 (Reuters) - A federal judge on Thursday ordered U.S. Immigration and Customs Enforcement to ensure that detainees have access to their attorneys in Minnesota, afte… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/ice-blocked-detainees-access-to-lawyers-in-minnesota-judge-finds",
    "timestamp": "2026-02-13T01:57:24Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,450",
    "description": "These are the key developments from day 1,450 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2026/2/13/russia-ukraine-war-list-of-key-events-day-1450",
    "timestamp": "2026-02-13T01:56:50Z"
  },
  {
    "title": "Israel accuses two of using military secrets to place Polymarket bets",
    "description": "The Tel Aviv indictment is the first publicly known instance of people being accused of leveraging military secrets to place bets on the popular prediction market.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5712801/polymarket-bets-traders-israel-military",
    "timestamp": "2026-02-13T01:51:25Z"
  },
  {
    "title": "EU unveils plan to restructure economy amid US, Russia, China pressure",
    "description": "European Union leaders have broadly agreed on a plan to restructure the 27-nation bloc's economy to make it more competitive as they face antagonism from US President Donald Trump, strong-arm tactics from China and hybrid threats blamed on Russia.\nMeeting in …",
    "link": "https://www.business-standard.com/world-news/eu-unveils-plan-to-restructure-economy-amid-us-russia-china-pressure-126021300054_1.html",
    "timestamp": "2026-02-13T01:49:19Z"
  },
  {
    "title": "Anthropic pours $20mn into ‘AI safeguards’ clash with OpenAI",
    "description": "Anthropic has injected $20 million into a political advocacy group that backs candidates favoring artificial intelligence regulation Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632390-anthropic-openai-political-rivalry/",
    "timestamp": "2026-02-13T01:46:59Z"
  },
  {
    "title": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stalls",
    "description": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stallsnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4485832183633-millions-lost-health-care-so-washington-republicans-could-give-their-rich-friends-yet-another-tax-cut-warnock-says-as-aca-subsidy-fight-stalls?s=a2&amp;share_destination_id=NjM4NTQxMzMtMTc3MDk0NjgzMjcwMQ%3D%3D&amp;pd=04JvNNa0&amp;hl=en_US&amp;send_time=1770946832&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.5.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-13T01:42:05Z"
  }
]