[
  {
    "title": "The Musk Vs. Trump Feud: Trump Considers Selling His Tesla In Latest Dig",
    "description": "Musk attacked Trump directly over his signature spending bill for the first time Thursday, sparking an explosive back-and-forth.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/06/the-musk-vs-trump-feud-trump-considers-selling-his-tesla-in-latest-dig/",
    "timestamp": "2025-06-06T17:26:40Z"
  },
  {
    "title": "Stephen Colbert Recaps Trump-Musk Social Media War: ‘I’m Just Glad Jeff Epstein Isn’t Alive to See Any of This’ | Video",
    "description": "\"Now Donald Trump is a Tesla owner who hates Elon Musk ... he's never been more relatable,\" the \"Late Show\" host jokes\nThe post Stephen Colbert Recaps Trump-Musk Social Media War: ‘I’m Just Glad Jeff Epstein Isn’t Alive to See Any of This’ | Video appeared fi…",
    "link": "https://www.thewrap.com/stephen-colbert-late-show-donald-trump-elon-musk-epstein-files/",
    "timestamp": "2025-06-06T17:25:35Z"
  },
  {
    "title": "'Don't Ever Challenge The President,' Johnson Warns As GOP Reacts To Feud",
    "description": "House Speaker Mike Johnson has warned his friend Elon Musk not to \"challenge\" the president after the Tesla CEO's blowup with Donald Trump on Thursday.",
    "link": "https://www.newsweek.com/dont-ever-challenge-president-johnson-warns-friend-musk-2082086",
    "timestamp": "2025-06-06T17:24:57Z"
  },
  {
    "title": "More Bad News For Tesla Amid Musk-Trump Spat: Goldman Forecasts Worst-Ever Quarterly Delivery Growth",
    "description": "Elon Musk has alienated “multiple sides of the political spectrum” from Tesla, according to one prominent Wall Street analyst.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/06/06/more-bad-news-for-tesla-amid-musk-trump-spat-goldman-forecasts-worst-ever-quarterly-delivery-growth/",
    "timestamp": "2025-06-06T17:24:42Z"
  },
  {
    "title": "Why These Analysts Are Still Bullish on Tesla Despite Musk-Trump Spat",
    "description": "In This Article:\nKey Takeaways\n-\nTesla CEO Elon Musk and President Donald Trump's public spat rattled Tesla shares this week, but several Wall Street analysts said they're still bullish on the stock.\n-\nAnalysts from Wedbush and Morgan Stanley said their long-…",
    "link": "https://biztoc.com/x/da54222170b13aae",
    "timestamp": "2025-06-06T17:24:34Z"
  },
  {
    "title": "Judge Blocks Trump Visa Ban Targeting Harvard’s International Students",
    "description": "A federal judge has temporarily halted President Donald Trump’s proclamation suspending new international student visas at Harvard, hours after the university filed an amended lawsuit challenging the move. \nUS District Judge Allison Burroughs issued the restr…",
    "link": "https://biztoc.com/x/18128888fa80c31c",
    "timestamp": "2025-06-06T17:24:24Z"
  },
  {
    "title": "Trump considers getting rid of his Tesla on heels of Elon Musk feud",
    "description": "President Donald Trump is the latest Tesla owner to think about getting rid of his car after souring on Elon Musk.\nTrump is considering selling, or even giving away, the Tesla he bought in March, a senior White House official told NBC News, a day after the pr…",
    "link": "https://biztoc.com/x/c0f7aec26db355da",
    "timestamp": "2025-06-06T17:24:23Z"
  },
  {
    "title": "Musk and Trump take slap fight public as bromance ends",
    "description": "They're fighting like cats and DOGEs\nFire up those popcorn makers. The bromance between tech mogul Elon Musk and US President Donald Trump has come to an ignominious end as the billionaires feud on their respective social media platforms.…",
    "link": "https://biztoc.com/x/c8179e13a39157a7",
    "timestamp": "2025-06-06T17:24:14Z"
  },
  {
    "title": "Help! I, Vladimir Putin, Cannot Choose Between Elon Musk And Donald Trump!",
    "description": "It's always tough to be stuck between two friends breaking up.",
    "link": "https://www.wonkette.com/p/help-i-vladimir-putin-cannot-choose",
    "timestamp": "2025-06-06T17:23:08Z"
  },
  {
    "title": "Stop Posting, and Start Legislating—A Message to the GOP from Gen Z | Opinion",
    "description": "If the GOP wastes another Trump term, it won't just be a policy failure—it'll be a generational betrayal.",
    "link": "https://www.newsweek.com/stop-posting-start-legislating-message-gop-gen-z-opinion-2082082",
    "timestamp": "2025-06-06T17:22:51Z"
  },
  {
    "title": "Trump administration greenlights massive coal operation",
    "description": "Decision called 'long-awaited victory'",
    "link": "https://www.wnd.com/2025/06/trump-administration-greenlights-massive-coal-operation/",
    "timestamp": "2025-06-06T17:22:07Z"
  },
  {
    "title": "Musk–Trump Feud Can’t Save Starlink’s $100M Ontario Deal: Ford",
    "description": "Elon Musk and President Donald Trump may be feuding in an ugly public spat, but that won’t be enough to bring Starlink back to Ontario. On Thursday, Ontario Premier Doug Ford confirmed that the province has no plans to restart a previously cancelled $100 mill…",
    "link": "https://www.iphoneincanada.ca/2025/06/06/starlink-ontario-deal-dead-musk-trump-feud/",
    "timestamp": "2025-06-06T17:21:49Z"
  },
  {
    "title": "As Trump Threatens Columbia's Accreditation, the School Should Stop Trying To Placate Him",
    "description": "Education Secretary Linda McMahon said the school’s handling of campus antisemitism violated civil rights law and is grounds for revoking accreditation.",
    "link": "https://reason.com/2025/06/06/as-trump-threatens-columbias-accreditation-the-school-should-stop-trying-to-placate-him/",
    "timestamp": "2025-06-06T17:21:41Z"
  },
  {
    "title": "Late-Night Hosts React to Trump and Musk’s Messy Breakup",
    "description": "Days like yesterday remind us what late-night TV is for. Here’s how all the shows reacted to the news of Trump and Musk’s bitter divorce: ‘It’s like coming down the stairs on Christmas morning and finding a second tree.’",
    "link": "http://www.vulture.com/article/elon-musk-donald-trump-breakup-late-night-reactions.html",
    "timestamp": "2025-06-06T17:21:17Z"
  },
  {
    "title": "Behind the scenes of Trump's 'iconic' McDonald's visit before election victory",
    "description": "Donald Trump's iconic moment working as a McDonald's fry cook is featured in Fox Nation's new series 'Art of the Surge,' chronicling the final month of his 2024 campaign.",
    "link": "https://www.foxnews.com/media/behind-scenes-trumps-iconic-mcdonalds-visit-before-election-victory",
    "timestamp": "2025-06-06T17:20:58Z"
  },
  {
    "title": "Elon Musk pulls back on threat to withdraw Dragon spacecraft",
    "description": "As President Donald Trump and Elon Musk argued on social media on Thursday, the world’s richest man threatened to decommission a space capsule used to take astronauts and supplies to the International Space Station. A few hours later, Musk said he wouldn’t fo…",
    "link": "https://financialpost.com/pmn/elon-musk-pulls-back-on-threat-to-withdraw-dragon-spacecraft",
    "timestamp": "2025-06-06T17:20:39Z"
  },
  {
    "title": "Ex-Trump Aide-Turned-Fox News Host Gushes Over Trump Taking the ‘High Road’ in Musk Feud",
    "description": "Former White House press secretary and current Fox News host Kayleigh McEnany lauded her ex-boss for \"taking the high road\" in his monumental feud with Elon Musk.\nThe post Ex-Trump Aide-Turned-Fox News Host Gushes Over Trump Taking the ‘High Road’ in Musk Feu…",
    "link": "https://www.mediaite.com/media/news/ex-trump-aide-turned-fox-news-host-gushes-over-trump-taking-the-high-road-in-musk-feud/",
    "timestamp": "2025-06-06T17:19:50Z"
  },
  {
    "title": "Musk and Trump take slap fight public as bromance ends",
    "description": "They're fighting like cats and DOGEs Fire up those popcorn makers. The bromance between tech mogul Elon Musk and US President Donald Trump has come to an ignominious end as the billionaires feud on their respective social media platforms.…",
    "link": "https://www.theregister.com/2025/06/06/musk_trump_feud/",
    "timestamp": "2025-06-06T17:19:32Z"
  },
  {
    "title": "What does the Trump-Musk feud mean for Tesla stock? Experts weigh in.",
    "description": "Tesla stock plunged as acrimony erupted, but shares have recovered some losses.",
    "link": "https://abcnews.go.com/Business/trump-musk-feud-tesla-stock-experts-weigh/story?id=122569012",
    "timestamp": "2025-06-06T17:19:12Z"
  },
  {
    "title": "Mediation between two unequals not possible: Shashi Tharoor on Trump's claims",
    "description": "Shashi Tharoor refuted the possibility of mediating between India and Pakistan, emphasizing the lack of equivalence between a democracy and a state harboring terrorism. He addressed Trump's claims of settling tensions, suggesting the US likely influenced Paki…",
    "link": "https://economictimes.indiatimes.com/news/india/mediation-between-two-unequals-not-possible-shashi-tharoor-on-trumps-claims/articleshow/121681277.cms",
    "timestamp": "2025-06-06T17:18:41Z"
  },
  {
    "title": "Russia, China smiling as Elon Musk-Donald Trump feud threatens U.S. space program",
    "description": "Elon Musk and Donald Trump fought online. Trump said he might cut Musk’s space deals, so Musk said he’d stop using a key space capsule. Later, he changed his mind. That capsule is super important because NASA uses it to send people and supplies to space and t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-china-smiling-as-elon-musk-donald-trump-feud-threatens-u-s-space-program/articleshow/121681124.cms",
    "timestamp": "2025-06-06T17:17:21Z"
  },
  {
    "title": "Trump considers getting rid of his Tesla on heels of Elon Musk feud",
    "description": "President Trump bought the EV to show support for the Tesla CEO Musk, who was catching  flak for his work on DOGE for the Republican's administration.",
    "link": "https://www.cnbc.com/2025/06/06/trump-tesla-musk-feud.html",
    "timestamp": "2025-06-06T17:15:44Z"
  },
  {
    "title": "Ramos about-face on Cuomo draws immediate scorn from progressives she once championed",
    "description": "New York state Sen. Jessica Ramos hugs former Gov. Andrew Cuomo at a New York City mayoral debate on June 4, 2025.\n \n\nState Sen. Jessica Ramos had sharply criticized former Gov. Andrew Cuomo for his record in office up until this week. [ more › ]",
    "link": "https://gothamist.com/news/andrew-cuomo-endorsed-by-opponent-jessica-ramos-in-nyc-mayoral-race-about-face",
    "timestamp": "2025-06-06T17:15:00Z"
  },
  {
    "title": "Elon Musk receives olive branch of shifting business empire base to Europe amidst feud with Donald Trump",
    "description": "Elon Musk has been a frequent critic of the 27-nation EU -- attacking its digital laws as censorship and berating its leaders, while cheering on the ascendant far-right in Germany and elsewhere.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-receives-olive-branch-of-shifting-business-empire-base-to-europe-amidst-feud-with-donald-trump/articleshow/121681217.cms",
    "timestamp": "2025-06-06T17:14:51Z"
  },
  {
    "title": "Epstein List Release: When Will the Files Become Public?",
    "description": "Public pressure is mounting to unseal the remaining Epstein files. Find out when more names could be revealed.",
    "link": "https://hollywoodlife.com/2025/06/06/epstein-list-release/",
    "timestamp": "2025-06-06T17:13:32Z"
  },
  {
    "title": "What’s behind Trump’s call for ‘a full point’ interest-rate cut?",
    "description": "President Donald Trump on Friday pressed Federal Reserve Chair Jerome Powell for a full-point interest-rate cut, saying the central bank’s monetary policy was a “disaster.”",
    "link": "https://biztoc.com/x/738f9feff43d45ea",
    "timestamp": "2025-06-06T17:13:28Z"
  },
  {
    "title": "Betting Markets Preview Possible Next Escalation In Musk-Trump Feud",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nBetting markets are already predicting what the next developments could be in the new feud between President Donald Trump and Elon Musk.\nNewsweek reached out to the White House and Musk through Tesla for comme…",
    "link": "https://biztoc.com/x/b3a844156322b248",
    "timestamp": "2025-06-06T17:13:23Z"
  },
  {
    "title": "Tesla shares recover some losses as Musk-Trump conflict eases",
    "description": "(Bloomberg/Richard Clough) — Tesla Inc.’s shares rose in early trading Friday after Elon Musk suggested he was open to making amends with President Donald Trump, easing tensions after their simmering feud erupted into a public war of words a day earlier.\nThe …",
    "link": "https://biztoc.com/x/42df49ece7fa0549",
    "timestamp": "2025-06-06T17:13:12Z"
  },
  {
    "title": "Musk says Trump is in the 'Epstein files.' Here's where the president has shown up in unsealed records",
    "description": "Jeffrey Epstein and Donald Trump at a party at Mar-a-Lago in 1997.\nDavidoff Studios/Getty Images\nElon Musk says the \"Epstein files\" haven't been released because Trump is in them.\nThe president's name has cropped up repeatedly in Epstein-related court documen…",
    "link": "https://biztoc.com/x/33e9653531e53887",
    "timestamp": "2025-06-06T17:13:06Z"
  },
  {
    "title": "Paramount controlling shareholder Shari Redstone diagnosed with thyroid cancer",
    "description": "Shari Redstone continues professional activities despite thyroid cancer treatment, as she works toward resolving the Trump lawsuit against CBS and finalizing Paramount's merger with Skydance Media.",
    "link": "https://www.foxnews.com/media/paramount-controlling-shareholder-shari-redstone-diagnosed-thyroid-cancer",
    "timestamp": "2025-06-06T17:12:31Z"
  },
  {
    "title": "‘Not What You Wanted to See’: Fox Host Presses Trump Labor Secretary on Jobs Report",
    "description": "Stuart Varney pressed Lori Chavez-DeRemer on why manufacturing jobs fell in the latest jobs report despite Trump's aggressive push to create more.\nThe post ‘Not What You Wanted to See’: Fox Host Presses Trump Labor Secretary on Jobs Report first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/not-what-you-wanted-to-see-fox-host-presses-trump-labor-secretary-on-jobs-report/",
    "timestamp": "2025-06-06T17:11:01Z"
  },
  {
    "title": "Trump Could Use Sacred Native Land for a Monument to… Columbus",
    "description": "Trump’s plan for a national statue garden could get built on sacred Native land currently held by a wealthy South Dakota mining family.\nThe post Trump Could Use Sacred Native Land for a Monument to… Columbus appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/06/trump-south-dakota-native-land-statue-garden/",
    "timestamp": "2025-06-06T17:08:59Z"
  },
  {
    "title": "Surprise: The Government Is “Scrambling” to Rehire Workers Fired by DOGE",
    "description": "“Notice of Reduction in Force (RIF) issued to you…is officially RESCINDED [and] you will not be separated from employment,” read one absurdly euphemistic email.",
    "link": "https://www.vanityfair.com/news/story/government-is-scrambling-to-rehire-workers-fired-by-doge",
    "timestamp": "2025-06-06T17:08:24Z"
  },
  {
    "title": "Meghan McCain Tried To Become a Wellness Grifter (It Didn't Go Well)",
    "description": "Like her \"Maverick\" father whose name escapes me at the moment -- it's been a while since she sonic boomed her lineage into Joy Behar's skull -- Meghan McCain has a long documented history of portraying herself as one of...\nRead more...",
    "link": "https://www.pajiba.com/news/meghan-mccain-tried-to-become-a-wellness-grifter-it-didnt-go-well.php",
    "timestamp": "2025-06-06T17:08:14Z"
  },
  {
    "title": "The Sublime Spectacle of Donald Trump and Elon Musk’s Social-Media Slap Fight",
    "description": "Jessica Winter on the online fracas between the President and the tech mogul, which has devolved into petty jabs on the platforms they own, X and Truth Social.",
    "link": "https://www.newyorker.com/news/the-lede/the-sublime-spectacle-of-donald-trump-and-elon-musks-social-media-slap-fight",
    "timestamp": "2025-06-06T17:07:43Z"
  },
  {
    "title": "Donald Trump and Elon Musk’s Big, Beautiful Blow-Up Could Tank the Megabill",
    "description": "The acrimony between the president and his former adviser is further complicating the Senate's prospects of passing Trump's signature legislation—and causing trouble in MAGA paradise.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-and-elon-musks-big-beautiful-blow-up-could-tank-the-megabill",
    "timestamp": "2025-06-06T17:04:58Z"
  },
  {
    "title": "Anthropic's new AI models for classified info are already in use by US gov",
    "description": "The release follows a broader trend of increased ties between AI companies and the US government amidst uncertain AI policy.",
    "link": "https://www.zdnet.com/article/anthropics-new-ai-models-for-classified-info-are-already-in-use-by-us-gov/",
    "timestamp": "2025-06-06T17:04:43Z"
  },
  {
    "title": "Gemini confidentially files for US IPO as crypto markets heat up",
    "description": "Gemini, a crypto exchange run by billionaire twins Tyler and Cameron Winklevoss, on Friday disclosed it had confidentially filed for a U.S. initial public offering, as digital asset firms seize on renewed market momentum.Several high-profile companies, includ…",
    "link": "https://www.channelnewsasia.com/business/gemini-confidentially-files-us-ipo-crypto-markets-heat-up-5169511",
    "timestamp": "2025-06-06T17:04:33Z"
  },
  {
    "title": "Crypto exchange Gemini confidentially files for US IPO",
    "description": "Crypto exchange Gemini said on Friday it had confidentially filed for a U.S. initial public offering, as digital asset companies move to tap into renewed investor risk appetite amid improving market conditions.Several high-profile companies, including those i…",
    "link": "https://www.channelnewsasia.com/business/crypto-exchange-gemini-confidentially-files-us-ipo-5169511",
    "timestamp": "2025-06-06T17:04:33Z"
  },
  {
    "title": "The Trump-Musk feud is painfully awkward for the GOP",
    "description": "With Trump and Musk at odds, the time to choose a side could be approaching. But Republicans aren't all that eager to choose.",
    "link": "https://www.businessinsider.com/trump-musk-feud-republican-lawmaker-reaction-2025-6",
    "timestamp": "2025-06-06T17:04:09Z"
  },
  {
    "title": "Team Trump’s new ‘patriotism’ tests for federal job-seekers shouldn’t fly under the radar",
    "description": "According to legal scholars, the White House's new strategy of recruiting “patriotic Americans” is \"reminiscent of the loyalty oaths of the McCarthy era.\"",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trumps-new-patriotism-tests-federal-job-seekers-shouldnt-fly-rada-rcna211460",
    "timestamp": "2025-06-06T17:03:19Z"
  },
  {
    "title": "Gingrich on Trump-Musk Feud: 'This Is the Soap Opera Phase of American Politics'",
    "description": "Thursday on Fox News Channel's \"Jesse Watters Primetime,\" former House Speaker Newt Gingrich reacted to the ongoing dust-up between Donald Trump and Elon Musk.\nThe post Gingrich on Trump-Musk Feud: ‘This Is the Soap Opera Phase of American Politics’ appeared …",
    "link": "https://www.breitbart.com/clips/2025/06/06/gingrich-on-trump-musk-feud-this-is-the-soap-opera-phase-of-american-politics/",
    "timestamp": "2025-06-06T17:03:08Z"
  },
  {
    "title": "Trump not interested in talking to Musk: 'Elon's totally lost it'",
    "description": "President Donald Trump told Fox News on Friday that he isn't interested in talking to SpaceX and Tesla CEO Elon Musk, adding that “Elon's totally lost it.\"",
    "link": "https://www.foxnews.com/politics/trump-not-interested-talking-musk-elons-totally-lost-it",
    "timestamp": "2025-06-06T17:02:53Z"
  },
  {
    "title": "As World Pride flows straight into the military parade, DC officials say they're ready for anything",
    "description": "Officials in the nation’s capital generally express full confidence in their ability to handle large, complicated events and huge crowds",
    "link": "https://abcnews.go.com/US/wireStory/world-pride-flows-straight-military-parade-dc-officials-122581806",
    "timestamp": "2025-06-06T17:02:24Z"
  },
  {
    "title": "7 Reasons Not to Trust Elon Musk over Donald Trump",
    "description": "Elon Musk threw an incredible tantrum aimed at President Donald Trump on Thursday. In attacks ranging from taking credit for Trump's election to accusing Trump of being a pedophile, Musk thoroughly burned his bridges with the MAGA movement. But there are many…",
    "link": "https://www.breitbart.com/tech/2025/06/06/7-reasons-not-to-trust-elon-musk-over-donald-trump/",
    "timestamp": "2025-06-06T17:02:17Z"
  },
  {
    "title": "House Dems Get Bonus Hearing on Crypto Market Structure, Assail Trump Conflicts",
    "description": "WASHINGTON, D.C. — U.S. President Donald Trump's crypto ventures were once again under the microscope during a House Financial Services Committee hearing that otherwise saw legal experts express worries about how regulators might police digital assets under a…",
    "link": "https://biztoc.com/x/e0e9078751380684",
    "timestamp": "2025-06-06T17:02:07Z"
  },
  {
    "title": "Jeffries: Trump-Musk feud 'opportunity' to 'kill' GOP bill",
    "description": "United States House Minority Leader Hakeem Jeffries said on Friday that he considers the dispute between US President Donald Trump and billionaire Elon Musk as an \"opportunity\" to \"kill\" the Trump-bac...",
    "link": "https://biztoc.com/x/f1e9d9fa56c64127",
    "timestamp": "2025-06-06T17:02:02Z"
  },
  {
    "title": "Trump aides signal he’s moving on from Musk feud, but may get rid of his Tesla",
    "description": "The White House is signaling that President Donald Trump intends to move on from his acrimonious fallout with billionaire Elon Musk, focusing on securing passage of his signature tax and spending bill and other economic policies.\nAfter Thursday’s blow-up, in …",
    "link": "https://biztoc.com/x/bd088b0af3c7e21c",
    "timestamp": "2025-06-06T17:02:00Z"
  },
  {
    "title": "Deadly Russian bombardment of Ukraine further dampens hopes for peace",
    "description": "The attack Friday killed at least four people and injured about 50 others.",
    "link": "https://www.bostonherald.com/2025/06/06/russia-ukraine-war-peace-chances/",
    "timestamp": "2025-06-06T17:01:57Z"
  },
  {
    "title": "Betting Markets Preview Possible Next Escalation In Musk-Trump Feud",
    "description": "Betting market traders are already weighing in on what could happen next in the feud between President Donald Trump and Elon Musk.",
    "link": "https://www.newsweek.com/betting-markets-preview-possible-escalation-musk-trump-feud-2082072",
    "timestamp": "2025-06-06T17:01:50Z"
  },
  {
    "title": "Musk says Trump is in the 'Epstein files.' Here's where the president has shown up in unsealed records.",
    "description": "The many Jeffrey Epstein-related documents that have already been released do not implicate Donald Trump in any sex-trafficking.",
    "link": "https://www.businessinsider.com/elon-musk-trump-epstein-files-2025-6",
    "timestamp": "2025-06-06T17:01:32Z"
  },
  {
    "title": "6/6: CBS Mornings Plus",
    "description": "After once expressing strong support for former President Donald Trump, Elon Musk is now lashing out with personal insults, marking a sharp turn in their public relationship. Also, the Tribeca Festival’s billion-dollar impact and the films to watch this year.",
    "link": "https://www.cbsnews.com/video/060625-cbs-mornings-plus/",
    "timestamp": "2025-06-06T17:01:04Z"
  },
  {
    "title": "FOX STRUGGLES WITH BREAKUP...",
    "description": "The pair’s most powerful media allies at Fox News — the most-watched cable news network on the planet, often viewed as a clearinghouse for the MAGA agenda — seemed to have a little difficulty with the breakup.",
    "link": "https://www.cnn.com/2025/06/06/media/fox-news-trump-musk",
    "timestamp": "2025-06-06T17:00:03Z"
  },
  {
    "title": "TRUMP DUMPS HIS TESLA",
    "description": "DONALD Trump has squashed any hopes of reconciling with Elon Musk after the pair was said to plan a “peace call” as he reportedly vowed to get rid of his Tesla. The world has been watch…",
    "link": "https://www.the-sun.com/news/14411257/trump-musk-feud-peace-talks/",
    "timestamp": "2025-06-06T17:00:03Z"
  },
  {
    "title": "After the Deluge: An Uneasy Pause in the Trump–Musk Standoff",
    "description": "\"I support @realDonaldTrump and @elonmusk and they should make peace for the benefit of our great country. We are much stronger together than apart.\"\nThe post After the Deluge: An Uneasy Pause in the Trump–Musk Standoff first appeared on Le·gal In·sur·rec·tio…",
    "link": "https://legalinsurrection.com/2025/06/after-the-deluge-an-uneasy-pause-in-the-trump-musk-standoff/",
    "timestamp": "2025-06-06T17:00:02Z"
  },
  {
    "title": "Letters: Phil Goff’s art of saying nothing; Parliament shame; bottom trawling destructive",
    "description": "OPINION: Plus the expected debacle over the Treaty Principles Bill surprises no one.",
    "link": "https://www.nzherald.co.nz/nz/letters-phil-goffs-art-of-saying-nothing-parliament-shame-bottom-trawling-destructive/IBPHNBSVLFGETPQFOXEBIDHDXA/",
    "timestamp": "2025-06-06T17:00:00Z"
  },
  {
    "title": "33 of the funniest memes about Elon Musk and Donald Trump’s messy breakup",
    "description": "Elon Musk and President Donald Trump have very publicly and dramatically parted ways. Naturally, the internet turned the whole saga into meme gold. What once looked like a billionaire bromance has now devolved into digital daggers and vague subtweets, and mem…",
    "link": "https://www.dailydot.com/memes/elon-musk-donald-trump-breakup-memes/",
    "timestamp": "2025-06-06T17:00:00Z"
  },
  {
    "title": "If ‘Quiet Skies’ Surveillance Was Abuse, So Is The Rest Of The Surveillance State",
    "description": "Department of Homeland Security Secretary Kristi Noem announced Thursday that the “Quiet Skies” surveillance program was dismantled. It’s a good first step — but it’s just that: a first step. It’s time to dismantle the entire surveillance regime that grew out…",
    "link": "https://thefederalist.com/2025/06/06/if-quiet-skies-surveillance-was-abuse-so-is-the-rest-of-the-surveillance-state/",
    "timestamp": "2025-06-06T16:57:45Z"
  },
  {
    "title": "Jake Paul Speaks Out on The Open Fire Between Donald Trump and Elon Musk",
    "description": "Jake Paul, the 28-year-old boxer and big Donald Trump supporter, has spoken out about the ongoing fight between Trump and Elon Musk. Both are very famous and important men: Trump i",
    "link": "https://www.marca.com/en/boxing/2025/06/06/68431dc622601d39428b45e4.html",
    "timestamp": "2025-06-06T16:57:01Z"
  },
  {
    "title": "Trump's Bold Bitcoin Bet: DJT Launches ETF to Take on Wall Street Giants",
    "description": "As crypto surges past $100K, Trump Media dives headfirst into the ETF battlefield--late, loud, and loaded.",
    "link": "https://finance.yahoo.com/news/trumps-bold-bitcoin-bet-djt-165607859.html",
    "timestamp": "2025-06-06T16:56:07Z"
  },
  {
    "title": "China issues rare six-month valid earth licenses to suppliers of top US automakers amid global trade tensions",
    "description": "China's decision in April to restrict exports of a wide range of rare earths and related magnets has tripped up the supply chains central to automakers, aerospace manufacturers, semiconductor companies and military contractors around the world.",
    "link": "https://www.livemint.com/industry/manufacturing/china-issues-rare-six-month-valid-earth-licenses-to-suppliers-of-top-us-automakers-amid-global-trade-tensions-11749228732241.html",
    "timestamp": "2025-06-06T16:55:38Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of May 31: Poles go to the polls, the Dutch government collapses, and an earthquake rocks Pakistan.",
    "link": "http://foreignpolicy.com/2025/06/06/foreign-policy-news-quiz-poland-election-dutch-government-collapse-pakistan-earthquake/",
    "timestamp": "2025-06-06T16:54:47Z"
  },
  {
    "title": "Why These Analysts Are Still Bullish on Tesla Despite Musk-Trump Spat",
    "description": "Tesla CEO Elon Musk and President Donald Trump's public spat has rattled Tesla's stock, but several Wall Street analysts said they're still bullish on the...",
    "link": "https://www.investopedia.com/why-these-analysts-are-still-bullish-on-tesla-despite-musk-trump-spat-11749670",
    "timestamp": "2025-06-06T16:54:36Z"
  },
  {
    "title": "Big brands are pulling back on Pride merchandise and events this year",
    "description": "New York CNN — For the last several years, Pride Month was a splashy marketing event for big brands. Stores adorned windows with rainbow flags, displayed LGBTQ-themed t-shirts and coffee mugs at their entrances, changed their logos on social media accounts, a…",
    "link": "https://freerepublic.com/focus/f-chat/4321383/posts",
    "timestamp": "2025-06-06T16:54:34Z"
  },
  {
    "title": "Maine House Votes to Withdraw from National Popular Vote Compact",
    "description": "Maine could be the first state to withdraw from the compact aimed at abolishing the Electoral College. In a stunning reversal of last year's misguided attempt to overthrow the Electoral College, Maine’s House of Representatives recently voted to withdraw the …",
    "link": "https://freerepublic.com/focus/f-news/4321382/posts",
    "timestamp": "2025-06-06T16:54:33Z"
  },
  {
    "title": "Savannah Guthrie mocks Elon Musk and Donald Trump’s feud, says it’s ‘giving 7th-grade girl’",
    "description": "Relationship between the president and his former billionaire ally appears to have imploded",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/savannah-guthrie-elon-musk-donald-trump-b2765227.html",
    "timestamp": "2025-06-06T16:53:31Z"
  },
  {
    "title": "California Democrats Take Another Shot At Subverting Trump’s Immigration Agenda",
    "description": "California Democrats are pushing through legislation that would make it incredibly more difficult for federal immigration authorities to operate in the state.",
    "link": "https://dailycaller.com/2025/06/06/california-dems-to-restrict-ice-arrests/",
    "timestamp": "2025-06-06T16:52:24Z"
  },
  {
    "title": "Transgender troops face a deadline and a difficult decision: Stay or go?",
    "description": "As transgender service members face a deadline to leave the U.S. military, hundreds are taking the financial bonus to depart voluntarily. But others say they will stay and fight.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/transgender-troops-face-deadline-difficult-decision-stay-go-rcna211468",
    "timestamp": "2025-06-06T16:49:26Z"
  },
  {
    "title": "Trump’s Golf Club Flagged For Health Violations, Lowest Grade In The County",
    "description": "Donald Trump’s New Jersey golf club in Bedminster, N.J., received a shocking 32 out of 100 health inspection score in May, the lowest grade in Somerset County, according to a Forbes report that cited public documents. \nThe appalling grade happened after the c…",
    "link": "https://crooksandliars.com/2025/06/trump-s-golf-club-flagged-health",
    "timestamp": "2025-06-06T16:49:06Z"
  },
  {
    "title": "Vivian Wilson Channels Patti LuPone During Elon Musk's Fight with Trump for the Crossover Event of the Season",
    "description": "The model seems to have taken a cue from LuPone, who is in hot water with the Broadway community after a recent interview, to make a no-comment comment about the hissyfit of a century playing out on social media.",
    "link": "https://www.vanityfair.com/style/story/vivian-wilson-elon-musk-trump-catfight-reaction",
    "timestamp": "2025-06-06T16:46:54Z"
  },
  {
    "title": "Trump Changes Top Middle East General For Strong Iran Hawk",
    "description": "Navy Admiral Brad Cooper's nomination highlights a shift in strategy over an army appointment",
    "link": "https://www.newsweek.com/trump-changes-top-middle-east-general-strong-iran-hawk-2081796",
    "timestamp": "2025-06-06T16:46:22Z"
  },
  {
    "title": "Has Bitcoin been captured by politics and institutions?",
    "description": "Bitcoin 2025 brought politicians, corporate treasuries, and crypto OGs together in Las Vegas. Cointelegraph investigates whether Bitcoin is being captured by institutions—or stepping into its global role.",
    "link": "https://cointelegraph.com/news/has-bitcoin-been-captured-by-politics-institutions",
    "timestamp": "2025-06-06T16:45:17Z"
  },
  {
    "title": "Missouri mom whose detention rocked a small MAGA town has been released",
    "description": "Ming Li Hui, known as Carol, has been released from immigration custody after her detention rocked Kennett, Missouri, which voted overwhelmingly for Trump.",
    "link": "https://www.msnbc.com/top-stories/latest/ming-li-hui-carol-missouri-immigration-released-trump-rcna211449",
    "timestamp": "2025-06-06T16:45:06Z"
  },
  {
    "title": "Tesla Stock Plummeted After Elon’s Feud With Trump. The Amount Reveals Something Important.",
    "description": "How much is it worth to have oligarchic control of the United States government? We now have an idea.",
    "link": "https://slate.com/business/2025/06/elon-musk-donald-trump-feud-stock-tesla-cost.html",
    "timestamp": "2025-06-06T16:44:37Z"
  },
  {
    "title": "ICE Detained US Marshal Who Matched the 'General Description' of Person of Interest Inside Arizona Immigration Court",
    "description": "ICE agents detained a deputy U.S. marshal inside the home of Arizona's immigration court after they matched the \"general description\" of a person of interest.",
    "link": "https://www.ibtimes.com/ice-detained-us-marshal-who-matched-general-description-person-interest-inside-arizona-3775239",
    "timestamp": "2025-06-06T16:43:11Z"
  },
  {
    "title": "Billion-dollar battery plant pauses construction amid electric vehicle and tariff uncertainty",
    "description": "The factory in South Carolina would help make batteries for electric BMWs.",
    "link": "https://www.bostonherald.com/2025/06/06/battery-plant-construction-halted/",
    "timestamp": "2025-06-06T16:41:54Z"
  },
  {
    "title": "Musk’s Torching of Trump Won’t Help Tesla",
    "description": "",
    "link": "https://biztoc.com/x/2339fb8bb354fc3a",
    "timestamp": "2025-06-06T16:39:53Z"
  },
  {
    "title": "Trump has Tesla painted into a corner",
    "description": "When it comes to US President Donald Trump, Tesla CEO Elon Musk just can’t catch a break.\nThe high-profile implosion on Thursday of what had until recently been a cozy friendship between the two sent Tesla’s stock price plummeting, shaving $152 billion off it…",
    "link": "https://biztoc.com/x/9d3a33d7e208c0a7",
    "timestamp": "2025-06-06T16:39:37Z"
  },
  {
    "title": "The 1600: Mutually Assured Destruction",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-mutually-assured-destruction-2082069",
    "timestamp": "2025-06-06T16:39:03Z"
  },
  {
    "title": "Trump's Pentagon keeps sending destroyers that fought in the Red Sea to the US southern border — a fourth one is on its way",
    "description": "The Arleigh Burke-class destroyer USS Cole is the latest warship to go from the US Navy's counter-Houthi mission to America's backyard.",
    "link": "https://www.businessinsider.com/navy-sends-more-destroyers-us-mexico-border-red-sea-fight-2025-6",
    "timestamp": "2025-06-06T16:37:49Z"
  },
  {
    "title": "Egos, power, and revenge: 8 ways the Musk-Trump war could escalate into a clash that rocks America",
    "description": "Elon Musk and Donald Trump are now in a big fight. Musk may stop helping Trump and start attacking him online. Trump could hit back by cutting off Musk’s business deals and pushing for investigations.",
    "link": "https://economictimes.indiatimes.com/news/international/us/egos-power-and-revenge-8-ways-the-musk-trump-war-could-escalate-into-a-clash-that-rocks-america/articleshow/121680497.cms",
    "timestamp": "2025-06-06T16:37:46Z"
  },
  {
    "title": "House Dems Get Bonus Hearing on Crypto Market Structure, Assail Trump Conflicts",
    "description": "Maxine Waters, the top Democrat on the House Financial Services Committee, pressured an additional hearing on the crypto market structure bill.",
    "link": "https://www.coindesk.com/policy/2025/06/06/house-dems-get-bonus-hearing-on-crypto-market-structure-assail-trump-conflicts",
    "timestamp": "2025-06-06T16:33:10Z"
  },
  {
    "title": "Trump’s attack on the BBC is part of an endless campaign to undermine public trust in information",
    "description": "Recent comments from the White House suggest that a campaign to undermine public trust in the media is not going away.",
    "link": "https://theconversation.com/trumps-attack-on-the-bbc-is-part-of-an-endless-campaign-to-undermine-public-trust-in-information-258364",
    "timestamp": "2025-06-06T16:31:38Z"
  },
  {
    "title": "Transgender troops face a deadline and a difficult decision: Stay or go?",
    "description": "Defense Secretary Pete Hegseth says the changes are what America voted for.",
    "link": "https://www.bostonherald.com/2025/06/06/trump-transgender-military-ban-deadline/",
    "timestamp": "2025-06-06T16:30:47Z"
  },
  {
    "title": "Transgender troops face a deadline and a difficult decision: Stay or go?",
    "description": "Defense Secretary Pete Hegseth says the changes are what America voted for.",
    "link": "https://www.denverpost.com/2025/06/06/trump-transgender-military-ban-deadline/",
    "timestamp": "2025-06-06T16:30:47Z"
  },
  {
    "title": "Johnson tries to protect fate of megabill from Trump-Musk crossfire",
    "description": "Speaker Mike Johnson is working to keep the focus on the \"One Big Beautiful Bill Act\" as all eyes remain on Trump and Musk amid their bitter public feud.",
    "link": "https://abcnews.go.com/Politics/johnson-protect-fate-megabill-trump-musk-crossfire/story?id=122576030",
    "timestamp": "2025-06-06T16:30:32Z"
  },
  {
    "title": "Transgender troops face a deadline and a difficult decision: Stay or go?",
    "description": "As transgender service members face a deadline to leave the U.S. military, hundreds are taking the financial bonus to depart voluntarily",
    "link": "https://abcnews.go.com/US/wireStory/transgender-troops-face-deadline-difficult-decision-stay-122580396",
    "timestamp": "2025-06-06T16:30:24Z"
  },
  {
    "title": "The most volatile major currencies in 2025",
    "description": "OANDA reviews major currencies that have seen the most volatility since the beginning of 2025.",
    "link": "https://www.oanda.com/us-en/trade-tap-blog/analysis/technical/countries-seeing-most-currency-volatility-usd/",
    "timestamp": "2025-06-06T16:30:00Z"
  },
  {
    "title": "LIZ PEEK: Five critical takeaways from the epic Trump-Musk rumble",
    "description": "Trump and Musk's relationship deteriorated into a public spat over policy disagreements and influence within the administration, with long-term consequences.",
    "link": "https://www.foxnews.com/opinion/liz-peek-five-critical-takeaways-from-epic-trump-musk-rumble",
    "timestamp": "2025-06-06T16:29:03Z"
  },
  {
    "title": "Epstein Lawyer: No Dirt On Trump, Refutes Musk's Claim",
    "description": "Jeffrey Epstein’s former defense attorney David Schoen pushed back Thursday against Elon Musk’s explosive claim that President Donald Trump is named in unreleased Justice Department files related to the late financier. \nSchoen, who began representing Epstein …",
    "link": "https://biztoc.com/x/e5f0b281f6b5e37c",
    "timestamp": "2025-06-06T16:28:46Z"
  },
  {
    "title": "Tesla loses $152 billion in market cap after Musk-Trump spat in the stock’s biggest-ever hit",
    "description": "The tit-for-tat between Tesla CEO Elon Musk and President Donald Trump sent shares of the EV maker into free-fall Thursday in an epic stock plunge that wiped out tens of billions from Musk’s wealth.\nTesla shareholders went on a roller-coaster ride on Thursday…",
    "link": "https://biztoc.com/x/8d36e0acabeb63b8",
    "timestamp": "2025-06-06T16:28:42Z"
  },
  {
    "title": "Top Stock Movers Now: Tesla, Lululemon, Docusign, and More",
    "description": "In This Article:\nKey Takeaways\n-\nU.S. equities jumped at midday as the U.S. economy added more jobs in May than expected.\n-\nTesla shares rebounded from yesterday's big selloff as CEO Elon Musk and President Donald Trump seem to be pulling back on their war of…",
    "link": "https://biztoc.com/x/f4973379dc3115ed",
    "timestamp": "2025-06-06T16:28:35Z"
  },
  {
    "title": "Trump Urges Fed To Slash Interest Rates By A Full Point",
    "description": "President Donald Trump is calling on the Federal Reserve to aggressively cut interest rates, saying a full percentage point reduction is needed to boost the economy and lower borrowing costs. \n“‘Too Late’ at the Fed is a disaster!” Trump posted Tuesday on Tru…",
    "link": "https://biztoc.com/x/34ae5be3ad3db3c0",
    "timestamp": "2025-06-06T16:28:21Z"
  },
  {
    "title": "Rising NATO Ally Builds Its Own Aircraft Carrier",
    "description": "An ambitious defense expansion program is being carried out by Turkey, a strong U.S. ally but also Israel's regional rival",
    "link": "https://www.newsweek.com/rising-nato-ally-builds-its-own-aircraft-carrier-2081935",
    "timestamp": "2025-06-06T16:27:18Z"
  }
]