[
  {
    "title": "Trump's foreign aid freeze halted a crucial program fighting HIV in Africa. Here's what's at stake",
    "description": "The freeze on U.S. foreign aid ordered by President Donald Trump has effectively halted one of the world's most successful responses to a disease",
    "link": "https://abcnews.go.com/Health/wireStory/trumps-foreign-aid-freeze-halted-crucial-program-fighting-118969899",
    "timestamp": "2025-02-20T02:30:31Z"
  },
  {
    "title": "Frank Coughlan: It’s not a great leap to link US education neglect to support for the cult of Trump",
    "description": "Many of us are familiar with a telling early scene from Breaking Bad, that compulsively watchable drama that gave us one of modern TV’s most compelling and tragic characters. Walter White, a brilliant but disillusioned chemistry teacher in Albuquerque, New Me…",
    "link": "https://www.independent.ie/opinion/comment/frank-coughlan-its-not-a-great-leap-to-link-us-education-neglect-to-support-for-the-cult-of-trump/a1070132248.html",
    "timestamp": "2025-02-20T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Europe must assert its place in peace talks and stop Donald Trump from rewriting history",
    "description": "We were starting to think announcements from the Trump administration could no longer shock us, but then the US president comes out with the chilling claim that Ukraine started the war. As Tánaiste Simon Harris put it, such a conclusion is “revisionism on spe…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-europe-must-assert-its-place-in-peace-talks-and-stop-donald-trump-from-rewriting-history/a621659107.html",
    "timestamp": "2025-02-20T02:30:00Z"
  },
  {
    "title": "What we know about photo allegedly showing $300M worth of meds set to expire due to USAID cuts",
    "description": "In an X post, Sen. Chris Coons of Delaware said the drugs would have prevented people \"from going blind from a preventable tropical disease.\"",
    "link": "https://www.snopes.com//news/2025/02/20/photo-usaid-meds-300-million/",
    "timestamp": "2025-02-20T02:30:00Z"
  },
  {
    "title": "Letters: Backyard homes another way of serving up crumbs from the rich men’s table",
    "description": "The Government’s plans to ease rules for cabin homes reminds me of when I was a child (‘Plans to ease rules for ‘cabin homes’ in back gardens’, Irish Independent, February 19). Back then, my sister and I played in a small plastic house at the bottom of our ga…",
    "link": "https://www.independent.ie/opinion/letters/letters-backyard-homes-another-way-of-serving-up-crumbs-from-the-rich-mens-table/a1911039362.html",
    "timestamp": "2025-02-20T02:30:00Z"
  },
  {
    "title": "Five key moments in Donald Trump and Elon Musk’s joint interview on Fox News",
    "description": "Fox News has aired a joint television interview with US president Donald Trump and billionaire Elon Musk, who are causing outrage as they make sweeping cuts to the federal government.",
    "link": "https://www.independent.ie/opinion/analysis/five-key-moments-in-donald-trump-and-elon-musks-joint-interview-on-fox-news/a2092791934.html",
    "timestamp": "2025-02-20T02:30:00Z"
  },
  {
    "title": "\"Why Would One Be Afraid?\": Mexican President On Donald Trump's Threats",
    "description": "Mexican President Claudia Sheinbaum has said that she does not fear US President Donald Trump and his threats.",
    "link": "https://www.ndtv.com/world-news/mexican-president-claudia-sheinbaum-says-she-does-not-fear-donald-trumps-threats-7750774",
    "timestamp": "2025-02-20T02:26:21Z"
  },
  {
    "title": "Kmart and Bunnings’ parent company Wesfarmers posts first-half profit growth",
    "description": "Wesfarmers leadership say they are confident the New Zealand segment will perform.",
    "link": "https://www.nzherald.co.nz/business/companies/retail/kmart-and-bunnings-parent-company-wesfarmers-posts-first-half-profit-growth/R7VT6YX5GBCBLHX2IPNSVQWRRE/",
    "timestamp": "2025-02-20T02:24:01Z"
  },
  {
    "title": "'Explicitly a Nazi movement': Ex-NFL player arrested during city council protest",
    "description": "Police in Huntington Beach, California, arrested former Minnesota Vikings punter Chris Kluwe after he spoke out at a city council meeting to protest a library plaque that references President Donald Trump’s MAGA movement.Kluwe’s arrest came Tuesday after his …",
    "link": "https://www.rawstory.com/maga-protest/",
    "timestamp": "2025-02-20T02:22:56Z"
  },
  {
    "title": "Russian forces advance on Ukraine's critical minerals as Trump talks of a deal",
    "description": "The seizure of Kyiv's mineral wealth, while not the main war aim, is among Moscow's strategic goals, experts say.",
    "link": "https://www.japantimes.co.jp/news/2025/02/20/world/politics/russia-advance-ukraine-minerals/",
    "timestamp": "2025-02-20T02:22:00Z"
  },
  {
    "title": "Savannah Chrisley seeks Trump pardon for parents Todd and Julie Chrisley in tax evasion, bank fraud case",
    "description": "Savannah Chrisley revealed that she is planning to seek a pardon from President Donald Trump for her parents Todd and Julie Chrisley.",
    "link": "https://www.foxnews.com/entertainment/savannah-chrisley-seeks-trump-pardon-parents-todd-julie-chrisleys-tax-evasion-bank-fraud-case",
    "timestamp": "2025-02-20T02:21:14Z"
  },
  {
    "title": "Don Jr. Under Investigation for Alleged Illegal Duck Hunt in Italy",
    "description": "Donald Trump Jr. illegally hunted a protected duck during a trip to the Venice lagoon last December. Earlier this month, a local hunting lifestyle company called Field Ethos released a video online of Trump’s trip that showed him shooting waterfowl in a speci…",
    "link": "https://freerepublic.com/focus/f-chat/4298962/posts",
    "timestamp": "2025-02-20T02:20:11Z"
  },
  {
    "title": "Trump Plans To Impose New Tariffs \"Over Next Month\". What's On Target",
    "description": "US President Donald Trump is planning to announce tariffs on more products as he pushes to shrink America&#039;s trade deficits, boost domestic manufacturing and achieve other policy goals.",
    "link": "https://www.ndtv.com/world-news/donald-trump-plans-to-impose-new-tariffs-over-next-month-whats-on-target-7750812",
    "timestamp": "2025-02-20T02:19:22Z"
  },
  {
    "title": "Musk's Reaction To Woman Losing \"Dream Job\" In DOGE Cuts Sparks Discussion",
    "description": "A US woman who once praised the convenience of remote work has lost her job in the federal restructuring spearheaded by Elon Musk.",
    "link": "https://www.ndtv.com/feature/elon-musks-reaction-to-woman-losing-dream-job-in-doge-cuts-sparks-discussion-7750809",
    "timestamp": "2025-02-20T02:18:05Z"
  },
  {
    "title": "Appeals court leaves block on Trump’s birthright citizenship order in place, setting up Supreme Court showdown | CNN Politics",
    "description": "An appeals court will not allow the Trump administration to end birthright citizenship for certain children of immigrants, in a ruling that could propel the issue to the Supreme Court.",
    "link": "https://www.cnn.com/2025/02/19/politics/trump-cant-end-birthright-citizenship-appeals-court-says/index.html",
    "timestamp": "2025-02-20T02:16:35Z"
  },
  {
    "title": "CNBC Daily Open: The Fed might pause rates over Trump tariff concerns",
    "description": "The U.S. Federal Reserve held rates steady in January because of worries over tariffs. Stoking concerns, Trump announced more tariffs on Tuesday.",
    "link": "https://www.cnbc.com/2025/02/20/cnbc-daily-open-fed-is-concerned-over-tariffs-might-hold-rates.html",
    "timestamp": "2025-02-20T02:15:33Z"
  },
  {
    "title": "Labor unions call on Trump to boost US shipbuilding against increasing Chinese dominance",
    "description": "The heads of four major labor unions are calling on President Donald Trump to boost American shipbuilding and enforce tariffs and other “strong penalties” against China for its increasing dominance. The presidents of the United Steelworkers, International Bro…",
    "link": "https://www.seattlepi.com/business/article/labor-unions-call-on-trump-to-boost-us-20175924.php",
    "timestamp": "2025-02-20T02:14:05Z"
  },
  {
    "title": "New Social Security chief contradicts claims that millions of dead people are getting payouts",
    "description": "The new head of the Social Security Administration says deceased centenarians are “not necessarily receiving benefits.\" The comments Wednesday by acting commissioner Lee Dudek contradict claims by President Donald Trump and billionaire adviser Elon Musk that …",
    "link": "https://www.seattlepi.com/news/politics/article/new-social-security-chief-contradicts-claims-that-20175951.php",
    "timestamp": "2025-02-20T02:14:05Z"
  },
  {
    "title": "Trump and Musk say they like working together and will keep at it. Will it last?",
    "description": "It’s been a lingering question since the election: How long can a partnership between two billionaires who love being the center of attention last? In a joint Fox News Channel interview that aired Tuesday, Donald Trump and adviser Elon Musk Musk insisted they…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-and-musk-say-they-like-working-together-and-20176237.php",
    "timestamp": "2025-02-20T02:14:05Z"
  },
  {
    "title": "\"Trying To Get Somebody Else Elected\": Trump On $21 Million 'India Fund'",
    "description": "Donald Trump&#039;s remarks came days after the DOGE, led by Elon Musk, scrapped a $21 million grant intended to boost &quot;voter turnout&quot; in India.",
    "link": "https://www.ndtv.com/world-news/donald-trump-on-usaids-india-voter-turnout-after-elon-musk-doge-move-trying-to-get-somebody-else-elected-7750778",
    "timestamp": "2025-02-20T02:09:20Z"
  },
  {
    "title": "Donald Trump replicates Mexico’s campaign against fentanyl",
    "description": "Trump revealed that he will replicate an anti-fentanyl campaign like the one launched by President Claudia Sheinbaum in Mexico",
    "link": "https://www.merca20.com/donald-trump-replicates-mexicos-campaign-against-fentanyl/",
    "timestamp": "2025-02-20T02:09:06Z"
  },
  {
    "title": "U.S. to cut size of diplomatic mission in China by up to 10%: report",
    "description": "The United States is set to cut the size of its diplomatic mission in China by up to 10%, the South China Morning Post reported on Wednesday, citing people familiar with the situation. American diplomats working in mainland China and Hong Kong as well as loca…",
    "link": "https://japantoday.com/category/world/us-to-cut-size-of-diplomatic-mission-in-china-by-up-to-10-scmp-reports",
    "timestamp": "2025-02-20T02:08:29Z"
  },
  {
    "title": "Jake Tapper Says Trump’s Break From ‘Basic Decency’ by Blaming Ukraine for Russian War Mirrors Jan. 6 Denial | Video",
    "description": "The CNN anchor says the president sent \"shock waves throughout Europe\" after calling Zelensky a dictator Wednesday \nThe post Jake Tapper Says Trump’s Break From ‘Basic Decency’ by Blaming Ukraine for Russian War Mirrors Jan. 6 Denial | Video appeared first on…",
    "link": "https://www.thewrap.com/jake-tapper-donald-trump-ukraine-putin-zelensky-video/",
    "timestamp": "2025-02-20T02:04:25Z"
  },
  {
    "title": "Mexico issues legal threat to Google",
    "description": "Article URL: https://thecomeback.com/politics/mexico-legal-action-donald-trump-executive-order.html\nComments URL: https://news.ycombinator.com/item?id=43110226\nPoints: 78\n# Comments: 82",
    "link": "https://thecomeback.com/politics/mexico-legal-action-donald-trump-executive-order.html",
    "timestamp": "2025-02-20T02:03:29Z"
  },
  {
    "title": "Donald Trump just called Zelensky a dictator.",
    "description": "Human rights lawyer Bob Amsterdam has worked in Ukraine for the past couple of years and confirms that if anything, that’s an understatement.",
    "link": "https://freerepublic.com/focus/f-bloggers/4298960/posts",
    "timestamp": "2025-02-20T02:01:44Z"
  },
  {
    "title": "America Is Committing to Trump’s Iron Dome Project",
    "description": "The Iron Dome makes vital contributions to Israel’s security.\nThe post America Is Committing to Trump’s Iron Dome Project appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/america-is-committing-to-trumps-iron-dome-project/",
    "timestamp": "2025-02-20T01:59:08Z"
  },
  {
    "title": "Trump and Musk say they like working together and will keep at it. Will it last?",
    "description": "It’s been a lingering question since the election: How long can a partnership between two billionaires who love being the center of attention last",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-musk-working-118985258",
    "timestamp": "2025-02-20T01:57:57Z"
  },
  {
    "title": "Trump's Job Approval Rating at 45%; Congress' Jumps to 29% - news.gallup.com",
    "description": "Trump's Job Approval Rating at 45%; Congress' Jumps to 29%news.gallup.com Surprising new poll numbers released on Trump's performance so far in the White HouseFox News What’s keeping Trump popular?Vox.com Why Trump’s poll numbers are surprisingly highMSNBC Do…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176312341",
    "timestamp": "2025-02-20T01:52:57Z"
  },
  {
    "title": "Trump Media and Rumble sue Brazil Supreme Court justice in censorship row",
    "description": "Donald Trump’s media group and the video platform Rumble today filed a joint lawsuit against Brazilian Supreme Court Justice Alexandre de Moraes, accusing him of violating U.S. free speech protections. The suit, filed in a federal court in Tampa, Florida, cam…",
    "link": "https://siliconangle.com/2025/02/19/trump-media-rumble-sue-brazil-supreme-court-justice-censorship-row/",
    "timestamp": "2025-02-20T01:52:06Z"
  },
  {
    "title": "Europe paralysed as Trump hangs Ukraine out to dry",
    "description": "A frozen and uncertain Europe will need to make hard decisions quickly.",
    "link": "https://www.euractiv.com/section/politics/news/europe-paralysed-as-trump-hangs-ukraine-out-to-dry/",
    "timestamp": "2025-02-20T01:51:28Z"
  },
  {
    "title": "DOGE notches courtroom wins as Elon Musk crusades to slash federal government",
    "description": "Although some parts of President Donald Trump’s agenda are getting bogged down by litigation, Elon Musk’s Department of Government Efficiency is having better luck in the courtroom",
    "link": "https://abcnews.go.com/Politics/wireStory/doge-notches-courtroom-wins-elon-musk-crusades-slash-118984986",
    "timestamp": "2025-02-20T01:50:16Z"
  },
  {
    "title": "Key NASA officials' departure casts more uncertainty over US moon program",
    "description": "NASA faces increased uncertainty as four senior officials, including Jim Free, are set to retire. This comes amid a leadership upheaval influenced by Elon Musk and President Trump's push towards Mars missions, potentially upending the agency’s current focus o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/key-nasa-officials-departure-casts-more-uncertainty-over-us-moon-program/articleshow/118402011.cms",
    "timestamp": "2025-02-20T01:48:37Z"
  },
  {
    "title": "Tens of millions of dead people aren’t getting Social Security checks, despite Trump and Musk claims",
    "description": "The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving Social Security payments. Over the past few days, President Donald Trump and Elon Musk have said on social media and in press briefings that peo…",
    "link": "https://freerepublic.com/focus/f-news/4298958/posts",
    "timestamp": "2025-02-20T01:45:06Z"
  },
  {
    "title": "Trump Orders Justice Dept. To Fire All ‘Biden-Era’ U.S. Attorneys",
    "description": "President Donald Trump continued his purge of officials he suspects could work against him and his agenda on Tuesday, issuing instructions to Attorney General Pam Bondi to fire all remaining U.S. attorneys who worked under former President Joe Biden. “Over th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4298957/posts",
    "timestamp": "2025-02-20T01:43:06Z"
  },
  {
    "title": "Revealed preference as an analytical tool",
    "description": "Economists like to look at actual behavior as a way of inferring what people believe.  This is called “revealed preference.”  I’ve always found it to be a very useful tool.\nRecent statements by top Trump administration officials have puzzled observers on both…",
    "link": "https://www.econlib.org/revealed-preference-as-an-analytical-tool/",
    "timestamp": "2025-02-20T01:42:52Z"
  },
  {
    "title": "Real estate agents respond to the barrage of social media posts suggesting that federal layoffs have created a huge supply of affordable houses in Washington D.C.: That's ridiculous. There's no way we'd let them be affordable [Obvious]",
    "description": "Real estate agents respond to the barrage of social media posts suggesting that federal layoffs have created a huge supply of affordable houses in Washington D.C.: That's ridiculous. There's no way we'd let them be affordable",
    "link": "https://www.fark.com/comments/13567784/Real-estate-agents-respond-to-barrage-of-social-media-posts-suggesting-that-federal-layoffs-have-created-a-huge-supply-of-affordable-houses-in-Washington-DC-Thats-ridiculous-Theres-no-way-wed-let-them-be-affordable",
    "timestamp": "2025-02-20T01:39:33Z"
  },
  {
    "title": "JD Vance to raise free speech issues with Keir Starmer during Washington visit",
    "description": "JD Vance will reiterate his concerns about the erosion of free speech in Britain to Sir Keir Starmer when the pair meet in Washington DC next week, he said. The vice-president used his speech at the Munich Security Conference to warn the threat to free speech…",
    "link": "https://freerepublic.com/focus/f-news/4298955/posts",
    "timestamp": "2025-02-20T01:39:05Z"
  },
  {
    "title": "Trump Again Claims He Put Musk ‘In Charge’ Of DOGE, Contradicting His Own DOJ",
    "description": "The statement could help the Trump critics who've sued to stop job cuts and contract cancellations, on the grounds that Musk does not have authority to make those calls.",
    "link": "https://www.huffpost.com/entry/trump-doge-musk-in-charge_n_67b67271e4b050f805a0de5c",
    "timestamp": "2025-02-20T01:37:03Z"
  },
  {
    "title": "Trump labels cartels ‘terrorist organizations’",
    "description": "The Trump administration is formally designating eight Latin American crime organizations as \"foreign terrorist organizations,\" upping its pressure on cartels operating in the U.S. and on anyone aiding them.",
    "link": "https://www.bostonherald.com/2025/02/19/trump-labels-cartels-terrorist-organizations/",
    "timestamp": "2025-02-20T01:36:08Z"
  },
  {
    "title": "Mike Johnson: The weakest speaker, Trump’s puppet, and Musk’s doormat",
    "description": "WASHINGTON WATCH: House Speaker Mike Johnson has surrendered Congress’s power to Trump and Musk, raising concerns about his weak leadership and the future of US democracy.",
    "link": "https://www.jpost.com/opinion/article-842880",
    "timestamp": "2025-02-20T01:35:44Z"
  },
  {
    "title": "‘The Brutalist’ is a pretentious, overlong Oscar-nominated mess",
    "description": "Despite its Oscar buzz, The Brutalist is a tedious, pretentious mess that tests audience patience with its excessive length and heavy-handed messaging.",
    "link": "https://www.jpost.com/j-spot/article-842886",
    "timestamp": "2025-02-20T01:34:53Z"
  },
  {
    "title": "‘Restoring Confidence’: 5 Highlights of Trump’s First Month as CPAC Gathers to Celebrate",
    "description": "President Donald Trump’s enraptured supporters, gathering just outside Washington, D.C., for the annual Conservative Political Action Conference, have much to celebrate after Trump’s first month... Read More\nThe post ‘Restoring Confidence’: 5 Highlights of Tr…",
    "link": "https://www.dailysignal.com/2025/02/19/restoring-confidence-five-highlights-trumps-first-month/",
    "timestamp": "2025-02-20T01:34:02Z"
  },
  {
    "title": "Dismay and defiance in Kyiv, as Trump takes 'enemy's side'",
    "description": "Ukrainians decry the U.S. President's accusation against their leader of starting the war with Russia, saying they had no other choice than to fight.",
    "link": "https://www.japantimes.co.jp/news/2025/02/20/world/politics/ukraine-dismay-trump-enemy-side/",
    "timestamp": "2025-02-20T01:34:00Z"
  },
  {
    "title": "Trump says he’s weighing giving 20% of DOGE savings to Americans",
    "description": "U.S. President Donald Trump revealed on Wednesday that he’s considering sending 20% of the money saved by the Department of Government Efficiency advisory group to Americans. “There’s even under consideration a new concept where we give 20% of the DOGE saving…",
    "link": "https://freerepublic.com/focus/f-chat/4298954/posts",
    "timestamp": "2025-02-20T01:32:58Z"
  },
  {
    "title": "Yen climbs on BOJ outlook, yuan helped by prospect of trade deal",
    "description": "The yen hit its strongest level in over two months on Thursday as investors ramped up bets on further rate hikes from the Bank of Japan (BOJ) this year...",
    "link": "https://finance.yahoo.com/news/yen-rises-dollar-steady-traders-013119657.html",
    "timestamp": "2025-02-20T01:31:19Z"
  },
  {
    "title": "On NATO's eastern flank, U.S. policy shift stokes security fears",
    "description": "Some in Poland fear that Russian President Vladimir Putin will feel emboldened to invade more countries.",
    "link": "https://www.japantimes.co.jp/news/2025/02/20/world/nato-us-policy-shift-fears/",
    "timestamp": "2025-02-20T01:31:00Z"
  },
  {
    "title": "Mint Quick Edit | Should Trump’s latest tariff salvos worry India?",
    "description": "The US president plans a 25% import duty on automobiles, semiconductor chips and pharma products. How this squares with reciprocal tariffs is unclear. But it won’t do either India or the US any good.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-latest-tariffs-import-duty-automobiles-semiconductor-chips-pharmaceutical-india-reciprocal-tariffs-trade-11739979797810.html",
    "timestamp": "2025-02-20T01:30:13Z"
  },
  {
    "title": "Trump seeks greater control of independent regulators with his new executive order",
    "description": "WASHINGTON — President Donald Trump wants to give the White House direct control of independent federal regulators such as the Securities and Exchange Commission, the Federal Trade Commission and the Federal Communications Commission.",
    "link": "https://roanoke.com/news/nation-world/government-politics/trump-seeks-greater-control-of-independent-regulators-with-his-new-executive-order/article_db70cf00-e26c-5ded-ac48-9cbec4623224.html",
    "timestamp": "2025-02-20T01:30:00Z"
  },
  {
    "title": "Kennedy Center performance featuring Gay Men's Chorus of Washington is canceled",
    "description": "An event at the John F. Kennedy Center for the Performing Arts featuring the Gay Men’s Chorus of Washington, D.C., and the National Symphony Orchestra has been canceled, the choral group said.",
    "link": "https://www.nbcnews.com/politics/politics-news/kennedy-center-performance-featuring-gay-mens-chorus-washington-cancel-rcna192901",
    "timestamp": "2025-02-20T01:29:06Z"
  },
  {
    "title": "Albinder Dhindsa interview; Kraken's India comeback",
    "description": "Happy Thursday! Blinkit CEO Albinder Dhindsa spoke to ET about the quick commerce race, 10-minute delivery and more. This and other updates in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/blinkit-ceo-speaks-to-et-re-releasing-the-kraken/articleshow/118401569.cms",
    "timestamp": "2025-02-20T01:28:49Z"
  },
  {
    "title": "Disbelief And Anger: Ukrainians React To Trump's 'Absurdity'",
    "description": "Three years into Russia's invasion of Ukraine, Ukrainian soldier Ivan Banias has found himself struggling to digest the \"absurdity\" of what US President Donald Trump is saying about the war, his country and his president.",
    "link": "https://www.ibtimes.com/disbelief-anger-ukrainians-react-trumps-absurdity-3764357",
    "timestamp": "2025-02-20T01:27:12Z"
  },
  {
    "title": "US-Canadian Relations On Thin Ice Ahead Of Hockey Rematch",
    "description": "Americans and Canadians are punching and booing each other in the wake of President Donald Trump's taunts about making Canada a US state -- at least on the ice hockey rink.",
    "link": "https://www.ibtimes.com/us-canadian-relations-thin-ice-ahead-hockey-rematch-3764354",
    "timestamp": "2025-02-20T01:27:11Z"
  },
  {
    "title": "Meet Andrew Ferguson, the new chairman of the FTC who has vowed to go after Big Tech's 'vendetta against competition'",
    "description": "President Donald Trump appointed Andrew Ferguson to lead the Federal Trade Commission. Ferguson, a Republican, has vowed to take on Big Tech.",
    "link": "https://www.businessinsider.com/andrew-ferguson-new-chairman-federal-trade-commission-antitrust-big-tech-2025-2",
    "timestamp": "2025-02-20T01:24:11Z"
  },
  {
    "title": "The NCAA Policy ‘Protecting’ Women’s Sports Is a Head Fake. Don’t Fall for It.",
    "description": "President Donald Trump has issued a flurry of executive orders, but few have received as much media attention as his directive protecting women’s sports. And... Read More\nThe post The NCAA Policy ‘Protecting’ Women’s Sports Is a Head Fake. Don’t Fall for It. …",
    "link": "https://www.dailysignal.com/2025/02/19/ncaa-policy-protecting-womens-sports-is-head-fake-dont-fall/",
    "timestamp": "2025-02-20T01:22:22Z"
  },
  {
    "title": "Democratic Senator Blasts Trump's Post Slamming Zelensky as 'Disgusting Betrayal': 'The President's Surrender is Pathetic and Weak'",
    "description": "Trump's social media post disparaging Ukrainian President Volodymyr Zelensky—a longtime ally to the United States—sparked a harsh rebuke from Sen. Blumenthal.",
    "link": "https://www.ibtimes.com/democratic-senator-blasts-trumps-post-slamming-zelensky-disgusting-betrayal-presidents-3764348",
    "timestamp": "2025-02-20T01:21:31Z"
  },
  {
    "title": "Germany's Merz Vows Tough Migrant Policy To Stall AfD's Rise",
    "description": "Germany's conservative election frontrunner Friedrich Merz on Wednesday called on voters to give him a strong mandate to restrict immigration and rebuild the economy to ward off the rise of the far-right AfD.\nIn a final head-to-head TV debate with centre-left…",
    "link": "https://www.ibtimes.com/germanys-merz-vows-tough-migrant-policy-stall-afds-rise-3764347",
    "timestamp": "2025-02-20T01:21:17Z"
  },
  {
    "title": "Boy Wins High School Girls’ Pole Vault Competition in Maine After State Pledged to Flout Trump Order",
    "description": "A transgender-identifying boy snagged first place in a Maine high school girls' pole vaulting competition on Monday, just days after the state's governing body for school sports rejected President Donald Trump’s executive order barring males from playing on f…",
    "link": "https://www.breitbart.com/politics/2025/02/19/boy-wins-high-school-girls-pole-vault-competition-maine-pledged-flout-trump-order/",
    "timestamp": "2025-02-20T01:19:36Z"
  },
  {
    "title": "Ex-NFL punter arrested after 'MAGA' plaque protest during California city council meeting",
    "description": "Former NFL punter Chris Kluwe was arrested after protesting at a City Council meeting in Huntington Beach, California, on Wednesday. The reason for Kluwe’s protest revolved around a sign proposed for Huntington Beach’s public library, which would have the wor…",
    "link": "https://freerepublic.com/focus/f-chat/4298949/posts",
    "timestamp": "2025-02-20T01:19:32Z"
  },
  {
    "title": "TV Star Alan Ritchson Calls Boyhood Classmate Matt Gaetz A 'Motherf*****'",
    "description": "Alan Ritchson's not voting for his childhood classmate Matt Gaetz anytime soon ... 'cause he used some choice verbiage to take a shot at the dude who he calls his adversary. The \"Reacher\" star sat down for an interview with GQ -- released Wednesday…",
    "link": "https://www.tmz.com/2025/02/19/tv-star-alan-ritchson-calls-out-matt-gaetz/",
    "timestamp": "2025-02-20T01:18:18Z"
  },
  {
    "title": "Trump Media Goes After Brazilian Judge Overseeing Investigation of Bolsonaro for Alleged Coup",
    "description": "President Donald Trump's media company has filed a lawsuit against a Brazilian Supreme Court judge, accusing him of violating U.S. free speech protections.",
    "link": "https://www.ibtimes.com/trump-media-goes-after-brazilian-judge-overseeing-investigation-bolsonaro-alleged-coup-3764344",
    "timestamp": "2025-02-20T01:18:12Z"
  },
  {
    "title": "Oscar-nominated movies you can watch at home on your couch",
    "description": "The Oscars are almost here, but how many of the films have you actually seen? Before forking out big bucks, these nominated movies are available on home streaming services for no extra charge.",
    "link": "https://www.abc.net.au/news/2025-02-20/oscar-nominated-movies-you-can-watch-at-home-on-your-couch/104955508",
    "timestamp": "2025-02-20T01:15:18Z"
  },
  {
    "title": "Kathy Hochul bashes Elon Musk — but then taps Al Sharpton for advice",
    "description": "Gov. Kathy Hochul has joined fellow Democrats in bashing President Donald Trump for relying on Elon Musk, so who does she call to decide whether to boot Mayor Eric Adams? The Rev. Al Sharpton.",
    "link": "https://nypost.com/2025/02/19/opinion/kathy-hochul-bashes-elon-musk-but-then-taps-al-sharpton-for-advice/",
    "timestamp": "2025-02-20T01:14:04Z"
  },
  {
    "title": "Trump Delivers Crushing Blow to All 'Biden Era' US Attorneys: 'We Must Clean House Immediately'",
    "description": "President Donald Trump announced that he would dismiss all \"Biden Era\" U.S. attorneys in an effort to restore confidence in the government.",
    "link": "https://www.westernjournal.com/trump-delivers-crushing-blow-biden-era-us-attorneys-must-clean-house-immediately/",
    "timestamp": "2025-02-20T01:13:59Z"
  },
  {
    "title": "Stock Market Highlights 20 February 2025: Sensex, Nifty close marginally lower for third day amid uncertainty on US tariff",
    "description": "Sensex, Nifty updates on 20 February 2025: Benchmark indices Sensex and Nifty declined for the third day on Thursday as fresh tariff threats, weak Asian markets and foreign fund outflows hurt investors’ sentiment.\n The 30-share BSE Sensex dropped 203.22 point…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-nifty-sensex-highlights-20-february-2025/article69238622.ece",
    "timestamp": "2025-02-20T01:12:31Z"
  },
  {
    "title": "Ambassador says U.S. recognizes Canada's 'progress' in protecting border, tackling fentanyl",
    "description": "Canada's ambassador to the United States hinted the country might avoid U.S. President Donald Trump's tariffs by continuing to tackle illegal migration and fentanyl trafficking.",
    "link": "https://www.cbc.ca/news/politics/ambassador-us-canada-tariff-border-progress-1.7463449",
    "timestamp": "2025-02-20T01:11:38Z"
  },
  {
    "title": "Palmer takes aim at coal mining seat of Hunter as fellow believers worry about crowded field",
    "description": "Will Clive Palmer's new tilt at political power fracture the conservative vote? One fellow right-winger certainly seems worried about it\nThe post Palmer takes aim at coal mining seat of Hunter as fellow believers worry about crowded field appeared first on Cr…",
    "link": "http://www.crikey.com.au/2025/02/20/clive-palmer-hunter-election-conservative-parties/",
    "timestamp": "2025-02-20T01:11:16Z"
  },
  {
    "title": "Palmer takes aim at coal mining seat of Hunter as fellow believers worry about crowded field",
    "description": "Will Clive Palmer's new tilt at political power fracture the conservative vote? One fellow right-winger certainly seems worried about it\nThe post Palmer takes aim at coal mining seat of Hunter as fellow believers worry about crowded field appeared first on Cr…",
    "link": "http://www.crikey.com.au/2025/02/20/clive-palmer-hunter-election-conservative-parties-crikey/",
    "timestamp": "2025-02-20T01:11:16Z"
  },
  {
    "title": "Rand Paul: GO TRUMP GO",
    "description": "@RandPaul A few people may have noticed that I resisted an enthusiastic endorsement of Donald Trump during the election. But now, I’m amazed by the Trump cabinet (many of whom I would have picked). I love his message to the Ukrainian warmongers, and along wit…",
    "link": "https://freerepublic.com/focus/f-chat/4298947/posts",
    "timestamp": "2025-02-20T01:10:55Z"
  },
  {
    "title": "Trump Adds Support For DOGE Dividend; Here’s Why He Might Do It",
    "description": "At a speech in Miami on Wednesday, Trump said a plan to give a DOGE Dividend to taxpayers is “under consideration.”",
    "link": "https://www.forbes.com/sites/shaharziv/2025/02/19/trump-adds-support-for-doge-dividend-checks-heres-why-he-might-do-it/",
    "timestamp": "2025-02-20T01:10:26Z"
  },
  {
    "title": "Trump to sign executive order ending taxpayer benefits to illegal migrants",
    "description": "President Donald Trump on Wednesday is expected to sign an executive order that officially ends all federal taxpayer benefits to illegal migrants, White House press secretary Karoline Leavitt confirmed. The order is expected to instruct all federal agencies t…",
    "link": "https://freerepublic.com/focus/f-news/4298945/posts",
    "timestamp": "2025-02-20T01:09:17Z"
  },
  {
    "title": "Hegseth directs Pentagon to find $50 billion in cuts this year to fund Trump military priorities",
    "description": "Defense Secretary Pete Hegseth has ordered the identification of $50 billion in military spending cuts to fund President Trump's priorities. Areas targeted include excessive bureaucracy, climate change initiatives, and diversity, equity and inclusion programs…",
    "link": "https://economictimes.indiatimes.com/news/defence/hegseth-directs-pentagon-to-find-50-billion-in-cuts-this-year-to-fund-trump-military-priorities/articleshow/118401692.cms",
    "timestamp": "2025-02-20T01:08:44Z"
  },
  {
    "title": "China keeps benchmark lending rates steady as PBOC prioritizes financial stability",
    "description": "The PBOC has prioritized defending the yuan against the pressure for it to depreciate on anticipation of higher tariff rates.",
    "link": "https://www.cnbc.com/2025/02/20/china-lpr-decision-february.html",
    "timestamp": "2025-02-20T01:08:15Z"
  },
  {
    "title": "Fired FAA employee who was working on missile defense says Americans should be scared - NewsBreak",
    "description": "In an interview with CNN’s Kaitlan Collins, former FAA employee Charles Spitzer-Stadtlander says he was working on an FAA defense program when he was fired",
    "link": "https://www.newsbreak.com/share/3820144787774-fired-faa-employee-who-was-working-on-missile-defense-says-americans-should-be-scared?s=a7&amp;share_destination_id=NzI1ODg2OTUtMTc0MDAxMzY1OTY4OQ%3D%3D&amp;pd=04uZdPbD&amp;hl=en_US&amp;send_time=1740013659&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_model_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v7",
    "timestamp": "2025-02-20T01:08:10Z"
  },
  {
    "title": "Hegseth directs Pentagon to find $50 billion in cuts this year to fund Trump military priorities - NewsBreak",
    "description": "WASHINGTON (AP) — Defense Secretary Pete Hegseth has directed the military services to identify $50 billion in programs that could be cut next year in orde",
    "link": "https://www.newsbreak.com/share/3820828662224-hegseth-directs-pentagon-to-find-50-billion-in-cuts-this-year-to-fund-trump-military-priorities?s=a2&share_destination_id=MTc5OTM4NTAzLTE3NDAwMjI2NDkwODU%3D&pd=0CB0Dv47&hl=en_US&send_time=1740022649&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v3",
    "timestamp": "2025-02-20T01:07:41Z"
  },
  {
    "title": "Trump tells 'dictator' Zelenskyy to move fast or lose Ukraine",
    "description": "President Donald Trump called Ukrainian President Volodymyr Zelenskyy a “dictator” and warned of losing his country if peace wasn't secured swiftly. This escalated tensions and concerned European allies, especially after Trump's claim that Ukraine was respons…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-tells-dictator-zelenskyy-to-move-fast-or-lose-ukraine/articleshow/118401681.cms",
    "timestamp": "2025-02-20T01:07:36Z"
  },
  {
    "title": "Tucker interviews human rights lawyer that has worked in Ukraine",
    "description": "Donald Trump just called Zelensky a dictator. Human rights lawyer Bob Amsterdam has worked in Ukraine for the past couple of years and confirms that if anything, that’s an understatement.(0:00) The Situation Is Dire (3:28) Bob Amsterdam’s Fight to Defend the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4298944/posts",
    "timestamp": "2025-02-20T01:07:31Z"
  },
  {
    "title": "Asian stocks drop after Fed Minutes show caution",
    "description": "Stocks in Japan and Australia dropped while equity index futures for Hong Kong also drifted lower. Contracts for US stocks also slipped in early Asian trading after the S&P 500 climbed 0.2% on Wednesday to set a new high, with defensive sectors outperforming …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-fed-minutes-show-caution/articleshow/118401677.cms",
    "timestamp": "2025-02-20T01:07:28Z"
  },
  {
    "title": "Musk’s DOGE to Lead Trump’s Purge of Federal Regulations",
    "description": "President Donald Trump plans to sign an executive order undertaking a massive regulatory review in a bid to fulfill his campaign pledge of eliminating rules he says stifle businesses and innovation.",
    "link": "https://www.livemint.com/companies/news/musks-doge-to-lead-trump-s-purge-of-federal-regulations-11740013560295.html",
    "timestamp": "2025-02-20T01:05:59Z"
  },
  {
    "title": "Actual quote from former UK minister: 'If you'd asked AI to write a piece of Russian propaganda in the style of Donald Trump, this is what you'd get. 'Well done America, you've elected a Russian asset as your president.' [Obvious]",
    "description": "Actual quote from former UK minister: 'If you'd asked AI to write a piece of Russian propaganda in the style of Donald Trump, this is what you'd get. 'Well done America, you've elected a Russian asset as your president.'",
    "link": "https://www.fark.com/comments/13568774/Actual-quote-from-former-UK-minister-If-youd-asked-AI-to-write-a-piece-of-Russian-propaganda-in-style-of-Donald-Trump-this-is-what-youd-get-Well-done-America-youve-elected-a-Russian-asset-as-your-president",
    "timestamp": "2025-02-20T01:05:05Z"
  },
  {
    "title": "British boots on the ground: What could a UK-Europe force in Ukraine look like?",
    "description": "British and other European troops could be deployed to Ukrainian cities, ports and nuclear power plants to help secure the peace following any ceasefire deal with Russia, western officials have said.",
    "link": "https://news.sky.com/story/british-boots-on-the-ground-what-could-a-uk-europe-force-in-ukraine-look-like-13312995",
    "timestamp": "2025-02-20T01:04:00Z"
  },
  {
    "title": "Trump Floats Giving 20% of Savings from DOGE 'To American Citizens'",
    "description": "President Donald Trump floated the idea of giving 20 percent of the money that Elon Musk and his team at the Department of Government Efficiency (DOGE) have saved back to the American people.\nThe post Trump Floats Giving 20% of Savings from DOGE ‘To American …",
    "link": "https://www.breitbart.com/politics/2025/02/19/trump-floats-giving-20-of-savings-from-doge-to-american-citizens/",
    "timestamp": "2025-02-20T01:03:54Z"
  },
  {
    "title": "Former NFL punter gets tackled by police and arrested over 'civil disobedience' protest against MAGA plaque",
    "description": "A former NFL player spoke out against President Donald Trump at a city council meeting but was tackled and arrested after approaching the council members in \"civil disobedience.\" Chris Kluwe read out a list of accusations against the \"Make America Great Again…",
    "link": "https://www.theblaze.com/news/punter-protest-maga-arreset-tackle",
    "timestamp": "2025-02-20T01:03:39Z"
  },
  {
    "title": "Trump's layoffs hit firefighter safety programs",
    "description": "Among the federal workers let go were the ones who maintain the National Firefighter Registry for Cancer — which was signed into law by Trump in 2018.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trumps-layoffs-hit-firefighter-safety-programs-rcna192849",
    "timestamp": "2025-02-20T01:03:32Z"
  },
  {
    "title": "How a 1995 California court ruling that restored immigrant rights could backfire in 2025",
    "description": "Federal prosecutors are trying to overturn Illinois sanctuary laws, and the case could have major implications for a California law limiting local law enforcement cooperation with immigration authorities.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/02/19/how-a-1995-california-court-ruling-that-restored-immigrant-rights-could-backfire-in-2025",
    "timestamp": "2025-02-20T01:01:46Z"
  },
  {
    "title": "Senate Republicans Forge Ahead with $340 Billion Budget Amid GOP Infighting",
    "description": "The contentious budget process is making an already challenging legislative effort even harder for Republicans.",
    "link": "https://www.newsweek.com/senate-republicans-forge-ahead-340-billion-budget-2033535",
    "timestamp": "2025-02-20T01:00:11Z"
  },
  {
    "title": "Trump says he ended Biden’s war on Bitcoin and crypto, pledges to make the US crypto capital",
    "description": "Trump's pro-crypto stance may boost US innovation and investment, potentially reshaping global financial dynamics and regulatory approaches.\nThe post Trump says he ended Biden’s war on Bitcoin and crypto, pledges to make the US crypto capital appeared first o…",
    "link": "https://cryptobriefing.com/trump-make-us-crypto-capital/",
    "timestamp": "2025-02-20T00:54:40Z"
  },
  {
    "title": "House Republican Rips Trump: ‘What the President Said Today Was Wrong’",
    "description": "Rep. Don Bacon (R-NE) criticized President Donald Trump for “standing on the side” of Russian President Vladimir Putin, who he called a “dictator,” on Wednesday evening. Bacon was asked by CNN anchor Brianna Keilar to react to critical comments Trump made of …",
    "link": "https://www.mediaite.com/tv/house-republican-rips-trump-what-the-president-said-today-was-wrong/",
    "timestamp": "2025-02-20T00:53:57Z"
  },
  {
    "title": "More Than 100 Medical Workers Urge Senate To Help Stop Attacks On Palestinians",
    "description": "The group, Doctors Against Genocide, called for lawmakers to protect Gaza's health care workers and help the medical institutions destroyed by Israeli forces.",
    "link": "https://www.huffpost.com/entry/100-medical-workers-senate-stop-violence-against-palestinians_n_67b64a46e4b050f805a0d0bd",
    "timestamp": "2025-02-20T00:53:49Z"
  },
  {
    "title": "Transgender politician who defeated 12-year-old girl in marathon defends trans inclusion in women's sports",
    "description": "Nathanielle Morin, Canadian advisor to the Federal Minister of Women, released a statement defending trans participation in women's sports, taking aim at Trump.",
    "link": "https://www.foxnews.com/sports/transgender-politician-who-defeated-12-year-old-girl-marathon-defends-trans-inclusion-womens-sports",
    "timestamp": "2025-02-20T00:53:32Z"
  },
  {
    "title": "What if a sitting president became dangerously unstable? The 1965 novel Night of Camp David makes for uncanny reading today",
    "description": "Fletcher Knebel’s novel has much to say about the fragility of our democratic institutions and the dangers of unchecked authority.",
    "link": "https://theconversation.com/what-if-a-sitting-president-became-dangerously-unstable-the-1965-novel-night-of-camp-david-makes-for-uncanny-reading-today-249378",
    "timestamp": "2025-02-20T00:51:46Z"
  },
  {
    "title": "US figures do not support Trump claims on Ukraine spending",
    "description": "President Donald Trump on Wednesday repeated a claim that the United States has spent $350 billion on Ukraine’s war — a figure that far eclipses the amount recorded by the Department of Defense and the interagency oversight group that tracks U.S. appropriatio…",
    "link": "https://www.voanews.com/a/us-figures-do-not-support-trump-claims-on-ukraine-spending/7981441.html",
    "timestamp": "2025-02-20T00:49:09Z"
  },
  {
    "title": "Trump says most successful business leaders are now ‘racing’ to invest in the U.S.",
    "description": "... Read more",
    "link": "https://www.wnd.com/2025/02/trump-says-most-successful-business-leaders-are-now-racing-to-invest-in-the-u-s/",
    "timestamp": "2025-02-20T00:47:37Z"
  },
  {
    "title": "‘Be Quiet For A While’: Megyn Kelly Tells Zelenskyy His ‘Yapping’ Won’t End War, Reminds Him Of US Control",
    "description": "Megyn Kelly warned Zelenskyy that his \"yapping\" won't help end his war against Russia, reminding him of how U.S. aid has kept him afloat.",
    "link": "https://dailycaller.com/2025/02/19/megyn-kelly-zelenskyy-ukraine-russia-war-donald-trump/",
    "timestamp": "2025-02-20T00:43:29Z"
  },
  {
    "title": "Fetterman loses two top staffers as he makes waves by bucking Democratic Party",
    "description": "Renegade Pennsylvania Democrat John Fetterman is suffering more staff departures as they continue to color his time in the Senate.",
    "link": "https://www.foxnews.com/politics/fetterman-loses-two-top-staffers-he-makes-waves-bucking-democratic-party",
    "timestamp": "2025-02-20T00:43:24Z"
  },
  {
    "title": "Trump calls Zelenskyy a dictator as U.S.-Ukraine bonds unravel",
    "description": "The U.S. president has abandoned years of support for Ukraine, as he prepares to meet with Russia's Vladimir Putin to negotiate a deal to end the war.",
    "link": "https://www.japantimes.co.jp/news/2025/02/20/world/politics/trump-zelenskyy-dictator/",
    "timestamp": "2025-02-20T00:39:00Z"
  },
  {
    "title": "Europeans reaffirm calls for just, lasting peace in Ukraine",
    "description": "Flags of the European Union fly outside the Berlaymont Building, the European Commission headquarte",
    "link": "http://en.people.cn/n3/2025/0220/c90000-20278857.html",
    "timestamp": "2025-02-20T00:38:22Z"
  },
  {
    "title": "Our hostages might be home already if Biden supported Israel as much as Trump does",
    "description": "Americans support Israel, and the US government will demonstrate that support with concrete actions, diplomatic and economic strength, and a commitment to the values that the two countries share.",
    "link": "https://www.jpost.com/opinion/article-842879",
    "timestamp": "2025-02-20T00:37:37Z"
  },
  {
    "title": "Indonesia Industrial Coal Power Plans Undercut Emissions Pledge: Report",
    "description": "Indonesia's planned expansion of \"captive\" coal plants used to power industry is threatening its pledge to cut CO2 emissions by 2030 and close all coal-fired plants by a decade later, said a report published Thursday.",
    "link": "https://www.ibtimes.com/indonesia-industrial-coal-power-plans-undercut-emissions-pledge-report-3764339",
    "timestamp": "2025-02-20T00:36:14Z"
  }
]