[
  {
    "title": "White House Dinner Closes A Turbulent Week For Governors In Washington",
    "description": "Governors have gathered for the annual National Governors Association dinner after a tense week.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-governors-dinner-white-house_n_699af460e4b050c4ef26d137",
    "timestamp": "2026-02-22T12:28:14Z"
  },
  {
    "title": "U.S. Ambassador Causes Uproar By Claiming Israel Has A Right To Much Of The Middle East",
    "description": "Arab and Muslim countries are sharply condemning comments by the U.S. ambassador to Israel, who said in an interview that Israel had a right to much of the Middle East.",
    "link": "https://www.huffpost.com/entry/us-ambassador-israel-middle-east-uproar_n_699af428e4b050c4ef26d135",
    "timestamp": "2026-02-22T12:23:46Z"
  },
  {
    "title": "'This is what we call tilting': Gov pinpoints how Trump's 'gambling away your tax dollars'",
    "description": "Donald Trump is \"gambling away your tax dollars,\" according to a top Democratic contender for 2028.Illinois governor JB Pritzker, a billionaire, reportedly took home $1.4 million in winnings after playing blackjack in 2024. Now he's putting his expertise to t…",
    "link": "https://www.rawstory.com/jb-pritzker-2675291560/",
    "timestamp": "2026-02-22T12:22:12Z"
  },
  {
    "title": "Olympian Eileen Gu hits out after JD Vance criticised her for not representing US",
    "description": "American-born Eileen Gu has a theory about why JD Vance is concerned with her representing China",
    "link": "https://www.ladbible.com/news/sport/chinese-eileen-gu-jd-vance-response-olympics-team-america-192415-20260222",
    "timestamp": "2026-02-22T12:10:12Z"
  },
  {
    "title": "Arab, Muslim nations rebuke US envoy's Israel land claim",
    "description": "Mike Huckabee, the US ambassador to Israel, suggested that Israel holds a biblical entitlement to a large portion of the Middle East.",
    "link": "https://www.dw.com/en/arab-muslim-nations-rebuke-us-envoys-israel-land-claim/a-76077271",
    "timestamp": "2026-02-22T12:09:00Z"
  },
  {
    "title": "How did Paramount beat Netflix on the Warner Bros. antitrust hurdle? #entertainment",
    "description": "A surprise regulatory win and the larger takeover fight Paramount scored an important procedural victory by clearing an antitrust hurdle tied to the contested sale of Warner Bros., doing so before Netflix could secure the same regulatory green light. The deve…",
    "link": "https://alltoc.com/entertainment/how-did-paramount-beat-netflix-on-the-warner-bros-antitrust-hurdle",
    "timestamp": "2026-02-22T12:07:50Z"
  },
  {
    "title": "US military buildup near Iran proves defeat in previous regional wars: Ansarullah",
    "description": "A senior member of the Yemeni Ansarullah resistance movement says the US buildup of warships and fighter jets near Iran, as well as threats of a new round of aggression against the Islamic Republic and the Axis of Resistance, attest to the defeat of Washingto…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv05.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Dozens of US Warplanes Spotted at Jordan Base Amid US-Iran Tensions - Reports",
    "description": "Dozens of US warplanes have been spotted at Muwaffaq Salti Air Base in Jordan amid tensions between the United States and Iran, the New York Times has reported, citing satellite photos and flight data.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-sputnik02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump raises new global tariff from 10 pct to 15 pct",
    "description": "U.S. President Donald Trump said Saturday he will raise the new global tariff to 15 percent, one day after he announced a 10 percent worldwide duty following a heavy blow from the Supreme Court.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-pdo02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "ICE quietly buys warehouses for major detention expansion, catching local officials off guard",
    "description": "US federal immigration authorities are acquiring large warehouse properties nationwide as part of a sweeping effort to expand detention capacity, often without notifying local officials before deals are finalized.",
    "link": "https://www.globalsecurity.org/security/library/news/2026/02/sec-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Iran's military alertness main 'deterrent' against enemy miscalculations: Top commander",
    "description": "A senior Iranian commander said the constant alertness and readiness of the country's Armed Forces constitute the \"most important deterrent\" against any adventurism or miscalculation by enemies.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv04.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "US Steps Up South Caucasus Push As Armenia-Azerbaijan Peace Hangs In Balance",
    "description": "Azerbaijani President Ilham Aliyev and Armenian Prime Minister Nikol Pashinian were back in Washington this week, just days after US Vice President JD Vance visited both countries. The White House has branded the effort a \"Board of Peace\" push aimed at consol…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-rferl01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Iranian Students Chant Anti-Government Slogans, Clash With Security Forces In Tehran",
    "description": "Iranian students chanting anti-government slogans faced off with security forces outside a Tehran university, according to social media videos and other reports.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-rferl01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Araghchi to Trump: Prove your claim of 32,000 deaths in Iran riots",
    "description": "Iran's foreign minister has categorically dismissed US President Donald Trump's claim that 32,000 people were killed in just two days of riots across Iran last month, urging him to prove the claim.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv06.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump Vows to Raise Global Tariff Rate to 15%",
    "description": "US President Donald Trump announced on Saturday that he will raise the global tariff rate on goods imported from all countries in response to what he sees as trading with the United States in bad faith to 15% from 10%.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-sputnik01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump administration advances Saudi nuclear deal, leaves door open to enrichment: Report",
    "description": "The Trump administration has informed Congress of its pursuit of a civilian nuclear cooperation agreement with Saudi Arabia, which may not include the strict non-proliferation conditions typically required in similar US accords, a new report reveals.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2026/saudi-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "As Russia's War On Ukraine Nears Fifth Year, Analysts See 'Frozen' Prospects For Peace",
    "description": "As Russia's full-scale invasion of Ukraine approaches its fourth anniversary, the conflict is increasingly defined by hardened positions and structural constraints that leave little room for a negotiated breakthrough, former US diplomats and analysts said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260221-rferl02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "'We will not bow to pressure or coercion': President Pezeshkian",
    "description": "President Masoud Pezeshkian has declared that Iran would not bow under external pressure or internal hardship, vowing steadfastness \"to the very last drop of our blood\" as tensions persist with the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "US Considering Killing Iran's Supreme Leader Khamenei, His Son - Reports",
    "description": "The United States is considering \"taking out\" Iran's Supreme Leader, Ayatollah Ali Khamenei, and his son, Mojtaba, as one of the possible ways to address the situation around Iran, Axios reported, citing an unnamed advisor to US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-sputnik02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump raises new global tariff from 10 pct to 15 pct",
    "description": "In a ruling with deep significance for global trade, companies and the pocketbook of every US citizen, the US Supreme Court ruled on Friday that US President Donald Trump's sweeping tariffs under a law meant for use in national emergencies are illegal,accordi…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-globaltimes01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "US Authorities Discussing If Deal With Iran Should Cover Only Nuclear Program - Reports",
    "description": "The US Administration is discussing whether a possible deal with Iran should cover only its nuclear program or also extend to Iranian missiles and proxy forces, the Wall Street Journal reported on Saturday, citing US and Middle Eastern officials familiar with…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-sputnik01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "US announces new 10 pct global tariff after Supreme Court rules sweeping tariffs illegal; experts warn of turmoil in tariff policy",
    "description": "In a ruling with deep significance for global trade, companies and the pocketbook of every US citizen, the US Supreme Court ruled on Friday that US President Donald Trump's sweeping tariffs under a law meant for use in national emergencies are illegal,accordi…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-globaltimes01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "FM Araghchi rejects Trump's anti-Iran claims, urges evidence-based statement",
    "description": "Iranian Foreign Minister Abbas Araghchi has rejected claims by US President Donald Trump regarding casualty figures from recent unrest in Iran, saying that any doubts about Tehran's official data must be supported by evidence.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-irna04.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Xi gains leverage before Trump summit after tariff reversal",
    "description": "Chinese President Xi Jinping heads to talks with Donald Trump with increased leverage. The US Supreme Court has restricted Trump's power to quickly impose tariffs. This development strengthens China's negotiating position ahead of Trump's visit. Beijing antic…",
    "link": "https://economictimes.indiatimes.com/news/international/business/xi-gains-leverage-before-trump-summit-after-tariff-reversal/articleshow/128675588.cms",
    "timestamp": "2026-02-22T12:04:23Z"
  },
  {
    "title": "Unfair or not, Colorado proposal would redistrict Republicans out of Congress (Letters)",
    "description": "\"In spite of my feelings about rolling around in the mud with these perpetrators, the Democratic Party has no choice but to undertake this same effort in order to protect democracy and the rule of law. \" -- \nDavid Thomas, Denver",
    "link": "https://www.denverpost.com/2026/02/22/redistricting-congress-colorado-gerrymandering/",
    "timestamp": "2026-02-22T12:01:14Z"
  },
  {
    "title": "Trump hikes US global tariff rate to 15 percent",
    "description": "President Donald Trump raised the global duty on imports into the United States to 15 percent on Saturday, doubling down on his promise to maintain his aggressive tariff policy a day after the Supreme Court ruled much of it illegal.",
    "link": "https://www.citizen.digital/business/trump-hikes-us-global-tariff-rate-to-15-percent-n377915",
    "timestamp": "2026-02-22T12:00:39Z"
  },
  {
    "title": "Bill of Rights put to the test over Trump's immigration crackdown in Minnesota",
    "description": "In and out of court, more than half of the amendments in the Bill of Rights are being fought over as a result of Trump’s immigration enforcement surge in Minnesota.",
    "link": "https://www.nbcnews.com/politics/trump-administration/bill-rights-test-trump-immigration-crackdown-minnesota-rcna258102",
    "timestamp": "2026-02-22T12:00:00Z"
  },
  {
    "title": "The Orality Theory of Everything",
    "description": "The decline of reading and the rise of social media are again transforming what it feels like to be a thinking person.",
    "link": "https://www.theatlantic.com/ideas/2026/02/social-media-literacy-crisis/686076/",
    "timestamp": "2026-02-22T12:00:00Z"
  },
  {
    "title": "5 Key Issues Trump Should Address in the State of the Union",
    "description": "President Donald Trump will deliver the first State of the Union address of his second term this week, and his speech will set the priorities... Read More\nThe post 5 Key Issues Trump Should Address in the State of the Union appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/22/5-key-issues-trump-should-address-state-union-sotu/",
    "timestamp": "2026-02-22T12:00:00Z"
  },
  {
    "title": "Talks on Ukraine 'Complex, Laborious' - Kremlin",
    "description": "MOSCOW (Sputnik) - Kremlin spokesman Dmitry Peskov has described the negotiations on Ukraine as complex and laborious.",
    "link": "https://sputnikglobe.com/20260222/talks-on-ukraine-complex-laborious---kremlin-1123671075.html",
    "timestamp": "2026-02-22T11:53:46Z"
  },
  {
    "title": "Farage Claims UK Gov't Blocked Him from Travelling to Strategic Chagos Islands",
    "description": "Reform UK leader Nigel Farage has accused the left-wing UK government of blocking him from travelling to the Chagos Islands amid ongoing controversy surrounding the sovereignty of the British Indian Ocean Territory.\nThe post Farage Claims UK Gov’t Blocked Him…",
    "link": "https://www.breitbart.com/europe/2026/02/22/farage-claims-uk-govt-blocked-him-from-travelling-to-strategic-chagos-islands/",
    "timestamp": "2026-02-22T11:46:13Z"
  },
  {
    "title": "Right-wing media splits over Trump tariff loss",
    "description": "MAGA erupts as Supreme Court serves Mike Pence’s revenge with Trump tariffs decision",
    "link": "https://www.salon.com/2026/02/22/right-wing-media-splits-over-trump-tariff-loss/",
    "timestamp": "2026-02-22T11:45:24Z"
  },
  {
    "title": "PM Modi's visit getting entangled in Israel's domestic politics",
    "description": "Prime Minister Narendra Modi's upcoming visit to Israel faces a political hurdle. Opposition leader Yair Lapid insists on inviting the Supreme Court President to the Knesset address. This is due to a domestic dispute over judicial reforms. Lapid warns of a bo…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modis-visit-getting-entangled-in-israels-domestic-politics/articleshow/128675286.cms",
    "timestamp": "2026-02-22T11:44:42Z"
  },
  {
    "title": "Iran and US views on sanctions relief differ, Iranian official tells Reuters",
    "description": "Iran and the United States are at odds over sanctions relief in ongoing nuclear talks. New discussions are scheduled for early March. Both nations are building military capabilities in the Middle East, increasing concerns about a wider conflict. Iran has thre…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-and-us-views-on-sanctions-relief-differ-iranian-official-tells-reuters/articleshow/128673842.cms",
    "timestamp": "2026-02-22T11:31:08Z"
  },
  {
    "title": "US Supreme Court ruling on tariffs: Why Emkay sees India as beneficiary amid Trump's flip-flops",
    "description": "The US Supreme Court struck down Trump’s IEEPA-based tariffs, prompting a recalibration of global trade. The Trump administration responded with a temporary 15% global tariff under Section 122, easing pressure on India and other emerging markets. Emkay estima…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-supreme-court-ruling-on-tariffs-why-emkay-sees-india-as-beneficiary-amid-trumps-flip-flops/articleshow/128674948.cms",
    "timestamp": "2026-02-22T11:30:35Z"
  },
  {
    "title": "Supreme Court wades into US-Cuba business disputes, with billions at stake",
    "description": "Feb 22 (Reuters) - The U.S. Supreme Court is set to explore legal questions ⁠arising from the fraught history of U.S.-Cuban relations when it considers the scope of a 1996 law that lets U.S. nationals seek compensation for property confiscated by the communis…",
    "link": "https://www.thestar.com.my/news/world/2026/02/22/supreme-court-wades-into-us-cuba-business-disputes-with-billions-at-stake",
    "timestamp": "2026-02-22T11:21:00Z"
  },
  {
    "title": "Uncertainty in Tehran amid US-Iran tensions as residents fear attack",
    "description": "Residents stock up on essentials and medications as anxieties over military threats intensify",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/22/uncertainty-in-tehran-amid-us-iran-tensions-as-residents-fear-attack/",
    "timestamp": "2026-02-22T11:20:13Z"
  },
  {
    "title": "Danish military evacuates US submariner who needed urgent medical care off Greenland",
    "description": "Denmark’s military says its arctic command forces evacuated a crew member of a U.S. submarine off the coast of Greenland for urgent medical treatment",
    "link": "https://abcnews.com/US/wireStory/danish-military-evacuates-us-submariner-needed-urgent-medical-130381436",
    "timestamp": "2026-02-22T11:17:42Z"
  },
  {
    "title": "USA SENDING HOSPITAL BOAT TO GREENLAND...",
    "description": "USA SENDING HOSPITAL BOAT TO GREENLAND...\r\n\n \n \n \n (Second column, 1st story, link)",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/trump-greenland-hospital-boat-b2925143.html",
    "timestamp": "2026-02-22T11:16:36Z"
  },
  {
    "title": "Starmer Is Toast. But the Dark Forces that Brought Him to Power Are as Strong as Ever",
    "description": "The political and media classes that once venerated Mandelson and are now cutting him adrift are the same ones that spent five years destroying Corbyn",
    "link": "https://www.middleeasteye.net/opinion/starmer-toast-dark-forces-brought-him-power-are-strong-ever",
    "timestamp": "2026-02-22T11:13:46Z"
  },
  {
    "title": "Danish military evacuates US submariner who needed urgent medical care off Greenland",
    "description": "Denmark's military says its arctic command forces evacuated a crew member of a U.S. submarine off the coast of Greenland for urgent medical treatment.",
    "link": "https://www.npr.org/2026/02/22/nx-s1-5722796/danish-military-evacuates-us-submariner-medical-care-greenland",
    "timestamp": "2026-02-22T11:08:48Z"
  },
  {
    "title": "Tariff ruling limits Trump's leverage but won't end uncertainty for trade partners",
    "description": "The US Supreme Court has limited President Trump's power to impose tariffs suddenly.  However, trade partners and companies still face uncertainty.  Trump has introduced new tariffs and investigations.  Experts believe his ability to use tariffs as a foreign …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tariff-ruling-limits-trumps-leverage-but-wont-end-uncertainty-for-trade-partners/articleshow/128674345.cms",
    "timestamp": "2026-02-22T11:08:26Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
    "description": "India’s benchmark indices ended higher on Friday, with Nifty rising 116.90 points to 25,571.25 and Sensex up 316.57 points to 82,814.71, despite IT stocks weighing on sentiment. Volatility remained elevated, with India VIX up 6.7%. Analysts expect the index t…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/128674326.cms",
    "timestamp": "2026-02-22T11:07:36Z"
  },
  {
    "title": "Markets to stay volatile next week on F&O expiry, Trump tariff decision: Analysts",
    "description": "Besides, the trading activity of foreign investors, developments between the US and Iran, movements in crude oil prices and global monetary signals will also guide market movement during the week",
    "link": "https://www.thehindubusinessline.com/markets/markets-to-stay-volatile-next-week-on-fo-expiry-trump-tariff-decision-analysts/article70663070.ece",
    "timestamp": "2026-02-22T11:05:09Z"
  },
  {
    "title": "'Eat your heart out, Marsha,' Newsom reply to GOP at Nashville event",
    "description": "Gov. Gavin Newsom, who many hope will be a Democratic presidential nominee in 2028, ties issues in blue California to red states like Tennessee.",
    "link": "https://www.tennessean.com/story/news/politics/2026/02/22/gov-gavin-newsom-finds-enthusiastic-crowd-in-nashville-after-gop-jabs/88797484007/",
    "timestamp": "2026-02-22T11:04:53Z"
  },
  {
    "title": "India delays U.S. trade talks after Supreme Court rejects Trump tariffs, source says",
    "description": "NEW DELHI, Feb ⁠22 (Reuters) - India has delayed plans to send a trade delegation to ⁠Washington this week, chiefly because of uncertainty after the U.S. Supreme ‌Court struck down tariffs imposed by President Donald Trump, a source in its trade ministry said…",
    "link": "https://www.thestar.com.my/news/world/2026/02/22/india-delays-us-trade-talks-after-supreme-court-rejects-trump-tariffs-source-says",
    "timestamp": "2026-02-22T11:01:00Z"
  },
  {
    "title": "Exclusive-Iran and US views on sanctions relief differ, Iranian official tells Reuters",
    "description": "DUBAI, Feb 22 (Reuters) - Iran and ⁠the United States have differing views over sanctions relief in talks to curb Tehran's nuclear ⁠ambitions, a senior Iranian official told Reuters on Sunday, adding that new talks were planned in ‌early March as fears of a m…",
    "link": "https://www.thestar.com.my/news/world/2026/02/22/exclusive-iran-and-us-views-on-sanctions-relief-differ-iranian-official-tells-reuters",
    "timestamp": "2026-02-22T11:00:00Z"
  },
  {
    "title": "Greenland does not need US hospital ship: Denmark",
    "description": "Greenland does not need medical assistance from other countries, Denmark's defense minister said on Feb. 22, after U.S. President Donald Trump claimed he was sending a hospital ship to the autonomous Danish territory that he covets.",
    "link": "https://www.hurriyetdailynews.com/greenland-does-not-need-us-hospital-ship-denmark-219203",
    "timestamp": "2026-02-22T10:49:09Z"
  },
  {
    "title": "Trump to send aid to Greenland for 'sick people not being taken care of' - Greenland says no thanks",
    "description": "It turns out access to healthcare is free in Greenland.",
    "link": "https://www.thejournal.ie/greenland-trump-3-6964358-Feb2026/",
    "timestamp": "2026-02-22T10:46:57Z"
  },
  {
    "title": "India delays US trade talks after Supreme Court rejects Trump tariffs: Source",
    "description": "NEW DELHI: India has delayed plans to send a trade delegation to Washington this week, chiefly because of uncertainty after the US Supreme Court struck down tariffs imposed by President Donald Trump, a sourc",
    "link": "https://www.channelnewsasia.com/asia/trade-talks-india-us-delay-supreme-court-rejects-trump-tariffs-5945396",
    "timestamp": "2026-02-22T10:38:49Z"
  },
  {
    "title": "Somaliland minister says US may access its minerals, military bases: Report",
    "description": "Minister of the presidency says exclusive rights offered to US are part of Somaliland's push for global recognition.",
    "link": "https://www.aljazeera.com/news/2026/2/22/somaliland-minister-says-us-may-access-its-minerals-military-bases-report",
    "timestamp": "2026-02-22T10:33:56Z"
  },
  {
    "title": "Here are the billionaires running for governor across the US this year",
    "description": "From Ohio to Georgia to California, here are the billionaires who are running for their state's top office.",
    "link": "https://www.businessinsider.com/list-billionaires-running-governor-georgia-california-ohio-2026-2",
    "timestamp": "2026-02-22T10:29:01Z"
  },
  {
    "title": "Greenland says 'no thanks' to Trump's 'great hospital boat'",
    "description": "The US president said a vessel was \"on the way\" to Greenland, with the move coming amid a rift between the US and Europe over control of the island. Greenland and Denmark hit back, saying no medical help is needed.",
    "link": "https://www.dw.com/en/greenland-says-no-thanks-to-trumps-great-hospital-boat/a-76076414",
    "timestamp": "2026-02-22T10:27:00Z"
  },
  {
    "title": "Iranian students stage protests as Khamenei drafts emergency plans",
    "description": "Iranian students chanted anti-government slogans and scuffled with counter-protesters on the first day of the new academic term, with Iranian Supreme Leader Ali Khamenei reportedly preparing for assassination scenarios and naming multiple layers of successors…",
    "link": "https://www.hurriyetdailynews.com/iranian-students-stage-protests-as-khamenei-drafts-emergency-plans-219198",
    "timestamp": "2026-02-22T10:22:19Z"
  },
  {
    "title": "Greenland does not need US hospital ship: Danish minister",
    "description": "Greenland does not need medical assistance from other countries, Denmark's defence minister said, after US President Donald Trump claimed he was sending a hospital ship to the autonomous Danish territory.",
    "link": "https://www.rte.ie/news/world/2026/0222/1559786-us-denmark-greenland/",
    "timestamp": "2026-02-22T10:21:49Z"
  },
  {
    "title": "India delays Washington trade visit as U.S. tariff policy shifts, source tells CNBC",
    "description": "The negotiators want to 'evaluate the latest developments', the source says, following the U.S.'s move to raise its global import tariffs to 15% from 10%.",
    "link": "https://www.cnbc.com/2026/02/22/trump-tariffs-india-trade-deal.html",
    "timestamp": "2026-02-22T10:20:25Z"
  },
  {
    "title": "Governor bans Kid Rock from his state: ‘Not what you want around our children!’",
    "description": "Governor bans Kid Rock from his state: ‘Not what you want around our children!’pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2026/02/governor-bans-kid-rock-from-his-state-not-what-you-want-around-our-children.html",
    "timestamp": "2026-02-22T10:06:01Z"
  },
  {
    "title": "WATCH: Top 5 most memorable moments in American State of the Union history",
    "description": "Trump's upcoming State of the Union address could spark viral moments like Reagan's guest acknowledgment, Pelosi tearing up Trump's speech, and Biden's exchanges.",
    "link": "https://www.foxnews.com/politics/watch-top-5-most-memorable-moments-american-state-union-history",
    "timestamp": "2026-02-22T10:00:45Z"
  },
  {
    "title": "All About the White House UFC Fight on Trump’s Birthday",
    "description": "All about the White House UFC fight on Trump’s birthday. The UFC is holding a cage match on the South Lawn to celebrate America’s 250th birthday (or maybe Trump’s 80th). Here’s what we know about the planning, tickets, the fight card, and how to watch.",
    "link": "http://nymag.com/intelligencer/article/white-house-ufc-fight-trump-birthday.html",
    "timestamp": "2026-02-22T10:00:26Z"
  },
  {
    "title": "Singapore to seek clarity from US counterparts on implementation of Trump’s new 15% tariff",
    "description": "Singapore will also seek further details on the process for potential tariff refunds. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/singapore-to-seek-clarity-from-us-counterparts-on-implementation-of-trumps-new-15-tariff",
    "timestamp": "2026-02-22T10:00:00Z"
  },
  {
    "title": "New 15% US tariff likely to apply to Singapore, says DPM Gan Kim Yong",
    "description": "Singapore is seeking clarity from Washington on implementation details, including whether processes for tariff refunds will be put in place.",
    "link": "https://www.channelnewsasia.com/singapore/new-us-tariff-apply-singapore-trump-gan-kim-yong-5945361",
    "timestamp": "2026-02-22T10:00:00Z"
  },
  {
    "title": "The Saturday Wrap-Up - TRUMP NAMED THEM: The Real \"Foreign Interests\" - February 21, 2026",
    "description": "The Supreme Court tried to disarm Trump's tariff revolution. Treasury Sec. Bessent declared Hamilton's system the foundation of sovereignty. Meanwhile, 60 nations answered Trump's call at the Board of Peace. One system is dying. Another is born. Susan Kokinda…",
    "link": "https://freerepublic.com/focus/f-bloggers/4367832/posts",
    "timestamp": "2026-02-22T09:58:55Z"
  },
  {
    "title": "Trump sues JP Morgan Chase for 5 billion for debanking him following Jan. 6",
    "description": "Conservatives are furious that JPMorgan Chase closed Donald Trump's personal and business bank accounts following the January 6 attack on the Capitol in 2021. Chase, America's largest bank by assets, was forced to admit closing the accounts after Trump launch…",
    "link": "https://freerepublic.com/focus/f-news/4367830/posts",
    "timestamp": "2026-02-22T09:43:28Z"
  },
  {
    "title": "Critical Hours in the Middle East: Why an attack on Iran is far riskier than the arrest of Maduro",
    "description": "Trump had in mind a copy-paste operation like the one in Venezuela; however, in Iran the situation is very different. Tehran has ways to retaliate, possesses regional partners ready to strike, the regime is deeply entrenched, and it knows how to play the econ…",
    "link": "https://en.protothema.gr/2026/02/22/critical-hours-in-the-middle-east-why-an-attack-on-iran-is-far-riskier-than-the-arrest-of-maduro/",
    "timestamp": "2026-02-22T09:30:31Z"
  },
  {
    "title": "Arab nations condemn US ambassador's Israel remarks",
    "description": "Multiple Arab nations have condemned the US ambassador to Israel after he said \"it would be fine\" if Tel Aviv took control of almost all of the Middle East.",
    "link": "https://news.sky.com/story/us-ambassador-mike-huckabee-sparks-backlash-from-arab-nations-with-israel-remarks-13510686",
    "timestamp": "2026-02-22T09:30:00Z"
  },
  {
    "title": "Willie Colón, architect of urban salsa music, dies at 75",
    "description": "Willie Colón’s family and manager confirmed his death through social media posts.",
    "link": "https://indianexpress.com/article/entertainment/hollywood/willie-colon-architect-of-urban-salsa-music-dies-at-75-10545797/",
    "timestamp": "2026-02-22T09:25:55Z"
  },
  {
    "title": "60% disapprove of Trump ahead of State of the Union, Post-ABC poll finds (Washington Post)",
    "description": "Washington Post:\n60% disapprove of Trump ahead of State of the Union, Post-ABC poll finds  —  Democrats have made little headway in persuading Americans that they have better ideas or policies to offer.  —  As President Donald Trump prepares to address the na…",
    "link": "https://www.memeorandum.com/260222/p1",
    "timestamp": "2026-02-22T09:25:01Z"
  },
  {
    "title": "Wall Street week ahead: Nvidia, software reports pose next tests for AI-sensitive stock market",
    "description": "Investors turn to financial results from artificial intelligence bellwether Nvidia Corp in the coming week to steady a U.S. stock market ​that has been rocked by AI-related worries and is digesting a Supreme Court overturn of President Donald Trump's sweeping…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/wall-street-week-ahead-nvidia-software-reports-pose-next-tests-for-ai-sensitive-stock-market/articleshow/128671665.cms",
    "timestamp": "2026-02-22T09:21:24Z"
  },
  {
    "title": "America's hottest NIMBY issue: Data centers",
    "description": "As politicians can't ignore data centers anymore, everyone from Bernie Sanders to Ron DeSantis is turning against them.",
    "link": "https://www.businessinsider.com/americas-hottest-nimby-issue-data-centers-sanders-desantis-2026-2",
    "timestamp": "2026-02-22T09:13:01Z"
  },
  {
    "title": "Trump sending hospital ship to Greenland ‘to care for the sick’",
    "description": "US President Donald Trump has said he is sending a hospital ship to Greenland Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632886-trump-greenland-hospital-ship/",
    "timestamp": "2026-02-22T09:08:07Z"
  },
  {
    "title": "Iran, U.S. diverge on sanctions relief: Iranian official tells Reuters",
    "description": "Tehran can consider exporting part of its uranium stockpile, a senior Iranian official tells Reuters.",
    "link": "https://www.cnbc.com/2026/02/22/iran-us-diverge-on-sanctions-relief-iranian-official-tells-reuters.html",
    "timestamp": "2026-02-22T09:07:49Z"
  },
  {
    "title": "Iranian Official Says Indirect Talks With US Expected in Early March - Reports",
    "description": "MOSCOW (Sputnik) - A senior Iranian official said that indirect talks between Iran and the US are expected in early March, Reuters reported on Sunday.",
    "link": "https://sputnikglobe.com/20260222/iranian-official-says-indirect-talks-with-us-expected-in-early-march---reports-1123670065.html",
    "timestamp": "2026-02-22T09:02:05Z"
  },
  {
    "title": "US Troops in Middle East Being Redeployed for New Missions, Not Evacuated - Reports",
    "description": "MOSCOW (Sputnik) - Hundreds of US troops stationed at military bases in Qatar and Bahrain have been redeployed for other missions and operations, not evacuated, the New York Times reported.",
    "link": "https://sputnikglobe.com/20260222/us-troops-in-middle-east-being-redeployed-for-new-missions-not-evacuated---reports-1123669952.html",
    "timestamp": "2026-02-22T09:00:09Z"
  },
  {
    "title": "Syrian Canadians waited years to return. For many, coming home has been harder than leaving",
    "description": "It's been a little over a year since the fall of Bashar al-Assad in Syria ended a 14-year civil war. More than 1.3 million Syrians have returned home since then, according to the UN refugee agency, primarily from neighbouring countries such as Turkey, Lebanon…",
    "link": "https://www.cbc.ca/news/world/syria-canadian-return-home-9.7094102",
    "timestamp": "2026-02-22T09:00:00Z"
  },
  {
    "title": "Why Kate Barr is campaigning in North Carolina as a 'fake Republican'",
    "description": "Kate Barr, a progressive, is attempting to become the Republican candidate for Congress in North Carolina’s 14th district, a conservative stronghold.",
    "link": "https://www.cbc.ca/news/world/fake-republican-kate-barr-9.7095820",
    "timestamp": "2026-02-22T09:00:00Z"
  },
  {
    "title": "Minnesota Democrats should pay ‘reparations’ – Vance",
    "description": "US Vice President J.D. Vance has urged Minnesota Democrats to pay “reparations” for the alleged Somali-linked fraud schemes Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632885-vance-demands-reparations-for-somali/",
    "timestamp": "2026-02-22T08:49:18Z"
  },
  {
    "title": "DHS suspends TSA PreCheck, Global Entry as partial government shutdown continues",
    "description": "TSA PreCheck and Global Entry services suspended starting Sunday due to government shutdown affecting Department of Homeland Security operations.",
    "link": "https://www.foxnews.com/politics/dhs-suspends-tsa-precheck-global-entry-partial-government-shutdown-continues",
    "timestamp": "2026-02-22T08:47:33Z"
  },
  {
    "title": "Jairam Ramesh defends Rahul Gandhi, slams Kiren Rijiju’s ‘security’ charge",
    "description": "Congress leader Jairam Ramesh defended Rahul Gandhi. He stated Gandhi is a responsible parliamentarian. Ramesh refuted Union Minister Kiren Rijiju's claims. Rijiju alleged Gandhi is dangerous for India's security. Ramesh highlighted Gandhi raising national se…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/jairam-ramesh-defends-rahul-gandhi-slams-kiren-rijijus-security-charge/articleshow/128670819.cms",
    "timestamp": "2026-02-22T08:44:49Z"
  },
  {
    "title": "DHS agent killed US citizen in March last year, records reveal",
    "description": "Texas shooting appears to be ​the first known instance of US citizen being killed during Trump's immigration crackdown.",
    "link": "https://www.aljazeera.com/news/2026/2/22/dhs-agent-killed-us-citizen-in-march-last-year-records-reveal",
    "timestamp": "2026-02-22T08:38:02Z"
  },
  {
    "title": "Letters to the editor",
    "description": "Herald readers sound off on \"Trump Derangement Syndrome,\" Puerto Rico's power blackouts, and calls for voter ID.",
    "link": "https://www.bostonherald.com/2026/02/22/letters-to-the-editor-760/",
    "timestamp": "2026-02-22T08:37:57Z"
  },
  {
    "title": "India pauses its trade team visit to evaluate US Supreme Court tariff ruling",
    "description": "Negotiators likely to recalibrate position as experts warn proposed deal may now be more burdensome than the new global 15% tariff",
    "link": "https://www.thehindubusinessline.com/economy/india-us-to-reschedule-chief-negotiators-meet-on-interim-trade-deal-sources/article70662596.ece",
    "timestamp": "2026-02-22T08:32:42Z"
  },
  {
    "title": "Xi Gains Upper Hand Before Trump Summit After US Tariff Reversal",
    "description": "Chinese President Xi Jinping is heading to the negotiating table with Donald Trump with a boost in bargaining power, after the US leader lost his ability to quickly raise tariffs for nearly any reason.",
    "link": "https://financialpost.com/pmn/business-pmn/xi-gains-upper-hand-before-trump-summit-after-us-tariff-reversal",
    "timestamp": "2026-02-22T08:16:52Z"
  },
  {
    "title": "Trump sending 'great hospital boat' to Greenland",
    "description": "The US president, who wants to acquire the semi-autonomous Danish territory, says a vessel is \"on the way\", though it is unclear if the help was requested.",
    "link": "https://news.sky.com/story/trump-sending-great-hospital-boat-to-greenland-to-take-care-of-the-sick-13510664",
    "timestamp": "2026-02-22T08:09:00Z"
  },
  {
    "title": "Trump says he is sending a hospital ship to Greenland",
    "description": "U.S. President Donald Trump on Saturday said he was working with Louisiana Governor Jeff Landry to send a hospital boat to Greenland, a Danish territory that Trump has said he wants to acquire",
    "link": "https://www.nbcnews.com/world/greenland/trump-sending-hospital-ship-greenland-rcna260132",
    "timestamp": "2026-02-22T07:57:24Z"
  },
  {
    "title": "JPMorgan concedes it closed Trump's accounts after Jan 6 attack",
    "description": "Donald Trump's accounts were debanked - this occurs when a bank closes the accounts of a customer or refuses to do business with a customer in the form of loans or other services.",
    "link": "https://www.channelnewsasia.com/world/bank-jpmorgan-concedes-close-donald-trump-account-after-jan-6-attack-5945346",
    "timestamp": "2026-02-22T07:53:41Z"
  },
  {
    "title": "US trade deal proof of ' Abki baar Trump se haar': Congress' swipe at govt",
    "description": "Congress has criticized the interim US trade deal. The party demands renegotiation of the agreement. They want the clause on import liberalization, especially for agricultural products, to be scrapped. Congress believes the deal is one-sided and detrimental t…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/us-trade-deal-proof-of-abki-baar-trump-se-haar-congress-swipe-at-govt/articleshow/128669747.cms",
    "timestamp": "2026-02-22T07:52:39Z"
  },
  {
    "title": "Donald Trump Calls On Netflix To Fire Board Member Susan Rice Or “Pay The Consequences” - Deadline",
    "description": "Donald Trump Calls On Netflix To Fire Board Member Susan Rice Or “Pay The Consequences”Deadline Trump Threatens Netflix With ‘Consequences’ Over Rice Board SeatBloomberg.com Susan Rice predicts ‘accountability agenda’ when Democrats are back in powerThe Hill …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180841732",
    "timestamp": "2026-02-22T07:52:15Z"
  }
]