[
  {
    "title": "Trump Calls Colombian President Gustavo Petro, Invites Him to White House During Petro's Anti-Trump Rally",
    "description": "President Donald Trump revealed on Wednesday evening that he held a conversation with radical Marxist Colombian President Gustavo Petro and invited him to the White House — while an anti-Trump protest organized by Petro was underway in Bogotá.\nThe post Trump …",
    "link": "https://www.breitbart.com/latin-america/2026/01/08/trump-calls-colombian-president-gustavo-petro-invites-him-to-white-house-during-petros-anti-trump-rally/",
    "timestamp": "2026-01-08T15:51:25Z"
  },
  {
    "title": "Defense Stocks Soar Again as Trump Plans Military Budget Boost (Lisa Pham/Bloomberg)",
    "description": "Lisa Pham / Bloomberg:\nDefense Stocks Soar Again as Trump Plans Military Budget Boost  —  President Donald Trump's plans to request an increase in the US military budget is giving a fresh boost to defense stocks around the world, with those in Europe having a…",
    "link": "https://www.memeorandum.com/260108/p51",
    "timestamp": "2026-01-08T15:50:01Z"
  },
  {
    "title": "Trump’s Hobbesian World Order",
    "description": "With its Venezuela operation, the US has effectively given China an open invitation to invade Taiwan, vindicated Russia’s invasion of Ukraine, and set the stage for more illegal US military actions. Large and rising powers – such as Germany, India, and Japan …",
    "link": "https://www.project-syndicate.org/commentary/us-attack-on-venezuela-implies-a-shift-toward-hobbesian-power-politics-by-shlomo-ben-ami-2026-01",
    "timestamp": "2026-01-08T15:49:16Z"
  },
  {
    "title": "El orden mundial hobbesiano de Trump",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/us-attack-on-venezuela-implies-a-shift-toward-hobbesian-power-politics-by-shlomo-ben-ami-2026-01/spanish",
    "timestamp": "2026-01-08T15:49:16Z"
  },
  {
    "title": "Jesse Watters: Woman ICE Killed Had 'Pronouns In Her Bio!'",
    "description": "Jesse Bailey Watters, who has genderfluid names (since he's being judgy, we can be petty), and divorced his first wife over his affair with a younger Fox News employee, Emma DiGiovine, who later became his second wife, and wonders if he's adopted since his mo…",
    "link": "https://crooksandliars.com/2026/01/jesse-watters-woman-ice-killed-had",
    "timestamp": "2026-01-08T15:49:00Z"
  },
  {
    "title": "US Trade Gap Shrinks to Smallest Since 2009 on Imports Drop",
    "description": "The US trade deficit unexpectedly narrowed in October to the smallest since 2009 on a sharp pullback in imports, notably pharmaceuticals.",
    "link": "https://financialpost.com/pmn/business-pmn/us-trade-gap-shrinks-to-smallest-since-2009-on-imports-drop",
    "timestamp": "2026-01-08T15:48:40Z"
  },
  {
    "title": "Two Pune engineering firms - KPIT and Persistent - are the stars of India’s tech services business",
    "description": "Their shares have surged 700% in the last five years, when those of the biggest IT services companies have risen less than 30%; these two companies are showing the path to a new model of growth",
    "link": "https://timesofindia.indiatimes.com/technology/times-techies/two-pune-engineering-firms-kpit-and-persistent-are-the-stars-of-indias-tech-services-business/articleshow/126417630.cms",
    "timestamp": "2026-01-08T15:48:39Z"
  },
  {
    "title": "Will the SCOTUS ruling on Trump tariffs jolt markets? What to know as the case comes up tomorrow",
    "description": "Trump tariff ruling impact on markets: Investors are on edge as the US Supreme Court prepares to rule on President Trump's emergency tariff powers. The decision, expected soon, could significantly impact stocks and bonds. A ruling against the tariffs might bo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-the-scotus-ruling-on-trump-tariffs-jolt-markets-what-to-know-as-the-case-comes-up-tomorrow/articleshow/126417820.cms",
    "timestamp": "2026-01-08T15:48:05Z"
  },
  {
    "title": "FNC's Ingraham: MN Democrats 'Will Incite More Violence, Especially Against ICE Agents'",
    "description": "Wednesday during her show's opening monologue, FNC's \"The Ingraham Angle\" host Laura Ingraham warned that overheated rhetoric from Minnesota Democrats could cause more violence, especially aimed at Immigration and Customs Enforcement (ICE) agents.\nThe post FN…",
    "link": "https://www.breitbart.com/clips/2026/01/08/fncs-ingraham-mn-democrats-will-incite-more-violence-especially-against-ice-agents/",
    "timestamp": "2026-01-08T15:47:36Z"
  },
  {
    "title": "America chases down the shadow fleet serving Venezuela",
    "description": "Donald Trump is determined to enforce its oil blockade",
    "link": "https://biztoc.com/x/c9d19897d17391e5",
    "timestamp": "2026-01-08T15:46:28Z"
  },
  {
    "title": "Trump pulls US from key climate pact, other bodies",
    "description": "The White House removed dozens of organizations from US participation",
    "link": "https://theweek.com/politics/trump-pulls-us-key-climate-pact",
    "timestamp": "2026-01-08T15:46:19Z"
  },
  {
    "title": "The Trump administration is making America healthy again | Opinion",
    "description": "America is in a chronic health crisis and must return to the basics of nutrition.",
    "link": "https://www.newsweek.com/the-trump-administration-is-making-america-healthy-again-opinion-11330028",
    "timestamp": "2026-01-08T15:46:02Z"
  },
  {
    "title": "GOP lawmakers call on Trump to arrest Walz after governor warns of National Guard move",
    "description": "Gov. Tim Walz threatens to deploy National Guard against federal ICE operations, prompting Rep. Mary Miller and Republicans to demand Trump use the Insurrection Act.",
    "link": "https://www.foxnews.com/politics/gop-lawmakers-call-trump-arrest-walz-after-governor-warns-national-guard-move",
    "timestamp": "2026-01-08T15:46:01Z"
  },
  {
    "title": "US trade gap shrinks to smallest since 2009 as imports fall",
    "description": "The US trade deficit made a sharp and unexpected pullback in October, reaching its lowest level since 2009 as goods imports dropped while President Donald Trump's tariffs took hold, government data showed Thursday.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-trade-gap-shrinks-to-smallest-since-2009-as-imports-fall/articleshow/126418082.cms",
    "timestamp": "2026-01-08T15:45:56Z"
  },
  {
    "title": "Why Trump's Exit from Pivotal Climate Treaty Matters",
    "description": "In the latest effort to undermine climate action, President Trump pulled the U.S. out of the U.N. Framework Convention on Climate Change, which underpins global efforts to address rising temperatures",
    "link": "https://subscriber.politicopro.com/article/eenews/2026/01/07/trump-quits-1992-climate-treaty-00487331",
    "timestamp": "2026-01-08T15:45:00Z"
  },
  {
    "title": "ICE agent was not in the vehicle's path when he fired at driver, video shows (Washington Post)",
    "description": "Washington Post:\nICE agent was not in the vehicle's path when he fired at driver, video shows  —  An analysis of video footage raises questions about claims by President Donald Trump and Homeland Security Secretary Kristi L. Noem about the fatal shooting in M…",
    "link": "https://www.memeorandum.com/260108/p50",
    "timestamp": "2026-01-08T15:45:00Z"
  },
  {
    "title": "Newsom will punch back at California critics in his final State of the State speech",
    "description": "California Gov. Gavin Newsom is set to deliver his final State of the State address to lawmakers in Sacramento on Thursday.",
    "link": "https://www.kpbs.org/news/politics/2026/01/08/newsom-will-punch-back-at-california-critics-in-his-final-state-of-the-state-speech",
    "timestamp": "2026-01-08T15:44:55Z"
  },
  {
    "title": "EXCLUSIVE: Three Worst Republicans On Key Affordability Policy According To New Study",
    "description": "A new scorecard from energy nonprofit Power the Future (PTF) shows how Congress performed on energy policy.",
    "link": "https://dailycaller.com/2026/01/08/exclusive-worst-republicans-affordability-energy-democrat-votes-gop/",
    "timestamp": "2026-01-08T15:41:01Z"
  },
  {
    "title": "Mayor Who Told Trump ICE Force to ‘Get The F*ck Out’ Defiantly Calls Critics ‘Disney Princesses’",
    "description": "Mayor Jacob Frey (D-MN) slammed critics when Kaitlan Collins confronted him for telling Trump's deportation forces to \"get the f*ck out\" of his city.\nThe post Mayor Who Told Trump ICE Force to ‘Get The F*ck Out’ Defiantly Calls Critics ‘Disney Princesses’ fir…",
    "link": "https://www.mediaite.com/media/news/mayor-who-told-trump-ice-force-to-get-the-fck-out-defiantly-calls-critics-disney-princesses/",
    "timestamp": "2026-01-08T15:40:36Z"
  },
  {
    "title": "Western troops in Ukraine would amount to ‘foreign intervention’ – Moscow",
    "description": "Moscow will treat any Western troop deployment in Ukraine as a “foreign intervention,” Maria Zakharova has warned Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630729-western-troops-ukraine-intervention/",
    "timestamp": "2026-01-08T15:39:50Z"
  },
  {
    "title": "ICE kills woman during Minneapolis protest",
    "description": "The 37-year-old woman appeared to be driving away when she was shot",
    "link": "https://theweek.com/crime/ice-kills-woman-minneapolis-protest",
    "timestamp": "2026-01-08T15:38:57Z"
  },
  {
    "title": "Barron Trump 'Marriage Proposal' Turns Heads",
    "description": "A proposal of a proposal, so to speak, has gone viral online. A post, from a political satire account on X, suggesting that Barron Trump, the youngest son of President Donald Trump, marry Princess Isabella of Denmark, and Greenland be given to America as a “d…",
    "link": "https://biztoc.com/x/333a82c8a76d530e",
    "timestamp": "2026-01-08T15:35:38Z"
  },
  {
    "title": "More Than 1,000 Companies Are Suing Trump Over His Tariffs (Bloomberg)",
    "description": "Bloomberg:\nMore Than 1,000 Companies Are Suing Trump Over His Tariffs  —  Companies are flocking to challenge the administration's import taxes in court, after the Supreme Court started asking tough questions  —  With the US Supreme Court poised to decide the…",
    "link": "https://www.memeorandum.com/260108/p48",
    "timestamp": "2026-01-08T15:35:01Z"
  },
  {
    "title": "Trump’s Oil Grab Could Lead to More Violence in Venezuela",
    "description": "Experts warn that Venezuela is primed for insurgent violence, and that the U.S. has little hope of controlling the fallout of Maduro’s ouster",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-venezuela-oil-grab-violence-1235495953/",
    "timestamp": "2026-01-08T15:35:00Z"
  },
  {
    "title": "Russian drone strikes cause major blackouts in two regions of Ukraine",
    "description": "Russian drone strikes have knocked out power in Ukraine's Zaporizhzhia region and left over 600,000 households in Dnipropetrovsk without electricity",
    "link": "https://abcnews.go.com/International/wireStory/russian-drone-strikes-cause-major-blackouts-regions-ukraine-129019945",
    "timestamp": "2026-01-08T15:34:02Z"
  },
  {
    "title": "Reporter's Notebook: House attempts to override Trump vetoes on Colorado water project, Florida Everglades",
    "description": "House moves to override Trump vetoes on bipartisan Colorado water project and Florida Everglades bill that both passed unanimously in both chambers.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-house-attempts-override-trump-vetoes-colorado-water-project-florida-everglades",
    "timestamp": "2026-01-08T15:33:33Z"
  },
  {
    "title": "„Get the Fuck Out of Minneapolis“",
    "description": "In Minneapolis, Renee Nicole Good, a 37-year-old U.S. citizen, has been fatally shot by an immigration agent.",
    "link": "https://fm4.orf.at/stories/3051746/",
    "timestamp": "2026-01-08T15:33:00Z"
  },
  {
    "title": "JD Vance predicts ‘dumbest’ of Gavin Newsom, Kamala Harris will win 2028 Dem nomination",
    "description": "Vice President JD Vance sized up some of his potential Democratic competition in 2028 and mused that his predecessor, Kamala Harris, is likely on a collision course with California Gov. Gavin Newsom.",
    "link": "https://nypost.com/2026/01/08/us-news/jd-vance-predicts-dumbest-of-gavin-newsom-kamala-harris-will-win-2028-dem-nomination/",
    "timestamp": "2026-01-08T15:32:14Z"
  },
  {
    "title": "EU Preparing for Possible Direct Confrontation with Trump — Newspaper",
    "description": "European governments now understand the seriousness of Trump's threats and are \"desperately looking for a plan to stop him\"BRUSSELS, January 8. /TASS/. Amid US President Donald Trump's increasingly harsh rhetoric about establishing control over Greenland, the…",
    "link": "https://freerepublic.com/focus/f-news/4361021/posts",
    "timestamp": "2026-01-08T15:31:58Z"
  },
  {
    "title": "Renee Nicole Good: Trump Smears Fatal ICE Shooting Victim, Mayor Jacob Frey Orders ICE To ‘Get The F Out Of Minneapolis!’",
    "description": "ICE fatally shot Renee Nicole Good, a mom of three, yesterday morning in Minneapolis, Minnesota, just a few blocks from where former police officer Derek Chauvin murdered George Floyd. The response to Good’s unwarranted killing has been similar in that thousa…",
    "link": "https://bossip.com/4249357/renee-nicole-good-killed-by-ice/",
    "timestamp": "2026-01-08T15:30:49Z"
  },
  {
    "title": "Renee Nicole Good: Trump Smears Fatal ICE Shooting Victim, Mayor Jacob Frey Orders ICE To ‘Get The F Out Of Minneapolis!’",
    "description": "ICE fatally shot Renee Nicole Good, a mom of three, yesterday morning in Minneapolis, Minnesota, just a few blocks from where former police officer Derek Chauvin murdered George Floyd. The response to Good’s unwarranted killing has been similar in that thousa…",
    "link": "https://bossip.com/4249357/renee-nicole-good-killed-by-ice-minneapolis/",
    "timestamp": "2026-01-08T15:30:49Z"
  },
  {
    "title": "‘A lot of anxiety’: Top senators fear Trump is serious about grabbing Greenland",
    "description": "WASHINGTON — Greenland’s the talk of the town, which even has many Republicans nervous.“The rhetoric going on now is irresponsible,” Sen. Thom Tillis (R-NC) told Raw Story. The rhetoric — including the White House declaring “all options” are on the table when…",
    "link": "https://www.rawstory.com/raw-investigates/a-lot-of-anxiety-top-senators-fear-trump-is-serious-about-grabbing-greenland/",
    "timestamp": "2026-01-08T15:30:41Z"
  },
  {
    "title": "Queens reacts to Maduro’s capture",
    "description": "Nicolás Maduro, the president of Venezuela, and his wife were captured by the United States during airstrikes and a raid there Jan. 3. Delcy Rodr’guez, Maduro’s vice president, has been sworn in as the country’s interim leader. President Trump said…",
    "link": "https://www.qchron.com/editions/queenswide/queens-reacts-to-maduro-s-capture/article_71adfa51-3d1a-5f35-b2a6-35615f872d85.html",
    "timestamp": "2026-01-08T15:30:00Z"
  },
  {
    "title": "Lebanese army says it has taken over security in Hezbollah-dominated south",
    "description": "The army says it has met its goal of clearing the area of non-state weapons but Israel calls the move \"insufficient\".",
    "link": "https://www.bbc.com/news/articles/cj4ln977w0jo",
    "timestamp": "2026-01-08T15:29:06Z"
  },
  {
    "title": "Breaking: Agitators Flock to Minneapolis Federal Building, Clash with ICE Officers",
    "description": "The chaotic gathering followed a Wednesday incident in which a woman was shot to death after she attempted to run over an ICE agent.",
    "link": "https://www.westernjournal.com/breaking-agitators-flock-minneapolis-federal-building-clash-ice-officers/",
    "timestamp": "2026-01-08T15:27:51Z"
  },
  {
    "title": "Who was Renee Nicole Good, the woman killed by ICE?",
    "description": "The woman shot dead by a federal immigration agent in Minneapolis has been identified as Renee Nicole Good, a 37-year-old mother of three who had just moved to the city. She was a prize-winning poet and a hobby guitarist, who was there as a legal observer of …",
    "link": "https://freerepublic.com/focus/f-news/4361018/posts",
    "timestamp": "2026-01-08T15:27:35Z"
  },
  {
    "title": "J.D. Vance Insists Critics Are ‘Gaslighting.’ Video of ICE Shooting Reveals He Is.",
    "description": "J.D. Vance says critics are “gaslighting” over the ICE shooting. Verified video shows the officer stepped clear before firing, undermining a self-defense claim.\nThe post J.D. Vance Insists Critics Are ‘Gaslighting.’ Video of ICE Shooting Reveals He Is. first …",
    "link": "https://www.mediaite.com/opinion/j-d-vance-says-critics-are-gaslighting-video-of-ice-shooting-shows-he-is/",
    "timestamp": "2026-01-08T15:26:26Z"
  },
  {
    "title": "Is California’s economy healthier than we think?",
    "description": "A dearth of economic data, thanks to last year’s federal government shutdown, makes reading the tea leaves of the business climate even trickier than usual.",
    "link": "https://www.ocregister.com/2026/01/08/is-californias-economy-healthier-than-we-think/",
    "timestamp": "2026-01-08T15:25:48Z"
  },
  {
    "title": "Patel says FBI investigating organizers, funders of anti-ICE protests for impeding law enforcement",
    "description": "FBI Director Kash Patel told Just the News on Thursday that his agents are investigating the organizers and funders of anti-immigration enforcement protests for impeding law enforcement activities and endangering public safety. \"The FBI is investigating paid …",
    "link": "https://freerepublic.com/focus/f-news/4361017/posts",
    "timestamp": "2026-01-08T15:25:17Z"
  },
  {
    "title": "Canada's share of exports to U.S. hit lowest level in decades in October",
    "description": "Exports to the U.S. slumped in October to their lowest level outside of the pandemic since 1997, while exports to countries other than the U.S. jumped in the same month. The shift comes after U.S. President Donald Trump imposed hefty tariffs on much of the wo…",
    "link": "https://www.cbc.ca/news/business/canada-trade-oct-2025-9.7037913",
    "timestamp": "2026-01-08T15:24:25Z"
  },
  {
    "title": "Trump’s nod to Bill threatening 500% tariff on India, China spooks markets",
    "description": "As fate of India-US trade deal hangs in balance, exporters anxiously await US Court verdict on sweeping global tariffs, seek diverse markets",
    "link": "https://www.thehindubusinessline.com/economy/trumps-nod-to-bill-threatening-500-tariff-on-india-china-spooks-markets/article70487365.ece",
    "timestamp": "2026-01-08T15:21:08Z"
  },
  {
    "title": "The Ugly Beast of American Authoritarianism",
    "description": "Sasha Abramsky\n\n\n\nMight is right is the philosophy behind the Trump administration’s decision to kidnap Nicolás Maduro.\r\n\n\r\n\n\nThe post The Ugly Beast of American Authoritarianism appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-miller-authoritarianism-imperialism-venezuela/",
    "timestamp": "2026-01-08T15:19:10Z"
  },
  {
    "title": "Members of military using force against Greenland without Congressional authorisation are following illegal orders: US Congressman",
    "description": "Under the US Constitution, Congress can declare war while the president serves as commander in chief.",
    "link": "https://indianexpress.com/article/world/military-using-force-against-greenland-without-congressional-authorisation-are-following-illegal-orders-10462716/",
    "timestamp": "2026-01-08T15:16:34Z"
  },
  {
    "title": "Tom Homan Takes CBS News’ Tony Dokoupil To Task For Asking ‘Where’s The Heart’ In Mass Deportations",
    "description": "Tom Homan pushed back hard when Tony Dokoupil asked him \"Where's the heart\" in Donald Trump's administrations deportations.",
    "link": "https://dailycaller.com/2026/01/08/tom-homan-takes-cbs-news-tony-dokoupil-to-task-for-asking-wheres-the-heart-in-mass-deportations/",
    "timestamp": "2026-01-08T15:16:28Z"
  },
  {
    "title": "Sam Harris and John McWhorter: Is wokeness dead?",
    "description": "In this shortish (23-minute) video, Sam Harris and John McWhorter discuss whether wokeness is finally dead.  The short answer is “nope.”  It may have lain down, but it refuses to die. The YouTube notes (there’s a transcript you can see as well): Sam Harris sp…",
    "link": "https://whyevolutionistrue.com/2026/01/08/sam-harris-and-john-mcwhorter-is-wokeness-dead/",
    "timestamp": "2026-01-08T15:15:34Z"
  },
  {
    "title": "US stock market today: Why S&P 500 and Nasdaq are down while Dow gains as defense stocks surge on Trump’s $1.5 trillion budget push",
    "description": "US stock market showed a sharp divide today, January 8, 2026. The Dow Jones rose 60.94 points to 49,057.02 as defense giants soared. However, the S&P 500 fell 0.25% and the Nasdaq dropped 0.93%. A massive $1.5 trillion defense budget proposal from President T…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-why-sp-500-and-nasdaq-are-down-while-dow-gains-as-defense-stocks-surge-on-trumps-1-5-trillion-budget-push/articleshow/126417595.cms",
    "timestamp": "2026-01-08T15:14:20Z"
  },
  {
    "title": "Global defense stocks advance after Trump calls for higher US military budget",
    "description": "Global defense stocks climbed on Thursday after ⁠President Donald Trump called for a substantial increase in the U.S. military budget, fueling a fresh rally amid ongoing geopolitical tensions.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-defense-stocks-advance-after-trump-calls-for-higher-us-military-budget/articleshow/126417721.cms",
    "timestamp": "2026-01-08T15:13:27Z"
  },
  {
    "title": "Trump's Plan for 30 Million Barrels of Venezuelan Oil Doesn't Add Up",
    "description": "Since deposing Nicolás Maduro and pledging to \"run\" his country, President Donald Trump has made it clear the U.S. will take a major role in Venezuela's oil production. Many of the details remain murky, but much of what has been revealed so far doesn't pass t…",
    "link": "https://biztoc.com/x/0fe8281704174777",
    "timestamp": "2026-01-08T15:13:02Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on war powers resolution to limit Trump after Venezuela raid",
    "description": "The war powers resolution would require President Donald Trump to get congressional approval before striking Venezuela again.",
    "link": "https://biztoc.com/x/9bafb97171ecabbe",
    "timestamp": "2026-01-08T15:13:00Z"
  },
  {
    "title": "U.S. is withdrawing from 66 international organizations, Trump memo reveals",
    "description": "U.S. President Donald Trump said on Wednesday that the United States would withdraw from dozens of international and U.N. entities, including a key climate treaty and a U.N. body that promotes gender equality and women’s empowerment, because they “operate con…",
    "link": "https://biztoc.com/x/81aca55fa5e966b0",
    "timestamp": "2026-01-08T15:12:53Z"
  },
  {
    "title": "Jim Harbaugh predicts brother's future in NFL next season: 'Just hope it's the NFC'",
    "description": "Los Angeles Chargers head coach Jim Harbaugh ruled out the idea that his brother John Harbaugh would take a year off, predicting he would lead another NFL team next season.",
    "link": "https://www.foxnews.com/sports/jim-harbaugh-predicts-brothers-future-nfl-next-season-just-hope-its-nfc",
    "timestamp": "2026-01-08T15:12:50Z"
  },
  {
    "title": "Russia slams Western peacekeeping plan for Ukraine",
    "description": "Russia on Thursday slammed a plan for European peacekeepers to be deployed to Ukraine as “dangerous”, branding Kyiv and its allies an “axis of war” and dousing hopes it could be a step towards ending the almost four-year-long war. US President Donald Trump ha…",
    "link": "https://www.digitaljournal.com/world/russia-slams-western-peacekeeping-plan-for-ukraine/article",
    "timestamp": "2026-01-08T15:12:20Z"
  },
  {
    "title": "Trump and JD Vance Warn You Can Expect to Die for Disobeying Orders",
    "description": "Donald Trump and JD Vance want you to know that not abiding federal agents may result in your death.Less than 24 hours after a federal immigration officer shot and killed 37-year-old Renee Good in Minneapolis, the vice president was already positing that the …",
    "link": "https://newrepublic.com/post/205062/donald-trump-jd-vance-deadly-force-reasonable-minnesota-ice-shooting",
    "timestamp": "2026-01-08T15:12:10Z"
  },
  {
    "title": "‘Only Time Will Tell’: Trump Says US Could Run Venezuela For Years",
    "description": "Trump told the New York Times that the U.S. could be running Venezuela for years after the administration captured the country's president on Saturday.",
    "link": "https://dailycaller.com/2026/01/08/donald-trump-venezuela-us-nicolas-maduro-control-country/",
    "timestamp": "2026-01-08T15:11:27Z"
  },
  {
    "title": "Top Republican with 'army' of supporters makes major campaign announcement as Shapiro launches re-elect",
    "description": "Desert Storm veteran Doug Mastriano bows out of 2026 Pennsylvania governor race but vows his conservative 'Walk as Free People' movement will continue.",
    "link": "https://www.foxnews.com/politics/top-pa-republican-army-supporters-makes-major-campaign-announcement-shapiro-launches-re-elect",
    "timestamp": "2026-01-08T15:10:41Z"
  },
  {
    "title": "They surrendered - We are selling Venezuela's oil - Control will last for several years - Trump tells the New York Times",
    "description": "US President Donald Trump revealed in a special discussion held in the Oval Office of the White House with the New York Times that Venezuela's governance has been brought completely under direct American supervision, and that this control will last not only f…",
    "link": "https://english.gossiplankanews.com/2026/01/they-surrendered-we-are-selling.html",
    "timestamp": "2026-01-08T15:10:35Z"
  },
  {
    "title": "Democratic strategist calls out party for 'oppose first, think later' response to Trump's capture of Maduro",
    "description": "Democratic strategist David Brock called out members of his party for condemning President Donald Trump's Venezuela operation that captured Nicolás Maduro.",
    "link": "https://www.foxnews.com/media/democratic-strategist-calls-out-party-oppose-first-think-later-response-trump-capture-maduro",
    "timestamp": "2026-01-08T15:09:46Z"
  },
  {
    "title": "'Jeopardy!' Host Ken Jennings Calls on Democrats to Prosecute Trump White House Staff 'At Every Level'",
    "description": "Ken Jennings, host of Jeopardy!, took to his Bluesky account on Wednesday and said any Democrat candidate who prosecutes \"former\" members of President | Entertainment",
    "link": "https://www.breitbart.com/entertainment/2026/01/08/jeopardy-host-ken-jennings-calls-on-democrats-to-prosecute-trump-white-house-staff-at-every-level/",
    "timestamp": "2026-01-08T15:07:55Z"
  },
  {
    "title": "Another day, another horror, another grim step in Trump's war on humanity itself",
    "description": "It seems appropriate right now to try to clarify one of the most basic questions America is (or should be) struggling with: What does it mean to be a human being?The confusion is mounting.Three illustrations:1. CorporationsCorporations are not human beings. T…",
    "link": "https://www.rawstory.com/ice-shooting-2674859753/",
    "timestamp": "2026-01-08T15:07:04Z"
  },
  {
    "title": "Trump, first lady set for Washington Trump–Kennedy Center premiere of ‘MELANIA’ ahead of global release",
    "description": "EXCLUSIVE: President Trump will attend the premiere of first lady Melania Trump’s film, “MELANIA\" at the Trump-Kennedy Center in Washington D.C. on Jan. 29, Fox News Digital has learned—just one of the twenty cities across the nation hosting events ahead of t…",
    "link": "https://www.foxnews.com/politics/trump-first-lady-set-washington-trump-kennedy-center-premiere-melania-ahead-global-release",
    "timestamp": "2026-01-08T15:05:26Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on war powers resolution to limit Trump after Venezuela raid",
    "description": "The war powers resolution would require President Donald Trump to get congressional approval before striking Venezuela again.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-expected-to-vote-on-war-powers-resolution-to-limit-trump-after-venezuela-raid",
    "timestamp": "2026-01-08T15:04:59Z"
  },
  {
    "title": "Trump's tariff fight at the Supreme Court could make for a messy refund battle for businesses",
    "description": "The Supreme Court is expected to issue rulings on Friday but, as is customary, has not said what case or cases will be acted upon. If they strike down Trump's tariffs, the U.S. could have to pay back billions — but companies, trade lawyers and customs brokers…",
    "link": "https://www.cbc.ca/news/business/trump-tariffs-supreme-court-9.7037813",
    "timestamp": "2026-01-08T15:03:40Z"
  },
  {
    "title": "Trump’s Adamant Defense of ICE Shooting Cracks on the Spot as He Watches Video With NYT Reporters",
    "description": "After reporters argued it was not clear an agent was struck by the car in witness video circulating online, Trump asked an aide to run it back.\nThe post Trump’s Adamant Defense of ICE Shooting Cracks on the Spot as He Watches Video With NYT Reporters first ap…",
    "link": "https://www.mediaite.com/media/news/trumps-adamant-defense-of-ice-shooting-cracks-on-the-spot-as-he-watches-video-with-nyt-reporters/",
    "timestamp": "2026-01-08T15:03:35Z"
  },
  {
    "title": "Texas Plato Massacre",
    "description": "It's the Platonic ideal of rightwing dickishness.",
    "link": "https://www.wonkette.com/p/texas-plato-massacre",
    "timestamp": "2026-01-08T15:02:48Z"
  },
  {
    "title": "French President Macron Slams US for Breaching International Law",
    "description": "French President Emmanuel Macron accused Washington of breaching international law and turning away from its partners days after the US captured and removed Venezuelan President Nicolás Maduro and threatened to take control of Greenland.",
    "link": "https://financialpost.com/pmn/business-pmn/french-president-macron-slams-us-for-breaching-international-law",
    "timestamp": "2026-01-08T15:02:37Z"
  },
  {
    "title": "‘Greenland 2: Migration’ Review: Good Post-Apocalyptic Thriller, Bad Movie About Greenland",
    "description": "Gerard Butler returns in an above-average sequel to the above-average 2020 sleeper about surviving a planet-wide disaster\nThe post ‘Greenland 2: Migration’ Review: Good Post-Apocalyptic Thriller, Bad Movie About Greenland appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/reviews/greenland-2-migration-review-gerard-butler/",
    "timestamp": "2026-01-08T15:00:00Z"
  },
  {
    "title": "After 2 straight losses, Democrat Stacey Abrams sits out 2026 race for Georgia governor",
    "description": "Stacey Abrams announces she won't seek Georgia governorship in 2026, choosing instead to focus on fighting authoritarianism under Trump's presidency.",
    "link": "https://www.foxnews.com/politics/after-two-straight-losses-democrat-stacey-abrams-sits-out-2026-race-georgia-governor",
    "timestamp": "2026-01-08T14:57:06Z"
  },
  {
    "title": "Seth Meyers Picks New Embarrassing Photo for Trump’s Next Presidential Portrait: ‘That’s a Real Picture!’ | Video",
    "description": "\"I think it's only fair,\" the NBC host jokes\nThe post Seth Meyers Picks New Embarrassing Photo for Trump’s Next Presidential Portrait: ‘That’s a Real Picture!’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/seth-meyers-trump-new-presidential-portrait-photo/",
    "timestamp": "2026-01-08T14:55:17Z"
  },
  {
    "title": "ICE Killed Another Person (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nICE Killed Another Person  —  Trump is lying about it  —  Donald Trump and his enablers constantly demand that we ignore what we see with our own eyes (e.g., Jan. 6 rioters, George Floyd's murder).  But video can set the recor…",
    "link": "https://www.memeorandum.com/260108/p43",
    "timestamp": "2026-01-08T14:55:00Z"
  },
  {
    "title": "Trump's Plan for 30 Million Barrels of Venezuelan Oil Doesn't Add Up",
    "description": "The plan is both light on specifics and full of contradictions.",
    "link": "https://reason.com/2026/01/08/trumps-plan-for-30-million-barrels-of-venezuelan-oil-doesnt-add-up/",
    "timestamp": "2026-01-08T14:54:32Z"
  },
  {
    "title": "Protesters in South Africa condemn US intervention in Venezuela, call for Maduro's release",
    "description": "Protesters have gathered outside the U.S. Embassy in South Africa to oppose U.S. intervention in Venezuela and the capture of former president Nicolas Maduro",
    "link": "https://abcnews.go.com/International/wireStory/protesters-south-africa-condemn-us-intervention-venezuela-call-129018136",
    "timestamp": "2026-01-08T14:53:56Z"
  },
  {
    "title": "Minneapolis shooting: One video, two opposite views before the facts are settled",
    "description": "In a polarised country, high-ranking officials offered starkly contrasting, accounts long before the facts could be established",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/07/us/minneapolis-ice-shooting-videos.html",
    "timestamp": "2026-01-08T14:53:07Z"
  },
  {
    "title": "ConocoPhillips and Exxon Look at Venezuela Role After Maduro Ouster, US Energy Boss Says",
    "description": "ConocoPhillips, Exxon Mobil Corp. and other US oil companies are examining what role they can play in helping revitalize Venezuela’s energy industry, US Energy Secretary Chris Wright said following talks with executives.",
    "link": "https://financialpost.com/pmn/business-pmn/conocophillips-and-exxon-look-at-venezuela-role-after-maduro-ouster-us-energy-boss-says",
    "timestamp": "2026-01-08T14:52:22Z"
  },
  {
    "title": "Polymarket user who won $400K on Maduro ouster bet quietly disappears",
    "description": "The Polymarket account that profited on Nicholas Maduro's capture and ouster as president is inaccessible, adding to concerns over insider trading allegations on prediction markets.",
    "link": "https://cointelegraph.com/news/polymarket-user-who-won-400k-on-maduro-ouster-bet-quietly-disappears",
    "timestamp": "2026-01-08T14:50:44Z"
  },
  {
    "title": "‘Slush fund’: Democrats push back against Trump’s plan to control Venezuelan oil sales",
    "description": "Late Tuesday, Donald Trump announced his intention to sell Venezuelan oil to create a massive pool of money that he can distribute at his own discretion. On Wednesday morning, the pushback began in earnest. The New York Times reported:\nPresident Trump’s decla…",
    "link": "https://biztoc.com/x/56d6deb0c931d528",
    "timestamp": "2026-01-08T14:50:28Z"
  },
  {
    "title": "Maharashtra: Thane Lok Adalat settles 3.07 lakh cases, awards total of Rs 754.85 crore compensation in 2025, says official",
    "description": "Thane: Lok Adalat in Maharashtra's Thane settled 3,07,255 cases and awarded compensation of Rs 754.85 crore in 2025, said an official on Thursday.A Lo.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/maharashtra-thane-lok-adalat-settles-3-07-lakh-cases-awards-total-of-rs-754-85-crore-compensation-in-2025-says-official/articleshow/126417425.cms",
    "timestamp": "2026-01-08T14:48:52Z"
  },
  {
    "title": "Mumbai pedestrian dies after being hit by storage door of bus, FIR registered",
    "description": "Mumbai: A 58-year-old pedestrian lost his life after being hit by the storage section door of a private bus at Dahisar (E) on Tuesday. Police have reg.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-pedestrian-dies-after-being-hit-by-storage-door-of-bus-fir-registered/articleshow/126417424.cms",
    "timestamp": "2026-01-08T14:48:51Z"
  },
  {
    "title": "US trade gap shrinks to smallest since 2009 as imports fall",
    "description": "The US trade deficit made a sharp and unexpected pullback in October, reaching its lowest level since 2009 as goods imports dropped while President Donald Trump’s tariffs took hold, government data showed Thursday. The overall trade gap plunged 39 percent to …",
    "link": "https://www.digitaljournal.com/world/us-trade-gap-shrinks-to-smallest-since-2009-as-imports-fall/article",
    "timestamp": "2026-01-08T14:47:32Z"
  },
  {
    "title": "\"I can’t return to work after maternity leave; my sabbatical was rejected without a word,\" shares HR professional: Is corporate empathy just a façade?",
    "description": "A Reddit post highlights the challenges of navigating corporate policies during maternity leave. An HR professional in Bengaluru, with ten years at an international bank, requested a six-month unpaid sabbatical due to solo parenting. Her request was rejected …",
    "link": "https://timesofindia.indiatimes.com/education/careers/news/i-cant-return-to-work-after-maternity-leave-my-sabbatical-was-rejected-without-a-word-shares-hr-professional-is-corporate-empathy-just-a-faade/articleshow/126417331.cms",
    "timestamp": "2026-01-08T14:47:11Z"
  },
  {
    "title": "Laura Ingraham Admits Michelle Obama Was Right: 'We Take It All Back'",
    "description": "The Fox News host made the confession Wednesday while discussing the new dietary guidelines unveiled at the White House.",
    "link": "https://www.huffpost.com/entry/laura-ingraham-admits-michelle-obama-was-right-we-take-it-all-back_n_695f86f8e4b07c500938a455",
    "timestamp": "2026-01-08T14:44:40Z"
  },
  {
    "title": "Newsom Plans Crackdown on Corporate Homebuying in California",
    "description": "California Gov. Gavin Newsom will call for a crackdown on institutional investors buying up homes in the state during a speech Thursday, following a similar announcement by President Donald Trump. Newsom plans on saying he will work with local legislators …",
    "link": "https://www.insurancejournal.com/news/west/2026/01/08/853580.htm",
    "timestamp": "2026-01-08T14:44:35Z"
  },
  {
    "title": "D as in Donald and Decline",
    "description": "Tom Engelhardt\n\n\n\nLiving (dying?) with Donald Trump.\r\n\n\r\n\n\nThe post D as in Donald and Decline appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-democracy-decline-imperialism-superpowers/",
    "timestamp": "2026-01-08T14:44:06Z"
  },
  {
    "title": "Defining Donald Trump (Simon Kuper/Financial Times)",
    "description": "Simon Kuper / Financial Times:\nDefining Donald Trump  —  The US leader is often called a fascist but he represents a different kind of political authoritarianism  —  Is Donald Trump a fascist?  The question is central to attempts to understand him.  He has di…",
    "link": "https://www.memeorandum.com/260108/p40",
    "timestamp": "2026-01-08T14:40:02Z"
  },
  {
    "title": "Where Trump's $2,000 tariff dividend checks stand now",
    "description": "President Trump says the U.S. raised more than $600 billion in tariff revenue. He previously suggested sending Americans $2,000 checks as a \"dividend\" payment.",
    "link": "https://www.cnbc.com/2026/01/08/stimulus-check-trump-tariffs-2000.html",
    "timestamp": "2026-01-08T14:39:45Z"
  },
  {
    "title": "ICE in Minnesota",
    "description": "Tragedy in Minnesota: Immigration and Customs Enforcement (ICE) officers in Minnesota shot and killed a 37-year-old woman, Renee Nicole Goode, in her car yesterday. Footage of the incident is rather unclear. President Donald Trump, Homeland Security Secretary…",
    "link": "https://biztoc.com/x/5c5fb4e200c3ec5f",
    "timestamp": "2026-01-08T14:39:04Z"
  },
  {
    "title": "What to know about the Minneapolis shooting, just a mile from where police killed George Floyd in 2020",
    "description": "Renee Nicole Macklin Good described herself on social media as a “poet and writer and wife and mom” who was from Colorado.",
    "link": "https://fortune.com/2026/01/08/what-to-know-about-the-minneapolis-shooting-just-a-mile-from-where-police-killed-george-floyd-in-2020/",
    "timestamp": "2026-01-08T14:38:58Z"
  },
  {
    "title": "US stocks open lower; defense firms up as Trump calls for budget boost",
    "description": "Wall ‍Street's ​main indexes opened lower ⁠on Thursday, as investors turned cautious ‌ahead ‌of Friday's crucial nonfarm ‌payrolls report, while defense companies advanced after President Donald Trump ​called for ​a $1.5 trillion ‌military ‍budget.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stocks-open-lower-defense-firms-up-as-trump-calls-for-budget-boost/articleshow/126417292.cms",
    "timestamp": "2026-01-08T14:38:51Z"
  },
  {
    "title": "Colbert, Kimmel Speak Out on Minneapolis Shooting, Trump/ICE Excuses",
    "description": "On Wednesday, the news hit that 37-year-old Renee Nicole Good had been shot and killed in Minneapolis, Minnesota, by an Immigration and Customs Enforcement (ICE) agent. Though Donald Trump, Homeland Security Secretary Kristi Noem, DHS Spokesperson Tricia McLa…",
    "link": "https://bleedingcool.com/tv/colbert-kimmel-speak-out-on-minneapolis-shooting-trump-ice-excuses/",
    "timestamp": "2026-01-08T14:38:05Z"
  },
  {
    "title": "'Stood out to me': Reporter flags 'significant' answer from new Trump interview",
    "description": "CNN's Alayna Treene highlighted a \"significant\" comment made by President Donald Trump in a wide-ranging interview with the New York Times about his administration's plans for Venezuela.The 79-year-old president told the New York Times during a nearly two-hou…",
    "link": "https://www.rawstory.com/venezuela-oil-production-trump/",
    "timestamp": "2026-01-08T14:37:50Z"
  },
  {
    "title": "White rose in hand, peace crusader from US aims to turn war-torn lands into farms of food security",
    "description": "Mumbai: Global peace initiative ‘Roots of Peace' founder Heidi Kuhn perhaps could not have celebrated her 68th birthday in a better way and at a more .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/white-rose-in-hand-peace-crusader-from-us-aims-to-turn-war-torn-lands-into-farms-of-food-security/articleshow/126417267.cms",
    "timestamp": "2026-01-08T14:36:55Z"
  },
  {
    "title": "Ex- Bigg Boss winner Prince Narula finally reacts to viral videos of his arrest in Delhi; says, “It was a…”",
    "description": "Reality TV star Prince Narula has denied reports of his arrest circulating on social media. Viral videos showed him being taken by police, but Narula clarified it was for a brand shoot. He is currently focusing on his singing career and has a history of contr…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/ex-bigg-boss-winner-prince-narula-finally-reacts-to-viral-videos-of-his-arrest-in-delhi-says-it-was-a/articleshow/126417142.cms",
    "timestamp": "2026-01-08T14:35:03Z"
  },
  {
    "title": "Trump withdrawal from bedrock UN climate treaty raises legal questions",
    "description": "WASHINGTON, Jan 8 (Reuters) - The Trump administration's decision to withdraw ‌the United States from the foundational U.N. climate treaty, which the U.S. Senate unanimously adopted more than 30 years ago, may be illegal, according to some legal experts ‌who …",
    "link": "https://www.thestar.com.my/news/world/2026/01/08/trump-withdrawal-from-bedrock-un-climate-treaty-raises-legal-questions",
    "timestamp": "2026-01-08T14:34:00Z"
  },
  {
    "title": "Trump’s Jungle Rules",
    "description": "The nature of US foreign policy under the current administration is now clear. America will unilaterally exercise power wherever Donald Trump thinks he can get away with it, uncoupled from the norms, bureaucratic processes, alliance structures, and multilater…",
    "link": "https://www.project-syndicate.org/commentary/trump-foreign-policy-preying-on-weak-and-vulnerable-by-ian-bremmer-2026-01",
    "timestamp": "2026-01-08T14:33:45Z"
  },
  {
    "title": "Macron accuses US of ‘breaking free from international rules’",
    "description": "French President Emmanuel Macron said on Thursday that the United States was “breaking free from international rules” and “gradually turning away” from some of its allies. Macron delivered his annual speech to French ambassadors at the Elysee Palace as Europe…",
    "link": "https://www.digitaljournal.com/world/macron-accuses-us-of-breaking-free-from-international-rules/article",
    "timestamp": "2026-01-08T14:33:23Z"
  }
]