[
  {
    "title": "Exclusive -- White House: Trump Wants Mark Walker, Other Nominees Confirmed ASAP",
    "description": "President Donald Trump wants the U.S. Senate to confirm his nominee for the Religious Freedom ambassador, former Rep. Mark Walker (R-NC), and his other nominees as soon as possible.\nThe post Exclusive — White House: Trump Wants Mark Walker, Other Nominees Con…",
    "link": "https://www.breitbart.com/politics/2025/12/11/exclusive-white-house-trump-wants-mark-walker-other-nominees-confirmed-asap/",
    "timestamp": "2025-12-11T21:52:10Z"
  },
  {
    "title": "US Senate confirms dozens more Trump nominees, including South Africa pick",
    "description": "WASHINGTON, Dec 11 (Reuters) - The U.S. Senate on Thursday confirmed dozens of President Donald Trump's picks for government positions, voting along party lines for nominees including conservative activist Leo Brent Bozell III to be ambassador to South Africa…",
    "link": "https://www.thestar.com.my/news/world/2025/12/12/us-senate-confirms-dozens-more-trump-nominees-including-south-africa-pick",
    "timestamp": "2025-12-11T21:52:00Z"
  },
  {
    "title": "Did Marco Rubio cancel Tom Hanks' passport, restrict his travel? Cast away suspicious claims",
    "description": "U.S. Secretary of State Marco Rubio canceled actor Tom Hanks' passport and restricted him from traveling \"until some questions have been answered.\"",
    "link": "https://www.snopes.com//fact-check/tom-hanks-passport-marco-rubio/",
    "timestamp": "2025-12-11T21:51:00Z"
  },
  {
    "title": "Indiana Rejects Redistricting in Major Blow to Donald Trump",
    "description": "The Indiana Senate has rejected a vote to redistrict the state, despite President Donald Trump's wishes.\nRepublicans in the state voted with Democrats to reject the plan to redraw maps, which was expected to give the GOP two more seats in the state.\nWhy It Ma…",
    "link": "https://biztoc.com/x/301eaed1d541c954",
    "timestamp": "2025-12-11T21:50:02Z"
  },
  {
    "title": "Trump Accounts: Don’t Believe the Hype",
    "description": "It’s hard to see how a savings vehicle with no tax incentives will bring anyone closer to the American dream.",
    "link": "https://www.theatlantic.com/ideas/2025/12/trump-accounts-dont-believe-the-hype/685224/",
    "timestamp": "2025-12-11T21:50:00Z"
  },
  {
    "title": "Critics doubt White House defense of Trump bandages: 'Is he shaking hands with chainsaws?'",
    "description": "Bemused social media users had a series of comments — and questions — on Thursday after White House Press Secretary Karoline Leavitt attempted to defend the bandages on President Donald Trump's hand during a press conference.A reporter asked Leavitt if she co…",
    "link": "https://www.rawstory.com/donald-trump-2674392820/",
    "timestamp": "2025-12-11T21:49:41Z"
  },
  {
    "title": "US has more Venezuelan oil tankers in its sights",
    "description": "The US is undertaking a large-scale military build-up in the southern Caribbean to increase pressure on Venezuelan President Nicolas Maduro, and is planning to intercept more ships, according to sources.",
    "link": "https://www.abc.net.au/news/2025-12-12/us-ready-to-seize-ships-venezuelan-oil-tankers/106134498",
    "timestamp": "2025-12-11T21:49:35Z"
  },
  {
    "title": "Speaker Johnson: 'Absolutely Delighted' Jasmine Crockett Running for Senate in Texas",
    "description": "House Speaker Mike Johnson (R-LA) is \"absolutely delighted\" that Democrat Rep. Jasmine Crockett (D-TX) is running for Senate in Texas, predicting that the voters in Texas will ultimately reject who he described as the \"face of the Democratic Party.\"\nThe post …",
    "link": "https://www.breitbart.com/politics/2025/12/11/speaker-johnson-absolutely-delighted-jasmine-crockett-running-for-senate-in-texas/",
    "timestamp": "2025-12-11T21:49:17Z"
  },
  {
    "title": "20 Republicans vote with Dems to reverse Trump executive order on federal unions",
    "description": "A small number of Republicans joined Democrats to vote in favor of reversing President Donald Trump's order on federal worker unions.",
    "link": "https://www.foxnews.com/politics/republicans-vote-dems-reverse-trump-executive-order-federal-unions",
    "timestamp": "2025-12-11T21:47:57Z"
  },
  {
    "title": "House Republicans Just Joined Democrats To Deliver A Major Rebuke To Trump",
    "description": "The bill came up thanks to the same sort of “discharge petition” lawmakers used to get at the Epstein files.",
    "link": "https://www.huffpost.com/entry/house-vote-trump-unions_n_6939e5d0e4b0455a070b99aa",
    "timestamp": "2025-12-11T21:47:48Z"
  },
  {
    "title": "Indiana Senate rejects redistricting bill that Trump demanded",
    "description": "Trump and the GOP mounted an immense pressure campaign in Indiana as they try to make the congressional map more favorable before the 2026 midterms.",
    "link": "https://www.cnbc.com/2025/12/11/indiana-trump-republicans-redistricting-congress.html",
    "timestamp": "2025-12-11T21:46:54Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing makes first in-court appearance",
    "description": "Lawyers for Tyler Robinson, the man accused of killing conservative activist Charlie Kirk, have sought to limit media access to ensure a fair trial.",
    "link": "https://www.abc.net.au/news/2025-12-12/suspect-in-charlie-kirk-killing-tyler-first-in-court-appearance/106134566",
    "timestamp": "2025-12-11T21:45:34Z"
  },
  {
    "title": "Why Republicans in Congress are turning against Trump (Vox)",
    "description": "Vox:\nWhy Republicans in Congress are turning against Trump  —  Republicans are also quitting in droves. … For most of this year, Republican members of the House of Representatives seemed to move in lockstep with President Donald Trump, not hesitating to back …",
    "link": "https://www.memeorandum.com/251211/p116",
    "timestamp": "2025-12-11T21:45:01Z"
  },
  {
    "title": "Trump's Bid To Rig Indiana Congressional Map Goes Down In Flames",
    "description": "After two months of pressure and violent threats, Republican state senators voted against Trump's effort to eliminate two House seats held by Democrats.",
    "link": "https://www.huffpost.com/entry/indiana-republicans-vote-against-trump-redistricting_n_693b3743e4b053d6e8f192f2",
    "timestamp": "2025-12-11T21:44:54Z"
  },
  {
    "title": "U.S. jobless benefit applications jump to 236,000 last week as concerns about labor market persist",
    "description": "The number of Americans applying for unemployment benefits jumped last week, but remain in the same historically healthy range of the past few years despite growing concern over the health of the labor market. U.S. jobless claim applications for the week endi…",
    "link": "https://japantoday.com/category/business/us-jobless-benefit-applications-jump-to-236-000-but-continuing-claims-are-lowest-since-april",
    "timestamp": "2025-12-11T21:43:35Z"
  },
  {
    "title": "Trump dealt major blow as Indiana Senate rejects redistricting map that would’ve added 2 GOP House seats",
    "description": "It's decision day in red state Indiana, as the state Senate votes on congressional redistricting championed by President Trump. The new map would create two more GOP-dominated U.S. House districts.",
    "link": "https://www.foxnews.com/politics/trump-dealt-major-blow-indiana-senate-rejects-redistricting-added-2-gop-house-seats",
    "timestamp": "2025-12-11T21:43:25Z"
  },
  {
    "title": "Taiwan to keep production of 'most advanced' chips at home: deputy FM",
    "description": "Taiwan plans to keep making the &quot;most advanced&quot; chips on home soil and remain &quot;indispensable&quot; to the global semiconductor industry, the deputy foreign minister told AFP, despite intense Chinese military pressure. The democratic island make…",
    "link": "https://japantoday.com/category/tech/taiwan-to-keep-production-of-%27most-advanced%27-chips-at-home-deputy-fm",
    "timestamp": "2025-12-11T21:42:55Z"
  },
  {
    "title": "Time magazine names 'Architects of AI' as Person of the Year",
    "description": "Time magazine named the &quot;Architects of AI&quot; as its Person of the Year on Thursday, highlighting the U.S. tech titans whose work on cutting-edge artificial intelligence is transforming humanity. Nvidia's Jensen Huang, OpenAI's Sam Altman and xAI's Elo…",
    "link": "https://japantoday.com/category/tech/time-magazine-names-%27architects-of-ai%27-as-person-of-the-year",
    "timestamp": "2025-12-11T21:42:50Z"
  },
  {
    "title": "BREAKING: Indiana Senate Votes Against Congressional Map That Could Help Trump Avoid Impeachment",
    "description": "The Indiana State Senate, which has a GOP super majority, has voted against a redistricting bill that would have likely given Republicans two additional seats... Read More\nThe post BREAKING: Indiana Senate Votes Against Congressional Map That Could Help Trump…",
    "link": "https://www.dailysignal.com/2025/12/11/breaking-indiana-senate-votes-against-congressional-map-that-could-help-trump-avoid-impeachment/",
    "timestamp": "2025-12-11T21:42:41Z"
  },
  {
    "title": "Trump can maintain good relations with both Japan and China, White House says",
    "description": "U.S. President Donald Trump can ‌maintain both a &quot;good working relationship&quot; with China and a &quot;very strong ⁠alliance&quot; with Japan ‍even as tensions ‍have ‍risen between those two ⁠countries, the White House said ​on Thursday. &quot;Japan is…",
    "link": "https://japantoday.com/category/politics/trump-can-maintain-good-relations-with-both-japan-and-china-white-house-says",
    "timestamp": "2025-12-11T21:42:05Z"
  },
  {
    "title": "'Nothing bad is happening’: Trump official raises eyebrows as economy tanks",
    "description": "A new poll shows US voters’ approval of President Donald Trump’s handling of the economy has hit an all-time low, even as the president and his officials insist the economy is the best in the world.The latest Associated Press-NORC Center for Public Affairs Re…",
    "link": "https://www.rawstory.com/trump-economy-tanks/",
    "timestamp": "2025-12-11T21:40:59Z"
  },
  {
    "title": "Software Mogul/Secretary of (*checks notes) the Interior Says AI Will Cure Cancer",
    "description": "\"This is the miracle of AI. We can actually manufacture intelligence.\"",
    "link": "https://gizmodo.com/software-mogul-secretary-of-checks-notes-the-interior-says-ai-will-cure-cancer-2000698612",
    "timestamp": "2025-12-11T21:40:26Z"
  },
  {
    "title": "Judge orders Kilmar Abrego Garcia to be immediately released from immigration detention",
    "description": "Kilmar Abrego Garcia must be freed from immigration detention while he fights to stay in the U.S., a judge ruled Thursday, handing a major victory to the immigrant whose wrongful deportation to a notorious prison in El Salvador made him a flashpoint of the Tr…",
    "link": "https://japantoday.com/category/world/judge-orders-kilmar-abrego-garcia-to-be-immediately-released-from-immigration-detention1",
    "timestamp": "2025-12-11T21:39:42Z"
  },
  {
    "title": "Justice Department again fails to re-indict New York Attorney General Letitia James",
    "description": "A grand jury declined for a second time to re-indict New York Attorney General Letitia James on Thursday, refusing to resurrect a mortgage fraud prosecution encouraged by President Donald Trump, according to a person familiar with the matter. It’s another maj…",
    "link": "https://japantoday.com/category/world/justice-department-again-fails-to-re-indict-new-york-attorney-general-letitia-james-ap-source-says",
    "timestamp": "2025-12-11T21:39:24Z"
  },
  {
    "title": "Indiana Senate Republicans reject Trump’s redistricting push | CNN Politics",
    "description": "The Indiana Senate on Thursday voted down a plan to redraw the state’s congressional districts to produce two more GOP-friendly seats, rejecting President Donald Trump’s months-long campaign to pressure the Republican supermajority in the deep-red state to be…",
    "link": "https://www.cnn.com/2025/12/11/politics/indiana-senate-republicans-redistricting-trump",
    "timestamp": "2025-12-11T21:39:19Z"
  },
  {
    "title": "Alphabet Just Did Something It Hasn't Done in 7 Years. Time to Buy?",
    "description": "Alphabet (GOOG 2.27%) (GOOGL 2.42%), like other tech stocks, traveled through difficult times and better times this year. The stock slipped this spring amid concern about the impact of U.S. import tariffs on corporate earnings. But as President Donald Trump n…",
    "link": "https://biztoc.com/x/b756e8a2c2d02669",
    "timestamp": "2025-12-11T21:38:56Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing makes first in-court appearance",
    "description": "Lawyers for Tyler Robinson, the accused killer of conservative activist Charlie Kirk, sought on Thursday to limit media access to ‌ensure a fair trial as the 22-year-old man made his first in-person court appearance. Robinson, wearing a shirt and tie, sat nex…",
    "link": "https://japantoday.com/category/world/suspect-in-charlie-kirk-killing-makes-first-in-court-appearance",
    "timestamp": "2025-12-11T21:38:41Z"
  },
  {
    "title": "What role will Trump play in the battle over Warner Bros. Discovery?",
    "description": "The fight over the future of Warner Bros. Discovery is really a battle to decide who will control much of the news and entertainment Americans consume. So perhaps it is no surprise that President Donald Trump is wading straight into the middle of the fray bet…",
    "link": "https://biztoc.com/x/9447f207b8d6ab4e",
    "timestamp": "2025-12-11T21:38:34Z"
  },
  {
    "title": "Homeland Security Secretary Noem defends Trump’s hard-line immigration policies under scrutiny",
    "description": "Homeland Security Secretary Kristi Noem defiantly defended the Trump administration’s hard-line immigration policies on Thursday during a House committee hearing, portraying migrants as a major threat faced by the nation that justifies a crackdown that has se…",
    "link": "https://japantoday.com/category/world/homeland-security-secretary-noem-faces-scrutiny-over-immigration-policies-at-a-house-hearing",
    "timestamp": "2025-12-11T21:38:07Z"
  },
  {
    "title": "U.S. preparing to seize more tankers off Venezuela's coast after first ship taken, sources say",
    "description": "The U.S. is preparing to intercept more ships transporting Venezuelan oil following the seizure of a tanker this week, as it increases pressure on Venezuelan President Nicolas Maduro, six sources familiar with the matter said on Thursday. The seizure was the …",
    "link": "https://japantoday.com/category/world/us-preparing-to-seize-more-tankers-off-venezuela%27s-coast-after-first-ship-taken-sources-say",
    "timestamp": "2025-12-11T21:37:52Z"
  },
  {
    "title": "Paramount’s Warner Bros Discovery bid faces conflict of interest concerns",
    "description": "Experts are worried that Paramount-Skydance might undercut the editorial independence of CNN, among other issues.",
    "link": "https://www.aljazeera.com/economy/2025/12/11/paramounts-warner-bros-discovery-bid-faces-conflict-of-interest-concerns",
    "timestamp": "2025-12-11T21:36:54Z"
  },
  {
    "title": "House squashes second attempt to impeach Trump from Rep. Al Green",
    "description": "The House has voted to dismiss an effort to impeach President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/house-squashes-attempt-impeach-trump-rep-al-green-128325814",
    "timestamp": "2025-12-11T21:34:11Z"
  },
  {
    "title": "After Airbus issue, DOT says airlines don't have to cover passenger expenses amid aircraft recalls",
    "description": "The U.S. Department of Transportation has issued new guidance stating airlines don't have to cover passenger expenses like meals or lodging when a flight is canceled or significantly delayed by an aircraft recall",
    "link": "https://abcnews.go.com/Business/wireStory/after-airbus-issue-dot-airlines-cover-passenger-expenses-128323264",
    "timestamp": "2025-12-11T21:33:48Z"
  },
  {
    "title": "Contrasting views of Russia show deepening Republican split over foreign policy",
    "description": "In the past week, President Donald Trump and senior Republican lawmakers have presented starkly different views of a top U.S. national security challenge: Russia, its war in Ukraine and the threat it poses to Europe and the United States. Trump released a new…",
    "link": "https://japantoday.com/category/features/opinions/analysis-contrasting-views-of-russia-show-deepening-republican-split-over-foreign-policy",
    "timestamp": "2025-12-11T21:33:30Z"
  },
  {
    "title": "House squashes second attempt to impeach Trump from Rep. Al Green",
    "description": "The House voted 237-140 to shelve Green’s impeachment resolution.",
    "link": "https://www.bostonherald.com/2025/12/11/trump-impeachment-al-green/",
    "timestamp": "2025-12-11T21:32:31Z"
  },
  {
    "title": "New York’s new law forces advertisers to say when they’re using AI avatars",
    "description": "New York Gov. Kathy Hochul signed a bill Thursday that will require advertisers to identify if an ad includes AI-generated people. Hochul's announcement said the bill, S.8420-A/A.8887-B, was the first of its kind in the US, describing it as a \"common sense\" l…",
    "link": "https://www.theverge.com/news/842848/new-york-law-ai-advertisements-sag-aftra-labor",
    "timestamp": "2025-12-11T21:30:15Z"
  },
  {
    "title": "A meeting meant to launch FEMA reforms is abruptly canceled",
    "description": "Council members were to present and vote on a recommendations report.",
    "link": "https://www.bostonherald.com/2025/12/11/fema-meeting-cancellation/",
    "timestamp": "2025-12-11T21:29:54Z"
  },
  {
    "title": "This Republican acted like the famed whiskey-guzzling raccoon with his embarrassing rant",
    "description": "When he talks about Kansas Reflector, Senate President Ty Masterson acts like that raccoon who drank a bunch of liquor and passed out on a bathroom floor.Just like the fuzzy critter guzzled peanut butter whiskey, Masterson imbibed misinformation and conspirac…",
    "link": "https://www.rawstory.com/republicans-2674391596/",
    "timestamp": "2025-12-11T21:29:41Z"
  },
  {
    "title": "Justice Department sues Colorado secretary of state to force release of detailed voter information",
    "description": "The U.S. Department of Justice sued Colorado Secretary of State Jena Griswold on Thursday to demand that she release the state's full voter registration list without any redactions.",
    "link": "https://www.denverpost.com/2025/12/11/jena-griswold-lawsuit-justice-department-voters/",
    "timestamp": "2025-12-11T21:28:08Z"
  },
  {
    "title": "Pardoned Democrat Who Betrayed Trump Now Finding He Doesn’t Have Many Friends Left",
    "description": "Henry Cuellar, who received a head-scratching pardon from President Donald Trump only to betray him, now finds he doesn't have many friends left on the Hill.",
    "link": "https://dailycaller.com/2025/12/11/henry-cuellar-pardon-donald-trump-democrats-appropriations-subcommittee-dhs-funding/",
    "timestamp": "2025-12-11T21:28:04Z"
  },
  {
    "title": "US intends to seize oil from tanker captured near Venezuela as vessel moves toward Galveston",
    "description": "The recent seizure of an oil tanker known as Skipper by the U.S. off the coast of Venezuela marks a dramatic escalation of President Donald Trump’s campaign to choke off Venezuelan leader Nicolás Maduro’s access to oil revenues.",
    "link": "https://www.click2houston.com/business/2025/12/11/us-seizure-of-rogue-oil-tanker-off-venezuela-signals-new-crackdown-on-shadow-fleet/",
    "timestamp": "2025-12-11T21:26:56Z"
  },
  {
    "title": "Trump Makes Rare Acknowledgment of Weak Polling On Economy",
    "description": "Trump’s rare acknowledgment of weak polling highlights the gap between modest economic indicators and voters’ continued frustration with day-to-day costs.\nThe post Trump Makes Rare Acknowledgment of Weak Polling On Economy first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-makes-rare-acknowledgment-of-weak-polling-on-economy/",
    "timestamp": "2025-12-11T21:26:43Z"
  },
  {
    "title": "Dan Bongino ‘Could Be Out Any Day’ as FBI Deputy Director: Report",
    "description": "Dan Bongino could be out of a job \"any day\" over the Trump administration's handling of the Epstein files, according to reporting by journalist Rachel Bade.\nThe post Dan Bongino ‘Could Be Out Any Day’ as FBI Deputy Director: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/dan-bongino-could-be-out-any-day-as-fbi-deputy-director-report/",
    "timestamp": "2025-12-11T21:25:19Z"
  },
  {
    "title": "I can take a hint",
    "description": "The old line about how a prosecutor can get a grand jury to indict a ham sandwich assumes the can opener of a not completely corrupt legal system. Tragically for the Trump administration, that can opener continues to exist, at least for now: A grand jury in A…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/i-can-take-a-hint",
    "timestamp": "2025-12-11T21:21:53Z"
  },
  {
    "title": "Shockingly High Percentages Of Americans Are Skipping Meals Or Putting Off Medical Care Because Of The High Cost Of Living",
    "description": "Do you remember all of those people over the years that warned us that the cost of living would eventually spiral out of control? It turns out that they were right. Our leaders flooded the system with trillions upon trillions of new dollars, and now we have a…",
    "link": "http://theeconomiccollapseblog.com/shockingly-high-percentages-of-americans-are-skipping-meals-or-putting-off-medical-care-because-of-the-high-cost-of-living/",
    "timestamp": "2025-12-11T21:21:10Z"
  },
  {
    "title": "Trump More Hated, Mocked, Loathed And Loathsome Than Ever. Does It Matter?",
    "description": "Yes! But let's contextualize that!",
    "link": "https://www.wonkette.com/p/trump-more-hated-mocked-loathed-and",
    "timestamp": "2025-12-11T21:20:27Z"
  },
  {
    "title": "‘You run the Gestapo!’: TDS breaks out as Kristi Noem leaves hearing holding grandbaby",
    "description": "'Crazed' mob confronts her after initial disruptions during committee testimony",
    "link": "https://www.wnd.com/2025/12/you-run-gestapo-tds-breaks-as-kristi-noem/",
    "timestamp": "2025-12-11T21:18:59Z"
  },
  {
    "title": "Obamacare subsidy extensions rejected in Senate",
    "description": "The Senate on Thursday rejected legislation to extend Affordable Care Act tax credits, essentially guaranteeing that millions of Americans will see a steep rise in costs at the beginning of the year.",
    "link": "https://www.bostonherald.com/2025/12/11/obamacare-subsidy-extensions-rejected-in-senate/",
    "timestamp": "2025-12-11T21:17:03Z"
  },
  {
    "title": "UK ready to send troops, jets, ships if Trump clinches Ukraine ceasefire, defense chief says",
    "description": "Britain readies troops and 30-nation coalition for Ukraine ceasefire enforcement as Trump pushes peace negotiations with Russia and European allies.",
    "link": "https://www.foxnews.com/politics/uk-ready-send-troops-jets-ships-trump-clinches-ukraine-ceasefire-defense-chief-says",
    "timestamp": "2025-12-11T21:16:38Z"
  },
  {
    "title": "US to tow tanker to port and seize Venezuelan oil",
    "description": "An oil tanker seized by American forces off the Venezuelan coast will be brought to a port in the United States, the White House has said, as fears mount of open conflict between the two countries.",
    "link": "https://www.rte.ie/news/world/2025/1211/1548536-us-to-tow-tanker-to-port-and-seize-venezuelan-oil/",
    "timestamp": "2025-12-11T21:14:04Z"
  },
  {
    "title": "What role will Trump play in the battle over Warner Bros. Discovery?",
    "description": "Netflix, Paramount battle for the president’s approval",
    "link": "https://theweek.com/politics/trump-role-battle-warner-bros-discovery-netflix-paramount",
    "timestamp": "2025-12-11T21:12:29Z"
  },
  {
    "title": "The Number of Democrats Backing Trump Impeachment Vote Has Nearly Doubled",
    "description": "A Democrat member’s effort to impeach President Donald Trump failed on Thursday, but Democrats’ votes shed light on who exactly is willing to assist in... Read More\nThe post The Number of Democrats Backing Trump Impeachment Vote Has Nearly Doubled appeared fi…",
    "link": "https://www.dailysignal.com/2025/12/11/the-number-of-democrats-backing-trump-impeachment-vote-has-nearly-doubled/",
    "timestamp": "2025-12-11T21:10:00Z"
  },
  {
    "title": "Zelenskyy says US-led peace talks wrestling with Russian demands for Ukrainian territory",
    "description": "Taoiseach Micheál Martin said Ireland wants to see a peace that provides guarantees for Ukraine’s future security and said this is also “crucial for Europe’s future security”.",
    "link": "https://www.thejournal.ie/ukraine-zelenskyy-russia-us-led-peace-talks-6900317-Dec2025/",
    "timestamp": "2025-12-11T21:10:00Z"
  },
  {
    "title": "Mark Kelly: Trump Does Not Understand 'What It Is to Be an American'",
    "description": "Sen. Mark Kelly (D-AZ) said President Donald Trump does not \"understand what it is to be an American,\" boasting of his family's military service and saying he feels \"bad\" for Trump's supporters in an interview with Jim Acosta.\nThe post Mark Kelly: Trump Does …",
    "link": "https://www.breitbart.com/politics/2025/12/11/mark-kelly-trump-does-not-understand-what-it-is-to-be-an-american/",
    "timestamp": "2025-12-11T21:09:57Z"
  },
  {
    "title": "Trump’s pick for Fed chair is already on track to disappoint him | CNN Business",
    "description": "The next chair of the Federal Reserve might already be a disappointment to President Donald Trump – even before they’re named.",
    "link": "https://www.cnn.com/2025/12/11/business/federal-reserve-chair-interest-rates-trump",
    "timestamp": "2025-12-11T21:09:53Z"
  },
  {
    "title": "Justice Department fails to re-indict Letitia James for second time",
    "description": "A judge threw out the original indictment against James and Comey in November.",
    "link": "https://nypost.com/2025/12/11/us-news/justice-department-fails-to-re-indict-letitia-james-for-second-time/",
    "timestamp": "2025-12-11T21:09:19Z"
  },
  {
    "title": "Senate Republicans Blocked Yet Another Chance to Save Obamacare Subsidies",
    "description": "On Thursday, in a 51-48 vote, the Senate rejected a Democratic plan to extend Affordable Care Act enhanced tax credits, as well as a Republican alternative that boosted a health savings account model. It is now all but certain that the credits, which began un…",
    "link": "https://www.motherjones.com/politics/2025/12/republican-aca-subsidy-obamacare-premiums-blocked/",
    "timestamp": "2025-12-11T21:07:47Z"
  },
  {
    "title": "Democratic Congressman's Attempt to Impeach Trump Fails Miserably",
    "description": "A Democratic lawmaker's attempt to impeach President Donald Trump failed miserably Thursday as even many Democratsts rejected it.",
    "link": "https://www.westernjournal.com/democratic-congressmans-attempt-impeach-trump-fails-miserably/",
    "timestamp": "2025-12-11T21:07:17Z"
  },
  {
    "title": "Trump Keeps Insisting There's No Affordability Crisis Despite Data Showing Otherwise",
    "description": "Americans are watching the prices of groceries, utilities, medical care and housing skyrocket—but Trump says it’s not happening.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/12/11/trump-keeps-insisting-theres-no-affordability-crisis-despite-data-showing-otherwise/",
    "timestamp": "2025-12-11T21:05:52Z"
  },
  {
    "title": "Accused Charlie Kirk Killer Makes 1st In-person Court Appearance",
    "description": "The Utah man charged with killing Charlie Kirk is making his first in-person court appearance as his attorneys push to further limit media access.",
    "link": "https://www.huffpost.com/entry/accused-charlie-kirk-shot-killer-court_n_693b31abe4b0455a0710905f",
    "timestamp": "2025-12-11T21:05:10Z"
  },
  {
    "title": "Trump’s National Security Strategy Is a Blueprint for the Demise of the West",
    "description": "The White House’s agenda may not be coherent, but it is deeply dangerous.",
    "link": "http://foreignpolicy.com/2025/12/11/trump-national-security-strategy-blueprint-west-demise/",
    "timestamp": "2025-12-11T21:05:03Z"
  },
  {
    "title": "MyPillow Guy Turns Minnesota Governor’s Race Into a Circus",
    "description": "MyPillow Guy and election denial conspiracy theorist Mike Lindell is running for governor of Minnesota. His candidacy threatens a large GOP field that can’t offend his friend Donald Trump and takes some heat off a scandal-plagued Tim Walz.",
    "link": "http://nymag.com/intelligencer/article/mypillow-guy-turns-minnesota-governors-race-into-a-circus.html",
    "timestamp": "2025-12-11T21:04:43Z"
  },
  {
    "title": "‘Something Is Wrong Here’: Jimmy Kimmel Calls Out Trump’s 'Unscheduled Dementia Tests' as Concerns for Prez’s Health Explode",
    "description": "The late night host insisted 'something's wrong' with the president following his 500-word Truth Social post about his health.",
    "link": "https://radaronline.com/p/donald-trump-jimmy-kimmel-calls-out-unscheduled-dementia-tests-health-concerns/",
    "timestamp": "2025-12-11T21:03:20Z"
  },
  {
    "title": "Grand jury declines to indict Letitia James for second time in a week",
    "description": "The move marks the latest blow to Trump's effort to prosecute the New York attorney general for financial crimes.",
    "link": "https://www.bbc.com/news/articles/cjrjj30vx8eo",
    "timestamp": "2025-12-11T21:02:37Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing makes first in-court appearance",
    "description": "Dec 11 (Reuters) - Lawyers for Tyler Robinson, the accused killer of conservative activist Charlie Kirk, sought on Thursday to limit media access to ensure a...",
    "link": "https://www.yahoo.com/news/articles/suspect-charlie-kirk-killing-makes-210121339.html",
    "timestamp": "2025-12-11T21:01:21Z"
  },
  {
    "title": "Democrats ask DOJ watchdog to prevent “tampering” with Epstein files",
    "description": "With the Epstein files release deadline looming, Democrats want to keep the DOJ from pulling a fast one.",
    "link": "https://www.salon.com/2025/12/11/democrats-ask-doj-watchdog-to-prevent-tampering-with-epstein-files/",
    "timestamp": "2025-12-11T20:59:43Z"
  },
  {
    "title": "Netflix and Paramount Will Fight for Trump's Favor",
    "description": "Some of the most powerful business leaders in the country will be competing to outdo each other in terms of obsequiousness toward Trump.",
    "link": "https://reason.com/2025/12/11/netflix-and-paramount-will-fight-for-trumps-favor/",
    "timestamp": "2025-12-11T20:59:17Z"
  },
  {
    "title": "US places sanctions on Venezuelan President Maduro's nephews",
    "description": "The U.S. has imposed sanctions on three nephews of Venezuelan President Nicolás Maduro. The move is the latest by President Donald Trump to increase pressure on Venezuela to stem the flow of illegal drugs into the United States. The sanctions, announced Thurs…",
    "link": "https://apnews.com/article/treasury-state-department-sanctions-trump-venezuela-a542e7d3f01fe6b9d8ae8ff3cad6f792",
    "timestamp": "2025-12-11T20:58:29Z"
  },
  {
    "title": "'Pathetic': Farmer unloads on 'Republican sycophants' in blistering op-ed",
    "description": "Ben Palen — a Kansas native and a fifth-generation farmer and agriculture consultant — blasted President Donald Trump’s repeated tactic of putting farmers in distress and then dangling tax-funded salvation before them and hungry developers.“[T]he Trump admini…",
    "link": "https://www.rawstory.com/alternet-posts/trump-kansas-farmer/",
    "timestamp": "2025-12-11T20:58:01Z"
  },
  {
    "title": "Charlotte church depicts ICE arresting Holy Family in Trump-era nativity scene",
    "description": "Rev. Andrew Shipley's Missiongathering Church displayed a nativity scene featuring immigration agents as a modern interpretation of the Holy Family's flight from persecution.",
    "link": "https://www.foxnews.com/media/charlotte-church-depicts-ice-arresting-holy-family-trump-era-nativity-scene",
    "timestamp": "2025-12-11T20:57:49Z"
  },
  {
    "title": "Kristi Noem Testifies DHS Hasn't Deported Any Veterans. Seconds Later, a Kicked-Out War Hero Calls into the Hearing",
    "description": "Noem was questioned about her department's deportation practices during a tense hearing in Washington, D.C.",
    "link": "https://people.com/kristi-noem-testifies-dhs-hasn-t-deported-veterans-before-kicked-out-war-hero-calls-into-hearing-11867237",
    "timestamp": "2025-12-11T20:55:04Z"
  },
  {
    "title": "CNN reporter clashes with Trump press secretary during chaotic briefing",
    "description": "During Thursday’s press briefing, Kaitlan Collins asked Karoline Leavitt about Trump's claims about the economy.",
    "link": "https://www.nj.com/politics/2025/12/cnn-reporter-clashes-with-trump-press-secretary-during-chaotic-briefing.html",
    "timestamp": "2025-12-11T20:53:58Z"
  },
  {
    "title": "‘Roads Will Not Be Paved’: GOP Think Tank Says Trump Will Cut Off All Funding to Red State Unless It Passes New Map",
    "description": "Pundits and observers, including many well-known conservatives, expressed their shock at Heritage’s threat to hurt the people of Indiana\nThe post ‘Roads Will Not Be Paved’: GOP Think Tank Says Trump Will Cut Off All Funding to Red State Unless It Passes New M…",
    "link": "https://www.mediaite.com/politics/roads-will-not-be-paved-gop-think-tank-says-trump-will-cut-off-all-funding-to-red-state-unless-it-passes-new-map/",
    "timestamp": "2025-12-11T20:53:57Z"
  },
  {
    "title": "Will the Court Rule for Trump or for Wall Street?",
    "description": "As the Supreme Court now considers whether Trump can take over the Federal Reserve, we lose either way.\nThe post Will the Court Rule for Trump or for Wall Street? appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/12/11/will-supreme-court-rule-for-trump-or-wall-street/",
    "timestamp": "2025-12-11T20:53:40Z"
  },
  {
    "title": "DOJ fails again to get grand jury to indict New York AG Letitia James, a Trump target: Reports",
    "description": "The original indictments against Letitia James and former FBI Director James Comey had been dismissed by a judge.",
    "link": "https://www.cnbc.com/2025/12/11/doj-letitia-james-trump-grand-jury.html",
    "timestamp": "2025-12-11T20:50:04Z"
  },
  {
    "title": "Justice Department again fails to re-indict New York Attorney General Letitia James, AP source says (Associated Press)",
    "description": "Associated Press:\nJustice Department again fails to re-indict New York Attorney General Letitia James, AP source says  —  A grand jury declined for a second time to re-indict New York Attorney General Letitia James on Thursday, refusing to resurrect a mortgag…",
    "link": "https://www.memeorandum.com/251211/p98",
    "timestamp": "2025-12-11T20:50:00Z"
  },
  {
    "title": "Justice Department fails to reindict Letitia James for a second time",
    "description": "A grand jury, for a second time, declined to bring a new indictment against Letitia James, the New York attorney general who defeated President Donald Trump and his company in court, according to multiple sources. The Justice Department presented its case aga…",
    "link": "https://freerepublic.com/focus/f-chat/4356976/posts",
    "timestamp": "2025-12-11T20:49:29Z"
  },
  {
    "title": "Rattled Leavitt Cornered on Trump’s Mystery Bandages",
    "description": "White House Press Secretary Karoline Leavitt has sought to dispel fresh speculation about President Donald Trump’s health by insisting that mystery bandages ...",
    "link": "https://www.thedailybeast.com/rattled-leavitt-cornered-on-trumps-mystery-bandages/",
    "timestamp": "2025-12-11T20:47:10Z"
  },
  {
    "title": "'The ham sandwich wins': Trump admin shamed over another failure to indict Trump foe",
    "description": "Amused observers weighed in Thursday after President Donald Trump's Justice Department failed again to prosecute New York Attorney General Letitia James and suffered yet another embarrassing attempt. A grand jury in Virginia refused to return a fraud indictme…",
    "link": "https://www.rawstory.com/letitia-james-2674392735/",
    "timestamp": "2025-12-11T20:46:36Z"
  },
  {
    "title": "Grand Jury Refuses to Reindict Trump Foe Letitia James for Mortage Fraud — For Second Time in a Week",
    "description": "A federal grand jury in Virginia refused to indict New York Attorney General Letitia James for mortgage fraud for the second time in a week, according to a report by ABC News.\nThe post Grand Jury Refuses to Reindict Trump Foe Letitia James for Mortage Fraud —…",
    "link": "https://www.mediaite.com/crime/grand-jury-refuses-to-indict-trump-foe-letitia-james-for-mortage-fraud-for-second-time-in-a-week/",
    "timestamp": "2025-12-11T20:46:31Z"
  },
  {
    "title": "Former special counsel Jack Smith will start law firm with other former prosecutors",
    "description": "Former special counsel Jack Smith and three other former prosecutors who investigated President Donald Trump and the Jan. 6, 2021, attack on the U.S. Capitol are starting their own law firm, which will launch in January, Law.com reports.",
    "link": "https://www.abajournal.com/news/article/former-special-counsel-jack-smith-to-start-law-firm-with-other-former-prosecutors",
    "timestamp": "2025-12-11T20:46:00Z"
  },
  {
    "title": "US intends to seize oil from stormed tanker as Venezuela war fears build",
    "description": "The US took control of the tanker in a dramatic raid that saw US forces rope down from a helicopter onto the vessel.",
    "link": "https://www.thejournal.ie/us-intends-to-seize-oil-from-stormed-tanker-6901296-Dec2025/",
    "timestamp": "2025-12-11T20:45:30Z"
  },
  {
    "title": "After Airbus issue, DOT says airlines don’t have to cover passenger expenses amid aircraft recalls",
    "description": "The guidance comes after widespread disruptions amid the busy Thanksgiving travel period.",
    "link": "https://www.denverpost.com/2025/12/11/after-airbus-issue-dot-says-airlines-dont-have-to-cover-passenger-expenses-amid-aircraft-recalls/",
    "timestamp": "2025-12-11T20:42:23Z"
  },
  {
    "title": "After Airbus issue, DOT says airlines don’t have to cover passenger expenses amid aircraft recalls",
    "description": "The guidance comes after widespread disruptions amid the busy Thanksgiving travel period.",
    "link": "https://www.bostonherald.com/2025/12/11/after-airbus-issue-dot-says-airlines-dont-have-to-cover-passenger-expenses-amid-aircraft-recalls/",
    "timestamp": "2025-12-11T20:42:23Z"
  },
  {
    "title": "US secretly planning five-nation club including Russia to sideline G7 – media",
    "description": "An unpublished US security strategy draft reportedly outlines a five-nation bloc with Russia, China, India and Japan to sideline the G7 Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629336-us-russia-secret-club/",
    "timestamp": "2025-12-11T20:42:21Z"
  },
  {
    "title": "‘My Pillow’ CEO Mike Lindell announces run for governor of Minnesota",
    "description": "He joins a crowded Republican field that wants to unseat Democrat Tim Walz next year.",
    "link": "https://www.wsbtv.com/news/trending/my-pillow-ceo-mike-lindell-announces-run-governor-minnesota/KG2KLXT4WFGSFCIQAQS6U5JYMY/",
    "timestamp": "2025-12-11T20:42:03Z"
  },
  {
    "title": "Trump administration's top 'scientific priority is AI,' energy secretary says",
    "description": "Energy Secretary Chris Wright believes AI will help achieve nuclear fusion within years, creating a synergistic relationship to solve the growing power demands of data centers.",
    "link": "https://www.foxnews.com/media/trump-administrations-top-scientific-priority-ai-energy-secretary-says",
    "timestamp": "2025-12-11T20:41:35Z"
  },
  {
    "title": "Tom Cruise's Impossible Mission! 'Top Gun' Icon 'Didn't Want to' Ask Donald Trump for a Favor as He Plotted to Film a Movie in Outer Space",
    "description": "An insider revealed plans for Tom Cruise's movie filmed in space were put on hold because he didn't want to involve the president.",
    "link": "https://radaronline.com/p/tom-cruise-didnt-want-to-ask-trump-permission-film-space-movie/",
    "timestamp": "2025-12-11T20:40:00Z"
  },
  {
    "title": "‘Morning Joe’ Questions if Trump Will ‘Destroy’ CNN in WBD Sale: ‘Preposterous’ | Video",
    "description": "\"What if George W. Bush said Newsweek needs to go away?\" host Joe Scarborough says\nThe post ‘Morning Joe’ Questions if Trump Will ‘Destroy’ CNN in WBD Sale: ‘Preposterous’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-donald-trump-warner-bros-discovery-sale-joe-scarborough-republicans/",
    "timestamp": "2025-12-11T20:39:02Z"
  }
]