[
  {
    "title": "Trump wants cars made in the USA. The top 10 'most American' cars on the market",
    "description": "Between tariff threats and a proposal for tax deductible interest on loans for American-made cars, President Donald Trump is hoping to encourage automakers to produce their vehicles in the U.S., but none fully are.\nAll cars source at least some parts internat…",
    "link": "https://biztoc.com/x/128d961e0b7791c2",
    "timestamp": "2025-03-06T15:51:59Z"
  },
  {
    "title": "'You've got to cut stuff like Medicaid!' Maria Bartiromo loses cool with GOP lawmaker",
    "description": "Fox Business host Maria Bartiromo lost her cool with Rep. Brandon Gill (R-TX) after he refused to say he would cut Medicaid and other social safety net programs.During an interview on Thursday, Gill suggested Congress could pay for over $4 trillion in tax cut…",
    "link": "https://www.rawstory.com/maria-bartiromo-brandon-gill/",
    "timestamp": "2025-03-06T15:51:44Z"
  },
  {
    "title": "Al Green censured for joint session outburst",
    "description": "The House voted 224-198 Thursday to censure Rep. Al Green for disrupting President Donald Trump’s joint address to Congress this week. \nGreen shouted at Trump during the Tuesday night address and was ordered removed from the House chamber by Speaker Mike John…",
    "link": "https://biztoc.com/x/187466683cd78771",
    "timestamp": "2025-03-06T15:51:43Z"
  },
  {
    "title": "Trump Threatens to Wipe Out Gaza in Chilling Rant",
    "description": "Donald Trump is planning to give Israel everything it needs in order to “finish” Gaza.\r\nIn a harrowing post to Truth Social Wednesday, the president threatened Hamas, as well as the Palestinian public, to release the hostages—or be “dead.”\r\n“‘Shalom Hamas’ me…",
    "link": "https://newrepublic.com/post/192400/donald-trump-threat-gaza-hostages",
    "timestamp": "2025-03-06T15:51:33Z"
  },
  {
    "title": "House votes to censure Rep. Al Green over his protest at Trump’s joint address",
    "description": "US Representative Al Green (D-TX) shouts out as US President Donald Trump speaks during an address to a joint session of Congress at the US Capitol in Washington, DC, on March 4, 2025.",
    "link": "https://biztoc.com/x/97d75f23b3d6ac7b",
    "timestamp": "2025-03-06T15:51:28Z"
  },
  {
    "title": "The House censures Democratic Rep. Al Green for disrupting Trump's joint address to Congress",
    "description": "The House has voted to censure Al Green, a Democratic congressman from Texas, for disrupting President Donald Trump’s address to Congress earlier in the week",
    "link": "https://www.wftv.com/news/politics/house-censures/C5M7RKBVRNEELNRWLASJYUXQSQ/",
    "timestamp": "2025-03-06T15:49:36Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
    "description": "Indian markets closed higher on Thursday as financial and energy stocks surged. The BSE Sensex rose 609.86 points to 74,340.09, while Nifty 50 gained 207.40 points to 22,544.70. RBI’s $21 billion liquidity infusion and lower crude prices boosted investor sent…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/118765822.cms",
    "timestamp": "2025-03-06T15:49:03Z"
  },
  {
    "title": "Dad Of Cancer Survivor Celebrated By Trump Tells Rachel Maddow To 'Shut Her Mouth'",
    "description": "The MSNBC host's ill-advised take after Trump honored 13-year-old DJ Daniel during his speech ticked off the lad's father.",
    "link": "https://www.huffpost.com/entry/dj-daniel-father-shut-your-mouth-rachel-maddow_n_67c9a456e4b0567dda976b38",
    "timestamp": "2025-03-06T15:48:56Z"
  },
  {
    "title": "CDC Rehires About 180 Employees Laid Off Two Weeks Ago",
    "description": "The nation’s top public health agency says about 180 employees who were laid off two weeks ago can come back to work.",
    "link": "https://www.breitbart.com/news/cdc-invites-back-about-180-fired-employees-including-some-who-help-fight-outbreaks/",
    "timestamp": "2025-03-06T15:48:43Z"
  },
  {
    "title": "Trump blasts Rep. Al Green as 'an embarrassment' to Democrats, says he 'should be forced to take an IQ test'",
    "description": "EXCLUSIVE: President Trump told Fox News Digital that Rep. Al Green \"should be forced to pass an IQ test because he is a low IQ individual and we don’t need low IQ individuals in Congress,\" after the Democrat disrupted his joint session address Tuesday.",
    "link": "https://www.foxnews.com/politics/trump-blasts-rep-al-green-an-embarrassment-democrats-says-he-should-forced-take-iq-test",
    "timestamp": "2025-03-06T15:47:43Z"
  },
  {
    "title": "Canada expects trade war with US for the foreseeable future, Trudeau says",
    "description": "Canadian Prime Minister Trudeau says he expects Canada and the US to be in a trade war for the foreseeable future.",
    "link": "https://www.wsbtv.com/news/local/canada-expects-trade-war-with-us-foreseeable-future-trudeau-says/REHIDBRJOBDG7BY7PZ5W2AIPTA/",
    "timestamp": "2025-03-06T15:47:35Z"
  },
  {
    "title": "All goods will likely be exempt from Canada, Mexico tariffs for a month, Commerce Secretary Howard Lutnick says",
    "description": "Commerce Secretary Howard Lutnick said Thursday that goods and services complying with the USMCA trade agreement will likely be exempt from Trump’s tariffs on Canada and Mexico for a month. “It’s likely that it will cover all USMCA compliant goods and service…",
    "link": "https://nypost.com/2025/03/06/business/goods-covered-by-usmca-will-be-exempt-from-tariffs-for-month-howard-lutnick-says/",
    "timestamp": "2025-03-06T15:47:06Z"
  },
  {
    "title": "WATCH: House Democrats Disrupt Censure of Rep. Al Green for Heckling Trump During High-Profile Speech",
    "description": "Rep. Al Green was censured by his colleagues in the House of Representatives for his conduct during President Donald Trump's speech to Congress.\nThe post WATCH: House Democrats Disrupt Censure of Rep. Al Green for Heckling Trump During High-Profile Speech fir…",
    "link": "https://www.mediaite.com/news/just-in-rep-al-green-censured-for-heckling-trump-during-high-profile-speech/",
    "timestamp": "2025-03-06T15:47:05Z"
  },
  {
    "title": "Just 10 Democrats Vote To Censure Al Green For Heckling Trump",
    "description": "The House of Representatives voted largely along party lines Thursday morning to censure Democratic Texas Rep. Al Green for heckling President Donald Trump.",
    "link": "https://dailycaller.com/2025/03/06/10-democrats-vote-censure-al-green-heckling-trump/",
    "timestamp": "2025-03-06T15:46:19Z"
  },
  {
    "title": "US 'energy dominance': Wright, Burgum visit Louisiana liquefied natural gas facility amid $18B expansion",
    "description": "FIRST ON FOX: Energy Secretary Chris Wright and Interior Secretary Doug Burgum are traveling to a Louisiana-based Liquified Natural Gas exporter Thursday, as the company announces a massive $18 billion expansion of its existing facility.",
    "link": "https://www.foxnews.com/politics/us-energy-dominance-wright-burgum-visit-louisiana-liquefied-natural-gas-facility-amid-18b-expansion",
    "timestamp": "2025-03-06T15:46:09Z"
  },
  {
    "title": "House censures Al Green over Trump speech interuption",
    "description": "Green offered no regrets when he explained his actions on the House floor and said he'd do it again.",
    "link": "https://www.wcvb.com/article/house-censures-al-green-trump-speech/64070458",
    "timestamp": "2025-03-06T15:44:47Z"
  },
  {
    "title": "Hamas says Trump's threats encourage Netanyahu to evade Gaza ceasefire deal",
    "description": "CAIRO: Hamas said on Thursday (Mar 6) that United States President Donald Trump's repeated threats against Palestinians constituted support for Israel's Prime Minister Benjamin Netanyahu to back out of the Gaza ceasefire and intensify the siege of Gazans. Tru…",
    "link": "https://www.channelnewsasia.com/world/hamas-gaza-ceasefire-trump-threats-encourage-netanyahu-evade-deal-4981416",
    "timestamp": "2025-03-06T15:44:00Z"
  },
  {
    "title": "Hamas accuses Trump of aiding Israel’s Netanyahu in Gaza blockade",
    "description": "Hamas says Trump's rhetoric helps Israel to tighten Gaza siege, risking starvation for 2.3 million residents.",
    "link": "https://www.aljazeera.com/news/2025/3/6/hamas-accuses-trump-of-aiding-israels-netanyahu-in-gaza-blockade",
    "timestamp": "2025-03-06T15:43:41Z"
  },
  {
    "title": "IAB Canada Reflection on Trump Tariffs Impact to Canadian Digital Advertising",
    "description": "As Trump's tariffs drive up costs and strain budgets, the Canadian digital advertising industry must adapt, innovate, and assert its vital role in sustaining businesses and economic growth.\nThe post IAB Canada Reflection on Trump Tariffs Impact to Canadian Di…",
    "link": "https://iabcanada.com/iab-canada-reflection-on-trump-tariffs-impact-to-canadian-digital-advertising/",
    "timestamp": "2025-03-06T15:43:40Z"
  },
  {
    "title": "The House censures Democratic Rep. Al Green for disrupting Trump's joint address to Congress",
    "description": "The House on Thursday voted to censure an unrepentant Rep. Al Green, D-Texas, for disrupting President Donald Trump's address to Congress.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_6d979e3b-da3b-52f5-8f55-3b45a32e508b.html",
    "timestamp": "2025-03-06T15:43:00Z"
  },
  {
    "title": "Tuberville says a bit too much about Elon Musk and DOGE’s reach",
    "description": "Republican Sen. Tommy Tuberville said Elon Musk and his surrogates “know what they’re doing a hell of a lot more” than he does. That wasn't exactly reassuring.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tuberville-says-bit-much-elon-musk-doges-reach-rcna195109",
    "timestamp": "2025-03-06T15:42:29Z"
  },
  {
    "title": "China’s envoy to the EU Lu Shaye ‘appalled’ by Trump’s treatment of Europe",
    "description": "In comments on the CPPCC sidelines, the diplomat reiterated that Ukrainian peace cannot be determined only by US and Russia. China’s special envoy for European affairs Lu Shaye said he was “appalled” by the way President Donald Trump had treated American alli…",
    "link": "https://freerepublic.com/focus/f-chat/4302510/posts",
    "timestamp": "2025-03-06T15:40:50Z"
  },
  {
    "title": "Donald Trump confuses transgenic mice with 'transgender mice'; what are they?",
    "description": "In his first Congressional address of his second term, Donald Trump mistakenly referred to 'transgenic mice' as 'transgender mice' while criticizing the Biden administration's spending on genetic research. Transgenic mice, crucial for studying diseases and de…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trump-confuses-transgenic-mice-with-transgender-mice-what-are-they/articleshow/118765596.cms",
    "timestamp": "2025-03-06T15:40:16Z"
  },
  {
    "title": "Trump’s Administration Orders Staffers To Stop Reading the News at Work",
    "description": "Donald Trump’s Social Security Administration just directed employees not to read “general news” content on their work computers.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-order-social-security-staffers-stop-reading-news-1235290086/",
    "timestamp": "2025-03-06T15:39:52Z"
  },
  {
    "title": "About 20 countries could join Ukraine coalition, UK says",
    "description": "The countries, largely from Europe and the Commonwealth, would not all send troops but are offering support.",
    "link": "https://www.bbc.com/news/articles/c2017v5ngxpo",
    "timestamp": "2025-03-06T15:39:47Z"
  },
  {
    "title": "Trudeau says Canada will not back down as Trump eyes larger tariff exemptions",
    "description": "'I can confirm that we will continue to be in a trade war that was launched by the United States for the foreseeable future,' Trudeau said",
    "link": "https://nationalpost.com/news/canada/justin-trudeau-canada-trump-war-trump",
    "timestamp": "2025-03-06T15:38:59Z"
  },
  {
    "title": "Anti-Trump Connecticut Dems bolster Planned Parenthood with $800K to stockpile abortion pills",
    "description": "Connecticut Democrats are attempting to “fight back” against President Donald Trump’s landslide national election and a White House agenda that has already included multiple pro-life initiatives. One of two bills passed by the state legislature last week thro…",
    "link": "https://freerepublic.com/focus/f-news/4302509/posts",
    "timestamp": "2025-03-06T15:38:59Z"
  },
  {
    "title": "DAVID MARCUS: ‘Hamilton’ cancels itself as the Left continues to divide us",
    "description": "Columnist David Marcus, who previously worked in theater, takes 'Hamilton' producers to task for pulling out of Kennedy Center performances.",
    "link": "https://www.foxnews.com/opinion/david-marcus-hamilton-cancels-itself-left-continues-divide-us",
    "timestamp": "2025-03-06T15:37:46Z"
  },
  {
    "title": "US 'destroying' world order, says Ukraine's ambassador to UK",
    "description": "LONDON: The United States is \"destroying\" the established world order as it tears up its stance on Russia's invasion of Ukraine, Kyiv's ambassador to the UK said on Thursday (Mar 6). Valery Zaluzhny, who became ambassador in 2024 after three years as commande…",
    "link": "https://www.channelnewsasia.com/world/us-destroying-world-order-ukraine-ambassador-united-kingodm-4982846",
    "timestamp": "2025-03-06T15:36:56Z"
  },
  {
    "title": "Even your weight loss drugs aren't safe from tariffs",
    "description": "Novo Nordisk (NVO), the maker of the popular diabetes and weight-loss drugs Ozempic and Wegovy, expects at least some short-term impacts from President Donald Trump’s proposed tariffs.Read more...",
    "link": "https://qz.com/novo-nordisk-ceo-trump-tariffs-ozempic-1851768029",
    "timestamp": "2025-03-06T15:36:00Z"
  },
  {
    "title": "Trump's trade war and DOGE's work caused a 245% surge in U.S. layoff announcements",
    "description": "The Trump administration’s trade policies and approach to government downsizing fueled the highest number of announced layoffs since the Great Recession.Read more...",
    "link": "https://qz.com/trump-trade-war-doge-cuts-layoffs-covid-recession-1851768022",
    "timestamp": "2025-03-06T15:36:00Z"
  },
  {
    "title": "US government missed $17B profit by liquidating Bitcoin instead of holding",
    "description": "The US government may have missed out on a staggering $17 billion by liquidating its Bitcoin holdings instead of holding them long-term, according to White House AI and Crypto Tzar David Sacks. In a March 6 post on X, Sacks referenced an AI chatbot Grok analy…",
    "link": "https://cryptoslate.com/insights/us-government-missed-17b-profit-by-liquidating-bitcoin-instead-of-holding/",
    "timestamp": "2025-03-06T15:35:36Z"
  },
  {
    "title": "Cling to Your Disgust",
    "description": "The artist formerly known as Kanye West thinks this is a great time for a comeback. He might be right.",
    "link": "https://www.theatlantic.com/culture/archive/2025/03/kanye-west-ye-twitter-elon-musk/681936/",
    "timestamp": "2025-03-06T15:33:25Z"
  },
  {
    "title": "House votes to censure Rep. Al Green for disrupting Trump's speech to Congress",
    "description": "The Republican-controlled House on Thursday voted to censure Rep. Al Green, D-Texas, for disrupting President Donald Trump’s address to Congress on Tuesday.",
    "link": "https://www.nbcnews.com/politics/congress/house-votes-censure-rep-al-green-disrupting-trumps-speech-congress-rcna195020",
    "timestamp": "2025-03-06T15:33:22Z"
  },
  {
    "title": "Trump Tariffs Threaten China's Economy With More Pain",
    "description": "China has set a 5-percent GDP growth target for 2025, but the economy continues to struggle under a prolonged property market slump",
    "link": "https://www.newsweek.com/china-deflation-gdp-economy-trump-tariff-2040346",
    "timestamp": "2025-03-06T15:33:14Z"
  },
  {
    "title": "Why provinces are using liquor leverage in U.S. trade war",
    "description": "Calling time on U.S. alcohol has been a popular move among Canadians looking to fight back in the U.S. trade war. Read more here",
    "link": "https://financialpost.com/news/retail-marketing/provinces-using-liquor-in-trade-war",
    "timestamp": "2025-03-06T15:32:49Z"
  },
  {
    "title": "Hannity: Democrats Refused To Applaud A Child With Cancer, Firefighter Killed At Trump Rally & Man Held Hostage By Russia",
    "description": "FOX News host Sean Hannity recaps President Donald Trump’s joint address to Congress on ‘Hannity.’ The host said Democrats showed their \"true colors\" that they are a party that is heartless and soulless.\r\n\r\nSEAN HANNITY, FOX NEWS HOST: And welcome to \"Hannity…",
    "link": "https://www.realclearpolitics.com/video/2025/03/06/hannity_democrats_refused_to_applaud_a_child_with_cancer_firefighter_killed_at_trump_rally__man_held_hostage_by_russia.html",
    "timestamp": "2025-03-06T15:32:49Z"
  },
  {
    "title": "House votes to censure Rep. Al Green over his protest at Trump’s joint address",
    "description": "House Republicans have voted to censure Rep. Al Green, D-Texas, who was removed from the chamber after he disrupted President Donald Trump’s joint address to Congress.",
    "link": "https://www.msnbc.com/top-stories/latest/al-green-censure-protest-trump-joint-address-rcna195094",
    "timestamp": "2025-03-06T15:32:37Z"
  },
  {
    "title": "Trump admin declares Maine violated Title IX by letting trans athletes play in girls' sports",
    "description": "The Department of Health and Human Services served a notice of Title IX violation to Maine after it defied Trump's executive order to protect girls' sports.",
    "link": "https://www.foxnews.com/sports/trump-admin-declares-maine-violated-title-ix-letting-trans-athletes-play-girls-sports",
    "timestamp": "2025-03-06T15:32:27Z"
  },
  {
    "title": "Texas Democrat Al Green censured after repeatedly interrupting Trump’s speech to Congress - NewsBreak",
    "description": "The House has voted to censure Texas Democratic Rep. Al Green for his repeated interruptions of President Donald Trump ’s speech to a joint session of Con",
    "link": "https://www.newsbreak.com/share/3843441520261-texas-democrat-al-green-censured-after-repeatedly-interrupting-trump-s-speech-to-congress?s=a99&share_destination_id=ODc0MTM0MzItMTc0MTI3ODM4NTY2MA%3D%3D&pd=05umE4Wm&hl=en_US&send_time=1741278385&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v9%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v4",
    "timestamp": "2025-03-06T15:32:27Z"
  },
  {
    "title": "Texas Democrat Al Green censured after repeatedly interrupting Trump’s speech to Congress - NewsBreak",
    "description": "The House has voted to censure Texas Democratic Rep. Al Green for his repeated interruptions of President Donald Trump ’s speech to a joint session of Con",
    "link": "https://www.newsbreak.com/share/3843441520261-texas-democrat-al-green-censured-after-repeatedly-interrupting-trump-s-speech-to-congress?s=a2&share_destination_id=MjA0NjgzMzc3LTE3NDEyNzg1MjkzOTU%3D&pd=0DqpUnZo&hl=en_US&send_time=1741278529&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v2%2Cns_local_strategy_25q1_exp-v1%2Cns_foryou_rank_exp_25q1-v3",
    "timestamp": "2025-03-06T15:32:27Z"
  },
  {
    "title": "China Warns The U.S. It's Ready For 'A Tariff War, A Trade War Or Any Other Type Of War'",
    "description": "Beijing issued the forceful statement following the Trump administration's move to double the tariffs already in place for Chinese imports.",
    "link": "https://www.huffpost.com/entry/china-issues-warning-to-the-us_n_67c99103e4b020af8d92c2a7",
    "timestamp": "2025-03-06T15:32:22Z"
  },
  {
    "title": "South Africa, Indonesia say US withdrawing from climate finance deal",
    "description": "The United States has pulled out of a climate funding deal struck by rich nations to help their developing counterparts transition to clean energy, the programme’s first beneficiary South Africa and Indonesia said Thursday. The so-called Just Energy Transitio…",
    "link": "https://www.digitaljournal.com/world/south-africa-indonesia-say-us-withdrawing-from-climate-finance-deal/article",
    "timestamp": "2025-03-06T15:32:21Z"
  },
  {
    "title": "World’s sea ice cover hits record low in February",
    "description": "Global sea ice cover fell to a historic low in February when the world continued to experience exceptional heat and temperatures reached 11 degrees Celsius above average near the North Pole, Europe’s climate monitor said on Thursday. The Copernicus Climate Ch…",
    "link": "https://www.digitaljournal.com/world/worlds-sea-ice-cover-hits-record-low-in-february/article",
    "timestamp": "2025-03-06T15:32:21Z"
  },
  {
    "title": "Here’s how tariff has created curiosity among Americans amid buzz around Trump’s policies",
    "description": "A recent analysis by The New York Times has provided some crucial insights into how a significant number of Americans might be lacking the proper understanding of what tariffs are. According to the results, the opinion of the American public on the topic coul…",
    "link": "https://economictimes.indiatimes.com/news/international/us/heres-how-tariff-has-created-curiosity-among-americans-amid-buzz-around-trumps-policies/articleshow/118765539.cms",
    "timestamp": "2025-03-06T15:32:18Z"
  },
  {
    "title": "Trudeau’s record may be spotty, but his biggest accomplishment was a national child-care program",
    "description": "Whoever replaces Justin Trudeau as prime minister must prioritize the further expansion of the his government’s child-care program in the years ahead.",
    "link": "https://theconversation.com/trudeaus-record-may-be-spotty-but-his-biggest-accomplishment-was-a-national-child-care-program-251318",
    "timestamp": "2025-03-06T15:32:14Z"
  },
  {
    "title": "Fed’s Harker Warns Rising Inflation Pressures Threaten Progress",
    "description": "Federal Reserve Bank of Philadelphia President Patrick Harker said risks to the economy are rising as businesses and consumers become more cautious and inflationary pressures build.",
    "link": "https://financialpost.com/pmn/business-pmn/feds-harker-warns-rising-inflation-pressures-threaten-progress",
    "timestamp": "2025-03-06T15:31:55Z"
  },
  {
    "title": "Dems throw House into chaos after 10 moderates join GOP to punish Al Green",
    "description": "The House of Representatives voted to censure Rep. Al Green over his outburst during President Donald Trump's address to Congress.",
    "link": "https://www.foxnews.com/politics/10-dems-join-republicans-punish-al-green-trump-speech-outburst",
    "timestamp": "2025-03-06T15:31:40Z"
  },
  {
    "title": "House Censures Democratic Rep. Al Green For Disrupting Trump Speech",
    "description": "Republicans expressed outrage at Green's \"breach of decorum\" while continuing to make excuses for the president's role in a violent mob assault on the Capitol.",
    "link": "https://www.huffpost.com/entry/house-censures-al-green-trump-speech_n_67c9a59ae4b0ea654f6e42de",
    "timestamp": "2025-03-06T15:31:29Z"
  },
  {
    "title": "Layoffs in USA: What do we know about job cuts by Trump administration, other firms?",
    "description": "Weekly applications for jobless benefits are considered a proxy for layoffs, which have remained mostly in a range between 200,000 and 250,000 for years.",
    "link": "https://economictimes.indiatimes.com/news/international/us/layoffs-in-usa-what-do-we-know-about-job-cuts-by-trump-administration-other-firms/articleshow/118765502.cms",
    "timestamp": "2025-03-06T15:31:19Z"
  },
  {
    "title": "Trump trades are upended as Treasury returns beat U.S. stocks",
    "description": "U.S. Treasuries are now outperforming stocks since Donald Trump was elected President, and some strategists say there’s room for those gains to run. A Bloomberg gauge of U.S. sovereign debt has returned 2.1 per cent since the Nov. 5 vote, beating a gain of 1.…",
    "link": "https://freerepublic.com/focus/f-chat/4302505/posts",
    "timestamp": "2025-03-06T15:30:41Z"
  },
  {
    "title": "Trudeau expects a trade war between Canada and the US for the ‘foreseeable future’",
    "description": "Trudeau made the comments after having what he called a colorful but constructive call with Trump this week.",
    "link": "https://www.bostonherald.com/2025/03/06/trudeau-canada-us-tariffs/",
    "timestamp": "2025-03-06T15:30:00Z"
  },
  {
    "title": "Cuomo officially enters mayoral race",
    "description": "He’s back.In a long-expected move, disgraced former New York State Gov. Andrew Cuomo announced his candidacy for mayor of NYC on March 1.",
    "link": "https://www.qchron.com/editions/queenswide/cuomo-officially-enters-mayoral-race/article_73bb6dc0-f8c3-5493-8ac9-b9e8529784f3.html",
    "timestamp": "2025-03-06T15:30:00Z"
  },
  {
    "title": "Trudeau expects a trade war between Canada and the US for the 'foreseeable future'",
    "description": "Canadian Prime Minister Justin Trudeau said Thursday he expects Canada and the U.S. to be in a trade war for the foreseeable future after having what he called a colorful but constructive call with U.S. President Donald Trump this week.\nTrudeau said the two s…",
    "link": "https://biztoc.com/x/bf62a497f7ea217f",
    "timestamp": "2025-03-06T15:29:59Z"
  },
  {
    "title": "Stocks tumble as Trump tariff fallout continues",
    "description": "A selloff on Thursday erased some of the gains a day earlier.",
    "link": "https://abcnews.go.com/Business/stocks-tumble-tariff-fallout-roils-markets/story?id=119508907",
    "timestamp": "2025-03-06T15:29:52Z"
  },
  {
    "title": "After Elon Musk, Canadians target Donald Trump with petition",
    "description": "Over 42,000 Canadians have signed a petition to bar U.S. President Donald Trump from entering Canada ahead of the G7 Summit in Alberta this June. The petition argues that Trump is a convicted felon and that Canadian law prevents felons from entering the count…",
    "link": "https://mobilesyrup.com/2025/03/06/canada-targets-trump-with-petition/",
    "timestamp": "2025-03-06T15:29:39Z"
  },
  {
    "title": "Trump vows to 'change' trade deficit figures",
    "description": "United States President Donald Trump promised on Thursday that he will \"change\" the situation concerning the country's trade deficit, which rose in January by $33 billion month-on-month to $131.4 bill...",
    "link": "https://biztoc.com/x/8f096521e5df723c",
    "timestamp": "2025-03-06T15:29:30Z"
  },
  {
    "title": "Trump-backed World Liberty Financial attracts another crypto collaborator: Sui Foundation",
    "description": "Sui Foundation aligning itself with the crypto project backed by U.S. President Donald Trump and his sons.",
    "link": "https://biztoc.com/x/5a2ae8347b649732",
    "timestamp": "2025-03-06T15:29:24Z"
  },
  {
    "title": "Bitcoin as a US strategic reserve: Does it make sense?",
    "description": "Donald Trump hosts a cryptocurrency summit at the White House on Friday amid much anticipation about his plans for a national stockpile of digital currencies. Buying bitcoin at all-time highs could be a costly move.",
    "link": "https://biztoc.com/x/3eb73bfd519b3d63",
    "timestamp": "2025-03-06T15:29:08Z"
  },
  {
    "title": "Top Trump allies hold talks with Zelensky's political opponents, Politico reports",
    "description": "Discussions were held on whether Ukraine could have quick presidential elections, according to the report.",
    "link": "https://www.jpost.com/breaking-news/article-845024",
    "timestamp": "2025-03-06T15:29:04Z"
  },
  {
    "title": "Why buying Canadian is more helpful than investing Canadian",
    "description": "TORONTO — A stirring of unfamiliar patriotism in response to U.S. hostility is leading many Canadians to spend money closer to home, but on the question of investing more domestically, experts say there’s less reason to shift habits. Investing more in Canada …",
    "link": "https://toronto.citynews.ca/2025/03/06/why-buying-canadian-is-more-helpful-than-investing-canadian/",
    "timestamp": "2025-03-06T15:28:53Z"
  },
  {
    "title": "Trump to Sign Order Abolishing Education Department Today",
    "description": "Trump to Sign Order Abolishing Education Department Today\n\n \n\n\n \nKatherine Knott\n\nThu, 03/06/2025 - 10:28 AM\n\nThe long-awaited directive comes as the agency is preparing to lay off likely hundreds of employees and just days after Secretary Linda McMahon took …",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/03/06/trump-reportedly-set-order-dismantling-education-dept",
    "timestamp": "2025-03-06T15:28:00Z"
  },
  {
    "title": "Crypto Czar David Sacks Says U.S. Can HODL Bitcoin Ahead of White House Summit",
    "description": "David Sacks’ observation mirrored President Donald Trump’s initial vision for a “strategic Bitcoin stockpile.”",
    "link": "https://decrypt.co/308910/crypto-czar-david-sacks-says-u-s-can-hodl-bitcoin-ahead-of-white-house-summit",
    "timestamp": "2025-03-06T15:27:55Z"
  },
  {
    "title": "EU state says ‘huge amount’ of Ukraine aid ‘lost’",
    "description": "Slovak Prime Minister Robert Fico has pledged to raise the issue of corruption at a meeting in Brussels Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613828-slovakia-ukraine-aid-lost/",
    "timestamp": "2025-03-06T15:27:08Z"
  },
  {
    "title": "Trump considering major NATO policy shift",
    "description": "President Donald Trump has talked with aides about favoring NATO members that spend a set percentage of their GDP on defense, sources told NBC News.",
    "link": "https://www.nbcnews.com/politics/national-security/trump-considering-major-nato-policy-shift-rcna195089",
    "timestamp": "2025-03-06T15:27:03Z"
  },
  {
    "title": "The Latest: Trump's economic disruptions moving markets downward",
    "description": "Anxiety has returned to Wall Street with markets poised to give back much of Wednesday’s gains, which were spurred by President Donald Trump’s one-month exemption for U.S. automakers on his 25% tariffs for Mexican and Canadian imports",
    "link": "https://abcnews.go.com/US/wireStory/latest-trumps-economic-disruptions-moving-markets-downward-119508033",
    "timestamp": "2025-03-06T15:26:25Z"
  },
  {
    "title": "Trump wants to dismantle the Education Department. Here's what it does",
    "description": "President Donald Trump has said he wants his new education chief, Linda McMahon, to “put herself out of a job” and close the Education Department",
    "link": "https://abcnews.go.com/US/wireStory/trump-dismantle-education-department-119511925",
    "timestamp": "2025-03-06T15:26:00Z"
  },
  {
    "title": "TSMC's Arizona chip fab production is sold out through late 2027",
    "description": "As TSMC's capacities are fully booked through late 2027, its customers asked for more capacity in the U.S., says C.C. Wei.",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tsmcs-arizona-chip-fab-production-is-sold-out-through-late-2027",
    "timestamp": "2025-03-06T15:25:43Z"
  },
  {
    "title": "Jimmy Kimmel Says The Trump Admin Would “Release Diddy” Before They Release The Complete Jeffrey Epstein Files",
    "description": "Kimmel questioned why the next batch of Epstein files will have to be redacted due to \"national security reasons.\"",
    "link": "https://decider.com/2025/03/06/jimmy-kimmel-trump-admin-release-diddy-complete-jeffrey-epstein-files/",
    "timestamp": "2025-03-06T15:23:26Z"
  },
  {
    "title": "UN releases emergency aid reserves after ‘brutal’ cuts from donors",
    "description": "UN-AID/USA-TRUMP (PIX):UN releases emergency aid reserves after 'brutal' cuts from donors",
    "link": "https://www.irishtimes.com/world/2025/03/06/un-releases-emergency-aid-reserves-after-brutal-cuts-from-donors/",
    "timestamp": "2025-03-06T15:22:13Z"
  },
  {
    "title": "Maintaining Progress in a Post-American World",
    "description": "Most governments recognize the importance of pandemic prevention, orderly trade, effective corporate taxation, and the fight against climate change. The question is whether they can find common ground on each of these issues, and pursue a shared agenda withou…",
    "link": "https://www.project-syndicate.org/commentary/coalitions-of-the-willing-to-replace-american-leadership-under-trump-by-olivier-blanchard-and-jean-pisani-ferry-2025-03",
    "timestamp": "2025-03-06T15:22:11Z"
  },
  {
    "title": "Good Trouble: Rep. Al Green Likely To Be Censured By Congress Following Outburst At Trump Speech, Bravely Shows No Remorse",
    "description": "Rep. Al Green is likely to be censured by Republicans for his outburst during President Donald Trump’s recent speech to Congress.\nThe post Good Trouble: Rep. Al Green Likely To Be Censured By Congress Following Outburst At Trump Speech, Bravely Shows No Remor…",
    "link": "http://bossip.com/2797835/rep-al-green-censured-trump-outburst-congress/",
    "timestamp": "2025-03-06T15:22:05Z"
  },
  {
    "title": "Good Trouble: Rep. Al Green Likely To Be Censured By Congress Following Outburst At Trump Speech, Bravely Shows No Remorse",
    "description": "Rep. Al Green likely to be censured by Republicans for his outburst during President Donald Trump’s recent speech to Congress\nThe post Good Trouble: Rep. Al Green Likely To Be Censured By Congress Following Outburst At Trump Speech, Bravely Shows No Remorse a…",
    "link": "http://bossip.com/2797835/rep-al-green-likely-to-be-censured-for-outburst-at-trump/",
    "timestamp": "2025-03-06T15:22:05Z"
  },
  {
    "title": "'We are not 51st anything': Beer ad icon returns after 25 years amid Trump tariffs, annexation threats",
    "description": "US-Canada tariff battle: 25 years later, Joe Canadian is back with a new patriotic video as Canada and US are engaged in a tariff battle. In 2000, he appeared in a highly popular ad for Molson Canadian beer and became a national sensation. But the video strik…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-tariff-canada-we-are-not-51st-anything-beer-ad-icon-jeff-douglas-returns-after-25-years-amid-trump-tariffs-annexation-threats/articleshow/118765236.cms",
    "timestamp": "2025-03-06T15:21:52Z"
  },
  {
    "title": "'Wouldn't get behind that': Marjorie Taylor Greene's boyfriend opposes GOP on latest move",
    "description": "Brian Glenn, the pro-MAGA White House correspondent dating Rep. Marjorie Taylor Greene (R-GA), argued that House Republicans should not censure Rep. Al Greene (D-TX) for his outburst at President Donald Trump's speech to a joint session of Congress.Glenn oppo…",
    "link": "https://www.rawstory.com/brian-glenn-al-green-censure/",
    "timestamp": "2025-03-06T15:21:11Z"
  },
  {
    "title": "Trump begins CIA cuts – NYT",
    "description": "Washington has started firing CIA employees amid Donald Trump’s overhaul of government agencies, the New York Times reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613820-cia-trump-staff-cuts/",
    "timestamp": "2025-03-06T15:21:06Z"
  },
  {
    "title": "Layoffs Hit Unbelievable High Thanks to Trump and Musk",
    "description": "U.S. workers are being laid off at levels not seen since the Great Recession in 2009, all thanks to Donald Trump and Elon Musk’s Department of Government Efficiency. \r\nA new report from Challenger, Gray, and Christmas, an international firm that helps laid of…",
    "link": "https://newrepublic.com/post/192409/layoffs-trump-musk",
    "timestamp": "2025-03-06T15:21:00Z"
  },
  {
    "title": "Social Security Administration bars employees from reading the news at work",
    "description": "The Social Security Administration wrote in a Thursday morning email that employees can no longer read news websites on work devices.",
    "link": "https://www.nbcnews.com/politics/trump-administration/social-security-administration-bars-employees-reading-news-work-rcna195096",
    "timestamp": "2025-03-06T15:20:46Z"
  },
  {
    "title": "President Trump preps executive order to dismantle Education Department - NewsBreak",
    "description": "President Trump would direct Linda McMahon to \"take all necessary steps to facilitate the closure\" of the Education Department under a draft order.",
    "link": "https://www.newsbreak.com/share/3843346144948-president-trump-preps-executive-order-to-dismantle-education-department?s=a2&amp;share_destination_id=MjAyNDU1NzU3LTE3NDEyNzQ0MDE1NDQ%3D&amp;pd=0DhTzRj6&amp;hl=en_US&amp;send_time=1741274401&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v8",
    "timestamp": "2025-03-06T15:20:33Z"
  },
  {
    "title": "Trade wars have no winners, S&P economists say, trimming GDP forecasts",
    "description": "The trade war President Donald Trump has initiated will reduce economic growth and boost jobless rates and inflation across the board, according to economists at S&P Global (SPGI).Read more...",
    "link": "https://qz.com/trump-trade-war-growth-inflation-us-canada-mexico-china-1851768024",
    "timestamp": "2025-03-06T15:20:00Z"
  },
  {
    "title": "US trade gap hits new record in January as tariff fears loomed",
    "description": "The US trade deficit surged to a new record in January, government data showed Thursday, as imports spiked while tariff worries flared in the month of President Donald Trump's inauguration. In January, imports came in at $401.2 billion, and this was $36.6 bil…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-trade-gap-hits-new-record-in-january-as-tariff-fears-loomed/articleshow/118765378.cms",
    "timestamp": "2025-03-06T15:19:26Z"
  },
  {
    "title": "The Hollywood Exec Who Proved Speaking Out Can Be Good Business",
    "description": "Harry Warner, founding President of Warner Bros. serves as an example of how to a grow business while exercising political savvy.",
    "link": "https://time.com/7210586/hollywood-exec-warner-bros/",
    "timestamp": "2025-03-06T15:19:11Z"
  },
  {
    "title": "Trump’s tariffs worry companies. Here’s what they’ve been saying about them",
    "description": "Trump’s tariffs worry companies. Here’s what they’re saying about the uncertainty.\nCompanies are assuming tariffs will be a ‘disturbance’ to earnings, but they don’t know how much\nIf there’s one thing consumer-facing companies know about the tariffs President…",
    "link": "https://biztoc.com/x/aabdf1770168b254",
    "timestamp": "2025-03-06T15:19:00Z"
  },
  {
    "title": "Powerball winning numbers for today's draw, 03/05/25: Jackpot of $295 Million",
    "description": "US News. China warns Donald Trump: 'If he wants war, of any kind, we will fight to the end'\n- US News. DOGE Stimulus Payment Requirements: Who Qualifies for a Possible $5,000 Payment?\nDid you buy a ticket? Find out below if your ticket made you the happy Powe…",
    "link": "https://biztoc.com/x/d16ea295abf83a30",
    "timestamp": "2025-03-06T15:18:20Z"
  },
  {
    "title": "Europe Ukraine latest: EU leaders hold emergency talks on increasing military spending for Ukraine",
    "description": "European Union leaders are holding emergency talks on ways to quickly increase their military budgets after the Trump administration signaled that Europe must take care of its own security and also suspended assistance to Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/europe-ukraine-latest-eu-leaders-hold-emergency-talks-119502671",
    "timestamp": "2025-03-06T15:18:16Z"
  },
  {
    "title": "Iran Responds to Trump's Plans for Gaza",
    "description": "Donald Trump has proposed a U.S. takeover of the Gaza Strip and the departure of its Palestinian inhabitants for reconstruction after the Israel-Hamas war",
    "link": "https://biztoc.com/x/cdbae87a4f799bcf",
    "timestamp": "2025-03-06T15:18:13Z"
  },
  {
    "title": "Zakharova: There is no euphoria over Trump in Russia",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova denied on Thursday that Moscow feels \"euphoric\" over United States President Donald Trump. She further said the Russian government retains \"absolut...",
    "link": "https://biztoc.com/x/510f99a4168f2157",
    "timestamp": "2025-03-06T15:18:10Z"
  },
  {
    "title": "Tell us: how you have been impacted by the change to US student loan repayments?",
    "description": "We would like to hear from those whose income-driven repayment options have changed recently due to Trump\nThe online application form for several popular student debt repayment plans, such as income-driven repayment plans (IDR), have been taken down by the Do…",
    "link": "https://biztoc.com/x/b930e9ba4c8830d3",
    "timestamp": "2025-03-06T15:18:09Z"
  },
  {
    "title": "Dow falls more than 500 points as Wall Street gets rattled by tariff turmoil",
    "description": "The S&P 500 Index and the tech-heavy Nasdaq Composite were also down more than 1% at the start of trading on Thursday.",
    "link": "https://nypost.com/2025/03/06/business/dow-falls-over-500-points-as-markets-fear-tariff-turmoil/",
    "timestamp": "2025-03-06T15:18:08Z"
  },
  {
    "title": "Donald Trump's niece says one of the president's comments has sent a 'chill' down her spine",
    "description": "Donald Trump's niece Mary is not a fan of his, and she said that one of the comments he made sent a 'chill' down her spine",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-niece-mary-comments-671281-20250306",
    "timestamp": "2025-03-06T15:17:49Z"
  }
]