[
  {
    "title": "Has Google renamed Canada as the 51st U.S. state, as Donald Trump claims?",
    "description": "Google Maps has mislabeled several provincial parks in British Columbia and Alberta as state parks, causing confusion. In response, Google Canada denied recent changes and promised updates. Concurrently, U.S. President Trump’s comments about Canada becoming t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/has-google-renamed-canada-as-uss-51st-state-as-donald-trump-says/articleshow/118560188.cms",
    "timestamp": "2025-02-25T13:24:49Z"
  },
  {
    "title": "Posthaste: Four things that would be 'kryptonite' to Donald Trump's tariff threats",
    "description": "Donald Trump doubled down on threats to impose punishing tariffs on Canada and Mexico Monday, saying the 25-per-cent levies were “on schedule” to go ahead March 4.\nThe prospect is a daunting one for Canada with economists warning that a protracted trade war c…",
    "link": "https://biztoc.com/x/2e2b72b20fecd401",
    "timestamp": "2025-02-25T13:22:14Z"
  },
  {
    "title": "Donald Trump Declines To Call Putin Dictator",
    "description": "President Donald Trump refused to label his Russian counterpart Vladimir Putin a dictator on Monday, despite having called the Ukrainian leader one in a post on his social-media platform, Truth Social, last week.\nNewsweek has contacted Ukraine's Foreign Minis…",
    "link": "https://biztoc.com/x/51a25a42cf69e9ee",
    "timestamp": "2025-02-25T13:22:04Z"
  },
  {
    "title": "Japan not 'main target' for Trump tariffs: Wilbur Ross",
    "description": "NEW YORK -- As U.S. President Donald Trump uses the threat of tariffs to try to push trading partners into deals, former Secretary of Commerce Wilbur Ross says Japan is an important ally that is unlikely to be a major target of such pressure.\nTrump's oppositi…",
    "link": "https://biztoc.com/x/bf7b918d7a8e9743",
    "timestamp": "2025-02-25T13:21:59Z"
  },
  {
    "title": "Emil Bove has accused others of ethical misconduct. But he has had his own issues",
    "description": "Trump attorney Emil Bove looks on as US President-elect Donald Trump appears remotely for a sentencing hearing in front of New York State Judge Juan Merchan with his attorney Todd Blanche (L) at Manhattan Criminal Court on January 10, 2025 in New York City.",
    "link": "https://biztoc.com/x/6e7cec54f4fd0d1c",
    "timestamp": "2025-02-25T13:21:52Z"
  },
  {
    "title": "Transgender Youth Have Better Emotional Health After Taking Hormones, New Study Finds",
    "description": "Hormone therapy improves transgender young people's well-being and social relationships, but Trump’s recent executive order and state bans threaten to take it away",
    "link": "https://www.scientificamerican.com/article/transgender-youth-have-better-emotional-health-after-taking-hormones-new/",
    "timestamp": "2025-02-25T13:20:47Z"
  },
  {
    "title": "China not keen to join Trump's 50 per cent defence cut proposal",
    "description": "China has responded cautiously to US President Trump's suggestion for a 50% defence budget cut by the US, Russia, and China, stressing its limited defence expenditure is aimed at safeguarding its national interests and contributing to global peace. Despite th…",
    "link": "https://economictimes.indiatimes.com/news/defence/china-not-keen-to-join-trumps-50-per-cent-defence-cut-proposal/articleshow/118560318.cms",
    "timestamp": "2025-02-25T13:20:41Z"
  },
  {
    "title": "Starmer commits to raise UK defense spending to 2.5% of GDP by 2027",
    "description": "Prime Minister Keir Starmer says the U.K. will raise defense spending to 2.5% of gross domestic product by 2027",
    "link": "https://abcnews.go.com/International/wireStory/starmer-commits-raise-uk-defense-spending-25-gdp-119158744",
    "timestamp": "2025-02-25T13:18:27Z"
  },
  {
    "title": "Hamas Official Has Regrets: Would Not Have Supported October 7 Had He Known Outcome",
    "description": "A senior Hamas official told the New York Times last week that he would not have supported the October 7, 2023, terror attack against Israel if he had known the outcome -- the destruction of Hamas and the devastation of Gaza.\nThe post Hamas Official Has Regre…",
    "link": "https://www.breitbart.com/middle-east/2025/02/25/hamas-official-has-regrets-would-not-have-supported-october-7-had-he-known-outcome/",
    "timestamp": "2025-02-25T13:18:17Z"
  },
  {
    "title": "Grok AI Caught Hiding 'Misinformation' References to Musk and Trump",
    "description": "Elon Musk's AI chatbot Grok 3 was caught temporarily censoring information about its own creator and US president Donald Trump over the weekend. The controversy began when users discovered that when asked who spreads the most misinformation on X (formerly Twi…",
    "link": "https://www.macrumors.com/2025/02/25/grok-ai-hiding-misinfo-references-musk-trump/",
    "timestamp": "2025-02-25T13:18:11Z"
  },
  {
    "title": "Donald Trump Declines To Call Putin Dictator",
    "description": "\"I don't use those words lightly,\" said U.S. President Donald Trump at a press conference on Monday.",
    "link": "https://www.newsweek.com/donald-trump-putin-dictator-zelensky-2035803",
    "timestamp": "2025-02-25T13:18:04Z"
  },
  {
    "title": "I Made A Secret Promise To My Friend In College. 20 Years Later, I Finally Revealed It To Her.",
    "description": "\"We can’t set right all of life’s injustices — but sometimes we have the power to overturn one bad thing.\"",
    "link": "https://www.huffpost.com/entry/kidney-donation-save-best-friend-transplant-surgery_n_67acefe4e4b0232270788901",
    "timestamp": "2025-02-25T13:17:51Z"
  },
  {
    "title": "Could bird flu vaccines help tackle high egg prices? Experts say it’s not so simple | CNN",
    "description": "On her first day on the job last week, new US Department of Agriculture Secretary Brooke Rollins held a meeting to review the agency’s options for controlling the bird flu outbreak and possibly help lower the price of eggs.",
    "link": "https://www.cnn.com/2025/02/25/health/bird-flu-chicken-vaccines/index.html",
    "timestamp": "2025-02-25T13:13:07Z"
  },
  {
    "title": "Shock Poll: 75 Percent of Democrats Say Joe Biden’s Migration Flood Was an Accident",
    "description": "A staggering 75 percent of Democrats do not believe President Joe Biden’s deputies deliberately kept the border open for migrants, according to a February poll by Harvard Harris. The February 19-20 poll of 2,443 registered voters comes just weeks after Presid…",
    "link": "https://freerepublic.com/focus/f-news/4300307/posts",
    "timestamp": "2025-02-25T13:12:38Z"
  },
  {
    "title": "U.S. Attorney’s Office Didn’t Sign Cory Mills’ Arrest Warrant Over Alleged Assault: Reports",
    "description": "The Florida Republican has denied wrongdoing.",
    "link": "https://www.huffpost.com/entry/cory-mills-arrest-warrant-alleged-assault_n_67bd9a96e4b039cc872a0629",
    "timestamp": "2025-02-25T13:11:05Z"
  },
  {
    "title": "US drops push for Venezuela regime change",
    "description": "The News\nWashington will not pursue regime change in Caracas, the US special envoy said, as it seeks the support of Venezuela’s autocratic leadership on deporting undocumented migrants. \nDuring his first term, Donald Trump vowed to exert “maximum pressure” on…",
    "link": "https://biztoc.com/x/afe1259134c2c1c9",
    "timestamp": "2025-02-25T13:11:02Z"
  },
  {
    "title": "Posthaste: Four things that would be ‘kryptonite’ to Donald Trump’s tariff threats",
    "description": "Donald Trump doubled down on threats to impose punishing tariffs on Canada and Mexico Monday, but even he has his vulnerabilities. Read on",
    "link": "https://financialpost.com/news/4-things-kryptonite-trump-tariff-threats",
    "timestamp": "2025-02-25T13:10:31Z"
  },
  {
    "title": "Serbia votes for anti-Russian UN resolution ‘by mistake’ – President",
    "description": "The normally pro-Russian Balkan nation accidentally supported a Kiev-endorsed statement on the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613273-vucic-un-vote-mistake/",
    "timestamp": "2025-02-25T13:08:51Z"
  },
  {
    "title": "CNN’s Abby Phillip Scolds Scott Jennings For Putting Words In Her Mouth: ‘Is That What I Said? No!’",
    "description": "CNN anchor Abby Phillip scolded GOP analyst Scott Jennings for mischaracterizing what she said during an intense discussion of independent agencies.\nThe post CNN’s Abby Phillip Scolds Scott Jennings For Putting Words In Her Mouth: ‘Is That What I Said? No!’ f…",
    "link": "https://www.mediaite.com/news/cnns-abby-phillip-scolds-scott-jennings-for-putting-words-in-her-mouth-is-that-what-i-said-no/",
    "timestamp": "2025-02-25T13:08:47Z"
  },
  {
    "title": "Taoiseach would 'absolutely' invite Trump to Ireland following Washington visit",
    "description": "People Before Profit-Solidarity TD Ruth Coppinger said the visit would provoke a ‘huge response in opposition’.",
    "link": "https://www.thejournal.ie/taoiseach-would-invite-trump-to-ireland-6632801-Feb2025/",
    "timestamp": "2025-02-25T13:08:30Z"
  },
  {
    "title": "The Latest: 21 employees resign from DOGE, refusing to ‘dismantle critical public services’",
    "description": "More than 20 civil service employees resigned Tuesday from Elon Musk’s Department of Government Efficiency, saying they refused to use their technical...",
    "link": "https://www.yahoo.com/news/latest-musk-renews-threat-fire-130817910.html",
    "timestamp": "2025-02-25T13:08:17Z"
  },
  {
    "title": "UK to hike defence spending to 2.5% of GDP by 2027",
    "description": "The prime minister says he will cut the UK's aid budget to fund the rise in defence spending.",
    "link": "https://www.bbc.com/news/articles/clyrkkv4gd7o",
    "timestamp": "2025-02-25T13:06:39Z"
  },
  {
    "title": "The fragile ceasefire in Gaza faces a key deadline. Will it last?",
    "description": "The first phase of the ceasefire between Israel and Hamas is set to end on Saturday. It’s unclear what comes next.",
    "link": "https://www.bostonherald.com/2025/02/25/israel-hamas-war-ceasefire-future/",
    "timestamp": "2025-02-25T13:05:46Z"
  },
  {
    "title": "WATCH: Joy Reid breaks down in tears over being canceled by MSNBC",
    "description": "'We as the American people have a right to object to little babies being bombed and where I come down on that is I'm not sorry, I am not sorry that I stood up for those things because those things are of God'",
    "link": "https://www.wnd.com/2025/02/watch-joy-reid-breaks-down-in-tears-over-being-canceled-by-msnbc/",
    "timestamp": "2025-02-25T13:05:45Z"
  },
  {
    "title": "Victor Davis Hanson: MAGA Foreign Policy and the Iranian Regime",
    "description": "Hello, this is Victor Davis Hanson for The Daily Signal. One topic that’s come up throughout January and this week again is what to do about the Iranian nuclear proliferation problem or crisis. And we all know that they’re on the verge of getting a bomb. And …",
    "link": "https://freerepublic.com/focus/f-chat/4300305/posts",
    "timestamp": "2025-02-25T13:05:21Z"
  },
  {
    "title": "Starmer commits to raise UK defense spending to 2.5% of GDP by 2027",
    "description": "LONDON (AP) — Prime Minister Keir Starmer committed to raise U.K. defense spending to 2.5% of gross domestic product by 2027, saying Tuesday that Europe is in a new era of insecurity. The U.K. currently spends 2.3% of gross domestic product on defense, and th…",
    "link": "https://financialpost.com/pmn/starmer-commits-to-raise-uk-defense-spending-to-2-5-of-gdp-by-2027",
    "timestamp": "2025-02-25T13:04:08Z"
  },
  {
    "title": "Emil Bove has accused others of ethical misconduct. But he has had his own issues.",
    "description": "Three new complaints to the New York bar recall prior challenges regarding Bove’s own conduct and potential conflicts of interest",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/emil-bove-trump-sassoon-adams-ethics-rcna193024",
    "timestamp": "2025-02-25T13:04:07Z"
  },
  {
    "title": "Live updates: The latest on Trump’s presidency, DOGE agenda and House GOP budget | CNN Politics",
    "description": "President Donald Trump continues to move ahead with his government overhaul as Elon Musk’s email demanding federal workers state their weekly accomplishments or risk termination sparks confusion. Follow here for the latest live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-administration-news-02-25-25/index.html",
    "timestamp": "2025-02-25T13:03:26Z"
  },
  {
    "title": "Serbia's police raid civil society groups over USAID funding",
    "description": "Serbia’s police raided the offices of at least four civil society organizations as part of a probe into allegations of abuse of U.S. Agency for International Development funds in the Balkan country",
    "link": "https://abcnews.go.com/International/wireStory/serbias-police-raid-civil-society-groups-usaid-funding-119158759",
    "timestamp": "2025-02-25T13:02:12Z"
  },
  {
    "title": "[Steven Calabresi] Fortieth Anniversary of Attorney General Ed Meese's Swearing In",
    "description": "Forty years ago today, Edwin Meese III took the oath of office as the United States' 45th attorney general. Gary Lawson and I argue in a new book, The",
    "link": "https://reason.com/volokh/2025/02/25/fortieth-anniversary-of-attorney-general-ed-meeses-swearing-in/",
    "timestamp": "2025-02-25T13:01:10Z"
  },
  {
    "title": "Politico’s Jonathan Martin Predicts When Trump Will Dump Musk",
    "description": "Politico journalist Jonathan Martin predicted that Americans might see President Donald Trump dump his cost-cutting bulldog Elon Musk as soon as “this summer or this fall” as he grows “tired” of the billionaire’s “antics” and “unpopularity.” The take comes as…",
    "link": "https://www.mediaite.com/tv/politicos-jonathan-martin-predicts-when-trump-will-dump-musk/",
    "timestamp": "2025-02-25T13:00:19Z"
  },
  {
    "title": "Crypto Shocker: Sam Bankman-Fried Breaks Silence After Two Years",
    "description": "Former FTX CEO Sam Bankman-Fried has resurfaced on social media following a protracted two-year hiatus. The sudden reemergence on X, late Monday evening, triggered a flurry of debates throughout the crypto sphere. Bankman-Fried, who is currently serving a 25-…",
    "link": "https://bitcoinist.com/crypto-shocker-sam-bankman-fried-breaks-silence/",
    "timestamp": "2025-02-25T13:00:14Z"
  },
  {
    "title": "New bill threatens to cripple 'judicial tyranny' from derailing Trump's agenda at every turn",
    "description": "GOP Rep. Darrell Issa has introduced a bill that he says would prevent \"rogue\" judges from derailing President Donald Trump's agenda for political and ideological reasons.",
    "link": "https://www.foxnews.com/politics/new-bill-threatens-cripple-judicial-tyranny-from-derailing-trumps-agenda-at-every-turn",
    "timestamp": "2025-02-25T13:00:07Z"
  },
  {
    "title": "Authoritarian Blitz",
    "description": "In the weeks since Donald Trump’s second inauguration, the president and his party have embarked on a concerted campaign to unmake the American government. He has signed sixty executive orders in an effort to, among other things, immediately freeze government…",
    "link": "https://www.nybooks.com/online/2025/02/25/authoritarian-blitz-joseph-oneill/",
    "timestamp": "2025-02-25T13:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Voters Are Confident DOGE Will Significantly Reduce Government Spending",
    "description": "FIRST ON THE DAILY SIGNAL—More than 6 in 10 voters believe President Donald Trump and Elon Musk‘s Department of Government Efficiency will significantly reduce federal... Read More\nThe post EXCLUSIVE: Voters Are Confident DOGE Will Significantly Reduce Govern…",
    "link": "https://www.dailysignal.com/2025/02/25/exclusive-voters-are-confident-doge-will-significantly-reduce-government-spending/",
    "timestamp": "2025-02-25T13:00:00Z"
  },
  {
    "title": "Day 1,098 of WW3. Pooty-Poot claims war was \"God's Will\". But there are NO parallels between Russia's European war and Germany's. Also, the \"Opposite Day\" filter applies to all claims by Russian oafishals. This is your Tuesday Ukraine War thread [News]",
    "description": "Day 1,098 of WW3. Pooty-Poot claims war was \"God's Will\". But there are NO parallels between Russia's European war and Germany's. Also, the \"Opposite Day\" filter applies to all claims by Russian oafishals. This is your Tuesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13575214/Day-1098-of-WW3-Pooty-Poot-claims-war-was-Gods-Will-But-there-are-NO-parallels-between-Russias-European-war-Germanys-Also-Opposite-Day-filter-applies-to-all-claims-by-Russian-oafishals-This-is-your-Tuesday-Ukraine-War-thread",
    "timestamp": "2025-02-25T13:00:00Z"
  },
  {
    "title": "SEC Poised to Drop Coinbase Lawsuit, Marking Big Moment for U.S. Crypto",
    "description": "The company says the commission will vote on a deal negotiated by staff to abandon the enforcement case at the core of the agency’s previous crypto stance. This decision comes after a prolonged SEC lawsuit that had significant implications for the industry. W…",
    "link": "https://www.activistpost.com/sec-lawsuit-outcomes-implications-for-cryptocurrency/",
    "timestamp": "2025-02-25T13:00:00Z"
  },
  {
    "title": "Forbes Daily: Apple’s Plans For New Texas Factory Include 20,000 Jobs",
    "description": "Today’s Forbes Daily takes a look at Apple’s plan to add U.S. jobs, an update on Trump’s tariffs on Mexico and Canada, a drop in the price of Bitcoin and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/02/25/forbes-daily-apples-plans-for-new-texas-factory-include-20000-jobs/",
    "timestamp": "2025-02-25T12:55:38Z"
  },
  {
    "title": "US spies discussed kinks, sex changes, and fetishes in official chat rooms – report",
    "description": "The NSA has launched an investigation into employees who misused government chat rooms, a spokesperson has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613280-nsa-fetishes-chat-investigation/",
    "timestamp": "2025-02-25T12:55:04Z"
  },
  {
    "title": "MGMA, CHIME ask Trump to rescind proposed HIPAA Security Rule",
    "description": "Several industry groups signed a letter to the Trump administration asking it to rescind the proposed HIPAA Security Rule updates, citing high costs and regulatory burden.",
    "link": "https://www.techtarget.com/healthtechsecurity/news/366619712/MGMA-CHIME-ask-Trump-to-rescind-proposed-HIPAA-Security-Rule",
    "timestamp": "2025-02-25T12:55:00Z"
  },
  {
    "title": "테슬라 주가, 최대 50%까지 하락 가능",
    "description": "UK inflation climbs to the highest level in 10 months in January, boosted by the cost of food, airfares and the imposition of value-added tax on private school fees https://t.co/2YOhIjsmax— Bloomberg Economics (@economics) February 19, 2025 British households…",
    "link": "https://ryueyes11.tistory.com/511502",
    "timestamp": "2025-02-25T12:54:54Z"
  },
  {
    "title": "Has Trump administration taken a U-turn on Elon Musk's 'justify your job' email to federal employees?",
    "description": "The Donald Trump administration has taken a U-turn on tech billionaire Elon Musk's 'justify your job' email to federal employees. The Trump administration in the United States is reportedly backing off from Elon Musk's weekend mandate for all government emplo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-elon-musk-email-federal-employees-has-trump-administration-taken-a-u-turn-on-elon-musks-justify-your-job-email-to-federal-employees/articleshow/118559629.cms",
    "timestamp": "2025-02-25T12:52:07Z"
  },
  {
    "title": "What went wrong for Habeck and Germany's Green Party?",
    "description": "Of all three former governing parties, the Greens performed best in the general election. But they have still landed in opposition and with little to celebrate. What does helplessness and frustration look like? A bit like Robert Habeck and Annalena Baerbock l…",
    "link": "https://www.dw.com/en/germanys-green-party-grapples-with-poor-election-result/a-71743602",
    "timestamp": "2025-02-25T12:52:00Z"
  },
  {
    "title": "What went wrong for Habeck and Germany's Green Party?",
    "description": "Of all three former governing parties, the Greens performed best in the general election. But they have still landed in opposition and with little to celebrate.",
    "link": "https://www.dw.com/en/what-went-wrong-for-habeck-and-germanys-green-party/a-71743602",
    "timestamp": "2025-02-25T12:52:00Z"
  },
  {
    "title": "German Greens grapple with poor election result",
    "description": "Of all three former governing parties, the Greens performed best in the recent general election. But they have still landed in opposition with little to celebrate. What does helplessness and frustration look like? A bit like Robert Habeck and Annalena Baerboc…",
    "link": "https://www.dw.com/en/german-greens-grapple-with-poor-election-result/a-71743602",
    "timestamp": "2025-02-25T12:52:00Z"
  },
  {
    "title": "India has lower exposure to US tariffs than APAC peers: Moody's",
    "description": "Moody's Ratings reports India has lower exposure to US markets compared to other APAC nations. Sectors like food, textiles, and pharmaceuticals face risks. India and the US plan to negotiate reducing import tariffs, potentially reaching a trade deal by 2025. …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-has-lower-exposure-to-us-tariffs-than-apac-peers-moodys/articleshow/118559762.cms",
    "timestamp": "2025-02-25T12:51:11Z"
  },
  {
    "title": "Macron warns Trump to 'be careful' on Ukraine, fact-checks him at the White House",
    "description": "French President Emmanuel Macron used his visit to the U.S. to publicly push back on President Donald Trump's repeated attacks on Ukraine.",
    "link": "https://abcnews.go.com/International/macron-warns-trump-careful-ukraine-fact-checks-white/story?id=119157061",
    "timestamp": "2025-02-25T12:50:20Z"
  },
  {
    "title": "Nippon Steel to use U.S. Steel merger agreement as base for U.S. government talks, president says",
    "description": "Nippon Steel plans to use its current merger agreement to acquire U.S. Steel as a starting point for talks with the U.S. government, President Tadashi Imai said on Tuesday, as it aims to revive the deal.\nEarlier this month, U.S. President Donald Trump, alongs…",
    "link": "https://biztoc.com/x/c8afc7431ad52d41",
    "timestamp": "2025-02-25T12:49:31Z"
  },
  {
    "title": "House Speaker Mike Johnson tries to push Trump's 'big' agenda forward, but GOP votes are in jeopardy",
    "description": "House Speaker Mike Johnson will try against the odds to muscle a Republican budget blueprint to passage this week",
    "link": "https://abcnews.go.com/Business/wireStory/house-speaker-mike-johnson-push-trumps-big-agenda-119157263",
    "timestamp": "2025-02-25T12:46:27Z"
  },
  {
    "title": "Nearly 40% of contracts canceled by DOGE are expected to produce no savings",
    "description": "DOGE says the overall contract cancellations are expected to save more than $7 billion so far, an amount that has been questioned.",
    "link": "https://www.denverpost.com/2025/02/25/trump-musk-doge-contracts-canceled/",
    "timestamp": "2025-02-25T12:45:46Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to the Crueliest Day: Tuesday, February 25, 2025. and National Chocolate-Covered Nut Day, celebrating something good for you covered with something bad for you.  Like these, displayed on Wikipedia (M&M Peanuts are a related species): It’s also Let’s A…",
    "link": "https://whyevolutionistrue.com/2025/02/25/tuesday-hili-dialogue-518/",
    "timestamp": "2025-02-25T12:45:23Z"
  },
  {
    "title": "Yahoo Sports AM: The AP poll, four months later...",
    "description": "In today's edition: The preseason AP poll vs. now, college kids vs. pros, one-armed hoopers, the 40/20 rule, goodbye P00P, and more.",
    "link": "https://sports.yahoo.com/college-basketball/article/yahoo-sports-am-the-ap-poll-four-months-later-124502699.html",
    "timestamp": "2025-02-25T12:45:02Z"
  },
  {
    "title": "Putin says Russia is open to economic cooperation with US on rare earth minerals",
    "description": "Russian President Vladimir Putin said that Moscow and Washington could make a deal on mining rare earth minerals both in Russia and parts of Russian-occupied Ukraine.",
    "link": "https://www.foxnews.com/world/putin-says-russia-open-economic-cooperation-us-rare-earth-minerals",
    "timestamp": "2025-02-25T12:44:02Z"
  },
  {
    "title": "Midnight Deadline Passes on Musk's Order for Federal Workers' Email",
    "description": "Musk gave federal workers a deadline to list their accomplishments or risk losing their jobs, with agencies split over compliance.",
    "link": "https://www.newsweek.com/musk-trump-email-federal-workers-firings-deadline-2035762",
    "timestamp": "2025-02-25T12:44:01Z"
  },
  {
    "title": "Will Philadelphia Eagles Meet with Trump at White House? What We Know",
    "description": "Conflicting reports have emerged over whether the Eagles will attend the traditional White House visit following their Super Bowl win.",
    "link": "https://www.newsweek.com/will-philadelphia-eagles-meet-trump-white-house-super-bowl-2035748",
    "timestamp": "2025-02-25T12:43:31Z"
  },
  {
    "title": "US votes against condemning Russia for Ukraine war as Trump admin chases peace deal",
    "description": "The U.S. voted against a U.N. resolution laying blame on Russia for its invasion of Ukraine and demanding Moscow remove its troops from Ukrainian territory.",
    "link": "https://www.foxnews.com/world/us-votes-against-condemning-russia-ukraine-war-trump-admin-chases-peace-deal",
    "timestamp": "2025-02-25T12:42:43Z"
  },
  {
    "title": "Trump says his Canada and Mexico tariffs will start in March ‘on time, on schedule’",
    "description": "“We’re on time with the tariffs, and it seems like that’s moving along very rapidly,” Trump said.",
    "link": "https://www.mlive.com/news/2025/02/trump-says-his-canada-and-mexico-tariffs-will-start-in-march-on-time-on-schedule.html",
    "timestamp": "2025-02-25T12:42:26Z"
  },
  {
    "title": "Rachel Maddow Rebukes MSNBC Live on Air for Joy Reid Move",
    "description": "Maddow said the cancellation of Reid and other nonwhite presenters' shows \"feels indefensible.\"",
    "link": "https://www.newsweek.com/rachel-maddow-rebukes-msnbc-live-air-joy-reid-move-2035750",
    "timestamp": "2025-02-25T12:42:05Z"
  },
  {
    "title": "TRUMP BRUISED",
    "description": "A MYSTERIOUS apparent bruise was spotted on Donald Trump’s hand after he had a series of handshake jousts with Emmanuel Macron. Trump was photographed with a large dark mark on the back of hi…",
    "link": "https://www.the-sun.com/news/13620496/trumps-bruised-hand-macron-bromance-handshake/",
    "timestamp": "2025-02-25T12:40:36Z"
  },
  {
    "title": "Huge boost to UK defence spending - as Starmer hits out at 'tyrant' Putin",
    "description": "Sir Keir Starmer has said he wants to increase UK defence spending to 3% in the next parliament - ahead of his White House meeting with Donald Trump.",
    "link": "https://news.sky.com/story/starmer-says-he-wants-to-increase-uk-defence-spending-to-3-and-announces-foreign-aid-cut-13316719",
    "timestamp": "2025-02-25T12:40:00Z"
  },
  {
    "title": "BMO posts a ‘great rebound’ quarter to beat analysts’ expectations",
    "description": "BMO topped expectations in the first quarter after a series of misses as it reported higher profits from its U.S. business. Read more.",
    "link": "https://financialpost.com/fp-finance/bmo-great-rebound-quarter-analysts-expectations",
    "timestamp": "2025-02-25T12:39:11Z"
  },
  {
    "title": "Is Canada being sneaked in as USA's 51st state? Google’s ‘state park’ label raises eyebrows amid Donald Trump’s expansionist claims",
    "description": "A labeling error on Google Maps that marked Canadian provincial parks as 'state parks' has worried Canadians. The error fueled concerns about Canadian sovereignty, especially with Donald Trump's past comments about annexing Canada. A Google spokesperson clari…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/is-canada-being-sneaked-in-as-usas-51st-state-googles-state-park-label-raises-eyebrows-amid-donald-trumps-expansionist-claims/articleshow/118559183.cms",
    "timestamp": "2025-02-25T12:38:07Z"
  },
  {
    "title": "Taiwanese anxious over Trump's handling of Ukraine war",
    "description": "The new US administration says it wants to focus on China. But US President Donald Trump's latest signals to Europe have convinced some in Taipei that Washington is not really committed to protecting Taiwan.",
    "link": "https://www.dw.com/en/taiwanese-anxious-over-trumps-handling-of-ukraine-war/a-71742758",
    "timestamp": "2025-02-25T12:38:00Z"
  },
  {
    "title": "Why some in Taiwan fear Trump's approach to Ukraine war",
    "description": "The new Donald Trump administration says it wants to focus on China, but the US president's latest signals to Europe have convinced some in Taipei that the White House is not really committed to protecting Taiwan.",
    "link": "https://www.dw.com/en/why-some-in-taiwan-fear-trumps-approach-to-ukraine-war/a-71742758",
    "timestamp": "2025-02-25T12:38:00Z"
  },
  {
    "title": "Palestinians Struggle To Restart Their Lives In The Ruins Of Gaza",
    "description": "Palestinians who returned to their homes in northern Gaza after the ceasefire began on Jan. 19 are still struggling to find shelter, food, water and other necessities.",
    "link": "https://www.huffpost.com/entry/ap-ml-mideast-wars-returning-to-north-gaza_n_67bdb8f4e4b0d509934a2535",
    "timestamp": "2025-02-25T12:37:52Z"
  },
  {
    "title": "J. Ann Selzer, Des Moines Register Call For Dismissal Of Trump Lawsuit Over Iowa Poll",
    "description": "Lawyers for the Register and its parent company, Gannett, said the president’s lawsuit demonstrates he is a “sore winner.”",
    "link": "https://www.huffpost.com/entry/selzer-des-moines-register-trump-lawsuit_n_67bd85b7e4b088756003c060",
    "timestamp": "2025-02-25T12:36:01Z"
  },
  {
    "title": "Politico: The Philadelphia Eagles haven’t rejected an invitation to the White House",
    "description": "Over the weekend, a rumor spread like wildfire on social media. The rumor: that the Super Bowl champions, the Philadelphia Eagles, had turned down an invitation to appear at the Trump White House. From what I can see, this was never confirmed by any news outl…",
    "link": "https://www.celebitchy.com/910816/politico_the_philadelphia_eagles_havent_rejected_an_invitation_to_the_white_house/",
    "timestamp": "2025-02-25T12:35:18Z"
  },
  {
    "title": "Leaked $25B Military Contractor Pitch Promises Trump 12 Million Deportations By Midterms: Report",
    "description": "A group of private military contractors have pitched President Donald Trump a $25 billion plan to expedite mass deportations — leveraging military bases, private aircraft, and deputized civilians to forcibly remove 12 million undocumented immigrants before th…",
    "link": "https://www.mediaite.com/news/leaked-25b-military-contractor-pitch-promises-trump-12-million-deportations-by-midterms-report/",
    "timestamp": "2025-02-25T12:34:43Z"
  },
  {
    "title": "Trump, Macron strike optimistic tone on Ukraine after talks - DW (English)",
    "description": "Trump, Macron strike optimistic tone on Ukraine after talksDW (English) Even as Macron flatters ‘Dear Donald,’ the US is deeply estranged from the West on UkraineCNN ‘He did his best’: Macron’s meeting with Trump prompts cautious optimism in France on Ukraine…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176541079",
    "timestamp": "2025-02-25T12:33:43Z"
  },
  {
    "title": "Mike Waltz Defends Trump's Attack On Ukraine Like He's In Jim Jones' Suicide Cult",
    "description": "Donald Trump's new National Security Advisor Mike Waltz refused to answer Maria Bartiromo's question calling into doubt Trump's lie that Ukraine started the war with Russia, instead launching into a diatribe about how wonderful his new cult leader is.\nEven Ma…",
    "link": "https://crooksandliars.com/2025/02/mike-waltz-defends-trumps-attack-ukraine",
    "timestamp": "2025-02-25T12:31:30Z"
  },
  {
    "title": "Republicans Should Fight ‘Resistance’ Democrats’ Nationwide Injunctions",
    "description": "Congress should restrict use of nationwide injunctions and make it more difficult to rig results by judge shopping in such cases.",
    "link": "https://thefederalist.com/2025/02/25/republicans-should-fight-resistance-democrats-nationwide-injunctions/",
    "timestamp": "2025-02-25T12:31:10Z"
  },
  {
    "title": "'It's the beginning': Kremlin plays it cool ahead of more U.S. talks, says Biden 'messed things up badly'",
    "description": "The Kremlin is keen to play it cool as efforts continue to restore bilateral relations that it said were badly damaged during the previous Biden administration.",
    "link": "https://www.cnbc.com/2025/02/25/kremlin-says-biden-messed-things-up-badly-ahead-of-more-us-talks.html",
    "timestamp": "2025-02-25T12:30:30Z"
  },
  {
    "title": "House GOP pushes ‘big’ budget resolution to passage, a crucial step toward delivering Trump’s agenda",
    "description": "It kickstarts a weeks-long process to draft the details and merge with the Senate.",
    "link": "https://www.denverpost.com/2025/02/25/congress-budget-johnson-trump-agenda/",
    "timestamp": "2025-02-25T12:30:13Z"
  },
  {
    "title": "House Speaker Mike Johnson tries to push Trump’s ‘big’ agenda forward, but GOP votes are in jeopardy",
    "description": "Johnson is facing stiff opposition from Democrats and some Republicans as he tries to deliver President Trump's budget.",
    "link": "https://www.bostonherald.com/2025/02/25/congress-budget-johnson-trump-agenda/",
    "timestamp": "2025-02-25T12:30:13Z"
  },
  {
    "title": "Lester Holt will step down as ‘NBC Nightly News’ anchor. Why? And who will replace him?",
    "description": "Lester Holt, anchor of the “NBC Nightly News” and one of the most recognizable and respected journalists in broadcasting, is giving up perhaps the most coveted of jobs in all […]\nThe post Lester Holt will step down as ‘NBC Nightly News’ anchor. Why? And who w…",
    "link": "https://www.poynter.org/commentary/2025/why-lester-holt-leaving-nbc-nightly-news-who-will-replace/",
    "timestamp": "2025-02-25T12:30:05Z"
  },
  {
    "title": "‘Stand Up for Science’ Rallies Will Protest Trump Attacks on Research",
    "description": "Amid President Donald Trump’s attacks on government scientists and science funding, researchers are arranging rallies to “Stand Up for Science” in Washington, D.C., and nationwide on March 7",
    "link": "https://www.scientificamerican.com/article/stand-up-for-science-rallies-will-protest-trump-attacks-on-research/",
    "timestamp": "2025-02-25T12:30:00Z"
  },
  {
    "title": "'Kind of a jerk': Three-time MAGA voter turns on Trump and Musk in CNN report",
    "description": "A Colorado man who voted for President Donald Trump in three different elections is not a fan of letting X owner Elon Musk unilaterally shut down entire government departments.In an interview with CNN's John King, Trump supporter David Hayes explained why he …",
    "link": "https://www.rawstory.com/trump-voter-elon-musk-2671215065/",
    "timestamp": "2025-02-25T12:27:34Z"
  },
  {
    "title": "A Defense of Weird Research",
    "description": "Government-funded scientific research may appear strange or impractical, but it has repeatedly yielded scientific breakthroughs — and continues to pay for itself many times over.",
    "link": "https://asteriskmag.com/issues/09/a-defense-of-weird-research",
    "timestamp": "2025-02-25T12:27:11Z"
  },
  {
    "title": "La MAGA Nostra: Trump, the Mafia Metaphor, and the Corruption of Power",
    "description": "On August 24, 2023, a headline blared “La Maga Nostra” over the front page of the New York Post.Dominating the layout was a photo of then-ex-President Donald Trump, his chin slightly raised in veiled contempt. The comparison was unmistakable: Trump as Don Cor…",
    "link": "https://www.commondreams.org/opinion/trump-as-mafia-don",
    "timestamp": "2025-02-25T12:27:03Z"
  },
  {
    "title": "Casey DeSantis' Chances of Beating Byron Donalds in Florida",
    "description": "The Florida first lady and the representative have not declared their gubernatorial bids, but Donalds has Trump's endorsement.",
    "link": "https://www.newsweek.com/casey-desantis-florida-governor-byron-donalds-trump-2035752",
    "timestamp": "2025-02-25T12:25:24Z"
  },
  {
    "title": "Hackers beam fake video of Trump kissing Musk’s toes to federal computers",
    "description": "A federal building in Washington DC suffered a cyber-attack earlier this week, with an AI video showing Donald Trump kissing Elon Musk’s toes. Staff at the Department of Housing and Urban Development (HUD), at the Robert C Weaver Federal Building, saw the vid…",
    "link": "https://www.thepinknews.com/2025/02/25/trump-kissing-elon-toes-federal-building/",
    "timestamp": "2025-02-25T12:24:55Z"
  },
  {
    "title": "18-carat gold toilet stolen in five minutes: How thieves pulled off the heist from Blenheim Palace",
    "description": "Three men have gone on trial for the daring theft of an 18-carat gold toilet worth $6 million from Blenheim Palace, the birthplace of Winston Churchill. The artwork, titled America by Maurizio Cattelan, was stolen in a meticulously planned overnight burglary …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/18-carat-gold-toilet-stolen-in-five-minutes-how-thieves-pulled-off-the-heist-from-blenheim-palace/articleshow/118557669.cms",
    "timestamp": "2025-02-25T12:24:25Z"
  },
  {
    "title": "Divide with key allies grows over Trump deal that favors Russia",
    "description": "While the divide between the United States and key allies grows over support for Ukraine, President Donald Trump appears focused on terms of a deal that are favorable for Russia. NBC’s Peter Alexander reports for TODAY.",
    "link": "https://www.today.com/video/divide-with-key-allies-grows-over-trump-deal-favoring-russia-232845381983",
    "timestamp": "2025-02-25T12:22:38Z"
  },
  {
    "title": "Key milestones in Vivek Ramaswamy’s academic journey: From being a Valedictorian to a member of Harvard Political Union",
    "description": "Vivek Ramaswamy, an Indian-American entrepreneur, has launched his campaign for Ohio governor with endorsements from Donald Trump and Elon Musk. Ramaswamy, who previously worked at a hedge fund and founded Roivant Sciences, promises policy changes like work r…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/key-milestones-in-vivek-ramaswamys-academic-journey-from-being-a-valedictorian-to-a-member-of-harvard-political-union/articleshow/118558906.cms",
    "timestamp": "2025-02-25T12:22:33Z"
  },
  {
    "title": "Leftist Political Theater Is Back At GOP Town Hall Meetings In Trump 2.0",
    "description": "If it all seems familiar, if you suspect you’ve seen this movie before, it’s because it is and you have.",
    "link": "https://thefederalist.com/2025/02/25/leftist-political-theater-is-back-at-gop-town-hall-meetings-in-trump-2-0/",
    "timestamp": "2025-02-25T12:21:44Z"
  },
  {
    "title": "Apple’s focus on U.S. manufacturing isn’t exactly new",
    "description": "Apple has a pattern of announcing big investments in U.S. jobs at the start of new presidential administrations. Now, under Donald Trump, Apple has announced a $500 billion investment in U.S. operations over the next four years — an announcement that comes am…",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/apples-focus-on-u-s-manufacturing-isnt-exactly-new/",
    "timestamp": "2025-02-25T12:21:14Z"
  },
  {
    "title": "Trump, Musk get support from former NFL star amid criticism over DOGE cuts, other issues",
    "description": "Former NFL star running back Le'Veon Bell came to the defense of President Donald Trump and billionaire mogul Elon Musk in a post on X on Monday.",
    "link": "https://www.foxnews.com/sports/trump-musk-get-support-from-former-nfl-star-amid-criticism-over-doge-cuts-other-issues",
    "timestamp": "2025-02-25T12:19:24Z"
  },
  {
    "title": "Trump tax cut plan heads for House-wide vote despite GOP rebel threats, Medicaid anxiety",
    "description": "The House's version of Trump's budget bill advanced through a key hurdle before a chamber-wide vote.",
    "link": "https://www.foxnews.com/politics/trump-tax-cut-plan-heads-house-wide-vote-despite-gop-rebel-threats-medicaid-anxiety",
    "timestamp": "2025-02-25T12:19:13Z"
  },
  {
    "title": "Facing Tariff Threats, Apple Announces Major U.S. Investment Plan",
    "description": "Apple has announced plans to invest over $500 billion in the United States over the next four years, aiming to enhance its manufacturing capabilities and create approximately 20,000 jobs. This move comes […]\nThank you for being a Ghacks reader. The post Facin…",
    "link": "https://www.ghacks.net/2025/02/25/facing-tariff-threats-apple-announces-major-u-s-investment-plan/",
    "timestamp": "2025-02-25T12:18:23Z"
  },
  {
    "title": "Elon Musk Gives Federal Workers New Deadline To Justify Jobs: DOGE Updates",
    "description": "Elon Musk gives federal workers another chance to justify their jobs amid pushback. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/elon-musk-federal-workers-doge-donald-trump-live-updates-2035810",
    "timestamp": "2025-02-25T12:17:37Z"
  },
  {
    "title": "Hunter Schafer’s passport was changed to male when she got it reissued",
    "description": "Hunter Schafer is so ethereally stunning. If I were a producer on Amazon’s The Rings of Power, I would be bending over backwards to write a new elf character just to cast her. (And if Hunter does show up in season 3 — Amazon, I’ll accept payment in mithril.) …",
    "link": "https://www.celebitchy.com/910717/hunter_schafers_passport_was_changed_to_male_when_she_got_it_reissued/",
    "timestamp": "2025-02-25T12:17:16Z"
  }
]