[
  {
    "title": "How Trump's New Tariffs Will Make Farming (and Food) More Expensive",
    "description": "Americans love foreign products, but is our indulgence in Canadian whiskey, Mexican avocados, and Brazilian coffee a bad thing? If you ask President",
    "link": "https://reason.com/2025/04/03/how-trumps-new-tariffs-will-make-farming-and-food-more-expensive/",
    "timestamp": "2025-04-03T16:17:47Z"
  },
  {
    "title": "Women's Underwear Prices Could Soar Under Trump Tariffs",
    "description": "Trump's 46% tariff on Vietnam could spike U.S. underwear prices, hitting brands like Skims, Nike and Adidas reliant on Asian manufacturing.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-womens-underwear-prices-vietnam-2054764",
    "timestamp": "2025-04-03T16:17:38Z"
  },
  {
    "title": "Vance Reminds People the Economy Won’t Get Fixed Overnight",
    "description": "“Joe Biden left us -- this is not an exaggeration Lawrence -- with the largest peacetime debt and deficit in the history of the United States of America, with sky-high interest rates. You don't fix that stuff overnight.”\nThe post Vance Reminds People the Econ…",
    "link": "https://legalinsurrection.com/2025/04/vance-reminds-people-the-economy-wont-get-fixed-overnight/",
    "timestamp": "2025-04-03T16:17:14Z"
  },
  {
    "title": "Wait, is this going to be like 2008 all over again?",
    "description": "In a long, rambling press conference in the White House’s Rose Garden on Wednesday evening, Donald Trump launched a historic global trade war – and Ireland is in the crosshairs. Christine Bohan, Christina Finn, Jane Matthews and Rónán Duffy discuss what this …",
    "link": "https://www.thejournal.ie:443/podcasts/66fa99d113b87f412725299a/67eeb265d4b40d7b304a78ef/",
    "timestamp": "2025-04-03T16:16:33Z"
  },
  {
    "title": "‘The View’s Whoopi Goldberg Hints Trump Tariffs Will Hurt Her Prosecco Brand: “It’s A Bad Idea”",
    "description": "\"I don't like what he's doing.\"",
    "link": "https://decider.com/2025/04/03/the-view-whoopi-goldberg-trump-tariffs-hurt-prosecco-brand/",
    "timestamp": "2025-04-03T16:15:47Z"
  },
  {
    "title": "Trump sparks health fears as he 'forgets' to sign executive order and has to be 'guided' back to his seat",
    "description": "President Trump announced a new round of tariffs on nearly all U.S. trading partners in a bid to boost domestic manufacturing while risking inflation and t",
    "link": "https://www.newsbreak.com/share/3947643590770-trump-sparks-health-fears-as-he-forgets-to-sign-executive-order-and-has-to-be-guided-back-to-his-seat?s=a2&amp;share_destination_id=MTM1ODcyNzIyLTE3NDM2OTY3NjcxNTY%3D&amp;pd=09C6hWpd&amp;hl=en_US&amp;send_time=1743696767&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.13.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-control%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-v2%2Cns_local_strategy_25q1_exp-v1",
    "timestamp": "2025-04-03T16:14:01Z"
  },
  {
    "title": "Hungary announces ICC withdrawal as Israel's Netanyahu visits",
    "description": "BUDAPEST: Hungary on Thursday (Apr 3) said it will quit the International Criminal Court, just as its Prime Minister Viktor Orban hosted Israeli counterpart Benjamin Netanyahu, whom the tribunal has accused of war crimes in Gaza. Hungary's announcement that i…",
    "link": "https://www.channelnewsasia.com/world/hungary-announces-icc-withdrawal-israels-netanyahu-visits-5042456",
    "timestamp": "2025-04-03T16:13:55Z"
  },
  {
    "title": "Trump tremors",
    "description": "US onslaught sends shock waves, India less hit",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/trump-tremors/article69408384.ece",
    "timestamp": "2025-04-03T16:12:40Z"
  },
  {
    "title": "'Did you have a lobotomy?': Conservative slams 'free-trader' Rubio for kissing up to Trump",
    "description": "Conservative commentator and MAGA critic Ana Navarro-Cárdenas had some sharp words for Secretary of State Marco Rubio's praise of the Trump administration's sweeping tariffs that may well spark a global trade war.Navarro-Cárdenas claimed she has known Rubio f…",
    "link": "https://www.rawstory.com/rubio-supports-tariffs/",
    "timestamp": "2025-04-03T16:12:30Z"
  },
  {
    "title": "Wall St Leads Rout As World Reels From Trump Tariffs",
    "description": "Wall Street led a global markets bloodbath Thursday as countries around the world reeled from President Donald Trump's trade war, while the White House insisted the US economy would emerge victorious.",
    "link": "https://www.ibtimes.com/wall-st-leads-rout-world-reels-trump-tariffs-3768717",
    "timestamp": "2025-04-03T16:12:18Z"
  },
  {
    "title": "Wall St Leads Rout As World Reels From Trump Tariffs",
    "description": "Wall Street led a global markets bloodbath Thursday as countries around the world reeled from President Donald Trump's trade war, while the White House insisted the US economy would emerge victorious.",
    "link": "https://www.ibtimes.com.au/wall-st-leads-rout-world-reels-trump-tariffs-1857540",
    "timestamp": "2025-04-03T16:12:10Z"
  },
  {
    "title": "China, EU threaten to retaliate over Trump’s broad reciprocal tariffs: ‘There are no winners’",
    "description": "Alongside Wall Street, global stock markets took a beating after Trump unveiled a 10% baseline tax on all imports, as well as higher tariff rates for some major trade partners.",
    "link": "https://nypost.com/2025/04/03/business/china-eu-threaten-to-retaliate-over-trumps-10-tariffs/",
    "timestamp": "2025-04-03T16:12:08Z"
  },
  {
    "title": "Tariff déjà vu? Netizens go wild over claims that Trump’s tariffs are result of history repeating itself every century",
    "description": "Amid President Trump's new tariffs on over 60 countries, social media buzzes with theories drawing parallels to past economic battles in 1828 and 1930. Trump cites decades of exploitation, while debates rage on whether history will repeat itself. Some fear ec…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/tariff-deja-vu-netizens-go-wild-over-claims-that-donald-trumps-tariffs-are-result-of-history-repeating-itself-every-century/articleshow/119950879.cms",
    "timestamp": "2025-04-03T16:11:56Z"
  },
  {
    "title": "‘Sit back and take it in’ – US treasury to tariff-hit nations",
    "description": "Scott Bessent has urged US trading partners not to retaliate against Washington’s new trade levies Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615193-us-trump-tariffs-retaliation/",
    "timestamp": "2025-04-03T16:11:21Z"
  },
  {
    "title": "Trump could fire several national security officials",
    "description": "United States President Donald Trump is planning to dismiss several White House National Security Council (NSC) officials in the near future due to concerns that they are not sufficiently loyal to his...",
    "link": "https://biztoc.com/x/127365ebb5b21529",
    "timestamp": "2025-04-03T16:11:00Z"
  },
  {
    "title": "Feds Arrest Texas Man After Threatening To ‘Open Fire’ On ICE Agents",
    "description": "Federal law enforcement officials arrested a Texas man after he allegedly threatened to harm deportation officers and Homeland Security Secretary Kristi Noem.",
    "link": "https://dailycaller.com/2025/04/03/law-enforcement-arrest-texas-man-threatening-ice-noem/",
    "timestamp": "2025-04-03T16:10:52Z"
  },
  {
    "title": "Top House Republican backs Byron Donalds for Florida governor",
    "description": "House Speaker Mike Johnson backed Rep. Byron Donalds' bid for Florida governor. President Donald Trump endorsed Donalds earlier this year before the congressman announced his run for the role.",
    "link": "https://www.foxnews.com/politics/top-house-republican-backs-byron-donalds-florida-governor",
    "timestamp": "2025-04-03T16:10:50Z"
  },
  {
    "title": "What is Newsmax? US news channel whose shares are skyrocketing in US stock market. Here's why",
    "description": "Newsmax stocks have surged as the share price of the American right-wing cable news channel was trading in green.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-newsmax-us-news-channel-whose-shares-are-skyrocketing-in-us-stock-market-heres-why/articleshow/119950985.cms",
    "timestamp": "2025-04-03T16:10:50Z"
  },
  {
    "title": "Commerce Secretary Lutnick Says US Markets Will Perform 'Extremely Well' Long Term Despite Trump Tariff Selloff",
    "description": "Commerce Secretary Howard Lutnick believes the Trump Administration’s reciprocal tariffs will cause some short-term pain, but ultimately result in medium- and longer-term gain.\nWhat To Know: President Donald Trump announced sweeping reciprocal tariffs on nume…",
    "link": "https://biztoc.com/x/a04911b07a0e7bd2",
    "timestamp": "2025-04-03T16:10:40Z"
  },
  {
    "title": "I would like to return this country it is scratched",
    "description": "While working this morning on a project to initiate more bipartisan dialogue in our nation, tentatively titled “Toward Constructive Engagement With Stupid Nazi Motherfuckers,” I came across this: The White House has fired at least three National Security Coun…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/i-would-like-to-return-this-country-it-is-scratched",
    "timestamp": "2025-04-03T16:10:18Z"
  },
  {
    "title": "Liberating Americans from their wallets",
    "description": "After months of bluster, spin, and head fakes, President Trump finally committed to punishing global tariffs during a high-profile \"Liberation Day\" event at the White House yesterday. The policy invokes emergency authority to impose a 10% baseline tariff on a…",
    "link": "https://www.metafilter.com/208283/Liberating-Americans-from-their-wallets",
    "timestamp": "2025-04-03T16:10:02Z"
  },
  {
    "title": "US stocks, US dollar tumbles as Trump tariffs fuel economic worries",
    "description": "The Dow Jones Industrial Average fell 1,489.79 points, or 3.53 per cent, to 40,735.53, the S&P 500 dropped 228.84 points, or 4.04 per cent, to 5,442.13 and the Nasdaq Composite fell 915.44 points, or 5.20 per cent, to 16,685.61",
    "link": "https://www.thehindubusinessline.com/markets/us-stocks-us-dollar-tumbles-as-trump-tariffs-fuel-economic-worries/article69409519.ece",
    "timestamp": "2025-04-03T16:10:00Z"
  },
  {
    "title": "Could Panama Throw a New Wrench Into BlackRock’s Ports Deal?",
    "description": "BlackRock could hit another roadblock in its attempt to secure control of two flagship ports near the Panama Canal once the Central American country releases an audit on a 25-year concession granted to Hong Kong-based CK Hutchison.",
    "link": "https://gcaptain.com/could-panama-throw-a-new-wrench-into-blackrocks-ports-deal/",
    "timestamp": "2025-04-03T16:09:32Z"
  },
  {
    "title": "Trump’s Delusional Tariff Policy Is Already Wreaking Havoc",
    "description": "Chris Lehmann\n\n\n\nThe economy took an immediate hit after the president’s “Liberation Day ”announcement.\r\n\n\r\n\n\nThe post Trump’s Delusional Tariff Policy Is Already Wreaking Havoc appeared first on The Nation.",
    "link": "https://www.thenation.com/article/economy/trump-tariffs/",
    "timestamp": "2025-04-03T16:09:16Z"
  },
  {
    "title": "Lesotho hardest hit as new US tariffs rattle Africa",
    "description": "The small African kingdom of Lesotho feared the worst for its textile industry Thursday after US President Donald Trump imposed 50-percent tariffs on its imports, the highest for a single nation. Other African countries hit with Trump’s “reciprocal tariffs” a…",
    "link": "https://www.digitaljournal.com/world/lesotho-hardest-hit-as-new-us-tariffs-rattle-africa/article",
    "timestamp": "2025-04-03T16:07:33Z"
  },
  {
    "title": "Wall St leads rout as world reels from Trump tariffs",
    "description": "Wall Street led a global markets bloodbath Thursday as countries around the world reeled from President Donald Trump’s trade war, while the White House insisted the US economy would emerge victorious. The Dow Jones dropped 3.75 percent and the S&amp;P 500 plu…",
    "link": "https://www.digitaljournal.com/world/wall-st-leads-rout-as-world-reels-from-trump-tariffs/article",
    "timestamp": "2025-04-03T16:07:20Z"
  },
  {
    "title": "Trump’s New Order: Making DC Safe, and Beautiful, and Compliant",
    "description": "\"We've seen encampments cleared, phones tapped, and permits held up—but this? This feels like they're preparing for war,\" said Marisol Jennings, a D.C.-based organizer who has coordinated protests since 2017.\r\n\n\nJust days before thousands of Americans are exp…",
    "link": "https://www.commondreams.org/opinion/trump-dc-order",
    "timestamp": "2025-04-03T16:06:57Z"
  },
  {
    "title": "Trump’s tariffs are ‘a debacle of epic proportions’ for the auto industry",
    "description": "â\u0080\u009cLiberation Dayâ\u0080\u009d has arrived. Get ready to be liberated from affordable vehicle prices.  As promised, President Donald Trumpâ\u0080\u0099s 25 percent tariffs for imported vehicles went into effect Thursday, sending the auto industry into full panic mode. Some analy…",
    "link": "https://www.theverge.com/cars/642706/car-tariff-trump-price-increase-loan-ford-gm-tesla",
    "timestamp": "2025-04-03T16:06:47Z"
  },
  {
    "title": "A Day Late and a Dollar Short",
    "description": "\"This might be the single stupidest thing any of us will ever see. It is stupid in every way: presentationally, intellectually, politically, methodologically, morally and of course economically. The word stupid doesn't really suffice for the full level of idi…",
    "link": "https://www.metafilter.com/208282/A-Day-Late-and-a-Dollar-Short",
    "timestamp": "2025-04-03T16:06:25Z"
  },
  {
    "title": "Donald Trump’s Tariff Blitz Is Political Suicide",
    "description": "Trump should consult a history book and see what happened to previous GOP presidents who tried a tariff blitz, writes Ross Barkan.",
    "link": "http://nymag.com/intelligencer/article/trump-tariffs-political-suicide.html",
    "timestamp": "2025-04-03T16:06:11Z"
  },
  {
    "title": "Why has Trump launched so many tariffs and will it cause a recession? Expert Q&A",
    "description": "You owe us. Why Trump thinks it’s payback time.",
    "link": "https://theconversation.com/why-has-trump-launched-so-many-tariffs-and-will-it-cause-a-recession-expert-qanda-253765",
    "timestamp": "2025-04-03T16:05:24Z"
  },
  {
    "title": "US Refugee Centers To Help White South Africans And ONLY White South Africans Flee To America",
    "description": "Everyone else is shit out of luck.",
    "link": "https://www.wonkette.com/p/us-refugee-centers-to-help-white",
    "timestamp": "2025-04-03T16:04:32Z"
  },
  {
    "title": "France’s Macron Urges EU Companies to Pause US Investments",
    "description": "French President Emmanuel Macron urged companies to pause investments in the US after President Donald Trump announced tariffs on the European Union and other regions.",
    "link": "https://www.livemint.com/companies/news/frances-macron-urges-eu-companies-to-pause-us-investments-11743696254494.html",
    "timestamp": "2025-04-03T16:04:14Z"
  },
  {
    "title": "Carney hits back at Trump's auto tariffs, warns U.S. trade action will 'rupture the global economy'",
    "description": "Liberal Leader Mark Carney said Thursday U.S. President Donald Trump's move to levy tariffs on virtually every country will \"rupture the global economy,\" torpedo economic growth and prompt devastating consequences for workers and businesses in this country an…",
    "link": "https://www.cbc.ca/news/politics/carney-hits-back-trump-1.7500990",
    "timestamp": "2025-04-03T16:03:38Z"
  },
  {
    "title": "Economists Slash US Growth, Boost Inflation Forecasts on Tariffs",
    "description": "Wall Street economists said the US risks a recession this year and inflation could return to pandemic levels following the Trump administration’s announcement of major tariffs on global trading partners.",
    "link": "https://financialpost.com/pmn/business-pmn/economists-slash-us-growth-boost-inflation-forecasts-on-tariffs",
    "timestamp": "2025-04-03T16:03:03Z"
  },
  {
    "title": "Trump Can Create a Concert of Great Powers",
    "description": "In a multipolar age, having just one global policeman won’t cut it.\nThe post Trump Can Create a Concert of Great Powers appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-can-create-a-concert-of-great-powers/",
    "timestamp": "2025-04-03T16:03:00Z"
  },
  {
    "title": "Trump Delusionally Brags About Tariffs as Stock Market Crashes",
    "description": "In the topsy-turvy world of the Trump administration, market panic and financial suffering is somehow a good thing.\r\nThe president unveiled his economic agenda on Wednesday, revealing steep tariff hikes on practically every country in the world—regardless of …",
    "link": "https://newrepublic.com/post/193556/donald-trump-brags-tariffs-stock-market-crashes",
    "timestamp": "2025-04-03T16:01:35Z"
  },
  {
    "title": "US flags barriers in India’s financial sector amid global tariff war",
    "description": "The US government report highlights entry barriers for foreign firms in India's financial sector, naming entities like LIC and NPCI for receiving favorable treatment. It criticises local data storage requirements and constraints on foreign banks' expansion. A…",
    "link": "https://economictimes.indiatimes.com/industry/banking/finance/us-flags-barriers-in-indias-financial-sector-amid-global-tariff-war/articleshow/119950801.cms",
    "timestamp": "2025-04-03T16:01:32Z"
  },
  {
    "title": "Police Across the Country Are on High Alert Over Tesla Protests",
    "description": "Intelligence reports warn law enforcement about “acts of violence against electric vehicles\" and the danger of battery fires.\nThe post Police Across the Country Are on High Alert Over Tesla Protests appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/03/police-across-the-country-are-on-high-alert-over-tesla-protests/",
    "timestamp": "2025-04-03T16:01:17Z"
  },
  {
    "title": "Upbeat spirits at Hanover trade fair despite Trump's tariffs",
    "description": "As US President Donald Trump announced sweeping new tariffs, triggering fears of a global trade war, German and Canadian companies at one of the biggest trade fairs in the world were optimistic about the future. While the world waited for US President Donald …",
    "link": "https://www.dw.com/en/upbeat-spirits-at-hanover-trade-fair-despite-trumps-tariffs/a-72131086",
    "timestamp": "2025-04-03T16:01:00Z"
  },
  {
    "title": "Irish food and drink sectors brace for tariff impact with butter and whiskey in the firing line",
    "description": "Brands like Kerrygold and Jameson, among the most popular in the US in their respective categories, face uncertain future on US shelves",
    "link": "https://www.irishtimes.com/business/2025/04/03/irish-food-and-drink-sectors-brace-for-tariff-impact-with-butter-and-whiskey-in-the-firing-line/",
    "timestamp": "2025-04-03T16:00:48Z"
  },
  {
    "title": "Trump’s trade war represents a big opportunity for Canadian Conservatives",
    "description": "Donald Trump’s trade war with Canada has sparked a rise in Canadian patriotism. Canadian conservatives can harness that patriotism by reconnecting with their historical roots of anti-Americanism.",
    "link": "https://theconversation.com/trumps-trade-war-represents-a-big-opportunity-for-canadian-conservatives-252997",
    "timestamp": "2025-04-03T16:00:35Z"
  },
  {
    "title": "What's the word on recession as Donald Trump unleashes Liberation Day tariffs? Here's what experts are saying",
    "description": "US President Trump's new tariffs, dubbed \"Liberation Day tariffs,\" are set to impact a vast range of goods, with a 10% base tariff on imports and higher rates for China and the EU. Experts warn these tariffs could disrupt global trade, raise prices, and poten…",
    "link": "https://economictimes.indiatimes.com/news/international/us/whats-the-word-on-recession-as-donald-trump-unleashes-liberation-day-tariffs-heres-what-experts-are-saying/articleshow/119949865.cms",
    "timestamp": "2025-04-03T16:00:20Z"
  },
  {
    "title": "Survey: Free Speech Support Is Eroding in America",
    "description": "Last month, Vice President J.D. Vance lectured European leaders about their troubling retreat from free speech, calling their actions \"shocking to",
    "link": "https://reason.com/2025/04/03/survey-free-speech-support-is-eroding-in-america/",
    "timestamp": "2025-04-03T16:00:10Z"
  },
  {
    "title": "MUST-SEE: Former Democrat Batya Ungar Sargon Describes Trump’s Tariff Program that is Saving the US Working Class – Piers Morgan Panel Left Stunned (VIDEO)",
    "description": "Batya Ungar, a former Democrat, delivers a compelling analysis of Trump's tariff program on a Piers Morgan panel, leaving even seasoned commentators in awe. Her insights highlight the impact on the working class.\nThe post MUST-SEE: Former Democrat Batya Ungar…",
    "link": "https://www.thegatewaypundit.com/2025/04/must-see-former-democrat-batya-ungar-sargon-describes/",
    "timestamp": "2025-04-03T16:00:05Z"
  },
  {
    "title": "Trump’s Tariffs: A Break Down of How Much Your Camera Could Cost",
    "description": "President Donald Trump finally imposed tariffs by the US government on various countries around the world. This comes shortly after the administration imposed tariffs on Canada, Mexico, and China in February. According to the White House, these are reciprocal…",
    "link": "https://www.thephoblographer.com/2025/04/03/trumps-tariffs-a-break-down-of-how-much-your-camera-could-cost/",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "‘Time to capitalise on the JS-SEZ and speed up talks on trade pacts’",
    "description": "PETALING JAYA: Leveraging on Asean and the Johor-Singapore Special Economic Zone (JS-SEZ) can help Malaysia navigate the challenges posed by US President Donald Trump's \"Liberation Day\" tariffs on 48 nations, say business groups. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/04/time-to-capitalise-on-the-js-sez-and-speed-up-talks-on-trade-pacts",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "We escaped Trump’s Liberation Day hurt locker ... for now – Editorial",
    "description": "OPINION: Of greater concern now is suppressed consumer demand for all exports.",
    "link": "https://www.nzherald.co.nz/nz/we-escaped-trumps-liberation-day-hurt-locker-for-now-editorial/D7IFDCZWSRBZXEXQ3W33OWKB5M/",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "Can Europe Replace American Support for Ukraine? Here’s What to Know",
    "description": "The European Union consists of dozens of member states—and although there is a broad alignment in pro-Ukraine sentiment, decisions to aid Kyiv are bound to be rife with national considerations. \nThe post Can Europe Replace American Support for Ukraine? Here’s…",
    "link": "https://nationalinterest.org/blog/buzz/can-europe-replace-american-support-for-ukraine-heres-what-to-know",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "Russia and Ukraine Trade Accusations of Attacks on Energy Sites",
    "description": "In the latest of a series of accusations and repudiations, Russia accused Ukraine on Thursday of having launched what Moscow said were “provocative” attacks on energy infrastructure. “The attacks on Russia's energy infrastructure are targeted and are purely p…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Russia-and-Ukraine-Trade-Accusations-of-Attacks-on-Energy-Sites.html",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "Use Asean Chair to push back against Trump, says Perdasama",
    "description": "PETALING JAYA: The Malay Businessmen and Industrialists Association of Malaysia (Perdasama) say that Malaysia should use its Asean chairmanship to speak up for the Asean countries against US President Donald Trump's reciprocal tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/04/use-asean-chair-to-push-back-against-trump-says-perdasama",
    "timestamp": "2025-04-03T16:00:00Z"
  },
  {
    "title": "What Donald Trump's Bombshell Tariffs Mean for Your Pension",
    "description": "President Donald Trump has levied wide-ranging tariffs on nearly every trading nation in the world. But how could this affect your invested pensions?\nWhy It Matters\nMillions of Americans hold retirement accounts, helping them get ahead and save for later life…",
    "link": "https://biztoc.com/x/dec610b625d97b1c",
    "timestamp": "2025-04-03T15:59:59Z"
  },
  {
    "title": "List of Countries Considering Lifting Tariffs on the US",
    "description": "Countries around the world are strategizing their next fiscal actions after the Trump administration imposed tariffs on all countries, which has ignited turmoil in the global economy.\nWhy It Matters\nThe global financial market was reeling Thursday morning in …",
    "link": "https://biztoc.com/x/6fa98a1e9aa6a7e3",
    "timestamp": "2025-04-03T15:59:59Z"
  },
  {
    "title": "Neal Katyal's Law Firm Striking Trump Deal Stuns MSNBC Viewers",
    "description": "MSNBC viewers were caught off guard after reports surfaced that Neal Katyal's law firm had struck a deal involving Donald Trump—a move that appears at odds with Katyal's outspoken legal critiques of the former president.\nNewsweek has contacted Katyal and his …",
    "link": "https://biztoc.com/x/1bca0184e7ba5825",
    "timestamp": "2025-04-03T15:59:50Z"
  },
  {
    "title": "Judge ends Eric Adams case, Trump leverage",
    "description": "What happened\nU.S. District Judge Dale Ho Wednesday dismissed federal corruption charges against New York City Mayor Eric Adams, as requested by President Donald Trump's Justice Department. But Ho said he found the Trump administration's decision \"troubling\" …",
    "link": "https://biztoc.com/x/501c8827ea415947",
    "timestamp": "2025-04-03T15:59:46Z"
  },
  {
    "title": "Bitcoin slides to $81,000 as Trump tariffs jolt stock market",
    "description": "Bitcoin and other cryptocurrencies were under pressure Thursday after President Donald Trump's big tariffs reveal jolted the stock market.\nThe price of the flagship cryptocurrency was last 5% lower at $81,479.77, according to Coin Metrics. Ether fell 7% and t…",
    "link": "https://biztoc.com/x/f2e5dc9b02c3ac97",
    "timestamp": "2025-04-03T15:59:33Z"
  },
  {
    "title": "Tesla and Elon Musk Have Been Targeted in 50+ Attacks Across America",
    "description": "The number of reported attacks on Tesla vehicles, dealerships, and charging stations has surpassed 50 just in the United States. Irrational leftists targeting Elon Musk for his support of Donald Trump have done everything from vandalize Tesla EVs owned by inn…",
    "link": "https://www.breitbart.com/tech/2025/04/03/tesla-and-elon-musk-have-been-targeted-in-50-attacks-across-america/",
    "timestamp": "2025-04-03T15:58:44Z"
  },
  {
    "title": "JD Vance Suggests Migrant Deported In Error Was A Bad Person Due To Traffic Violations",
    "description": "The Trump administration admitted that the removal of a Maryland father had been done in error, but the vice president defended it anyway.",
    "link": "https://www.huffpost.com/entry/jd-vance-migrant-error-traffic-violations_n_67ee92ffe4b0c989cefde651",
    "timestamp": "2025-04-03T15:58:12Z"
  },
  {
    "title": "Trump’s new tariffs ignite a meme frenzy as internet reacts with humour and criticism",
    "description": "President Trump's new tariffs sparked a viral meme frenzy, with social media users humorously criticizing the policy. Memes ranged from satirical takes on tariffs to references to Bollywood and cricket, while Indian exporters expressed concerns over economic …",
    "link": "https://economictimes.indiatimes.com/tech/technology/trumps-new-tariffs-ignite-a-meme-frenzy-as-internet-reacts-with-humour-and-criticism/articleshow/119950633.cms",
    "timestamp": "2025-04-03T15:58:09Z"
  },
  {
    "title": "Will Iran Cut a Deal With Trump?",
    "description": "The supreme leader may not be looking for a bromance, but Tehran seems ready to talk.",
    "link": "https://www.theatlantic.com/international/archive/2025/04/us-iran-nuclear-sanctions/682280/",
    "timestamp": "2025-04-03T15:57:56Z"
  },
  {
    "title": "Neal Katyal's Law Firm Striking Trump Deal Stuns MSNBC Viewers",
    "description": "Neal Katyal, the former acting solicitor general of the United States and legal analyst for MSNBC, is a frequent critic of Donald Trump.",
    "link": "https://www.newsweek.com/neal-katyal-trump-deal-msnbc-2054900",
    "timestamp": "2025-04-03T15:57:16Z"
  },
  {
    "title": "Department Of Education Takes Big Step To Change Student Loan Forgiveness And Repayment Plan Rules",
    "description": "The Department of Education took a key step to initiate a process that could result in major changes to federal student loan forgiveness and repayment programs.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/04/03/department-of-education-takes-big-step-to-change-student-loan-forgiveness-and-repayment-plan-rules/",
    "timestamp": "2025-04-03T15:56:06Z"
  },
  {
    "title": "Dow tumbles 1,300 points and dollar weakens as recession fears grip Wall Street",
    "description": "New York (CNN) — Global markets on Thursday were severely rattled by President Donald Trump’s historic tariff announcement, which threatens to plunge the US and the rest of the world",
    "link": "https://www.waow.com/news/dow-tumbles-1-300-points-and-dollar-weakens-as-recession-fears-grip-wall-street/article_5f299f68-f679-5c73-b0b0-b3063d2c9d63.html",
    "timestamp": "2025-04-03T15:55:04Z"
  },
  {
    "title": "Punitive or a gift? How five big economies see new Trump tariffs",
    "description": "BBC reporters look at how the latest US import taxes are seen in the EU, China, India, the UK and South Africa.",
    "link": "https://www.bbc.com/news/articles/cq80vwj2092o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-03T15:54:47Z"
  },
  {
    "title": "After corruption case scandal, Eric Adams tries to buy more time for his re-election bid",
    "description": "Adams said he will run as an independent, giving himself more time to mend his reputation after politically ruinous controversies.",
    "link": "https://www.msnbc.com/top-stories/latest/eric-adams-nyc-mayor-independent-rcna199489",
    "timestamp": "2025-04-03T15:54:30Z"
  },
  {
    "title": "Chuck Schumer Threatens To Use Tactic Democrats Once Called ‘Jim Crow Relic’ To Block Bill Securing American Elections",
    "description": "Senate Democratic Leader Chuck Schumer is threatening to block election integrity legislation that would ensure noncitizens do not vote in American elections.",
    "link": "https://dailycaller.com/2025/04/03/chuck-schumer-threatens-to-use-tactic-democrats-once-called-jim-crow-relic-to-block-bill-securing-american-elections/",
    "timestamp": "2025-04-03T15:53:53Z"
  },
  {
    "title": "‘Liberation day’ for US?",
    "description": "Trump’s tariff bazooka could invite retaliation",
    "link": "https://www.thehindubusinessline.com/opinion/liberation-day-for-us/article69409523.ece",
    "timestamp": "2025-04-03T15:53:32Z"
  },
  {
    "title": "List of Countries Considering Lifting Tariffs on the US",
    "description": "\"We are going to fight these tariffs with countermeasures,\" Canadian Prime Minister Mark Carney said Wednesday.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-canada-israel-mexico-2054836",
    "timestamp": "2025-04-03T15:52:55Z"
  },
  {
    "title": "Worker rights agency chief signals shift of focus to Trump’s campaign to stamp out",
    "description": "The initial steps taking by Andrea Lucas, acting chief of the Equal Opportunity Employment Commission, have earned her backing from the Trump administration.",
    "link": "https://www.pbs.org/newshour/politics/worker-rights-agency-chief-signals-shift-of-focus-to-trumps-campaign-to-stamp-out",
    "timestamp": "2025-04-03T15:52:49Z"
  },
  {
    "title": "BREAKING NEWSTrump fires staff of 'idiot' adviser embroiled in Signal scandal after urging by controversial MAGA influencer",
    "description": "President Donald Trump has fired several members of his National Security Council team. DailyMail.com confirmed an Axios report released Thursday morning. The dismissals come after National Security Advisor Michael Waltz accidentally added The Atlantic's edit…",
    "link": "https://freerepublic.com/focus/f-news/4308597/posts",
    "timestamp": "2025-04-03T15:52:28Z"
  },
  {
    "title": "What do Trump’s tariffs have to do with the Titanic? QAnon knows",
    "description": "Followers of the QAnon conspiracy theory appear convinced that President Donald Trump's tariffs somehow prove the Titanic was sunk on purpose.\n\n\nIn posts to the pro-QAnon forum known as The Great Awakening, users cited remarks made by Trump Wednesday where he…",
    "link": "https://www.dailydot.com/debug/qanon-titanic-donald-trump-tariffs-conspiracy/",
    "timestamp": "2025-04-03T15:51:05Z"
  },
  {
    "title": "What Donald Trump's Bombshell Tariffs Mean for Your Pension",
    "description": "Millions of Americans hold retirement accounts. But the President's new tariffs could have impacts on later life savings.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-mean-pensions-2054855",
    "timestamp": "2025-04-03T15:50:39Z"
  },
  {
    "title": "Trump vs. the Courts: Lessons From the World",
    "description": "Leaders have clashed with the judiciary in Brazil, Israel, Hungary, and Turkey. Here’s how that turned out.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-courts-constitution-brazil-israel-turkey-hungary/",
    "timestamp": "2025-04-03T15:49:26Z"
  },
  {
    "title": "Carney: Trump's tariffs will rupture global economy",
    "description": "Canadian Prime Minister Mark Carney said on Thursday that the latest tariffs imposed by United States President Donald Trump will \"rupture\" the global economy.Carney stressed that the latest reciproca...",
    "link": "https://biztoc.com/x/84cd8aa8f55466cf",
    "timestamp": "2025-04-03T15:49:06Z"
  },
  {
    "title": "Here's how Trump's tariff plans could trigger a full-blown recession within the next year",
    "description": "Wall Street was betting on a Trump Bump, but sweeping tariffs are threatening an economic slowdown.",
    "link": "https://www.businessinsider.com/stock-market-crash-trump-tariffs-recession-doge-china-trade-war-2025-4",
    "timestamp": "2025-04-03T15:49:06Z"
  },
  {
    "title": "Crimea Video Shows Kyiv Strikes on Russian Black Sea Fleet",
    "description": "Ukrainian drones \"evaded\" Russian air defense missiles stationed in Crimea, said Kyiv's GUR military intelligence agency.",
    "link": "https://www.newsweek.com/crimea-video-ukraine-gur-tor-m2-air-defense-system-2054885",
    "timestamp": "2025-04-03T15:48:33Z"
  },
  {
    "title": "Lutnick: No chance Trump will back off tariffs",
    "description": "United States Commerce Secretary Howard Lutnick told CNN on Thursday that there is \"no chance\" that President Donald Trump will \"back off\" his new tariff policy.Lutnick stressed that the countries tha...",
    "link": "https://biztoc.com/x/8b960905a5439db3",
    "timestamp": "2025-04-03T15:48:33Z"
  },
  {
    "title": "Here's what car buyers can expect from latest auto tariffs",
    "description": "Uncertainty seems to be the mood of the season as investors attempt to navigate the nearly universal tariffs President Donald Trump and his administration placed on the rest of the world. \nOne of Trump's goals for this move, besides balancing trade deficits w…",
    "link": "https://biztoc.com/x/9c5ef008f21f0d0d",
    "timestamp": "2025-04-03T15:48:33Z"
  },
  {
    "title": "Europe ends in the red, DAX down 655 pts",
    "description": "European stock markets fell sharply at Thursday's close after US President Donald Trump announced sweeping trade tariffs. Markets had already shown signs of turbulence in premarket trading, reacting t...",
    "link": "https://biztoc.com/x/25905a8641ef2933",
    "timestamp": "2025-04-03T15:48:29Z"
  },
  {
    "title": "Trump rolls out tariffs on virtually all imports",
    "description": "What happened\nPresident Donald Trump Wednesday unveiled a baseline 10% tariff on all imported goods and steeper \"reciprocal\" import taxes for specific countries, including 20% for the European Union, an extra 34% for China, 24% for Japan, 46% for Vietnam and …",
    "link": "https://biztoc.com/x/f2a9993949bb3841",
    "timestamp": "2025-04-03T15:48:27Z"
  },
  {
    "title": "Trump tariff list names Taiwan as ‘country’",
    "description": "The move plays directly into Taipei's long-standing desire for international recognition, while subtly signalling that Washington may be less willing to kowtow to Beijing's preferred semantics.",
    "link": "https://www.euractiv.com/section/politics/news/trump-tariff-list-names-taiwan-as-country/",
    "timestamp": "2025-04-03T15:47:32Z"
  },
  {
    "title": "Mike Johnson's chief of staff pleads not guilty to DUI",
    "description": "A top aide to House Speaker Mike Johnson pleaded not guilty after facing a charge of operating a motor vehicle under the influence the night President Donald Trump made a speech to a joint session of Congress. Politico reported that Hayden Haynes appeared Thu…",
    "link": "https://www.rawstory.com/hayden-haynes-mike-johnson-dui/",
    "timestamp": "2025-04-03T15:47:31Z"
  },
  {
    "title": "Judge ends Eric Adams case, Trump leverage",
    "description": "Federal corruption charges against New York City Mayor Eric Adams were dismissed, as requested by Trump's Justice Department",
    "link": "https://theweek.com/crime/eric-adams-case-dismissed",
    "timestamp": "2025-04-03T15:47:22Z"
  },
  {
    "title": "CNN Anchor Confronts Karoline Leavitt Over Trump Country Farmer Torching Tariffs: ‘What Is That Farmer Missing?’",
    "description": "CNN anchor Kate Bolduan confronted Karoline Leavitt with a complaint from a Trump country farmer bashing Trump's tariffs as \"pouring salt in a wound.\"\nThe post CNN Anchor Confronts Karoline Leavitt Over Trump Country Farmer Torching Tariffs: ‘What Is That Far…",
    "link": "https://www.mediaite.com/news/cnn-anchor-confronts-karoline-leavitt-over-trump-country-farmer-torching-tariffs-what-is-that-farmer-missing/",
    "timestamp": "2025-04-03T15:47:14Z"
  },
  {
    "title": "Fourth firm reaches pro bono deal with Trump to avoid potential order punishing its government clients",
    "description": "Milbank is the fourth law firm to reach a settlement with President Donald Trump that calls on the firm to provide pro bono services on issues that they both support.",
    "link": "https://www.abajournal.com/news/article/a-fourth-law-firm-reaches-a-pro-bono-deal-with-trump-to-avoid-an-order-punishing-its-government-clients",
    "timestamp": "2025-04-03T15:47:00Z"
  },
  {
    "title": "US faces fiscal collapse – Michael Bloomberg",
    "description": "The US is headed for a “fiscal breakdown” unless it pursues urgent tax hikes and austerity measures, Michael Bloomberg warns Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615200-us-fiscal-collapse-bloomberg/",
    "timestamp": "2025-04-03T15:46:15Z"
  },
  {
    "title": "Illegal immigrants in Aurora, Colorado arrested for targeting homeowners in ‘sophisticated’ burglaries: police",
    "description": "Five Colombian nationals are in ICE custody and facing charges after authorities in Aurora, Colorado, arrested them for conducting a sophisticated burglary operation.",
    "link": "https://www.foxnews.com/us/illegal-immigrants-aurora-colorado-arrested-targeting-homeowners-sophisticated-burglaries-police",
    "timestamp": "2025-04-03T15:45:56Z"
  },
  {
    "title": "Donald Trump Reciprocal Tariffs: Best memes and jokes",
    "description": "On Liberation Day 2025, US President Donald Trump announced a 10% tariff on all countries starting April 5th, affecting around 60 nations including the UK, Australia, China, and the EU. The move aims to revive American manufacturing but has met immediate crit…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trump-reciprocal-tariffs-best-memes-and-jokes/articleshow/119950308.cms",
    "timestamp": "2025-04-03T15:45:56Z"
  },
  {
    "title": "Why Trump Is Making It Easier for One Group—and One Group Only—to Come to the United States",
    "description": "The “Mission South Africa” program has been a long time coming.",
    "link": "https://slate.com/news-and-politics/2025/04/trump-musk-south-africa-white-genocide-refugees.html",
    "timestamp": "2025-04-03T15:45:41Z"
  },
  {
    "title": "Fencer takes knee in protest against transgender opponent",
    "description": "A women's fencer is disqualified from a competition in the United States after refusing to compete against a transgender opponent.",
    "link": "https://www.bbc.com/sport/fencing/articles/cpdzv76gl49o",
    "timestamp": "2025-04-03T15:45:24Z"
  },
  {
    "title": "Whoops! Trump Slaps Tariffs on Uninhabited Islands (Charlie Nash/Mediaite)",
    "description": "Charlie Nash / Mediaite:\nWhoops!  Trump Slaps Tariffs on Uninhabited Islands  —  President Donald Trump implemented tariffs on several uninhabited islands on Wednesday as part of a confused effort to establish equal trade.  —  The White House published a list…",
    "link": "https://www.memeorandum.com/250403/p64",
    "timestamp": "2025-04-03T15:45:01Z"
  },
  {
    "title": "Trump’s Tariff Formula Slammed As ‘Fake’ And ‘Incredibly Stupid’ By Experts",
    "description": "The approach appears to punish countries based on their trade imbalances with the U.S., rather than the taxes they impose on the U.S. and a combination of other trade barriers Trump claimed the new tariff rates debuted Wednesday are based on.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/03/trumps-tariff-formula-slammed-as-fake-and-incredibly-stupid-by-experts/",
    "timestamp": "2025-04-03T15:44:44Z"
  },
  {
    "title": "Newsom foe picked by Trump for key prosecutor job vows to 'dismantle' sanctuary state shields",
    "description": "President Donald Trump has tapped California GOP rising star Bill Essayli to be the chief prosecutor in nation's most populous federal court district.",
    "link": "https://www.foxnews.com/politics/newsom-foe-picked-trump-key-prosecutor-job-vows-dismantle-sanctuary-state-shields",
    "timestamp": "2025-04-03T15:44:01Z"
  },
  {
    "title": "Far-right activist Laura Loomer told Trump to fire national security team members in Oval Office meeting",
    "description": "Far-right activist Laura Loomer met with President Donald Trump in the Oval Office on Wednesday afternoon, in a meeting attended by Vice President JD Vance and National Security Adviser Mike Waltz, two sources familiar with the meeting told NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/far-right-activist-laura-loomer-told-trump-fire-national-security-team-rcna199518",
    "timestamp": "2025-04-03T15:43:54Z"
  },
  {
    "title": "Paul, Weiss and Skadden: Capitulating Cowards of the Legal Profession",
    "description": "Donald Trump’s unconstitutional assault on the biggest law firms has roiled the entire legal industry. The news from just Wednesday has one more big firm, Milbank, caving to Trump’s nasty leverage campaign, and ferocious criticism from law school deans, bar a…",
    "link": "https://newrepublic.com/article/193553/paul-weiss-skadden-big-law-cowards-capitulating-trump",
    "timestamp": "2025-04-03T15:43:47Z"
  },
  {
    "title": "Tariff war: EU must decide how hard it wants to hit back",
    "description": "EU capitals conscious of avoiding public bickering over US tariff response",
    "link": "https://www.irishtimes.com/ireland/2025/04/03/tariff-war-eu-must-decide-how-hard-it-wants-to-hit-back/",
    "timestamp": "2025-04-03T15:42:56Z"
  },
  {
    "title": "Trump Envoy Says US-Congo Mining and Security Deal Moving Ahead",
    "description": "The US and Democratic Republic of Congo are preparing a minerals and security partnership, President Donald Trump’s senior adviser for Africa said after meeting with President Felix Tshisekedi Thursday.",
    "link": "https://www.livemint.com/companies/news/trump-envoy-says-us-congo-mining-and-security-deal-moving-ahead-11743694961887.html",
    "timestamp": "2025-04-03T15:42:41Z"
  }
]