[
  {
    "title": "Trump administration eases limits on coal plants for emitting mercury, other toxins",
    "description": "The Environmental Protection Agency has eased rules on mercury and toxic emissions from coal power plants. This move aims to support the fossil fuel industry. The agency stated this will lower power generation costs and improve grid reliability. Environmental…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administration-eases-limits-on-coal-plants-for-emitting-mercury-other-toxins/articleshow/128619993.cms",
    "timestamp": "2026-02-20T18:14:25Z"
  },
  {
    "title": "$175 billion refund? SC flags 'messy' process as Trump & Co may have to give the money back",
    "description": "The US Supreme Court has ruled against President Trump's trade tariffs. This decision could lead to over 175 billion dollars in refunds for collected duties. The court stated the President exceeded his authority in imposing these tariffs. This ruling impacts …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/175-billion-refund-trump-tariffs-supreme-court-ruling-feb-20-trade-war-give-the-money-back/articleshow/128619137.cms",
    "timestamp": "2026-02-20T18:14:06Z"
  },
  {
    "title": "Vulnerable Democrat Pursues ‘Shameless’ Campaign Tactic — After Being Called Out The First Time",
    "description": "Just months after facing backlash for touting federal funding she had opposed, Democratic New York Rep. Laura Gillen once again stood smiling behind a massive cutout check tied to funding she voted against. Gillen, a freshman lawmaker facing a potentially tou…",
    "link": "https://dailycaller.com/2026/02/20/laura-gillen-cutout-check-funding-tom-suozzi/",
    "timestamp": "2026-02-20T18:13:50Z"
  },
  {
    "title": "Trump vows to release classified information on aliens after admonishing Obama for commenting on classified information about aliens",
    "description": "After accusing the former president of confirming aliens exist, President Donald Trump has announced he will be releasing government records related to aliens and any unidentified flying objects.  “Based on the tremendous interest shown, I will be directing t…",
    "link": "https://fortune.com/2026/02/20/trump-declassified-information-obama-ufo-aliens-real/",
    "timestamp": "2026-02-20T18:12:39Z"
  },
  {
    "title": "What is ADIZ and why were Russian fighter jets spotted near Alaska? Here's all complete details",
    "description": "What is ADIZ and why were Russian fighter jets spotted near Alaska? NORAD detected Russian Tu-95, Su-35, and A-50 aircraft in Alaska ADIZ. US responded with F-16 and F-35 jets. The aircraft stayed in international airspace. ADIZ helps identify aircraft before…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-adiz-and-why-were-russian-fighter-jets-spotted-near-alaska-heres-all-complete-details/articleshow/128619114.cms",
    "timestamp": "2026-02-20T18:10:14Z"
  },
  {
    "title": "Fox’s Jacqui Heinrich Disputes CNN Report About Trump Throwing a Tantrum After Tariff Decision",
    "description": "Fox's Jacqui Heinrich disputed a report from CNN's Kristen Holmes about Donald Trump's reaction to Friday's Supreme Court decision striking down his tariffs.\nThe post Fox’s Jacqui Heinrich Disputes CNN Report About Trump Throwing a Tantrum After Tariff Decisi…",
    "link": "https://www.mediaite.com/media/news/foxs-jacqui-heinrich-disputes-cnn-report-about-trump-throwing-a-tantrum-after-tariff-decision/",
    "timestamp": "2026-02-20T18:09:43Z"
  },
  {
    "title": "Trump’s Tariff Fantasy Just Exploded",
    "description": "President Trump’s tariff power grab was a bridge too far for the Supreme Court. Even two of his own appointees balked. Elie Honig explains why and what hurdles remain.",
    "link": "http://nymag.com/intelligencer/article/the-supreme-court-just-blew-up-trumps-tariff-fantasy.html",
    "timestamp": "2026-02-20T18:09:16Z"
  },
  {
    "title": "What did Gavin Newsom say about Trump after the US Supreme Court struck down tariffs? His tweet is everywhere",
    "description": "Governor Gavin Newsom urged the Trump Administration to issue immediate refund checks with interest to American families and businesses following the Supreme Court's ruling that President Trump's tariffs were illegal. The Court confirmed that the President la…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-did-gavin-newsom-say-about-trump-after-the-us-supreme-court-struck-down-tariffs-his-tweet-is-everywhere/articleshow/128618301.cms",
    "timestamp": "2026-02-20T18:08:57Z"
  },
  {
    "title": "Trump warns he's considering limited strikes even as Iranian diplomat says proposed deal is imminent",
    "description": "In response to a reporter's question on whether the U.S. could take limited military action as the countries negotiate, President Donald Trump said, \"I guess I can say I am considering that.\"",
    "link": "https://www.pbs.org/newshour/world/trump-warns-hes-considering-limited-strikes-even-as-iranian-diplomat-says-proposed-deal-is-imminent",
    "timestamp": "2026-02-20T18:08:30Z"
  },
  {
    "title": "Nobody Did More to Make Clear Trump’s Tariffs Are Unconstitutional Than Trump Himself",
    "description": "Justice Gorsuch so eloquently explains why Trump, over and over again, revealed just how illegal his tariffs were.\nThe post Nobody Did More to Make Clear Trump’s Tariffs Are Unconstitutional Than Trump Himself first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/nobody-did-more-to-make-clear-trumps-tariffs-are-unconstitutional-than-trump-himself/",
    "timestamp": "2026-02-20T18:08:24Z"
  },
  {
    "title": "Who made the cut on Trump’s ‘Board of Peace’ and what they want",
    "description": "The Board of Peace takes Washington.",
    "link": "https://www.aljazeera.com/video/the-take-2/2026/2/20/aje-onl-glb_boardofpeacemeeting_av_v1-190226",
    "timestamp": "2026-02-20T18:08:19Z"
  },
  {
    "title": "Trump warns he’s considering limited strikes as Iranian diplomat says proposed deal is imminent",
    "description": "The tensions between the longtime adversaries have ramped up.",
    "link": "https://www.denverpost.com/2026/02/20/us-iran-trump-plan/",
    "timestamp": "2026-02-20T18:07:05Z"
  },
  {
    "title": "Trump warns he’s considering limited strikes as Iranian diplomat says proposed deal is imminent",
    "description": "The tensions between the longtime adversaries have ramped up.",
    "link": "https://www.bostonherald.com/2026/02/20/us-iran-trump-plan/",
    "timestamp": "2026-02-20T18:07:05Z"
  },
  {
    "title": "Mercury Latest Trump Rollback of Environmental Protections",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n A coal-fired plant in the town of Poca near the Kanawha River, in West Virginia, US, August 28, 2018.\n © 2018 John Ray/AP Photo \n \n \n\n\n \nUS President Donald Trump’s administration today rolled back another air-pollut…",
    "link": "https://www.hrw.org/news/2026/02/20/mercury-latest-trump-rollback-of-environmental-protections",
    "timestamp": "2026-02-20T18:05:26Z"
  },
  {
    "title": "Georgia Full-Line Steel Service Center President Says Trump's Tariffs Saved Business",
    "description": "The president of a family-owned full-line steel service center praised President Donald Trump's tariff policies during Trump's visit to the company's facility in Georgia on Thursday. \nThe post Georgia Full-Line Steel Service Center President Says Trump’s Tari…",
    "link": "https://www.breitbart.com/politics/2026/02/20/georgia-full-line-steel-service-center-president-says-trumps-tariffs-saved-business/",
    "timestamp": "2026-02-20T18:04:25Z"
  },
  {
    "title": "Why Texas' redistricting plan isn't a sure bet",
    "description": "Republicans pursued that goal largely by \"cracking\" Democratic-leaning voters across multiple districts.",
    "link": "https://www.pbs.org/newshour/politics/why-texas-redistricting-plan-isnt-a-sure-bet",
    "timestamp": "2026-02-20T18:03:20Z"
  },
  {
    "title": "FCC Chair Carr Wants TV Networks More Pro-USA for America's 250th",
    "description": "When he's not busy manipulating the networks to make late-night television as Donald Trump-friendly as possible, Trump's FCC Chair, Brendan Carr, has decided to take on the role of \"national network programmer\" with some scary thoughts and advice to the netwo…",
    "link": "https://bleedingcool.com/tv/fcc-chair-carr-wants-tv-networks-more-pro-usa-for-americas-250th/",
    "timestamp": "2026-02-20T18:02:07Z"
  },
  {
    "title": "Trump Faces Strong Resistance in Congress to Restoring Tariffs",
    "description": "President Donald Trump faces daunting odds of convincing the US Congress to restore his sweeping global tariffs after the Supreme Court decision Friday that struck them down.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-faces-strong-resistance-in-congress-to-restoring-tariffs",
    "timestamp": "2026-02-20T18:01:48Z"
  },
  {
    "title": "Trump weighs limited strikes as Iran signals deal near",
    "description": "President Trump is contemplating limited military action against Iran.  Meanwhile, Iran's top diplomat states a deal draft is expected in the coming days.  Tensions remain high as the US pushes for concessions.  Both nations signal readiness for conflict if t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-weighs-limited-strikes-as-iran-signals-deal-near/articleshow/128619477.cms",
    "timestamp": "2026-02-20T18:01:41Z"
  },
  {
    "title": "Charlie Kirk Show admits consumers getting 'screwed' by non-refunded Trump tariffs",
    "description": "Following a Supreme Court decision on tariffs, Andrew Kolvet, co-host of The Charlie Kirk show, admitted that consumers would get \"screwed\" because President Donald Trump had no intention of refunding the effective taxes paid due to his illegal policies.Durin…",
    "link": "https://www.rawstory.com/trump-refund-tariffs-kirk/",
    "timestamp": "2026-02-20T18:01:38Z"
  },
  {
    "title": "Susan Rice: Democrats Won’t ‘Forgive and Forget’ Those Who Took ‘a Knee to Trump’",
    "description": "Former U.S. Ambassador to the United Nations Susan Rice warned corporations and others who bent the knee to President Donald Trump will face consequences when Democrats retake power in DC. Rice made the comments on a podcast with former U.S. Attorney Preet Bh…",
    "link": "https://legalinsurrection.com/2026/02/susan-rice-democrats-wont-forgive-and-forget-those-who-took-a-knee-to-trump/",
    "timestamp": "2026-02-20T18:00:46Z"
  },
  {
    "title": "Team USA skier Hunter Hess has cheeky response to Trump calling him a loser",
    "description": "Team USA's Hunter Hess threw up an \"L\" hand sign following his qualifying run in freeski halfpipe as a response to President Donald Trump's criticism of him.",
    "link": "https://www.usatoday.com/story/sports/olympics/2026/02/20/hunter-hess-donald-trump-olympics/88778685007/",
    "timestamp": "2026-02-20T18:00:43Z"
  },
  {
    "title": "California finally enforces English tests for truck drivers, feds to unfreeze $40M",
    "description": "California Governor Gavin Newsom is finally reversing course.",
    "link": "https://nypost.com/2026/02/20/us-news/gavin-newsom-caves-as-california-enforces-english-tests-for-truck-drivers/",
    "timestamp": "2026-02-20T18:00:00Z"
  },
  {
    "title": "Trump administration rule could pause work permits for asylum applicants for 'many years'",
    "description": "The Trump administration has proposed a rule that could pause work permits for migrants filing asylum applications for \"many years\" in the United States.",
    "link": "https://www.channelnewsasia.com/world/trump-administration-migrant-asylum-seekers-work-permit-us-5943476",
    "timestamp": "2026-02-20T18:00:00Z"
  },
  {
    "title": "Putin is taking a gamble as Russia-Ukraine war turns four",
    "description": "Russian President Vladimir Putin is betting that the West and Ukraine will run out of resources first.",
    "link": "https://www.abc.net.au/news/2026-02-21/russia-ukraine-four-year-war-vladimir-putin/106349238",
    "timestamp": "2026-02-20T18:00:00Z"
  },
  {
    "title": "Comer: If There Had Been Any Epstein Dirt on Trump, It Would Have Leaked",
    "description": "Thursday on FNC's \"Hannity,\" House Oversight Committee chairman Rep. James Comer (R-KY) downplayed President Donald Trump's alleged ties to Jeffrey Epstein and his criminal indiscretions.\nThe post Comer: If There Had Been Any Epstein Dirt on Trump, It Would H…",
    "link": "https://www.breitbart.com/clips/2026/02/20/comer-if-there-had-been-any-epstein-dirt-on-trump-it-would-have-leaked/",
    "timestamp": "2026-02-20T17:59:31Z"
  },
  {
    "title": "Majority of Americans disapprove of how Trump handling tariffs: ABC/Post/Ipsos poll",
    "description": "The poll was conducted just days before a SCOTUS decision invalidating tariffs.",
    "link": "https://abcnews.com/Politics/majority-americans-disapprove-trump-handling-tariffs-abcpostipsos-poll/story?id=130340581",
    "timestamp": "2026-02-20T17:59:29Z"
  },
  {
    "title": "John Fetterman Rips Dems Planning To Protest State Of The Union: ‘You Really Need To Respect The Office’",
    "description": "“I just hope they don't do the kinds of things that some did last year,” the senator said.",
    "link": "https://www.huffpost.com/entry/john-fetterman-democrats-protest-trump-state-of-the-union_n_69988f81e4b041f92b419c56",
    "timestamp": "2026-02-20T17:58:02Z"
  },
  {
    "title": "Supreme Court warns Trump’s illegal tariffs could force $133 billion in refunds — who pays for this mess, and will the U.S. economy feel the heat now?",
    "description": "Up to $133 billion in Trump tariff refunds is now in question after the U.S. Supreme Court ruled the tariffs illegal under IEEPA. The decision could trigger massive tariff refunds to importers. That puts federal revenue and taxpayers at risk. The ruling limit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-warns-trumps-illegal-tariffs-could-force-133-billion-in-refunds-who-pays-for-this-mess-and-will-the-u-s-economy-feel-the-heat-now/articleshow/128618684.cms",
    "timestamp": "2026-02-20T17:58:01Z"
  },
  {
    "title": "Bucking 'Huge Consensus' at India Summit, Trump Admin Opposes Global AI Guardrails",
    "description": "As delegates from dozens of nations attending a key artificial intelligence summit in India prepare to deliver a statement Saturday on how humanity should handle development of the rapidly evolving technology, the Trump administration stood out for opposing c…",
    "link": "https://www.commondreams.org/news/us-opposes-ai-rules",
    "timestamp": "2026-02-20T17:57:40Z"
  },
  {
    "title": "Exporters welcome US Supreme Court ruling on Trump tariffs",
    "description": "Indian exporters welcome the US Supreme Court's decision to strike down President Trump's tariffs. This ruling provides significant relief to domestic firms previously affected by country-specific duties. The decision restores predictability in bilateral trad…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/exporters-welcome-us-supreme-court-ruling-on-trump-tariffs/articleshow/128619159.cms",
    "timestamp": "2026-02-20T17:55:37Z"
  },
  {
    "title": "What happens now that the Supreme Court struck down Trump's tariffs?",
    "description": "Friday's ruling will most likely prolong political and economic chaos over international trade through the election year.",
    "link": "https://www.pbs.org/newshour/politics/what-happens-now-that-the-supreme-court-struck-down-trumps-tariffs",
    "timestamp": "2026-02-20T17:55:22Z"
  },
  {
    "title": "DOJ Allegedly Removed Portion Of Epstein Files Connected To Trump",
    "description": "According to an investigative reporter who combed through the Epstein Files, mentions of an interview with a Trump accuser are now missing.",
    "link": "https://hiphopwired.com/3046414/doj-remove-trump-epstein-files-allegedly/",
    "timestamp": "2026-02-20T17:55:02Z"
  },
  {
    "title": "Trump’s tariffs have been struck down but there’s a catch. These sectors still face heavy duties",
    "description": "The US Supreme Court has invalidated many tariffs imposed by President Donald Trump using emergency powers. However, several other import duties remain in place. These include tariffs on steel, aluminum, automobiles, copper, lumber, kitchen cabinets, bathroom…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariffs-have-been-struck-down-but-theres-a-catch-these-sectors-still-face-heavy-duties/articleshow/128618790.cms",
    "timestamp": "2026-02-20T17:52:06Z"
  },
  {
    "title": "Kavanaugh in dissent: Bad policy or not, Trump's tariffs were 'clearly lawful'",
    "description": "Justices Kavanaugh, Alito, and Thomas argued that Trump's tariffs were lawful and that reversing them could get messy.",
    "link": "https://www.businessinsider.com/trumps-tariffs-dissenting-opinions-constitutional-thomas-kavanaugh-alito-2026-2",
    "timestamp": "2026-02-20T17:50:39Z"
  },
  {
    "title": "India a natural collaborator in building inclusive, trusted AI; recognise India’s security interests in Indian Ocean: Lankan President Dissanayake",
    "description": "India News: In an exclusive interview to TOI’s Sachin Parashar, Sri Lankan President Anura Kumara Dissanayake speaks about the significance of the AI Impact Summi.",
    "link": "https://timesofindia.indiatimes.com/india/india-a-natural-collaborator-in-building-inclusive-trusted-ai-recognise-indias-security-interests-in-indian-ocean-lankan-president-dissanayake/articleshow/128619003.cms",
    "timestamp": "2026-02-20T17:49:48Z"
  },
  {
    "title": "OPS congratulates Stalin, says DMK has an opportunity to come back to power",
    "description": "CHENNAI: Expelled AIADMK leader O Panneerselvam on Friday congratulated chief minister M K Stalin on the completion of the current assembly’s tenure a.",
    "link": "https://timesofindia.indiatimes.com/city/chennai/ops-congratulates-stalin-says-dmk-has-an-opportunity-to-come-back-to-power/articleshow/128619070.cms",
    "timestamp": "2026-02-20T17:49:35Z"
  },
  {
    "title": "Trump Flies Into A Rage After Supreme Court Decision On Tariffs",
    "description": "CNN is reporting that while Trump was having breakfast with some governors, he flew into an expletive-filled rage after the Supreme Court struck down his emergency tariffs.\nCNN senior White House correspondent Kristin Holmes reported that Demented Donald fume…",
    "link": "https://crooksandliars.com/2026/02/cnn-trump-flew-rage-after-supreme-court",
    "timestamp": "2026-02-20T17:48:27Z"
  },
  {
    "title": "Amazon, Etsy, other e-commerce stocks pop after Supreme Court rules against Trump's tariffs",
    "description": "President Donald Trump's tariffs have forced some e-commerce companies to raise prices and alter their supply chains.",
    "link": "https://www.cnbc.com/2026/02/20/supreme-court-decision-amazon-etsy-stocks-tariffs-trump.html",
    "timestamp": "2026-02-20T17:46:00Z"
  },
  {
    "title": "Trump administration relaxes limits on pollutants that coal plants may emit",
    "description": "The Environmental Protection Agency on Friday weakened limits on mercury and other toxic emissions from coal-fired power plants",
    "link": "https://www.wsbradio.com/news/business/trump-administration/EEBPFU4HII4URP6ZOTX4CQ6EZ4/",
    "timestamp": "2026-02-20T17:44:15Z"
  },
  {
    "title": "How Trump Gamed Approval For His Ballroom",
    "description": "“It’s sad that a majority of the commissioners lack expertise in art and architecture,” the person told CNN. “There is only one architect, yet he recused himself from reviewing the ballroom. This means that not a single architect will be reviewing the White H…",
    "link": "https://www.cnn.com/2026/02/19/politics/white-house-east-wing-vote-commission",
    "timestamp": "2026-02-20T17:44:00Z"
  },
  {
    "title": "Tensions between the Pentagon and AI giant Anthropic reach a boiling point",
    "description": "Over the last week, tensions between the Pentagon and artificial intelligence giant Anthropic have reached a boiling point.",
    "link": "https://www.nbcnews.com/tech/security/anthropic-ai-defense-war-venezuela-maduro-rcna259603",
    "timestamp": "2026-02-20T17:43:20Z"
  },
  {
    "title": "‘Tariffs suck’: Some Republicans privately celebrate as Supreme Court blocks Trump policy",
    "description": "Some Republicans quietly celebrate the Supreme Court’s decision blocking most of President Trump’s tariffs, calling it a win for Congress’ authority.",
    "link": "https://www.foxnews.com/politics/tariffs-suck-some-republicans-privately-celebrate-supreme-court-blocks-trump-policy",
    "timestamp": "2026-02-20T17:43:05Z"
  },
  {
    "title": "Israel strikes Hamas in Lebanon, Palestinian terrorists violate Gaza ceasefire 14 times from February 5 to 20, IDF says",
    "description": "As US President Donald Trump convened the Gaza Board of Peace for its inaugural meeting in Washington, DC, the IDF continued to report numerous ceasefire violations in the territory. Israel also struck the Ain al Hilweh Palestinian refugee camp near Sidon, Le…",
    "link": "https://www.longwarjournal.org/archives/2026/02/israel-strikes-hamas-in-lebanon-palestinian-terrorists-violate-gaza-ceasefire-14-times-from-february-5-to-20-idf-says.php",
    "timestamp": "2026-02-20T17:41:24Z"
  },
  {
    "title": "Live updates In rare rebuke of Trump, Supreme Court strikes down tariffs (Washington Post)",
    "description": "Washington Post:\nLive updates In rare rebuke of Trump, Supreme Court strikes down tariffs  —  The Supreme Court on Friday struck down most of President Donald Trump's sweeping tariffs, a ruling that deals a major blow to his signature economic policy and repr…",
    "link": "https://www.memeorandum.com/260220/p62",
    "timestamp": "2026-02-20T17:40:00Z"
  },
  {
    "title": "Vigilance raids forester, finds triple-storied building",
    "description": "Vigilance sleuths uncovered assets worth crores during simultaneous searches linked to forester Bhagbat Bhusan Behera in Kalahandi district. Detected assets include a triple-storied building, nine plots, significant deposits, gold and silver ornaments, cash, …",
    "link": "https://timesofindia.indiatimes.com/city/bhubaneswar/vigilance-raids-forester-finds-triple-storied-building/articleshow/128618757.cms",
    "timestamp": "2026-02-20T17:39:39Z"
  },
  {
    "title": "Furious Trump Imposes 1000% Tariff On Supreme Court",
    "description": "WASHINGTON, D.C. — Following a ruling stripping him of his ability to impose emergency tariffs, a visibly furious President Donald Trump imposed a 1,000% tariff on the United States Supreme Court.",
    "link": "https://babylonbee.com/news/furious-trump-imposes-1000-tariff-on-supreme-court",
    "timestamp": "2026-02-20T17:39:38Z"
  },
  {
    "title": "US Supreme Court shoots down Trump’s tariffs",
    "description": "The US president exceeded his authority when he used emergency powers to justify global tariffs, the Supreme Court has ruled Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632846-supreme-court-trump-tariffs/",
    "timestamp": "2026-02-20T17:38:53Z"
  },
  {
    "title": "WATCH LIVE: Trump holds news conference after Supreme Court strikes down his global tariffs",
    "description": "It's the first major piece of President Donald Trump's broad agenda to come squarely before the nation's highest court, which he helped shape with the appointments of three conservative jurists in his first term.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-holds-news-conference-after-supreme-court-strikes-down-his-global-tariffs",
    "timestamp": "2026-02-20T17:38:23Z"
  },
  {
    "title": "European trade pact with Trump scrambled by Supreme Court tariff ruling",
    "description": "Europe is seeking stability after the Supreme Court of the United States blew up President Donald Trump’s tariff playbook — forcing officials to rethink a trade agreement reached in July 2025 that has not been ratified. “Our basic assumption that President Tr…",
    "link": "https://nypost.com/2026/02/20/us-news/european-trade-pact-with-trump-scrambled-by-supreme-court-tariff-ruling/",
    "timestamp": "2026-02-20T17:38:09Z"
  },
  {
    "title": "Will it rain in Chennai on Saturday?",
    "description": "CHENNAI: After several dry and warm days, rainfall may return to Chennai. The IMD has forecast light to moderate intensity rainfall on Saturday, thoug.",
    "link": "https://timesofindia.indiatimes.com/city/chennai/will-it-rain-in-chennai-on-saturday/articleshow/128618666.cms",
    "timestamp": "2026-02-20T17:37:30Z"
  },
  {
    "title": "Trump’s Tariffs Are Unlawful, Supreme Court Rules",
    "description": "But it’s unclear what happens to the tens of billions of dollars already taken from U.S. businesses.",
    "link": "http://foreignpolicy.com/2026/02/20/supreme-court-tariffs-trump-ruling-ieepa/",
    "timestamp": "2026-02-20T17:37:05Z"
  },
  {
    "title": "Turbulence in Tally — Presented by Good morning and happy Friday. (Politico)",
    "description": "Politico:\nTurbulence in Tally  —  Presented by Good morning and happy Friday.  —  The Republican-controlled Florida Legislature landed the plane on one big item for the 2026 session on Thursday: A bill that would rename Palm Beach International Airport after …",
    "link": "https://www.memeorandum.com/260220/p61",
    "timestamp": "2026-02-20T17:35:01Z"
  },
  {
    "title": "Hunter Hess Said Criticism From Trump Made Olympics Hard",
    "description": "Hunter Hess Said Criticism From Trump Made Olympics Hardlittlethings.com",
    "link": "https://littlethings.com/entertainment/hunter-hess-olympics-donald-tru",
    "timestamp": "2026-02-20T17:34:34Z"
  },
  {
    "title": "Four Years of War in Europe",
    "description": "Eight thinkers on the lasting impact of Russia’s invasion of Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/20/ukraine-russia-war-anniversary-trump-europe-nato-geopolitics-global-order/",
    "timestamp": "2026-02-20T17:33:54Z"
  },
  {
    "title": "US aircraft carrier enters Mediterranean as Trump mulls Iran strikes",
    "description": "The USS Gerald R. Ford aircraft carrier has entered the Mediterranean Sea. This deployment is part of a significant US military buildup in the Middle East. President Donald Trump ordered the carrier's movement. He is also considering a limited strike on Iran.…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-aircraft-carrier-enters-mediterranean-as-trump-mulls-iran-strikes/articleshow/128618508.cms",
    "timestamp": "2026-02-20T17:32:49Z"
  },
  {
    "title": "Dow Jones crashes today: why is Dow down today despite the tariff ruling? S&P 500 and Nasdaq outperform on tech rebound",
    "description": "Dow Jones crashed 104.34 points to 49,290.82 today as U.S. GDP growth cratered to 1.4%. This massive economic miss stalled the blue-chip index. Meanwhile, the Nasdaq rose 0.41% after the Supreme Court struck down Trump’s tariffs. Tech stocks like Amazon jumpe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dow-jones-crashes-today-why-is-dow-down-today-despite-the-tariff-ruling-sp-500-and-nasdaq-outperform-on-tech-rebound/articleshow/128618265.cms",
    "timestamp": "2026-02-20T17:32:28Z"
  },
  {
    "title": "India reaffirms support for two-state solution to Palestine issue condemning Israel's expansion in West Bank",
    "description": "India has reiterated its strong backing for a two-state solution to the Palestine issue. The nation has joined over 100 countries and organizations in condemning Israel's unlawful settlement expansion in the West Bank. This stance aligns with India's commitme…",
    "link": "https://economictimes.indiatimes.com/news/india/india-reaffirms-support-for-two-state-solution-to-palestine-issue-condemning-israels-expansion-in-west-bank/articleshow/128617233.cms",
    "timestamp": "2026-02-20T17:32:26Z"
  },
  {
    "title": "Student loan delinquency rate jumps to nearly 25% in Trump's second term, analysis finds",
    "description": "Around 7.9 million student loan borrowers entered delinquency in the first three quarters of 2025 alone, according to a new report by The Century Foundation.",
    "link": "https://www.cnbc.com/2026/02/20/student-loan-delinquency.html",
    "timestamp": "2026-02-20T17:32:18Z"
  },
  {
    "title": "Flashback: ESPN Celebrated Olympian Eileen Gu After She Chose Red China Over Team USA",
    "description": "Many may recall that ESPN celebrated turncoat Olympic athlete Eileen Gu with its \"Breakout Athlete of the Year\" award in 2022.\nThe post Flashback: ESPN Celebrated Olympian Eileen Gu After She Chose Red China Over Team USA appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/02/20/flashback-espn-celebrated-olympian-eileen-gu-after-she-chose-red-china-team-usa/",
    "timestamp": "2026-02-20T17:31:52Z"
  },
  {
    "title": "Watch: Trump to speak after Supreme Court strikes down tariffs",
    "description": "The Supreme Court ruling is a major blow to Trump, whose economic and foreign policies leaned on his asserted power to unilaterally slap tariffs on any country.",
    "link": "https://www.cnbc.com/2026/02/20/trump-supreme-court-tariffs-white-house.html",
    "timestamp": "2026-02-20T17:31:15Z"
  },
  {
    "title": "'Angry' Trump may launch war after having 'worst day' due to Supreme Court: ex-GOP insider",
    "description": "Former Republican lawmaker Adam Kinzinger issued a bleak warning Friday that, in the wake of the Supreme Court’s bombshell ruling on President Donald Trump’s tariffs, the president may very well ignite a regional war out of rage after having “clearly the wors…",
    "link": "https://www.rawstory.com/tariffs-2675288897/",
    "timestamp": "2026-02-20T17:30:36Z"
  },
  {
    "title": "Trump administration relaxes limits on pollutants that coal plants may emit",
    "description": "The Environmental Protection Agency on Friday weakened limits on mercury and other toxic emissions from coal-fired power plants. The announcement was made at a large coal plant in Kentucky. Limits on mercury and other toxic emissions were first put in place b…",
    "link": "https://apnews.com/article/trump-coal-zeldin-mercury-epa-emissions-b770d6efd05f19ed24b179511c726196",
    "timestamp": "2026-02-20T17:30:16Z"
  },
  {
    "title": "US House campaigns are underway. Yet a redistricting battle triggered by Trump rages in some states",
    "description": "Final boundaries for congressional voting districts remain uncertain in many states.",
    "link": "https://www.bostonherald.com/2026/02/20/election-2026-redistricting-glance/",
    "timestamp": "2026-02-20T17:30:13Z"
  },
  {
    "title": "The Supreme Court struck down some of Trump’s most sweeping tariffs. Which levies are impacted?",
    "description": "Trump has launched a barrage of new tariffs over the last year.",
    "link": "https://www.denverpost.com/2026/02/20/which-trump-tariffs-are-impacted/",
    "timestamp": "2026-02-20T17:30:00Z"
  },
  {
    "title": "The Supreme Court struck down some of Trump’s most sweeping tariffs. Which levies are impacted?",
    "description": "Trump has launched a barrage of new tariffs over the last year.",
    "link": "https://www.bostonherald.com/2026/02/20/which-trump-tariffs-are-impacted/",
    "timestamp": "2026-02-20T17:30:00Z"
  },
  {
    "title": "FMCSA finalizes removal, amendment of 12 of 18 ‘burdensome’ regs previously identified",
    "description": "FMCSA has moved forward on a dozen of its proposed deregulatory actions, including removing the requirement to carry extra spare fuses, clarifying that electronic DVIRs are allowed, and more.",
    "link": "https://www.overdriveonline.com/regulations/article/15817748/fmcsa-takes-action-on-a-dozen-burdensome-regulations",
    "timestamp": "2026-02-20T17:29:42Z"
  },
  {
    "title": "Supreme Court of the United States strikes down Trump tariffs — here’s which levies are affected",
    "description": "The nation's highest court has ruled against President Donald Trump's broad tariffs. The decision invalidates taxes imposed using an emergency powers law. Many other tariffs remain in place. Trump still has options to continue taxing imports aggressively. Thi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-of-the-united-states-strikes-down-trump-tariffs-heres-which-levies-are-affected/articleshow/128616683.cms",
    "timestamp": "2026-02-20T17:28:34Z"
  },
  {
    "title": "Trump responds to Supreme Court ruling rejecting sweeping tariffs powers: 'A disgrace'",
    "description": "President Donald Trump reportedly slammed the Supreme Court's ruling that he does not have the authority to impose tariffs under the IEEPA.",
    "link": "https://www.foxnews.com/politics/trump-responds-supreme-court-ruling-rejecting-sweeping-tariffs-powers-disgrace",
    "timestamp": "2026-02-20T17:28:17Z"
  },
  {
    "title": "U.S. Supreme Court shoots down President Trump’s tariffs — Consumer Technology Association hails 'victory for all Americans,' calls for swift refunds to retailers",
    "description": "The Supreme Court told the Trump administration that the term \"regulate\" in the IEEPA does not give White House authority to impose tariffs on imports.",
    "link": "https://www.tomshardware.com/tech-industry/u-s-supreme-court-shoots-down-president-trumps-tariffs-consumer-technology-association-hails-victory-for-all-americans-calls-for-swift-refunds-to-retailers",
    "timestamp": "2026-02-20T17:26:42Z"
  },
  {
    "title": "'Great news for spot rates'? Supreme Court rules against Trump emergency tariffs",
    "description": "The Supreme Court's Friday ruling against the tariffs sets up potential for a \"flood of goods out of bonded warehouses and foreign trade zones into the 'consumption channel'\" as soon as the next few days, according to one analyst. Details on the ruling here.",
    "link": "https://www.overdriveonline.com/business/article/15817765/great-news-for-spot-rates-supreme-court-rules-trumps-emergency-tariffs-unlawful",
    "timestamp": "2026-02-20T17:26:41Z"
  },
  {
    "title": "'A State-Sponsored Lynching, Funded by the US': Israeli Settlers Kill Palestinian-American in West Bank",
    "description": "Palestinian authorities and witnesses to an Israeli settler attack in the West Bank that killed a 19-year-old Palestinian-American this week said the young man, Nasrallah Abu Siyam, had been trying to stop settlers from attacking a farmer in the village of Mu…",
    "link": "https://www.commondreams.org/news/west-bank-settler",
    "timestamp": "2026-02-20T17:26:04Z"
  },
  {
    "title": "Supreme Court Tariff Ruling Resets Trade and Investment for Middle-Market Firms",
    "description": "For nearly a year, PYMNTS Intelligence has tracked the uncertainty confronting middle-market firms as tariffs, policy reversals and trade tensions disrupted forecasting, pricing and investment decisions. Policy debates evolved into an operational constraint, …",
    "link": "https://www.pymnts.com/legal/2026/supreme-court-tariff-ruling-resets-trade-investment-middle-market-firms/",
    "timestamp": "2026-02-20T17:25:25Z"
  },
  {
    "title": "How to Find Your Nearest No Kings Protest on March 28",
    "description": "On Saturday, March 28, the third round of No Kings will take place in cities and towns across the United States. The protest comes in response to the Trump administration’s recent crackdowns on immigration and Immigration and Customs Enforcement (ICE)’s syste…",
    "link": "https://msmagazine.com/2026/02/20/no-kings-protest-map/",
    "timestamp": "2026-02-20T17:22:05Z"
  },
  {
    "title": "Bitcoin Rises After Supreme Court Rules Against Trump Tariffs",
    "description": "Bitcoin ticked up after the Supreme Court ruled that President Trump exceeded his authority in imposing most tariffs on foreign goods.",
    "link": "https://decrypt.co/358761/bitcoin-rises-supreme-court-rules-against-trump-tariffs",
    "timestamp": "2026-02-20T17:20:49Z"
  },
  {
    "title": "Trump Gets Terrible News on Economic Growth as Humiliation Compounds",
    "description": "It’s been a terrible, horrible, no good, very bad morning for Donald Trump.At the start of Friday, a new gross domestic product report revealed that the economy had cooled in the last quarter of 2025, showing a general deceleration in growth due to large cuts…",
    "link": "https://newrepublic.com/post/206858/donald-trump-economic-growth-tariffs",
    "timestamp": "2026-02-20T17:19:19Z"
  },
  {
    "title": "EPA Dismantles Protections for Mercury and Air Toxics from Power Plants",
    "description": "Trump EPA move will allow coal and oil-fired power plants to emit more brain-damaging mercury, other harmful heavy metals, and dangerous soot.",
    "link": "https://www.edf.org/media/epa-dismantles-protections-mercury-and-air-toxics-power-plants",
    "timestamp": "2026-02-20T17:18:43Z"
  },
  {
    "title": "BREAKING: Trump Reportedly Rips Supreme Court Tariff Ruling as a 'Disgrace' – He Has Plan B",
    "description": "Trump addressed the ruling during a White House breakfast with governors, according to a report after the ruling was made public.",
    "link": "https://www.westernjournal.com/breaking-trump-reportedly-rips-supreme-court-tariff-ruling-disgrace-plan-b/",
    "timestamp": "2026-02-20T17:18:14Z"
  },
  {
    "title": "Olympian Eileen Gu Says She Feels Like a 'Punching Bag' Amid Fan Backlash Over Ditching Team USA for China",
    "description": "Olympic skier Eileen Gu is complaining that she feels like a \"punching bag\" for those criticizing her for turning her back on the USA.\nThe post Olympian Eileen Gu Says She Feels Like a ‘Punching Bag’ Amid Fan Backlash Over Ditching Team USA for China appeared…",
    "link": "https://www.breitbart.com/sports/2026/02/20/olympian-eileen-gu-says-she-feels-like-punching-bag-amid-fan-backlash-over-ditching-team-usa-china/",
    "timestamp": "2026-02-20T17:17:45Z"
  },
  {
    "title": "Turns Out There Was Voter Fraud in Georgia—by Elon Musk",
    "description": "If Donald Trump’s administration really wants to find evidence of foreign interference in Georgia’s elections, then they need look no further than the president’s old friend Elon Musk and his shady super PAC. Members of the Georgia State Elections Board voted…",
    "link": "https://newrepublic.com/post/206857/georgia-voter-fraud-elon-musk",
    "timestamp": "2026-02-20T17:17:35Z"
  },
  {
    "title": "White teens cleared of hate crime allegations levied by Black Virginia Tech professor",
    "description": "Professor Onwubiko Agozino complained to police that several juveniles targeted him in a racist attack, which was refuted by police in the town of Christiansburg, Virginia.",
    "link": "https://www.foxnews.com/us/white-teens-cleared-hate-crime-allegations-levied-black-virginia-tech-professor",
    "timestamp": "2026-02-20T17:16:57Z"
  },
  {
    "title": "Why Texas’ redistricting plan isn’t a sure bet",
    "description": "The new map is supposed to help Republicans pick up five Democratic-held seats.",
    "link": "https://www.bostonherald.com/2026/02/20/us-election-2026-texas-redistricting/",
    "timestamp": "2026-02-20T17:16:55Z"
  },
  {
    "title": "Meet the 'New Nostradamus' who predicted Queen Elizabeth's death and COVID-19: What does he have to say on Trump?",
    "description": "The 'New Nostradamus,' Craig Hamilton-Parker, predicts a turbulent 2026 for the US, with potential election crises and Donald Trump continuing in office due to global conflicts. He foresees Iran strikes, a US-Greenland mineral deal, a gas cloud over Japan, an…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/meet-the-new-nostradamus-who-predicted-queen-elizabeths-death-and-covid-19-what-does-he-have-to-say-on-trump/articleshow/128617912.cms",
    "timestamp": "2026-02-20T17:16:44Z"
  },
  {
    "title": "Trump's real Gaza plan: courting investors under diplomatic cover",
    "description": "At the board's inaugural session on Thursday, Trump announced that $7 billion had already been raised for Gaza's reconstruction. What followed were futuristic proposals that ranged from ambitious to fanciful, with no mention of Palestinian statehood",
    "link": "https://www.haaretz.com/gaza/2026-02-20/ty-article/.premium/trumps-real-gaza-plan-courting-investors-under-diplomatic-cover/0000019c-7b2c-d3d1-a7bd-fbbc8a170000",
    "timestamp": "2026-02-20T17:16:29Z"
  },
  {
    "title": "Virginia Democrats pass map that could flip 4 US House seats, if courts and voters approve",
    "description": "The new gerrymandered map aims to help the party in the national redistricting battle.",
    "link": "https://www.bostonherald.com/2026/02/20/virginia-redistricting-map/",
    "timestamp": "2026-02-20T17:16:15Z"
  },
  {
    "title": "ALAN WILSON: A Decade Of Trump Dominance In South Carolina",
    "description": "Ten years ago, South Carolina voters helped shape the trajectory of modern American politics. Our state did more than participate in a presidential primary.",
    "link": "https://dailycaller.com/2026/02/20/opinion-a-decade-of-trump-dominance-in-south-carolina-alan-wilson/",
    "timestamp": "2026-02-20T17:16:08Z"
  },
  {
    "title": "Bitcoin ignores US Supreme Court Trump tariff strike amid talk of $150B refund",
    "description": "Bitcoin stayed rangebound within a \"downward trajectory\" as the Supreme Court concluded that some US trade tariffs were illegal and liable for a refund.",
    "link": "https://cointelegraph.com/news/bitcoin-ignores-us-supreme-court-trump-tariff-strike-amid-talk-of-150b-refund",
    "timestamp": "2026-02-20T17:15:55Z"
  },
  {
    "title": "Olympian Hunter Hess bemoans ‘hardest weeks of his life’ after US criticism backlash",
    "description": "Hunter Hess is leaning into his criticisms of America and the \"loser\" tagline that President Donald Trump bestowed on him at the start of the Milan Cortina Games.",
    "link": "https://nypost.com/2026/02/20/sports/olympian-hunter-hess-bemoans-hardest-weeks-of-his-life-after-us-criticism-backlash/",
    "timestamp": "2026-02-20T17:15:23Z"
  },
  {
    "title": "Supreme Court tariff case winner Learning Resources 'on the right side of history,' CEO says",
    "description": "Learning Resources CEO Rick Woldenberg said the Supreme Court ruling against President Trump's tariffs could inject \"a lot of money\" into the U.S. economy.",
    "link": "https://www.cnbc.com/2026/02/20/supreme-court-tariff-trade-trump-learning-resources.html",
    "timestamp": "2026-02-20T17:15:22Z"
  },
  {
    "title": "Trump Administration Restores Philadelphia Slavery Exhibition After Court Order",
    "description": "Federal workers are restoring an exhibit on the people once enslaved by President George Washington in Philadelphia despite an ongoing legal fight between the city and the Trump administration. Mayor Cherelle Parker visited the site Thursday morning to thank …",
    "link": "https://apnews.com/article/slavery-exhibit-philadelphia-trump-b6fca070516f1e18668b6085bd8fcad7",
    "timestamp": "2026-02-20T17:15:00Z"
  },
  {
    "title": "About half of Trump's tariffs are now null and void - but his trade war is not over",
    "description": "The administration may have to refund part, or perhaps even all, of the money paid under tariffs so far following the Supreme Court decision, Sky's Ed Conway says.",
    "link": "https://news.sky.com/story/about-half-of-trumps-tariffs-are-now-null-and-void-but-his-trade-war-is-not-over-13510088",
    "timestamp": "2026-02-20T17:14:00Z"
  },
  {
    "title": "1st LD: U.S. Supreme Court rules Trump administration's sweeping tariffs illegal",
    "description": "NEW YORK, Feb. 20 (Xinhua) -- The U.S. Supreme Court ruled on Friday that U.S. President Donald Trump's sweeping tariffs under a law meant for use in national emergencies are illegal. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/1st-ld-us-supreme-court-rules-trump-administration039s-sweeping-tariffs-illegal",
    "timestamp": "2026-02-20T17:14:00Z"
  }
]