[
  {
    "title": "News Summary-Intelligence Report 4/18/2025*Newsdump Friday*Deportations To El Salvador Prison Rumored*Firing Of Fed Chair Considered*RFK Assassination Docs Released*Rubio Speaks Of \"Moving On\" From Ukraine*Pre Iran Talks News Leak Stories*",
    "description": "Federal District Judge James Boasberg holding an emergency hearing this evening...Attorneys for the American Civil Liberties Union also asking for Supreme Court... Meanwhile a panel of the federal appeals court in Washington DC putting a hold on an earlier co…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311921/posts",
    "timestamp": "2025-04-19T03:46:53Z"
  },
  {
    "title": "Trump brags gas is down to $1.98 a gallon in a ‘couple of states.’ It isn’t — anywhere",
    "description": "President Donald Trump bragged this week that gas is down to $1.98 a gallon in a “couple of states.”\nIn fact it isn’t, anywhere.\n“No state had an average gas price even close to $1.98 per gallon [as of} Wednesday,” CNN’s Chief White House Correspondent Kaitla…",
    "link": "https://biztoc.com/x/cae79daf97d121e0",
    "timestamp": "2025-04-19T03:45:22Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets are cautiously optimistic amidst tariff concerns, awaiting China's economic response and assessing corporate resilience. The IMF and World Bank meetings in Washington highlight worries about U.S. isolationism. China is expected to ease monetary…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/120422858.cms",
    "timestamp": "2025-04-19T03:40:57Z"
  },
  {
    "title": "ACLU Demands SCOTUS Block Next Round of Deportations to El Salvador",
    "description": "The Trump administration is preparing to deport a new group of Venezuelan men detained in Texas, said the ACLU in an emergency Friday court filing.",
    "link": "http://www.rollingstone.com/politics/politics-news/aclu-scotus-block-alien-enemies-trump-deportations-1235321239/",
    "timestamp": "2025-04-19T03:40:25Z"
  },
  {
    "title": "Teen Warned of 'Decades Behind Bars' After Tesla Arson Charge",
    "description": "Attorney General Pam Bondi has called the attacks to Tesla property and vehicles \"domestic terrorism.\"",
    "link": "https://www.newsweek.com/teen-warned-decades-behind-bars-after-tesla-arson-charge-2061675",
    "timestamp": "2025-04-19T03:39:22Z"
  },
  {
    "title": "Bill Maher Jokes Trump Is Celebrating Easter ‘by Locking Up Guys Named Jesus’ | Video",
    "description": "The \"Real Time\" host also quips Elon Musk considers Jesus' death and resurrection \"an elaborate scheme to defraud Social Security\"\nThe post Bill Maher Jokes Trump Is Celebrating Easter ‘by Locking Up Guys Named Jesus’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-maher-donald-trump-easter-monologue-hbo-real-time/",
    "timestamp": "2025-04-19T03:39:21Z"
  },
  {
    "title": "Wall Street Week Ahead: Busy US earnings week confronts market grappling with tariff fallout",
    "description": "U.S. stock market faces a crucial week as major companies report earnings amid trade policy uncertainties sparked by President Trump's tariffs. Investors are on edge, with recession odds rising and volatility remaining high.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-busy-us-earnings-week-confronts-market-grappling-with-tariff-fallout/articleshow/120422827.cms",
    "timestamp": "2025-04-19T03:38:05Z"
  },
  {
    "title": "'Unauthorized': Trump admin says Harvard demand letter was mistakenly sent",
    "description": "The sweeping set of demands President Donald Trump’s administration insisted Harvard University comply with last Friday was sent to the elite institution by mistake and should never have hit their inbox, according to the New York Times.But by the time Harvard…",
    "link": "https://www.rawstory.com/trump-harvard-2671803666/",
    "timestamp": "2025-04-19T03:36:03Z"
  },
  {
    "title": "Trump studying whether to fire Fed Chair Powell, adviser says",
    "description": "White House economic advisor Kevin Hassett indicated that President Trump is still considering firing Federal Reserve Chair Jerome Powell, despite concerns about the central bank's independence and market stability. Trump has repeatedly criticized Powell for …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-studying-whether-to-fire-fed-chair-powell-adviser-says/articleshow/120422802.cms",
    "timestamp": "2025-04-19T03:35:15Z"
  },
  {
    "title": "Iran says nuclear deal is possible if Washington is realistic",
    "description": "The foreign minister's assertion came on the eve of a second round of talks with the administration of U.S. President Donald Trump.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/politics/iran-us-nuclear-deal/",
    "timestamp": "2025-04-19T03:34:00Z"
  },
  {
    "title": "Iran, US To Hold Second Round Of High-stakes Nuclear Talks In Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran's nuclear programme, a week after an initial round of discussions that both sides described as \"constructive\".",
    "link": "https://www.ibtimes.com/iran-us-hold-second-round-high-stakes-nuclear-talks-rome-3770640",
    "timestamp": "2025-04-19T03:30:22Z"
  },
  {
    "title": "ETMarkets Smart Talk: FY26 may test equities, but offers a window for bargain hunters, says Jitendra Gohil",
    "description": "While he cautions that equities may face pressure and deliver subpar returns in the near term, he believes the current environment presents a rare window for bargain hunters to accumulate high-quality stocks at reasonable valuations.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-fy26-may-test-equities-but-offers-a-window-for-bargain-hunters-says-jitendra-gohil/articleshow/120409684.cms",
    "timestamp": "2025-04-19T03:30:00Z"
  },
  {
    "title": "Iran, US to hold second round of high-stakes nuclear talks in Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran’s nuclear programme, a week after an initial round of discussions that both sides described as “constructive”. Iranian Foreign Minister Abbas Araghchi and US Middle East envoy S…",
    "link": "https://www.digitaljournal.com/world/iran-us-to-hold-second-round-of-high-stakes-nuclear-talks-in-rome/article",
    "timestamp": "2025-04-19T03:27:20Z"
  },
  {
    "title": "Tariff-linked volatility eases, but risk still high",
    "description": "Global stocks have faced unusual turbulence in the past three weeks since US President Donald Trump announced higher-than-expected reciprocal tariffs against dozens of countries.",
    "link": "https://www.bangkokpost.com/business/investment/3006246/tariff-linked-volatility-eases-but-risk-still-high",
    "timestamp": "2025-04-19T03:27:00Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Washington wants Iran to halt production of highly enriched uranium, which it believes is aimed at building an atomic bomb.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-850659",
    "timestamp": "2025-04-19T03:21:10Z"
  },
  {
    "title": "How AI is aiding Trump's immigration crackdown",
    "description": "The practice is raising fears that risks to accuracy and privacy could put almost anyone in danger of getting caught up in the crackdown.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/science-health/ai-trump-immigration-crackdown/",
    "timestamp": "2025-04-19T03:13:00Z"
  },
  {
    "title": "Single Deadliest Yemen Strike Of Trump Presidency Destroys Vital Oil Port",
    "description": "Single Deadliest Yemen Strike Of Trump Presidency Destroys Vital Oil Port\n \nFresh US airstrikes on Yemen Thursday marked the single-deadliest known attack under President Donald Trump's new campaign targeting the Houthi rebels. The Pentagon has been intensely…",
    "link": "https://biztoc.com/x/8a790b1091dbd3d9",
    "timestamp": "2025-04-19T03:12:15Z"
  },
  {
    "title": "Trump to fast-track permitting for 10 mining projects across US",
    "description": "Trump to fast-track permitting for 10 mining projects across US\nThe White House on Friday said it will fast-track permitting for 10 mining projects across the United States as part of President Donald Trump’s push to expand critical minerals production.\nThe p…",
    "link": "https://biztoc.com/x/be3828cb3bfac359",
    "timestamp": "2025-04-19T03:12:13Z"
  },
  {
    "title": "US bond markets: Why everyone is watching them closely",
    "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
    "link": "https://www.bbc.co.uk/news/articles/cvg838qq7zqo",
    "timestamp": "2025-04-19T03:12:13Z"
  },
  {
    "title": "Trump's Top Economic Adviser Kevin Hassett Says White House Is Exploring Options To Fire Fed Chair Jerome Powell: 'The President And His Team Will Continue To Study'",
    "description": "On Friday, White House National Economic Council chair Kevin Hassett said the Donald Trump administration is exploring ways to remove Federal Reserve Chairman Jerome Powell.\nWhat Happened: Hassett told reporters at the White House that the “President and his …",
    "link": "https://biztoc.com/x/039cc4653cc96c24",
    "timestamp": "2025-04-19T03:12:01Z"
  },
  {
    "title": "Trump scraps federal COVID-19 website for virus lab-leak theory",
    "description": "The White House replaced the federal government’s hub for news and updates on COVID-19 with a website saying the virus leaked out of a Chinese lab.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/18/trump-covid-lab-leak-website/83167873007/",
    "timestamp": "2025-04-19T03:11:48Z"
  },
  {
    "title": "한국 대선, 지지율 금쪽이 누구?",
    "description": "President Donald Trump said Friday he was pushing through a massive overhaul of the civil service system, posting new rules for moving thousands of positions formerly reserved for career federal employees into the ranks of political positions. https://t.co/gV…",
    "link": "https://ryueyes11.tistory.com/511572",
    "timestamp": "2025-04-19T03:09:06Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Iran and the United States are set to resume nuclear talks in Rome, mediated by Oman, aiming to resolve their long-standing dispute over Tehran's nuclear ambitions. These indirect negotiations follow a previous round in Muscat, amid Trump's renewed threats of…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-us-to-hold-talks-in-rome-in-bid-to-reach-nuclear-deal/articleshow/120422460.cms",
    "timestamp": "2025-04-19T03:06:03Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "DUBAI (Reuters) - Iran and the United States will hold a new round of nuclear talks in Rome on Saturday to resolve their decades-long standoff over Tehran's atomic aims, under the shadow of President Donald Trump's threat to unleash military action if diploma…",
    "link": "https://www.thestar.com.my/news/world/2025/04/19/iran-us-to-hold-talks-in-rome-in-bid-to-reach-nuclear-deal",
    "timestamp": "2025-04-19T03:06:00Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Iran and the United States will hold a new round of nuclear talks in Rome on Saturday to resolve their decades-long standoff over Tehran's atomic aims, under...",
    "link": "https://ca.news.yahoo.com/iran-us-hold-talks-rome-030431316.html",
    "timestamp": "2025-04-19T03:04:31Z"
  },
  {
    "title": "War Diary: Trump's 'Midas touch' delusions will fail to solve the Gaza crisis",
    "description": "Benjamin Netanyahu can praise President Donald Trump for his “creative and innovative idea” for Gaza, but the prime minister must also recognize the plan is absurd and dead on arrival.",
    "link": "https://www.jpost.com/opinion/article-850221",
    "timestamp": "2025-04-19T03:00:37Z"
  },
  {
    "title": "David Hogg: The Time for James Carville's 'Timid' Politics Is Over",
    "description": "Democratic National Committee Vice Chair David Hogg said Friday on CNN's \"The Lead\" that Democratic strategist James Carville believed in \"timid\" politics.\nThe post David Hogg: The Time for James Carville’s ‘Timid’ Politics Is Over appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/04/18/david-hogg-the-time-for-james-carvilles-timid-politics-is-over/",
    "timestamp": "2025-04-19T02:55:06Z"
  },
  {
    "title": "Elie Honig Stunned When White House Admits It Sent Menacing Letter to Harvard by Mistake – But Blamed Harvard Anyway: ‘I Mean…’",
    "description": "\"I think that statement actually just sort of gives away the whole game.\"\nThe post Elie Honig Stunned When White House Admits It Sent Menacing Letter to Harvard by Mistake – But Blamed Harvard Anyway: ‘I Mean…’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/elie-honig-stunned-when-white-house-admits-it-sent-menacing-letter-to-harvard-by-mistake-but-blamed-harvard-anyway-i-mean/",
    "timestamp": "2025-04-19T02:50:25Z"
  },
  {
    "title": "Iran and the US prepare for a second round of negotiations over Tehran's nuclear program in Rome",
    "description": "Iran and the United States are preparing for a second round of negotiations over Tehran’s rapidly advancing nuclear program in Rome",
    "link": "https://abcnews.go.com/US/wireStory/iran-us-prepare-round-negotiations-tehrans-nuclear-program-120968257",
    "timestamp": "2025-04-19T02:46:28Z"
  },
  {
    "title": "Marco Rubio sits with Michael Benz, Jewish former Trump official with antisemitic online persona",
    "description": "Speaking to Rubio on Wednesday in a talk released by the State Department, Benz quizzed him on how the department would be changing its approach to free-speech issues under Trump.",
    "link": "https://www.jpost.com/american-politics/article-850655",
    "timestamp": "2025-04-19T02:45:45Z"
  },
  {
    "title": "Stocks make small gains amid trade talk hope",
    "description": "RECAP:  Asian stocks notched small gains in thin trade on Friday as investors largely adopted a wait-and-see approach on tariff negotiations before making long-term bets. Some markets were closed for the Good Friday holiday.",
    "link": "https://www.bangkokpost.com/business/investment/3006291/stocks-make-small-gains-amid-trade-talk-hope",
    "timestamp": "2025-04-19T02:43:00Z"
  },
  {
    "title": "EM assets set for best week since March as China concerns abate",
    "description": "With most markets closed for Easter, the MSCI emerging markets index rose on Friday, taking its weekly advance to 2.2%. Currencies of commodity-linked countries including South Africa outperformed this week, sending the benchmark near a six-month high.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/em-assets-set-for-best-week-since-march-as-china-concerns-abate/articleshow/120422314.cms",
    "timestamp": "2025-04-19T02:40:22Z"
  },
  {
    "title": "Japan tariff negotiator rules out quick U.S. deal despite push by Trump",
    "description": "Ryosei Akazawa said that while the U.S. president wants to speed up negotiations, any agreement would likely take some time.",
    "link": "https://www.japantimes.co.jp/business/2025/04/19/economy/us-japan-tariffs-no-quick-deal/",
    "timestamp": "2025-04-19T02:36:00Z"
  },
  {
    "title": "Once-hot Wall Street funds unravel fast with no one to save",
    "description": "In the grip of the tariff fallout, 90 of the top 100 best-performing exchange-traded funds of last year are down in 2025, with an average loss of 13%, according to Bloomberg Intelligence. At the same time, dormant trades of all sorts have staged a comeback: N…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/once-hot-wall-street-funds-unravel-fast-with-no-one-to-save/articleshow/120422278.cms",
    "timestamp": "2025-04-19T02:34:35Z"
  },
  {
    "title": "Doug Casey on Trump’s Tariffs and the Coming Economic Fallout",
    "description": "International Man: President Trump recently imposed sweeping tariffs on much of the world, dubbing it Liberation Day. Trump declared: “It will forever be remembered as the day American industry was reborn, the day America’s destiny was reclaimed, and the day …",
    "link": "https://www.activistpost.com/doug-casey-on-trumps-tariffs-and-the-coming-economic-fallout/",
    "timestamp": "2025-04-19T02:33:00Z"
  },
  {
    "title": "នាយកប្រតិបត្តិ Apple និយាយជាមួយមន្ត្រីពាណិជ្ជកម្មអាមេរិក ជុំវិញផលប៉ះពាល់ពន្ធលើតម្លៃ iPhone",
    "description": "នាយកប្រតិបត្តិ Apple និយាយជាមួយមន្ត្រីពាណិជ្ជកម្មអាមេរិក ជុំវិញផលប៉ះពាល់ពន្ធលើតម្លៃ iPhonefreshnewsasia.com",
    "link": "https://freshnewsasia.com/index.php/en/business/384551-2025-04-19-02-24-31.html",
    "timestamp": "2025-04-19T02:31:30Z"
  },
  {
    "title": "Judge Blocks Trump Administration from Deporting to 3rd Countries Without Due Process",
    "description": "A federal judge blocked the Trump administration from deporting illegal migrants to their non-origin country without due process.\nThe post Judge Blocks Trump Administration from Deporting to 3rd Countries Without Due Process appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/18/judge-blocks-trump-administration-deporting-3rd-countries-due-process/",
    "timestamp": "2025-04-19T02:26:27Z"
  },
  {
    "title": "Trump administration scrap COVID-19 sites in favour of lab leak theory",
    "description": "The Trump administration has relaunched COVID-19 health websites, blaming  the origins of the coronavirus on a lab leak in China and criticising former president Joe Biden.",
    "link": "https://www.abc.net.au/news/2025-04-19/donald-trump-launches-covid-19-lab-leak-theory-site/105193140",
    "timestamp": "2025-04-19T02:19:05Z"
  },
  {
    "title": "WOW. Fake news MSNBC cut away from President Trump right as he started reading FACTS about deported MS-13 gang member Kilmar Abrego Garcia.",
    "description": "Here is the rest of President Trump’s statement on the deported MS-13 gang member that fake news MSNBC CUT AWAY FROM. They don’t want you to hear the TRUTH.",
    "link": "https://freerepublic.com/focus/f-news/4311915/posts",
    "timestamp": "2025-04-19T02:15:08Z"
  },
  {
    "title": "Trump White House Lashes Out At Senator Who Visited Wrongly Deported Man In El Salvador (Sara Boboltz/HuffPost)",
    "description": "Sara Boboltz / HuffPost:\nTrump White House Lashes Out At Senator Who Visited Wrongly Deported Man In El Salvador  —  “GRANDSTANDER!!!” the president wrote on social media.  He later smeared the Maryland immigrant's character, as well.  —  President Donald Tru…",
    "link": "https://www.memeorandum.com/250418/p140",
    "timestamp": "2025-04-19T02:10:02Z"
  },
  {
    "title": "Trump officials blame 'mistake' for setting off confrontation with Harvard University: Report",
    "description": "Harvard University received a letter containing demands related to hiring, admissions, and curriculum from an official in former President Trump's antisemitism task force, triggering a legal dispute. The letter, sent by Sean Keveney, led Harvard to believe re…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-officials-say-letter-to-harvard-university-sent-by-mistake-report/articleshow/120422006.cms",
    "timestamp": "2025-04-19T02:07:59Z"
  },
  {
    "title": "'Needed to get him alone': Trump advisers urged tariff pause with 'hovering' Navarro away",
    "description": "President Donald Trump's major economic cabinet officials, Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick, were only able to persuade him to temporarily reduce the burden of his \"Liberation Day\" tariffs because they spoke to him while …",
    "link": "https://www.rawstory.com/trump-peter-navarro/",
    "timestamp": "2025-04-19T02:05:01Z"
  },
  {
    "title": "Trump passport policy discriminates against transgender people, judge rules",
    "description": "A federal judge in Boston has ruled that the Trump administration's policy on passports for transgender and nonbinary Americans is likely unconstitutional, citing discrimination and animus. Judge Julia Kobick issued a preliminary injunction, blocking the poli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-passport-policy-discriminates-against-transgender-people-judge-rules/articleshow/120421997.cms",
    "timestamp": "2025-04-19T02:01:49Z"
  },
  {
    "title": "Guess Where Trump Got His 'Faith'",
    "description": "Donald Trump’s lapdog in the State Department made a call to action earlier this week, asking employees there to report anyone who seemed to give off any “anti-Christian” vibes in the workplace. \nAnd while Secretary of State Marco Rubio is sniffing out those …",
    "link": "https://crooksandliars.com/2025/04/guess-where-trump-got-his-faith",
    "timestamp": "2025-04-19T02:00:02Z"
  },
  {
    "title": "World’s cartoonists on this week’s events",
    "description": "Drawing the top stories around the globe.",
    "link": "https://www.politico.eu/article/worlds-cartoonists-on-this-weeks-events-152/",
    "timestamp": "2025-04-19T02:00:00Z"
  },
  {
    "title": "US Releases 10,000 Pages Of Records On Robert F Kennedy's Assassination",
    "description": "Robert F Kennedy was fatally shot on June 5, 1968, at the Ambassador Hotel in Los Angeles moments after giving a speech celebrating his victory in California&#039;s presidential primary.",
    "link": "https://www.ndtv.com/world-news/us-releases-10-000-pages-of-records-on-robert-f-kennedys-assassination-on-donald-trumps-order-tulsi-gabbard-8200448",
    "timestamp": "2025-04-19T01:56:18Z"
  },
  {
    "title": "Italy agrees with US to oppose 'discriminatory' tech taxes",
    "description": "European levies aimed at hitting dominant U.S. tech giants such as Alphabet's Google, Meta's Facebook , Apple and Amazon have been a longstanding irritant for U.S. administrations, including Trump's. Italy applies a 3% levy on revenue from internet transactio…",
    "link": "https://economictimes.indiatimes.com/tech/technology/italy-agrees-with-us-to-oppose-discriminatory-tech-taxes/articleshow/120421952.cms",
    "timestamp": "2025-04-19T01:53:32Z"
  },
  {
    "title": "Arizona governor vetoes bill requiring local officials to help with federal immigration efforts",
    "description": "Democratic Gov. Katie Hobbs has vetoed a Republican-backed bill intended to support the Trump administration’s immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/arizona-governor-vetoes-bill-requiring-local-officials-federal-120967320",
    "timestamp": "2025-04-19T01:50:39Z"
  },
  {
    "title": "Franklin Graham shares hope message in exclusive interview on Easter special: 'God hasn’t forgotten them'",
    "description": "Rev. Franklin Graham shared an inside look into Easter from the Ashes with Fox News Digital, sharing stories of survival, loss and faith — pointing to the hope found in Jesus Christ.",
    "link": "https://www.foxnews.com/lifestyle/franklin-graham-shares-hope-message-exclusive-interview-easter-special",
    "timestamp": "2025-04-19T01:46:02Z"
  },
  {
    "title": "Who’s out, who’s in … front of the bus?",
    "description": "On topic – stay on it. Out: Acting head of IRS Gary Shapley, installed by President Musk three days ago. Donald Trump is replacing the acting commissioner of the US Internal Revenue Service after treasury secretary Scott Bessent reportedly complained to the p…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/whos-out-whos-in-front-of-the-bus",
    "timestamp": "2025-04-19T01:45:00Z"
  },
  {
    "title": "'Malicious compliance': Conservative WSJ editors rip Trump over deportation case",
    "description": "President Donald Trump is setting the country on a dangerous track in his repeated refusals to admit that the Maryland man his administration mistakenly sent to El Salvador is owed due process in the United States, according to the Wall Street Journal’s conse…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2671803360/",
    "timestamp": "2025-04-19T01:43:02Z"
  },
  {
    "title": "WATCH: WH Deputy Chief of Staff Stephen Miller Tells TGP Sanctuary State Leaders Are Engaged in “Systemic Criminal Violations” Calls for Justice for Felony Offense of Harboring Illegals and Obstructing Justice",
    "description": "In a striking response, White House Deputy Chief of Staff Stephen Miller addresses the legal implications of sanctuary cities, emphasizing systemic violations and the urgent need for accountability. His remarks reveal a pivotal moment in the immigration debat…",
    "link": "https://www.thegatewaypundit.com/2025/04/watch-wh-deputy-chief-staff-stephen-miller-tells/",
    "timestamp": "2025-04-19T01:40:19Z"
  },
  {
    "title": "Tropical drinks by the pool? Not so fast, says senator who visited Abrego Garcia in El Salvador",
    "description": "There was the pool furniture in the background",
    "link": "https://abcnews.go.com/US/wireStory/tropical-drinks-pool-fast-senator-visited-abrego-garcia-120963577",
    "timestamp": "2025-04-19T01:34:28Z"
  },
  {
    "title": "Cardano Price Surge To $1.7: Here Are The Factors To Drive The Recovery",
    "description": "The Cardano price may be preparing for a powerful rally toward $1.7, as new indicators suggest a potential recovery. A leading crypto analyst has identified multiple bullish catalysts that could drive ADA’s momentum and help propel the cryptocurrency to this …",
    "link": "http://www.newsbtc.com/news/cardano/cardano-price-surge-to-1-7/",
    "timestamp": "2025-04-19T01:34:09Z"
  },
  {
    "title": "Judge Boasberg Doesn't Think He Has the 'Power' to Block Trump Deportations",
    "description": "Boasberg said that while he was \"sympathetic,\" he doesn't believe he has the authority to block more deportations under the Alien Enemies Act.",
    "link": "https://www.newsweek.com/judge-boasberg-lacks-power-trump-deportations-ruling-2061668",
    "timestamp": "2025-04-19T01:31:49Z"
  },
  {
    "title": "Dr. Oz's swearing-in ceremony abruptly ends as his granddaughter faints",
    "description": "Dr. Mehmet Oz's swearing-in ceremony at the White House ended abruptly when his granddaughter fainted during President Trump's remarks, leading officials to clear the Oval Office: 'Everybody out!'",
    "link": "https://ew.com/dr-oz-swearing-in-ceremony-abruptly-ends-as-his-granddaughter-faints-11718389",
    "timestamp": "2025-04-19T01:30:32Z"
  },
  {
    "title": "Tufts student challenging immigration arrest must be moved to Vermont, US judge rules",
    "description": "A federal judge ordered President Donald Trump's administration on Friday to transfer a Tufts University student being held in Louisiana to Vermont while he weighs her claims that U.S. immigration authorities unlawfully arrested her based on her pro-Palestini…",
    "link": "https://japantoday.com/category/world/tufts-student-challenging-immigration-arrest-must-be-moved-to-vermont-us-judge-rules",
    "timestamp": "2025-04-19T01:30:12Z"
  },
  {
    "title": "IRS contractor leaked tax details of more than 405K Americans — but it wasn't during Biden's presidency",
    "description": "Former U.S. President Joe Biden’s Internal Revenue Service (IRS) leaked the taxpayer data of more than 405,000 Americans.",
    "link": "https://www.snopes.com//fact-check/irs-contractor-tax-leak/",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "Thousands of files on Robert F Kennedy assassination released by Donald Trump administration",
    "description": "About 10,000 pages of records related to the 1968 assassination of Robert F Kennedy were released yesterday, including a handwritten note by the gunman that said the Democrat senator “must be disposed of”.",
    "link": "https://www.independent.ie/world-news/north-america/thousands-of-files-on-robert-f-kennedy-assassination-released-by-donald-trump-administration/a1816662102.html",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "US launches over a dozen airstrikes on key oil port in Yemen, killing at least 74",
    "description": "The US attacked a key Yemen oil port controlled by the Houthis overnight and killed dozens of people, according to the Iran-backed militants, raising the spectre of a widening conflict in the Middle East.",
    "link": "https://www.independent.ie/world-news/middle-east/us-launches-over-a-dozen-airstrikes-on-key-oil-port-in-yemen-killing-at-least-74/a1070941400.html",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "Dollar’s sharp decline signals tide going out on its global dominance",
    "description": "Among the threats tariffs pose to the US economy, none may be as strange as the sell-off in the dollar.",
    "link": "https://www.independent.ie/business/world/dollars-sharp-decline-signals-tide-going-out-on-its-global-dominance/a384137933.html",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "Iran ‘wants watertight guarantees’ Donald Trump will not ditch any new agreement on its nuclear programme again",
    "description": "Iran told the United States in talks last week it was ready to accept some limits on its uranium enrichment but needed watertight guarantees that US ­president Donald Trump would not ditch a nuclear pact again, a senior Iranian official said yesterday.",
    "link": "https://www.independent.ie/world-news/north-america/iran-wants-watertight-guarantees-donald-trump-will-not-ditch-any-new-agreement-on-its-nuclear-programme-again/a1907245320.html",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "‘We’re just going to take a pass’ – US ‘will walk away’ if there’s no progress in Ukraine talks, warns Trump",
    "description": "The United States will walk away from efforts to broker a Russia-Ukraine peace deal unless there are clear signs of progress soon, US President Donald Trump and Secretary of State Marco Rubio said yesterday.",
    "link": "https://www.independent.ie/world-news/europe/were-just-going-to-take-a-pass-us-will-walk-away-if-theres-no-progress-in-ukraine-talks-warns-trump/a1539111312.html",
    "timestamp": "2025-04-19T01:30:00Z"
  },
  {
    "title": "Trump goes to war with the US Federal Reserve",
    "description": "President Trump has openly clashed with Federal Reserve Chair Jerome Powell over interest rate policy, even threatening to remove him. This unprecedented pressure on the Fed's independence raises concerns about potential destabilization of US financial market…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-goes-to-war-with-the-us-federal-reserve/articleshow/120421801.cms",
    "timestamp": "2025-04-19T01:26:36Z"
  },
  {
    "title": "Plan For Expanded Muslim Community Triggers Hope, Fear In Texas",
    "description": "Threats to Muslims living in Texas are nothing new, but lately the vile phone calls to Imran Chaudhary have ramped up.",
    "link": "https://www.ibtimes.com/plan-expanded-muslim-community-triggers-hope-fear-texas-3770636",
    "timestamp": "2025-04-19T01:21:07Z"
  },
  {
    "title": "Katy Perry gets ready for sci-fi inspired world tour days after controversial trip to space",
    "description": "Her global Lifetimes Tour will kick off in Mexico City, Mexico on Apr 23.",
    "link": "https://cnalifestyle.channelnewsasia.com/cna-lifestyle/katy-perry-sci-fi-tour-463456",
    "timestamp": "2025-04-19T01:19:39Z"
  },
  {
    "title": "Trump says US \"going to take a pass\" on Ukraine peace talks if parties make it difficult",
    "description": "President Trump indicated the US might withdraw from mediating peace between Russia and Ukraine if either side proves too difficult. He expressed cautious optimism about securing a deal, stating it's \"coming to a head right now.\" Secretary of State Marco Rubi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-going-to-take-a-pass-on-ukraine-peace-talks-if-parties-make-it-difficult/articleshow/120421619.cms",
    "timestamp": "2025-04-19T01:18:59Z"
  },
  {
    "title": "Plan for expanded Muslim community triggers hope, fear in Texas",
    "description": "Threats to Muslims living in Texas are nothing new, but lately the vile phone calls to Imran Chaudhary have ramped up. The cause? Chaudhary’s early plans for construction of 1,000 new homes, a community center, school, hospital and — controversially — a mosqu…",
    "link": "https://www.digitaljournal.com/world/plan-for-expanded-muslim-community-triggers-hope-fear-in-texas/article",
    "timestamp": "2025-04-19T01:18:18Z"
  },
  {
    "title": "Dem Rep. Casten on Polls Showing Support for More Deportations: I Don't See That 'Level of Xenophobia'",
    "description": "On Friday’s broadcast of CNN’s “The Lead,” Rep. Sean Casten (D-IL) responded to polling data showing support for President Donald Trump’s immigration policies and more deportations by saying that “I do not hear that same level of xenophobia that we\nThe post D…",
    "link": "https://www.breitbart.com/clips/2025/04/18/dem-rep-casten-on-polls-showing-support-for-more-deportations-i-dont-see-that-level-of-xenophobia/",
    "timestamp": "2025-04-19T01:16:37Z"
  },
  {
    "title": "Tesla to delay US launch of affordable EV, a lower-cost Model Y, reports",
    "description": "Tesla's plan to launch a more affordable Model Y, internally named E41, faces delays in its U.S. production, now expected to begin months later than initially planned, potentially in the third quarter or early next year. The company aims to produce 250,000 un…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tesla-to-delay-us-launch-of-affordable-ev-a-lower-cost-model-y-reports/articleshow/120421542.cms",
    "timestamp": "2025-04-19T01:15:43Z"
  },
  {
    "title": "Some nice photos of President Trump meeting with Prime Minister Giorgia Meloni of Italy",
    "description": "\"President Donald Trump holds a bilateral lunch and meeting with Prime Minister Giorgia Meloni of Italy, Thursday, April 17, 2025, in the Oval Office\"",
    "link": "https://freerepublic.com/focus/f-chat/4311911/posts",
    "timestamp": "2025-04-19T01:13:14Z"
  },
  {
    "title": "Trump to reclassify many federal workers, making them easier to fire",
    "description": "Donald Trump is planning to reclassify tens of thousands of federal workers, potentially stripping them of job protections and making mass layoffs easier. This move, echoing a previous executive order, aims to make the government more business-like, according…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-reclassify-many-federal-workers-making-them-easier-to-fire/articleshow/120421491.cms",
    "timestamp": "2025-04-19T01:13:06Z"
  },
  {
    "title": "\"Yemen Won't Back Down\": Houthis Vow More Attacks After US Strikes Kill 74",
    "description": "Yemen&#039;s Houthis rebels have vowed to continue their military operations against Israel and the United States following deadly airstrikes on the Ras Isa oil port that killed at least 74 people, CNN reported.",
    "link": "https://www.ndtv.com/world-news/yemens-houthis-vow-more-attacks-after-us-strikes-kill-74-8200309",
    "timestamp": "2025-04-19T01:12:00Z"
  },
  {
    "title": "Supreme Court temporarily pauses deportations under Alien Enemies Act | CNN Politics",
    "description": "The Supreme Court early Saturday morning paused the deportation of immigrants potentially subject to the Alien Enemies Act, freezing action in a fast-developing case involving a group of immigrants in Texas who say the Trump administration was working to remo…",
    "link": "https://www.cnn.com/2025/04/18/politics/boasberg-deportation-flights-alien-enemies-act/index.html",
    "timestamp": "2025-04-19T01:11:48Z"
  },
  {
    "title": "'Show compassion': Faith leaders beg Trump to stop his Easter purge of Christian refugees",
    "description": "Faith leaders are imploring President Donald Trump to reconsider as his administration moves to order the \"self-deportation\" of Afghan Christians who fled to the United States to escape the Taliban, Fox News reported on Friday evening — particularly because t…",
    "link": "https://www.rawstory.com/trump-afghan-christians/",
    "timestamp": "2025-04-19T01:11:46Z"
  },
  {
    "title": "Trump Posts Photo of Illegal Alien's Knuckle Tattoos Amid MS-13 Charges",
    "description": "President Donald Trump shared a photo of the tattoos on the knuckles of illegal alien Kilmar Abrego Garcia, an accused MS-13 gang member, wife beater, and human trafficker amid Democrats' complaining about the man's deportation to his native El Salvador. \"I w…",
    "link": "https://www.breitbart.com/politics/2025/04/18/trump-posts-photo-of-illegal-aliens-knuckle-tattoos-amid-ms-13-charges/",
    "timestamp": "2025-04-19T01:09:52Z"
  },
  {
    "title": "White House brags about Donald Trump meeting with Vince Vaughn",
    "description": "From 'Wedding Crashers' to 'White House Crashers': Vince Vaughn posed for a photo op with President Trump in the Oval Office.",
    "link": "https://ew.com/white-house-brags-about-donald-trump-meeting-vince-vaughn-11718325",
    "timestamp": "2025-04-19T01:06:59Z"
  },
  {
    "title": "Why everyone is suddenly so interested in US bond markets",
    "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
    "link": "https://www.bbc.com/news/articles/cvg838qq7zqo",
    "timestamp": "2025-04-19T01:06:12Z"
  },
  {
    "title": "Judge orders Trump administration to tell fired workers they were not let go for poor performance",
    "description": "A U.S. district judge in California has ordered the Trump administration to provide probationary workers fired en masse a written statement saying they were not terminated for poor performance",
    "link": "https://abcnews.go.com/US/wireStory/judge-orders-trump-administration-fired-workers-poor-performance-120965773",
    "timestamp": "2025-04-19T01:02:10Z"
  },
  {
    "title": "Is the UK's push toward wokeness just extremism?",
    "description": "What we are seeing is not fairness: It is reverse discrimination, a new kind of ultra-extremism that vilifies white Britons as default oppressors, automatically privileged, and inherently racist.",
    "link": "https://www.jpost.com/opinion/article-850503",
    "timestamp": "2025-04-19T01:01:56Z"
  },
  {
    "title": "Military, Legal Experts: Israel’s Gaza Campaign ‘Morally Justified and Legally Constrained’",
    "description": "Israel’s military campaign in Gaza is both morally justified and legally constrained, according to retired United States Army major and urban warfare expert John Spencer and human rights attorney Arsen Ostrovsky, who argue that “anyone asking whether Israel’s…",
    "link": "https://www.breitbart.com/middle-east/2025/04/18/military-legal-experts-israels-gaza-campaign-morally-justified-legally-constrained/",
    "timestamp": "2025-04-19T01:01:16Z"
  },
  {
    "title": "Claim: Forcing Substandard Climate Friendly Appliances on People Saves Money",
    "description": "\"Freedom to choose\" is bad?",
    "link": "https://wattsupwiththat.com/2025/04/18/claim-forcing-substandard-climate-friendly-appliances-on-people-saves-money/",
    "timestamp": "2025-04-19T01:00:00Z"
  },
  {
    "title": "Court filings describe DOGE-led, scream-filled, 36-hour mass layoff scramble at consumer protection agency",
    "description": "Court filings describe DOGE-led, scream-filled, 36-hour mass layoff scramble at consumer protection agency\nWhite House senior advisor Elon Musk walks to the White House after landing in Marine One on the South Lawn with U.S. President Donald Trump (not pictur…",
    "link": "https://biztoc.com/x/c8d75e94c545c858",
    "timestamp": "2025-04-19T00:59:13Z"
  },
  {
    "title": "US citizen says he and his wife detained for hours after Canadian trip | CNN",
    "description": "An American citizen says he and his wife were detained for hours by U.S. border agents when they returned to the United States after a short trip to Canada.",
    "link": "https://www.cnn.com/2025/04/18/us/us-citizen-detained-canada/index.html",
    "timestamp": "2025-04-19T00:58:13Z"
  },
  {
    "title": "Vince Vaughn Joins President Trump After Attending Good Friday Prayer Service",
    "description": "Actor Vince Vaughn joined President Donald Trump in the Oval Office on Good Friday after attending a prayer service at the U.S. Capitol. Vaughn, renowned for his roles in comedy classics like Wedding Crashers, Old School, and Dodgeball: A True Underdog Story,…",
    "link": "https://freerepublic.com/focus/f-news/4311906/posts",
    "timestamp": "2025-04-19T00:57:22Z"
  },
  {
    "title": "How to Sleep Insanely Fucking Early?",
    "description": "OK so this is a big thing… Especially once you have a kid, OMG, last night I had like the worst headache and migraine of all time, the big issue being that we stayed out a bit too late, and didn’t go to bed until 9 PM, which in Kids world is like at least […]",
    "link": "https://erickimphotography.com/blog/2025/04/18/how-to-sleep-insanely-fucking-early/",
    "timestamp": "2025-04-19T00:56:17Z"
  },
  {
    "title": "Discipline.",
    "description": "Or un-disciplined? VISION. . Choose Your Fighter . Get people excited! . Discipline to sleep early . I’m shocked, after Nvidia and bitcoin, there’s like a huge jump down to Tesla google Meta Microsoft Apple. Which in the last four years is around the 155% to …",
    "link": "https://erickimphotography.com/blog/2025/04/18/discipline-3/",
    "timestamp": "2025-04-19T00:54:25Z"
  },
  {
    "title": "U.S. steps up Houthi campaign with deadly strikes on Red Sea oil port",
    "description": "The attack on the Houthi-controlled port killed dozens of people, according to the Iran-backed militants, raising the specter of a widening conflict in the Middle East.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/us-steps-up-houthi-campaign/",
    "timestamp": "2025-04-19T00:52:00Z"
  },
  {
    "title": "White House website now promotes China lab leak theory as Covid-19’s \"true origin\"",
    "description": "The White House on Friday unveiled a revamped Covid-19 website that promoted the contentious theory that the virus leaked from a Chinese laboratory, framing it as the pandemic's \"true origins.\" - 'Terrible shame' - \"I welcome all efforts to dig deeper,\" said …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-website-now-promotes-china-lab-leak-theory-as-covid-19s-true-origin/articleshow/120421021.cms",
    "timestamp": "2025-04-19T00:51:02Z"
  },
  {
    "title": "Report: Acting IRS Commissioner Replaced Days After Appointment Amid Musk-Bessent Clash",
    "description": "The acting commissioner of the Internal Revenue Service (IRS) was replaced days after he was appointed amid reports of a clash between Elon Musk and Treasury Secretary Scott Bessent.\nThe post Report: Acting IRS Commissioner Replaced Days After Appointment Ami…",
    "link": "https://www.breitbart.com/politics/2025/04/18/report-acting-irs-commissioner-replaced-days-after-appointment-amid-musk-bessent-clash/",
    "timestamp": "2025-04-19T00:50:34Z"
  },
  {
    "title": "The HIDDEN Agenda: Congresswoman Hageman UNCOVERS USAID Fraud, Censorship and Human Trafficking",
    "description": "Congresswoman Harriet Hageman discusses the significance of Elon Musk’s DOGE and the secrets of USAID, including its sponsorship of BLM and Antifa. In this broad scope interview she explains to Winston how she thinks Mark Zuckerberg rigged the 2020 election. …",
    "link": "https://freerepublic.com/focus/f-chat/4311905/posts",
    "timestamp": "2025-04-19T00:49:12Z"
  },
  {
    "title": "ACLU Claims Trump Administration Is Restarting Deportations Under 18th Century Wartime Law",
    "description": "The American Civil Liberties Union on Friday unsuccessfully asked two federal judges to bar deportation of Venezuelans held in northern Texas.",
    "link": "https://www.huffpost.com/entry/us-trump-deportations-aclu_n_6802f1eae4b09556e3202a68",
    "timestamp": "2025-04-19T00:46:56Z"
  },
  {
    "title": "US judge rules Rumeysa Ozturk must be transferred from Louisiana to Vermont",
    "description": "Court says detained pro-Palestine student has shown 'significant evidence' violations to her constitutional rights.",
    "link": "https://www.aljazeera.com/news/2025/4/19/us-judge-rules-rumeysa-ozturk-must-be-transferred-from-louisiana-to-vermont",
    "timestamp": "2025-04-19T00:46:05Z"
  },
  {
    "title": "U.S. to withdraw some 1,000 troops from Syria",
    "description": "President Donald Trump has long been skeptical of Washington's presence in Syria.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/us-withdraw-troops-syria/",
    "timestamp": "2025-04-19T00:45:00Z"
  },
  {
    "title": "PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China",
    "description": "It would be \"foolish\" to stop engaging with China, the chancellor has said, as Sir Keir Starmer held his first call with Donald Trump since he put 10% tariffs on goods imported from the UK.",
    "link": "https://news.sky.com/story/pm-and-trump-step-up-trade-talks-as-chancellor-warns-its-foolish-not-to-engage-with-china-13351482",
    "timestamp": "2025-04-19T00:42:00Z"
  }
]