[
  {
    "title": "Trump's Feud With Harvard Risks Critical Research Into Lou Gehrig's Disease",
    "description": "David Walt&#039;s project is one of many that&#039;s getting caught in the middle of what&#039;s poised to become a protracted political and legal fight over the government&#039;s ability to dictate conditions to the nation&#039;s private universities.",
    "link": "https://www.ndtv.com/world-news/trumps-feud-with-harvard-risks-critical-research-into-lou-gehrigs-disease-8201276",
    "timestamp": "2025-04-19T05:15:28Z"
  },
  {
    "title": "Romania's presidential election redo is a high-stakes test of its democracy following annulled vote",
    "description": "Romania is gearing up to hold a presidential election redo next month, a high-stakes test for the European Union member’s democracy after last year’s annulled vote triggered the country’s deepest political crisis since 1989",
    "link": "https://abcnews.go.com/International/wireStory/romanias-presidential-election-redo-high-stakes-test-democracy-120969846",
    "timestamp": "2025-04-19T05:13:46Z"
  },
  {
    "title": "Israel still eyeing a limited attack on Iran's nuclear facilities",
    "description": "From Israel's perspective, this may be a good moment for a strike against Iran's nuclear facilities.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-850661",
    "timestamp": "2025-04-19T05:07:57Z"
  },
  {
    "title": "Donald Trump vs Mr Market",
    "description": "As the US president’s rollercoaster tariff policy creates global financial chaos, Tim Harford asks: is he in a fight he can’t win?",
    "link": "https://biztoc.com/x/4be8d5cde1955a1a",
    "timestamp": "2025-04-19T05:02:51Z"
  },
  {
    "title": "Could Trump’s tariffs give a green light for corporate profiteering?",
    "description": "Expectations of inflation, and recent waves of price rises, could be self-fulfilling and fuel ‘greedflation’ – and it may not only apply to US consumers",
    "link": "https://www.yahoo.com/news/could-trump-tariffs-green-light-050030665.html",
    "timestamp": "2025-04-19T05:00:30Z"
  },
  {
    "title": "Soviet reactors for silicon dreams: Bulgaria snubs Ukraine in bid for AI future",
    "description": "\"I want to speak with President Trump, Elon Musk, Microsoft, Bill Gates. If they’re interested and we can make this happen,\" Borissov said on Wednesday.",
    "link": "https://www.euractiv.com/section/politics/news/soviet-reactors-for-silicon-dreams-bulgaria-snubs-ukraine-in-bid-for-ai-future/",
    "timestamp": "2025-04-19T05:00:25Z"
  },
  {
    "title": "For Ireland, the choice between the US and China is easy",
    "description": "The US president’s tariffs echo the Great Game of old, presenting knotty problems for Europe",
    "link": "https://www.irishtimes.com/opinion/2025/04/19/david-mcwilliams-for-ireland-the-choice-between-the-us-and-china-is-easy/",
    "timestamp": "2025-04-19T05:00:00Z"
  },
  {
    "title": "Miriam Lord’s Easter awards: Best Varadkar tribute act, Jemser balance respected and outstanding Dáil dust-up",
    "description": "From the Burke family to Mattie McGrath and Michael Lowry, here are the winners of Miriam Lord's Easter awards",
    "link": "https://www.irishtimes.com/politics/oireachtas/2025/04/19/miriam-lords-easter-awards-best-varadkar-tribute-act-jemser-balance-respected-and-outstanding-dail-dust-up/",
    "timestamp": "2025-04-19T05:00:00Z"
  },
  {
    "title": "Supreme Court blocks, for now, deportations of Venezuelans held in northern Texas under an 18th century wartime law",
    "description": "Supreme Court blocks, for now, deportations of Venezuelans held in northern Texas under an 18th century wartime law",
    "link": "https://www.bostonherald.com/2025/04/19/supreme-court-blocks-for-now-deportations-of-venezuelans-held-in-northern-texas-under-an-18th-century-wartime-law/",
    "timestamp": "2025-04-19T04:58:06Z"
  },
  {
    "title": "Dr Oz's Granddaughter Faints During His Swearing-In Ceremony At Oval Office",
    "description": "White House aides sprung into action, shooing away reporters and photographers, who were covering the White House swearing-in ceremony of Mehmet Oz as Administrator of the Centers for Medicare and Medicaid Services (CMS).",
    "link": "https://www.ndtv.com/world-news/dr-ozs-granddaughter-faints-during-his-swearing-in-ceremony-at-oval-office-everybody-out-8201140",
    "timestamp": "2025-04-19T04:49:31Z"
  },
  {
    "title": "On new website, White House declares lab leak as 'true origins' of Covid amid tariff war with China",
    "description": "The White House’s newly revamped Covid-19 website has placed the controversial lab-leak theory at the forefront of its discussion on the origins of the virus. The website criticizes Joe Biden and Dr Anthony Fauci and has also called out masks and social dista…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/on-new-website-white-house-declares-lab-leak-as-true-origins-of-covid-amid-tariff-war-with-china/articleshow/120423658.cms",
    "timestamp": "2025-04-19T04:46:22Z"
  },
  {
    "title": "Bill Maher says AOC shouldn't be Democratic nominee in 2028 despite recent hype",
    "description": "HBO's Bill Maher cautioned Democrats from backing Rep. Alexandria Ocasio-Cortez as their party's nominee in 2028 as the\"Squad\" member has been holding rallies around the country.",
    "link": "https://www.foxnews.com/media/bill-maher-says-aoc-shouldnt-democratic-nominee-2028-despite-recent-hype",
    "timestamp": "2025-04-19T04:42:08Z"
  },
  {
    "title": "Trump walks back 24-hour promise to end Russia-Ukraine war",
    "description": "Trump's evolving stance on ending Russia-Ukraine war, from 24-hour promise to current negotiations, analyzed and explained.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-walks-back-24-hour-promise-to-end-russia-ukraine-war/article69467311.ece",
    "timestamp": "2025-04-19T04:38:21Z"
  },
  {
    "title": "Smallcaps say 'Thank you Trump' as over 100 stocks log double-digit weekly gains. Will this sustain?",
    "description": "Indian equities rebounded strongly, driven by a pause in US tariffs, with the Sensex gaining over 4%. Small caps surged, offering relief to investors after months of pressure. Banking stocks led the gains, supported by a favorable monetary environment and red…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcaps-say-thank-you-trump-as-over-100-stocks-log-double-digit-weekly-gains-will-this-sustain/articleshow/120423458.cms",
    "timestamp": "2025-04-19T04:29:06Z"
  },
  {
    "title": "As DEI rollbacks take hold, students of color say they're losing campus support systems",
    "description": "As U.S. colleges are pulling back on diversity, equity and inclusion practices, students of color say they are starting to lose campus mentors, move-in events, scholarships and diversity offices where they always have felt welcome on predominately whit...",
    "link": "https://abcnews.go.com/US/wireStory/dei-rollbacks-hold-students-color-losing-campus-support-120969572",
    "timestamp": "2025-04-19T04:22:31Z"
  },
  {
    "title": "How Trump backed away from promising to end the Russia-Ukraine war in 24 hours",
    "description": "During his campaign, Donald Trump said repeatedly that he would be able to end the war between Russia and Ukraine “in 24 hours” upon taking office",
    "link": "https://abcnews.go.com/US/wireStory/trump-backed-promising-end-russia-ukraine-war-24-120968848",
    "timestamp": "2025-04-19T04:22:27Z"
  },
  {
    "title": "Trump administration makes major cuts to Native American boarding school research projects",
    "description": "At least $1.6 million in federal funds for projects meant to capture and digitize stories of the systemic abuse of generations of Indigenous children in boarding schools at the hands of the U.S. government have been slashed due to federal funding cuts ...",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-makes-major-cuts-native-american-boarding-120969563",
    "timestamp": "2025-04-19T04:22:24Z"
  },
  {
    "title": "Questions emerge about how a deputy's stepson became the accused gunman in deadly FSU shooting",
    "description": "After a deadly shooting at Florida State University, questions are emerging about how the stepson of a beloved sheriff’s deputy tasked with school safety at a middle school became the accused gunman",
    "link": "https://abcnews.go.com/US/wireStory/questions-emerge-deputys-stepson-accused-gunman-deadly-fsu-120969566",
    "timestamp": "2025-04-19T04:22:24Z"
  },
  {
    "title": "250 years after America went to war for independence, a divided nation battles over its legacy",
    "description": "Let the arguments begin",
    "link": "https://abcnews.go.com/US/wireStory/250-years-after-america-war-independence-divided-nation-120969562",
    "timestamp": "2025-04-19T04:22:18Z"
  },
  {
    "title": "Director Gabbard and Secretary Kennedy Statement on Release of Previously Classified Senator Robert F. Kennedy Assassination Records",
    "description": "President Donald J. Trump promised maximum transparency and a commitment to rebuild the trust of the American people in the Intelligence Community (IC) and federal agencies. Part of that promise was to fully release previously-classified records related to th…",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250418-dni01.htm",
    "timestamp": "2025-04-19T04:19:26Z"
  },
  {
    "title": "RFK assassination documents released, detail Sirhan’s plans and pre-attack warnings",
    "description": "The files also note strange reports of people hearing rumors about RFK’s death prior to June 5, 1968. Despite being deemed suitable for parole in 2021, Sirhan remains in prison.",
    "link": "https://www.thehindubusinessline.com/news/world/rfk-assassination-documents-released-detail-sirhans-plans-and-pre-attack-warnings/article69467284.ece",
    "timestamp": "2025-04-19T04:18:10Z"
  },
  {
    "title": "\"Everyone out, no photos\": White House briefing ends abruptly, Trump's press conference cut short",
    "description": "Donald Trump's press conference in the Oval Office came to an abrupt end after a young girl in attendance suddenly fainted. He was answering questions from reporters on nuclear tensions with Iran and the deportation of Kilmar Abrego Garcia. After the girl fai…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/everyone-out-no-photos-white-house-briefing-ends-abruptly-trumps-press-conference-cut-short/articleshow/120423266.cms",
    "timestamp": "2025-04-19T04:16:27Z"
  },
  {
    "title": "Trump Post on X : This is the hand of the man that the Democrats feel should be brought back to the United States. Shows MS 13",
    "description": "This is the hand of the man that the Democrats feel should be brought back to the United States, because he is such “a fine and innocent person.” They said he is not a member of MS-13, even though he’s got MS-13 tattooed onto his knuckles, and two Highly Resp…",
    "link": "https://freerepublic.com/focus/f-news/4311922/posts",
    "timestamp": "2025-04-19T04:13:29Z"
  },
  {
    "title": "The Rioter Cell of the Democrat Party has been Activated",
    "description": "Since he entered politics, President Trump has been targeted with numerous Democrat powered “protests.” An entire Wikipedia page is dedicated to these",
    "link": "https://www.americanthinker.com/articles/2025/04/the_rioter_cell_of_the_democrat_party_has_been_activated.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "Mahmoud Khalil, a spokesman for an organization advocating killing Jews, likens himself to an Auschwitz victim",
    "description": "It takes a special kind of evil openly advocates for organizations demanding Jewish blood to claim our government is acting like the Nazis and compare himself to a Jew in Auschwitz. Mahmoud Khalil is just that evil, as is the Washington Post, which h...",
    "link": "https://www.americanthinker.com/blog/2025/04/mahmoud_khalil_a_spokesman_for_an_organization_advocating_killing_jews_likens_himself_to_an_auschwitz_victim.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "America, América by Greg Grandin: An extraordinarily ambitious history of conquest and control in the Americas",
    "description": "Grandin is one of the best historians today at writing for both scholars and the general public",
    "link": "https://www.irishtimes.com/culture/books/review/2025/04/19/america-america-by-greg-grandin-an-extraordinarily-ambitious-history-of-conquest-and-control-in-the-americas/",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "DOGE shows just how deep illegal immigration rot goes",
    "description": "The Trump administration inherited one of the most dire national security crises in American history, and recent reports from the Department of Government Efficiency (DOGE) demonstrate just how costly illegal immigration has been for U.S. citizens.\r\n...",
    "link": "https://www.americanthinker.com/blog/2025/04/doge_shows_just_how_seep_illegal_immigration_rot_goes.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "Author Caroline Madden: ‘My luck turned when I created a female protagonist seething with quiet resentment’",
    "description": "The author of The Marriage Vendetta talks about what it takes to get published, her Jane Austen-inspired world record, and a surprisingly funny book",
    "link": "https://www.irishtimes.com/culture/books/2025/04/19/caroline-madden-my-luck-turned-when-i-created-a-female-protagonist-seething-with-quiet-resentment/",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "Another disloyal officer is fired",
    "description": "On April 12, I wrote Cleaning traitors out of the military. It was the story of Admiral Shoshanna Chatfield, removed from her NATO leadership post for violation of Article 88 of the Uniform Code of Military Justice (UCMJ):  \r\n\r\n\r\n888. ARTIC...",
    "link": "https://www.americanthinker.com/blog/2025/04/another_disloyal_officer_is_fired.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "Let’s (Not) Celebrate Psychology Week",
    "description": "According to the American Psychological Association’s (APA’s) website, psychologists will be celebrating something called “Psychology Week” from April 20–26, during which so-called mental health professionals will &ldquo...",
    "link": "https://www.americanthinker.com/articles/2025/04/let_s_not_celebrate_psychology_week.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "Letitia James: Karma is a b***h",
    "description": "Americans paying attention know about New York Attorney General Letitia James. She was elected on a platform of “getting Trump,” without any legally definable understanding of what he might have done to justifying “getting.” F...",
    "link": "https://www.americanthinker.com/blog/2025/04/letitia_james_karma_is_a_b_h.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "A Massachusetts judge has blocked Trump’s effort to remove imaginary ‘genders’ from passports",
    "description": "The ACLU is celebrating because a Biden-nominated District Court Judge in Massachusetts has ruled that President Donald Trump lacks the authority to make passports align with reality. For now, the mentally ill fantasies of the six plaintiffs appearin...",
    "link": "https://www.americanthinker.com/blog/2025/04/a_massachusetts_judge_has_blocked_trump_s_effort_to_remove_imaginary_genders_from_passports.html",
    "timestamp": "2025-04-19T04:00:00Z"
  },
  {
    "title": "\"Must Be Allowed To Do My Job\": Trump's MS-13 Tattoo Photo Sparks Debate",
    "description": "US President Donald Trump on Friday evening shared a photograph that he claimed showed the tattooed knuckles of Kilmar Abrego Garcia, a man who was deported to El Salvador last month amid controversy.",
    "link": "https://www.ndtv.com/world-news/donald-trump-kilmar-abrego-garcia-tattoo-controversy-erupts-as-trump-targets-deported-man-with-ms-13-claim-8200917",
    "timestamp": "2025-04-19T03:58:31Z"
  },
  {
    "title": "Yemen: US strike on Ras Isa Port kills 74, escalates Trump’s campaign against Houthis",
    "description": "US airstrike on Houthi-held oil port in Yemen kills over 70, escalates conflict, impacts global trade, and sparks missile attacks.",
    "link": "https://www.thehindubusinessline.com/news/world/yemen-us-strike-on-ras-isa-port-kills-74-escalates-trumps-campaign-against-houthis/article69467273.ece",
    "timestamp": "2025-04-19T03:58:00Z"
  },
  {
    "title": "US chipmakers fear they are ceding China's AI market to Huawei",
    "description": "The US companies' challenges are a reflection of how US-Chinese tensions are reordering the global economy. For years, US companies created and designed many of the world's bestselling products, while relying on China to produce most of them and buy many of t…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-chipmakers-fear-they-are-ceding-chinas-ai-market-to-huawei/articleshow/120423035.cms",
    "timestamp": "2025-04-19T03:55:37Z"
  },
  {
    "title": "News Summary-Intelligence Report 4/18/2025*Newsdump Friday*Deportations To El Salvador Prison Rumored*Firing Of Fed Chair Considered*RFK Assassination Docs Released*Rubio Speaks Of \"Moving On\" From Ukraine*Pre Iran Talks News Leak Stories*",
    "description": "Federal District Judge James Boasberg holding an emergency hearing this evening...Attorneys for the American Civil Liberties Union also asking for Supreme Court... Meanwhile a panel of the federal appeals court in Washington DC putting a hold on an earlier co…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311921/posts",
    "timestamp": "2025-04-19T03:46:53Z"
  },
  {
    "title": "Trump brags gas is down to $1.98 a gallon in a ‘couple of states.’ It isn’t — anywhere",
    "description": "President Donald Trump bragged this week that gas is down to $1.98 a gallon in a “couple of states.”\nIn fact it isn’t, anywhere.\n“No state had an average gas price even close to $1.98 per gallon [as of} Wednesday,” CNN’s Chief White House Correspondent Kaitla…",
    "link": "https://biztoc.com/x/cae79daf97d121e0",
    "timestamp": "2025-04-19T03:45:22Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets are cautiously optimistic amidst tariff concerns, awaiting China's economic response and assessing corporate resilience. The IMF and World Bank meetings in Washington highlight worries about U.S. isolationism. China is expected to ease monetary…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/120422858.cms",
    "timestamp": "2025-04-19T03:40:57Z"
  },
  {
    "title": "ACLU Demands SCOTUS Block Next Round of Deportations to El Salvador",
    "description": "The Trump administration is preparing to deport a new group of Venezuelan men detained in Texas, said the ACLU in an emergency Friday court filing.",
    "link": "http://www.rollingstone.com/politics/politics-news/aclu-scotus-block-alien-enemies-trump-deportations-1235321239/",
    "timestamp": "2025-04-19T03:40:25Z"
  },
  {
    "title": "Teen Warned of 'Decades Behind Bars' After Tesla Arson Charge",
    "description": "Attorney General Pam Bondi has called the attacks to Tesla property and vehicles \"domestic terrorism.\"",
    "link": "https://www.newsweek.com/teen-warned-decades-behind-bars-after-tesla-arson-charge-2061675",
    "timestamp": "2025-04-19T03:39:22Z"
  },
  {
    "title": "Bill Maher Jokes Trump Is Celebrating Easter ‘by Locking Up Guys Named Jesus’ | Video",
    "description": "The \"Real Time\" host also quips Elon Musk considers Jesus' death and resurrection \"an elaborate scheme to defraud Social Security\"\nThe post Bill Maher Jokes Trump Is Celebrating Easter ‘by Locking Up Guys Named Jesus’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-maher-donald-trump-easter-monologue-hbo-real-time/",
    "timestamp": "2025-04-19T03:39:21Z"
  },
  {
    "title": "Wall Street Week Ahead: Busy US earnings week confronts market grappling with tariff fallout",
    "description": "U.S. stock market faces a crucial week as major companies report earnings amid trade policy uncertainties sparked by President Trump's tariffs. Investors are on edge, with recession odds rising and volatility remaining high.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-busy-us-earnings-week-confronts-market-grappling-with-tariff-fallout/articleshow/120422827.cms",
    "timestamp": "2025-04-19T03:38:05Z"
  },
  {
    "title": "'Unauthorized': Trump admin says Harvard demand letter was mistakenly sent",
    "description": "The sweeping set of demands President Donald Trump’s administration insisted Harvard University comply with last Friday was sent to the elite institution by mistake and should never have hit their inbox, according to the New York Times.But by the time Harvard…",
    "link": "https://www.rawstory.com/trump-harvard-2671803666/",
    "timestamp": "2025-04-19T03:36:03Z"
  },
  {
    "title": "Trump studying whether to fire Fed Chair Powell, adviser says",
    "description": "White House economic advisor Kevin Hassett indicated that President Trump is still considering firing Federal Reserve Chair Jerome Powell, despite concerns about the central bank's independence and market stability. Trump has repeatedly criticized Powell for …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-studying-whether-to-fire-fed-chair-powell-adviser-says/articleshow/120422802.cms",
    "timestamp": "2025-04-19T03:35:15Z"
  },
  {
    "title": "Iran says nuclear deal is possible if Washington is realistic",
    "description": "The foreign minister's assertion came on the eve of a second round of talks with the administration of U.S. President Donald Trump.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/politics/iran-us-nuclear-deal/",
    "timestamp": "2025-04-19T03:34:00Z"
  },
  {
    "title": "Iran, US To Hold Second Round Of High-stakes Nuclear Talks In Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran's nuclear programme, a week after an initial round of discussions that both sides described as \"constructive\".",
    "link": "https://www.ibtimes.com/iran-us-hold-second-round-high-stakes-nuclear-talks-rome-3770640",
    "timestamp": "2025-04-19T03:30:22Z"
  },
  {
    "title": "ETMarkets Smart Talk: FY26 may test equities, but offers a window for bargain hunters, says Jitendra Gohil",
    "description": "While he cautions that equities may face pressure and deliver subpar returns in the near term, he believes the current environment presents a rare window for bargain hunters to accumulate high-quality stocks at reasonable valuations.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-fy26-may-test-equities-but-offers-a-window-for-bargain-hunters-says-jitendra-gohil/articleshow/120409684.cms",
    "timestamp": "2025-04-19T03:30:00Z"
  },
  {
    "title": "Iran, US to hold second round of high-stakes nuclear talks in Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran’s nuclear programme, a week after an initial round of discussions that both sides described as “constructive”. Iranian Foreign Minister Abbas Araghchi and US Middle East envoy S…",
    "link": "https://www.digitaljournal.com/world/iran-us-to-hold-second-round-of-high-stakes-nuclear-talks-in-rome/article",
    "timestamp": "2025-04-19T03:27:20Z"
  },
  {
    "title": "Tariff-linked volatility eases, but risk still high",
    "description": "Global stocks have faced unusual turbulence in the past three weeks since US President Donald Trump announced higher-than-expected reciprocal tariffs against dozens of countries.",
    "link": "https://www.bangkokpost.com/business/investment/3006246/tariff-linked-volatility-eases-but-risk-still-high",
    "timestamp": "2025-04-19T03:27:00Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Washington wants Iran to halt production of highly enriched uranium, which it believes is aimed at building an atomic bomb.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-850659",
    "timestamp": "2025-04-19T03:21:10Z"
  },
  {
    "title": "How AI is aiding Trump's immigration crackdown",
    "description": "The practice is raising fears that risks to accuracy and privacy could put almost anyone in danger of getting caught up in the crackdown.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/science-health/ai-trump-immigration-crackdown/",
    "timestamp": "2025-04-19T03:13:00Z"
  },
  {
    "title": "Single Deadliest Yemen Strike Of Trump Presidency Destroys Vital Oil Port",
    "description": "Single Deadliest Yemen Strike Of Trump Presidency Destroys Vital Oil Port\n \nFresh US airstrikes on Yemen Thursday marked the single-deadliest known attack under President Donald Trump's new campaign targeting the Houthi rebels. The Pentagon has been intensely…",
    "link": "https://biztoc.com/x/8a790b1091dbd3d9",
    "timestamp": "2025-04-19T03:12:15Z"
  },
  {
    "title": "Trump to fast-track permitting for 10 mining projects across US",
    "description": "Trump to fast-track permitting for 10 mining projects across US\nThe White House on Friday said it will fast-track permitting for 10 mining projects across the United States as part of President Donald Trump’s push to expand critical minerals production.\nThe p…",
    "link": "https://biztoc.com/x/be3828cb3bfac359",
    "timestamp": "2025-04-19T03:12:13Z"
  },
  {
    "title": "US bond markets: Why everyone is watching them closely",
    "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
    "link": "https://www.bbc.co.uk/news/articles/cvg838qq7zqo",
    "timestamp": "2025-04-19T03:12:13Z"
  },
  {
    "title": "Trump's Top Economic Adviser Kevin Hassett Says White House Is Exploring Options To Fire Fed Chair Jerome Powell: 'The President And His Team Will Continue To Study'",
    "description": "On Friday, White House National Economic Council chair Kevin Hassett said the Donald Trump administration is exploring ways to remove Federal Reserve Chairman Jerome Powell.\nWhat Happened: Hassett told reporters at the White House that the “President and his …",
    "link": "https://biztoc.com/x/039cc4653cc96c24",
    "timestamp": "2025-04-19T03:12:01Z"
  },
  {
    "title": "Trump scraps federal COVID-19 website for virus lab-leak theory",
    "description": "The White House replaced the federal government’s hub for news and updates on COVID-19 with a website saying the virus leaked out of a Chinese lab.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/18/trump-covid-lab-leak-website/83167873007/",
    "timestamp": "2025-04-19T03:11:48Z"
  },
  {
    "title": "한국 대선, 지지율 금쪽이 누구?",
    "description": "President Donald Trump said Friday he was pushing through a massive overhaul of the civil service system, posting new rules for moving thousands of positions formerly reserved for career federal employees into the ranks of political positions. https://t.co/gV…",
    "link": "https://ryueyes11.tistory.com/511572",
    "timestamp": "2025-04-19T03:09:06Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Iran and the United States are set to resume nuclear talks in Rome, mediated by Oman, aiming to resolve their long-standing dispute over Tehran's nuclear ambitions. These indirect negotiations follow a previous round in Muscat, amid Trump's renewed threats of…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-us-to-hold-talks-in-rome-in-bid-to-reach-nuclear-deal/articleshow/120422460.cms",
    "timestamp": "2025-04-19T03:06:03Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "DUBAI (Reuters) - Iran and the United States will hold a new round of nuclear talks in Rome on Saturday to resolve their decades-long standoff over Tehran's atomic aims, under the shadow of President Donald Trump's threat to unleash military action if diploma…",
    "link": "https://www.thestar.com.my/news/world/2025/04/19/iran-us-to-hold-talks-in-rome-in-bid-to-reach-nuclear-deal",
    "timestamp": "2025-04-19T03:06:00Z"
  },
  {
    "title": "Iran, US to hold talks in Rome in bid to reach nuclear deal",
    "description": "Iran and the United States will hold a new round of nuclear talks in Rome on Saturday to resolve their decades-long standoff over Tehran's atomic aims, under...",
    "link": "https://ca.news.yahoo.com/iran-us-hold-talks-rome-030431316.html",
    "timestamp": "2025-04-19T03:04:31Z"
  },
  {
    "title": "War Diary: Trump's 'Midas touch' delusions will fail to solve the Gaza crisis",
    "description": "Benjamin Netanyahu can praise President Donald Trump for his “creative and innovative idea” for Gaza, but the prime minister must also recognize the plan is absurd and dead on arrival.",
    "link": "https://www.jpost.com/opinion/article-850221",
    "timestamp": "2025-04-19T03:00:37Z"
  },
  {
    "title": "David Hogg: The Time for James Carville's 'Timid' Politics Is Over",
    "description": "Democratic National Committee Vice Chair David Hogg said Friday on CNN's \"The Lead\" that Democratic strategist James Carville believed in \"timid\" politics.\nThe post David Hogg: The Time for James Carville’s ‘Timid’ Politics Is Over appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/04/18/david-hogg-the-time-for-james-carvilles-timid-politics-is-over/",
    "timestamp": "2025-04-19T02:55:06Z"
  },
  {
    "title": "Elie Honig Stunned When White House Admits It Sent Menacing Letter to Harvard by Mistake – But Blamed Harvard Anyway: ‘I Mean…’",
    "description": "\"I think that statement actually just sort of gives away the whole game.\"\nThe post Elie Honig Stunned When White House Admits It Sent Menacing Letter to Harvard by Mistake – But Blamed Harvard Anyway: ‘I Mean…’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/elie-honig-stunned-when-white-house-admits-it-sent-menacing-letter-to-harvard-by-mistake-but-blamed-harvard-anyway-i-mean/",
    "timestamp": "2025-04-19T02:50:25Z"
  },
  {
    "title": "Iran and the US prepare for a second round of negotiations over Tehran's nuclear program in Rome",
    "description": "Iran and the United States are preparing for a second round of negotiations over Tehran’s rapidly advancing nuclear program in Rome",
    "link": "https://abcnews.go.com/US/wireStory/iran-us-prepare-round-negotiations-tehrans-nuclear-program-120968257",
    "timestamp": "2025-04-19T02:46:28Z"
  },
  {
    "title": "Marco Rubio sits with Michael Benz, Jewish former Trump official with antisemitic online persona",
    "description": "Speaking to Rubio on Wednesday in a talk released by the State Department, Benz quizzed him on how the department would be changing its approach to free-speech issues under Trump.",
    "link": "https://www.jpost.com/american-politics/article-850655",
    "timestamp": "2025-04-19T02:45:45Z"
  },
  {
    "title": "Stocks make small gains amid trade talk hope",
    "description": "RECAP:  Asian stocks notched small gains in thin trade on Friday as investors largely adopted a wait-and-see approach on tariff negotiations before making long-term bets. Some markets were closed for the Good Friday holiday.",
    "link": "https://www.bangkokpost.com/business/investment/3006291/stocks-make-small-gains-amid-trade-talk-hope",
    "timestamp": "2025-04-19T02:43:00Z"
  },
  {
    "title": "EM assets set for best week since March as China concerns abate",
    "description": "With most markets closed for Easter, the MSCI emerging markets index rose on Friday, taking its weekly advance to 2.2%. Currencies of commodity-linked countries including South Africa outperformed this week, sending the benchmark near a six-month high.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/em-assets-set-for-best-week-since-march-as-china-concerns-abate/articleshow/120422314.cms",
    "timestamp": "2025-04-19T02:40:22Z"
  },
  {
    "title": "Japan tariff negotiator rules out quick U.S. deal despite push by Trump",
    "description": "Ryosei Akazawa said that while the U.S. president wants to speed up negotiations, any agreement would likely take some time.",
    "link": "https://www.japantimes.co.jp/business/2025/04/19/economy/us-japan-tariffs-no-quick-deal/",
    "timestamp": "2025-04-19T02:36:00Z"
  },
  {
    "title": "Once-hot Wall Street funds unravel fast with no one to save",
    "description": "In the grip of the tariff fallout, 90 of the top 100 best-performing exchange-traded funds of last year are down in 2025, with an average loss of 13%, according to Bloomberg Intelligence. At the same time, dormant trades of all sorts have staged a comeback: N…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/once-hot-wall-street-funds-unravel-fast-with-no-one-to-save/articleshow/120422278.cms",
    "timestamp": "2025-04-19T02:34:35Z"
  },
  {
    "title": "Doug Casey on Trump’s Tariffs and the Coming Economic Fallout",
    "description": "International Man: President Trump recently imposed sweeping tariffs on much of the world, dubbing it Liberation Day. Trump declared: “It will forever be remembered as the day American industry was reborn, the day America’s destiny was reclaimed, and the day …",
    "link": "https://www.activistpost.com/doug-casey-on-trumps-tariffs-and-the-coming-economic-fallout/",
    "timestamp": "2025-04-19T02:33:00Z"
  },
  {
    "title": "នាយកប្រតិបត្តិ Apple និយាយជាមួយមន្ត្រីពាណិជ្ជកម្មអាមេរិក ជុំវិញផលប៉ះពាល់ពន្ធលើតម្លៃ iPhone",
    "description": "នាយកប្រតិបត្តិ Apple និយាយជាមួយមន្ត្រីពាណិជ្ជកម្មអាមេរិក ជុំវិញផលប៉ះពាល់ពន្ធលើតម្លៃ iPhonefreshnewsasia.com",
    "link": "https://freshnewsasia.com/index.php/en/business/384551-2025-04-19-02-24-31.html",
    "timestamp": "2025-04-19T02:31:30Z"
  },
  {
    "title": "Judge Blocks Trump Administration from Deporting to 3rd Countries Without Due Process",
    "description": "A federal judge blocked the Trump administration from deporting illegal migrants to their non-origin country without due process.\nThe post Judge Blocks Trump Administration from Deporting to 3rd Countries Without Due Process appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/18/judge-blocks-trump-administration-deporting-3rd-countries-due-process/",
    "timestamp": "2025-04-19T02:26:27Z"
  },
  {
    "title": "Trump administration scrap COVID-19 sites in favour of lab leak theory",
    "description": "The Trump administration has relaunched COVID-19 health websites, blaming  the origins of the coronavirus on a lab leak in China and criticising former president Joe Biden.",
    "link": "https://www.abc.net.au/news/2025-04-19/donald-trump-launches-covid-19-lab-leak-theory-site/105193140",
    "timestamp": "2025-04-19T02:19:05Z"
  },
  {
    "title": "WOW. Fake news MSNBC cut away from President Trump right as he started reading FACTS about deported MS-13 gang member Kilmar Abrego Garcia.",
    "description": "Here is the rest of President Trump’s statement on the deported MS-13 gang member that fake news MSNBC CUT AWAY FROM. They don’t want you to hear the TRUTH.",
    "link": "https://freerepublic.com/focus/f-news/4311915/posts",
    "timestamp": "2025-04-19T02:15:08Z"
  },
  {
    "title": "Trump White House Lashes Out At Senator Who Visited Wrongly Deported Man In El Salvador (Sara Boboltz/HuffPost)",
    "description": "Sara Boboltz / HuffPost:\nTrump White House Lashes Out At Senator Who Visited Wrongly Deported Man In El Salvador  —  “GRANDSTANDER!!!” the president wrote on social media.  He later smeared the Maryland immigrant's character, as well.  —  President Donald Tru…",
    "link": "https://www.memeorandum.com/250418/p140",
    "timestamp": "2025-04-19T02:10:02Z"
  },
  {
    "title": "Trump officials blame 'mistake' for setting off confrontation with Harvard University: Report",
    "description": "Harvard University received a letter containing demands related to hiring, admissions, and curriculum from an official in former President Trump's antisemitism task force, triggering a legal dispute. The letter, sent by Sean Keveney, led Harvard to believe re…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-officials-say-letter-to-harvard-university-sent-by-mistake-report/articleshow/120422006.cms",
    "timestamp": "2025-04-19T02:07:59Z"
  },
  {
    "title": "'Needed to get him alone': Trump advisers urged tariff pause with 'hovering' Navarro away",
    "description": "President Donald Trump's major economic cabinet officials, Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick, were only able to persuade him to temporarily reduce the burden of his \"Liberation Day\" tariffs because they spoke to him while …",
    "link": "https://www.rawstory.com/trump-peter-navarro/",
    "timestamp": "2025-04-19T02:05:01Z"
  },
  {
    "title": "Trump passport policy discriminates against transgender people, judge rules",
    "description": "A federal judge in Boston has ruled that the Trump administration's policy on passports for transgender and nonbinary Americans is likely unconstitutional, citing discrimination and animus. Judge Julia Kobick issued a preliminary injunction, blocking the poli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-passport-policy-discriminates-against-transgender-people-judge-rules/articleshow/120421997.cms",
    "timestamp": "2025-04-19T02:01:49Z"
  },
  {
    "title": "Guess Where Trump Got His 'Faith'",
    "description": "Donald Trump’s lapdog in the State Department made a call to action earlier this week, asking employees there to report anyone who seemed to give off any “anti-Christian” vibes in the workplace. \nAnd while Secretary of State Marco Rubio is sniffing out those …",
    "link": "https://crooksandliars.com/2025/04/guess-where-trump-got-his-faith",
    "timestamp": "2025-04-19T02:00:02Z"
  },
  {
    "title": "World’s cartoonists on this week’s events",
    "description": "Drawing the top stories around the globe.",
    "link": "https://www.politico.eu/article/worlds-cartoonists-on-this-weeks-events-152/",
    "timestamp": "2025-04-19T02:00:00Z"
  },
  {
    "title": "US Releases 10,000 Pages Of Records On Robert F Kennedy's Assassination",
    "description": "Robert F Kennedy was fatally shot on June 5, 1968, at the Ambassador Hotel in Los Angeles moments after giving a speech celebrating his victory in California&#039;s presidential primary.",
    "link": "https://www.ndtv.com/world-news/us-releases-10-000-pages-of-records-on-robert-f-kennedys-assassination-on-donald-trumps-order-tulsi-gabbard-8200448",
    "timestamp": "2025-04-19T01:56:18Z"
  },
  {
    "title": "Italy agrees with US to oppose 'discriminatory' tech taxes",
    "description": "European levies aimed at hitting dominant U.S. tech giants such as Alphabet's Google, Meta's Facebook , Apple and Amazon have been a longstanding irritant for U.S. administrations, including Trump's. Italy applies a 3% levy on revenue from internet transactio…",
    "link": "https://economictimes.indiatimes.com/tech/technology/italy-agrees-with-us-to-oppose-discriminatory-tech-taxes/articleshow/120421952.cms",
    "timestamp": "2025-04-19T01:53:32Z"
  },
  {
    "title": "Arizona governor vetoes bill requiring local officials to help with federal immigration efforts",
    "description": "Democratic Gov. Katie Hobbs has vetoed a Republican-backed bill intended to support the Trump administration’s immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/arizona-governor-vetoes-bill-requiring-local-officials-federal-120967320",
    "timestamp": "2025-04-19T01:50:39Z"
  },
  {
    "title": "Franklin Graham shares hope message in exclusive interview on Easter special: 'God hasn’t forgotten them'",
    "description": "Rev. Franklin Graham shared an inside look into Easter from the Ashes with Fox News Digital, sharing stories of survival, loss and faith — pointing to the hope found in Jesus Christ.",
    "link": "https://www.foxnews.com/lifestyle/franklin-graham-shares-hope-message-exclusive-interview-easter-special",
    "timestamp": "2025-04-19T01:46:02Z"
  },
  {
    "title": "Who’s out, who’s in … front of the bus?",
    "description": "On topic – stay on it. Out: Acting head of IRS Gary Shapley, installed by President Musk three days ago. Donald Trump is replacing the acting commissioner of the US Internal Revenue Service after treasury secretary Scott Bessent reportedly complained to the p…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/whos-out-whos-in-front-of-the-bus",
    "timestamp": "2025-04-19T01:45:00Z"
  },
  {
    "title": "'Malicious compliance': Conservative WSJ editors rip Trump over deportation case",
    "description": "President Donald Trump is setting the country on a dangerous track in his repeated refusals to admit that the Maryland man his administration mistakenly sent to El Salvador is owed due process in the United States, according to the Wall Street Journal’s conse…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2671803360/",
    "timestamp": "2025-04-19T01:43:02Z"
  },
  {
    "title": "WATCH: WH Deputy Chief of Staff Stephen Miller Tells TGP Sanctuary State Leaders Are Engaged in “Systemic Criminal Violations” Calls for Justice for Felony Offense of Harboring Illegals and Obstructing Justice",
    "description": "In a striking response, White House Deputy Chief of Staff Stephen Miller addresses the legal implications of sanctuary cities, emphasizing systemic violations and the urgent need for accountability. His remarks reveal a pivotal moment in the immigration debat…",
    "link": "https://www.thegatewaypundit.com/2025/04/watch-wh-deputy-chief-staff-stephen-miller-tells/",
    "timestamp": "2025-04-19T01:40:19Z"
  },
  {
    "title": "Tropical drinks by the pool? Not so fast, says senator who visited Abrego Garcia in El Salvador",
    "description": "There was the pool furniture in the background",
    "link": "https://abcnews.go.com/US/wireStory/tropical-drinks-pool-fast-senator-visited-abrego-garcia-120963577",
    "timestamp": "2025-04-19T01:34:28Z"
  },
  {
    "title": "Cardano Price Surge To $1.7: Here Are The Factors To Drive The Recovery",
    "description": "The Cardano price may be preparing for a powerful rally toward $1.7, as new indicators suggest a potential recovery. A leading crypto analyst has identified multiple bullish catalysts that could drive ADA’s momentum and help propel the cryptocurrency to this …",
    "link": "http://www.newsbtc.com/news/cardano/cardano-price-surge-to-1-7/",
    "timestamp": "2025-04-19T01:34:09Z"
  },
  {
    "title": "Judge Boasberg Doesn't Think He Has the 'Power' to Block Trump Deportations",
    "description": "Boasberg said that while he was \"sympathetic,\" he doesn't believe he has the authority to block more deportations under the Alien Enemies Act.",
    "link": "https://www.newsweek.com/judge-boasberg-lacks-power-trump-deportations-ruling-2061668",
    "timestamp": "2025-04-19T01:31:49Z"
  },
  {
    "title": "Dr. Oz's swearing-in ceremony abruptly ends as his granddaughter faints",
    "description": "Dr. Mehmet Oz's swearing-in ceremony at the White House ended abruptly when his granddaughter fainted during President Trump's remarks, leading officials to clear the Oval Office: 'Everybody out!'",
    "link": "https://ew.com/dr-oz-swearing-in-ceremony-abruptly-ends-as-his-granddaughter-faints-11718389",
    "timestamp": "2025-04-19T01:30:32Z"
  }
]