[
  {
    "title": "Schumer: Trump Sending Military to Cities Is Moving U.S. into an 'Autocracy'",
    "description": "On Wednesday, during an appearance on MSNBC's \"Morning Joe,\" Senate Minority Leader Chuck Schumer (D-NY) complained that President Donald Trump was moving the United States toward an \"autocracy.\"\nThe post Schumer: Trump Sending Military to Cities Is Moving U.…",
    "link": "https://www.breitbart.com/clips/2025/10/01/schumer-trump-sending-military-to-cities-is-moving-u-s-into-an-autocracy/",
    "timestamp": "2025-10-01T18:11:54Z"
  },
  {
    "title": "Trump: US cities should be military ‘training grounds’",
    "description": "What happened\nPresident Donald Trump and Defense Secretary Pete Hegseth Tuesday addressed hundreds of U.S. generals and admirals hastily summoned from around the world to a Marine Corps base in Quantico, Virginia. Hegseth said he planned to toughen physical f…",
    "link": "https://biztoc.com/x/d9e55dc445e3ce6d",
    "timestamp": "2025-10-01T18:11:37Z"
  },
  {
    "title": "Trump Deploys National Guard to Tackle ‘Mayhem’ at Oregon ICE Protests",
    "description": "President Donald Trump has announced that National Guard troops are on the ground in Oregon to tackle the \"lawless mayhem\" at the United States Immigration and Customs Enforcement (ICE) protests.\n\"We will never allow MOBS to take over our streets, burn our Ci…",
    "link": "https://biztoc.com/x/77000b0ec95691dc",
    "timestamp": "2025-10-01T18:11:13Z"
  },
  {
    "title": "EU Leaders Discuss Building a ‘Drone Wall’ After ‘Hybrid Attack’",
    "description": "Several NATO countries have seen mysterious drones flying in their airspace that many have pinned on Russian intrusions.",
    "link": "https://gizmodo.com/eu-leaders-discuss-building-a-drone-wall-after-hybrid-attack-2000666173",
    "timestamp": "2025-10-01T18:10:07Z"
  },
  {
    "title": "Time to step up pressure on Russia's oil exports: G7",
    "description": "Group of Seven nations are closing in on an agreement to significantly increase sanctions on Russia over its reluctance to end the war against Ukraine, according to a draft statement. \"We are aligned on the need to act together and believe that now is the tim…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/time-to-step-up-pressure-on-russias-oil-exports-g7/articleshow/124264657.cms",
    "timestamp": "2025-10-01T18:07:26Z"
  },
  {
    "title": "The government shutdown is likely to cement additional Fed interest rate cuts",
    "description": "Chair Jerome Powell and his fellow central bankers likely will err on the side of caution, which would be a bias towards easing.",
    "link": "https://www.cnbc.com/2025/10/01/lockdown-fed-interest-rates.html",
    "timestamp": "2025-10-01T18:07:09Z"
  },
  {
    "title": "Someone against abortion but in favor of death penalty ‘is not really pro-life,’ Pope Leo says",
    "description": "Pope Leo XIV intervened for the first time in an abortion dispute roiling the U.S. Catholic Church by raising the seeming contradiction over what it really means to be “pro-life.”",
    "link": "https://www.pbs.org/newshour/world/someone-against-abortion-but-in-favor-of-death-penalty-is-not-really-pro-life-pope-leo-says",
    "timestamp": "2025-10-01T18:06:34Z"
  },
  {
    "title": "As Trump punts on medical debt, battle over patient protections moves to states",
    "description": "Bills to shield patients from medical debt failed this year in several states.",
    "link": "https://www.bostonherald.com/2025/10/01/medical-debt-patient-protections/",
    "timestamp": "2025-10-01T18:05:22Z"
  },
  {
    "title": "As Trump punts on medical debt, battle over patient protections moves to states",
    "description": "Bills to shield patients from medical debt failed this year in several states.",
    "link": "https://www.denverpost.com/2025/10/01/medical-debt-patient-protections/",
    "timestamp": "2025-10-01T18:05:22Z"
  },
  {
    "title": "‘I’m Not Wealthy’: Democrat Refuses To Forgo Pay During Shutdown As His Own Staff Goes Unpaid",
    "description": "Democrats drove the federal government into a shutdown after blocking a GOP spending bill, but at least one Democrat says he won’t be giving up his paycheck.",
    "link": "https://dailycaller.com/2025/10/01/im-not-wealthy-democrat-refuses-to-forgo-pay-during-shutdown-as-his-own-staff-goes-unpaid/",
    "timestamp": "2025-10-01T18:05:18Z"
  },
  {
    "title": "Commits USA to defending Qatar security...",
    "description": "Commits USA to defending Qatar security...\r\n\n \n \n \n (Second column, 5th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:UPDATE: Trump signing executive orders at historic rate...\r\nMore than Biden, Obama, Bush, Clinton, Reagan -- COMBINED!\r\n\n \r\n\n \n \n Drudge Report F…",
    "link": "https://www.cnn.com/2025/10/01/politics/trump-qatar-security-order",
    "timestamp": "2025-10-01T18:04:38Z"
  },
  {
    "title": "OpenAI's new social app is filled with terrifying Sam Altman deepfakes | TechCrunch",
    "description": "OpenAI's new social app is filled with terrifying Sam Altman deepfakes | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2025/10/01/openais-new-social-app-is-filled-with-terrifying-sam-altman-deepfakes/",
    "timestamp": "2025-10-01T18:04:30Z"
  },
  {
    "title": "AIPAC’s and Israel’s influence is falling in Congress, two opposing letters show just how much",
    "description": "Two dueling congressional letters on Palestinian statehood reveal how toxic Israel has become among Democrats and show just how far AIPAC's influence has fallen in Washington.",
    "link": "https://mondoweiss.net/2025/10/aipacs-and-israels-influence-is-falling-in-congress-two-opposing-letters-show-just-how-much/",
    "timestamp": "2025-10-01T18:03:55Z"
  },
  {
    "title": "Marine Veteran Flat Out Calls Donald Trump ‘An Idiot’ Over Controversial Military Decision",
    "description": "“Only, again, an idiot like Donald Trump would believe that such a thing could happen,” Sen. Ruben Gallego said.",
    "link": "https://www.huffpost.com/entry/ruben-gallego-criticizes-trump-military-suggestion_n_68dd43c7e4b0f3800bcda446",
    "timestamp": "2025-10-01T18:03:27Z"
  },
  {
    "title": "Kayleigh McEnany Gives Brandon Johnson ‘Constitutional Law’ Lesson About Trump Deploying National Guard",
    "description": "“Outnumbered” co-host Kayleigh McEnany delivered a fact check to Democratic Mayor Brandon Johnson of Chicago over the deployment of National Guard troops.",
    "link": "https://dailycaller.com/2025/10/01/kayleigh-mcenany-gives-brandon-johnson-constitutional-law-lesson-about-trump-deploying-national-guard/",
    "timestamp": "2025-10-01T18:02:38Z"
  },
  {
    "title": "Twenty Thoughts on the Government Shutdown",
    "description": "It’s long past time that Democrats pick a fight with Trump. This one comes with some pretty serious risks.",
    "link": "https://slate.com/news-and-politics/2025/10/government-shutdown-democrats-trump-republicans.html",
    "timestamp": "2025-10-01T18:01:37Z"
  },
  {
    "title": "US plan opens door, endgame a long shot",
    "description": "Donald Trump's Gaza peace plan, though imperfect and vague on governance and Palestinian statehood, offers a potential respite from violence. While key actors have mixed reactions, many nations welcome it for humanitarian aid access. International and regiona…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/us-plan-opens-door-endgame-a-long-shot/articleshow/124264591.cms",
    "timestamp": "2025-10-01T18:01:28Z"
  },
  {
    "title": "Coffee Break: Shutdown, Clampdown, Clownshow or Horror Movie?",
    "description": "Trump, Hegseth and Russell Vought are clamping down and lashing out as the US government shuts down, but how much is clown show and how much is horror?",
    "link": "https://www.nakedcapitalism.com/2025/10/trump-hegseth-vought-shutdown-clampdown.html",
    "timestamp": "2025-10-01T18:00:34Z"
  },
  {
    "title": "WH: Taking stake in US firms Trump's 'creative solution'",
    "description": "White House Press Secretary Karoline Leavitt said on Wednesday that United States President Donald Trump came up with a \"creative solution\" for the government to take a stake in US companies in order ...",
    "link": "https://biztoc.com/x/81f866859d7ae134",
    "timestamp": "2025-10-01T18:00:09Z"
  },
  {
    "title": "GOOGLE AI blocks results for 'Trump cognitive decline?'",
    "description": "Google appears to have blocked certain artificial intelligence search results for queries about President Donald Trump’s mental acuity",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/google-trump-ai-search-cognitive-decline-biden-b2837381.html",
    "timestamp": "2025-10-01T18:00:04Z"
  },
  {
    "title": "'Chinese Trump' wins fans and followers with his spot-on impersonation",
    "description": "It’s unclear how soon President Donald Trump will visit China, but in the meantime, China has Ryan Chen.",
    "link": "https://www.nbcnews.com/world/asia/chinese-trump-impersonator-wins-fans-followers-rcna231559",
    "timestamp": "2025-10-01T18:00:00Z"
  },
  {
    "title": "Trump Pledges U.S. Defense For Qatar Amid Middle East Tensions",
    "description": "President Donald Trump has pledged that any armed attack on Qatar will be treated as a threat to U.S. security, according to an executive order published Wednesday.\nThe order allows U.S. forces to intervene if necessary to defend Qatar, which hosts the larges…",
    "link": "https://biztoc.com/x/7c85dd727f895947",
    "timestamp": "2025-10-01T17:59:53Z"
  },
  {
    "title": "Trump administration freezes $18 billion for NYC infrastructure projects",
    "description": "President Donald Trump’s administration said Wednesday it was putting a hold on roughly $18 billion to fund a new rail tunnel beneath the Hudson River between New York City and New Jersey and the city’s expanded Second Avenue subway project because of the gov…",
    "link": "https://biztoc.com/x/76d90bc8cbe72a49",
    "timestamp": "2025-10-01T17:59:41Z"
  },
  {
    "title": "‘Nobody Can Take A Joke Anymore’: C-SPAN Caller Cracks Up Over Trump’s Posts Of Hakeem Jeffries In Sombrero",
    "description": "A male Republican C-SPAN caller laughed about Donald Trump's Truth Social posts featuring edits of Hakeem Jeffries donning a sombrero and sporting a mustache.",
    "link": "https://dailycaller.com/2025/10/01/nobody-can-take-a-joke-anymore-c-span-caller-cracks-up-over-trumps-posts-of-hakeem-jeffries-in-sombrero/",
    "timestamp": "2025-10-01T17:54:37Z"
  },
  {
    "title": "Disgraced Madison Cawthorn Is Running For Congress Again — This Time in Florida",
    "description": "He’s running on issues like “end woke ideology.”",
    "link": "https://www.huffpost.com/entry/disgraced-madison-cawthorn-is-running-for-congress-again-this-time-in-florida_n_68dd504ae4b0f3800bcdb7b8",
    "timestamp": "2025-10-01T17:52:26Z"
  },
  {
    "title": "Reagan-Appointed Judge Torches Trump Admin’s Bullshit Chilling Effects Campaign Against Pro-Palestinian Speech",
    "description": "We’ve spent plenty of time talking about various people who are failing to meet this moment, but I will say that a number of district court judges have really been stepping up. The latest example is Reagan-appointed conservative Judge William Young (who had p…",
    "link": "https://www.techdirt.com/2025/10/01/reagan-appointed-judge-torches-trump-admins-bullshit-chilling-effects-campaign-against-pro-palestinian-speech/",
    "timestamp": "2025-10-01T17:50:50Z"
  },
  {
    "title": "Cuban foreign minister says Rubio’s ‘personal’ agenda in Latin America risks Trump’s peace prospects",
    "description": "Rubio and U.S. officials have accused Cuba's leaders of running a dictatorship.",
    "link": "https://www.bostonherald.com/2025/10/01/cuba-foreign-minister/",
    "timestamp": "2025-10-01T17:50:05Z"
  },
  {
    "title": "Is Now The Time to Attract Long-Term Investment for Domestic Production?",
    "description": "One of President Donald Trump’s once-stated goals around tariffs has been increased domestic manufacturing.\nBut, at times, the end goals—and the industries the president wants to impact most—have been convoluted. Trump seems to have a vested interest in compe…",
    "link": "https://biztoc.com/x/ccc8981640b77e5c",
    "timestamp": "2025-10-01T17:49:28Z"
  },
  {
    "title": "Economists relieved as White House withdraws controversial pick to lead Bureau of Labor Statistics",
    "description": "Donald Trump wanted EJ Antoni to head agency, but critics said he was too partisan and ‘exceedingly unqualified’\nUS government shutdown – live updates\nEconomists are expressing relief that the White House withdrew its nomination for head of the Bureau of Labo…",
    "link": "https://biztoc.com/x/8c019ac3d1a254ff",
    "timestamp": "2025-10-01T17:48:49Z"
  },
  {
    "title": "Gavin Newsom Drops Four-Word Smackdown on Vance’s Claim About Democrats Wanting ‘Free Health Care for Illegals’ - NewsBreak",
    "description": "California Gov. Gavin Newsom was blunt in his response to a false claim by Vice President JD Vance that Democrats are demanding a \"$1.5 trillion spending p",
    "link": "https://www.newsbreak.com/share/4263924422759-gavin-newsom-drops-four-word-smackdown-on-vance-s-claim-about-democrats-wanting-free-health-care-for-illegals?s=a2&amp;share_destination_id=MTEwMzgwNjM3LTE3NTkzNDA4NjM3MDA%3D&amp;pd=07T92rSi&amp;hl=en_US&amp;send_time=1759340863&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.38.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-10-01T17:48:49Z"
  },
  {
    "title": "Right-Wing Terror Attacks Plunged in 2025, While Left-Wing Attacks Ticked Up: Study",
    "description": "From 2011 through 2024, an average of 20 right-wing terror incidents took place each year, compared to an average of nearly three left-wing incidents annually.The number of right-wing terror attacks in the U.S. plunged dramatically in the first half of 2025, …",
    "link": "https://freerepublic.com/focus/f-news/4343740/posts",
    "timestamp": "2025-10-01T17:47:44Z"
  },
  {
    "title": "EU leaders discuss 'drone wall' to repel Russia after airspace violations",
    "description": "EU leaders met in Copenhagen to discuss bolstering eastern defenses against Russian drone intrusions, following recent airspace violations in Denmark and Poland. Ursula von der Leyen's \"drone wall\" proposal gained support, though some leaders urged a broader,…",
    "link": "https://economictimes.indiatimes.com/news/defence/eu-leaders-discuss-drone-wall-to-repel-russia-after-airspace-violations/articleshow/124264339.cms",
    "timestamp": "2025-10-01T17:47:27Z"
  },
  {
    "title": "20 state AGs sue Trump administration over rule that bars aid to some sex abuse and rape survivors",
    "description": "New York Attorney General Letitia James and 19 other states announced they are suing the Trump administration to block new restrictions on federal funding to help some victims of sexual assault and domestic violence.",
    "link": "https://www.nbcnews.com/news/us-news/20-state-ags-sue-trump-administration-rule-bars-aid-sex-abuse-rape-sur-rcna234786",
    "timestamp": "2025-10-01T17:47:27Z"
  },
  {
    "title": "Fired rail board member sues Trump over removal",
    "description": "WASHINGTON (Reuters) -A member of the Surface Transportation Board fired by President Donald Trump in August filed suit on Wednesday, challenging his removal...",
    "link": "https://www.yahoo.com/news/articles/fired-rail-board-member-sues-174654820.html",
    "timestamp": "2025-10-01T17:46:54Z"
  },
  {
    "title": "Exclusive: Team Trump Scored Nearly One Billion Views in September, Crushing Official Democrat Accounts",
    "description": "The Team Trump social media accounts, led by Alex Breusewitz and his firm X Strategies, drew nearly 1 billion views across platforms in September, continuing to outperform official Democratic Party accounts.\nThe post Exclusive: Team Trump Scored Nearly One Bi…",
    "link": "https://www.breitbart.com/politics/2025/10/01/exclusive-team-trump-scored-nearly-1-billion-views-september-crushing-official-democrat-accounts/",
    "timestamp": "2025-10-01T17:46:44Z"
  },
  {
    "title": "US Patent and Trademark office to lay off 1% of its workforce, agency letter says",
    "description": "(Reuters) -The U.S. Patent and Trademark Office will lay off about 1% of its workforce of over 14,000 employees as the agency continues to operate amid a...",
    "link": "https://www.yahoo.com/news/articles/us-patent-trademark-office-lay-174641421.html",
    "timestamp": "2025-10-01T17:46:41Z"
  },
  {
    "title": "Trump's peace deal could end the war in Gaza or Netanyahu's career",
    "description": "Israeli Prime Minister Benjamin Netanyahu accepts President Donald Trump's Gaza peace plan despite facing coalition collapse from right-wing members opposing concessions to Hamas.",
    "link": "https://www.foxnews.com/world/trumps-peace-deal-could-end-war-gaza-netanyahus-career",
    "timestamp": "2025-10-01T17:45:22Z"
  },
  {
    "title": "Trump halts money for NYC infrastructure projects, says minority contract rules are unconstitutional",
    "description": "The new Hudson River tunnel will one day bring the promise of better rail service to Manhattan.\n \n\nThe U.S. Department of Transportation suggested requirements for minority- and women-owned businesses to receive contracts for New York's largest public works p…",
    "link": "https://gothamist.com/news/trump-halts-money-for-nyc-infrastructure-projects-says-minority-contract-rules-are-unconstitutional",
    "timestamp": "2025-10-01T17:45:00Z"
  },
  {
    "title": "Newsom Drops Wild AI Attacks Of His Own, Targeting JD Vance And Sofas",
    "description": "“Hello and welcome to my show, A History of Couches. I'm your host, JD Vance, and we've got a special episode for you today.\"\nThe post Newsom Drops Wild AI Attacks Of His Own, Targeting JD Vance And Sofas first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/newsom-drops-wild-ai-attacks-of-his-own-targeting-jd-vance-and-sofas/",
    "timestamp": "2025-10-01T17:44:24Z"
  },
  {
    "title": "Trump administration puts on hold $18 billion in funding for New York City infrastructure projects",
    "description": "President Donald Trump is putting a hold on $18 billion in funding for New York City rail projects because of the government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-administration-puts-hold-18-billion-funding-new-126125727",
    "timestamp": "2025-10-01T17:42:30Z"
  },
  {
    "title": "Looming health insurance spikes for millions are at the heart of the government shutdown",
    "description": "The federal government's shut down centers around Democrats insisting that any deal addressing their health care demands and Republicans saying those negotiations can wait until the government is funded",
    "link": "https://abcnews.go.com/Health/wireStory/looming-health-insurance-spikes-millions-heart-government-shutdown-126125734",
    "timestamp": "2025-10-01T17:42:30Z"
  },
  {
    "title": "New Mexico Democrats rush to shore up safety net programs after federal cuts",
    "description": "New Mexico's Democratic lawmakers are vowing urgent action to shore up safety net spending in a top state for participation in Medicaid and federal food assistance",
    "link": "https://abcnews.go.com/Health/wireStory/new-mexico-democrats-rush-shore-safety-net-programs-126104321",
    "timestamp": "2025-10-01T17:42:20Z"
  },
  {
    "title": "South Korea’s president calls for more self-reliant military as questions arise about US commitment",
    "description": "South Korea plans to increase next year’s defense spending by 8.2%.",
    "link": "https://www.bostonherald.com/2025/10/01/south-korea-military/",
    "timestamp": "2025-10-01T17:41:53Z"
  },
  {
    "title": "Social Security, airports, food stamps: How are you affected during a government shutdown?",
    "description": "Fox News Digital gathered a summary of what services will remain open, and which could see serious disruptions or interruptions, during a government shutdown.",
    "link": "https://www.foxnews.com/politics/social-security-airports-food-stamps-how-you-affected-during-government-shutdown",
    "timestamp": "2025-10-01T17:41:46Z"
  },
  {
    "title": "US Government Shutdown Explained: Who Gets Paid and Who Misses Out?",
    "description": "The US federal government has shut down after lawmakers failed to agree on a funding bill, leaving hundreds of thousands of employees without pay while members of Congress continue receiving salaries.",
    "link": "https://www.ibtimes.com/us-government-shutdown-explained-who-gets-paid-who-misses-out-3785077",
    "timestamp": "2025-10-01T17:40:50Z"
  },
  {
    "title": "Explosive Video: Trojan Horses in the Fields of Education and Psychology Undermine War Secretary Hegseth’s Objective to Remove ‘Toxic Ideological Garbage’",
    "description": "President Donald Trump and War Secretary Pete Hegseth have claimed Diversity, Equity, and Inclusion (DEI) initiatives are finished, but is that really the case?\nThe post Explosive Video: Trojan Horses in the Fields of Education and Psychology Undermine War Se…",
    "link": "https://www.thegatewaypundit.com/2025/10/explosive-video-trojan-horses-fields-education-psychology-undermine/",
    "timestamp": "2025-10-01T17:40:01Z"
  },
  {
    "title": "Looming health insurance spikes for millions are at the heart of the government shutdown",
    "description": "At issue are tax credits set to expire at the end of the year.",
    "link": "https://www.bostonherald.com/2025/10/01/government-shutdown-health-care-explained/",
    "timestamp": "2025-10-01T17:39:33Z"
  },
  {
    "title": "'That's your job!' CNN's Dana Bash repeatedly thwacks Mike Johnson's shutdown excuses",
    "description": "CNN's Dana Bash grilled House Speaker Mike Johnson (R-LA) over the government shutdown in a testy exchange.Johnson sat down with the \"Inside Politics\" host on Wednesday to discuss the GOP congressional majority's inability to pass a budget to keep the governm…",
    "link": "https://www.rawstory.com/mike-johnson-government-shutdown/",
    "timestamp": "2025-10-01T17:38:38Z"
  },
  {
    "title": "Walmart to phase out synthetic dyes in its US private label food brands",
    "description": "The big box retailer is the latest company to join a slew of others to cut back on additives under White House pressure.",
    "link": "https://www.aljazeera.com/economy/2025/10/1/walmart-to-phase-out-synthetic-dyes-in-its-us-private-label-food-brands",
    "timestamp": "2025-10-01T17:38:04Z"
  },
  {
    "title": "Chuck Norris Conquers 10,000-Foot Volcano At 85-Years-Old",
    "description": "Chuck Norris just climbed an active volcano. At 85-years-old. The martial arts legend and Walker, Texas Ranger star hiked Lassen Peak, a 10,457-foot volcano in Northern California’s Lassen Volcanic National Park last month, and he posted photos on Instagram t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343737/posts",
    "timestamp": "2025-10-01T17:37:51Z"
  },
  {
    "title": "Elon Musk prepares Grokipedia as Wikipedia reflects left-wing views",
    "description": "Musk , said the new service will be a \"massive improvement\" to the internet encyclopedia\nThe post Elon Musk prepares Grokipedia as Wikipedia reflects left-wing views appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/01/elon-musk-prepares-grokipedia-because-wikipedia-reflects-left-wing-views/",
    "timestamp": "2025-10-01T17:37:23Z"
  },
  {
    "title": "Democrats' health care demands are at the heart of the government shutdown",
    "description": "The federal government's shut down centers around Democrats insisting that any deal addressing their health care demands and Republicans saying those negotiations can wait until the government is funded. At issue are tax credits that have made health insuranc…",
    "link": "https://apnews.com/article/health-care-subsidies-congress-shutdown-democrats-republicans-bb3464820a347fd2c0399e78e335881e",
    "timestamp": "2025-10-01T17:36:07Z"
  },
  {
    "title": "Official 2026 World Cup match ball: FIFA, Adidas to unveil 'Trionda' with similarities controversial to Jabulani",
    "description": "The official Adidas match ball for the tournament will be at center stage for a record number of games through the summer of 2026, with 104 matches to be played on North American pitches.",
    "link": "https://www.sportingnews.com/us/soccer/news/official-2026-world-cup-match-ball-fifa-adidas-trionda/5bf367d901fdc40efa8128d2",
    "timestamp": "2025-10-01T17:34:47Z"
  },
  {
    "title": "Gold prices soar to new records amid US government shutdown",
    "description": "As uncertainty deepens amid the U.S. government’s first shutdown in almost seven years, the gold frenzy continues to climb to new heights",
    "link": "https://abcnews.go.com/Business/wireStory/gold-prices-soar-new-records-amid-us-government-126125395",
    "timestamp": "2025-10-01T17:34:28Z"
  },
  {
    "title": "Bank of Canada expects to release baseline projections for economy, inflation in October - minutes of meeting",
    "description": "The Bank of Canada expects to release baseline projections for the economy and inflation with its monetary policy report in October, its summary of...",
    "link": "https://finance.yahoo.com/news/bank-canada-expects-release-baseline-173334742.html",
    "timestamp": "2025-10-01T17:33:34Z"
  },
  {
    "title": "Trump administration puts on hold $18 billion in funding for New York City infrastructure projects",
    "description": "WASHINGTON (AP) — President Donald Trump’s administration said Wednesday it was putting a hold on roughly $18 billion to fund a new rail tunnel beneath the Hudson River between New York City and New Jersey and the city’s expanded Second Avenue subway project …",
    "link": "https://financialpost.com/pmn/trump-administration-puts-on-hold-18-billion-in-funding-for-new-york-city-infrastructure-projects",
    "timestamp": "2025-10-01T17:31:50Z"
  },
  {
    "title": "Rents down, vacancies up as Trump’s immigration policies hit Doral",
    "description": "In Doral, the vacancy rate is up to 6.5 percent, and rents have hit a three-year low. Yes, the Miami market is cooling, but Doral is facing more than just a slowdown. About 40 percent of Doral’s 80,000 residents were born in Venezuela or have Venezuelan herit…",
    "link": "https://therealdeal.com/miami/2025/10/01/rents-down-vacancies-up-as-trumps-crackdown-hits-doral/",
    "timestamp": "2025-10-01T17:30:00Z"
  },
  {
    "title": "Trump’s efforts to bring down Fed Reserve’s Lisa Cook over alleged mortgage fraud highlights risks to all homeowners",
    "description": "Your home is private, not your mortgage.",
    "link": "https://finance.yahoo.com/news/trump-efforts-bring-down-fed-173000507.html",
    "timestamp": "2025-10-01T17:30:00Z"
  },
  {
    "title": "Is Now The Time to Attract Long-Term Investment for Domestic Production?",
    "description": "Experts from Ferrara Manufacturing, the University of Delaware and the USFMA weighed in on onshoring at Sourcing Journal's Fall Summit.",
    "link": "https://sourcingjournal.com/topics/trade/domestic-manufacturing-apparel-tariffs-ferrara-usfma-university-of-delaware-1234782134/",
    "timestamp": "2025-10-01T17:30:00Z"
  },
  {
    "title": "Trump Keeps Oil Permits Flowing in Shutdown, Some Renewables on Hold",
    "description": "The Trump administration will keep oil and gas permitting moving unhindered, despite the federal government shutdown that began on Wednesday, while approvals for renewable energy projects will halt, according to Interior Department plans seen by industry medi…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Keeps-Oil-Permits-Flowing-in-Shutdown-Some-Renewables-on-Hold.html",
    "timestamp": "2025-10-01T17:30:00Z"
  },
  {
    "title": "Japan’s lead trade negotiator defends tariffs deal with the US",
    "description": "Unlike the EU, Japan did not have to lower its tariffs on U.S. goods.",
    "link": "https://www.bostonherald.com/2025/10/01/japan-us-trade/",
    "timestamp": "2025-10-01T17:28:55Z"
  },
  {
    "title": "White House memo says Democrats' plan could spend $200B on healthcare for illegal immigrants",
    "description": "A White House memo argues that repealing healthcare provisions from the Working Families Tax Cut Act would fund healthcare for illegal immigrants and non-citizens.",
    "link": "https://www.foxnews.com/politics/white-house-memo-says-democrats-plan-could-spend-200b-healthcare-illegal-immigrants",
    "timestamp": "2025-10-01T17:28:48Z"
  },
  {
    "title": "Trump order pledges that US will defend Qatar in event of attack",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump has pledged to treat any armed attack on Qatar as a threat to the United States' own security, according to...",
    "link": "https://www.yahoo.com/news/articles/trump-order-pledges-us-defend-172845830.html",
    "timestamp": "2025-10-01T17:28:45Z"
  },
  {
    "title": "The ugly motivation behind the White House’s war against inspectors general",
    "description": "Inspectors general exist as instruments of accountability. It’s precisely why Donald Trump and the White House have come to see them as obstacles and enemies.",
    "link": "https://biztoc.com/x/3b215fbc98809db9",
    "timestamp": "2025-10-01T17:26:48Z"
  },
  {
    "title": "Walmart says it will remove artificial colors and other additives from store brands by 2027",
    "description": "Walmart says it plans to remove synthetic dyes and 30 other food additives from its store brands sold in the United States by January 2027.",
    "link": "https://www.pbs.org/newshour/nation/walmart-says-it-will-remove-artificial-colors-and-other-additives-from-store-brands-by-2027",
    "timestamp": "2025-10-01T17:26:37Z"
  },
  {
    "title": "Trump’s plan to make home sales tax-free benefits wealthiest households the most",
    "description": "Not long after U.S. housing prices reached a record high this summer – the median existing home went for US$435,000 in June – President Donald Trump said that he was considering a plan to make home sales tax-free.\nSupporters of the idea, introduced by U.S. Re…",
    "link": "https://biztoc.com/x/cf8b08ab04b858d8",
    "timestamp": "2025-10-01T17:26:35Z"
  },
  {
    "title": "Government shutdown update: Democrats insist on health care demands",
    "description": "At issue are tax credits that have made health insurance through the Affordable Care Act more affordable for millions of people.",
    "link": "https://www.pennlive.com/politics/2025/10/government-shutdown-update-democrats-insist-on-health-care-demands.html",
    "timestamp": "2025-10-01T17:26:25Z"
  },
  {
    "title": "Nolte: 154,000 Bureaucrats Finally Exit Federal Payroll This Week",
    "description": "The 154,000 federal bureaucrats who accepted President Trump’s buyouts will all be removed from the federal payroll this week.\nThe post Nolte: 154,000 Bureaucrats Finally Exit Federal Payroll This Week appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/01/nolte-154000-bureaucrats-finally-exit-federal-payroll-this-week/",
    "timestamp": "2025-10-01T17:25:14Z"
  },
  {
    "title": "Trump Sure Picked Some Convenient Projects to Exclude From Shutdown",
    "description": "President Donald Trump intends to shield his sweeping immigration enforcement operations from the effects of the government shutdown, as well as other key facets of his policy agenda, Politico reported Wednesday.Through a series of interviews with former and …",
    "link": "https://newrepublic.com/post/201201/donald-trump-protect-trade-immigration-shutdown",
    "timestamp": "2025-10-01T17:25:04Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Briefing",
    "description": "Trump Press Secretary Karoline Leavitt speaks with reporters at the White House on Wednesday, October 1.\nThe post Watch Live: Karoline Leavitt Holds White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/01/watch-live-karoline-leavitt-holds-white-house-press-briefing-30/",
    "timestamp": "2025-10-01T17:23:44Z"
  },
  {
    "title": "Outrage Over How ICE Tricked Newlyweds Speaks to 'Broader Pattern' Under Trump Agenda",
    "description": "Congresswoman Judy Chu was among many expressing anger on Tuesday evening over the Trump administration's detention of Barbara Gomes Marques, a film director who was detained by immigration agents last month after attending a \"properly scheduled\" meeting rega…",
    "link": "https://www.commondreams.org/news/is-ice-arresting-non-criminals",
    "timestamp": "2025-10-01T17:22:14Z"
  },
  {
    "title": "EPA’s job is to protect America’s air, water and land. Here’s how a shutdown affects that effort",
    "description": "The agency's mission to protect health and the environment is at risk without a budget.",
    "link": "https://www.bostonherald.com/2025/10/01/climate-shutdown-epa-explained/",
    "timestamp": "2025-10-01T17:22:14Z"
  },
  {
    "title": "Gold prices soar to new records amid US government shutdown",
    "description": "As uncertainty deepens amid the U.S. government's first shutdown in almost seven years, the gold frenzy continues to climb to new heights.  The going price...",
    "link": "https://finance.yahoo.com/news/gold-prices-soar-records-amid-172153624.html",
    "timestamp": "2025-10-01T17:21:53Z"
  },
  {
    "title": "How the Government Shutdown Will End",
    "description": "How will the government shutdown end? Republicans could erode Democratic unity, or Trump may cut a deal on Obamacare subsidies. Either way, an extremely long shutdown is likely.",
    "link": "http://nymag.com/intelligencer/article/how-the-government-shutdown-will-end.html",
    "timestamp": "2025-10-01T17:21:29Z"
  },
  {
    "title": "Supreme Court Blocks Trump From Immediately Firing Fed Governor",
    "description": "The US Supreme Court on Wednesday barred Donald Trump from immediately firing Federal Reserve Governor Lisa Cook, as the president mounts multiple challenges that have tested the independence of the central bank.",
    "link": "https://www.ibtimes.com/supreme-court-blocks-trump-immediately-firing-fed-governor-3785072",
    "timestamp": "2025-10-01T17:21:15Z"
  },
  {
    "title": "Walmart plans to remove artificial colors and other food additives from store brands by 2027",
    "description": "Walmart said the 14-month reformulation plan primarily would involve its largest private-label food brand, Great Value.",
    "link": "https://abc30.com/post/walmart-plans-remove-artificial-colors-other-food-additives-store-brands-2027/17917719/",
    "timestamp": "2025-10-01T17:20:59Z"
  },
  {
    "title": "Trump Begs Oregon Governor 'Get Your State in Order' in Leaked Texts as Prez Sends in National Guard to Stop 'Unmitigated Disaster'",
    "description": "Donald Trump is sick of Oregon, it seems, as he raged at the state's governor in new text messages.",
    "link": "https://radaronline.com/p/trump-oregon-governor-leaked-texts-national-guard-disaster/",
    "timestamp": "2025-10-01T17:20:00Z"
  },
  {
    "title": "The 2026 Midterms: The issues that may define next year’s elections",
    "description": "As we approach the halfway point between the 2024 presidential election and the 2026 midterm elections, Peter Finn highlights five themes that, given the current political milieu, may define the midterms: Trump and the GOP’s post-Trump path, political violenc…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/10/01/the-2026-midterms-the-issues-that-may-define-next-years-elections/",
    "timestamp": "2025-10-01T17:19:30Z"
  },
  {
    "title": "Judge rules Trump illegally targeted Gaza protesters",
    "description": "The Trump administration’s push to arrest and deport international students for supporting Palestine is deemed illegal",
    "link": "https://theweek.com/politics/judge-rules-trump-illegally-targeted-gaza-protesters",
    "timestamp": "2025-10-01T17:19:29Z"
  },
  {
    "title": "Kimmel and Colbert appear on each other's shows",
    "description": "US late-night hosts Jimmy Kimmel and Stephen Colbert have appeared on one another's shows in a \"fun\" format that Kimmel said would \"drive the president nuts\".",
    "link": "https://www.rte.ie/entertainment/2025/1001/1536335-kimmel-and-colbert-appear-on-each-others-shows/",
    "timestamp": "2025-10-01T17:19:25Z"
  },
  {
    "title": "Tesla Raises Lease Prices On Most Popular Models After The Death Of The $7,500 EV Tax Credit",
    "description": "Tesla is in a tough spot right now.",
    "link": "https://www.jalopnik.com/1984191/tesla-raises-lease-prices-ev-tax-credit/",
    "timestamp": "2025-10-01T17:18:57Z"
  },
  {
    "title": "‘Injudicious’: Constitutional expert calls out leftist judges for putting politics in decisions",
    "description": "'Bizarre' anti-Trump handling of case actually is 'tedious and prejudicial'",
    "link": "https://www.wnd.com/2025/10/constitutional-expert-calls-leftist-judges-putting-politics-decisions/",
    "timestamp": "2025-10-01T17:18:15Z"
  },
  {
    "title": "Howard Lutnick Rips Jeffrey Epstein Pals as ‘Participants’ — Changes Subject When Asked If Trump Knew He Was a Pervert",
    "description": "Howard Lutnick tore into Jeffrey Epstein pals like Bill Gates as \"participating\" in Epstein's activities, but changed the subject when asked if Trump knew.\nThe post Howard Lutnick Rips Jeffrey Epstein Pals as ‘Participants’ — Changes Subject When Asked If Tru…",
    "link": "https://www.mediaite.com/media/podcasts/lutnick-rips-jeffrey-epstein-pals-as-participants-changes-subject-when-asked-if-trump-knew-he-was-a-pervert/",
    "timestamp": "2025-10-01T17:16:23Z"
  },
  {
    "title": "The Government Has Shut Down. Now What?",
    "description": "A government shutdown began at midnight following President Trump’s and congressional Republicans’ failure to cut a deal with Democrats. What does that mean for you? Keep reading to find out.",
    "link": "http://www.thecut.com/article/government-shutdown-what-happens-now.html",
    "timestamp": "2025-10-01T17:16:14Z"
  },
  {
    "title": "David Courcelle, Trump nominee for New Orleans-area U.S. Attorney, advances in Senate",
    "description": "WASHINGTON – The U.S. Senate Judiciary Committee forwarded Wednesday the nomination of David Courcelle as the U.S. Attorney for the Eastern District of Louisiana based in New Orleans.",
    "link": "https://www.theadvocate.com/baton_rouge/news/david-courcelle-nomination-as-us-attorney-clears-hurdle/article_470e4345-8a0b-5f13-b730-81808e225460.html",
    "timestamp": "2025-10-01T17:16:00Z"
  },
  {
    "title": "Vote to end government shutdown fails in Senate as Democrats hold firm on health care demands",
    "description": "A vote to end the government shutdown has failed. Democrats in the Senate held firm Wednesday to the party's demands to fund health care subsidies that President Donald Trump and Republicans refuse to provide. But the tally showed cracks in the Democrats' res…",
    "link": "https://www.krgv.com/news/vote-to-end-government-shutdown-fails-in-senate-as-democrats-hold-firm-on-health-care-demands/",
    "timestamp": "2025-10-01T17:15:26Z"
  },
  {
    "title": "Inside the push to cash in on Trump's deportation campaign",
    "description": "The first time a Pennsylvania consultant named Charles Sowell connected with border czar Tom Homan was when Sowell reached out on LinkedIn in 2021, looking for advice about border contracting work. Homan had finished a stint as acting director of Immigration …",
    "link": "https://www.rawstory.com/inside-the-push-to-cash-in-on-the-trump-administrations-deportation-campaign/",
    "timestamp": "2025-10-01T17:14:38Z"
  },
  {
    "title": "Stephen Colbert Shows Jimmy Kimmel Clip of the Moment He Learned His Show Was Suspended - The Hollywood Reporter",
    "description": "Stephen Colbert Shows Jimmy Kimmel Clip of the Moment He Learned His Show Was SuspendedThe Hollywood Reporter Kimmel and Colbert appear as guests on each other’s showsNPR Internet Reacts to Jimmy Kimmel Posing With Seth Meyers & Stephen ColbertYahoo 'Hi Donal…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179616628",
    "timestamp": "2025-10-01T17:12:48Z"
  },
  {
    "title": "I'm Very Curious About How MAGA Will Try To Explain Away This Look At How Donald Trump's Economy Is Going...",
    "description": "I'm keeping track of Trump's economy right here. Every month. Enjoy!View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/tracking-trumps-economy-august",
    "timestamp": "2025-10-01T17:12:29Z"
  },
  {
    "title": "Climate, Money, Markets, And Trump’s ‘Stupid People’ U.N. Remark",
    "description": "Climate scientists are not stupid. Rather, stupidity is preventing climate science, money, and markets from creating a rational response to global warming.",
    "link": "https://www.forbes.com/sites/hershshefrin/2025/10/01/climate-money-markets-and-trumps-stupid-people-un-remark/",
    "timestamp": "2025-10-01T17:11:28Z"
  },
  {
    "title": "US Senate Fails to Advance House-passed Bill on Funding Another Time",
    "description": "WASHINGTON (Sputnik) – The US Senate failed on Wednesday to advance the bill on federal government funding, which the House already approved.",
    "link": "https://sputnikglobe.com/20251001/us-senate-fails-to-advance-house-passed-bill-on-funding-another-time-1122895751.html",
    "timestamp": "2025-10-01T17:11:15Z"
  },
  {
    "title": "Midvale mom arrested, accused of 'child torture' of 4-month-old baby",
    "description": "A Midvale mother was arrested Tuesday after police say was torturing her 4-month-old baby daughter by doing such things as burning her face, taping her mouth shut and taping her hands behind her back. Lizbeth Hurtado-Breton, 36, was booked into the Salt Lake …",
    "link": "https://freerepublic.com/focus/f-chat/4343733/posts",
    "timestamp": "2025-10-01T17:11:11Z"
  },
  {
    "title": "US Supreme Court to hear arguments in Trump bid to fire Fed's Cook; leaves her in job for now",
    "description": "(Reuters) -The U.S. Supreme Court said on Wednesday it will hear arguments in January over Donald Trump's attempt to remove Federal Reserve Governor Lisa...",
    "link": "https://www.yahoo.com/news/articles/us-supreme-court-hear-arguments-171018045.html",
    "timestamp": "2025-10-01T17:10:18Z"
  },
  {
    "title": "Vote to end government shutdown fails in Senate as Democrats hold firm on health care demands",
    "description": "A vote to end the government shutdown hours after it began failed Wednesday, as Democrats in the Senate held firm to the party’s demands to fund health care subsidies that",
    "link": "https://www.wpsdlocal6.com/news/vote-to-end-government-shutdown-fails-in-senate-as-democrats-hold-firm-on-health-care/article_2e64e341-0b94-41bb-aabf-4adeda4c2be0.html",
    "timestamp": "2025-10-01T17:08:53Z"
  },
  {
    "title": "Donald Trump responds to the dedication made to him by the European team after winning the Ryder Cup",
    "description": "Donald Trump responded to the European Ryder Cup team who dedicated a video to him after their 15-13 victory over the United States. Led by Rory McIlroy, the players recorded thems",
    "link": "https://www.marca.com/en/golf/ryder-cup/2025/10/01/68dd5ef6268e3e66518b45fe.html",
    "timestamp": "2025-10-01T17:08:32Z"
  },
  {
    "title": "'Put Working People First,' Says AFL-CIO Angered by Trump Agenda and Government Shutdown",
    "description": "The largest federation of labor unions in the United States called out President Donald Trump's administration on Wednesday after a government shutdown began at midnight following failed votes on competing congressional funding bills.\"The federal government i…",
    "link": "https://www.commondreams.org/news/republican-government-shutdown",
    "timestamp": "2025-10-01T17:08:13Z"
  },
  {
    "title": "Trump: US cities should be military ‘training grounds’",
    "description": "In a hastily assembled summit, Trump said he wants the military to fight the ‘enemy within’ the US",
    "link": "https://theweek.com/politics/trump-hegseth-military-speech-generals",
    "timestamp": "2025-10-01T17:05:52Z"
  }
]