[
  {
    "title": "Ontario has no plans to sell off stored U.S. alcohol for charity, Ford says",
    "description": "Ontario Premier Doug Ford says his government has no plan to sell off a stockpile of American alcohol sitting in storage to benefit charities over the holiday season, for fear it could harm local producers.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-not-selling-u-s-alcohol-for-charity-9.7016718",
    "timestamp": "2025-12-15T20:26:20Z"
  },
  {
    "title": "DeSantis warns of dangers of AI, calls for state regulation",
    "description": "Gov. DeSantis repeated calls for Florida to regulate AI. He also said President Trump’s executive order aimed to block states from crafting AI regulations wouldn’t get in Florida’s way.",
    "link": "https://www.sun-sentinel.com/2025/12/15/desantis-warns-of-dangers-of-ai-calls-for-florida-to-regulate-the-technology/",
    "timestamp": "2025-12-15T20:25:49Z"
  },
  {
    "title": "Trump: Ukraine peace is closer than ever",
    "description": "United States President Donald Trump said on Monday that the peace in Ukraine is \"closer now\" than it has ever been.More to come......",
    "link": "https://biztoc.com/x/93723544a682c328",
    "timestamp": "2025-12-15T20:25:32Z"
  },
  {
    "title": "Donald Trump Had Personal Connection to Rob Reiner's Wife Michele",
    "description": "Rob and Michele Reiner were found dead in their Los Angeles home on Sunday evening.",
    "link": "https://biztoc.com/x/d8b2ab114f308a72",
    "timestamp": "2025-12-15T20:25:28Z"
  },
  {
    "title": "“Donald Trump is a Very Sick Man,” Says Gavin Newsom - Internet Asks If He Meant Health or Rhetoric",
    "description": "It wasn’t clear if Gavin Newsom was referring to the condition of Trump’s health or of he was cryptically slamming Trump for his distasteful post",
    "link": "https://www.inquisitr.com/donald-trump-is-a-very-sick-man-says-gavin-newsom-internet-asks-if-he-meant-health-or-rhetoric",
    "timestamp": "2025-12-15T20:25:06Z"
  },
  {
    "title": "Trump says Rob Reiner died of ‘Trump derangement syndrome’",
    "description": "President Trump is being condemned by both sides of the political aisle after saying that Hollywood director Rob Reiner and his wife Michele were killed due to \"Trump Derangement Syndrome.\"",
    "link": "https://www.foxla.com/news/trump-rob-reiner-died-trump-derangement-syndrome",
    "timestamp": "2025-12-15T20:24:43Z"
  },
  {
    "title": "'Skyrocketed!' CNN data analyst taken aback as 'massive shift' spells bad news for Trump",
    "description": "There has been a “massive shift” in the party Americans trust more on inflation, one of the top issues in the country.CNN forecaster Harry Enten revealed on Monday that a strong majority of Americans now believe that when it comes to fighting inflation, the c…",
    "link": "https://www.rawstory.com/alternet-posts/trump-democrats/",
    "timestamp": "2025-12-15T20:24:43Z"
  },
  {
    "title": "Rob Reiner’s Graceful Reaction to Charlie Kirk’s Murder Resurfaces in Wake of Trump’s ‘Vile’ Attack on Late Director | Video",
    "description": "\"It’s beyond belief what happened to him and that should never happen to anybody,\" Reiner said of the Sept. 10 assassination\nThe post Rob Reiner’s Graceful Reaction to Charlie Kirk’s Murder Resurfaces in Wake of Trump’s ‘Vile’ Attack on Late Director | Video …",
    "link": "https://www.thewrap.com/rob-reiner-charlie-kirk-response-resurfaces-trump-post/",
    "timestamp": "2025-12-15T20:23:18Z"
  },
  {
    "title": "Kim Jong-un Confirms North Koreans Are Dying on Mine-Clearing Duty in Ukraine War",
    "description": "Communist dictator Kim Jong-un of North Korea held a welcome back ceremony for soldiers serving in the battlefield of the Russian invasion of Ukraine this weekend, acknowledging a regiment believed to have been helping clear landmines in which at least nine s…",
    "link": "https://www.breitbart.com/asia/2025/12/15/kim-jong-un-confirms-north-koreans-are-dying-on-mine-clearing-duty-in-ukraine-war/",
    "timestamp": "2025-12-15T20:23:08Z"
  },
  {
    "title": "Watch Live: Donald Trump Presents the Mexican Border Defense Medal",
    "description": "President Donald Trump presents the Mexican Border Defense Medal on Monday, December 15.\nThe post Watch Live: Donald Trump Presents the Mexican Border Defense Medal appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/12/15/watch-live-donald-trump-presents-the-mexican-border-defense-medal/",
    "timestamp": "2025-12-15T20:18:16Z"
  },
  {
    "title": "Do Voters Trust Supreme Court To Do What’s Best For U.S.? Yes, But Just Barely: I&I/TIPP Poll",
    "description": "Americans mostly trust the nation’s highest court to do what’s best, presumably by scrupulously following the laws enshrined in the 238-year-old U.S. Constitution. But that trust could be tested in coming months, as the Supreme Court decides whether President…",
    "link": "https://freerepublic.com/focus/f-chat/4357521/posts",
    "timestamp": "2025-12-15T20:15:29Z"
  },
  {
    "title": "Trump's religious freedom nominee is being held up by a former political foe, his allies say",
    "description": "In April, President Donald Trump nominated Mark Walker to head his administration’s efforts on global religious freedom.",
    "link": "https://www.nbcnews.com/politics/congress/trumps-religious-freedom-nominee-held-former-political-foe-allies-say-rcna248871",
    "timestamp": "2025-12-15T20:15:22Z"
  },
  {
    "title": "Trump Says Tariffs Have Brought in $18 Trillion. That's Impossible",
    "description": "In recent weeks, President Donald Trump has inflated his previous claims about how lucrative tariffs have been for the United States.\nTrump's new figure: An astonishing $18 trillion.\nTrump first used the \"$18 trillion\" figure during a cabinet meeting on Decem…",
    "link": "https://biztoc.com/x/8f25a35f5abb2bd2",
    "timestamp": "2025-12-15T20:14:37Z"
  },
  {
    "title": "Trump vows to fight ‘fraud’ in SNAP benefits for 42 million Americans",
    "description": "President Donald Trump ’s administration is talking tough about SNAP, saying the government’s biggest food aid program is riddled with fraud that must be stopped.\nHis appointees are looking at Supplemental Nutrition Assistance Program from an enforcement pers…",
    "link": "https://biztoc.com/x/7181d08839a9bf03",
    "timestamp": "2025-12-15T20:14:31Z"
  },
  {
    "title": "Rob Reiner’s Heartfelt Comments on Charlie Kirk’s Murder Go Viral After His Own Tragic Murder",
    "description": "Rob Reiner's gracious words about the death of Charlie Kirk went viral Monday following news that the director and his wife had been found murdered.\nThe post Rob Reiner’s Heartfelt Comments on Charlie Kirk’s Murder Go Viral After His Own Tragic Murder first a…",
    "link": "https://www.mediaite.com/media/news/rob-reiners-heartfelt-comments-on-charlie-kirks-murder-go-viral-after-his-own-tragic-murder/",
    "timestamp": "2025-12-15T20:14:28Z"
  },
  {
    "title": "Trump-Appointed SEC Chair Leads Crypto Policy Pivot, But Not Everyone's A Fan",
    "description": "The SEC’s pivot on cryptocurrency enforcement after Donald Trump returned to office in January has sparked a heated debate between industry veterans and market observers.\nSEC Drops Majority Of Inherited Crypto Cases\nThe New York Times on Sunday reported that …",
    "link": "https://biztoc.com/x/49308c0848340f64",
    "timestamp": "2025-12-15T20:14:18Z"
  },
  {
    "title": "Republicans splinter as Trump struggles to lead, grows more unpopular",
    "description": "A few weeks ago, Donald Trump published a familiar boast to his social media platform. “The Republican Party has never been so UNITED AS IT IS RIGHT NOW!” the president wrote.\nFor those who keep up on Trump’s rhetoric, the claim reflected a familiar problem: …",
    "link": "https://biztoc.com/x/bbc9102f352f89cd",
    "timestamp": "2025-12-15T20:14:07Z"
  },
  {
    "title": "Dazed MAGA loyalists 'extremely disappointed' by Trump's surprise pardon of Texas Dem",
    "description": "Zapata County Republican Chairwoman Jennifer Thatcher was shocked when she learned earlier this month that President Donald Trump had pardoned Rep. Henry Cuellar, freeing him from legal peril for the federal corruption charges he faced.By pardoning Cuellar, s…",
    "link": "https://www.rawstory.com/texas-loyalists-dismayed-as-trump-make-surprise-pardon/",
    "timestamp": "2025-12-15T20:13:52Z"
  },
  {
    "title": "Europe proposes Ukraine peace force as Zelensky hails progress with US",
    "description": "European leaders on Dec. 15 proposed a European-led \"multinational force\" with U.S. support to enforce a potential peace deal in Ukraine, as key powers met in Berlin to push forward efforts to end the war.",
    "link": "https://www.hurriyetdailynews.com/europe-proposes-ukraine-peace-force-as-zelensky-hails-progress-with-us-216848",
    "timestamp": "2025-12-15T20:12:11Z"
  },
  {
    "title": "Why the House Republicans’ health care ‘plan’ isn’t a serious health care plan",
    "description": "GOP lawmakers want to be able to say, “See? We unveiled a plan,” and this helps them check a box in the most superficial way possible.",
    "link": "https://www.ms.now/rachel-maddow-show/maddowblog/why-the-house-republicans-health-care-plan-isnt-a-serious-health-care-plan",
    "timestamp": "2025-12-15T20:11:32Z"
  },
  {
    "title": "Trump Fans On Truth Social Attack President’s Terrible Rob Reiner Post",
    "description": "The pushback to the president's Reiner rant was unusual considering the platform only exists to give him full reign to express his thoughts to the MAGA faithful without being criticized.",
    "link": "https://www.huffpost.com/entry/trump-fans-attack-his-rob-reiner-post-on-truth-social_n_69404943e4b0fa125e7f39b3",
    "timestamp": "2025-12-15T20:10:04Z"
  },
  {
    "title": "Rob Reiner’s Legacy Includes Directing Two Great Aaron Sorkin Screenplays: ‘A Few Good Men’ and ‘The American President’",
    "description": "Reiner never got a Best Director Oscar nod, but he sure knew how to make scripts by Oscar winner Aaron Sorkin cook.",
    "link": "https://decider.com/2025/12/15/rob-reiner-aaron-sorkin/",
    "timestamp": "2025-12-15T20:10:00Z"
  },
  {
    "title": "‘Only A Little Over 100’: Chinese Billionaire Started US-Born Baby Empire Using US Surrogates",
    "description": "A growing number of Chinese nationals are turning to U.S. surrogates to have children on American soil, taking advantage of largely unregulated surrogacy market.",
    "link": "https://dailycaller.com/2025/12/15/chinese-billionaire-tried-to-build-us-born-baby-empire-as-overseas-elites-turn-to-american-surrogates/",
    "timestamp": "2025-12-15T20:07:10Z"
  },
  {
    "title": "Here Are the Fox News Stars Horrified by Trump’s Gloating Post About Rob Reiner’s Murder",
    "description": "Most everyone on social media united to condemn Trump for using the occasion of the Reiners' deaths to gloat, including the following Fox News personalities.\nThe post Here Are the Fox News Stars Horrified by Trump’s Gloating Post About Rob Reiner’s Murder fir…",
    "link": "https://www.mediaite.com/media/news/here-are-the-fox-news-stars-horrified-by-trumps-gloating-post-about-rob-reiners-murder/",
    "timestamp": "2025-12-15T20:07:04Z"
  },
  {
    "title": "Trump Blames Rob Reiner for His Own Murder",
    "description": "This morning’s Truth Social post was nauseating even by the president’s standards.",
    "link": "https://www.theatlantic.com/newsletters/2025/12/trump-derangement-syndrome-rob-reiner-murder/685268/",
    "timestamp": "2025-12-15T20:07:00Z"
  },
  {
    "title": "MTG’s Last Legislative Push Before Resigning House Seat Aims to Deliver on MAGA Promise",
    "description": "The House of Representatives is set to vote on a bill from Rep. Marjorie Taylor Greene, R-Ga., designed to protect children nationally from transgender procedures... Read More\nThe post MTG’s Last Legislative Push Before Resigning House Seat Aims to Deliver on…",
    "link": "https://www.dailysignal.com/2025/12/15/mtgs-last-legislative-push-before-resigning-house-seat-aims-to-deliver-on-maga-promise/",
    "timestamp": "2025-12-15T20:05:39Z"
  },
  {
    "title": "Small businesses say Trump tariffs are hurting this group of consumers this holiday season—here’s what is getting more expensive",
    "description": "Consumers' estimated gift budgets decreased $229 between October and November, according to a Gallup index.",
    "link": "https://fortune.com/2025/12/15/small-businesses-trump-tariffs-are-hurting-consumers-holiday-season/",
    "timestamp": "2025-12-15T20:05:17Z"
  },
  {
    "title": "Trump vows to fight ‘fraud’ in SNAP benefits for 42 million Americans",
    "description": "“It's always something that goes wrong,” Jamal Brown, a 41-year-old food stamp participant said, “unfortunately.”",
    "link": "https://fortune.com/2025/12/15/trump-accuses-snap-benefits-of-fraud-government-shutdown/",
    "timestamp": "2025-12-15T20:04:54Z"
  },
  {
    "title": "Kushner backs out of plan to build Trump hotel in Serbia",
    "description": "United States President Donald Trump's son-in-law Jared Kushner backed out of his plans to build a Trump-branded real-estate project in Belgrade, Serbia, following the backlash from the local populati...",
    "link": "https://biztoc.com/x/74bf884c24177c3c",
    "timestamp": "2025-12-15T20:03:05Z"
  },
  {
    "title": "Stephen Miller Announces Chilling Hunt for “Fifth Column”",
    "description": "Stephen Miller made an odious threat on X Monday against “the violent fifth column of domestic terrorists” after the Department of Justice announced it had stopped a bombing plot in California.“Following the issuance of NSPM-7 vast government resources have b…",
    "link": "https://newrepublic.com/post/204449/stephen-miller-fifth-column",
    "timestamp": "2025-12-15T20:02:47Z"
  },
  {
    "title": "America’s Most Popular Celebrities Able To Get More Done Than Congress",
    "description": "America's most popular celebrities are better able to get things done than Congress.",
    "link": "https://dailycaller.com/2025/12/15/american-celebrities-hollywood-kim-kardashian-nicki-minaj-congress-effective-persuasion/",
    "timestamp": "2025-12-15T20:02:28Z"
  },
  {
    "title": "Casino plans for Mets ballpark, golf course Trump once ran awarded gambling licenses",
    "description": "The New York Mets’ ballpark, a Bronx golf course once operated by President Donald Trump’s company and a slot parlor near John F. Kennedy International Airport will be the sites of New York City’s first Las Vegas-style resort casinos",
    "link": "https://abcnews.go.com/US/wireStory/casino-plans-mets-ballpark-golf-trump-ran-3-128425383",
    "timestamp": "2025-12-15T20:02:20Z"
  },
  {
    "title": "Conservative Influencers Blame Brown University Shooting on a “Leftist Activist”",
    "description": "On Saturday, a gunman opened fire on the campus of Brown University in Providence, Rhode Island, killing two students and wounding nine more. The shooter escaped, and students sheltered in place overnight as authorities tried to track down a person of interes…",
    "link": "https://www.motherjones.com/politics/2025/12/conservative-influencers-blame-brown-university-shooting-on-a-leftist-activist/",
    "timestamp": "2025-12-15T20:01:20Z"
  },
  {
    "title": "Evangelical Leader Says Trump’s Rob Reiner Post Represents ‘The Shame of our Generation’",
    "description": "How this vile, disgusting, and immoral behavior has become normalized in the United States is something our descendants will study in school, to the shame of our generation.”\nThe post Evangelical Leader Says Trump’s Rob Reiner Post Represents ‘The Shame of ou…",
    "link": "https://www.mediaite.com/politics/evangelical-leader-says-trumps-rob-reiner-post-represents-the-shame-of-our-generation/",
    "timestamp": "2025-12-15T20:01:09Z"
  },
  {
    "title": "Jeanine Pirro's ‘investigation’ into DC crime statistics ends without criminal charges",
    "description": "Jeanine Pirro, the U.S. attorney for the District of Columbia, announced she was ending an investigation into crime statistics in D.C. without filing criminal charges.In August, President Donald Trump claimed that \"D.C. gave Fake Crime numbers in order to cre…",
    "link": "https://www.rawstory.com/pirro-dc-crime-statistics/",
    "timestamp": "2025-12-15T20:00:56Z"
  },
  {
    "title": "Trump levels political attack on Rob Reiner in inflammatory post after his killing",
    "description": "President Donald Trump on Monday blamed Rob Reiner's outspoken opposition to the president for the actor-director’s killing.",
    "link": "https://www.boston.com/culture/politics/2025/12/15/trump-political-attack-rob-reiner/",
    "timestamp": "2025-12-15T20:00:06Z"
  },
  {
    "title": "Why Trump won’t fire his scandal-plagued Cabinet in his second term",
    "description": "President Donald Trump is keeping a controversy-ridden Cabinet in place, not because it’s working, but because he refuses to admit he made bad hires, according to a Washington Post analysis. Unlike his first term’s revolving door of firings, Trump’s second ad…",
    "link": "https://www.rawstory.com/trumps/",
    "timestamp": "2025-12-15T20:00:02Z"
  },
  {
    "title": "Amid Trump’s Proposed Pipeline Safety Rollbacks, Senator Questions Regulators’ Industry Ties",
    "description": "After reporting by ProPublica revealed industry connections among Transportation Department regulators and showed how they are seeking to loosen oil and gas pipeline safety regulations, Sen. Maria Cantwell is demanding answers.",
    "link": "http://www.propublica.org/article/trump-dot-oil-gas-pipeline-ethics-questions-senator-cantwell",
    "timestamp": "2025-12-15T20:00:00Z"
  },
  {
    "title": "Tokyo Gas to Invest in USA Downstream Assets",
    "description": "Tokyo Gas Co., Japan's biggest distributor of the fuel, plans to invest in U.S. downstream assets.",
    "link": "https://www.rigzone.com/news/wire/tokyo_gas_to_invest_in_usa_downstream_assets-15-dec-2025-182536-article/",
    "timestamp": "2025-12-15T20:00:00Z"
  },
  {
    "title": "Jake Tapper Says He Constantly Covers Trump’s Missteps Because He Dropped Ball On Biden’s Decline",
    "description": "Jake Tapper said that he frequently covers President Donald Trump's missteps on his show because he failed to adequately scrutinize Joe Biden's decline.",
    "link": "https://dailycaller.com/2025/12/15/jake-tapper-covers-trumps-missteps-because-bidens-decline/",
    "timestamp": "2025-12-15T19:57:55Z"
  },
  {
    "title": "Former Instacart employee says she was fired over her Democratic congressional campaign",
    "description": "The fired employee's lawyers say Instacart's actions align with how corporate America has sought to curry favor with the Trump administration.",
    "link": "https://www.cnbc.com/2025/12/15/instacart-lawsuit-congress-campaign-trump.html",
    "timestamp": "2025-12-15T19:57:28Z"
  },
  {
    "title": "U.S. Senate passes bill to pay Michigan tribe $34M for 150-year-old land theft",
    "description": "This Michigan tribe in the Upper Peninsula is finally close to getting justice for land stolen from them 150 years ago.",
    "link": "https://www.mlive.com/news/2025/12/us-senate-passes-bill-to-pay-michigan-tribe-34m-for-150-year-old-land-theft.html",
    "timestamp": "2025-12-15T19:56:40Z"
  },
  {
    "title": "Trump’s Rob Reiner post on Truth Social undercuts Republicans’ claims to civility",
    "description": "One of the downsides of serving in President Donald Trump’s movement is that the moral high ground is extremely unsteady terrain.",
    "link": "https://www.cnn.com/2025/12/15/politics/trump-rob-reiner-truth-social-post",
    "timestamp": "2025-12-15T19:55:10Z"
  },
  {
    "title": "Trump Says Tariffs Have Brought in $18 Trillion. That's Impossible.",
    "description": "The tariffs have generated less than $300 billion in new tax revenue, and other claimed investments don't come close to the president's tally.",
    "link": "https://reason.com/2025/12/15/trump-says-tariffs-have-brought-in-18-trillion-thats-impossible/",
    "timestamp": "2025-12-15T19:54:50Z"
  },
  {
    "title": "Observers say Honduran election fair, but urge faster count",
    "description": "Observers from the Americas and Europe said Monday there was no reason to suspect fraud in the recent Honduran election but criticized a sluggish vote count, as US President Donald Trump’s preferred candidate maintained a slim lead. The Central American count…",
    "link": "https://www.digitaljournal.com/world/observers-say-honduran-election-fair-but-urge-faster-count/article",
    "timestamp": "2025-12-15T19:52:20Z"
  },
  {
    "title": "From ‘Spinal Tap’ to ‘A Few Good Men,’ Nobody Had a Career Like Rob Reiner | Appreciation",
    "description": "The actor-turned-director released a brilliant string of classics, across wildly different genres, solidifying his place in film history\nThe post From ‘Spinal Tap’ to ‘A Few Good Men,’ Nobody Had a Career Like Rob Reiner | Appreciation appeared first on TheWr…",
    "link": "https://www.thewrap.com/rob-reiner-career-appreciation/",
    "timestamp": "2025-12-15T19:49:27Z"
  },
  {
    "title": "Ukraine claims strike on Russian submarine in Novorossiysk with sea drones",
    "description": "Kyiv says Kilo-class submarine is knocked out of operation in the first such attack using Sea Baby drones.",
    "link": "https://www.aljazeera.com/news/2025/12/15/ukraine-claims-it-struck-russian-submarine-in-novorossiysk-in-a-war-first",
    "timestamp": "2025-12-15T19:47:58Z"
  },
  {
    "title": "Iran’s currency plummets to new low, sparking fears of higher food prices",
    "description": "The depreciation is worsening inflation, driving up prices for essentials and straining household budgets.",
    "link": "https://www.pbs.org/newshour/world/irans-currency-plummets-to-new-low-sparking-fears-of-higher-food-prices",
    "timestamp": "2025-12-15T19:47:57Z"
  },
  {
    "title": "17 Ways Politicians Can Make Things Cheaper, Starting With Food, Health Care, and Appliances",
    "description": "High costs stem from up in supply-choking regulation. To lower costs, officials should cut the red tape that inflates these prices.",
    "link": "https://reason.com/2025/12/16/17-ways-politicians-can-make-things-cheaper-starting-with-food-health-care-and-appliances/",
    "timestamp": "2025-12-15T19:47:11Z"
  },
  {
    "title": "Laura Loomer Also Says Rob Reiner’s Trump Derangement Syndrome Led to His Death: ‘A Mental Health Crisis’",
    "description": "\"Trump is right. Reiner himself sounded insane when he would speak. Imagine how crazy his own kid was... on drugs,\" she writes, echoing the president's own controversial take\nThe post Laura Loomer Also Says Rob Reiner’s Trump Derangement Syndrome Led to His D…",
    "link": "https://www.thewrap.com/rob-reiner-dead-trump-derangement-syndrome-laura-loomer/",
    "timestamp": "2025-12-15T19:46:00Z"
  },
  {
    "title": "Report: Linda McMahon Was Backstage For WWE SNME",
    "description": "United States Secretary of Education Linda McMahon was reportedly in attendance for John Cena's last match at WWE Saturday Night's Main Event.",
    "link": "https://www.wrestlinginc.com/2052750/wwe-snme-linda-mcmahon-attendance/",
    "timestamp": "2025-12-15T19:45:49Z"
  },
  {
    "title": "North Carolina Ousts Entire Library Board Over Book With Trans Kid",
    "description": "North Carolina’s Randolph County chose to dissolve its entire library board rather than allow a book about a trans child to sit on the shelves. Last week, the county Board of Commissioners voted 3–2 last week to dismiss every single member of the library boar…",
    "link": "https://newrepublic.com/post/204446/north-carolina-library-board-book-trans-kid",
    "timestamp": "2025-12-15T19:45:31Z"
  },
  {
    "title": "Swing District GOPers Suddenly Find a Spine Over Trump’s Reiner Post",
    "description": "Republicans in key swing states are peeling away from Donald Trump amid national backlash over his remarks about Rob Reiner’s murder.Reiner was found stabbed to death in his Los Angeles home Sunday alongside his wife, producer Michele Singer Reiner. Their son…",
    "link": "https://newrepublic.com/post/204451/swing-district-republicans-donald-trump-rob-reiner-post",
    "timestamp": "2025-12-15T19:43:00Z"
  },
  {
    "title": "Landman: Billy Bob Thornton Describes The View as a 'Bunch of Pissed Off Millionaires Bitching About' President Donald Trump",
    "description": "When T.L. (Sam Elliott) revealed he didn't know what the ABC talk show was, Tommy (Thornton) gave him a pointed description of it Taylor Sheridan got meta in the latest episode of Landman. During a phone call between estranged father and son, Tommy (Billy Bob…",
    "link": "https://freerepublic.com/focus/f-chat/4357518/posts",
    "timestamp": "2025-12-15T19:42:59Z"
  },
  {
    "title": "Trump condemned for saying critical filmmaker brought on own murder",
    "description": "Donald Trump faced a storm of condemnation on Monday after posting “perverse” and “sick” remarks suggesting Rob Reiner and his wife were murdered because of the celebrated filmmaker’s criticism of the US president. Among those shocked were some staunch Trump …",
    "link": "https://www.digitaljournal.com/world/trump-condemned-for-saying-critical-filmmaker-brought-on-own-murder/article",
    "timestamp": "2025-12-15T19:42:20Z"
  },
  {
    "title": "US military to use Trinidad airports, on Venezuela’s doorstep",
    "description": "The Caribbean nation of Trinidad and Tobago said Monday it had authorized US military aircraft to use its airports, amid growing fears Washington may be preparing an attack on nearby Venezuela. The archipelago of Trinidad and Tobago, situated just a dozen kil…",
    "link": "https://www.digitaljournal.com/world/us-military-to-use-trinidad-airports-on-venezuelas-doorstep/article",
    "timestamp": "2025-12-15T19:42:20Z"
  },
  {
    "title": "US officials tout progress in talks to reach 'lasting and durable peace' between Ukraine, Russia",
    "description": "President Trump has directed U.S. officials to help to facilitate a “lasting and durable peace\" between Ukraine and Russia, with officials touting the “very, very strong\" package presented for negotiations in Berlin over the weekend.",
    "link": "https://www.foxnews.com/politics/us-officials-tout-progress-talks-reach-lasting-durable-peace-between-ukraine-russia",
    "timestamp": "2025-12-15T19:42:11Z"
  },
  {
    "title": "AWAY WITH THE MANGER: How the left tries to weaponize Christmas against Trump",
    "description": "Season 'is about the birth of Jesus, not an excuse to demonize law enforcement'",
    "link": "https://www.wnd.com/2025/12/away-manger-how-left-tries-weaponize-christmas-against/",
    "timestamp": "2025-12-15T19:42:01Z"
  },
  {
    "title": "A day at the races: How Venezuelans find joy despite familiar political turmoil",
    "description": "Silk Eyes races past Mr. Thunder at the top of the stretch, thrilling the crowd at a racetrack in Venezuela’s capital",
    "link": "https://abcnews.go.com/International/wireStory/day-races-venezuelans-find-joy-despite-familiar-political-128426229",
    "timestamp": "2025-12-15T19:41:57Z"
  },
  {
    "title": "'Rich-poor asset ownership gap narrowing': Finance Minister",
    "description": "India's economy is growing robustly, narrowing the wealth gap. Finance Minister Nirmala Sitharaman highlighted this progress, noting India's status as the world's fastest-growing major economy. She also addressed concerns about state debts, emphasizing fiscal…",
    "link": "https://economictimes.indiatimes.com/news/india/rich-poor-asset-ownership-gap-narrowing-finance-minister/articleshow/125989983.cms",
    "timestamp": "2025-12-15T19:41:38Z"
  },
  {
    "title": "Trial begins for Wisconsin judge charged with helping man evade immigration agents",
    "description": "According to the FBI, Judge Dugan led Eduardo Flores-Ruiz out of her courtroom through a rear door when she learned immigration authorities were in the courthouse looking to arrest him.",
    "link": "https://www.pbs.org/newshour/nation/trial-begins-for-wisconsin-judge-charged-with-helping-man-evade-immigration-agents",
    "timestamp": "2025-12-15T19:38:18Z"
  },
  {
    "title": "Honduras Still Has No President-Elect Two Weeks After Vote",
    "description": "Honduras reached its second week on Monday without final results from the National Electoral Council (CNE) officially determining who won on November 30.\nThe post Honduras Still Has No President-Elect Two Weeks After Vote appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/12/15/honduras-still-has-no-president-elect-two-weeks-after-vote/",
    "timestamp": "2025-12-15T19:38:02Z"
  },
  {
    "title": "Nancy Pelosi Says Democrats Shouldn’t Try To Impeach Trump Again",
    "description": "Former House Speaker Nancy Pelosi (D-CA) admitted during a recent interview that she doesn’t believe her party should be chomping at the bit to impeach President Donald Trump in the next two years. Pelosi, who presided over the House through two impeachments …",
    "link": "https://freerepublic.com/focus/f-bloggers/4357517/posts",
    "timestamp": "2025-12-15T19:37:34Z"
  },
  {
    "title": "European leaders back 'multinational force' to secure peace in Ukraine",
    "description": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today.",
    "link": "https://news.sky.com/story/european-leaders-back-multinational-force-to-secure-peace-in-ukraine-as-us-commits-to-security-guarantees-13483879",
    "timestamp": "2025-12-15T19:35:00Z"
  },
  {
    "title": "U.S. SEC chief warns watchdogs need to be limited in tapping crypto's power to snoop",
    "description": null,
    "link": "https://www.coindesk.com/policy/2025/12/15/u-s-sec-chief-warns-watchdogs-need-to-be-limited-in-tapping-crypto-s-power-to-snoop",
    "timestamp": "2025-12-15T19:34:32Z"
  },
  {
    "title": "New York Young Republican Club gala draws white nationalist, far-right Germans as elected officials skip out",
    "description": "Two months after prominent members of a national Young Republican organization were exposed for their role in a hate-filled, private group chat, the city-based chapter showed it’s willing to welcome almost anyone. Inside Cipriani Wall Street, a lavish event s…",
    "link": "https://freerepublic.com/focus/f-chat/4357515/posts",
    "timestamp": "2025-12-15T19:31:36Z"
  },
  {
    "title": "Russia Now Open To Ukraine Joining EU, Officials Briefed On Peace Deal Say",
    "description": "Russia has expressed willingness to let Ukraine join the European Union (EU) as part of a future peace deal, U.S. officials told the DCNF",
    "link": "https://dailycaller.com/2025/12/15/russia-now-open-to-ukraine-joining-eu-officials-briefed-on-peace-deal-say/",
    "timestamp": "2025-12-15T19:30:28Z"
  },
  {
    "title": "Canada's Carney called out for 'utilizing' British spelling",
    "description": "A group of linguists are asking Prime Minister Carney to ditch British English in official documents, saying it is a matter of \"pride\".",
    "link": "https://www.bbc.com/news/articles/cj69d89l8l5o",
    "timestamp": "2025-12-15T19:29:49Z"
  },
  {
    "title": "Grok Is Making Wildly Contradictory Claims About Rob Reiner’s Death",
    "description": "Elon Musk's AI Grok is claiming that a post president Trump made about Rob Reiner's death was fake, while also claiming it was real.",
    "link": "http://futurism.com/artificial-intelligence/grok-rob-reiner-death",
    "timestamp": "2025-12-15T19:29:49Z"
  },
  {
    "title": "DOJ and California go to court over new congressional map designed to favor Democrats",
    "description": "California voters decisively approved the map last month. The Justice Department has accused California of racial gerrymandering by favoring Hispanic voters.",
    "link": "https://www.pbs.org/newshour/politics/doj-and-california-go-to-court-over-new-congressional-map-designed-to-favor-democrats",
    "timestamp": "2025-12-15T19:29:23Z"
  },
  {
    "title": "Peachtree Supplies $28M EB-5-Backed Construction Loan for North Carolina Hotel",
    "description": "Miami developer Morlin Group has sealed $28 million of construction financing backed by funding from the EB-5 visa program for the development of a Homewood Suites by Hilton in Sugar Mountain, N.C., Commercial Observer has learned. Peachtree Group originated …",
    "link": "http://commercialobserver.com/2025/12/homewood-suites-hilton-sugar-mountain-north-carolina-eb-5/",
    "timestamp": "2025-12-15T19:28:40Z"
  },
  {
    "title": "Ex-Obama Aide Eviscerates Susie Wiles' Plan For Trump In 2026 Midterms",
    "description": "“I don’t think Donald Trump is physically able,” the strategist said on MS NOW’s “The Weekend.”",
    "link": "https://www.huffpost.com/entry/ameshia-cross-susie-wiles-trump-2026-midterms_n_6940355fe4b02a9ef5176a3e",
    "timestamp": "2025-12-15T19:19:27Z"
  },
  {
    "title": "Republican Challenges Other GOPs to Stand Up to Trump After 'Sick' Response to Rob Reiner Killing",
    "description": "Kentucky representative Thomas Massie called Trump's statement on Reiner's death, \"inappropriate and disrespectful,\" challenging \"anyone to defend it.\"",
    "link": "https://www.ibtimes.com/republican-challenges-other-gops-stand-trump-after-sick-response-rob-reiner-killing-3792665",
    "timestamp": "2025-12-15T19:19:00Z"
  },
  {
    "title": "Trump is recruiting Big Tech workers for the government",
    "description": "President Donald Trump will recruit workers from Amazon, Apple, Google, Meta, Microsoft, and other tech giants to form the US Tech Force, a new program that aims to \"modernize the federal government,\" according to an announcement on Monday. Under the new prog…",
    "link": "https://www.theverge.com/news/844804/trump-tech-force-usds-apple-google-microsoft",
    "timestamp": "2025-12-15T19:18:48Z"
  },
  {
    "title": "U.S. Soldiers Killed in Syria Identified as Iowa National Guardsmen",
    "description": "The two soldiers killed by a solo gunman during a counterterrorism operation in Syria over the weekend have been identified as members of the Iowa National Guard, officials confirmed.\nThe post U.S. Soldiers Killed in Syria Identified as Iowa National Guardsme…",
    "link": "https://www.breitbart.com/national-security/2025/12/15/u-s-soldiers-killed-syria-identified-iowa-national-guardsmen/",
    "timestamp": "2025-12-15T19:17:33Z"
  },
  {
    "title": "Casino plans for Mets ballpark and golf course Trump once ran among 3 awarded NYC gambling licenses",
    "description": "NEW YORK (AP) — The New York Mets’ ballpark in Queens. A Bronx golf course once operated by President Donald Trump ‘s company. A slot parlor on a horse racing track near John F. Kennedy International Airport. The three disparate sites, located far from the to…",
    "link": "https://financialpost.com/pmn/casino-plans-for-mets-ballpark-and-golf-course-trump-once-ran-among-3-awarded-nyc-gambling-licenses",
    "timestamp": "2025-12-15T19:11:55Z"
  },
  {
    "title": "The Real Reason For Boat Strike ‘Double Taps’ Is Preventing Survivors From Challenging Extrajudicial Killings In Court",
    "description": "The Trump Administration’s murder-in-international-waters program debuted far ahead of its legal rationale. Many people inside the administration were blindsided by this sudden escalation. Those expected to stay on top of these things — military oversight, co…",
    "link": "https://www.techdirt.com/2025/12/15/the-real-reason-for-boat-strike-double-taps-is-preventing-survivors-from-challenging-extrajudicial-killings-in-court/",
    "timestamp": "2025-12-15T19:10:41Z"
  },
  {
    "title": "Rob Reiner mourned by Barack Obama, Jerry O’Connell, James Woods and many others",
    "description": "Many prominent people are paying tribute to Rob Reiner and his wife Michele.",
    "link": "https://www.bostonherald.com/2025/12/15/obit-rob-reiner-reactions/",
    "timestamp": "2025-12-15T19:09:15Z"
  },
  {
    "title": "Honduras election official says ‘disturbances’ preventing vote recount",
    "description": "Statement comes as regional body says no evidence of fraud in November vote that Trump-backed candidate Asfura leads.",
    "link": "https://www.aljazeera.com/news/2025/12/15/honduras-election-official-says-disturbances-preventing-vote-recount",
    "timestamp": "2025-12-15T19:08:51Z"
  },
  {
    "title": "Meidas: Trump Blows Up in Am and Can't Control His Rapid Decline",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump’s despicable behavior in the morning as he attacks Rob Reiner and his Michele Reiner after they were murdered and makes numerous other disturbing posts whole his term is an a rapid decline.",
    "link": "https://littlegreenfootballs.com/article/55139_Meidas-_Trump_Blows_Up_in_Am_a",
    "timestamp": "2025-12-15T19:08:50Z"
  },
  {
    "title": "Trump admin to hire 1,000 specialists for ‘Tech Force’ to build AI, finance projects",
    "description": "The Trump administration on Monday unveiled a new initiative dubbed the “U.S. Tech Force,” comprising about 1,000 engineers and other specialists who will work on artificial intelligence infrastructure and other technology projects throughout the federal gove…",
    "link": "https://freerepublic.com/focus/f-news/4357512/posts",
    "timestamp": "2025-12-15T19:08:06Z"
  },
  {
    "title": "Trump Can’t Insult Reporters When They Go After Him?",
    "description": "By Tim Graham via The Daily Signal | December 14, 2025\nPeople magazine and former Washington Post reporter Paul Farhi have made separate lists of insults President Donald Trump has recently lobbed at female reporters. It doesn’t matter how the journalists beh…",
    "link": "https://biztoc.com/x/183c9800a53fd28d",
    "timestamp": "2025-12-15T19:07:49Z"
  },
  {
    "title": "Niki Savva’s Earthquake is a damning account of the election that shook Australia",
    "description": "It became clear that “Team Dutton” was running on little more than bloke-energy, an unaffordable nuclear policy and, crazily, higher taxes.",
    "link": "https://theconversation.com/niki-savvas-earthquake-is-a-damning-account-of-the-election-that-shook-australia-270452",
    "timestamp": "2025-12-15T19:07:00Z"
  },
  {
    "title": "Trump's own marquee bill blamed for soaring energy costs: 'Driving prices up'",
    "description": "The cost-of-living has emerged as one of the biggest political headwinds facing Donald Trump in his second term, and according to a report from ABC News, his leadership has sent one particular cost soaring that will hit close to home, literally, for many: ene…",
    "link": "https://www.rawstory.com/alternet-posts/trump-energy-bills/",
    "timestamp": "2025-12-15T19:06:45Z"
  },
  {
    "title": "U.S. Army identifies 2 Iowa Guard members killed in weekend attack in Syria",
    "description": "The two Iowa National Guard members killed in a weekend attack that the U.S. military blamed on the Islamic State group in Syria were identified Monday.",
    "link": "https://www.cbc.ca/news/world/iowa-national-guard-members-identified-syria-attack-9.7016578",
    "timestamp": "2025-12-15T19:06:22Z"
  },
  {
    "title": "US Offers Security Deal in Ukraine Talks But Territory Still Key",
    "description": "US negotiators offered more substantial security guarantees to Kyiv as part of President Donald Trump’s renewed push to end the Russia-Ukraine war, but the effort still appeared part of a bid to pressure President Volodymyr Zelenskiy on territory.",
    "link": "https://financialpost.com/pmn/business-pmn/us-offers-security-deal-in-ukraine-talks-but-territory-still-key",
    "timestamp": "2025-12-15T19:06:00Z"
  },
  {
    "title": "‘There Has to Be Cause!’ Nancy Pelosi Rules Out Impeaching Trump — For Now",
    "description": "Nancy Pelosi blasted President Trump's second administration as \"corrupt\" — but said she is not ready to impeach the president for a third time, yet\nThe post ‘There Has to Be Cause!’ Nancy Pelosi Rules Out Impeaching Trump — For Now first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/there-has-to-be-cause-nancy-pelosi-rules-out-impeaching-trump-for-now/",
    "timestamp": "2025-12-15T19:04:16Z"
  },
  {
    "title": "Grimes claims ex Elon Musk blocked her on X amid co-parenting drama",
    "description": "The singer shares three children with the Tesla founder",
    "link": "https://www.the-independent.com/life-style/grimes-elon-musked-blocked-x-b2884945.html",
    "timestamp": "2025-12-15T19:03:51Z"
  },
  {
    "title": "New US National Security Strategy Designed to Show Europe Its Place - Lavrov",
    "description": "MOSCOW (Sputnik) - The new US national security strategy, adopted under President Donald Trump, is intended to show Europe its place and ensure it does not try to draw the United States into its machinations to promote a liberal order, Russian Foreign Ministe…",
    "link": "https://sputnikglobe.com/20251215/new-us-national-security-strategy-designed-to-show-europe-its-place---lavrov-1123302005.html",
    "timestamp": "2025-12-15T19:02:39Z"
  },
  {
    "title": "US Army names 2 slain Iowa National Guard members killed in Syria",
    "description": "The U.S. Army named them as Sgt. Edgar Brian Torres-Tovar, 25, of Des Moines, and Sgt. William Nathaniel Howard, 29, of Marshalltown.",
    "link": "https://nypost.com/2025/12/15/us-news/us-army-names-2-slain-iowa-national-guard-members-killed-in-syria/",
    "timestamp": "2025-12-15T19:00:35Z"
  }
]