[
  {
    "title": "Markets rise despite China-US tariff clash",
    "description": "Stock markets regained some ground Tuesday, even as trade tensions between the United States and China were strained by turmoil over President Donald Trump’s tariffs offensive. Trump rocked the world economy last week when he held up a chart in the White Hous…",
    "link": "https://www.digitaljournal.com/world/markets-rise-despite-china-us-tariff-clash/article",
    "timestamp": "2025-04-08T17:12:21Z"
  },
  {
    "title": "'Many failures': Whistleblower exposes how fired Biden-era official was soft on China, prioritized DEI",
    "description": "Fox News Digital spoke to former FDA senior staffer David Oliveira about the recent firing of a controversial official who directed tobacco policy at the FDA.",
    "link": "https://www.foxnews.com/politics/many-failures-whistleblower-exposes-how-biden-era-official-soft-china-prioritized-dei",
    "timestamp": "2025-04-08T17:12:10Z"
  },
  {
    "title": "Walmart is facing tariffs and recession fears, but it may have a secret weapon to keep growing",
    "description": "As tariffs roil the U.S. economy, Walmart may find safety in a new part of its business that’s driving more store traffic and online sales: its membership program, Walmart+.",
    "link": "https://www.nbcnews.com/business/business-news/walmart-facing-tariffs-recession-fears-may-secret-weapon-keep-growing-rcna200211",
    "timestamp": "2025-04-08T17:12:02Z"
  },
  {
    "title": "JLR evaluating various steps to respond to US tariffs: Tata Motors",
    "description": "Tata Motors' Jaguar Land Rover is strategizing responses to the US tariff implemented on April 2, 2025. JLR has paused UK vehicle shipments to the US to negotiate new trading terms. The US is a crucial market, accounting for 23% of JLR's FY24 sales.",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/jlr-evaluating-various-steps-to-respond-to-us-tariffs-tata-motors/articleshow/120102773.cms",
    "timestamp": "2025-04-08T17:11:53Z"
  },
  {
    "title": "Canadian oil and gas producers ‘looking through’ market volatility: CAPP CEO",
    "description": "CALGARY — The long term demand outlook for Canadian oil and gas is strong despite the recent plunge in crude prices and market upheaval, said the head of the country’s biggest oil and gas advocacy group. “The entire planet is dealing with the current market v…",
    "link": "https://financialpost.com/pmn/canadian-oil-and-gas-producers-looking-through-market-volatility-capp-ceo",
    "timestamp": "2025-04-08T17:11:15Z"
  },
  {
    "title": "The ripple effects of Trump’s tariffs compound Canada’s continuing economic headwinds",
    "description": "Opinion: The tariffs imposed on other countries are set to reverberate through the global economy, and Canada is far from immune. Read on",
    "link": "https://financialpost.com/news/economy/ripple-effects-of-tariffs-compound-canadas-economic-headwinds",
    "timestamp": "2025-04-08T17:10:18Z"
  },
  {
    "title": "Trump Raises Tariffs On China To 104%, Effective Tomorrow: White House",
    "description": "Donald Trump has followed through on his threat of &quot;additional 50 per cent tariffs&quot; on China starting Wednesday. The White House announced that this will make America&#039;s new tariff on China an unprecedented 104 per cent.",
    "link": "https://www.ndtv.com/world-news/trump-raises-tariffs-on-china-to-104-effective-tomorrow-white-house-8119172",
    "timestamp": "2025-04-08T17:10:06Z"
  },
  {
    "title": "Prophet of OOPS! Inverse-Brained Jim Cramer Does It Again With Botched ‘Black Monday’ Call",
    "description": "CNBC’s Mad Money host Jim Cramer may really be an inverted soothsayer, as yet another of his predictions went in the complete opposite direction. That’s probably what happens when your brain just happens to be screwed on backwards. Cramer was blowing whatever…",
    "link": "https://freerepublic.com/focus/f-bloggers/4309719/posts",
    "timestamp": "2025-04-08T17:10:05Z"
  },
  {
    "title": "Meet the World-Famous Economist Whose Jaw Dropped When He Learned Trump Used His Research to Tank Global Stock Markets",
    "description": "World-famous economist Brent Neiman is calling out Donald Trump and his administration for incorrectly using his data for the tariffs increased.",
    "link": "https://radaronline.com/p/economist-jaw-dropped-trump-global-stock-markets-brent-neiman/",
    "timestamp": "2025-04-08T17:10:00Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Briefing",
    "description": "Trump Press Secretary Karoline Leavitt speaks to reporters at the White House on Tuesday, April 8.\nThe post Watch Live: Karoline Leavitt Holds White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/08/watch-live-karoline-leavitt-holds-white-house-press-briefing-11/",
    "timestamp": "2025-04-08T17:09:58Z"
  },
  {
    "title": "The Supreme Court's Ruling on Deportations Is Not a Free Pass",
    "description": "The court lifted a block on deportating accused Venezuelan gang members for now. But that doesn’t mean the administration can go back to business as usual.",
    "link": "https://www.vanityfair.com/news/story/scotus-ruling-on-venezuelan-deportations",
    "timestamp": "2025-04-08T17:09:52Z"
  },
  {
    "title": "Trump tariffs 'will increase the unemployment rate to recessionary levels,' says economist",
    "description": "As a result of the Trump administration's new tariffs, U.S. job losses “could be in the millions,” says Harry Holzer, senior fellow at Brookings.",
    "link": "https://www.cnbc.com/2025/04/08/trump-tariffs-job-market-impact-will-mostly-be-negative-economists-say.html",
    "timestamp": "2025-04-08T17:09:30Z"
  },
  {
    "title": "Week of March 31 Cable News Ratings: MSNBC Has Its Most-Watched Week Since the Election",
    "description": "Fox News won the week overall, but MSNBC saw the most sizable gains, particularly in total day.",
    "link": "https://www.adweek.com/tvnewser/week-of-march-31-2025-cable-news-ratings/",
    "timestamp": "2025-04-08T17:09:30Z"
  },
  {
    "title": "Michael Moore Applauds Fan Art Contest Participant Who Turned Trump's 'Mouth and Face' into 'Literal Butthole'",
    "description": "Michael Moore thanked his fans for turning President Donald Trump's \"mouth and face\" into a \"literal butthole\" in a bizarre portrait contest that the 70-year-old filmmaker claims is \"truly impressive.\"\nThe post Michael Moore Applauds Fan Art Contest Participa…",
    "link": "https://www.breitbart.com/entertainment/2025/04/08/michael-moore-attacks-trump-with-immature-portrait-art-contest-impressed-with-fans-who-turned-presidents-mouth-and-face-into-literal-butthole/",
    "timestamp": "2025-04-08T17:09:05Z"
  },
  {
    "title": "Maine lawmakers send letter to Trump condemning Gov Janet Mills over trans athletes in girls' sports policies",
    "description": "A letter signed by 14 Maine state senators condemning Gov. Janet Mills was sent to the White House amid an ongoing battle over trans athlete policies.",
    "link": "https://www.foxnews.com/sports/maine-lawmakers-send-letter-trump-condemning-gov-janet-mills-over-trans-athlete-girls-sports-policies",
    "timestamp": "2025-04-08T17:09:03Z"
  },
  {
    "title": "Trump Is Trying to Axe Collective Bargaining for 1 Million Federal Employees",
    "description": "If Trump’s order withstands the legal challenges against it, two-thirds of the federal workforce will lose union rights.",
    "link": "https://truthout.org/articles/trump-is-trying-to-axe-collective-bargaining-for-1-million-federal-employees/",
    "timestamp": "2025-04-08T17:08:37Z"
  },
  {
    "title": "Supreme Court blocks order requiring Trump administration to reinstate thousands of federal workers",
    "description": "The Supreme Court has blocked an order for the Trump administration to return to work thousands of federal employees who were let go in mass firings aimed at dramatically downsizing the federal government.",
    "link": "https://www.ksat.com/news/politics/2025/04/08/supreme-court-blocks-order-requiring-trump-administration-to-reinstate-thousands-of-federal-workers/",
    "timestamp": "2025-04-08T17:08:34Z"
  },
  {
    "title": "How can the world fight back against US tariffs?",
    "description": "The global markets have threatened to unravel and political leaders around the world are scrambling to coax Donald Trump back to the negotiating table, mostly to no avail. What can global governments do",
    "link": "https://www.thejournal.ie:443/podcasts/66f2a0897a3d63d20ff54509/67f551acfbfca819ff391cbf/",
    "timestamp": "2025-04-08T17:08:31Z"
  },
  {
    "title": "We were right: New books expose truth about Biden's failing health. I'm furious. | Opinion - NewsBreak",
    "description": "Two new books, 'Fight' and 'Uncharted,' show President Joe Biden was in serious decline and was surrounded by people who knew it but stayed silent.",
    "link": "https://www.newsbreak.com/share/3951176329630-we-were-right-new-books-expose-truth-about-biden-s-failing-health-i-m-furious-opinion?s=a2&amp;share_destination_id=MTc2OTA3NjY3LTE3NDQxMzIwNzczMzk%3D&amp;pd=0ByHlTv1&amp;hl=en_US&amp;send_time=1744132077&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_local_strategy_25q1_exp-v9%2Cns_foryou_model_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-control",
    "timestamp": "2025-04-08T17:08:22Z"
  },
  {
    "title": "What is the job market's future after Trump's tariffs?",
    "description": "Economic analysts are split on what the tariffs could mean for employees",
    "link": "https://theweek.com/business/tariffs-job-market-economy",
    "timestamp": "2025-04-08T17:07:54Z"
  },
  {
    "title": "Inverse-Brained Jim Cramer Does It Again With Botched ‘Black Monday’ Call",
    "description": "CNBC’s Mad Money host Jim Cramer may really be an inverted soothsayer, as yet another of his predictions went in the complete opposite direction. That’s probably what happens when your brain just happens to be screwed on backwards.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/04/08/prophet-oops-inverse-brained-jim-cramer-does-it-again",
    "timestamp": "2025-04-08T17:07:50Z"
  },
  {
    "title": "Jasmine Crockett Blasts Trump for Skipping Transfer of Fallen Soldiers For Golf Event: Decided to Golf ‘Instead of Receiving Four Heroes’",
    "description": "Rep. Jasmine Crockett (D-TX) criticized President Donald Trump's golfing habits after he missed the transfer of fallen soldiers for a tournament.\nThe post Jasmine Crockett Blasts Trump for Skipping Transfer of Fallen Soldiers For Golf Event: Decided to Golf ‘…",
    "link": "https://www.mediaite.com/news/jasmine-crockett-blasts-trump-for-skipping-transfer-of-fallen-soldiers-for-golf-event-decided-to-golf-instead-of-receiving-four-heroes/",
    "timestamp": "2025-04-08T17:07:16Z"
  },
  {
    "title": "America first to America alone? JPMorgan Chase CEO Jamie Dimon is increasingly concerned with Donald Trump's tariffs",
    "description": "Jamie Dimon Trump tariffs warning has sparked major concern on Wall Street. The JPMorgan Chase CEO fears President Trump's sweeping tariff policies may hurt U.S. global alliances and push the economy toward a recession. While Dimon supports reducing foreign r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/america-first-to-america-alone-jpmorgan-chase-ceo-jamie-dimon-is-increasingly-concerned-with-donald-trumps-tariffs/articleshow/120102499.cms",
    "timestamp": "2025-04-08T17:06:31Z"
  },
  {
    "title": "US stocks pare early gains as China tariffs pose challenge; Dow 200 points higher, S&P, Nasdaq flat",
    "description": "Wall Street experienced volatile trading following the U.S.'s increased tariffs on China, initially rallying before paring gains. Technology stocks rebounded, led by Nvidia and Microsoft, while financials also saw significant increases. Despite the day's gain…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-pare-early-gains-as-china-tariffs-pose-challenge-dow-200-points-higher-sp-nasdaq-flat/articleshow/120102588.cms",
    "timestamp": "2025-04-08T17:06:29Z"
  },
  {
    "title": "The B-2s in the Indian Ocean Aren’t Just for Show!",
    "description": "Beginning last month, the B-2 bombers were sent to the island of Diego Garcia in the Chagos Archipelago as part of the U.S. military's build-up in the region.\nThe post The B-2s in the Indian Ocean Aren’t Just for Show! appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/the-b-2s-in-the-indian-ocean-arent-just-for-show",
    "timestamp": "2025-04-08T17:06:26Z"
  },
  {
    "title": "Chinese Shipping Earnings Face ‘Harder-Than-Expected’ Tariff Hit as Recession Risks Rise",
    "description": "(Bloomberg) — Chinese shippers may see an outsized hit on earnings as the latest tariffs from US President Donald Trump risk hammering global trade. Container liners such as Cosco Shipping...",
    "link": "https://gcaptain.com/chinese-shipping-earnings-face-harder-than-expected-tariff-hit-as-recession-risks-rise/",
    "timestamp": "2025-04-08T17:06:00Z"
  },
  {
    "title": "National Review Urges Congress to End the ‘Raw Chaos’ of Trump’s Trade War: ‘No Free Man Wants to Be at the Mercy of a King’",
    "description": "National Review called on Congress to end Donald Trump's trade war in an editorial laying out the case for doing so on Tuesday.\nThe post National Review Urges Congress to End the ‘Raw Chaos’ of Trump’s Trade War: ‘No Free Man Wants to Be at the Mercy of a Kin…",
    "link": "https://www.mediaite.com/news/national-review-urges-congress-to-end-the-raw-chaos-of-trumps-trade-war-no-free-man-wants-to-be-at-the-mercy-of-a-king/",
    "timestamp": "2025-04-08T17:05:08Z"
  },
  {
    "title": "Ukraine support groups ask NHL to reject Russia",
    "description": "More than two dozen Ukrainian-American and Ukrainian-Canadian groups called on the NHL to reject any collaboration with the Russian Kontinental Hockey League, after talks between U.S President Donald Trump and Russian President Vladimir Putin.",
    "link": "https://www.espn.com/nhl/story/_/id/44588468/ukraine-support-groups-calls-nhl-reject-russia",
    "timestamp": "2025-04-08T17:05:05Z"
  },
  {
    "title": "Johnson Seeks to Quell Conservatives’ Mutiny Against Budget Plan",
    "description": "Republican leadership in the House has its hands full this week. House Speaker Mike Johnson is trying to get about a dozen fiscally conservative Republicans to... Read More\nThe post Johnson Seeks to Quell Conservatives’ Mutiny Against Budget Plan appeared fir…",
    "link": "https://www.dailysignal.com/2025/04/08/johnson-seeks-quell-conservatives-mutiny-against-budget-plan/",
    "timestamp": "2025-04-08T17:04:59Z"
  },
  {
    "title": "Why Trump's 'reciprocal tariffs' are not actually reciprocal",
    "description": "The US President claims his tariffs are \"reciprocal\" yet the evidence suggests they are disproportionately harsh on many countries. It points to a different motivation — to remove US trade deficits. When US President Donald Trump announced the details of his …",
    "link": "https://www.dw.com/en/why-trumps-reciprocal-tariffs-are-not-actually-reciprocal/a-72177305",
    "timestamp": "2025-04-08T17:04:00Z"
  },
  {
    "title": "What's the real motivation behind Trump's 'reciprocal' tariffs?",
    "description": "The US President claims his tariffs are \"reciprocal\" yet the evidence suggests they are disproportionately harsh on many countries. It points to a different motivation — to remove US trade deficits. When US President Donald Trump announced the details of his …",
    "link": "https://www.dw.com/en/whats-the-real-motivation-behind-trumps-reciprocal-tariffs/a-72177305",
    "timestamp": "2025-04-08T17:04:00Z"
  },
  {
    "title": "What's really behind Trump's 'reciprocal' tariffs?",
    "description": "The US President claims his tariffs are \"reciprocal\" yet the evidence suggests they are disproportionately harsh on many countries. It points to a different motivation — to remove US trade deficits.",
    "link": "https://www.dw.com/en/trump-reciprocal-tariffs-trade-china-economy-wto/a-72177305",
    "timestamp": "2025-04-08T17:04:00Z"
  },
  {
    "title": "Florida To Execute Killer Of Newspaper Employee By Lethal Injection",
    "description": "A 48-year-old man is to be executed by lethal injection in the southern US state of Florida on Tuesday for the April 2000 murder of a newspaper employee who was abducted while on her lunch break.",
    "link": "https://www.ndtv.com/world-news/florida-to-execute-killer-of-newspaper-employee-by-lethal-injection-8119149",
    "timestamp": "2025-04-08T17:03:49Z"
  },
  {
    "title": "US bill triggers panic among Indian students – media",
    "description": "The possible termination of a work permit program has caused panic among Indians studying science and tech in the US Read Full Article at RT.com",
    "link": "https://www.rt.com/india/615408-us-panic-indian-students/",
    "timestamp": "2025-04-08T17:03:46Z"
  },
  {
    "title": "Trump to Bolster Coal with Executive Order",
    "description": "According to Politico, today Donald Trump will sign executive orders in an attempt to bolster coal production in the United States. According to reporting, Donald Trump’s executive orders will aim to force coal plants to remain open past their scheduled retir…",
    "link": "https://www.commondreams.org/newswire/trump-to-bolster-coal-with-executive-order",
    "timestamp": "2025-04-08T17:02:57Z"
  },
  {
    "title": "Is Elon Musk Splitting with Trump Over Tariffs? Everything We Know",
    "description": "Elon Musk and President Donald Trump have very different perspectives on the \"Liberation Day\" tariffs, making the last few days the most tumultuous part of their relationship so far.\nThe Tesla and SpaceX CEO has openly criticized Trump's latest tariff policie…",
    "link": "https://biztoc.com/x/e7e5f5e1e52d65b4",
    "timestamp": "2025-04-08T17:01:58Z"
  },
  {
    "title": "Meloni to meet Trump on April 17, discuss tariffs",
    "description": "Italian Prime Minister Giorgia Meloni said Tuesday she will travel to Washington and meet with United States President Donald Trump on April 17. It is expected that they will discuss the latest US ret...",
    "link": "https://biztoc.com/x/f6c35529b891bcd8",
    "timestamp": "2025-04-08T17:01:31Z"
  },
  {
    "title": "Supreme Court Allows Trump Admin to Enforce Deportations of Gang Members Under Alien Enemies Act",
    "description": "The Supreme Court of the United States lifted a block from U.S. District Judges James Boasberg, which prevented the Trump administration from deporting suspected illegal alien gang members under the 1798 Alien Enemies Act. While the ruling from the Supreme Co…",
    "link": "https://freerepublic.com/focus/f-news/4309716/posts",
    "timestamp": "2025-04-08T17:01:27Z"
  },
  {
    "title": "As clock ticks down to Trump’s new tariffs, White House keeps world guessing",
    "description": "President Donald Trump tried to have it both ways this week, saying \"there can be permanent tariffs, and there can also be negotiations.\"",
    "link": "https://biztoc.com/x/00b4d3af4be2dcf7",
    "timestamp": "2025-04-08T17:01:19Z"
  },
  {
    "title": "Trump’s Abuse of Emergency Declaration to Force Ratepayers to Prop Up Inefficient Coal Power Plants Is Breathlessly Stupid",
    "description": "President Donald Trump will today sign executive orders that seek to force ratepayers to pay to keep uneconomic coal power plants running, and push a dramatic expansion of coal mining on public lands The move to resurrect coal power, which Public Citizen warn…",
    "link": "https://www.commondreams.org/newswire/trumps-abuse-of-emergency-declaration-to-force-ratepayers-to-prop-up-inefficient-coal-power-plants-is-breathlessly-stupid",
    "timestamp": "2025-04-08T17:00:45Z"
  },
  {
    "title": "Trump promises $1 trillion in defense spending for next year (Leo Shane III/Military Times)",
    "description": "Leo Shane III / Military Times:\nTrump promises $1 trillion in defense spending for next year  —  President Donald Trump this week unveiled plans for a $1 trillion defense budget next year, a massive increase that he claimed will provide the country with unmat…",
    "link": "https://www.memeorandum.com/250408/p76",
    "timestamp": "2025-04-08T17:00:19Z"
  },
  {
    "title": "National Park Service restores original Harriet Tubman, Underground Railroad webpage",
    "description": "The revelation of the NPS edits drew an immediate backlash from civil rights figures.",
    "link": "https://www.bostonherald.com/2025/04/08/park-service-harriet-tubman/",
    "timestamp": "2025-04-08T17:00:07Z"
  },
  {
    "title": "Vermont: State Commissioner Backtracks on Complying with Federal Demand to Cancel DEI in Schools",
    "description": "Vermont, a traditionally liberal state, has a moderate (non-MAGA) Republican governor, Phil Scott, and a Democratic-controlled legislature. Governor Scott appointed Zoie Saunders as Education Secretary. When the U.S. Department of Education recently directed …",
    "link": "https://dianeravitch.net/2025/04/08/vermont-state-commissioner-backtracks-on-complying-with-federal-demand-to-cancel-dei/",
    "timestamp": "2025-04-08T17:00:00Z"
  },
  {
    "title": "Switch 2 price could hit $540 in response to tariffs, analyst says",
    "description": "At least one analyst expects the price of Nintendo Switch 2 to increase in response to President Donald Trump’s sweeping tariffs. Research firm DFC Intelligence said Monday that it’s “modeling a 20% price increase over the next two years” for Switch 2, which …",
    "link": "https://www.polygon.com/nintendo-switch-2/554889/price-tariffs-analyst-forecast",
    "timestamp": "2025-04-08T16:59:28Z"
  },
  {
    "title": "Supreme Court Sides With Trump On Federal Employee Firing Authority",
    "description": "The U.S. Supreme Court expanded presidential authority over federal employee firings, reshaping civil service protections. Here is what the ruling means for federal workers, their job security, and the future of the government workforce.",
    "link": "https://www.forbes.com/sites/tomspiggle/2025/04/08/supreme-court-sides-with-trump-on-federal-employee-firing-authority/",
    "timestamp": "2025-04-08T16:58:36Z"
  },
  {
    "title": "The Russia Tariff Canard: Was Russia Really \"Spared\"?",
    "description": "Cheap political attacks have been part of American life since before the ink dried on the Constitution. Even George Washington took fire from scornful scribes accusing him—the man who freed us from the shackles of the British crown—of monarchist leanings. But…",
    "link": "https://freerepublic.com/focus/f-news/4309713/posts",
    "timestamp": "2025-04-08T16:57:17Z"
  },
  {
    "title": "Would-be Trump assassin sought rocket launcher from Ukraine",
    "description": "A man suspected of attempting to kill US President Donald Trump reportedly tried to acquire military-grade arms from Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615409-trump-assassin-rocket-launcher-ukraine/",
    "timestamp": "2025-04-08T16:56:47Z"
  },
  {
    "title": "HL: US could seize illegal migrants’ property – Reuters",
    "description": "The action will reportedly be taken against those who defy deportation orders and fail to pay fines Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615402-us-confiscate-migrants-property/",
    "timestamp": "2025-04-08T16:56:40Z"
  },
  {
    "title": "Supreme Court blocks order requiring Trump administration to reinstate thousands of federal workers",
    "description": "The Supreme Court has blocked an order for the Trump administration to return to work thousands of federal employees who were let go in mass firings aimed at dramatically downsizing the federal government",
    "link": "https://www.wftv.com/news/supreme-court-blocks/47ZC2N3AUNEWVC6B4HMVAU4NSE/",
    "timestamp": "2025-04-08T16:55:47Z"
  },
  {
    "title": "Goldman Sachs Forecasts China Easing Monetary Policy To Combat President Trump’s Tariffs: Report",
    "description": "The financial services giant Goldman Sachs is reportedly predicting that the Chinese government will implement fiscal easing to counter US President Donald Trump’s onslaught of new tariffs. In a new analysis, the investment banking behemoth predicted Trump’s …",
    "link": "https://dailyhodl.com/2025/04/08/goldman-sachs-forecasts-china-easing-monetary-policy-to-combat-president-trumps-tariffs-report/",
    "timestamp": "2025-04-08T16:55:45Z"
  },
  {
    "title": "Is Elon Musk Splitting with Trump Over Tariffs? Everything We Know",
    "description": "The relationship that has defined Trump's second administration is facing the strain of the president's tariff policy.",
    "link": "https://www.newsweek.com/elon-musk-donald-trump-tariffs-fall-out-2056937",
    "timestamp": "2025-04-08T16:55:30Z"
  },
  {
    "title": "Would-Be Assassin Wanted Rocket Launcher To Shoot Down Trump’s Plane, DOJ Alleges",
    "description": "Ryan Routh sought to acquire rockets from a supposed Ukrainian associate to use in an attack against Donald Trump Trump, the DOJ alleges.",
    "link": "https://dailycaller.com/2025/04/08/ryan-routh-wanted-rocket-launcher-shoot-down-trump-plane-doj-alleges/",
    "timestamp": "2025-04-08T16:55:01Z"
  },
  {
    "title": "BofA warns earnings in this corner of the stock market could be headed for a 20% drop because of tariffs",
    "description": "Firms that deal with housing products are facing a major EPS hit from the trade war, Bank of America wrote Tuesday.",
    "link": "https://www.businessinsider.com/tariff-impact-on-stocks-earnings-housing-market-tariff-trade-war-2025-4",
    "timestamp": "2025-04-08T16:53:44Z"
  },
  {
    "title": "Government Officials Likely Engaged in Insider Trading Immediately Before Trump's Tariffs, Journalist Speculates",
    "description": "Journalist Andrew Ross Sorkin has speculated that government officials close to the administration of President Donald Trump engaged in insider trading in the weeks leading up to Trump's implementation of tariffs.",
    "link": "https://www.ibtimes.com/government-officials-likely-engaged-insider-trading-immediately-before-trumps-tariffs-journalist-3769266",
    "timestamp": "2025-04-08T16:53:19Z"
  },
  {
    "title": "As clock ticks down to Trump’s new tariffs, White House keeps world guessing",
    "description": "President Donald Trump tried to have it both ways this week, saying \"there can be permanent tariffs, and there can also be negotiations.\"",
    "link": "https://www.pbs.org/newshour/politics/as-clock-ticks-down-to-trumps-new-tariffs-white-house-keeps-world-guessing",
    "timestamp": "2025-04-08T16:52:50Z"
  },
  {
    "title": "Watchdog Presses DOJ to Lift Secrecy on Congressional Spying Documents",
    "description": "The Justice Department’s effort to sweep up phone and email information from congressional staffers during a 2017 investigation into the leak of classified information to... Read More\nThe post Watchdog Presses DOJ to Lift Secrecy on Congressional Spying Docum…",
    "link": "https://www.dailysignal.com/2025/04/08/watchdog-presses-doj-lift-secrecy-congressional-spying-documents/",
    "timestamp": "2025-04-08T16:52:23Z"
  },
  {
    "title": "The Catholic Church is breaking up with the U.S. government. Here’s why it matters",
    "description": "U.S. Catholic leaders are ending their church’s 50-year partnership with the federal government and seeking new ways to help refugees. Archbishop Timothy P. Broglio, president of the U.S. Conference of Catholic Bishops, announced the change in a press release…",
    "link": "https://freerepublic.com/focus/f-religion/4309710/posts",
    "timestamp": "2025-04-08T16:52:19Z"
  },
  {
    "title": "SCOTUS Caves To Trump Request For Review Of Kilmar Armando Abrego Garcia Deportation Case",
    "description": "Kilmar Abrego Garcia return from El Salvador halted by SCOTUS after he was wrongful deported by Trump administration\nThe post SCOTUS Caves To Trump Request For Review Of Kilmar Armando Abrego Garcia Deportation Case appeared first on Bossip.",
    "link": "http://bossip.com/2850737/kilmar-abrego-garcia-return-from-el-salvador-halted-by-scotus/",
    "timestamp": "2025-04-08T16:52:05Z"
  },
  {
    "title": "Mexican ‘Roma’ & ‘Eddington’ Costume Designer Anna Terrazas Reveals Unease When Crossing Mexico-U.S. Border Under Trump Presidency",
    "description": "Costume designer Anna Terrazas has spent her career working between her native Mexico and the U.S., on films and shows including Roma, The Deuce, Bardo – False Chronicle of a Handful of Truths and most recently Eddington. Speaking to Deadline at the Doha Film…",
    "link": "http://deadline.com/2025/04/mexican-costume-designer-fears-mexico-u-s-border-trump-1236363197/",
    "timestamp": "2025-04-08T16:52:02Z"
  },
  {
    "title": "Trump admin unveils plan costing migrants massive fine for every day they don't self-deport",
    "description": "The Trump administration is planning to issue a daily fine of nearly $1,000 to illegal immigrants who do not self-deport after receiving final orders to leave the country.",
    "link": "https://www.foxnews.com/politics/trump-admin-unveils-plan-costing-migrants-massive-fine-every-day-dont-self-deport",
    "timestamp": "2025-04-08T16:51:30Z"
  },
  {
    "title": "Trump Loyalist Senator Warns President That The Economy Will Be All His Fault",
    "description": "\"He will be held responsible, as he should,\" the Republican senator said of Trump.",
    "link": "https://www.huffpost.com/entry/john-kennedy-donald-trump-held-responsible-economy_n_67f52f8de4b063f5d488008c",
    "timestamp": "2025-04-08T16:51:13Z"
  },
  {
    "title": "US expected a big travel year, but overseas visitors — angered by Trump — are heading elsewhere",
    "description": "By DEE-ANN DURBIN, AP Business Writer\nOlja Ivanic looked forward to welcoming some cousins from Sweden to her Denver home in June. Ivanic and the four travelers were planning to go hiking in Colorado and then visit Los Angeles and San Francisco.\nBut then Pres…",
    "link": "https://biztoc.com/x/62d1fb31d3b34bdc",
    "timestamp": "2025-04-08T16:50:39Z"
  },
  {
    "title": "Elon Musk labels White House advisor 'moron' over Tesla comment",
    "description": "Musk labels Trump trade adviser 'moron' over Tesla comments\nElon Musk has called President Donald Trump's trade adviser, Peter Navarro, a \"moron\" over comments he made about his electric vehicle firm, Tesla.\nMusk - who is also a member of the Trump administra…",
    "link": "https://biztoc.com/x/eced11ba998ce353",
    "timestamp": "2025-04-08T16:50:22Z"
  },
  {
    "title": "As China and the US spar, countries brainstorm over how to cope with the trade war",
    "description": "By ELAINE KURTENBACH, Associated Press Business Writer\nBANGKOK (AP) — U.S. President Donald Trump and China sparred over tariff hikes and other retaliatory moves on Tuesday, as governments elsewhere were brainstorming strategies to cope with the trade war bet…",
    "link": "https://biztoc.com/x/d3617715a2cb1dac",
    "timestamp": "2025-04-08T16:50:22Z"
  },
  {
    "title": "Tariff Wars And Small Businesses: An Overlooked Economic Ripple Effect",
    "description": "Tariff Wars and Small Businesses: The Overlooked Economic Ripple Effect As conversations around tariff policy reemerge in the national dialogue, it’s important to unde...",
    "link": "https://www.forbes.com/sites/nataliemadeiracofield/2025/04/08/tariff-wars-and-small-businesses-an-overlooked-economic-ripple-effect/",
    "timestamp": "2025-04-08T16:49:49Z"
  },
  {
    "title": "‘Answer The Question!’: Mark Warner Yells At Jamieson Greer Over Tariffs During Hearing",
    "description": "Mark Warner screamed at Jamieson Greer on Tuesday over President Donald Trump's administration’s decision to impose tariffs on Australia.",
    "link": "https://dailycaller.com/2025/04/08/mark-warner-yells-at-jamieson-greer-over-tariffs-during-hearing/",
    "timestamp": "2025-04-08T16:48:04Z"
  },
  {
    "title": "'He needs to own this': The View urges audience to keep heat on Trump",
    "description": "\"The View's\" Sunny Hostin wants to nickname President Donald Trump's economic woes the \"Trump Slump.\" On Tuesday's show, the co-hosts questioned whether Republicans in Congress would ever hold Trump accountable for the stock market volatility and broader econ…",
    "link": "https://www.rawstory.com/trump-trade-war-2671695011/",
    "timestamp": "2025-04-08T16:48:04Z"
  },
  {
    "title": "House Republicans worry even Trump can't save them as tax cuts, budget bill hang in balance",
    "description": "House Republicans are bracing for a rebellion over legislation to move Trump's agenda through Congress.",
    "link": "https://www.foxnews.com/politics/house-republicans-worry-even-trump-cant-save-them-tax-cuts-budget-bill-hang-balance",
    "timestamp": "2025-04-08T16:47:39Z"
  },
  {
    "title": "Elon Unloads on Trump’s Top Trade Adviser: ‘Truly a Moron’",
    "description": "Elon Musk leveled a series of attacks against Trump trade adviser Peter Navarro during a dispute about the president's tariff policies.",
    "link": "http://www.rollingstone.com/politics/politics-news/elon-musk-trump-trade-adviser-peter-navarro-moron-1235312785/",
    "timestamp": "2025-04-08T16:46:52Z"
  },
  {
    "title": "Trump signals possible progress on Iranian nuclear issue",
    "description": "US president says ‘very high level’ talks will take place on Saturday",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/08/trump-signals-possible-progress-on-iranian-nuclear-issue/",
    "timestamp": "2025-04-08T16:46:36Z"
  },
  {
    "title": "British stocks FTSE 100 notch strongest session since 2022 on hopes for tariff negotiations",
    "description": "British stocks rebounded strongly on Tuesday, fueled by hopes of softened U.S. import tariffs, with the FTSE 100 experiencing its largest daily increase since March 2022. Finance Minister Rachel Reeves is set to meet with the U.S. Treasury Secretary amid disc…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/british-stocks-ftse-100-notch-strongest-session-since-2022-on-hopes-for-tariff-negotiations/articleshow/120101955.cms",
    "timestamp": "2025-04-08T16:46:23Z"
  },
  {
    "title": "Here's the list of books the Naval Academy removed from its library during DEI purge",
    "description": "Included in the purge is “How to be Anti-Racist\" by Ibram X. Kendi, as well as “I Know Why The Caged Bird Sings\" by American writer and poet Maya Angelou.",
    "link": "https://www.foxnews.com/politics/naval-academy-removed-from-its-library-during-dei-purge",
    "timestamp": "2025-04-08T16:46:22Z"
  },
  {
    "title": "'To deliver this kind of a blow—well done, old man': Russian state TV reportedly mocks Trump over tariffs",
    "description": "Russian political figures are celebrating Trump's tariffs, viewing them as a fatal blow to the existing global economic order. They believe Trump has destroyed trust and undermined the American economy, deserving a symbolic, albeit worthless, award. Despite n…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/to-deliver-this-kind-of-a-blowwell-done-old-man-russian-state-tv-reportedly-mocks-trump-over-tariffs/articleshow/120101592.cms",
    "timestamp": "2025-04-08T16:45:39Z"
  },
  {
    "title": "How Bulgaria is Looking to Modernize its Air Force",
    "description": "The first two of Sofia‘s original order of eight F-16 Block 70 Fighting Falcons were officially handed over in late January via American defense contractor Lockheed Martin.\nThe post How Bulgaria is Looking to Modernize its Air Force appeared first on The Nati…",
    "link": "https://nationalinterest.org/blog/buzz/how-bulgaria-is-looking-to-modernize-its-air-force",
    "timestamp": "2025-04-08T16:45:36Z"
  },
  {
    "title": "Republican Asks ‘Whose Throat to Choke’ If Tariffs Don’t Pan Out",
    "description": "Republican senators expressed anxiety over the potential economic toll of Donald Trump’s global tariffs and pressed his trade representative for more clarity on the president’s objectives in the trade conflict.",
    "link": "https://financialpost.com/pmn/business-pmn/republican-asks-whose-throat-to-choke-if-tariffs-dont-pan-out",
    "timestamp": "2025-04-08T16:44:55Z"
  },
  {
    "title": "Rahm says players want solution to LIV-PGA split",
    "description": "AUGUSTA, Georgia :Jon Rahm said players on both the PGA Tour and LIV Golf circuit would like to see a resolution to the current split in professional golf but acknowledged that it could take time to achieve. Rahm, who signed for Saudi-backed LIV in late 2023,…",
    "link": "https://www.channelnewsasia.com/sport/rahm-says-players-want-solution-liv-pga-split-5052571",
    "timestamp": "2025-04-08T16:44:47Z"
  },
  {
    "title": "‘The View’ Hosts Worry About Dire Wolves Being Brought Back: ‘It’s Giving Jurassic Park’",
    "description": "\"The dinosaurs came back and ate the people, so I don't like it,\" host Sunny Hostin says\nThe post ‘The View’ Hosts Worry About Dire Wolves Being Brought Back: ‘It’s Giving Jurassic Park’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/dire-wolf-brought-back-the-view-jurassic-park/",
    "timestamp": "2025-04-08T16:44:41Z"
  },
  {
    "title": "Justices pause order to reinstate fired federal employees",
    "description": "ShareThe Supreme Court on Tuesday paused an order by a judge in San Francisco that would require the federal government to reinstate more than 16,000 workers who were fired by six agencies earlier this year. A group of nonprofits challenging the layoffs argue…",
    "link": "https://www.scotusblog.com/2025/04/justices-pause-order-to-reinstate-fired-federal-employees/",
    "timestamp": "2025-04-08T16:44:15Z"
  },
  {
    "title": "WATCH: Cortez Masto grills Trump trade rep on what he’s doing to shield tourism industry from tariff fallout",
    "description": "Sen. Catherine Cortez Masto, D-Nev., pressed U.S. Trade Representative Jamieson Greer on Tuesday, saying she was concerned that Greer was not being realistic nor \"intellectually honest\" about the time it takes to negotiate trade agreements.",
    "link": "https://www.pbs.org/newshour/politics/watch-cortez-masto-grills-trump-trade-rep-on-what-hes-doing-to-shield-tourism-industry-from-tariff-fallout",
    "timestamp": "2025-04-08T16:43:12Z"
  },
  {
    "title": "Mortgage rates slingshot higher as tariff uncertainty roils markets",
    "description": "After falling sharply last week, mortgage rates rose again this week, wiping out any advantage to the spring housing market. Tariffs were behind the volatility.",
    "link": "https://www.cnbc.com/2025/04/08/mortgage-rates-higher-tariff-uncertainty.html",
    "timestamp": "2025-04-08T16:42:16Z"
  },
  {
    "title": "After His Shocking Exit From Politics, Nick Freitas Hints at What’s Next",
    "description": "With over 3 million followers between his Instagram “shorts” videos and his “Making the Argument” podcast, other than Virginia’s governor, state Del. Nick Freitas may... Read More\nThe post After His Shocking Exit From Politics, Nick Freitas Hints at What’s Ne…",
    "link": "https://www.dailysignal.com/2025/04/08/after-shocking-exit-politics-nick-freitas-hints-whats-next/",
    "timestamp": "2025-04-08T16:41:57Z"
  },
  {
    "title": "Trump to sign executive order to help dying U.S. coal industry",
    "description": "The president will direct agencies to boost coal leasing, mining and exports. But these steps are unlikely to usher in a coal renaissance.President Donald Trump plans to sign an executive order Tuesday aimed at boosting the struggling U.S. coal industry, acco…",
    "link": "https://freerepublic.com/focus/f-news/4309702/posts",
    "timestamp": "2025-04-08T16:41:41Z"
  },
  {
    "title": "Fox Anchor Confronts Trump Spox On ‘Historically High’ 401k Cash-Outs and Hardship Withdrawals Amid Stock Chaos",
    "description": "Dana Perino confronted Trump econommic spokesman Kevin Hassett over \"historic\" 401k cash-outs and hardship withdrawals amid stock market chaos.\nThe post Fox Anchor Confronts Trump Spox On ‘Historically High’ 401k Cash-Outs and Hardship Withdrawals Amid Stock …",
    "link": "https://www.mediaite.com/news/fox-anchor-confronts-trump-spox-on-historically-high-401k-cash-outs-and-hardship-withdrawals-amid-stock-chaos/",
    "timestamp": "2025-04-08T16:41:28Z"
  },
  {
    "title": "Pentagon chief hails first $1 trillion defense budget",
    "description": "US Defense Secretary Pete Hegseth has pledged to grow the military’s lethality using the upcoming record $1 trillion Pentagon budget Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615410-pentagon-chief-trillion-budget/",
    "timestamp": "2025-04-08T16:41:27Z"
  },
  {
    "title": "Foreign Aid Cuts by Trump Will Be 'Death Sentence for Millions,' Warns UN",
    "description": "The World Food Program (WFP) at the United Nations warned Monday that the Trump administration's new cuts to lifesaving U.S. foreign aid programs \"could amount to a death sentence for millions of people facing extreme hunger and starvation.\"The programs had p…",
    "link": "https://www.commondreams.org/news/trump-usaid-foreign-aid-cuts",
    "timestamp": "2025-04-08T16:41:15Z"
  },
  {
    "title": "Elon Musk Clashes With Top Trump Adviser as Tariff Tensions Boil Over",
    "description": "Elon Musk called Donald Trump’s top trade adviser Peter Navarro “dumber than a sack of bricks” Tuesday, once again betraying the administration’s deep rift over the president’s disastrous tariffs. \r\nNavarro found himself in hot water with Musk after he called…",
    "link": "https://newrepublic.com/post/193731/elon-musk-donald-trump-adviser-peter-navarro-tariffs",
    "timestamp": "2025-04-08T16:41:14Z"
  },
  {
    "title": "The Clear and Present Danger to the American Rule of Law",
    "description": "Trump’s attacks on the courts and Big Law are an existential threat to the legal system. Expect a reckoning.\nThe post The Clear and Present Danger to the American Rule of Law appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/08/trump-big-law-firms-paul-weiss-courts/",
    "timestamp": "2025-04-08T16:41:13Z"
  },
  {
    "title": "US Supreme Court halts reinstatement of fired federal employees",
    "description": "The Supreme Court has blocked a judge's order that would have forced the Trump administration to rehire thousands of fired employees, siding with the administration's efforts to downsize the federal workforce. The court found that the non-profit organizations…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-halts-reinstatement-of-fired-federal-employees/articleshow/120101777.cms",
    "timestamp": "2025-04-08T16:40:37Z"
  },
  {
    "title": "Ana Navarro Tells Whoopi Goldberg She’s “Back To Being As Skinny” As She Was In The ‘80s — Leaving Her Nearly Speechless",
    "description": "Goldberg has been open about her Mounjaro use.",
    "link": "https://decider.com/2025/04/08/ana-navarro-tells-whoopi-goldberg-skinny-80s-speechless/",
    "timestamp": "2025-04-08T16:39:18Z"
  },
  {
    "title": "US expected a big travel year, but overseas visitors — angered by Trump — are heading elsewhere",
    "description": "Potential visitors have been alarmed by reports of tourists getting arrested at the border.",
    "link": "https://www.denverpost.com/2025/04/08/us-international-tourism/",
    "timestamp": "2025-04-08T16:37:23Z"
  },
  {
    "title": "US expected a big travel year, but overseas visitors — angered by Trump — are heading elsewhere",
    "description": "Potential visitors have been alarmed by reports of tourists getting arrested at the border.",
    "link": "https://www.bostonherald.com/2025/04/08/us-international-tourism/",
    "timestamp": "2025-04-08T16:37:23Z"
  },
  {
    "title": "The Trump administration withdrew 11 pieces of ADA guidance. How will it affect compliance?",
    "description": "A look at what was withdrawn and how it might impact disabled communities and businesses.",
    "link": "https://www.bostonherald.com/2025/04/08/ada-guidance-withdrawn/",
    "timestamp": "2025-04-08T16:36:53Z"
  },
  {
    "title": "US Supreme Court halts reinstatement of fired federal employees",
    "description": "The U.S. Supreme Court blocked on Tuesday a judge's order for President Donald Trump's administration to rehire thousands of fired employees.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/08/supreme-court-fired-federal-employees-reinstatement/82991866007/",
    "timestamp": "2025-04-08T16:36:34Z"
  },
  {
    "title": "US Supreme Court sides with Trump on mass firing of federal employees",
    "description": "The ruling is a victory for Trump’s efforts to shrink the federal workforce, with the administration arguing the judge overstepped by intervening in executive staffing decisions.",
    "link": "https://www.thehindubusinessline.com/news/world/us-supreme-court-sides-with-trump-on-mass-firing-of-federal-employees/article69428392.ece",
    "timestamp": "2025-04-08T16:36:26Z"
  }
]