[
  {
    "title": "Republicans advance Fox News vet Jeanine Pirro to be the top federal prosecutor in D.C.",
    "description": "Jeanine Pirro's record made her a controversial choice to serve as the U.S. attorney in Washington, DC. Senate Judiciary Committee Republicans didn’t care.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jeanine-pirro-senate-judiciary-committee-advance-vote-rcna219342",
    "timestamp": "2025-07-17T15:32:47Z"
  },
  {
    "title": "Report: China Threatens to Block Panama Ports Deal Unless COSCO Gets a Stake",
    "description": "China is threatening to block the sale of more than 40 ports, owned by Hong Kong-based CK Hutchison, to BlackRock and Mediterranean Shipping Company (MSC) if Chinese shipping company Cosco does not get a stake, the Wall Street Journal reported on Thursday, ci…",
    "link": "https://gcaptain.com/report-china-threatens-to-block-panama-ports-deal-unless-cosco-gets-a-stake/",
    "timestamp": "2025-07-17T15:31:44Z"
  },
  {
    "title": "India’s GAIL negotiating long-term LNG purchase from Alaska LNG",
    "description": "The initial talks with Glenfarne are part of India's broader strategy to augment energy imports from the US.",
    "link": "https://www.offshore-technology.com/news/indias-gail-negotiating-long-term-lng-purchase-from-alaska-lng/",
    "timestamp": "2025-07-17T15:30:55Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wcax.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T15:30:40Z"
  },
  {
    "title": "WATCH LIVE: White House holds news briefing as Trump faces MAGA dissent over Epstein files",
    "description": "The schism centers on the administration's handling of documents related to Epstein, who was found dead in his New York jail cell in August 2019, weeks after his arrest on sex trafficking charges.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-news-briefing-as-trump-faces-maga-dissent-over-epstein-files",
    "timestamp": "2025-07-17T15:30:22Z"
  },
  {
    "title": "Human Rights Defenders Are Fleeing El Salvador as Bukele Cracks Down",
    "description": "El Salvador President Nayib Bukele's authoritarian regime is forcing human rights defenders like the nonprofit Cristosal to flee the nation.",
    "link": "http://www.rollingstone.com/politics/politics-features/bukele-crackdown-el-salvador-human-rights-groups-flee-1235387840/",
    "timestamp": "2025-07-17T15:30:00Z"
  },
  {
    "title": "Trump 2.0 and the Reverse Racism Presidency",
    "description": "In a topsy-turvy world where Afrikaners are “refugees” and civil rights are for white men, every accusation is a confession.",
    "link": "https://inthesetimes.com/article/trump-reverse-racism-south-africa",
    "timestamp": "2025-07-17T15:30:00Z"
  },
  {
    "title": "Whatever Congressional Dems Are Doing, It’s The Worst Flop Since 2009",
    "description": "Democrats may think they can surf through the 2026 midterms on a big, blue wave. However, a new poll suggests the wave may turn out to be a trickle, if that.",
    "link": "https://dailycaller.com/2025/07/17/democratic-party-quinnipiac-university-poll-approval-rating-midterms/",
    "timestamp": "2025-07-17T15:29:45Z"
  },
  {
    "title": "Taiwan Semi is speeding up U.S. chip production due to demand, CEO says",
    "description": "TSMC still faces looming uncertainty after U.S. President Donald Trump threatened steep tariffs on Taiwan.",
    "link": "https://biztoc.com/x/785725ecfa5d4007",
    "timestamp": "2025-07-17T15:29:03Z"
  },
  {
    "title": "Merz grateful Trump open to assisting Ukraine",
    "description": "German Chancellor Friedrich Merz said on Thursday he was \"grateful\" that US President Donald Trump was open to \"continuing to assist Ukraine\" by providing weapons.Merz also called for \"clear explanati...",
    "link": "https://biztoc.com/x/cf188740b42abf33",
    "timestamp": "2025-07-17T15:29:01Z"
  },
  {
    "title": "Trump’s Coca Cola post tanked share prices for high fructose corn syrup makers",
    "description": "President Donald Trump posted on social media Coca-Cola executives had agreed to only use real cane sugar for products in the U.S. Even though Coca-Cola didn’t explicitly confirm the change, share prices for companies that manufacture the sweetener sank on Th…",
    "link": "https://biztoc.com/x/c55ebbf8279ed4bd",
    "timestamp": "2025-07-17T15:28:55Z"
  },
  {
    "title": "What Trump Has Said About Powell: Timeline",
    "description": "President Donald #Trump said he’s not planning to fire Jerome #Powell, and still managed to make it sound like a threat. Trump’s comments capped a hectic few hours that took his pressure campaign against the Federal Reserve chief to a new level — and sent mar…",
    "link": "https://biztoc.com/x/e1417d78dfe2da66",
    "timestamp": "2025-07-17T15:28:53Z"
  },
  {
    "title": "POLL: Trump’s Popularity Grows with Republicans amid Epstein Uproar",
    "description": "New polls show President Donald Trump’s approval among Republicans has risen—not fallen—despite nonstop social media backlash over the Epstein case.\nThe post POLL: Trump’s Popularity Grows with Republicans amid Epstein Uproar appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/17/poll-trumps-popularity-grows-republicans-amid-epstein-uproar/",
    "timestamp": "2025-07-17T15:28:39Z"
  },
  {
    "title": "Army Veteran And U.S. Citizen Arrested In California Immigration Raid",
    "description": "George Retes says he was tear gassed, pepper sprayed, and dragged from his vehicle -- despite him identifying himself as a U.S. citizen.",
    "link": "https://www.huffpost.com/entry/army-veteran-us-citizen-ice-immigration-raid-arrest_n_687913f0e4b007ebff46e82f",
    "timestamp": "2025-07-17T15:28:36Z"
  },
  {
    "title": "Fox & Friends Breaks Down in Hysterics as Lawrence Jones Declares: ‘I Love Mexican Coke!’",
    "description": "The Fox & Friends curvy couch was reduced to side-splitting laughter in a light-hearted moment after co-host Lawrence Jones declared, \"I love Mexican Coke!\"\nThe post Fox & Friends Breaks Down in Hysterics as Lawrence Jones Declares: ‘I Love Mexican Coke!’ fir…",
    "link": "https://www.mediaite.com/media/tv/fox-friends-breaks-down-in-hysterics-as-lawrence-jones-declares-i-love-mexican-coke/",
    "timestamp": "2025-07-17T15:28:04Z"
  },
  {
    "title": "Chief of the Air Staff speech at Global Air & Space Chiefs' Conference 2025",
    "description": "Chief of the Air Staff, Air Chief Marshal Sir Rich Knighton's speech at the Global Air & Space Chiefs' Conference 17 July 2025",
    "link": "https://www.gov.uk/government/speeches/chief-of-the-air-staff-speech-at-global-air-space-chiefs-conference-2025",
    "timestamp": "2025-07-17T15:27:43Z"
  },
  {
    "title": "Drugmakers To Sell Popular Blood Thinner Eliquis At 40% Discount",
    "description": "The discounted price is 40% lower than the US list price, Bristol said, but it's higher than the one the Biden administration negotiated last year under the Inflation Reduction Act.",
    "link": "https://www.ndtvprofit.com/business/drugmakers-to-sell-popular-blood-thinner-eliquis-at-40-discount",
    "timestamp": "2025-07-17T15:27:24Z"
  },
  {
    "title": "Border Patrol hiring spree offers lessons as another immigration agency embarks on massive growth",
    "description": "Immigration and Customs Enforcement plans to hire 10,000 employees over five years, echoing a Border Patrol expansion in the 2000s",
    "link": "https://abcnews.go.com/US/wireStory/border-patrol-hiring-spree-offers-lessons-immigration-agency-123835511",
    "timestamp": "2025-07-17T15:27:10Z"
  },
  {
    "title": "Selected Articles: Trump Allegedly Demanded Zelensky Hit Moscow after a ‘Disappointing’ Putin Call",
    "description": "Trump Allegedly Demanded Zelensky Hit Moscow after a ‘Disappointing’ Putin Call\nBy Drago Bosnic, July 17, 2025\nOn July 15, Financial Times published a report claiming that US President Donald Trump reportedly demanded that the Zelensky government  escalate it…",
    "link": "https://www.globalresearch.ca/selected-articles-trump-allegedly-demanded-zelensky-hit-moscow/5895315",
    "timestamp": "2025-07-17T15:26:51Z"
  },
  {
    "title": "Senate Democrats walk out of committee vote to advance Trump court pick Emil Bove",
    "description": "Republicans forced a vote for Bove's lifetime appointment on the appeals court.",
    "link": "https://abcnews.go.com/Politics/900-former-doj-employees-urge-senate-reject-bove/story?id=123808829",
    "timestamp": "2025-07-17T15:26:00Z"
  },
  {
    "title": "Russia threatens West with ‘preemptive strikes’ as NATO looks to deliver Patriots 'as quickly as possible'",
    "description": "Former Russian President Medvedev calls for preemptive strikes while Trump gives Putin a 50-day ultimatum to reach peace with Ukraine or face sanctions.",
    "link": "https://www.foxnews.com/world/russia-threatens-west-preemptive-strikes-nato-looks-deliver-patriots-as-quickly-possible",
    "timestamp": "2025-07-17T15:25:59Z"
  },
  {
    "title": "Liberal Groups Aim To Make Immigration Courts Safe Haven For Illegals",
    "description": "A slate of liberal groups are suing the Trump administration to stop Immigration and Customs Enforcement (ICE) agents from making arrests at immigration courts.",
    "link": "https://dailycaller.com/2025/07/17/lib-groups-sue-to-stop-ice-court-arrests/",
    "timestamp": "2025-07-17T15:25:13Z"
  },
  {
    "title": "Trump Says He Convinced Coca-Cola To Replace Corn Syrup With Cane Sugar",
    "description": "Coca-Cola will swap corn syrup for cane sugar in its U.S. products after President Donald Trump urged the company to make the change, he claimed Wednesday.",
    "link": "https://dailycaller.com/2025/07/17/trump-maha-rfk-jr-coca-cola-corn-syrup-cane-sugar/",
    "timestamp": "2025-07-17T15:24:41Z"
  },
  {
    "title": "Top NATO commander gives update on Patriots for Ukraine",
    "description": "Alexus Grynkewich has pledged to expedite a scheme under which Germany will buy the US-made air defense systems and supply them to Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621617-top-nato-commander-patriot-delivery-ukraine-germany/",
    "timestamp": "2025-07-17T15:23:31Z"
  },
  {
    "title": "SEN TOMMY TUBERVILLE: The Fed Has Gone Rogue — Fire Jerome Powell",
    "description": "President Donald J. Trump and his America First policies are back, and the American people can feel the momentum. After four years of disastrous open-border policies, skyrocketing inflation, and woke bureaucrats running wild, the tide is finally turning. Than…",
    "link": "https://dailycaller.com/2025/07/17/opinion-the-fed-has-gone-rogue-fire-jerome-powell-sen-tommy-tuberville/",
    "timestamp": "2025-07-17T15:23:14Z"
  },
  {
    "title": "Dem Senator Says Her Party Needs To Ditch ‘Wonky Policies’ Approach In Favor Of ‘Alpha Energy’",
    "description": "Sen. Elissa Slotkin said in an interview with the NYT published Thursday that Democrats \"respond to people's pain with a long list of wonky policies.\"",
    "link": "https://dailycaller.com/2025/07/17/elissa-slotkin-democrats-wonky-policies-alpha-energy/",
    "timestamp": "2025-07-17T15:22:32Z"
  },
  {
    "title": "‘Not at All OK!’ MSNBC’s Jen Psaki Savages Trump Over Blizzard of New Blunders",
    "description": "Jen Psaki savaged President Donald Trump over a new series of blunders and gaffes, intimating a deeper decline by saying Trump is \"not at all okay.\"\nThe post ‘Not at All OK!’ MSNBC’s Jen Psaki Savages Trump Over Blizzard of New Blunders first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/not-at-all-ok-msnbcs-jen-psaki-savages-trump-over-blizzard-of-new-blunders/",
    "timestamp": "2025-07-17T15:22:07Z"
  },
  {
    "title": "Good Morning, News: ICE Kidnaps Preschool Parent, GOP Steals Money from Public Broadcasting, and Trump's \"Epstein Problems\" are Just Beginning",
    "description": "by Wm. Steven Humphrey\n \n \n \n If you’re reading this, you probably know the value of the Mercury’s news reporting, arts and culture coverage, event calendar, and the bevy of events we host throughout the year. The work we do helps our city shine, but we can’t…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/07/17/47927595/good-morning-news-ice-kidnaps-preschool-parent-gop-steals-money-from-public-broadcasting-and-trumps-epstein-problems-are-just-beginning",
    "timestamp": "2025-07-17T15:22:00Z"
  },
  {
    "title": "Trump Moves to Kill California’s Dreams of High-Speed Rail",
    "description": "“Trump wants to hand China the future and abandon the Central Valley,\" Governor Newsom said.",
    "link": "https://gizmodo.com/trump-moves-to-kill-californias-dreams-of-high-speed-rail-2000630700",
    "timestamp": "2025-07-17T15:20:52Z"
  },
  {
    "title": "Taiwan Semi is speeding up U.S. chip production due to demand, CEO says",
    "description": "TSMC still faces looming uncertainty after U.S. President Donald Trump threatened steep tariffs on Taiwan.",
    "link": "https://www.cnbc.com/2025/07/17/taiwan-semi-tsmc-stock-chip-production.html",
    "timestamp": "2025-07-17T15:19:45Z"
  },
  {
    "title": "Patriots to move to Kyiv 'as quickly as possible', says NATO top commander",
    "description": "Preparations are underway to quickly transfer additional Patriot air defence systems to Ukraine, NATO's top military commander Alexus Grynkewich said on Thursday, as the country suffers some of the heaviest Russian attacks of the war so far. \"We are working v…",
    "link": "https://freerepublic.com/focus/f-news/4329182/posts",
    "timestamp": "2025-07-17T15:19:13Z"
  },
  {
    "title": "5 ‘Big, Beautiful Bill’ changes to marketplace insurance",
    "description": "President Donald Trump signed his “big, beautiful bill” into law on July 4, making changes to health insurance coverage for millions of Americans.\nRelated Articles\n \n \n \n Wall Street hangs near its record as PepsiCo and United Airlines offset drops for health…",
    "link": "https://biztoc.com/x/6e707920f022c011",
    "timestamp": "2025-07-17T15:18:00Z"
  },
  {
    "title": "U.S. House agrees to consider cryptocurrency bill, poised for Trump’s signature",
    "description": "The Republican-controlled U.S. House of Representatives cleared key procedural hurdles on crypto legislation on Wednesday, a day after U.S. President Donald Trump intervened to save the initiative, paving the way for the first federal law for digital assets.\n…",
    "link": "https://biztoc.com/x/bfb3f61db673e9fc",
    "timestamp": "2025-07-17T15:17:54Z"
  },
  {
    "title": "‘It Was a Crisis Then!’ Joe Scarborough Grills House Dem on Why Biden DOJ Didn’t Release Epstein Files",
    "description": "Scarborough grilled Jamie Raskin on why Biden’s Justice Department didn’t release the Epstein files amid the lawmaker's push for Trump to publish the documents.\nThe post ‘It Was a Crisis Then!’ Joe Scarborough Grills House Dem on Why Biden DOJ Didn’t Release …",
    "link": "https://www.mediaite.com/media/news/it-was-a-crisis-then-joe-scarborough-grills-house-dem-on-why-biden-doj-didnt-release-epstein-files/",
    "timestamp": "2025-07-17T15:17:31Z"
  },
  {
    "title": "USD/CNY Continues to Dwindle in 2025 as China Seeks Renminbi Stability (Dmytro Spilka)",
    "description": "The ongoing trade tensions between the United States and China are playing out throughout different ...",
    "link": "https://www.finextra.com/blogposting/28922/usdcny-continues-to-dwindle-in-2025-as-china-seeks-renminbi-stability",
    "timestamp": "2025-07-17T15:16:45Z"
  },
  {
    "title": "'He's paying a price:' Trump facing a 'crisis of MAGA faith' over latest scandal",
    "description": "While President Donald Trump has faced blowback from his core supporters before, his handling of the Jeffrey Epstein affair might be a bridge too far, writes The Bulwark in an op-ed\r\n published Thursday, and could lead the president to pay a “real price” for …",
    "link": "https://www.rawstory.com/jeffrey-epstein-2673339041/",
    "timestamp": "2025-07-17T15:16:34Z"
  },
  {
    "title": "Trump’s Coca Cola post tanked share prices for high fructose corn syrup makers",
    "description": "Shares for Archer-Daniels-Midland and Ingredion both fell at least 6% in after hours trading.",
    "link": "https://fortune.com/2025/07/17/trump-coca-cola-post-tanked-share-prices-high-fructose-corn-syrup-makers/",
    "timestamp": "2025-07-17T15:15:42Z"
  },
  {
    "title": "ICE director blasts Chicago mayor over 'disgusting' militarization claims as officers face rising violence",
    "description": "Acting ICE Director Todd Lyons criticizes Chicago Mayor Brandon Johnson's 'disgusting' claim that Trump is militarizing ICE, pointing to sanctuary policies that harbor criminal aliens.",
    "link": "https://www.foxnews.com/media/ice-director-blasts-chicago-mayor-over-disgusting-militarization-claims-amid-rising-threats-against-officers",
    "timestamp": "2025-07-17T15:15:36Z"
  },
  {
    "title": "Jack Ciattarelli's Chances of Beating Sherrill and Flipping New Jersey—poll",
    "description": "\"'Affordability' is definitely the buzzword of this election within New Jersey,\" a Rutgers University pollster told Newsweek.",
    "link": "https://www.newsweek.com/mikie-sherrill-jack-ciattarelli-new-jersey-governor-polls-2100240",
    "timestamp": "2025-07-17T15:15:31Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wbko.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T15:15:29Z"
  },
  {
    "title": "Pushing Military Spending and Neoliberal Austerity, French PM Emulates Trump",
    "description": "Both the left and the far right in France see the government budget plan as something of a class war budget.",
    "link": "https://truthout.org/articles/pushing-military-spending-and-neoliberal-austerity-french-pm-emulates-trump/",
    "timestamp": "2025-07-17T15:14:56Z"
  },
  {
    "title": "MAHA: Steak 'n Shake Says It Will Offer Coca-Cola with Real Cane Sugar",
    "description": "Steak 'n Shake will soon offer Coca-Cola with real cane sugar -- something highlighted by President Donald Trump -- as industries try to move in the direction of the Make America Healthy Again (MAHA) agenda.\nThe post MAHA: Steak ‘n Shake Says It Will Offer Co…",
    "link": "https://www.breitbart.com/politics/2025/07/17/maha-steak-n-shake-says-it-will-offer-coca-cola-with-real-cane-sugar/",
    "timestamp": "2025-07-17T15:14:05Z"
  },
  {
    "title": "Chevron Nears Oil Output Plateau in Permian, Adding Billions in Cash Flow",
    "description": "Chevron Corp. is on the cusp of reaching a production plateau in the largest US oil field, allowing it to reap billions of dollars of additional cash flow in the next few years.",
    "link": "https://financialpost.com/pmn/business-pmn/chevron-nears-oil-output-plateau-in-permian-adding-billions-in-cash-flow",
    "timestamp": "2025-07-17T15:13:57Z"
  },
  {
    "title": "EU prepares list of potential tariffs on US services",
    "description": "Brussels is also considering export controls if trade talks with Washington fail",
    "link": "https://www.irishtimes.com/business/2025/07/17/eu-prepares-list-of-potential-tariffs-on-us-services/",
    "timestamp": "2025-07-17T15:13:11Z"
  },
  {
    "title": "The Trump Administration Is Reviving Institutionalized Torture",
    "description": "Rebecca Gordon\n\n\n\nThe ambient threat of torture is a form of social control, encouraging everyone else to comply with and bow down before the regime. \r\n\n\r\n\n\nThe post The Trump Administration Is Reviving Institutionalized Torture appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/trump-torture-kilmar-abrego-garcia/",
    "timestamp": "2025-07-17T15:13:04Z"
  },
  {
    "title": "Musk Accuses Trump of Covering Up Epstein Scandal",
    "description": "It's no wonder multi-hyphenate billionaire Elon Musk sees the Jeffrey Epstein crisis as an enormous opportunity to score political points. The situation, a catastrophic self-own of epic proportions, has driven a massive wedge between president Donald Trump an…",
    "link": "https://futurism.com/musk-accuses-trump-covering-up-epstein-scandal",
    "timestamp": "2025-07-17T15:12:37Z"
  },
  {
    "title": "Tim Walz questions why Democrats come off like they're against people being successful",
    "description": "Gov. Tim Walz said during a podcast interview that the Democratic Party comes off as anti-success and argued the party should embrace being pro-business.",
    "link": "https://www.foxnews.com/media/tim-walz-questions-why-democrats-come-off-like-theyre-against-people-being-successful",
    "timestamp": "2025-07-17T15:12:24Z"
  },
  {
    "title": "Trump's U-Turn On Nvidia Spurs Talk Of Grand Bargain With China",
    "description": "Only a few years ago, the Biden administration declared export controls a “new strategic asset” to help the US maintain “as large a lead as possible” over China in advanced technology. President Donald Trump is now upending that approach.In a reversal this we…",
    "link": "https://www.ndtvprofit.com/world/trumps-u-turn-on-nvidia-spurs-talk-of-grand-bargain-with-china",
    "timestamp": "2025-07-17T15:11:47Z"
  },
  {
    "title": "Senate panel advances Trump's former defense attorney Emil Bove to federal appeals court position",
    "description": "Trump's former defense attorney Emil Bove faces opposition from former judges and Democrats as his nomination for the Third Circuit Court of Appeals faces first test.",
    "link": "https://www.foxnews.com/politics/senate-judiciary-committee-votes-confirm-trumps-pick-emil-bove-amid-controversy",
    "timestamp": "2025-07-17T15:11:25Z"
  },
  {
    "title": "Senate Advances NPR, PBS and Foreign Aid Cuts",
    "description": "The Senate passed a package cutting funding from public broadcasting and foreign aid by a 51-48 vote early Thursday morning, a step forward in Republicans’... Read More\nThe post Senate Advances NPR, PBS and Foreign Aid Cuts appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/17/senate-advances-npr-pbs-and-foreign-aid-cuts/",
    "timestamp": "2025-07-17T15:09:02Z"
  },
  {
    "title": "US Solar Makers File Trade Petition Against India, Indonesia",
    "description": "US solar manufacturers said they have filed new trade petitions against India, Indonesia and Laos alleging illegal practices by largely Chinese-owned companies operating in those countries.",
    "link": "https://financialpost.com/pmn/business-pmn/us-solar-makers-file-trade-petition-against-india-indonesia",
    "timestamp": "2025-07-17T15:08:57Z"
  },
  {
    "title": "Dems are finally challenging Trump at his own attention-seeking game: analysis",
    "description": "Michelle Obama famously said of Republican tactics, \"When they go low, we go high,\" but Democrats seem to be finally abandoning that philosophy to take President Donald Trump on at his own game, according to an article in The Bulwark.Reporter Lauren Egan wrot…",
    "link": "https://www.rawstory.com/trump-epstein-2673336672/",
    "timestamp": "2025-07-17T15:08:16Z"
  },
  {
    "title": "Merz grateful Trump open to assist Ukraine",
    "description": "German Chancellor Friedrich Merz said on Thursday he was \"grateful\" that US President Donald Trump was open to \"continue to assist Ukraine\" by providing weapons.Merz also called for \"clear explanatio...",
    "link": "https://biztoc.com/x/7b9d3de573fcd2aa",
    "timestamp": "2025-07-17T15:06:44Z"
  },
  {
    "title": "Bitcoin Wavers After Trump Says He's 'Not Planning' to Fire Fed Chair",
    "description": "In brief\n- U.S. President Donald Trump said he’s \"not planning on doing anything\" after reports suggested that he could soon oust Fed Chair Jerome Powell.\n- Despite months of pressure from Trump and his associates, the U.S. central bank has left its benchmark…",
    "link": "https://biztoc.com/x/86b3117e8e738811",
    "timestamp": "2025-07-17T15:06:41Z"
  },
  {
    "title": "Newsom Eyes Ripping Up GOP Districts To Pad House Dems’ Ranks In Name Of ‘Democracy’",
    "description": "'We want our gavels back'",
    "link": "https://dailycaller.com/2025/07/17/gavin-newsom-california-redistricting-midterms/",
    "timestamp": "2025-07-17T15:06:03Z"
  },
  {
    "title": "French Mural Mocks Trump With Lady Liberty Covering Eyes",
    "description": "As statements go, it's a big one. A towering mural in France of the Statue of Liberty covering her eyes is racking up millions of views online with its swipe at President Trump's immigration and deportation policies. Amsterdam-based street artist Judith de Le…",
    "link": "https://www.newser.com/story/372049/french-mural-mocks-trump-with-lady-liberty-covering-eyes.html",
    "timestamp": "2025-07-17T15:05:00Z"
  },
  {
    "title": "Chuck Schumer, Ed Markey Urge FCC Chairman to ‘End Partisan Attacks’ on CBS",
    "description": "The lawmakers also asked Brendan Carr to \"cease interfering with the judgement of independent news organizations\"\nThe post Chuck Schumer, Ed Markey Urge FCC Chairman to ‘End Partisan Attacks’ on CBS appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chuck-schumer-ed-markey-brendan-carr-fcc-partisan-attacks-cbs-letter/",
    "timestamp": "2025-07-17T15:03:03Z"
  },
  {
    "title": "Lady Gaga Stage Becomes 'Political Weapon' During Mayhem Tour Opening Night",
    "description": "\"Little Monsters\" hurled foulmouthed messages at President Donald Trump ahead of the singer's performance at the T-Mobile Arena in Las Vegas.",
    "link": "https://www.newsweek.com/lady-gaga-mayhem-ball-tour-stage-political-weapon-2100188",
    "timestamp": "2025-07-17T15:01:44Z"
  },
  {
    "title": "Rocket Lab shoots up 8% after analysts raise price targets — is this the start of a bigger run?",
    "description": "Rocket Lab shares are soaring. This is due to analyst upgrades and excitement for the Neutron rocket. Government contracts are also anticipated. The Neutron rocket is set to launch in 2025. It aims to secure big space missions. Bank of America and Citi gave '…",
    "link": "https://economictimes.indiatimes.com/news/international/us/rocket-lab-shoots-up-8-after-analysts-raise-price-targets-is-this-the-start-of-a-bigger-run/articleshow/122649427.cms",
    "timestamp": "2025-07-17T15:01:23Z"
  },
  {
    "title": "Trump's Former VP Mike Pence: Release Epstein Files",
    "description": "The Epstein scandal has been exploding with Trump throwing his supporters under the bus, and firing a lead prosecutor in the Jeffrey Epstein/Ghislaine Maxwell cases. And now, his former vice president, Mike Pence, wants the Epstein Files released, saying, \"th…",
    "link": "https://crooksandliars.com/2025/07/trumps-former-vp-calls-releasing-all",
    "timestamp": "2025-07-17T15:01:04Z"
  },
  {
    "title": "Republicans shrug off laundry list of scandals, advance Emil Bove’s judicial nomination",
    "description": "Emil Bove is arguably the single most controversial circuit court nominee in modern American history. Republicans on the Senate Judiciary Committee didn't care.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/emil-bove-trump-judge-nomination-senate-republicans-rcna218833",
    "timestamp": "2025-07-17T15:01:01Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wcjb.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T15:00:50Z"
  },
  {
    "title": "Gastrointestinal cancers are rising dramatically in people under 50",
    "description": "Gastrointestinal cancers, which include colorectal, stomach and pancreatic cancer, are rising dramatically in younger adults. Doctors aren’t fully sure why.",
    "link": "https://www.nbcnews.com/health/health-news/gastrointestinal-cancers-are-rising-dramatically-people-50-rcna219104",
    "timestamp": "2025-07-17T15:00:40Z"
  },
  {
    "title": "Financial Titans Embrace Stablecoins: Bank Of America’s Move, Morgan Stanley’s Consideration",
    "description": "Several major US banks, including Bank of America and Citibank, are actively exploring the launch of stablecoins amid a shifting regulatory landscape in the United States that appears to be becoming more accommodating to digital assets. Traditional Finance Mo…",
    "link": "https://bitcoinist.com/financial-titan-embrace-stablecoins-bank-of-america/",
    "timestamp": "2025-07-17T15:00:24Z"
  },
  {
    "title": "5 ‘Big, Beautiful Bill’ changes to marketplace insurance",
    "description": "Your premiums might go up, and you might need to work harder to stay eligible.",
    "link": "https://www.bostonherald.com/2025/07/17/big-beautiful-bill-changes-health-insurance/",
    "timestamp": "2025-07-17T15:00:20Z"
  },
  {
    "title": "Shane Gillis’ Trump-Epstein Joke at the ESPYs Was Actually Quite Solid",
    "description": "Gillis’ burn of the President deserved better from the athletic audience",
    "link": "https://www.cracked.com/article_47423_shane-gillis-trump-epstein-joke-at-the-espys-was-actually-quite-solid.html",
    "timestamp": "2025-07-17T15:00:00Z"
  },
  {
    "title": "July 17 editorial cartoons",
    "description": "Thursday’s political cartoons also include the IRS allowing churches to endorse from the pulpit, and what Donald Trump thinks the letters ICE really stand for.",
    "link": "https://theweek.com/cartoons/july-17-2025-editorial-cartoons",
    "timestamp": "2025-07-17T15:00:00Z"
  },
  {
    "title": "St. Louis pauses minority business program in response to Trump’s DEI crackdown",
    "description": "St. Louis Development Corp. told applicants that “enforcement action” by the Justice Department prompted the agency to put the CertifySTL program on hold.",
    "link": "https://www.stltoday.com/news/local/business/article_f4f41c6e-18bc-47f3-827d-be7eb4ccd70c.html",
    "timestamp": "2025-07-17T15:00:00Z"
  },
  {
    "title": "ProPublica: The IRS Is Building A Vast System To Share Taxpayer Data With ICE",
    "description": "ProPublica, The IRS Is Building a Vast System to Share Millions of Taxpayers’ Data With ICE: The Internal Revenue Service is building a computer program that would give deportation officers unprecedented access to confidential tax data. ProPublica has obtaine…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/07/propublica-the-irs-is-building-a-vast-system-to-share-taxpayer-data-with-ice.html",
    "timestamp": "2025-07-17T15:00:00Z"
  },
  {
    "title": "Gastrointestinal cancers rising dramatically in people under 50",
    "description": "Gastrointestinal cancers, which include colorectal, stomach and pancreatic cancer, are rising dramatically in younger adults. Doctors aren’t fully sure why.",
    "link": "https://www.nbcnews.com/health/health-news/gastrointestinal-cancers-rising-dramatically-people-50-rcna219104",
    "timestamp": "2025-07-17T15:00:00Z"
  },
  {
    "title": "Ex-Trump Employee Drops Massive Bombshell About Epstein Relationship",
    "description": "One of Donald Trump’s former employees is drawing a line connecting Jeffrey Epstein and the real estate mogul.The former president and chief operating officer of Trump Plaza Hotel and Casino in Atlantic City, Jack O’Donnell, told CNN Wednesday that he once ha…",
    "link": "https://newrepublic.com/post/198069/donald-trump-ex-worker-bombshell-epstein-relationship",
    "timestamp": "2025-07-17T14:59:05Z"
  },
  {
    "title": "Timeline of 'scam artist' Adam Schiff's mortgage fraud allegations stretching back years",
    "description": "Longtime Trump political foe, Sen. Adam Schiff, was referred to the Department of Justice to face criminal prosecution over alleged mortgage fraud that reportedly stretches back years.",
    "link": "https://www.foxnews.com/politics/timeline-scam-artist-adam-schiffs-mortgage-fraud-allegations-stretching-back-years",
    "timestamp": "2025-07-17T14:58:46Z"
  },
  {
    "title": "Trump Goes Full Nixon; Fires Epstein Prosecutor",
    "description": "Saturday Night Massacre, here we go again. \nYes, Maurene Comey is the daughter of former FBI director and Trump nemesis Jim Comey but, as Politico noted, she had “worked in the U.S. attorney’s office for nearly a decade.” That means she was there for all or t…",
    "link": "https://crooksandliars.com/2025/07/trump-just-fired-lead-jeffrey-epstein",
    "timestamp": "2025-07-17T14:58:40Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.kold.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:58:23Z"
  },
  {
    "title": "Comedian Shane Gillis' joke about Caitlin Clark at the ESPY Awards doesn't go as planned",
    "description": "Caitlin Clark found herself underfire at the 33rd ESPY Awards as Shane Gillis delivered an opening monologue that quickly sparked debate across the sports world by targeting the In",
    "link": "https://www.marca.com/en/basketball/wnba/indiana-fever/2025/07/17/6878eb8f268e3e58348b458a.html",
    "timestamp": "2025-07-17T14:57:23Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wsaw.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:56:59Z"
  },
  {
    "title": "Who are the MAGA influencers calling for Pam Bondi’s head over Epstein?",
    "description": "Tesla, Pizzagate and diet supplements: welcome to the world of Epstein conspiracy theorists.",
    "link": "https://www.aljazeera.com/news/2025/7/17/who-are-the-maga-influencers-calling-for-pam-bondis-head-over-epstein",
    "timestamp": "2025-07-17T14:56:17Z"
  },
  {
    "title": "Trump's nuclear power push weakens regulator and poses safety risks, former officials warn",
    "description": "President Donald Trump wants to slash regulations and speed up power plant approvals through an overhaul of the Nuclear Regulatory Commission.",
    "link": "https://biztoc.com/x/211347beeb2cae8b",
    "timestamp": "2025-07-17T14:55:44Z"
  },
  {
    "title": "Epstein, Antichrists & Dragons: Crypto Week in Congress Nearly Goes Off the Rails",
    "description": "What does Crypto Week in Congress, and the drama that ensued Wednesday, have to do with the Jeffrey Epstein scandal? More than you might think, according to D.C. policy insiders.",
    "link": "https://decrypt.co/330563/epstein-antichrists-dragons-crypto-week-congress-nearly-off-rails",
    "timestamp": "2025-07-17T14:55:32Z"
  },
  {
    "title": "'Dear God': Democrats storm out of vote on controversial Trump nominee",
    "description": "Democrats left the room before the panel voted to confirm the judicial nomination of Trump's former personal attorney, Emil Bove.",
    "link": "https://www.foxnews.com/politics/dear-god-democrats-storm-out-vote-controversial-trump-nominee",
    "timestamp": "2025-07-17T14:54:46Z"
  },
  {
    "title": "Markets will 'crash' if Trump fires Powell, Sen. Warren warns",
    "description": "Trump wants Powell to lower interest rates in order to boost the economy, but the Fed chair has said the president's tariff plans have kept him from doing so.",
    "link": "https://www.cnbc.com/2025/07/17/trump-powell-warren-market-crash.html",
    "timestamp": "2025-07-17T14:51:48Z"
  },
  {
    "title": "Wipro starts the year slow but pins hopes on large deals",
    "description": "Wipro became India’s third large IT outsourcer to cut headcount in the first quarter, joining HCL Technologies and Tech Mahindra, which signals murkier waters ahead for India’s information technology services sector.",
    "link": "https://www.livemint.com/companies/wipro-q1-earnings-large-deals-wins-uncertainties-11752757369303.html",
    "timestamp": "2025-07-17T14:51:03Z"
  },
  {
    "title": "'A dreadful idea': Why Wall Street's brightest minds hate the idea of Trump firing Fed Chair Powell",
    "description": "Top voices on Wall Street have expressed alarm over the idea that Trump could fire Fed Chair Jerome Powell, emphasizing the need for Fed independence.",
    "link": "https://www.businessinsider.com/jerome-powell-trump-fed-chairman-stock-market-inflation-economy-rates-2025-7",
    "timestamp": "2025-07-17T14:50:39Z"
  },
  {
    "title": "‘They Tried to Kill Him!’ Rogan Reveals What Convinced Him to Interview Trump",
    "description": "Joe Rogan revealed multiple revelations convinced him to conduct his late-minute interview with President Donald Trump last year.\nThe post ‘They Tried to Kill Him!’ Rogan Reveals What Convinced Him to Interview Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/they-tried-to-kill-him-rogan-reveals-what-convinced-him-to-interview-trump/",
    "timestamp": "2025-07-17T14:48:43Z"
  },
  {
    "title": "Stephen Miller faces pushback after weird claims about immigrant crime in Minneapolis",
    "description": "As crime rates fall, why are Trump administration officials pretending that public safety is getting worse? Because of the twisted politics of fear.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/stephen-miller-faces-pushback-weird-claims-immigrant-crime-minneapolis-rcna219322",
    "timestamp": "2025-07-17T14:47:21Z"
  },
  {
    "title": "China's turn towards the 'Global South': Europe is not Beijing's priority",
    "description": "China's turn towards the 'Global South': Europe is not Beijing's priority\nmarianna.liana…\nThu, 07/17/2025 - 17:47\n\n\n 7 minutes\n \n To what extent is China ready to respond to the EU's demands on market access, overcapacity, rare earths or Ukraine? Preparations…",
    "link": "https://www.iss.europa.eu/publications/commentary/chinas-turn-towards-global-south-europe-not-beijings-priority",
    "timestamp": "2025-07-17T14:47:17Z"
  },
  {
    "title": "Trump's nuclear power push weakens regulator and poses safety risks, former officials warn",
    "description": "President Donald Trump wants to slash regulations and speed up power plant approvals through an overhaul of the Nuclear Regulatory Commission.",
    "link": "https://www.cnbc.com/2025/07/17/trumps-nuclear-power-push-weakens-regulator-and-poses-safety-risks-former-officials-warn.html",
    "timestamp": "2025-07-17T14:45:31Z"
  },
  {
    "title": "'Double standards': India claps back at NATO over sanctions warning on Russia oil deals",
    "description": "India has firmly pushed back against NATO Secretary General Mark Rutte’s warning of secondary sanctions over its continued trade with Russia, asserting that its energy procurement decisions are based on national interest and market conditions. External Affair…",
    "link": "https://economictimes.indiatimes.com/news/india/double-standards-india-claps-back-at-nato-over-sanctions-warning-on-russia-oil-deals/articleshow/122649885.cms",
    "timestamp": "2025-07-17T14:45:06Z"
  },
  {
    "title": "Trump Says Coca-Cola Agrees to Use Cane Sugar for Coke in US",
    "description": "In This Article:\n(Bloomberg) -- President Donald Trump said in a Truth Social post on Wednesday that Coca-Cola Co. has agreed to use cane sugar in Coke beverages sold in the US.\nMost Read from Bloomberg\n“I have been speaking to Coca-Cola about using REAL Cane…",
    "link": "https://biztoc.com/x/9393bd8a02e62ad1",
    "timestamp": "2025-07-17T14:45:04Z"
  },
  {
    "title": "A Dog, a Spymaster, and Trump’s Thirst for ‘Deep State’ Revenge",
    "description": "The pettiness of the administration’s retribution campaign begins to bite.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/07/james-clapper-cia-dog-trump/683575/",
    "timestamp": "2025-07-17T14:45:00Z"
  },
  {
    "title": "Airline CEO sounds alarm about COVID-style shutdown",
    "description": "After accusing the South American country of \"unfair\" trading practices and a \"witch hunt\" in prosecuting former President Jair Bolsonaro for attempts to overturn the 2022 election, Donald Trump is threatening to impose 50% tariffs on Brazilian goods sold to …",
    "link": "https://biztoc.com/x/7850562070c5975d",
    "timestamp": "2025-07-17T14:44:26Z"
  },
  {
    "title": "Trump's Truth Social, Rumble Escalate Legal War With Brazil Supreme Court",
    "description": "A Brazilian judge's order involving a U.S. citizen has intensified global free speech tensions over alleged online censorship.",
    "link": "https://www.newsweek.com/trump-truth-social-rumble-escalate-legal-war-brazil-supreme-court-2100114",
    "timestamp": "2025-07-17T14:44:25Z"
  },
  {
    "title": "Full List of Republicans Urging Trump to Unfreeze Funds for K-12 Schools",
    "description": "Ten GOP Senators signed a letter urging the Trump administration to unfreeze the congressionally appropriated funds.",
    "link": "https://www.newsweek.com/full-list-republicans-urging-trump-unfreeze-funds-k-12-schools-2100246",
    "timestamp": "2025-07-17T14:43:17Z"
  },
  {
    "title": "Trump Admin Tells California To Kiss Federal Cash For High-Speed Rail Boondoggle Goodbye",
    "description": "The Trump administration announced that it stripped about $4 billion from California's high-speed rail project following years of widespread criticism.",
    "link": "https://dailycaller.com/2025/07/17/trump-admin-cuts-california-high-speed-rail-funding/",
    "timestamp": "2025-07-17T14:41:37Z"
  },
  {
    "title": "Indonesia rejects transshipments, commits to US trade deal",
    "description": "Indonesia will reject transshipments from other countries and remains committed to its new trade agreement with the United States, Trade Minister Budi Santoso ...",
    "link": "https://en.antaranews.com/news/367141/indonesia-rejects-transshipments-commits-to-us-trade-deal",
    "timestamp": "2025-07-17T14:40:34Z"
  },
  {
    "title": "CBS News reporter says he got 'PTSD' from Trump assassination attempt because of crowd anger at media",
    "description": "CBS News Capitol Hill correspondent Scott MacFarlane told Chuck Todd he feared for his life when Trump supporters turned on the media following the assassination attempt.",
    "link": "https://www.foxnews.com/media/cbs-news-reporter-says-he-got-ptsd-from-trump-assassination-attempt-because-crowd-anger-media",
    "timestamp": "2025-07-17T14:39:03Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wsaz.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:37:10Z"
  }
]