[
  {
    "title": "US nuclear weapons costs projected to soar to $946 billion",
    "description": "The cost of modernizing the US nuclear forces through 2034 is expected to rise to $946 billion.",
    "link": "https://www.globalsecurity.org/wmd/library/news/usa/2025/usa-250425-presstv01.htm",
    "timestamp": "2025-04-26T08:22:14Z"
  },
  {
    "title": "President Donald Trump and First Lady Melania Trump Attend Pope Francis’ Funeral, with Melania in Black Veil",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f9454f9f-cf26-49fc-a0e1-33b2aa64d0fc",
    "timestamp": "2025-04-26T08:21:56Z"
  },
  {
    "title": "xAI Holdings aims for $120 billion valuation with fresh $20 billion fund raise: Report",
    "description": "Elon Musk's xAI Holdings is seeking $20 billion in funding, potentially valuing the company at over $120 billion. This could become the second largest funding round ever, following OpenAI's $40 billion.&nbsp;",
    "link": "https://www.livemint.com/companies/news/xai-holdings-aims-for-120-billion-valuation-with-fresh-20-billion-fund-raise-report-11745650424937.html",
    "timestamp": "2025-04-26T08:21:25Z"
  },
  {
    "title": "World Leaders Gather For Pope Francis Funeral: Trump, Zelensky, Prince William Among Mourners (See Images)",
    "description": "170 world leaders have joined an estimated 250,000 people gathered in Rome to farewell Pope Francis, whose funeral took place at St Peter’s Basilica. US President Donald Trump and Ukraine’s leader Volodymyr Zelenskyy was among the high-profile figures to take…",
    "link": "http://deadline.com/2025/04/pope-francis-funeral-rome-donald-trump-zelensky-mourners-1236377629/",
    "timestamp": "2025-04-26T08:19:49Z"
  },
  {
    "title": "Trump had 'very productive discussion' with Zelensky before Pope Francis funeral - White House",
    "description": "US President Donald Trump had a \"very productive discussion\" with Ukrainian President Volodymyr Zelensky ahead",
    "link": "https://www.jpost.com/breaking-news/article-851572",
    "timestamp": "2025-04-26T08:12:14Z"
  },
  {
    "title": "President Trump Arrives at Vatican For Pope Francis Funeral",
    "description": "President Trump joined the gathered mourners outside St Peter's Basilica, having flown overnight to Italy for the funeral of Pope Francis. \nThe post President Trump Arrives at Vatican For Pope Francis Funeral appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/26/president-trump-arrives-at-vatican-for-pope-francis-funeral/",
    "timestamp": "2025-04-26T08:09:06Z"
  },
  {
    "title": "Pope Francis breaks thousand year-old tradition being buried in plain wooden box",
    "description": "The late Catholic Church leader opted to break tradition by being buried in one coffin as opposed to three",
    "link": "https://www.ladbible.com/news/world-news/pope-francis-funeral-buried-wooden-box-breaks-tradition-761760-20250425",
    "timestamp": "2025-04-26T08:08:19Z"
  },
  {
    "title": "Pope Francis’ funeral begins at St Peter's Square (livestream)",
    "description": "VATICAN CITY (AP): As many as 200,000 people are expected to attend Pope Francis' funeral in St Peter's Square as he is being laid to rest on Saturday (April 26). Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/26/pope-francis-funeral-begins-at-st-peter039s-square",
    "timestamp": "2025-04-26T08:08:00Z"
  },
  {
    "title": "U.S. and Iran to hold third round of nuclear talks in Oman",
    "description": "President Donald Trump has said that he would not let Israel drag him into a war with Tehran, however, if a deal is not made, he would 'go in very willingly' on an attack on Iran",
    "link": "https://www.haaretz.com/middle-east-news/2025-04-26/ty-article/u-s-and-iran-to-hold-third-round-of-nuclear-talks-in-oman/00000196-7049-dc28-a3f6-7bcdf4760000",
    "timestamp": "2025-04-26T08:06:01Z"
  },
  {
    "title": "Pope Francis Funeral Underway With Global Media and World Leaders Gathered at Vatican (Updating Live)",
    "description": "The funeral of Pope Francis is underway in St. Peter’s square, where hundreds of thousands of people have gathered, including 50 heads of state, 10 reigning monarchs and throngs of global media outlets providing coverage of the ritual expected to draws billio…",
    "link": "https://variety.com/2025/global/news/pope-francis-funeral-vatican-1236376940/",
    "timestamp": "2025-04-26T08:03:05Z"
  },
  {
    "title": "North Korea Launches New 5,000-Tonne Warship With \"Most Powerful Weapons\"",
    "description": "The announcement comes about a month after Kim oversaw the test of new suicide and reconnaissance drones featuring AI technology, adding to concerns over North Korea&#039;s deepening military cooperation with Moscow.",
    "link": "https://www.ndtv.com/world-news/choe-hyon-north-korea-kim-jong-un-launches-new-5-000-tonne-warship-with-most-powerful-weapons-8261139",
    "timestamp": "2025-04-26T08:02:37Z"
  },
  {
    "title": "Surrealing in the Years: Ireland and the world at large descending into Dan Brown farce",
    "description": "One dead Pope and at least four nuclear-armed countries in varying states of tension with one another.",
    "link": "https://www.thejournal.ie/readme/surrealing-in-the-years-87-6687023-Apr2025/",
    "timestamp": "2025-04-26T08:00:55Z"
  },
  {
    "title": "Watching Papal Transitions Change With the Times",
    "description": "From the rudimentary camera phones that snapped blurry photos of John Paul II's body, to AI images of Pope Francis, even the Catholic Church is now fully a part of our digital era.",
    "link": "https://www.newsweek.com/watching-papal-transitions-change-times-2064288",
    "timestamp": "2025-04-26T08:00:01Z"
  },
  {
    "title": "The news cycle is tumultuous. News satirists aim to deliver the laughs people 'need so badly'",
    "description": "Given a federal election campaign, whiplash over tariffs, a mercurial leader to the south, plus a steady stream of everything else going on in the world, satirists think humour can be the balm we need.",
    "link": "https://www.cbc.ca/radio/sunday/political-satire-chaotic-times-1.7516365",
    "timestamp": "2025-04-26T08:00:00Z"
  },
  {
    "title": "Greens fight for survival as federal polls predict worst results in recent history",
    "description": "Polls suggest the Green Party is at risk of being wiped off Canada's electoral map on election night, but co-Leader Elizabeth May believes the numbers don't reflect the party's ground game.",
    "link": "https://www.cbc.ca/news/politics/green-party-2025-federal-election-electoral-fortunes-1.7518337",
    "timestamp": "2025-04-26T08:00:00Z"
  },
  {
    "title": "A consequential election ends with a stark choice and an uncertain future",
    "description": "In Canada, even before this spring, the notion that any given election was possibly the 'most important' to have ever occurred was in some danger of becoming a cliché. But this time around, it's at least much harder to dispute.",
    "link": "https://www.cbc.ca/news/politics/election-carney-poilievre-trump-analysis-1.7519010",
    "timestamp": "2025-04-26T08:00:00Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "The funeral of Pope Francis is taking place, and Virginia Giuffre, accuser of the UK’s Prine Andrew, has died.",
    "link": "https://www.thejournal.ie/9-at-9-saturday-pope-funeral-6688272-Apr2025/",
    "timestamp": "2025-04-26T08:00:00Z"
  },
  {
    "title": "Elon Musk pulls back from Trump's DOGE role to refocus on Tesla",
    "description": "Musk posted a picture of himself wearing an X-branded t-shirt, instead of the \"Tech Support\" and \"DOGE\" t-shirts he has frequently been wearing since Donald Trump returned as US President. The post comes days after Tesla’s earnings call, where the car maker r…",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musk-pulls-back-from-trumps-doge-role-to-refocus-on-tesla/articleshow/120641123.cms",
    "timestamp": "2025-04-26T07:58:30Z"
  },
  {
    "title": "Trump and First Lady pay respects to Pope Francis",
    "description": "US President Donald Trump and First Lady Melania Trump paid their respects to Pope Francis this morning on Saturday, standing solemnly in front of the pope's coffin at St. Peter's Basilica. The couple...",
    "link": "https://biztoc.com/x/4c8a05d421e7d79b",
    "timestamp": "2025-04-26T07:57:58Z"
  },
  {
    "title": "China foreign minister says Trump's tariffs reveal 'extreme egoism' as he speaks out against protectionism",
    "description": "Chinese Foreign Minister Wang Yi said Friday that Beijing backs international rules when it comes to tariffs imposed by U.S. President Donald Trump and that the U.S. levies show \"extreme egoism.\"\nThe foreign minister made the comments while he was in Kazakhst…",
    "link": "https://biztoc.com/x/3223a765504923f5",
    "timestamp": "2025-04-26T07:57:57Z"
  },
  {
    "title": "Trump met with Zelenskyy ahead of Pope's funeral",
    "description": "Donald Trump has met Volodymyr Zelenskyy ahead of the Pope's funeral, according to Vatican sources.",
    "link": "https://news.sky.com/story/trump-met-with-zelenskyy-ahead-of-popes-funeral-13355783",
    "timestamp": "2025-04-26T07:57:00Z"
  },
  {
    "title": "'I will keep fighting' to bring everyone home, Noa Argamani says at Time Magazine gala",
    "description": "Argamani, who survived 246 days of captivity in Gaza before being rescued during Operation Arnon, has been named to Time Magazine’s list of the 100 most influential people.",
    "link": "https://www.jpost.com/israel-news/article-851570",
    "timestamp": "2025-04-26T07:55:58Z"
  },
  {
    "title": "Virginia Giuffre, Jeffrey Epstein and Prince Andrew accuser, dies by suicide, says family",
    "description": "Giuffre settled lawsuit against Andrew after she said she was trafficked by Epstein and Ghislaine Maxwell",
    "link": "https://www.irishtimes.com/world/australia/2025/04/26/virginia-giuffre-death-jeffrey-epstein-prince-andrew/",
    "timestamp": "2025-04-26T07:55:51Z"
  },
  {
    "title": "US Judge Arrested For Obstructing Immigration Arrest In Trump Crackdown",
    "description": "Hannah Dugan, a Milwaukee County circuit judge, allegedly &quot;intentionally misdirected federal agents away from the subject&quot; whom agents were intending to detain at her courthouse, FBI director Kash Patel said in a post on X.",
    "link": "https://www.ndtv.com/world-news/hannah-dugan-us-judge-arrested-for-obstructing-immigration-arrest-in-donald-trump-crackdown-8261077",
    "timestamp": "2025-04-26T07:54:46Z"
  },
  {
    "title": "CEO of cybersecurity firm charged with installing malware on hospital systems",
    "description": "Veritaco CEO Jeffrey Bowie faces charges for allegedly installing malware on hospital computers, violating Oklahoma’s Computer Crimes Act. Jeffrey Bowie, CEO of the cybersecurity firm Veritaco, is facing two counts of violating Oklahoma’s Computer Crimes Act …",
    "link": "https://securityaffairs.com/177020/cyber-crime/ceo-of-cybersecurity-firm-charged-with-installing-malware-on-hospital-systems.html",
    "timestamp": "2025-04-26T07:53:27Z"
  },
  {
    "title": "Zelensky Publicly Rejected Trump's Peace Plan, Preferring Push For Maximalist Total Victory Scenario",
    "description": "Even as talks progress and Trump says there is hope for a deal, Zelensky saying the Ukrainian constitution calls for total victory.\nThe post Zelensky Publicly Rejected Trump’s Peace Plan, Preferring Push For Maximalist Total Victory Scenario appeared first on…",
    "link": "https://www.breitbart.com/europe/2025/04/26/zelensky-publicly-rejected-trumps-peace-plan-preferring-push-for-maximalist-total-victory-scenario/",
    "timestamp": "2025-04-26T07:42:06Z"
  },
  {
    "title": "Trump reacts to Moscow car bombing that killed Russian general",
    "description": "The Kremlin suspects that the assassination of Yaroslav Moskalik was orchestrated by Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616348-trump-reacts-assassination-russian-general/",
    "timestamp": "2025-04-26T07:39:18Z"
  },
  {
    "title": "Trump's maritime push opens door for US-Taiwan shipbuilding ties",
    "description": "Since US President Donald Trump took office, trade tensions between the US and China have escalated, although a recent easing of tariffs announced on April 23 suggests a more calibrated approach. Nevertheless, the overall competition between the two nations c…",
    "link": "https://www.digitimes.com/news/a20250424PD217/donald-trump-maritime-taiwan-security-shipping.html",
    "timestamp": "2025-04-26T07:36:22Z"
  },
  {
    "title": "Royalty and presidents join mourners at Pope Francis' funeral",
    "description": "Among those attending from more than 150 countries will be US President Donald Trump, who clashed with Francis on numerous occasions over their starkly contrasting positions on immigration.",
    "link": "https://www.jpost.com/breaking-news/article-851571",
    "timestamp": "2025-04-26T07:35:37Z"
  },
  {
    "title": "The seating chart at Pope Francis’ funeral won’t prioritize Donald Trump’s ego",
    "description": "Funerals can be contentious events, and Pope Francis’ funeral Saturday — which dozens of (often combative) world leaders will be attending — is no exception.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/pope-francis-funeral-vatican-attend-leaders-trump-zelenskyy-rcna202502",
    "timestamp": "2025-04-26T07:30:00Z"
  },
  {
    "title": "LIVE: The funeral of Pope Francis",
    "description": "Volodymyr Zelensky arrived in Rome ahead of a possible meeting with Donald Trump on the sidelines of Pope Francis's funeral.",
    "link": "https://biztoc.com/x/ac2dad54e4491525",
    "timestamp": "2025-04-26T07:27:40Z"
  },
  {
    "title": "Trump Arrives in Italy for Pope Francis' Funeral",
    "description": "US President Donald Trump and first lady Melania Trump arrived in Rome on Friday evening ahead of Pope Francis' funeral, ...",
    "link": "https://biztoc.com/x/e78817168d23bed2",
    "timestamp": "2025-04-26T07:27:26Z"
  },
  {
    "title": "U.S. lawmakers urge Trump to tackle N Korea's abductions of Japanese",
    "description": "A bipartisan group of U.S. legislators has sent a letter to President Donald Trump urging him to prioritize the prompt return of Japanese nationals abducted by North Korea decades ago, the office of one of the lawmakers said Friday. &quot;As you craft and imp…",
    "link": "https://japantoday.com/category/politics/u.s.-lawmakers-urge-trump-to-tackle-n.-korea%27s-abductions-of-japanese",
    "timestamp": "2025-04-26T07:24:59Z"
  },
  {
    "title": "Trump Signals Possible Support For Millionaires Tax Amid Election Concerns, Recalls George Bush's Promise: 'He Said Read My Lips And… Lost An Election'",
    "description": "In an interview published Friday, President Donald Trump expressed openness to a tax increase on millionaires, despite previous opposition. He noted that his main concern is the potential impact on his electoral prospects.\nWhat Happened: In an interview with …",
    "link": "https://biztoc.com/x/b14b92a92d66525f",
    "timestamp": "2025-04-26T07:24:48Z"
  },
  {
    "title": "Trump says tariff deal with Japan 'very close' to completion",
    "description": "President Donald Trump said Friday that the United States is &quot;very close&quot; to a deal with Japan as the two countries continue talks over U.S. tariffs. His remarks came as Ryosei Akazawa, Japan's chief representative in tariff negotiations with the U.…",
    "link": "https://japantoday.com/category/politics/trump-says-tariff-deal-with-japan-very-close-to-completion",
    "timestamp": "2025-04-26T07:24:15Z"
  },
  {
    "title": "Health Ministry closely monitoring new US tariffs, focusing on medical devices, pharmaceutical products, says Dr Dzulkefly",
    "description": "KOTA BARU: The Health Ministry is closely monitoring two key issues following the tariffs imposed by United States (US) President Donald Trump, particularly those affecting medical devices and pharmaceutical products. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/26/health-ministry-closely-monitoring-new-us-tariffs-focusing-on-medical-devices-pharmaceutical-products-says-dr-dzulkefly",
    "timestamp": "2025-04-26T07:19:00Z"
  },
  {
    "title": "What to know about the funeral and burial of Pope Francis",
    "description": "Here are the key things to know about the funeral of the first Latin American pontiff in the church’s history.",
    "link": "https://www.bostonherald.com/2025/04/26/pope-francis-burial/",
    "timestamp": "2025-04-26T07:15:49Z"
  },
  {
    "title": "Jon Voight seeks to revive Hollywood's golden age, Marketing & Advertising News, ET BrandEquity",
    "description": "Jon Voight aims to revive Hollywood's Golden Age. As film production in Los Angeles has declined significantly, Voight and Steven Paul advocate for increased tax incentives in California. They propose raising the annual incentives to $750 million. This initia…",
    "link": "https://brandequity.economictimes.indiatimes.com/news/media/voight-seeks-to-revive-hollywoods-golden-age-with-trump-backed-tax-credits/120638679",
    "timestamp": "2025-04-26T07:11:03Z"
  },
  {
    "title": "What to know about the funeral and burial of Pope Francis",
    "description": "Pope Francis died on Easter Monday at the age of 88 after a 12-year papacy",
    "link": "https://abcnews.go.com/International/wireStory/funeral-burial-pope-francis-121185370",
    "timestamp": "2025-04-26T07:10:34Z"
  },
  {
    "title": "Watch Live: Pope Francis' funeral set to begin at the Vatican",
    "description": "The funeral service for Pope Francis is taking place Saturday morning at the Vatican. Watch the ceremony live.",
    "link": "https://www.cbsnews.com/news/pope-francis-funeral-procession-watch/",
    "timestamp": "2025-04-26T07:03:42Z"
  },
  {
    "title": "Why Trump's call for the Fed to cut interest rates may not help consumers",
    "description": "Why Trump's call for the Fed to cut interest rates may not help consumers\nPresident Donald Trump is badgering the Federal Reserve to cut interest rates, but even if the Fed gave in to the pressure, it wouldn’t necessarily lead to lower borrowing costs for con…",
    "link": "https://biztoc.com/x/28e52450cbaaf567",
    "timestamp": "2025-04-26T07:02:54Z"
  },
  {
    "title": "Ethereum Up 12% In a Week, but Derivatives Data Suggests Caution",
    "description": "Ethereum is gradually regaining momentum after a recent correction, now trading above $1,700, reflecting a 12.2% increase over the past week. This recovery has drawn attention from analysts, who seem to be looking into the asset’s movement for signs of sustai…",
    "link": "http://www.newsbtc.com/news/ethereum/ethereum-up-12-in-a-week-but-derivatives-data-suggests-caution/",
    "timestamp": "2025-04-26T07:00:04Z"
  },
  {
    "title": "How To Watch Pope Francis' Funeral: Live Stream, TV Channel",
    "description": "The world is getting ready to say a final farewell to Pope Francis. The funeral for Pope Francis will take place on Saturday, April 26, starting at 4 a.m. ET.",
    "link": "https://www.newsweek.com/entertainment/how-watch-pope-francis-funeral-live-stream-tv-channel-2064487",
    "timestamp": "2025-04-26T07:00:01Z"
  },
  {
    "title": "Inside First Lady Melania Trump and President Donald Trump's Marriage",
    "description": "Melania Trump has jet, will travel.\n\"I will be in the White House,\" the first lady told Fox & Friends a week before President Donald Trump was sworn in for a second term in January. \"When I need...",
    "link": "https://www.eonline.com/news/1416560/inside-melania-trump-donald-trumps-marriage",
    "timestamp": "2025-04-26T07:00:00Z"
  },
  {
    "title": "Did Apple Just Save the iPhone From Extreme Tariff Price Hikes?",
    "description": "Shifting strategies leave tariff hikes in limbo. Experts share ways you can save on electronics even if prices go up.",
    "link": "https://www.cnet.com/personal-finance/taxes/did-apple-just-save-the-iphone-from-extreme-tariff-price-hikes/",
    "timestamp": "2025-04-26T07:00:00Z"
  },
  {
    "title": "Tens of thousands gather to say farewell to Pope Francis",
    "description": "Tens of thousands of people have packed St Peter's Square as the funeral of Pope Francis begins.",
    "link": "https://news.sky.com/story/tens-of-thousands-gather-to-say-farewell-to-pope-francis-13355764",
    "timestamp": "2025-04-26T06:59:00Z"
  },
  {
    "title": "Trump’s attacks on media tests US First Amendment press freedom",
    "description": "From banning reporters from the Oval Office to trying to dismantle VOA, Trump’s moves against the press have sparked legal battles, with experts warning that press freedom — and US democracy itself — is threatened.",
    "link": "https://www.dw.com/en/trumps-attacks-on-media-tests-us-first-amendment-press-freedom/a-72359073",
    "timestamp": "2025-04-26T06:58:00Z"
  },
  {
    "title": "Taiwan envoy to pope's funeral says he aims to chat with world leaders",
    "description": "TAIPEI: Taiwan's envoy to the funeral of Pope Francis aims to use his attendance to \"have a good chat\" with leaders of countries who are friendly to Taipei, taking the opportunity to boost the international ties of the diplomatically-isolated island. While th…",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-envoy-popes-funeral-says-he-aims-chat-world-leaders-5090796",
    "timestamp": "2025-04-26T06:41:23Z"
  },
  {
    "title": "US consumer sentiment sees largest drop since 1990 after Trump tariff chaos",
    "description": "US consumer sentiment plummeted in April after Donald Trump’s trade war threw the global economy into chaos, according to a new report.\nThe index of consumer sentiment, a score based on a monthly survey asking Americans about their financial outlooks, fell by…",
    "link": "https://biztoc.com/x/a76ade9fb0b16531",
    "timestamp": "2025-04-26T06:40:35Z"
  },
  {
    "title": "Royalty and presidents joining multitude of mourners at Pope Francis' funeral",
    "description": "The Vatican says some 250,000 mourners will fill the vast, cobbled esplanade and the main access route to the basilica to follow the ceremony.",
    "link": "https://www.japantimes.co.jp/news/2025/04/26/world/pope-francis-funeral/",
    "timestamp": "2025-04-26T06:38:00Z"
  },
  {
    "title": "Epstein, Prince Andrew accuser Virginia Giuffre dies by suicide: Family",
    "description": "The 41-year-old's family issued a statement, confirming she took her own life at her farm in Western Australia.",
    "link": "https://www.aljazeera.com/news/2025/4/26/epstein-prince-andrew-accuser-virginia-giuffre-dies-by-suicide-family",
    "timestamp": "2025-04-26T06:35:44Z"
  },
  {
    "title": "The Latest: Mourners race to get standing room spot in St. Peter’s Square for Pope Francis’ funeral",
    "description": "As many as 200,000 people are expected to attend Pope Francis’ funeral in St. Peter’s Square as he is being laid to rest",
    "link": "https://abcnews.go.com/International/wireStory/latest-mourners-race-standing-room-spot-st-peters-121185274",
    "timestamp": "2025-04-26T06:30:28Z"
  },
  {
    "title": "Iran and the US prepare for expert talks in Oman over Tehran's rapidly advancing nuclear program",
    "description": "Iran and the United States are preparing to start in-depth negotiations in Oman over Tehran’s rapidly advancing nuclear program, talks that likely will hinge on the Islamic Republic’s enrichment of uranium",
    "link": "https://abcnews.go.com/US/wireStory/iran-us-prepare-expert-talks-oman-tehrans-rapidly-121185368",
    "timestamp": "2025-04-26T06:30:26Z"
  },
  {
    "title": "Who is going to the pope's funeral (and who definitely isn't)?",
    "description": "The ceremony gets under way at 9am Irish time.",
    "link": "https://www.thejournal.ie/who-attending-pope-funeral-today-6687080-Apr2025/",
    "timestamp": "2025-04-26T06:30:20Z"
  },
  {
    "title": "Andrew Tate and the manosphere: a short guide",
    "description": "It is widely believed that boys and young men are absorbing sexist attitudes online, from influencers in the manosphere",
    "link": "https://theweek.com/politics/andrew-tate-and-the-manosphere-a-short-guide",
    "timestamp": "2025-04-26T06:21:00Z"
  },
  {
    "title": "UK Government’s Steel Gambit Risks Being Undone by Trade War",
    "description": "The immediate crisis at British Steel has passed, but by taking control of the country’s last maker of virgin steel, the UK government has put itself in the crossfire of a global trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-governments-steel-gambit-risks-being-undone-by-trade-war",
    "timestamp": "2025-04-26T06:20:11Z"
  },
  {
    "title": "China's Xi Jinping says China must 'overcome' AI chip challenges",
    "description": "President Xi Jinping said China must \"overcome\" the challenges of developing core AI technologies including high-end chips, state media reported Saturday, as Beijing seeks to become a world leader in the rapidly developing industry. In this context, Xi called…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/chinas-xi-jinping-says-china-must-overcome-ai-chip-challenges/articleshow/120638799.cms",
    "timestamp": "2025-04-26T06:18:47Z"
  },
  {
    "title": "Updates: Pope Francis Funeral Today; President Murmu, Trump At Vatican",
    "description": "Pope Francis died at the age of 88 on April 21 due to a stroke, weeks after he returned home after battling double pneumonia.",
    "link": "https://www.ndtv.com/world-news/pope-francis-funeral-updates-president-murmu-donald-trump-in-rome-vatican-city-st-peters-square-pope-francis-death-8260491",
    "timestamp": "2025-04-26T06:18:43Z"
  },
  {
    "title": "Big Take, 영국트럼프당과 포퓰리즘에 관한 비판",
    "description": "Today on “The Intelligence”: can Mark Carney unite Canada, will America build ships in Asia, and how “The Economist” reported the Nazis’ defeat in 1945 https://t.co/fcVZEZz25e — The Economist (@TheEconomist) April 25, 2025 Shopify tried to recruit Canadian …",
    "link": "https://ryueyes11.tistory.com/511584",
    "timestamp": "2025-04-26T06:15:41Z"
  },
  {
    "title": "In Trump’s America, it can be dangerous to criticise the president’s friends",
    "description": "Worldview: The administration has rescinded the legal status of close to 1,000 international university students since mid-March",
    "link": "https://www.irishtimes.com/opinion/2025/04/26/in-trumps-america-it-can-be-dangerous-to-criticise-the-presidents-friends/",
    "timestamp": "2025-04-26T06:15:00Z"
  },
  {
    "title": "Trump says Russia-Ukraine deal 'very close' after new Kremlin talks",
    "description": "Amidst ongoing conflict, Russian President Vladimir Putin discussed potential direct talks with Ukraine with a US envoy, while Donald Trump claimed a deal was near. However, Ukrainian President Volodymyr Zelensky rejected ceding Crimea, asserting it belongs t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-russia-ukraine-deal-very-close-after-new-kremlin-talks/articleshow/120638491.cms",
    "timestamp": "2025-04-26T06:09:01Z"
  },
  {
    "title": "Sanders's NFL draft slide continues as QB goes unselected on day two",
    "description": "University of Colorado quarterback Shedeur Sanders's astonishing slide in the NFL draft continued Friday as the son of former Dallas Cowboys great Deion Sanders went unselected in the second and third rounds.“Therefore, Shedeur, his quarterback son, has PHENO…",
    "link": "https://sports.yahoo.com/article/sanderss-nfl-draft-slide-continues-060723493.html",
    "timestamp": "2025-04-26T06:07:23Z"
  },
  {
    "title": "Indian army says new exchange of gunfire with Pakistan",
    "description": "Indian and Pakistani troops exchanged gunfire overnight in contested Kashmir for a second day running, the Indian army said Saturday, following a deadly shooting that New Delhi blames its arch-rival.",
    "link": "https://www.hurriyetdailynews.com/indian-army-says-new-exchange-of-gunfire-with-pakistan-208486",
    "timestamp": "2025-04-26T06:01:10Z"
  },
  {
    "title": "Who will attend Pope Francis’ funeral?",
    "description": "World officials like President Trump, Ukrainian President Zelenskyy, Italian Prime Minister Meloni and Prince William have confirmed they will attend the funeral of Pope Francis.",
    "link": "https://www.foxnews.com/world/who-attend-pope-francis-funeral",
    "timestamp": "2025-04-26T06:00:21Z"
  },
  {
    "title": "\"India, Pak Fighting For 1,500 Years On Border\": Trump After Pahalgam Attack",
    "description": "Without mentioning Prime Minister Narendra Modi or his Pakistani counterpart Shehbaz Sharif, Trump said he knew both the leaders.",
    "link": "https://www.ndtv.com/world-news/india-pakistan-fighting-for-1-500-years-on-border-donald-trump-after-pahalgam-terror-attack-8260369",
    "timestamp": "2025-04-26T06:00:13Z"
  },
  {
    "title": "Pope Francis Laid to Rest: Watch Live Saturday, April 26 Beginning at 3:00 am ET",
    "description": "Pope Francis' funeral on April 26 marks a poignant moment in history, with global leaders uniting to honor his impactful, yet controversial, papacy. Join the live coverage from St. Peter's Basilica.\nThe post Pope Francis Laid to Rest: Watch Live Saturday, Apr…",
    "link": "https://www.thegatewaypundit.com/2025/04/pope-francis-laid-rest-watch-live-saturday-april/",
    "timestamp": "2025-04-26T06:00:06Z"
  },
  {
    "title": "HHS Secretary Kennedy considers removing COVID-19 vaccine from childhood immunization schedule",
    "description": "HHS Secretary Robert F. Kennedy Jr. is considering removing the COVID-19 vaccine from the CDC’s childhood immunization schedule, reflecting ongoing debates over vaccine efficacy and safety. This potential change marks a significant shift in policy, as the CDC…",
    "link": "https://www.naturalnews.com/2025-04-26-kennedy-considers-removing-covid19-vaccine-immunization-schedule.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "HARVARD POLL: Congressional Democrats’ approval among young voters plummets, GOP gains ground",
    "description": "Approval of Congressional Democrats among young voters (18-29) has plummeted 19 points since 2017 (from 42 percent to 23 percent), while GOP approval slightly rose (28 percent to 29 percent). White millennial men now favor Republicans 46 percent to 37 percent…",
    "link": "https://www.naturalnews.com/2025-04-26-congressional-dems-approval-among-young-voters-plummets.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "Ukraine on the brink: Can Trumpâ\u0080\u0099s pragmatism or Zelenskyâ\u0080\u0099s defiance save a shattered nation?",
    "description": "In the shadow of a brutal overnight missile strike on Kyiv that left nine dead, the Trump administration’s pivot toward pragmatic concessions with Russia has collided headfirst with Ukraine’s insistence on defending its sovereignty and reclaiming territory th…",
    "link": "https://www.naturalnews.com/2025-04-26-can-trumps-pragmatism-zelenskys-defiance-save-ukraine.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "Trump retreats on auto tariffs, plans to exempt CAR PARTS from duties",
    "description": "The U.S. will exempt some car parts from aggressive tariffs after auto industry lobbying, though a 25 percent levy on foreign-made cars and parts remains. Automakers argued that overlapping tariffs could disrupt supply chains, raise prices and cost jobs, prom…",
    "link": "https://www.naturalnews.com/2025-04-26-trump-plans-exempt-car-parts-from-tariffs.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "Florida lawmakers consider bill allowing homeowners to use “reasonable force” against drones",
    "description": "Florida lawmakers are considering legislation allowing property owners to use “reasonable force” against drones they believe are violating their privacy, responding to growing unease over unexplained drone sightings. The Biden administration dismissed concern…",
    "link": "https://www.naturalnews.com/2025-04-26-florida-allow-homeowners-use-reasonable-force-drones.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "Trump unveils election integrity push, targets ActBlue amid fraud and foreign influence allegations",
    "description": "President Trump signed an order directing the DOJ to investigate ActBlue, the Democratic Party’s primary fundraising platform, for alleged illegal activity, including straw donations, foreign contributions and systemic fraud. The move follows bipartisan probe…",
    "link": "https://www.naturalnews.com/2025-04-26-trump-unveils-election-integrity-push-targets-actblue.html",
    "timestamp": "2025-04-26T06:00:00Z"
  },
  {
    "title": "Pope Francis Funeral: Watch Live Stream From St. Peter's Square",
    "description": "Follow the live stream of the Pope's funeral from Vatican City, here with Newsweek.",
    "link": "https://www.newsweek.com/watch-pope-francis-funeral-live-stream-2064495",
    "timestamp": "2025-04-26T05:58:03Z"
  },
  {
    "title": "Trump says Russia-Ukraine deal 'very close' after new Kremlin talks",
    "description": "Russian President Vladimir Putin on Friday discussed the \"possibility\" of direct talks with Ukraine in a meeting with a U.S. envoy, the Kremlin said, while President Donald Trump claimed the warring parties were \"very close to a deal\".",
    "link": "https://www.hurriyetdailynews.com/trump-says-russia-ukraine-deal-very-close-after-new-kremlin-talks-208485",
    "timestamp": "2025-04-26T05:56:48Z"
  },
  {
    "title": "Ukraine peace deal ‘very close’ Trump says ahead of Pope Francis’s funeral",
    "description": "US urging Zelenskiy to sign which would see Ukrainian territory remain in Russian hands",
    "link": "https://www.irishtimes.com/world/europe/2025/04/26/ukraine-peace-deal-very-close-trump-says-ahead-of-pope-franciss-funeral/",
    "timestamp": "2025-04-26T05:55:43Z"
  },
  {
    "title": "Trump clears $397 million for Pakistan’s F-16 fighter fleet {February 2025}",
    "description": "In a significant step, US President Donald Trump has released $397 million to Pakistan to sustain the F-16 fighter jet fleet for counter-terrorism operations, despite ordering a 90-day foreign aid freeze soon after taking office. Incidentally, it was Trump wh…",
    "link": "https://freerepublic.com/focus/f-news/4313349/posts",
    "timestamp": "2025-04-26T05:51:17Z"
  },
  {
    "title": "Elon Musk Is $122 Billion Poorer In 2025, And Still Richer Than Bezos, Huang, Cuban Combined",
    "description": "Elon Musk is the world's richest man and even with his wealth down over $100 billion in 2025 is worth more than second place Jeff Bezos by a lot.",
    "link": "https://www.benzinga.com/news/25/04/45025880/elon-musk-is-122-billion-poorer-in-2025-and-still-richer-than-bezos-huang-cuban-combined",
    "timestamp": "2025-04-26T05:46:25Z"
  },
  {
    "title": "Canada votes in election upended by Trump threats",
    "description": "Canada's election on Monday follows a campaign dominated by concerns over US President Trump's threats. Mark Carney, replacing Justin Trudeau, is favoured, emphasising his experience to counter Trump's policies. Poilievre focused on domestic issues like risin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/canada-votes-in-election-upended-by-trump-threats/articleshow/120637869.cms",
    "timestamp": "2025-04-26T05:44:44Z"
  },
  {
    "title": "Pope Francis' funeral is set to begin, in ceremony he helped reimagine",
    "description": "Pope Francis' funeral in Vatican City will reflect his dedication to serving the marginalized, with prisoners and migrants participating. World leaders will attend the ceremony, while Francis will be buried in St. Mary Major Basilica, breaking tradition. He d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pope-francis-funeral-is-set-to-begin-in-ceremony-he-helped-reimagine/articleshow/120637840.cms",
    "timestamp": "2025-04-26T05:41:11Z"
  },
  {
    "title": "Dollar posts first weekly gain since March on signs of easing US-China tensions",
    "description": "The dollar is poised for its first weekly gain since mid-March following China's tariff exemptions on some U.S. imports, fueling hopes for easing trade tensions. Despite conflicting signals this week, signs point towards de-escalation rather than further esca…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-posts-first-weekly-gain-since-march-on-signs-of-easing-us-china-tensions/articleshow/120637759.cms",
    "timestamp": "2025-04-26T05:36:12Z"
  },
  {
    "title": "Pope Francis' Death Triggers Surge Of Disinformation He Fought Against",
    "description": "Swarms of fake and misleading content interrupted the global rush of condolences that poured online for Pope Francis ahead of his funeral Saturday.",
    "link": "https://www.ndtv.com/world-news/pope-francis-death-triggers-surge-of-disinformation-he-fought-against-8260235",
    "timestamp": "2025-04-26T05:31:31Z"
  },
  {
    "title": "From Bush to Berlusconi and Mugabe to McAleese, the famous faces at John Paul II's 2005 funeral",
    "description": "It was reputed at the time to be one of the largest gatherings of heads of state in history.",
    "link": "https://www.thejournal.ie/pope-john-paul-ii-funeral-6687041-Apr2025/",
    "timestamp": "2025-04-26T05:30:40Z"
  },
  {
    "title": "Big Tech's soaring energy demands are making coal-fired power plant sites attractive",
    "description": "The resurgence of electricity demand, driven by Big Tech's AI and cloud computing needs, is breathing new life into previously struggling coal-fired power plants. These plants, slated for retirement, possess valuable high-voltage grid connections, attracting …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/big-techs-soaring-energy-demands-are-making-coal-fired-power-plant-sites-attractive/articleshow/120637686.cms",
    "timestamp": "2025-04-26T05:30:00Z"
  },
  {
    "title": "Xi says China must ‘overcome’ AI chip challenges",
    "description": "President Xi Jinping said China must “overcome” the challenges of developing core AI technologies including high-end chips, state media reported Saturday, as Beijing seeks to become a world leader in the rapidly developing industry. China aims to dominate the…",
    "link": "https://www.digitaljournal.com/world/xi-says-china-must-overcome-ai-chip-challenges/article",
    "timestamp": "2025-04-26T05:27:32Z"
  },
  {
    "title": "Xi Says China Must 'Overcome' AI Chip Challenges",
    "description": "President Xi Jinping said China must \"overcome\" the challenges of developing core AI technologies including high-end chips, state media reported Saturday, as Beijing seeks to become a world leader in the rapidly developing industry.",
    "link": "https://www.ibtimes.com/xi-says-china-must-overcome-ai-chip-challenges-3771485",
    "timestamp": "2025-04-26T05:27:09Z"
  },
  {
    "title": "Oil posts weekly fall on tariff worry and rising supplies",
    "description": "Oil prices saw a slight increase on Friday, but overall, they decreased for the week. This happened because people think there's too much oil available and because of uncertainty about trade talks between America and China. China has reduced tariffs on some A…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-posts-weekly-fall-on-tariff-worry-and-rising-supplies/articleshow/120637638.cms",
    "timestamp": "2025-04-26T05:25:48Z"
  },
  {
    "title": "Türkiye, US reaffirm commitment to $100 bln trade goal",
    "description": "Trade Minister Ömer Bolat said Friday that his country is closely following the new U.S. trade policies and is ready to remain and work in close dialogue.",
    "link": "https://www.hurriyetdailynews.com/turkiye-us-reaffirm-commitment-to-100-bln-trade-goal-208482",
    "timestamp": "2025-04-26T05:24:58Z"
  },
  {
    "title": "Gold dips 2% as US-China trade tensions ease, dollar rises",
    "description": "Gold prices experienced a decline. This drop occurred because of a stronger dollar. Reports suggest easing trade tensions between the United States and China. Beijing's move to exempt some U.S. goods from tariffs impacted bullion. Silver saw a slight decrease…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-dips-2-as-us-china-trade-tensions-ease-dollar-rises/articleshow/120637568.cms",
    "timestamp": "2025-04-26T05:21:07Z"
  },
  {
    "title": "Photos: From mightiest to humblest, hundreds of thousands gather for Pope Francis’ funeral",
    "description": "Already, long lines of the faithful have paid their homage to Francis.",
    "link": "https://www.bostonherald.com/2025/04/26/pope-francis-funeral-photos/",
    "timestamp": "2025-04-26T05:16:22Z"
  },
  {
    "title": "Canada is gearing up for a federal election. Here's what's at stake",
    "description": "Canadians will vote for a new government in an election that has been upended by U.S. President Donald Trump’s trade war and threats to make Canada the 51st state",
    "link": "https://abcnews.go.com/International/wireStory/canada-gearing-federal-election-stake-121185087",
    "timestamp": "2025-04-26T05:15:29Z"
  }
]