[
  {
    "title": "Donald Trump Freaks Out Over Job Numbers, Orders Firing: Live Updates",
    "description": "Read live updates on Donald Trump's presidency.",
    "link": "https://www.huffpost.com/entry/donald-trump-live-updates_n_688d0894e4b022c2fdde8724",
    "timestamp": "2025-08-01T19:25:28Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shut down after being defunded by Congress, targeted by Trump",
    "description": "The corporation has been a cornerstone of American culture for three generations.",
    "link": "https://www.denverpost.com/2025/08/01/media-public-broadcasting-trump/",
    "timestamp": "2025-08-01T19:24:48Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shut down after being defunded by Congress, targeted by Trump",
    "description": "The corporation has been a cornerstone of American culture for three generations.",
    "link": "https://www.bostonherald.com/2025/08/01/media-public-broadcasting-trump/",
    "timestamp": "2025-08-01T19:24:48Z"
  },
  {
    "title": "Jonathan Capehart Slams Washington Post’s Push for ‘Optimism’ Under Trump In Scathing Comments on Exit",
    "description": "MSNBC's Jonathan Capehart exited The Washington Post with some fiery comments about the direction of the paper under President Donald Trump.\nThe post Jonathan Capehart Slams Washington Post’s Push for ‘Optimism’ Under Trump In Scathing Comments on Exit first …",
    "link": "https://www.mediaite.com/media/jonathan-capehart-slams-washington-posts-push-for-optimism-under-trump-in-scathing-comments-on-exit/",
    "timestamp": "2025-08-01T19:22:09Z"
  },
  {
    "title": "Hiking Tariffs on Canada, Trump Demands 'Adequate Steps' To Achieve an Impossible Drug War Goal",
    "description": "Canada accounts for a tiny percentage of fentanyl smuggling, which cannot be stopped by trying harder.",
    "link": "https://reason.com/2025/08/01/hiking-tariffs-on-canada-trump-demands-adequate-steps-to-achieve-an-impossible-drug-war-goal/",
    "timestamp": "2025-08-01T19:21:32Z"
  },
  {
    "title": "Massive Contractor Keeps Raking In Taxpayer Cash Despite Trump’s Pledge To Rein In Swampy Deals",
    "description": "Booz Allen Hamilton continues to rake in billions of taxpayer dollars despite the Trump administration's vow to curtail federal contracting.",
    "link": "https://dailycaller.com/2025/08/01/massive-contractor-raking-taxpayer-cash-despite-trumps-pledge-rein-in-swamp-booz-allen-hamilton/",
    "timestamp": "2025-08-01T19:20:40Z"
  },
  {
    "title": "WATCH: Dunkin' Donuts Ad Mentioning Actor's 'Genetics' Enrages Leftists",
    "description": "A Dunkin' Donuts advertisement featuring a handsome male actor has leftists upset over \"genetics,\" the news coming after an American Eagle ad drew outrage for the same thing.\nThe post WATCH: Dunkin’ Donuts Ad Mentioning Actor’s ‘Genetics’ Enrages Leftists app…",
    "link": "https://www.breitbart.com/health/2025/08/01/watch-dunkin-donuts-ad-mentioning-actors-genetics-enrages-leftists/",
    "timestamp": "2025-08-01T19:20:03Z"
  },
  {
    "title": "Trump orders firing of government labor data chief after jobs report stuns market with massive revisions to previous reports",
    "description": "President Donald Trump on Friday ordered the firing of Dr. Erika McEntarfer, the Commissioner of the Bureau of Labor Statistics (BLS), igniting a political and economic firestorm as the administration grappled with unexpectedly weak jobs numbers that included…",
    "link": "https://biztoc.com/x/da27a200c6ea138e",
    "timestamp": "2025-08-01T19:19:14Z"
  },
  {
    "title": "Trump Says He Will Can Labor Stats Official On Heels Of Lackluster Jobs Report",
    "description": "President Donald Trump announced in a Truth Social post on Friday that he has directed his team to fire Commissioner of Labor Statistics Erika McEntarfer.",
    "link": "https://dailycaller.com/2025/08/01/trump-erika-mcentarfer-july-jobs-report/",
    "timestamp": "2025-08-01T19:19:05Z"
  },
  {
    "title": "Trump actually has a tariff strategy this time. It could still go terribly wrong",
    "description": "President Donald Trump at Trump Turnberry golf club on July 28, 2025, in Turnberry, Scotland. | Andrew Harnik/Getty Images \nFour months after President Donald Trump’s “Liberation Day” tariff hikes threw the global economy into chaos, we got a sequel — but the…",
    "link": "https://biztoc.com/x/f6eabfa8da2cd4a7",
    "timestamp": "2025-08-01T19:19:02Z"
  },
  {
    "title": "Science Needs Dissent: NIH Director Jay Bhattacharya on COVID, Autism, and Climate Change",
    "description": "NIH Director Jay Bhattacharya defends open disagreement, criticizes groupthink, and argues that democracy depends on our ability to speak and listen across political and scientific divides.",
    "link": "https://reason.com/2025/08/02/science-needs-dissent-nih-director-jay-bhattacharya-on-covid-autism-and-climate-change/",
    "timestamp": "2025-08-01T19:18:58Z"
  },
  {
    "title": "Smithsonian temporarily removes Trump impeachment references from history museum, drawing liberal ire",
    "description": "The Smithsonian's temporary removal of impeachment exhibits about Donald Trump in the American History Museum sparked liberal criticism and a sharp White House response.",
    "link": "https://www.foxnews.com/media/smithsonian-temporarily-removes-trump-impeachment-references-from-history-museum-drawing-liberal-ire",
    "timestamp": "2025-08-01T19:18:07Z"
  },
  {
    "title": "PBS, NPR shutting down? Corporation for Public Broadcasting says closing soon. Check dates",
    "description": "Created by the U.S. Congress in 1967, the CPB distributed more than $500 million annually to the PBS, NPR and more than 1,500 locally operated public radio and television stations.",
    "link": "https://economictimes.indiatimes.com/news/international/us/pbs-npr-shutting-down-corporation-for-public-broadcasting-says-closing-soon-check-dates/articleshow/123051054.cms",
    "timestamp": "2025-08-01T19:17:55Z"
  },
  {
    "title": "George Mason University's president keeps job, gets a raise",
    "description": "The Mason board was in closed session for more than three hours reviewing President Greg Washington's performance.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_35961aad-a2ef-4307-80b8-a72f23179a64.html",
    "timestamp": "2025-08-01T19:17:00Z"
  },
  {
    "title": "'Day zero' looms for Iran after heat, drought and dealings of the 'water mafia'",
    "description": "As the atrocities in Gaza continue, another crisis is enveloping the Middle East — as record heat, drought and wildfires open up another devastating front.",
    "link": "https://www.abc.net.au/news/2025-08-02/iran-and-middle-east-record-heat-drought-wildfires/105590076",
    "timestamp": "2025-08-01T19:16:09Z"
  },
  {
    "title": "'Gut-wrenching': Public broadcasting nonprofit mourned as GOP cuts force shutdown",
    "description": "President Donald Trump's funding cut package, passed last month, has led to the end of the Corporation for Public Broadcasting, with the federally funded 60-year-old nonprofit announcing on Friday they will begin \"an orderly wind-down of its operations\" start…",
    "link": "https://www.rawstory.com/cpb-2673799232/",
    "timestamp": "2025-08-01T19:16:02Z"
  },
  {
    "title": "Trump fires labor statistics boss hours after weak jobs report (NBC News)",
    "description": "NBC News:\nTrump fires labor statistics boss hours after weak jobs report  —  The president implied that the BLS commissioner, longtime federal employee Erika McEntarfer, manipulated the data “for political purposes.”  —  President Donald Trump on Friday order…",
    "link": "https://www.memeorandum.com/250801/p92",
    "timestamp": "2025-08-01T19:15:00Z"
  },
  {
    "title": "Smithsonian explains why a Trump reference was removed from impeachment exhibit",
    "description": "\"A future and updated exhibit will include all impeachments,\" according to a statement from the Smithsonian.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/01/smithsonian-removes-trump-impeachment-exhibit-response/85473807007/",
    "timestamp": "2025-08-01T19:13:42Z"
  },
  {
    "title": "Donald Trump to fire US labour statistics boss after weak jobs report - Financial Times",
    "description": "Donald Trump to fire US labour statistics boss after weak jobs reportFinancial Times Trump fires commissioner of labor statistics after weaker-than-expected jobs figures slam marketsCNBC Trump fires BLS commissioner after weak jobs reportNBC News Trump says h…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178536780",
    "timestamp": "2025-08-01T19:13:16Z"
  },
  {
    "title": "Senate delays August recess for now as Trump presses for more confirmations",
    "description": "Trump declared that his nominees “should NOT BE FORCED TO WAIT.”",
    "link": "https://www.bostonherald.com/2025/08/01/senate-nominations/",
    "timestamp": "2025-08-01T19:11:09Z"
  },
  {
    "title": "Senate delays August recess for now as Trump presses for more confirmations",
    "description": "A stalemate over the pace of confirmations has delayed the Senate’s yearly August recess for now as President Donald Trump declares that his nominees “should NOT BE FORCED TO WAIT.”",
    "link": "https://abcnews.go.com/US/wireStory/senate-delays-august-recess-now-trump-presses-confirmations-124289045",
    "timestamp": "2025-08-01T19:10:30Z"
  },
  {
    "title": "Switzerland, the land of luxury brands, could see prices skyrocket from Trump's 39% tariffs",
    "description": "Switzerland is home to some of the world’s most recognizable luxury brands",
    "link": "https://abcnews.go.com/Business/wireStory/switzerland-land-luxury-brands-prices-skyrocket-trumps-39-124281666",
    "timestamp": "2025-08-01T19:10:24Z"
  },
  {
    "title": "US special envoy visits Gaza aid sites as famine deaths mount",
    "description": "US special envoy Steve Witkoff has visited aid sites in Gaza amid mounting global outrage over deepening famine.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/8/1/us-special-envoy-visits-gaza-aid-sites-as-famine-deaths-mount",
    "timestamp": "2025-08-01T19:10:05Z"
  },
  {
    "title": "Ghislaine Maxwell moved from federal jail to minimum-security prison camp",
    "description": "Maxwell’s transfer is the latest development in a now weeks-long period of intense pressure being put on Trump.",
    "link": "https://www.thejournal.ie/ghiclaine-maxwell-moved-to-prison-camp-6780822-Aug2025/",
    "timestamp": "2025-08-01T19:09:59Z"
  },
  {
    "title": "Trump responds to his failure to create jobs by firing the U.S. labor statistics chief",
    "description": "Confronted with evidence of his own failures, Donald Trump could've changed direction. He instead found it easier to fire his labor statistics chief.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-responds-failure-create-jobs-firing-us-labor-statistics-chief-rcna222532",
    "timestamp": "2025-08-01T19:09:44Z"
  },
  {
    "title": "Trump orders firing of government labor data chief after jobs report stuns market with massive revisions to previous reports",
    "description": "July’s employment report showed that only 73,000 nonfarm payroll jobs were added to the U.S. economy, while revising the last two months down by 258,000 jobs.",
    "link": "https://fortune.com/2025/08/01/trump-fires-erika-mcentarfer-bureau-labor-statistics-chief/",
    "timestamp": "2025-08-01T19:09:33Z"
  },
  {
    "title": "Trump fires BLS commissioner after weak jobs report",
    "description": "President Donald Trump on Friday ordered the firing of the head of the Bureau of Labor Statistics, hours after a stunning government report showed that hiring had slowed down significantly over the past three months.\nTaking to Truth Social, he attacked Erika …",
    "link": "https://biztoc.com/x/74a9e9123d107154",
    "timestamp": "2025-08-01T19:08:37Z"
  },
  {
    "title": "ICC Says Businesses Pause Plans Amid Continued Tariff Uncertainty",
    "description": "Businesses are reportedly still facing uncertainty around U.S. trade policy, even after the Thursday (July 31) announcement of higher tariffs by President Donald Trump. [contact-form-7] The announcement lacked detail and left undecided some issues around key …",
    "link": "http://www.pymnts.com/economy/2025/icc-says-businesses-pause-plans-amid-continued-tariff-uncertainty/",
    "timestamp": "2025-08-01T19:08:32Z"
  },
  {
    "title": "Trump Sends Envoys Witkoff, Huckabee to Gaza for Aid Plan",
    "description": "US Special Envoy to the Middle East Steve Witkoff and US Ambassador to Israel Mike Huckabee will travel into Gaza and brief President Donald Trump on their findings after their visit, White House Press Secretary Karoline Leavitt said. \nRead more:…",
    "link": "https://biztoc.com/x/8396da784d9c5c9c",
    "timestamp": "2025-08-01T19:08:16Z"
  },
  {
    "title": "Trump seeks to fire Bureau of Labor Statistics director after release of weak jobs report",
    "description": "President Donald Trump on Friday called for the firing of the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.",
    "link": "https://biztoc.com/x/378fdce4a0d68b9a",
    "timestamp": "2025-08-01T19:08:05Z"
  },
  {
    "title": "'Wash away the blood': Trump admin accused of 'staging' Gaza tour to sanitize starvation",
    "description": "Palestinians and international humanitarian groups were among those who denounced Friday's highly orchestrated tour of a Gaza aid distribution center run by a U.S.-backed group condemned for its role in Israeli forces' massacres of desperate people seeking fo…",
    "link": "https://www.rawstory.com/trump-gaza-2673799508/",
    "timestamp": "2025-08-01T19:08:03Z"
  },
  {
    "title": "Trump orders head of U.S. employment data fired after weak jobs report",
    "description": "U.S. President Donald Trump on Friday called for the firing of the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.\nTrump in a post on his socia…",
    "link": "https://biztoc.com/x/33979e90551538a7",
    "timestamp": "2025-08-01T19:08:00Z"
  },
  {
    "title": "Texas Democrats Might Actually Flee the State to Block Racist Redistricting",
    "description": "Perhaps Canada can offer them asylum.",
    "link": "https://www.esquire.com/news-politics/politics/a65576875/texas-democrats-fleeing-the-state/",
    "timestamp": "2025-08-01T19:08:00Z"
  },
  {
    "title": "Trump Fires Labor Stats Chief Following Weak Jobs Report",
    "description": "Donald Trump fired Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, following the release of a weak jobs report on Thursday.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-fires-labor-statistics-commissioner-weak-jobs-report-1235398767/",
    "timestamp": "2025-08-01T19:07:51Z"
  },
  {
    "title": "Trump says 'nobody has asked' him to pardon Ghislaine Maxwell - but he has 'right to do it'",
    "description": "Donald Trump has said \"nobody has asked\" him to pardon Ghislaine Maxwell, but insisted he has \"the right to do it\" as US president.",
    "link": "https://news.sky.com/story/trump-says-nobody-has-asked-him-to-pardon-ghislaine-maxwell-but-he-has-right-to-do-it-13405320",
    "timestamp": "2025-08-01T19:07:00Z"
  },
  {
    "title": "Apple’s Tim Cook Talks Trump Tariffs and AI",
    "description": "Apple and other tech giants reported their quarterly earnings this week",
    "link": "https://gizmodo.com/apples-tim-cook-talks-trump-tariffs-and-ai-2000637963",
    "timestamp": "2025-08-01T19:05:13Z"
  },
  {
    "title": "Trump take jobs",
    "description": "Donald Trump’s regressive tax increases, arbitrary deportations of critical workers, and discouragement of tourism seems to be wrecking the generally outstanding economy he was left with by Uncle Joe Brandon: Employers have sharply pulled back their hiring, a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/trump-take-jobs",
    "timestamp": "2025-08-01T19:04:59Z"
  },
  {
    "title": "Trump fires official overseeing jobs data after dismal employment report",
    "description": "U.S. hiring slowed last month as Trump's erratic and radical trade policies paralyze businesses and raise doubts about the outlook for the world's largest economy, the Labor Department reported Friday.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_1e18fbae-bf58-59e0-a070-d1b9714fb3a7.html",
    "timestamp": "2025-08-01T19:04:00Z"
  },
  {
    "title": "Trump fires official overseeing jobs data after dismal employment report",
    "description": "U.S. hiring slowed last month as Trump's erratic and radical trade policies paralyze businesses and raise doubts about the outlook for the world's largest economy, the Labor Department reported Friday.",
    "link": "https://roanoke.com/news/nation-world/business/economy/article_c7bc3858-a605-52b2-bccc-685e55f14437.html",
    "timestamp": "2025-08-01T19:04:00Z"
  },
  {
    "title": "Trump actually has a tariff strategy this time. It could still go terribly wrong.",
    "description": "Four months after President Donald Trump’s “Liberation Day” tariff hikes threw the global economy into chaos, we got a sequel — but there appears to be at least somewhat more of a method to Trump’s tariff madness this time around. Trump is using the threat of…",
    "link": "https://www.vox.com/politics/422061/trump-tariffs-trade-war-explained-deals",
    "timestamp": "2025-08-01T19:03:11Z"
  },
  {
    "title": "Trump Blasts GOP Senator Susan Collins For Daring To Cross Him",
    "description": "In a Truth Social post on Thursday, Trump blasted the moderate Republican after she opposed two of his major initiatives.",
    "link": "https://www.huffpost.com/entry/trump-attacks-susan-collins-truth-social_n_688cfaf5e4b09319f8164cd3",
    "timestamp": "2025-08-01T19:02:37Z"
  },
  {
    "title": "Kamala Harris Says The “System Is Broken” & Calls Out The “Capitulation” To Donald Trump",
    "description": "Kamala Harris gives her first interview since the 2024 election loss and called out the capitulation to Donald Trump. X has thoughts.",
    "link": "https://hiphopwired.com/playlist/kamala-harris-capitulation-donald-trump-late-show-stephen-colbert-reactions/",
    "timestamp": "2025-08-01T19:02:28Z"
  },
  {
    "title": "“Protecting Pedophiles?”—Vance Erupts at AP Reporter in Fiery Exchange – WATCH",
    "description": "Vice President JD Vance blasted an AP reporter who suggested he is “protecting pedophiles” during his visit to a steel factory in Ohio to promote tax cuts. During a Q&A session, the reporter stated: “I guess I’m going to be that person. There are some protest…",
    "link": "https://freerepublic.com/focus/f-news/4332114/posts",
    "timestamp": "2025-08-01T19:02:16Z"
  },
  {
    "title": "In Reaction To Dismal Jobs Report, Donald Trump Says He’s Ordered Commissioner Of Labor Statistics To Be Fired",
    "description": "Following a jobs report that showed the labor market slowing, Donald Trump took aim at the statistics themselves. In a Truth Social post, Trump said he was directing his team to fire the Commissioner of Labor Statistics, Erika McEntarfer, nominated for the ro…",
    "link": "http://deadline.com/2025/08/trump-jobs-data-labor-statistics-1236476705/",
    "timestamp": "2025-08-01T19:02:04Z"
  },
  {
    "title": "South Park Is Leaving Another Major Streaming Service",
    "description": "Paramount\nSouth Park is leaving another major streaming service, and yet another big shuffling of the deck for the long-running animated sitcom. If you didn’t already know, the unique structure of the production and licensing deals for South Park has seen the…",
    "link": "http://comicbook.com/tv-shows/news/south-park-leaving-hbo-max-streaming-paramount-plus-only-all-seasons/",
    "timestamp": "2025-08-01T19:01:56Z"
  },
  {
    "title": "Ghislaine Maxwell quietly moved to Texas Prison from Florida, just as Trump considers pardon",
    "description": "Ghislaine Maxwell, convicted for aiding Jeffrey Epstein, has been quietly transferred from Florida to Federal Prison Camp Bryan in Texas, sparking headlines amid rising public pressure on Donald Trump over the unreleased Epstein files. With new DOJ meetings, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/ghislaine-maxwell-quietly-moved-to-texas-prison-from-florida-just-as-trump-considers-pardon/articleshow/123049973.cms",
    "timestamp": "2025-08-01T19:01:38Z"
  },
  {
    "title": "Trump deploys nuclear submarines in row with Russia",
    "description": "The US president did not say in his post whether he meant nuclear-powered or nuclear-armed submarine",
    "link": "https://www.euractiv.com/section/politics/news/trump-deploys-nuclear-submarines-in-row-with-russia/",
    "timestamp": "2025-08-01T19:01:38Z"
  },
  {
    "title": "Trump, in warning to Russia, says nuclear submarines will be sent to 'appropriate regions' (Washington Post)",
    "description": "Washington Post:\nTrump, in warning to Russia, says nuclear submarines will be sent to ‘appropriate regions’  —  President Donald Trump said Friday that he has ordered two nuclear submarines to be positioned “in the appropriate regions” after former Russian pr…",
    "link": "https://www.memeorandum.com/250801/p89",
    "timestamp": "2025-08-01T19:00:34Z"
  },
  {
    "title": "Judge Blocks Ending TPS Protections, Claims Trump Admin is Telling Illegal Aliens to ‘Purify Their Blood’",
    "description": "\"The freedom to live fearlessly, the opportunity of liberty, and the American dream. That is all Plaintiffs seek. Instead, they are told to atone for their race, leave because of their names, and purify their blood.\"\nThe post Judge Blocks Ending TPS Protectio…",
    "link": "https://legalinsurrection.com/2025/08/judge-blocks-ending-tps-protections-claims-trump-admin-telling-illegal-aliens-to-purify-their-blood/",
    "timestamp": "2025-08-01T19:00:29Z"
  },
  {
    "title": "'Lunacy': MAGA fans freak out over Trump nuclear threat",
    "description": "Social media blew up Friday as MAGA supporters reacted to President Donald Trump's nuclear threat against Russia over comments made by Dmitry Medvedev.Medvedev, the former Russian president and current deputy chairman of the Russian Federation's security coun…",
    "link": "https://www.rawstory.com/trump-russia-2673799217/",
    "timestamp": "2025-08-01T19:00:02Z"
  },
  {
    "title": "Trump's tariff turmoil highlights the influence of non-trade factors",
    "description": "The outcome somewhat took the wind out of the sails of those who have been criticising Australia's prime minister for not getting a meeting with the US president.",
    "link": "https://www.abc.net.au/news/2025-08-02/donald-trump-tariffs-australia-europe-japan-trade/105581036",
    "timestamp": "2025-08-01T19:00:00Z"
  },
  {
    "title": "Skydance Says It Had No Role in Cancelling Stephen Colbert, Blowing Hole in Democrat Conspiracy Theory",
    "description": "Skydance Media is now saying it played no role whatever in the cancellation of CBS's \"The Late Show with Stephen Colbert.\"\nThe post Skydance Says It Had No Role in Cancelling Stephen Colbert, Blowing Hole in Democrat Conspiracy Theory appeared first on Breitb…",
    "link": "https://www.breitbart.com/entertainment/2025/08/01/skydance-says-it-had-no-role-in-cancelling-stephen-colbert-blowing-hole-in-democrat-conspiracy-theory/",
    "timestamp": "2025-08-01T18:59:37Z"
  },
  {
    "title": "Trump calls for firing of labor statistics head",
    "description": "President Trump seeks firing of government official overseeing jobs data after weak employment report",
    "link": "https://www.wtae.com/article/trump-calls-for-firing-labor-statistics-head-july-jobs-report/65577425",
    "timestamp": "2025-08-01T18:59:32Z"
  },
  {
    "title": "Trump-Modi talks key to trade deal: Former Asst USTR",
    "description": "A reset in India-US trade talks may be needed, potentially through a conversation between President Trump and Prime Minister Modi, according to Mark Linscott. Despite new tariffs and criticisms from Trump, Linscott sees the situation as a \"hiccup,\" emphasizin…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-modi-talks-key-to-trade-deal-former-asst-ustr/articleshow/123050871.cms",
    "timestamp": "2025-08-01T18:59:21Z"
  },
  {
    "title": "Exclusive: Sen. Risch Proposes Expanded Human Trafficking Bill Pressuring U.S. Allies to Join Fight",
    "description": "Senator Jim Risch (R-ID) introduced legislation Friday to reauthorize and enhance critical programming essential to combating human trafficking worldwide.\nThe post Exclusive: Sen. Risch Proposes Expanded Human Trafficking Bill Pressuring U.S. Allies to Join F…",
    "link": "https://www.breitbart.com/politics/2025/08/01/exclusive-sen-risch-proposes-expanded-human-trafficking-bill-pressuring-u-s-allies-to-join-fight/",
    "timestamp": "2025-08-01T18:58:45Z"
  },
  {
    "title": "Ford Motor Company to recall more than 300,000 vehicles in the US: Which models are impacted, and what can consumers do",
    "description": "Ford Motor Company is recalling over 300,000 vehicles due to a potential Electric Brake Booster malfunction that could increase crash risk by extending stopping distances. Owners will be notified by August 25 for a free software update. Simultaneously, Ford r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ford-motor-company-to-recall-more-than-300000-vehicles-in-the-us-which-models-are-impacted-and-what-can-consumers-do/articleshow/123050837.cms",
    "timestamp": "2025-08-01T18:58:28Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "President Donald Trump on Friday had his team remove the head of the agency that produces the monthly jobs figures, after a weak report showed hiring slowed and was much weaker in April and May than previously reported.",
    "link": "https://www.clickondetroit.com/news/politics/2025/08/01/trump-seeks-to-fire-official-overseeing-jobs-data-after-weak-employment-report/",
    "timestamp": "2025-08-01T18:58:04Z"
  },
  {
    "title": "Alarming jobs report makes potent case for the Fed to cut interest rates",
    "description": "At the Federal Reserve policy meeting that concluded Wednesday, governors Christopher Waller and Michelle Bowman dissented from the decision to leave rates unchanged, believing that a rate cut was justified. It looks like they had a point. The intrigue: At 8a…",
    "link": "https://freerepublic.com/focus/f-chat/4332113/posts",
    "timestamp": "2025-08-01T18:57:55Z"
  },
  {
    "title": "USA to have 22,000 deaths annually in USA due to lack of health care? Research reveals shocking details",
    "description": "Medicaid is a state and federally funded program that covers care for people with low incomes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/usa-to-have-22000-deaths-annually-in-usa-due-to-lack-of-health-care-research-reveals-shocking-details/articleshow/123050632.cms",
    "timestamp": "2025-08-01T18:57:24Z"
  },
  {
    "title": "Trump seeks to fire Bureau of Labor Statistics director after release of weak jobs report",
    "description": "President Donald Trump on Friday called for the firing of the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.",
    "link": "https://www.pbs.org/newshour/politics/trump-seeks-to-fire-bureau-of-labor-statistics-director-after-release-of-weak-jobs-report",
    "timestamp": "2025-08-01T18:57:20Z"
  },
  {
    "title": "Trump orders firing of labor statistics chief after weaker than expected jobs report – US politics live",
    "description": "Trump fires labor statistics chief after weaker than expected jobs report\nDonald Trump has said he’s ordered the firing of Erika McEntarfer, the commissioner of the US Bureau of Labor Statistics, hours after data showed US employment growth was weaker than ex…",
    "link": "https://biztoc.com/x/b0d11935c2669c11",
    "timestamp": "2025-08-01T18:57:19Z"
  },
  {
    "title": "Trump Deploys Nuclear Submarines In Row With Russia",
    "description": "US President Donald Trump ordered the deployment of two nuclear submarines Friday in an extraordinary escalation of what had been an online war of words with a Russian official over Ukraine and tariffs.",
    "link": "https://www.ibtimes.com.au/trump-deploys-nuclear-submarines-row-russia-1859935",
    "timestamp": "2025-08-01T18:57:17Z"
  },
  {
    "title": "Gavin Newsom Warns Trump 'Crashing' Economy as Jobs Numbers Revised Down",
    "description": "California Governor Gavin Newsom said Friday that President Donald Trump's economic agenda is \"crashing\" the U.S. economy.",
    "link": "https://biztoc.com/x/019857e51cd4befc",
    "timestamp": "2025-08-01T18:57:06Z"
  },
  {
    "title": "After a blown deadline, what next for US-Canada trade?",
    "description": "There are pressures on both sides to give businesses a reprieve, but the tone remains markedly downbeat.",
    "link": "https://www.bbc.com/news/articles/ckgjrm74lvno",
    "timestamp": "2025-08-01T18:57:00Z"
  },
  {
    "title": "Federal appeals court weighs Trump birthright citizenship order as admin outlines enforcement details",
    "description": "Appeals court to review Trump's birthright citizenship order after Supreme Court ruling narrowed lower courts' ability to issue universal injunctions.",
    "link": "https://www.foxnews.com/politics/federal-appeals-court-weighs-trump-birthright-citizenship-order-admin-outlines-enforcement-details",
    "timestamp": "2025-08-01T18:56:56Z"
  },
  {
    "title": "Brett Kavanaugh says he doesn’t owe the public an explanation",
    "description": "Supreme Court nominee Brett Kavanaugh speaks at his Senate Judiciary Committee hearing in 2018. | Michael Reynolds-Pool/Getty Images \nJustice Brett Kavanaugh defended the Supreme Court’s recent practice of handing victories to President Donald Trump without e…",
    "link": "https://biztoc.com/x/bd90c74be86d31b7",
    "timestamp": "2025-08-01T18:56:54Z"
  },
  {
    "title": "Presidential Fitness Test to return through Trump executive order - NewsBreak",
    "description": "Presidential Fitness Test to return through Trump executive order - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4148954590373-presidential-fitness-test-to-return-through-trump-executive-order?s=a2&amp;share_destination_id=NTU3NDI0MDMtMTc1NDA3NDU4MjE4MA%3D%3D&amp;pd=03lt91FD&amp;hl=en_US&amp;send_time=1754074582&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q3-v5%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q3-v3%2Cns_foryou_model_exp_25q3-v5",
    "timestamp": "2025-08-01T18:56:52Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "By CHRISTOPHER RUGABER, AP Economics Writer\nWASHINGTON (AP) — President Donald Trump on Friday called for the firing of the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and Ju…",
    "link": "https://biztoc.com/x/307a7ba8de10db51",
    "timestamp": "2025-08-01T18:56:48Z"
  },
  {
    "title": "‘Banana Republic’: Social Media Reacts to Trump Firing Statistics Chief After Bleak Jobs Report",
    "description": "President Donald Trump fired the commissioner of the U.S. Bureau of Labor on Friday after her agency released a disappointing job report earlier that day.\nThe post ‘Banana Republic’: Social Media Reacts to Trump Firing Statistics Chief After Bleak Jobs Report…",
    "link": "https://www.mediaite.com/media/news/banana-republic-social-media-reacts-to-trump-firing-statistics-chief-after-bleak-jobs-report/",
    "timestamp": "2025-08-01T18:56:45Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "President Donald Trump on Friday had his team remove the head of the agency that produces the monthly jobs figures, after a weak report showed hiring slowed and was much weaker in April and May than previously reported.",
    "link": "https://www.clickorlando.com/news/politics/2025/08/01/trump-seeks-to-fire-official-overseeing-jobs-data-after-weak-employment-report/",
    "timestamp": "2025-08-01T18:56:18Z"
  },
  {
    "title": "Ghislaine Maxwell moved to lower-security facility after meeting with Trump DOJ",
    "description": "The federal Bureau of Prisons has moved Ghislaine Maxwell from a low-security facility in Florida to a minimum-security camp in Texas after she met last week with Deputy Attorney General Todd Blanche.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/ghislaine-maxwell-moved-lower-security-facility-texas-rcna222516",
    "timestamp": "2025-08-01T18:55:36Z"
  },
  {
    "title": "Fujifilm Raises Camera and Lens Prices in the US Amid Tariffs",
    "description": "Fujifilm Holdings Corp. raised US prices for the majority of its digital cameras and lenses on Friday, in some cases by hundreds of dollars, as President Donald Trump’s tariffs continue to reverberate across the consumer tech industry.",
    "link": "https://www.livemint.com/companies/news/fujifilm-raises-camera-and-lens-prices-in-the-us-amid-tariffs-11754074517546.html",
    "timestamp": "2025-08-01T18:55:16Z"
  },
  {
    "title": "Trump Says He'll Fire Labor Statistics Head After Weak Jobs Data (Bloomberg)",
    "description": "Bloomberg:\nTrump Says He'll Fire Labor Statistics Head After Weak Jobs Data  —  President Donald Trump said he was directing officials to fire Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, hours after a report showed US job growth cool…",
    "link": "https://www.memeorandum.com/250801/p86",
    "timestamp": "2025-08-01T18:55:01Z"
  },
  {
    "title": "Trump fires commissioner of labor statistics to be fired after weaker-than-expected jobs figures slam markets (Jeff Cox/CNBC)",
    "description": "Jeff Cox / CNBC:\nTrump fires commissioner of labor statistics to be fired after weaker-than-expected jobs figures slam markets  —  President Donald Trump on Friday fired the Bureau of Labor Statistics commissioner, hours after the agency reported that job gro…",
    "link": "https://www.memeorandum.com/250801/p85",
    "timestamp": "2025-08-01T18:55:01Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "Friday’s jobs report showed that just 73,000 jobs were added last month and that 258,000 fewer jobs were created May and June than previously estimated.",
    "link": "https://www.bostonglobe.com/2025/08/01/business/trump-fires-bls-commissioner/",
    "timestamp": "2025-08-01T18:54:23Z"
  },
  {
    "title": "'Struggling' Americans are skipping meals — and blaming Trump: 'shocking' poll",
    "description": "With inflation and unemployment rising, a majority of Americans say President Donald Trump is to blame for increased prices and the high cost of living, as many turn to credit cards and other high-interest vehicles to pay for their purchases, a new poll finds…",
    "link": "https://www.rawstory.com/trump-polls-2673799256/",
    "timestamp": "2025-08-01T18:53:03Z"
  },
  {
    "title": "Trump Demands Labor Statistics Head Be Fired In Meltdown Over Grim Jobs Report",
    "description": "Trump’s unhinged, on-again, off-again tariff scheme led to a weak jobs report Friday.",
    "link": "https://www.huffpost.com/entry/trump-bad-jobs-numbers-bls-fired_n_688d0a26e4b022644fdec852",
    "timestamp": "2025-08-01T18:52:50Z"
  },
  {
    "title": "Trump said he will fire Bureau of Labor Statistics commissioner hours after disappointing July jobs report",
    "description": "Trump said Friday he will fire Bureau of Labor Statistics Commissioner Erika McEntarfer following a disappointing jobs report.",
    "link": "https://www.businessinsider.com/trump-says-he-will-fire-bureau-of-labor-statistics-commissioner-2025-8",
    "timestamp": "2025-08-01T18:52:29Z"
  },
  {
    "title": "Indian Refiner Snaps Up US Oil After Trump's Russia Threats",
    "description": "State-owned Indian Oil Corp. bought at least 5 million barrels US crude, on top of 2 million barrels of supplies from Abu Dhabi, according to traders who asked not to be identified.",
    "link": "https://www.ndtvprofit.com/business/indian-refiner-snaps-up-us-oil-after-trumps-russia-threats",
    "timestamp": "2025-08-01T18:52:24Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shut down after Trump cuts",
    "description": "The closure is expected to have a profound impact on the journalistic and cultural landscape — in particular, public radio and TV stations in small communities across the United States.",
    "link": "https://www.bostonglobe.com/2025/08/01/business/cpb-public-media-shuts-down-trump/",
    "timestamp": "2025-08-01T18:51:28Z"
  },
  {
    "title": "Trump Targets China With 40% Transshipment Tariff",
    "description": "The Trump administration has announced a new 40% tariff on transshipments in a move seemingly targeting China.   Transshipments are indirect shipments through other nations... Read More\nThe post Trump Targets China With 40% Transshipment Tariff appeared first…",
    "link": "https://www.dailysignal.com/2025/08/01/trump-targets-china-40-transshipment-tariff/",
    "timestamp": "2025-08-01T18:51:10Z"
  },
  {
    "title": "El Salvador’s Crypto President Could Stay in Power for Decades After Changes to Constitution",
    "description": "Trump's buddy in Central America may become a dictator for life.",
    "link": "https://gizmodo.com/el-salvadors-crypto-president-could-stay-in-power-for-decades-after-changes-to-constitution-2000637886",
    "timestamp": "2025-08-01T18:50:12Z"
  },
  {
    "title": "Who's paying for the new White House golden ballroom? What we know",
    "description": "Trump wrote on Truth Social that he inspected the site of the ballroom that \"would be built, compliments of a man known as Donald J. Trump.\"",
    "link": "https://www.snopes.com//news/2025/08/01/trump-gold-ballroom-white-house/",
    "timestamp": "2025-08-01T18:50:00Z"
  },
  {
    "title": "Brett Kavanaugh says he doesn’t owe the public an explanation",
    "description": "Justice Brett Kavanaugh defended the Supreme Court’s recent practice of handing victories to President Donald Trump without explaining those decisions, while speaking at a judicial conference on Thursday. For most of its history, the Supreme Court was very ca…",
    "link": "https://www.vox.com/scotus/422035/supreme-court-brett-kavanaugh-shadow-docket",
    "timestamp": "2025-08-01T18:48:14Z"
  },
  {
    "title": "JD Vance Defends Sydney Sweeney Amid American Eagle Ad Backlash: “Dems Are Calling People Nazis for Finding Her Attractive”",
    "description": "Vice President JD Vance has waded into the controversy surrounding actress Sydney Sweeney’s latest campaign for American Eagle, criticizing what he calls a “...",
    "link": "https://whereisthebuzz.com/jd-vance-defends-sydney-sweeney-amid-american-eagle-ad-backlash-dems-are-calling-people-nazis-for-finding-her-attractive/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=jd-vance-defends-sydney-sweeney-amid-american-eagle-ad-backlash-dems-are-calling-people-nazis-for-finding-her-attractive",
    "timestamp": "2025-08-01T18:47:17Z"
  },
  {
    "title": "Senate Republicans Vote To Let Trump Keep Qatar Jet After Taxpayer-Funded $1 Billion Retrofit",
    "description": "The retrofit's exact cost is unclear, but the Pentagon transferred $934 million from its nuclear missile modernization budget to an unnamed classified project.",
    "link": "https://www.jalopnik.com/1928449/republicans-vote-trump-keep-qatar-jet/",
    "timestamp": "2025-08-01T18:46:53Z"
  },
  {
    "title": "Gavin Newsom Warns Trump 'Crashing' Economy as Jobs Numbers Revised Down",
    "description": "California Governor Gavin Newsom said Friday that President Donald Trump's economic agenda is \"crashing\" the U.S. economy.",
    "link": "https://www.newsweek.com/gavin-newsom-warns-trump-crashing-economy-jobs-numbers-revised-down-2107743",
    "timestamp": "2025-08-01T18:46:21Z"
  },
  {
    "title": "Trump orders firing of labor statistics boss hours after weak jobs report",
    "description": "President Donald Trump ordered the firing of the head of the Bureau of Labor Statistics, hours after a stunning government report showed that hiring had slowed.",
    "link": "https://biztoc.com/x/16280f89a3d8ce3c",
    "timestamp": "2025-08-01T18:46:17Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "Friday’s jobs report showed 258,000 fewer jobs were created May and June than estimated.",
    "link": "https://www.bostonherald.com/2025/08/01/trump-jobs-data/",
    "timestamp": "2025-08-01T18:46:06Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "Friday’s jobs report showed 258,000 fewer jobs were created May and June than estimated.",
    "link": "https://www.denverpost.com/2025/08/01/trump-jobs-data/",
    "timestamp": "2025-08-01T18:46:06Z"
  },
  {
    "title": "August 1, 2025: A Day that Will Live in Statistical Infamy",
    "description": "As of 1:35PM CT today, the President has fired the Commissioner of Labor Statistics, within 6 hours of the latest employment release. So what all of feared about the safety of the independence of our economic statistical agencies has come to pass. We might as…",
    "link": "https://econbrowser.com/archives/2025/08/august-1-2025-a-day-that-will-live-in-statistical-infamy",
    "timestamp": "2025-08-01T18:45:49Z"
  },
  {
    "title": "Illegal immigrant facing attempted murder charges for stabbing victim multiple times at soccer game",
    "description": "ICE lodges immigration detainer against 20-year-old from Honduras who faces attempted murder charges for stabbing attack during public soccer game in Baldwin County.",
    "link": "https://www.foxnews.com/us/illegal-immigrant-facing-attempted-murder-charges-stabbing-victim-multiple-times-soccer-game",
    "timestamp": "2025-08-01T18:45:19Z"
  },
  {
    "title": "Trump says he will fire lead official on economic data as stocks shudder",
    "description": "The move comes as a weaker-than-expected jobs report stoked fears about tariffs.",
    "link": "https://www.bbc.com/news/articles/cvg3xrrzdr0o",
    "timestamp": "2025-08-01T18:43:44Z"
  },
  {
    "title": "Trump admin comes to agreement with school of trans fencer seen in viral protest video",
    "description": "Wagner College came to a resolution agreement with President Donald Trump's Department of Education to protect women's sports, officials said Friday.",
    "link": "https://www.foxnews.com/sports/trump-admin-comes-agreement-school-trans-fencer-seen-viral-protest-video",
    "timestamp": "2025-08-01T18:42:29Z"
  },
  {
    "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
    "description": "President Donald Trump on Friday called for the firing of the head of the agency that produces the monthly jobs figures after a report showed hiring slowed...",
    "link": "https://www.yahoo.com/news/articles/trump-seeks-fire-official-overseeing-184217026.html",
    "timestamp": "2025-08-01T18:42:17Z"
  },
  {
    "title": "Donald Trump Just Delivered The Worst Three Months Of Job Growth Since The Pandemic",
    "description": "The last six months of Biden’s presidency saw twice as many jobs added as the first six months of Trump’s second term.",
    "link": "https://www.huffpost.com/entry/july-jobs-numbers-trump-growth_n_688cf935e4b09319f81647fa",
    "timestamp": "2025-08-01T18:41:26Z"
  },
  {
    "title": "Rupert Murdoch Stands Up to Trump",
    "description": "The Wrap: \"Rupert Murdoch has no professional mountains left to climb, but part of the 94-year-old media baron’s last act could be unexpected: Becoming one of the few moguls to stand up to President Donald",
    "link": "https://politicalwire.com/2025/08/01/rupert-murdoch-stands-up-to-trump/",
    "timestamp": "2025-08-01T18:40:02Z"
  },
  {
    "title": "Trump deploys nuclear submarines amid tensions with Russia",
    "description": "President Donald Trump said on Friday that he has directed the deployment of two US nuclear submarines to \"the appropriate regions\" amid an escalating war of words with former Russian President Dmitry Medvedev.",
    "link": "https://www.hurriyetdailynews.com/trump-deploys-nuclear-submarines-amid-tensions-with-russia-212109",
    "timestamp": "2025-08-01T18:39:21Z"
  },
  {
    "title": "Trump says he’s directing team to ‘immediately’ fire senior official over jobs numbers | CNN Business",
    "description": "President Donald Trump is directing his team to “immediately” fire Dr. Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, whom he accused of manipulating the monthly jobs reports for “political purposes.”",
    "link": "https://www.cnn.com/2025/08/01/business/trump-job-report-number-fire",
    "timestamp": "2025-08-01T18:38:41Z"
  }
]