[
  {
    "title": "Kamala Harris Weighs In On Possibility Of Another Presidential Bid",
    "description": "Harris announced in July that she gave “serious thought” to running for governor of California but ultimately declined.",
    "link": "https://www.huffpost.com/entry/kamala-harris-2028-president-run_n_68d2bed7e4b03fb4d9343787",
    "timestamp": "2025-09-23T18:13:26Z"
  },
  {
    "title": "Donald Trump’s sharia law attack on Sadiq Khan outrages Labour MPs",
    "description": "Keir Starmer is facing demands from Labour MPs to reprimand Donald Trump’s administration after the US president falsely claimed London wanted to “go to sharia law” under its “terrible mayor”, Sadiq Khan. In an address to the UN general assembly, Trump said: …",
    "link": "https://freerepublic.com/focus/f-news/4342228/posts",
    "timestamp": "2025-09-23T18:13:21Z"
  },
  {
    "title": "Trump says NATO nations should shoot down Russian jets breaching airspace",
    "description": "US President Donald Trump said Tuesday that NATO nations should shoot down Russian planes violating their territory, as he met Ukrainian President Volodymyr Zelensky on the sidelines of a UN summit. “Yes I do,” Trump said when a reporter asked if NATO countri…",
    "link": "https://www.digitaljournal.com/world/trump-says-nato-nations-should-shoot-down-russian-jets-breaching-airspace/article",
    "timestamp": "2025-09-23T18:12:20Z"
  },
  {
    "title": "ROOKE: Trump Admin Sets Sights On Next Target And Democrats Already Showing They’re Hypocritical",
    "description": "President Trump, alongside medical experts, announced new federal initiatives aimed at addressing autism, which has sent the left into hysterics.",
    "link": "https://dailycaller.com/2025/09/23/rooke-trump-autism-spectrum-disorder-asd-adhd-tylenol-acetaminophen-rfk-cnn-npr/",
    "timestamp": "2025-09-23T18:11:32Z"
  },
  {
    "title": "Mark Zuckerberg showed Google how to make Republicans happy",
    "description": "Last year Mark Zuckerberg wrote the playbook for Big Tech leaders dealing with Republicans. Google paid attention.",
    "link": "https://www.businessinsider.com/google-meta-congress-letter-youtube-zuckerberg-bongino-jordan-biden-2025-9",
    "timestamp": "2025-09-23T18:10:16Z"
  },
  {
    "title": "Trump couldn’t win over Charlie Kirk’s mourners",
    "description": "President Donald Trump was the final speaker at Charlie Kirk's memorial service, capping off six hours of an intensely evangelical, borderline nationalist Christian revival. He entered with the biggest pyrotechnics of the day while Lee Greenwood himself seren…",
    "link": "https://www.theverge.com/policy/783707/charlie-kirk-memorial-christian-nationalism-maga",
    "timestamp": "2025-09-23T18:08:36Z"
  },
  {
    "title": "US is behind global body '100%': Trump tells UN chief Guterres",
    "description": "Donald Trump met Antonio Guterres at the UN. Trump stated the US supports the UN. He mentioned potential disagreements. Trump criticized a malfunctioning escalator and teleprompter. Guterres thanked the US for its support. Trump claimed to have ended seven wa…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-is-behind-global-body-100-trump-tells-un-chief-guterres/articleshow/124076529.cms",
    "timestamp": "2025-09-23T18:08:12Z"
  },
  {
    "title": "Alabama builders rethink deportations as raids disappear hundreds of their ‘God-fearing, family-oriented’ immigrant workers",
    "description": "Builders are now calling for a work visa for law-abiding undocumented immigrants.",
    "link": "https://fortune.com/2025/09/23/alabama-rethinks-deportations-immigrants-construction-worker-shortage/",
    "timestamp": "2025-09-23T18:07:06Z"
  },
  {
    "title": "India's Manufacturing Ambitions Face Headwinds From 50% US Tariffs, Says WEF Report",
    "description": "While India has set a high target of becoming a $5 trillion economy, the 50% tariffs imposed by US President Donald Trump could weigh on this outlook, according to the World Economic Forum's latest Chief Economists Outlook.",
    "link": "https://www.ndtvprofit.com/economy-finance/indias-manufacturing-ambitions-face-headwinds-from-50-us-tariffs-says-wef-report",
    "timestamp": "2025-09-23T18:06:53Z"
  },
  {
    "title": "Rachel Maddow Nods Along as Kamala Harris Claims 2024 Was ‘Closest Presidential Election in the 21st Century’",
    "description": "Kamala Harris dubiously claimed that she came up short in the \"closest presidential election in the 21st Century\" during an interview with Rachel Maddow.\nThe post Rachel Maddow Nods Along as Kamala Harris Claims 2024 Was ‘Closest Presidential Election in the …",
    "link": "https://www.mediaite.com/media/tv/rachel-maddow-nods-along-as-kamala-harris-claims-2024-was-closest-presidential-election-in-the-21st-century/",
    "timestamp": "2025-09-23T18:05:27Z"
  },
  {
    "title": "Donald Trump issues scathing attack on Europe as he states 'your countries are going to hell' in chaotic UN address",
    "description": "Donald Trump broke a record with his chaotic speech at the United Nations General Assembly today",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-un-speech-europe-attack-469637-20250923",
    "timestamp": "2025-09-23T18:04:28Z"
  },
  {
    "title": "'I'm giving my opinion': Trump deviates from own FDA in autism remarks",
    "description": "As Trump cautioned pregnant women about the possible links between Tylenol and autism in children, his remarks went beyond available scientific evidence and even the FDA.",
    "link": "https://abcnews.go.com/Health/im-giving-opinion-trump-deviates-scientific-evidence-fda/story?id=125846554",
    "timestamp": "2025-09-23T18:03:17Z"
  },
  {
    "title": "Trump says NATO should down Russian planes if they breach its airspace",
    "description": "U.S. President Donald Trump said on Tuesday that NATO countries should shoot down Russian aircraft if they enter NATO territory, shortly after nations in the Western military alliance condemned Moscow for violating Estonian airspace. \"Yes I do,\" Trump told re…",
    "link": "https://freerepublic.com/focus/f-chat/4342227/posts",
    "timestamp": "2025-09-23T18:02:31Z"
  },
  {
    "title": "Jimmy Kimmel Taken off the Air AGAIN, Hours Before Scheduled Return on Tuesday",
    "description": "Hours before Jimmy Kimmel Live! was set to return to ABC on Tuesday night, another broadcasting network announced that it plans to preempt the show, meaning that nearly one-in-four Americans won’t be able to watch the late-night program. The Walt Disney Compa…",
    "link": "https://insidethemagic.net/2025/09/nexstar-will-preempt-jimmy-kimmel-live-jc1/",
    "timestamp": "2025-09-23T18:02:30Z"
  },
  {
    "title": "Trump’s reckless announcement linking Tylenol and autism is already doing major damage",
    "description": "President Donald Trump, alongside Secretary of Health and Human Services Robert F. Kennedy Jr., from left, and Medicare and Medicaid Administrator Mehmet Oz, from right, speaks about autism in the Roosevelt Room of the White House, on Sept. 22, 2025.",
    "link": "https://biztoc.com/x/e2a17f79ec95d3df",
    "timestamp": "2025-09-23T18:01:26Z"
  },
  {
    "title": "Trump: NATO should shoot down Russian jets in their airspace",
    "description": "United States President Donald Trump stated on Tuesday that he thinks NATO countries should shoot down Russian airplanes if they enter their airspace. He also stated that his country's help in shootin...",
    "link": "https://biztoc.com/x/8f487ed9650486b6",
    "timestamp": "2025-09-23T18:01:22Z"
  },
  {
    "title": "Doctor: Trump’s feelings about vaccines risk children's lives and discount centuries of evidence",
    "description": "Public health doctor Catherine Conlon explains why Trump’s moves on childhood vaccines are dangerous.",
    "link": "https://www.thejournal.ie/readme/trumps-feelings-about-vaccines-risk-childrens-lives-opinion-doctor-6824328-Sep2025/",
    "timestamp": "2025-09-23T18:00:51Z"
  },
  {
    "title": "RFK Jr. is running a dangerous experiment on all of us",
    "description": "Health and Human Services Secretary Robert Kennedy Jr. appears before the Senate Finance Committee in early September. \nThis week in “science” according to politicians, President Donald Trump and Health Secretary Robert F. Kennedy Jr. are now warning pregnant…",
    "link": "https://biztoc.com/x/c04f714bca9321e0",
    "timestamp": "2025-09-23T18:00:48Z"
  },
  {
    "title": "Donald Trump Says NATO Should Shoot Down Russian Aircraft Entering Airspace",
    "description": "The president made the remark to a reporter during a meeting with Ukrainian President Volodymyr Zelensky.",
    "link": "https://biztoc.com/x/714525c97c53a386",
    "timestamp": "2025-09-23T18:00:48Z"
  },
  {
    "title": "Inside Kate Middleton and Melania Trump’s Relationship After U.K. Visit",
    "description": "First Lady Melania Trump reportedly formed quite the bond with Princess Kate Middleton during her recent trip to the U.K. President Donald Trump and his wife, 55, made their second state visit to the U.K. earlier this month. Melania stepped out with Kate, 43,…",
    "link": "https://www.usmagazine.com/celebrity-news/news/inside-kate-middleton-melania-trumps-relationship-after-u-k-visit/#article",
    "timestamp": "2025-09-23T18:00:39Z"
  },
  {
    "title": "Bishop Budde’s inaugural remarks, not the impiety at Kirk’s memorial, are what Christianity is really about",
    "description": "I tried to stay as far away as I could from Charlie Kirk’s\r\n memorial service on Sunday. First and foremost, nothing gets between me and my Pittsburgh Steelers. So when the game ended around 4 p.m. Eastern and the Steelers won, my day went downhill fast.",
    "link": "https://www.advocate.com/voices/bishop-budde-contrast-kirk-memorial",
    "timestamp": "2025-09-23T18:00:03Z"
  },
  {
    "title": "Could a “Maximum Wage” Combat Billionaire Power?",
    "description": "Nearly a decade after Portland passed a landmark law to reign in CEO pay, social movements should aim to replicate the city’s success across the country.",
    "link": "https://inthesetimes.com/article/maximum-wage-billionaire-ceos-economy-trump-inequality",
    "timestamp": "2025-09-23T18:00:00Z"
  },
  {
    "title": "Israel Can No Longer Wish Palestine Away",
    "description": "International recognition of a Palestinian state has sparked Israeli defiance and risks further isolating Israel without improving conditions for Palestinians. A multilateral approach, engaging both sides and building on the New York Declaration, could offer …",
    "link": "https://www.rand.org/pubs/commentary/2025/09/israel-can-no-longer-wish-palestine-away.html",
    "timestamp": "2025-09-23T18:00:00Z"
  },
  {
    "title": "Comedian Mae Martin wants to surprise you in Netflix’s dark thriller ‘Wayward’",
    "description": "The new Netflix horror-comedy “Wayward\" stars Mae Martin as a trans cop who has just moved to a seemingly picturesque small town with his pregnant wife.",
    "link": "https://www.nbcnews.com/nbc-out/out-pop-culture/mae-martin-netflix-wayward-feel-good-rcna233003",
    "timestamp": "2025-09-23T18:00:00Z"
  },
  {
    "title": "Trump hits Russia, backs Israel in wide-ranging UN speech",
    "description": "<![CDATA[ US President Donald Trump made the case for lower levels of global migration and said world leaders should abandon efforts to fight climate change. ]]>",
    "link": "https://www.channelnewsasia.com/world/trump-un-russia-palestinian-state-migration-5365061",
    "timestamp": "2025-09-23T17:59:00Z"
  },
  {
    "title": "Trump hits Russia, backs Israel in wide-ranging UN speech",
    "description": "Trump made the case for lower levels of global migration and said world leaders should abandon efforts to fight climate change, which he called “the greatest con job” in the world.",
    "link": "https://www.channelnewsasia.com/world/trump-hits-russia-backs-israel-in-wide-ranging-un-speech-5365061",
    "timestamp": "2025-09-23T17:59:00Z"
  },
  {
    "title": "A Censored Rap Legend Has Advice for Jimmy Kimmel",
    "description": "Three decades ago, 2 Live Crew fought a First Amendment battle against the government—and won.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/09/jimmy-kimmel-luther-campbell-fcc/684326/",
    "timestamp": "2025-09-23T17:58:00Z"
  },
  {
    "title": "Indo Sport podcast: Ryder Cup week | Player payments, the ‘New York crowd’ and Donald Trump’s grand entrance",
    "description": "Joe is joined by Conor McKeon from Bethpage and golf writer John Huggan to look ahead to this weekend's Ryder Cup showdown between Europe and America.",
    "link": "https://www.independent.ie/podcasts/indo-sport-podcast/indo-sport-podcast-ryder-cup-week-player-payments-the-new-york-crowd-and-donald-trumps-grand-entrance/a629892823.html",
    "timestamp": "2025-09-23T17:57:54Z"
  },
  {
    "title": "Man with diaper, lift shoes, and orange clown makeup bails out on meeting with Democrats after calling them 'unserious' [Facepalm]",
    "description": "Man with diaper, lift shoes, and orange clown makeup bails out on meeting with Democrats after calling them 'unserious'",
    "link": "https://www.fark.com/comments/13821024/Man-with-diaper-lift-shoes-orange-clown-makeup-bails-out-on-meeting-with-Democrats-after-calling-them-unserious",
    "timestamp": "2025-09-23T17:57:51Z"
  },
  {
    "title": "Kamala Says Trump Should Blame His Own ‘Lax Gun Laws’ For Second Assassination Attempt",
    "description": "Former Vice President Kamala Harris suggested in her new book that President Donald Trump is partly responsible for the second attempt on his life at a Florida golf course in September 2024 — due to Republicans’ support for “lax gun laws.” Harris made the cla…",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-trump-gun-laws-ryan-routh/",
    "timestamp": "2025-09-23T17:57:43Z"
  },
  {
    "title": "MSNBC host straightened out by Dem lawmaker as she tries to defend Homan over bribe",
    "description": "An attempt by an MSNBC host to diminish reporting that so-called ‘border czar” Tom Homan took $50,000 from undercover federal investigators last year got some quick pushback from a Democrat serving in the House on Tuesday.Appearing on MSNBC with host Anna Cab…",
    "link": "https://www.rawstory.com/homan-bribery/",
    "timestamp": "2025-09-23T17:57:27Z"
  },
  {
    "title": "Scheffler Expects Trump Visit To Boost USA At Ryder Cup",
    "description": "Top-ranked golfer Scottie Scheffler said Tuesday that he expects President Donald Trump's planned appearance later this week at the Ryder Cup to boost the United States squad.",
    "link": "https://www.ibtimes.com/scheffler-expects-trump-visit-boost-usa-ryder-cup-3784249",
    "timestamp": "2025-09-23T17:57:16Z"
  },
  {
    "title": "'Don’t pay any attention whatsoever': UK's health minister gives Trump epic putdown - NewsBreak",
    "description": "Global health experts are aghast that President Donald Trump announced an unproven link between autism and commonly used painkillers and vaccines, and they",
    "link": "https://www.newsbreak.com/share/4251951128323-don-t-pay-any-attention-whatsoever-uk-s-health-minister-gives-trump-epic-putdown?s=a2&amp;share_destination_id=MjgwNTk0MDk1LTE3NTg2NTAyMDEwODE%3D&amp;pd=0IzLLDa7&amp;hl=en_US&amp;send_time=1758650201&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.37.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-09-23T17:57:11Z"
  },
  {
    "title": "Trump UN Speech: US President asks nations to shut borders, expel foreigners, ‘Your countries are going to hell’",
    "description": "U.S. President Donald Trump delivered a confrontational address at the United Nations General Assembly on Monday, urging countries to tighten their borders, expel foreign nationals, and oppose what he termed a “globalist migration agenda”.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-un-speech-us-president-asks-nations-to-shut-borders-expel-foreigners-your-countries-are-going-to-hell/articleshow/124076204.cms",
    "timestamp": "2025-09-23T17:56:37Z"
  },
  {
    "title": "EXCLUSIVE: Trump Admin Axes Millions In Grants To Several DEI-Tied Environmental Organizations",
    "description": "The Daily Caller News Foundation has learned that the Department of the Interior (DOI) is cancelling 79 grants Tuesday, totaling around $14 million.",
    "link": "https://dailycaller.com/2025/09/23/exclusive-trump-admin-axes-millions-in-grants-to-several-dei-tied-environmental-organizations/",
    "timestamp": "2025-09-23T17:56:13Z"
  },
  {
    "title": "RFK Jr. is running a dangerous experiment on all of us",
    "description": "This week in “science” according to politicians, President Donald Trump and Health Secretary Robert F. Kennedy Jr. are now warning pregnant women to avoid Tylenol — yes, Tylenol — because of its supposed link to autism. Never mind that there’s no strong scien…",
    "link": "https://www.vox.com/podcasts/462402/rfk-jr-childhood-vaccine-schedule-advisory-committee-immunization-practices",
    "timestamp": "2025-09-23T17:55:55Z"
  },
  {
    "title": "Trump says NATO countries should shoot down Russian jets that violate airspace",
    "description": "President Donald Trump called for NATO nations to shoot down Russian jets if they violate their airspace on Tuesday.",
    "link": "https://www.foxnews.com/politics/trump-says-nato-countries-should-shoot-down-russian-jets-violate-airspace",
    "timestamp": "2025-09-23T17:54:49Z"
  },
  {
    "title": "Scheffler expects Trump visit to boost USA at Ryder Cup",
    "description": "Top-ranked golfer Scottie Scheffler said Tuesday that he expects President Donald Trump's planned appearance later this week at the Ryder Cup to boost the United States squad. \"It has been a tough few weeks for our country with some of the stuff that has been…",
    "link": "https://sports.yahoo.com/article/scheffler-expects-trump-visit-boost-175425180.html",
    "timestamp": "2025-09-23T17:54:25Z"
  },
  {
    "title": "Jimmy Kimmel Breaks Silence After Show Suspension, Shares Message With Fans",
    "description": "After a week-long hiatus, Jimmy Kimmel shares a surprising message with fans on Instagram after the suspension of his late-night talk show.",
    "link": "https://screenrant.com/jimmy-kimmel-suspension-message-norman-lear/",
    "timestamp": "2025-09-23T17:54:15Z"
  },
  {
    "title": "Trump issues ominous threat as he suffers awkward blunder during UN speech",
    "description": "Donald Trump raged against the machines during his lengthy speech at the United Nation's HQ in New York after he experienced two technical issues.",
    "link": "https://www.ladbible.com/news/us-news/trump-speech-un-teleprompter-not-working-ominous-warning-escalator-999478-20250923",
    "timestamp": "2025-09-23T17:53:32Z"
  },
  {
    "title": "Donald Trump claims a link between paracetamol and autism – but what is Irish experts’ advice to pregnant women?",
    "description": "\"Fight like hell not to take it,” US president Donald Trump told expectant mothers this week when he claimed there is a link between pregnant women taking paracetamol and autism in children.",
    "link": "https://www.independent.ie/irish-news/donald-trump-claims-a-link-between-paracetamol-and-autism-but-what-is-irish-experts-advice-to-pregnant-women/a325176149.html",
    "timestamp": "2025-09-23T17:52:23Z"
  },
  {
    "title": "The Leader Behind the ‘Biggest Plot Twist in History” Is About to Step on the U.N. Stage",
    "description": "Ahmed al-Sharaa will deliver remarks at the United Nations General Assembly, marking Syria’s first presidential address there in nearly 60 years.",
    "link": "https://slate.com/news-and-politics/2025/09/syria-ahmed-al-sharaa-debut-united-nations-history.html",
    "timestamp": "2025-09-23T17:50:37Z"
  },
  {
    "title": "Fed’s Powell Cites Weakening Job Market For Interest Rate Cut",
    "description": "A recent decision by the central bank leaves the U.S. “well-positioned” to respond to economic developments, Powell said.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/09/23/feds-powell-cites-weakening-job-market-for-interest-rate-cut/",
    "timestamp": "2025-09-23T17:50:22Z"
  },
  {
    "title": "Trump settles on downtown Miami for his presidential library (Matt Dixon/NBC News)",
    "description": "Matt Dixon / NBC News:\nTrump settles on downtown Miami for his presidential library  —  The formal decision to dedicate land for the library will be voted on soon by the Florida Cabinet.  The vote is expected to be unanimous.  —  Donald Trump's future preside…",
    "link": "https://www.memeorandum.com/250923/p76",
    "timestamp": "2025-09-23T17:50:00Z"
  },
  {
    "title": "UK is open to overseas talent unlike US, Reeves says",
    "description": "UK is open to overseas talent unlike US, Reeves says\nThe UK will make it easier to attract global talent at a time when the US is making it harder, the chancellor has said, in a direct reference to a recent overhaul of American visa policy.\nOn Friday, US Pres…",
    "link": "https://biztoc.com/x/1a23e38358423eee",
    "timestamp": "2025-09-23T17:49:42Z"
  },
  {
    "title": "Trump Blasts UN Over Immigration, Climate in Combative Speech",
    "description": "President Donald Trump assailed the United Nations and other countries in a grievance-laden speech that accused the world body of offering nothing but “empty words,” labeled climate change a “con job” and warned open borders risked destroying nations.\nSetting…",
    "link": "https://biztoc.com/x/87a5828331c16a2d",
    "timestamp": "2025-09-23T17:49:36Z"
  },
  {
    "title": "British Government on Autism Announcement: 'Don't Pay Any Attention Whatsoever to What Donald Trump Says'",
    "description": "Britons should only trust the NHS, the Labour government said, warning the nation to not pay \"any attention whatsoever\" to Donald Trump.\nThe post British Government on Autism Announcement: ‘Don’t Pay Any Attention Whatsoever to What Donald Trump Says’ appeare…",
    "link": "https://www.breitbart.com/europe/2025/09/23/british-government-on-autism-announcement-dont-pay-any-attention-whatsoever-to-what-donald-trump-says/",
    "timestamp": "2025-09-23T17:49:23Z"
  },
  {
    "title": "Iran Meets Europeans But No Sign Of Sanctions Breakthrough",
    "description": "European powers seeking to soon reimpose tough sanctions on Iran over its nuclear program met Tuesday with Tehran's top diplomat, but there were no signs of compromise.",
    "link": "https://www.ibtimes.com/iran-meets-europeans-no-sign-sanctions-breakthrough-3784248",
    "timestamp": "2025-09-23T17:48:12Z"
  },
  {
    "title": "Joan Baez Warns Americans Not To Lose Their 'Dictator-Phobia' Under Trump",
    "description": "The legendary folk singer-songwriter discussed President Donald Trump and the \"cruelty\" of his administration with MSNBC host Nicolle Wallace.",
    "link": "https://www.huffpost.com/entry/joan-baez-dictator-phobia-donald-trump_n_68d29efce4b02b5b9fb2ebbe",
    "timestamp": "2025-09-23T17:48:02Z"
  },
  {
    "title": "‘Ninety-Nine Problems, And My VP Can’t Be One’: Kamala Unloads On Why She Jilted Josh Shapiro",
    "description": "'I had a nagging concern'",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-josh-shapiro-vice-president/",
    "timestamp": "2025-09-23T17:47:57Z"
  },
  {
    "title": "Trump Supporters Are Lying About Biden ‘Censorship’ To Justify Brendan Carr’s Unconstitutional Kimmel Threats",
    "description": "Trump supporters cycled through increasingly desperate explanations for why the Jimmy Kimmel situation was totally legitimate. First came the absurd “low ratings” defense—because sure, networks routinely cancel shows minutes before taping due to sudden rating…",
    "link": "https://www.techdirt.com/2025/09/23/trump-supporters-are-lying-about-biden-censorship-to-justify-brendan-carrs-unconstitutional-kimmel-threats/",
    "timestamp": "2025-09-23T17:47:56Z"
  },
  {
    "title": "Is Trump's geopolitical strategy sabotaging India's future?",
    "description": "Donald Trump's disruptive foreign policies are creating global instability, impacting India significantly. From accusing India of funding Russia's war to imposing tariffs and revoking the Chabahar port waiver, Trump's actions are perceived as detrimental. The…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/is-trumps-geopolitical-strategy-sabotaging-indias-future/articleshow/124076095.cms",
    "timestamp": "2025-09-23T17:46:01Z"
  },
  {
    "title": "Iran says talks with E3 over return of UN sanctions will continue",
    "description": "UNITED NATIONS (Reuters) -Iran and European powers have agreed to continue talks about Tehran's disputed nuclear programme, the Iranian foreign ministry said on Tuesday, after a meeting to try to strike a last-ditch deal to avert the reimposition of U.N. sanc…",
    "link": "https://www.thestar.com.my/news/world/2025/09/24/iran-says-talks-with-e3-over-return-of-un-sanctions-will-continue",
    "timestamp": "2025-09-23T17:46:00Z"
  },
  {
    "title": "Powell warns of inflation risks if US Fed cuts rates ‘too aggressively’",
    "description": "US Federal Reserve chief Jerome Powell warned Tuesday that slashing interest rates too quickly could allow inflation to remain elevated, but stressed that the central bank faces dual challenges moving forward. “There is no risk-free path,” he told a Rhode Isl…",
    "link": "https://www.digitaljournal.com/world/powell-warns-of-inflation-risks-if-us-fed-cuts-rates-too-aggressively/article",
    "timestamp": "2025-09-23T17:42:34Z"
  },
  {
    "title": "Iran meets Europeans but no sign of sanctions breakthrough",
    "description": "European powers seeking to soon reimpose tough sanctions on Iran over its nuclear program met Tuesday with Tehran’s top diplomat, but there were no signs of compromise. “Iran must never obtain a nuclear weapon,” German Foreign Minister Johann Wadephul told re…",
    "link": "https://www.digitaljournal.com/world/iran-meets-europeans-but-no-sign-of-sanctions-breakthrough/article",
    "timestamp": "2025-09-23T17:42:20Z"
  },
  {
    "title": "Trump says at Milei talks that Argentina does not ‘need’ bailout",
    "description": "US President Donald Trump said Tuesday he did not believe struggling Argentina needed a bailout, as he backed his counterpart and close ally Javier Milei in a meeting on the sidelines of a UN summit. “We’re gonna help them but I don’t think they need a bailou…",
    "link": "https://www.digitaljournal.com/world/trump-says-at-milei-talks-that-argentina-does-not-need-bailout/article",
    "timestamp": "2025-09-23T17:42:20Z"
  },
  {
    "title": "Powell Warns Of Inflation Risks If US Fed Cuts Rates 'Too Aggressively'",
    "description": "US Federal Reserve chief Jerome Powell warned Tuesday that slashing interest rates too quickly could allow inflation to remain elevated, but stressed that the central bank faces dual challenges moving forward.",
    "link": "https://www.ibtimes.com/powell-warns-inflation-risks-if-us-fed-cuts-rates-too-aggressively-3784247",
    "timestamp": "2025-09-23T17:42:06Z"
  },
  {
    "title": "Russia crude exports hit 16-month high despite output cuts due to attacks",
    "description": "Russia's seaborne crude exports have surged to a 16-month high, averaging 3.62 million barrels daily in the past four weeks, even as Ukrainian drone attacks have curtailed domestic refinery output. These attacks have reduced Russian refining runs to their low…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-crude-exports-hit-16-month-high-despite-output-cuts-due-to-attacks/articleshow/124076003.cms",
    "timestamp": "2025-09-23T17:41:58Z"
  },
  {
    "title": "Trump calls for Gaza war to stop ‘immediately’ in UNGA speech",
    "description": "The US president dismisses recognition of a Palestinian state, calling it a 'reward' for Hamas.",
    "link": "https://www.aljazeera.com/news/2025/9/23/trump-calls-for-gaza-war-to-stop-immediately-in-unga-speech",
    "timestamp": "2025-09-23T17:41:33Z"
  },
  {
    "title": "Tylenol, vaccines have no links to causing autism",
    "description": "Neither the painkiller Tylenol nor vaccines have been shown to cause autism, the World Health Organization have said, following comments from US President Donald Trump and his administration to the contrary.",
    "link": "https://www.rte.ie/news/2025/0923/1534970-tylenol-vaccines-autism/",
    "timestamp": "2025-09-23T17:41:05Z"
  },
  {
    "title": "4chan’s ‘Operation Clog the Toilet’ causes panic among H-1B visa holders after Trump’s $100,000 fee announcement",
    "description": "Users of the right-wing forum 4chan attempted to stop Indian people from returning to the U.S. in response to President Donald Trump’s H-1B visa overhaul by block-booking plane seats over the weekend as part of a prank dubbed “Operation Clog the Toilet.” Afte…",
    "link": "https://freerepublic.com/focus/f-news/4342226/posts",
    "timestamp": "2025-09-23T17:40:33Z"
  },
  {
    "title": "Kamala Harris Says Her Grief From Losing To Trump Compared To The Day Her Mother Died",
    "description": "Former Vice President Kamala Harris said on Tuesday that she \"grieved\" so deeply over her loss to President Donald Trump it compared to the day her mother died.",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-grief-trump-2024-election/",
    "timestamp": "2025-09-23T17:40:21Z"
  },
  {
    "title": "EU Parliament Votes to Uphold Immunity for 'Antifa' Lawmaker Accused of Hammer Attack",
    "description": "The European Parliament’s Legal Affairs committee has voted to uphold the immunity for Italian MEP Ilaria Salis, who faces attempted murder charges in Hungary over an alleged Antifa hammer attack in Budapest.\nThe post EU Parliament Votes to Uphold Immunity fo…",
    "link": "https://www.breitbart.com/europe/2025/09/23/eu-parliament-votes-to-uphold-immunity-for-antifa-lawmaker-accused-of-hammer-attack/",
    "timestamp": "2025-09-23T17:40:11Z"
  },
  {
    "title": "Interfaith Conference at US Capitol Complex under the Leadership of Pastor Mark Burns: The Rise of Spiritual Diplomats",
    "description": "International Interfaith Conference “United in Liberty: The Rise of Spiritual Diplomats” On October 28, 2025, the Cannon Caucus Room inside the U.S. Capitol Complex, Washington D.C. will host a gathering unlike any other on the global diplomatic calendar. Rel…",
    "link": "https://dailycaller.com/2025/09/23/interfaith-conference-at-us-capitol-complex-under-the-leadership-of-pastor-mark-burns-the-rise-of-spiritual-diplomats/",
    "timestamp": "2025-09-23T17:39:45Z"
  },
  {
    "title": "UK is open to overseas talent unlike US, Reeves says",
    "description": "Her comments come after US announced a 50-fold hike in the cost of skilled-worker permits.",
    "link": "https://www.bbc.com/news/articles/c5yjlw4n5d5o",
    "timestamp": "2025-09-23T17:39:24Z"
  },
  {
    "title": "Why China Hawks Love Talking About AI",
    "description": "Artificial intelligence is not the most important part of the U.S.-China technology race, yet it receives the most attention in Washington.",
    "link": "http://foreignpolicy.com/2025/09/23/china-us-ai-competition-energy-biotechnology/",
    "timestamp": "2025-09-23T17:39:01Z"
  },
  {
    "title": "Car Owners Have Additional Tool To Find Out If They Can Recoup Money From Auctioned Vehicle",
    "description": "The DMV has been keeping profits from the sales of towed cars, without giving owners a chance to claim the money.",
    "link": "https://www.kqed.org/news/12057216/car-owners-have-additional-tool-to-find-out-if-they-can-recoup-money-from-auctioned-vehicle",
    "timestamp": "2025-09-23T17:38:51Z"
  },
  {
    "title": "Macron does not think Trump deserves Nobel Peace Prize",
    "description": "French President Emmanuel Macron said on Tuesday that United States President Donald Trump should not be awarded the Nobel Peace Prize until he ends the Israel-Hamas conflict. He said Trump is the onl...",
    "link": "https://biztoc.com/x/c0255bcff7a79639",
    "timestamp": "2025-09-23T17:38:45Z"
  },
  {
    "title": "Trump’s crackdown on high-skill immigration will make Americans poorer",
    "description": "President Donald Trump signs an executive order in the Oval Office at the White House on September 19, 2025, in Washington, DC. Trump signed a series of executive orders establishing the “Trump Gold Card” and introducing a $100,000 fee for H-1B visas. | Andre…",
    "link": "https://biztoc.com/x/c96b64020f48a3ea",
    "timestamp": "2025-09-23T17:38:27Z"
  },
  {
    "title": "Kamala Harris’ book ‘107 Days’ gets the reason she lost all wrong",
    "description": "In \"107 Days,\" Kamala Harris' memoir about the 2024 presidential election, she wrongly argues that she lost to Donald Trump because she didn't have enough time.",
    "link": "https://biztoc.com/x/eef179d1d7cd2879",
    "timestamp": "2025-09-23T17:38:19Z"
  },
  {
    "title": "Kamala Harris Returns To ‘The View’ After Disastrous 2024 Appearance",
    "description": "Former Vice President (and failed presidential candidate) Kamala Harris returned to the scene of the blunder today when she appeared as a guest on ABC’s The View, and she addressed her ruinous 2024 appearance on the show when she failed to make a clear distin…",
    "link": "http://deadline.com/2025/09/kamala-harris-the-view-1236553419/",
    "timestamp": "2025-09-23T17:37:25Z"
  },
  {
    "title": "Kamala Harris rejects idea that bungled 'View' interview was tipping point in campaign",
    "description": "\"The View\" co-host Sunny Hostin pressed Kamala Harris on Tuesday to address her viral answer to her question about President Biden from a October 2024 interview with the co-hosts.",
    "link": "https://www.foxnews.com/media/kamala-harris-rejects-idea-bungled-view-interview-tipping-point-campaign",
    "timestamp": "2025-09-23T17:37:12Z"
  },
  {
    "title": "Golden Age: Trump's DHS Oversees Two Million Illegals Deported from U.S.",
    "description": "The Department of Homeland Security (DHS) announced that two million illegal aliens have either been deported or self-deported from the United States since President Donald Trump took office on January 20. \nThe post Golden Age: Trump’s DHS Oversees Two Millio…",
    "link": "https://www.breitbart.com/politics/2025/09/23/golden-age-trumps-dhs-oversees-two-million-illegals-deported-from-us/",
    "timestamp": "2025-09-23T17:37:01Z"
  },
  {
    "title": "EXCLUSIVE: Doctors Mutilating Gender-Confused Kids Are Now On The Clock",
    "description": "Sen. Bill Cassidy is giving the America Medical Association two weeks to provide evidence it is complying with President Donald Trump’s child sex-change ban.",
    "link": "https://dailycaller.com/2025/09/23/exclusive-bill-cassidy-letter-american-medical-association-child-sex-changes/",
    "timestamp": "2025-09-23T17:37:00Z"
  },
  {
    "title": "Trump’s crackdown on high-skill immigration will make Americans poorer",
    "description": "Donald Trump just transformed America’s high-skill immigration system. In a proclamation Friday, the president imposed a $100,000 fee on all new applications for H-1B visas (although the administration would retain the right to offer companies exemptions at w…",
    "link": "https://www.vox.com/politics/462436/trump-h1b-visa-fee",
    "timestamp": "2025-09-23T17:36:14Z"
  },
  {
    "title": "This Dem just gave voice to the resistance",
    "description": "As you know, Jimmy Kimmel was suspended — before being reinstated this week — due to two factors. One is a federal government, specifically the FCC, that is turning into the Thought Police. The second is the cowards and quislings at Disney and ABC, who are un…",
    "link": "https://www.rawstory.com/raw-investigates/at-least-one-congressman-has-a-message-we-all-should-heed/",
    "timestamp": "2025-09-23T17:36:07Z"
  },
  {
    "title": "Trump cancels White House meeting with Schumer and Jeffries despite risk of a government shutdown (Lisa Mascaro/Associated Press)",
    "description": "Lisa Mascaro / Associated Press:\nTrump cancels White House meeting with Schumer and Jeffries despite risk of a government shutdown  —  President Donald Trump has abruptly canceled this week's planned meeting with congressional Democratic leaders, refusing to …",
    "link": "https://www.memeorandum.com/250923/p72",
    "timestamp": "2025-09-23T17:35:00Z"
  },
  {
    "title": "Small, mid-sized IT firms shrug off impact of US visa fee hike on business",
    "description": "The country’s top five tech majors—Tata Consultancy Services Ltd, Infosys Ltd, HCL Technologies Ltd, Wipro Ltd and Tech Mahindra Ltd—have so far not disclosed whether the order will impact their business.",
    "link": "https://www.livemint.com/companies/it-services-software-companies-h-1b-visa-trump-tcs-tech-mahindra-infosys-wipro-fee-hike-us-citizenship-sonata-software-11758637016287.html",
    "timestamp": "2025-09-23T17:31:56Z"
  },
  {
    "title": "Fed Chair Powell says rising inflation and slow hiring pose 'challenging situation'",
    "description": "The remarks came less than a week after the Fed cut interest rates.",
    "link": "https://abcnews.go.com/Business/fed-chair-powell-rising-inflation-slow-hiring-pose/story?id=125857000",
    "timestamp": "2025-09-23T17:31:39Z"
  },
  {
    "title": "Trump Admits His Advice on Tylenol and Pregnancy Isn’t Doctor-Approved",
    "description": "“The fearmongering will prevent women from accessing the appropriate care during pregnancy,” one health expert noted.",
    "link": "https://truthout.org/articles/trump-admits-his-advice-on-tylenol-and-pregnancy-isnt-doctor-approved/",
    "timestamp": "2025-09-23T17:31:36Z"
  },
  {
    "title": "‘This Is the Process’: Harris Brushed Off Pelosi’s Calls For Primary During 2024 Election",
    "description": "Former Speaker Of The House Nancy Pelosi broke with the Democratic Party in its acceptance of Vice President Kamala Harris as the successor to President Joe Biden in 2024, Harris’ new book “107 Days” reveals. In a flurry of calls made on July 21, 2024, Pelosi…",
    "link": "https://dailycaller.com/2025/09/23/this-is-the-process-harris-brushed-off-pelosis-calls-for-primary-during-2024-election/",
    "timestamp": "2025-09-23T17:31:02Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with Zelensky at U.N.",
    "description": "President Donald Trump meets with Ukrainian President Volodymyr Zelensky at the United Nations on Tuesday, September 23.\nThe post Watch Live: Donald Trump Meets with Zelensky at U.N. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/09/23/watch-live-donald-trump-meets-with-zelensky-at-u-n/",
    "timestamp": "2025-09-23T17:30:01Z"
  },
  {
    "title": "Ron DeSantis eyes Miami site next to Freedom Tower for Trump presidential library",
    "description": "Florida Gov. Ron DeSantis is eyeing a parking lot next to Miami’s Freedom Tower for a Donald Trump presidential library. The state’s top elected official plans to submit an item to the Florida Board of Trustees of the Internal Improvement Trust Fund to convey…",
    "link": "https://therealdeal.com/miami/2025/09/23/trump-presidential-library-could-be-built-on-miami-site/",
    "timestamp": "2025-09-23T17:30:00Z"
  },
  {
    "title": "'Vote chori', Trump's tariffs to figure in CWC meeting in Patna: Bihar Congress chief",
    "description": "Bihar Congress president Rajesh Kumar announced that the CWC meeting in Patna would address state, national, and international issues, including 'vote theft' and Trump's tariffs. BJP leaders criticized the meeting's location as a pre-election tactic, while RJ…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/vote-chori-trumps-tariffs-to-figure-in-cwc-meeting-in-patna-bihar-congress-chief/articleshow/124075767.cms",
    "timestamp": "2025-09-23T17:29:36Z"
  },
  {
    "title": "Opinion - CEO poll shows Trump economic policies are bad, but they’re too scared to speak up",
    "description": "Donald Trump likes to paint himself as some sort of financial savior — the guy who knows how to make America rich again. But if you take a closer look, a...",
    "link": "https://thehill.com/opinion/lindseys-lens/5517970-trump-economic-policies-ceos-criticize/",
    "timestamp": "2025-09-23T17:27:23Z"
  },
  {
    "title": "‘Govt should announce loan waiver to help farmers tide over flood crisis’, says farmers union president",
    "description": "The government should immediately announce a complete loan waiver for the farmers who have taken bank loans to sow kharif.",
    "link": "https://indianexpress.com/article/cities/mumbai/loan-waiver-farmers-tide-flood-crisis-10267318/",
    "timestamp": "2025-09-23T17:27:16Z"
  },
  {
    "title": "N.J.-based Tylenol maker ‘deeply concerned,’ defends drug against autism link",
    "description": "The company maintains its popular pain reliever is still safe to use during pregnancy.",
    "link": "https://www.nj.com/healthfit/2025/09/nj-based-tylenol-maker-deeply-concerned-defends-drug-against-autism-link.html",
    "timestamp": "2025-09-23T17:26:09Z"
  },
  {
    "title": "Breaking: Trump and Albanese to meet next month, White House confirms",
    "description": "The Prime Minister is expected to travel to Washington to hold talks with the US President on October 20.",
    "link": "https://www.abc.net.au/news/2025-09-24/trump-and-albanese-to-meet/105809460",
    "timestamp": "2025-09-23T17:26:01Z"
  },
  {
    "title": "Trump's approval dips as Americans worry about economy, Reuters/Ipsos poll finds",
    "description": "A recent Reuters/Ipsos poll reveals a slight dip in President Trump's approval rating, fueled by concerns over the U.S. economy and rising prices. While Americans are split on which party can best tackle extremism, Trump's immigration policies remain relative…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-approval-dips-as-americans-worry-about-economy-reuters/ipsos-poll-finds/articleshow/124075708.cms",
    "timestamp": "2025-09-23T17:24:51Z"
  },
  {
    "title": "Trump’s reckless announcement linking Tylenol and autism is already doing major damage",
    "description": "President Donald Trump and Secretary of Health and Human Services Robert F. Kennedy Jr. made their announcement advising pregnant women not to take Tylenol.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/autism-tylenol-kennedy-trump-leucovorin-acetaminophen-evidence-rcna232990",
    "timestamp": "2025-09-23T17:24:38Z"
  },
  {
    "title": "Major automakers call for EPA to ease tailpipe emissions rules",
    "description": "WASHINGTON :A group representing nearly all major automakers asked the Trump administration Tuesday to roll back aggressive vehicle emissions limits that seek to force the industry to build a rising number of electric vehicles.The Alliance for Automotive Inno…",
    "link": "https://www.channelnewsasia.com/business/major-automakers-call-epa-ease-tailpipe-emissions-rules-5365051",
    "timestamp": "2025-09-23T17:24:06Z"
  },
  {
    "title": "2 million illegal aliens have left U.S. under Trump, federal government confirms",
    "description": "Hundreds of thousands are leaving voluntarily amidst border security crackdown",
    "link": "https://www.wnd.com/2025/09/2-million-illegal-aliens-have-left-u-s/",
    "timestamp": "2025-09-23T17:22:50Z"
  },
  {
    "title": "'Wake-up call': Jimmy Kimmel's return launches new fight against Trump",
    "description": "Jimmy Kimmel will return\r\n to the airwaves Tuesday night after his suspension by ABC was met with a massive public backlash. But while they say the comedian’s reinstatement is cause for celebration, advocates say that it’s just one small victory in a much lar…",
    "link": "https://www.rawstory.com/wake/",
    "timestamp": "2025-09-23T17:22:42Z"
  },
  {
    "title": "Trump Hangs Tacky ‘Walk of Fame’ Sign Outside White House",
    "description": "Trump is hanging a tacky ‘Presidential Walk of Fame’ sign outside the White House. His plan to troll Joe Biden via gallery wall now involves a large, hideous sign that’s visible from the newly paved Rose Garden.",
    "link": "http://nymag.com/intelligencer/article/trump-hangs-tacky-walk-of-fame-sign-outside-white-house.html",
    "timestamp": "2025-09-23T17:22:05Z"
  },
  {
    "title": "From escalators to teleprompters, Trump piles on criticism at the UN",
    "description": "In a wide-ranging speech at the UN, President Trump slammed the world body and singled out many of the countries in attendance.",
    "link": "https://www.bbc.com/news/videos/cy50qzgyyexo",
    "timestamp": "2025-09-23T17:21:39Z"
  },
  {
    "title": "Pregnant Liberal Women Post Videos Downing Tylenol to Own Trump: This Is an 'Attack on Women'",
    "description": "Some pregnant liberal women are posting videos of themselves downing acetaminophen, commonly known as Tylenol.\nThe post Pregnant Liberal Women Post Videos Downing Tylenol to Own Trump: This Is an ‘Attack on Women’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/23/pregnant-liberal-women-post-videos-downing-tylenol-own-trump-this-is-attack-women/",
    "timestamp": "2025-09-23T17:21:38Z"
  },
  {
    "title": "Eli Lilly to make weight-loss pill in new $6.5 billion Texas plant",
    "description": "Eli Lilly is investing $6.5 billion to build a new manufacturing plant in Houston, Texas, as part of its broader $27 billion U.S. expansion plan. The facility will primarily produce the active ingredients for orforglipron, Lilly's experimental weight-loss pil…",
    "link": "https://economictimes.indiatimes.com/news/international/business/eli-lilly-to-make-weight-loss-pill-in-new-6-5-billion-texas-plant/articleshow/124075591.cms",
    "timestamp": "2025-09-23T17:19:57Z"
  },
  {
    "title": "Trump says Argentina bailout unlikely",
    "description": "Donald Trump said the United States will assist Argentina. He does not believe a bailout is necessary. Treasury Secretary Scott Bessent is exploring options for Argentina's stability. Trump endorsed Javier Milei for re-election. He wants Milei to complete his…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-argentina-bailout-unlikely/articleshow/124075525.cms",
    "timestamp": "2025-09-23T17:17:48Z"
  }
]