[
  {
    "title": "Jeffrey Epstein’s brother hurls bombshell claim at DOJ: 'There's a facility in Virginia'",
    "description": "Mark Epstein, the brother of Jeffrey Epstein, lobbed an explosive claim at the Trump administration Monday as its Justice Department continues to face scrutiny over its botched release of files on the disgraced financier.The DOJ released a trove of Epstein-re…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674822024/",
    "timestamp": "2025-12-22T17:56:05Z"
  },
  {
    "title": "Trump pauses more offshore wind projects citing national security concerns",
    "description": "The directive pausing five projects comes as the administration ramps up offshore oil and gas production.",
    "link": "https://www.aljazeera.com/economy/2025/12/22/trump-pauses-more-offshore-wind-projects-citing-national-security-concerns",
    "timestamp": "2025-12-22T17:56:01Z"
  },
  {
    "title": "CBSNEWS SHIELDS THE DON!",
    "description": "Earlier this month, after President Donald Trump blasted “60 Minutes” for interviewing Marjorie Taylor Greene, correspondents noticed a change behind the scenes.",
    "link": "https://www.cnn.com/2025/12/22/media/bari-weiss-60-minutes-cecot-cbs-alfonsi-ellison",
    "timestamp": "2025-12-22T17:55:36Z"
  },
  {
    "title": "Trump Admin Reportedly Orders Dozens Of Ambassadors Home In Shakeup",
    "description": "President Donald Trump's administration reportedly ordered a number of career ambassadors to leave their overseas posts.",
    "link": "https://dailycaller.com/2025/12/22/trump-admin-recalls-ambassadors-africa-asia-europe-america-first-diplomacy/",
    "timestamp": "2025-12-22T17:55:12Z"
  },
  {
    "title": "In year-end offer, US triples payment to illegal aliens who sign up for self-deportation",
    "description": "The United States is offering to give illegal aliens $3,000 if they register for self-deportation on the CBP One app by the end of the year.",
    "link": "https://www.foxnews.com/politics/us-triples-payment-illegal-aliens-who-sign-up-self-deportation",
    "timestamp": "2025-12-22T17:54:11Z"
  },
  {
    "title": "Worried about health insurance costs? There may be cheaper options — but with trade-offs",
    "description": "Frustrated consumers may have to make sacrifices on coverage to get a price they can stomach. But cheaper alternatives come with risks.",
    "link": "https://www.bostonherald.com/2025/12/22/cheap-health-insurance/",
    "timestamp": "2025-12-22T17:53:42Z"
  },
  {
    "title": "Syria’s incomplete security transition has left gaps for Islamic State to exploit",
    "description": "The attack in Palmyra reveals deep vulnerabilities in Syria’s security architecture, highlighting the challenges of reforming a fragmented state after conflict.",
    "link": "https://theconversation.com/syrias-incomplete-security-transition-has-left-gaps-for-islamic-state-to-exploit-272302",
    "timestamp": "2025-12-22T17:53:25Z"
  },
  {
    "title": "Most US adults aren’t making year-end charitable contributions, new AP-NORC poll finds",
    "description": "Everyday donors faced competing priorities this year.",
    "link": "https://www.bostonherald.com/2025/12/22/ye-us-ap-poll-philanthropy/",
    "timestamp": "2025-12-22T17:50:27Z"
  },
  {
    "title": "Slog AM: Trump Blocks an Oil Tanker, MAGA Fractures at AmFest, and DC Had a Funeral for the Penny",
    "description": "The Stranger's morning news round-up.\n \n by Hannah Murphy Winter\n \n \n \n Good Morning! We did it. We survived the Longest Night. Today, the sun rose at 7:56 a.m., and we’ll get fractions of a minute back every day. We still have to get through the sneakiest pa…",
    "link": "https://www.thestranger.com/slog-am/2025/12/22/80384202/slog-am-trump-blocks-an-oil-tanker-maga-fractures-at-amfest-and-dc-had-a-funeral-for-the-penny",
    "timestamp": "2025-12-22T17:50:00Z"
  },
  {
    "title": "Bari Weiss's Counter-Journalistic Crusade Targets \"60 Minutes\"",
    "description": "Elizabeth Spiers\n\n\n\nThe new editor-in-chief at CBS News has shown she's not merely stupendously unqualified--she's ideologically opposed to the practice of good journalism.\r\n\n\r\n\n\nThe post Bari Weiss's Counter-Journalistic Crusade Targets \"60 Minutes\" appeared…",
    "link": "https://www.thenation.com/article/society/bari-weisss-60-minutes-cbs-skydance/",
    "timestamp": "2025-12-22T17:49:59Z"
  },
  {
    "title": "Carney taps business executive Mark Wiseman to serve as Canada's ambassador to the U.S.",
    "description": "Prime Minister Mark Carney has picked business executive Mark Wiseman to serve as Canada's ambassador to the U.S.",
    "link": "https://www.cbc.ca/news/world/carney-wiseman-ambassador-9.7025251",
    "timestamp": "2025-12-22T17:49:20Z"
  },
  {
    "title": "Vocal anti-Trump critic George Conway flips sides as he enters Congress race",
    "description": "George Conway, a vocal critic of President Donald Trump, has entered the crowded race for the seat Rep. Jerry Nadler (D-NY) is vacating in 2026, according to reports Monday. The conservative lawyer and co-founder of the Lincoln Project has filed as a Democrat…",
    "link": "https://www.rawstory.com/george-conway-trump-2674821942/",
    "timestamp": "2025-12-22T17:48:48Z"
  },
  {
    "title": "CBS News & Bari Weiss Dragged For Pulling ’60 Minutes’ Story On Infamous Venezuelan Prison CECOT",
    "description": "60 Minutes was set to broadcast a report featuring a group of Venezuelan men who thought they were being deported back to their countries, but instead were sent to CECOT. However, the story was pulled just two hours before it was set to air.",
    "link": "https://hiphopwired.com/2967598/cbs-news-bari-weiss-pulled-60-minutes-cecot-segment-reactions/",
    "timestamp": "2025-12-22T17:48:17Z"
  },
  {
    "title": "U.S. unveils plans for new ship under Trump’s ‘Golden Fleet’ bid",
    "description": "President Donald Trump’s \"Golden Fleet\" is a bid to revive US shipbuilding.",
    "link": "https://fortune.com/2025/12/22/us-unveils-plans-for-new-ship-under-trump-golden-fleet-bid/",
    "timestamp": "2025-12-22T17:46:46Z"
  },
  {
    "title": "Trump to make shipbuilding announcement as US looks to bolster Navy",
    "description": "WEST PALM BEACH: US President Donald Trump will make an announcement on shipbuilding later on Monday (Dec 22), the White House said, as Washington seeks to strengthen naval capacity amid growing concern over China’s rapidly expanding fleet.The announcement is…",
    "link": "https://www.channelnewsasia.com/world/trump-make-shipbuilding-announcement-us-looks-bolster-navy-5673366",
    "timestamp": "2025-12-22T17:45:00Z"
  },
  {
    "title": "CBS News Insider on Bari Weiss’ ‘60 Minutes’ Fumble: ‘Series of Unfortunate Events’ | Exclusive",
    "description": "Behind-the-scenes concerns about a lack of a voice from the Trump administration played out while the piece was already being promoted publicly\nThe post CBS News Insider on Bari Weiss’ ‘60 Minutes’ Fumble: ‘Series of Unfortunate Events’ | Exclusive appeared f…",
    "link": "https://www.thewrap.com/industry-news/business/cbs-news-insider-bari-weiss-fumble/",
    "timestamp": "2025-12-22T17:44:59Z"
  },
  {
    "title": "Trump Administration Pauses Construction on All Offshore Wind Projects in US",
    "description": "Trump’s Department of the Interior just halted construction on all five offshore wind projects underway in the United States. The pauses impact these projects: Vineyard Wind 1, Revolution Wind, Coastal Virginia Offshore Wind, Sunrise Wind and Empire Wind 1. I…",
    "link": "https://www.commondreams.org/newswire/trump-administration-pauses-construction-on-all-offshore-wind-projects-in-us",
    "timestamp": "2025-12-22T17:41:57Z"
  },
  {
    "title": "Senate adjourns without confirming CISA director",
    "description": "Sean Plankey’s nomination faltered as lawmakers ran out the clock after a tumultuous year of workforce reductions. The cyberdefense agency enters the new year without a permanent leader as the White House finalizes a sweeping national cyber strategy.",
    "link": "https://www.nextgov.com/cybersecurity/2025/12/senate-adjourns-without-confirming-cisa-director/410345/",
    "timestamp": "2025-12-22T17:41:00Z"
  },
  {
    "title": "Ukraine’s Zelensky says progress in US-led peace talks ‘quite solid’",
    "description": "Initial drafts of US proposals for a peace deal between Ukraine and Russia meet many of Kyiv's demands, Ukrainian President Volodymyr Zelensky has said.",
    "link": "https://www.independent.ie/world-news/europe/ukraines-zelensky-says-progress-in-us-led-peace-talks-quite-solid/a1032014102.html",
    "timestamp": "2025-12-22T17:40:35Z"
  },
  {
    "title": "George Conway to Run as a Democrat for Nadler's Manhattan Seat (Caitlin Reilly/Bloomberg)",
    "description": "Caitlin Reilly / Bloomberg:\nGeorge Conway to Run as a Democrat for Nadler's Manhattan Seat  —  George Conway, a prominent critic of President Donald Trump, filed to run for the House of Representatives to replace retiring Representative Jerry Nadler in a New …",
    "link": "https://www.memeorandum.com/251222/p59",
    "timestamp": "2025-12-22T17:40:01Z"
  },
  {
    "title": "Epstein Files: Schumer to force Senate vote on suing DOJ over partial release",
    "description": "Senate Minority Leader Chuck Schumer, a New York Democrat will force a vote on suing the Trump administration for a full release of the Jeffrey Epstein files.",
    "link": "https://www.cnbc.com/2025/12/22/epstein-files-doj-schumer-trump-democrats.html",
    "timestamp": "2025-12-22T17:39:26Z"
  },
  {
    "title": "Oil Prices Surge 2% on Venezuela, Russia Disruption Fears",
    "description": "Oil prices jumped in early Monday trading after the U.S. intercepted a third oil tanker off the coast of Venezuela. U.S. President Donald Trump has announced a \"total and complete\" blockade of sanctioned Venezuelan oil tankers, while Ukraine has launched a dr…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Surge-2-on-Venezuela-Russia-Disruption-Fears.html",
    "timestamp": "2025-12-22T17:35:00Z"
  },
  {
    "title": "Trump Names Louisiana Gov. Jeff Landry Special Envoy to Greenland",
    "description": "President Donald Trump has appointed Louisiana Gov. Jeff Landry the United States Special Envoy to Greenland.\nThe post Trump Names Louisiana Gov. Jeff Landry Special Envoy to Greenland appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/22/trump-names-louisiana-gov-jeff-landry-special-envoy-greenland/",
    "timestamp": "2025-12-22T17:33:36Z"
  },
  {
    "title": "DOJ Temporarily Deletes Trump Photo From Epstein Files, Ensuring Everyone Knew About The Deletion",
    "description": "Imagine having all the power but none of the brains. That’s the current administration, the one that behaves like a blind, enraged bull set loose in its own china shop. “We can always get more china,” says the administration, shortly before realizing it reall…",
    "link": "https://www.techdirt.com/2025/12/22/doj-temporarily-deletes-trump-photo-from-epstein-files-ensuring-everyone-knew-about-the-deletion/",
    "timestamp": "2025-12-22T17:33:29Z"
  },
  {
    "title": "Justice Department Ends Clinton Rule Giving Welfare to Migrants",
    "description": "The Department of Justice is closing a Democrat-created bureaucratic loophole that has allowed legal and illegal migrants to get a huge quantity of taxpayer aid since 1997, despite a 1996 law limiting aid to citizens. The loophole was created by President Bil…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358566/posts",
    "timestamp": "2025-12-22T17:33:22Z"
  },
  {
    "title": "Turning Point USA held its AmericaFest conference. Here’s what happened",
    "description": "Turning Point USA's first AmericaFest without Charlie Kirk reveals ideological rifts within the conservative movement.",
    "link": "https://www.aljazeera.com/news/2025/12/22/turning-point-usa-held-its-americafest-conference-heres-what-happened",
    "timestamp": "2025-12-22T17:32:46Z"
  },
  {
    "title": "Dem Rep. Crow: I Would Support Contempt Proceedings Against AG Bondi",
    "description": "Monday on MS NOW's \"Ana Cabrera Reports,\" Rep. Jason Crow (D-CO) said he would support contempt proceedings against Attorney General Pam Bondi.\nThe post Dem Rep. Crow: I Would Support Contempt Proceedings Against AG Bondi appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/12/22/dem-rep-crow-i-would-support-contempt-proceedings-against-ag-bondi/",
    "timestamp": "2025-12-22T17:31:32Z"
  },
  {
    "title": "U.S. Pursuit of Third Oil Tanker Deepens Venezuela Blockade",
    "description": "The US Coast Guard’s pursuit of a third oil tanker off the coast of Venezuela has intensified a blockade that the Trump administration hopes will cut off a vital economic lifeline and isolate the government of President Nicolás Maduro.",
    "link": "https://gcaptain.com/u-s-pursuit-of-third-oil-tanker-deepens-venezuela-blockade/",
    "timestamp": "2025-12-22T17:30:55Z"
  },
  {
    "title": "President unveils new ‘Trump class’ fleet of battleships | CNN Politics",
    "description": "President Donald Trump announced a new “Trump class” of Navy battleships Monday, describing them as a superior war fighting vessel to replace an “old and tired and obsolete” US fleet.",
    "link": "https://www.cnn.com/2025/12/22/politics/trump-shipbuilding-venezuela-tensions",
    "timestamp": "2025-12-22T17:29:00Z"
  },
  {
    "title": "Bill Maher Says Larry David No Longer His Friend After Feud Over Trump Dinner",
    "description": "Comedian Bill Maher asserted that his friendship with “Curb Your Enthusiasm” creator Larry David was over during an interview with The Free Press.",
    "link": "https://dailycaller.com/2025/12/22/bill-maher-says-larry-david-no-longer-his-friend-after-feud-over-trump-dinner/",
    "timestamp": "2025-12-22T17:28:41Z"
  },
  {
    "title": "Trans Muslim killer tries to skip sentencing for executing parents — then makes excuse for murdering them",
    "description": "A trans woman who copped to slaughtering her parents tried to skip out on her sentencing in a Utah court because it would be too tough on her — as she revealed that she has converted to Islam, and made an excuse for the cold-blooded murders on Friday. “If onl…",
    "link": "https://freerepublic.com/focus/f-news/4358565/posts",
    "timestamp": "2025-12-22T17:28:00Z"
  },
  {
    "title": "Trump-Endorsed Health Care Plan Suffers Major Blow - NewsBreak",
    "description": "President Donald Trump endorsed a GOP plan to address rising healthcare costs by providing one-time Health Savings Account (HSA) deposits for certain Affor",
    "link": "https://www.newsbreak.com/share/4408470327986-trump-endorsed-health-care-plan-suffers-major-blow?_f=app_share&amp;pd=05OaPdkt&amp;lang=en_US&amp;send_time=1766424371&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.51.0.54%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-22T17:27:42Z"
  },
  {
    "title": "‘60 Minutes’ correspondent says CBS pulled segment for political reasons | Honolulu Star-Advertiser",
    "description": "In a move that drew harsh criticism from its own correspondent, CBS News abruptly removed a segment from Sunday’s episode of “60 Minutes” that was to feature the stories of Venezuelan men deported by the Trump administration to what the program called a “brut…",
    "link": "https://www.staradvertiser.com/2025/12/22/breaking-news/60-minutes-correspondent-says-cbs-pulled-segment-for-political-reasons/",
    "timestamp": "2025-12-22T17:26:24Z"
  },
  {
    "title": "‘You Cannot Annex Other Countries’: Greenland, Denmark Furious at Trump Special Envoy Appointment",
    "description": "The leaders of Denmark and Greenland have rejected President Donald Trump's plans to take control of the latter country \"very clearly before,\" said Danish Prime Minister Mette Frederiksen and Greenlandic Premier Jens-Frederik Nielsen on Monday, but they were …",
    "link": "https://www.commondreams.org/news/greenland-pm-responds-to-trump-threats",
    "timestamp": "2025-12-22T17:25:24Z"
  },
  {
    "title": "‘Ben Shapiro Is Not the Magic Jew’: Liberal Podcaster Says MAGA Will ‘Not Take Down Their Swastikas’",
    "description": "Angie \"Pumps\" Sullivan argued Ben Shapiro is not going to going to find much support among by going after Candace Owens and other conspiracy theorists\nThe post ‘Ben Shapiro Is Not the Magic Jew’: Liberal Podcaster Says MAGA Will ‘Not Take Down Their Swastikas…",
    "link": "https://www.mediaite.com/media/ben-shapiro-is-not-the-magic-jew-liberal-podcaster-says-maga-will-not-take-down-their-swastikas/",
    "timestamp": "2025-12-22T17:24:26Z"
  },
  {
    "title": "Creepy Cargo Caught By Customs Officials In Chicago",
    "description": "A post from Customs and Border Protection featuring a snarling, dried primate corpse removed from a traveler’s luggage has sparked renewed scrutiny over illegal bushmeat smuggling into major U.S. airports. U.S. Customs and Border Protection officials in Chica…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358563/posts",
    "timestamp": "2025-12-22T17:24:07Z"
  },
  {
    "title": "Trump angers Greenland again, appoints special envoy who says he’ll make it part of the US",
    "description": "Donald Trump has caused new tension by naming a special envoy for Greenland. The move has upset Denmark and raised strong reactions in Greenland. Trump says the island is important for US security and resources. Greenland’s leaders say the people will decide …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-angers-greenland-again-appoints-special-envoy-who-says-hell-make-it-part-of-the-us/articleshow/126125644.cms",
    "timestamp": "2025-12-22T17:23:45Z"
  },
  {
    "title": "Exclusive-US conducting surveillance flights over Nigeria after Trump intervention threat",
    "description": "Dec 22 (Reuters) - The U.S. has been conducting intelligence-gathering ‌flights over large parts of Nigeria since late November, according to flight tracking data and current and former U.S. officials, in a sign of increased security cooperation between the c…",
    "link": "https://www.thestar.com.my/news/world/2025/12/23/exclusive-us-conducting-surveillance-flights-over-nigeria-after-trump-intervention-threat",
    "timestamp": "2025-12-22T17:22:00Z"
  },
  {
    "title": "RFK Jr. Tried to Wreck the Childhood Vaccine Schedule Over the Weekend",
    "description": "HHS officials reportedly feared the abrupt change would incur a successful lawsuit.",
    "link": "https://gizmodo.com/rfk-jr-tried-to-wreck-the-childhood-vaccine-schedule-over-the-weekend-2000702477",
    "timestamp": "2025-12-22T17:20:17Z"
  },
  {
    "title": "Top Viral Social Media Moments Of 2025, From Louvre Heist To ‘Summer I Turned Pretty’ Memes, ‘Marty Supreme’ Orange & Rachel Zegler’s ‘Evita’",
    "description": "Social media is the gift that keeps on giving when it comes to entertainment, humor, and (unfortunately for some) embarrassing moments. This year’s social media phenomena spanned film, TV, theater and music, ranging from the Louvre heist, a plethora of The Su…",
    "link": "http://deadline.com/2025/12/2025-most-viral-social-media-moments-1236652366/",
    "timestamp": "2025-12-22T17:20:09Z"
  },
  {
    "title": "DOJ Official in Charge of Crypto Investigations Was Invested in Crypto Himself",
    "description": "Todd Blanche's actions violated the federal conflicts of interest law and his ethics agreement, experts said.",
    "link": "https://www.propublica.org/article/todd-blanche-crypto-doj-trump",
    "timestamp": "2025-12-22T17:19:02Z"
  },
  {
    "title": "Some Weird Sh*t At Princess Griftsalot’s TPUSA Griefstravaganza, Fireworks Expo And White Grievance Hoedown",
    "description": "Nicki Minaj! A death-recreation tent! That place had everything!",
    "link": "https://www.wonkette.com/p/some-weird-sht-at-princess-griftsalots",
    "timestamp": "2025-12-22T17:17:58Z"
  },
  {
    "title": "Pro-Trump Billionaire Larry Ellison Puts $40,000,000,000 On Line In Battle With Netflix",
    "description": "Larry Ellison has agreed to personally guarantee $40.4 billion in financing for Paramount’s hostile bid for Warner Bros. Discovery.",
    "link": "https://dailycaller.com/2025/12/22/larry-ellison-paramount-warner-bros-netflix/",
    "timestamp": "2025-12-22T17:17:58Z"
  },
  {
    "title": "‘Morning Joe’ Slams CBS News for Pulling ‘60 Minutes’ Megaprison Segment: ‘Not Good at All’ | Video",
    "description": "\"They promote it and then they spike it the night of,\" MS NOW host Joe Scarborough notes\nThe post ‘Morning Joe’ Slams CBS News for Pulling ‘60 Minutes’ Megaprison Segment: ‘Not Good at All’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/journalism/morning-joe-cbs-news-60-minutes-segment-pulled-response/",
    "timestamp": "2025-12-22T17:16:22Z"
  },
  {
    "title": "Why Warner Bros. Discovery shareholders might opt for Paramount's offer — and why they might not",
    "description": "WBD shareholders must weigh pros and cons of tendering their shares to Paramount for $30 per share. CNBC lays out the arguments on both sides.",
    "link": "https://www.cnbc.com/2025/12/22/paramount-wbd-tender-offer-arguments.html",
    "timestamp": "2025-12-22T17:16:16Z"
  },
  {
    "title": "George Conway files paperwork to run for Congress as a Democrat",
    "description": "George Conway, the former conservative lawyer turned ardent critic of President Donald Trump, has filed paperwork to run for Congress in New York City as a Democrat, a source close to Conway confirmed",
    "link": "https://www.nbcnews.com/politics/elections/george-conway-files-paperwork-run-congress-democrat-rcna250482",
    "timestamp": "2025-12-22T17:15:14Z"
  },
  {
    "title": "Nicki Minaj surprises conservatives with praise for Trump, Vance at Arizona event",
    "description": "The rapper called the president and vice president 'role models' for young men.",
    "link": "https://www.bostonherald.com/2025/12/22/nicki-minaj-trump-vance-turning-point/",
    "timestamp": "2025-12-22T17:12:55Z"
  },
  {
    "title": "Retired prosecutor files lawsuit against New York City over Skadden Arps protest",
    "description": "A retired prosecutor filed a lawsuit last week in federal court against New York City and Brookfield Properties alleging that he was wrongfully arrested while protesting in a public space against Skadden, Arps, Slate, Meagher & Flom.",
    "link": "https://www.abajournal.com/news/article/retired-prosecutor-files-lawsuit-against-new-york-city-over-skadden-arps-protest",
    "timestamp": "2025-12-22T17:12:00Z"
  },
  {
    "title": "'Awkward': GOP candidate reacts to being Trump's second choice for NY governor",
    "description": "Nassau County Executive Bruce Blakeman addressed whether it was \"awkward\" after President Donald Trump endorsed him as his second choice for New York governor.During a Monday press conference, Blakeman expressed \"respect\" for Rep. Elise Stefanik (R-NY) after …",
    "link": "https://www.rawstory.com/trump-endorsement-2674821876/",
    "timestamp": "2025-12-22T17:11:52Z"
  },
  {
    "title": "As Americans scale back on charitable giving, this Texas architect shares his unusual ‘shotgun approach’",
    "description": "Struggling Americans are giving less in this economy, but nonprofits rely on donations.",
    "link": "https://fortune.com/2025/12/22/americans-scale-back-charitable-donations-texas-architect-shotgun-approach/",
    "timestamp": "2025-12-22T17:11:28Z"
  },
  {
    "title": "CBS pulls ‘60 Minutes’ report on Trump deportees",
    "description": "An investigation into the deportations of Venezuelan migrants to El Salvador’s notorious prison was scrapped",
    "link": "https://theweek.com/politics/60-minutes-trump-bari-weiss",
    "timestamp": "2025-12-22T17:10:46Z"
  },
  {
    "title": "Bari Weiss spiked a major migrant story — and told on herself",
    "description": "Weiss' catch-and-kill puts her editorial incompetence at CBS News on public view",
    "link": "https://www.salon.com/2025/12/22/bari-weiss-spiked-a-major-migrant-story-and-told-on-herself/",
    "timestamp": "2025-12-22T17:10:02Z"
  },
  {
    "title": "The Trump administration pauses wind projects off New England, New York and Virginia",
    "description": "An Interior Department statement did not detail the national security risks. It's the administration's latest pus to hobble offshore wind and limit renewable energy sources.",
    "link": "https://www.npr.org/2025/12/22/g-s1-103320/offshore-wind-power-pause-trump-administration-new-england-new-york-virginia-national-security",
    "timestamp": "2025-12-22T17:09:42Z"
  },
  {
    "title": "Trump Worse than Islamic Jihadists [semi-satire]",
    "description": "In an interview with host Leland Vittert on NewsNation, Rep. Debbie Wasserman Schultz (D-Fla) claimed that \"President Trump is a bigger threat to American values than Islamic terrorists. The scope of the massacres and atrocities of these terrorists is more li…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358560/posts",
    "timestamp": "2025-12-22T17:09:32Z"
  },
  {
    "title": "Bernie Sanders Reportedly Set to Swear In Fellow Democratic Socialist Zohran Mamdani",
    "description": "Bernie Sanders is reportedly set to swear-in democratic socialist Zohran Mamdani (D) when the 34-year-old officially becomes New York City's mayor on Jan. 1.\nThe post Bernie Sanders Reportedly Set to Swear In Fellow Democratic Socialist Zohran Mamdani first a…",
    "link": "https://www.mediaite.com/media/news/bernie-sanders-reportedly-set-to-swear-in-fellow-democratic-socialist-zohran-mamdani/",
    "timestamp": "2025-12-22T17:07:54Z"
  },
  {
    "title": "Ticker: CBS News Announces Tour for Launch of CBS Evening News With Tony Dokoupil",
    "description": "Dokoupil will visit 10 cities over 10 days.",
    "link": "https://www.adweek.com/tvnewser/ticker-cbs-news-announces-tour-for-launch-of-cbs-evening-news-with-tony-dokoupil/",
    "timestamp": "2025-12-22T17:06:22Z"
  },
  {
    "title": "Document Removal, Missing Files Fuel Speculation of Epstein “Cover-Up”",
    "description": "“What are they protecting? The cover-up continues,\" said Epstein survivor Jess Michaels.",
    "link": "https://truthout.org/articles/document-removal-missing-files-fuel-speculation-of-epstein-cover-up/",
    "timestamp": "2025-12-22T17:06:02Z"
  },
  {
    "title": "The 5 at 5: Monday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-today-the-journal-6911134-Dec2025/",
    "timestamp": "2025-12-22T17:06:00Z"
  },
  {
    "title": "'Midst of a coverup': Trump accused of building web of lies so complex aides keep tripping",
    "description": "The Trump administration has crashed out over the newly released Jeffrey Epstein files — and can no longer keep its stories straight, according to reports Monday. The Bulwark's Editor at Large William Kristol described why materials related to the deceased pe…",
    "link": "https://www.rawstory.com/trump-administration-epstein-files/",
    "timestamp": "2025-12-22T17:04:46Z"
  },
  {
    "title": "Space stocks rocket higher as sector optimism gains steam into 2026",
    "description": "Space stocks have rallied in recent weeks following news that Musk's SpaceX is planning to go public next year and widespread government interest.",
    "link": "https://www.cnbc.com/2025/12/22/firefly-rocket-lab-intuitive-machines-stock.html",
    "timestamp": "2025-12-22T17:02:39Z"
  },
  {
    "title": "Former Madera County Welfare Benefits Employee Arrested for Improperly Using Other People’s Identities to Steal Benefits",
    "description": "Former Madera County benefits eligibility worker Leticia Mariscal, 55, of Madera, was arrested today on charges that she stole tens of thousands of dollars’ worth of other people’s CalFresh benefits during a multiyear scheme, U.S. Attorney Eric Grant announce…",
    "link": "https://freerepublic.com/focus/f-news/4358557/posts",
    "timestamp": "2025-12-22T17:02:07Z"
  },
  {
    "title": "'Eat shit': Vance hits out at Fuentes over racial slurs hurled at wife...",
    "description": "Vice President JD Vance finally lashed out at critics of his wife in a furious tirade, saying they can “eat s--t.” Vance’s response comes months after the...",
    "link": "https://www.thedailybeast.com/jd-vance-loses-it-over-racist-attacks-on-wife-eat-st/",
    "timestamp": "2025-12-22T17:00:15Z"
  },
  {
    "title": "Bari Weiss Pulls 60 Minutes Segment on El Salvador CECOT Prison Because It Wasn’t Ready",
    "description": "\"My job is to make sure that all stories we publish are the best they can be. Holding stories that aren’t ready for whatever reason — that they lack sufficient context, say, or that they are missing critical voices — happens every day in every newsroom.\"\nThe …",
    "link": "https://legalinsurrection.com/2025/12/bari-weiss-pulls-60-minutes-segment-on-el-salvador-cecot-prison-because-it-wasnt-ready/",
    "timestamp": "2025-12-22T17:00:03Z"
  },
  {
    "title": "Here We Go! This Is Why China Will Be EXTREMELY Upset If A U.S. Blockade Stops The Flow Of Oil Coming Out Of Venezuela",
    "description": "The seizure of a Venezuelan oil tanker was an extraordinarily shocking move by the Trump administration.  Will it be followed by the seizure of more oil tankers?  This is a question that the press really needs to be asking right now.  If a U.S. blockade stops…",
    "link": "https://www.activistpost.com/here-we-go-this-is-why-china-will-be-extremely-upset-if-a-u-s-blockade-stops-the-flow-of-oil-coming-out-of-venezuela/",
    "timestamp": "2025-12-22T17:00:00Z"
  },
  {
    "title": "Russia Downplays Peace Prospects as Talks With U.S. and Ukraine Conclude",
    "description": "The Kremlin maintained its hard line on a Ukraine peace deal, rejecting undisclosed changes proposed by Kyiv and its European allies, as separate US-Russia and US-Ukraine talks wrapped up in Florida. The remarks on December 21 came on the same day that Ukrain…",
    "link": "https://oilprice.com/Geopolitics/Europe/Russia-Downplays-Peace-Prospects-as-Talks-With-US-and-Ukraine-Conclude.html",
    "timestamp": "2025-12-22T17:00:00Z"
  },
  {
    "title": "NSA employee sues Trump administration over order on transgender rights and two 'immutable' genders",
    "description": "A transgender employee of the National Security Agency is suing the Trump administration and seeking to block enforcement of a presidential executive order...",
    "link": "https://www.yahoo.com/news/articles/nsa-employee-sues-trump-administration-165847687.html",
    "timestamp": "2025-12-22T16:58:47Z"
  },
  {
    "title": "EXCLUSIVE: Prince Harry Under Fire For Going to War With Donald Trump — For One Potentially Devastating Reason",
    "description": "Prince Harry has once again found himself under fire for taking aim at Donald Trump, which could put him at risk of serious consequences.",
    "link": "https://radaronline.com/p/prince-harry-slammed-going-to-war-with-donald-trump-visa/",
    "timestamp": "2025-12-22T16:56:09Z"
  },
  {
    "title": "US freezes five offshore wind projects, shares slide on security concerns",
    "description": "WASHINGTON: The United States on Monday (Dec 22) froze leases for five large offshore wind projects under construction off the East Coast, citing national security concerns, a move that sent sha",
    "link": "https://www.channelnewsasia.com/world/us-freezes-five-offshore-wind-projects-shares-slide-security-concerns-5673286",
    "timestamp": "2025-12-22T16:54:00Z"
  },
  {
    "title": "Never Trumper George Conway Seeks Democratic Nomination for Manhattan Congressional Seat",
    "description": "Conway will seek election in New York’s 12th Congressional District, the reliably blue Manhattan seat currently held by outgoing Rep. Jerrold Nadler (D-NY).\nThe post Never Trumper George Conway Seeks Democratic Nomination for Manhattan Congressional Seat firs…",
    "link": "https://www.mediaite.com/media/news/never-trumper-george-conway-seeks-democratic-nomination-for-manhattan-congressional-seat/",
    "timestamp": "2025-12-22T16:53:59Z"
  },
  {
    "title": "Trump administration posts sliver of Epstein files",
    "description": "Many of the Justice Department documents were heavily redacted, though new photos of both Donald Trump and Bill Clinton emerged",
    "link": "https://theweek.com/politics/epstein-files-trump-administration",
    "timestamp": "2025-12-22T16:53:26Z"
  },
  {
    "title": "Trump, Netanyahu expected to decide next steps in Gaza ceasefire",
    "description": "Arab media reports say an upcoming meeting between President Trump and Prime Minister Netanyahu is expected to determine next steps in the second phase of the Gaza ceasefire agreement.",
    "link": "https://www.israelnationalnews.com/news/419747",
    "timestamp": "2025-12-22T16:46:14Z"
  },
  {
    "title": "Texas Lawmakers Fight Against Federal Interference in State AI Regulations",
    "description": "An executive order by President Donald Trump may bring Texas into conflict with the federal government over a new state law regulating the use of artificial intelligence. Trump signed an executive order last week that threatens to cut off federal …",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/12/22/852001.htm",
    "timestamp": "2025-12-22T16:45:36Z"
  },
  {
    "title": "How Trump Shaped 2025",
    "description": "FP Live looks back at the year’s geopolitical twists and turns.",
    "link": "http://foreignpolicy.com/2025/12/22/how-trump-shaped-2025-security-tariffs-ukraine-venezuela-middle-east/",
    "timestamp": "2025-12-22T16:44:13Z"
  },
  {
    "title": "How Trump Shaped 2025",
    "description": "FP Live looks back at the year’s geopolitical twists and turns.",
    "link": "http://foreignpolicy.com/2025/12/22/how-trump-shaped-2025/",
    "timestamp": "2025-12-22T16:44:13Z"
  },
  {
    "title": "Noem says Trump administration has located 127K missing migrant children lost under Biden",
    "description": "DHS Secretary Kristi Noem announces progress in child recovery mission, finding more than 127,000 unaccompanied migrant children amid concerns over trafficking and exploitation.",
    "link": "https://www.foxnews.com/media/dhs-secretary-noem-says-trump-administration-has-located-127k-missing-migrant-children-lost-under-biden",
    "timestamp": "2025-12-22T16:43:22Z"
  },
  {
    "title": "‘No More Military Aid for Netanyahu,’ Says Sanders as Israel Ramps Up West Bank Takeover",
    "description": "As Israeli settlers escalate attacks on Palestinians in the West Bank as part of a furious state-backed annexation push, US Sen. Bernie Sanders said it was yet another reason to suspend military aid to the government of Prime Minister Benjamin Netanyahu.\"It’s…",
    "link": "https://www.commondreams.org/news/bernie-settler-violence-military-aid",
    "timestamp": "2025-12-22T16:43:03Z"
  },
  {
    "title": "DOJ faces continued backlash over limited Epstein files release",
    "description": "The Justice Department is facing continued backlash over its partial releases of the Epstein files, with lawmakers and survivors denouncing the limited nature of the disclosures.",
    "link": "https://www.cbsnews.com/news/epstein-files-release-justice-department-backlash/",
    "timestamp": "2025-12-22T16:38:41Z"
  },
  {
    "title": "Trump Administration Halts Offshore Wind Farms, Citing National Security",
    "description": "President Donald Trump's Department of the Interior announced Monday that it is pausing leases for 5 large-scale offshore wind projects off the East Coast.\nThe post Trump Administration Halts Offshore Wind Farms, Citing National Security appeared first on Bre…",
    "link": "https://www.breitbart.com/environment/2025/12/22/trump-administration-halts-offshore-wind-farms-citing-national-security/",
    "timestamp": "2025-12-22T16:38:28Z"
  },
  {
    "title": "Islamophobic Elites Lied to Destroy the Life of a Palestinian Brown Student",
    "description": "Jeet Heer\n\n\n\nPlutocrats, pundits, and government officials joined together in a racist smear campaign against a queer Palestinian student at Brown University.\r\n\n\r\n\n\nThe post Islamophobic Elites Lied to Destroy the Life of a Palestinian Brown Student appeared …",
    "link": "https://www.thenation.com/article/politics/islamophobia-brown-school-shooting/",
    "timestamp": "2025-12-22T16:37:33Z"
  },
  {
    "title": "‘Israel is only the appetizer’: Huckabee warns Iran threat looms as Netanyahu eyes Trump talks",
    "description": "Israeli Prime Minister Benjamin Netanyahu seeks meeting with President Donald Trump as officials warn Iranian missile drills could cover surprise attack plans.",
    "link": "https://www.foxnews.com/world/israel-only-appetizer-huckabee-warns-iran-threat-looms-netanyahu-eyes-trump-talks",
    "timestamp": "2025-12-22T16:35:34Z"
  },
  {
    "title": "Bus Driver Fired Over Sign Requesting Students Converse In English Speaks Out",
    "description": "A Pennsylvania school bus driver who was fired over a sign requesting students speak English broke her silence, telling a CBS affiliate her side of the story.",
    "link": "https://dailycaller.com/2025/12/22/bus-driver-fired-over-sign-requesting-students-speak-english-speaks-out/",
    "timestamp": "2025-12-22T16:34:05Z"
  },
  {
    "title": "CNBC’s Joe Kernen Pushes GOP Senator on Trump Admin ‘Slipping’ Toward Socialism With Economic Policy",
    "description": "CNBC's Joe Kernen on Monday suggested that the Trump administration was in the midst of a \"socialist\" creep\" with its approach to the economy.\nThe post CNBC’s Joe Kernen Pushes GOP Senator on Trump Admin ‘Slipping’ Toward Socialism With Economic Policy first …",
    "link": "https://www.mediaite.com/politics/cnbcs-joe-kernen-pushes-gop-senator-on-trump-admin-slipping-toward-socialism-with-economic-policy/",
    "timestamp": "2025-12-22T16:32:31Z"
  },
  {
    "title": "JD Vance turns Turning Point speech into midterm battle cry — and a preview of 2028",
    "description": "JD Vance predicts Republicans will soundly defeat Democrats in next year's midterm elections, in a speech at major conservative summit, sparking enthusiastic USA chants from the crowd.",
    "link": "https://www.foxnews.com/politics/jd-vance-turns-turning-point-speech-midterm-battle-cry-preview-2028",
    "timestamp": "2025-12-22T16:31:10Z"
  },
  {
    "title": "No proof Trump paid millions in settlements over allegations of sexually assaulting minors",
    "description": "The claim is unsupported by any credible evidence and rests entirely on an unverified list from a blog.",
    "link": "https://www.snopes.com//news/2025/12/22/trump-settlements-minors/",
    "timestamp": "2025-12-22T16:31:00Z"
  },
  {
    "title": "When in Doubt, Pretend to Be Lina Khan",
    "description": "The Trump administration’s plans to lower prices are just Biden-era retreads. Unfortunately, they’re just plans, with no expected follow-through.\nThe post When in Doubt, Pretend to Be Lina Khan appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/12/22/when-in-doubt-pretend-to-be-lina-khan-trump-drug-pricing-ftc/",
    "timestamp": "2025-12-22T16:30:00Z"
  },
  {
    "title": "Antifa Everywhere",
    "description": "As Trump revives the war on terror against domestic opposition, what does antifascism mean?",
    "link": "https://inthesetimes.com/article/antifa-everywhere-war-on-terror-cve-material-support-laws-hlf5-terrorism",
    "timestamp": "2025-12-22T16:30:00Z"
  },
  {
    "title": "Plan your time off now: Full list of Federal Holidays in 2026 — who gets which days off",
    "description": "Federal holidays list 2026: Federal holidays in 2026 bring clarity and new Christmas rules. OPM confirms eleven federal holidays with several long weekends. Independence Day shifts to Friday, July 3. Trump’s Christmas Eve and Dec. 26 law complicates schedulin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-federal-holidays-in-2026-plan-your-time-off-now-full-list-of-federal-holidays-in-2026-who-gets-which-days-off/articleshow/126124778.cms",
    "timestamp": "2025-12-22T16:29:28Z"
  },
  {
    "title": "'Threat to Media and Democracy': Trump Ally Larry Ellison Puts Up $40 Billion to Help Son Buy CNN Owner",
    "description": "Oracle co-founder Larry Ellison, an ally of US President Donald Trump and one of the richest men in the world, pledged on Monday to provide $40.4 billion to help finance his son's hostile bid to acquire Warner Bros. Discovery, the owner of CNN, HBO Max, and o…",
    "link": "https://www.commondreams.org/news/larry-ellison-warner-bros",
    "timestamp": "2025-12-22T16:28:46Z"
  },
  {
    "title": "Coinbase doubles down on prediction markets with deal for The Clearing Company",
    "description": "Dec 22 : Coinbase ‌said on Monday it will buy prediction markets startup The Clearing Company, as the crypto exchange looks to expand beyond its core digital assets business.Prediction markets let users buy and sell contracts tied to the outcomes of real-worl…",
    "link": "https://www.channelnewsasia.com/business/coinbase-doubles-down-prediction-markets-deal-clearing-company-5673231",
    "timestamp": "2025-12-22T16:28:25Z"
  },
  {
    "title": "Facing Backlash and FTC Probe, Instacart Ends Pricing Experiments In Wake of Groundwork Report",
    "description": "This morning, Instacart announced it will end its use of AI-powered pricing experiments on consumers. The announcement follows the release of a bombshell report from Groundwork Collaborative, Consumer Reports, and More Perfect Union revealing Instacart chargi…",
    "link": "https://www.commondreams.org/newswire/facing-backlash-and-ftc-probe-instacart-ends-pricing-experiments-in-wake-of-groundwork-report",
    "timestamp": "2025-12-22T16:27:42Z"
  },
  {
    "title": "“Bari Weiss spiked our story”: CBS yanks “60 Minutes” segment on Trump deportees at the last minute",
    "description": "One correspondent said the decision was \"political\"",
    "link": "https://www.salon.com/2025/12/22/bari-weiss-spiked-our-story-cbs-yanks-60-minutes-segment-on-trump-deportees-at-the-last-minute/",
    "timestamp": "2025-12-22T16:27:09Z"
  },
  {
    "title": "Russia pledges 'full support' for Venezuela against US 'hostilities'",
    "description": "Russia on Monday expressed \"full support\" for Venezuela as the South American country confronts a blockade of sanctioned oil tankers by US forces deployed in the Caribbean, the two governments said. US President Donald Trump on December 16 announced a blockad…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-pledges-full-support-for-venezuela-against-us-hostilities/articleshow/126125139.cms",
    "timestamp": "2025-12-22T16:26:19Z"
  },
  {
    "title": "Bari Weiss tells staff '60 Minutes' CECOT story wasn't ready, says disrespect among colleagues is unacceptable",
    "description": "CBS News Editor-in-Chief Bari Weiss defended her decision to delay a \"60 Minutes\" CECOT segment in remarks to staffers, saying it wasn't ready and didn't advance the story.",
    "link": "https://www.foxnews.com/media/bari-weiss-tells-staff-60-minutes-cecot-story-wasnt-ready-says-disrespect-among-colleagues-unacceptable",
    "timestamp": "2025-12-22T16:26:13Z"
  },
  {
    "title": "Oil Climbs as US Pursues Third Tanker in Venezuela Blockade",
    "description": "Oil advanced as President Donald Trump intensified a blockade on Venezuela, with US forces boarding one tanker and pursuing another within weeks of capturing a vessel.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-climbs-as-us-pursues-third-tanker-in-venezuela-blockade",
    "timestamp": "2025-12-22T16:25:49Z"
  },
  {
    "title": "RFK Jr. Announces New Rules Targeting Care for Transgender Youth",
    "description": "If approved, the proposed federal regulations would dramatically impact an already challenging landscape.",
    "link": "https://www.teenvogue.com/story/rfk-jr-announces-new-rules-targeting-care-for-transgender-youth",
    "timestamp": "2025-12-22T16:24:36Z"
  },
  {
    "title": "'Totally unacceptable': Trump’s latest Greenland escalation sparks outrage",
    "description": "President Donald Trump has not abandoned his efforts to acquire Greenland — indeed, he is pressing ahead. On Sunday night, the president named Louisiana Republican Governor Jeff Landry, a Trump ally, as a special envoy to the autonomous territory within the K…",
    "link": "https://www.rawstory.com/alternet-posts/trump-greenland/",
    "timestamp": "2025-12-22T16:22:21Z"
  },
  {
    "title": "Top Economist Warns Unemployment, Not Stock Prices, Is True Measure Of Economic Health: 'Close To Zero Jobs' Created Since Tariffs Were Introduced",
    "description": "Top Economist Warns Unemployment, Not Stock Prices, Is True Measure Of Economic Health: 'Close To Zero Jobs' Created Since Tariffs Were Introducednewsbreak.com",
    "link": "https://www.newsbreak.com/share/4408230894743-top-economist-warns-unemployment-not-stock-prices-is-true-measure-of-economic-health-close-to-zero-jobs-created-since-tariffs-were-introduced?s=a2&amp;share_destination_id=MjA1NzA1NjMwLTE3NjY0MjAzNTM4MjU%3D&amp;pd=0Dv7Qk5V&amp;hl=en_US&amp;send_time=1766420353&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.45.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-22T16:19:44Z"
  }
]