[
  {
    "title": "India, Pakistan Ties Deteriorate Following Kashmir Militant Attack",
    "description": "The United Nations urged the two countries to “exercise maximum restraint” as tensions escalate.",
    "link": "http://foreignpolicy.com/2025/04/25/kashmir-attack-india-pakistan-indus-waters-treaty/",
    "timestamp": "2025-04-25T20:40:29Z"
  },
  {
    "title": "Conflicting US-China talks statements add to global trade confusion",
    "description": "US President Donald Trump asserted in an interview published Friday (Apr 25) that tariff negotiations were underway with China, but Beijing denied any talks were taking place, the latest in a series of conflicting signals over what progress was being made to …",
    "link": "https://www.channelnewsasia.com/world/conflicting-us-china-talks-statements-add-global-trade-confusion-5090381",
    "timestamp": "2025-04-25T20:40:13Z"
  },
  {
    "title": "James Carville should take his own advice",
    "description": "What? Democratic strategist and pundit James Carville admonished Sen. Bernie Sanders (I-Vt.), Rep. Alexandria Ocasio-Cortez (D-N.Y.) and other progressives who have argued the Democratic Party needs radical change in order to beat Republicans in coming electi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/james-carville-should-take-his-own-advice",
    "timestamp": "2025-04-25T20:40:08Z"
  },
  {
    "title": "Ukraine has exposed Trump's true identity: as a vandal, an autocrat, a gangster and a fool (Jonathan Freedland/The Guardian)",
    "description": "Jonathan Freedland / The Guardian:\nUkraine has exposed Trump's true identity: as a vandal, an autocrat, a gangster and a fool  —  This presidency places authoritarian ambition above all - and now the people of Ukraine are paying the price  —  To see the true …",
    "link": "https://www.memeorandum.com/250425/p117",
    "timestamp": "2025-04-25T20:40:03Z"
  },
  {
    "title": "Republican Sends Trump Warning Over His Russia Concessions Remarks",
    "description": "Senator Chuck Grassley warned that Vladimir Putin is \"playing America as a patsy.\"",
    "link": "https://www.newsweek.com/chuck-grassley-trump-russia-concession-2064385",
    "timestamp": "2025-04-25T20:39:28Z"
  },
  {
    "title": "Trump administration opens investigation on UC Berkeley over foreign funding",
    "description": "The Trump administration has launched an investigation into the University of California, Berkeley, centered on foreign funding, making it the latest university to be targeted by the federal government",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-administration-opens-investigation-uc-berkeley-foreign-funding-121175889",
    "timestamp": "2025-04-25T20:38:51Z"
  },
  {
    "title": "Exclusive: Trump's D.C. Prosecutor Threatens Wikipedia's Tax-Exempt Status (Gabe Kaminsky/The Free Press)",
    "description": "Gabe Kaminsky / The Free Press:\nExclusive: Trump's D.C. Prosecutor Threatens Wikipedia's Tax-Exempt Status  —  Ed Martin, the firebrand Republican activist whom President Donald Trump picked to be the top prosecutor in D.C., has a new target: Wikipedia.  —  M…",
    "link": "https://www.memeorandum.com/250425/p116",
    "timestamp": "2025-04-25T20:35:01Z"
  },
  {
    "title": "US Republican George Santos gets 7 years prison for fraud",
    "description": "Disgraced former Congressman George Santos has been sentenced to 7 years in prison for identity theft and fraud. The Republican preyed on vulnerable supporters to finance a lavish lifestyle built entirely on lies.",
    "link": "https://www.dw.com/en/us-republican-george-santos-gets-7-years-prison-for-fraud/a-72358280",
    "timestamp": "2025-04-25T20:35:00Z"
  },
  {
    "title": "More than 250,000 mourners pay last respects to Pope Francis during public viewings",
    "description": "Tens of thousands of mourners waited hours in line over three days to bid farewell to Francis, who died Monday after suffering a stroke at the age of 88. A higher-than-expected turnout prompted the Vatican to extend the basilica’s opening hours overnight.",
    "link": "https://www.pbs.org/newshour/world/more-than-250000-mourners-pay-last-respects-to-pope-francis-during-public-viewings",
    "timestamp": "2025-04-25T20:34:40Z"
  },
  {
    "title": "US Recession Seems Likely, Nobel-Winning Economist Says",
    "description": "Paul Krugman said President Donald Trump's everchanging tariff policy may lead the U.S. into a recession given its unpredictability.",
    "link": "https://www.newsweek.com/us-recession-seems-likely-nobel-winning-economist-says-2064347",
    "timestamp": "2025-04-25T20:33:25Z"
  },
  {
    "title": "Trump Defends Use of Presidential Power in TIME '100 Days' Interview",
    "description": "President Donald Trump defended his use of the power that comes with the presidential office, denying that he is \"expanding\" it while maintaining that he is \"using it properly\" in an interview on his first 100 days as the 47th president with TIME.\nThe post Tr…",
    "link": "https://www.breitbart.com/the-media/2025/04/25/trump-defends-use-of-presidential-power-in-time-100-days-interview/",
    "timestamp": "2025-04-25T20:31:11Z"
  },
  {
    "title": "Officials Prepared to Return Abrego Garcia—Until Trump Intervened",
    "description": "Some officials in the Trump administration tried to bring back Kilmar Abregoa Garcia just days after he was deported, but the president shut them down.\r\nSince Abrego Garcia was unlawfully deported last month due to an administrative error, the White House has…",
    "link": "https://newrepublic.com/post/194454/trump-intervened-return-kilmar-abrego-garcia",
    "timestamp": "2025-04-25T20:30:43Z"
  },
  {
    "title": "Luigi Mangione pleads not guilty to federal death penalty charge in UnitedHealthcare CEO’s killing",
    "description": "Luigi Mangione has pleaded not guilty to a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson, as prosecutors formally declared their intent to seek the death penalty against him.",
    "link": "https://www.news4jax.com/health/2025/04/25/luigi-mangione-pleads-not-guilty-to-federal-murder-charge-in-killing-of-unitedhealthcares-ceo/",
    "timestamp": "2025-04-25T20:30:41Z"
  },
  {
    "title": "Russian Foreign Minister Lavrov says Moscow on track to sign a Ukraine peace deal",
    "description": "April 25 (UPI) -- Russian Foreign Minster Sergey Lavrov said the Kremlin was \"ready to reach a deal\" to end the war with Ukraine.Lavrov told CBS News on Thursday in an interview that U.S. President Donald Trump \"believes, and I think rightly so, that we are m…",
    "link": "https://freerepublic.com/focus/f-news/4313265/posts",
    "timestamp": "2025-04-25T20:30:11Z"
  },
  {
    "title": "A Red State Begged Trump For Help. He Said No — And Now They’re Screwed.",
    "description": "Trump-supporting Gov. Sarah Huckabee Sanders is stuck in a pretty awkward position.",
    "link": "https://www.huffpost.com/entry/arkansas-tornados-trump-fema-help_n_680bd3c2e4b0f42cc7ebde87",
    "timestamp": "2025-04-25T20:30:10Z"
  },
  {
    "title": "Shares rise as trade tensions ease slightly",
    "description": "RECAP:  Asian shares rose yesterday in line with a global relief rally as trade tensions cooled and US Federal Reserve officials indicated they would be open to cutting interest rates earlier than anticipated.",
    "link": "https://www.bangkokpost.com/business/general/3011616/shares-rise-as-trade-tensions-ease-slightly",
    "timestamp": "2025-04-25T20:30:00Z"
  },
  {
    "title": "Tariff chaos could halt 80 years of economic progress",
    "description": "International trade and exploration have captivated the human imagination for millennia. From Alexander the Great to Marco Polo, from the Silk Road to the East India Company, history is filled with examples of commerce redrawing the map of the known world. Bu…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3011606/tariff-chaos-could-halt-80-years-of-economic-progress",
    "timestamp": "2025-04-25T20:30:00Z"
  },
  {
    "title": "‘Can’t imagine’: Trump defends ‘honorable’ allies — but can't rule out insider trading",
    "description": "President Donald Trump defended his administration following reports that White House officials may have tipped off Wall Street executives about a possible upcoming trade deal with India, The Washington Post reported.Trump made the comments Friday while speak…",
    "link": "https://www.rawstory.com/trump-insider-trading-2671845879/",
    "timestamp": "2025-04-25T20:29:53Z"
  },
  {
    "title": "Democratic Senator Urges Party To Adopt 'Goddamn Alpha Energy' to \"Contain and Defeat Donald Trump\"",
    "description": "Democratic Senator Elissa Slotkin of Michigan has launched what she is calling a \"military-style operational plan\" to counter Donald Trump",
    "link": "https://www.ibtimes.com/democratic-senator-urges-party-adopt-goddamn-alpha-energy-contain-defeat-donald-trump-3771460",
    "timestamp": "2025-04-25T20:29:53Z"
  },
  {
    "title": "Paramount Global Ex-CEO Bob Bakish Walks Away With Almost $87M; George Cheeks, Chris McCarthy And Brian Robbins Each Net Between $19.5M And $22.2M In 2024",
    "description": "The three occupants of Paramount Global’s Office of the CEO did well for themselves financially in 2024, but the biggest payday went to ex-CEO Bob Bakish. George Cheeks, Chris McCarthy and Brian Robbins collected $22.2 million, $19.5 million and $19.6 million…",
    "link": "http://deadline.com/2025/04/paramount-ceo-george-cheeks-chris-mccarthy-brian-robbins-executive-compensation-1236377282/",
    "timestamp": "2025-04-25T20:29:46Z"
  },
  {
    "title": "Democrats Rally To Blindly Defend Judge Accused Of Aiding Fugitive Illegal Immigrant",
    "description": "Numerous Democrats are rallying to the defense of a judge arrested Friday by the FBI for allegedly helping an illegal immigrant avoid arrest.",
    "link": "https://dailycaller.com/2025/04/25/democrats-rally-to-blindly-defend-judge-accused-of-aiding-fugitive-illegal-immigrant/",
    "timestamp": "2025-04-25T20:29:03Z"
  },
  {
    "title": "Guns and grins: The 'unprecedented' security operation for Pope Francis's funeral",
    "description": "As the line of mourners moves slowly along behind him, Ciriaco Sarnelli peers at me from beneath the immaculate brim of his cap.",
    "link": "https://news.sky.com/story/guns-and-grins-the-unprecedented-security-operation-for-pope-franciss-funeral-13355677",
    "timestamp": "2025-04-25T20:29:00Z"
  },
  {
    "title": "China expert Gordon Chang says regime there is ‘caving’ to Trump",
    "description": "U.S. president's tariff war aimed at equalizing trade worldwide",
    "link": "https://www.wnd.com/2025/04/china-expert-gordon-chang-says-regime-there-is-caving-to-trump/",
    "timestamp": "2025-04-25T20:28:43Z"
  },
  {
    "title": "‘The Democratic Party In Florida Is Dead’: Top State Senate Dem Leaves Party He Says ‘Craves And Screams Anarchy’",
    "description": "Pizzo, who has served as a member of the Florida Senate since 2018, said during a speech on the Senate floor that \"the Democratic Party in Florida is dead.\"",
    "link": "https://dailycaller.com/2025/04/25/the-democratic-party-in-florida-is-dead-top-state-senate-dem-leaves-party-he-says-craves-and-screams-anarchy/",
    "timestamp": "2025-04-25T20:28:38Z"
  },
  {
    "title": "Pope's Death Triggers Surge Of Disinformation He Fought Against",
    "description": "The death of Pope Francis drew tributes from mourners around the world -- and with them a wave of disinformation, old and new.",
    "link": "https://www.ibtimes.com/popes-death-triggers-surge-disinformation-he-fought-against-3771456",
    "timestamp": "2025-04-25T20:27:15Z"
  },
  {
    "title": "Iowa courts: Gov. Kim Reynolds sues Des Moines Register",
    "description": "Iowa Gov. Kim Reynolds on Friday sued the Des Moines Register over the newspaper's open records request, asking the court to validate her office's withholding of certain emails she claims are protected.",
    "link": "https://www.kcci.com/article/iowa-governor-kim-reynolds-sues-des-moines-register/64592830",
    "timestamp": "2025-04-25T20:26:27Z"
  },
  {
    "title": "Disney May Have Just Mistakenly Admitted That Theme Park Expansions Are Being Significantly Reduced",
    "description": "Last April, Disney CEO Bob Iger announced that the company planned to spend $60 billion on its Disney Experiences division over the next decade. Of that, $30 billion would be spent on Disney Parks, $18 billion on tech and maintenance, and $12 billion on Disne…",
    "link": "https://insidethemagic.net/2025/04/disney-may-have-secretly-announced-cuts-to-its-theme-park-expansions-rl1/",
    "timestamp": "2025-04-25T20:26:15Z"
  },
  {
    "title": "AOC claims 'We are one' in campaign-style video despite years of invoking race, gender in politics",
    "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., claimed, \"We are one,\" after years of being criticized for playing identity politics. Her campaign-style video sparked 2028 rumors.",
    "link": "https://www.foxnews.com/politics/aoc-claims-we-one-campaign-style-video-despite-years-invoking-race-gender-politics",
    "timestamp": "2025-04-25T20:25:39Z"
  },
  {
    "title": "Migrant lawyers claim Trump is deporting without 'due process,' but what does that mean?",
    "description": "Legal experts say that President Donald Trump's deportation suits under an 18th century wartime authority will likely end up in the Supreme Court's hands as courts review due process claims.",
    "link": "https://www.foxnews.com/politics/what-does-due-process-look-like-trumps-deportation-suits",
    "timestamp": "2025-04-25T20:22:57Z"
  },
  {
    "title": "Pope’s death triggers surge of disinformation he fought against",
    "description": "The death of Pope Francis drew tributes from mourners around the world — and with them a wave of disinformation, old and new. Swarms of fake and misleading content interrupted the global rush of condolences that poured online for the 88-year-old Argentine ref…",
    "link": "https://www.digitaljournal.com/social-media/popes-death-triggers-surge-of-disinformation-he-fought-against/article",
    "timestamp": "2025-04-25T20:22:20Z"
  },
  {
    "title": "Pope’s death triggers surge of disinformation he fought against",
    "description": "The death of Pope Francis drew tributes from mourners around the world — and with them a wave of disinformation, old and new. Swarms of fake and misleading content interrupted the global rush of condolences that poured online for the 88-year-old Argentine ref…",
    "link": "https://www.digitaljournal.com/world/popes-death-triggers-surge-of-disinformation-he-fought-against/article",
    "timestamp": "2025-04-25T20:22:20Z"
  },
  {
    "title": "Trump admin could cut billions from 2026 budget",
    "description": "US President Donald Trump's administration is planning to eliminate major funding in the budget proposal for fiscal year 2026, the New York Times reported on Friday.Documents that will be presented to...",
    "link": "https://biztoc.com/x/f06b117d55c3936a",
    "timestamp": "2025-04-25T20:20:43Z"
  },
  {
    "title": "Donald Trump And Bitcoin: Why The China Resolution Could Trigger $100,000 | Bitcoinist.com",
    "description": "hovers above the $90,000 mark, renewed optimism is sweeping through the crypto market — and surprisingly, much of it is driven by the political developments made by United States (US) President Donald Trump. Amid the market turmoil and decline, Trump has rece…",
    "link": "https://biztoc.com/x/75acf2e23df1d561",
    "timestamp": "2025-04-25T20:20:41Z"
  },
  {
    "title": "Trump Not Asking Ukraine to Recognize Crimea: White House",
    "description": "President Donald Trump ratcheted up pressure on Volodymyr Zelenskiy to accept a peace deal that critics fear will favor Moscow, accusing the Ukrainian president of prolonging the war that’s now in its fourth year.\nTrump’s latest broadside against Zelenskiy, m…",
    "link": "https://biztoc.com/x/221ead6114aefff2",
    "timestamp": "2025-04-25T20:20:37Z"
  },
  {
    "title": "Markets notch small gains as tech stocks rise and Trump delivers mixed signals on tariffs",
    "description": "Stock markets rose for the fourth consecutive day as tech companies saw gains and investors interpreted President Donald Trump's Friday comments on tariff negotiations.\nStock markets rose slightly Friday on the back of gains in tech stocks like Alphabet and N…",
    "link": "https://biztoc.com/x/f05e04ec57cdd60b",
    "timestamp": "2025-04-25T20:20:36Z"
  },
  {
    "title": "Kanye West joins streaming service Twitch — gets banned after seven minutes",
    "description": "While streaming, the rapper performed a Nazi salute and said: ‘Heil Hitler’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/kanye-west-banned-twitch-streaming-b2740037.html",
    "timestamp": "2025-04-25T20:19:49Z"
  },
  {
    "title": "I love Vatican \"experts\" who don't know how to name a Cardinal.",
    "description": "The word, \"Cardinal\" doesn't go before the first name, it goes before the last name. See, when you call Donald Trump, \"President Donald Trump,\" you're still calling him by his name. You're just adding a title to say what's significant about him. (\"Yes, THAT D…",
    "link": "https://freerepublic.com/focus/f-religion/4313261/posts",
    "timestamp": "2025-04-25T20:19:16Z"
  },
  {
    "title": "Rubio replaces top US diplomat for Europe with former Senate staffer, consultant",
    "description": "Louis Bono, a senior foreign service officer, wrote to staff on Friday that Brendan Hanrahan would be taking over the role.",
    "link": "https://www.jpost.com/breaking-news/article-851543",
    "timestamp": "2025-04-25T20:18:50Z"
  },
  {
    "title": "Trump admin says it won't hold migration talks with Cuba",
    "description": "Cuba says it will continue receiving deportation flights from the U.S. based on a previous accord between the two countries, even though the State Department says it has no plans to hold migration talks with the island’s government.",
    "link": "https://www.nbcnews.com/news/latino/trump-admin-wont-hold-migration-talks-cuba-rcna203035",
    "timestamp": "2025-04-25T20:18:17Z"
  },
  {
    "title": "Democrat Mayor Complains For 5 Minutes About Arrest Of Judge Who Allegedly Escorted Illegal Away From ICE",
    "description": "Mayor Cavalier Johnson spent five minutes accusing Donald Trump of making Milwaukee “less safe” after a judge was arrested on charges of obstructing ICE.",
    "link": "https://dailycaller.com/2025/04/25/democrat-mayor-complains-for-5-minutes-about-arrest-of-judge-who-allegedly-escorted-illegal-ice/",
    "timestamp": "2025-04-25T20:18:15Z"
  },
  {
    "title": "Bitcoin on the Rise as China Tariff Exemptions Give Stocks Relief",
    "description": "Bitcoin hit a two-month peak Friday as investors mulled Donald Trump's purported progress on trade negotiations with China.",
    "link": "https://decrypt.co/316497/bitcoin-rising-china-tariffs-stocks",
    "timestamp": "2025-04-25T20:17:25Z"
  },
  {
    "title": "A Guide to Donald Trump’s Jockocracy: 100 Days of Sports and Politics",
    "description": "By playing host to champions, doing a lap at the Daytona 500, and targeting transgender athletes, Trump seizes on sports to satisfy his base and cement his brand. But his policies and antics could complicate two global spectacles coming to US soil: the World …",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-jockocracy-100-days-sports-politics",
    "timestamp": "2025-04-25T20:16:57Z"
  },
  {
    "title": "SEC chair suggests 'huge benefits' in agency's third crypto roundtable",
    "description": "In one of his first appearances as the recently sworn-in chair of the US Securities and Exchange Commission, Paul Atkins delivered remarks to the agency’s third roundtable discussion of crypto regulation. In the “Know Your Custodian” roundtable event on April…",
    "link": "https://cointelegraph.com/news/sec-paul-atkins-benefits-crypto-roundtable",
    "timestamp": "2025-04-25T20:16:53Z"
  },
  {
    "title": "Trump's Understanding of Due Process Is Just As Farcical As His Definition of 'Alien Enemies'",
    "description": "A new ACLU lawsuit argues that the government still is not giving alleged gang members the \"notice\" required by a Supreme Court order.",
    "link": "https://reason.com/2025/04/25/trumps-understanding-of-due-process-is-just-as-farcical-as-his-definition-of-alien-enemies/",
    "timestamp": "2025-04-25T20:16:15Z"
  },
  {
    "title": "Federal agencies are reeling from Trump administration cuts to government",
    "description": "Whether a \"chainsaw,\" per Elon Musk, or \"scalpel,\" as President Trump has said — the Trump administration is making deep cuts to the federal government within its first 100 days.<br><br>And Trump has appointed personal allies with little experience in governm…",
    "link": "https://www.npr.org/2025/04/25/1247139363/trump-administration-cuts-pentagon-state-hhs",
    "timestamp": "2025-04-25T20:15:52Z"
  },
  {
    "title": "Trump Gov't Lawyers Bash Their Own Case Against NYC Congestion Pricing In Mistakenly Uploaded Memo",
    "description": "President Trump wants to kill NYC's wildly successful congestion pricing scheme, but federal prosecutors don't think the White House could pull it off in court.",
    "link": "https://www.jalopnik.com/1843710/trump-lawyers-argue-against-nyc-congestion/",
    "timestamp": "2025-04-25T20:13:03Z"
  },
  {
    "title": "Outgunned on NGAD, Lockheed doubles down on F-35",
    "description": "Lockheed bets on F-35 upgrades to remain relevant in an airpower race with China that favors revolution over evolution US F-35 in a file photo. Image: US Air Force Bested at the next-generation US fighter competition, Lockheed Martin is betting big on turning…",
    "link": "https://freerepublic.com/focus/f-chat/4313259/posts",
    "timestamp": "2025-04-25T20:11:42Z"
  },
  {
    "title": "Trump Dodges Key Question on Team Tipping Off Wall Street Execs",
    "description": "President Donald Trump is refusing to promise that his staff didn’t engage in insider trading.\r\nWhile speaking with reporters on Air Force One Friday, Trump was asked about a report that people inside the White House had given Wall Street executives a heads-u…",
    "link": "https://newrepublic.com/post/194458/donald-trump-dodges-question-team-wall-street-executives-trade-deal",
    "timestamp": "2025-04-25T20:11:05Z"
  },
  {
    "title": "Judges Are Slowing Down Trump’s Fascist Deportation Regime. Now He’s Arresting Them For It.",
    "description": "In the absence of opposition party challenges and disempowered labor, courts are one of the few sites of meaningful pushback on Trump’s agenda. \nThe post Judges Are Slowing Down Trump’s Fascist Deportation Regime. Now He’s Arresting Them For It. appeared firs…",
    "link": "https://theintercept.com/2025/04/25/judge-arrest-trump-immigrants-deport/",
    "timestamp": "2025-04-25T20:10:24Z"
  },
  {
    "title": "Trump Approval Rating Tracker: Majority Say Trump Presidency Is ‘Scary’ And ‘Chaotic’ In Latest Poll",
    "description": "The latest survey, released April 25, shows 54% disapprove of Trump's job performance.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/25/trump-approval-rating-tracker-worst-economic-reviews-in-years-latest-poll-finds/",
    "timestamp": "2025-04-25T20:09:26Z"
  },
  {
    "title": "Hegseth trying to show Trump he's a fighter amid chaos in Pentagon",
    "description": "Defense Secretary Pete Hegseth has been focusing more on public and television appearances so he can speak directly to President Trump through the appearances.",
    "link": "https://www.nbcnews.com/politics/national-security/hegseth-trying-show-trump-s-fighter-chaos-pentagon-rcna202915",
    "timestamp": "2025-04-25T20:09:07Z"
  },
  {
    "title": "Iowa governor sues the Des Moines Register to stop request of emails she claims are protected",
    "description": "Iowa’s governor is suing the Des Moines Register over the newspaper’s open records request",
    "link": "https://abcnews.go.com/Business/wireStory/iowa-governor-sues-des-moines-register-stop-request-121173666",
    "timestamp": "2025-04-25T20:06:31Z"
  },
  {
    "title": "Iowa governor sues the Des Moines Register to stop request of emails she claims are protected",
    "description": "Iowa’s governor is suing the Des Moines Register over the newspaper’s open records request. Gov. Kim Reynolds is asking the court to validate her office’s withholding of certain emails she claims are protected. The governor's office withheld four emails. Fili…",
    "link": "https://www.seattlepi.com/news/politics/article/iowa-governor-sues-the-des-moines-register-to-20294899.php",
    "timestamp": "2025-04-25T20:05:46Z"
  },
  {
    "title": "Trump Makes Alarming Confession on Wrongly Deported Immigrant (Malcolm Ferguson/New Republic)",
    "description": "Malcolm Ferguson / New Republic:\nTrump Makes Alarming Confession on Wrongly Deported Immigrant  —  Donald Trump is openly admitting his defiance of the Supreme Court on Kilmar Abrego Garcia.  —  President Trump told Time magazine that he is essentially doing …",
    "link": "https://www.memeorandum.com/250425/p112",
    "timestamp": "2025-04-25T20:05:01Z"
  },
  {
    "title": "Luigi Mangione pleads not guilty to federal death penalty charge in killing of UnitedHealthcare CEO",
    "description": "Mangione, 26, stood with his lawyers as he entered the plea Friday, leaning forward toward a microphone as he addressed U.S. District Judge Margaret Garnett.",
    "link": "https://www.pbs.org/newshour/nation/luigi-mangione-pleads-not-guilty-to-federal-death-penalty-charge-in-killing-of-unitedhealthcare-ceo",
    "timestamp": "2025-04-25T20:03:41Z"
  },
  {
    "title": "Trump meme coin insiders have to wait additional 90 days before they can sell",
    "description": "President Donald Trump’s meme coin was supposed to unlock for some insider sales, but that move got delayed by 90 days.",
    "link": "https://www.cnbc.com/2025/04/25/trump-meme-coin-insiders-to-wait-additional-90-days-before-selling.html",
    "timestamp": "2025-04-25T20:03:05Z"
  },
  {
    "title": "Judge sentences disgraced ex-Congressman George Santos to over 7 years for fraud",
    "description": "Disgraced ex-Congressman George Santos receives a 7-year federal prison sentence for defrauding donors and misusing campaign funds. New York judge cites his lack of remorse and pursuit of fame, ordering him to pay nearly $374,000 in restitution.",
    "link": "https://www.israelnationalnews.com/news/407413",
    "timestamp": "2025-04-25T20:02:32Z"
  },
  {
    "title": "'Serious Disregard for Human Life': Dem Senators Press Hegseth on Yemen Civilian Casualties",
    "description": "A trio of Democratic senators on Thursday demanded answers from embattled Defense Secretary Pete Hegseth regarding U.S. airstrikes in Yemen, which have reportedly \nkilled scores of civilians including numerous women and children since last month.\n\n\"We write t…",
    "link": "https://www.commondreams.org/news/civilian-casualties-in-yemen",
    "timestamp": "2025-04-25T20:01:43Z"
  },
  {
    "title": "Democrat Frederica Wilson Calls for 'Uprising' in Streets to Stop Arrests, Deportations of Illegal Aliens",
    "description": "Rep. Frederica Wilson (D-FL) is calling for an \"uprising\" in the streets of the United States until President Donald Trump stops his agenda of increased interior immigration enforcement. \nThe post Democrat Frederica Wilson Calls for ‘Uprising’ in Streets to S…",
    "link": "https://www.breitbart.com/politics/2025/04/25/democrat-frederica-wilson-calls-for-uprising-in-streets-to-stop-arrests-deportations-of-illegal-aliens/",
    "timestamp": "2025-04-25T20:01:31Z"
  },
  {
    "title": "Rainn Wilson Lashes Out After Becoming ‘Hero of the MAGA’ for Challenging MSNBC Host",
    "description": "Rainn Wilson lashed out at \"right wing\" media after he was \"lauded\" for challenging MSNBC host Stephanie Ruhle on the \"left-leaning\" media's coverage of Biden.\nThe post Rainn Wilson Lashes Out After Becoming ‘Hero of the MAGA’ for Challenging MSNBC Host first…",
    "link": "https://www.mediaite.com/entertainment/rainn-wilson-lashes-out-after-becoming-hero-of-the-maga-for-challenging-msnbc-host/",
    "timestamp": "2025-04-25T20:01:29Z"
  },
  {
    "title": "FBI arrests US judge accused of helping man evade immigration officers",
    "description": "The FBI has arrested a US judge who is accused of helping a man evade immigration authorities.",
    "link": "https://news.sky.com/story/fbi-arrests-us-judge-accused-of-helping-man-evade-immigration-authorities-13355660",
    "timestamp": "2025-04-25T20:01:00Z"
  },
  {
    "title": "Trump Signals Openness To Tax Increase On Wealthy To ‘Take Care Of Middle Class’",
    "description": "Trump signaled in an interview with TIME Magazine that he is open to a tax increase on the wealthy in an effort to \"take care of the middle class.\"",
    "link": "https://dailycaller.com/2025/04/25/donald-trump-tax-increase-wealthy-middle-class/",
    "timestamp": "2025-04-25T20:00:59Z"
  },
  {
    "title": "Crypto Biz: Cantor Fitzgerald crypto play, ETF inflows highlight industry’s big sentiment shift",
    "description": "US President Donald Trump’s first 90 days in office have been miserable for Bitcoin (BTC) and the broader cryptocurrency industry. Despite positive regulatory developments, culminating in the first-ever White House crypto summit on March 7, digital asset pric…",
    "link": "https://cointelegraph.com/news/crypto-biz-cantor-fitzgerald-crypto-etf-inflows-industry-sentiment-shift",
    "timestamp": "2025-04-25T20:00:00Z"
  },
  {
    "title": "Trump billionaire tech ally Peter Thiel sells ‘smart’ AI ‘war fighting’ system to NATO while talking up U.S. trade war with China",
    "description": "Stock in Thiel’s company, Palantir, soars Monday on news of major new business deal with NATO President Trump’s push to recalibrate the U.S.-China trade relationship has the full endorsement of Silicon Valley billionaire and mega-technocrat Peter Thiel. Thiel…",
    "link": "https://www.activistpost.com/trump-billionaire-tech-ally-peter-thiel-sells-smart-ai-war-fighting-system-to-nato-while-talking-up-u-s-trade-war-with-china/",
    "timestamp": "2025-04-25T20:00:00Z"
  },
  {
    "title": "Trade War Is Diverting USA Petroleum Gas Cargoes Away From China",
    "description": "The diversions show the disruption to supply chains caused by the trade fight between the U.S. and China.",
    "link": "https://www.rigzone.com/news/wire/trade_war_is_diverting_usa_petroleum_gas_cargoes_away_from_china-25-apr-2025-180344-article/",
    "timestamp": "2025-04-25T20:00:00Z"
  },
  {
    "title": "The New “Trump 2028” Hat Isn’t Just Ugly, It’s a Headgear Harbinger",
    "description": "A little bit of background on the newest MAGA swag to hit the Trump Store, topping off a Constitutional threat.",
    "link": "https://www.vanityfair.com/style/story/trump-2028-hats-constitution",
    "timestamp": "2025-04-25T19:59:40Z"
  },
  {
    "title": "Will Donald Trump cry foul over his seat at the Pope’s funeral? Protocol sparks drama after he mocked Joe Biden at Queen Elizabeth’s farewell",
    "description": "Donald Trump's seat at Pope Francis's funeral is creating buzz. He may sit far from the front. This reminds people of his past remarks on Joe Biden's seating at Queen Elizabeth's funeral. Tradition gives front seats to Catholic royals and heads of state. Volo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-donald-trump-cry-foul-over-his-seat-at-the-popes-funeral-protocol-sparks-drama-after-he-mocked-joe-biden-at-queen-elizabeths-farewell/articleshow/120629215.cms",
    "timestamp": "2025-04-25T19:58:31Z"
  },
  {
    "title": "How China is controlling Australia’s",
    "description": "China is threatening to land a knockout blow in its trade war with Donald Trump, targeting a vulnerability in the United States’ most crucial military infrastructure with a strike that was decades in the making.",
    "link": "https://www.smh.com.au/business/markets/how-china-is-controlling-australia-s-and-the-world-s-rare-earths-trade-20250304-p5lgse.html",
    "timestamp": "2025-04-25T19:56:03Z"
  },
  {
    "title": "What happens if the Trump administration defies the Supreme Court?",
    "description": "We spoke to two experts to answer questions about what recourse the judiciary has when its authority is tested by the executive branch.",
    "link": "https://www.abc.net.au/news/2025-04-26/what-happens-if-the-trump-administration-defies-supreme-court/105194800",
    "timestamp": "2025-04-25T19:54:41Z"
  },
  {
    "title": "Trump’s Attack on ActBlue Just Blew up in His Face",
    "description": "The Trump administration’s decision to target ActBlue has instead resulted in the left-leaning platform’s biggest fundraising day of the year.\r\nOn Thursday, Donald Trump ordered the Justice Department to investigate the online donations platform, directing At…",
    "link": "https://newrepublic.com/post/194450/donald-trump-attack-actblue-donations",
    "timestamp": "2025-04-25T19:54:19Z"
  },
  {
    "title": "WTI Ends Higher But Logs Weekly Loss",
    "description": "Oil prices edged up slightly as conflicting US-China trade signals kept markets cautious.",
    "link": "https://www.rigzone.com/news/wire/wti_ends_higher_but_logs_weekly_loss-25-apr-2025-180347-article/",
    "timestamp": "2025-04-25T19:53:27Z"
  },
  {
    "title": "New senior staff announced as White House looks to 'right the ship' at the Pentagon",
    "description": "The defense department has announced new senior level positions after recent firings and resignations. But with Pentagon head Pete Hegseth under fire for missteps, the way ahead is still unclear.",
    "link": "https://www.npr.org/2025/04/25/nx-s1-5377395/hegseth-defense-department",
    "timestamp": "2025-04-25T19:53:20Z"
  },
  {
    "title": "2484 - Immigration Judge Arrested, Tariff Tizzy w/ Krystal Ball",
    "description": "We've made it to Friday folks. Krystal Ball will be here to break down the wild week that was. First, Sam and Emma discuss Donald Trump's memecoin dinner and the amount of money he's made since taking office just over a month ago. Then Krystal, Sam and Emma d…",
    "link": "https://majorityfm.libsyn.com/2484-immigration-judge-arrested-tariff-tizzy-w-krystal-ball",
    "timestamp": "2025-04-25T19:51:00Z"
  },
  {
    "title": "Trump says he wasn't 'trolling' about acquiring Greenland, Canada as 51st state (Diana Stancy/Fox News)",
    "description": "Diana Stancy / Fox News:\nTrump says he wasn't ‘trolling’ about acquiring Greenland, Canada as 51st state  —  'Actually, no, I'm not,' Trump said when asked if he was trolling Canada  —  President Donald Trump isn't “trolling” when it comes to efforts to acqui…",
    "link": "https://www.memeorandum.com/250425/p109",
    "timestamp": "2025-04-25T19:50:01Z"
  },
  {
    "title": "Trump says he would 'never defy' SCOTUS, commits to complying with courts despite flurry of legal setbacks",
    "description": "President Donald Trump said he would \"never defy\" the Supreme Court as his administration resists a court order to return a deported migrant, prompting a heated legal showdown.",
    "link": "https://www.foxnews.com/politics/trump-says-he-would-never-defy-scotus-commits-complying-courts-despite-flurry-legal-setbacks",
    "timestamp": "2025-04-25T19:48:33Z"
  },
  {
    "title": "Trump’s Trade Policy Tests His Own Team",
    "description": "Ten thinkers on the start of the U.S. president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-trade-tariffs-policy-markets-us-china/",
    "timestamp": "2025-04-25T19:48:07Z"
  },
  {
    "title": "Latin America Jumps up the Priority List",
    "description": "Ten thinkers on the start of the U.S. president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-latin-america-el-salvador-migration-mexico-tariffs-trade/",
    "timestamp": "2025-04-25T19:47:47Z"
  },
  {
    "title": "Trump Admin Poses 'Existential Threat' To Small Businesses—Senator",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDemocratic Senator Ed Markey wants complete tariff exemption for the United States' 34 million small businesses, warning that actions by the Trump administration pose an \"existential threat\" to their futures.\n…",
    "link": "https://biztoc.com/x/55aa6874f4fe5cd4",
    "timestamp": "2025-04-25T19:47:39Z"
  },
  {
    "title": "Shocking CIA files claim WW3 was nearly triggered by UFOs trying to fire Russian nuclear warheads",
    "description": "WW3 was nearly triggered by aliens in Russia, according to some shocking CIA files, which suggest several soldiers witnessed UFOs in the sky",
    "link": "https://www.ladbible.com/news/world-news/science-russia-ww3-ufos-nuclear-warheads-aliens-561635-20250425",
    "timestamp": "2025-04-25T19:47:31Z"
  },
  {
    "title": "100 Days of Tearing Down Institutions—and Opponents",
    "description": "Ten thinkers on the start of the U.S. president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-institutions-universities-law-firms-courts-judges-foreign-allies/",
    "timestamp": "2025-04-25T19:47:23Z"
  },
  {
    "title": "Why Donald Trump keeps attacking Federal Reserve boss Jerome Powell",
    "description": "Why Trump keeps attacking the US central bank\nUS President Donald Trump has some well-known nemeses: illegal immigrants, low-flow showers and last, but definitely not least, the head of the US central bank.\nElevated by Trump to lead the Federal Reserve starti…",
    "link": "https://biztoc.com/x/9c2ca5b3ca369da4",
    "timestamp": "2025-04-25T19:47:19Z"
  },
  {
    "title": "Donald Trump Throws Support Behind New Democratic Priority",
    "description": "President Donald Trump discussed a range of policy considerations during an interview with Time this week.",
    "link": "https://biztoc.com/x/47d1aa7ee170ed2c",
    "timestamp": "2025-04-25T19:47:08Z"
  },
  {
    "title": "What Is Trump’s Foreign-Policy Doctrine?",
    "description": "Ten thinkers on the start of the U.S president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-foreign-policy-record-philosophy-us-allies-deals/",
    "timestamp": "2025-04-25T19:46:34Z"
  },
  {
    "title": "Trump’s Policies Provide Cover for Chinese Missteps",
    "description": "Ten thinkers on the start of the U.S. president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-us-china-tariffs-ccp-policy-economy-business/",
    "timestamp": "2025-04-25T19:46:18Z"
  },
  {
    "title": "Trump Looks to Modi for Appeasement",
    "description": "Ten thinkers on the start of the U.S. president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-modi-us-india-trade-tariffs-immigration-h1b-visa/",
    "timestamp": "2025-04-25T19:45:41Z"
  },
  {
    "title": "Trump’s Far-Right Allies in Europe Lose Out",
    "description": "Ten thinkers on the start of the U.S president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-europe-tariffs-far-right-parties-russia/",
    "timestamp": "2025-04-25T19:45:16Z"
  },
  {
    "title": "Top Senate Republican Warns Putin is ‘Playing America as a Patsy’",
    "description": "Grassley made his statement following Russia’s deadly missile and drone strike on Kyiv, which killed 12 and left over 90 injured.\nThe post Top Senate Republican Warns Putin is ‘Playing America as a Patsy’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/top-senate-republican-warns-putin-is-playing-america-as-a-patsy/",
    "timestamp": "2025-04-25T19:44:27Z"
  },
  {
    "title": "Trump’s $397 Million Exception for Pakistan",
    "description": "Ten thinkers on the start of the U.S president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-us-pakistan-funding-foreign-aid/",
    "timestamp": "2025-04-25T19:42:12Z"
  },
  {
    "title": "Trump Admin Poses 'Existential Threat' To Small Businesses—Senator",
    "description": "Trump \"moved too quickly and overreached\" with his policies, according to 69 percent of small business owners in a recent survey.",
    "link": "https://www.newsweek.com/tariffs-trump-small-businesses-markey-lutnick-2064303",
    "timestamp": "2025-04-25T19:41:50Z"
  },
  {
    "title": "Does Trump Have an Africa Policy?",
    "description": "Ten thinkers on the start of the U.S president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-africa-policy-business-foreign-aid/",
    "timestamp": "2025-04-25T19:40:50Z"
  },
  {
    "title": "The News Roundup For April 25, 2025",
    "description": "Tributes for the late Pope Francis are pouring in from across the globe after the Pontiff passed away on Easter Monday. His funeral will be held on this weekend. <br><br>This week, the president attacked Supreme Court Justices for getting in the way of his ad…",
    "link": "https://www.npr.org/2025/04/25/1247139362/1a-nru-04-25-2025",
    "timestamp": "2025-04-25T19:40:13Z"
  },
  {
    "title": "Trump Isn’t Gaining Traction in the Middle East",
    "description": "Ten thinkers on the start of the U.S president’s second term.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-middle-east-israel-gaza-houthis-iran-deal-saudi-arabia/",
    "timestamp": "2025-04-25T19:38:53Z"
  },
  {
    "title": "Donald Trump Throws Support Behind New Democratic Priority",
    "description": "President Donald Trump discussed a range of policy considerations during an interview with Time this week.",
    "link": "https://www.newsweek.com/donald-trump-throws-support-democratic-priority-2064323",
    "timestamp": "2025-04-25T19:38:42Z"
  },
  {
    "title": "Trump sees trade deals getting done in three to four weeks",
    "description": "Donald Trump anticipated concluding trade agreements with US allies seeking reduced tariffs. He mentioned potential adjustments post-finalization. Trump affirmed positive relations with Japan, signaling an imminent agreement. He defended his trade strategies …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-sees-trade-deals-getting-done-in-three-to-four-weeks/articleshow/120629111.cms",
    "timestamp": "2025-04-25T19:38:21Z"
  },
  {
    "title": "How did Pope Francis die? No suffering, but pope went into coma before stroke: Vatican",
    "description": "When Pope Francis died, he was recovering at the Vatican after a five-week hospital stay for double pneumonia and other health issues.",
    "link": "https://www.usatoday.com/story/news/world/2025/04/25/pope-francis-death-vatican-funeral/83274704007/",
    "timestamp": "2025-04-25T19:37:32Z"
  }
]