[
  {
    "title": "Student Loan Update: How Senate GOP Changes to Trump Bill Impact Borrowers",
    "description": "Federal student loan borrowers could benefit from the extension of a rule regarding employers helping workers pay off their loans.",
    "link": "https://www.newsweek.com/student-loan-update-how-senate-gop-changes-trump-bill-impact-borrowers-2086794",
    "timestamp": "2025-06-17T15:57:02Z"
  },
  {
    "title": "Powerful Trump aide who’s in charge of vetting thousands of staffers still hasn’t been fully vetted himself: sources",
    "description": "Three administration insiders told The Post that the vetter-in-chief has not turned in his Standard Form 86, or SF-86 – a 100-page set of questions required for officials who need security clearances.",
    "link": "https://nypost.com/2025/06/17/us-news/sergio-gor-trump-aide-who-vets-thousands-of-staffers-hasnt-been-fully-vetted-himself-sources/",
    "timestamp": "2025-06-17T15:56:52Z"
  },
  {
    "title": "Germany’s Merz says US weighing participation in Iran strikes",
    "description": "\"The decisions will probably be made in the near future,\" the chancellor said.",
    "link": "https://www.politico.eu/article/germany-friedrich-merz-says-us-weighing-participation-iran-strikes/",
    "timestamp": "2025-06-17T15:55:43Z"
  },
  {
    "title": "Tesla Will Receive A $266 Million Tailwind From Bitcoin In Q2 But Needs To Increase Its Deliveries By Over 50 Percent Month-Over-Month In June To Meet Q2 Consensus Delivery Estimate",
    "description": "Elon Musk's prolific exit from the Trump administration does not seem to have had a discernibly positive impact on Tesla's sales, which continue to contend with brand damage and politically motivated boycotts. While Donald Trump saw his net favorability ratin…",
    "link": "https://wccftech.com/tesla-will-receive-a-266-million-tailwind-from-bitcoin-in-q2-but-needs-to-increase-its-deliveries-by-over-50-percent-month-over-month-in-june-to-meet-q2-consensus-delivery-estimate/",
    "timestamp": "2025-06-17T15:55:38Z"
  },
  {
    "title": "Health department aims to cut some LGBTQ+ suicide hotline services",
    "description": "The department's proposed 2026 budget would eliminate funding for access to counseling.",
    "link": "https://www.nj.com/mosaic/2025/06/health-department-aims-to-cut-some-lgbtq-suicide-hotline-services.html",
    "timestamp": "2025-06-17T15:55:28Z"
  },
  {
    "title": "Vance says Trump may decide on 'action' against Iran",
    "description": "United States Vice President JD Vance commented Tuesday on the tensions surrounding Israel's ongoing conflict with Iran, stating that President Donald Trump \"may decide he needs to take further action...",
    "link": "https://biztoc.com/x/5dd4e6abe0ecaee0",
    "timestamp": "2025-06-17T15:54:30Z"
  },
  {
    "title": "Whoopi Goldberg Sounds Off On Republicans After Democratic Lawmaker Is Fatally Shot: “You Want People To Act Differently And Here You Are Showing Your A**”",
    "description": "\"We are better than this.\"",
    "link": "https://decider.com/2025/06/17/whoopi-goldberg-sounds-off-republicans-after-democratic-lawmaker-fatally-shot/",
    "timestamp": "2025-06-17T15:53:33Z"
  },
  {
    "title": "Trump Jr Insists Trump's Second Term So Far Is Evidence He 'Won the 2020 Election'",
    "description": "Donald Trump Jr. has drawn ire after insisting that his father, President Donald Trump, won the 2020 election, even suggesting that this is evidenced by the trajectory of Trump's second presidential term.",
    "link": "https://www.ibtimes.com/trump-jr-insists-trumps-second-term-so-far-evidence-he-won-2020-election-3775978",
    "timestamp": "2025-06-17T15:53:13Z"
  },
  {
    "title": "Naked Dwarfs and Police Intervention: The Pinocchio Premiere Disney Wants You to Forget",
    "description": "By all accounts, Disney’s early animated classics changed the world of cinema—but the premieres that launched them? A little less magical. Back in 1940, the Pinocchio premiere in New York City spiraled into pure chaos when Disney’s publicity stunt went comple…",
    "link": "https://insidethemagic.net/2025/06/naked-dwarfs-and-police-intervention-the-pinocchio-premiere-disney-wants-you-to-forget-ad1/",
    "timestamp": "2025-06-17T15:52:41Z"
  },
  {
    "title": "‘Perfect!’ Elon Musk invents delicious new name for the Wall Street Journal",
    "description": "'There is no coming back from that name'",
    "link": "https://www.wnd.com/2025/06/perfect-elon-musk-invents-delicious-new-name-wall/",
    "timestamp": "2025-06-17T15:48:41Z"
  },
  {
    "title": "Huge Development In R. Kelly’s Legal Case",
    "description": "Is someone out to assassinate the R&B singer? His attorneys suspect so. \nThe post Huge Development In R. Kelly’s Legal Case appeared first on The Root.",
    "link": "https://www.theroot.com/huge-development-in-r-kelly-s-legal-case-2000045949",
    "timestamp": "2025-06-17T15:48:37Z"
  },
  {
    "title": "One US bomb could destroy Iran’s nuclear sites. Israel may not need it",
    "description": "It is thought that there is only one weapon capable of blowing up Iran’s fabled nuclear mountain.",
    "link": "https://uk.news.yahoo.com/one-us-bomb-could-destroy-154823323.html",
    "timestamp": "2025-06-17T15:48:23Z"
  },
  {
    "title": "Trump dismisses U.S. intelligence assessments as White House rift widens over Iran's nuclear threat",
    "description": "Echoing Netanyahu, Trump insists Iran is nearing a nuclear weapon, sidelining U.S. intelligence chief Tulsi Gabbard – even as prominent MAGA voices grow louder in opposing American military action in Iran",
    "link": "https://www.haaretz.com/israel-news/2025-06-17/ty-article/trump-dismisses-u-s-intelligence-assessments-as-wh-rift-widens-over-irans-nuclear-threat/00000197-7dfe-da11-a797-fdfe8ce40000",
    "timestamp": "2025-06-17T15:47:29Z"
  },
  {
    "title": "Officials arrest 1 of 2 detainees still missing from New Jersey immigration facility",
    "description": "One of the two detainees still mising after escaping from a New Jersey federal immigration detention center has been arrested",
    "link": "https://abcnews.go.com/US/wireStory/officials-arrest-1-2-detainees-missing-new-jersey-122933619",
    "timestamp": "2025-06-17T15:46:17Z"
  },
  {
    "title": "Cotton: Trump 'Right Not to Rule Out Any Option' on Iran",
    "description": "Monday on FNC's \"Hannity,\" Sen. Tom Cotton (R-AR) voiced his support for President Donald Trump's approach to the ongoing Israel-Iran conflict.\nThe post Cotton: Trump ‘Right Not to Rule Out Any Option’ on Iran appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/06/17/cotton-trump-right-not-to-rule-out-any-option-on-iran/",
    "timestamp": "2025-06-17T15:45:12Z"
  },
  {
    "title": "Trump Throws Tulsi Gabbard Under the Bus in His Iran Policy",
    "description": "Donald Trump admitted that he’s ignoring what his Director of National Intelligence Tulsi Gabbard tells him about Iran—he’s just going on vibes. \r\nThe president sided with Israeli intelligence over the intel from his own government Tuesday, telling reporters …",
    "link": "https://newrepublic.com/post/196909/donald-trump-tulsi-gabbard-iran-israel-intelligence-nuclear",
    "timestamp": "2025-06-17T15:44:45Z"
  },
  {
    "title": "Israel warns of major strikes on Tehran as Trump tells people to flee",
    "description": "Tehran braced for further Israeli strikes on Tuesday after Israel warned of imminent, large-scale attacks and US President Donald Trump urged civilians to...",
    "link": "https://www.yahoo.com/news/israel-warns-major-strikes-tehran-154429058.html",
    "timestamp": "2025-06-17T15:44:29Z"
  },
  {
    "title": "G7 is ‘dead club’ – Medvedev",
    "description": "G7 summits looked like a crowd of “zombies” even a decade ago, the former Russian president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/619545-g7-dead-club-medvedev/",
    "timestamp": "2025-06-17T15:44:26Z"
  },
  {
    "title": "Video: Trump drops papers of US-UK trade deal at sidelines of G7 Summit, then makes a big blunder",
    "description": "Keir Starmer and Donald Trump have signed off a UK-US trade deal at the G7 summit in Canada. However, Trump dropped the papers of US-UK trade deal and then called UK as 'EU', a video of which has gone viral on social media. The president mixed up the EU and U…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/video-trump-drops-papers-of-us-uk-trade-deal-at-sidelines-of-g7-summit-then-calls-it-eu-agreement-keir-starmer/articleshow/121913729.cms",
    "timestamp": "2025-06-17T15:43:47Z"
  },
  {
    "title": "The Trump Family's Latest Grift Is A Branded Mobile Phone Service",
    "description": "The first product from \"Trump Mobile\" — surprise, surprise — will be a gold phone.",
    "link": "https://littlethings.com/entertainment/the-trump-familys-latest-grift-is-a-branded-mobile-phone-service",
    "timestamp": "2025-06-17T15:43:30Z"
  },
  {
    "title": "Starmer has 'no doubt' Trump will stay out of Iran conflict",
    "description": "United Kingdom Prime Minister Keir Starmer told reporters on Tuesday that he has \"no doubt\" that United States President Donald Trump will stay out of the conflict between Israel and Iran, based on Tr...",
    "link": "https://biztoc.com/x/3e5403114aa0999d",
    "timestamp": "2025-06-17T15:43:23Z"
  },
  {
    "title": "ABA sues Trump over 'law firm intimidation policy'",
    "description": "What happened\nThe American Bar Association on Monday sued President Donald Trump's administration over its ongoing effort to punish high-profile law firms that have apparently angered or offended the president, or employed lawyers he dislikes.\nWho said what\nT…",
    "link": "https://biztoc.com/x/b27b2d2f20fa4a86",
    "timestamp": "2025-06-17T15:43:15Z"
  },
  {
    "title": "Oil prices rise after Trump calls for evacuation of Tehran",
    "description": "Prices are rising again after President Donald Trump left the G7 summit in Canada early and demanded that everyone evacuate Iran's capital city.",
    "link": "https://biztoc.com/x/9ae5469f5b3d3e34",
    "timestamp": "2025-06-17T15:43:14Z"
  },
  {
    "title": "GOP Lawmaker Declares He's 'Not Voting for a Bill That Grows Deficits' in Critique of Trump's 'Big, Beautiful Bill'",
    "description": "A Republican lawmaker went against his party, stating that he will not vote for the \"one big, beautiful bill\" due to the deficits it will create if passed.",
    "link": "https://www.ibtimes.com/gop-lawmaker-declares-hes-not-voting-bill-that-grows-deficits-critique-trumps-big-3775976",
    "timestamp": "2025-06-17T15:43:13Z"
  },
  {
    "title": "Energy, tourism among talking points during New England meeting, says Hogan",
    "description": "Newfoundland and Labrador Premier John Hogan says energy and tourism were the big topics of discussion during Monday’s meeting with New England governors.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/nl-boston-meeting-hogan-1.7563239",
    "timestamp": "2025-06-17T15:43:09Z"
  },
  {
    "title": "Plurality of Americans Believe 'Civil War' Likely in Next Decade—Poll",
    "description": "Democrats were more likely to view a civil war in the near future as possible, according to the poll.",
    "link": "https://www.newsweek.com/plurality-americans-believe-civil-war-likely-poll-2086771",
    "timestamp": "2025-06-17T15:42:53Z"
  },
  {
    "title": "Wedged between Washington and Beijing, Europe seeks a way forward [Advocacy Lab Content]",
    "description": "Everything, everywhere, all at once. Europe must discover its global identity while dancing between two elephants.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/wedged-between-washington-and-beijing-europe-seeks-a-way-forward/",
    "timestamp": "2025-06-17T15:40:13Z"
  },
  {
    "title": "Carney announces billions in funding for Ukraine at G7 meeting",
    "description": "Carney and Foreign Affairs Minister Anita Anand are meeting with Zelenskyy on Tuesday morning in Kananaskis",
    "link": "https://nationalpost.com/news/carney-announces-billions-in-funding-for-ukraine-g7",
    "timestamp": "2025-06-17T15:40:09Z"
  },
  {
    "title": "Ex-White House officials to testify on who 'really ran the country' during Biden era",
    "description": "Sens. John Cornyn and Eric Schmitt advance probe into former President Joe Biden's alleged cognitive decline, with Wednesday's hearing featuring former White House officials, while Democrats call no witnesses.",
    "link": "https://www.foxnews.com/politics/ex-white-house-officials-testify-who-really-ran-country-during-biden-era",
    "timestamp": "2025-06-17T15:40:08Z"
  },
  {
    "title": "'This moment chose you': Huckabee urges Trump to listen to God as he weighs U.S. role in Israel-Iran war",
    "description": "Israel's ambassador to the U.S., an evangelical pastor, said Trump is perhaps 'the most consequential president' in history, as Vice President Vance noted the president may decide he needs to take 'further action to end Iranian enrichment'",
    "link": "https://www.haaretz.com/israel-news/2025-06-17/ty-article/this-moment-chose-you-huckabee-urges-trump-to-hear-gods-voice-on-israel-iran-war/00000197-7e75-d3ff-a7bf-7ef5a46b0000",
    "timestamp": "2025-06-17T15:40:07Z"
  },
  {
    "title": "Trump is at a moment of choosing as Israel looks for more US help crushing Iran’s nuclear program",
    "description": "Iran insists its nuclear program is peaceful.",
    "link": "https://www.bostonherald.com/2025/06/17/trump-iran-decision/",
    "timestamp": "2025-06-17T15:39:05Z"
  },
  {
    "title": "‘Who the Hell is in Charge?’ Geraldo Slams Trump’s Re-Reversal on ICE Raids — Suggests Stephen ‘Draco’ Miller is Really Running Things",
    "description": "Geraldo Rivera lashed out at his former friend Donald Trump over a re-reversal on ICE raids, even questioning whether Trump is actually in charge.\nThe post ‘Who the Hell is in Charge?’ Geraldo Slams Trump’s Re-Reversal on ICE Raids — Suggests Stephen ‘Draco’ …",
    "link": "https://www.mediaite.com/media/news/who-the-hell-is-in-charge-geraldo-slams-trumps-re-reversal-on-ice-raids-suggests-stephen-draco-miller-is-really-running-things/",
    "timestamp": "2025-06-17T15:39:05Z"
  },
  {
    "title": "ABA sues Trump over 'law firm intimidation policy'",
    "description": "Trump has 'used the vast powers of the executive branch to coerce lawyers,' the lawsuit said",
    "link": "https://theweek.com/politics/aba-trump-lawsuit-law-firms",
    "timestamp": "2025-06-17T15:37:43Z"
  },
  {
    "title": "MAGA Civil War: A Guide to Trump’s Fracturing Coalition Over Iran and Israel",
    "description": "The escalating conflict between Israel and Iran has created a significant split in the now fragile MAGA coalition that President Trump now has to deal with.\nThe post MAGA Civil War: A Guide to Trump’s Fracturing Coalition Over Iran and Israel first appeared o…",
    "link": "https://www.mediaite.com/opinion/maga-civil-war-a-guide-to-trumps-fracturing-coalition-over-iran-and-israel/",
    "timestamp": "2025-06-17T15:37:00Z"
  },
  {
    "title": "The Red Jumpsuit Apparatus Bans Trump Supporters From Their Shows",
    "description": "Ronnie Winter of the Red Jumpsuit Apparatus has told supporters of US President Donald Trump not to come to the band's shows in a new video",
    "link": "https://exclaim.ca/music/article/the-red-jumpsuit-apparatus-bans-trump-supporters-from-their-shows",
    "timestamp": "2025-06-17T15:36:27Z"
  },
  {
    "title": "UK's Starmer: No indication from Trump that U.S. about to enter Iran-Israel conflict",
    "description": "British Prime Minister Keir Starmer stated that U.S. President Donald Trump has not signaled any intention of the United States entering the conflict between Israel and Iran. Starmer emphasized that the G7 statement focused on de-escalation, despite the ongoi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/uks-starmer-no-indication-from-trump-that-u-s-about-to-enter-iran-israel-conflict/articleshow/121913709.cms",
    "timestamp": "2025-06-17T15:35:14Z"
  },
  {
    "title": "‘MyPillow Guy’ Mike Lindell Celebrates as He’s Ordered to Pay $2.3M After Losing Defamation Case, Calls It “Big Win for Our Country!’",
    "description": "He may have just lost his defamation case and $2.3 million, but the \"MyPillow guy\" is keeping a cheery outlook.\nThe post ‘MyPillow Guy’ Mike Lindell Celebrates as He’s Ordered to Pay $2.3M After Losing Defamation Case, Calls It “Big Win for Our Country!’ firs…",
    "link": "https://www.mediaite.com/media/news/mypillow-guy-mike-lindell-celebrates-as-hes-ordered-to-pay-2-3m-after-losing-defamation-case-calls-it-big-win-for-our-country/",
    "timestamp": "2025-06-17T15:35:13Z"
  },
  {
    "title": "TikTok's on the Clock -- Again. Here's What to Know if a Sale Doesn't Go Through",
    "description": "TikTok's sale deadline is approaching once more, so will the app finally be sold or will President Trump just keep extending the deadline every few weeks?",
    "link": "https://www.cnet.com/tech/services-and-software/tiktoks-on-the-clock-again-heres-what-to-know-if-a-sale-doesnt-go-through/",
    "timestamp": "2025-06-17T15:35:00Z"
  },
  {
    "title": "6 Middle-Class Hacks To Shield Your Finances From the Trump vs. Musk Policy Chaos",
    "description": "President Donald Trump and Elon Musk have followed through on their promise to shake things up, but so far the policies have been changing at a head-spinning rate. And while Musk has since departed from the Department of Government Efficiency (DOGE), some of …",
    "link": "https://biztoc.com/x/c15ed416846d6faf",
    "timestamp": "2025-06-17T15:32:32Z"
  },
  {
    "title": "'Illegal' and 'Void': Judge reportedly slams Trump administration NIH cuts",
    "description": "A Reagan-appointed judge tore into the administration’s actions Monday in the latest lower court rebuke in President Donald Trump's second term.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/judge-nih-cuts-trump-william-young-rcna213454",
    "timestamp": "2025-06-17T15:31:56Z"
  },
  {
    "title": "Fight Club Exclusive — Marsha Blackburn 'Strongly Considering' Tennessee Gubernatorial Run",
    "description": "Sen. Marsha Blackburn (R-TN) is \"strongly considering\" a gubernatorial run in her state of Tennessee, the senator confirmed during a Breitbart Fight Club Founders' Roundtable discussion on Monday evening with hosts Alex Marlow and Matthew Boyle.\nThe post Figh…",
    "link": "https://www.breitbart.com/politics/2025/06/17/fight-club-exclusive-marsha-blackburn-strongly-considering-tennessee-gubernatorial-run/",
    "timestamp": "2025-06-17T15:31:05Z"
  },
  {
    "title": "Chaotic G7 Says Goodbye to Trump, Welcomes Zelensky and Modi",
    "description": "The G7 Summit, hosted this year by Canada, is scheduled to continue on Tuesday with the arrivals of Indian Prime Minister Narendra Modi and Ukrainian President Volodymyr Zelensky and focus heavily on the ongoing conflicts in Ukraine and Iran.\nThe post Chaotic…",
    "link": "https://www.breitbart.com/asia/2025/06/17/chaotic-g7-says-goodbye-to-trump-welcomes-zelensky-and-modi/",
    "timestamp": "2025-06-17T15:31:03Z"
  },
  {
    "title": "‘Callous and Horrifying’: Trump Slammed For Urgent Call to Evacuate City of 10 Million People With No Explanation",
    "description": "Trump sparked a wave of anger on Monday evening when he posted a cryptic message on social media urging the residents of Tehran to evacuate immediately.\nThe post ‘Callous and Horrifying’: Trump Slammed For Urgent Call to Evacuate City of 10 Million People Wit…",
    "link": "https://www.mediaite.com/politics/callous-and-horrifying-trump-slammed-for-urgent-call-to-evacuate-city-of-10-million-people-with-no-explanation/",
    "timestamp": "2025-06-17T15:30:32Z"
  },
  {
    "title": "Trump Berated Hegseth After Soldiers Had a 'Good Time' at Military Parade Instead of Appearing 'Menacing,' Author Claims",
    "description": "Donald Trump reportedly berated Pete Hegseth over a military parade that failed to appear \"menacing,\" blaming soldiers for looking too cheerful.",
    "link": "https://www.ibtimes.com/trump-berated-hegseth-after-soldiers-had-good-time-military-parade-instead-appearing-3775967",
    "timestamp": "2025-06-17T15:29:14Z"
  },
  {
    "title": "Germany's Merz says Israel doing 'dirty work for us' in Iran",
    "description": "The German chancellor's support comes amid fresh strikes launched by both Israel and Iran. Meanwhile, in Gaza, dozens were reported killed near a GHF aid distribution site. Follow DW for more.",
    "link": "https://www.dw.com/en/germanys-merz-says-israel-doing-dirty-work-for-us-in-iran/live-72939104",
    "timestamp": "2025-06-17T15:29:00Z"
  },
  {
    "title": "Mitsubishi hiking prices on new US vehicles by average of 2.1%",
    "description": "WASHINGTON :Mitsubishi Motors said Tuesday it is hiking prices of U.S. vehicles by 2.1 per cent on average, the latest automaker to pass along cost increases to consumers as their expenses rise from the Trump administration's tariffs.President Donald Trump in…",
    "link": "https://www.channelnewsasia.com/business/mitsubishi-hiking-prices-new-us-vehicles-average-21-5187716",
    "timestamp": "2025-06-17T15:27:55Z"
  },
  {
    "title": "The Senate’s stablecoin legislation is moving just as fast as crypto itself, but it doesn’t address the elephant in the room: Trump’s conflicts of interest",
    "description": "“The GENIUS Act will be the most significant digital assets legislation ever to pass the U.S. Senate,” said Senate Banking Committee Chair Tim Scott.",
    "link": "https://fortune.com/2025/06/17/genius-act-senate-stablecoin-legislation-trump-conflicts-interest/",
    "timestamp": "2025-06-17T15:27:26Z"
  },
  {
    "title": "Solar stocks are plummeting as the Senate version of Trump's 'big beautiful bill' hits clean energy",
    "description": "Solar energy stocks dropped sharply on Tuesday as the market digested cuts to renewable power tax credits in the Senate's version of the budget bill.",
    "link": "https://www.businessinsider.com/solar-stocks-trump-tax-plan-clean-energy-fslr-sedg-run-2025-6",
    "timestamp": "2025-06-17T15:27:19Z"
  },
  {
    "title": "Israel-Iran ceasefire soon? Donald Trump says he is planning for 'real end'",
    "description": "Donald Trump said that he was eyeing bigger outcome than Iran Israel ceasefire. Will it happen soon?",
    "link": "https://economictimes.indiatimes.com/news/international/us/israel-iran-ceasefire-soon-donald-trump-says-he-is-planning-for-real-end/articleshow/121913474.cms",
    "timestamp": "2025-06-17T15:23:55Z"
  },
  {
    "title": "Without an exit strategy, Israel risks bringing destruction to its doorstep in a war of attrition against Iran",
    "description": "More than 80% of Jewish Israelis support the conflict, researchers say",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/17/without-an-exit-strategy-israel-risks-bringing-destruction-to-its-doorstep-in-a-war-of-attrition-against-iran/",
    "timestamp": "2025-06-17T15:23:37Z"
  },
  {
    "title": "New York Dems make shocking terror claim about Trump's budget cut proposal",
    "description": "House Democrats representing parts of New York City are sending an ominous warning to congressional appropriators.",
    "link": "https://www.foxnews.com/politics/new-york-dems-make-shocking-terror-claim-about-trumps-budget-cut-proposal",
    "timestamp": "2025-06-17T15:23:08Z"
  },
  {
    "title": "Pharmacy Benefit Manager Parasites Drive Drug Costs Ever Higher",
    "description": "President Donald J. Trump is right. Too many pharmaceuticals are too damn high, especially compared to the flea-market prices that foreign patients pay for the same drugs. Dr. Wayne... Read More\nThe post Pharmacy Benefit Manager Parasites Drive Drug Costs Eve…",
    "link": "https://www.dailysignal.com/2025/06/17/high-pharmacy-benefit-manager-fees-contribute-to-rising-pharmaceutical-prices/",
    "timestamp": "2025-06-17T15:22:34Z"
  },
  {
    "title": "Democrats Should Reclaim the Anti-war Mantle From Trump",
    "description": "By backing Israel’s attack on Iran, Trump violated his anti-war pledge. Will his opponents take advantage of it?",
    "link": "http://foreignpolicy.com/2025/06/17/democrats-iran-trump-peace/",
    "timestamp": "2025-06-17T15:22:03Z"
  },
  {
    "title": "The D Brief: Israel’s new war aim; NATO’s new concepts; China’s drones; Misinfo follows MN murders; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/06/the-d-brief-june-17-2025/406125/",
    "timestamp": "2025-06-17T15:20:57Z"
  },
  {
    "title": "WATCH LIVE: State Department holds briefing as Trump leaves G7 early amid intensifying Israel-Iran conflict",
    "description": "Deepening American involvement, perhaps by offering direct U.S. military support, comes with enormous political risk for President Donald Trump.",
    "link": "https://biztoc.com/x/9c7e7c25e8b18393",
    "timestamp": "2025-06-17T15:20:55Z"
  },
  {
    "title": "President Donald Trump suggests he’ll extend deadline for TikTok’s Chinese owner to sell app",
    "description": "President Donald Trump suggested on Tuesday that he would likely extend a deadline for TikTok’s Chinese owner to divest the popular video sharing app.\nTrump had signed an order in early April to keep TikTok running for another 75 days after a potential deal t…",
    "link": "https://biztoc.com/x/3c31c34c2f1d1c04",
    "timestamp": "2025-06-17T15:20:37Z"
  },
  {
    "title": "Trump leaves G7 early, warns Tehran to evacuate",
    "description": "What happened\nPresident Donald Trump returned to Washington from Canada early Tuesday morning, leaving the G7 summit in Alberta a day early \"because of what's going on in the Middle East,\" White House press secretary Karoline Leavitt said Monday night. Trump …",
    "link": "https://biztoc.com/x/ba9bfb41f2b99d0b",
    "timestamp": "2025-06-17T15:20:32Z"
  },
  {
    "title": "The violence and incitement are coming from Trump (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nThe violence and incitement are coming from Trump  —  Donald Trump twists language, as do all autocrats, to cast himself and his cult as victims, whereas his dissenters are violent, rebellious, and threatening.  In the real wo…",
    "link": "https://www.memeorandum.com/250617/p66",
    "timestamp": "2025-06-17T15:20:00Z"
  },
  {
    "title": "As Rumors Fly, Elon Musk's Posts \"Results\" of Drug Test for PCP, Benzos and More",
    "description": "Late last month, the New York Times published an eyebrow-raising article, with sources claiming that billionaire Elon Musk was traveling with a \"daily medication box that held about 20 pills.\" The mercurial CEO has long been known to indulge in drugs, includi…",
    "link": "https://futurism.com/elon-musk-drug-test-pcp-benzos",
    "timestamp": "2025-06-17T15:18:50Z"
  },
  {
    "title": "Minnesota senators shooting: Donald Trump says talking to Governor Tim Walz is wasting of time",
    "description": "Following the tragic shooting deaths of two Minnesota state legislators and their spouses, President Trump sparked controversy by refusing to contact Governor Tim Walz. Trump dismissed Walz as \"slick\" and \"whacked out,\" deeming a call a \"waste of time.\" While…",
    "link": "https://economictimes.indiatimes.com/news/international/us/minnesota-senators-shooting-donald-trump-says-talking-to-governor-tim-walz-is-wasting-of-time/articleshow/121913125.cms",
    "timestamp": "2025-06-17T15:18:41Z"
  },
  {
    "title": "Speculation Abounds Over Tulsi Gabbard’s Future After Trump Publicly Rebukes Her On Iran: How is Her Job ‘Tenable?’",
    "description": "Speculation is mounting over the future of DNI Tulsi Gabbard’s future after Trump publicly dismissed her assessment that Iran was not pursuing a nuclear weapon.\nThe post Speculation Abounds Over Tulsi Gabbard’s Future After Trump Publicly Rebukes Her On Iran:…",
    "link": "https://www.mediaite.com/media/news/speculation-abounds-over-tulsi-gabbards-future-after-trump-publicly-rebukes-her-on-iran-how-is-her-job-tenable/",
    "timestamp": "2025-06-17T15:18:39Z"
  },
  {
    "title": "President Trump says TikTok deadline will ‘probably' be extended again",
    "description": "TikTok may get another lifeline to continue its operation in the U.S., as President Trump hints at extending the deadline once again. Read more...",
    "link": "https://www.neowin.net/news/president-trump-says-tiktok-deadline-will-probably-be-extended-again/",
    "timestamp": "2025-06-17T15:18:01Z"
  },
  {
    "title": "The Urge To Isolationism Isn’t New",
    "description": "This exaltation of self-sufficiency and the downgrading of the value of trading links amounts to a profound break from the orthodoxy of globalisation – the idea that ever-greater interconnections between nations through trade would enhance the security and pr…",
    "link": "https://aeon.co/essays/isolationism-isnt-new-and-is-fuelled-by-deep-human-desires",
    "timestamp": "2025-06-17T15:18:00Z"
  },
  {
    "title": "Pressed on Gabbard’s Iran assessment, Trump says, ‘I don’t care what she said’",
    "description": "Tulsi Gabbard, Donald Trump's own DNI, said Iran is not building a nuclear weapon. The president said he doesn't care what she thinks.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-iran-nuclear-weapon-tulsi-gabbard-rcna213476",
    "timestamp": "2025-06-17T15:17:39Z"
  },
  {
    "title": "Mortgage Rates and the Fed: Everything to Know Before Tomorrow's Decision",
    "description": "Homebuyers are waiting for lower mortgage rates, but the Fed's decisions are keeping them on hold.",
    "link": "https://www.cnet.com/personal-finance/mortgages/mortgage-rates-and-the-fed-everything-to-know-before-tomorrows-decision/",
    "timestamp": "2025-06-17T15:16:33Z"
  },
  {
    "title": "Trump leaves G7 early, warns Tehran to evacuate",
    "description": "Trump claimed to have left the summit due to ongoing issues in the Middle East",
    "link": "https://theweek.com/politics/trump-leaves-g7-early",
    "timestamp": "2025-06-17T15:16:28Z"
  },
  {
    "title": "“I Don’t Care What She Said” — Trump Publicly Rebukes His Own Intelligence Chief Tulsi Gabbard on Iran’s Nuclear Capabilities",
    "description": "President Donald Trump publicly dismissed his own Director of National Intelligence, Tulsi Gabbard, on Iran’s nuclear capabilities.\nThe post “I Don’t Care What She Said” — Trump Publicly Rebukes His Own Intelligence Chief Tulsi Gabbard on Iran’s Nuclear Capab…",
    "link": "https://www.thegatewaypundit.com/2025/06/i-dont-care-what-she-said-trump-publicly/",
    "timestamp": "2025-06-17T15:15:42Z"
  },
  {
    "title": "R. Kelly Seeks Trump Pardon As Prosecutors Dismiss His Claims Prison Staff Trying To Kill Him",
    "description": "R. Kelly’s lawyers have claimed prison staff gave him excessive amounts of drugs so that he would overdose and attempted to enlist an inmate to murder Kelly.",
    "link": "https://www.forbes.com/sites/conormurray/2025/06/17/r-kelly-seeks-trump-pardon-as-prosecutors-dismiss-his-claims-prison-staff-trying-to-kill-him/",
    "timestamp": "2025-06-17T15:14:22Z"
  },
  {
    "title": "Fundraiser for Killed 'No Kings' Protester Jumps $300K in One Day",
    "description": "Donations have flooded in for the widow and children of an innocent bystander killed by a stray bullet during an anti-Trump demonstration in Utah.",
    "link": "https://www.newsweek.com/donations-ah-loo-no-kings-protester-killed-2086736",
    "timestamp": "2025-06-17T15:12:35Z"
  },
  {
    "title": "WATCH LIVE: State Department holds briefing as Trump leaves G7 early amid intensifying Israel-Iran conflict",
    "description": "Deepening American involvement, perhaps by offering direct U.S. military support, comes with enormous political risk for President Donald Trump.",
    "link": "https://www.pbs.org/newshour/world/watch-live-state-department-holds-briefing-as-trump-leaves-g7-early-amid-intensifying-israel-iran-conflict",
    "timestamp": "2025-06-17T15:12:14Z"
  },
  {
    "title": "Trump Won't 'Waste Time' Calling Tim Walz After Minnesota Assassination",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said he would not call \"whacked out\" Minnesota Governor Tim Walz following the assassination of state Representative Melissa Hortman and the attempted assassination of state Senator John…",
    "link": "https://biztoc.com/x/6bfe556f17ca3295",
    "timestamp": "2025-06-17T15:10:05Z"
  },
  {
    "title": "No Kings, Just Water",
    "description": "What happened in downtown Los Angeles before the cops decided to crack skulls?",
    "link": "https://gizmodo.com/no-kings-just-water-2000616086",
    "timestamp": "2025-06-17T15:10:02Z"
  },
  {
    "title": "Mexico: Sheinbaum-Trump meeting to happen later",
    "description": "Mexico's Secretary of the Interior Rosa Icela Rodriguez (pictured) announced on Tuesday that the meeting between President Claudia Sheinbaum and US President Donald Trump will take place at a later da...",
    "link": "https://biztoc.com/x/217d56756b55c924",
    "timestamp": "2025-06-17T15:09:53Z"
  },
  {
    "title": "Trump: Iran Knows Where to Find Me",
    "description": "President Donald Trump on Tuesday denied initiating any peace talks with Iran, saying it is up to Tehran to reach out if it wants negotiations. \n\"I have not reached out to Iran for 'peace talks' in any way, shape, or form,\" Trump wrote on Truth Social. \"They …",
    "link": "https://biztoc.com/x/eb9c80ec118d13bb",
    "timestamp": "2025-06-17T15:09:42Z"
  },
  {
    "title": "Exclusive-US pulls out of two more bases in Syria, worrying Kurdish forces",
    "description": "AL SHADADI BASE, Syria (Reuters) -U.S. forces have pulled out of two more bases in northeastern Syria, visiting Reuters reporters found, accelerating a troop...",
    "link": "https://www.yahoo.com/news/exclusive-us-pulls-two-more-150927379.html",
    "timestamp": "2025-06-17T15:09:27Z"
  },
  {
    "title": "Stephen Colbert, Jimmy Kimmel Mock U.S. Army 250th Anniversary Parade: 'Big, Stupid, and Boring'",
    "description": "President Donald Trump showered praise on America’s soldiers for their sacrifices on Saturday during the 250th anniversary parade, celebrating the U.S. Army while the left-wing late-night hosts Jimmy Kimmel and Stephen Colbert mocked and ridiculed the event. …",
    "link": "https://www.breitbart.com/entertainment/2025/06/17/stephen-colbert-jimmy-kimmel-mock-u-s-army-250th-birthday-parade-as-big-stupid-and-boring/",
    "timestamp": "2025-06-17T15:09:18Z"
  },
  {
    "title": "Top Iranian Military Official Eliminated Days After Israel Took Out Predecessor",
    "description": "Israel has killed one of Iran’s most senior military officials, just days after he replaced his slain predecessor.",
    "link": "https://dailycaller.com/2025/06/17/top-iranian-military-official-eliminated-days-after-israel-took-out-predecessor/",
    "timestamp": "2025-06-17T15:06:58Z"
  },
  {
    "title": "Trump Won't 'Waste Time' Calling Tim Walz After Minnesota Assassination",
    "description": "Following the fatal shooting of Minnesota Rep. Melissa Hortman and her husband, the president called Gov. Tim Walz \"whacked out.\"",
    "link": "https://www.newsweek.com/trump-wont-waste-time-calling-tim-walz-after-minnesota-assassination-2086680",
    "timestamp": "2025-06-17T15:06:24Z"
  },
  {
    "title": "Kanye West can now return to the Diddy trial and actually be allowed in the courtroom this time",
    "description": "Ye, the rapper formerly known as Kanye West, has been officially added to Sean \"Diddy\" Combs' friends and family trial guest list.",
    "link": "https://www.businessinsider.com/kanye-west-sean-diddy-combs-sex-trafficking-trial-courtroom-access-2025-6",
    "timestamp": "2025-06-17T15:05:57Z"
  },
  {
    "title": "How America’s ideal woman got jacked",
    "description": "A lot of people are getting jacked these days, and it’s not just who you would think. For men, muscles have always been a symbol of brute strength and power. In our current era, that’s manifesting in their desire to get as chiseled as possible with a strict r…",
    "link": "https://www.vox.com/culture/417063/women-muscles-strength-weight-training-casey-johnston-amy-larocca-bonnie-tsui",
    "timestamp": "2025-06-17T15:04:05Z"
  },
  {
    "title": "Trump Has Vile New Response to Minnesota Shooting",
    "description": "Breaking a long-standing presidential tradition, Donald Trump says he won’t contact Minnesota Governor Tim Walz after the assassination of Democratic state Representative Melissa Hortman. Instead, the president said that contacting Walz would be a “waste of t…",
    "link": "https://newrepublic.com/post/196906/donald-trump-tim-walz-response-minnesota-shooting",
    "timestamp": "2025-06-17T15:03:54Z"
  },
  {
    "title": "Israel’s air game is strong but the final blow still needs US backup as Iran’s biggest bomb risk Fordow lives on",
    "description": "Israel’s air campaign over Iran has demonstrated its unmatched aerial reach, with strikes hitting nuclear sites and top commanders. Officials in Tel Aviv now say they control Iranian skies, but experts warn that without U.S. support, they cannot take out Iran…",
    "link": "https://economictimes.indiatimes.com/news/defence/israels-air-game-is-strong-but-the-final-blow-still-needs-us-backup-as-irans-biggest-bomb-risk-fordow-lives-on/articleshow/121913123.cms",
    "timestamp": "2025-06-17T15:03:50Z"
  },
  {
    "title": "Wall Street analyst spells out Fed’s next interest rate move",
    "description": "The Fed is holding the FOMC meeting on June 17-18.",
    "link": "https://www.thestreet.com/crypto/markets/wsj-says-good-reasons-fed-preparing-to-cut-interest-rates-if-not-for",
    "timestamp": "2025-06-17T15:02:59Z"
  },
  {
    "title": "How much damage has Israel inflicted on Iran’s nuclear programme?",
    "description": "Israel’s strikes on Iran have targeted several of its nuclear facilities as it claims the country is seeking to develop nuclear weapons — an accusation Tehran denies. Experts told AFP that while the attacks had caused some damage to Iran’s nuclear programme, …",
    "link": "https://www.digitaljournal.com/world/how-much-damage-has-israel-inflicted-on-irans-nuclear-programme/article",
    "timestamp": "2025-06-17T15:02:20Z"
  },
  {
    "title": "R. Kelly Suffers Overdose In Prison, His Lawyer Claims",
    "description": "R. Kelly recently suffered an overdose due to medication given to him by prison staff, his attorney claims.",
    "link": "https://www.vibe.com/news/entertainment/r-kelly-suffers-overdose-in-prison-his-lawyer-claims-1235078758/",
    "timestamp": "2025-06-17T15:01:48Z"
  },
  {
    "title": "Netanyahu Will Not Rule Out Assassination of Iranian Ruler",
    "description": "Israeli Prime Minister Benjamin Netanyahu has refused to rule out an assassination of Iranian Supreme Leader Ali Khamenei as the clash between the two nations continues to escalate. Israel's ruler has claimed that taking out Khamenei would end the war.",
    "link": "https://www.shtfplan.com/headline-news/netanyahu-will-not-rule-out-assassination-of-iranian-ruler",
    "timestamp": "2025-06-17T15:00:53Z"
  },
  {
    "title": "LIVE: Federal appeals court considers Trump’s deployment of National Guard to Los Angeles",
    "description": "In his lawsuit, Gov. Gavin Newsom accused the president of inflaming tensions, breaching state sovereignty and wasting resources. The Trump administration argued the deployment was necessary to restore order and protect federal buildings and officers.",
    "link": "https://www.pbs.org/newshour/politics/live-federal-appeals-court-considers-trumps-deployment-of-national-guard-to-los-angeles",
    "timestamp": "2025-06-17T15:00:49Z"
  },
  {
    "title": "Sen. Tammy Duckworth Calls Trump a ‘Dictator Wannabe’ Then Says We Have to Tone Down Rhetoric",
    "description": "\"So, if you truly wanted to celebrate the army's 250th birthday, then spend the money the correct way, not with a parade for a tinpot dictator wannabe, which is what Donald Trump is.\"\nThe post Sen. Tammy Duckworth Calls Trump a ‘Dictator Wannabe’ Then Says We…",
    "link": "https://legalinsurrection.com/2025/06/sen-tammy-duckworth-calls-trump-a-dictator-wannabe-then-says-we-have-to-tone-down-rhetoric/",
    "timestamp": "2025-06-17T15:00:30Z"
  },
  {
    "title": "US stock market today: Dow, S&P 500, Nasdaq drop as weak US spending data and Iran-Israel fears send oil soaring — is a Fed rate cut coming next?",
    "description": "US Stocks Market fall as weak US retail sales, housing, and industrial data add to fears of a slowdown, while Middle East tensions rise with growing pressure from the US and Israel on Iran. Investors are now betting on possible Federal Reserve rate cuts later…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-dow-sp-500-nasdaq-drop-as-weak-us-spending-data-and-iran-israel-fears-send-oil-soaring-is-a-fed-rate-cut-coming-next/articleshow/121913034.cms",
    "timestamp": "2025-06-17T15:00:29Z"
  },
  {
    "title": "The White House Wants to Numb Voters to This (Ronald Brownstein/Bloomberg)",
    "description": "Ronald Brownstein / Bloomberg:\nThe White House Wants to Numb Voters to This  —  Trump portrays Democratic-led states and cities as un-American, aiming to normalize treating them like the enemy.  —  One major American city in turmoil was apparently insufficien…",
    "link": "https://www.memeorandum.com/250617/p62",
    "timestamp": "2025-06-17T15:00:27Z"
  },
  {
    "title": "Constitutional law professor Anthony Kreis: Trump wants ‘strategic chaos’ to dismantle institutions",
    "description": "Anti-ICE protesters demonstrate in front of the Federal Building following the No Kings protest in Los Angeles on June 14. – Alle Rechte vorbehalten IMAGO / NurPhoto\r\nU.S. President Donald Trump is increasingly behaving like a monarch. But across the United S…",
    "link": "https://netzpolitik.org/2025/constitutional-law-professor-anthony-kreis-trump-wants-strategic-chaos-to-dismantle-institutions/",
    "timestamp": "2025-06-17T15:00:23Z"
  },
  {
    "title": "Blistering report calls for investigation into 5 'woke' hospitals pushing 'radical' agenda with taxpayer money",
    "description": "A blistering new report highlights five hospitals across the country that the group says is promoting \"woke\" ideology over patient care with federal dollars.",
    "link": "https://www.foxnews.com/politics/blistering-report-calls-for-investigation-into-5-woke-hospitals-pushing-radical-agenda-with-taxpayer-money",
    "timestamp": "2025-06-17T15:00:17Z"
  },
  {
    "title": "Steve Bannon Hammers Fox News: If You Work There, You’re Not ‘True MAGA’",
    "description": "The war of words between America First isolationists and the pro-Israel interventionists is ramping up to dangerous levels of invective for former allies.\nThe post Steve Bannon Hammers Fox News: If You Work There, You’re Not ‘True MAGA’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/steve-bannon-hammers-fox-news-if-you-work-there-youre-not-true-maga/",
    "timestamp": "2025-06-17T15:00:15Z"
  },
  {
    "title": "'Grow up': Newsom slams Trump after DOJ rules it can strip Biden-era protections from CA lands",
    "description": "Justice Department memo confirms presidential authority to rescind national monument status on federal lands.",
    "link": "https://www.foxnews.com/politics/grow-up-newsom-slams-trump-after-doj-rules-can-strip-biden-era-protections-from-ca-lands",
    "timestamp": "2025-06-17T15:00:15Z"
  }
]