[
  {
    "title": "Trump signs executive order banning transgender athletes from women's sports, directing DOJ to enforce - ABC News",
    "description": "Trump signs executive order banning transgender athletes from women's sports, directing DOJ to enforceABC News Trump takes action to ban transgender women from women’s sportsCNN Donald Trump signs executive order banning transgender athletes from women’s spor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176135839",
    "timestamp": "2025-02-06T00:33:12Z"
  },
  {
    "title": "Trump Won’t Stop California’s Clean Power Push, Official Says",
    "description": "California’s all-out push to decarbonize its economy will succeed despite President Donald Trump’s efforts to block climate action, one of the state’s top energy regulators said Wednesday.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-wont-stop-californias-clean-power-push-official-says",
    "timestamp": "2025-02-06T00:32:47Z"
  },
  {
    "title": "Ben Stiller Debunks Elon Musk-Amplified Tweet Claiming Actor Took USAID Money For Ukraine Trip",
    "description": "“These are lies coming from Russian media,” wrote Ben Stiller about a video posted on X alleging USAID spent $4 million to send the actor on a highly-publicized visit to Ukraine after the Russian invasion. “I completely self-funded my humanitarian trip to Ukr…",
    "link": "http://deadline.com/2025/02/ben-stiller-usaid-money-ukraine-trip-1236279748/",
    "timestamp": "2025-02-06T00:32:02Z"
  },
  {
    "title": "Rashida Tlaib melts down over Trump solution for Gaza: 'Spew this fanatical bulls***'",
    "description": "Democratic Rep. Rashida Tlaib of Michigan had a fiery response to the suggestion by President Donald Trump that the U.S. would take over the Gaza Strip after resettling the Palestinians out of the war-torn region. Trump made the comments to reporters after me…",
    "link": "https://www.theblaze.com/news/trump-gaza-tlaib-plan-israel",
    "timestamp": "2025-02-06T00:30:00Z"
  },
  {
    "title": "US officials now say Trump only wants to displace Palestinians from Gaza temporarily",
    "description": "President Donald Trump's top diplomat and his main spokesperson on Wednesday walked back the idea that he wants the permanent relocation of Palestinians from Gaza.",
    "link": "https://roanoke.com/news/nation-world/government-politics/trump-gaza-palestinian-refugees/article_6d3d598c-e5b7-56eb-b04a-dd6c4cd0f0fb.html",
    "timestamp": "2025-02-06T00:30:00Z"
  },
  {
    "title": "ET Interview: Look to invest, explore large tieups in India",
    "description": "Sam Altman, who’s on a trip through Asia, said he’s open to partnering with local startups to facilitate the development of indigenous large language models (LLMs) and is looking to make investments in India.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/et-interview-look-to-invest-explore-large-tieups-in-india/articleshow/117958117.cms",
    "timestamp": "2025-02-06T00:30:00Z"
  },
  {
    "title": "NOAA Employees Told to Pause Work With ‘Foreign Nationals’",
    "description": "An internal email obtained by WIRED shows that NOAA workers received orders to pause all “ALL INTERNATIONAL ENGAGEMENTS.”",
    "link": "https://www.wired.com/story/noaa-employees-foreign-nationals/",
    "timestamp": "2025-02-06T00:29:35Z"
  },
  {
    "title": "Trump torpedoed the Iran nuclear deal. Now he's calling for another one",
    "description": "President Donald Trump expressed his intention to negotiate a 'verified nuclear peace agreement' with Iran, aiming to prevent Tehran from obtaining an atomic weapon and avoid military conflict. This comes after his announcement to reinstate the 'maximum press…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-torpedoed-the-iran-nuclear-deal-now-hes-calling-for-another-one/articleshow/117964564.cms",
    "timestamp": "2025-02-06T00:29:23Z"
  },
  {
    "title": "Palestinians have long resisted resettlement – Trump’s plan to ‘clean out’ Gaza won’t change that",
    "description": "For almost 80 years, Palestinians in Gaza have resisted proposals to resettle elsewhere.",
    "link": "https://theconversation.com/palestinians-have-long-resisted-resettlement-trumps-plan-to-clean-out-gaza-wont-change-that-249193",
    "timestamp": "2025-02-06T00:28:49Z"
  },
  {
    "title": "President Trump offers Palestinians a chance for peace and prosperity",
    "description": "President Donald Trump is taking a leadership role in the Middle East and offering the Palestinians a chance at peace.",
    "link": "https://www.foxnews.com/opinion/president-trump-offers-palestinians-chance-peace-prosperity",
    "timestamp": "2025-02-06T00:28:42Z"
  },
  {
    "title": "What to know about Trump, Musk and the dismantling of USAID",
    "description": "Taking action against the foreign aid agency legally requires an act of Congress.",
    "link": "https://www.snopes.com//news/2025/02/05/trump-elon-musk-dismantling-usaid/",
    "timestamp": "2025-02-06T00:28:00Z"
  },
  {
    "title": "World Inflation Is at Risk of Rekindling With Trump’s Trade War",
    "description": "The more President Donald Trump threatens tariffs on the US’s trading partners, the more the worry of another inflation wave troubles global economists.",
    "link": "https://financialpost.com/pmn/business-pmn/world-inflation-is-at-risk-of-rekindling-with-trumps-trade-war",
    "timestamp": "2025-02-06T00:27:47Z"
  },
  {
    "title": "Dutton praises ‘shrewd’ and ‘reasonable’ Trump on Gaza",
    "description": "The opposition leader said Trump was a \"big thinker and a deal maker\" with a \"genuine desire to see peace and stability\".",
    "link": "https://www.abc.net.au/news/2025-02-06/dutton-praises-trump-gaza-comments/104903796",
    "timestamp": "2025-02-06T00:26:22Z"
  },
  {
    "title": "Trump signs executive order banning trans women from women’s sports",
    "description": "President Donald Trump signed an executive order Wednesday, Feb. 5,  prohibiting transgender women and girls from competing in female sports.",
    "link": "https://www.today.com/news/politics/trump-signs-executive-order-banning-trans-women-womens-sports-rcna190916",
    "timestamp": "2025-02-06T00:26:18Z"
  },
  {
    "title": "Trump 'Not Committed' to Sending US Troops to Gaza: White House",
    "description": "President Donald Trump made it sound logical and straightforward. The US, the most powerful country on Earth, would take over the Gaza Strip after a year and a half of devastating war, remove its damaged buildings and unexploded ordnance, and rebuild the plac…",
    "link": "https://biztoc.com/x/2c01801e9f5660a8",
    "timestamp": "2025-02-06T00:26:13Z"
  },
  {
    "title": "Ford CEO calls for 'comprehensive' tariff analysis for all countries",
    "description": "Farley singled out imports from Japan and South Korea that have little to no duties compared to the 25% tariff threatened on Canada and Mexico.",
    "link": "https://www.cnbc.com/2025/02/05/ford-ceo-calls-for-comprehensive-tariff-analysis-for-all-countries.html",
    "timestamp": "2025-02-06T00:24:46Z"
  },
  {
    "title": "How Trump’s EPA threatens efforts to clean areas affected most by dangerous air pollution",
    "description": "by Lisa SongProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.More than three years ago, ProPublica spotlighted America’s “sacrifice zones,” where communities in …",
    "link": "https://www.rawstory.com/trump-epa/",
    "timestamp": "2025-02-06T00:24:23Z"
  },
  {
    "title": "‘Reflecting Biological Reality’: Education Department Publishes New College Student Aid Form",
    "description": "The Department of Education released an updated version of its Free Application for Federal Student Aid, commonly referred to as FAFSA, to better align with... Read More\nThe post ‘Reflecting Biological Reality’: Education Department Publishes New College Stud…",
    "link": "https://www.dailysignal.com/2025/02/05/reflecting-biological-reality-education-department-publishes-new-college-student-aid-form/",
    "timestamp": "2025-02-06T00:24:05Z"
  },
  {
    "title": "Transgender Surgery Subreddit Disappearing Sparks Panic",
    "description": "People part of a subreddit titled \"r/Transgender_Surgeries\" had a scare Wednesday after their community briefly disappeared.",
    "link": "https://www.newsweek.com/transgender-surgery-subreddit-disappearing-bug-2026965",
    "timestamp": "2025-02-06T00:22:53Z"
  },
  {
    "title": "Temu steers users to 'local' products after Trump shuts tax loophole",
    "description": "Temu has onboarded more sellers with U.S. inventory in recent years as lawmakers have zeroed in on the de minimis exemption.",
    "link": "https://www.cnbc.com/2025/02/05/temu-steers-users-to-local-products-after-trump-ends-de-minimis.html",
    "timestamp": "2025-02-06T00:22:51Z"
  },
  {
    "title": "Bill Gates says he will leave the USA if the Epstein Client List is released.",
    "description": "What's your reaction??",
    "link": "https://freerepublic.com/focus/f-chat/4295317/posts",
    "timestamp": "2025-02-06T00:22:09Z"
  },
  {
    "title": "FBI turns over details of 5,000 employees who worked on Jan 6 cases",
    "description": "The FBI has reportedly provided the details but no names of the agents involved in the Capitol riot investigations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612250-fbi-agents-capitol-riots/",
    "timestamp": "2025-02-06T00:21:53Z"
  },
  {
    "title": "BEAUTIFUL! President Trump Signs Executive Order Protecting Women’s Sports Surrounded by Little Girls (VIDEO)",
    "description": "President Trump champions women's sports with a significant executive order, joined by young girls, highlighting a pivotal moment in the ongoing national conversation about gender equality in athletics.\nThe post BEAUTIFUL! President Trump Signs Executive Orde…",
    "link": "https://www.thegatewaypundit.com/2025/02/beautiful-president-trump-signs-executive-order-protecting-womens/",
    "timestamp": "2025-02-06T00:20:57Z"
  },
  {
    "title": "US Marine vet acquitted in NY subway death joins tech firm",
    "description": "A US Marine veteran who was acquitted in the chokehold death of a homeless man on the New York subway -- a high-profile case highlighting the divisive issue of race in America -- has been hired by a major Silicon Valley firm allied with Donald Trump.Californi…",
    "link": "https://www.rawstory.com/daniel-penny-2671104099/",
    "timestamp": "2025-02-06T00:20:48Z"
  },
  {
    "title": "How “America” became God and Satan in Nigeria",
    "description": "In a recent interview, ex-Osun Governor, Chief Bisi Akande, alleged that the #EndSARS movement that roiled Nigeria in 2020 was a conspiracy against his friend, Bola Tinubu. By narrating how a set of circumstances that did not begin with Tinubu became wrapped …",
    "link": "https://punchng.com/how-america-became-god-and-satan-in-nigeria/",
    "timestamp": "2025-02-06T00:20:14Z"
  },
  {
    "title": "Out of power, Democratic lawmakers take to the streets to rally opposition to Trump",
    "description": "WASHINGTON — Democratic lawmakers are staging protests outside federal agencies, holding resistance-themed news conferences back home and taking to social media as they try to combat President Donald Trump’s moves to remake the government with executive power.",
    "link": "https://www.nbcnews.com/politics/congress/power-democratic-lawmakers-take-streets-rally-opposition-trump-rcna190842",
    "timestamp": "2025-02-06T00:20:13Z"
  },
  {
    "title": "US top diplomat Rubio will not attend G20 meet in South Africa",
    "description": "WASHINGTON (Reuters) - U.S. Secretary of State Marco Rubio will not attend the G20 meeting in South Africa, the top U.S. diplomat said on Wednesday, days after President Donald Trump threatened to cut off funding to the African country. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/06/us-top-diplomat-rubio-will-not-attend-g20-meet-in-south-africa",
    "timestamp": "2025-02-06T00:18:00Z"
  },
  {
    "title": "Tariffs to Drive Global Markets in Volatile 2025, JPMorgan Finds",
    "description": "Global financial-market turbulence this week sparked by a series of US tariff announcements looks like just the beginning of a volatile year, according to a JPMorgan Chase & Co. electronic trading survey.",
    "link": "https://financialpost.com/pmn/business-pmn/tariffs-to-drive-global-markets-in-volatile-2025-jpmorgan-finds",
    "timestamp": "2025-02-06T00:17:38Z"
  },
  {
    "title": "At least five Americans still jailed in Venezuela: NGO",
    "description": "At least five US citizens remain in detention in Venezuela since the liberation last week of six others who flew back home with President Donald Trump's special envoy, a local rights group said Wednesday.Along with the five, there were also two people with ot…",
    "link": "https://www.rawstory.com/venezuelan-americans/",
    "timestamp": "2025-02-06T00:17:36Z"
  },
  {
    "title": "'Angry', 'numb' - Palestinian Americans on Trump's Gaza comments",
    "description": "Donald Trump's proposition to \"take control\" of Gaza has caused outrage in the Palestinian-American community.",
    "link": "https://www.bbc.com/news/articles/c2egvv8mk79o",
    "timestamp": "2025-02-06T00:16:23Z"
  },
  {
    "title": "Trump's remarks on Gaza draw wide criticism in Europe",
    "description": "Palestinian patients wait to leave for Rafah crossing at Al-Shifa Hospital in Gaza City, on Feb. 1,",
    "link": "http://en.people.cn/n3/2025/0206/c90000-20272813.html",
    "timestamp": "2025-02-06T00:15:42Z"
  },
  {
    "title": "Nancy Pelosi to Face 2026 Challenge from Former AOC Chief of Staff",
    "description": "Rep. Nancy Pelosi, the longest-serving member of California's US House delegation, will now face a 2026 midterm challenge.",
    "link": "https://www.newsweek.com/nancy-pelosi-face-2026-challenge-former-aoc-chief-staff-2026985",
    "timestamp": "2025-02-06T00:15:25Z"
  },
  {
    "title": "Google scraps diversity 'aspirations,' citing role as federal contractor",
    "description": "Google is scrapping its diversity goals, becoming the latest tech giant to alter its approach to hiring and promotions following the election of President Donald Trump.\nIn its annual report published on Wednesday, Alphabet excluded language from prior years s…",
    "link": "https://biztoc.com/x/c858432a8a157360",
    "timestamp": "2025-02-06T00:15:19Z"
  },
  {
    "title": "Argentina says it will pull out of World Health Organization, mirroring Trump’s move last month - NewsBreak",
    "description": "Argentina has announced it will pull out of the World Health Organization (WHO), mirroring a similar move by US President Donald Trump last month.",
    "link": "https://www.newsbreak.com/share/3792244119211-argentina-says-it-will-pull-out-of-world-health-organization-mirroring-trump-s-move-last-month?s=a2&amp;share_destination_id=MjMxNjEzMDUyLTE3Mzg4MDA4NjczMzg%3D&amp;pd=0Ffp8Oax&amp;hl=en_US&amp;send_time=1738800867&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v6%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v9",
    "timestamp": "2025-02-06T00:15:08Z"
  },
  {
    "title": "Federal judge issues injunction on birthright citizenship, putting it further on hold",
    "description": "The preliminary injunction is the second temporary hold against Trump’s executive order and puts efforts to end birthright citizenship on indefinite pause.",
    "link": "https://www.nbcnews.com/news/birthright-citizenship-second-injunction-indefinite-boardman-rcna190887",
    "timestamp": "2025-02-06T00:13:55Z"
  },
  {
    "title": "Trump’s Federal Buyout Offer Expires Tomorrow—As Over 40,000 Staff Agree To Leave: Here’s What To Know",
    "description": "The CIA, which was initially exempt from the offer, reportedly extended the buyout option to its employees on Tuesday.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/05/trumps-federal-buyout-offer-expires-tomorrow-as-over-40000-staff-agree-to-leave-heres-what-to-know/",
    "timestamp": "2025-02-06T00:13:52Z"
  },
  {
    "title": "Data Suggests Another Army Helicopter Flew Above D.C. Maximum Altitude Before Crash",
    "description": "But that data, like the radar information from last week's deadly crash, doesn't tell the whole story.",
    "link": "https://www.huffpost.com/entry/flight-data-helicopter-altitude-speculation_n_67a3b6e1e4b0bfc253ffc739",
    "timestamp": "2025-02-06T00:13:26Z"
  },
  {
    "title": "Achieving a lasting victory: Israel must defeat Hamas and break free of their trap",
    "description": "Hamas’s strategic manipulation of the hostage situation reveals a disturbing truth: military superiority doesn’t guarantee strategic victory.",
    "link": "https://www.jpost.com/opinion/article-840849",
    "timestamp": "2025-02-06T00:12:45Z"
  },
  {
    "title": "Protesters across the US rally against Trump administration policies",
    "description": "The grassroots effort has been organized across social media sites using hashtags #buildtheresistance and #50501, calling on Americans to \"fight fascism.\"",
    "link": "https://abcnews.go.com/US/anti-trump-protests-nationwide/story?id=118501194",
    "timestamp": "2025-02-06T00:11:38Z"
  },
  {
    "title": "The shocking collapse of the Left’s empire of lies",
    "description": "Over the last 30 years, 'the elites came to mimic, if anyone, the French Jacobins'",
    "link": "https://www.wnd.com/2025/02/the-shocking-collapse-of-the-lefts-empire-of-lies/",
    "timestamp": "2025-02-06T00:10:41Z"
  },
  {
    "title": "Trump ally tells Bannon feminists dream of a 'disgusting, unappealing androgynous world'",
    "description": "The president of the conservative American Principles Project aimed at women's rights supporters in an eyebrow-raising rant Wednesday where he complained their goal is “to destroy gender.”Terry Schilling, a staunch supporter of President Donald Trump, deliver…",
    "link": "https://www.rawstory.com/trans-athletes/",
    "timestamp": "2025-02-06T00:10:31Z"
  },
  {
    "title": "Trump administration backtracks on Gaza takeover plan amid global backlash",
    "description": "Facing international backlash, the Trump administration softened its stance on Gaza, clarifying that relocating Palestinians would be temporary and that US troops are not planned for the area. Global leaders and rights groups condemned the proposal as a viola…",
    "link": "https://www.theonlinecitizen.com/2025/02/06/trump-administration-backtracks-on-gaza-takeover-plan-amid-global-backlash/",
    "timestamp": "2025-02-06T00:09:27Z"
  },
  {
    "title": "Bank of England expected to cut interest rates",
    "description": "A cut to interest rates could mean lower mortgage rates.",
    "link": "https://www.bbc.com/news/articles/c0lzj3g77gpo",
    "timestamp": "2025-02-06T00:08:55Z"
  },
  {
    "title": "Lazarus APT targets crypto wallets using cross-platform JavaScript stealer",
    "description": "The North Korea-linked APT group Lazarus uses a cross-platform JavaScript stealer to target crypto wallets in a new hacking campaign. Bitdefender researchers reported that the North Korea-linked Lazarus group uses fake LinkedIn job offers in the cryptocurrenc…",
    "link": "https://securityaffairs.com/173902/apt/lazarus-cross-platform-javascript-stealer-crypto-wallets.html",
    "timestamp": "2025-02-06T00:08:02Z"
  },
  {
    "title": "Underestimating Americans: A Coming Plunge of “Dictator Donald” (DD). Ralph Nader",
    "description": "Convicted felon Donald Trump has declared war on Americans. In less than two weeks, he has become the dictator, a role he celebrated in his campaign. He is using illegal executive orders as poisoned spears against just about \r\n\n…\r\n\nThe post Underestimating Am…",
    "link": "https://www.globalresearch.ca/underestimating-americans-coming-plunge-dictator-donald/5879122",
    "timestamp": "2025-02-06T00:06:42Z"
  },
  {
    "title": "Ford expects to rack up EV losses of up to $5.5B in 2025, sending shares skidding",
    "description": "Ford Motor on Wednesday projected up to $5.5 billion in losses on its electric vehicle and software operations this year, a loss similar to last year and a sign of the severe difficulties in cutting costs on battery-powered models.",
    "link": "https://nypost.com/2025/02/05/business/ford-expects-to-rack-up-ev-losses-of-up-to-5-5b-in-2025-sending-shares-skidding/",
    "timestamp": "2025-02-06T00:06:38Z"
  },
  {
    "title": "Trump's proposal to take over Gaza outrageous, say Palestinians and advocates in Toronto",
    "description": "Family members with loved ones in Gaza as well as activists say they are outraged that U.S. President Donald Trump has suggested that Palestinians should be relocated while the U.S. takes over and redevelops the territory.",
    "link": "https://www.cbc.ca/news/canada/toronto/palestinian-canadians-outrage-donald-trump-gaza-remarks-1.7451616",
    "timestamp": "2025-02-06T00:06:09Z"
  },
  {
    "title": "Hundreds rally at Michigan Capitol in protest of Trump administration policies",
    "description": "Upward of a thousand people rallied outside of the Michigan state Capitol Wednesday afternoon. They chanted in opposition to actions taken by President Donald Trump.",
    "link": "https://www.wxyz.com/news/voices/hundreds-rally-at-michigan-capitol-in-protest-of-trump-administration-policies",
    "timestamp": "2025-02-06T00:05:49Z"
  },
  {
    "title": "DOGE to the rescue? Let’s hope so",
    "description": "'Silly rich people should fund such frivolous research. Taxpayers shouldn't'",
    "link": "https://www.wnd.com/2025/02/doge-to-the-rescue-lets-hope-so/",
    "timestamp": "2025-02-06T00:05:16Z"
  },
  {
    "title": "How Trump's Moves to End Protections for Transgender People Could Hurt Veterans Health Care",
    "description": "In one of his first moves in office last month, Trump signed an executive order that railed against \"ideologues who deny the biological reality of sex\" and directed the federal government to only recognize sex assigned at birth.",
    "link": "https://www.military.com/daily-news/2025/02/05/how-trumps-moves-end-protections-transgender-people-could-hurt-veterans-health-care.html",
    "timestamp": "2025-02-06T00:04:51Z"
  },
  {
    "title": "UN Chief Warns Against Gaza \"Ethnic Cleansing\" After Trump Remarks",
    "description": "The UN chief warned Wednesday against ethnic cleansing in Gaza as he rejected US President Donald Trump&#039;s bombshell proposal for the United States to take control of the Palestinian territory and displace all its people.",
    "link": "https://www.ndtv.com/world-news/un-chief-warns-against-gaza-ethnic-cleansing-after-donald-trump-remarks-7644581",
    "timestamp": "2025-02-06T00:04:18Z"
  },
  {
    "title": "Elon Musk Main Villain in Mass Anti-Trump Demonstrations",
    "description": "Protests erupted throughout the country on Wednesday to counter the actions taken by President Donald Trump's administration just 17 days in office.",
    "link": "https://biztoc.com/x/d0f1159590e05c06",
    "timestamp": "2025-02-06T00:04:10Z"
  },
  {
    "title": "Trump ally Musk is remaking government - but will they clash?",
    "description": "Musk has emerged as a dominant force in Trump's second term, gutting an agency and issuing ultimatums to staff.",
    "link": "https://www.bbc.com/news/articles/c1dg95dyxygo",
    "timestamp": "2025-02-06T00:03:56Z"
  },
  {
    "title": "WHO's Sorry Now? Argentina Joins the U.S. in Leaving the World Health Organization Behind",
    "description": "WHO's Sorry Now? Argentina Joins the U.S. in Leaving the World Health Organization Behindtwitchy.com",
    "link": "https://twitchy.com/amy-curtis/2025/02/05/argentina-joins-us-in-leaving-the-who-behind-n2407890",
    "timestamp": "2025-02-06T00:03:51Z"
  },
  {
    "title": "10 critical questions about D.C. midair crash",
    "description": "An ultimate result of the investigation will be an 'enlargement of the skies'",
    "link": "https://www.wnd.com/2025/02/10-critical-questions-about-d-c-midair-crash/",
    "timestamp": "2025-02-06T00:03:03Z"
  },
  {
    "title": "Former Biden Campaign Official Thinks Solution To Dem Woes Is To Trot Out AOC, Far-Left Rep",
    "description": "Fmr Biden advisor, Alencia Johnson, said she would like to see more of AOC and Dem Rep. Jasmine Crockett leading the party to address its frustrations.",
    "link": "https://dailycaller.com/2025/02/05/alencia-johnson-democrat-party-struggles-aoc-jasmine-crockett/",
    "timestamp": "2025-02-06T00:02:13Z"
  },
  {
    "title": "China Harasses Google to Get Revenge for Trump’s Tariffs",
    "description": "China’s retaliation for President Donald Trump’s tariffs has thus far included a levy on imported American energy products, an extra fee on imported American agricultural equipment, and a menacing “antitrust” investigation of Google.\nThe post China Harasses G…",
    "link": "https://www.breitbart.com/tech/2025/02/05/china-harasses-google-to-get-revenge-for-trumps-tariffs/",
    "timestamp": "2025-02-06T00:01:54Z"
  },
  {
    "title": "LABASH: When Your Country Hits The Skids...",
    "description": "It's time to stay true (and to read your Thomas Merton)",
    "link": "https://mattlabash.substack.com/p/when-your-country-hits-the-skids",
    "timestamp": "2025-02-06T00:00:03Z"
  },
  {
    "title": "Rising Tensions Could Push Iran and Trump Toward a New Deal or Conflict",
    "description": "Iran faced many challenges in 2024: Regional Setbacks: Iran's influence in the Middle East suffered major blows. Israel attacked its embassy in Damascus, and key allies Hezbollah in Lebanon, Hamas in Gaza, and the Assad regime in Syria faced defeats, weakenin…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Rising-Tensions-Could-Push-Iran-and-Trump-Toward-a-New-Deal-or-Conflict.html",
    "timestamp": "2025-02-06T00:00:00Z"
  },
  {
    "title": "Drug bazaars, hitmen and hackers — why Eileen went deep into the dark web",
    "description": "Lawyer turned journalist Eileen Ormsby on her journey deeper and deeper into the internet's 'evil twin', where, under the cloak of anonymity, people sell buy and share anything a person is willing to pay for \n\nEileen Ormsby had just returned to university to …",
    "link": "https://www.abc.net.au/listen/programs/conversations/eileen-ormsby-silk-road-dark-web-ross-ulbricht/104884406",
    "timestamp": "2025-02-06T00:00:00Z"
  },
  {
    "title": "'It's a certainty': FBI attorney warns pardoned J6ers will go after agents next",
    "description": "When President Donald Trump issued a mass clemency of Jan. 6 insurrectionists — including violent criminals who beat police officers and the leaders of far-right paramilitary groups convicted of seditious conspiracy — he put the lives of FBI agents who helped…",
    "link": "https://www.rawstory.com/fbi-j6-rioters/",
    "timestamp": "2025-02-05T23:58:36Z"
  },
  {
    "title": "Dem caterwauling over the Trump/Musk wrecking ball",
    "description": "The duo is doing something unprecedented on the right: Keeping their promise",
    "link": "https://www.wnd.com/2025/02/dem-caterwauling-over-the-trump-musk-wrecking-ball/",
    "timestamp": "2025-02-05T23:58:08Z"
  },
  {
    "title": "Team Stelter: Hopelessly devoted to ruining Trump",
    "description": "'These journalists only care about the opinions of their fellow Democrats'",
    "link": "https://www.wnd.com/2025/02/team-stelter-hopelessly-devoted-to-ruining-trump/",
    "timestamp": "2025-02-05T23:56:41Z"
  },
  {
    "title": "Streamers Adin Ross and FaZe Banks Plan Crypto 'GTA 6' Server—Would It Be Banned?",
    "description": "Adin Ross and FaZe Banks want to create a crypto-fueled GTA 6 server built around a new coin—but history suggests Rockstar won’t allow it.",
    "link": "https://decrypt.co/304597/adin-ross-faze-banks-crypto-gta-6-server",
    "timestamp": "2025-02-05T23:56:03Z"
  },
  {
    "title": "ThinkCareBelieve: President Trump New DOGE Investigates USAID",
    "description": "The Department of Government Efficiency Begins its Audit The Department of Government Efficiency Begins its Audit",
    "link": "https://www.globenewswire.com/news-release/2025/02/05/3021667/0/en/ThinkCareBelieve-President-Trump-New-DOGE-Investigates-USAID.html",
    "timestamp": "2025-02-05T23:56:00Z"
  },
  {
    "title": "'Made in Canada' vs. 'Product of Canada' — What's the difference?",
    "description": "The push to buy Canadian has turned out to be more complicated than some consumers expected — as they try to distinguish between products labelled “Product of Canada” and those that are “Made in Canada.”",
    "link": "https://www.cbc.ca/news/canada/made-in-canada-product-of-canada-1.7451556",
    "timestamp": "2025-02-05T23:55:42Z"
  },
  {
    "title": "Timothy Snyder: Of Course It’s a Coup",
    "description": "Historian Timothy Snyder, author of On Tyranny, is urging people and the media to understand and acknowledge that what’s hap",
    "link": "https://kottke.org/25/02/timothy-snyder-of-course-its-a-coup",
    "timestamp": "2025-02-05T23:55:27Z"
  },
  {
    "title": "After US, Israel Halts Participation In UN Human Rights Council",
    "description": "A day after US President Trump announced America&#039;s withdrawal from the UN Human Rights Council, Israel&#039;s Minister of Foreign Affairs, Gideon Sa&#039;ar, said on Wednesday that Israel would also join the US in its decision not to participate in the U…",
    "link": "https://www.ndtv.com/world-news/after-us-israel-halts-participation-in-un-human-rights-council-7644555",
    "timestamp": "2025-02-05T23:55:06Z"
  },
  {
    "title": "GOP’s narrow House majority is about to get narrower",
    "description": "'Keeping Stefanik's seat empty will make things harder for Speaker Mike Johnson'",
    "link": "https://www.wnd.com/2025/02/gops-narrow-house-majority-is-about-to-get-narrower/",
    "timestamp": "2025-02-05T23:54:43Z"
  },
  {
    "title": "Google scraps diversity 'aspirations,' citing role as federal contractor",
    "description": "Google said it's been reevaluating diversity programs over the last year.",
    "link": "https://www.cnbc.com/2025/02/05/google-scraps-diversity-aspirations-as-a-federal-contractor.html",
    "timestamp": "2025-02-05T23:53:22Z"
  },
  {
    "title": "Trump sued over purge at NLRB, regulator targeted by SpaceX, Amazon and others",
    "description": "The former chair of the National Labor Relations Board in a new lawsuit Wednesday accused President Donald Trump of breaking the law when he fired her from the agency last week.\nLawyers for Gwynne Wilcox argue that she was removed from her post for a \"politic…",
    "link": "https://biztoc.com/x/9f4e0b599b751cde",
    "timestamp": "2025-02-05T23:53:03Z"
  },
  {
    "title": "Elon Musk Main Villain in Mass Anti-Trump Demonstrations",
    "description": "Protests erupted throughout the country on Wednesday to counter the actions taken by President Donald Trump's administration just 17 days in office.",
    "link": "https://www.newsweek.com/50501-movement-protests-elon-musk-donald-trump-republican-villain-2026871",
    "timestamp": "2025-02-05T23:52:39Z"
  },
  {
    "title": "New Orleans ramps up security as 120,000 visitors descend on city for Super Bowl just weeks after terror attack",
    "description": "After a New Year’s Day terror attack struck New Orleans’ historic French Quarter, city officials say they are confident in the security plans they have in place for Sunday’s Super Bowl.",
    "link": "https://nypost.com/2025/02/05/us-news/what-to-know-about-security-measures-at-the-super-bowl-in-new-orleans/",
    "timestamp": "2025-02-05T23:51:54Z"
  },
  {
    "title": "Five Ways In Which Argentina's Milei Has Mirrored Trump",
    "description": "Imitation is the sincerest form of flattery, as the saying goes, and Argentina's President Javier Milei has made clear his admiration for Donald Trump by liberally borrowing from the US president's playbook.",
    "link": "https://www.ibtimes.com/five-ways-which-argentinas-milei-has-mirrored-trump-3762520",
    "timestamp": "2025-02-05T23:51:24Z"
  },
  {
    "title": "Trump tariff 'made something snap in us' - many Canadians see US rift beyond repair",
    "description": "The tariffs and US President Donald Trump's '51st State' comments have made way for a surge of patriotism in Canada.",
    "link": "https://www.bbc.com/news/articles/c0qw9y94w2vo",
    "timestamp": "2025-02-05T23:49:37Z"
  },
  {
    "title": "‘Wow’: Elon Musk stunned at discovery of Chelsea Clinton receiving $84 million in taxpayer funding",
    "description": "'The depravity and sickness of these people requires a public preparation for the crimes'",
    "link": "https://www.wnd.com/2025/02/wow-elon-musk-stunned-at-discovery-of-chelsea-clinton-receiving-84-million-in-taxpayer-funding/",
    "timestamp": "2025-02-05T23:48:43Z"
  },
  {
    "title": "Eagles fan Jill Biden to attend Super Bowl LIX: report",
    "description": "Former first lady Jill Biden will reportedly be in attendance for the Super Bow in New Orleans Sunday to watch her beloved Philadelphia Eagles.",
    "link": "https://www.foxnews.com/sports/eagles-fan-jill-biden-attend-super-bowl-lix-report",
    "timestamp": "2025-02-05T23:47:28Z"
  },
  {
    "title": "One dead and 15 in custody after RCMP respond to recent Prairies border crossings",
    "description": "Police revealed details about a trio of recent border crossings in Alberta and Manitoba in recent weeks",
    "link": "https://www.cbc.ca/news/canada/calgary/coutts-emerson-rcmp-crossings-1.7451655",
    "timestamp": "2025-02-05T23:47:25Z"
  },
  {
    "title": "Columbia Sportswear CEO talks tariff impact: 'We need some surety about what's going to happen'",
    "description": "In a Wednesday interview with CNBC's Jim Cramer, Columbia Sportswear CEO Tim Boyle said his company needs more clarity about global tariff decisions.",
    "link": "https://www.cnbc.com/2025/02/05/columbia-sportswear-ceo-on-tariffs-we-need-some-surety.html",
    "timestamp": "2025-02-05T23:45:16Z"
  },
  {
    "title": "'60 Minutes' publicly releases transcripts of interview at heart of its dispute with Trump (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\n‘60 Minutes’ publicly releases transcripts of interview at heart of its dispute with Trump  —  CBS' “60 Minutes” posted online Wednesday the unedited transcripts of its October interview with Kamala Harris that sparked a lawsu…",
    "link": "https://www.memeorandum.com/250205/p169",
    "timestamp": "2025-02-05T23:45:01Z"
  },
  {
    "title": "Ukraine's Deaths Last Year Outpaced Births by Nearly 3 to 1: Report",
    "description": "In 2024, Ukraine recorded 495,090 deaths and 176,679 births.",
    "link": "https://www.newsweek.com/ukraine-deaths-births-last-year-2026949",
    "timestamp": "2025-02-05T23:44:31Z"
  },
  {
    "title": "Texas Economy Will Fall Apart With Mass Deportations, Local Democrats Warn",
    "description": "Candace Sublett and Marisela Aramino, members of the Tarrant County Democratic Party in Texas, are issuing a stern warning as President Donald Trump orders crackdowns on illegal immigration ... noting recent mass arrests could have a dire ripple…\n Permalink",
    "link": "https://www.tmz.com/2025/02/05/texas-economy-will-fall-apart-deportations-tarrant-county-democratic-party/",
    "timestamp": "2025-02-05T23:43:43Z"
  },
  {
    "title": "Trump is targeting antisemitism in schools. Experts fear other civil rights will be ignored",
    "description": "The federal office that enforces civil rights at school across the nation has been ordered to prioritize complaints of antisemitism above all else as it molds to President Donald Trump’s agenda, raising fears that other rights violations will go unpuni...",
    "link": "https://abcnews.go.com/US/wireStory/trump-targeting-antisemitism-schools-experts-fear-civil-rights-118508566",
    "timestamp": "2025-02-05T23:42:43Z"
  },
  {
    "title": "Republicans revisit Trump’s foreign policy as he pushes US power overseas",
    "description": "The News\nPresident Donald Trump’s foreign policy is having an identity crisis: Does “America First” mean avoiding overseas engagements — or pursuing them when they further US interests?\nTrump forged an image during his 2016 run that leaned against foreign int…",
    "link": "https://biztoc.com/x/8a7137d817e3d0ab",
    "timestamp": "2025-02-05T23:42:04Z"
  },
  {
    "title": "‘Exactly what it looks like’: Education Department staffers express confusion about Trump’s resignation offer",
    "description": "“Employees need to know what happens to these agreements if the Department of Education is no longer an entity,” one employee commented during a staff...",
    "link": "https://www.politico.com/news/2025/02/05/education-department-staffers-trump-resignation-offer-00202742",
    "timestamp": "2025-02-05T23:42:00Z"
  },
  {
    "title": "Exclusive—Sherry Walker: Making Aviation Great Again",
    "description": "The aviation industry must take bold action to implement policies that will ensure that safety, not social justice, is our guiding star.\nThe post Exclusive—Sherry Walker: Making Aviation Great Again appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/05/exclusive-sherry-walker-making-aviation-great-again/",
    "timestamp": "2025-02-05T23:41:56Z"
  },
  {
    "title": "Trump Signs Executive Order Banning Biological Men in Women's Sports (Matthew Xiao/freebeacon.com)",
    "description": "Matthew Xiao / freebeacon.com:\nTrump Signs Executive Order Banning Biological Men in Women's Sports  —  President Donald Trump on Wednesday signed an executive order that prohibits biologically male athletes from participating in women's sports, delivering on…",
    "link": "https://www.memeorandum.com/250205/p167",
    "timestamp": "2025-02-05T23:40:01Z"
  },
  {
    "title": "Why Saudi and other Arab nations may secretly approve of Trump’s proposal to ‘takeover’ Gaza",
    "description": "\"I wouldn't be surprised to know that in the back rooms, the Saudis, the Egyptians, the Jordanians, are very much happy about Trump's... that idea of the United States taking control over the situation in Gaza,\" an ex Israeli negotiator told The Post.",
    "link": "https://nypost.com/2025/02/05/world-news/why-arab-nations-may-secretly-approve-of-trumps-gaza-takeover-proposal/",
    "timestamp": "2025-02-05T23:39:05Z"
  },
  {
    "title": "Democratic State AGs Vow to Fight Trump's Attacks on Transgender People",
    "description": "Fifteen Democratic state attorneys issued a joint statement Wednesday vowing to protect access to gender-affirming healthcare amid the Trump administration's attacks on transgender people, which include a new executive order aiming to ban trans girls and wome…",
    "link": "https://www.commondreams.org/news/transgender-rights-under-trump",
    "timestamp": "2025-02-05T23:38:56Z"
  },
  {
    "title": "NCAA to change guidance to align with executive order on transgender athletes in women's sports",
    "description": "NCAA to change guidance to align with executive order on transgender athletes in women's sportson3.com",
    "link": "https://www.on3.com/news/ncaa-change-guidance-align-executive-order-transgender-athletes-womens-sports-donald-trump/",
    "timestamp": "2025-02-05T23:38:10Z"
  },
  {
    "title": "Trump executive order on protecting women's sports draws response from NCAA",
    "description": "The NCAA on Wednesday responded to President Donald Trump's executive order banning biological men from competing in women's sports, saying it will review the order.",
    "link": "https://www.foxnews.com/sports/trump-executive-order-protecting-womens-sports-garners-ncaa-response",
    "timestamp": "2025-02-05T23:37:13Z"
  },
  {
    "title": "Tuesday, February 4 Evening Cable News Ratings: Fox News Most-Watched During WH Press Conference",
    "description": "MSNBC's streak of over a million total viewers between 4 and 11 p.m. was interrupted between 6 and 8 p.m. as its viewers did not show much interest in watching the press conference held at the White House featuring President Donald Trump and Israeli Prime Min…",
    "link": "https://www.adweek.com/tvnewser/tuesday-february-4-2025-evening-cable-news-ratings/",
    "timestamp": "2025-02-05T23:37:03Z"
  },
  {
    "title": "Trump signs executive order keeping men out of women’s sports",
    "description": "President Donald Trump signs executive orders in the Oval Office of the White House. / Credit: The White House\n\nCNA Staff, Feb 5, 2025 / 18:35 pm (CNA).\nPresident Donald Trump signed an order to keep men out of women’s sports on Wednesday afternoon in a move …",
    "link": "https://www.catholicnewsagency.com/news/262039/trump-signs-executive-order-keeping-men-out-of-women-s-sports",
    "timestamp": "2025-02-05T23:35:00Z"
  },
  {
    "title": "Judge issues nationwide injunction blocking Trump's bid to end birthright citizenship (ABC News)",
    "description": "ABC News:\nJudge issues nationwide injunction blocking Trump's bid to end birthright citizenship  —  The judge heard arguments from lawyers for five pregnant undocumented women.  —  President Donald Trump speaks to the press after signing an executive order to…",
    "link": "https://www.memeorandum.com/250205/p166",
    "timestamp": "2025-02-05T23:35:00Z"
  },
  {
    "title": "Trump sued over purge at NLRB, regulator targeted by SpaceX, Amazon and others",
    "description": "The NLRB has come under fire from companies including Amazon and Elon Musk's SpaceX, who have argued that the labor board's structure is unconstitutional.",
    "link": "https://www.cnbc.com/2025/02/05/trump-sued-nlrb-spacex-amazon-musk.html",
    "timestamp": "2025-02-05T23:34:31Z"
  },
  {
    "title": "Protests erupt around the country against the new Trump administration's policies",
    "description": "Protesters in cities across the U.S. hit the streets to voice their objection to President Donald Trump's priorities when it comes to immigration reform, gender, and labor.",
    "link": "https://www.foxnews.com/us/protests-erupt-around-country-against-new-trump-administrations-policies",
    "timestamp": "2025-02-05T23:34:19Z"
  },
  {
    "title": "WWE News: Pat McAfee Subtly Calls Out Hulk Hogan Following Raw Controversy",
    "description": "During an appearance on 'The Pat McAfee Show,' host Pat McAfee seemed to call out WWE legend Hulk Hogan after he was booed at the Raw Netflix premiere.",
    "link": "https://www.newsweek.com/sports/wrestling/wwe-news-pat-mcafee-subtly-calls-out-hulk-hogan-following-raw-controversy-2026959",
    "timestamp": "2025-02-05T23:33:06Z"
  },
  {
    "title": "Argentina to follow US lead and exit the World Health Organization - NewsBreak",
    "description": "Argentina will leave the World Health Organization (WHO) due to the mishandling of the Covid-19 pandemic, a spokesman for right-wing populist President Ja",
    "link": "https://www.newsbreak.com/share/3792278649076-argentina-to-follow-us-lead-and-exit-the-world-health-organization?s=a2&share_destination_id=MTM5Njg1MDM0LTE3Mzg3OTgzNDgxMDk%3D&pd=09S6SQQG&hl=en_US&send_time=1738798348&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v9",
    "timestamp": "2025-02-05T23:33:05Z"
  }
]