[
  {
    "title": "The GOP Wants to Auto-Enroll Your Child in a 'Trump Savings Account'",
    "description": "Big Beautiful Bill Act-Trump accounts would allow parents, relatives, and others to contribute $5,000 annually for a child’s future. The federal government would seed this with $1,000. Contributions couldn’t be made into a Trump savings account after the chil…",
    "link": "https://freerepublic.com/focus/f-chat/4326877/posts",
    "timestamp": "2025-07-04T15:49:19Z"
  },
  {
    "title": "GTA home sales down year-over-year in June, listings up: real estate board",
    "description": "Greater Toronto Area-home sales ticked 2.4 percent lower in June compared with a year earlier as 6,243 properties changed hands, while new listings rose.",
    "link": "https://www.cbc.ca/news/canada/toronto/gta-home-sales-down-in-june-listing-up-1.7577257",
    "timestamp": "2025-07-04T15:48:42Z"
  },
  {
    "title": "Dem Eyes House Seat That Swung Nearly 20 Points To Trump",
    "description": "Democratic California Assemblywoman Jasmeet Bains is preparing to run against Republican California Rep. David Valadao in the 2026 midterms as Valadao’s district continues to trend further to the right.  Bains, a family medicine and addiction doctor, will be …",
    "link": "https://dailycaller.com/2025/07/04/jasmeet-bains-david-valadao-california-house/",
    "timestamp": "2025-07-04T15:48:13Z"
  },
  {
    "title": "Trump administration wants to expand anti-Nazi law to target critics: report",
    "description": "Based upon a memo issued by the Justice Department last month, Donald Trump's administration wants to ramp up efforts to purge the country not only of undocumented immigrants but also naturalized citizens.CNN is reporting that the president's DOJ has been exa…",
    "link": "https://www.rawstory.com/trump-doj-naturalized-citizens/",
    "timestamp": "2025-07-04T15:47:33Z"
  },
  {
    "title": "Divided US appeals court blocks enforcement of Texas state immigration law",
    "description": "(Reuters) -Texas authorities may not enforce a Republican-backed state law that would let them arrest and prosecute people suspected of illegally crossing...",
    "link": "https://www.yahoo.com/news/divided-us-appeals-court-blocks-154729014.html",
    "timestamp": "2025-07-04T15:47:29Z"
  },
  {
    "title": "The Bulwark's top editor shares how the anti-Trump site tripled its subscriber base in a year — and why it's betting on YouTube",
    "description": "Anti-Trump news website The Bulwark has rapidly grown since the 2024 election. Top editor Jonathan V. Last shared what's next.",
    "link": "https://www.businessinsider.com/the-bulwark-jonathan-last-interview-growth-youtube-cable-msnbc-cnn-2025-7",
    "timestamp": "2025-07-04T15:47:19Z"
  },
  {
    "title": "Trump expects Hamas response to ceasefire in hours as new details emerge on proposal | CNN",
    "description": "President Donald Trump has ramped up expectations around a possible 60-day ceasefire in the war in Gaza after he said Thursday that a response from Hamas was expected within the next day.",
    "link": "https://www.cnn.com/2025/07/04/middleeast/trump-hamas-ceasefire-response-gaza-israel-intl-latam",
    "timestamp": "2025-07-04T15:45:45Z"
  },
  {
    "title": "“I’ll Think About It.” Andy Beshear Mulls 2028 Run While Raging Against Trump’s “Big Beautiful Bill”",
    "description": "The mild-mannered Kentucky governor tells VF, “There’s nothing beautiful about” the controversial legislation.",
    "link": "https://www.vanityfair.com/news/story/andy-beshear-interview",
    "timestamp": "2025-07-04T15:45:12Z"
  },
  {
    "title": "Trump to reinstate sweeping tariffs",
    "description": "The US will begin reimposing tariffs that were paused for trade talks, with rates ranging from 10% to 70%, President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/620994-trump-tariffs-trade-deals/",
    "timestamp": "2025-07-04T15:43:00Z"
  },
  {
    "title": "Elon Musk revives third party idea after ‘One Big Beautiful Bill’ passes",
    "description": "The billionaire Tesla founder has clashed with President Donald Trump over the bill's increase to the US deficit.",
    "link": "https://www.aljazeera.com/news/2025/7/4/elon-musk-revives-third-party-idea-after-one-big-beautiful-bill-passes",
    "timestamp": "2025-07-04T15:42:42Z"
  },
  {
    "title": "Ben Folds Surprise Releases Live Album with National Symphony Orchestra: Stream",
    "description": "Folds previously resigned as artist advisor to the Kennedy Center's National Symphony Orchestra following Donald Trump's decision to install himself as chairman.\nBen Folds Surprise Releases Live Album with National Symphony Orchestra: Stream\nScott Sterling",
    "link": "https://consequence.net/2025/07/ben-folds-live-national-symphony-orchestra/",
    "timestamp": "2025-07-04T15:40:04Z"
  },
  {
    "title": "5 Times Media Tried To Take Down Trump But Took Themselves Down Instead",
    "description": "Corporate media outlets have taken repeated swings at President Donald Trump, but more often than not, they’ve ended up hitting themselves.",
    "link": "https://dailycaller.com/2025/07/04/trump-winning-corporate-media/",
    "timestamp": "2025-07-04T15:39:58Z"
  },
  {
    "title": "Benjamin Netanyahu Is Coming to Town Again",
    "description": "Benjamin Netanyahu is on his way for his third visit to Washington during the first six months of the second term of President Donald Trump. Bibi requested the visit because he clearly wants something and he never likes to …\nThe post Benjamin Netanyahu Is Com…",
    "link": "https://www.globalresearch.ca/benjamin-netanyahu-coming-town/5893900",
    "timestamp": "2025-07-04T15:39:40Z"
  },
  {
    "title": "US plans AI chip curbs on Malaysia, Thailand over China concerns",
    "description": "The Trump administration is planning to restrict AI chip shipments from Nvidia to Malaysia and Thailand, aiming to prevent China from acquiring these components through intermediaries. This move accompanies a rescission of the Biden-era AI diffusion rule, add…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-plans-ai-chip-curbs-on-malaysia-thailand-over-china-concerns/articleshow/122253707.cms",
    "timestamp": "2025-07-04T15:37:07Z"
  },
  {
    "title": "Trump may back air aid to Kiev after Zelensky call",
    "description": "United States President Donald Trump offered to assist Ukraine with strengthening its air defense systems following the escalation of Russian aerial assaults, Axios reported on Friday citing a Ukraini...",
    "link": "https://biztoc.com/x/ba1e619003532288",
    "timestamp": "2025-07-04T15:37:05Z"
  },
  {
    "title": "What to know about Fourth of July holiday origins and traditions",
    "description": "Fireworks are a cornerstone of America's Fourth of July celebrations, but that can make the spirited holiday dangerous",
    "link": "https://abcnews.go.com/US/wireStory/fourth-july-holiday-origins-traditions-123483195",
    "timestamp": "2025-07-04T15:34:29Z"
  },
  {
    "title": "India-US interim trade deal not likely by July 9 deadline",
    "description": "India stands firm, refusing to negotiate under deadlines, as an interim trade deal with the US remains uncertain.",
    "link": "https://www.thehindubusinessline.com/economy/india-us-interim-trade-deal-not-likely-by-july-9-deadline/article69773809.ece",
    "timestamp": "2025-07-04T15:33:38Z"
  },
  {
    "title": "What to know about Fourth of July holiday origins and traditions",
    "description": "Fireworks remain at the center of Independence Day, a holiday 247 years in the making.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-fourth-of-july-holiday-origins-and-traditions",
    "timestamp": "2025-07-04T15:31:40Z"
  },
  {
    "title": "Foreign medical residents fill critical positions at US hospitals, but are running into visa issues",
    "description": "Some hospitals in the U.S. are without essential staff because international medical residents set to start their training this week were delayed by the Trump administration’s travel and visa restrictions.",
    "link": "https://www.news4jax.com/health/2025/07/04/foreign-medical-residents-fill-critical-positions-at-us-hospitals-but-are-running-into-visa-issues/",
    "timestamp": "2025-07-04T15:30:37Z"
  },
  {
    "title": "Trump tells reporters, \"We did a deal for about $16M plus $16M, or maybe more than that in advertising\" with CBS, which denies PSAs were part of the settlement (Dominic Patten/Deadline)",
    "description": "Dominic Patten / Deadline:\nTrump tells reporters, “We did a deal for about $16M plus $16M, or maybe more than that in advertising” with CBS, which denies PSAs were part of the settlement  —  Someone's playing fast and loose with the real numbers, and, for onc…",
    "link": "https://mediagazer.com/250704/p3",
    "timestamp": "2025-07-04T15:25:01Z"
  },
  {
    "title": "Trump Plans To Start Notifying Countries Of US Tariffs Up To 70%",
    "description": "US President Donald Trump said his administration will probably start notifying trading partners Friday of the new US tariff on their exports effective Aug. 1, while reiterating a preference for simplicity over complicated negotiations five days before his de…",
    "link": "https://www.ndtvprofit.com/global-economics/trump-plans-to-start-notifying-countries-of-us-tariffs-up-to-70",
    "timestamp": "2025-07-04T15:25:00Z"
  },
  {
    "title": "Senators promises to name names of those who schemed to jail President Trump",
    "description": "'I’m going to make sure as chairman of this committee, by listening to whistleblowers, getting documents that have been kept from Congress of the United States, I’m going to make sure that everybody is exposed and the documents prove it for the eight years th…",
    "link": "https://www.wnd.com/2025/07/senators-promises-name-names-those-who-schemed-jail/",
    "timestamp": "2025-07-04T15:24:46Z"
  },
  {
    "title": "Trump, Zelensky discuss weapons, escalating strikes",
    "description": "Ukrainian President Volodymyr Zelensky said he discussed air defences in a conversation with US President Donald Trump, and agreed to work on increasing Kyiv's capability to \"defend the sky\" as Russian attacks escalate.",
    "link": "https://www.rte.ie/news/world/2025/0704/1521896-zelensky-trump-call/",
    "timestamp": "2025-07-04T15:19:34Z"
  },
  {
    "title": "The best history books to read in 2025",
    "description": "Understanding the past \"gives us perspective\" on current events, said GQ. \"And right now, we sorely need perspective.\" With \"war raging in Europe\" and Donald Trump causing chaos across the pond, it's worth spending some time discovering how we got here. These…",
    "link": "https://biztoc.com/x/ca96a1fc49d1acb0",
    "timestamp": "2025-07-04T15:15:12Z"
  },
  {
    "title": "'Big mask off moment': GOP rep caught gloating after '17 million people lost health care' - NewsBreak",
    "description": "In a now-deleted social media post, Rep. Derrick Van Orden (R-Wis.) seemed to boast that millions would lose health coverage due to the Medicaid cuts in Pr",
    "link": "https://www.newsbreak.com/share/4088278183250-big-mask-off-moment-gop-rep-caught-gloating-after-17-million-people-lost-health-care?s=a2&amp;share_destination_id=MjAzODgwMjUwLTE3NTE2NDE5Mjk0MTk%3D&amp;pd=0DnSZ895&amp;hl=en_US&amp;send_time=1751641929&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v6",
    "timestamp": "2025-07-04T15:13:51Z"
  },
  {
    "title": "What The One Big Beautiful Bill Act Will Mean For You And Your Business",
    "description": "The One Big Beautiful Bill Act passed the House on July 3, and is expected to be signed into law by President Donald Trump. Here’s a detailed look at what’s changed—and how it might impact you.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/07/04/what-the-one-big-beautiful-bill-act-will-mean-for-you-and-your-business/",
    "timestamp": "2025-07-04T15:10:58Z"
  },
  {
    "title": "Democrats see Trump’s megabill as key to their comeback. It may not be so easy",
    "description": "For many Democratic leaders, the tax break and spending cut package passed by Trump's Republican allies in Congress on Thursday represents the key to the Democratic Party's resurgence.",
    "link": "https://www.pbs.org/newshour/politics/democrats-see-trumps-megabill-as-key-to-their-comeback-it-may-not-be-so-easy",
    "timestamp": "2025-07-04T15:10:19Z"
  },
  {
    "title": "Trump, Zelenskiy discuss weapons, escalating Russian strikes (Reuters)",
    "description": "Reuters:\nTrump, Zelenskiy discuss weapons, escalating Russian strikes  —  Ukrainian President Volodymyr Zelenskiy said he discussed air defences in a conversation with U.S. President Donald Trump on Friday, and agreed to work on increasing Kyiv's capability t…",
    "link": "https://www.memeorandum.com/250704/p30",
    "timestamp": "2025-07-04T15:10:00Z"
  },
  {
    "title": "3 years later, 988 Lifeline sees higher volume but special option for LGBTQ youth cut",
    "description": "Three years after the launch of the 988 Suicide & Crisis Lifeline, the service is seeing increased call, chat and text volume and reductions in specialized offerings.",
    "link": "https://abcnews.go.com/Politics/3-years-988-lifeline-sees-higher-volume-special/story?id=123467379",
    "timestamp": "2025-07-04T15:09:34Z"
  },
  {
    "title": "The best history books to read in 2025",
    "description": "These fascinating deep-dives are perfect for history buffs",
    "link": "https://theweek.com/culture-life/books/the-best-history-books-to-read-in-2025",
    "timestamp": "2025-07-04T15:08:48Z"
  },
  {
    "title": "Trump’s Vietnam Deal Shows China Tariffs Won’t Fall Much Further",
    "description": "President Donald Trump’s new trade deal with Vietnam sends a clear signal about where US tariffs on Chinese goods might ultimately land, as talks between Washington and Beijing continue following their recent truce.",
    "link": "https://gcaptain.com/230557-2/",
    "timestamp": "2025-07-04T15:08:19Z"
  },
  {
    "title": "What to know about Fourth of July holiday origins and traditions",
    "description": "By The Associated Press The Fourth of July is Americana at its core: parades and cookouts and cold beer and, of course, fireworks. Those pyrotechnics also make it an especially dangerous holiday, typically resulting in more than 10,000 trips to the emergency …",
    "link": "https://www.denverpost.com/2025/07/04/what-to-know-about-fourth-of-july-holiday-origins-and-traditions/",
    "timestamp": "2025-07-04T15:05:57Z"
  },
  {
    "title": "After Trump’s deportation threat, Musk gets love from China, backs Tesla CEO’s bold move to start his own party",
    "description": "Elon Musk's suggestion of forming the 'American Party' amid a feud with Donald Trump over a massive spending bill has garnered unexpected support from Chinese social media users. The hashtag #MuskWantsToBuildAnAmericaParty is trending on Weibo, with users pra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-trumps-deportation-threat-musk-gets-love-from-china-backs-tesla-ceos-bold-move-to-start-his-own-party-elon-musk-latest-news-donald-trump-latest-news/articleshow/122252354.cms",
    "timestamp": "2025-07-04T15:00:51Z"
  },
  {
    "title": "Record Russian attack on Ukraine hours after Putin–Trump call",
    "description": "Russia launched a record 539 drones against Ukraine just hours after a call between the US and Russian presidents.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/7/4/record-russian-attack-on-ukraine-hours-after-putin-trump",
    "timestamp": "2025-07-04T15:00:35Z"
  },
  {
    "title": "Congress sets mid-July as ‘crypto week’ for passage of GENIUS, CLARITY Acts",
    "description": "Crypto czar Sacks believes the GENIUS Act will pass without amendments at the House.",
    "link": "https://ambcrypto.com/congress-sets-mid-july-as-crypto-week-for-passage-of-the-genius-clarity-acts/",
    "timestamp": "2025-07-04T15:00:34Z"
  },
  {
    "title": "'One event' arms pause troubling for Ukraine",
    "description": "The US says its pause on arms shipments is a one-off. But amid the turbulent US-Ukraine relationship, the assurance is little comfort to Volodymyr Zelenskyy or his European supporters.",
    "link": "https://www.dw.com/en/one-event-arms-pause-troubling-for-ukraine/a-73144853",
    "timestamp": "2025-07-04T14:59:00Z"
  },
  {
    "title": "Musk backs Sen. Paul's criticism of Trump's megabill in first comment since it passed",
    "description": "Musk has blasted President Donald Trump's \"One Big Beautiful Bill,\" calling out the potential for the spending package to increase the national debt.",
    "link": "https://www.cnbc.com/2025/07/04/musk-trump-megabill.html",
    "timestamp": "2025-07-04T14:56:43Z"
  },
  {
    "title": "Trump Zig-Zags Into Semi-Amnesty Politics",
    "description": "President Donald Trump floated a form of semi-amnesty for illegal hotel, restaurant, and farm workers during a victory speech in Iowa late Thursday -- but he also said a bitterly divided Congress would have to write the legislation.\nThe post Trump Zig-Zags In…",
    "link": "https://www.breitbart.com/immigration/2025/07/04/trump-zig-zags-through-amnesty-politics/",
    "timestamp": "2025-07-04T14:54:26Z"
  },
  {
    "title": "GOP warned Trump endorsement could lead to key Senate loss",
    "description": "Conservative Washington Post columnist George Will is warning that President Donald Trump could make the difference between whether a Democrat has a chance in the Texas Senate race. Writing Friday, Will pointed out that Trump only \"carried Texas by 13 points,…",
    "link": "https://www.rawstory.com/ken-paxton-john-cornyn-2672643157/",
    "timestamp": "2025-07-04T14:53:27Z"
  },
  {
    "title": "Hamas says holding consultations on Gaza truce proposal",
    "description": "Hamas said Friday it was holding consultations with other Palestinian groups on a proposed truce with Israel, in a possible sign that it was preparing for negotiations for a Gaza ceasefire. The statement came ahead of a visit on Monday by Israeli Prime Minist…",
    "link": "https://www.digitaljournal.com/world/hamas-says-holding-consultations-on-gaza-truce-proposal/article",
    "timestamp": "2025-07-04T14:53:27Z"
  },
  {
    "title": "OPEC+ Moves Meeting to Saturday as Group Weighs Another Hike",
    "description": "The Organization of the Petroleum Exporting Countries has roiled markets in recent months by speeding up the return of halted output.",
    "link": "https://www.rigzone.com/news/wire/opec_moves_meeting_to_saturday_as_group_weighs_another_hike-04-jul-2025-181050-article/",
    "timestamp": "2025-07-04T14:51:21Z"
  },
  {
    "title": "Russia welcomes Trump’s cut to Ukraine’s military aid but it could be deadly for Kyiv | CNN",
    "description": "The reactions to the Trump administration’s decision to pause some weapons shipments to Ukraine couldn’t be more illustrative of the conflict: welcomed by the Kremlin, branded “inhumane” by Kyiv.",
    "link": "https://www.cnn.com/2025/07/04/europe/russia-ukraine-military-us-aid-cuts-intl-cmd",
    "timestamp": "2025-07-04T14:51:14Z"
  },
  {
    "title": "Trump says he had 'never heard' Shylock as an anti-semitic term after using it at rally (Kevin Liptak/CNN)",
    "description": "Kevin Liptak / CNN:\nTrump says he had ‘never heard’ Shylock as an anti-semitic term after using it at rally  —  President Donald Trump said early Friday that he wasn't aware that some people view the word “Shylock” as antisemitic after using the term during a…",
    "link": "https://www.memeorandum.com/250704/p29",
    "timestamp": "2025-07-04T14:50:02Z"
  },
  {
    "title": "Gas Crisis Looms Over California As Dems Continue To Impose Crippling Regs",
    "description": "A slew of Democrat policies has led to refinery closures and lofty gas prices in the Golden State that may soon summon a crisis.",
    "link": "https://dailycaller.com/2025/07/04/gas-crisis-looms-over-california-as-dems-continue-to-impose-crippling-regs/",
    "timestamp": "2025-07-04T14:49:32Z"
  },
  {
    "title": "Zelensky: We are ready for defense projects with US",
    "description": "Ukrainian President Volodymyr Zelensky confirmed on Friday he spoke with his United States colleague Donald Trump on the phone, stating that he discussed potential joint defense programs with Washington, as well as recently Russian strikes on his country. \"We…",
    "link": "https://freerepublic.com/focus/f-chat/4326865/posts",
    "timestamp": "2025-07-04T14:49:19Z"
  },
  {
    "title": "Gavin Newsom Is Heading to a Key 2028 State",
    "description": "Newsom, viewed as a potential presidential candidate, is heading to an early voting state.",
    "link": "https://www.newsweek.com/gavin-newsom-heading-south-carolina-key-2028-state-2094763",
    "timestamp": "2025-07-04T14:48:27Z"
  },
  {
    "title": "Outfit Behind Slanted ‘Terrorism’ Studies Pleads For Private Donors After Trump Funding Cuts",
    "description": "A research hub that has received taxpayer dollars for politically skewed \"terrorism\" research is asking for private donations after losing federal funds.",
    "link": "https://dailycaller.com/2025/07/04/outfit-behind-slanted-terrorism-studies-pleads-for-private-donors-after-trump-funding-cuts/",
    "timestamp": "2025-07-04T14:48:01Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ Is Already Hurting Health Care Facilities",
    "description": "The bill is projected to strip health insurance from 17 million people.",
    "link": "https://gizmodo.com/trumps-big-beautiful-bill-is-already-hurting-health-care-facilities-2000624066",
    "timestamp": "2025-07-04T14:45:07Z"
  },
  {
    "title": "Caitlyn Jenner’s Manager Sophia Hutchins Dies in ATV Crash",
    "description": "An ATV accident near Caitlyn Jenner's home on Wednesday claimed the life of his long-time friend, confidante and manager Sophia Hutchins.",
    "link": "https://www.breitbart.com/entertainment/2025/07/04/caitlyn-jenners-manager-sophia-hutchins-dies-in-atv-crash/",
    "timestamp": "2025-07-04T14:44:22Z"
  },
  {
    "title": "Hamas Says Holding Consultations On Gaza Truce Proposal",
    "description": "Hamas said Friday it was holding consultations with other Palestinian groups on a proposed truce with Israel, in a possible sign that it was preparing for negotiations for a Gaza ceasefire.",
    "link": "https://www.ibtimes.com.au/hamas-says-holding-consultations-gaza-truce-proposal-1859537",
    "timestamp": "2025-07-04T14:42:18Z"
  },
  {
    "title": "Hamas Says Holding Consultations On Gaza Truce Proposal",
    "description": "Hamas said Friday it was holding consultations with other Palestinian groups on a proposed truce with Israel, in a possible sign that it was preparing for negotiations for a Gaza ceasefire.",
    "link": "https://www.ibtimes.com/hamas-says-holding-consultations-gaza-truce-proposal-3777670",
    "timestamp": "2025-07-04T14:42:11Z"
  },
  {
    "title": "Steve Bannon: ‘Trump is going to be in your head for a long time’",
    "description": "It is no surprise that Steve Bannon has picked Butterworth’s. ..... Having been Donald Trump’s original explainer, godfather to US nationalist-populism and an evangelist to its far-right western siblings, he could hardly be less. Bannon’s former protégé, Rahe…",
    "link": "https://freerepublic.com/focus/f-chat/4326863/posts",
    "timestamp": "2025-07-04T14:42:01Z"
  },
  {
    "title": "Zelensky: We are ready for defense projects with US",
    "description": "Ukrainian President Volodymyr Zelensky confirmed on Friday he spoke with his United States colleague Donald Trump on the phone, stating that he discussed potential joint defense programs with Washingt...",
    "link": "https://biztoc.com/x/fe6f4708d9ce34fa",
    "timestamp": "2025-07-04T14:41:55Z"
  },
  {
    "title": "Kremlin responds to Trump being ‘unhappy’ after Putin call",
    "description": "Moscow is “paying very close attention” to any statements coming from the US president, spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621005-kremlin-trump-unhappy-ukraine-talks/",
    "timestamp": "2025-07-04T14:41:55Z"
  },
  {
    "title": "Zelensky Reveals Details of Key Trump Call: 'Very Important and Useful'",
    "description": "Ukraine's president spoke with Trump after the U.S. leader had held a call with Russia's Vladimir Putin.",
    "link": "https://www.newsweek.com/zelensky-reveals-details-key-trump-call-very-important-useful-2094794",
    "timestamp": "2025-07-04T14:41:26Z"
  },
  {
    "title": "Trump says he didn't know offensive term he used in speech is considered antisemitic",
    "description": "Donald Trump claims ignorance regarding the antisemitic connotations of the term \"shylock,\" which he used to describe unscrupulous moneylenders in a recent speech. Despite the Anti-Defamation League's condemnation and historical context from Shakespeare's \"Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-didnt-know-offensive-term-he-used-in-speech-is-considered-antisemitic/articleshow/122252941.cms",
    "timestamp": "2025-07-04T14:40:00Z"
  },
  {
    "title": "Trump, Zelenskiy discuss weapons, escalating Russian strikes",
    "description": "KYIV (Reuters) -Ukrainian President Volodymyr Zelenskiy said he discussed air defences in a conversation with U.S. President Donald Trump on Friday, and...",
    "link": "https://www.yahoo.com/news/trump-zelesnkiy-discuss-weapons-escalating-143951490.html",
    "timestamp": "2025-07-04T14:39:51Z"
  },
  {
    "title": "Trump Administration Cuts Funding For Black Infant Health Research, Labeling It A DEI Initiative - NewsBreak",
    "description": "A study exploring why Black babies in Detroit are disproportionately born prematurely has been abruptly terminated by the NIH.",
    "link": "https://www.newsbreak.com/share/4087820406608-trump-administration-cuts-funding-for-black-infant-health-research-labeling-it-a-dei-initiative?s=a2&amp;share_destination_id=Nzc4OTEyODUtMTc1MTYzOTg2OTA1MQ%3D%3D&amp;pd=05Gp53f4&amp;hl=en_US&amp;send_time=1751639869&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.25.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v1%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_blend_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v4",
    "timestamp": "2025-07-04T14:38:19Z"
  },
  {
    "title": "Trump – Zelensky communication: Kyiv speaks of “very important” and “rich” conversation",
    "description": "As reported by the US Axios, the two presidents discussed the escalation of Russian attacks in Ukraine and the supply of air defence systems\nThe post Trump – Zelensky communication: Kyiv speaks of “very important” and “rich” conversation appeared first on Pro…",
    "link": "https://en.protothema.gr/2025/07/04/trump-zelensky-communication-kyiv-speaks-of-very-important-and-rich-conversation/",
    "timestamp": "2025-07-04T14:38:15Z"
  },
  {
    "title": "Elon Musk Celebrates Independence Day by Asking If He Should Start Third Party to Serve ‘The True Will of the People’",
    "description": "Elon Musk began his Fourth of July by firing off a series of social media posts in which he teased his intention of starting a third party.\nThe post Elon Musk Celebrates Independence Day by Asking If He Should Start Third Party to Serve ‘The True Will of the …",
    "link": "https://www.mediaite.com/media/news/elon-musk-celebrates-independence-day-by-asking-if-he-should-start-third-party-to-serve-the-true-will-of-the-people/",
    "timestamp": "2025-07-04T14:35:35Z"
  },
  {
    "title": "What’s up with… AT&T, Altice France, AI in Europe",
    "description": "AT&T preps faster FTTP buildAltice France break-up talks intensifyEuropean firms call for AI Act pause",
    "link": "https://www.telecomtv.com/content/access-evolution/what-s-up-with-at-t-altice-france-ai-in-europe-53389/",
    "timestamp": "2025-07-04T14:35:21Z"
  },
  {
    "title": "Game on: Republicans, Democrats trade fire over Big Beautiful Bill in 2026 battle for Congress",
    "description": "Minutes after House Republicans gave Trump's Big, Beautiful bill final congressional passage, the messaging wars between the GOP and Democrats flared, ahead of 2026 midterm elections.",
    "link": "https://www.foxnews.com/politics/game-on-republicans-democrats-trade-fire-over-big-beautiful-bill-2026-battle-congress",
    "timestamp": "2025-07-04T14:35:20Z"
  },
  {
    "title": "For retailers, US-Vietnam trade deal leaves questions, Supplychain News, ET Supplychain",
    "description": "A new trade deal between the U.S. and Vietnam introduces tariffs, creating uncertainty for sportswear giants like Nike and Adidas, which heavily rely on Vietnamese factories. The U.S. will impose tariffs of 20% on many imports from Vietnam, while transshipmen…",
    "link": "https://supplychain.economictimes.indiatimes.com/news/marketing/for-retailers-us-vietnam-trade-deal-leaves-questions/122248012",
    "timestamp": "2025-07-04T14:35:12Z"
  },
  {
    "title": "The British Embassy’s Shady Fourth of July Tweet Speaks Volumes Without Saying Much",
    "description": "Centuries of unresolved transatlantic tension culminated in a simple tweet made by the U.K. diplomats.",
    "link": "https://www.huffpost.com/entry/the-british-embassy-shady-fourth-of-july-tweet_n_6867d94be4b0eb2c5aed8a39",
    "timestamp": "2025-07-04T14:34:14Z"
  },
  {
    "title": "Independence Day Proposal: Musk Once Again Calls for a Third Party to Disrupt US Politics",
    "description": "WASHINGTON (Sputnik) - US billionaire Elon Musk on Friday once again suggested the creation of a third party in the United States to \"break away\" from the two-party system and influence decision-making on \"contentious laws.\"",
    "link": "https://sputnikglobe.com/20250704/independence-day-proposal-musk-once-again-calls-for-a-third-party-to-disrupt-us-politics-1122396209.html",
    "timestamp": "2025-07-04T14:30:38Z"
  },
  {
    "title": "New NATO commander stresses unity at handover ceremony",
    "description": "MONS, Belgium (Reuters) -U.S. Air Force General Alexus Grynkewich took over on Friday as NATO's top military commander, sending a message of resolve and reassurance to allies concerned about potential cuts to U.S. forces in Europe by the Trump administration.…",
    "link": "https://www.thestar.com.my/news/world/2025/07/04/new-nato-commander-stresses-unity-at-handover-ceremony",
    "timestamp": "2025-07-04T14:30:00Z"
  },
  {
    "title": "OPEC+ Is Hunting for Market Share",
    "description": "Leaving Price Targets in the Past, OPEC+ Is Hunting for Market Share The upcoming OPEC+ meeting, initially planned for July 6 but subsequently moved a day earlier citing the Muslim holy day of Ashura, is set to see another expedited 411,000 b/d output increas…",
    "link": "https://oilprice.com/Energy/Energy-General/OPEC-Is-Hunting-for-Market-Share.html",
    "timestamp": "2025-07-04T14:30:00Z"
  },
  {
    "title": "This is the letter Donald Trump sent Apple to keep TikTok on the App Store",
    "description": "Tony Tan, a Google shareholder, has obtained and published a set of letters the Trump administration sent to multiple tech companies, essentially saying: don’t worry about the law, the president has your back, keep TikTok online.\n\n\n\nHowever, Mr. Tan disagrees…",
    "link": "https://9to5mac.com/2025/07/04/this-is-the-letter-donald-trump-sent-apple-to-keep-tiktok-on-the-app-store/",
    "timestamp": "2025-07-04T14:29:01Z"
  },
  {
    "title": "Trump Rally Fan With Giant ‘QAnon’ Patch Rants About Being Jailed For Jan 6",
    "description": "A Trump fan with a giant QAnon patch ranted about being jailed for Jan. 6 and \"poison\" vaccines as she waited for President Donald Trump to speak at a rally.\nThe post Trump Rally Fan With Giant ‘QAnon’ Patch Rants About Being Jailed For Jan 6 first appeared o…",
    "link": "https://www.mediaite.com/media/news/trump-rally-fan-with-giant-q-patch-rants-about-being-jailed-for-jan-6/",
    "timestamp": "2025-07-04T14:26:12Z"
  },
  {
    "title": "Albright College is Selling Its Art Collection to Cut $20 M. Deficit, But Donors Oppose the Move",
    "description": "The college is desperately trying to balance its books amid Trump's funding cuts for higher education.",
    "link": "https://www.artnews.com/art-news/news/albright-college-is-selling-its-art-collection-to-cut-20-m-deficit-but-donors-oppose-the-move-1234746861/",
    "timestamp": "2025-07-04T14:25:52Z"
  },
  {
    "title": "Trump uses antisemitic slur in remarks promoting his 'big, beautiful bill' (Nnamdi Egwuonwu/NBC News)",
    "description": "Nnamdi Egwuonwu / NBC News:\nTrump uses antisemitic slur in remarks promoting his ‘big, beautiful bill’  —  Speaking at the Iowa State Fairgrounds, the president used the word “Shylocks” when talking about bankers lending money to family farms.  —  President D…",
    "link": "https://www.memeorandum.com/250704/p28",
    "timestamp": "2025-07-04T14:25:00Z"
  },
  {
    "title": "Gaza hospital 'one massive trauma ward' as Palestinians shot trying to access food: WHO",
    "description": "Nasser Hospital in Gaza is operating as \"one massive trauma ward\" due to an influx of patients wounded at non-United Nations food distribution sites run by the Gaza Humanitarian Foundation, the World Health Organization said on Friday.",
    "link": "https://www.cbc.ca/news/world/gaza-aid-who-1.7577063",
    "timestamp": "2025-07-04T14:24:34Z"
  },
  {
    "title": "Ukraine deal must guarantee Russia’s security – Lavrov",
    "description": "The foreign minister reiterated Moscow’s key demands during a meeting with his Saudi counterpart Prince Faisal Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621002-ukraine-deal-guarantee-russia/",
    "timestamp": "2025-07-04T14:24:02Z"
  },
  {
    "title": "Sophia Hutchins’ Death: What Happened to Caitlyn Jenner’s Manager?",
    "description": "Hutchins was 29 when she was killed in an ATV accident in Malibu, California, reportedly near Caitlyn's home.",
    "link": "https://hollywoodlife.com/2025/07/04/sophia-hutchins-death-accident/",
    "timestamp": "2025-07-04T14:22:10Z"
  },
  {
    "title": "Israel aims to maintain ‘aerial superiority’ over Iran",
    "description": "Defence minister instructs armed forces to devise ‘enforcement plan’ for ceasefire",
    "link": "https://www.irishtimes.com/world/middle-east/2025/07/04/israel-aims-to-maintain-aerial-superiority-over-iran/",
    "timestamp": "2025-07-04T14:21:34Z"
  },
  {
    "title": "Can BRICS project unity amid global tensions?",
    "description": "The influence of BRICS, a global forum championed by China, Russia, and India, is on the rise. Still, even its major members have to negotiate internal conflicts amid challenges posed by the Trump administration. A two-day summit of the BRICS grouping of emer…",
    "link": "https://www.dw.com/en/can-brics-project-unity-amid-global-tensions/a-73158174",
    "timestamp": "2025-07-04T14:21:00Z"
  },
  {
    "title": "Can BRICS project unity amid global tensions?",
    "description": "The influence of BRICS, a global forum championed by China, Russia, and India, is on the rise. Still, even its major members have to negotiate internal conflicts amid challenges posed by the Trump administration.",
    "link": "https://www.dw.com/en/can-brics-project-unity-amid-global-tensions/a-73158174",
    "timestamp": "2025-07-04T14:21:00Z"
  },
  {
    "title": "Trump to Host UFC Event at White House for America’s 250th Birthday",
    "description": "With every passing day, Mike Judge’s Idiocracy feels like a self-fulfilling prophecy.\nTrump to Host UFC Event at White House for America’s 250th Birthday\nAlex Young",
    "link": "https://consequence.net/2025/07/trump-ufc-white-house/",
    "timestamp": "2025-07-04T14:20:15Z"
  },
  {
    "title": "Trump, Merz said to have talked Ukraine's defense",
    "description": "German Chancellor Friedrich Merz supposedly spoke with United States President Donald Trump yesterday about the Ukrainian defense system, Spiegel reported on Friday.According to the media outlet, Merz...",
    "link": "https://biztoc.com/x/44a8a450e09d22be",
    "timestamp": "2025-07-04T14:19:37Z"
  },
  {
    "title": "Fresh Push to Add Donald Trump to Mount Rushmore: 'Essential'",
    "description": "A Tennessee congressman believes it is \"essential\" to add President Trump to Mount Rushmore to commemorate his \"recent achievements.\"",
    "link": "https://biztoc.com/x/0586a8b8422ea0bf",
    "timestamp": "2025-07-04T14:19:33Z"
  },
  {
    "title": "Trump says he didn’t know an offensive term he used in a speech is considered antisemitic",
    "description": "President Donald Trump told reporters early Friday after returning from an event in Iowa that he had “never heard it that way” and “never heard that” the term was considered an offensive stereotype about Jews.",
    "link": "https://biztoc.com/x/09a776b07dd0ecee",
    "timestamp": "2025-07-04T14:19:22Z"
  },
  {
    "title": "Trump Expects Hamas Answer In 24 Hours On 'Final' Peace Proposal",
    "description": "Trump Expects Hamas Answer In 24 Hours On 'Final' Peace Proposal\n \nPresident Donald Trump announced Friday that it would likely become clear within 24 hours whether Hamas would accept what he described as a \"final proposal\" for a ceasefire with Israel in Gaza…",
    "link": "https://biztoc.com/x/8dc9c60e7f61dd5f",
    "timestamp": "2025-07-04T14:19:18Z"
  },
  {
    "title": "Church Doubles Down After Preacher Encouraged Prayers for LGBTQ Deaths",
    "description": "A preacher from the Sure Foundation Baptist Church in Indianapolis said LGBTQ+ people \"deserve the death penalty.\"",
    "link": "https://www.newsweek.com/church-preacher-lgbtq-deaths-indianapolis-2094734",
    "timestamp": "2025-07-04T14:18:48Z"
  },
  {
    "title": "EU weighs skeleton US trade deal with 10 percent tariff",
    "description": "Brussels seeks backing from member countries, with days to go before Donald Trump’s deadline to do a deal or face 50 percent tariffs.",
    "link": "https://www.politico.eu/article/eu-us-skeleton-trade-deal-10-percent-tariff/",
    "timestamp": "2025-07-04T14:17:05Z"
  },
  {
    "title": "Trump's 'big beautiful bill' hands senior citizens a surprise but there's a catch",
    "description": "President Donald Trump's 'big, beautiful bill' hands a hefty tax cut to some American seniors. The Senate proposal includes a temporary $6,000 deduction for seniors over the age of 65, contrasted with the House proposal, which includes a temporary deduction o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-social-security-tax-break-trumps-big-beautiful-bill-gives-some-american-seniors-hefty-tax-break-story-in-10-points/articleshow/122252502.cms",
    "timestamp": "2025-07-04T14:13:35Z"
  },
  {
    "title": "Trump says he didn’t know an offensive term he used in a speech is considered antisemitic",
    "description": "President Donald Trump told reporters early Friday after returning from an event in Iowa that he had “never heard it that way” and “never heard that” the term was considered an offensive stereotype about Jews.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-he-didnt-know-an-offensive-term-he-used-in-a-speech-is-considered-antisemitic",
    "timestamp": "2025-07-04T14:10:03Z"
  },
  {
    "title": "On US Independence Day, 44% in California, the world’s 4th largest economy, want to secede - is a breakaway vote next?",
    "description": "California independence movement is gaining momentum, with fresh 2025 YouGov poll results revealing that most Californians now trust Sacramento more than Washington. A rising 71% want California autonomous status, and 56% say Californians would be better off …",
    "link": "https://economictimes.indiatimes.com/news/international/us/on-us-independence-day-44-in-california-the-worlds-4th-largest-economy-want-to-secede-is-a-breakaway-vote-next/articleshow/122250534.cms",
    "timestamp": "2025-07-04T14:09:31Z"
  },
  {
    "title": "Fresh Push to Add Donald Trump to Mount Rushmore: 'Essential'",
    "description": "A Tennessee congressman believes it is \"essential\" to add President Trump to Mount Rushmore to commemorate his \"recent achievements.\"",
    "link": "https://www.newsweek.com/fresh-push-donald-trump-mount-rushmore-2094748",
    "timestamp": "2025-07-04T14:08:39Z"
  },
  {
    "title": "Liberals’ Latest Anti-Trump Crusade Proves Embarrassing Bust",
    "description": "For a contingent of liberals, America’s Independence Day is the perfect opportunity to stage yet another impotent, anti-Trump protest",
    "link": "https://dailycaller.com/2025/07/04/liberals-no-kings-womens-march-protest-july-fourth-donald-trump/",
    "timestamp": "2025-07-04T14:08:33Z"
  },
  {
    "title": "Merz said to spoke with Trump over Ukrainian defense",
    "description": "German Chancellor Friedrich Merz supposedly spoke with United States President Donald Trump yesterday about the Ukrainian defense system, Spiegel reported on Friday.According to the media outlet, Merz...",
    "link": "https://biztoc.com/x/293dd29d456ae2b8",
    "timestamp": "2025-07-04T14:08:21Z"
  },
  {
    "title": "‘I’d Be Careful What You Read’: 7 Times Trump Officials Turned Tables On Dem Lawmakers Trying To Corner Them",
    "description": "President Donald Trump's administration has had enter shouting matches as Democrat congressional members have bombarded them with harsh questioning.",
    "link": "https://dailycaller.com/2025/07/04/congressional-hearings-heated-clashes-trump/",
    "timestamp": "2025-07-04T14:07:11Z"
  },
  {
    "title": "Why is Iran doubling down on its nuclear program?",
    "description": "Tehran seems defiant on its nuclear ambitions despite the recent war. The nuclear program, launched with US help during the Shah era, was always a show of strength. Now, it also symbolizes the regime's resilience.",
    "link": "https://www.dw.com/en/why-is-iran-doubling-down-on-its-nuclear-program/a-73159108",
    "timestamp": "2025-07-04T14:07:00Z"
  },
  {
    "title": "Bombshell Claim About Hegseth's Excuse for Slashing Aid...",
    "description": "Bombshell Claim About Hegseth's Excuse for Slashing Aid...\r\n\n \n \n \n (Third column, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Putin pounds Ukraine with record war blitz moments after Trump call...\r\nPlots Summer of Relentless Attacks...\r\nKGB-linked oil tyco…",
    "link": "https://dnyuz.com/2025/07/04/dem-makes-bombshell-claim-about-hegseths-excuse-for-slashing-ukraine-aid/",
    "timestamp": "2025-07-04T14:04:40Z"
  },
  {
    "title": "America Killing Its Chance to Find Alien Life...",
    "description": "America Killing Its Chance to Find Alien Life...\r\n\n \n \n \n (First column, 10th story, link)",
    "link": "https://www.theatlantic.com/science/archive/2025/07/nasa-observatory-funding-trump-alien-life/683427/",
    "timestamp": "2025-07-04T14:04:37Z"
  }
]