[
  {
    "title": "Trump presides over third government shutdown, with fresh opportunity to fire thousands of workers and close down federal offices",
    "description": "Plunged into a government shutdown, the U.S. is confronting a fresh cycle of uncertainty after President Donald Trump and Congress failed to strike an agreement to keep government programs and services running by Wednesday’s deadline.\nRoughly 750,000 federal …",
    "link": "https://biztoc.com/x/c63063f256f617ca",
    "timestamp": "2025-10-01T13:54:50Z"
  },
  {
    "title": "Big pharma and Trump announce reduced prices on prescription drugs. Here’s who’s offering discounts",
    "description": "Several pharmaceutical companies have said they will sell drugs direct to patients in the U.S. and offered discounts following President Donald Trump’s calls to bring down drug prices and cut out “middlemen” like pharmacies, insurers and pharmacy benefit mana…",
    "link": "https://biztoc.com/x/f16bb5be024aaa6b",
    "timestamp": "2025-10-01T13:54:41Z"
  },
  {
    "title": "'Answer the question!' Mike Johnson denies Trump quote in nasty spat with ABC host",
    "description": "House Speaker Mike Johnson (R-LA) refused to respond to President Donald Trump's proposed plan to use \"dangerous\" U.S. cities as \"training grounds\" for military troops.During a Wednesday interview on ABC, host George Stephanopoulos asked Johnson about a remar…",
    "link": "https://www.rawstory.com/mike-johnson-trump-military/",
    "timestamp": "2025-10-01T13:52:20Z"
  },
  {
    "title": "How IRS will take more steps next year to discourage paper refund checks",
    "description": "Taxpayers who typically receive tax refunds by paper check could be surprised next year when the IRS initiates new steps to spur direct deposit.",
    "link": "https://www.usatoday.com/story/money/taxes/2025/10/01/irs-paper-refund-checks/86453840007/",
    "timestamp": "2025-10-01T13:51:11Z"
  },
  {
    "title": "The Violent Spawn of the Greatest Generation: How the Baby Boomers Poisoned America",
    "description": "Politics is a dirty business. It always has been. But today, politics is sometimes too often synonymous with violence. While there were many catalysts that resulted in violence being seen as a “legitimate” form of political discourse, one stands out: Columbia…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343673/posts",
    "timestamp": "2025-10-01T13:50:11Z"
  },
  {
    "title": "US offers security guarantees to Qatar after Israel strikes: White House",
    "description": "The U.S. has pledged security guarantees to Qatar after last month’s Israeli strike on its territory. An Executive Order signed by President Donald Trump said Washington will treat any armed attack on Qatar as a threat and respond with diplomatic, economic, o…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-offers-security-guarantees-to-qatar-after-israel-strikes-white-house/articleshow/124260779.cms",
    "timestamp": "2025-10-01T13:49:47Z"
  },
  {
    "title": "Elon Musk Says He Is Building Grokipedia, An AI-Powered Wikipedia Rival",
    "description": "Elon Musk announced that his artificial intelligence (AI) company xAI will be building Grokipedia, which according to the billionaire is meant to serve as an alternative to Wikipedia. Musk made a post on his social media platform 'X' writing, \"We are building…",
    "link": "https://www.ndtvprofit.com/technology/elon-musk-says-he-is-building-grokipedia-an-ai-powered-wikipedia-rival",
    "timestamp": "2025-10-01T13:46:41Z"
  },
  {
    "title": "U.S. Private Sector Shed Most Jobs In Two Years Last Month",
    "description": "Employers have become more cautious with hiring, despite earlier strong economic growth, economists said.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/01/us-private-sector-shed-most-jobs-in-two-years-last-month/",
    "timestamp": "2025-10-01T13:45:38Z"
  },
  {
    "title": "Jimmy Kimmel Tells Stephen Colbert He Believed 'Live!' Was Toast",
    "description": "Jimmy Kimmel and Stephen Colbert dropped by each other's late shows Tuesday at the Brooklyn Academy of Music for a crossover episode ... and shed some light on the high-stakes drama both programs have been through. Obviously, Kimmel had the most to…\n Permalink",
    "link": "https://www.tmz.com/2025/10/01/jimmy-kimmel-thought-show-ending-stephen-colbert/",
    "timestamp": "2025-10-01T13:45:33Z"
  },
  {
    "title": "E.J. Antoni’s failed nomination makes the White House look even more incompetent",
    "description": "E.J. Antoni was a cartoonishly poor choice to lead the Bureau of Labor Statistics. His failed nomination makes the White House look even more incompetent.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ej-antonis-failed-nomination-makes-white-house-look-even-incompetent-rcna234896",
    "timestamp": "2025-10-01T13:45:32Z"
  },
  {
    "title": "What’s behind Europe’s sharp drop in illegal migration?",
    "description": "Fall in migrant crossings won’t head off tougher immigration clampdowns",
    "link": "https://theweek.com/politics/whats-behind-europes-sharp-drop-in-illegal-migration",
    "timestamp": "2025-10-01T13:45:23Z"
  },
  {
    "title": "MSNBC’s Jen Psaki Straight-Up Asks Jeffries What He’ll ‘Say to Trump’s Face’ Next Time After ‘Racist’ Attacks",
    "description": "Jen Psaki straight-up asked Hakeem Jeffries (D-NY) what he would say \"to President Donald Trump’s face\" after a pair of attacks that Jeffries called \"racist.\"\nThe post MSNBC’s Jen Psaki Straight-Up Asks Jeffries What He’ll ‘Say to Trump’s Face’ Next Time Afte…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-jen-psaki-straight-up-asks-jeffries-what-hell-say-to-trumps-face-next-time-after-racist-attacks/",
    "timestamp": "2025-10-01T13:44:42Z"
  },
  {
    "title": "Stephen Miller Stews Over Newsom Diss But Critics Show Why He Has No Right To",
    "description": "The Trump adviser had a bunch of receipts thrown in his face for complaining about a certain word.",
    "link": "https://www.huffpost.com/entry/stephen-miller-fascist-gavin-newsom_n_68dd092fe4b06c0a3a8b894d",
    "timestamp": "2025-10-01T13:44:06Z"
  },
  {
    "title": "Trump Administration Flouts Ethics Rules In Shutdown Fight",
    "description": "The Trump administration is brazenly flouting ethics guidelines as it tries to pin the shutdown on the Democratic Party.",
    "link": "https://www.huffpost.com/entry/federal-workers-email-government-shutdown_n_68dd29f7e4b06c0a3a8ba294",
    "timestamp": "2025-10-01T13:43:35Z"
  },
  {
    "title": "Trump: Government Shutdown Could Do 'A Lot of Good'",
    "description": "Welcome to the club: President Donald Trump says \"a lot of good\" might come from the government shutdown.\n\"We can get rid of a lot of things that we didn't want and they'd be Democrat things,\" Trump told the press on Tuesday. \"They just don't learn. So we hav…",
    "link": "https://biztoc.com/x/6f9ae64688dae90b",
    "timestamp": "2025-10-01T13:43:19Z"
  },
  {
    "title": "Mark Cuban Grades Trump's Online Drug Store 'B,' Plans To Give It An 'A' If These Changes Happen: 'Trump Gets All The Credit'",
    "description": "Mark Cuban, the billionaire entrepreneur and investor, has given a cautious “B” grade to President Donald Trump’s new online drug store venture, TrumpRx.gov. \nCuban Sees Potential In Trump’s Drug Venture For Patients\nCuban, the founder of Cost Plus Drugs, a d…",
    "link": "https://biztoc.com/x/e4e04b08c53b18c7",
    "timestamp": "2025-10-01T13:43:17Z"
  },
  {
    "title": "What China’s Lavish Military Parade Revealed to the World",
    "description": "On September 3rd, Beijing’s Tiananmen Square once again became the world’s eye-popping focus. A grand military parade commemorating the 80th anniversary of China’s victory in the War of Resistance Against Japanese Aggression and the World Anti-Fascist War (Wo…",
    "link": "https://www.fairobserver.com/business/technology/what-chinas-lavish-military-parade-revealed-to-the-world/",
    "timestamp": "2025-10-01T13:40:26Z"
  },
  {
    "title": "Dollar Extends Declines as US Government Shutdown Begins",
    "description": "The Bloomberg Dollar Spot Index fell 0.2% and was on track for a fourth day of declines, while the yen led Group-of-10 gained versus the greenback and...",
    "link": "https://finance.yahoo.com/news/dollar-extends-losing-streak-us-085619650.html",
    "timestamp": "2025-10-01T13:39:14Z"
  },
  {
    "title": "Trump’s Made-for-TV Quantico Spectacle: Generals Refused to Be Agitprops",
    "description": "Trump turned a routine military address at Quantico into a made-for-TV loyalty spectacle—but the generals sat silent, refusing to be agitprops.\nThe post Trump’s Made-for-TV Quantico Spectacle: Generals Refused to Be Agitprops first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trumps-made-for-tv-quantico-spectacle-generals-refused-to-be-agitprops/",
    "timestamp": "2025-10-01T13:37:04Z"
  },
  {
    "title": "FO° Talks: Pakistan Develops Closer Ties with US and China After May’s Clashes with India",
    "description": "Rohan Khattar Singh, Fair Observer’s Video Producer & Social Media Manager, speaks with Cherish Mathson, a retired Lieutenant General of the Indian Army, about the aftermath of the May 2025 clashes between India and Pakistan. They focus on India’s military po…",
    "link": "https://www.fairobserver.com/region/central_south_asia/fo-talks-pakistan-develops-closer-ties-with-us-and-china-after-mays-clashes-with-india/",
    "timestamp": "2025-10-01T13:36:59Z"
  },
  {
    "title": "Walmart goes WalMAHA with plan to remove food dyes and 30 other ingredients from all store brans sold in the U.S.",
    "description": "Walmart said the 14-month reformulation plan primarily would involve its largest private-label food brand, Great Value.",
    "link": "https://fortune.com/2025/10/01/walmart-food-dyes-robert-kennedy-maha/",
    "timestamp": "2025-10-01T13:35:38Z"
  },
  {
    "title": "Israeli strikes in Gaza kill at least 16 Palestinians as Hamas mulls its response to Trump’s plan",
    "description": "The dead on Wednesday included people who had sought refuge in a school sheltering the displaced in Gaza City. Al-Falah school in the city's eastern Zeitoun neighborhood was hit twice, minutes apart.",
    "link": "https://www.pbs.org/newshour/world/israeli-strikes-in-gaza-kill-at-least-16-palestinians-as-hamas-mulls-its-response-to-trumps-plan",
    "timestamp": "2025-10-01T13:35:15Z"
  },
  {
    "title": "Disarmament, Israeli withdrawal, and faction expulsion: Hamas wants Trump’s Gaza peace plan tweaked",
    "description": "Hamas leaders are also seeking \"international guarantees for a full Israeli withdrawal from the Gaza Strip\" and assurances that no assassination attempts will be carried out inside or outside the territory",
    "link": "https://indianexpress.com/article/world/disarmament-israeli-withdrawal-and-faction-expulsion-hamas-wants-trumps-gaza-peace-plan-tweaked-10282461/",
    "timestamp": "2025-10-01T13:33:59Z"
  },
  {
    "title": "Everything We Know About US Government Shutdown: What It Means, When It Last Happened And Why It's Back",
    "description": "The US federal government has shut down for the first time since 2019, halting non-essential services, furloughing hundreds of thousands of workers, and igniting a bitter political fight over healthcare funding.",
    "link": "https://www.ibtimes.com/everything-we-know-about-us-government-shutdown-what-it-means-when-it-last-happened-why-its-back-3785041",
    "timestamp": "2025-10-01T13:33:40Z"
  },
  {
    "title": "Partial government shutdown begins as nation faces new period of uncertainty",
    "description": "Democrats picked this fight as they demand funding to save health care subsidies that are expiring and sending insurance costs soaring and Republicans have refused to negotiate.",
    "link": "https://www.pbs.org/newshour/politics/partial-government-shutdown-begins-as-nation-faces-new-period-of-uncertainty",
    "timestamp": "2025-10-01T13:33:15Z"
  },
  {
    "title": "Here’s How Many Military Leaders Liked Trump and Hegseth’s Speeches",
    "description": "Defense Secretary Pete Hegseth forced hundreds of America’s top military commanders to attend an in-person assembly at Quantico, but practically no one was impressed with its messaging.Over the course of 45 minutes, Hegseth railed against “woke ideology,” tra…",
    "link": "https://newrepublic.com/post/201175/donald-trump-pete-hegseth-military-leaders-speeches",
    "timestamp": "2025-10-01T13:33:14Z"
  },
  {
    "title": "Not Only Tulsi: Three Members of Congress Also Spied On In Quiet Skies Program",
    "description": "Exclusive: new Senate documents show members of Congress, others placed under an intrusive surveillance for dubious reasons under now-defunct TSA program \\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\=\\ Ahead of Tuesday hearings on the subject,…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343668/posts",
    "timestamp": "2025-10-01T13:31:39Z"
  },
  {
    "title": "Nation Faces New Period Of Uncertainty Amid Government Shutdown",
    "description": "Plunged into a government shutdown, the U.S. is confronting a fresh cycle of uncertainty after Trump and Congress failed to strike an agreement to keep government programs and services running by Wednesday’s deadline.",
    "link": "https://www.huffpost.com/entry/ap-us-government-shutdown-trump-congress-uncertainty_n_68dd2b8de4b0b11989f07cde",
    "timestamp": "2025-10-01T13:29:25Z"
  },
  {
    "title": "Immigration Data Indicate Indian Student Enrollment May Plummet",
    "description": "Immigration data show a drop of nearly 50% for arriving international students from India in July and August 2025 compared to one year ago.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/10/01/immigration-data-indicate-indian-student-enrollment-may-plummet/",
    "timestamp": "2025-10-01T13:26:40Z"
  },
  {
    "title": "Trump Sets the Stage for Massive Federal Layoffs as Shutdown Begins: 'It's Only Because of the Democrats'",
    "description": "Trump Sets the Stage for Massive Federal Layoffs as Shutdown Begins: 'It's Only Because of the Democrats'westernjournal.com",
    "link": "https://www.westernjournal.com/trump-sets-stage-massive-federal-layoffs-shutdown-begins-democrats/",
    "timestamp": "2025-10-01T13:24:45Z"
  },
  {
    "title": "Denmark warns that Russia is waging a hybrid war on Europe, as EU leaders gather for security talks",
    "description": "Danish Prime Minister Mette Frederiksen is warning that Europe is in a hybrid war with Russia and must arm itself.",
    "link": "https://www.bostonherald.com/2025/10/01/denmark-issues-eu-russia-warning/",
    "timestamp": "2025-10-01T13:23:25Z"
  },
  {
    "title": "Tariffs may bring a US$50 billion monthly boost to the US government. But ordinary Americans won’t feel the benefit",
    "description": "Donald Trump appears unbothered by the impact of his trade policy on US consumers.",
    "link": "https://theconversation.com/tariffs-may-bring-a-us-50-billion-monthly-boost-to-the-us-government-but-ordinary-americans-wont-feel-the-benefit-265542",
    "timestamp": "2025-10-01T13:22:58Z"
  },
  {
    "title": "Trump, Congress Deadlock Triggers First Government Shutdown Since 2019",
    "description": "The federal government shut down at 12:01 a.m. after Congress failed to pass a stopgap funding bill before the Oct. 1 deadline.",
    "link": "https://dailycaller.com/2025/10/01/federal-government-shutdown-chuck-schumer-hakeem-jeffries-house-senate/",
    "timestamp": "2025-10-01T13:21:11Z"
  },
  {
    "title": "Maxine Waters Snaps at Pro-MAGA Reporter Confronting Her on Shutdown: ‘Stop It! This Is the Kind of Journalism We Don’t Need’",
    "description": "Maxine Waters snapped at a reporter confronting her on the current shutdown and whether Democrats are fighting for \"healthcare for illegal immigrants.\"\nThe post Maxine Waters Snaps at Pro-MAGA Reporter Confronting Her on Shutdown: ‘Stop It! This Is the Kind o…",
    "link": "https://www.mediaite.com/media/news/maxine-waters-snaps-at-pro-maga-reporter-confronting-her-on-shutdown-stop-it-this-is-the-kind-of-journalism-we-dont-need/",
    "timestamp": "2025-10-01T13:21:08Z"
  },
  {
    "title": "Export controls now a key factor in AI chip development – adding risk for the whole industry",
    "description": "The physics of transistors and politics of trading licenses are colliding on the AI frontier Analysis  Few of us would have imagined that national security would play such a key role in AI hardware, even dictating its development, but here we are – in a new e…",
    "link": "https://www.theregister.com/2025/10/01/the_risks_of_export_controls/",
    "timestamp": "2025-10-01T13:20:59Z"
  },
  {
    "title": "No One Seems To Be Watching Hakeem Jeffries’ Livestream Trying To Blame GOP For Shutdown",
    "description": "House Minority Leader Hakeem Jeffries' YouTube livestream about the government shutdown has garnered less than 100 views after being uploaded for several hours.",
    "link": "https://dailycaller.com/2025/10/01/hakeem-jeffries-livestream-shutdown-viewers/",
    "timestamp": "2025-10-01T13:20:31Z"
  },
  {
    "title": "FCC Reconsiders Ban on Big Four TV Networks Being Owned by One Company",
    "description": "During normal times, the average American wouldn't be able to name the FCC chairman.",
    "link": "https://gizmodo.com/fcc-reconsiders-ban-on-big-four-tv-networks-being-owned-by-one-company-2000665921",
    "timestamp": "2025-10-01T13:20:30Z"
  },
  {
    "title": "Report: Israel's strike in Doha sowed seeds of Trump's Gaza peace plan",
    "description": "Israeli journalist Barak Ravid reports that Trump advisers Steve Witkoff and Jared Kushner were horrified by the strike in Qatar, but saw an opportunity that became the 20-point Gaza peace plan.",
    "link": "https://www.israelnationalnews.com/news/415691",
    "timestamp": "2025-10-01T13:19:45Z"
  },
  {
    "title": "How a U.S. government shutdown could impact global markets",
    "description": "Global investors are weighing how much of an impact the shutdown may have on markets.",
    "link": "https://www.cnbc.com/2025/10/01/how-a-us-government-shutdown-could-impact-global-markets.html",
    "timestamp": "2025-10-01T13:19:39Z"
  },
  {
    "title": "The Trump–Netanyahu Gaza Peace Deal Promises Indefinite Occupation",
    "description": "“This is a continuation of the occupation, if not a continuation of the war by other means.”\nThe post The Trump–Netanyahu Gaza Peace Deal Promises Indefinite Occupation appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/01/trump-israel-gaza-peace-deal/",
    "timestamp": "2025-10-01T13:19:12Z"
  },
  {
    "title": "Dollar falls on U.S. government shutdown, now on pace for worst annual decline in 22 years",
    "description": "The dollar fell Wednesday after U.S. lawmakers failed to avert a government shutdown, raising questions from traders about the potential economic impact.",
    "link": "https://www.cnbc.com/2025/10/01/dollar-falls-on-us-government-shutdown-now-on-pace-for-worst-annual-decline-in-22-years.html",
    "timestamp": "2025-10-01T13:19:04Z"
  },
  {
    "title": "Pfizer Drug-Pricing Deal: More Upside For PFE Stock?",
    "description": "The announcement made yesterday regarding Pfizer’s agreement with the White House to reduce drug prices in exchange for a three-year exemption from 100% tariffs...",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/01/pfizer-drug-pricing-deal-more-upside-for-pfe-stock/",
    "timestamp": "2025-10-01T13:18:52Z"
  },
  {
    "title": "Nasdaq and S&P 500 end mixed, gold hits record as US government shuts down",
    "description": "S&P 500 futures and Nasdaq futures dropped about 0.5% each on Wednesday. Gold prices climbed to $3,895 an ounce, hitting a record high for a third straight session",
    "link": "https://www.thehindubusinessline.com/markets/nasdaq-and-sp-500-end-mixed-gold-hits-record-as-us-government-shuts-down/article70116366.ece",
    "timestamp": "2025-10-01T13:17:57Z"
  },
  {
    "title": "Trump shields immigration and trade from shutdown fallout",
    "description": "As Washington enters a government shutdown, the Trump administration has erected safeguards to ensure President Donald Trump’s most hardline priorities continue unscathed.Agencies central to Trump’s agenda are shielding certain programs by declaring the feder…",
    "link": "https://freerepublic.com/focus/f-chat/4343664/posts",
    "timestamp": "2025-10-01T13:17:26Z"
  },
  {
    "title": "Government enters partial shutdown as Dems refuse to give up spending spree demands",
    "description": "Insisted on failed effort to have GOP agree to hand out $1.5 trillion to favorite people",
    "link": "https://www.wnd.com/2025/10/government-enters-partial-shutdown-as-dems-refuse-give/",
    "timestamp": "2025-10-01T13:17:24Z"
  },
  {
    "title": "The Trump crypto firm is planning expansion, from tokenized commodities to debit cards",
    "description": "World Liberty Financial is planning to launch new products, including a debit card and tokenized commodity assets, as the Trump crypto empire continues to grow.",
    "link": "https://www.cnbc.com/2025/10/01/trump-crypto-firm-expansion-with-tokenized-commodities-debit-cards.html",
    "timestamp": "2025-10-01T13:17:13Z"
  },
  {
    "title": "India-EFTA trade deal couldn't have come at better time, it will be like a booster: Swiss State Secretary",
    "description": "India-EFTA trade pact boosts economic ties, investment, and cooperation, marking a significant milestone in bilateral relations.",
    "link": "https://www.thehindubusinessline.com/economy/india-efta-trade-deal-couldnt-have-come-at-better-time-it-will-be-like-a-booster-swiss-state-secretary/article70116336.ece",
    "timestamp": "2025-10-01T13:16:45Z"
  },
  {
    "title": "UK government issues new order to Apple to create a backdoor into iCloud storage service",
    "description": "The UK government has issued a new order to Apple to create a backdoor into its iCloud storage service, this time targeting British…\nThe post UK government issues new order to Apple to create a backdoor into iCloud storage service appeared first on MacDailyNe…",
    "link": "https://macdailynews.com/2025/10/01/uk-government-issues-new-order-to-apple-to-create-a-backdoor-into-icloud-storage-service/",
    "timestamp": "2025-10-01T13:16:38Z"
  },
  {
    "title": "Is Russia’s economy at risk as oil revenues shrink?",
    "description": "Russia plans to raise tax to fund its defence budget as oil revenues decline.",
    "link": "https://www.aljazeera.com/video/counting-the-cost/2025/10/1/are-russians-footing-the-bill-for-the-war-in-ukraine",
    "timestamp": "2025-10-01T13:16:32Z"
  },
  {
    "title": "Is Russia’s economy at risk as oil revenues shrink?",
    "description": "Russia plans to raise tax to fund its defence budget as oil revenues decline.",
    "link": "https://www.aljazeera.com/video/counting-the-cost/2025/10/1/is-russia-economy-at-risk-as-oil-revenues-shrink",
    "timestamp": "2025-10-01T13:16:32Z"
  },
  {
    "title": "Prediction markets see government shutdown lasting nearly two weeks",
    "description": "On Polymarket, traders see the highest likelihood that the government won't reopen until October 15 or later.",
    "link": "https://www.cnbc.com/2025/10/01/prediction-markets-see-government-shutdown-lasting-nearly-two-weeks.html",
    "timestamp": "2025-10-01T13:16:22Z"
  },
  {
    "title": "LOL: Trump Doubles Down on Trolling — Roasts Hakeem Jeffries Again After His Meltdown Over Meme Video",
    "description": "On Tuesday, President Trump doubled down on his trolling of House Minority Leader Hakeem Jeffries after Jeffries’ epic meltdown over a meme video.\nThe post LOL: Trump Doubles Down on Trolling — Roasts Hakeem Jeffries Again After His Meltdown Over Meme Video a…",
    "link": "https://www.thegatewaypundit.com/2025/10/lol-trump-doubles-down-trolling-roasts-hakeem-jeffries/",
    "timestamp": "2025-10-01T13:15:45Z"
  },
  {
    "title": "Trump's threats against late-night TV could spell more trouble for advertisers",
    "description": "The recent upheaval in late-night programming has shown a spotlight on ratings and revenue — and spurred questions of political influence.",
    "link": "https://www.cnbc.com/2025/10/01/trump-late-night-tv-threats-trouble-advertisers.html",
    "timestamp": "2025-10-01T13:15:02Z"
  },
  {
    "title": "Pritzker compares Trump to Putin, calls for invoking 25th Amendment for suggesting military use Chicago as \"training grounds\" (Chris Tye/CBS News)",
    "description": "Chris Tye / CBS News:\nPritzker compares Trump to Putin, calls for invoking 25th Amendment for suggesting military use Chicago as “training grounds”  —  After President Donald Trump on Tuesday suggested cities like Chicago should be used as “training grounds f…",
    "link": "https://www.memeorandum.com/251001/p33",
    "timestamp": "2025-10-01T13:15:01Z"
  },
  {
    "title": "Study: Children rely on Medicaid, but many face coverage gaps",
    "description": "The majority of U.S. children enroll in Medicaid or CHIP during childhood, but many won't stay covered for 18 years, indicating worsening coverage gaps under the Big Beautiful Bill.",
    "link": "https://www.techtarget.com/healthcarepayers/news/366632259/Study-Children-rely-on-Medicaid-but-many-face-coverage-gaps",
    "timestamp": "2025-10-01T13:15:00Z"
  },
  {
    "title": "DAVID MARCUS: In Democrat Portland, luxury, vagrancy and total disorder",
    "description": "",
    "link": "https://www.foxnews.com/opinion/david-marcus-democrat-portland-luxury-vagrancy-total-disorder",
    "timestamp": "2025-10-01T13:14:12Z"
  },
  {
    "title": "Walmart sets a timeline for removing synthetic dyes and other additives from its food brands",
    "description": "Walmart says its goal would affect about 1,000 products, including salty snacks, baked goods, power drinks, salad dressings and frosting.",
    "link": "https://www.bostonherald.com/2025/10/01/walmart-removing-synthetic-dyes-additives/",
    "timestamp": "2025-10-01T13:12:52Z"
  },
  {
    "title": "Walmart sets a timeline for removing synthetic dyes and other additives from its food brands",
    "description": "Walmart says its goal would affect about 1,000 products, including salty snacks, baked goods, power drinks, salad dressings and frosting.",
    "link": "https://www.denverpost.com/2025/10/01/walmart-removing-synthetic-dyes-additives/",
    "timestamp": "2025-10-01T13:12:52Z"
  },
  {
    "title": "Hamas wants to amend disarmament clause in Trump plan: Source close to group leaders",
    "description": "Hamas officials are seeking amendments to US President Donald Trump's Gaza peace plan, specifically challenging clauses on disarmament and the expulsion of cadres. The group also demands international guarantees for a full Israeli withdrawal and protection fr…",
    "link": "https://economictimes.indiatimes.com/news/defence/hamas-wants-to-amend-disarmament-clause-in-trump-plan-source-close-to-group-leaders/articleshow/124260140.cms",
    "timestamp": "2025-10-01T13:10:51Z"
  },
  {
    "title": "Denmark warns that Russia is waging a hybrid war on Europe, as EU leaders gather for security talks",
    "description": "Danish Prime Minister Mette Frederiksen warned European leaders that Russia is waging a hybrid war, urging the continent to rearm and prepare for potential aggression by 2030. Following recent drone incidents, leaders are discussing increased military support…",
    "link": "https://economictimes.indiatimes.com/news/defence/denmark-warns-that-russia-is-waging-a-hybrid-war-on-europe-as-eu-leaders-gather-for-security-talks/articleshow/124260119.cms",
    "timestamp": "2025-10-01T13:09:33Z"
  },
  {
    "title": "As the government shutdown begins, Trump isn’t doing Republicans any favors",
    "description": "As the government shutdown gets underway, and partisans scramble to assign and avoid blame, Donald Trump is making things worse for himself and Republicans.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/government-shutdown-begins-trump-isnt-republicans-favors-rcna234876",
    "timestamp": "2025-10-01T13:06:33Z"
  },
  {
    "title": "Why the politics of cancellation never works",
    "description": "Whether left or right, practising the politics of cancellation is always a mistake. Inclusion is always the antidote and the best method of problem-solving.",
    "link": "https://theconversation.com/why-the-politics-of-cancellation-never-works-266034",
    "timestamp": "2025-10-01T13:05:36Z"
  },
  {
    "title": "Yuan and Aussie dollar gain share in global reserves as dollar dips, IMF data shows",
    "description": "LONDON :The Chinese yuan and Australian dollar increased their share in global currency reserves in the second quarter, data from the International Monetary Fund shows, while the U.S. dollar and euro lost a little ground, adjusted for exchange rate swings. Th…",
    "link": "https://www.channelnewsasia.com/business/yuan-and-aussie-dollar-gain-share-in-global-reserves-dollar-dips-imf-data-shows-5380091",
    "timestamp": "2025-10-01T13:03:21Z"
  },
  {
    "title": "GENIUS and CLARITY ACT: US Financial Institutions entering the digital space (Carlo R.W. De Meijer)",
    "description": "Since President Trump has signed the GENIUS Act a lot has been published on what that could bring to...",
    "link": "https://www.finextra.com/blogposting/29493/genius-and-clarity-act-us-financial-institutions-entering-the-digital-space",
    "timestamp": "2025-10-01T13:02:57Z"
  },
  {
    "title": "Julius Malema: South African firebrand MP convicted of firing a gun in public",
    "description": "Julius Malema, known for his incendiary rhetoric, was recently convicted of hate speech.",
    "link": "https://www.bbc.co.uk/news/articles/c79vj85px54o",
    "timestamp": "2025-10-01T13:02:42Z"
  },
  {
    "title": "Exclusive: Protecting America Initiative Ad Highlights National Security Issues of Chinese-Made Medical Supplies",
    "description": "There is a real danger in the Chinese Communist Party's (CCP) involvement in so many facets of American life, including making our medical supplies, as the Protecting America Initiative makes clear in a six-figure ad campaign first obtained by Breitbart News.…",
    "link": "https://www.breitbart.com/politics/2025/10/01/exclusive-protecting-america-initiative-ad-highlights-national-security-chinese-medical-supplies/",
    "timestamp": "2025-10-01T13:00:36Z"
  },
  {
    "title": "Trump Admin Says Minnesota Violated Title IX Over Males in Female Sports",
    "description": "Minnesota allowing males in female sports hit national news over a male pitcher on the softball team.\nThe post Trump Admin Says Minnesota Violated Title IX Over Males in Female Sports first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/trump-admin-says-minnesota-violated-title-ix-over-males-in-female-sports/",
    "timestamp": "2025-10-01T13:00:35Z"
  },
  {
    "title": "'Stochastic Terrorism': Farage's Security Cut by UK Gov't Ahead of PM Branding Reform Leader an 'Enemy'",
    "description": "Reform UK says the government slashed the security detail to party leader Nigel Farage just weeks before embarking on targeted incitement.\nThe post ‘Stochastic Terrorism’: Farage’s Security Cut by UK Gov’t Ahead of PM Branding Reform Leader an ‘Enemy’ appeare…",
    "link": "https://www.breitbart.com/europe/2025/10/01/stochastic-terrorism-farages-security-cut-by-uk-govt-ahead-of-pm-branding-reform-leader-an-enemy/",
    "timestamp": "2025-10-01T13:00:29Z"
  },
  {
    "title": "Introducing Collateral Damage",
    "description": "The Intercept is launching a new podcast series reported and hosted by investigative journalist Radley Balko.\nThe post Introducing Collateral Damage  appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/01/collateral-damage-podcast-trailer-radley-balko/",
    "timestamp": "2025-10-01T13:00:00Z"
  },
  {
    "title": "Dem Goldman Hits Panic Button on Bombshell Trump Speech — Setting Up To ‘Cancel’ 2028 Election",
    "description": "Rep. Dan Goldman (D-NY) pushed the panic button after President Donald Trump's speech to military leaders, calling it a prelude to canceling the 2028 election.\nThe post Dem Goldman Hits Panic Button on Bombshell Trump Speech — Setting Up To ‘Cancel’ 2028 Elec…",
    "link": "https://www.mediaite.com/media/podcasts/dem-goldman-hits-panic-button-on-bombshell-trump-speech-setting-up-to-cancel-2028-election/",
    "timestamp": "2025-10-01T12:59:58Z"
  },
  {
    "title": "Jimmy Kimmel and Stephen Colbert Guest on Each Other’s Late-Night Shows",
    "description": "\"I hope they put out the plastic ketchup bottles at the White House tonight,\" Kimmel joked.\nJimmy Kimmel and Stephen Colbert Guest on Each Other’s Late-Night Shows\nScoop Harrison",
    "link": "https://consequence.net/2025/10/kimmel-colbert-joint-interview/",
    "timestamp": "2025-10-01T12:59:06Z"
  },
  {
    "title": "Trump sets 10% tariff on lumber imports, 25% on cabinets and furniture",
    "description": "U.S. President Donald Trump said on Monday he was slapping 10% tariffs on imported timber and lumber and 25% duties on kitchen cabinets, bathroom vanities and upholstered furniture, continuing his tariff assault on global trading partners.\nThe action is the f…",
    "link": "https://biztoc.com/x/c158015c9d7382b7",
    "timestamp": "2025-10-01T12:58:51Z"
  },
  {
    "title": "U.S. Government Shutdown 2025: List of Services & Agencies Closed",
    "description": "The United States government shut down on October 1, 2025. Here's how it affects your daily life.",
    "link": "https://hollywoodlife.com/2025/10/01/us-government-shutdown-2025-services-closed/",
    "timestamp": "2025-10-01T12:58:11Z"
  },
  {
    "title": "Lawfare: A Battle for Two?",
    "description": "Trump faces endless lawsuits, partisan judges, and extremist attacks—so why shouldn’t he use lawfare to make his enemies pay the same price? Kimberley A. Strassel of the Wall Street Journal, and probably many other people, are not pleased that President Trump…",
    "link": "https://freerepublic.com/focus/f-chat/4343661/posts",
    "timestamp": "2025-10-01T12:57:33Z"
  },
  {
    "title": "Trump's pharmaceutical tariff threat loses bite after Pfizer deal reassures drugmakers",
    "description": "Pfizer's deal with Trump was a relief to the pharma industry, signaling that drugmakers could strike similar deals that would make them immune to tariffs.",
    "link": "https://www.cnbc.com/2025/10/01/trump-pharmaceutical-tariffs-pfizer-deal.html",
    "timestamp": "2025-10-01T12:56:49Z"
  },
  {
    "title": "EU leaders discuss 'drone wall' to repel Russia after airspace violations",
    "description": "COPENHAGEN (Reuters) -European Union leaders in Copenhagen discussed a \"drone wall\" to protect the continent from Russian drones, just days after airspace...",
    "link": "https://uk.news.yahoo.com/eu-leaders-discuss-drone-wall-125626857.html",
    "timestamp": "2025-10-01T12:56:26Z"
  },
  {
    "title": "Mike Johnson, Hakeem Jeffries speak on Trump's 'war from within' comments",
    "description": "A day after Trump said the U.S. is fighting a \"war from within,\" Speaker Mike Johnson and House Minority Leader Hakeem Jeffries react to the president's comments.",
    "link": "https://abcnews.go.com/Politics/trumps-comments-sending-troops-american-cities-cherry-picked/story?id=126109613",
    "timestamp": "2025-10-01T12:55:09Z"
  },
  {
    "title": "Gaza flotilla in ‘danger’ and should not go farther, Taoiseach says",
    "description": "Israel needed to make sure no harm came to civilians aboard ships sailing to break Gaza naval blockade, Micheál Martin says",
    "link": "https://www.irishtimes.com/politics/2025/10/01/gaza-flotilla-in-danger-and-should-not-go-farther-taoiseach-says/",
    "timestamp": "2025-10-01T12:53:42Z"
  },
  {
    "title": "Wednesday, October 1, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-october-1-2025/",
    "timestamp": "2025-10-01T12:50:58Z"
  },
  {
    "title": "Qatar PM talks to Al Jazeera about proposal to end Gaza war",
    "description": "Qatar’s Prime Minister Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani told Al Jazeera the Gaza ceasefire plan",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/1/qatar-pm-talks-to-al-jazeera-about-proposal-to-end-gaza-war",
    "timestamp": "2025-10-01T12:50:49Z"
  },
  {
    "title": "GOP falsely claims Democrats want free health care to those without legal status - NewsBreak",
    "description": "GOP falsely claims Democrats want free health care to those without legal status - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4265965679269-gop-falsely-claims-democrats-want-free-health-care-to-those-without-legal-status?s=a7&amp;share_destination_id=NzI1ODg2OTUtMTc1OTMyMjg2OTc1MA%3D%3D&amp;pd=04uZdPbD&amp;hl=en_US&amp;send_time=1759322869&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-01T12:49:26Z"
  },
  {
    "title": "OpenAI's new video generation tool Sora 2 is here, but don't worry, Sam Altman says it will avoid the 'degenerate case of AI video generation that ends up with us all being sucked into an RL-optimized slop feed'",
    "description": "I do not need another social app, much less one that revolves around AI-generated video.",
    "link": "https://www.pcgamer.com/software/ai/openais-new-video-generation-tool-sora-2-is-here-but-dont-worry-sam-altman-says-it-will-avoid-the-degenerate-case-of-ai-video-generation-that-ends-up-with-us-all-being-sucked-into-an-rl-optimized-slop-feed/",
    "timestamp": "2025-10-01T12:47:42Z"
  },
  {
    "title": "OpenAI announces partnerships with South Korean chip giants over Stargate project",
    "description": "OpenAI and South Korean tech giants Samsung and SK have announced partnerships to support Stargate, a $500 billion AI infrastructure project",
    "link": "https://abcnews.go.com/Technology/wireStory/openai-announces-partnerships-south-korean-chip-giants-stargate-126111708",
    "timestamp": "2025-10-01T12:46:27Z"
  },
  {
    "title": "Wednesday: Hili dialogue",
    "description": "Welcome to a truncated version of today’s Hili.  I got back from Cambridge last night and it will take me a few days to get back in harness (yes, I’m like a horse running a grinding mill, walking endlessly in a circle). It’s a Hump Day (“Ĝiba tago” in Esperan…",
    "link": "https://whyevolutionistrue.com/2025/10/01/wednesday-hili-dialogue-550/",
    "timestamp": "2025-10-01T12:45:49Z"
  },
  {
    "title": "Conventional anti-corruption tools often fail to address root causes – but loss of US leadership could still spell trouble for efforts abroad",
    "description": "Fighting corruption is more than punishing ‘bad apples.’ But international policies against it often fail to address root causes.",
    "link": "https://theconversation.com/conventional-anti-corruption-tools-often-fail-to-address-root-causes-but-loss-of-us-leadership-could-still-spell-trouble-for-efforts-abroad-263894",
    "timestamp": "2025-10-01T12:44:07Z"
  },
  {
    "title": "Walmart sets timeline for removing synthetic dyes, other additives from food brands",
    "description": "Walmart says it plans to remove synthetic dyes and 30 other food additives from its store brands sold in the United States by January 2027",
    "link": "https://abcnews.go.com/US/wireStory/walmart-sets-timeline-removing-synthetic-dyes-additives-food-126112080",
    "timestamp": "2025-10-01T12:43:30Z"
  },
  {
    "title": "'What on earth is wrong?' Analyst claims 'confused' military now asks if Trump is 'sane'",
    "description": "President Donald Trump addressed hundreds of senior U.S. military officials Tuesday in Virginia, speaking for more than an hour — though some critics are sounding the alarm on what appeared to be a “quieter and more confused” delivery “than usual.”“The presid…",
    "link": "https://www.rawstory.com/trump-2674143170/",
    "timestamp": "2025-10-01T12:41:32Z"
  },
  {
    "title": "Trump Administration Yanks BLS Pick E.J. Antoni’s Nomination After KFile Exposé",
    "description": "The White House withdrew President Donald Trump’s pick to lead the Bureau of Labor Statistics Tuesday.\nThe post Trump Administration Yanks BLS Pick E.J. Antoni’s Nomination After KFile Exposé first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-administration-yanks-bls-pick-e-j-antonis-nomination-after-kfile-expose/",
    "timestamp": "2025-10-01T12:41:12Z"
  },
  {
    "title": "Hamas’s Worst Option, Except for All the Others",
    "description": "The latest U.S.-Israeli peace proposal crosses several red lines for the Palestinian group. Here’s why it might sign on anyway.",
    "link": "https://www.theatlantic.com/international/archive/2025/10/hamas-israel-trump-peace-plan/684422/",
    "timestamp": "2025-10-01T12:39:19Z"
  },
  {
    "title": "Trump to be hit by 'largest peaceful protest in modern American history': organizers",
    "description": "As President Donald Trump\r\n and his allies continue to target immigrants, journalists, and anyone else critical of the increasingly authoritarian administration, organizers are gearing up\r\n for another round of “No Kings” rallies across the United States — wh…",
    "link": "https://www.rawstory.com/trump-about-to-be-hit-by-largest-peaceful-protest-in-modern-american-history/",
    "timestamp": "2025-10-01T12:34:55Z"
  },
  {
    "title": "SSI Payment Calendar Shock: October And December Bring Double Cheques – But January 2026 Brings Nothing",
    "description": "The Social Security Administration sends out SSI payments early if the scheduled date falls on a weekend or a federal holiday.",
    "link": "https://www.ibtimes.com/ssi-payment-calendar-shock-october-december-bring-double-cheques-january-2026-brings-nothing-3785021",
    "timestamp": "2025-10-01T12:34:55Z"
  },
  {
    "title": "Can Trump save Argentina’s crisis-stricken economy as he hopes?",
    "description": "The US is planning to extend a $20 billion loan to Argentina in support to President Javier Milei.",
    "link": "https://www.aljazeera.com/news/2025/10/1/can-trump-save-argentinas-crisis-stricken-economy-as-he-hopes",
    "timestamp": "2025-10-01T12:34:38Z"
  },
  {
    "title": "'TrumpRx': President Unveils New Drug Price-Cutting Website As Pfizer Agrees To Slash Costs By 50%",
    "description": "Trump announced a website for consumers to buy medicines at heavily discounted prices. He also forged a deal with Pfizer, where the drugmaker will  slash prices for several of its products.",
    "link": "https://www.ibtimes.com/trumprx-president-unveils-new-drug-price-cutting-website-pfizer-agrees-slash-costs-50-3785019",
    "timestamp": "2025-10-01T12:33:22Z"
  }
]