[
  {
    "title": "Clashes between government troops and Tigrayan forces erupt in Ethiopia",
    "description": "'Deteriorating' situation causes suspension of flights, security and diplomatic sources say.",
    "link": "https://www.aljazeera.com/news/2026/1/29/clashes-between-government-troops-and-tigrayan-forces-erupt-in-ethiopia",
    "timestamp": "2026-01-29T09:59:11Z"
  },
  {
    "title": "America’s Year of Self-Destruction",
    "description": "The United States owes its superpower status not to pure might, but to the unique combination of material advantages and Enlightenment values. With his reliance on naked power and rejection of all constraints on his authority, Donald Trump represents the oppo…",
    "link": "https://www.project-syndicate.org/commentary/trump-american-self-destruction-by-joschka-fischer-2026-01",
    "timestamp": "2026-01-29T09:58:02Z"
  },
  {
    "title": "Russia urges US-Iran talks, warns against use of force",
    "description": "MOSCOW, Jan 29 (Reuters) - Russia said on Thursday that there was still room for negotiation between Iran and the United States and warned that any use of force against T… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/russia-urges-us-iran-talks-warns-against-use-of-force",
    "timestamp": "2026-01-29T09:54:39Z"
  },
  {
    "title": "Brent oil price tops $70 on Trump's Iran threats",
    "description": "Brent crude oil topped $70 per barrel Thursday for the first time since September as US President Donald Trump ramped up geopolitical tensions by threatening military strikes on Iran.  In London morning deals, international benchmark oil contract Brent North …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/brent-oil-price-tops-70-on-trumps-iran-threats/articleshow/127770060.cms",
    "timestamp": "2026-01-29T09:49:56Z"
  },
  {
    "title": "Turkey to offer mediation on US-Iran tensions, weighs border measures",
    "description": "Turkey will offer to mediate between Washington and Tehran. Iran's foreign minister visits Ankara on Friday. Turkey considers reinforcing its border security. This comes as US President Donald Trump threatened military action against Iran. Turkey opposes mili…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/turkey-to-offer-mediation-on-us-iran-tensions-weighs-border-measures/articleshow/127770048.cms",
    "timestamp": "2026-01-29T09:49:48Z"
  },
  {
    "title": "Merz Challenges Trump Over Tariff Threat and Afghanistan Comments",
    "description": "German Chancellor Friedrich Merz pushed back against Donald Trump on multiple fronts, signaling that Europe won’t bow to the US president’s intimidation while reiterating a commitment to preserving the transatlantic alliance.",
    "link": "https://financialpost.com/pmn/business-pmn/merz-challenges-trump-over-tariff-threat-and-afghanistan-comments",
    "timestamp": "2026-01-29T09:48:38Z"
  },
  {
    "title": "EU's Kallas Says 'Very Hard' Territorial Concessions by Ukraine Possible",
    "description": "MOSCOW (Sputnik) - EU foreign policy chief Kaja Kallas said on Thursday that \"very hard\" territorial concessions to Kiev at the peace talks in return for \"security guarantees\" are possible.",
    "link": "https://sputnikglobe.com/20260129/eus-kallas-says-very-hard-territorial-concessions-by-ukraine-possible-1123545257.html",
    "timestamp": "2026-01-29T09:42:55Z"
  },
  {
    "title": "Iran’s army receives batch of 1,000 drones, Tasnim reports",
    "description": "Jan 29 (Reuters) - A batch of 1,000 drones was received by the various branches of the Iranian army, semi-official Tasnim news agency reported on Thursday, amid growing t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/iran-s-army-receives-batch-of-1-000-drones-tasnim-reports",
    "timestamp": "2026-01-29T09:41:05Z"
  },
  {
    "title": "Stephen Colbert Spots The Ultimate Trump Snub In A Most Unexpected Place",
    "description": "The \"Late Show\" host also offered up a new anti-Trump fight song.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-cat-butts_n_697b170fe4b00b1deb8f6680",
    "timestamp": "2026-01-29T09:40:28Z"
  },
  {
    "title": "Starmer and Xi call for deeper UK-China ties as Trump shakes up global relations",
    "description": "British Prime Minister Keir Starmer and Chinese leader Xi Jinping in Beijing called for a \"comprehensive strategic partnership\" to deepen ties amid global uncertainty.",
    "link": "https://www.npr.org/2026/01/29/g-s1-107743/starmer-and-xi-call-for-deeper-uk-china-ties",
    "timestamp": "2026-01-29T09:38:31Z"
  },
  {
    "title": "California sees truck shortage as non-domiciled crackdown, ICE raids take hold",
    "description": "California saw a pronounced, unusual shortage of trucks in its produce-growing areas. \"Rates are always low this time of year, but the big difference this year is enforcement by ICE.\"",
    "link": "https://www.overdriveonline.com/business/article/15815938/california-sees-truck-shortage-as-nondomiciled-crackdown-ice-raids-take-hold",
    "timestamp": "2026-01-29T09:35:39Z"
  },
  {
    "title": "Denmark lauds constructive talks with U.S. over Greenland: ‘Now we are back on track’",
    "description": "Danish Foreign Minister Lars Lokke Rasmussen on Thursday welcomed constructive high-level talks over Greenland's future.",
    "link": "https://www.cnbc.com/2026/01/29/greenland-denmark-us-trump-talks-arctic-security-nato.html",
    "timestamp": "2026-01-29T09:34:47Z"
  },
  {
    "title": "Gavin Newsom's Press Office rips into Trump's late night Truth Social tirade",
    "description": "Gavin Newsom's Press Office has ripped into Donald Trump's Truth Social activity after a late night posting spree.A viral post to the Press Office press account called on people to stand firm over the next three years as Trump's rhetoric worsens. The Press Of…",
    "link": "https://www.rawstory.com/gavin-newsom-trump-2675057443/",
    "timestamp": "2026-01-29T09:28:28Z"
  },
  {
    "title": "Greenland blues to Delhi red carpet: EU finds solace in India",
    "description": "New Delhi (AFP) Jan 28, 2026\n\n\n Presiding over the signing of a major trade deal alongside Indian Prime Minister Narendra Modi on Tuesday, EU chief Ursula von der Leyen broke into a large smile. \n\nA diplomatic and economic coup, the EU-India pact comes as a w…",
    "link": "https://www.spacewar.com/reports/Greenland_blues_to_Delhi_red_carpet_EU_finds_solace_in_India_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "French aircraft carrier heads to North Atlantic amid Greenland tensions",
    "description": "Paris, France (AFP) Jan 27, 2026\n\n\n The flagship of the French Navy, the Charles de Gaulle aircraft carrier, on Tuesday set course for the Atlantic, the defence ministry said, after the United States and Europe butted heads over Greenland. \n\nOn Wednesday, Fre…",
    "link": "https://www.spacewar.com/reports/French_aircraft_carrier_heads_to_North_Atlantic_amid_Greenland_tensions_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "China defence minister vows greater 'strategic coordination' with Russia",
    "description": "Beijing (AFP) Jan 27, 2026\n\n\n China's Defence Minister Dong Jun told his Russian counterpart that the two countries should \"strengthen strategic coordination\" during a video call on Tuesday, according to state broadcaster CCTV. \n\nThe call came days after nego…",
    "link": "https://www.spacewar.com/reports/China_defence_minister_vows_greater_strategic_coordination_with_Russia_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "Trump warns US to end support for Iraq if Maliki returns",
    "description": "Washington, United States (AFP) Jan 27, 2026\n\n\n President Donald Trump on Tuesday threatened to end all US support for Iraq if Nouri al-Maliki, a former prime minister with ties to Iran, returns to the post. \n\nTrump, in his latest blatant intervention in anot…",
    "link": "https://www.spacewar.com/reports/Trump_warns_US_to_end_support_for_Iraq_if_Maliki_returns_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "'Doomsday Clock' moves closer to midnight, a year into Trump term",
    "description": "Washington, United States (AFP) Jan 27, 2026\n\n\n The \"Doomsday Clock\" representing how near humanity is to catastrophe on Tuesday moved closer than ever to midnight as concerns mount on nuclear weapons, climate change and disinformation. \n\nThe Bulletin of the …",
    "link": "https://www.spacewar.com/reports/Doomsday_Clock_moves_closer_to_midnight_a_year_into_Trump_term_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "Greenland dispute is 'wake-up call' for Europe: Macron",
    "description": "Paris, France (AFP) Jan 28, 2026\n\n French President Emmanuel Macron said on Wednesday a standoff with the United States over Greenland was \"a strategic wake-up call for all of Europe\" as he hosted the leaders of Denmark and the Danish autonomous territory for…",
    "link": "https://www.spacedaily.com/reports/Greenland_dispute_is_wake-up_call_for_Europe_Macron_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "Trump-era trade stress leads Western powers to China",
    "description": "Tokyo (AFP) Jan 29, 2026\n\n Britain's Keir Starmer is the latest Western leader to thaw trade ties with China in a shift analysts say is driven by US tariff pressure and unease over Donald Trump's volatile policy playbook. \n\nThe prime minister's Beijing visit …",
    "link": "https://www.sinodaily.com/reports/Trump-era_trade_stress_leads_Western_powers_to_China_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "Ten US warships in Mideast as Trump threatens Iran",
    "description": "Washington, United States (AFP) Jan 28, 2026\n\n\n The recent arrival of an aircraft carrier strike group to the Middle East brings the number of US warships in the region to 10, putting significant firepower at President Donald Trump's disposal if he decides to…",
    "link": "https://www.spacewar.com/reports/Ten_US_warships_in_Mideast_as_Trump_threatens_Iran_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "North Korea to soon unveil 'next-stage' nuclear plans, Kim says",
    "description": "Seoul (AFP) Jan 28, 2026\n\n\n North Korean leader Kim Jong Un will unveil plans to bolster his nuclear forces at an upcoming ruling party meeting, state media reported Wednesday, after a missile launch he said would bring \"excruciating mental agony\" to his enem…",
    "link": "https://www.spacewar.com/reports/North_Korea_to_soon_unveil_next-stage_nuclear_plans_Kim_says_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "Iran vows to resist any US attack, insists ready for nuclear deal",
    "description": "Paris, France (AFP) Jan 28, 2026\n\n Iran's foreign minister warned Wednesday its forces would respond immediately and forcefully to any US military operation after President Donald Trump declared time was running out to avoid one, but did not rule out a new de…",
    "link": "https://www.spacewar.com/reports/Iran_vows_to_resist_any_US_attack_insists_ready_for_nuclear_deal_999.html",
    "timestamp": "2026-01-29T09:23:34Z"
  },
  {
    "title": "EU to list Iran’s Revolutionary Guard as terrorist group, says top diplomat",
    "description": "The expected move comes after France and Italy changed their stance on the terror designation.",
    "link": "https://www.politico.eu/article/eu-kaja-kallas-list-iran-revolutionary-guard-terrorist-group-top-diplomat/",
    "timestamp": "2026-01-29T09:22:07Z"
  },
  {
    "title": "No one owns our Arctic land, we share it, say Greenland's Inuit",
    "description": "KAPISILLIT, Greenland, Jan 29 (Reuters) - U.S. President Donald Trump talks about Greenland as ‌a strategic asset that could be bought by Washington, while Denmark asserts its legal sovereignty over the island. For the Inuit people, who have lived here for ce…",
    "link": "https://www.thestar.com.my/news/world/2026/01/29/no-one-owns-our-arctic-land-we-share-it-say-greenland039s-inuit",
    "timestamp": "2026-01-29T09:21:00Z"
  },
  {
    "title": "ASEAN does not recognize military-ruled Myanmar's elections, top Philippine diplomat says",
    "description": "The Philippine foreign secretary says the Association of Southeast Asian Nations does not recognize the recently held elections in Myanmar, the first since the army seized power in 2021",
    "link": "https://abcnews.go.com/International/wireStory/asean-recognize-military-ruled-myanmars-elections-top-philippine-129659718",
    "timestamp": "2026-01-29T09:17:30Z"
  },
  {
    "title": "Indonesia–US tariff deal hinges on Prabowo–Trump meeting",
    "description": "Indonesia&rsquo;s Coordinating Minister for Economic Affairs Airlangga Hartarto said the final outcome of tariff negotiations between Indonesia and the United ...",
    "link": "https://en.antaranews.com/news/402110/indonesia-us-tariff-deal-hinges-on-prabowo-trump-meeting",
    "timestamp": "2026-01-29T09:16:49Z"
  },
  {
    "title": "Trump Considering New Strike on Iran After Failure of Talks - Reports",
    "description": "MOSCOW (Sputnik) - US President Donald Trump is considering launching powerful strikes against Iran after talks on Tehran's nuclear program failed, CNN reported, citing sources.",
    "link": "https://sputnikglobe.com/20260129/trump-considering-new-strike-on-iran-after-failure-of-talks---reports-1123544652.html",
    "timestamp": "2026-01-29T09:16:36Z"
  },
  {
    "title": "Defeat of the West – Michael Hudson and Lena Petrova on Davos Panic, Destruction of the EU & Economic Collapse",
    "description": "Michael Hudson and Lena Petrova discuss the breakdown of the US-led order, Trump's misguided efforts to maintain primacy, and what comes next",
    "link": "https://www.nakedcapitalism.com/?p=304701",
    "timestamp": "2026-01-29T09:12:07Z"
  },
  {
    "title": "FEMA could still support winter storm response in a shutdown, despite administration warnings",
    "description": "The Federal Emergency Management Agency would have enough money to respond to the massive winter storm still impacting large swaths of the U.S. even if a partial government shutdown begins at midnight Friday",
    "link": "https://abcnews.go.com/Politics/wireStory/fema-support-winter-storm-response-shutdown-despite-administration-129660810",
    "timestamp": "2026-01-29T09:09:55Z"
  },
  {
    "title": "Gold hits fresh highs as markets weigh Trump’s Iran ultimatum",
    "description": "Gold prices soar to record highs near $5,600 as geopolitical tensions escalate over Trump’s Iran ultimatum. See how oil prices and the dollar are reacting.\n\nRead More: https://punchng.com/gold-hits-fresh-highs-as-markets-weigh-trumps-iran-ultimatum/",
    "link": "https://punchng.com/gold-hits-fresh-highs-as-markets-weigh-trumps-iran-ultimatum/",
    "timestamp": "2026-01-29T09:08:36Z"
  },
  {
    "title": "What tariffs? Toyota hits record sales in 2025, despite Trump’s auto levies",
    "description": "Toyota Motor retained its position as the world's top-selling automaker with record sales of 10.5 million in 2025, the Japanese auto giant reported on Thursday.",
    "link": "https://www.cnbc.com/2026/01/29/toyota-hits-record-hybrids-sales-in-2025-as-the-auto-giant-adjusted-to-trumps-tariffs.html",
    "timestamp": "2026-01-29T09:07:30Z"
  },
  {
    "title": "South Korea's industry minister heads to Washington after tariff rollback warning",
    "description": "US President Donald Trump has threatened to restore 25% tariffs on South Korean goods, escalating trade tensions by citing delays in Seoul's passage of legislation linked to a bilateral trade agreement reached last year.",
    "link": "https://www.digitimes.com/news/a20260129VL217/south-korea-usa-tariffs-policy-donald-trump.html",
    "timestamp": "2026-01-29T09:07:13Z"
  },
  {
    "title": "Trump’s dollar dilemma: Is a strong greenback a destabilizing force?",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631697-trump-dollar-rate-dilemma/",
    "timestamp": "2026-01-29T09:05:31Z"
  },
  {
    "title": "Germany updates: 'We are not subordinates' – Merz",
    "description": "In a foreign policy address, German Chancellor Friedrich Merz has called on Europe to stand up in the face of US belligerence and slammed US Donald Trump's criticism of NATO troops in Afghanistan. DW has more. Chancellor Merz has called for a more self-confid…",
    "link": "https://www.dw.com/en/germany-news-merz-says-europeans-not-subordinates-to-us/live-75706500",
    "timestamp": "2026-01-29T09:04:00Z"
  },
  {
    "title": "Trump pushes for legislative ‘compromise’ on crypto bill: Here’s how",
    "description": "Crypto industry isn't taking any chances ahead of U.S midterms in November",
    "link": "https://ambcrypto.com/trump-pushes-for-legislative-compromise-on-crypto-bill-heres-how/",
    "timestamp": "2026-01-29T09:00:34Z"
  },
  {
    "title": "Harry Enten Says 1 Key Group Has Sharply Flipped On Trump",
    "description": "The major voting bloc is saying \"no, no, no,\" to the president, noted CNN's chief data analyst.",
    "link": "https://www.huffpost.com/entry/harry-enten-donald-trump-group-backlash_n_697b1ab0e4b0a7a321380577",
    "timestamp": "2026-01-29T09:00:05Z"
  },
  {
    "title": "Poilievre courts delegates as he faces a must-win leadership review vote",
    "description": "Conservative Leader Pierre Poilievre's fate will be put to delegates at the party's convention in Calgary on Friday. While those around him are confident he can avoid being turfed, the leader's loyalists are doing all they can to ensure he easily clears this …",
    "link": "https://www.cbc.ca/news/politics/poilievre-leadership-review-vote-9.7065628",
    "timestamp": "2026-01-29T09:00:00Z"
  },
  {
    "title": "Why the government is trying to make coal cute",
    "description": "Trump said that coal needed better public relations. Then Coalie, the mascot of an obscure federal office, showed up.",
    "link": "https://grist.org/culture/trump-coal-mascot-coalie-cute-burgum/",
    "timestamp": "2026-01-29T09:00:00Z"
  },
  {
    "title": "‘We did everything we could’: GM Oshawa to lay off up to 1,200 workers on Friday",
    "description": "The day Oshawa, Ont., autoworkers have dreaded for months has arrived, as GM Canada is poised to cut a shift at the city’s plant, costing over a thousand workers their jobs.",
    "link": "https://www.cbc.ca/news/canada/toronto/gm-oshawa-to-lay-off-1-200-workers-friday-9.7065457",
    "timestamp": "2026-01-29T09:00:00Z"
  },
  {
    "title": "India-EU FTA strategic signal to US, but gains hinge on efficiency: Nobel laureate Abhijit Banerjee",
    "description": "Nobel laureate Abhijit Banerjee calls the India-EU free trade pact a strategic alignment. He believes it signals to the US that India and Europe do not need America as much as it thinks. However, Banerjee cautions that the deal will only bring benefits if Ind…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-eu-fta-strategic-signal-to-us-but-gains-hinge-on-efficiency-nobel-laureate-abhijit-banerjee/articleshow/127767470.cms",
    "timestamp": "2026-01-29T08:58:49Z"
  },
  {
    "title": "Kerala FM K N Balagopal calls for unity among communities, refers to US tariffs in Budget speech",
    "description": "During the presentation of the 2026-27 budget, Kerala's Finance Minister K N Balagopal emphasized the vital role of unity among Keralites for the state's advancement. As part of his vision, he launched a significant project focusing on documenting the state's…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/kerala-fm-k-n-balagopal-calls-for-unity-among-communities-refers-to-us-tariffs-in-budget-speech/articleshow/127767496.cms",
    "timestamp": "2026-01-29T08:57:52Z"
  },
  {
    "title": "Denmark hails 'very constructive' meeting with US over Greenland",
    "description": "\"It went well in a very constructive atmosphere and tone, and new meetings are planned. It's not that things are solved, but it's good,\" said Denmark's foreign minister.",
    "link": "https://www.channelnewsasia.com/world/denmark-hails-very-constructive-meeting-us-greenland-5893476",
    "timestamp": "2026-01-29T08:50:15Z"
  },
  {
    "title": "Dollar close to multi-year lows as investors see mounting risks",
    "description": "Jan 29 : The dollar remained on shaky ground on Thursday, as uncertainty over U.S. economic policies and geopolitical moves was only partially offset by supportive comments from the White House and European officials following a rout in the currency.On the mo…",
    "link": "https://www.channelnewsasia.com/business/dollar-close-multi-year-lows-investors-see-mounting-risks-5892656",
    "timestamp": "2026-01-29T08:50:12Z"
  },
  {
    "title": "What does the US want from Iran?",
    "description": "Latest Trump statement marks a shift in rationale for sending the armada to the region",
    "link": "https://www.irishtimes.com/world/us/2026/01/29/what-does-the-us-want-from-iran/",
    "timestamp": "2026-01-29T08:47:47Z"
  },
  {
    "title": "ICE Reportedly Told To Not Engage With ‘Agitators’—New Clips Show Alex Pretti’s Earlier Clash With Agents",
    "description": "The purported internal memo suggests ICE will be altering its tactics and focusing on migrants with criminal records.",
    "link": "https://www.forbes.com/sites/siladityaray/2026/01/29/ice-reportedly-told-to-not-engage-with-agitators-new-clips-show-alex-prettis-earlier-clash-with-agents/",
    "timestamp": "2026-01-29T08:46:16Z"
  },
  {
    "title": "Lindsey Graham and the business of war",
    "description": "The senator from South Carolina has spent three decades advocating aggressive intervention as the solution to international problems. No wonder Trump's rhetoric is music to his ears.\n\n-\n2026/02\n\n/ \narticle",
    "link": "https://mondediplo.com/2026/02/13lindsey-graham",
    "timestamp": "2026-01-29T08:42:49Z"
  },
  {
    "title": "Japan's dangerous game with China",
    "description": "Japan's postwar constitution renounces war ‘forever'. But with fears that US actions in Venezuela could embolden China to seize Taiwan, Sanae Takaichi could be tempted into a risky game.\n\n-\n2026/02\n\n/ \narticle, \n2026/02 Japan",
    "link": "https://mondediplo.com/2026/02/07",
    "timestamp": "2026-01-29T08:42:40Z"
  },
  {
    "title": "Europe's strategic bind over Ukraine",
    "description": "By prolonging a war that cannot be fought without the US, Europe has placed itself squarely in Washington's hands. At what price?\n\n-\n2026/02\n\n/ \narticle",
    "link": "https://mondediplo.com/2026/02/06ukraine",
    "timestamp": "2026-01-29T08:42:38Z"
  },
  {
    "title": "US: an old-new imperial doctrine",
    "description": "The United States has grown wary of longterm occupations. Abandoning the pretence of exporting democracy, the Trump administration has chosen to force existing powers to comply with its rule.\n\n-\n2026/02\n\n/ \narticle",
    "link": "https://mondediplo.com/2026/02/05us",
    "timestamp": "2026-01-29T08:42:37Z"
  },
  {
    "title": "Why Trump's Greenland fixation?",
    "description": "Donald Trump has staked his capricious claim to Greenland on the grounds of national security, access to minerals – and ‘psychological need'. But behind his fixation lies a neo-imperial mindset.\n\n-\n2026/02\n\n/ \narticle, \n2026/02 war",
    "link": "https://mondediplo.com/2026/02/03greenland",
    "timestamp": "2026-01-29T08:42:32Z"
  },
  {
    "title": "America unbound, Europe sidelined",
    "description": "Donald Trump's recent actions have laid bare the EU's weakness. Its leaders' knee-jerk calls for ‘more Europe' will only strengthen Washington's hand.\n\n-\n2026/02\n\n/ \narticle, \n2026/02 war, \n2026/02 war weapons",
    "link": "https://mondediplo.com/2026/02/02us-europe",
    "timestamp": "2026-01-29T08:42:30Z"
  },
  {
    "title": "Denmark hails constructive US meeting over Greenland",
    "description": "Denmark's foreign minister has said he was \"more optimistic\" after technical talks kicked off with the United States over Greenland.",
    "link": "https://www.rte.ie/news/world/2026/0129/1555709-greenland-us/",
    "timestamp": "2026-01-29T08:42:09Z"
  },
  {
    "title": "China warns against US ‘military adventurism’ as Iran tensions escalate",
    "description": "China warns against US ‘military adventurism’ as Iran tensions escalate",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/29/china-warns-against-us-military-adventurism-as-iran-tensions-escalate",
    "timestamp": "2026-01-29T08:39:47Z"
  },
  {
    "title": "Late Night Monsters Open Thread: Right-Wing Influencers in Minneapolis",
    "description": "In Minneapolis, far-right influencers posing as journalists are casting themselves as victims and labeling ICE-watch groups “terrorists.” Their big new evidence—“infiltrated” Signal chats—isn’t a secret, had no calls for violence and urged people to witness, …",
    "link": "https://balloon-juice.com/2026/01/29/late-night-monsters-open-thread-right-wing-influencers-in-minneapolis/",
    "timestamp": "2026-01-29T08:38:25Z"
  },
  {
    "title": "Laura Ingraham Gets A Very Awkward Earpiece Correction After Nicki Minaj Blunder",
    "description": "The Fox News moment went viral on social media for the wrong reason.",
    "link": "https://www.huffpost.com/entry/laura-ingraham-minaj-fox-news_n_697b06eee4b0a7a32137fd46",
    "timestamp": "2026-01-29T08:27:58Z"
  },
  {
    "title": "McEntee ‘doesn’t see’ Ireland joining Donald Trump’s Board of Peace",
    "description": "Micheál Martin did not rule out possibility of Ireland’s involvement in the body last week",
    "link": "https://www.irishtimes.com/politics/2026/01/29/mcentee-doesnt-see-ireland-joining-donald-trumps-board-of-peace/",
    "timestamp": "2026-01-29T08:24:48Z"
  },
  {
    "title": "Is the global economic order unravelling?",
    "description": "As the US pushes its 'America First' agenda, its partners are edging towards China and new alliances are being formed.",
    "link": "https://www.aljazeera.com/video/counting-the-cost/2026/1/29/is-the-global-economic-order-unravelling",
    "timestamp": "2026-01-29T08:21:18Z"
  },
  {
    "title": "Syria grants immediate citizenship to Kurds in wake of gains against SDF",
    "description": "Interior Minister Anas Khattab's order includes all listed as stateless and sets February 5 as deadline for its rollout.",
    "link": "https://www.aljazeera.com/news/2026/1/29/syria-grants-immediate-citizenship-to-kurds-in-wake-of-gains-against-sdf",
    "timestamp": "2026-01-29T08:15:35Z"
  },
  {
    "title": "Why is Germany sitting on $599 billion of gold?",
    "description": "Germany holds a vast gold reserve in a New York vault. With gold prices at record highs, selling a portion could generate big money. This move could help reduce national debt and fund crucial infrastructure and rearmament projects. While politically sensitive…",
    "link": "https://economictimes.indiatimes.com/news/international/business/why-is-germany-sitting-on-599-billion-of-gold/articleshow/127763450.cms",
    "timestamp": "2026-01-29T08:12:49Z"
  },
  {
    "title": "CNBC's Inside India newsletter: EU edges out U.S. in getting India to slash auto tariffs, but can European carmakers win big?",
    "description": "India has shed import duties on European cars, opening its long-protected auto industry from global competition.",
    "link": "https://www.cnbc.com/2026/01/29/cnbcs-inside-india-newsletter-eu-edges-out-us-as-new-delhi-readies-to-slash-duties-on-imported-cars.html",
    "timestamp": "2026-01-29T08:07:23Z"
  },
  {
    "title": "Jimmy Kimmel Throws Trump’s Own Insult Back At Him With ‘Easiest Joke Of All Time’",
    "description": "The late night host hit back after the president insulted Rep. Ilhan Omar.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-ilhan-omar_n_697af5c1e4b048cde872b1ee",
    "timestamp": "2026-01-29T08:05:28Z"
  },
  {
    "title": "Iran’s foreign minister to visit Turkey for talks on tensions with US",
    "description": "ANKARA, Jan 29 (Reuters) - Iranian Foreign Minister Abbas Araqchi will visit Turkey on Friday for talks with his counterpart Hakan Fidan on the recent developments in Ira… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/iran-s-foreign-minister-to-visit-turkey-for-talks-on-tensions-with-us",
    "timestamp": "2026-01-29T08:03:33Z"
  },
  {
    "title": "No one owns our Arctic land, we share it, say Greenland’s Inuit",
    "description": "KAPISILLIT, Greenland, Jan 29 (Reuters) - U.S. President Donald Trump talks about Greenland as a strategic asset that could be bought by Washington, while Denmark asserts… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/no-one-owns-our-arctic-land-we-share-it-say-greenland-s-inuit",
    "timestamp": "2026-01-29T08:01:59Z"
  },
  {
    "title": "Crossing the Line: It Really Is Safer in the Front : Surrounding the Portland ICE Facility",
    "description": "A participant in a demonstration in Portland describes the experience of collectively crossing the line into revolt.",
    "link": "https://crimethinc.com/2026/01/29/crossing-the-line-it-really-is-safer-in-the-front-surrounding-the-portland-ice-facility",
    "timestamp": "2026-01-29T08:01:11Z"
  },
  {
    "title": "Western leaders seek closer China ties over US tariff uncertainty",
    "description": "Amid US tariff uncertainty and potential Trump policies, Western leaders from the UK, Canada, and the EU are strengthening trade ties with China to secure\n\nRead More: https://punchng.com/western-leaders-seek-closer-china-ties-over-us-tariff-uncertainty/",
    "link": "https://punchng.com/western-leaders-seek-closer-china-ties-over-us-tariff-uncertainty/",
    "timestamp": "2026-01-29T07:52:56Z"
  },
  {
    "title": "The 8 at 8: Thursday",
    "description": "Transport delays in Dublin, further rain warnings in ‘saturated’ areas and rules on scramblers…",
    "link": "https://www.thejournal.ie/8-at-8-thursday-291-6941360-Jan2026/",
    "timestamp": "2026-01-29T07:49:15Z"
  },
  {
    "title": "\"Are you really committed to this role?\" asks manager: How not working on weekends turn into a workplace loyalty tests",
    "description": "Modern workplaces are quietly teaching employees to feel guilty for resting. From subtle managerial pressure to widespread weekend labour, this story explores how blurred boundaries and emotional manipulation are driving burnout. Backed by global data, it cap…",
    "link": "https://timesofindia.indiatimes.com/education/careers/news/are-you-really-committed-to-this-role-asks-manager-how-not-working-on-weekends-turn-into-a-workplace-loyalty-tests/articleshow/127762659.cms",
    "timestamp": "2026-01-29T07:44:54Z"
  },
  {
    "title": "Delhi working hard to clean Yamuna, ramps up sewage treatment by over 100 MGD: Sirsa",
    "description": "India News: New Delhi, The Delhi government under its intensified drive to clean the Yamuna has ramped up the sewage treatment capacity of STPs by about 100 milli.",
    "link": "https://timesofindia.indiatimes.com/india/delhi-working-hard-to-clean-yamuna-ramps-up-sewage-treatment-by-over-100-mgd-sirsa/articleshow/127763409.cms",
    "timestamp": "2026-01-29T07:44:45Z"
  },
  {
    "title": "Danish IT giant frees its software from Microsoft: “It’s in demand in all sectors”",
    "description": "Danish IT giant Systematic has freed its core software from being dependent on Microsoft. This plan has been in the works for a long time but has been brought forward due to customer requests.",
    "link": "https://ing.dk/artikel/danish-it-giant-frees-its-software-microsoft-its-demand-all-sectors",
    "timestamp": "2026-01-29T07:43:00Z"
  },
  {
    "title": "Brooklyn Beckham rift: Wedding planner surprised by attack on parents",
    "description": "He recalls Brooklyn Beckham as a gentle, involved groom who approved designs.",
    "link": "https://www.nzherald.co.nz/entertainment/brooklyn-beckham-rift-wedding-planner-surprised-by-attack-on-parents/IHJ3OGVVRZDVRJHXNKR7EC3QOA/",
    "timestamp": "2026-01-29T07:41:16Z"
  },
  {
    "title": "Gold surges past $5,500 amid Iran tensions, weakening US dollar",
    "description": "Precious metal hits fresh record as US President Donald Trump renews threats against Iran.",
    "link": "https://www.aljazeera.com/economy/2026/1/29/gold-surges-past-5500-amid-iran-tensions-weakening-us-dollar",
    "timestamp": "2026-01-29T07:40:36Z"
  },
  {
    "title": "'Trump Is One Of The Most Dangerous Men In The World'",
    "description": "'Global politics are in a pretty rough shape and always have been. But the speed and extent with which we receive the insanity surrounding us makes it feel more present and immediate.'",
    "link": "https://www.rediff.com/movies/report/deepa-mehta-donald-trump-is-one-of-the-most-dangerous-men-in-the-world/20260129.htm",
    "timestamp": "2026-01-29T07:37:29Z"
  },
  {
    "title": "UK’s Starmer heads to China to thaw ‘ice age’ amid strained US ties",
    "description": "UK Prime Minister Keir Starmer has met with China’s Xi Jinping to thaw the long-standing “ice age” in relations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631694-starmer-china-visit-thaw/",
    "timestamp": "2026-01-29T07:36:22Z"
  },
  {
    "title": "CNBC Daily Open: Investors expected the Fed to hold rates — it was Powell's comments that drew interest",
    "description": "Powell left some advice to the next Fed chair. \"Don't get pulled into elected politics,\" Powell said. \"Don't do it.\"",
    "link": "https://www.cnbc.com/2026/01/29/cnbc-daily-open-fed-expectedly-held-rates-powells-comments-drew-interest.html",
    "timestamp": "2026-01-29T07:33:56Z"
  },
  {
    "title": "Trump-era trade stress leads Western powers to China",
    "description": "Britain’s Keir Starmer is the latest Western leader to thaw trade ties with China in a shift analysts say is driven by US tariff pressure and unease over Donald Trump’s volatile policy playbook. The prime minister’s Beijing visit this week to promote “pragmat…",
    "link": "https://www.digitaljournal.com/business/trump-era-trade-stress-leads-western-powers-to-china/article",
    "timestamp": "2026-01-29T07:32:34Z"
  },
  {
    "title": "Melania Trump's documentary premieres at the Kennedy Center ahead of global release",
    "description": "Melania Trump is capping her first year after becoming first lady again with the global release of a documentary about the 20 days before she and President Donald Trump returned to the White House",
    "link": "https://abcnews.go.com/Entertainment/wireStory/melania-trumps-documentary-premieres-kennedy-center-ahead-global-129660798",
    "timestamp": "2026-01-29T07:31:28Z"
  },
  {
    "title": "Royal Enfield Bullet 650 vs BSA Goldstar 650: Specs, features & more compared",
    "description": "Royal Enfield has unveiled its new Bullet 650, set to rival the BSA Gold Star 650. The Bullet 650 boasts a 647.95cc parallel-twin engine, while the Gold Star features a 652cc liquid-cooled single-cylinder. Both offer comparable power, but differ in torque del…",
    "link": "https://timesofindia.indiatimes.com/auto/bikes/royal-enfield-bullet-650-vs-bsa-goldstar-650-specs-features-more-compared/articleshow/127762835.cms",
    "timestamp": "2026-01-29T07:30:24Z"
  },
  {
    "title": "Norway’s $2.2 Trillion Fund Returns 15.1% on Tech Investments",
    "description": "Norway’s sovereign wealth fund returned 15.1% last year, largely thanks to gains in technology and financial companies.",
    "link": "https://financialpost.com/pmn/business-pmn/norways-2-2-trillion-fund-returns-15-1-on-tech-investments",
    "timestamp": "2026-01-29T07:30:21Z"
  },
  {
    "title": "Newly obtained footage shows Alex Pretti clashing with ICE Agents weeks before he was killed",
    "description": "Newly released footage shows Alex Pretti, the 37-year-old nurse fatally shot by border patrol agents, clashing with ICE 11 days before he was killed.",
    "link": "https://www.ladbible.com/news/us-news/alex-pretti-shooting-ice-agents-clash-new-footage-435992-20260129",
    "timestamp": "2026-01-29T07:29:46Z"
  },
  {
    "title": "Economic Survey 2026: India’s trade buffers blunt the blow of Trump tariffs",
    "description": "Economic Survey 2026: India's exports show resilience against increasing US tariffs.  Structural reforms and policy measures have boosted growth.  Foreign exchange reserves provide a strong buffer.  Diversified trade agreements with the UK, Oman, New Zealand,…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/economic-survey-2026-union-budget-tariff-shock-indian-economy-trump-effect-buffers-blunt-the-blow/articleshow/127760008.cms",
    "timestamp": "2026-01-29T07:28:37Z"
  },
  {
    "title": "Economic Survey 2026: Rupee punching below its weight. Why does it not 'hurt'?",
    "description": "The Economic Survey 2026 said the rupee underperformed in 2025 and is trading below levels suggested by India’s economic fundamentals. It noted that a weaker rupee does not hurt for now, as it helps soften the impact of higher US tariffs on Indian exports and…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/economic-survey-2026-rupee-punching-below-its-weight-but-why-it-does-not-hurt/articleshow/127762019.cms",
    "timestamp": "2026-01-29T07:24:30Z"
  },
  {
    "title": "Secularism lost a strong voice: Muslim leaders mourn Ajit Pawar's death",
    "description": "MUMBAI: A section of Muslim leaders said secularism lost s strong secular voice in the death of deputy CM Ajit Pawar.Many recalled Pawar's public assu.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/secularism-lost-a-strong-voice-muslim-leaders-mourn-ajit-pawars-death/articleshow/127762881.cms",
    "timestamp": "2026-01-29T07:21:53Z"
  },
  {
    "title": "If US leaves NATO, can Europe protect itself? Here's what an ex-commander says",
    "description": "A former NATO commander considers a world without American leadership in the alliance. Europe's collective defence budget is substantial. European nations possess a strong industrial base and are rapidly advancing in military production. So, Europe won't look…",
    "link": "https://economictimes.indiatimes.com/news/defence/if-us-leaves-nato-can-europe-protect-itself-heres-what-an-ex-commander-says/articleshow/127762451.cms",
    "timestamp": "2026-01-29T07:21:15Z"
  },
  {
    "title": "Volkswagen Tayron R-line unveiled in India: Design, features & specs",
    "description": "The local assembly of the Tayron R-line is underway at the company’s Chhatrapati Sambhajinagar plant. Once introduced, it will take on rivals such as the Toyota Fortuner, MG Gloster, the upcoming MG Majestor, Jeep Meridian and the Skoda Kodiaq in the Indian m…",
    "link": "https://timesofindia.indiatimes.com/auto/cars/volkswagen-tayron-r-line-unveiled-in-india-design-features-specs/articleshow/127760536.cms",
    "timestamp": "2026-01-29T07:18:39Z"
  },
  {
    "title": "Keeping these 4 things in the bedroom can lead to relationship conflicts",
    "description": "Vastu Shastra suggests that certain items in your bedroom can disrupt harmonious energy, leading to conflicts. Mirrors facing the bed, electronics, sharp objects, and clutter are identified as major culprits. These objects, linked to planetary influences, can…",
    "link": "https://timesofindia.indiatimes.com/astrology/vastu-feng-shui/keeping-these-4-things-in-the-bedroom-can-lead-to-relationship-conflicts/articleshow/126957344.cms",
    "timestamp": "2026-01-29T07:13:23Z"
  },
  {
    "title": "Trump accuses Minneapolis mayor of 'playing with fire'",
    "description": "The latest social media jab is a backpedal from the US President’s comments on Tuesday that he wanted to “de-escalate a little bit” in Minneapolis.",
    "link": "https://www.thejournal.ie/trump-accuses-minneapolis-mayor-of-playing-with-fire-6941345-Jan2026/",
    "timestamp": "2026-01-29T07:12:21Z"
  },
  {
    "title": "UGC equity rules hit the streets: Student protests across states intensify as Supreme Court steps in",
    "description": "UGC’s newly notified equity regulations have triggered student protests across multiple states, with demonstrations at Delhi University, Patna and several campuses in Uttar Pradesh calling for a rollback of the framework. As opposition sharpens on the streets…",
    "link": "https://timesofindia.indiatimes.com/education/news/ugc-equity-rules-hit-the-streets-student-protests-across-states-intensify-as-supreme-court-steps-in/articleshow/127762247.cms",
    "timestamp": "2026-01-29T07:11:51Z"
  },
  {
    "title": "Trump facing growing cultural revolt against immigration crackdown",
    "description": "President Donald Trump is facing a growing cultural revolt against his immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/trump-facing-growing-cultural-revolt-immigration-crackdown-129657071",
    "timestamp": "2026-01-29T07:11:20Z"
  },
  {
    "title": "New malaria vaccines helped Ghana slash child deaths. Then Trump, others cut aid",
    "description": "LONDON/ACCRA, Jan 29 (Reuters) - New vaccines are helping Ghana approach a long-sought goal of ending child deaths from malaria, demonstrating ‌the potential of the shots to drive back a disease that kills nearly half a million young children every year in Af…",
    "link": "https://www.thestar.com.my/news/world/2026/01/29/new-malaria-vaccines-helped-ghana-slash-child-deaths-then-trump-others-cut-aid",
    "timestamp": "2026-01-29T07:10:00Z"
  },
  {
    "title": "EU appears poised to sanction Iran's Revolutionary Guard over protest crackdown",
    "description": "The European Union appeared poised Thursday to sanction Iran’s paramilitary Revolutionary Guard over Tehran’s deadly crackdown on nationwide protests...",
    "link": "https://www.yahoo.com/news/articles/eu-appears-poised-sanction-irans-070344304.html",
    "timestamp": "2026-01-29T07:03:44Z"
  },
  {
    "title": "Uncle Sam’s view of the Indo-Pacific: Why India must invest heavily in naval power projection",
    "description": "The Quad’s conspicuous absence from America’s National Defense Strategy reflects Washington’s insistence that allies shoulder more of the defence burden. The US may not withdraw from the Indo-Pacific, but for India the signal is clear: boost defence spending …",
    "link": "https://www.livemint.com/opinion/online-views/uncle-sam-america-indo-pacific-why-india-invest-naval-power-projection-11769601472949.html",
    "timestamp": "2026-01-29T07:00:29Z"
  },
  {
    "title": "Man convicted of double murder executed in Texas",
    "description": "A man convicted of killing his ex-girlfriend and her boyfriend was put to death by lethal injection in Texas in the first execution in the United States this year.",
    "link": "https://www.rte.ie/news/us/2026/0129/1555680-texas-execution/",
    "timestamp": "2026-01-29T06:58:27Z"
  },
  {
    "title": "As ringgit strengthens against US dollar, some Malaysian furniture exporters remain unfazed",
    "description": "One exporter said a 19 per cent US tariff has given Malaysian products an edge over Chinese goods, which face duties of at least 25 per cent.",
    "link": "https://www.channelnewsasia.com/asia/ringgit-strengthen-us-dollar-malaysia-furniture-exporters-unfazed-tariffs-5893256",
    "timestamp": "2026-01-29T06:54:21Z"
  }
]