[
  {
    "title": "Huge sign on Tel Aviv beach tells Trump to ‘end BB’s war’",
    "description": "Protesters from an Israeli activist group etched an anti-war message in the sand near a US embassy building in Tel Aviv.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/8/8/huge-sign-on-tel-aviv-beach-tells-trump-to-end-bbs-war",
    "timestamp": "2025-08-08T19:30:17Z"
  },
  {
    "title": "The Trump Code",
    "description": "I saw skepticism about this, because what does Trump care about starving children? He probably doesn't, but he does care about anything that he thinks will make him look bad, and he thinks it will make him look bad.\nPrime Minister Benjamin Netanyahu and US Pr…",
    "link": "https://www.eschatonblog.com/2025/08/the-trump-code.html",
    "timestamp": "2025-08-08T19:30:00Z"
  },
  {
    "title": "JUST IN: Trump Removes IRS Commissioner — The Sixth Person to Lead Key Agency This Year",
    "description": "The head of the IRS is being replaced by President Donald Trump just two months into the job, according to a new report from The New York Times.\nThe post JUST IN: Trump Removes IRS Commissioner — The Sixth Person to Lead Key Agency This Year first appeared on…",
    "link": "https://www.mediaite.com/media/news/just-in-trump-removes-irs-commissioner-the-sixth-person-to-lead-key-agency-this-year/",
    "timestamp": "2025-08-08T19:29:13Z"
  },
  {
    "title": "Trump and Republicans Have Finally Broken the Senate",
    "description": "The erosion of the Senate’s proud traditions has been slow and bipartisan, but Ed Kilgore writes that it took Trump and his toadies like John Thune to wreck the chamber.",
    "link": "http://nymag.com/intelligencer/article/trump-and-republicans-have-finally-broken-the-senate.html",
    "timestamp": "2025-08-08T19:26:13Z"
  },
  {
    "title": "The White House is trying to change the conversation about Trump’s BLS scandal | CNN Business",
    "description": "President Donald Trump claims, without a shred of evidence, that the government’s premiere economic data operation nefariously engineered negative statistics “for political purposes.”",
    "link": "https://www.cnn.com/2025/08/08/business/bls-commissioner-pick",
    "timestamp": "2025-08-08T19:26:06Z"
  },
  {
    "title": "How strong is the Russian economy? Can it compete with Donald Trump's might?",
    "description": "Russia significantly increased state spending after launching its invasion in 2022, engineering an economic boom. That boom is over. The country's economy is expected to grow 1 per cent to 2 per cent this year, down from 4.7 per cent in 2024.",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-strong-is-the-russian-economy-can-it-compete-with-donald-trumps-might/articleshow/123196049.cms",
    "timestamp": "2025-08-08T19:24:58Z"
  },
  {
    "title": "Can Brazil convict Bolsonaro and stand up to Trump?",
    "description": "What would a conviction for former President Jair Bolsonaro mean for Brazil?",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/8/8/aje-onl-bra_bolsonaro_av_v2-080825",
    "timestamp": "2025-08-08T19:22:48Z"
  },
  {
    "title": "US appeals court dismisses contempt finding against Trump admin",
    "description": "A US federal appeals court on Friday dismissed a contempt finding against President Donald Trump's administration over its summary deportation of alleged...",
    "link": "https://www.yahoo.com/news/articles/us-appeals-court-dismisses-contempt-192226445.html",
    "timestamp": "2025-08-08T19:22:26Z"
  },
  {
    "title": "Here's What Happened Today: Friday",
    "description": "Tánaiste to meet with Indian community reps after rise in attacks, Tubridy repays RTÉ €150,000, and Israel approves plan to take over Gaza City",
    "link": "https://www.thejournal.ie/news-fix-august-friday-6786136-Aug2025/",
    "timestamp": "2025-08-08T19:21:22Z"
  },
  {
    "title": "Public Relations Expert Explains Why President Trump Should Let ‘South Park’ Cook for His Own Good",
    "description": "The official White House statement on ‘South Park’ is the perfect example of what not to do while in the show’s crosshairs",
    "link": "https://www.cracked.com/article_47790_public-relations-expert-explains-why-president-trump-should-let-south-park-cook-for-his-own-good.html",
    "timestamp": "2025-08-08T19:20:00Z"
  },
  {
    "title": "Pete Hegseth Promotes His Pastor’s CNN Spot – and His Call for ‘Christian Domination’",
    "description": "Hegseth openly touted his alignment with self-described Christian nationalist Doug Wilson, sharing a new interview that the pastor did with CNN.\nThe post Pete Hegseth Promotes His Pastor’s CNN Spot – and His Call for ‘Christian Domination’ first appeared on M…",
    "link": "https://www.mediaite.com/politics/pete-hegseth-promotes-his-pastors-cnn-spot/",
    "timestamp": "2025-08-08T19:18:54Z"
  },
  {
    "title": "Epstein grand jury files: Justice Department says it wants to release exhibits in addition to transcripts",
    "description": "The Justice Department told two federal judges Friday it wants to release grand jury exhibits in the Jeffrey Epstein and Ghislaine Maxwell cases, in addition to transcripts, with “appropriate redactions of victim-related and other personal identifying informa…",
    "link": "https://www.cnn.com/2025/08/08/politics/epstein-maxwell-grand-jury-evidence",
    "timestamp": "2025-08-08T19:18:35Z"
  },
  {
    "title": "US diplomat says UK would have lost WW2 with Starmer as leader",
    "description": "Mike Huckabee's comments come after the UK prime minister condemned Israel's Gaza City military takeover plan.",
    "link": "https://www.bbc.com/news/articles/c5yp78gd636o",
    "timestamp": "2025-08-08T19:15:08Z"
  },
  {
    "title": "Intel CEO responds to 'misinformation' and Trump threat in letter to employees (Samantha Subin/CNBC)",
    "description": "Samantha Subin / CNBC:\nIntel CEO responds to ‘misinformation’ and Trump threat in letter to employees … Intel CEO Lip-Bu Tan addressed “misinformation” about his previous roles after President Donald Trump called for his resignation and raised ethical concern…",
    "link": "https://www.memeorandum.com/250808/p89",
    "timestamp": "2025-08-08T19:15:00Z"
  },
  {
    "title": "‘Not A Good Sign’: MSNBC Legal Analyst Danny Cevallos Warns ‘Letitia James Should Be Very Concerned’ About DOJ Probe",
    "description": "Danny Cevallos warned that Letitia James should be worried about the Department of Justice's reported investigation into her.",
    "link": "https://dailycaller.com/2025/08/08/not-a-good-sign-msnbc-legal-analyst-danny-cevallos-warns-letitia-james-should-be-very-concerned-about-doj-probe/",
    "timestamp": "2025-08-08T19:14:53Z"
  },
  {
    "title": "MSNBC's Dowd: Trump's Base Will Stay, They Are 'Fact Insensitive'",
    "description": "MSNBC senior political analyst Matthew Dowd said Friday on \"Chris Jansing Reports\" that President Donald Trump's base voters were \"fact insensitive.\"\nThe post MSNBC’s Dowd: Trump’s Base Will Stay, They Are ‘Fact Insensitive’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/08/08/msnbcs-dowd-trumps-base-will-stay-they-are-fact-insensitive/",
    "timestamp": "2025-08-08T19:14:28Z"
  },
  {
    "title": "Diddy's bid to avoid prison: He'll become a domestic abuse counselor",
    "description": "Sean \"Diddy\" Combs' legal team plans to ask a judge that he serve no prison time. The mogul wants to counsel domestic abusers, his lawyer said.",
    "link": "https://www.businessinsider.com/sean-diddy-combs-domestic-violence-advocate-counselor-redemption-plan-2025-8",
    "timestamp": "2025-08-08T19:12:45Z"
  },
  {
    "title": "No Need for Hoarding",
    "description": "Trump’s tariffs will cause problems but not widespread shortages.",
    "link": "http://foreignpolicy.com/2025/08/08/trump-tariffs-shortages-consumers/",
    "timestamp": "2025-08-08T19:12:35Z"
  },
  {
    "title": "Trump approves military action against Latin American cartels classified as terrorist organizations",
    "description": "Trump administration secretly approves military action targeting drug cartels classified as terrorist groups that traffic fentanyl across the US-Mexico border.",
    "link": "https://www.foxnews.com/politics/trump-approves-military-action-latin-american-cartels-classified-terrorist-organizations",
    "timestamp": "2025-08-08T19:11:29Z"
  },
  {
    "title": "Army sergeant shot 5 soldiers before he was tackled and arrested at Fort Stewart, officials say",
    "description": "By Russ Bynum And Mike Catalini A sergeant shot five…\nThe post Army sergeant shot 5 soldiers before he was tackled and arrested at Fort Stewart, officials say appeared first on OHS Canada Magazine.",
    "link": "https://www.ohscanada.com/army-sergeant-shot-5-soldiers-before-he-was-tackled-and-arrested-at-fort-stewart-officials-say/",
    "timestamp": "2025-08-08T19:10:26Z"
  },
  {
    "title": "US appeals court blocks Trump contempt proceedings ordered by Boasberg (Fox News)",
    "description": "Fox News:\nUS appeals court blocks Trump contempt proceedings ordered by Boasberg  —  The 2-1 ruling in President Donald Trump's favor will likely go to the full court for review, or be appealed directly to the Supreme Court  —  The U.S. Court of Appeals for t…",
    "link": "https://www.memeorandum.com/250808/p88",
    "timestamp": "2025-08-08T19:10:01Z"
  },
  {
    "title": "Trump DOJ Slammed for 'Desperate' Attempt at Retribution After Subpoenas for NY AG James",
    "description": "A lawyer representing New York's top law enforcement official, Attorney General Letitia James, said Friday that the news of the Trump administration's investigation into James and her successful legal cases against President Donald Trump amounted to \"the most…",
    "link": "https://www.commondreams.org/news/tish-james-trump",
    "timestamp": "2025-08-08T19:09:37Z"
  },
  {
    "title": "Should President Trump bring back the Presidential Fitness Test?",
    "description": "Reviving the physical test would meet the goals of Donald Trump and Robert F. Kennedy Jr. We asked P.E. teachers if bringing it back in schools would help students.",
    "link": "https://www.chalkbeat.org/2025/08/08/presidential-fitness-test-trump-what-pe-teachers-think/",
    "timestamp": "2025-08-08T19:09:19Z"
  },
  {
    "title": "Georgia convicted felon arrested for threatening to kill Pres. Trump",
    "description": "A convicted felon living in Rome was arrested and detained for threatening to kill U.S. President Donald Trump on Thursday.",
    "link": "https://www.wsbtv.com/news/local/georgia-convicted-felon-arrested-threatening-kill-pres-trump/G2QVESXBGJHEZCH3744FH2YCNE/",
    "timestamp": "2025-08-08T19:08:39Z"
  },
  {
    "title": "Another Trump Pump Sends Ethereum, XRP and Dogecoin Flying: What Happens Next?",
    "description": "Markets are pumping on another pro-crypto Trump executive order. Will it last? The charts suggest growing optimism.",
    "link": "https://decrypt.co/334325/trump-pump-ethereum-xrp-dogecoin-what-happens-next",
    "timestamp": "2025-08-08T19:08:21Z"
  },
  {
    "title": "Marjorie Taylor Pelosi? The MAGA Firebrand Is Up 142% on a Stock She Bought in April",
    "description": "Rep. Marjorie Taylor Greene (R-GA) may not have much in common with Rep. Nancy Pelosi (D-CA), but both sure know how to make a buck in the stock market.\nThe post Marjorie Taylor Pelosi? The MAGA Firebrand Is Up 142% on a Stock She Bought in April first appear…",
    "link": "https://www.mediaite.com/media/news/marjorie-taylor-pelosi-the-maga-firebrand-is-up-142-on-a-stock-she-bought-in-april/",
    "timestamp": "2025-08-08T19:07:40Z"
  },
  {
    "title": "Oregon small businesses grapple with loss of federal aid for minority-owned startups",
    "description": "Oregon small businesses grapple with loss of federal aid for minority-owned startupsoregonlive.com",
    "link": "https://www.oregonlive.com/business/2025/08/oregon-small-businesses-grapple-with-loss-of-federal-aid-for-minority-owned-startups.html",
    "timestamp": "2025-08-08T19:06:27Z"
  },
  {
    "title": "Modi speaks to Putin, leaders reaffirm commitment to deepening bilateral ties",
    "description": "STATE TIMES NEWS New Delhi: Prime Minister Narendra Modi on Friday spoke to Russian President Vladimir Putin over phone during which the two leaders reaffirmed their commitment to further deepen the Special and Privileged Strategic Partnership between India a…",
    "link": "https://statetimes.in/modi-speaks-to-putin-leaders-reaffirm-commitment-to-deepening-bilateral-ties/",
    "timestamp": "2025-08-08T19:05:34Z"
  },
  {
    "title": "The West’s Turn Against Israel",
    "description": "Germany halts arms exports as more countries mark a shift in opinion on Israel’s offensive in Gaza.",
    "link": "http://foreignpolicy.com/2025/08/08/west-turn-against-israel/",
    "timestamp": "2025-08-08T19:05:17Z"
  },
  {
    "title": "Trump's DOJ opens investigation into state AG's office that brought case against Trump (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTrump's DOJ opens investigation into state AG's office that brought case against Trump  —  After Donald Trump targeted New York Attorney General Letitia James, his Justice Department open an investigation into her office.  What a coincide…",
    "link": "https://www.memeorandum.com/250808/p84",
    "timestamp": "2025-08-08T19:05:01Z"
  },
  {
    "title": "Georgia man threatened to kill Trump, agents in TikTok livestream",
    "description": "A 29-year-old Rome man has been arrested on federal charges after authorities say he made multiple threats to kill President Donald Trump during a TikTok livestream.",
    "link": "https://www.fox5atlanta.com/news/georgia-man-threatened-kill-trump-agents-tiktok-livestream",
    "timestamp": "2025-08-08T19:01:01Z"
  },
  {
    "title": "Trump Orders Use of Military Force Against Drug Cartels in Latin America",
    "description": "Mexico’s president swiftly condemned the order, saying the entry of U.S. troops into Mexico is “absolutely ruled out.”…",
    "link": "https://truthout.org/articles/trump-orders-use-of-military-force-against-drug-cartels-in-latin-america/",
    "timestamp": "2025-08-08T19:00:49Z"
  },
  {
    "title": "Why Everyone in Washington Is a ‘Realist’ Now",
    "description": "What’s emerging is not yet a new consensus. But neither is it as incoherent as current rhetoric would have you believe.",
    "link": "http://foreignpolicy.com/2025/08/08/washington-realist-united-states-dominant-power/",
    "timestamp": "2025-08-08T19:00:41Z"
  },
  {
    "title": "This MAGA hero may be the one to finish off Trump",
    "description": "Joe Rogan built an empire on being the guy who asked the questions nobody else would. That’s why millions of Americans — especially younger men — trust him more than they trust the nation’s media, Congress, or the Supreme Court. They believe he sees through t…",
    "link": "https://www.rawstory.com/raw-investigates/joe-rogan/",
    "timestamp": "2025-08-08T19:00:03Z"
  },
  {
    "title": "China Is Winning the Race for Central Asia’s Critical Minerals",
    "description": "US officials keep expressing enthusiasm for expanding trade in critical minerals with Central Asian states. But while Washington talks, China is taking substantive action to expand its hold over Central Asia’s abundant resources.  During her recent Senate con…",
    "link": "https://oilprice.com/Metals/Commodities/China-Is-Winning-the-Race-for-Central-Asias-Critical-Minerals.html",
    "timestamp": "2025-08-08T19:00:00Z"
  },
  {
    "title": "Trump administration eyes military action against drug cartels, US officials say",
    "description": "WASHINGTON: The administration of US President Donald Trump can use the military to target Latin American drug gangs designated as global terrorist organisations and has directed the Pentagon to prepare opt",
    "link": "https://www.channelnewsasia.com/world/trump-administration-eyes-military-action-against-drug-cartels-us-officials-say-5285746",
    "timestamp": "2025-08-08T19:00:00Z"
  },
  {
    "title": "Israel's plan is unfolding at a time when leaders don't care about international criticism",
    "description": "The debate in the Israeli media over Benjamin Netanyahu's plans to occupy Gaza have barely mentioned the fate of the two million people who live there.",
    "link": "https://www.abc.net.au/news/2025-08-09/benjamin-netanyahu-gaza-international-pressure/105620032",
    "timestamp": "2025-08-08T19:00:00Z"
  },
  {
    "title": "Plans to take Gaza City are met with defiance from war-weary Palestinians and anger by many Israelis",
    "description": "Israel's decision to take over Gaza City was met with resignation and defiance by Palestinians who have survived two years of war and repeated raids.  Many...",
    "link": "https://www.yahoo.com/news/articles/plans-gaza-city-met-defiance-185959962.html",
    "timestamp": "2025-08-08T18:59:59Z"
  },
  {
    "title": "Fox News AI Newsletter: OpenAI GPT-5 draws Musk eyeroll",
    "description": "Stay up to date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.",
    "link": "https://www.foxnews.com/tech/ai-newsletter-openai-gpt-5-draws-musk-eyeroll",
    "timestamp": "2025-08-08T18:58:56Z"
  },
  {
    "title": "Video shows Trump dancing on White House roof?",
    "description": "Video authentically shows U.S. President Donald Trump dancing on the White House roof.",
    "link": "https://www.snopes.com//fact-check/trump-dancing-white-house-roof/",
    "timestamp": "2025-08-08T18:57:00Z"
  },
  {
    "title": "‘Essence of racial profiling’: ICE’s L.A. rental truck raid may have violated court orders",
    "description": "Jen Psaki explains why ICE’s Los Angeles rental truck raid may have violated court orders and shares a new filing from the Trump administration in the case.",
    "link": "https://www.msnbc.com/top-stories/latest/immigration-raid-los-angeles-home-depot-trump-deportations-rcna223883",
    "timestamp": "2025-08-08T18:56:28Z"
  },
  {
    "title": "Pam Bondi finds a new job for Ed Martin: ‘special attorney’ pursuing some Trump foes",
    "description": "Ed Martin was too radical to be confirmed by the Senate, but the Republican keeps getting new DOJ jobs: Now he's a \"special attorney\" targeting two Trump foes.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pam-bondi-finds-new-job-ed-martin-special-attorney-pursuing-trump-foes-rcna223934",
    "timestamp": "2025-08-08T18:55:59Z"
  },
  {
    "title": "COVID is Everywhere (Again) in the Bay Area. What to Know About the Latest XFG ‘Stratus’ Variant",
    "description": "A new COVID variant called XFG, or \"Stratus\" is spreading. Here's what you need to know about the incubation period, symptoms (including particular throat symptoms) and when to take a test.",
    "link": "https://www.kqed.org/news/12045979/xfg-stratus-nimbus-nb181-covid-variant-symptoms-razor-blade-throat-incubation-period-testing",
    "timestamp": "2025-08-08T18:55:39Z"
  },
  {
    "title": "US appeals court throws out Trump contempt ruling over deportation flights",
    "description": "The decision undoes Judge Boasberg's finding that Trump officials may be sanctioned for appearing to defy a court order.",
    "link": "https://www.aljazeera.com/news/2025/8/8/us-appeals-court-throws-out-trump-contempt-ruling-over-deportation-flights",
    "timestamp": "2025-08-08T18:54:19Z"
  },
  {
    "title": "Trump’s crypto 401(k) executive order: Risks of saving for retirement in alternative assets, and who stands to benefit most",
    "description": "President Donald Trump signed an executive order on Thursday that opens the door to allowing alternative assets like cryptocurrencies, private equity, and real estate into 401(k) retirement accounts. Here’s what to know.\nWhat does the executive order say?\nThe…",
    "link": "https://biztoc.com/x/ed6f3a20c50654a7",
    "timestamp": "2025-08-08T18:53:20Z"
  },
  {
    "title": "Map Shows Where Donald Trump Has Helped Broker Peace Deals Since Election",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is set to host the leaders of Azerbaijan and Armenia at the White House on Friday afternoon for what he has billed as a \"historic peace summit.\"\nWhy It Matters\nMembers of the Trump admin…",
    "link": "https://biztoc.com/x/9e80c9c1bb74f2bc",
    "timestamp": "2025-08-08T18:53:15Z"
  },
  {
    "title": "Gold futures trade off highs as White House to issue clarification on bullion tariffs",
    "description": "Gold prices fell from a record high Friday after the White House said it will clarify \"misinformation\" about the precious metal facing tariffs.",
    "link": "https://www.cnbc.com/2025/08/08/gold-futures-trade-off-highs-as-white-house-to-issue-clarification-on-bullion-tariffs.html",
    "timestamp": "2025-08-08T18:52:57Z"
  },
  {
    "title": "Apple's shopping list, and how to get a job offer from Meta",
    "description": "From this week's Tech Memo newsletter: See Apple's potential AI acquisitions, while staying updated on the latest tech trends and AI advancements.",
    "link": "https://www.businessinsider.com/tech-memo-apple-ai-shopping-list-job-offer-meta-openai-2025-8",
    "timestamp": "2025-08-08T18:52:28Z"
  },
  {
    "title": "Trump secretly prepares military action against drug cartels – NYT",
    "description": "The US administration has secretly ordered the use of military force against drug cartels, the New York Times reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622677-trump-cartels-military-action/",
    "timestamp": "2025-08-08T18:51:53Z"
  },
  {
    "title": "Appeals court tosses judge's contempt finding against Trump administration in prison deportations (Associated Press)",
    "description": "Associated Press:\nAppeals court tosses judge's contempt finding against Trump administration in prison deportations  —  A split appeals court panel tossed out a judge's contempt finding against President Donald Trump's administration on Friday in a case over …",
    "link": "https://www.memeorandum.com/250808/p82",
    "timestamp": "2025-08-08T18:50:00Z"
  },
  {
    "title": "Map Shows Where Donald Trump Has Helped Broker Peace Deals Since Election",
    "description": "The president has claimed that he has \"stopped\" several wars since taking office again in January.",
    "link": "https://www.newsweek.com/map-shows-where-donald-trump-has-helped-broker-peace-deals-since-election-2110970",
    "timestamp": "2025-08-08T18:48:29Z"
  },
  {
    "title": "Once 'America's best idea', National Parks are falling apart",
    "description": "National Parks are being forced to stay open despite operating on a \"bare-bones\" crew after cuts to staff and funding. Rangers say they can't sustain it.",
    "link": "https://www.abc.net.au/news/2025-08-09/national-parks-america-reaching-breaking-point/105515284",
    "timestamp": "2025-08-08T18:44:10Z"
  },
  {
    "title": "Mamdani: Cuomo ‘Conspiring’ With Trump to Rig NYC Mayor’s Race",
    "description": "New York City mayoral nominee Zohran Mamdani is accusing former Gov. Andrew Cuomo of “conspiring” with President Donald Trump to rig the election in his... Read More\nThe post Mamdani: Cuomo ‘Conspiring’ With Trump to Rig NYC Mayor’s Race appeared first on The…",
    "link": "https://www.dailysignal.com/2025/08/08/mamdani-cuomo-conspiring-with-trump-rig-nyc-mayors-race/",
    "timestamp": "2025-08-08T18:43:52Z"
  },
  {
    "title": "Senator Demands Bureau Of Prisons Explain Ghislaine Maxwell Transfer",
    "description": "\"Sexual predators shouldn’t be afforded preferential treatment,” said the Rhode Island Democrat.",
    "link": "https://www.huffpost.com/entry/ghislaine-maxwell-transfer-prison_n_6896279fe4b059385ba0841e",
    "timestamp": "2025-08-08T18:43:11Z"
  },
  {
    "title": "Pam Bondi Was a Fox News Regular. Then the Epstein Scandal Happened.",
    "description": "Attorney General Pam Bondi has all but disappeared from Fox News in recent weeks, after being all over the network during the first few months of the Trump administration. Bondi’s last appearance as a guest on Fox News was with Sean Hannity on June 30th, days…",
    "link": "https://freerepublic.com/focus/f-chat/4333471/posts",
    "timestamp": "2025-08-08T18:42:33Z"
  },
  {
    "title": "With Territory Comes Torment",
    "description": "History offers painful lessons for Trump’s expansionist desires.",
    "link": "http://foreignpolicy.com/2025/08/08/trump-united-states-territory-history-colony-greenland-panama-philippines/",
    "timestamp": "2025-08-08T18:40:26Z"
  },
  {
    "title": "‘Pod Save America’ Guys Applaud ‘South Park’ for Mocking Kristi Noem’s Face After Trump Micropenis: ‘Let’s Not Be Gendered’ | Video",
    "description": "The secretary of homeland security had some choice words Thursday for the animated comedy’s latest episode, as well\nThe post ‘Pod Save America’ Guys Applaud ‘South Park’ for Mocking Kristi Noem’s Face After Trump Micropenis: ‘Let’s Not Be Gendered’ | Video ap…",
    "link": "https://www.thewrap.com/pod-save-america-south-park-mocks-kristi-noem-face-trump-micropenis/",
    "timestamp": "2025-08-08T18:38:29Z"
  },
  {
    "title": "Bauer, South Carolina’s former lieutenant governor, ends GOP primary challenge to Sen. Graham",
    "description": "Former South Carolina Lt. Gov. André Bauer has suspended his GOP primary challenge to Sen. Lindsey Graham",
    "link": "https://abcnews.go.com/Politics/wireStory/bauer-south-carolinas-former-lieutenant-governor-ends-gop-124489598",
    "timestamp": "2025-08-08T18:38:26Z"
  },
  {
    "title": "Trump-Appointed Judges Quash Contempt of Court Case Against White House",
    "description": "Two judges appointed by U.S. President Donald Trump on Friday at least temporarily shut down a bid by U.S. District Judge James Boasberg to potentially hold members of the Trump administration in contempt of court.Politico reported that the U.S. Court of Appe…",
    "link": "https://www.commondreams.org/news/trump-contempt-of-court-2673870432",
    "timestamp": "2025-08-08T18:37:44Z"
  },
  {
    "title": "EV sales soar as Trump axes $7,500 tax credit: 'People are rushing out' to buy, analyst says",
    "description": "Consumers are acting ahead of a fast-approaching Sept. 30 deadline to claim the tax break for electric vehicles.",
    "link": "https://www.cnbc.com/2025/08/08/ev-sales-trump-tax-credit.html",
    "timestamp": "2025-08-08T18:37:38Z"
  },
  {
    "title": "Trump may use military against drug cartels: reports",
    "description": "US President Donald Trump is moving to target Latin American drug cartels with the military, US media said, after Washington designated several narcotics trafficking groups as \"terrorist\" organizations earlier this year.",
    "link": "https://www.rte.ie/news/2025/0808/1527600-trump-drug-cartels/",
    "timestamp": "2025-08-08T18:37:37Z"
  },
  {
    "title": "‘South Park’ Viewership Doubles Over Previous Episode, Report Says—As Series Skewers Trump",
    "description": "This week’s episode of “South Park” targeted Homeland Security Secretary Kristi Noem and the Trump administration’s immigration raids.",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/08/south-park-viewership-doubles-over-previous-episode-report-says-as-series-skewers-trump/",
    "timestamp": "2025-08-08T18:36:48Z"
  },
  {
    "title": "TRUMP'S RICO case was created by BILL BARR and FANI WILLIS.",
    "description": "New evidence including emails, notes, and texts expose that they both worked in conjunction to target and prosecute President Trump. Take a wild guess who Bill Barr’s father, \"Donald Barr,\" was close to and hired while he was Headmaster at the Dalton school? …",
    "link": "https://freerepublic.com/focus/f-news/4333469/posts",
    "timestamp": "2025-08-08T18:36:10Z"
  },
  {
    "title": "Jimmy Fallon Tee-hees Through Interview With Fox News Host",
    "description": "Fox News conservative comedian Greg Gutfeld appeared on ‘The Tonight Show’ with Jimmy Fallon, where he was greeted with a hug.",
    "link": "http://www.thecut.com/article/jimmy-fallon-greg-gutfeld-tonight-show.html",
    "timestamp": "2025-08-08T18:34:47Z"
  },
  {
    "title": "White House to Clarify Misinformation on Gold Tariffs",
    "description": "The Trump administration suggested it would issue a new policy clarifying that imports of gold bars should not face tariffs, after the US government stunned traders by ruling that they would be subject to duties.",
    "link": "https://www.livemint.com/companies/news/white-house-to-clarify-misinformation-on-gold-tariffs-11754678073803.html",
    "timestamp": "2025-08-08T18:34:33Z"
  },
  {
    "title": "Intel CEO Lip-Bu Tan Claims He Is the Victim of 'Misinformation' About Ties to China",
    "description": "Intel CEO Lip-Bu Tan has responded to President Donald Trump calling on him to resign over his alleged conflicts of interest due to his ties to the Chinese Communist Party. \"I have always operated within the highest legal and ethical standards,\" Tan said.\nThe…",
    "link": "https://www.breitbart.com/tech/2025/08/08/intel-ceo-lip-bu-tan-claims-he-is-the-victim-of-misinformation-about-ties-to-china/",
    "timestamp": "2025-08-08T18:34:27Z"
  },
  {
    "title": "Here’s what Putin and Trump want from the Ukraine peace deal",
    "description": "Can US President leverage his business negotiation experience in talks with Russia? Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622678-can-art-of-deal-stop-war/",
    "timestamp": "2025-08-08T18:34:20Z"
  },
  {
    "title": "Chicago's budget shortfall puts spotlight on Mamdani's 'socialism' agenda for New York City",
    "description": "NYC mayoral frontrunner Zohran Mamdani faces criticism over costly socialist policies that opponents warn could create a fiscal crisis similar to Chicago.",
    "link": "https://www.foxnews.com/politics/chicagos-budget-shortfall-puts-spotlight-mamdanis-socialism-agenda-new-york-city",
    "timestamp": "2025-08-08T18:34:07Z"
  },
  {
    "title": "Average US tariffs top 20%, back to 1910s levels: WTO and IMF",
    "description": "PARIS: The average US tariff rate has risen to 20.1 per cent, its highest level since the early 1910s – except for a brief spike earlier this year, after new duties took effect on Thursday (Aug 7), data from the World Trade Organization (WTO) and",
    "link": "https://www.channelnewsasia.com/world/average-us-tariffs-top-20-back-1910s-levels-wto-and-imf-5285741",
    "timestamp": "2025-08-08T18:33:50Z"
  },
  {
    "title": "Trump is planning a massive IPO of the government’s mortgage companies | CNN Business",
    "description": "President Donald Trump and his economic advisers are planning a historic sale of stock in Fannie Mae and Freddie Mac, the government-owned mortgage giants that help provide stability and affordability to America’s home loan market.",
    "link": "https://www.cnn.com/2025/08/08/business/fannie-freddie-ipo",
    "timestamp": "2025-08-08T18:33:07Z"
  },
  {
    "title": "Trump Allies Argue the GOP Can Systemically Take Dozens of House Seats From Democrats",
    "description": "\"You know, back-of-the-envelope math, this morning, when I woke up with a smile, was Democrats could lose 42 seats,\" a GOP strategist told Bannon\nThe post Trump Allies Argue the GOP Can Systemically Take Dozens of House Seats From Democrats first appeared on …",
    "link": "https://www.mediaite.com/politics/trump-allies-argue-the-gop-can-systemically-take-dozens-of-house-seats-from-democrats/",
    "timestamp": "2025-08-08T18:31:22Z"
  },
  {
    "title": "Group Takes Credit For Throwing Sex Toys At WNBA Games And Reveals Its Motives",
    "description": "The stunt somehow seems even stupider now, and to make matters worse, Donald Trump Jr. chimed in.",
    "link": "https://www.huffpost.com/entry/wnba-dildo-cryptocurrency_n_68961d1de4b04e989ca76898",
    "timestamp": "2025-08-08T18:31:15Z"
  },
  {
    "title": "Tackling Structural Barriers—60 Years of the Voting Rights Act",
    "description": "Weekend Reading for Women’s Representation is a compilation of stories about women’s representation in politics, sports and entertainment, judicial offices and the private sector—with a little gardening mixed in! \nThis week:\n—Sixty years have passed since the…",
    "link": "https://msmagazine.com/2025/08/08/voting-rights-act-history-women-politics-representation/",
    "timestamp": "2025-08-08T18:31:01Z"
  },
  {
    "title": "Trump is planning a massive IPO of the government’s mortgage companies",
    "description": "President Donald Trump and his economic advisers are planning a historic sale of stock in Fannie Mae and Freddie Mac, the government-owned mortgage giants that help provide stability and affordability",
    "link": "https://www.abc12.com/news/business/trump-is-planning-a-massive-ipo-of-the-government-s-mortgage-companies/article_0983534c-d3e0-5ba0-ae8c-4e4057ce2e54.html",
    "timestamp": "2025-08-08T18:30:53Z"
  },
  {
    "title": "50% US tariff on Indian goods could shave 0.3% off GDP in FY26: Moody's",
    "description": "Moody's Ratings projects that the US's 50% tariff on Indian goods could reduce India's economic growth by 0.3 percentage points in 2025-26. This widened tariff gap compared to other Asia-Pacific nations may hinder India's manufacturing ambitions, especially i…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/50-us-tariff-on-indian-goods-could-shave-0-3-off-gdp-in-fy26-moodys/articleshow/123195217.cms",
    "timestamp": "2025-08-08T18:30:34Z"
  },
  {
    "title": "The EU are ‘stinkers’– Lukashenko",
    "description": "The Belarusian leader slammed the EU for preventing Ukrainian grain from reaching global markets Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622661-belarus-eu-us-ukraine/",
    "timestamp": "2025-08-08T18:29:35Z"
  },
  {
    "title": "Texas State Rep. Isn't Backing Down From Fighting 'Overtly Racist' Redistricting Map",
    "description": "State Rep. Vince Perez (D) and his colleagues have faced threats of arrest and violence for leaving the state to stop a \"clearly racially engineered\" map.",
    "link": "https://www.huffpost.com/entry/texas-state-rep-isnt-backing-down-from-fighting-overtly-racist-redistricting-map_n_689621d7e4b07ee88fcb4ad5",
    "timestamp": "2025-08-08T18:29:05Z"
  },
  {
    "title": "Swiss Gold Refining Sector Hits US Tariff Mine",
    "description": "The first casualty of the imposition of a hefty 39-percent tariff on Swiss imports into the United States may be gold refining after it emerged certain gold bars would face the levy.",
    "link": "https://www.ibtimes.com/swiss-gold-refining-sector-hits-us-tariff-mine-3780547",
    "timestamp": "2025-08-08T18:27:21Z"
  },
  {
    "title": "Donald Trump faces tough fight in 9 states, including Texas, Florida, California, New York. Check latest state by state political scenario",
    "description": "Texas, Ohio, Florida, Indiana, Missouri, California, Illinois, Maryland, New York will offer tough political challenges before U.S. President Donald Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-faces-tough-fight-in-9-states-including-texas-florida-california-new-york-check-latest-state-by-state-political-scenario/articleshow/123194922.cms",
    "timestamp": "2025-08-08T18:25:48Z"
  },
  {
    "title": "Dem ‘Blueprint’ Promised By Hakeem Jeffries Still Nowhere To Be Seen At Self-Imposed Deadline",
    "description": "Hakeem Jeffries pledged to roll out a plan articulating Democrats' policy agenda by August 8, but appears likely to miss his self-imposed deadline.",
    "link": "https://dailycaller.com/2025/08/08/hakeem-jeffries-house-democrats-blueprint-deadline/",
    "timestamp": "2025-08-08T18:22:19Z"
  },
  {
    "title": "US has ‘no plans’ to recognise Palestinian state, Vance says on UK trip",
    "description": "The US vice president reaffirms Washington's stance as calls for recognition of a Palestinian state gain momentum.",
    "link": "https://www.aljazeera.com/news/2025/8/8/us-has-no-plans-to-recognise-palestinian-state-vance-says-on-uk-trip",
    "timestamp": "2025-08-08T18:20:50Z"
  },
  {
    "title": "From Terror Sanctions to Military Strikes? Trump's Cartel Policy Sidesteps Congress",
    "description": "Sometimes the slide down a slippery slope is very fast. Soon after taking office, President Donald Trump designated several Mexican, Salvadoran, and Venezuelan gangs as terrorist groups. Many observers, including myself, thought that the listing could be a pr…",
    "link": "https://biztoc.com/x/dac0caba1bb01566",
    "timestamp": "2025-08-08T18:19:30Z"
  },
  {
    "title": "The ICC’s Arrest Warrants Against Taliban Leaders Are Historic",
    "description": "The top court’s decision sets a clear precedent that persecuting LGBTQ people is a crime against humanity.",
    "link": "http://foreignpolicy.com/2025/08/08/icc-taliban-arrest-warrant-lgbtq-rights-international-law/",
    "timestamp": "2025-08-08T18:18:31Z"
  },
  {
    "title": "Trump directs Pentagon to prepare military options to use against some drug cartels",
    "description": "Trump has directed the Pentagon to prepare options for the possible use of U.S. military force against drug cartels designated as terrorist organizations, officials say.",
    "link": "https://abcnews.go.com/Politics/trump-directs-pentagon-prepare-military-options-drug-cartels/story?id=124481306",
    "timestamp": "2025-08-08T18:17:55Z"
  },
  {
    "title": "India pauses plans to buy US arms after Trump's tariffs",
    "description": "NEW DELHI, Aug 8 (Reuters) - New Delhi has put on hold its plans to procure new U.S. weapons and aircraft, according to three Indian officials familiar with the matter, in India's first concrete sign of discontent after tariffs imposed on its exports by Presi…",
    "link": "https://freerepublic.com/focus/f-news/4333468/posts",
    "timestamp": "2025-08-08T18:17:32Z"
  },
  {
    "title": "From Terror Sanctions to Military Strikes? Trump's Cartel Policy Sidesteps Congress",
    "description": "The New York Times reports that the military is drawing up plans for \"direct military operations at sea and on foreign soil against cartels.\"",
    "link": "https://reason.com/2025/08/08/from-terror-sanctions-to-military-strikes-trumps-cartel-policy-sidesteps-congress/",
    "timestamp": "2025-08-08T18:15:11Z"
  },
  {
    "title": "This Is the Latest Grocery Store Staple to Soar in Price—And It Could Wreck Your End-of-Summer Barbecue",
    "description": "Sticker shock may have you rethinking your next cookout—or at least the main dish. Here's what to know before heading to the grocery store.\nThe post This Is the Latest Grocery Store Staple to Soar in Price—And It Could Wreck Your End-of-Summer Barbecue appear…",
    "link": "https://www.rd.com/article/grocery-item-price-increase-2025/",
    "timestamp": "2025-08-08T18:14:56Z"
  },
  {
    "title": "‘Come On!’ JD Vance Asked About Trump 2028 Remark During Foreign Trip",
    "description": "Vice President JD Vance feigned exasperation when a reporter asked him about Trump's recent comments on the 2028 Republican primary.\nThe post ‘Come On!’ JD Vance Asked About Trump 2028 Remark During Foreign Trip first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/come-on-jd-vance-asked-about-trump-2028-remark-during-foreign-trip/",
    "timestamp": "2025-08-08T18:13:02Z"
  },
  {
    "title": "Exclusive -- Canoe-Gate: Team Vance Scorches 'Leftists,' 'Fake News' for 'Outright Falsehoods' Secret Service Debunked on River Level",
    "description": "Vice President JD Vance’s office is shredding “leftists” and “fake news” outlets for continuing to spread “outright falsehoods\" about a recent vacation the vice president took with his family for his birthday.\nThe post Exclusive — Canoe-Gate: Team Vance Scorc…",
    "link": "https://www.breitbart.com/politics/2025/08/08/exclusive-canoe-gate-team-vance-scorches-leftists-fake-news-for-outright-falsehoods-secret-service-debunked-on-river-level/",
    "timestamp": "2025-08-08T18:12:28Z"
  },
  {
    "title": "Perhaps The Worst Possible Person Has Taken A Shot At Sydney Sweeney In Her New Song — Lizzo",
    "description": "The mind-numbing culture war surrounding Sydney Sweeney’s American Eagle campaign looks set to continue for another few days, as pop artist Lizzo has taken a shot at the actress in her new song ‘I’m Goin’ In Till October’. Sydney Sweeney’s “Great Jeans” campa…",
    "link": "https://brobible.com/culture/article/lizzo-sydney-sweeney-lyric-new-song/",
    "timestamp": "2025-08-08T18:12:09Z"
  },
  {
    "title": "Paramount and Skydance close their $8 billion merger, kicking off reign of new entertainment giant",
    "description": "NEW YORK (AP) — Skydance and Paramount officially closed their $8 billion merger on Thursday — kicking off the reign of a new entertainment giant after a contentious, over year-long endeavor to get the transaction over the finish line. The new company — which…",
    "link": "https://freerepublic.com/focus/f-news/4333464/posts",
    "timestamp": "2025-08-08T18:11:54Z"
  },
  {
    "title": "'I know you are, but what am I?' Trump’s revenge mocked by legal experts",
    "description": "Legal analysts are collectively rolling their eyes and responding with ridicule after President Donald Trump's administration assigned longtime ally Ed Martin to serve as a special counsel to investigate Sen. Adam Schiff (D-CA) and New York Attorney General L…",
    "link": "https://www.rawstory.com/trump-investigation-2673870134/",
    "timestamp": "2025-08-08T18:10:32Z"
  },
  {
    "title": "Trump signs order authorising military action against cartels: Reports",
    "description": "Mexican politicians warn that US action against criminal groups on their soil would be a violation of sovereignty.",
    "link": "https://www.aljazeera.com/news/2025/8/8/trump-signs-order-authorising-military-action-against-cartels-reports",
    "timestamp": "2025-08-08T18:08:57Z"
  },
  {
    "title": "Opinion: If Trump's trade target is a customs union, Canada will have a big decision to make",
    "description": "The Canadian government failed to reach a \n \n \n \n \n \n \n \n \n \n trade deal\n \n \n \n \n \n \n \n \n \n with the \n \n \n \n \n \n \n \n \n \n United States\n \n \n \n \n \n \n \n \n \n before the Aug. 1 deadline. As a result, U.S. President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n…",
    "link": "https://biztoc.com/x/9134046320179c9b",
    "timestamp": "2025-08-08T18:08:33Z"
  },
  {
    "title": "Trump Signs Directive That Could Deploy US Military in Mexico: Report",
    "description": "President Donald Trump's order reportedly opens the route for operations on foreign soil and at sea against drug cartels.",
    "link": "https://biztoc.com/x/3a3ccfb65b377916",
    "timestamp": "2025-08-08T18:08:15Z"
  },
  {
    "title": "Jordan and Egypt condemn Israeli plan to take over entire Gaza Strip",
    "description": "Arab states will not agree to Binyamin Netanyahu’s policies ‘nor clean his mess’, says Jordanian official",
    "link": "https://www.irishtimes.com/world/middle-east/2025/08/08/jordan-and-egypt-condemn-israeli-plan-to-take-over-entire-gaza-strip/",
    "timestamp": "2025-08-08T18:06:29Z"
  },
  {
    "title": "How closely do congressional delegations reflect how people vote? Not very",
    "description": "At the core of the fight in Texas over redrawing the state’s congressional districts is a debate over a time-honored right spelled out in the Constitution: Every two years, “the People” get to pick someone to represent their interests in the U.S. House...",
    "link": "https://abcnews.go.com/US/wireStory/closely-congressional-delegations-reflect-people-vote-124488387",
    "timestamp": "2025-08-08T18:06:28Z"
  }
]