[
  {
    "title": "‘All Out War’ Against Immigration Fraud Puts Hundreds Of Foreigners On Notice In Blue City",
    "description": "USCIS put hundreds of migrants on notice after taking their \"all-out war\" on fraud to the frontlines in a targeted operation in the Twin Cities of Minnesota.",
    "link": "https://dailycaller.com/2025/09/30/uscis-takes-immigration-war-to-twin-cities/",
    "timestamp": "2025-09-30T19:20:14Z"
  },
  {
    "title": "Russian oil keeps flowing despite US pressure – Bloomberg",
    "description": "Crude exports have reportedly remained near peak levels as global buyers ignore Washington’s demands to halt purchases Read Full Article at RT.com",
    "link": "https://www.rt.com/business/625663-russia-oil-exports-rising/",
    "timestamp": "2025-09-30T19:19:46Z"
  },
  {
    "title": "Donald Trump Shitposts AI Slop Amid Shutdown Impasse",
    "description": "From the war in Gaza to the imagined arrest of Barack Obama, there’s no topic so serious that the president won’t promote a meme about it.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-shitposts-ai-slop-amid-shutdown-impasse",
    "timestamp": "2025-09-30T19:19:46Z"
  },
  {
    "title": "Majority Of Americans Now Oppose Economic And Military Support For Israel",
    "description": "A majority of Americans now oppose support for Israel amid its ongoing genocide of the Palestinians, according to a New York Times/Siena poll released Tuesday.",
    "link": "https://dailycaller.com/2025/09/30/new-york-times-siena-poll-israel-support-military-aid-collapsing/",
    "timestamp": "2025-09-30T19:17:57Z"
  },
  {
    "title": "What To Know About Trump’s 20-Point Gaza Peace Plan",
    "description": "Israeli Prime Minister Benjamin Netanyahu has accepted Donald Trump’s plan to end the war in Gaza, while Hamas has yet to issue an official response.\nEuropean and Middle Eastern leaders have welcomed the 20-point plan, as President Trump warned Hamas to accep…",
    "link": "https://biztoc.com/x/d637dd63cf3aa9e4",
    "timestamp": "2025-09-30T19:17:22Z"
  },
  {
    "title": "Comey's indictment centers on truth of authorizing his friend & advisor to leak to media: Sources",
    "description": "Meet Daniel Richman: Comey's friend, personal lawyer, special government employee, and possible media leak conduit. Fired FBI Director James Comey has been indicted for purportedly lying to Congress when he denied authorizing FBI leaks to the media. In fact, …",
    "link": "https://freerepublic.com/focus/f-news/4343544/posts",
    "timestamp": "2025-09-30T19:16:36Z"
  },
  {
    "title": "Pfizer to cut drug prices in exchange for tariff relief, Trump says",
    "description": "President expects other drugmakers to follow suit, White House also planning website for Americans to buy drugs, called TrumpRx",
    "link": "https://www.theglobeandmail.com/business/article-trump-pfizer-deal-drug-prices-tariff-relief/",
    "timestamp": "2025-09-30T19:15:37Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "A man has been charged with the murders of three people in Co louth, Orla Comerford has won gold for Team Ireland again and people over 70 can bring a companion on public transport for free.",
    "link": "https://www.thejournal.ie/news-fix-tuesday-3009-6831529-Sep2025/",
    "timestamp": "2025-09-30T19:13:15Z"
  },
  {
    "title": "Trump announces 'TrumpRx' site for discounted drugs and deal with Pfizer to lower prices (CNN)",
    "description": "CNN:\nTrump announces ‘TrumpRx’ site for discounted drugs and deal with Pfizer to lower prices  —  President Donald Trump on Tuesday announced a multipronged effort aimed at lowering drug costs in the United States, including the creation of a “TrumpRx” direct…",
    "link": "https://www.memeorandum.com/250930/p102",
    "timestamp": "2025-09-30T19:10:02Z"
  },
  {
    "title": "Hegseth criticises ‘fat generals’, says US officers can resign if they don’t back Trump agenda",
    "description": "US defence secretary says all fitness tests to be set to male benchmarks, and emphasises importance of grooming standards",
    "link": "https://www.irishtimes.com/world/2025/09/30/hegseth-criticises-fat-generals-says-us-officers-can-resign-if-they-dont-back-trump-agenda/",
    "timestamp": "2025-09-30T19:09:46Z"
  },
  {
    "title": "China manufacturing sector contracts once again",
    "description": "Chinese industry has shrunk for past six months",
    "link": "https://www.irishtimes.com/business/2025/10/01/china-manufacturing-sector-contracts-once-again/",
    "timestamp": "2025-09-30T19:08:22Z"
  },
  {
    "title": "Trump UN speech: If Donald Trump thinks climate change is a hoax, we’re in safer hands with China",
    "description": "China is the great contradiction. It’s the world’s biggest single emitter, accounting for about 30 per cent of global emissions, but it’s the country doing most to move to renewables.",
    "link": "https://www.smh.com.au/business/the-economy/trump-says-climate-change-is-a-hoax-are-we-in-safer-hands-with-the-commos-20250930-p5myz0.html",
    "timestamp": "2025-09-30T19:07:51Z"
  },
  {
    "title": "Republicans threatened with ominous 'consequences' if they defy Trump's new 'loyalty test'",
    "description": "President Donald Trump is reportedly putting pressure on Republicans to redraw district maps, warning that \"there could very well be consequences\" if they don't take action.Trump has taken an aggressive stance in his efforts to redesign the House of Represent…",
    "link": "https://www.rawstory.com/donald-trump-2674127220/",
    "timestamp": "2025-09-30T19:06:57Z"
  },
  {
    "title": "Pfizer to cut drug prices in exchange for tariff relief, Trump says",
    "description": "U.S. President Donald Trump on Tuesday said Pfizer PFE-N will cut the price of all prescription drugs in the Medicaid program for low-income Americans and sell new prescription drugs at a “most favoured nation” price in exchange for tariff relief.\nTrump also …",
    "link": "https://biztoc.com/x/fb6c778512728410",
    "timestamp": "2025-09-30T19:06:00Z"
  },
  {
    "title": "Democratic Mayors Say Donald Trump Has 'Declared War' on Cities",
    "description": "President Trump gave a speech at the Marine Corps Base Tuesday at Quantico.",
    "link": "https://biztoc.com/x/e0a38fa093a9e4ca",
    "timestamp": "2025-09-30T19:05:48Z"
  },
  {
    "title": "Oil companies slash jobs by the thousands as prices fall, tariffs rise and industry consolidates",
    "description": "President Donald Trump promised boom times for oil and gas when he took office in January. Instead, the industry is cutting jobs.",
    "link": "https://biztoc.com/x/f0199d2f9f8e50ad",
    "timestamp": "2025-09-30T19:05:44Z"
  },
  {
    "title": "Trump’s New Core Mission for the Military: ‘Enemy Within’",
    "description": "In an alarming if incoherent speech to Pete Hegseth’s assemblage of brass, Trump puts the military on notice that America is a domestic battleground where they must regularly fight ‘the enemy within.’",
    "link": "http://nymag.com/intelligencer/article/trumps-new-core-mission-for-the-military-enemy-within.html",
    "timestamp": "2025-09-30T19:05:04Z"
  },
  {
    "title": "Trump’s plan to end Gaza conflict provides viable pathway to sustainable peace: Modi",
    "description": "STATE TIMES NEWS NEW DELHI: Prime Minister Narendra Modi on Tuesday welcomed US President Donald Trump’s plan to end the Gaza conflict and said it provides a viable path to long-term peace, security and development for the Palestinian and Israeli people as we…",
    "link": "https://statetimes.in/trumps-plan-to-end-gaza-conflict-provides-viable-pathway-to-sustainable-peace-modi/",
    "timestamp": "2025-09-30T19:04:35Z"
  },
  {
    "title": "Can Americans Trust RFK Jr.'s Health Advice? A Breakdown on Vaccines, Autism, Food Dyes, and More",
    "description": "Can the public trust health recommendations from the Department of Health and Human Services? Be cautious.",
    "link": "https://reason.com/2025/09/30/can-americans-trust-rfk-jr-s-health-advice-a-breakdown-on-vaccines-autism-food-dyes-and-more/",
    "timestamp": "2025-09-30T19:03:47Z"
  },
  {
    "title": "Majority Of Americans Do Not Want Democrat Government Shutdown: POLL",
    "description": "The majority of Americans do not support Democrats shutting down the government, according to a New York Times/Siena University poll released Tuesday.",
    "link": "https://dailycaller.com/2025/09/30/government-shutdown-siena-poll/",
    "timestamp": "2025-09-30T19:03:38Z"
  },
  {
    "title": "Israeli hostage families and Palestinians in nervous wait over Gaza peace plan",
    "description": "With Hamas yet to provide its response to Donald Trump's peace plan, affected civilians on both sides of the war share their concerns and hopes for the future.",
    "link": "https://www.abc.net.au/news/2025-10-01/gaza-peace-plan-israel-hostage-families-palestinians-wait/105837370",
    "timestamp": "2025-09-30T19:03:03Z"
  },
  {
    "title": "Ezra Klein Committed To The Bit That Abortion Rights Are Unpopular",
    "description": "So why do they keep winning, even in red states?",
    "link": "https://www.wonkette.com/p/ezra-klein-committed-to-the-bit-that",
    "timestamp": "2025-09-30T19:02:19Z"
  },
  {
    "title": "Trump Begs Military Leaders to Clap During His Wild Speech",
    "description": "President Donald Trump begged top military brass Tuesday to clap for him as he unleashed a radical far-right tirade about using the armed forces against American citizens. “I’ve never walked into a room so silent before,” Trump said. “This is very inter—don’t…",
    "link": "https://newrepublic.com/post/201144/donald-trump-begs-military-leaders-clap",
    "timestamp": "2025-09-30T19:02:09Z"
  },
  {
    "title": "How America’s Business Elite Became Their Own Marxist Caricature",
    "description": "There is a moment in every authoritarian takeover when the business elite must choose between principle and profit, between defending the system that made their wealth possible and accommodating the forces destroying that system. That moment has arrived for A…",
    "link": "https://www.techdirt.com/2025/09/30/how-americas-business-elite-became-their-own-marxist-caricature/",
    "timestamp": "2025-09-30T19:00:39Z"
  },
  {
    "title": "Dems Plan Luxury Retreat in CA Wine Country While Complaining About Shutdown",
    "description": "“Sleep deeply always, in our luxurious accommodations. Soak in one of our oversized sunken tubs and find warmth by your private fieldstone fireplace”\nThe post Dems Plan Luxury Retreat in CA Wine Country While Complaining About Shutdown first appeared on Le·ga…",
    "link": "https://legalinsurrection.com/2025/09/democrats-plan-luxury-retreat-in-california-wine-country-while-complaining-about-shutdown/",
    "timestamp": "2025-09-30T19:00:35Z"
  },
  {
    "title": "'TrumpRx' website to offer discounted drugs as part of landmark Big Pharma deal",
    "description": "President Donald Trump unveiled a new deal to drastically reform the pharmaceutical industry and reduce drug prices for consumers. Trump announced that Pfizer would be heavily discounting some of its \"most popular medications\" and that all new medications int…",
    "link": "https://www.theblaze.com/news/trumprx-website-to-offer-discounted-drugs-as-part-of-landmark-big-pharma-deal",
    "timestamp": "2025-09-30T19:00:00Z"
  },
  {
    "title": "Analysis: How happy is Israel’s Netanyahu with Trump’s Gaza plan?",
    "description": "Israeli PM Netanyahu says he's accepted the proposal, but with far-right opposition, will he follow through with it?",
    "link": "https://www.aljazeera.com/news/2025/9/30/analysis-how-happy-is-israels-netanyahu-with-trumps-gaza-plan",
    "timestamp": "2025-09-30T18:56:22Z"
  },
  {
    "title": "Trump went off about 'ugly' stealth warships in his wandering chat with US generals and admirals",
    "description": "The president called some of the US Navy's stealth ship designs \"ugly.\"\nUS Navy/General Dynamics Bath Iron Works via Getty Images\nUS President Donald Trump once again shared his thoughts on the appearance of Navy vessels.\nHe told generals and admirals how he …",
    "link": "https://biztoc.com/x/650e19f60fa07172",
    "timestamp": "2025-09-30T18:54:17Z"
  },
  {
    "title": "Trump's new letter shows plan to return US to 'darkest past': analyst",
    "description": "President Donald Trump's new letter to naturalised U.S. citizens hints at his disturbing agenda for America, according to Salon's Chauncey DeVega. Trump's letter, released on Sept. 17, tells migrants they are taking an oath to \"forge a sacred bond with our Na…",
    "link": "https://www.rawstory.com/migration/",
    "timestamp": "2025-09-30T18:54:03Z"
  },
  {
    "title": "HUD Website Pushes Propaganda From Trump Administration With New Banner Message",
    "description": "The message from HUD stands as yet another example of the administration’s smashing of norms and willingness to flout ethical boundaries.",
    "link": "https://www.huffpost.com/entry/trump-administration-hud-website-shutdown_n_68dc19c3e4b003b6c8dc601b",
    "timestamp": "2025-09-30T18:53:40Z"
  },
  {
    "title": "NASA signs US-Australia Agreement on Aeronautics, Space Cooperation",
    "description": "At the International Astronautical Congress (IAC) taking place in Sydney this week, representatives from the United States and Australia gathered to sign a framework agreement that strengthens collaboration in aeronautics and space exploration between the two…",
    "link": "https://www.nasa.gov/missions/artemis/nasa-signs-us-australia-agreement-on-aeronautics-space-cooperation/",
    "timestamp": "2025-09-30T18:53:32Z"
  },
  {
    "title": "18 Scarily Stupid Moments From Trump and Hegseth’s Generals Meeting",
    "description": "Some 800 top military leaders were summoned to Virginia so Hegseth could call them ‘fat’ and Trump could threaten military action in U.S. cities and brag about himself. Here are 18 scarily stupid moments from Trump and Hegseth’s generals meeting.",
    "link": "http://nymag.com/intelligencer/article/trump-hegseth-generals-meeting-scarily-stupid-moments.html",
    "timestamp": "2025-09-30T18:52:03Z"
  },
  {
    "title": "Watch: How Trump and Hegseth's gathering of top US generals unfolded",
    "description": "Hundreds of high ranking military leaders were summoned for an unusual meeting with the Department of Defense secretary.",
    "link": "https://www.bbc.com/news/videos/crkj1k8z8j4o",
    "timestamp": "2025-09-30T18:51:36Z"
  },
  {
    "title": "Evidence Behind Comey Indictment Is Unclear",
    "description": "Former FBI Director James Comey was indicted by a federal grand jury on Sept. 25 for lying to Congress and obstructing a congressional proceeding. In this story, we cover the few details we know about the indictment and what Comey told Congress.\nThe post Evid…",
    "link": "https://www.factcheck.org/2025/09/evidence-behind-comey-indictment-is-unclear/",
    "timestamp": "2025-09-30T18:50:01Z"
  },
  {
    "title": "Banks Enjoy Near-Record Fees Amid ‘Infectious’ M&A Environment",
    "description": "Merger and acquisition (M&A) deals are reportedly on track to reach $3.1 trillion this year. That’s up 35% during the same period in 2024, and puts this in line to be the best year for M&A since 2021, the Financial Times (FT) reported Tuesday (Sept. 29). As t…",
    "link": "http://www.pymnts.com/acquisitions/2025/banks-enjoy-near-record-fees-amid-infectious-ma-environment/",
    "timestamp": "2025-09-30T18:49:44Z"
  },
  {
    "title": "A weakened Hamas faces pressure to accept Trump’s plan to end the war in Gaza",
    "description": "The 20-point plan, unveiled by Trump and Netanyahu at the White House, greatly favors Israel. Hamas says it is still studying the plan and will respond soon",
    "link": "https://www.pbs.org/newshour/world/a-weakened-hamas-faces-pressure-to-accept-trumps-plan-to-end-the-war-in-gaza",
    "timestamp": "2025-09-30T18:49:16Z"
  },
  {
    "title": "No paper tiger: China has the US beat in this key arena",
    "description": "Washington is trying to reestablish its Afghan military base as a stronghold against Beijing and a local operations anchor Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625590-us-china-afghanistan-bagram/",
    "timestamp": "2025-09-30T18:49:08Z"
  },
  {
    "title": "Trump went off about 'ugly' stealth warships in his wandering chat with US generals and admirals",
    "description": "The US president has often focused on the appearance and aesthetic of US Navy ships, calling them ugly compared to other countries' vessels.",
    "link": "https://www.businessinsider.com/trump-goes-off-about-ugly-stealth-warships-us-military-summit-2025-9",
    "timestamp": "2025-09-30T18:49:06Z"
  },
  {
    "title": "More than half of likely voters in Mass. say Gov. Healey should be reelected, poll finds",
    "description": "More than half of likely 2026 general election voters in Massachusetts believe Gov. Maura Healey should be reelected to a second term, and another 51% approve of the job the Arlington Democrat has done, according to a University of New Hampshire poll released…",
    "link": "https://www.bostonherald.com/2025/09/30/more-than-half-of-likely-voters-in-mass-say-gov-healey-should-be-reelected-poll-finds/",
    "timestamp": "2025-09-30T18:48:59Z"
  },
  {
    "title": "New federal law will drop state's tax take by $650M, DOR chief says",
    "description": "The sweeping federal law that President Donald Trump signed on the same day that Gov. Maura Healey signed the annual budget for Massachusetts is projected to result in a $650 million hit to state tax revenues this budget year, the…",
    "link": "https://www.thesunchronicle.com/news/local_news/new-federal-law-will-drop-states-tax-take-by-650m-dor-chief-says/article_b22dddb6-1bfe-438f-bf27-ace127b8c3f9.html",
    "timestamp": "2025-09-30T18:46:00Z"
  },
  {
    "title": "WATCH: Trump reposts video of top Dems, with Hakeem in sombrero",
    "description": "Altered words have Schumer saying, 'If we give all these illegal aliens free health care, we might be able to get them on our side so they can vote for us'",
    "link": "https://www.wnd.com/2025/09/watch-trump-reposts-video-top-dems-hakeem-sombrero/",
    "timestamp": "2025-09-30T18:45:40Z"
  },
  {
    "title": "Why Donald J. Trump ‘Will Not Allow Israel to Annex the West Bank’",
    "description": "It’s no coincidence after his meeting with reps from the Middle East.He didn’t say why, but I think I know. Christine Douglass-Williams wrote about the latest from the mercurial president here, and here is more: “Trump: I will not allow Israel to annex Judea …",
    "link": "https://freerepublic.com/focus/f-news/4343537/posts",
    "timestamp": "2025-09-30T18:43:51Z"
  },
  {
    "title": "Philadelphia to Fly Flag of ‘Foreign Adversary’",
    "description": "Philadelphia is planning to fly the Chinese flag above its city hall Tuesday in a ceremony reports suggest is meant to celebrate the 76th anniversary... Read More\nThe post Philadelphia to Fly Flag of ‘Foreign Adversary’ appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/30/philadelphia-flies-flag-of-foreign-adversary/",
    "timestamp": "2025-09-30T18:43:30Z"
  },
  {
    "title": "PM Modi backs US President Donald Trump's Gaza peace plan",
    "description": "Prime Minister Narendra Modi welcomed US President Donald Trump's 20-point Gaza peace proposal. The plan aimed for lasting peace between Israelis and Palestinians. It included a ceasefire, hostage exchange, and Israeli withdrawal. Trump unveiled the initiativ…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-backs-us-president-donald-trumps-gaza-peace-plan/articleshow/124242743.cms",
    "timestamp": "2025-09-30T18:43:27Z"
  },
  {
    "title": "Trump Warns Of 'Irreversible' Consequences As Shutdown Chances Reach 85% On Polymarket",
    "description": "President Donald Trump on Tuesday signaled a shutdown was \"probably likely\" as prediction market traders price an 86% of a U.S. government shutdown before midnight.\nAccording to Polymarket traders, a shutdown by Wednesday looks highly likely, while a shutdown…",
    "link": "https://biztoc.com/x/adbeefbd17032638",
    "timestamp": "2025-09-30T18:43:15Z"
  },
  {
    "title": "Republican governor asks the Pentagon to deploy National Guard troops to Louisiana",
    "description": "Some cities in Louisiana are poised to join the growing list of areas where National Guard troops will be deployed to public streets.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republican-governor-asks-pentagon-deploy-national-guard-troops-louisia-rcna234756",
    "timestamp": "2025-09-30T18:41:09Z"
  },
  {
    "title": "Trump Presidential Library To Be Located On ‘Miami Skyline’",
    "description": "Florida officials voted unanimously on Tuesday for President Donald Trump's presidential library to be located at Miami Dade College.",
    "link": "https://dailycaller.com/2025/09/30/trump-presidential-library-miami-dade-college/",
    "timestamp": "2025-09-30T18:40:36Z"
  },
  {
    "title": "Trump and Hegseth Quantico summit — is the meeting called because America’s lead over Russia and China is slipping fast?",
    "description": "President Donald Trump and Defense Secretary Pete Hegseth held a rare and powerful meeting with nearly 800 top US military leaders at Quantico on September 30, 2025. Secretary Hegseth announced sweeping changes to restore what he called the “warrior ethos.” P…",
    "link": "https://economictimes.indiatimes.com/news/international/us/at-a-rare-quantico-summit-trump-and-hegseth-push-strict-military-standards-and-warn-of-internal-threats-is-americas-lead-over-russia-and-china-slipping-fast/articleshow/124242162.cms",
    "timestamp": "2025-09-30T18:40:00Z"
  },
  {
    "title": "With Wounded Knee Medals, Trump Admin Suggests There’s Valor in Genocide",
    "description": "The call to rescind those medals is not about erasing history, but about refusing to let lies and conquest define it.",
    "link": "https://truthout.org/articles/with-wounded-knee-medals-trump-admin-suggests-theres-valor-in-genocide/",
    "timestamp": "2025-09-30T18:39:41Z"
  },
  {
    "title": "We're used to Trump's bonkers speeches, and this was another classic [Followup]",
    "description": "We're used to Trump's bonkers speeches, and this was another classic",
    "link": "https://www.fark.com/comments/13829474/Were-used-to-Trumps-bonkers-speeches-this-was-another-classic",
    "timestamp": "2025-09-30T18:39:25Z"
  },
  {
    "title": "Two Historic Speeches at the UN General Assembly",
    "description": "Trump and Netanyahu bring truth to the globalist hall of lies.President Donald Trump and Prime Minister Benjamin Netanyahu delivered stern but much-needed addresses to the United Nations General Assembly during this year’s annual General Assembly High-Level W…",
    "link": "https://freerepublic.com/focus/f-news/4343535/posts",
    "timestamp": "2025-09-30T18:39:16Z"
  },
  {
    "title": "Vance, Trump Jr's plans to bolster Charlie Kirk's 'political legacy' revealed: 'Help grow it'",
    "description": "The vice president and president's eldest son commit to continuing their work with the conservative youth organization after Charlie Kirk's passing.",
    "link": "https://www.foxnews.com/politics/vance-trump-jrs-plans-bolster-charlie-kirks-political-legacy-revealed-help-grow-it",
    "timestamp": "2025-09-30T18:37:16Z"
  },
  {
    "title": "Pete Hegseth slams 'fat generals,' says US officers should resign if they don't support his agenda",
    "description": "Hegseth, a former Fox News personality, was joined by U.S. President Donald Trump, himself a former reality television host, for an on-camera event in Quantico, Virginia that had a made-for-TV character to it with generals and admirals assembled on short noti…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pete-hegseth-slams-fat-generals-says-us-officers-should-resign-if-they-dont-support-his-agenda/articleshow/124242581.cms",
    "timestamp": "2025-09-30T18:36:58Z"
  },
  {
    "title": "Key takeaways from Trump’s speech to US military generals",
    "description": "Republican president tells top military officers they will play part in 'war from within' in major US cities.",
    "link": "https://www.aljazeera.com/news/2025/9/30/key-takeaways-from-trumps-speech-to-us-military-generals",
    "timestamp": "2025-09-30T18:36:26Z"
  },
  {
    "title": "Oil companies slash jobs by the thousands as prices fall, tariffs rise and industry consolidates",
    "description": "President Donald Trump promised boom times for oil and gas when he took office in January. Instead, the industry is cutting jobs.",
    "link": "https://www.cnbc.com/2025/09/30/oil-gas-layoff-job-cut-opec-trump-wti.html",
    "timestamp": "2025-09-30T18:36:18Z"
  },
  {
    "title": "The spitting image",
    "description": "Here’s CNN’s lede about Donald Trump telling his Secretary of Defense to wage war on American cities as a form of military training: President Donald Trump appeared to suggest in his remarks today that the Department of Defense should use “dangerous cities as…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/the-spitting-image",
    "timestamp": "2025-09-30T18:36:09Z"
  },
  {
    "title": "The Clock Is Ticking on a Lose-Lose Government Shutdown",
    "description": "“Democrats have been resolute that we need a real negotiation,” Chuck Schumer tells VF.",
    "link": "https://www.vanityfair.com/news/story/the-clock-is-ticking-on-a-lose-lose-government-shutdown",
    "timestamp": "2025-09-30T18:33:38Z"
  },
  {
    "title": "Journalist taken to the hospital after shove by officer outside immigration court in NYC",
    "description": "The journalist with Turkey-based Anadolu Agency was placed in a neck brace and transported to a local hospital following a physical confrontation with a federal officer, on the 12th floor of 26 Federal Plaza.\n \n\nThe journalist, who works with a Turkish news a…",
    "link": "https://gothamist.com/news/journalist-taken-to-the-hospital-after-clash-with-officer-outside-immigration-court-in-ny",
    "timestamp": "2025-09-30T18:33:00Z"
  },
  {
    "title": "Why are beef prices rising? And how is politics involved?",
    "description": "“Where’s the beef?” was a popular catchphrase in the 1980s. These days it might be replaced with a new question: “How much does the beef cost?” Hamburger prices are rising, and there could be political fallout for President Donald Trump.\n“Record high beef pri…",
    "link": "https://biztoc.com/x/52a865437028d180",
    "timestamp": "2025-09-30T18:32:19Z"
  },
  {
    "title": "Pfizer agrees to lower prescription drug costs for Medicaid in a deal with Trump",
    "description": "Drugmaker Pfizer has agreed to lower drug costs under a deal struck with President Donald Trump's administration",
    "link": "https://biztoc.com/x/36ced0e24f8b9888",
    "timestamp": "2025-09-30T18:32:17Z"
  },
  {
    "title": "Pfizer Becomes First Drugmaker To Join Trump's Price Cut Push",
    "description": "On Tuesday, Pfizer Inc. (NYSE:PFE) announced a historic agreement with the Trump Administration to ensure U.S. patients pay lower prices for their prescription medicines.\nPresident Donald J. Trump announced the first agreement with a major pharmaceutical comp…",
    "link": "https://biztoc.com/x/bc3f751f3befa622",
    "timestamp": "2025-09-30T18:32:07Z"
  },
  {
    "title": "Bad Bunny brings Puerto Rico to the world, from his landmark residency to the Super Bowl",
    "description": "Bad Bunny captivated audiences with his residency in Puerto Rico, inspiring patriotism and drawing half a million people to the island this summer",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bad-bunny-brings-puerto-rico-world-landmark-residency-126075374",
    "timestamp": "2025-09-30T18:30:29Z"
  },
  {
    "title": "The Dangerous Toddler Needs to be Reined In",
    "description": "Apparently spell check doesn’t know when to use reigned in vs. reined in. It keeps telling me I have misspelled that word, which I don’t believe I have, unless everything I know is wrong. Breaking: President declares war on his own country. Things are getting…",
    "link": "https://balloon-juice.com/2025/09/30/the-dangerous-toddler-needs-to-be-reined-in/",
    "timestamp": "2025-09-30T18:30:15Z"
  },
  {
    "title": "MAGAfied: Ron DeSantis and cabinet members approve Miami site for Trump library",
    "description": "Florida’s top state officials, including Gov. Ron DeSantis, approved conveying a parking lot next to Miami’s Freedom Tower for a Donald Trump presidential library. As board members of the state’s Internal Improvement Trust Fund, DeSantis, Attorney General Jam…",
    "link": "https://therealdeal.com/miami/2025/09/30/state-officials-approve-miami-site-for-trump-library/",
    "timestamp": "2025-09-30T18:30:00Z"
  },
  {
    "title": "Trump warns of ‘very sad end’ if Hamas does not accept Gaza peace plan",
    "description": "Arab and Muslim countries welcome 20-point plan to end conflict, with Hamas given `three or four days’ to respond",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/30/trump-warns-of-very-sad-end-if-hamas-does-not-accept-gaza-peace-plan/",
    "timestamp": "2025-09-30T18:25:01Z"
  },
  {
    "title": "Government Shutdown Imminent As Lawmakers Bicker, Trump Posts AI Slop",
    "description": "There’s no telling how long this shutdown will last.",
    "link": "https://www.huffpost.com/entry/government-shutdown-trump-democrats_n_68dc15f4e4b0d2dd31582c20",
    "timestamp": "2025-09-30T18:25:00Z"
  },
  {
    "title": "ADB projects India growth at 6.5% for two fiscal years",
    "description": "The ADB forecasts India's economic growth at 6.5% for FY26 and FY27, a cut from previous estimates due to high US tariffs on Indian goods. While tariffs will impede growth, strong domestic demand and service exports are expected to cushion the impact, maintai…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/adb-projects-india-growth-at-6-5-for-two-fiscal-years/articleshow/124242297.cms",
    "timestamp": "2025-09-30T18:23:55Z"
  },
  {
    "title": "As Hamas and Islamic Jihad decry Trump plan, many Gazans say 'anything is better than bloodshed'",
    "description": "Donald Trump's new cease-fire plan for Gaza was cautiously embraced by the Palestinian Authority, while Hamas and Islamic Jihad say the deal favors Israel. Palestinians who are living through Israel's brutal war in Gaza say they welcome 'any deal that will en…",
    "link": "https://www.haaretz.com/middle-east-news/palestinians/2025-09-30/ty-article/.premium/as-hamas-islamic-jihad-decry-trump-plan-gazans-say-anything-is-better-than-bloodshed/00000199-9b28-df33-a5dd-9f7f1f530000",
    "timestamp": "2025-09-30T18:23:36Z"
  },
  {
    "title": "Mushroom murders, riotous mockumentary and a surveillance thriller: what to watch in October",
    "description": "As the air begins to warm and the days stretch, the screens get darker — with crime, mystery and noir creeping in.",
    "link": "https://theconversation.com/mushroom-murders-riotous-mockumentary-and-a-surveillance-thriller-what-to-watch-in-october-265987",
    "timestamp": "2025-09-30T18:22:50Z"
  },
  {
    "title": "Can Trump’s plan end the war in Gaza?",
    "description": "US president says Hamas has 'three or four days' to respond to his Gaza ceasefire proposal.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/9/30/can-trumps-plan-end-the-war-in-gaza",
    "timestamp": "2025-09-30T18:22:34Z"
  },
  {
    "title": "Pfizer agrees to lower prescription drug costs for Medicaid in a deal with Trump",
    "description": "Drugmaker Pfizer has agreed to lower drug costs under a deal struck with President Donald Trump's administration",
    "link": "https://abcnews.go.com/Business/wireStory/pfizer-agrees-lower-prescription-drug-costs-medicaid-deal-126087410",
    "timestamp": "2025-09-30T18:22:30Z"
  },
  {
    "title": "“We Can Do Things Medically”: Trump Threatens Dems Ahead of Shutdown",
    "description": "President Donald Trump threatened Tuesday to illegally revoke Americans’ health care benefits if Democrats in Congress don’t agree to do it themselves. Speaking in the Oval Office, Trump floated pulling the plug on certain programs if Democratic lawmakers did…",
    "link": "https://newrepublic.com/post/201136/donald-trump-threatens-cut-medical-benefits-shutdown",
    "timestamp": "2025-09-30T18:21:47Z"
  },
  {
    "title": "Trump: Gov't Shutdown 'Likely' Because Dems Want Free Health Care for Illegals",
    "description": "President Trump says it is \"probably likely\" that the federal government will be shut down, blaming Democrats for offering a nonnegotiable plan.",
    "link": "https://www.breitbart.com/politics/2025/09/30/president-trump-govt-shutdown-likely-because-democrats-want-give-free-health-care-illegal-aliens/",
    "timestamp": "2025-09-30T18:21:02Z"
  },
  {
    "title": "White House attacks Ariana Grande after she shares criticism of Trump’s policies",
    "description": "After sharing a post on her Instagram story criticizing the Trump administration over its immigration policy, anti-trans agenda and censorship, the White House is hitting back at pop star and actor Ariana Grande.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-white-house-ariana-grande-songs-immigration-post-rcna234734",
    "timestamp": "2025-09-30T18:20:19Z"
  },
  {
    "title": "JUST IN: Trump Admin Absolutely Scorched By Reagan-Appointed Judge Over ‘Chilling’ Free Speech Crackdown",
    "description": "A federal judge issued a scathing rebuke to President Donald Trump's crackdown on pro-Palestinian student protesters, finding that his administration had illegally targeted immigrant students for deportation in order to \"strike fear\" into protesters exercisin…",
    "link": "https://www.mediaite.com/politics/just-in-trump-admin-absolutely-scorched-by-reagan-appointed-judge-over-chilling-free-speech-crackdown/",
    "timestamp": "2025-09-30T18:16:37Z"
  },
  {
    "title": "Jesse Watters Defends 'Toxic Masculinity' — And Has Notes For His Own Liberal Parents",
    "description": "Two Fox personalities discussed \"toxic masculinity\" before attacking Bad Bunny, who's slated to headline the Super Bowl halftime show.",
    "link": "https://www.huffpost.com/entry/jesse-watter-jimmy-fallia-bad-bunny-masculinity_n_68dbff53e4b003b6c8dc3902",
    "timestamp": "2025-09-30T18:16:30Z"
  },
  {
    "title": "Federal judge criticizes Trump over free speech in ruling for student protesters",
    "description": "A judge criticized the Trump administration's crackdown on free speech as he ruled in favor of foreign students targeted for deportation over support of Palestinian rights.",
    "link": "https://www.nbcnews.com/politics/trump-administration/federal-judge-criticizes-trump-free-speech-ruling-student-protesters-rcna234744",
    "timestamp": "2025-09-30T18:16:10Z"
  },
  {
    "title": "So Your Employer Has Two CEOs. Are Two Heads Better Than One?",
    "description": "Plus, the origin story of TikTok's algorithm, the top green jobs in STEM and we mark the largest civil servant exodus in 80 years in this week's Careers newsletter.",
    "link": "https://www.forbes.com/sites/mariagraciasantillanalinares/2025/09/30/so-you-have-two-ceos-now-what/",
    "timestamp": "2025-09-30T18:15:47Z"
  },
  {
    "title": "The president told an unprecedented meeting of military generals that America was facing an “invasion from within.”",
    "description": "Donald Trump has told top generals that dangerous U.S. cities should be used as military training grounds as he railed against some of his enemies being...",
    "link": "https://www.thedailybeast.com/trumps-sinister-threat-to-take-out-enemies-in-us-cities/",
    "timestamp": "2025-09-30T18:15:28Z"
  },
  {
    "title": "Estonia PM Says Russia Incursions Aim To Distract EU From Ukraine: AFP Interview",
    "description": "Estonia's Prime Minister Kristen Michal warned Tuesday that Russia's recent air incursions were an attempt to distract Europe from helping Ukraine, ahead of a summit with EU leaders.",
    "link": "https://www.ibtimes.com/estonia-pm-says-russia-incursions-aim-distract-eu-ukraine-afp-interview-3784852",
    "timestamp": "2025-09-30T18:15:13Z"
  },
  {
    "title": "Trump’s proposed child vaccine schedule could hurt working moms the most",
    "description": "“Intentionally or not, Trump is adding weight to this burden that women are already carrying as family health managers.\"",
    "link": "https://19thnews.org/2025/09/childhood-vaccine-schedule-trump-working-moms/",
    "timestamp": "2025-09-30T18:14:10Z"
  },
  {
    "title": "Fatah officially welcomes Trump's Gaza peace plan",
    "description": "Mahmoud Abbas's party says it welcomes the 21-point peace plan unveiled by President Trump, calls for action to prevent Israel from continuing to offset 'pay for slay' payments.",
    "link": "https://www.israelnationalnews.com/news/415644",
    "timestamp": "2025-09-30T18:13:35Z"
  },
  {
    "title": "Starting Today, Electric Vehicle Buyers No Longer Get a Federal Tax Credit",
    "description": "Governments should let consumers decide whether to switch to electric vehicles without giving them taxpayer money to do so.",
    "link": "https://reason.com/2025/10/01/starting-today-electric-vehicle-buyers-no-longer-get-a-federal-tax-credit/",
    "timestamp": "2025-09-30T18:13:13Z"
  },
  {
    "title": "Pope Leo XIV didn't say Trump 'chose the road of darkness, bitterness and lies'",
    "description": "Pope Leo XIV once said, \"Trump is not a savior; he is a mirror-reflecting your hatred, anger, and fear. He could have walked the path of light and hope, but instead he chose the road of darkness, bitterness, and lies. His words mislead, his attacks divide, an…",
    "link": "https://www.snopes.com//fact-check/trump-pope-leo-mirror-quote/",
    "timestamp": "2025-09-30T18:12:00Z"
  },
  {
    "title": "Bondi Issues Memo Establishing Task Force to “Protect” ICE From Protesters",
    "description": "The memo directs the US Attorney's Office to “prosecute any individual” who “impedes or intimidates” ICE officers.",
    "link": "https://truthout.org/articles/bondi-issues-memo-establishing-task-force-to-protect-ice-from-protesters/",
    "timestamp": "2025-09-30T18:11:55Z"
  },
  {
    "title": "Groups press for release of special counsel report on Trump’s classified documents case",
    "description": "A First Amendment group is pressing a federal appeals court to release a special counsel report on the criminal investigation into President Trump’s handling of classified documents at his Mar-a-Lago estate.",
    "link": "https://www.pbs.org/newshour/politics/groups-press-for-release-of-special-counsel-report-on-trumps-classified-documents-case",
    "timestamp": "2025-09-30T18:11:47Z"
  },
  {
    "title": "Retired General Blasts Trump, Hegseth’s ‘Insulting,’ ‘Offensive’ Remarks To Military",
    "description": "Former Lt. Gen. Mark Hertling called the gathering “somewhat shocking” and “filled with mistruths,” and suspected “it’s not being taken well” by the troops.",
    "link": "https://www.huffpost.com/entry/hertling-condemns-trump-hegseth-military-comments_n_68dc036de4b003b6c8dc3fce",
    "timestamp": "2025-09-30T18:11:17Z"
  },
  {
    "title": "Pfizer agrees to lower prescription drug costs for Medicaid in a deal with Trump",
    "description": "Pfizer agreed to lower drug costs and invest $70 billion in U.S. manufacturing following a deal with the Trump administration. The drugmaker will implement \"most-favored-nation\" pricing for Medicaid and new drugs, matching international low prices. This move …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pfizer-agrees-to-lower-prescription-drug-costs-for-medicaid-in-a-deal-with-trump/articleshow/124242014.cms",
    "timestamp": "2025-09-30T18:10:56Z"
  },
  {
    "title": "Should Democrats shut down the government? New poll reveals what voters think",
    "description": "The poll comes as Congress races to avoid a possible shutdown by the end of the day on Sept. 30.",
    "link": "https://www.nj.com/politics/2025/09/should-democrats-shut-down-the-government-new-poll-reveals-what-voters-think.html",
    "timestamp": "2025-09-30T18:10:47Z"
  },
  {
    "title": "Trump on Government Shutdown: Nothing Inevitable, But It Is Probably Likely",
    "description": "WASHINGTON (Sputnik) - The shutdown of the United States government is not \"inevitable\" but is still likely to happen, US President Donald Trump said on Tuesday.",
    "link": "https://sputnikglobe.com/20250930/trump-on-government-shutdown-nothing-inevitable-but-it-is-probably-likely-1122891428.html",
    "timestamp": "2025-09-30T18:10:31Z"
  },
  {
    "title": "From drones to police presence, Utah campus where Kirk was shot lacked key public safety tools",
    "description": "A drone was not deployed to rooftops and the police force was not big enough.",
    "link": "https://www.bostonherald.com/2025/09/30/charlie-kirk-shot-campus-security/",
    "timestamp": "2025-09-30T18:10:28Z"
  },
  {
    "title": "Pfizer agrees to offer discounted drugs through new federal website, Trump announces",
    "description": "President also said that company would provide medications to Medicaid at ‘most favored nation’ pricing\nUS politics – latest updates\nDonald Trump announced on Tuesday that Pfizer, the prescription drug manufacturer, has agreed to offer medications at “heavily…",
    "link": "https://biztoc.com/x/32658d3ca20e2368",
    "timestamp": "2025-09-30T18:10:20Z"
  },
  {
    "title": "Hegseth blasts ‘fat troops’ in rare gathering with military brass",
    "description": "Before hundreds of top brass, Hegseth pledged to create more fitness and grooming rules and encouraged commanders to quit if they don’t like his policies.",
    "link": "https://www.yahoo.com/news/articles/hegseth-blasts-fat-troops-rare-181015767.html",
    "timestamp": "2025-09-30T18:10:15Z"
  },
  {
    "title": "Trump threatened mass firings under a shutdown — but he already made them a reality",
    "description": "As a government shutdown nears, President Donald Trump and the Office of Management and Budget have threatened mass firings of federal workers.",
    "link": "https://biztoc.com/x/5ac2e3379abe19d9",
    "timestamp": "2025-09-30T18:09:56Z"
  },
  {
    "title": "Trump announces Pfizer deal to reduce drug prices",
    "description": "US President Donald Trump announced a deal with Pfizer Tuesday that would lower drug prices for Medicaid patients, and sell some of its drugs at discounted prices on a new direct-to-consumer government website.\nThe deal is the first one signed under Trump’s p…",
    "link": "https://biztoc.com/x/2c291b7760181c97",
    "timestamp": "2025-09-30T18:09:47Z"
  },
  {
    "title": "Trump Draws Laughs When RFK Coughs On Him At Oval Office Event: ‘Hope I Didn’t Just Catch Covid!’",
    "description": "President Donald Trump drew laughs in the Oval Office when RFK Jr. coughed on him and Trump quipped \"I hope I didn't catch Covid just there!\"\nThe post Trump Draws Laughs When RFK Coughs On Him At Oval Office Event: ‘Hope I Didn’t Just Catch Covid!’ first appe…",
    "link": "https://www.mediaite.com/media/news/trump-draws-laughs-when-rfk-coughs-on-him-at-oval-office-event-hope-i-didnt-just-catch-covid/",
    "timestamp": "2025-09-30T18:09:12Z"
  },
  {
    "title": "Trump to Generals: 'We Are Reawakening the Warrior Spirit'",
    "description": "President Donald Trump told military leaders at Marine Corps Base Quantico in Quantico, Virginia, on Tuesday that his administration is reinvigorating \"the warrior spirit\" in the United States military.\nThe post Trump to Generals: ‘We Are Reawakening the Warr…",
    "link": "https://www.breitbart.com/politics/2025/09/30/trump-to-generals-we-are-reawakening-the-warrior-spirit/",
    "timestamp": "2025-09-30T18:08:46Z"
  }
]