[
  {
    "title": "President Sheinbaum Says No Way To US Strikes On Cartels In Mexico",
    "description": "President Sheinbaum Says No Way To US Strikes On Cartels In Mexico\n \nMexican President Claudia Sheinbaum has again sought to stand up to President Donald Trump, on Tuesday repeating her rejection of any possibility of US military intervention against cartels …",
    "link": "https://biztoc.com/x/d59d1f3e6bce30a9",
    "timestamp": "2025-11-20T00:48:01Z"
  },
  {
    "title": "Trump’s ‘quiet piggy’ outburst and intensified media bashing",
    "description": "Donald Trump has made animus toward the mainstream press part of his populist brand since he first ran for office. But over the past week, Trump’s threats toward the media and criticism of reporters have grown darker, cruder and more frequent, chipping furthe…",
    "link": "https://biztoc.com/x/f250fc6a499e81ec",
    "timestamp": "2025-11-20T00:47:47Z"
  },
  {
    "title": "What's next once Trump signs bill releasing the Epstein files",
    "description": "Congress has passed a bill that will force the Justice Department to release its case files on Jeffrey Epstein. President Trump has indicated he will sign the bill. This development comes after years of calls from survivors for transparency. The Justice Depar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whats-next-once-trump-signs-bill-releasing-the-epstein-files/articleshow/125450600.cms",
    "timestamp": "2025-11-20T00:47:27Z"
  },
  {
    "title": "Trump administration makes major changes to a report it commissioned on FEMA reforms, AP sources say",
    "description": "A draft of a much-anticipated report on reforms to the Federal Emergency Management Agency has been whittled down in size, with recommendations compiled by a council appointed by the president slashed and amended by Homeland Security Secretary Kristi Noem's o…",
    "link": "https://japantoday.com/category/world/trump-administration-makes-major-changes-to-a-report-it-commissioned-on-fema-reforms-ap-sources-say",
    "timestamp": "2025-11-20T00:44:31Z"
  },
  {
    "title": "Nicolle Wallace Slams Pam Bondi’s ‘Maximum Transparency’ Promise for Epstein Files: ‘The Public Isn’t Buying It’ | Video",
    "description": "\"Her comments today, though, are part of a pattern by Team Trump that suggests anything but maximum transparency,\" the MS NOW host says\nThe post Nicolle Wallace Slams Pam Bondi’s ‘Maximum Transparency’ Promise for Epstein Files: ‘The Public Isn’t Buying It’ |…",
    "link": "https://www.thewrap.com/nicolle-wallace-pam-bondi-epstein-files-reaction/",
    "timestamp": "2025-11-20T00:44:20Z"
  },
  {
    "title": "Release of Epstein files",
    "description": "Trump’s about-turn adds new twist to drama",
    "link": "https://www.thehindubusinessline.com/opinion/release-of-epstein-files/article70300045.ece",
    "timestamp": "2025-11-20T00:40:00Z"
  },
  {
    "title": "White House Lashes Out at ABC News: ‘Democrat Spin Operation Masquerading as a Broadcast Network’",
    "description": "President Donald Trump's White House lashed out at ABC News accusing the organization of being \"a Democrat spin operation masquerading as a broadcast network.\"\nThe post White House Lashes Out at ABC News: ‘Democrat Spin Operation Masquerading as a Broadcast N…",
    "link": "https://www.mediaite.com/media/tv/white-house-lashes-out-at-abc-news-democrat-spin-operation-masquerading-as-a-broadcast-network/",
    "timestamp": "2025-11-20T00:31:04Z"
  },
  {
    "title": "Pakistan’s Munir on a power consolidation trip",
    "description": "Apart from a fresh 5-year term and command of the air force and navy as well, he has got himself lifetime immunity from prosecution and has virtually side-tracked the Supreme Court",
    "link": "https://www.thehindubusinessline.com/opinion/pakistans-munir-on-a-power-consolidation-trip/article70299966.ece",
    "timestamp": "2025-11-20T00:30:00Z"
  },
  {
    "title": "EXCLUSIVE: Exposed — King Charles and Donald Trump's 'Dirty Double Deal' Over Jeffrey Epstein Scandal",
    "description": "King Charles and Donald Trump's double deal over the Epstein scandal has been revealed, according to insiders.",
    "link": "https://radaronline.com/p/king-charles-donald-trump-dirty-deal-epstein-scandal/",
    "timestamp": "2025-11-20T00:30:00Z"
  },
  {
    "title": "“Heard there are no files”: Rogan mocks Trump for changing his story on Epstein",
    "description": "The podcaster prodded the president, who previously called the Epstein files scandal \"a hoax.\"",
    "link": "https://www.salon.com/2025/11/19/heard-there-are-no-files-rogan-mocks-trump-for-changing-his-story-on-epstein/",
    "timestamp": "2025-11-20T00:28:43Z"
  },
  {
    "title": "Trump announces US making new effort to end war in Sudan, citing MBS request",
    "description": "Trump announces US making new effort to end war in Sudan, citing MBS requestgo.com",
    "link": "https://abcnews.go.com/Politics/trump-announces-us-making-new-effort-end-war/story?id=127683382",
    "timestamp": "2025-11-20T00:25:30Z"
  },
  {
    "title": "Democratic senator accuses Trump of playing politics with aviation safety during shutdown",
    "description": "More than 6 million travelers were affected by delays and cancellations.",
    "link": "https://www.bostonherald.com/2025/11/19/government-shutdown-aviation-politics/",
    "timestamp": "2025-11-20T00:25:12Z"
  },
  {
    "title": "Nvidia's profit jumps 65% to $31.9 billion. Is it enough for Wall Street?",
    "description": "On Wednesday, Nvidia provided a reminder of just how much the world craves those chips. The company said that in its most recent quarter, its profit was $31.9 billion, up 65% from a year ago and 245% from the year before that. Among the tech industry's giants…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nvidias-profit-jumps-65-to-31-9-billion-is-it-enough-for-wall-street/articleshow/125450489.cms",
    "timestamp": "2025-11-20T00:24:58Z"
  },
  {
    "title": "The Education Department is being dismantled. Here’s what that means",
    "description": "WASHINGTON (AP) — The Education Department is breaking off several of its main offices and giving their responsibilities to other federal agencies, an early look at how President Donald Trump could fulfill his campaign pledge to close the department entirely.…",
    "link": "https://freerepublic.com/focus/f-chat/4353480/posts",
    "timestamp": "2025-11-20T00:22:36Z"
  },
  {
    "title": "A mad House: Members of Congress trade censures and curse words",
    "description": "During the House’s long 54-day shutdown recess, lawmakers in both parties begged Speaker Mike Johnson to call them back into session.",
    "link": "https://www.nbcnews.com/politics/congress/mad-house-members-congress-trade-censures-curse-words-rcna244829",
    "timestamp": "2025-11-20T00:22:25Z"
  },
  {
    "title": "Was Jan. 6 rioter Andrew Paul Johnson arrested on child molestation charges after being pardoned by Trump?",
    "description": "Andrew Paul Johnson, a participant in the Jan. 6, 2021, riot at the U.S. Capitol who was pardoned by President Donald Trump, was arrested on child molestation charges.",
    "link": "https://www.snopes.com//fact-check/andrew-paul-johnson-trump-pardon-arrest/",
    "timestamp": "2025-11-20T00:22:00Z"
  },
  {
    "title": "5 accused of supporting antifa plead guilty to terrorism-related offense after Texas shooting",
    "description": "Five people have pleaded guilty to a terrorism-related charge after they were accused of supporting antifa in a July shooting that wounded a police officer outside a Texas immigration detention center",
    "link": "https://abcnews.go.com/US/wireStory/5-accused-supporting-antifa-plead-guilty-terrorism-related-127689099",
    "timestamp": "2025-11-20T00:21:31Z"
  },
  {
    "title": "Minister Gila Gamliel to Arutz Sheva: The Saudis may pressure, but no Palestinian state",
    "description": "Minister Gila Gamliel in an interview with Arutz Sheva-Israel National News: Expanding the Abraham Accords is welcome. We must leverage President Trump’s strengthened ties with the Arab world to combat antisemitism in the US.",
    "link": "https://www.israelnationalnews.com/news/418060",
    "timestamp": "2025-11-20T00:21:13Z"
  },
  {
    "title": "The White House sends out a press release calling ABC News \"a Democrat spin operation masquerading as a broadcast network\" and cataloging perceived offenses (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nThe White House sends out a press release calling ABC News “a Democrat spin operation masquerading as a broadcast network” and cataloging perceived offenses  —  A day after President Donald Trump blew up at ABC News correspondent Mary …",
    "link": "https://mediagazer.com/251119/p21",
    "timestamp": "2025-11-20T00:20:00Z"
  },
  {
    "title": "5 plead guilty to terrorism-related charges tied to antifa after Texas shooting",
    "description": "Five people pleaded guilty Wednesday to terrorism-related charges after they were accused of supporting antifa in a July shooting that wounded a police officer outside a Texas immigration detention center.",
    "link": "https://www.pbs.org/newshour/nation/5-plead-guilty-to-terrorism-related-charges-tied-to-antifa-after-texas-shooting",
    "timestamp": "2025-11-20T00:15:21Z"
  },
  {
    "title": "Dissenting judge slams colleagues for blocking Texas congressional map",
    "description": "WASHINGTON, Nov 19 (Reuters) - A U.S. judge issued an unusual dissenting opinion on Wednesday lambasting an earlier ruling that blocked Texas Republicans from using a new congressional map, saying he had been cut out of the decision-making process by two othe…",
    "link": "https://freerepublic.com/focus/f-news/4353479/posts",
    "timestamp": "2025-11-20T00:15:20Z"
  },
  {
    "title": "Trump Says $270 Billion in Deals Being Signed at US-Saudi Forum",
    "description": "President Donald Trump said $270 billion in deals are being signed at a US-Saudi Investment Forum.\nTrump announced that GE Aerospace would \"deliver dozens of new engines\" as part of the deals being signed. The crown prince pledged to increase Saudi investment…",
    "link": "https://biztoc.com/x/1387c810f7d0a613",
    "timestamp": "2025-11-20T00:13:59Z"
  },
  {
    "title": "5 accused of supporting antifa plead guilty to terrorism-related offense after Texas shooting",
    "description": "They face up to 15 years in prison at sentencing.",
    "link": "https://www.bostonherald.com/2025/11/19/immigration-detention-center-shooting/",
    "timestamp": "2025-11-20T00:13:10Z"
  },
  {
    "title": "Trump administration drafts an executive order regulating state AI laws",
    "description": "The Trump administration has drafted an executive order that would challenge individual states' ability to enact regulations governing artificial intelligence, according to a person familiar with the matter.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-executive-order-regulating-state-ai-laws-rcna244890",
    "timestamp": "2025-11-20T00:09:09Z"
  },
  {
    "title": "At COP30 in Brazil, countries plan to armor themselves against a warming world",
    "description": "In the eyes of many developing country leaders, the success of COP30 hinges on the billions of dollars they need to prepare for climate disasters.",
    "link": "https://grist.org/international/cop30-brazil-adaptation-finance/",
    "timestamp": "2025-11-20T00:07:43Z"
  },
  {
    "title": "At COP30 in Brazil, countries plan to armor themselves against a warming world",
    "description": "In the eyes of many leaders of developing countries, the success of COP30 hinges on the billions of dollars they need to prepare for climate disasters.",
    "link": "https://grist.org/cop30/cop30-brazil-adaptation-finance/",
    "timestamp": "2025-11-20T00:07:43Z"
  },
  {
    "title": "Best Black Friday Deals Under $25: Massive Discounts from Roku, JBL, KitchenAid and More",
    "description": "Don't wait to shop these Black Friday offers on items $25 or under, perfect for stocking stuffers and holiday gifts, too.",
    "link": "https://www.cnet.com/deals/best-black-friday-deals-under-25/",
    "timestamp": "2025-11-20T00:00:32Z"
  },
  {
    "title": "A Historic G-20—Without the United States",
    "description": "South Africa gets ready to host the bloc’s first summit in Africa.",
    "link": "http://foreignpolicy.com/2025/11/19/south-africa-g20-summit-us-trump-boycott-clean-energy/",
    "timestamp": "2025-11-20T00:00:28Z"
  },
  {
    "title": "Trade Deficits Aren’t a Problem",
    "description": "There’s no reason to have a zero trade balance with any country, or with the world.",
    "link": "https://www.hoover.org/research/trade-deficits-arent-problem",
    "timestamp": "2025-11-20T00:00:00Z"
  },
  {
    "title": "Gutfeld exposes Epstein revelations that flip narrative and leave Democrats reeling",
    "description": "... Read more",
    "link": "https://www.wnd.com/2025/11/gutfeld-exposes-epstein-revelations-that-flip-narrative-leave/",
    "timestamp": "2025-11-19T23:57:03Z"
  },
  {
    "title": "U.S. trade deficit dropped nearly 24% in August as Trump’s tariffs reduce imports",
    "description": "In a report delayed for more than seven weeks by the federal government shutdown, the Commerce Department said Wednesday that the the gap between what the United States buys from other countries and what it sells them fell to $59.6 billion in August, from $78…",
    "link": "https://www.pbs.org/newshour/economy/u-s-trade-deficit-dropped-nearly-24-in-august-as-trumps-tariffs-reduce-imports",
    "timestamp": "2025-11-19T23:54:32Z"
  },
  {
    "title": "'SOMETHING HAPPENED': New revelations emerge on Trump shooter",
    "description": "Fox News national correspondent Alexis McAdams reports on the Butler shooting case as former Deputy Asst. Attorney General John Yoo reacts to a new report on Thomas Crooks’ online activity. (Transcribed by TurboScribe.ai. Go Unlimited to remove this message.)…",
    "link": "https://freerepublic.com/focus/f-news/4353472/posts",
    "timestamp": "2025-11-19T23:54:31Z"
  },
  {
    "title": "Trump says he’d ‘love to fire’ Powell, renewing attacks on Fed chair - The Washington Post",
    "description": "Trump says he’d ‘love to fire’ Powell, renewing attacks on Fed chairThe Washington Post Trump teases he’ll fire Bessent if Fed doesn’t cut interest ratesCNN Trump says he'd love to fire Powell, urges Bessent to 'work on' him to lower ratesCNBC Trump: ‘People …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180148257",
    "timestamp": "2025-11-19T23:53:19Z"
  },
  {
    "title": "‘The Last Republican’ Doc Subject Adam Kinzinger Talks Trump, Epstein and the Demise of the GOP",
    "description": "When Steve Pink’s “The Last Republican” debuted at 2024 Toronto International Film Festival, audiences and critics alike embraced the documentary about former U.S. Republican Congressman Adam Kinzinger. Kinzinger, a Republican, voted in favor of impeaching Do…",
    "link": "https://variety.com/2025/film/news/last-republican-adam-kinzinger-trump-epstein-1236585191/",
    "timestamp": "2025-11-19T23:51:40Z"
  },
  {
    "title": "Senate Candidate Punched in the Face During Anti-Islam Demonstration in Dearborn, Michigan",
    "description": "A man running for the U.S. Senate was hit in the face while marching in an anti-Islam protest in one of America's most Muslim communities.",
    "link": "https://www.westernjournal.com/senate-candidate-punched-face-anti-islam-demonstration-dearborn-michigan/",
    "timestamp": "2025-11-19T23:51:27Z"
  },
  {
    "title": "Trump says allowing skilled immigrants to train US workers ‘is MAGA’",
    "description": "Trump sparked outcry among some MAGA supporters with similar comments last week.",
    "link": "https://www.bostonherald.com/2025/11/19/trump-skilled-immigrants-maga/",
    "timestamp": "2025-11-19T23:48:19Z"
  },
  {
    "title": "Another lawmaker faces swatting attack as Trump unloads on defiant red state GOP",
    "description": "For the second time in a week, a Republican state senator in Indiana was the victim of a swatting attack, as President Donald Trump threatens war on lawmakers in the state who defied his orders to re-gerrymander the congressional districts.\"State Sen. Dan Der…",
    "link": "https://www.rawstory.com/indiana-gop/",
    "timestamp": "2025-11-19T23:48:02Z"
  },
  {
    "title": "How Ro Khanna is looking to build on his Epstein files victory: From the Politics Desk",
    "description": "Rep. Ro Khanna is trying to build on the passage of the Epstein files bill as the California Democrat eyes on a possible 2028 presidential run.",
    "link": "https://www.nbcnews.com/politics/politics-news/ro-khanna-looking-build-epstein-files-victory-politics-desk-rcna244877",
    "timestamp": "2025-11-19T23:47:01Z"
  },
  {
    "title": "US citizen jailed in Saudi Arabia for criticising regime allowed to return to US",
    "description": "Saad Ibrahim Almadi was not allowed to leave Saudi Arabia despite being released from prison in Riyadh.",
    "link": "https://www.bbc.com/news/articles/c62e2z4vn50o",
    "timestamp": "2025-11-19T23:46:45Z"
  },
  {
    "title": "Joe Exotic Hopes for Pardon After Retaining Attorney Connected to Trump",
    "description": "\"Tiger King\" star Joe Exotic has retained a lawyer with ties to President Donald Trump ... and now he is hopeful for a pardon, TMZ has learned. As you know ... Joe is currently locked up in federal prison in Texas, serving a 21-year prison sentence…\n Permalink",
    "link": "https://www.tmz.com/2025/11/19/joe-exotic-hoping-pardon-hired-trump-connected-attorney/",
    "timestamp": "2025-11-19T23:45:50Z"
  },
  {
    "title": "Trump wants Germany to take over Nato",
    "description": "Germany should take over the historically American role of Nato Europe commander, Donald Trump’s envoy to the Western alliance has suggested. Matthew Whitaker, the US ambassador to Nato, said he hoped Germany would one day volunteer for the prestigious role o…",
    "link": "https://freerepublic.com/focus/f-news/4353470/posts",
    "timestamp": "2025-11-19T23:45:31Z"
  },
  {
    "title": "A draft EO shows President Trump plans to grant the federal government sole power to regulate AI and create an \"AI Litigation Task Force\" overseen by the AG (Tina Nguyen/The Verge)",
    "description": "Tina Nguyen / The Verge:\nA draft EO shows President Trump plans to grant the federal government sole power to regulate AI and create an “AI Litigation Task Force” overseen by the AG  —  Trump is launching an all-out broadside against states with strict AI reg…",
    "link": "https://www.techmeme.com/251119/p55",
    "timestamp": "2025-11-19T23:45:01Z"
  },
  {
    "title": "Even liberal scientists agree — it’s time to stop the madness of medical intervention for gender-confused kids",
    "description": "A peer-reviewed study, commissioned by the Department of Health And Human Services, reports that evidence used to back such practices as hormone therapy for kids is flimsy at best.",
    "link": "https://nypost.com/2025/11/19/opinion/stop-the-madness-of-medical-intervention-for-gender-confused-kids/",
    "timestamp": "2025-11-19T23:38:05Z"
  },
  {
    "title": "Trump Resurrects One Of His Most Dubious Popularity Claims At Kennedy Center",
    "description": "The president said Wednesday that pollsters told him in 2020 that he'd easily beat America's two most famous historical leaders in an election.",
    "link": "https://www.huffpost.com/entry/trump-more-popular-than-washington-claim_n_691e3dbfe4b06f2a60cb8b29",
    "timestamp": "2025-11-19T23:32:11Z"
  },
  {
    "title": "‘Call for Rebellion’: Stephen Miller Scorches Dems for Pushing ‘Insurrection’ Against Trump’s Military Orders",
    "description": "Stephen Miller went off on Democratic lawmakers who called for military members to \"refuse illegal orders\" from President Trump, fuming it was \"insurrection\"\nThe post ‘Call for Rebellion’: Stephen Miller Scorches Dems for Pushing ‘Insurrection’ Against Trump’…",
    "link": "https://www.mediaite.com/politics/call-for-rebellion-stephen-miller-scorches-dems-for-pushing-insurrection-against-trumps-military-orders/",
    "timestamp": "2025-11-19T23:32:08Z"
  },
  {
    "title": "'I want to fight these mothers': Conservative George Conway vows to hound Trump if elected",
    "description": "Conservative attorney George Conway is reportedly close to officially announcing his intent to run for the U.S. House of Representatives in 2026, and is promising to be a major thorn in President Donald Trump's side if elected.The New York Times reported Wedn…",
    "link": "https://www.rawstory.com/alternet-posts/george-conway-fight-trump/",
    "timestamp": "2025-11-19T23:30:40Z"
  },
  {
    "title": "How to Actually Solve the Affordability Crisis",
    "description": "There are very few things that Americans agree on these days. After all, this is a massive country full of hundreds of millions of people in different stages of life, subscribing to many different political ideologies, religious beliefs, and cultural values—a…",
    "link": "https://www.shtfplan.com/headline-news/how-to-actually-solve-the-affordability-crisis",
    "timestamp": "2025-11-19T23:30:25Z"
  },
  {
    "title": "Trump defends Saudi crown prince while downplaying Khashoggi murder: 'Things happen' (Washington Examiner)",
    "description": "Washington Examiner:\nTrump defends Saudi crown prince while downplaying Khashoggi murder: ‘Things happen’  —  President Donald Trump went to great lengths to hail Saudi Arabia as a “great ally” as Crown Prince Mohammed bin Salman joined him in the Oval Office…",
    "link": "https://www.memeorandum.com/251119/p151",
    "timestamp": "2025-11-19T23:30:00Z"
  },
  {
    "title": "Trump’s ‘51st state’ comments launched a wave of Canadian patriotism. Has your life changed since then?",
    "description": "After he was re-elected in November, 2024, U.S. President Donald Trump said he wanted to make Canada the “51st state” and threatened to impose tariffs on its neighbour to the north. Those tariffs came in February and Canada and the U.S. have been embroiled in…",
    "link": "https://biztoc.com/x/c77ad1dfcca85d21",
    "timestamp": "2025-11-19T23:29:31Z"
  },
  {
    "title": "Epstein email said Trump was a bad person: 'Not one decent cell in his body'",
    "description": "In a 2017 email released by the House Oversight Committee in November 2025, convicted sex offender Jeffrey Epstein wrote, \"I have met some very bad people. None as bad as Trump. Not one decent cell in his body.\"",
    "link": "https://www.snopes.com//fact-check/trump-bad-person-epstein-email/",
    "timestamp": "2025-11-19T23:29:00Z"
  },
  {
    "title": "Trump Ukraine envoy to resign in January – Reuters",
    "description": "Keith Kellogg’s resignation could come amid reports that the US presented a peace plan to Ukraine requiring that Kiev relinquish territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628044-trump-ukraine-envoy-resign/",
    "timestamp": "2025-11-19T23:26:12Z"
  },
  {
    "title": "WH touts $1 trillion Saudi investment plan, with few details",
    "description": "Saudi Arabia has committed to investing $1 trillion in various U.S. industries, including nuclear energy and defense manufacturing, as announced at a joint investment forum with President Donald Trump.",
    "link": "https://www.wgal.com/article/saudi-1-trillion-us-investment/69489096",
    "timestamp": "2025-11-19T23:26:11Z"
  },
  {
    "title": "WH touts $1 trillion Saudi investment plan, with few details",
    "description": "Saudi Arabia has committed to investing $1 trillion in various U.S. industries, including nuclear energy and defense manufacturing, as announced at a joint investment forum with President Donald Trump.",
    "link": "https://www.kcra.com/article/saudi-1-trillion-us-investment/69489096",
    "timestamp": "2025-11-19T23:25:56Z"
  },
  {
    "title": "US and Russian officials draft new peace plan for Ukraine, urge Zelenskiy to accept",
    "description": "Proposal, described as ‘heavily tilted towards Russia’, envisages major concessions by Kyiv to end war",
    "link": "https://www.irishtimes.com/world/europe/2025/11/20/us-and-russian-officials-draft-new-peace-plan-for-ukraine-urge-zelenskiy-to-accept/",
    "timestamp": "2025-11-19T23:25:38Z"
  },
  {
    "title": "Nigeria needs international collaboration to fight terrorism, says Tinubu’s aide",
    "description": "Aide to President Tinubu says Nigeria needs international collaboration to fight terrorism, highlighting partnerships with the US amid ongoing security thr\n\nRead More: https://punchng.com/nigeria-needs-international-collaboration-to-fight-terrorism-says-tinub…",
    "link": "https://punchng.com/nigeria-needs-international-collaboration-to-fight-terrorism-says-tinubus-aide/",
    "timestamp": "2025-11-19T23:24:09Z"
  },
  {
    "title": "Comey indictment was never approved by grand jury",
    "description": "Prosecutor Lindsay Halligan may have sunk the case against Comey with one stunning admission.",
    "link": "https://www.salon.com/2025/11/19/comey-indictment-was-never-approved-by-grand-jury/",
    "timestamp": "2025-11-19T23:23:16Z"
  },
  {
    "title": "Labor Department won’t release full October jobs report due to 43-day shutdown",
    "description": "The Labor Department said Wednesday that it will not be releasing a full jobs report for October because the 43-day federal government shutdown meant it couldn't calculate the unemployment rate and some other key numbers.",
    "link": "https://www.pbs.org/newshour/economy/labor-department-wont-release-full-october-jobs-report-due-to-43-day-shutdown",
    "timestamp": "2025-11-19T23:22:33Z"
  },
  {
    "title": "Trump claim he doesn’t know why he got an MRI is 'utter nonsense': top doctor",
    "description": "A leading physician says that President Donald Trump's claims of ignorance when it comes to his recent MRI scan is \"nonsensical,\" insisting the president absolutely knows why his doctors had him take the test, according to The Daily Beast.Dr. Vin Gupta, a med…",
    "link": "https://www.rawstory.com/mri-trump-2674311192/",
    "timestamp": "2025-11-19T23:21:23Z"
  },
  {
    "title": "Daddy Dearest! Donald Trump Scores Major Brownie Points With Son Barron, 19, After Introducing Teen to His Hero",
    "description": "Donald Trump had his youngest son, Barron, grinning from ear-to-ear after introducing the teen to his sports hero.",
    "link": "https://radaronline.com/p/donald-trump-barron-cristiano-ronaldo-meeting/",
    "timestamp": "2025-11-19T23:20:00Z"
  },
  {
    "title": "Joe Biden to attend Dick Cheney’s funeral, as Donald Trump continues to remain silent on his death",
    "description": "Biden, a Democrat, had praised Cheney for his “strong set of conservative values.\"",
    "link": "https://www.bostonherald.com/2025/11/19/cheney-funeral/",
    "timestamp": "2025-11-19T23:19:53Z"
  },
  {
    "title": "Trump’s Gaza peace plan is doomed — unless he shuts down terror-boosting UNRWA",
    "description": "To succeed in bringing peace to Gaza, Trump must first shutter UNRWA, the UN's relief group — by slapping it with anti-terrorism sanctions.",
    "link": "https://nypost.com/2025/11/19/opinion/trumps-gaza-peace-plan-is-doomed-until-he-shuts-down-unrwa/",
    "timestamp": "2025-11-19T23:19:15Z"
  },
  {
    "title": "Don’t mutilate kids: Science confirms common sense on ‘gender-affirming care’",
    "description": "At least real science is winning.",
    "link": "https://nypost.com/2025/11/19/opinion/dont-mutilate-kids-science-confirms-common-sense-on-gender-affirming-care/",
    "timestamp": "2025-11-19T23:19:12Z"
  },
  {
    "title": "G20 leaders are 'saving the furniture' as Trump leads a boycott",
    "description": "Trump's absence could neuter the forum's ability to move the dial on the summit's priorities, including helping nations adapt to weather disasters, the transition to clean energy, cutting excessive debt costs and working together in the global rush for critic…",
    "link": "https://www.abc.net.au/news/2025-11-20/g20-trump-boycott-albanese-save-furniture/106031090",
    "timestamp": "2025-11-19T23:18:51Z"
  },
  {
    "title": "Trump, Melania Welcome MBS to White House Dinner",
    "description": "US President Donald Trump gave Saudi Arabia's crown prince a lavish reception in Washington, offering a defense agreement that includes cutting-edge warplanes and absolving him of the murder of an American journalist.\nThe US leader and the crown prince signed…",
    "link": "https://biztoc.com/x/c513de20d1cca335",
    "timestamp": "2025-11-19T23:18:06Z"
  },
  {
    "title": "Beware rumor Macy's canceled 2025 Thanksgiving parade because of Mamdani",
    "description": "Macy's was canceling its Thanksgiving parade in New York City in 2025 because Mayor-elect Zohran Mamdani wanted to charge the department store $10 billion to use Fifth Avenue.",
    "link": "https://www.snopes.com//fact-check/macys-thanksgiving-day-parade-cancelled/",
    "timestamp": "2025-11-19T23:14:00Z"
  },
  {
    "title": "Ukraine told to accept cash-for-land deal with Putin",
    "description": "Russia would keep control of Donbas region in exchange for rental fee under US plan Ukraine could be forced to lease part of its territory to Russia under a US plan to end the war.The Trump administration deal would see Kyiv cede control of the eastern Donbas…",
    "link": "https://freerepublic.com/focus/f-chat/4353467/posts",
    "timestamp": "2025-11-19T23:13:39Z"
  },
  {
    "title": "Wednesday Night Open Thread",
    "description": "So for the past two nights I have gone to write a post and realized it was not going to go up until 11 pm so I said fuck it and am starting now. Doing a quick rundown of the news, we see the incompetence of the Trump team is finally starting to break through:…",
    "link": "https://balloon-juice.com/2025/11/19/wednesday-night-open-thread-87/",
    "timestamp": "2025-11-19T23:12:55Z"
  },
  {
    "title": "Trump: Saudi Crown Prince may join ‘greatest board ever’ to oversee Gaza",
    "description": "Trump expresses hope Saudi Crown Prince Mohammed bin Salman will join the UN-backed Board of Peace overseeing Gaza’s redevelopment, following a White House meeting and strategic US-Saudi agreements.",
    "link": "https://www.israelnationalnews.com/news/418059",
    "timestamp": "2025-11-19T23:12:23Z"
  },
  {
    "title": "Rain forecast, unpacking the COP30 climate summit",
    "description": "Don't put away your umbrellas just yet.San Diego County is expecting another rainstorm late Thursday, after heavy rainfall earlier in the week. We break down the forecast.Plus, we take a look into progress being made at this year's United Nations climate conf…",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/rain-forecast-unpacking-the-cop30-climate-summit",
    "timestamp": "2025-11-19T23:10:00Z"
  },
  {
    "title": "Judge Isn’t Done With Trump Over Ignoring His Court Order",
    "description": "Some high-ranking officials could be called forward to testify.",
    "link": "https://www.huffpost.com/entry/contempt-for-trump-judge-resumes-probe-over-alien-enemy-act-deportations_n_691e3bbfe4b06f2a60cb89fe",
    "timestamp": "2025-11-19T23:09:44Z"
  },
  {
    "title": "Pro-Crypto CFTC Chair Nominee Won’t Commit to More Agency Resources or Dem Commissioners",
    "description": "During a Senate confirmation hearing, Mike Selig declined to say the CFTC needs more resources to regulate crypto—despite bipartisan support on the issue.",
    "link": "https://decrypt.co/349288/pro-crypto-cftc-chair-mike-selig-agency-resources-dem-commissioners",
    "timestamp": "2025-11-19T23:09:15Z"
  },
  {
    "title": "Here’s the Trump executive order that would ban state AI laws",
    "description": "President Donald Trump is considering signing an executive order as soon as Friday that would give the federal government unilateral power over regulating artificial intelligence, including the creation of an \"AI Litigation Task Force\" overseen by the Attorne…",
    "link": "https://www.theverge.com/ai-artificial-intelligence/824608/trump-executive-order-ai-state-laws",
    "timestamp": "2025-11-19T23:03:28Z"
  },
  {
    "title": "Epstein files bill includes exceptions that could affect what gets released and when",
    "description": "Although Congress overwhelmingly passed a bill compelling the Justice Department to release all of its files on the Jeffrey Epstein probe, there are exceptions.",
    "link": "https://abcnews.go.com/Politics/epstein-files-bill-includes-exceptions-affect-gets-released/story?id=127673876",
    "timestamp": "2025-11-19T23:03:12Z"
  },
  {
    "title": "Appeals Court Halts Sweeping Order that Restricts Immigration Agents’ Use of Force Around Chicago",
    "description": "A federal appeals court has paused a sweeping order that restricts federal immigration agents’ use of force across Chicago and the suburbs following a series of aggressive raids led by Border Patrol and Immigration and Customs Enforcement. The Seventh Circuit…",
    "link": "https://freerepublic.com/focus/f-news/4353464/posts",
    "timestamp": "2025-11-19T23:02:01Z"
  },
  {
    "title": "What’s Next For the Epstein Files?",
    "description": "The following is a preview of Daily Signal Politics Editor Bradley Devlin’s interview with Rep. Eric Burlison, R-Mo., on “The Signal Sitdown.” The full interview... Read More\nThe post What’s Next For the Epstein Files? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/19/whats-next-for-the-epstein-files/",
    "timestamp": "2025-11-19T23:01:27Z"
  },
  {
    "title": "Fox News Poll: Voters say White House is doing more harm than good on economy",
    "description": "Trump's approval hits new lows as 76% view economy negatively in latest Fox News poll. Rising costs for groceries, utilities spark voter dissatisfaction nationwide.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-voters-say-white-house-doing-more-harm-than-good-economy",
    "timestamp": "2025-11-19T23:00:16Z"
  },
  {
    "title": "The DOJ’s big screwups, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: It has been a bad week for President Donald Trump’s Ju…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/469767/justice-department-texas-gerrymander-james-comey-indictment-screwups",
    "timestamp": "2025-11-19T23:00:03Z"
  },
  {
    "title": "Senate to hold hearing for billionaire Jared Isaacman's re-nomination as NASA chief on Dec. 3",
    "description": "The U.S. Senate will hold a hearing on Dec. 3 to consider the re-nomination of billionaire tech entrepreneur Jared Isaacman as NASA chief.",
    "link": "https://www.space.com/space-exploration/senate-to-hold-hearing-for-billionaire-jared-isaacmans-re-nomination-as-nasa-chief-on-dec-3",
    "timestamp": "2025-11-19T23:00:00Z"
  },
  {
    "title": "Trump Deportation Campaign Forcing Immigrants to Avoid Healthcare and Change Daily Routines",
    "description": "For people who have immigrated to the United States—regardless of whether they have legal status—life under the second Trump administration has provoked daily anxiety and fear—forcing many to make choices about whether it's safe to go to church services that …",
    "link": "https://www.commondreams.org/news/healthcare-for-immigrants",
    "timestamp": "2025-11-19T22:58:38Z"
  },
  {
    "title": "Trump Plans to Unveil ‘Genesis Mission’ to Boost AI Development",
    "description": "President Donald Trump plans to roll out a “Genesis Mission” as part of an executive order to boost US artificial intelligence efforts on Monday at the White House, according to a Department of Energy official.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plans-to-unveil-genesis-mission-to-boost-ai-development",
    "timestamp": "2025-11-19T22:56:40Z"
  },
  {
    "title": "EXCLUSIVE: 'Disgraced' Donald Trump 'Has Increased His Chances of Being Assassinated by Outraged U.S. Patriots' — For Fawning Over Saudi 'Money Pump' Mr Bone Saw In White House",
    "description": "Donald Trump has heightened his personal safety risk after backing Saudi's interests.",
    "link": "https://radaronline.com/p/trump-assassination-risk-after-saudi-white-house-support-disgrace/",
    "timestamp": "2025-11-19T22:56:28Z"
  },
  {
    "title": "Senate committee advances a Trump-aligned pick for HHS watchdog, a role long seen as nonpartisan",
    "description": "Thomas March Bell’s nomination has raised questions about independence.",
    "link": "https://www.bostonherald.com/2025/11/19/hhs-inspector-general/",
    "timestamp": "2025-11-19T22:54:34Z"
  },
  {
    "title": "'Stone-cold liar': Top House Dem lashes out at Comer for accusing him of soliciting Epstein donations",
    "description": "House Minority Leader Hakeem Jeffries calls House Oversight Committee Chairman James Comer a 'stone-cold liar' over accusations of connections to Jeffrey Epstein.",
    "link": "https://www.foxnews.com/politics/stone-cold-liar-top-house-dem-lashes-out-comer-soliciting-epstein-donations",
    "timestamp": "2025-11-19T22:52:24Z"
  },
  {
    "title": "Trump Might Actually Fulfill 1 Of His Campaign Promises",
    "description": "Eliminating the department has been a goal for the Republican Party since the agency was first established in 1980.",
    "link": "https://www.huffpost.com/entry/trump-education-department-dismantle_n_691e3e0ae4b06f2a60cb8b4c",
    "timestamp": "2025-11-19T22:52:09Z"
  },
  {
    "title": "Trump on Fed Chair Powell: ‘I’d Love to Fire His A**’",
    "description": "President Donald Trump said Wednesday that he would \"love to fire\" Federal Reserve Chairman Jerome Powell, whom he has long criticized for what he sees as a failure to cut interest rates fast enough. \nThe post Trump on Fed Chair Powell: ‘I’d Love to Fire His …",
    "link": "https://www.breitbart.com/politics/2025/11/19/trump-on-fed-chair-powell-id-love-to-fire-his-a/",
    "timestamp": "2025-11-19T22:51:42Z"
  },
  {
    "title": "Trump considering executive order to preempt state AI laws",
    "description": "U.S. President Donald Trump is considering an executive order that would seek to preempt state laws on artificial intelligence through lawsuits and by withholding federal funding, according to a draft of the order seen by Reuters.The order would task Attorney…",
    "link": "https://www.channelnewsasia.com/business/trump-considering-executive-order-preempt-state-ai-laws-5478481",
    "timestamp": "2025-11-19T22:47:19Z"
  },
  {
    "title": "Lawmakers urge troops to disobey illegal orders...",
    "description": "Half a dozen members of Congress who previously served in the military or intelligence community are urging servicemembers and intelligence officials to disobey illegal orders that might be issued by President Donald Trump’s administration.",
    "link": "https://www.cnn.com/2025/11/19/politics/democratic-lawmakers-urge-troops-to-disobey-illegal-orders",
    "timestamp": "2025-11-19T22:46:38Z"
  },
  {
    "title": "Trump Admin Signals Mysterious ‘Structural Changes’ To SNAP Food Benefits",
    "description": "USDA Secretary Brooke Rollins' talk about making SNAP recipients reapply for benefits has program stakeholders scratching their heads.",
    "link": "https://www.huffpost.com/entry/usda-snap-fraud-brooke-rollins_n_691e2e93e4b06f2a60cb7bd2",
    "timestamp": "2025-11-19T22:44:17Z"
  },
  {
    "title": "Ted Cruz teases big 2028 moves",
    "description": "For as much as President Donald Trump seems the alpha and omega of Republican politics at the moment, a growing number of savvy conservatives are already eyeing a post-Trump world. Some are even starting to make moves accordingly. For Texas Sen. Ted Cruz (R),…",
    "link": "https://biztoc.com/x/1b616500099a4c1f",
    "timestamp": "2025-11-19T22:44:10Z"
  },
  {
    "title": "Judge to proceed with contempt probe over U.S. flying migrants to El Salvador prison in March",
    "description": "A federal judge said Wednesday he plans to move ahead quickly on a contempt investigation of the Trump administration for failing to turn around planes carrying Venezuelan migrants to El Salvador in March.",
    "link": "https://www.pbs.org/newshour/politics/judge-to-proceed-with-contempt-probe-over-u-s-flying-migrants-to-el-salvador-prison-in-march",
    "timestamp": "2025-11-19T22:44:04Z"
  }
]