[
  {
    "title": "WATCH: Doocy asks Trump point-blank if he wants to see John Brennan, James Comey ‘behind bars’",
    "description": "'They are dishonest people, I think they're crooked as hell. And maybe they have to pay a price for that. I believe they are truly bad people and dishonest people, so whatever happens, happens'",
    "link": "https://www.wnd.com/2025/07/watch-doocy-asks-trump-point-blank-if-he/",
    "timestamp": "2025-07-09T19:34:33Z"
  },
  {
    "title": "US could collect $300 billion in tariff revenue this year, Treasury chief says",
    "description": "Treasury Secretary Scott Bessent on Tuesday said the U.S. has taken in about $100 billion in tariff income so far this year, and this could grow to $300 billion by the end of 2025 as collections accelerate from President Donald Trump's trade campaign. Bessent…",
    "link": "https://freerepublic.com/focus/f-news/4327762/posts",
    "timestamp": "2025-07-09T19:33:20Z"
  },
  {
    "title": "US sanctions UN expert Albanese over Israel criticism",
    "description": "Trump administration says it is targeting Albanese for encouraging ICC war crime prosecution against Israel's Netanyahu.",
    "link": "https://www.aljazeera.com/news/2025/7/9/us-sanctions-un-expert-albanese-over-israel-criticism",
    "timestamp": "2025-07-09T19:32:55Z"
  },
  {
    "title": "Elon Musk's White House tenure had 'troublesome ending,' WH Chief of Staff Susie Wiles says",
    "description": "Chief of Staff Susie Wiles told Miranda Devine on Wednesday that Elon Musk and Donald Trump's relationship had a \"troublesome ending.\"",
    "link": "https://www.foxnews.com/media/elon-musks-white-house-tenure-had-troublesome-ending-wh-chief-staff-susie-wiles-says",
    "timestamp": "2025-07-09T19:32:20Z"
  },
  {
    "title": "The Epstein Files Anticlimax Is Exposing Trump for Who He Really Is",
    "description": "Donald Trump does not want to talk about Jeffrey Epstein. Asked on Tuesday about his administration’s refusal to release files related to the dead financier who allegedly sex-trafficked underage girls—and about Epstein’s significant ties to powerful people, i…",
    "link": "https://newrepublic.com/article/197760/epstein-files-exposing-trump-elites",
    "timestamp": "2025-07-09T19:31:42Z"
  },
  {
    "title": "Stable Genius Trump Asks African Leaders to Tell Him Who They Are",
    "description": "At the beginning of Trump’s Wednesday “multilateral lunch” event to discuss commercial opportunities with five West African leaders, Trump asked his guests to say “a few words to the press.” But as the first spoke, Trump changed his mind, interrupting him to …",
    "link": "https://newrepublic.com/post/197772/trump-asks-african-leaders-tell-him-their-names",
    "timestamp": "2025-07-09T19:31:20Z"
  },
  {
    "title": "Lawsuit alleges RFK Jr. requires vaccine panel members to be Republicans or independents",
    "description": "A lawsuit filed Monday by a coalition of medical professional groups alleges that Health Secretary Robert F. Kennedy Jr.",
    "link": "https://www.msnbc.com/top-stories/latest/rfk-jr-lawsuit-vaccine-panel-democrats-republicans-trump-rcna217788",
    "timestamp": "2025-07-09T19:30:45Z"
  },
  {
    "title": "Tesla Short Sellers Rake In $1.4 Billion As Elon Musk's Feud With Trump Tanks Stock",
    "description": "Tesla's market volatility after Elon Musk picked another fight with Trump has seen short-sellers make a tidy profit this week.",
    "link": "https://www.jalopnik.com/1908084/tesla-short-sellers-billion-dollar-profit-after-elon-musk-trump-feud/",
    "timestamp": "2025-07-09T19:30:31Z"
  },
  {
    "title": "California Bishop Says Catholics Can Skip Mass In Light Of ICE Raids",
    "description": "The San Bernardino bishop is the latest Catholic clergyman to push back against Trump's immigration raids.",
    "link": "https://www.huffpost.com/entry/san-bernardino-bishop-immigration-raids_n_686e9b77e4b041f69cfe38dd",
    "timestamp": "2025-07-09T19:30:30Z"
  },
  {
    "title": "Most Fed officials see rate cuts coming, but opinions vary widely on how many, minutes show",
    "description": "Federal Reserve officials diverged at their June meeting about how aggressively they would be willing to cut interest rates, split between concerns over tariff-fueled inflation and signs of labor market weakness and economic strength",
    "link": "https://www.nbcnews.com/business/economy/fed-officials-see-rate-cuts-coming-opinions-vary-widely-many-minutes-s-rcna217819",
    "timestamp": "2025-07-09T19:30:22Z"
  },
  {
    "title": "US SEC ‘Crypto Mom’ clarifies: ‘Tokenized securities are still securities’",
    "description": "SEC Commissioner and crypto advocate Hester Peirce warned market participants considering tokenized assets to be aware of where their assets may fall under US securities laws.",
    "link": "https://cointelegraph.com/news/hester-peirce-tokenized-securities",
    "timestamp": "2025-07-09T19:29:58Z"
  },
  {
    "title": "Trump holds court on presidential portraits, pretty picture frames and FDR, ‘an amazing man’",
    "description": "Of his time in \"the vaults,\" Trump says, “sometimes I like frames more than I like the pictures.\" He's a fan of Polk, \"sort of a real-estate guy.\"",
    "link": "https://fortune.com/2025/07/09/donald-trump-presidential-portraits-history-fdr-eisenhower-polk-frames/",
    "timestamp": "2025-07-09T19:29:54Z"
  },
  {
    "title": "Theater Nerd Takes Trump Blame Game To Delusional Level",
    "description": "'Metropolitan Opera season attendance dropped slightly following the Trump administration’s immigration crackdown,' writes the AP",
    "link": "https://dailycaller.com/2025/07/09/donald-trump-peter-gelb-metropolitan-opera-ticket-sales-immigration/",
    "timestamp": "2025-07-09T19:29:09Z"
  },
  {
    "title": "Brazil Summons US Envoy Over Criticism Of Bolsonaro Trial",
    "description": "Brazil said Wednesday it had summoned the US charge d'affaires in a diplomatic row following President Donald Trump's criticism of the coup trial of his right-wing ally, ex-leader Jair Bolsonaro.",
    "link": "https://www.ibtimes.com/brazil-summons-us-envoy-over-criticism-bolsonaro-trial-3778024",
    "timestamp": "2025-07-09T19:27:14Z"
  },
  {
    "title": "US Sanctions UN Rights Expert For Palestinian Territories",
    "description": "US Secretary of State Marco Rubio on Wednesday announced Washington was sanctioning the United Nations special expert on the Palestinian territories, following her criticism of Washington policy on Gaza.",
    "link": "https://www.ibtimes.com/us-sanctions-un-rights-expert-palestinian-territories-3778021",
    "timestamp": "2025-07-09T19:27:13Z"
  },
  {
    "title": "First major US airline to resume Israel flights as part of 'longstanding commitment to serving Tel Aviv'",
    "description": "United Airlines becomes the first U.S. carrier to resume flights to Tel Aviv, Israel, on July 21 following the ceasefire after Operation Rising Lion and the 12-day conflict with Iran.",
    "link": "https://www.foxnews.com/travel/first-major-us-airline-resume-israel-flights-part-longstanding-commitment-tel-aviv",
    "timestamp": "2025-07-09T19:25:27Z"
  },
  {
    "title": "Trump Crashes Out Over Question About Chaotic Ukraine Aid Pause",
    "description": "The president is not concerned that his underlings are independently intervening in American foreign policy without any authorization to do so.Speaking with reporters in the State Dining Room Wednesday, Donald Trump said that he hadn’t given much attention to…",
    "link": "https://newrepublic.com/post/197773/donald-trump-question-chaotic-ukraine-aid-pause",
    "timestamp": "2025-07-09T19:25:03Z"
  },
  {
    "title": "Trump Looks To 'Forge New Economic Opportunities’ With African Nations in White House Meeting",
    "description": "WASHINGTON – President Donald Trump said that his administration is \"working tirelessly\" to establish new economic opportunities with many African countries during a lunch with African leaders at the White House on Wednesday.\nThe post Trump Looks To ‘Forge Ne…",
    "link": "https://www.breitbart.com/politics/2025/07/09/trump-looks-to-forge-new-economic-opportunities-with-african-nations-in-white-house-meeting/",
    "timestamp": "2025-07-09T19:25:00Z"
  },
  {
    "title": "South Korea Tries to Tie Tariffs to Security Protections in Trump Trade Talks",
    "description": "South Korea sent its National Security Adviser Wi Sung-lac to Washington this week to meet with top officials in the administration of President Donald Trump, telling reporters that his government sought to handle security concerns alongside trade negotiation…",
    "link": "https://www.breitbart.com/asia/2025/07/09/south-korea-tries-to-tie-tariffs-to-security-protections-in-trump-trade-talks/",
    "timestamp": "2025-07-09T19:24:59Z"
  },
  {
    "title": "Trump’s latest tariff pause indicates a foundational problem with his policy",
    "description": "Today marks the end of President Trump’s 90-day pause before tariffs he announced on dozens of countries were supposed to take effect. Trump has postponed them again, until Aug. 1",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariff-policy-pause-liberation-day-rcna217484",
    "timestamp": "2025-07-09T19:24:14Z"
  },
  {
    "title": "Tiffany Cross: Trump Is Kidnapping Non-White People, Throwing Them in 'Concentration Camps'",
    "description": "Former MSNBC host Tiffany Cross said Tuesday on CNN’s “NewsNight” that President Donald Trump was “kidnapping” non-white people and throwing them in “concentration camps.” During the panel discussion on federal immigration agents in MacArthur Park in Los Ange…",
    "link": "https://www.breitbart.com/clips/2025/07/09/tiffany-cross-trump-is-kidnapping-non-white-people-throwing-them-in-concentration-camps/",
    "timestamp": "2025-07-09T19:23:48Z"
  },
  {
    "title": "Disney White House Meeting: Iger Discusses Future of Company as New Concern Rises",
    "description": "Bob Iger decided to have a serious Disney White House meeting to discuss the company’s future in light of the ever-growing concerns over artificial intelligence. Disney Conducts a White House Meeting About the Future of AI and the Company’s IPs “It’s like wat…",
    "link": "https://insidethemagic.net/2025/07/disney-bob-iger-white-house-trump-emd1/",
    "timestamp": "2025-07-09T19:22:39Z"
  },
  {
    "title": "Trump Humiliates Himself With Idiotic Question to Liberian President",
    "description": "Donald Trump humiliated himself Wednesday in front of several leaders of African states by revealing just how little he knows about their countries. During a meeting with leaders from Gabon, Guinea-Bissau, Liberia, Mauritania, and Senegal, as part of a multid…",
    "link": "https://newrepublic.com/post/197770/donald-trump-question-liberian-president-english",
    "timestamp": "2025-07-09T19:21:50Z"
  },
  {
    "title": "Trump Has a Condition for New Russian Sanctions",
    "description": "\"President Donald Trump is ready to sign a punishing Russia sanctions bill that GOP hawks have pushed for months. But only if it changes to give him more control,\" Politico reports. \"A senior administration official",
    "link": "https://politicalwire.com/2025/07/09/trump-has-a-condition-for-new-russian-sanctions/",
    "timestamp": "2025-07-09T19:21:19Z"
  },
  {
    "title": "CNN’s Jake Tapper Says Public Is ‘Being Played’ By Trump Administration Over Epstein Files",
    "description": "The CNN host accused the Trump administration of withholding information after the DOJ and FBI said no evidence exists of a Jeffrey Epstein client list.",
    "link": "https://www.huffpost.com/entry/jake-tapper-criticizes-trump-administration-epstein-files_n_686e8a0fe4b09bd98fe47cef",
    "timestamp": "2025-07-09T19:20:50Z"
  },
  {
    "title": "Why Elon Musk’s America Party is doomed to fail",
    "description": "Jen Psaki reacts to Elon Musk’s proposed America Party and breaks down the barriers to building a new political party in the U.S.",
    "link": "https://www.msnbc.com/top-stories/latest/elon-musk-third-party-problem-rcna217734",
    "timestamp": "2025-07-09T19:19:27Z"
  },
  {
    "title": "Trump eyes African mineral wealth in trade-focused summit",
    "description": "Talks with the presidents of Senegal, Liberia, Guinea-Bissau, Mauritania and Gabon were expected to focus on commercial opportunities and security.",
    "link": "https://www.enca.com/business/trump-eyes-african-mineral-wealth-trade-focused-summit",
    "timestamp": "2025-07-09T19:18:32Z"
  },
  {
    "title": "Trump is interested in new Russia sanctions. But there’s a catch",
    "description": "President Donald Trump is ready to sign a punishing Russia sanctions bill that GOP hawks have pushed for months. But only if it changes to give him more control. \nA senior administration official granted anonymity to discuss the president’s view said that “co…",
    "link": "https://biztoc.com/x/9be389930adf4542",
    "timestamp": "2025-07-09T19:14:39Z"
  },
  {
    "title": "Thumzup to add XRP, DOGE, and more to bitcoin-led corporate treasury; Trump Jr. takes stake",
    "description": "Thumzup Media also disclosed that Donald Trump Jr. owns 350,000 shares, worth about $4 million at current prices.",
    "link": "https://biztoc.com/x/a6730769d3c89a9f",
    "timestamp": "2025-07-09T19:14:24Z"
  },
  {
    "title": "'Will be fun!' GOP senators threaten drama for Trump's next bill",
    "description": "With Republicans having passed President Donald Trump's controversial tax cut and health care rollback megabill, the fight now moves on to Trump's next piece of legislation: a $9 billion \"rescission\" package to eliminate funding for foreign aid and public bro…",
    "link": "https://www.rawstory.com/trump-rescissions/",
    "timestamp": "2025-07-09T19:14:02Z"
  },
  {
    "title": "US imposing sanctions on senior UN official focused on Palestinian human rights | CNN Politics",
    "description": "The US is imposing sanctions against a senior UN official focused on the human rights of Palestinians, US Secretary of State Marco Rubio announced Wednesday.",
    "link": "https://www.cnn.com/2025/07/09/politics/us-sanctions-un-official-palestinian-human-rights",
    "timestamp": "2025-07-09T19:13:46Z"
  },
  {
    "title": "Trump’s Big Beautiful Gift to Anduril",
    "description": "The One Big Beautiful Bill Act requires all new border surveillance towers to be certified \"autonomous.\" Only Anduril's fit the bill.\nThe post Trump’s Big Beautiful Gift to Anduril appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/07/09/trump-big-beautiful-bill-anduril/",
    "timestamp": "2025-07-09T19:11:48Z"
  },
  {
    "title": "MAGA Turns on Trump’s Attorney General for Closing the Case on Epstein",
    "description": "Pam Bondi once said she had Epstein’s client list on her desk, but now it turns out that she didn’t and there never was one.",
    "link": "https://www.vanityfair.com/news/story/maga-turns-on-trumps-attorney-general-for-closing-the-case-on-epstein",
    "timestamp": "2025-07-09T19:11:25Z"
  },
  {
    "title": "After voting for Trump's megabill, GOP Sen. Josh Hawley wants to prevent a key provision from going into effect",
    "description": "As Republicans face criticism for cutting Medicaid, Hawley tried to shift the focus to a less-noticed part of the law that will benefit victims of nuclear waste.",
    "link": "https://www.nbcnews.com/politics/congress/trump-megabill-vote-medicaid-josh-hawley-republican-rcna217596",
    "timestamp": "2025-07-09T19:10:41Z"
  },
  {
    "title": "Why a 'Mobile-First' Mentality Drove OpenSea's Latest Acquisition",
    "description": "Major NFT and token trading platform OpenSea will increase its mobile focus after acquiring the team behind crypto portfolio app Rally.",
    "link": "https://decrypt.co/329360/why-mobile-first-mentality-drove-opensea-acquisition-rally",
    "timestamp": "2025-07-09T19:10:41Z"
  },
  {
    "title": "How Trump’s ‘Big, Beautiful Bill’ could help China win EV race",
    "description": "The \"One, Big, Beautiful Bill\" has been signed into law. Here's how it will help China dominate U.S. in global EV race, according to experts.",
    "link": "https://www.usatoday.com/story/money/cars/2025/07/09/trums-big-beautiful-bill-china-ev-market/84505321007/",
    "timestamp": "2025-07-09T19:09:29Z"
  },
  {
    "title": "Trump says 'very close' to securing Israel, Hamas ceasefire, returning hostages",
    "description": "President Trump and Israeli Prime Minister Netanyahu have said they believe a 60-day deal to return half the hostages and a temporary ceasefire in Gaza will happen soon.",
    "link": "https://www.foxnews.com/world/trump-says-very-close-securing-israel-hamas-ceasefire-returning-hostages",
    "timestamp": "2025-07-09T19:09:27Z"
  },
  {
    "title": "Chris Cuomo slams Chris Murphy for 'cheap shot' suggestion that Trump funding cuts played part in Texas floods",
    "description": "Former CNN anchor Chris Cuomo condemned the politicization of the Texas floods by Sen. Chris Murphy, D-Ct., on Tuesday, arguing that such partisan rhetoric during tragedies is \"killing us.\"",
    "link": "https://www.foxnews.com/media/chris-cuomo-slams-chris-murphy-cheap-shot-suggestion-trump-funding-cuts-played-part-texas-floods",
    "timestamp": "2025-07-09T19:07:15Z"
  },
  {
    "title": "CIA contradicts Obama officials’ sworn denials about Russiagate report",
    "description": "It was John Brennan who briefed Obama on intel that found Hillary Clinton planned to tie Trump to Russia in order to deflect attention from her illegal use of a private server while secretary of state",
    "link": "https://www.wnd.com/2025/07/cia-contradicts-obama-officials-sworn-denials-about-russiagate/",
    "timestamp": "2025-07-09T19:06:04Z"
  },
  {
    "title": "James Carville Drops the Hammer on Democrats Over Empty Messaging to Men: ‘We’ve Erased Them!’",
    "description": "James Carville laid into Democrats over their messaging to young men, arguing the party belittles a large part of the voting population.\nThe post James Carville Drops the Hammer on Democrats Over Empty Messaging to Men: ‘We’ve Erased Them!’ first appeared on …",
    "link": "https://www.mediaite.com/media/podcasts/james-carville-drops-the-hammer-on-democrats-over-empty-messaging-to-men-weve-erased-them/",
    "timestamp": "2025-07-09T19:04:55Z"
  },
  {
    "title": "Did Trump's National Weather Service staffing cuts hurt Texas flood response? What we know",
    "description": "The most dangerous weather emergencies are the ones that happen overnight.",
    "link": "https://www.snopes.com//news/2025/07/09/trump-nws-cuts-texas-floods/",
    "timestamp": "2025-07-09T19:04:00Z"
  },
  {
    "title": "Ag secretary says able-bodied Medicaid recipients should replace immigrant farm workforce",
    "description": "Agriculture Secretary Brooke Rollins said millions of adult Medicaid participants who will face stricter work requirements under the GOP megabill should replace foreign farm workers deported under the Trump administration’s immigration policies. “There will b…",
    "link": "https://freerepublic.com/focus/f-bloggers/4327748/posts",
    "timestamp": "2025-07-09T19:03:37Z"
  },
  {
    "title": "Trump Will Move Immediately to Lay Off Federal Workers",
    "description": "\"President Donald Trump has seized the authority to lay off federal workers and reorganize the federal government in a way that critics say no president has been able to do in more than 100 years,\"",
    "link": "https://politicalwire.com/2025/07/09/trump-will-move-immediately-to-lay-off-federal-workers/",
    "timestamp": "2025-07-09T19:03:04Z"
  },
  {
    "title": "Trump’s Chief of Staff Talks Boss’s Wild Spat With Elon Musk In Rare Interview",
    "description": "“And do you think he got, I don't know, jealous because he wasn't getting Donald Trump's full attention or was it something?” Devine speculated.\nThe post Trump’s Chief of Staff Talks Boss’s Wild Spat With Elon Musk In Rare Interview first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trumps-chief-of-staff-talks-bosss-wild-spat-with-elon-musk-in-rare-interview/",
    "timestamp": "2025-07-09T19:02:46Z"
  },
  {
    "title": "3 Possible Reasons Law Enforcement Officer Deaths Are Way Down",
    "description": "A new report shows a 50% decline in the number of law enforcement officers’ deaths in the line of duty since the start of 2025,... Read More\nThe post 3 Possible Reasons Law Enforcement Officer Deaths Are Way Down appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/09/3-possible-reasons-law-enforcement-officer-deaths-are-way-down/",
    "timestamp": "2025-07-09T19:02:35Z"
  },
  {
    "title": "How user-generated videos on social media brought Trump's immigration crackdown to America's screens",
    "description": "The videos have become a crucial window into the U.S. government’s aggressive efforts to find and apprehend undocumented immigrants.",
    "link": "https://www.nbcnews.com/specials/trump-immigration-crackdown-social-media-ice/index.html",
    "timestamp": "2025-07-09T19:02:21Z"
  },
  {
    "title": "Sotomayor breaks with Jackson in Supreme Court decision on cuts to federal workforce",
    "description": "Justice Ketanji Brown Jackson’s dissent in a Supreme Court order handed down on Tuesday stood out enough that it prompted one of her liberal colleagues to voice disagreement with her.",
    "link": "https://nypost.com/2025/07/09/us-news/sotomayor-breaks-with-jackson-in-supreme-court-decision-on-cuts-to-federal-workforce/",
    "timestamp": "2025-07-09T19:01:37Z"
  },
  {
    "title": "We Are Witnessing One of the Greatest Bromances in the History of Mankind",
    "description": "There have been some epic bromances over the course of human history. Alexander the Great and his general Hephaestion. Martin Luther and Philipp Melanchthon. Jefferson and Madison. Churchill and Roosevelt. Lennon and McCartney. Damon and Affleck. Dick and Dub…",
    "link": "https://freebeacon.com/politics/we-are-witnessing-one-of-the-greatest-bromances-in-the-history-of-mankind/",
    "timestamp": "2025-07-09T19:00:59Z"
  },
  {
    "title": "Former White House doctor refuses to answer questions as House Republican probe Biden’s health",
    "description": "President Joe Biden’s White House physician is refusing to answer questions as part of the House Republican investigation into Biden’s health in office.",
    "link": "https://www.pbs.org/newshour/politics/former-white-house-doctor-refuses-to-answer-questions-as-house-republican-probe-bidens-health",
    "timestamp": "2025-07-09T19:00:22Z"
  },
  {
    "title": "Supreme Court Normalizes Trump’s Unprecedented Mass Firings",
    "description": "The Supreme Court is normalizing Trump’s unprecedented mass firings of federal employees. The conservative majority has, once again, shrugged off the administration’s authoritarian motives in bypassing Congress.",
    "link": "http://nymag.com/intelligencer/article/supreme-court-normalizes-trumps-unprecedented-mass-firings.html",
    "timestamp": "2025-07-09T19:00:19Z"
  },
  {
    "title": "Trump Admin Launches Program to Protect Farms From China",
    "description": "\"We feed the world. We lead the world. And we’ll never let foreign adversaries control our land, our labs, or our livelihoods.\"\nThe post Trump Admin Launches Program to Protect Farms From China first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/trump-admin-launches-program-to-protect-farms-from-china/",
    "timestamp": "2025-07-09T19:00:17Z"
  },
  {
    "title": "'The situation is so fluid, I feel like I have to check my phone right now' – Samsung exec on the impact of US tariffs on the mobile business",
    "description": "Samsung Executive Vice President of Mobile Experience Dave Das has addressed the \"rapidly changing\" tariff situation in the US.",
    "link": "https://www.techradar.com/phones/samsung-galaxy-phones/the-situation-is-so-fluid-i-feel-like-i-have-to-check-my-phone-right-now-samsung-exec-on-the-impact-of-us-tariffs-on-the-mobile-business",
    "timestamp": "2025-07-09T19:00:00Z"
  },
  {
    "title": "Jeffrey Epstein's Brother Reacts to Trump Administration's Review of Case",
    "description": "Mark Epstein specifically targeted FBI Director Patel, questioning his ability to determine cause of death without medical expertise.",
    "link": "https://www.newsweek.com/jeffrey-epstein-brother-reacts-donald-trump-maga-2096876",
    "timestamp": "2025-07-09T18:59:41Z"
  },
  {
    "title": "Trump struggles with governing details — but remains focused on interior decorating",
    "description": "Donald Trump clearly struggles when it comes to governing details, but when it comes to interior decorating, he apparently has quite a bit to say.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-struggles-governing-details-remains-focused-interior-decorating-rcna217809",
    "timestamp": "2025-07-09T18:57:53Z"
  },
  {
    "title": "Senegalese President Resorts to Bribing Trump in Trade Meeting",
    "description": "Senegalese President Bassirou Diomaye Faye used a tried and true method to curry favor with President Trump: shameless flattery. “I know you are a tremendous golf player. Golf requires concentration and precision—qualities that also make for a great leader,” …",
    "link": "https://newrepublic.com/post/197757/senegal-president-bribes-trump-resort-trade-meeting",
    "timestamp": "2025-07-09T18:57:06Z"
  },
  {
    "title": "Donald Trump shuts down reporter who asked Jeffrey Epstein question following release of CCTV footage",
    "description": "President Donald Trump spectacularly shut down a reporter who dared to ask a Jeffrey Epstein related question to Attorney General Pam Bondi.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-shuts-down-reporter-jeffrey-epstein-question-pam-bondi-769016-20250709",
    "timestamp": "2025-07-09T18:56:18Z"
  },
  {
    "title": "US Birth Rates Are Falling—But It's Not Worrying Americans",
    "description": "Only three in 10 Americans say declining birth rates are a \"major problem,\" a new survey shows.",
    "link": "https://www.newsweek.com/birth-rates-falling-priority-concern-americans-2096746",
    "timestamp": "2025-07-09T18:54:55Z"
  },
  {
    "title": "'Proud to be their bridge': Shubhanshu Shukla on taking Indian science to space",
    "description": "Science News: Indian astronaut Shubhanshu Shukla (Shux) feels “proud” and “excited” to represent Indian scientists aboard the International Space Station (ISS), and.",
    "link": "https://timesofindia.indiatimes.com/science/proud-to-be-their-bridge-shubhanshu-shukla-on-taking-indian-science-to-space/articleshow/122349766.cms",
    "timestamp": "2025-07-09T18:53:50Z"
  },
  {
    "title": "Popular restaurant chain slammed with lawsuit by undocumented workers",
    "description": "Fear and uncertainty of the future have never felt more real for immigrant communities, as new policy changes have made undocumented workers more vulnerable to deportation than ever, separating families and taking away their primary sources of income. \nSince …",
    "link": "https://biztoc.com/x/41262b4f399e939e",
    "timestamp": "2025-07-09T18:52:11Z"
  },
  {
    "title": "Trump Signals Openness To Visiting Africa, Focuses On Trade",
    "description": "President Donald Trump told a group of West African leaders on Tuesday that he would like to visit Africa “at some point,” despite never traveling to the continent in an official capacity. \nSpeaking during a meeting with leaders from Gabon, Guinea-Bissau, Lib…",
    "link": "https://biztoc.com/x/d743a8cd74854795",
    "timestamp": "2025-07-09T18:52:08Z"
  },
  {
    "title": "This IRS move will pressure more preachers to praise Donald Trump",
    "description": "Then-President Donald Trump, from center, prays during an 'Evangelicals for Trump' Coalition launch event in Miami, on Jan. 3, 2020.",
    "link": "https://biztoc.com/x/c7ddac79387ca62e",
    "timestamp": "2025-07-09T18:51:53Z"
  },
  {
    "title": "Fed Minutes Show Committee Split Around Inflation Worries",
    "description": "The emerging divide among Federal Reserve officials over the outlook for interest rates is being driven largely by differing expectations for how tariffs might affect inflation, a record of policymakers’ most recent meeting showed.",
    "link": "https://www.ndtvprofit.com/global-economics/fed-minutes-show-committee-split-around-inflation-worries",
    "timestamp": "2025-07-09T18:51:15Z"
  },
  {
    "title": "Trump asks head of English-speaking country why he speaks 'such good English'",
    "description": "President Donald Trump praised Liberian President Joseph Boakai for speaking \"such good English,\" apparently unaware that it was the official language of his country.During a White House event with African leaders on Wednesday, Boakai noted that Liberia was a…",
    "link": "https://www.rawstory.com/trump-liberia/",
    "timestamp": "2025-07-09T18:50:02Z"
  },
  {
    "title": "Ex-FBI Director Comey and ex-CIA Director Brennan are under investigation by Trump Justice Department | CNN Politics",
    "description": "The FBI is investigating former CIA Director John Brennan and former FBI Director James Comey for possible false statements to Congress following a referral from the current CIA Director John Ratcliffe, according to a person briefed on the matter.",
    "link": "https://www.cnn.com/2025/07/09/politics/comey-brennan-ratcliffe-fbi-cia-referral",
    "timestamp": "2025-07-09T18:48:04Z"
  },
  {
    "title": "Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval",
    "description": "Thumzup's crypto expansion, despite financial losses, highlights a growing trend of Trump-affiliated ventures embracing digital assets.\nThe post Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval appeared first on Crypto Br…",
    "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-trump-investment/",
    "timestamp": "2025-07-09T18:45:12Z"
  },
  {
    "title": "Fox’s Doocy Confronts Trump With Belly Button Drone Strike Threat In WTF Moment",
    "description": "Fox News Senior White House correspondent Peter Doocy asked Trump about a threatened drone strike on his belly button in a surreal exchange at the White House.\nThe post Fox’s Doocy Confronts Trump With Belly Button Drone Strike Threat In WTF Moment first appe…",
    "link": "https://www.mediaite.com/media/news/foxs-doocy-confronts-trump-with-belly-button-drone-strike-threat-in-wtf-moment/",
    "timestamp": "2025-07-09T18:45:01Z"
  },
  {
    "title": "Trump seethes that Dems floating bill requiring the unmasking of ICE, CBP agents must 'hate' America",
    "description": "President Donald Trump criticizes Democratic senators for bill that would require federal immigration officers to have visible IDs and not wear face masks.",
    "link": "https://www.foxnews.com/politics/trump-seethes-dems-floating-bill-requiring-unmasking-ice-cbp-agents-must-hate-america",
    "timestamp": "2025-07-09T18:44:45Z"
  },
  {
    "title": "Why Democrat lawmakers who run Colorado are fleeing what they’ve created",
    "description": "'The bigger question is, what are the Democrats doing to make the place so unlivable?'",
    "link": "https://www.wnd.com/2025/07/why-democrat-lawmakers-who-run-colorado-are-fleeing/",
    "timestamp": "2025-07-09T18:43:25Z"
  },
  {
    "title": "Ted Cruz slammed for 'protecting Big Oil' while Texans are 'dead and grieving'",
    "description": "According to The Washington Post, the death count from the flash floods that ravaged central Texas over the 4th of July Weekend has reached 109. But 161 people are missing, which, the Post reports, is \"raising the possibility that the death toll could surpass…",
    "link": "https://www.rawstory.com/ted-cruz-2673042133/",
    "timestamp": "2025-07-09T18:41:48Z"
  },
  {
    "title": "Dem Rep. Gomez claims ICE is targeting ‘anybody that is brown’ in immigration raids",
    "description": "Rep. Jimmy Gomez, D-Calif., claimed Immigration and Customs Enforcement (ICE) officers are arresting anyone who is brown and \"looks like [him]\" on CNN Tuesday.",
    "link": "https://nypost.com/2025/07/09/us-news/dem-rep-gomez-claims-ice-is-targeting-anybody-that-is-brown/",
    "timestamp": "2025-07-09T18:41:18Z"
  },
  {
    "title": "After failing to strike trade deals, Trump tries to redefine ‘trade deals’",
    "description": "Donald Trump wants us to believe that “trade deals” and “failing to reach trade deals” mean the same thing, which is every bit as bonkers as it seems.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/strike-trade-deals-trump-tries-redefine-trade-deals-rcna217729",
    "timestamp": "2025-07-09T18:41:03Z"
  },
  {
    "title": "Mary Trump Issues Warning on Long-Term Impact of Donald Trump Move",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nMary Trump issued a warning about President Donald Trump's cuts to the civil service after the U.S. Supreme Court handed him a major win on Tuesday.\nNewsweek reached out to the White House and Mary Trump for c…",
    "link": "https://biztoc.com/x/c57cb1934c64c62f",
    "timestamp": "2025-07-09T18:40:51Z"
  },
  {
    "title": "US senators seek sanctions on El Salvador’s Nayib Bukele over Bitcoin misuse and human rights violations",
    "description": "A group of US Democratic senators has introduced a new bill to sanction El Salvador’s President Nayib Bukele and members of his administration. The legislation, titled the El Salvador Accountability Act (S.2058), was put forward by Senators Chris Van Hollen, …",
    "link": "https://cryptoslate.com/us-senators-seek-sanctions-on-el-salvadors-nayib-bukele-over-bitcoin-misuse-and-human-rights-violations/",
    "timestamp": "2025-07-09T18:38:47Z"
  },
  {
    "title": "The Court Comes to the Administration’s Rescue, Again",
    "description": "A distinct pattern has emerged—one that Trump surely appreciates.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/supreme-court-federal-workforce-layoffs/683470/",
    "timestamp": "2025-07-09T18:37:12Z"
  },
  {
    "title": "Charlamagne suggests ‘Big Beautiful Bill’ is sign that midterms and 2028 election will be ‘fixed’",
    "description": "Radio host Charlamagne Tha God suggested on Tuesday that the GOP-led \"Big, Beautiful Bill\" is so unpopular, President Donald Trump and Republicans must only be pushing it because they know the upcoming elections are rigged.",
    "link": "https://nypost.com/2025/07/09/media/charlamagne-suggests-big-beautiful-bill-is-sign-that-midterms-and-2028-election-will-be-fixed/",
    "timestamp": "2025-07-09T18:35:58Z"
  },
  {
    "title": "Mary Trump Issues Warning on Long-Term Impact of Donald Trump Move",
    "description": "The Trump administration is destroying \"institutional memory,\" the president's niece warned.",
    "link": "https://www.newsweek.com/mary-trump-warning-trump-cuts-civil-service-2096771",
    "timestamp": "2025-07-09T18:35:41Z"
  },
  {
    "title": "Ex-DOGE official rushed Trump‑backed GHF grant despite staff warnings",
    "description": "The official waived safeguards to fast-track a $30m award to the highly criticised Gaza aid group.",
    "link": "https://www.aljazeera.com/news/2025/7/9/ex-doge-official-rushed-trump%e2%80%91backed-ghf-grant-despite-staff-warnings",
    "timestamp": "2025-07-09T18:35:34Z"
  },
  {
    "title": "8 million student-loan borrowers enrolled in Biden's affordable repayment plan are about to see their balances grow again",
    "description": "Trump's Department of Education is restarting interest charges for student-loan borrowers enrolled in the SAVE plan, which has been blocked in court.",
    "link": "https://www.businessinsider.com/save-plan-student-loan-borrowers-when-does-interest-restart-trump-2025-7",
    "timestamp": "2025-07-09T18:33:39Z"
  },
  {
    "title": "Trump’s Commerce Sec Will Get Rich Off Budget Cuts to Weather Service",
    "description": "At least one person in the Trump administration stands to make a fortune at the National Weather Service’s deathbed.Commerce Secretary Howard Lutnick oversees the National Oceanic and Atmospheric Administration and its subsidiary, the National Weather Service…",
    "link": "https://newrepublic.com/post/197750/donald-trump-commerce-secretary-howard-lutnick-budget-cuts-weather-service",
    "timestamp": "2025-07-09T18:33:39Z"
  },
  {
    "title": "Trump Ally Compares Crypto Industry Writing Its Own Rules to Spilled 'Urine Sample'",
    "description": "John Kennedy (R-LA) and other senators raised concerns about crypto market structure legislation during a Senate hearing Wednesday.",
    "link": "https://decrypt.co/329397/trump-ally-crypto-industry-regulation-spilled-urine-sample",
    "timestamp": "2025-07-09T18:32:14Z"
  },
  {
    "title": "Trump administration sues California over transgender athlete policies",
    "description": "The lawsuit says California’s transgender athlete policies violate Title IX.",
    "link": "https://www.bostonherald.com/2025/07/09/california-transgender-athletes-trump-lawsuit/",
    "timestamp": "2025-07-09T18:30:23Z"
  },
  {
    "title": "Trump Touts US Trade Deals With China, India",
    "description": "President Donald Trump unveiled the first in a wave of promised letters that threaten to impose higher tariff rates on key trading partners, but suggested that he was still open to additional negotiations and pushed off increased duties until at least Aug. 1.…",
    "link": "https://biztoc.com/x/d67565759aebad1c",
    "timestamp": "2025-07-09T18:29:58Z"
  },
  {
    "title": "Trump Says BRICS Members Will Get Additional 10% Tariffs Over De-Dollarization Attempt",
    "description": "Trump Says BRICS Members Will Get Additional 10% Tariffs Over De-Dollarization Attempt\n \nAuthored by Lily Zhou via The Epoch Times,\nPresident Donald Trump on Tuesday reiterated a previous warning to BRICS nations that he would be imposing an additional 10 per…",
    "link": "https://biztoc.com/x/fcd6c18011a619d5",
    "timestamp": "2025-07-09T18:29:48Z"
  },
  {
    "title": "Justice Department sues California over transgender athlete policies",
    "description": "The Trump administration sued California for allegedly violating federal law with policies that allow trans student athletes to compete on school sports teams that align with their gender identities.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/justice-department-sues-california-transgender-athlete-policies-rcna217758",
    "timestamp": "2025-07-09T18:28:45Z"
  },
  {
    "title": "Doocy Asks Trump Point-Blank If He Wants To See John Brennan, James Comey ‘Behind Bars’",
    "description": "Fox's Peter Doocy asked President Donald Trump on Wednesday whether he wants to see former FBI director James Comey and former CIA John Brennan \"behind bars.\"",
    "link": "https://dailycaller.com/2025/07/09/doocy-trump-john-brennan-james-comey/",
    "timestamp": "2025-07-09T18:27:47Z"
  },
  {
    "title": "Open to supply products to US market from multiple sites, India based on tariff outcomes: Samsung",
    "description": "Samsung is closely monitoring US trade policy under the Trump administration and is prepared to shift production to India and other locations to maintain price and business stability. Amid high uncertainty, the company has diversified manufacturing, strengthe…",
    "link": "https://economictimes.indiatimes.com/tech/technology/open-to-supply-products-to-us-market-from-multiple-sites-india-based-on-tariff-outcomes-samsung/articleshow/122349220.cms",
    "timestamp": "2025-07-09T18:26:35Z"
  },
  {
    "title": "Trump needs to act fast as Houthis launch killing spree, attacking and sinking ships in the Red Sea",
    "description": "Iran-backed Houthi rebels initiate deadly attacks on commercial shipping in the Red Sea, prompting calls for swift action from the Trump administration. This article covers the latest developments, including a violent assault on the Eternity cargo ship leadin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-needs-to-act-fast-as-houthis-launch-killing-spree-attacking-and-sinking-ships-in-the-red-sea-donald-trump-news-red-sea-conflict-news-houthis-rebel-news/articleshow/122348798.cms",
    "timestamp": "2025-07-09T18:26:05Z"
  },
  {
    "title": "White House hosts West African leaders to discuss trade and development",
    "description": "Talks come as US shifts focus from aid to building sustainable economic partnerships.",
    "link": "https://www.aljazeera.com/news/2025/7/9/white-house-hosts-west-african-leaders-to-discuss-trade-and-development",
    "timestamp": "2025-07-09T18:25:29Z"
  },
  {
    "title": "Volkswagen reports electric vehicles sales surge in 2025",
    "description": "The Volkswagen Group reported an almost 50% surge in electric vehicles sold worldwide, with total global deliveries also up over 1%",
    "link": "https://www.dw.com/en/volkswagen-reports-electric-vehicles-sales-surge-in-2025/a-73217228",
    "timestamp": "2025-07-09T18:25:00Z"
  },
  {
    "title": "OpenAI’s Sam Altman bashes Democrats. Here’s why he says he’s 'politically homeless'",
    "description": "Sam Altman's rightward shift has seemingly begun as he announces he's leaving the Democratic Party shortly after cozying up to Donald Trump's administration.",
    "link": "https://www.advocate.com/news/sam-altman-leaves-democratic-party",
    "timestamp": "2025-07-09T18:24:40Z"
  },
  {
    "title": "Green New Deal Democrat Spars With Trump’s Weather-Related Nominees",
    "description": "In the wake of the recent Texas flash flooding that has claimed at least 119 lives and left scores of others still missing, two of... Read More\nThe post Green New Deal Democrat Spars With Trump’s Weather-Related Nominees appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/09/green-new-deal-democrat-spars-with-trumps-weather-related-nominees/",
    "timestamp": "2025-07-09T18:24:12Z"
  },
  {
    "title": "Trump Spox Calls Stacey Abrams 'Stupid' For Sounding Alarm On Authoritarianism",
    "description": "White House press secretary Karoline Leavitt got heated during a rant about the Georgia Democrat.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-stupid-stacey-abrams-authoritarianism-comment_n_686e9594e4b07e11dd9a467a",
    "timestamp": "2025-07-09T18:22:17Z"
  },
  {
    "title": "Trump Asked About Not Knowing Who Paused Ukraine Weapons: 'I Would Know'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump was asked by a reporter on Wednesday why he doesn't know who in his administration gave the order to pause some U.S. weapons shipments to Ukraine last week.\nThe Context\nTrump was pressed…",
    "link": "https://biztoc.com/x/ee372ada433055d5",
    "timestamp": "2025-07-09T18:18:55Z"
  }
]