[
  {
    "title": "The Atlantic’s Jemele Hill Says She’s ‘Insulted’ That Charlie Kirk’s ‘White Supremacist’ Beliefs Are Being Reduced to a ‘Difference of Opinion’",
    "description": "The Atlantic's Jemele Hill blasted Charlie Kirk as a white supremacist whose \"influence was dangerous\" and said the outpouring of support for him was insulting.\nThe post The Atlantic’s Jemele Hill Says She’s ‘Insulted’ That Charlie Kirk’s ‘White Supremacist’ …",
    "link": "https://www.mediaite.com/media/the-atlantics-jemele-hill-says-shes-insulted-that-charlie-kirks-white-supremacist-beliefs-are-being-reduced-to-a-difference-of-opinion/",
    "timestamp": "2025-09-14T20:51:12Z"
  },
  {
    "title": "Trump administration moves forward with push to fire Fed governor Lisa Cook | CNN Business",
    "description": "The Trump administration on Sunday renewed its request to a federal appeals court to fire Lisa Cook, a Federal Reserve governor who has faced political scrutiny in recent weeks.",
    "link": "https://www.cnn.com/2025/09/14/business/trump-lisa-cook-fed-appeal",
    "timestamp": "2025-09-14T20:50:56Z"
  },
  {
    "title": "US, Chinese officials wrap Spain talks on trade irritants, TikTok deadline",
    "description": "MADRID: US and Chinese delegations have wrapped up their Sunday (Sep 14) meeting to discuss tariffs, TikTok and the economy held in Madrid, and plan to resume talks on Monday, a US government official told Reuters.US Treasury Secretary Scott Bessent and Chine…",
    "link": "https://www.channelnewsasia.com/world/us-chinese-officials-wrap-spain-talks-trade-irritants-tiktok-deadline-5348521",
    "timestamp": "2025-09-14T20:49:12Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "President Donald Trump's administration has renewed its request to fire Lisa Cook from the Federal Reserve’s board of governors.",
    "link": "https://www.news4jax.com/news/politics/2025/09/14/trump-administration-renews-push-to-fire-fed-governor-lisa-cook-ahead-of-key-vote/",
    "timestamp": "2025-09-14T20:45:26Z"
  },
  {
    "title": "Unmasking 'Luna': Radar Uncovers the Online Profiles of the Alleged Lover of Suspected Charlie Kirk Assassin to Reveal Their Secret Drug Past, Hatred of Donald Trump and Praise of 'Riding With Biden'",
    "description": "The transgender 'partner' of Charlie Kirk's alleged shooter shared a post online appearing to show support for President Joe Biden.",
    "link": "https://radaronline.com/p/charlie-kirk-assassination-tyler-robinson-roommate-luna-transgender-donald-trump-joe-biden/",
    "timestamp": "2025-09-14T20:45:00Z"
  },
  {
    "title": "Alleged Kirk shooter Tyler Robinson 'not cooperating' with authorities",
    "description": "Investigators are working to piece together why Tyler Robinson allegedly scaled a rooftop at Utah Valley University during an outdoor event and shot Mr Kirk in the neck at long range.",
    "link": "https://www.abc.net.au/news/2025-09-15/charlie-kirk-shooting-suspect-not-cooperating-with-authorities/105772848",
    "timestamp": "2025-09-14T20:35:17Z"
  },
  {
    "title": "Donald Trump Lauds Economic Success, Yet Public Sentiment Tells A Different Story",
    "description": "The U.S. economy, despite being hailed as robust by President Donald Trump, has failed to win over the American voters.\nPresident Trump has been enthusiastically promoting the economic progress, pointing to a swift growth in the second quarter, decreasing gas…",
    "link": "https://biztoc.com/x/2b367bccf2fad15f",
    "timestamp": "2025-09-14T20:29:56Z"
  },
  {
    "title": "National Guard Deployment Planned For Memphis, Says Trump",
    "description": "National Guard Deployment Planned For Memphis, Says Trump\n \nAuthored by Savannah Hulsey Pointer via The Epoch Times (emphasis ours),\nPresident Donald Trump announced that the National Guard would be heading to Memphis to deal with crime.\nArmed National Guard …",
    "link": "https://biztoc.com/x/11ec0b0ab3747f48",
    "timestamp": "2025-09-14T20:29:03Z"
  },
  {
    "title": "Donald Trump Lauds Economic Success, Yet Public Sentiment Tells A Different Story",
    "description": "The U.S. economy, despite being hailed as robust by President Donald Trump, has failed to win over the American voters. President Trump has been...",
    "link": "https://finance.yahoo.com/news/donald-trump-lauds-economic-success-202301837.html",
    "timestamp": "2025-09-14T20:23:01Z"
  },
  {
    "title": "BREAKING: Investigation into Charlie Kirk Assassination Attempt Widens to Probe Radical Pro-Trans Online Groups, Including on Steam",
    "description": "The investigation into the attempted assassination of conservative activist Charlie Kirk has expanded to scrutinize pro-trans online communities, including the Steam group that The Gateway Pundit reported on early Sunday morning, to determine if others were a…",
    "link": "https://www.thegatewaypundit.com/2025/09/breaking-investigation-charlie-kirk-assassination-attempt-widens-probe/",
    "timestamp": "2025-09-14T20:20:14Z"
  },
  {
    "title": "Just days before the Fed meeting, Trump continues push to oust Lisa Cook despite new evidence that undermines his claims",
    "description": "President Donald Trump’s administration renewed its request Sunday for a federal appeals court to let him fire Lisa Cook from the Federal Reserve’s board of governors, a move the president is seeking ahead of the central bank’s vote on interest rates.\nThe Tru…",
    "link": "https://biztoc.com/x/7a4bf76aa507d086",
    "timestamp": "2025-09-14T20:18:06Z"
  },
  {
    "title": "Just days before the Fed meeting, Trump continues push to oust Lisa Cook despite new evidence that undermines his claims",
    "description": "Sunday’s filing is the latest step in an unprecedented effort by the White House to shape the historically independent Fed.",
    "link": "https://fortune.com/2025/09/14/fed-meeting-trump-appeals-court-lisa-cook-second-home/",
    "timestamp": "2025-09-14T20:08:35Z"
  },
  {
    "title": "Venezuela says U.S. warship raided a tuna boat as tensions rise in the Caribbean",
    "description": "Personnel from a U.S. warship boarded a Venezuelan tuna boat with nine fishermen while it was sailing in Venezuelan waters, Venezuela’s foreign minister said on Saturday, underlining strained relations with the United States.",
    "link": "https://www.pbs.org/newshour/world/venezuela-says-u-s-warship-raided-a-tuna-boat-as-tensions-rise-in-the-caribbean",
    "timestamp": "2025-09-14T20:07:08Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "President Donald Trump's administration has renewed its request to fire Lisa Cook from the Federal Reserve’s board of governors",
    "link": "https://abcnews.go.com/Business/wireStory/trump-administration-renews-push-fire-fed-governor-lisa-125560507",
    "timestamp": "2025-09-14T20:06:27Z"
  },
  {
    "title": "Eric Trump Fuels Rhetoric Blaming The Left For Charlie Kirk's Murder",
    "description": "President Donald Trump's son also blamed the left for trying to \"take down\" his father.",
    "link": "https://www.huffpost.com/entry/eric-trump-fuels-rhetoric-blame-for-charlie-kirk-murder_n_68c6ff28e4b0539d2b98e151",
    "timestamp": "2025-09-14T20:05:51Z"
  },
  {
    "title": "IDF Eliminates Several Hamas Commanders as Gaza City Offensive Unfolds",
    "description": "U.S.-Israel alliance \"durable as stones of Western Wall,\" Netanyahu tells Rubio on his first official visit to Israel.\nThe post IDF Eliminates Several Hamas Commanders as Gaza City Offensive Unfolds first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/idf-eliminates-several-hamas-commanders-as-gaza-city-offensive-unfolds/",
    "timestamp": "2025-09-14T20:00:55Z"
  },
  {
    "title": "Trump ‘Ready’ to Impose Additional Sanctions on Russia — But Only on Certain Conditions",
    "description": "President Trump has announced that he is prepared to sanction Russia, but only if every NATO ally stops importing Russian oil and introduces matching penalties of their own.\nThe post Trump ‘Ready’ to Impose Additional Sanctions on Russia — But Only on Certain…",
    "link": "https://www.thegatewaypundit.com/2025/09/trump-ready-impose-additional-sanctions-russia-only-certain/",
    "timestamp": "2025-09-14T20:00:40Z"
  },
  {
    "title": "WATCH: Anti-Trump historian claims with straight face left-wingers were not ‘celebrating’ Charlie Kirk assassination",
    "description": "'I didn't see that absolutely anywhere and I was online significantly that day'",
    "link": "https://www.wnd.com/2025/09/watch-anti-trump-historian-claims-straight-face-left/",
    "timestamp": "2025-09-14T20:00:02Z"
  },
  {
    "title": "Robert Reich Doc ‘The Last Class’ Tops $600k In Week 12 Of Surprising Theatrical Run – Specialty Box Office",
    "description": "In a complex indie market things do pop and The Last Class, a documentary released in two theaters for limited runs on June 27, passed $610k this weekend, according to distributor Abramorama. The documentary is pegged to social media star, academic and former…",
    "link": "http://deadline.com/2025/09/indie-film-box-office-robert-reich-documnetary-the-last-class-1236531273/",
    "timestamp": "2025-09-14T19:50:07Z"
  },
  {
    "title": "Trump administration seeks $58 million security boost after Charlie Kirk assassination",
    "description": "The Trump administration is asking Congress to approve an additional $58 million for security to protect the executive and judicial branches following the assassination of Charlie Kirk, a leadership aide confirmed to NBC News on Sunday",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-seeks-58-million-security-boost-charlie-kirk-rcna231150",
    "timestamp": "2025-09-14T19:43:17Z"
  },
  {
    "title": "Charlie Kirk shooting suspect not co-operating with authorities, Utah governor says",
    "description": "‘All the people around’ suspect Tyler Robinson  are co-operating, says governor Spencer Cox",
    "link": "https://www.irishtimes.com/world/us/2025/09/14/charlie-kirk-shooting-suspect-not-co-operating-with-authorities-utah-governor-says/",
    "timestamp": "2025-09-14T19:41:16Z"
  },
  {
    "title": "Charlie Kirk’s Final Message to Noem Before Assassination Called for Accountability Over Urban Crime",
    "description": "The last thing Charlie Kirk texted Homeland Security Secretary Kristi Noem a few days before his assassination was about how he wanted the mayors and... Read More\nThe post Charlie Kirk’s Final Message to Noem Before Assassination Called for Accountability Ove…",
    "link": "https://www.dailysignal.com/2025/09/14/charlie-kirks-final-message-noem-before-assassination-called-accountability-over-urban-crime/",
    "timestamp": "2025-09-14T19:37:15Z"
  },
  {
    "title": "Inside elite Ivy League prep for the ultrawealthy: $30K semesters, hand-picked internships, and custom-built résumés",
    "description": "A former Ivy League admissions officer reveals how the ultrawealthy craft résumés and experiences to boost their kids' chances.",
    "link": "https://www.businessinsider.com/inside-ivy-league-prep-ultrawealthy-30k-schools-and-resumes-2025-9",
    "timestamp": "2025-09-14T19:31:01Z"
  },
  {
    "title": "Anti-Trump Historian Claims With Straight Face Left Wing Wasn’t ‘Celebrating’ Charlie Kirk Assassination",
    "description": "Historian Heather Cox Richardson claimed during a podcast that liberals didn’t celebrate the assassination of Turning Point USA founder and CEO Charlie Kirk.",
    "link": "https://dailycaller.com/2025/09/14/heather-cox-richardson-left-wing-celebrating-charlie-kirk-assassination/",
    "timestamp": "2025-09-14T19:30:15Z"
  },
  {
    "title": "Trump Doesn't Want to Frighten Off Foreign Investment In the U.S",
    "description": "8 min ago\nTrump Doesn't Want to Frighten Off Foreign Investment In the U.S.\nPresident Donald Trump says he doesn't want to frighten away foreign investment in the U.S. Some have questioned whether the administration's immigration policies have done just that.…",
    "link": "https://biztoc.com/x/8b5c27bf9e32e953",
    "timestamp": "2025-09-14T19:29:46Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "President Donald Trump's administration has renewed its request to fire Lisa Cook from the Federal Reserve’s board of governors.",
    "link": "https://www.ksat.com/news/politics/2025/09/14/trump-administration-renews-push-to-fire-fed-governor-lisa-cook-ahead-of-key-vote/",
    "timestamp": "2025-09-14T19:25:55Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "President Donald Trump’s administration renewed its request Sunday for a federal appeals court to let him fire Lisa Cook from the Federal Reserve’s board of ...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-renews-push-fire-192041983.html",
    "timestamp": "2025-09-14T19:20:41Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "President Donald Trump’s administration renewed its request Sunday for a federal appeals court to let him fire Lisa Cook from the Federal Reserve’s board of ...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-renews-push-fire-192041538.html",
    "timestamp": "2025-09-14T19:20:41Z"
  },
  {
    "title": "Trump Riffs About Charlie Kirk Shooting at His Golf Club — Expresses Sympathy for Suspect’s ‘Very Nice’ Parents: ‘Boy, That’s a Tough Deal’",
    "description": "President Donald Trump said the young man who shot and killed conservative influencer Charlie Kirk had been “totally radicalized” and made “crazy” by liberal ideology, and also expressed sympathy for the suspect assassin’s parents, saying they seemed like “ve…",
    "link": "https://www.mediaite.com/media/news/trump-riffs-about-charlie-kirk-shooting-at-his-golf-club-expresses-sympathy-for-suspects-very-nice-parents-boy-thats-a-tough-deal/",
    "timestamp": "2025-09-14T19:08:16Z"
  },
  {
    "title": "US-China Talks Head Into Second Day With Trade, TikTok on Agenda",
    "description": "A US delegation helmed by Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer and a Chinese group led by Vice Premier He Lifeng met for ...",
    "link": "https://finance.yahoo.com/news/us-china-officials-kick-off-130545578.html",
    "timestamp": "2025-09-14T19:06:20Z"
  },
  {
    "title": "Eleventh Circuit Hears Appeal in AutoKeyCard Case Involving CRS Firearms",
    "description": "The Eleventh Circuit just heard arguments in the controversial CRS Firearms AutoKeyCard case. We break down what happened—and what could happen next.\nThe post Eleventh Circuit Hears Appeal in AutoKeyCard Case Involving CRS Firearms appeared first on The Truth…",
    "link": "https://www.thetruthaboutguns.com/crs-firearms-autokeycard-appeal-eleventh-circuit/",
    "timestamp": "2025-09-14T19:00:00Z"
  },
  {
    "title": "Markets Gear Up for Series of Fed Cuts With Bullish Bets at Risk",
    "description": "A quarter-point reduction is seen as a sure thing when the Fed announces its policy decision Wednesday, with a small potential for a half-point move amid...",
    "link": "https://finance.yahoo.com/news/markets-gear-series-fed-cuts-190000672.html",
    "timestamp": "2025-09-14T19:00:00Z"
  },
  {
    "title": "Trump backs foreign expertise to train US workers",
    "description": "United States President Donald Trump said on Sunday that foreign companies investing in the US should bring their own experts temporarily in order to train the country's workers to build \"unique and c...",
    "link": "https://biztoc.com/x/8b72b7189ae330f5",
    "timestamp": "2025-09-14T18:59:25Z"
  },
  {
    "title": "Fetterman: Democrats Should Stop Calling Trump an Autocrat",
    "description": "Sunday on CNN's \"Inside Politics,\" Sen. John Fetterman said his fellow Democrats needed to stop saying President Donald Trump was acting like an authoritarian ruler because he was elected.\nThe post Fetterman: Democrats Should Stop Calling Trump an Autocrat ap…",
    "link": "https://www.breitbart.com/clips/2025/09/14/fetterman-democrats-should-stop-calling-trump-an-autocrat/",
    "timestamp": "2025-09-14T18:57:19Z"
  },
  {
    "title": "Jasmine Crockett: ICE Is Acting like 'Slave Patrols'",
    "description": "Sunday on MSNBC’s \"Velshi,\" Rep. Jasmine Crockett (D-TX) said Immigration and Customs Enforcement (ICE) officers were acting like \"slave patrols.\"\nThe post Jasmine Crockett: ICE Is Acting like ‘Slave Patrols’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/09/14/jasmine-crockett-ice-is-acting-like-slave-patrols/",
    "timestamp": "2025-09-14T18:55:17Z"
  },
  {
    "title": "With Trump eyeing space station demise, NASA pushes for commercial replacements",
    "description": "ORLANDO, Fla. — President Donald Trump and his new interim head of NASA Sean Duffy are pushing for a renewed effort to shuffle off the responsibility of running the International Space Station in favor of becoming a customer of a commercial space station prov…",
    "link": "https://biztoc.com/x/9e11d194a0f91a0c",
    "timestamp": "2025-09-14T18:48:24Z"
  },
  {
    "title": "With Trump eyeing space station demise, NASA pushes for commercial replacements",
    "description": "President Donald Trump and his new interim head of NASA Sean Duffy are pushing for a renewed effort to shuffle off the responsibility of running the International Space Station in favor of becoming a customer of a commercial space station provider instead.",
    "link": "https://www.bostonherald.com/2025/09/14/with-trump-eyeing-space-station-demise-nasa-pushes-for-commercial-replacements/",
    "timestamp": "2025-09-14T18:46:51Z"
  },
  {
    "title": "Fetterman says Democrats have 'forgotten why we lost' and Trump is 'not an autocrat' (Alison Main/CNN)",
    "description": "Alison Main / CNN:\nFetterman says Democrats have ‘forgotten why we lost’ and Trump is ‘not an autocrat’  —  Democratic Sen. John Fetterman has a warning for his party: learn from the politically charged whirlwind that put Donald Trump back in the White House …",
    "link": "https://www.memeorandum.com/250914/p56",
    "timestamp": "2025-09-14T18:45:00Z"
  },
  {
    "title": "Trump says he doesn't want to 'frighten off' foreign companies after raid on Hyundai",
    "description": "President Donald Trump tried to do damage control after the Department of Homeland Security raided a Hyundai plant in Georgia and detained hundreds of workers with legal visas.\"When Foreign Companies who are building extremely complex products, machines, and …",
    "link": "https://www.rawstory.com/trump-foreign-workers-hyundai/",
    "timestamp": "2025-09-14T18:43:58Z"
  },
  {
    "title": "Australia has a carbon 'budget'. It's due to be spent by 2036",
    "description": "Unless Australia lifts its ambitions, its \"fair share\" of carbon emissions will be spent 14 years early. With the government announcing a 2035 climate target this week, there is intense debate on how high the government should aim — and whether it will be eno…",
    "link": "https://www.abc.net.au/news/2025-09-15/australia-carbon-budget-2035-emissions-target/105341080",
    "timestamp": "2025-09-14T18:43:51Z"
  },
  {
    "title": "Trump ending $350 million grants for ‘Hispanic-serving institutions’",
    "description": "Race-based program determined to be discriminatory, and in violation of Constitution",
    "link": "https://www.wnd.com/2025/09/trump-ending-350-million-grants-hispanic-serving-institutions/",
    "timestamp": "2025-09-14T18:37:05Z"
  },
  {
    "title": "That Fox Anchor’s Long History Of Having to Apologize For Awful Remarks",
    "description": "In yet another example of right-wingers calling for violence, a Fox News anchor this week suggested homeless people with mental illnesses should be killed. And while the anchor, Fox and Friends co-host Brian Kilmeade, has already apologized, a closer look at …",
    "link": "https://www.motherjones.com/politics/2025/09/that-fox-news-anchor-kilmeade-homeless/",
    "timestamp": "2025-09-14T18:36:52Z"
  },
  {
    "title": "The Biden Admin Smeared Charlie Kirk As A Violent Extremist — Now They Must Be Held Accountable",
    "description": "The Biden administration funneled tax dollars to groups that lumped in Kirk's organization, Turning Point USA, with neo-Nazis and other political extremists.",
    "link": "https://dailycaller.com/2025/09/14/joe-biden-administration-charlie-kirk-turning-point-usa-extremism-censorship-accountability/",
    "timestamp": "2025-09-14T18:36:13Z"
  },
  {
    "title": "BlackRock unveils £500 million bet on UK data centers",
    "description": "BlackRock Inc. is set to invest up to £500 million in the UK's data center market, coinciding with CEO Larry Fink's participation in President Trump's state visit. The asset manager has acquired a west London site to launch Digital Gravity Partners, focusing …",
    "link": "https://economictimes.indiatimes.com/news/international/business/blackrock-unveils-500-million-bet-on-uk-data-centers/articleshow/123886393.cms",
    "timestamp": "2025-09-14T18:34:26Z"
  },
  {
    "title": "FBI Director Under Fire After ‘Amateur Hour’ Mistake In Charlie Kirk Case As Calls To Quit Grow Louder",
    "description": "“The subject in custody has been released after an interrogation by law enforcement.\"",
    "link": "https://www.boredpanda.com/fbi-chief-faces-pressure-to-quit-after-mistake-during-manhunt/",
    "timestamp": "2025-09-14T18:34:21Z"
  },
  {
    "title": "Fyodor Lukyanov: France is only the front line in a crisis gripping the G7",
    "description": "The G7’s political systems are entering a moment of truth Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624651-fyodor-lukyanov-france-g7/",
    "timestamp": "2025-09-14T18:33:17Z"
  },
  {
    "title": "Barron Trump’s Unexpected College Decision Sparks Buzz About His Future With Dad Donald",
    "description": "As many know by now, US President Donald Trump and First Lady Melania Trump’s son Barron Trump is a student at NYU. However, many realized that Barron had...",
    "link": "https://www.sheknows.com/parenting/articles/1234923903/barron-trump-nyu-dc-decision-insiders/",
    "timestamp": "2025-09-14T18:32:52Z"
  },
  {
    "title": "Lexus Still Supporting LGBT Activist Group Despite Its Parent Company Saying Otherwise",
    "description": "Lexus has apparently continued supporting LGBT activist group the HRC despite its parent company retreating from sponsoring similar initiatives last year.",
    "link": "https://dailycaller.com/2025/09/14/lexus-toyota-human-rights-coalition-dei/",
    "timestamp": "2025-09-14T18:32:44Z"
  },
  {
    "title": "‘We Don’t Know Sh*t, Ben!’ Bill Maher Accuses Ben Shapiro Of Jumping to Conclusions On Kirk Shooter in Heated Debate",
    "description": "Bill Maher stopped Ben Shapiro cold as the Daily Wire founder tried to speculate on the shooter's political motives for assassinating Charlie Kirk.\nThe post ‘We Don’t Know Sh*t, Ben!’ Bill Maher Accuses Ben Shapiro Of Jumping to Conclusions On Kirk Shooter in…",
    "link": "https://www.mediaite.com/media/news/we-dont-know-sht-ben-bill-maher-accuses-ben-shapiro-of-jumping-to-conclusions-on-kirk-shooter-in-heated-debate/",
    "timestamp": "2025-09-14T18:25:22Z"
  },
  {
    "title": "Trump spiritual adviser: Charlie Kirk's murder is part of God's plan",
    "description": "Pastor Paula White-Cain, a longtime spiritual adviser to President Donald Trump, argued that the murder of MAGA influencer Charlie Kirk was part of God's plan.During a Sunday interview on Newsmax, White-Cain said she had known Kirk for over a decade.\"Charlie …",
    "link": "https://www.rawstory.com/paula-white-cain-charlie-kirk/",
    "timestamp": "2025-09-14T18:24:07Z"
  },
  {
    "title": "Coldplay pauses concert for Charlie Kirk, asks fans to 'send love' to activist's family",
    "description": "Coldplay honored Charlie Kirk and his family during their Wembley Stadium concert, with Chris Martin encouraging the audience to send love into the world.",
    "link": "https://www.foxnews.com/entertainment/coldplay-pauses-concert-charlie-kirk-asks-fans-send-love-activists-family",
    "timestamp": "2025-09-14T18:22:09Z"
  },
  {
    "title": "Coldplay honors Charlie Kirk family at Wembley Stadium concert tribute",
    "description": "Coldplay honored Charlie Kirk and his family during their Wembley Stadium concert, with Chris Martin encouraging the audience to send love into the world.",
    "link": "https://www.foxnews.com/entertainment/coldplay-asks-fans-send-love-charlie-kirks-family-during-concert",
    "timestamp": "2025-09-14T18:22:09Z"
  },
  {
    "title": "Boosted by summits in Alaska and China, Putin moves against Europe, Ukraine (Washington Post)",
    "description": "Washington Post:\nBoosted by summits in Alaska and China, Putin moves against Europe, Ukraine  —  Russia has been emboldened in its strategy of splitting the U.S. from Europe while pushing ever harder to gain a military victory in Ukraine.  —  Since President …",
    "link": "https://www.memeorandum.com/250914/p53",
    "timestamp": "2025-09-14T18:20:01Z"
  },
  {
    "title": "Bolsonaro conviction ‘not a witch hunt,’ Lula tells Trump in NYT op-ed",
    "description": "Brazilian President Luiz Inacio Lula da Silva pushed back Sunday against harsh US criticism of the conviction this week of his far-right predecessor Jair Bolsonaro on coup charges. In his first public reaction to Bolsonaro’s conviction, Lula wrote in a New Yo…",
    "link": "https://www.digitaljournal.com/world/bolsonaro-conviction-not-a-witch-hunt-lula-tells-trump-in-nyt-op-ed/article",
    "timestamp": "2025-09-14T18:17:20Z"
  },
  {
    "title": "Bolsonaro Conviction 'Not A Witch Hunt,' Lula Tells Trump In NYT Op-ed",
    "description": "Brazilian President Luiz Inacio Lula da Silva pushed back Sunday against harsh US criticism of the conviction this week of his far-right predecessor Jair Bolsonaro on coup charges.",
    "link": "https://www.ibtimes.com/bolsonaro-conviction-not-witch-hunt-lula-tells-trump-nyt-op-ed-3783324",
    "timestamp": "2025-09-14T18:15:24Z"
  },
  {
    "title": "Bolsonaro conviction 'not a witch hunt,' Lula tells Trump in NYT op-ed",
    "description": "Brazilian President Luiz Inacio Lula da Silva pushed back Sunday against harsh US criticism of the conviction this week of his far-right predecessor Jair...",
    "link": "https://www.yahoo.com/news/articles/bolsonaro-conviction-not-witch-hunt-181354720.html",
    "timestamp": "2025-09-14T18:13:54Z"
  },
  {
    "title": "Bob Vylan appear to mock killing of Charlie Kirk",
    "description": "Punk performers Bob Vylan appear to have mocked the killing of Charlie Kirk in a performance in Amsterdam.",
    "link": "https://www.independent.ie/world-news/bob-vylan-appear-to-mock-killing-of-charlie-kirk/a724338503.html",
    "timestamp": "2025-09-14T18:09:50Z"
  },
  {
    "title": "Marco Rubio arrives in Israel to talk Hamas war, address tension among Middle East allies",
    "description": "U.S. Secretary of State is in Israel to discuss the war against Hamas and the country's targeted strike on Hamas terrorists in Qatar.",
    "link": "https://nationalpost.com/news/world/rubio-israel-hamas-middle-east-tension",
    "timestamp": "2025-09-14T18:09:47Z"
  },
  {
    "title": "Charlie Kirk's Alleged Killer, 22, Exchanged Jokey Messages on Discord with Friends During Manhunt: Report",
    "description": "A new report from 'The New York Times' reveals a glimpse into Tyler Robinson's demeanor via Discord messages that were allegedly sent by him, just hours...",
    "link": "https://people.com/charlie-kirks-alleged-killer-exchanged-jokey-messages-with-friends-during-manhunt-report-11809608",
    "timestamp": "2025-09-14T18:08:50Z"
  },
  {
    "title": "Odd bedfellows: LGBT groups and pro-gun orgs blast gun ban",
    "description": "DOJ looking into how to 'ensure that mentally ill individuals suffering from gender dysphoria are unable to obtain firearms while they are unstable and unwell'",
    "link": "https://www.wnd.com/2025/09/odd-bedfellows-lgbt-groups-pro-gun-orgs-blast/",
    "timestamp": "2025-09-14T18:07:54Z"
  },
  {
    "title": "Supporters of slain US activist Charlie Kirk shut down critics",
    "description": "Following Charlie Kirk's assassination, a wave of online vitriol and real-world repercussions has emerged, deepening political divides. Critics of the conservative activist have faced swift condemnation and professional consequences, including job losses and …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/supporters-of-slain-us-activist-charlie-kirk-shut-down-critics/articleshow/123885842.cms",
    "timestamp": "2025-09-14T18:07:22Z"
  },
  {
    "title": "Fox News’s Howard Kurtz Signs Off After 12 Years Hosting MediaBuzz — Lauds Network for ‘Extraordinary Independence’",
    "description": "Fox News's Howard Kurtz thanked his fans, family, and his network for years of \"extraordinary independence\" as the host of MediaBuzz during his final sign-off\nThe post Fox News’s Howard Kurtz Signs Off After 12 Years Hosting MediaBuzz — Lauds Network for ‘Ext…",
    "link": "https://www.mediaite.com/media/fox-newss-howard-kurtz-signs-off-after-12-years-hosting-mediabuzz-lauds-network-for-extraordinary-independence/",
    "timestamp": "2025-09-14T18:07:10Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Sept. 7, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, House Speaker Mike Johnson and Sens. Chris Coons and James Lankford join Major Garrett.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-09-14-2025/",
    "timestamp": "2025-09-14T18:05:24Z"
  },
  {
    "title": "US Fed poised for first rate cut of 2025 as political tension mounts",
    "description": "The US Federal Reserve is likely to cut interest rates this week. This decision follows pressure from Donald Trump and concerns about political influence. A 25-basis-point cut is expected. Personnel disputes within the Federal Open Market Committee add drama.…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-fed-poised-for-first-rate-cut-of-2025-as-political-tension-mounts/articleshow/123885764.cms",
    "timestamp": "2025-09-14T18:04:03Z"
  },
  {
    "title": "Trump Amplifies TikTok Demanding Ban on 'Dishonest' Media Following Charlie Kirk Assassination",
    "description": "In the aftermath of Charlie Kirk‘s assassination, President Donald Trump has shown support for a TikTok video that advocates for the revival of a law to hold news organizations accountable for spreading misinformation.\nIn a post on Truth Social, Trump shared …",
    "link": "https://biztoc.com/x/f850c09c58dd5403",
    "timestamp": "2025-09-14T18:03:12Z"
  },
  {
    "title": "Gavin Newsom just tried to fix one of his biggest Achilles' heels (Politico)",
    "description": "Politico:\nGavin Newsom just tried to fix one of his biggest Achilles' heels … The energy package comes at a high point for Newsom: He's taken some early leads in 2028 presidential primary polls and is increasingly viewed as his party's top pugilist against Pr…",
    "link": "https://www.memeorandum.com/250914/p49",
    "timestamp": "2025-09-14T18:00:25Z"
  },
  {
    "title": "Seattle response to homelessness divides progressives in upcoming mayoral race",
    "description": "Progressive Seattle mayoral candidates Mayor Bruce Harrell and Katie Wilson offered different responses to the ongoing homelessness crisis in the city.",
    "link": "https://www.foxnews.com/media/seattle-response-homelessness-divides-progressives-upcoming-mayoral-race",
    "timestamp": "2025-09-14T18:00:11Z"
  },
  {
    "title": "Romania says Russian drone incursions pose ‘new challenge’ to Black Sea security",
    "description": "Country’s defence ministry condemns ‘irresponsible actions’ after drone entered its airspace at weekend",
    "link": "https://www.irishtimes.com/world/europe/2025/09/14/romania-says-russian-drone-incursions-pose-new-challenge-to-black-sea-security/",
    "timestamp": "2025-09-14T18:00:01Z"
  },
  {
    "title": "Britain will ‘never surrender flag’ to far-right protesters, Starmer says",
    "description": "‘People have a right to peaceful protest. It is core to our country’s values’",
    "link": "https://www.irishtimes.com/world/europe/2025/09/14/britain-will-never-surrender-flag-to-far-right-protesters-starmer-says/",
    "timestamp": "2025-09-14T18:00:01Z"
  },
  {
    "title": "Ukraine Launches Drone Barrage on Russian Oil Refinery",
    "description": "Ukrainian drones struck an oil refinery in northwest Russia on Saturday night.",
    "link": "https://www.newsweek.com/ukraine-launches-drone-barrage-russian-oil-refinery-2129629",
    "timestamp": "2025-09-14T17:59:56Z"
  },
  {
    "title": "'Gossipy Mean Girl' Trump privately insults 'off-putting' White House adviser: report",
    "description": "Donald Trump has reportedly been insulting his \"awkward\" White House adviser.Rolling Stone over the weekend dropped an in-depth piece on White House deputy chief of staff for policy Stephen Miller. As part of that reporting, the outlet noted that \"paranoid\" T…",
    "link": "https://www.rawstory.com/gossipy-mean-girl-trump-miller/",
    "timestamp": "2025-09-14T17:54:57Z"
  },
  {
    "title": "More Information on Charlie Kirk’s Shooter to Emerge, Utah Governor Says",
    "description": "Much more information about Charlie Kirk’s suspected assassin and the weapon used will be released Tuesday, Utah Gov. Spencer Cox said Sunday. “We’re collecting much... Read More\nThe post More Information on Charlie Kirk’s Shooter to Emerge, Utah Governor Say…",
    "link": "https://www.dailysignal.com/2025/09/14/more-information-charlie-kirks-shooter-emerge-utah-governor-says/",
    "timestamp": "2025-09-14T17:54:26Z"
  },
  {
    "title": "Analysis: Why Charlie Kirk’s killing could embolden more political violence",
    "description": "Kirk’s killing reflects a broader political impasse in the U.S., where a significant percentage of the population supports political violence of some form.",
    "link": "https://www.pbs.org/newshour/politics/analysis-why-charlie-kirks-killing-could-embolden-more-political-violence",
    "timestamp": "2025-09-14T17:54:19Z"
  },
  {
    "title": "Speaker Calls Out Rep. Ilhan Omar for ‘Playing Into This Characterization of Charlie Kirk That the Left Has Been Advancing’",
    "description": "Rep. Ilhan Omar‘s rhetoric on Charlie Kirk reflects the current mindset of the Left, with many of its members celebrating the assassination of the conservative... Read More\nThe post Speaker Calls Out Rep. Ilhan Omar for ‘Playing Into This Characterization of …",
    "link": "https://www.dailysignal.com/2025/09/14/house-speaker-blasts-omar-for-celebrating-kirk-death/",
    "timestamp": "2025-09-14T17:53:08Z"
  },
  {
    "title": "Rubio Visits Israel In Wake Of Qatar Attack, As IDF Intensifies Strikes In Northern Gaza",
    "description": "The secretary of state said he'd seek answers from Israeli officials about their view of a path forward in Gaza, after the Doha attack upended peace efforts.",
    "link": "https://www.huffpost.com/entry/rubio-visits-israel-qatar-attack-strikes-northern-gaza_n_68c6fad4e4b0ca1feefe3930",
    "timestamp": "2025-09-14T17:51:18Z"
  },
  {
    "title": "Everyone Thinks Elon Musk is Going to Build a SpaceX Mobile Network",
    "description": "The company is buying up spectrum.",
    "link": "https://gizmodo.com/everyone-thinks-elon-musk-is-going-to-build-a-spacex-mobile-network-2000658656",
    "timestamp": "2025-09-14T17:50:18Z"
  },
  {
    "title": "Charlie Kirk's killing sparks firings and outrage as reactions expose deep divides",
    "description": "In the days since the assassination of conservative figure Charlie Kirk, institutions from airlines to schools have moved quickly to discipline employees accused of celebrating or mocking his death, a reflection of the charged atmosphere surrounding the killi…",
    "link": "https://www.nbcnews.com/news/us-news/charlie-kirk-workplace-firings-disciplinary-action-rcna231131",
    "timestamp": "2025-09-14T17:48:59Z"
  },
  {
    "title": "Charlie Kirk Compared Trump and Mamdani’s Popularity with Young Voters in Final Tucker Carlson Interview",
    "description": "Mamdani's appeal is \"yet another distress signal among young people saying, 'Hey, if you're not gonna fix our life economically, we're gonna get radical politically,\" the right-wing activist said",
    "link": "http://www.rollingstone.com/politics/politics-news/charlie-kirk-trump-mamdani-tucker-carlson-interview-1235427019/",
    "timestamp": "2025-09-14T17:46:55Z"
  },
  {
    "title": "Dept. of Justice requests state's voter registration data",
    "description": "President Donald Trump's Department of Justice wants information from the state’s voter registration list",
    "link": "https://komonews.com/news/local/dept-of-justice-requests-states-voter-registration-data",
    "timestamp": "2025-09-14T17:44:43Z"
  },
  {
    "title": "Antifa defaces memorial for Zarutska and Kirk in Vienna – Austrian politician (VIDEOS, PHOTOS)",
    "description": "People honored the memory of the two murder victims with a vigil and makeshift shrine in the nation’s capital Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624647-antifa-deface-memorial-zarutska-kirk/",
    "timestamp": "2025-09-14T17:43:05Z"
  },
  {
    "title": "How to watch the 2025 Emmy Awards",
    "description": "Apple TV+ is poised to have a breakout year with the two most nominated shows.",
    "link": "https://www.mercurynews.com/2025/09/14/how-to-watch-the-2025-emmys/",
    "timestamp": "2025-09-14T17:42:34Z"
  },
  {
    "title": "Ditch Russia’s Oil For More U.S. Sanctions On Moscow, Trump Tells NATO",
    "description": "U.S. president Donald Trump has said he would be willing to consider tougher sanctions on Russia, provided NATO partners stop buying Moscow’s oil.",
    "link": "https://www.forbes.com/sites/gauravsharma/2025/09/14/ditch-russias-oil-for-more-us-sanctions-on-moscow-trump-tells-nato/",
    "timestamp": "2025-09-14T17:40:59Z"
  },
  {
    "title": "Brazil ex-President Jair Bolsonaro leaves house arrest for hospital visit",
    "description": "Former Brazilian President Jair Bolsonaro has left his home in Brasilia where he is under house arrest to undergo a medical procedure at a nearby hospital",
    "link": "https://abcnews.go.com/Health/wireStory/brazil-president-jair-bolsonaro-leaves-house-arrest-hospital-125558794",
    "timestamp": "2025-09-14T17:34:34Z"
  },
  {
    "title": "After Kirk’s killing a growing chorus of conservatives wants his critics ostracized or fired",
    "description": "By JOSH BOAK and NICHOLAS RICCARDI BASKING RIDGE, New Jersey (AP) — After years of complaints from the right about “cancel culture” from the left, some conservatives are seeking to upend the lives and careers of those who disparaged Charlie Kirk after his dea…",
    "link": "https://www.denverpost.com/2025/09/14/after-kirks-killing-a-growing-chorus-of-conservatives-wants-his-critics-ostracized-or-fired/",
    "timestamp": "2025-09-14T17:31:22Z"
  },
  {
    "title": "Blame game after acts of political violence can lead to further attacks, experts warn",
    "description": "From the moment conservative activist Charlie Kirk was felled by an assassin, partisans began fighting over which side was to blame.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_2f611f8a-7d20-52ea-8918-6ff3734e1370.html",
    "timestamp": "2025-09-14T17:30:00Z"
  },
  {
    "title": "Kristen Welker Tries To Bait Lindsey Graham Into Fretting About Violence On The Right, It Doesn’t Go Well",
    "description": "Lindsey Graham did not take the bait from host Kristen Welker when asked about conservative responses to the assassination of TPUSA founder Charlie Kirk.",
    "link": "https://dailycaller.com/2025/09/14/kristen-welker-lindsey-graham-charlie-kirk-violence/",
    "timestamp": "2025-09-14T17:27:11Z"
  },
  {
    "title": "Trump shares call for ‘Charlie Kirk Act’ to hold media accountable",
    "description": "The US president has supported a call for legislation that would hold media and content creators financially liable for false claims Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624649-trump-kirk-call-media-accountable/",
    "timestamp": "2025-09-14T17:26:41Z"
  },
  {
    "title": "Turning Point USA says campus chapter requests surge to over 32,000 after Kirk's assassination",
    "description": "Charlie Kirk's assassination sparked massive interest in expanding Turning Point USA, with more than 32,000 people requesting to start new chapters nationwide.",
    "link": "https://www.foxnews.com/politics/turning-point-usa-says-campus-chapter-requests-surge-over-32000-after-kirks-assassination",
    "timestamp": "2025-09-14T17:24:14Z"
  },
  {
    "title": "Alleged Kirk killer had ‘leftist’ beliefs, Utah governor says",
    "description": "The man arrested over conservative influencer Charlie Kirk’s assassination was romantically involved with a transgender roommate and had “leftist ideology,” Utah’s governor said Sunday, confirming details likely to inflame the contentious national debate over…",
    "link": "https://www.digitaljournal.com/world/alleged-kirk-killer-had-leftist-beliefs-utah-governor-says/article",
    "timestamp": "2025-09-14T17:22:20Z"
  },
  {
    "title": "How to watch tonight’s 2025 Emmy Awards",
    "description": "Apple TV+ is poised to have a breakout year with the two most nominated shows.",
    "link": "https://www.denverpost.com/2025/09/14/how-to-watch-the-2025-emmys/",
    "timestamp": "2025-09-14T17:21:30Z"
  },
  {
    "title": "Alleged Kirk Killer Had 'Leftist' Beliefs, Utah Governor Says",
    "description": "The man arrested over conservative influencer Charlie Kirk's assassination was romantically involved with a transgender roommate and had \"leftist ideology,\" Utah's governor said Sunday, confirming details likely to inflame the contentious national debate over…",
    "link": "https://www.ibtimes.com/alleged-kirk-killer-had-leftist-beliefs-utah-governor-says-3783320",
    "timestamp": "2025-09-14T17:21:21Z"
  },
  {
    "title": "‘Last-minute abuse of power’: Lawsuit seeks details about Biden’s ‘accelerated’ prosecutions over Jan. 6",
    "description": "Cases rapidly advanced after Trump was elected to his second term",
    "link": "https://www.wnd.com/2025/09/last-minute-abuse-power-lawsuit-seeks-details-about/",
    "timestamp": "2025-09-14T17:18:06Z"
  },
  {
    "title": "India brags about having 1.4 billion people but won't buy one bushel of US corn: Lutnick",
    "description": "Commerce Secretary Howard Lutnick criticized India's trade practices, highlighting the imbalance where India sells extensively to the US but restricts American corn imports with tariffs. He asserted that India must lower its tariffs to ensure fair and recipro…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-brags-about-having-1-4-billion-people-but-wont-buy-one-bushel-of-us-corn-lutnick/articleshow/123884926.cms",
    "timestamp": "2025-09-14T17:17:19Z"
  }
]