[
  {
    "title": "German Chancellor Says 30% US Tariffs Would Hit Industry To 'Core'",
    "description": "German Chancellor Friedrich Merz said US President Donald Trump’s threat of 30% tariffs would hit exporters in Europe’s largest economy “to the core,” if a negotiated solution in the trade conflict can’t be found in the coming weeks. The European Union will e…",
    "link": "https://www.ndtvprofit.com/global-economics/german-chancellor-says-30-us-tariffs-would-hit-industry-to-core",
    "timestamp": "2025-07-13T17:53:03Z"
  },
  {
    "title": "Florida Elected Officials Finally Get Into “Alligator Alcatraz.” Democrats Describe Conditions as “Vile.”",
    "description": "This isn’t the first time the Trump administration and immigration officials have tried to restrict access to immigration facilities.",
    "link": "https://www.vanityfair.com/news/story/florida-elected-officials-visit-alligator-alcatraz",
    "timestamp": "2025-07-13T17:52:49Z"
  },
  {
    "title": "Sen. Rand Paul sees ‘cultural cover-up’ about Trump shooting last July",
    "description": "One year after a shooter injured then-candidate Donald Trump at a rally in Butler, Pennsylvania, Sen. Rand Paul called for congressional oversight of the Secret Service, complaining of a “cultural cover-up” that he claimed masked critical security failures be…",
    "link": "https://biztoc.com/x/1e04e796d14b9bd9",
    "timestamp": "2025-07-13T17:50:54Z"
  },
  {
    "title": "Donald Trump Wants FEMA 'Remade,' Not Eradicated—DHS Secretary",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDepartment of Homeland Security (DHS) Secretary Kristi Noem indicated on Sunday that President Donald Trump has changed his position when it comes to terminating the Federal Emergency Management Agency (FEMA).…",
    "link": "https://biztoc.com/x/5f1e20a85759fccf",
    "timestamp": "2025-07-13T17:39:55Z"
  },
  {
    "title": "Senate Trump assassination report details Secret Service failures",
    "description": "The report outlines “stunning failures\" by Secret Service that allowed the attempted assassination of then-candidate Trump.",
    "link": "https://abcnews.go.com/Politics/senate-trump-assassination-report-details-secret-service-failures/story?id=123719300",
    "timestamp": "2025-07-13T17:38:59Z"
  },
  {
    "title": "Donald Trump Wants FEMA 'Remade,' Not Eradicated—DHS Secretary",
    "description": "The administration supported search and rescue operations in Kerr County, Texas, after at least 120 people died and dozens went missing in deadly floods.",
    "link": "https://www.newsweek.com/donald-trump-wants-fema-remade-eradicated-dhs-secretary-2098369",
    "timestamp": "2025-07-13T17:36:22Z"
  },
  {
    "title": "I Watched Lara Trump’s “Interview” With the President So You Don’t Have To",
    "description": "On Saturday night, Fox News went full-on state media. Lara Trump, the president’s daughter-in-law, sat down with the 47th president to “interview” him for her show, My View, that she definitely did not get through nepotism. A journalist who lands a prime-time…",
    "link": "https://www.motherjones.com/politics/2025/07/lara-trump-donald-trump-fox-news-interview/",
    "timestamp": "2025-07-13T17:31:27Z"
  },
  {
    "title": "“Superman” is super woke — on purpose",
    "description": "James Gunn’s Man of Steel is supercharged and ready to tackle our highly politicized moment.",
    "link": "https://www.salon.com/2025/07/13/superman-is-super-woke-on-purpose/",
    "timestamp": "2025-07-13T17:30:30Z"
  },
  {
    "title": "West Bank: Deadly Israeli settler attack on Palestinians",
    "description": "Following two deaths after another settler attack in the West Bank, the victims' families said ambulances were prevented from helping the young Palestinians, one of whom was a US citizen.",
    "link": "https://www.dw.com/en/west-bank-deadly-israeli-settler-attack-on-palestinians/a-73261913",
    "timestamp": "2025-07-13T17:28:00Z"
  },
  {
    "title": "Israeli settlers allegedly kill two Palestinians in occupied West Bank",
    "description": "Following two deaths after another settler attack in the West Bank, the victims' families said ambulances were prevented from helping the young Palestinians — one of whom was a US citizen who died at the scene. A school courtyard in al-Mazra'a al-Sharqiya, a …",
    "link": "https://www.dw.com/en/israeli-settlers-allegedly-kill-two-palestinians-in-occupied-west-bank/a-73261913",
    "timestamp": "2025-07-13T17:28:00Z"
  },
  {
    "title": "Baylor University Returns $643K Pro-LGBTQ Grant, Gets Called Out by Grant-Giver For Hypocrisy",
    "description": "Baylor University, one of the largest and oldest Baptist universities in the world, has rescinded a $643,000 grant from the Eula Mae and John Baugh Foundation intended to promote LGBTQ acceptance within the church. Was it a principled stance, or something alt…",
    "link": "https://freerepublic.com/focus/f-religion/4328475/posts",
    "timestamp": "2025-07-13T17:27:35Z"
  },
  {
    "title": "EU delays retaliatory tariffs on US goods due to hit Monday in hopes of reaching a deal with Trump officials",
    "description": "President Donald Trump sent a letter announcing new tariffs of 30% on goods from the EU and Mexico starting Aug. 1.",
    "link": "https://fortune.com/2025/07/13/eu-retaliatory-tariffs-us-goods-trump-trade-war-talks/",
    "timestamp": "2025-07-13T17:26:04Z"
  },
  {
    "title": "Winning: Jobs Gains Going to Native Born Americans, Wage Gains Outpacing Inflation",
    "description": "On Friday's \"Alex Marlow Show,\" host and Breitbart Editor-in-Chief Alex Marlow talked with Breitbart News economics editor John Carney about wage gains outpacing inflation.\nThe post Winning: Jobs Gains Going to Native Born Americans, Wage Gains Outpacing Infl…",
    "link": "https://www.breitbart.com/clips/2025/07/13/winning-jobs-gains-going-to-native-born-americans-wage-gains-outpacing-inflation/",
    "timestamp": "2025-07-13T17:25:30Z"
  },
  {
    "title": "Secret Service failed to discipline agent at the heart of security breakdown in Trump assassination attempt, report finds",
    "description": "That agent was allegedly warned about would-be assassin Thomas Crooks 25 minutes before Trump was shot — but did not relay that info to the agents on the ground in Butler, Pennsylvania, the report found.",
    "link": "https://nypost.com/2025/07/13/us-news/secret-service-failed-to-discipline-agent-at-the-heart-of-security-breakdown-in-trump-assassination-attempt-report/",
    "timestamp": "2025-07-13T17:24:42Z"
  },
  {
    "title": "Church Turns itself Into Super Mario World For Mario-Themed Service",
    "description": "Life.Church South Broken Arrow Life kicked off their At the Movies campaign with a Super Mario Brothers theme, decorating their church and crafting a sermon based around the adventures of Mario, Luigi, Bowser, Princess Preach, and whatever stray Koopa that ma…",
    "link": "https://freerepublic.com/focus/f-religion/4328474/posts",
    "timestamp": "2025-07-13T17:24:35Z"
  },
  {
    "title": "Syria signs $800m Tartous port deal with UAE firm DP World",
    "description": "'Syria possesses valuable assets,' says DP World’s CEO, highlighting the country’s economic potential.",
    "link": "https://www.aljazeera.com/economy/2025/7/13/syria-signs-800m-tartus-port-deal-with-uae-firm-dp-world",
    "timestamp": "2025-07-13T17:22:30Z"
  },
  {
    "title": "Over 400 Protests Against Trump Admin Scheduled to Take Place Nationwide on July 17",
    "description": "Over 400 protests are scheduled to take place in all 50 states against President Donald Trump and his administration on July 17.\nThe post Over 400 Protests Against Trump Admin Scheduled to Take Place Nationwide on July 17 appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/400-protests-against-trump-admin-scheduled-take-place/",
    "timestamp": "2025-07-13T17:20:03Z"
  },
  {
    "title": "Iran president was reportedly injured in Israeli strikes",
    "description": "Iran's Fars news agency says President Masoud Pezeshkian had a leg injury when his secret site was hit in June.",
    "link": "https://www.bbc.com/news/articles/cn0z8n037p6o",
    "timestamp": "2025-07-13T17:20:02Z"
  },
  {
    "title": "'What did he know?' Ex-CNN anchor claims Trump is in the midst of 'freaking out'",
    "description": "Appearing on MSNBC, former CNN anchor and White House correspondent Jim Acosta expressed surprise at how Donald Trump is mishandling the chaos at the Department of Justice due the Jeffrey Epstein files.Speaking with host Ali Velshi, Acosta claimed he knows Tr…",
    "link": "https://www.rawstory.com/trump-freaking-out-2673149018/",
    "timestamp": "2025-07-13T17:18:51Z"
  },
  {
    "title": "'Superman' and DC Studios fly to a $122 million opening",
    "description": "In a bid to kickoff a new era for DC Studios, James Gunn’s “Superman” opened with $122 million in U.S. and Canada ticket sales over the weekend, according to studio estimates Sunday.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/superman-dc-studios-122-million-opening-rcna218541",
    "timestamp": "2025-07-13T17:17:23Z"
  },
  {
    "title": "Corey Comperatore's widow sheds new light on final moments with her husband",
    "description": "The widow of Corey Comperatore recounts her husband's heroism at Trump's Pennsylvania rally and the president's support for her family after the tragic shooting.",
    "link": "https://www.foxnews.com/media/corey-comperatores-wife-sheds-new-light-her-final-moments-her-husband-fateful-day",
    "timestamp": "2025-07-13T17:14:39Z"
  },
  {
    "title": "Left Wing Failures Breed More Violence Before MidTerms [mugshots]",
    "description": "Wasn’t it just weeks or so ago when I warned that the left’s growing anguish over their loss of power would get worse? Since then it has gotten worse, much worse with leftist rioting against federal law enforcement officers. They’ve told the left-wing news si…",
    "link": "https://freerepublic.com/focus/f-chat/4328473/posts",
    "timestamp": "2025-07-13T17:10:42Z"
  },
  {
    "title": "Metadata From \"Raw\" Epstein Video Shows Something Extremely Sketchy",
    "description": "When reviewing the metadata on the newly-released security camera footage of Jeffrey Epstein's last day alive, experts found something very odd: that it appears to have been manipulated. As Wired reports, the \"full raw\" video that the Justice Department just …",
    "link": "https://futurism.com/epstein-video-metadata",
    "timestamp": "2025-07-13T17:09:13Z"
  },
  {
    "title": "Rosie O'Donnell Scoffs At Donald Trump's Threat To Revoke Her Citizenship",
    "description": "The president's two-decade grudge against Rosie O’Donnell rose to the surface as his base clamored for answers about the investigation into Jeffrey Epstein.",
    "link": "https://www.vanityfair.com/hollywood/story/rosie-odonnell-donald-trump-citizenship",
    "timestamp": "2025-07-13T17:07:04Z"
  },
  {
    "title": "‘Huge PR Disaster!’ Fox News Panel Slams Trump’s Handling of Epstein Probe",
    "description": "A Fox News panel slammed President Donald Trump for attempting to move past the Jeffrey Epstein probe following his shocking statement on Truth Social Saturday.\nThe post ‘Huge PR Disaster!’ Fox News Panel Slams Trump’s Handling of Epstein Probe first appeared…",
    "link": "https://www.mediaite.com/media/news/huge-pr-disaster-fox-news-panel-slams-trumps-handling-of-epstein-probe/",
    "timestamp": "2025-07-13T17:06:22Z"
  },
  {
    "title": "Trump administration poised to ramp up deportations to distant countries",
    "description": "The fate of eight migrants deported to war-torn South Sudan by the Trump administration is unknown. The US claims no responsibility. South Sudan says the men are under their care. Family members have not heard from them. The Supreme Court ruling may expand th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-poised-to-ramp-up-deportations-to-distant-countries/articleshow/122421799.cms",
    "timestamp": "2025-07-13T17:02:56Z"
  },
  {
    "title": "Trump Posts Triumphant Video on One-Year Anniversary of Butler Attempt",
    "description": "President Donald Trump shared a riveting video showing scenes of his life and career in the private sector and politics on the first anniversary of his near assassination in Butler, Pennsylvania, on Sunday. \nThe post Trump Posts Triumphant Video on One-Year A…",
    "link": "https://www.breitbart.com/politics/2025/07/13/trump-posts-triumphant-video-on-one-year-anniversary-of-butler-attempt/",
    "timestamp": "2025-07-13T17:01:25Z"
  },
  {
    "title": "Combating the LA Riots. A Battle Worth Having",
    "description": "Déjà vu.   That’s what Americans felt after the recent riots, violence, and left-wing antics centered in Los Angeles, California. Radicals used President Donald Trump’s deportations... Read More\nThe post Combating the LA Riots. A Battle Worth Having appeared …",
    "link": "https://www.dailysignal.com/2025/07/13/combating-la-riots-battle-worth-having/",
    "timestamp": "2025-07-13T17:00:00Z"
  },
  {
    "title": "Every SCOTUS Justice Seems Annoyed At Ketanji Brown Jackson — Even The Other Libs",
    "description": "Brown Jackson's solo dissents directing sharp words at the court's majority may indicate she's veering further left than the other Democrat-appointed justices.",
    "link": "https://dailycaller.com/2025/07/13/every-scotus-justice-seems-annoyed-ketanji-brown-jackson/",
    "timestamp": "2025-07-13T16:59:06Z"
  },
  {
    "title": "The EU is delaying retaliatory tariffs on US goods in hopes of reaching a deal by Aug. 1",
    "description": "The European Union will suspend retaliatory tariffs on U.S. goods scheduled to take effect Monday in hopes of reaching a trade deal with the Trump administration by the end of the month.",
    "link": "https://www.nbcnews.com/business/business-news/eu-delaying-retaliatory-tariffs-us-goods-rcna218535",
    "timestamp": "2025-07-13T16:57:59Z"
  },
  {
    "title": "EU delays tariff countermeasures in hope of US trade deal",
    "description": "The European Union will delay planned tariffs on $25 billion-worth of US exports as officials rush to secure a trade deal after President Donald Trump proposed 30% levies on European goods starting next month.\nDespite the fresh urgency, the bloc’s nations app…",
    "link": "https://biztoc.com/x/73907ba7dae0bf4c",
    "timestamp": "2025-07-13T16:55:45Z"
  },
  {
    "title": "EU delaying retaliation to US tariffs – von der Leyen",
    "description": "US President Donald Trump recently announced 30% tariffs on goods from the bloc Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621414-eu-delays-us-tariffs-retaliation/",
    "timestamp": "2025-07-13T16:51:59Z"
  },
  {
    "title": "‘Superman’ and DC Studios fly to a $122 million opening",
    "description": "In a bid to kickoff a new era for DC Studios, James Gunn’s “Superman” opened with $122 million in U.S. and Canada ticket sales over the weekend",
    "link": "https://abcnews.go.com/Entertainment/wireStory/superman-dc-studios-fly-122-million-opening-123719950",
    "timestamp": "2025-07-13T16:48:16Z"
  },
  {
    "title": "Rosie O’Donnell Slams Trump After Threatening to Revoke Her Citizenship",
    "description": "\"You lie, you steal, you degrade —\u2028I nurture, I create, I persist,\" she wrote on Instagram. \"You are everything that is wrong with America.\"",
    "link": "http://www.hollywoodreporter.com/news/politics-news/rosie-odonnell-slams-trump-threatens-revoke-u-s-citizenship-1236313041/",
    "timestamp": "2025-07-13T16:48:00Z"
  },
  {
    "title": "Man describes face-to-face encounter with mysterious large cat in Rochester",
    "description": "\"After I see the people run, I just see something big, just walking just right over there, it went right over there I swear, I promise you, it went right over there. And it said 'rawr,' and I just kept walking,\" he recalled. \"I seen it, seeing me, see it, so …",
    "link": "https://freerepublic.com/focus/f-chat/4328470/posts",
    "timestamp": "2025-07-13T16:44:39Z"
  },
  {
    "title": "Trump ‘certainly’ can fire Fed chair Powell ‘if there’s cause’: Hassett",
    "description": "Top Trump administration officials have escalated their criticisms of Fed Chair Jerome Powell by targeting the Federal Reserve's renovation project.",
    "link": "https://www.cnbc.com/2025/07/13/trump-can-fire-powell-if-theres-cause-hassett.html",
    "timestamp": "2025-07-13T16:44:38Z"
  },
  {
    "title": "Rosie O’Donnell slams Trump in multiple social media posts after he threatened to revoke her citizenship",
    "description": "Rosie O'Donnell and Donald Trump reignite their long-standing feud after Trump threatened to revoke O'Donnell's citizenship following her move to Ireland. O'Donnell responded with scathing social media posts, accusing Trump of being a criminal and a danger to…",
    "link": "https://economictimes.indiatimes.com/news/international/us/rosie-odonnell-slams-trump-in-multiple-social-media-posts-after-he-threatened-to-revoke-her-citizenship/articleshow/122421628.cms",
    "timestamp": "2025-07-13T16:44:15Z"
  },
  {
    "title": "‘I Got Whacked:’ Trump Recalls Assassination Attempt One Year Later",
    "description": "President Donald Trump recalled surviving the assassination attempt on his life one year ago today at his Butler, Pennsylvania, rally in an interview with his... Read More\nThe post ‘I Got Whacked:’ Trump Recalls Assassination Attempt One Year Later appeared f…",
    "link": "https://www.dailysignal.com/2025/07/13/i-got-whacked-trump-recalls-assassination-attempt-one-year-later/",
    "timestamp": "2025-07-13T16:42:30Z"
  },
  {
    "title": "Donald Trump defends Pam Bondi over Jeffrey Epstein files - BBC",
    "description": "Donald Trump defends Pam Bondi over Jeffrey Epstein filesBBC MAGA world erupts over Trump's defense of Bondi amid Epstein files falloutFox News Blaming ‘Obama, Crooked Hillary’: Trump’s Epstein Memo Meltdown Gets Even WorseRolling Stone Exclusive: DOJ, FBI co…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178369662",
    "timestamp": "2025-07-13T16:35:43Z"
  },
  {
    "title": "The EU is delaying retaliatory tariffs on US goods in hopes of reaching a deal by Aug. 1",
    "description": "The European Union has decided to hold off on imposing retaliatory tariffs on U.S. goods that were set to begin Monday.",
    "link": "https://www.news4jax.com/business/2025/07/13/the-eu-is-delaying-retaliatory-tariffs-on-us-goods-in-hopes-of-reaching-a-deal-by-aug-1/",
    "timestamp": "2025-07-13T16:35:22Z"
  },
  {
    "title": "Trump finally found the perfect interviewer. A sycophant who just sits there nodding while he rants endlessly [Obvious]",
    "description": "Trump finally found the perfect interviewer. A sycophant who just sits there nodding while he rants endlessly",
    "link": "https://www.fark.com/comments/13739528/Trump-finally-found-perfect-interviewer-A-sycophant-who-just-sits-there-nodding-while-he-rants-endlessly",
    "timestamp": "2025-07-13T16:35:19Z"
  },
  {
    "title": "Rosie O’Donnell Responds to Trump’s Citizenship Threat: ‘I’m Everything You Fear’",
    "description": "\"You are everything that is wrong with America – and I’m everything you hate about what’s still right with it,\" actress tells president",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/rosie-odonnell-response-trump-citizenship-threat-1235384566/",
    "timestamp": "2025-07-13T16:35:18Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is estimated to leave millions without health care. He insists ‘it’s not going to cause death’",
    "description": "President Donald Trump defended his “Big, Beautiful, Bill” during a Fox News interview broadcast on Saturday night, claiming \"it's not going to cause death",
    "link": "https://www.newsbreak.com/share/4104549240121-trump-s-big-beautiful-bill-is-estimated-to-leave-millions-without-health-care-he-insists-it-s-not-going-to-cause-death?s=a2&amp;share_destination_id=NTQ2NDA5MDktMTc1MjQyNDQwNjEyNw%3D%3D&amp;pd=03hGazFf&amp;hl=en_US&amp;send_time=1752424406&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v6%2Cns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_rank_exp_25q2-v5%2Cns_foryou_blend_exp_25q2-v6",
    "timestamp": "2025-07-13T16:33:58Z"
  },
  {
    "title": "Pentagon pressuring Japan and Australia over China – FT",
    "description": "The US has reportedly demanded commitments from its allies in the event of a war over Taiwan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621418-pentagon-pressuring-japan-australia/",
    "timestamp": "2025-07-13T16:33:11Z"
  },
  {
    "title": "Taking Journalism’s ‘Experts Said…’ Chicanery About Facts to Its Natural, Absurd Conclusion",
    "description": "Yesterday, the NY Times published an article about Donald Trump’s threat to take away citizenship from a US-born citizen:",
    "link": "https://kottke.org/25/07/journalisms-experts-said-conclusion",
    "timestamp": "2025-07-13T16:30:16Z"
  },
  {
    "title": "Chairman Rand Paul Releases Final Report Detailing Secret Service Failures in Attempted Assassination of President Donald J. Trump (Committee on Homeland Security ...)",
    "description": "Committee on Homeland Security & Governmental Affairs:\nChairman Rand Paul Releases Final Report Detailing Secret Service Failures in Attempted Assassination of President Donald J. Trump  —  Report Reveals Inexcusable Negligence, Communication Breakdowns, Syst…",
    "link": "https://www.memeorandum.com/250713/p27",
    "timestamp": "2025-07-13T16:30:00Z"
  },
  {
    "title": "Secret Disservice: Top Officials Were Aware of 'Classified Threat' 10 Days Before Butler Assassination Attempt, Failed to Tell Agents Guarding Trump",
    "description": "The Secret Service's failure to disseminate this crucial intelligence to the agents responsible for Donald Trump's security significantly endangered his life.",
    "link": "https://radaronline.com/p/secret-service-classified-threat-butler-assassination-attempt-donald-trump/",
    "timestamp": "2025-07-13T16:30:00Z"
  },
  {
    "title": "EU delays retaliatory trade tariffs against US",
    "description": "The countermeasures were set to start on Tuesday but have been pushed back to early August.",
    "link": "https://www.bbc.com/news/articles/cdez5w61g5lo",
    "timestamp": "2025-07-13T16:29:00Z"
  },
  {
    "title": "‘This is a very dangerous job’: Watch Trump reflect on Butler assassination attempt one year later",
    "description": "'You know, I say a race car driver, one percent of one percent – think of that – die. It's not a lot. A bull rider. I think that's pretty dangerous. It's like one tenth of one percent die. With the president, it's like five percent'",
    "link": "https://www.wnd.com/2025/07/this-is-very-dangerous-job-watch-trump-reflect/",
    "timestamp": "2025-07-13T16:28:20Z"
  },
  {
    "title": "Monetary policy at the world’s most important central bank could hinge on an argument over building renovations",
    "description": "The latest spat between the Trump administration and the Federal Reserve is sounding more like a home-improvement reality TV show.",
    "link": "https://fortune.com/2025/07/13/trump-vs-powell-monetary-policy-fed-rate-cuts-office-renovations/",
    "timestamp": "2025-07-13T16:25:09Z"
  },
  {
    "title": "US Senate report faults Secret Service discipline after Trump shooting",
    "description": "(Reuters) -A U.S. Senate report released on Sunday said a \"cascade\" of failures allowed a gunman to shoot at Donald Trump during a campaign rally last year and faulted Secret Service discipline including the lack of firings in the wake of the attack. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/07/14/us-senate-report-faults-secret-service-discipline-after-trump-shooting",
    "timestamp": "2025-07-13T16:23:00Z"
  },
  {
    "title": "US Senate report faults Secret Service discipline after Trump shooting",
    "description": "(Reuters) -A U.S. Senate report released on Sunday said a \"cascade\" of failures allowed a gunman to shoot at Donald Trump during a campaign rally last year...",
    "link": "https://www.yahoo.com/news/us-senate-report-faults-secret-162109627.html",
    "timestamp": "2025-07-13T16:21:09Z"
  },
  {
    "title": "EU chief delays retaliation for US tariffs in search of deal",
    "description": "BRUSSELS: EU chief Ursula von der Leyen said Sunday that Brussels will continue to hold off on hitting back at US steel and aluminum tariffs, as it seeks a dea...",
    "link": "https://kuwaittimes.com/article/30630/business/eu-chief-delays-retaliation-for-us-tariffs-in-search-of-deal/",
    "timestamp": "2025-07-13T16:20:35Z"
  },
  {
    "title": "Tim Cook Will Not Be Fired By Apple’s Board And Is Expected To Become Chairman, Asserting “An Even Tighter Grip On The iPhone Maker” Despite AI Stumbles, Innovation Slump, And Mounting Criticism",
    "description": "Apple Intelligence failed to make a mark in the industry, as the company stumbles to keep its top executives on board amid other issues. Tim Cook has been accused countless times in the past of being a software person instead of a hardware person, as he has m…",
    "link": "https://wccftech.com/apple-board-of-directors-will-not-fire-tim-cook-but-he-will-become-chairman-soon/",
    "timestamp": "2025-07-13T16:19:32Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Bhanubhakta’s legacy vital for linguistic unity: President Paudel President Ram Chandra Paudel has said…",
    "link": "https://english.khabarhub.com/2025/13/485343/",
    "timestamp": "2025-07-13T16:15:10Z"
  },
  {
    "title": "'Inexcusable' failures led to Trump assassination attempt",
    "description": "A congressional inquiry into the attempt to assassinate US President Donald Trump at a campaign rally a year ago on lamented \"inexcusable\" failures in the Secret Service's operations and response, and called for more serious disciplinary action",
    "link": "https://www.rte.ie/news/world/2025/0713/1523305-trump-assassination-attempt/",
    "timestamp": "2025-07-13T16:12:54Z"
  },
  {
    "title": "‘Shouldn’t Have Happened’: Trump Reflects On Butler Assassination Attempt One Year Later",
    "description": "Trump reflected about the first assassination attempt against his life in Butler, stating he's \"satisfied\" with the briefing he's received about the attack.",
    "link": "https://dailycaller.com/2025/07/13/donald-trump-butler-pennsylvania-assassination-attempt-security/",
    "timestamp": "2025-07-13T16:06:13Z"
  },
  {
    "title": "'This Week' Transcript 7-13-25: White House NEC Director Kevin Hassett (ABC News)",
    "description": "ABC News:\n‘This Week’ Transcript 7-13-25: White House NEC Director Kevin Hassett  —  Kevin Hassett, Director of the National Economic Council speaks with ABC News on “This Week” from Washington, April 6, 2025. … (BEGIN VIDEO CLIP)  —  DONALD TRUMP, PRESIDENT …",
    "link": "https://www.memeorandum.com/250713/p26",
    "timestamp": "2025-07-13T16:05:01Z"
  },
  {
    "title": "President Trump on streaking Boston Red Sox: \"They haven't lost since they saw me in the Oval\"",
    "description": "The Red Sox have been on a winning streak since several players visited the White House on their day off, and President Donald Trump appeared to have taken notice.",
    "link": "https://www.cbsnews.com/boston/news/president-trump-boston-red-sox-truth-social/",
    "timestamp": "2025-07-13T16:03:00Z"
  },
  {
    "title": "Christie: Trump 'Fueled' and 'Benefited Directly' from Epstein Controversy",
    "description": "Former New Jersey Gov. Chris Christie (R) said Sunday on ABC's \"This Week\" that President Donald Trump \"benefited directly\" from fueling the controversy over the Jeffrey Epstein case.\nThe post Christie: Trump ‘Fueled’ and ‘Benefited Directly’ from Epstein Con…",
    "link": "https://www.breitbart.com/clips/2025/07/13/christie-trump-fueled-and-benefited-directly-from-epstein-controversy/",
    "timestamp": "2025-07-13T16:01:35Z"
  },
  {
    "title": "WATCH: Fox & Friends Hosts Urge Trump to Provide Answers About ‘Ticking Time Bomb’ Epstein Case",
    "description": "The hosts on Fox & Friends urged President Donald Trump to provide clear answers and transparency about the Jeffrey Epstein case after he faced outrage from his supporters over a post telling people to move on.\nThe post WATCH: Fox & Friends Hosts Urge Trump t…",
    "link": "https://www.thegatewaypundit.com/2025/07/watch-fox-friends-hosts-urge-trump-provide-answers/",
    "timestamp": "2025-07-13T16:00:32Z"
  },
  {
    "title": "DEMS TO FORCE VOTES ON DISCLOSURE",
    "description": "Democrats in Congress say they will introduce measures this coming week to press for the disclosure of the Jeffrey Epstein files as the Trump administration balks.As recently as 2023, when Democrats led the Senate, they blocked a GOP proposal to subpoena Epst…",
    "link": "https://www.dailywire.com/news/put-up-or-shut-up-dems-suddenly-want-trump-admin-to-disclose-epstein-secrets",
    "timestamp": "2025-07-13T16:00:06Z"
  },
  {
    "title": "'I Won't Miss,' Texas Man Wrote in Alleged Threat to Assassinate Trump",
    "description": "Police in San Antonio arrested a Texas man Thursday night after he allegedly threatened to assassinate President Donald Trump. The alleged threat was made in a Facebook post, where the man reportedly wrote, \"I won't miss.\"\nThe post ‘I Won’t Miss,’ Texas Man W…",
    "link": "https://www.breitbart.com/border/2025/07/13/i-wont-miss-texas-man-wrote-in-alleged-threat-to-assassinate-trump/",
    "timestamp": "2025-07-13T15:59:04Z"
  },
  {
    "title": "'Inexcusable' Failures Led To Trump Assassination Attempt: Senate Report",
    "description": "A congressional inquiry into the attempt to assassinate US President Donald Trump at a campaign rally a year ago on Sunday lamented \"inexcusable\" failures in the Secret Service's operations and response, and called for more serious disciplinary action.",
    "link": "https://www.ibtimes.com/inexcusable-failures-led-trump-assassination-attempt-senate-report-3778356",
    "timestamp": "2025-07-13T15:57:10Z"
  },
  {
    "title": "Why the left, from normal Dems to Antifa, have lost their collective minds",
    "description": "Some representatives now confess that they're being pressured by their constituents to take a bullet for the cause.",
    "link": "https://nypost.com/2025/07/13/opinion/why-the-left-from-normal-dems-to-antifa-have-lost-their-collective-minds/",
    "timestamp": "2025-07-13T15:55:50Z"
  },
  {
    "title": "Pam Bondi’s Allies Believe Dan Bongino ‘Burned His Bridges’ and Needs to Quit: Report",
    "description": "Bondi allies are reveling in Trump's statement of support for his beleaguered AG — and according to an NYT report, they believe Dan Bongino \"burned his bridges\"\nThe post Pam Bondi’s Allies Believe Dan Bongino ‘Burned His Bridges’ and Needs to Quit: Report fir…",
    "link": "https://www.mediaite.com/media/news/pam-bondis-allies-believe-dan-bongino-burned-his-bridges-and-needs-to-quit-report/",
    "timestamp": "2025-07-13T15:55:29Z"
  },
  {
    "title": "EU announces delay to its trade countermeasures against United States until early August | CNN Business",
    "description": "The European Union will delay the implementation of its trade countermeasures against the United States from Monday until early August to allow more time to negotiate a deal.",
    "link": "https://www.cnn.com/2025/07/13/business/us-eu-tariffs-august-delay",
    "timestamp": "2025-07-13T15:54:23Z"
  },
  {
    "title": "Syria Signs $800 Million Agreement With DP World To Bolster Ports Infrastructure",
    "description": "July 13 (Reuters) – Syria’s General Authority for Land and Sea Ports on Sunday signed a $800 million agreement with UAE’s DP World to bolster Syrian ports infrastructure and logistical services, Syrian state news...",
    "link": "https://gcaptain.com/syria-signs-800-million-agreement-with-dp-world-to-bolster-ports-infrastructure/",
    "timestamp": "2025-07-13T15:52:19Z"
  },
  {
    "title": "MAGA world erupts over Trump's defense of Bondi amid Epstein files fallout",
    "description": "MAGA supporters criticize Trump's defense of AG Pam Bondi after DOJ revealed there is no Epstein client list, despite previous promises to expose additional details on scandal.",
    "link": "https://www.foxnews.com/politics/maga-world-erupts-over-trumps-defense-bondi-amid-epstein-files-fallout",
    "timestamp": "2025-07-13T15:51:30Z"
  },
  {
    "title": "'I don't buy it': Fox News turns on Trump over Epstein 'ticking time bomb' (David Edwards/Raw Story)",
    "description": "David Edwards / Raw Story:\n'I don't buy it': Fox News turns on Trump over Epstein ‘ticking time bomb’  —  The hosts of Fox & Friends said they didn't buy claims from President Donald Trump's administration that Jeffrey Epstein did not have a list of people co…",
    "link": "https://www.memeorandum.com/250713/p23",
    "timestamp": "2025-07-13T15:50:00Z"
  },
  {
    "title": "Trump Gets 'Ratioed' on Truth Social for First Time Amid Epstein Backlash",
    "description": "Donald Trump's Truth Social post defending Pam Bondi has seen more than 36,000 replies so far, many from people unhappy with the president's remarks.",
    "link": "https://biztoc.com/x/df259761d2a17e4b",
    "timestamp": "2025-07-13T15:49:05Z"
  },
  {
    "title": "You Promised Us': Trump's Epstein Post On Truth Social Backfires",
    "description": "Donald J. Trump thought he was in his safe place on Truth Social when he unleashed a post trying to shut down talk about the Jeffrey Epstein files, but it swiftly backfired. First, Trump tried distracting the public with an attack on comedian Rosie O'Donnell …",
    "link": "https://crooksandliars.com/2025/07/you-promised-us-trumps-epstein-post-truth",
    "timestamp": "2025-07-13T15:48:38Z"
  },
  {
    "title": "Texas camp buildings were removed from map showing flood risks, US media reports",
    "description": "The camp where 27 girls died successfully challenged initial risk designations by US regulators, according to reports.",
    "link": "https://www.bbc.com/news/articles/ce8zjk5yx8wo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-13T15:47:04Z"
  },
  {
    "title": "‘Threat to humanity’: Trump ‘seriously’ considers revoking Rosie O’Donnell’s U.S. citizenship, actress fires back",
    "description": "Trump supporter: 'So the next time a Democrat president is in power and you criticize them, you're fine with having your citizenship stripped and getting deported?'",
    "link": "https://www.wnd.com/2025/07/threat-humanity-trump-seriously-considers-revoking-rosie-odonnells/",
    "timestamp": "2025-07-13T15:44:18Z"
  },
  {
    "title": "Trump’s citizenship threats can’t touch these 3 Americans",
    "description": "President Donald Trump’s latest social media outburst has raised serious constitutional concerns after he threatened to revoke comedian Rosie O’Donnell’s U.S. citizenship. The unprecedented threat represents a dramatic escalation in how the commander-in-chief…",
    "link": "https://rollingout.com/2025/07/13/trumps-threats-cant-touch-3-americans/",
    "timestamp": "2025-07-13T15:41:10Z"
  },
  {
    "title": "Chelsea hit Club World Cup jackpot but was tournament a success?",
    "description": "",
    "link": "https://www.skysports.com/football/news/11095/13396211/chelsea-hit-club-world-cup-prize-money-jackpot-but-was-the-expanded-tournament-a-success",
    "timestamp": "2025-07-13T15:39:00Z"
  },
  {
    "title": "Trump Gets 'Ratioed' on Truth Social for First Time Amid Epstein Backlash",
    "description": "Donald Trump's Truth Social post defending Pam Bondi has seen more than 36,000 replies so far, many from people unhappy with the president's remarks.",
    "link": "https://www.newsweek.com/donald-trump-jeffrey-epstein-truth-social-post-pam-bondi-2098351",
    "timestamp": "2025-07-13T15:37:59Z"
  },
  {
    "title": "Next fortnight crucial for Ireland amid US tariff threats",
    "description": "The next two weeks will be crucial for Ireland and the European Union after US President Donald Trump threatened tariffs of 30% if Brussels fails to reach a deal with Washington before the 1 August deadline, writes David Murphy",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0713/1523302-us-tariffs-ireland-eu/",
    "timestamp": "2025-07-13T15:37:40Z"
  },
  {
    "title": "It’s Been One Year Since Musk Endorsed Trump. Was It Worth It?",
    "description": "From a failed assassination attempt to a bitter public breakup, the billionaire bromance delivered a huge election win — followed by a political trainwreck",
    "link": "http://www.rollingstone.com/politics/politics-features/musk-trump-one-year-1235384479/",
    "timestamp": "2025-07-13T15:32:26Z"
  },
  {
    "title": "Flash Flooding Suspends Texas Search and Rescue Operations",
    "description": "The National Weather Service warned that the Guadalupe River could surge to nearly 15 feet—5 feet above flood stage—by Sunday afternoon.",
    "link": "https://www.newsweek.com/flash-flooding-suspends-texas-search-rescue-operations-2098360",
    "timestamp": "2025-07-13T15:30:07Z"
  },
  {
    "title": "Trump Threatens Rosie O’Donnell's Citizenship For Criticizing His TX Floods Response",
    "description": "After comedian Rosie O’Donnell, who moved to Dublin, Ireland, after the 2024 election, blamed Donald J. Trump over the flash floods in central Texas that have killed at least 121 people, many of them children, the president threatened to take \"away her citize…",
    "link": "https://crooksandliars.com/2025/07/trump-threatens-rosie-odonnells-citizenship",
    "timestamp": "2025-07-13T15:30:01Z"
  },
  {
    "title": "Why Ohio? A Bellwether in the Past, Present, and Future",
    "description": "The Buckeye State is right in the middle of the country. Elites hopping from coast-to-coast fly right over. But to truly understand our current political... Read More\nThe post Why Ohio? A Bellwether in the Past, Present, and Future   appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/07/13/why-ohio-bellwether-past-present-future/",
    "timestamp": "2025-07-13T15:30:00Z"
  },
  {
    "title": "Influencers urged to steer clear of hot topics during US immigration crackdown",
    "description": "Avoid politics. That’s the advice lawyers are increasingly giving U.S.-based content creators who aren’t citizens as an immigration crackdown spreads across the country.",
    "link": "https://richmond.com/news/nation-world/article_ed65fbb1-70c3-5d33-8c81-6b428924631f.html",
    "timestamp": "2025-07-13T15:30:00Z"
  },
  {
    "title": "Market Resilience Challenged by Trump’s Weekend Tariff Salvo",
    "description": "In This Article:\n(Bloomberg) -- Financial markets, which have shown increasing insensitivity to tariff threats from the US, will face a test at the Monday open after President Donald Trump declared a 30% rate for the European Union and Mexico effective Aug. 1…",
    "link": "https://biztoc.com/x/3f0130014e2a3a0e",
    "timestamp": "2025-07-13T15:27:21Z"
  },
  {
    "title": "Camp Mystic buildings were removed from flood map, US media reports",
    "description": "The camp where 27 girls died successfully challenged initial risk designations by US regulators, according to reports.",
    "link": "https://www.bbc.com/news/articles/ce8zjk5yx8wo",
    "timestamp": "2025-07-13T15:20:08Z"
  },
  {
    "title": "Blame New York Democrats — not Washington — for new state budget crisis",
    "description": "The state spending deal reached in May by Gov. Kathy Hochul and legislative Democrats hiked outlays by 9.3%, three times faster than inflation.",
    "link": "https://nypost.com/2025/07/13/opinion/blame-new-york-democrats-not-washington-for-new-state-budget-crisis/",
    "timestamp": "2025-07-13T15:18:30Z"
  },
  {
    "title": "Donald Trump threatens to illegally revoke citizenship of TV host Rosie O'Donnell",
    "description": "President Donald Trump has threatened to revoke the US citizenship of comedian Rosie O'Donnell - despite it being illegal and unconstitutional.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-threat-illegally-revoke-us-citizenship-rosie-odonnell-803900-20250713",
    "timestamp": "2025-07-13T15:18:17Z"
  },
  {
    "title": "Kentucky Gov. Andy Beshear says he'll 'take a look' at running for president",
    "description": "Gov. Andy Beshear, D-Ky., would not rule out running for president in 2028, telling “Meet the Press” moderator Kristen Welker that he may “take a look” at launching a bid.“I would have never considered this a couple years ago, but I will not leave a broken co…",
    "link": "https://www.nbcnews.com/politics/2028-election/kentucky-gov-andy-beshear-rule-out-presidential-campaign-rcna218521",
    "timestamp": "2025-07-13T15:15:34Z"
  },
  {
    "title": "Trump defends US Attorney General Pam Bondi over Epstein files",
    "description": "The president hits out at critics accusing Bondi of withholding information about the sex offender.",
    "link": "https://www.bbc.com/news/articles/c9qxd2exqgno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-13T15:12:03Z"
  },
  {
    "title": "Trump defends US Attorney General Pam Bondi over Epstein files",
    "description": "The president hits out at critics accusing Bondi of withholding information about the sex offender.",
    "link": "https://www.bbc.com/news/articles/c9qxd2exqgno",
    "timestamp": "2025-07-13T15:11:15Z"
  },
  {
    "title": "Trump's 2020 election loss may have been worse for America than his victory, columnist argues",
    "description": "The New York Magazine's Ed Kilgore argued on Sunday that the U.S. would have been better off had President Trump won in 2020 over Joe Biden.",
    "link": "https://www.foxnews.com/media/trumps-2020-election-loss-may-have-been-worse-america-than-his-victory-columnist-argues",
    "timestamp": "2025-07-13T15:07:03Z"
  },
  {
    "title": "'He fueled it': ABC panel pummels Trump after MAGA revolts over Epstein",
    "description": "An ABC News panel blamed President Donald Trump after part of the MAGA base turned on him for dropping the case against Jeffrey Epstein's alleged co-conspirators.During a Sunday discussion, This Week host Jonathan Karl wondered if the \"boys and gals of Team M…",
    "link": "https://www.rawstory.com/trump-fueled-epstein-conspiracy-theories/",
    "timestamp": "2025-07-13T15:03:20Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is estimated to leave millions without health care. He insists ‘it’s not going to cause death’",
    "description": "President Donald Trump defended his “Big, Beautiful, Bill” during a Fox News interview broadcast on Saturday night, claiming \"it's not going to cause death",
    "link": "https://www.newsbreak.com/share/4104549240121-trump-s-big-beautiful-bill-is-estimated-to-leave-millions-without-health-care-he-insists-it-s-not-going-to-cause-death?s=a2&amp;share_destination_id=MTk3NzQ1MTkzLTE3NTI0MTg4MDE2Mjc%3D&amp;pd=0DNiYbQE&amp;hl=en_US&amp;send_time=1752418801&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v3%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v3",
    "timestamp": "2025-07-13T15:00:30Z"
  }
]