[
  {
    "title": "Will Patriots promised by Trump boost Ukraine’s defence against Russia?",
    "description": "The weapons may stop some attacks but don't cross a red line for Putin and fall short of Kyiv's needs, analysts say.",
    "link": "https://www.aljazeera.com/news/2025/7/15/will-patriots-promised-by-trump-boost-ukraines-defence-against-russia",
    "timestamp": "2025-07-15T09:57:28Z"
  },
  {
    "title": "CoreWeave to Invest $6 Billion in Pennsylvania AI Data Center",
    "description": "CoreWeave Inc., a provider of AI computing power to companies including OpenAI Inc. and Microsoft Corp., said it plans to invest as much as $6 billion to set up a data center in Lancaster, Pennsylvania, as the firm expands its capacity across the US.",
    "link": "https://financialpost.com/pmn/business-pmn/coreweave-to-invest-6-billion-in-pennsylvania-ai-data-center",
    "timestamp": "2025-07-15T09:52:58Z"
  },
  {
    "title": "Indonesia targets new fish markets to counter US tariff threat",
    "description": "Indonesia needs to leverage the economic potential of the fisheries sector by opening new market opportunities to anticipate the impact of reciprocal tariffs ...",
    "link": "https://en.antaranews.com/news/366481/indonesia-targets-new-fish-markets-to-counter-us-tariff-threat",
    "timestamp": "2025-07-15T09:52:55Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "June inflation data released Tuesday represented an increase from May levels, despite the headline numbers matching expectations.",
    "link": "https://www.cnbc.com/2025/07/15/stock-market-today-live-updates.html",
    "timestamp": "2025-07-15T09:52:14Z"
  },
  {
    "title": "Ed Gainey, Summer Lee protest President Donald Trump's visit to Carnegie Mellon University",
    "description": "",
    "link": "https://biztoc.com/x/28aecfa384fcc801",
    "timestamp": "2025-07-15T09:51:20Z"
  },
  {
    "title": "Single mother says she will likely ask her 14-year-old to drop sports and work to watch his little brother because of Trump after-school education cuts",
    "description": "More than 20 states sued President Donald Trump’s administration on Monday over billions of dollars in frozen education funding for after-school care, summer programs and more.\nSome of the withheld money funds after-school and summer programming at Boys & Gir…",
    "link": "https://biztoc.com/x/0bb1dbaf5ec8ae8d",
    "timestamp": "2025-07-15T09:51:19Z"
  },
  {
    "title": "Former Biden Campaign Lawyer Now Works In Trump Justice Department",
    "description": "By Tyler O'Neil, The Daily Signal | July 13, 2025\nA lawyer who worked for Joe Biden’s 2020 presidential campaign and for two different offices in the Biden White House now works in President Donald Trump’s administration as an ostensibly nonpolitical staffer …",
    "link": "https://biztoc.com/x/3b7a08e0d31a1e30",
    "timestamp": "2025-07-15T09:51:17Z"
  },
  {
    "title": "Fox News Star Hits Trump With A Cold Truth About His Relationship With Putin",
    "description": "Although Trump \"wouldn’t put it this way,\" admitted Brit Hume.",
    "link": "https://www.huffpost.com/entry/fox-news-brit-hume-donald-trump-played_n_687602b2e4b084ccb1aa04f0",
    "timestamp": "2025-07-15T09:48:09Z"
  },
  {
    "title": "Single mother says she will likely ask her 14-year-old to drop sports and work to watch his little brother because of Trump after-school education cuts",
    "description": "Over 20 states are suing the Trump administration for freezing billions in after-school and summer funding.",
    "link": "https://fortune.com/2025/07/15/20-states-suing-trump-freezing-billions-after-school-summer-funding/",
    "timestamp": "2025-07-15T09:45:39Z"
  },
  {
    "title": "'Its a match': White House's cheeky Tinder post as ICE arrests Chinese national, now she faces deportation",
    "description": "The ICE arrested a Chinese national Jiejun Shen, who now faces deportation, for attempting to finesse a fake wedding. But the White House in a Tinder-style post used phrases like 'Its a Match' and 'swiped right' to make the announcement on its official X acco…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-its-a-match-white-houses-cheeky-tinder-post-as-ice-arrests-chinese-national-now-she-faces-deportation/articleshow/122500186.cms",
    "timestamp": "2025-07-15T09:43:28Z"
  },
  {
    "title": "Trump Raised Striking Moscow, St Petersburg in Zelensky Call: Reports",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump asked Ukrainian President Volodymyr Zelensky if he could strike Moscow and St. Petersburg if Washington supplied the necessary weapons, according to new reports on a recent call bet…",
    "link": "https://biztoc.com/x/fa46d4d688a3cf8d",
    "timestamp": "2025-07-15T09:40:40Z"
  },
  {
    "title": "Trump Administration Denying Migrants Bond Hearings",
    "description": "The administration plans to keep migrants who entered the U.S. unlawfully in federal custody by denying them bond hearings.",
    "link": "https://www.newsweek.com/trump-administration-migrants-bond-hearings-2099000",
    "timestamp": "2025-07-15T09:39:56Z"
  },
  {
    "title": "'This is not our war' - Trump's Nato weapons deal sparks MAGA anger",
    "description": "Marjorie Taylor Greene, a key Trump ally, and former Trump strategist Steve Bannon have criticised the move.",
    "link": "https://www.bbc.com/news/articles/c14e2ydv4d6o",
    "timestamp": "2025-07-15T09:38:38Z"
  },
  {
    "title": "CoreWeave commits $6 billion to Pennsylvania data center amid Trump AI push",
    "description": "CoreWeave plans to spend up to $6 billion on building a new artificial intelligence data center in Pennsylvania, as part of a push by U.S. President Donald Trump to maintain the country’s edge in the booming technology sector, the company said on Tuesday.Shar…",
    "link": "https://www.channelnewsasia.com/business/coreweave-commits-6-billion-pennsylvania-data-center-amid-trump-ai-push-5239226",
    "timestamp": "2025-07-15T09:38:09Z"
  },
  {
    "title": "China's Xi Vows Greater Support For Russia As Meets Lavrov",
    "description": "Chinese President Xi Jinping told Russia's top diplomat on Tuesday that their countries should \"strengthen mutual support\", state media said, as foreign ministers gathered in Beijing for Shanghai Cooperation Organisation talks.",
    "link": "https://www.ibtimes.com/chinas-xi-vows-greater-support-russia-meets-lavrov-3778507",
    "timestamp": "2025-07-15T09:36:17Z"
  },
  {
    "title": "China’s Xi vows greater support for Russia as meets Lavrov",
    "description": "Chinese President Xi Jinping told Russia’s top diplomat on Tuesday that their countries should “strengthen mutual support”, state media said, as foreign ministers gathered in Beijing for Shanghai Cooperation Organisation talks. Beijing has long sought to pres…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-vows-greater-support-for-russia-as-meets-lavrov/article",
    "timestamp": "2025-07-15T09:32:20Z"
  },
  {
    "title": "ICICI Prudential Life Q1 Results: Profit jumps 34% YoY as premiums rise, costs fall",
    "description": "ICICI Prudential Life Insurance reported a 34% surge in first-quarter profit, reaching 3.02 billion rupees, driven by increased group policy premiums and reduced operating costs. Net premium income rose 8% to 85.03 billion rupees, fueled by a 20% jump in sing…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-prudential-life-q1-results-profit-jumps-34-yoy-as-premiums-rise-costs-fall/articleshow/122499672.cms",
    "timestamp": "2025-07-15T09:30:47Z"
  },
  {
    "title": "NEA teachers union member was told fighting Trump more crucial than reading and writing: Report",
    "description": "A teachers union convention attendee reportedly was told fighting President Trump was more important to members than teaching reading and writing.",
    "link": "https://www.foxnews.com/media/nea-teachers-union-member-told-fighting-trump-more-crucial-than-reading-writing-report",
    "timestamp": "2025-07-15T09:30:44Z"
  },
  {
    "title": "Trump Raised Striking Moscow, St Petersburg in Zelensky Call: Reports",
    "description": "Trump is hardening his stance against Putin and Russia to end the war in Ukraine.",
    "link": "https://www.newsweek.com/trump-zelensky-moscow-st-petersburg-putin-russia-strikes-2099034",
    "timestamp": "2025-07-15T09:30:32Z"
  },
  {
    "title": "Trump’s copper tariff: Twisted logic won’t help re-industrialize America",
    "description": "A tax burden on users of this metal would be a strange way for the US to try ascending the manufacturing value chain. America’s protectionist policies under Trump seem dictated by nostalgia economics, harking back to the country’s early days.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-us-copper-tariff-trade-policy-manufacturing-semiconductor-industry-shipbuilding-industry-chile-peru-protect-11752505295660.html",
    "timestamp": "2025-07-15T09:30:09Z"
  },
  {
    "title": "This viral travel ad for Canada is trying to woo American tourists",
    "description": "To help American visitors feel more welcome in Canada at time when relations are strained, one local tourism office is playing Canada nice.\n\n\n\nIn a 30-second spot, a tourist shown checking in at a hotel front desk tells the receptionist he doesn’t speak Frenc…",
    "link": "https://www.fastcompany.com/91367512/this-viral-travel-ad-for-canada-is-trying-to-woo-american-tourists",
    "timestamp": "2025-07-15T09:30:00Z"
  },
  {
    "title": "80 Years After Trinity, the Dangers of Nuclear War Have Never Been Higher",
    "description": "Norman Solomon\n\n\n\nYet mainstream US media outlets and partisan politics are routinely oblivious to threat of oblivion.\r\n\n\r\n\n\nThe post 80 Years After Trinity, the Dangers of Nuclear War Have Never Been Higher appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=563384",
    "timestamp": "2025-07-15T09:30:00Z"
  },
  {
    "title": "Trump Economy Defies Doomsday Predictions",
    "description": "By EJ Antoni via The Daily Signal | July 13, 2025\nMany so-called experts predicted that President Donald Trump’s economic agenda would usher in an inflationary Armageddon. This projection was so often repeated in the media that many Americans, especially Demo…",
    "link": "https://biztoc.com/x/efdc8d8fc65bd2d0",
    "timestamp": "2025-07-15T09:29:37Z"
  },
  {
    "title": "Trump Says He’s ‘Not Done’ With Putin As Russian Official Mocks ‘Theatrical’ Tariff Threat",
    "description": "The president left the door open for talks with his Russian counterpart but complained about Russia’s continued aerial attacks on Ukraine.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/15/trump-says-hes-not-done-with-putin-as-russian-official-mocks-theatrical-tariff-threat/",
    "timestamp": "2025-07-15T09:26:42Z"
  },
  {
    "title": "Nvidia to Resume AI Chip Sales in China After Trump Meeting",
    "description": "Nvidia has announced plans to resume sales of its H20 artificial intelligence (AI) chip in China. This comes just days after CEO Jensen Huang met ...\nThe post Nvidia to Resume AI Chip Sales in China After Trump Meeting appeared first on Gizchina.com.",
    "link": "https://www.gizchina.com/2025/07/15/nvidia-to-resume-ai-chip-sales-in-china-after-trump-meeting/",
    "timestamp": "2025-07-15T09:24:23Z"
  },
  {
    "title": "Israel Hits Syrian Tanks Advancing to Border; Protects Druze Arab Villages",
    "description": "Israel said Monday that it had carried out airstrikes on Syrian tanks advancing toward the border region -- and toward Druze villages that former jihadist forces linked to the government are suspected of targeting.\nThe post Israel Hits Syrian Tanks Advancing …",
    "link": "https://www.breitbart.com/middle-east/2025/07/15/israel-hits-syrian-tanks-advancing-to-border-protects-druze-villages/",
    "timestamp": "2025-07-15T09:21:31Z"
  },
  {
    "title": "Trump says UK would fight for US, suggests cannot say the same for EU",
    "description": "Donald Trump expressed doubts about the European Union and NATO's willingness to defend the United States. He believes Britain would stand by America. This sentiment influences his trade decisions. He has granted Britain exemptions from tariffs. However, he h…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-uk-would-fight-for-us-suggests-cannot-say-the-same-for-eu/articleshow/122499161.cms",
    "timestamp": "2025-07-15T09:20:59Z"
  },
  {
    "title": "For Elon Musk's Tesla, India is not a straight drive",
    "description": "Tesla has officially entered the Indian market with its first showroom in Mumbai, signaling its intent to explore the country's potential. However, high import duties and geopolitical factors pose significant challenges. The company's success hinges on naviga…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/for-elon-musks-tesla-india-is-not-a-straight-drive/articleshow/122498989.cms",
    "timestamp": "2025-07-15T09:20:00Z"
  },
  {
    "title": "The world's 'football' is America's 'soccer': Trump signaled that could change",
    "description": "Trump appears to have caught the bug for what the British call \"the Beautiful Game.\"",
    "link": "https://www.cnbc.com/2025/07/15/trump-says-soccer-could-be-renamed-to-football.html",
    "timestamp": "2025-07-15T09:19:31Z"
  },
  {
    "title": "Obama slams Big Law attorneys who won't fight Trump because they want to 'finish that kitchen rehab' at their Hamptons homes",
    "description": "Former President Barack Obama said he was \"not impressed\" at how several Big Law firms had caved in to pressure from the Trump administration.\nScott Olson via Getty Images\nFormer President Barack Obama took aim at Big Law firms that have tried to work with Pr…",
    "link": "https://biztoc.com/x/daee0b6b9177de09",
    "timestamp": "2025-07-15T09:18:38Z"
  },
  {
    "title": "Trump Makes ‘Experts’ Eat Their Words With Record-Breaking 3 Weeks",
    "description": "By Victor Davis Hanson, The Daily Signal | July 14, 2025\nHello, this is Victor Davis Hanson for The Daily Signal. Everyone is talking about President Donald Trump’s big last three weeks in praise.\nI mean, after all, when you look at foreign policy, he elimina…",
    "link": "https://biztoc.com/x/ba3d47659d9800bf",
    "timestamp": "2025-07-15T09:18:28Z"
  },
  {
    "title": "TikTok developing separate app for US amid mounting sale pressure; Beijing approval still key",
    "description": "On July 9, Reuters reported, citing anonymous sources, that TikTok is working on a standalone app for US users built on a distinct algorithm and data infrastructure separate from its global platform. Earlier, The Information also reported that TikTok was deve…",
    "link": "http://technode.com/2025/07/15/tiktok-developing-separate-app-for-us-amid-mounting-sale-pressure-beijing-approval-still-key/",
    "timestamp": "2025-07-15T09:18:09Z"
  },
  {
    "title": "Bourbon and Boeing to be targeted in EU retaliatory tariffs despite Government lobbying",
    "description": "European Union readying counter-tariffs on US products should talks fail",
    "link": "https://www.irishtimes.com/business/economy/2025/07/15/bourbon-and-boeing-to-be-targeted-in-eu-retaliatory-tariffs-despite-government-lobbying/",
    "timestamp": "2025-07-15T09:16:48Z"
  },
  {
    "title": "Investor Ross Gerber is even more bearish on Tesla after Trump's tax bill. Here's how much further he thinks the stock could fall.",
    "description": "Ross Gerber told BI that \"there's nothing good for Tesla\" in Trump's budget bill, and the stock should be trading  more in line with mega-cap peers.",
    "link": "https://www.businessinsider.com/tesla-stock-price-prediction-ross-gerber-tax-bill-ev-credits-2025-7",
    "timestamp": "2025-07-15T09:15:01Z"
  },
  {
    "title": "Trump asked Zelenskiy if Ukraine could hit Moscow, FT reports",
    "description": "According to the Financial Times, Donald Trump has reportedly urged Ukraine to conduct deeper strikes within Russia. Trump allegedly inquired of Volodymyr Zelenskiy whether Ukraine could strike Moscow if the U.S. supplied long-range weaponry. The White House …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-asked-zelenskiy-if-ukraine-could-hit-moscow-ft-reports/articleshow/122498812.cms",
    "timestamp": "2025-07-15T09:13:51Z"
  },
  {
    "title": "U.S. Treasurys fall ahead of key June inflation data",
    "description": "U.S. Treasury yields fell ahead of key inflation figures due Tuesday which may offer further insights into the Federal Reserve's potential interest rate moves.",
    "link": "https://www.cnbc.com/2025/07/15/us-treasurys-fall-ahead-of-key-june-inflation-data.html",
    "timestamp": "2025-07-15T09:13:10Z"
  },
  {
    "title": "Obama slams Big Law attorneys who won't fight Trump because they want to 'finish that kitchen rehab' at their Hamptons homes",
    "description": "\"I'm not impressed,\" former President Barack Obama said at a private fundraiser.",
    "link": "https://www.businessinsider.com/obama-rips-big-law-caving-in-trump-fund-hamptons-renos-2025-7",
    "timestamp": "2025-07-15T09:09:13Z"
  },
  {
    "title": "Chelsea’s Photo After Trump Gatecrash Is Being Read As A Masterclass In Subtle Shade",
    "description": "The Club World Cup champions didn't, contrary to online rumors, edit the president from its snap. But critics do think the image choice made a statement.",
    "link": "https://www.huffpost.com/entry/chelsea-photo-donald-trump-soccer_n_6876066ee4b0b1c6f125b1c0",
    "timestamp": "2025-07-15T09:09:11Z"
  },
  {
    "title": "Nvidia poised for major boost after CEO Jensen Huang gets Trump to approve AI chip sales to China",
    "description": "Nvidia has profited enormously from rapid adoption of AI, becoming the first company to have its market value surpass $4 trillion last week.",
    "link": "https://fortune.com/2025/07/15/nvidia-jensen-huang-trump-approve-ai-chip-sales-china/",
    "timestamp": "2025-07-15T09:07:38Z"
  },
  {
    "title": "Supreme Court says Trump can lay off 1,400 at Education Department, allowing him to send department functions ‘BACK TO THE STATES’",
    "description": "The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off nearly 1,400 employees.\nWith the three liberal justices in dissent, the court on Monday paused an orde…",
    "link": "https://biztoc.com/x/b5c047e098fafc67",
    "timestamp": "2025-07-15T09:07:08Z"
  },
  {
    "title": "I'm 'disappointed but not done' with Putin, Trump tells BBC (Gary O'Donoghue/BBC)",
    "description": "Gary O'Donoghue / BBC:\nI'm ‘disappointed but not done’ with Putin, Trump tells BBC  —  Donald Trump has said that he is disappointed but not done with Vladimir Putin, in an exclusive phone call with the BBC.  —  The US president was pressed on whether he trus…",
    "link": "https://www.memeorandum.com/250715/p4",
    "timestamp": "2025-07-15T09:05:00Z"
  },
  {
    "title": "Nvidia’s CEO says it gained US approval to sell H20 AI chips to China",
    "description": "Jensen Huang says Trump administration has assured his company it will be granted licences to export advanced chips.",
    "link": "https://www.aljazeera.com/economy/2025/7/15/nvidias-ceo-says-it-gained-us-approval-to-sell-h20-ai-chips-to-china",
    "timestamp": "2025-07-15T09:04:35Z"
  },
  {
    "title": "Mike Waltz To Face Grilling Over Signal Chat At Senate Hearing For U.N. Role",
    "description": "The former Republican congressman will take questions from lawmakers for the first time since he was ousted as national security adviser.",
    "link": "https://www.huffpost.com/entry/mike-waltz-senate-hearing-for-un-role_n_687616a3e4b084ccb1aa0c79",
    "timestamp": "2025-07-15T09:03:08Z"
  },
  {
    "title": "Inflation report to arrive as Trump, Fed disagree over tariff risks",
    "description": "Inflation has cooled this year, defying the fears of many economists.",
    "link": "https://abcnews.go.com/US/inflation-report-arrive-trump-fed-disagree-tariff-risks/story?id=123735983",
    "timestamp": "2025-07-15T09:02:24Z"
  },
  {
    "title": "Israel Holds Talks With Countries That Could Take In Gazans Under Trump Plan",
    "description": "TEL AVIV—Israel began talks on Monday with third countries about taking in Gazans under a mass emigration plan first proposed by President Donald Trump, three people familiar with the matter told the Washington Free Beacon.\nIsraeli prime minister Benjamin Net…",
    "link": "https://freebeacon.com/israel/israel-enters-talks-with-third-countries-over-trumps-gaza-emigration-plan/",
    "timestamp": "2025-07-15T09:00:55Z"
  },
  {
    "title": "How the AI Revolution Is Straining American Energy",
    "description": "Electric bills for millions of Americans are expected to rise by more than 20 percent in the coming months. The number of power grid blackouts could double by 2030. Electricity demand in that same time period will skyrocket, far surpassing current levels.\nThe…",
    "link": "https://freebeacon.com/energy/how-the-ai-revolution-is-straining-american-energy/",
    "timestamp": "2025-07-15T09:00:48Z"
  },
  {
    "title": "Rosie O'Donnell, Donald Trump's citizenship feud caps decades of taunts and jabs",
    "description": "From name-calling to online spats, Rosie O’Donnell and President Donald Trump have gone head-to-head with each other for nearly two decades.",
    "link": "https://www.foxnews.com/entertainment/rosie-odonnell-donald-trumps-citizenship-feud-caps-decades-taunts-jabs",
    "timestamp": "2025-07-15T09:00:33Z"
  },
  {
    "title": "MORNING GLORY: Just how bad were the Biden and Harris campaigns?",
    "description": "New book '2024' reveals Democratic senators' panic after Biden's debate, including Senator Reed's call for neurological tests, while detailing dysfunction in Biden and Harris campaigns.",
    "link": "https://www.foxnews.com/opinion/morning-glory-just-how-bad-were-biden-harris-campaigns",
    "timestamp": "2025-07-15T09:00:30Z"
  },
  {
    "title": "LIZ PEEK: Democrats' identity crisis shows no sign of getting better. It's actually getting worse",
    "description": "Recent polls show Democrats are perceived as 'out of touch' and 'weak' by many voters, as the party struggles with immigration policies and the rise of socialist candidates.",
    "link": "https://www.foxnews.com/opinion/liz-peek-democrats-identity-crisis-shows-no-sign-getting-better-its-actually-getting-worse",
    "timestamp": "2025-07-15T09:00:13Z"
  },
  {
    "title": "What To Expect From Visa's Q3 Earnings?",
    "description": "This includes non-transactional offerings such as fraud protection, risk and security solutions, advisory services, and merchant services...",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/07/15/what-to-expect-from-visas-q3-earnings/",
    "timestamp": "2025-07-15T09:00:07Z"
  },
  {
    "title": "Hegel Dust",
    "description": "A little-known philosopher’s deep influence over the avant-garde, neoconservatives, and the European Union\r\n – Ryan Ruby",
    "link": "https://www.bookforum.com/print/3201/hegel-dust-62209",
    "timestamp": "2025-07-15T09:00:01Z"
  },
  {
    "title": "A Little-Known Microsoft Program Could Expose the Defense Department to Chinese Hackers",
    "description": "by Renee Dudley, with research by Doris Burke \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nMicrosoft is using engineers in China to help mai…",
    "link": "https://www.propublica.org/article/microsoft-digital-escorts-pentagon-defense-department-china-hackers",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "Alligator Alcatraz: The ICE Detention Center Is a Sin Against Nature",
    "description": "The effort to turn part of the Everglades into a prison for migrants desecrates the famed Florida ecosystem.\nThe post Alligator Alcatraz: The ICE Detention Center Is a Sin Against Nature appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/15/alligator-alcatraz/",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "'Working families tax cut': Republicans look for new ways to sell the 'big, beautiful bill'",
    "description": "Democrats are poised to contest the Republican talking points about the \"big, beautiful bill\" at every turn, emphasizing the cuts to Medicaid.",
    "link": "https://www.nbcnews.com/politics/trump-administration/working-families-tax-cut-republicans-sell-big-beautiful-bill-medicaid-rcna217868",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "Rogue Trump impeachment efforts divide House Democrats",
    "description": "Democratic leaders have tried to squash impeachment pushes from rank-and-file lawmakers as progressives urge the party to fight harder against Trump.",
    "link": "https://www.nbcnews.com/politics/congress/rogue-trump-impeachment-efforts-divide-house-democrats-rcna218635",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "Former Jan. 6 committee lawyer launches Democratic bid for Congress in Florida",
    "description": "A former lawyer for the House committee that investigated the Jan.",
    "link": "https://www.nbcnews.com/politics/2026-election/former-jan-6-committee-lawyer-launches-democratic-bid-congress-florida-rcna218473",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "Trump Is the Confederacy’s Revenge",
    "description": "Mark Hertsgaard\n\n\n\nA mass shooting in New Orleans eerily foretold the return of white supremacy to the White House.\r\n\n\r\n\n\nThe post Trump Is the Confederacy’s Revenge appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=562272",
    "timestamp": "2025-07-15T09:00:00Z"
  },
  {
    "title": "Donald Trump warns he's 'not done' with Putin as he gives intense update on situation during phone call",
    "description": "US president Donald Trump has revealed where him and Vladimir Putin currently stand given his increasing frustration with the ongoing invasion of Ukraine.",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-vladimir-putin-ukraine-war-update-453445-20250715",
    "timestamp": "2025-07-15T08:59:11Z"
  },
  {
    "title": "Stephen Colbert Exposes Most Baffling Part Of Trump's Latest Rant",
    "description": "Stephen Colbert Exposes Most Baffling Part Of Trump's Latest Ranthuffpost.com",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-epstein_n_68760a0ce4b025efd81d579b",
    "timestamp": "2025-07-15T08:56:23Z"
  },
  {
    "title": "EU-China trade tension on display ahead of Beijing summit",
    "description": "The summit was moved from Brussels to Beijing, then reduced to one day from two. As the European Union struggles to curb China's unfair trade practices, are tougher tactics needed to cut the €400 billion trade deficit?",
    "link": "https://www.dw.com/en/eu-china-trade-tension-on-display-ahead-of-beijing-summit/a-73213412",
    "timestamp": "2025-07-15T08:56:00Z"
  },
  {
    "title": "Gems and jewellery exports decline 14.25% in June amid economic uncertainties and geopolitical tensions",
    "description": "India's gem and jewellery exports witnessed a 14.25% decline in June, totaling USD 1626.96 million, attributed to global economic uncertainties and geopolitical tensions. Cut and polished diamond exports fell sharply by 23.49%, impacted by reduced consumer sp…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/gems-and-jewellery-exports-decline-14-25-in-june-amid-economic-uncertainties-and-geopolitical-tensions/articleshow/122497719.cms",
    "timestamp": "2025-07-15T08:53:34Z"
  },
  {
    "title": "Markets Lifted By U.S.-China Chips Hope Ahead of Bank Earnings and Key Inflation Data",
    "description": "Dow futures are falling, S&P 500 and Nasdaq futures are rising in premarket trading on a busy day for the stock market as investors digest news on a China chips embargo, Trump tariff threats on Russia, and brace for big bank earnings and CPI inflation data.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-071525",
    "timestamp": "2025-07-15T08:47:21Z"
  },
  {
    "title": "Trump's Ouster Of Fed Chair Powell Could Trigger 'Collapse' Of Currency And Bond Market, Deutsche Bank Warns",
    "description": "Deutsche Bank has issued a warning about the potential consequences of President Donald Trump replacing Jerome Powell as the head of the U.S. Federal Reserve.\nWhat Happened: A research note titled “What if?” was published by the bank’s global head of FX resea…",
    "link": "https://biztoc.com/x/dbe604b6b452087d",
    "timestamp": "2025-07-15T08:44:49Z"
  },
  {
    "title": "BBC Journalist Accidentally Hung Up On Donald Trump Ahead Of Rare & Reflective Interview",
    "description": "BBC News journalist Gary O’Donoghue has admitted he accidentally put the phone down on Donald Trump ahead of the UK broadcaster’s first exclusive interview with a U.S. president in a decade. O’Donoghue, the BBC’s chief North America Correspondent, said he was…",
    "link": "http://deadline.com/2025/07/bbc-donald-trump-interview-gary-odonoghue-1236457434/",
    "timestamp": "2025-07-15T08:44:30Z"
  },
  {
    "title": "Lavrov Emphasizes the Need for a Peaceful Resolution to Iran's Nuclear Program Crisis",
    "description": "MOSCOW (Sputnik) - Russian Foreign Minister Sergey Lavrov emphasized the importance of resolving the crisis over Iran's nuclear program through political and diplomatic efforts during a meeting with his Iranian counterpart Abbas Araghchi on Tuesday, according…",
    "link": "https://sputnikglobe.com/20250715/lavrov-emphasizes-the-need-for-a-peaceful-resolution-to-irans-nuclear-program-crisis-1122442781.html",
    "timestamp": "2025-07-15T08:39:41Z"
  },
  {
    "title": "Nissan to close its Oppama plant in Japan to cut costs",
    "description": "Vehicle production at the Oppama plant in Kanagawa Prefecture, south of Tokyo, will end at the end of the 2027 fiscal year, in March 2028, the Japanese automaker said Tuesday in a statement",
    "link": "https://www.thehindubusinessline.com/companies/nissan-to-close-its-oppama-plant-in-japan-to-cut-costs/article69814158.ece",
    "timestamp": "2025-07-15T08:36:24Z"
  },
  {
    "title": "Ellen DeGeneres makes rare political comment in support of Rosie O’Donnell after Trump threatens her citizenship",
    "description": "O’Donnell fired back at Trump’s threat on Saturday, saying she was ‘everything [he] feared’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/ellen-degeneres-rosie-odonnell-trump-citizenship-b2789104.html",
    "timestamp": "2025-07-15T08:35:16Z"
  },
  {
    "title": "Trump promised to lower energy costs – his tax bill will raise them for people in red states the most",
    "description": "The cost of electricity is poised to surge across the US in the wake of Republican legislation that takes an axe to cheap renewable energy, with people in states who voted for Donald Trump last year to be hardest hit by the increase in bills.\nAs air condition…",
    "link": "https://biztoc.com/x/f9f7b3567798ca1a",
    "timestamp": "2025-07-15T08:34:13Z"
  },
  {
    "title": "Barry Eichengreen: Germany’s budget expansion makes sense while America’s is reckless",
    "description": "Berlin is relaxing its austerity rule for good reasons—such as security and long-term growth—while Washington appears to have abandoned all fiscal responsibility with Trump’s One Big Beautiful Bill. Where this will leave the US is a question we can’t duck.",
    "link": "https://www.livemint.com/opinion/online-views/us-budget-germany-budget-donald-trump-friedrich-merz-congressional-budget-office-byrd-rule-republican-party-germany-debt-11752505192074.html",
    "timestamp": "2025-07-15T08:30:08Z"
  },
  {
    "title": "Iran's President Gives Major Update on Nuclear Talks",
    "description": "President says Iran is pursing a peaceful path and using all resources to prevent war",
    "link": "https://www.newsweek.com/iran-nuclear-talks-update-2098972",
    "timestamp": "2025-07-15T08:25:23Z"
  },
  {
    "title": "Trump says he’s ‘not done with’ Putin",
    "description": "President Donald Trump has told the BBC he is “disappointed” in Russian counterpart Vladimir Putin but “not done with him” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621500-trump-not-done-putin/",
    "timestamp": "2025-07-15T08:24:58Z"
  },
  {
    "title": "President Xi Jinping tells Albanese China ready to ‘push the bilateral relationship further’",
    "description": "Anthony Albanese and Chinese President Xi Jinping exchanged warm words and promised to strength the relationship after talks to Beijing.",
    "link": "https://theconversation.com/president-xi-jinping-tells-albanese-china-ready-to-push-the-bilateral-relationship-further-261094",
    "timestamp": "2025-07-15T08:24:40Z"
  },
  {
    "title": "US planes, cars, drinks on EU list for potential tariffs",
    "description": "BRUSSELS (Reuters) -Aircraft, machinery, cars, chemicals and medical devices are the leading big-ticket items on the latest list of U.S. goods the European Commission has proposed to impose tariffs on if talks with Washington do not yield an agreement on trad…",
    "link": "https://www.thestar.com.my/news/world/2025/07/15/us-planes-cars-drinks-on-eu-list-for-potential-tariffs",
    "timestamp": "2025-07-15T08:22:00Z"
  },
  {
    "title": "Chinese firms scramble to buy Nvidia AI chips as it plans to resume sales",
    "description": "Nvidia is seeking U.S. approval to resume H20 AI chip sales in China, prompting Chinese firms to place orders. This follows CEO Jensen Huang's meeting with U.S. officials and the development of chips tailored to meet U.S. export regulations. Despite competiti…",
    "link": "https://economictimes.indiatimes.com/tech/technology/chinese-firms-scramble-to-buy-nvidia-ai-chips-as-it-plans-to-resume-sales/articleshow/122495841.cms",
    "timestamp": "2025-07-15T08:16:59Z"
  },
  {
    "title": "China Responds to Lindsey Graham Russia Threat",
    "description": "The U.S. senator said China would feel the heat of his proposal as President Trump gives Russia a deadline.",
    "link": "https://www.newsweek.com/china-russia-trump-tariffs-ukraine-war-graham-2099008",
    "timestamp": "2025-07-15T08:16:42Z"
  },
  {
    "title": "Why Marco Rubio’s Asia Visit Was a Total Bust",
    "description": "ASEAN leaders will have noticed that Washington is increasingly preoccupied with the Middle East and Western Hemisphere.",
    "link": "http://foreignpolicy.com/2025/07/15/rubio-asia-asean-malaysia-indo-pacific-us-china-geopolitics/",
    "timestamp": "2025-07-15T08:04:33Z"
  },
  {
    "title": "The 9 at 9: Tuesday",
    "description": "Tánaiste says proposed Trump tariffs could lead to Irish job losses, electricity prices not declining in line with other EU countries, and renewed appeal for information on murder of Paul Byrne.",
    "link": "https://www.thejournal.ie/9-at-9-15-07-25-6763133-Jul2025/",
    "timestamp": "2025-07-15T08:01:00Z"
  },
  {
    "title": "Here’s Why Donald Trump Threatened To Revoke US-Born Rosie O’Donnell’s Citizenship (And Could He?)",
    "description": "This week, President Donald Trump unleashed a new salvo in his long-running feud with comedian and activist Rosie O’Donnell — threatening to “give serious consideration” to revoking her US citizenship. ...\nThe post Here’s Why Donald Trump Threatened To Revoke…",
    "link": "https://www.starobserver.com.au/news/heres-why-donald-trump-threatened-to-revoke-us-born-rosie-odonnells-citizenship-and-could-he/237626",
    "timestamp": "2025-07-15T07:58:17Z"
  },
  {
    "title": "US planes, cars, drinks on EU list for potential tariffs",
    "description": "BRUSSELS (Reuters) -Aircraft, machinery, cars, chemicals and medical devices are the leading big-ticket items on the latest list of U.S. goods the European...",
    "link": "https://finance.yahoo.com/news/us-planes-cars-drinks-eu-075715032.html",
    "timestamp": "2025-07-15T07:57:15Z"
  },
  {
    "title": "A Gen Xer self-deported to Mexico after 36 years in the US for a safer, more affordable life: \"I feel a sense of relief\"",
    "description": "Faced with the risk of ICE detention, Regina Higuera decided to leave her family behind in the US to move back to Mexico.",
    "link": "https://www.businessinsider.com/gen-xer-self-deports-to-mexico-ice-arrests-2025-7",
    "timestamp": "2025-07-15T07:57:01Z"
  },
  {
    "title": "Trump attending major energy and AI summit in Pittsburgh Tuesday",
    "description": "A number of political leaders and big names from the tech and AI industries are expected to be there.",
    "link": "https://www.cbsnews.com/pittsburgh/news/trump-energy-ai-summit-pittsburgh-carnegie-mellon/",
    "timestamp": "2025-07-15T07:56:00Z"
  },
  {
    "title": "European Stocks Rise on Possible US Trade Talks; Tech Gains",
    "description": "European stocks ticked up on Tuesday after US President Donald Trump indicated he is open to more trade negotiations with the European Union and Nvidia Corp. said it planned to resume sales of its H20 AI chip to China after securing Washington’s backing.",
    "link": "https://financialpost.com/pmn/business-pmn/european-stocks-rise-on-possible-us-trade-talks-tech-gains",
    "timestamp": "2025-07-15T07:55:36Z"
  },
  {
    "title": "Elmo's X Account Gets Hacked, Sesame Street Muppet's Account Spews Antisemitic And Anti-Trump Posts",
    "description": "Just days after Elon Musk's AI chatbot Grok made some antisemitic comments, the official X, formerly Twitter, account of Elmo was hacked and flooded with anti-Donald Trump content.\nWhat Happened: On Sunday, The X account of the Sesame Street muppet, which has…",
    "link": "https://biztoc.com/x/2c0e64310411418a",
    "timestamp": "2025-07-15T07:49:08Z"
  },
  {
    "title": "Stubb welcomes Trump plan to send more weapons to Ukraine",
    "description": "The Finnish president said Donald Trump's 50-day ceasefire deadline —and the threat of more sanctions — are key in pushing Russia to the negotiating table.",
    "link": "https://yle.fi/a/74-20172685",
    "timestamp": "2025-07-15T07:48:25Z"
  },
  {
    "title": "European shares edge higher as US-EU trade talks hopes buoy sentiment",
    "description": "European shares experienced a slight increase, propelled by gains in automobile stocks, following President Trump's indication of potential tariff negotiations with the EU. The STOXX 600 index rose by 0.2%. This positive movement occurred despite earlier EU a…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-as-us-eu-trade-talks-hopes-buoy-sentiment/articleshow/122494089.cms",
    "timestamp": "2025-07-15T07:43:23Z"
  },
  {
    "title": "Tesla debuts in India with upscale showroom launch in Mumbai",
    "description": "Tesla has opened its first showroom in India, marking the electric vehicle maker’s long-anticipated debut in the world’s third-biggest automotive market",
    "link": "https://abcnews.go.com/International/wireStory/tesla-debuts-india-upscale-showroom-launch-mumbai-123759281",
    "timestamp": "2025-07-15T07:42:23Z"
  },
  {
    "title": "Mike Waltz to face grilling over Signal chat at Senate hearing for UN role",
    "description": "Mike Waltz will face questioning from lawmakers for the first time since he was ousted as national security adviser",
    "link": "https://abcnews.go.com/US/wireStory/mike-waltz-face-grilling-signal-chat-senate-hearing-123757847",
    "timestamp": "2025-07-15T07:42:17Z"
  },
  {
    "title": "Asian shares mostly finish higher although worries continue over Trump's tariffs",
    "description": "Asian shares finished mostly higher despite lingering worries about President Donald Trump’s latest updates to his tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-finish-higher-worries-continue-trumps-tariffs-123757943",
    "timestamp": "2025-07-15T07:42:14Z"
  },
  {
    "title": "U.S. inflation may have worsened last month as Trump's tariffs start to bite",
    "description": "Inflation likely accelerated in June as sweeping tariffs on nearly all imports may have pushed up prices for electronics, appliances, and other goods, economists forecast",
    "link": "https://abcnews.go.com/Business/wireStory/us-inflation-worsened-month-trumps-tariffs-start-bite-123757043",
    "timestamp": "2025-07-15T07:41:51Z"
  },
  {
    "title": "Asian shares mostly finish higher although worries continue over Trump's tariffs",
    "description": "Asian shares were mostly higher in Tuesday trading, despite lingering worries about President Donald Trump’s latest updates to his tariffs that weighed on investor sentiments. Japan's benchmark Nikkei 225 rose 0.6% to finish at 39,678.02. Australia's S&amp;P/…",
    "link": "https://japantoday.com/category/business/asian-shares-mostly-finish-higher-although-worries-continue-over-trump%27s-tariffs",
    "timestamp": "2025-07-15T07:40:03Z"
  },
  {
    "title": "트럼프 \"푸틴에 실망했지만 아직 끝나지 않았다\"",
    "description": "President Donald Trump’s threat to impose financial penalties on Russia has put the spotlight on the two biggest buyers of Moscow’s crude — India and China — but markets remain skeptical of disruption, for now https://t.co/l21x4xjvPk— Bloomberg (@business) Ju…",
    "link": "https://ryueyes11.tistory.com/511728",
    "timestamp": "2025-07-15T07:40:02Z"
  },
  {
    "title": "ConocoPhillips Files to Expand Arctic Drilling Near $7.5 Billion Willow Project",
    "description": "ConocoPhillips has submitted a formal application to federal regulators seeking approval to drill four new exploratory wells and conduct seismic testing west of its $7.5 billion Willow oil development in Alaska’s National Petroleum Reserve, Bloomberg reports.…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/ConocoPhillips-Files-to-Expand-Arctic-Drilling-Near-75-Billion-Willow-Project.html",
    "timestamp": "2025-07-15T07:40:00Z"
  },
  {
    "title": "Nvidia says it will restart AI chip sales to China",
    "description": "The move would reverse a US ban on sales of the high-end chip to the world's second largest economy.",
    "link": "https://www.bbc.com/news/articles/cy8g22n32d0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-15T07:38:22Z"
  },
  {
    "title": "Tesla drives into India with first store in Mumbais BKC; wish to see them making cars here, says Fadnavis",
    "description": "Tesla drives into India with first store in Mumbai's BKC; wish to see them making cars here, says Fadnavis",
    "link": "https://www.livemint.com/companies/news/tesla-drives-into-india-with-first-store-in-mumbais-bkc-wish-to-see-them-making-cars-here-says-fadnavis-11752564969072.html",
    "timestamp": "2025-07-15T07:36:08Z"
  },
  {
    "title": "Nissan to close its Oppama plant in Japan to cut costs",
    "description": "Nissan says it is closing its flagship factory in Oppama, Japan, to cut costs and moving all its production there to another plant in southwestern Japan",
    "link": "https://abcnews.go.com/Business/wireStory/nissan-close-oppama-plant-japan-cut-costs-123759467",
    "timestamp": "2025-07-15T07:35:40Z"
  }
]