[
  {
    "title": "Is Big Tech’s soaring AI spending creating a bubble? Here’s what it means for stocks.",
    "description": "Bulls say the tech rally can keep going, while bears warn of a repeat of the early-2000s dot-com crash.",
    "link": "https://www.marketwatch.com/story/is-big-techs-soaring-ai-spending-creating-a-bubble-heres-what-it-means-for-stocks-39fdd0d3",
    "timestamp": "2025-11-03T13:39:00Z"
  },
  {
    "title": "US stock market futures today – Wall Street extends October rally: Dow, S&P 500, Nasdaq futures rise as investors eye earnings and US-China updates",
    "description": "US stock futures rose on Monday as Wall Street started November with strong energy. Gains in S&P 500, Nasdaq, and Dow showed investor confidence after a big October rally. Earnings reports, AI-linked stocks, and new deals like Microsoft’s $9.7 billion IREN co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-today-wall-street-extends-october-rally-dow-sp-500-nasdaq-futures-rise-as-investors-eye-earnings-and-us-china-updates/articleshow/125058269.cms",
    "timestamp": "2025-11-03T13:33:40Z"
  },
  {
    "title": "NewsNation’s Chris Stirewalt On What Tuesday’s Off-Year Elections Will Tell About Trump, The Midterms And 2028’s ‘Invisible Primary’",
    "description": "The off-year elections unusually are a footnote in the overall direction of the country, but Tuesday’s races will provide the first significant glimpse at voter sentiment since Donald Trump returned to the White House. They will provide some indicators for ne…",
    "link": "http://deadline.com/2025/11/2025-elections-newsnation-chris-stirewalt-1236604186/",
    "timestamp": "2025-11-03T13:30:20Z"
  },
  {
    "title": "Trump Denies Imminent Venezuela Strikes Amid Reports of Military Buildup",
    "description": "President Donald Trump denied imminent U.S. military strikes inside Venezuela, contradicting earlier claims from unnamed sources in The Miami Herald and The Wall Street Journal suggesting attacks on Venezuelan military installations were imminent (\"hours or d…",
    "link": "https://www.shtfplan.com/headline-news/trump-denies-imminent-venezuela-strikes-amid-reports-of-military-buildup",
    "timestamp": "2025-11-03T13:30:06Z"
  },
  {
    "title": "Trump backs ICE raid tactics, says they 'haven't gone far enough'",
    "description": "President Donald Trump said he believes his immigration deportation goals will be achieved when around 25 million people are deported.",
    "link": "https://www.foxnews.com/politics/trump-backs-ice-raid-tactics-says-havent-gone-far-enough",
    "timestamp": "2025-11-03T13:29:23Z"
  },
  {
    "title": "FDA's top drug regulator resigns after federal officials probe 'serious concerns'",
    "description": "A federal spokesperson said Dr. George Tidmarsh left the agency after federal lawyers began looking into “serious concerns about his personal conduct,”",
    "link": "https://www.bostonherald.com/2025/11/03/fda-drug-director-resigns/",
    "timestamp": "2025-11-03T13:27:56Z"
  },
  {
    "title": "Trump’s troubling Nigeria military threat escalates",
    "description": "President Donald Trump has escalated his threats of military intervention in Nigeria, confirming that the United States is considering sending troops or launching air strikes in the West African nation over reported violence against Christians. Speaking to jo…",
    "link": "https://rollingout.com/2025/11/03/trump-threatens-military-action-nigeria/",
    "timestamp": "2025-11-03T13:27:33Z"
  },
  {
    "title": "Tylenol maker Kenvue misses sales estimates amid Kimberly-Clark's $48.7-billion deal",
    "description": "() -Kenvue missed Wall Street estimates for third-quarter sales on Monday, while it also announced its acquisition by Kimberly-Clark for about $48. The...",
    "link": "https://finance.yahoo.com/news/tylenol-maker-kenvue-misses-sales-132719815.html",
    "timestamp": "2025-11-03T13:27:19Z"
  },
  {
    "title": "In Uganda, where Zohran Mamdani was born, NYC mayoral hopeful is recalled with pride",
    "description": "Zohran Mamdani is leading the New York City mayor's race, and people in his native Uganda say they are watching with pride",
    "link": "https://abcnews.go.com/International/wireStory/uganda-zohran-mamdani-born-nyc-mayoral-hopeful-recalled-127128135",
    "timestamp": "2025-11-03T13:25:55Z"
  },
  {
    "title": " Factchecking Trump on '60 Minutes' (Mehdi Hasan/Zeteo)",
    "description": "Mehdi Hasan / Zeteo:\n Factchecking Trump on ‘60 Minutes’  —  ️ On this day in 2020, Joe Biden and Donald Trump faced off in the presidential election.  After nearly four painstaking days, Joe Biden was finally declared the winner.  And Trump, to this day,…",
    "link": "https://www.memeorandum.com/251103/p26",
    "timestamp": "2025-11-03T13:25:02Z"
  },
  {
    "title": "Tylenol maker Kenvue misses sales estimates amid Kimberly-Clark's $48.7-billion deal",
    "description": "() -Kenvue missed Wall Street estimates for third-quarter sales on Monday, while it also announced its acquisition by Kimberly-Clark for about $48. The...",
    "link": "https://finance.yahoo.com/news/tylenol-maker-kenvue-misses-sales-132413546.html",
    "timestamp": "2025-11-03T13:24:13Z"
  },
  {
    "title": "Forbes Daily: Food Stamp Benefits In Limbo For 42 Million Americans",
    "description": "Today’s Forbes Daily newsletter covers the billionaires backing Zohran Mamdani, a hampered CFPB, Reddit's most profitable quarter yet, Jeff Bezos gets a boost and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/11/03/forbes-daily-food-stamp-benefits-in-limbo-for-42-million-americans/",
    "timestamp": "2025-11-03T13:23:36Z"
  },
  {
    "title": "‘I don't know who he is’: Trump struggles to defend one of his most scandalous pardons",
    "description": "Donald Trump argued that he pardoned Changpeng Zhao despite not knowing who he is. If he's lying, that's a problem. If he wasn't, it's worse.",
    "link": "https://biztoc.com/x/ca0cf4abf93288f3",
    "timestamp": "2025-11-03T13:21:36Z"
  },
  {
    "title": "Donald Trump The School Bully",
    "description": "By Philip Giraldi via Ron Paul Institute for Peace and Prosperity | October 31, 2025\nNow that Donald Trump is President of the United States of America and is strenuously attempting to confirm his right to do “whatever I want to do” over the entire world, it …",
    "link": "https://biztoc.com/x/8dc23e8737b7b5f2",
    "timestamp": "2025-11-03T13:21:12Z"
  },
  {
    "title": "Ukraine receives more Patriot defence systems, but Tomahawks from U.S. not coming soon",
    "description": "Ukraine has received more American-made Patriot air defence systems to help it counter Russia's daily barrages, President Volodymyr Zelenskyy said, as Russian drones killed a man and injured five of his family members in the latest nighttime attack.",
    "link": "https://www.cbc.ca/news/world/ukraine-war-patriots-tomahawks-9.6964201",
    "timestamp": "2025-11-03T13:20:52Z"
  },
  {
    "title": "Trump Throws \"Great Gatsby\" Party at Mar-a-Lago as Food Stamps End for Millions",
    "description": "President Trump held a lavish Great Gatsby-themed Halloween party at Mar-a-Lago Friday, just hours before an estimated 42 million people lost SNAP benefits across the country. Kirk Curnutt, the executive director of the international F. Scott Fitzgerald Socie…",
    "link": "https://www.democracynow.org/2025/11/3/great_gatsby",
    "timestamp": "2025-11-03T13:20:51Z"
  },
  {
    "title": "Kimberly-Clark buys Tylenol maker Kenvue for more than $48 billion",
    "description": "The deal will create a new consumer health giant, bringing Kenvue under the wing of the maker of Kleenex tissues and Huggies diapers",
    "link": "https://qz.com/kimberly-clark-buys-tylenol-kenvue",
    "timestamp": "2025-11-03T13:19:57Z"
  },
  {
    "title": "‘This Is Crazy’—Elon Musk Issues Serious $38 Trillion U.S. ‘Bankruptcy’ Warning Amid Growing Bitcoin Price Crash Fears",
    "description": "Elon Musk has warned it’s not possible to solve the U.S. debt crisis without growing the economy at a fantastic pace—something that bitcoin supporters think will blow up the bitcoin price...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/11/03/this-is-crazy-elon-musk-issues-serious-38-trillion-us-bankruptcy-warning-predicted-to-blow-up-the-bitcoin-price/",
    "timestamp": "2025-11-03T13:19:22Z"
  },
  {
    "title": "The military’s diversity rises out of recruitment targets, not any ‘woke’ goals",
    "description": "Both men view diversity as a symptom of “woke” culture rather than as a long-standing practice driven by the nature of the all-volunteer force.",
    "link": "https://theconversation.com/the-militarys-diversity-rises-out-of-recruitment-targets-not-any-woke-goals-267205",
    "timestamp": "2025-11-03T13:18:52Z"
  },
  {
    "title": "Where do Pittsburgh's mayoral candidates stand on key issues?",
    "description": "Voters on Tuesday will choose either Democrat Corey O’Connor, the Allegheny County controller, or Republican Tony Moreno, a former Pittsburgh police officer, as Pittsburgh’s next mayor. O’Connor, 41, of Point Breeze, is a former city councilman and son of the…",
    "link": "https://freerepublic.com/focus/f-news/4350389/posts",
    "timestamp": "2025-11-03T13:16:34Z"
  },
  {
    "title": "Microsoft Vows to Spend $8 Billion in UAE Through 2029 on Cloud, Chips",
    "description": "Microsoft Corp. is planning to spend more than $7.9 billion on data centers, cloud computing and employees in the United Arab Emirates over the next four years, capitalizing on a US government clearance to ship artificial intelligence chips to the Gulf nation.",
    "link": "https://financialpost.com/pmn/business-pmn/microsoft-vows-to-spend-8-billion-in-uae-through-2029-on-cloud-chips",
    "timestamp": "2025-11-03T13:15:18Z"
  },
  {
    "title": "All government shutdowns disrupt science − in 2025, the consequences extend far beyond a lapse in funding",
    "description": "The Trump administration is not just reforming the US research system – it is trying to remake it.",
    "link": "https://theconversation.com/all-government-shutdowns-disrupt-science-in-2025-the-consequences-extend-far-beyond-a-lapse-in-funding-267182",
    "timestamp": "2025-11-03T13:13:00Z"
  },
  {
    "title": "RW Media Pushes Venezuela Regime Change As A Cakewalk",
    "description": "This week, The Miami Herald reported that the Trump administration “has made the decision to attack military installations inside Venezuela and the strikes could come at any moment.” Although the stated excuse is drug smuggling, it’s pretty clear toppling Ven…",
    "link": "https://crooksandliars.com/2025/11/rw-media-pushes-venezuela-regime-change",
    "timestamp": "2025-11-03T13:12:01Z"
  },
  {
    "title": "Of All The Scandals In The Last Nine Years, Is One Of Them ‘The Worst’?",
    "description": "On his weekday podcast (which I sorely miss), Dan Bongino would occasionally refer to a scandal as “the biggest of our time.” This raised questions in my mind, such as how big was it compared to the others? How big must a scandal be before it could be conside…",
    "link": "https://freerepublic.com/focus/f-chat/4350388/posts",
    "timestamp": "2025-11-03T13:11:39Z"
  },
  {
    "title": "Last Ditch?",
    "description": "“Never since Jesus has one man drawn out so many demons.” —Spock’s Love Child (@vulcanmindtrap) on “X”",
    "link": "https://www.kunstler.com/p/last-ditch",
    "timestamp": "2025-11-03T13:10:43Z"
  },
  {
    "title": "A major question for the Supreme Court: Will it treat Trump as it did Biden?",
    "description": "A major question hangs over the Supreme Court’s closely watched case on President Donald Trump’s sweeping tariffs: Will the conservative majority hold the Republican president to the same exacting standards it used to limit his Democratic predecessor, ...",
    "link": "https://biztoc.com/x/3444def0b7981258",
    "timestamp": "2025-11-03T13:10:39Z"
  },
  {
    "title": "Spanish black olive exporters urge EU to hit back on US tariffs",
    "description": "Gold edges higher, rebounding after weekly losses\nBy Corina Pons\nMADRID (Reuters) -Spanish black olive exporters have called on the EU to hit back at steep tariffs imposed under U.S. President Donald Trump, using powers authorised last week by the World Trade…",
    "link": "https://biztoc.com/x/c0234f8b216260cd",
    "timestamp": "2025-11-03T13:10:20Z"
  },
  {
    "title": "Why corporate executives shouldn’t ignore their own AI upskilling",
    "description": "Executives who fail to focus on their own learning risk falling behind the very technologies they champion.",
    "link": "https://fortune.com/2025/11/03/why-corporate-executives-shouldnt-ignore-own-ai-upskilling-cfo/",
    "timestamp": "2025-11-03T13:08:05Z"
  },
  {
    "title": "Trump taunts '60 Minutes' during interview, says show paid him 'a lot of money'",
    "description": "President Donald Trump told CBS host Norah O'Donnell during a \"60 Minutes\" interview on Sunday that the network paid him \"a lot of money\" in a lawsuit settlement.",
    "link": "https://www.foxnews.com/media/trump-taunts-60-minutes-during-interview-says-show-paid-him-a-lot-money",
    "timestamp": "2025-11-03T13:07:48Z"
  },
  {
    "title": "Supreme court to decide fate of Trump's sweeping tariff policy on Nov. 5",
    "description": "Four charts that explain the significance of the tariff case for the economy, the federal budget and consumers.",
    "link": "https://www.courier-journal.com/story/news/politics/2025/11/03/charts-show-trumps-tariffs-effects-on-the-economy-and-consumers/87062333007/",
    "timestamp": "2025-11-03T13:04:00Z"
  },
  {
    "title": "Hegseth visits inter-Korean border ahead of security talks with South Korean officials",
    "description": "U.S. Defense Secretary Pete Hegseth has visited the Demilitarized Zone between North and South Korea.",
    "link": "https://www.bostonherald.com/2025/11/03/hegseth-korean-border-visit-talks/",
    "timestamp": "2025-11-03T13:02:32Z"
  },
  {
    "title": "Surround the White House. Surround the Capitol. Surround the illegitimate fascist-packed Supreme Court.\"",
    "description": "\"Surround the White House. Surround the Capitol. Surround the illegitimate fascist-packed Supreme Court.\" Far-left group, Refuse Fascism, is organizing an insurrection on Nov. 5 in Washington, D.C. The plan is to besiege government buildings and streets until…",
    "link": "https://freerepublic.com/focus/f-news/4350385/posts",
    "timestamp": "2025-11-03T13:02:18Z"
  },
  {
    "title": "The Great Morass",
    "description": "There’s an urgent need to replace our total mess with a codified constitution. By George Monbiot, published in the Guardian  23rd October 2025 After two years in Brazil, I felt I understood its political system better than I understand the UK’s. The reason is…",
    "link": "https://www.monbiot.com/2025/11/03/the-great-morass/",
    "timestamp": "2025-11-03T13:02:14Z"
  },
  {
    "title": "Why Is Crypto Down Today? – November 3, 2025",
    "description": "The crypto market is in decline today, with total market capitalization dropping by 3.5% to $3.69 trillion, according to data from CoinMarketCap. Meanwhile, ...",
    "link": "https://cryptonews.com/news/why-is-crypto-down-today-november-3-2025/",
    "timestamp": "2025-11-03T13:01:38Z"
  },
  {
    "title": "'We’re killing all the right people!' Lindsey Graham stuns with latest Trump praise",
    "description": "Sen. Lindsey Graham (R-SC) heaped praise onto President Donald Trump over the weekend while speaking at the the Republican Jewish Coalition Leadership Summit in Las Vegas, Nevada, — plaudits that quickly derailed into celebrating the administration’s recent w…",
    "link": "https://www.rawstory.com/lindsey-graham-2674259627/",
    "timestamp": "2025-11-03T13:01:35Z"
  },
  {
    "title": "In Uganda, where Zohran Mamdani was born, NYC mayoral hopeful is recalled with pride",
    "description": "In the Ugandan newsroom where he appeared one day as an intern, Zohran Mamdani looked shy and unassuming.  “He told me himself: He had to go every evening...",
    "link": "https://www.yahoo.com/news/articles/uganda-where-zohran-mamdani-born-130055861.html",
    "timestamp": "2025-11-03T13:00:55Z"
  },
  {
    "title": "Harvard Student Paper ‘The Crimson’ Defends Resident Dean Who Called Police ‘Racist, Evil’",
    "description": "“Davis has since expressed regret for any harm his comments may have caused — but, in any case, participation in past political discourse should not disqualify him from continuing to hold his position”\nThe post Harvard Student Paper ‘The Crimson’ Defends Resi…",
    "link": "https://legalinsurrection.com/2025/11/harvard-student-paper-the-crimson-defends-resident-dean-who-called-police-racist-evil/",
    "timestamp": "2025-11-03T13:00:53Z"
  },
  {
    "title": "Biden Sent $60,000 to U.K. For Pride Events — Trump Made $5 Billion in Trade Wins",
    "description": "The deal unlocks $5 billion in fresh export opportunities for American producers across agriculture, manufacturing, energy, and technology—the industries that keep the U.S. working.\nThe post Biden Sent $60,000 to U.K. For Pride Events — Trump Made $5 Billion …",
    "link": "https://www.thegatewaypundit.com/2025/11/biden-sent-60000-u-k-pride-events-trump/",
    "timestamp": "2025-11-03T13:00:45Z"
  },
  {
    "title": "‘I don't know who he is’: Trump struggles to defend one of his most scandalous pardons",
    "description": "Donald Trump argued that he pardoned Changpeng Zhao despite not knowing who he is. If he's lying, that's a problem. If he wasn't, it's worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/-dont-know-trump-struggles-defend-one-scandalous-pardons-rcna241547",
    "timestamp": "2025-11-03T13:00:37Z"
  },
  {
    "title": "Dow Jones soars while these 5 stocks steal the show",
    "description": "Wall Street kicked off November with renewed optimism as stock market futures climbed higher following an impressive October performance that defied economic uncertainties. The positive momentum comes as investors eagerly await earnings reports from several m…",
    "link": "https://rollingout.com/2025/11/03/dow-jones-soars-while-these-5-stocks/",
    "timestamp": "2025-11-03T13:00:34Z"
  },
  {
    "title": "Election Day poses early political test for Trump amid lingering shutdown",
    "description": "Trump faces key political tests as voters head to polls in Virginia, New Jersey and NYC elections. Early measure of how Americans view his policies and leadership.",
    "link": "https://www.foxnews.com/politics/election-day-poses-early-political-test-trump-amid-lingering-shutdown",
    "timestamp": "2025-11-03T13:00:12Z"
  },
  {
    "title": "Democrats are more enthusiastic about the midterms as Trump's approval hits a second-term low, CNN poll finds (Jennifer Agiesta/CNN)",
    "description": "Jennifer Agiesta / CNN:\nDemocrats are more enthusiastic about the midterms as Trump's approval hits a second-term low, CNN poll finds  —  One year out from the midterm elections, the Democratic Party holds a sizable enthusiasm advantage as views of President …",
    "link": "https://www.memeorandum.com/251103/p22",
    "timestamp": "2025-11-03T13:00:05Z"
  },
  {
    "title": "Dems to Democrat Base: Drop Dead",
    "description": "Democrats are fighting so ferociously to keep the federal government closed, it’s as if they were trying to kill a GOP-sponsored scheme to exempt The Top... Read More\nThe post Dems to Democrat Base: Drop Dead appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/03/dems-to-democrat-base-drop-dead/",
    "timestamp": "2025-11-03T13:00:00Z"
  },
  {
    "title": "Trump warns Nigeria that US troops or airstrikes 'could be' used to defend Christians",
    "description": "Donald Trump claimed Christians are being killed \"in very large numbers\", and hinted at military intervention. Nigeria suggested it is open to help in tackling Islamist insurgents, but pushed back on claims the country is \"religiously intolerant\".",
    "link": "https://news.sky.com/story/donald-trump-warns-nigeria-that-us-troops-or-airstrikes-could-be-used-to-prevent-killing-of-christians-13463099",
    "timestamp": "2025-11-03T13:00:00Z"
  },
  {
    "title": "Kenvue stock share price today: Kimberly-Clark to acquire Tylenol maker Kenvue for $40 billion in cash and stock deal. Here's background, current challenges, future outlook, market reaction",
    "description": "Kenvue stock share price today shows a major surge after Kimberly-Clark announced plans to buy Kenvue for over $40 billion. The cash-and-stock deal will merge brands like Huggies, Kleenex, Tylenol, and Band-Aid under one company, creating one of the largest g…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kenvue-stock-share-price-today-kimberly-clark-to-acquire-tylenol-maker-kenvue-for-40-billion-in-cash-and-stock-deal-heres-background-current-challenges-future-outlook-market-reaction-huggies-kleenex-kvue-ceo-michael-hsu-shareholders-closing-plans/articleshow/125059441.cms",
    "timestamp": "2025-11-03T12:59:58Z"
  },
  {
    "title": "Trump Doubts U.S. Will Go To War With Venezuela Amid Rising Tensions",
    "description": "President Donald Trump said Venezuelan President Nicolás Maduro’s “days are numbered,” but expressed doubt that the United States would go to war with Venezuela.\nCBS: \"Are we going to war against Venezuela?\"@POTUS: \"I doubt it. I don't think so, but they've b…",
    "link": "https://biztoc.com/x/6fb95641a0d9a9b7",
    "timestamp": "2025-11-03T12:58:56Z"
  },
  {
    "title": "George Clooney says replacing Joe Biden with Kamala Harris in 2024 US election ‘was a mistake’",
    "description": "In July 2024, Clooney penned an op-ed in the New York Times calling on Biden to step aside – he pulled out of the race against Donald Trump less than two weeks later.",
    "link": "https://www.thejournal.ie/george-clooney-kamala-harris-joe-biden-2024-us-election-6863307-Nov2025/",
    "timestamp": "2025-11-03T12:57:46Z"
  },
  {
    "title": "Kimberly-Clark to buy Tylenol maker Kenvue for over $40bn",
    "description": "Kleenex maker Kimberly-Clark said today it will buy Tylenol parent Kenvue for more than $40 billion to create one of the biggest consumer health goods companies in the US.",
    "link": "https://www.rte.ie/news/business/2025/1103/1541897-kimberly-clark-to-buy-tylenol-maker-kenvue-for-over-40bn/",
    "timestamp": "2025-11-03T12:56:11Z"
  },
  {
    "title": "Trump renovated the Lincoln bathroom all in marble with gold fixtures and a chandelier",
    "description": "The government shutdown has entered its 33rd day. If it’s still going by Thursday, it will be the new record-holder, dethroning the 35-day shutdown that began in December 2018… also under a Trump term sentence. November 1 was a pivotal marker, as not only did…",
    "link": "https://www.celebitchy.com/948308/trump_renovated_the_lincoln_bathroom_all_in_marble_with_gold_fixtures_and_a_chandelier/",
    "timestamp": "2025-11-03T12:54:26Z"
  },
  {
    "title": "After mistaken deportation, Abrego Garcia fights smuggling charges. Here's what to know",
    "description": "The man whose mistaken deportation galvanized opposition to President Donald Trump's immigration policies is charged in federal court in Tennessee with human smuggling",
    "link": "https://abcnews.go.com/US/wireStory/after-mistaken-deportation-abrego-garcia-fights-smuggling-charges-127127544",
    "timestamp": "2025-11-03T12:53:52Z"
  },
  {
    "title": "'They've nailed it': Analyst sees 'wild' consequence for Trump as shutdown plan flounders",
    "description": "President Donald Trump's efforts to distract from, or deflect blame on, the federal government shutdown have been an utter failure, Axios' Sara Fischer told CNN's Audie Cornish on Monday morning.The shutdown, which has lasted for weeks with no indications of …",
    "link": "https://www.rawstory.com/gop-shutdown-2674258877/",
    "timestamp": "2025-11-03T12:51:36Z"
  },
  {
    "title": "Government shutdown could become longest ever as Trump says he ‘won’t be extorted’ by Democrats",
    "description": "President Trump made clear he has no plans to negotiate to reopen the government, In an interview aired Sunday on CBS’ “60 Minutes,\"",
    "link": "https://www.bostonherald.com/2025/11/03/trump-government-shutdown-60-minutes/",
    "timestamp": "2025-11-03T12:50:47Z"
  },
  {
    "title": "Government shutdown could become longest ever as Trump says he ‘won’t be extorted’ by Democrats",
    "description": "President Trump made clear he has no plans to negotiate to reopen the government, In an interview aired Sunday on CBS’ “60 Minutes,\"",
    "link": "https://www.denverpost.com/2025/11/03/trump-government-shutdown-60-minutes/",
    "timestamp": "2025-11-03T12:50:47Z"
  },
  {
    "title": "Trump Administration Faces Deadline to Comply With SNAP Ruling",
    "description": "As the government shutdown inches closer to becoming the longest in U.S. history, President Donald Trump is again threatening to use the “nuclear option,” of ending the filibuster to allow Republicans to pass bills with a simple majority. The Trump administra…",
    "link": "https://biztoc.com/x/078fb47bb30dd476",
    "timestamp": "2025-11-03T12:48:28Z"
  },
  {
    "title": "‘Norah Has Given Up’: Liberals Drag CBS Host O’Donnell for Edited Trump Interview",
    "description": "The internet exploded over 60 Minutes’ bombshell interview with President Donald Trump on Sunday, with many on the left criticizing CBS anchor Norah O’Donnell’s lack of pushback on the president and the exchanges the network chose not to air. While Trump’s in…",
    "link": "https://www.mediaite.com/media/news/norah-has-given-up-liberals-drag-cbs-host-odonnell-for-edited-trump-interview/",
    "timestamp": "2025-11-03T12:47:09Z"
  },
  {
    "title": "Kimberly-Clark buying Tylenol maker Kenvue in $48.7 billion deal",
    "description": "Kimberly-Clark is buying Tylenol maker Kenvue in a cash and stock deal worth about $48.7 billion, creating a massive consumer health goods company.",
    "link": "https://www.scrippsnews.com/business/company-news/kimberly-clark-buying-tylenol-maker-kenvue-in-48-7-billion-deal",
    "timestamp": "2025-11-03T12:46:32Z"
  },
  {
    "title": "A major question for the Supreme Court: Will it treat Trump as it did Biden?",
    "description": "A major question hangs over the Supreme Court’s closely watched case on President Donald Trump’s sweeping tariffs: Will the conservative majority hold the Republican president to the same exacting standards it used to limit his Democratic predecessor, ...",
    "link": "https://abcnews.go.com/Business/wireStory/major-question-supreme-court-treat-trump-biden-127126954",
    "timestamp": "2025-11-03T12:45:56Z"
  },
  {
    "title": "Monday: Hili dialogue",
    "description": "Welcome to the first Monday in November: November 3, 2025 and National Sandwich Day.  Here’s a pastrami/corned beef sandwich at Katz’s Deli in NYC, along with the only proper accompaniment to this item: a Dr. Brown’s Cel-Ray Tonic, celery-flavored soda that c…",
    "link": "https://whyevolutionistrue.com/2025/11/03/monday-hili-dialogue-541/",
    "timestamp": "2025-11-03T12:45:26Z"
  },
  {
    "title": "North Koreans left in the dark as foreign broadcasts cut",
    "description": "For decades, US and South Korean broadcasts were a critical source of information for North Koreans willing to learn about life beyond their borders. Now, the airwaves have gone silent.",
    "link": "https://www.dw.com/en/north-koreans-left-in-the-dark-as-foreign-broadcasts-cut/a-74596803",
    "timestamp": "2025-11-03T12:45:00Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "News of the day for Nov. 3, 2025",
    "link": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-november-3-2025-11841849",
    "timestamp": "2025-11-03T12:42:01Z"
  },
  {
    "title": "Israel hands over bodies of 45 Palestinians after Hamas returned the remains of 3 soldiers",
    "description": "Health officials in Gaza say Israel has handed over the bodies of 45 Palestinians.",
    "link": "https://www.bostonherald.com/2025/11/03/israel-hamas-remains-exchange-continues/",
    "timestamp": "2025-11-03T12:41:15Z"
  },
  {
    "title": "Tylenol’s parent company will combine with the maker of Huggies in a $48.7 billion mega-deal | CNN Business",
    "description": "Huggies maker Kimberly-Clark announced Monday it will buy Tylenol’s parent company Kenvue in a nearly $50 billion deal, creating a massive consumer products conglomerate.",
    "link": "https://www.cnn.com/2025/11/03/business/kimberly-clark-kenvue-acquisition",
    "timestamp": "2025-11-03T12:39:32Z"
  },
  {
    "title": "‘Very savage time of cruelty’: Whispers of deal as Dems keep shutdown spotlight on Trump",
    "description": "WASHINGTON — Happy Groundhog Day. Again.With the US federal government shutdown entering its fifth week and a growing number of Americans feeling deepening economic pain, there are whispers of a thaw on Capitol Hill. At the very least, some more middle-of-the…",
    "link": "https://www.rawstory.com/raw-investigates/government-shutdown-2674255055/",
    "timestamp": "2025-11-03T12:39:11Z"
  },
  {
    "title": "November trading, Berkshire's cash hoard, Big Tech's ad revenue and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/11/03/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-11-03T12:37:54Z"
  },
  {
    "title": "George Clooney Calls Harris Candidacy a ‘Mistake’ After He Helped Push Out Biden",
    "description": "George Clooney said that Kamala Harris’ candidacy for the 2024 election was “a mistake,” telling CBS’s Seth Doane on Sunday that the former vice president should have joined an open primary. Clooney sat down with Doane to discuss, among other topics, his invo…",
    "link": "https://www.mediaite.com/media/news/george-clooney-calls-harris-candidacy-a-mistake-after-he-helped-push-out-biden/",
    "timestamp": "2025-11-03T12:36:45Z"
  },
  {
    "title": "Trump Defends ICE Raids; Threatens Military Action in Nigeria",
    "description": "In a wide-ranging new interview, President Donald Trump sat down with “60 Minutes” on Friday and defended his aggressive tactics in enforcing his controversial mass deportations policies and said he’s ready to send active duty military into U.S. cities if nec…",
    "link": "https://www.today.com/video/trump-defends-ice-raids-threatens-military-action-in-nigeria-251177029885",
    "timestamp": "2025-11-03T12:35:10Z"
  },
  {
    "title": "Turkey Lowers Oil Purchases From Russia as US Tightens Sanctions",
    "description": "Turkey’s oil refiners have started cutting their purchases of Russian crude after the US sanctioned Moscow’s top two oil producers and are instead seeking extra barrels from nations including Iraq, Libya, Saudi Arabia and Kazakhstan.",
    "link": "https://financialpost.com/pmn/business-pmn/turkey-lowers-oil-purchases-from-russia-as-us-tightens-sanctions",
    "timestamp": "2025-11-03T12:34:28Z"
  },
  {
    "title": "BREAKING: Federal judge BLOCKS National Guard deployment to Portland following three-day trial: Oregon v Trump",
    "description": "Judge Immergut decided that the president did not meet the merits to federalize the National Guard under Title 10 section 12406. US District Court Judge Karin J. Immergut ruled on Sunday that President Donald Trump likely lacked the authority to federalize th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350378/posts",
    "timestamp": "2025-11-03T12:33:51Z"
  },
  {
    "title": "In tariffs case, will the Supreme Court limit Trump like it did Biden?",
    "description": "A major question hangs over the Supreme Court’s closely watched case on President Donald Trump’s sweeping tariffs: Will the conservative majority hold the Republican president to the same exacting standards it used to limit his Democratic predecessor, Joe Bid…",
    "link": "https://www.wsbradio.com/news/business/major-question/53XI46OC4QZQ3JAWZP5SS4UJH4/",
    "timestamp": "2025-11-03T12:33:03Z"
  },
  {
    "title": "The president wanted to keep reminding people of all the wars he’s supposedly ended, but he couldn’t recall the names of the countries.",
    "description": "Donald Trump interrupted his own tangent-addled interview on CBS by producing a printed list from his pocket of all the conflicts he says he’s solved since t...",
    "link": "https://www.thedailybeast.com/trump-79-now-has-printed-out-tweet-listing-wars-he-says-hes-solved-but-cant-remember/",
    "timestamp": "2025-11-03T12:32:32Z"
  },
  {
    "title": "Is Bessent Right About the Fed?",
    "description": "The US Federal Reserve and most other G7 central banks have made numerous policy errors this century, making them ripe targets for criticism. But while reforms are necessary to improve their monetary-policy and regulatory performance, that does not mean their…",
    "link": "https://www.project-syndicate.org/commentary/is-bessent-right-about-the-fed-by-willem-h-buiter-2025-11",
    "timestamp": "2025-11-03T12:32:18Z"
  },
  {
    "title": "How Trump’s White House ballroom compares with Obama renovations",
    "description": "Former President Barack Obama repaired the White House, while Trump’s ballroom plan has demolished part of the mansion.",
    "link": "https://www.aljazeera.com/news/2025/11/3/how-trumps-white-house-ballroom-compares-with-obama-renovations",
    "timestamp": "2025-11-03T12:32:15Z"
  },
  {
    "title": "John Oliver eviscerates Trump over Gatsby-themed Mar-a-Lago party as SNAP benefits lapse for millions",
    "description": "Gatsby and ‘a little party never killed nobody’ was the ‘official theme’ of the night",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/john-oliver-trump-gatsby-party-snap-b2857382.html",
    "timestamp": "2025-11-03T12:32:05Z"
  },
  {
    "title": "Major question for the Supreme Court: Will it treat Trump like Biden?",
    "description": "Key legal principles at the heart of conservative challenges in the Biden years are driving the arguments in the legal fight against Trump’s tariffs.",
    "link": "https://www.twincities.com/2025/11/03/supreme-court-tariffs-trump-biden/",
    "timestamp": "2025-11-03T12:31:41Z"
  },
  {
    "title": "This Week in History: 3-9 November",
    "description": "From elections and scandals to the moments that made history, dive into The Independent’s front pages and see how this week’s stories unfolded through the years",
    "link": "https://www.the-independent.com/life-style/history/this-week-history-3-9-november-b2856255.html",
    "timestamp": "2025-11-03T12:30:57Z"
  },
  {
    "title": "How will ‘limited’ US nuclear tests avoid any explosions?",
    "description": "During a 60 Minutes TV interview, Trump accuses Russia, China and Pakistan of testing nuclear weapons.",
    "link": "https://www.aljazeera.com/news/2025/11/3/how-will-limited-us-nuclear-tests-avoid-any-explosions",
    "timestamp": "2025-11-03T12:27:39Z"
  },
  {
    "title": "A major question for the Supreme Court: Will it treat Trump as it did Biden?",
    "description": "Key legal principles at the heart of conservative challenges in the Biden years are driving the arguments in the legal fight against Trump’s tariffs.",
    "link": "https://www.bostonherald.com/2025/11/03/supreme-court-tariffs-trump-biden/",
    "timestamp": "2025-11-03T12:26:28Z"
  },
  {
    "title": "EU universities receive record US grant applications",
    "description": "The European Union has received a record number of academic grant applications in 2025, including a tripling of US bids following President Donald Trump’s attack on higher education.\nTrump has unleashed a series of measures, including funding cuts and restric…",
    "link": "https://biztoc.com/x/e2be194dd7971391",
    "timestamp": "2025-11-03T12:26:25Z"
  },
  {
    "title": "What’s Behind Trump’s Warning To Nigeria Over Christian Killings",
    "description": "President Donald Trump warned that the U.S. could launch military strikes in Nigeria to protect Christians from what he called “terrorist thugs,” ordering the Pentagon to prepare for potential action.\nDOUBLING DOWN: President Trump again condemns the killing …",
    "link": "https://biztoc.com/x/d5a5dd4752243a53",
    "timestamp": "2025-11-03T12:26:09Z"
  },
  {
    "title": "‘He’s my Bernie Sanders’: Meet the New Yorkers for Zohran",
    "description": "We asked the teens, gays, cats, and service workers behind the viral ‘For Zohran’ groups what their dream future for the city looks like",
    "link": "https://www.dazeddigital.com/life-culture/article/68995/1/hot-girls-teens-service-workers-gays-cats-deafies-for-zohran-mamdani-new-york?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=he-s-my-bernie-sanders-meet-the-new-yorkers-for-zohran",
    "timestamp": "2025-11-03T12:23:00Z"
  },
  {
    "title": "Trump says he will not attend Supreme Court's oral arguments on tariffs",
    "description": "(This November 2 story is repeated without any changes to the text) By Jasper Ward and Andrea Shalal WASHINGTON (Reuters) -U.S.",
    "link": "https://www.yahoo.com/news/articles/trump-says-not-attend-supreme-122247250.html",
    "timestamp": "2025-11-03T12:22:47Z"
  },
  {
    "title": "Gold price prediction: Gold rate futures for December are out. Details here",
    "description": "Gold rate has started to rising again and the gold price futures for December have risen.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-gold-rate-futures-for-december-are-out-details-here/articleshow/125058591.cms",
    "timestamp": "2025-11-03T12:22:37Z"
  },
  {
    "title": "Trump Administration Faces Deadline to Comply With SNAP Ruling",
    "description": "As the government shutdown inches closer to becoming the longest in U.S. history, President Donald Trump is again threatening to use the “nuclear option,” of ending the filibuster to allow Republicans to pass bills with a simple majority. The Trump administra…",
    "link": "https://www.today.com/video/government-shutdown-nears-longest-in-history-as-fallout-grows-251173957948",
    "timestamp": "2025-11-03T12:21:47Z"
  },
  {
    "title": "In tariffs case, will the Supreme Court limit Trump like it did Biden?",
    "description": "A major question hangs over the Supreme Court’s closely watched case on President Donald Trump’s sweeping tariffs: Will the conservative majority hold the Republican president to the same exacting standards it used to limit his Democratic predecessor, Joe Bid…",
    "link": "https://apnews.com/article/supreme-court-tariffs-7c44eedbf32bec35fc638e9953db2aeb",
    "timestamp": "2025-11-03T12:18:13Z"
  },
  {
    "title": "A major question for the Supreme Court: Will it treat Trump as it did Biden?",
    "description": "A major question hangs over the Supreme Court's closely watched case on President Donald Trump's far-reaching tariffs: Will the conservative majority hold...",
    "link": "https://www.yahoo.com/news/articles/major-supreme-court-treat-trump-121812282.html",
    "timestamp": "2025-11-03T12:18:12Z"
  },
  {
    "title": "Trump Say US Won’t Sell Tomahawk Missiles to Ukraine, for Now",
    "description": "President Donald Trump said on Sunday that the United States will not sell or trade Tomahawk missiles to Ukraine for the time being, as concerns linger that such a move could lead to an escalation in that nation’s defensive war against Russia’s invasion. Aske…",
    "link": "https://freerepublic.com/focus/f-news/4350375/posts",
    "timestamp": "2025-11-03T12:17:24Z"
  },
  {
    "title": "Poll finds most Americans doubt Trump's commitment to free speech, fair justice (Washington Post)",
    "description": "Washington Post:\nPoll finds most Americans doubt Trump's commitment to free speech, fair justice  —  Many Americans also don't seem sure what to make of criminal cases against two of Trump's perceived opponents.  —  Just now  —  A majority of Americans believ…",
    "link": "https://www.memeorandum.com/251103/p17",
    "timestamp": "2025-11-03T12:15:02Z"
  },
  {
    "title": "‘There’s Never Been a Situation Like This,’ Halperin Tells Megyn Kelly About Vance 2028 [WATCH]",
    "description": "Vice President J.D. Vance received overwhelming support for a potential 2028 presidential run during a live taping of The Megyn Kelly Show in Fort Worth, Texas, earlier this week. The event, part of Kelly’s national tour, featured several prominent conservati…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350374/posts",
    "timestamp": "2025-11-03T12:12:21Z"
  },
  {
    "title": "Trump's own words hurled back at him as he's threatened over 'unhinged' interview",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) took a jab at President Donald Trump early Monday morning over what he called the president’s “unhinged” interview\r\n with CBS News’ “60 Minutes” that aired Sunday, issuing a threat similar to one the president had m…",
    "link": "https://www.rawstory.com/trump-2674258890/",
    "timestamp": "2025-11-03T12:12:02Z"
  },
  {
    "title": "We're Number Two! — Does Donald Trump realize that he has ceded world leadership to China? (Paul Krugman)",
    "description": "Paul Krugman:\nWe're Number Two!  —  Does Donald Trump realize that he has ceded world leadership to China?  Probably not: During his recent Asian trip, foreign leaders flattered him and showered him with personal gifts, so he came home with his ego even more …",
    "link": "https://www.memeorandum.com/251103/p11",
    "timestamp": "2025-11-03T12:10:00Z"
  },
  {
    "title": "CBS Cuts Trump's Corruption Tantrum From '60 Minutes' Edit (Cameron Adams/The Daily Beast)",
    "description": "Cameron Adams / The Daily Beast:\nCBS Cuts Trump's Corruption Tantrum From ‘60 Minutes’ Edit  —  ✂️✂️✂️  —  The moment Trump got testy was missing from Sunday night's interview.  —  President Donald Trump's angry response to corruption questions at the end of …",
    "link": "https://www.memeorandum.com/251103/p9",
    "timestamp": "2025-11-03T12:10:00Z"
  },
  {
    "title": "Kim Kardashian got an invite to NASA after spreading lies about the moon landing",
    "description": "Last week, Kim Kardashian caused a kerfuffle when, during an episode of Hulu’s The Kardashians, she announced that she believes that the 1969 moon landing was faked. She also tried to convince Sarah Paulson of this conspiracy, and Kim cited TikTok as her sour…",
    "link": "https://www.celebitchy.com/948222/kim_kardashian_got_an_invite_to_nasa_after_spreading_lies_about_the_moon_landing/",
    "timestamp": "2025-11-03T12:08:25Z"
  },
  {
    "title": "'What the hell's going on?' Trump warned his lavish living has GOP in a panic",
    "description": "President Donald Trump's apparent \"self-dealing\" is becoming a political issue for the Republican Party, according to MSNBC's Joe Scarborough.The president and his family have raked in up to $1 billion since he returned to office in January, according to some…",
    "link": "https://www.rawstory.com/donald-trump-self-dealing/",
    "timestamp": "2025-11-03T12:06:19Z"
  }
]