[
  {
    "title": "Trump frustrated by Justice Amy Coney Barrett, other Supreme Court picks: Sources",
    "description": "President Trump has privately expressed frustration about the Supreme Court justices he appointed, sources with knowledge of the conversations told ABC News.",
    "link": "https://abcnews.go.com/Politics/trump-frustrated-justice-amy-coney-barrett-supreme-court/story?id=122468774",
    "timestamp": "2025-06-03T22:13:44Z"
  },
  {
    "title": "FEMA Is Not Prepared",
    "description": "Citizens could be on their own this hurricane season.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/06/fema-preparation-hurricane-season-richardson/683025/",
    "timestamp": "2025-06-03T22:12:00Z"
  },
  {
    "title": "Rubio praises bravery of Chinese people killed in Tiananmen Square crackdown",
    "description": "(Reuters) -U.S. Secretary of State Marco Rubio on Tuesday praised the bravery of the Chinese people who were killed in a bloody crackdown on pro-democracy...",
    "link": "https://www.yahoo.com/news/rubio-praises-bravery-chinese-people-221137163.html",
    "timestamp": "2025-06-03T22:11:37Z"
  },
  {
    "title": "A Survivor’s Warning: Reopening Alcatraz Is a Step Backward on Justice",
    "description": "The idea of reopening Alcatraz for what Trump termed as punishment for the country’s “most ruthless and violent” criminals should not be viewed in isolation. It calls for a broader reckoning with why such carceral relics were created in the first place and wh…",
    "link": "https://msmagazine.com/2025/06/03/alcatraz-reopen-women-prison-mass-incarceration-trump/",
    "timestamp": "2025-06-03T22:11:15Z"
  },
  {
    "title": "Here's the $9.4 billion in DOGE cuts that Trump is asking Congress to approve",
    "description": "The foreign aid and public broadcasting cuts could be the first of several \"rescission\" requests sent to Congress in the coming months.",
    "link": "https://www.businessinsider.com/doge-cuts-npr-pbs-foreign-aid-request-2025-6",
    "timestamp": "2025-06-03T22:10:44Z"
  },
  {
    "title": "Even Trump supporters are creeped out by his plans to merge Americans’ data",
    "description": "Plus, the SEC drops a lawsuit against Binance, Dick Durbin takes aim at dubious drug ads and Marjorie Taylor Greene’s swatting suspect pleads guilty, all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-palantir-binance-sec-padfa-musk-rcna210742",
    "timestamp": "2025-06-03T22:08:59Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The comeback rally has investors increasingly confident stocks have turned a corner on tariffs, though concerns remain.",
    "link": "https://www.cnbc.com/2025/06/03/stock-market-today-live-updates.html",
    "timestamp": "2025-06-03T22:08:19Z"
  },
  {
    "title": "Poland’s Election Is A Wake-Up Call to Europe’s Centrists",
    "description": "Voters across the continent are demanding change from governments seen as corrupt and stuck.",
    "link": "http://foreignpolicy.com/2025/06/03/poland-election-results-europe-far-right-centrists/",
    "timestamp": "2025-06-03T22:07:12Z"
  },
  {
    "title": "Schumer on Trump Tax Bill: 'I Agree With Elon Musk'",
    "description": "Donald Trump ally Elon Musk lambasted the president’s signature tax bill as a budget-busting “abomination” as Republican fiscal hawks stepped up criticism of the massive fiscal package.\nThe tech titan’s public condemnation pits him against the president at a …",
    "link": "https://biztoc.com/x/02377ea22fc14a78",
    "timestamp": "2025-06-03T22:05:23Z"
  },
  {
    "title": "Donald Trump orders 50% steel and aluminium tariffs to begin on June 4",
    "description": "Donald Trump orders 50% steel and aluminium tariffs to begin on June 4\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs an…",
    "link": "https://biztoc.com/x/9c5c8c50a2ebdb1d",
    "timestamp": "2025-06-03T22:05:16Z"
  },
  {
    "title": "The Trump-Musk breakup, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Is the Trump-Musk partnership over? It’s complicated —…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/415384/elon-musk-trump-relationship-doge-big-beautiful-bill",
    "timestamp": "2025-06-03T22:05:02Z"
  },
  {
    "title": "Trump to host thousands of admin officials for one of the largest events ever on White House lawn",
    "description": "President Donald Trump on Wednesday evening is hosting the more than 3,000 political appointees in his administration for one of the largest events ever held on the White House lawn to celebrate their work.",
    "link": "https://nypost.com/2025/06/03/us-news/trump-to-host-thousands-of-admin-officials-for-one-of-the-largest-events-ever-on-white-house-lawn/",
    "timestamp": "2025-06-03T22:04:27Z"
  },
  {
    "title": "‘We Have an Agenda,’ Thune Says of GOP Senators on Budget Bill",
    "description": "“We’re anxious to have the ball and run with it,” Senate Majority Leader John Thune told reporters Tuesday, referencing the budget reconciliation bill that has... Read More\nThe post ‘We Have an Agenda,’ Thune Says of GOP Senators on Budget Bill appeared first…",
    "link": "https://www.dailysignal.com/2025/06/03/we-have-agenda-thune-says-gop-senators-budget-bill/",
    "timestamp": "2025-06-03T22:04:08Z"
  },
  {
    "title": "Trump pardons 2 divers who freed 19 sharks off the coast of Florida",
    "description": "Two South Florida shark divers convicted of theft for freeing 19 sharks and a giant grouper from a fisherman’s longline several miles from shore have been pardoned by President Donald Trump.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-pardons-2-divers-freed-19-sharks-coast-florida-rcna210792",
    "timestamp": "2025-06-03T22:03:33Z"
  },
  {
    "title": "Trump’s lock screen photo may be the least problematic thing on his phone",
    "description": "President Donald Trump's phone's lock screen was photographed on Monday, setting off yet another round of online uproar about the vanity of his photo choice.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-phone-lock-screen-photo-rcna210712",
    "timestamp": "2025-06-03T22:01:04Z"
  },
  {
    "title": "Carbon Capture Efforts Slow as Trump Targets Clean Energy Projects",
    "description": "Since U.S. President Donald Trump took office, the number of applications for carbon capture projects has nosedived, signaling a slowdown in the efforts to commercialize the relatively new technology to remove carbon from the air. Since the Trump Administrati…",
    "link": "https://oilprice.com/Energy/Energy-General/Carbon-Capture-Efforts-Slow-as-Trump-Targets-Clean-Energy-Projects.html",
    "timestamp": "2025-06-03T22:00:00Z"
  },
  {
    "title": "US and Argentina announce plan to create an alternative global health system after withdrawing from WHO",
    "description": "US Health and Human Services Secretary Robert F. Kennedy Jr. and Argentine Minister of Health Mario Lugones signed a joint declaration to reaffirm their countries’ withdrawals from WHO and build a new global health cooperation model.  The new system aims to b…",
    "link": "https://www.activistpost.com/us-and-argentina-announce-plan-to-create-an-alternative-global-health-system-after-withdrawing-from-who/",
    "timestamp": "2025-06-03T22:00:00Z"
  },
  {
    "title": "Are We Thinking About Crime All Wrong?",
    "description": "From the daily newsletter: how to actually make communities safer. Plus: Andrew Marantz on Poland’s election of a right-wing nationalist.",
    "link": "https://www.newyorker.com/newsletter/the-daily/are-we-thinking-about-crime-all-wrong",
    "timestamp": "2025-06-03T22:00:00Z"
  },
  {
    "title": "Washington Post Planning to Bring in ‘Nonprofessional Writers’ Coached by an AI Editor With a ‘Story Strength Tracker’",
    "description": "The Washington Post is working on plans to get content from alternative sources like Substack contributors and \"nonprofessional writers,\" aided by an AI editor and writing coach, reported The New York Times' media reporter Ben Mullin.\nThe post Washington Post…",
    "link": "https://www.mediaite.com/media/print/washington-post-planning-to-bring-in-nonprofessional-writers-coached-by-an-ai-editor-with-a-story-strength-tracker/",
    "timestamp": "2025-06-03T21:59:22Z"
  },
  {
    "title": "Defendant accused of faking Trump death threats so witness would be deported - The Washington Post",
    "description": "Defendant accused of faking Trump death threats so witness would be deportedThe Washington Post US man charged for framing immigrant in fake plot to kill TrumpThe Guardian Milwaukee man charged with identity theft for allegedly writing letter that led to arre…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177917809",
    "timestamp": "2025-06-03T21:55:00Z"
  },
  {
    "title": "Ex-GOP Lawmaker Regrets Being ‘Divisive Political Asshole,’ Is Joining Democratic Party",
    "description": "“I’m still a conservative, but I’m not a conservative jerk,” former Illinois Rep. Joe Walsh said.",
    "link": "https://www.huffpost.com/entry/joe-walsh-democratic-party_n_683f3600e4b0636225d6009e",
    "timestamp": "2025-06-03T21:54:54Z"
  },
  {
    "title": "Donald Trump orders 50% steel and aluminium tariffs to begin on June 4 - Financial Times",
    "description": "Donald Trump orders 50% steel and aluminium tariffs to begin on June 4Financial Times Trump signs order for 50% tariff on steel, aluminum — why economists are dismayedMarketWatch Cleveland-Cliffs, Tesla, GM, Blueprint Medicines, BioNTech, DraftKings, and More…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177917793",
    "timestamp": "2025-06-03T21:54:40Z"
  },
  {
    "title": "List of Job Corps Locations Closing in June Amid Trump Admin Cuts",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's administration issued a \"phased pause in operations\" for Job Corps centers across the United States.\nJob Corps operates as a federally funded educational and career training program fo…",
    "link": "https://biztoc.com/x/74de398b0dda247f",
    "timestamp": "2025-06-03T21:54:30Z"
  },
  {
    "title": "What a New Orleans jail escapee asking for Trump’s help says about the president",
    "description": "President Donald Trump has set an expectation that even unrepentant people convicted of the worst crimes can successfully petition his throne for mercy.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/antoine-massey-new-orleans-prison-escape-trump-pardons-rcna209744",
    "timestamp": "2025-06-03T21:53:11Z"
  },
  {
    "title": "Escaped Inmate Asks Lil Wayne, NBA YoungBoy, Meek Mill for Help",
    "description": "Antoine Massey, one of the inmates who broke out of a New Orleans jail in May, shared a video asking Lil Wayne, NBA YoungBoy, and Meek Mill for help.",
    "link": "http://www.rollingstone.com/music/music-news/escaped-inmate-antoine-massey-lil-wayne-nba-youngboy-help-1235354397/",
    "timestamp": "2025-06-03T21:51:55Z"
  },
  {
    "title": "List of Job Corps Locations Closing in June Amid Trump Admin Cuts",
    "description": "Job Corps operates as a federally funded educational and career training program for low-income Americans aged 16 to 24.",
    "link": "https://www.newsweek.com/save-job-corps-closing-down-labor-cuts-layoffs-2080611",
    "timestamp": "2025-06-03T21:51:51Z"
  },
  {
    "title": "Voters back Trump on immigration, even as approval numbers slip",
    "description": "Voter approval of President Donald Trump's immigration policies is running higher than opinions on his overall presidency, according to a pair of recent polls.",
    "link": "https://www.bostonherald.com/2025/06/03/voters-approve-of-his-trade-and-immigration-polices-but-not-trump/",
    "timestamp": "2025-06-03T21:51:34Z"
  },
  {
    "title": "John Cornyn's Chances of Losing Republican Primary After 20 Years: Poll",
    "description": "The longtime Texas senator trailed a Republican rival in another poll of the 2026 primary.",
    "link": "https://www.newsweek.com/john-cornyn-chances-losing-republican-primary-after-20-years-poll-2080595",
    "timestamp": "2025-06-03T21:50:50Z"
  },
  {
    "title": "Trade war cuts global economic growth outlook: OECD",
    "description": "The OECD slashed its annual global growth forecast on Tuesday, warning that U.S. President Donald Trump's tariffs blitz would stifle the world economy -- hitting the United States especially hard. After 3.3-percent growth last year, the world economy is now e…",
    "link": "https://japantoday.com/category/business/trade-war-cuts-global-economic-growth-outlook-oecd",
    "timestamp": "2025-06-03T21:48:38Z"
  },
  {
    "title": "Trump signs order to double steel and aluminum tariffs at midnight",
    "description": "U.S. President Donald Trump signed an executive order on Tuesday doubling the tariffs on steel and aluminum imports to 50 per cent, a move one Canadian industry official warned would have 'unrecoverable consequences.'",
    "link": "https://www.cbc.ca/news/world/trump-canada-steel-tariffs-executive-order-signed-1.7551398",
    "timestamp": "2025-06-03T21:48:18Z"
  },
  {
    "title": "Trump’s New Portrait Is as Perverse as His Second Term",
    "description": "In an uncanny photograph revealed by the White House, the president emerges from a shadowy abyss that seems to echo the nation’s decline into authoritarianism.",
    "link": "http://hyperallergic.com/1017985/donald-trump-new-portrait-is-as-perverse-as-his-second-term/",
    "timestamp": "2025-06-03T21:48:12Z"
  },
  {
    "title": "Schwarzenegger tells environmentalists dismayed by Trump to 'stop whining' and get to work",
    "description": "Arnold Schwarzenegger has a message for environmentalists who despair at the the approach of President Donald Trump's administration: “Stop whining and get to work.” The new U.S. administration has taken an ax to Biden-era environmental ambitions, rolled back…",
    "link": "https://japantoday.com/category/entertainment/schwarzenegger-tells-environmentalists-dismayed-by-trump-to-%27stop-whining%27-and-get-to-work",
    "timestamp": "2025-06-03T21:48:02Z"
  },
  {
    "title": "Elon Calls Trump’s ‘Big, Beautiful’ Bill a ‘Disgusting Abomination’",
    "description": "Elon Musk unloaded on Donald Trump's tax bill on Tuesday, calling it a \"disgusting abomination\" because of how much it adds to the deficit.",
    "link": "http://www.rollingstone.com/politics/politics-news/elon-musk-trump-tax-bill-disgusting-abomination-1235354326/",
    "timestamp": "2025-06-03T21:47:53Z"
  },
  {
    "title": "Japan party execs bracing for possibility of Diet dissolution",
    "description": "Political maneuvering intensified Tuesday amid suggestions by ruling party officials that a no-confidence motion against Prime Minister Shigeru Ishiba's cabinet could increase the chances of him dissolving parliament for an election. Ruling party lawmakers le…",
    "link": "https://japantoday.com/category/politics/japan-party-execs-bracing-for-possibility-of-diet-dissolution",
    "timestamp": "2025-06-03T21:45:39Z"
  },
  {
    "title": "Trump asked Japan to help with Golden Dome missile shield: report",
    "description": "U.S. President Donald Trump discussed cooperating with Japan on developing technology for his planned Golden Dome missile defence shield during a phone call with Japanese Prime Minister Shigeru Ishiba this month, the Nikkei reported. The two countries are exp…",
    "link": "https://japantoday.com/category/politics/trump-asked-japan-to-help-with-golden-dome-missile-shield-nikkei-reports",
    "timestamp": "2025-06-03T21:45:28Z"
  },
  {
    "title": "MTG Admits She Didn't Read Trump Mega Bill She Voted For (Liam Archacki/The Daily Beast)",
    "description": "Liam Archacki / The Daily Beast:\nMTG Admits She Didn't Read Trump Mega Bill She Voted For  —  Diehard MAGA Rep. Marjorie Taylor Greene said she wished she had not voted for President Donald Trump's “One Big, Beautiful” spending bill, explaining that she wasn'…",
    "link": "https://www.memeorandum.com/250603/p130",
    "timestamp": "2025-06-03T21:45:00Z"
  },
  {
    "title": "Even Democrats in This Battleground State Back Voter ID. But There’s a Catch.",
    "description": "Even Democrats in Nevada’s state legislature–a key battleground state–now favor voter ID, but with a catch.  The catch was the bill also expands ballot drop... Read More\nThe post Even Democrats in This Battleground State Back Voter ID. But There’s a Catch. ap…",
    "link": "https://www.dailysignal.com/2025/06/03/even-democrats-in-this-battleground-state-back-voter-id-but-theres-a-catch/",
    "timestamp": "2025-06-03T21:45:00Z"
  },
  {
    "title": "Uranium ETFs Surge on New Meta, Constellation AI Deal",
    "description": "- URA, NUKZ and others added to the year’s big gains in nuclear and uranium ETFs. - Demand for AI processing is boosting demand for clean energy sources.",
    "link": "http://www.etf.com/sections/news/uranium-etfs-surge-new-meta-constellation-ai-deal?utm_source=yahoo-finance&amp;utm_medium=rss&amp;utm_campaign=yahoo-finance-rss",
    "timestamp": "2025-06-03T21:45:00Z"
  },
  {
    "title": "Poland sets government confidence vote for June 11 as Tusk notes a ‘new political reality’",
    "description": "Prime Minister Donald Tusk said Tuesday that Poland's parliament will hold a confidence vote on his government on June 11, as the country faces a “new political reality.” He called for the vote after his political ally, the liberal Warsaw mayor, lost Poland’s…",
    "link": "https://japantoday.com/category/world/poland%27s-pm-tusk-says-confidence-vote-in-parliament-on-his-government-will-take-place-june-111",
    "timestamp": "2025-06-03T21:44:17Z"
  },
  {
    "title": "Dutch government collapses after far-right leader Wilders quits coalition",
    "description": "The Dutch government collapsed on Tuesday, most likely ushering in a snap election, after anti-Muslim politician Geert Wilders quit the right-wing coalition, accusing other parties of failing to back his tougher immigration policies. But Prime Minister Dick S…",
    "link": "https://japantoday.com/category/world/dutch-government-collapses-after-far-right-leader-wilders-quits-coalition1",
    "timestamp": "2025-06-03T21:44:11Z"
  },
  {
    "title": "FEMA staff confused after head said he was unaware of US hurricane season, sources say",
    "description": "Staff of the Federal Emergency Management Agency were left baffled on Monday after the head of the U.S. disaster agency said he had not been aware the country has a hurricane season, according to four sources familiar with the situation. The remark was made d…",
    "link": "https://japantoday.com/category/world/exclusive-fema-staff-confused-after-head-said-he-was-unaware-of-us-hurricane-season-sources-say1",
    "timestamp": "2025-06-03T21:44:04Z"
  },
  {
    "title": "The Bob Cesca Podcast: The Joebot",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: The Joebot -- Donald is creating a database of personal private details about all Americans. Elon Musk was totally high in the Oval Office the other day. Elon's ketamine abuse made him have a …",
    "link": "https://littlegreenfootballs.com/article/54655_The_Bob_Cesca_Podcast-_The_Joe",
    "timestamp": "2025-06-03T21:43:12Z"
  },
  {
    "title": "The Media’s Catch-22: Exposing Joe Biden Would Have Assured Trump’s Re-election",
    "description": "The legacy media finds itself in a dilemma of its own making. The depth and seriousness of Joe Biden’s mental and physical problems during his presidency are being exposed daily—ironically, much of it by the denizens of the legacy media as they feverishly att…",
    "link": "https://freerepublic.com/focus/f-news/4320817/posts",
    "timestamp": "2025-06-03T21:43:12Z"
  },
  {
    "title": "Joe Walsh Says the 3 Words 'I Thought I'd Never Utter'",
    "description": "How much can life change in a decade? Ask former Republican congressman Joe Walsh. In 2016, the one-time Illinois representative wrote that he was voting for Donald Trump and \"grabbing my musket\" should Trump lose. He quickly changed his tune, so much so that…",
    "link": "https://www.newser.com/story/369681/three-words-i-thought-id-never-utter-im-a-democrat.html",
    "timestamp": "2025-06-03T21:42:26Z"
  },
  {
    "title": "Musk blasts Trump mega-bill",
    "description": "Tensions between allies Elon Musk and Donald Trump erupted Tuesday as the world's richest man derided the president's key piece of economic legislation in a startling rupture just days after exiting a controversial job in the White House. Musk was lauded by t…",
    "link": "https://japantoday.com/category/world/musk-blasts-trump-mega-bill-days-after-farewell",
    "timestamp": "2025-06-03T21:42:14Z"
  },
  {
    "title": "Outspoken liberal leader Lee elected South Korea's president, closing period of political tumult",
    "description": "Lee Jae-myung, who rose from childhood poverty to become South Korea’s leading liberal politician vowing to fight inequality and corruption, will become the country's next president on Wednesday after an election that closed one of the most turbulent chapters…",
    "link": "https://japantoday.com/category/world/south-korean-media-say-liberal-opposition-candidate-lee-jae-myung-has-been-elected-president",
    "timestamp": "2025-06-03T21:42:04Z"
  },
  {
    "title": "GOP senators express 'concerns,' 'skepticism' over Trump's spending bill after Musk rant",
    "description": "Elon Musk and cohort of Senate Republicans find common ground in their disdain for the House GOP's version of President Donald Trump's \"one big, beautiful bill.\"",
    "link": "https://www.foxnews.com/politics/gop-senators-express-concerns-skepticism-over-trumps-spending-bill-after-musk-rant",
    "timestamp": "2025-06-03T21:41:41Z"
  },
  {
    "title": "Elon Musk slams Trump’s signature budget bill as a ‘disgusting abomination’",
    "description": "Donald Trump's budget bill faces Republican discord in Senate, where some lawmakers reject increase to US national debt.",
    "link": "https://www.aljazeera.com/news/2025/6/3/elon-musk-slams-trumps-signature-budget-bill-as-a-disgusting-abomination",
    "timestamp": "2025-06-03T21:41:20Z"
  },
  {
    "title": "Trump DHS Cracks Down on Entire Family of Suspected Colorado Terrorist: 'Justice Will Be Served'",
    "description": "A horrific anti-Semitic attack in Boulder, Colorado, has prompted a sweeping response from the Department of Homeland Security.",
    "link": "https://www.westernjournal.com/trump-dhs-cracks-entire-family-suspected-colorado-terrorist-justice-will-served/",
    "timestamp": "2025-06-03T21:41:06Z"
  },
  {
    "title": "Is another 'grand bargain' necessary to build another pipeline?",
    "description": "At question period on Monday, two Conservative MPs beseeched the government to approve a pipeline that very afternoon. Such a request raises other questions. Questions like, what pipeline? To where? To be built by whom? And under what conditions?",
    "link": "https://www.cbc.ca/news/politics/carney-smith-premiers-pipeline-analysis-1.7551307",
    "timestamp": "2025-06-03T21:40:51Z"
  },
  {
    "title": "Major Firefighters Union Endorses Tax Cuts in Trump's 'Big, Beautiful Bill'",
    "description": "The firefighter union International Association of Fire Fighters (IAFF) -- representing over 350,000 members -- has endorsed the tax cuts in President Donald Trump's \"big, beautiful bill,\" deeming it common sense.\nThe post Major Firefighters Union Endorses Ta…",
    "link": "https://www.breitbart.com/politics/2025/06/03/major-firefighters-union-endorses-tax-cuts-in-trumps-bi/",
    "timestamp": "2025-06-03T21:40:36Z"
  },
  {
    "title": "Bank of Canada Likely to Hold as Uncertainty Mounts: Decision Guide",
    "description": "The Bank of Canada is likely to hold interest rates steady as officials wait for clearer signals on how US President Donald Trump’s trade war will end up striking the economy.",
    "link": "https://financialpost.com/pmn/business-pmn/bank-of-canada-likely-to-hold-as-uncertainty-mounts-decision-guide",
    "timestamp": "2025-06-03T21:38:23Z"
  },
  {
    "title": "IDF says roads to Gaza aid centres are 'combat zones' as sites close for day",
    "description": "Aid distribution will be halted on Wednesday, with Gazans warned by the IDF not to travel to collection points.",
    "link": "https://www.bbc.com/news/articles/cnv18gp4rdzo",
    "timestamp": "2025-06-03T21:38:23Z"
  },
  {
    "title": "Ex-Red Sox Slugger Kevin Youkilis Blasts AOC for 'Virtue Signaling' over Colorado Terror Attack",
    "description": "Ex-MLB player Kevin Youkilis is blasting Alexandria Ocasio-Cortez for her comments about the terror attack on Jewish rally goers in Colorado.\nThe post Ex-Red Sox Slugger Kevin Youkilis Blasts AOC for ‘Virtue Signaling’ over Colorado Terror Attack appeared fir…",
    "link": "https://www.breitbart.com/sports/2025/06/03/ex-red-sox-kevin-youkilis-blasts-aoc-for-virtue-signaling-over-colorado-terror-attack/",
    "timestamp": "2025-06-03T21:38:21Z"
  },
  {
    "title": "About The FBI “Prohibited Access” Files",
    "description": "Many articles are being written and much typeset is being exhausted by people talking about the recent revelations that the FBI has a designated information silo called “prohibited access” within its record keeping system. Allow me to jump this readership wel…",
    "link": "https://freerepublic.com/focus/f-news/4320815/posts",
    "timestamp": "2025-06-03T21:37:27Z"
  },
  {
    "title": "About The FBI “Prohibited Access” Files",
    "description": "Many articles are being written and much typeset is being exhausted by people talking about the recent revelations that the FBI has a designated information silo called “prohibited access” within its record keeping system. Allow me to jump this readership wel…",
    "link": "https://freerepublic.com/focus/f-bloggers/4320815/posts",
    "timestamp": "2025-06-03T21:37:27Z"
  },
  {
    "title": "Kennedy Center Sells Out Showings of ‘The King of Kings’ After Pride Month Events Were Canceled",
    "description": "The Kennedy Center began the month of June by debuting the Angel Studios hit film \"The King of Kings,\" an animated movie that goes through the life of Jesus. \nThe post Kennedy Center Sells Out Showings of ‘The King of Kings’ After Pride Month Events Were Canc…",
    "link": "https://www.breitbart.com/politics/2025/06/03/the-kennedy-center-sells-out-showings-of-film-about-jesus-christ-the-king-of-kings/",
    "timestamp": "2025-06-03T21:36:27Z"
  },
  {
    "title": "Dutch Government Collapses After Far-Right Party Leaves Coalition",
    "description": "Geert Wilders’s drastic decision ends 11 months of rocky right-wing rule.",
    "link": "http://foreignpolicy.com/2025/06/03/geert-wilders-far-right-netherlands-government-coalition-collapse/",
    "timestamp": "2025-06-03T21:36:26Z"
  },
  {
    "title": "UK spared from Trump's 50% steel and aluminium tariffs",
    "description": "The executive order raises import taxes for US firms buying from other countries - but the levy remains at 25% for the UK.",
    "link": "https://www.bbc.com/news/articles/cg713y73plro",
    "timestamp": "2025-06-03T21:35:58Z"
  },
  {
    "title": "Man Accused Of Faking Trump Death Threat In Attempt To Get Witness Against Him Deported",
    "description": "The allegedly forged letter duped the White House and Department of Homeland Security Secretary Kristi Noem, who shared it on social media.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-threat-letter_n_683f622fe4b057e55d73de4b",
    "timestamp": "2025-06-03T21:35:52Z"
  },
  {
    "title": "Read Trump’s full memo asking Congress to claw back approved spending targeted by DOGE",
    "description": "Trump's aides say the funding cuts target programs that promote liberal ideologies.",
    "link": "https://www.pbs.org/newshour/politics/read-trumps-full-memo-asking-congress-to-claw-back-approved-spending-targeted-by-doge",
    "timestamp": "2025-06-03T21:35:19Z"
  },
  {
    "title": "Energy-Intensive Manufacturing in US a Victim of ‘Giant Sucking Sound’ From China",
    "description": "American manufacturing has fallen victim to a “giant sucking sound,” according to an expert on energy and climate.   There is a “a giant sucking... Read More\nThe post Energy-Intensive Manufacturing in US a Victim of ‘Giant Sucking Sound’ From China appeared f…",
    "link": "https://www.dailysignal.com/2025/06/03/us-manufacturing-victim-giant-sucking-sound-created-china/",
    "timestamp": "2025-06-03T21:34:23Z"
  },
  {
    "title": "Iran won’t stop enriching uranium: The bomb is just part of the plan",
    "description": "The United States and Israel must recognize that Iran will never voluntarily abandon its nuclear enrichment unless forced to do so.",
    "link": "https://www.jpost.com/opinion/article-856366",
    "timestamp": "2025-06-03T21:34:06Z"
  },
  {
    "title": "Elon Musk Gets Roasted Online After Attempting To Dodge Trump Interview Questions",
    "description": "“The guy who stuck his nose in our business has limits on his own. Interesting,” one TikTok user wrote.",
    "link": "https://www.huffpost.com/entry/elon-musk-cbs-mornings-interview_n_683ee9ffe4b08b77a4619e0b",
    "timestamp": "2025-06-03T21:33:58Z"
  },
  {
    "title": "A degree of uncertainty: Which universities will be hit hardest by Trump’s war on foreign students?",
    "description": "Which universities will be hit hardest by Trump’s war on foreign students?\nIt’s not the Ivy League\nIf college presidents were hoping Donald Trump would tire of lambasting America’s universities, recent tirades against international students have left them fre…",
    "link": "https://biztoc.com/x/0986812b8f3aec8f",
    "timestamp": "2025-06-03T21:32:45Z"
  },
  {
    "title": "The key dynamics shaping a busy month of primaries: From the Politics Desk",
    "description": "The next three weeks will bring primaries in the three most closely watched races of 2025 in Virginia, New Jersey and New York City.",
    "link": "https://www.nbcnews.com/politics/politics-news/key-dynamics-shaping-busy-month-primaries-politics-desk-rcna210724",
    "timestamp": "2025-06-03T21:30:00Z"
  },
  {
    "title": "Marc Maron Has Regrets About Popularizing the Comedian-Hosted Interview Podcast",
    "description": "By\n JM McNab\n Published: June 03rd, 2025",
    "link": "https://www.cracked.com/article_46846_marc-maron-has-regrets-about-popularizing-the-comedian-hosted-interview-podcast.html",
    "timestamp": "2025-06-03T21:30:00Z"
  },
  {
    "title": "JD Vance Is Being Proven Right About Europe's Free Speech Problem",
    "description": "In February, many in Europe dismissed Vance's critics as alarmist. But recent controversies over blasphemy and protest have sharpened the divide he warned about.",
    "link": "https://www.newsweek.com/jd-vance-being-proven-right-about-europes-free-speech-problem-2080604",
    "timestamp": "2025-06-03T21:29:58Z"
  },
  {
    "title": "Fed Governor Lisa Cook sees tariffs raising inflation and complicating rate policy",
    "description": "Federal Reserve Governor Lisa Cook expressed concern Tuesday with the progress on inflation, saying recent lower readings could reverse after tariffs work their way through the economy.",
    "link": "https://www.nbcnews.com/business/economy/fed-governor-lisa-cook-sees-tariffs-raising-inflation-complicating-rat-rcna210781",
    "timestamp": "2025-06-03T21:28:01Z"
  },
  {
    "title": "Musk calls Trump-backed tax bill a 'disgusting abomination'",
    "description": "Elon Musk has criticised US President Donald Trump's tax and spending bill, calling it \"outrageous\" and a \"disgusting abomination\".",
    "link": "https://news.sky.com/story/elon-musk-calls-donald-trump-backed-tax-bill-a-disgusting-abomination-13378858",
    "timestamp": "2025-06-03T21:28:00Z"
  },
  {
    "title": "Eurozone inflation slows sharply in May",
    "description": "Inflation in the eurozone eased in May to its lowest level in eight months, back below the European Central Bank’s two-percent target, further raising expectations for another interest rate cut this week. Year-on-year consumer price increases in the single cu…",
    "link": "https://www.digitaljournal.com/world/eurozone-inflation-slows-sharply-in-may/article",
    "timestamp": "2025-06-03T21:27:32Z"
  },
  {
    "title": "US steel, aluminum tariff hikes to take effect Wednesday: W.House",
    "description": "The United States will double its tariffs on imported steel and aluminum starting Wednesday, according to the White House, as it published an order signed by President Donald Trump. The move marks a latest salvo in Trump’s trade wars, bringing levies on both …",
    "link": "https://www.digitaljournal.com/world/us-steel-aluminum-tariff-hikes-to-take-effect-wednesday-w-house/article",
    "timestamp": "2025-06-03T21:27:20Z"
  },
  {
    "title": "FBN Flack Blames Economic Uncertainty From Trump's Tariffs On Biden",
    "description": "More gaslighting from Fox Business host David Asman and Sen. Marsha Blackburn, who regularly gives Tommy Tuberville a run for the money as the stupidest person in the United States Senate.\nAsman, who was filling in for Larry Kudlow this Monday, brought Blackb…",
    "link": "https://crooksandliars.com/2025/06/fbn-flack-blames-economic-uncertainty",
    "timestamp": "2025-06-03T21:27:09Z"
  },
  {
    "title": "Trump’s War With The Media: White House Asks Congress To Rescind $1.1 Billion In Corporation For Public Broadcasting Funding",
    "description": "NPR and PBS, which receive public funding via the Corporation for Public Broadcasting, have already sued the Trump administration over his order directing the CPB to stop funding the media organizations.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/03/trumps-war-with-the-media-npr-sues-trump/",
    "timestamp": "2025-06-03T21:22:53Z"
  },
  {
    "title": "Trump promised to bring jobs to the Rust Belt. The Sun Belt may get them instead",
    "description": "Trump promised to bring jobs to the Rust Belt. The Sun Belt may get them instead.\nLoading...\n| Weirton, W.Va.; and Gainesville, Ga.\nMark Glyptis voted last year for Donald Trump and his vow to use tariffs as a tool to revive U.S. manufacturing. It’s a tool th…",
    "link": "https://biztoc.com/x/54311100c9ffbc56",
    "timestamp": "2025-06-03T21:21:25Z"
  },
  {
    "title": "Trump signs order hiking steel, aluminum tariffs to 50%",
    "description": "United States President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n signed a directive on Tuesday \n \n \n \n \n \n raising steel\n \n \n \n \n \n and \n \n \n \n \n \n aluminum tariffs\n \n \n \n \n \n to 50 per cent from 25 per cent starting on June 4, following through on a pledge to boo…",
    "link": "https://biztoc.com/x/d2040da413882587",
    "timestamp": "2025-06-03T21:21:00Z"
  },
  {
    "title": "MSNBC's primetime show bleeds viewers as Rachel Maddow steps away",
    "description": "Former White House press secretary Jen Psaki failed to keep a grip on Rachel Maddow's 9 p.m. MSNBC audience when the network began its revamped primetime lineup on May 6, data from Nielsen Media Research showed.Maddow's show ran Monday through Friday during P…",
    "link": "https://www.rawstory.com/rachel-maddow-2672278461/",
    "timestamp": "2025-06-03T21:20:57Z"
  },
  {
    "title": "Trump Grants Clemency to Executive Who Orchestrated $205M Medicare Fraud Scheme - NewsBreak",
    "description": "President Donald Trump has quietly commuted the sentence of a Florida health care executive convicted of leading a Medicare fraud scheme to pilfer $205 mil",
    "link": "https://www.newsbreak.com/share/4036410485465-trump-grants-clemency-to-executive-who-orchestrated-205m-medicare-fraud-scheme?s=a2&share_destination_id=MjAxNDEyMzE2LTE3NDkwNDEyNjA4NjQ%3D&pd=0Dd6XkLF&hl=en_US&send_time=1749041260&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.21.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-control%2Cns_foryou_blend_exp_25q2-v8%2Cns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_rank_exp_25q2-v5",
    "timestamp": "2025-06-03T21:19:47Z"
  },
  {
    "title": "Trump Grants Clemency to Executive Who Orchestrated $205M Medicare Fraud Scheme",
    "description": "Republicans have claimed they’re “saving” Medicaid from “waste, fraud and abuse” with massive cuts.",
    "link": "https://truthout.org/articles/trump-grants-clemency-to-executive-who-orchestrated-205m-medicare-fraud-scheme/",
    "timestamp": "2025-06-03T21:19:47Z"
  },
  {
    "title": "Elon Musk blasts Donald Trump’s agenda bill days after leaving White House: ‘Disgusting abomination’",
    "description": "Elon Musk blasts Donald Trump’s agenda bill days after leaving White House: ‘Disgusting abomination’7news.com.au",
    "link": "https://7news.com.au/news/elon-musk-blasts-donald-trumps-agenda-bill-as-disgusting-abomination-c-18915877",
    "timestamp": "2025-06-03T21:17:35Z"
  },
  {
    "title": "'I can't take it anymore': Elon Musk slams Trump-backed US spending plan",
    "description": "The spending bill has the potential to add trillions to the national debt and budget deficit.",
    "link": "https://www.thejournal.ie/elon-musk-us-spending-plan-6722928-Jun2025/",
    "timestamp": "2025-06-03T21:16:19Z"
  },
  {
    "title": "Unpacking the President’s Vision for the National Security Council",
    "description": "Following the Trump administration’s reorganization of the National Security Council staff, former NSC staffers say the president appears to place more confidence in the State... Read More\nThe post Unpacking the President’s Vision for the National Security Co…",
    "link": "https://www.dailysignal.com/2025/06/03/unpacking-presidents-vision-national-security-council/",
    "timestamp": "2025-06-03T21:16:13Z"
  },
  {
    "title": "U.S., Canadian markets move higher as investors shrug off tariff ‘noise’",
    "description": "Canada’s main stock index edged up and U.S. markets climbed as investors tried to tune out the latest noise from U.S. President Donald Trump’s tariff war. “I think everybody’s taking a wait-and-see approach,” said Allan Small, senior investment adviser at iA …",
    "link": "https://financialpost.com/pmn/u-s-canadian-markets-move-higher-as-investors-shrug-off-tariff-noise",
    "timestamp": "2025-06-03T21:15:56Z"
  },
  {
    "title": "Jobs Up. Borders Closed. Trump’s Second Term Is Just Getting Started.",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Jobs Up. Borders Closed. Trump’s Second Term Is Just Getting Started. a…",
    "link": "https://www.dailysignal.com/2025/06/03/jobs-up-borders-closed-trumps-second-term-is-just-getting-started/",
    "timestamp": "2025-06-03T21:14:57Z"
  },
  {
    "title": "Trump formally asks Congress to claw back approved spending targeted by DOGE",
    "description": "The process known as rescission will take funding away from programs targeted by Elon Musk's Department of Government Efficiency.",
    "link": "https://www.pbs.org/newshour/politics/trump-formally-asks-congress-to-claw-back-approved-spending-targeted-by-doge",
    "timestamp": "2025-06-03T21:14:56Z"
  },
  {
    "title": "Paramount Fires WPP Media, Its Longtime Agency Of Record, In Cost-Saving Move Amid Skydance Merger Review",
    "description": "EXCLUSIVE: In a move that blindsided many staffers, Paramount has fired its longtime media agency of record in a cost-saving move as its merger with Skydance Media continues to gestate. WPP Media, formerly known as GroupM before a recent rebrand, had worked w…",
    "link": "http://deadline.com/2025/06/paramount-fires-wpp-media-agency-of-record-cost-saving-skydance-merger-review-1236422194/",
    "timestamp": "2025-06-03T21:14:06Z"
  },
  {
    "title": "Chief medical officer ‘anxious’ about US leaving World Health Organisation - NewsBreak",
    "description": "Sir Gregor Smith spoke to MSPs (Lesley Martin/PA) PA Archive Scotland’s chief medical officer has said he is “anxious” about the US withdrawal from the Wor",
    "link": "https://www.newsbreak.com/share/4035486065147-chief-medical-officer-anxious-about-us-leaving-world-health-organisation?_f=app_share&pd=05WApuMu&lang=en_US&send_time=1748985208&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.21.0.32%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q2-v7%2Cns_foryou_blend_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q2-v7&s=i2",
    "timestamp": "2025-06-03T21:13:53Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Trump for Sharing ‘Deranged’ Theory Claiming Biden Is a Robot Clone: ‘This Is Deeply Nuts… if Your Dad Was Saying This, You’d Look for an Assisted Living Facility’",
    "description": "Jimmy Kimmel is roasting Donald Trump yet again, this time for the president’s decision to share a “deranged” conspiracy on his Truth Social profile that claims Joe Biden was executed in 2020 and was replaced with robot clones. The theory alleges that Democra…",
    "link": "https://variety.com/2025/tv/news/jimmy-kimmel-slams-trump-theory-biden-robot-clone-1236417247/",
    "timestamp": "2025-06-03T21:12:32Z"
  },
  {
    "title": "Trump to double steel and aluminum tariffs on Canada: White House press secretary",
    "description": "Donald Trump is expected to deal another blow to a key Canadian industry when he signs an order to double tariffs on steel and aluminum.",
    "link": "https://nationalpost.com/news/canada/trump-to-double-steel-and-aluminum-tariffs-on-canada-white-house-press-secretary",
    "timestamp": "2025-06-03T21:12:02Z"
  },
  {
    "title": "Trump Signs Order Doubling Tariffs on Steel and Aluminum",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has signed an executive order doubling tariffs on imported steel and aluminum to 50 percent, effective June 4, 2025. The move aims to protect U.S. national security by curbing what the a…",
    "link": "https://biztoc.com/x/b8f0b90d25ac69c8",
    "timestamp": "2025-06-03T21:09:54Z"
  },
  {
    "title": "Savannah Chrisley Dishes on Parents Todd & Julie's First Days Out of Prison",
    "description": "The Chrisleys are officially back in business -- and if you ask Savannah, it’s like Todd and Julie never did time at all ... the family’s already snapping back following their prison pardons. Savannah spilled all the tea on the latest episode…",
    "link": "https://www.tmz.com/2025/06/03/savannah-chrisley-unlocked-podcast-parents-todd-julie-first-days-out-of-prison/",
    "timestamp": "2025-06-03T21:08:23Z"
  },
  {
    "title": "California Senate Approves Film & TV Tax Credits Bill",
    "description": "In a near-unanimous vote, the California Senate today passed its version of legislation aimed at expanding and retooling the state’s Film and Television Tax Credit Program. The vote on Senate Bill 630 was 34-1, with the only nay coming from Sen. Roger Niello,…",
    "link": "http://deadline.com/2025/06/california-film-tv-tax-credits-bill-passes-state-senate-1236422210/",
    "timestamp": "2025-06-03T21:07:52Z"
  },
  {
    "title": "Farrell ‘determined’ to strike trade deal with Europe",
    "description": "Trade Minister Don Farrell is in Paris trying to secure a free trade deal with Europe, and Anthony Albanese has hinted that Labor's superannuation tax could be up for debate.\nThe post Farrell ‘determined’ to strike trade deal with Europe appeared first on Cri…",
    "link": "http://www.crikey.com.au/2025/06/04/don-farrell-europe-trade-anthony-albanese-superannuation-tax/",
    "timestamp": "2025-06-03T21:05:44Z"
  },
  {
    "title": "Trump admin sent ‘long list’ of ‘tough’ demands to Vietnam in trade talks",
    "description": "The Trump administration has presented Vietnam with a a \"long\" list of \"tough\" demands in tariff negotiations, including measures…\nThe post Trump admin sent ‘long list’ of ‘tough’ demands to Vietnam in trade talks appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/06/03/trump-admin-sent-long-list-of-tough-demands-to-vietnam-in-trade-talks/",
    "timestamp": "2025-06-03T21:05:00Z"
  },
  {
    "title": "Authorities raid home where New Orleans jail escapee appeared to shoot video pleading for help: source",
    "description": "An Instagram video purportedly shows Antoine Massey, an escaped New Orleans fugitive, begging for help from rappers and President Donald Trump.",
    "link": "https://www.foxnews.com/us/authorities-raid-home-where-new-orleans-jail-escapee-appeared-shoot-video-pleading-help-source",
    "timestamp": "2025-06-03T21:02:29Z"
  }
]