[
  {
    "title": "What to know as lawmakers disclose vivid new details of US boat strikes",
    "description": "It is testing the scope of laws that have long governed soldiers on the battlefield.",
    "link": "https://www.bostonherald.com/2025/12/05/trump-boat-strikes-what-to-know/",
    "timestamp": "2025-12-05T21:34:06Z"
  },
  {
    "title": "Stephen Miller bashed for pushing restrictions that 'are no longer on the books'",
    "description": "A law professor bashed Stephen Miller for pushing discriminatory immigration restrictions in America that have long been gone. Miller, the Trump administration's immigrant policy architect and Homeland Security Advisor, has tried to revive \"nationality-based …",
    "link": "https://www.rawstory.com/stephen-miller-2674374093/",
    "timestamp": "2025-12-05T21:33:35Z"
  },
  {
    "title": "World Cup draw rigged for USA? Soccer fans think USMNT landing in 'easiest' group is no coincidence",
    "description": "While other sides were greeted by international superstars when their World Cup group was read, the United States was met with fairly unheralded nations, at least by World Cup standards.",
    "link": "https://www.sportingnews.com/us/soccer/news/world-cup-draw-rigged-usa-soccer-donald-trump/8175870eb0d92f5c66d8dd04",
    "timestamp": "2025-12-05T21:33:11Z"
  },
  {
    "title": "'You will be defeated': Rebel red state Republicans get 'final warning' for defying Trump",
    "description": "Several groups affiliated with President Donald Trump's MAGA movement are now applying pressure to Republican state legislators in Indiana, who have yet to pass a heavily gerrymandered congressional redistricting map.Politico reported Friday that Turning Poin…",
    "link": "https://www.rawstory.com/alternet-posts/maga-warning-republican-holdouts/",
    "timestamp": "2025-12-05T21:32:17Z"
  },
  {
    "title": "Trump Shouts About ‘Tiny Cars’ Coming to U.S. in Wild Post",
    "description": "President Donald Trump used a breathless caps-heavy blast on Truth Social to announce Friday that he had “approved TINY CARS to be built in America.”\n“These cars of the very near future are inexpensive, safe, fuel efficient and, quite simply, AMAZING!!! START…",
    "link": "https://biztoc.com/x/afdfe1b459ea8e4f",
    "timestamp": "2025-12-05T21:31:58Z"
  },
  {
    "title": "4 times in 7 seconds: Trump calls Somali immigrants ‘garbage’",
    "description": "He said it four times in seven seconds: Somali immigrants in the United States are “garbage.”\nIt was no mistake. In fact, President Donald Trump’s rhetorical attacks on immigrants have been building since he said Mexico was sending “rapists” across the border…",
    "link": "https://biztoc.com/x/0e9438833359480b",
    "timestamp": "2025-12-05T21:31:44Z"
  },
  {
    "title": "Would Donald Trump Try to Block Netflix’s Takeover of Warner Bros.?",
    "description": "The seismic deal Netflix inked to buy Warner Bros. — with an eye-popping $83 billion value — will need to get approval from regulators in the U.S. and abroad. And domestically, there’s one individual whose opinion on the matter, President Donald Trump, is of …",
    "link": "https://variety.com/2025/biz/news/would-trump-block-netflix-warner-bros-deal-regulatory-approvals-1236601031/",
    "timestamp": "2025-12-05T21:31:43Z"
  },
  {
    "title": "DeSantis warns GOP faces 'issue' keeping Trump voters engaged in future elections",
    "description": "Florida governor urges Republicans to be bolder and draw sharper contrasts with Democrats to keep Trump-aligned voters engaged in future elections.",
    "link": "https://www.foxnews.com/media/desantis-warns-gop-faces-issue-keeping-trump-voters-engaged-future-elections",
    "timestamp": "2025-12-05T21:28:49Z"
  },
  {
    "title": "US judge clears Justice Department to release Epstein grand jury transcripts",
    "description": "All transcripts relating to the 2005 and 2007 investigation of convicted paedophile Jeffrey Epstein and his accomplice-girlfriend will be unsealed.",
    "link": "https://www.channelnewsasia.com/world/epstein-trump-us-files-justice-jury-5564786",
    "timestamp": "2025-12-05T21:25:34Z"
  },
  {
    "title": "Trump gets award, lines up with other world leaders at 2026 FIFA World Cup draw",
    "description": "The president received a peace prize from FIFA leader Gianni Infantino",
    "link": "https://www.deseret.com/politics/2025/12/05/trump-fifa-world-cup-draw-2026-mexico-canada/",
    "timestamp": "2025-12-05T21:24:56Z"
  },
  {
    "title": "4 times in 7 seconds: Trump calls Somali immigrants ‘garbage’",
    "description": "“We don't want ‘em in our country,” Trump said five times of the nation's 260,000 people of Somali descent.",
    "link": "https://fortune.com/2025/12/05/trump-somalia-immigration-garbage-racism/",
    "timestamp": "2025-12-05T21:24:11Z"
  },
  {
    "title": "Federal judge appears skeptical of Trump’s effort to retain control of California National Guard",
    "description": "Trump initially called up more than 4,000 California National Guard troops in response to protests.",
    "link": "https://www.bostonherald.com/2025/12/05/federal-enforcement-national-guard-california/",
    "timestamp": "2025-12-05T21:19:21Z"
  },
  {
    "title": "Coast Guard helicopter sniper takes out narco-boat engines in stunning exclusive video",
    "description": "EXCLUSIVE: The Coast Guard seized over 20,000 pounds of cocaine from a go-fast vessel during Operation Pacific Viper, a joint U.S. initiative to counter drug trafficking.",
    "link": "https://www.foxnews.com/politics/coast-guard-helicopter-sniper-takes-out-narco-boat-engines-stunning-exclusive-video",
    "timestamp": "2025-12-05T21:18:40Z"
  },
  {
    "title": "Gianni Infantino’s Trump problem - Politico",
    "description": "Gianni Infantino’s Trump problemPolitico WATCH: Trump awarded new FIFA peace prizePBS Gianni Infantino Awards Trump a FIFA Peace Prize and Announces World Cup DrawThe New York Times Live updates: Donald Trump attends 2026 World Cup draw; Indiana House OKs new…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180300905",
    "timestamp": "2025-12-05T21:12:57Z"
  },
  {
    "title": "Defending World Cup champion Argentina to open tournament vs. Algeria",
    "description": "With eyes across the globe focused on 48 balls being plucked from four bowls, next year's World Cup came into focus Friday when a draw determined Argentina and Lionel Messi will start their title defence against Algeria.",
    "link": "https://www.cbc.ca/sports/soccer/worldcup/world-cup-draw-roundup-dec5-9.7005137",
    "timestamp": "2025-12-05T21:10:46Z"
  },
  {
    "title": "Supreme Court Lets Trump Get Closer to Ending Birthright Citizenship",
    "description": "The Supreme Court agreed Friday to hear arguments over the legality of Donald Trump’s plan to end birthright citizenship, the 1868 constitutional detail that entitles any person born on U.S. soil to an American passport.In doing so, the nation’s highest judic…",
    "link": "https://newrepublic.com/post/204056/supreme-court-donald-trump-ending-birthright-citizenship",
    "timestamp": "2025-12-05T21:10:35Z"
  },
  {
    "title": "'One of the Worst Awards Someone Could Possibly Get': FIFA Blasted for Giving Trump Made-Up 'Peace Prize'",
    "description": "President Donald Trump, whose administration is engaged in a boat-bombing campaign in the Caribbean that human rights organizations and legal experts consider a murder spree, has finally been given a peace prize.Although Trump tried unsuccessfully this year t…",
    "link": "https://www.commondreams.org/news/trump-fifa-peace-prize",
    "timestamp": "2025-12-05T21:10:07Z"
  },
  {
    "title": "‘No basis in reality’: Steve Rattner fact-checks Trump on inflation, affordability",
    "description": "“Morning Joe” economic analyst Steve Rattner broke out his charts on Friday to fact-check Donald Trump’s false claims about the economy, which he said have “no basis in reality.” \nDuring a Cabinet meeting on Tuesday, Trump said he had inherited the “worst inf…",
    "link": "https://biztoc.com/x/a2f927209e459307",
    "timestamp": "2025-12-05T21:09:33Z"
  },
  {
    "title": "3 Down, Thousands To Go: Intel Reveals Many Afghan Terrorists Left Lurking In US",
    "description": "Nearly 2,000 Afghans with ties to potential terrorists were admitted into the country under the Biden administration, according to a senior official with ODNI.",
    "link": "https://dailycaller.com/2025/12/05/joe-kent-afghanistan-joe-biden-national-counterterrorism-center/",
    "timestamp": "2025-12-05T21:08:53Z"
  },
  {
    "title": "EU hits Elon Musk's X with 120 million euro fine for breaching bloc's social media law",
    "description": "European Union regulators on Friday fined X, Elon Musk’s social media platform, 120 million euros ($140 million) for breaches of the bloc’s digital regulations, in a move that risks rekindling tensions with Washington over free speech. The European Commission…",
    "link": "https://japantoday.com/category/tech/eu-regulators-hit-elon-musk%27s-x-with-120-million-euro-fine-for-breaching-bloc%27s-social-media-law",
    "timestamp": "2025-12-05T21:06:50Z"
  },
  {
    "title": "Carney, Trump and Sheinbaum met privately on sidelines of 2026 World Cup draw in D.C.",
    "description": "Prime Minister Mark Carney is meeting privately today with U.S. President Donald Trump and Mexican President Claudia Sheinbaum, with no staff in the room.",
    "link": "https://www.cbc.ca/news/politics/us-mexico-canada-fifa-meeting-9.7005088",
    "timestamp": "2025-12-05T21:05:47Z"
  },
  {
    "title": "'It doesn't make sense': Trump wants to rename American football",
    "description": "Spurred on by World Cup 2026 fever, US President Donald Trump said Friday that American football should be renamed as the game played with a round ball, soccer, was the one true football. &quot;We have a little bit of a conflict with another thing that's call…",
    "link": "https://japantoday.com/category/sports/%27it-doesn%27t-make-sense%27-trump-wants-to-rename-american-football",
    "timestamp": "2025-12-05T21:04:58Z"
  },
  {
    "title": "Xi, Macron Seize Symbolic Victories in Unorthodox Summit",
    "description": "Both China and France hope to strengthen their images on the world stage amid growing isolationism.",
    "link": "http://foreignpolicy.com/2025/12/05/xi-jinping-macron-china-chengdu-france-trade-multilateralism-tariffs/",
    "timestamp": "2025-12-05T21:04:49Z"
  },
  {
    "title": "Argentina to open World Cup against Algeria; U.S. starts against Paraguay",
    "description": "Argentina will start its World Cup title defense against Algeria, while the U.S. was drawn Friday to open against Paraguay as soccer’s quadrennial championship returns to North America for the first time since 1994. Three-time champion Argentina also will pla…",
    "link": "https://japantoday.com/category/sports/world-cup-match-schedule-to-come-into-focus-as-draw-begins-at-kennedy-center",
    "timestamp": "2025-12-05T21:04:44Z"
  },
  {
    "title": "FIFA gives Trump a peace prize in departure from its traditional focus on sport",
    "description": "President Donald Trump was awarded the new FIFA peace prize on Friday at the 2026 World Cup draw — giving the spectacle to set matchups for the quadrennial soccer tournament even more of a Trumpian flair. Trump, who has openly campaigned for the Nobel Peace P…",
    "link": "https://japantoday.com/category/sports/fifa-gives-president-donald-trump-a-peace-prize-in-a-departure-from-its-traditional-focus-on-sport",
    "timestamp": "2025-12-05T21:04:37Z"
  },
  {
    "title": "Seventy Years After Rosa Parks’ Arrest: How We Commit to Carrying the Work Forward",
    "description": "Weekend Reading for Women’s Representation is a compilation of stories about women’s representation in politics, sports and entertainment, judicial offices and the private sector—with a little gardening mixed in!\nThis week:\n—The 2025 elections prove that vote…",
    "link": "https://msmagazine.com/2025/12/05/women-politics-representation-rosa-parks-claudette-colvin-bus-boycott/",
    "timestamp": "2025-12-05T21:04:09Z"
  },
  {
    "title": "Renewed fighting in eastern Congo threatens 'historic' peace deal brokered by Trump",
    "description": "Residents of eastern Congo said fighting has intensified despite a peace agreement that was signed by the Congolese and Rwandan presidents in Washingtion, D.C., with U.S. President Donald Trump in attendance. Presidents Felix Tshisekedi of Congo and Paul Kaga…",
    "link": "https://japantoday.com/category/world/renewed-fighting-in-eastern-congo-threatens-%27historic%27-peace-deal-brokered-by-trump",
    "timestamp": "2025-12-05T21:04:05Z"
  },
  {
    "title": "Another line of attack: White House sets up a hall of shame for news outlets",
    "description": "President Donald Trump's White House is taking on the role of media critic and asking for help from “everyday Americans.&quot; The White House launched a web portal it says will spotlight bias on the part of news outlets, targeting the Boston Globe, CBS News,…",
    "link": "https://japantoday.com/category/world/another-line-of-attack-white-house-sets-up-a-hall-of-shame-for-news-outlets",
    "timestamp": "2025-12-05T21:03:45Z"
  },
  {
    "title": "Trump strategy document revives Monroe Doctrine, slams Europe",
    "description": "The United States will reassert its dominance in the Western Hemisphere, build military strength in the Indo-Pacific, and possibly reassess its relationship with Europe, President Donald Trump said on Friday in a sweeping strategy document that seeks to refra…",
    "link": "https://japantoday.com/category/world/trump-strategy-document-revives-monroe-doctrine-slams-europe1",
    "timestamp": "2025-12-05T21:03:25Z"
  },
  {
    "title": "ICE says agents have arrested 12 people in Minneapolis as part of immigration operation",
    "description": "Federal agents have arrested a dozen people in Minneapolis since launching an enforcement operation this week primarily focused on Somali immigrants living unlawfully in the U.S., but fewer than half of those detained are Somali. U.S. Immigration and Customs …",
    "link": "https://japantoday.com/category/world/ice-says-agents-have-arrested-12-people-in-minneapolis-as-part-of-immigration-operation",
    "timestamp": "2025-12-05T21:02:34Z"
  },
  {
    "title": "ICC prosecutor says Putin warrant won’t disappear even if Ukraine peace talks are successful",
    "description": "The deputy prosecutor of the International Criminal Court said Friday that the court's investigation into the invasion of Ukraine cannot be halted by peace talks but could be deferred by the U.N. Security Council. “If we have an ongoing investigation, then we…",
    "link": "https://japantoday.com/category/world/icc-prosecutor-says-putin-warrant-won%E2%80%99t-disappear-even-if-ukraine-peace-talks-are-successful",
    "timestamp": "2025-12-05T21:02:27Z"
  },
  {
    "title": "These voters backed Trump in 2024 and Democrats in 2025. What will they do in 2026?",
    "description": "Voters who backed Democratic governors in New Jersey and Virginia this year after voting for President Donald Trump in 2024 have a message for both parties: reject your party’s extremes and run campaigns about more than just Trump",
    "link": "https://www.nbcnews.com/politics/elections/voters-backed-trump-2024-democrats-2025-will-2026-rcna246847",
    "timestamp": "2025-12-05T21:00:42Z"
  },
  {
    "title": "Scotland's World Cup draw: Key questions answered",
    "description": "It FINALLY feels real. Scotland ARE going to the World Cup.",
    "link": "https://www.skysports.com/football/news/11095/13479737/scotlands-world-cup-draw-the-key-questions-as-steve-clarkes-side-are-drawn-against-brazil-morocco-and-haiti",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Did 'South Park' Torpedo Paramount’s Plan to Acquire Warner Bros.?",
    "description": "“Oh my God, they killed the Warner Bros. deal!”",
    "link": "https://www.cracked.com/article_49409_did-south-park-torpedo-paramounts-plan-to-acquire-warner-bros.html",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Bitcoin’s end-of-year run to $100K heavily depends on Fed pivot outcomes",
    "description": "Bitcoin’s chance of hitting $100,000 before New Year’s Eve depends on investors’ reaction to the Fed policy pivot, and the market’s response to soaring BigTech and AI company debt.",
    "link": "https://cointelegraph.com/news/bitcoin-s-end-of-year-run-to-100k-heavily-depends-on-fed-pivot-outcomes",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Trump calls affordability a ‘Democrat scam’ and ‘con job’ — but nearly three-quarters of his voters think cost of living is bad or the worst ever",
    "description": "President Donald Trump and his administration insist that costs are coming down, but voters are skeptical, including those who put him back in the White House.\nDespite Republicans getting hammered on affordability in off-year elections last month, Trump conti…",
    "link": "https://biztoc.com/x/c60d02eeac8fd614",
    "timestamp": "2025-12-05T20:58:34Z"
  },
  {
    "title": "Venezuela War Update: Maduro Debuts Confusing Sketch Comedy Bit",
    "description": "Socialist dictator of Venezuela Nicolás Maduro on Thursday starred in a bizarre \"comedy sketch\" involving an antique rotary phone — apparently alluding to his recent phone call with President Donald Trump.\nThe post Venezuela War Update: Maduro Debuts Confusin…",
    "link": "https://www.breitbart.com/latin-america/2025/12/05/venezuela-war-update-maduro-debuts-confusing-sketch-comedy-bit/",
    "timestamp": "2025-12-05T20:56:14Z"
  },
  {
    "title": "Police: Felon with 29 Priors Arrested for Suspected Fentanyl Trafficking in Texas",
    "description": "Police in Lake Worth, Texas, nabbed a felon with a lengthy criminal history during a traffic stop involving suspected fentanyl. \nThe post Police: Felon with 29 Priors Arrested for Suspected Fentanyl Trafficking in Texas appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/12/05/police-felon-29-priors-arrested-suspected-fentanyl-trafficking-texas/",
    "timestamp": "2025-12-05T20:55:27Z"
  },
  {
    "title": "Trump's Bruised Hand Is Looking Pretty Swollen",
    "description": "It could be the light, but in addition to the now-familiar bandage covering the bruise, the president's hand appeared more than a little swollen.",
    "link": "https://www.huffpost.com/entry/trumps-bruised-hand-is-looking-pretty-swollen_n_69333ed3e4b03cea5ab440d8",
    "timestamp": "2025-12-05T20:54:12Z"
  },
  {
    "title": "Trump calls affordability a ‘Democrat scam’ and ‘con job’ — but nearly three-quarters of his voters think cost of living is bad or the worst ever",
    "description": "A Politico poll found that 37% of Americans who voted for Trump in 2024 believe the cost of living is the worst they can ever remember.",
    "link": "https://fortune.com/2025/12/05/trump-economy-affordability-con-job-cost-of-living-inflation-republican-voters/",
    "timestamp": "2025-12-05T20:51:52Z"
  },
  {
    "title": "Amid strained ties between India and U.S., Modi and Putin are full of praise for each other",
    "description": "A summit between Indian Prime Minister Narendra Modi and Russian President Vladimir Putin that tackled a trade imbalance and pushed to deepen defence ties between the two countries was also steeped in symbolism.",
    "link": "https://www.cbc.ca/news/world/putin-india-analysis-9.7004598",
    "timestamp": "2025-12-05T20:50:46Z"
  },
  {
    "title": "Three cheers for President Trump for letting motorists choose gas-powered cars",
    "description": "This uneconomical push for electric vehicles over gas-powered ones ignored consumer preferences and relied on high-handed executive overreach.",
    "link": "https://nypost.com/2025/12/05/opinion/good-on-president-trump-for-letting-motorists-choose-gas-powered-cars/",
    "timestamp": "2025-12-05T20:50:16Z"
  },
  {
    "title": "How White House attack on journalists affects US press freedom",
    "description": "A new government website lists journalists and media outlets that Donald Trump's administration considers liars. Experts say the move endangers free media ― and thus erodes democracy in the US. It's no secret that the current US administration doesn't have to…",
    "link": "https://www.dw.com/en/how-white-house-attack-on-journalists-affects-us-press-freedom/a-75040640",
    "timestamp": "2025-12-05T20:50:00Z"
  },
  {
    "title": "Netflix agrees to buy Warner Bros., including its game studios, for nearly $83 billion-with-a-B, but the fight may not be over yet",
    "description": "Paramount Skydance was also vying for WBD and it doesn't seem willing to take \"no\" for an answer.",
    "link": "https://www.pcgamer.com/gaming-industry/netflix-agrees-to-buy-warner-bros-including-its-game-studios-for-nearly-usd83-billion-with-a-b-but-the-fight-may-not-be-over-yet/",
    "timestamp": "2025-12-05T20:48:25Z"
  },
  {
    "title": "Judge Weighs Jailing Trump-Pardoned Jan 6 Rioter After Security Scare With Top Dem",
    "description": "A January 6 Capitol rioter pardoned by Trump is in fresh legal trouble after turning up near the home of Rep. Jamie Raskin (D-MD).\nThe post Judge Weighs Jailing Trump-Pardoned Jan 6 Rioter After Security Scare With Top Dem first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/judge-weighs-jailing-trump-pardoned-jan-6-rioter-after-security-scare-with-top-dem/",
    "timestamp": "2025-12-05T20:47:55Z"
  },
  {
    "title": "FACT FOCUS: Trump said weaker gas mileage rules will mean cheaper cars. Experts say don’t bet on it",
    "description": "By ALEXA ST. JOHN\nDETROIT (AP) — President Donald Trump this week announced plans to weaken rules for how far automakers’ new vehicles need to travel on a gallon of gasoline, set under former President Joe Biden.\nThe Trump administration said the rules, known…",
    "link": "https://biztoc.com/x/957bb3cf42bcd0b6",
    "timestamp": "2025-12-05T20:47:14Z"
  },
  {
    "title": "Xenophobia runs the world",
    "description": "From Washington to Copenhagen and Pretoria, blaming migrants has become the easiest governing strategy of our time.",
    "link": "https://www.aljazeera.com/opinions/2025/12/5/xenophobia-runs-the-world",
    "timestamp": "2025-12-05T20:46:52Z"
  },
  {
    "title": "Experts say Trump wrong that less gas mileage rules means cheaper cars",
    "description": "Experts say cutting mileage standards is unlikely to lead to cheaper cars anytime soon.",
    "link": "https://www.twincities.com/2025/12/05/trump-gas-mileage-fact-check/",
    "timestamp": "2025-12-05T20:44:50Z"
  },
  {
    "title": "White House Shares Holiday Card Featuring 'Daddy' Trump",
    "description": "White House Shares Holiday Card Featuring 'Daddy' Trumplittlethings.com",
    "link": "https://littlethings.com/entertainment/trump-daddy-white-house-holiday-card",
    "timestamp": "2025-12-05T20:43:39Z"
  },
  {
    "title": "Supreme Court’s decision on birthright citizenship will depend on its interpretation of one key phrase",
    "description": "Advocates for each side will provide a different explanation for who falls under ‘the jurisdiction’ of the United States.",
    "link": "https://theconversation.com/supreme-courts-decision-on-birthright-citizenship-will-depend-on-its-interpretation-of-one-key-phrase-271064",
    "timestamp": "2025-12-05T20:43:34Z"
  },
  {
    "title": "The Supreme Court’s decision on birthright citizenship will depend on its interpretation of one phrase",
    "description": "Advocates for each side will provide a different explanation for who falls under ‘the jurisdiction’ of the United States.",
    "link": "https://theconversation.com/the-supreme-courts-decision-on-birthright-citizenship-will-depend-on-its-interpretation-of-one-phrase-271064",
    "timestamp": "2025-12-05T20:43:34Z"
  },
  {
    "title": "Supreme Court’s decision on birthright citizenship will depend on its interpretation of one phrase",
    "description": "Advocates for each side will provide a different explanation for who falls under ‘the jurisdiction’ of the United States.",
    "link": "https://theconversation.com/supreme-courts-decision-on-birthright-citizenship-will-depend-on-its-interpretation-of-one-phrase-271064",
    "timestamp": "2025-12-05T20:43:34Z"
  },
  {
    "title": "World Cup draw: USA to open vs. Paraguay; Mbappe, Haaland share group",
    "description": "The United States Men's National Team will face Paraguay in their opening match of the 2026 FIFA World Cup, the tournament draw revealed Friday.",
    "link": "https://www.upi.com/Sports_News/Soccer/2025/12/05/usmnt-world-cup-draw-Paraguay-Haaland-Mbappe/8921764949837/",
    "timestamp": "2025-12-05T20:42:14Z"
  },
  {
    "title": "Can Mike Johnson keep his job?",
    "description": "GOP women come after the House leader",
    "link": "https://theweek.com/politics/speaker-mike-johnson-keep-job-house-gop-women",
    "timestamp": "2025-12-05T20:42:08Z"
  },
  {
    "title": "The regulatory path ahead for a Netflix and Warner Bros. deal could get dicey",
    "description": "Regulatory questions are already rising about Netflix's deal to combine its business with WBD's streaming service HBO Max and film studio Warner Bros.",
    "link": "https://www.cnbc.com/2025/12/05/netflix-warner-bros-deal-regulatory-questions.html",
    "timestamp": "2025-12-05T20:41:56Z"
  },
  {
    "title": "Congress melts down: Members unleash personal attacks after weeks of shutdown drama",
    "description": "Congress prioritizes personal attacks over legislating as lawmakers target colleagues with censure efforts, creating dysfunction on Capitol Hill.",
    "link": "https://www.foxnews.com/politics/congress-melts-down-members-unleash-personal-attacks-after-weeks-shutdown-drama",
    "timestamp": "2025-12-05T20:41:29Z"
  },
  {
    "title": "Mexico and SAfrica open another World Cup; French, English deja vu",
    "description": "Mexico will play South Africa in the opening match of the 2026 World Cup on June 11 in Mexico City, 16 years after they also contested the 2010 tournament opener in South Africa. Title holders Argentina start against Algeria, and France won't want to be surpr…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:251205-99-843421/",
    "timestamp": "2025-12-05T20:40:22Z"
  },
  {
    "title": "FIFA World Cup 2026 draw: Groups, teams, format, Trump, peace prize",
    "description": "Mexico will open the World Cup against South Africa, while holders Argentina will face Algeria in their first game.",
    "link": "https://www.aljazeera.com/sports/2025/12/5/fifa-world-cup-2026-draw-groups-teams-format-trump-peace-prize",
    "timestamp": "2025-12-05T20:40:09Z"
  },
  {
    "title": "FACT FOCUS: Trump said weaker gas mileage rules will mean cheaper cars. Experts say don’t bet on it",
    "description": "Experts say cutting mileage standards is unlikely to lead to cheaper cars anytime soon.",
    "link": "https://www.bostonherald.com/2025/12/05/trump-gas-mileage-fact-check/",
    "timestamp": "2025-12-05T20:39:59Z"
  },
  {
    "title": "Trump awarded first-ever FIFA Peace Prize at World Cup final draw",
    "description": "President Donald Trump was awarded the very first FIFA Peace Prize on Friday at the Kennedy Center in Washington, D.C., during the World Cup final draw. FIFA President Gianni Infantino gave Trump the award, which included a trophy of golden hands holding a so…",
    "link": "https://freerepublic.com/focus/f-chat/4356118/posts",
    "timestamp": "2025-12-05T20:38:01Z"
  },
  {
    "title": "Warner Bros. Accepts Netflix's $83 Billion Bid, but Antitrust Threats Still Loom",
    "description": "If antitrust regulators allow the deal to go through, consumers stand to benefit from a less expensive Netflix–HBO Max bundle.",
    "link": "https://reason.com/2025/12/05/warner-bros-accepts-netflixs-83-billion-bid-but-antitrust-threats-still-loom/",
    "timestamp": "2025-12-05T20:36:58Z"
  },
  {
    "title": "JUST IN: Vanity Fair Bids Farewell to Olivia Nuzzi, ‘Agreed to Part Ways’ — Report",
    "description": "Vanity Fair will let Olivia Nuzzi's contract expire without renewal after a series of scandalous accusations and a bumpy book launch, The Wall Street Journal reported Friday. \nThe post JUST IN: Vanity Fair Bids Farewell to Olivia Nuzzi, ‘Agreed to Part Ways’ …",
    "link": "https://www.mediaite.com/media/just-in-vanity-fair-bids-farewell-to-olivia-nuzzi-agreed-to-part-ways-report/",
    "timestamp": "2025-12-05T20:36:50Z"
  },
  {
    "title": "FIFA World Cup 2026 draw results: See all 12 groups of teams, possible matchups at Gillette Stadium",
    "description": "Forty-eight countries, the largest number in the history of the tournament, will compete this summer.",
    "link": "https://sports.yahoo.com/articles/fifa-world-cup-2026-draw-203532389.html",
    "timestamp": "2025-12-05T20:35:32Z"
  },
  {
    "title": "Outgoing NYC mayor bans anti-Israel boycotts ahead of Muslim successor",
    "description": "Outgoing NYC mayor Eric Adams has issued executive orders against divestment from Israel before Zohran Mamdani takes office Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629093-outgoing-nyc-mayor-adams-bans-anti-israel-boycotts/",
    "timestamp": "2025-12-05T20:32:44Z"
  },
  {
    "title": "Why Netflix buying Warner Bros. is an apocalyptic disaster for movie fans",
    "description": "Netflix will use this consolidated power to gut movie theaters, eliminate access to physical media, homogenize TV, and generally make me miserable.",
    "link": "https://www.makeuseof.com/why-netflix-warner-bros-discovery-deal-apocalyptic-disaster-movie-fans/",
    "timestamp": "2025-12-05T20:29:58Z"
  },
  {
    "title": "Trump DOJ hammered by judges for 'thumbing their noses at the courts'",
    "description": "Three judges this week slammed President Donald Trump's Justice Department for keeping Lindsey Halligan's name on court documents. A district court judge and two magistrate judges in Alexandria, Virginia, said in an open court to prosecutors that they didn't …",
    "link": "https://www.rawstory.com/lindsey-halligan-2674373850/",
    "timestamp": "2025-12-05T20:29:30Z"
  },
  {
    "title": "Here's What Happened Today: Friday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-december-friday-6895180-Dec2025/",
    "timestamp": "2025-12-05T20:29:07Z"
  },
  {
    "title": "Supreme Court Will Hear Trump Birthright Citizenship Case",
    "description": "Supreme Court Will Hear Trump Birthright Citizenship Case\n \nAuthored by Matthew Vadum via The Epoch Times (emphasis ours),\nThe U.S. Supreme Court decided on Dec. 5 to review whether President Donald Trump’s executive order ending birthright citizenship is con…",
    "link": "https://biztoc.com/x/1567729bc9ae45a0",
    "timestamp": "2025-12-05T20:25:08Z"
  },
  {
    "title": "US judge clears Justice Department to release Epstein grand jury transcripts",
    "description": "NEW YORK, Dec 5 (Reuters) - A Florida federal judge on Friday cleared the Justice Department to release grand jury transcripts from its sex trafficking case against Jeffrey Epstein, which could shed light on the deceased financier's ties to rich and powerful …",
    "link": "https://www.thestar.com.my/news/world/2025/12/06/us-judge-clears-justice-department-to-release-epstein-grand-jury-transcripts",
    "timestamp": "2025-12-05T20:25:00Z"
  },
  {
    "title": "Netflix’s Warner Bros. acquisition sparks backlash",
    "description": "Netflix faced fierce criticism on Friday over its blockbuster deal to acquire Warner Bros., the storied Hollywood studio. The streaming giant is already viewed as a pariah in some Hollywood circles, largely due to its reluctance to release content in theaters…",
    "link": "https://www.digitaljournal.com/world/netflixs-warner-bros-acquisition-sparks-backlash/article",
    "timestamp": "2025-12-05T20:22:20Z"
  },
  {
    "title": "2026 World Cup groups are set: here's what's in store for Canada, Mexico, and the USA",
    "description": "The FIFA World Cup draw at the Kennedy Center in Washington, D.C., divided a record 48 teams into 12 groups of four. Six spots won&apos;t be determined until March, when 22 teams w",
    "link": "https://www.marca.com/en/world-cup/2025/12/05/69333e52ca4741ef168b45b9.html",
    "timestamp": "2025-12-05T20:21:34Z"
  },
  {
    "title": "Five key takeaways from Trump’s National Security Strategy",
    "description": "Government document on US foreign policy priorities says Washington no longer needs to prioritise the Middle East.",
    "link": "https://www.aljazeera.com/news/2025/12/5/five-key-takeaways-from-trumps-national-security",
    "timestamp": "2025-12-05T20:21:06Z"
  },
  {
    "title": "BREAKING: Supreme Court Takes Trump Birthright Citizenship Case",
    "description": "The Supreme Court has agreed to hear arguments on President Donald Trump’s push to end birthright citizenship. The high court announced Friday that it will... Read More\nThe post BREAKING: Supreme Court Takes Trump Birthright Citizenship Case appeared first on…",
    "link": "https://www.dailysignal.com/2025/12/05/supreme-court-takes-trump-birthright-citizenship-case/",
    "timestamp": "2025-12-05T20:21:05Z"
  },
  {
    "title": "Pipe bomb suspect confesses and has expressed support for Trump, sources say (Ken Dilanian/MS NOW)",
    "description": "Ken Dilanian / MS NOW:\nPipe bomb suspect confesses and has expressed support for Trump, sources say  —  The man charged with planting pipe bombs outside Republican and Democratic national party headquarters before the Jan. 6 Capitol riots told the FBI he supp…",
    "link": "https://www.memeorandum.com/251205/p95",
    "timestamp": "2025-12-05T20:20:01Z"
  },
  {
    "title": "Trump Draws United States at FIFA World Cup Draw: 'This Is Shocking'",
    "description": "President Donald Trump drew the United States in a ceremonial portion of the FIFA World Cup draw at the Kennedy Center, joking, \"This is shocking\" after Mexican President Claudia Sheinbaum and Canadian Prime Minister Mark Carney drew their respective countrie…",
    "link": "https://www.breitbart.com/sports/2025/12/05/trump-draws-united-states-at-fifa-world-cup-draw-this-is-shocking/",
    "timestamp": "2025-12-05T20:19:38Z"
  },
  {
    "title": "Is Trump’s FIFA Peace Prize decision influenced by Myanmar’s 'crony’ tycoon Zaw Zaw, accused of 'extrajudicial killings'?",
    "description": "Donald Trump received the inaugural FIFA Peace Prize on December 5, an award created just a month prior. The decision, lacking transparency and a public selection process, has drawn scrutiny. Questions arose regarding the prize's legitimacy, especially with M…",
    "link": "https://economictimes.indiatimes.com/news/international/us/fifa-peace-prize-why-donald-trump-was-chosen-as-the-first-ever-recipient/articleshow/125795599.cms",
    "timestamp": "2025-12-05T20:19:19Z"
  },
  {
    "title": "FIFA World Cup 2026 Draw: Argentina, Brazil To Portugal, Spain - Check All Groups",
    "description": "Brazil has been placed in a so-called \"group of death\" with Morocco and Scotland, while Spain vs Uruguay and England vs Croatia will be some of the big matches to look forward to in the group stages of FIFA World Cup 2026. The FIFA World Cup 2026 will begin o…",
    "link": "https://www.ndtvprofit.com/sports/fifa-world-cup-2026-draw-brazil-argentina-to-portugal-spain-check-all-groups",
    "timestamp": "2025-12-05T20:18:51Z"
  },
  {
    "title": "What you need to know about Netflix’s $72 billion bet on the future of entertainment | CNN Business",
    "description": "This is a David and Goliath story – with a twist. Almost exactly 15 years ago today the owner of Warner Bros. and HBO pushed back on Hollywood and Wall Street hype about a streaming upstart named Netflix.",
    "link": "https://www.cnn.com/2025/12/05/business/netflix-hollywood-bet-faq",
    "timestamp": "2025-12-05T20:16:37Z"
  },
  {
    "title": "Conservative warns GOP majorities are about to 'wash away'",
    "description": "A well-known conservative commentator has a warning for the Republican Party: take action now or face a repeat of the 2018 midterms when the GOP lost 41 House seats in a landslide. And this time, he says, the Senate could go to the Democrats as well.Award-win…",
    "link": "https://www.rawstory.com/alternet-posts/conservative-blue-wave-gop/",
    "timestamp": "2025-12-05T20:16:11Z"
  },
  {
    "title": "HasanAbi slams Asmongold for “unrestrained racism” toward Ilhan Omar",
    "description": "Twitch streamer HasanAbi has strongly condemned fellow streamer Asmongold's recent remarks targeting Congresswoman Ilhan Omar and immigrant communities, labeling them as \"unfiltered racism.\" HasanAbi argued Asmongold's comments, which included xenophobic gene…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/hasanabi-slams-asmongold-for-unrestrained-racism-toward-ilhan-omar/articleshow/125795617.cms",
    "timestamp": "2025-12-05T20:15:22Z"
  },
  {
    "title": "‘We have nothing to hide’: Records of Jeffrey Epstein cases cleared for release",
    "description": "Judge issues order after Congress specifically authorizes information to be made public",
    "link": "https://www.wnd.com/2025/12/we-have-nothing-hide-records-jeffrey-epstein-cases/",
    "timestamp": "2025-12-05T20:14:32Z"
  },
  {
    "title": "2nd Russian nuclear plant on the cards",
    "description": "India and Russia are set to significantly boost nuclear energy collaboration following President Putin's visit. Discussions focused on constructing a second Russian-designed nuclear power plant, with India committed to finalizing site allocation. The agreemen…",
    "link": "https://timesofindia.indiatimes.com/india/2nd-russian-nuclear-plant-on-the-cards/articleshow/125795604.cms",
    "timestamp": "2025-12-05T20:14:13Z"
  },
  {
    "title": "Trump takes the spotlight, Peace Prize at FIFA World Cup Draw",
    "description": "Donald Trump was centre stage accepting the first-ever FIFA Peace Prize.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/5/trump-takes-the-spotlight-peace-prize-at-fifa-world-cup-draw",
    "timestamp": "2025-12-05T20:13:28Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "Typhoons in South and South-East Asia have had a devastating impact on children’s education. The United Nations Children’s Fund (UNICEF) reports that since late November, more than 4.1 million children in Viet Nam, Philippines, Indonesia, Thailand and Malaysi…",
    "link": "https://press.un.org/en/2025/db251205.doc.htm",
    "timestamp": "2025-12-05T20:13:25Z"
  },
  {
    "title": "Trump awarded new FIFA peace prize - PBS",
    "description": "Trump awarded new FIFA peace prizePBS FIFA’s Leader Often Flatters Trump. Now, He’s Awarded Him a Peace Prize.The New York Times President Donald Trump wins the inaugural FIFA Peace PrizeCNN Live updates: Supreme Court agrees to hear birthright citizenship ar…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180300059",
    "timestamp": "2025-12-05T20:13:18Z"
  },
  {
    "title": "Trump's security strategy slams European allies and asserts U.S. power in the Americas - NPR",
    "description": "Trump's security strategy slams European allies and asserts U.S. power in the AmericasNPR Trump Administration Says Europe Faces ‘Civilizational Erasure’The New York Times America has a new clash of civilizations — with European liberalsVox Donald Trump’s ble…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180300049",
    "timestamp": "2025-12-05T20:12:57Z"
  },
  {
    "title": "Canadians are travelling more, with one notable exception",
    "description": "Data from Statistics Canada finds fewer Canadians are visiting the U.S., but other domestic and international destinations are more than picking up the slack",
    "link": "https://nationalpost.com/news/canada/canadians-travelling-more-us-international",
    "timestamp": "2025-12-05T20:12:00Z"
  },
  {
    "title": "Trump rewrites national security playbook as mass migration overtakes terrorism as top US threat",
    "description": "Trump administration releases new national security strategy shifting focus from Middle East terrorism to Western Hemisphere threats and border security.",
    "link": "https://www.foxnews.com/politics/trump-rewrites-national-security-playbook-mass-migration-overtakes-terrorism-top-us-threat",
    "timestamp": "2025-12-05T20:10:28Z"
  },
  {
    "title": "Supreme Court to rule on Trump’s bid to end birthright citizenship",
    "description": "The Supreme Court will decide the constitutionality of Trump’s plan to end automatic birthright citizenship for children of non-citizens born in the U.S.\n\nRead More: https://punchng.com/supreme-court-to-rule-on-trumps-bid-to-end-birthright-citizenship/",
    "link": "https://punchng.com/supreme-court-to-rule-on-trumps-bid-to-end-birthright-citizenship/",
    "timestamp": "2025-12-05T20:08:28Z"
  },
  {
    "title": "Florida congressional Republicans tell Trump to keep oil drilling off state's coasts",
    "description": "Florida’s Republican-dominated congressional delegation is urging the Trump administration to drop a plan that would allow new oil drilling off the state’s coast.",
    "link": "https://www.clickorlando.com/business/2025/12/05/florida-congressional-republicans-tell-trump-to-keep-oil-drilling-off-states-coasts/",
    "timestamp": "2025-12-05T20:08:24Z"
  },
  {
    "title": "ICE says agents have arrested 12 people in Minneapolis as part of immigration operation",
    "description": "Of those, six are Mexican nationals, five are from Somalia and one is from El Salvador.",
    "link": "https://www.bostonherald.com/2025/12/05/ice-says-agents-have-arrested-12-people-in-minneapolis-as-part-of-immigration-operation/",
    "timestamp": "2025-12-05T20:08:17Z"
  },
  {
    "title": "Big ramifications loom as Supreme Court takes up major Trump case",
    "description": "The U.S. Supreme Court is officially taking up a review of whether President Donald Trump's executive order abolishing birthright citizenship is constitutional, Axios reported Friday.The Fourteenth Amendment to the Constitution guarantees a right to citizensh…",
    "link": "https://www.rawstory.com/supreme-court-2674373804/",
    "timestamp": "2025-12-05T20:07:05Z"
  },
  {
    "title": "Trump Administration Launches 'One Dollar, One Tree' Effort to Save Americans Money During Holidays",
    "description": "President Donald Trump's administration has launched an effort to save Americans money during the Christmas and holiday season.\nThe post Trump Administration Launches ‘One Dollar, One Tree’ Effort to Save Americans Money During Holidays appeared first on Brei…",
    "link": "https://www.breitbart.com/economy/2025/12/05/trump-administration-launches-one-dollar-one-tree-effort-save-americans-money-holidays/",
    "timestamp": "2025-12-05T20:05:47Z"
  },
  {
    "title": "Dan Bongino On His Past Pipe Bomb Conspiracy Theories: ‘I Was Paid For My Opinions’",
    "description": "The arrest of a Jan. 6 pipe bomb suspect blows up a right-wing conspiracy theory espoused by many in the MAGAverse.",
    "link": "https://www.huffpost.com/entry/dan-bongino-pipe-bomb-opinion-hannity_n_69332fe9e4b03cea5ab42fdd",
    "timestamp": "2025-12-05T20:04:15Z"
  }
]