[
  {
    "title": "U.S. Stock Market today: S&P 500, Dow Jones, Nasdaq to open in green. Top 3 stocks to focus after Venezuela leader Nicolas Maduro capture",
    "description": "U.S. Stock Market predictions: Share prices of Chevron Corp, ConocoPhillips, Exxon Mobil Corp. rose in the pre-market trading.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-sp-500-dow-jones-nasdaq-chevron-exxon-mobil-conocophillips-share-prices-venezuela-nicolas-maduro/articleshow/126352338.cms",
    "timestamp": "2026-01-05T11:43:04Z"
  },
  {
    "title": "Americans Are Increasingly Skeptical of Foreign Military Intervention",
    "description": "Nicolás Maduro’s removal should be welcomed by anyone who values liberty. Yet data show Americans—led by the youngest adults—are turning noninterventionist.",
    "link": "https://reason.com/2026/01/05/americans-are-increasingly-skeptical-of-foreign-military-intervention/",
    "timestamp": "2026-01-05T11:41:34Z"
  },
  {
    "title": "US president says Colombia raid ‘sounds good’ after Venezuela attack",
    "description": "Trump signals possible military action against Colombia following Saturday’s raid on Venezuela Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630588-trump-colombia-venezuela-attack/",
    "timestamp": "2026-01-05T11:41:01Z"
  },
  {
    "title": "President Trump issues severe warning to ‘very sick’ Colombia after daring capture of Venezuelan dictator",
    "description": "President Trump threatened military action against Colombia and its “sick” leader after this weekend’s daring capture of dictator Nicolás Maduro in Venezuela — whose acting president has since offered to work with the US in a stunning about-face.",
    "link": "https://nypost.com/2026/01/05/us-news/president-trump-issues-severe-warning-to-very-sick-colombia-after-daring-capture-of-venezuelan-dictator/",
    "timestamp": "2026-01-05T11:37:47Z"
  },
  {
    "title": "Joly presses Lockheed for jobs as crucial F-35 decision nears",
    "description": "Melanie Joly is planning to meet with executives at Lockheed Martin to to leverage more jobs out of its fighter jet deal. Read more.",
    "link": "https://financialpost.com/news/canada-joly-lockheed-jobs-f-35-decision",
    "timestamp": "2026-01-05T11:35:13Z"
  },
  {
    "title": "Canada’s Joly Presses Lockheed for Jobs as Crucial F-35 Decision Nears",
    "description": "Canada’s industry minister is planning to meet with executives at Lockheed Martin Corp. soon to try to leverage more jobs out of a multibillion-dollar deal to acquire fighter jets.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-joly-presses-lockheed-for-jobs-as-crucial-f-35-decision-nears",
    "timestamp": "2026-01-05T11:35:13Z"
  },
  {
    "title": "Dollar Gains, Peso Falls as Maduro Exit Fuels Geopolitical Risks",
    "description": "The dollar hit its strongest level in two weeks after the US capture of Venezuela’s President Nicolás Maduro, while Mexico’s peso retreated amid the rising geopolitical tensions.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-gains-peso-falls-as-maduro-exit-fuels-geopolitical-risks",
    "timestamp": "2026-01-05T11:35:00Z"
  },
  {
    "title": "Denmark and France condemn US as Trump insists 'we need Greenland' for security",
    "description": "Trump’s military actions in Venezuela have reignited fears that the US will annex Greenland.",
    "link": "https://www.thejournal.ie/greenland-trump-venezuela-6918491-Jan2026/",
    "timestamp": "2026-01-05T11:33:48Z"
  },
  {
    "title": "Trump's MAGA Inc. Amasses Over $300 Million In Funds— This AI Startup Co-Founder Is The Top Donor",
    "description": "In a recent disclosure, a super Political Action Committee (PAC) aligned with President Donald Trump has amassed a significant amount of over $304 million, a move that could majorly influence the upcoming midterm elections.\nTech And Wall Street Fuel MAGA Inc.…",
    "link": "https://biztoc.com/x/d69351329c750879",
    "timestamp": "2026-01-05T11:32:19Z"
  },
  {
    "title": "India ‘Could Face Higher Tariffs if Russian Oil Buying Continues’",
    "description": "The Indian government’s push for a trade deal with the US is facing pressure, with US President Donald Trump warning that he could raise tariffs further if New Delhi does not meet his call to curb purchases of Russian oil.\nTalks between the two countries rema…",
    "link": "https://biztoc.com/x/f31fce661a737994",
    "timestamp": "2026-01-05T11:32:15Z"
  },
  {
    "title": "What are the charges against Venezuela's Nicolas Maduro?",
    "description": "Here is a recap of the ​indictment unsealed on Saturday against Maduro, his wife, his son, and other co-defendants.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-are-the-charges-against-venezuelas-nicolas-maduro/articleshow/126352184.cms",
    "timestamp": "2026-01-05T11:32:10Z"
  },
  {
    "title": "Marjorie Taylor Greene’s requiem for MAGA",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., holds a \"Make America Great Again\" hat during a news conference outside the US Capitol. | Bill Clark/CQ-Roll Call, Inc via Getty Images \nKey takeaways\nThe polemical politician is leaving Congress on January 5 after her disa…",
    "link": "https://biztoc.com/x/633e2c5082db8077",
    "timestamp": "2026-01-05T11:32:03Z"
  },
  {
    "title": "Trump Administration Puts Off Planned Tariff Doubling on Cabinets, Furniture Until 2027",
    "description": "The Trump administration delayed planned tariff hikes on imported cabinets and furniture, keeping rates at 25% until 2027 amid trade talks.",
    "link": "https://www.ibtimes.com/trump-administration-puts-off-planned-tariff-doubling-cabinets-furniture-until-2027-3794310",
    "timestamp": "2026-01-05T11:31:48Z"
  },
  {
    "title": "Minnesota day care hoax is fueled by MAGA psychosexual weirdness",
    "description": "The racism underlying MAGA's latest obsession is intertwined with misogyny",
    "link": "https://www.salon.com/2026/01/05/minnesota-day-care-hoax-is-fueled-by-maga-psychosexual-weirdness/",
    "timestamp": "2026-01-05T11:30:56Z"
  },
  {
    "title": "Cuba Reports 32 Citizens Killed Protecting Maduro in US Venezuela Raid",
    "description": "Cuba announced 32 citizens were killed during the US military raid to capture Venezuela's Nicolas Maduro, declaring two days of national mourning.",
    "link": "https://www.ibtimes.com/cuba-reports-32-citizens-killed-protecting-maduro-us-venezuela-raid-3794314",
    "timestamp": "2026-01-05T11:30:44Z"
  },
  {
    "title": "Denmark Prime Minister Tells the US It Has 'No Right to Annex' Any of Its Three Countries",
    "description": "Kingdom of Denmark's Prime Minister Mette Frederiksen sternly addressed the US' threat to take control of one of its three countries, Greenland.",
    "link": "https://www.ibtimes.com/denmark-prime-minister-tells-us-it-has-no-right-annex-any-its-three-countries-3794315",
    "timestamp": "2026-01-05T11:30:25Z"
  },
  {
    "title": "Trump Factor Looms as Starlink Offers Free Internet to Venezuela Amid Power Blackouts",
    "description": "US President Donald Trump launches military operation to capture Venezuelan President Nicolás Maduro, et. al.; Starlink offers free internet to outage-affected citizens.",
    "link": "https://www.ibtimes.com/trump-factor-looms-starlink-offers-free-internet-venezuela-amid-power-blackouts-3794321",
    "timestamp": "2026-01-05T11:29:14Z"
  },
  {
    "title": "Donald Trump Health Concerns: POTUS Allegedly Forgets His Meds, Slurs During Venezuela Speech",
    "description": "Donald Trump is once again plagued with health concerns following his recent speech at Mar-a-Lago after the arrest of Venezuela's President Maduro.",
    "link": "https://www.ibtimes.com/donald-trump-health-concerns-potus-allegedly-forgets-his-meds-slurs-during-venezuela-speech-3794325",
    "timestamp": "2026-01-05T11:28:40Z"
  },
  {
    "title": "German minister: protection of Greenland will be discussed within NATO if needed",
    "description": "LONDON, Jan 5 (Reuters) - ‌German Foreign Minister Johann Wadephul said on Monday ‌that Greenland belonged to Denmark and that the ‌NATO alliance could discuss strengthening its protection if necessary. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/german-minister-protection-of-greenland-will-be-discussed-within-nato-if-needed",
    "timestamp": "2026-01-05T11:28:00Z"
  },
  {
    "title": "Wall Street cheers the prospect of conflict in Venezuela and Greenland",
    "description": "Counterintuitively, the capture of Maduro will not have much of an effect on the price of oil—at least in the short term.",
    "link": "https://fortune.com/2026/01/05/stocks-wall-street-venezuela-greenland/",
    "timestamp": "2026-01-05T11:27:18Z"
  },
  {
    "title": "Is Venezuela Really Rejoicing? Nick Shirley Mocked for Passing Off Miami Vid as Locals After Nicolás Maduro Capture",
    "description": "Independent journalist Nick Shirley faces backlash for claiming a Miami video showed Venezuelans celebrating Nicolás Maduro's capture after Trump's announcement—exiles, not locals.",
    "link": "https://www.ibtimes.com/venezuela-really-rejoicing-nick-shirley-mocked-passing-off-miami-vid-locals-after-nicolas-3794331",
    "timestamp": "2026-01-05T11:27:14Z"
  },
  {
    "title": "Denmark Criticises Trump Aide Spouse's Post of Greenland Following Venezuela Strikes",
    "description": "The Danish ambassador and Greenland's Prime Minister criticised the post made by the wife of top Trump aide Stephen Miller as Washington under Trump once again suggests annexation.",
    "link": "https://www.ibtimes.com/denmark-criticises-trump-aide-spouses-post-greenland-following-venezuela-strikes-3794332",
    "timestamp": "2026-01-05T11:26:58Z"
  },
  {
    "title": "'Completely Illegal': Martina Navratilova Calls Trump 'Absolutely Insane' for US Attack on Venezuela",
    "description": "Martina Navratilova slams Donald Trump's 'absolutely insane' and 'illegal' attack on Venezuela, while George Stephanopoulos challenges Marco Rubio over the legitimacy of the US military intervention.",
    "link": "https://www.ibtimes.com/completely-illegal-martina-navratilova-calls-trump-absolutely-insane-us-attack-venezuela-3794334",
    "timestamp": "2026-01-05T11:26:45Z"
  },
  {
    "title": "Trump Declares Cuba Is ‘Ready to Fall’ After Capture of Venezuela’s Maduro: ‘It’s Going Down for the Count’",
    "description": "The president warned Cuba can no longer rely on Venezuela for oil, money or security.\nThe post Trump Declares Cuba Is ‘Ready to Fall’ After Capture of Venezuela’s Maduro: ‘It’s Going Down for the Count’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-declares-cuba-is-ready-to-fall-after-capture-of-venezuelas-maduro-its-going-down-for-the-count/",
    "timestamp": "2026-01-05T11:26:24Z"
  },
  {
    "title": "Trump Savaged by Brutal IQ Jab as Critics Say Even a Toddler Might Outthink Him",
    "description": "Legendary sportswriter Rick Reilly lashes out at Donald Trump's golfing claims, suggesting even a toddler could outthink the former president, amid viral footage and long-standing controversy.",
    "link": "https://www.ibtimes.com/trump-savaged-brutal-iq-jab-critics-say-even-toddler-might-outthink-him-3794337",
    "timestamp": "2026-01-05T11:26:13Z"
  },
  {
    "title": "Forecasters say 2026 will be the cheapest year for gas since Covid | CNN Business",
    "description": "The gas pump has emerged as a rare source of relief for Americans drowning in higher prices – and that positive trend is expected to continue in 2026.",
    "link": "https://www.cnn.com/2026/01/05/business/2026-gas-prices-oil",
    "timestamp": "2026-01-05T11:25:55Z"
  },
  {
    "title": "NYC Mayor Zohran Mamdani's Allies in DSA Push Trump for Maduro's Release",
    "description": "New York City Mayor Zohran Mamdani called President Trump to oppose Maduro's capture whilst his Democratic Socialists of America allies demand the Venezuelan leader's return",
    "link": "https://www.ibtimes.com/nyc-mayor-zohran-mamdanis-allies-dsa-push-trump-maduros-release-3794340",
    "timestamp": "2026-01-05T11:25:15Z"
  },
  {
    "title": "Trump Promised Oil Chiefs $1 Billion Deal for Their Wish List, Now Venezuela's Resources at Stake, Critics Say",
    "description": "US Congressman Dan Goldman claims Trump's Venezuela operation is a 'massive gift' to oil executives who donated $500 million after the president promised them favourable policies.",
    "link": "https://www.ibtimes.com/trump-promised-oil-chiefs-1-billion-deal-their-wish-list-now-venezuelas-resources-stake-3794342",
    "timestamp": "2026-01-05T11:24:58Z"
  },
  {
    "title": "Donald Trump And Elon Musk Reunited: Why Critics Claim Reconcilliation Is 'Kissing Trump's A--'",
    "description": "Trump and Musk stun social media with Mar-a-Lago reunion after $2.5T feud, as lip reader reveals the secret 'All good' moment ending their bitter public clash.",
    "link": "https://www.ibtimes.com/donald-trump-elon-musk-reunited-why-critics-claim-reconcilliation-kissing-trumps-3794344",
    "timestamp": "2026-01-05T11:24:43Z"
  },
  {
    "title": "How Maduro's 'No War' Moves Allegedly Triggered Trump's Most Explosive Venezuela Threat Yet",
    "description": "Analysis reveals how Maduro's peace messaging clashed with rising US pressure, leading to his capture and sparking debate over legality, motives, and geopolitical risks.",
    "link": "https://www.ibtimes.com/how-maduros-no-war-moves-allegedly-triggered-trumps-most-explosive-venezuela-threat-yet-3794349",
    "timestamp": "2026-01-05T11:23:16Z"
  },
  {
    "title": "Fury Explodes As Trump's Drug Crackdown Jails Maduro — but Pardons a Proven Trafficker",
    "description": "Trump's drug war escalation, jailing Venezuela's Maduro, while pardoning a trafficker, sparks global outrage and sharp questions on US policy consistency and the rule of law.",
    "link": "https://www.ibtimes.com/fury-explodes-trumps-drug-crackdown-jails-maduro-pardons-proven-trafficker-3794352",
    "timestamp": "2026-01-05T11:23:00Z"
  },
  {
    "title": "Who Is Delcy Rodriguez: The 'Tiger' Vice President Facing Trump's Warning of 'Do What's Right'",
    "description": "Delcy Rodriguez, 56, assumed Venezuela's interim presidency after Maduro's capture, but faces Trump's threats as she demands his release",
    "link": "https://www.ibtimes.com/who-delcy-rodriguez-tiger-vice-president-facing-trumps-warning-do-whats-right-3794355",
    "timestamp": "2026-01-05T11:22:38Z"
  },
  {
    "title": "Trump Ridiculed Over 'War Room' Detail As Team Monitors Maduro Operation on X",
    "description": "Donald Trump's Mar-a-Lago 'war room' photos spark global ridicule after eagle-eyed social media users spot an open X feed during the high-stakes 2026 capture of Nicolás Maduro.",
    "link": "https://www.ibtimes.com/trump-ridiculed-over-war-room-detail-team-monitors-maduro-operation-x-3794357",
    "timestamp": "2026-01-05T11:22:13Z"
  },
  {
    "title": "Trump flips Monroe into Donroe: How US plans to reshape the Western Hemisphere — explained",
    "description": "US President Donald Trump has revived and expanded the Monroe Doctrine, now dubbed the \"Donroe Doctrine,\" to assert American dominance across the Western Hemisphere. This aggressive approach has led to military action in Venezuela, threats against Cuba and Co…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-flips-monroe-into-donroe-how-us-plans-to-reshape-the-western-hemisphere-explained/articleshow/126351356.cms",
    "timestamp": "2026-01-05T11:22:02Z"
  },
  {
    "title": "Nicolas Maduro pleads 'innocent' in NYC as judge sets next court date",
    "description": "Venezuelan President Nicolas Maduro pleaded not guilty to all four charges against him on Monday. His wife, Cilia Flores, also pleaded not guilty to her three charges. Judge Alvin Hellerstein set their next court date for March 17.",
    "link": "https://www.foxnews.com/live-news/nicolas-maduro-indictment-monday-venezuela-january-5-2026",
    "timestamp": "2026-01-05T11:21:34Z"
  },
  {
    "title": "Map Shows Anti-Government Protests Spreading Across Iran",
    "description": "Protests across Iran have entered a second week, spreading to cities nationwide as public anger over economic hardship and political grievances continues to mount.\nThe unrest has drawn international attention after President Donald Trump warned Iran on Sunday…",
    "link": "https://biztoc.com/x/a9a069dbac1a711b",
    "timestamp": "2026-01-05T11:21:30Z"
  },
  {
    "title": "German minister: protection of Greenland will be discussed within NATO if needed",
    "description": "LONDON, Jan 5 (Reuters) - German Foreign Minister Johann Wadephul said on Monday that Greenland belonged to Denmark and that the NATO alliance could discuss ...",
    "link": "https://www.yahoo.com/news/articles/german-minister-protection-greenland-discussed-112127806.html",
    "timestamp": "2026-01-05T11:21:27Z"
  },
  {
    "title": "Wicked composer Stephen Schwartz cancels Kennedy Center gig over Trump renaming",
    "description": "Wicked composer Stephen Schwartz has cancelled his Kennedy Center appearance after the performing arts centre was renamed to honour US President Donald Trump. The 77-year-old Oscar and Grammy-award-winning composer is the latest artist to drop out of playing …",
    "link": "https://www.thepinknews.com/2026/01/05/wicked-composer-stephen-schwartz-cancels-kennedy-center-gig-over-trump-renaming/",
    "timestamp": "2026-01-05T11:21:15Z"
  },
  {
    "title": "Trump's Maduro raid broke international law, Scottish leader suggests - as PM says US must 'set out justifications'",
    "description": "Sir Keir Starmer has been reticent about questioning the legality of Donald Trump's raid on Venezuela but the Scottish first minister was more direct.",
    "link": "https://news.sky.com/story/trumps-maduro-raid-broke-international-law-scottish-leader-suggests-as-pm-says-us-must-set-out-justifications-13490694",
    "timestamp": "2026-01-05T11:21:00Z"
  },
  {
    "title": "U.S Venezuela move adds a little fuel to markets",
    "description": "The bold American move to snatch Venezuelan strongman Nicolas Maduro and his wife has given stock futures a boost in trading late Sunday. The gains came as...",
    "link": "https://www.thestreet.com/investing/u-s-venezuela-move-adds-a-little-fuel-to-markets",
    "timestamp": "2026-01-05T11:20:17Z"
  },
  {
    "title": "Read memo Amazon sent to employees stuck in India due to H-1B visa delay",
    "description": "Amazon is allowing tech workers stranded in India due to H-1B visa delays to work remotely until March 2026. However, severe restrictions ban coding, testing, strategic decisions, and customer interactions, leaving many unable to perform their core job functi…",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/read-memo-amazon-sent-to-employees-stuck-in-india-due-to-h-1b-visa-delay/articleshow/126351811.cms",
    "timestamp": "2026-01-05T11:17:58Z"
  },
  {
    "title": "Turkey to stress 'strategic priority' of Black Sea security at Ukraine meeting in Paris",
    "description": "ANKARA, Jan 5 (Reuters) - Turkey's foreign ‌minister will stress the \"strategic priority\" of maintaining security in the Black ‌Sea at a summit on Ukraine in Paris this week, a ‌Turkish Foreign Ministry source said on Monday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/turkey-to-stress-039strategic-priority039-of-black-sea-security-at-ukraine-meeting-in-paris",
    "timestamp": "2026-01-05T11:17:00Z"
  },
  {
    "title": "Dollar Gains, Peso Falls as Maduro Exit Fuels Geopolitical Risks",
    "description": "The Bloomberg Dollar Spot Index advanced as much as 0.3% to reach the highest since Dec. 22 as the greenback outperformed almost all major currencies.  The...",
    "link": "https://finance.yahoo.com/news/dollar-gains-peso-falls-maduro-111620329.html",
    "timestamp": "2026-01-05T11:16:20Z"
  },
  {
    "title": "Factbox: Venezuela's oil and mining sectors",
    "description": "The following are key facts about the oil and mining sectors of Venezuela, whose President Nicolas Maduro was captured by US forces on Saturday.",
    "link": "https://www.rte.ie/news/2026/0105/1551529-venezuela-oil-industry/",
    "timestamp": "2026-01-05T11:16:11Z"
  },
  {
    "title": "Maduro’s capture has a China fallout: A blow to its influence in the region, and a signal on Taiwan",
    "description": "China is Venezuela’s largest external economic partner, and a big consumer of its oil. Many Chinese investments are now in jeopardy, but the bigger question is whether the American action potentially emboldens Beijing to take over Taiwan.",
    "link": "https://indianexpress.com/article/explained/explained-global/maduro-venezuela-china-impact-taiwan-signal-10456533/",
    "timestamp": "2026-01-05T11:15:50Z"
  },
  {
    "title": "Maduro at troubled Brooklyn jail that once held Ghislaine Maxwell",
    "description": "Jan 5 (Reuters) - Days after being captured in a Caracas safe ‌house, ousted Venezuelan President Nicolas Maduro finds himself in a far less hospitable environment: a Brooklyn jail where he likely will be confined to a cell 23 hours a ‌day, conditions that Se…",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/maduro-at-troubled-brooklyn-jail-that-once-held-ghislaine-maxwell",
    "timestamp": "2026-01-05T11:15:00Z"
  },
  {
    "title": "Europe must unite or it’s ‘finished,’ Poland’s Tusk warns as Trump salivates over Greenland",
    "description": "“One for all, and all for one,” Polish prime minister urges as U.S. strikes Venezuela and threatens Greenland.",
    "link": "https://www.politico.eu/article/europe-must-unite-or-its-finished-poland-donald-tusk-warns-us-donald-trump-salivates-over-greenland/",
    "timestamp": "2026-01-05T11:14:22Z"
  },
  {
    "title": "Trump Sidelined Venezuela Opposition Leader Machado for ‘Ultimate Sin’ of Accepting Nobel Peace Prize: Report",
    "description": "The claims follow Trump’s public dismissal of Machado as a viable interim leader over the weekend following the capture of the country’s former leader Maduro.\nThe post Trump Sidelined Venezuela Opposition Leader Machado for ‘Ultimate Sin’ of Accepting Nobel P…",
    "link": "https://www.mediaite.com/media/news/trump-sidelined-venezuela-opposition-leader-machado-for-ultimate-sin-of-accepting-nobel-peace-prize-report/",
    "timestamp": "2026-01-05T11:14:09Z"
  },
  {
    "title": "Trump Says USA Will Rebuild Venezuela Oil Infrastructure",
    "description": "'We're going to get the oil flowing the way it should be', U.S. President Donald Trump said.",
    "link": "https://www.rigzone.com/news/trump_says_usa_will_rebuild_venezuela_oil_infrastructure-05-jan-2026-182682-article/",
    "timestamp": "2026-01-05T11:13:56Z"
  },
  {
    "title": "India's Got Talent 11 Winner: Amazing Apsaras lift the trophy; take home a car and a cash prize of Rs 10 lakh; Team says 'This is a dreamlike moment'",
    "description": "Kolkata's all-women dance troupe, Amazing Apsaras, has won India's Got Talent 11. The group received the winner's trophy, a car, and Rs 10 lakh. Sound of Souls x Gaurash and Hidden Fire Crew were the first and second runners-up respectively. The show featured…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/indias-got-talent-11-winner-amazing-apsaras-lift-the-trophy-take-home-a-car-and-a-cash-prize-of-rs-10-lakh-team-says-this-is-a-dreamlike-moment/articleshow/126351625.cms",
    "timestamp": "2026-01-05T11:11:32Z"
  },
  {
    "title": "Trump’s plan to ‘run’ Venezuela for its oil is already facing problems",
    "description": "Twenty years ago, the U.S. strained to defend against accusations that the Iraq War was about oil. Today, President Donald Trump openly admits the U.S. is willing to carry out regime change in Venezuela to secure privileged access to the country’s oil reserve…",
    "link": "https://biztoc.com/x/30f94aa812e18a1a",
    "timestamp": "2026-01-05T11:09:55Z"
  },
  {
    "title": "Donald Trump Says He Spoke to Oil Companies Before Venezuela Action",
    "description": "\"They want to go in so badly,\" Trump told reporters aboard Air Force One on Sunday.",
    "link": "https://biztoc.com/x/233a9dad0110dc7a",
    "timestamp": "2026-01-05T11:09:54Z"
  },
  {
    "title": "What are the charges against Venezuela's Nicolas Maduro?",
    "description": "Jan 5 (Reuters) - Nicolas Maduro, the president of Venezuela ‌captured in a U.S. military raid, faces criminal charges in Manhattan, where federal prosecutors have targeted him for years. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/what-are-the-charges-against-venezuela039s-nicolas-maduro",
    "timestamp": "2026-01-05T11:09:00Z"
  },
  {
    "title": "KMAT 2026 exam session 1 postponed to February 22, registration deadline extended: Details here",
    "description": "Kerala CEE has postponed the KMAT 2026 Session 1 MBA entrance exam to February 22, 2026, extending the registration deadline to February 5. This move aims to facilitate a smoother application process for aspiring MBA students across Kerala. Candidates are urg…",
    "link": "https://timesofindia.indiatimes.com/education/news/kmat-2026-exam-session-1-postponed-to-february-22-registration-deadline-extended-details-here/articleshow/126351657.cms",
    "timestamp": "2026-01-05T11:08:34Z"
  },
  {
    "title": "JAM 2026 admit card release postponed by IIT Bombay: When will it be out now?",
    "description": "IIT Bombay has postponed the release of the JAM 2026 admit card, originally slated for January 6. A new download date will be announced soon. Candidates must carry this crucial document to the exam center on February 15, 2026, for admission to postgraduate sc…",
    "link": "https://timesofindia.indiatimes.com/education/news/jam-2026-admit-card-release-postponed-by-iit-bombay-when-will-it-be-out-now/articleshow/126351501.cms",
    "timestamp": "2026-01-05T11:06:53Z"
  },
  {
    "title": "Dollar gains as traders look past Venezuela to flurry of US data",
    "description": "LONDON, Jan 5 : ‌The dollar started the first full trading week of 2026 by climbing to multi-week highs against a range of currencies after a weak December, with the main focus on this week's raft of key economic data.Traders were also keeping a watchful eye …",
    "link": "https://www.channelnewsasia.com/business/dollar-gains-traders-shake-venezuela-focus-us-data-flurry-5789441",
    "timestamp": "2026-01-05T11:05:23Z"
  },
  {
    "title": "Self-driving tech, AI take center stage at CES as automakers dial back EV plans",
    "description": "LAS VEGAS, Jan 5 : Autonomous ‌driving technology is expected to dominate the CES trade show in Las Vegas this week as investors bet that artificial intelligence will invigorate an industry beset by slow progress, high costs, safety incidents and regulatory s…",
    "link": "https://www.channelnewsasia.com/business/self-driving-tech-ai-take-center-stage-ces-automakers-dial-back-ev-plans-5810951",
    "timestamp": "2026-01-05T11:01:34Z"
  },
  {
    "title": "Captured Venezuelan dictator Maduro faces New York federal judge after dramatic palace raid",
    "description": "Dethroned Venezuelan dictator Nicolas Maduro faces arraignment in New York federal court Monday on drug trafficking charges after dramatic U.S. capture.",
    "link": "https://www.foxnews.com/us/captured-venezuelan-dictator-maduro-faces-new-york-federal-judge-after-dramatic-palace-raid",
    "timestamp": "2026-01-05T11:00:55Z"
  },
  {
    "title": "Minnesota fraud cases, explained: How hundreds of millions allegedly slipped through state programs",
    "description": "Minnesota grapples with alleged fraud across state programs under Gov. Tim Walz, targeting COVID-19 food programs, housing subsidies and day care services.",
    "link": "https://www.foxnews.com/politics/minnesota-fraud-cases-explained-how-hundreds-millions-allegedly-slipped-through-state-programs",
    "timestamp": "2026-01-05T11:00:44Z"
  },
  {
    "title": "Trump's Maduro takedown resets the global chessboard and reasserts American power",
    "description": "Trump's capture of Venezuelan leader Maduro resets global power dynamics, but the operation signals broader shifts in American foreign policy and hemispheric dominance.",
    "link": "https://www.foxnews.com/opinion/trumps-maduro-takedown-resets-global-chessboard-reasserts-american-power",
    "timestamp": "2026-01-05T11:00:37Z"
  },
  {
    "title": "Monday Miscellany, 1/5/26",
    "description": "Trump abducts the president of Venezuela. Denmark Postal Service ends delivery of letters. And on tariffs, both Trump and his critics were wrong.",
    "link": "https://www.patheos.com/blogs/geneveith/2026/01/monday-miscellany-1-5-26/",
    "timestamp": "2026-01-05T11:00:16Z"
  },
  {
    "title": "Israel shuts door on Turkey in Gaza as Trump praises Erdogan, plays down clash",
    "description": "Israel is blocking any Turkish military role in Gaza as President Donald Trump praises Turkey's president and works to manage rising tensions over Gaza, Syria and other issues in region.",
    "link": "https://www.foxnews.com/world/israel-shuts-door-turkey-gaza-trump-praises-erdogan-plays-down-clash",
    "timestamp": "2026-01-05T11:00:10Z"
  },
  {
    "title": "Ex-Chevron Chief Launches $2 Billion Push to Revive Venezuela's Oil Fields",
    "description": "The former chief of Latin American operations at U.S. supermajor Chevron is in discussions with investors to raise $2 billion to invest in opportunities in Venezuela, the executive, Ali Moshiri, told the Financial Times in an interview published on Monday.   …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Ex-Chevron-Chief-Launches-2-Billion-Push-to-Revive-Venezuelas-Oil-Fields.html",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene’s Big Breakup",
    "description": "The congresswoman split with President Donald Trump over the Epstein files, then she quit. Where will she go from here? Charles Bethea reports.",
    "link": "https://www.newyorker.com/magazine/2026/01/12/marjorie-taylor-greenes-big-breakup",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Donald Trump Isn’t Anti-War. He’s Anti-West.\nLearn the Difference.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_4da676bd-157b-48e3-a315-114eafc40890",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Donald Trump Isn’t Anti-War. He’s Anti-West.\nLearn the Difference.",
    "description": "Donald Trump’s successful infiltrations into the worlds of both real estate and politics have been constructed on a foundation of cons. One of the more important of these, in both 2016 and 2024, was the strange notion that he was some sort of “anti-war” candi…",
    "link": "https://newrepublic.com/article/204898/trump-venezuela-anti-west-war",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Trump Is Reviving a Disastrous, Forgotten Era in U.S. Foreign Policy",
    "description": "Announcing on Saturday the U.S. military incursion in Venezuela and the capture of its leader, President Donald Trump was characteristically blunt. After rattling off pretextual justifications for the raid—allusions to President Nicolás Maduro’s democratic il…",
    "link": "https://newrepublic.com/article/204894/trump-imperialism-reviving-disastrous-us-foreign-policy",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "A look ahead: 2026 U.S. midterms hinge on key races in Maine, North Carolina",
    "description": "Republicans presently control the White House and both chambers of Congress, but their majorities in both legislative chambers are narrow. | Credit: roibu/Shutterstock\n\nJan 5, 2026 / 06:00 am (CNA).\nKey elections in November 2026 could reshape the balance of …",
    "link": "https://www.catholicnewsagency.com/news/268873/a-look-ahead-2026-us-midterms-hinge-on-key-races-in-maine-north-carolina",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Arellano: In Trump's invasion of Venezuela, Marco Rubio is the biggest sellout of all",
    "description": "By pushing Trump to run rampant over Latin America, Rubio is setting into motion the same old song of U.S. meddling that ties his family and mine.",
    "link": "https://www.yahoo.com/news/articles/arellano-trumps-invasion-venezuela-marco-110000388.html",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "A Wealth Tax Is Not How You Soak the Rich",
    "description": "It thrills me to read that Peter Thiel and Larry Page may flee California if the state implements a one-time 5 percent wealth tax on billionaires. On fairness grounds, Thiel and Page have no case. If anything, the 2026 California Billionaire Tax Act is too ea…",
    "link": "https://newrepublic.com/article/204879/california-wealth-tax-not-soak-rich",
    "timestamp": "2026-01-05T11:00:00Z"
  },
  {
    "title": "Rupee falls for fourth straight day; ends 8 paise lower at 90.28 against US dollar",
    "description": "The Indian rupee fell for the fourth consecutive session, closing at 90.28 against the US dollar amid geopolitical tensions.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-for-fourth-straight-day-ends-8-paise-lower-at-9028-against-us-dollar/article70473754.ece",
    "timestamp": "2026-01-05T10:59:00Z"
  },
  {
    "title": "Trump Announces Major Victory In Venezuelan Drug War",
    "description": "By Tyler O'Neil, The Daily Signal | January 03, 2026\nPresident Donald Trump celebrated the capture of Nicolás Maduro in Venezuela, explaining how U.S. forces extradited the dictator and brought him to the U.S. to face narcoterrorism charges.\n“All Venezuelan m…",
    "link": "https://biztoc.com/x/340b82e043548eb3",
    "timestamp": "2026-01-05T10:58:41Z"
  },
  {
    "title": "Kazuma Okamoto net worth: A closer look at the earnings of Toronto Blue Jays' latest baseball infielder",
    "description": "Japanese baseball star Kazuma Okamoto has inked a significant four-year, $60 million deal with the Toronto Blue Jays, marking his MLB debut. The 29-year-old slugger, a former NPB standout, will earn an average of $15 million annually, placing him among the te…",
    "link": "https://timesofindia.indiatimes.com/sports/mlb/news/kazuma-okamoto-net-worth-a-closer-look-at-the-earnings-of-toronto-blue-jays-latest-baseball-infielder/articleshow/126351258.cms",
    "timestamp": "2026-01-05T10:57:49Z"
  },
  {
    "title": "Trump Allegedly Abducted Nicolás Maduro for Dancing Too Much",
    "description": "There were other reasons, but the New York Times reports his dance moves were the last straw.",
    "link": "https://www.jezebel.com/trump-allegedly-abducted-nicolas-maduro-for-dancing-too-much",
    "timestamp": "2026-01-05T10:57:47Z"
  },
  {
    "title": "Greenland says 'no more fantasies about annexation' after Trump remarks",
    "description": "COPENHAGEN, Jan 5 (Reuters) - ‌Greenland's leader declared \"enough is enough,\" and Denmark's allies in Europe affirmed that the ‌Arctic island's future must be determined by its people, rebuffing renewed remarks by ‌U.S. President Donald Trump about acquiring…",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/greenland-says-039no-more-fantasies-about-annexation039-after-trump-remarks",
    "timestamp": "2026-01-05T10:57:00Z"
  },
  {
    "title": "Why a Blue Wave May Be Harder This Year",
    "description": "“Democrats are celebrating signs that the tide is turning their way for the 2026 midterms. But translating dissatisfaction with President Donald Trump into an electoral tsunami, or even a wave election, will be much harder to achieve than in years past,” the …",
    "link": "https://politicalwire.com/2026/01/05/why-a-blue-wave-may-be-harder-this-year/",
    "timestamp": "2026-01-05T10:56:00Z"
  },
  {
    "title": "Venezuela crisis unlikely to have major impact on gold, silver and oil prices: Experts",
    "description": "Even if Venezuela were to completely lose its current production of about 950,000 barrels per day, the impact would be negligible in a global oil market that produces around 103 million barrels per day",
    "link": "https://www.thehindubusinessline.com/news/world/venezuela-crisis-unlikely-to-have-major-impact-on-gold-silver-and-oil-prices-experts/article70473640.ece",
    "timestamp": "2026-01-05T10:54:45Z"
  },
  {
    "title": "US capture of Maduro tests limits of China's diplomatic push - Reuters",
    "description": "US capture of Maduro tests limits of China's diplomatic pushReuters China decries U.S. action in Venezuela — even as it guards billions at stakeCNBC What is the US charging Nicolas Maduro with?Al Jazeera Donald Trump’s great Venezuelan oil gambleThe Economist…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180516983",
    "timestamp": "2026-01-05T10:53:43Z"
  },
  {
    "title": "Conor McGregor receives $23 million Donald Trump family-backed investment, as White House Fight rumors grow",
    "description": "Conor McGregor's business ventures received a significant $23 million investment from an entity tied to Donald Trump Jr., fueling speculation about his UFC return. The funding targets combat sports technology and a Web3 ecosystem. Meanwhile, Michael Chandler …",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/conor-mcgregor-receives-23-million-donald-trump-family-backed-investment-as-white-house-fight-rumors-grow/articleshow/126351310.cms",
    "timestamp": "2026-01-05T10:51:15Z"
  },
  {
    "title": "Sara Foster Praises Trump for Apprehending Maduro: Venezuela Is ‘Liberated Today, Truly’",
    "description": "The U.S. capture of Venezuela’s illegitimate socialist dictator, Nicolás Maduro, and his wife, Cilia Flores, should be celebrated as a moment of freedom for the beleaguered country, actress Sara Foster said Sunday.",
    "link": "https://www.breitbart.com/entertainment/2026/01/05/sara-foster-praises-trump-for-apprehending-maduro-venezuela-is-liberated-today-truly/",
    "timestamp": "2026-01-05T10:48:01Z"
  },
  {
    "title": "Ivana Trump: First Wife, First Epstein Warning",
    "description": "A sad tale that foretold where we'd be:\nDuring his marriage to Ivana, Donald was known for getting handsy with other women. One woman, Jessica Leeds, told the New York Times that Trump “grabbed her breasts and tried to put his hand up her skirt,” on a flight …",
    "link": "https://crooksandliars.com/2026/01/ivana-trump-first-wife-first-epstein",
    "timestamp": "2026-01-05T10:47:21Z"
  },
  {
    "title": "African Union expresses ‘grave concern’ over situation in Venezuela",
    "description": "The African Union has expressed concern over reports of US airstrikes on Caracas and the detention of Venezuelan President Nicolas Maduro Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/630592-au-expresses-concern-over-venezuela/",
    "timestamp": "2026-01-05T10:44:03Z"
  },
  {
    "title": "Trump’s Venezuela Invasion Has Exposed One of His Biggest Lies",
    "description": "Trump's apologists promised he'd steer clear of foreign misadventures. They should be embarrassed.",
    "link": "https://slate.com/news-and-politics/2026/01/venezuela-trump-maduro-bush-biden-maga-republicans-democrats.html",
    "timestamp": "2026-01-05T10:40:00Z"
  },
  {
    "title": "Six questions for Washington in 2026",
    "description": "Ben’s view\nPresident Donald Trump reminded Americans this weekend that while his domestic politics have grown more complicated after his first year, he retains the kind of global initiative that only the American president has, and only sometimes.\nThe media, …",
    "link": "https://biztoc.com/x/353069ff2d955278",
    "timestamp": "2026-01-05T10:37:14Z"
  },
  {
    "title": "Vietnam Economy Expands Despite Tariffs, Beating Estimates",
    "description": "Vietnam’s economy grew faster than expected last quarter as manufacturing, investment and trade gained momentum despite President Donald Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/vietnam-economy-expands-despite-tariffs-beating-estimates",
    "timestamp": "2026-01-05T10:33:51Z"
  },
  {
    "title": "Starlink offers free internet access in Venezuela following Maduro raid",
    "description": "SpaceX’s Starlink is offering customers in Venezuela free access to its internet service after the US captured the country’s president, Nicolás Maduro. According to CNBC , some areas of Caracas and other parts of the country lost power and internet connectivi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180516927",
    "timestamp": "2026-01-05T10:32:46Z"
  },
  {
    "title": "Before Maduro’s ouster, opposition leader Mariá Corina Machado said Venezuelans should run their country: ‘We know what we need to do’",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2026/01/05/venezuela-maduro-maria-corina-machado-interview-run-country/",
    "timestamp": "2026-01-05T10:31:27Z"
  },
  {
    "title": "U.S. Treasury yields: U.S. attacks Venezuela, captures Nicolas Maduro",
    "description": "U.S. Treasury yields were relatively unchanged on Monday after the U.S. captured Venezuelan President Nicolas Maduro over the weekend.",
    "link": "https://www.cnbc.com/2026/01/05/us-treasury-yields-us-attacks-venezuela-captures-nicolas-maduro.html",
    "timestamp": "2026-01-05T10:30:46Z"
  },
  {
    "title": "This super-sized problem threatens Trump's survival — and he's making it worse",
    "description": "If you were hung over on New Year’s Day, and decided to take it easy by reading the Wall Street Journal’s\r\n deep dive into Donald Trump’s aging and health, one item no doubt stood out, because it was so viscerally grotesque. The Journal resurfaced an account …",
    "link": "https://www.rawstory.com/raw-investigates/trump-diet/",
    "timestamp": "2026-01-05T10:30:03Z"
  },
  {
    "title": "Six Important Stories for 2026",
    "description": "This year, there’s a built-in understanding of the stakes, and opportunities to take back the country from its malefactors. \nThe post Six Important Stories for 2026 appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/01/05/2026-trump-midterms-economy-data-center-hollywood-warner-bros/",
    "timestamp": "2026-01-05T10:30:00Z"
  }
]