[
  {
    "title": "For the GOP, the cruelty of ‘Alligator Alcatraz’ is the point",
    "description": "Ali Velshi calls out Trump and the GOP for celebrating and making money off the dehumanization of immigrants at Florida’s “Alligator Alcatraz.”",
    "link": "https://www.msnbc.com/top-stories/latest/alligator-alcatraz-trump-republicans-migrants-cruelty-rcna217318",
    "timestamp": "2025-07-08T13:53:11Z"
  },
  {
    "title": "Can Elon Musk become USA President?",
    "description": "Elon Musk versus Donald Trump for US Presidential Elections 2028 may look a far-fetched idea but the world's richest man is striving for the world's most powerful position.",
    "link": "https://economictimes.indiatimes.com/news/international/us/can-elon-musk-become-usa-president/articleshow/122322934.cms",
    "timestamp": "2025-07-08T13:53:04Z"
  },
  {
    "title": "ET Market Watch: Sensex rises 270 pts, Nifty above 25,500 as Trump hints at India trade deal",
    "description": "The Sensex rose 270 points, and the Nifty topped the 25,500 mark, powered by gains in financial and IT stocks… but not everything was green.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/et-market-watch-sensex-rises-270-pts-nifty-above-25500-as-trump-hints-at-india-trade-deal/podcast/122322983.cms",
    "timestamp": "2025-07-08T13:51:21Z"
  },
  {
    "title": "The Wall Street Journal Welcomes Kash Patel and Dan Bongino to the ‘Rotten Establishment ‘Amid MAGA’s Epstein Civil War",
    "description": "The Wall Street Journal welcomed FBI Director Kash Patel and Deputy Director Dan Bongino to the \"rotten establishment\" in a new editorial.\nThe post The Wall Street Journal Welcomes Kash Patel and Dan Bongino to the ‘Rotten Establishment ‘Amid MAGA’s Epstein C…",
    "link": "https://www.mediaite.com/media/news/the-wall-street-journal-welcomes-kash-patel-and-dan-bongino-to-the-rotten-establishment-amid-magas-epstein-civil-war/",
    "timestamp": "2025-07-08T13:51:04Z"
  },
  {
    "title": "Stocks Halt Slide on Hopes for Trump Trade Talks: Markets Wrap",
    "description": "Stocks halted their slide as President Donald Trump’s decision to delay the start of increased duties on several trading partners suggested that he was still open to negotiations. Treasuries joined a global decline of longer-dated bonds. The dollar advanced.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-halt-slide-on-hopes-for-trump-trade-talks-markets-wrap",
    "timestamp": "2025-07-08T13:50:52Z"
  },
  {
    "title": "Student loan cancellation program could become Trump retribution tool, some advocates fear (Barf Alert!)",
    "description": "President Donald Trump is reshaping a student loan cancellation program into what some fear will become a tool for political retribution, taking aim at organizations that serve immigrants and transgender youth. Public Service Loan Forgiveness allows governmen…",
    "link": "https://freerepublic.com/focus/f-news/4327483/posts",
    "timestamp": "2025-07-08T13:50:17Z"
  },
  {
    "title": "'What a joke': Trump tariff letter torn apart by vicious copy edit",
    "description": "Writer and social media commentator Brian Krassenstein offered up a scathing copy edit of Donald Trump's rambling letter to Japan's prime minister announcing increased tariffs in his ongoing trade war.\"What a joke,\" Krassenstein began on his X account. \"The l…",
    "link": "https://www.rawstory.com/trump-tariffs-2672944437/",
    "timestamp": "2025-07-08T13:49:33Z"
  },
  {
    "title": "Politifact: You Can’t Call Mamdani A Communist Just Because He Said All These Communist Things",
    "description": "Sure, cheap groceries sounds nicer than seizing the means of production, but ultimately Socialism turns to Communism.",
    "link": "https://thefederalist.com/2025/07/08/politifact-you-cant-call-mamdani-a-communist-just-because-he-said-all-these-communist-things/",
    "timestamp": "2025-07-08T13:48:32Z"
  },
  {
    "title": "‘Look For Work!’ Bill O’Reilly Torches Corporate Media’s ‘Garbage’ Coverage Of New Medicaid Job Requirements",
    "description": "Bill O’Reilly criticized media outlets for what he described as fear-mongering coverage of Medicaid work requirements included in the \"big, beautiful\" bill.",
    "link": "https://dailycaller.com/2025/07/08/bill-oreilly-torches-corporate-medias-new-medicaid-job-requirements/",
    "timestamp": "2025-07-08T13:45:24Z"
  },
  {
    "title": "Conversion therapy, Wisconsin Supreme Court clears way to enact ban",
    "description": "A Wisconsin Supreme Court ruling cleared the way Tuesday for the state to institute a ban on conversion therapy.",
    "link": "https://www.fox6now.com/news/wisconsin-conversion-therapy-ban-court-decision",
    "timestamp": "2025-07-08T13:45:20Z"
  },
  {
    "title": "RIL-owned Alok Industries shares rally 15% after Trump imposes 35% tariff on Bangladesh",
    "description": "Alok Industries surged 15% after the U.S. imposed 35% tariffs on Bangladeshi imports, boosting Indian textile sentiment. Backed by Reliance, Alok outperformed indices in 3 months but remains volatile. Its strong recent gains lifted it above key technical aver…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-owned-alok-industries-shares-rally-15-after-trump-imposes-35-tariff-on-bangladesh/articleshow/122322883.cms",
    "timestamp": "2025-07-08T13:45:18Z"
  },
  {
    "title": "'Really hurt him': Exact moment Trump started spiraling pinpointed by expert",
    "description": "President Donald Trump is ramping up his tariff threats again, but CNN's Harry Enten said the policy remains as unpopular as ever.The U.S. president slapped another round of punitive tariffs on 14 nations Monday, although global markets so far don't seem to b…",
    "link": "https://www.rawstory.com/trump-trade-war-2672944286/",
    "timestamp": "2025-07-08T13:44:25Z"
  },
  {
    "title": "Anthony Anderson Supports Trump’s Idea of a UFC Fight at the White House – If It’s Between Trump and Elon Musk | Video",
    "description": "\"It'll be Golf Clubber Lang vs. The Ketamine Machine,\" the actor jokes\nThe post Anthony Anderson Supports Trump’s Idea of a UFC Fight at the White House – If It’s Between Trump and Elon Musk | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/ufc-fight-white-house-anthony-anderson-supports-trump-vs-musk/",
    "timestamp": "2025-07-08T13:43:11Z"
  },
  {
    "title": "Democrats call for violence to counter Trump agenda and tell lawmakers to prepare to 'get shot'",
    "description": "Democratic voters are asking their representatives to exhibit more violence while resisting Donald Trump's agenda - with some even suggesting lawmakers prepare to 'get shot.' The party - reeling in the wake of Trump's November victory - heads toward the 2026 …",
    "link": "https://freerepublic.com/focus/f-news/4327478/posts",
    "timestamp": "2025-07-08T13:43:04Z"
  },
  {
    "title": "State-by-state breakdown: Trump’s approval ratings just released — these states are turning on him fast",
    "description": "As Donald Trump navigates the second half of his second term in 2025, his approval ratings reveal a deeply divided nation. While maintaining strong support in states like Wyoming and West Virginia, his approval is slipping in key swing states such as Pennsylv…",
    "link": "https://economictimes.indiatimes.com/news/international/us/state-by-state-breakdown-trumps-approval-ratings-just-released-these-states-are-turning-on-him-fast-trump-approval-rating-latest-news/articleshow/122322296.cms",
    "timestamp": "2025-07-08T13:42:46Z"
  },
  {
    "title": "Following Texas flood, Team Trump faces uncomfortable questions about FEMA’s future",
    "description": "A month ago, Donald Trump said he planned to “wean” states off FEMA assistance. Now, the White House has adopted a very different line on the agency's future.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/texas-flood-team-trump-faces-uncomfortable-questions-femas-future-rcna217461",
    "timestamp": "2025-07-08T13:42:18Z"
  },
  {
    "title": "US preps for August return of country-specific reciprocal tariffs",
    "description": "The Trump administration plans to reinstate the levies Aug. 1 after alerting individual trading partners of their specific duty rates starting Monday.",
    "link": "https://www.supplychaindive.com/news/trump-tariffs-letters-trade-deals-deadline/752317/",
    "timestamp": "2025-07-08T13:42:00Z"
  },
  {
    "title": "US opens flat to higher with all eyes on tariffs",
    "description": "Major stock markets in the United States began Tuesday's trading session flat to higher, reversing some of yesterday's losses, after President Donald Trump officially extended the deadline to reach tr...",
    "link": "https://biztoc.com/x/4ec9e702745acb4e",
    "timestamp": "2025-07-08T13:41:44Z"
  },
  {
    "title": "Alex Jones Breaks Down in Tears Over Trump’s Final Epstein Report",
    "description": "Even Donald Trump’s most sycophantic followers are turning on him over his administration’s handling of the Epstein files.Against the expertise of individuals who had worked on the case for decades, Attorney General Pam Bondi suggested in January that the ped…",
    "link": "https://newrepublic.com/post/197679/alex-jones-donald-trump-jeffrey-epstein-report",
    "timestamp": "2025-07-08T13:40:41Z"
  },
  {
    "title": "Hartarto heads to Washington to negotiate tariff reduction",
    "description": "Coordinating Minister for Economic Affairs, Airlangga Hartarto, has left for Washington, D.C., United States, from Rio de Janeiro, Brazil, to continue ...",
    "link": "https://en.antaranews.com/news/364917/hartarto-heads-to-washington-to-negotiate-tariff-reduction",
    "timestamp": "2025-07-08T13:40:26Z"
  },
  {
    "title": "Why is Donald Trump so afraid of BRICS?",
    "description": "The US president vowed higher tariffs on BRICS nations that align with the bloc's plans to challenge US hegemony. Despite the China-backed initiative making limited progress, dozens of nations are still eager to join. US President Donald Trump is doubling dow…",
    "link": "https://www.dw.com/en/why-is-donald-trump-so-afraid-of-brics/a-73188532",
    "timestamp": "2025-07-08T13:40:00Z"
  },
  {
    "title": "U.S. threatens California with legal action over transgender sports law",
    "description": "Education Secretary Linda McMahon threatened California with legal action after the state refused to ban trans girls from participating in girls’ sports.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/us-threatens-california-legal-action-transgender-sports-law-rcna217468",
    "timestamp": "2025-07-08T13:39:01Z"
  },
  {
    "title": "'It's a ploy!' MAGA senator Mike Lee's core promise destroyed by report",
    "description": "On Monday, June 23, a crowd of about 2,000 people surrounded the Eldorado Hotel & Spa in Santa Fe, New Mexico, where members of President Donald Trump’s Cabinet had come for a meeting of the Western Governors’ Association. “Not for sale!” the crowd boomed. “N…",
    "link": "https://www.rawstory.com/utah-sen-mike-lee-says-selling-off-public-lands-will-solve-the-wests-housing-c/",
    "timestamp": "2025-07-08T13:38:12Z"
  },
  {
    "title": "Former Biden doctor asks to delay testimony to House committee investigating mental fitness - NewsBreak",
    "description": "A House committee investigating former President Joe Biden's mental decline accused ex-White House doctor Kevin O'Connor of stonewalling.",
    "link": "https://www.newsbreak.com/share/4094759017642-former-biden-doctor-asks-to-delay-testimony-to-house-committee-investigating-mental-fitness?s=a2&amp;share_destination_id=MjgwOTY2NjQ1LTE3NTE5ODE4NTMzMTg%3D&amp;pd=0J0uG5tT&amp;hl=en_US&amp;send_time=1751981853&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.21.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q2-v7%2Cns_foryou_rank_exp_25q2-v4",
    "timestamp": "2025-07-08T13:38:09Z"
  },
  {
    "title": "US Stock Market Today: S&P 500 Flat, Dow Opens Lower After Trump's Tariff Letters To 14 Countries",
    "description": "Wall Street opened mixed on Tuesday after the United States issued tariff letters to 14 countries on Monday. S&P 500 was up 0.03%, whereas the tech-heavy Nasdaq Composite was up 0.23% and Dow Jones was down 0.16%.",
    "link": "https://www.ndtvprofit.com/markets/us-stock-market-today-sp-500-flat-dow-opens-lower-after-trumps-tariff-letters-to-14-countries",
    "timestamp": "2025-07-08T13:37:16Z"
  },
  {
    "title": "Trump's tariff pause offers little relief, UN says, warning of global trade instability",
    "description": "The UN warns that President Trump's tariff delay, while providing temporary relief, extends global trade uncertainty, potentially undermining investment and stability. Pamela Coke-Hamilton of the International Trade Centre highlights a broader trend of increa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-pause-offers-little-relief-un-says-warning-of-global-trade-instability/articleshow/122322753.cms",
    "timestamp": "2025-07-08T13:35:31Z"
  },
  {
    "title": "Map Shows All Countries Facing Steep New Tariffs From Trump",
    "description": "The U.S. posted on social media letters to 14 countries on the tariff rates they face from August 1.",
    "link": "https://www.newsweek.com/trump-tariffs-map-countries-2095960",
    "timestamp": "2025-07-08T13:34:50Z"
  },
  {
    "title": "School Assembly Headlines for July 9: Top national, international, sports, business news here",
    "description": "India is set to reshape BRICS in 2026, while a nationwide strike involving millions of workers and farmers is expected. Internationally, Trump urged Netanyahu to resolve the Gaza conflict, and China eased visa rules. In sports, Djokovic and Andreeva advanced …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-headlines-for-july-9-top-national-international-sports-business-news-here/articleshow/122322032.cms",
    "timestamp": "2025-07-08T13:34:49Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Roasts Trump Fans in ‘Meltdown of Their Own Making’ Over Epstein Files",
    "description": "Kaitlan Collins roasted Trump’s base and his administration over a \"meltdown of their own making\" about the non-release of the so-called \"Epstein Files.\"\nThe post CNN’s Kaitlan Collins Roasts Trump Fans in ‘Meltdown of Their Own Making’ Over Epstein Files fir…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-roasts-trump-fans-in-meltdown-of-their-own-making-over-epstein-files/",
    "timestamp": "2025-07-08T13:32:39Z"
  },
  {
    "title": "Trump Can Take Revenge on the 'Deep State': Pardon Snowden",
    "description": "Why Edward Snowden deserves not only a presidential pardon, but a hero's welcome home.",
    "link": "https://reason.com/video/2025/07/08/trump-can-take-revenge-on-the-deep-state-pardon-snowden/",
    "timestamp": "2025-07-08T13:32:20Z"
  },
  {
    "title": "What SCOTUS ruling? Activist judge blocks defunding of Planned Parenthood in Big Beautiful Bill",
    "description": "Well, it certainly hasn't taken long for leftist judges to ignore the stern scolding from the United States Supreme Court and get back to the important business of standing in the way of everything President Donald Trump does, as a federal judge just blocked …",
    "link": "https://freerepublic.com/focus/f-bloggers/4327474/posts",
    "timestamp": "2025-07-08T13:31:53Z"
  },
  {
    "title": "President Trump Praises FBI Director Kash Patel and Dan Bongino as Outrage Grows Over Epstein Whitewash Report",
    "description": "President Donald Trump took to Truth Social to praised embattled FBI Director Kash Patel and Deputy Director Dan Bongino after an explosive report released Monday by the DOJ and FBI downplayed the scope of Jeffrey Epstein’s criminal empire — and flat-out deni…",
    "link": "https://www.thegatewaypundit.com/2025/07/president-trump-praises-fbi-director-kash-patel-dan/",
    "timestamp": "2025-07-08T13:30:59Z"
  },
  {
    "title": "'One Big Beautiful Bill' expands 529 plans. But are there better options?",
    "description": "President Donald Trump's mega tax bill will expand the uses for 529 education savings plans, but enough limitations remain to potentially give some investors pause, some experts say.\nThe legislation dubbed the \"One Big Beautiful Bill Act\" by Trump, who signed…",
    "link": "https://biztoc.com/x/d977c3c6847ae314",
    "timestamp": "2025-07-08T13:30:53Z"
  },
  {
    "title": "Trump Holds Private Meeting With Netanyahu in DC",
    "description": "US President Donald Trump hopes to put Israel and Hamas on the path to ending the war in Gaza this week, but the 60-day ceasefire he’s proposing faces disagreements over troop redeployments and civilian relief.\nIsrael signaled its readiness to resume talks on…",
    "link": "https://biztoc.com/x/340c1b46429108b9",
    "timestamp": "2025-07-08T13:30:20Z"
  },
  {
    "title": "TSA Policies Become Slightly Less Stupid",
    "description": "Plus: Texas flooding update, shark policy, tariffs affecting Prime Day, and more...",
    "link": "https://reason.com/2025/07/08/tsa-policies-become-slightly-less-stupid/",
    "timestamp": "2025-07-08T13:30:13Z"
  },
  {
    "title": "Fast Fashion’s Death Has Been Greatly Exaggerated",
    "description": "Tariffs won’t kill the industry. In fact, they might even make waste and exploitation problems worse.",
    "link": "https://www.theatlantic.com/culture/archive/2025/07/fast-fashion-tariff-decline/683450/",
    "timestamp": "2025-07-08T13:30:00Z"
  },
  {
    "title": "DOJ says Epstein 'client list' doesn't exist, walking back theory Bondi had promoted",
    "description": "It represents a public walk-back of a theory that the Trump administration itself had helped promote.",
    "link": "https://roanoke.com/life-entertainment/nation-world/movies-tv/article_a8166de6-5f62-5900-83a0-8da8f72cbc7f.html",
    "timestamp": "2025-07-08T13:30:00Z"
  },
  {
    "title": "Why some investors are calm about Trump's tariffs",
    "description": "Trump renewed his threat to hit major trading partners, sending stock markets tumbling. But some investors have a glimmer of hope.",
    "link": "https://www.businessinsider.com/investors-calm-trump-taco-pivot-uturn-tariffs-stocks-2025-7",
    "timestamp": "2025-07-08T13:28:27Z"
  },
  {
    "title": "Failed Candidate Takes Another Shot At GOP-Held Senate Seat",
    "description": "Independent candidate Dan Osborn launched another Senate bid Tuesday vowing to defeat Republican Nebraska Sen. Pete Ricketts during the 2026 midterms.",
    "link": "https://dailycaller.com/2025/07/08/dan-osborn-nebraska-senate-pete-ricketts/",
    "timestamp": "2025-07-08T13:26:31Z"
  },
  {
    "title": "Indonesia’s economy at risk from US tariff, lawmaker warns",
    "description": "The 32 percent import tariff imposed by the United States will disrupt Indonesia&rsquo;s industrial and economic sectors, a senior lawmaker warned on ...",
    "link": "https://en.antaranews.com/news/364901/indonesias-economy-at-risk-from-us-tariff-lawmaker-warns",
    "timestamp": "2025-07-08T13:24:02Z"
  },
  {
    "title": "TACO Trump Is Already Waffling on His New Tariff Talks Deadline",
    "description": "Donald Trump said he may fold on his new deadline for tariff negotiations … again.While sitting across the dinner table from Israeli Prime Minister Benjamin Netanyahu Monday evening, Trump was asked by a reporter whether the copy-paste “tariff letters” announ…",
    "link": "https://newrepublic.com/post/197682/donald-trump-taco-new-tariff-talks-deadline",
    "timestamp": "2025-07-08T13:21:05Z"
  },
  {
    "title": "After Paramount’s Trump Settlement, What’s Next? Even the Company Doesn’t Seem Sure",
    "description": "Now that Paramount Global has settled a lawsuit filed by President Donald Trump against “60 Minutes,” is there a chance the fog surrounding the company’s quest to sell itself to Skydance Media is about to lift? So far, it’s not entirely clear — not even to ex…",
    "link": "https://variety.com/2025/tv/news/paramount-trump-settlement-tv-cbs-60-minutes-1236448432/",
    "timestamp": "2025-07-08T13:20:00Z"
  },
  {
    "title": "The Christian mandate that's fueling American political extremism",
    "description": "By Art Jipson, University of DaytonVance Boelter, who allegedly shot Melissa Hortman, a Democratic Minnesota state representative, and her husband, Mark Hortman, on June 14, 2025, studied at Christ for the Nations Institute in Dallas. The group is a Bible sch…",
    "link": "https://www.rawstory.com/what-is-the-seven-mountains-mandate-and-how-is-it-linked-to-political-extremis/",
    "timestamp": "2025-07-08T13:19:43Z"
  },
  {
    "title": "Global stock markets are calling Trump’s bluff on tariffs",
    "description": "U.S. President Donald Trump slapped punitive tariff rates on 14 trading partners on Monday — but global markets are so far shrugging off the new policies.\nThe president announced on Monday that he had sent letters to the leaders of Japan, South Korea, Malaysi…",
    "link": "https://biztoc.com/x/b39b75f53b28dc27",
    "timestamp": "2025-07-08T13:19:30Z"
  },
  {
    "title": "Student Loan Forgiveness programs to undergo massive changes under Trump 2.0. Are you at risk?",
    "description": "Student Loan Forgiveness programs: President Donald Trump’s administration is pushing to reshape the Public Service Loan Forgiveness (PSLF) program. Established in 2007, PSLF allows public service workers—such as teachers, nurses, and nonprofit staffers—to ca…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-student-loan-forgiveness-programs-to-undergo-massive-changes-under-trump-2-0-are-you-at-risk/articleshow/122322413.cms",
    "timestamp": "2025-07-08T13:18:26Z"
  },
  {
    "title": "Trump and Texas Republicans Show How Not to Prepare for the Climate Crisis",
    "description": "Since Friday, more than 80 people, including dozens of young summer camp attendees, have died in Central Texas from flooding intensified by the fossil fuel-driven climate crisis. With search-and-rescue operations ongoing and active flash flood warnings in the…",
    "link": "https://therevolvingdoorproject.org/trump-central-texas-flooding-july-2025/",
    "timestamp": "2025-07-08T13:18:02Z"
  },
  {
    "title": "Swamp games at 'Alligator Alcatraz,' Mamdani’s socialist nightmare, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/swamp-games-alligator-alcatraz-mamdanis-socialist-nightmare-more-from-fox-news-opinion",
    "timestamp": "2025-07-08T13:15:21Z"
  },
  {
    "title": "Indonesia sees room to lower 32 pct US tariff before August 1: PCO",
    "description": "The Indonesian government still has an opportunity to negotiate a lower tariff rate before the United States&#39; 32 percent import duty on Indonesian ...",
    "link": "https://en.antaranews.com/news/364897/indonesia-sees-room-to-lower-32-pct-us-tariff-before-august-1-pco",
    "timestamp": "2025-07-08T13:10:58Z"
  },
  {
    "title": "'Faded away': Expert despairs as Supreme Court ends 'glimmer of independence'",
    "description": "Any sign that the right-wing majority on the Supreme Court were interested in checking President Donald Trump's power have subsided, legal analyst Mark Joseph Stern wrote for Slate in a scathing roundup of the court's agenda this term.He focused particularly …",
    "link": "https://www.rawstory.com/amy-coney-barrett-2672943485/",
    "timestamp": "2025-07-08T13:10:03Z"
  },
  {
    "title": "South Carolina GOP urges Trump supporters to give Gavin Newsom a 'HUGE Southern welcome'",
    "description": "South Carolina GOP leaders tell Gov. Newsom to 'sell Crazy California somewhere else' as Democrats say visit targets overlooked areas. Trip sparking plenty of Newsom 2028 presidential speculation",
    "link": "https://www.foxnews.com/politics/south-carolina-gop-urges-trump-supporters-give-gavin-newsom-huge-southern-welcome",
    "timestamp": "2025-07-08T13:08:39Z"
  },
  {
    "title": "Treasury Yields Rise as Global Markets React to Tariffs Delay",
    "description": "5 min ago\nTreasury Yields Rise as Global Markets React to Tariffs Delay\nGlobal markets are relieved after President Donald Trump pushed the deadline to August 1 for trade deals before tariffs are enacted.\nThe risk-on wave hit U.S. bond markets, putting Treasu…",
    "link": "https://biztoc.com/x/ab98771de0a0138d",
    "timestamp": "2025-07-08T13:08:32Z"
  },
  {
    "title": "Berlin urges quick trade deal with US as German exports tumble",
    "description": "German exports to the United States plummeted in May, official data showed Tuesday, as Berlin pressed the European Union to strike a quick tariff deal with US President Donald Trump.",
    "link": "https://www.thelocal.de/20250708/berlin-urges-quick-trade-deal-with-us-as-german-exports-tumble",
    "timestamp": "2025-07-08T13:08:13Z"
  },
  {
    "title": "Trump-Netanyahu meeting revives bitterly opposed plan to relocate Palestinians",
    "description": "Israeli Prime Minister Benjamin Netanyahu and President Donald Trump discussed at the White House controversial plans to relocate Palestinians out of Gaza.",
    "link": "https://www.nbcnews.com/world/israel/trump-netanyahu-gaza-relocation-palestinians-rcna217418",
    "timestamp": "2025-07-08T13:08:01Z"
  },
  {
    "title": "Trump Threatens ‘Communist’ Mamdani as Netanyahu Dismisses Candidate’s ‘Silly’ Threat to Arrest Him",
    "description": "Trump branded Zohran Mamdani a “communist” after Netanyahu dismissed the Democratic New York City mayoral nominee “silly” arrest threat.\nThe post Trump Threatens ‘Communist’ Mamdani as Netanyahu Dismisses Candidate’s ‘Silly’ Threat to Arrest Him first appeare…",
    "link": "https://www.mediaite.com/media/tv/trump-threatens-communist-mamdani-as-netanyahu-dismisses-candidates-silly-threat-to-arrest-him/",
    "timestamp": "2025-07-08T13:07:47Z"
  },
  {
    "title": "'Trump Effect' website takes credit for US investment made under Biden (Jarrett Renshaw/Reuters)",
    "description": "Jarrett Renshaw / Reuters:\n‘Trump Effect’ website takes credit for US investment made under Biden  —  Within hours of taking office in January, President Donald Trump boasted about attracting $3 trillion in new corporate investments to the United States.  Sin…",
    "link": "https://www.memeorandum.com/250708/p24",
    "timestamp": "2025-07-08T13:05:00Z"
  },
  {
    "title": "Space Companies Got Special Tax Break",
    "description": "\"Private space companies, including Elon Musk’s SpaceX and Jeff Bezos’s Blue Origin, stand to benefit from a preferential tax treatment tucked into Donald Trump’s signature spending plan,\" the Financial Times reports. \"The bill, which Trump",
    "link": "https://politicalwire.com/2025/07/08/space-companies-got-special-tax-break/",
    "timestamp": "2025-07-08T13:01:58Z"
  },
  {
    "title": "EXCLUSIVE: Inside The Biden EPA’s Double Down On DEI Ahead Of Trump’s Return",
    "description": "Just days after the presidential election, EPA staff sought to double down on DEI, according to documents obtained by the Daily Caller News Foundation.",
    "link": "https://dailycaller.com/2025/07/08/exclusive-biden-epa-double-down-dei-trumps-return/",
    "timestamp": "2025-07-08T13:00:37Z"
  },
  {
    "title": "7 Overlooked Provisions in Trump and the GOP’s Ugly Tax Bill",
    "description": "Donald Trump and the GOP's so-called \"Big Beautiful Bill\" guts Medicaid to give tax breaks to the rich, but the legislation includes other horrors.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-big-beautiful-bill-overlooked-provisions-1235380378/",
    "timestamp": "2025-07-08T13:00:00Z"
  },
  {
    "title": "Alligator Alcatraz: Depravity in the Everglades",
    "description": "The editorial board of the Sun-Sentinel in Florida expressed shock and disgust at the creation of the detention camp for immigrants now called Alligator Alley. The existence of this hell-hole offended their sense of decency but they were offended even more by…",
    "link": "https://dianeravitch.net/2025/07/08/alligator-alcatraz-depravity-in-the-everglades/",
    "timestamp": "2025-07-08T13:00:00Z"
  },
  {
    "title": "The US Air Force Might Send Its Retired B-2 Bombers to Israel. Bad Idea!",
    "description": "America has never shared its most advanced military innovations with any other nation—understanding that once a technology is out of its hands, it can no longer control where it goes. \nThe post The US Air Force Might Send Its Retired B-2 Bombers to Israel. Ba…",
    "link": "https://nationalinterest.org/blog/buzz/us-air-force-might-send-retired-b-2-bombers-israel-bad-idea-bw",
    "timestamp": "2025-07-08T13:00:00Z"
  },
  {
    "title": "What Do Tariffs on Japan Mean for the Camera Industry?",
    "description": "Tariffs have already caused issues for photographers. Companies such as Leica, Nikon, Sigma, and Canon have each announced significant price hikes, which have hurt photographers. Due to the escalation, US President Donald Trump has decided to hold off tariffs…",
    "link": "https://www.thephoblographer.com/2025/07/08/what-do-tariffs-on-japan-mean-for-the-camera-industry/",
    "timestamp": "2025-07-08T13:00:00Z"
  },
  {
    "title": "‘It looks like ducking’: Matt Brown reacts to Jon Jones returning from retirement after Tom Aspinall booked a fight",
    "description": "Matt Brown doesn’t want to believe that Jon Jones actually went out of his way to avoid a fight against Tom Aspinall but announcing his return from retirement just days after Aspinall booked a fight doesn’t look great for him right now.",
    "link": "https://www.mmafighting.com/2025/7/8/24463195/it-looks-like-ducking-matt-brown-reacts-jon-jones-returning-retirement-tom-aspinall-booked-a-fight",
    "timestamp": "2025-07-08T13:00:00Z"
  },
  {
    "title": "Brooke Rollins Announces USDA National Farm Security Action Plan to 'Promote Agricultural Prosperity' and 'Strengthen' U.S. Food Supply",
    "description": "Secretary of Agriculture Brooke Rollins revealed that the United States Department of Agriculture (USDA) is rolling out the National Farm Security Action Plan, which will \"promote agricultural prosperity\" and \"defend the foundations of agriculture\" and streng…",
    "link": "https://www.breitbart.com/politics/2025/07/08/brooke-rollins-announces-usda-national-farm-security-action-plan-to-promote-agricultural-prosperity-and-strengthen-u-s-food-supply/",
    "timestamp": "2025-07-08T12:59:05Z"
  },
  {
    "title": "Qatar says 'we will need time' for Gaza ceasefire",
    "description": "Qatar has cautioned that ongoing ceasefire negotiations between Israel and Hamas \"need time,\" despite optimism voiced by Donald Trump. Indirect talks, mediated by Qatar, the US, and Egypt, aim to establish a truce after months of conflict. While discussions f…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/qatar-says-we-will-need-time-for-gaza-ceasefire/articleshow/122322170.cms",
    "timestamp": "2025-07-08T12:59:01Z"
  },
  {
    "title": "Domestic economy pulled ahead of multinationals growth last year, data shows",
    "description": "Expansion of the domestic economy, including record levels of public spending, was the main driver of growth in the Irish economy last year. Final figures from the Central Statistics Office (CSO) shows the measure known as GNI*, that tracks the economy but st…",
    "link": "https://www.independent.ie/business/domestic-economy-pulled-ahead-of-multinationals-growth-last-year-data-shows/a906745330.html",
    "timestamp": "2025-07-08T12:58:30Z"
  },
  {
    "title": "Trump Administration Sees Steepest Drop in Illegal Crossings in Over a Decade—Down to 197,850 Nationwide",
    "description": "Ever since his successful bid for the presidency in 2016, Donald Trump has made illegal immigration a centerpiece of his political platform. Trump’s message of improved border security — particularly along the U.S.-Mexico border — was especially salient in th…",
    "link": "https://biztoc.com/x/6d8c4e043dfebc85",
    "timestamp": "2025-07-08T12:57:00Z"
  },
  {
    "title": "Team Trump struggles to control the Epstein ‘client list’ fire it helped create",
    "description": "It was Team Trump that helped light the match and fan the flames on Jeffrey Epstein's alleged \"client list,\" starting a political fire they’ve lost control over",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-struggles-control-epstein-client-list-fire-helped-create-rcna217441",
    "timestamp": "2025-07-08T12:56:01Z"
  },
  {
    "title": "Tesla is in deeper trouble than you think - CNN",
    "description": "Tesla is in deeper trouble than you thinkCNN Elon Musk's Trump fallout poses deepening risks to Tesla, SpaceXAxios Tesla Is More a Musk Dream Stock Than a Meme StockBloomberg Tesla short sellers set to pocket about $1.4 billion in profits after stock slumpReu…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178310600",
    "timestamp": "2025-07-08T12:55:42Z"
  },
  {
    "title": "Commercial Ship Under Continuous Houthi Attack In Red Sea",
    "description": "Yemen’s Houthi militants continued to pound a commercial ship in the Red Sea — hours after beginning an assault on the vessel that left crew missing — the latest sign that the Tehran-backed group is once again escalating its threat to the merchant fleet.",
    "link": "https://www.ndtvprofit.com/world/commercial-ship-under-continuous-houthi-attack-in-red-sea",
    "timestamp": "2025-07-08T12:52:28Z"
  },
  {
    "title": "Who Will Trump Disappear From History Next?",
    "description": "In early June, The Washington Post published a follow-up to earlier stories on a Trump administration plan to remove thousands of photographs from Defense Department websites because of “DEI-related content.” Illustrated with more than a dozen samples of the …",
    "link": "https://tomdispatch.com/chilling-parallels/",
    "timestamp": "2025-07-08T12:51:02Z"
  },
  {
    "title": "Trump Takes Credit for U.S. Investment Made Under Biden",
    "description": "\"Within hours of taking office in January, President Donald Trump boasted about attracting $3 trillion in new corporate investments to the United States,\" Reuters reports. \"The White House calls it 'The Trump Effect' and features",
    "link": "https://politicalwire.com/2025/07/08/trump-takes-credit-for-u-s-investment-made-under-biden/",
    "timestamp": "2025-07-08T12:51:00Z"
  },
  {
    "title": "Brendan Schaub: UFC hosting event at the White House 'should be celebrated'",
    "description": "Brendan Schaub explains why the potential UFC event at the White House should be celebrated by fans regardless of political affiliation.",
    "link": "https://mmajunkie.usatoday.com/story/sports/ufc/2025/07/08/ufc-brendan-schaub-white-house-event-celebrated/84498744007/",
    "timestamp": "2025-07-08T12:50:26Z"
  },
  {
    "title": "Tuesday, July 8, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/tuesday-july-8-2025/",
    "timestamp": "2025-07-08T12:48:32Z"
  },
  {
    "title": "German Exports Fall More Than Expected As US Shipments Sink",
    "description": "German exports sank more than anticipated in May as the value of shipments to the US plunged to their lowest level in more than three years amid President Donald Trump’s tariff threats.Total exports declined 1.4% from the previous month, the statistics office…",
    "link": "https://www.ndtvprofit.com/global-economics/german-exports-fall-more-than-expected-as-us-shipments-sink",
    "timestamp": "2025-07-08T12:47:39Z"
  },
  {
    "title": "What Is the Trump Doctrine? John Bellamy Foster on U.S. Foreign Policy & the \"New MAGA Imperialism\"",
    "description": "What is MAGA imperialism? Monthly Review editor John Bellamy Foster says that, despite its feints toward anti-imperialist isolationism, President Donald Trump’s foreign policy has coalesced into a “hyper-nationalist” form of populism that rejects the U.S.'s p…",
    "link": "https://www.democracynow.org/2025/7/8/trump_doctrine_maga_imperialism",
    "timestamp": "2025-07-08T12:47:09Z"
  },
  {
    "title": "Sarah Jessica Parker Exposes ‘Weirdest’ Hypocrisy Of Her Critics ‘On The Other Side’",
    "description": "The “And Just Like That...” star addressed the “shut up and act” crowd during an interview with MSNBC’s Nicolle Wallace.",
    "link": "https://www.huffpost.com/entry/sarah-jessica-parker-political-criticism_n_686ceaf8e4b052503286cf62",
    "timestamp": "2025-07-08T12:46:32Z"
  },
  {
    "title": "Trump’s Winning Streak May Soon Face Obstacles",
    "description": "By Victor Davis Hanson, The Daily Signal | July 02, 2025\nHello, this is Victor Davis Hanson for The Daily Signal. I’d like to review, very quickly, some challenges ahead for the MAGA movement in general and President Donald Trump in particular.\nHe’s had a won…",
    "link": "https://biztoc.com/x/e1e3ab56c58053e8",
    "timestamp": "2025-07-08T12:45:58Z"
  },
  {
    "title": "‘Ridiculous’: Trump Unloads On ‘Train Wreck’ Elon Musk For Starting New Party",
    "description": "By Jason Cohen, Daily Caller News Foundation | July 06, 2025\nPresident Donald Trump condemned Elon Musk’s newly-announced third party on Sunday while speaking to reporters in New Jersey.\nMusk posted on X Saturday that he had just launched the “America Party” …",
    "link": "https://biztoc.com/x/bc29302074e6febc",
    "timestamp": "2025-07-08T12:45:54Z"
  },
  {
    "title": "Tesla stock chart still screams bearish",
    "description": "Tesla's stock chart remains damaged goods.",
    "link": "https://finance.yahoo.com/news/tesla-stock-chart-still-screams-bearish-124545360.html",
    "timestamp": "2025-07-08T12:45:45Z"
  },
  {
    "title": "Donald Trump Just Launched His Own TV Streaming Platform. Seriously",
    "description": "",
    "link": "https://biztoc.com/x/8dd52ea0bbc99216",
    "timestamp": "2025-07-08T12:45:40Z"
  },
  {
    "title": "Amazon sellers curb Prime Day discounts as tariffs bite",
    "description": "Amazon.com Inc.\n \n \n \n \n \n \n \n \n \n ’s Prime Day is slamming into \n \n \n \n \n \n \n \n \n \n U.S. President Donald Trump\n \n \n \n \n \n \n \n \n \n ’s trade war, with ever-shifting tariffs prompting some brands to sit out the summer sale and some shoppers dropping hints they…",
    "link": "https://biztoc.com/x/b505f704d72b4208",
    "timestamp": "2025-07-08T12:45:39Z"
  },
  {
    "title": "Trump Signs Major Disaster Declaration After Heavy Texas Flooding",
    "description": "By Melanie Wilcox, Daily Caller News Foundation | May 18, 2025\nPresident Donald Trump announced Sunday that he signed a Major Disaster Declaration for Kerr County, Texas, as the state reels from deadly flooding that has killed dozens and left more missing.\n“T…",
    "link": "https://biztoc.com/x/25f31b321b53e0fc",
    "timestamp": "2025-07-08T12:45:16Z"
  },
  {
    "title": "Israel's plan for confining all Palestinians in 'humanitarian city'",
    "description": "When Donald Trump announced in February that the US should take \"ownership\" of Gaza and develop the battered enclave into the \"Riviera of the Middle East\", he caused outrage across the Middle East – but not in Israel.\nStanding alongside Benjamin Netanyahu, th…",
    "link": "https://biztoc.com/x/08ad64a27c22065c",
    "timestamp": "2025-07-08T12:45:14Z"
  },
  {
    "title": "Trump’s new tariffs: Who is hit, what’s next, how is the world responding?",
    "description": "Trump sent tariff letters to 14 countries including South Korea, Japan, Malaysia and Bangladesh.",
    "link": "https://www.aljazeera.com/news/2025/7/8/trumps-new-tariffs-who-is-hit-whats-next-how-is-the-world-responding-2",
    "timestamp": "2025-07-08T12:45:13Z"
  },
  {
    "title": "Trump’s Truth Social files S-1 for crypto blue chip ETF holding BTC, ETH, XRP, SOL, and CRO",
    "description": "The launch of a crypto ETF by Truth Social could significantly influence mainstream adoption and regulatory perspectives on digital assets.\nThe post Trump’s Truth Social files S-1 for crypto blue chip ETF holding BTC, ETH, XRP, SOL, and CRO appeared first on …",
    "link": "https://cryptobriefing.com/crypto-blue-chip-etf-launch/",
    "timestamp": "2025-07-08T12:44:07Z"
  },
  {
    "title": "Elon Musk loses $15 billion as Tesla shares fall after America Party launch",
    "description": "Tesla's shares have been suffering as a result of Musk's ongoing feud with one-time ally Donald Trump. After fulfilling his pledge to launch a new political party over the weekend, Tesla shares dropped 7% yesterday morning, losing around $21 per share.Read En…",
    "link": "https://www.techspot.com/news/108591-elon-musk-loses-15-billion-tesla-shares-fall.html",
    "timestamp": "2025-07-08T12:44:00Z"
  },
  {
    "title": "Gold price today: Gold rate continues to fall. What will happen on July 9?",
    "description": "Gold rate on Tuesday fell again ahead of July 9 deadline for Donald Trump tariffs.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-gold-rate-continues-to-fall-what-will-happen-on-july-9/articleshow/122321898.cms",
    "timestamp": "2025-07-08T12:43:56Z"
  },
  {
    "title": "Horse-Mounted Federal Agents Descend on Los Angeles Park, on Video",
    "description": "Horse-mounted federal agents robed in tactical gear descended on a Los Angeles park alongside about 90 members of the California National Guard Monday -- a move Mayor Karen Bass is condemning as a \"political stunt.\" Check out the chilling clip --…\n Permalink",
    "link": "https://www.tmz.com/2025/07/08/horse-mounted-federal-agents-los-angeles-park/",
    "timestamp": "2025-07-08T12:43:50Z"
  },
  {
    "title": "Israel's plan for confining all Palestinians in 'humanitarian city'",
    "description": "Defence minister wants to establish zone in Gaza for displaced people – which they would not be allowed to leave – prompting accusations of war crimes",
    "link": "https://theweek.com/world-news/israels-plan-for-confining-all-palestinians-in-humanitarian-city",
    "timestamp": "2025-07-08T12:43:45Z"
  },
  {
    "title": "Trump outrage is hiding the real danger to America",
    "description": "Americans are waking up to President Donald Trump’s assaults on our democracy. In just four years, his documented lies have topped 30,000.\r\n He has also broken laws, including his attempts to dismantle\r\n government agencies, his blatant conflicts of interest\r…",
    "link": "https://www.rawstory.com/trump-fury/",
    "timestamp": "2025-07-08T12:39:24Z"
  },
  {
    "title": "Marco Rubio Imposter Calling High-Level Officials Using AI-Generated Voice: Report",
    "description": "Someone posing as Secretary of State Marco Rubio has been contacting US officials using AI-generated voice and text, according to a new report.\nThe post Marco Rubio Imposter Calling High-Level Officials Using AI-Generated Voice: Report first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/marco-rubio-imposter-calling-high-level-officials-using-ai-generated-voice-report/",
    "timestamp": "2025-07-08T12:38:57Z"
  },
  {
    "title": "A look at the countries that received Trump's tariff letters",
    "description": "President Donald Trump has sent letters to 14 countries outlining higher tariffs they’ll face if they don’t make trade deals with the U.S. by Aug. 1. The letters were posted on Truth Social. Trump warned countries that they would face even higher tariffs if t…",
    "link": "https://www.seattlepi.com/business/article/a-look-at-the-countries-that-received-trump-s-20760547.php",
    "timestamp": "2025-07-08T12:36:53Z"
  }
]