[
  {
    "title": "Trump says he will award Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President-elect Donald Trump, right, and former New York Mayor Rudy Giuliani pose for photographs as Giuliani arrives at the Trump National Golf Club Bedminster clubhouse, in Bedminster, N.J., on Nov. 20, 2016.",
    "link": "https://biztoc.com/x/c49cefee95015eb8",
    "timestamp": "2025-09-01T21:38:01Z"
  },
  {
    "title": "Trump says he is awarding Giuliani the Presidential Medal of Freedom",
    "description": "Donald Trump has announced he will award Rudolph Giuliani the Presidential Medal of Freedom, a day after the former New York mayor and political ally was seriously injured in a traffic accident.",
    "link": "https://news.sky.com/story/donald-trump-says-he-is-awarding-rudy-giuliani-the-presidential-medal-of-freedom-13423438",
    "timestamp": "2025-09-01T21:35:00Z"
  },
  {
    "title": "Trump to award Rudy Giuliani the Presidential Medal of Freedom: 'Great American Patriot'",
    "description": "President Trump announced he would award Rudy Giuliani the Presidential Medal of Freedom one day after the former NYC mayor was seriously injured in a car crash.",
    "link": "https://www.foxnews.com/politics/trump-award-rudy-giuliani-presidential-medal-freedom-great-american-patriot",
    "timestamp": "2025-09-01T21:33:04Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "The former mayor and lawyer was disbarred in New York and Washington for repeatedly making false statements about the 2020 election.President Donald Trump said Monday he will award former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, the …",
    "link": "https://freerepublic.com/focus/f-news/4338071/posts",
    "timestamp": "2025-09-01T21:30:00Z"
  },
  {
    "title": "Exclusive -- Treasury Secretary Bessent in Labor Day ‘No Tax on Tips' Diner Interview: Time for ‘Parallel Prosperity’ Where ‘Main Street and Working Americans Do Great'",
    "description": "Treasury Secretary Scott Bessent told Breitbart News exclusively on Labor Day that President Donald Trump's fulfilled \"no tax on tips” campaign promise will significantly help American workers like the wait staff at the diner he visited on Monday.\nThe post Ex…",
    "link": "https://www.breitbart.com/politics/2025/09/01/exclusive-treasury-secretary-bessent-labor-day-no-tax-tips-diner-interview-time-parallel-prosperity-where-main-street-working-americans-do-great/",
    "timestamp": "2025-09-01T21:29:13Z"
  },
  {
    "title": "Donald Trump's latest headache Mexico's first female president Claudia Sheinbaum celebrates one year at office with high approval ratings",
    "description": "Mexico president Claudia Sheinbaum took office in October and has led the Latin American nation of 131 million at a time of radical global shifts. Sheinbaum has enjoyed soaring approval rates between 70% and 80% in Mexican polls.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-latest-headache-mexicos-first-female-president-claudia-sheinbaum-celebrates-one-year-at-office-with-high-approval-ratings/articleshow/123643414.cms",
    "timestamp": "2025-09-01T21:28:18Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President Donald Trump says he’s awarding former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, announcing the honor two days after his longtime political ally was badly injured in a traffic accident",
    "link": "https://www.wftv.com/news/politics/trump-says-hes/EEPIO2EEXFBMDMQ5S4RIPVRLHU/",
    "timestamp": "2025-09-01T21:27:36Z"
  },
  {
    "title": "Trump's treasury secretary confident U.S. Supreme Court will declare tariffs legal",
    "description": "U.S. Treasury Secretary Scott Bessent on Monday expressed confidence that the U.S. Supreme Court will uphold President Donald Trump's use of a 1977 emergency powers law to impose sweeping tariffs on most trading partners but said the administration has a back…",
    "link": "https://www.cbc.ca/news/world/bessent-trump-tariffs-supreme-court-1.7622684",
    "timestamp": "2025-09-01T21:25:53Z"
  },
  {
    "title": "'No, no, no!' NYT journalist gets heated at CNN conservative's 'disingenuous' claim",
    "description": "A New York Times journalist got heated when a conservative on CNN tried to equate people in the country illegally with criminals during a discussion on whether President Donald Trump is rightfully weighing whether to send federal troops to Chicago to combat c…",
    "link": "https://www.rawstory.com/trump-immigration-2673945927/",
    "timestamp": "2025-09-01T21:25:31Z"
  },
  {
    "title": "Trump says Giuliani to receive top US civilian honor",
    "description": "WASHINGTON: President Donald Trump said on Monday (Sep 1) he will award the Presidential Medal of Freedom to former New York mayor Rudy Giuliani, two days after Giuliani was injured in a car crash.",
    "link": "https://www.channelnewsasia.com/world/trump-says-giuliani-receive-top-us-civilian-honor-5327596",
    "timestamp": "2025-09-01T21:22:44Z"
  },
  {
    "title": "Kim Jong Un takes 'moving fortress' bulletproof train to meet Putin and Xi at Beijing military parade",
    "description": "North Korean leader Kim Jong Un departs for Beijing aboard his bulletproof fortress train to attend military parade alongside Chinese and Russian presidents this week",
    "link": "https://www.foxnews.com/world/kim-jong-un-takes-moving-fortress-bulletproof-train-meet-putin-xi-beijing-military-parade",
    "timestamp": "2025-09-01T21:22:29Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani Presidential Medal of Freedom",
    "description": "President Donald Trump said Monday he’s awarding former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, announcing the honor two days after his political ally was badly injured in a traffic accident.  Trump in a statement on social media ca…",
    "link": "https://japantoday.com/category/world/trump-says-he%27s-awarding-former-new-york-mayor-rudy-giuliani-the-presidential-medal-of-freedom",
    "timestamp": "2025-09-01T21:22:24Z"
  },
  {
    "title": "Venezuela's Maduro says U.S. seeking regime change with naval build-up",
    "description": "The United States is seeking a regime change in his country with a naval deployment in the Caribbean, Venezuelan President Nicolas Maduro said on Monday in a rare press conference. Tensions between the United States and Venezuela have risen in recent weeks am…",
    "link": "https://japantoday.com/category/world/venezuela%27s-maduro-says-us-seeking-regime-change-with-naval-build-up",
    "timestamp": "2025-09-01T21:22:18Z"
  },
  {
    "title": "1.2 million immigrants are gone from U.S. labor force under Trump, preliminary data shows",
    "description": "It's tomato season and Lidia is harvesting on farms in California's Central Valley. She is also anxious. Attention from U.S. Immigration and Customs Enforcement could upend her life more than 23 years after she illegally crossed the U.S.-Mexico border as a te…",
    "link": "https://japantoday.com/category/world/1.2-million-immigrants-are-gone-from-the-us-labor-force-under-trump-preliminary-data-shows",
    "timestamp": "2025-09-01T21:22:12Z"
  },
  {
    "title": "In Chicago, thousands protest against threat of ICE, National Guard deployment",
    "description": "Thousands of protesters packed the streets near downtown Chicago on Monday, singing, chanting and waving signs protesting U.S. President Donald Trump's threats to flood the city with National Guard troops and federal immigration agents. The march was one of r…",
    "link": "https://japantoday.com/category/world/in-chicago-thousands-protest-against-threat-of-ice-national-guard-deployment",
    "timestamp": "2025-09-01T21:21:58Z"
  },
  {
    "title": "Rudy Giuliani to receive Presidential Medal of Freedom, Trump says",
    "description": "America's highest civilian honour is awarded to those with \"exceptionally meritorious contributions\" to society.",
    "link": "https://www.bbc.com/news/articles/ce939gy19nxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-01T21:21:52Z"
  },
  {
    "title": "Rudy Giuliani to receive Presidential Medal of Freedom, Trump says",
    "description": "America's highest civilian honour is awarded to those with \"exceptionally meritorious contributions\" to society.",
    "link": "https://www.bbc.com/news/articles/ce939gy19nxo",
    "timestamp": "2025-09-01T21:21:48Z"
  },
  {
    "title": "Ukraine backers to discuss post-war guarantees at Thursday summit",
    "description": "France will host a mostly virtual meeting on Thursday of some 30 countries to discuss their latest efforts to provide Ukraine with security support once there is a peace agreement with Russia and to denounce Moscow's unwillingness for negotiations. &quot;Foll…",
    "link": "https://japantoday.com/category/world/ukraine-backers-to-discuss-post-war-guarantees-at-thursday-summit",
    "timestamp": "2025-09-01T21:21:40Z"
  },
  {
    "title": "The devil wore J. Crew? Chloe Malle, the daughter of Hollywood stars, had an Andy Sachs start... and will reportedly take over Vogue",
    "description": "Chloe Malle, the daughter of Murphy Brown star Candice Bergen, and a mom of two who likes nothing more than a quiet night in, will reportedly take the helm of American Vogue from the legendary Anna Wintour. Rhian Lubin reports on her ascension through the fas…",
    "link": "https://www.the-independent.com/life-style/chloe-malle-vogue-anna-wintour-networth-parents-b2818127.html",
    "timestamp": "2025-09-01T21:21:37Z"
  },
  {
    "title": "Costco’s new rule takes effect September 1: Everything you need to know",
    "description": "Grace period ended on Monday, which means new rule is officially being enforced",
    "link": "https://www.the-independent.com/life-style/costco-new-rule-executive-membership-hours-september-b2818126.html",
    "timestamp": "2025-09-01T21:19:00Z"
  },
  {
    "title": "Trump plans a hefty tax on imported drugs, risking higher prices and shortages",
    "description": "President Donald Trump has plastered tariffs on products from almost every country on earth. He’s targeted specific imports including autos, steel and aluminum. But he isn’t done yet. Trump has promised to impose hefty import taxes on pharmaceuticals, a categ…",
    "link": "https://japantoday.com/category/features/health/trump-plans-a-hefty-tax-on-imported-drugs-risking-higher-prices-and-shortages",
    "timestamp": "2025-09-01T21:18:01Z"
  },
  {
    "title": "Trump says Giuliani will receive Medal of Freedom",
    "description": "United States President Donald Trump said that Rudy Giuliani will receive the Presidential Medal of Freedom.\nTrump announced the decision on Truth Social, calling Giuliani \"the greatest Mayor in...",
    "link": "https://biztoc.com/x/d87c94fd46c64462",
    "timestamp": "2025-09-01T21:15:37Z"
  },
  {
    "title": "Trump Puts The Heat On Pfizer: Release COVID Vaccine Data To Public ‘NOW’",
    "description": "“It is very important that the Drug Companies justify the success of their various Covid Drugs.\"President Donald Trump issued a Labor Day appeal for Pfizer to share its COVID-19 vaccine data with the CDC and the public immediately. Trump said on Truth Social …",
    "link": "https://freerepublic.com/focus/f-chat/4338067/posts",
    "timestamp": "2025-09-01T21:15:01Z"
  },
  {
    "title": "Trump poised to declare new national emergency ahead of midterm elections: report (Alexander Willis/Raw Story)",
    "description": "Alexander Willis / Raw Story:\nTrump poised to declare new national emergency ahead of midterm elections: report  —  President Donald Trump is considering declaring a new national emergency later this year to bolster the Republican Party's prospects in the 202…",
    "link": "https://www.memeorandum.com/250901/p62",
    "timestamp": "2025-09-01T21:15:00Z"
  },
  {
    "title": "Trump says he will award Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President Donald Trump said he will award Rudy Giuliani the Presidential Medal of Freedom, the nation's highest civilian honor.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-award-rudy-giuliani-presidential-medal-freedom-rcna228426",
    "timestamp": "2025-09-01T21:13:18Z"
  },
  {
    "title": "Chinese Ambassador Slams President Trump’s Pro-Life Policies at UN",
    "description": "A sharp exchange between the United States and China erupted at the United Nations this week, as China’s ambassador criticized President Donald Trump’s pro-life policies, particularly his decision to defund the United Nations Population Fund (UNFPA). The conf…",
    "link": "https://freerepublic.com/focus/f-news/4338066/posts",
    "timestamp": "2025-09-01T21:12:52Z"
  },
  {
    "title": "‘Great American Patriot’: Trump to award Giuliani the Presidential Medal of Freedom",
    "description": "President Trump announces that Rudy Giuliani will receive the Presidential Medal of Freedom. The announcement comes as Giuliani is recovering in hospital following an accident.",
    "link": "https://www.israelnationalnews.com/news/414237",
    "timestamp": "2025-09-01T21:10:49Z"
  },
  {
    "title": "A Constitutional Longshot: Trump Touts Voter ID by Executive Order",
    "description": "The president will be hard pressed to come up with a work around for the Constitution on this one. President Donald Trump declared his intent to sign a new executive order – this time, on voter ID. Polls show it’s a popular idea, sure, but popular doesn’t equ…",
    "link": "https://freerepublic.com/focus/f-news/4338064/posts",
    "timestamp": "2025-09-01T21:10:10Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President Donald Trump says he’s awarding former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, announcing the honor two days after his longtime political ally was badly injured in a traffic accident",
    "link": "https://www.wsbtv.com/news/politics/trump-says-hes/EEPIO2EEXFBMDMQ5S4RIPVRLHU/",
    "timestamp": "2025-09-01T21:08:26Z"
  },
  {
    "title": "Trump raises fresh questions about Covid-19 vaccines that he says have ‘ripped apart’ CDC | CNN Politics",
    "description": "President Donald Trump on Monday appeared to raise fresh questions about the Covid-19 vaccines that were first developed on his watch, saying his top public health agency is being “ripped apart” by debate over the success of the shots.",
    "link": "https://www.cnn.com/2025/09/01/politics/covid-vaccines-trump-cdc",
    "timestamp": "2025-09-01T21:08:22Z"
  },
  {
    "title": "Donald Trump says he will award Presidential Medal of Freedom to Rudy Giuliani",
    "description": "President Donald Trump said he will award former New York Mayor Rudy Giuliani with the Presidential Medal of Freedom, the nation's highest civilian honor.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/01/trump-rudy-giuliani-presidential-medal-of-freedom/85930936007/",
    "timestamp": "2025-09-01T21:05:32Z"
  },
  {
    "title": "Maduro says US naval forces aimed at regime change in Venezuela",
    "description": "US has deployed military forces to the Caribbean with the ostensible goal of combatting drug trafficking.",
    "link": "https://www.aljazeera.com/news/2025/9/1/maduro-says-us-naval-forces-aimed-at-regime-change-in-venezuela",
    "timestamp": "2025-09-01T21:04:21Z"
  },
  {
    "title": "Trump announces he will award Giuliani the Presidential Medal of Freedom | CNN Politics",
    "description": "President Donald Trump announced on Monday that he will be awarding his former attorney and former New York City Mayor Rudy Giuliani with the Presidential Medal of Freedom, which is the highest civilian honor.",
    "link": "https://www.cnn.com/2025/09/01/politics/rudy-giuliani-trump-presidential-medal-of-freedom",
    "timestamp": "2025-09-01T21:03:16Z"
  },
  {
    "title": "Trump Awards ‘American Patriot’ Rudy Giuliani Presidential Medal of Freedom After Car Wreck",
    "description": "President Donald Trump said he is awarding the Presidential Medal of Freedom to Rudy Giuliani, one day after he was involved in a severe car wreck\nThe post Trump Awards ‘American Patriot’ Rudy Giuliani Presidential Medal of Freedom After Car Wreck first appea…",
    "link": "https://www.mediaite.com/media/news/trump-awards-american-patriot-rudy-giuliani-presidential-medal-of-freedom-after-car-wreck/",
    "timestamp": "2025-09-01T21:03:10Z"
  },
  {
    "title": "House of Cards actress joins Hollywood exodus from US after calling country a 's---show'",
    "description": "Robin Wright joined other Hollywood celebrities criticizing America, telling The Times of London she loves the UK and plans to move there with her family and dogs.",
    "link": "https://www.foxnews.com/media/house-cards-actress-joins-hollywood-exodus-from-us-after-calling-country-s-show",
    "timestamp": "2025-09-01T21:00:07Z"
  },
  {
    "title": "Putin and Xi Drive SCO Agenda",
    "description": "Russian President Vladimir Putin, Indian Prime Minister Narendra Modi, and other leaders from the Shanghai Cooperation Organization (SCO) are attending a two-day summit in China where Xi Jinping will aim to hone his vision of an alternative world order. More …",
    "link": "https://oilprice.com/Geopolitics/International/Putin-and-Xi-Drive-SCO-Agenda.html",
    "timestamp": "2025-09-01T21:00:00Z"
  },
  {
    "title": "Xi and Putin all smiles before rounding on Western 'bullying' at China summit",
    "description": "India’s Modi also got in on the bonhomie, posting photos from his car ride with Putin.",
    "link": "https://www.thejournal.ie/putin-xi-6805030-Sep2025/",
    "timestamp": "2025-09-01T20:59:03Z"
  },
  {
    "title": "Building on Trump’s labor union success",
    "description": "Among the most remarkable achievements of President Donald Trump’s political rise has been the inroads he has made into traditional Democratic constituencies, particularly labor unions. Republicans, if they play their cards right, can ensure this lasts.For de…",
    "link": "https://freerepublic.com/focus/f-news/4338063/posts",
    "timestamp": "2025-09-01T20:58:17Z"
  },
  {
    "title": "Over 1,000 Labor Day rallies held across US to protest Trump",
    "description": "Tens of thousands gather under 'Workers Over Billionaires', pushing for livable wages and economic justice.",
    "link": "https://www.aljazeera.com/news/2025/9/1/over-1000-labor-day-rallies-held-across-us-to-protest-trump",
    "timestamp": "2025-09-01T20:55:29Z"
  },
  {
    "title": "EXCLUSIVE: Full Transcript: Daily Caller Interviews President Donald Trump",
    "description": "The Daily Caller's White House correspondent Reagan Reese interviewed President Donald Trump for an hour in the Oval Office. This is the full transcript.",
    "link": "https://dailycaller.com/2025/09/01/donald-trump-reagan-reese-daily-caller-interview-full-transcript/",
    "timestamp": "2025-09-01T20:55:27Z"
  },
  {
    "title": "DOJ during Trump's first term stymied, squashed probes on Comey, Clinton, Schiff and Hunter Biden",
    "description": "The DOJ, FBI, and IRS in Trump's first term seemed to let a large number of Trump antagonists off the hook for their potential criminality. It remains to be seen how the second Trump DOJ will handle possible high-profile prosecutions.The Justice Department, F…",
    "link": "https://freerepublic.com/focus/f-news/4338062/posts",
    "timestamp": "2025-09-01T20:52:58Z"
  },
  {
    "title": "The Federal Circuit's Tariff Ruling Highlights the Audacity of Trump's Power Grab",
    "description": "In ruling against the sweeping tariffs that President Donald Trump purported to impose under the International Emergency Economic Powers Act (IEEPA), the U.S. Court of Appeals for the Federal Circuit did not settle the question of whether that law authorizes …",
    "link": "https://biztoc.com/x/dc6c541909a2afb5",
    "timestamp": "2025-09-01T20:52:56Z"
  },
  {
    "title": "Maduro vows a ‘republic in arms’ if U.S. forces in the Caribbean attack Venezuela",
    "description": "Venezuelan President Nicolás Maduro on Monday said he “would constitutionally declare a republic in arms” if the South American country were attacked by forces that the United States government has deployed to the Caribbean.",
    "link": "https://www.pbs.org/newshour/world/maduro-vows-a-republic-in-arms-if-u-s-forces-in-the-caribbean-attack-venezuela",
    "timestamp": "2025-09-01T20:50:49Z"
  },
  {
    "title": "The Federal Circuit's Tariff Ruling Highlights the Audacity of Trump's Power Grab",
    "description": "Seven judges agreed that the president's assertion of unlimited authority to tax imports is illegal and unconstitutional.",
    "link": "https://reason.com/2025/09/01/the-federal-circuits-tariff-ruling-highlights-the-audacity-of-trumps-power-grab/",
    "timestamp": "2025-09-01T20:49:45Z"
  },
  {
    "title": "Trump family’s World Liberty stake surges to $5B after token unlock",
    "description": "The Trump family’s 22.5 billion tokens, while still reportedly locked, had a valuation of about $5 billion after a scheduled move from World Liberty Financial on Monday.",
    "link": "https://cointelegraph.com/news/trump-family-world-liberty-financial-token-unlock",
    "timestamp": "2025-09-01T20:45:29Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomketv.com",
    "link": "https://www.ketv.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:44:50Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomwtae.com",
    "link": "https://www.wtae.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:44:42Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomwmur.com",
    "link": "https://www.wmur.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:44:28Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomkcra.com",
    "link": "https://www.kcra.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:43:29Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomwlky.com",
    "link": "https://www.wlky.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:42:29Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomkoat.com",
    "link": "https://www.koat.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:42:28Z"
  },
  {
    "title": "Trump says he's awarding former New York mayor Rudy Giuliani the presidential medal of freedom",
    "description": "US president Donald Trump has said he’s awarding Rudolph Giuliani the Presidential Medal of Freedom, announcing the honour the day after his political ally and former New York mayor was badly injured in a traffic accident.",
    "link": "https://www.independent.ie/world-news/north-america/trump-says-hes-awarding-former-new-york-mayor-rudy-giuliani-the-presidential-medal-of-freedom/a1038717998.html",
    "timestamp": "2025-09-01T20:42:16Z"
  },
  {
    "title": "Trump says he’s awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump in a statement on social media called Giuliani the \"greatest Mayor in the history of New York City, and an equally great American Patriot.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-says-hes-awarding-former-new-york-mayor-rudy-giuliani-the-presidential-medal-of-freedom",
    "timestamp": "2025-09-01T20:42:11Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomkcci.com",
    "link": "https://www.kcci.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:41:53Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomkmbc.com",
    "link": "https://www.kmbc.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:41:34Z"
  },
  {
    "title": "Trump Takes Issue with Vaccine Companies in Sudden Change of Tune: 'I Want the Answer'",
    "description": "A Republican lawmaker who played a key role in the confirmation of Robert Kennedy Jr. applauded Trump's \"radical transparency.\"",
    "link": "https://www.westernjournal.com/trump-takes-issue-vaccine-companies-sudden-change-tune-want-answer/",
    "timestamp": "2025-09-01T20:41:32Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomwgal.com",
    "link": "https://www.wgal.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:41:29Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedomwcvb.com",
    "link": "https://www.wcvb.com/article/trump-rudy-giuliani-presidential-medal-of-freedom/65951150",
    "timestamp": "2025-09-01T20:40:42Z"
  },
  {
    "title": "Exclusive-US considering White House adviser Yared for IMF post, sources say",
    "description": "WASHINGTON (Reuters) -The Trump administration is considering recommending White House economic adviser Pierre Yared for the No. 2 job at the International...",
    "link": "https://www.yahoo.com/news/articles/exclusive-us-considering-white-house-204014231.html",
    "timestamp": "2025-09-01T20:40:14Z"
  },
  {
    "title": "‘I want the answer, and I want it NOW’: Trump demands drug companies justify success of COVID shots",
    "description": "'This development is a total game changer and is sending shock waves throughout the global establishment'",
    "link": "https://www.wnd.com/2025/09/i-want-answer-i-want-it-now-trump/",
    "timestamp": "2025-09-01T20:37:18Z"
  },
  {
    "title": "The West had its century. The future belongs to these leaders now",
    "description": "What Western media dismissed as a “club of autocrats” has grown into the Global South’s blueprint for a post-Western world. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623883-future-belongs-to-sco/",
    "timestamp": "2025-09-01T20:34:56Z"
  },
  {
    "title": "Trump to award embattled MAGA ally nation’s top civilian honor: ‘The greatest!’",
    "description": "After news that Rudy Giuliani was seriously injured in a crash Saturday night in New Hampshire, President Donald Trump said the former New York City mayor would receive the nation's highest civilian honor.Giuliani suffered fractured vertebrae and other injuri…",
    "link": "https://www.rawstory.com/trump-giuliani-2673945883/",
    "timestamp": "2025-09-01T20:34:11Z"
  },
  {
    "title": "Trump: Israel no longer commands Congress like it once did",
    "description": "President Donald Trump tells Daily Caller Israel’s once-dominant lobby in Congress has weakened: They may be winning the war, but they’re not winning the world of public relations, and it is hurting them.",
    "link": "https://www.israelnationalnews.com/news/414236",
    "timestamp": "2025-09-01T20:34:00Z"
  },
  {
    "title": "Concern mounts over Trump health as evidence he’s suffering series of ‘mini-strokes’ emerges - NewsBreak",
    "description": "Concern mounts over Trump health as evidence he’s suffering series of ‘mini-strokes’ emerges - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4208659583144-concern-mounts-over-trump-health-as-evidence-he-s-suffering-series-of-mini-strokes-emerges?_f=app_share&amp;pd=05bDv0Of&amp;lang=en_US&amp;send_time=1756758792&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.35.0.34%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-09-01T20:33:45Z"
  },
  {
    "title": "Maduro vows to declare a \"republic in arms\" if U.S. forces attack Venezuela",
    "description": "Venezuelan President Nicolás Maduro​ on Monday claimed eight U.S. military vessels \"with 1,200 missiles\" were targeting his country.",
    "link": "https://www.cbsnews.com/news/maduro-venezuela-us-troops-caribbean/",
    "timestamp": "2025-09-01T20:33:18Z"
  },
  {
    "title": "Trump says he's awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President Donald Trump says he’s awarding former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, announcing the honor two days after his longtime political ally was badly injured in a traffic accident",
    "link": "https://www.wsbradio.com/news/politics/trump-says-hes/EEPIO2EEXFBMDMQ5S4RIPVRLHU/",
    "timestamp": "2025-09-01T20:32:30Z"
  },
  {
    "title": "Lefty Admits He's Not a Medical Expert, but He Pretends to Be One to Attack President Trump's Health",
    "description": "We're not posting this entire 31-post thread because it's so ridiculous, but we have to show you how the Left...",
    "link": "https://twitchy.com/amy-curtis/2025/09/01/adam-cochran-trump-is-having-strokes-thread-n2418241",
    "timestamp": "2025-09-01T20:31:38Z"
  },
  {
    "title": "Chancellor Friedrich Merz Says He’s Now Planning for a Long War in Ukraine",
    "description": "The background issues highlight the inevitability of the latest developments. Before talking specifically about Ukraine, let’s first consider the individual parties within the so-called “coalition of the willing,” Great Britain, France and Germany.All three m…",
    "link": "https://freerepublic.com/focus/f-bloggers/4338057/posts",
    "timestamp": "2025-09-01T20:31:08Z"
  },
  {
    "title": "Chancellor Friedrich Merz Says He’s Now Planning for a Long War in Ukraine",
    "description": "The background issues highlight the inevitability of the latest developments. Before talking specifically about Ukraine, let’s first consider the individual parties within the so-called “coalition of the willing,” Great Britain, France and Germany.All three m…",
    "link": "https://freerepublic.com/focus/f-news/4338057/posts",
    "timestamp": "2025-09-01T20:31:08Z"
  },
  {
    "title": "Donald Trump Makes Major Rudy Giuliani Announcement After Ally's Car Crash",
    "description": "Former NYC mayor Rudy Giuliani was hospitalized with a fractured vertebrae and multiple cuts and bruises after a car crash Saturday.",
    "link": "https://biztoc.com/x/10400e08a81c3e41",
    "timestamp": "2025-09-01T20:30:36Z"
  },
  {
    "title": "‘Workers Over Billionaires’ Protests—In NYC, Boston, Chicago, More—Slammed By Trump’s DHS (Photos)",
    "description": "Here’s where and when protests against President Donald Trump and billionaire-influence over politics are expected to take place on Monday, organized by the AFL-CIO and dozens of partner organizations.",
    "link": "https://www.forbes.com/sites/conormurray/2025/09/01/workers-over-billionaires-protests-in-nyc-boston-chicago-more-slammed-by-trumps-dhs-photos/",
    "timestamp": "2025-09-01T20:29:46Z"
  },
  {
    "title": "Trump says he’s awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom",
    "description": "President Donald Trump said Monday he will award former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, the nation's highest civilian honor.",
    "link": "https://www.bostonherald.com/2025/09/01/trump-says-hes-awarding-former-new-york-mayor-rudy-giuliani-the-presidential-medal-of-freedom-2/",
    "timestamp": "2025-09-01T20:28:30Z"
  },
  {
    "title": "Donald Trump Makes Major Rudy Giuliani Announcement After Ally's Car Crash",
    "description": "Former NYC mayor Rudy Giuliani was hospitalized with a fractured vertebrae and multiple cuts and bruises after a car crash Saturday.",
    "link": "https://www.newsweek.com/trump-giuliani-presidential-medal-freedom-car-crash-2122845",
    "timestamp": "2025-09-01T20:23:32Z"
  },
  {
    "title": "From Trump tariffs to social programs, Mexico’s first female president takes stock in address",
    "description": "Mexico President Claudia Sheinbaum has celebrated her government’s handling of tumultuous relations with the Trump administration in her first state of the nation address.",
    "link": "https://www.pbs.org/newshour/world/from-trump-tariffs-to-social-programs-mexicos-first-female-president-takes-stock-in-address",
    "timestamp": "2025-09-01T20:21:08Z"
  },
  {
    "title": "1.2 million immigrants are gone from the U.S. workforce under Trump, preliminary data shows",
    "description": "As parades and other events celebrating the contributions of workers in the U.S. are being held for the Labor Day holiday, experts say President Donald Trump’s stepped-up immigration policies are impacting the nation’s labor force.",
    "link": "https://biztoc.com/x/fc2c60a6d930ec5e",
    "timestamp": "2025-09-01T20:19:46Z"
  },
  {
    "title": "'Big betrayal': Trump accused of breaking campaign promises by major union",
    "description": "Although President Donald Trump's administration likes to boast that it puts \"American workers first,\" several news reports published on Monday document the president's attacks on the rights of working people and labor unions.As longtime labor reporter Steven…",
    "link": "https://www.rawstory.com/trump-work-rights-2673945882/",
    "timestamp": "2025-09-01T20:19:35Z"
  },
  {
    "title": "Bessent expects Supreme Court to uphold legality of Trump's tariffs but eyes Plan B",
    "description": "ARLINGTON, Virginia (Reuters) -U.S. Treasury Secretary Scott Bessent on Monday expressed confidence that the Supreme Court will uphold President Donald...",
    "link": "https://www.yahoo.com/news/articles/bessent-expects-supreme-court-uphold-201553196.html",
    "timestamp": "2025-09-01T20:15:53Z"
  },
  {
    "title": "1.2 million immigrants are gone from the U.S. workforce under Trump, preliminary data shows",
    "description": "As parades and other events celebrating the contributions of workers in the U.S. are being held for the Labor Day holiday, experts say President Donald Trump’s stepped-up immigration policies are impacting the nation’s labor force.",
    "link": "https://www.pbs.org/newshour/nation/1-2-million-immigrants-are-gone-from-the-u-s-workforce-under-trump-preliminary-data-shows",
    "timestamp": "2025-09-01T20:13:45Z"
  },
  {
    "title": "India's Modi cozies up with Putin, Xi in statement against Trump 'bullying'",
    "description": "Indian Prime Minister Narendra Modi held warm meetings with Russian President Vladimir Putin and Chinese President Xi Jinping on Monday, sending Washington a clear message after President Donald Trump's heavy tariffs against India went into effect last week. …",
    "link": "https://freerepublic.com/focus/f-news/4338051/posts",
    "timestamp": "2025-09-01T20:07:43Z"
  },
  {
    "title": "Americans Take to the Streets for 1,000+ 'Workers Over Billionaires' Labor Day Rallies",
    "description": "This is a developing story... Please check back for possible updates.Americans turned out across the United States on Monday for more than 1,000 demonstrations against President Donald Trump and other oligarchs \"to reclaim worker power against billionaires wh…",
    "link": "https://www.commondreams.org/news/workers-over-billionaires-labor-day",
    "timestamp": "2025-09-01T20:07:42Z"
  },
  {
    "title": "US Treasury Secretary Bessent defends Trump’s firing of Lisa Cook, says Fed ‘made lots of mistakes’",
    "description": "Bessent said he believed that Cook should be removed or step down if the allegations against her are true, and noted that she had not denied them.",
    "link": "https://indianexpress.com/article/world/treasury-secretary-bessent-defends-trumps-firing-of-lisa-cook-10225009/",
    "timestamp": "2025-09-01T20:04:42Z"
  },
  {
    "title": "Trump praises Democratic DC mayor for working with his administration on crime crackdown",
    "description": "Trump credits D.C. Mayor Muriel Bowser's collaboration on a crime crackdown in Washington, claiming the city is now a \"crime-free zone\" after National Guard deployment.",
    "link": "https://www.foxnews.com/politics/trump-praises-democratic-dc-mayor-working-administration-crime-crackdown",
    "timestamp": "2025-09-01T20:01:31Z"
  },
  {
    "title": "Fighting Authoritarianism: A Democratic Imperative (David Atkins/Washington Monthly)",
    "description": "David Atkins / Washington Monthly:\nFighting Authoritarianism: A Democratic Imperative  —  Despite what some political consultants advise, anti-Trump candidates can't just focus on the economy.  They need to put preserving democracy front and center. … Donald …",
    "link": "https://www.memeorandum.com/250901/p55",
    "timestamp": "2025-09-01T20:00:25Z"
  },
  {
    "title": "Camera-shy on golf trip amid rumors and Vance brutal bid for power...",
    "description": "Donald Trump was seen leaving the White House early Sunday morning, heading to Trump National Golf Club in Sterling, Virginia, at around 10 a.m.",
    "link": "https://www.the-express.com/news/politics/182128/trump-camerashy-golf-trip-vance-power",
    "timestamp": "2025-09-01T20:00:04Z"
  },
  {
    "title": "Trump: 'Crooked' Comey, Brennan 'Should Be Arrested'",
    "description": "President Donald Trump has no issue with sending Obama-era FBI Director James Comey and CIA chief John Brennan — one of the 51 \"spies who lie\"— to prison. \"I don't know if there's going to be\" arrests, Trump told The Daily Caller in excerpts of an interview t…",
    "link": "https://freerepublic.com/focus/f-news/4338049/posts",
    "timestamp": "2025-09-01T19:59:19Z"
  },
  {
    "title": "54 shot, 7 killed in Chicago weekend bloodbath after Pritzker claims Trump, National Guard not needed",
    "description": "Bodies are piling up on the streets of Chicago over Labor Day weekend – with 54 shot, including seven killed, as President Trump and Gov. Pritzker spar over sending the National Guard into the Windy City. At least 32 separate shootings occurred in Chicago bet…",
    "link": "https://nypost.com/2025/09/01/us-news/54-shot-7-killed-in-chicago-weekend-bloodbath-after-pritzker-claims-trump-national-guard-not-needed/",
    "timestamp": "2025-09-01T19:58:19Z"
  },
  {
    "title": "Texas Trucking’s Silent Threat: Non-English Speaking Drivers Surge as Crashes Mount Nationwide",
    "description": "A report published last week on social media by American Truckers United shows that Texas companies lead the nation in employing drivers who are not proficient in reading and understanding English. Recent crashes, including a multi-fatality crash in the state…",
    "link": "https://www.breitbart.com/border/2025/09/01/texas-truckings-silent-threat-non-english-speaking-drivers-surge-as-crashes-mount-nationwide/",
    "timestamp": "2025-09-01T19:58:14Z"
  },
  {
    "title": "World Liberty Financial (WLFI) lands on major exchanges on day 1, token unlocks dampen gains",
    "description": "World Liberty Financial (WLFI) price has dropped 20% after its debut despite strong trading volumes. Trump family is pushing WLFI token as the backbone of their new DeFi ecosystem. Unlock fears and governance doubts weigh on investor sentiment. World Liberty …",
    "link": "https://coinjournal.net/news/world-liberty-financial-wlfi-lands-on-major-exchanges-on-day-1-token-unlocks-dampen-gains/",
    "timestamp": "2025-09-01T19:57:41Z"
  },
  {
    "title": "It's now harder to qualify for SNAP benefits. That could be good for retail giants like Walmart.",
    "description": "Millions could lose SNAP benefits under new Trump administration rules, but retailers like Walmart may benefit from shifting grocery spending.",
    "link": "https://www.businessinsider.com/snap-cuts-boost-walmart-sales-low-income-shoppers-seek-savings-2025-9",
    "timestamp": "2025-09-01T19:57:13Z"
  }
]