[
  {
    "title": "Automakers warn that Trump tariffs will hike vehicle prices as much as 25%",
    "description": "Many in the industry warn that the tariffs will disrupt the integrated supply chain across North America that has been in place for more than 25 years.",
    "link": "https://www.japantimes.co.jp/business/2025/03/05/markets/automakers-trump-tariffs-prices/",
    "timestamp": "2025-03-04T22:40:00Z"
  },
  {
    "title": "Why Is It So Hard to Watch this Oscar-Winning Documentary?",
    "description": "“No Other Land” is running into the same barriers other Palestinian films have.",
    "link": "https://www.yesmagazine.org/political-power/2025/03/04/no-other-land-oscar-win",
    "timestamp": "2025-03-04T22:38:17Z"
  },
  {
    "title": "Ports sale offers Panama way out of Trump row: experts",
    "description": "The decision by Hong Kong firm CK Hutchison to sell its Panama ports to a US-led consortium provides the Central American country with a convenient way out of its standoff with President Donald Trump, experts said Tuesday. Trump has been fixated on the questi…",
    "link": "https://www.digitaljournal.com/world/ports-sale-offers-panama-way-out-of-trump-row-experts/article",
    "timestamp": "2025-03-04T22:37:21Z"
  },
  {
    "title": "China to unveil 2025 growth goals eyeing trade war woes",
    "description": "China’s leadership will on Wednesday unveil their growth goals for the coming year as they eye a mounting trade war with the United States and deepening economic doldrums at home. Thousands of delegates will congregate in the morning for the opening session o…",
    "link": "https://www.digitaljournal.com/world/china-to-unveil-2025-growth-goals-eyeing-trade-war-woes/article",
    "timestamp": "2025-03-04T22:37:20Z"
  },
  {
    "title": "Canada, Mexico, and China respond to US tariffs",
    "description": "After a monthlong delay, President Donald Trump announced new tariffs on Mexico, Canada, and China. These countries are fighting back.",
    "link": "https://www.businessinsider.com/canada-mexico-and-china-respond-to-us-tariffs-2025-3",
    "timestamp": "2025-03-04T22:37:00Z"
  },
  {
    "title": "How Is Fentanyl Entering the US? Donald Trump's Tariffs Target Smugglers",
    "description": "The president said the flow of the illicit opioid is one of the reasons for imposing tariffs on trading partners.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-fentanyl-drug-canada-mexico-china-2039509",
    "timestamp": "2025-03-04T22:35:39Z"
  },
  {
    "title": "Trump’s tariffs could plunge Mexico and Canada into a recession | CNN",
    "description": "US President Donald Trump’s tariffs on Canada and Mexico could severely impact the economies of both countries, potentially slowing down production of certain goods, raising prices on products and sparking fears of a recession, analysts warn.",
    "link": "https://www.cnn.com/2025/03/04/americas/trump-tariffs-mexico-canada-recession-intl-latam/index.html",
    "timestamp": "2025-03-04T22:35:33Z"
  },
  {
    "title": "Trump crash stonks, Republicans run away",
    "description": "Despite his administration being laser-focused on deregulation and upper-class tax cuts, Trump’s idiotic trade war continues to tank markets as the country heads straight for recession: Stocks tumbled on Tuesday as President Trump’s broad tariffs against Cana…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/trump-crash-stonks-republicans-run-away",
    "timestamp": "2025-03-04T22:35:00Z"
  },
  {
    "title": "A Russia-Ukraine Peace Deal Could Lower Gas Prices, Says Soros Fund CEO",
    "description": "Soros Fund Management CEO Dawn Fitzpatrick shares her view on the Ukraine-Russia peace talk and its impact on U.S. economy.",
    "link": "https://observer.com/2025/03/russia-ukraine-peace-deal-oil-prices-soros-fund-ceo/",
    "timestamp": "2025-03-04T22:34:54Z"
  },
  {
    "title": "Exclusive -- White House: 'Tailwinds Behind' Trump Ahead of Primetime Address to Congress",
    "description": "WASHINGTON, DC – \"Tailwinds\" are behind President Donald Trump as he is set to deliver his joint congressional address Tuesday night, the White House tells Breitbart News.\nThe post Exclusive — White House: ‘Tailwinds Behind’ Trump Ahead of Primetime Address t…",
    "link": "https://www.breitbart.com/politics/2025/03/04/exclusive-wh-tailwinds-behind-trump-ahead-of-address-to-congress/",
    "timestamp": "2025-03-04T22:34:52Z"
  },
  {
    "title": "Poll and analysis: Americans most want to hear Trump talk about lowering prices",
    "description": "Republicans are more likely than Democrats to say they'll watch President Trump's joint address to Congress.",
    "link": "https://www.cbsnews.com/news/trump-joint-address-americans-want-him-to-talk-about-lowering-prices/",
    "timestamp": "2025-03-04T22:34:18Z"
  },
  {
    "title": "Japanese Firms Boost Exports to US to Get Ahead of Tariffs",
    "description": "Japanese companies are stockpiling goods in the US to lower the impact from any tariffs President Donald Trump might levy after hitting China, Canada and Mexico.",
    "link": "https://financialpost.com/pmn/business-pmn/japanese-firms-boost-exports-to-us-to-get-ahead-of-tariffs",
    "timestamp": "2025-03-04T22:34:07Z"
  },
  {
    "title": "Flypast and concert for VE Day 80th commemorations",
    "description": "There will be four days of events in May commemorating the 80th anniversary of VE Day.",
    "link": "https://www.bbc.com/news/articles/crewnnzv8g7o",
    "timestamp": "2025-03-04T22:34:01Z"
  },
  {
    "title": "Trump’s tariff chaos, briefly explained",
    "description": "And what a ride it was. | Romain Perrocheau/AFP via Getty Images\nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here.\nWelcome to T…",
    "link": "https://biztoc.com/x/5a7c01e1ce6aa967",
    "timestamp": "2025-03-04T22:33:48Z"
  },
  {
    "title": "Looming trade war heaps pressure on Thai shipments",
    "description": "<p>Thailand should shift its attention from celebrating rising export figures to prioritising the trade balance, analysing it country-by-country, says the Thai National Shippers' Council (TNSC).</p>",
    "link": "https://www.bangkokpost.com/business/general/2972963/looming-trade-war-heaps-pressure-on-thai-shipments",
    "timestamp": "2025-03-04T22:33:00Z"
  },
  {
    "title": "Trump Adviser Alina Habba Suggests Fired Veterans Did Not ‘Actually Work’",
    "description": "\"[P]erhaps they’re not fit to have a job at this moment,\" the attorney said.",
    "link": "https://www.huffpost.com/entry/trump-adviser-alina-habba-suggests-fired-veterans-did-not-actually-work_n_67c76740e4b0b4e940709b0a",
    "timestamp": "2025-03-04T22:32:26Z"
  },
  {
    "title": "Exclusive – House Majority Whip Tom Emmer: Trump Keeping Promises 'At a Breakneck Pace'",
    "description": "President Donald Trump can be proud of his historic first 43 days in office, House Majority Whip Tom Emmer (R-MN) told Breitbart News in an exclusive interview.\nThe post Exclusive – House Majority Whip Tom Emmer: Trump Keeping Promises ‘At a Breakneck Pace’ a…",
    "link": "https://www.breitbart.com/politics/2025/03/04/exclusive-house-majority-whip-tom-emmer-trump-keeping-promises-at-a-breakneck-pace/",
    "timestamp": "2025-03-04T22:32:25Z"
  },
  {
    "title": "Is Trump and Musk's goal of sending humans to Mars feasible?",
    "description": "Experts weigh in on whether President Donald Trump’s lofty goal of sending humans to Mars and back is feasible during his second term.",
    "link": "https://abcnews.go.com/US/trump-musks-goal-sending-humans-mars-feasible/story?id=119386708",
    "timestamp": "2025-03-04T22:31:52Z"
  },
  {
    "title": "Battle over ‘inspirational’ new pro-Trump sign ignites in NY court: ‘Blatant attack on free expression’",
    "description": "A company that won an upstate legal battle to display a giant “Vote for Trump” sign on one of its buildings is back in court — over the new “America Loves Trump” display it wants in its place.…",
    "link": "https://nypost.com/2025/03/04/us-news/battle-over-inspirational-new-pro-trump-sign-ignites-in-ny-court-blatant-attack-on-free-expression/",
    "timestamp": "2025-03-04T22:31:10Z"
  },
  {
    "title": "Texas measles outbreak fueled by distrust in public health and personal choice",
    "description": "Doctors worry anti-vaccine rhetoric from Robert F. Kennedy Jr. will make things worse as childhood vaccination rates decline.",
    "link": "https://www.13abc.com/2025/03/04/texas-measles-outbreak-fueled-by-distrust-public-health-personal-choice/",
    "timestamp": "2025-03-04T22:30:40Z"
  },
  {
    "title": "DOGE eliminated the US government’s tech experts – what has been lost?",
    "description": "The Trump administration’s latest move to improve government efficiency has purged tech consultants that worked to improve government efficiency",
    "link": "https://www.newscientist.com/article/2470902-doge-eliminated-the-us-governments-tech-experts-what-has-been-lost/",
    "timestamp": "2025-03-04T22:30:37Z"
  },
  {
    "title": "DOGE axes $6 million democracy and patriotism grant for UM Mansfield Center",
    "description": "The Department of Government Efficiency has canceled a $6 million Department of Defense grant to UM's Mansfield Center.",
    "link": "https://missoulian.com/news/local/education/article_92317470-f935-11ef-8da2-239a91303c8f.html",
    "timestamp": "2025-03-04T22:30:00Z"
  },
  {
    "title": "Curing the Discontents of Global Health",
    "description": "By guest contributor Olusoji Adeyi Global health financiers and dependents are reeling from a barrage of decisions by the new government in…\nThe post Curing the Discontents of Global Health appeared first on Speaking of Medicine and Health.",
    "link": "https://speakingofmedicine.plos.org/2025/03/04/curing-the-discontents-of-global-health/",
    "timestamp": "2025-03-04T22:27:31Z"
  },
  {
    "title": "Europe announces unprecedented $840 billion rearmament plan to tackle ‘grave’ threats, sending defense giants BAE and Thales soaring - NewsBreak",
    "description": "Europe announces unprecedented $840 billion rearmament plan to tackle ‘grave’ threats, sending defense giants BAE and Thales soaring - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3839505426976-europe-announces-unprecedented-840-billion-rearmament-plan-to-tackle-grave-threats-sending-defense-giants-bae-and-thales-soaring?s=a2&amp;share_destination_id=MTU1MTgxMjAwLTE3NDExMjY5ODA5NzM%3D&amp;pd=0AV7iawk&amp;hl=en_US&amp;send_time=1741126980&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v4%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v7",
    "timestamp": "2025-03-04T22:26:58Z"
  },
  {
    "title": "Trump’s tariff chaos, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff. Donald Trump paused military aid to Ukraine on Monday …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/402576/trumps-tariff-chaos-briefly-explained",
    "timestamp": "2025-03-04T22:25:52Z"
  },
  {
    "title": "King Charles Visits HMS Prince of Wales Ahead of Carrier Strike Group Deployment",
    "description": "King Charles III flew to the aircraft carrier on board a Royal Navy Merlin HM2 direct from his Sandringham Estate, where he recently hosted President Zelenskyy of Ukraine. The King’s visit to the ship was scheduled as its crew prepares for the upcoming Carrie…",
    "link": "https://theaviationist.com/2025/03/04/king-charles-visits-hms-prince-of-wales/",
    "timestamp": "2025-03-04T22:24:46Z"
  },
  {
    "title": "Before Trump's Address, Senate Democrats Hold Up Photos of Federal Workers Who've Been Fired",
    "description": "Democrats have been doing all they can to protest President Donald Trump's address to a joint session of Congress Tuesday night. Some have made the courageous decision not to attend at all. Democrat congresswomen will be wearing pink to show their support for…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302103/posts",
    "timestamp": "2025-03-04T22:23:39Z"
  },
  {
    "title": "‘It's going to be bad’: Economists paint bleak picture as trade war erupts",
    "description": "Business leaders and economists reacted with dismay Tuesday after United States President Donald Trump launched a North American trade war that is expected to have severe consequences for the Canadian economy.\n“It’s going to be bad,” said Carl Gomez, the chie…",
    "link": "https://biztoc.com/x/8bec75570741369d",
    "timestamp": "2025-03-04T22:23:23Z"
  },
  {
    "title": "Angry, betrayed and anxious: Canadians react to Trump's tariffs and annexation threat",
    "description": "A survey gauging the emotional temperature of Canadians confirms what most already know: U.S. President Donald Trump is making people on this side of the border mad.",
    "link": "https://biztoc.com/x/5998beb0e7c52252",
    "timestamp": "2025-03-04T22:23:09Z"
  },
  {
    "title": "Meet The Three Dems Handpicked To Rebut Trump’s ‘American Dream’ Speech",
    "description": "The three Democrat lawmakers tasked with responding to President Donald Trump's Tuesday speech have supported a slew of radical policy positions.",
    "link": "https://dailycaller.com/2025/03/04/meet-three-dems-handpicked-rebut-trump-american-dream-speech/",
    "timestamp": "2025-03-04T22:23:04Z"
  },
  {
    "title": "Melania Trump's Guest List For President's Congressional Address Underscores Vast Social Differences From Biden Era",
    "description": "First Lady Melania Trump has invited over a dozen guests to her husband's address to Congress who have personal experiences that underscore key Trump administration policies that differ by worlds from his predecessor's Joe Biden.\nPresident Donald Trump's addr…",
    "link": "https://biztoc.com/x/03b1d3ec3fd15c76",
    "timestamp": "2025-03-04T22:23:00Z"
  },
  {
    "title": "How battleground Trump voters are viewing the opening weeks of the administration: From the Politics Desk",
    "description": "Ahead of President Donald Trump’s address to Congress, we took the pulse of how a group of voters who helped send him back to the White House are viewing the opening weeks of his term.",
    "link": "https://www.nbcnews.com/politics/battleground-trump-voters-view-administration-politics-desk-rcna194775",
    "timestamp": "2025-03-04T22:22:08Z"
  },
  {
    "title": "Reddit Founder Alexis Ohanian Joins TikTok Bid, Wants to Bring Video App On-Chain",
    "description": "Ohanian is part of a push that aims to give power and data back to TikTok creators—and he wants to use blockchain to do it.",
    "link": "https://decrypt.co/308649/alexis-ohanian-tiktok-bid-onchain",
    "timestamp": "2025-03-04T22:21:07Z"
  },
  {
    "title": "Elbows up! 'Seriously angry grannies' and 'menopause mafia' protest Trump in Ottawa",
    "description": "Heavy snow did not deter several dozen protesters from demonstrating outside the U.S. Embassy in Ottawa on Tuesday to voice their opposition to President Donald Trump's policies towards Canada, Ukraine and the liberal world order.",
    "link": "https://www.cbc.ca/news/canada/ottawa/elbows-up-seriously-angry-grannies-and-menopause-mafia-protest-trump-in-ottawa-1.7474345",
    "timestamp": "2025-03-04T22:20:55Z"
  },
  {
    "title": "How tariffs will impact everyday items",
    "description": "Many items will likely see price hikes in the coming weeks.",
    "link": "https://www.clickondetroit.com/news/local/2025/03/04/how-tariffs-will-impact-everyday-items/",
    "timestamp": "2025-03-04T22:20:11Z"
  },
  {
    "title": "How Trump's foreign policy is reshaping the world order",
    "description": "After the Trump-Zelenskyy blow-up on Friday, European leaders held emergency talks in London to put together a roadmap to peace. <br><br>Then, on Tuesday, European Commission president Ursula von der Leyen announced a proposal called ReArm Europe. The roughly…",
    "link": "https://www.npr.org/2025/03/04/1235758688/trumps-ukraine-stance-could-upend-global-politics",
    "timestamp": "2025-03-04T22:19:11Z"
  },
  {
    "title": "Arab states adopt Egyptian alternative to Trump's 'Gaza Riviera'",
    "description": "While hurdles remain, Egypt's $53 billion reconstruction plan would avoid displacing Palestinians from the enclave.",
    "link": "https://www.japantimes.co.jp/news/2025/03/05/world/politics/arab-states-egypt-trump-gaza-riviera/",
    "timestamp": "2025-03-04T22:19:00Z"
  },
  {
    "title": "Trump tariff compromises with Mexico and Canada teased by Commerce Secretary Lutnick",
    "description": "Commerce Secretary Howard Lutnick said a compromise with Canada and Mexico on Trump's controversial tariffs will \"probably\" come \"tomorrow.\"",
    "link": "https://www.cnbc.com/2025/03/04/trump-tariff-compromise-canada-mexico-commerce-lutnick.html",
    "timestamp": "2025-03-04T22:18:53Z"
  },
  {
    "title": "‘I LOST MY JOB!’: 12 Trump voters who didn’t expect his policies to affect *them*",
    "description": "An increasing number of voters who helped elect President Donald Trump are voicing regret across the internet after the new administration's policies negatively affected them. Leftists are collecting examples and showcasing them in an \"I told you so\" parade, …",
    "link": "https://www.dailydot.com/culture/trump-voter-regret/",
    "timestamp": "2025-03-04T22:18:40Z"
  },
  {
    "title": "So, That's Why Zelensky Thought He Could Act Like a Spoiled Brat in Front of Trump",
    "description": "As Jeff wrote today, Ukrainian President Volodymyr Zelensky caved. Following his disastrous Oval Office meeting last Friday, he’s crawling back to President Donald Trump and will reportedly sign the minerals deal after hurling that agreement into doubt. Trump…",
    "link": "https://freerepublic.com/focus/f-news/4302100/posts",
    "timestamp": "2025-03-04T22:18:06Z"
  },
  {
    "title": "How Will Trump’s Tariffs Affect Art Supplies in the US?",
    "description": "\"We expect prices to rise or severely limit the colors we can offer artists,\" said Roger Danilo Carmona of Manhattan’s Kremer Pigments.",
    "link": "http://hyperallergic.com/988525/how-will-trump-tariffs-affect-art-supplies-in-the-us/",
    "timestamp": "2025-03-04T22:17:22Z"
  },
  {
    "title": "Several Canadian provinces ban US alcohol in tariff response",
    "description": "Multiple Canadian provinces, including Ontario and Quebec, banned the sale of US alcohol on Tuesday, part of a broad national retaliation against import tariffs imposed by US President Donald Trump.  “This is an enormous hit to American producers,” Ontario Pr…",
    "link": "https://www.digitaljournal.com/world/several-canadian-provinces-ban-us-alcohol-in-tariff-response/article",
    "timestamp": "2025-03-04T22:17:20Z"
  },
  {
    "title": "Dems Scripted Their Response To Trump’s Speech Before Hearing It And They Don’t Care If You Know",
    "description": "Senate Dems are doing roughly the equivalent of those 'copy and paste this or something bad will happen to you' emails from middle school.",
    "link": "https://thefederalist.com/2025/03/04/dems-scripted-their-response-to-trumps-speech-before-hearing-it-and-they-dont-care-if-you-know/",
    "timestamp": "2025-03-04T22:16:54Z"
  },
  {
    "title": "‘It's going to be bad’: Economists paint bleak picture as trade war erupts",
    "description": "Economists say the North American trade war is expected to have severe consequences for the Canadian economy. Find out more.",
    "link": "https://financialpost.com/news/economy/economists-paint-bleak-picture-trade-war-erupts",
    "timestamp": "2025-03-04T22:16:07Z"
  },
  {
    "title": "Global stocks tumble as Trump proceeds with more US tariffs",
    "description": "NEW YORK: Stock markets were in gloomy mode Tuesday (Mar 4) as China, Mexico and Canada hit back at",
    "link": "https://www.channelnewsasia.com/business/trump-tariffs-global-stocks-tumble-wall-street-europe-markets-4977216",
    "timestamp": "2025-03-04T22:16:00Z"
  },
  {
    "title": "Selective outrage? Firestorm erupts over Trump-Zelensky clash, but critics say Obama & Biden’s public humiliation of Netanyahu was far worse; here's what happened then",
    "description": "There is a lot of ongoing controversy surrounding the meeting between Donald Trump and Volodymyr Zelensky in the presence of VP JD Vance and a few others. However, some critics are saying that this is nothing compared to what happened between Netanyahu and Ob…",
    "link": "https://economictimes.indiatimes.com/news/international/us/selective-outrage-firestorm-erupts-over-trump-zelensky-clash-but-critics-say-obama-bidens-public-humiliation-of-netanyahu-was-far-worse-heres-what-happened-then/articleshow/118718894.cms",
    "timestamp": "2025-03-04T22:15:29Z"
  },
  {
    "title": "Maria Bartiromo Flips Out After Dodge Dealer Says Trump Tariffs Hurt Sales: ‘Maybe Dodge Should Start Building Them Here!’",
    "description": "Maria Bartiromo was displeased after an auto dealer said President Donald Trump's tariffs are hurting business.\nThe post Maria Bartiromo Flips Out After Dodge Dealer Says Trump Tariffs Hurt Sales: ‘Maybe Dodge Should Start Building Them Here!’ first appeared …",
    "link": "https://www.mediaite.com/tv/maria-bartiromo-flips-out-after-dodge-dealer-says-trump-tariffs-hurt-sales-maybe-dodge-should-start-building-them-here/",
    "timestamp": "2025-03-04T22:15:21Z"
  },
  {
    "title": "Can Tesla's EVs win over India's price-conscious car buyers?",
    "description": "The EV giant has begun hiring in India and is reportedly hunting for showrooms in Delhi and Mumbai.",
    "link": "https://www.bbc.com/news/articles/crkn28dpl4no",
    "timestamp": "2025-03-04T22:14:23Z"
  },
  {
    "title": "U.S., Ukraine now plan to sign minerals deal, sources say",
    "description": "The deal from last week offered Kyiv no explicit security guarantees but gave the U.S. access to Ukraine's natural resources.",
    "link": "https://www.japantimes.co.jp/news/2025/03/05/world/politics/us-ukraine-minerals-deal/",
    "timestamp": "2025-03-04T22:14:00Z"
  },
  {
    "title": "U.S., Ukraine now plan to sign minerals deal, sources say",
    "description": "The deal from last week offered Kyiv no explicit security guarantees but gave the U.S. access to Ukraine's natural resources.",
    "link": "https://www.japantimes.co.jp/news/2025/03/05/world/politics/ukraine-us-minerals-deal/",
    "timestamp": "2025-03-04T22:14:00Z"
  },
  {
    "title": "Texas measles outbreak fueled by distrust in public health and personal choice",
    "description": "Doctors worry anti-vaccine rhetoric from Robert F. Kennedy Jr. will make things worse as childhood vaccination rates decline.",
    "link": "https://www.kswo.com/2025/03/04/texas-measles-outbreak-fueled-by-distrust-public-health-personal-choice/",
    "timestamp": "2025-03-04T22:13:36Z"
  },
  {
    "title": "China eyes hefty stimulus as it reels from Trump tariffs",
    "description": "A key meeting begins to revive China's lagging economy, which is now facing a trade war with the US.",
    "link": "https://www.bbc.com/news/articles/c8x4vj8rj9wo",
    "timestamp": "2025-03-04T22:13:05Z"
  },
  {
    "title": "Why This Measles Outbreak Is Different",
    "description": "America’s regression could change the experience of childhood.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/measles-outbreak-death-texas-new-mexico/681920/",
    "timestamp": "2025-03-04T22:13:00Z"
  },
  {
    "title": "A potential $110B economic hit: How Trump’s tariffs could mean rising costs for families, strain for states",
    "description": "The shock will fall hardest on consumers, certain industries, and states that are sensitive to supply-chain disruptions.",
    "link": "https://theconversation.com/a-potential-110b-economic-hit-how-trumps-tariffs-could-mean-rising-costs-for-families-strain-for-states-251028",
    "timestamp": "2025-03-04T22:12:39Z"
  },
  {
    "title": "Trump is making his big speech to Congress. Here’s how to watch",
    "description": "President Donald Trump is set to address Congress — and the rest of the country — on Tuesday evening, his first prime-time address since the start of his second term. \nA president addressing Congress each year is routine. However, from deep cuts to federal ag…",
    "link": "https://biztoc.com/x/0919877a827f0207",
    "timestamp": "2025-03-04T22:12:23Z"
  },
  {
    "title": "Canadian PM Justin Trudeau slams Trump’s tariffs, says US is appeasing Putin while launching a trade war against Canada",
    "description": "TORONTO — Canadian Prime Minister Justin Trudeau called American tariffs “very dumb” and said that U.S. President Donald Trump is appeasing Russia while launching a trade war against Canada.\nIn a blunt news conference during his final days in office, Trudeau …",
    "link": "https://biztoc.com/x/84bed050c84caf85",
    "timestamp": "2025-03-04T22:12:02Z"
  },
  {
    "title": "How to watch the Trump’s joint address to Congress for free—and without cable",
    "description": "How to watch the Trump’s joint address to Congress for free—and without cable\nDonald Trump will address Congress on Tuesday.\nWIN MCNAMEE/POOL/AFP via Getty Images",
    "link": "https://biztoc.com/x/5745cfb6ba35184e",
    "timestamp": "2025-03-04T22:12:02Z"
  },
  {
    "title": "Bitcoin reclaims $88k to reverse the day’s losses amid market turbulence",
    "description": "Bitcoin (BTC) climbed back to $88,900 on March 5 after dipping to a daily low of $81,500 earlier in the day, recovering most of the losses recorded over the past 24 hours. Based on CryptoSlate data, Bitcoin was trading at $87,524 as of press time , up 2% for …",
    "link": "https://cryptoslate.com/bitcoin-reclaims-88k-to-reverse-the-days-losses-amid-market-turbulence/",
    "timestamp": "2025-03-04T22:10:59Z"
  },
  {
    "title": "Who is giving rebuttal after Donald Trump's speech? Elissa Slotkin takes spotlight",
    "description": "Michigan Democrat Elissa Slotkin will give the party's rebuttal to President Donald Trump's speech to congress on Tuesday.",
    "link": "https://www.fox2detroit.com/news/who-is-giving-rebuttal-after-donald-trumps-speech-elissa-slotkin-takes-spotlight",
    "timestamp": "2025-03-04T22:10:51Z"
  },
  {
    "title": "Sweeping tariffs are finally here. Americans say they aren’t ready — especially this group.",
    "description": "The sweeping tariffs that President Donald Trump has been talking about since he was on the campaign trail are finally here, and they’re arriving at a tough time for many Americans.",
    "link": "https://www.marketwatch.com/story/sweeping-tariffs-are-finally-here-americans-say-they-arent-ready-especially-this-group-b9b07dde",
    "timestamp": "2025-03-04T22:09:00Z"
  },
  {
    "title": "The Global Trade War Is Officially On! Trudeau Calls Trump “Dumb” And China Promises To Fight “To The Bitter End”",
    "description": "I can hardly believe how rapidly economic events are moving now.  The global trade war that has just erupted is going to be immensely painful.  If you doubt this, just read all the way to the end of this article. There is a reason why the Dow Jones Industrial…",
    "link": "http://theeconomiccollapseblog.com/the-global-trade-war-is-officially-on-trudeau-calls-trump-dumb-and-china-promises-to-fight-to-the-bitter-end/",
    "timestamp": "2025-03-04T22:07:23Z"
  },
  {
    "title": "Trump vowed to end surprise medical bills. The team working on that just got slashed",
    "description": "Trump's first round of staff cuts to federal agencies eliminated dozens of positions at the Center for Consumer Information and Insurance Oversight, in charge of implementing the No Surprises Act.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/03/04/nx-s1-5318038/trump-cms-layoffs-surprise-medical-bills",
    "timestamp": "2025-03-04T22:06:53Z"
  },
  {
    "title": "Postcards from America (03.05.25)",
    "description": "\"Here is the world. Beautiful and terrible things will happen. Don't be afraid.\"",
    "link": "https://www.patheos.com/blogs/slacktivist/2025/03/04/postcards-from-america-03-05-25/",
    "timestamp": "2025-03-04T22:06:37Z"
  },
  {
    "title": "Apple launches legal challenge over UK ‘back door’ order",
    "description": "Apple is intensifying its battle with the British government, which has demanded a \"back door\" into its most secure iCloud storage system…\nThe post Apple launches legal challenge over UK ‘back door’ order appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/03/04/apple-launches-legal-challenge-over-uk-back-door-order/",
    "timestamp": "2025-03-04T22:05:15Z"
  },
  {
    "title": "Elon Musk urges Trump to 'think about' pardoning George Floyd's murderer (David Edwards/Raw Story)",
    "description": "David Edwards / Raw Story:\nElon Musk urges Trump to ‘think about’ pardoning George Floyd's murderer  —  Elon Musk, the billionaire face of DOGE, urged officials like President Donald Trump to “think about” pardoning the former police officer who shocked the w…",
    "link": "https://www.memeorandum.com/250304/p136",
    "timestamp": "2025-03-04T22:05:00Z"
  },
  {
    "title": "Canada, Mexico tariff deal could be in works, Lutnick suggests. Here’s what markets will watch.",
    "description": "A deal to roll back U.S. tariffs on Canadian and Mexican goods may be in the works, a top Trump administration official suggested Tuesday, as President Donald Trump prepared to give a major address to Congress.",
    "link": "https://www.marketwatch.com/story/canada-mexico-tariff-deal-could-be-in-works-lutnick-suggests-heres-what-markets-will-watch-b3c0b90d",
    "timestamp": "2025-03-04T22:05:00Z"
  },
  {
    "title": "Stranded US astronauts to return home after nine months in space",
    "description": "The pair are waiting for their replacements to arrive at the International Space Station next week before they can check out.",
    "link": "https://www.abc.net.au/news/2025-03-05/us-stranded-astronauts-to-return-home/105011474",
    "timestamp": "2025-03-04T22:04:48Z"
  },
  {
    "title": "Who is Dr. Jay Bhattacharya? Trump’s pick to lead the NIH faces Senate confirmation hearing",
    "description": "Dr. Jay Bhattacharya, who opposed Covid lockdowns, is set to appear at a Senate confirmation hearing on Wednesday for his nomination by President Donald Trump to lead the National Institutes of Health.",
    "link": "https://www.nbcnews.com/health/health-news/trump-pick-dr-bhattacharya-nih-senate-hearing-research-rcna194524",
    "timestamp": "2025-03-04T22:04:39Z"
  },
  {
    "title": "In Lake Placid, a pair of athletes are sliding for Ukraine. They hope better days are ahead",
    "description": "Ukrainian skeleton athletes Vladyslav Heraskevych and Yaroslav Lavreniuk are hoping that just being able to compete and wear their nation's flag on the world stage brings some moment of joy to the people at home who are able to see it.",
    "link": "https://www.cbc.ca/sports/olympics/winter/skeleton/ukrainian-skeleton-racers-lake-placid-world-championships-1.7474583",
    "timestamp": "2025-03-04T22:04:32Z"
  },
  {
    "title": "Trump Team Optimistic About Minerals Deal After Zelenskiy Pledge",
    "description": "US officials are rushing to revive a mineral-resources deal with Ukraine, with the goal of President Donald Trump announcing an agreement as soon as his speech to Congress on Tuesday night, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-team-optimistic-about-minerals-deal-after-zelenskiy-pledge",
    "timestamp": "2025-03-04T22:03:41Z"
  },
  {
    "title": "Trudeau calls tariffs dumb; says Trump wants to ruin Canadian economy",
    "description": "Canadian Prime Minister Justin Trudeau told U.S. President Donald Trump on Tuesday that his tariffs on Canadian imports were &quot;a very dumb thing to do&quot; and said Ottawa was striking back immediately at its closest ally. Trudeau, who is stepping down a…",
    "link": "https://japantoday.com/category/world/trudeau-dismisses-%27very-dumb%27-tariffs-says-trump-wants-to-ruin-canadian-economy1",
    "timestamp": "2025-03-04T22:02:54Z"
  },
  {
    "title": "Angry, betrayed and anxious: Canadians react to Trump's tariffs and annexation threat",
    "description": "A survey gauging the emotional temperature of Canadians confirms what most already know: U.S. President Donald Trump is making people on this side of the border mad.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/canadians-react-to-trump-threats-1.7474176",
    "timestamp": "2025-03-04T22:02:52Z"
  },
  {
    "title": "Democrats Try To Use Colby Confirmation Hearing To Sabotage Trump’s Russia-Ukraine Negotiations",
    "description": "'My personal interest is in making sure that I don't do anything that would disrupt the resumption of a move towards peace that I think would benefit Ukraine.'",
    "link": "https://thefederalist.com/2025/03/04/democrats-try-to-use-colby-confirmation-hearing-to-sabotage-trumps-russia-ukraine-negotiations/",
    "timestamp": "2025-03-04T22:02:30Z"
  },
  {
    "title": "Johnny Damon Is Beautifully Unapologetic About His Support For President Donald Trump",
    "description": "Johnny Damon is a proud supporter of President Donald J. Trump and he has no interest in hearing anything negative from fans about it.",
    "link": "https://dailycaller.com/2025/03/04/johnny-damon-donald-trump-support-mlb/",
    "timestamp": "2025-03-04T22:01:58Z"
  },
  {
    "title": "How Nancy Pelosi's Stocks Have Performed Under Donald Trump",
    "description": "Former House Speaker Nancy Pelosi, a California Democrat, has seen considerable growth in a number of stocks over the years, but the stocks have mostly remained flat or declined since President Donald Trump began his second term.\nThe Pelosis have a number of …",
    "link": "https://biztoc.com/x/fbd8651566992b8b",
    "timestamp": "2025-03-04T22:01:23Z"
  },
  {
    "title": "How Trump’s tariffs will crush American carmakers",
    "description": "How Trump’s tariffs will crush American carmakers\nThey must hope the levies do not endure\nIn the whirlwind of activity in his first few weeks in the White House, Donald Trump has sought to remake the world to his advantage by blowing up alliances and trading …",
    "link": "https://biztoc.com/x/1e0cfd295377a8ff",
    "timestamp": "2025-03-04T22:01:21Z"
  },
  {
    "title": "5 things to know about tariffs and how they work",
    "description": "President Donald Trump is a proponent of tariffs, insisting that they are paid for by foreign countries. In fact, it is importers — American companies — that pay tariffs.",
    "link": "https://biztoc.com/x/91374afb93b19b23",
    "timestamp": "2025-03-04T22:01:04Z"
  },
  {
    "title": "Lutnick: Trump may lower Canada, Mexico tariffs tomorrow",
    "description": "United States Commerce Secretary Howard Lutnick said on Tuesday that he thinks US President Donald Trump may compromise tomorrow on the tariffs imposed on Canada and Mexico, which came into effect tod...",
    "link": "https://biztoc.com/x/d2e44a7541bd0c17",
    "timestamp": "2025-03-04T22:01:02Z"
  },
  {
    "title": "Josh Shapiro Has the Ideas. Will He Take Gloves Off?",
    "description": "If the Pennsylvania governor wants to be president, he’s going to have to call his fellow Democrats on their BS about crime, Israel, and antisemitism.",
    "link": "https://www.thefp.com/p/josh-shapiro-has-the-ideas-does-he",
    "timestamp": "2025-03-04T22:00:03Z"
  },
  {
    "title": "The Strategic Crypto Swindle",
    "description": "A bitcoin reserve would be a government-backed grift.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/03/strategic-cryptocurrency-reserve-swindle/681917/",
    "timestamp": "2025-03-04T22:00:00Z"
  },
  {
    "title": "Report: Mexico Delays Response to US Tariffs, Hopes to Avert Trade War",
    "description": "Mexico’s president, Claudia Sheinbaum, reportedly hopes to deescalate a trade war by delaying a response to U.S. tariffs until she talks with President Donald Trump Thursday (March 6). Sheinbaum said Tuesday (March 4) that Mexico will announce the details of …",
    "link": "https://www.pymnts.com/politics/2025/report-mexico-delays-response-to-us-tariffs-hopes-to-avert-trade-war/",
    "timestamp": "2025-03-04T21:59:08Z"
  },
  {
    "title": "Target CEO Brian Cornell Sees an Uncertain Landscape as Tariffs Hit",
    "description": "Target CEO Brian Cornell addresses the uncertain retail landscape as new tariffs hit, impacting retail operations amidst trade wars.",
    "link": "http://wwd.com/business-news/government-trade/target-ceo-brian-cornell-tariffs-impact-trade-war-1237021459/",
    "timestamp": "2025-03-04T21:57:38Z"
  },
  {
    "title": "How Nancy Pelosi's Stocks Have Performed Under Donald Trump",
    "description": "Most Pelosi stock holdings have been flat or have fallen since Donald Trump began his second term in office.",
    "link": "https://www.newsweek.com/how-nancy-pelosi-stocks-have-done-under-donald-trump-2039029",
    "timestamp": "2025-03-04T21:56:37Z"
  },
  {
    "title": "Houthis Call US 'Terrorist' Designation 'A Badge of Honor'",
    "description": "\"Any aggressive American step against us will only make us more committed and strict in our positions,\" a Houthi source told Newsweek.",
    "link": "https://www.newsweek.com/houthis-call-us-terrorist-designation-badge-honor-2039610",
    "timestamp": "2025-03-04T21:55:59Z"
  },
  {
    "title": "Trump Official Says President Ready to Meet Mexico, Canada 'In the Middle'",
    "description": "Trump launched a trade war against America's three biggest trading partners, drawing retaliation from Mexico, Canada and China.",
    "link": "https://www.newsweek.com/trump-official-says-president-ready-meet-mexico-canada-middle-2039626",
    "timestamp": "2025-03-04T21:55:56Z"
  },
  {
    "title": "Key Player In Trump’s First Impeachment Makes Absurd Demand In Wake Of Zelensky Oval Office Duel",
    "description": "Alexander Vindman told Jim Acosta that President Donald Trump should resign following an Oval Office argument with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://dailycaller.com/2025/03/04/key-player-in-trumps-first-impeachment-makes-absurd-demand-in-wake-of-zelensky-oval-office-duel/",
    "timestamp": "2025-03-04T21:55:44Z"
  },
  {
    "title": "Arab Leaders Endorse Plan To Rebuild Gaza Under Palestinian Authority",
    "description": "Arab leaders endorsed a plan to rebuild the Gaza Strip under the future administration of the Palestinian Authority, presenting an alternative to US President Trump&#039;s widely condemned proposal to take over the territory and displace its people.",
    "link": "https://www.ndtv.com/world-news/arab-leaders-endorse-plan-to-rebuild-gaza-under-palestinian-authority-7849736",
    "timestamp": "2025-03-04T21:55:05Z"
  },
  {
    "title": "‘People See Through It’: Frank Luntz Says Dems’ Latest Strategy To Attack Trump ‘Not Going To Work’",
    "description": "Pollster Frank Luntz said Tuesday that Democrats' strategy of attacking President Donald Trump by highlighting fired federal employees is bound to fail.",
    "link": "https://dailycaller.com/2025/03/04/frank-luntz-dems-latest-strategy-not-going-to-work/",
    "timestamp": "2025-03-04T21:54:23Z"
  },
  {
    "title": "Diane Francis: Trudeau sets right tone on Trump tariffs",
    "description": "Diane Francis: Prime Minister Justin Trudeau said exactly what Canadians wanted to hear. Read here for more",
    "link": "https://financialpost.com/diane-francis/diane-francis-trudeau-sets-right-tone-on-trump-tariffs",
    "timestamp": "2025-03-04T21:54:10Z"
  },
  {
    "title": "Trump's pick as NATO ambassador says US commitment to the alliance is 'ironclad'",
    "description": "President Donald Trump’s pick as NATO ambassador is reassuring senators at his confirmation hearing that the Trump administration’s commitment to the military alliance is “ironclad.”",
    "link": "https://www.wsbradio.com/news/politics/trumps-pick-nato/GITFK2M25ZASJOXADDQUT6SPJU/",
    "timestamp": "2025-03-04T21:53:48Z"
  },
  {
    "title": "Exclusive-TikTok parent ByteDance valuation rises in latest share buyback, sources say",
    "description": "TikTok's parent company ByteDance is offering to buy back shares at a higher valuation than six months ago as it launches a new share repurchase program for U.S. employees this week, two people familiar with the matter told Reuters on Tuesday. ByteDance told …",
    "link": "https://www.channelnewsasia.com/business/exclusive-tiktok-parent-bytedance-valuation-rises-latest-share-buyback-sources-say-4977186",
    "timestamp": "2025-03-04T21:53:37Z"
  },
  {
    "title": "Democrats reject GOP funding strategy, stoking shutdown fears | CNN Politics",
    "description": "Democrats are rejecting House Republicans’ plan to pass a stopgap spending bill through the end of September, raising the s​​pecter of a government shutdown in President Donald Trump’s first 100 days and setting up a test of how far Democrats are willing to g…",
    "link": "https://www.cnn.com/2025/03/04/politics/democrats-reject-gop-funding-strategy-shutdown-fears/index.html",
    "timestamp": "2025-03-04T21:52:12Z"
  }
]