[
  {
    "title": "Tesla shares gain as Trump-Musk feud appears to cool",
    "description": "Tesla shares clawed back from steep losses as a war of words between CEO Elon Musk and U.S. President Donald Trump appeared to cool, easing investor worries about the likely political fallout on the electric automaker.Shares rose as much as 5 per cent in prem…",
    "link": "https://www.channelnewsasia.com/business/tesla-shares-gain-trump-musk-feud-appears-cool-5168891",
    "timestamp": "2025-06-06T10:16:28Z"
  },
  {
    "title": "Tesla shares briefly pare gains on report no plans for Trump-Musk call",
    "description": "Tesla shares clawed back from steep losses as a war of words between CEO Elon Musk and U.S. President Donald Trump appeared to cool, easing investor worries about the likely political fallout on the electric automaker.Shares rose as much as 5 per cent in prem…",
    "link": "https://www.channelnewsasia.com/business/tesla-shares-briefly-pare-gains-report-no-plans-trump-musk-call-5168891",
    "timestamp": "2025-06-06T10:16:28Z"
  },
  {
    "title": "Tesla shares rebound as Musk–Trump row shows signs of cooling",
    "description": "Tesla shares clawed back from steep losses on Friday, as a war of words between CEO Elon Musk and U.S. President Donald Trump appeared to cool amid report that White House aides were scheduling a call to help broker peace.Shares were up 5 per cent in premarke…",
    "link": "https://www.channelnewsasia.com/business/tesla-shares-rebound-musk-trump-row-shows-signs-cooling-5168891",
    "timestamp": "2025-06-06T10:16:28Z"
  },
  {
    "title": "AOC Gets Delightfully Catty On Trump-Musk Split",
    "description": "The progressive House member cracked wise about Washington's big breakup in an impromptu interview.",
    "link": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-girls-fighting-trump-musk_n_6842b169e4b043146daa40f8",
    "timestamp": "2025-06-06T10:16:15Z"
  },
  {
    "title": "Elon Musk to start new political party amid feud with Trump? Tech mogul drops big hint on X",
    "description": "Elon Musk has asked if it is \"time to create a new political party in America\" amid his messy public feud with President Donald Trump. The feud between the world's richest man and the most powerful politician is all out in the open. Musk left his role with th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-to-start-new-political-party-amid-feud-with-trump-tech-mogul-drops-big-hint-on-x/articleshow/121673359.cms",
    "timestamp": "2025-06-06T10:14:25Z"
  },
  {
    "title": "Social Security Is Impacted by Trump's Tax Bill: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe sweeping tax and spending bill backed by President Donald Trump includes significant changes to the U.S. tax code and public benefit programs, and Social Security beneficiaries will be affected.\nWhy It Mat…",
    "link": "https://biztoc.com/x/00fc0de810ec8b32",
    "timestamp": "2025-06-06T10:11:15Z"
  },
  {
    "title": "How Democrats Can Stop Alienating Young Men: Some Unsolicited Advice | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nLast November, Donald Trump soundly defeated Kamala Harris among young men 18 to 29 years old, racking up about 56% of their votes according to the Associated Press. That represents a huge decline from 2008, t…",
    "link": "https://biztoc.com/x/fe9464852174f2ee",
    "timestamp": "2025-06-06T10:11:14Z"
  },
  {
    "title": "'No Kings' Anti-Trump Protest Planned for President's Birthday—What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nProtesters are planning coordinated \"No Kings\" demonstrations against President Donald Trump across the U.S. on his birthday.\nNewsweek has contacted the organizers and the White House for comment via email.\nWh…",
    "link": "https://biztoc.com/x/8a21371a4b91935d",
    "timestamp": "2025-06-06T10:11:12Z"
  },
  {
    "title": "Trump ties his legacy to steamrolling Musk on his megabill",
    "description": "The News\nPresident Donald Trump’s second-term success rests in large part on signing his megabill as soon as possible. He’s acting accordingly.\nAt the heart of Trump’s ugly row with former right-hand man Elon Musk is the Tesla CEO’s public lambasting of the “…",
    "link": "https://biztoc.com/x/4673a474d6de0c41",
    "timestamp": "2025-06-06T10:10:57Z"
  },
  {
    "title": "Trump-Musk spat sees Bitcoin tumble, liquidating $308M in longs",
    "description": "Investors who went long on Bitcoin saw significant losses over the past 24 hours as the cryptocurrency dipped nearly 3%, nearing a retest of the $100,000 level.\nThe price decline comes as the feud between US President Donald Trump and billionaire Elon Musk in…",
    "link": "https://biztoc.com/x/1e485b9ac30f641a",
    "timestamp": "2025-06-06T10:10:33Z"
  },
  {
    "title": "US slaps sanctions on four ICC judges over Israel case",
    "description": "The United States has imposed sanctions on four judges at the International Criminal Court including over an arrest warrant for Israeli Prime Minister Benjamin Netanyahu as it ramped up pressure to neuter the court of last resort.",
    "link": "https://www.hurriyetdailynews.com/us-slaps-sanctions-on-four-icc-judges-over-israel-case-210012",
    "timestamp": "2025-06-06T10:09:36Z"
  },
  {
    "title": "Morgan Stanley opens xAI books with Musk in Trump crosshairs",
    "description": "Morgan Stanley faces challenges in selling debt for xAI Corp. due to the public feud between Elon Musk and Donald Trump, despite xAI's projections of significant earnings growth. Internal numbers presented to investors reveal xAI anticipates generating over $…",
    "link": "https://economictimes.indiatimes.com/tech/technology/morgan-stanley-opens-xai-books-with-musk-in-trump-crosshairs/articleshow/121673364.cms",
    "timestamp": "2025-06-06T10:09:04Z"
  },
  {
    "title": "Ukraine: 'Decisive' pressure needed after Russian attack",
    "description": "President Volodymyr Zelenskyy called those not pressuring Russia to end its war \"complicit and responsible\" for lives lost after Russian bombs hit Kyiv. The call came after Russia launched hundreds of overnight strikes.",
    "link": "https://www.dw.com/en/ukraine-decisive-pressure-needed-after-russian-attack/a-72814549",
    "timestamp": "2025-06-06T10:08:00Z"
  },
  {
    "title": "Ukraine: 'Decisive' pressure needed after Russia pounds Kyiv",
    "description": "President Volodymyr Zelenskyy called those not pressuring Russia to end its war \"complicit and responsible\" for lives lost after Russian bombs hit Kyiv. The call came after Russia launched hundreds of overnight strikes. Ukrainian President Volodymyr Zelenskyy…",
    "link": "https://www.dw.com/en/ukraine-decisive-pressure-needed-after-russia-pounds-kyiv/a-72814549",
    "timestamp": "2025-06-06T10:08:00Z"
  },
  {
    "title": "Germany faces two more years of recession if US trade war escalates: central bank",
    "description": "Germany could face two more years of recession if a trade war with the United States escalates sharply, the central bank said Friday, a bleak warning for Europe’s struggling top economy. If US President Donald Trump’s tariffs were to be implemented in full fr…",
    "link": "https://www.digitaljournal.com/world/germany-faces-two-more-years-of-recession-if-us-trade-war-escalates-central-bank/article",
    "timestamp": "2025-06-06T10:02:32Z"
  },
  {
    "title": "Trump’s War on Knowledge",
    "description": "Donald Trump’s crusade to eradicate antisemitism at elite US universities is nothing more than an excuse to attack the academy’s leftists and liberals. The only upside is that, out of self-preservation, these institutions may be forced to drop some of the mor…",
    "link": "https://www.project-syndicate.org/commentary/trump-war-on-elite-universities-result-of-class-resentment-by-ian-buruma-2025-06",
    "timestamp": "2025-06-06T10:01:22Z"
  },
  {
    "title": "Godzilla v. Kong",
    "description": "The latest episode of Trial Balloon is live for members. Elon Musk and Donald Trump's big, beautiful break up. Well, we recorded this episode about an hour before Musk and Trump went into full attack",
    "link": "https://politicalwire.com/2025/06/06/godzilla-v-kong/",
    "timestamp": "2025-06-06T10:00:51Z"
  },
  {
    "title": "The Supreme Court Will Settle Trump’s Tariffs. But When? And How?",
    "description": "Once again, Trump’s aggressive, scattershot use of executive power has pushed us into new constitutional territory, writes Elie Honig.",
    "link": "http://nymag.com/intelligencer/article/the-supreme-court-will-settle-trumps-tariffs-but-how.html",
    "timestamp": "2025-06-06T10:00:26Z"
  },
  {
    "title": "How Democrats Can Stop Alienating Young Men: Some Unsolicited Advice | Opinion",
    "description": "One can put lipstick on a pig, but the pig, at the end of the day, is still a pig.",
    "link": "https://www.newsweek.com/how-democrats-can-stop-alienating-young-men-some-unsolicited-advice-opinion-2081758",
    "timestamp": "2025-06-06T10:00:01Z"
  },
  {
    "title": "'No Kings' Anti-Trump Protest Planned for President's Birthday—What to Know",
    "description": "Organizers of the protests are calling for June 14 to be a \"nationwide day of defiance.\"",
    "link": "https://www.newsweek.com/anti-trump-protest-president-birthday-2080741",
    "timestamp": "2025-06-06T10:00:01Z"
  },
  {
    "title": "Social Security Is Impacted by Trump's Tax Bill: What to Know",
    "description": "The bill passed by the House would raise the standard deduction by up to $4,000 for those 65 and over, starting in 2025 to 2028.",
    "link": "https://www.newsweek.com/social-security-impacted-trump-tax-bill-what-know-2081370",
    "timestamp": "2025-06-06T10:00:01Z"
  },
  {
    "title": "America’s Gas Pipeline Buildout Is Mainly for Exports—Not Energy Independence",
    "description": "More than three-quarters of new gas pipeline capacity under development in the US would feed additional liquefied natural gas exports rather than supporting domestic energy needs, a new report concludes.  Greenhouse gas emissions tied to that new capacity wou…",
    "link": "https://www.motherjones.com/politics/2025/06/liquid-natural-gas-pipeline-projects-exports-energy-independence/",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "Can Public Media Survive Trump?",
    "description": "Jon Allsop on how public media institutions can sometimes stand up more strongly to authoritarians than their commercial counterparts.",
    "link": "https://www.newyorker.com/news/fault-lines/can-public-media-survive-trump",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "7 senators to watch as Republicans make changes to Trump's big bill",
    "description": "From centrists worried about Medicaid cuts to conservative hard-liners demanding steeper spending reductions, Senate GOP leaders face a tricky balancing act.",
    "link": "https://www.nbcnews.com/politics/congress/7-senators-watch-republicans-make-changes-trumps-big-bill-rcna211134",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "The Quest to Bring Young Men Back to the Democrats",
    "description": "In the months leading up to the 2024 election, and particularly after the ascension of Vice President Kamala Harris to the top of the presidential ticket, Democrats found themselves particularly vexed about the best way to reach young men and bring them into …",
    "link": "https://newrepublic.com/article/196183/democrats-young-men-outreach-efforts",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "It’s a DOGE-eat-DOGE world. And now Trump and Musk fans must pick a side.",
    "description": "Donald Trump and Elon Musk’s followers worship them as demigods — their feud could splinter the MAGA movement.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-elon-musk-breakup-doge-jeffrey-epstein-files-followers-rcna211333",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "Presidents using autopens is not a crime. Trump should know that.",
    "description": "Trump has launched what is a wild investigation into whether Joe Biden aides used an autopen for his signature on important documents and forge pardons.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-biden-autopen-investigation-rcna211223",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "The Real Reason Trump Has Created This Autopen Scandal",
    "description": "When Richard III seized the English throne towards the end of the Wars of the Roses, he pressured Parliament to legitimize his usurpation of the crown from his nephews. Parliament responded by passing a law that accused the late Edward IV, Richard’s brother, …",
    "link": "https://newrepublic.com/article/196219/trump-autopen-investigation-biden-propaganda",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "Trump’s Odious New Demand of the Civil Service: Loyalty Oaths",
    "description": "The 1939 Hatch Act prohibits government employees from using their position to engage in partisan activity, and prohibits their membership in any organization that advocates the overthrow of the United States. At the dawn of the Cold War, President Harry Trum…",
    "link": "https://newrepublic.com/article/196220/trump-civil-service-loyalty-oaths",
    "timestamp": "2025-06-06T10:00:00Z"
  },
  {
    "title": "Tesla jumps 5% in premarket trading as stock reels from Trump-Musk drama",
    "description": "Tesla shares climbed in U.S. premarket trading Friday after tensions between CEO Elon Musk and President Donald Trump fueled a $152 billion rout for the stock a day earlier.\nShares of Tesla were up 5.1% in premarket trading as of 5 a.m. ET.\nMusk and Trump hav…",
    "link": "https://biztoc.com/x/c73d56ed46592869",
    "timestamp": "2025-06-06T09:59:50Z"
  },
  {
    "title": "DJT Stock Is Recovering Friday. Trump Media Has Still Had a Bad Week",
    "description": "5 min ago\nDJT Stock Is Recovering Friday. Trump Media Has Still Had a Bad Week.\nShares of Trump Media & Technology, the parent of the Truth Social site, was gaining early Friday after plunging 8% on Thursday.\nThe stock moves Thursday underscored that whatever…",
    "link": "https://biztoc.com/x/f946f5401911d2b7",
    "timestamp": "2025-06-06T09:59:48Z"
  },
  {
    "title": "Tesla Stock Climbed Nearly 5% In Friday Pre-Market: What's Going On?",
    "description": "The shares of Tesla Inc. (NASDAQ:TSLA) climbed 4.98% during the Friday pre-market trading session after indications of a possible reconciliation between CEO Elon Musk and President Donald Trump. \nWhat Happened: On Thursday, Tesla’s market cap plummeted by a r…",
    "link": "https://biztoc.com/x/f9c41cc5202ed84e",
    "timestamp": "2025-06-06T09:59:23Z"
  },
  {
    "title": "Think You’re Smarter Than a Slate Staff Writer? Find Out With This Week’s News Quiz.",
    "description": "Test your knowledge of this week’s big stories.",
    "link": "https://slate.com/news-and-politics/2025/06/slate-news-quiz-elon-musk-gaza-miss-world.html",
    "timestamp": "2025-06-06T09:55:00Z"
  },
  {
    "title": "Trump’s Pricey Gift Just Got Pricier: Upgrading Qatari Boeing Will Cost Top Dollar",
    "description": "Controversies continue to surround Qatar’s generous gift to US President Donald Trump, as the upgrade of the Qatari Boeing is now revealed to come with a hefty cost.",
    "link": "https://sputnikglobe.com/20250606/trumps-pricey-gift-just-got-pricier-upgrading-qatari-boeing-will-cost-top-dollar--1122200448.html",
    "timestamp": "2025-06-06T09:52:18Z"
  },
  {
    "title": "Sean Hannity Deflects Elon Musk’s Explosive Trump-Epstein Dig Onto Bill Clinton",
    "description": "Hannity downplayed Musk’s jab at Trump’s past association with Jeffrey Epstein by redirecting focus onto former President Bill Clinton.\nThe post Sean Hannity Deflects Elon Musk’s Explosive Trump-Epstein Dig Onto Bill Clinton first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/sean-hannity-deflects-elon-musks-explosive-trump-epstein-dig-onto-bill-clinton/",
    "timestamp": "2025-06-06T09:49:36Z"
  },
  {
    "title": "ATOM Rebounds From 5% Drop as Buyer Demand Defends Key Support Level",
    "description": "The cryptocurrency market continues navigating choppy waters as tensions between U.S. President Donald Trump and Tesla CEO Elon Musk increase.\nATOM established crucial support around $4.25 after experiencing a 4.7% decline, with significant buying demand sugg…",
    "link": "https://biztoc.com/x/fcb14bf5d15bba88",
    "timestamp": "2025-06-06T09:49:03Z"
  },
  {
    "title": "The entirely predictable Trump-Musk divorce threatens Musk’s business empire | CNN Business",
    "description": "Elon Musk’s decision to go all in on Donald Trump never made much sense. His scorched-earth approach to breaking up with Trump is even harder to square.",
    "link": "https://www.cnn.com/2025/06/06/business/musk-trump-tesla-stock",
    "timestamp": "2025-06-06T09:48:26Z"
  },
  {
    "title": "Musk and Trump Show Signs of Cooling Off",
    "description": "9 min ago\nMusk and Trump Show Signs of Cooling Off\nAfter their explosive spat, there are tentative signs that President Donald Trump and Elon Musk may be set to smooth things over.\nResponding to a post from billionaire hedge fund manager Bill Ackman calling f…",
    "link": "https://biztoc.com/x/6c1348cb3be36271",
    "timestamp": "2025-06-06T09:48:16Z"
  },
  {
    "title": "This Glitchy, Error-Prone Tool Could Get You Deported—Even If You’re a U.S. Citizen",
    "description": "The tech’s mistakes are dangerous, but its potential for abuse when working as intended is even scarier.",
    "link": "https://slate.com/technology/2025/06/ice-facial-recognition-camera-surveillance-mistake-deported.html",
    "timestamp": "2025-06-06T09:45:00Z"
  },
  {
    "title": "ICE Agents Stranded in Africa: What to Know",
    "description": "Agents and detainees are now confined in a makeshift detention center in a shipping container facing risks from disease,  and warnings of potential attacks.",
    "link": "https://www.newsweek.com/ice-agents-stranded-africa-what-know-2081816",
    "timestamp": "2025-06-06T09:42:08Z"
  },
  {
    "title": "What will Trump travel ban mean for sport?",
    "description": "After President Donald Trump banned travel to the US from 12 countries, BBC Sport assesses what the impact on sporting events could be.",
    "link": "https://www.bbc.com/sport/olympics/articles/ce397891knzo",
    "timestamp": "2025-06-06T09:41:05Z"
  },
  {
    "title": "Tesla jumps 5% in premarket trading as stock reels from Trump-Musk drama",
    "description": "The electric vehicle maker lost $152 billion in market cap Thursday as traders reacted to a public feud between Elon Musk and President Donald Trump.",
    "link": "https://www.cnbc.com/2025/06/06/tesla-jumps-5percent-in-premarket-trade-as-stock-reels-from-trump-musk-drama.html",
    "timestamp": "2025-06-06T09:40:51Z"
  },
  {
    "title": "NEAR Protocol Surges 5% After Forming Bullish Support Pattern",
    "description": "NEAR showed resilience on Thursday with strong recovery from $2.42 support level, despite chaos in global markets.",
    "link": "https://www.coindesk.com/markets/2025/06/06/near-protocol-surges-5-after-forming-bullish-support-pattern",
    "timestamp": "2025-06-06T09:40:00Z"
  },
  {
    "title": "Iranians react to new Trump travel ban as tensions are high between nations",
    "description": "Iranians again face a U.S. travel ban imposed by President Donald Trump, with the decision drawing anger, frustration and some shrugs given the decades of tensions between the countries",
    "link": "https://abcnews.go.com/International/wireStory/iranians-react-new-trump-travel-ban-tensions-high-122565721",
    "timestamp": "2025-06-06T09:39:58Z"
  },
  {
    "title": "Could Elon Musk Be Deported By Donald Trump? What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSteve Bannon has called for Elon Musk to be deported from the United States, after the dramatic bust up between the tech billionaire and President Donald Trump.\nIn his War Room podcast Thursday, Trump's former…",
    "link": "https://biztoc.com/x/8fde4f504b5bd0c3",
    "timestamp": "2025-06-06T09:37:40Z"
  },
  {
    "title": "Musk Net Worth Plummets By $34 Billion",
    "description": "8 min ago\nMusk Net Worth Plummets By $34 Billion\nElon Musk's net worth tumbled on Thursday as a bitter dispute erupted between him and President Donald Trump.\nMusk's net worth fell by about $34 billion to $335 billion, according to the Bloomberg Billionaires …",
    "link": "https://biztoc.com/x/f15a9fd0890f2bff",
    "timestamp": "2025-06-06T09:37:25Z"
  },
  {
    "title": "The inevitable Trump-Musk feud is finally here – and it’s pathetic",
    "description": "This would all be sad enough even if it didn’t have global consequences. For Democrats, the moment has come\nEver since the world’s richest person, Elon Musk, threw his financial weight behind Donald Trump’s 2024 presidential campaign and appeared hopping arou…",
    "link": "https://biztoc.com/x/b5cf4f4399877d27",
    "timestamp": "2025-06-06T09:37:15Z"
  },
  {
    "title": "Could Elon Musk Be Deported By Donald Trump? What to Know",
    "description": "On Thursday Musk called for Trump to be impeached and replaced as president by JD Vance.",
    "link": "https://www.newsweek.com/could-elon-musk-deported-donald-trump-what-know-2081809",
    "timestamp": "2025-06-06T09:36:34Z"
  },
  {
    "title": "Republicans Fear Musk May Become Powerful Party Foe Amid Clash With Trump",
    "description": "US Republicans worry that the conflict between US President Donald Trump and billionaire Elon Musk may turn the businessman into a formidable enemy for their party, NBC News reports.",
    "link": "https://sputnikglobe.com/20250606/republicans-fear-musk-may-become-powerful-party-foe-amid-clash-with-trump--1122200027.html",
    "timestamp": "2025-06-06T09:35:33Z"
  },
  {
    "title": "Bitcoin Pepe sees continued momentum as Uber plans to accept payments in crypto",
    "description": "Bitcoin Pepe has raised $13.9 million ahead of a highly anticipated market debut. The crypto market is excited as Uber CEO Dara Khosrowshahi reveals the company could add crypto to payment options. The Bitcoin Pepe price could explode amid broader adoption an…",
    "link": "https://coinjournal.net/news/bitcoin-pepe-sees-continued-momentum-as-uber-plans-to-accept-payments-in-crypto/",
    "timestamp": "2025-06-06T09:33:53Z"
  },
  {
    "title": "Amid Elon Musk-Trump feud, tech billionaire's ex Ashley St Clair offers ‘breakup advice’ to President",
    "description": "Elon Musk's ex Ashley St Clair has invaded in the public fallout between the tech billionaire and the US President. Ashley St. Clair, conservative influencer and alleged mother of Elon Musk’s 13th child, has entered the fray with a sharp-tongued jab at Donald…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/amid-elon-musk-trump-feud-tech-billionaires-ex-ashley-st-clair-offers-breakup-advice-to-president/articleshow/121672320.cms",
    "timestamp": "2025-06-06T09:33:51Z"
  },
  {
    "title": "Pakistan’s crypto minister joins NYC mayor, Wall Street in Bitcoin talks",
    "description": "Bilal Bin Saqib, Pakistan’s state minister for crypto, is advancing US Web3 ties through meetings with Cantor Fitzgerald’s Brandon Lutnick and NYC’s pro-Bitcoin mayor, Eric Adams.",
    "link": "https://cointelegraph.com/news/pakistan-crypto-new-york-wall-street-allies",
    "timestamp": "2025-06-06T09:33:43Z"
  },
  {
    "title": "White House schedules call between Elon Musk and Donald Trump as internet spat spirals out of control – reports",
    "description": "White House aides scheduled a call between Donald Trump and Elon Musk for Friday, Politico reported, after a huge public spat that saw threats fly over government contracts and ended with the world's richest man suggesting the US president should be impeached.",
    "link": "https://www.independent.ie/world-news/white-house-schedules-call-between-elon-musk-and-donald-trump-as-internet-spat-spirals-out-of-control-reports/a1641851194.html",
    "timestamp": "2025-06-06T09:33:19Z"
  },
  {
    "title": "‘I’m not thinking about Elon. The poor guy’s got a problem’ – Donald Trump says he has no interest in speaking to Tesla boss amid spat",
    "description": "US President Donald Trump is not interested in talking with his former ally Elon Musk, amid a bitter feud over the president's sweeping tax-cut bill, a White House official said on Friday, adding that no phone call between the two men is planned for the day.",
    "link": "https://www.independent.ie/world-news/im-not-thinking-about-elon-the-poor-guys-got-a-problem-donald-trump-says-he-has-no-interest-in-speaking-to-tesla-boss-amid-spat/a1641851194.html",
    "timestamp": "2025-06-06T09:33:19Z"
  },
  {
    "title": "The question no one is asking",
    "description": "Right now, the question is in the background, but it comes out in the open now and then. You can see it in online debates over the presidential aspirations of New York congresswoman Alexandria Ocasio-Cortez. She’s great and all, people say, but can a woman wi…",
    "link": "https://www.rawstory.com/raw-investigates/first-woman-president-usa/",
    "timestamp": "2025-06-06T09:30:04Z"
  },
  {
    "title": "Trump-inspired Cantonese opera in Hong Kong aims to bring love and peace",
    "description": "\"Trump, The Twins President\" has been through several iterations since its 2019 debut, with the latest version featuring the attempted assassination of the U.S. president.",
    "link": "https://www.japantimes.co.jp/news/2025/06/06/asia-pacific/society/trump-opera-hong-kong/",
    "timestamp": "2025-06-06T09:27:00Z"
  },
  {
    "title": "Merz: This US admin open to discussions",
    "description": "German Chancellor Friedrich Merz shared on Friday that the present United States administration is \"open for discussions and hearing other opinions,\" adding that US President Donald Trump must be spok...",
    "link": "https://biztoc.com/x/4c7b58794dd4df1e",
    "timestamp": "2025-06-06T09:26:24Z"
  },
  {
    "title": "Can Trump really lower US drug prices and raise them in other countries? Probably not",
    "description": "Drug industry stock prices dropped when Donald Trump announced his intention to lower drug prices through executive decree, but in the end the markets had the final word. Share prices fell in early trading on 12 May, after the US president teased a forthcomin…",
    "link": "https://www.bmj.com/content/389/bmj.r1142",
    "timestamp": "2025-06-06T09:26:02Z"
  },
  {
    "title": "6 Wildly Different Ways Fox News Hosts Struggled To Process Trump-Musk Blow-Up",
    "description": "From denial and downplaying to anger and acceptance.",
    "link": "https://www.huffpost.com/entry/fox-news-hosts-trump-musk-feud_n_6842a73ae4b04a6fce05b16b",
    "timestamp": "2025-06-06T09:21:51Z"
  },
  {
    "title": "Trump says it may be better to let Ukraine, Russia 'fight for a while'",
    "description": "In an Oval Office meeting with German Chancellor Friedrich Merz, President Trump likened the war between Russia and Ukraine to a fight between two children who hate each other.",
    "link": "https://www.npr.org/2025/06/06/nx-s1-5425195/trump-ukraine-russia-putin-merz",
    "timestamp": "2025-06-06T09:19:43Z"
  },
  {
    "title": "Bitcoin Falls to $102,700 Amid Trump-Musk Feud, Most Altcoins See Dips",
    "description": "The overall crypto market tumbled by 2.70 percent over the last day. Bitcoin and Ether, both saw losses on Friday, June 6. The escalating tensions between Trump and Musk seem to have significantly impacted market sentiment. A majority of altcoins registered l…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-elon-musk-donald-trump-feud-ethereum-solana-dogecoin-losses-market-down-8602799",
    "timestamp": "2025-06-06T09:19:18Z"
  },
  {
    "title": "World’s Auto Supply Chain Is in Hands of a Few Chinese Bureaucrats",
    "description": "In a hulking grey building just east of Tiananmen square in Beijing, a small team in China’s Ministry of Commerce is deciding the fate of the global auto industry, one rare earth magnet export permit at a time. China holds …",
    "link": "https://www.insurancejournal.com/news/international/2025/06/06/826567.htm",
    "timestamp": "2025-06-06T09:17:35Z"
  },
  {
    "title": "Donald Trump and Elon Musk’s brutal social media feud explained as world left in shock",
    "description": "Donald Trump and Elon Musk have had a huge public fallout following Musk's departure from the Trump administration.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-elon-musk-epstein-feud-008378-20250606",
    "timestamp": "2025-06-06T09:16:00Z"
  },
  {
    "title": "4 killed in Kyiv as Ukraine once again bombarded by Russian missiles and drones",
    "description": "A nighttime missile and drone attack on Ukraine killed at least four people and injured 20 others in Kyiv, city mayor Vitali Klitschko said Friday, as Russia targeted at least six regions across the country with 407 drones and 44 missiles in one of its larges…",
    "link": "https://www.cbc.ca/news/world/russia-ukraine-drone-attack-kyiv-kills-4-1.7554057",
    "timestamp": "2025-06-06T09:15:44Z"
  },
  {
    "title": "3 killed in Kyiv as Ukraine once again bombarded by Russian missiles and drones",
    "description": "A nighttime missile and drone attack on Ukraine killed at least four people and injured 20 others in Kyiv, city mayor Vitali Klitschko said Friday, as Russia targeted at least six regions across the country with 407 drones and 44 missiles in one of its larges…",
    "link": "https://www.cbc.ca/news/world/russia-ukraine-drone-attack-kyiv-kills-3-1.7554057",
    "timestamp": "2025-06-06T09:15:44Z"
  },
  {
    "title": "Renewed attacks by Russia kill at least 6 in Ukraine, officials say",
    "description": "Russia struck Ukraine with a thunderous aerial bombardment overnight, further dampening hopes that the warring sides could reach a peace deal anytime soon days after Kyiv embarrassed the Kremlin with a surprising drone attack on military airfields deep inside…",
    "link": "https://www.cbc.ca/news/world/russia-ukraine-drone-attack-kyiv-deaths-1.7554057",
    "timestamp": "2025-06-06T09:15:44Z"
  },
  {
    "title": "Russia's Medvedev Mocks Fight Between Donald Trump and Elon Musk",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSenior Russian security official Dmitry Medvedev poked fun at the explosive war of words between U.S. President Donald Trump and billionaire Elon Musk, offering to mediate peace between the two political allie…",
    "link": "https://biztoc.com/x/9c46a394db7c477b",
    "timestamp": "2025-06-06T09:15:30Z"
  },
  {
    "title": "Merz avoids Oval Office clash in first Trump meeting",
    "description": "German Chancellor Friedrich Merz urged US President Donald Trump to put more pressure on Russia to end the war in Ukraine, even as the American leader suggested there wasn’t much he could do.\nMerz, who took office one month ago and in February said Europe nee…",
    "link": "https://biztoc.com/x/c2d4d76e89d10eb7",
    "timestamp": "2025-06-06T09:15:30Z"
  },
  {
    "title": "Trump-Musk spat spills onto social media: Blow-by-blow account of how the tiff unfolded",
    "description": "A public feud has erupted between Elon Musk and Donald Trump, playing out on social media. The conflict began with Musk criticising Trump's spending bill, leading to a series of retaliatory posts, where Trump threatened to cancel government subsidies and cont…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-musk-spat-spills-onto-social-media-blow-by-blow-account-of-how-the-tiff-unfolded/articleshow/121671592.cms",
    "timestamp": "2025-06-06T09:15:17Z"
  },
  {
    "title": "Russia's Medvedev Mocks Fight Between Donald Trump and Elon Musk",
    "description": "President Donald Trump and Elon Musk engaged in an explosive war of words.",
    "link": "https://www.newsweek.com/russia-medvedev-mocks-donald-trump-elon-musk-fight-2081837",
    "timestamp": "2025-06-06T09:14:46Z"
  },
  {
    "title": "U.S. blocks ceasefire resolution at U.N. Security Council as hunger grips Gaza",
    "description": "The United States has once again vetoed a U.N. Security Council resolution demanding an immediate, unconditional, and permanent ceasefire in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250605-presstv04.htm",
    "timestamp": "2025-06-06T09:12:38Z"
  },
  {
    "title": "Job growth expected to have slowed in May as Trump's tariffs fluctuated",
    "description": "The job market has defied concern about business uncertainty and recession risk.",
    "link": "https://abcnews.go.com/Business/job-growth-expected-slowed-trumps-tariffs-fluctuated/story?id=122527644",
    "timestamp": "2025-06-06T09:10:22Z"
  },
  {
    "title": "Mayors are making climate action personal. It’s working.",
    "description": "As the Trump administration boosts fossil fuels and rolls back regulations, mayors are greening their cities — in more ways than one.",
    "link": "https://www.nationalobserver.com/2025/06/06/news/mayors-making-climate-action-personal",
    "timestamp": "2025-06-06T09:09:06Z"
  },
  {
    "title": "US markets are no longer safe for investments, Carmignac says",
    "description": "The Wall Street consensus is that the tax provision would further undermine confidence in US assets, already shaken by Trump’s trade policies and America’s deteriorating fiscal accounts",
    "link": "https://www.bloomberg.com/news/articles/2025-06-06/us-markets-are-no-longer-safe-for-investments-carmignac-says",
    "timestamp": "2025-06-06T09:06:52Z"
  },
  {
    "title": "Stocks to Buy | Devina Mehra on top sectoral bets for 2025",
    "description": "Devina Mehra in an interview to ET Now describes the fallout between Donald Trump and Elon Musk as a very predictable outcome. She compares it humorously to a situation any relationship counsellor or even a pastor could have foreseen ending badly. Just days a…",
    "link": "https://m.economictimes.com/markets/stocks/news/stocks-to-buy-devina-mehra-on-top-sectoral-bets-for-2025/trumpmusk-breakup-a-predictable-fallout/slideshow/121671915.cms",
    "timestamp": "2025-06-06T09:06:15Z"
  },
  {
    "title": "Lawrence O'Donnell Shows Exact Moment Trump Was 'Humiliated' By 2 People At Once",
    "description": "The MSNBC host slammed the president as a \"vulgar lump of a man.\"",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-trump-musk_n_6842a268e4b004bd5409fe0e",
    "timestamp": "2025-06-06T09:06:00Z"
  },
  {
    "title": "Elon Musk vs Donald Trump: How a clash over $1.7 trillion spending bill, explodes into internet meme fest",
    "description": "A public feud erupted between Donald Trump and Elon Musk over government spending and tax policies, quickly escalating into a social media spectacle. Trump threatened to withdraw federal support from Musk's ventures, leading to a significant drop in Tesla's m…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/elon-musk-vs-donald-trump-how-a-clash-over-1-7-trillion-spending-bill-explodes-into-internet-meme-fest/articleshow/121668940.cms",
    "timestamp": "2025-06-06T09:05:53Z"
  },
  {
    "title": "Tech journalist says Trump and Musk intense feud is 'worrisome'",
    "description": "Tech journalist Kara Swisher discusses what Elon Musk's dealings at Tesla and his years in Silicon Valley reveal about how he's approaching his escalating feud with President Trump.",
    "link": "https://www.npr.org/2025/06/06/nx-s1-5424677/trump-elon-musk-feud-doge-spending-bill",
    "timestamp": "2025-06-06T09:05:04Z"
  },
  {
    "title": "China's rare earth weapon changes contours of trade war battlefield",
    "description": "China is strategically weaponizing its supply chain, mirroring U.S. export controls. Recent rare earth export license issues, highlighted by a Trump-Xi call, reveal China's refined trade war tactics. Modelled after U.S. sanctions, China's system grants insigh…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-rare-earth-weapon-changes-contours-of-trade-war-battlefield/articleshow/121671729.cms",
    "timestamp": "2025-06-06T09:05:03Z"
  },
  {
    "title": "Inside the AI Prompts DOGE Used to “Munch” Contracts Related to Veterans’ Health",
    "description": "by Brandon Roberts and Vernal Coleman \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nWhen an AI script written by a Department of Government E…",
    "link": "https://www.propublica.org/article/inside-ai-tool-doge-veterans-affairs-contracts-sahil-lavingia",
    "timestamp": "2025-06-06T09:05:00Z"
  },
  {
    "title": "Hedge funder Ken Griffin doesn’t get why Trump wants to take China’s jobs: ‘Why are we aspiring to be the nation of the lowest- cost workforce in the world?’",
    "description": "Citadel CEO Ken Griffin says President Donald Trump’s tariff policy on China is misguided as the jobs it would “reshore” are mostly those making low-value items. “There’s no money in there for anybody, and there’s certainly no money for doing those jobs,” Gri…",
    "link": "https://biztoc.com/x/7ed1cfef1d845b13",
    "timestamp": "2025-06-06T09:04:06Z"
  },
  {
    "title": "Bitcoin gets sub-$100K price targets with RSI 'a week away' from new lows",
    "description": "Bitcoin price expectations fall in line with a new retest of $100,000 support — traders see news lows with RSI still heading lower.",
    "link": "https://cointelegraph.com/news/bitcoin-gets-sub-100k-price-targets-rsi-week-away-from-new-lows",
    "timestamp": "2025-06-06T09:02:35Z"
  },
  {
    "title": "Military aggression not to eliminate Iran's nuclear program: FM",
    "description": "Foreign Minister Abbas Araghchi has strongly dismissed the notion of military aggression's being capable of \"eliminating\" Iran's nuclear energy program, highlighting the invulnerable nature of the country's nuclear facilities to such attacks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250605-presstv02.htm",
    "timestamp": "2025-06-06T09:02:25Z"
  },
  {
    "title": "Iran will never abandon enrichment, preparing new counter-proposal to US offer: Ayatollah Khamenei's aide",
    "description": "A political advisor to Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has reaffirmed Iran's right to enrich uranium, saying the country is drafting a counter-proposal to the latest US nuclear offer.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250605-presstv01.htm",
    "timestamp": "2025-06-06T09:02:13Z"
  },
  {
    "title": "Top US universities raced to become global campuses. Under Trump, it's becoming a liability",
    "description": "Three decades ago, foreign students at Harvard University accounted for just 11% of the total student body",
    "link": "https://abcnews.go.com/Politics/wireStory/top-us-universities-raced-become-global-campuses-trump-122548691",
    "timestamp": "2025-06-06T09:02:12Z"
  },
  {
    "title": "Chinese FM responds to US travel ban and restrictions, says movement of people basis for exchanges",
    "description": "When asked to comment on the White House's announcement on fully restricting the entry of nationals from 12 countries, including Afghanistan, Myanmar, Iran, and Yemen, and partially limiting the entry of nationals from seven countries including Burundi, Chine…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/06/china-250605-globaltimes03.htm",
    "timestamp": "2025-06-06T09:00:48Z"
  },
  {
    "title": "Trump's pardon of Chrisleys praised by Joe Giudice as 'the only way' after 'harsh' prison sentences",
    "description": "Joe Giudice, who pleaded guilty to financial fraud in 2014, applauded Savannah Chrisley's persistence in advocating for her parents' release from federal prison.",
    "link": "https://www.foxnews.com/entertainment/trumps-pardon-chrisleys-praised-joe-giudice-the-only-way-after-harsh-prison-sentences",
    "timestamp": "2025-06-06T09:00:26Z"
  },
  {
    "title": "An Introduction to George Orwell’s 1984 and How Power Manufactures Truth",
    "description": "Soon after the first election of Donald Trump to the presidency of the United States, George Orwell’s Nineteen Eighty-Four became a bestseller again. Shooting to the top of the American charts, the novel that inspired the term “Orwellian” passed Danielle Stee…",
    "link": "https://www.openculture.com/?p=1123640",
    "timestamp": "2025-06-06T09:00:23Z"
  },
  {
    "title": "MARK HALPERIN: Democrats try to construct a Frankenstein candidate while JD Vance gains momentum for 2028",
    "description": "Democrats face an uphill battle constructing their 2028 Frankenstein candidate while JD Vance strengthens his position as the Republican frontrunner.",
    "link": "https://www.foxnews.com/opinion/mark-halperin-democrats-try-construct-frankenstein-candidate-while-jd-vance-gains-momentum-2028",
    "timestamp": "2025-06-06T09:00:22Z"
  },
  {
    "title": "Xi says dialogue, cooperation only correct choice for China, U.S.",
    "description": "Chinese President Xi Jinping said on Thursday that dialogue and cooperation are the only correct choice for China and the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/06/china-250606-prc-mnd01.htm",
    "timestamp": "2025-06-06T09:00:16Z"
  },
  {
    "title": "Xi says dialogue, cooperation only correct choice for China, U.S. in phone call with Trump",
    "description": "Chinese President Xi Jinping said on Thursday that dialogue and cooperation are the only correct choice for China and the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/06/china-250606-pdo01.htm",
    "timestamp": "2025-06-06T09:00:15Z"
  },
  {
    "title": "Xi, Trump hold phone talks",
    "description": "Chinese President Xi Jinping on Thursday held phone talks with US President Donald Trump at the latter's request, according to the Xinhua News Agency.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/06/china-250606-globaltimes01.htm",
    "timestamp": "2025-06-06T09:00:13Z"
  },
  {
    "title": "World Liberty Financial Takes Action Against Magic Eden Over TRUMP Wallet",
    "description": "World Liberty Financial (WLFI), the decentralized finance (DeFi) venture associated with the Trump family, has taken decisive action to prevent the launch of an unofficial TRUMP-braded wallet.  On Thursday, the crypto firm issued a cease-and-desist letter to …",
    "link": "https://bitcoinist.com/world-liberty-financial-against-magic-eden/",
    "timestamp": "2025-06-06T09:00:09Z"
  },
  {
    "title": "Trump, Xi pave way for fresh trade talks in 90-minute call",
    "description": "President Donald Trump and China's Xi Jinping agreed on fresh trade talks to overcome a tariff stalemate in a highly anticipated phone call on Thursday that China's state media reported first, stressing that it was the U.S. leader who initiated it.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/06/china-250605-rfa01.htm",
    "timestamp": "2025-06-06T09:00:08Z"
  }
]