[
  {
    "title": "Legacy car company quietly slashes 15 percent of staff",
    "description": "While the automotive industry has certainly seen its share of ups and downs over the years, 2025 is proving to be a banner year for it in terms of stressors.\nThat's in part due to tariffs, which President Donald Trump announced earlier this year. Since April,…",
    "link": "https://biztoc.com/x/915cf0b75abc7dcf",
    "timestamp": "2025-07-10T21:55:21Z"
  },
  {
    "title": "Texas State Sen. Angela Paxton files for divorce from Attorney General Ken Paxton",
    "description": "In a statement, Angela Paxton said she moved to end her 38-year marriage “on biblical grounds.”",
    "link": "https://www.salon.com/2025/07/10/texas-state-sen-angela-paxton-files-for-divorce-from-attorney-general-ken-paxton/",
    "timestamp": "2025-07-10T21:54:38Z"
  },
  {
    "title": "Trump to send $300 million worth of weapons to Ukraine – Reuters",
    "description": "US President Donald Trump will reportedly approve an additional large military aid package for Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621320-trump-sends-more-weapons-ukraine/",
    "timestamp": "2025-07-10T21:53:33Z"
  },
  {
    "title": "Tesla Delaying Its Annual Shareholder Meeting Until November Is Totally Normal, Nothing To See Here, Go On With Your Day",
    "description": "This four-month delay is going to raise all manner of questions about what the heck is going on with Elon Musk's empire.",
    "link": "https://www.jalopnik.com/1909171/tesla-delaying-annual-shareholder-meeting-until-november/",
    "timestamp": "2025-07-10T21:50:46Z"
  },
  {
    "title": "Years later, Trump administration targets key figures in Russia investigation",
    "description": "That the Russia investigation would resurface is unsurprising given Trump’s lingering ire over the inquiry.",
    "link": "https://www.denverpost.com/2025/07/10/justice-department-russia-investigation/",
    "timestamp": "2025-07-10T21:47:29Z"
  },
  {
    "title": "Years later, Trump administration targets key figures in Russia investigation",
    "description": "That the Russia investigation would resurface is unsurprising given Trump’s lingering ire over the inquiry.",
    "link": "https://www.bostonherald.com/2025/07/10/justice-department-russia-investigation/",
    "timestamp": "2025-07-10T21:47:29Z"
  },
  {
    "title": "'Mistakes were made': Trump tells daughter-in-law's Fox News show about assassination attempt",
    "description": "The Secret Service said in a statement that the 13 July 2024, attack was “nothing short of a tragedy”.",
    "link": "https://www.thejournal.ie/trump-tells-daughter-in-laws-fox-news-show-about-assassination-attempt-6759831-Jul2025/",
    "timestamp": "2025-07-10T21:46:49Z"
  },
  {
    "title": "Dean Cain worries about “woke” Superman",
    "description": "The actor feared James Gunn would make too many changes to the comic book hero.",
    "link": "https://www.salon.com/2025/07/10/dean-cain-worries-about-woke-superman/",
    "timestamp": "2025-07-10T21:44:48Z"
  },
  {
    "title": "Trump’s Brazil tariff ‘sets a scary precedent’ given the U.S. has a trade surplus with the country, economists say",
    "description": "Economists have been expressing alarm over U.S. President Donald Trump’s plan to hit Brazil with a 50% tariff on Aug. 1 — the largest country-specific levy out of the 22 that Trump has rolled out this week.",
    "link": "https://biztoc.com/x/f56be98daefd20e0",
    "timestamp": "2025-07-10T21:44:30Z"
  },
  {
    "title": "Nvidia CEO Huang to meet with Trump Thursday, source says",
    "description": "Nvidia NVDA-Q CEO Jensen Huang will meet U.S. President Donald Trump at the White House on Thursday, a day before the chip designer’s head plans to visit China, according to a source familiar with the matter.\nThe meeting with Trump comes as Nvidia’s market va…",
    "link": "https://biztoc.com/x/053d5fe4c74545c2",
    "timestamp": "2025-07-10T21:44:04Z"
  },
  {
    "title": "Many Liberians take offense after Trump praises their leader's English",
    "description": "U.S. President Donald Trump’s praise of the “beautiful” English of Liberia’s President Joseph Boakai drew confusion Thursday in the English-speaking African country and umbrage over what many considered condescending remarks. “Such good English,” Trump said t…",
    "link": "https://japantoday.com/category/world/liberians-confused-and-angry-after-trump%27s-%27condescending%27-praise-for-boakai%27s-%27beautiful-english%27",
    "timestamp": "2025-07-10T21:43:20Z"
  },
  {
    "title": "Rubio says Asia might get 'better' tariffs than others",
    "description": "U.S. Secretary of State Marco Rubio said Thursday that Asian nations might get &quot;better&quot; tariff rates than the rest of the world, as he attended ASEAN talks focused on Washington's trade war. Rubio's visit to Malaysia came after U.S. President Donald…",
    "link": "https://japantoday.com/category/world/rubio-says-asia-might-get-%27better%27-tariffs-than-others",
    "timestamp": "2025-07-10T21:42:53Z"
  },
  {
    "title": "New Hampshire judge pauses Trump’s birthright citizenship order nationwide via class action lawsuit",
    "description": "A federal judge in New Hampshire issued a ruling Thursday prohibiting President Donald Trump’s executive order ending birthright citizenship from taking effect anywhere in the U.S. Judge Joseph LaPlante issued a preliminary injunction blocking Trump's order a…",
    "link": "https://japantoday.com/category/world/new-hampshire-judge-to-hear-arguments-on-class-action-against-trump%E2%80%99s-birthright-citizenship-order",
    "timestamp": "2025-07-10T21:42:47Z"
  },
  {
    "title": "Man charged with attempting to assassinate Trump wants to represent himself in Florida case",
    "description": "Routh is scheduled to stand trial in September, a year after prosecutors say a Secret Service agent thwarted his attempt to shoot Trump as he played golf.",
    "link": "https://www.pbs.org/newshour/nation/man-charged-with-attempting-to-assassinate-trump-wants-to-represent-himself-in-florida-case",
    "timestamp": "2025-07-10T21:42:47Z"
  },
  {
    "title": "Brazil vows retaliatory tariffs against U.S. if Trump follows through on 50% import taxes",
    "description": "Brazilian President Luiz Inácio Lula da Silva said Thursday that he will impose retaliatory tariffs on the United States if President Donald Trump follows through on a pledge to boost import taxes by 50% over the South American country's criminal trial agains…",
    "link": "https://japantoday.com/category/world/brazil-vows-retaliatory-tariffs-against-us-if-trump-follows-through-on-50-import-taxes",
    "timestamp": "2025-07-10T21:42:33Z"
  },
  {
    "title": "Israeli strike kills 16 near Gaza clinic with no immediate truce in sight",
    "description": "An Israeli airstrike hit Palestinians near a medical centre in Gaza on Thursday, killing 10 children and six adults, local health authorities said, as ceasefire talks dragged on with no immediate deal expected. Verified video footage from the strike in Deir a…",
    "link": "https://japantoday.com/category/world/israeli-strike-kills-children-near-gaza-clinic-with-no-immediate-truce-in-sight1",
    "timestamp": "2025-07-10T21:42:20Z"
  },
  {
    "title": "Russia bombards Kyiv before 'frank' talks with U.S. and aid pledges",
    "description": "Russia unleashed heavy airstrikes on Ukraine on Thursday before  a conference in Rome at which Kyiv won billions of dollars in aid pledges, and U.S.-Russian talks at which Washington voiced frustration with Moscow over the war. Two people were killed, 23 were…",
    "link": "https://japantoday.com/category/world/russia-bombards-kyiv-before-%27frank%27-talks-with-us-and-aid-pledges",
    "timestamp": "2025-07-10T21:42:04Z"
  },
  {
    "title": "Will MAGA Cred Let Ken Paxton Survive Yet Another Scandal?",
    "description": "Will MAGA cred let Ken Paxton survive yet another scandal? The Texas attorney general’s newly announced divorce could upend his effort to oust John Cornyn from the U.S. Senate — or loyalty to Trump could save him once again.",
    "link": "http://nymag.com/intelligencer/article/will-maga-cred-let-ken-paxton-survive-yet-another-scandal.html",
    "timestamp": "2025-07-10T21:41:26Z"
  },
  {
    "title": "Conspiracy Theorists Are Turning On the President",
    "description": "MAGA influencers are furious that Trump’s FBI says no more Jeffrey Epstein secrets are forthcoming.",
    "link": "https://www.theatlantic.com/technology/archive/2025/07/epstein-files-trump/683503/",
    "timestamp": "2025-07-10T21:41:11Z"
  },
  {
    "title": "Six months in, half of North Carolinians disapprove of President Trump, according to new Catawba-YouGov Poll",
    "description": "Before his exit from the 2026 election, U.S. Senator Thom Tillis garnered approval of only one-third of North Carolinians; Governor Josh Stein still commands majority approval.",
    "link": "https://www.ncspin.com/six-months-in-half-of-north-carolinians-disapprove-of-president-trump-according-to-new-catawba-yougov-poll",
    "timestamp": "2025-07-10T21:41:10Z"
  },
  {
    "title": "'Restrainers' Urge Trump to Scale Back US Troops on China's Doorstep",
    "description": "The redeployments would encourage allies to shoulder more of their defense and leave U.S. forces less vulnerable to mass missile attacks, the analysts say.",
    "link": "https://www.newsweek.com/restrainers-report-trump-cut-us-troop-numbers-near-china-coast-2097171",
    "timestamp": "2025-07-10T21:40:56Z"
  },
  {
    "title": "Biotech CEOs to FDA: Don’t Let Politics Override Science on Abortion Pill",
    "description": "Fifty-three biotechnology industry leaders and investors representing dozens of companies and organizations issued a letter late last month advising the U.S. Food and Drug Administration: Follow the science on mifepristone, not political ideology. \nThe Biotec…",
    "link": "https://msmagazine.com/2025/07/10/biotech-ceo-sisterhood-fda-trump-politics-science-abortion-pill-mifepristone/",
    "timestamp": "2025-07-10T21:40:52Z"
  },
  {
    "title": "Trump's praise of Liberian leader's 'good English' prompts eye rolls and frustration",
    "description": "Liberians reacted with a mix of anger and weary resignation on Thursday after discovering that Donald Trump, the leader of their country's closest bilateral partner, does not appear to know what language they speak.",
    "link": "https://www.cbc.ca/news/world/liberia-reaction-trump-remarks-1.7582221",
    "timestamp": "2025-07-10T21:40:36Z"
  },
  {
    "title": "Texas AG Ken Paxton’s Wife Files For Divorce—Citing ‘Biblical Grounds’ And ‘Recent Discoveries’",
    "description": "An alleged affair involving Ken Paxton was publicly exposed during his impeachment trial.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/10/texas-ag-ken-paxtons-wife-files-for-divorce-citing-biblical-grounds-and-recent-discoveries/",
    "timestamp": "2025-07-10T21:39:18Z"
  },
  {
    "title": "'Not hard to find!' Trump official's drug-dealing kin floated for deportation",
    "description": "Political consultant Stuart Stevens suggested that the Department of Homeland Security look a little closer to home — perhaps as close as the White House — in its efforts to root out convicted criminals for deportation.Stevens addressed ICE chief Tom Homan on…",
    "link": "https://www.rawstory.com/marco-rubio-2673068099/",
    "timestamp": "2025-07-10T21:39:02Z"
  },
  {
    "title": "Israel’s relocation plan for Palestinians and fading hopes for a ceasefire",
    "description": "Forcibly relocating Palestimians from the Gaza Strip would be a crime against humanity, according to our legal expert.",
    "link": "https://theconversation.com/israels-relocation-plan-for-palestinians-and-fading-hopes-for-a-ceasefire-260933",
    "timestamp": "2025-07-10T21:38:07Z"
  },
  {
    "title": "Trump Held Talks on Pardon for Ghislaine Maxwell: Biographer (Erkki Forster/The Daily Beast)",
    "description": "Erkki Forster / The Daily Beast:\nTrump Held Talks on Pardon for Ghislaine Maxwell: Biographer  —  WHITE HOUSE JITTERS  —  The president agonized over what Jeffrey Epstein's accomplice would reveal upon her arrest, author Michael Wolff said.  —  President Dona…",
    "link": "https://www.memeorandum.com/250710/p128",
    "timestamp": "2025-07-10T21:35:01Z"
  },
  {
    "title": "Trump’s EPA Chief Tried to Debunk Chemtrails, but Nobody Actually Read the Report",
    "description": "EPA administrator Lee Zeldin sought to meet chemtrail conspiracy theorists halfway with new government web pages explaining why they're wrong.",
    "link": "http://www.rollingstone.com/politics/politics-news/chemtrail-conspiracy-theory-epa-lee-zeldin-1235382905/",
    "timestamp": "2025-07-10T21:34:28Z"
  },
  {
    "title": "Live: New details about Rudd's meeting with Trump revealed",
    "description": "New details about a meeting between Australia's ambassador to the US, Kevin Rudd, and President Donald Trump have been revealed. Follow live.",
    "link": "https://www.abc.net.au/news/2025-07-11/federal-politics-live-blog-july-11/105520044",
    "timestamp": "2025-07-10T21:33:59Z"
  },
  {
    "title": "Mahmoud Khalil files $20m claim against Trump for wrongful detention",
    "description": "The Palestinian student activist has accused the Trump administration of smearing his name and unlawful imprisonment.",
    "link": "https://www.aljazeera.com/news/2025/7/10/mahmoud-khalil-files-20m-claim-against-trump-for-wrongful-detention",
    "timestamp": "2025-07-10T21:31:59Z"
  },
  {
    "title": "Firings without explanation create culture of fear at Justice Dept., FBI",
    "description": "Widespread, abrupt terminations have left Justice Department and FBI employees wondering if they will be next, people familiar with the matter say.The Trump administration is firing and pushing out employees across the Justice Department and FBI, often with n…",
    "link": "https://freerepublic.com/focus/f-news/4327987/posts",
    "timestamp": "2025-07-10T21:30:57Z"
  },
  {
    "title": "Dean Phillips' Attack on Mamdani Is an Attack on 'Millions of Working-Class People,' Progressives Say",
    "description": "In an interview with CNN, former Congressman Dean Phillips was asked whether \"there is room\" for him and New York City mayoral candidate Zohran Mamdani in the Democratic Party—but progressive Rep. Summer Lee was among those saying on Thursday that Phillips' r…",
    "link": "https://www.commondreams.org/news/mamdani-voters",
    "timestamp": "2025-07-10T21:30:19Z"
  },
  {
    "title": "Trump to use presidential authority to send weapons to Ukraine, sources say (Mike Stone/Reuters)",
    "description": "Mike Stone / Reuters:\nTrump to use presidential authority to send weapons to Ukraine, sources say  —  President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, …",
    "link": "https://www.memeorandum.com/250710/p126",
    "timestamp": "2025-07-10T21:30:01Z"
  },
  {
    "title": "Asking questions about the Texas flood response isn’t politicizing a tragedy",
    "description": "Chris Hayes says it’s not partisan politics to question the response to the Texas floods, despite what the Trump administration and its allies say.",
    "link": "https://www.msnbc.com/top-stories/latest/texas-floods-government-failures-trump-rcna218109",
    "timestamp": "2025-07-10T21:29:11Z"
  },
  {
    "title": "Former Muslim Chaplain at Cincinnati Children’s Hospital With Alleged Terror-Watch Ties Detained by ICE",
    "description": "Imam Ayman Soliman, formerly a chaplain at Cincinnati Children’s Hospital with suspected ties to a terror watchlist, has been detained by U.S. Immigration & Customs... Read More\nThe post Former Muslim Chaplain at Cincinnati Children’s Hospital With Alleged Te…",
    "link": "https://www.dailysignal.com/2025/07/10/ice-detains-muslim-chaplain-ohio-hospital/",
    "timestamp": "2025-07-10T21:27:53Z"
  },
  {
    "title": "Biden’s physician refuses to answer questions from Republicans in House probe of former president’s mental fitness - NewsBreak",
    "description": "Joe Biden’s White House physician on Wednesday declined to answer questions during a closed-door deposition with the House Oversight Committee, invoking hi",
    "link": "https://www.newsbreak.com/share/4097433982925-biden-s-physician-refuses-to-answer-questions-from-republicans-in-house-probe-of-former-president-s-mental-fitness?_f=app_share&amp;pd=0M94m2uN&amp;lang=en_US&amp;send_time=1752182829&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v7%2Cns_foryou_model_exp_25q2_v2-v7%2Cns_foryou_rank_exp_25q2-v7&amp;s=i2",
    "timestamp": "2025-07-10T21:27:51Z"
  },
  {
    "title": "Pro-Palestine college protest leader sues Trump administration for $20m after detention",
    "description": "Khalil called the lawsuit a “first step towards accountability.”",
    "link": "https://www.thejournal.ie/mahmoud-khalil-sues-trump-20-million-6759809-Jul2025/",
    "timestamp": "2025-07-10T21:25:38Z"
  },
  {
    "title": "Judge Fines Jan. 6 Organizer $2,000 Daily Until She Complies With Subpoena",
    "description": "Caroline Wren was slammed for repeatedly ignoring a subpoena tied to injured Capitol police officers.",
    "link": "https://www.huffpost.com/entry/trump-organizer-caroline-wren-subpoena-fined_n_686ff830e4b045e0e37f781f",
    "timestamp": "2025-07-10T21:25:31Z"
  },
  {
    "title": "Why is Trump targeting Brazil - and will it backfire for Bolsonaro?",
    "description": "The US president's threatened new tariffs are likely to have major political ramifications in the country.",
    "link": "https://www.bbc.com/news/articles/crk68drj57mo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-10T21:22:45Z"
  },
  {
    "title": "US stock market: S&P 500, Nasdaq hit record highs; Delta, Kellogg, United Airlines stocks rally as Copper",
    "description": "The S&P 500 and Nasdaq reached record highs, fueled by Delta's strong earnings and a major acquisition in the food sector. Airline stocks soared following Delta's positive outlook, while WK Kellogg surged on news of its acquisition by Ferrero Group. However, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-sp-500-nasdaq-hit-record-highs-delta-kellogg-united-airlines-stocks-rally-as-copper/articleshow/122373563.cms",
    "timestamp": "2025-07-10T21:22:45Z"
  },
  {
    "title": "Trump’s U-turn on White House secrecy could reshape how future presidents get advice",
    "description": "President Donald Trump is trying to force Joe Biden’s former White House aides to divulge confidential discussions to congressional investigators — using the same tactics he once warned would “do grave damage” to the presidency and the republic. \nTrump’s Whit…",
    "link": "https://biztoc.com/x/9e796930a7e5f70a",
    "timestamp": "2025-07-10T21:21:48Z"
  },
  {
    "title": "Trump’s U-turn on White House secrecy could reshape how future presidents get advice",
    "description": "President Donald Trump is trying to force Joe Biden’s former White House aides to divulge confidential discussions to congressional investigators — using the same tactics he once warned would “do grave damage” to the presidency and the republic. \nTrump’s Whit…",
    "link": "https://biztoc.com/x/9e796930a7e5f70a",
    "timestamp": "2025-07-10T21:21:48Z"
  },
  {
    "title": "Trump To Invoke Foreign Aid Law To Send More Weapons To Ukraine",
    "description": "President Donald Trump could send as much as $300 million in military aid to Ukraine, one source told Reuters.",
    "link": "https://biztoc.com/x/849d5b3d92aaa8a0",
    "timestamp": "2025-07-10T21:21:24Z"
  },
  {
    "title": "France and U.K. Sign Key Deals on Migration, Nuclear Weapons",
    "description": "The agreements signal a new chapter of post-Brexit Anglo-French cooperation.",
    "link": "http://foreignpolicy.com/2025/07/10/uk-france-migration-nuclear-weapons-deal-starmer-macron/",
    "timestamp": "2025-07-10T21:20:05Z"
  },
  {
    "title": "Trump To Invoke Foreign Aid Law To Send More Weapons To Ukraine",
    "description": "President Donald Trump could send as much as $300 million in military aid to Ukraine, one source told Reuters.",
    "link": "https://www.newsweek.com/trump-presidential-drawdown-authority-ukraine-weapons-2097535",
    "timestamp": "2025-07-10T21:19:47Z"
  },
  {
    "title": "US tariffs of 200pc on pharma could lead to shortages of medicine - Taoiseach",
    "description": "Tariffs of 200pc threatened by US president Donald Trump on pharmaceuticals could lead to shortages of medicine, according to Taoiseach Micheál Martin.",
    "link": "https://www.independent.ie/irish-news/politics/us-tariffs-of-200pc-on-pharma-could-lead-to-shortages-of-medicine-taoiseach/a555098038.html",
    "timestamp": "2025-07-10T21:19:24Z"
  },
  {
    "title": "US tariffs of 200pc on pharma could lead to shortages of medicine - Taoiseach",
    "description": "Tariffs of 200pc threatened by US president Donald Trump on pharmaceuticals could lead to shortages of medicine, according to Taoiseach Micheál Martin.",
    "link": "https://www.independent.ie/irish-news/us-tariffs-of-200pc-on-pharma-could-lead-to-shortages-of-medicine-taoiseach/a555098038.html",
    "timestamp": "2025-07-10T21:19:24Z"
  },
  {
    "title": "Brazil vows retaliatory tariffs against US if Trump follows through on 50% import taxes",
    "description": "Lula’s comments raise the risk of a tariffs war erupting between the two countries.",
    "link": "https://www.bostonherald.com/2025/07/10/brazil-trump-tariffs/",
    "timestamp": "2025-07-10T21:18:36Z"
  },
  {
    "title": "Greg Abbott Moves to Rig the Midterms Amid Texas Floods",
    "description": "Governor Greg Abbot is trying to further gerrymander Texas while his state recovers from some of the deadliest flooding in its history.On Wednesday, Abbot told state lawmakers to begin the redistricting process as he positions Republicans to maintain control …",
    "link": "https://newrepublic.com/post/197841/greg-abbott-redistricting-maps-texas-floods",
    "timestamp": "2025-07-10T21:18:11Z"
  },
  {
    "title": "Trading Day: New highs, almost no news",
    "description": "This week, the default reflex on Wall Street, without any economic data or major market news to react to, and even with now-routine White House tariff edicts...",
    "link": "https://finance.yahoo.com/news/trading-day-highs-almost-no-211750998.html",
    "timestamp": "2025-07-10T21:17:50Z"
  },
  {
    "title": "DoD torpedoes nomination of admiral who facilitated drag shows on USS Ronald Reagan",
    "description": "'Every military officer takes command of units large and small with the understanding they are responsible for everything that does and does not happen under their command'",
    "link": "https://www.wnd.com/2025/07/dod-torpedoes-nomination-admiral-who-facilitated-drag-shows/",
    "timestamp": "2025-07-10T21:16:03Z"
  },
  {
    "title": "The not-so-subtle 2028 shadow primary intensifies: From the Politics Desk",
    "description": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/not-subtle-2028-shadow-primary-intensifies-politics-desk-rcna218137",
    "timestamp": "2025-07-10T21:13:03Z"
  },
  {
    "title": "Terry Gilliam Says Satire Was “Basically Dead,” But Trump “Destroyed” It",
    "description": "The Monty Python filmmaker says Trump's second term in office has basically \"killed my movie\" -- in more ways than one.\nTerry Gilliam Says Satire Was “Basically Dead,” But Trump “Destroyed” It\nBen Kaye",
    "link": "https://consequence.net/2025/07/terry-gilliam-donald-trump-killed-satire/",
    "timestamp": "2025-07-10T21:12:24Z"
  },
  {
    "title": "Trump to Use His Authority to Send Weapons to Ukraine",
    "description": "\"President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, a move suggesting new interest by the president in defending",
    "link": "https://politicalwire.com/2025/07/10/trump-to-use-his-authority-to-send-weapons-to-ukraine/",
    "timestamp": "2025-07-10T21:10:54Z"
  },
  {
    "title": "Trump Admins Ends Taxpayer Subsidies For Illegal Aliens",
    "description": "The wide-ranging move ends a nearly 30-year period of government incentivizing illegal immigration by allowing illegals to benefit from programs meant for Americans.",
    "link": "https://thefederalist.com/2025/07/10/trump-admins-ends-taxpayer-subsidies-for-illegal-aliens/",
    "timestamp": "2025-07-10T21:10:30Z"
  },
  {
    "title": "Trump Finds Retreating From World Stage Is Easier Said Than Done",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWhen Donald Trump campaigned for the presidency in 2016, 2020 and 2024, he made one overarching promise to voters: no more costly overseas entanglements.\nIn a video rolling out his foreign policy agenda during…",
    "link": "https://biztoc.com/x/1d41db2111483399",
    "timestamp": "2025-07-10T21:10:08Z"
  },
  {
    "title": "BRICS in Rio: From Global South to global power",
    "description": "The 17th BRICS summit was more than a photo op. It was a coordinated rejection of Western power – and a declaration of intent Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621315-brics-in-rio-global-power/",
    "timestamp": "2025-07-10T21:09:31Z"
  },
  {
    "title": "Trump to use presidential authority to send weapons to Ukraine, sources say",
    "description": "President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, two sources familiar with the decision said on Thursday, a move suggesting new interest by the preside…",
    "link": "https://freerepublic.com/focus/f-chat/4327982/posts",
    "timestamp": "2025-07-10T21:09:28Z"
  },
  {
    "title": "CASEY RYAN: Woke Universities Cave To Trump Administration",
    "description": "Despite talking a big game in recent years, universities that once championed biological men playing in women’s sports are now backing down amid the Trump administration’s threats to defund them. During the previous administration and even before, universitie…",
    "link": "https://dailycaller.com/2025/07/10/opinion-woke-universities-cave-to-trump-administration-casey-ryan/",
    "timestamp": "2025-07-10T21:07:18Z"
  },
  {
    "title": "Car Shopping? The ‘Big, Beautiful Bill’ May Change What You Pay",
    "description": "For car buyers, the one big, beautiful bill can be a gain or loss. The new law reintroduces an auto loan interest tax deduction but ends the EV tax credit.",
    "link": "https://www.nerdwallet.com/article/loans/auto-loans/big-beautiful-bill-car-buyers#article",
    "timestamp": "2025-07-10T21:07:17Z"
  },
  {
    "title": "Joe Rogan Met Up With Trump Days Before Trashing His ICE Raids",
    "description": "Joe Rogan, podcaster and prominent supporter of Donald Trump’s presidential bid, is souring on the administration’s immigration agenda.The Washington Post reported Wednesday that Rogan, who dined with the president on June 30, “has discussed immigration polic…",
    "link": "https://newrepublic.com/post/197837/joe-rogan-trump-dinner-ice-criticism",
    "timestamp": "2025-07-10T21:06:53Z"
  },
  {
    "title": "Rosenberg: Putin determined to press on despite threat of tougher sanctions",
    "description": "Despite pressure from Donald Trump's White House, Russia remain committed to its war effort in Ukraine.",
    "link": "https://www.bbc.com/news/videos/cz9kqe5v379o",
    "timestamp": "2025-07-10T21:05:58Z"
  },
  {
    "title": "Trump's New Ambassador Pick Loves Hooters, Casual Misogyny And 'Foursomes With The Boys'",
    "description": "Self-described \"alpha man\" Nick Adams will be the U.S. ambassador to Malaysia if confirmed.",
    "link": "https://www.huffpost.com/entry/trumps-ambassador-nick-adams_n_68700c1ce4b00de383c0034d",
    "timestamp": "2025-07-10T21:05:56Z"
  },
  {
    "title": "John Brennan, James Comey Perjured Themselves, New CIA Memo Appears To Show",
    "description": "John Brennan and James Comey may have perjured themselves when insisting that the discredited Steele Dossier did not serve as the basis for RussiaGate.",
    "link": "https://dailycaller.com/2025/07/10/obama-james-comey-john-brennan-john-ratcliffe-james-clapper-russiagate-steele-dossier/",
    "timestamp": "2025-07-10T21:05:50Z"
  },
  {
    "title": "Higher premiums and lost coverage: How Trump's budget will change health care in California (CalMatters)",
    "description": "CalMatters:\nHigher premiums and lost coverage: How Trump's budget will change health care in California  —  Lower-income people will be the hardest hit.  Over the next 10 years, 3.4 million Californians could lose coverage. … The new federal budget signed int…",
    "link": "https://www.memeorandum.com/250710/p123",
    "timestamp": "2025-07-10T21:05:02Z"
  },
  {
    "title": "Trump administration launches probe of DEI policy at George Mason University",
    "description": "The probe is based on a complaint by George Mason University professors who allege that personnel decisions underrepresented groups.",
    "link": "https://www.cnbc.com/2025/07/10/trump-dei-george-mason-gregory-washington.html",
    "timestamp": "2025-07-10T21:04:26Z"
  },
  {
    "title": "A ‘blueprint for silencing dissent’: Fears for free speech in envoy’s antisemitism crackdown",
    "description": "Special envoy to combat antisemitism Jillian Segal has laid out her plan to tackle antisemitism in Australia. Some Jewish groups have welcomed the recommendations, but there are wider fears of threats to freedom of expression. \nThe post A ‘blueprint for silen…",
    "link": "http://www.crikey.com.au/2025/07/11/antisemitism-envoy-jillian-segal-aukus-israel-free-speech/",
    "timestamp": "2025-07-10T21:03:39Z"
  },
  {
    "title": "Trump Finds Retreating From World Stage Is Easier Said Than Done",
    "description": "President Trump is learning that campaigning on isolationism is easy. Following through is another matter.",
    "link": "https://www.newsweek.com/america-first-trump-foreign-policy-russia-ukraine-iran-2097302",
    "timestamp": "2025-07-10T21:03:38Z"
  },
  {
    "title": "Billy Bush Says He Offered Matt Lauer Moral Support for #MeToo Firing — Despite His Cold Shoulder After Trump Tape | Video",
    "description": "The \"Hot Mics\" podcast host adds he confronted Lauer for not publicly defending him after the 2016 Trump scandal got him fired from \"Today\"\nThe post Billy Bush Says He Offered Matt Lauer Moral Support for #MeToo Firing — Despite His Cold Shoulder After Trump …",
    "link": "https://www.thewrap.com/billy-bush-supported-matt-lauer-metoo-firing-today-show-nbc/",
    "timestamp": "2025-07-10T21:01:33Z"
  },
  {
    "title": "As Supreme Court hands more power to Trump, labor may lose, union officials say",
    "description": "A move in May by the Supreme Court may signal the end of the NLRB’s independence, labor leaders say.",
    "link": "https://www.usatoday.com/story/money/2025/07/10/labor-boards-independence-threatened/84497129007/",
    "timestamp": "2025-07-10T21:01:22Z"
  },
  {
    "title": "FOX News Absolutely Crushing Competition in Ratings, Including Broadcast Networks",
    "description": "\"Fox News averaged 2.8 million viewers during weekday primetime during the week of June 30 through July 6, compared to 2.4 million for NBC, two million for CBS and 1.9 million for ABC.\"\nThe post FOX News Absolutely Crushing Competition in Ratings, Including B…",
    "link": "https://legalinsurrection.com/2025/07/fox-news-absolutely-crushing-competition-in-ratings-including-broadcast-networks/",
    "timestamp": "2025-07-10T21:00:39Z"
  },
  {
    "title": "Senate Confirms Jonathan Gould as Comptroller of the Currency",
    "description": "The U.S. Senate voted Thursday (July 10) to confirm the nomination of Jonathan Gould to be comptroller of the currency for a five-year term. [contact-form-7] Gould was confirmed by a vote of 50- 45, with five senators not voting, according to the Senate’s rol…",
    "link": "http://www.pymnts.com/news/regulation/2025/senate-confirms-jonathan-gould-comptroller-currency-occ/",
    "timestamp": "2025-07-10T21:00:25Z"
  },
  {
    "title": "Hunting for clergy to work in Gitmo...",
    "description": "Exclusive: The chaplain will earn between $28 and $32 an hour and will minister to ‘major Christian denominations,’ as well as ‘Islam, Hinduism, Rastafarian, Judaism, etc,’ according to an ICE solicitation reviewed by The Independent",
    "link": "https://www.the-independent.com/news/world/americas/ice-immigration-deported-guantanamo-religion-b2786738.html",
    "timestamp": "2025-07-10T21:00:03Z"
  },
  {
    "title": "Elon Musk Attempts to Launch a Viable Third Party Via Social Media Post",
    "description": "Does he have the coherent ideology or attention span to pull it off?",
    "link": "https://slate.com/podcasts/political-gabfest/2025/07/politics-elon-musk-faces-uphill-battle-in-establishing-a-third-party",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "A fourth Democrat, lawyer Melvin Tull, seeks to challenge Wittman",
    "description": "A fourth candidate, attorney Melvin Tull,, has joined the list of Democrats seeking to challenge Rep. Rob Wittman, R-1st.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_1e808df6-5417-465f-8d37-6981a627ecf1.html",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "The One Place Where Nuclear War Isn’t Abstract",
    "description": "A conversation with Ross Andersen about what he saw in Hiroshima",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/japan-hiroshima-nagasaki-nuclear-warfare/683501/",
    "timestamp": "2025-07-10T21:00:00Z"
  },
  {
    "title": "Most Fed Officials Expect 2025 Rate Cuts Despite Tariff Inflation Concerns, Minutes Show",
    "description": "Topline\nThe Federal Reserve still believes tariffs complicate the interest rate cut picture, even as President Donald Trump attacks the central bank.\nKey Facts\n“Most” Fed staff believe the central bank will lower interest rates in 2025, according to minutes r…",
    "link": "https://biztoc.com/x/332c9bb23682b8d8",
    "timestamp": "2025-07-10T20:58:56Z"
  },
  {
    "title": "Ruble hits two-year high against dollar",
    "description": "The Russian currency has also surged against the euro, boosted by government policy support Read Full Article at RT.com",
    "link": "https://www.rt.com/business/621317-ruble-growth-dollar-euro/",
    "timestamp": "2025-07-10T20:58:56Z"
  },
  {
    "title": "Jon Jones hit with new charge and duplicate charge related to car accident in February, attorney files to dismiss",
    "description": "Jon Jones was hit with new charges related to a car accident back in February where he’s accused of leaving the scene of an accident but the second case also alleges a new charge, which is attorney has filed to get dismissed.",
    "link": "https://www.mmafighting.com/2025/7/10/24465374/jon-jones-hit-new-charge-duplicate-charge-related-car-accident-in-february-attorney-files-to-dismiss",
    "timestamp": "2025-07-10T20:57:42Z"
  },
  {
    "title": "Why the plan to wipe out antisemitism on Australian campuses is not a simple one",
    "description": "Jillian Segal’s plan to combat antisemitism recommends giving herself a role in vetoing funding to universities and their researchers.",
    "link": "https://www.abc.net.au/news/2025-07-11/university-antisemitism-funding-cuts-analysis/105518780",
    "timestamp": "2025-07-10T20:56:26Z"
  },
  {
    "title": "Breitbart Business Digest: How to Think About Trump’s Unorthodox Monetary Policy",
    "description": "In a recent series of Truth Social posts, the president made the case that the strength of the U.S. economy justifies lower interest rates.\nThe post Breitbart Business Digest: How to Think About Trump’s Unorthodox Monetary Policy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/10/breitbart-business-digest-how-to-think-about-trumps-unorthodox-monetary-policy/",
    "timestamp": "2025-07-10T20:55:46Z"
  },
  {
    "title": "Mahmoud Khalil Seeking $20 Million in Damages from Trump Administration",
    "description": "Pro-Palestinian activist Mahmoud Khalil is seeking $20 million in damages from President Donald Trump's administration after months in custody.\nThe post Mahmoud Khalil Seeking $20 Million in Damages from Trump Administration first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/mahmoud-khalil-seeking-20-million-in-damages-from-trump-administration/",
    "timestamp": "2025-07-10T20:54:04Z"
  },
  {
    "title": "Progressives, Democrats Vow Fight as Senate GOP Aims to Claw Back Billions in Federal Funding",
    "description": "The U.S. Senate will soon vote on whether President Donald Trump can claw back billions of dollars that have already been appropriated by Congress.Last month, the House narrowly voted to allow Trump to rescind $9.4 billion in funds that were meant to fund glo…",
    "link": "https://www.commondreams.org/news/senate-gop-rescissions-bill",
    "timestamp": "2025-07-10T20:51:09Z"
  },
  {
    "title": "Andrew Schulz UNLOADS on Donald Trump: What a Hypocrite and Liar!",
    "description": "Reading Time: 3 minutesAndrew Schulz sounds like he wishes he had NOT voted for Donald Trump in November. Check out what the comedian says here about the President.\nAndrew Schulz UNLOADS on Donald Trump: What a Hypocrite and Liar! was originally published on …",
    "link": "http://www.thehollywoodgossip.com/2025/07/andrew-schulz-unloads-on-donald-trump-what-a-hypocrite-and-liar/",
    "timestamp": "2025-07-10T20:50:48Z"
  },
  {
    "title": "LIVE: ICE agents, protesters clash during raid at Ventura County farm",
    "description": "Several federal agents were seen at a farm in Ventura County Thursday morning.",
    "link": "https://freerepublic.com/focus/f-bloggers/4327977/posts",
    "timestamp": "2025-07-10T20:48:32Z"
  },
  {
    "title": "WaPo enlists actual clown to set the record straight in scathing op-ed: Trump is not one of us",
    "description": "The Washington Post published an opinion piece defending the good name of clowns everywhere, fervently insisting President Trump doesn't deserve the harlequin moniker his rivals frequently foist upon him.",
    "link": "https://nypost.com/2025/07/10/us-news/wapo-enlists-actual-clown-to-set-the-record-straight-in-scathing-op-ed-trump-is-not-one-of-us/",
    "timestamp": "2025-07-10T20:47:26Z"
  },
  {
    "title": "Fight over new FBI headquarters site stalls government funding bill",
    "description": "A fight over where to relocate the FBI’s headquarters ground the Senate appropriations process to a halt on Thursday ahead of a Sept. 30 deadline.",
    "link": "https://www.nbcnews.com/politics/congress/fight-new-fbi-headquarters-location-stalls-government-funding-bill-rcna218134",
    "timestamp": "2025-07-10T20:46:04Z"
  },
  {
    "title": "Brazilian oil could find new destinations in the face of Trump's tariffs",
    "description": "RIO DE JANEIRO (Reuters) -Brazil has logistical and commercial flexibility to preserve the competitiveness of its oil on the international market if the 50% ...",
    "link": "https://finance.yahoo.com/news/brazilian-oil-could-destinations-face-204553052.html",
    "timestamp": "2025-07-10T20:45:53Z"
  },
  {
    "title": "Trump's tariffs on Brazil could make your coffee even more expensive",
    "description": "President Donald Trump’s proposed 50% tariff on Brazilian imports is bad news for coffee drinkers",
    "link": "https://www.nbcnews.com/business/business-news/trumps-tariffs-brazil-make-coffee-even-expensive-rcna218127",
    "timestamp": "2025-07-10T20:45:44Z"
  },
  {
    "title": "‘Sovereign’ Review: In the Rare Thriller That’s Truly Political, Nick Offerman Is Powerful as a Lost Soul of the New Right",
    "description": "What \"Sovereign\" dramatizes is that in the face of a controlling technological bureaucratic society (the tech isn’t incidental — it’s the means of control), the desire for authority, for dignity, for sovereignty, for a basic sense of power over one’s life is …",
    "link": "https://variety.com/2025/film/reviews/sovereign-review-nick-offerman-jacob-tremblay-1236450661/",
    "timestamp": "2025-07-10T20:45:09Z"
  },
  {
    "title": "How Trump is crushing DEI in law and medical schools",
    "description": "How Trump is crushing DEI in law and medical schoolstheblaze.com",
    "link": "https://www.theblaze.com/news/trump-linda-mcmahon-harvard-dei",
    "timestamp": "2025-07-10T20:45:00Z"
  },
  {
    "title": "Trump-obsessed conspiracy theorist beheaded his dad on YouTube after making ‘citizens arrest’",
    "description": "Justin Mohn claimed his father was trying to stop him from becoming the next Donald Trump, and accused him of committing treason",
    "link": "https://www.the-independent.com/news/world/americas/crime/trump-conspiracy-theorist-trial-beheaded-father-b2786767.html",
    "timestamp": "2025-07-10T20:44:35Z"
  },
  {
    "title": "'Laughing at us': War vet slams Trump after jarring gaffe with foreign leader",
    "description": "President Donald Trump had a cringeworthy moment with world leaders this week, an MSNBC panel argued on Thursday. Trump was meeting with five African leaders, including Liberian President Joseph Boakai. “Where did you learn to speak so beautifully?” Trump gus…",
    "link": "https://www.rawstory.com/trump-liberia-2673067956/",
    "timestamp": "2025-07-10T20:44:04Z"
  },
  {
    "title": "Trump’s New Tariffs Could Cost Households $2,400 This Year, Analysis Finds",
    "description": "Prices of clothing and shoes are expected to be particularly impacted by the tariffs, Yale University’s Budget Lab found.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/10/trumps-new-tariffs-could-cost-households-2400-this-year-analysis-finds/",
    "timestamp": "2025-07-10T20:43:24Z"
  }
]