[
  {
    "title": "House Rejects Bipartisan Attempt To Block Trump From Using Military Force Against Venezuela",
    "description": "The House of Representatives rejected a bipartisan attempt Wednesday evening to reign in President Donald Trump’s authority to use force against Venezuela. Lawmakers voted 211 to 213 against a war powers resolution that would have blocked Trump from using mil…",
    "link": "https://dailycaller.com/2025/12/17/house-rejects-war-powers-trump-venezuela/",
    "timestamp": "2025-12-17T23:35:12Z"
  },
  {
    "title": "NEW: White House Installs Plaques Under Presidential Portraits on White House Walk of Fame – ROASTS Biden and Obama: “By Far, the Worst President in American history” and “One of the Most Divisive Political Figures in American History”",
    "description": "President Trump unleashed a new addition to the Presidential Walk of Fame in the White House Rose Garden, where portraits of all 47 US Presidents are displayed.Trump famously replaced the picture of Joe Biden with an autopen, taking a jab at the 46th Presiden…",
    "link": "https://freerepublic.com/focus/f-news/4357889/posts",
    "timestamp": "2025-12-17T23:34:51Z"
  },
  {
    "title": "CNBC’s Sorkin Presses a Waffling Mike Johnson on Trump’s Reiner Comments: ‘You Can Hold Two Ideas in Your Head’",
    "description": "CNBC host Andrew Ross Sorkin pressed Speaker Mike Johnson to respond to some cruel remarks from President Donald Trump.\nThe post CNBC’s Sorkin Presses a Waffling Mike Johnson on Trump’s Reiner Comments: ‘You Can Hold Two Ideas in Your Head’ first appeared on …",
    "link": "https://www.mediaite.com/media/tv/cnbcs-sorkin-presses-a-waffling-mike-johnson-on-trumps-reiner-comments-you-can-hold-two-ideas-in-your-head/",
    "timestamp": "2025-12-17T23:34:35Z"
  },
  {
    "title": "Trump Officials Celebrated With Cake After Slashing Aid. Then People Died of Cholera.",
    "description": "This story wasoriginally publishedby ProPublica.Republished under aCC BY-NC-ND 3.0license. The original has additional imagery which is worth checking out as well. On the one-month anniversary of President Donald Trump’s inauguration earlier this year, a grou…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180413467",
    "timestamp": "2025-12-17T23:33:06Z"
  },
  {
    "title": "Trump to address nation on 1st year in office, 2026 agenda",
    "description": "President Donald Trump will address the nation on Wednesday night to reflect on his first year in office and preview next year's agenda.",
    "link": "https://abcnews.go.com/Politics/trump-address-nation-1st-year-office-2026-agenda/story?id=128498252",
    "timestamp": "2025-12-17T23:32:50Z"
  },
  {
    "title": "Dan Bongino stepping down as FBI deputy director",
    "description": "Dan Bongino has said he will leave his role as the FBI's deputy director in January. \"I want to thank President Trump, AG (Pam) Bondi, and Director (Kash) Patel for the opportunity to serve with purpose,\" Bongino wrote on X. It comes after US President Donald…",
    "link": "https://freerepublic.com/focus/f-news/4357888/posts",
    "timestamp": "2025-12-17T23:29:53Z"
  },
  {
    "title": "Charlie Kirk’s suspected assassin bragged about his Wordle score just before pulling the trigger, online messages reveal",
    "description": "Just 55 minutes after Tyler Robinson messaged a friend about his Wordle score, he allegedly fired the single shot that killed Charlie Kirk",
    "link": "https://www.the-independent.com/news/world/americas/crime/charlie-kirk-shooter-suspect-tyler-robinson-wordle-b2886636.html",
    "timestamp": "2025-12-17T23:29:27Z"
  },
  {
    "title": "‘Trump Accounts’ for kids get funding boost from Dalio and BlackRock",
    "description": "BlackRock said it would match the federal government’s contributions to the accounts for employees’ children, seeding them with $1,000 each.",
    "link": "https://fortune.com/2025/12/17/trump-accounts-for-kids-get-funding-boost-from-dalio-and-blackrock/",
    "timestamp": "2025-12-17T23:25:56Z"
  },
  {
    "title": "House Republican Blasts Trump’s Venezuela Sabre-Rattling: ‘This is About Oil and Regime Change’",
    "description": "\"If it were about drugs, we'd bomb Mexico, or China, or Colombia, and the president would not have pardoned Juan Orlando Hernández. This is about oil and regime change.\"\nThe post House Republican Blasts Trump’s Venezuela Sabre-Rattling: ‘This is About Oil and…",
    "link": "https://www.mediaite.com/politics/house-republican-blasts-trumps-venezuela-sabre-rattling-this-is-about-oil-and-regime-change/",
    "timestamp": "2025-12-17T23:23:12Z"
  },
  {
    "title": "Trump is breaking apart a scientific crown jewel",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is moving to dismantle a crit…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/472774/trump-russ-vought-dismantle-climate-research-center-ncar",
    "timestamp": "2025-12-17T23:23:06Z"
  },
  {
    "title": "Trump Officials Celebrated With Cake After Slashing Aid. Then People Died of Cholera.",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. The original has additional imagery which is worth checking out as well. On the one-month anniversary of President Donald Trump’s inauguration earlier this year, a…",
    "link": "https://www.techdirt.com/2025/12/17/trump-officials-celebrated-with-cake-after-slashing-aid-then-people-died-of-cholera/",
    "timestamp": "2025-12-17T23:23:01Z"
  },
  {
    "title": "Jeanine Pirro's ‘Investigation’ Into DC Crime Stats Ends With No Criminal Charges",
    "description": "United States Attorney for the District of Columbia Jeanine Pirro announced she was ending an investigation into crime statistics in D.C. without filing criminal charges.\n\n\nIn August, President Donald Trump claimed that \"D.C. gave Fake Crime numbers in order …",
    "link": "https://crooksandliars.com/2025/12/jeanine-pirros-investigation-dc-crime",
    "timestamp": "2025-12-17T23:20:42Z"
  },
  {
    "title": "The Internet Is Having a Field Day Over the Photo Choices in Vanity Fair’s Explosive White House Exposé",
    "description": "Shockwaves are still reverberating across the Beltway a day after Vanity Fair dropped a stunning look inside the Donald Trump White House, straight from the mouth of chief of staff Susie Wiles, but it's not just the words — it's the pictures.\nThe post The Int…",
    "link": "https://www.mediaite.com/media/the-internet-is-having-a-field-day-over-the-photo-choices-in-vanity-fairs-explosive-white-house-expose/",
    "timestamp": "2025-12-17T23:20:16Z"
  },
  {
    "title": "Average home heating costs could hit $1,000 this winter. Here's why.",
    "description": "For many people in the U.S., this winter is getting colder — and staying warm is getting more expensive.",
    "link": "https://www.nbcnews.com/business/personal-finance/winter-heating-costs-power-rcna249808",
    "timestamp": "2025-12-17T23:18:46Z"
  },
  {
    "title": "Why a key group of Republicans broke ranks on Obamacare subsidies: From the Politics Desk",
    "description": "A key group of House Republicans broke ranks with Speaker Mike Johnson and teamed up with Democrats to force a vote on extending Obamacare subsidies.",
    "link": "https://www.nbcnews.com/politics/politics-news/key-group-republicans-broke-ranks-obamacare-subsidies-politics-desk-rcna249805",
    "timestamp": "2025-12-17T23:18:42Z"
  },
  {
    "title": "Defense bill bans males from women's sports at military academies",
    "description": "The 2025 National Defense Authorization Act will ban biological males from women's sports at U.S. military academies after passing the Senate 77-20.",
    "link": "https://www.foxnews.com/sports/defense-bill-bans-males-from-womens-sports-military-academies",
    "timestamp": "2025-12-17T23:16:46Z"
  },
  {
    "title": "Bongino is bongoing",
    "description": "How bad is it when one of these pigs willingly unclamps their snout from the government teat? I hope it was really bad, but it was probably just the rigors of having to work in an office after being a podcaster and failing to find enough Maryland voters who w…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/bongino-is-bongoing",
    "timestamp": "2025-12-17T23:16:32Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino says he plans to resign next month as bureau's No 2 official",
    "description": "FBI Deputy Director Dan Bongino said Wednesday that he will resign from the bureau next month, ending a brief and tumultuous tenure in which he clashed with the Justice Department over the handling of the Jeffrey Epstein files and was forced to reconcile the …",
    "link": "https://japantoday.com/category/world/fbi-deputy-director-dan-bongino-says-he-plans-to-resign-next-month-as-bureau%27s-no-2-official",
    "timestamp": "2025-12-17T23:15:15Z"
  },
  {
    "title": "Dan Bongino says he's leaving as deputy FBI director in January",
    "description": "Deputy FBI Director Dan Bongino has been telling colleagues that he will likely leave in the new year, according to sources familiar with his thinking.",
    "link": "https://abcnews.go.com/Politics/dan-bongino-leaving-deputy-fbi-director-january/story?id=128501072",
    "timestamp": "2025-12-17T23:14:39Z"
  },
  {
    "title": "Trump about to wage war on Venezuela? Tucker Carlson makes bold claim ahead of US President's televised address",
    "description": "Conservative commentator Tucker Carlson made a startling claim that President Donald Trump may use his upcoming televised address to announce war with Venezuela. Carlson was speaking on the online show Judging Freedom. The right-winger said he was told by a m…",
    "link": "https://freerepublic.com/focus/f-news/4357884/posts",
    "timestamp": "2025-12-17T23:14:37Z"
  },
  {
    "title": "Rumor claiming Rob Reiner said he wished would-be Trump assassin 'hadn't missed' is unfounded",
    "description": "Footage does, however, exist of the filmmaker condemning political violence, such as the killing of late conservative activist Charlie Kirk.",
    "link": "https://www.snopes.com//news/2025/12/17/reiner-trump-assassination-attempt/",
    "timestamp": "2025-12-17T23:14:00Z"
  },
  {
    "title": "‘I think he wants to go back to his show’: Dan Bongino retreats from FBI back to conspiracy podcasting",
    "description": "“I was paid in the past for my opinions,” Bongino said in a Fox News interview. “One day I will be back in that space.\"",
    "link": "https://fortune.com/2025/12/17/dan-bongino-fbi-deputy-director-resigns-podcasts-trump-maga/",
    "timestamp": "2025-12-17T23:13:54Z"
  },
  {
    "title": "Trump Health Concerns: 'Healthiest' POTUS Claims Physician Rated Him Above Biden And Obama",
    "description": "Donald Trump sparks a health row after claiming Dr. Ronny Jackson rated him 'healthiest' POTUS.",
    "link": "https://www.ibtimes.com/trump-health-concerns-healthiest-potus-claims-physician-rated-him-above-biden-obama-3793002",
    "timestamp": "2025-12-17T23:11:08Z"
  },
  {
    "title": "FBI deputy chief Dan Bongino to leave post in January",
    "description": "FBI Deputy Director Dan Bongino will step down from his post next month, he said on Wednesday, ending a short and at times tumultuous tenure as the bureau's second highest-ranking official.",
    "link": "https://www.cbc.ca/news/world/dan-bongino-fbi-resignation-9.7020221",
    "timestamp": "2025-12-17T23:11:00Z"
  },
  {
    "title": "Whoopi Goldberg Fury: Host Slams Trump, Tells Silent Republicans 'D--- You All' On Air",
    "description": "Whoopi Goldberg delivers a fiery on-air rebuke of Trump and GOP lawmakers over controversial remarks tied to Rob Reiner's death.",
    "link": "https://www.ibtimes.com/whoopi-goldberg-fury-host-slams-trump-tells-silent-republicans-d-you-all-air-3793003",
    "timestamp": "2025-12-17T23:10:27Z"
  },
  {
    "title": "Missouri is trying to collect on a $25 billion court judgment over what caused the pandemic. China sued in response",
    "description": "\"This lawsuit is a stalling tactic and tells me that we have been on the right side of this issue all along,” Attorney General Catherine Hanaway said.",
    "link": "https://fortune.com/2025/12/17/missouri-china-lawsuit-25-billion-what-caused-pandemic-covid/",
    "timestamp": "2025-12-17T23:10:04Z"
  },
  {
    "title": "Mexican President Sheinbaum Calls UN To Get Involved In U.S.-Venezuela Tensions To 'Avoid Any Bloodshed'",
    "description": "Mexican President Claudia Sheinbaum called on the UN to get involved in the conflict between the U.S. and Venezuela to \"avoid any bloodshed\" after President Donald Trump announced a blockade of \"sanctioned\" tankers off the South American country's coast.",
    "link": "https://www.ibtimes.com/mexican-president-sheinbaum-calls-un-get-involved-us-venezuela-tensions-avoid-any-bloodshed-3793007",
    "timestamp": "2025-12-17T23:09:22Z"
  },
  {
    "title": "Trump Slams Congress for 'Hating Israel' During Hanukkah Speech, Critics Question Extravagant $400M Ballroom",
    "description": "Donald Trump accused Congress of 'hating Israel' during a White House Hanukkah speech, while critics questioned his plan for a lavish $400 million White House ballroom.",
    "link": "https://www.ibtimes.com/trump-slams-congress-hating-israel-during-hanukkah-speech-critics-question-extravagant-400m-3793009",
    "timestamp": "2025-12-17T23:08:38Z"
  },
  {
    "title": "Ex-podcaster Dan Bongino stepping down as deputy FBI director",
    "description": "Deputy FBI director Dan Bongino, a former right-wing podcaster, announced on Wednesday that he would step down in January after less than 10 months on the job. The 51-year-old Bongino, in a post on X announcing his resignation, did not give a reason for the m…",
    "link": "https://www.digitaljournal.com/world/ex-podcaster-dan-bongino-stepping-down-as-deputy-fbi-director/article",
    "timestamp": "2025-12-17T23:08:22Z"
  },
  {
    "title": "Golf Channel Games feature Rory McIlroy, Scottie Scheffler teams battling in unique competition",
    "description": "The eight-man, two-team, head-to-head battle goes down in South Florida",
    "link": "https://www.cbssports.com/golf/news/golf-channel-games-2025-where-to-watch-tv-channel-format-rory-mcilroy-scottie-scheffler/",
    "timestamp": "2025-12-17T23:06:06Z"
  },
  {
    "title": "$1,776 Checks for the Military",
    "description": "The president is considering bonuses for many service members.",
    "link": "https://www.theatlantic.com/national-security/2025/12/1776-military/685304/",
    "timestamp": "2025-12-17T23:06:02Z"
  },
  {
    "title": "WATCH: ‘We want it back’: Trump demands Venezuela return ‘land, oil rights’ to U.S.",
    "description": "Under Venezuelan President Nicolás Maduro’s predecessor, Hugo Chavez, the Venezuelan government seized assets from some American oil companies after the country nationalized oil fields in 2007. Trump on Wednesday stated that his intention is “getting land, oi…",
    "link": "https://www.pbs.org/newshour/politics/watch-we-want-it-back-trump-demands-venezuela-return-land-oil-rights-to-u-s",
    "timestamp": "2025-12-17T23:05:41Z"
  },
  {
    "title": "Ex-podcaster Dan Bongino stepping down as deputy FBI director",
    "description": "The 51-year-old Bongino, in a post on X announcing his resignation, did not give a reason for the move.\n\nBut President Donald Trump said he believes Bongino wants to return to his popular podcast.\n\n\"Dan did a great job,\" Trump told reporters. \"I think he want…",
    "link": "https://www.france24.com/en/live-news/20251217-ex-podcaster-dan-bongino-stepping-down-as-deputy-fbi-director",
    "timestamp": "2025-12-17T23:05:14Z"
  },
  {
    "title": "The Bravofication of American government",
    "description": "Recently, White House chief of staff Susie Wiles did something uncharacteristic: she became the news of the day. Over the course of President Donald Trump’s 2025, she had been talking to a journalist about his presidency and his core team, dishing about their…",
    "link": "https://www.vox.com/politics/472762/reality-tv-bravofication-trump-susie-wiles-government-celebrity-influencer",
    "timestamp": "2025-12-17T23:05:03Z"
  },
  {
    "title": "Dan Bongino stepping down as FBI deputy director",
    "description": "The ex-podcast host \"wants to go back to his show\", President Trump said on Wednesday.",
    "link": "https://www.bbc.com/news/articles/cvgj0p5yl92o",
    "timestamp": "2025-12-17T23:04:34Z"
  },
  {
    "title": "Yes, the First Amendment Applies to Non-Citizens Present in the United States",
    "description": "A conservative appeals court judge says free speech may not cover non-citizens. Supreme Court precedent and history say otherwise.",
    "link": "https://reason.com/2025/12/18/yes-the-first-amendment-applies-to-non-citizens-present-in-the-united-states/",
    "timestamp": "2025-12-17T23:02:09Z"
  },
  {
    "title": "President Trump Claims He’s Been Declared Healthier Than Barack Obama By Former White House Doctor",
    "description": "President Donald Trump made a bold claim about his health on Tuesday, December 16, during a White House event. Speaking at the Hanukkah reception at the...",
    "link": "https://nationalenquirer.com/president-trump-claims-hes-been-declared-healthier-than-barack-obama-by-former-white-house-doctor/",
    "timestamp": "2025-12-17T23:02:05Z"
  },
  {
    "title": "China sues after Missouri seeks to collect on $25 billion court judgement, prosecutor says",
    "description": "Missouri's top prosecutor said China is suing after the state pressed federal officials for help collecting on a roughly $25 billion court judgment related...",
    "link": "https://www.yahoo.com/news/articles/china-sues-missouri-seeks-collect-230029285.html",
    "timestamp": "2025-12-17T23:00:29Z"
  },
  {
    "title": "Description of FCC as 'Independent' Scrubbed From Agency Website After Chair Says It Isn't",
    "description": "Federal Communications Commission Chair Brendan Carr stunned many observers Wednesday by suggesting that the FCC is subordinate to President Donald Trump—an assertion followed almost immediately by the removal of the word \"independent\" from the agency's websi…",
    "link": "https://www.commondreams.org/news/carr-says-fcc-not-independent",
    "timestamp": "2025-12-17T23:00:25Z"
  },
  {
    "title": "Trump set to address the nation in primetime White House speech as Americans report economic squeeze",
    "description": "President Donald Trump will deliver a White House speech Wednesday night that is expect to reflect on achievements and potentially teasing new policy initiatives.",
    "link": "https://www.foxnews.com/politics/trump-set-address-nation-primetime-white-house-speech-americans-report-economic-squeeze",
    "timestamp": "2025-12-17T23:00:20Z"
  },
  {
    "title": "South Park Season 28’s Ending Took A Huge Risk And It Paid Off",
    "description": "South Park season 28's daring finale twist involved a surprising storytelling gamble that ultimately paid off for the long-running comedy series.",
    "link": "https://screenrant.com/south-park-season-28-missing-characters-risk-pay-off/",
    "timestamp": "2025-12-17T23:00:18Z"
  },
  {
    "title": "Vanity Fair editor recounts awkward clashes inside Trump White House photo shoot",
    "description": "A Vanity Fair editor offered a revealing behind-the-scenes account of a tense White House photo shoot tied to the magazine’s bombshell reporting on Donald Trump’s chief of staff, describing sharp elbows, dark humor, and flashes of entitlement from top officia…",
    "link": "https://www.rawstory.com/white-house-2674432824/",
    "timestamp": "2025-12-17T23:00:02Z"
  },
  {
    "title": "Fox News Poll: As prices pinch, voters see Trump focused elsewhere",
    "description": "A New Fox News poll shows Trump's job approval at 44%, while 72% rate the economy negatively and 90% express serious concern about inflation.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-prices-pinch-voters-see-trump-focused-elsewhere",
    "timestamp": "2025-12-17T23:00:01Z"
  },
  {
    "title": "Come Get This Fool: Donald Trump Installs Plaques Mocking Obama-Biden Under Official White House Portrait",
    "description": "Donald Trump is in full distraction mode as the days, hours, and minutes count down toward Friday’s release of the long awaited Epstein files. Today’s exhibition of intellectual inference comes in of the orange führer’s favorite form of diversion, petty sland…",
    "link": "https://bossip.com/4197375/donald-trump-installs-plaques-mocking-obama-and-biden/",
    "timestamp": "2025-12-17T22:59:31Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino quitting, will leave bureau in January",
    "description": "Previously said: 'We cannot run a Republic like this. I'll never be the same after learning what I've learned'",
    "link": "https://www.wnd.com/2025/12/fbi-deputy-director-dan-bongino-quitting-will-leave/",
    "timestamp": "2025-12-17T22:59:24Z"
  },
  {
    "title": "Susie Wiles tells magazine Trump 'is in' Epstein files but not 'doing anything awful'",
    "description": "White House chief of staff Susie Wiles, in an interview published in Vanity Fair, said that President Trump \"is in\" the Epstein files but not \"doing anything awful.\"",
    "link": "https://abcnews.go.com/US/susie-wiles-tells-vanity-fair-trump-epstein-files/story?id=128489914",
    "timestamp": "2025-12-17T22:58:11Z"
  },
  {
    "title": "Centrist Republicans Join Democrats to Sign Discharge Petition Forcing Obamacare Subsidy Extension Vote",
    "description": "A discharge petition to force a vote on an extension of enhanced Obamacare subsidies that are set to expire passed the House on Wednesday.\nThe post Centrist Republicans Join Democrats to Sign Discharge Petition Forcing Obamacare Subsidy Extension Vote appeare…",
    "link": "https://www.breitbart.com/politics/2025/12/17/centrist-republicans-join-democrats-sign-discharge-petition-forcing-obamacare-subsidy-extension-vote/",
    "timestamp": "2025-12-17T22:55:40Z"
  },
  {
    "title": "California threatens Tesla with sale suspension over marketing practices",
    "description": "Tesla brushed off the decision, saying ‘not one single customer came forward to say there’s a problem’.",
    "link": "https://www.aljazeera.com/economy/2025/12/17/california-threatens-tesla-with-sale-suspension-over-marketing-practices",
    "timestamp": "2025-12-17T22:52:40Z"
  },
  {
    "title": "Some sanctioned oil vessels divert from Venezuela as Trump threatens blockade",
    "description": "MIAMI (AP) — Some oil vessels are diverting away from Venezuela after U.S. President Donald Trump threatened a “blockade” of sanctioned oil tankers entering or leaving the South American country, a dramatic escalation in the White House’s pressure campaign on…",
    "link": "https://financialpost.com/pmn/some-sanctioned-oil-vessels-divert-from-venezuela-as-trump-threatens-blockade",
    "timestamp": "2025-12-17T22:52:04Z"
  },
  {
    "title": "Trump to address the nation live on Wednesday night",
    "description": "President Donald Trump will deliver a live address to the nation from the White House at 9 p.m. Eastern Time.\nThe speech comes as several polls show his approval ratings sagging across the board, including on the economy and other issues. Trump is expected to…",
    "link": "https://biztoc.com/x/630a7b36efeeb1f5",
    "timestamp": "2025-12-17T22:51:44Z"
  },
  {
    "title": "WATCH: Dozens of Anti-ICE Protestors Arrested After Chaining Themselves to San Francisco ICE Facility: ‘Love Over Cruelty!’",
    "description": "Dozens of protestors blocked access to the main Immigration and Customs Enforcement office in San Francisco by chaining themselves to the entrance on Tuesday.\nThe post WATCH: Dozens of Anti-ICE Protestors Arrested After Chaining Themselves to San Francisco IC…",
    "link": "https://www.mediaite.com/media/watch-dozens-of-anti-ice-protestors-arrested-after-chaining-themselves-to-san-francisco-ice-facility-love-over-cruelty/",
    "timestamp": "2025-12-17T22:51:39Z"
  },
  {
    "title": "Trump writes partisan plaques for predecessors in his newly installed Presidential Walk of Fame",
    "description": "The additions include references to “Sleepy Joe” Biden.",
    "link": "https://www.bostonherald.com/2025/12/17/trump-plaques/",
    "timestamp": "2025-12-17T22:50:21Z"
  },
  {
    "title": "Trump writes partisan plaques for predecessors in his newly installed Presidential Walk of Fame",
    "description": "The additions include references to “Sleepy Joe” Biden.",
    "link": "https://www.denverpost.com/2025/12/17/trump-plaques/",
    "timestamp": "2025-12-17T22:50:21Z"
  },
  {
    "title": "Trump writes partisan plaques for predecessors in his newly installed Presidential Walk of Fame (Associated Press)",
    "description": "Associated Press:\nTrump writes partisan plaques for predecessors in his newly installed Presidential Walk of Fame  —  Months after President Donald Trump refashioned a West Wing walkway into what he calls the Presidential Walk of Fame, he has added partisan a…",
    "link": "https://www.memeorandum.com/251217/p124",
    "timestamp": "2025-12-17T22:50:00Z"
  },
  {
    "title": "Bitcoin Silent Exodus Hits -- Long-Time Buyers Cash Out...",
    "description": "Bitcoin Silent Exodus Hits -- Long-Time Buyers Cash Out...\r\n\n \n \n \n (First column, 18th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Crypto insider Caroline Ellison quietly moved out of prison...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://finance.yahoo.com/news/bitcoin-silent-exodus-hits-crypto-204351695.html",
    "timestamp": "2025-12-17T22:49:39Z"
  },
  {
    "title": "Dan Bongino announces he's quitting moments after Trump lauds him for doing a 'great job'",
    "description": "Deputy FBI Director and former MAGA podcaster Dan Bongino announced on Wednesday that he plans to leave the administration in January, which came moments after President Donald Trump praised him for his work.\"I will be leaving my position with the FBI in Janu…",
    "link": "https://www.rawstory.com/dan-bongino-2674446163/",
    "timestamp": "2025-12-17T22:47:00Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Gaza, the Office for the Coordination of Humanitarian Affairs and humanitarian partners continue to focus efforts on providing assistance to prepare for the winter to the most vulnerable families across the Strip.",
    "link": "https://press.un.org/en/2025/db251217.doc.htm",
    "timestamp": "2025-12-17T22:46:45Z"
  },
  {
    "title": "Trump administration seeks to ramp up denaturalization of some US citizens, New York Times reports",
    "description": "WASHINGTON, Dec 17 (Reuters) - The Trump administration intends to increase its efforts to strip some naturalized Americans of their U.S. citizenship, the...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-seeks-ramp-denaturalization-224546528.html",
    "timestamp": "2025-12-17T22:45:46Z"
  },
  {
    "title": "'Do you think they’ll notice?' MAGA told Trump used Truth Social to break core promise",
    "description": "A columnist revealed on Wednesday that President Donald Trump has used one of his social media accounts to break a core promise to his base. David Rothkopf, a columnist for The Daily Beast, argued in a new column that Trump is backtracking on his promise to M…",
    "link": "https://www.rawstory.com/trump-2674441326/",
    "timestamp": "2025-12-17T22:42:36Z"
  },
  {
    "title": "Scheffler Vs. McIlroy: Optum Golf Channel Games Debut In Prime Time",
    "description": "Scottie Scheffler and Rory McIlroy captain star studded teams at the first inaugural Golf Channel Games which will throw the two teams of four into \"Big Break\" like competition.",
    "link": "https://www.forbes.com/sites/break80/2025/12/17/scheffler-vs-mcilroy-optum-golf-channel-games-debut-in-prime-time/",
    "timestamp": "2025-12-17T22:40:59Z"
  },
  {
    "title": "Trump to address the nation live on Wednesday night",
    "description": "President Trump will address the nation Wednesday as his approval ratings are dipping according to several polls.",
    "link": "https://www.cnbc.com/2025/12/17/watch-trump-white-house-address.html",
    "timestamp": "2025-12-17T22:40:18Z"
  },
  {
    "title": "Olivia Nuzzi Is Completely Oblivious",
    "description": "“American Canto” is a story about the battle for the souls of a country and a journalist. But it’s certainly not about how things really work.\nThe post Olivia Nuzzi Is Completely Oblivious appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/12/17/olivia-nuzzi-american-canto-book-review/",
    "timestamp": "2025-12-17T22:40:02Z"
  },
  {
    "title": "Fox News Politics Newsletter: Senate sends $901B defense bill to Trump",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-senate-sends-901b-defense-bill-trump",
    "timestamp": "2025-12-17T22:39:49Z"
  },
  {
    "title": "Dan Bongino says he plans to resign as FBI deputy director in January, ending brief tenure",
    "description": "FBI Deputy Director Dan Bongino said Wednesday that he will resign from the bureau next month, ending a brief and tumultuous tenure in which he clashed with the Justice Department over the handling of the Jeffrey Epstein files.",
    "link": "https://www.pbs.org/newshour/politics/dan-bongino-says-he-plans-to-resign-as-fbi-deputy-director-in-january-ending-brief-tenure",
    "timestamp": "2025-12-17T22:38:13Z"
  },
  {
    "title": "'Did you say that?' GOP senator blindsides Trump nominee with blistering line of questions",
    "description": "Talking Points Memo writer Kate Riga reports a loyal ally of President Donald Trump appears to be turning on one of the president’s judicial nominees.“Sen. John Kennedy (R-La.), usually a fairly reliable Republican foot soldier, grilled a Trump judicial nomin…",
    "link": "https://www.rawstory.com/alternet-posts/sen-john-kennedy-donald-trump/",
    "timestamp": "2025-12-17T22:38:01Z"
  },
  {
    "title": "James Woods Slams “Infuriating and Distasteful” Comments Amid Rob Reiner’s Death",
    "description": "\"Do I agree on many of his ideas on how that patriotism should be enacted, to celebrate the America that we both love? No. But he doesn’t agree with me either, but he also respects my patriotism,\" the actor said of the late director.James Woods is calling out…",
    "link": "https://freerepublic.com/focus/f-chat/4357876/posts",
    "timestamp": "2025-12-17T22:37:36Z"
  },
  {
    "title": "James Woods Slams “Infuriating and Distasteful” Comments Amid Rob Reiner’s Death",
    "description": "\"Do I agree on many of his ideas on how that patriotism should be enacted, to celebrate the America that we both love? No. But he doesn’t agree with me either, but he also respects my patriotism,\" the actor said of the late director.James Woods is calling out…",
    "link": "https://freerepublic.com/focus/f-news/4357876/posts",
    "timestamp": "2025-12-17T22:37:36Z"
  },
  {
    "title": "VA to launch largest reorganization of health care system in 30 years",
    "description": "The Department of Veterans Affairs will slash the number of networks that support VA medical centers and realign policy offices to promote consistency.",
    "link": "https://www.militarytimes.com/veterans/2025/12/17/va-to-launch-largest-reorganization-of-health-care-system-in-30-years/",
    "timestamp": "2025-12-17T22:36:33Z"
  },
  {
    "title": "Dan Bongino to resign from FBI deputy director role in January",
    "description": "FBI Deputy Director Dan Bongino is stepping down from his position in January, according to a post shared to X on Wednesday afternoon.",
    "link": "https://www.foxnews.com/politics/dan-bongino-resign-from-fbi-deputy-director-role-january",
    "timestamp": "2025-12-17T22:36:09Z"
  },
  {
    "title": "Trump to highlight victories in prime time speech | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> President Donald Trump will deliver a rare evening address from the White House today about his first year back in office, focusing on what he sees as big victories even as Americans worry about the economy and Republicans face tough midterm ele…",
    "link": "https://www.staradvertiser.com/2025/12/17/breaking-news/in-prime-time-speech-trump-to-highlight-victories-amid-low-economic-approval/",
    "timestamp": "2025-12-17T22:35:44Z"
  },
  {
    "title": "Brendan Carr doesn’t regret his threats to broadcasters",
    "description": "A defiant Brendan Carr testified before the Senate Commerce Committee on Wednesday in his first public appearance before lawmakers since threatening broadcasters who aired comedian Jimmy Kimmel's show. Over the course of nearly three hours, the Federal Commun…",
    "link": "https://www.theverge.com/policy/846845/fcc-senate-commerce-oversight-hearing-brendan-carr",
    "timestamp": "2025-12-17T22:35:23Z"
  },
  {
    "title": "Try to Make Any Sense of What Trump Is Saying About Venezuelan Oil",
    "description": "President Donald Trump gave a nonsensical justification Wednesday for his blockade of all “sanctioned oil tankers” coming and going from Venezuela. Speaking to reporters, Trump appeared to claim that he was simply stealing back oil that already belonged to th…",
    "link": "https://newrepublic.com/post/204578/donald-trump-venezuelan-oil-rights",
    "timestamp": "2025-12-17T22:34:30Z"
  },
  {
    "title": "Trump’s push to make oil drilling cheap again squeezes some states more than others",
    "description": "The stakes are highest for New Mexico.",
    "link": "https://www.bostonherald.com/2025/12/17/federal-oil-payments-states/",
    "timestamp": "2025-12-17T22:33:49Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino says he plans to resign next month as bureau’s No. 2 official",
    "description": "The departure would be among the highest-profile resignations of the Trump administration.",
    "link": "https://www.bostonherald.com/2025/12/17/fbi-dan-bongino/",
    "timestamp": "2025-12-17T22:30:38Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino says he plans to resign next month as bureau’s No. 2 official",
    "description": "The departure would be among the highest-profile resignations of the Trump administration.",
    "link": "https://www.denverpost.com/2025/12/17/fbi-dan-bongino/",
    "timestamp": "2025-12-17T22:30:38Z"
  },
  {
    "title": "Hunt for US college mass shooter drags into fifth day",
    "description": "A manhunt for the mass shooter who opened fire in an exam room at one of America’s top universities stretched into a fifth day Wednesday with no apparent police progress in identifying a suspect or a motive. The only new information from police at a media bri…",
    "link": "https://www.digitaljournal.com/world/hunt-for-us-college-mass-shooter-drags-into-fifth-day/article",
    "timestamp": "2025-12-17T22:30:18Z"
  },
  {
    "title": "Trump Escalates Venezuela Pressure With Oil Tanker Blockade",
    "description": "Critics fear this is a step toward the United States declaring war on Caracas.",
    "link": "http://foreignpolicy.com/2025/12/17/trump-us-blockade-venezuela-sanctioned-oil-tankers-maduro-regime-change/",
    "timestamp": "2025-12-17T22:29:39Z"
  },
  {
    "title": "Dan Bongino stepping down as FBI deputy director",
    "description": "The ex-podcaster announced he would leave the FBI after US President Donald Trump told reporters he \"wants to go back to his show\".",
    "link": "https://www.bbc.co.uk/news/articles/cvgj0p5yl92o",
    "timestamp": "2025-12-17T22:27:49Z"
  },
  {
    "title": "Trump may declare war on Venezuela – Tucker Carlson",
    "description": "US journalist Tucker Carlson has suggested that President Donald Trump could be preparing to announce military action on Venezuelan soil Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629574-trump-venezuela-war-carlson/",
    "timestamp": "2025-12-17T22:25:36Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino plans to step down early next year: MS NOW (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nFBI Deputy Director Dan Bongino plans to step down early next year: MS NOW … FBI Deputy Director Dan Bongino plans to step down from his role early next year, MS NOW reported Wednesday, citing eight people briefed on his account.  —  …",
    "link": "https://www.memeorandum.com/251217/p118",
    "timestamp": "2025-12-17T22:25:02Z"
  },
  {
    "title": "How the Trump Administration Is Quietly Resegregating the American Workforce (Madiba K. Dennie/Balls and Strikes)",
    "description": "Madiba K. Dennie / Balls and Strikes:\nHow the Trump Administration Is Quietly Resegregating the American Workforce  —  The administration is unveiling new policies that together make it harder for people of color to challenge illegal discrimination at work.  …",
    "link": "https://www.memeorandum.com/251217/p122",
    "timestamp": "2025-12-17T22:25:02Z"
  },
  {
    "title": "Brian Grazer Voted for Trump, Admitting It Felt Like “Getting Canceled”",
    "description": "The longtime Democratic donor says he jumped ship to Trump in new documentary.A documentary going behind the scenes of Donald Trump‘s 2024 campaign contains an unexpected moment between the president and Brian Grazer. The Oscar-winning producer and longtime D…",
    "link": "https://freerepublic.com/focus/f-news/4357875/posts",
    "timestamp": "2025-12-17T22:21:39Z"
  },
  {
    "title": "Brian Grazer Voted for Trump, Admitting It Felt Like “Getting Canceled”",
    "description": "The longtime Democratic donor says he jumped ship to Trump in new documentary.A documentary going behind the scenes of Donald Trump‘s 2024 campaign contains an unexpected moment between the president and Brian Grazer. The Oscar-winning producer and longtime D…",
    "link": "https://freerepublic.com/focus/f-chat/4357875/posts",
    "timestamp": "2025-12-17T22:21:39Z"
  },
  {
    "title": "Trump aide Stephen Miller suggests Venezuelan oil belongs to US",
    "description": "White House deputy chief of staff says US 'created the oil industry in Venezuela' as tensions intensify with Caracas.",
    "link": "https://www.aljazeera.com/news/2025/12/17/trump-aide-stephen-miller-suggests-venezuelan-oil-belongs-to-us",
    "timestamp": "2025-12-17T22:19:44Z"
  },
  {
    "title": "Ron DeSantis Responds to CAIR Lawsuit After He Designated It a Foreign Terror Org",
    "description": "The office of Florida Gov. Ron DeSantis responded Wednesday to the Council on American-Islamic Relations’ lawsuit claiming that DeSantis violated federal law when he designated... Read More\nThe post Ron DeSantis Responds to CAIR Lawsuit After He Designated It…",
    "link": "https://www.dailysignal.com/2025/12/17/ron-desantis-responds-cair-lawsuit-after-designated-foreign-terror-org/",
    "timestamp": "2025-12-17T22:19:43Z"
  },
  {
    "title": "‘Unprecedented disasters’: Trump demolishes Obama and Biden with crushing new plaques under presidential portraits",
    "description": "'Sleepy Joe' called 'by far, the worst President in American history'",
    "link": "https://www.wnd.com/2025/12/unprecedented-disasters-trump-demolishes-obama-biden-crushing-new/",
    "timestamp": "2025-12-17T22:19:29Z"
  },
  {
    "title": "Has Trump’s chief of staff revealed White House secrets?",
    "description": "Susie Wiles hits back at Vanity Fair after giving rare interviews",
    "link": "https://www.bbc.co.uk/sounds/play/w3ct8byw",
    "timestamp": "2025-12-17T22:19:00Z"
  },
  {
    "title": "Cheap Trick Defend Performing at Kennedy Center Honors in Tribute to KISS",
    "description": "The band insists there were no political motives in playing the Trump-hosted event.\nCheap Trick Defend Performing at Kennedy Center Honors in Tribute to KISS\nSpencer Kaufman",
    "link": "https://consequence.net/2025/12/cheap-trick-defend-kennedy-center-honors-performance/",
    "timestamp": "2025-12-17T22:18:49Z"
  },
  {
    "title": "Trump's Energy Department coal plant order in Washington sparks state officials' outrage",
    "description": "Trump's Energy Department coal plant order in Washington sparks state officials' outrage\nCENTRALIA, Wash. — In a controversial move, the U.S. Department of Energy under President Donald Trump has issued an emergency order directing TransAlta to continue opera…",
    "link": "https://biztoc.com/x/a0c8f569e78c4605",
    "timestamp": "2025-12-17T22:18:37Z"
  },
  {
    "title": "Donald Trump Reacts to Report Dan Bongino Leaving FBI",
    "description": "Asked about the reports, Trump praised Bongino’s tenure and indicated the move would be voluntary.",
    "link": "https://biztoc.com/x/95833869baae2a88",
    "timestamp": "2025-12-17T22:18:02Z"
  },
  {
    "title": "Trump White House Installs Plaques On ‘Walk Of Fame’ To Insult Former Presidents",
    "description": "Donald Trump’s installation of a Walk of Fame just outside the Oval Office was a curious enough addition to his gilding of the White House. Now his administration has added a new element: Plaques that insult some of his predecessors. Below a portrait of Barac…",
    "link": "http://deadline.com/2025/12/trump-white-house-plaques-biden-obama-1236651837/",
    "timestamp": "2025-12-17T22:16:59Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration policies limiting lawmakers’ access to ICE facilities",
    "description": "Twelve Democratic members of Congress sued to challenge ICE’s amended visitor policies.",
    "link": "https://www.bostonherald.com/2025/12/17/immigration-ice-congress-visits/",
    "timestamp": "2025-12-17T22:16:29Z"
  },
  {
    "title": "Trump installs partisan plaques for past presidents at White House",
    "description": "President Trump added plaques with disparaging comments about Biden and Obama on a \"Presidential Walk of Fame\" at the White House.",
    "link": "https://www.cbsnews.com/news/trumps-white-house-plaques-presidents/",
    "timestamp": "2025-12-17T22:13:24Z"
  },
  {
    "title": "Jared Isaacman is NASA's new leader",
    "description": "NASA has a leader again. On Wednesday, the US Senate confirmed Jared Isaacman as the agency's administrator, with a 67-30 vote. The billionaire entrepreneur (and Elon Musk ally) will have his hands full navigating political waters while managing a severely do…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180413117",
    "timestamp": "2025-12-17T22:13:24Z"
  },
  {
    "title": "Eurovision Song Contest to Allow Booing, Palestinian Flags After Refusing to Boot Israel",
    "description": "The national broadcaster responsible for hosting the 2026 Eurovision Song Contest announced on Wednesday that audience members will be allowed to bring \"all official flags,\" presumably including the Palestinian flag, and that booing will not be censored out o…",
    "link": "https://www.breitbart.com/europe/2025/12/17/eurovision-song-contest-to-allow-booing-palestinian-flags-after-refusing-to-boot-israel/",
    "timestamp": "2025-12-17T22:12:23Z"
  },
  {
    "title": "S.Africa expels Kenyans working on US Afrikaner ‘refugee’ applications",
    "description": "South Africa arrested and expelled seven Kenyans who had been working illegally on a US government programme to accept white Afrikaners as “refugees”, the government said Wednesday. President Donald Trump’s administration in May offered refugee status to the …",
    "link": "https://www.digitaljournal.com/world/s-africa-expels-kenyans-working-on-us-afrikaner-refugee-applications/article",
    "timestamp": "2025-12-17T22:12:20Z"
  }
]