[
  {
    "title": "Swing state Republican 'prefers people do not call his office'",
    "description": "One Republican member of the House of Representatives has lately been inundated with calls from his constituents, and is now suggesting people contact him through his website instead.According to progressive talk radio network WCPT 820, Rep. Bill Huizenga (R-…",
    "link": "https://www.rawstory.com/bill-huizenga/",
    "timestamp": "2025-03-06T23:21:41Z"
  },
  {
    "title": "Trump's on-again, off-again tariffs are partly off again: From the Politics Desk",
    "description": "Another roller-coaster day for President Donald Trump’s tariff plans. Plus, why speed has proven to be Trump’s ally in his efforts to slash the government.",
    "link": "https://www.nbcnews.com/politics/trump-on-again-off-again-tariffs-politics-desk-rcna195238",
    "timestamp": "2025-03-06T23:20:55Z"
  },
  {
    "title": "EU edges closer to €150 billion defence package despite Hungary’s Ukraine holdout",
    "description": "The full EU27 agreed conclusions on defence – but Hungary's Viktor Orbán refused to back common language on support for Ukraine.",
    "link": "https://www.euractiv.com/section/politics/news/eu-edges-closer-to-e150-billion-defence-package-despite-hungarys-ukraine-holdout/",
    "timestamp": "2025-03-06T23:18:51Z"
  },
  {
    "title": "European Leaders Convene Emergency Summit on Ukraine, Russia",
    "description": "The continent is seeking new ways to defend itself without relying on U.S. support.",
    "link": "http://foreignpolicy.com/2025/03/06/ukraine-russia-eu-emergency-summit-zelensky-defense-spending-nuclear-trump/",
    "timestamp": "2025-03-06T23:18:05Z"
  },
  {
    "title": "Donald Trump Puts DOGE On A Leash",
    "description": "The president said he wanted members of his Cabinet to take charge of cutting spending and firing people.",
    "link": "https://www.huffpost.com/entry/donald-trump-puts-doge-on-a-leash_n_67ca21c7e4b0fe2a0433e272",
    "timestamp": "2025-03-06T23:18:04Z"
  },
  {
    "title": "Trump on Tariffs: 'I'm Not Even Looking at the Stock Market'",
    "description": "President Donald Trump exempted Mexican and Canadian goods covered by the North American trade agreement known as USMCA from his 25% tariffs, offering major reprieves to the US’s two largest trading partners.\nTrump signed orders Thursday paring back the tarif…",
    "link": "https://biztoc.com/x/cd2217a1bb8b7987",
    "timestamp": "2025-03-06T23:16:51Z"
  },
  {
    "title": "More AIDS activists arrested when protesting global funding cuts",
    "description": "AIDS activists were arrested again Wednesday while protesting the Trump administration’s cuts to funding to fight the disease globally. This follows arrests that were made during protests February 13 and 26.",
    "link": "https://www.advocate.com/news/hiv-protesters-arrested-again",
    "timestamp": "2025-03-06T23:16:49Z"
  },
  {
    "title": "Colorado and 7 other states sue Trump administration over cuts to rural teacher-training funds",
    "description": "In Colorado, nearly $2.8 million in funding that addresses the state’s ongoing teacher shortage in rural communities is at risk, Attorney General Phil Weiser said.",
    "link": "https://www.denverpost.com/2025/03/06/teacher-training-grants-cut-lawsuit-department-educaiton/",
    "timestamp": "2025-03-06T23:16:42Z"
  },
  {
    "title": "The job market may be tougher than it looks on paper",
    "description": "The first jobs report of the second Donald Trump administration comes out Friday. So far, we know that weekly jobless claims dropped last week, according to data from the Labor Department, and the number of people continuing to file for unemployment benefits …",
    "link": "https://biztoc.com/x/2e3a967d8a9e9dca",
    "timestamp": "2025-03-06T23:16:39Z"
  },
  {
    "title": "Sam Bankman-Fried Bashes Biden, Gensler on Tucker Carlson’s Podcast",
    "description": "Samuel Bankman-Fried appeared on former Fox News host Tucker Carlson’s podcast, bashing former President Joe Biden and Securities and Exchange Commission Chair Gary Gensler as his parents seek a pardon from Donald Trump.",
    "link": "https://www.livemint.com/companies/news/sam-bankman-fried-bashes-biden-gensler-on-tucker-carlson-s-podcast-11741302814325.html",
    "timestamp": "2025-03-06T23:13:33Z"
  },
  {
    "title": "Trump Rips Dems for 'Very Embarrassing' Behavior During His Address to Congress; Blasts Wallace, Maddow over DJ Daniel Comments",
    "description": "WASHINGTON–President Donald Trump on Thursday ripped into Democrats and liberal media pundits for their behavior during and after his joint address to Congress.\nThe post Trump Rips Dems for ‘Very Embarrassing’ Behavior During His Address to Congress; Blasts W…",
    "link": "https://www.breitbart.com/politics/2025/03/06/trump-rips-dems-for-very-embarrassing-behavior-during-his-address-to-congress-blasts-wallace-maddow-over-dj-daniel-comments/",
    "timestamp": "2025-03-06T23:12:30Z"
  },
  {
    "title": "Hamas treatment of hostages 'intolerable,' Trump envoy says",
    "description": "Hamas’ treatment of the hostages it has been holding in captivity in the Gaza Strip is \"intolerable,\" U.S. envoy to the Middle East Steve Witkoff said.",
    "link": "https://www.foxnews.com/politics/hamas-treatment-hostages-intolerable-trump-envoy-says",
    "timestamp": "2025-03-06T23:11:21Z"
  },
  {
    "title": "Did Trump just rein Elon in? (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nDid Trump just rein Elon in?  —  President Donald Trump made the surprising announcement Thursday that his Cabinet secretaries do in fact run the government agencies they head — and that Elon Musk doesn't.  —  And though the president add…",
    "link": "https://www.memeorandum.com/250306/p148",
    "timestamp": "2025-03-06T23:10:00Z"
  },
  {
    "title": "National Treasure: Rep. Jasmine Crockett Says Donald Trump Should ‘Grow A Spine’ And ‘Stop Being Putin’s Hoe’",
    "description": "Jasmine Crockett says Trump should stop being Putin's hoe\nThe post National Treasure: Rep. Jasmine Crockett Says Donald Trump Should ‘Grow A Spine’ And ‘Stop Being Putin’s Hoe’ appeared first on Bossip.",
    "link": "http://bossip.com/2798518/jasmine-crockett-says-trump-should-stop-being-putins-hoe/",
    "timestamp": "2025-03-06T23:08:54Z"
  },
  {
    "title": "Trump Says U.S. Won’t Defend NATO Allies Behind On Defense Spending: ‘It’s Common Sense’",
    "description": "The president said he was “not so sure” NATO allies would defend the U.S. in a time of crisis.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/06/trump-says-us-wont-defend-nato-allies-behind-on-defense-spending-its-common-sense/",
    "timestamp": "2025-03-06T23:08:36Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The S&P 500 is tracking for its worst week of 2025 as tariff policy has rocked financial markets.",
    "link": "https://www.cnbc.com/2025/03/06/stock-market-today-live-updates.html",
    "timestamp": "2025-03-06T23:08:24Z"
  },
  {
    "title": "Social Security Administration Workers Can No Longer Read the News at Work",
    "description": "The Trump administration's sweeping attacks on \njournalism and federal workers continued Thursday with an announcement that Social Security Administration employees can no longer access \"general news\" websites on government devices.\n\nThe Washington Post noted…",
    "link": "https://www.commondreams.org/news/social-security-employment",
    "timestamp": "2025-03-06T23:07:48Z"
  },
  {
    "title": "Winston Peters, NZ First follows Donald Trump’s anti-DEI path with new Bill",
    "description": "It's NZ First's latest move to end 'woke' aspects of society.",
    "link": "https://www.nzherald.co.nz/nz/politics/winston-peters-new-zealand-first-follows-donald-trumps-anti-dei-path-with-new-bill/UMEW5HLVR5DFBE5AE726EH7NEE/",
    "timestamp": "2025-03-06T23:07:38Z"
  },
  {
    "title": "Trump blames ‘globalists’ for stock market sell-off",
    "description": "President Donald Trump also reiterated that his tariffs could, at least briefly, cause \"disruption\" in the equity markets.",
    "link": "https://www.cnbc.com/2025/03/06/trump-blames-globalists-for-stock-market-sell-off.html",
    "timestamp": "2025-03-06T23:07:31Z"
  },
  {
    "title": "Latin America Shows Regional Unity at the OAS",
    "description": "Amid tariffs and aid cuts, the region displayed rare unity at the OAS this week.",
    "link": "http://foreignpolicy.com/2025/03/06/latin-america-trump-mexico-tariffs-panama-canal-oas/",
    "timestamp": "2025-03-06T23:07:03Z"
  },
  {
    "title": "Trump’s crypto reserve may still be a long time coming, no matter what he says Friday. Here’s why",
    "description": "Some hope that President Donald Trump will unveil major updates about his proposed crypto reserve at his first White House digital-assets summit scheduled for Friday. However, regardless of what Trump says, digital-assets enthusiasts may not get a true crypto…",
    "link": "https://biztoc.com/x/353071283a95cf60",
    "timestamp": "2025-03-06T23:06:06Z"
  },
  {
    "title": "Medicaid Insures Half of U.S. Children. ‘Pro-Life’ Republicans Are Trying to Cut the Entire Program.",
    "description": "Republicans’ proposed Medicaid cuts would strip healthcare from millions, including half of U.S. children, one in five Americans, and 40 percent of all pregnant women.\nWith so much at stake for America’s women and families, representatives in Congress should …",
    "link": "https://msmagazine.com/2025/03/06/medicaid-republicans-health-insurance-women-children/",
    "timestamp": "2025-03-06T23:06:05Z"
  },
  {
    "title": "Ontario premier sticks to electricity tariffs despite Trump trade reversal",
    "description": "The move in response to President Donald Trump's tariffs on Canadian goods could raise costs for 1.5 million customers in three border states.",
    "link": "https://biztoc.com/x/66b98ea419fa4709",
    "timestamp": "2025-03-06T23:05:44Z"
  },
  {
    "title": "'Shadowy, unelected figures': Analyst says DOGE is the very thing 'it claims to fear most'",
    "description": "Tech billionaire Elon Musk and his Department of Government Efficiency task force have the goal not just of rooting out waste in government, but of combating the supposed \"deep state\" that President Donald Trump has long blamed for ruining his vision for Amer…",
    "link": "https://www.rawstory.com/doge-2671283696/",
    "timestamp": "2025-03-06T23:05:11Z"
  },
  {
    "title": "Veterans cuts spark GOP backlash on Capitol Hill (Politico)",
    "description": "Politico:\nVeterans cuts spark GOP backlash on Capitol Hill  —  “We don't need to be reading memos in the paper about 20 percent cut at the VA,” Sen. Lindsey Graham said.  —  As President Donald Trump and Elon Musk lay waste to scores of federal programs and t…",
    "link": "https://www.memeorandum.com/250306/p144",
    "timestamp": "2025-03-06T23:05:00Z"
  },
  {
    "title": "Trump changes course and delays some tariffs on Mexico and Canada",
    "description": "Trump on Thursday postponed 25% tariffs on many imports from Mexico and some from Canada for a month amid widespread fears of the economic fallout from a broader trade war.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_244977db-c261-530f-88bc-46a1f55eca37.html",
    "timestamp": "2025-03-06T23:05:00Z"
  },
  {
    "title": "Ticker: Sycamore Partners buys Walgreens in $10B deal",
    "description": "Sycamore Partners, a New York-based private equity firm, on Thursday agreed to pay $11.45 a share for Walgreens Boots Alliance — the pharmacy chain’s parent company — for a $10 billion deal.…",
    "link": "https://www.bostonherald.com/2025/03/06/ticker-sycamore-partners-buys-walgreens-in-10b-deal/",
    "timestamp": "2025-03-06T23:04:25Z"
  },
  {
    "title": "For people with disabilities, telemedicine's decline may alter their health care experience",
    "description": "Telemedicine has been viewed as a potential equalizer to health care access, but as the policies from the COVID-19 pandemic wind down, people who need it most continue to have the least access to the service. Pandemic-era policies rapidly expanded access to t…",
    "link": "https://accessibe.com/blog/knowledgebase/telemedicines-decline-for-people-with-disabilities",
    "timestamp": "2025-03-06T23:02:39Z"
  },
  {
    "title": "Pro-life advocate beaten outside Baltimore abortion facility calls attack ‘a gift’",
    "description": "CV NEWS FEED // Nearly two years after being brutally attacked while peacefully demonstrating outside a Baltimore Planned Parenthood, pro-life advocate Mark Crosby remains steadfast in his mission. On May 23, 2023, Crosby, then 73, and his friend Dick Schaefe…",
    "link": "https://freerepublic.com/focus/f-religion/4302623/posts",
    "timestamp": "2025-03-06T23:02:31Z"
  },
  {
    "title": "Steve Bannon Warns Corporations 'Gamed the System' With Trump Tax Cuts",
    "description": "Steve Bannon says that corporations took advantage of Trump's 2017 Tax Cuts",
    "link": "https://www.newsweek.com/steve-bannon-warns-corporations-gamed-system-trump-tax-cuts-2040921",
    "timestamp": "2025-03-06T23:02:12Z"
  },
  {
    "title": "Trump may sign Bitcoin reserve executive order at crypto summit: Report",
    "description": "Donald Trump could sign an executive order creating a Bitcoin reserve at the White House Crypto Summit, but the action is still under discussion, Bloomberg reports.",
    "link": "https://cointelegraph.com/news/trump-could-sign-bitcoin-reserve-executive-order-crypto-summit-bloomberg",
    "timestamp": "2025-03-06T23:00:52Z"
  },
  {
    "title": "Drop in US border crossings goes deeper than Trump",
    "description": "President Donald Trump boasts he has brought illegal border crossings into the United States to record lows, but experts say the reasons for the drop go beyond his hardline anti-immigration stance.\"Within hours of taking the oath of office, I declared a natio…",
    "link": "https://www.rawstory.com/mexico-united-states-border/",
    "timestamp": "2025-03-06T23:00:47Z"
  },
  {
    "title": "Trump says MSNBC's Nicolle Wallace, Rachel Maddow should resign for comments on 13-year-old cancer survivor",
    "description": "President Trump took aim at MSNBC hosts Nicolle Wallace and Rachel Maddow over their \"disgraceful\" comments about 13-year-old brain cancer survivor DJ Daniel.",
    "link": "https://www.foxnews.com/media/trump-says-msnbcs-nicolle-wallace-rachel-maddow-should-resign-comments-13-year-old-cancer-survivor",
    "timestamp": "2025-03-06T23:00:27Z"
  },
  {
    "title": "Yale Law School Scrubs References to Administrator Who Is Member of US-Sanctioned Terror Financier",
    "description": "Yale Law School's Law and Political Economy Project, an initiative funded by the left-wing William and Flora Hewlett Foundation, quietly deleted online references to its deputy director, Helyeh Doutaghi, who is also a member of the U.S.-sanctioned terrorist f…",
    "link": "https://freebeacon.com/campus/yale-law-school-scrubs-references-to-administrator-who-is-member-of-us-sanctioned-terror-financier/",
    "timestamp": "2025-03-06T23:00:22Z"
  },
  {
    "title": "Pras Hoping For Pardons For Both Himself & Tory Lanez: 'We All Gotta Play Our Part'",
    "description": "Pras hopes for a Trump pardon for his role in a billion-dollar fraud scheme — and wants one for Tory Lanez too, just not from Trump.",
    "link": "https://hiphopdx.com/news/pras-hoping-pardons-himself-tory-lanez",
    "timestamp": "2025-03-06T23:00:01Z"
  },
  {
    "title": "Deeper Understanding of Measles Outbreak",
    "description": "Note: This article is for informational purposes only and is not a substitute for medical advice, diagnosis, or treatment provided by a qualified healthcare provider. Vaccines have become a kind of religion we are supposed to “believe in” without question. Ye…",
    "link": "https://www.activistpost.com/deeper-understanding-of-measles-outbreak/",
    "timestamp": "2025-03-06T23:00:00Z"
  },
  {
    "title": "U.S. Mulling Plan to Intercept Iranian Tankers at Sea as Exports Surge",
    "description": "President Donald Trump's administration is considering a plan to stop and inspect Iranian oil tankers at sea under an international accord aimed at countering the spread of weapons of mass destruction, sources familiar with the matter told Reuters.",
    "link": "https://gcaptain.com/us-mulling-plan-to-intercept-iranian-tankers-at-sea-as-exports-surge/",
    "timestamp": "2025-03-06T22:59:59Z"
  },
  {
    "title": "Canada's tariffs to remain despite Trump postponing tariffs on many imports",
    "description": "Canadian government officials say Canada’s initial retaliatory tariffs against the U.S. will remain in place for now despite President Donald Trump postponing 25% tariffs on many imports from Canada for a month",
    "link": "https://abcnews.go.com/International/wireStory/trudeau-expects-trade-war-canada-us-foreseeable-future-119512307",
    "timestamp": "2025-03-06T22:59:36Z"
  },
  {
    "title": "Can Latin America Find Consensus in the Age of Trump?",
    "description": "Amid tariffs and aid cuts, the region displayed rare unity at the OAS this week.",
    "link": "http://foreignpolicy.com/2025/03/06/mexico-tariffs-oas-election-aid-trump-latin-america/",
    "timestamp": "2025-03-06T22:59:20Z"
  },
  {
    "title": "Two numbers that explain why Trump can’t make up his mind about tariffs",
    "description": "President Donald Trump’s tariffs have had a chaotic week. First, they were on, then they were great, then they were maybe off, then definitely off (but just for now). After the Trump administration enacted its 25 percent tariffs on most Mexican and Canadian g…",
    "link": "https://www.vox.com/politics/403011/trump-canada-mexico-tariffs-reverse-usmca",
    "timestamp": "2025-03-06T22:58:55Z"
  },
  {
    "title": "Republican Argues Veterans Do Not Have 'A Right By God to Have a Job' In the Government as Trump Admin Prepares to Fire Thousands",
    "description": "Texas Rep. Brandon Gill suggested it's more important to get the U.S. out of debt than it is for veterans to have federal jobs during a CNN interview Thursday.",
    "link": "https://www.ibtimes.com/republican-argues-veterans-do-not-have-right-god-have-job-government-trump-admin-prepares-3765421",
    "timestamp": "2025-03-06T22:58:46Z"
  },
  {
    "title": "Hakeem Jeffries again claims banning trans athletes from girls sports will unleash sexual predators on girls",
    "description": "Hakeem Jeffries repeated an unsubstantiated claim that the Defending Women and Girls in Sports Act would have \"unleashed\" sexual predators on girls.",
    "link": "https://www.foxnews.com/sports/hakeem-jeffries-repeats-claim-banning-trans-athletes-from-girls-sport-unleash-sexual-predators-girls",
    "timestamp": "2025-03-06T22:57:28Z"
  },
  {
    "title": "Trump Suggests Astronauts Stranded In Space Might Learn To Love Each Other",
    "description": "The president also took a moment to praise the female astronaut's tresses: \"There's no kidding, there's no games with her hair.\"",
    "link": "https://www.huffpost.com/entry/trump-suggests-astronauts-stranded-in-space-might-learn-to-love-each-other_n_67ca1024e4b0404dff301c6b",
    "timestamp": "2025-03-06T22:57:11Z"
  },
  {
    "title": "Trump cracks down on Perkins Coie lawyers who worked on Steele dossier",
    "description": "Orders cutoff of federal contracts, security clearances, access",
    "link": "https://www.wnd.com/2025/03/trump-cracks-down-on-perkins-coie-lawyers-who-worked-on-steele-dossier/",
    "timestamp": "2025-03-06T22:57:10Z"
  },
  {
    "title": "It Wasn’t Enough for Payton McNabb to Be Permanently Injured by a Male in Women’s Sports. Her Sorority Also Kicked Her Out.",
    "description": "Payton McNabb, the former high school volleyball player whose sports career was ruined after a male spiked the ball in her face, also faced punishment... Read More\nThe post It Wasn’t Enough for Payton McNabb to Be Permanently Injured by a Male in Women’s Spor…",
    "link": "https://www.dailysignal.com/2025/03/06/wasnt-enough-payton-mcnabb-permanently-injured-male-womens-sports-her-sorority-also-kicked-her-out/",
    "timestamp": "2025-03-06T22:56:30Z"
  },
  {
    "title": "Restaurants Warned White House of Tariff Dangers Before Delay",
    "description": "A day before President Donald Trump delayed tariffs on some Mexican and Canadian goods, a group of restaurant chains that included McDonald’s Corp. and Chick-fil-A told White House officials that the duties would have an immediate negative impact on the indus…",
    "link": "https://www.livemint.com/companies/news/restaurants-warned-white-house-of-tariff-dangers-before-delay-11741301782768.html",
    "timestamp": "2025-03-06T22:56:22Z"
  },
  {
    "title": "Trump 2.0 unleashes tariff tactics: bold moves, hidden agendas, and the new world order",
    "description": "As US President Donald Trump marks the first month of his second term in office, the reforms and fiscal austerity measures of Trump 2.0 have exceeded expectations compared to his campaign promises. Whether it is the various cuts proposed by the \"Department of…",
    "link": "https://www.digitimes.com/news/a20250303PD214/trump-2.0-tariff-commentary.html",
    "timestamp": "2025-03-06T22:56:09Z"
  },
  {
    "title": "Transcom Asks Lawmakers for More Used Vessels",
    "description": "Air Force Gen. Randall Reed, U.S. Transportation Command commander, told the Senate Armed Services Committee that Transcom wants to buy up to 10 additional shipping vessels to bolster America's Ready Reserve Force fleet.",
    "link": "https://www.defense.gov/News/News-Stories/Article/Article/4111326/transcom-asks-lawmakers-for-more-used-vessels/",
    "timestamp": "2025-03-06T22:56:01Z"
  },
  {
    "title": "Republican Lawmaker Asserts That Americans Don't 'Want Perfection' in Defense of DOGE Cuts: 'We Don't Have Time to Get Everything Absolutely Perfect'",
    "description": "Michigan Rep. Lisa McClain claimed Americans want \"progress and transparency\" over \"perfection\" during a CNN interview on Thursday.",
    "link": "https://www.ibtimes.com/republican-lawmaker-asserts-that-americans-dont-want-perfection-defense-doge-cuts-we-dont-3765419",
    "timestamp": "2025-03-06T22:55:52Z"
  },
  {
    "title": "Trump Suggests He Won’t Change Daylight Saving Time, After All—As Clocks Spring Forward Sunday",
    "description": "President Donald Trump said when something is as “50-50” as daylight saving time, it’s “hard to get excited about” changing it.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/06/trump-suggests-he-wont-change-daylight-saving-time-after-all-as-clocks-spring-forward-sunday/",
    "timestamp": "2025-03-06T22:55:28Z"
  },
  {
    "title": "Video shows Canadian stores removing American booze from shelves",
    "description": "A March 2025 video authentically shows a liquor store in Ontario, Canada, removing American liquor bottles from its shelves in response to U.S.-imposed tariffs.",
    "link": "https://www.snopes.com//fact-check/canadian-stores-remove-american-booze-video/",
    "timestamp": "2025-03-06T22:55:00Z"
  },
  {
    "title": "Federal Judge Slaps Trump Down In Fiery Ruling Accusing Him Of 'Power Grab'",
    "description": "A federal judge on Thursday shot down President Donald Trump's effort to oust a member of the National Labor Relations Board.\nIn a fiery ruling, U.S. District Judge Beryl Howell wrote that Trump is trying to carry out a \"power grab,\" adding that his \"interpre…",
    "link": "https://biztoc.com/x/beca38ae6a79b4f3",
    "timestamp": "2025-03-06T22:54:48Z"
  },
  {
    "title": "Trump revives his 2020 playbook to go after Social Security",
    "description": "This is an adapted excerpt from the March 5 episode of “All In with Chris Hayes.”\nUnsurprisingly, Donald Trump told a lot of lies during his joint address to Congress on Tuesday. There were small lies, there were big lies and then there was the “big lie.”\nIt’…",
    "link": "https://biztoc.com/x/9eeee2bc252b23da",
    "timestamp": "2025-03-06T22:54:44Z"
  },
  {
    "title": "WATCH: Trump signs orders postponing some tariffs on imports from Mexico and Canada",
    "description": "President Donald Trump on Thursday postponed 25 percent tariffs on many imports from Mexico and some imports from Canada for a month amid widespread fears of the economic fallout from a broader trade war.",
    "link": "https://biztoc.com/x/153820154c444257",
    "timestamp": "2025-03-06T22:54:38Z"
  },
  {
    "title": "Trump says he's not even looking at stock market, tariffs will make U.S. 'very strong'",
    "description": "President Donald Trump said Thursday that his administration would not consider stock market reaction when hammering out the details of its tariff policy.\nWhen asked whether the decision to pause tariffs on many products from Canada and Mexico for one month w…",
    "link": "https://biztoc.com/x/20e5782f075d4396",
    "timestamp": "2025-03-06T22:54:18Z"
  },
  {
    "title": "Trump nominee pledges to prohibit use of aborted fetal tissue in National Institutes of Health-funded research",
    "description": "CV NEWS FEED // President Donald Trump’s nominee for Director of the National Institutes of Health (NIH) promised during a March 5 Senate committee hearing that he would prohibit the use of aborted fetal tissue in NIH-funded grants. Sen. Josh Hawley, R-Mo., a…",
    "link": "https://freerepublic.com/focus/f-news/4302622/posts",
    "timestamp": "2025-03-06T22:53:53Z"
  },
  {
    "title": "Federal Judge Slaps Trump Down In Fiery Ruling Accusing Him Of 'Power Grab'",
    "description": "U.S. District Judge Beryl Howell didn't mince words in a ruling reinstating a federal government worker Trump tried to fire.",
    "link": "https://www.newsweek.com/judge-beryl-howell-slaps-trump-down-nlrb-ruling-2040947",
    "timestamp": "2025-03-06T22:52:56Z"
  },
  {
    "title": "Nasdaq confirms correction, dollar weakens as tariff news fuels unease",
    "description": "NEW YORK :Stock indexes fell sharply and the dollar eased on Thursday, with the Nasdaq confirming it has been in a correction since peaking last December, as more announcements from U.S. President Donald Trump on tariffs fueled investor uncertainty.The global…",
    "link": "https://www.channelnewsasia.com/business/nasdaq-confirms-correction-dollar-weakens-tariff-news-fuels-unease-4980866",
    "timestamp": "2025-03-06T22:51:28Z"
  },
  {
    "title": "Nasdaq confirms correction amid US trade policy uncertainty",
    "description": "NEW YORK: Wall Street stocks finished lower on Thursday (Mar 6), with the Nasdaq confirming it has been in a correction since December, weighed down by market jitters over the current uncertainty surrounding US trade policy. President Donald Trump announced o…",
    "link": "https://www.channelnewsasia.com/world/nasdaq-confirms-correction-amid-us-trade-policy-uncertainty-4983636",
    "timestamp": "2025-03-06T22:51:06Z"
  },
  {
    "title": "Trump to agencies: Demand bonds from plaintiffs when government is sued",
    "description": "Activist groups must cover 'potential costs and damages from a wrongly issued injunction'",
    "link": "https://www.wnd.com/2025/03/trump-to-agencies-demand-bonds-from-plaintiffs-when-government-is-sued/",
    "timestamp": "2025-03-06T22:51:03Z"
  },
  {
    "title": "Trump’s crypto czar says lack of Bitcoin “long-term strategy” has cost taxpayers billions",
    "description": "Over the past 10 years, the federal government has sold around 195,000 Bitcoin for $366 million Today, that figure would be worth over $17 billion Sacks said the lack of a “long-term strategy” has cost American taxpayers White House artificial intelligence (A…",
    "link": "https://coinjournal.net/news/trumps-crypto-czar-says-lack-of-bitcoin-long-term-strategy-has-cost-taxpayers-billions/",
    "timestamp": "2025-03-06T22:50:33Z"
  },
  {
    "title": "Al Green Allegedly Paid Sex Abuse Victim from Congressional Slush Fund",
    "description": "Conversation RealRobert @Real_RobN And this is, the sex-predator Democrat Rep. Al Green currently serving in U.S. Congress, —raped a former aide Lucinda Daniels in May of 2007. The rapist then bribed Daniels with $875,000 using the secret slut fund U.…",
    "link": "https://freerepublic.com/focus/f-news/4302621/posts",
    "timestamp": "2025-03-06T22:50:10Z"
  },
  {
    "title": "Gov. Gavin Newsom faces backlash over comments he made about transgender student athletes",
    "description": "California\r\n Gov. Gavin Newsom is facing fierce backlash from LGBTQ\r\n+ advocates after using the debut episode of his new podcast, This is Gavin Newsom, to echo right-wing rhetoric about transgender\r\n athletes. In a conversation released on Wednesday, Newsom …",
    "link": "https://www.advocate.com/politics/gavin-newsom-abandons-transgender-athletes",
    "timestamp": "2025-03-06T22:50:06Z"
  },
  {
    "title": "Congressional Budget Office Reveals GOP Are Lying Liars",
    "description": "At a press conference last week, U.S. House Majority Leader Steve Scalise claimed Democrats are lying when they warn that Medicaid is in the Republican Party's crosshairs.\n\"The word Medicaid is not even in this bill,\" Scalise (R-La.) declared, waving the text…",
    "link": "https://crooksandliars.com/2025/03/congressional-budget-office-reveals-gop",
    "timestamp": "2025-03-06T22:49:31Z"
  },
  {
    "title": "Poll: Public Opposes 'Gold Card' Visa Plan",
    "description": "The public does not like President Donald Trump's plan to sell \"Gold Card\" citizenships to wealthy foreigners, according to a Rasmussen poll.\nThe post Poll: Public Opposes ‘Gold Card’ Visa Plan appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/03/06/poll-public-opposes-gold-card-visa-plan/",
    "timestamp": "2025-03-06T22:49:16Z"
  },
  {
    "title": "Federal funding cuts weigh on Massachusetts budget writers amid FY26 spending talks",
    "description": "Massachusetts budget writers struggled Thursday to grapple with the impacts of President Donald Trump’s efforts to reduce the size of the federal government and slash large amounts of federal funding on Gov. Maura Healey’s $62 billion fiscal year 2026 state b…",
    "link": "https://www.bostonherald.com/2025/03/06/federal-funding-cuts-weigh-on-massachusetts-budget-writers-amid-fy26-spending-talks/",
    "timestamp": "2025-03-06T22:48:38Z"
  },
  {
    "title": "Trump Sons Joined Dominari Holding’s Advisory Board–But There’s Little Public Record The Board Existed Beforehand",
    "description": "Trump sons’ appointment to Dominari Holdings’ advisory board sent its stock soaring—but records of the board’s existence before their involvement are scarce.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/03/06/donald-trump-jr-eric-dominari-holdings-advisory-board-domh-stock/",
    "timestamp": "2025-03-06T22:47:51Z"
  },
  {
    "title": "Estate offers trade war escape",
    "description": "<p>SET-listed Amata VN, a developer of industrial estates in Vietnam, is preparing to spend US$15-20 million to develop a new industrial estate in Vietnam to serve investors from China seeking to avoid the impact of the trade war.</p>",
    "link": "https://www.bangkokpost.com/business/general/2974731/estate-offers-trade-war-escape",
    "timestamp": "2025-03-06T22:47:00Z"
  },
  {
    "title": "WATCH: Trump signs orders postponing some tariffs on imports from Mexico and Canada",
    "description": "President Donald Trump on Thursday postponed 25 percent tariffs on many imports from Mexico and some imports from Canada for a month amid widespread fears of the economic fallout from a broader trade war.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-signs-orders-postponing-some-tariffs-on-imports-from-mexico-and-canada",
    "timestamp": "2025-03-06T22:45:58Z"
  },
  {
    "title": "Trump cuts off federal resources for law firm that helped fuel 2016 Russia hoax",
    "description": "President Donald Trump signed an executive order Thursday that would rescind security clearances and access to certain federal resources for Perkins Coie, the law firm that hired the company responsible for crafting the so-called \"Steele dossier\" containing a…",
    "link": "https://www.foxnews.com/politics/trump-cuts-off-federal-resources-law-firm-helped-fuel-2016-russia-hoax",
    "timestamp": "2025-03-06T22:45:43Z"
  },
  {
    "title": "Worried About Tariffs on Canadian Energy? How It Might Impact You",
    "description": "US consumers are facing tariffs that include Canadian energy. We asked experts how that might effect the US economy, consumers and businesses.",
    "link": "https://www.cnet.com/home/energy-and-utilities/worried-about-tariffs-on-canadian-energy-how-it-might-impact-you/",
    "timestamp": "2025-03-06T22:45:03Z"
  },
  {
    "title": "Trump is on track to ditch a time-tested approach to combating homelessness",
    "description": "Since returning to office, the Trump administration has moved to upend America’s long-standing approach to tackling homelessness. The “housing-first” model — which has enjoyed bipartisan support for decades — prioritizes getting people into stable accommodati…",
    "link": "https://www.vox.com/homelessness/402972/housing-first-homeless-hud-scott-turner-housing-affordable-voucher",
    "timestamp": "2025-03-06T22:44:32Z"
  },
  {
    "title": "Trump tells Elon Musk he has no authority to fire government workers - NewsBreak",
    "description": "President Donald Trump has finally put his foot down when it comes to the firing of government employees. Politico reports that Trump convened a cabinet me",
    "link": "https://www.newsbreak.com/share/3843820055673-trump-tells-elon-musk-he-has-no-authority-to-fire-government-workers?_f=app_share&pd=03DNXOum&lang=en_US&send_time=1741301000&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v6%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v5&s=i2",
    "timestamp": "2025-03-06T22:43:51Z"
  },
  {
    "title": "Trump gives automakers one-month tariff reprieve to move operations from Canada, Mexico to US",
    "description": "President Donald Trump has delayed tariffs on automobile imports from Canada and Mexico for one month after requests from executives at the Big Three automakers — General Motors, Ford, and Stellantis — with the expectation that automakers will move any offsho…",
    "link": "https://biztoc.com/x/f6aa2d775364ad36",
    "timestamp": "2025-03-06T22:43:41Z"
  },
  {
    "title": "As US and Canada trade barbs, it's so far so good for Mexico's Sheinbaum",
    "description": "Donald Trump and Justin Trudeau's clear tensions are a stark contrast to the Mexican leader's approach to the White House.",
    "link": "https://www.bbc.com/news/articles/c0q1l398wz3o",
    "timestamp": "2025-03-06T22:43:01Z"
  },
  {
    "title": "Trump revives his 2020 playbook to go after Social Security",
    "description": "Chris Hayes explains how Trump is revving his 2020 playbook and the \"big lie\" to go after Social Security.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-musk-republicans-social-security-lies-rcna195157",
    "timestamp": "2025-03-06T22:42:37Z"
  },
  {
    "title": "Trump questions if NATO would defend US, but 1,000 allies died in the war on terror",
    "description": "Trump said on Thursday he's \"not so sure\" NATO allies would come to America's defense, despite its Article 5 being invoked only once -- after Sept. 11, 2001.",
    "link": "https://abcnews.go.com/Politics/trump-questions-nato-defend-us-1000-allies-killed/story?id=119529187",
    "timestamp": "2025-03-06T22:42:33Z"
  },
  {
    "title": "‘Very Exciting Time!’ White Nationalist Nick Fuentes Praises Candace Owens Media Tour, Joe Rogan’s Conspiracy Theorist Guest",
    "description": "\"So it is a very exciting time and I love to see it,” Fuentes continued, before explaining how his white nationalist views are being furthered\nThe post ‘Very Exciting Time!’ White Nationalist Nick Fuentes Praises Candace Owens Media Tour, Joe Rogan’s Conspira…",
    "link": "https://www.mediaite.com/politics/very-exciting-time-white-nationalist-nick-fuentes-praises-candace-owens-media-tour-joe-rogans-conspiracy-theorist-guest/",
    "timestamp": "2025-03-06T22:41:06Z"
  },
  {
    "title": "Alibaba's Latest AI Model Beats OpenAI's o1-mini, On Par With DeepSeek R1",
    "description": "Albibab Cloud’s latest model rivals much larger competitors with just 32 billion parameters in what it views as a critical step towards AGI.",
    "link": "https://decrypt.co/309022/alibabas-latest-ai-model-beats-openais-o1-mini-on-par-with-deepseek-r1",
    "timestamp": "2025-03-06T22:40:35Z"
  },
  {
    "title": "CNN Forced To Fact-Check Itself After Claiming Trump Lied About Transgender Mice",
    "description": "In his joint address to Congress on Tuesday, President Donald Trump highlighted the “appalling waste” in government spending, including $8 million being allocated to making mice “transgender.” Trump’s point was crystal clear: Taxpayers are spending millions o…",
    "link": "https://thefederalist.com/2025/03/06/cnn-forced-to-fact-check-itself-after-claiming-trump-lied-about-transgender-mice/",
    "timestamp": "2025-03-06T22:39:31Z"
  },
  {
    "title": "Republicans have a sneaky plan to cut Medicaid. Here’s what Americans actually want.",
    "description": "Recently, House Republicans approved the broad outline of their major legislation for this year, which includes $4.5 trillion in tax cuts and $2 trillion in spending cuts. To get there, the Energy and Commerce Committee was charged with finding $880 billion i…",
    "link": "https://www.vox.com/health/402949/trump-medicaid-funding-cuts-public-opinion-polls",
    "timestamp": "2025-03-06T22:38:49Z"
  },
  {
    "title": "ACLU Sues NEA over ‘Gender Ideology’ Funding Policy",
    "description": "The ACLU and several theater companies sued the NEA over a policy that requires funding applicants not to 'promote gender ideology.'",
    "link": "https://www.artnews.com/art-news/news/aclu-nea-lawsuit-gender-ideology-funding-policy-1234734983/",
    "timestamp": "2025-03-06T22:38:35Z"
  },
  {
    "title": "Inside the House Freedom Caucus’ Meeting with President Trump",
    "description": "Members of the conservative House Freedom Caucus opened up to The Daily Signal about their meeting with President Donald Trump to discuss avoiding a government... Read More\nThe post Inside the House Freedom Caucus’ Meeting with President Trump appeared first …",
    "link": "https://www.dailysignal.com/2025/03/06/inside-house-freedom-caucus-meeting-president-trump/",
    "timestamp": "2025-03-06T22:38:34Z"
  },
  {
    "title": "Political tensions weigh on Thai stocks and casino plans",
    "description": "<p>Rising political tensions could be a drag on major government projects, particularly the proposed entertainment and casino complex, says the Thai unit of China Galaxy Securities (CGS), prompting the brokerage to lower its Stock Exchange of Thailand (SET) i…",
    "link": "https://www.bangkokpost.com/business/general/2974841/political-tensions-weigh-on-thai-stocks-and-casino-plans",
    "timestamp": "2025-03-06T22:38:00Z"
  },
  {
    "title": "Trump Still Doesn’t Understand How NATO Works Or That It Fought On America’s Behalf",
    "description": "He threatened not to support others if they haven’t “paid” enough, but did not seem to know that the only time the alliance was triggered was to help the U.S. after 9/11.",
    "link": "https://www.huffpost.com/entry/trump-nato-sept-11_n_67ca16ace4b0404dff301e25",
    "timestamp": "2025-03-06T22:37:43Z"
  },
  {
    "title": "'A train wreck ... I can't stop watching': Canadians grapple with anxiety around Trump's tariff chaos",
    "description": "Political anxiety isn't new, but it's arguably been more intense lately given Trump's \"shock and awe\" strategy since taking office, most recently around the tariffs he's threatening to impose. CBC News asked Canadians to share how Trump's policies are affecti…",
    "link": "https://www.cbc.ca/news/canada/tariffs-anxiety-1.7476203",
    "timestamp": "2025-03-06T22:37:33Z"
  },
  {
    "title": "Trump Cut Education Grants Over ‘DEI.’ It Will Worsen Teacher Shortages, Lawsuit Says",
    "description": "California and seven other states are suing the Department of Education over the termination of $600 million in grants used to train teachers and nonprofits nationwide.",
    "link": "https://www.kqed.org/news/12030028/trump-cut-education-grants-over-dei-it-will-worsen-teacher-shortages-lawsuit-says",
    "timestamp": "2025-03-06T22:37:16Z"
  },
  {
    "title": "Democrats Who Caused a Spectacle During Al Green Censure Process Now Face Punishment of Their Own",
    "description": "A vocal supporter of President Donald Trump, Rep. Andy Ogles of Tennessee has had enough of Democratic temper tantrums.",
    "link": "https://www.westernjournal.com/house-democrats-caused-spectacle-al-green-censure-process-now-face-punishment/",
    "timestamp": "2025-03-06T22:36:34Z"
  },
  {
    "title": "Trump’s Own Declaration of Independence",
    "description": "The president, who has flirted with regal rhetoric, wants a copy of America’s founding document placed in the Oval Office.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/trumps-own-declaration-of-independence/681944/",
    "timestamp": "2025-03-06T22:36:00Z"
  },
  {
    "title": "This Is Why President Trump Is 'Sprinting Out Of The Gate' In First 45 Days: Adam Goodman",
    "description": "GOP strategist Adam Goodman joined \"Forbes Newsroom\" to react to President Donald Trump's address to a joint session of Congress.",
    "link": "https://www.forbes.com/sites/forbestv/2025/03/06/this-is-why-president-trump-is-sprinting-out-of-the-gate-in-first-45-days-adam-goodman/",
    "timestamp": "2025-03-06T22:35:13Z"
  },
  {
    "title": "'He Had 6 Cell Phones': Trump Says More Details About His Would-Be Assassins Could Be Released Soon",
    "description": "On July 13th of last year, Thomas Crooks somehow got up on a roof near where Donald Trump was delivering a speech at a rally in Butler, Pennsylvania. Initially the only people who spotted him were attendees at the rally. The would-be assassin then pulled the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4302616/posts",
    "timestamp": "2025-03-06T22:35:04Z"
  },
  {
    "title": "The November Election That Still Hasn’t Been Certified",
    "description": "North Carolinians voted in a state-supreme-court election four months ago. What’s going on?",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/north-carolina-supreme-court-election/681952/",
    "timestamp": "2025-03-06T22:35:00Z"
  },
  {
    "title": "MAGA world turns against Supreme Court Justice Amy Coney Barrett (Lawrence Hurley/NBC News)",
    "description": "Lawrence Hurley / NBC News:\nMAGA world turns against Supreme Court Justice Amy Coney Barrett  —  The Trump-appointed justice has shifted the court to the right, but she has angered some in MAGA world by voting against some Trump priorities.  —  WASHINGTON — M…",
    "link": "https://www.memeorandum.com/250306/p137",
    "timestamp": "2025-03-06T22:35:00Z"
  },
  {
    "title": "Staffers at a small overseas investment agency deny DOGE building access, suit says",
    "description": "The president of a small federal agency that supports investment in African countries sued on Thursday to block the Trump administration from shutting it down. Ward Brehm, the president and CEO of the US African Development Foundation, said in the lawsuit tha…",
    "link": "https://www.seattlepi.com/news/politics/article/staffers-at-a-small-overseas-investment-agency-20207192.php",
    "timestamp": "2025-03-06T22:34:44Z"
  },
  {
    "title": "Newsom faces fiery backlash after talking 'issue of fairness' with transgender inclusion in women's sports",
    "description": "California Gov. Gavin Newsom faced backlash from Democrats and Republicans over his comments about transgender athletes in women's sports.",
    "link": "https://www.foxnews.com/sports/newsom-faces-fiery-backlash-after-talking-issue-fairness-trans-inclusion-womens-sports",
    "timestamp": "2025-03-06T22:34:44Z"
  },
  {
    "title": "Amy Coney Barrett and John Roberts Become a Thorn in Trump's Side",
    "description": "Barrett and Roberts have signaled a willingness to act, at least at times, as a check on Trump's efforts to expand his power.",
    "link": "https://www.newsweek.com/amy-coney-barrett-john-roberts-trump-supreme-court-2040802",
    "timestamp": "2025-03-06T22:34:35Z"
  },
  {
    "title": "'They voted for me so I like them': Trump declares Irish American Heritage Month",
    "description": "The practice dates back to 1991.",
    "link": "https://www.thejournal.ie/trump-irish-america-6642088-Mar2025/",
    "timestamp": "2025-03-06T22:33:32Z"
  }
]