[
  {
    "title": "Trump ally Kash Patel's red flags about his behaviour is infuriating FBI officials. Here's why",
    "description": "Kash Patel's approach as FBI Director has raised concerns. His attendance at briefings is inconsistent. He is seen at public events. This prompts questions about his commitment. Some defend Patel, citing his work ethic. Others allege he prioritizes leisure. M…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-ally-kash-patels-red-flags-about-his-behaviour-is-infuriating-fbi-officials-heres-why/articleshow/121078819.cms",
    "timestamp": "2025-05-11T11:11:26Z"
  },
  {
    "title": "UK needs new EU trade deal, not scraps from the White House",
    "description": "For Keir Starmer, all roads lead back to Brussels, a toxic subject for many Britons but an economic necessity for a country looking to grow",
    "link": "https://www.irishtimes.com/business/economy/2025/05/11/uk-needs-new-eu-trade-deal-not-scraps-from-the-white-house/",
    "timestamp": "2025-05-11T11:08:43Z"
  },
  {
    "title": "Trump admin poised to accept luxury jet as gift for Trump from Qatar: Sources",
    "description": "President Trump poised to accept \"palace in the sky\" as a gift from Qatar: Sources",
    "link": "https://abcnews.go.com/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511",
    "timestamp": "2025-05-11T11:07:24Z"
  },
  {
    "title": "Trump's trade war is giving renewed importance to advertising Upfronts",
    "description": "Media advertising chiefs say chief marketing officers across industries are making contingency plans in light of the trade war.",
    "link": "https://www.cnbc.com/2025/05/11/advertising-upfronts-trump-trade-renewed-importance.html",
    "timestamp": "2025-05-11T11:00:01Z"
  },
  {
    "title": "Disagreements on Iran, Gaza straining Trump-Netanyahu relationship",
    "description": "Benjamin Netanyahu and Israel are \"worried about any deal\" President Trump might strike with Iran, one source told NBC News.",
    "link": "https://www.nbcnews.com/politics/national-security/disagreements-iran-gaza-straining-trump-netanyahu-relationship-rcna205985",
    "timestamp": "2025-05-11T11:00:00Z"
  },
  {
    "title": "Tribal communities risk losing local libraries and the history they hold amid DOGE cuts",
    "description": "Inside a 90-square-mile stretch of rural reservation between the eastern Jemez Mountains and the banks of the Rio Grande River sits the Santa Clara Pueblo Community Library, an anchor for the northern New Mexico tribe it serves.",
    "link": "https://www.nbcnews.com/politics/politics-news/tribal-communities-risk-losing-local-libraries-history-hold-doge-cuts-rcna203508",
    "timestamp": "2025-05-11T11:00:00Z"
  },
  {
    "title": "Black college seniors graduating into soft labor market and reduced DEI practices",
    "description": "The class of 2025 faces an uncertain future, but they also say they are seeking jobs in companies where “I’m wanted, not where I’m tolerated.”",
    "link": "https://www.nbcnews.com/news/nbcblk/dei-cuts-soft-job-market-black-college-grads-rcna201171",
    "timestamp": "2025-05-11T11:00:00Z"
  },
  {
    "title": "Links 5/11/2025",
    "description": "Our strategic daily links:dancing robots, global toxics, China trade war, gulf of America, Romanian election, Gaza horrors, Ukraine burning, vanishing privacy, Democrats adrift, self deportations, DOGEy moves, dollar troubles, AI diagnosis, and wretched excess",
    "link": "https://www.nakedcapitalism.com/2025/05/links-5-11-2025.html",
    "timestamp": "2025-05-11T10:55:22Z"
  },
  {
    "title": "Trump is bringing white South Africans to the US as refugees, but what persecution are they facing?",
    "description": "CAPE TOWN, South Africa (AP) — The Trump administration is bringing a small number of white South Africans to the United States as refugees next week in what it says is the start of a larger relocation effort for a minority group who are being persecuted by t…",
    "link": "https://freerepublic.com/focus/f-news/4316282/posts",
    "timestamp": "2025-05-11T10:54:44Z"
  },
  {
    "title": "First video from inside notorious El Salvador prison shows chilling reality for inmates",
    "description": "The US has sent people to the prison in El Salvador, and a video has shown what it's like for inmates",
    "link": "https://www.ladbible.com/news/world-news/el-salvador-prison-footage-cecot-trump-002614-20250511",
    "timestamp": "2025-05-11T10:52:03Z"
  },
  {
    "title": "India and Pakistan ceasefire shaken by overnight fighting in disputed Kashmir region",
    "description": "People on both sides of the Line of Control, which divides the territory, reported heavy exchanges of fire between Indian and Pakistani troops. The fighting subsided by Sunday morning.",
    "link": "https://www.npr.org/2025/05/11/g-s1-65755/india-pakistan-ceasefire-shaken-overnight-fighting-kashmir",
    "timestamp": "2025-05-11T10:46:27Z"
  },
  {
    "title": "Pope Leo XIV Reveals How AI Helped Choose His Papal Name",
    "description": "In an address, Pope Leo XIV explained that his name references Pope Leo XIII, who presided over the church between 1878 and 1903.",
    "link": "https://www.ndtv.com/world-news/pope-leo-xiv-reveals-how-ai-helped-choose-his-papal-name-8386918",
    "timestamp": "2025-05-11T10:45:11Z"
  },
  {
    "title": "Iran calls latest nuclear talks with US ‘difficult’ but both sides agree negotiations will continue | CNN",
    "description": "The latest round of high stakes nuclear talks between Iran and the US have ended, with Tehran calling them difficult but with both sides agreeing to further negotiations.",
    "link": "https://www.cnn.com/2025/05/11/middleeast/iran-us-talks-fourth-round-oman-intl",
    "timestamp": "2025-05-11T10:43:39Z"
  },
  {
    "title": "Thousands of Homeless Veterans To Be Housed Under New Trump Plan",
    "description": "The White House has set a goal of housing 6,000 homeless veterans at a Los Angeles campus by 2028.",
    "link": "https://www.newsweek.com/homeless-veterans-housed-trump-los-angeles-2070642",
    "timestamp": "2025-05-11T10:42:17Z"
  },
  {
    "title": "US, Iran Resume Nuclear Talks Amid Uncertainty Over Key Issues",
    "description": "US and Iranian officials began a fourth round of negotiations in Oman on Sunday, aiming to reach a new agreement on Tehran’s nuclear program.",
    "link": "https://financialpost.com/pmn/business-pmn/us-iran-resume-nuclear-talks-amid-uncertainty-over-key-issues",
    "timestamp": "2025-05-11T10:37:04Z"
  },
  {
    "title": "Ukraine Will Meet Russia For Talks If Moscow Agrees To Ceasefire",
    "description": "Ukrainian President Volodymyr Zelensky on Sunday said that Kyiv would meet with Moscow for talks in Istanbul on May 15 but said that Russia must first commit to a 30-day ceasefire starting on Monday.",
    "link": "https://www.ibtimes.com.au/ukraine-will-meet-russia-talks-if-moscow-agrees-ceasefire-1858723",
    "timestamp": "2025-05-11T10:36:19Z"
  },
  {
    "title": "Cecily Strong and Colin Jost make surprise cameos in ‘SNL’ cold open | CNN",
    "description": "Things started off warmly enough on this weekend’s episode of “Saturday Night Live” but then took a turn.",
    "link": "https://www.cnn.com/2025/05/11/entertainment/cecily-strong-colin-jost-snl-opening",
    "timestamp": "2025-05-11T10:35:45Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan",
    "description": "AMRITSAR, India/ MUZAFFARABAD, Pakistan - A fragile ceasefire was holding between India and Pakistan on Sunday, after hours of overnight fighting between the nuclear-armed neighbours, as US President Donald Trump said he will work to provide a solution regard…",
    "link": "https://www.bangkokpost.com/world/3022936/fragile-ceasefire-holds-between-india-pakistan",
    "timestamp": "2025-05-11T10:35:00Z"
  },
  {
    "title": "Prospects of Saudi ties to Israel elusive as Trump seeks $1 trillion bonanza",
    "description": "Summary Saudi-Israel normalization stalled due to Gaza conflict Focus on $1 trillion investments, arms deals, and AI collaborations Trump’s visit aims to counter China’s rising clout in region WASHINGTON/DUBAI, May 11 (Reuters) - When U.S. President Donald Tr…",
    "link": "https://freerepublic.com/focus/f-news/4316280/posts",
    "timestamp": "2025-05-11T10:33:22Z"
  },
  {
    "title": "WATCH: Trump, Boozed-Up Jeanine Pirro And Hegseth Crash Mother’s Day Tribute In Outrageous SNL Cold Open",
    "description": "Trump, a boozy Jeannine Pirro, and an off-the-wagon Pete Hegseth crashed a Mother's Day tribute in Saturday Night Live's Season 50 cold open.\nThe post WATCH: Trump, Boozed-Up Jeanine Pirro And Hegseth Crash Mother’s Day Tribute In Outrageous SNL Cold Open fir…",
    "link": "https://www.mediaite.com/news/watch-trump-boozed-up-jeanine-pirro-and-hegseth-crash-mothers-day-tribute-in-outrageous-snl-cold-open/",
    "timestamp": "2025-05-11T10:31:58Z"
  },
  {
    "title": "As new Social Security leadership takes the helm, here are the changes beneficiaries need to watch",
    "description": "Social Security's approximate 73 million beneficiaries have seen some key changes to benefits and services in the first 100 days of the Trump administration.",
    "link": "https://www.cnbc.com/2025/05/11/social-security-changes-to-monitor-under-new-agency-leadership.html",
    "timestamp": "2025-05-11T10:30:01Z"
  },
  {
    "title": "Inside Trump’s trip to Qatar: Long-time home to Hamas — and America’s ultimate ‘frenemy’",
    "description": "When President Trump visits the Middle East this coming week — spending four days in a trio of Arabian Gulf nations — his most controversial stop will be Qatar. Claiming to be America’s friend, yet in intimate contact with America’s enemies, Qatar is what man…",
    "link": "https://nypost.com/2025/05/11/world-news/inside-trumps-trip-to-qatar-long-time-home-to-hamas-and-americas-ultimate-frenemy/",
    "timestamp": "2025-05-11T10:30:00Z"
  },
  {
    "title": "How Apple invested big, profited greatly and sold itself to China",
    "description": "“Apple in China,” by Patrick McGee, tells the gripping tale of how the computer giant’s decades-long investment in China fueled its spectacular success and, in turn, accelerated China’s rise as a technology superpower. This story begins nearly 30 years ago. A…",
    "link": "https://nypost.com/2025/05/11/lifestyle/how-apple-invested-big-profited-greatly-and-sold-itself-to-china/",
    "timestamp": "2025-05-11T10:30:00Z"
  },
  {
    "title": "Bitcoin Eyes $105K as SEC Talks Tokenization – 3 New Crypto Projects to Watch",
    "description": "The crypto market just turned up the volume. Bitcoin is now flirting with the $105K mark, sending traders and holders into a frenzy over the weekend. Positive headlines around the U.S. economy and fresh signals from regulators are adding more fuel to the fire…",
    "link": "https://bitcoinist.com/bitcoin-eyes-105k-as-sec-talks-tokenization-3-new-crypto-projects-to-watch/",
    "timestamp": "2025-05-11T10:27:06Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan as Trump offers more help",
    "description": "SummaryRelief in border towns on Sunday morning as ceasefire holds Trump pledges increased trade and Kashmir solution Ceasefire reached after US diplomacy and pressure India and Pakistan blame each other for overnight violations AMRITSAR, India/ MUZAFFARABAD,…",
    "link": "https://freerepublic.com/focus/f-news/4316279/posts",
    "timestamp": "2025-05-11T10:24:07Z"
  },
  {
    "title": "US, China begin 2nd day of tariff talks; no breakthroughs but Trump touts 'great progress'",
    "description": "The US and China resumed critical tariff negotiations in Geneva, aiming to de-escalate trade tensions. While President Trump expressed optimism about \"great progress\" and a potential \"total reset,\" China's official news agency adopted a firm stance, rejecting…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-begin-2nd-day-of-tariff-talks-no-breakthroughs-but-trump-touts-great-progress/articleshow/121078383.cms",
    "timestamp": "2025-05-11T10:23:33Z"
  },
  {
    "title": "Zelensky Welcomes 'Positive' Overtures From Putin, But Says Ceasefire Must Come Before Peace Talks",
    "description": "Ukrainian President Volodymyr Zelenskyy on Sunday welcomed Russia's offer for direct peace talks, but insisted there must be a full, temporary ceasefire in place before negotiations can start.\nThe post Zelensky Welcomes ‘Positive’ Overtures From Putin, But Sa…",
    "link": "https://www.breitbart.com/europe/2025/05/11/zelensky-welcomes-positive-overtures-from-putin-but-says-ceasefire-must-come-before-peace-talks/",
    "timestamp": "2025-05-11T10:17:03Z"
  },
  {
    "title": "It took 5 years to write this Mother's Day column. My fury at Trump stopped me every time",
    "description": "My mom died from COVID in 2020, just after Mother’s Day. I couldn’t write about it until I could be honest about who she was, a feat complicated by my then-pending congressional race\r\n, which served my own ass to me on an unceremonious platter. Apparently cli…",
    "link": "https://www.rawstory.com/raw-investigates/covid-deaths-under-trump/",
    "timestamp": "2025-05-11T10:17:02Z"
  },
  {
    "title": "Prospects of Saudi ties to Israel elusive as Trump seeks $1 trillion bonanza",
    "description": "Establishing ties has become especially toxic for Saudi Arabia, the birthplace of Islam, since the start of the ongoing war between Israel and Hamas.",
    "link": "https://www.jpost.com/middle-east/article-853503",
    "timestamp": "2025-05-11T10:11:25Z"
  },
  {
    "title": "Iran and the US begin a 4th round of negotiations over Tehran's nuclear program in Oman (Jon Gambrell/Associated Press)",
    "description": "Jon Gambrell / Associated Press:\nIran and the US begin a 4th round of negotiations over Tehran's nuclear program in Oman  —  Iran and the United States began a fourth round of negotiations Sunday over Tehran's rapidly advancing nuclear program, officials said…",
    "link": "https://www.memeorandum.com/250511/p1",
    "timestamp": "2025-05-11T10:10:02Z"
  },
  {
    "title": "Pakistan lauds US support for India ceasefire deal",
    "description": "Pakistan's Ministry of Foreign Affairs welcomed on Sunday remarks by United States President Donald J. Trump regarding his support for peace efforts between Pakistan and India.\nIslamabad praised ...",
    "link": "https://biztoc.com/x/891c6d28b17fa7f7",
    "timestamp": "2025-05-11T10:09:12Z"
  },
  {
    "title": "What Trump does next on Ukraine is key - and he could go either way",
    "description": "Neither Putin nor Zelensky want to be seen by Trump as the obstacle to peace, writes Frank Gardner.",
    "link": "https://www.bbc.com/news/articles/crmk2y7lrpeo",
    "timestamp": "2025-05-11T10:07:44Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan",
    "description": "A fragile ceasefire was holding between India and Pakistan yesterday, after hours of overnight fighting between the nuclear-armed neighbors, as U.S. President Donald Trump said he will work to provide a solution regarding Kashmir.",
    "link": "https://www.hurriyetdailynews.com/fragile-ceasefire-holds-between-india-pakistan-209036",
    "timestamp": "2025-05-11T10:05:00Z"
  },
  {
    "title": "Pak Envoy Was Asked About Trump's Role In Ceasefire With India. His Reply",
    "description": "Pakistan&#039;s High Commissioner to the United Kingdom, Mohammad Faisal, during an interview with the UK&#039;s Sky News, was asked whether he could clarify the role of President Trump in the ceasefire agreement between India and Pakistan.",
    "link": "https://www.ndtv.com/world-news/india-pakistan-ceasefire-pak-envoy-was-asked-about-trumps-role-in-ceasefire-with-india-his-reply-8386679",
    "timestamp": "2025-05-11T10:04:07Z"
  },
  {
    "title": "Trump made historic gains with minority voters in 2024. They are already pulling back in 2025",
    "description": "Several of the key voter groups that provided President Donald Trump’s most important electoral gains in the 2024 election are recoiling from him as his presidency moves past the 100-day mark. But it remains unclear how much Democrats can benefit from these g…",
    "link": "https://www.cnn.com/2025/05/11/politics/gop-voter-coalition-2024-trump",
    "timestamp": "2025-05-11T10:00:51Z"
  },
  {
    "title": "Will President Trump protect the Christian Afghan refugees who fled here to escape martyrdom?",
    "description": "President Donald Trump should work to protect Christian Afghan refugees within the United States.",
    "link": "https://www.foxnews.com/opinion/president-trump-protect-christian-afghan-refugees-who-fled-here-escape-martyrdom",
    "timestamp": "2025-05-11T10:00:41Z"
  },
  {
    "title": "The FDA Will Use AI to Accelerate Approving Drugs",
    "description": "The Food and Drug Administration just announced that it will immediately start using AI across all of its centers, after completing a new generative AI pilot for scientific reviewers. Supposedly, the AI tool will speed up the FDA's drug review process by redu…",
    "link": "https://futurism.com/fda-ai-approve-drugs",
    "timestamp": "2025-05-11T10:00:40Z"
  },
  {
    "title": "Virginia Republicans are reeling — and they have no one to blame but themselves",
    "description": "The Virginia GOP faces disaster thanks to a scandal involving John Reid, its nominee for lieutenant governor and Gov. Glenn Youngkin's defense of Donald Trump",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/virginia-republicans-john-reid-scandal-glenn-youngkin-rcna205883",
    "timestamp": "2025-05-11T10:00:00Z"
  },
  {
    "title": "The Democrats Have an Age-Old Problem",
    "description": "It goes without saying that Democratic voters have developed some grave misgivings about the party’s gerontological bent. Well before President Joe Biden’s advanced age took him out of the 2024 presidential race, a Pew poll found that 79 percent of Americans …",
    "link": "https://newrepublic.com/post/195034/democrats-age-problem-clyburn-2028",
    "timestamp": "2025-05-11T10:00:00Z"
  },
  {
    "title": "The Next Phase of Trump’s Retribution",
    "description": "Antonina Hitchens on what the replacement of Ed Martin, who punished his own prosecutors for bringing cases against January 6th rioters, signals about Donald Trump’s signature campaign promise.",
    "link": "https://www.newyorker.com/news/the-lede/the-next-phase-of-trumps-retribution",
    "timestamp": "2025-05-11T10:00:00Z"
  },
  {
    "title": "Zelenskyy welcomes Putin’s indication of readiness for peace talks",
    "description": "Russia showed willingness to negotiate with Ukraine for the first time since 2022.",
    "link": "https://www.politico.eu/article/zelenskyy-welcomes-putin-readiness-for-peace-talks-ukraine-russia/",
    "timestamp": "2025-05-11T09:59:51Z"
  },
  {
    "title": "A business owner tested if customers would pay more for American-made. The results were 'sobering.'",
    "description": "Afina founder Ramon van Meer wanted to see if people would buy a higher-priced, Made-in-USA version of his filtered shower head — so he ran a test.",
    "link": "https://www.businessinsider.com/afina-shower-head-founder-tests-paying-more-american-made-2025-5",
    "timestamp": "2025-05-11T09:57:01Z"
  },
  {
    "title": "US-China talks resume as Trump hails 'total reset' in trade relations",
    "description": "GENEVA: Talks between top US and Chinese officials resumed for a second day on Sunday (May 11), after US President Donald Trump voiced optimism over the negotiations aimed at de-escalating trade tensions",
    "link": "https://www.channelnewsasia.com/world/us-china-talks-donald-trump-tariffs-geneva-5122571",
    "timestamp": "2025-05-11T09:57:00Z"
  },
  {
    "title": "Trump antisemitism envoy to attend NYC Jerusalem conference",
    "description": "Rabbi Yehuda Kaploun, Trump's nominee for US Special Envoy to Monitor and Combat Antisemitism, will attend the Jerusalem Conference in New York on May 18 at the Fifth Avenue Synagogue in Manhattan.",
    "link": "https://www.israelnationalnews.com/news/408155",
    "timestamp": "2025-05-11T09:56:00Z"
  },
  {
    "title": "Putin proposes direct peace talks with Ukraine to end war",
    "description": "Russian President Vladimir Putin on Sunday proposed direct talks with Ukrainian officials to finally bring an end to the war, which was a welcome sign for Kyiv.",
    "link": "https://www.foxnews.com/world/putin-proposes-direct-peace-talks-ukraine-end-war",
    "timestamp": "2025-05-11T09:55:35Z"
  },
  {
    "title": "Zelenskyy welcomes peace talks proposal, but insists on ceasefire",
    "description": "Zelenskyy called Putin's counteroffer a “positive sign” and said that “the entire world has been waiting for this for a very long time.\"",
    "link": "https://www.wlwt.com/article/ukraine-russia-ceasefire-peace-talks-zelenskyy-putin/64735303",
    "timestamp": "2025-05-11T09:51:28Z"
  },
  {
    "title": "India, EU to hold next round of FTA talks from Monday for early conclusion of first part",
    "description": "India and the EU are set to begin the next round of FTA talks, aiming to finalize the first phase swiftly due to global trade uncertainties. Negotiations will cover market access, services, investment, and government procurement, with a focus on core trade is…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-eu-to-hold-next-round-of-fta-talks-from-monday-for-early-conclusion-of-first-part/articleshow/121077860.cms",
    "timestamp": "2025-05-11T09:50:51Z"
  },
  {
    "title": "Ukraine ready for Russia truce talks, Zelensky says",
    "description": "KYIV (UKRAINE) - Ukrainian President Volodymyr Zelensky said on Sunday he expects Moscow to commit to a 30-day ceasefire, adding that Kyiv was \"ready\" to meet Russia for direct truce talks.",
    "link": "https://www.bangkokpost.com/world/3022926/ukraine-ready-for-russia-truce-talks-zelensky-says",
    "timestamp": "2025-05-11T09:45:00Z"
  },
  {
    "title": "Turkish student Rumeysa Ozturk says she will continue to pursue her case",
    "description": "Student freed from US detention after writing Gaza opinion piece says she has 'faith in American system of justice'.",
    "link": "https://www.aljazeera.com/news/2025/5/11/turkish-student-rumeysa-ozturk-says-she-will-continue-to-pursue-her-case",
    "timestamp": "2025-05-11T09:43:50Z"
  },
  {
    "title": "Iran and the US begin a 4th round of negotiations over Tehran's nuclear program in Oman",
    "description": "Iran and the United States started a fourth round of nuclear program talks in Oman. These discussions aimed to limit Iran's nuclear activities in exchange for lifting US sanctions. Donald Trump planned a Middle East visit amid rising tensions. Iran insisted o…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-and-the-us-begin-a-4th-round-of-negotiations-over-tehrans-nuclear-program-in-oman/articleshow/121077638.cms",
    "timestamp": "2025-05-11T09:43:07Z"
  },
  {
    "title": "US and China begin 2nd day of tariff talks. No breakthroughs but Trump touts ‘great progress’",
    "description": "GENEVA (AP) — The U.S. and China on Sunday resumed crucial tariff talks that have put the global economy on edge, but appeared to have diverging views of where the negotiations presently stand. U.S. President Donald Trump wrote on social media that “great pro…",
    "link": "https://financialpost.com/pmn/us-and-china-begin-2nd-day-of-tariff-talks-no-breakthroughs-but-trump-touts-great-progress",
    "timestamp": "2025-05-11T09:34:26Z"
  },
  {
    "title": "Trump stops funding for life-saving infant heart device research, cancels $6.7 million grant",
    "description": "The Trump administration has revoked a $6.7 million grant for the PediaFlow device, a potentially life-saving heart pump for newborns with congenital defects. Awarded to Cornell University by the Department of Defence, the funding was abruptly cancelled witho…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-stops-funding-for-life-saving-infant-heart-device-research-cancels-6-7-million-grant-pediaflow-device/articleshow/121077177.cms",
    "timestamp": "2025-05-11T09:33:41Z"
  },
  {
    "title": "Iran, US to resume nuclear talks despite key disagreements",
    "description": "The US demands Iran stop uranium enrichment, while Iran refuses to compromise on its nuclear rights. Tehran and Washington both have said they prefer diplomacy to resolve the dispute.",
    "link": "https://www.dw.com/en/iran-us-to-resume-nuclear-talks-despite-key-disagreements/a-72506053",
    "timestamp": "2025-05-11T09:30:00Z"
  },
  {
    "title": "Egg prices decline, but grocery shoppers face coming uncertainty",
    "description": "Egg prices are stabilizing after a sharp run-up earlier this year, but grocery shoppers are already getting used to shelling out more for those and other staples.",
    "link": "https://www.nbcnews.com/business/consumer/egg-prices-decline-grocery-shoppers-face-uncertainty-rcna205220",
    "timestamp": "2025-05-11T09:30:00Z"
  },
  {
    "title": "Iran, US resume nuclear talks despite key disagreements",
    "description": "The US demands Iran stop uranium enrichment, while Iran refuses to compromise on its nuclear rights. Tehran and Washington both have said they prefer diplomacy to resolve the dispute. High-level discussions between representatives from Iran and the United Sta…",
    "link": "https://www.dw.com/en/iran-us-resume-nuclear-talks-despite-key-disagreements/a-72506053",
    "timestamp": "2025-05-11T09:30:00Z"
  },
  {
    "title": "Report: Trump set to meet Palestinian, Syrian, Lebanese presidents in Saudi Arabia this week",
    "description": "According to a source cited by al-Quds, the Saudi crown prince 'expects Trump to endorse the long-standing Saudi condition for the establishment of a Palestinian state' – a commitment that would mark one of the most significant achievements of Saudi Arabia's …",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-11/ty-article/.premium/report-trump-set-to-meet-palestinian-syrian-lebanese-presidents-in-riyadh-this-week/00000196-be8c-dbb0-af9f-bf9eeca20000",
    "timestamp": "2025-05-11T09:27:22Z"
  },
  {
    "title": "Trump vows to boost trade with India, Pakistan after ceasefire",
    "description": "US President Trump plans to increase trade with India and Pakistan after ceasefire agreement, despite India's stance on Kashmir.",
    "link": "https://www.thehindubusinessline.com/economy/trump-vows-to-boost-trade-with-india-pakistan-after-ceasefire/article69563709.ece",
    "timestamp": "2025-05-11T09:23:08Z"
  },
  {
    "title": "Indira Gandhi 'mishandled' situation following creation of Bangladesh, says Assam CM Himanta Sarma",
    "description": "Assam Chief Minister Himanta Biswa Sarma criticized Indira Gandhi's handling of the post-1971 Bangladesh situation, calling it a \"historic opportunity lost.\" He argued that despite India's military victory, the political leadership failed to secure lasting st…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/indira-gandhi-mishandled-situation-following-creation-of-bangladesh-says-assam-cm-himanta-sarma/articleshow/121077041.cms",
    "timestamp": "2025-05-11T09:19:13Z"
  },
  {
    "title": "US-China talks to defuse trade row resume in Geneva",
    "description": "GENEVA (Reuters) -Senior U.S. and Chinese officials met again on Sunday in Geneva, two sources familiar with the situation told Reuters, to resume weekend...",
    "link": "https://finance.yahoo.com/news/us-china-talks-defuse-trade-091253351.html",
    "timestamp": "2025-05-11T09:12:53Z"
  },
  {
    "title": "'Our doctrine now is tit for tat and we will keep hitting unless you reform', foreign expert hails India's response to Pakistan",
    "description": "Leading Foreign Affairs Expert Robinder Sachdev hailed the measured actions India took against Pakistan and said that a message has gone loud and clear to the world and to Pakistan that India's doctrine now is \"tit for tat\". He made the remarks on Sunday.",
    "link": "https://economictimes.indiatimes.com/news/india/our-doctrine-now-is-tit-for-tat-and-we-will-keep-hitting-unless-you-reform-foreign-expert-hails-indias-response-to-pakistan/articleshow/121076791.cms",
    "timestamp": "2025-05-11T09:10:37Z"
  },
  {
    "title": "India claims its strikes inside Pakistan territory last week killed over 100 militants",
    "description": "India’s military strikes into Pakistan-controlled Kashmir and Pakistan earlier this week killed more than 100 militants including prominent leaders, the head...",
    "link": "https://www.yahoo.com/news/india-pakistan-ceasefire-shaken-overnight-090907279.html",
    "timestamp": "2025-05-11T09:09:07Z"
  },
  {
    "title": "Ukraine ready for Russia truce talks, Zelensky says",
    "description": "Ukrainian President Volodymyr Zelensky said on Sunday he expects Moscow to commit to a 30-day ceasefire, adding that Kyiv was “ready” to meet Russia for direct truce talks. Zelensky said so after Russia’s Vladimir Putin called on Kyiv to meet in Istanbul for …",
    "link": "https://www.digitaljournal.com/world/ukraine-ready-for-russia-truce-talks-zelensky-says/article",
    "timestamp": "2025-05-11T09:07:20Z"
  },
  {
    "title": "Potential GOP candidate for governor Brian Shortsleeve wants to repeal MBTA housing law",
    "description": "Brian Shortsleeve, a former MBTA executive and venture capitalist who is considering running for governor, said if elected, he would push state lawmakers to repeal a transit-oriented multi-family housing law that has generated controversy in cities and towns …",
    "link": "https://www.bostonherald.com/2025/05/11/potential-gop-candidate-for-governor-brian-shortsleeve-wants-to-repeal-mbta-housing-law/",
    "timestamp": "2025-05-11T09:06:55Z"
  },
  {
    "title": "Ukraine Ready For Russia Truce Talks, Zelensky Says",
    "description": "Ukrainian President Volodymyr Zelensky said on Sunday he expects Moscow to commit to a 30-day ceasefire, adding that Kyiv was \"ready\" to meet Russia for direct truce talks.",
    "link": "https://www.ibtimes.com/ukraine-ready-russia-truce-talks-zelensky-says-3773159",
    "timestamp": "2025-05-11T09:06:21Z"
  },
  {
    "title": "Zelenskiy Says Ukraine Will Talk Once Russia Agrees to Truce",
    "description": "President Volodymyr Zelenskiy said Ukraine was ready to meet for talks with Russia — but only after Vladimir Putin agrees to an unconditional 30-day ceasefire, which the Russian president so far hasn’t done.",
    "link": "https://financialpost.com/pmn/business-pmn/zelenskiy-says-ukraine-will-talk-once-russia-agrees-to-truce",
    "timestamp": "2025-05-11T09:05:34Z"
  },
  {
    "title": "India, Pakistan agree to cease-fire after negotiations with U.S.",
    "description": "Washington DC (UPI) May 10, 2025 \n\n\n India and Pakistan on Saturday agreed to an \"immediate cease-fire,\" the neighboring nations and U.S. President Donald Trump announced. \n The Asian countries, both of which are nuclear powers, paused fighting at 5:00 p.m. l…",
    "link": "https://www.spacewar.com/reports/India_Pakistan_agree_to_cease-fire_after_negotiations_with_US_999.html",
    "timestamp": "2025-05-11T09:04:07Z"
  },
  {
    "title": "Europeans leaders, Zelensky press Russia for 30-day cease-fire; Putin propose talks with Ukraine",
    "description": "Washington DC (UPI) May 10, 2025 \n\n\n European leaders from Britain, France, Germany and Poland joined Ukrainian President Volodymyr Zelensky in Kyiv on Saturday in urging Russian President Vladimir Putin to accept a 30-day unconditional ceasefire or face more…",
    "link": "https://www.spacewar.com/reports/Europeans_leaders_Zelensky_press_Russia_for_30-day_cease-fire_Putin_propose_talks_with_Ukraine_999.html",
    "timestamp": "2025-05-11T09:04:07Z"
  },
  {
    "title": "Indian economy likely to grow at 6.5% in FY26: CII",
    "description": "‘We are looking at 6.5%, we believe this number can be achieved fundamentally, because the fact is, we are starting with a reasonably good foundation, robust economic foundation’",
    "link": "https://www.thehindubusinessline.com/economy/indian-economy-likely-to-grow-at-65-in-fy26-cii/article69563732.ece",
    "timestamp": "2025-05-11T09:03:47Z"
  },
  {
    "title": "Trump claims ‘total reset’ in US-China trade relations after tariff talks in Geneva",
    "description": "US president praises ‘very good’ discussions as top US and Chinese officials meet over trade war triggered by Trump’s tariff blitz\nDonald Trump has hailed a “total reset” in US-China trade relations after the first day of talks between top American and Chines…",
    "link": "https://biztoc.com/x/faed40ef437bc5d7",
    "timestamp": "2025-05-11T09:02:08Z"
  },
  {
    "title": "Toilet paper shortage could be coming to US thanks to Trump tariffs",
    "description": "President Donald Trump‘s trade war is triggering alarm among global paper suppliers — one that could lead to a dreaded shortage in US supermarkets of a household staple: toilet paper.\nSuzano SA, the world’s largest exporter of pulp, said US levies are disrupt…",
    "link": "https://biztoc.com/x/404cd89e7ae50c47",
    "timestamp": "2025-05-11T09:02:06Z"
  },
  {
    "title": "Susan Collins takes steps toward 2026 run as big-name Democrats weigh potential challenge | CNN Politics",
    "description": "Democrats have one big hope as they scramble to find a top-tier recruit against GOP Sen. Susan Collins in Maine: Maybe she won’t run at all.",
    "link": "https://www.cnn.com/2025/05/11/politics/maine-senate-collins-democrats-2026",
    "timestamp": "2025-05-11T09:00:50Z"
  },
  {
    "title": "The middle class is spending less on 'aspirational' luxury, and it's threatening a yearslong boom in the high-end market",
    "description": "The global luxury market contracted for the first time in 15 years in 2024, with  \"aspirational\" consumers tightening their belts amid economic angst.",
    "link": "https://www.businessinsider.com/middle-class-economy-wealth-luxury-shopping-consumers-spending-retail-2025-5",
    "timestamp": "2025-05-11T09:00:02Z"
  },
  {
    "title": "America's Longest Cable-Stayed Bridge To Link US With Canada",
    "description": "The Gordie Howe International Bridge is expected to open toward the end of the year amid tensions between the two countries.",
    "link": "https://www.newsweek.com/bridge-canada-gordie-howe-2070024",
    "timestamp": "2025-05-11T09:00:02Z"
  },
  {
    "title": "Pocahontas 2.0",
    "description": "\"What I didn't like about becoming famous overnight,\" Mallory McMorrow writes in her new book Hate Won't Win: Find Your Power and Leave This Place Better Than You Found It, \"is that you might assume that I had always done this, that somehow it came naturally.…",
    "link": "https://freebeacon.com/culture/pocahontas-2-0/",
    "timestamp": "2025-05-11T08:58:38Z"
  },
  {
    "title": "Ukraine's Zelenskiy calls on Russia to confirm ceasefire before talks",
    "description": "KYIV (Reuters) - Ukrainian President Volodymyr Zelenskiy called on Russia on Sunday to confirm an unconditional ceasefire beginning on May 12, saying Ukraine would then be ready to meet for talks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/11/ukraine039s-zelenskiy-calls-on-russia-to-confirm-ceasefire-before-talks",
    "timestamp": "2025-05-11T08:57:00Z"
  },
  {
    "title": "Ukraine's Zelenskiy calls on Russia to confirm ceasefire before talks",
    "description": "Ukrainian President Volodymyr Zelenskiy called on Russia on Sunday to confirm an unconditional ceasefire beginning on May 12, saying Ukraine would then be...",
    "link": "https://www.yahoo.com/news/ukraines-zelenskiy-calls-russia-confirm-085255230.html",
    "timestamp": "2025-05-11T08:52:55Z"
  },
  {
    "title": "Trump meeting in Saudi to include Mahmoud Abbas, Ahmed al-Sharaa",
    "description": "Trump is set to visit the Middle East, in a trip aimed at securing Gulf investment, advancing Gaza ceasefire efforts, and confronting Iran’s nuclear ambitions.",
    "link": "https://www.jpost.com/middle-east/article-853491",
    "timestamp": "2025-05-11T08:51:18Z"
  },
  {
    "title": "Indian Economy Likely to Grow At 6.5% In FY26: CII - News18",
    "description": "'We believe this number can be achieved fundamentally, because the fact is, we are starting with reasonably good foundation, robust economic foundation': CII president Sanjiv Puri.",
    "link": "https://www.news18.com/business/economy/indian-economy-likely-to-grow-at-6-5-in-fy26-cii-9332396.html",
    "timestamp": "2025-05-11T08:51:05Z"
  },
  {
    "title": "Doomscrolling, fear and dread: Away from frontlines, India-Pak tensions take toll on mental health",
    "description": "Rising India-Pakistan tensions have sparked widespread anxiety, even far from conflict zones. From children fearing war to adults obsessively doomscrolling, psychological stress is mounting. Mental health experts urge balanced media consumption, emotional sup…",
    "link": "https://economictimes.indiatimes.com/tech/technology/doomscrolling-fear-and-dread-away-from-frontlines-india-pak-tensions-take-toll-on-mental-health/articleshow/121076230.cms",
    "timestamp": "2025-05-11T08:49:25Z"
  },
  {
    "title": "Report: Trump to meet Mahmoud Abbas in Saudi Arabia",
    "description": "Arabic media reports that at the request of MBS, Trump will meet the PA chairman and Syrian president this week.  MBS reportedly seeks US approval for a Palestinian state.",
    "link": "https://www.israelnationalnews.com/news/408152",
    "timestamp": "2025-05-11T08:46:58Z"
  },
  {
    "title": "Trump offered to mediate on Kashmir even in his first term, India turned him down: Former National Security Advisory Board member",
    "description": "Tensions rose between India and Pakistan after Operation Sindoor. India retaliated for the Pahalgam attack by targeting terror infrastructures. US President Trump offered mediation, but India declined. Now, India and Pakistan have reached an understanding. Bo…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-offered-to-mediate-on-kashmir-even-in-his-first-term-india-turned-him-down-former-national-security-advisory-board-member/articleshow/121076093.cms",
    "timestamp": "2025-05-11T08:44:38Z"
  },
  {
    "title": "\"Ceasefire First Announced By US President\": Rahul Gandhi Writes To PM",
    "description": "A day after the Centre announced a ceasefire pact with Pakistan, Leader of the Opposition in Lok Sabha Rahul Gandhi has written to Prime Minister Narendra Modi, requesting him to call a special session of Parliament",
    "link": "https://www.ndtv.com/india-news/india-pakistan-ceasefire-operation-sindoor-ceasefire-first-announced-by-us-president-rahul-gandhi-writes-to-pm-8386210",
    "timestamp": "2025-05-11T08:42:42Z"
  },
  {
    "title": "Trump gets compared to Lincoln by Fox News",
    "description": "Donald Trump likened his initial days as president to those of Abraham Lincoln. This comparison follows praise from a Fox News host. Trump shared this on Truth Social. His approval ratings are historically low. Trade talks between the US and China are ongoing…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-gets-compared-to-lincoln-by-fox-news/articleshow/121075987.cms",
    "timestamp": "2025-05-11T08:41:59Z"
  },
  {
    "title": "Is Robert Francis Prevost the most progressive Pope? His views on Trump's policies spark debate",
    "description": "Cardinal Robert Francis Prevost's election as Pope Leo XIV marks a historic moment as the first American to lead the Catholic Church. His past social media activity reveals a critical stance on Trump's immigration policies, aligning him with Pope Francis on i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-is-robert-francis-prevost-pope-leo-xiv-the-most-progressive-pope-his-views-on-trumps-policies-spark-debate/articleshow/121075824.cms",
    "timestamp": "2025-05-11T08:37:08Z"
  },
  {
    "title": "Move over, Modelo: Trump is crowning a new king of beers",
    "description": "Modelo, Michelob Ultra, and Bud Light are battling to be America's top beer. Trump's politics could throw the fight into chaos.",
    "link": "https://www.businessinsider.com/bud-light-modelo-michelob-ultra-beer-tariffs-immigration-trump-2025-5",
    "timestamp": "2025-05-11T08:36:02Z"
  },
  {
    "title": "India's Modi holds high-level talks amid Pakistan ceasefire",
    "description": "A fragile ceasefire between India and Pakistan appears to be holding, despite violation allegations. US President Trump has praised both countries and said trade would be ramped up with the neighboing states. Follow DW.",
    "link": "https://www.dw.com/en/indias-modi-holds-high-level-talks-amid-pakistan-ceasefire/live-72503987",
    "timestamp": "2025-05-11T08:36:00Z"
  },
  {
    "title": "US could face default by August – Treasury chief",
    "description": "Scott Bessent has urged Congress to raise or suspend the debt limit to prevent the nation from defaulting on its obligations Read Full Article at RT.com",
    "link": "https://www.rt.com/business/617364-us-debt-default-august/",
    "timestamp": "2025-05-11T08:26:00Z"
  },
  {
    "title": "Trump vows to increase trade with India, Pakistan after praising ceasefire agreement: 'A job well done!'",
    "description": "U.S. President Donald Trump promised to increase trade with India and Pakistan after the two nations agreed to a ceasefire to end the conflict with each other.",
    "link": "https://www.foxnews.com/world/trump-vows-increase-trade-india-pakistan-after-praising-ceasefire-agreement-a-job-well-done",
    "timestamp": "2025-05-11T08:22:25Z"
  },
  {
    "title": "Trump predicts 'big week' in Russia-Ukraine peace talks",
    "description": "President Donald Trump suggested imminent progress in peace talks between Russia and Ukraine in a post to Truth Social early on Sunday.",
    "link": "https://abcnews.go.com/International/trump-predicts-big-week-russia-ukraine-peace-talks/story?id=121682836",
    "timestamp": "2025-05-11T08:20:49Z"
  },
  {
    "title": "Sharaa cements Syria-Bahrain ties with trip to Manama",
    "description": "Bahrain is important because it is a close ally of the West, hosts a US naval base, and is also part of the Abraham Accords.",
    "link": "https://www.jpost.com/middle-east/article-853490",
    "timestamp": "2025-05-11T08:19:26Z"
  },
  {
    "title": "SNL fans ‘gasp’ as Cecily Strong makes surprise return as Jeanine Pirro in cold open",
    "description": "Strong left as a full-time cast member in 2022",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/snl-cecily-strong-jeannie-pirro-b2748692.html",
    "timestamp": "2025-05-11T08:18:42Z"
  }
]