[
  {
    "title": "Canada scrambles to strike a deal as Ontario trade envoy races to stop Trump tariffs before G7 summit",
    "description": "Despite escalating trade tensions and recent tariff hikes, Ontario's trade representative remains optimistic about resolving disputes with the U.S. He emphasizes proactive engagement with Republican lawmakers and highlights Canada's importance as a key tradin…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canada-scrambles-to-strike-a-deal-as-ontario-trade-envoy-races-to-stop-trump-tariffs-before-g7-summit/articleshow/121556200.cms",
    "timestamp": "2025-06-01T20:37:27Z"
  },
  {
    "title": "Virginia House Republicans pick Del. Terry Kilgore as new leader",
    "description": "The chamber's prior GOP leader, former House Speaker Todd Gilbert, R-Shenandoah, is a candidate to become the next U.S. attorney for the Western District of Virginia.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_c8f14c99-fe2b-41ad-8102-485a8425fad6.html",
    "timestamp": "2025-06-01T20:37:00Z"
  },
  {
    "title": "'Catastrophic': Trump is now going after 'the best idea we ever had'",
    "description": "President Donald Trump’s push to slash federal spending could have devastating consequences for America’s national parks, with proposed budget cuts threatening to gut the Park Service and dismantle protections for the country’s most treasured landscapes, the …",
    "link": "https://www.rawstory.com/catastrophic-trump-is-now-going-after-the-best-idea-we-ever-had/",
    "timestamp": "2025-06-01T20:31:06Z"
  },
  {
    "title": "After Todd And Julie Chrisley Were Pardoned, A Presidential Official Shared Some Advice For Them: ‘I Know That They’re Anxious To Get Out Here’",
    "description": "The Chrisleys are no longer behind bars.",
    "link": "https://www.cinemablend.com/television/after-todd-julie-chrisley-were-pardoned-presidential-official-shared-advice-for-them",
    "timestamp": "2025-06-01T20:19:24Z"
  },
  {
    "title": "Justice Department’s New White Collar Crime Priorities",
    "description": "The Justice Department issued its new policies for white collar crime which appear  to deprioritize enforcement of important white collar crime laws",
    "link": "https://www.forbes.com/sites/steveweisman/2025/06/01/justice-departments-new-white-collar-crime-priorities/",
    "timestamp": "2025-06-01T20:18:26Z"
  },
  {
    "title": "Trump Treasury Chief Claps Back at Brennan: ‘YOU Said There’d Be Big Inflation – There Hasn’t Been’",
    "description": "Scott Bessent clapped back at Margaret Brennan on Sunday over inflation, as they each brought up comments made by the other in a previous Sunday morning battle.\nThe post Trump Treasury Chief Claps Back at Brennan: ‘YOU Said There’d Be Big Inflation – There Ha…",
    "link": "https://www.mediaite.com/media/tv/trump-treasury-chief-claps-back-at-brennan-you-said-thered-be-big-inflation-there-hasnt-been/",
    "timestamp": "2025-06-01T20:18:17Z"
  },
  {
    "title": "Mike Lindell Floats Bringing a MyPillow to His Dominion Trial After a Lawyer Called Them ‘Lumpy’",
    "description": "During an interview with Steve Bannon over the weekend, Lindell said one of Dominion's attorneys previously called his pillows \"lumpy.\"\nThe post Mike Lindell Floats Bringing a MyPillow to His Dominion Trial After a Lawyer Called Them ‘Lumpy’ first appeared on…",
    "link": "https://www.mediaite.com/media/news/mike-lindell-floats-bringing-a-mypillow-to-his-dominion-trial-after-a-lawyer-called-them-lumpy/",
    "timestamp": "2025-06-01T20:18:08Z"
  },
  {
    "title": "Trump 'flew too close to the sun' and unwittingly made a resistance 'hero': host",
    "description": "Donald Trump may have inadvertently created a resistance \"hero\" with his latest actions.That's the opinion of journalist Antonia Hylton, who co-hosts MSNBC's The Weekend: Primetime. On their show Saturday night, Hylton highlighted Trump's war against Harvard.…",
    "link": "https://www.rawstory.com/trump-flew-close-sun-hero/",
    "timestamp": "2025-06-01T20:15:11Z"
  },
  {
    "title": "Stephanopoulos Accuses Trump of ‘Staggering’ Corruption",
    "description": "George Stephanopoulos opened his Sunday show with a scathing accusation of corruption by Donald Trump and his family – just six months after ABC agreed to a $16 million payment to settle a defamation lawsuit",
    "link": "https://politicalwire.com/2025/06/01/stephanopoulos-accuses-trump-of-staggering-corruption/",
    "timestamp": "2025-06-01T20:13:14Z"
  },
  {
    "title": "Trump Celebrates 101 Years of the Border Patrol: 'Guardians of Our Sovereignty'",
    "description": "\"Every day, Border Patrol agents selflessly risk their lives to repel the flow of deadly drugs, weapons, criminals, and terrorists ...\"",
    "link": "https://www.westernjournal.com/trump-celebrates-101-years-border-patrol-guardians-sovereignty/",
    "timestamp": "2025-06-01T20:08:43Z"
  },
  {
    "title": "Todd Chrisley's Daughter Lindsie Shares Post About 'The Story of the Lord'",
    "description": "Lindsie Chrisley shared a subtle quote after her father, Todd Chrisley, was released from prison after receiving a presidential pardon. “See the story of the Lord unfolding,” an anonymous quote read, which Lindsie, 35, shared via her Instagram Story on Sunday…",
    "link": "https://www.usmagazine.com/celebrity-news/news/lindsie-chrisley-shares-spiritual-quote-after-todds-prison-release/#article",
    "timestamp": "2025-06-01T20:03:04Z"
  },
  {
    "title": "Variety report claims 'The Boys' and 'Handmaid's Tale' imaginary fascist worlds are becoming reality",
    "description": "Variety's Michael Schneider argued the imaginary fascist worlds of \"The Boys\" and \"The Handmaid's Tale\" are becoming reality in an article published by the outlet on Friday.",
    "link": "https://www.foxnews.com/media/variety-report-claims-the-boys-handmaids-tale-imaginary-fascist-worlds-becoming-reality",
    "timestamp": "2025-06-01T20:00:31Z"
  },
  {
    "title": "5 Years After the Floyd Riots, the Left’s Thirst for Political Violence Has Not Quenched",
    "description": "Five years after the death of George Floyd, the political Left is increasingly embracing violence as legitimate action, aided and abetted by soft-on-crime forces funded... Read More\nThe post 5 Years After the Floyd Riots, the Left’s Thirst for Political Viole…",
    "link": "https://www.dailysignal.com/2025/06/01/five-years-after-floyd-riots-lefts-thirst-for-political-violence-has-not-quenched/",
    "timestamp": "2025-06-01T20:00:00Z"
  },
  {
    "title": "Brewing tariff court battles won’t spike White House leverage in trade talks, Lutnick says - Politico",
    "description": "Brewing tariff court battles won’t spike White House leverage in trade talks, Lutnick saysPolitico Trump Administration: Latest News and Live UpdatesThe New York Times How a small wine company complicated Trump’s sweeping tariff plansThe Washington Post Will …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894545",
    "timestamp": "2025-06-01T19:55:02Z"
  },
  {
    "title": "50 Cent claims he will personally intervene with Trump to stop any pardon of Diddy",
    "description": "‘He said some really bad things about Trump,’ the rapper said of Diddy",
    "link": "https://www.the-independent.com/news/world/americas/crime/50-cent-diddy-trump-pardon-b2761630.html",
    "timestamp": "2025-06-01T19:52:00Z"
  },
  {
    "title": "Three years into his war on Ukraine, what does Putin really want?",
    "description": "President Trump wants to make a deal with Vladimir Putin to end the war in Ukraine. Putin says Russia wants to engage in peace talks, but Putin has also been ordering the most widespread and violent aerial attacks on Ukraine in years. This has led Trump to cr…",
    "link": "https://www.npr.org/2025/06/01/1253506257/three-years-into-his-war-on-ukraine-what-does-putin-really-want",
    "timestamp": "2025-06-01T19:50:36Z"
  },
  {
    "title": "Jeffries, Hochul rage at Trump after Nadler’s aide nabbed by DHS agents: ‘Clearly trying to intimidate’",
    "description": "House Minority Leader Hakeem Jeffries accused the Trump administration of \"clearly trying to intimidate Democrats\" after federal agents handcuffed one of Rep. Jerry Nadler's aides in his Manhattan office.",
    "link": "https://nypost.com/2025/06/01/us-news/hakeem-jeffries-kathy-hochul-rage-at-trump-after-nadlers-aide-nabbed-by-dhs-agents-clearly-trying-to-intimidate/",
    "timestamp": "2025-06-01T19:50:30Z"
  },
  {
    "title": "Trump says courts threatening 'ruination of America' if they disagree with him",
    "description": "President Donald Trump warned that courts ruling against him could bring on the economic \"ruination of the United States.\"\n\nIn a Sunday post on his Truth Social platform, the president said that he did not expect the court to strip him of the power to impose …",
    "link": "https://www.rawstory.com/trump-ruination-of-america/",
    "timestamp": "2025-06-01T19:48:49Z"
  },
  {
    "title": "'I'm over knife attack,' says Salman Rushdie",
    "description": "The literary giant spoke at the Hay Festival about getting back to fiction and free speech.",
    "link": "https://www.bbc.com/news/articles/c98pwpdj7kyo",
    "timestamp": "2025-06-01T19:47:06Z"
  },
  {
    "title": "Liberal candidate Trzaskowski leads in Polish presidential elections runoff",
    "description": "Liberal candidate Rafal Trzaskowski is leading with 50.3 percent in the Polish presidential elections, early exit polls showed Sunday night.",
    "link": "https://www.hurriyetdailynews.com/liberal-candidate-trzaskowski-leads-in-polish-presidential-elections-runoff-209824",
    "timestamp": "2025-06-01T19:47:00Z"
  },
  {
    "title": "Elon Musk says he doesn't 'want to take responsibility for everything the administration’s doing'",
    "description": "President Donald Trump lauded billionaire Elon Musk on Friday as the Tesla CEO wrapped up his time in government service after four turbulent months leading the so-called Department of Government Efficiency (DOGE).\n\"This will be his last day, but not really, …",
    "link": "https://biztoc.com/x/88ead1d205aa5c83",
    "timestamp": "2025-06-01T19:44:48Z"
  },
  {
    "title": "Jacinda Ardern’s memoir and the untold stories from her time as Prime Minister",
    "description": "A Different Kind of Power tells the personal challenges behind her public, political face.",
    "link": "https://www.nzherald.co.nz/lifestyle/jacinda-arderns-memoir-and-the-untold-stories-from-her-time-as-prime-minister/JAXKH52ZNFHW7LUC3MZAK4Z574/",
    "timestamp": "2025-06-01T19:43:17Z"
  },
  {
    "title": "Fake News: CNN, BBC Ran Unverified Claims Israel Killed Palestinians at Aid Site",
    "description": "CNN and the BBC ran with fake news, pushed by Hamas, that claimed Sunday that dozens of Palestinians were killed at a U.S.-backed humanitarian aid site in Gaza, according to evidence released later in the day.\nThe post Fake News: CNN, BBC Ran Unverified Claim…",
    "link": "https://www.breitbart.com/middle-east/2025/06/01/fake-news-cnn-bbc-ran-unverified-claims-israel-killed-palestinians-at-aid-site/",
    "timestamp": "2025-06-01T19:43:02Z"
  },
  {
    "title": "After trip to Ukraine, U.S. senators warn Putin is preparing new offensive",
    "description": "Republican Sen. Lindsey Graham and Democratic Sen. Richard Blumenthal spoke to The Associated Press in Paris after meeting President Volodymyr Zelenskyy and touring neighborhoods shattered by what they called the worst Russian bombardments since the full-scal…",
    "link": "https://www.pbs.org/newshour/politics/after-trip-to-ukraine-u-s-senators-warn-putin-is-preparing-new-offensive",
    "timestamp": "2025-06-01T19:39:21Z"
  },
  {
    "title": "Elon Musk says he doesn't 'want to take responsibility for everything the administration’s doing'",
    "description": "\"I was disappointed to see the massive spending bill,\" Elon Musk said on CBS's \"Sunday Morning.\"",
    "link": "https://www.cnbc.com/2025/06/01/musk-says-doesnt-want-responsibility-for-all-trump-policies.html",
    "timestamp": "2025-06-01T19:35:52Z"
  },
  {
    "title": "Can President Donald Trump fix the national debt? Republican senators, many investors and even Elon Musk have doubts",
    "description": "WASHINGTON — President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package.\nThe response so far from…",
    "link": "https://biztoc.com/x/babc5c8cfd32ab6c",
    "timestamp": "2025-06-01T19:33:37Z"
  },
  {
    "title": "Musk talks about Trump administration in CBS interview — despite asking to avoid the subject - The Hill",
    "description": "Musk talks about Trump administration in CBS interview — despite asking to avoid the subjectThe Hill Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\"CBS News Brooks and Capehart on Elon Musk’s impact…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894411",
    "timestamp": "2025-06-01T19:32:47Z"
  },
  {
    "title": "Steelers legend Rocky Bleier names US President Donald Trump an 'honorary Steeler'",
    "description": "Steelers legend Rocky Bleier attended President Donald Trump's rally and named him an 'honorary Steeler'",
    "link": "https://steelerswire.usatoday.com/story/sports/nfl/steelers/2025/06/01/steelers-donald-trump-honorary-rocky-bleier/83979590007/",
    "timestamp": "2025-06-01T19:29:48Z"
  },
  {
    "title": "Trump Could Reportedly Settle ‘Thousands’ of White South Africans Within Months",
    "description": "Critics of the White House accepting people fleeing South Africa have accused Trump of letting them cut in line due to the color of their skin.\nThe post Trump Could Reportedly Settle ‘Thousands’ of White South Africans Within Months first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-could-reportedly-settle-thousands-of-white-south-africans-within-months/",
    "timestamp": "2025-06-01T19:29:07Z"
  },
  {
    "title": "Bill Maher Praises Trump Harvard Policy: It's an 'Asshole Factory'",
    "description": "HBO host Bill Maher is backing President Donald Trump's intense scrutiny on Harvard University.\nThe post Bill Maher Praises Trump Harvard Policy: It’s an ‘Asshole Factory’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/06/01/bill-maher-praises-trump-harvard-policy-its-an-asshole-factory/",
    "timestamp": "2025-06-01T19:24:24Z"
  },
  {
    "title": "China Knocks Hegseth's 'Cold War Mentality' After He Calls The Country A Threat",
    "description": "China's foreign ministry claimed the defense secretary has \"deliberately ignored the call for peace and development by countries in the region.\"",
    "link": "https://www.huffpost.com/entry/china-pete-hegseth-cold-war-mentality_n_683ca643e4b0cceca406d18f",
    "timestamp": "2025-06-01T19:23:39Z"
  },
  {
    "title": "Poland: Karol Nawrocki expected to win presidential vote",
    "description": "Conservative Karol Nawrocki, who was backed by US President Donald Trump, won a narrow victory over his pro-EU rival according to Polish media, delivering a blow to Prime Minister Donald Tusk's government. DW has more Poles were choosing between Warsaw's pro-…",
    "link": "https://www.dw.com/en/poland-conservative-karol-nawrocki-wins-presidential-vote/live-72747255",
    "timestamp": "2025-06-01T19:23:00Z"
  },
  {
    "title": "Poland: Vote too close to call, Trzaskowski claims victory",
    "description": "Liberal Rafal Trzaskowski claimed victory after the runoff round in Poland, but exit polls indicate the race is still neck-and-neck. DW has the latest.",
    "link": "https://www.dw.com/en/poland-vote-too-close-to-call-trzaskowski-claims-victory/live-72747255",
    "timestamp": "2025-06-01T19:23:00Z"
  },
  {
    "title": "Chaos erupts as ICE raids office of top Democrat and detains staff",
    "description": "Chaotic scenes unfolded in lower Manhattan as federal agents stormed Democratic Rep. Jerry Nadler's office and handcuffed a female staffer in dramatic video footage. The 77-year-old longtime congressman erupted in fury after Department of Homeland Security of…",
    "link": "https://freerepublic.com/focus/f-chat/4320371/posts",
    "timestamp": "2025-06-01T19:22:06Z"
  },
  {
    "title": "Musk Fends Off Trump Questions in Tense Interview Exchange (Corbin Bolies/The Daily Beast)",
    "description": "Corbin Bolies / The Daily Beast:\nMusk Fends Off Trump Questions in Tense Interview Exchange  —  DONALD WHO?  —  The Tesla CEO bristled when asked about politics.  —  A CBS interview with Elon Musk went off the rails after he was asked about President Donald T…",
    "link": "https://www.memeorandum.com/250601/p57",
    "timestamp": "2025-06-01T19:20:00Z"
  },
  {
    "title": "'India needs to be watchful of any trade diversion risk due to steel tariff challenges'",
    "description": "Indian steel industry executives are concerned about potential trade diversion into the country following the US's decision to double tariffs on steel and aluminum imports. JSW Steel and AMNS India emphasize the need for proactive trade measures to protect th…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/steel/india-needs-to-be-watchful-of-any-trade-diversion-risk-due-to-steel-tariff-challenges/articleshow/121555665.cms",
    "timestamp": "2025-06-01T19:19:10Z"
  },
  {
    "title": "White House planning to replace NASA administrator nominee",
    "description": "The White House said on Saturday it would name a new nominee for NASA administrator, just days before billionaire Jared Isaacman, the current pick, was to face his planned Senate confirmation vote.",
    "link": "https://www.bostonherald.com/2025/06/01/white-house-planning-to-replace-nasa-administrator-nominee/",
    "timestamp": "2025-06-01T19:17:37Z"
  },
  {
    "title": "Trump's reason for dumping Elon Musk associate is falling apart: NYT",
    "description": "The reasons given by White House insiders on why Donald Trump withdrew the nomination of Elon Musk associate Jared Isaacman to head NASA are now being questioned.According to a report from the New York Times' Maggie Haberman and Ryan Mac, the dismissal of Isa…",
    "link": "https://www.rawstory.com/trump-musk-nasa-nyt/",
    "timestamp": "2025-06-01T19:15:38Z"
  },
  {
    "title": "Central Floridians still seeing higher grocery prices amid economic uncertainty",
    "description": "Central Floridians are still battling high prices when making their weekly grocery run. When it comes to cans and other metal-based packaging, it's possible the latest tariffs on steel and aluminum could impact grocery prices further.",
    "link": "https://www.clickorlando.com/news/local/2025/06/01/central-floridians-still-seeing-higher-grocery-prices-amid-economic-uncertainty/",
    "timestamp": "2025-06-01T19:15:17Z"
  },
  {
    "title": "Rand Paul says he would support 'big, beautiful bill' if debt ceiling hike removed",
    "description": "Sen. Rand Paul, R-Ky., said on Sunday that he would support President Donald Trump's \"big, beautiful bill\" if the debt ceiling hike was removed. Paul told CBS' \"Face the Nation\" host Margaret Brennan that he and three other Republican senators will hold out a…",
    "link": "https://freerepublic.com/focus/f-news/4320368/posts",
    "timestamp": "2025-06-01T19:15:10Z"
  },
  {
    "title": "Gov. Tim Walz calls on Democrats to be 'fierce' and 'bully the s-t' out of President Trump (Shane Galvin/New York Post)",
    "description": "Shane Galvin / New York Post:\nGov. Tim Walz calls on Democrats to be ‘fierce’ and ‘bully the s-t’ out of President Trump  —  Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s-t’ our of President Donald Trump during a speech i…",
    "link": "https://www.memeorandum.com/250601/p56",
    "timestamp": "2025-06-01T19:15:00Z"
  },
  {
    "title": "Can Trump Force Harvard to Improve? (Ben Sasse/Wall Street Journal)",
    "description": "Ben Sasse / Wall Street Journal:\nCan Trump Force Harvard to Improve?  —  Probably not.  But the president's supporters hope the example will cause leaders of other universities to get serious about reform.  —  Three outcomes are possible in Donald Trump's war…",
    "link": "https://www.memeorandum.com/250601/p55",
    "timestamp": "2025-06-01T19:10:01Z"
  },
  {
    "title": "Pro-EU candidate narrowly ahead of Trump-inspired rival in Poland's presidential election, exit poll shows",
    "description": "Liberal pro-EU candidate Rafal Trzaskowski appears set to narrowly win Poland's presidential election, according to an exit poll.",
    "link": "https://news.sky.com/story/pro-eu-candidate-narrowly-ahead-of-nationalist-rival-in-polands-presidential-election-exit-poll-shows-13377915",
    "timestamp": "2025-06-01T19:09:00Z"
  },
  {
    "title": "Trump-inspired candidate wins Poland's presidential election",
    "description": "Conservative historian Karol Nawrocki, who draws inspiration from Donald Trump, has won Poland's presidential election.",
    "link": "https://news.sky.com/story/trump-inspired-candidate-karol-nawrocki-wins-polands-presidential-election-13378011",
    "timestamp": "2025-06-01T19:09:00Z"
  },
  {
    "title": "European Proposal to Send Troops to Ukraine Allegedly ‘Almost Dead’",
    "description": "It appears that Western media are already recognizing that Europe is incapable of sending troops to the battlefield in Ukraine. In a recent article in the Financial Times (FT), diplomatic sources reported that the Franco-British plan to deploy troops to …\nThe…",
    "link": "https://www.globalresearch.ca/european-proposal-send-troops-ukraine-allegedly-dead/5889100",
    "timestamp": "2025-06-01T19:06:15Z"
  },
  {
    "title": "Polish election: Presidency too close to call as exit polls show neck-and-neck race",
    "description": "The outcome between liberal Warsaw mayor Rafał Trzaskowski and right-wing populist Karol Nawrocki is set to be razor-thin.",
    "link": "https://www.euractiv.com/section/politics/news/polish-election-presidency-too-close-to-call-as-exit-polls-show-neck-and-neck-race/",
    "timestamp": "2025-06-01T19:05:51Z"
  },
  {
    "title": "Biological Man Wins Two Titles In Women’s Track And Field Events As Trump Threatens To Cut Federal Funding",
    "description": "A transgender athlete in California took first place in the girls’ high and triple jump championship events Saturday, as Donald Trump threatened to cut funding.",
    "link": "https://dailycaller.com/2025/06/01/biological-male-wins-track-field-trump-california-womens-sports/",
    "timestamp": "2025-06-01T19:00:20Z"
  },
  {
    "title": "Tariffs and Turmoil Undermine Trump's Oil and Gas Promises",
    "description": "When U.S. President Donald Trump came into office in January, he promised to back greater oil and gas production, doubling down on his “drill, baby, drill” catch phrase. He rapidly introduced executive orders aimed at encouraging new oil and gas exploration a…",
    "link": "https://oilprice.com/Energy/Energy-General/Tariffs-and-Turmoil-Undermine-Trumps-Oil-and-Gas-Promises.html",
    "timestamp": "2025-06-01T19:00:00Z"
  },
  {
    "title": "US Tariff Impact: Prices Surge At Walmart And Target, Employees Say—Some Jumps Top 38%",
    "description": "The tariffs imposed by President Donald Trump are reportedly leading to significant price increases at Walmart Inc. (NYSE:WMT) and Target Corporation (NYSE:TGT) stores across the U.S.\nWhat Happened: The Walmart employees have been sharing images on Reddit tha…",
    "link": "https://biztoc.com/x/f7d0141fe620cc2f",
    "timestamp": "2025-06-01T18:59:43Z"
  },
  {
    "title": "There's a 'nasty' new nickname for Trump, but it gets something wrong",
    "description": "Donald Trump's team is fighting one of the most consequential legal cases in the US history, but there are plenty more where that came from: 250 lawsuits are currently featuring his administration.",
    "link": "https://www.abc.net.au/news/2025-06-02/donald-trump-unitary-executive-theory/105362150",
    "timestamp": "2025-06-01T18:57:06Z"
  },
  {
    "title": "Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\" - CBS News",
    "description": "Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\"CBS News Elon Musk says he’s caught between supporting and opposing Donald Trump: ‘Creates a bone of contention’Mint Musk’s departure marks new chapter…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894075",
    "timestamp": "2025-06-01T18:52:46Z"
  },
  {
    "title": "Trump, Xi to talk this week about trade, key advisor says - Axios",
    "description": "Trump, Xi to talk this week about trade, key advisor saysAxios Trump, Xi likely to speak soon on minerals trade dispute, aides sayReuters Hassett: Trump will have 'a wonderful conversation' this week with XiABC News Signs of thawing? US-China trade war may ea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894073",
    "timestamp": "2025-06-01T18:52:36Z"
  },
  {
    "title": "‘Wildly Inappropriate!’ Fox’s Howard Kurtz Destroys Scott Pelley’s Viral Anti-Trump Commencement Speech — Suggests it Shows CBS is ‘Incredibly Biased’",
    "description": "Fox's Howard Kurtz went after 60 Minutes correspondent Scott Pelley for his viral commencement speech at Wake Forest — which took aim at President Trump.\nThe post ‘Wildly Inappropriate!’ Fox’s Howard Kurtz Destroys Scott Pelley’s Viral Anti-Trump Commencement…",
    "link": "https://www.mediaite.com/media/wildly-inappropriate-foxs-howard-kurtz-destroys-scott-pelleys-viral-anti-trump-commencement-speech-suggests-it-shows-cbs-is-incredibly-biased/",
    "timestamp": "2025-06-01T18:52:29Z"
  },
  {
    "title": "Ukraine destroys dozens of Russian warplanes with drone attack deep inside Russia",
    "description": "Ukrainian forces target 5 airfields deep inside Russia, striking 40 aircraft including bombers and reconnaissance planes Ukrainian forces destroyed dozens of Russian warplanes with a drone attack on air bases deep within Russian territory on Sunday. Ukrainian…",
    "link": "https://freerepublic.com/focus/f-news/4320360/posts",
    "timestamp": "2025-06-01T18:51:04Z"
  },
  {
    "title": "50 Cent Pledges to Prevent a Trump Pardon for Diddy: ‘I’m Gonna Reach Out’",
    "description": "\"Donald doesn’t take well to disrespect, and doesn’t forget who chooses to go against him,\" 50 Cent says of pre-verdict maneuvering",
    "link": "http://www.rollingstone.com/music/music-news/50-cent-pledges-prevent-trump-pardon-diddy-1235352202/",
    "timestamp": "2025-06-01T18:48:13Z"
  },
  {
    "title": "Ukraine's drone attack in Russia shows Kyiv felt it had nothing to lose",
    "description": "An audacious Ukrainian drone attack against multiple airbases across Russia is a humiliating security breach for Vladimir Putin that will doubtless trigger a furious response.",
    "link": "https://news.sky.com/story/ukraines-drone-attack-in-russia-shows-kyiv-felt-it-had-nothing-to-lose-13377952",
    "timestamp": "2025-06-01T18:42:00Z"
  },
  {
    "title": "Supreme Court helping Trump undo one of Biden’s most egregious migrant moves",
    "description": "If the Supreme Court does not once and for all put the kibosh on categorical parole programs, the next Biden, the next Mayorkas, could institute a program on steroids, rolling out the red carpet for pretty much any and every person around the world not alread…",
    "link": "https://nypost.com/2025/06/01/opinion/supreme-court-helping-trump-undo-one-of-bidens-most-egregious-migrant-moves/",
    "timestamp": "2025-06-01T18:36:20Z"
  },
  {
    "title": "Trump Remedies to Harvard's Ills Should Respect Free Speech",
    "description": "In its multi-pronged efforts to pressure Harvard to live up to its self-proclaimed mission to seek and transmit knowledge and pursue the truth, the Trump administration seems to be of two minds on...",
    "link": "https://www.realclearpolitics.com/articles/2025/06/01/trump_remedies_to_harvards_ills_should_respect_free_speech_152862.html",
    "timestamp": "2025-06-01T18:34:37Z"
  },
  {
    "title": "In using cheap drones to take out prized Russian bombers, Ukraine sends a defiant message",
    "description": "Ukraine's brazen attack on Russian airfields overnight sent a strong message ahead of peace talks. It also delivered a warning about the vulnerability of strategic assets against cheap and plentiful drones.",
    "link": "https://www.cbc.ca/news/world/ukraine-drone-attack-russia-aircraft-1.7549684",
    "timestamp": "2025-06-01T18:33:26Z"
  },
  {
    "title": "Trump and Xi Expected to Talk Trade Next Week Amid Rising Tensions",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump and Chinese President Xi Jinping are expected to have a conversation about trade in the coming week, White House National Economic Council Director Kevin Hassett said on Sunday.",
    "link": "https://sputnikglobe.com/20250601/trump-xi-expected-to-talk-trade-next-week---white-house-1122167804.html",
    "timestamp": "2025-06-01T18:28:39Z"
  },
  {
    "title": "Trump advisers defend tariffs amid legal fight, insisting they're 'not going away'",
    "description": "President Donald Trump's top economic advisers maintained confidence on Sunday that the \"tariffs are not going away,\" as a key tenet of Trump's policy agenda hangs in legal limbo.\n\"Rest assured, tariffs are not going away,\" Commerce Secretary Howard Lutnick s…",
    "link": "https://biztoc.com/x/de2748323269adb4",
    "timestamp": "2025-06-01T18:27:03Z"
  },
  {
    "title": "Rand Paul says he would support 'big, beautiful bill' if debt ceiling hike removed",
    "description": "Sen. Rand Paul from Kentucky said on Sunday that he and three other Republicans are set to vote against President Donald Trump's \"big, beautiful bill.\"",
    "link": "https://www.foxnews.com/politics/rand-paul-says-he-would-support-big-beautiful-bill-debt-ceiling-hike-removed",
    "timestamp": "2025-06-01T18:21:55Z"
  },
  {
    "title": "Graham Aims for Tough New Russia Sanctions Ahead of G-7 Summit",
    "description": "Republican Senator Lindsey Graham, a close ally of President Donald Trump, said he aims to have new sanctions imposed on Russia before the Group of Seven summit in late June.",
    "link": "https://financialpost.com/pmn/business-pmn/graham-aims-for-tough-new-russia-sanctions-ahead-of-g-7-summit",
    "timestamp": "2025-06-01T18:21:50Z"
  },
  {
    "title": "Trump advisers defend tariffs amid legal fight, insisting they're 'not going away'",
    "description": "The looming legal fight injects uncertainty into President Donald Trump's evolving tariffs plan, which has upended the global economy since April 2.",
    "link": "https://www.cnbc.com/2025/06/01/trump-tariffs-legal-fight-.html",
    "timestamp": "2025-06-01T18:19:44Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" June 1, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Treasury Secretary Scott Bessent and Sen. Rand Paul join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-06-01-2025/",
    "timestamp": "2025-06-01T18:18:31Z"
  },
  {
    "title": "Commerce secretary says ‘tariffs are not going away’ as Trump’s trade plans face legal battles",
    "description": "Commerce Secretary Howard Lutnick said Sunday that “tariffs are not going away” after a US appeals court paused a block on many of the Trump administration’s...",
    "link": "https://www.cnn.com/2025/06/01/business/trump-tariffs-lutnick-bessent",
    "timestamp": "2025-06-01T18:18:02Z"
  },
  {
    "title": "Elon Musk Dodges Trump Questions... Before Diving Into His Own Gripes About Government",
    "description": "While Musk first refused to talk politics with \"CBS Sunday Morning,\" it didn't take him long to start airing his grievances.",
    "link": "https://www.huffpost.com/entry/elon-musk-government-criticism-deflects-doge-responsibility_n_683c74c8e4b06a21c073e4ac",
    "timestamp": "2025-06-01T18:06:11Z"
  },
  {
    "title": "Russia and Ukraine step up the war on eve of peace talks",
    "description": "KYIV: On the eve of peace talks, Ukraine and Russia sharply ramped up the war with one of the biggest drone battles of their conflict, a Russian highway bridge blown up over a passenger t",
    "link": "https://www.channelnewsasia.com/world/russia-and-ukraine-step-up-war-eve-peace-talks-5162001",
    "timestamp": "2025-06-01T18:06:07Z"
  },
  {
    "title": "Prime Minister Mark Carney names former United Nations ambassador as chief of staff",
    "description": "Prime Minister Mark Carney has named Marc-André Blanchard, Canada's former ambassador to the United Nations, as his chief of staff.",
    "link": "https://nationalpost.com/news/politics/mark-carney-chief-of-staff-marc-andre-blanchard",
    "timestamp": "2025-06-01T18:05:05Z"
  },
  {
    "title": "Forget tacos, can Trump have his tariff cake and eat it too? Wall Street’s biggest bull thinks so",
    "description": "If President Donald Trump’s tariffs settle around 10%, that could still allow the Federal Reserve to cut rates later this year while they generate revenue that helps with the massive budget deficit, according to Wells Fargo’s Christopher Harvey, who thinks a …",
    "link": "https://biztoc.com/x/6e3e6570f0176e53",
    "timestamp": "2025-06-01T18:04:42Z"
  },
  {
    "title": "Ukraine destroys dozens of Russian warplanes with drone attack deep inside Russia",
    "description": "Ukrainian drones destroyed 40 Russian aircraft in a strategic attack on airfields. The operation was a year in the making, led by President Volodymyr Zelenskyy.",
    "link": "https://www.foxnews.com/world/ukraine-destroys-dozens-russian-warplanes-drone-attack-deep-inside-russia",
    "timestamp": "2025-06-01T18:02:51Z"
  },
  {
    "title": "US asks Australia to increase defense spending to 3.5% of GDP",
    "description": "U.S. Defense Secretary Pete Hegseth asked Australia to increase its defense spending to 3.5% of gross domestic product during a meeting with Australian...",
    "link": "https://www.yahoo.com/news/us-asks-australia-increase-defense-180207996.html",
    "timestamp": "2025-06-01T18:02:07Z"
  },
  {
    "title": "Boston Marathoner Kicked Off Team for Speaking Out About Transgender Issue",
    "description": "New mom and marathoner Natalie Daniels was booted from her running club for saying that people who identify as transgender should not compete against biological... Read More\nThe post Boston Marathoner Kicked Off Team for Speaking Out About Transgender Issue a…",
    "link": "https://www.dailysignal.com/2025/06/01/boston-marathoner-kicked-team-speaking-transgender-issue/",
    "timestamp": "2025-06-01T18:01:00Z"
  },
  {
    "title": "Harvard commencement speaker decries Trump administration's 'draconian government measures'",
    "description": "Stanford professor Abraham Verghese attacked the Trump administration during his speech to Harvard graduates, calling the university's defense of its values \"courageous.\"",
    "link": "https://www.foxnews.com/media/harvard-commencement-speaker-decries-trump-administrations-draconian-government-measures",
    "timestamp": "2025-06-01T18:00:52Z"
  },
  {
    "title": "Todd Chrisley claims he was treated differently than Black inmates in prison",
    "description": "Todd Chrisley called out the \"injustices\" that go on at FPC Pensacola in Florida.",
    "link": "https://nypost.com/2025/06/01/entertainment/todd-chrisley-says-he-got-better-prison-treatment-than-black-inmates/",
    "timestamp": "2025-06-01T17:58:46Z"
  },
  {
    "title": "On eve of peace talks, Russia and Ukraine ramp up cross-border attacks",
    "description": "On the eve of peace talks, Ukraine and Russia sharply stepped up the ongoing war with one of the biggest drone battles of the conflict and an ambitious attack carried out on nuclear-capable bombers deep in Siberia.",
    "link": "https://www.cbc.ca/news/world/russia-ukraine-drone-attack-peace-talks-1.7549401",
    "timestamp": "2025-06-01T17:56:53Z"
  },
  {
    "title": "Splurging: U.S military owns 100+ golf courses",
    "description": "One Army site alone costs $1 million a year to run",
    "link": "https://www.wnd.com/2025/06/splurging-u-s-military-owns-100-golf-courses/",
    "timestamp": "2025-06-01T17:56:52Z"
  },
  {
    "title": "The electromagnetic spectrum for Golden Dome to succeed",
    "description": "Progress leads to conflict between billions in tax benefits and national security",
    "link": "https://www.wnd.com/2025/06/the-electromagnetic-spectrum-for-golden-dome-to-succeed/",
    "timestamp": "2025-06-01T17:53:38Z"
  },
  {
    "title": "“They’re Behaving Like Fascists”: Rep. Jerry Nadler Denounces DHS After Aide Is Detained, Handcuffed",
    "description": "US Department of Homeland Security officers entered the New York Democrat's Manhattan office and accused staff of “harboring rioters.”",
    "link": "https://www.vanityfair.com/news/story/nadler-denounces-dhs-after-aide-is-detained-handcuffed",
    "timestamp": "2025-06-01T17:53:23Z"
  },
  {
    "title": "Trump, Xi likely to speak soon on minerals trade dispute, aides say - Reuters",
    "description": "Trump, Xi likely to speak soon on minerals trade dispute, aides sayReuters Treasury Secretary Scott Bessent \"confident\" U.S.-China trade details \"will be ironed out\" when Trump, Xi talkCBS News Hassett: Trump will have 'a wonderful conversation' this week wit…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177893745",
    "timestamp": "2025-06-01T17:52:27Z"
  },
  {
    "title": "Can India navigate the challenges of US relations under Trump's leadership?",
    "description": "Despite Donald Trump's potential disruptions, India and the US are actively strengthening their strategic partnership. Recent high-level dialogues in Washington covered diverse areas like technology, security, and trade, setting ambitious goals for future col…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/can-india-navigate-the-challenges-of-us-relations-under-trumps-leadership/articleshow/121553891.cms",
    "timestamp": "2025-06-01T17:50:49Z"
  },
  {
    "title": "Fla. Sen. Rick Scott calls for more budget cuts to restore ‘fiscal sanity’ into Trump’s ‘big, beautiful’ bill",
    "description": "The pol said he and other Senate Republicans will work with the president and House GOPers to remove bloat and confront the debt bomb in a final spending bill.",
    "link": "https://nypost.com/2025/06/01/us-news/sen-rick-scott-more-budget-cuts-needed-to-restore-sanity-to-trumps-big-beautiful-bill/",
    "timestamp": "2025-06-01T17:50:24Z"
  },
  {
    "title": "Christie: Trump Is Ignoring Guardrails, Pardoning Political Corruption",
    "description": "Sunday on ABC’s “This Week,” former Gov. Chris Christie (R-NJ) said President Donald Trump was ignoring the “guardrails” of the presidency by pardoning supporters convicted of political corruption and white-collar crime. Christie said, “I think his view of th…",
    "link": "https://freerepublic.com/focus/f-news/4320353/posts",
    "timestamp": "2025-06-01T17:48:47Z"
  },
  {
    "title": "50 Cent vows to dissuade Trump from potential Diddy pardon",
    "description": "\"He said some really bad things about Trump, it’s not ok. I’m gonna reach out so he knows how I feel about this guy,” the “In Da Club” rapper wrote.",
    "link": "https://nypost.com/2025/06/01/us-news/50-cent-vows-to-dissuade-trump-from-potential-diddy-pardon/",
    "timestamp": "2025-06-01T17:48:09Z"
  },
  {
    "title": "Trump Spews Out Bizarre Conspiracy Theory That Biden Was ‘Executed’ In 2020 And Replaced By Clones",
    "description": "The conspiracy theory seemed to claim that the country had been run by \"clones doubles & robotic engineered soulless mindless entities\" during Biden’s entire term.",
    "link": "https://www.huffpost.com/entry/donald-trump-joe-biden-executed-clones-conspiracy-theory_n_683c6fd4e4b08af1a43d0610",
    "timestamp": "2025-06-01T17:47:29Z"
  },
  {
    "title": "ABC’s Stephanopoulos: Scale of Trump’s Personal Moneymaking ‘Staggering’",
    "description": "Sunday on ABC’s “This Week,” host George Stephanopoulos said the scale of President Donald Trump’s personal “moneymaking” was staggering. Stephanopoulos said, “The scale is staggering. President Trump and his family are making hundreds of millions, potentiall…",
    "link": "https://freerepublic.com/focus/f-news/4320352/posts",
    "timestamp": "2025-06-01T17:44:22Z"
  },
  {
    "title": "George Stephanopoulos, Unfazed by $16 Million ABC Settlement, Accuses Trump of Corruption: ‘Scale Is Staggering’ | Video",
    "description": "ABC News agreed to pay Trump a $16 million defamation settlement in December – so you can bet they carefully fact-checked this bombshell\nThe post George Stephanopoulos, Unfazed by $16 Million ABC Settlement, Accuses Trump of Corruption: ‘Scale Is Staggering’ …",
    "link": "https://www.thewrap.com/george-stephanopoulos-unfazed-by-16-million-abc-settlement-accuses-trump-of-corruption-scale-is-staggering-video/",
    "timestamp": "2025-06-01T17:43:54Z"
  },
  {
    "title": "Booker slammed for alleged 'Nazi salute' to Cali Dems just months after Musk was dragged for same gesture",
    "description": "Conservatives criticized Sen. Cory Booker for an alleged \"Nazi salute\" at a California Democratic Party event, questioning media coverage of Elon Musk's similar gesture in January.",
    "link": "https://www.foxnews.com/politics/conservatives-drag-booker-nazi-salute-cali-dems-after-liberal-meltdown-musk-gestured-like-nazi",
    "timestamp": "2025-06-01T17:38:15Z"
  },
  {
    "title": "Trump’s tariffs might be the green policy nobody saw coming",
    "description": "'In reality, the president’s policies carry significant and underappreciated environmental benefits'",
    "link": "https://www.wnd.com/2025/06/trumps-tariffs-might-be-the-green-policy-nobody-saw-coming/",
    "timestamp": "2025-06-01T17:36:13Z"
  },
  {
    "title": "Honey Boo Boo Says Julie Chrisley Looks 'Older' With 'Jailhouse Dye Job'",
    "description": "Alana ‘Honey Boo Boo’ Thompson is sharing her unfiltered thoughts on Julie Chrisley’s appearance following her presidential pardon and release from prison. “She looks, I mean, she’s been in jail for two years,” Thompson, 19, said in a Saturday, May 31, interv…",
    "link": "https://www.usmagazine.com/celebrity-news/news/honey-boo-boo-says-julie-chrisley-looks-older-after-prison/#article",
    "timestamp": "2025-06-01T17:34:49Z"
  },
  {
    "title": "Lindsey Graham Threatens China With 500% Tariff If It Continues Buying 'Cheap Russian Oil' to 'Fuel Putin's War Machine'",
    "description": "US Senators Lindsey Graham and Richard Blumenthal are proposing a bill that would impose a 500% tariff on any country that does business with Russia, including China.",
    "link": "https://www.ibtimes.com/lindsey-graham-threatens-china-500-percent-tariff-continues-buying-cheap-russian-oil-3775015",
    "timestamp": "2025-06-01T17:33:57Z"
  },
  {
    "title": "Space Florida eyes merging of US operations at Cape Canaveral",
    "description": "Space Florida is launching a study about how NASA and U.S. Space Force operations could be merged at Cape Canaveral",
    "link": "https://www.wftv.com/news/local/space-florida-eyes-merging-us-operations-cape-canaveral/L6GWOFTE6ZEQTIZLVDJYDHL47A/",
    "timestamp": "2025-06-01T17:30:38Z"
  },
  {
    "title": "$31M In Bitcoin Floods In For Silk Road Founder Ross Ulbricht As Support Grows",
    "description": "Ross Ulbricht has received a massive gift from the crypto world. He was pardoned earlier this year and, within hours, 300 Bitcoins—worth about $31.4 million—were sent to his donation wallet. Related Reading: US Sports Betting Platform To Raise $1 Billion For …",
    "link": "https://bitcoinist.com/31m-in-bitcoin-floods-in-for-silk-road-founder-ross-ulbricht-as-support-grows/",
    "timestamp": "2025-06-01T17:30:09Z"
  },
  {
    "title": "Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\" (David Pogue/CBS News)",
    "description": "David Pogue / CBS News:\nElon Musk on DOGE and why he doesn't want to “take responsibility for everything the administration's doing”  —  In the beginning, Donald Trump and Elon Musk got along great.  “He is a truly incredible guy,” Trump said at a campaign ra…",
    "link": "https://www.memeorandum.com/250601/p48",
    "timestamp": "2025-06-01T17:30:00Z"
  },
  {
    "title": "Trump's tariffs 'not going away' as deadline for deals loom, top adviser says",
    "description": "US and Chinese counterparts may speak this week about trade, Trump administration officials say.",
    "link": "https://www.bbc.com/news/articles/cd7g0v53227o",
    "timestamp": "2025-06-01T17:27:03Z"
  }
]