[
  {
    "title": "Russia creating an ‘impression of a ceasefire’ as attacks continue, Zelensky says",
    "description": "“As of Easter morning, we can say that the Russian army is trying to create a general impression of a ceasefire, but in some places, it does not abandon individual attempts to advance and inflict losses on Ukraine,” Zelensky said in a post on X.",
    "link": "https://nypost.com/2025/04/20/world-news/russia-creating-an-impression-of-a-ceasefire-as-attacks-continue-zelensky-says/",
    "timestamp": "2025-04-20T11:47:14Z"
  },
  {
    "title": "Democrats’ crises begin to play out in early Senate recruitment and first campaigns | CNN Politics",
    "description": "Democrats’ panic over what they stand for and whether they can credibly compete beyond the bluest states is already erupting in the rush to recruit Senate candidates across the country for next year — a desperate effort to dig out from years of losses that ha…",
    "link": "https://www.cnn.com/2025/04/20/politics/democrat-crisis-recruitment-campaigns/index.html",
    "timestamp": "2025-04-20T11:47:10Z"
  },
  {
    "title": "Bitcoin Braced For ‘Apocalyptic’ Price Shock After White House Confirms Fed Bombshell",
    "description": "The White House has confirmed Trump is exploring whether he can fire Federal Reserve chair Jerome Powell—something that could trigger an “apocalyptic scenario\" for markets...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/20/bitcoin-braced-for-apocalyptic-price-shock-after-white-house-confirms-fed-bombshell/",
    "timestamp": "2025-04-20T11:45:50Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "Welcome to Sunday, April 20, 2025 and it’s EASTERN. Here is a Jewish joke and some memes for you, both from Now That’s Wild: h/t: Matthew: He is risen. — Paul Bronks (@slendersherbet.bsky.social) 2025-04-20T08:52:43.438Z This is the best Easter post of them a…",
    "link": "https://whyevolutionistrue.com/2025/04/20/sunday-hili-dialogue-530/",
    "timestamp": "2025-04-20T11:45:02Z"
  },
  {
    "title": "Putin violating his own Easter truce, Zelenskyy says",
    "description": "The Ukrainian president reiterated offers for a month-long ceasefire.",
    "link": "https://www.politico.eu/article/putin-violating-easter-truce-zelenskyy-says/",
    "timestamp": "2025-04-20T11:43:35Z"
  },
  {
    "title": "From Messi to Trump, AI action figures are the rage",
    "description": "The figurines aren't real, but thanks to ChatGPT's new image generator they look genuine, and they are flooding platforms from TikTok to LinkedIn.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/from-messi-to-trump-ai-action-figures-are-the-rage/articleshow/120455046.cms",
    "timestamp": "2025-04-20T11:43:08Z"
  },
  {
    "title": "Whispers of a ‘Millionaire Tax’",
    "description": "A popular knock on this second Donald Trump term is that the president stocked his administration with nothing but saluting loyalists. Tell that to the staffers scheming to undercut his signature tax reform—by “managing” him into surrendering to the left’s fa…",
    "link": "https://freerepublic.com/focus/f-news/4312123/posts",
    "timestamp": "2025-04-20T11:40:59Z"
  },
  {
    "title": "Taxes on super rich and tech giants stall under Trump",
    "description": "Global tax plans targeting billionaires and multinational companies are running aground, with the United States torpedoing reforms under President Donald Trump.",
    "link": "https://www.enca.com/business/taxes-super-rich-and-tech-giants-stall-under-trump",
    "timestamp": "2025-04-20T11:39:42Z"
  },
  {
    "title": "Fresh anti-Trump protests hit many major US cities",
    "description": "Thousands of protesters marched on April 19 in New York and other cities across the United States for a second major round of demonstrations against Donald Trump and his hard-line policies.",
    "link": "https://www.hurriyetdailynews.com/fresh-anti-trump-protests-hit-many-major-us-cities-208276",
    "timestamp": "2025-04-20T11:38:08Z"
  },
  {
    "title": "In brief Easter appearance at Vatican, Pope Francis urges Gaza ceasefire",
    "description": "Pontiff had been increasingly vocal about Israel’s military campaign in Gaza before being hospitalised with pneumonia.",
    "link": "https://www.aljazeera.com/news/2025/4/20/in-brief-easter-appearance-at-vatican-pope-francis-urges-gaza-ceasefire",
    "timestamp": "2025-04-20T11:35:50Z"
  },
  {
    "title": "Mark Carney Unveils Plan to Trump-Proof Canada",
    "description": "“Liberal Leader Mark Carney released his election platform on Saturday, touting an emphasis on new military spending and bolstering Canada against Donald Trump’s expansionist vision,” Politico reports. Said Carney: “In this crisis we have to",
    "link": "https://politicalwire.com/2025/04/20/mark-carney-unveils-plan-to-trump-proof-canada/",
    "timestamp": "2025-04-20T11:34:00Z"
  },
  {
    "title": "Another round of anti-Trump protests hits US cities",
    "description": "Thousands of protesters rallied Saturday in New York, Washington and other cities across the United States for a second major round of demonstrations against Donald Trump and his hard-line policies.In New York, people gathered outside the city's main library …",
    "link": "https://www.rawstory.com/anti-trump-protests/",
    "timestamp": "2025-04-20T11:33:53Z"
  },
  {
    "title": "I founded an athleisure brand and voted for Trump 3 times. Here's why tariffs could be bad for business",
    "description": "Steven Borrelli, middle left, founded Cuts Clothing in 2016 and voted for Donald Trump three times. He told Business Insider that tariffs could be bad for businesses.\nCourtesy Cuts Clothing\nSteven Borrelli founded Cuts Clothing, an athleisure wear brand, in 2…",
    "link": "https://biztoc.com/x/9a043e2895d770cb",
    "timestamp": "2025-04-20T11:33:49Z"
  },
  {
    "title": "Everything you need to know about Iran-US nuclear negotiations",
    "description": "After 'constructive' high-level talks come 'technical discussions' to move the negotiations along.",
    "link": "https://www.aljazeera.com/features/2025/4/20/everything-you-need-to-know-about-iran-us-nuclear-negotiations",
    "timestamp": "2025-04-20T11:30:37Z"
  },
  {
    "title": "Ukrainian President Zelenskyy says Vladimir Putin has broken 'Easter truce' ceasefire promise",
    "description": "Volodymyr Zelenskyy said Russia is just trying to 'create a general impression of a ceasefire', while accusing Vladimir Putin of breaking the Easter truce.",
    "link": "https://www.ladbible.com/news/world-news/ukraine-russia-easter-ceasefire-zelenskyy-accuses-putin-breaking-truce-468318-20250420",
    "timestamp": "2025-04-20T11:30:12Z"
  },
  {
    "title": "I founded an athleisure brand and voted for Trump 3 times. Here's why tariffs could be bad for business.",
    "description": "Cuts Clothing founder Steven Borrelli says he supports President Trump's America First agenda. But he told BI that tariffs will hurt businesses.",
    "link": "https://www.businessinsider.com/cuts-clothing-founder-steven-borrelli-why-tariffs-hurt-my-business-2025-4",
    "timestamp": "2025-04-20T11:30:02Z"
  },
  {
    "title": "50501 Protesters Denounce Trump",
    "description": "“A national day of action against President Donald Trump and his administration has united an outpouring of protesters across the country who are rallying in defiance of what they describe as a relentless assault on",
    "link": "https://politicalwire.com/2025/04/20/50501-protesters-denounce-trump/",
    "timestamp": "2025-04-20T11:30:00Z"
  },
  {
    "title": "What If China Wins the Trade War?",
    "description": "The United States could still prevail if it does everything right. The problem is that the Trump administration is doing everything wrong.",
    "link": "https://www.theatlantic.com/economy/archive/2025/04/china-trump-trade-war/682524/",
    "timestamp": "2025-04-20T11:30:00Z"
  },
  {
    "title": "Analysts warn US could be handing chip market to China",
    "description": "As the Trump administration attempts to choke off exports of strategically important computer chips to China, experts say the effort might well backfire, fueling innovation at Chinese firms that could help them seize the world semiconductor market.\"What's act…",
    "link": "https://www.rawstory.com/chip-market-china/",
    "timestamp": "2025-04-20T11:26:16Z"
  },
  {
    "title": "Tariffs could lift Boeing and Airbus plane prices even higher",
    "description": "Commercial plane prices, already lifted in recent years due to pandemic supply chain shocks, are poised to climb further as Boeing and Airbus are buffeted by trade tariffs.\"Compared with 2018, prices for commercial jets have risen by around 30 percent,\" an av…",
    "link": "https://www.rawstory.com/boeing-tariffs/",
    "timestamp": "2025-04-20T11:22:05Z"
  },
  {
    "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
    "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
    "link": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
    "timestamp": "2025-04-20T11:18:00Z"
  },
  {
    "title": "Taxes on super rich and tech giants stall under Trump",
    "description": "Global tax plans targeting billionaires and multinational companies are running aground, with the United States torpedoing reforms under President Donald Trump.The billionaire real estate tycoon has pulled the United States out of an international deal on tax…",
    "link": "https://www.rawstory.com/trump-super-rich/",
    "timestamp": "2025-04-20T11:17:41Z"
  },
  {
    "title": "Trump isn't holding rallies these days — and doesn't seem to miss them much (Washington Post)",
    "description": "Washington Post:\nTrump isn't holding rallies these days — and doesn't seem to miss them much  —  “There's really no reason to do it,” a senior White House official said of holding a rally.  —  In his first eight months in the White House in 2017, Donald Trump…",
    "link": "https://www.memeorandum.com/250420/p4",
    "timestamp": "2025-04-20T11:15:00Z"
  },
  {
    "title": "FSU Students Angry Over Plan to Restart Classes",
    "description": "Florida State University students are to return to school on Monday, following a deadly shooting Thursday.",
    "link": "https://www.newsweek.com/florida-state-university-students-shooting-2061859",
    "timestamp": "2025-04-20T11:14:50Z"
  },
  {
    "title": "Talks for proposed India-US trade agreement gaining pace",
    "description": "India explores early tranche in US trade agreement during 90-day tariff pause, focusing on market access and non-tariff barriers.",
    "link": "https://www.thehindubusinessline.com/economy/talks-for-proposed-india-us-trade-agreement-gaining-pace/article69470954.ece",
    "timestamp": "2025-04-20T11:13:16Z"
  },
  {
    "title": "Newspoll steady as both leaders’ ratings fall; Labor surging in poll of marginal seats",
    "description": "The latest Newspoll has Labor consolidating its recent gains ahead of the May 3 election.",
    "link": "https://theconversation.com/newspoll-steady-as-both-leaders-ratings-fall-labor-surging-in-poll-of-marginal-seats-254715",
    "timestamp": "2025-04-20T11:09:44Z"
  },
  {
    "title": "India-US trade agreement talks gain pace: What you should know",
    "description": "India and US trade negotiations are progressing. Discussions will begin on April 23 in Washington. India aims for an early agreement during the 90-day tariff pause. Both countries have finalized the agreement's terms. They want to double trade to USD 500 bill…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-agreement-talks-gain-pace-what-you-should-know/articleshow/120454650.cms",
    "timestamp": "2025-04-20T11:06:33Z"
  },
  {
    "title": "US reconsiders Syria policy strategy amid troop drawdown, sanction talks",
    "description": "The United States is reassessing its relations with the new leadership in Damascus, weighing a strategic policy shift in Syria that includes significant troop reductions and renewed debate over sanctions.",
    "link": "https://www.hurriyetdailynews.com/us-reconsiders-syria-policy-strategy-amid-troop-drawdown-sanction-talks-208272",
    "timestamp": "2025-04-20T11:04:34Z"
  },
  {
    "title": "Javier Milei: A Tourist In Trump’s Mar-A-Lago",
    "description": "As long as the “culture wars” rage on, Milei will be seen by the “right” and Donald Trump as an important ally.",
    "link": "https://www.forbes.com/sites/afontevecchia/2025/04/20/javier-milei-a-tourist-in-trumps-mar-a-lago/",
    "timestamp": "2025-04-20T11:00:31Z"
  },
  {
    "title": "Trump Team Eyes Politically Connected Startup to Overhaul $700 Billion Government Payments Program",
    "description": "A little-known firm with investors linked to JD Vance, Elon Musk and Trump could get a piece of the federal expense card system.",
    "link": "https://gizmodo.com/trump-team-eyes-politically-connected-startup-to-overhaul-700-billion-government-payments-program-2000591587",
    "timestamp": "2025-04-20T11:00:12Z"
  },
  {
    "title": "Can Universities (And Law Schools) Still Diversify Faculty Hiring Under Trump?",
    "description": "Inside Higher Ed, Can Universities Still Diversify Faculty Hiring Under Trump?: Before Donald Trump retook office, advocates of a more demographically diverse U.S. professoriate were already criticizing existing hiring efforts as inadequate. One late-2022 pap…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/04/can-universities-and-law-schools-still-diversify-faculty-hiring-under-trump.html",
    "timestamp": "2025-04-20T11:00:00Z"
  },
  {
    "title": "Breaking the Conveyor Belt",
    "description": "On January 26, less than a week after his inauguration, Donald Trump took a break from a day of rest and relaxation at his Miami golf course to post on social media that Colombia would face vicious “emergency” tariffs unless the country accepted two planes of…",
    "link": "https://www.nybooks.com/online/2025/04/20/breaking-the-conveyor-belt/",
    "timestamp": "2025-04-20T11:00:00Z"
  },
  {
    "title": "During Passover, Israeli Mother Asks for Help to Free Hostage Son From ‘Hell’ in Gaza",
    "description": "Jews across the world are currently celebrating Passover, but for Viki Cohen, “it’s not a holiday.”   For the second year in a row, Cohen... Read More\nThe post During Passover, Israeli Mother Asks for Help to Free Hostage Son From ‘Hell’ in Gaza appeared firs…",
    "link": "https://www.dailysignal.com/2025/04/20/mother-asks-help-free-son-hell-gaza/",
    "timestamp": "2025-04-20T11:00:00Z"
  },
  {
    "title": "Trump’s Power Feeds on White Demographic Fears",
    "description": "Paranoid about losing their majority status and the power it confers, white Americans keep backing Trump’s racist anti-immigrant policies.\nThe post Trump’s Power Feeds on White Demographic Fears appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/20/trump-racism-white-demographic-fears-immigration/",
    "timestamp": "2025-04-20T11:00:00Z"
  },
  {
    "title": "Strollers, other baby products will get more expensive, harder to find with tariffs",
    "description": "Raising a child in America has never been cheap",
    "link": "https://abcnews.go.com/Business/wireStory/strollers-baby-products-expensive-harder-find-tariffs-120987397",
    "timestamp": "2025-04-20T10:58:08Z"
  },
  {
    "title": "Pick of BL commodities - April 20, 2025",
    "description": "US President Donald Trump’s policies are beginning to weigh heavily on the globe, though in certain cases they are putting Indian at an advantage. The Trump administration’s decision to cut funding for its National Oceanic and Atmospheric Administration (NOAA…",
    "link": "https://www.thehindubusinessline.com/newsletter/pick-of-bl-commodities/pick-of-bl-commodities-april-20-2025/article69467923.ece",
    "timestamp": "2025-04-20T10:57:44Z"
  },
  {
    "title": "Strollers and other baby products will get more expensive -- and harder to find -- with tariffs",
    "description": "Strollers and other baby products will get more expensive -- and harder to find -- with tariffsclickondetroit.com",
    "link": "https://www.clickondetroit.com/business/2025/04/20/strollers-and-other-baby-products-will-get-more-expensive-and-harder-to-find-with-tariffs/",
    "timestamp": "2025-04-20T10:56:21Z"
  },
  {
    "title": "Links 4/20/2025",
    "description": "Our strategic daily links: Wild leaps, more measles, toxic rice, robot runners, EU workers, Gaza horrors, Ukraine burning, student deportations, vanishing privacy, DOGEy moves, Trumpworld, immigration troubles, plunging markets, AI, and wretched excess",
    "link": "https://www.nakedcapitalism.com/2025/04/links-4-20-2025.html",
    "timestamp": "2025-04-20T10:55:56Z"
  },
  {
    "title": "Is it Time to Ignore the Judiciary?",
    "description": "It seems clear to me that the broad scope and speed of the administration’s actions have knocked the sense out of the media, the Democrats and, alas, the judiciary. They cannot seem to process the swift and expansive range of change without making themselves …",
    "link": "https://freerepublic.com/focus/f-chat/4312118/posts",
    "timestamp": "2025-04-20T10:55:43Z"
  },
  {
    "title": "Trump Claims Unfettered Power on Immigration",
    "description": "Dan Balz: “From the day he came down the escalator to announce his candidacy for the White House, President Donald Trump has had one go-to issue in his political playbook: immigration. He rode it to",
    "link": "https://politicalwire.com/2025/04/20/trump-claims-unfettered-power-on-immigration/",
    "timestamp": "2025-04-20T10:43:00Z"
  },
  {
    "title": "Is Donald Trump Lying About His Health? POTUS’ Medical Report Has Embarrassing Red Flags",
    "description": "Donald Trump's medical report for his first physical examination of his second term has been released. But people have many questions about his claims, especially his resting heart rate and height.",
    "link": "https://www.inquisitr.com/is-donald-trump-lying-about-his-health-potus-medical-report-has-embarrassing-red-flags",
    "timestamp": "2025-04-20T10:39:30Z"
  },
  {
    "title": "Pope Francis Meets US Vice President JD Vance On Easter Morning: Vatican",
    "description": "Pope Francis held a private meeting at the Vatican on Sunday morning with US Vice President JD Vance, the Vatican said in a statement.",
    "link": "https://www.ndtv.com/world-news/pope-francis-meets-us-vice-president-jd-vance-on-easter-morning-vatican-8210206",
    "timestamp": "2025-04-20T10:38:01Z"
  },
  {
    "title": "Trump Doesn’t Seem to Miss His Rallies",
    "description": "“In his first eight months in the White House in 2017, Donald Trump held nine rallies — the kind of campaign-style events that had come to define his political brand, drawing thousands of supporters from",
    "link": "https://politicalwire.com/2025/04/20/trump-doesnt-seem-to-miss-his-rallies/",
    "timestamp": "2025-04-20T10:38:00Z"
  },
  {
    "title": "Zelensky Accuses Russia of Continuing Attacks During 'Easter Ceasefire'",
    "description": "Ukrainian President Volodymyr Zelenskyy accused Russia on Sunday of creating a false appearance of honoring an Easter ceasefire, saying Moscow continued to launch attacks overnight after Russian President Vladimir Putin announced a unilateral temporary truce …",
    "link": "https://www.breitbart.com/europe/2025/04/20/zelensky-accuses-russia-of-continuing-attacks-during-easter-ceasefire/",
    "timestamp": "2025-04-20T10:34:34Z"
  },
  {
    "title": "How Eco-Localism Differs from Trump’s Tariff Terrorism",
    "description": "Followers of the Small Is Beautiful\r\n school of environmentalism (to which I subscribe) often critique globalization and advocate localism. The controversial new Trump tariffs seem purpose-made to choke off global trade and promote American domestic manufactu…",
    "link": "https://www.commondreams.org/opinion/eco-localism-vs-trump-tariffs",
    "timestamp": "2025-04-20T10:33:03Z"
  },
  {
    "title": "Wall Street’s silent protest: censorship in the age of Trump",
    "description": "Cembalest was playing the part of a court jester, tossing barbs at the mad king while kneeling at his feet",
    "link": "https://www.irishtimes.com/your-money/2025/04/20/wall-streets-silent-protest-censorship-in-the-age-of-trump/",
    "timestamp": "2025-04-20T10:30:20Z"
  },
  {
    "title": "Trade face-off: Will Trump’s America back down first or Xi’s China?",
    "description": "Both sides will suffer if today’s tariff war doesn’t give way to peace. Will either back off? Pressure on Trump seems greater than on Xi, but this may only be because American politics is transparent while the Chinese equivalent is opaque.",
    "link": "https://www.livemint.com/opinion/online-views/us-china-trade-war-trump-tariffs-china-xi-jinping-trade-policy-stock-market-reaction-tariffs-us-farmers-tariff-impact-11744986110083.html",
    "timestamp": "2025-04-20T10:30:00Z"
  },
  {
    "title": "Pope says 'no peace without freedom of religion' at Easter balcony appearance amid illness",
    "description": "His address, read out, condemned “worrisome” anti-Semitism, and the “deplorable” situation in Gaza.",
    "link": "https://www.thejournal.ie/pope-says-no-peace-without-freedom-of-religion-at-easter-balcony-appearance-after-illness-6682875-Apr2025/",
    "timestamp": "2025-04-20T10:29:17Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez’s Leadership Lessons For Corporate Executives",
    "description": "Rep. Alexandria Ocasio-Cortez has triggered talk about a possible presidential candidacy because of her headline-making opposition to President Donald Trump’s policies.",
    "link": "https://www.forbes.com/sites/edwardsegal/2025/04/20/alexandria-ocasio-cortezs-leadership-lessons-for-corporate-executives/",
    "timestamp": "2025-04-20T10:28:54Z"
  },
  {
    "title": "Labour must focus on risk to global financial stability posed by Trump policies, not only trade | Heather Stewart",
    "description": "As Rachel Reeves heads to US for IMF meetings, stance appears unaltered despite chaos unleashed by White House\nKeir Starmer and Rachel Reeves have underlined how much the world has changed after Donald Trump’s “liberation day”, with the UK prime minister even…",
    "link": "https://biztoc.com/x/2dabb1e4aec3c593",
    "timestamp": "2025-04-20T10:27:54Z"
  },
  {
    "title": "People point out bizarre moment Trump 'lies' about price of gas and eggs in wild footage",
    "description": "The cost to live has us all in shambles right now, so we know exactly how much our food is costing us, but apparently, the President has other ideas.\nDonald Trump has been caught allegedly ‘lying’ about the true cost of gas and eggs in a strange moment caught…",
    "link": "https://biztoc.com/x/e8d495c07f79ecbc",
    "timestamp": "2025-04-20T10:27:33Z"
  },
  {
    "title": "Pope Wishes 'Happy Easter' To Faithful In Appearance At St Peter's Square",
    "description": "Pope Francis appeared in front of thousands of Catholic faithful at St Peter's Square on Sunday for Easter, despite the 88-year-old pontiff's frail health that has kept him from most Holy Week events.",
    "link": "https://www.ibtimes.com.au/pope-wishes-happy-easter-faithful-appearance-st-peters-square-1858042",
    "timestamp": "2025-04-20T10:27:06Z"
  },
  {
    "title": "Papst empfing US-Vizepräsident Vance",
    "description": null,
    "link": "https://orf.at/stories/3391144/",
    "timestamp": "2025-04-20T10:23:57Z"
  },
  {
    "title": "Putin's Easter truce: Cause for scepticism or chance for peace?",
    "description": "Ukraine and Russia have accused each other of violating a 30-hour truce, but it comes as diplomatic efforts pick up, Russia Editor Steve Rosenberg writes.",
    "link": "https://www.bbc.com/news/articles/cy70vj2eejzo",
    "timestamp": "2025-04-20T10:22:14Z"
  },
  {
    "title": "Questions emerge on how deputy's stepson became suspect in FSU shooting",
    "description": "The suspect was a long-standing member of a sheriff’s office youth advisory council and was steeped in the family-like culture of the agency.",
    "link": "https://www.wyff4.com/article/questions-how-deputys-stepson-gunman-fsu-shooting/64532469",
    "timestamp": "2025-04-20T10:20:29Z"
  },
  {
    "title": "President Trump Declares: JESUS IS RISEN at White House Easter Event! Franklin Graham Speech.",
    "description": "This Easter, former President Donald J. Trump hosted a deeply moving Holy Week celebration at the White House — filled with worship, prayer, and a bold proclamation of the resurrection of Jesus Christ. From heartfelt music to gospel-centered messages, this wa…",
    "link": "https://freerepublic.com/focus/f-news/4312116/posts",
    "timestamp": "2025-04-20T10:08:59Z"
  },
  {
    "title": "White House Easter egg roll: How to watch the event that will use 30,000 real eggs",
    "description": "The White House Easter egg roll is set to take place on Monday and for the first time, there are corporate sponsors. Here's how to watch the event.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/20/white-house-easter-egg-roll-how-to-watch/83031071007/",
    "timestamp": "2025-04-20T10:06:25Z"
  },
  {
    "title": "Republicans are targeting a pillar of Obamacare. Millions of their own voters may pay a price",
    "description": "As the pressure grows on Congressional Republicans to identify cuts in Medicaid, they are crashing into a familiar problem: The changes that could save the most money would impose heavy costs on many of their own voters.",
    "link": "https://www.cnn.com/2025/04/20/politics/medicaid-expansion-congress-gop-budget/index.html",
    "timestamp": "2025-04-20T10:00:35Z"
  },
  {
    "title": "Xi’s Asian charm offensive is all about keeping the US out",
    "description": "China’s leader is keen to capitalize on a leadership vacuum left by US President Donald Trump in East Asia. Washington must recognize the strategic rivalry that Beijing poses.",
    "link": "https://www.livemint.com/opinion/online-views/china-southeast-asia-xi-jinping-us-trade-war-indo-pacific-strategy-belt-and-road-asean-relations-south-china-sea-beijing-11744987333133.html",
    "timestamp": "2025-04-20T10:00:19Z"
  },
  {
    "title": "Trump Is Promising to Lower Drug Prices. Don’t Count on It",
    "description": "Even the solid proposals set out by the Trump administration are being undermined by its actions taken elsewhere.",
    "link": "https://gizmodo.com/trump-is-promising-to-lower-drug-prices-dont-count-on-it-2000590702",
    "timestamp": "2025-04-20T10:00:02Z"
  },
  {
    "title": "Trump’s tariff fiasco is an opportunity to reboot the Libertarian Party",
    "description": "The Libertarian Party was founded to oppose a Republican president meddling with the free market. Trump is giving the party a chance to rediscover its roots.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-libertarian-party-free-markets-rcna200824",
    "timestamp": "2025-04-20T10:00:00Z"
  },
  {
    "title": "More than 2,000 gather at Capitol Square to protest Trump administration",
    "description": "More than 2,000 impassioned, angry and worried Virginians showed up at Capitol Square to protest what President Donald Trump is doing to the nation.",
    "link": "https://richmond.com/news/state-regional/article_d678723f-65c4-44e7-9db0-95392408414b.html",
    "timestamp": "2025-04-20T10:00:00Z"
  },
  {
    "title": "Why Neo-Nazis Are Obsessed With the Occult",
    "description": "Deep in northwestern Westphalia, Germany, stands a twelfth-century castle conceived by Heinrich Himmler, leader of the paramilitary Schutzstaffel, as a kind of “Camelot” for the triumphal knights of the Aryan race. The Wewelsburg Castle was also a fantasy ner…",
    "link": "https://newrepublic.com/article/193987/neo-nazis-occult-order-nine-angles-wisconsin-parent-killing",
    "timestamp": "2025-04-20T10:00:00Z"
  },
  {
    "title": "Donald Trump’s Deportation Obsession",
    "description": "Jonathan Blitzer on the White House meeting with President Nayib Bukele, the case of Kilmar Abrego Garcia, and the many ways the Trump Administration is trying to force people out of the country.",
    "link": "https://www.newyorker.com/magazine/2025/04/28/donald-trumps-deportation-obsession",
    "timestamp": "2025-04-20T10:00:00Z"
  },
  {
    "title": "Trump's hope for \"one of the greatest Easters ever\" doesn't include these Christians",
    "description": "An estimated 10 million Christians are subject to deportation, ICE has permission to invade churches, but Trump promises \"one of the greatest Easters ever.\"",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/churches-easter-ice-sensitive-locations-rcna201825",
    "timestamp": "2025-04-20T10:00:00Z"
  },
  {
    "title": "Neil Young Appears With 'Hands Off Canada' Sign at Anti-Trump Protest",
    "description": "The rock legend hit the streets in Ventura County, California, with a \"Hands Off Canada\" sign over the weekend.",
    "link": "https://www.newsweek.com/neil-young-anti-donald-trump-rally-hands-off-canada-2061854",
    "timestamp": "2025-04-20T09:55:08Z"
  },
  {
    "title": "JPMorgan details exactly how it thinks Trump's trade war will play out — and what investors should do",
    "description": "The firm expects the effective tariff rate to fall between 10% to 20% when Trump's trade war is all said and done.",
    "link": "https://www.businessinsider.com/how-will-trump-trade-war-end-tariffs-recession-scenario-jpmorgan-2025-4",
    "timestamp": "2025-04-20T09:55:01Z"
  },
  {
    "title": "Protesters rally outside White House amid nationwide anti-Trump demonstrations",
    "description": "A large number of people gathered near the White House on Saturday to protest President Donald Trump's agenda, building upon a widespread effort by anti-Trump organizers to galvanize voters concerned with the administration's policies and significant use of e…",
    "link": "https://biztoc.com/x/e610e4492fd71cc5",
    "timestamp": "2025-04-20T09:54:42Z"
  },
  {
    "title": "Security Affairs newsletter Round 520 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Attackers expl…",
    "link": "https://securityaffairs.com/176716/breaking-news/security-affairs-newsletter-round-520-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-04-20T09:53:17Z"
  },
  {
    "title": "Ukrainians mark Easter with little faith in Russia ceasefire",
    "description": "Dozens of Ukrainians have gathered at a bombed-out church in the country’s north to celebrate Easter Sunday, doubting a ceasefire with Russia is possible",
    "link": "https://abcnews.go.com/International/wireStory/ukrainians-mark-easter-faith-russia-ceasefire-120986690",
    "timestamp": "2025-04-20T09:49:13Z"
  },
  {
    "title": "Peter Thiel: DOGE Alleges Some Left-Wing NGOs Simply Fronts for 'Borderline Criminal Activity'",
    "description": "Tech billionaire Peter Thiel revealed the Department of Government Efficiency (DOGE) has found some left-wing NGOs that are allegedly fronts disguising \"borderline criminal activity.\"\nThe post Peter Thiel: DOGE Alleges Some Left-Wing NGOs Simply Fronts for ‘B…",
    "link": "https://www.breitbart.com/politics/2025/04/20/peter-thiel-doge-reveals-some-left-wing-bgos-simply-fronts-for-borderline-criminal-activity/",
    "timestamp": "2025-04-20T09:45:53Z"
  },
  {
    "title": "Russia claims Ukraine has broken Easter ceasefire more than a thousand times",
    "description": "President Volodymyr Zelenskyy says Russia is making a pretence of a ceasefire to advance on Ukraine's frontline.",
    "link": "https://www.abc.net.au/news/2025-04-20/russia-claims-ukraine-has-broken-easter-ceasefire/105195678",
    "timestamp": "2025-04-20T09:44:49Z"
  },
  {
    "title": "Trump tariffs: DHL suspends high value US deliveries",
    "description": "DHL suspends high value US deliveries over tariffs\nDHL Express is suspending deliveries to the US worth more than $800 (£603) because of a \"significant increase\" in red tape at customs following the intruduction of Donald Trump's new tariff regime.\nThe delive…",
    "link": "https://biztoc.com/x/05db5a591f52e495",
    "timestamp": "2025-04-20T09:43:33Z"
  },
  {
    "title": "Javier Milei’s Political Hegemony Had Turned Into Pathetic Circus, Then The IMF Bailed Him Out",
    "description": "Ahead of the IMF deal, jittery markets and institutional violence used to repress street protests had hit at the President’s standing in opinion polls as the electoral campaign begins to heat up.",
    "link": "https://www.forbes.com/sites/afontevecchia/2025/04/20/javier-mileis-political-hegemony-had-turned-into-pathetic-circus-then-the-imf-bailed-him-out/",
    "timestamp": "2025-04-20T09:36:43Z"
  },
  {
    "title": "Trump withdraws US from global tax deal, reignites clash over big tech and billionaire levies",
    "description": "Efforts to establish a coordinated global tax regime for tech giants and ultra-wealthy individuals are unraveling, as US President Donald Trump pulls back support and threatens new tariffs. The move has reopened transatlantic tensions and cast uncertainty ove…",
    "link": "https://biztoc.com/x/3acc57daee689fe3",
    "timestamp": "2025-04-20T09:32:32Z"
  },
  {
    "title": "Trump's White House Easter Egg Roll is brought to you by Big Tech",
    "description": "The White House partnered with Meta, Amazon, YouTube, and other companies for this year's Easter Egg Roll.",
    "link": "https://www.businessinsider.com/white-house-easter-egg-roll-sponsors-big-tech-meta-zuckerberg-2025-4",
    "timestamp": "2025-04-20T09:31:01Z"
  },
  {
    "title": "EU draws lessons from China clashes as it faces off against US under Donald Trump",
    "description": "Bloc turns some of the weapons it had trained on Beijing towards Washington for potential use in the erstwhile allies' worsening trade war Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/20/eu-draws-lessons-from-china-clashes-as-it-faces-off-against-us-under-donald-trump",
    "timestamp": "2025-04-20T09:20:00Z"
  },
  {
    "title": "Federal workers still employed are feeling chaos, anxiety, guilt and resentment",
    "description": "Federal employees in Philadelphia are dealing with increased work loads, returning to the office full-time, and weighing whether to remain in public service amid job uncertainty.",
    "link": "https://www.inquirer.com/business/federal-workers-employed-philadelphia-20250420.html",
    "timestamp": "2025-04-20T09:15:29Z"
  },
  {
    "title": "Vladimir Putin's 'Easter Truce' Sparks Backlash: 'PR Stunt'",
    "description": "\"There is no trust in words coming from Moscow,\" Ukrainian President Volodymyr Zelensky said in a statement.",
    "link": "https://www.newsweek.com/vladimir-putin-easter-truce-russia-ukraine-backlash-2061857",
    "timestamp": "2025-04-20T09:14:53Z"
  },
  {
    "title": "Marijuana holiday 4/20 coincides with Easter and Passover this year. Here’s what to know",
    "description": "Marijuana culture’s high holiday, known as 4/20, falls this year on Easter Sunday, as well as the last day of Passover, meaning cannabis fans can celebrate in some unusual ways, including an “Easter nug hunt” in Los Angeles, kosher-style THC gummies in New Yo…",
    "link": "https://www.nbcnews.com/news/us-news/marijuana-holiday-420-easter-passover-rcna202014",
    "timestamp": "2025-04-20T09:09:40Z"
  },
  {
    "title": "Ethereum Enters Historic Buy Zone As Price Dips Below Key Level – Insights",
    "description": "Ethereum is currently trading at a critical resistance level as bulls attempt to regain momentum and push for a fresh high. The broader market remains under pressure as global uncertainty escalates, largely fueled by ongoing trade tensions between the United …",
    "link": "http://www.newsbtc.com/news/ethereum/ethereum-enters-historic-buy-zone-as-price-dips-below-key-level-insights/",
    "timestamp": "2025-04-20T09:00:09Z"
  },
  {
    "title": "Markets are wrong about Trump's trade war and recession odds, says a longtime bull betting on a bounce-back",
    "description": "Wall Street's biggest bull changed his market outlook but is still optimistic. Here's why he says markets are wrong about President Trump's trade war.",
    "link": "https://www.businessinsider.com/stock-market-outlook-trump-tariff-trade-war-economy-outlook-stoltzfus-2025-4",
    "timestamp": "2025-04-20T09:00:02Z"
  },
  {
    "title": "Zelenskyy says Russia is trying to create ‘impression of a ceasefire’",
    "description": "Ukrainian President Volodymyr Zelenskyy accused Russia on Sunday of creating a false appearance of honoring an Easter ceasefire.",
    "link": "https://www.cnbc.com/2025/04/20/zelenskyy-says-russia-is-trying-to-create-impression-of-a-ceasefire.html",
    "timestamp": "2025-04-20T08:58:58Z"
  },
  {
    "title": "Texas gunman who killed 23 at El Paso Walmart set to plead guilty to murder",
    "description": "The shooting happened at a Walmart in El Paso in 2019.",
    "link": "https://nypost.com/2025/04/20/us-news/texas-gunman-patrick-crusius-who-fatally-shot-23-at-el-paso-walmart-set-to-plead-guilty-to-murder/",
    "timestamp": "2025-04-20T08:58:08Z"
  },
  {
    "title": "DHL suspends high value US deliveries over tariffs",
    "description": "The postal giant will stop shipping packages to American consumers after a rise in red tape at customs.",
    "link": "https://www.bbc.com/news/articles/c1jx9ep5l63o",
    "timestamp": "2025-04-20T08:51:10Z"
  },
  {
    "title": "Türkiye could benefit from shifts in tourism in US",
    "description": "As tourist flows from the United States and Russia are expected to shift to different destinations in 2025, Türkiye is likely to gain a significant share from this trend, according to people from the tourism industry.",
    "link": "https://www.hurriyetdailynews.com/turkiye-could-benefit-from-shifts-in-tourism-in-us-208262",
    "timestamp": "2025-04-20T08:45:35Z"
  },
  {
    "title": "SafeMoon CEO Set To Face Trial Despite DOJ Crypto Memo",
    "description": "New York prosecutors have stated intentions to proceed with the trial of SafeMoon CEO Braden John Karony, despite a recent directive by the US Department of Justice (DOJ) to scale back certain types of crypto enforcement actions. This development adds another…",
    "link": "https://bitcoinist.com/safemoon-ceo-set-to-face-trial-doj-crypto-memo/",
    "timestamp": "2025-04-20T08:30:21Z"
  },
  {
    "title": "Steve Bannon tells me why Elon Musk is 'evil' — and his vision for Trump 2028",
    "description": "Nicolás Ortega for BI\nReclining out on his terracotta-tiled terrace, his bare feet propped up on a worn ottoman, Steve Bannon gets a phone call. We're 2,000 miles from the Oval Office, at Bannon's Tuscan villa outside Tucson, an Italianate fountain gurgling a…",
    "link": "https://biztoc.com/x/613752627b4d7e71",
    "timestamp": "2025-04-20T08:26:22Z"
  },
  {
    "title": "Trump's plan to reshape America's schools is heating up",
    "description": "President Donald Trump is moving forward with his plans to reshape the US education system.\nGetty Images; Rebecca Zisser/BI\nTrump's administration has launched dozens of investigations into K-12 and higher education institutions.\nTrump said schools can meet h…",
    "link": "https://biztoc.com/x/2e6752a822b7cb56",
    "timestamp": "2025-04-20T08:26:18Z"
  },
  {
    "title": "Academy President Janet Yang Highlights China-Hollywood Bridge at Beijing Film Festival",
    "description": "Academy of Motion Picture Arts and Sciences President Janet Yang used her keynote at the Beijing International Film Festival to emphasize the importance of cultural exchange between the world’s two largest film markets, sharing her unique perspective as an Am…",
    "link": "https://variety.com/2025/film/news/academy-president-janet-yang-china-hollywood-bridge-1236373386/",
    "timestamp": "2025-04-20T08:21:30Z"
  },
  {
    "title": "Do US-Iran Nuclear Talks Score Big?",
    "description": "A decade ago, Iran agreed to limit its nuclear program under the Joint Comprehensive Plan of Action (JCPOA), a deal supported by Russia and several other world powers. However, the agreement collapsed during Donald Trump’s first term. Now, Washington is seemi…",
    "link": "https://sputnikglobe.com/20250420/-do-us-iran-nuclear-talks-score-big---1121896685.html",
    "timestamp": "2025-04-20T08:21:18Z"
  }
]