[
  {
    "title": "Watch: Phone call between freed hostage Edan Alexander & President Trump",
    "description": "Following his releade last week, Edan Alexander told President Trump, “You’re the only reason I’m here. You saved my life.”",
    "link": "https://www.israelnationalnews.com/news/408531",
    "timestamp": "2025-05-18T08:15:50Z"
  },
  {
    "title": "How eroding public support could make Trump even more aggressive",
    "description": "TOKYO -- In poker, players who believe they hold a strong hand usually stay quiet and play on, aiming to raise the stakes and extract more money from their opponents.\nBut U.S. President Donald Trump, who often touts his dealmaking prowess and casts himself as…",
    "link": "https://biztoc.com/x/e986b90cde218e4a",
    "timestamp": "2025-05-18T08:11:35Z"
  },
  {
    "title": "Israel's story is not straight out of Hollywood, despite latest drama",
    "description": "We must remember that our story won’t end in a Hollywood illusion. It will end in resolution, mutual responsibility, and internal solidarity.",
    "link": "https://www.jpost.com/opinion/article-854394",
    "timestamp": "2025-05-18T08:10:53Z"
  },
  {
    "title": "Donald Trump Plans Call With Russia's Putin To End Bloodbath In Ukraine",
    "description": "President Donald Trump said he&#039;ll have a phone call with Russian President Vladimir Putin on Monday morning to discuss how to stop the war in Ukraine.",
    "link": "https://www.ndtv.com/world-news/donald-trump-plans-call-with-russias-putin-to-end-bloodbath-in-ukraine-8444091",
    "timestamp": "2025-05-18T08:01:39Z"
  },
  {
    "title": "ChatGPT Rewrote a Newsweek Article in Gen Alpha Slang, Here's What It Said",
    "description": "Gen Alpha slang is here to rizz up the news.",
    "link": "https://www.newsweek.com/chatgpt-newsweek-article-gen-alpha-slang-2073347",
    "timestamp": "2025-05-18T08:00:01Z"
  },
  {
    "title": "Zelenskyy calls for pressure on Russia during 1st face-to-face meeting with Carney",
    "description": "Ukrainian President Volodymyr Zelenskyy asked Prime Minister Mark Carney on Saturday to add Canada’s weight behind global pressure on Russian President Vladimir Putin to sit at the negotiating table and agree to “an unconditional ceasefire.\"",
    "link": "https://www.cbc.ca/news/politics/carney-zelenskyy-meeting-g7-prep-1.7538111",
    "timestamp": "2025-05-18T08:00:00Z"
  },
  {
    "title": "The CIA is openly calling on Chinese officials to spy for the U.S. Will they listen?",
    "description": "American spies are saying the quiet part out loud to Chinese officials via a series of videos published online: Their knowledge of Beijing's secrets would be welcome in Washington. Some experts laud the CIA's brazen attempt to recruit Chinese sources, but oth…",
    "link": "https://www.cbc.ca/news/world/us-china-foreign-source-recruitment-1.7531667",
    "timestamp": "2025-05-18T08:00:00Z"
  },
  {
    "title": "Trump's talks with Syria echoes US embrace of Fidel Castro in 1959",
    "description": "As Syria reconfigures its political order, we must not forget the hard lessons of Cuba’s transformation into a Cold War adversary.",
    "link": "https://www.jpost.com/opinion/article-854392",
    "timestamp": "2025-05-18T07:59:03Z"
  },
  {
    "title": "World Health Organization Looks Ahead To Life Without The US",
    "description": "World Health Organization officials will join donors and diplomats with one question - how to cope with crises without their main funder, the US.",
    "link": "https://www.ndtv.com/world-news/world-health-organization-looks-ahead-to-life-without-the-us-8444043",
    "timestamp": "2025-05-18T07:55:29Z"
  },
  {
    "title": "First US Pope Leo XIV Takes To Popemobile Ahead Of Inaugural Mass",
    "description": "Pope Leo XIV, the first US pontiff, made his debut tour of St Peter&#039;s Square in a popemobile, greeting tens of thousands of pilgrims and well-wishers ahead of his inauguration mass.",
    "link": "https://www.ndtv.com/world-news/first-us-pope-leo-xiv-takes-to-popemobile-ahead-of-inaugural-mass-8444038",
    "timestamp": "2025-05-18T07:52:40Z"
  },
  {
    "title": "World Health Organization looks ahead to life without the US",
    "description": "As the United States prepares to exit, China is set to become the biggest provider of state fees, one of the WHO's main streams of funding, alongside donations",
    "link": "https://www.rappler.com/world/global-affairs/world-health-organization-looks-ahead-life-without-united-states/",
    "timestamp": "2025-05-18T07:52:33Z"
  },
  {
    "title": "Russia launches 'heaviest drone attack' on Ukraine since start of war",
    "description": "Russia has launched its heaviest drone attack on Ukraine since the start of the war in 2022, the Ukrainian military has said.",
    "link": "https://news.sky.com/story/russia-launches-heaviest-drone-attack-on-ukraine-since-start-of-war-13370104",
    "timestamp": "2025-05-18T07:51:00Z"
  },
  {
    "title": "First US pope Leo XIV takes to popemobile ahead of inaugural mass",
    "description": "VATICAN CITY - Pope Leo XIV, the first US pontiff, made his debut tour of St Peter's Square on Sunday in a popemobile, greeting tens of thousands of pilgrims and well-wishers ahead of his inauguration mass.",
    "link": "https://www.bangkokpost.com/world/3028392/first-us-pope-leo-xiv-takes-to-popemobile-ahead-of-inaugural-mass",
    "timestamp": "2025-05-18T07:45:00Z"
  },
  {
    "title": "First US Pope Leo XIV Takes To Popemobile Ahead Of Inaugural Mass",
    "description": "Pope Leo XIV, the first US pontiff, made his debut tour of St Peter's Square on Sunday in a popemobile, greeting tens of thousands of pilgrims and well-wishers ahead of his inauguration mass.",
    "link": "https://www.ibtimes.com/first-us-pope-leo-xiv-takes-popemobile-ahead-inaugural-mass-3773880",
    "timestamp": "2025-05-18T07:42:12Z"
  },
  {
    "title": "Russia launches war's largest drone attack after peace talks, Ukraine says",
    "description": "KYIV - The largest known  Russian drone attack  since full-scale war began in 2022 killed a woman in the Kyiv region and injured at least three people, Ukrainian authorities said early on Sunday, as Moscow stepped up strikes following peace talks on Friday.",
    "link": "https://www.bangkokpost.com/world/3028400/russia-launches-wars-largest-drone-attack-after-peace-talks-ukraine-says",
    "timestamp": "2025-05-18T07:42:00Z"
  },
  {
    "title": "Trump says he will call Putin on Monday to discuss stopping Ukraine war",
    "description": "Kremlin launches largest drone barrage on Ukraine since the start of Russia’s full-scale invasion",
    "link": "https://www.irishtimes.com/world/europe/2025/05/18/ukraine-russia-war-donald-trump/",
    "timestamp": "2025-05-18T07:39:39Z"
  },
  {
    "title": "2025 SkS Weekly Climate Change & Global Warming News Roundup #20",
    "description": "A listing of 29 news and opinion articles we found interesting and shared on social media during the past week: Sun, May 11, 2025 thru Sat, May 17, 2025.\nPlugging the Weather & Climate Livestream planned to start on May 28\nDuring the past week and thanks to A…",
    "link": "https://skepticalscience.com/2025-SkS-Weekly-News-Roundup_20.html",
    "timestamp": "2025-05-18T07:39:18Z"
  },
  {
    "title": "Some Chinese companies eye Singapore listings to expand markets amid trade war",
    "description": "At least five companies from mainland China or Hong Kong are planning IPOs, dual listings, or share placements in Singapore in the next 12 to 18 months, four sources said.",
    "link": "https://www.cnbc.com/2025/05/18/some-chinese-companies-eye-singapore-listings-to-expand-markets-amid-trade-war.html",
    "timestamp": "2025-05-18T07:33:54Z"
  },
  {
    "title": "Romanians cast ballots in tense presidential run-off",
    "description": "The election result could reshape the direction of the pro-EU and NATO member nation bordering war-torn Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/18/romanians-cast-ballots-in-tense-presidential-run-off",
    "timestamp": "2025-05-18T07:33:29Z"
  },
  {
    "title": "81% in Japan feel 'uneasy' about Trump's 2nd presidency: poll",
    "description": "Some 81 percent of people in Japan feel &quot;more uneasy than hopeful&quot; about U.S. President Donald Trump, who began his nonconsecutive second term in January, partly due to concerns over the impact of tariffs he has imposed, a Kyodo News survey has foun…",
    "link": "https://japantoday.com/category/politics/81-in-japan-feel-uneasy-about-trump%27s-2nd-presidency-poll",
    "timestamp": "2025-05-18T07:33:13Z"
  },
  {
    "title": "Putin's Spy Agency Used Sex, Drugs, To Exploit Musk, Claims Ex-FBI Agent",
    "description": "Jonathan Buma claimed Russian intelligence, GRU, actively ran special operations to influence top Silicon Valley figures like Elon Musk and venture capitalist Peter Thiel.",
    "link": "https://www.ndtv.com/world-news/vladimir-putin-backed-russian-spy-agency-targeted-elon-musk-using-sex-and-drugs-ex-fbi-agent-jonathan-buma-8443881",
    "timestamp": "2025-05-18T07:30:17Z"
  },
  {
    "title": "McCaughey: The scheme behind spate of anti-Trump lawsuits",
    "description": "A left-wing legal group with the misleading name Democracy Forward is proving to be the biggest obstacle to translating President Donald Trump's massive election victory into real change.",
    "link": "https://www.bostonherald.com/2025/05/18/mccaughey-the-scheme-behind-spate-of-anti-trump-lawsuits/",
    "timestamp": "2025-05-18T07:13:26Z"
  },
  {
    "title": "Russia launches one of biggest drone attacks on Ukraine since start of war, killing at least 1",
    "description": "Russia launched a major drone attack on Ukraine overnight. Ukraine's air force reported the use of 273 drones and decoys. Air defense intercepted some drones, while electronic jamming disabled others. The attacks targeted Kyiv, Dnipropetrovsk, and Donetsk reg…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-launches-one-of-biggest-drone-attacks-on-ukraine-since-start-of-war-killing-at-least-1/articleshow/121246574.cms",
    "timestamp": "2025-05-18T07:12:35Z"
  },
  {
    "title": "Russia carries out biggest drone strike after peace talks, says Ukraine",
    "description": "KYIV: Ukraine reported that Russia launched its largest drone assault since the full-scale invasion began in 2022, killing a woman and injuring at least three others in the Kyiv region. According to Reuters, Ukrainian officials stated the attack came shortly …",
    "link": "https://english.khabarhub.com/2025/18/468152/",
    "timestamp": "2025-05-18T07:12:02Z"
  },
  {
    "title": "Pope Leo XIV makes popemobile debut ahead of papal inauguration",
    "description": "Representatives of countries around the world will be in attendance this morning.",
    "link": "https://www.thejournal.ie/mass-celebrating-the-official-start-of-pope-leo-xivs-pontificate-to-take-place-6707346-May2025/",
    "timestamp": "2025-05-18T07:12:00Z"
  },
  {
    "title": "The world does not owe Trump’s America a living",
    "description": "Donald Trump is putting gargantuan demands on global markets. He might be advised to stop punching the world in the face.",
    "link": "https://www.smh.com.au/business/the-economy/the-world-does-not-owe-trumps-america-a-living-20250516-p5lzoc.html",
    "timestamp": "2025-05-18T07:08:01Z"
  },
  {
    "title": "Is Vladimir Putin blackmailing Elon Musk over Ukraine? Ex-FBI agent alleges Russian plot to target world's richest man",
    "description": "Russian spies allegedly targeted billionaire Elon Musk with a plan to exploit his known indulgences in sex and drugs, claims former FBI agent Jonathan Buma. Speaking in a ZDF documentary, Buma said Russian intelligence sought to blackmail Musk and Peter Thiel…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-vladimir-putin-blackmailing-elon-musk-over-ukraine-ex-fbi-agent-alleges-russian-plot-to-target-tech-billionaire/articleshow/121246362.cms",
    "timestamp": "2025-05-18T07:08:00Z"
  },
  {
    "title": "US Stock Market Looks More Favorable Now Than Pre-Trade War, According to Fundstrat’s Tom Lee – Here’s Why",
    "description": "Fundstrat’s head of research Tom Lee believes that US equities are in a much better position now compared to the period before Trump ignited a trade war. In a new interview on CNBC Television, Lee says heightened optimism for 2026 and US companies thriving du…",
    "link": "https://dailyhodl.com/2025/05/18/us-stock-market-looks-more-favorable-now-than-pre-trade-war-according-to-fundstrats-tom-lee-heres-why/",
    "timestamp": "2025-05-18T07:04:08Z"
  },
  {
    "title": "Scarlett Johansson brings 50th season of 'SNL' to a low-key close",
    "description": "Scarlett Johansson has hosted “Saturday Night Live” and set a record in a reflective end to the NBC sketch show's 50th season",
    "link": "https://abcnews.go.com/Entertainment/wireStory/scarlett-johansson-brings-50th-season-snl-low-key-121919521",
    "timestamp": "2025-05-18T07:02:18Z"
  },
  {
    "title": "Mass celebrating the official start of Pope Leo XIV's pontificate to take place today",
    "description": "Representatives of countries around the world will be in attendance this morning.",
    "link": "https://www.thejournal.ie/mass-celebrating-the-official-start-of-pope-leo-xivs-pontificate-to-take-place-today-6707346-May2025/",
    "timestamp": "2025-05-18T07:00:36Z"
  },
  {
    "title": "Steve Bannon:'President Trump will Serve a Third Term'-Financial Times",
    "description": "Steve Bannon, architect of US president Donald Trump’s America First movement, spoke to Edward Luce, US national editor, at the FTWeekend festival in Washington DC. The populist nationalist shared his views on everything from AI and alleging the election of A…",
    "link": "https://freerepublic.com/focus/f-chat/4317654/posts",
    "timestamp": "2025-05-18T06:58:07Z"
  },
  {
    "title": "Poles vote for a new president as security concerns loom large",
    "description": "The vote comes amid rising security fears over the war in neighboring Ukraine and uncertainty about continued U.S. support for Europe's defense.",
    "link": "https://www.npr.org/2025/05/18/g-s1-67488/poles-vote-for-a-new-president-as-security-concerns-loom-large",
    "timestamp": "2025-05-18T06:51:55Z"
  },
  {
    "title": "Will Romania vote take country away from European mainstream?",
    "description": "Voters are choosing between hard-right Euro-sceptic George Simion and liberal mayor Nicusor Dan in a presidential run-off.",
    "link": "https://www.bbc.com/news/articles/cr7z2p743x4o",
    "timestamp": "2025-05-18T06:48:40Z"
  },
  {
    "title": "Bombing near California fertility clinic that killed one person an ‘act of terrorism', says FBI",
    "description": "‘Make no mistake, this is an intentional act of terrorism, Akil Davis, the head of the FBI’s Los Angeles field office said.",
    "link": "https://www.thejournal.ie/bombing-california-fertility-clinic-that-killed-one-act-of-terrorism-fbi-6708068-May2025/",
    "timestamp": "2025-05-18T06:44:23Z"
  },
  {
    "title": "Scarlett Johansson Gets Her Apology on Saturday Night Live Season Finale",
    "description": "Michael Che tries to make nice; Mike Myers reunites with “Kanye West”",
    "link": "https://www.vanityfair.com/hollywood/story/scarlett-johansson-gets-her-apology-saturday-night-live-season-finale",
    "timestamp": "2025-05-18T06:44:06Z"
  },
  {
    "title": "Trump budget would cut ocean data and leave boaters, anglers and forecasters scrambling for info",
    "description": "President Trump's proposed budget cuts threaten the Integrated Ocean Observing System, jeopardizing real-time maritime data crucial for navigation, tsunami warnings, and hurricane predictions. Harbor pilots and scientists warn that eliminating federal funding…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-budget-would-cut-ocean-data-and-leave-boaters-anglers-and-forecasters-scrambling-for-info/articleshow/121246317.cms",
    "timestamp": "2025-05-18T06:43:24Z"
  },
  {
    "title": "Pope Leo XIV to hold inaugural mass at St Peter’s Square in front of 250,000",
    "description": "Vance and Zelenskiy among those attending service, which marks the official start of Leo’s papacy",
    "link": "https://www.irishtimes.com/world/europe/2025/05/18/pope-leo-xiv-inaugural-mass-st-peters-square-rome/",
    "timestamp": "2025-05-18T06:40:36Z"
  },
  {
    "title": "Midpoint of Trump tariff hiatus to reveal increasingly unsettled world",
    "description": "(Bloomberg) -- Most Read from BloombergHow a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump...",
    "link": "https://finance.yahoo.com/news/midpoint-trump-tariff-hiatus-reveal-063520155.html",
    "timestamp": "2025-05-18T06:35:20Z"
  },
  {
    "title": "Poles vote for a new president as security concerns loom large",
    "description": "Poles are voting Sunday in a presidential election at a time of heightened security concerns stemming from the ongoing war in neighboring Ukraine and growing worry that the U.S. commitment to Europe’s security could be weakening under President Donald Trump. …",
    "link": "https://japantoday.com/category/world/poles-vote-for-a-new-president-as-security-concerns-loom-large",
    "timestamp": "2025-05-18T06:23:45Z"
  },
  {
    "title": "Scarlett Johansson brings 50th season of ‘SNL’ to a low-key close",
    "description": "“Saturday Night Live” was more reflective than festive in the final episode of its 50th season.",
    "link": "https://www.bostonherald.com/2025/05/18/scarlett-johansson-brings-50th-season-of-snl-to-a-low-key-close/",
    "timestamp": "2025-05-18T06:17:52Z"
  },
  {
    "title": "VP Vance to visit Israel this week",
    "description": "US Vice President JD Vance is scheduled to arrive in Israel on Tuesday following President Trump's tour of the Middle East last week that did not include Israel",
    "link": "https://www.israelnationalnews.com/news/408526",
    "timestamp": "2025-05-18T06:08:34Z"
  },
  {
    "title": "Germany and other EU countries are bulking up militaries",
    "description": "German Chancellor Friedrich Merz plans to make the Bundeswehr the \"strongest conventional army in Europe.\" Other EU countries also have ambitious plans for their armed forces. DW takes a closer look.",
    "link": "https://www.dw.com/en/germany-and-other-eu-countries-are-bulking-up-militaries/a-72570394",
    "timestamp": "2025-05-18T06:08:00Z"
  },
  {
    "title": "Germany and other EU countries are bulking up militaries",
    "description": "German Chancellor Friedrich Merz plans to make the Bundeswehr the \"strongest conventional army in Europe.\" Other EU countries also have ambitious plans for their armed forces. DW takes a closer look. US President Donald Trump can feel vindicated: Germany's ne…",
    "link": "https://www.dw.com/en/germany-and-other-eu-countries-are-bulking-up-militaries/a-72570394",
    "timestamp": "2025-05-18T06:08:00Z"
  },
  {
    "title": "How Germany and Europe are bulking up militaries",
    "description": "German Chancellor Friedrich Merz plans to make the Bundeswehr the \"strongest conventional army in Europe.\" Other EU countries also have ambitious plans for their armed forces. DW takes a closer look.",
    "link": "https://www.dw.com/en/how-germany-and-europe-are-bulking-up-militaries/a-72570394",
    "timestamp": "2025-05-18T06:08:00Z"
  },
  {
    "title": "Jennifer O’Connell: Ruth Coppinger seems to think free speech applies only to views she likes",
    "description": "Do you believe in free speech? Do you believe in it for views and people you loathe? Unless you answer ‘yes’ to both questions, you don’t believe in it",
    "link": "https://www.irishtimes.com/opinion/2025/05/18/ruth-coppinger-seems-to-think-free-speech-applies-only-to-views-she-likes/",
    "timestamp": "2025-05-18T06:02:00Z"
  },
  {
    "title": "Venezuelan migrant gangsters stage uprising at Texas ICE detention facility",
    "description": "Twenty-three Venezuelan detainees accused of ties to the violent Tren de Aragua (TdA) gang barricaded themselves inside a Texas detention facility, threatened hostages and attempted to flood their unit on April 23, 2025 as per ICE officials. The Trump adminis…",
    "link": "https://www.naturalnews.com/2025-05-18-venezuelan-gangsters-stage-uprising-ice-detention-facility.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Massachusetts Gov. Maura Healey boasts meeting with CCP diplomat",
    "description": "Massachusetts Gov. Maura Healey met with CCP Consul General Chen Li, praising economic collaboration with China and highlighting Massachusetts’ $7.2 billion trade relationship. The meeting reflects a broader pattern of Chinese officials cultivating relationsh…",
    "link": "https://www.naturalnews.com/2025-05-18-ma-gov-healey-boasts-meeting-ccp-diplomat.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Federal judge denies ex-Pentagon official’s bid to halt CIA termination over military vaccine mandate controversy",
    "description": "A federal judge denied Terry Adirim’s emergency bid to block her CIA termination, ruling she failed to prove her firing was politically motivated or violated her rights. Adirim claimed conservative activist Ivan Raiklin orchestrated her dismissal by smearing …",
    "link": "https://www.naturalnews.com/2025-05-18-judge-denies-official-bid-halt-cia-termination.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Christine Lagarde: Interview with La Tribune Dimanche",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "link": "https://www.ecb.europa.eu//press/inter/date/2025/html/ecb.in250518~7f154e8794.en.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Trump’s fiscal year 2026 budget proposal slashes DEI, LGBTQ+ and abortion funding",
    "description": "President Donald Trump has proposed to cut $136 billion in non?defense discretionary spending, eliminating federal funding for DEI, LGBTQ+ initiatives and “radical” education programs, including $4.5 billion from the Department of Education. It also slashes $…",
    "link": "https://www.naturalnews.com/2025-05-18-trump-slashes-dei-lgbtq-and-abortion-funding.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Pope Leo XIV’s brother dismisses “woke” claims, predicts pragmatic pontificate amid potential Trump tensions",
    "description": "Louis Prevost, brother of Pope Leo XIV, clarified that while the new pope is more liberal than himself, he will not pursue radical changes and intends to maintain the reforms initiated by Pope Francis. Prevost emphasized that Pope Leo XIV will not overturn th…",
    "link": "https://www.naturalnews.com/2025-05-18-pope-leo-xiv-brother-dismisses-woke-claims.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "DOGE suspends over 500,000 federal credit cards in crackdown on government waste",
    "description": "DOGE, led by Elon Musk and established under Trump, has deactivated over 500,000 federal credit cards (10 percent of all active accounts) to curb misuse of taxpayer funds. Audits revealed systemic abuse, with employees using government cards for personal luxu…",
    "link": "https://www.naturalnews.com/2025-05-18-doge-suspends-federal-credit-cards-waste-crackdown.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Michigan Rep. Thanedar pushes for Trump impeachment vote, sparking fury among his Democrat colleagues â\u0080\u0093 but later backs down",
    "description": "Rep. Shri Thanedar (D-MI) forced a House vote on a seven-article impeachment resolution against President Trump, sparking backlash from fellow Democrats. The GOP-controlled House is expected to reject it. Thanedar accused Trump of abuses of power, corruption …",
    "link": "https://www.naturalnews.com/2025-05-18-thanedar-pushes-trump-impeachment-later-backs-down.html",
    "timestamp": "2025-05-18T06:00:00Z"
  },
  {
    "title": "Poland votes in tight election as Europe watches",
    "description": "Poles began voting Sunday in a tight presidential election that will be decisive for the future of the country’s centrist government as well as for abortion and LGBTQ rights. Pro-EU Warsaw mayor Rafal Trzaskowski is expected to get 30 percent, according to op…",
    "link": "https://www.digitaljournal.com/world/poland-votes-in-tight-election-as-europe-watches-2/article",
    "timestamp": "2025-05-18T05:57:20Z"
  },
  {
    "title": "Pam Bondi's Qatar Links Under Scrutiny Over Trump's Luxury Plane Gift",
    "description": "Attorney General Pam Bondi's links to Qatar are under scrutiny again following reports that President Donald Trump will be gifted a luxury plane from the Qatari government. Bondi worked as a foreign lobbyist for the nation of Qatar, earning $115,000 a month i…",
    "link": "https://freerepublic.com/focus/f-news/4317653/posts",
    "timestamp": "2025-05-18T05:41:41Z"
  },
  {
    "title": "Scarlett Johansson closes out ‘SNL’ season 50 with record-breaking return to the studio that changed her life",
    "description": "Scarlett Johansson returns to host Saturday Night Live on May 17, marking her seventh time leading the sketch comedy show. Married to cast member Colin Jost, Johansson will become the most frequent female host in SNL history. The Season 50 finale features rap…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/scarlett-johansson-closes-out-snl-season-50-with-record-breaking-return-to-the-studio-that-changed-her-life/articleshow/121245713.cms",
    "timestamp": "2025-05-18T05:36:19Z"
  },
  {
    "title": "This is why Dick’s Sporting Goods is buying Foot Locker for $2.4 billion and why investors think it’s a huge r",
    "description": "As is the way with the world in the modern age, the uncertainty surrounding Donald Trump and his rash financial decisions are causing chaos for markets across the globe. The latest firm to take the leap in the depths, past the knowable, and see what lies on t…",
    "link": "https://biztoc.com/x/0b69dc2c82f8bf36",
    "timestamp": "2025-05-18T05:35:48Z"
  },
  {
    "title": "Trump budget would cut ocean data and leave boaters, anglers and forecasters scrambling for info",
    "description": "Sweeping research cuts in President Donald Trump's proposed budget would target an ocean-monitoring system that scientists say is crucial to predicting tsunami escape routes and hurricane intensity and helping ships navigate dangerous harbors safely",
    "link": "https://abcnews.go.com/US/wireStory/trump-budget-cut-ocean-data-leave-boaters-anglers-121919248",
    "timestamp": "2025-05-18T05:34:24Z"
  },
  {
    "title": "Poles vote for a new president as security concerns loom large",
    "description": "Poles are voting in a presidential election held at a time of heightened security concerns stemming from the ongoing war in neighboring Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/poles-vote-new-president-security-concerns-loom-large-121919065",
    "timestamp": "2025-05-18T05:34:23Z"
  },
  {
    "title": "Trump's Middle East 'bromance' and Qatar jet controversy lampooned on SNL finale",
    "description": "Saturday Night Live mocks President Trump's foreign policy reset, focusing on a fictional Saudi bromance, a controversial Qatari jet, and Boeing's safety issues.",
    "link": "https://www.foxnews.com/media/trumps-middle-east-bromance-qatar-jet-controversy-lampooned-snl-finale",
    "timestamp": "2025-05-18T05:31:07Z"
  },
  {
    "title": "Moody’s downgrade intensifies investor worry about US fiscal path",
    "description": "A US sovereign downgrade by Moody’s has exacerbated investor worries about a looming debt time-bomb that could spur bond market vigilantes who want to see more fiscal restraint from Washington.",
    "link": "https://www.thehindubusinessline.com/news/world/moodys-downgrade-intensifies-investor-worry-about-us-fiscal-path/article69589739.ece",
    "timestamp": "2025-05-18T05:21:53Z"
  },
  {
    "title": "Canada Says Most Tariffs on US Remain, Pushing Back on Oxford Report",
    "description": "Canada’s finance minister said the government kept 25% retaliatory tariffs on tens of billions of dollars in US goods, disputing a report from a research firm that suggested it had paused the vast majority of those levies.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-says-most-tariffs-on-us-remain-pushing-back-on-oxford-report",
    "timestamp": "2025-05-18T05:18:10Z"
  },
  {
    "title": "Q4 earnings, FII activity, global trends to guide stock markets this week: Analysts",
    "description": "“Additionally, there is growing optimism around the possibility of an early India-US trade deal, which could provide further support to market sentiment,\" Puneet Singhania, Director at Master Trust Group, said",
    "link": "https://www.thehindubusinessline.com/markets/q4-earnings-fii-activity-global-trends-to-guide-stock-markets-this-week-analysts/article69589729.ece",
    "timestamp": "2025-05-18T05:14:20Z"
  },
  {
    "title": "After Brexit, rapprochement? How Trump's America is reuniting Europe",
    "description": "Britain and the European Union are planning a summit in London. They aim to reset relations and sign a defense agreement. This is happening as the United States reduces its global role. Trade and energy cooperation are also on the agenda. Fishing rights and y…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/after-brexit-rapprochement-how-trumps-america-is-reuniting-europe/articleshow/121245507.cms",
    "timestamp": "2025-05-18T05:13:26Z"
  },
  {
    "title": "Netanyahu remembers Amalek",
    "description": "Trump…and the rest of the world…will never fully understand what Oct.7 did to the pride of the nation. Opinion.",
    "link": "https://www.israelnationalnews.com/news/408524",
    "timestamp": "2025-05-18T05:10:53Z"
  },
  {
    "title": "Libraries are cutting back on staff and services after Trump's order to dismantle small agency",
    "description": "Libraries across the United States have cut back on some digital services weeks after the Trump administration's move to dismantle the Institute of Museum and Library Services",
    "link": "https://abcnews.go.com/US/wireStory/libraries-cutting-back-staff-services-after-trumps-order-121918699",
    "timestamp": "2025-05-18T05:10:14Z"
  },
  {
    "title": "\"She Is No Longer Hot\": Donald Trump Takes A Dig At Taylor Swift (Again)",
    "description": "In 2024, Donald Trump criticised Taylor Swift and said, &quot;I hate her&quot;",
    "link": "https://www.ndtv.com/entertainment/donald-trump-takes-a-dig-at-taylor-swift-again-she-is-no-longer-hot-8443120",
    "timestamp": "2025-05-18T05:09:24Z"
  },
  {
    "title": "Analysis-Moody's downgrade intensifies investor worry about US fiscal path",
    "description": "NEW YORK (Reuters) -A U.S. sovereign downgrade by Moody's has exacerbated investor worries about a looming debt time-bomb that could spur bond market vigilan...",
    "link": "https://www.aol.com/news/analysis-moodys-downgrade-intensifies-investor-050717596.html",
    "timestamp": "2025-05-18T05:07:17Z"
  },
  {
    "title": "Moody's downgrade intensifies investor worry about US fiscal path",
    "description": "Moody's has downgraded America's credit rating. This has increased investor concerns about rising debt. Republicans are trying to pass tax cuts and spending changes. This could increase the debt. Investors are worried about the final bill. The bond market is …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/moodys-downgrade-intensifies-investor-worry-about-us-fiscal-path/articleshow/121245408.cms",
    "timestamp": "2025-05-18T05:05:52Z"
  },
  {
    "title": "Trump shrugs off Netanyahu on gulf tour",
    "description": "Donald Trump's recent Middle East tour signals a shift in US foreign policy. It appears Israel is no longer the central focus. Trump engaged with Saudi Arabia, Qatar, and the UAE, pursuing peace deals and economic partnerships. He lifted sanctions on Syria an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-shrugs-off-netanyahu-on-gulf-tour/articleshow/121245349.cms",
    "timestamp": "2025-05-18T05:00:34Z"
  },
  {
    "title": "Palantir’s high-altitude rally defies the doubters and ‘cynics’",
    "description": "Investors chase AI and defence tech group’s stock to $300bn market cap despite analyst fears it is ‘priced for beyond perfection’",
    "link": "https://www.irishtimes.com/your-money/2025/05/18/palantirs-high-altitude-rally-defies-the-doubters-and-cynics/",
    "timestamp": "2025-05-18T05:00:00Z"
  },
  {
    "title": "Kevin Spacey to Make Surprise Appearance in Cannes to Accept a Lifetime Achievement Award (EXCLUSIVE)",
    "description": "Kevin Spacey is set to return to the Cannes Film Festival for the first time in almost a decade to collect a lifetime achievement honor. The two-time Oscar winner was last in Cannes in 2016, when he served as emcee for the amfAR gala and ripped into Donald Tr…",
    "link": "https://variety.com/2025/film/global/kevin-spacey-surprise-appearance-cannes-award-1236401716/",
    "timestamp": "2025-05-18T05:00:00Z"
  },
  {
    "title": "Trump lashes out at Walmart after retailer says they'll have to raise prices due to tariffs",
    "description": "President Donald Trump lashed out at Walmart after the retailer said it is likely to start rolling out tariff-induced price hikes soon.",
    "link": "https://biztoc.com/x/a2f5af69b5da24bf",
    "timestamp": "2025-05-18T04:56:39Z"
  },
  {
    "title": "Trump slams ABC News for Qatar plane coverage",
    "description": "United States President Donald Trump criticized ABC News for its coverage of the Boeing 747 airplane he said was donated to the Air Force (USAF) and the Department of Defense (DoD) by Qatar.In a post ...",
    "link": "https://biztoc.com/x/4e658952cf360961",
    "timestamp": "2025-05-18T04:51:28Z"
  },
  {
    "title": "SNL season finale cold open ridicules Trump boasting about ‘pre-bribe’ of $400m Qatar jet: ‘I did very well on this trip, got a lot of cool stuff’",
    "description": "James Austin Johnson returns once again to play the president as flagship NBC show closes out 50th season",
    "link": "https://www.the-independent.com/arts-entertainment/tv/snl-cold-open-trump-qatar-b2753129.html",
    "timestamp": "2025-05-18T04:47:27Z"
  },
  {
    "title": "이재명 한국 대통령 연임 가능할까?",
    "description": "Tesla pulls all the demand levers with discounts and incentives as sales crash https://t.co/8sBH8nsO1h by @fredericlambert— Electrek.co (@ElectrekCo) May 17, 2025 CEO of Novo Nordisk, maker of weight loss drug Wegovy, to step down in wake of share price drop …",
    "link": "https://ryueyes11.tistory.com/511634",
    "timestamp": "2025-05-18T04:19:30Z"
  },
  {
    "title": "Polish presidential election to test if PM's pro-EU vision is Trump-proof",
    "description": "WARSAW (Reuters) -Poles vote on Sunday in a presidential election that will decide whether Warsaw follows the pro-European path set by Prime Minister Donald Tusk, or takes a step towards bringing back nationalist admirers of U.S. President Donald Trump. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/polish-presidential-election-to-test-if-pm039s-pro-eu-vision-is-trump-proof",
    "timestamp": "2025-05-18T04:12:00Z"
  },
  {
    "title": "‘SNL’ Cold Open: Trump Bails on Sketch to Flirt With Audience",
    "description": "In the season 50 finale, Trump recaps his Middle East tour before taking a load off in the front row of the audience, surrounded by women",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-cold-open-donald-trump-bails-sketch-flirt-audience-1235342065/",
    "timestamp": "2025-05-18T04:10:23Z"
  },
  {
    "title": "One killed in Kyiv region as Russia steps up attacks after peace talks, Ukraine says",
    "description": "KYIV (Reuters) -A sustained overnight Russian drone attack killed a woman in the capital region and injured at least three people, including a child, Ukrainian authorities said early on Sunday, as Moscow stepped up its attacks following peace talks on Friday.…",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/one-killed-in-kyiv-region-as-russia-steps-up-attacks-after-peace-talks-ukraine-says",
    "timestamp": "2025-05-18T04:06:00Z"
  },
  {
    "title": "That time the NFL came to Toronto",
    "description": "Toronto has a plethora of sports teams. From hockey to basketball to baseball, there are no shortage of opportunities to watch a high-level, A-tier game in town.While football fans have the CFL's Toronto Argonauts (who obviously do very well for themselves), …",
    "link": "https://www.blogto.com/sports_play/2025/05/nfs-toronto-buffalo-bills-rogers-centre/",
    "timestamp": "2025-05-18T04:06:00Z"
  },
  {
    "title": "The Gulf States have Long Boosted US Economic Dominance, even if not every President Got a Free Private Jet",
    "description": "By Adam Hanieh, University of Exeter (The Conversation) - After signing a US$142 billion (£107 billion) arms deal with Saudi Arabia, Donald Trump said the US bond with that country was “more powerful than ever”. He was also reportedly quite pleased with the g…",
    "link": "https://www.juancole.com/2025/05/economic-dominance-president.html",
    "timestamp": "2025-05-18T04:04:21Z"
  },
  {
    "title": "A confused man named Joe",
    "description": "Bit by bit, we are learning that President Biden’s elevator didn’t always go to the top floor. It’s a sad thing to imagine because there was a nuclear button around this man. Well, we think that it was around him, but maybe the famo...",
    "link": "https://www.americanthinker.com/blog/2025/05/a_confused_man_named_joe.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Bruce Springsteen trashes America",
    "description": "The legacy media made sure the entire world would know that Bruce Springsteen was attacking America, and more specifically, Donald Trump. It was a vicious attack, and inappropriate to a concert setting.\r\n\r\nMy strong reaction surprised me, so examinin...",
    "link": "https://www.americanthinker.com/blog/2025/05/bruce_springsteen_trashes_america.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Democrats nothing more than contrarians to Trump",
    "description": "In an amusing twist, many Democrats have come out against President Trump’s plan to cut prescription drug prices, raising the distinct possibility that there is nothing — absolutely nothing—that Trump could propose of which they wou...",
    "link": "https://www.americanthinker.com/blog/2025/05/democrats_nothing_more_than_contrarians_to_trump.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Trump Pushes U.S. Federal Reserve For Rate Cuts, Criticizes Powell",
    "description": "Trump on Saturday said in a social media post the U.S. Federal Reserve should cut rates \"sooner, rather than later.\"",
    "link": "https://www.huffpost.com/entry/trump-federal-reserve-rate-cuts-jerome-powell_n_682958aee4b0f62057454711",
    "timestamp": "2025-05-18T03:53:43Z"
  },
  {
    "title": "‘Saturday Night Live’ Opens With “Fake” Donald Trump Defending Qatar’s “Gift” Of A Jumbo Jet — An Hour After The Real POTUS Did The Same",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_94190164-8002-426c-b32d-2d50c55e51f0",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "‘Saturday Night Live’ Opens With Show’s “Fake” Donald Trump Saying So Long For The Season: “The Real One Will Still Be Omnipresent”",
    "description": "Saturday Night Live opened its season finale with the show’s Donald Trump (James Austin Johnson) taking his seat in the audience and saying farewell until the fall. “After tonight, you won’t be seeing me here for a while,” said Johnson’s Trump. “Well, not the…",
    "link": "http://deadline.com/2025/05/saturday-night-live-trump-middle-east-1236402661/",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "SNL 50 Cold Open: Trump Loves The Middle East, Morgan Wallen Jokes",
    "description": "With NBC's Saturday Night Live wrapping up Season 50 tonight with host Scarlett Johansson (Jurassic World Rebirth) and musical guest Bad Bunny, we were wondering what SNL would be targeting with its final Cold Open until the fall. Donald Trump (James Austin J…",
    "link": "https://bleedingcool.com/tv/snl-50-cold-open-trump-loves-the-middle-east-morgan-wallen-jokes/",
    "timestamp": "2025-05-18T03:51:07Z"
  },
  {
    "title": "Ex-jihadists with Al-Qaida and Lashkar-e-Taiba links join Trump’s Religious Freedom Advisory board",
    "description": "Two former US jihadists, one trained at Lashkar-e-Taiba’s terror camp in Pakistan, have been appointed to the White House Advisory Board of Lay Leaders under Donald Trump. Ismail Royer, convicted for supporting terror activities including attacks in Kashmir, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ex-jihadists-with-al-qaida-and-lashkar-e-taiba-links-join-trumps-religious-freedom-advisory-board/articleshow/121244523.cms",
    "timestamp": "2025-05-18T03:46:38Z"
  },
  {
    "title": "Orban: EU Should Follow US on Ukraine",
    "description": "The Hungarian Prime Minister, Viktor Orban, has stated that there is no point in Europe going down different paths with the US.",
    "link": "https://sputnikglobe.com/20250518/orban-eu-should-follow-us-on-ukraine-1122074598.html",
    "timestamp": "2025-05-18T03:43:00Z"
  },
  {
    "title": "Pinkerton: Leo XIV and the Search for a New Social Contract in the Age of AI",
    "description": "Artificial Intelligence could enrich and enslave us—perhaps one or the other, perhaps both at the same time.  So, even non-Catholics should appreciate that Pope Leo XIV is summoning his Church to build a fortress for the free will of faith—the right of each s…",
    "link": "https://www.breitbart.com/faith/2025/05/17/pinkerton-leo-xiv-and-the-search-for-a-new-social-contract-in-the-age-of-ai/",
    "timestamp": "2025-05-18T03:40:21Z"
  },
  {
    "title": "Chinese companies eye Singapore listings to expand markets amid trade war",
    "description": "At least five Chinese and HK firms eye listings on SGX. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/some-chinese-companies-eye-singapore-listings-to-expand-markets-amid-trade-war",
    "timestamp": "2025-05-18T03:39:14Z"
  },
  {
    "title": "Trump Says Walmart Should 'Eat the Tariffs' Instead of Raising Prices",
    "description": "Walmart said last week it might have to raise prices because of Trump's tariffs.\n- Trump was not happy about it.\n- The president said Walmart made \"billions of dollars\" in 2024 and should \"eat the tariffs.\"\nPresident Donald Trump said on Saturday that Walmart…",
    "link": "https://biztoc.com/x/3e5e16675001a319",
    "timestamp": "2025-05-18T03:33:22Z"
  }
]