[
  {
    "title": "Notorious routes for smuggling, illegal immigration suddenly grow silent with Trump’s return",
    "description": "Immigration enforcement officials are reporting incredible drops in illegal migrant encounters in just the past few weeks",
    "link": "https://www.wnd.com/2025/02/notorious-routes-for-smuggling-illegal-immigration-suddenly-grow-silent-with-trumps-return/",
    "timestamp": "2025-02-07T13:47:52Z"
  },
  {
    "title": "Donald Trump Gets Mixed Picture on US Economy",
    "description": "After a robust December for the U.S. labor market, January brought mixed results as Donald Trump returns to the White House.",
    "link": "https://www.newsweek.com/donald-trump-us-economy-unemployment-rate-job-growth-january-2027772",
    "timestamp": "2025-02-07T13:47:41Z"
  },
  {
    "title": "Historical precedent, legal questions swirl around Trump plan to detain migrants at Guantanamo",
    "description": "The Trump administration's expansion of migrant detention facilities, notably its use of the U.S. naval station at Guantanamo Bay, Cuba, has reignited debate among human rights advocates and legal experts.\n\n\nPresident Donald Trump campaigned on a promise to c…",
    "link": "https://www.voanews.com/a/historical-precedent-legal-questions-swirl-around-trump-plan-to-detain-migrants-at-guantanamo-/7966534.html",
    "timestamp": "2025-02-07T13:47:04Z"
  },
  {
    "title": "21 things Trump has said about the military",
    "description": "Despite presenting himself as a champion of the U.S. military, and earning a majority of votes from veterans in all three of his campaigns for the White House according to polls, President Donald Trump has occasionally made controversial remarks about veteran…",
    "link": "https://biztoc.com/x/5cdcd6b3359968ca",
    "timestamp": "2025-02-07T13:44:44Z"
  },
  {
    "title": "UN urges Trump to reverse ICC sanctions",
    "description": "The United Nations called on Friday for US President Donald Trump to reverse his decision to slap sanctions on the International Criminal Court. \"We deeply regret the individual sanctions announced yesterday against court personnel, and call for this measure …",
    "link": "https://timesofindia.indiatimes.com/world/us/un-urges-trump-to-reverse-icc-sanctions/articleshow/118023135.cms",
    "timestamp": "2025-02-07T13:43:36Z"
  },
  {
    "title": "Forget saving the planet. Clean energy interests sharpen a different message: Money and jobs",
    "description": "Saving the planet is so 2024. Clean energy leaders across the globe are now emphasizing the greener side of green: wealth-building. It sells far better in the new world of nationalism and tycoon leaders. Messaging from the U.S. renewable energy industry and t…",
    "link": "https://www.seattlepi.com/business/article/forget-saving-the-planet-clean-energy-interests-20153393.php",
    "timestamp": "2025-02-07T13:42:32Z"
  },
  {
    "title": "Latino evangelical churches gear up to face possible immigration enforcement in churches",
    "description": "A number of Latino evangelical churches in Florida and in the southeast United States are gearing up to protect their sacred spaces",
    "link": "https://abcnews.go.com/US/wireStory/latino-evangelical-churches-gear-face-immigration-enforcement-churches-118564382",
    "timestamp": "2025-02-07T13:42:16Z"
  },
  {
    "title": "Palestinians fear their Donald Trump nightmare has begun",
    "description": "US president’s plan to expel Gazans may embolden Israeli ultranationalists bent on annexing West Bank",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/07/palestinians-fear-their-donald-trump-nightmare-has-begun/",
    "timestamp": "2025-02-07T13:40:58Z"
  },
  {
    "title": "TikTok to die? Xi Jinping flexes muscles, takes a hard-line approach, and wants popular social media platform's U.S. operations to die rather than approving a sale",
    "description": "Xi Jinping might let TikTok’s US operations die rather than approve its sale as China holds out for a “grand deal” with the Trump administration that includes larger concessions on trade and tech policy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/tiktok-to-die-xi-jinping-flexes-muscles-takes-a-hard-line-approach-and-wants-popular-social-media-platforms-u-s-operations-to-die-rather-than-approving-a-sale/articleshow/118019959.cms",
    "timestamp": "2025-02-07T13:40:49Z"
  },
  {
    "title": "Hungary to ban pro-democracy groups, media outlets receiving US aid",
    "description": "Under Orban, Hungary has for years enacted crackdowns on NGOs and the country’s independent media.",
    "link": "https://www.aljazeera.com/news/2025/2/7/hungarys-orban-to-ban-pro-democracy-and-rights-groups-receiving-us-aid",
    "timestamp": "2025-02-07T13:40:48Z"
  },
  {
    "title": "California plans to continue allowing trans athletes to compete in girls' sports despite Trump executive order",
    "description": "The California Interscholastic Federation said it will continue to follow the state's law that allow trans athletes to compete vs. girls.",
    "link": "https://www.foxnews.com/sports/california-plans-continue-allowing-trans-athletes-compete-girls-sports-despite-trump-executive-order",
    "timestamp": "2025-02-07T13:38:25Z"
  },
  {
    "title": "Joe Rogan cheers USAID shutdown weeding out 'weird, shady s---' in the government",
    "description": "Podcast host Joe Rogan complimented Elon Musk’s Department of Government Efficiency (DOGE) for exposing alleged examples of government waste at USAID.",
    "link": "https://www.foxnews.com/media/joe-rogan-cheers-usaid-shutdown-weeding-out-weird-shady-sh-government",
    "timestamp": "2025-02-07T13:36:52Z"
  },
  {
    "title": "Forget saving the planet. Clean energy interests sharpen a different message: Money and jobs",
    "description": "WASHINGTON (AP) — Saving the planet is so 2024. Clean energy leaders across the globe are now tailoring their messages to emphasize the greener side of green: wealth-building. It’s an idea that sells far better in the new world of nationalism and tycoon leade…",
    "link": "https://financialpost.com/pmn/forget-saving-the-planet-clean-energy-interests-sharpen-a-different-message-money-and-jobs",
    "timestamp": "2025-02-07T13:36:24Z"
  },
  {
    "title": "How the US Could Undermine Its Biggest Advantage Over China",
    "description": "The U.S. alliance network is its greatest advantage in the competition with China. But Washington can hardly count on its allies if it treats them worse than the way it treats its systemic rival.",
    "link": "https://thediplomat.com/2025/02/how-the-us-could-undermine-its-biggest-advantage-over-china/",
    "timestamp": "2025-02-07T13:35:00Z"
  },
  {
    "title": "Donald Trump faces real risk of dying in office, expert claims in bold prediction - NewsBreak",
    "description": "Donald Trump reportedly has a 33 per cent chance of dying in office for two key reasons, with Americans facing the possibility of JD Vance becoming US Pres",
    "link": "https://www.newsbreak.com/share/3795360137065-donald-trump-faces-real-risk-of-dying-in-office-expert-claims-in-bold-prediction?s=a2&amp;share_destination_id=MTExOTc4MDgzLTE3Mzg5MzUyNjA4NTU%3D&amp;pd=07Zqc7BO&amp;hl=en_US&amp;send_time=1738935260&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_model_exp_25q1-v2",
    "timestamp": "2025-02-07T13:34:50Z"
  },
  {
    "title": "Mexico’s Inflation Slows More Than Expected After Rate Cut",
    "description": "Mexico’s inflation slowed more than expected in January, supporting the central bank’s decision to deliver a half-point cut to its benchmark interest rate and signal additional reductions of the same magnitude.",
    "link": "https://financialpost.com/pmn/business-pmn/mexicos-inflation-slows-more-than-expected-after-rate-cut",
    "timestamp": "2025-02-07T13:34:35Z"
  },
  {
    "title": "Kanye West, Amid Return to Public Eye, Praises Hitler, Diddy, and Chris Brown in Hate-Filled X Rant",
    "description": "In a series of posts, West plainly calls himself racist and a Nazi, while also spewing rhetoric against women, Black Americans, and others",
    "link": "https://pitchfork.com/news/kanye-west-amid-return-to-public-eye-praises-hitler-diddy-and-chris-brown-in-hate-filled-x-rant/",
    "timestamp": "2025-02-07T13:34:28Z"
  },
  {
    "title": "Forget saving the planet. Clean energy interests sharpen a different message: Money and jobs",
    "description": "Saving the planet is so 2024.  Clean energy leaders across the globe are now tailoring their messages to emphasize the greener side of green: wealth-building...",
    "link": "https://finance.yahoo.com/news/forget-saving-planet-clean-energy-133419438.html",
    "timestamp": "2025-02-07T13:34:19Z"
  },
  {
    "title": "U.S. economy added just 143,000 jobs in January but unemployment rate fell to 4%",
    "description": "Nonfarm payrolls were projected to increase by 169,000 in January, according to the Dow Jones consensus forecast.",
    "link": "https://www.cnbc.com/2025/02/07/jobs-report-january-2025.html",
    "timestamp": "2025-02-07T13:34:18Z"
  },
  {
    "title": "Supreme Court Justice Takes a Swipe at Presidential Immunity Ruling",
    "description": "Sotomayor previously said the Supreme Court's presidential immunity ruling allowed a president to become a \"king above the law.\"",
    "link": "https://www.newsweek.com/supreme-court-justice-takes-swipe-presidential-immunity-ruling-2027736",
    "timestamp": "2025-02-07T13:33:49Z"
  },
  {
    "title": "'No one voted for Elon Musk': JD Vance on why Tesla CEO has so much power as billionaire plunges US govt into chaos",
    "description": "Elon Musk and his Department of Government Efficiency (DOGE) have been facing a lot from Democrats. Elon Musk has ignited panic after being granted unprecedented power under Donald Trump's administration but Vice President JD Vance has defended the billionair…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-doge-jd-vance-no-one-voted-for-elon-musk-jd-vance-on-why-tesla-ceo-has-so-much-power-as-billionaire-plunges-us-govt-into-chaos/articleshow/118022773.cms",
    "timestamp": "2025-02-07T13:33:26Z"
  },
  {
    "title": "21 things Trump has said about the military",
    "description": "The president has a history of making off-color remarks about veterans and service members",
    "link": "https://theweek.com/politics/things-donald-trump-has-said-about-the-military",
    "timestamp": "2025-02-07T13:33:10Z"
  },
  {
    "title": "Robert F Kennedy Jr Adds Mysterious Liquid In His Drink. Internet Speculates",
    "description": "One of the prevailing theories from internet sleuths is that RFK Jr was administering a dye called Methylene Blue.",
    "link": "https://www.ndtv.com/world-news/rfk-jr-adds-mysterious-liquid-in-his-drink-mid-flight-internet-speculates-7657797",
    "timestamp": "2025-02-07T13:33:08Z"
  },
  {
    "title": "Donald Trump plans to displace Palestinians from Gaza and build a riviera on their land",
    "description": "• US President Donald Trump’s announcement of a plan to take over the Gaza Strip and forcibly expel its Palestinian population was met with widespread outrage, with even the US closest allies rejecting the idea as unacceptable and illegal. \n• During a joint p…",
    "link": "https://www.voltairenet.org/article221777.html",
    "timestamp": "2025-02-07T13:33:05Z"
  },
  {
    "title": "Middle East: ‘Red line’ for the US not to include Hezbollah in the next Lebanese government",
    "description": "US Deputy Middle East Envoy Morgan Ortagus visits Lebanon\nThe post Middle East: ‘Red line’ for the US not to include Hezbollah in the next Lebanese government appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/02/07/middle-east-red-line-for-the-us-not-to-include-hezbollah-in-the-next-lebanese-government/",
    "timestamp": "2025-02-07T13:30:27Z"
  },
  {
    "title": "Musk uses X, White House position to push Trump priorities, intimidate detractors",
    "description": "The emergence of X owner Elon Musk as the most influential figure around President Donald Trump created an extraordinary dynamic.",
    "link": "https://roanoke.com/news/nation-world/government-politics/elon-musk-x-twitter-white-house/article_530ef790-8c9c-501b-a0a1-50e41a551e43.html",
    "timestamp": "2025-02-07T13:30:00Z"
  },
  {
    "title": "Musk uses X, White House position to push Trump priorities, intimidate detractors",
    "description": "The emergence of X owner Elon Musk as the most influential figure around President Donald Trump created an extraordinary dynamic.",
    "link": "https://richmond.com/news/nation-world/government-politics/elon-musk-x-twitter-white-house/article_2ec05fde-e09f-5bbc-bc2c-5fa9d3843f73.html",
    "timestamp": "2025-02-07T13:30:00Z"
  },
  {
    "title": "Russia hits back in spooks’ video ads duel",
    "description": "The CIA and its counterpart in Moscow have released video ads appealing to Russian and American citizens, respectively, to reach out Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612328-svr-cia-ads-duel/",
    "timestamp": "2025-02-07T13:29:58Z"
  },
  {
    "title": "US demands Hezbollah be omitted from Lebanon government",
    "description": "Deputy Middle East Envoy Morgan Ortagus says armed group has been defeated and is no longer a threat.",
    "link": "https://www.aljazeera.com/news/2025/2/7/us-demands-hezbollah-be-omitted-from-lebanon-government",
    "timestamp": "2025-02-07T13:28:02Z"
  },
  {
    "title": "Biden spent $10mn in taxpayer funds on ‘transgender mice’ – US lawmaker",
    "description": "Republican Nancy Mace has disclosed DEI programs that involved creating transgender lab animals Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612339-us-transgender-mice-experiments/",
    "timestamp": "2025-02-07T13:27:34Z"
  },
  {
    "title": "Super Bowl Instant Replay: FCAS’ Tom Brady & Snoop Pairing Dilutes the Message",
    "description": "THE AD: Robert Kraft's Foundation to Combat Antisemitism (FCAS) is back in the Super Bowl, spreading its message of ending hate. Two 15-second spots feature close-up shots of Snoop Dogg and Tom Brady in a stark room, where they yell at each other about common…",
    "link": "https://www.adweek.com/brand-marketing/super-bowl-instant-replay-fcas-tom-brady-snoop-pairing-dilutes-the-message/",
    "timestamp": "2025-02-07T13:27:00Z"
  },
  {
    "title": "FACT CHECK: Have AOC and Jamie Raskin Filed Articles Of Impeachment Against Trump Over Jan. 6 Pardons?",
    "description": "A post shared on Facebook claims Democratic Reps. Alexandria Ocasio-Cortez (New York) and Jamie Raskin (Maryland) have filed articles of impeachment against President Donald Trump over his Jan. 6 pardons. Verdict: False Neither Ocasio-Cortez nor Raskin have m…",
    "link": "https://checkyourfact.com/2025/02/07/fact-check-aoc-raskin-impeachment-trump-jan-6-pardons/",
    "timestamp": "2025-02-07T13:25:28Z"
  },
  {
    "title": "Louisiana Lawsuits Work At Odds With Trump’s Energy Dominance Goals",
    "description": "As he watches Super Bowl LIX this Sunday in New Orleans, President Trump might wish to raise a troubling topic with Louisiana Governor Jeff Landry.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/02/07/louisiana-lawsuits-work-at-odds-with-trumps-energy-dominance-goals/",
    "timestamp": "2025-02-07T13:25:25Z"
  },
  {
    "title": "India PM Modi to meet Trump in US visit next week: foreign ministry",
    "description": "Indian Prime Minister Narendra Modi will meet President Donald Trump during a trip to the United States next week, the foreign ministry in New Delhi said on Friday. Modi, who will visit Washington from February 12-13, will be “among the first few world leader…",
    "link": "https://www.digitaljournal.com/world/india-pm-modi-to-meet-trump-in-us-visit-next-week-foreign-ministry/article",
    "timestamp": "2025-02-07T13:25:23Z"
  },
  {
    "title": "US can ramp up sanctions on Putin, Trump’s Ukraine-Russia envoy says",
    "description": "“If there’s anybody who understands leverage, it’s President Donald J. Trump,\" Keith Kellogg tells the New York Post.",
    "link": "https://www.politico.eu/article/donald-trump-can-ramp-up-sanctions-against-vladimir-putin-war-envoy-says/",
    "timestamp": "2025-02-07T13:25:21Z"
  },
  {
    "title": "Accenture, employer of thousands in Ireland, abandons diversity measures after Trump orders",
    "description": "The global company, which has its headquarters in Dublin, is reacting to executive orders signed by Trump",
    "link": "https://www.thejournal.ie/accenture-ends-diversity-equality-programmes-measures-trump-6616454-Feb2025/",
    "timestamp": "2025-02-07T13:23:18Z"
  },
  {
    "title": "Donald Trump Is Already in Reverse",
    "description": "The Trump administration has been forced to walk back on a number of policies, plans and orders since January 20.",
    "link": "https://biztoc.com/x/a96d4c46d0d56e2a",
    "timestamp": "2025-02-07T13:22:37Z"
  },
  {
    "title": "Why does Trump want to abolish the Education Department? An anthropologist who studies MAGA explains 4 reasons",
    "description": "A desire to fight wokeness and reduce government spending are among the reasons that Trump supporters back his plans to close the Education Department.",
    "link": "https://theconversation.com/why-does-trump-want-to-abolish-the-education-department-an-anthropologist-who-studies-maga-explains-4-reasons-248818",
    "timestamp": "2025-02-07T13:20:35Z"
  },
  {
    "title": "Map wars in the Middle East: How cartographers charted and helped shape a regional conflict",
    "description": "How maps’ names and border territories − and what they omit - can project different political objectives.",
    "link": "https://theconversation.com/map-wars-in-the-middle-east-how-cartographers-charted-and-helped-shape-a-regional-conflict-231668",
    "timestamp": "2025-02-07T13:20:15Z"
  },
  {
    "title": "Why Americans need well-informed national security decisions – not politicized intelligence analysis",
    "description": "During the first Trump administration, intelligence workers at many levels made political judgments about the information they assembled.",
    "link": "https://theconversation.com/why-americans-need-well-informed-national-security-decisions-not-politicized-intelligence-analysis-248831",
    "timestamp": "2025-02-07T13:19:32Z"
  },
  {
    "title": "Trump is dismantling globalisation, one blow at a time",
    "description": "US President Donald Trump is dismantling globalisation by imposing sanctions on the International Criminal Court (ICC), withdrawing from the World Health Organization (WHO) and Paris Climate Accord, and challenging multilateral institutions. His America First…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-is-dismantling-globalisation-one-blow-at-a-time/articleshow/118022312.cms",
    "timestamp": "2025-02-07T13:18:13Z"
  },
  {
    "title": "MSNBC contributor blasts Trump administration for 'gaming' the system to 'look tough'",
    "description": "Reacting to a Guardian report that Donald Trump's administration is already inflating numbers to make the first three weeks more successful than they have been, journalist John Heilemann let out an expletive on MSNBC on Friday morning.A \"Morning Joe\" co-host …",
    "link": "https://www.rawstory.com/trump-gaming-the-system/",
    "timestamp": "2025-02-07T13:17:50Z"
  },
  {
    "title": "Donald Trump Is Already in Reverse",
    "description": "The Trump administration has been forced to walk back on a number of policies, plans and orders since January 20.",
    "link": "https://www.newsweek.com/donald-trump-administration-reversals-policies-white-house-2027288",
    "timestamp": "2025-02-07T13:17:29Z"
  },
  {
    "title": "Xi Fires Warning Shot at Trump",
    "description": "China, the U.S.'s third-largest trade partner, has restricted exports of the strategic metals tungsten, bismuth, indium, molybdenum and tellurium.",
    "link": "https://www.newsweek.com/china-us-mineral-export-ban-xi-jinping-donald-trump-trade-deal-2027658",
    "timestamp": "2025-02-07T13:17:13Z"
  },
  {
    "title": "Khamenei warns against negotiating with Washington",
    "description": "Iran's supreme leader Ayatollah Ali Khamenei on Feb. 7 urged his government not to negotiate with the United States, saying it would be \"unwise.\"",
    "link": "https://www.hurriyetdailynews.com/khamenei-warns-against-negotiating-with-washington-205559",
    "timestamp": "2025-02-07T13:17:05Z"
  },
  {
    "title": "Elon Musk's Starlink Expands In Remote Australia, Raising Dependence Concerns",
    "description": "However, Communications Minister Michelle Rowland does not see Starlink as a major competitor to the government-owned NBN, but several others are concerned about its growing influence.",
    "link": "https://www.ibtimes.com.au/elon-musks-starlink-expands-remote-australia-raising-dependence-concerns-1855957",
    "timestamp": "2025-02-07T13:16:59Z"
  },
  {
    "title": "Trump Derangement Syndrome: State rep sterilizes herself to protest president",
    "description": "'I refuse to let my body be treated as currency by an administration that only sees value in my ability to procreate'",
    "link": "https://www.wnd.com/2025/02/trump-derangement-syndrome-state-rep-sterilizes-herself-to-protest-president/",
    "timestamp": "2025-02-07T13:16:25Z"
  },
  {
    "title": "Holding Musk Accountable: Rep. Ro Khanna on Stopping DOGE's \"Unconstitutional\" Power Grab",
    "description": "We speak with Democratic Congressmember Ro Khanna of California about the Trump administration’s ongoing assault on the federal bureaucracy and the gutting of various agencies, led by the president’s unelected billionaire adviser Elon Musk and his so-called D…",
    "link": "https://www.democracynow.org/2025/2/7/ro_khanna",
    "timestamp": "2025-02-07T13:16:23Z"
  },
  {
    "title": "Donald Trump has no clue what DOGE is actually doing and where its staffers are working from despite getting office space inside the White House",
    "description": "Donald Trump's loyalists are reportedly getting furious over the recent activities of Elon Musk and his new Department of Government Efficiency. Many even believe that some of the actions undertaken by DOGE extend to even being illegal. according to reports",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-has-no-clue-what-doge-is-actually-doing-and-where-its-staffers-are-working-from-despite-getting-office-space-inside-the-white-house/articleshow/118022314.cms",
    "timestamp": "2025-02-07T13:15:22Z"
  },
  {
    "title": "Trump imposes sanctions on International Criminal Court",
    "description": "President Donald Trump signed an executive order sanctioning the International Criminal Court, accusing it of improperly targeting the U.S. and Israel. The order includes both financial sanctions and visa restrictions against unspecified ICC officials.",
    "link": "https://www.today.com/video/trump-signs-order-sanctioning-international-criminal-court-231369797876",
    "timestamp": "2025-02-07T13:14:27Z"
  },
  {
    "title": "Jill Biden to attend Super Bowl LIX cheering for Philadelphia Eagles; Who’s the Former First Lady’s ‘date’ for the big game day?",
    "description": "Jill Biden, a longtime Philadelphia Eagles fan, will attend the Super Bowl LIX at Caesars Superdome in New Orleans on February 9, 2025. Accompanied by her grandson Hunter, she will cheer for the Eagles. President Donald Trump is also set to attend, marking hi…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/jill-biden-to-attend-super-bowl-lix-cheering-for-philadelphia-eagles-whos-the-former-first-ladys-date-for-the-big-game-day/articleshow/118022179.cms",
    "timestamp": "2025-02-07T13:14:12Z"
  },
  {
    "title": "Could China Fill the US Aid Vacuum in Afghanistan?",
    "description": "Even under the Taliban’s rule, U.S. aid has played a vital role in Afghanistan.",
    "link": "https://thediplomat.com/2025/02/could-china-fill-the-us-aid-vacuum-in-afghanistan/",
    "timestamp": "2025-02-07T13:14:00Z"
  },
  {
    "title": "Seth Meyers Uses Trump’s Own Words For ‘Mad Libs’ Spoof",
    "description": "“Why do we have to fill in the missing details in the president's sentences?” asked the \"Late Night\" comedian.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-mad-libs_n_67a5eaa3e4b0a768820522be",
    "timestamp": "2025-02-07T13:13:54Z"
  },
  {
    "title": "How American Airlines recovers from a tragic crash that’s ‘not their fault’",
    "description": "It’s been one week since American Eagle Flight 5342 crashed into the Potomac River, and the work has only begun to recover from the deadliest U.S. aviation...",
    "link": "https://www.dallasnews.com/business/airlines/2025/02/07/how-american-airlines-recovers-from-a-tragic-crash-thats-not-their-fault/",
    "timestamp": "2025-02-07T13:12:22Z"
  },
  {
    "title": "Hungarian PM Viktor Orban vows NGO crackdown",
    "description": "Hungary is planning to outlaw NGOs that receive funds from the United States, Prime Minister Viktor Orban said, taking inspiration from U.S. President Donald Trump's crackdown on foreign aid.",
    "link": "https://www.hurriyetdailynews.com/hungarian-pm-viktor-orban-vows-ngo-crackdown-205557",
    "timestamp": "2025-02-07T13:12:17Z"
  },
  {
    "title": "EXCLUSIVE: White House Lays Out Policy Priorities For New Faith Office",
    "description": "Trump's new Faith Office has a list of priorities that it will it will tackle through policy writing, White House officials told the Daily Caller.",
    "link": "https://dailycaller.com/2025/02/07/trump-bondi-white-house-faith-office-west-wing-details-christians-catholic/",
    "timestamp": "2025-02-07T13:12:03Z"
  },
  {
    "title": "The End of ‘Palestine’\nDonald Trump reminds the world that ideas have sell-by dates",
    "description": "Yesterday, President Donald Trump single-handedly collapsed the most destructive idea of the last hundred years—Palestine. During meetings with Israeli Prime Minister Benjamin Netanyahu and other Israeli officials, Trump said he was going to move 1.7 million …",
    "link": "https://freerepublic.com/focus/f-news/4295705/posts",
    "timestamp": "2025-02-07T13:11:52Z"
  },
  {
    "title": "How Putin, Xi and now Trump are ushering in a new imperial age",
    "description": "The age of empires seemed to be a thing of the past. But now there are signs that some world leaders hanker after imperial power and glory.",
    "link": "https://theconversation.com/how-putin-xi-and-now-trump-are-ushering-in-a-new-imperial-age-248160",
    "timestamp": "2025-02-07T13:11:42Z"
  },
  {
    "title": "Trump's export controls team takes shape amid China tensions",
    "description": "NEW YORK -- With Commerce secretary nominee Howard Lutnick expected to receive Senate confirmation next week, President Donald Trump is quickly building a team that will decide how and when the U.S. should wield export curbs against China.\nLutnick, an advocat…",
    "link": "https://biztoc.com/x/cf72d56ea8d480f1",
    "timestamp": "2025-02-07T13:11:32Z"
  },
  {
    "title": "Capitol agenda: Battle of the budgets coming next week",
    "description": "Next week is shaping up to be a battle of the budgets. \nHouse Republicans spent hours Thursday reworking their one-bill plan in two separate meetings — one at the White House, with some limited involvement from President Donald Trump. But despite Speaker Mike…",
    "link": "https://biztoc.com/x/13fe3c8f4504472f",
    "timestamp": "2025-02-07T13:11:27Z"
  },
  {
    "title": "Trump's Gaza Plan 'Could Advance Middle East Peace': Experts",
    "description": "Trump expands on his plans for Gaza on Truth Social—experts discuss its potential impact.",
    "link": "https://www.newsweek.com/trump-gaza-expand-peace-middle-east-usa-experts-verdicts-2027233",
    "timestamp": "2025-02-07T13:10:39Z"
  },
  {
    "title": "Exclusive — Israeli Prime Minister Benjamin Netanyahu on Summit with President Trump: ‘The Best Meeting’ Ever Between Israeli, American Leaders",
    "description": "WASHINGTON — Israeli Prime Minister Benjamin Netanyahu told Breitbart News exclusively on Thursday evening that his meeting with President Donald Trump at the White House earlier this week was the “best meeting” ever had between leaders of the two nations. Ne…",
    "link": "https://freerepublic.com/focus/f-news/4295703/posts",
    "timestamp": "2025-02-07T13:09:14Z"
  },
  {
    "title": "Michael Rapaport on President's Middle East Plan: 'TRUMP GAZA PLAZA 2025'",
    "description": "Comedian and actor Michael Rapaport offered his reaction Thursday to President Donald Trump's suggestion that the U.S. take over the Gaza Strip after relocating most of the Palestinian population, saying there may be no other option.\nThe post Michael Rapaport…",
    "link": "https://www.breitbart.com/middle-east/2025/02/07/michael-rapaport-on-presidents-middle-east-plan-trump-gaza-plaza-2025/",
    "timestamp": "2025-02-07T13:09:09Z"
  },
  {
    "title": "Trump’s sanctions against the ICC are painful but could have been worse",
    "description": "Sanctions seem more of a warning shot across the court’s bows rather than a move to shut it down",
    "link": "https://www.irishtimes.com/world/europe/2025/02/07/trumps-sanctions-against-the-icc-are-painful-but-could-have-been-worse/",
    "timestamp": "2025-02-07T13:08:04Z"
  },
  {
    "title": "Trump Administration To Cut USAID Staff To Fewer Than 300 Staffers: Reports",
    "description": "More than 10,000 jobs will be slashed from the global humanitarian agency; Foreign Service officers will have 30 days to return to the U.S.",
    "link": "https://www.ibtimes.com/usaid-job-cuts-300-workers-left-3762772",
    "timestamp": "2025-02-07T13:07:51Z"
  },
  {
    "title": "Trump Condemned For ICC Sanctions Over Israel, US Probes",
    "description": "The International Criminal Court slammed sanctions Friday slapped by US President Donald Trump over its probes targeting America and Israel and pledged to press on with its aim to fight for \"justice and hope\" around the world.",
    "link": "https://www.ibtimes.com/trump-condemned-icc-sanctions-over-israel-us-probes-3762779",
    "timestamp": "2025-02-07T13:06:22Z"
  },
  {
    "title": "Europe and Canada increased defence spending by 20% in 2024, NATO says",
    "description": "Defence spending by NATO's European members and Canada rose by 20% in 2024, compared to the previous year, NATO Secretary General Mark Rutte said on Friday. NATO members are facing renewed pressure from U.S. President Donald Trump to ramp up their defence spe…",
    "link": "https://uk.news.yahoo.com/europe-canada-increased-defence-spending-130443352.html",
    "timestamp": "2025-02-07T13:04:43Z"
  },
  {
    "title": "Forbes Daily: Tesla’s China Reliance Poses A Major Conflict For Musk",
    "description": "Today’s Forbes Daily newsletter covers winter flight delays, the latest DEI attack, how much Pete Hegseth is worth, a bill to ban DeepSeek on government devices and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/02/07/forbes-daily-teslas-china-reliance-poses-a-major-conflict-for-musk/",
    "timestamp": "2025-02-07T13:03:38Z"
  },
  {
    "title": "Indonesia Orders Halt Of Tourism Projects Linked To Trump",
    "description": "The move is over water management and environmental issues.",
    "link": "https://www.huffpost.com/entry/indonesia-trump-business-projects_n_67a602a0e4b0253b58b2e13d",
    "timestamp": "2025-02-07T13:02:22Z"
  },
  {
    "title": "Nato allies discussed sending troops to Greenland after Trump threats",
    "description": "Nato countries have discussed deploying troops to Greenland in response to Donald Trump threatening to use the US military to seize the Danish island. Germany was among dozens of European allies understood to have held informal talks over “what Nato troops wo…",
    "link": "https://freerepublic.com/focus/f-news/4295701/posts",
    "timestamp": "2025-02-07T13:01:54Z"
  },
  {
    "title": "Will the Denver Federal Center in Lakewood survive the Trump administration’s cost-cutting cleaver?",
    "description": "The Denver Federal Center in Lakewood faces an uncertain future as the Trump administration begins the process of consolidating or closing buildings used by the federal government.",
    "link": "https://www.denverpost.com/2025/02/07/denver-federal-center-lakewood-federal-offices-gsa-donald-trump/",
    "timestamp": "2025-02-07T13:00:37Z"
  },
  {
    "title": "House Progressives Propose Creating Cabinet-Level Agency For Peacebuilding",
    "description": "Rep. Ilhan Omar's bill, first obtained by HuffPost, would create a Department of Peacebuilding within the executive branch.",
    "link": "https://www.huffpost.com/entry/house-progressives-cabinet-department-peace_n_67a561b7e4b06fc72ae2955b",
    "timestamp": "2025-02-07T13:00:33Z"
  },
  {
    "title": "Exclusive — Israeli Prime Minister Benjamin Netanyahu on Summit with President Trump: ‘The Best Meeting’ Ever Between Israeli, American Leaders",
    "description": "Israeli Prime Minister Benjamin Netanyahu told Breitbart News exclusively on Thursday evening that his meeting with President Donald Trump at the White House earlier this week was the “best meeting” ever had between leaders of the two nations.\nThe post Exclus…",
    "link": "https://www.breitbart.com/politics/2025/02/07/exclusive-israeli-prime-minister-benjamin-netanyahu-summit-president-trump-best-meeting-american-leaders/",
    "timestamp": "2025-02-07T13:00:31Z"
  },
  {
    "title": "MAGA law group files briefs in support of Trump executive order ending birthright citizenship",
    "description": "America First Legal filed two amicus briefs this week in support of President Donald Trump’s executive order ending birthright citizenship for the children of illegal immigrants.",
    "link": "https://www.foxnews.com/politics/maga-law-group-support-trump-executive-order",
    "timestamp": "2025-02-07T13:00:29Z"
  },
  {
    "title": "Posthaste: Tariffs will force Bank of Canada to pick growth over inflation, RBC and TD say",
    "description": "RBC and TD economists say policymakers will have to set aside inflation mandate for the good of the economy and cut interest rates. Read on",
    "link": "https://financialpost.com/news/bank-of-canada-growth-over-inflation-tariff-threat",
    "timestamp": "2025-02-07T13:00:24Z"
  },
  {
    "title": "Latino evangelical churches gear up to face possible immigration enforcement in churches",
    "description": "Faith leaders say fear is rampant in their communities, a sentiment reported across immigrant communities nationwide.",
    "link": "https://www.bostonherald.com/2025/02/07/latino-evangelical-churches-immigration-enforcement/",
    "timestamp": "2025-02-07T13:00:18Z"
  },
  {
    "title": "Trump’s Brinkmanship Is Changing Mexico",
    "description": "Claudia Sheinbaum emerged victorious from the week’s tariff tussle, but her assumptions about the United States are shaken.",
    "link": "https://foreignpolicy.com/2025/02/07/mexico-sheinbaum-trump-tariffs-economy-usmca-trade/",
    "timestamp": "2025-02-07T13:00:12Z"
  },
  {
    "title": "Appeals Court Blocks Order to Reinstate Louisiana State U. Prof Who Was Removed Over Speech",
    "description": "\"But the appeals court also allowed other parts of the district court’s restraining order to stand.\"\nThe post Appeals Court Blocks Order to Reinstate Louisiana State U. Prof Who Was Removed Over Speech first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/appeals-court-blocks-order-to-reinstate-louisiana-state-u-prof-who-was-removed-over-speech/",
    "timestamp": "2025-02-07T13:00:07Z"
  },
  {
    "title": "As the war on DEI intensifies, some companies hold the line while others work behind the scenes",
    "description": "Trump's hostility toward DEI has elevated the stakes for corporations already grappling with how to navigate the principles of diversity, equity and inclusion.",
    "link": "https://www.cnbc.com/2025/02/07/dei-companies-holding-the-line.html",
    "timestamp": "2025-02-07T13:00:01Z"
  },
  {
    "title": "DOGE to the Rescue?",
    "description": "The Department of Government Efficiency has started making moves. The D.C. media are furious about his attempts to cut government agencies. But I take Elon... Read More\nThe post DOGE to the Rescue? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/07/doge-rescue-elon-musk/",
    "timestamp": "2025-02-07T13:00:00Z"
  },
  {
    "title": "A Greenland Plot More Cynical Than Fiction",
    "description": "In Donald Trump’s world, reality has quickly become stranger than I ever imagined in Borgen.",
    "link": "https://www.theatlantic.com/international/archive/2025/02/greenland-trump-borgen/681588/",
    "timestamp": "2025-02-07T13:00:00Z"
  },
  {
    "title": "Kanye West Says 'Free Puff' As He Urges Trump To Pardon Rapper Diddy, Slams Celebs For Staying Mute",
    "description": "Kanye West, a 47-year-old American rapper expressed support for Sean 'Diddy' Combs, who is currently imprisoned and awaiting trial on numerous charges.",
    "link": "https://www.legit.ng/entertainment/celebrities/1639585-kanye-west-free-puff-urges-trump-pardon-jailed-rapper-slams-celebs-staying/",
    "timestamp": "2025-02-07T12:58:48Z"
  },
  {
    "title": "'Elon and I are completely aligned on cutting waste,' says Treasury Secretary Bessent",
    "description": "Treasury Secretary Scott Bessent told Bloomberg that major savings could be made and DOGE was one of the most important government audits he'd seen.",
    "link": "https://www.businessinsider.com/treasury-secretary-bessent-musk-completely-aligned-cutting-waste-doge-trump-2025-2",
    "timestamp": "2025-02-07T12:57:44Z"
  },
  {
    "title": "Mantis shrimp's punch, and low-methane rice",
    "description": "In this week's Naked Scientists Podcast: Uncovering the secret behind the mantis shrimp's giant punch. Also, developing a new strain of rice that produces a fraction of the methane, and shaking virus particles to hear their song. Plus, we profile NASA's new c…",
    "link": "https://www.thenakedscientists.com/podcasts/naked-scientists-podcast/mantis-shrimps-punch-and-low-methane-rice",
    "timestamp": "2025-02-07T12:57:20Z"
  },
  {
    "title": "OPINION: Netanyahu would not have signed hostage deal without Trump’s gun to his head",
    "description": "Israeli historian and writer Fania Oz-Salzberger praises those hostage familes who have campaigned tirelessly to secure their releases with little support from their PM",
    "link": "https://www.jewishnews.co.uk/opinion-netanyahu-would-not-have-signed-hostage-deal-without-trumps-gun-to-his-head/",
    "timestamp": "2025-02-07T12:56:13Z"
  },
  {
    "title": "As US Withdraws From WHO, China Supercharges Its Public Health Diplomacy",
    "description": "Over the course of two decades, China has built a public health aid program for the world, turbocharged by the pandemic. As the U.S. retreats, China will only garner more influence globally.",
    "link": "https://thediplomat.com/2025/02/as-us-withdraws-from-who-china-supercharges-its-public-health-diplomacy/",
    "timestamp": "2025-02-07T12:56:00Z"
  },
  {
    "title": "Trans-Atlantic turning point: Donald Trump tests EU-US ties",
    "description": "The European Union is striving to demonstrate its economic independence from the United States while remaining dependent on US military protection. It's the bloc's latest challenge in relations with its longtime partner.",
    "link": "https://www.dw.com/en/trans-atlantic-turning-point-donald-trump-tests-eu-us-ties/a-71533038",
    "timestamp": "2025-02-07T12:55:00Z"
  },
  {
    "title": "Transcript: Trump’s Angry USAID Rant Undercut by Surprise Rubio Video",
    "description": "The following is a lightly edited transcript of the February 7 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresid…",
    "link": "https://newrepublic.com/article/191270/transcript-trumps-angry-usaid-rant-undercut-surprise-rubio-video",
    "timestamp": "2025-02-07T12:54:02Z"
  },
  {
    "title": "Senate GOP unveils $340B budget plan with Trump’s deportation and defense funds, as House stalls",
    "description": "Republican senators are headed to Trump's private Florida club to discuss.",
    "link": "https://www.denverpost.com/2025/02/07/trump-congress-big-budget-bill/",
    "timestamp": "2025-02-07T12:53:34Z"
  },
  {
    "title": "Accenture scraps diversity and inclusion goals, FT reports",
    "description": "Accenture has scrapped its global diversity and inclusion goals after an evaluation of the U.S. political landscape, the Financial Times reported on Friday, citing a memo to the company's staff from CEO Julie Sweet.The company will start \"sunsetting\" the dive…",
    "link": "https://www.channelnewsasia.com/business/accenture-scraps-diversity-and-inclusion-goals-ft-reports-4924381",
    "timestamp": "2025-02-07T12:51:21Z"
  },
  {
    "title": "Accenture scraps diversity and inclusion goals, memo says",
    "description": ":Accenture has scrapped its global diversity and inclusion goals after an evaluation of the changing U.S. political landscape, according an internal memo seen by Reuters.The company will start \"sunsetting\" the diversity goals it set in 2017, along with career…",
    "link": "https://www.channelnewsasia.com/business/accenture-scraps-diversity-and-inclusion-goals-memo-says-4924381",
    "timestamp": "2025-02-07T12:51:21Z"
  },
  {
    "title": "House Democrat leaves congressional DOGE caucus, saying Musk is 'blowing things up'",
    "description": "Rep. Val Hoyle, D-Ore., said on Thursday that she is leaving the Congressional Department of Government Efficiency Caucus because Elon Musk’s role in the agency is “burning down the government and the law.\"",
    "link": "https://www.foxnews.com/politics/house-democrat-leaves-congressional-doge-caucus-saying-musk-blowing-things-up",
    "timestamp": "2025-02-07T12:50:52Z"
  },
  {
    "title": "Bill Gates 'little disappointed' with 'super smart' Elon Musk. Here's why",
    "description": "Billionaire philanthropist Bill Gates says he is a “little disappointed” by Elon Musk’s efforts to shutter the United States’ global aid agency. Bill Gates defended the U.S. Agency for International Aid (USAID), a key federal program that Musk announced was b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-bill-gates-elon-musk-usaid-closure-trump-bill-gates-little-disappointed-with-super-smart-elon-musk-heres-why/articleshow/118020081.cms",
    "timestamp": "2025-02-07T12:50:42Z"
  },
  {
    "title": "'Buy political influence': Trump pick Kash Patel accused of 'truly shocking' China scandal",
    "description": "Donald Trump's nominee for FBI director, Kash Patel, reportedly has made millions of dollars from a company notorious for human trafficking – which he has vowed to target if confirmed.A new review by Accountable.US of the Trump nominee's financial disclosure …",
    "link": "https://www.rawstory.com/kash-patel-china/",
    "timestamp": "2025-02-07T12:50:28Z"
  },
  {
    "title": "David Hogg Demands Elon Musk Be Fired and Replaced by Pete Buttigieg",
    "description": "David Hogg, the new vice chairman of the Democratic National Committee (DNC), has had enough of Elon Musk's ceaseless efforts to drain the swamp in Washington, DC, and restore accountability to those who have stewardship of U.S. taxpayer dollars.\nThe post Dav…",
    "link": "https://www.breitbart.com/politics/2025/02/07/david-hogg-demands-elon-musk-be-fired-and-replaced-by-pete-buttigieg/",
    "timestamp": "2025-02-07T12:48:11Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Can the week be over already? Indeed it is, at least what they call the “work week”, for it’s Friday, February 7, 2025, and it’s National Fettuccine Alfredo Day, one of my favorite pastas, though I make it with hollow bucatini noodles instead of fettuccine.  …",
    "link": "https://whyevolutionistrue.com/2025/02/07/friday-hili-dialogue-512/",
    "timestamp": "2025-02-07T12:45:06Z"
  },
  {
    "title": "Military Intel. Chief Binder: 'I did not speak out against Trump's plan'",
    "description": "Head of Military Intelligence Major-General Shlomi Binder said he did not speak out against Donald Trump's pla",
    "link": "https://www.jpost.com/breaking-news/article-841132",
    "timestamp": "2025-02-07T12:44:40Z"
  },
  {
    "title": "Musk DOGE Minion Resigns After WSJ Finds Racist Social Media",
    "description": "One of the Musk minions on DOGE resigned Thursday after The Wall Street Journal asked the White House about his connection to a social media account that advocated for racism and eugenics. Via CNBC.com:\nThe DOGE staffer, Marko Elez, earlier in the day had bee…",
    "link": "https://crooksandliars.com/2025/02/musk-doge-minion-resigns-after-wsj-finds",
    "timestamp": "2025-02-07T12:44:08Z"
  },
  {
    "title": "Fact check: Did Clinton set the precedent for mass federal worker buyouts?",
    "description": "In early 1990s, Clinton signed an act allowing $25,000 buyouts for federal workers. How does Trump's approach differ?",
    "link": "https://www.aljazeera.com/news/2025/2/7/fact-check-did-clinton-set-the-precedent-for-mass-federal-worker-buyouts",
    "timestamp": "2025-02-07T12:43:40Z"
  }
]