[
  {
    "title": "Canada’s Military Has Modeled Hypothetical US Invasion, Reports Say",
    "description": "Canada’s military has modeled how it would respond to an American invasion after President Donald Trump publicly talked about the country as a potential 51st state, according to a report in the Globe and Mail.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-military-has-modeled-hypothetical-us-invasion-reports-say",
    "timestamp": "2026-01-20T15:35:22Z"
  },
  {
    "title": "Wall Street slips after Trump threatens some NATO members with tariffs over Greenland",
    "description": "Stocks are falling on Wall Street after U.S. President Donald Trump threatened to hit eight NATO members with new tariffs as tensions escalate over his attempts to assert American control over Greenland.",
    "link": "https://www.cbc.ca/news/business/wall-street-stocks-trump-tariffs-nato-jan-20-9.7052595",
    "timestamp": "2026-01-20T15:35:01Z"
  },
  {
    "title": "Trump ties Greenland threat to failed Nobel Peace bid",
    "description": "‘I no longer feel an obligation to think purely of Peace,’ Trump said",
    "link": "https://theweek.com/politics/trump-ties-greenland-failed-nobel-prize-bid",
    "timestamp": "2026-01-20T15:33:51Z"
  },
  {
    "title": "Trump Pocketed ‘At Least $1.4 Billion’ in the Past Year — Shocking NY Times Editorial Reveals",
    "description": "A new editorial published by The New York Times headlined \"How Trump Has Pocketed $1,408,500,000\" leads with stunning accusation.\nThe post Trump Pocketed ‘At Least $1.4 Billion’ in the Past Year — Shocking NY Times Editorial Reveals first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-pocketed-at-least-1-4-billion-in-the-past-year-shocking-ny-times-editorial-reveals/",
    "timestamp": "2026-01-20T15:33:26Z"
  },
  {
    "title": "Trump inflation brag undercut as Congress shares astronomical costs for American families",
    "description": "A congressional report published Tuesday further undercut US President Donald Trump’s claim that he has defeated inflation\r\n, estimating that the average American family paid $1,625 in higher costs last year as the Republican president’s tariffs\r\n and broader…",
    "link": "https://www.rawstory.com/trump-inflation-brag-undercut-as-congress-shares-astronomical-costs-for-american-families/",
    "timestamp": "2026-01-20T15:31:52Z"
  },
  {
    "title": "Gold And Silver Hit Record Highs Amid U.S.-Europe Tension Over Greenland",
    "description": "Precious metals prices have continued a historic rally in the first weeks of 2026 as the United States’ push to acquire Greenland fosters global uncertainty, typically a contributor to higher metal prices.",
    "link": "https://www.forbes.com/sites/conormurray/2026/01/20/gold-and-silver-hit-record-highs-amid-us-europe-tension-over-greenland/",
    "timestamp": "2026-01-20T15:30:46Z"
  },
  {
    "title": "Supreme Court Again Doesn’t Rule on Tariffs as Wait Continues",
    "description": "The US Supreme Court didn’t rule on President Donald Trump’s tariffs Tuesday, meaning it probably will be at least another month before a challenge to his signature economic policy is resolved.",
    "link": "https://financialpost.com/pmn/business-pmn/supreme-court-again-doesnt-rule-on-tariffs-as-wait-continues",
    "timestamp": "2026-01-20T15:30:13Z"
  },
  {
    "title": "U.S. Supreme Court again doesn’t rule on tariffs as wait continues",
    "description": "The U.S. Supreme Court didn’t rule on Donald Trump’s tariffs Tuesday, meaning it probably will be at least another month of waiting. Read on",
    "link": "https://financialpost.com/news/supreme-court-again-doesnt-rule-on-tariffs",
    "timestamp": "2026-01-20T15:30:13Z"
  },
  {
    "title": "'It'll get figured out': Michigan border town missing Canadian customers 1 year into Trump 2.0",
    "description": "Talk of annexing Canada and steel tariffs that led to 1,000 layoff notices at Sault Ontario's largest employer saw Canadian crossings drop by almost 25 per cent in the last year, but Sault Michigan businesses say Canadian customers are slowly coming back.",
    "link": "https://www.cbc.ca/news/canada/sudbury/sault-ste-marie-border-crossing-trump-9.7051463",
    "timestamp": "2026-01-20T15:27:38Z"
  },
  {
    "title": "What’s next for Project 2025?",
    "description": "This story appeared in Today, Explained, a daily newsletter that helps you understand the most compelling news and stories of the day. Subscribe here. When Donald Trump took office last year, he brought Project 2025 to the White House with him.  The Heritage …",
    "link": "https://www.vox.com/today-explained-newsletter/475753/project-2025-2026-trump-administration",
    "timestamp": "2026-01-20T15:25:05Z"
  },
  {
    "title": "Epstein fiasco forces Morning Joe to demand answers: 'Who are they protecting?'",
    "description": "Reacting to a new motion from the Department of Justice to dismiss a request for an independent monitor to oversee the release of Jeffrey Epstein Files, the panel on MS NOW’s “Morning Joe” once again posed the question of who Attorney General Pam Bondi is pro…",
    "link": "https://www.rawstory.com/bondi-epstein-files-2674912038/",
    "timestamp": "2026-01-20T15:24:23Z"
  },
  {
    "title": "Palantir share price: PLTR stocks at Nasdaq fall big, company announces HD Hyundai deal",
    "description": "Palantir stocks today down as PLTR share price slid by over 1 per cent at Nasdaq.",
    "link": "https://economictimes.indiatimes.com/news/international/us/palantir-share-price-pltr-stocks-at-nasdaq-fall-big-company-announces-hd-hyundai-deal/articleshow/126822796.cms",
    "timestamp": "2026-01-20T15:23:58Z"
  },
  {
    "title": "Trump Praises Fox Reporter for Question as He Brags How Much NFL Coach’s Parents ‘Like Me’: ‘It’s Nice That You Asked!’",
    "description": "Trump praised Fox News' Paulina Dedaj for asking him about newly-hired NFL head coach John Harbaugh as he bragged about how much the coach's parents \"like me.\"\nThe post Trump Praises Fox Reporter for Question as He Brags How Much NFL Coach’s Parents ‘Like Me’…",
    "link": "https://www.mediaite.com/media/sports/trump-praises-fox-reporter-for-question-as-he-brags-how-much-nfl-coachs-parents-like-me-its-nice-that-you-asked/",
    "timestamp": "2026-01-20T15:23:36Z"
  },
  {
    "title": "Dow Jones crashes 700 points today: Why US stock market is down today? 5 Key reasons behind Dow crash",
    "description": "Dow Jones Crash today: U.S. stocks plunged as Trump threatened tariffs over Greenland acquisition. Dow fell 725 points, S&P 500 dropped 1.3%, Nasdaq slid 1.5%. Treasury yields surged, dollar weakened. European leaders warned of countermeasures. Nvidia, AMD, A…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dow-jones-crashes-700-points-today-why-us-stock-market-is-down-today-5-key-reasons-behind-dow-crash/articleshow/126819472.cms",
    "timestamp": "2026-01-20T15:22:45Z"
  },
  {
    "title": "Rep. Julia Letlow launches Louisiana Senate primary against Bill Cassidy",
    "description": "Rep. Julia Letlow announced Tuesday morning that she is running for Senate, after earning President Donald Trump's endorsement over the weekend for a Republican primary challenge against Sen.",
    "link": "https://www.nbcnews.com/politics/2026-election/rep-julia-letlow-launches-louisiana-senate-primary-bill-cassidy-rcna254950",
    "timestamp": "2026-01-20T15:21:44Z"
  },
  {
    "title": "Tariffs starting to bump up product prices, Amazon CEO tells CNBC",
    "description": "Jan 20 : Amazon.com is starting to see an uptick in product prices on its e-commerce platform as sellers respond to cost pressures stemming from U.S. President Donald Trump's tariffs, the tech giant's CEO, Andy Jassy, told CNBC on Tuesday.The company had pull…",
    "link": "https://www.channelnewsasia.com/business/tariffs-starting-bump-up-product-prices-amazon-ceo-tells-cnbc-5871441",
    "timestamp": "2026-01-20T15:21:37Z"
  },
  {
    "title": "The Pursuit of Endless Growth Will Only End in Destruction",
    "description": "Stan Cox\n\n\n\nIf the corporate and political powers carry on with business as usual, such growth will end in chaotic, violent collapse. \r\n\n\r\n\n\nThe post The Pursuit of Endless Growth Will Only End in Destruction appeared first on The Nation.",
    "link": "https://www.thenation.com/article/environment/degrowth-fossil-fuels-consumption/",
    "timestamp": "2026-01-20T15:19:07Z"
  },
  {
    "title": "U.S. Bank Stocks Fall As Investors Weigh Credit Card Rate Cap Deadline",
    "description": "U.S. bank stocks fell in morning trading in a broader market decline, as investors awaited clarity on whether the Trump admin's Jan. 20 deadline to implement a 10% cap on credit card interest rates will take effect.",
    "link": "https://www.huffpost.com/entry/us-bank-stocks-credit-card-trump_n_696f9b29e4b0a8d7589a0026",
    "timestamp": "2026-01-20T15:18:46Z"
  },
  {
    "title": "Trump unloads on allies as Davos showdown looms",
    "description": "Trump has made an astonishing series of attacks apparently designed to humiliate allies France, Britain and Canada.\nThe post Trump unloads on allies as Davos showdown looms appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/trump-unloads-on-allies-as-davos-showdown-looms/article",
    "timestamp": "2026-01-20T15:17:32Z"
  },
  {
    "title": "Is a new gambling trend driving us toward armageddon?",
    "description": "Billion-dollar prediction markets like Polymarket enable users to bet on everything from celebrity news to global warfare – what could go wrong?",
    "link": "https://www.dazeddigital.com/life-culture/article/69450/1/deadly-gambling-problem-prediction-market-polymarket-kalshi-armageddon-explainer?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=is-a-new-gambling-trend-driving-us-toward-armageddon",
    "timestamp": "2026-01-20T15:17:00Z"
  },
  {
    "title": "Wall Street’s ‘Fear Gauge’ Spikes To Highest Level Since November As Trump Escalates Greenland Threats",
    "description": "Trump said he would impose tariffs on European countries that deployed military personnel to Greenland.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/20/wall-streets-fear-gauge-spikes-to-highest-level-since-november-as-trump-escalates-greenland-threats/",
    "timestamp": "2026-01-20T15:16:16Z"
  },
  {
    "title": "CNN Projects $600 Million in Profit This Year, Down From $1 Billion in 2016",
    "description": "CNN remains a key financial contributor to Warner Bros. Discovery’s linear TV business, and the company expects the news network’s revenue to grow top-line revenue over the next five years — on the assumption that its direct-to-consumer streaming business wil…",
    "link": "https://variety.com/2026/tv/news/cnn-financial-projections-profit-revenue-wbd-netflix-sale-1236635392/",
    "timestamp": "2026-01-20T15:15:25Z"
  },
  {
    "title": "Bitcoin trader keeps $100K BTC target as gold price hits record $4,750",
    "description": "Bitcoin sellers entered at the Wall Street open to drive BTC price action below $90,000, but a six-figure price target stayed in play.",
    "link": "https://cointelegraph.com/news/bitcoin-trader-keeps-100k-btc-target-gold-price-hits-record-4750",
    "timestamp": "2026-01-20T15:13:57Z"
  },
  {
    "title": "Why We Can’t Let Go of John F. Kennedy Jr. and Carolyn Bessette-Kennedy",
    "description": "Meet Paul Anthony Kelly and Sarah Pidgeon, who bring the doomed pair back to life in Ryan Murphy’s ‘Love Story.’",
    "link": "https://www.vanityfair.com/hollywood/story/john-f-kennedy-jr-carolyn-bessette-kennedy-love-story",
    "timestamp": "2026-01-20T15:13:27Z"
  },
  {
    "title": "Trump Invites War Criminals to His “Board of Peace” Power Grab",
    "description": "Donald Trump’s proposed “Board of Peace” is already a farce, with many of the invited members having been accused of war crimes. Among the world leaders invited include Israel Prime Minister Benjamin Netanyahu and Russian President Vladimir Putin, who each ha…",
    "link": "https://newrepublic.com/post/205429/trump-war-criminals-board-peace",
    "timestamp": "2026-01-20T15:13:13Z"
  },
  {
    "title": "Fmr. Trump Deputy Spox Destroys President’s ‘Mentally Ill, Deranged’ Greenland Threats",
    "description": "Matthews praised Don Bacon as the GOP lawmaker who has shown the “most spine” on the issue but warning the president he will push for impeachment on the issue.\nThe post Fmr. Trump Deputy Spox Destroys President’s ‘Mentally Ill, Deranged’ Greenland Threats fir…",
    "link": "https://www.mediaite.com/media/tv/fmr-trump-deputy-spox-destroys-presidents-mentally-ill-deranged-greenland-threats/",
    "timestamp": "2026-01-20T15:12:32Z"
  },
  {
    "title": "Democrats Support Bill That Would Give ICE $10 Billion",
    "description": "The party has few good options for restraining ICE, which is flush with cash thanks to the passage of President Donald Trump’s One Big Beautiful Bill.",
    "link": "https://www.huffpost.com/entry/trump-ice-democrats-dhs_n_696f826ae4b02f48956d3a4d",
    "timestamp": "2026-01-20T15:12:31Z"
  },
  {
    "title": "Trump at Miami-Indiana football game. Did Melania, Barron or Ivanka attend?",
    "description": "Kai Trump, mom Vanessa, Ivanka and the president attended Miami-Indiana football game. Barron was notably absent. When was last public appearance of entire Trump family?",
    "link": "https://www.palmbeachpost.com/story/sports/2026/01/20/kai-trump-arm-broken-miami-football-game-barron-ivanka-vanessa/88262033007/",
    "timestamp": "2026-01-20T15:12:16Z"
  },
  {
    "title": "Sen. Gallego Tells Anderson Cooper: Trump Is 'Literally Insane'",
    "description": "Sen. Ruben Gallego, the Democratic senator from Arizona, told Anderson Cooper Monday night that he thinks President Donald Trump is literally “insane.” And what a relief it is, to hear someone in office say it.\n Gallego said there was no way to reason with Tr…",
    "link": "https://crooksandliars.com/2026/01/sen-gallego-tells-anderson-cooper-trump",
    "timestamp": "2026-01-20T15:11:29Z"
  },
  {
    "title": "Hospital Mergers Gain Momentum As Trump’s ‘Beautiful Bill’ Cuts Loom",
    "description": "Hospital merger and acquisition activity ended 2025 with momentum expected to continue as drastic cuts to Medicaid spending under Trump’s One Big Beautiful Bill Act loom.",
    "link": "https://www.forbes.com/sites/brucejapsen/2026/01/20/hospital-mergers-gain-momentum-as-trumps-beautiful-bill-cuts-loom/",
    "timestamp": "2026-01-20T15:10:35Z"
  },
  {
    "title": "Bush-Era Insider Warns GOP Of 'Big' Problem Ahead Of Midterms: 'We're Going To See It'",
    "description": "The Republican strategist warned his party that there's significantly \"diminishing\" support for President Donald Trump among one particular group.",
    "link": "https://www.huffpost.com/entry/karl-rove-big-problem-hispanic-vote-midterm-elections_n_696f4679e4b02f48956d201a",
    "timestamp": "2026-01-20T15:10:18Z"
  },
  {
    "title": "How Donald Trump broke Congress and rendered 'separation of powers' meaningless in just a year (Eric Garcia/The Independent)",
    "description": "Eric Garcia / The Independent:\nHow Donald Trump broke Congress and rendered ‘separation of powers’ meaningless in just a year  —  Republicans have largely rolled over for Trump and those who criticized him, like Marjorie Taylor Greene, have seen their politic…",
    "link": "https://www.memeorandum.com/260120/p36",
    "timestamp": "2026-01-20T15:10:00Z"
  },
  {
    "title": "Supreme Court tariff decision: How Trump administration could drag out timing of refund payments",
    "description": "A Supreme Court decision that Trump's tariffs are illegal means huge refund payments, but the government could drag out the process of making businesses whole.",
    "link": "https://www.cnbc.com/2026/01/20/supreme-court-trump-tariff-decision-refunds.html",
    "timestamp": "2026-01-20T15:09:59Z"
  },
  {
    "title": "Trump-Endorsed Julia Letlow Mounts Primary Bid Against Bill Cassidy",
    "description": "Rep. Julia Letlow entered her state's 2026 Senate race Tuesday to unseat Sen. Bill Cassidy just days after President Donald Trump publicly urged her to run.",
    "link": "https://dailycaller.com/2026/01/20/julia-letlow-bill-cassidy-louisiana-senate-trump/",
    "timestamp": "2026-01-20T15:08:33Z"
  },
  {
    "title": "Trump's 25 Percent Tariff on Chip Imports Is Really an Export Tax",
    "description": "The order imposes duties on China-bound AI chips if chipmakers don't invest in American semiconductor fabrication.",
    "link": "https://reason.com/2026/01/20/trumps-25-percent-tariff-on-chip-imports-is-really-an-export-tax/",
    "timestamp": "2026-01-20T15:08:11Z"
  },
  {
    "title": "Green Day Back Minneapolis Anti-ICE Protesters, Call Out Stephen Miller During ‘Holiday’",
    "description": "Green Day expressed solidarity with anti-ICE protesters in Minneapolis and called out Stephen Miller during a recent performance of 'Holiday.'",
    "link": "http://www.rollingstone.com/music/music-news/green-day-stephen-miller-minnesota-ice-protesters-1235501747/",
    "timestamp": "2026-01-20T15:07:39Z"
  },
  {
    "title": "Key moments from Trump’s first year back as US president",
    "description": "US President Donald Trump has repeatedly divided opinion at home and faced fierce criticism from overseas.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/20/key-moments-from-trumps-first-year-back-as-us-president",
    "timestamp": "2026-01-20T15:05:45Z"
  },
  {
    "title": "Ending GOP Authoritarianism Will Require Overcoming the Democratic Leadership",
    "description": "The past year has completely discredited any claim that choosing between the Democratic and Republican parties would be merely a matter of “pick your poison” with the same end result. In countless terrible ways, the last 12 months have shown that Donald Trump…",
    "link": "https://www.commondreams.org/opinion/corporate-democrats-trump",
    "timestamp": "2026-01-20T15:05:32Z"
  },
  {
    "title": "UK’s Reeves Urges ‘Cool Heads’ Amid Trump Clash Over Tariffs",
    "description": "Chancellor of the Exchequer Rachel Reeves said Britain wants to reduce tensions with the US over Donald Trump’s threat of tariffs, ahead of the US President’s arrival in Davos.",
    "link": "https://financialpost.com/pmn/business-pmn/uks-reeves-urges-cool-heads-amid-trump-clash-over-tariffs",
    "timestamp": "2026-01-20T15:04:18Z"
  },
  {
    "title": "Trump Shares Map Seemingly Suggesting Plans for U.S. Expansion Into 3 Foreign Territories",
    "description": "Donald Trump shared a worrying image that appeared to hint at plans for expanding the United States into three foreign territories. On Tuesday (January 20), the 79-year-old politician took to his social media platform, Truth Social, to share an edited photo o…",
    "link": "https://www.justjared.com/2026/01/20/trump-shares-map-suggesting-plans-for-us-expansion-into-3-territories-canada-greenland-venezuela/",
    "timestamp": "2026-01-20T15:02:25Z"
  },
  {
    "title": "Amazon’s CEO says tariffs are starting to ‘creep into’ pricing",
    "description": "Amazon CEO Andy Jassy says consumers are starting to see the impact of tariffs less than a year after President Donald Trump implemented sweeping fees on a range of imported goods. During an interview with CNBC, Jassy says the inventory Amazon and third-party…",
    "link": "https://www.theverge.com/news/864390/amazon-ceo-andy-jassy-tariffs-creep-into-pricing",
    "timestamp": "2026-01-20T15:01:40Z"
  },
  {
    "title": "Trump’s Resource Grabs Don’t Add Up",
    "description": "There is little justification for taking Venezuelan oil or Greenlandic minerals, but the U.S. leader insists.",
    "link": "http://foreignpolicy.com/2026/01/20/trump-resources-oil-rare-earths-economic-security/",
    "timestamp": "2026-01-20T15:00:38Z"
  },
  {
    "title": "Chicago kids are dying while Mayor Johnson fights Trump, ICE and reality",
    "description": "Chicago Mayor Brandon Johnson prioritizes immigration policy over local children's safety, citing despite the high number of school-age shootings since taking office in 2024.",
    "link": "https://www.foxnews.com/opinion/chicago-kids-dying-while-mayor-johnson-fights-trump-ice-reality",
    "timestamp": "2026-01-20T15:00:16Z"
  },
  {
    "title": "What has Greenland ever brought Denmark?",
    "description": "There is quiet admission that Danish perceptions of the island have parallels to how many English view Northern Ireland",
    "link": "https://www.irishtimes.com/world/europe/2026/01/20/what-has-greenland-ever-brought-denmark/",
    "timestamp": "2026-01-20T15:00:00Z"
  },
  {
    "title": "Iran Deploys Troops Across the Nation as Protests Subside Under Force",
    "description": "The usually bustling streets of Iran’s capital are largely empty as security forces reassert their control after crushing unprecedented protests against the country’s clerical rulers. Residents of Tehran describe a city under virtual martial law, with securit…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Iran-Deploys-Troops-Across-the-Nation-as-Protests-Subside-Under-Force.html",
    "timestamp": "2026-01-20T15:00:00Z"
  },
  {
    "title": "Trump Started the Year With Two Big Blows to Climate Progress",
    "description": "Donald Trump's administration started 2026 by removing the United States from several international climate organizations.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-starts-2026-big-blows-climate-progress-1235501742/",
    "timestamp": "2026-01-20T15:00:00Z"
  },
  {
    "title": "Ecopetrol Eyes Gas Imports if Trump Eases Venezuela Sanctions",
    "description": "Colombia’s state energy company is taking preliminary steps to resume importing natural gas from neighboring Venezuela in anticipation that the US will ease sanctions, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/ecopetrol-eyes-gas-imports-if-trump-eases-venezuela-sanctions",
    "timestamp": "2026-01-20T14:59:14Z"
  },
  {
    "title": "Four ways Trump has dismantled the ‘Deep State’ since inauguration",
    "description": "Cutting contracts, cutting employees and cutting funding",
    "link": "https://www.wnd.com/2026/01/four-ways-trump-has-dismantled-deep-state-since/",
    "timestamp": "2026-01-20T14:56:45Z"
  },
  {
    "title": "We Have A Nightmare: Donald Trump’s White House Begrudgingly Celebrates MLK Day, Bernice King Responds To Civil Rights Act Rhetoric",
    "description": "Trump admin's silence on MLK Day sparks criticism; activists condemn using King's legacy as 'surface level talking points'\nThe post We Have A Nightmare: Donald Trump’s White House Begrudgingly Celebrates MLK Day, Bernice King Responds To Civil Rights Act Rhet…",
    "link": "https://bossip.com/4291257/we-have-a-nightmare-donald-trumps-white-house-begrudgingly-celebrates-mlk-day-bernice-king-responds-to-civil-rights-act-rhetoric/",
    "timestamp": "2026-01-20T14:56:28Z"
  },
  {
    "title": "We Have A Nightmare: Donald Trump’s White House Begrudgingly Celebrates MLK Day, Bernice King Responds To Civil Rights Act Rhetoric",
    "description": "Trump admin's silence on MLK Day sparks criticism; activists condemn using King's legacy as 'surface level talking points'\nThe post We Have A Nightmare: Donald Trump’s White House Begrudgingly Celebrates MLK Day, Bernice King Responds To Civil Rights Act Rhet…",
    "link": "https://bossip.com/4291257/donald-trumps-white-house-begrudgingly-celebrates-mlk-day/",
    "timestamp": "2026-01-20T14:56:28Z"
  },
  {
    "title": "French leader fires jab at Trump from Davos stage: 'Crazy ideas'",
    "description": "French President Emmanuel Macron took an apparent jab at President Donald Trump while speaking at the World Economic Forum in Davos, Switzerland.Specifically, Macron appeared to be referencing Trump’s increasingly aggressive efforts to have the United States …",
    "link": "https://www.rawstory.com/emmanuel-macron/",
    "timestamp": "2026-01-20T14:55:56Z"
  },
  {
    "title": "Europe’s Response To Trump’s Greenland Tariffs Would Be ‘Unflinching,’ EU Leader Says",
    "description": "European leaders are criticizing President Donald Trump and his proposed tariffs, pledging solidarity with Greenland at the World Economic Forum.",
    "link": "https://www.forbes.com/sites/mikestunson/2026/01/20/europes-response-to-trumps-greenland-tariffs-would-be-unflinching-eu-leader-says/",
    "timestamp": "2026-01-20T14:55:31Z"
  },
  {
    "title": "‘He’s a T-Rex’: Gavin Newsom Urges Europeans to ‘Stand United’ Against ‘Wrecking Ball’ Trump",
    "description": "Newsom went absolutely scorched earth on President Trump and the European leaders who stand by while he puts a “wrecking ball” to the world.\nThe post ‘He’s a T-Rex’: Gavin Newsom Urges Europeans to ‘Stand United’ Against ‘Wrecking Ball’ Trump first appeared o…",
    "link": "https://www.mediaite.com/media/news/hes-a-t-rex-gavin-newsom-urges-europeans-to-stand-united-against-wrecking-ball-trump/",
    "timestamp": "2026-01-20T14:54:31Z"
  },
  {
    "title": "Gaza’s harsh conditions overshadow Board of Peace plan as world leaders gather in Davos",
    "description": "World leaders are gathering in Davos where President Donald Trump’s Gaza ceasefire plan is high on the agenda.",
    "link": "https://www.bostonherald.com/2026/01/20/gaza-trump-board-peace-davos/",
    "timestamp": "2026-01-20T14:53:55Z"
  },
  {
    "title": "Gold and silver's unstoppable record-setting tear continues as Trump stirs up new trade fears",
    "description": "Trump doubled down on his push to take over Greenland. Threats of new tariffs on a handful of EU countries has sparked a fresh slight to safe havens.",
    "link": "https://www.businessinsider.com/gold-silver-prices-trump-greenland-tariffs-eu-trade-2026-1",
    "timestamp": "2026-01-20T14:51:44Z"
  },
  {
    "title": "WEF 2026: Jharkhand CM Hemant Soren heads to Davos to participate in inter-ministerial panel",
    "description": "\"En route to the inter- Scaling Energy Systems Through Policy, Finance & Regional Leadership, discussing with the Chief Secretary on positioning Jharkhand as a global player in energy security,\" Soren posted on X.",
    "link": "https://economictimes.indiatimes.com/news/india/wef-2026-jharkhand-cm-hemant-soren-heads-to-davos-to-participate-in-inter-ministerial-panel/articleshow/126817583.cms",
    "timestamp": "2026-01-20T14:48:30Z"
  },
  {
    "title": "Scott Bessent contradicts Trump as he scrambles to clean up 'deranged' letter mess",
    "description": "Treasury Secretary Scott Bessent attempted to play clean up Tuesday in the wake of President Donald Trump’s “deranged\r\n” letter he penned this week that sent shockwaves across the globe\r\n.In doing so, he openly contradicted the president’s own words.Trump sen…",
    "link": "https://www.rawstory.com/scott-bessent-2674911838/",
    "timestamp": "2026-01-20T14:47:30Z"
  },
  {
    "title": "Trump's Greenland tariff threats could be upended by Supreme Court decision",
    "description": "The Supreme Court Trump tariff decision could decide the fate of President Trump's threat to tariff NATO nations over control of Greenland.",
    "link": "https://www.cnbc.com/2026/01/20/trump-greenland-tariffs-nato-supreme-court-decision.html",
    "timestamp": "2026-01-20T14:47:09Z"
  },
  {
    "title": "Tactical Rage: On Violence and Resistance in Minneapolis",
    "description": "The denizens of Minneapolis are currently undergoing a violent attack on and occupation of their city by over three thousand heavily armed ICE and Border Patrol agents dispatched to the city by the Trump administration, over the strenuous objections of Minnes…",
    "link": "https://www.commondreams.org/opinion/nonviolence-minnesota-ice",
    "timestamp": "2026-01-20T14:47:03Z"
  },
  {
    "title": "Seattle Mayor Proudly Admits She Is Not Seeking Probe Into Somali Scammers",
    "description": "Democratic Mayor Katie Wilson of Seattle declared during an interview that she wasn't asking for any probe into potential welfare fraud involving Somalis.",
    "link": "https://dailycaller.com/2026/01/20/seattle-mayor-proudly-admits-she-is-not-seeking-probe-into-somali-scammers/",
    "timestamp": "2026-01-20T14:47:00Z"
  },
  {
    "title": "Donroe",
    "description": "Trump is threatening 10% tariffs on several European nations unless Denmark agrees to sell Greenland, raising tensions with NATO allies.",
    "link": "https://reason.com/2026/01/20/donroe/",
    "timestamp": "2026-01-20T14:45:46Z"
  },
  {
    "title": "Michael Chandler speaks out after Dana White rules him out of Conor McGregor fight",
    "description": "Just when it seemed a fight between Michael Chandler and Conor McGregor was finally taking shape, the story took another unexpected turn last week. After Donald Trump announced that the UFC would hold an event on the White House lawn on June 14, McGregor quic…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5c73d253-cc44-4091-983b-d49d896fc1cb",
    "timestamp": "2026-01-20T14:43:41Z"
  },
  {
    "title": "Donroe",
    "description": "Plus: Saunas, steak, mandatory national service, rounding up mean internet posters, and more...",
    "link": "https://www.yahoo.com/news/articles/donroe-144037215.html",
    "timestamp": "2026-01-20T14:40:37Z"
  },
  {
    "title": "Trump's Europe Tariff Threat Sends Dollar Lower, Revives 'Sell America' Narrative",
    "description": "Trump's new tariff threats against Europe push the dollar lower and revive concerns over a potential \"Sell America\" trade.",
    "link": "https://www.ibtimes.com.au/trumps-europe-tariff-threat-sends-dollar-lower-revives-sell-america-narrative-1861166",
    "timestamp": "2026-01-20T14:40:07Z"
  },
  {
    "title": "Trump Issues Awful MLK Day Statement After Uproar Over His Silence",
    "description": "President Trump issued a flimsy, ill-defined proclamation on Rev. Dr. Martin Luther King Jr. Day at 8:15 p.m. after hours of silence—and criticism from the NAACP.“Dr. King pioneered a movement that would go on to triumphantly reaffirm our national conviction …",
    "link": "https://newrepublic.com/post/205426/trump-mlk-day-statement",
    "timestamp": "2026-01-20T14:40:01Z"
  },
  {
    "title": "Amazon CEO Jassy Says Tariffs Have Started To 'Creep' Into Prices",
    "description": "Amazon CEO Andy Jassy said President Donald Trump's sweeping tariffs are starting to be reflected in the price of some items, as sellers weigh how to absorb the shock of the added costs. From a report: Amazon and many of its third-party merchants pre-purchase…",
    "link": "https://news.slashdot.org/story/26/01/20/1411250/amazon-ceo-jassy-says-tariffs-have-started-to-creep-into-prices",
    "timestamp": "2026-01-20T14:40:00Z"
  },
  {
    "title": "UAE becomes early supporter of Trump's 'Board of Peace' with formal acceptance",
    "description": "The United Arab Emirates has joined US President Donald Trump's new 'Board of Peace'. Abu Dhabi is among the first to publicly support the initiative. The board aims to foster cooperation and stability. It will begin with the Gaza conflict. Other nations have…",
    "link": "https://economictimes.indiatimes.com/news/international/uae/uae-becomes-early-supporter-of-trumps-board-of-peace-with-formal-acceptance/articleshow/126817101.cms",
    "timestamp": "2026-01-20T14:39:44Z"
  },
  {
    "title": "Stocks fall as Trump threatens tariffs on European countries over Greenland",
    "description": "Stocks fall as Trump threatens tariffs on European countries over Greenlandgo.com",
    "link": "https://abcnews.go.com/Business/stocks-fall-trump-threatens-tariffs-european-countries-greenland/story?id=129377735",
    "timestamp": "2026-01-20T14:38:10Z"
  },
  {
    "title": "Dow Jones falls 600 points, S&P 500, Nasdaq drop over 1% as U.S.-Greenland standoff knocks sentiment",
    "description": "Wall ‍Street's ​main indexes ⁠opened sharply lower on Tuesday, as investors ‌were ‌spooked by renewed tariff ‌threats from President Donald Trump against Europe over control ​of Greenland.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/dow-jones-falls-600-points-sp-500-nasdaq-drop-over-1-as-u-s-greenland-standoff-knocks-sentiment/articleshow/126816522.cms",
    "timestamp": "2026-01-20T14:35:59Z"
  },
  {
    "title": "Macron decries 'bullies' as he urges Trump to suspend tariffs",
    "description": "\"We do prefer respect to bullies ... and we do prefer rule of law to brutality,\" Macron said at the World Economic Forum in Davos, Switzerland.",
    "link": "https://www.cnbc.com/2026/01/20/macron-decries-bullies-as-he-urges-trump-to-suspend-tariffs.html",
    "timestamp": "2026-01-20T14:35:57Z"
  },
  {
    "title": "Trump eyes Greenland — now Danes want to buy California in viral petition",
    "description": "A satirical petition proposes Denmark buy California. It has gained over 200,000 signatures. This comes after US President Donald Trump expressed interest in buying Greenland. The petition humorously suggests renaming California 'New Denmark'. It highlights t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-eyes-greenland-now-danes-want-to-buy-california-in-viral-petition/articleshow/126809997.cms",
    "timestamp": "2026-01-20T14:34:32Z"
  },
  {
    "title": "Rogue America Is Changing the Global Economic Outlook",
    "description": "Since the year began, US President Donald Trump has ramped up his aggression in the Western Hemisphere, including military intervention in Venezuela and threats to impose large sanctions on European Union countries that oppose US annexation of Greenland. Sudd…",
    "link": "https://www.project-syndicate.org/onpoint/rogue-america-is-changing-the-global-economic-outlook",
    "timestamp": "2026-01-20T14:34:04Z"
  },
  {
    "title": "A brutal 'Sell America' episode in stocks shows the market is starting to take Trump's Greenland threats seriously",
    "description": "The Dow tumbled more than 600 points on Tuesday as investors assessed the impact of Trump's intensifying push to take control of Greenland.",
    "link": "https://www.businessinsider.com/stock-market-today-greenland-trump-tariffsbonds-yen-carry-trade-2026-1",
    "timestamp": "2026-01-20T14:33:48Z"
  },
  {
    "title": "The Big Picture",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/rogue-america-is-changing-the-global-economic-outlook-doc-2026-01",
    "timestamp": "2026-01-20T14:33:12Z"
  },
  {
    "title": "Trump is dominating the Davos agenda and casting a chill over the global elite",
    "description": "Trump's ongoing threats against Europe over his desire to take over Greenland are a big talking point.",
    "link": "https://www.businessinsider.com/trump-dominates-davos-agenda-casting-chill-over-global-elite-greenland-tariffs-2026-1",
    "timestamp": "2026-01-20T14:32:12Z"
  },
  {
    "title": "American Democracy Is Showing Signs of Life",
    "description": "One year into Trump’s second term, the country’s institutions and civil society are still checking his authoritarian impulses.",
    "link": "https://www.theatlantic.com/ideas/2026/01/american-democracy-signs-life/685678/",
    "timestamp": "2026-01-20T14:31:16Z"
  },
  {
    "title": "Supreme Court weighs Trump's firing of the Fed's Lisa Cook by social media",
    "description": "WASHINGTON, Jan 20 (Reuters) - In the battle over President Donald Trump's effort to fire Federal ‌Reserve Governor Lisa Cook that is set to go before the U.S. Supreme Court on Wednesday, the justices may focus on the president's use of social media to carry …",
    "link": "https://www.thestar.com.my/news/world/2026/01/20/supreme-court-weighs-trump039s-firing-of-the-fed039s-lisa-cook-by-social-media",
    "timestamp": "2026-01-20T14:31:00Z"
  },
  {
    "title": "Trump Goes on Greenland Tirade in Truth Social Spree, Shares AI Map and Leaks Emmanuel Macron Texts",
    "description": "\"The U.K. giving away extremely important land is an act of GREAT STUPIDITY, and is another in a very long line of National Security reasons why Greenland has to be acquired,\" the president writes\nThe post Trump Goes on Greenland Tirade in Truth Social Spree,…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-greenland-truth-social-nato-emmanuel-macron/",
    "timestamp": "2026-01-20T14:29:32Z"
  },
  {
    "title": "Gaza’s harsh conditions overshadow Board of Peace plan as world leaders gather in Davos",
    "description": "DEIR AL-BALAH, Gaza Strip (AP) — A Palestinian baby died from hypothermia on Tuesday in the Gaza Strip, underscoring the grim humanitarian conditions in the ...",
    "link": "https://www.yahoo.com/news/articles/gaza-harsh-conditions-overshadow-board-142929103.html",
    "timestamp": "2026-01-20T14:29:29Z"
  },
  {
    "title": "'Make America Go Away' red caps become symbol of defiance in Greenland standoff",
    "description": "COPENHAGEN, Jan 20 (Reuters) - One ‌Copenhagen clothing store's tongue-in-cheek take on U.S. President Donald Trump's ‌red baseball caps has become an unlikely symbol of Danish ‌solidarity with Greenland, as protests mount over Trump's demands to buy the vast…",
    "link": "https://www.thestar.com.my/news/world/2026/01/20/039make-america-go-away039-red-caps-become-symbol-of-defiance-in-greenland-standoff",
    "timestamp": "2026-01-20T14:29:00Z"
  },
  {
    "title": "With threats to Greenland, Trump sets America on the road to conquest",
    "description": "President Donald Trump's ambition to acquire Greenland from Denmark is causing international concern. This move challenges decades of U.S. policy that supported territorial integrity. Trump's actions are seen by some as a return to imperialistic tendencies. A…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/with-threats-to-greenland-trump-sets-america-on-the-road-to-conquest/articleshow/126815602.cms",
    "timestamp": "2026-01-20T14:28:50Z"
  },
  {
    "title": "Trump Posts Private Messages From World Leaders Amid Anti-EU Rant",
    "description": "The president appears ready and willing to turn on some of America’s greatest allies in his quest to conquer Greenland.In a frenetic string of posts to Truth Social late Sunday night, Donald Trump skewered Britain and France, and released private messages sen…",
    "link": "https://newrepublic.com/post/205423/donald-trump-anti-eu-rant-private-messages-putin",
    "timestamp": "2026-01-20T14:26:48Z"
  },
  {
    "title": "5 Ways To Protect Your 401(k) From the ‘Trump Volatility’",
    "description": "Worried about volatility in the markets amid the Trump administration? Discover strategies to protect your 401(k) and stay steady through market swings.",
    "link": "https://finance.yahoo.com/news/5-ways-protect-401-k-142617026.html",
    "timestamp": "2026-01-20T14:26:17Z"
  },
  {
    "title": "Wall Street set to fall as US-Greenland standoff knocks sentiment",
    "description": "Wall Street's main indexes were set to open sharply lower on Tuesday (Jan 20), as investors were spooked by renewed tariff threats from President Donald Trump against Europe over control of Greenland.",
    "link": "https://www.channelnewsasia.com/business/wall-street-set-fall-us-greenland-standoff-knocks-sentiment-5871296",
    "timestamp": "2026-01-20T14:26:00Z"
  },
  {
    "title": "Kremlin confirms Davos talks with US delegation",
    "description": "Kirill Dmitriev will discuss Ukraine settlement and economic cooperation with the Americans, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631215-dmitriev-davos-us-ukraine/",
    "timestamp": "2026-01-20T14:24:43Z"
  },
  {
    "title": "Julia Letlow announces US Senate run",
    "description": "U.S. Rep. Julia Letlow, R-La., announced Tuesday morning that she is running for the U.S. Senate, challenging Republican incumbent Bill Cassidy. Letlow’s announcement made at Business Report’s Power Breakfast follows President Donald Trump’s endorsement for h…",
    "link": "https://www.businessreport.com/business/julia-letlow-announces-us-senate-run",
    "timestamp": "2026-01-20T14:24:29Z"
  },
  {
    "title": "American Inequality",
    "description": "Donald Trump sure continues to pay dividends for the American working class: Figures from the Bureau of Labor Statistics released earlier this month show that the labor share of the nation’s GDP hit the lowest point it’s been at since the BLS began measuring …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/american-inequality",
    "timestamp": "2026-01-20T14:23:19Z"
  },
  {
    "title": "Europe has five options for responding to Trump’s Greenland threats. None of them look good",
    "description": "The UK and Europe need a new strategy.",
    "link": "https://theconversation.com/europe-has-five-options-for-responding-to-trumps-greenland-threats-none-of-them-look-good-273885",
    "timestamp": "2026-01-20T14:22:17Z"
  }
]