[
  {
    "title": "Abortion Rights Defenders 'Sound the Alarms' Over RFK Jr. Attack on Mifepristone",
    "description": "Abortion rights defenders and scientists expressed deep concern after U.S. Health and Human Services Secretary Robert F. Kennedy Jr.'s remarks about mifepristone, a key medication used to end pregnancies, at a Wednesday congressional hearing.\n\nDuring the Sena…",
    "link": "https://www.commondreams.org/news/rfk-abortion-pill",
    "timestamp": "2025-05-15T16:53:58Z"
  },
  {
    "title": "After launching investigations, Ed Martin is suddenly facing an investigation of his own",
    "description": "Ed Martin, a hyper-partisan Trump loyalist, is confronting a disciplinary investigation that could, in theory, lead to him losing his law license.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ed-martin-investigation-disciplinary-counsel-rcna207060",
    "timestamp": "2025-05-15T16:53:56Z"
  },
  {
    "title": "Trump addresses troops at US’s largest Middle East military base",
    "description": "US President Donald Trump paid a visit to US troops stationed in Qatar.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/5/15/trump-addresses-troops-at-uss-largest-middle-east-military-base",
    "timestamp": "2025-05-15T16:53:20Z"
  },
  {
    "title": "Clinton-appointed federal judge blocks Trump admin from pulling foreign service workers' bargaining rights",
    "description": "A Clinton-appointed federal judge moved to block the Trump administration from targeting foreign service workers' collective bargaining rights.",
    "link": "https://www.foxnews.com/politics/clinton-appointed-federal-judge-blocks-trump-admin-pulling-foreign-service-workers-bargaining-rights",
    "timestamp": "2025-05-15T16:53:04Z"
  },
  {
    "title": "Sean Penn’s ‘Rough’ Appearance Sparks Concerns Following Podcast …",
    "description": "Reading Time: 3 minutesSean Penn's latest interview has sparked fears among fans.\nSean Penn’s ‘Rough’ Appearance Sparks Concerns Following Podcast … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/05/sean-penns-rough-appearance-sparks-concerns-following-podcast-interview/",
    "timestamp": "2025-05-15T16:51:22Z"
  },
  {
    "title": "Trump asks Apple not to build in India – media",
    "description": "Apple has been expanding its operations in India and is ramping up its local production in the country Read Full Article at RT.com",
    "link": "https://www.rt.com/india/617634-trump-asks-apple-india/",
    "timestamp": "2025-05-15T16:51:13Z"
  },
  {
    "title": "Are Republicans having trouble recruiting Senate candidates in the Trump era?",
    "description": "After major potential candidates for U.S. Senate races in 2026 passed on running, some Republicans wonder if they're struggling to recruit competitive Senate candidates.",
    "link": "https://abcnews.go.com/Politics/republicans-trouble-recruiting-senate-candidates/story?id=121724517",
    "timestamp": "2025-05-15T16:50:02Z"
  },
  {
    "title": "Trade War Means Higher Prices, Fewer Customers for This Vermont Distillery: 'It's Just Chaos'",
    "description": "From her distillery on the banks of Vermont's Mad River, Mimi Buttenheim is worried about a very different stream of madness—one that doesn't pour down",
    "link": "https://reason.com/2025/05/15/trade-war-means-higher-prices-fewer-customers-for-this-vermont-distillery-its-just-chaos/",
    "timestamp": "2025-05-15T16:50:00Z"
  },
  {
    "title": "NATO weighs a US demand to massively hike defense spending as some struggle to meet the current goal",
    "description": "The debate is heating up ahead of a June summit in the Netherlands.",
    "link": "https://www.bostonherald.com/2025/05/15/turkey-nato/",
    "timestamp": "2025-05-15T16:49:31Z"
  },
  {
    "title": "Roberts reins in Sotomayor when she takes over hearing, interrupts lawyer",
    "description": "Chief justice: 'Can I hear the rest of his answer?'",
    "link": "https://www.wnd.com/2025/05/roberts-reins-in-sotomayor-when-she-takes-over-hearing-interrupts-lawyer/",
    "timestamp": "2025-05-15T16:47:06Z"
  },
  {
    "title": "Iran Deal Would Require Nixing Ballistic Missile, UAV Programs – State Dept. Nominee",
    "description": "WASHINGTON (Sputnik) – There is a broad consensus within US President Donald Trump administration that any prospective agreement with Iran should mandate restrictions on Tehran's ballistic missile and UAV programs, Joel Rayburn, the nominee for US Assistant S…",
    "link": "https://sputnikglobe.com/20250515/iran-deal-would-require-nixing-ballistic-missile-uav-programs--state-dept-nominee-1122060528.html",
    "timestamp": "2025-05-15T16:47:01Z"
  },
  {
    "title": "Abortion-rights groups denounce censorship on Meta-owned apps in Latin America and beyond",
    "description": "All of a sudden, women contacting one of the biggest sources of information about abortion in Mexico through the encrypted messaging app WhatsApp were met with silence",
    "link": "https://abcnews.go.com/Technology/wireStory/abortion-rights-groups-denounce-censorship-meta-owned-apps-121843396",
    "timestamp": "2025-05-15T16:46:13Z"
  },
  {
    "title": "President Trump Says No Peace Until He Meets With Putin After Russian's No-Show at Turkey Peace Talks",
    "description": "Progress on Russia-Ukraine peace talks will depend on a leaders meeting with President Vladimir Putin, President Donald Trump said. \nThe post President Trump Says No Peace Until He Meets With Putin After Russian’s No-Show at Turkey Peace Talks appeared first …",
    "link": "https://www.breitbart.com/europe/2025/05/15/president-trump-says-no-peace-until-he-meets-with-putin/",
    "timestamp": "2025-05-15T16:45:27Z"
  },
  {
    "title": "Trump doesn't want Apple making iPhones in India: 'I had a little problem with Tim Cook'",
    "description": "President Donald Trump said he had a \"little problem\" this week with Apple CEO Tim Cook and the tech giant using facilities in India to make iPhones for sale in the United States.\nThe president recounted what he told Cook while giving remarks at an event in Q…",
    "link": "https://biztoc.com/x/1f76972fdc021974",
    "timestamp": "2025-05-15T16:44:35Z"
  },
  {
    "title": "DNC Trolls Trump With ‘Welcome To Qatar-a-Lago’ Banner",
    "description": "Palm Beach residents probably got some good laughs at Donald Trump’s expense Wednesday, thanks to some expert Democratic trolling. Jabbing at Trump’s outrageous plan to accept a $400 million jet from Qatar, the Democratic National Committee flew a “Welcome to…",
    "link": "https://crooksandliars.com/2025/05/dnc-trolls-trump-welcome-qatar-lago-banner",
    "timestamp": "2025-05-15T16:44:19Z"
  },
  {
    "title": "‘What are we gonna do?’: Fears mount over health cuts in Ohio",
    "description": "Northeast Ohio residents expressed their anxieties and shared the real-life consequences of federal health cuts.",
    "link": "https://www.cleveland.com/open/2025/05/what-are-we-gonna-do-fears-mount-over-health-cuts-in-ohio.html",
    "timestamp": "2025-05-15T16:44:02Z"
  },
  {
    "title": "Zelensky Believes Trump Put More Pressure on Ukraine than on Russia",
    "description": "Zelensky, who had previously rejected a ceasefire proposed by Russia, says that \"it is necessary to put pressure on the side that does not want to put an end to the war\"MOSCOW, May 15. /TASS/. US President Donald Trump has exerted more pressure on Ukraine tha…",
    "link": "https://freerepublic.com/focus/f-news/4317171/posts",
    "timestamp": "2025-05-15T16:43:16Z"
  },
  {
    "title": "Peace breakthrough unlikely as Putin declines to meet Zelenskyy in Turkey",
    "description": "Hopes for a breakthrough in peace talks between Russia and Ukraine dimmed as Putin sent a lower-level delegation to Turkey, while Zelensky criticized this as disrespectful and indicative of Russia's lack of seriousness. Trump further complicated matters by st…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/peace-breakthrough-unlikely-as-putin-declines-to-meet-zelenskyy-in-turkey/articleshow/121193714.cms",
    "timestamp": "2025-05-15T16:41:51Z"
  },
  {
    "title": "Stephen Miller re-emerges as an ‘untouchable’ force in Trump’s White House",
    "description": "Outside of President Donald Trump, no White House official has accumulated more influence in this administration than Stephen Miller.",
    "link": "https://www.nbcnews.com/politics/trump-administration/stephen-miller-untouchable-force-trump-white-house-rcna206180",
    "timestamp": "2025-05-15T16:41:37Z"
  },
  {
    "title": "‘The View’ Co-Hosts Try To Wrap Their Heads Around Why Trump Beat Hillary, Kamala Harris",
    "description": "\"The View\" co-hosts attempted to wrap their heads around why neither female presidential nominee could successfully defeat President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/15/the-view-trump-women-hillary-kamala-harris/",
    "timestamp": "2025-05-15T16:40:32Z"
  },
  {
    "title": "US overdose deaths plunged 27% last year",
    "description": "Drug overdose still 'remains the leading cause of death for Americans aged 18-44,' said the CDC",
    "link": "https://theweek.com/health/drug-overdose-deaths-decline",
    "timestamp": "2025-05-15T16:40:12Z"
  },
  {
    "title": "Trump Says There Will Be No Peace in Ukraine Until He Meets With Putin – During His Victorious Middle East Trip, US President Keeps an Eye on the Peace Negotiations in Istanbul",
    "description": "As US President Donald J.\nThe post Trump Says There Will Be No Peace in Ukraine Until He Meets With Putin – During His Victorious Middle East Trip, US President Keeps an Eye on the Peace Negotiations in Istanbul appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/trump-says-there-will-be-no-peace-ukraine/",
    "timestamp": "2025-05-15T16:40:08Z"
  },
  {
    "title": "Why The Qataris Are Happy To Dump Their 747 On Trump (Jeremy Bogaisky/Forbes)",
    "description": "Jeremy Bogaisky / Forbes:\nWhy The Qataris Are Happy To Dump Their 747 On Trump  —  The Qatari 747 that President Donald Trump would like to make the next Air Force One.  —  The president may be thirsting for a new four-engine jumbo jet, but many governments a…",
    "link": "https://www.memeorandum.com/250515/p73",
    "timestamp": "2025-05-15T16:40:00Z"
  },
  {
    "title": "Slog AM: Boeing Cash Grab, Cap Hill Crisis Center, and Ben & Jerry's Co-Founder Cuffed in Congress",
    "description": "The Stranger's morning news roundup.\n \n by Marcus Harrison Green\n \n \n \n Weather: Alright, so here’s the deal, today’s weather is basically Seattle saying, “Oh, you wanted sunshine?  How about some rain and 58 degrees instead?” For the next 7 days we’ll be tra…",
    "link": "https://www.thestranger.com/slog-am/2025/05/15/80058064/slog-am-boeing-cash-grab-cap-hill-crisis-center-and-ben-and-jerrys-co-founder-cuffed-in-congress",
    "timestamp": "2025-05-15T16:40:00Z"
  },
  {
    "title": "Deal In Pakistan With Links To Trump, Asim Munir Under Scrutiny: Report",
    "description": "A deal signed in Pakistan days before the terror attack in Jammu and Kashmir&#039;s Pahalgam and India&#039;s military response to it, Operation Sindoor, has reportedly come under scrutiny both in New Delhi and Washington over links to Donald Trump&#039;s fam…",
    "link": "https://www.ndtv.com/world-news/a-deal-in-pakistan-with-links-to-donald-trumps-family-asim-munir-under-scrutiny-report-8424070",
    "timestamp": "2025-05-15T16:39:36Z"
  },
  {
    "title": "Trump-Appointed Justice’s Quip Draws Laughter After Kagan Torpedoes Sauer In Court",
    "description": "Justice Neil Gorsuch drew laughter with a well-timed quip after Justice Elena Kagan torpeded Trump Solicitor General John Sauer during oral arguments.\nThe post Trump-Appointed Justice’s Quip Draws Laughter After Kagan Torpedoes Sauer In Court first appeared o…",
    "link": "https://www.mediaite.com/news/trump-appointed-justices-quip-draws-laughter-after-kagan-torpedoes-sauer-in-court/",
    "timestamp": "2025-05-15T16:38:43Z"
  },
  {
    "title": "Sheikh that owns $400M Qatari jet gifted to Trump embroiled in $20M luxury hotel spat",
    "description": "The Qatari sheikh gifting a $400 million plane that's slated to become Trump’s next Air Force One has also previously faced allegations of corruption and antisemitism.",
    "link": "https://nypost.com/2025/05/15/business/sheikh-that-owns-qatari-jet-gifted-to-trump-embroiled-in-20m-luxury-hotel-spat/",
    "timestamp": "2025-05-15T16:37:30Z"
  },
  {
    "title": "5 Takeaways From Oral Arguments on Universal Injunctions in Birthright Citizenship Case at the Supreme Court",
    "description": "The Supreme Court heard oral arguments Thursday on whether nationwide injunctions violate the Constitution, after lower courts have issued 40 nationwide injunctions against the second... Read More\nThe post 5 Takeaways From Oral Arguments on Universal Injuncti…",
    "link": "https://www.dailysignal.com/2025/05/15/5-takeaways-oral-arguments-universal-injunctions-birthright-citizenship-case-supreme-court/",
    "timestamp": "2025-05-15T16:37:02Z"
  },
  {
    "title": "Republicans Want to Raise Taxes Targeting 40 Million Immigrants",
    "description": "A new tax on money that migrants send to family members in their home countries is included in the GOP tax bill.",
    "link": "https://www.newsweek.com/republicans-remittances-tax-bill-immigrants-2072821",
    "timestamp": "2025-05-15T16:36:31Z"
  },
  {
    "title": "The GOP Hates You and Wants You to Have a Harder Life",
    "description": "Republicans in the House of Representatives voted out of committee early Wednesday morning legislation that would strip as many as 14 million Americans of their Medicaid-based healthcare, including millions of seniors in nursing homes and children living in p…",
    "link": "https://www.commondreams.org/opinion/gop-hates-you",
    "timestamp": "2025-05-15T16:36:08Z"
  },
  {
    "title": "Poilievre 'very disappointed' in government's decision to forgo a federal budget",
    "description": "Conservative Leader Pierre Poilievre said Thursday he is dismayed that the new Liberal government has decided to forgo a federal budget for now, saying Prime Minister Mark Carney promised Canadians a plan during the election campaign and he should deliver one…",
    "link": "https://www.cbc.ca/news/politics/poilievre-budget-very-disappointed-1.7535788",
    "timestamp": "2025-05-15T16:36:03Z"
  },
  {
    "title": "Coast Guard wants 2021 COVID-19 shot mandate declared unlawful",
    "description": "DHS Secretary Kristi Noem urged to follow lead of Pete Hegseth",
    "link": "https://www.wnd.com/2025/05/coast-guard-wants-2021-covid-19-shot-mandate-declared-unlawful/",
    "timestamp": "2025-05-15T16:34:14Z"
  },
  {
    "title": "U.S. Transportation Secretary: Air Travel Crisis at Newark Was Unacceptable | Opinion",
    "description": "President Donald Trump and I are committed to introducing a golden age of travel by making every day travel safer, smoother, and more affordable.",
    "link": "https://www.newsweek.com/us-transportation-secretary-air-travel-crisis-newark-was-unacceptable-opinion-2072709",
    "timestamp": "2025-05-15T16:33:44Z"
  },
  {
    "title": "'Oof': Legal experts shocked by Trump DOJ proposal revealed in big Supreme Court hearing",
    "description": "Legal experts listened to the oral arguments at the U.S. Supreme Court on Thursday, where the justices heard the case dealing with eliminating birthright citizenship. The Constitution guarantees that any person born on U.S. soil is a U.S. citizen. President D…",
    "link": "https://www.rawstory.com/birthright-citizenship-2672024689/",
    "timestamp": "2025-05-15T16:33:39Z"
  },
  {
    "title": "Trump Justice Department Makes Insane Claim About Obeying Court Orders",
    "description": "The Trump administration’s blatant disregard for court orders is not winning it any favor with the Supreme Court.\r\nJustice Elena Kagan called out the government’s attorneys Thursday, flaming Justice Department officials for being “dead wrong,” while asking th…",
    "link": "https://newrepublic.com/post/195307/donald-trump-justice-department-supreme-court-obeying-rulings",
    "timestamp": "2025-05-15T16:33:34Z"
  },
  {
    "title": "Green-Card Holder 'Forcibly' Removed From Flight by Border Agents",
    "description": "Records show that Yamal Said is being held in a Tarrant County facility in Texas on allegations of violating a restraining order.",
    "link": "https://www.newsweek.com/green-card-holder-forcibly-removed-flight-border-agents-2072800",
    "timestamp": "2025-05-15T16:33:31Z"
  },
  {
    "title": "South Africa's HIV program \"not collapsing\" after U.S. aid cuts, says minister",
    "description": "CAPE TOWN, May 15 (Xinhua) -- South African Health Minister Aaron Motsoaledi has dismissed concerns that the country's HIV/AIDS program is on the verge of collapse following the withdrawal of U.S. funding. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/16/south-africa039s-hiv-program-not-collapsing-after-us-aid-cuts-says-minister",
    "timestamp": "2025-05-15T16:33:00Z"
  },
  {
    "title": "FBI folds the public corruption squad that aided Jack Smith's Trump investigations",
    "description": "WASHINGTON — The FBI’s Washington Field Office is folding its federal public corruption squad, the same unit which aided Jack Smith’s special counsel investigation into now-President Donald Trump, three people familiar with the matter tell NBC News.",
    "link": "https://www.nbcnews.com/politics/justice-department/fbi-folds-public-corruption-squad-aided-jack-smiths-trump-investigatio-rcna207029",
    "timestamp": "2025-05-15T16:31:59Z"
  },
  {
    "title": "U.S. poised to dial back bank rules imposed in wake of 2008 crisis",
    "description": "United States authorities are preparing to announce one of the biggest cuts in banks' capital requirements for more than a decade. Read here",
    "link": "https://financialpost.com/financial-times/u-s-poised-to-dial-back-bank-rules-imposed-in-wake-of-2008-crisis",
    "timestamp": "2025-05-15T16:31:05Z"
  },
  {
    "title": "Report: President Trump's DHS Requests 20,000 National Guard Troops to Assist with Immigration",
    "description": "President Donald Trump's Department of Homeland Security (DHS) is reportedly asking for more than 20,000 National Guard members to assist with immigration.\nThe post Report: President Trump’s DHS Requests 20,000 National Guard Troops to Assist with Immigration…",
    "link": "https://www.breitbart.com/immigration/2025/05/15/report-president-trumps-dhs-requests-20000-national-guardsmen-to-assist-with-immigration/",
    "timestamp": "2025-05-15T16:30:34Z"
  },
  {
    "title": "Embattled House Dem Drops Trump Impeachment Effort Amid Backlash From His Own Party",
    "description": "DAILY CALLER NEWS FOUNDATION—Rep. Shri Thanedar, D-Mich., dropped his ill-fated effort to force the House to vote on his impeachment resolution against President Donald Trump... Read More\nThe post Embattled House Dem Drops Trump Impeachment Effort Amid Backla…",
    "link": "https://www.dailysignal.com/2025/05/15/embattled-house-dem-drops-trump-impeachment-effort-after-backlash-his-own-party/",
    "timestamp": "2025-05-15T16:30:00Z"
  },
  {
    "title": "India-US Trade Agreement Talks \"Progressing Very Well\": Commerce Secretary",
    "description": "Negotiations for the proposed bilateral trade agreement between India and the US are progressing &quot;very&quot; well and a team will soon be leaving for Washington to further give an impetus to the talks, a top government official said on Thursday.",
    "link": "https://www.ndtv.com/world-news/india-us-trade-agreement-talks-progressing-very-well-commerce-secretary-8423999",
    "timestamp": "2025-05-15T16:29:01Z"
  },
  {
    "title": "Honda's production shift due to U.S. tariffs could open export opportunities for Canadian plant",
    "description": "Honda Motor Co. Ltd.'s production shift due to U.S. tariffs could open export opportunities for its Canadian plant. Find out more.",
    "link": "https://financialpost.com/transportation/autos/honda-canada-export-opportunities-us-tariffs",
    "timestamp": "2025-05-15T16:27:39Z"
  },
  {
    "title": "Trump Says No Agreement Until He Meets Putin",
    "description": "President Donald Trump said “nothing is going to happen” on peace talks between Russia and Ukraine until he meets with Russian President Vladimir Putin, CNN reports. Said Trump: \"I don’t believe anything’s going to happen,",
    "link": "https://politicalwire.com/2025/05/15/trump-says-no-agreement-will-happen-until-he-meets-putin/",
    "timestamp": "2025-05-15T16:26:11Z"
  },
  {
    "title": "Israel ramps up strikes in Gaza, killing dozens, as Trump floats ‘freedom zone’ | CNN",
    "description": "The Israeli military intensified operations across Gaza Thursday, killing more than 100 people, and pledged to continue bombings as US President Donald Trump suggested establishing a “freedom zone” in the enclave.",
    "link": "https://www.cnn.com/world/middleeast/israel-strikes-gaza-killing-dozens-trump-floats-freedom-zone-intl",
    "timestamp": "2025-05-15T16:25:14Z"
  },
  {
    "title": "Grocery prices see biggest drop in 5 years as Trump policies take effect",
    "description": "'Dozen eggs cost less than $1.50 when Joe Biden entered office in 2021, but almost $5 when he left'",
    "link": "https://www.wnd.com/2025/05/grocery-prices-see-biggest-drop-in-5-years-as-trump-policies-take-effect/",
    "timestamp": "2025-05-15T16:25:12Z"
  },
  {
    "title": "Trump, US Army birthday bash plans include 25 Abrams tanks (Reuters)",
    "description": "Reuters:\nTrump, US Army birthday bash plans include 25 Abrams tanks  —  Twin celebrations of U.S. President Donald Trump's birthday and the Army's 250th anniversary will include as many as 25 tanks rolling through Washington in a celebration that will cost $2…",
    "link": "https://www.memeorandum.com/250515/p70",
    "timestamp": "2025-05-15T16:25:00Z"
  },
  {
    "title": "Trump hails ‘incredible culture’ as he tours Abu Dhabi’s Grand Mosque",
    "description": "President Donald Trump praised the Sheikh Zayed Grand Mosque in Abu Dhabi as “beautiful”.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/5/15/trump-hails-incredible-culture-as-he-tours-abu-dhabis-grand-mosque",
    "timestamp": "2025-05-15T16:24:44Z"
  },
  {
    "title": "GOP Senator Torches Trump’s ‘Big, Beautiful Bill’ on Fox: ‘We Can’t Afford to Cut Taxes!’",
    "description": "Sen. Ron Johnson (R-WI) slammed President Donald Trump's \"big beautiful bill\" during a Fox Business appearance, calling it \"false advertising.\"\nThe post GOP Senator Torches Trump’s ‘Big, Beautiful Bill’ on Fox: ‘We Can’t Afford to Cut Taxes!’ first appeared o…",
    "link": "https://www.mediaite.com/tv/gop-senator-torches-trumps-big-beautiful-bill-on-fox-we-cant-afford-to-cut-taxes/",
    "timestamp": "2025-05-15T16:24:44Z"
  },
  {
    "title": "Amy Coney Barrett Grills Trump Solicitor General On Whether or Not the Administration Will Obey Court Decisions",
    "description": "\"It was phrased to me, generally respect circuit precedent, but not necessarily in every case,\" replied John Sauer\nThe post Amy Coney Barrett Grills Trump Solicitor General On Whether or Not the Administration Will Obey Court Decisions first appeared on Media…",
    "link": "https://www.mediaite.com/politics/amy-coney-barrett-grills-trump-solicitor-general-on-whether-or-not-the-administration-will-obey-court-decisions/",
    "timestamp": "2025-05-15T16:23:30Z"
  },
  {
    "title": "Four in Five Canadians Believe Old US Relationship Is ‘Over,’ Poll Says",
    "description": "An overwhelming majority of Canadians believe the country’s relationship with the US has permanently changed, as President Donald Trump’s tariffs and sovereignty threats spark widespread fury in the northern nation.",
    "link": "https://financialpost.com/pmn/business-pmn/four-in-five-canadians-believe-old-us-relationship-is-over-poll-says",
    "timestamp": "2025-05-15T16:22:52Z"
  },
  {
    "title": "Theo Von Mocks Navy, Qatari Culture in Trump Warm-Up Speech for Troops",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDuring a visit to al-Udeid Air Base in Qatar on Thursday, President Donald Trump delivered a politically charged speech to U.S. and Qatari troops, declaring, \"We don't care if you're politically correct.\" That…",
    "link": "https://biztoc.com/x/63a6af8bd7f76043",
    "timestamp": "2025-05-15T16:22:38Z"
  },
  {
    "title": "Jaishankar reiterates Pak first initiated truce talk",
    "description": "Foreign Minister S Jaishankar’s statement comes after US President Donal Trump yet again asserted that he helped settle the tensions between India and Pakistan",
    "link": "https://www.thehindubusinessline.com/news/jaishankar-reiterates-pak-first-initiated-truce-talk/article69580603.ece",
    "timestamp": "2025-05-15T16:22:27Z"
  },
  {
    "title": "Smart politics or a publicity stunt? The man behind the latest effort to impeach Donald Trump",
    "description": "U.S. Rep. Shri Thanedar has introduced seven articles of impeachment against the Republican president.",
    "link": "https://www.bostonherald.com/2025/05/15/trump-impeachment-thanedar/",
    "timestamp": "2025-05-15T16:21:50Z"
  },
  {
    "title": "Theo Von Mocks Navy, Qatari Culture in Trump Warm-Up Speech for Troops",
    "description": "Among the most provocative moments, comedian Theo Von described snorting cocaine off a mixed-race baby's back.",
    "link": "https://www.newsweek.com/theo-von-mocks-navy-qatari-culture-trump-warm-speech-troops-2072844",
    "timestamp": "2025-05-15T16:20:42Z"
  },
  {
    "title": "‘The View’s Joy Behar Says It’s “Obvious” The Trump Admin Is Turning Away Refugees Because “They’re Not White”",
    "description": "\"They don't want them here,\" she claimed.",
    "link": "https://decider.com/2025/05/15/views-joy-behar-obvious-trump-admin-turning-away-refugees-not-white/",
    "timestamp": "2025-05-15T16:19:01Z"
  },
  {
    "title": "China keeps hold on rare earth metals after lifting some U.S. export curbs",
    "description": "China's lifting of export controls on 28 U.S. firms was part of a preliminary 90-day tariff pause.",
    "link": "https://www.cnbc.com/2025/05/15/china-trump-trade-deal-export-controls.html",
    "timestamp": "2025-05-15T16:18:40Z"
  },
  {
    "title": "Ukraine won’t survive a decade of conflict – Zelensky",
    "description": "Vladimir Zelensky has said he wants to meet with Vladimir Putin to discuss prisoner swaps and a ceasefire Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617631-zelensky-ukraine-wont-survive/",
    "timestamp": "2025-05-15T16:17:40Z"
  },
  {
    "title": "How To Put Together Your AI Dream Team",
    "description": "Also in the Forbes CIO newsletter: How to succeed at AI, Big Tech's Middle East trip with Trump, Klarna swaps AI for people, Colorado AI law doesn't get requested fixes.",
    "link": "https://www.forbes.com/sites/cio/2025/05/15/how-to-put-together-your-ai-dream-team/",
    "timestamp": "2025-05-15T16:17:07Z"
  },
  {
    "title": "The Man Who Helped Prove Biden Wasn’t Actually Running the Country",
    "description": "No other organization was a bigger thorn in the side of former President Joe Biden’s administration than the Oversight Project. The group sued the Biden... Read More\nThe post The Man Who Helped Prove Biden Wasn’t Actually Running the Country appeared first on…",
    "link": "https://www.dailysignal.com/2025/05/15/man-who-helped-prove-biden-wasnt-actually-running-country/",
    "timestamp": "2025-05-15T16:15:12Z"
  },
  {
    "title": "US-China trade war: From dishes to television — Will prices of household items imported from China rise?",
    "description": "US President Donald Trump is likely to speak with his Chinese counterpart, Xi Jinping, this weekend. This comes as American consumers remain concerned about the looming price hikes on imports from various parts of the world, especially China.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-china-trade-war-from-dishes-to-television-will-prices-of-household-items-imported-from-china-rise/articleshow/121193387.cms",
    "timestamp": "2025-05-15T16:15:00Z"
  },
  {
    "title": "Walmart says it will raise prices due to tariff costs after posting solid first quarter sales",
    "description": "NEW YORK (AP) — Walmart’s first-quarter profit slipped, and it said it must raise prices due to higher costs from tariffs implemented by President Donald Trump. The nation’s largest retailers posted strong quarterly sales Thursday and said it expects sales gr…",
    "link": "https://financialpost.com/pmn/walmart-says-it-will-raise-prices-due-to-tariff-costs-after-posting-solid-first-quarter-sales-2",
    "timestamp": "2025-05-15T16:14:54Z"
  },
  {
    "title": "Under of a cloud of tariffs, Walmart is the latest retailer to announce price hikes",
    "description": "NEW YORK (AP) — Volley after volley of tariffs — and at times on-again, off-again trade actions — have put companies around the world on edge. And a handful of major retailers have already raised prices across the U.S., or warned of future hikes. President Do…",
    "link": "https://financialpost.com/pmn/under-of-a-cloud-of-tariffs-walmart-is-the-latest-retailer-to-announce-price-hikes",
    "timestamp": "2025-05-15T16:14:41Z"
  },
  {
    "title": "Trump White House Reportedly Threatens Politico-Business Insider Over Critical Report About Don Jr.",
    "description": "The Trump White House is reportedly considering a probe into the parent company behind Politico and Business Insider after the latter published a report this week comparing Donald Trump Jr.’s business ventures to those of Hunter Biden. According to a report p…",
    "link": "https://www.mediaite.com/trump/trump-white-house-reportedly-threatens-politico-business-insider-over-critical-report-about-don-jr/",
    "timestamp": "2025-05-15T16:14:06Z"
  },
  {
    "title": "Iran using criminal gangs for hit jobs abroad, court papers show",
    "description": "Organised gangs are paid to carry out attacks and kidnappings, evidence uncovered by the BBC reveals.",
    "link": "https://www.bbc.com/news/articles/c308p0rjq9zo",
    "timestamp": "2025-05-15T16:13:44Z"
  },
  {
    "title": "FACT FOCUS: Trump blames other countries for high US drug prices. Experts say it’s not their fault",
    "description": "Foreign nations are incorrectly blamed for high prescription drug prices in the U.S.",
    "link": "https://www.bostonherald.com/2025/05/15/fact-check-trump-drug-prices/",
    "timestamp": "2025-05-15T16:13:29Z"
  },
  {
    "title": "Jaishankar counters Trump’s aggressive claims on India’s zero tariff commitments",
    "description": "US President Trump's tariff threats on India countered by Foreign Minister Jaishankar; trade deal negotiations ongoing.",
    "link": "https://www.thehindubusinessline.com/economy/jaishankar-counters-trumps-aggressive-claims-on-indias-zero-tariff-commitments/article69580313.ece",
    "timestamp": "2025-05-15T16:12:55Z"
  },
  {
    "title": "Funding cuts threaten HIV response efforts in South Africa",
    "description": "Viral load testing among high-risk groups in South Africa has dropped by as much as 21% in the past two months, according to official data Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/617611-funding-cuts-threaten-south-africa-hiv-response/",
    "timestamp": "2025-05-15T16:12:50Z"
  },
  {
    "title": "RFK Jr. Allies Launch Make America Healthy Again Institute to Bolster HHS Overhaul",
    "description": "Allies of Robert F. Kennedy Jr. gathered Thursday to launch the Make America Healthy Again Institute, an organization aiming to outsource the Health and Human... Read More\nThe post RFK Jr. Allies Launch Make America Healthy Again Institute to Bolster HHS Over…",
    "link": "https://www.dailysignal.com/2025/05/15/rfk-jr-allies-launch-make-america-healthy-again-institute-to-bolster-hhs-overhaul/",
    "timestamp": "2025-05-15T16:11:57Z"
  },
  {
    "title": "Trump wants Apple to stop making more iPhones in India",
    "description": "President Donald Trump told Apple CEO Tim Cook that he doesn’t want the company to move iPhone production to India. “I had a little problem with Tim Cook yesterday,” Trump said during his visit to Qatar. “You’re coming in with $500 billion, but now I hear you…",
    "link": "https://biztoc.com/x/d274410ce9a6d2c7",
    "timestamp": "2025-05-15T16:11:52Z"
  },
  {
    "title": "Democratic Senators Remove Trump-Targeting Provisions In Push To Pass Stablecoin Bill",
    "description": "Democratic Senators Remove Trump-Targeting Provisions In Push To Pass Stablecoin Bill\n \nThe US Senate could pass a key bipartisan stablecoin bill as soon as next week after removing language targeting President Donald Trump and his family’s sprawling crypto i…",
    "link": "https://biztoc.com/x/88e4371e1378fb70",
    "timestamp": "2025-05-15T16:11:13Z"
  },
  {
    "title": "On Nakba Day, Trump tours the Gulf as Gaza starves",
    "description": "77 years after the Nakba, one in five people in Gaza faces starvation as Israel blocks all aid.",
    "link": "https://www.aljazeera.com/program/the-take-2/2025/5/15/aje-onl-tt_pal_nakba2025_av_v2-150525",
    "timestamp": "2025-05-15T16:11:11Z"
  },
  {
    "title": "Donald Trump Ukraine Peace Plan Stonewalled by Putin",
    "description": "The Kremlin said there were no plans for Putin to attend talks with a Ukrainian delegation in Turkey.",
    "link": "https://biztoc.com/x/41af9b248b5c8eac",
    "timestamp": "2025-05-15T16:11:10Z"
  },
  {
    "title": "Trump asks Apple to stop moving iPhone production to India",
    "description": "(Bloomberg/Jordan Fabian and Sankalp Phartiyal) — Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.\nPresident Donald Trump said he’s asked Apple Inc.’s Tim Cook to stop …",
    "link": "https://biztoc.com/x/b2955553af245f09",
    "timestamp": "2025-05-15T16:11:06Z"
  },
  {
    "title": "Supreme Court Hears High-Stakes Case on Birthright Citizenship and Federal Courts’ Power",
    "description": "Justice Sonya Sotomayor and others pushed back against Solicitor General John Sauer, who argued for Trump against national injunctions.",
    "link": "https://time.com/7285669/supreme-court-birthright-citizenship-injunctoins-sauer/",
    "timestamp": "2025-05-15T16:10:47Z"
  },
  {
    "title": "DOJ Surpasses Major Fentanyl Milestone As Bondi Hits 100 Days In Office",
    "description": "The Department of Justice surpassed a major fentanyl milestone as Attorney General Pam Bondi hits 100 days in office and touts her work on curbing the crisis.",
    "link": "https://dailycaller.com/2025/05/15/attorney-general-pam-bondi-justice-department-fentanyl-seizure/",
    "timestamp": "2025-05-15T16:10:11Z"
  },
  {
    "title": "Musk Used State Department to Force Another Country to Get Starlink",
    "description": "The U.S. State Department is interfering with foreign countries on behalf of Elon Musk’s satellite internet business, according to a sweeping report published Thursday by ProPublica. \r\nState Department officials both in Washington and in Gambia have been aggr…",
    "link": "https://newrepublic.com/post/195297/elon-musk-state-department-force-country-starlink",
    "timestamp": "2025-05-15T16:09:22Z"
  },
  {
    "title": "Qatar Investing $10 Billion In U.S. Military Facility: See The List Of Deals Trump Announced In The Middle East",
    "description": "As Trump’s visit in Qatar came to a close, it had yet to formally present an offer for the megajet the country is expected to gift Trump.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/15/qatar-investing-10-billion-in-us-military-facility-see-the-list-of-deals-trump-announced-in-the-middle-east/",
    "timestamp": "2025-05-15T16:09:05Z"
  },
  {
    "title": "Kathy Griffin says Stephen Colbert made her cry after ‘ambush’ interview about severed Trump head photo",
    "description": "Griffin appeared on the late-night host’s talk show in 2018, where she was questioned about her controversial Trump photoshoot",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/kathy-griffin-stephen-colbert-trump-interview-b2751643.html",
    "timestamp": "2025-05-15T16:08:52Z"
  },
  {
    "title": "Gabbard fires intelligence chiefs after Venezuela report",
    "description": "Director of National Intelligence Tulsi Gabbard has fired the top two officials leading the National Intelligence Council",
    "link": "https://theweek.com/politics/gabbard-fires-senior-intelligence-officials",
    "timestamp": "2025-05-15T16:08:09Z"
  },
  {
    "title": "Donald Trump Ukraine Peace Plan Stonewalled by Putin",
    "description": "The Kremlin said there were no plans for Putin to attend talks with a Ukrainian delegation in Turkey.",
    "link": "https://www.newsweek.com/russia-trump-putin-ukraine-peace-2072703",
    "timestamp": "2025-05-15T16:06:11Z"
  },
  {
    "title": "Who The Hell Voted For More Dangerous Products, Exactly?",
    "description": "Oh please, free us to buy kitchen faucets that add friggin' LEAD to our water!",
    "link": "https://www.wonkette.com/p/who-the-hell-voted-for-more-dangerous",
    "timestamp": "2025-05-15T16:06:06Z"
  },
  {
    "title": "These Stocks Are The Biggest Winners From Trump’s Middle East Trip",
    "description": "Major U.S. stocks like Nvidia, Alphabet and Amazon rose amid President Donald Trump’s four-day trip to the Middle East, which ends Thursday after he announced deals wo...",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/15/these-stocks-are-the-biggest-winners-from-trumps-middle-east-trip/",
    "timestamp": "2025-05-15T16:05:57Z"
  },
  {
    "title": "Brian Kilmeade Questions Cozying Up to ‘Wanted Terrorist’ Syrian Prez Now That ‘He’s Got a Suit on and Trimmed Beard’",
    "description": "Brian Kilmeade questioned whether President Donald Trump should be getting close to Syrian President -- and once-wanted terrorist -- Ahmed al-Sharaa.\nThe post Brian Kilmeade Questions Cozying Up to ‘Wanted Terrorist’ Syrian Prez Now That ‘He’s Got a Suit on a…",
    "link": "https://www.mediaite.com/tv/brian-kilmeade-questions-cozying-up-to-wanted-terrorist-syrian-prez-now-that-hes-got-a-suit-on-and-trimmed-beard/",
    "timestamp": "2025-05-15T16:05:54Z"
  },
  {
    "title": "CNET's Daily Tariff Price Tracker: Prices Steady as Major Retailer Issues Warning",
    "description": "Check out CNET's tariff impact tracker is keeping tabs on price moves for several popular products as Walmart becomes one of the biggest retailers to warn of price hikes.",
    "link": "https://www.cnet.com/tech/cnets-daily-tariff-price-tracker-prices-steady-as-major-retailer-issues-warning/",
    "timestamp": "2025-05-15T16:05:00Z"
  },
  {
    "title": "Trump Renews Call for U.S. to “Take” Gaza, Turn it Into “Freedom Zone”",
    "description": "Trump: Terror Group Hamas is \"going to have to be dealt with.\"  \nThe post Trump Renews Call for U.S. to “Take” Gaza, Turn it Into “Freedom Zone”  first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-renews-call-for-u-s-to-take-gaza-turn-it-into-freedom-zone/",
    "timestamp": "2025-05-15T16:05:00Z"
  },
  {
    "title": "Would Make Gaza A \"Freedom Zone\", Says Donald Trump In Qatar",
    "description": "President Donald Trump on Thursday reiterated his desire to take over the Gaza Strip, telling a business roundtable in Qatar that the US would &quot;make it a freedom zone&quot; and arguing there was nothing left to save in the Palestinian territory.",
    "link": "https://www.ndtv.com/world-news/would-make-gaza-a-freedom-zone-says-donald-trump-in-qatar-8423817",
    "timestamp": "2025-05-15T16:03:32Z"
  },
  {
    "title": "CNBC's Inside India newsletter: Could border flare-ups threaten India investments?",
    "description": "Investors have strong confidence in India's strong economic fundamentals, yet they may be overlooking the risk from political willingness to escalate conflict.",
    "link": "https://www.cnbc.com/2025/05/15/cnbcs-inside-india-could-border-flare-ups-threaten-india-investments.html",
    "timestamp": "2025-05-15T16:03:14Z"
  },
  {
    "title": "'Concocting hoaxes': Casey DeSantis hits back at charity scandal claims",
    "description": "First Lady Casey DeSantis on Wednesday denounced the criticism about her Hope Florida charity program in her harshest terms to date, while maintaining that she remains open about a potential run next year to succeed her husband in office.\nThe DeSantises appea…",
    "link": "https://www.rawstory.com/concocting-hoaxes-casey-desantis-hits-back-at-charity-scandal-claims/",
    "timestamp": "2025-05-15T16:02:09Z"
  },
  {
    "title": "Water companies concerned drought might hamper sewage-dumping",
    "description": "",
    "link": "https://www.thedailymash.co.uk/news/environment/water-companies-concerned-drought-might-hamper-sewage-dumping-20250515257133",
    "timestamp": "2025-05-15T16:01:45Z"
  },
  {
    "title": "Putin Thoroughly Embarrasses Trump on Ukraine Peace Talks",
    "description": "It looks like Russian President Vladimir Putin isn’t traveling to Istanbul for talks with Ukrainian President Volodymyr Zelenskiy, dashing Donald Trump’s hopes.\r\nRussian Foreign Minister Sergey Lavrov poured cold water on the idea Thursday, calling Zelenskiy …",
    "link": "https://newrepublic.com/post/195298/putin-embarrasses-trump-russia-ukraine-peace-talks",
    "timestamp": "2025-05-15T16:01:20Z"
  }
]