[
  {
    "title": "The red state push to join the DC occupation",
    "description": "Republican governors are increasingly eager to volunteer their state's National Guard troops for Trump's ostensibly anti-crime siege of the nation's capital",
    "link": "https://theweek.com/politics/red-state-governors-dc-national-guard-trump",
    "timestamp": "2025-08-19T17:00:18Z"
  },
  {
    "title": "“Law and Order” President Trump Just Forced a Cop to Self-Deport",
    "description": "The Department of Homeland Security blamed local officials in Maine for using the department’s federal database to determine the employment eligibility of a police officer who was arrested by Immigration and Customs Enforcement last month, according to NBC Ne…",
    "link": "https://newrepublic.com/post/199267/donald-trump-maine-police-officer-self-deport",
    "timestamp": "2025-08-19T17:00:04Z"
  },
  {
    "title": "Report: Israel Rejects Hamas’ Partial Hostage Deal, Wants Release of All Captives",
    "description": "\"Israel remains consistent in its policy and demands the release of all 50 hostages.\"\nThe post Report: Israel Rejects Hamas’ Partial Hostage Deal, Wants Release of All Captives first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/report-israel-rejects-hamas-partial-hostage-deal-wants-release-of-all-captives/",
    "timestamp": "2025-08-19T17:00:01Z"
  },
  {
    "title": "'There is a High Likelihood She Could Be Killed': Fears Erupt Ghislaine Maxwell is a DEAD WOMAN WALKING Inside Texas 'Club Fed' — After Two Alleged Attempted Break-ins Aimed at Epstein's Convicted Madam",
    "description": "The convicted sex offender was transferred to the minimum-security prison camp after meeting with the deputy attorney general over two days.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-bryan-prison-camp-fears-life-attempted-break-in-gang-related-shooting/",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Trump Seeks Nobel Peace Prize With Two Diplomatic Deals",
    "description": "Barack Obama has one. So do Theodore Roosevelt, Woodrow Wilson, and Jimmy Carter. And it seems abundantly clear that Donald Trump is bucking for one too – a Nobel Peace Prize awarded to a sitting US president. Trump has gone on a peace-making offensive over t…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Seeks-Nobel-Peace-Prize-With-Two-Diplomatic-Deals.html",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Gaza and the Government: How to ‘grow a spine’ – Simon Wilson",
    "description": "OPINION: Even the horrors of war haven't stopped the Act tail wagging the Government dog.",
    "link": "https://www.nzherald.co.nz/nz/gaza-and-the-government-how-to-grow-a-spine-simon-wilson/F52X7FYXK5CELC7LWZPHDPO7RU/",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Rock Star Gives Brutal, Unexpected Take On Trump-Zelenskyy Meeting",
    "description": "The Rock and Roll Hall of Fame-bound singer just put the president on blast.",
    "link": "https://www.huffpost.com/entry/jack-white-trump-zelenskyy-meeting_n_68a48786e4b00feff7d12b4b",
    "timestamp": "2025-08-19T16:58:59Z"
  },
  {
    "title": "World leader softens up Trump with a gift he’s sure to love",
    "description": "Could this butter up the president?",
    "link": "https://www.nj.com/politics/2025/08/world-leader-softens-up-trump-with-a-gift-hes-sure-to-love.html",
    "timestamp": "2025-08-19T16:56:25Z"
  },
  {
    "title": "Map Shows States Where Mail-in Voting Is Most—and Least—Popular",
    "description": "Donald Trump on Monday announced that lawyers are preparing an executive order aimed at eliminating mail-in voting.",
    "link": "https://biztoc.com/x/d80ceacbaac221c4",
    "timestamp": "2025-08-19T16:55:02Z"
  },
  {
    "title": "As GOP governors deploy National Guard to D.C., they have the underlying policy backwards",
    "description": "At Donald Trump's behest, six Republican governors are sending Guard troops to Washington, D.C., though crime rates are actually higher in their own states.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/national-guard-troops-dc-states-rcna225859",
    "timestamp": "2025-08-19T16:55:01Z"
  },
  {
    "title": "Head of DOJ anti weaponization group calls on NY AG Letitia James to resign",
    "description": "Head of DOJ anti weaponization group calls on NY AG Letitia James to resigngo.com",
    "link": "https://abcnews.go.com/US/head-doj-anti-weaponization-group-calls-ny-ag/story?id=124780652",
    "timestamp": "2025-08-19T16:53:46Z"
  },
  {
    "title": "The first openly gay men's tennis player wants to make the sport more welcoming to queer athletes",
    "description": "As this year’s U.S. Open kicks off, USTA President Brian Vahaly, a former top-100 player, opens up about his coming-out journey and his approach to being an LGBTQ leader in sports.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/brian-vahaly-tennis-us-open-first-openly-gay-mens-player-safe-space-rcna225592",
    "timestamp": "2025-08-19T16:52:52Z"
  },
  {
    "title": "James Talarico's Chances of Beating Colin Allred in Texas Primary—Poll",
    "description": "A new poll showed that Allred could face a competitive primary if other Democrats jump into the Senate race.",
    "link": "https://www.newsweek.com/james-talarico-colin-allred-texas-primary-poll-2115792",
    "timestamp": "2025-08-19T16:47:56Z"
  },
  {
    "title": "Justice Department to begin giving Congress files from Jeffrey Epstein investigation, Comer says",
    "description": "It was not clear exactly which or how many documents might be produced or whether the FBI's cooperation with Congress reflected a broader change in posture.",
    "link": "https://www.pbs.org/newshour/politics/justice-department-to-begin-giving-congress-files-from-jeffrey-epstein-investigation-comer-says",
    "timestamp": "2025-08-19T16:47:19Z"
  },
  {
    "title": "Map Shows States Where Mail-in Voting Is Most—and Least—Popular",
    "description": "Donald Trump on Monday announced that lawyers are preparing an executive order aimed at eliminating mail-in voting.",
    "link": "https://www.newsweek.com/mail-ballots-state-map-trump-2115729",
    "timestamp": "2025-08-19T16:46:31Z"
  },
  {
    "title": "US broadens reach of steel and aluminum tariffs",
    "description": "The US has broadened the reach of its steel and aluminum tariffs, the Commerce Department said, impacting hundreds more products that contain both metals such as child seats, tableware and heavy equipment.",
    "link": "https://www.rte.ie/news/business/2025/0819/1529193-steel-aluminum-tariffs/",
    "timestamp": "2025-08-19T16:46:05Z"
  },
  {
    "title": "Trump's Ineffective D.C. Crackdown: Nearly 2,000 Officers Made Fewer Than 400 Arrests in 10 Days",
    "description": "Earlier this month, President Donald Trump took control of the police in Washington, D.C.\nOn August 11, Trump declared a \"crime emergency\" in D.C., ordering \"operational control of the Metropolitan Police Department\" (MPD) to be \"delegated to the Attorney Gen…",
    "link": "https://biztoc.com/x/410bce0f1b916621",
    "timestamp": "2025-08-19T16:44:09Z"
  },
  {
    "title": "Trump Jr.-Linked Thumzup Expands Into Dogecoin, Litecoin Mining With Dogehash Deal",
    "description": "Thumzup Media Corporation, a digital-asset treasury company backed by Donald Trump Jr., announced Tuesday it will acquire Dogehash Technologies, a Dogecoin (CRYPTO: DOGE) and Litecoin (CRYPTO: LTC) mining firm, in an all-stock transaction.\nThe deal, which wil…",
    "link": "https://biztoc.com/x/29dda8a395e9e7dc",
    "timestamp": "2025-08-19T16:44:03Z"
  },
  {
    "title": "Trump says Putin may not want to make a deal on Ukraine",
    "description": "WASHINGTON: US President Donald Trump said on Tuesday (Aug 19) he hoped Russia’s Vladimir Putin would move forward on ending the war in Ukraine but admitted the Kremlin leader may not want",
    "link": "https://www.channelnewsasia.com/world/trump-says-putin-may-not-want-make-deal-ukraine-5303046",
    "timestamp": "2025-08-19T16:44:00Z"
  },
  {
    "title": "Trump says no ground troops, but maybe air support, to back Ukraine peace deal",
    "description": "WASHINGTON: US President Donald Trump said on Tuesday (Aug 19) he ruled out putting US troops on the ground in Ukraine but said the United States might provide air support as part of a d",
    "link": "https://www.channelnewsasia.com/world/trump-says-no-ground-troops-maybe-air-support-ukraine-peace-deal-5303046",
    "timestamp": "2025-08-19T16:44:00Z"
  },
  {
    "title": "Trump taps Missouri AG to help lead FBI",
    "description": "What happened\nThe Justice Department said Monday that Missouri Attorney General Andrew Bailey, an ardent backer of President Donald Trump, had been appointed FBI co-deputy director. Bailey said he would resign as Missouri's top prosecutor to join conservative…",
    "link": "https://biztoc.com/x/878fd1508e78a833",
    "timestamp": "2025-08-19T16:43:37Z"
  },
  {
    "title": "Trump jokes Melania loves Barron ‘more than me’ in rare heartfelt tribute to first lady",
    "description": "During a White House conversation with President Zelensky, Donald Trump shared a personal anecdote, joking that Melania's affection for their son Barron might surpass her affection for him. He highlighted Melania's deep concern for Ukrainian children affected…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-jokes-melania-loves-barron-more-than-me-in-rare-heartfelt-tribute-to-first-lady/articleshow/123390548.cms",
    "timestamp": "2025-08-19T16:43:25Z"
  },
  {
    "title": "Riot (RIOT) Platforms Gets Boost From New EO",
    "description": "We recently published 10 Stocks Shine Brighter Than Wall Street. Riot Platforms, Inc. (NASDAQ:RIOT) is one of Monday’s top performers. Riot Platforms bounced...",
    "link": "https://finance.yahoo.com/news/riot-riot-platforms-gets-boost-164315646.html",
    "timestamp": "2025-08-19T16:43:15Z"
  },
  {
    "title": "Trump's Election Almost Convinced Mark Hamill To Make Extreme Move",
    "description": "The \"Star Wars\" icon revealed how the 2024 election left him considering a major life change during a new interview with The Times of London.",
    "link": "https://www.huffpost.com/entry/mark-hamill-leave-us-trump-election_n_68a3a4a2e4b00feff7d0bf39",
    "timestamp": "2025-08-19T16:43:12Z"
  },
  {
    "title": "Trump Doral makes return to PGA Tour with $20M purse Miami Championship in 2026",
    "description": "The PGA Tour announced Trump Doral will host the new Miami Championship signature event with a $20 million purse during the first weekend of May 2026.",
    "link": "https://www.foxnews.com/sports/trump-doral-makes-return-pga-tour-20m-purse-miami-championship-2026",
    "timestamp": "2025-08-19T16:42:59Z"
  },
  {
    "title": "PGA Tour ends decade-long absence from Trump-owned courses with Doral return in 2026",
    "description": "The PGA Tour will return to Donald Trump’s Blue Monster course in Miami next spring, ending a decade-long absence from Trump-owned venues. The Miami Championship, a $20m Signature Event scheduled for the first weekend in May 2026, will mark the 56th time the …",
    "link": "https://sports.yahoo.com/article/pga-tour-ends-decade-long-164218030.html",
    "timestamp": "2025-08-19T16:42:18Z"
  },
  {
    "title": "Trump offers assurances that US troops won’t be sent to help defend Ukraine",
    "description": "Trump also said Ukraine should give up on the hope of joining NATO.",
    "link": "https://www.bostonherald.com/2025/08/19/russia-ukraine-war-us-troops/",
    "timestamp": "2025-08-19T16:42:00Z"
  },
  {
    "title": "Mark Hamill Says He Wanted to Leave U.S. Due to Trump, but Won’t be Forced Out by ‘That Son of a Bitch’",
    "description": "Mark Hamill said he considered leaving the U.S. following Trump's reelection, but decided he won't be forced out by 'that son of a bitch.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/mark-hamill-wont-leave-us-america-trump-1235411157/",
    "timestamp": "2025-08-19T16:41:44Z"
  },
  {
    "title": "Canada: Failed Conservative Leader Pierre Poilievre Returns to Parliament in Wacky Special Election",
    "description": "Canadian Conservative Party leader Pierre Poilievre will return to Parliament in September after losing his own seat during the general election in which he campaigned to be prime minister, winning a special election with over 200 candidates on Monday.\nThe po…",
    "link": "https://www.breitbart.com/politics/2025/08/19/canada-failed-conservative-leader-pierre-poilievre-returns-to-parliament-in-wacky-special-election/",
    "timestamp": "2025-08-19T16:40:36Z"
  },
  {
    "title": "Exclusive -- Trump CFPB Closes Biden-Era Weaponized Investigation Against Public Square, Credova",
    "description": "The Consumer Financial Protection Bureau (CFPB) under Director Russ Vought on Tuesday closed a Biden-era investigation against Credova, a subsidiary of Public Square that provides consumer financing for firearms, believing this is yet another example of weapo…",
    "link": "https://www.breitbart.com/politics/2025/08/19/exclusive-trump-cfpb-closes-biden-era-weaponized-investigation-against-public-square-credova/",
    "timestamp": "2025-08-19T16:39:37Z"
  },
  {
    "title": "Pastor tests new IRS endorsement rule by backing AOC – and loses church",
    "description": "A Lutheran pastor in Wisconsin intended to test new Internal Revenue Service rules and endorse a candidate from the pulpit before his plan went wrong and left him without a church.The Rev. Jonathan Barker had planned to throw his support behind a Democratic c…",
    "link": "https://www.rawstory.com/irs-rules-church/",
    "timestamp": "2025-08-19T16:39:06Z"
  },
  {
    "title": "Trump course back on PGA schedule for 2026 season: tour",
    "description": "Donald Trump's famed Trump National Doral course will host a PGA Tour event next season, returning to the circuit after a 10-year absence, the tour confirmed on Tuesday.Trump's relationship with the PGA Tour has improved in recent years however, with the US l…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_db9e2884-0a2e-4a7b-889c-62448ffa313d",
    "timestamp": "2025-08-19T16:38:19Z"
  },
  {
    "title": "Trump taps Missouri AG to help lead FBI",
    "description": "Missouri Attorney General Andrew Bailey has been appointed FBI co-deputy director, alongside Dan Bongino",
    "link": "https://theweek.com/politics/trump-fbi-andrew-bailey-bongino-patel",
    "timestamp": "2025-08-19T16:37:36Z"
  },
  {
    "title": "Donald Trump Says He Will Go to Heaven If He Brokers Peace Between Russia and Ukraine",
    "description": "Donald Trump hears he's not going to get through the Pearly Gates ... but, he's got a foolproof plan to fix that -- and, it involves brokering peace between Russia and Ukraine. The President of the United States talked about the war and his recent…\n Permalink",
    "link": "https://www.tmz.com/2025/08/19/donald-trump-wants-go-heaven/",
    "timestamp": "2025-08-19T16:37:33Z"
  },
  {
    "title": "7 Lingering Questions After the Trump Ukraine Summit",
    "description": "After a flurry of diplomacy, what was actually agreed to?",
    "link": "http://foreignpolicy.com/2025/08/19/trump-ukraine-russia-summit-putin-zelensky/",
    "timestamp": "2025-08-19T16:35:56Z"
  },
  {
    "title": "Trump Shows Off ‘4 MORE YEARS’ Hat To Zelenskyy During Baffling White House Detour",
    "description": "Social media users slammed the president for showing the Ukrainian leader his collection of MAGA hats amid a high-stakes meeting on Monday.",
    "link": "https://www.huffpost.com/entry/trump-shows-off-his-hat-collection-to-zelenskyyduring-visit-from-european-leaders_n_68a472f5e4b00feff7d1233c",
    "timestamp": "2025-08-19T16:34:39Z"
  },
  {
    "title": "First biography from Oct. 7 hostage Eli Sharabi will reveal shocking abuse — and unimaginable news he learned after his release",
    "description": "\"Hostage,\" first published in Hebrew earlier this year, has become the fastest selling book in Israeli history.",
    "link": "https://nypost.com/2025/08/19/world-news/first-biography-by-oct-7-hostage-eli-sharabi-reveals-horror-abuse/",
    "timestamp": "2025-08-19T16:34:37Z"
  },
  {
    "title": "Zambian expert urges return to rule-based global trading system",
    "description": "LUSAKA, Aug. 19 (Xinhua) -- Countries need to return to a rule-based international trading system to ensure fairness and stability in global trade, a Zambian development expert has said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/zambian-expert-urges-return-to-rule-based-global-trading-system",
    "timestamp": "2025-08-19T16:34:00Z"
  },
  {
    "title": "North Korean Dictator Kim Jong-un Orders More Nuclear Weapons",
    "description": "North Korean dictator Kim Jong-un on Monday ordered a rapid buildup of nuclear weapons, ostensibly because recent joint military exercises between the United States and South Korea were an “obvious expression of their will to provoke war.”\nThe post North Kore…",
    "link": "https://www.breitbart.com/asia/2025/08/19/north-korean-dictator-kim-jong-un-orders-more-nuclear-weapons/",
    "timestamp": "2025-08-19T16:33:11Z"
  },
  {
    "title": "Target customers may soon flee to Walmart due to alarming change",
    "description": "Over the past few months, retailers across the country have been battling a growing threat. \nEarlier this year, President Donald Trump announced sweeping tariffs (taxes companies pay to import goods from overseas) on multiple countries to encourage more manuf…",
    "link": "https://biztoc.com/x/44dd321be993a9f4",
    "timestamp": "2025-08-19T16:32:39Z"
  },
  {
    "title": "Zelenskyy Gifts Trump Wounded Soldier’s Golf Club",
    "description": "Ukrainian President Volodymyr Zelenskyy offered President Donald Trump a golf club belonging to a wounded soldier during his Washington visit, Kyiv announced Tuesday. \nThe club once belonged to Kostiantyn Kartavtsev, a serviceman who lost a leg in the early m…",
    "link": "https://biztoc.com/x/97d5382a9eb4371c",
    "timestamp": "2025-08-19T16:32:15Z"
  },
  {
    "title": "Missouri Attorney General Andrew Bailey resigns to become co-deputy FBI director",
    "description": "Bailey pursued numerous lawsuits against former President Joe Biden's administration and has defended the state's anti-abortion regulations.",
    "link": "https://www.pbs.org/newshour/politics/missouri-attorney-general-andrew-bailey-resigns-to-become-co-deputy-fbi-director",
    "timestamp": "2025-08-19T16:32:02Z"
  },
  {
    "title": "Ugly Corn Photos on Social Media Show Risk Posed to Record US Crop",
    "description": "The US government is forecasting a record corn crop this year, but pictures of ugly-looking plants spreading fast through social media have triggered concern about the upcoming harvest. The photos show corn with missing kernels as a result of uneven …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/08/19/836292.htm",
    "timestamp": "2025-08-19T16:31:43Z"
  },
  {
    "title": "More Republican governors send National Guard to Washington, backing Trump",
    "description": "(Reuters) -Hundreds of additional National Guard troops are headed to Washington, D.C., from half a dozen Republican-led states, bolstering President Donald Trump's aggressive move to flood the city with soldiers and federal agents in what he says is an effor…",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/more-republican-governors-send-national-guard-to-washington-backing-trump",
    "timestamp": "2025-08-19T16:31:00Z"
  },
  {
    "title": "Texas State Rep. Nicole Collier Sleeps on House Floor After Refusing Republicans’ Demand for Law Enforcement Escort | Video",
    "description": "Crowds have gathered to show their support for Collier and demand her release\nThe post Texas State Rep. Nicole Collier Sleeps on House Floor After Refusing Republicans’ Demand for Law Enforcement Escort | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/texas-nicole-collier-spends-night-house-floor-republican-dps-escort/",
    "timestamp": "2025-08-19T16:30:59Z"
  },
  {
    "title": "New DC Arrest Stats Reportedly Spell Bad News For Media’s Latest Anti-Trump Narrative",
    "description": "The Trump administration's crime clampdown in partnership with local police in Washington, D.C., has focused especially on more dangerous areas of the district.",
    "link": "https://dailycaller.com/2025/08/19/new-dc-arrest-stats-reportedly-spell-bad-news-media-narrative-crime-crackdown/",
    "timestamp": "2025-08-19T16:30:38Z"
  },
  {
    "title": "This conversation is being recorded: Trump's hot mic moment is the latest in a long global list",
    "description": "Behold the power of the humble hot mic.  The magnifier of sound, a descendant of 150-year-old technology, on Monday added to its long history of cutting...",
    "link": "https://www.yahoo.com/news/articles/conversation-being-recorded-trumps-hot-163032388.html",
    "timestamp": "2025-08-19T16:30:32Z"
  },
  {
    "title": "Is this thing on? Accidental authenticity of Trump's hot mic moment is latest in a long global list",
    "description": "Is this thing on? Accidental authenticity of Trump's hot mic moment is latest in a long global listnews4jax.com",
    "link": "https://www.news4jax.com/news/world/2025/08/19/this-conversation-is-being-recorded-trumps-hot-mic-moment-is-the-latest-in-a-long-global-list/",
    "timestamp": "2025-08-19T16:30:32Z"
  },
  {
    "title": "‘Don’t see Putin very willing to get peace’, says French President Emmanuel Macron",
    "description": "Emmanuel Macron, who was one of the European leaders who accompanied Volodymyr Zelenskyy for his White House meeting, said if Donald Trump can help end the war, it would be great news.",
    "link": "https://indianexpress.com/article/world/dont-see-putin-very-willing-to-get-peace-french-president-emmanuel-macron-10199308/",
    "timestamp": "2025-08-19T16:30:26Z"
  },
  {
    "title": "Senate Banking Chair Tim Scott: 12-18 Dems May Vote for Market Structure Bill",
    "description": "The Senate only has a discussion draft out on market structure legislation so far, but Scott previously said he expects the bill to be done by the end of September.",
    "link": "https://www.coindesk.com/policy/2025/08/19/senate-banking-chair-tim-scott-12-18-dems-may-vote-for-market-structure-bill",
    "timestamp": "2025-08-19T16:30:18Z"
  },
  {
    "title": "Nvidia could be readying B30A accelerator for Chinese market — new Blackwell chip reportedly beats H20 and even H100 while complying with U.S. export controls",
    "description": "Nvidia is reportedly preparing two China-specific Blackwell accelerators — the B30A for AI training and the RTX 6000D for inference — that will outperform the HGX H20 and L20 PCIe while staying within U.S. export limits.",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-could-be-readying-b30a-accelerator-for-chinese-market-new-blackwell-chip-reportedly-beats-h20-and-even-h100-while-complying-with-u-s-export-controls",
    "timestamp": "2025-08-19T16:29:28Z"
  },
  {
    "title": "Finance industry seeks global crypto rule overhaul for banks",
    "description": "In a joint letter to the Basel Committee on Banking Supervision, the trade associations said policymakers should “seek updated information” on the use cases ...",
    "link": "https://finance.yahoo.com/news/finance-industry-seeks-global-crypto-162858018.html",
    "timestamp": "2025-08-19T16:28:58Z"
  },
  {
    "title": "Missouri Attorney General Tapped for FBI Post",
    "description": "Missouri state Attorney General Andrew Bailey has announced he will be joining the Trump administration as co-deputy director of the FBI. “I am proud to... Read More\nThe post Missouri Attorney General Tapped for FBI Post appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/19/missouri-attorney-general-named-fbi-role/",
    "timestamp": "2025-08-19T16:26:54Z"
  },
  {
    "title": "Why Steve Witkoff Is Trump’s Master of Disaster",
    "description": "The helpless envoy embodies everything that is dysfunctional about current U.S. foreign policy.",
    "link": "http://foreignpolicy.com/2025/08/19/steve-witkoff-trump-putin-russia-ukraine-war-diplomacy/",
    "timestamp": "2025-08-19T16:26:50Z"
  },
  {
    "title": "Taco Trump Caves On Russian Ceasefire",
    "description": "Donald Trump once again failed to take action on one of his fictitious deadlines when Russia refused to a cease-fire.\nImplementing the same ridiculous deadlines he proposes for his yo-yo tariffs, Trump now claims there is no need for a cease-fire to negotiate…",
    "link": "https://crooksandliars.com/2025/08/taco-trump-caves-russian-ceasefire",
    "timestamp": "2025-08-19T16:26:23Z"
  },
  {
    "title": "Trump tells Zelensky to ‘show flexibility’",
    "description": "The US president has been spearheading an attempt to end the conflict between Moscow and Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623282-trump-zelensky-meeting-flexibility/",
    "timestamp": "2025-08-19T16:26:14Z"
  },
  {
    "title": "Is Late Night TV Really Dying?",
    "description": "2026 will see the end of The Late Show, CBS's longest-running late-night talk show. The cancellation of this mainstay, which has been around since 1993 and is currently still the highest-rated in its time slot, has inspired much discourse regarding...\nRead mo…",
    "link": "https://www.pajiba.com/tv_reviews/is-late-night-tv-really-dying.php",
    "timestamp": "2025-08-19T16:26:11Z"
  },
  {
    "title": "Kim Jong Un slams South Korea-US drills during an inspection of his most powerful warship",
    "description": "North Korean leader Kim Jong Un has condemned South Korean-U.S. military drills and vowed to expand his nuclear forces rapidly",
    "link": "https://www.bostonherald.com/2025/08/19/kim-jong-un-slams-south-korea-us-drills/",
    "timestamp": "2025-08-19T16:25:35Z"
  },
  {
    "title": "S&P affirms US 'AA+' credit rating, cites tariff revenue",
    "description": "S&P Global on Monday affirmed its 'AA+' credit rating on the U.S., saying the revenue from President Donald Trump's tariffs will offset the fiscal hit from his recent tax-cut and spending bill. Trump signed the massive package of tax-cut and spending bill, du…",
    "link": "https://freerepublic.com/focus/f-news/4335452/posts",
    "timestamp": "2025-08-19T16:25:25Z"
  },
  {
    "title": "US wants equity stake in Intel for cash grants given under Biden",
    "description": "Officials in US President Donald Trump's administration made comments saying the equity stake was not to run the firm.",
    "link": "https://www.aljazeera.com/economy/2025/8/19/us-wants-equity-stake-in-intel-for-cash-grants-given-under-biden",
    "timestamp": "2025-08-19T16:24:57Z"
  },
  {
    "title": "A shipbuilding behemoth is rising in China. By scale, nothing else comes close.",
    "description": "The merger helps China consolidate its shipbuilding and centralize government control, putting it in a position to continue dominating the market.",
    "link": "https://www.businessinsider.com/chinas-shipbuilding-giant-getting-even-stronger-with-major-merger-2025-8",
    "timestamp": "2025-08-19T16:24:34Z"
  },
  {
    "title": "Lawmakers Will Get Some Epstein Files This Week From DOJ—Here’s What To Know",
    "description": "Rep. James Comer said Monday that documents should start being turned over on Friday—though whether they will be released to the public remains unclear.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/08/19/lawmakers-will-get-some-epstein-files-this-week-from-doj-heres-what-to-know/",
    "timestamp": "2025-08-19T16:24:08Z"
  },
  {
    "title": "Trump's Ineffective D.C. Crackdown: Nearly 2,000 Officers Made Fewer Than 400 Arrests in 10 Days",
    "description": "The federal takeover was nominally meant to protect D.C. residents from violent criminals run amok. But is that actually happening?",
    "link": "https://reason.com/2025/08/19/trumps-ineffective-d-c-crackdown-nearly-2000-officers-made-fewer-than-400-arrests-in-10-days/",
    "timestamp": "2025-08-19T16:24:01Z"
  },
  {
    "title": "Tether Recruits White House Crypto Vet Bo Hines",
    "description": "Tether has named one-time White House cryptocurrency figure Bo Hines to an advisory role. [contact-form-7] Hines has been named the stablecoin issuer’s strategic advisor for digital assets and U.S. strategy, Tether announced Tuesday (Aug. 19). This follows hi…",
    "link": "http://www.pymnts.com/personnel/2025/tether-recruits-white-house-crypto-vet-bo-hines/",
    "timestamp": "2025-08-19T16:22:57Z"
  },
  {
    "title": "Fox News' 'Dana Ding Dong Perino' mocked by Newsom after she lashes out at Trump jibes",
    "description": "Gov. Gavin Newsom's (D-CA) digital media team continued its trolling of President Donald Trump on Tuesday — but extended its attacks to include a Fox News host in its latest X posts. \"DANA 'DING DONG' PERINO (NEVER HEARD OF HER UNTIL TODAY!) IS MELTING DOWN B…",
    "link": "https://www.rawstory.com/gavin-newsom-dana-perino-2673900857/",
    "timestamp": "2025-08-19T16:22:41Z"
  },
  {
    "title": "Tiffany Haddish Dunks On Trump During ‘Jimmy Kimmel Live’ Guest Host Gig",
    "description": "Without saying President Donald Trump's name, Tiffany Haddish digs at the former business mogul as only she can.",
    "link": "https://hiphopwired.com/2811013/tiffany-haddish-dunks-on-trump-jimmy-kimmel-live/",
    "timestamp": "2025-08-19T16:21:34Z"
  },
  {
    "title": "Des Moines Paper Wonders How Tegna Deal Might Change Local TV Market",
    "description": "The proposed merger would conflict with current federal rules that prevent the ownership of two television stations in the same designated market area.",
    "link": "https://www.adweek.com/tvspy/des-moines-paper-wonders-how-tegna-deal-might-change-local-tv-market/",
    "timestamp": "2025-08-19T16:21:31Z"
  },
  {
    "title": "Donald Trump Deploys 3 Missile Destroyers: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe United States is deploying three Aegis guided-missile destroyers to waters off Venezuela as part of President Donald Trump's effort to counter Latin American drug cartels, according to a U.S. official brie…",
    "link": "https://biztoc.com/x/dfc605ed4720fa84",
    "timestamp": "2025-08-19T16:21:25Z"
  },
  {
    "title": "How the MAGA goon squad became tech lobbyists",
    "description": "Hello there, world! Welcome to the second issue of Regulator, a newsletter about the collision between Big Tech and Washington. If you enjoy this, consider subscribing to get this newsletter weekly and everything The Verge has to offer. Lobbying might be a du…",
    "link": "https://www.theverge.com/regulator-newsletter/761358/how-the-maga-goon-squad-became-tech-lobbyists",
    "timestamp": "2025-08-19T16:20:37Z"
  },
  {
    "title": "Texas Shows How Trump’s Anti-Green Moves Threaten a Red Economy",
    "description": "Deep-red Texas needs to build power plants at an astonishing speed and scale to keep its economy humming. President Donald Trump just made that much harder. So many data centers, crypto-mining operations and factories are planned for the Lone Star …",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/08/19/836275.htm",
    "timestamp": "2025-08-19T16:20:14Z"
  },
  {
    "title": "‘It’s a Bulls**t Statistic!’ Ex-Colbert Staffer Shoots Down Claim Host Refused to Invite Conservatives on Show",
    "description": "Former Colbert staffer Pete Dominick called accusations that Colbert avoided conservative guests \"bulls**t,\" denying numbers from a new report.\nThe post ‘It’s a Bulls**t Statistic!’ Ex-Colbert Staffer Shoots Down Claim Host Refused to Invite Conservatives on …",
    "link": "https://www.mediaite.com/media/podcasts/its-a-bullst-statistic-ex-colbert-staffer-shoots-down-claim-host-refused-to-invite-conservatives-on-show/",
    "timestamp": "2025-08-19T16:19:56Z"
  },
  {
    "title": "The Late-Night Mental Breakdown Continues – Jimmy Kimmel, Allow Me to Introduce You to Jimmy Kimmel",
    "description": "As many late-night talk show hosts (besides Greg Gutfeld) struggle to stay relevant, host Jimmy Kimmel recently displayed the insulated...",
    "link": "https://redstate.com/bradslager/2025/08/19/the-late-night-mental-breakdown-continues-jimmy-kimmel-allow-me-to-introduce-you-to-jimmy-kimmel-n2192971",
    "timestamp": "2025-08-19T16:17:17Z"
  },
  {
    "title": "President Trump: ‘I want to try and get to heaven if possible’",
    "description": "'I hear I'm not doing well. I hear I'm really at the bottom of the totem pole'",
    "link": "https://www.wnd.com/2025/08/president-trump-i-want-try-get-heaven-if/",
    "timestamp": "2025-08-19T16:16:34Z"
  },
  {
    "title": "Five takeaways from a week of Trump’s Ukraine diplomacy",
    "description": "Negotiations are in, a ceasefire is out, the EU is sidelined and Moscow is upping the ante Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623284-trump-putin-zelensky-eu/",
    "timestamp": "2025-08-19T16:15:05Z"
  },
  {
    "title": "Catherine Hanaway, ex-prosecutor and House speaker, named Missouri attorney general",
    "description": "Attorney General Andrew Bailey is resigning Sept. 8 to take a job with the Trump administration",
    "link": "https://www.stltoday.com/news/local/crime-courts/article_cbce1967-3e2e-41e6-bb5a-4653e442cbb5.html",
    "timestamp": "2025-08-19T16:15:00Z"
  },
  {
    "title": "Catherine Hanaway, ex-prosecutor and House speaker, named Missouri attorney general",
    "description": "Catherine Hanaway becomes the first woman attorney general in Missouri history.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_cbce1967-3e2e-41e6-bb5a-4653e442cbb5.html",
    "timestamp": "2025-08-19T16:15:00Z"
  },
  {
    "title": "Home Depot sales gain as shoppers opt for smaller projects",
    "description": "Home Depot is the first US big-box retailer to report earnings and investors are seeking clues on price shopping behaviour changes. Read on.",
    "link": "https://financialpost.com/investing/home-depot-sales-gain-shoppers-smaller-projects",
    "timestamp": "2025-08-19T16:14:26Z"
  },
  {
    "title": "Palestine was the problem with TikTok",
    "description": "In the last month, the war in Gaza has become an inescapable facet of the public consciousness as a new surge of images of Palestinian children - their faces impossibly sunken, their limbs reduced to skin and bone - flooded the internet. As the pictures becam…",
    "link": "https://www.theverge.com/features/761076/gaza-images-starvation-tiktok-ban",
    "timestamp": "2025-08-19T16:14:05Z"
  },
  {
    "title": "Donald Trump Deploys 3 Missile Destroyers: What to Know",
    "description": "The USS Gravely, USS Jason Dunham, and USS Sampson are expected to arrive in South America soon.",
    "link": "https://www.newsweek.com/donald-trump-missile-destroyers-venezuela-drug-cartels-2115786",
    "timestamp": "2025-08-19T16:13:03Z"
  },
  {
    "title": "Trump’s crusade against mail-in ballots isn’t doing Republicans any favors",
    "description": "Republican officials want their party's voters to cast their ballots through the mail. Donald Trump's weird crusade is stepping all over his party's message.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-crusade-mail-ballots-isnt-republicans-favors-rcna225844",
    "timestamp": "2025-08-19T16:12:07Z"
  },
  {
    "title": "No Tax on Social Security for Seniors? Trump Tax Policies Explained",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump pledged to end taxes on Social Security as part of the GOP's 'One Big Beautiful Bill' signed into law on July 4.\nThe exact wording of the law actually stipulates a $6,000 tax deduction f…",
    "link": "https://biztoc.com/x/fb1a405b290f3c93",
    "timestamp": "2025-08-19T16:10:17Z"
  },
  {
    "title": "Trump warms to Kyiv security deal in summit",
    "description": "What happened\nUkrainian President Volodymyr Zelenskyy met with President Donald Trump at the White House Monday before the two leaders were joined by the heads of NATO and key European allies who had flocked to Washington, D.C., to backstop Ukraine. All the l…",
    "link": "https://biztoc.com/x/ad6c976708b8d19f",
    "timestamp": "2025-08-19T16:10:03Z"
  },
  {
    "title": "From Crude Oil To Wheat, Commodities Trade Like The Ukraine-Russia War Is Over",
    "description": "Three and a half years after Russia's full-scale invasion of Ukraine sent shockwaves through global markets, commodity prices have largely reset. GLD ETF is ...",
    "link": "https://finance.yahoo.com/news/crude-oil-wheat-commodities-trade-161002199.html",
    "timestamp": "2025-08-19T16:10:02Z"
  },
  {
    "title": "Trump offers assurances that US troops won't be sent to help defend Ukraine",
    "description": "President Donald Trump is offering his assurances that U.S. troops won't be sent to help defend Ukraine against Russia. The Republican president on Monday did not rule out sending U.S. troops to join any such effort as he met with…",
    "link": "https://apnews.com/article/trump-russia-ukraine-war-defend-american-troops-85704282576324a36567798e9cb741ec",
    "timestamp": "2025-08-19T16:10:00Z"
  },
  {
    "title": "Trump Says Putin, Zelenskiy Must Be Flexible as He Pushes Summit",
    "description": "Donald Trump urged Russia’s Vladimir Putin and Ukraine’s Volodymyr Zelenskiy to show some “flexibility” as the US president accelerates his efforts to end the war in Ukraine and encourages the two leaders to hold a bilateral summit. #politics #russia #trump #…",
    "link": "https://biztoc.com/x/02db60d711d580e3",
    "timestamp": "2025-08-19T16:09:54Z"
  },
  {
    "title": "Donetsk don't-tell: Donald Trump forces Zelenskyy-Trump meeting but no word about captured territory",
    "description": "US News: TOI correspondent from Washington: MAGA supremo Donald Trump appears to have succeeded in propelling Ukraine's leader Volodymyr Zelenskyy -- backed by.",
    "link": "https://timesofindia.indiatimes.com/world/us/donetsk-dont-tell-donald-trump-forces-zelenskyy-trump-meeting-but-no-word-about-captured-territory/articleshow/123391151.cms",
    "timestamp": "2025-08-19T16:08:39Z"
  },
  {
    "title": "US soybean farmers urge Trump to make purchase deal with China",
    "description": "WASHINGTON (Reuters) -U.S. soybean farmers urged President Donald Trump in a Tuesday letter to reach a trade deal with China that secures significant soybean...",
    "link": "https://ca.finance.yahoo.com/news/us-soybean-farmers-urge-trump-160836384.html",
    "timestamp": "2025-08-19T16:08:36Z"
  },
  {
    "title": "California Republicans attempt to pause Democratic redistricting efforts",
    "description": "California Republican state lawmakers on Tuesday asked the California Supreme Court to delay key votes at the state capitol this week that would send newly proposed congressional district maps to voters later this fall.",
    "link": "https://www.kcra.com/article/california-republicans-supreme-court-democrats-redistring/65818781",
    "timestamp": "2025-08-19T16:08:02Z"
  },
  {
    "title": "Insider reveals secret White House plan to oust GOP dissenters",
    "description": "As Texas Republicans continue their efforts to hand President Donald Trump five more House seats\r\n through its redistricting campaign, speculation grows\r\n that Indiana’s GOP lawmakers may soon follow suit — and under the threat of being ousted from office, a …",
    "link": "https://www.rawstory.com/indiana-2673900748/",
    "timestamp": "2025-08-19T16:07:20Z"
  },
  {
    "title": "Bowman Focuses on Her Current Fed Role Including Rules Overhaul",
    "description": "US Federal Reserve Governor Michelle Bowman said she’s keeping her focus on the regulatory portfolio she has now, including plans to overhaul big-bank capital rules and to stamp out so-called debanking.",
    "link": "https://www.livemint.com/companies/news/bowman-focuses-on-her-current-fed-role-including-rules-overhaul-11755619627032.html",
    "timestamp": "2025-08-19T16:07:06Z"
  },
  {
    "title": "War triangle | Geopolitics with Katie Stallard",
    "description": "Yesterday, Ukraine’s president Volodymyr Zelensky arrived in Washington, flanked by seven European leaders, in order to meet with Donald Trump and push forward talks to end the war in Ukraine.This came just three days after Trump’s carefully choreographed mee…",
    "link": "https://shows.acast.com/newstatesman/episodes/war-triangle-geopolitics-with-katie-stallard",
    "timestamp": "2025-08-19T16:07:04Z"
  },
  {
    "title": "Trump Stresses He Won’t Put American Troops in Ukraine",
    "description": "Trump scheduled a meeting between Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin.\nThe post Trump Stresses He Won’t Put American Troops in Ukraine first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/trump-stresses-he-wont-put-american-troops-in-ukraine/",
    "timestamp": "2025-08-19T16:06:23Z"
  },
  {
    "title": "Fired US Copyright Chief Tells Federal Court To “Connect The Dots”",
    "description": "Attorneys for Shira Perlmutter, who is suing the Trump administration for what she argues is her illegal dismissal as U.S. Register of Copyrights, said in a memorandum that “the dots are not difficult to connect” between her office’s report on AI training, he…",
    "link": "https://www.publishersweekly.com/pw/by-topic/industry-news/libraries/article/98419-defiant-fired-copyright-chief-urges-federal-court-to-connect-the-dots.html",
    "timestamp": "2025-08-19T16:06:00Z"
  },
  {
    "title": "Three ways Trump is already trying to rig the midterms",
    "description": "Rachel Maddow on the ways Trump is trying to rig the midterms, including Republicans' redistricting battle, nullifying the census and barring mail-in voting.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-rig-midterm-elections-redistricting-mail-in-voting-census-rcna225826",
    "timestamp": "2025-08-19T16:05:54Z"
  }
]