[
  {
    "title": "Here It Is: Trump Administration’s 100 Day Achievements and Promises Kept",
    "description": "President Donald J. Trump’s first 100 days back in the Oval Office have drawn heavy criticism from Democrats and foreign governments—particularly those that no longer benefit from massive trade imbalances, free military protection, and one-sided tariffs and t…",
    "link": "https://www.thegatewaypundit.com/2025/04/trump-administration-100-day-achievements-promises-kept/",
    "timestamp": "2025-04-30T14:15:25Z"
  },
  {
    "title": "Microsoft President Urges Fast 'Resolution' Of Transatlantic Trade Tensions",
    "description": "Microsoft President Brad Smith called Wednesday for a swift resolution of trade tensions between the United States and Europe, during an interview with AFP in Brussels.",
    "link": "https://www.ibtimes.com/microsoft-president-urges-fast-resolution-transatlantic-trade-tensions-3771985",
    "timestamp": "2025-04-30T14:15:23Z"
  },
  {
    "title": "Here's what experts say about selling gold jewelry for cash",
    "description": "Gold prices hit record highs this month, signaling it may be a good time for consumers to sell jewelry and other physical gold. Here's what to know.",
    "link": "https://www.cnbc.com/2025/04/30/time-to-sell-gold-what-to-know-about-trading-jewelry-for-cash.html",
    "timestamp": "2025-04-30T14:15:10Z"
  },
  {
    "title": "Springfield, Ohio Residents Debate Trump’s First 100 Days | WSJ",
    "description": "President Donald Trump thrust the small city of Springfield, Ohio, into the center of the immigration conversation during the 2024 ...",
    "link": "https://biztoc.com/x/d158a2d3d45922d5",
    "timestamp": "2025-04-30T14:14:14Z"
  },
  {
    "title": "'This has NOTHING TO DO WITH TARIFFS': Trump washes hands of responsibility for US economy drop",
    "description": "Trump took no responsibility for the state of the economy and insisted that “this is Biden’s Stock Market, not Trump’s”.",
    "link": "https://www.thejournal.ie/donald-trump-economy-drop-tariffs-6691927-Apr2025/",
    "timestamp": "2025-04-30T14:12:59Z"
  },
  {
    "title": "Trump says ‘be patient’ as US economy shrinks",
    "description": "WASHINGTON - US President Donald Trump has urged Americans to be patient in the face of an unexpected first-quarter economic contraction, claiming his tariffs will eventually lead to a boom in the US economy.",
    "link": "https://www.bangkokpost.com/business/general/3014981/trump-says-be-patient-as-us-economy-shrinks",
    "timestamp": "2025-04-30T14:12:00Z"
  },
  {
    "title": "U.S. Economy Shrank In Trump's First 100 Days",
    "description": "The president blamed Joe Biden for a decline in gross domestic product partly caused by tariffs.",
    "link": "https://www.huffpost.com/entry/trump-gpd-recession-first-quarter_n_681224b9e4b064707614958d",
    "timestamp": "2025-04-30T14:11:59Z"
  },
  {
    "title": "US-Ukraine resource deal imminent – Bloomberg",
    "description": "The back-and-forth around the agreement has dragged on for months, with the US pushing to recoup its costs for supporting Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616559-us-ukraine-resource-deal-imminent/",
    "timestamp": "2025-04-30T14:11:49Z"
  },
  {
    "title": "Single Mom Waitress Left 'Shaking' by Enormous Tip",
    "description": "The restaurant's owner described the tip as \"life-changing.\"",
    "link": "https://www.newsweek.com/virginia-waitress-single-mom-huge-tip-2066079",
    "timestamp": "2025-04-30T14:10:37Z"
  },
  {
    "title": "Trump border pick accused of 'cover-up' over death of man beaten by US agents (Chris Stein/The Guardian)",
    "description": "Chris Stein / The Guardian:\nTrump border pick accused of ‘cover-up’ over death of man beaten by US agents  —  Former top official calls for Rodney Scott to be blocked from CBP role over handling of investigation into Anastasio Hernández Rojas's death  —  Rodn…",
    "link": "https://www.memeorandum.com/250430/p47",
    "timestamp": "2025-04-30T14:10:01Z"
  },
  {
    "title": "'They have to pay a price': Trump goes after New York Times for purported 'unlawful acts'",
    "description": "President Donald Trump issued a wall of text threatening criminal and civil penalties to media companies for how they covered last year's presidential election.The president posted a 316-word rant Wednesday morning on Truth Social alleging that Paramount, the…",
    "link": "https://www.rawstory.com/paramount-trump-lawsuit-nyt/",
    "timestamp": "2025-04-30T14:09:09Z"
  },
  {
    "title": "Ivan Timofeev: This late Soviet leader’s legacy is a warning to Trump",
    "description": "Unlike Mikhail Gorbachev, Trump has no illusions about being liked. That’s what makes his disruption more effective – and more volatile. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616547-ivan-timofeev-trump-gorbachev/",
    "timestamp": "2025-04-30T14:08:08Z"
  },
  {
    "title": "Trump's Crypto Sherpa Bo Hines Says Crypto Legislation on Target for Quick Completion",
    "description": "Strategists for two U.S. bills meant to create an oversight regime for crypto are setting out plans this week to pass legislation in the summer, Bo Hines, the White House official at the center of those efforts, told CoinDesk.\nHines, who President Donald Trum…",
    "link": "https://biztoc.com/x/4627098574b26bda",
    "timestamp": "2025-04-30T14:07:50Z"
  },
  {
    "title": "Guatemala gearing up to export avocados to US despite tariffs and delays",
    "description": "SAN MIGUEL DUENAS, Guatemala (AP) — Standing outside a massive new avocado packing plant recently and with the U.S. ambassador in attendance, Guatemala President Bernardo Arevalo connected the high-demand fruit with rural development and said the facility sig…",
    "link": "https://financialpost.com/pmn/guatemala-gearing-up-to-export-avocados-to-us-despite-tariffs-and-delays",
    "timestamp": "2025-04-30T14:07:45Z"
  },
  {
    "title": "U.S. economy shrinks 0.3%, the first drop in three years",
    "description": "The \n \n \n \n \n \n U.S. economy\n \n \n \n \n \n shrank at a 0.3 per cent annual pace from January through March, first drop in three years. It was slowed by a surge in imports as companies in the United States tried to bring in foreign goods before President \n \n \n \n …",
    "link": "https://biztoc.com/x/3b547fc6bd793e88",
    "timestamp": "2025-04-30T14:07:30Z"
  },
  {
    "title": "German growth better than expected but tariff turmoil looms",
    "description": "Germany's struggling economy grew faster than expected at the start of the year, data showed Wednesday, in a boost for the incoming government of conservative Friedrich Merz even as US tariffs threaten to derail the nascent recovery.",
    "link": "https://www.thelocal.de/20250430/german-growth-better-than-expected-but-tariff-turmoil-looms",
    "timestamp": "2025-04-30T14:06:22Z"
  },
  {
    "title": "Crypto and FinTech Execs: UK Needs to Be More Welcoming to Industry",
    "description": "Cryptocurrency and FinTech executives say Great Britain has become an unwelcoming place for their businesses. That’s according to a report Wednesday (April 30) by CNBC, citing interviews with industry leaders who say the United Kingdom risks losing companies …",
    "link": "https://www.pymnts.com/news/regulation/2025/crypto-and-fintech-execs-uk-needs-to-be-more-welcoming-to-industry/",
    "timestamp": "2025-04-30T14:06:18Z"
  },
  {
    "title": "Ukraine and US set to sign new minerals deal today",
    "description": "U.S. President Donald Trump has previously described such a pact as reimbursement for billions in American aid sent to help Kyiv against Russia's full-scale invasion.",
    "link": "https://www.politico.eu/article/ukraine-us-agree-new-minerals-deal/",
    "timestamp": "2025-04-30T14:05:19Z"
  },
  {
    "title": "Key Inflation Measure Slowed To Multiyear Low In March—But Tariff Bump On The Horizon",
    "description": "The Federal Reserve’s favored inflation yardstick has been above its 2% target for 49 consecutive months.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/30/inflation-slowed-to-multiyear-low-in-march-but-tariff-bump-on-the-horizon/",
    "timestamp": "2025-04-30T14:04:37Z"
  },
  {
    "title": "Is the race for clean energy losing momentum?",
    "description": "The US is pivoting back to fossil fuels, China is ramping up renewables, while Europe is trying to catch up.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/4/30/is-the-race-for-clean-energy-losing-momentum",
    "timestamp": "2025-04-30T14:04:09Z"
  },
  {
    "title": "Trump Refuses to Answer One Telling Question on Pete Hegseth",
    "description": "Donald Trump isn’t giving a clear answer regarding Secretary of Defense Pete Hegseth’s future. \r\nOn Tuesday, Trump sat for an interview with ABC News’s Terry Moran, who asked the president if he had “100 percent confidence in Pete Hegseth.” \r\nTrump’s reply di…",
    "link": "https://newrepublic.com/post/194596/trump-pete-hegseth-future",
    "timestamp": "2025-04-30T14:04:05Z"
  },
  {
    "title": "Guatemala gearing up to export avocados to US despite tariffs and delays",
    "description": "SAN MIGUEL DUEÑAS, Guatemala (AP) — Standing outside a massive new avocado packing plant recently and with the U.S. ambassador in attendance, Guatemala...",
    "link": "https://finance.yahoo.com/news/guatemala-gearing-export-avocados-us-140302710.html",
    "timestamp": "2025-04-30T14:03:02Z"
  },
  {
    "title": "Unwilling To Give Trump Their Lunch Money, Universities Decide To Resist Instead",
    "description": "That old 'hang together or hang separately' line still applies.",
    "link": "https://www.wonkette.com/p/unwilling-to-give-trump-their-lunch",
    "timestamp": "2025-04-30T14:01:23Z"
  },
  {
    "title": "Donald Trump bluntly tells Terry Moran ‘I don’t trust you’ as the two spar over first 100 days",
    "description": "President Donald Trump repeatedly criticized ABC News journalist Terry Moran and his employer in a combative interview about his administration's first 100 days.",
    "link": "https://www.foxnews.com/media/donald-trump-bluntly-tells-terry-moran-i-dont-trust-you-two-spar-over-first-100-days",
    "timestamp": "2025-04-30T14:00:59Z"
  },
  {
    "title": "Uzbekistan agrees to pay for and accept 131 Central Asian illegal immigrants in landmark agreement",
    "description": "The Trump administration struck a deal to deport over 100 illegal immigrants from Central Asia to Uzbekistan at no cost to the U.S., setting a new model for immigration enforcement.",
    "link": "https://www.foxnews.com/politics/immigrants-return-uzbekistan",
    "timestamp": "2025-04-30T14:00:30Z"
  },
  {
    "title": "‘I’m not the one making this decision’: President Bystander strikes again",
    "description": "Confronted with key questions about life-or-death issues, Donald Trump continues to offer the public a lot of shrugged shoulders and blank stares.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-abrego-garcia-ms-13-abc-news-interview-rcna203688",
    "timestamp": "2025-04-30T14:00:29Z"
  },
  {
    "title": "San Francisco in Crisis: Viral Video Exposes Chaos Under Democrat Rule",
    "description": "San Francisco, once a symbol of innovation, culture, and prosperity on America’s West Coast, is in the midst of a crisis that has been brought to light by a viral video.\nThe post San Francisco in Crisis: Viral Video Exposes Chaos Under Democrat Rule appeared …",
    "link": "https://gatewayhispanic.com/video/san-francisco-in-crisis-viral-video-exposes-chaos-under-democrat-rule/",
    "timestamp": "2025-04-30T14:00:20Z"
  },
  {
    "title": "For One Vietnamese Refugee Family, April 30 Signifies a Day of Loss and Rebirth",
    "description": "Cooking miến gà, the comforting Vietnamese soup, in their California kitchen, they reflect on what they lost to the war and what they gained by fleeing to the United States.",
    "link": "https://www.kqed.org/news/12037893/for-one-vietnamese-refugee-family-april-30-signifies-day-of-loss-rebirth",
    "timestamp": "2025-04-30T14:00:07Z"
  },
  {
    "title": "Map and List of Cities Hosting 50501 Protests Against Trump on May 1",
    "description": "Hundreds of cities are hosting protests for 50501's latest campaign. Here's what to know.",
    "link": "https://www.newsweek.com/map-list-cities-may-day-50501-protests-trump-2065323",
    "timestamp": "2025-04-30T14:00:01Z"
  },
  {
    "title": "The Prison Where Trump Thinks He Can Send Anyone He Wants Became Famous for a Bizarre Reason",
    "description": "For people who make videos about extreme places, the CECOT pitch was irresistible.",
    "link": "https://slate.com/life/2025/04/cecot-prison-el-salvador-bukele-abrego-garcia.html",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "Rubio Warns U.S. May Withdraw from Ukraine Talks",
    "description": "US Secretary of State Marco Rubio warned on April 29 that unless Russia and Ukraine put forward specific plans for ending the war in Ukraine, the United States will curtail its efforts to mediate. State Department spokeswoman Tammy Bruce cited Rubio as saying…",
    "link": "https://oilprice.com/Geopolitics/International/Rubio-Warns-US-May-Withdraw-from-Ukraine-Talks.html",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "The use of trigger warnings on social media: a text analysis study of X",
    "description": "Trigger warnings are placed at the beginning of potentially distressing content to provide individuals with the opportunity to avoid the content before exposure. Social media platforms use artificial intelligence to add automatic trigger warnings to certain i…",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0322549",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "Microsoft Vows Legal Fight Against US To Protect European Cloud Customers",
    "description": "Microsoft has pledged to take the US government to court if necessary [alternative source] to protect European customers' access to its cloud services, as concerns mount over potential technology disruptions under President Donald Trump. Brad Smith, Microsoft…",
    "link": "https://slashdot.org/story/25/04/30/1322253/microsoft-vows-legal-fight-against-us-to-protect-european-cloud-customers",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "Topical fluoride hesitancy and opposition are significantly and positively associated: A cross-sectional study",
    "description": "The goal of this study was to evaluate the associations between topical fluoride hesitancy and opposition to determine if hesitancy is a potential precursor to opposition. We administered an 85-item survey (11/2020-09/2021) to 1,135 caregivers that included t…",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0322027",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "Live Around the Planet: Wednesday April 30th",
    "description": "UPPESTDATE! If you missed today's edition of Mark's Clubland Q&A live around the planet, the action replay can be heard in full here. UPPERDATE! We're live now, so let's have at it! UPDATE! We'll be going live in about fifteen minutes, so do get ready",
    "link": "https://www.steynonline.com/15250/live-around-the-planet-wednesday-april-30th",
    "timestamp": "2025-04-30T14:00:00Z"
  },
  {
    "title": "'I'll run': CNN's Scott Jennings dishes about Senate seat at 'bougie espresso party'",
    "description": "CNN's Scott Jennings is considering a race to replace Sen. Mitch McConnell as Kentucky senator.The MAGA mouthpiece has been mentioned as a potential candidate in a growing Republican primary field as the successor to the longtime GOP Senate leader, who is ret…",
    "link": "https://www.rawstory.com/scott-jennings-kentucky-senate/",
    "timestamp": "2025-04-30T13:59:38Z"
  },
  {
    "title": "Türkiye welcomes Trump's attitude that 'takes into account its sensitivities': Erdoğan",
    "description": "Türkiye welcomes U.S. President Donald Trump's attitude that \"takes into account its sensitivities,\" President Recep Tayyip Erdoğan said on Wednesday, adding they understand each other as two leaders on Syria issue.",
    "link": "https://www.hurriyetdailynews.com/turkiye-welcomes-trumps-attitude-that-takes-into-account-its-sensitivities-erdogan-208669",
    "timestamp": "2025-04-30T13:59:27Z"
  },
  {
    "title": "France links Russian APT28 to attacks on dozen French entities",
    "description": "France blames Russia-linked APT28 for cyberattacks targeting or compromising a dozen French government bodies and other entities. The Russia-linked APT28 group has targeted or compromised a dozen government organizations and other French entities, the French …",
    "link": "https://securityaffairs.com/177238/apt/france-links-russian-apt28-to-attacks-on-dozen-french-entities.html",
    "timestamp": "2025-04-30T13:58:30Z"
  },
  {
    "title": "Local elections this week are a key test for Britain's Trump ally Nigel Farage",
    "description": "Local elections in England this week are a key test for Nigel Farage",
    "link": "https://abcnews.go.com/International/wireStory/local-elections-week-key-test-britains-trump-ally-121316885",
    "timestamp": "2025-04-30T13:58:29Z"
  },
  {
    "title": "Trump Is Convinced This Is The Only Reason Putin Won't Take The Whole Of Ukraine",
    "description": "Last week, the president issued a rare rebuke of Putin while later suggesting that the Russian leader may not be serious about wanting peace.",
    "link": "https://www.huffpost.com/entry/trump-putin-ukraine-war_n_681215d7e4b017983e24fc89",
    "timestamp": "2025-04-30T13:57:48Z"
  },
  {
    "title": "The 6 ways Trump has been a gift to the meat industry",
    "description": "President Donald Trump’s first 100 days in office have been a gift to a sector of the economy that gets little attention but has enormous social and economic consequences: the US meat industry. While Congress and both Republican and Democratic administrations…",
    "link": "https://www.vox.com/future-perfect/410733/trump-meat-agriculture-100-days",
    "timestamp": "2025-04-30T13:57:26Z"
  },
  {
    "title": "Trump Blames Biden for Disastrous Q1 Economic News: ‘NOTHING TO DO WITH TARIFFS’",
    "description": "President Trump has responded to news of the first contraction of the US economy since 2022 in an entirely predictable manner: blaming former President Biden.\nThe post Trump Blames Biden for Disastrous Q1 Economic News: ‘NOTHING TO DO WITH TARIFFS’ first appe…",
    "link": "https://www.mediaite.com/trump/trump-blames-biden-for-disastrous-q1-economic-news-nothing-to-do-with-tariffs/",
    "timestamp": "2025-04-30T13:57:10Z"
  },
  {
    "title": "Shimano scraps custom clothing line due to “increasing competition, shifting retailer priorities, and supply chain challenges”, leading to 13 job losses",
    "description": "The Japanese bike components giant also announced that it would be scaling back its regular cycling apparel range as part of organisational changes",
    "link": "https://road.cc/content/news/shimano-scraps-custom-clothing-line-and-cuts-13-jobs-313781",
    "timestamp": "2025-04-30T13:56:51Z"
  },
  {
    "title": "Highlights from Donald Trump's '100 days of greatness' speech",
    "description": "Highlights from Donald Trump's '100 days of greatness' speech\nIn a speech celebrating the first 100 days of his presidential term, Donald Trump addressed his polarizing immigration moves, DEI, gender, inflation, and tariffs.\nIn a speech celebrating the first …",
    "link": "https://biztoc.com/x/f978efa45eeb20fc",
    "timestamp": "2025-04-30T13:56:33Z"
  },
  {
    "title": "Why Trump, at the 100-day mark, is relying so heavily on gaslighting",
    "description": "President Donald Trump arrives to deliver a speech marking his 100th day in office at Macomb County Community College Sports Expo Center in Warren, Mich., on April 29, 2025.",
    "link": "https://biztoc.com/x/84ccd3cacf98b99b",
    "timestamp": "2025-04-30T13:56:28Z"
  },
  {
    "title": "D.L. Hughley Claps at Saquon Barkley For Golfing With Trump, But Did He Go Too Far?",
    "description": "D.L. Hughley, Saquon Barkley, Donald Trump\r\nPhoto: Getty Images (Getty Images)\r\nD.L. Hughley did not mince words when speaking about the Black folks whom he says pander to President Donald Trump...and there’s one Super Bowl LIX champion he’s calling out speci…",
    "link": "https://www.theroot.com/d-l-hughley-claps-at-saquon-barkley-for-golfing-with-t-1851778431",
    "timestamp": "2025-04-30T13:54:00Z"
  },
  {
    "title": "US Industrial Output To Be Worst Hit Globally by Trump Tariffs",
    "description": "Researchers have lowered their forecasts for American industrial output and manufacturing activity as a result of the tariffs.",
    "link": "https://www.newsweek.com/us-industrial-output-worst-hit-trump-tariffs-2066068",
    "timestamp": "2025-04-30T13:53:29Z"
  },
  {
    "title": "What 100 Days of Foreign-Aid Cuts Looks Like to Those Still in the Field",
    "description": "Avril Benoît, the CEO of MSF in the U.S., on what it's like for those in the field after the Trump Administration cut spending on foreign aid",
    "link": "https://time.com/7281364/foreign-aid-100-days-msf-interview/",
    "timestamp": "2025-04-30T13:52:49Z"
  },
  {
    "title": "Highlights from Donald Trump's '100 days of greatness' speech",
    "description": "In a speech celebrating the first 100 days of his presidential term, Donald Trump addressed his polarizing immigration moves, tariffs, and more.",
    "link": "https://www.businessinsider.com/highlights-from-donald-trumps-100-days-of-greatness-speech-2025-4",
    "timestamp": "2025-04-30T13:52:49Z"
  },
  {
    "title": "Iran executes man accused of helping Israel kill Revolutionary Guards colonel",
    "description": "Mohsen Langarneshin is accused of being ‘senior spy’ for Mossad, but human rights groups say he was innocent",
    "link": "https://www.yahoo.com/news/iran-executes-man-accused-helping-135242651.html",
    "timestamp": "2025-04-30T13:52:42Z"
  },
  {
    "title": "Ukraine poised to sign much anticipated mineral resources deal with the US on Wednesday",
    "description": "Ukraine is set to sign a key mineral deal with the United States in Washington. Economy Minister Yulia Svyrydenko is coordinating the final details. The agreement needs approval from both sides. Meanwhile, peace talks face hurdles. Russia wants answers before…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ukraine-poised-to-sign-much-anticipated-mineral-resources-deal-with-the-us-on-wednesday/articleshow/120768177.cms",
    "timestamp": "2025-04-30T13:52:28Z"
  },
  {
    "title": "CNN’s Abby Phillip Hammers Trump’s ‘100 Lies’ for 100 Days in 93 Seconds Flat",
    "description": "Abby Phillip hammered Trump with a comical 93-second recitation of some of the \"100 lies and false claims\" from Trump's first 100 days in office.\nThe post CNN’s Abby Phillip Hammers Trump’s ‘100 Lies’ for 100 Days in 93 Seconds Flat first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/cnns-abby-phillip-hammers-trumps-100-lies-for-100-days-in-93-seconds-flat/",
    "timestamp": "2025-04-30T13:50:42Z"
  },
  {
    "title": "Donald Trump tariffs shock US economy as country's GDP falls in first quarter",
    "description": "Gross domestic product decreased at a 0.3 per cent annualized rate last quarter, the Commerce Department's Bureau of Economic Analysis said in its advance estimate of first-quarter GDP on Wednesday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-tariffs-shock-us-economy-as-countrys-gdp-falls-in-first-quarter/articleshow/120767957.cms",
    "timestamp": "2025-04-30T13:50:12Z"
  },
  {
    "title": "The Trump Boomerang Effect",
    "description": "Rather than destabilizing Europe, US President Donald Trump’s relentless attacks have catalyzed a strategic awakening across the continent. America’s rejection of its allies has pushed European leaders to confront longstanding challenges with newfound courage…",
    "link": "https://www.project-syndicate.org/commentary/trump-attempts-to-bully-europe-are-backfiring-by-alberto-alemanno-2025-04",
    "timestamp": "2025-04-30T13:49:08Z"
  },
  {
    "title": "Tim Walz says Harris picked him for VP to ‘code talk to white guys’",
    "description": "Former vice presidential nominee Gov. Tim Walz, D-Minn., continued a self-described \"listening tour\" across the country at a Harvard Kennedy School forum on Monday night, ruling out a 2028 presidential bid and revealing why former Vice President Kamala Harris…",
    "link": "https://nypost.com/2025/04/30/us-news/walz-says-harris-picked-him-for-vp-to-reach-white-guys/",
    "timestamp": "2025-04-30T13:48:27Z"
  },
  {
    "title": "NFL agent breaks down Trump's impact in Shedeur Sanders saga",
    "description": "Famed NFL agent Leigh Steinberg told Fox News Digital how President Donald Trump's interference in the NFL Draft may have affected the Shedeur Sanders situation.",
    "link": "https://www.foxnews.com/sports/nfl-agent-trumps-impact-shedeur-sanders-saga",
    "timestamp": "2025-04-30T13:47:36Z"
  },
  {
    "title": "CNBC’s Steve Liesman Gobsmacked by ‘Frozenness’ of Trump Economy as GDP Shrinks: ‘Like Nothing I’ve Ever Seen Before’",
    "description": "CNBC’s senior economics reporter Steve Liesman was left stunned by the “frozenness” of the economy Wednesday amid a sharp retraction in the first quarter under President Donald Trump. The Commerce Department reported that the gross domestic product (GDP), adj…",
    "link": "https://www.mediaite.com/tv/cnbcs-steve-liesman-gobsmacked-by-frozenness-of-trump-economy-as-gdp-shrinks-like-nothing-ive-ever-seen-before/",
    "timestamp": "2025-04-30T13:47:34Z"
  },
  {
    "title": "1 in 4 Trump Voters Disappointed or Regret Voting For Him: 'I'm Scared'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOne in four Donald Trump voters regret voting for him or are disappointed by his early performance back as president, a new poll suggests.\nNavigator Research's poll, conducted April 24 to 28 among 1,000 regist…",
    "link": "https://biztoc.com/x/8c196a6e84bba97d",
    "timestamp": "2025-04-30T13:45:45Z"
  },
  {
    "title": "Donald Trump's Approval Rating Suffers Quadruple Blow",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOne hundred days into his second term, President Donald Trump is grappling with slipping approval ratings across four major national polls, signaling growing public dissatisfaction with his leadership.\nWhy It …",
    "link": "https://biztoc.com/x/286005ae70540834",
    "timestamp": "2025-04-30T13:45:09Z"
  },
  {
    "title": "GM and other automakers are stuck in a tariff 'Twilight Zone,' analyst says",
    "description": "President Donald Trump offered some tariff-related relief for the auto industry on Tuesday, but one major analyst thinks the damage is already done.Read more...",
    "link": "https://qz.com/auto-industry-tariffs-trump-gm-wedbush-1851778423",
    "timestamp": "2025-04-30T13:44:00Z"
  },
  {
    "title": "Seth Meyers Panics at Figuring Out What ‘Trump 2028’ Hats Might Actually Refer To | Video",
    "description": "\"Oh no,\" the NBC host says gravely\nThe post Seth Meyers Panics at Figuring Out What ‘Trump 2028’ Hats Might Actually Refer To | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-2028-hats-meaning-seth-meyers/",
    "timestamp": "2025-04-30T13:43:36Z"
  },
  {
    "title": "Karoline Leavitt breaks ranks with Donald Trump running for 2028 U.S polls, says the President is trolling, but her boss thinks otherwise",
    "description": "White House Press Secretary Karoline Leavitt dismissed Donald Trump's hints at a 2028 presidential run as mere \"trolling,\" despite Trump's earlier claim of \"not joking\" about a third term. Leavitt, during a \"Trump Troll or Trump Truth\" game, deemed his remark…",
    "link": "https://economictimes.indiatimes.com/news/international/us/karoline-leavitt-breaks-ranks-with-donald-trump-running-for-2028-u-s-polls-says-the-president-is-trolling-but-her-boss-thinks-otherwise/articleshow/120766724.cms",
    "timestamp": "2025-04-30T13:43:23Z"
  },
  {
    "title": "1 in 4 Trump Voters Disappointed or Regret Voting For Him: 'I'm Scared'",
    "description": "Millions of Donald Trump voters regretted voting for him in 2024, a new poll suggests.",
    "link": "https://www.newsweek.com/donald-trump-poll-voters-regret-voting-disappointed-approval-rating-2066120",
    "timestamp": "2025-04-30T13:42:57Z"
  },
  {
    "title": "US economy shrinks in worst performance for three years - as Trump blames Biden",
    "description": "The US economy shrank between January and March in its worst performance for three years - with Donald Trump blaming former president Joe Biden.",
    "link": "https://news.sky.com/story/us-economy-shrinks-as-trump-blames-biden-13358719",
    "timestamp": "2025-04-30T13:42:00Z"
  },
  {
    "title": "You Will Work in the Factory and You Will Like It",
    "description": "Romanticizing the factory floor is a rich man's game, the type of thing done only by people who have no experience of it.",
    "link": "https://reason.com/2025/04/30/you-will-work-in-the-factory-and-you-will-like-it/",
    "timestamp": "2025-04-30T13:40:31Z"
  },
  {
    "title": "US cannot sign peace deal with Russia on behalf of Kiev – Kremlin",
    "description": "Moscow is urging the Ukrainian government to lift its ban on direct negotiations Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616556-kremlin-peace-agreement-washington/",
    "timestamp": "2025-04-30T13:40:02Z"
  },
  {
    "title": "Donald Trump's Approval Rating Suffers Quadruple Blow",
    "description": "Newsweek's tracker shows that Trump's approval rating currently sits at 44 percent, while 52 percent disapprove.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2066098",
    "timestamp": "2025-04-30T13:39:51Z"
  },
  {
    "title": "What Trump Has Done on Reproductive Health Care In His First 100 Days",
    "description": "The Trump Administration has taken a number of actions that have limited or threatened access to reproductive health care.",
    "link": "https://time.com/7281515/trump-100-days-reproductive-health-abortion/",
    "timestamp": "2025-04-30T13:38:40Z"
  },
  {
    "title": "'BE PATIENT': Trump says shrink in US economy has 'nothing to do with tariffs'",
    "description": "The US economy shrank 0.3% in first three months of the year as firms stockpiled imports ahead of Trump tariffs. It is the worst quarterly performance for the U.S. economy since early 2022. US President Donald Trump has said that it has 'nothing to do with ta…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-economy-shrinks-gdp-0-3-percent-be-patient-trump-says-shrink-in-us-economy-has-nothing-to-do-with-tariffs/articleshow/120767625.cms",
    "timestamp": "2025-04-30T13:37:05Z"
  },
  {
    "title": "Trump blames Biden 'overhang' after GDP shrinks in first quarter, says growth will 'take a while'",
    "description": "President Donald Trump blamed his predecessor and defended his sweeping tariffs after new data showed the U.S. economy contracting last quarter.",
    "link": "https://www.cnbc.com/2025/04/30/trump-gdp-tariffs-biden-overhang.html",
    "timestamp": "2025-04-30T13:34:27Z"
  },
  {
    "title": "Trump Blames Biden as US Economy Goes Into Reverse",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump pointed the finger of blame at former President Joe Biden, after data showed the U.S. economy shrank for the first time in three years.\nThe Bureau of Economic Analysis said the U.S. econ…",
    "link": "https://biztoc.com/x/4c6f7de5d7c5041c",
    "timestamp": "2025-04-30T13:34:25Z"
  },
  {
    "title": "Donald Trump Responds to Impeachment Attempt: 'This Lunatic'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump hit out at a Michigan Democrat's attempt to impeach him.\nSpeaking during a rally, Trump called Representative Shri Thanedar, who has introduced seven articles of impeachment against the …",
    "link": "https://biztoc.com/x/02f8bb18d515f48d",
    "timestamp": "2025-04-30T13:34:08Z"
  },
  {
    "title": "Vietnam celebrates communist victory over U.S. as new threat of tariffs looms",
    "description": "Vietnam on Wednesday celebrated the 50th anniversary of the communist victory over U.S. forces — but with an eye on ties with America that have blossomed in recent decades but are at risk of fraying under President Donald Trump.",
    "link": "https://www.nbcnews.com/world/asia/vietnam-celebrates-communist-victory-us-new-threat-tariffs-looms-rcna203326",
    "timestamp": "2025-04-30T13:34:02Z"
  },
  {
    "title": "Knives are Out for Ed Martin",
    "description": "As the Trump appointee pursues investigations into the most corrupt practices in the Department of Justice's recent history, Democrats and other interests are collaborating to sink his confirmation. With his interim appointment set to expire soon, Ed Martin, …",
    "link": "https://freerepublic.com/focus/f-chat/4314167/posts",
    "timestamp": "2025-04-30T13:34:02Z"
  },
  {
    "title": "Trump Goes Full Dictator With Grim Warning About Courts",
    "description": "Donald Trump seems ready to escalate his assault on the judiciary, stating that “nothing” would stop his mass immigration efforts.\r\nDuring a rally in Michigan Tuesday night marking his god-awful first 100 days in office, the president vowed to continue defyin…",
    "link": "https://newrepublic.com/post/194592/donald-trump-full-dictator-ignore-courts",
    "timestamp": "2025-04-30T13:34:01Z"
  },
  {
    "title": "Pro wrestling icon Hulk Hogan to be commissioner of Real American Freestyle",
    "description": "Hulk Hogan felt sure he was onto something. After watching the NCAA Division I wrestling championships, he was absolutely certain. Hogan is one of the most popular professional wrestlers of all time, and he stayed in that lane until his teenage stepson pulled…",
    "link": "https://sports.yahoo.com/article/pro-wrestling-icon-hulk-hogan-133400634.html",
    "timestamp": "2025-04-30T13:34:00Z"
  },
  {
    "title": "Trump blames Biden 'overhang' after GDP shrinks in first quarter, says growth will 'take a while'",
    "description": "President Donald Trump on Wednesday blamed his predecessor and defended his sweeping tariffs after new data showed the U.S. economy contracting last quarter, while warning that his promised \"boom\" will \"take a while.\"\n\"This is [former President Joe] Biden's S…",
    "link": "https://biztoc.com/x/45eb76c4f28fcfe0",
    "timestamp": "2025-04-30T13:33:53Z"
  },
  {
    "title": "After signaling restraint, Trump renews criticism of the Federal Reserve",
    "description": "President Donald Trump’s détente with the Federal Reserve lasted just one week.",
    "link": "https://biztoc.com/x/afbea83504ea597b",
    "timestamp": "2025-04-30T13:33:45Z"
  },
  {
    "title": "Donald Trump Hit by Triple Legal Setback Within Hours",
    "description": "Administration was handed 3 legal losses on April 29 pertaining to attempts to remove funds and people from federal institutions.",
    "link": "https://biztoc.com/x/98182a20d4cac36e",
    "timestamp": "2025-04-30T13:33:45Z"
  },
  {
    "title": "After 100 days in office, Donald Trump given 'F' rating by Americans because of this",
    "description": "Donald Trump F rating leads headlines as nearly half of American voters gave the former president a failing grade after 100 days into his second term. According to the NPR/PBS/Marist Poll, 46% of registered voters rated Trump’s performance an “F,” while only …",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-100-days-in-office-donald-trump-given-f-rating-by-americans-because-of-this/articleshow/120765070.cms",
    "timestamp": "2025-04-30T13:33:24Z"
  },
  {
    "title": "Dutch government unveils transport restrictions during NATO summit",
    "description": "Dozens of foreign leaders and ministers, headlined by U.S. President Donald Trump, are set to be in The Hague in June.",
    "link": "https://www.politico.eu/article/nato-summit-hague-rutte-trump-ukraine-war/",
    "timestamp": "2025-04-30T13:32:42Z"
  },
  {
    "title": "Bitcoin Falls as U.S. Economy Contracts for First Time in 3 Three Years",
    "description": "Economists fear Trump's tariffs will weigh on economic growth while adding to inflation.",
    "link": "https://decrypt.co/317101/bitcoin-falls-as-u-s-economy-contracts-first-time-in-3-three-years",
    "timestamp": "2025-04-30T13:30:42Z"
  },
  {
    "title": "Climate change is making coffee more expensive. Tariffs likely will too",
    "description": "President Trump's current 10% tariffs cover most coffee-producing countries and are expected to drive up costs for Americans.",
    "link": "https://www.bostonherald.com/2025/04/30/climate-change-tariffs-coffee-prices/",
    "timestamp": "2025-04-30T13:30:15Z"
  },
  {
    "title": "Climate change is making coffee more expensive. Tariffs likely will too",
    "description": "President Trump's current 10% tariffs cover most coffee-producing countries and are expected to drive up costs for Americans.",
    "link": "https://www.denverpost.com/2025/04/30/climate-change-tariffs-coffee-prices/",
    "timestamp": "2025-04-30T13:30:15Z"
  },
  {
    "title": "100 DAYS OF HOAXES: White House Brutally Fact-Checks Some of the Most Egregious Hoaxes Peddled by Fake News Media and Democrats",
    "description": "Since President Donald Trump took office 100 days ago, the American people have been bombarded with an unrelenting barrage of hoaxes, lies, and outright fabrications from Democrats and their lapdogs in the Fake News media, driven by their Stage-5 Trump Derang…",
    "link": "https://www.thegatewaypundit.com/2025/04/100-days-hoaxes-white-house-brutally-fact-checks/",
    "timestamp": "2025-04-30T13:30:10Z"
  },
  {
    "title": "'Nowhere to turn': Small businesses dependent on imports from China feel more desperate",
    "description": "Since the Trump administration raised tariffs on goods from China to 145%, major orders were canceled and products were stranded overseas.",
    "link": "https://richmond.com/news/nation-world/business/article_e5b83166-726b-5a7a-9ed2-f7ba46cc1b7b.html",
    "timestamp": "2025-04-30T13:30:00Z"
  },
  {
    "title": "Why the US will lose its battle with China",
    "description": "Trump’s unreliable America is throwing away the assets it needs",
    "link": "https://www.irishtimes.com/business/economy/2025/04/30/why-the-us-will-lose-its-battle-with-china/",
    "timestamp": "2025-04-30T13:30:00Z"
  },
  {
    "title": "Trump’s Tirade at Reporter Wrecks His Own Case Against Abrego Garcia",
    "description": "President Donald Trump grew angry as a reporter persistently questioned him about his refusal to bring back Kilmar Abrego Garcia from a prison in El Salvador—and in so doing, Trump accidentally demolished his whole case against the wrongfully deported Salvado…",
    "link": "https://newrepublic.com/post/194593/donald-trump-reporter-wrecks-case-kilmar-abrego-garcia",
    "timestamp": "2025-04-30T13:29:14Z"
  },
  {
    "title": "Trump Blames Biden as US Economy Goes Into Reverse",
    "description": "The economy went into contraction as Trump came to office on the promise of sweeping tariffs.",
    "link": "https://www.newsweek.com/trump-blames-biden-us-economy-goes-reverse-2066150",
    "timestamp": "2025-04-30T13:29:08Z"
  },
  {
    "title": "Trump's Crypto Sherpa Bo Hines Says Crypto Legislation on Target for Quick Completion",
    "description": "The head of the Presidential Council of Advisers for Digital Assets says new laws could be set by August, and Trump's own crypto interests aren't a factor.",
    "link": "https://www.coindesk.com/consensus-toronto-2025-coverage/2025/04/30/trumps-crypto-sherpa-bo-hines-says-crypto-legislation-on-target-for-quick-completion",
    "timestamp": "2025-04-30T13:28:40Z"
  },
  {
    "title": "Elon Musk Leaves White House But ‘His Folks Aren’t Going Anywhere,’ Says Chief Of Staff",
    "description": "The White House said that Musk “hasn’t been here physically” lately, but that he is advising the Department of Government Efficiency over the phone.",
    "link": "https://www.huffpost.com/entry/elon-musk-leaves-white-house-says-chief-of-staff-susie-wiles_n_6811f439e4b017983e24da47",
    "timestamp": "2025-04-30T13:28:07Z"
  },
  {
    "title": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt business",
    "description": "The U.S. economy shrank at a 0.3% annual pace from January through March, the first drop in three years, as President Donald Trump’s trade wars disrupted business. First-quarter growth was slowed by a surge in imports as companies in the United States tried t…",
    "link": "https://financialpost.com/pmn/u-s-economy-shrinks-0-3-in-first-quarter-as-trump-trade-wars-disrupt-business-2",
    "timestamp": "2025-04-30T13:27:26Z"
  },
  {
    "title": "Trump trolls fake news with 100 days of media ‘hoaxes’ list",
    "description": "'This is why no one trusts the maliciously incompetent and purposefully bias media'",
    "link": "https://www.wnd.com/2025/04/trump-trolls-fake-news-with-100-days-of-media-hoaxes-list/",
    "timestamp": "2025-04-30T13:26:28Z"
  },
  {
    "title": "A ‘constitutional loophole’: How phone inspections test US civil rights",
    "description": "US border agents have a right to search electronic devices. But experts say the practice raises constitutional concerns.",
    "link": "https://www.aljazeera.com/news/2025/4/30/a-constitutional-loophole-how-phone-inspections-test-us-civil-rights",
    "timestamp": "2025-04-30T13:26:21Z"
  },
  {
    "title": "'Twilight zone': Defense attorney shocked after Trump admits to 'flouting' Supreme Court",
    "description": "“Bizarre times and the Twilight Zone” is how CNN legal analyst, criminal defense attorney Joey Jackson, views President Donald Trump’s most recent comments about not bringing back Kilmar Abrego Garcia, the Maryland man who was mistakenly deported to El Salvad…",
    "link": "https://www.rawstory.com/trump-scotus-2671871500/",
    "timestamp": "2025-04-30T13:25:38Z"
  },
  {
    "title": "Trump is losing his war on democracy (Zack Beauchamp/Vox)",
    "description": "Zack Beauchamp / Vox:\nTrump is losing his war on democracy  —  Trump's power grabs are dangerous.  But he's going about them all wrong — and facing effective resistance as a result. … In the first 100 days of Donald Trump's second term, his administration has…",
    "link": "https://www.memeorandum.com/250430/p34",
    "timestamp": "2025-04-30T13:25:00Z"
  },
  {
    "title": "US economy slows dramatically in first quarter amid Trump's sweeping tariffs (Lauren Aratani/The Guardian)",
    "description": "Lauren Aratani / The Guardian:\nUS economy slows dramatically in first quarter amid Trump's sweeping tariffs  —  Drop comes amid a huge fall in consumer sentiment which in April dropped 32% to lowest level since 1990 recession  —  Growth slowed dramatically in…",
    "link": "https://www.memeorandum.com/250430/p33",
    "timestamp": "2025-04-30T13:25:00Z"
  }
]