[
  {
    "title": "Trump says Zelenskiy made 'worst statement' about Ukraine war - Reuters",
    "description": "Trump says Zelenskiy made 'worst statement' about Ukraine warReuters Latest on Trump’s presidency: Zelensky meeting fallout and looming tariffsCNN Donald Trump renews attacks on Volodymyr Zelenskyy over US backing against RussiaFinancial Times Live updates: T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176602195",
    "timestamp": "2025-03-03T20:13:34Z"
  },
  {
    "title": "President Trump: Europe has spent more money buying Russian Oil and Gas than they have spent on defending Ukraine —BY FAR!",
    "description": "Donald J. Trump @realDonaldTrump Europe has spent more money buying Russian Oil and Gas than they have spent on defending Ukraine —BY FAR! Mar 03, 2025",
    "link": "https://freerepublic.com/focus/f-news/4301823/posts",
    "timestamp": "2025-03-03T20:13:17Z"
  },
  {
    "title": "Andrew Cuomo Officially Enters NYC Mayoral Race",
    "description": "Former New York Governor Andrew Cuomo officially declared his intent to run for mayor of New York City. The 67-year-old politician is seen as the front-runner to secure the Democratic Party's nomination after entering.",
    "link": "https://hiphopwired.com/2635016/andrew-cuomo-enters-nyc-mayoral-race/",
    "timestamp": "2025-03-03T20:13:07Z"
  },
  {
    "title": "Trump, Vance Debased U.S. Diplomacy—the World Noticed | Opinion",
    "description": "President Donald Trump and Vice President JD Vance invited Ukrainian President Volodymyr Zelensky to Washington under the pretense of negotiating a peace deal.",
    "link": "https://www.newsweek.com/trump-vance-debased-us-diplomacy-world-noticed-opinion-2038817",
    "timestamp": "2025-03-03T20:11:57Z"
  },
  {
    "title": "SCOOP: Speaker Johnson reveals guest list for Trump's big speech Tuesday",
    "description": "Speaker Mike Johnson shared his guest list for President Donald Trump's joint address to Congress exclusively with Fox News Digital.",
    "link": "https://www.foxnews.com/politics/scoop-speaker-johnson-reveals-guest-list-trumps-big-speech-tuesday",
    "timestamp": "2025-03-03T20:11:17Z"
  },
  {
    "title": "At 2026's State of the Union, will the House Sergeant at Arms bellow, 'Mr. Speaker, His Excellency, King Donald?'",
    "description": "When I worked on Capitol Hill \r\nyears ago, and because I was the most gregarious person on our staff, I would give constituents visiting D.C. a tour of the U.S. Capitol\r\n. When I’d take them to the House chamber, I’d show them where the First Lady\r\n sits for …",
    "link": "https://www.advocate.com/voices/trump-2026-sotu-king-donald",
    "timestamp": "2025-03-03T20:10:47Z"
  },
  {
    "title": "Trump Slams Zelensky for Saying the End of the Russia-Ukraine War Is ‘Very, Very Far Away’",
    "description": "Trump said Zelensky made \"the worst statement,\" as his allies escalate pressure on the Ukrainian president",
    "link": "https://time.com/7263913/trump-slams-zelensky-russia-ukraine-war-end/",
    "timestamp": "2025-03-03T20:10:18Z"
  },
  {
    "title": "Trump set to take border ‘victory lap’ in ‘big’ speech to Congress where he will ‘tell it like it is’",
    "description": "President Trump will tout his administration’s hardline immigration policies when he addresses a joint session of Congress for the first time as the 47th president, The Post has learned. Trump, 78, blasted out an all-caps promo for his remarks on Truth Social…",
    "link": "https://nypost.com/2025/03/03/us-news/trump-set-to-take-border-victory-lap-in-big-speech-to-congress-where-he-will-tell-it-like-it-is/",
    "timestamp": "2025-03-03T20:10:16Z"
  },
  {
    "title": "Trump: 'America Will Not Put Up With' Zelensky's Anti-Peace Rhetoric 'Much Longer'",
    "description": "President Donald Trump said the United States \"will not put up with\" Ukrainian President Volodymyr Zelenksy's anti-peace rhetoric \"much longer.\"\nThe post Trump: ‘America Will Not Put Up With’ Zelensky’s Anti-Peace Rhetoric ‘Much Longer’ appeared first on Brei…",
    "link": "https://www.breitbart.com/politics/2025/03/03/trump-us-wont-put-up-with-zelenskys-anti-peace-rhetoric-much-longer/",
    "timestamp": "2025-03-03T20:10:15Z"
  },
  {
    "title": "Trump’s Crypto-Stockpile Announcement Backfired",
    "description": "Donald Trump tried to throw a bone to the crypto crowd. It worked — for a few hours. Then, everyone turned on him.",
    "link": "http://nymag.com/intelligencer/article/trump-crypto-stockpile-bitcoin.html",
    "timestamp": "2025-03-03T20:10:01Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent sees inflation plummeting to the Federal Reserve’s 2% target despite Trump’s tariffs",
    "description": "In an interview with CBS News on Sunday, Treasury Secretary Scott Bessent discussed tariffs, whether they’re inflationary, and what his department is doing to carry out President Donald Trump’s promise to bring down prices for Americans.\nTwo things President …",
    "link": "https://biztoc.com/x/e0aacad0afdb24c5",
    "timestamp": "2025-03-03T20:09:55Z"
  },
  {
    "title": "XRP and Solana soar then falter as Trump announces plans for a multi-asset crypto reserve",
    "description": "The crypto market rallied over the weekend on news that a future national crypto reserve would include three additional coins. But the digital asset class has already lost some of its gains.\nPresident Donald Trump sparked a crypto Solana, XRP and Cardano woul…",
    "link": "https://biztoc.com/x/13269dc0c6b47e85",
    "timestamp": "2025-03-03T20:09:52Z"
  },
  {
    "title": "Trump proposal to create 'crypto strategic reserve' vexes some industry supporters",
    "description": "President Donald Trump said Sunday that he is directing his newly created digital assets working group to move forward on creating a “crypto strategic reserve” along the lines of existing U.S. reserves of gold and oil.",
    "link": "https://biztoc.com/x/a717f72999be196b",
    "timestamp": "2025-03-03T20:09:52Z"
  },
  {
    "title": "Putin Was Only Winner in Trump-Zelenskiy Clash: Rep. Lawler",
    "description": "\"The only winner was Vladimir Putin.\" New York Rep. Mike Lawler comments on President Trump’s meeting Friday with Zelenskiy that quickly devolved into a fiery exchange.\nThe US and Ukraine failed to sign a critical minerals agreement after a Friday meeting bet…",
    "link": "https://biztoc.com/x/fc2eca3ebf3e522b",
    "timestamp": "2025-03-03T20:09:51Z"
  },
  {
    "title": "Even After Zelensky Spat, Trump Is Europe's Best Chance for Peace | Opinion",
    "description": "European elites are caught in a dangerous cycle of self-fulfilling prophecy. They claim U.S. President Donald Trump is abandoning NATO.",
    "link": "https://biztoc.com/x/6096398ef6ab8585",
    "timestamp": "2025-03-03T20:09:33Z"
  },
  {
    "title": "Dow tumbles 600 points as Trump confirms tariffs on Mexico and Canada will start Tuesday",
    "description": "US stocks slid Monday as investors braced for President Donald Trump’s proposed tariffs on Canada, Mexico and China to go into effect by the midnight deadline.\nThe Dow tumbled 650 points, or 1.49%, in afternoon trading. The broader S&P 500 fell 1.69% and the …",
    "link": "https://biztoc.com/x/c8a92398434b9562",
    "timestamp": "2025-03-03T20:09:32Z"
  },
  {
    "title": "Cuts to U.S. weather and climate research could put public safety at risk",
    "description": "This is a re-post from Yale Climate Connections by Jeff Masters and Bob Henson\nOne month into the new Trump administration, firings of scientists and freezes to U.S. research funding have caused an unprecedented elimination of scientific expertise from the fe…",
    "link": "https://skepticalscience.com/cuts-to-weather-climate-research-safety-risk.html",
    "timestamp": "2025-03-03T20:09:30Z"
  },
  {
    "title": "Trump DOJ Delivers Crippling Blow To Suspected Illegal Migrant Smuggling Ring",
    "description": "Federal law enforcement arrested the alleged leaders of one of the largest migrant smuggling operations in the U.S.,",
    "link": "https://dailycaller.com/2025/03/03/trump-doj-suspected-illegal-migrant-smuggling-ring-los-angeles/",
    "timestamp": "2025-03-03T20:09:04Z"
  },
  {
    "title": "Growing space cooperation between Pakistan, China presents risks and opportunities, experts say",
    "description": "Islamabad — China is ramping up cooperation with Pakistan in space exploration, but experts say Islamabad must develop its own strengths if it aims to benefit from Beijing.\n\n\nPakistan’s Space & Upper Atmosphere Research Commission, or SUPARCO, and China Manne…",
    "link": "https://www.voanews.com/a/growing-space-cooperation-between-pakistan-china-presents-risks-and-opportunities-experts-say-/7995718.html",
    "timestamp": "2025-03-03T20:07:01Z"
  },
  {
    "title": "JUSTIN GOODMAN: DOGE, Lawmakers Target Fauci’s Mad Science",
    "description": "Dr. Anthony Fauci is gone from government, but his long shadow looms large in Washington. DOGE is fixing that.",
    "link": "https://dailycaller.com/2025/03/03/opinion-doge-lawmakers-target-fauci-justin-goodman/",
    "timestamp": "2025-03-03T20:05:53Z"
  },
  {
    "title": "Trump crypto strategic reserve coins ‘ADA, XRP, SOL’ dump, Bitcoin follows",
    "description": "ADA, XRP and SOL are seeing profit booking just a day after rallying following President Trump’s US strategic crypto reserve announcement. Is the market headed toward new lows?",
    "link": "https://cointelegraph.com/news/trump-crypto-strategic-reserve-coins-ada-xrp-sol-dump-bitcoin-follows",
    "timestamp": "2025-03-03T20:05:00Z"
  },
  {
    "title": "Even After Zelensky Spat, Trump Is Europe's Best Chance for Peace | Opinion",
    "description": "European elites are caught in a dangerous cycle of self-fulfilling prophecy. They claim U.S. President Donald Trump is abandoning NATO.",
    "link": "https://www.newsweek.com/even-after-zelensky-spat-trump-europes-best-chance-peace-opinion-2038746",
    "timestamp": "2025-03-03T20:03:24Z"
  },
  {
    "title": "Whoopi Goldberg: Trump-Zelensky Clash 'One of the Most Embarrassing Things I've Ever Seen'",
    "description": "Whoopi Goldberg told her co-hosts Monday on ABC's \"The View\" that the Oval Office meeting last week between President Donald Trump, Vice President JD Vance and Ukrainian President Volodymyr Zelensky was \"one of the most embarrassing things\" she had ever seen.…",
    "link": "https://www.breitbart.com/clips/2025/03/03/whoopi-goldberg-trump-zelensky-clash-one-of-the-most-embarrassing-things-ive-ever-seen/",
    "timestamp": "2025-03-03T20:03:00Z"
  },
  {
    "title": "How springing forward to daylight saving time could affect your health - and how to prepare - WBBJ TV",
    "description": "Losing an hour of sleep as daylight saving time kicks in can do more than leave you tired and cranky -- it also could harm your health.",
    "link": "https://www.wbbjtv.com/2025/03/03/how-springing-forward-to-daylight-saving-time-could-affect-your-health-and-how-to-prepare/",
    "timestamp": "2025-03-03T20:02:53Z"
  },
  {
    "title": "‘Why are You Crying?’- Uhuru Responds to Kenyans Over Trump Order [Make Kenya Great Again]",
    "description": "Former President Uhuru Kenyatta has challenged Kenyans and other African nations over concerns about US President Donald Trump’s decision to cut funding to certain USAID programs. Speaking in Mombasa during the East Africa Region Global Health Security Summit…",
    "link": "https://freerepublic.com/focus/f-chat/4301819/posts",
    "timestamp": "2025-03-03T20:02:37Z"
  },
  {
    "title": "Trump’s tariff tactics carry higher economic risks than during his first term",
    "description": "Trump's first term trade war didn’t do much damage to the U.S. economy. Or much good. The sequel could be costlier.",
    "link": "https://www.bostonherald.com/2025/03/03/trump-tariffs-impact-mexico-canada/",
    "timestamp": "2025-03-03T20:01:54Z"
  },
  {
    "title": "Without US help, Zelenskyy has few options except to repair his relationship with the White House",
    "description": "Ukraine’s president has few options after last week’s astonishing Oval Office row with U.S. President Donald Trump, who berated the wartime leader.  Now...",
    "link": "https://www.yahoo.com/news/without-us-help-zelenskyy-few-200138277.html",
    "timestamp": "2025-03-03T20:01:38Z"
  },
  {
    "title": "Solana Explodes Out Of Downtrend: How High Can It Go?",
    "description": "Solana (SOL) has delivered a dramatic shift in market structure, breaking above a descending parallel channel that had dominated its price action for several weeks. Ali Martinez (@ali_charts), who shared the attached four-hour chart, suggests that this breako…",
    "link": "http://www.newsbtc.com/news/solana-explodes-out-of-downtrend-how-high/",
    "timestamp": "2025-03-03T20:00:24Z"
  },
  {
    "title": "Dow tumbles 800 points as Trump confirms tariffs on Mexico and Canada will start Tuesday | CNN Business",
    "description": "US stocks slid Monday as investors braced for President Donald Trump’s proposed tariffs on Canada, Mexico and China to go into effect by the midnight deadline.",
    "link": "https://www.cnn.com/2025/03/03/investing/us-stocks-tariffs-loom/index.html",
    "timestamp": "2025-03-03T20:00:08Z"
  },
  {
    "title": "Friday’s Diplomatic Meltdown: What Happened After the Press Left the Oval Office",
    "description": "The deal \"would have bound the United States and Ukraine together economically for a generation for critical minerals that we need, economic investment that they need.\"\nThe post Friday’s Diplomatic Meltdown: What Happened After the Press Left the Oval Office …",
    "link": "https://legalinsurrection.com/2025/03/fridays-diplomatic-meltdown-what-happened-after-the-press-left-the-oval-office/",
    "timestamp": "2025-03-03T20:00:07Z"
  },
  {
    "title": "Melania Trump Makes First Solo Appearance Of Husband’s New Term To Push For Bill Addressing Revenge Porn And AI Deepfakes",
    "description": "First Lady Melania Trump made her first solo appearance of her husband’s new term, visiting Capitol Hill to lobby for passage of legislation that would ban the publication of non-consensual sexually exploitive images, including revenge porn and AI deepfakes. …",
    "link": "http://deadline.com/2025/03/melania-trump-capitol-hill-deepfakes-1236309692/",
    "timestamp": "2025-03-03T19:59:19Z"
  },
  {
    "title": "Labor spending blitz points to April 12 election",
    "description": "Medicare and public schools have been budgeted for in Labor's most recent pre-election spending announcements, while Peter Dutton's plans are, as ever, just around the corner...\nThe post Labor spending blitz points to April 12 election appeared first on Crike…",
    "link": "http://www.crikey.com.au/2025/03/04/2025-federal-election-labor-spending-peter-dutton/",
    "timestamp": "2025-03-03T19:59:05Z"
  },
  {
    "title": "Live: Coalition vows to force public servants back to the office",
    "description": "The Coalition unveils plans to force public servants to work from the office five days a week if it wins the next election. Follow live.",
    "link": "https://www.abc.net.au/news/2025-03-04/federal-politics-live-blog-march-4/105006494",
    "timestamp": "2025-03-03T19:58:56Z"
  },
  {
    "title": "Trump’s former national security adviser accuses him of ‘coddling Putin’",
    "description": "Retired Gen. H.R. McMaster, who served at Trump’s side for over a year, finds it “impossible to understand” why Trump is “coddling Putin.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-former-national-security-adviser-accuses-coddling-putin-rcna194570",
    "timestamp": "2025-03-03T19:58:52Z"
  },
  {
    "title": "US Is Considering Easing Sanctions on Russia After Trump-Zelensky Meltdown",
    "description": "The United States is preparing a plan to potentially ease sanctions on Russia as President Donald Trump pushes to restore relations with Moscow and end the war in Ukraine, a U.S. official and another source familiar with the matter told Reuters.\nThe White Hou…",
    "link": "https://biztoc.com/x/1b2e87e17d8c93a5",
    "timestamp": "2025-03-03T19:58:44Z"
  },
  {
    "title": "America Alone",
    "description": "From Angry Staffer on Bluesky on the Trump/Vance/Zelenskyy meeting:\n\nThe public nature of the meltdown amplifies the embarrassment",
    "link": "https://kottke.org/25/03/america-alone",
    "timestamp": "2025-03-03T19:58:43Z"
  },
  {
    "title": "Daylight saving time is coming. Here’s how springing forward to could affect your health",
    "description": "Studies even show an uptick in heart attacks and strokes the first few days after the spring time change.",
    "link": "https://www.pbs.org/newshour/health/daylight-saving-time-is-coming-heres-how-springing-forward-to-could-affect-your-health",
    "timestamp": "2025-03-03T19:57:41Z"
  },
  {
    "title": "Reddit co-founder joins ‘People’s Bid’ to buy TikTok",
    "description": "Reddit co-founder Alexis Ohanian announced Monday that he is joining a US bid to buy TikTok, becoming a strategic advisor to the effort. Ohanian said he would join an initiative called “The People’s Bid for TikTok,” launched by real estate and sports tycoon F…",
    "link": "https://www.digitaljournal.com/world/reddit-co-founder-joins-peoples-bid-to-buy-tiktok/article",
    "timestamp": "2025-03-03T19:57:32Z"
  },
  {
    "title": "Major Health Stories Across Nigeria (February 2025 Edition)",
    "description": "The funds are aimed at ensuring continued access to life-saving antiretroviral therapy for people living with HIV, particularly as the country works to strengthen its domestic response amid global funding uncertainties",
    "link": "https://www.premiumtimesng.com/health/health-news/778159-major-health-stories-across-nigeria-february-2025-edition.html",
    "timestamp": "2025-03-03T19:56:17Z"
  },
  {
    "title": "The Democrats Should Boycott Trump's Speech to Congress This Week (Elie Mystal/The Nation)",
    "description": "Elie Mystal / The Nation:\nThe Democrats Should Boycott Trump's Speech to Congress This Week  —  Refusing to attend the speech would be the first indication that Democrats are not just playing politics—and playing them badly—but resisting.  —  Bluesky  —  Pock…",
    "link": "https://www.memeorandum.com/250303/p75",
    "timestamp": "2025-03-03T19:55:01Z"
  },
  {
    "title": "White House seeks plan for possible Russia sanctions relief, sources say (Erin Banco/Reuters)",
    "description": "Erin Banco / Reuters:\nWhite House seeks plan for possible Russia sanctions relief, sources say  —  The United States is drawing up a plan to potentially give Russia sanctions relief as President Donald Trump seeks to restore ties with Moscow and stop the war …",
    "link": "https://www.memeorandum.com/250303/p76",
    "timestamp": "2025-03-03T19:55:01Z"
  },
  {
    "title": "Pfizer CEO says the drugmaker is prepared to shift manufacturing to the US amid tariff threats",
    "description": "Pfizer (PFE) CEO Albert Bourla said on Monday that the drugmaker could move some of its overseas manufacturing to its U.S. plants if necessary, as the Trump administration considers imposing tariffs on pharmaceuticals. Read more...",
    "link": "https://qz.com/pfizer-tariffs-us-production-sites-1851767427",
    "timestamp": "2025-03-03T19:55:00Z"
  },
  {
    "title": "US Is Considering Easing Sanctions on Russia After Trump-Zelensky Meltdown",
    "description": "US officials are expected to discuss the proposals with Russian representatives in the coming days, according to Reuters.",
    "link": "https://www.newsweek.com/us-considering-easing-sanctions-russia-after-trump-zelensky-meltdown-2038972",
    "timestamp": "2025-03-03T19:54:41Z"
  },
  {
    "title": "Trump proposal to create 'crypto strategic reserve' vexes some industry supporters",
    "description": "President Donald Trump said Sunday that he is directing his newly created digital assets working group to move forward on creating a “crypto strategic reserve” along the lines of existing U.S. reserves of gold and oil.",
    "link": "https://www.nbcnews.com/tech/crypto/trump-proposal-create-crypto-strategic-reserve-vexes-industry-supporte-rcna194478",
    "timestamp": "2025-03-03T19:54:16Z"
  },
  {
    "title": "Trump’s announcement of Crypto Strategic Reserve dubbed ‘world-historic’ pump-and-dump",
    "description": "A Truth Social post on Sunday, where President Donald Trump reiterated plans for a “U.S. Crypto Reserve” and praised several specific coins, is drawing ire in the crypto community. \n\n\nThe post gave a bump to a floundering market, but the currencies picked had…",
    "link": "https://www.dailydot.com/debug/trump-of-rigging-markets-following-crypto-reserve-announcement/",
    "timestamp": "2025-03-03T19:53:56Z"
  },
  {
    "title": "Pat McAfee Calls Canada 'Terrible Country' for Booing US National Anthem",
    "description": "The ESPN host called Canada \"terrible\" after anthem booing at a WWE event, later clarifying his comments on his show.",
    "link": "https://www.newsweek.com/pat-mcafee-canada-terrible-country-boo-us-national-anthem-2038923",
    "timestamp": "2025-03-03T19:53:29Z"
  },
  {
    "title": "Some MLAs want to debate N.B.'s tariff response now. The Speaker says they'll have to wait",
    "description": "New Brunswick MLAs eager to question the premier about her planned response to U.S. tariffs will have to wait at least another two weeks to do so.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/new-brunswick-tariff-mla-legislature-1.7473094",
    "timestamp": "2025-03-03T19:53:19Z"
  },
  {
    "title": "Mexico Pushes 'Tough on Cartels' Propaganda in U.S. Media to Avoid Sanctions While Protecting Top Active Narco Bosses",
    "description": "The Mexican government is pushing a \"Tough on Cartels\" propaganda operation through U.S. media outlets while simultaneously protecting some of the country's top, currently active, cartel bosses. Breitbart Texas reported extensively on the Mexican government's…",
    "link": "https://www.breitbart.com/border/2025/03/03/mexico-pushes-tough-on-cartels-propaganda-in-u-s-media-to-avoid-sanctions-while-protecting-top-active-narco-bosses/",
    "timestamp": "2025-03-03T19:53:04Z"
  },
  {
    "title": "Taiwan Semiconductor to announce $100 billion investment in U.S. chip manufacturing plants",
    "description": "President Donald Trump is expected to announce a $100 billion investment from Taiwan Semiconductor Manufacturing to bolster chip manufacturing over the next four years in the U.S, NBC has learned. The Wall Street Journal first reported the news. TSMC, which s…",
    "link": "https://freerepublic.com/focus/f-chat/4301817/posts",
    "timestamp": "2025-03-03T19:52:02Z"
  },
  {
    "title": "Traders longing ADA futures spike after Trump’s crypto reserve reveal: Bitrue",
    "description": "Traders are longing Cardano futures on Bitrue after President Donald Trump announced plans to add the altcoin to a US strategic cryptocurrency reserve.",
    "link": "https://cointelegraph.com/news/traders-longing-ada-futures-spike-after-trump-s-crypto-reserve-reveal-bitrue",
    "timestamp": "2025-03-03T19:51:53Z"
  },
  {
    "title": "Here's how Donald Trump reacted to claims that Putin is 'happy' about his heated exchange with Zelenskyy",
    "description": "Donald Trump’s relationship with Russia has been the subject of intense scrutiny since his first term in office.",
    "link": "https://economictimes.indiatimes.com/news/international/us/heres-donald-trump-responded-over-claims-putin-happy-over-heated-exchange-with-zelensky/articleshow/118692049.cms",
    "timestamp": "2025-03-03T19:51:51Z"
  },
  {
    "title": "TSMC to unveil $100bn investment in advanced manufacturing in the US",
    "description": "Latest corporate overture to Trump administration marks effort to ward off possible tariffs on chips from Taiwan",
    "link": "https://www.irishtimes.com/business/2025/03/03/tsmc-to-unveil-100bn-investment-in-advanced-manufacturing-in-the-us/",
    "timestamp": "2025-03-03T19:50:36Z"
  },
  {
    "title": "Federal workers face second Musk deadline to explain their work last week",
    "description": "Federal employees face a midnight deadline to comply with Elon Musk’s second demand for reports on their recent accomplishments",
    "link": "https://abcnews.go.com/US/wireStory/federal-workers-face-musk-deadline-explain-work-week-119398774",
    "timestamp": "2025-03-03T19:50:29Z"
  },
  {
    "title": "White House wants apology from Zelensky – Fox",
    "description": "An anonymous source has told the outlet it is a precondition for resuming talks on a US-Ukraine minerals deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613630-fox-news-us-wants-apology-zelensky/",
    "timestamp": "2025-03-03T19:50:17Z"
  },
  {
    "title": "Texas lawmaker reveals which 'threatening' migration efforts he would like to slash: 'Our own destruction'",
    "description": "A Texas lawmaker is reintroducing a bill that would ensure U.N. migration agencies are not funded by the United States, amid a broader crackdown by the Trump administration.",
    "link": "https://www.foxnews.com/politics/texas-lawmaker-reveals-which-threatening-migration-efforts-he-would-like-slash",
    "timestamp": "2025-03-03T19:49:12Z"
  },
  {
    "title": "How Donald Trump’s tariffs threaten an iconic U.S. pick-up truck",
    "description": "The Silverado is one of America's most popular pick-up trucks, but it could now become one of the victims of Trump's trade war. Read on",
    "link": "https://financialpost.com/financial-times/trumps-tariffs-threaten-iconic-pick-up-truck",
    "timestamp": "2025-03-03T19:48:50Z"
  },
  {
    "title": "The Weirdness of Trump’s “Crypto Reserve” Announcement",
    "description": "President Donald Trump announced Sunday that he’d include select cryptocurrency tokens in a “U.S. Crypto Reserve” — but what that actually means, and whether it will actually happen, is just about as clear as mud.\nIn a TruthSocial post, Trump said he’d direct…",
    "link": "https://biztoc.com/x/049f55f14510ef1d",
    "timestamp": "2025-03-03T19:48:06Z"
  },
  {
    "title": "Ford urging Buy Ontario approach as tariffs loom, says he may legislate it",
    "description": "TORONTO — Ontario Premier Doug Ford is adding Buy Ontario legislation to the list of measures he is considering in the face of threatened tariffs from the United States. Speaking to a mining conference in Toronto just days after winning a third majority gover…",
    "link": "https://financialpost.com/pmn/ford-urging-buy-ontario-approach-as-tariffs-loom-says-he-may-legislate-it",
    "timestamp": "2025-03-03T19:48:01Z"
  },
  {
    "title": "Trump Makes New Tariff Announcement as He Prepares to Address Congress",
    "description": "President Donald Trump announced new tariffs on \"external\" agricultural products on Monday.\nWhy It Matters\nTrump pledged during his 2024 campaign that he would impose steep tariffs on friends and foes alike, sparking immediate criticism from economists and fi…",
    "link": "https://biztoc.com/x/feb392437d14ee82",
    "timestamp": "2025-03-03T19:47:49Z"
  },
  {
    "title": "A Lethal Mystery Illness Is Spreading in Congo. USAID Cuts Have Slowed the Response",
    "description": "Gutting USAID is already having a devastating impact around the world. In the Democratic Republic of Congo, teams that would normally be racing to identify a fatal sickness are gone.",
    "link": "https://www.wired.com/story/race-to-identify-drcs-mystery-illness-slowed-by-us-aid-cuts-democratic-republic-congo-usaid/",
    "timestamp": "2025-03-03T19:47:11Z"
  },
  {
    "title": "Exclusive – Fired USAID Worker Hailed as Whistleblower by Mainstream Media Donated 23 Times to Democrats",
    "description": "A senior official at the USAID placed on leave after disseminating a memo attacking DOGE and the Trump administration has made almost two dozen donations to Democrats.\nThe post Exclusive – Fired USAID Worker Hailed as Whistleblower by Mainstream Media Donated…",
    "link": "https://www.breitbart.com/politics/2025/03/03/exclusive-fired-usaid-worker-hailed-whistleblower-mainstream-media-donated-23-times-democrats/",
    "timestamp": "2025-03-03T19:47:09Z"
  },
  {
    "title": "Trump or no Trump, think tank calls for Canada to unilaterally drop non-tariff trade barriers",
    "description": "A leading free-market think tank is calling for Canada to unilaterally drop its remaining barriers to international trade...",
    "link": "https://nationalpost.com/news/canada/canada-unilaterally-drop-non-tariff-trade-barriers",
    "timestamp": "2025-03-03T19:45:53Z"
  },
  {
    "title": "Trump’s FCC Head Warns EU Content Rules ‘Incompatible’ With Free Speech",
    "description": "It's the latest warning from the Trump administration that it wants Big Tech left alone.",
    "link": "https://gizmodo.com/trumps-fcc-head-warns-eu-content-rules-incompatible-with-free-speech-2000570843",
    "timestamp": "2025-03-03T19:45:33Z"
  },
  {
    "title": "Welcome to the Nerd Reich",
    "description": "Listen to this episode commercial free at https://angryplanetpod.comWe’re living in a bizarre age of technofascism. The richest man who has ever lived, a man who dreams of colonizing Mars with his children, is America’s CEO. Donald Trump, the man people voted…",
    "link": "https://shows.acast.com/warcollege/episodes/welcome-to-the-nerd-reich",
    "timestamp": "2025-03-03T19:45:32Z"
  },
  {
    "title": "Palestinian and Israeli No Other Land Filmmakers' Powerful Oscars Speech Has Important Backstory",
    "description": "No Other Land won Best Documentary Feature at the Oscars, marking the first-ever Academy Award for a Palestinian filmmaker, co-directors Basel Adra and Hamdan Ballal.",
    "link": "https://www.teenvogue.com/story/no-other-land-oscars-win-speech-palestinian-filmmakers-ethnic-cleansing",
    "timestamp": "2025-03-03T19:45:06Z"
  },
  {
    "title": "Iowa Becomes First State to Remove ‘Gender Identity’ as a Protected Class",
    "description": "While President Donald Trump has been tackling LGBTQ+ activism at the federal level, Iowa has become the first state to pass a bill that removes... Read More\nThe post Iowa Becomes First State to Remove ‘Gender Identity’ as a Protected Class appeared first on …",
    "link": "https://www.dailysignal.com/2025/03/03/iowa-gov-signs-law-removing-gender-identity-protected-class/",
    "timestamp": "2025-03-03T19:44:46Z"
  },
  {
    "title": "Hot Mic Catches Trump Giving Orders Seconds After Reporters Left Bombshell Oval Office Meeting",
    "description": "Trump was caught on a still-hot microphone giving instructions to his staff seconds after reporters left the Oval Office following Trump's blowup with Zelensky.\nThe post Hot Mic Catches Trump Giving Orders Seconds After Reporters Left Bombshell Oval Office Me…",
    "link": "https://www.mediaite.com/news/hot-mic-catches-trump-giving-orders-seconds-after-reporters-left-bombshell-oval-office-meeting/",
    "timestamp": "2025-03-03T19:43:55Z"
  },
  {
    "title": "The One Way to Improve the Economy Without Raising Inflation or Debt",
    "description": "The Trump administration is doubling down on deregulation: Where the previous Trump administration removed five regulations for every new one, the target is now 10.... Read More\nThe post The One Way to Improve the Economy Without Raising Inflation or Debt app…",
    "link": "https://www.dailysignal.com/2025/03/03/the-one-way-to-improve-the-economy-without-raising-inflation-or-debt/",
    "timestamp": "2025-03-03T19:41:04Z"
  },
  {
    "title": "Why Are These Snowflakes So Upset Over Having To 'Press 1 For English?'",
    "description": "Trump issued an executive order making English the official language of the US.",
    "link": "https://www.wonkette.com/p/why-are-these-snowflakes-so-upset",
    "timestamp": "2025-03-03T19:40:41Z"
  },
  {
    "title": "Ted Cruz on Zelensky Demands: ‘Our Checkbook Is Done’",
    "description": "“Our checkbook is done,” Sen. Ted Cruz (R-TX) said during the latest episode of The Verdict podcast, discussing the tense exchange Ukrainian leader Volodymyr Zelensky had with President Donald Trump and Vice President JD Vance on Friday. “My view is America f…",
    "link": "https://freerepublic.com/focus/f-news/4301813/posts",
    "timestamp": "2025-03-03T19:39:32Z"
  },
  {
    "title": "'It never should have happened' Americans frustrated by Trump-Zelensky spat",
    "description": "American voters expressed frustration at one or both leaders for their roles in the dispute that shocked the world.",
    "link": "https://www.bbc.com/news/articles/cvg17jmm5vxo",
    "timestamp": "2025-03-03T19:39:07Z"
  },
  {
    "title": "Trump Makes New Tariff Announcement as He Prepares to Address Congress",
    "description": "Tariffs on Mexico and Canada are set to take effect on Tuesday, barring last-minute intervention from President Donald Trump.",
    "link": "https://www.newsweek.com/trump-announces-new-tariffs-before-congress-address-2038938",
    "timestamp": "2025-03-03T19:38:24Z"
  },
  {
    "title": "Trump Holds Meeting to Discuss Possibility of Cutting Off Ukraine: Report",
    "description": "A new report says cutting off all military aid to Ukraine could be on the table as President Donald Trump looks ahead.",
    "link": "https://www.westernjournal.com/trump-holds-meeting-discuss-possibility-cutting-off-ukraine-report/",
    "timestamp": "2025-03-03T19:37:36Z"
  },
  {
    "title": "Trump to make investment announcement as he meets with CEO of Taiwan giant chipmaker TSMC",
    "description": "Trump to make investment announcement as he meets with CEO of Taiwan giant chipmaker TSMC\nWASHINGTON (AP) — President Donald Trump is due to announce Monday that chip giant Taiwan Semiconductor Manufacturing Co. plans to invest $100 billion in the United Stat…",
    "link": "https://biztoc.com/x/d85e3e8b2c024d15",
    "timestamp": "2025-03-03T19:37:03Z"
  },
  {
    "title": "Trump's Strategic Crypto Reserve to Hold Assets Backed by His Crypto Czar",
    "description": "President Donald Trump's weekend announcement of a U.S. Strategic Crypto Reserve has sent shockwaves through financial and political circles, with market enthusiasts see it as a bold step toward making America the \"Crypto Capital of the World,\" as Trump has p…",
    "link": "https://biztoc.com/x/42ec82bb8d6e1e86",
    "timestamp": "2025-03-03T19:36:49Z"
  },
  {
    "title": "Trump turns toward Russia, breaking with decades of U.S. policy",
    "description": "The extraordinary pivot is upending decades of hawkish foreign policy, raising questions about the future of post-World War II global security project.",
    "link": "https://www.nbcnews.com/news/us-news/trump-turns-russia-breaking-decades-us-policy-rcna194518",
    "timestamp": "2025-03-03T19:35:37Z"
  },
  {
    "title": "Musk wants to leave NATO. Thanks to Marco Rubio, that's a lot harder",
    "description": "In 2023, Congress passed a law that would require any president to seek approval before the US could leave NATO.",
    "link": "https://www.businessinsider.com/elon-musk-nato-withdrawal-us-marco-rubio-2025-3",
    "timestamp": "2025-03-03T19:35:11Z"
  },
  {
    "title": "Trans High School Track Star Wins Triple Jump by 8 Feet",
    "description": "Following two track and field competitions conservatives have taken to social media to condemn the results of a transgender high school athlete.",
    "link": "https://www.newsweek.com/transgender-high-school-track-star-wins-triple-8-feet-2038919",
    "timestamp": "2025-03-03T19:35:08Z"
  },
  {
    "title": "PoliticsNEW: Trump ‘More Popular Than Ever Before’ After Two Months, Poll Reveals",
    "description": "CNN’s Harry Enten delivered a reality check during Monday’s broadcast, laying out the shifting American sentiment on the Russia-Ukraine conflict and showcasing President Donald Trump’s strong approval numbers compared to his predecessor, Joe Biden. Known for …",
    "link": "https://freerepublic.com/focus/f-bloggers/4301812/posts",
    "timestamp": "2025-03-03T19:35:06Z"
  },
  {
    "title": "Us Seeks Plan For Possible Russia Sanctions Relief: Report",
    "description": "The United States is drawing up a plan to potentially give Russia sanctions relief as President Donald Trump seeks to restore ties with Moscow and stop the war in Ukraine, a U.S. official and another person familiar with the matter told Reuters.",
    "link": "https://www.ndtv.com/world-news/us-seeks-plan-for-possible-russia-sanctions-relief-report-7840965",
    "timestamp": "2025-03-03T19:33:49Z"
  },
  {
    "title": "'Trump Lost His Temper': Karoline Leavitt Ripped By Fox News Host Over Zelensky Clash",
    "description": "White House Press Secretary Karoline faced backlash from Fox News host Howard Kurtz after she defended President Donald Trump's recent ambush of Ukrainian President Volodymyr Zelensky at the White House.\n\n\nDuring his Sunday morning Media Buzz program, the Fox…",
    "link": "https://crooksandliars.com/2025/03/trump-lost-his-temper-karoline-leavitt",
    "timestamp": "2025-03-03T19:33:48Z"
  },
  {
    "title": "Ron Wyden Doing What Every Dem Should Do For Donald's Address To Congress",
    "description": "Oregon Democrat U.S. Senator Ron Wyden is doing precisely what all Democrats should do for Donald Krasnov Trump's State of the Union address on Tuesday night. While some Democrats are not boycotting Donald's address to a joint session of Congress, they are in…",
    "link": "https://crooksandliars.com/2025/03/ron-wyden-doing-what-every-dem-should-do",
    "timestamp": "2025-03-03T19:33:42Z"
  },
  {
    "title": "Federal workers face second Musk deadline to explain their work last week",
    "description": "The request has become a flashpoint within the government workforce.",
    "link": "https://www.bostonherald.com/2025/03/03/trump-doge-emails/",
    "timestamp": "2025-03-03T19:33:31Z"
  },
  {
    "title": "‘Give The Whole Story’: Caller Confronts ‘The Breakfast Club’ Over Its Coverage Of Trump-Zelenskyy Clash",
    "description": "A caller on \"The Breakfast Club\" confronted the show for failing to provide the full context on how Donald Trump's clash with Volodymyr Zelenskyy unfolded.",
    "link": "https://dailycaller.com/2025/03/03/caller-confronts-breakfast-club-trump-zelenskyy-clash/",
    "timestamp": "2025-03-03T19:31:44Z"
  },
  {
    "title": "OPEC+ to Begin Long-Delayed Supply Hike Amid Trump Pressure",
    "description": "OPEC+ will proceed with plans to revive halted oil production after repeated delays, amid pressure from President Donald Trump to lower oil prices.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-to-begin-long-delayed-supply-hike-amid-trump-pressure",
    "timestamp": "2025-03-03T19:31:30Z"
  },
  {
    "title": "Trump's Strategic Crypto Reserve to Hold Assets Backed by His Crypto Czar",
    "description": "The reserve will include Bitcoin, Ethereum, Solana, XRP, and Cardano—which rank among the top holdings of a firm that was backed by David Sacks.",
    "link": "https://www.newsweek.com/david-sacks-crypto-reserve-donald-trump-bitcoin-solana-2038902",
    "timestamp": "2025-03-03T19:29:59Z"
  },
  {
    "title": "WATCH LIVE: Senate convenes for vote to confirm Linda McMahon as education secretary",
    "description": "McMahon would face the competing tasks of winding down the Education Department while also escalating efforts to achieve Trump's agenda.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-convenes-for-vote-to-confirm-linda-mcmahon-as-education-secretary",
    "timestamp": "2025-03-03T19:29:54Z"
  },
  {
    "title": "List of States That Want to End Daylight Saving Time",
    "description": "As the date for clocks to go forward approaches, the debate over keeping daylight saving time has continued at the state level.",
    "link": "https://www.newsweek.com/daylight-savings-time-spring-forward-2025-state-legislation-2038866",
    "timestamp": "2025-03-03T19:29:14Z"
  },
  {
    "title": "Treasury Declares New Ownership Reporting Law Will Only Apply To Foreign Companies",
    "description": "According to the Treasury, the department will be issuing proposed rules to narrow the scope of the rule to foreign reporting companies only.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/03/03/treasury-declares-new-ownership-reporting-law--will-only-apply-to--foreign-companies/",
    "timestamp": "2025-03-03T19:28:43Z"
  },
  {
    "title": "Video of Robert De Niro saying '[Expletive] Trump' is from 2018 Tony Awards, not 2025 Oscars",
    "description": "A video authentically shows actor Robert De Niro saying \"F*** Trump\" during his Oscars speech in 2025.",
    "link": "https://www.snopes.com//fact-check/robert-de-niro-trump-oscars/",
    "timestamp": "2025-03-03T19:28:00Z"
  },
  {
    "title": "Pop Star Lizzo Suggests Trump 'Would Start WW3' by Leaving NATO or UN",
    "description": "Left-wing pop star and former Kamala Harris campaign surrogate Lizzo says the left's warnings about President Donald Trump starting Word War III have been vindicated by Elon Musk saying the U.S. should withdraw from the United Nations and NATO.\nThe post Pop S…",
    "link": "https://www.breitbart.com/entertainment/2025/03/03/pop-star-lizzo-suggests-trump-would-start-ww3-by-leaving-nato-or-un/",
    "timestamp": "2025-03-03T19:27:29Z"
  },
  {
    "title": "Hillary Clinton Shreds Donald Trump Over Putin With Scathing One-Liner [barf alert]",
    "description": "Hillary Clinton needed just six words to make her feelings about President Donald Trump’s relationship with Russian President Vladimir Putin crystal clear. On Sunday, the former secretary of state and 2016 Democratic presidential nominee shared a Gizmodo repo…",
    "link": "https://freerepublic.com/focus/f-chat/4301808/posts",
    "timestamp": "2025-03-03T19:26:38Z"
  },
  {
    "title": "Trump Says Tariffs on Agricultural Imports to Start April 2",
    "description": "President Donald Trump said the US would impose tariffs on “external” agricultural products starting on April 2, his latest threat to impose trade barriers on imported goods.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-tariffs-on-agricultural-imports-to-start-april-2",
    "timestamp": "2025-03-03T19:26:33Z"
  },
  {
    "title": "Barstool’s Dave Portnoy calls out Elon Musk over Tesla stock drop: ‘All he cares about right now is DOGE’",
    "description": "As a Tesla shareholder, Portnoy expressed he is 'entitled to ask' in response to Tesla's stock being down the past month.",
    "link": "https://nypost.com/2025/03/03/business/barstools-dave-portnoy-questions-musks-ability-to-run-both-doge-and-tesla/",
    "timestamp": "2025-03-03T19:26:33Z"
  }
]