[
  {
    "title": "Trump urged supporters to see conspiracies everywhere. With Epstein, that's coming back to haunt him (Associated Press)",
    "description": "Associated Press:\nTrump urged supporters to see conspiracies everywhere.  With Epstein, that's coming back to haunt him  —  As his supporters erupt over the Justice Department's failure to release much-hyped records in Jeffrey Epstein's sex trafficking invest…",
    "link": "https://www.memeorandum.com/250715/p21",
    "timestamp": "2025-07-15T12:20:01Z"
  },
  {
    "title": "Russia suggests Trump is emboldening Ukraine, delaying peace",
    "description": "MOSCOW: The Kremlin warned on Tuesday (Jul 15) that US President Donald Trump's pledge of more weapons for Kyiv and threat of sanctions targeting Russian trading partners could embolden Ukraine and further delay already stalled peace efforts. Trump a day earl…",
    "link": "https://www.channelnewsasia.com/world/russia-suggests-trump-emboldening-ukraine-delaying-peace-5239331",
    "timestamp": "2025-07-15T12:16:00Z"
  },
  {
    "title": "Donald Trump Considering Eliminating Capital Gains Tax: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has voiced his support for doing away with the capital gains tax on primary home sales, a move that could benefit homeowners and boost turnover in the housing market, but critics say it …",
    "link": "https://biztoc.com/x/fae8ced4158779ac",
    "timestamp": "2025-07-15T12:15:46Z"
  },
  {
    "title": "Roger Stone says he’s seen the Epstein files and that Trump will be exonerated",
    "description": "Roger Stone: Epstein Files Will Exonerate Trump and Expose the Clintons In a bold and revealing statement, longtime political strategist Roger Stone —a close ally of former President Donald Trump— confirmed he has reviewed the files related to Jeffrey Epstein…",
    "link": "https://gatewayhispanic.com/video/roger-stone-says-hes-seen-epstein-files-that/",
    "timestamp": "2025-07-15T12:15:43Z"
  },
  {
    "title": "Gold rate, silver price predictions: Experts predict short-term prices target",
    "description": "Gold price and silver rate are likely to have support from a number of factors including Donald Trump tariffs.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-rate-silver-price-predictions-experts-predict-short-term-prices-target/articleshow/122509321.cms",
    "timestamp": "2025-07-15T12:15:39Z"
  },
  {
    "title": "Donald Trump asked Volodymyr Zelenskyy if Ukraine could hit Moscow, say people briefed on call (Financial Times)",
    "description": "Financial Times:\nDonald Trump asked Volodymyr Zelenskyy if Ukraine could hit Moscow, say people briefed on call  —  US president encouraged Ukrainian leader to step up deep strikes on Russia  —  Christopher Miller in Kyiv, Henry Foy in Brussels and Max Seddon…",
    "link": "https://www.memeorandum.com/250715/p19",
    "timestamp": "2025-07-15T12:15:01Z"
  },
  {
    "title": "Trump Lobs the Ukraine Ball Into Putin's Court (Alberto Nardelli/Bloomberg)",
    "description": "Alberto Nardelli / Bloomberg:\nTrump Lobs the Ukraine Ball Into Putin's Court  —  The US president seems to have realized Vladimir Putin wasn't serious about peace talks to end his war on Ukraine. … Donald Trump seems to have realized that Vladimir Putin wasn'…",
    "link": "https://www.memeorandum.com/250715/p20",
    "timestamp": "2025-07-15T12:15:01Z"
  },
  {
    "title": "5 things to know before the stock market opens Tuesday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/07/15/5-things-to-know-before-the-stock-market-opens-tuesday-july-15.html",
    "timestamp": "2025-07-15T12:14:13Z"
  },
  {
    "title": "Employees at the nation’s consumer financial watchdog say it’s become toothless under Trump",
    "description": "The Consumer Financial Protection Bureau has seen its enforcement efforts grind to a halt under the Trump administration.",
    "link": "https://www.bostonherald.com/2025/07/15/consumer-watchdog-crisis-employees-talk/",
    "timestamp": "2025-07-15T12:14:02Z"
  },
  {
    "title": "Citigroup profit jumps as volatility drives windfall",
    "description": "Citigroup's profit rose in the second quarter as its traders brought in a windfall from turbulent markets.",
    "link": "https://www.rte.ie/news/business/2025/0715/1523627-citigroup-quarterly-results/",
    "timestamp": "2025-07-15T12:12:10Z"
  },
  {
    "title": "AMD says it will restart MI308 sales to China after US review",
    "description": "Advanced Micro Devices, AMD, plans to resume shipping MI308 chips to China. This follows US approval after a similar decision for Nvidia. The US Commerce Department will review AMD's license applications. Earlier restrictions on MI308 chips were projected to …",
    "link": "https://economictimes.indiatimes.com/tech/technology/amd-says-it-will-restart-mi308-sales-to-china-after-us-review/articleshow/122509021.cms",
    "timestamp": "2025-07-15T12:11:16Z"
  },
  {
    "title": "Jeffrey Epstein Was an Intelligence Asset—Eric Weinstein",
    "description": "Weinstein made the comments on an episode of the popular podcast Diary of a CEO.",
    "link": "https://www.newsweek.com/jeffrey-epstein-intelligence-asset-eric-weinstein-stephen-bartlett-diary-ceo-2099041",
    "timestamp": "2025-07-15T12:08:37Z"
  },
  {
    "title": "Donald Trump Considering Eliminating Capital Gains Tax: What to Know",
    "description": "\"I think it's going to be a great incentive,\" Trump said when asked about a bill that could eliminate a tax on primary home sales.",
    "link": "https://www.newsweek.com/trump-eliminating-capital-gains-tax-housing-market-2099031",
    "timestamp": "2025-07-15T12:08:16Z"
  },
  {
    "title": "Trump’s Ukraine Pivot: “Tough on Putin Approach”. The Sanctioning of Russia of 2025.",
    "description": "In a somewhat surprising turn, President Donald Trump has announced a significant shift in US policy toward the Russia-Ukraine conflict, signaling a “tougher” approach to Moscow that challenges the narrative of him as a “pro-Russian” figure. The American Pres…",
    "link": "https://www.globalresearch.ca/trump-ukraine-pivot-tough-moscow/5895074",
    "timestamp": "2025-07-15T12:05:42Z"
  },
  {
    "title": "Russia unrattled after Trump's threat of 'very severe tariffs'",
    "description": "President Donald Trump may have expected a Russian shudder of fear to greet his threat of “very severe tariffs” on the country if it didn’t agree a ceasefire in Ukraine.",
    "link": "https://www.nbcnews.com/world/russia/donald-trump-tariffs-russia-ukraine-war-moscow-stock-exchange-rcna218810",
    "timestamp": "2025-07-15T12:05:13Z"
  },
  {
    "title": "Chinese firms rush to buy Nvidia AI chips",
    "description": "Chinese firms are scrambling to buy Nvidia's H20 artificial intelligence chips, two sources told Reuters, as the company said it planned to resume sales to the mainland days after its CEO met US President Donald Trump.",
    "link": "https://www.rte.ie/news/business/2025/0715/1523622-chinese-firms-rush-to-buy-nvidia-ai-chips/",
    "timestamp": "2025-07-15T12:04:31Z"
  },
  {
    "title": "Forbes Daily: Elon Has New Government Partnership With XAI Contract",
    "description": "Today’s Forbes Daily covers President Trump’s tariff flip flops and updates with Russia, new rare earths mine in the U.S., AI tools for doctors, flight delays and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/15/forbes-daily-elon-has-new-government-partnership-with-xai-contract/",
    "timestamp": "2025-07-15T12:03:53Z"
  },
  {
    "title": "Citigroup profit jumps as market volatility drives trading windfall",
    "description": "NEW YORK (Reuters) -Citigroup's profit rose in the second quarter as its traders brought in a windfall from turbulent markets.  Stocks and bonds have...",
    "link": "https://finance.yahoo.com/news/citigroup-profit-jumps-market-volatility-120317543.html",
    "timestamp": "2025-07-15T12:03:17Z"
  },
  {
    "title": "Employees at nation's consumer financial watchdog say it has become toothless under Trump",
    "description": "The Consumer Financial Protection Bureau faces operational paralysis. Employees are idle due to White House directives. The bureau is undoing past regulations. Settlements with companies like Navy Federal and Toyota are rescinded. Consumer complaints are not …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/employees-at-nations-consumer-financial-watchdog-say-it-has-become-toothless-under-trump/articleshow/122508715.cms",
    "timestamp": "2025-07-15T12:02:38Z"
  },
  {
    "title": "Watch: How do you get a phone call with the president?",
    "description": "The BBC's Gary O'Donoghue shares the story behind his exclusive telephone interview with Donald Trump.",
    "link": "https://www.bbc.com/news/videos/cdx5pw4kdgwo",
    "timestamp": "2025-07-15T12:02:12Z"
  },
  {
    "title": "Trump and Sen. Dave McCormick team up to promote energy investments in Pennsylvania",
    "description": "Trump and Sen. David McCormick of Pennsylvania to announce $70 billion of energy investments.",
    "link": "https://www.bostonherald.com/2025/07/15/trump-energy-investments-pennsylvania-visit/",
    "timestamp": "2025-07-15T12:02:04Z"
  },
  {
    "title": "Positive outlook shared by German investors as tariff fears subside",
    "description": "German investor sentiment rose more than expected in the past month, a closely-watched survey showed Tuesday, as markets shrugged off tariff threats made by US President Donald Trump.",
    "link": "https://www.thelocal.de/20250715/positive-outlook-shared-by-german-investors-as-tariff-fears-subside",
    "timestamp": "2025-07-15T12:01:32Z"
  },
  {
    "title": "Kai Trump reveals 'special bond' shared with grandfather that shaped her budding golf career",
    "description": "Kai Trump shares the special bond with grandfather Donald Trump through golf, crediting him for teaching perseverance as she prepares to play at the University of Miami.",
    "link": "https://www.foxnews.com/media/kai-trump-reveals-special-bond-shared-grandfather-shaped-her-budding-golf-career",
    "timestamp": "2025-07-15T12:00:57Z"
  },
  {
    "title": "WATCH: Steve Bannon Electrifies Turning Point USA in Tampa with Hardcore Populist Speech – ‘The Deep State Must Be Destroyed to Free the American People’ – Bannon Delivers the Roadmap for American Justice (Video)",
    "description": "On Saturday, July 12, conservative populist titan Steve Bannon electrified the Turning Point USA Student Action Summit in Tampa, FL, by delivering a hardcore, patriotic speech in primetime.\nThe post WATCH: Steve Bannon Electrifies Turning Point USA in Tampa w…",
    "link": "https://www.thegatewaypundit.com/2025/07/watch-steve-bannon-electrifies-turning-point-usa-tampa/",
    "timestamp": "2025-07-15T12:00:21Z"
  },
  {
    "title": "Former Army officer to challenge for Colorado Springs congressional district",
    "description": "Jessica Killin, a Democrat, will take on freshman Republican U.S. Rep. Jeff Crank for the El Paso County district. Killin is a U.S. Army veteran, lawyer and former chief of staff to former second gentleman Doug Emhoff.",
    "link": "https://www.denverpost.com/2025/07/15/jessica-killin-democrat-colorado-5th-congressional-district-2026/",
    "timestamp": "2025-07-15T12:00:18Z"
  },
  {
    "title": "President flails as Epstein storm rages around his govt...",
    "description": "Donald Trump very rarely loses control of his own story. But the Jeffrey Epstein saga is beyond his powers to quell.",
    "link": "https://www.cnn.com/2025/07/15/politics/epstein-conspiracy-bondi-trump-analysis",
    "timestamp": "2025-07-15T12:00:03Z"
  },
  {
    "title": "2 Minutes And 53 Seconds",
    "description": "<ul>\n<li>The War On Truth</li>\n<li>A Real Doozy</li>\n<li>Zealots</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/2-minutes-and-53-seconds",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "Queer Women and the Question of Marriage in the United States: Desire, Ambivalence, and Resistance",
    "description": "When same-sex marriage became legal nationwide in the United States in 2015, it was heralded as a monumental victory in the long struggle for LGBTQ+ rights. For many, this legal shift symbolized full citizenship—access not only to tax benefits and hospital vi…",
    "link": "https://thesocietypages.org/ccf/2025/07/15/queer-women-and-the-question-of-marriage-in-the-united-states-desire-ambivalence-and-resistance/",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "Inside the Grassroots Fight Against Trump’s Deportation Machine",
    "description": "Armed with phone cameras and training, groups like Unión del Barrio and LUCE stand between immigrants and ICE",
    "link": "http://www.rollingstone.com/politics/politics-features/union-del-barrio-luce-grassroots-ice-resistance-1235382748/",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "Trump Must Make the Abraham Accords the Center of His Middle East Strategy",
    "description": "An Abraham Accords-centric approach tailors the Cold War-era “containment” strategy that George F. Kennan formulated to the Middle East, with Iran standing in for the Soviet Union.\nThe post Trump Must Make the Abraham Accords the Center of His Middle East Str…",
    "link": "https://nationalinterest.org/blog/buzz/trump-abraham-accords-middle-east-strategy-bw",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "What just happened in Rio should terrify the West",
    "description": "The 17th BRICS summit was more than a photo op. It was a coordinated rejection of Western power – and a declaration of intent A few days ago, the city of Rio de Janeiro hosted the 17th BRICS summit, marking a significant step forward for the organization amid…",
    "link": "https://www.activistpost.com/what-just-happened-in-rio-should-terrify-the-west/",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "Shane Vaughn Compares The MAGA Outrage Over Epstein Files To The Crucifixion Of Christ",
    "description": "MAGA pastor Shane Vaughn literally compares the right-wing outrage of the Epstein files to the crucifixion of Jesus: \"One can't help but wonder if history is not repeating itself and we are not delivering Donald Trump to the crucifixion of his enemies.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/shane-vaughn-compares-maga-outrage-over-epstein-files-crucifixion-christ",
    "timestamp": "2025-07-15T12:00:00Z"
  },
  {
    "title": "Federal judges refuse to permanently appoint interim US attorney in NY",
    "description": "A panel of federal judges declined to permanently appoint John Sarcone, who recently claimed he was attacked by an illegal immigrant in Albany, New York.",
    "link": "https://www.foxnews.com/politics/federal-judges-refuse-permanently-appoint-interim-us-attorney-ny",
    "timestamp": "2025-07-15T11:59:51Z"
  },
  {
    "title": "House unanimously votes to memorialize Texas girl allegedly slain by illegal immigrants",
    "description": "The House voted unanimously to rename a nature preserve in Texas after a girl allegedly slain by illegal immigrants.",
    "link": "https://www.foxnews.com/politics/house-unanimously-votes-memorialize-texas-girl-allegedly-slain-illegal-immigrants",
    "timestamp": "2025-07-15T11:59:15Z"
  },
  {
    "title": "GOP Congressman Could Get Evicted From Washington Apartment Over Unpaid Rent",
    "description": "The House lawmaker claimed he had notified the management company of technical issues he was experiencing with the online payment system.",
    "link": "https://www.huffpost.com/entry/cory-mills-sued-over-unpaid-rent_n_68762406e4b0b1c6f125bd90",
    "timestamp": "2025-07-15T11:57:33Z"
  },
  {
    "title": "Judge blocks Biden-era rule on medical debt and credit reports",
    "description": "Americans’ unpaid medical bills will remain on their credit reports after a federal judge last week annulled a Biden-era Consumer Financial Protection Bureau rule that would have removed such debt.",
    "link": "https://www.wisn.com/article/medical-debt-credit-reports-judge-ruling/65411873",
    "timestamp": "2025-07-15T11:56:08Z"
  },
  {
    "title": "'Not out of the woods': Conservative warns Trump may have to 'throw MAGA a bone'",
    "description": "President Donald Trump seems to have tamped down a MAGA rebellion for now — but he might be forced to offer some concessions to his most rabid followers, an analyst said Tuesday.The president's followers revolted after his Department of Justice stated that di…",
    "link": "https://www.rawstory.com/trump-espstein-case/",
    "timestamp": "2025-07-15T11:55:30Z"
  },
  {
    "title": "Trump returns to Pittsburgh for Energy Summit at Carnegie Mellon",
    "description": "President Donald Trump will be in Pittsburgh today to attend Sen. Dave McCormick's summit at Carnegie Mellon. Gov. Shapiro is also expected to take part in a panel.",
    "link": "https://www.wtae.com/article/trump-pittsburgh-carneigie-mellon-energy-ai-summit/65398493",
    "timestamp": "2025-07-15T11:54:56Z"
  },
  {
    "title": "US stock market futures today: Nasdaq jumps on Nvidia’s 5% surge after China chip news, S&P 500 hits record highs, Dow lags on trade tariff worries",
    "description": "US stock market futures today are mixed as the Nasdaq‑100 jumps over 0.6%, powered by a 5% rise in Nvidia shares after the tech giant got the green light to resume H20 AI chip shipments to China. The S&P 500 climbs around +0.4%, hitting new highs with strong …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-today-nasdaq-jumps-on-nvidias-5-surge-after-china-chip-news-sp-500-hits-record-highs-dow-lags-on-trade-tariff-worries/articleshow/122507383.cms",
    "timestamp": "2025-07-15T11:54:13Z"
  },
  {
    "title": "India's exports to remain unchanged in key product categories despite US tariffs: NITI Aayog Report",
    "description": "\"The data suggests strong growth opportunities in targeted product categories while highlighting areas where India's export status is expected to remain unchanged,\" the report added",
    "link": "https://www.thehindubusinessline.com/economy/indias-exports-to-remain-unchanged-in-key-product-categories-despite-us-tariffs-niti-aayog-report/article69814698.ece",
    "timestamp": "2025-07-15T11:54:13Z"
  },
  {
    "title": "Satellite Photo Captures US Aircraft Carrier Deployed Near Iran",
    "description": "While the USS Nimitz is deployed in the Middle East, a second aircraft carrier, the USS Carl Vinson, has left the region",
    "link": "https://www.newsweek.com/us-aircraft-carrier-nimitz-iran-satellite-2099090",
    "timestamp": "2025-07-15T11:53:22Z"
  },
  {
    "title": "Russia Suggests Trump Is Emboldening Ukraine, Delaying Peace",
    "description": "The Kremlin warned Tuesday that US President Donald Trump's pledge of more weapons for Kyiv and threat of sanctions targeting Russian trading partners could embolden Ukraine and further delay already stalled peace efforts.",
    "link": "https://www.ibtimes.com/russia-suggests-trump-emboldening-ukraine-delaying-peace-3778519",
    "timestamp": "2025-07-15T11:51:29Z"
  },
  {
    "title": "Russia Suggests Trump Is Emboldening Ukraine, Delaying Peace",
    "description": "The Kremlin warned Tuesday that US President Donald Trump's pledge of more weapons for Kyiv and threat of sanctions targeting Russian trading partners could embolden Ukraine and further delay already stalled peace efforts.",
    "link": "https://www.ibtimes.com.au/russia-suggests-trump-emboldening-ukraine-delaying-peace-1859674",
    "timestamp": "2025-07-15T11:51:09Z"
  },
  {
    "title": "BlackRock's assets hit record $12.53 trillion: What's fuelling the surge?",
    "description": "BlackRock's assets under management hit $12.53 trillion in Q2 2025. As part of its growth strategy, the firm is pivoting towards private markets and technology.",
    "link": "https://www.livemint.com/companies/news/blackrocks-assets-hit-record-12-53-trillion-whats-fuelling-the-surge-11752578625978.html",
    "timestamp": "2025-07-15T11:50:48Z"
  },
  {
    "title": "Ukrainians welcome US aid but see Trump’s 50-day ultimatum to Putin as too long",
    "description": "Ukrainians welcomed President Donald Trump’s pledge of more US-made weapons in their fight against Russia’s invasion, even though it is unclear what exactly they will get and how quickly.",
    "link": "https://www.independent.ie/world-news/europe/ukrainians-welcome-us-aid-but-see-trumps-50-day-ultimatum-to-putin-as-too-long/a232287222.html",
    "timestamp": "2025-07-15T11:49:12Z"
  },
  {
    "title": "Undermining district courts",
    "description": "Speaking of SCOTUS' Order staying the injunction in McMahon, a WH spokesperson said the Court \"once again recognized what radical district court judges refuse to accept--President Trump, as head of the executive branch, has absolute constitutional authority t…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/07/undermining-district-courts.html",
    "timestamp": "2025-07-15T11:45:43Z"
  },
  {
    "title": "Russia does not care about Trump's 'theatrical ultimatum', senior official says",
    "description": "The Kremlin has so far not commented on Trump's remarks but said on Monday it was clear that the United States had continued to supply weapons and ammunition to Ukraine",
    "link": "https://www.thehindubusinessline.com/news/world/russia-does-not-care-about-trumps-theatrical-ultimatum-senior-official-says/article69814730.ece",
    "timestamp": "2025-07-15T11:45:41Z"
  },
  {
    "title": "Elon Musk’s Tesla touches down in India as Anand Mahindra welcomes him to the EV market, says ‘see you at the charger’",
    "description": "Tesla has formally stepped into India’s electric vehicle market with its first Experience Centre at Maker Maxity Mall in Mumbai’s Bandra Kurla Complex. Anand Mahindra welcomed Elon Musk with an open challenge, calling the entry healthy for India’s EV ambition…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/elon-musks-tesla-touches-down-in-india-as-anand-mahindra-welcomes-him-to-the-ev-market-says-see-you-at-the-charger/articleshow/122506737.cms",
    "timestamp": "2025-07-15T11:45:40Z"
  },
  {
    "title": "Donald Trump is keeping the FIFA Club World Cup trophy, the winner got a replica",
    "description": "Over the weekend, Donald Trump attended the FIFA Club World Cup, which happened to be held in New Jersey this year. Not only did Trump attend the final, he waddled onto the pitch to hand out the trophy, then refused to move off to the side when photographers …",
    "link": "https://www.celebitchy.com/931041/donald_trump_is_keeping_the_fifa_club_world_cup_trophy_the_winner_got_a_replica/",
    "timestamp": "2025-07-15T11:45:31Z"
  },
  {
    "title": "With the U.S. reversing policy, China’s ByteDance and Tencent have applied for NVIDIA’s H20 Chips that were once banned for export",
    "description": "Nvidia said on Monday that it would resume sales of its H20 chips to China and that the U.S. government had guaranteed that it would issue an export license for the chips.",
    "link": "https://www.patentlyapple.com/2025/07/with-the-us-reversing-policy-chinas-bytedance-and-tencent-have-applied-for-nvidias-h20-chips-that-were-once-banned-f.html",
    "timestamp": "2025-07-15T11:44:11Z"
  },
  {
    "title": "A Fed Nightmare Is Suddenly Coming True Just As Bitcoin Hits Another All-Time High Price",
    "description": "Trump is threatening to create a Federal Reserve independence nightmare for markets as the bitcoin price hits an all-time high...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/15/a-fed-nightmare-is-suddenly-coming-true-just-as-bitcoin-hits-another-all-time-high-price/",
    "timestamp": "2025-07-15T11:43:28Z"
  },
  {
    "title": "Mark Cuban Refers To Zohran Mamdani As 'Trump 101,' Drawing Parallels Between Their Election Campaigns: 'This Guy Is...Telling Me He's Going To Walk On Water'",
    "description": "In a recent podcast, billionaire entrepreneur Mark Cuban pointed out a striking similarity between New York City mayoral candidate Zohran Mamdani and President Donald Trump, despite their differing political ideologies.\nWhat Happened: On the “Pod Save America…",
    "link": "https://biztoc.com/x/2da30c58424a7b77",
    "timestamp": "2025-07-15T11:42:49Z"
  },
  {
    "title": "Nvidia shares jump 5.2% pre-market on chips exception from Trump administration",
    "description": "Shares were mostly higher in Europe on Monday following gains in Asian markets despite lingering worries about President Donald Trump’s latest updates to his tariffs.\nShares in tech giant Nvidia jumped 5.2% in pre-market trading after its CEO said the Trump a…",
    "link": "https://biztoc.com/x/c1df8a7c922a7f3b",
    "timestamp": "2025-07-15T11:42:41Z"
  },
  {
    "title": "After meeting with Trump, Nvidia CEO says the sale of AI chip is back on in China",
    "description": "The news came in a company blog post late Monday and Huang also spoke about the coup on China's state-run CGTN television network in remarks shown on X. \"The U.S. government has assured Nvidia that licenses will be granted, and Nvidia hopes to start deliverie…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/after-meeting-with-trump-nvidia-ceo-says-the-sale-of-ai-chip-is-back-on-in-china/articleshow/122507504.cms",
    "timestamp": "2025-07-15T11:40:58Z"
  },
  {
    "title": "Trump’s Brinkmanship Escalates: Sanctions, Ultimatums and Bomb Threats That Could Spiral Worldwide Beyond Control. Prof. Ruel Pepa",
    "description": "U.S. President Donald Trump has sharply escalated his confrontational approach to foreign policy, issuing a series of hardline statements and policy threats that have reverberated across the international community. In a dramatic shift that has alarmed both g…",
    "link": "https://www.globalresearch.ca/trump-brinkmanship-escalates-sanctions/5895044",
    "timestamp": "2025-07-15T11:40:20Z"
  },
  {
    "title": "WH Reacts to Report That Trump 'Encouraged' A Moscow Strike",
    "description": "The Financial Times reports that President Donald Trump and Ukraine President Volodymyr Zelenskyy discussed whether long-range weapons could target Moscow. Now, the White House is responding to the report saying Trump was \"merely asking a question, not encour…",
    "link": "https://www.today.com/video/wh-reacts-to-report-that-trump-encouraged-a-moscow-strike-243240005874",
    "timestamp": "2025-07-15T11:39:43Z"
  },
  {
    "title": "Trump Threatens Russia With Tariffs, as the Rhetoric Escalates",
    "description": "The war between Russia and Ukraine has been unrelenting over the last 24 hours as Ukraine says Russia launched around 5,500 attacks. Now, President Donald Trump is giving President Vladimir Putin 50 days to back down or face secondary tariffs. NBC’s Keir Simm…",
    "link": "https://www.today.com/video/trump-gives-putin-50-days-for-peace-deal-or-secondary-tariffs-243240005874",
    "timestamp": "2025-07-15T11:39:43Z"
  },
  {
    "title": "Stephen Colbert Denounces $16 Million Settlement Paramount Made with Trump: 'Big Fat Bribe' for Skydance Merger",
    "description": "Late-night host Stephen Colbert denounced his parent company's $16 million settlement with President Donald Trump, calling it a \"big, fat bribe.\"\nThe post Stephen Colbert Denounces $16 Million Settlement Paramount Made with Trump: ‘Big Fat Bribe’ for Skydance…",
    "link": "https://www.breitbart.com/entertainment/2025/07/15/stephen-colbert-denounces-16-million-settlement-paramount-made-with-trump-big-fat-bribe-for-skydance-merger/",
    "timestamp": "2025-07-15T11:38:36Z"
  },
  {
    "title": "ECB to test banks' resilience to geopolitical risk",
    "description": "The European Central Bank will test banks' resilience to geopolitical risk next year, telling them to come up with scenarios that would wipe out large chunks of their capital, chief ECB supervisor Claudia Buch said today.",
    "link": "https://www.rte.ie/news/business/2025/0715/1523616-ecb-to-test-resilience-to-geopolitical-risk-in-2026/",
    "timestamp": "2025-07-15T11:36:11Z"
  },
  {
    "title": "Netherlands, Denmark look to join Trump’s Ukraine arms plan",
    "description": "One of the major questions hanging over the new plan is how fast it can get desperately needed weaponry to Ukraine as it faces nightly Russian bombardments.",
    "link": "https://www.euractiv.com/section/defence/news/netherlands-denmark-look-to-join-trumps-ukraine-arms-plan/",
    "timestamp": "2025-07-15T11:36:07Z"
  },
  {
    "title": "Trump’s Africa pivot isn’t generosity. It’s leverage",
    "description": "The US president used a White House meeting to showcase his shift in policy from foreign aid to direct trade and private investment Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/621471-white-house-african-mini-summit/",
    "timestamp": "2025-07-15T11:33:45Z"
  },
  {
    "title": "Nvidia shares jump 5.2% pre-market on chips exception from Trump administration",
    "description": "Shares were mostly higher in Europe on Monday following gains in Asian markets despite lingering worries about President Donald Trump’s tariffs.",
    "link": "https://fortune.com/2025/07/15/nvidia-shares-jump-5-percent-pre-market-trump-tariffs-market/",
    "timestamp": "2025-07-15T11:32:52Z"
  },
  {
    "title": "Trump urged supporters to see conspiracies everywhere. With Epstein, that's coming back to haunt him",
    "description": "President Donald Trump’s strategy has been to downplay the uproar over the Jeffrey Epstein sex trafficking case as his supporters demand the Justice Department release much-hyped records in the investigation.",
    "link": "https://www.clickondetroit.com/business/2025/07/15/trump-urged-supporters-to-see-conspiracies-everywhere-with-epstein-thats-coming-back-to-haunt-him/",
    "timestamp": "2025-07-15T11:32:06Z"
  },
  {
    "title": "Oversight Committee Member Calls For More Subpoenas As Biden Aides Lawyer Up",
    "description": "The New York Times' story on the Biden autopen scandal raises more questions -- and urgency for investigators to secure testimony.",
    "link": "https://thefederalist.com/2025/07/15/oversight-committee-member-calls-for-more-subpoenas-as-biden-aides-lawyer-up/",
    "timestamp": "2025-07-15T11:31:47Z"
  },
  {
    "title": "Trump threatens secondary tariffs on Russia allies",
    "description": "US President Donald Trump’s tougher stance on Russia opened a new front in a trade war that has expanded to encompass global security.\nTrump threatened secondary tariffs on any country trading with Moscow if the Kremlin did not agree to peace in Ukraine, pote…",
    "link": "https://biztoc.com/x/b9b2fbe52701003a",
    "timestamp": "2025-07-15T11:31:45Z"
  },
  {
    "title": "Map Shows States Hitting Trump With Major $6.8 Billion Lawsuit",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNearly half of the country's states and the District of Columbia (DC) sued the Trump administration on Monday for $6.8 billion over education funding being withheld.\nThe coalition of 24 states and DC launched …",
    "link": "https://biztoc.com/x/3364fdfee906238a",
    "timestamp": "2025-07-15T11:31:33Z"
  },
  {
    "title": "Sen. David McCormick on the battle for AI innovation: ‘Pennsylvania is at the center of it’",
    "description": "President Donald Trump and Sen. David McCormick of Pennsylvania will jointly announce roughly $70 billion of energy investments in the state Tuesday as the president travels to Pittsburgh for a conference with dozens of top executives to promote his energy an…",
    "link": "https://biztoc.com/x/85c6c290224951b6",
    "timestamp": "2025-07-15T11:31:32Z"
  },
  {
    "title": "MAGA faithful are angry about the Epstein case. Here's what to know",
    "description": "Right-wing influencers were once bolstered by Trump's own claims on the Epstein case, but are now feeling their demands are being squelched by his administration.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_70481f73-9aed-5712-aea5-adac2ba62998.html",
    "timestamp": "2025-07-15T11:30:00Z"
  },
  {
    "title": "Volvo takes a $1.2 billion hit due to U.S. tariffs and production delays",
    "description": "In late May, the company also announced it was cutting 3,000 jobs, around 15 percent of its office-based workforce, nearly half of them in Sweden.",
    "link": "https://fortune.com/europe/2025/07/15/volvo-cars-1-2-billion-hit-tariffs-production-delays-sweden-china-hakan-samuelsson-job-cuts/",
    "timestamp": "2025-07-15T11:25:52Z"
  },
  {
    "title": "Joe Scarborough Roasts MAGA Pundits’ Sudden Epstein Flip After ‘Decade-Long Crusade’: ‘What Happened in 24 Hours?’",
    "description": "Scarborough laughed out loud as he roasted MAGA pundits for their collective and \"overnight\" flip on the Jeffrey Epstein case after a “decade long crusade.”\nThe post Joe Scarborough Roasts MAGA Pundits’ Sudden Epstein Flip After ‘Decade-Long Crusade’: ‘What H…",
    "link": "https://www.mediaite.com/media/tv/joe-scarborough-roasts-maga-pundits-sudden-epstein-flip-after-decade-long-crusade-what-happened-in-24-hours/",
    "timestamp": "2025-07-15T11:25:38Z"
  },
  {
    "title": "Russia is ready to negotiate after Trump comments, but does not accept ultimatums, Rybakov says",
    "description": "Sergei Ryabkov, Russia's Deputy Foreign Minister, stated Moscow's willingness to negotiate. This follows U.S. President Donald Trump's threat of sanctions. The sanctions target buyers of Russian exports. Trump also announced new weapons for Ukraine. He condit…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-is-ready-to-negotiate-after-trump-comments-but-does-not-accept-ultimatums-rybakov-says/articleshow/122506442.cms",
    "timestamp": "2025-07-15T11:25:09Z"
  },
  {
    "title": "Nissan closes its Oppama plant in Japan to cut costs",
    "description": "Nissan will shut down its main Oppama factory in Japan to reduce expenses. Production will shift to Nissan Motor Kyushu by March 2028. The Oppama plant, a symbol for Nissan, once produced the Leaf electric car. CEO Ivan Espinosa assures fair treatment for the…",
    "link": "https://economictimes.indiatimes.com/news/international/business/nissan-closes-its-oppama-plant-in-japan-to-cut-costs/articleshow/122506412.cms",
    "timestamp": "2025-07-15T11:24:38Z"
  },
  {
    "title": "The Trump Administration Is Violating the First Rule of Disasters",
    "description": "Good disaster management is premised on preparation.",
    "link": "https://www.theatlantic.com/science/archive/2025/07/texas-flood-response-preparation/683528/",
    "timestamp": "2025-07-15T11:24:20Z"
  },
  {
    "title": "Meme Coins in 2025: High Risk, High Reward, and Rising Security Threats",
    "description": "Meme coins started as internet jokes, but by 2025, they’ve become one of the most volatile and talked-about…",
    "link": "https://hackread.com/meme-coins-2025-high-risk-reward-security-threats/",
    "timestamp": "2025-07-15T11:23:01Z"
  },
  {
    "title": "Map Shows States Hitting Trump With Major $6.8 Billion Lawsuit",
    "description": "The states say the funding freeze \"will irreparably harm the Plaintiff States, their schools, and the students and families they serve.\"",
    "link": "https://www.newsweek.com/map-shows-states-hitting-trump-major-6-billion-lawsuit-2099011",
    "timestamp": "2025-07-15T11:22:07Z"
  },
  {
    "title": "Summer Storms",
    "description": "“It’s dark on the Left now. They’ve reached that predictable moment where inflicting pain is all they have left.“ — Sasha Stone. Theories on the Epstein mess fly around like a murmuration of starlings wheeling across an angry summer sky. The birds are just bi…",
    "link": "https://freerepublic.com/focus/f-chat/4328757/posts",
    "timestamp": "2025-07-15T11:20:04Z"
  },
  {
    "title": "Trump’s New Russia Policy Is A Turning Point But Will It Be Enough?",
    "description": "While Trump's new Russia policy announcement was welcomed by and large, there are still challenges ahead that will require more from America.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/07/15/trumps-new-russia-policy-is-a-turning-point-but-will-it-be--enough/",
    "timestamp": "2025-07-15T11:18:53Z"
  },
  {
    "title": "Sen. David McCormick on the battle for AI innovation: ‘Pennsylvania is at the center of it’",
    "description": "President Donald Trump and Sen. David McCormick of Pennsylvania are jointly announcing roughly $70 billion of energy investments in the state.",
    "link": "https://fortune.com/2025/07/15/donald-trump-david-mccormick-pennsylvania-70-billion-artificial-intelligence/",
    "timestamp": "2025-07-15T11:18:24Z"
  },
  {
    "title": "Trump Says He’ll Slap Russia with 100% Tariffs If a Ukraine Deal Isn’t Done in 50 Days: What’s Going On?",
    "description": "Trump’s Russia Threat: Trade War Looming Over Ukraine Conflict? Donald Trump, the former US President, has issued a stark warning to Russia, threatening to impose a 100% “secondary tariff” on the nation if a deal isn’t reached with Ukraine within 50 days. Thi…",
    "link": "https://nep123.com/trump-says-hell-slap-russia-with-100-tariffs-if-a-ukraine-deal-isnt-done-in-50-days-whats-going-on/",
    "timestamp": "2025-07-15T11:17:50Z"
  },
  {
    "title": "US Senate freezes 500% Russia tariff bill – Republican leader",
    "description": "Lawmakers will wait as US President Donald Trump considers his own sanctions, Republican leader John Thune has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621509-us-senate-pauses-russia-tariff-bill/",
    "timestamp": "2025-07-15T11:17:20Z"
  },
  {
    "title": "How to Stop the Global Trend Towards World War III. Mojmir Babacek",
    "description": "Donald Trump has set as the main foreign policy goal of his presidency to rid the USA of China's competition in the world economy and politics and thus in the struggle for world domination.\nThe post How to Stop the Global Trend Towards World War III. Mojmir B…",
    "link": "https://www.globalresearch.ca/stop-evolution-world-war/5895071",
    "timestamp": "2025-07-15T11:16:04Z"
  },
  {
    "title": "ICE wants landlords to turn over leases and other info as it ramps up mass-deportation efforts",
    "description": "Eric Teusink, an Atlanta-area real estate attorney, said several clients recently received subpoenas asking for entire files on tenants.",
    "link": "https://fortune.com/2025/07/15/ice-immigration-landlords-leases-rental-information-deportations/",
    "timestamp": "2025-07-15T11:11:24Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is estimated to leave millions without health care. He insists ‘it’s not going to cause death’",
    "description": "President Donald Trump defended his “Big, Beautiful, Bill” during a Fox News interview broadcast on Saturday night, claiming \"it's not going to cause death",
    "link": "https://www.newsbreak.com/share/4104549240121-trump-s-big-beautiful-bill-is-estimated-to-leave-millions-without-health-care-he-insists-it-s-not-going-to-cause-death?_f=app_share&amp;pd=0E8JGH1M&amp;lang=en_US&amp;send_time=1752577786&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.28.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_recall_exp_25q3-v9&amp;s=i2",
    "timestamp": "2025-07-15T11:11:18Z"
  },
  {
    "title": "Will the Government Ever Do Right by Mahmoud Khalil?",
    "description": "Elie Mystal\n\n\n\nKhalil is suing the government for false imprisonment and other harms. He should win—but will the courts let him?\r\n\n\r\n\n\nThe post Will the Government Ever Do Right by Mahmoud Khalil? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/mahmoud-khalil-lawsuit-government/",
    "timestamp": "2025-07-15T11:10:46Z"
  },
  {
    "title": "Trump urged supporters to see conspiracies everywhere. With Epstein, that’s coming back to haunt him",
    "description": "NEW YORK (AP) — As his supporters erupt over the Justice Department’s failure to release much-hyped records in Jeffrey Epstein’s sex trafficking investigation, President Donald Trump’s strategy has been to downplay the issue. His problem? That nothing-to-see-…",
    "link": "https://financialpost.com/pmn/trump-urged-supporters-to-see-conspiracies-everywhere-with-epstein-thats-coming-back-to-haunt-him",
    "timestamp": "2025-07-15T11:09:41Z"
  },
  {
    "title": "Russia Brushes Aside Trump’s Tariff Threat Over War in Ukraine",
    "description": "Russia rejected pressure from Donald Trump after the US president threatened to impose stiff economic penalties on Moscow if it doesn’t end hostilities with Ukraine within 50 days, though the Kremlin indicated it would review his latest stance.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-brushes-aside-trumps-tariff-threat-over-war-in-ukraine",
    "timestamp": "2025-07-15T11:09:27Z"
  },
  {
    "title": "'Wallowing in Corruption': Lobbyist Who Helped Ultra-Rich Dodge Taxes Now Heads Trump Tax Office",
    "description": "A corporate lobbyist who for decades has helped major companies and rich Americans dodge taxes is now serving as the U.S. Treasury Department's top tax policy official, a position in which he will write rules implementing the newly passed Republican budget la…",
    "link": "https://www.commondreams.org/news/ken-kies-trump-tax-cuts",
    "timestamp": "2025-07-15T11:06:19Z"
  },
  {
    "title": "Texas officials defend flood response and Tucker Carlson criticizes Trump: Morning Rundown",
    "description": "Republican strategists want lawmakers to get specific when selling the “big, beautiful bill” to voters.",
    "link": "https://www.nbcnews.com/news/us-news/texas-flood-response-tucker-carlson-trump-morning-rundown-rcna218809",
    "timestamp": "2025-07-15T11:06:03Z"
  },
  {
    "title": "Government should be 'prepared to act' on Taiwan, Angus Taylor says",
    "description": "Shadow Defence Minister Angus Taylor is calling on the government to \"make principled commitments to the security of Taiwan\" amid pressure from the United States.",
    "link": "https://www.abc.net.au/news/2025-07-15/government-should-be-prepared-to-act-on-taiwan-taylor-says/105535912",
    "timestamp": "2025-07-15T11:04:30Z"
  },
  {
    "title": "LA Mayor Karen Bass Now Directing Cash Assistance to Illegal Immigrants Hiding from ICE",
    "description": "Bass insists the cash is not from taxpayers but donors. However, one of the donor groups received nearly $34 million in government grants, mostly from the state of California.\nThe post LA Mayor Karen Bass Now Directing Cash Assistance to Illegal Immigrants Hi…",
    "link": "https://legalinsurrection.com/2025/07/la-mayor-karen-bass-now-directing-cash-assistance-to-illegal-immigrants-hiding-from-ice/",
    "timestamp": "2025-07-15T11:00:54Z"
  },
  {
    "title": "Democrats can’t hide the truth: The Big Beautiful Bill is a victory for you | Opinion",
    "description": "Blackburn: Trump signed a law that cuts your taxes, bolsters border security, and enhances Tennessee jobs, with zero cuts to Medicaid benefits.",
    "link": "https://www.knoxnews.com/story/opinion/columnists/2025/07/15/big-beautiful-bill-is-a-victory-for-the-american-people-opinion/85193308007/",
    "timestamp": "2025-07-15T11:00:48Z"
  },
  {
    "title": "Trump’s threatened 30% tariffs would have ‘very severe impact on the economy’, says Taoiseach",
    "description": "European Commission is preparing its own set of tariffs if talks fail",
    "link": "https://www.irishtimes.com/politics/2025/07/15/trumps-threatened-30-tariffs-would-have-very-severe-impact-on-the-economy-says-taoiseach/",
    "timestamp": "2025-07-15T11:00:36Z"
  },
  {
    "title": "California Sues Trump Administration Again, This Time Over Withheld School Funds",
    "description": "California Attorney General Rob Bonta is suing the Trump administration over nearly $6 billion in withheld federal education funding, marking the state’s latest legal challenge to President Donald Trump’s policies.",
    "link": "https://www.kqed.org/news/12047925/california-sues-trump-administration-again-this-time-over-withheld-school-funds",
    "timestamp": "2025-07-15T11:00:30Z"
  },
  {
    "title": "'Lost their identity': Why Target is struggling to win over shoppers and investors",
    "description": "Target is trying to bounce back from lower store traffic, inventory issues and customer backlash.",
    "link": "https://www.cnbc.com/2025/07/15/target-stock-and-sales-fall-as-ceo-brian-cornell-contract-ends.html",
    "timestamp": "2025-07-15T11:00:01Z"
  },
  {
    "title": "The Pulpit Wasn’t Made for This",
    "description": "Churches are now allowed to endorse political candidates. They should resist the temptation.",
    "link": "https://www.theatlantic.com/culture/archive/2025/07/churches-political-endorsements-irs/683523/",
    "timestamp": "2025-07-15T11:00:00Z"
  },
  {
    "title": "Transcript: Tucker Carlson’s Harsh New Takedown of Trump Rattles MAGA",
    "description": "The following is a lightly edited transcript of the July 15 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.The MAGA move…",
    "link": "https://newrepublic.com/article/197949/transcript-tucker-carlson-harsh-new-takedown-trump-rattles-maga",
    "timestamp": "2025-07-15T10:58:50Z"
  },
  {
    "title": "Ghislaine Maxwell's Lawyer Asks for Donald Trump's Help: 'Dealmaker'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nGhislaine Maxwell's lawyer appeared to invite President Donald Trump to intervene in her Supreme Court appeal against a 20-year prison sentence over Jeffrey Epstein-related sex trafficking.\nDavid Oscar Markus …",
    "link": "https://biztoc.com/x/6690a220e9cc0650",
    "timestamp": "2025-07-15T10:58:48Z"
  }
]