[
  {
    "title": "Trump-Appointed FCC Chair To Europe: If You're Worried About Elon Musk's Starlink After The Ukraine Threat, 'Just Wait For The CCP's Version…'",
    "description": "A top Donald Trump official has urged European allies to back Starlink, a subsidiary of Elon Musk's SpaceX and U.S. tech over China.\nWhat Happened: Federal Communications Commission chairman Brendan Carr told the Financial Times that European hesitation over …",
    "link": "https://biztoc.com/x/4fc8bfafc52b6719",
    "timestamp": "2025-04-16T03:27:23Z"
  },
  {
    "title": "China debates how to handle criminal crypto cache",
    "description": "Money involved in crypto-related crimes surged 10-fold to 430.7 billion yuan ($59 billion) in 2023, according to blockchain security firm SAFEIS. Last year, China sued 3,032 people involved in crypto-related money laundering, according to the country's top pr…",
    "link": "https://economictimes.indiatimes.com/tech/technology/china-debates-how-to-handle-criminal-crypto-cache/articleshow/120329197.cms",
    "timestamp": "2025-04-16T03:18:02Z"
  },
  {
    "title": "AUKUS nuclear submarine sale under scrutiny as Trump tariffs rattle Australia",
    "description": "Doubts surround the AUKUS treaty as Donald Trump's tariffs and concerns over China deterrence impact the sale of nuclear submarines to Australia. Washington worries that transferring submarines to Canberra might weaken Indo-Pacific deterrence, especially give…",
    "link": "https://economictimes.indiatimes.com/news/defence/aukus-nuclear-submarine-sale-under-scrutiny-as-trump-tariffs-rattle-australia/articleshow/120329183.cms",
    "timestamp": "2025-04-16T03:17:06Z"
  },
  {
    "title": "White House starting a new media policy that restricts wire services' access to the president",
    "description": "The White House is implementing a new media policy that restricts access for wire services like The Associated Press, Reuters, and Bloomberg, following a court loss over AP's access. This policy consolidates wire service representation with print reporters, p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-starting-a-new-media-policy-that-restricts-wire-services-access-to-the-president/articleshow/120329172.cms",
    "timestamp": "2025-04-16T03:16:24Z"
  },
  {
    "title": "Chinese Economy Grew 5.4% In First Quarter Amid New US Tariffs",
    "description": "China on Wednesday said its economy grew a forecast-beating 5.4 percent in the first quarter as exporters rushed to get goods out of factory gates ahead of swingeing new US tariffs.",
    "link": "https://www.ndtv.com/world-news/chinese-economy-grew-5-4-in-first-quarter-beating-forecasts-8175242",
    "timestamp": "2025-04-16T03:16:16Z"
  },
  {
    "title": "Stocks Struggle Again As Nvidia Chip Curb Warning Pops Calm",
    "description": "Asian stocks swung Wednesday after Nvidia's announcement of new US licensing rules on shipments of its new chip to China rattled investor confidence already shot by Donald Trump's sweeping trade war.",
    "link": "https://www.ibtimes.com/stocks-struggle-again-nvidia-chip-curb-warning-pops-calm-3770232",
    "timestamp": "2025-04-16T03:15:18Z"
  },
  {
    "title": "Donald Trump Orders Critical Minerals Probe That May Bring New Tariffs",
    "description": "US President Donald Trump ordered a probe Tuesday that may result in tariffs on critical minerals, rare-earth metals and associated products such as smartphones, in an escalation of his dispute with global trade partners.",
    "link": "https://www.ndtv.com/world-news/donald-trump-orders-critical-minerals-probe-that-may-bring-new-tariffs-8175238",
    "timestamp": "2025-04-16T03:12:51Z"
  },
  {
    "title": "Service Members Killed in Crash Near Southern Border: What We Know",
    "description": "Two service members working with the Joint Task Force Southern Border were killed in a vehicle accident in New Mexico.",
    "link": "https://www.newsweek.com/service-members-killed-crash-near-southern-border-what-we-know-2060235",
    "timestamp": "2025-04-16T03:12:35Z"
  },
  {
    "title": "Stocks struggle again as Nvidia chip curb warning pops calm",
    "description": "Asian stocks swung Wednesday after Nvidia’s announcement of new US licensing rules on shipments of its new chip to China rattled investor confidence already shot by Donald Trump’s sweeping trade war. After a relatively peaceful couple of days following last w…",
    "link": "https://www.digitaljournal.com/world/stocks-struggle-again-as-nvidia-chip-curb-warning-pops-calm/article",
    "timestamp": "2025-04-16T03:12:32Z"
  },
  {
    "title": "Seth Rogen's Joke About Donald Trump At Breakthrough Prize Cut Out Of Awards Show Following Livestream - Deadline",
    "description": "Seth Rogen's Joke About Donald Trump At Breakthrough Prize Cut Out Of Awards Show Following LivestreamDeadline Seth Rogen’s Criticism of Silicon Valley’s Support for Trump Was Cut From the “Full” Stream of Breakthrough PrizeThe Hollywood Reporter Seth Rogen’s…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177033003",
    "timestamp": "2025-04-16T03:12:27Z"
  },
  {
    "title": "Chinese Steel Production Surges Despite Beijing’s Pledge to Cut",
    "description": "Chinese crude steel output rose last month, as a surge in exports and lower raw material costs helped drive an improvement in margins.",
    "link": "https://financialpost.com/pmn/business-pmn/chinese-steel-production-surges-despite-beijings-pledge-to-cut",
    "timestamp": "2025-04-16T03:11:47Z"
  },
  {
    "title": "AP Hits Back at Trump After Being Kicked Out of White House Press Pool: ‘A Grave Disservice to the American People’",
    "description": "The Associated Press (AP) hit back at President Donald Trump on Tuesday after being kicked from the White House press pool.\nThe post AP Hits Back at Trump After Being Kicked Out of White House Press Pool: ‘A Grave Disservice to the American People’ first appe…",
    "link": "https://www.mediaite.com/politics/ap-hits-back-at-trump-after-being-kicked-out-of-white-house-press-pool-a-grave-disservice-to-the-american-people/",
    "timestamp": "2025-04-16T03:11:07Z"
  },
  {
    "title": "South Korea, Vietnam pledge cooperation as US tariffs loom",
    "description": "South Korea and Vietnam have agreed to deepen cooperation amidst challenges posed by newly announced U.S. tariffs, which threaten both economies. They aim to increase bilateral trade to $150 billion by 2030, focusing on balanced and sustainable growth. Vietna…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/south-korea-vietnam-pledge-cooperation-as-us-tariffs-loom/articleshow/120328981.cms",
    "timestamp": "2025-04-16T03:09:04Z"
  },
  {
    "title": "The White House is starting a new media policy that restricts wire services' access to the president",
    "description": "Fresh from a courtroom loss over The Associated Press' access to the presidency, the White House on Tuesday put forward a new media policy that sharply...",
    "link": "https://www.yahoo.com/news/white-house-starting-media-policy-030857930.html",
    "timestamp": "2025-04-16T03:08:57Z"
  },
  {
    "title": "2 U.S. service members assigned to U.S.-Mexico border duty killed in N.M. vehicle crash",
    "description": "Two service members were killed and a third was in \"serious\" condition after the vehicle they were in crashed near the U.S.-Mexico border in New Mexico, military officials said Tuesday.",
    "link": "https://www.nbcnews.com/news/us-news/2-us-service-members-assigned-us-mexico-border-duty-killed-nm-vehicle-rcna201464",
    "timestamp": "2025-04-16T03:07:58Z"
  },
  {
    "title": "As Trump considers auto tariffs pause, parts exemptions could be key for US industry",
    "description": "As Trump considers auto tariffs pause, parts exemptions could be key for US industry\nDETROIT (AP) — President Donald Trump hinted that he might temporarily relieve the auto industry from “permanent” tariffs he previously imposed on the business. The president…",
    "link": "https://biztoc.com/x/83ae8e58747ddbb5",
    "timestamp": "2025-04-16T03:05:49Z"
  },
  {
    "title": "Trump's tariffs on Chinese parts for Cybercab, Semi disrupt Tesla's US production plans, source says",
    "description": "Tesla (TSLA.O), opens new tab's plans to ship components from China for Cybercab and Semi electric trucks in the United States were suspended after President Donald Trump raised tariffs on Chinese goods amid a trade war, said a person with direct knowledge.\nT…",
    "link": "https://biztoc.com/x/458dc02d86bab079",
    "timestamp": "2025-04-16T03:05:40Z"
  },
  {
    "title": "Police tase 2 demonstrators at Rep. Marjorie Taylor Greene's town hall",
    "description": "Three audience members were arrested and about twice as many were removed from the event held in the Georgia Republican's district.",
    "link": "https://www.nbcnews.com/politics/congress/police-tase-2-demonstrators-marjorie-taylor-greene-town-hall-acworth-rcna201457",
    "timestamp": "2025-04-16T03:02:29Z"
  },
  {
    "title": "Trump Admin Official Tells ABC News Anchor To Focus Instead On Victims Of MS-13 And TdA",
    "description": "Tricia McLaughlin reminded ABC News Live anchor Jay O’Brien that a man deported to El Salvador was an adjudicated member of the El Salvadoran prison gang MS-13.",
    "link": "https://dailycaller.com/2025/04/15/trump-admin-official-tells-abc-news-anchor-to-focus-instead-on-victims-of-ms-13-and-tda/",
    "timestamp": "2025-04-16T03:01:37Z"
  },
  {
    "title": "‘Bitcoin Wants To Go Higher,’ Says Bitwise CIO—But There’s A Catch",
    "description": "In an investor note dated April 15, 2025, Matt Hougan, the Chief Investment Officer (CIO) of Bitwise, shared an examination of Bitcoin’s recent trading patterns that may surprise both critics and supporters. “Bitcoin is acting like an asset that wants to go h…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-wants-to-go-higher-bitwise-cio/",
    "timestamp": "2025-04-16T03:00:49Z"
  },
  {
    "title": "Hong Kong Post Suspends US Surface and Air Mail",
    "description": "The Hong Kong government announced that, as a result of President Donald Trump’s tariffs, the Hong Kong Post will suspend air and surface mail to the US. While this is a result of tariffs that will take effect on May 2, 2025, the first of these pauses will be…",
    "link": "https://www.siliconera.com/hong-kong-post-suspends-us-surface-and-air-mail/",
    "timestamp": "2025-04-16T03:00:00Z"
  },
  {
    "title": "HERE WE GO: NY AG Letitia James Reviewing Potential Insider Trading in Connection with Trump Tariff Pause",
    "description": "First Adam Schiff, now New York Attorney General Letitia James. Letitia James is looking into possible insider trading in connection with President Trump’s 90-day tariff pause. CNN reported: New York Attorney General Letitia James is looking into potential in…",
    "link": "https://freerepublic.com/focus/f-news/4311262/posts",
    "timestamp": "2025-04-16T02:59:19Z"
  },
  {
    "title": "AOC Has A Brutal Read Of Trump Using Just 1 Simple 'Matter Of Fact'",
    "description": "The congresswoman offered a blunt reflection on the president during a rally with Bernie Sanders in Bakersfield, California.",
    "link": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-trump-bakersfield-rally_n_67fef327e4b051f6e26e24ae",
    "timestamp": "2025-04-16T02:59:02Z"
  },
  {
    "title": "Trump's plan provides needed solution to combat campus antisemitism",
    "description": "The time for polite letters and listening circles is over. Action is needed. President Trump’s plan recognizes the urgency and responds with clarity.",
    "link": "https://www.jpost.com/opinion/article-850248",
    "timestamp": "2025-04-16T02:52:35Z"
  },
  {
    "title": "James Carville suggests Dems have ‘amicable split’ from progressives over ‘pronoun politics’",
    "description": "As progressives tend to be very vocal about LGBTQ issues, Carville proposed that there needs to be a \"schism\" within the Democratic Party.",
    "link": "https://nypost.com/2025/04/15/media/james-carville-suggests-split-with-the-left-over-pronoun-politics/",
    "timestamp": "2025-04-16T02:52:35Z"
  },
  {
    "title": "CNN Puts Adam Levine Back in Charge of DC Bureau as Phillip Rucker Promoted",
    "description": "The move largely reverses the revamp of political coverage CNN enacted less than a month ago\nThe post CNN Puts Adam Levine Back in Charge of DC Bureau as Phillip Rucker Promoted appeared first on TheWrap.",
    "link": "https://www.thewrap.com/cnn-adam-levine-back-in-charge-of-washington-bureau-philip-rucker-promoted/",
    "timestamp": "2025-04-16T02:51:43Z"
  },
  {
    "title": "Federal agency refers New York AG Letitia James to DOJ for prosecution for alleged mortgage fraud",
    "description": "Referral comes from U.S. Federal Housing Finance Agency, complete with supporting evidence. The federal government's main housing loan agency has referred New York Attorney General Letitia James, a longtime nemesis of President Donald Trump, to the U.S. Justi…",
    "link": "https://freerepublic.com/focus/f-news/4311261/posts",
    "timestamp": "2025-04-16T02:51:38Z"
  },
  {
    "title": "NY AG Letitia James finds herself accused of the very same real estate shenanigans she charged Trump with",
    "description": "New York state Attorney General Letitia James words of \"No matter how big, rich or powerful you think you are, no one is above the law,” have echoed throughout the media.",
    "link": "https://nypost.com/2025/04/15/opinion/ny-ag-letitia-james-finds-herself-accused-of-the-very-same-real-estate-shenanigans-she-charged-trump-with/",
    "timestamp": "2025-04-16T02:49:23Z"
  },
  {
    "title": "When will China start to devalue the yuan?",
    "description": "One way to think about China’s currency policy is its fiscal stance. Unless Beijing brings out the stimulus bazooka, devaluing the yuan might be the most expedient option.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/16/japan/devalue-the-yuan/",
    "timestamp": "2025-04-16T02:48:00Z"
  },
  {
    "title": "Japan's chief trade negotiator to visit Washington for tariff talks this week",
    "description": "Japan’s chief trade negotiator will visit the United States this week for talks aimed at convincing U.S. President Donald Trump to remove tariff measures against the East Asian country",
    "link": "https://abcnews.go.com/Business/wireStory/japans-chief-trade-negotiator-visit-washington-tariff-talks-120817334",
    "timestamp": "2025-04-16T02:46:28Z"
  },
  {
    "title": "China Q1 GDP beats forecasts at 5.4%, but US tariffs cloud outlook",
    "description": "While Beijing signals readiness for more stimulus, concerns over unemployment, deflation, and downgraded 2025 growth forecasts persist, casting uncertainty over the world’s second-largest economy.",
    "link": "https://www.thehindubusinessline.com/news/world/china-q1-gdp-beats-forecasts-at-54-but-us-tariffs-cloud-outlook/article69455202.ece",
    "timestamp": "2025-04-16T02:41:06Z"
  },
  {
    "title": "Shares fall in Asia as Nvidia curbs fan worries, gold hits record",
    "description": "Shares fell in Asia on Wednesday as AI darling Nvidia took a hit from U.S. curbs on chip sales to China, highlighting the damage to come in a tit-for-tat...",
    "link": "https://finance.yahoo.com/news/shares-fall-asia-nvidia-curbs-023849824.html",
    "timestamp": "2025-04-16T02:38:49Z"
  },
  {
    "title": "China’s economy beat forecasts in first quarter ahead of Trump’s ‘Liberation Day’",
    "description": "China on Wednesday said its economy grew a forecast-beating 5.4 percent in the first quarter as exporters rushed to get goods out of factory gates ahead of swingeing new US tariffs. Beijing and Washington are locked in a fast-moving, high-stakes game of brink…",
    "link": "https://www.digitaljournal.com/world/chinas-economy-beat-forecasts-in-first-quarter-ahead-of-trumps-liberation-day/article",
    "timestamp": "2025-04-16T02:37:32Z"
  },
  {
    "title": "China's Economy Beat Forecasts In First Quarter Ahead Of Trump's 'Liberation Day'",
    "description": "China on Wednesday said its economy grew a forecast-beating 5.4 percent in the first quarter as exporters rushed to get goods out of factory gates ahead of swingeing new US tariffs.",
    "link": "https://www.ibtimes.com/chinas-economy-beat-forecasts-first-quarter-ahead-trumps-liberation-day-3770231",
    "timestamp": "2025-04-16T02:36:20Z"
  },
  {
    "title": "3 Protesters Arrested At Marjorie Taylor Greene's Georgia Town Hall",
    "description": "U.S. Rep. Marjorie Taylor Greene has appeared at a town hall in suburban Atlanta to deliver full-throated support of President Donald Trump.",
    "link": "https://www.huffpost.com/entry/us-marjorie-taylor-greene-town-hall_n_67ff163ae4b0b0977ad57e5e",
    "timestamp": "2025-04-16T02:35:36Z"
  },
  {
    "title": "Jimmy Kimmel Blames Liberals' 'Completely Manufactured Outrage' for Getting Trump Elected",
    "description": "Left-wing, late night host Jimmy Kimmel is blaming the liberal cancel culture that squelched comedy for helping to get Donald Trump elected.\nThe post Jimmy Kimmel Blames Liberals’ ‘Completely Manufactured Outrage’ for Getting Trump Elected appeared first on B…",
    "link": "https://www.breitbart.com/entertainment/2025/04/15/jimmy-kimmel-blasts-liberal-cancel-culture-for-getting-trump-elected/",
    "timestamp": "2025-04-16T02:33:36Z"
  },
  {
    "title": "What happens if a president and the federal government fail to follow a judge's orders?",
    "description": "WASHINGTON — The Trump administration has been accused of ignoring or flat-out defying recent federal court orders, including a Supreme Court decision that it must “facilitate” the release of a Maryland man who was sent in error to a Salvadoran prison.",
    "link": "https://www.nbcnews.com/politics/politics-news/president-defies-judges-orders-contempt-rcna201455",
    "timestamp": "2025-04-16T02:33:17Z"
  },
  {
    "title": "Seth Rogen’s Onstage Roast of Trump Edited Out of Awards Show After Livestream: He ‘Single-Handedly Destroyed All of American Science’ - Varie",
    "description": "Seth Rogen’s Onstage Roast of Trump Edited Out of Awards Show After Livestream: He ‘Single-Handedly Destroyed All of American Science’Variety Seth Rogen’s Criticism of Silicon Valley’s Support for Trump Was Cut From the “Full” Stream of Breakthrough PrizeThe …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177032843",
    "timestamp": "2025-04-16T02:32:45Z"
  },
  {
    "title": "Trump orders critical minerals probe that may bring new tariffs",
    "description": "US President Donald Trump ordered a probe Tuesday that may result in tariffs on critical minerals, rare-earth metals and associated products such as smartphones, in an escalation of his dispute with global trade partners. Trump has upended markets in recent w…",
    "link": "https://www.digitaljournal.com/world/trump-orders-critical-minerals-probe-that-may-bring-new-tariffs/article",
    "timestamp": "2025-04-16T02:32:33Z"
  },
  {
    "title": "Trump ally Mel Gibson calls for ‘truth’ about 9/11",
    "description": "Mel Gibson has argued that many questions remain unanswered about the 9/11 attacks Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/615816-mel-gibson-911-truther/",
    "timestamp": "2025-04-16T02:30:24Z"
  },
  {
    "title": "Hong Kong's postal service says to stop shipping US-bound goods",
    "description": "HONG KONG: Hong Kong's postal service said on Wednesday (Apr 16) it will stop shipping goods bound for the United States in response to \"bullying\" tariff hikes by US Presiden",
    "link": "https://www.channelnewsasia.com/east-asia/hong-kong-postal-service-stop-shipping-us-bound-goods-turmp-tariffs-5068736",
    "timestamp": "2025-04-16T02:28:45Z"
  },
  {
    "title": "Trump picks a Hunter Biden whistleblower to temporarily lead the IRS",
    "description": "Gary Shapley, an IRS agent critical of the Hunter Biden tax investigation, has been appointed as acting commissioner. This decision follows concerns about political influence within the IRS, including alleged pressure to assist in immigration enforcement. Sha…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-picks-a-hunter-biden-whistleblower-to-temporarily-lead-the-irs/articleshow/120328021.cms",
    "timestamp": "2025-04-16T02:28:11Z"
  },
  {
    "title": "China’s economy grew by 5.4% in first quarter of 2025 | CNN Business",
    "description": "China has posted unexpectedly strong economic growth in the first three months of 2025, before the full force of US President Donald Trump’s tariffs took effect, and sent an upbeat message about how it plans to weather an ongoing trade war with Washington.",
    "link": "https://www.cnn.com/2025/04/15/business/china-economy-growth-q1-hnk-intl/index.html",
    "timestamp": "2025-04-16T02:25:54Z"
  },
  {
    "title": "Trump exempts nearly 70 coal plants from Biden-era rule on mercury and other toxic air pollution",
    "description": "The Trump administration has granted nearly 70 coal-fired power plants a two-year exemption from federal requirements to reduce emissions of toxic chemicals such as mercury, arsenic and benzene.",
    "link": "https://www.wsls.com/business/2025/04/15/trump-exempts-nearly-70-coal-plants-from-biden-era-rule-on-mercury-and-other-toxic-air-pollution/",
    "timestamp": "2025-04-16T02:25:48Z"
  },
  {
    "title": "Politics with Michelle Grattan: Warwick McKibbin on trying to model economic certainty in uncertain times",
    "description": "Joining us from Washington DC is Warwick McKibbin, an internationally renowned economic modeller from the ANU whose services are now in high demand.",
    "link": "https://theconversation.com/politics-with-michelle-grattan-warwick-mckibbin-on-trying-to-model-economic-certainty-in-uncertain-times-254591",
    "timestamp": "2025-04-16T02:21:16Z"
  },
  {
    "title": "Texas GOP could stall Trump’s bold AI vision with red tape as China races ahead: 'Investors are nervous'",
    "description": "President Trump’s AI infrastructure push may face major delays as Texas Republicans back a bill adding red tape and costs to key data center projects.",
    "link": "https://www.foxnews.com/politics/texas-gop-could-stall-trumps-bold-ai-vision-red-tape-china-races-ahead-investors-nervous",
    "timestamp": "2025-04-16T02:20:17Z"
  },
  {
    "title": "Trump launches critical minerals probe to weigh new tariffs",
    "description": "President Donald Trump launched a probe into the need for tariffs on critical minerals, the latest action in an expanding trade war that has targeted key sectors of the global economy.",
    "link": "https://www.digitimes.com/news/a20250416VL201/probe-donald-trump-security-investigation-war.html",
    "timestamp": "2025-04-16T02:19:22Z"
  },
  {
    "title": "Biden re-emerges to defend Social Security as Trump cuts agency staff",
    "description": "Democratic former President Joe Biden on Tuesday (Apr 15) made his first major speech since leaving the White House in January, defending the Social Security Administration as the Trump administration cuts agency staff and shutters some of its offices. Biden'…",
    "link": "https://www.channelnewsasia.com/world/biden-speech-trump-defend-social-security-doge-5068596",
    "timestamp": "2025-04-16T02:19:01Z"
  },
  {
    "title": "Biden slams Trump 'destruction' in first post-presidency speech",
    "description": "WASHINGTON: Joe Biden, in his first major speech since leaving the White House, railed on Tuesday (Apr 15) against his successor Donald Trump's frenetic government overhaul, claiming the \"hatchet\" effort put Americans' retirement benefits at risk. \"Fewer than…",
    "link": "https://www.channelnewsasia.com/world/biden-speech-trump-destruction-defend-social-security-doge-musk-5068596",
    "timestamp": "2025-04-16T02:19:00Z"
  },
  {
    "title": "Biden attacks Trump on Social Security in rare public speech",
    "description": "The former Democratic president attacked Trump's policies regarding Social Security in his first public address since leaving office. His speech has divided his fellow Democrats.",
    "link": "https://www.dw.com/en/biden-attacks-trump-on-social-security-in-rare-public-speech/a-72256934",
    "timestamp": "2025-04-16T02:19:00Z"
  },
  {
    "title": "Witkoff clarifies previous declaration, demands total nuclear shutdown in Iran",
    "description": "Trump’s special envoy Steve Witkoff insists Iran must fully dismantle its nuclear program, contradicting earlier remarks indicating the US would allow low-level enrichment.",
    "link": "https://www.israelnationalnews.com/news/406894",
    "timestamp": "2025-04-16T02:17:46Z"
  },
  {
    "title": "There’s only one way US-Iran talks should end: Halt Tehran’s nuclear terror for good",
    "description": "Iran’s enrichment facilities must be verifiably dismantled, its role as the world’s state sponsor of terrorism must end — and a credible military option must remain on the table.",
    "link": "https://nypost.com/2025/04/15/opinion/theres-only-one-way-us-iran-talks-should-end-halt-tehrans-nuclear-terror-for-good/",
    "timestamp": "2025-04-16T02:16:05Z"
  },
  {
    "title": "Chinese exporters on social media platform Rednote ask local consumers to buy goods meant for US",
    "description": "Chinese sellers are using social media platform Rednote to sell goods originally intended for the U.S. market at discounted prices, citing tariffs imposed by the Trump administration. Livestreams showcase products like appliances, with sellers claiming U.S. c…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chinese-exporters-on-social-media-platform-rednote-ask-local-consumers-to-buy-goods-meant-for-us/articleshow/120327672.cms",
    "timestamp": "2025-04-16T02:15:32Z"
  },
  {
    "title": "The United States of Tyranny: America Is Becoming a Constitution-Free Zone",
    "description": "It’s no joke: America is becoming a Constitution-free zone. Little by little, our rights are being whittled down in the name of national security. Where do you draw the line? How much tyranny will Americans tolerate in the name of national security? At what p…",
    "link": "https://www.activistpost.com/the-united-states-of-tyranny-america-is-becoming-a-constitution-free-zone/",
    "timestamp": "2025-04-16T02:14:45Z"
  },
  {
    "title": "Shark Tank's Kevin O'Leary has blunt message on China, tariffs",
    "description": "On April 9, President Donald Trump announced a 90-day pause on tariffs for most countries. The exception was China, whose tariffs imposed by the U.S. surged to 145% as a trade battle escalated. China retaliated by increasing its tariffs on U.S. goods to 125%.…",
    "link": "https://biztoc.com/x/853b9212f209bb79",
    "timestamp": "2025-04-16T02:10:28Z"
  },
  {
    "title": "US Launches Tariff Probe on Rare Earth Metals Imports",
    "description": "Donald Trump signed an executive order to initiate a Section 232 investigation to assess the national security risks posed by the United States' dependence on foreign rare earth metals.",
    "link": "https://sputnikglobe.com/20250416/us-launches-tariff-probe-on-rare-earth-metals-imports-1121877194.html",
    "timestamp": "2025-04-16T02:10:00Z"
  },
  {
    "title": "Xi arrives in Malaysia with a message: China’s a better partner than Trump",
    "description": "Chinese President Xi Jinping's visit to Malaysia is second stop in Southeast Asia amid Trump tariffs and US trade war.",
    "link": "https://www.aljazeera.com/news/2025/4/16/xi-arrives-in-malaysia-with-a-message-chinas-a-better-partner-than-trump",
    "timestamp": "2025-04-16T02:06:29Z"
  },
  {
    "title": "MA Gov. Healey: Trump Bullying Harvard 'Smacks of the Authoritarian Regimes of Past'",
    "description": "Governor Maura Healey (D-MA) said Tuesday on MSNBC's \"The Beat\" that the Trump administration's $2.2 billion freeze in grants to Harvard University \"smacks of the authoritarian regimes of the past.\"\nThe post MA Gov. Healey: Trump Bullying Harvard ‘Smacks of t…",
    "link": "https://www.breitbart.com/clips/2025/04/15/ma-gov-healey-trump-bullying-harvard-smacks-of-the-authoritarian-regimes-of-past/",
    "timestamp": "2025-04-16T02:06:27Z"
  },
  {
    "title": "Turkey holds talks with Israel on easing Syria tensions",
    "description": "Istanbul (AFP) April 10, 2025 -\n\n Turkey and Israel have started talks aimed at easing tensions over Syria, officials from both sides said Thursday.\n\nIsrael has launched air strikes and ground incursions to keep Syrian forces away from its border. Turkey is a…",
    "link": "https://www.spacewar.com/reports/Turkey_holds_talks_with_Israel_on_easing_Syria_tensions_999.html",
    "timestamp": "2025-04-16T02:04:30Z"
  },
  {
    "title": "US to deploy large surveillance drones to Japan's Okinawa",
    "description": "Tokyo (AFP) April 8, 2025 -\n\n The US military will deploy long-range surveillance drones in the Japanese region of Okinawa near Taiwan, Tokyo's defence minister said Tuesday.\n\nThe MQ-4C Triton drones will boost the intelligence gathering capabilities of the U…",
    "link": "https://www.spacewar.com/reports/US_to_deploy_large_surveillance_drones_to_Japans_Okinawa_999.html",
    "timestamp": "2025-04-16T02:04:28Z"
  },
  {
    "title": "China's first-quarter GDP tops estimates at 5.4% as growth momentum continues amid tariff worries",
    "description": "Several investment banks have moved to slash China's growth forecasts this year, with most doubting Beijing can achieve the official target of \"around 5%\" this year.",
    "link": "https://www.cnbc.com/2025/04/16/chinas-first-quarter-gdp-growth-at-as-trade-war-heats-up.html",
    "timestamp": "2025-04-16T02:03:48Z"
  },
  {
    "title": "Silicon Valley crosswalks hacked to mock Musk, Zuckerberg",
    "description": "San Francisco (AFP) April 16, 2025 -\n\n Pedestrian crosswalks in California's Silicon Valley were emitting recordings over the weekend that mocked US President Donald Trump and tech billionaires Mark Zuckerberg and Elon Musk, according to widely shared videos.…",
    "link": "https://www.spacewar.com/reports/Silicon_Valley_crosswalks_hacked_to_mock_Musk_Zuckerberg_999.html",
    "timestamp": "2025-04-16T02:03:30Z"
  },
  {
    "title": "Trump gives TikTok extra 75 days to find buyer",
    "description": "Washington (AFP) April 4, 2025 -\n\n US President Donald Trump on Friday extended the deadline for TikTok to find a non-Chinese buyer or face a ban in the United States, allowing 75 more days to find a solution.\n\n\"My Administration has been working very hard on…",
    "link": "https://www.spacewar.com/reports/Trump_gives_TikTok_extra_75_days_to_find_buyer_999.html",
    "timestamp": "2025-04-16T02:03:30Z"
  },
  {
    "title": "Hong Kong suspends postal service to the US after Trump’s tariff hikes | CNN Business",
    "description": "Hongkong Post, the postal service in the semi-autonomous Chinese city, will stop handling packages coming from or going to the US amid an escalating trade war.",
    "link": "https://www.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
    "timestamp": "2025-04-16T02:03:13Z"
  },
  {
    "title": "Walz: Trump Thinks Nuclear War Is Winnable — I'm Terrified He Will Act on That",
    "description": "Governor Tim Walz (D-MN) claimed Tuesday on MSNBC's \"All In\" that he was terrified because he believed President Donald Trump thinks nuclear war is winnable.\nThe post Walz: Trump Thinks Nuclear War Is Winnable — I’m Terrified He Will Act on That appeared firs…",
    "link": "https://www.breitbart.com/clips/2025/04/15/walz-trump-thinks-nuclear-war-is-winnable-im-terrified-he-will-act-on-that/",
    "timestamp": "2025-04-16T02:03:09Z"
  },
  {
    "title": "Trump ramps up conflict against defiant Harvard",
    "description": "<p>CAMBRIDGE (UNITED STATES) - President Donald Trump escalated his war against elite US universities Tuesday with a threat to strip Harvard's tax-exempt status if the country's most famous educational establishment refuses to submit to wide-ranging governmen…",
    "link": "https://www.bangkokpost.com/world/3004116/trump-ramps-up-conflict-against-defiant-harvard",
    "timestamp": "2025-04-16T02:03:00Z"
  },
  {
    "title": "Everything Trump is doing makes perfect sense if you understand one simple fact",
    "description": "Everything Donald Trump is doing and will do makes perfect and sudden sense if you understand one simple fact: For him, it’s all a show.He views the White House as a sound stage, like the set made to look like a boardroom where he performed for NBC on The App…",
    "link": "https://www.rawstory.com/raw-investigates/trump-motivation/",
    "timestamp": "2025-04-16T02:01:40Z"
  },
  {
    "title": "Intel, TSMC reach preliminary chipmaking deal: report",
    "description": "Washington (AFP) April 3, 2025 -\n\n Intel and Taiwan Semiconductor Manufacturing Co (TSMC) have reached a preliminary agreement to form a joint venture to operate Intel's chipmaking facilities, tech news outlet The Information reported on Thursday.\n\nThe Trump …",
    "link": "https://www.spacedaily.com/reports/Intel_TSMC_reach_preliminary_chipmaking_deal_report_999.html",
    "timestamp": "2025-04-16T02:00:56Z"
  },
  {
    "title": "Nvidia expects $5.5 bn hit as US targets chips sent to China",
    "description": "San Francisco (AFP) April 15, 2025 -\n\n Nvidia on Tuesday notified regulators that it expects a $5.5 billion hit this quarter due to a new US licensing requirement on the primary chip it can legally sell in China.\n\nUS officials last week told Nvidia it must ob…",
    "link": "https://www.spacedaily.com/reports/Nvidia_expects_55_bn_hit_as_US_targets_chips_sent_to_China_999.html",
    "timestamp": "2025-04-16T02:00:56Z"
  },
  {
    "title": "CORRECTED: Europe seeks to break its US tech addiction",
    "description": "Brussels, Belgium (AFP) April 16, 2025 -\n With President Donald Trump more unpredictable than ever and transatlantic ties reaching new lows, calls are growing louder for Europe to declare independence from US tech.\n\nFrom Microsoft to Meta, Apple to Uber, clou…",
    "link": "https://www.spacedaily.com/reports/Europe_seeks_to_break_its_US_tech_addiction_999.html",
    "timestamp": "2025-04-16T02:00:56Z"
  },
  {
    "title": "Take my freedom fries, please",
    "description": "JD Vance “won” the vice presidential debate, and in so doing showed why it’s en essentially useless format in terms of uncovering truth or providing reliable information for the audience. Debates above all reward bullshit artists who can sound very self-assur…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/take-my-freedom-fries-please",
    "timestamp": "2025-04-16T02:00:17Z"
  },
  {
    "title": "Xi Jinping makes a case for free trade, presenting China as a source of 'stability and certainty'",
    "description": "Chinese President Xi Jinping is touring Southeast Asia this week, promoting free trade and presenting China as a source of “stability and certainty” amid global tensions. His trip includes stops in Vietnam, Malaysia, and Cambodia, all key partners affected by…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/xi-jinping-makes-a-case-for-free-trade-presenting-china-as-a-source-of-stability-and-certainty/articleshow/120327229.cms",
    "timestamp": "2025-04-16T01:59:03Z"
  },
  {
    "title": "Gold hits record high on economic growth concerns",
    "description": "Gold prices hit a record high on Wednesday. This surge happened because of a weaker dollar and trade war worries. Concerns about global economic growth also played a role. Investors are now waiting for U.S. retail sales data. This data will provide insights i…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-hits-record-high-on-economic-growth-concerns/articleshow/120327213.cms",
    "timestamp": "2025-04-16T01:58:24Z"
  },
  {
    "title": "Seth Rogen’s Joke About Donald Trump At Breakthrough Prize Cut Out Of Awards Show Following Livestream",
    "description": "Seth Rogen presented at the 2025 Breakthrough Prize ceremony and joked about Donald Trump, but the remark was edited out following the live stream. The star of Apple TV+’s The Studio presented the Special Breakthrough Prize in Physics alongside Edward Norton …",
    "link": "http://deadline.com/2025/04/seth-rogen-joke-donald-trump-breakthrough-prize-cut-out-awards-show-livestream-1236369569/",
    "timestamp": "2025-04-16T01:57:09Z"
  },
  {
    "title": "Mark Zuckerberg tried to negotiate settlement with FTC in landmark antitrust trial but failed",
    "description": "Meta Platforms Inc. Chief Executive Mark Zuckerberg put $450 million on the table late in March, hoping it would be enough to settle its antitrust case with the Federal Trade Commission, according to The Wall Street Journal. According to people familiar with …",
    "link": "https://siliconangle.com/2025/04/15/mark-zuckerberg-tried-negotiate-settlement-ftc-landmark-antitrust-trial-but-failed/",
    "timestamp": "2025-04-16T01:55:45Z"
  },
  {
    "title": "Wall Street ends down slightly; tariff uncertainty keeps investors on edge",
    "description": "U.S. stocks edged lower on Tuesday amid persistent tariff uncertainties and declines in consumer and healthcare sectors, offsetting support from positive bank earnings. Trade policy concerns, particularly regarding U.S.-China relations, weighed heavily on mar…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-down-slightly-tariff-uncertainty-keeps-investors-on-edge/articleshow/120327071.cms",
    "timestamp": "2025-04-16T01:52:54Z"
  },
  {
    "title": "Trump envoy urges Iraq to free hostage Elizabeth Tsurkov: Bring her home now!",
    "description": "Trump’s Special Envoy Adam Boehler calls on Iraqi PM Sudani to act swiftly in freeing Elizabeth Tsurkov, a Princeton student held by Kata’ib Hezbollah since 2023.",
    "link": "https://www.israelnationalnews.com/news/406893",
    "timestamp": "2025-04-16T01:50:04Z"
  },
  {
    "title": "Trump believes it’s up to China to open talks on trade, White House says",
    "description": "Hong Kong's postal service says it will no longer accept US-bound goods in response to US 'bullying'.",
    "link": "https://www.aljazeera.com/economy/2025/4/16/trump-believes-its-up-to-china-to-open-talks-on-trade-white-house-says",
    "timestamp": "2025-04-16T01:49:51Z"
  },
  {
    "title": "The RBA board hangs a lampshade: Please pretend there’s a chance we won’t cut rates in May",
    "description": "The RBA board wanted everyone to think it might not cut rates in May. Which kinda worked, until it told everyone to say it might not cut rates in May.\nThe post The RBA board hangs a lampshade: Please pretend there’s a chance we won’t cut rates in May appeared…",
    "link": "http://www.crikey.com.au/2025/04/16/reserve-bank-australia-rba-interest-rate-cut-may/",
    "timestamp": "2025-04-16T01:49:31Z"
  },
  {
    "title": "Nvidia expects $5.5 bn hit as US targets chips sent to China",
    "description": "<p>SAN FRANCISCO - Nvidia on Tuesday notified regulators that it expects a $5.5 billion hit this quarter due to a new US licensing requirement on the primary chip it can legally sell in China.</p>",
    "link": "https://www.bangkokpost.com/business/general/3004126/nvidia-expects-5-5-bn-hit-as-us-targets-chips-sent-to-china",
    "timestamp": "2025-04-16T01:49:00Z"
  },
  {
    "title": "Nvidia AI Chip Production Lands in the US to Avoid Trump's Tariffs",
    "description": "Nvidia announced this week it had begun producing chips at factories in Arizona and would build supercomputers in Texas, bringing the manufacturing of the key processing hardware behind generative AI to the US.\nThe news comes as tariffs announced by President…",
    "link": "https://biztoc.com/x/952bbb25828339fd",
    "timestamp": "2025-04-16T01:48:47Z"
  },
  {
    "title": "AOC hauls in behemoth $9.6M cash during first-quarter fundraising",
    "description": "Typically, the Bronx and Queens rep tends to notch a rough average between $1-2 million on the fundraising circuit each quarter, her filings show.",
    "link": "https://nypost.com/2025/04/15/us-news/aoc-hauls-in-behemoth-9-6m-cash-during-first-quarter-fundraising/",
    "timestamp": "2025-04-16T01:47:40Z"
  },
  {
    "title": "Trump tariffs: China warns of trade war impact even as economy grows faster than expected",
    "description": "Beijing is bracing for the full impact on its economy of Donald Trump's tariffs that are now at 145%.",
    "link": "https://www.bbc.com/news/live/ckgej04jpgyt",
    "timestamp": "2025-04-16T01:45:12Z"
  },
  {
    "title": "Biden recalls seeing 'colored kids' on segregated bus during his youth in post-presidency speech",
    "description": "Former President Joe Biden referred to Black students as \"colored kids\" while discussing how schools were segregated in Delaware while he was growing up.",
    "link": "https://www.foxnews.com/politics/biden-recalls-seeing-colored-kids-segregated-bus-during-his-youth-post-presidency-speech",
    "timestamp": "2025-04-16T01:42:50Z"
  },
  {
    "title": "6 times the Trump administration has clashed with opponents over court orders",
    "description": "The clashes range from unilaterally freezing federal funding to the use of the Alien Enemies Act to deport noncitizens.",
    "link": "https://abcnews.go.com/Politics/6-times-trump-administration-clashed-opponents-court-orders/story?id=120846599",
    "timestamp": "2025-04-16T01:40:15Z"
  },
  {
    "title": "Landmark agreement reached at WHO over tackling future pandemics",
    "description": "After years of negotiation, countries reached a landmark accord at the WHO headquarters in Geneva to prevent future pandemic crises. The agreement aims to correct mistakes made during COVID-19, addressing issues like technology transfer for health products. D…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/landmark-agreement-reached-at-who-over-tackling-future-pandemics/articleshow/120326732.cms",
    "timestamp": "2025-04-16T01:39:22Z"
  },
  {
    "title": "Trump's tariffs on Chinese parts for Cybercab, Semi disrupt Tesla's US production plans, source says",
    "description": "Tesla's plans to import Chinese components for its Cybercab and Semi trucks in the U.S. faced disruption due to escalating tariffs imposed by President Trump during a trade war. This suspension jeopardizes Tesla's mass production timeline for these models, sl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariffs-on-chinese-parts-for-cybercab-semi-disrupt-teslas-us-production-plans-source-says/articleshow/120326706.cms",
    "timestamp": "2025-04-16T01:38:06Z"
  },
  {
    "title": "Donald Trump threatens to hit critical minerals with tariffs",
    "description": "",
    "link": "https://biztoc.com/x/9a18b6048afd8f4e",
    "timestamp": "2025-04-16T01:37:34Z"
  },
  {
    "title": "Jimmy Kimmel: Attacking Comedy, Comedians Helped Re-Elect Trump",
    "description": "During POtuS Donald Trump's entire first term and pretty much every day of his second term, late-night host Jimmy Kimmel hasn't let up on Trump and the damage that his policies are doing within the U.S. and our standing with the rest of the world. And if you'…",
    "link": "https://bleedingcool.com/tv/jimmy-kimmel-attacking-comedy-comedians-helped-re-elect-trump/",
    "timestamp": "2025-04-16T01:37:07Z"
  },
  {
    "title": "Biden alleges Trump has 'taken a hatchet' to Social Security in his first post-presidency speech",
    "description": "Former President Joe Biden criticized President Donald Trump's handling of Social Security, accusing him of undermining the program. Biden's remarks came during a speech at a conference in Chicago, marking his first major public appearance since leaving offic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/biden-alleges-trump-has-taken-a-hatchet-to-social-security-in-his-first-post-presidency-speech/articleshow/120326650.cms",
    "timestamp": "2025-04-16T01:35:25Z"
  },
  {
    "title": "DOGE trumpets unemployment fraud that the government already found years ago",
    "description": "Elon Musk's Department of Government Efficiency (DOGE) claimed to uncover significant unemployment fraud, but federal investigators had already identified similar issues on a larger scale. DOGE's findings, highlighting claims by the deceased and unborn, were …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/doge-trumpets-unemployment-fraud-that-the-government-already-found-years-ago/articleshow/120326544.cms",
    "timestamp": "2025-04-16T01:31:28Z"
  },
  {
    "title": "Letters: Shane Lowry, not Michael D Higgins, should have led tributes to Masters champ Rory McIlroy",
    "description": "The scrupulously egalitarian Vincent Browne first drew my attention to the curious media cliche of reporting that a notable figure, most commonly the President, had “led the tributes” to a given individual.",
    "link": "https://www.independent.ie/opinion/letters/letters-shane-lowry-not-michael-d-higgins-should-have-led-tributes-to-masters-champ-rory-mcilroy/a1466386461.html",
    "timestamp": "2025-04-16T01:30:00Z"
  },
  {
    "title": "Don't believe fake Trump post saying 'most ladies' don't want to vote",
    "description": "A screenshot authentically shows that U.S. President Donald Trump wrote a post on Truth Social about \"most ladies\" not wanting to vote.",
    "link": "https://www.snopes.com//fact-check/trump-vote-most-ladies/",
    "timestamp": "2025-04-16T01:30:00Z"
  },
  {
    "title": "Columbia University ‘in talks’ with Trump administration after Harvard rejects demands in funding row",
    "description": "Columbia University says it’s holding “good faith” negotiations with US president Donald Trump’s administration to regain federal funding.",
    "link": "https://www.independent.ie/world-news/north-america/columbia-university-in-talks-with-trump-administration-after-harvard-rejects-demands-in-funding-row/a2094585828.html",
    "timestamp": "2025-04-16T01:30:00Z"
  }
]