[
  {
    "title": "Portland Protesters Rally for “Tesla Takedown”",
    "description": "As Tesla stocks tumble, hundreds of people are holding regular protests outside the Portland dealership to protest Elon Musk’s government takeover.\n \n by Taylor Griggs\n \n \n \n Hundreds of people gathered outside Portland’s Tesla dealership during the afternoon…",
    "link": "https://www.portlandmercury.com/news/2025/03/04/47672077/portland-protesters-rally-for-tesla-takedown",
    "timestamp": "2025-03-04T23:20:00Z"
  },
  {
    "title": "These stock market sectors are getting hit hardest by the trade war",
    "description": "Technology, financial and energy companies took the biggest hits on Canada’s main stock index after tariffs went into effect. Find out more.",
    "link": "https://financialpost.com/investing/stock-market-sectors-hit-hardest-trade-war",
    "timestamp": "2025-03-04T23:18:49Z"
  },
  {
    "title": "FBI and DOJ headquarters are among more than 440 federal buildings listed for potential sale",
    "description": "The General Services Administration's list includes some of the country’s most recognizable buildings.",
    "link": "https://www.denverpost.com/2025/03/04/federal-buildings-potential-sale/",
    "timestamp": "2025-03-04T23:18:42Z"
  },
  {
    "title": "FBI and DOJ headquarters are among more than 440 federal buildings listed for potential sale",
    "description": "The General Services Administration's list includes some of the country’s most recognizable buildings.",
    "link": "https://www.bostonherald.com/2025/03/04/federal-buildings-potential-sale/",
    "timestamp": "2025-03-04T23:18:42Z"
  },
  {
    "title": "Americans are racing to prep for tariffs, but many aren’t ready — especially this group",
    "description": "Americans are racing to prep for tariffs, but many aren’t ready — especially this group\nThe annual price tag on more tariffs could be over $1,200, by one estimate\nThe sweeping tariffs that President Donald Trump has been talking about since he was on the camp…",
    "link": "https://biztoc.com/x/33dd8707584e7fab",
    "timestamp": "2025-03-04T23:18:18Z"
  },
  {
    "title": "Live: Ukraine fall-out, trade wars set scene for Trump's speech to Congress",
    "description": "As the US president promises to \"tell it like it is\" in his first speech to the new Congress, schisms with America's allies are growing wider.",
    "link": "https://www.abc.net.au/news/2025-03-05/live-blog-donald-trump-joint-session-congress-speech/105006512",
    "timestamp": "2025-03-04T23:16:45Z"
  },
  {
    "title": "Who is Edan Alexander, the American-Israeli hostage whose parents will be at Trump’s address",
    "description": "President Trump will spotlight Israeli hostages in his speech, with Edan Alexander’s parents attending to keep attention on their son's captivity in Gaza.",
    "link": "https://www.jpost.com/israel-news/article-844734",
    "timestamp": "2025-03-04T23:16:19Z"
  },
  {
    "title": "Trump Official Hints Canada, Mexico Could See Relief From US Tariffs",
    "description": "The US commerce secretary on Tuesday said President Donald Trump could dial down huge tariffs on Canada and Mexico this week while maintaining pressure on China, hours after Canada&#039;s premier attacked the United States&#039; &quot;dumb&quot; trade war.",
    "link": "https://www.ndtv.com/world-news/trump-official-hints-canada-mexico-could-see-relief-from-us-tariffs-7849982",
    "timestamp": "2025-03-04T23:16:13Z"
  },
  {
    "title": "American interests regain control of key parts of Panama Canal",
    "description": "President Trump had threatened to take it 'back' from Chinese influence",
    "link": "https://www.wnd.com/2025/03/american-interests-regain-control-of-key-parts-of-panama-canal/",
    "timestamp": "2025-03-04T23:15:58Z"
  },
  {
    "title": "How Trump Is Killing the U.S. Defense Industry",
    "description": "It turns out that abandoning allies and tossing out security guarantees is bad for business.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-zelensky-vance-ukraine-defense-arms/",
    "timestamp": "2025-03-04T23:15:18Z"
  },
  {
    "title": "Trump doesn't seem to know why he launched a giant trade war (Eric Levitz/Vox)",
    "description": "Eric Levitz / Vox:\nTrump doesn't seem to know why he launched a giant trade war  —  Donald Trump just imposed a 25 percent tariff on virtually all goods produced by America's two largest trading partners — Canada and Mexico.  He simultaneously established a 2…",
    "link": "https://www.memeorandum.com/250304/p149",
    "timestamp": "2025-03-04T23:15:01Z"
  },
  {
    "title": "Two hugely important questions about Trump's trade war (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nTwo hugely important questions about Trump's trade war  —  Donald Trump's long-threatened trade war has finally begun.  —  The Trump administration slapped big new tariffs on Canada, Mexico, and China on Tuesday, spurring retaliation from…",
    "link": "https://www.memeorandum.com/250304/p150",
    "timestamp": "2025-03-04T23:15:01Z"
  },
  {
    "title": "Europe proposes new $150B defense fund to beef up languid armies: ‘Era of rearmament’",
    "description": "But the new spending, over five years, still pales in comparison to the US, which has earmarked $883 billion for defense this year alone.",
    "link": "https://nypost.com/2025/03/04/world-news/europe-proposes-new-150-billion-defense-fund-to-beef-up-militaries/",
    "timestamp": "2025-03-04T23:14:42Z"
  },
  {
    "title": "CNN Pundit Slams Zelenskyy For Not Wearing A Tie — But An Expert Makes This Damning Point",
    "description": "Scott Jennings was blasted on social media after he griped about the Ukrainian president's attire during his disastrous meeting with President Trump at the Oval Office.",
    "link": "https://www.huffpost.com/entry/scott-jennings-cnn-volodymyr-zelenskyy-donald-trump-oval-office-suit_n_67c718d3e4b02e07ca7030f8",
    "timestamp": "2025-03-04T23:12:59Z"
  },
  {
    "title": "'Fly my pretties': Senator warns of 'dark threats' from Musk's army of 'flying monkeys'",
    "description": "Sen. Sheldon Whitehouse (D-RI) attacked President Donald Trump and tech billionaire Elon Musk and his internet crew of \"flying monkeys\" willing to lash out at any perceived foes. MSNBC host Nicolle Wallace began the discussion Tuesday afternoon by asking abou…",
    "link": "https://www.rawstory.com/elon-musk-x-2671266199/",
    "timestamp": "2025-03-04T23:12:11Z"
  },
  {
    "title": "Watch Live: Trump’s Speech to Joint Session of Congress",
    "description": "President Donald Trump delivers the first joint congressional address of his second presidency.",
    "link": "https://time.com/7262845/watch-trump-joint-speech-congress/",
    "timestamp": "2025-03-04T23:11:55Z"
  },
  {
    "title": "The Inter-American Foundation, an agency whose primary action was to issue foreign grants ($60M budget), has been reduced to its statutory minimum (1 active employee).",
    "description": "Examples of grants that were cancelled in the process: - $903,811 for alpaca farming in Peru - $364,500 to reduce social discrimination of recyclers in Bolivia - $813,210 for vegetable gardens in El Salvador - $323,633 to promote cultural understanding of Ven…",
    "link": "https://freerepublic.com/focus/f-news/4302111/posts",
    "timestamp": "2025-03-04T23:11:42Z"
  },
  {
    "title": "How Trump's Tariffs Will Disrupt Key Industries in Mexico",
    "description": "The imposition of the tariffs on Mexico and Canada represent a violation of the USMCA and could trigger a tariff war, experts say.",
    "link": "https://www.wired.com/story/how-trumps-tariffs-will-disrupt-key-industries-in-mexico/",
    "timestamp": "2025-03-04T23:11:12Z"
  },
  {
    "title": "Exclusive – Rep. Brandon Gill: Democrats Are 'The Party of Perverts'",
    "description": "Democrats are exposing their true colors by worshiping at the alter of radical transgenderism at the expense of the safety of women and girls, Rep. Brandon Gill (R-TX) told Breitbart News Tuesday in an exclusive interview.\nThe post Exclusive – Rep. Brandon Gi…",
    "link": "https://www.breitbart.com/politics/2025/03/04/exclusive-rep-brandon-gill-democrats-are-the-party-of-perverts/",
    "timestamp": "2025-03-04T23:11:05Z"
  },
  {
    "title": "Trump slaps Canadian energy exports with 10% tariffs, leaving oilpatch 'deeply disappointed'",
    "description": "U.S. President Donald Trump finally followed through with his tariff threat against Canada on Tuesday, and it's an action that's already sent a shock through the energy sector, the country's most powerful economic force.",
    "link": "https://www.cbc.ca/news/canada/calgary/canada-us-trade-tariffs-trump-alberta-oil-energy-sector-1.7474193",
    "timestamp": "2025-03-04T23:09:55Z"
  },
  {
    "title": "A Georgia Woman Eloquently Called Out Trump, And TikTok Users Can’t Get Enough",
    "description": "Ginny Lim told HuffPost she hopes she motivates others to call their representatives and demand they take action.",
    "link": "https://www.huffpost.com/entry/a-georgia-woman-eloquently-called-out-trump-and-tiktok-users-cant-get-enough_n_67c7221be4b02e07ca703585",
    "timestamp": "2025-03-04T23:09:20Z"
  },
  {
    "title": "'A Really Bad Idea': ICC Director Describes How Trump's Tariffs On Mexico And Canada Will Impact You",
    "description": "Andrew Wilson, Deputy Secretary-General and Global Policy Director at the ICC, outlines howTrump's tariffs could impact the everyday consumer and global economy.",
    "link": "https://www.forbes.com/sites/forbestv/2025/03/04/a-really-bad-idea-icc-director-describes-how-trumps-tariffs-on-mexico-and-canada-will-impact-you/",
    "timestamp": "2025-03-04T23:08:54Z"
  },
  {
    "title": "Fox News' Zelenskyy interview watched by 6.4 million viewers, surpassing NBC, CBS evening newscasts",
    "description": "\"Special Report with Bret Baier\" netted a whopping 6.4 million viewers who tuned in to Friday's highly-anticipated interview with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.foxnews.com/media/fox-news-zelenskyy-interview-watched-6-4-million-viewers-surpassing-nbc-cbs-evening-newscasts",
    "timestamp": "2025-03-04T23:08:28Z"
  },
  {
    "title": "Trump Unveils $100 Billion TSMC Investment",
    "description": "Taiwan Semiconductor Manufacturing Co., the world’s top producer of AI chips, plans to invest an additional $100 billion in US plants that will boost its chip output on American soil and support President Donald Trump’s goal of increasing domestic manufacturi…",
    "link": "https://biztoc.com/x/e897732fcd05d440",
    "timestamp": "2025-03-04T23:07:07Z"
  },
  {
    "title": "Trump’s new tariffs could especially sting the Texas economy",
    "description": "The Donald Trump administration’s 25% tariffs on Canada and Mexico started Tuesday, and their effects will ripple across the U.S. economy and abroad. But one state is particularly exposed: Texas. It has what amounts to roughly a $300 billion trade relationshi…",
    "link": "https://biztoc.com/x/830b313741589eb7",
    "timestamp": "2025-03-04T23:07:06Z"
  },
  {
    "title": "How Day 1 of Trump’s new tariffs feels for businesses caught in the middle",
    "description": "By now, you’ve heard about the Donald Trump administration’s tariffs that went into effect Tuesday morning. To recap the details, there’s a 25% duty on goods from Mexico and Canada, plus an additional 10% tariff on Chinese imports. That’s on top of the tariff…",
    "link": "https://biztoc.com/x/0b1d51bfb9720c73",
    "timestamp": "2025-03-04T23:07:01Z"
  },
  {
    "title": "Trump could scale back Canada, Mexico tariffs Wednesday, Lutnick says",
    "description": "President Donald Trump will “probably” announce tariff compromise deals with Canada and Mexico soon, Commerce Secretary Howard Lutnick said Tuesday.",
    "link": "https://biztoc.com/x/a8b0130369b72e9c",
    "timestamp": "2025-03-04T23:06:42Z"
  },
  {
    "title": "LGBTQ+ Democrats will take a stand during Trump’s joint address  — including skipping it entirely",
    "description": "As President Donald Trump\r\n prepares to deliver his first joint address to Congress since returning to office, LGBTQ\r\n+ members of Congress are making it clear that they will not let his administration’s policies go unchallenged. It will be the first time tha…",
    "link": "https://www.advocate.com/politics/lgbtq-democrats-trump-joint-session",
    "timestamp": "2025-03-04T23:05:50Z"
  },
  {
    "title": "FBI And DOJ Headquarters Among More Than 440 Federal Buildings Listed For Potential Sale",
    "description": "The Trump administration has placed some of the country’s most iconic and well-known federal buildings on the potential chopping block.",
    "link": "https://www.huffpost.com/entry/ap-us-doge-federal-buildings_n_67c78654e4b0afa088b6d05d",
    "timestamp": "2025-03-04T23:05:11Z"
  },
  {
    "title": "Trump Plunges U.S. Into Trade War With Canada, Mexico, China",
    "description": "All three countries have vowed retaliatory measures against Washington.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-tariffs-canada-mexico-china-trade-war-trudeau-sheinbaum/",
    "timestamp": "2025-03-04T23:05:09Z"
  },
  {
    "title": "US President Donald Trump temporarily suspends all military aid to Ukraine",
    "description": "NEW YORK/WASHINGTON, March 4: US President Donald Trump has temporarily suspended, with immediate effect, the delivery of all American military aid to Ukraine, just days after an unprecedented showdown with Ukrainian President Volodymyr Zelensky in the Oval O…",
    "link": "https://thehillstimes.in/international/us-president-donald-trump-temporarily-suspends-all-military-aid-to-ukraine",
    "timestamp": "2025-03-04T23:05:00Z"
  },
  {
    "title": "The Trade War Is Here",
    "description": "Canada, Mexico, and China vow retaliatory measures against U.S. tariffs.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-trade-war-tariffs-canada-mexico-china-trudeau-sheinbaum/",
    "timestamp": "2025-03-04T23:04:58Z"
  },
  {
    "title": "Some Democrats to skip Trump's joint address to Congress",
    "description": "Several Democrats have said they do not plan to attend President Donald Trump's joint address to Congress on Tuesday.",
    "link": "https://abcnews.go.com/Politics/democrats-skip-trumps-joint-address-congress/story?id=119441526",
    "timestamp": "2025-03-04T23:04:08Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Late Tuesday, Commerce Secretary Howard Lutnick hinted that the U.S. might meet Canada and Mexico somewhere \"in the middle\" on tariffs.",
    "link": "https://www.cnbc.com/2025/03/04/stock-market-today-live-updates.html",
    "timestamp": "2025-03-04T23:04:02Z"
  },
  {
    "title": "GOP Is ‘Trying to Gaslight’ Americans Into Believing Trump Has Made Their Lives Better, Tara Setmayer Says | Video",
    "description": "\"I don't think that's what the American people voted for,\" the former GOP comms director adds\nThe post GOP Is ‘Trying to Gaslight’ Americans Into Believing Trump Has Made Their Lives Better, Tara Setmayer Says | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gop-gaslight-americans-believing-trump/",
    "timestamp": "2025-03-04T23:02:37Z"
  },
  {
    "title": "Gavin Newsom & his allies just forced 12 historic family farms & dairies out of Point Reyes National Seashore in California.",
    "description": "Gavin Newsom & his allies just forced 12 historic family farms & dairies out of Point Reyes National Seashore in California. They claim it’s about saving the environment — but the truth couldn't be more different. Here is the true story — and it's heartbreaki…",
    "link": "https://freerepublic.com/focus/f-news/4302109/posts",
    "timestamp": "2025-03-04T23:01:50Z"
  },
  {
    "title": "Confusion for Visa Applicants, Attorneys After New Forms Announced",
    "description": "The U.S. Citizenship and Immigration Service updated forms without notice Monday, potentially affecting hundreds of applicants.",
    "link": "https://www.newsweek.com/us-visa-forms-changed-green-cards-citizenship-uscis-2039640",
    "timestamp": "2025-03-04T23:01:10Z"
  },
  {
    "title": "Inverse Head And Shoulders Breakout Suggests Bitcoin Price Is Headed To $300,000",
    "description": "The Bitcoin price action is showing strong bullish signals, as a rare Inverse Head and Shoulder pattern has just broken out and retested its neckline. This technical setup suggests that Bitcoin could be gearing up for a mega rally to $300,000 soon. Analyst Fo…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-is-headed-to-300000/",
    "timestamp": "2025-03-04T23:00:34Z"
  },
  {
    "title": "Trump blasts CBS ‘Deface the Nation’ host Margaret Brennan, says ‘anybody on the street’ can do her job",
    "description": "President Trump blasted \"Face the Nation\" moderator Margaret Brennan, suggesting \"anybody on the street\" can do her job when asked about her interview with Marco Rubio.",
    "link": "https://www.foxnews.com/media/trump-blasts-cbs-deface-nation-host-margaret-brennan-says-anybody-street-can-do-her-job",
    "timestamp": "2025-03-04T23:00:17Z"
  },
  {
    "title": "U.S. Bondholders Bear the Burden of Sanctions Against Venezuela",
    "description": "In an interview with The Epoch Times last Saturday, Richard Grenell, Presidential Envoy for Special Missions, said that Donald Trump is committed to doing everything in his power to make the American people stronger and more prosperous. This unwavering focus …",
    "link": "https://oilprice.com/Energy/Energy-General/US-Bondholders-Bear-the-Burden-of-Sanctions-Against-Venezuela.html",
    "timestamp": "2025-03-04T23:00:00Z"
  },
  {
    "title": "Restructuring fuel subsidies to go on",
    "description": "PETALING JAYA: The plans to restructure RON 95 fuel subsidies is on course for implementation in the middle of the year, with consumer groups urging the govern­ment to defer it due to ­rising costs and economic uncertainties tied to the United States' new tra…",
    "link": "https://www.thestar.com.my/news/nation/2025/03/05/restructuring-fuel-subsidies-to-go-on",
    "timestamp": "2025-03-04T23:00:00Z"
  },
  {
    "title": "Effort to Kill IRS Crypto Rule Clears U.S. Senate Hurdle",
    "description": "With a split among Democrats, the Senate resolution to erase the IRS' DeFi-focused crypto broker rule passed with a massive majority and is now up to the House.",
    "link": "https://www.coindesk.com/policy/2025/03/04/effort-to-kill-irs-crypto-rule-clears-u-s-senate-hurdle",
    "timestamp": "2025-03-04T22:59:06Z"
  },
  {
    "title": "US Senate Votes to Overturn Controversial Crypto Tax Reporting Rule",
    "description": "The resolution now awaits a parallel version to advance in the House which must pass a floor vote before heading to Trump’s desk.",
    "link": "https://decrypt.co/308659/us-senate-votes-to-overturn-controversial-crypto-tax-reporting-rule",
    "timestamp": "2025-03-04T22:59:04Z"
  },
  {
    "title": "Ros Atkins on... President Trump's history with Ukraine",
    "description": "The BBC's analysis editor takes a look at President Trump's history with Ukraine - and how it set the stage for this week's events.",
    "link": "https://www.bbc.com/news/videos/c4ge843m331o",
    "timestamp": "2025-03-04T22:58:49Z"
  },
  {
    "title": "Trump is right to defund schools that allow illegal protests — but must protect free speech",
    "description": "It should never have gotten to this point. But colleges are so unable to corral their own kids that President Trump is stepping in to do it for them.",
    "link": "https://nypost.com/2025/03/04/opinion/trump-is-right-to-defund-schools-that-allow-illegal-protests/",
    "timestamp": "2025-03-04T22:58:48Z"
  },
  {
    "title": "Lawmakers reveal top issues they want Trump to hammer home during joint address to Congress",
    "description": "Members of Congress told Fox News Digital on Capitol Hill what they hope to hear from President Donald Trump during his joint address to Congress on Tuesday.",
    "link": "https://www.foxnews.com/politics/lawmakers-reveal-top-issues-they-want-trump-hammer-home-during-joint-address-congress",
    "timestamp": "2025-03-04T22:58:18Z"
  },
  {
    "title": "Blogging for Democracy",
    "description": "This is a great post from Mike Masnick about why Techdirt is writing more or less full-time about the Trump regime’s attack",
    "link": "https://kottke.org/25/03/blogging-for-democracy",
    "timestamp": "2025-03-04T22:57:19Z"
  },
  {
    "title": "How Trump's Canada and Mexico tariffs risk higher prices on cars",
    "description": "President Donald Trump’s decision to impose a 25% tariff on all imports coming into the U.S. from Canada and Mexico is expected to take a particular toll on the U.S. auto industry.",
    "link": "https://www.nbcnews.com/politics/economics/trumps-canada-mexico-tariffs-risk-higher-prices-cars-rcna194663",
    "timestamp": "2025-03-04T22:56:31Z"
  },
  {
    "title": "Report: Mexico Delays Response to US Tariffs, Hopes to Avert Trade War",
    "description": "Mexico’s president, Claudia Sheinbaum, reportedly hopes to deescalate a trade war by delaying a response to U.S. tariffs until she talks with President Donald Trump Thursday (March 6).\nSheinbaum said Tuesday (March 4) that Mexico will announce the details of …",
    "link": "https://biztoc.com/x/5e5317c71fedcd23",
    "timestamp": "2025-03-04T22:56:12Z"
  },
  {
    "title": "The stock market doesn’t like Trump’s tariffs. But that might not matter any more",
    "description": "U.S. President Donald Trump has provided a clear answer to one lingering trade-related question: Yes, he is serious about imposing tariffs on Canada and Mexico. But another question lingers: Does he care about the stock market’s reaction?\nThe long-held belief…",
    "link": "https://biztoc.com/x/e7edb6dc9260a735",
    "timestamp": "2025-03-04T22:56:11Z"
  },
  {
    "title": "Protest Groups Gather to Assail Trump’s Presidency",
    "description": "Events were scheduled throughout the day in all 50 states, including later gatherings on the West Coast and in Hawaii.",
    "link": "https://time.com/7264462/protest-groups-gather-assail-trump-presidency/",
    "timestamp": "2025-03-04T22:56:11Z"
  },
  {
    "title": "Roundup: U.S. stocks extend losses as Trump's tariff policies take effect",
    "description": "NEW YORK, March 4 (Xinhua) -- U.S. stocks suffered more losses on Tuesday as investors grew increasingly anxious about the economic impact of U.S. President Donald Trump's tariff policies. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/05/roundup-us-stocks-extend-losses-as-trump039s-tariff-policies-take-effect",
    "timestamp": "2025-03-04T22:56:00Z"
  },
  {
    "title": "Coinbase, Chainlink, Strategy Among Companies Attending Trump's Crypto Summit",
    "description": "Coinbase, Chainlink, Strategy Among Companies Attending Trump's Crypto Summit\nU.S. President Donald Trump is slated to host the summit.\nWhat to know:\n- Executives from crypto companies, including Coinbase, Chainlink, and Exodus, will attend U.S. President Don…",
    "link": "https://biztoc.com/x/ce86e4b2d6c34c84",
    "timestamp": "2025-03-04T22:55:59Z"
  },
  {
    "title": "Trump could scale back Canada, Mexico tariffs Wednesday, Lutnick says",
    "description": "President Donald Trump will “probably” announce tariff compromise deals with Canada and Mexico soon, Commerce Secretary Howard Lutnick said Tuesday.",
    "link": "https://www.nbcnews.com/business/business-news/trump-scale-back-canada-mexico-tariffs-wednesday-lutnick-says-rcna194793",
    "timestamp": "2025-03-04T22:53:57Z"
  },
  {
    "title": "Education for Democracy, Agreement on Conservation of Marine Biological Diversity among Several Resolutions Adopted by General Assembly",
    "description": "The General Assembly, over the course of two meetings today, adopted seven resolutions — some drawing more contention than others — and heard an address by the President of Poland.",
    "link": "https://press.un.org/en/2025/ga12676.doc.htm",
    "timestamp": "2025-03-04T22:52:12Z"
  },
  {
    "title": "‘Come Out Swinging’: GOP Members of Congress Anticipate Trump’s Address",
    "description": "Republican members of Congress shared with The Daily Signal about what they expected—and hoped—to hear in President Donald Trump’s address to a joint session of... Read More\nThe post ‘Come Out Swinging’: GOP Members of Congress Anticipate Trump’s Address appe…",
    "link": "https://www.dailysignal.com/2025/03/04/come-out-swinging-members-congress-anticipate-trumps-address/",
    "timestamp": "2025-03-04T22:51:00Z"
  },
  {
    "title": "House Republicans advised to stop holding in-person town halls",
    "description": "Lawmakers' in-person listening sessions have been overrun with complaints about federal DOGE cuts.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/04/house-republicans-doge-town-halls/81417000007/",
    "timestamp": "2025-03-04T22:50:53Z"
  },
  {
    "title": "These 4 Countries Have Faster GDP Growth Than the US",
    "description": "The U.S. economy appeared strong just 10 days ago, but new indicators suggest emerging trouble.",
    "link": "https://www.newsweek.com/these-4-countries-have-faster-gdp-growth-us-2039468",
    "timestamp": "2025-03-04T22:50:49Z"
  },
  {
    "title": "Donald Trump’s tariffs will be ‘pretty ugly’ for KiwiSavers, providers warn",
    "description": "But the impact may not last.",
    "link": "https://www.nzherald.co.nz/business/donald-trumps-tariffs-will-be-pretty-ugly-for-kiwisavers-providers-warn/ODD7YHIPEZG6TLBEG66B6WGKRA/",
    "timestamp": "2025-03-04T22:49:52Z"
  },
  {
    "title": "‘Biden Truthers’ aren’t just pathetic — their blindness reveals Democrats’ fatal flaw",
    "description": "Time and time again, the Democrats have set aside common sense, decency and the interests of the country in a ruthless pursuit of power — arrogantly convinced they are history's Good Guys.",
    "link": "https://nypost.com/2025/03/04/opinion/biden-truthers-blindness-reveals-democrats-fatal-flaw/",
    "timestamp": "2025-03-04T22:49:47Z"
  },
  {
    "title": "In Trump's second term, this immigration lawyer has seen panic, chaos",
    "description": "NPR's Ari Shapiro spoke with immigration attorney Andrea Lino over the course of several weeks, as she saw how President Trump's immigration policies caused panic among her clients.",
    "link": "https://www.npr.org/2025/03/04/nx-s1-5265313/in-trumps-second-term-this-immigration-lawyer-has-seen-panic-chaos",
    "timestamp": "2025-03-04T22:49:23Z"
  },
  {
    "title": "US, Ukraine now plan to sign minerals deal. Book it done that Trump will brag about in his speech tonight [Interesting]",
    "description": "US, Ukraine now plan to sign minerals deal. Book it done that Trump will brag about in his speech tonight",
    "link": "https://www.fark.com/comments/13584520/US-Ukraine-now-plan-to-sign-minerals-deal-Book-it-done-that-Trump-will-brag-about-in-his-speech-tonight",
    "timestamp": "2025-03-04T22:47:35Z"
  },
  {
    "title": "Analysis Finds Trump Tariffs Will Cost Average US Family $1,600 or More Per Year",
    "description": "As U.S. President Donald Trump's new tariffs took effect on Tuesday, Congressman Don Beyer released a Joint Economic Committee report showing that the policies could cost the average working-class family in the United States at least $1,600 annually. \"The tar…",
    "link": "https://www.commondreams.org/news/25-tariff-trump",
    "timestamp": "2025-03-04T22:46:47Z"
  },
  {
    "title": "Inside the Democratic Race to Stop Andrew Cuomo",
    "description": "This year’s NYC mayoral election is already shaping up to be a fight for attention and name recognition—and against a former governor everyone knows all too well.",
    "link": "https://www.vanityfair.com/news/story/andrew-cuomo-nyc-mayor-race-eric-adams",
    "timestamp": "2025-03-04T22:46:27Z"
  },
  {
    "title": "New Poll Reveals Democrats’ Approval Rating: ‘Off A Cliff’",
    "description": "Democratic lawmakers have increasingly expressed concern over the Democratic Party's struggle to oppose the Trump Administration's Department of Government Efficiency (DOGE). Despite numerous rallies, Democrats have failed to counter the administration's prop…",
    "link": "https://freerepublic.com/focus/f-chat/4302106/posts",
    "timestamp": "2025-03-04T22:46:20Z"
  },
  {
    "title": "Coinbase, Chainlink, Strategy Among Companies Attending Trump's Crypto Summit",
    "description": "U.S. President Donald Trump is slated to host the summit.",
    "link": "https://www.coindesk.com/policy/2025/03/04/coinbase-chainlink-strategy-among-companies-attending-trump-s-crypto-summit",
    "timestamp": "2025-03-04T22:46:07Z"
  },
  {
    "title": "FAIR: Trump’s Protest Threat Reflects Belief That Free Speech Belongs to Some",
    "description": "Trump has come out with a diktat threatening sanctions against any educational institution that tolerates forbidden demonstrations.",
    "link": "https://fair.org/home/trumps-protest-threat-reflects-belief-that-free-speech-belongs-to-some/",
    "timestamp": "2025-03-04T22:45:44Z"
  },
  {
    "title": "WATCH: Zelensky reveals who’s been stealing U.S. dollars meant for Ukraine in fantastic parody",
    "description": "Trump: 'I am in the driver's seat. OK? Do you understand that expression?' Zelensky: 'No, but we are not in car'",
    "link": "https://www.wnd.com/2025/03/watch-zelensky-reveals-whos-been-stealing-u-s-dollars-meant-for-ukraine-in-fantastic-parody/",
    "timestamp": "2025-03-04T22:45:33Z"
  },
  {
    "title": "Trump’s tariffs would make housing more expensive in the Bay Area. How much? It depends on what you’re building — and where",
    "description": "High interest rates and increasing construction costs had already put a strain on efforts to increase the Bay Area’s inadequate housing supply. Now, as President Donald Trump places sweeping tariffs on imports from China, Canada and Mexico, building costs and…",
    "link": "https://biztoc.com/x/ec45460577c50fa6",
    "timestamp": "2025-03-04T22:45:22Z"
  },
  {
    "title": "Canada, Mexico, and China respond to US tariffs",
    "description": "Canada, Mexico, and China respond to US tariffs\nAfter a monthlong delay, President Donald Trump announced new tariffs on Mexico, Canada, and China. These countries are fighting back with Canadian Prime Minister Justin Trudeau calling these tariffs \"very dumb.…",
    "link": "https://biztoc.com/x/d320e2205b6612c1",
    "timestamp": "2025-03-04T22:45:04Z"
  },
  {
    "title": "Trump vowed to end surprise medical bills. The team working on that just got slashed (Noam Levey/NPR)",
    "description": "Noam Levey / NPR:\nTrump vowed to end surprise medical bills.  The team working on that just got slashed  —  As President Donald Trump wrapped up his first term in 2020, he signed legislation to protect Americans from surprise medical bills.  “This must end,” …",
    "link": "https://www.memeorandum.com/250304/p143",
    "timestamp": "2025-03-04T22:45:00Z"
  },
  {
    "title": "Trump’s guests at joint session of Congress to highlight gender ideology and crime",
    "description": "Members and guests on the floor of the House during a joint session of Congress. / Credit: mark reinstein/Shutterstock\n\nWashington, D.C. Newsroom, Mar 4, 2025 / 17:45 pm (CNA).\nA woman athlete and a parental rights advocate are among the guests invited by the…",
    "link": "https://www.catholicnewsagency.com/news/262557/trump-s-guests-at-joint-session-of-congress-to-highlight-gender-ideology-and-crime",
    "timestamp": "2025-03-04T22:45:00Z"
  },
  {
    "title": "Trump's tariffs scramble an already uncertain housing market",
    "description": "As the nation’s economy absorbs the shock of tariffs broadly imposed this week by President Donald Trump, experts warn that housing is one area that could take a double hit.Read more...",
    "link": "https://qz.com/tariff-uncertainty-looms-over-housing-1851767744",
    "timestamp": "2025-03-04T22:45:00Z"
  },
  {
    "title": "US consumers warned to brace for higher prices due to Trump’s tariffs",
    "description": "Americans have been warned to brace for higher prices within days of Donald Trump pulling the trigger on Monday, imposing US tariffs on goods from Canada and Mexico and hiking tariffs on China.\nGlobal stock markets came under pressure again on Tuesday, with l…",
    "link": "https://biztoc.com/x/b6341c339c2c071a",
    "timestamp": "2025-03-04T22:44:59Z"
  },
  {
    "title": "Bitcoin Sinks Further as Tariff Fears Wipe Out Trump ‘Reserve’ Gains",
    "description": "The price of Bitcoin briefly slipped below $82,000 on Tuesday, reversing recent gains as President Donald Trump’s 25% tariffs on Mexico and Canada took effect.\nBitcoin has since rebounded slightly to a current price of $83,740, but remains down 7% on the day …",
    "link": "https://biztoc.com/x/3df62a8f12bc9e6b",
    "timestamp": "2025-03-04T22:44:54Z"
  },
  {
    "title": "How Is Fentanyl Entering the US? Donald Trump's Tariffs Target Smugglers",
    "description": "President Donald Trump said his new tariffs on Mexico, Canada and China, which went into effect on Tuesday, were in part a result of inaction over the flow of fentanyl into the United States.\nThe 25 percent tariff on imports from Mexico and Canada, and a 20 p…",
    "link": "https://biztoc.com/x/fbff9f4a00f3f690",
    "timestamp": "2025-03-04T22:44:53Z"
  },
  {
    "title": "'It's frustrating' - How Trump's tariffs are being received in Canada",
    "description": "Some Canadians say the US tariffs have unified their country, and that they plan to buy only local goods.",
    "link": "https://www.bbc.com/news/videos/c93nkd359x7o",
    "timestamp": "2025-03-04T22:44:38Z"
  },
  {
    "title": "The Middle East’s problems: Israel offers answers and opportunities",
    "description": "Keeping Israel strong is in America’s interest because the Jewish state is the US’s only reliable regional ally, creating opportunities to advance US interests.",
    "link": "https://www.jpost.com/opinion/article-844695",
    "timestamp": "2025-03-04T22:42:48Z"
  },
  {
    "title": "US, Ukraine now plan to sign minerals deal, sources say",
    "description": "NEW YORK: US President Donald Trump's administration and Ukraine plan to sign a minerals deal that fell through after a disastrous Oval Office meeting Friday (Feb 28) in which Ukrainian President Volodymyr Zelenskyy was dismissed from the building, four peopl…",
    "link": "https://www.channelnewsasia.com/world/us-ukraine-minerals-deal-now-planned-sign-4977246",
    "timestamp": "2025-03-04T22:42:10Z"
  },
  {
    "title": "Trump administration signals it will let Idaho enforce its restrictive abortion ban",
    "description": "The Justice Department said it would move to dismiss a lawsuit originally filed against Idaho by the Biden administration, according to court papers filed by the state's largest hospital network.",
    "link": "https://www.npr.org/2025/03/04/nx-s1-5318043/trump-administration-lawsuit-idaho-emergency-abortions",
    "timestamp": "2025-03-04T22:41:35Z"
  },
  {
    "title": "Italian PM Giorgia Meloni Rejects UK-France Plan, Warns She Will NOT Send Peacekeeping Troops to Ukraine",
    "description": "Italian Prime Minister Meloni firmly declines military support offers from France and the UK for Ukraine, asserting, \"You can go—not with my soldiers.\" This bold stance raises significant implications for European alliances.\nThe post Italian PM Giorgia Meloni…",
    "link": "https://www.thegatewaypundit.com/2025/03/italian-pm-giorgia-meloni-rejects-uk-france-plan/",
    "timestamp": "2025-03-04T22:40:41Z"
  },
  {
    "title": "Automakers warn that Trump tariffs will hike vehicle prices as much as 25%",
    "description": "Many in the industry warn that the tariffs will disrupt the integrated supply chain across North America that has been in place for more than 25 years.",
    "link": "https://www.japantimes.co.jp/business/2025/03/05/markets/automakers-trump-tariffs-prices/",
    "timestamp": "2025-03-04T22:40:00Z"
  },
  {
    "title": "Why Is It So Hard to Watch this Oscar-Winning Documentary?",
    "description": "“No Other Land” is running into the same barriers other Palestinian films have.",
    "link": "https://www.yesmagazine.org/political-power/2025/03/04/no-other-land-oscar-win",
    "timestamp": "2025-03-04T22:38:17Z"
  },
  {
    "title": "Ports sale offers Panama way out of Trump row: experts",
    "description": "The decision by Hong Kong firm CK Hutchison to sell its Panama ports to a US-led consortium provides the Central American country with a convenient way out of its standoff with President Donald Trump, experts said Tuesday. Trump has been fixated on the questi…",
    "link": "https://www.digitaljournal.com/world/ports-sale-offers-panama-way-out-of-trump-row-experts/article",
    "timestamp": "2025-03-04T22:37:21Z"
  },
  {
    "title": "China to unveil 2025 growth goals eyeing trade war woes",
    "description": "China’s leadership will on Wednesday unveil their growth goals for the coming year as they eye a mounting trade war with the United States and deepening economic doldrums at home. Thousands of delegates will congregate in the morning for the opening session o…",
    "link": "https://www.digitaljournal.com/world/china-to-unveil-2025-growth-goals-eyeing-trade-war-woes/article",
    "timestamp": "2025-03-04T22:37:20Z"
  },
  {
    "title": "Canada, Mexico, and China respond to US tariffs",
    "description": "After a monthlong delay, President Donald Trump announced new tariffs on Mexico, Canada, and China. These countries are fighting back.",
    "link": "https://www.businessinsider.com/canada-mexico-and-china-respond-to-us-tariffs-2025-3",
    "timestamp": "2025-03-04T22:37:00Z"
  },
  {
    "title": "How Is Fentanyl Entering the US? Donald Trump's Tariffs Target Smugglers",
    "description": "The president said the flow of the illicit opioid is one of the reasons for imposing tariffs on trading partners.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-fentanyl-drug-canada-mexico-china-2039509",
    "timestamp": "2025-03-04T22:35:39Z"
  },
  {
    "title": "Trump’s tariffs could plunge Mexico and Canada into a recession | CNN",
    "description": "US President Donald Trump’s tariffs on Canada and Mexico could severely impact the economies of both countries, potentially slowing down production of certain goods, raising prices on products and sparking fears of a recession, analysts warn.",
    "link": "https://www.cnn.com/2025/03/04/americas/trump-tariffs-mexico-canada-recession-intl-latam/index.html",
    "timestamp": "2025-03-04T22:35:33Z"
  },
  {
    "title": "Trump crash stonks, Republicans run away",
    "description": "Despite his administration being laser-focused on deregulation and upper-class tax cuts, Trump’s idiotic trade war continues to tank markets as the country heads straight for recession: Stocks tumbled on Tuesday as President Trump’s broad tariffs against Cana…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/trump-crash-stonks-republicans-run-away",
    "timestamp": "2025-03-04T22:35:00Z"
  },
  {
    "title": "A Russia-Ukraine Peace Deal Could Lower Gas Prices, Says Soros Fund CEO",
    "description": "Soros Fund Management CEO Dawn Fitzpatrick shares her view on the Ukraine-Russia peace talk and its impact on U.S. economy.",
    "link": "https://observer.com/2025/03/russia-ukraine-peace-deal-oil-prices-soros-fund-ceo/",
    "timestamp": "2025-03-04T22:34:54Z"
  },
  {
    "title": "Exclusive -- White House: 'Tailwinds Behind' Trump Ahead of Primetime Address to Congress",
    "description": "WASHINGTON, DC – \"Tailwinds\" are behind President Donald Trump as he is set to deliver his joint congressional address Tuesday night, the White House tells Breitbart News.\nThe post Exclusive — White House: ‘Tailwinds Behind’ Trump Ahead of Primetime Address t…",
    "link": "https://www.breitbart.com/politics/2025/03/04/exclusive-wh-tailwinds-behind-trump-ahead-of-address-to-congress/",
    "timestamp": "2025-03-04T22:34:52Z"
  },
  {
    "title": "Poll and analysis: Americans most want to hear Trump talk about lowering prices",
    "description": "Republicans are more likely than Democrats to say they'll watch President Trump's joint address to Congress.",
    "link": "https://www.cbsnews.com/news/trump-joint-address-americans-want-him-to-talk-about-lowering-prices/",
    "timestamp": "2025-03-04T22:34:18Z"
  },
  {
    "title": "Japanese Firms Boost Exports to US to Get Ahead of Tariffs",
    "description": "Japanese companies are stockpiling goods in the US to lower the impact from any tariffs President Donald Trump might levy after hitting China, Canada and Mexico.",
    "link": "https://financialpost.com/pmn/business-pmn/japanese-firms-boost-exports-to-us-to-get-ahead-of-tariffs",
    "timestamp": "2025-03-04T22:34:07Z"
  },
  {
    "title": "Flypast and concert for VE Day 80th commemorations",
    "description": "There will be four days of events in May commemorating the 80th anniversary of VE Day.",
    "link": "https://www.bbc.com/news/articles/crewnnzv8g7o",
    "timestamp": "2025-03-04T22:34:01Z"
  },
  {
    "title": "Trump’s tariff chaos, briefly explained",
    "description": "And what a ride it was. | Romain Perrocheau/AFP via Getty Images\nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here.\nWelcome to T…",
    "link": "https://biztoc.com/x/5a7c01e1ce6aa967",
    "timestamp": "2025-03-04T22:33:48Z"
  },
  {
    "title": "Looming trade war heaps pressure on Thai shipments",
    "description": "<p>Thailand should shift its attention from celebrating rising export figures to prioritising the trade balance, analysing it country-by-country, says the Thai National Shippers' Council (TNSC).</p>",
    "link": "https://www.bangkokpost.com/business/general/2972963/looming-trade-war-heaps-pressure-on-thai-shipments",
    "timestamp": "2025-03-04T22:33:00Z"
  }
]