[
  {
    "title": "Crude oil futures rise ahead of Trump-Putin meeting",
    "description": "US President Donald Trump and Russian President Vladimir Putin will be meeting in Alaska on Friday to discuss the Russia-Ukraine conflict",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-ahead-of-trump-putin-meeting/article69931525.ece",
    "timestamp": "2025-08-14T04:43:30Z"
  },
  {
    "title": "Rosie O’Donnell calls Mounjaro ‘a lifesaver’ after showing off stunning body transformation",
    "description": "The comedian first revealed she was taking the semaglutide in 2023",
    "link": "https://www.the-independent.com/life-style/rosie-odonnell-mounjaro-weight-loss-body-transformation-b2807363.html",
    "timestamp": "2025-08-14T04:40:29Z"
  },
  {
    "title": "Jeannine Pirro Wants To Make An Example Of A Man Who Threw A Sandwich At An Officer",
    "description": "He's being charged with a felony for lobbing a sub.",
    "link": "https://www.huffpost.com/entry/subway-sandwich-officer-jeannine-pirro-trump_n_689d586de4b03640c7f17f75",
    "timestamp": "2025-08-14T04:36:21Z"
  },
  {
    "title": "Trump revokes Biden-era order on promoting US economic competition",
    "description": "The official order clarifies that the revocation does not impair existing legal authorities of federal agencies, will be implemented in accordance with applicable laws and available appropriations.",
    "link": "https://indianexpress.com/article/world/trump-revokes-biden-era-order-us-economic-competition-10188103/",
    "timestamp": "2025-08-14T04:35:08Z"
  },
  {
    "title": "Stephen King reveals his perfect ending to the ‘Trump horror story’",
    "description": "‘Carrie’ author discussed Trump’s America in a new interview",
    "link": "https://www.the-independent.com/arts-entertainment/books/news/stephen-king-trump-horror-story-carrie-shining-b2807359.html",
    "timestamp": "2025-08-14T04:34:36Z"
  },
  {
    "title": "Morning Bid: Bitcoin joins the risk-on party",
    "description": "You know markets are fully risk-on when cryptocurrencies are on a tear, with bitcoin joining global stocks to scale a record peak as the near certainty of...",
    "link": "https://finance.yahoo.com/news/morning-bid-bitcoin-joins-risk-043414162.html",
    "timestamp": "2025-08-14T04:34:14Z"
  },
  {
    "title": "Los Angeles school year begins amid fears over immigration enforcement",
    "description": "Los Angeles area students are returning to class under a cloud of apprehension after a summer of immigration raids and amid worries that schools could become a target in the Trump administration’s aggressive crackdown",
    "link": "https://abcnews.go.com/Politics/wireStory/los-angeles-school-year-begins-amid-fears-immigration-124634362",
    "timestamp": "2025-08-14T04:32:45Z"
  },
  {
    "title": "China, India in talks to resume border trade after 5-Year pause",
    "description": "The normalizing in ties between the two countries come against the backdrop of deteriorating relations between New Delhi and US President Donald Trump, who has imposed a 50% tariff rate on Indian exports to the US",
    "link": "https://www.bloomberg.com/news/articles/2025-08-14/china-india-in-talks-to-resume-border-trade-after-5-year-pause",
    "timestamp": "2025-08-14T04:32:40Z"
  },
  {
    "title": "Asian shares are mixed after days of gains driven by hopes for US rate cuts",
    "description": "MANILA, Philippines (AP) — Asian shares were mixed on Thursday after days of gains driven by hopes for lower U.S. interest rates, while U.S. futures slipped. In Tokyo, the Nikkei 225 fell 1.4% to 42,657.94 as investors sold to lock in recent gains that have t…",
    "link": "https://financialpost.com/pmn/asian-shares-are-mixed-after-days-of-gains-driven-by-hopes-for-us-rate-cuts",
    "timestamp": "2025-08-14T04:31:08Z"
  },
  {
    "title": "Why Trump's 50% Tariffs May Not Hurt India's Growth, S&P Rating Explains",
    "description": "S&P's latest projections show India's GDP growth will remain steady at 6.5 per cent in the ongoing fiscal year, matching the previous financial year's performance. New Delhi: US President Donald Trump's punitive tariffs on Indian imports will not impact India…",
    "link": "https://freerepublic.com/focus/f-news/4334496/posts",
    "timestamp": "2025-08-14T04:30:23Z"
  },
  {
    "title": "The Irish Independent’s View: Europe and Ukraine on edge as Trump rolls dice with Putin",
    "description": "One of the most consequential meetings of this century takes place tomorrow, when the fates of Ukraine and Europe may be shaped, despite neither being in attendance. Fears that US president Donald Trump could seal a peace deal that sells Ukraine out are palpa…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-europe-and-ukraine-on-edge-as-trump-rolls-dice-with-putin/a437321886.html",
    "timestamp": "2025-08-14T04:30:00Z"
  },
  {
    "title": "Letters: Let’s keep fingers crossed that Donald Trump’s meeting with Vladimir Putin will prove fruitful",
    "description": "We know that all but one of the EU’s member states have endorsed a statement supporting Ukraine’s right to decide its own future.",
    "link": "https://www.independent.ie/opinion/letters/letters-lets-keep-fingers-crossed-that-donald-trumps-meeting-with-vladimir-putin-will-prove-fruitful/a1305019398.html",
    "timestamp": "2025-08-14T04:30:00Z"
  },
  {
    "title": "Jimmy Fallon’s Tonight Show receives record audience spike thanks to Fox News guest",
    "description": "The ‘Gutfeld!’ host steered clear of politics during his appearance on ‘The Tonight Show’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/tonight-show-jimmy-fallon-fox-news-greg-gutfeld-ratings-b2807355.html",
    "timestamp": "2025-08-14T04:29:38Z"
  },
  {
    "title": "Bitcoin Crosses Google to Become Fifth-Largest Asset as Fed Rate Cut Bets Rise",
    "description": "The milestone reflects a year-long build in bullish sentiment, fueled by a friendlier regulatory backdrop under President Donald Trump and the rapid adoption of corporate treasury strategies centered on Bitcoin accumulation.",
    "link": "https://www.coindesk.com/markets/2025/08/14/bitcoin-crosses-google-to-become-fifth-largest-asset-as-fed-rate-cut-bets-rise",
    "timestamp": "2025-08-14T04:26:31Z"
  },
  {
    "title": "DC Mayor Bowser walks delicate line with Trump, reflecting the city's precarious position",
    "description": "As National Guard troops deploy across her city as part of President Donald Trump’s efforts to clamp down on crime, D",
    "link": "https://abcnews.go.com/Politics/wireStory/dc-mayor-bowser-walks-delicate-line-trump-reflecting-124634635",
    "timestamp": "2025-08-14T04:22:22Z"
  },
  {
    "title": "Kristi Noem Announces Staggering Number Of People Applying For ICE Jobs In Only Two Weeks’ Time",
    "description": "Noem said Wednesday on Fox News' \"Hannity\" that 110,000 people have applied to work at U.S. Immigration and Customs Enforcement (ICE) in less than two weeks.",
    "link": "https://dailycaller.com/2025/08/14/kristi-noem-announces-staggering-number-applicants-ice/",
    "timestamp": "2025-08-14T04:16:07Z"
  },
  {
    "title": "Scraping the Barrel: Attrition and Cannibalization, Russo-Ukrainian War: Summer, 2025",
    "description": "After three years of war, with the commentariat on both sides eagerly predicting the looming collapse of the enemy, it behooves one to develop a prudent aversion to histrionic predictions. However, it seems fairly obvious that the war in Ukraine is at a criti…",
    "link": "https://freerepublic.com/focus/f-news/4334495/posts",
    "timestamp": "2025-08-14T04:14:39Z"
  },
  {
    "title": "Scraping the Barrel: Attrition and Cannibalization, Russo-Ukrainian War: Summer, 2025",
    "description": "After three years of war, with the commentariat on both sides eagerly predicting the looming collapse of the enemy, it behooves one to develop a prudent aversion to histrionic predictions. However, it seems fairly obvious that the war in Ukraine is at a criti…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334495/posts",
    "timestamp": "2025-08-14T04:14:39Z"
  },
  {
    "title": "Lenovo profit beats estimates on PC growth, AI demand",
    "description": "Lenovo reports strong profit growth amid US tariff concerns, outperforming competitors in PC market expansion.",
    "link": "https://www.bloomberg.com/news/articles/2025-08-14/lenovo-s-profit-beats-estimates-with-pc-growth-and-ai-demand",
    "timestamp": "2025-08-14T04:14:22Z"
  },
  {
    "title": "Los Angeles school year begins amid fears over immigration enforcement",
    "description": "Los Angeles area students are returning to class under a cloud of apprehension after a summer of immigration raids and amid worries that schools could become a target in the Trump administration’s aggressive crackdown",
    "link": "https://abcnews.go.com/US/wireStory/los-angeles-school-year-begins-amid-fears-immigration-124634361",
    "timestamp": "2025-08-14T04:14:17Z"
  },
  {
    "title": "Trump Signs Order to Ease Space Industry Regulations In Musk Win",
    "description": "President Donald Trump signed an executive order Wednesday to ease regulations for the commercial space industry, including steps to speed the licensing process for rocket launches in a win for the growing sector and onetime ally Elon Musk’s SpaceX.",
    "link": "https://www.ndtvprofit.com/business/trump-signs-order-to-ease-space-industry-regulations-in-musk-win",
    "timestamp": "2025-08-14T04:13:18Z"
  },
  {
    "title": "How a call from Trump ignited a frantic week of diplomacy",
    "description": "President Trump, seeking a peace deal, proposed a territorial exchange between Russia and Ukraine, alarming Zelenskyy. Ukraine feared being sidelined and pressured to cede land. Zelenskyy launched a diplomatic blitz, engaging European allies to influence Trum…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-a-call-from-trump-ignited-a-frantic-week-of-diplomacy-by-ukraine/articleshow/123294762.cms",
    "timestamp": "2025-08-14T04:12:23Z"
  },
  {
    "title": "Gold Price Snaps Two-Day Drop - Check Rates In Delhi, Mumbai, Chennai And Other Cities",
    "description": "Gold prices was trading marginally higher after two days of price drops. The yellow metal was trading at Rs 1,00,420 per 10 gm, compared to Rs 100,250 on Wednesday. Gold prices saw a slip on the global front after US President Donald Trump announced that “Gol…",
    "link": "https://www.ndtvprofit.com/markets/gold-price-snaps-two-day-drop-check-rates-in-delhi-mumbai-chennai-and-other-cities",
    "timestamp": "2025-08-14T04:10:06Z"
  },
  {
    "title": "US to explore cooperation with Pakistan on critical minerals, hydrocarbons",
    "description": "Key mining projects in Pakistan, including Reko Diq, US-Pakistan counterterrorism talks, and trade cooperation highlighted by Secretary Rubio.",
    "link": "https://www.thehindubusinessline.com/news/world/us-to-explore-cooperation-with-pakistan-on-critical-minerals-hydrocarbons/article69931467.ece",
    "timestamp": "2025-08-14T04:09:19Z"
  },
  {
    "title": "The Trump-Putin Summit Could Actually Be Helpful",
    "description": "There are scenarios in which the meeting might act as a bridge to a peace process.",
    "link": "http://foreignpolicy.com/2025/08/14/the-trump-putin-summit-could-actually-be-helpful/",
    "timestamp": "2025-08-14T04:01:49Z"
  },
  {
    "title": "The Trump-Putin Summit Could Actually Be Helpful",
    "description": "There are scenarios in which the meeting might act as a bridge to a peace process.",
    "link": "http://foreignpolicy.com/2025/08/14/trump-putin-alaska-meeting-ukraine-war-end/",
    "timestamp": "2025-08-14T04:01:49Z"
  },
  {
    "title": "Crypto Exchange Bullish IPO: Shares Soar 143% On Debut, Opening At $90 Per Share",
    "description": "The cryptocurrency exchange Bullish experienced a notable debut on the New York Stock Exchange (NYSE) on Wednesday, opening at $90 per share—a 143% increase from its initial public offering (IPO) price of $37.  According to CNBC data, the stock, trading under…",
    "link": "https://bitcoinist.com/crypto-exchange-bullish-ipo-shares-soar-143/",
    "timestamp": "2025-08-14T04:00:41Z"
  },
  {
    "title": "What’s Really Behind Opposition to Trump’s Move in DC?",
    "description": "Lots of misinformation is being spread about President Donald Trump’s decision to federalize law enforcement in Washington, D.C.  Much of it is the usual Trump Derangement Syndrome: “fascist” tendencies toward “autho...",
    "link": "https://www.americanthinker.com/articles/2025/08/what_s_really_behind_opposition_to_trump_s_move_in_dc.html",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "More Bad Ads on TV and Cable – A Critique",
    "description": "I received such an outpouring of comments to my recent bad T.V. and cable ads article that I thought I’d give this another shot. \r\n\r\nCurrently, there are so many bad ads I had no problem finding truly dreadful examples.\r\n\r\nFirst, let&rsquo...",
    "link": "https://www.americanthinker.com/articles/2025/08/more_bad_ads_on_tv_and_cable_a_critique.html",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "Our corporate leadership class",
    "description": "Some readers may disagree, but I get the sense that corporations, especially large bureaucratic ones, foster leaders who do not possess strong opinions about anything. The leaders that do emerge seem to be pliant creatures who practice a repugnant fo...",
    "link": "https://www.americanthinker.com/blog/2025/08/our_corporate_leadership_class.html",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "Tubs in a topper, RTÉ on its uppers: Patrick Freyne can see clearly now",
    "description": "Ryan Tubridy’s return of €150,000 to his old employer, plus eight other TV moments I missed while I was away reading books and smelling flowers",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/08/14/tubs-in-a-topper-rte-on-its-uppers-patrick-freyne-can-see-clearly-now/",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "The laurels of Henry Kissinger",
    "description": "Donald Trump has made no secret of his aspiration for a Nobel Peace Prize—and he might get it, possibly sharing the stage with Vladimir Putin. But if he accepts any of Putin’s conditions for ending the war, he might win it not for securin...",
    "link": "https://www.americanthinker.com/blog/2025/08/the_laurels_of_henry_kissinger.html",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "Trump’s immigration crackdown sparks economic boom the experts said couldn’t happen",
    "description": "Donald Trump’s second term has confounded the experts who swore that tough immigration control would choke the economy. Far from stalling, growth has found a new gear. It’s powered not by unchecked foreign labor but by renewed opportunity...",
    "link": "https://www.americanthinker.com/blog/2025/08/trump_s_immigration_crackdown_sparks_economic_boom_the_experts_said_couldn_t_happen.html",
    "timestamp": "2025-08-14T04:00:00Z"
  },
  {
    "title": "'US Military Will Liberate DC' — Trump",
    "description": "US President Donald Trump said that the real crime rates in Washington, DC, are 5-10 times higher than reported in official statistics, and vowed to make the city safe again.",
    "link": "https://sputnikglobe.com/20250814/-us-military-will-liberate-dc--trump-1122607162.html",
    "timestamp": "2025-08-14T03:58:00Z"
  },
  {
    "title": "Crypto Market Conditions ‘Exceptionally Strong’ as Bitcoin, Ethereum, XRP Advance",
    "description": "Bitcoin’s record run underscores strong market underpinnings, though some warn optimism over Fed easing may be premature.",
    "link": "https://decrypt.co/335152/crypto-market-exceptionally-strong-bitcoin-ethereum-xrp",
    "timestamp": "2025-08-14T03:57:31Z"
  },
  {
    "title": "Trump Has Resorted To Making Numbers Up — And Experts Say It Should Worry All Of Us",
    "description": "WASHINGTON — Donald Trump has a simple solution when numbers are telling him something he does not want to hear: Make up new numbers.\nThe president’s strategy, if you want to call it one, was on vivid display this week on three fronts: His decision to appoint…",
    "link": "https://biztoc.com/x/fa98c4a41d4265f4",
    "timestamp": "2025-08-14T03:55:04Z"
  },
  {
    "title": "Report: Harvard, Trump administration close to massive settlement over antisemitism",
    "description": "Harvard is reportedly nearing a $500 million settlement with the Trump administration to end investigations and restore federal funding, ending standoff over antisemitism probes, academic freedom, and the university’s refusal to meet demands.",
    "link": "https://www.israelnationalnews.com/news/413251",
    "timestamp": "2025-08-14T03:49:10Z"
  },
  {
    "title": "AG Pam Bondi suggests Trump's crime crackdown in DC will help Latino residents",
    "description": "U.S. Attorney General Pam Bondi says President Donald Trump's order to crack down on crime in Washington, D.C. is 'crystal clear,' as critics claim the capital's crime is down.",
    "link": "https://www.foxnews.com/media/ag-pam-bondi-suggests-trumps-crime-crackdown-dc-help-latino-residents",
    "timestamp": "2025-08-14T03:43:10Z"
  },
  {
    "title": "Coalition of Willing Opposes Any Restrictions on Ukrainian Army as Part of Ukraine Deal",
    "description": "The so-called \"coalition of the willing\" has opposed any restrictions on the Ukrainian armed forces as part of the deal on settling the Ukraine conflict ahead of the meeting between Russian President Vladimir Putin and US President Donald Trump, a joint state…",
    "link": "https://sputnikglobe.com/20250814/coalition-of-willing-opposes-any-restrictions-on-ukrainian-army-as-part-of-ukraine-deal-1122606859.html",
    "timestamp": "2025-08-14T03:41:00Z"
  },
  {
    "title": "'What a shame': WSJ editors shred GOP Senators for holding Trump nominees 'hostage'",
    "description": "The conservative editorial board of the Wall Street Journal ripped two Republican Senators on Wednesday for allegedly undermining the president's nominees for their own gain. Sens. Chuck Grassley (R-IA) and John Curtis (R-UT) appear to be holding some of Pres…",
    "link": "https://www.rawstory.com/wall-street-journal-2673883237/",
    "timestamp": "2025-08-14T03:38:50Z"
  },
  {
    "title": "Seth Meyers Awards Trump With 1 Well-Deserved Honor Over This Kennedy Center Tale",
    "description": "The \"Late Night\" host clowned the president using an \"original\" prize of his own creation.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-host-kennedy-center-honors-ceremony_n_689d412ae4b0185e88487c5b",
    "timestamp": "2025-08-14T03:38:37Z"
  },
  {
    "title": "Scott Jennings Mocks Democratic Guest: ‘I Don’t Even Know What You Do for a Living’",
    "description": "CNN commentator Scott Jennings roasted Democratic operative Julie Roginsky, stating that he doesn't know what her job is.\nThe post Scott Jennings Mocks Democratic Guest: ‘I Don’t Even Know What You Do for a Living’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/scott-jennings-mocks-democratic-guest-i-dont-even-know-what-you-do-for-a-living/",
    "timestamp": "2025-08-14T03:36:14Z"
  },
  {
    "title": "Dana White gives major update on proposed UFC fight at the White House",
    "description": "UFC CEO Dana White is set to meet with President Trump to finalise plans for a historic Fourth of July UFC event at the White House, coinciding with the United States' 250th anniversary. This follows UFC's landmark billion-dollar broadcasting deal with Paramo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dana-white-gives-major-update-on-proposed-ufc-fight-at-the-white-house/articleshow/123294217.cms",
    "timestamp": "2025-08-14T03:33:54Z"
  },
  {
    "title": "Ron Howard Calls ‘Hillbilly Elegy’s Legacy “A Mixed Bag” After J.D. Vance’s “Divisive” Turn",
    "description": "Five years after bringing J.D. Vance‘s memoir to Netflix, Ron Howard doesn’t appear to waste much time thinking about the Trump VP. The 2x Oscar-winning director behind 2020’s Hillbilly Elegy explained that the author and former Ohio senator’s political pivot…",
    "link": "http://deadline.com/2025/08/ron-howard-hillbilly-elegy-legacy-mixed-bag-jd-vance-divisive-1236486044/",
    "timestamp": "2025-08-14T03:33:11Z"
  },
  {
    "title": "DC residents protest as White House says federal agents will be on patrol 24/7",
    "description": "Residents in one Washington, D.C., neighborhood lined up Wednesday to protest the increased police presence.",
    "link": "https://www.wishtv.com/news/politics/dc-residents-protest-as-white-house-says-federal-agents-will-be-on-patrol-24-7/",
    "timestamp": "2025-08-14T03:30:35Z"
  },
  {
    "title": "EU, NATO chiefs back Ukraine ahead of Trump-Putin summit",
    "description": "Berlin Aug 14: European leaders continued to push to have Ukraine involved in the negotiations between the United States and Russia, ahead of talks […]\nThe post EU, NATO chiefs back Ukraine ahead of Trump-Putin summit appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/14/eu-nato-chiefs-back-ukraine-ahead-of-trump-putin-summit/",
    "timestamp": "2025-08-14T03:30:00Z"
  },
  {
    "title": "Federal agents in Trump's crime crackdown set up checkpoint in popular D.C. nightlife area",
    "description": "The increased presence of law enforcement drew a crowd of protesters a day after the National Guard was deployed on city streets.",
    "link": "https://www.nbcnews.com/politics/trump-administration/national-guard-troops-washington-dc-trump-police-checkpoint-protesters-rcna224842",
    "timestamp": "2025-08-14T03:29:14Z"
  },
  {
    "title": "Trump signs order to ease commercial spaceflight regulations",
    "description": "The move is set to remove \"inefficient\" regulations for private space ventures in a move that could benefit former Trump advisor Elon Musk. Environmental groups criticized the order.",
    "link": "https://www.dw.com/en/trump-signs-order-to-ease-commercial-spaceflight-regulations/a-73631367",
    "timestamp": "2025-08-14T03:29:00Z"
  },
  {
    "title": "Republican Says He Doesn't 'Buckle Up' in D.C. Amid Fear of Carjacking",
    "description": "Trump's move to federalize Washington, D.C., represents one of the most aggressive uses of federal authority in recent memory.",
    "link": "https://www.newsweek.com/republican-says-he-doesnt-buckle-dc-amid-fear-carjacking-2113261",
    "timestamp": "2025-08-14T03:20:35Z"
  },
  {
    "title": "러시아 푸틴, 돈바스 영토와 제재 해제 없이 종전 동의 안 할 수도",
    "description": "There will be a time and place for a Trump-Putin summit. But it’s unlikely to be this week in Alaska, says @MarcChampion1 . Here’s why ️ pic.twitter.com/K6hjY5PJFD— Bloomberg Opinion (@opinion) August 12, 2025 미 에너지부(DoE), 미국 핵심 광물·소재 공급망 확보에 투입될 총 10억 달러 펀…",
    "link": "https://ryueyes11.tistory.com/511774",
    "timestamp": "2025-08-14T03:18:22Z"
  },
  {
    "title": "Failed New Mexico candidate gets 80 years for convictions in shootings at officials’ homes | CNN",
    "description": "A failed political candidate was sentenced to 80 years in federal prison Wednesday for his convictions in a series of drive-by shootings at the homes of state and local lawmakers in Albuquerque in the aftermath of the 2020 election.",
    "link": "https://www.cnn.com/2025/08/13/us/new-mexico-solomon-pena-sentenced-lawmakers-shootings",
    "timestamp": "2025-08-14T03:18:10Z"
  },
  {
    "title": "Melania Trump Demands Hunter Biden Retract 'Extremely Salacious' Epstein Comments",
    "description": "First lady Melania Trump is demanding that Hunter Biden retract comments linking her to sex trafficker Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/melania-trump-hunter-biden-jeffrey-epstein_n_689d5400e4b0ba345d660517",
    "timestamp": "2025-08-14T03:13:38Z"
  },
  {
    "title": "Ukraine, EU, US leaders speak ahead of Trump-Putin meeting: Key takeaways",
    "description": "Trump agrees to follow-up summit with Putin, Zelenskyy, and warns 'severe consequences' unless Russia agrees to truce.",
    "link": "https://www.aljazeera.com/news/2025/8/14/ukraine-eu-us-leaders-speak-ahead-of-trump-putin-meeting-key-takeaways",
    "timestamp": "2025-08-14T03:13:24Z"
  },
  {
    "title": "North Korean leader’s sister says South Korea lying about thaw in ties",
    "description": "Kim Yo Jong denies claims that Pyongyang has removed propaganda-blaring loudspeakers at the inter-Korean border.",
    "link": "https://www.aljazeera.com/news/2025/8/14/north-korean-leaders-sister-says-south-korea-lying-about-thaw-in-ties",
    "timestamp": "2025-08-14T03:07:06Z"
  },
  {
    "title": "Bitcoin hits record high above $124,000",
    "description": "The cryptocurrency rose above its previous July record, briefly exceeding $124,500 before retreating. Bitcoin's value has recently soared, fuelled by US regulatory changes under US President Donald Trump, a strong backer of the crypto sector.",
    "link": "https://economictimes.indiatimes.com/tech/technology/bitcoin-hits-record-high-above-124000/articleshow/123293786.cms",
    "timestamp": "2025-08-14T03:05:09Z"
  },
  {
    "title": "Wealth Management Firm Choreo Reveals $6.5 Million In Bitcoin ETF Holdings",
    "description": "Wealth management firm Choreo today disclosed that it has invested approximately $6.5 million in various spot Bitcoin (BTC) exchange-traded funds (ETFs). Per official details, the firm manages over $27 billion in total assets. Choreo Reveals Exposure To Bitco…",
    "link": "https://bitcoinist.com/wealth-management-choreo-6-5-million-bitcoin-etf/",
    "timestamp": "2025-08-14T03:00:52Z"
  },
  {
    "title": "Trump says he'll seek 'long-term' control of DC police and signals he'll target other cities next (Chris Stein/The Guardian)",
    "description": "Chris Stein / The Guardian:\nTrump says he'll seek ‘long-term’ control of DC police and signals he'll target other cities next  —  President's comments come as White House takes credit for dozens of arrests as part of campaign to fight ‘crime crisis’ city's le…",
    "link": "https://www.memeorandum.com/250813/p110",
    "timestamp": "2025-08-14T03:00:01Z"
  },
  {
    "title": "Trump vs. Putin: Whose educational journey is more inspiring?",
    "description": "Vladimir Putin’s legal education at Leningrad State University, shaped by mentor Anatoly Sobchak and enriched by KGB service, contrasts with Donald Trump’s path from New York Military Academy discipline to Wharton’s business training. Putin’s journey blends l…",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-vs-putin-whose-educational-journey-is-more-inspiring/articleshow/123293551.cms",
    "timestamp": "2025-08-14T02:56:36Z"
  },
  {
    "title": "Trump Jr.-tied firm raises $50M for crypto, mining as Bitcoin peaks",
    "description": "Social media ad firm Thumzup, which Donald Trump Jr. has invested in, has raised $50 million earmarked to buy more cryptocurrencies and crypto mining rigs.",
    "link": "https://cointelegraph.com/news/trump-jr-tied-firm-raises-50m-crypto-buys-mining-rigs",
    "timestamp": "2025-08-14T02:56:24Z"
  },
  {
    "title": "How President Trump Can End a Lost War",
    "description": "President Trump’s upcoming summit in Alaska with President Putin will be a defining moment not just in U.S. relations with the Russian Federation, but also for the safety and survival of the world. I do not believe that most Americans fully understand the gra…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334494/posts",
    "timestamp": "2025-08-14T02:55:24Z"
  },
  {
    "title": "US to explore cooperation with Pakistan on critical minerals, hydrocarbons",
    "description": "WASHINGTON (Reuters) -Secretary of State Marco Rubio said Washington looked forward to exploring cooperation with Pakistan on critical minerals and...",
    "link": "https://www.yahoo.com/news/articles/us-explore-cooperation-pakistan-critical-025404750.html",
    "timestamp": "2025-08-14T02:54:04Z"
  },
  {
    "title": "Man Accused of Assaulting Border Agent With a Sandwich in D.C.",
    "description": "The suspect shouted obscenities at the federal officer, then hurled the sandwich, a court filing says.",
    "link": "https://www.newsweek.com/washington-federal-officer-sandwich-2113243",
    "timestamp": "2025-08-14T02:53:02Z"
  },
  {
    "title": "Kim Jong Un’s powerful sister turns up the volume on loudspeaker standoff with South Korea | CNN",
    "description": "The powerful sister of North Korean leader Kim Jong Un on Thursday dismissed South Korean claims the North is removing some of its loudspeakers along the inter-Korean border, mocking the government in Seoul for clinging to hopes of renewed diplomacy between t…",
    "link": "https://www.cnn.com/2025/08/13/asia/north-korea-kim-yo-jong-loudspeakers-intl-hnk",
    "timestamp": "2025-08-14T02:51:13Z"
  },
  {
    "title": "Benchmark indices to open slightly higher; US-Russia talks eyed",
    "description": "US President Donald Trump and his Russian counterpart, Vladimir Putin, will discuss possible deal to end the war in Ukraine when they meet on Friday in Alaska",
    "link": "https://www.thehindubusinessline.com/markets/benchmark-indices-to-open-slightly-higher-us-russia-talks-eyed/article69931407.ece",
    "timestamp": "2025-08-14T02:46:19Z"
  },
  {
    "title": "Trump to offer Putin minerals for peace (Telegraph)",
    "description": "Telegraph:\nTrump to offer Putin minerals for peace  —  US president will propose money-making opportunities to encourage Russia to end Ukraine war  —  Donald Trump is preparing to offer Vladimir Putin access to rare earth minerals to incentivise him to end th…",
    "link": "https://www.memeorandum.com/250813/p108",
    "timestamp": "2025-08-14T02:45:01Z"
  },
  {
    "title": "7 Nations Endorse Trump for Nobel Peace Price: 'President of Peace'",
    "description": "At least seven nations across the Middle East, Asia, and Africa have called for President Donald Trump to receive a Nobel Peace Prize, with the White House celebrating the endorsements as proof that he is the \"President of PEACE.\"\nThe post 7 Nations Endorse T…",
    "link": "https://www.breitbart.com/politics/2025/08/13/7-nations-endorse-trump-for-nobel-peace-price-president-of-peace/",
    "timestamp": "2025-08-14T02:44:26Z"
  },
  {
    "title": "Donald Trump’s new head of the Bureau of Labour Statistics, EJ Antoni",
    "description": "The internet has been quick to dig into the professional history of EJ Antoni, President Donald Trump’s pick to lead the Bureau of Labour Statistics. It doesn’t take long.",
    "link": "https://www.smh.com.au/business/the-economy/trump-s-new-numbers-guru-is-not-qualified-to-do-the-job-20250814-p5mmsr.html",
    "timestamp": "2025-08-14T02:44:04Z"
  },
  {
    "title": "Miranda Devine: Bumbling Obama aides actually admit Russiagate was a smear campaign against Trump",
    "description": "The declassified documents tumbling out of Director of National Intelligence Tulsi Gabbard’s files show that, while they had a lot of power, President Barack Obama’s henchmen were none too bright.…",
    "link": "https://nypost.com/2025/08/13/opinion/obama-aides-admit-russiagate-was-a-smear-campaign-against-trump/",
    "timestamp": "2025-08-14T02:38:24Z"
  },
  {
    "title": "Trump and Putin: A strained relationship",
    "description": "The upcoming meeting between the two leaders in Alaska comes amid tensions over the Russian invasion of Ukraine and fruitless talks to end the conflict.",
    "link": "https://www.japantimes.co.jp/news/2025/08/14/world/politics/trump-putin-relationship/",
    "timestamp": "2025-08-14T02:38:00Z"
  },
  {
    "title": "Trump’s Got A Great Suggestion For Reporters Claiming D.C. Crime Is Not A Problem",
    "description": "President Donald Trump said he thinks it's a great idea for reporters who claim that D.C. crime is not a problem to go on a ride-along with law enforcement to get an accurate sense of the situation in the nation's capital. Speaking to reporters at a press con…",
    "link": "https://freerepublic.com/focus/f-news/4334491/posts",
    "timestamp": "2025-08-14T02:37:15Z"
  },
  {
    "title": "As Trump-Putin summit nears, family of Texan held in Russia seeks prisoner exchange",
    "description": "The family of Alabama native David Barnes, who is serving a 21-year sentence in Russia, is hoping the upcoming Trump-Putin summit will lead to a prisoner exchange.",
    "link": "https://abcnews.go.com/US/trump-putin-summit-nears-family-american-held-russia/story?id=124629214",
    "timestamp": "2025-08-14T02:35:49Z"
  },
  {
    "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein claim",
    "description": "The first lady's lawyer has demanded that Joe Biden's son retract claims he made about how she met her husband.",
    "link": "https://www.bbc.com/news/articles/cqjyw0l9d82o",
    "timestamp": "2025-08-14T02:30:46Z"
  },
  {
    "title": "Bitcoin hits new all-time high as Fed easing bets and favorable US policy align",
    "description": "Bitcoin smashes its record, climbing to a new all-time high of $124,002. Hopes for a significant Federal Reserve rate cut are fueling the rally. A new executive order opens the door for crypto in 401(k) retirement plans. Bitcoin blasted through to a new all-t…",
    "link": "https://coinjournal.net/news/bitcoin-hits-new-all-time-high-as-fed-easing-bets-and-favorable-us-policy-align/",
    "timestamp": "2025-08-14T02:29:53Z"
  },
  {
    "title": "Man accused of hurling sandwich at federal agent in D.C. gets hit with felony assault charge",
    "description": "A man accused of throwing a sandwich at a U.S.",
    "link": "https://www.nbcnews.com/politics/politics-news/man-accused-hurling-sandwich-federal-agent-dc-gets-hit-felony-assault-rcna224921",
    "timestamp": "2025-08-14T02:27:12Z"
  },
  {
    "title": "WhatsApp And Telegram Users In Russia Face New Restrictions On Voice Calls As Trump-Putin Alaska Meet Looms",
    "description": "On Wednesday, Russia announced that it has partially restricted audio calls on Mark Zuckerberg-led Meta Platforms, Inc.'s (NASDAQ:META) WhatsApp and Pavel Durov's Telegram, signaling another move to tighten internet control ahead of President Donald Trump's s…",
    "link": "https://biztoc.com/x/b57193a2dc7f75ce",
    "timestamp": "2025-08-14T02:26:30Z"
  },
  {
    "title": "U.S. national debt reaches a record $37 trillion, the Treasury Department reports",
    "description": "The U.S. government’s gross national debt has surpassed $37 trillion, a record number that highlights the accelerating debt on America’s balance sheet and increased cost pressures on taxpayers. The $37 trillion update is found in the latest Treasury Departmen…",
    "link": "https://freerepublic.com/focus/f-news/4334489/posts",
    "timestamp": "2025-08-14T02:24:07Z"
  },
  {
    "title": "Trump-Putin summit: What to know about Putin's past meetings with US leaders",
    "description": "Putin has met with American presidents many times over the decades - some more often than others.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/13/how-many-times-has-putin-met-with-us-presidents/85648253007/",
    "timestamp": "2025-08-14T02:19:27Z"
  },
  {
    "title": "Trump Reportedly Set to Offer Putin Access to Alaska’s Resources and Sanctions Relief",
    "description": "According to The Telegraph on August 13, US President Donald Trump is preparing to offer Russian leader Vladimir Putin a series of economic incentives to end the ongoing war in Ukraine. These proposals will be presented during their highly anticipated meeting…",
    "link": "https://freerepublic.com/focus/f-news/4334487/posts",
    "timestamp": "2025-08-14T02:18:20Z"
  },
  {
    "title": "GE Appliances to invest over $3 billion in US manufacturing push",
    "description": "Aug 13 (Reuters) - Haier-owned GE Appliances said on Wednesday it plans to invest more than $3 billion over five years in its U.S. operations and workforce following the Trump administration's tariff policies aimed at boosting domestic manufacturing. Global f…",
    "link": "https://freerepublic.com/focus/f-news/4334486/posts",
    "timestamp": "2025-08-14T02:16:58Z"
  },
  {
    "title": "CNBC Daily Open: Despite cooler-than-expected CPI, economists agree higher prices are coming",
    "description": "Don't mess with DJ D-Sol — Goldman Sachs CEO David Solomon's stage name when he's rocking the clubs in his other life as a DJ.\nU.S. President Donald Trump criticized Goldman on Tuesday for predicting that tariffs would push up inflation, and said Solomon \"sho…",
    "link": "https://biztoc.com/x/3632b234756feffa",
    "timestamp": "2025-08-14T02:15:29Z"
  },
  {
    "title": "Chuck Schumer Says He Feels ‘Perfectly Safe’ Walking Around DC",
    "description": "Senate Minority Leader Chuck Schumer dismissed Wednesday Republican claims that Washington, D.C., has become too dangerous to walk the streets.",
    "link": "https://dailycaller.com/2025/08/13/chuck-schumer-perfectly-safe-washington-dc/",
    "timestamp": "2025-08-14T02:12:15Z"
  },
  {
    "title": "Wall Street ticks higher after a rally wrapped around the world",
    "description": "Wall Street saw gains as hopes rose for interest rate cuts. S&P 500 and Nasdaq hit new records. Dow Jones also climbed. Asian and European markets reacted positively. Homebuilder stocks surged. HanesBrands agreed to be acquired by Gildan. Bullish had a strong…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ticks-higher-after-a-rally-wrapped-around-the-world/articleshow/123293025.cms",
    "timestamp": "2025-08-14T02:08:42Z"
  },
  {
    "title": "Collusion in Kentucky: Mitch McConnell’s Allies Plot to Take Out Trump-Aligned Trash Man Nate Morris",
    "description": "Allies of longtime former Senate Majority Leader and outgoing Sen. Mitch McConnell (R-KY) have been caught colluding in a nefarious plot to take down businessman Nate Morris, the U.S. Senate candidate most aligned with President Donald Trump, in next year’s G…",
    "link": "https://freerepublic.com/focus/f-news/4334485/posts",
    "timestamp": "2025-08-14T02:07:45Z"
  },
  {
    "title": "Melania Trump demands Hunter Biden retract 'extremely salacious' Epstein comments",
    "description": "First lady Melania Trump is demanding that Hunter Biden retract comments linking her to sex trafficker Jeffrey Epstein",
    "link": "https://abcnews.go.com/Entertainment/wireStory/melania-trump-demands-hunter-biden-retract-extremely-salacious-124633290",
    "timestamp": "2025-08-14T02:06:20Z"
  },
  {
    "title": "Bitcoin hits fresh record as Fed easing bets add to tailwinds",
    "description": "Bitcoin soared to a record high of $124,002.49, fueled by expectations of Federal Reserve rate cuts and Trump administration's crypto-friendly policies. Ether also hit a high of $4,780.04. Analyst Tony Sycamore suggests a break above $125k could propel Bitcoi…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/bitcoin-hits-fresh-record-as-fed-easing-bets-add-to-tailwinds/articleshow/123292979.cms",
    "timestamp": "2025-08-14T02:06:05Z"
  },
  {
    "title": "Update: Adam Schiff Breaks Silence After Trump’s Scathing Statement Over Plot to ‘Leak Classified Information to Damage Trump’",
    "description": "Disgraced former House Intelligence Committee Chairman Adam Schiff has finally responded after President Trump blasted him for allegedly approving a plan to leak classified information in a scheme designed to politically destroy Trump. .... Snip..... Presiden…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334484/posts",
    "timestamp": "2025-08-14T02:02:18Z"
  }
]