[
  {
    "title": "Appeals court panel stops order to wind down operations at 'Alligator Alcatraz’",
    "description": "ORLANDO, Fla. — A federal appeals court panel on Thursday put on hold a lower court judge’s order to end operations indefinitely at the immigration detention ce",
    "link": "https://weartv.com/news/local/appeals-court-panel-stops-order-to-wind-down-operations-at-alligator-alcatraz-in-evergla",
    "timestamp": "2025-09-04T21:58:26Z"
  },
  {
    "title": "The Sound of Silence After Minneapolis: America’s Masculinity Blind Spot",
    "description": "A trans shooter in Minneapolis does not change the pattern: Most mass murderers are cisgender men. Change begins with acknowledging that truth. And then acting on it.\nMen, let’s answer the call. Let’s urge Minnesota Gov. Tim Walz and Attorney General Keith El…",
    "link": "https://msmagazine.com/2025/09/04/minneapolis-shooter-gender-men-masculinity-trans/",
    "timestamp": "2025-09-04T21:57:54Z"
  },
  {
    "title": "JD Vance Drops 'S-Bomb' In Furious Post Over RFK Jr. 'Gotcha' Questions",
    "description": "The vice president didn't seem to like the bipartisan beatdown of the Health and Human Services secretary.",
    "link": "https://www.huffpost.com/entry/jd-vance-outraged-over-senates-gotcha-questions-to-rfk-jr_n_68b9e2b2e4b041ed82bdece9",
    "timestamp": "2025-09-04T21:56:48Z"
  },
  {
    "title": "The Losses Keep Piling Up For Trump Ally Jeanine Pirro",
    "description": "The prosecution of Trump's D.C. crime crackdown is not going well for the former Fox News personality.",
    "link": "https://www.huffpost.com/entry/jeanine-pirro-dc-crime-crackdown-prosecution_n_68b9fea4e4b0e20f601b521a",
    "timestamp": "2025-09-04T21:56:27Z"
  },
  {
    "title": "Live: Albanese and Trump share 'warm relationship': Rishworth",
    "description": "Employment Minister Amanda Rishworth says the prime minister's overnight call with the US president shows the pair share a \"warm relationship\". Follow live.",
    "link": "https://www.abc.net.au/news/2025-09-05/federal-politics-live-sept-5/105736120",
    "timestamp": "2025-09-04T21:54:04Z"
  },
  {
    "title": "Trump to rename Pentagon, restoring historic ‘Department of War’ in latest military move",
    "description": "President Donald Trump announces plan to rename the Department of Defense back to Department of War, reverting to the agency's former title as part of Pentagon reforms.",
    "link": "https://www.foxnews.com/politics/trump-rename-pentagon-restoring-historic-department-war-latest-military-move",
    "timestamp": "2025-09-04T21:53:37Z"
  },
  {
    "title": "Appeals court panel stops order to wind down ‘Alligator Alcatraz’ operations in Florida",
    "description": "A federal appeals court panel on Thursday put on hold a lower court judge’s order to end operations indefinitely at the immigration detention center in the Florida Everglades dubbed “Alligator Alcatraz.”",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-panel-stops-order-to-wind-down-alligator-alcatraz-operations-in-florida",
    "timestamp": "2025-09-04T21:53:06Z"
  },
  {
    "title": "RFK Jr.'s day on Capitol Hill exposes GOP fault lines: From the Politics Desk",
    "description": "Health Secretary Robert F. Kennedy Jr.’s Senate hearing exposed GOP fault lines on vaccines in the Trump era.",
    "link": "https://www.nbcnews.com/politics/politics-news/rfk-jr-hearing-exposes-gop-fault-lines-vaccines-politics-desk-rcna229194",
    "timestamp": "2025-09-04T21:52:06Z"
  },
  {
    "title": "Why the Trump-Modi split is such a disaster",
    "description": "When it comes to bromances, President Donald Trump typically runs hot and cold. Remember Elon Musk? Vladimir Putin? First they’re besties, then they’re trading barbs. The latest example? Indian Prime Minister Narendra Modi. During Trump’s first term, Modi joi…",
    "link": "https://www.vox.com/today-explained-podcast/460343/trump-modi-pakistan-china-nobel-peace-prize",
    "timestamp": "2025-09-04T21:50:22Z"
  },
  {
    "title": "Trump’s New War on ‘Narcoterrorists’",
    "description": "The U.S. military adds bombing alleged drug traffickers to its ever-growing list of duties.",
    "link": "http://foreignpolicy.com/2025/09/04/trump-venezuela-drug-boat-strike-us-military-narcoterrorism/",
    "timestamp": "2025-09-04T21:49:57Z"
  },
  {
    "title": "Social Security Update: Trump Admin Responds to Warning About Changes",
    "description": "Since Trump took office, the SSA has touted its improved wait times for beneficiaries, following several technology updates.",
    "link": "https://www.newsweek.com/social-security-update-trump-admin-responds-warning-changes-2124823",
    "timestamp": "2025-09-04T21:45:18Z"
  },
  {
    "title": "Missouri Begins GOP Gerrymander to Help Trump Rig 2026 Election (Jen Rice/Democracy Docket)",
    "description": "Jen Rice / Democracy Docket:\nMissouri Begins GOP Gerrymander to Help Trump Rig 2026 Election  —  Republicans' national effort to rig the 2026 election and win a GOP majority in Congress landed at a Missouri House committee hearing Thursday as the state became…",
    "link": "https://www.memeorandum.com/250904/p116",
    "timestamp": "2025-09-04T21:45:01Z"
  },
  {
    "title": "Trump signs order implementing U.S.-Japan trade deal; auto tariffs reduced to 15%",
    "description": "President Donald Trump signed an executive order on Thursday formally implementing a trade deal his administration struck with Japan in July. The executive order, released by the White House, said the United States will reduce its tariff on car imports from J…",
    "link": "https://japantoday.com/category/politics/urgent-trump-signs-order-formally-implementing-u.s.-japan-trade-deal",
    "timestamp": "2025-09-04T21:44:14Z"
  },
  {
    "title": "Bondi says human smuggling is 'getting people killed' across US as she announces crackdown",
    "description": "Pam Bondi warns that deadly smuggling networks led by cartels are killing families as she expands federal task force operations nationwide.",
    "link": "https://www.foxnews.com/politics/bondi-says-human-smuggling-getting-people-killed-us-she-announces-crackdown",
    "timestamp": "2025-09-04T21:41:17Z"
  },
  {
    "title": "Rubio: U.S. Adding Two Gangs To Terror List in ‘War’ Against ‘These Vicious Animals’",
    "description": "The U.S. has added two more foreign gangs to the Foreign Terrorist Organization (FTO) list, the State Department announced Thursday.",
    "link": "https://dailycaller.com/2025/09/04/rubio-u-s-adding-two-gangs-to-terror-list-in-war-against-these-vicious-animals/",
    "timestamp": "2025-09-04T21:41:14Z"
  },
  {
    "title": "Trump Tried to Fire Fed Reserve Gov Lisa Cook. Now His DOJ Is Investigating Her.",
    "description": "The Department of Justice has opened mortgage fraud investigations into Cook and other Trump adversaries.",
    "link": "https://truthout.org/articles/trump-tried-to-fire-fed-reserve-gov-lisa-cook-now-his-doj-is-investigating-her/",
    "timestamp": "2025-09-04T21:40:15Z"
  },
  {
    "title": "Implementing The United States-Japan Agreement (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nImplementing The United States-Japan Agreement  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers …",
    "link": "https://www.memeorandum.com/250904/p114",
    "timestamp": "2025-09-04T21:40:01Z"
  },
  {
    "title": "Trump-Illinois Staredown Intensifies As State Denies Voter Data Request",
    "description": "Illinois state officials told the Department of Justice they won’t be turning over voter data, despite the Trump administration’s request. In a letter to DOJ... Read More\nThe post Trump-Illinois Staredown Intensifies As State Denies Voter Data Request appeare…",
    "link": "https://www.dailysignal.com/2025/09/04/trump-illinois-staredown-intensifies-as-state-denies-voter-data-request/",
    "timestamp": "2025-09-04T21:40:00Z"
  },
  {
    "title": "The week in whoppers: Bill de Blasio spins Zohran Mamdani’s free-bus plan, JB Pritzker calls Chicago murders ‘no emergency’ and more",
    "description": "Former NYC Mayor Bill de Blasio said on Tuesday that free buses will work \"because if people are given a quality alternative they can afford, they'll use it.\"",
    "link": "https://nypost.com/2025/09/04/opinion/the-week-in-whoppers-bill-de-blasio-spins-zohran-mamdanis-free-bus-plan-jb-pritzker-calls-chicago-murders-no-emergency-and-more/",
    "timestamp": "2025-09-04T21:39:43Z"
  },
  {
    "title": "Trump Urges European Countries to End Russian Oil Purchases",
    "description": "President Donald Trump joined European leaders on a call Thursday and encouraged them to halt purchases of Russian oil that are in turn helping to fund the war in Ukraine and to economically pressure China for helping to subsidize Russia's campaign.\nThe post …",
    "link": "https://www.breitbart.com/politics/2025/09/04/trump-urges-european-countries-to-end-russian-oil-purchases/",
    "timestamp": "2025-09-04T21:38:30Z"
  },
  {
    "title": "U.S. trade gap widest in 4 months as imports surged ahead of tariffs",
    "description": "The U.S. trade deficit expanded more than expected in July to its widest in four months, government data showed Thursday, on a surge in imports before a fresh wave of President Donald Trump's tariffs kicked in. The overall U.S. trade deficit jumped 32.5 perce…",
    "link": "https://japantoday.com/category/business/us-trade-gap-widens-more-than-expected-on-goods-imports-surge",
    "timestamp": "2025-09-04T21:37:54Z"
  },
  {
    "title": "Donald Trump Seals a Tariff Deal with Japan",
    "description": "The order says Japan has agreed to invest $550 billion in the United States in projects that will be selected by the U.S. government.",
    "link": "https://biztoc.com/x/7ddaccb6e3383bbb",
    "timestamp": "2025-09-04T21:37:46Z"
  },
  {
    "title": "Trump's deadly strike on a boat from Venezuela was an act of war",
    "description": "President Donald Trump said the U.S. military blew up a vessel in the Caribbean, killing 11 people. The administration said the boat had departed from Venezuela.",
    "link": "https://biztoc.com/x/09e82ea11c1c58cc",
    "timestamp": "2025-09-04T21:37:42Z"
  },
  {
    "title": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says",
    "description": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says\nFollow the latest news on President Donald Trump and his administration | Sept. 4, 2025\nThe Justice Department has issued subpoenas as part of an investigation int…",
    "link": "https://biztoc.com/x/98b3c07183eeb988",
    "timestamp": "2025-09-04T21:37:39Z"
  },
  {
    "title": "Western allies pledge troops to Ukraine; NZ’s role unclear",
    "description": "Any troop commitment to Ukraine would require Cabinet approval, Judith Collins says.",
    "link": "https://www.nzherald.co.nz/nz/politics/western-allies-pledge-troops-to-ukraine-nzs-role-unclear/DF5TNIFU3ZBRLC63KLUSIDZVHY/",
    "timestamp": "2025-09-04T21:37:25Z"
  },
  {
    "title": "Northwestern University president resigns after Trump funding cuts",
    "description": "CHICAGO: The president of Northwestern University, a prestigious school in suburban Chicago, announced on Thursday (Sep 4) that he would resign as the institution deals with budget issues stemming from cuts in federal funding by the Trump administration.Presi…",
    "link": "https://www.channelnewsasia.com/world/northwestern-university-president-resigns-after-trump-funding-cuts-5333356",
    "timestamp": "2025-09-04T21:35:33Z"
  },
  {
    "title": "Judge upbraids prosecutors for handling of DC crime cases, saying they have 'no credibility left'",
    "description": "A federal magistrate judge on Thursday angrily accused top Justice Department prosecutors of trampling on the civil rights of people arrested during President Donald Trump's law-enforcement surge in the nation's capital. Judge Zia Faruqui, a former federal pr…",
    "link": "https://japantoday.com/category/world/judge-upbraids-prosecutors-for-handling-of-dc-surge-cases-saying-they-have-%27no-credibility-left%27",
    "timestamp": "2025-09-04T21:34:35Z"
  },
  {
    "title": "Trump's promised immigration crackdown in Chicago could last about six weeks, suburban official says",
    "description": "The Trump administration has informed local officials that its promised immigration enforcement surge in Chicago will operate seven days a week for about six weeks, according to the mayor of a suburb that houses an immigration processing center. Mayor Katrina…",
    "link": "https://japantoday.com/category/world/trump%27s-promised-immigration-crackdown-in-chicago-could-last-about-six-weeks-suburban-official-says",
    "timestamp": "2025-09-04T21:34:29Z"
  },
  {
    "title": "Immigrant pleads guilty to being in US illegally after judge allegedly helped him evade agents",
    "description": "An immigrant who was arrested after a Milwaukee judge allegedly helped him evade federal agents has pleaded guilty to being in the U.S. illegally",
    "link": "https://abcnews.go.com/US/wireStory/immigrant-pleads-guilty-us-illegally-after-judge-allegedly-125272237",
    "timestamp": "2025-09-04T21:34:26Z"
  },
  {
    "title": "Appeals court panel stops order to wind down operations at Everglades immigrant detention center",
    "description": "In a 2-1 vote, the order was stayed pending the outcome of an appeal.",
    "link": "https://www.bostonherald.com/2025/09/04/everglades-detention-center/",
    "timestamp": "2025-09-04T21:34:19Z"
  },
  {
    "title": "Mayor Eric Adams met with Trump special envoy Steve Witkoff to talk possible admin gig",
    "description": "Mayor Eric Adams met with President Trump’s special envoy to the Middle East, Steve Witkoff, in Florida earlier this week — amid talks about a potential role for Hizzoner in the administration, The Post has learned.",
    "link": "https://nypost.com/2025/09/04/us-news/mayor-eric-adams-met-with-trump-special-envoy-steve-witkoff-to-talk-possible-admin-gig/",
    "timestamp": "2025-09-04T21:34:15Z"
  },
  {
    "title": "Kennedy tries to defend COVID-19 vaccine stance in raucous Senate hearing",
    "description": "U.S. Health Secretary Robert F Kennedy Jr, facing pointed bipartisan questioning at a rancorous three-hour Senate committee hearing on Thursday, tried to defend his efforts to pull back COVID-19 vaccine recommendations and explain the turmoil he has created a…",
    "link": "https://japantoday.com/category/world/kennedy-to-appear-before-senate-committee-amid-cdc-turmoil",
    "timestamp": "2025-09-04T21:33:53Z"
  },
  {
    "title": "26 nations pledge to give Ukraine postwar security guarantees, Macron says",
    "description": "BTwenty-six nations have pledged to provide postwar security guarantees to Ukraine, which will include an international force on land and sea and in the air, French President Emmanuel Macron said after a summit meeting of Kyiv's allies on Thursday. Macron sai…",
    "link": "https://japantoday.com/category/world/26-nations-vow-to-give-ukraine-postwar-security-guarantees-macron-says1",
    "timestamp": "2025-09-04T21:33:41Z"
  },
  {
    "title": "Trump says U.S. would be on 'brink of economic catastrophe' unless justices rule his tariffs are legal",
    "description": "President Donald Trump is seeking a swift and definitive decision on tariffs from the Supreme Court that he helped shape, saying the country would be on “the brink of economic catastrophe” without the import taxes he has imposed on U.S. rivals and allies alik…",
    "link": "https://japantoday.com/category/world/trump-says-us-would-be-on-%27brink-of-economic-catastrophe%27-unless-justices-rule-his-tariffs-are-legal",
    "timestamp": "2025-09-04T21:33:25Z"
  },
  {
    "title": "Powerful pro-Trump committee goes after Irish subsidiary of US pharma giant UnitedHealth",
    "description": "The US Congress’s Committee on Oversight and Government Reform has ramped up an investigation into what it claims are “opaque business practices and relationships” at an Irish subsidiary of UnitedHealth Group.",
    "link": "https://www.independent.ie/business/irish/powerful-pro-trump-committee-goes-after-irish-subsidiary-of-us-pharma-giant-unitedhealth/a453979685.html",
    "timestamp": "2025-09-04T21:32:59Z"
  },
  {
    "title": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says - AP News",
    "description": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source saysAP News Exclusive | DOJ Opens Criminal Investigation Into Fed’s Cook, Issues SubpoenasThe Wall Street Journal Trump Live Updates: Lisa Cook Investigation, Fed Board…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179010084",
    "timestamp": "2025-09-04T21:32:49Z"
  },
  {
    "title": "A Different RFK Jr. Just Appeared Before Congress",
    "description": "America’s health secretary has moved into attack mode.",
    "link": "https://www.theatlantic.com/health/archive/2025/09/senators-finally-seem-realize-who-they-made-health-secretary/684111/",
    "timestamp": "2025-09-04T21:32:17Z"
  },
  {
    "title": "EXCLUSIVE: GOP Lawmakers Back VA Push To Revoke Biden-Era Healthcare Rule",
    "description": "Republican lawmakers are set to submit a letter to the Department of Veteran’s Affairs in support of rescinding a Biden-era rule, the Daily Caller has learned.",
    "link": "https://dailycaller.com/2025/09/04/trump-biden-veterans-affairs-abortion-rule-federal-law-gop-congress/",
    "timestamp": "2025-09-04T21:30:53Z"
  },
  {
    "title": "Trump’s Caribbean Strike Polarizes Region",
    "description": "Venezuela’s frayed ties with old allies have left it isolated in responding to U.S. force.",
    "link": "http://foreignpolicy.com/2025/09/04/trump-venezuela-strike-tren-aragua-mexico-brazil-colombia/",
    "timestamp": "2025-09-04T21:30:03Z"
  },
  {
    "title": "Missouri poised to make it harder for citizens to change constitution",
    "description": "The measure could be voted on in the full House early next week",
    "link": "https://www.stltoday.com/news/local/government-politics/article_5c67c92b-1f61-4059-a187-e9eadd0017b5.html",
    "timestamp": "2025-09-04T21:30:00Z"
  },
  {
    "title": "'Alligator Alcatraz' immigration centre can stay open, appeals court rules",
    "description": "Florida Governor Ron DeSantis welcomes the ruling and declares the Everglades site \"open for business\".",
    "link": "https://www.bbc.com/news/articles/crl5ry3rgzro?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-04T21:29:59Z"
  },
  {
    "title": "Blaming AI a popular strategy for politicians seeking to dodge responsibility for something embarrassing",
    "description": "Artificial intelligence, apparently, is the new “fake news.&quot; Blaming AI is an increasingly popular strategy for politicians seeking to dodge responsibility for something embarrassing — among others. AI isn't a person, after all. It can't leak or file sui…",
    "link": "https://japantoday.com/category/features/opinions/the-president-blamed-ai-and-embraced-doing-so.-is-it-becoming-the-new-%27fake-news%27",
    "timestamp": "2025-09-04T21:29:49Z"
  },
  {
    "title": "Donald Trump Seals a Tariff Deal with Japan",
    "description": "The order says Japan has agreed to invest $550 billion in the United States in projects that will be selected by the U.S. government.",
    "link": "https://www.newsweek.com/donald-trump-japan-tariffs-update-cars-2124830",
    "timestamp": "2025-09-04T21:29:37Z"
  },
  {
    "title": "Tech companies pledge to ready Americans for an AI-dominated world",
    "description": "Amazon, Google, and Microsoft are among the companies committing to help prepare Americans for a world dominated by AI technology at a White House event on AI education Thursday. First Lady Melania Trump hosted a meeting of the White House’s AI education task…",
    "link": "https://www.theverge.com/policy/772084/amazon-google-microsoft-white-house-ai-education",
    "timestamp": "2025-09-04T21:28:57Z"
  },
  {
    "title": "Trump signs order to lower tariffs on Japanese auto imports",
    "description": "Investing.com -- U.S. President Donald Trump signed an order on Thursday to implement lower tariffs on Japanese automobile imports and other products that...",
    "link": "https://finance.yahoo.com/news/trump-signs-order-lower-tariffs-212619264.html",
    "timestamp": "2025-09-04T21:26:19Z"
  },
  {
    "title": "Deal or No Deal? Has Trump Driven Stake Through Heart of ‘Green New Scam’?",
    "description": "Is the Green New Deal dead or not? On the campaign trail, President Donald Trump repeatedly vowed to repeal what he called the “green new... Read More\nThe post Deal or No Deal? Has Trump Driven Stake Through Heart of ‘Green New Scam’? appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/09/04/is-bidens-green-new-deal-dead-not/",
    "timestamp": "2025-09-04T21:25:07Z"
  },
  {
    "title": "Kennedy tries to defend his vaccine beliefs during Senate hearing",
    "description": "U.S. Health Secretary Robert F. Kennedy Jr. disputed reports of people saying they have had difficulty getting COVID-19 shots.",
    "link": "https://www.pennlive.com/health/2025/09/kennedy-tries-to-defend-his-vaccine-beliefs-during-senate-hearing.html",
    "timestamp": "2025-09-04T21:20:53Z"
  },
  {
    "title": "Appeals court allows Alligator Alcatraz to continue operations",
    "description": "A federal appeals court is allowing the state of Florida to continue operating the controversial immigrant detention center known as \"Alligator Alcatraz.\"",
    "link": "https://abcnews.go.com/US/appeals-court-allows-alligator-alcatraz-continue-immigrant-detention/story?id=125271773",
    "timestamp": "2025-09-04T21:20:46Z"
  },
  {
    "title": "Gavin Newsom Attempts To Burn Trump Over LA Wildfires — It Immediately Blows Up In His Face",
    "description": "Newsom's press office blasted Trump for critiquing the state's wildfire preparedness while omitting that a reservoir in the Palisades area reportedly sat empty.",
    "link": "https://dailycaller.com/2025/09/04/gavin-newsom-attempts-burn-trump-la-wildfires-blows-up-face/",
    "timestamp": "2025-09-04T21:19:18Z"
  },
  {
    "title": "Trump administration to end European security programs focused on Russia",
    "description": "The decision, affecting hundreds of millions of dollars in U.S. military aid, has alarmed NATO allies and upset U.S. lawmakers who strongly back the alliance.The Trump administration intends to halt longtime security assistance programs for Europe, including …",
    "link": "https://freerepublic.com/focus/f-news/4338663/posts",
    "timestamp": "2025-09-04T21:18:42Z"
  },
  {
    "title": "The overwhelming evidence that the Supreme Court is on Donald Trump’s team",
    "description": "Last month, Justice Ketanji Brown Jackson dropped an inflammatory allegation on most of her colleagues.  On August 21, the Supreme Court handed down a baffling order that required researchers, who claim that the Trump administration illegally cut off their fe…",
    "link": "https://www.vox.com/scotus/460270/supreme-court-republican-partisan-hacks-donald-trump",
    "timestamp": "2025-09-04T21:17:44Z"
  },
  {
    "title": "Trump’s Fed Nominee Plays the Sycophant",
    "description": "Watching Stephen Miran testify Thursday before the Senate Banking Committee on his nomination to be a governor of the Federal Reserve, I found myself wondering whether this Harvard PhD economist was using the word fulsome to telegraph to Donald Trump that, if…",
    "link": "https://newrepublic.com/article/200028/stephen-miran-trump-fed-nominee-sycophant",
    "timestamp": "2025-09-04T21:17:07Z"
  },
  {
    "title": "Texas National Guard not coming to Chicago, Abbott says",
    "description": "Texas Gov. Greg Abbott is denying reports National Guard members from his state will be traveling to Chicago, contradicting Illinois Gov. J.B. Pritzker.",
    "link": "https://www.nbcchicago.com/news/local/texas-national-guard-not-being-deployed-to-chicago-abbott-says/3819689/",
    "timestamp": "2025-09-04T21:15:47Z"
  },
  {
    "title": "Uncle Sam Is Investing Now. What Could Possibly Go Wrong?",
    "description": "When President Donald Trump announced in August that the federal government took an equity stake in Intel, he bragged that taxpayers had \"paid zero\" for part of a company now \"worth $11 billion.\" In reality, taxpayers paid plenty: $8.9 billion in subsidies wi…",
    "link": "https://biztoc.com/x/8a4ad90ca50c168e",
    "timestamp": "2025-09-04T21:15:35Z"
  },
  {
    "title": "What's next for Trump's tariffs?",
    "description": "President Donald Trump holds up a chart while speaking during a \"Make America Wealthy Again\" trade announcement event in the Rose Garden at the White House on April 2.",
    "link": "https://biztoc.com/x/6b3647601eb35e0d",
    "timestamp": "2025-09-04T21:15:22Z"
  },
  {
    "title": "Curator Targeted by Trump Tapped to Lead Milwaukee Art Museum",
    "description": "Kim Sajet, who resigned from her post as director of the National Portrait Gallery after Trump criticized her support for DEI, will begin her new role later this month.",
    "link": "http://hyperallergic.com/1039482/curator-kim-sajet-targeted-by-trump-tapped-to-lead-milwaukee-art-museum/",
    "timestamp": "2025-09-04T21:13:56Z"
  },
  {
    "title": "Trump Does The Unthinkable: Causes MSNBC Guest To Take Side Of Drug-Trafficking Terrorists",
    "description": "'It’s alarming'",
    "link": "https://dailycaller.com/2025/09/04/trump-causes-msnbc-guest-take-side-drug-trafficking-terrorists/",
    "timestamp": "2025-09-04T21:13:23Z"
  },
  {
    "title": "‘Net approval rating’: CNN’s poll guy reveals ‘most popular’ Trump administration official",
    "description": "Gets better numbers than Vice President JD Vance, Defense Secretary Pete Hegseth and Secretary of State Marco Rubio",
    "link": "https://www.wnd.com/2025/09/net-approval-rating-cnns-poll-guy-reveals-most/",
    "timestamp": "2025-09-04T21:12:17Z"
  },
  {
    "title": "Trump's deadly strike on a boat from Venezuela was an act of war",
    "description": "President Donald Trump said the U.S. military blew up a vessel in the Caribbean, killing 11 people. The administration said the boat had departed from Venezuela.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-boat-strike-caribbean-venezuela-drug-war-rcna229113",
    "timestamp": "2025-09-04T21:11:39Z"
  },
  {
    "title": "No method",
    "description": "Commenter Brandunaware on some important secondary effects of living among the Trumpers: Endless psychopathic surrealism. In addition to them being the absolute worst people on earth there’s a second order effect where it’s impossible to respect anyone who tr…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/no-method",
    "timestamp": "2025-09-04T21:10:20Z"
  },
  {
    "title": "CBS News insiders brace for Bari Weiss as Paramount CEO pushes deal worth up to $200M",
    "description": "CBS News faces potential editorial changes as reports indicate Bari Weiss will join the third-place network to help restore its reputation and ratings.",
    "link": "https://www.foxnews.com/media/cbs-news-insiders-brace-bari-weiss-paramount-ceo-pushes-deal-worth-up-200m",
    "timestamp": "2025-09-04T21:10:18Z"
  },
  {
    "title": "The Bob Cesca Podcast: Dopey and Sleepy",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Dopey and Sleepy -- RFK Jr.'s testimony in the Senate Finance Committee is a total sh*t show. RFK didn't mention who was president in 2020. RFK didn't know how many Americans died of COVID. We…",
    "link": "https://littlegreenfootballs.com/article/54893_The_Bob_Cesca_Podcast-_Dopey_a",
    "timestamp": "2025-09-04T21:09:15Z"
  },
  {
    "title": "Top CNN Parent Company Shareholder Tells CNN’s Kara Swisher Flat Out That Left-Leaning Bias is ‘Embedded’ at CNN",
    "description": "“Look, the trouble with bias is it's almost invisible. And the person who, look, these are good people. These are people who believe they're not biased\"\nThe post Top CNN Parent Company Shareholder Tells CNN’s Kara Swisher Flat Out That Left-Leaning Bias is ‘E…",
    "link": "https://www.mediaite.com/media/news/top-cnn-parent-company-shareholder-tells-cnns-kara-swisher-flat-out-that-left-leaning-bias-is-embedded-at-cnn/",
    "timestamp": "2025-09-04T21:08:41Z"
  },
  {
    "title": "Offshore wind could have saved New England ratepayers millions last winter",
    "description": "A recent report found that projects off Massachusetts and Rhode Island could have driven down wholesale electricity costs throughout the region if they had not been delayed.",
    "link": "https://www.pressherald.com/2025/09/04/offshore-wind-could-have-saved-new-england-ratepayers-millions-last-winter/",
    "timestamp": "2025-09-04T21:08:37Z"
  },
  {
    "title": "The White House's LinkedIn Pic Is Now Donald Trump's Face. Former Staffers Are 'Frustrated'",
    "description": "When asked to comment on the switch, the White House pointed to an X post that said: \"Trolololololol.\"",
    "link": "https://www.cnet.com/tech/services-and-software/the-white-houses-linkedin-pic-is-now-donald-trumps-face-former-staffers-are-frustrated/",
    "timestamp": "2025-09-04T21:08:00Z"
  },
  {
    "title": "Northwestern University president to resign amid tensions with Donald Trump",
    "description": "US universities have faced pressure from the Trump administration to crack down on pro-Palestine activism.",
    "link": "https://www.aljazeera.com/news/2025/9/4/northwestern-university-president-to-resign-amid-tensions-with-donald-trump",
    "timestamp": "2025-09-04T21:06:48Z"
  },
  {
    "title": "Trading Day: Rallying into payrolls",
    "description": "U.S. equity and bond prices rose on Thursday as soft U.S. jobs data boosted hopes for an interest rate cut from the Fed later this month.  In my column today...",
    "link": "https://finance.yahoo.com/news/trading-day-rallying-payrolls-210549470.html",
    "timestamp": "2025-09-04T21:05:49Z"
  },
  {
    "title": "Trump asks SCOTUS to let him fire FTC commissioner",
    "description": "United States President Donald Trump asked the US Supreme Court to allow him to fire Federal Trade Commission (FTC) commissioner Rebecca Slaughter after US District Judge Loren AliKhan ruled that the ...",
    "link": "https://biztoc.com/x/d66415774f9dd999",
    "timestamp": "2025-09-04T21:04:18Z"
  },
  {
    "title": "GOP Sen. Bill Cassidy pits RFK Jr. against Trump on vaccines",
    "description": "Sen. Bill Cassidy, R-La., grilled Health and Human Services Secretary Robert F. Kennedy on his skepticism of vaccines Thursday, arguing that his actions fly in the face of one of President Donald Trump's biggest achievements.",
    "link": "https://biztoc.com/x/23d130a1e7e1f38e",
    "timestamp": "2025-09-04T21:04:17Z"
  },
  {
    "title": "Supreme Court Receives New Emergency Request from Donald Trump",
    "description": "Trump's Justice Department contends that the FTC and other executive agencies fall under presidential control.",
    "link": "https://biztoc.com/x/5b6769e2c67e1f89",
    "timestamp": "2025-09-04T21:04:08Z"
  },
  {
    "title": "US employers likely added a modest 80,000 jobs last month, a sign that the labor market has cooled",
    "description": "U.S. employers added just 22,000 jobs last month as the labor market continued to cool under uncertainty over President Donald Trump’s economic policies.",
    "link": "https://www.news4jax.com/business/2025/09/04/us-employers-likely-added-a-modest-80000-jobs-last-month-a-sign-that-the-labor-market-has-cooled/",
    "timestamp": "2025-09-04T21:04:07Z"
  },
  {
    "title": "Takeaways from RFK Jr.’s contentious hearing before Senate lawmakers",
    "description": "Both Democrats and Republicans came out swinging.",
    "link": "https://www.bostonherald.com/2025/09/04/takeaways-rfk-jr-hearing/",
    "timestamp": "2025-09-04T21:02:54Z"
  },
  {
    "title": "Supreme Court Receives New Emergency Request from Donald Trump",
    "description": "Trump's Justice Department contends that the FTC and other executive agencies fall under presidential control.",
    "link": "https://www.newsweek.com/donald-trump-supreme-court-ftc-commissioners-firing-request-2124818",
    "timestamp": "2025-09-04T21:02:06Z"
  },
  {
    "title": "Trump and Albanese have a little chat",
    "description": "The media has gone wild this morning with news of a phone call between Donald Trump and Anthony Albanese, and former Victorian premier Daniel Andrews is standing by his China trip (and that photograph).\nThe post Trump and Albanese have a little chat appeared …",
    "link": "http://www.crikey.com.au/2025/09/05/donald-trump-anthony-albanese-phone-call-daniel-andrews-china/",
    "timestamp": "2025-09-04T21:01:01Z"
  },
  {
    "title": "What's next for Trump's tariffs?",
    "description": "President Donald Trump wants the Supreme Court to rule quickly on whether most of his tariffs are legal.",
    "link": "https://www.nbcnews.com/business/economy/trumps-tariffs-court-appeal-can-tariffs-come-back-what-to-know-rcna229111",
    "timestamp": "2025-09-04T21:00:00Z"
  },
  {
    "title": "China, Russia Present Master Plan For New World Order At SCO Summit",
    "description": "China and Russia presented their masterplan for a new global order at the Shanghai Cooperation Organisation (SCO) summit currently underway in China’s port city of Tianjin, highlighting China's growing ties with Central Asia. China’s President Xi Jinping call…",
    "link": "https://oilprice.com/Energy/Energy-General/China-Russia-Present-Master-Plan-For-New-World-Order-At-SCO-Summit.html",
    "timestamp": "2025-09-04T21:00:00Z"
  },
  {
    "title": "Gavin Newsom won’t stop clowning Kid Rock in the style of Trump",
    "description": "California Governor Gavin Newsom has added Kid Rock to his list of MAGA folks to troll over the past month, and people can't get enough of it.\n\n\nNewsom has taken to social media in recent months to emulate President Donald Trump, presumably to mock the presid…",
    "link": "https://www.dailydot.com/viral-politics/gavin-newsom-trolls-kid-rock/",
    "timestamp": "2025-09-04T21:00:00Z"
  },
  {
    "title": "Trump administration asks Supreme Court to let him fire member of Federal Trade Commission",
    "description": "Trump moved to fire Rebecca Slaughter in the spring, but lower courts ordered her reinstated.",
    "link": "https://www.bostonherald.com/2025/09/04/trump-ftc-supreme-court/",
    "timestamp": "2025-09-04T20:59:26Z"
  },
  {
    "title": "US senators pit Kennedy against Trump on vaccine policy",
    "description": "Summary Republican Senator Cassidy contrasts Kennedy's anti-vaccine stance with Trump's 2020 COVID vaccine initiative Kennedy defends firing CDC Director Monarez, vaccine policy changes Democrats, medical groups call for health secretary's resignation WASHING…",
    "link": "https://freerepublic.com/focus/f-chat/4338658/posts",
    "timestamp": "2025-09-04T20:59:16Z"
  },
  {
    "title": "A Republican Senator Criticized RFK Jr.—but He Had to Go Full “Dear Leader” to Do It",
    "description": "Bill Cassidy is so mad at RFK Jr. that he’s demanding that the man who appointed him win a Nobel Prize.",
    "link": "https://slate.com/news-and-politics/2025/09/rfk-robert-kennedy-senate-hearing-bill-cassidy.html",
    "timestamp": "2025-09-04T20:58:59Z"
  },
  {
    "title": "China shows missiles, Trump shows muscle: Xi's strategy can't match US",
    "description": "The China-Russia military alliance is the single biggest danger the U.S. military has ever faced. However, Xi’s plan for world domination is showing some fault lines.",
    "link": "https://www.foxnews.com/opinion/china-shows-missiles-trump-shows-muscle-xis-strategy-cant-match-us",
    "timestamp": "2025-09-04T20:58:56Z"
  },
  {
    "title": "Sydney Sweeney ad boosts American Eagle’s sales, stock surges",
    "description": "American Eagle wanted Sydney Sweeney to be a brand reset. Its sales are up.",
    "link": "https://syndication.washingtonpost.com/nss/stories/25PEEUYLV5GVPI22FBG2CUOZNY",
    "timestamp": "2025-09-04T20:58:39Z"
  },
  {
    "title": "'He's Supposed To Protect Us': Epstein Survivor Who Voted For Trump Feels Betrayed",
    "description": "Jena-Lisa Jones, a survivor of Jeffrey Epstein's abuse who was introduced to Epstein when she was just 14 years old, spoke with MSNBC's Lawrence O'Donnell on Wednesday night to discuss her decision to join other Epstein survivors on Capitol Hill, where, as it…",
    "link": "https://crooksandliars.com/2025/09/hes-supposed-protect-us-epstein-victim-who",
    "timestamp": "2025-09-04T20:57:50Z"
  },
  {
    "title": "Trump administration asks Supreme Court to let him fire member of Federal Trade Commission",
    "description": "WASHINGTON (AP) — The Trump administration on Thursday asked the Supreme Court to let the president fire a member of the Federal Trade Commission, the latest in a string of emergency appeals over the president’s removal power. President Donald Trump moved to …",
    "link": "https://financialpost.com/pmn/trump-administration-asks-supreme-court-to-let-him-fire-member-of-federal-trade-commission",
    "timestamp": "2025-09-04T20:57:12Z"
  },
  {
    "title": "South Park Season 27 Uses Donald Trump (And Satan) To Tease A Classic Horror Concept",
    "description": "The latest development in South Park season 27's Donald Trump and Satan storyline plays upon a horror movie trope that could factor into the episodes to come.",
    "link": "https://www.slashfilm.com/1959246/south-park-season-27-donald-trump-satan-horror-concept-pregnancy/",
    "timestamp": "2025-09-04T20:55:57Z"
  },
  {
    "title": "JUST IN: Bombshell Report Links Trump Cabinet Members to Same Alleged ‘Fraud’ Over Which Trump Tried to Oust Fed Gov.",
    "description": "Three members of Donald Trump's cabinet are reportedly guilty of the same mortgage financing tactic that they attacked the Federal Reserve governor over.\nThe post JUST IN: Bombshell Report Links Trump Cabinet Members to Same Alleged ‘Fraud’ Over Which Trump T…",
    "link": "https://www.mediaite.com/politics/just-in-bombshell-report-links-trump-cabinet-members-to-same-alleged-fraud-over-which-trump-tried-to-oust-fed-gov/",
    "timestamp": "2025-09-04T20:55:50Z"
  },
  {
    "title": "President Trump signs executive order cementing trade agreement with Japan",
    "description": "On Thursday, President Donald Trump signed an executive order enacting his trade agreement with Japan, setting a maximum 15% tariff…\nThe post President Trump signs executive order cementing trade agreement with Japan appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/09/04/president-trump-signs-executive-order-cementing-trade-agreement-with-japan/",
    "timestamp": "2025-09-04T20:55:06Z"
  },
  {
    "title": "“How can you be so ignorant?”: RFK Jr. called “charlatan” during bipartisan Senate grilling",
    "description": "The health secretary drew intense criticism from both Republican and Democratic senators on Thursday.",
    "link": "https://www.salon.com/2025/09/04/how-can-you-be-so-ignorant-rfk-jr-called-charlatan-during-bipartisan-senate-grilling/",
    "timestamp": "2025-09-04T20:54:52Z"
  },
  {
    "title": "Winning: Poll Shows Trump Enjoying 'Highest Approval' Ratings Yet",
    "description": "A poll shows voters giving President Donald Trump an excellent approval rating as his second term in office continues.\nThe post Winning: Poll Shows Trump Enjoying ‘Highest Approval’ Ratings Yet appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/04/winning-poll-shows-trump-enjoying-highest-approval-ratings-yet/",
    "timestamp": "2025-09-04T20:54:22Z"
  },
  {
    "title": "ICE contract could bring controversial surveillance tech to American streets",
    "description": "The U.S. Immigration and Customs Enforcement officials who are carrying out Donald Trump’s bigoted anti-immigrant crackdown may soon have access to previously banned spy tools that targeted foreign journalists and political dissidents.",
    "link": "https://www.msnbc.com/top-stories/latest/immigration-customs-paragon-solutions-contract-rcna229112",
    "timestamp": "2025-09-04T20:52:12Z"
  },
  {
    "title": "Vladimir Putin Offers Zelensky Meeting in Moscow After Showering Ukraine with Drones and Missiles",
    "description": "Russian President Vladimir Putin said on Wednesday he was still interested in peace negotiations with Ukrainian President Volodymyr Zelensky, and invited to hold such a meeting in Moscow. Zelensky is unlikely to accept the invitation, both out of concern for …",
    "link": "https://www.breitbart.com/national-security/2025/09/04/vladimir-putin-offers-zelensky-meeting-in-moscow-after-showering-ukraine-with-drones-and-missiles/",
    "timestamp": "2025-09-04T20:52:09Z"
  },
  {
    "title": "Report: Trump Admin Considering Banning Transgenders from Owning Guns",
    "description": "On Tuesday, Democratic Minnesota Gov. Tim Walz blamed the guns on the shooting in his state while speaking to CBS News.",
    "link": "https://www.westernjournal.com/report-trump-admin-considering-banning-transgenders-owning-guns/",
    "timestamp": "2025-09-04T20:51:51Z"
  },
  {
    "title": "Carney's cabinet retreat brings 'tough' budget decisions, tariff relief, and calls for a 'diet' government",
    "description": "\"Tough\" budget decisions, public service adjustments, incoming aid for sectors hardest hit by U.S. tariffs and the latest on ongoing trade negotiations with President Donald Trump were on the menu for the federal Liberal cabinet meeting this week.",
    "link": "https://nationalpost.com/news/politics/carneys-cabinet-retreat-brings-tough-budget-decisions-tariff-relief-and-calls-for-a-diet-government",
    "timestamp": "2025-09-04T20:51:39Z"
  }
]