[
  {
    "title": "Trump tariffs face major legal hurdle as federal trade court hears challenge",
    "description": "Trump has long praised tariffs as a key tool for negotiating with other countries and collecting federal revenue.",
    "link": "https://www.cnbc.com/2025/05/13/trump-tariffs-trade-court-lawsuit.html",
    "timestamp": "2025-05-13T13:02:32Z"
  },
  {
    "title": "Putin Skipping Talks Would Signal Moscow Not Seeking Peace: Kyiv",
    "description": "Ukraine said Tuesday that if Vladimir Putin skips talks in Turkey it would be a \"clear sign\" to the world the Russian leader is not serious about peace, and the West should reply with boosted military support to Kyiv.",
    "link": "https://www.ibtimes.com.au/putin-skipping-talks-would-signal-moscow-not-seeking-peace-kyiv-1858792",
    "timestamp": "2025-05-13T13:02:31Z"
  },
  {
    "title": "Canada's ambassador says economic talks must prioritize the lifting of Trump's tariffs",
    "description": "Ottawa's top diplomat in Washington says talks to negotiate any new deals with the United States will prioritize ending US President Donald Trump's ruinous tariffs on Canadian exports.",
    "link": "https://www.nationalobserver.com/2025/05/13/news/canadas-ambassador-says-economic-talks-must-prioritize-lifting-trumps-tariffs",
    "timestamp": "2025-05-13T13:02:20Z"
  },
  {
    "title": "China's Xi touts stability to Latin America amid Trump's global tariffs",
    "description": "There are no winners in a trade war, Chinese President Xi Jinping told Latin American leaders and other officials in Beijing on Tuesday, as he sought to project unity with the region a day after the United States and China agreed to slash reciprocal tariffs.",
    "link": "https://www.nbcnews.com/world/asia/chinas-xi-touts-stability-latin-america-trumps-global-tariffs-rcna206427",
    "timestamp": "2025-05-13T13:02:17Z"
  },
  {
    "title": "Taliban Prepares to Send Top Diplomat to Beijing",
    "description": "The Chinese Communist Party invited Taliban \"foreign minister\" Amir Khan Muttaqi to Beijing this weekend following assurances that Beijing will offer continuing support for the jihadist rulers at a meeting in Kabul, Afghanistan.\nThe post Taliban Prepares to S…",
    "link": "https://www.breitbart.com/asia/2025/05/13/taliban-prepares-to-send-top-diplomat-to-beijing/",
    "timestamp": "2025-05-13T13:01:47Z"
  },
  {
    "title": "‘I hate that I voted for him’: How Pennsylvania Democrats feel about Fetterman",
    "description": "'I think he's going to face a primary challenge. I just don't know who it's gonna be'",
    "link": "https://www.wnd.com/2025/05/i-hate-that-i-voted-for-him-how-pennsylvania-democrats-feel-about-fetterman/",
    "timestamp": "2025-05-13T13:01:36Z"
  },
  {
    "title": "How the United States Gave Up Being a Science Superpower",
    "description": "This article previously appeared in Nature. US global dominance in science was no accident, but a product of a far-seeing partnership between public and private sectors to boost innovation and economic growth. Since 20 January, US science has been upended by …",
    "link": "https://steveblank.com/2025/05/13/how-the-united-states-became-a-science-superpower-and-how-quickly-it-could-crumble/",
    "timestamp": "2025-05-13T13:00:50Z"
  },
  {
    "title": "Hinge Health aims to raise up to $437 million in IPO, pricing at $28.00 to $32.00 per share",
    "description": "Hinge Health said in a filing on Tuesday that it plans to raise more than $437 million in its upcoming initial public offering.",
    "link": "https://www.cnbc.com/2025/05/13/hinge-health-ipo-share-pricing.html",
    "timestamp": "2025-05-13T13:00:46Z"
  },
  {
    "title": "Republican group lays out plan to gain ground in 2 key Dem-leaning states in 2025 elections",
    "description": "The Republican State Leadership Committee is on the offense for November's elections in two key blue states it sees as ripe for the GOP to gain ground in.",
    "link": "https://www.foxnews.com/politics/republican-group-lays-out-plan-gain-ground-two-key-dem-leaning-states-2025-elections",
    "timestamp": "2025-05-13T13:00:46Z"
  },
  {
    "title": "Trump Budget Proposal Could Devastate New York’s Housing Landscape",
    "description": "by Greg David\nThis article was originally published on May 7 at 5 a.m. EDT by THE CITY\nPresident Donald Trump’s proposed budget released last week would shred New York’s housing safety net by cutting billions of dollars in federal aid, putting limits on vouch…",
    "link": "http://www.brownstoner.com/real-estate-market/nyc-housing-nycha-trump-budget/",
    "timestamp": "2025-05-13T13:00:18Z"
  },
  {
    "title": "With Film Tariff Threat, Trump Takes Hollywood for a Ride on the ‘Tweet Now, Think Later’ Train",
    "description": "The frenzy caused by the president’s social media posts gave studios a crash course in his carousel of news-cycle craziness\nThe post With Film Tariff Threat, Trump Takes Hollywood for a Ride on the ‘Tweet Now, Think Later’ Train appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-tariff-threat-pattern-analysis/",
    "timestamp": "2025-05-13T13:00:00Z"
  },
  {
    "title": "What’s at Stake as Trump’s Assault on Birthright Citizenship Heads to the Supreme Court",
    "description": "It’s been a law of the land since 1868. We break down Trump’s executive order, the significance of the Supreme Court stepping in, and why it matters",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-birthright-citizenship-supreme-court-injunctions-1235337779/",
    "timestamp": "2025-05-13T13:00:00Z"
  },
  {
    "title": "BC's low snowpack, melt signal drought, raises concerns for hydro power",
    "description": "Drier, warmer weather in much of British Columbia last month has contributed to an early melt, raising concern for widespread drought this summer, the province's latest snowpack and water supply bulletin says.",
    "link": "https://www.nationalobserver.com/2025/05/13/news/bcs-low-snowpack-melt-signal-drought-raises-concerns-hydro-power",
    "timestamp": "2025-05-13T12:59:34Z"
  },
  {
    "title": "Switch 2 Conservative Sales Forecast Not Affected by US Tariffs, but High Price a Factor, Says Nintendo",
    "description": "Nintendo said during its latest quarterly earnings call last week that it expects to sell 15 million units of the Switch 2 when it launches next month. The company, however, has said its lower-than-expected sales volume forecast reflects the Nintendo Switch 2…",
    "link": "https://www.gadgets360.com/games/news/nintendo-switch-2-sales-forecast-15-million-impact-high-price-us-tariffs-8404407",
    "timestamp": "2025-05-13T12:59:09Z"
  },
  {
    "title": "Still At The Table: Updates On The OECD Global Tax Project",
    "description": "In this episode of Tax Notes Talk, Tax Notes chief correspondent Stephanie Soong discusses how the Trump administration’s tax priorities have been shaping negotiations on the OECD’s two-pillar project.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/05/13/still-at-the-table-updates-on-the-oecd-global-tax-project/",
    "timestamp": "2025-05-13T12:58:23Z"
  },
  {
    "title": "Lynch: Donald Trump takes the PGA Tour’s terms to Saudi Arabia. What will he return with?",
    "description": "For the first time in his life, just a few weeks shy of his 79th birthday, Donald Trump is going to the front line.",
    "link": "https://golfweek.usatoday.com/story/sports/golf/pga/2025/05/13/eamon-lynch-donald-trump-takes-pga-tour-terms-saudi-arabia/83595796007/",
    "timestamp": "2025-05-13T12:57:41Z"
  },
  {
    "title": "Inflation cooled again last month as grocery and gas prices fell, few signs of tariff impact yet",
    "description": "Inflation cooled for the third straight month in April even after some of Trump's tariffs took effect, though economists and many businesses expect inflation will climb in the coming months.",
    "link": "https://roanoke.com/news/nation-world/business/economy/article_111d0e33-1892-5f94-a0d0-54cf3644148f.html",
    "timestamp": "2025-05-13T12:57:00Z"
  },
  {
    "title": "Inflation cooled again last month as grocery and gas prices fell, few signs of tariff impact yet",
    "description": "Inflation cooled for the third straight month in April even after some of Trump's tariffs took effect, though economists and many businesses expect inflation will climb in the coming months.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_35ed4363-0268-59ac-b3d6-87e5bf820811.html",
    "timestamp": "2025-05-13T12:57:00Z"
  },
  {
    "title": "California to Investigate Insurance Companies for Shortfalls in Fire Policies",
    "description": "Officials in California are launching a variety of hearings and investigations regarding the insurance crisis among victims of the Palisades and Eaton Fires, including the fact that many homeowners were underinsured for the cost of rebuilding their homes in c…",
    "link": "https://www.breitbart.com/economy/2025/05/13/california-to-investigate-insurance-companies-for-shortfalls-in-fire-policies/",
    "timestamp": "2025-05-13T12:55:39Z"
  },
  {
    "title": "Only Donald Trump Could Piss Off Episcopalians Like This",
    "description": "The man is a genius.",
    "link": "https://www.wonkette.com/p/only-donald-trump-could-piss-off",
    "timestamp": "2025-05-13T12:55:25Z"
  },
  {
    "title": "American Exceptionalism Meets Its Maker",
    "description": "A transactional president has revealed the US to be a transactional society, where the highest returns accrue to rent seeking and cronyism, not to initiative and innovation. Sooner or later, productivity growth will become a casualty.",
    "link": "https://www.project-syndicate.org/commentary/trump-damaging-pillars-of-american-economic-dominance-by-barry-eichengreen-2025-05",
    "timestamp": "2025-05-13T12:54:09Z"
  },
  {
    "title": "Trump launches Middle East tour by meeting with Saudi crown prince",
    "description": "U.S. President Donald Trump opened his four-day Middle East trip on Tuesday by paying a visit to Saudi Arabia’s de facto ruler, Crown Prince Mohammed bin Salman, for talks on U.S. efforts to dismantle Iran’s nuclear program, end the war in Gaza, hold down oil…",
    "link": "https://biztoc.com/x/ab5c37e5a441f68b",
    "timestamp": "2025-05-13T12:53:07Z"
  },
  {
    "title": "As Trump struggles to defend Qatar’s luxury jet ‘gift,’ Republicans are divided",
    "description": "Donald Trump wasn't looking to divide the GOP again, but his plan to accept a superluxury jumbo jet from his friends in Qatar has split Republicans.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-struggles-defend-qatars-luxury-jet-gift-republicans-are-divided-rcna206447",
    "timestamp": "2025-05-13T12:50:49Z"
  },
  {
    "title": "Jon Stewart Calls Trump 'Reverse Oprah' Over Qatar Jet",
    "description": "Jon Stewart doesn't hold back as he calls out Trump for accepting a luxury jet from Qatar, which after all, is known to fund terrorism. Via Deadline:\nOn Monday’s episode of the Comedy Central show, the comedian called President Donald Trump a “reverse Oprah” …",
    "link": "https://crooksandliars.com/2025/05/jon-stewart-calls-trump-reverse-oprah-over",
    "timestamp": "2025-05-13T12:50:42Z"
  },
  {
    "title": "'We can't give up': Black doctor's lifetime work screeches to halt due to Trump policy",
    "description": "The work of several Black doctors who established multiple scholarships for Black medical students at the University of Cincinnati has come to a halt because of President Donald Trump’s policies, according to a Washington Post report\r\n.Clyde Henderson is a re…",
    "link": "https://www.rawstory.com/scholarships-for-black-students/",
    "timestamp": "2025-05-13T12:48:53Z"
  },
  {
    "title": "Trump envoys Witkoff, Boehler meet Israeli hostage families in Tel Aviv ahead of Doha talks",
    "description": "Earlier, Witkoff visited freed hostage Edan Alexander in Tel Aviv, and both spoke to U.S. President Donald Trump. The envoys said he's committed to releasing all hostages, but a Gaza deal or escalation is up to Israel",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-13/ty-article/.premium/trump-envoys-witkoff-boehler-meet-hostage-families-in-tel-aviv-ahead-of-doha-talks/00000196-c8f8-d1bb-a5d6-cefccecc0000",
    "timestamp": "2025-05-13T12:48:48Z"
  },
  {
    "title": "BREAKING: Biden Undergoes Prostate Evaluation After ‘Small Nodule’ Discovered",
    "description": "Former President Joe Biden spent last Friday in a Philadelphia hospital after doctors discovered a “small nodule” on his prostate that required “further evaluation,” his spokesman confirmed. No additional details were provided, according to the New York Times…",
    "link": "https://www.mediaite.com/news/breaking-biden-undergoes-prostate-evaluation-after-small-nodule-discovered/",
    "timestamp": "2025-05-13T12:46:59Z"
  },
  {
    "title": "Zambia warns envoys after US ambassador reveals 'systematic' theft of medical aid",
    "description": "The foreign minister says raising concerns publicly amounts to interference in domestic affairs.",
    "link": "https://www.bbc.co.uk/news/articles/ckg4zjrwdrlo",
    "timestamp": "2025-05-13T12:46:48Z"
  },
  {
    "title": "WATCH: Jesse Watters CONFRONTS ‘Panican’ Sen. Rand Paul on Trump Tariffs: ‘You Were Against the Tariffs… Now What Do You Have to Say?’",
    "description": "Fox News host Jesse Watters confronted Senator Rand Paul (R-KY) over his opposition to President Trump’s game-changing second-term tariff policies—policies that are already delivering results and shaking up the global trade order.\nThe post WATCH: Jesse Watter…",
    "link": "https://www.thegatewaypundit.com/2025/05/watch-jesse-watters-confronts-panican-sen-rand-paul/",
    "timestamp": "2025-05-13T12:45:40Z"
  },
  {
    "title": "US consumer prices rise moderately in April",
    "description": "U.S. consumer prices experienced a moderate rebound in April, with the CPI increasing by 0.2%. Inflation is anticipated to rise in the coming months due to tariffs on imported goods. However, a recent truce between the U.S. and China, involving reduced duties…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-consumer-prices-rise-moderately-in-april/articleshow/121140875.cms",
    "timestamp": "2025-05-13T12:44:49Z"
  },
  {
    "title": "Businesses Sue Trump to Halt ‘Liberation Day’ Tariffs",
    "description": "A group of American small businesses is suing President Donald Trump over his tariffs. These five businesses contend the president overstepped his authority in declaring a national emergency to impose the levies last month, Reuters reported, ahead of a Tuesda…",
    "link": "https://www.pymnts.com/legal/2025/businesses-sue-trump-to-halt-liberation-day-tariffs/",
    "timestamp": "2025-05-13T12:40:10Z"
  },
  {
    "title": "White South Africans arrive in US after Trump granted them refugee status",
    "description": "Dozens of white South Africans have arrived in the US after the Trump administration granted them refugee status in the country, having deemed them victims of racial discrimination.",
    "link": "https://news.sky.com/story/white-south-africans-arrive-in-us-after-trump-administration-granted-them-refugee-status-13367062",
    "timestamp": "2025-05-13T12:40:00Z"
  },
  {
    "title": "Rep. Mark Green Launches Probe into Kilmar Abrego Garcia's Alleged Involvement in Human Smuggling Ring",
    "description": "House Homeland Security Committee Mark Green (R-TN) is launching an investigation into Kilmar Abrego Garcia's alleged involvement in a human smuggling ring. Abrego Garcia was deported by President Donald Trump's administration to El Salvador after he was accu…",
    "link": "https://www.breitbart.com/politics/2025/05/13/chairman-green-kilmar-abrego-garcia/",
    "timestamp": "2025-05-13T12:39:37Z"
  },
  {
    "title": "Watch: Rosie O’Donnell Rants About Trump, 'Rigged' Elections, Taking Drugs to Sleep",
    "description": "In yet another rant from Ireland, Rosie O’Donnell took to her TikTok account to accuse President Donald Trump of cheating during the election, said she hopes that the names of ICE agents are revealed, and said she has to take drugs to get to sleep.\nThe post W…",
    "link": "https://www.breitbart.com/entertainment/2025/05/13/watch-rosie-odonnell-rants-about-trump-rigged-elections-taking-drugs-to-sleep/",
    "timestamp": "2025-05-13T12:36:39Z"
  },
  {
    "title": "Tariffmageddon Canceled: U.S. Inflation Stays Cooler Than Expected, Prices Up 2.3%, Smallest Annual Increase Since February 2021",
    "description": "Prices rose by 0.2 percent in April compared with March. Economists had forecast a 0.3 percent. Compared with a year ago, prices are up 2.3 percent, less than the 2.4 percent forecast.\nThe post Tariffmageddon Canceled: U.S. Inflation Stays Cooler Than Expecte…",
    "link": "https://www.breitbart.com/economy/2025/05/13/u-s-inflation-stays-cooler-than-expected-prices-up-2-3/",
    "timestamp": "2025-05-13T12:33:33Z"
  },
  {
    "title": "Inflation slowed more than expected in April, despite tariff-related price pressures building | CNN Business",
    "description": "US inflation slowed to its lowest rate in more than four years, an unexpected and welcome development at a time when President Donald Trump’s dramatically escalated tariffs are expected to cause prices to rise.",
    "link": "https://www.cnn.com/2025/05/13/economy/us-cpi-consumer-inflation-april",
    "timestamp": "2025-05-13T12:32:44Z"
  },
  {
    "title": "Inflation Hits Lowest Level In 4 Years Despite Tariff Chaos",
    "description": "The first inflation report since President Donald Trump launched his tariffs last month came out Tuesday,",
    "link": "https://www.forbes.com/sites/dereksaul/2025/05/13/inflation-hits-lowest-level-in-4-years-despite-tariff-chaos/",
    "timestamp": "2025-05-13T12:32:21Z"
  },
  {
    "title": "Don’t Be A Panican, But Question Government Shenanigans",
    "description": "“Don’t Be A Panican” is a memeable mantra adapted from a Truth Social post released by the President during the market turmoil triggered by the threat of a broad-sweeping tariff policy. While the panican meme is comical and jovial, its sentiment carries a mor…",
    "link": "https://www.shtfplan.com/headline-news/dont-be-a-panican-but-question-government-shenanigans",
    "timestamp": "2025-05-13T12:30:59Z"
  },
  {
    "title": "European Jewish leaders: Inaction on antisemitism 'unforgivable'",
    "description": "At EJA conference in Madrid, leaders adopt sweeping action plan and warn: European democracies are at risk if governments continue to ignore rising hate.",
    "link": "https://www.israelnationalnews.com/news/408285",
    "timestamp": "2025-05-13T12:30:40Z"
  },
  {
    "title": "Trump's plan to accept free plane from Qatar raises ethical and security worries",
    "description": "For Trump, accepting a free Air Force One replacement from Qatar is a no-brainer. But Democrats are united in outrage over the plan, and even some Republican have expressed concerns.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_b7e01076-adab-5f81-ae23-20beffa30bd1.html",
    "timestamp": "2025-05-13T12:30:00Z"
  },
  {
    "title": "The Media Calls Israeli Captives “Hostages” and Palestinians “Prisoners”",
    "description": "Although he was a soldier captured at a military outpost, U.S. news outlets rarely described Edan Alexander as a prisoner of war.\nThe post The Media Calls Israeli Captives “Hostages” and Palestinians “Prisoners” appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/13/israel-palestine-hostages-prisoners-edan-alexander/",
    "timestamp": "2025-05-13T12:29:27Z"
  },
  {
    "title": "Fortnite CEO Meeting With Trump And Other Major Executives In Saudi Arabia Today",
    "description": "Epic Games founder and CEO Tim Sweeney apparently attended a high-profile lunch today, May 13, in Saudi Arabia with US President Donald Trump and other world and business leaders from across the globe.This is according to a list of attendees supplied by the W…",
    "link": "https://www.gamespot.com/articles/fortnite-ceo-meeting-with-trump-and-other-major-executives-in-saudi-arabia-today/1100-6531488/",
    "timestamp": "2025-05-13T12:29:00Z"
  },
  {
    "title": "Robinhood to acquire Canada’s WonderFi for $179M in global crypto push",
    "description": "Brokerage fintech Robinhood is set to acquire WonderFi, a Canadian crypto firm, for approximately 250 million Canadian dollars ($179 million) in an all-cash deal to expand its global presence.The acquisition is expected to close in the second half of 2025, Ro…",
    "link": "https://cointelegraph.com/news/robinhood-to-acquire-wonderfi-179m-global-expansion",
    "timestamp": "2025-05-13T12:27:51Z"
  },
  {
    "title": "Chinese exporters to US tread warily as tariff uncertainties linger",
    "description": "After a 90-day US tariff reprieve, Chinese exporters express cautious relief but remain wary of future uncertainty. Some diversify operations abroad or scout US warehouses. While the pause aids holiday exports, fears of policy reversals linger, especially for…",
    "link": "https://economictimes.indiatimes.com/tech/technology/chinese-exporters-to-us-tread-warily-as-tariff-uncertainties-linger/articleshow/121140371.cms",
    "timestamp": "2025-05-13T12:27:26Z"
  },
  {
    "title": "Israel, \"Palestine\" and regional war",
    "description": "“The worst is not yet, so long as we still say, `This is the worst.’”\nShakespeare, King Lear.",
    "link": "https://www.israelnationalnews.com/news/408286",
    "timestamp": "2025-05-13T12:26:07Z"
  },
  {
    "title": "Trump moves to gut low-income energy assistance as summer heat descends and electricity prices rise",
    "description": "The problem of high energy prices and rising numbers of people unable to afford them isn’t lost on the Trump administration.",
    "link": "https://theconversation.com/trump-moves-to-gut-low-income-energy-assistance-as-summer-heat-descends-and-electricity-prices-rise-256194",
    "timestamp": "2025-05-13T12:25:37Z"
  },
  {
    "title": "Trump guts low-income energy assistance as summer heat descends and electricity prices rise",
    "description": "The problem of high energy prices and rising numbers of people unable to afford them isn’t lost on the Trump administration.",
    "link": "https://theconversation.com/trump-guts-low-income-energy-assistance-as-summer-heat-descends-and-electricity-prices-rise-256194",
    "timestamp": "2025-05-13T12:25:37Z"
  },
  {
    "title": "Ukraine-Russia peace talks 'chess' match pits Zelenskyy against Putin",
    "description": "President Vladimir Putin appears to be facing a dilemma as Russian and Ukrainian representatives prepare for direct peace talks in Istanbul, Turkey, on Thursday.",
    "link": "https://abcnews.go.com/International/ukraine-russia-peace-talks-chess-match-pits-zelenskyy/story?id=121740687",
    "timestamp": "2025-05-13T12:24:43Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Calls Out Trump For Changing Tune on ‘Funder of Terrorism’ Now That He’s Getting ‘Lavish’ $400M Plane",
    "description": "CNN anchor Kaitlan Collins called out President Donald Trump’s shift in tone on \"funder of terrorism\" Qatar after they offered him a \"lavish\" $400 million gift.\nThe post CNN’s Kaitlan Collins Calls Out Trump For Changing Tune on ‘Funder of Terrorism’ Now That…",
    "link": "https://www.mediaite.com/tv/cnns-kaitlan-collins-calls-out-trump-for-changing-tune-on-funder-of-terrorism-now-that-hes-getting-lavish-400m-plane/",
    "timestamp": "2025-05-13T12:24:08Z"
  },
  {
    "title": "'Don't rain on Trump's parade': Would-be GOP presidential candidates warned to skip 2028",
    "description": "Democrats are already jockeying for position nearly four years before the next presidential election, but a new report claims would-be Republican contenders are being frozen out to avoid undercutting President Donald Trump.Prospective GOP candidates are givin…",
    "link": "https://www.rawstory.com/republican-candidates-2028/",
    "timestamp": "2025-05-13T12:24:06Z"
  },
  {
    "title": "Exclusive-Trump envoys Witkoff and Kellogg to travel to Turkey for Russia-Ukraine talks, sources say",
    "description": "WASHINGTON/RIYADH/ANTALYA (Reuters) - U.S. President Donald Trump's senior envoys Steve Witkoff and Keith Kellogg will travel to Istanbul for potential talks on Thursday on how to end Russia's war in Ukraine, three sources familiar with the plans said on Tues…",
    "link": "https://www.thestar.com.my/news/world/2025/05/13/exclusive-trump-envoys-witkoff-and-kellogg-to-travel-to-turkey-for-russia-ukraine-talks-sources-say",
    "timestamp": "2025-05-13T12:24:00Z"
  },
  {
    "title": "EU faces heat over millions paid to Musk firms",
    "description": "The EU paid Elon Musk’s companies hundreds of millions in 2023–2024, including €159 million to Tesla for EV chargers and $197 million to SpaceX for satellite launches. Critics argue funding Musk—an EU critic and Trump ally—undermines EU values, calling for an…",
    "link": "https://economictimes.indiatimes.com/tech/technology/eu-faces-heat-over-millions-paid-to-musk-firms/articleshow/121140305.cms",
    "timestamp": "2025-05-13T12:23:59Z"
  },
  {
    "title": "Zambia warns diplomats after US reveals 'systematic' aid theft",
    "description": "The foreign minister says raising concerns publicly amounts to interference in domestic affairs.",
    "link": "https://www.bbc.com/news/articles/ckg4zjrwdrlo",
    "timestamp": "2025-05-13T12:23:38Z"
  },
  {
    "title": "\"Unprecedented\" in U.S. History: Trump & Family Rake In Money from Gulf States, Crypto & Real Estate",
    "description": "As President Donald Trump meets with leaders in the Middle East this week, we look at how his administration and family have opened wide to foreign powers and wealthy interests willing to spend big to gain influence. Top buyers of Trump’s novelty cryptocurren…",
    "link": "https://www.democracynow.org/2025/5/13/qatar_air_force_one",
    "timestamp": "2025-05-13T12:22:49Z"
  },
  {
    "title": "President Donald Trump – Will He Become The Drug Price Equalizer?",
    "description": "The President’s proposal, of \"most favored nation\" (MFN) policy, tying U.S. drug prices to the lowest prices paid by other developed countries, might make it.",
    "link": "https://www.forbes.com/sites/stephenbrozak/2025/05/13/president-donald-trump--will-he-become-the-drug-price-equalizer/",
    "timestamp": "2025-05-13T12:20:12Z"
  },
  {
    "title": "Trump Visits Saudi Arabia, Seeks $1 Trillion in Deals: Live Updates",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump kicked off a high-profile tour of the Gulf on Tuesday, beginning in Riyadh, focusing on securing business investments from Saudi Arabia. He arrived alongside top U.S. business leaders, i…",
    "link": "https://biztoc.com/x/8d6115fc9b07e0c8",
    "timestamp": "2025-05-13T12:19:26Z"
  },
  {
    "title": "Posthaste: Canadians aren't the only tourists shunning America as foreign visits plummet",
    "description": "Canadian travellers have been giving the United States the cold shoulder since President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n ramped up \n \n \n \n \n \n tariffs and sovereignty attacks\n \n \n \n \n \n — but they are not the only ones. \n The latest travel data shows that…",
    "link": "https://biztoc.com/x/82938d24f2087c09",
    "timestamp": "2025-05-13T12:19:18Z"
  },
  {
    "title": "US can curb AI chip risks without halting tech exports, US official says",
    "description": "A White House official signaled openness to AI chip exports, stating national security doesn’t require blocking global diffusion. Speaking in Riyadh, he emphasised trusted allies like Saudi Arabia aren’t risks. This marks a shift from Biden-era restrictions, …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-can-curb-ai-chip-risks-without-halting-tech-exports-us-official-says/articleshow/121140177.cms",
    "timestamp": "2025-05-13T12:18:48Z"
  },
  {
    "title": "Trump Visits Saudi Arabia, Seeks $1 Trillion in Deals: Live Updates",
    "description": "Trump begins Gulf tour in Saudi Arabia, seeking investment deals with top U.S. CEOs, skipping Israel and downplaying security. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donal-trump-administration-news-middle-east-live-updates-2071496",
    "timestamp": "2025-05-13T12:18:32Z"
  },
  {
    "title": "Hasan Piker reveals he was detained by US border agents",
    "description": "The popular political commentator says he was stopped at the airport and interrogated for two hours about Donald Trump and Palestine",
    "link": "https://www.dazeddigital.com/life-culture/article/66807/1/left-wing-streamer-hasan-piker-says-he-was-detained-by-us-border-agents?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=hasan-piker-reveals-he-was-detained-by-us-border-agents",
    "timestamp": "2025-05-13T12:17:00Z"
  },
  {
    "title": "Trump’s Gifted Qatari 747 Would Be a Security Problem",
    "description": "\"President Donald Trump on Monday praised Qatar for offering his administration a free luxury jet, but current and former U.S. military, defense and Secret Service officials said he will likely have to waive existing security",
    "link": "https://politicalwire.com/2025/05/13/trumps-gifted-qatari-747-would-be-a-security-problem/",
    "timestamp": "2025-05-13T12:16:59Z"
  },
  {
    "title": "Witkoff, in Hostage Square, Praises 'Pressure' from Netanyahu for Hostage Release",
    "description": "U.S. Special Envoy Steve Witkoff visited Hostage Square in Tel Aviv on Tuesday and met with families and supporters of the remaining Israeli captives, praising Israeli Prime Minister Benjamin Netanyahu for his role in securing the release of American-Israeli …",
    "link": "https://www.breitbart.com/middle-east/2025/05/13/witkoff-in-hostage-square-praises-pressure-from-netanyahu-for-hostage-release/",
    "timestamp": "2025-05-13T12:16:29Z"
  },
  {
    "title": "'Chicken' Vladimir Putin 'a no-show for Turkey peace talks with Zelensky'",
    "description": "Vladimir Putin will not show up for peace talks because his 25-year stranglehold on Russia ends if he yields, experts say. Ukraine President Volodymyr Zelensky has agreed to an offer of direct talks aimed at achieving peace, but Moscow said it would refuse to…",
    "link": "https://freerepublic.com/focus/f-chat/4316677/posts",
    "timestamp": "2025-05-13T12:13:40Z"
  },
  {
    "title": "Red-faced, Donald Trump caves and backs off on China tariffs; here's why",
    "description": "Charles Gasparino commented on the US-China tariff agreement, suggesting both sides retreated during negotiations. He argued that Trump's initial tariff hikes triggered negative market reactions, particularly in the bond market, forcing a policy reversal. Gas…",
    "link": "https://economictimes.indiatimes.com/news/international/us/red-faced-donald-trump-caves-and-backs-off-on-china-tariffs-heres-why/articleshow/121139663.cms",
    "timestamp": "2025-05-13T12:13:08Z"
  },
  {
    "title": "Gift or Grift? Trump Under Fire over Qatar's Plan to Give Him $400M \"Flying Palace\"",
    "description": "We speak with Robert Weissman, co-president of the advocacy group Public Citizen, about President Donald Trump’s “corrupt deal” to accept a $400 million jumbo luxury jet from the royal family of Qatar — possibly the most valuable such gift a foreign governmen…",
    "link": "https://www.democracynow.org/2025/5/13/public_citizen_qatar_air_force_one",
    "timestamp": "2025-05-13T12:12:57Z"
  },
  {
    "title": "House Republicans unveil new food stamp work requirements for Trump's 'big, beautiful bill'",
    "description": "The House Agriculture Committee released nearly 100 pages for its portion of President Donald Trump's \"big, beautiful bill\" on Monday evening.",
    "link": "https://www.foxnews.com/politics/house-republicans-unveil-new-food-stamp-work-requirements-trumps-big-beautiful-bill",
    "timestamp": "2025-05-13T12:12:41Z"
  },
  {
    "title": "Shein and Temu find temporary reprieve as U.S. relaxes tariffs",
    "description": "The recent tariff cut has offered a window of opportunity for them to ramp up shipments from China and restock their warehouses and fulfill existing orders.",
    "link": "https://www.cnbc.com/2025/05/13/shein-temu-find-temporary-reprieve-as-us-relaxes-tariffs.html",
    "timestamp": "2025-05-13T12:12:00Z"
  },
  {
    "title": "Lammy: Government statements on UK arms sales to Israel ‘completely accurate’",
    "description": "Foreign Secretary says UK concerned about lack of aid distribution points in Gaza",
    "link": "https://www.jewishnews.co.uk/lammy-government-statements-on-uk-arms-sales-to-israel-completely-accurate/",
    "timestamp": "2025-05-13T12:10:40Z"
  },
  {
    "title": "Hamas rejects Netanyahu's claim military pressure helped secure hostage release",
    "description": "GAZA CITY: Hamas on Tuesday (May 13) rejected Israeli Prime Minister Benjamin Netanyahu's claim that military pressure had helped secure the release of US-Israeli hostage Edan Alexander from Ga",
    "link": "https://www.channelnewsasia.com/world/hamas-reject-netanyahu-claim-military-pressure-hostage-release-edan-alexander-5126781",
    "timestamp": "2025-05-13T12:10:36Z"
  },
  {
    "title": "EU to intensify sanctions on Russia after ceasefire calls ignored",
    "description": "The Kremlin on Monday slammed EU leaders’ calls for a ceasefire as an “unacceptable ultimatum.\"",
    "link": "https://www.euractiv.com/section/economy-jobs/news/eu-to-intensify-sanctions-on-russia-after-ceasefire-calls-ignored/",
    "timestamp": "2025-05-13T12:10:17Z"
  },
  {
    "title": "Seth Meyers Has 'No F**king Idea' What's Going On In Trump's Latest Bonkers Tangent",
    "description": "“This is half a story and half a game of charades,\" joked the \"Late Night\" comedian.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-tangent_n_68231eb2e4b0205e6886b76a",
    "timestamp": "2025-05-13T12:09:57Z"
  },
  {
    "title": "EU prepares new sanctions targeting Russia's shadow fleet despite proposed Zelenskyy-Putin talks",
    "description": "The EU is preparing new sanctions on Russia despite a potential meeting between Vladimir Putin and Volodymyr Zelenskyy on Thursday, three sources told CNBC.",
    "link": "https://www.cnbc.com/2025/05/13/eu-prepares-new-sanctions-targeting-russias-shadow-fleet-despite-proposed-zelenskyy-putin-talks.html",
    "timestamp": "2025-05-13T12:09:33Z"
  },
  {
    "title": "Tom Cruise shuts down question about Trump movie tariff during ‘Mission: Impossible’ promo tour",
    "description": "Cruise's new movie \"Mission: Impossible – The Final Reckoning\" was filmed in multiple countries, including the UK and South Africa.",
    "link": "https://nypost.com/2025/05/13/entertainment/tom-cruise-shuts-down-question-about-trump-movie-tariff-during-mission-impossible-promo-tour/",
    "timestamp": "2025-05-13T12:08:28Z"
  },
  {
    "title": "Robert Kennedy Jr. swam in a creek infested with bacteria, E. coli & raw sewage",
    "description": "It’s more than possible that Robert Kennedy Jr. was deeply disturbed even before a worm ate part of his brain and then died in his skull. His cousin Caroline Kennedy had some vivid stories about Robert’s drug use and predatory behavior, and like most psychopa…",
    "link": "https://www.celebitchy.com/921953/robert_kennedy_jr_swam_in_a_creek_infested_with_bacteria_e_coli_raw_sewage/",
    "timestamp": "2025-05-13T12:08:03Z"
  },
  {
    "title": "Trump's trade agreement with China is another big win for investors",
    "description": "The US and China's trade deal sent the market skyrocketing, but the brightest minds on Wall Street aren't all as optimistic.",
    "link": "https://www.businessinsider.com/stocks-popped-us-china-trade-truce-economists-wall-street-warnings-2025-5",
    "timestamp": "2025-05-13T12:07:42Z"
  },
  {
    "title": "Forbes Daily: U.S. Stocks Soar Following Temporary China Trade Deal",
    "description": "Today’s Forbes Daily covers impact of lower China tariffs, financial issues at Selena Gomez company, Trump's Middle East trip Qatar plane gift, Shield AI drones and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/05/13/forbes-daily-us-stocks-soar-following-temporary-china-trade-deal/",
    "timestamp": "2025-05-13T12:07:30Z"
  },
  {
    "title": "Trump backs Jack Ciattarelli in New Jersey's Republican primary for governor",
    "description": "President Donald Trump endorsed Republican Jack Ciattarelli in New Jersey’s GOP primary, saying he’s gone “ALL IN” on the “Make America Great Again” agenda",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-backs-jack-ciattarelli-new-jerseys-republican-primary-121744464",
    "timestamp": "2025-05-13T12:06:30Z"
  },
  {
    "title": "NCAA president 'up for anything' amid rumors of Trump creating commission on college sports",
    "description": "NCAA President Charlie Baker appeared to welcome the idea of President Donald Trump creating a commission on college sports amid a turbulent landscape for collegiate athletics.",
    "link": "https://www.foxnews.com/sports/ncaa-president-up-anything-amid-rumors-trump-creating-commission-college-sports",
    "timestamp": "2025-05-13T12:05:55Z"
  },
  {
    "title": "Moldovan Police arrested a 45-year-old foreign man participating in ransomware attacks on Dutch companies",
    "description": "A 45-year-old foreign man has been arrested in Moldova for allegedly participating in ransomware attacks on Dutch companies in 2021. Moldovan police arrested a 45-year-old foreign man as a result of a joint international operation involving Moldovan and Dutch…",
    "link": "https://securityaffairs.com/177772/cyber-crime/moldovan-police-arrested-a-45-year-old-foreign-man-participating-in-ransomware-attacks-on-dutch-companies.html",
    "timestamp": "2025-05-13T12:03:51Z"
  },
  {
    "title": "EXCLUSIVE: GOP Lawmakers Make Eleventh-Hour Push To Gut Biden’s ‘Green New Scam’",
    "description": "Congressional Republicans are making a last-ditch effort to gut the Inflation Reduction Act's green energy subsidies in Trump's \"one big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/05/13/gop-lawmakers-biden-green-energy-inflation-reduction-act/",
    "timestamp": "2025-05-13T12:03:45Z"
  },
  {
    "title": "Donald Trump leans left in bid to revive flagging poll numbers",
    "description": "US president’s proposed pharma price cuts and tax increases for the rich echo policies of progressive Democrats",
    "link": "https://www.irishtimes.com/world/us/2025/05/13/donald-trump-leans-left-in-bid-to-revive-flagging-poll-numbers/",
    "timestamp": "2025-05-13T12:02:16Z"
  },
  {
    "title": "The DJI Mavic 4 Pro Won’t Be Sold in the US at Launch",
    "description": "DJI today announced the Mavic 4 Pro, a major update to the extremely popular series of pro-level drones which saw the 3 Pro launched in 2023. The Mavic series remains one of the best options for traveling professional photographers and filmmakers, but DJI's l…",
    "link": "https://petapixel.com/2025/05/13/the-dji-mavic-4-pro-wont-be-sold-in-the-us-at-launch/",
    "timestamp": "2025-05-13T12:01:37Z"
  },
  {
    "title": "House Republicans Consider Expansion of Tax on University Endowments",
    "description": "\"Trump has demanded that those schools eliminate diversity, equity and inclusion programs and accused the institutions of permitting harassment of Jewish students on their campuses.\"\nThe post House Republicans Consider Expansion of Tax on University Endowment…",
    "link": "https://legalinsurrection.com/2025/05/house-republicans-consider-expansion-of-tax-on-university-endowments/",
    "timestamp": "2025-05-13T12:00:18Z"
  },
  {
    "title": "KindlyMD Shares Surge 250% Post-Merger With Trump Crypto Advisor David Bailey",
    "description": "Shares of healthcare company KindlyMD (KDLY) skyrocketed by 250% on Monday after the firm announced a merger with Nakamoto Holdings, a Bitcoin (BTC) investment company founded by David Bailey, crypto advisor to President Donald Trump.  KindlyMD Secures $710 M…",
    "link": "http://www.newsbtc.com/bitcoin-news/kindlymd-shares-surge-250-post-merger-with-trump-crypto-advisor-david-bailey/",
    "timestamp": "2025-05-13T12:00:07Z"
  },
  {
    "title": "CASE OF THE DIDDLER",
    "description": "SEAN “Diddy” Combs’ eight-month pregnant ex-girlfriend Cassie Ventura is set to take the stand and testify on day two of the blockbuster trial. Her bombshell testimony comes after…",
    "link": "https://www.the-sun.com/entertainment/14219435/diddy-trial-live-updates-cassie-court-witness-video/",
    "timestamp": "2025-05-13T12:00:02Z"
  },
  {
    "title": "'Physical deterioration'...",
    "description": "Joe Biden’s physical deterioration was severe enough that his aides privately discussed putting him in a wheelchair for his second term, according to a new book.",
    "link": "https://www.cnn.com/2025/05/13/politics/biden-book-wheelchair-age",
    "timestamp": "2025-05-13T12:00:02Z"
  },
  {
    "title": "Analysts Say 9 Stocks Will Pay Off If You 'Buy The Dip'",
    "description": "Savvy investors know that buying leading growth stocks is the best way to profit long term. But there's a rush to buy the dip in the S&P 500.",
    "link": "https://www.investors.com/etfs-and-funds/sectors/sp500-analysts-say-9-stocks-will-pay-off-if-you-buy-the-dip/",
    "timestamp": "2025-05-13T12:00:01Z"
  },
  {
    "title": "Hank Kunneman Says Trump's $400 Million Jet Is A Sign Of God's Favor",
    "description": "Trump cultist/self-proclaimed \"prophet\" Hank Kunneman defends Trump's plan to accept a $400 million jet as a \"gift\" from Qatar.",
    "link": "https://www.peoplefor.org/rightwingwatch/hank-kunneman-says-trumps-400-million-jet-sign-gods-favor",
    "timestamp": "2025-05-13T12:00:00Z"
  },
  {
    "title": "The Founding Fathers Would Have Wanted President Trump to Accept a $400 Million Plane from a Foreign Country",
    "description": "“President Trump on Monday defended the US government’s plan to accept a $400 million luxury jet from the Qatari royal family to be used as Air Force One, describing it as a ‘great gesture’ and saying that it would be ‘stupid’ to turn down, despite growing et…",
    "link": "https://www.mcsweeneys.net/articles/the-founding-fathers-would-have-wanted-president-trump-to-accept-a-400-million-plane-from-a-foreign-country",
    "timestamp": "2025-05-13T12:00:00Z"
  },
  {
    "title": "Global Banking Regulators Agree to Prioritize Climate Risk Work",
    "description": "Global banking regulators on Monday agreed to intensify efforts to better understand the financial risks posed by climate change amid pushback from the United States. The oversight body of the world’s forum for banking regulators met on Monday to take …",
    "link": "https://www.insurancejournal.com/news/international/2025/05/13/823451.htm",
    "timestamp": "2025-05-13T11:59:49Z"
  },
  {
    "title": "Harvard defends ‘core principles’ against Trump threats",
    "description": "The Ivy League institution has responded to the US government’s anti-Semitism concerns Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617459-harvard-trump-funding-letter/",
    "timestamp": "2025-05-13T11:59:06Z"
  },
  {
    "title": "Olympic Great Gets Pinched In Prostitution Sting: Police Report",
    "description": "The three-time Olympian apparently even has a connection to Donald Trump.",
    "link": "https://www.huffpost.com/entry/kyle-snyder-prostitution-sting_n_68231a79e4b0993b52bee100",
    "timestamp": "2025-05-13T11:58:09Z"
  },
  {
    "title": "Stocks soar after trade war with China cools amid negotiations",
    "description": "President Donald Trump is touting a dramatic de-escalation of his trade war, calling it a “total reset” with China after negotiations over the weekend lowered tariffs from 145% to 30% for three months. In his first remarks since the temporary truce, Chinese l…",
    "link": "https://biztoc.com/x/b9350fab22cc6189",
    "timestamp": "2025-05-13T11:57:11Z"
  },
  {
    "title": "Watch: Trump's Lavish Welcome In Saudi Arabia, With Who's Who Of Tech CEOs In Tow",
    "description": "Watch: Trump's Lavish Welcome In Saudi Arabia, With Who's Who Of Tech CEOs In Tow\n \nIf there's one thing that's clear by now, it's that Saudi Arabia and the royal family loves President Donald J. Trump.\nFor example, in an unusual move and break with protocol,…",
    "link": "https://biztoc.com/x/9108f87dbbaa1e60",
    "timestamp": "2025-05-13T11:57:07Z"
  },
  {
    "title": "Democrats pivot to talk more about the economy and less about immigration",
    "description": "Democrats have long focused on immigration when courting Latino voters in states like Arizona, Nevada, New Jersey and Florida, where generations of Latin American immigrants have settled and gained permanent legal status",
    "link": "https://abcnews.go.com/Politics/wireStory/reach-latinos-democrats-pivot-talk-economy-immigration-121743580",
    "timestamp": "2025-05-13T11:56:21Z"
  },
  {
    "title": "Safe haven concerns mount as US Treasuries face twin recession and inflation risks - Reuters poll",
    "description": "Concerns for the safe haven status of U.S. Treasuries are rising with benchmark 10-year yields expected to drift sideways over the coming year, pinned...",
    "link": "https://finance.yahoo.com/news/safe-haven-concerns-mount-us-115618564.html",
    "timestamp": "2025-05-13T11:56:18Z"
  },
  {
    "title": "Gen Z Teacher Quits, Reveals Why She Thinks High School Students Are Doomed",
    "description": "Hannah Maria said that kids don't know how to read, and don't care about making a difference in the world.",
    "link": "https://www.newsweek.com/gen-z-teacher-quits-high-school-students-technology-ai-illiteracy-2071440",
    "timestamp": "2025-05-13T11:55:39Z"
  }
]