[
  {
    "title": "Trump tariffs goods from Brazil at 50%, citing 'witch hunt' trial against Bolsonaro",
    "description": "President Donald Trump singled out Brazil for import taxes of 50% on Wednesday for its treatment of its former president, Jair Bolsonaro.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_8172232f-e036-569e-9a6f-9e0817d81ed7.html",
    "timestamp": "2025-07-09T21:30:00Z"
  },
  {
    "title": "QQQ Attracts $1.4B in Assets Amid Tariff Uncertainty",
    "description": "- QQQ led ETF inflows as the S&P 500 closed flat on trade policy confusion. - XLF and SGOV gained, while IVV and SPY saw outflows.",
    "link": "http://www.etf.com/sections/daily-etf-flows/qqq-attracts-14b-assets-amid-tariff-uncertainty?utm_source=yahoo-finance&amp;utm_medium=rss&amp;utm_campaign=yahoo-finance-rss",
    "timestamp": "2025-07-09T21:30:00Z"
  },
  {
    "title": "Don't fall for photo of Trump dancing with teen girl on Epstein's island",
    "description": "Photograph authentically shows Donald Trump in his fifties, dancing with a 13-year-old girl on Jeffrey Epstein’s island.",
    "link": "https://www.snopes.com//fact-check/trump-teen-epstein-island-photo/",
    "timestamp": "2025-07-09T21:30:00Z"
  },
  {
    "title": "Trump's trade blitz produces few deals but lots of uncertainty",
    "description": "President Donald Trump and his advisers promised a lightning round of global trade negotiations with dozens of countries back in April. White House trade adviser Peter Navarro predicted “90 deals in 90 days.’’ Administration officials declared that other coun…",
    "link": "https://japantoday.com/category/features/opinions/trump%27s-trade-blitz-produces-few-deals-but-lots-of-uncertainty",
    "timestamp": "2025-07-09T21:29:41Z"
  },
  {
    "title": "Can Trump tap Bessent to head the Fed and the Treasury at the same time? Here’s what the law says",
    "description": "Treasury Secretary Scott Bessent is among the contenders to head the Federal Reserve. Can President Donald Trump have him do both jobs at once?",
    "link": "https://biztoc.com/x/4a597bd620b32648",
    "timestamp": "2025-07-09T21:29:28Z"
  },
  {
    "title": "Trump Slaps Brazil With 50% Tariff While Criticizing Prosecution Of Former President",
    "description": "The steep tariff was announced days after Trump said BRICS had “Anti-American policies.”",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/07/09/trump-slaps-brazil-with-50-tariff-while-criticizing-prosecution-of-former-president/",
    "timestamp": "2025-07-09T21:29:27Z"
  },
  {
    "title": "Federal workers fear Trump will fire them after court ruling: ‘We are toast’",
    "description": "Some federal workers cried. Some shook their heads and began updating their resumes. Others — including union leaders — vowed to fight, determined to hang on to the government jobs that many took because they wanted to serve the American public.After the Supr…",
    "link": "https://freerepublic.com/focus/f-news/4327790/posts",
    "timestamp": "2025-07-09T21:29:12Z"
  },
  {
    "title": "Trump's 'big beautiful' bill boosts the maximum child tax credit to $2,200—here's who qualifies",
    "description": "President Donald Trump signed his \"big beautiful\" spending bill into law on July 4.\nOne provision is an increase to the maximum child tax credit, raising it from $2,000 per eligible child to $2,200 beginning in 2026. The 2017 Tax Cuts and Jobs Act temporarily…",
    "link": "https://biztoc.com/x/2add25fbcf513f07",
    "timestamp": "2025-07-09T21:29:02Z"
  },
  {
    "title": "Trump praises Liberian president’s English, the official language of Liberia",
    "description": "President Donald Trump participates in a multilateral lunch with visiting African Leaders in the State Dining Room of the White House on Wednesday.",
    "link": "https://biztoc.com/x/e4836fad9b2bacbc",
    "timestamp": "2025-07-09T21:29:00Z"
  },
  {
    "title": "Trump announces 50 pct tariffs on Brazilian goods",
    "description": "NEW YORK, July 9 (Xinhua) -- U.S. President Donald Trump announced Wednesday afternoon that tariffs of 50 percent will be charged on goods imported from Brazil, effective on Aug. 1. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/trump-announces-50-pct-tariffs-on-brazilian-goods",
    "timestamp": "2025-07-09T21:28:00Z"
  },
  {
    "title": "Donald Trump Jr. invests in social media-turned BTC treasury firm",
    "description": "Donald Trump Jr is now a shareholder of the Thumzup Media Group, a social media marketing company and platform, that has adopted a Bitcoin treasury plan.",
    "link": "https://cointelegraph.com/news/donald-trump-jr-social-media-turned-btc-treasury",
    "timestamp": "2025-07-09T21:26:44Z"
  },
  {
    "title": "Apple Remains in Trump's Crosshairs as Trade Advisor Again Criticizes China Reliance",
    "description": "U.S. trade director Peter Navarro took aim at Apple again today, causing the company's stock to briefly drop. In an interview with Fox Business, Navarro said that Apple thinks that it is \"too big to tariff,\" suggesting that Apple might be expecting a tariff e…",
    "link": "https://www.macrumors.com/2025/07/09/apple-trump-china-reliance/",
    "timestamp": "2025-07-09T21:26:41Z"
  },
  {
    "title": "Trump tariffs goods from Brazil at 50%, citing 'witch hunt' trial against Bolsonaro",
    "description": "President Donald Trump is singling out Brazil for import taxes of 50%, citing its treatment of its former president, Jair Bolsonaro",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-tariffs-goods-brazil-50-citing-witch-hunt-123626179",
    "timestamp": "2025-07-09T21:26:34Z"
  },
  {
    "title": "WATCH: ‘Trump and I have a common goal,’ Netanyahu says before meeting senators",
    "description": "Israeli Prime Minister Benjamin Netanyahu says he and President Donald Trump agree on how to secure the release of Israeli hostages and end Hamas’ rule in Gaza.",
    "link": "https://www.pbs.org/newshour/world/watch-trump-and-i-have-a-common-goal-netanyahu-says-before-meeting-senators",
    "timestamp": "2025-07-09T21:26:28Z"
  },
  {
    "title": "Home health care workers rally in Moorhead with concerns about Medicaid cuts",
    "description": "Around two dozen people gathered outside the Moorhead office of U.S. Rep. Michelle Fischbach, R-Minn., on Wednesday, July 9, to voice concerns about the recently signed federal spending and tax bill.",
    "link": "https://www.inforum.com/news/moorhead/home-health-care-workers-rally-in-moorhead-with-concerns-about-medicaid-cuts",
    "timestamp": "2025-07-09T21:25:55Z"
  },
  {
    "title": "'Just Salty': El Salvador President Bukele Mocks Senate Democrats Over Bitcoin Scrutiny",
    "description": "Senate Democrats want an investigation into Salvadoran president Nayib Bukele's use of crypto. The popular leader finds it hilarious.",
    "link": "https://decrypt.co/329405/el-salvador-president-bukele-mocks-senate-democrats-bitcoin",
    "timestamp": "2025-07-09T21:25:44Z"
  },
  {
    "title": "X CEO Linda Yaccarino calls it quits less than 24 hours after the platform's AI-powered chatbot Grok anoints itself 'MechaHitler' and starts posting antisemitic messages and graphic descriptions of sexual assault",
    "description": "Yaccarino said her tenure has been \"nothing short of remarkable,\" and she's not wrong.",
    "link": "https://www.pcgamer.com/games/x-ceo-linda-yaccarino-calls-it-quits-less-than-24-hours-after-the-platforms-ai-powered-chatbot-grok-anoints-itself-mechahitler-and-starts-posting-antisemitic-messages-and-graphic-descriptions-of-sexual-assault/",
    "timestamp": "2025-07-09T21:25:33Z"
  },
  {
    "title": "Epstein decision threatens Trump’s presidency: Here’s what needs to be done",
    "description": "Sir, like it, or not, understand the anger or not, your brand and legacy are on the line over this 1 issue",
    "link": "https://www.wnd.com/2025/07/epstein-decision-threatens-trumps-presidency-heres-what-needs/",
    "timestamp": "2025-07-09T21:25:22Z"
  },
  {
    "title": "Elon Musk’s A.I. Went Full Nazi. What Now?",
    "description": "This marks a new low—even for Musk.",
    "link": "https://slate.com/technology/2025/07/elon-musk-x-ai-grok-nazi-hitler-antisemitism.html",
    "timestamp": "2025-07-09T21:23:42Z"
  },
  {
    "title": "Trump threatens Brazil with 50% tariff and demands Bolsonaro's trial end",
    "description": "Trump accused Brazil of \"attacks\" on US tech companies and conducting a \"witch hunt\" against its former president Jair Bolsonaro.",
    "link": "https://www.bbc.com/news/articles/c784ee81y4zo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-09T21:22:53Z"
  },
  {
    "title": "Hamas agrees to release 10 captives as Israeli attacks kill 74 in Gaza",
    "description": "Hamas says ongoing talks remain 'tough' as Trump sees a ‘good chance’ of reaching ceasefire deal within days.",
    "link": "https://www.aljazeera.com/news/2025/7/9/hamas-agrees-to-release-captives-as-israeli-attacks-kill-in-gaza",
    "timestamp": "2025-07-09T21:22:01Z"
  },
  {
    "title": "Third Parties in America Usually Fail. Can Elon Musk Change That?",
    "description": "The world’s richest man takes his political evolution another step further.",
    "link": "http://foreignpolicy.com/2025/07/09/elon-musk-trump-america-party-third/",
    "timestamp": "2025-07-09T21:21:51Z"
  },
  {
    "title": "Sedition, Insurrection, and the Democrats’ Desperate Strategy",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Sedition, Insurrection, and the Democrats’ Desperate Strategy appeared …",
    "link": "https://www.dailysignal.com/2025/07/09/sedition-insurrection-and-the-democrats-desperate-strategy/",
    "timestamp": "2025-07-09T21:21:22Z"
  },
  {
    "title": "John Brennan Breaks Silence After FBI Launches Criminal Probe — Claims Investigations Are “Made Up Out of Whole Cloth”",
    "description": "Former CIA Director John Brennan has finally broken his silence after news broke that he is under criminal investigation by the FBI for his misconduct during the Trump–Russia probe — and his response was as arrogant and evasive as ever.\nThe post John Brennan …",
    "link": "https://www.thegatewaypundit.com/2025/07/john-brennan-breaks-silence-after-fbi-launches-criminal/",
    "timestamp": "2025-07-09T21:20:18Z"
  },
  {
    "title": "India Survives Another Round of Trump Tariff Letters: Could a Deal Help Spur More U.S. Shoe Exports?",
    "description": "India's the second largest shoe producer after China, and its absence from Trump's tariff letters so far means he's still considering trade terms.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/india-shoe-producer-trump-tariff-trade-terms-1237974832/",
    "timestamp": "2025-07-09T21:19:57Z"
  },
  {
    "title": "‘They Need To Listen To Me’: Firefighter’s Widow Still Seeking Answers Year After Trump Rally Shooting",
    "description": "The widow of a firefighter killed during a July 13, 2024, assassination attempt on Donald Trump said during an interview she needed answers about the incident.",
    "link": "https://dailycaller.com/2025/07/09/firefighters-widow-seeking-answers-year-after-trump-rally-shooting/",
    "timestamp": "2025-07-09T21:19:04Z"
  },
  {
    "title": "Linda Yaccarino steps down as CEO of Elon Musk's X",
    "description": "Linda Yaccarino's departure from the social media company X comes as owner Elon Musk is facing turbulence in his sprawling business empire — including falling sales at his EV maker Tesla and AI-related controversies.",
    "link": "https://www.cbc.ca/news/business/linda-yaccarino-steps-down-1.7580968",
    "timestamp": "2025-07-09T21:18:30Z"
  },
  {
    "title": "Trump edges closer to Russia hawks — but will the move last?",
    "description": "The News\nPresident Donald Trump is taking a decisive new turn in his handling of Russia’s war on Ukraine: He’s talking tougher about Vladimir Putin, considering a punishing sanctions bill, and dislodging a stalled weapons shipment.\nSome of Trump’s allies see …",
    "link": "https://biztoc.com/x/d0773d5bb8c57010",
    "timestamp": "2025-07-09T21:17:53Z"
  },
  {
    "title": "James Comey Was Tailed By Unmarked Cars, Tracked By Secret Service After His Controversial Post On Trump: Report",
    "description": "The Secret Service ordered law enforcement officers to track former FBI Director James Comey on the day after he posted a photo of seashells arranged to spell out “86 47,” a new report states. According to The New York Times, authorities in unmarked cars and …",
    "link": "https://www.mediaite.com/media/news/james-comey-was-tailed-by-unmarked-cars-tracked-by-secret-service-after-his-controversial-post-on-trump-report/",
    "timestamp": "2025-07-09T21:17:10Z"
  },
  {
    "title": "Migrants Sue to Stop Trump from Deporting Them by Invoking Racism",
    "description": "Migrants in the United States on Temporary Protected Status (TPS) are suing President Donald Trump's Department of Homeland Security (DHS) to halt their deportation to their home countries, claiming the president and DHS Secretary Kristi Noem are racist. \nThe…",
    "link": "https://www.breitbart.com/politics/2025/07/09/migrants-sue-to-stop-trump-from-deporting-them-by-invoking-racism/",
    "timestamp": "2025-07-09T21:15:28Z"
  },
  {
    "title": "Trump announces 50% tariff on Brazil in retaliation for Bolsonaro trial, trade deficit (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump announces 50% tariff on Brazil in retaliation for Bolsonaro trial, trade deficit … President Donald Trump said Wednesday the U.S. will slap a 50% tariff on Brazil's imports, partly in retaliation for the ongoing prosecution of t…",
    "link": "https://www.memeorandum.com/250709/p110",
    "timestamp": "2025-07-09T21:15:01Z"
  },
  {
    "title": "Biden’s physician refuses to answer questions from Republicans in House probe of former president’s mental fitness | CNN Politics",
    "description": "Joe Biden’s White House physician on Wednesday declined to answer questions during a closed-door deposition with the House Oversight Committee, invoking his Fifth Amendment right as the Republican-led panel pushes forward in its probe of the former president’…",
    "link": "https://www.cnn.com/2025/07/09/politics/biden-doctor-mental-fitness-probe-house-gop",
    "timestamp": "2025-07-09T21:14:55Z"
  },
  {
    "title": "Trump praises Liberian President’s English during White House meeting — Liberia’s unique U.S. history explained",
    "description": "Donald Trump commended Liberian President Joseph Boakai's English at a White House gathering. Trump inquired about Boakai's education. Liberia's official language is English. The nation was founded by freed American slaves in the 1800s. Its capital, Monrovia,…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-praises-liberian-presidents-english-during-white-house-meeting-liberias-unique-u-s-history-explained/articleshow/122350794.cms",
    "timestamp": "2025-07-09T21:14:33Z"
  },
  {
    "title": "Peter Schweizer: Feds Have Had Epstein Client List Since 2019",
    "description": "Whatever the truth may be about Jeffrey Epstein’s suicide or “client list,” he was engaged in the business of human trafficking and that leaves a paper trail.\nThe post Peter Schweizer: Feds Have Had Epstein Client List Since 2019 appeared first on Breitbart.",
    "link": "https://www.breitbart.com/radio/2025/07/09/peter-schweizer-feds-have-had-epstein-client-list-since-2019/",
    "timestamp": "2025-07-09T21:13:47Z"
  },
  {
    "title": "Another Angry Billionaire Wants His Own Political Party",
    "description": "With this new venture, Musk is more likely to hurt Republicans than Democrats.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/elon-musk-america-party-trump/683485/",
    "timestamp": "2025-07-09T21:13:00Z"
  },
  {
    "title": "Trump’s Tariff Letters to World Leaders Are Copied and Pasted",
    "description": "After blowing his own deadline for deals with 90 countries, Donald Trump has resorted to spamming world leaders with copied-and-pasted letters threatening new tariffs.",
    "link": "http://nymag.com/intelligencer/article/trumps-tariff-letters-to-world-leaders-are-copy-and-pasted.html",
    "timestamp": "2025-07-09T21:11:53Z"
  },
  {
    "title": "Tapper says Trump admin’s Epstein memo is a ruse",
    "description": "The CNN host said the public is \"being played for fools\" by the Pam Bondi-led DOJ.",
    "link": "https://www.salon.com/2025/07/09/tapper-says-trump-admins-epstein-memo-is-a-ruse/",
    "timestamp": "2025-07-09T21:11:26Z"
  },
  {
    "title": "‘Sounds Like A Politician’: Dan Turrentine Says Ketanji Brown Jackson ‘May Be A Stain On Biden’",
    "description": "'May be a stain on Biden'",
    "link": "https://dailycaller.com/2025/07/09/ex-dem-strategist-ketanji-brown-jackson-biden/",
    "timestamp": "2025-07-09T21:09:46Z"
  },
  {
    "title": "Trump threatens Brazil with 50% tariff and demands Bolsonaro's trial end",
    "description": "Trump accused Brazil of \"attacks\" on US tech companies and conducting a \"witch hunt\" against its former president Jair Bolsonaro.",
    "link": "https://www.bbc.com/news/articles/c784ee81y4zo",
    "timestamp": "2025-07-09T21:09:44Z"
  },
  {
    "title": "Trump's push to claw back funding ignites a fight that threatens a government shutdown",
    "description": "President Donald Trump’s push for Republicans to bypass Democrats and claw back $9.4 billion in approved spending has ignited a new fight in Congress that could upend the normally bipartisan government funding process.",
    "link": "https://www.nbcnews.com/politics/congress/trump-push-claw-back-funding-government-shutdown-fight-rcna217725",
    "timestamp": "2025-07-09T21:07:21Z"
  },
  {
    "title": "Trump hits Brazil with 50% tariff, in part due to trial of ally Jair Bolsonaro",
    "description": "President Donald Trump announced Wednesday he planned to hit Brazil with a 50% tariff, in part due to the treatment of its former president and his political ally, Jair Bolsonaro",
    "link": "https://biztoc.com/x/12d480770dbab373",
    "timestamp": "2025-07-09T21:06:22Z"
  },
  {
    "title": "Trump quietly claimed a power even King George wasn’t allowed to have",
    "description": "Just before the July Fourth holiday, we learned that President Donald Trump secretly claimed a power so dangerous that even King George was prohibited from using it.  The claim came in a series of identical letters that Attorney General Pam Bondi sent to 10 l…",
    "link": "https://www.vox.com/politics/419393/trump-tik-tok-letters-dispensing-power-king",
    "timestamp": "2025-07-09T21:06:15Z"
  },
  {
    "title": "Sen. Lankford Hires Anti-Trump, CRT Apologist as Lead 'Values Action Team' Staffer",
    "description": "Sen. James Lankford (R-OK) hired an anti-Donald Trump, pro-illegal immigration, pro-Covid vaccine mandate, climate change alarmist, reportedly anti-Second Amendment, and Critical Race Theory apologist to serve as his top staffer on a team fighting for conserv…",
    "link": "https://www.breitbart.com/politics/2025/07/09/sen-lankford-hires-anti-trump-crt-apologist-as-lead-values-action-team-staffer/",
    "timestamp": "2025-07-09T21:06:09Z"
  },
  {
    "title": "\"The lady doth protest too much,\" we all thinks*",
    "description": "The upside? Never before has humanity seen a video a full one minute and 20 seconds long in which Donald Trump appears but in which Donald Trump says nothing. This, ladies and gentlemen, is historic film. Pam Bondi clarifies Epstein ‘client list’ comment afte…",
    "link": "https://www.pmcarpenter.com/post/the-lady-doth-protest-too-much-we-all-thinks",
    "timestamp": "2025-07-09T21:05:57Z"
  },
  {
    "title": "Oil Holds Gains Despite US Crude Surge",
    "description": "Oil steadied as a large US crude stockpile gain was balanced by new US sanctions on Iranian exports.",
    "link": "https://www.rigzone.com/news/wire/oil_holds_gains_despite_us_crude_surge-09-jul-2025-181098-article/",
    "timestamp": "2025-07-09T21:05:51Z"
  },
  {
    "title": "Trump asks Liberian president where he learned English, his country's official language (Reuters)",
    "description": "Reuters:\nTrump asks Liberian president where he learned English, his country's official language  —  President Donald Trump was basking in the praise of a group of African leaders on Wednesday, many of them speaking a different language, when the Liberian pre…",
    "link": "https://www.memeorandum.com/250709/p109",
    "timestamp": "2025-07-09T21:05:01Z"
  },
  {
    "title": "Ukraine's Zelenskiy meets US envoy Kellogg in Rome",
    "description": "Ukrainian President Volodymyr Zelenskiy said on Wednesday he had held a \"substantive\" conversation with U.S. President Donald Trump's Ukraine envoy, Keith Kellogg, in Rome shortly after Trump pledged to send more defensive weapons to Kyiv. \"We discussed weapo…",
    "link": "https://freerepublic.com/focus/f-chat/4327778/posts",
    "timestamp": "2025-07-09T21:03:30Z"
  },
  {
    "title": "Hamas says it has agreed to release 10 living hostages as Trump insists ceasefire deal ‘very close’",
    "description": "US president Donald Trump said negotiators are \"very close\" to a ceasefire deal between Israel and Hamas, raising optimism for a long-elusive agreement as Prime Minister Benjamin Netanyahu visits the US.",
    "link": "https://www.independent.ie/world-news/middle-east/hamas-says-it-has-agreed-to-release-10-living-hostages-as-trump-insists-ceasefire-deal-very-close/a1524671197.html",
    "timestamp": "2025-07-09T21:01:39Z"
  },
  {
    "title": "Top Senate Finance Dem Says There's More To Epstein Docs Than AG Is Letting On",
    "description": "The Trump administration has backtracked on promises to throw open the curtain on any Epstein files held by the government.",
    "link": "https://www.huffpost.com/entry/ron-wyden-epstein-files_n_686eb83be4b041f69cfe549d",
    "timestamp": "2025-07-09T21:01:31Z"
  },
  {
    "title": "Zohran Mamdani Beats Out Eric Adams and Andrew Cuomo, New Poll Shows",
    "description": "The outcome of the New York City mayoral race carries implications extending far beyond city limits.",
    "link": "https://www.newsweek.com/zohran-mamdani-beats-out-eric-adams-andrew-cuomo-new-poll-shows-2096933",
    "timestamp": "2025-07-09T21:01:30Z"
  },
  {
    "title": "Judge Slaps Down FCC Rule That Would’ve Made It Easy to Cancel Your Subscriptions",
    "description": "I'd like to unsubscribe from this timeline.",
    "link": "https://gizmodo.com/judge-slaps-down-fcc-rule-that-wouldve-made-it-easy-to-cancel-your-subscriptions-2000626952",
    "timestamp": "2025-07-09T21:00:37Z"
  },
  {
    "title": "US debt rises to $36.6T: Will recession signals send Bitcoin back to $95K?",
    "description": "Bitcoin price hit new highs today, but surging US debt and concerning housing data raise fears of a recession-led Bitcoin drop toward $95,000.",
    "link": "https://cointelegraph.com/news/us-debt-rises-to-36-6t-will-recession-signals-send-bitcoin-back-to-95k",
    "timestamp": "2025-07-09T21:00:00Z"
  },
  {
    "title": "Latest 2024 Post‑Mortem Book Actually Does Provide Some New, Behind‑the‑Scenes Revelations",
    "description": "Kamala Harris: “This is about saving our f—ing democracy.”\nThe post Latest 2024 Post‑Mortem Book Actually Does Provide Some New, Behind‑the‑Scenes Revelations first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/latest-2024-post%e2%80%91mortem-book-actually-does-provide-some-new-behind%e2%80%91the%e2%80%91scenes-revelations/",
    "timestamp": "2025-07-09T21:00:00Z"
  },
  {
    "title": "Trump Hits Brazil With 50 Percent Tariff While Citing Support for Bolsonaro",
    "description": "Trump has publicly defended Bolsonaro, labeling the trial a \"witch hunt\" and asserting that Bolsonaro is \"not guilty of anything.\"",
    "link": "https://www.newsweek.com/trump-brazil-new-tariff-bolsonaro-trial-2096946",
    "timestamp": "2025-07-09T20:59:16Z"
  },
  {
    "title": "In Retrospect, You Should Have Known That Was Not Marco Rubio",
    "description": "11 signs to help distinguish between him and an AI impostor",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/rubio-ai-spam-call/683484/",
    "timestamp": "2025-07-09T20:57:00Z"
  },
  {
    "title": "‘NATIONAL EMBARRASSMENT’: Trump Roasted for Complimenting African Leader on His English — His Country’s Official Language",
    "description": "President Donald Trump had kind words for Liberian President Joseph Nyuma Boakai on Wednesday, complimenting him for speaking English \"so beautifully\" -- which drew a round of mockery for Trump's apparent ignorance that the man was of course fluent in his cou…",
    "link": "https://www.mediaite.com/politics/trump/national-embarrassment-trump-roasted-for-complimenting-african-leader-on-his-english-which-is-his-countrys-official-language/",
    "timestamp": "2025-07-09T20:55:42Z"
  },
  {
    "title": "Familiar panic as Trump threatens copper, pharmaceutical tariffs",
    "description": "Donald Trump has 'sparked alarm' by threatening a 50% tariff on non-US copper and a 200% tariff on imported pharmaceuticals. Plus, the UK is trying to reassure Australia about AUKUS.\nThe post Familiar panic as Trump threatens copper, pharmaceutical tariffs ap…",
    "link": "http://www.crikey.com.au/2025/07/10/donald-trump-tariffs-pharmaceuticals-copper-aukus-antisemitism/",
    "timestamp": "2025-07-09T20:55:41Z"
  },
  {
    "title": "Musk Political Push To Hurt Tesla Stock: 71% Say Stock Will Fall In Next 12 Months",
    "description": "The potential launch of the America Party by billionaire Elon Musk could result in him committing more time to politics once again, putting key time with Tesla Inc. (NASDAQ:TSLA) on the back burner.\nWhat Happened: Passage of the \"Big Beautiful Bill\" by Congre…",
    "link": "https://biztoc.com/x/5a08df1cb15da8d4",
    "timestamp": "2025-07-09T20:55:12Z"
  },
  {
    "title": "Trump announces 50% tariff on Brazil in retaliation for Bolsonaro trial, trade deficit",
    "description": "President Donald Trump said Wednesday the U.S. will slap a 50% tariff on Brazil's imports, partly in retaliation for the ongoing prosecution of the country's former president, Jair Bolsonaro.\nTrump said in a letter that the new tariff — a massive jump from th…",
    "link": "https://biztoc.com/x/3c1a2195360adc04",
    "timestamp": "2025-07-09T20:55:08Z"
  },
  {
    "title": "US stock market: Nasdaq closes at record high, S&P 500, Dow Jones rise. Check Nvidia, Microsoft, Meta, Alphabet, Amazon share prices",
    "description": "Nvidia, Microsoft, Meta, Alphabet, and Amazon shares were up as Nasdaq, S&P 500, and Dow Jones were up.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-nasdaq-closes-at-record-high-sp-500-dow-jones-rise-check-nvidia-microsoft-meta-alphabet-amazon-share-prices/articleshow/122350767.cms",
    "timestamp": "2025-07-09T20:55:05Z"
  },
  {
    "title": "Trump issues tariff letters to 7 more trading partners as talks with EU continue",
    "description": "Today's letters to seven minor trading partners add to the 14 other tariff rates U.S. President Donald Trump set earlier in the week.",
    "link": "https://biztoc.com/x/d3e3eddffe24fd5f",
    "timestamp": "2025-07-09T20:55:01Z"
  },
  {
    "title": "Trump welcomes IRS decision to let churches endorse political candidates",
    "description": "WASHINGTON, July 9 (Reuters) - U.S. President Donald Trump on Wednesday welcomed the Internal Revenue Service's decision that houses of worship could endorse political candidates to their congregations without risking losing their status as tax-exempt nonprof…",
    "link": "https://freerepublic.com/focus/f-news/4327776/posts",
    "timestamp": "2025-07-09T20:54:50Z"
  },
  {
    "title": "Senior diplomat blames global crises for being late to parliament",
    "description": "Italian Foreign Minister Antonio Tajani has cited two wars and a trade dispute as the reason for his delay Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621258-italy-foreign-minister-wars-complain/",
    "timestamp": "2025-07-09T20:53:54Z"
  },
  {
    "title": "Trump praises Liberian president’s English, the official language of Liberia",
    "description": "The U.S. president’s embarrassing praise for the African leader’s facility with his own language drew mockery and accusations of ignorance.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-liberia-president-english-language-rcna217845",
    "timestamp": "2025-07-09T20:53:40Z"
  },
  {
    "title": "Patriots ‘very expensive’ – Trump",
    "description": "The US President has said he will “have to take a look” at a Ukrainian request for another unit of the US-made air defense system Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621260-trump-patriots-very-expensive-ukraine-aid/",
    "timestamp": "2025-07-09T20:51:21Z"
  },
  {
    "title": "Another Major Corporation Bends The Knee To Trump",
    "description": "T-Mobile agreed to kill off its Diversity, Equity and Inclusion (DEI) policies, joining Verizon in compliance with the Trump administration. Federal Communications Commission (FCC) Chairman Brendan Carr publicized a letter sent to the FCC on Wednesday. The fi…",
    "link": "https://dailycaller.com/2025/07/09/cellular-provider-bends-knee-trump-admin-dei/",
    "timestamp": "2025-07-09T20:49:59Z"
  },
  {
    "title": "The Supreme Court Decision Undermining Lower Courts Is Worse Than You Think",
    "description": "In Trump v. CASA, this is the legal framework the Supreme Court has set up: When Trump—or any future president—takes flagrantly unlawful actions against us, the only way to stop it is for each and every person affected to file their lawsuit. \nThis will create…",
    "link": "https://msmagazine.com/2025/07/09/supreme-court-dissent-ketanji-brown-jackson-sonia-sotomayor-trump-casa-nationwide-universal-injunctions/",
    "timestamp": "2025-07-09T20:49:35Z"
  },
  {
    "title": "AI Gold Rush: Nvidia Becomes First Company to Hit $4 Trillion Market Cap",
    "description": "Nvidia has reportedly become the first company to hit a $4 trillion market cap after the AI giant's stock jumped on Wednesday.\nThe post AI Gold Rush: Nvidia Becomes First Company to Hit $4 Trillion Market Cap appeared first on Breitbart.",
    "link": "https://www.breitbart.com/tech/2025/07/09/ai-gold-rush-nvidia-becomes-first-company-to-hit-4-trillion-market-cap/",
    "timestamp": "2025-07-09T20:49:31Z"
  },
  {
    "title": "Bitcoin rises to fresh record above $112,000, helped by Nvidia-led tech rally",
    "description": "Bitcoin hit a fresh record on Wednesday afternoon as an Nvidia-led rally in equities helped lift the crypto's price into the stock market close.",
    "link": "https://www.cnbc.com/2025/07/09/crypto-market-today.html",
    "timestamp": "2025-07-09T20:48:04Z"
  },
  {
    "title": "'Deer in headlights': Reporter warns Bondi's 'shaky performances' may doom her",
    "description": "Attorney General Pam Bondi is in trouble, political analysts assessed during a discussion Wednesday. Speaking to MSNBC's Katy Tur about President Donald Trump's Jeffrey Epstein problem, the commentators couldn't help but notice that the MAGA world is starting…",
    "link": "https://www.rawstory.com/pam-bondi-jeffrey-epstein/",
    "timestamp": "2025-07-09T20:47:03Z"
  },
  {
    "title": "Keep your shoes on: What to know about the TSA rule change at US airports",
    "description": "The TSA required travellers to remove their shoes during airport security screenings for nearly two decades.",
    "link": "https://www.aljazeera.com/news/2025/7/9/keep-your-shoes-on-what-to-know-about-the-tsa-rule-change-at-us-airports",
    "timestamp": "2025-07-09T20:46:48Z"
  },
  {
    "title": "AI kingpin Nvidia crowned as first public company with a $4 trillion valuation",
    "description": "Silicon Valley chipmaker Nvidia on Wednesday became the first publicly traded company to surpass a $4 trillion market valuation, putting the latest exclamation point on the investor frenzy surrounding an artificial intelligence boom powered by its industry-le…",
    "link": "https://www.wsbtv.com/news/ai-kingpin-nvidia/U4HZMQ2ZOVAF5BJ2TCVOKQR2Q4/",
    "timestamp": "2025-07-09T20:45:49Z"
  },
  {
    "title": "Trump hits Brazil with 50% tariff, in part due to trial of ally Jair Bolsonaro",
    "description": "President Donald Trump announced Wednesday he planned to hit Brazil with a 50% tariff, in part due to the treatment of its former president and his political ally, Jair Bolsonaro",
    "link": "https://www.nbcnews.com/business/economy/trump-hits-brazil-50-percent-tariff-citing-ex-president-jair-bolsonaro-rcna217859",
    "timestamp": "2025-07-09T20:45:26Z"
  },
  {
    "title": "Trump Ridiculed for Asking to Move a 'Bit Quicker' While Meeting With African Leaders: 'How Rude'",
    "description": "President Donald Trump is being criticized by social media users after telling an African leader to keep their remarks brief during a meeting with multiple leaders, encouraging them to stick to the schedule for the event.",
    "link": "https://www.ibtimes.com/trump-ridiculed-asking-move-bit-quicker-while-meeting-african-leaders-how-rude-3778044",
    "timestamp": "2025-07-09T20:45:19Z"
  },
  {
    "title": "Trump inks another round of tariff letters",
    "description": "WASHINGTON — President Donald Trump sent out tariff letters to seven smaller U.S. trading partners on Wednesday with a pledge to announce import taxes on other countries later in the day.\nNone of the countries targeted in the letters — the Philippines, Brunei…",
    "link": "https://biztoc.com/x/920be6afb637870e",
    "timestamp": "2025-07-09T20:43:42Z"
  },
  {
    "title": "Trump eyes African mineral wealth in trade-focused summit",
    "description": "WASHINGTON: US President Donald Trump hailed West Africa's rich natural resources as he hosted five of its leaders Wednesday (Jul 9) for a White House summit aimed at fostering trade to counter the growing",
    "link": "https://www.channelnewsasia.com/world/trump-eyes-african-mineral-wealth-trade-focused-summit-5230116",
    "timestamp": "2025-07-09T20:43:35Z"
  },
  {
    "title": "Senator Raises Climate Warning Amid Texas Floods and Trump’s Tax Bill",
    "description": "Sheldon Whitehouse will give his 300th floor speech on climate on Wednesday, less than a week after Congress rolled back clean energy incentives.",
    "link": "https://financialpost.com/pmn/business-pmn/senator-raises-climate-warning-amid-texas-floods-and-trumps-tax-bill",
    "timestamp": "2025-07-09T20:42:08Z"
  },
  {
    "title": "OpenAI CEO Sam Altman Slams Democratic Party for Forsaking Capitalism, Innovation: ‘Lost the Plot’",
    "description": "Democrats have “lost the plot” and the party has completely “moved somewhere else,” according to OpenAI CEO Sam Altman, who declared himself “politically homeless” as he blasted the party’s economic vision and ideological shift, accusing the left of turning a…",
    "link": "https://www.breitbart.com/politics/2025/07/09/openai-ceo-sam-altman-slams-democratic-party-for-forsaking-capitalism-innovation-lost-the-plot/",
    "timestamp": "2025-07-09T20:41:20Z"
  },
  {
    "title": "Trump Puts 50% Tariff on Brazils in Retaliation",
    "description": "“President Donald Trump said Wednesday the U.S. will slap a 50% tariff on Brazil's imports, partly in retaliation for the ongoing prosecution of the country's former president, Jair Bolsonaro,” CNBC reports.",
    "link": "https://politicalwire.com/2025/07/09/trump-puts-50-tariff-on-brazils-in-retaliation/",
    "timestamp": "2025-07-09T20:40:16Z"
  },
  {
    "title": "GOP's George Santos says Mike Johnson 'blocked' pardon as he checks into prison",
    "description": "Ousted former Rep. George Santos (R-NY) suggested President Donald Trump was prepared to pardon him, but Speaker Mike Johnson (R-LA) \"blocked\" it after he was sentenced to prison for fraud and identity theft.In a message posted to X on Wednesday, Santos revea…",
    "link": "https://www.rawstory.com/george-santos-2673042413/",
    "timestamp": "2025-07-09T20:40:03Z"
  },
  {
    "title": "Trump Sneaked Huge Gift for Peter Thiel–Backed Company Into Budget",
    "description": "A provision buried deep within Donald Trump’s behemoth budget bill essentially earmarks funds for Anduril, the defense technology company heavily backed by apocalyptic prophet Peter Thiel. The Intercept reported Wednesday that a provision allocating some of t…",
    "link": "https://newrepublic.com/post/197779/donald-trump-peter-thiel-budget-anduril-surveillance",
    "timestamp": "2025-07-09T20:39:54Z"
  },
  {
    "title": "Trump's Tariff Deadline Looms: Latest Updates",
    "description": "Follow along for the latest updates on Donald Trump’s presidency.",
    "link": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e",
    "timestamp": "2025-07-09T20:38:43Z"
  },
  {
    "title": "Trump issues tariff letters to 7 more trading partners as talks with EU continue",
    "description": "Today's letters to seven minor trading partners add to the 14 other tariff rates U.S. President Donald Trump set earlier in the week.",
    "link": "https://www.cbc.ca/news/business/trump-more-tariff-letters-1.7581068",
    "timestamp": "2025-07-09T20:38:11Z"
  },
  {
    "title": "Trump family-backed business votes on making governance token tradable",
    "description": "World Liberty Financial users have until July 16 to cast their votes on a proposal to make WLFI tradable, though the majority seem to be overwhelmingly in favor as of Wednesday.",
    "link": "https://cointelegraph.com/news/world-liberty-financial-voting-governance-token-tradable",
    "timestamp": "2025-07-09T20:36:47Z"
  },
  {
    "title": "Trump reveals more tariffs to be imposed on August 1",
    "description": "US President Donald Trump sends letters to more countries outlining new tariff rates that will come into effect next month unless they agree to new trade deals.",
    "link": "https://www.abc.net.au/news/2025-07-10/donald-trump-reveals-more-tariffs-to-be-imposed-from-august-1/105514620",
    "timestamp": "2025-07-09T20:36:33Z"
  },
  {
    "title": "What we know so far about how federal job cuts could play out",
    "description": "Federal agencies could choose to fire workers en masse or offer options like buyouts. Here's what we know about how and when it could happen.",
    "link": "https://www.businessinsider.com/federal-job-cuts-how-when-firings-could-happen-for-workers-2025-7",
    "timestamp": "2025-07-09T20:35:52Z"
  },
  {
    "title": "Racial Profiling Could Create Mass Backlash to Mass Deportations",
    "description": "ICE isn’t targeting violent criminals, and perhaps not even non-citizens, in its raids and arrests. As mass deportation accelerates, if racial profiling seems to be in play, there could be political hell to pay.",
    "link": "http://nymag.com/intelligencer/article/ice-racial-profiling-mass-backlash-mass-deportations.html",
    "timestamp": "2025-07-09T20:35:44Z"
  },
  {
    "title": "Bishop of major Catholic diocese exempts parishioners from Mass over fears of ICE raids",
    "description": "California Gov. Gavin Newsom pointed to the decree to highlight the Trump administration's aggressive immigration enforcement actions.",
    "link": "https://www.cnbc.com/2025/07/09/trump-catholic-bishop-san-bernadino-mass.html",
    "timestamp": "2025-07-09T20:35:34Z"
  },
  {
    "title": "Man accused of Trump assassination attempt in Florida seeks to remove defense attorneys from case",
    "description": "Prosecutors have said Ryan Routh methodically plotted to kill Trump for weeks.",
    "link": "https://www.bostonherald.com/2025/07/09/trump-shooting-attempt/",
    "timestamp": "2025-07-09T20:35:17Z"
  },
  {
    "title": "Trump Sends Out Tariff Warning Letters to Seven More Nations",
    "description": "WASHINGTON — President Donald Trump issued letters to the leaders of seven nations on Wednesday informing them of the tariff rate goods from their countries will face coming into the United States to correct trade deficits.\nThe post Trump Sends Out Tariff War…",
    "link": "https://www.breitbart.com/politics/2025/07/09/trump-sends-out-tariff-warning-letters-to-seven-more-nations/",
    "timestamp": "2025-07-09T20:34:24Z"
  },
  {
    "title": "Trump inks another round of tariff letters",
    "description": "President Donald Trump sent out tariff letters to seven smaller U.S. trading partners on Wednesday with a pledge to announce import taxes on other countries later in the day.",
    "link": "https://www.bostonherald.com/2025/07/09/trump-inks-another-round-of-tariff-letters/",
    "timestamp": "2025-07-09T20:34:22Z"
  },
  {
    "title": "'Trump was right about everything': Netanyahu went to Washington and all he got was this lousy hat",
    "description": "After the spectacle of a White House dinner, Netanyahu posed with a 'Trump was right about everything' hat – a gesture too on the nose to be humiliating, and yet somehow still was",
    "link": "https://www.haaretz.com/israel-news/haaretz-today/2025-07-09/ty-article/.highlight/netanyahu-went-to-washington-and-all-he-got-was-this-lousy-hat/00000197-f01c-d963-addf-f41d38fd0000",
    "timestamp": "2025-07-09T20:32:58Z"
  },
  {
    "title": "Trump announces 50% tariff on Brazil in retaliation for Bolsonaro trial, trade deficit",
    "description": "President Donald Trump said the U.S. will slap a 50% tariff on Brazil's imports.",
    "link": "https://www.cnbc.com/2025/07/09/trump-brazil-tariffs-bolsonaro.html",
    "timestamp": "2025-07-09T20:32:53Z"
  },
  {
    "title": "Trump Turns Finding Economy’s Most Crucial Leader Federal Reserve Chair into ‘Apprentice’ Remake",
    "description": "President Donald Trump has unleashed on Federal Reserve chair Jerome Powell as an Apprentice-style showdown for a replacement is unfolding in the background.\n“ANYBODY BUT ‘TOO LATE,’” Trump wrote in a post Wednesday morning, using his favored nickname for Pow…",
    "link": "https://biztoc.com/x/82c6df30a61e9a55",
    "timestamp": "2025-07-09T20:32:30Z"
  }
]