[
  {
    "title": "Wall Street hits new highs on U.S.-China trade optimism",
    "description": "Wall Street's major indexes reached record highs on Monday, driven by optimism over a potential U.S.-China trade deal that encouraged…\nThe post Wall Street hits new highs on U.S.-China trade optimism appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/10/27/wall-street-hits-new-highs-on-u-s-china-trade-optimism/",
    "timestamp": "2025-10-27T14:55:26Z"
  },
  {
    "title": "Revvity lifts profit forecast on renewed demand in diagnostics unit",
    "description": "(Reuters) -Medical equipment maker Revvity on Monday raised its annual profit forecast and beat third-quarter estimates on improving U. demand for its...",
    "link": "https://finance.yahoo.com/news/revvity-lifts-profit-forecast-renewed-145509130.html",
    "timestamp": "2025-10-27T14:55:09Z"
  },
  {
    "title": "Trump and Xi to Finalize TikTok Deal This Thursday",
    "description": "Trump and Xi are expected to finalize the TikTok deal this Thursday, transferring US operations to American control.",
    "link": "https://www.androidheadlines.com/2025/10/trump-and-xi-to-finalize-tiktok-deal-this-thursday.html",
    "timestamp": "2025-10-27T14:54:45Z"
  },
  {
    "title": "Fyodor Lukyanov: The road to peace runs through the ruins of Atlanticism",
    "description": "Without addressing NATO’s legacy, no deal on Ukraine will hold Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627019-fyodor-lukyanov-road-to-peace/",
    "timestamp": "2025-10-27T14:54:01Z"
  },
  {
    "title": "Ghislaine Maxwell & George Clooney Allegedly Hooked Up, According to Late Epstein …",
    "description": "Reading Time: 4 minutesAccording to Virginia Giuffre's posthumous memoir, Ghislaine Maxwell boasted about a George Clooney hookup. But did it ever really happen?\nGhislaine Maxwell & George Clooney Allegedly Hooked Up, According to Late Epstein … was originall…",
    "link": "http://www.thehollywoodgossip.com/2025/10/ghislaine-maxwell-george-clooney-alleged-hookup/",
    "timestamp": "2025-10-27T14:53:04Z"
  },
  {
    "title": "Trump to abandon Canada trade talks 'for a while'",
    "description": "Trump is digging in on a feud that could jeopardize diplomatic and trade relations with a top U.S. partner",
    "link": "https://qz.com/trump-shelving-canada-trade-talks",
    "timestamp": "2025-10-27T14:52:59Z"
  },
  {
    "title": "Trump renews talk about seeking a third term: ‘I would love to do it’",
    "description": "Constitutional law prohibits the president from seeking a third term. Donald Trump keeps talking about it anyway.",
    "link": "https://biztoc.com/x/594e1b56ae4e8707",
    "timestamp": "2025-10-27T14:52:35Z"
  },
  {
    "title": "Diddy’s Release Date From Federal Prison Revealed",
    "description": "Combs was sentenced to 50 months in federal prison earlier this month.",
    "link": "https://www.vibe.com/news/entertainment/diddys-release-date-federal-prison-1235134174/",
    "timestamp": "2025-10-27T14:52:23Z"
  },
  {
    "title": "Trump says he 'would love' third term but rules out vice-president run",
    "description": "US President Donald Trump has ruled out running for vice-president in 2028, which some supporters have suggested could see him circumvent a constitutional bar against serving a third term.",
    "link": "https://www.abc.net.au/news/2025-10-28/trump-third-term-rules-out-vice-president-run/105940570",
    "timestamp": "2025-10-27T14:52:17Z"
  },
  {
    "title": "Wall Street’s bull run reaches a make-or-break week as Trump-Xi talks and Fed decisions loom",
    "description": "The S&P 500 has shot up a stunning 37% since hitting a low in April.",
    "link": "https://fortune.com/2025/10/27/wall-street-bull-run-bear-market-fed-rates-decision-trump-xi/",
    "timestamp": "2025-10-27T14:51:28Z"
  },
  {
    "title": "U.S. senator threatens ‘legal jeopardy’ for members of military fighting drug war on behalf of Americans",
    "description": "Is he 'trying to encourage mutiny within the ranks to get service members to refuse orders for fear of prosecution by a future Democrat administration?'",
    "link": "https://www.wnd.com/2025/10/u-s-senator-threatens-legal-jeopardy-members-military/",
    "timestamp": "2025-10-27T14:50:01Z"
  },
  {
    "title": "Boosted by Trump Extortion Threat Over US Bailout Funds, Milei Nabs Win in Argentina Midterms",
    "description": "President Donald Trump on Monday took credit after his political ally, Argentine President Javier Milei, scored a major victory in his country's midterm elections following Trump's decision to bail out the South American country's struggling economy.According…",
    "link": "https://www.commondreams.org/news/trump-argentina-election",
    "timestamp": "2025-10-27T14:48:29Z"
  },
  {
    "title": "Inside the Mamdani Machine: Soros cash, socialists and radical imams engineered Zohran Mamdani’s path to power",
    "description": "In late September 2017, Palestinian American activist Linda Sarsour, once the darling of the Women’s March and the self-declared face of the \"resistance\" against Donald Trump, was facing mounting criticism for antisemitic remarks and her embrace of extremist …",
    "link": "https://freerepublic.com/focus/f-news/4348902/posts",
    "timestamp": "2025-10-27T14:48:21Z"
  },
  {
    "title": "Trump says he had 'perfect' MRI at Walter Reed hospital",
    "description": "During the medical visit earlier this month, Trump's doctor said he was in \"exceptional\" health.",
    "link": "https://www.bbc.com/news/articles/cze6y0y36ppo",
    "timestamp": "2025-10-27T14:48:15Z"
  },
  {
    "title": "Ultra-rich Scott Bessent, who owned a pink mansion, says he’s a ‘soybean farmer’ & the internet mocked him",
    "description": "When Treasury Secretary Scott Bessent told ABC News’s This Week that he “felt the pain” of America’s soybean farmers on Sunday, the claim landed with a thud heard far beyond the Beltway.",
    "link": "https://www.advocate.com/news/scott-bessent-soybean-farmer",
    "timestamp": "2025-10-27T14:48:01Z"
  },
  {
    "title": "Indiana Gov. Mike Braun calls a special session to redraw the state’s congressional boundaries",
    "description": "It’s unclear whether enough of the state's GOP majority Senate will back new maps.",
    "link": "https://www.pbs.org/newshour/politics/indiana-gov-mike-braun-calls-a-special-session-to-redraw-the-states-congressional-boundaries",
    "timestamp": "2025-10-27T14:47:53Z"
  },
  {
    "title": "Dave Matthews Declares \"I Am Antifa\"",
    "description": "Dave Matthews has emerged as a leftist political figure in recent years, protesting Benjamin Netanyahu's US visit and claiming a",
    "link": "https://exclaim.ca/music/article/dave-matthews-declares-i-am-antifa",
    "timestamp": "2025-10-27T14:47:03Z"
  },
  {
    "title": "Lara Trump blasts Swalwell’s ‘ridiculous’ call for 2028 Dems to vow to destroy Trump's White House ballroom",
    "description": "Lara Trump slams Eric Swalwell's 'ridiculous' demand that 2028 Democratic candidates pledge to demolish Trump's $250 million White House ballroom on day one.",
    "link": "https://www.foxnews.com/media/lara-trump-blasts-swalwells-ridiculous-call-2028-dems-vow-destroy-trumps-white-house-ballroom",
    "timestamp": "2025-10-27T14:45:50Z"
  },
  {
    "title": "Argentina's Milei vows more reforms after election win",
    "description": "US President Donald Trump, a close ally, congratulated Milei, whom he said “had a lot of help from us”.",
    "link": "https://www.thejournal.ie/argentina-election-milei-6857651-Oct2025/",
    "timestamp": "2025-10-27T14:45:40Z"
  },
  {
    "title": "Javier Milei's Libertarians Crush the Left in Argentina Midterms",
    "description": "The Liberty Advances Party of Argentina, led by President Javier Milei, secured a decisive and unexpected victory in the country's midterm elections on Sunday, granting the libertarian president a mandate to continue his dismantling of two decades of socialis…",
    "link": "https://www.breitbart.com/latin-america/2025/10/27/javier-mileis-libertarians-crush-the-left-in-argentina-midterms/",
    "timestamp": "2025-10-27T14:44:42Z"
  },
  {
    "title": "Trump Challenges AOC, Jasmine Crocket to IQ Test Competition: ‘Let AOC Go Against Trump’",
    "description": "President Donald Trump told reporters aboard Air Force One on Monday that Reps. Jasmine Crockett (D-TX) and Alexandria Ocasio-Cortez (D-NY) were “low-IQ people,” challenging them to pass the cognitive tests the president took as part of his physical in April.…",
    "link": "https://www.mediaite.com/media/news/trump-challenges-aoc-jasmine-crocket-to-iq-test-competition-let-aoc-go-against-trump/",
    "timestamp": "2025-10-27T14:44:27Z"
  },
  {
    "title": "Trump warns Russia: US has world's greatest nuclear submarine 'right off their shores'",
    "description": "Trump warns Putin that U.S. nuclear submarine is stationed right off Russian shores in response to Moscow's new 8,000-mile range missile test on Sunday.",
    "link": "https://www.foxnews.com/politics/trump-warns-russia-us-has-worlds-greatest-nuclear-submarine-right-off-shores",
    "timestamp": "2025-10-27T14:44:08Z"
  },
  {
    "title": "Trump renews talk about seeking a third term: ‘I would love to do it’",
    "description": "Constitutional law prohibits the president from seeking a third term. Donald Trump keeps talking about it anyway.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-third-term-2028-rcna240020",
    "timestamp": "2025-10-27T14:43:34Z"
  },
  {
    "title": "WATCH: NY Gov. Kathy Hochul Heckled with 'Tax the Rich!' Chants at Mamdani Rally",
    "description": "Supporters of socialist mayoral candidate Zohran Mamdani heckled New York Gov. Kathy Hochul (D) during her appearance at the candidate's rally in Queens on Sunday, video shows.\nThe post WATCH: NY Gov. Kathy Hochul Heckled with ‘Tax the Rich!’ Chants at Mamdan…",
    "link": "https://www.breitbart.com/politics/2025/10/27/watch-ny-gov-kathy-hochul-heckled-with-tax-the-rich-chants-at-mamdani-rally/",
    "timestamp": "2025-10-27T14:43:01Z"
  },
  {
    "title": "Why Traders Should Watch the Bitcoin to Gold Ratio",
    "description": "Bitcoin climbs back near $115K as trade war fears ease, but ETF flows still lag gold—can crypto catch up before Trump meets Xi?",
    "link": "https://decrypt.co/346066/why-traders-should-watch-bitcoin-gold-ratio",
    "timestamp": "2025-10-27T14:42:18Z"
  },
  {
    "title": "BREAKING: John Dickerson Is Departing CBS News",
    "description": "CBS Evening News co-anchor John Dickerson announced that he is departing CBS News on Monday. \"I am extremely grateful,\" wrote Dickerson in a statement.\nThe post BREAKING: John Dickerson Is Departing CBS News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/breaking-john-dickerson-is-departing-cbs-news/",
    "timestamp": "2025-10-27T14:41:46Z"
  },
  {
    "title": "Israel: We will not accept any Turkish troop presence in Gaza, says foreign minister",
    "description": "And Netanyahu hinted a few days ago that he would strongly oppose any role for Turkish security forces in Gaza\nThe post Israel: We will not accept any Turkish troop presence in Gaza, says foreign minister appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/27/israel-we-will-not-accept-any-turkish-troop-presence-in-gaza-says-foreign-minister/",
    "timestamp": "2025-10-27T14:41:37Z"
  },
  {
    "title": "Will Your Donation To Your Alma Mater Remain Tax Deductible?",
    "description": "Marie Sapirie examines the tax implications of the Trump administration’s proposed Compact for Academic Excellence in Higher Education with nine universities.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/10/27/will-your-donation-to-your-alma-mater-remain-tax-deductible/",
    "timestamp": "2025-10-27T14:40:29Z"
  },
  {
    "title": "Ukraine will work on ceasefire plan within next 10 days, Zelenskyy says",
    "description": "The Ukrainian president said Ukraine was asking the US administration not only for Tomahawk missiles but for \"similar things\" that do not require lengthy training before Ukrainian military personnel can use them.",
    "link": "https://news.sky.com/story/ukraine-will-work-on-ceasefire-plan-within-next-10-days-zelenskyy-says-13458893",
    "timestamp": "2025-10-27T14:40:00Z"
  },
  {
    "title": "Leader of top federal worker union calls for end of US government shutdown",
    "description": "Hundreds of thousands of employees remain unpaid as second-longest US shutdown stretches into fourth week",
    "link": "https://www.yahoo.com/news/articles/leader-top-federal-worker-union-143927789.html",
    "timestamp": "2025-10-27T14:39:27Z"
  },
  {
    "title": "US dollar slips as trade optimism boosts risk appetite",
    "description": "dollar weakened against the euro, Chinese yuan and Australian dollar on Monday as optimism over a possible U.-China trade deal boosted risk appetite and...",
    "link": "https://finance.yahoo.com/news/us-dollar-slips-trade-optimism-143925447.html",
    "timestamp": "2025-10-27T14:39:25Z"
  },
  {
    "title": "Trump Answers Whether He Would Run as Vice Presidential Candidate in 2028",
    "description": "Trump answers whether he would run as vice presidential candidate in 2028President hails Vice President JD Vance and Secretary of State Marco Rubio as potential successors while criticizing Democratic opponentsPresident Donald Trump shot down speculation that…",
    "link": "https://freerepublic.com/focus/f-news/4348898/posts",
    "timestamp": "2025-10-27T14:37:44Z"
  },
  {
    "title": "Donald Trump’s MRI revelation renews health speculation",
    "description": "President Donald Trump disclosed that he underwent an MRI during his recent visit to Walter Reed Medical Center, adding a new layer of attention to his health record. The procedure, which took place earlier this month, marked his second medical evaluation thi…",
    "link": "https://rollingout.com/2025/10/27/trumps-mri-renews-health-speculation/",
    "timestamp": "2025-10-27T14:36:40Z"
  },
  {
    "title": "Largest Federal Employee Union Calls On Democrats To End Government Shutdown",
    "description": "Nearly four weeks into the shutdown, hundreds of thousands of workers are furloughed and missing paychecks.",
    "link": "https://www.huffpost.com/entry/government-shutdown-democrats-trump-afge_n_68ff7da8e4b0fb1b951554fa",
    "timestamp": "2025-10-27T14:36:39Z"
  },
  {
    "title": "Did TSA Rely on Controversial “Counter-Extremism” Group to Put Names on a Secret Watchlist?",
    "description": "Sen. Rand Paul is investigating whether George Washington University’s Program on Extremism had an unduly close relationship with the TSA.\nThe post Did TSA Rely on Controversial “Counter-Extremism” Group to Put Names on a Secret Watchlist? appeared first on T…",
    "link": "https://theintercept.com/2025/10/27/rand-paul-tsa-watchlist-gwu-extremism-surveillance/",
    "timestamp": "2025-10-27T14:36:36Z"
  },
  {
    "title": "Makhachev targets Topuria fight at White House",
    "description": "Former UFC lightweight champion Islam Makhachev, if he can win the welterweight title at UFC 322, said he would welcome a fight vs. Ilia Topuria at the White House.",
    "link": "https://www.espn.com/mma/story/_/id/46744961/islam-makhachev-wins-welterweight-title-eyes-ilia-topuria",
    "timestamp": "2025-10-27T14:35:13Z"
  },
  {
    "title": "Is Trump Derangement Syndrome New?",
    "description": "Is Trump Derangement Syndrome New? Or the Latest Expression of a Deep American Divide?In recent years, political hostility toward President Donald J. Trump has been so intense that some label it a form of irrational obsession—Trump Derangement Syndrome (TDS).…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348897/posts",
    "timestamp": "2025-10-27T14:34:33Z"
  },
  {
    "title": "Largest federal employee union demands Congress end shutdown",
    "description": "The American Federation of Government Employees' urged Congress to pass a clean short-term spending bill.",
    "link": "https://www.bbc.com/news/articles/cdjrxm0exz3o",
    "timestamp": "2025-10-27T14:33:50Z"
  },
  {
    "title": "'Face The Nation' Host Accuses Hakeem Jeffries Of Hypocrisy For Using Trump Words",
    "description": "Margaret Brennan's criticism of Jeffries seemed a little forced and perhaps there's a reason.",
    "link": "https://www.huffpost.com/entry/margaret-brennan-hakeem-jeffries-rigged-election-face-nation_n_68ff5db3e4b0049ce5fdba91",
    "timestamp": "2025-10-27T14:33:24Z"
  },
  {
    "title": "Jim Jordan could complicate Trump's demand to be repaid $230 million: legal expert",
    "description": "President Donald Trump’s plan to get the Department of Justice to reimburse him for legal costs and damages, to the tune of $230 million, because he feels he was criminally pursued as part of a bogus investigation could be derailed by one of his biggest suppo…",
    "link": "https://www.rawstory.com/trump-jack-smith-2674236194/",
    "timestamp": "2025-10-27T14:32:50Z"
  },
  {
    "title": "Aubrey O'Day Brings Up Donald Trump Jr. Affair Rumors Again By Calling Him Out Directly",
    "description": "Aubrey O’Day is quote tweeting Donald Trump, Jr., after all those affair allegations she leveled years ago. If you don’t know, the former Danity Kane singer was a contestant on Donald Trump‘s TV series The Celebrity Apprentice back in 2011 and she has claimed…",
    "link": "https://www.justjared.com/2025/10/27/aubrey-oday-brings-up-donald-trump-jr-affair-rumors-again-by-calling-him-out-directly/",
    "timestamp": "2025-10-27T14:31:26Z"
  },
  {
    "title": "Trump Ordains Cabinet Members as Unbeatable Duo for 2028 Presidential Election",
    "description": "President Donald Trump named two members of his Cabinet as an unbeatable duo in the 2028 presidential election. When asked by a reporter on Air... Read More\nThe post Trump Ordains Cabinet Members as Unbeatable Duo for 2028 Presidential Election appeared first…",
    "link": "https://www.dailysignal.com/2025/10/27/trump-ordains-cabinet-members-as-unbeatable-duo-for-2028-presidential-election/",
    "timestamp": "2025-10-27T14:31:24Z"
  },
  {
    "title": "'3 headed monster': Expert reveals how H-1B visa program is crushing American college graduates",
    "description": "Fox News Digital spoke to Skillstorm CEO Justin Vianello about the flaws in the current H1B visa program that must be addressed to benefit the American college graduate.",
    "link": "https://www.foxnews.com/politics/expert-reveals-3-headed-monster-crushing-american-college-graduates-as-trump-makes-strikes-on-h1b-visas",
    "timestamp": "2025-10-27T14:31:04Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "Stock futures are pointing to a sharply higher open this morning after major indexes closed last week at record highs; investor sentiment is getting a boost after President Donald Trump said he was optimistic the U.S. would reach a trade deal with China and a…",
    "link": "https://biztoc.com/x/b56857112eb976c0",
    "timestamp": "2025-10-27T14:30:38Z"
  },
  {
    "title": "Schumer Shutdown Failing While the Memes Keep Coming",
    "description": "The Democrats are losing the Schumer Shutdown and know that because they are being laughed at. It's a real disaster. When people are laughing at you it's a sign that you are losing and the Democrats have lost. Here are some of the videos that people are playi…",
    "link": "https://joehoft.com/schumer-shutdown-failing-while-the-memes-keep-coming/",
    "timestamp": "2025-10-27T14:30:24Z"
  },
  {
    "title": "For Japan’s new leader, the key to connecting with Trump could be a Ford F-150 truck",
    "description": "Japan’s government floated an idea to buy a fleet of Ford F-150 trucks, a meaningful gesture that may also be impractical given the narrow streets in Tokyo and other Japanese cities.",
    "link": "https://www.pbs.org/newshour/world/for-japans-new-leader-the-key-to-connecting-with-trump-could-be-a-ford-f-150-truck",
    "timestamp": "2025-10-27T14:29:45Z"
  },
  {
    "title": "How Trump’s White House Renovation Differs from Truman’s",
    "description": "Both projects attracted public scrutiny and criticism, yet the contrast in approach is telling.",
    "link": "http://foreignpolicy.com/2025/10/27/trump-white-house-renovation-president-truman/",
    "timestamp": "2025-10-27T14:26:57Z"
  },
  {
    "title": "‘Step Off the Tariffs!’ CNN Data Guru Reveals Stunning Shift Against Trump",
    "description": "CNN's Harry Enten discussed the American public's stunning shift against President Donald Trump's tariffs on Monday morning.\nThe post ‘Step Off the Tariffs!’ CNN Data Guru Reveals Stunning Shift Against Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/step-off-the-tariffs-cnn-data-guru-reveals-stunning-shift-against-trump/",
    "timestamp": "2025-10-27T14:25:21Z"
  },
  {
    "title": "Ford's anti-Trump rhetoric came up repeatedly in trade negotiations: sources",
    "description": "Canadian officials may have said they  were caught off guard  last week when U.S. President Donald Trump announced he was cutting off trade negotiations with Canada over Ontario's anti-tariff advertisement, but sources say Premier Doug Ford’s bad cop behaviou…",
    "link": "https://www.cbc.ca/news/politics/ford-trump-talks-9.6954772",
    "timestamp": "2025-10-27T14:25:06Z"
  },
  {
    "title": "Nearly 42 million Americans who use food assistance program could be impacted in days as U.S. shutdown lingers",
    "description": "U.S. states are warning food aid recipients their benefits may not be distributed starting on Nov. 1 if the federal government shutdown stretches into its fourth week.",
    "link": "https://www.cbc.ca/news/world/us-govt-shutdown-snap-benefits-expiration-9.6954590",
    "timestamp": "2025-10-27T14:24:03Z"
  },
  {
    "title": "Rubio claims India ‘interested’ in diversifying oil supply",
    "description": "US Secretary of State Marco Rubio has claimed India has already expressed interest in diversifying crude supplies Read Full Article at RT.com",
    "link": "https://www.rt.com/india/627012-rubio-claims-india-interested-in/",
    "timestamp": "2025-10-27T14:23:03Z"
  },
  {
    "title": "Copper Nears Record as US-China Optimism Adds to Supply Woes",
    "description": "Signs the world’s top two economies are set to reach an accord this week improve the outlook for consumption of the industrial metal at a time of heightened ...",
    "link": "https://finance.yahoo.com/news/copper-nears-record-us-china-142225853.html",
    "timestamp": "2025-10-27T14:22:25Z"
  },
  {
    "title": "Trump Rules Out Running for 3rd Term as VP — But Not as President | Video",
    "description": "\"Am I not ruling it out? I mean, you'll have to tell me,\" Trump told reporters when asked about serving a third term as president\nThe post Trump Rules Out Running for 3rd Term as VP — But Not as President | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-third-term-president-vice-president-comments/",
    "timestamp": "2025-10-27T14:21:47Z"
  },
  {
    "title": "Tariff Costs Are Hitting Automaker Destination Fees",
    "description": "We're looking at how tariffs are showing up in automaker destination fees, as well as the looming threat of our latest chip shortage.",
    "link": "https://www.jalopnik.com/2008223/tariff-cost-hitting-automakers/",
    "timestamp": "2025-10-27T14:20:37Z"
  },
  {
    "title": "Donald Trump Floats Two Potential Successors",
    "description": "President Donald Trump floated two potential candidates to be his successor in 2028 on Monday morning after ruling himself out as vice president.\nSpeaking to reporters on Air Force One as he traveled to Japan, the president suggested that Vice President JD Va…",
    "link": "https://biztoc.com/x/b2824cab4ec612f0",
    "timestamp": "2025-10-27T14:19:48Z"
  },
  {
    "title": "The White House Wades Into the Console Wars, Releases AI Image of Donald Trump as Master Chief Saluting in Front of an American Flag That Contains a Big Mistake",
    "description": "Microsoft’s announcement that Halo: Campaign Evolved is coming to PlayStation is the final nail in the coffin for the Xbox exclusive, and for some marks the end of the console wars. Now, the White House has waded in with an AI image of Donald Trump as a salut…",
    "link": "https://biztoc.com/x/cabbdedd8d6da6bc",
    "timestamp": "2025-10-27T14:19:35Z"
  },
  {
    "title": "After Russia's 'Skyfall' missile test, Trump says the US has a nuclear submarine 'right off their shores'",
    "description": "President Donald Trump said on Monday that the US has a nuclear submarine near Russia.\nUS Coast Guard photo by Petty Officer 1st Class Steve Strohmaier\nPresident Donald Trump said on Monday that the US has a nuclear submarine right off Russia's coast.\nHis com…",
    "link": "https://biztoc.com/x/3d8a8ede331efb80",
    "timestamp": "2025-10-27T14:19:27Z"
  },
  {
    "title": "'I Would Love To': Trump On Possibility Of 2028 US Presidential Run",
    "description": "US President Donald Trump has sparked fresh speculation about his political future after hinting at the possibility of a 2028 presidential run. While ruling out the idea of serving as vice president to extend his time in office, Trump suggested he would “love…",
    "link": "https://www.ndtvprofit.com/world/i-would-love-to-trump-on-possibility-of-2028-us-presidential-run",
    "timestamp": "2025-10-27T14:19:11Z"
  },
  {
    "title": "Maduro’s ‘days are numbered’ – senior US Republican",
    "description": "US Senator Rick Scott has urged Venezuelan leader Nicolas Maduro to flee as Washington expands its military presence in the Caribbean Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627018-maduro-days-numbered-rick-scott/",
    "timestamp": "2025-10-27T14:18:58Z"
  },
  {
    "title": "One man can tell America what Republicans are trying to hide — and now he wants to do so",
    "description": "The mysterious Jack Smith is emerging from the shadows that keep him.The one-time special counsel who was tasked at looking into the worst attack on our Capitol since the War of 1812, has lately indicated he has a reputation to protect, even if thanks to the …",
    "link": "https://www.rawstory.com/raw-investigates/one-man-can-tell-america-what-republicans-are-trying-to-hide-and-now-he-wants-to-do-so/",
    "timestamp": "2025-10-27T14:17:56Z"
  },
  {
    "title": "Trump Names the 2028 Ticket He Thinks Would Be ‘Unstoppable’: ‘I’m Not Sure if Anybody Would Run’ Against Them",
    "description": "As part of an answer to a question about a potential third term, President Trump told reporters that the administration had \"some very good people.\"\nThe post Trump Names the 2028 Ticket He Thinks Would Be ‘Unstoppable’: ‘I’m Not Sure if Anybody Would Run’ Aga…",
    "link": "https://www.mediaite.com/media/news/trump-names-the-2028-ticket-he-thinks-would-be-unstoppable-im-not-sure-if-anybody-would-run-against-them/",
    "timestamp": "2025-10-27T14:17:07Z"
  },
  {
    "title": "After Russia's 'Skyfall' missile test, Trump says the US has a nuclear submarine 'right off their shores'",
    "description": "It's the second time in just a few months the US president has brought up nuclear submarines in response to Russian talk about its weapons.",
    "link": "https://www.businessinsider.com/trump-us-nuclear-submarine-russia-skyfall-missile-test-2025-10",
    "timestamp": "2025-10-27T14:15:51Z"
  },
  {
    "title": "The Tomahawk factor: US long-range missiles are the battlefield gamechanger Putin should fear",
    "description": "Trump has not approved Ukraine's request for Tomahawk cruise missiles, citing year-long training requirements and U.S. military needs despite weapon's 1,500-mile range capability.",
    "link": "https://www.foxnews.com/politics/tomahawk-factor-us-long-range-missiles-battlefield-gamechanger-putin-should-fear",
    "timestamp": "2025-10-27T14:15:31Z"
  },
  {
    "title": "Anxious and disillusioned: being young in Trump’s America",
    "description": "Less than a year into Donald Trump's second term, young voters in Pennsylvania are worried about bitter political divisions. Read more.",
    "link": "https://financialpost.com/financial-times/anxious-disillusioned-young-trump-america",
    "timestamp": "2025-10-27T14:13:39Z"
  },
  {
    "title": "There is such a thing as 'settled science' — anyone who says otherwise is trying to manipulate you",
    "description": "How bad-faith arguments sow doubt by weaponizing scientific humility.",
    "link": "https://www.livescience.com/human-behavior/politics/there-is-such-a-thing-as-settled-science-anyone-who-says-otherwise-is-trying-to-manipulate-you-opinion",
    "timestamp": "2025-10-27T14:13:10Z"
  },
  {
    "title": "Trump dangles prospect of Mar-a-Lago visit for Xi - politico.eu",
    "description": "Trump dangles prospect of Mar-a-Lago visit for Xipolitico.eu Trump’s Asia trip: US and China agree to framework of a trade deal | CNN PoliticsCNN Trump's agenda for Asia trip. And, government shutdown threatens food benefitsNPR Xi Jinping is at his boldest an…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179883532",
    "timestamp": "2025-10-27T14:12:17Z"
  },
  {
    "title": "Why Did President Trump Get an mRNA COVID-19 Shot?",
    "description": "On Oct. 10, President Donald Trump’s physician, Dr. Sean P. Barbabella, announced that after conducting a battery of tests, he found that the president “remains... Read More\nThe post Why Did President Trump Get an mRNA COVID-19 Shot?  appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/10/27/why-did-president-trump-get-an-mrna-covid-19-shot/",
    "timestamp": "2025-10-27T14:11:54Z"
  },
  {
    "title": "Destroy the Metrics, Destroy the Truth",
    "description": "Eric Reinhart\n\n\n\nTrump’s decimation of public health systems isn’t about efficiency, cost-saving, or even ideology. It’s about building a world without truth of the possibility of accountability.\r\n\n\r\n\n\nThe post Destroy the Metrics, Destroy the Truth appeared …",
    "link": "https://www.thenation.com/article/politics/trum-health-misinformation-propaganda/",
    "timestamp": "2025-10-27T14:10:18Z"
  },
  {
    "title": "Indiana Gov. Mike Braun calls special session to consider new congressional map",
    "description": "Indiana's Republican Gov. Mike Braun called a special legislative session to consider redrawing the state's congressional map, though it’s unclear if enough GOP lawmakers would support the redistricting effort.“I am calling a special legislative session to pr…",
    "link": "https://www.nbcnews.com/politics/elections/indiana-gov-mike-braun-calls-special-session-consider-new-congressiona-rcna240021",
    "timestamp": "2025-10-27T14:09:04Z"
  },
  {
    "title": "Videos: Oregon and Portland Authorities Isolate Antifa Stronghold, Begin Dismantling After 140 Days of Chaos",
    "description": "Videos: Oregon and Portland Authorities Isolate Antifa Stronghold, Begin Dismantling After 140 Days of Chaoswesternjournal.com",
    "link": "https://www.westernjournal.com/videos-oregon-portland-authorities-isolate-antifa-stronghold-begin-dismantling-140-days-chaos/",
    "timestamp": "2025-10-27T14:08:51Z"
  },
  {
    "title": "Donald Trump’s week in Asia: can he shift power away from China?",
    "description": "Donald Trump has begun a whistle-stop tour of Asia that will culminate in his first face-to-face meeting with Chinese President Xi Jinping for six years. It is “the most important week of diplomacy” for Trump “since he returned to office”, said The Economist.…",
    "link": "https://biztoc.com/x/db0d11cbf20b3417",
    "timestamp": "2025-10-27T14:08:43Z"
  },
  {
    "title": "Some of Trump's most loyal voters are now feeling the sting of his betrayal",
    "description": "Cattle producers are criticizing the administration's plan to quadruple Argentinian beef imports.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-beef-prices-argentina-ranchers-rcna239566",
    "timestamp": "2025-10-27T14:07:44Z"
  },
  {
    "title": "Copper hits 17-month peak on US-China trade deal optimism",
    "description": "Copper prices hit 17-month highs on Monday as signs of easing trade tensions between the world's two largest economies - China and the U.S. - and hopes for stronger growth and demand spurred buying.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/copper-hits-17-month-peak-on-us-china-trade-deal-optimism/articleshow/124851490.cms",
    "timestamp": "2025-10-27T14:05:10Z"
  },
  {
    "title": "Trump Hammers His Own ICE Goons to Suck Up to Foreign Leader (Will Neal/The Daily Beast)",
    "description": "Will Neal / The Daily Beast:\nTrump Hammers His Own ICE Goons to Suck Up to Foreign Leader  —  RAID ANGER  —  He is slamming ICE over a raid at a U.S. Hyundai plant as he prepares to meet with South Korea's president.  —  President Donald Trump has bizarrely c…",
    "link": "https://www.memeorandum.com/251027/p36",
    "timestamp": "2025-10-27T14:05:01Z"
  },
  {
    "title": "Nasdaq rises 350 points as Big Tech earnings loom",
    "description": "Wall Street kicked off the week with renewed optimism as the Nasdaq Composite Index jumped 1.33 percent in Monday’s premarket trading session. The tech-heavy index climbed approximately 350 points, rising from last week’s close at 25,510 to reach 25,850 befor…",
    "link": "https://rollingout.com/2025/10/27/nasdaq-surges-trade-optimism-tech/",
    "timestamp": "2025-10-27T14:04:50Z"
  },
  {
    "title": "Milei triumphs in Argentine midterm elections closely watched by Washington",
    "description": "Argentina’s libertarian President Javier Milei won decisive victories in key districts in midterm elections Sunday, clinching a crucial vote of confidence that strengthens his ability to carry out his radical free-market experiment with billions of dollars in…",
    "link": "https://www.pbs.org/newshour/world/milei-triumphs-in-argentine-midterm-elections-closely-watched-by-washington",
    "timestamp": "2025-10-27T14:04:36Z"
  },
  {
    "title": "Halo: Combat Evolved remake sparks backlash as fans, devs, and even politicians weigh in — excitement meets skepticism",
    "description": "The long-rumored Halo CE Remake has finally been revealed, showcasing The Silent Cartographer mission rebuilt in Unreal Engine 5. Fans are split between excitement and concern — praising the visuals, mature tone, and attention to nostalgia, while criticizing …",
    "link": "https://www.windowscentral.com/gaming/halo-combat-evolved-remake-sparks-backlash-as-fans-devs-and-even-politicians-weigh-in-excitement-meets-skepticism",
    "timestamp": "2025-10-27T14:04:28Z"
  },
  {
    "title": "Donald Trump Doesn’t Rule Out Running In 2028 For Constitution-Barred Third Term, But Calls A Workaround Bid For VP “Too Cute”",
    "description": "Donald Trump again addressed the idea that he would run for president in 2028, even though the 22nd Amendment of the Constitution prohibits anyone from being elected to the White House more than twice. That hasn’t stopped Trump from brandishing Trump 2028 mer…",
    "link": "http://deadline.com/2025/10/trump-2028-third-term-constitution-1236598605/",
    "timestamp": "2025-10-27T14:04:17Z"
  },
  {
    "title": "Psyops On The Sunday Shows!",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/psyops-on-the-sunday-shows",
    "timestamp": "2025-10-27T14:03:57Z"
  },
  {
    "title": "Trump calls Russia's missile test 'inappropriate' — but is Putin's nuclear-powered weapon actually a threat?",
    "description": "The Burevestnik is a nuclear-powered, nuclear-capable cruise missile announced in 2018 by Russia's Vladimir Putin.",
    "link": "https://www.nbcnews.com/world/russia/russia-burevestnik-missile-trump-putin-test-inappropriate-ukraine-rcna239984",
    "timestamp": "2025-10-27T14:01:57Z"
  },
  {
    "title": "Congress Enjoys Ultra-Luxe Health Care as It Fights to Gut Yours",
    "description": "Congress has ensured its members receive ultra-luxe health care as Republican keep the government closed over stripping it from Americans.",
    "link": "http://www.rollingstone.com/politics/political-commentary/congress-health-care-premium-government-shutdown-1235454008/",
    "timestamp": "2025-10-27T14:00:00Z"
  },
  {
    "title": "Trump Rules Out Meeting With Putin Until Russia Is Ready for Peace",
    "description": "US President Donald Trump said he is not going \"to be wasting my time” by meeting with Russian President Vladimir Putin if the Kremlin leader is not ready to make a deal to end his war on Ukraine. \"You have to know that we're going to make a deal. I'm not goi…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Rules-Out-Meeting-With-Putin-Until-Russia-Is-Ready-for-Peace.html",
    "timestamp": "2025-10-27T14:00:00Z"
  },
  {
    "title": "How Trump's tariff feud with Canada spiraled in 48 hours over an ad featuring Ronald Reagan",
    "description": "A Reagan ad during the World Series triggered Trump to torpedo trade talks with Canada.\nAndrew Harnik/Getty Images; Daniel Shirey/MLB Photos via Getty Images\nThe US-Canada trade conflict erupted over the weekend due to an ad aired by the province of Ontario.\n…",
    "link": "https://biztoc.com/x/bf50910c4360b5d4",
    "timestamp": "2025-10-27T13:58:09Z"
  },
  {
    "title": "Newsome 2028? California’s governor reveals he’ll consider a presidential run",
    "description": "California Gov. Gavin Newsom, a leading Democratic critic of President Donald Trump, says he will consider running for the White House in 2028 after the midterm elections next year.Asked in an interview with “CBS Sunday Morning” whether if would be fair to sa…",
    "link": "https://biztoc.com/x/99ce58a727439b18",
    "timestamp": "2025-10-27T13:57:38Z"
  },
  {
    "title": "US debt set to soar above Italy and Greece after Trump’s ‘big, beautiful bill’",
    "description": "While the European countries have brought their spending under control, the US president’s tax cuts and defence spending will lead to increased borrowing\nDonald Trump is on course to push US debt levels above those of Italy and Greece by the end of the decade…",
    "link": "https://biztoc.com/x/c5771f3a80c0a052",
    "timestamp": "2025-10-27T13:57:29Z"
  },
  {
    "title": "WATCH LIVE: Johnson holds news conference on Day 27 of government shutdown",
    "description": "President Donald Trump and GOP leaders say they’ll consider extending the enhanced tax credits that otherwise expire at year's end — but only after Democrats vote to reopen the government. In the meantime, people enrolled in the plans are already being notifi…",
    "link": "https://biztoc.com/x/9557cae6e1ebacd6",
    "timestamp": "2025-10-27T13:57:19Z"
  },
  {
    "title": "‘Far more popular than you!’ CNN data guru mocks Trump over new polling in Canada feud",
    "description": "Americans now favor Canada to President Donald Trump by a margin of nearly 60 percentage points according to a new poll, a revelation that CNN's Harry Enten promptly ridiculed the president over on Monday.The poll comes amid Trump’s latest spat with Canada ov…",
    "link": "https://www.rawstory.com/trump-2674236199/",
    "timestamp": "2025-10-27T13:56:53Z"
  },
  {
    "title": "DOJ Nabs Anarchist Allegedly Offering $45,000 Hit On Pam Bondi",
    "description": "The Department of Justice has charged a man over a TikTok post that offered $45,000 to anyone who killed Attorney General Pam Bondi.",
    "link": "https://dailycaller.com/2025/10/27/doj-nabs-anarchist-offering-45000-hit-pam-bondi/",
    "timestamp": "2025-10-27T13:56:32Z"
  },
  {
    "title": "Larry and David Ellison Are Building a Pro-Trump Media Behemoth",
    "description": "Donald Trump is about to give Larry Ellison and his son David another present. In July, the Trump administration gifted the mogul Paramount, whose properties include Paramount Studios and CBS, allowing it to merge with the Ellisons’ Skydance, despite antitrus…",
    "link": "https://newrepublic.com/article/202272/larry-david-ellison-paramount-warner-pro-trump-media-behemoth",
    "timestamp": "2025-10-27T13:55:52Z"
  },
  {
    "title": "WATCH LIVE: Johnson holds news conference on Day 27 of government shutdown",
    "description": "President Donald Trump and GOP leaders say they’ll consider extending the enhanced tax credits that otherwise expire at year's end — but only after Democrats vote to reopen the government. In the meantime, people enrolled in the plans are already being notifi…",
    "link": "https://www.pbs.org/newshour/politics/watch-live-johnson-holds-news-conference-on-day-27-of-government-shutdown",
    "timestamp": "2025-10-27T13:54:32Z"
  },
  {
    "title": "US Navy loses fighter jet, helicopter from USS Nimitz in separate incidents, 30 minutes apart",
    "description": "The U.S. Navy lost two aircraft from the USS Nimitz in separate incidents within 30 minutes in the South China Sea.",
    "link": "https://www.wsoctv.com/news/trending/us-navy-loses-fighter-jet-helicopter-uss-nimitz-separate-incidents-30-minutes-apart/3RHLFEZILBCKRDY2KP3B6UN3X4/",
    "timestamp": "2025-10-27T13:54:10Z"
  },
  {
    "title": "How Trump's tariff feud with Canada spiraled in 48 hours over an ad featuring Ronald Reagan",
    "description": "By the weekend, negotiations between Washington and Ottawa were frozen, and President Donald Trump had imposed fresh tariffs.",
    "link": "https://www.businessinsider.com/trump-canada-feud-ronald-reagan-ad-trade-tariff-war-timeline-2025-10",
    "timestamp": "2025-10-27T13:54:10Z"
  },
  {
    "title": "Stocks gain, gold sags on trade deal optimism",
    "description": "LONDON (Reuters) -Global stocks bounced on Monday, while safe-haven gold and bonds retreated, as signs of cooling trade tensions between China and the U...",
    "link": "https://finance.yahoo.com/news/stocks-gain-gold-sags-trade-135109872.html",
    "timestamp": "2025-10-27T13:51:09Z"
  },
  {
    "title": "The problem(s) with Trump embracing funds from a donor to help pay military salaries",
    "description": "If the story about one of Donald Trump's pals paying for military salaries is true, it’s a problem in ways that might not be immediately obvious.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/problems-trump-embracing-funds-donor-help-pay-military-salaries-rcna240010",
    "timestamp": "2025-10-27T13:50:27Z"
  }
]