[
  {
    "title": "Heavy Metal Band Gwar Stages Assassination of Donald Trump, Elon Musk Decapitation at Chicago Concert",
    "description": "The heavy metal rock group Gwar shocked their audience with a graphic depiction of the assassinations of President Donald Trump and Tesla chief Elon Musk at their Chicago show over the weekend.\nThe post Heavy Metal Band Gwar Stages Assassination of Donald Tru…",
    "link": "https://www.breitbart.com/entertainment/2025/09/22/heavy-metal-band-gwar-stages-assassination-of-donald-trump-elon-musk-decapitation-at-chicago-concert/",
    "timestamp": "2025-09-22T17:37:01Z"
  },
  {
    "title": "The White House says it blocked US Steel's decision to stop processing steel at Illinois plant",
    "description": "The White House said Monday that it intervened under the terms of a three-month-old national security agreement with Japan-based Nippon Steel to block a...",
    "link": "https://finance.yahoo.com/news/white-house-says-blocked-us-173637609.html",
    "timestamp": "2025-09-22T17:36:37Z"
  },
  {
    "title": "The White House says it blocked US Steel's decision to stop processing steel at Illinois plant",
    "description": "The White House said Monday that it intervened under the terms of a three-month-old national security agreement with Japan-based Nippon Steel to block a...",
    "link": "https://finance.yahoo.com/news/white-house-says-blocked-us-173637108.html",
    "timestamp": "2025-09-22T17:36:37Z"
  },
  {
    "title": "Top 5 moments from Charlie Kirk memorial: 'Missionary with a noble spirit'",
    "description": "Tens of thousands packed into the State Farm Stadium in Glendale, Arizona, on Sunday to pay their respects to the late conservative political activist Charlie Kirk, whose legacy was marked by his outspoken Christian faith and promotion of the Gospel. Speakers…",
    "link": "https://freerepublic.com/focus/f-news/4342061/posts",
    "timestamp": "2025-09-22T17:36:35Z"
  },
  {
    "title": "‘Deranged hatred’: Dems at county fair advocate death for Trump, find out their fate in a hurry",
    "description": "'Even after the assassination of Charlie Kirk and two attempted assassinations of President Trump, Democrats are still out for blood'",
    "link": "https://www.wnd.com/2025/09/deranged-hatred-dems-county-fair-advocate-death-trump/",
    "timestamp": "2025-09-22T17:36:28Z"
  },
  {
    "title": "Turning Point USA Sees Huge Donations, Chapters Spread After Kirk Killing",
    "description": "One donor has pledged to give $1 million to the conservative organization.",
    "link": "https://www.newsweek.com/turning-point-usa-donations-chapters-spread-charlie-kirk-2133816",
    "timestamp": "2025-09-22T17:35:55Z"
  },
  {
    "title": "Democrats Want Trump Himself to Negotiate Shutdown Deal",
    "description": "They hope the president will see the wisdom of cutting a deal to extend Obamacare subsidies, then force GOP lawmakers to go along.",
    "link": "http://nymag.com/intelligencer/article/democrats-want-trump-himself-to-negotiate-shutdown-deal.html",
    "timestamp": "2025-09-22T17:35:30Z"
  },
  {
    "title": "Trump expected to make announcement related to rise in autism",
    "description": "President Donald Trump will likely announce Monday that use of Tylenol in pregnancy causes autism. He said Tylenol was \"a very big factor\" in autism risk.",
    "link": "https://www.upi.com/Top_News/US/2025/09/22/trump-link-tylenol-use-autism/2961758560814/",
    "timestamp": "2025-09-22T17:34:58Z"
  },
  {
    "title": "Whoopi Goldberg: Trump Doesn't Understand How the First Amendment Works",
    "description": "On Monday, during an appearance on ABC's \"The View,\" co-host Whoopi Goldberg criticized President Donald Trump for not understanding how the First Amendment works.\nThe post Whoopi Goldberg: Trump Doesn’t Understand How the First Amendment Works appeared first…",
    "link": "https://www.breitbart.com/clips/2025/09/22/whoopi-goldberg-trump-doesnt-understand-how-the-first-amendment-works/",
    "timestamp": "2025-09-22T17:34:06Z"
  },
  {
    "title": "Trump administration to link Tylenol use to risk of autism",
    "description": "President Donald Trump plans to announce Monday that using Tylenol during pregnancy could contribute to autism risk and will advise pregnant women only to use it, or generic acetaminophen, for high fevers, two senior administration officials told POLITICO.The…",
    "link": "https://slashdot.org/submission/17340424/trump-administration-to-link-tylenol-use-to-risk-of-autism",
    "timestamp": "2025-09-22T17:33:53Z"
  },
  {
    "title": "Trump to meet global leaders at UN General Assembly",
    "description": "President Donald Trump is set to hold a series of high-stakes meetings at the United Nations this week, beginning with bilateral talks with UN Secretary...",
    "link": "https://www.yahoo.com/news/articles/trump-meet-global-leaders-un-173157513.html",
    "timestamp": "2025-09-22T17:31:57Z"
  },
  {
    "title": "What Did Trump Say About Child Autism? And Is It Actually True?",
    "description": "Trump said that he would make one of the \"biggest\" announcements in American history about autism.",
    "link": "https://www.newsweek.com/donald-trump-child-autism-announcement-2133800",
    "timestamp": "2025-09-22T17:31:02Z"
  },
  {
    "title": "US Mulls Economic Lifeline For Ally Argentina",
    "description": "The US Treasury said Monday it stood ready to \"do what is needed\" to support Argentina's economy, as President Javier Milei battles to calm jittery financial markets.",
    "link": "https://www.ibtimes.com/us-mulls-economic-lifeline-ally-argentina-3784159",
    "timestamp": "2025-09-22T17:30:17Z"
  },
  {
    "title": "Does Tylenol Use during Pregnancy Cause Autism? What the Research Shows",
    "description": "Trump and Robert F. Kennedy, Jr. plan to tie Tylenol use during pregnancy and folate deficiencies to rising autism rates—but the evidence is thin",
    "link": "https://www.scientificamerican.com/article/does-tylenol-use-during-pregnancy-cause-autism-what-the-research-shows/",
    "timestamp": "2025-09-22T17:30:00Z"
  },
  {
    "title": "Fired BLS chief on how the day happened",
    "description": "Erika McEntarfer, the former chief for the Bureau of Labor Statistics made her first public appearance since the abrupt firing. For Bloomberg, Molly Smith reports: On Aug. 1, several hours after he…",
    "link": "https://flowingdata.com/2025/09/22/fired-bls-chief-on-how-the-day-happened/",
    "timestamp": "2025-09-22T17:29:49Z"
  },
  {
    "title": "WH: We will be looking at who is funding Antifa",
    "description": "White House Press Secretary Karoline Leavitt shared on Monday that United States President Donald Trump will be signing the executive order on designating Antifa a \"domestic terrorist organisation ......",
    "link": "https://biztoc.com/x/c55835a4d243d806",
    "timestamp": "2025-09-22T17:29:43Z"
  },
  {
    "title": "Let's return to Virginia's Tangier Island and its tiny, diehard MAGAt community as they continue their inevitable sink into the Chesapeake Bay and their ongoing wait for Donald Trump to save them [Dumbass]",
    "description": "Let's return to Virginia's Tangier Island and its tiny, diehard MAGAt community as they continue their inevitable sink into the Chesapeake Bay and their ongoing wait for Donald Trump to save them",
    "link": "https://www.fark.com/comments/13819602/Lets-return-to-Virginias-Tangier-Island-its-tiny-diehard-MAGAt-community-as-they-continue-their-inevitable-sink-into-Chesapeake-Bay-their-ongoing-wait-for-Donald-Trump-to-save-them",
    "timestamp": "2025-09-22T17:29:37Z"
  },
  {
    "title": "Indian Politicians Are Really, Really Upset Over Trump’s $100,000 Fee On H-1B Visas",
    "description": "Indian government officials have expressed opposition and full-blown outrage over a Trump administration proclamation that hikes the fee for H-1B visas.",
    "link": "https://dailycaller.com/2025/09/22/indians-rage-over-100000-h-1b-visa-fee/",
    "timestamp": "2025-09-22T17:29:28Z"
  },
  {
    "title": "GOP Rep Accuses Trump of Protecting His “Friends” in Epstein Cover-Up",
    "description": "Republicans are turning the heat back up on the Trump administration for its handling of the Epstein files.Kentucky Representative Thomas Massie torched FBI Director Kash Patel over the weekend after he caught the bureau chief off guard on information that Pa…",
    "link": "https://newrepublic.com/post/200750/gop-rep-thomas-massie-donald-trump-kash-patel-epstein-coverup",
    "timestamp": "2025-09-22T17:27:16Z"
  },
  {
    "title": "Trump Set To Sign Off On TikTok ‘Compromise’ Deal Over Algorithm Control",
    "description": "President Trump will sign off on a deal later this week that will give greater control over TikTok’s U.S. algorithm to a consortium of American investors.",
    "link": "https://dailycaller.com/2025/09/22/trump-set-to-sign-off-on-tiktok-compromise-deal-over-algorithm-control/",
    "timestamp": "2025-09-22T17:24:37Z"
  },
  {
    "title": "Oracle will manage TikTok's algorithm for US users under Trump administration deal",
    "description": "Determining next steps for the algorithm, currently owned by the Beijing-based ByteDance, has been one of the most closely watched issues during negotiations over TikTok's future.",
    "link": "https://economictimes.indiatimes.com/tech/technology/oracle-will-manage-tiktoks-algorithm-for-us-users-under-trump-administration-deal/articleshow/124054055.cms",
    "timestamp": "2025-09-22T17:22:18Z"
  },
  {
    "title": "Macron stakes anti-Trump global role with Gaza initiative at UN summit",
    "description": "French President Emmanuel Macron uses the UN General Assembly to position France as an alternative global power, renewing calls for Palestinian state recognition.",
    "link": "https://www.foxnews.com/politics/macron-pushes-gaza-initiative-unga-opens-raising-questions-about-his-motives-rivalry-trump",
    "timestamp": "2025-09-22T17:21:44Z"
  },
  {
    "title": "What We Know and Don't Know About Trump's H-1B Crackdown",
    "description": "The president's Oval Office visa announcement on Friday has required multiple clarifications over the weekend.",
    "link": "https://www.newsweek.com/h1b-visa-fees-before-after-restrictions-100k-trump-2133795",
    "timestamp": "2025-09-22T17:21:17Z"
  },
  {
    "title": "Mamdani cancels appearance in WABC-TV town hall after Jimmy Kimmel suspension",
    "description": "Zohran Mamdani, the Democratic frontrunner in the race for New York City mayor, is pulling out of an upcoming town hall on WABC-TV.",
    "link": "https://www.cbsnews.com/newyork/news/zohran-mamdani-wabc-tv-appearance-jimmy-kimmel/",
    "timestamp": "2025-09-22T17:20:01Z"
  },
  {
    "title": "Here’s what we know about the causes of autism",
    "description": "Autism rates are rising, but that's largely about an expanded definition, more awareness and more screening.",
    "link": "https://www.pbs.org/newshour/health/heres-what-we-know-about-the-causes-of-autism",
    "timestamp": "2025-09-22T17:19:55Z"
  },
  {
    "title": "Trump appointee to Federal Reserve calls for steeper rate cuts",
    "description": "President Donald Trump’s appointee to the Federal Reserve’s Board of Governors said Monday that the central bank’s key interest rate should be much lower than its current 4.1% level, staking out a position far different than his colleagues",
    "link": "https://biztoc.com/x/62180b09d62c38ab",
    "timestamp": "2025-09-22T17:18:45Z"
  },
  {
    "title": "400 Celebrities Sign Letter in Support of Jimmy Kimmel",
    "description": "Jennifer Aniston, Meryl Streep and 400 celebrities signed a letter supporting Jimmy Kimmel after his suspension over controversial comments",
    "link": "https://www.usmagazine.com/entertainment/news/400-celebrities-sign-letter-in-support-of-jimmy-kimmel/#article",
    "timestamp": "2025-09-22T17:18:06Z"
  },
  {
    "title": "‘Is That How We Do It?’: Erika Kirk Reveals If She Will Seek Death Penalty For Husband’s Accused Assassin",
    "description": "Erika Kirk, the widow of the late Charlie Kirk, explained her stance on her husband's accused killer in a recent New York Times (NYT) interview.",
    "link": "https://dailycaller.com/2025/09/22/erika-kirk-charlie-alleged-assassin-death-penalty-new-york-times/",
    "timestamp": "2025-09-22T17:17:59Z"
  },
  {
    "title": "Trump And RFK Jr. To Link Tylenol In Pregnancy To Autism. Here’s What You Need To Know",
    "description": "After Trump mentioned an announcement Monday on an autism cause, medical experts weigh in on whether acetaminophen use during pregnancy is linked to autism risk.",
    "link": "https://www.forbes.com/sites/adairalandry/2025/09/22/tylenol-in-pregnancy-and-autism-risk-here-are-current-recommendations/",
    "timestamp": "2025-09-22T17:17:27Z"
  },
  {
    "title": "Oracle will manage TikTok's algorithm for US users under Trump administration deal",
    "description": "Oracle will manage TikTok's algorithm for US users under Trump administration dealabc13.com",
    "link": "https://abc13.com/post/oracle-will-manage-tiktoks-algorithm-us-users-trump-administration-deal/17866333/",
    "timestamp": "2025-09-22T17:16:29Z"
  },
  {
    "title": "WATCH LIVE: White Houses holds news briefing as Trump prepares to make autism announcement",
    "description": "The event, scheduled for 4 p.m., will be closely watched by scientists and advocates.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-houses-holds-news-briefing-as-trump-prepares-to-make-autism-announcement",
    "timestamp": "2025-09-22T17:16:07Z"
  },
  {
    "title": "Venezuelans in ‘reverse migration’ pushed to new perils in effort to return home",
    "description": "The UN has urged authorities to protect these migrants from criminal networks.",
    "link": "https://www.bostonherald.com/2025/09/22/panama-reverse-migration/",
    "timestamp": "2025-09-22T17:15:58Z"
  },
  {
    "title": "Trump Posts ‘TOP SECRET’ Video of Obese Woman Running With Gun to Mock Venezuelan Threat",
    "description": "President Donald Trump returned to his Truth Social platform Monday with a video of an obese woman running with a gun as he mocked Venezuela's military might.\nThe post Trump Posts ‘TOP SECRET’ Video of Obese Woman Running With Gun to Mock Venezuelan Threat fi…",
    "link": "https://www.mediaite.com/media/news/trump-posts-top-secret-video-of-obese-woman-running-with-gun-to-mock-venezuelan-threat/",
    "timestamp": "2025-09-22T17:15:41Z"
  },
  {
    "title": "Would-be Trump assassin Ryan Routh will call only 3 witnesses in self-represented defense",
    "description": "Routh is representing himself in federal court after being charged with trying kill Trump and is set to present his defense Monday, calling just three witnesses.",
    "link": "https://nypost.com/2025/09/22/us-news/would-be-trump-assassin-to-call-3-witnesses-in-self-represented-defense/",
    "timestamp": "2025-09-22T17:15:05Z"
  },
  {
    "title": "‘No One Silences Us’: Whoopi Goldberg and The View Break Silence on Jimmy Kimmel’s Suspension — Watch Video",
    "description": "Following Jimmy Kimmel’s Wednesday suspension, all eyes were on ABC’s The View the following morning. But the hot topic went unmentioned on Thursday’s broadcast — and again on Friday’s episode, which tapes a day in advance. On Thursday, Federal Communications…",
    "link": "https://tvline.com/news/the-view-jimmy-kimmel-reaction-whoopi-goldberg-video-1235516228/",
    "timestamp": "2025-09-22T17:15:00Z"
  },
  {
    "title": "TGA stresses safety of paracetamol in pregnancy as Australia seeks urgent advice on autism link",
    "description": "The federal government is scrambling for answers after US officials raised concerns about a common pregnancy medication.",
    "link": "https://7news.com.au/news/tga-stresses-safety-of-paracetamol-in-pregnancy-as-australia-seeks-urgent-advice-on-autism-link-c-20107425",
    "timestamp": "2025-09-22T17:12:43Z"
  },
  {
    "title": "Oracle will manage TikTok's algorithm for US users under Trump administration deal",
    "description": "Oracle will manage TikTok's algorithm for US users under Trump administration dealabc11.com",
    "link": "https://abc11.com/post/oracle-will-manage-tiktoks-algorithm-us-users-trump-administration-deal/17866333/",
    "timestamp": "2025-09-22T17:12:14Z"
  },
  {
    "title": "“Arriving at your husband’s funeral like Cody Rhodes”: Erika Kirk gets mocked as fans compare her entrance at Charlie’s memorial to a WWE script",
    "description": "Charlie Kirk's public memorial at State Farm Stadium became a subject of online debate due to its theatrical elements. Erika Kirk's entrance, featuring WWE-style pyrotechnics, drew mockery and comparisons to professional wrestling. Critics questioned the even…",
    "link": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/arriving-at-your-husbands-funeral-like-cody-rhodes-erika-kirk-gets-mocked-as-fans-compare-her-entrance-at-charlies-memorial-to-a-wwe-script/articleshow/124053734.cms",
    "timestamp": "2025-09-22T17:11:27Z"
  },
  {
    "title": "Trump to reveal medical finding he calls ‘answer to autism’ in major announcement",
    "description": "President Donald Trump said he will reveal a major medical finding on autism Monday, after his administration has said that it would seek to understand the cause by September.",
    "link": "https://www.foxnews.com/politics/trump-reveal-medical-finding-he-calls-answer-autism-major-announcement",
    "timestamp": "2025-09-22T17:10:48Z"
  },
  {
    "title": "Podcast: RFK and the rise of 'MAHA'",
    "description": "People can fall down a 'MAHA rabbit hole' after starting off their health journey with good intensions, a New York Times journalist has told Behind the Story.",
    "link": "https://www.rte.ie/news/2025/0922/1534769-podcast-rfk-and-the-rise-of-maha/",
    "timestamp": "2025-09-22T17:10:32Z"
  },
  {
    "title": "‘No one censored us,’ says ‘South Park’ creator Matt Stone of episode delay",
    "description": "When “South Park” announced it was delaying the release of a new episode this week, fans speculated that the comedy series may have been prevented from airing by its network or because of current events that have heightened the political climate.",
    "link": "https://www.bostonherald.com/2025/09/22/south-park-episode-delay-matt-stone-censorship/",
    "timestamp": "2025-09-22T17:08:27Z"
  },
  {
    "title": "Oracle will manage TikTok’s algorithm for US users under Trump administration deal",
    "description": "WASHINGTON — Tech giant Oracle will receive a copy of the algorithm powering TikTok to operate for U.S. users, according to a senior official in President Donald Trump’s administration on Monday.\nDetermining next steps for the algorithm, currently owned by th…",
    "link": "https://biztoc.com/x/48c00153ce7004c8",
    "timestamp": "2025-09-22T17:07:13Z"
  },
  {
    "title": "Elon Musk once vowed to ‘go to war’ for H-1Bs. Now he’s silent on Trump’s $100K fee—and smiling beside him at Charlie Kirk’s funeral",
    "description": "Late last year, Elon Musk inflamed a brutal schism in MAGA-world after promising he would “go to war” to defend the H-1B visa system. Now, as Donald Trump imposes a $100,000 charge on each new application, Musk is quiet — and smiling alongside the president a…",
    "link": "https://biztoc.com/x/94da3b642c660adb",
    "timestamp": "2025-09-22T17:07:11Z"
  },
  {
    "title": "Cartel Boat Obliterated By US Navy With Over 2,000 Pounds Of Cocaine Aboard",
    "description": "A cartel boat obliterated by the U.S. Navy as part of the Trump administration's anti-cartel mission had over 2,000 pounds of cocaine on board",
    "link": "https://dailycaller.com/2025/09/22/cartel-boat-obliterated-by-us-navy-with-over-2000-pounds-of-cocaine-aboard/",
    "timestamp": "2025-09-22T17:03:21Z"
  },
  {
    "title": "Trump backer running for Wisconsin governor followed sexually explicit accounts online",
    "description": "A Republican manufacturer running for governor in Wisconsin as a conservative supporter of “family values” and President Donald Trump followed numerous...",
    "link": "https://www.yahoo.com/news/articles/trump-backer-running-wisconsin-governor-170300664.html",
    "timestamp": "2025-09-22T17:03:00Z"
  },
  {
    "title": "Oracle will manage TikTok's algorithm for US users under Trump administration deal",
    "description": "A senior official in President Donald Trump’s administration says Oracle will receive a copy of TikTok's algorithm to operate for U.S. users",
    "link": "https://abcnews.go.com/Technology/wireStory/oracle-manage-tiktoks-algorithm-us-users-trump-administration-125816420",
    "timestamp": "2025-09-22T17:02:20Z"
  },
  {
    "title": "The Republicans Breaking Ranks with Trump Over Media Suppression",
    "description": "Senators Ted Cruz and Rand Paul and Rep. Don Bacon criticize Trump administration and FCC over Jimmy Kimmel Live!'s suspension.",
    "link": "https://time.com/7319330/republicans-turning-on-trump-kimmel-cruz-paul-bacon/",
    "timestamp": "2025-09-22T17:01:55Z"
  },
  {
    "title": "Venezuelans in 'reverse migration' pushed to new perils in effort to return home",
    "description": "As the boat bounced across choppy Pacific waters, Mariela Gómez and her two children huddled for 17 hours on top of sloshing gas tanks, uncertain of what lay...",
    "link": "https://www.yahoo.com/news/articles/venezuelans-reverse-migration-pushed-perils-170137854.html",
    "timestamp": "2025-09-22T17:01:37Z"
  },
  {
    "title": "Trump 'to link paracetamol use to autism' - here's what the evidence says",
    "description": "Donald Trump is reportedly expected to claim there is a link between the use of paracetamol in pregnancy and the development of autism - but what does the evidence say?",
    "link": "https://news.sky.com/story/donald-trump-to-link-paracetamol-use-to-autism-heres-what-the-evidence-says-13436398",
    "timestamp": "2025-09-22T17:01:00Z"
  },
  {
    "title": "French Media Compare Charlie Kirk Memorial to Nazi Rally, Assassination to 'Reichstag Fire'",
    "description": "The outpouring of emotion by the tens of thousands gathered in Arizona on Sunday to honour the life and legacy of Turning Point USA founder Charlie Kirk was viciously attacked in the French press, with some comparing the memorial to a Nazi rally.\nThe post Fre…",
    "link": "https://www.breitbart.com/europe/2025/09/22/french-media-compare-kirk-memorial-to-nazi-rally-assassination-to-reichstag-fire/",
    "timestamp": "2025-09-22T17:00:12Z"
  },
  {
    "title": "China Is Desperate to Dominate Nuclear Fusion",
    "description": "China has spent up to $13 billion developing fusion energy since 2023 and could commercially replicate star power to generate electricity by 2030, becoming the first nation to master what’s commonly dubbed “the holy grail of energy solutions.” Doing so would …",
    "link": "https://oilprice.com/Energy/Energy-General/China-Is-Desperate-to-Dominate-Nuclear-Fusion.html",
    "timestamp": "2025-09-22T17:00:00Z"
  },
  {
    "title": "Letters: We should be proud of the Black Ferns and the All Blacks - even if they lost",
    "description": "OPINION: We should celebrate the efforts of the Black Ferns and All Blacks.",
    "link": "https://www.nzherald.co.nz/nz/letters-we-should-be-proud-of-the-black-ferns-and-the-all-blacks-even-if-they-lost/KLHMT4HFLJHEXCJMUEQIT6EOAQ/",
    "timestamp": "2025-09-22T17:00:00Z"
  },
  {
    "title": "What is Putin proposing to Trump on nuclear arms?",
    "description": "Russia has proposed extending the New START treaty—the last remaining nuclear arms pact with the United States—by one year, ahead of its scheduled expiry on February 5 next year.",
    "link": "https://www.thehindubusinessline.com/news/world/what-is-putin-proposing-to-trump-on-nuclear-arms/article70081993.ece",
    "timestamp": "2025-09-22T16:59:22Z"
  },
  {
    "title": "Trump-China deal hands TikTok’s U.S. algorithm to Larry Ellison’s Oracle",
    "description": "Trump-China deal hands TikTok’s U.S. algorithm to Larry Ellison's Oracle Contents 1. Oracle takes over algorithm, code, data, and surveillance systems 2. New U.S.-based TikTok venture has Oracle, private equity, and tight restrictions In this post: Trump appr…",
    "link": "https://freerepublic.com/focus/f-news/4342056/posts",
    "timestamp": "2025-09-22T16:58:03Z"
  },
  {
    "title": "Bitcoin may appear alongside gold on central bank balance sheets: Deutsche Bank",
    "description": "Central banks' potential Bitcoin adoption could redefine global reserve strategies, challenging traditional currency dominance and enhancing digital asset legitimacy.\nThe post Bitcoin may appear alongside gold on central bank balance sheets: Deutsche Bank app…",
    "link": "https://cryptobriefing.com/deutsche-bank-central-banks-buy-bitcoin/",
    "timestamp": "2025-09-22T16:57:49Z"
  },
  {
    "title": "How Boards And Executives Can Work Together On AI",
    "description": "Also in the Forbes CEO newsletter: How AI is changing companies, Trump exponentially hikes H-1B visa price, Fed cuts interest rates, FCC accused of threatening speech.",
    "link": "https://www.forbes.com/sites/ceo/2025/09/22/how-boards-and-executives-can-work-together-on-ai/",
    "timestamp": "2025-09-22T16:57:38Z"
  },
  {
    "title": "US says 'all options' on table to help stabilise Argentina's fiscal turmoil",
    "description": "US Treasury Secretary Scott Bessent offers a pledge of support for Donald Trump ally Javier Milei.",
    "link": "https://www.bbc.co.uk/news/articles/czdjrnvp972o",
    "timestamp": "2025-09-22T16:57:12Z"
  },
  {
    "title": "US 'ready' to help with Argentina's fiscal turmoil",
    "description": "US Treasury Secretary Scott Bessent offers a pledge of support for Donald Trump ally Javier Milei.",
    "link": "https://www.bbc.com/news/articles/czdjrnvp972o",
    "timestamp": "2025-09-22T16:57:12Z"
  },
  {
    "title": "Elon Musk once vowed to ‘go to war’ for H-1Bs. Now he’s silent on Trump’s $100K fee—and smiling beside him at Charlie Kirk’s funeral",
    "description": "Musk inflamed a brutal Christmas-time conflict over the visas. Is he trying to win back Trump’s good graces now?",
    "link": "https://fortune.com/2025/09/22/elon-musk-vowed-war-h1b-silent-trump-kirk-funeral/",
    "timestamp": "2025-09-22T16:56:59Z"
  },
  {
    "title": "Trump assassination attempt suspect Ryan Routh questions first witnesses as case nears its final stage",
    "description": "Ryan Routh, the man accused of attempting to assassinate Trump, questioned his first of three witnesses Monday.",
    "link": "https://www.foxnews.com/politics/trump-assassination-attempt-suspect-ryan-routh-questions-first-witnesses-case-nears-its-final-stage",
    "timestamp": "2025-09-22T16:56:44Z"
  },
  {
    "title": "Tony Hawk, Taiwan and a flashlight: Trump assassination attempt suspect’s bizarre defense",
    "description": "Ryan Routh, the man accused of attempting to assassinate Trump, questioned his first of three witnesses Monday.",
    "link": "https://www.foxnews.com/politics/tony-hawk-taiwan-flashlight-trump-assassination-attempt-suspects-bizarre-defense",
    "timestamp": "2025-09-22T16:56:44Z"
  },
  {
    "title": "‘Really illegal’: Trump ups the ante in his radical campaign against the free press",
    "description": "Donald Trump argued that when journalists make a \"great\" story look \"bad,\" he thinks that's \"really illegal.\" The First Amendment suggests otherwise.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/really-illegal-trump-ups-ante-radical-campaign-free-press-rcna232968",
    "timestamp": "2025-09-22T16:55:19Z"
  },
  {
    "title": "Meme-ify Trump's Failures (Brian Beutler/Off Message)",
    "description": "Brian Beutler / Off Message:\nMeme-ify Trump's Failures  —  Make it harder for him to deceive, evade, and rewrite history  —  Here are a few observations I defy anyone to contest:  — In just nine months, Donald Trump has done severe damage to the U.S. economy.…",
    "link": "https://www.memeorandum.com/250922/p63",
    "timestamp": "2025-09-22T16:55:01Z"
  },
  {
    "title": "Jennifer Aniston, Meryl Streep and Tom Hanks join 400 artists to back Jimmy Kimmel against ‘government threats’ | CNN",
    "description": "400 celebrities are backing Jimmy Kimmel and speaking out against “government threats to our freedom of speech” in a new open letter organized by the ACLU.",
    "link": "https://www.cnn.com/2025/09/22/entertainment/kimmel-aniston-streep-hanks",
    "timestamp": "2025-09-22T16:54:25Z"
  },
  {
    "title": "Trump appointee to Federal Reserve calls for steeper rate cuts",
    "description": "President Donald Trump’s appointee to the Federal Reserve’s Board of Governors said Monday that the central bank’s key interest rate should be much lower than its current 4.1% level, staking out a position far different than his colleagues",
    "link": "https://abcnews.go.com/Business/wireStory/trump-appointee-federal-reserve-calls-steeper-rate-cuts-125820346",
    "timestamp": "2025-09-22T16:54:24Z"
  },
  {
    "title": "The Trump administration just can’t stop leaking its chats",
    "description": "Months into an administration that has already suffered several basic security slipups, it's not exactly surprising to see President Donald Trump airing complaints in a public Truth Social post that seemed intended for Pam Bondi's DMs. In the post, Trump dire…",
    "link": "https://www.theverge.com/report/782655/trump-truth-social-pam-bondi-post-government-security",
    "timestamp": "2025-09-22T16:52:51Z"
  },
  {
    "title": "Trump will never change, but Kirk's death shines a path to MAGA's future (Stephen Collinson/CNN)",
    "description": "Stephen Collinson / CNN:\nTrump will never change, but Kirk's death shines a path to MAGA's future  —  President Donald Trump wants the world to understand that Charlie Kirk's killing will not temper him or induce him to mend the country's divides.  —  Kirk's …",
    "link": "https://www.memeorandum.com/250922/p60",
    "timestamp": "2025-09-22T16:50:00Z"
  },
  {
    "title": "Drug-smuggling boat struck by US was carrying more than a ton of suspected cocaine, Dominican Republic says",
    "description": "President Donald Trump has been ordering airstrikes against drug trafficking vessels The Dominican Republic has indicated that a boat targeted by a U.S. airstrike had been ferrying \"approximately 1,000 kilograms of suspected cocaine.\" That figure converts to …",
    "link": "https://freerepublic.com/focus/f-news/4342053/posts",
    "timestamp": "2025-09-22T16:49:43Z"
  },
  {
    "title": "Trump’s new Fed appointee says fewer immigrants should free up more housing and lower rental costs",
    "description": "“It should be clear that my view of appropriate monetary policy diverges from those of other” Fed governors, Stephen Miran said in a speech on Monday.",
    "link": "https://fortune.com/2025/09/22/stephen-miran-tariffs-immigration-older-america-interest-rate-cuts-trump/",
    "timestamp": "2025-09-22T16:48:22Z"
  },
  {
    "title": "Angelina Jolie Turns On America With Blistering Criticism",
    "description": "Angelina Jolie trashed the United States during a press conference at Spain's San Sebastián Film Festival on Sunday.",
    "link": "https://dailycaller.com/2025/09/22/angelina-jolie-america-internationan-spain-san-sebastian-film-festival/",
    "timestamp": "2025-09-22T16:48:18Z"
  },
  {
    "title": "This 65-year-perfect recession predictor just sent Wall Street a grim warning",
    "description": "Recession warning signs to watch: Moody's Analytics model signals a potential US recession within the next year, citing a 48% probability. Declining residential building permits contribute to this concern, while high stock valuations add to the risk. Historic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-recession-warning-signs-to-watch-moodys-analytics-wall-street-sp-500-dow-jones-nasdaq/articleshow/124052134.cms",
    "timestamp": "2025-09-22T16:47:31Z"
  },
  {
    "title": "ROOKE: Trump Won The Battle, But Sen. Warren’s Revealing Interview Shows Democrats Are Coming For Americans’ Top Issue",
    "description": "Sen. Elizabeth Warren opened up about her frustrations with Barack Obama and how the Democratic Party allowed President Trump to win the war for middle America.",
    "link": "https://dailycaller.com/2025/09/22/rooke-trump-democrats-elizabeth-warren-economy-obama-new-york-times-interview/",
    "timestamp": "2025-09-22T16:45:38Z"
  },
  {
    "title": "Trump appointee to Federal Reserve calls for steeper rate cuts",
    "description": "By CHRISTOPHER RUGABER, AP Economics Writer\nWASHINGTON (AP) — President Donald Trump’s appointee to the Federal Reserve’s Board of Governors said Monday that the central bank’s key interest rate should be much lower than its current 4.1% level, staking out a …",
    "link": "https://biztoc.com/x/58e6c6f29734b915",
    "timestamp": "2025-09-22T16:44:29Z"
  },
  {
    "title": "Shell-shocked green movement searches for how to counter Trump",
    "description": "Environmental groups that have watched President Donald Trump shred their climate victories are beset by internal divides, slumping fund-raising and a debate on how to fight back.",
    "link": "https://biztoc.com/x/177c5e33f7bdbba1",
    "timestamp": "2025-09-22T16:44:28Z"
  },
  {
    "title": "Here's everything Trump is changing with H-1B visas",
    "description": "President Donald Trump raised the fee for an H-1B visa to $100,000 on Friday, leaving companies scrambling to respond.",
    "link": "https://biztoc.com/x/d9567c41e1c9222d",
    "timestamp": "2025-09-22T16:44:22Z"
  },
  {
    "title": "‘Not Necessarily a Crime’: CNN Legal Analyst Explains How Tom Homan Could Get Off in Bribery Case",
    "description": "CNN's Elie Honig explained on Monday how Trump Border Czar Tom Homan could get off without a conviction and perhaps even prosecution.\nThe post ‘Not Necessarily a Crime’: CNN Legal Analyst Explains How Tom Homan Could Get Off in Bribery Case first appeared on …",
    "link": "https://www.mediaite.com/media/tv/not-necessarily-a-crime-cnn-legal-analyst-explains-how-tom-homan-could-get-off-in-bribery-case/",
    "timestamp": "2025-09-22T16:43:12Z"
  },
  {
    "title": "Liberal Billionaire-Backed Group Supercharging Global Green Energy Push",
    "description": "A green coalition tied to billionaire-backed outfits is preparing to funnel another $7.5 billion into global projects, according to Reuters.",
    "link": "https://dailycaller.com/2025/09/22/liberal-billionaire-backed-group-supercharging-global-green-energy-push/",
    "timestamp": "2025-09-22T16:42:49Z"
  },
  {
    "title": "Trump Officials Address ICE Barbie Affair Rumors: ‘Worst-Kept Secret in D.C.’",
    "description": "A number of Trump administration officials have spilled the beans on what has long been an open secret in MAGA circles: Kristi Noem and Corey Lewandowski are...",
    "link": "https://www.thedailybeast.com/trump-officials-address-ice-barbie-kristi-noems-affair-rumors-worst-kept-secret-in-dc/",
    "timestamp": "2025-09-22T16:42:33Z"
  },
  {
    "title": "Sarah Ferguson dropped as patron of five charities after email to Epstein emerges",
    "description": "Ferguson allegedly apologised to Epstein in an email after she publicly denounced him.",
    "link": "https://www.thejournal.ie/sarah-ferguson-epstein-email-charities-6823693-Sep2025/",
    "timestamp": "2025-09-22T16:42:01Z"
  },
  {
    "title": "Jeffries: Shameful Supreme Court 'Enabled' Trump to Behave Like a King",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) said Monday on CNN's \"The Situation Room\" that it was shameful the Supreme Court has \"enabled\" President Donald Trump to behave like a king.\nThe post Jeffries: Shameful Supreme Court ‘Enabled’ Trump to Behave Like …",
    "link": "https://www.breitbart.com/clips/2025/09/22/jeffries-shameful-supreme-court-enabled-trump-to-behave-like-a-king/",
    "timestamp": "2025-09-22T16:39:59Z"
  },
  {
    "title": "Prabowo's UN speech marks first Indonesian address in 10 years: Puan",
    "description": "Speaker of Indonesia&#39;s House of Representatives (DPR) Puan Maharani said President Prabowo Subianto&#39;s upcoming speech at the UN General Assembly ...",
    "link": "https://en.antaranews.com/news/381624/prabowos-un-speech-marks-first-indonesian-address-in-10-years-puan",
    "timestamp": "2025-09-22T16:39:00Z"
  },
  {
    "title": "Benjamin Netanyahu says Israel won’t withdraw from Syria buffer zone, calls idea a ‘joke’",
    "description": "Israeli Prime Minister Benjamin Netanyahu dismissed reports that Jerusalem was willing to give up the country’s buffer zone in Syria as part of a potential deal with the new government in Damascus.…",
    "link": "https://nypost.com/2025/09/22/world-news/benjamin-netanyahu-says-israel-wont-withdraw-from-syria-buffer-zone-calls-idea-a-joke/",
    "timestamp": "2025-09-22T16:38:04Z"
  },
  {
    "title": "Trump appointee to Federal Reserve calls for steeper rate cuts",
    "description": "Miran is staking out a position far different than his colleagues.",
    "link": "https://www.bostonherald.com/2025/09/22/federal-reserve-marin/",
    "timestamp": "2025-09-22T16:37:14Z"
  },
  {
    "title": "TOP SECRET: Trump says ‘We caught the Venezuelan Militia in training’",
    "description": "'A very serious threat!'",
    "link": "https://www.wnd.com/2025/09/top-secret-trump-says-we-caught-venezuelan-militia/",
    "timestamp": "2025-09-22T16:37:14Z"
  },
  {
    "title": "‘The View’ co-hosts finally break silence on Jimmy Kimmel suspension: ‘No one silences us’",
    "description": "Whoopi Goldberg and her \"View\" co-hosts blasted ABC’s decision and warning that government pressure cannot dictate who stays on the air.",
    "link": "https://nypost.com/2025/09/22/media/the-view-co-hosts-break-silence-on-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-22T16:36:33Z"
  },
  {
    "title": "Pedophile, 26, jailed for 30 years for raping six-month-old daughter who had to be flown to hospital for life-saving treatment",
    "description": "A Kentucky man was sentenced to 30 years in prison for the horrific rape of his six-month-old daughter. Mykill Puckett, 26, pleaded guilty to raping his infant daughter in Webster County after he was arrested for the vile act in August 2023, the Kentucky Atto…",
    "link": "https://freerepublic.com/focus/f-chat/4342050/posts",
    "timestamp": "2025-09-22T16:36:19Z"
  },
  {
    "title": "Zohran Mamdani Cancels ABC Town Hall Appearance Over Kimmel Suspension",
    "description": "\"We simply cannot accept any capitulation to Donald Trump’s attacks on our fundamental freedoms,\" the Democratic nominee said.",
    "link": "https://www.huffpost.com/entry/zohran-mamdani-town-hall-kimmel-suspension_n_68d1697be4b03c190c2157bd",
    "timestamp": "2025-09-22T16:35:35Z"
  },
  {
    "title": "Multiple charities cut ties with Duchess of York over email to Epstein",
    "description": "The decisions came after British media reported that the Duchess had described the disgraced financier as a \"steadfast, generous and supreme friend\" in a 2011 letter.",
    "link": "https://www.abc.net.au/news/2025-09-23/uk-charity-dumps-sarah-duchess-of-york-epstein/105804606",
    "timestamp": "2025-09-22T16:34:57Z"
  },
  {
    "title": "Elon Musk on why Charlie Kirk was killed: ‘because he showed people’ - The Times of India",
    "description": "Elon Musk on why Charlie Kirk was killed: ‘because he showed people’The Times of India Charlie Kirk desperately wanted Elon Musk and Donald Trump back together. He succeededCNN Watch: Prayer, tears and a Trump-Musk handshake at Kirk memorialBBC Trump and Musk…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179463230",
    "timestamp": "2025-09-22T16:33:43Z"
  },
  {
    "title": "Trump’s deal will fundamentally change the TikTok For You algorithm going forward, social media expert says. Here’s how",
    "description": "President Donald Trump announced on Sept. 19, 2025, a preliminary agreement for the sale of a majority stake in TikTok from Chinese tech giant ByteDance to a group of U.S. investors following Trump’s negotiation with Chinese leader Xi Jinping.\nThe deal would …",
    "link": "https://biztoc.com/x/ab8ed2e6c3dd6bf1",
    "timestamp": "2025-09-22T16:33:27Z"
  },
  {
    "title": "Donald Trump and Elon Musk Reconnected at Charlie Kirk’s Funeral",
    "description": "Donald Trump and Elon Musk reconnected for the first time in months at Charlie Kirk’s memorial service. The president later told reporters that their reunion was ‘nice.’",
    "link": "http://www.thecut.com/article/donald-trump-elon-musk-charlie-kirk-funeral.html",
    "timestamp": "2025-09-22T16:33:15Z"
  },
  {
    "title": "From Kirk To Kimmel: America’s Free Speech Crisis",
    "description": "The past few weeks have been nothing short of tragic. The assassination of Charlie Kirk shocked the nation, not just for its violence, but for what it represented. Kirk, whatever one thought of his politics, was exercising his right to free speech. Silencing …",
    "link": "https://crooksandliars.com/2025/09/kirk-kimmel-america-s-free-speech-crisis",
    "timestamp": "2025-09-22T16:32:34Z"
  },
  {
    "title": "Easton nurse faces backlash, threats over Charlie Kirk comment, FB post says",
    "description": "An Easton Area High School nurse has been asked to stay home from work and now faces death threats after making a controversial comment about Charlie Kirk‘s death, according to a supporter of the nurse. Meanwhile, opponents of nurse Kelly Keegan are planning …",
    "link": "https://freerepublic.com/focus/f-chat/4342048/posts",
    "timestamp": "2025-09-22T16:32:18Z"
  }
]