[
  {
    "title": "Trump repeals America’s first-ever tax on greenhouse gases before it goes into effect",
    "description": "In late February, Republicans in the House and Senate voted along party lines to repeal a Biden-era rule implementing a federal tax on methane pollution. President Donald Trump signed the measure into law on Friday — putting the country’s climate goals furthe…",
    "link": "https://www.rawstory.com/trump-repeals-americas-first-ever-tax-on-greenhouse-gases-before-it-goes-into-effect/",
    "timestamp": "2025-03-17T17:13:56Z"
  },
  {
    "title": "Big all-important Trump-Putin phone call to take place on Tuesday; here's what could happen after that",
    "description": "US President Donald Trump will hold the much anticipated telephonic conversation with Russian state head Vladimir Putin. Here are details of key talking points and the possible impact in the aftermath.",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-all-important-trump-putin-phone-call-to-take-place-on-tuesday-heres-what-could-happen-after-that/articleshow/119126194.cms",
    "timestamp": "2025-03-17T17:13:43Z"
  },
  {
    "title": "TikTok becomes a tool of choice in cat-and-mouse game between migrant smugglers and authorities",
    "description": "It's a far cry from the old days when each village had its trusted smuggler.",
    "link": "https://www.bostonherald.com/2025/03/17/tiktok-migration-mexico-us/",
    "timestamp": "2025-03-17T17:13:29Z"
  },
  {
    "title": "Scientist whose work led FDA to ban food dye says agency overstated risk",
    "description": "The dye was approved for use in foods in the U.S. in 1907.",
    "link": "https://www.bostonherald.com/2025/03/17/red-dye-risk/",
    "timestamp": "2025-03-17T17:13:27Z"
  },
  {
    "title": "Dropkick Murphys Slam Fan Waving ‘True Nazi Edition’ MAGA Hat During Show: ‘Shut the F-ck Up’",
    "description": "After frontman Ken Casey spotted an attendee holding up the all-black MAGA hat popularized by Elon Musk, he compared the allegiance to a cult and said: “This is America, there’s no kings here\"",
    "link": "http://www.rollingstone.com/music/music-news/dropkick-murphys-slam-fan-maga-hat-boston-concert-1235297775/",
    "timestamp": "2025-03-17T17:12:54Z"
  },
  {
    "title": "Italy, Spain not ready to back EU plan to boost Ukraine military aid",
    "description": "BRUSSELS (Reuters) - Italy and Spain made clear on Monday they were not ready to back a European Union proposal to pledge up to 40 billion euros ($43.67 billion) in military aid for Ukraine this year, with each country contributing according to the size of it…",
    "link": "https://www.thestar.com.my/news/world/2025/03/18/italy-spain-not-ready-to-back-eu-plan-to-boost-ukraine-military-aid",
    "timestamp": "2025-03-17T17:12:00Z"
  },
  {
    "title": "Funding Disruptions Are a Systemic Failure – Philanthropy Must Do What’s Right and Support Local Leadership",
    "description": "The slashing of US aid funding by Donald Trump and Elon Musk, and cuts or planned cuts in international support by several European states, threaten to cut off the oxygen supply to a civil society already in a critical condition. At CIVICUS, the global civil …",
    "link": "https://www.ipsnews.net/2025/03/funding-disruptions-systemic-failure-philanthropy-must-whats-right-support-local-leadership/",
    "timestamp": "2025-03-17T17:11:14Z"
  },
  {
    "title": "Trump Declares Biden's Pardons of January 6 Committee 'Void, Vacant' Due to Autopen",
    "description": "President Donald Trump says that former President Joe Biden's preemptive pardons for members of the January 6 Committee are \"void, vacant, and of no further force or effect,\" citing the pardons having been given via an autopen.\nThe post Trump Declares Biden’s…",
    "link": "https://www.breitbart.com/politics/2025/03/17/trump-declares-bidens-pardons-of-january-6-committee-void-vacant-due-to-autopen/",
    "timestamp": "2025-03-17T17:10:51Z"
  },
  {
    "title": "From powerhouse to uncertainty: Once seen as unstoppable, the U.S. economy loses its edge as tariffs, job cuts, and investor fears shake confidence",
    "description": "The American economy is showing signs of vulnerability with declining investor confidence due to uncertain trade policies and government instability under Donald Trump's administration. The initial optimism has faded, and new tariffs are causing confusion and…",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-powerhouse-to-uncertainty-once-seen-as-unstoppable-the-u-s-economy-loses-its-edge-as-tariffs-job-cuts-and-investor-fears-shake-confidence/articleshow/119124762.cms",
    "timestamp": "2025-03-17T17:10:50Z"
  },
  {
    "title": "‘Ridiculous’: Trump Slams Federal Judge’s ‘Dangerous’ Ruling on Fired Federal Workers",
    "description": "President Donald Trump said it’s “ridiculous” that a federal judge ruled that the government must rehire fired government employees.   “I don’t think that’s going to... Read More\nThe post ‘Ridiculous’: Trump Slams Federal Judge’s ‘Dangerous’ Ruling on Fired F…",
    "link": "https://www.dailysignal.com/2025/03/17/ridiculous-trump-slams-federal-judges-dangerous-ruling-fired-federal-workers/",
    "timestamp": "2025-03-17T17:10:50Z"
  },
  {
    "title": "Autopen explained: The device former US President Joe Biden allegedly used to sign pardons",
    "description": "President Donald Trump has claimed all pardons signed by Joe Biden are invalid, arguing that they were executed using an autopen. The use of mechanical devices for signing has been common with past presidents, but Trump insists this undermines the legitimacy …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/autopen-explained-the-device-former-us-president-joe-biden-allegedly-used-to-sign-pardons/articleshow/119126054.cms",
    "timestamp": "2025-03-17T17:09:29Z"
  },
  {
    "title": "US, Israel in ‘Secret Talks’ with African States to Take In Forcibly Expelled Palestinians: Report",
    "description": "The US and Israel have been making contacts with African states to discuss the potential resettlement of Palestinians from Gaza to their territories, according to an AP report released on 14 March. \nThe US-Israeli contacts with Sudan, Somalia, and Somaliland …",
    "link": "https://www.globalresearch.ca/us-israel-secret-talks-african-states-take-expelled-palestinians/5882134",
    "timestamp": "2025-03-17T17:08:40Z"
  },
  {
    "title": "Watch: Astronauts Stranded by Boeing and Biden Express Gratitude to Elon Musk and President Trump",
    "description": "In a viral video shared by both President Donald Trump and SpaceX founder Elon Musk, NASA astronauts Sunita Williams and Butch Wilmore, who are being rescued by a SpaceX mission after being stranded at the International Space Station (ISS) by Boeing and Joe B…",
    "link": "https://www.breitbart.com/tech/2025/03/17/watch-astronauts-stranded-by-boeing-and-biden-express-gratitude-to-elon-musk-and-president-trump/",
    "timestamp": "2025-03-17T17:08:30Z"
  },
  {
    "title": "Trump administration can, for now, enforce orders targeting DEI, appeals court says",
    "description": "A federal appeals court said Friday the Trump administration can, for now, enforce two executive orders that target diversity, equity and inclusion efforts within the federal government.",
    "link": "https://www.abajournal.com/news/article/trump-administration-can-enforce-orders-targeting-dei-appeals-court-says",
    "timestamp": "2025-03-17T17:07:00Z"
  },
  {
    "title": "King hosts Carney at Buckingham Palace",
    "description": "Canada's new PM meets King Charles at Buckingham Palace, before talks with UK PM Starmer.",
    "link": "https://www.bbc.com/news/videos/cq5z95095ygo",
    "timestamp": "2025-03-17T17:06:54Z"
  },
  {
    "title": "Putin, Trump to discuss Ukraine Tuesday",
    "description": "Russian President Vladimir Putin and U.S. counterpart Donald Trump will speak by phone on Tuesday, as one U.S. official expressed hope the two could agree a Ukraine ceasefire within weeks.",
    "link": "https://www.hurriyetdailynews.com/putin-trump-to-discuss-ukraine-tuesday-207007",
    "timestamp": "2025-03-17T17:06:24Z"
  },
  {
    "title": "IRGC Vows 'Decisive' Response To Any Threat After Trump Bombs Yemen Twice",
    "description": "IRGC Vows 'Decisive' Response To Any Threat After Trump Bombs Yemen Twice\n \nIran has responded to weekend warnings and threats issued by US President Donald Trump, who ordered two waves of weekend airstrikes against its proxy in Yemen, the Houthis (Ansarallah…",
    "link": "https://biztoc.com/x/c620ab2f8a0f4717",
    "timestamp": "2025-03-17T17:05:17Z"
  },
  {
    "title": "Forever 21 Bankruptcy: US Stores Closing as Chain Goes Out of Business",
    "description": "Forever 21 is shutting down after filing for bankruptcy, citing intense competition from global fast-fashion brands.",
    "link": "https://www.newsweek.com/forever-21-bankruptcy-stores-closing-sale-2046025",
    "timestamp": "2025-03-17T17:04:37Z"
  },
  {
    "title": "We’ve Officially Entered the Next Phase of Trump’s Dictatorship Era",
    "description": "Taken together, these actions and declarations amount to a significant escalation in Trump’s transformation of his own presidency into an autocracy.",
    "link": "https://slate.com/news-and-politics/2025/03/king-donald-trump-dictatorship-deportations-court-orders.html",
    "timestamp": "2025-03-17T17:04:30Z"
  },
  {
    "title": "Legal Battle Pits Bay Area Counties Against Trump Administration Over Sanctuary Policies",
    "description": "San Francisco and Santa Clara counties are leading a suit over Trump’s expanded order to strip federal funding.",
    "link": "https://www.kqed.org/news/12031565/legal-battle-pits-bay-area-counties-against-trump-administration-over-sanctuary-policies",
    "timestamp": "2025-03-17T17:02:58Z"
  },
  {
    "title": "How controversial deportation flights and a judge’s race to stop them unfolded, minute by minute | CNN Politics",
    "description": "Over the weekend, the Trump administration invoked wartime powers to deport hundreds of people from the US to El Salvador. After a lawsuit was filed, a federal judge ordered the administration to stop the deportations, for now. Here’s a timeline of where the …",
    "link": "https://www.cnn.com/2025/03/17/politics/deportation-flights-judge-timeline/index.html",
    "timestamp": "2025-03-17T17:01:27Z"
  },
  {
    "title": "From France comes a call for Trump’s America to return Lady Liberty. Here’s why it won’t happen",
    "description": "A French politician is arguing for the Statue of Liberty's return to France.",
    "link": "https://www.bostonherald.com/2025/03/17/france-statue-of-liberty-return/",
    "timestamp": "2025-03-17T17:01:06Z"
  },
  {
    "title": "Qatar to Supply Natural Gas to Syria via Arab Pipeline",
    "description": "Almost exactly 12 years ago, we explained that the sequence of events that would define the face of the Middle East, and spark one of the bloodiest conflicts in the region in ages, namely the relentless proxy war seeking control over Syria, was prompted by no…",
    "link": "https://oilprice.com/Energy/Natural-Gas/Qatar-to-Supply-Natural-Gas-to-Syria-via-Arab-Pipeline.html",
    "timestamp": "2025-03-17T17:00:00Z"
  },
  {
    "title": "Trump Wipes Out NCES in Department of Education",
    "description": "Trump or Musk or a bunch of kids who work for DOGE decided that the U.S. doesn’t need to collect statistics or conduct research about the condition of education. So they wiped out the National Center for Education Statistics at the U.S. Department of Educatio…",
    "link": "https://dianeravitch.net/2025/03/17/trump-wipes-out-nces-in-department-of-education/",
    "timestamp": "2025-03-17T17:00:00Z"
  },
  {
    "title": "Kiev has come to terms with ceding territory – Independent",
    "description": "Ukrainian officials are reportedly ready to freeze the battle lines, but consider giving away additional lands a red line Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614358-ukraine-agrees-ceding-territory/",
    "timestamp": "2025-03-17T16:59:32Z"
  },
  {
    "title": "Trump applauds Jeff Bezos' changes at Washington Post in rare media praise",
    "description": "President Donald Trump said Sunday that Washington Post owner Jeff Bezos was trying to a \"real job\" with the paper and said he's gotten to know the Amazon founder.",
    "link": "https://www.foxnews.com/media/trump-applauds-jeff-bezos-changes-washington-post-rare-media-praise",
    "timestamp": "2025-03-17T16:57:00Z"
  },
  {
    "title": "Trump Issues Stark Warning to Iran Over Houthi Attacks, Threatens ‘Dire Consequences’",
    "description": "In a strongly-worded statement issued Monday, President Donald Trump warned Iran would face severe consequences for its role in Houthi attacks in the Red Sea region. “Every shot fired by...",
    "link": "https://gcaptain.com/trump-issues-stark-warning-to-iran-over-houthi-attacks-threatens-dire-consequences/",
    "timestamp": "2025-03-17T16:56:26Z"
  },
  {
    "title": "Scientists say NIH officials told them to scrub mRNA references on grants",
    "description": "The mRNA technology is under study for prevention and treatment of infectious diseases and cancer.",
    "link": "https://www.bostonherald.com/2025/03/17/nih-grants-mrna-vaccine-technology/",
    "timestamp": "2025-03-17T16:56:23Z"
  },
  {
    "title": "The Joint Attack on Campus Protesters Threatens America’s Core Values",
    "description": "The combined efforts of President Donald Trump, Republicans in Congress, and pro-Israel groups, like the Anti-Defamation League, have declared war on the liberal ideals of freedom of speech and assembly and the very idea of the university. Republicans and the…",
    "link": "https://www.commondreams.org/opinion/trump-attack-campus-speech",
    "timestamp": "2025-03-17T16:55:18Z"
  },
  {
    "title": "U.S. consumers keep the economy afloat as businesses scramble on tariffs",
    "description": "The U.S. consumer is holding up pretty well even as businesses scramble to adjust to Donald Trump’s trade war, economic indicators are showing. This is helping to support stock prices — especially on days when the president doesn’t mention tariffs.Read more...",
    "link": "https://qz.com/us-consumers-spending-trump-trade-war-1851770445",
    "timestamp": "2025-03-17T16:55:00Z"
  },
  {
    "title": "Treasury Secretary Bessent Rips Into Mike Pence.",
    "description": "Treasury Secretary Scott Bessent ripped into former Vice President Mike Pence during a recent interview. While outlining President Donald J. Trump’s tariff plan, Bessent hit back at Pence’s criticisms of using the trade levies.Bessent detailed President Trump…",
    "link": "https://freerepublic.com/focus/f-news/4304851/posts",
    "timestamp": "2025-03-17T16:54:35Z"
  },
  {
    "title": "Fani Willis to Release Documents on Trump Case to Georgia Republicans",
    "description": "Fulton County District Attorney Fani Willis said she will release documents related to her investigation of President Donald Trump.",
    "link": "https://biztoc.com/x/ec171f2e09da2419",
    "timestamp": "2025-03-17T16:54:10Z"
  },
  {
    "title": "Trump Attacked Biden's 'Crazy' Yemen War. Now He's Reopening It",
    "description": "Candidate Donald Trump thought that bombing Yemen was \"just a failed mentality\" when then-President Joe Biden did it. \"It's crazy. You can solve problems over the telephone. Instead, they start dropping bombs. I see, recently, they're dropping bombs all over …",
    "link": "https://biztoc.com/x/f7683e215fdbe9d1",
    "timestamp": "2025-03-17T16:54:05Z"
  },
  {
    "title": "Putin and Trump to talk with proposed Russia-Ukraine truce in balance",
    "description": "US President Donald Trump is trying to win Russian President Vladimir Putin's support for a 30-day ceasefire.",
    "link": "https://www.aljazeera.com/news/2025/3/17/putin-and-trump-to-talk-with-proposed-russia-ukraine-truce-in-balance",
    "timestamp": "2025-03-17T16:51:20Z"
  },
  {
    "title": "Watch Live as Starliner Astronauts Finally Return Home After Being Stuck in Space for 9 Months",
    "description": "The Starliner crew was originally meant to stay on board the ISS for a week, but issues with Boeing's Starliner spacecraft severely delayed their return to Earth.",
    "link": "https://gizmodo.com/watch-live-as-starliner-astronauts-hitch-a-ride-home-after-being-stuck-in-space-for-9-months-2000576814",
    "timestamp": "2025-03-17T16:50:07Z"
  },
  {
    "title": "‘Sorry, Elon’: The New York Post Rebukes ‘Way Out of His Lane’ Musk for Attacks on Judge Who Ordered Halt to Deportation Flights",
    "description": "The New York Post rebuked Elon Musk over his call for the impeachment of a judge who ordered the Trump admin to temporarily halt deportation flights.\nThe post ‘Sorry, Elon’: The New York Post Rebukes ‘Way Out of His Lane’ Musk for Attacks on Judge Who Ordered…",
    "link": "https://www.mediaite.com/news/sorry-elon-the-new-york-post-rebukes-way-out-of-his-lane-musk-for-attacks-on-judge-who-ordered-halt-to-deportation-flights/",
    "timestamp": "2025-03-17T16:49:36Z"
  },
  {
    "title": "French Request To Return Statue of Liberty Sparks MAGA Fury: 'Come Get It!'",
    "description": "Politician Raphael Glucksmann suggested recent Trump policies do not align with the gift's values, saying: \"Give us back the Statue of Liberty!\"",
    "link": "https://www.newsweek.com/france-statue-liberty-back-return-trump-2045923",
    "timestamp": "2025-03-17T16:49:31Z"
  },
  {
    "title": "‘What About Six Years of Friendship and Fighting Together?’",
    "description": "The stain of betrayal in Afghanistan is now on Republican hands.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/03/trump-travel-ban-afghanistan/682066/",
    "timestamp": "2025-03-17T16:49:18Z"
  },
  {
    "title": "Democratic voters’ attitudes on partisan compromise undergo a dramatic shift",
    "description": "For many years, the Democratic base expected the party to compromise. Those expectations have changed dramatically, and it’s worth understanding why.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/democratic-voters-attitudes-partisan-compromise-undergo-dramatic-shift-rcna196742",
    "timestamp": "2025-03-17T16:48:49Z"
  },
  {
    "title": "Fani Willis to Release Documents on Trump Case to Georgia Republicans",
    "description": "Fulton County District Attorney Fani Willis said she will release documents related to her investigation of President Donald Trump.",
    "link": "https://www.newsweek.com/fani-willis-donald-trump-documents-georgia-republicans-2045963",
    "timestamp": "2025-03-17T16:48:46Z"
  },
  {
    "title": "Trump Attacked Biden's 'Crazy' Yemen War. Now He's Reopening It.",
    "description": "The U.S. is back to bombing the Houthi movement.",
    "link": "https://reason.com/2025/03/17/trump-attacked-bidens-crazy-yemen-war-now-hes-reopening-it/",
    "timestamp": "2025-03-17T16:47:35Z"
  },
  {
    "title": "Chow releases city's plan to help Toronto handle U.S. tariffs",
    "description": "Toronto Mayor Olivia Chow has unveiled the city’s plan to help local businesses and workers get through Canada’s trade war with the U.S.",
    "link": "https://www.cbc.ca/news/canada/toronto/toronto-us-tariff-action-plan-1.7485648",
    "timestamp": "2025-03-17T16:47:24Z"
  },
  {
    "title": "Fox’s Jacqui Heinrich Calls Trump Out Over White House Tesla ‘Display’ To ‘Boost Stock’",
    "description": "Jacqui Heinrich called out Trump for a Tesla \"display\" at the White House, calling it \"an attempt to boost\" Tesla's stock and asking  if it was \"appropriate.\"\nThe post Fox’s Jacqui Heinrich Calls Trump Out Over White House Tesla ‘Display’ To ‘Boost Stock’ fir…",
    "link": "https://www.mediaite.com/news/foxs-jacqui-heinrich-calls-trump-out-over-white-house-tesla-display-to-boost-stock/",
    "timestamp": "2025-03-17T16:46:12Z"
  },
  {
    "title": "Europe Economy\nWe ‘must act’: Europe retaliates against Trump’s 25% tariffs on steel and aluminum imports",
    "description": "The European Union has reacted swiftly to U.S. President Donald Trump’s 25% tariffs on steel and aluminum imports that came into effect Wednesday, retaliating with its own punitive countermeasures that it said were needed to protect consumers and businesses. …",
    "link": "https://freerepublic.com/focus/f-news/4304850/posts",
    "timestamp": "2025-03-17T16:45:48Z"
  },
  {
    "title": "'Stop the squeal': Ex-CNN host Jim Acosta returns with brutal Trump attack",
    "description": "Since his departure from CNN, former host Jim Acosta hasn't been shy about criticizing President Donald Trump\r\n in his SubStack column, \"The Jim Acosta Show.\"Acosta often attacks Trump from a policy standpoint. But in his March 17 column\r\n, Acosta's main focu…",
    "link": "https://www.rawstory.com/stop-the-squeal-ex-cnn-host-jim-acosta-returns-with-brutal-trump/",
    "timestamp": "2025-03-17T16:45:27Z"
  },
  {
    "title": "Schumer Postpones Book Tour After Caving to Trump",
    "description": "Chuck Schumer postponed three events on his book tour amidst widespread backlash to his support for Republicans funding bill.",
    "link": "http://www.rollingstone.com/politics/politics-news/chuck-schumer-postpones-book-tour-funding-backlash-1235297831/",
    "timestamp": "2025-03-17T16:43:03Z"
  },
  {
    "title": "Donald Trump Ignoring Court Order Is 'Doomsday Scenario'—Legal Analyst",
    "description": "President Donald Trump's deportation of Venezuelan migrants may have violated a direct court order, leading to what the FBI's former general counsel, Andrew Weissmann, has called a potential \"doomsday scenario.\"\nSpeaking on MSNBC, Weissman said: \"The doomsday…",
    "link": "https://biztoc.com/x/5f3a7d19a6fc0331",
    "timestamp": "2025-03-17T16:42:55Z"
  },
  {
    "title": "Foreign tourism into the U.S. is suddenly reversing and is now expected to drop, due in part to ‘polarizing Trump administration policies and rhetoric’",
    "description": "President Donald Trump's \"America first\" stance is helping to discourage international travel into the U.S., according to a recent forecast. Research firm Tourism Economics slashed its outlook and now sees a 5.1% decline in visits, flipping from an earlier vi…",
    "link": "https://biztoc.com/x/cce600585c7c9863",
    "timestamp": "2025-03-17T16:42:47Z"
  },
  {
    "title": "Forever 21 goes belly-up and will shutter all US stores, blames Temu and Shein",
    "description": "The retailer's operating company is set to shut down all US operations, with liquidation sales already underway at more than 350 locations. The company said it remains open to potential buyers willing to acquire its inventory and keep the stores running, acco…",
    "link": "https://nypost.com/2025/03/17/business/fast-fashion-retailer-forever-21-set-to-shut-all-us-stores/",
    "timestamp": "2025-03-17T16:42:22Z"
  },
  {
    "title": "TikTok rolls out a ‘Security Checkup’ tool to help users secure their accounts",
    "description": "TikTok is introducing a new “Security Checkup” tool that allows users to quickly review and update their account’s security settings from a single screen, the company announced on Monday. The feature is similar to Security Checkup tools offered by TikTok riva…",
    "link": "https://techcrunch.com/2025/03/17/tiktok-rolls-out-a-security-checkup-tool-to-help-users-secure-their-accounts/",
    "timestamp": "2025-03-17T16:41:57Z"
  },
  {
    "title": "Seattle Man Loses Social Security After Being Mistakenly Declared 'Dead'",
    "description": "Ned Johnson, 82, first learned of his \"death\" when his wife received a condolence letter from their bank.",
    "link": "https://www.newsweek.com/seattle-man-loses-social-security-mistakenly-declared-dead-2045837",
    "timestamp": "2025-03-17T16:41:32Z"
  },
  {
    "title": "Schumer postpones book tour, citing \"security concerns\" after funding vote",
    "description": "The postponements come amid expected protests in response to his vote to advance a Republican measure to avert a shutdown.",
    "link": "https://www.cbsnews.com/news/schumer-book-tour-postponed-security-concerns-government-shutdown-vote/",
    "timestamp": "2025-03-17T16:38:20Z"
  },
  {
    "title": "Schumer postpones book tour amid progressive revolt over shutdown vote as senator blames ‘security concerns’",
    "description": "Senate Minority Leader Chuck Schumer is scrapping book tour events this week due to security concerns as progressives fume over his maneuver to avert a partial government shutdown last week.",
    "link": "https://nypost.com/2025/03/17/us-news/schumer-postpones-book-tour-amid-progressive-revolt-over-shutdown-vote/",
    "timestamp": "2025-03-17T16:37:41Z"
  },
  {
    "title": "Carney arrives in London to meet King Charles and U.K. prime minister",
    "description": "Prime Minister Mark Carney landed in England on Monday where he will have a private audience with King Charles before meeting with British Prime Minister Keir Starmer in London.",
    "link": "https://www.cbc.ca/news/politics/carney-arrives-in-uk-1.7485534",
    "timestamp": "2025-03-17T16:37:08Z"
  },
  {
    "title": "Canada reviews US fighter jet deal but alternatives look costly",
    "description": "Canada, locked in a trade war with the United States, is reviewing a C$19-billion ($13.29 billion) contract for 88 American-made F-35 fighter jets from...",
    "link": "https://www.yahoo.com/news/canada-reviews-us-fighter-jet-163629126.html",
    "timestamp": "2025-03-17T16:36:29Z"
  },
  {
    "title": "VA Sec claps back at ‘fake news’ critics, defends DOGE: Unveils 4th new healthcare facility",
    "description": "Veterans Affairs Secretary Doug Collins, a colonel in the USAF reserves, said critics of the administration and its cuts to the federal workforce are wrong, pointing to a new facility in Virginia.",
    "link": "https://www.foxnews.com/politics/va-sec-hits-back-fake-news-critics-doge-veterans-healthcare",
    "timestamp": "2025-03-17T16:36:20Z"
  },
  {
    "title": "Donald Trump Ignoring Court Order Is 'Doomsday Scenario'—Legal Analyst",
    "description": "The FBI's former general counsel said if Trump ignores a judge's orders regarding deportation, it could lead to \"no rule of law.\"",
    "link": "https://www.newsweek.com/donald-trump-ignoring-court-order-doomsday-scenario-legal-analyst-2045892",
    "timestamp": "2025-03-17T16:35:49Z"
  },
  {
    "title": "US warships destroy Houthi attack drones | Reporter Replay",
    "description": "US warships have shot down roughly a dozen Houthi drones since President Donald Trump launched airstrikes against the terrorist organization on March 15, Fox News has learned. The drones were aimed at the US Navy’s Truman Carrier Strike Group, and were shot d…",
    "link": "https://nypost.com/video/us-warships-destroy-houthi-attack-drones-reporter-replay/",
    "timestamp": "2025-03-17T16:35:30Z"
  },
  {
    "title": "Putin and Trump will speak on Tuesday about the war in Ukraine (Chris Megerian/Associated Press)",
    "description": "Chris Megerian / Associated Press:\nPutin and Trump will speak on Tuesday about the war in Ukraine  —  U.S. President Donald Trump will speak with Russian President Vladimir Putin on Tuesday in a possible pivot point in efforts to end the war in Ukraine and an…",
    "link": "https://www.memeorandum.com/250317/p58",
    "timestamp": "2025-03-17T16:35:00Z"
  },
  {
    "title": "How the NHL killed Hamilton's hockey franchise 100 years ago, after players went on strike for $200",
    "description": "It was in March of 1925 — 100 years ago last week — that Hamilton’s National Hockey League team, the Hamilton Tigers, was shut down forever because players went on strike.",
    "link": "https://www.cbc.ca/news/canada/hamilton/hamilton-hockey-franchise-1.7485593",
    "timestamp": "2025-03-17T16:34:39Z"
  },
  {
    "title": "Did the Trump administration violate court orders with Alien Enemies Act deportations?",
    "description": "ACLU lawyers want answers from the federal government about its deportation actions over the weekend. A judge ordered a hearing for Monday afternoon.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-alien-enemies-act-violate-court-orders-aclu-rcna196682",
    "timestamp": "2025-03-17T16:34:15Z"
  },
  {
    "title": "Europe faces worst measles outbreak since 1997 – new data",
    "description": "Measles resurgence in Europe highlights need for higher vaccination rates.",
    "link": "https://theconversation.com/europe-faces-worst-measles-outbreak-since-1997-new-data-252327",
    "timestamp": "2025-03-17T16:33:09Z"
  },
  {
    "title": "Europe had worst measles outbreak since 1997 – new data",
    "description": "Measles resurgence in Europe highlights need for higher vaccination rates.",
    "link": "https://theconversation.com/europe-had-worst-measles-outbreak-since-1997-new-data-252327",
    "timestamp": "2025-03-17T16:33:09Z"
  },
  {
    "title": "Going to Harvard is getting a lot cheaper for most students",
    "description": "The entrance to Harvard Yard.\nScott Eisen/Getty Images\nHarvard will partially or fully cover costs for students from families earning less than $200,000.\nThe move will allow students from about 86% of US households to qualify for financial aid.\nPresident Dona…",
    "link": "https://biztoc.com/x/1289e85c02964323",
    "timestamp": "2025-03-17T16:31:47Z"
  },
  {
    "title": "Major legal victory for Trump in nationwide war against DEI",
    "description": "Allows president's orders to be enforced",
    "link": "https://www.wnd.com/2025/03/major-legal-victory-for-trump-in-nationwide-war-against-dei/",
    "timestamp": "2025-03-17T16:31:38Z"
  },
  {
    "title": "Social Media Erupts Over Congressman’s Reaction to Trump Job Cuts — After His Death",
    "description": "Rep. Raul Grijalva (D-AZ) decried President Donald Trump’s move to cut thousands of jobs at the U.S. Department of Education in a long post on X Thursday, but there was one problem — he was dead at the time. The post from Grijalva’s official X account, posted…",
    "link": "https://freerepublic.com/focus/f-chat/4304845/posts",
    "timestamp": "2025-03-17T16:31:36Z"
  },
  {
    "title": "India urges US intelligence chief Tulsi Gabbard to act against Khalistanis",
    "description": "Defence Minister Rajnath Singh discusses Khalistani threat with Tulsi Gabbard, emphasizing India-US strategic partnership.",
    "link": "https://www.thehindubusinessline.com/news/india-urges-us-intelligence-chief-tulsi-gabbard-to-act-against-khalistanis/article69341473.ece",
    "timestamp": "2025-03-17T16:31:10Z"
  },
  {
    "title": "Federal Judge Orders Astronauts Be Returned To Space Station",
    "description": "U.S. — A district judge has issued a ruling saying Trump lacked the Constitutional authority to pick up two astronauts who have been stranded at the International Space Station for several months.",
    "link": "https://babylonbee.com/news/judge-orders-astronauts-be-returned-to-space-station",
    "timestamp": "2025-03-17T16:30:58Z"
  },
  {
    "title": "Conor McGregor meets US President Donald Trump at White House",
    "description": "The MMA fighter posed for a picture with the US president in the Oval Office on St Patrick's Day.",
    "link": "https://www.bbc.co.uk/news/articles/cedleq79902o",
    "timestamp": "2025-03-17T16:30:48Z"
  },
  {
    "title": "Europe, United, Will Never Be Defeated!",
    "description": "On paper, Europe has all the resources it needs to defend itself in the absence of support by the United States. But the subordination of Europe’s interests to the national interests of its member states is a luxury the continent can no longer afford.",
    "link": "https://www.project-syndicate.org/commentary/europe-must-unite-to-defend-itself-without-us-support-by-bartosz-weglarczyk-2025-03",
    "timestamp": "2025-03-17T16:30:42Z"
  },
  {
    "title": "Appeals Court Strikes Down Trump Request To Fire Workers: Here’s Where Trump And Musk Are Winning—And Losing—In Court",
    "description": "Dozens of lawsuits have been filed challenging the Trump administration’s policies.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/17/appeals-court-strikes-down-trump-request-to-fire-workers-heres-where-trump-and-musk-are-winning-and-losing-in-court/",
    "timestamp": "2025-03-17T16:30:28Z"
  },
  {
    "title": "High-flying U-2 'Dragon Lady' spy planes and other recon aircraft are doing border security as Trump cracks down",
    "description": "US Air Force Chief of Staff Gen. David Allvin confirmed last week that the U-2 and other aircraft are taking part in surveillance missions.",
    "link": "https://www.businessinsider.com/u-2-dragon-lady-spied-soviets-flying-border-patrol-missions-2025-3",
    "timestamp": "2025-03-17T16:30:18Z"
  },
  {
    "title": "The Alien Enemies Act: What to know about a 1798 law that Trump has invoked for deportations",
    "description": "Trump invoked the Alien Enemies Act Saturday, granting himself sweeping powers under a centuries-old law to deport people associated with a Venezuelan gang. Here's a closer look at the act.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_97ab8d0c-8748-5377-a271-db5c197339bf.html",
    "timestamp": "2025-03-17T16:30:00Z"
  },
  {
    "title": "Conservative school board in blue state asking Trump admin to intervene on gender policy",
    "description": "The Mead School Board in Washington is asking the federal government to weigh in after facing pressure to comply with state gender inclusive guidelines.",
    "link": "https://www.foxnews.com/media/conservative-school-board-blue-state-asking-trump-admin-intervene-gender-policy",
    "timestamp": "2025-03-17T16:30:00Z"
  },
  {
    "title": "The Alien Enemies Act: What to know about a 1798 law that Trump has invoked for deportations",
    "description": "Trump invoked the Alien Enemies Act Saturday, granting himself sweeping powers under a centuries-old law to deport people associated with a Venezuelan gang. Here's a closer look at the act.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_065e3d0c-c759-5bf0-b4fe-406328f2fbed.html",
    "timestamp": "2025-03-17T16:30:00Z"
  },
  {
    "title": "Renewable Energy Stocks Drop to Five-Year Lows",
    "description": "Investors are increasingly bearish on renewable energy stocks with green indexes down to five-year lows, as the Trump Administration’s energy policy is chilling the low-carbon energy markets. Although it was up by 2% year to date as of Monday morning, the S&P…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Renewable-Energy-Stocks-Drop-to-Five-Year-Lows.html",
    "timestamp": "2025-03-17T16:30:00Z"
  },
  {
    "title": "WATCH LIVE: Pentagon holds news briefing as U.S. steps up attack on Yemen’s Houthis",
    "description": "The comments Monday by Trump on his Truth Social website further escalate his administration's new campaign of airstrikes targeting the rebels, which killed at least 53 people this weekend alone and appear poised to continue.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-pentagon-holds-news-briefing-as-u-s-steps-up-attack-on-yemens-houthis",
    "timestamp": "2025-03-17T16:29:44Z"
  },
  {
    "title": "'Most Americans have never heard of the Office of Net Assessment'",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-pentagon-azerbaijan-alcohol-covid",
    "timestamp": "2025-03-17T16:29:43Z"
  },
  {
    "title": "The One Internet Forum That Will Get You Through Stock Market Chaos",
    "description": "Their investment strategy is simple and boring. But for the Bogleheads, boring is best.",
    "link": "https://slate.com/technology/2025/03/bogleheads-investing-strategy-reddit-stock-market-chaos.html",
    "timestamp": "2025-03-17T16:29:38Z"
  },
  {
    "title": "Mothers and Children Are Already Dying Because of Elon Musk’s Cuts",
    "description": "Children are already dying due to cuts from Elon Musk's Department of Government Efficiency (DOGE) — but none that matter to the billionaire or his boss, Donald Trump. As the New York Times reports, care workers in African nations where the United States Agen…",
    "link": "https://futurism.com/neoscope/mothers-children-dying-musk-cuts",
    "timestamp": "2025-03-17T16:29:31Z"
  },
  {
    "title": "Ana Navarro Yells At Sara Haines During Tense Political Debate On ‘The View’: “I Don’t Buy That Explanation From You”",
    "description": "Haines caught heat for agreeing with Chuck Schumer's decision to avoid a government shutdown.",
    "link": "https://decider.com/2025/03/17/ana-navarro-yells-sara-haines-tense-political-debate-view/",
    "timestamp": "2025-03-17T16:29:09Z"
  },
  {
    "title": "‘DIRE’ CONSEQUENCES: President Trump Sends Stern Warning to Iran Over Houthi Strikes",
    "description": "President Donald Trump warned the Islamic Republic of Iran that he will hold Tehran responsible for any military strikes carried out by the Houthi rebels... Read More\nThe post ‘DIRE’ CONSEQUENCES: President Trump Sends Stern Warning to Iran Over Houthi Strike…",
    "link": "https://www.dailysignal.com/2025/03/17/dire-consequences-president-trump-sends-stern-warning-iran-houthi-strikes/",
    "timestamp": "2025-03-17T16:29:07Z"
  },
  {
    "title": "He voted for Trump. Now he’s worried his trans son will lose  gender-affirming care",
    "description": "The father of a transgender man is now worried that his son may lose his gender-affirming care under Donald Trump — even though he voted for him.",
    "link": "https://www.advocate.com/news/trump-voting-father-transgender-son",
    "timestamp": "2025-03-17T16:28:52Z"
  },
  {
    "title": "'Explain yourself!' The View devolves into shouting match over Chuck Schumer",
    "description": "A shouting match broke out on \"The View\" on Monday as the hosts got into a heated debate about whether Senate Minority Leader Chuck Schumer (D-NY) should have caved on the House's continuing resolution. The House of Representatives passed a six-month measure …",
    "link": "https://www.rawstory.com/government-shutdown-2671342492/",
    "timestamp": "2025-03-17T16:28:18Z"
  },
  {
    "title": "Kamala Harris Warned Us About 7 Things Donald Trump Would Do — And Now Is Doing — As President, And It's Bleak",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_546266f8-f693-4b96-bbff-90d62715157f",
    "timestamp": "2025-03-17T16:27:54Z"
  },
  {
    "title": "This Video Montage Of Kamala Harris Is Going Viral Because She Was Right About Donald Trump All Along",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_02b64ca3-a45d-419c-b636-63c7fccfb4fe",
    "timestamp": "2025-03-17T16:27:54Z"
  },
  {
    "title": "Chuck Schumer Postpones Book Tour Due to 'Security Concerns' After Backlash for Passing the CR",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) is postponing his book tour due to \"security concerns\" after backlash for supporting the GOP's continuing resolution (CR) last week.\nThe post Chuck Schumer Postpones Book Tour Due to ‘Security Concerns’ After Backla…",
    "link": "https://www.breitbart.com/politics/2025/03/17/chuck-schumer-postpones-book-tour-due-to-security-concerns-after-backlash-for-passing-the-cr/",
    "timestamp": "2025-03-17T16:27:21Z"
  },
  {
    "title": "Charlie Woods under more pressure as he tries to lift spirits of a 'beaten' Tiger Woods in front of Kai Trump",
    "description": "Tiger Woods has been going through a difficult period in his life, dealing with both physical setbacks and personal loss. The legendary golfer recently revealed that he had rupture",
    "link": "https://www.marca.com/en/golf/2025/03/17/67d82d89268e3ed6488b45ad.html",
    "timestamp": "2025-03-17T16:27:10Z"
  },
  {
    "title": "Donald Trump Jr. tries to forget Vanessa Trump with new girlfriend",
    "description": "Donald Trump Jr. has made headlines once again-this time for his new romantic relationship. The eldest son of 47th U.S. President Donald Trump has stepped out with socialite Bettin",
    "link": "https://www.marca.com/en/golf/2025/03/17/67d81e7d268e3e1b158b45aa.html",
    "timestamp": "2025-03-17T16:27:09Z"
  },
  {
    "title": "Conor McGregor’s White House immigration remarks ‘wrong’ says Taoiseach, as controversial fighter set for Trump meeting",
    "description": "Tánaiste says fighter has ‘no mandate’ to speak for people of Ireland during Washington visit",
    "link": "https://www.irishtimes.com/politics/2025/03/17/taoiseach-says-conor-mcgregors-white-house-immigration-remarks-wrong-as-controversial-fighter-set-for-trump-meeting/",
    "timestamp": "2025-03-17T16:26:32Z"
  },
  {
    "title": "SEC may scrap Biden-era crypto asset custody proposal, acting chief says",
    "description": "Wall Street's top regulator is considering changing or scrapping regulations proposed under the prior administration that would require investment advisors keeping custody of cryptocurrencies and other assets to meet stricter standards, the agency's interim c…",
    "link": "https://www.channelnewsasia.com/business/sec-may-scrap-biden-era-crypto-asset-custody-proposal-acting-chief-says-5006131",
    "timestamp": "2025-03-17T16:26:14Z"
  },
  {
    "title": "Trump policy on border jumpers empowers use of 'maximum consequences,' border agent tells Fox",
    "description": "President Donald Trump has allowed Customs and Border Protection agents the ability to hand out \"maximum consequences\" to those caught illegally crossing the border.",
    "link": "https://www.foxnews.com/politics/trump-policy-border-jumpers-empowers-use-maximum-consequences-border-agent-tells-fox",
    "timestamp": "2025-03-17T16:25:41Z"
  },
  {
    "title": "Who are the NASA astronauts who have been stuck in space for 9 months?",
    "description": "NASA's stuck astronauts are heading home now that a replacement crew has arrived at the International Space Station",
    "link": "https://abcnews.go.com/Technology/wireStory/nasa-astronauts-stuck-space-9-months-119877196",
    "timestamp": "2025-03-17T16:24:54Z"
  },
  {
    "title": "EU to look at import limits for aluminium sector, draft document shows",
    "description": "The European Commission is considering import curbs and export duties on metals to support its industry in response to U.S. tariffs on aluminum. Measures include new scrap metal export duties and a \"melted and poured rule\" to prevent minimal transformation im…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-to-look-at-import-limits-for-aluminium-sector-draft-document-shows/articleshow/119125050.cms",
    "timestamp": "2025-03-17T16:24:45Z"
  },
  {
    "title": "Going to Harvard is getting a lot cheaper for most students",
    "description": "The university plans to cover all costs for students from families earning under $100,000, and pay tuition fees for those with incomes under $200,000.",
    "link": "https://www.businessinsider.com/harvard-university-financial-aid-students-tuition-fees-funding-trump-endowment-2025-3",
    "timestamp": "2025-03-17T16:24:35Z"
  }
]