[
  {
    "title": "Trump’s Commerce Sec. Vows On NBC ‘There’s Going to Be No Recession!’ — Right Before Trump Himself Refused to Make the Same Pledge On Fox",
    "description": "President Donald Trump's commerce secretary Howard Lutnick, in a Sunday interview, made a big promise — one that Trump himself won't make.\nThe post Trump’s Commerce Sec. Vows On NBC ‘There’s Going to Be No Recession!’ — Right Before Trump Himself Refused to M…",
    "link": "https://www.mediaite.com/news/trumps-commerce-sec-vows-on-nbc-theres-going-to-be-no-recession-right-before-trump-himself-refused-to-make-the-same-pledge-on-fox/",
    "timestamp": "2025-03-09T14:50:37Z"
  },
  {
    "title": "DHS Detains Lead Negotiator of Columbia Encampment",
    "description": "Mahmoud Khalil, who was detained on Saturday, is being held at an ICE detention facility.",
    "link": "https://www.dropsitenews.com/p/dhs-detains-columbia-university-student-gaza",
    "timestamp": "2025-03-09T14:50:25Z"
  },
  {
    "title": "Trump teases tariffs against Mexico, Canada may go higher in the future",
    "description": "President Donald Trump teased that tariffs could climb higher over time while responding to Maria Bartiromo's questions about business leaders' desire for predictability.",
    "link": "https://www.foxnews.com/media/trump-teases-tariffs-against-mexico-canada-may-go-higher-future",
    "timestamp": "2025-03-09T14:49:37Z"
  },
  {
    "title": "Elon Musk suggests the US should leave NATO, saying it 'doesn't make sense' for the US to pay for Europe's defense",
    "description": "Trump has repeatedly criticized Europe's defense spending and previously threatened to leave NATO if allies didn't pay more.",
    "link": "https://www.businessinsider.com/elon-musk-suggests-the-us-should-leave-nato-2025-3",
    "timestamp": "2025-03-09T14:47:55Z"
  },
  {
    "title": "Bartiromo Lashes Out At Trump: 'We've Got Tariffs And The Stock Market Is Going Down'",
    "description": "President Donald Trump downplayed a stock market selloff that began immediately after he announced 25% tariffs on Mexico and Canada.\n\n\nDuring an interview that aired Sunday on Fox News, host Maria Bartiromo asked Trump about his admission that there would be …",
    "link": "https://crooksandliars.com/2025/03/bartiromo-lashes-out-trump-weve-got",
    "timestamp": "2025-03-09T14:47:50Z"
  },
  {
    "title": "Don't worry about eggs or a Trump recession. The billionaires will be just fine. | Opinion - NewsBreak",
    "description": "So I'm noticing egg prices are still high and the stock market has been dropping and inflation is up and thousands of federal workers are laid off.",
    "link": "https://www.newsbreak.com/share/3847610611066-don-t-worry-about-eggs-or-a-trump-recession-the-billionaires-will-be-just-fine-opinion?_f=app_share&amp;pd=0Ht4R6Eq&amp;lang=en_US&amp;send_time=1741531587&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.46.0.26%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_local_strategy_25q1_exp-v11%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v2&amp;s=i2",
    "timestamp": "2025-03-09T14:47:00Z"
  },
  {
    "title": "What will happen to student loans under Trump?",
    "description": "President Donald Trump has not been timid about his attempts to dismantle the Department of Education. It's part of his central battle in shrinking the size of the federal government, a charge spearheaded by his Department of Government Efficiency [DOGE], und…",
    "link": "https://biztoc.com/x/2cde56c5f939be40",
    "timestamp": "2025-03-09T14:46:25Z"
  },
  {
    "title": "Trump: Ukraine mineral deal not enough to restore aid",
    "description": "Signing a mineral deal will not be enough to restore aid to Ukraine and intelligence sharing, US President Donald Trump said privately, NBC News reported on Sunday, citing an administration official a...",
    "link": "https://biztoc.com/x/03425602e5c98a64",
    "timestamp": "2025-03-09T14:46:13Z"
  },
  {
    "title": "Secret Service Shoots Armed Man In Confrontation Near White House",
    "description": "Police believe the man, who is now hospitalized, is a \"suicidal individual\" who traveled from Indiana while the president was in Florida.",
    "link": "https://www.huffpost.com/entry/secret-service-shoots-armed-man-white-house-trump_n_67cda75ae4b0fc46f1f5a317",
    "timestamp": "2025-03-09T14:45:44Z"
  },
  {
    "title": "Bartiromo lashes out at Trump: 'Now we've got tariffs and the stock market is going down'",
    "description": "President Donald Trump downplayed a stock market selloff that began immediately after he announced 25% tariffs on Mexico and Canada.\n\nDuring an interview that aired Sunday on Fox News, host Maria Bartiromo asked Trump about his admission that there would be e…",
    "link": "https://www.rawstory.com/maria-bartiromo-trump-stock-market/",
    "timestamp": "2025-03-09T14:41:17Z"
  },
  {
    "title": "Trump's speech to Congress ends notion that Dems are the 'compassionate' party after 92 years: expert",
    "description": "Former speechwriters for previous presidential administrations weighed in on President Donald Trump’s expansive speech before a joint session of Congress on Tuesday evening.",
    "link": "https://www.foxnews.com/politics/trumps-speech-congress-ends-notion-dems-compassionate-party-after-92-years-expert",
    "timestamp": "2025-03-09T14:35:53Z"
  },
  {
    "title": "Solana down 29% in 2025 despite liquidity surge, US crypto stockpile inclusion",
    "description": "Despite being one of three altcoins to be included in President Trump’s Digital Asset Stockpile, Solana continues its price decline.",
    "link": "https://cointelegraph.com/news/solana-price-down-29-2025-liquidity-surge-us-crypto-stockpile",
    "timestamp": "2025-03-09T14:33:47Z"
  },
  {
    "title": "The Tate brothers left Romania and are facing an active criminal investigation in Florida. Here’s what we know | CNN",
    "description": "Self-proclaimed misogynist Andrew Tate and his brother Tristan arrived in Florida last week from Romania, where they are facing charges of human trafficking, setting off a fervor of concern and anger – and a state-level criminal investigation.",
    "link": "https://www.cnn.com/2025/03/09/us/andrew-tristan-tate-florida-case-wwk/index.html",
    "timestamp": "2025-03-09T14:33:08Z"
  },
  {
    "title": "Russia set to hold joint naval exercises with China, Iran in Indian Ocean",
    "description": "Russia, China, and Iran will conduct joint naval exercises titled 'Security Belt-2025' in the Indian Ocean near Iran. The drills aim to enhance military trust and cooperation among participating countries. Observers from various nations, including South Afric…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-set-to-hold-joint-naval-exercises-with-china-iran-in-indian-ocean/articleshow/118821149.cms",
    "timestamp": "2025-03-09T14:32:34Z"
  },
  {
    "title": "Rubio says Syria must hold accountable 'perpetrators of massacres'",
    "description": "Washington — U..S Secretary of State Marco Rubio on Sunday condemned the \"radical Islamist terrorists\" behind \"massacres\" of minorities in Syria and demanded that the interim administration hold those responsible to account.\n\n\n\"The United States condemns the …",
    "link": "https://www.voanews.com/a/rubio-says-syria-must-hold-accountable-perpetrators-of-massacres-/8004267.html",
    "timestamp": "2025-03-09T14:32:26Z"
  },
  {
    "title": "Secret Service shoots armed man outside White House",
    "description": "President Donald Trump was not in the White House at the time.",
    "link": "https://www.bbc.com/news/articles/c4gdwde82ldo",
    "timestamp": "2025-03-09T14:30:36Z"
  },
  {
    "title": "US Secret Service shoots armed man outside White House",
    "description": "US Secret Service shoots armed man outside White Housebbc.co.uk",
    "link": "https://www.bbc.co.uk/news/articles/c4gdwde82ldo",
    "timestamp": "2025-03-09T14:30:36Z"
  },
  {
    "title": "China learned from Trump's first trade war and changed its tactics when tariffs came again",
    "description": "The leaders of both Canada and Mexico got on the phone with President Donald Trump this past week to seek solutions after he slapped tariffs on their countries, but China’s president appears unlikely to make a similar call soon.",
    "link": "https://www.clickondetroit.com/news/world/2025/03/09/china-learned-from-trumps-first-trade-war-and-changed-its-tactics-when-tariffs-came-again/",
    "timestamp": "2025-03-09T14:30:31Z"
  },
  {
    "title": "Schiff: Trump Is 'Destroying the Economy'",
    "description": "Senator Adam Schiff (D-CA), Sunday on ABC's \"This Week,” alleged that President Donald Trump was \"destroying\" the U.S. economy.\nThe post Schiff: Trump Is ‘Destroying the Economy’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/03/09/schiff-trump-is-destroying-the-economy/",
    "timestamp": "2025-03-09T14:30:17Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were …",
    "link": "http://www.sun-sentinel.com/2025/03/09/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
    "timestamp": "2025-03-09T14:26:40Z"
  },
  {
    "title": "Trump's Putin Boost Like Hitler's Final Deal: Top Historian",
    "description": "Donald Trump's decisions to halt U.S. military aid and the sharing of intelligence with Ukraine could have \"catastrophic\" ramifications, said Simon Schama.",
    "link": "https://www.newsweek.com/trump-putin-boost-like-hitler-final-deal-top-historian-2041834",
    "timestamp": "2025-03-09T14:26:04Z"
  },
  {
    "title": "Ex-Apple leader has some blunt words for Elon Musk and Tesla",
    "description": "One of the defining trends of 2025, likely to carry far into next year and beyond, is the number of tech sector leaders who have embraced President Donald Trump.\nWhile Elon Musk has become one of his closest advisors, the list of tech CEOs who attended his in…",
    "link": "https://biztoc.com/x/3bc4de063420f862",
    "timestamp": "2025-03-09T14:24:30Z"
  },
  {
    "title": "Lutnick: ‘There’s going to be no recession in America’",
    "description": "Commerce Sec. Howard Lutnick shot down the possibility of a forthcoming recession in America, in an interview on NBC News’s “Meet the Press” on Sunday.\n“Absolutely not,” Lutnick said when asked whether Americans should brace for a recession.\n“Donald Trump is …",
    "link": "https://biztoc.com/x/5fdd1b9ab64ea628",
    "timestamp": "2025-03-09T14:24:22Z"
  },
  {
    "title": "Von der Leyen plans regular security talks with all EU commissioners",
    "description": "The regular security discussions will give the EU a broader look at possible threats, but the frequency of the sessions would \"depend on the urgency of the situation\", according to von der Leyen.",
    "link": "https://www.euractiv.com/section/politics/news/von-der-leyen-plans-regular-security-talks-with-all-eu-commissioners/",
    "timestamp": "2025-03-09T14:24:19Z"
  },
  {
    "title": "Kim: 'Offensive' GOP Blocking Trans Females in Women’s Sports",
    "description": "Senator Andy Kim (D-NJ) said Sunday on CNN's \"State of the Union\" that it was \"offensive\" Republicans and President Donald Trump were blocking transgender females from playing in women's sports\nThe post Kim: ‘Offensive’ GOP Blocking Trans Females in Women’s S…",
    "link": "https://www.breitbart.com/clips/2025/03/09/sen-kim-so-offensive-gop-blocking-trans-students-in-sports/",
    "timestamp": "2025-03-09T14:24:06Z"
  },
  {
    "title": "Former Bank of England governor named new prime minister of Canada",
    "description": "Former Bank of England governor Mark Carney will become the new prime minister of Canada after winning the Liberal Party leadership race.",
    "link": "https://news.sky.com/story/former-bank-of-england-governor-mark-carney-to-become-new-prime-minister-of-canada-13325043",
    "timestamp": "2025-03-09T14:24:00Z"
  },
  {
    "title": "Daylight Saving Time 2025 is now — here’s what ‘springing forward’ does to your body",
    "description": "Most of America “springs forward” Sunday for daylight saving time and losing that hour of sleep can do more than leave you tired and cranky the next day. It also could harm your health.",
    "link": "https://nypost.com/2025/03/09/lifestyle/daylight-saving-time-2025-what-springing-forward-does-to-your-body/",
    "timestamp": "2025-03-09T14:22:57Z"
  },
  {
    "title": "From Galway to Dublin to Turin: Alpine skier Maire Connolly’s five-hour round trips pay off as Special Olympian pits herself against world at Winter Games",
    "description": "It was the culmination of years of hard work, sacrifice and long commutes as Maire Connolly paraded with Team Ireland behind Maria Shriver at Turin's Inalpi Arena.",
    "link": "https://www.independent.ie/irish-news/from-galway-to-dublin-to-turin-alpine-skier-maire-connollys-five-hour-round-trips-pay-off-as-special-olympian-pits-herself-against-world-at-winter-games/a1553172852.html",
    "timestamp": "2025-03-09T14:19:55Z"
  },
  {
    "title": "Ex-central banker to replace Trudeau as Canada’s prime minister after winning Liberal Party vote",
    "description": "Mark Carney, 59, replaces Prime Minister Justin Trudeau, who announced his resignation in January but remains prime minister until his successor is sworn in in the coming days.",
    "link": "https://www.denverpost.com/2025/03/09/ex-central-banker-to-replace-trudeau-as-canadas-prime-minister-after-winning-liberal-party-vote/",
    "timestamp": "2025-03-09T14:19:34Z"
  },
  {
    "title": "Ex-central banker to replace Trudeau as Canada’s prime minister after winning Liberal Party vote",
    "description": "Former central banker Mark Carney will become Canada’s next prime minister after the governing Liberal Party elected him its leader Sunday as the country deals with U.S. President Donald Trump’s trade war and annexation threat, and a federal election looms.",
    "link": "https://www.bostonherald.com/2025/03/09/ex-central-banker-to-replace-trudeau-as-canadas-prime-minister-after-winning-liberal-party-vote/",
    "timestamp": "2025-03-09T14:19:34Z"
  },
  {
    "title": "The Bond Market’s Trump Trade Is Looking Like a Recession Trade",
    "description": "Bond traders are signaling an increasing risk that the US economy will stall as President Donald Trump’s chaotic tariff rollouts and federal-workforce cuts threaten to further restrain the pace of growth.",
    "link": "https://financialpost.com/pmn/business-pmn/the-bond-markets-trump-trade-is-looking-like-a-recession-trade",
    "timestamp": "2025-03-09T14:18:59Z"
  },
  {
    "title": "Dem Sen. Kim: Trump Bringing Civility in Politics Down, Democrats Matching His Level",
    "description": "Sen. Andy Kim (D-NJ) said Sunday on CNN's \"State of the Union\" that President Donald Trump was responsible for bringing down the civility of politics.\nThe post Dem Sen. Kim: Trump Bringing Civility in Politics Down, Democrats Matching His Level appeared first…",
    "link": "https://www.breitbart.com/clips/2025/03/09/dem-sen-kim-trump-bringing-civility-in-politics-down-democrats-matching-his-level/",
    "timestamp": "2025-03-09T14:18:11Z"
  },
  {
    "title": "Meet Sandra Whitehouse, whose husband's votes funneled millions into NGO that pays her - NewsBreak",
    "description": "Sen. Sheldon Whitehouse’s wife, Sandra Whitehouse, has long worked with, and been compensated by, a nonprofit that got millions in federal funds from legis",
    "link": "https://www.newsbreak.com/share/3847569066154-meet-sandra-whitehouse-whose-husband-s-votes-funneled-millions-into-ngo-that-pays-her?s=a2&amp;share_destination_id=MjMwNTA0OTM0LTE3NDE1Mjk3NTU4NDE%3D&amp;pd=0FbArWmE&amp;hl=en_US&amp;send_time=1741529755&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v7%2Cns_local_strategy_25q1_exp-v7%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v3%2Cns_foryou_model_exp_25q1-v8",
    "timestamp": "2025-03-09T14:16:54Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers in the Health and Human Services Department have been offered up to $25,000 to leave their jobs as part of President Donald Trump's cost-cutting measures. They have until Friday to respond. This move comes amid efforts to re…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/articleshow/118820997.cms",
    "timestamp": "2025-03-09T14:16:02Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer to leave their job for as much as a $25,000 p…",
    "link": "https://www.wdio.com/front-page/world-national/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
    "timestamp": "2025-03-09T14:14:16Z"
  },
  {
    "title": "Secret Service shoots armed man near the White House after getting report of ‘suicidal individual’",
    "description": "President Donald Trump was in Florida at the time of the shooting. Read More",
    "link": "https://biztoc.com/x/9be631370c5e078e",
    "timestamp": "2025-03-09T14:13:08Z"
  },
  {
    "title": "Iran acts unbothered about Trump’s threating letter - what’s the real motive?",
    "description": "Iranian state media said that US President Donald Trump “claimed to have sent a letter to the Leader of the Islamic Revolution on negotiations with the Islamic Republic.”",
    "link": "https://www.jpost.com/middle-east/article-845319",
    "timestamp": "2025-03-09T14:11:00Z"
  },
  {
    "title": "It’s Taylor Sheridan’s World. We’re Just Watching It",
    "description": "The Yellowstone auteur is printing money with his sprawling TV universe — a place where America is great again, work is glorified, and a lone, brave man saves the day",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/taylor-sheridan-shows-yellowstone-landman-lioness-1235288471/",
    "timestamp": "2025-03-09T14:10:16Z"
  },
  {
    "title": "Trump's speech showed Democrats at low ebb. A comeback will take work. (Dan Balz/Washington Post)",
    "description": "Dan Balz / Washington Post:\nTrump's speech showed Democrats at low ebb.  A comeback will take work.  —  Democrats are seeking cohesion in their opposition to President Donald Trump and a message that resonates with voters.  —  Just now  —  The Democrats showe…",
    "link": "https://www.memeorandum.com/250309/p14",
    "timestamp": "2025-03-09T14:10:02Z"
  },
  {
    "title": "Ronald to Donald: Trump's moves highlight the GOP shift away from Reagan (Naftali Bendavid/Washington Post)",
    "description": "Naftali Bendavid / Washington Post:\nRonald to Donald: Trump's moves highlight the GOP shift away from Reagan  —  With heavy tariffs and overtures to Russia, Trump embraces a worldview starkly different from that of the conservative icon.  —  Just now  —  Pres…",
    "link": "https://www.memeorandum.com/250309/p13",
    "timestamp": "2025-03-09T14:10:02Z"
  },
  {
    "title": "Trump touted sweeping tariff, DOGE plans - then adjusted as backlash grew (Washington Post)",
    "description": "Washington Post:\nTrump touted sweeping tariff, DOGE plans — then adjusted as backlash grew  —  Adjustments on DOGE, tariffs suggest the president isn't immune to political pressure, despite the scale of his proposals.  —  Just now  —  President Donald Trump o…",
    "link": "https://www.memeorandum.com/250309/p12",
    "timestamp": "2025-03-09T14:10:02Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer to leave their job for as much as a $25,000 p…",
    "link": "https://www.startribune.com/top-us-health-agency-makes-dollar25000-buyout-offer-to-most-of-its-employees/601233004",
    "timestamp": "2025-03-09T14:07:50Z"
  },
  {
    "title": "Trump isn't alone in his geopolitical aspirations. Some in Illinois and Oregon want change too",
    "description": "As President Donald Trump floats grand ideas like reacquiring the Panama Canal and taking over Greenland, some rural residents of Illinois and Oregon are...",
    "link": "https://www.yahoo.com/news/trump-isnt-alone-geopolitical-aspirations-140139964.html",
    "timestamp": "2025-03-09T14:01:39Z"
  },
  {
    "title": "Report: Kamala Harris ‘Seriously’ Contemplating a California Gubernatorial Run",
    "description": "\"Harris aides note she has long been intrigued by the idea of being the chief executive of the fifth-largest economy in the world and the first Black woman to be governor in America.\"\nThe post Report: Kamala Harris ‘Seriously’ Contemplating a California Guber…",
    "link": "https://legalinsurrection.com/2025/03/report-kamala-harris-seriously-contemplating-a-california-gubernatorial-run/",
    "timestamp": "2025-03-09T14:00:52Z"
  },
  {
    "title": "What needs to happen next to seize the moment and make flying safer now",
    "description": "I testified this week before the House Transportation and Infrastructure Subcommittee on Aviation and was repeatedly asked by House members what Congress should do going forward.",
    "link": "https://www.foxnews.com/opinion/what-needs-happen-next-seize-moment-make-flying-safer-now",
    "timestamp": "2025-03-09T14:00:05Z"
  },
  {
    "title": "Greg Gutfeld ‘Jokes’ Rep. Jasmine Crockett Is A ‘Ho’",
    "description": "Greg Gutfeld brought his mean-spirited MAGA comedy (is there any other kind?) to his opening monologue Wednesday night. It was no surprise that all his so-called jokes were mean-spirited attacks on Democrats.\nBut his “joke” about Rep. Jasmine Crockett took th…",
    "link": "https://crooksandliars.com/2025/03/greg-gutfeld-jokes-rep-jasmine-crockett-ho",
    "timestamp": "2025-03-09T14:00:01Z"
  },
  {
    "title": "Why Democrats Are Losing to Trump on Immigration",
    "description": "Donald Trump has turned immigration into political theater. Democrats' failure to offer any real vision keeps the show running",
    "link": "http://www.rollingstone.com/politics/political-commentary/democrats-losing-trump-immigration-1235291918/",
    "timestamp": "2025-03-09T14:00:00Z"
  },
  {
    "title": "'Pitiful': Karoline Leavitt bashes media after SNL lampoons Elon and Rubio 'feud'",
    "description": "White House Press Secretary Karoline Leavitt responded after Saturday Night Live mocked a reported confrontation between Secretary of State Marco Rubio and Elon Musk, the billionaire face of DOGE.\n\n\nDuring SNL's cold open Saturday Night, Mike Myers returned a…",
    "link": "https://www.rawstory.com/karoline-leavitt-elon-musk-marco-rubio/",
    "timestamp": "2025-03-09T13:59:31Z"
  },
  {
    "title": "Parliament to resume tomorrow to complete Budget exercise",
    "description": "Second leg of Budget Session of Parliament to focus on Finance Bill 2025 and US tariffs issue.",
    "link": "https://www.thehindubusinessline.com/economy/parliament-to-resume-tomorrow-to-complete-budget-exercise/article69309669.ece",
    "timestamp": "2025-03-09T13:59:18Z"
  },
  {
    "title": "‘Death spiral’: Greg Gutfeld says Dems are ‘paralyzed’ by ‘activist trauma’ and ‘sunk cost’ of ‘terrible policies’",
    "description": "'The losers are the people who prefer to die rather than change, but they're operating in an illusion where they think they're winning'",
    "link": "https://www.wnd.com/2025/03/death-spiral-greg-gutfeld-says-dems-are-paralyzed-by-activist-trauma-and-sunk-cost-of-terrible-policies/",
    "timestamp": "2025-03-09T13:59:05Z"
  },
  {
    "title": "The bond market’s Trump trade is looking like a recession trade",
    "description": "(Bloomberg) -- Bond traders are signaling an increasing risk that the US economy will stall as President Donald Trump’s chaotic tariff rollouts and federal...",
    "link": "https://finance.yahoo.com/news/bond-market-trump-trade-looking-135821166.html",
    "timestamp": "2025-03-09T13:58:21Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer to leave their job for as much as a $25,000 p…",
    "link": "https://www.clickondetroit.com/health/2025/03/09/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
    "timestamp": "2025-03-09T13:56:36Z"
  },
  {
    "title": "Hamas speaking directly with the United States about hostage release",
    "description": "An Israeli delegation will travel to Doha for talks on Monday, after Hamas confirmed it was negotiating with the US about the release of an American-Israeli hostage.",
    "link": "https://www.abc.net.au/news/2025-03-10/hamas-speaking-directly-with-united-states-about-hostage-release/105030520",
    "timestamp": "2025-03-09T13:55:34Z"
  },
  {
    "title": "US Inflation Set to Stay Sticky as Tariff Risk Looms",
    "description": "(Bloomberg) -- US consumer prices probably rose in February at a pace that illustrates plodding progress on inflation for Federal Reserve officials content...",
    "link": "https://finance.yahoo.com/news/us-inflation-set-stay-sticky-210000224.html",
    "timestamp": "2025-03-09T13:53:16Z"
  },
  {
    "title": "Canadians can’t afford to relax barriers to foreign entry in their banking system",
    "description": "As the U.S. pushes for greater access to Canada’s banking market, Canada must weigh the steep political costs of allowing a stronger American banking presence.",
    "link": "https://theconversation.com/canadians-cant-afford-to-relax-barriers-to-foreign-entry-in-their-banking-system-250587",
    "timestamp": "2025-03-09T13:52:14Z"
  },
  {
    "title": "Mike Myers Returns To ‘SNL’ As Elon Musk And Channels Dr. Evil In Cold Open",
    "description": "\"Phase one of my plan is complete: ingratiate yourself to the president and take over the media,\" quipped Myers.",
    "link": "https://decider.com/2025/03/09/mike-myers-returns-to-snl-as-elon-musk-and-channels-dr-evil-in-cold-open/",
    "timestamp": "2025-03-09T13:51:13Z"
  },
  {
    "title": "Trump Canada, Mexico tariffs can 'stop the bleeding' in US economy, UAW chief says",
    "description": "President Donald Trump's tariffs on Canada and Mexico \"are an attempt to stop the bleeding\" in the U.S. economy, United Auto Workers President Shawn Fain said.",
    "link": "https://abcnews.go.com/Politics/trump-canada-mexico-tariffs-stop-bleeding-us-economy/story?id=119591822",
    "timestamp": "2025-03-09T13:48:51Z"
  },
  {
    "title": "Countries can't be forced into Ukraine peace coalition - minister",
    "description": "The UK and France are leading efforts to set up a \"coalition of the willing\" to protect Ukraine.",
    "link": "https://www.bbc.co.uk/news/articles/ckgnkye22eyo",
    "timestamp": "2025-03-09T13:46:17Z"
  },
  {
    "title": "Master strategist Donald Trump suddenly realizes that mass firings get in the way of mass deportations [Awkward]",
    "description": "Master strategist Donald Trump suddenly realizes that mass firings get in the way of mass deportations",
    "link": "https://www.fark.com/comments/13589906/Master-strategist-Donald-Trump-suddenly-realizes-that-mass-firings-get-in-way-of-mass-deportations",
    "timestamp": "2025-03-09T13:45:41Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "The mass email went out to a “broad population of HHS employees.”",
    "link": "https://www.denverpost.com/2025/03/09/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
    "timestamp": "2025-03-09T13:45:23Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "By AMANDA SEITZ WASHINGTON (AP) — Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer to leave th…",
    "link": "https://www.bostonherald.com/2025/03/09/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
    "timestamp": "2025-03-09T13:45:23Z"
  },
  {
    "title": "Panama Frees Dozens of Migrants Deported From US, Give Them 30 Days To Leave",
    "description": "Following international criticism, Panama has released dozens of migrants deported by the US, who were held for weeks in a remote camp in the Central American nation. Panama authorities have given them 30 days to decide their next move.",
    "link": "https://www.ndtv.com/world-news/panama-frees-dozens-of-migrants-deported-from-us-give-them-30-days-to-leave-7885037",
    "timestamp": "2025-03-09T13:42:01Z"
  },
  {
    "title": "Authorities: Armed man shot by Secret Service near White House",
    "description": "An armed man believed to be traveling from Indiana was shot by Secret Service agents near the White House after a confrontation early Sunday, according to authorities.",
    "link": "https://www.kcci.com/article/authorities-armed-man-shot-secret-service-white-house/64109079",
    "timestamp": "2025-03-09T13:38:26Z"
  },
  {
    "title": "5 Small-Cap Dividend Stocks Yielding Up To 12.6%",
    "description": "If Trump 2.0 rhymes with Trump 1.0, then this is an intriguing time to consider small cap dividends. Let me explain—and highlight a handful yielding up to 12.6%.",
    "link": "https://www.forbes.com/sites/brettowens/2025/03/09/5-small-cap-dividend-stocks-yielding-up-to-126/",
    "timestamp": "2025-03-09T13:38:00Z"
  },
  {
    "title": "Countries can't be forced into Ukraine peace coalition, minister says",
    "description": "The UK and France are leading efforts to set up a \"coalition of the willing\" to protect Ukraine.",
    "link": "https://www.bbc.com/news/articles/ckgnkye22eyo",
    "timestamp": "2025-03-09T13:37:00Z"
  },
  {
    "title": "Poland says it may need alternative to Musk's Starlink in Ukraine",
    "description": "WARSAW (Reuters) - Poland, which pays for Ukraine's Starlink internet services, may seek an alternative if Elon Musk's company proves to be \"unreliable\", the foreign minister said on Sunday after the billionaire speculated about turning off access to the syst…",
    "link": "https://www.thestar.com.my/news/world/2025/03/09/poland-says-it-may-need-alternative-to-musk039s-starlink-in-ukraine",
    "timestamp": "2025-03-09T13:37:00Z"
  },
  {
    "title": "US Secret Service shoots armed man outside White House",
    "description": "President Donald Trump was not in the White House on Sunday morning (9 March)",
    "link": "https://www.ladbible.com/news/us-news/man-shot-armed-man-white-house-secret-service-046199-20250309",
    "timestamp": "2025-03-09T13:35:53Z"
  },
  {
    "title": "LARRY ELDER: Trump Blowing Dems Out Of Water On Every Issue That Matters Most To Americans",
    "description": "Trump Blowing Dems Out Of Water On Every Issue That Matters Most To Americans",
    "link": "https://dailycaller.com/2025/03/09/opinion-trump-dems-issue-americans-larry-elder/",
    "timestamp": "2025-03-09T13:34:03Z"
  },
  {
    "title": "JOSH HAMMER: Dems Still Can’t Figure Out Why Americans Don’t Like Them",
    "description": "Dems Can't Figure Out Why Americans Don't Like Them",
    "link": "https://dailycaller.com/2025/03/09/opinion-dems-americans-poor-messaging-josh-hammer/",
    "timestamp": "2025-03-09T13:32:53Z"
  },
  {
    "title": "Republicans will 'burn the country into the ground' for Elon and Trump: GOP adviser",
    "description": "During an appearance on MSNBC early Sunday morning, the former campaign manager for Rep. Joe Walsh (R-IL) lashed out at where the Republican party has gone under Donald Trump with billionaire Elon Musk apparently calling the shots.She then turned her ire on H…",
    "link": "https://www.rawstory.com/gop-burn-the-country-down/",
    "timestamp": "2025-03-09T13:32:32Z"
  },
  {
    "title": "Trump’s Meeting With Zelenskyy Revealed His Plot to Kill Ukraine",
    "description": "US President Donald Trump’s February 28 meeting in the Oval Office with Ukrainian President Volodymyr Zelenskyy was a media stunt. The New York Times called it a “showdown.” The intended audience was Russian President Putin, whom renowned historian Timothy Sn…",
    "link": "https://www.fairobserver.com/politics/trumps-meeting-with-zelenskyy-revealed-his-plot-to-kill-ukraine/",
    "timestamp": "2025-03-09T13:32:06Z"
  },
  {
    "title": "WARREN PETERSEN: Katie Hobbs Seems Hellbent On Making Arizona’s Election Counting Laughing Stock Of Nation",
    "description": "Democratic Arizona Gov. Katie Hobbs vetoed a commonsense bill that would have allowed our state to provide voters with same-day election results, moving us further away from the disastrous reporting system that is found when California voters go to their poll…",
    "link": "https://dailycaller.com/2025/03/09/opinion-katie-hobbs-arizonas-election-warren-petersen/",
    "timestamp": "2025-03-09T13:31:23Z"
  },
  {
    "title": "Trump Tariff Aid To Farmers May Again Exceed U.S. Nuclear Weapons Cost",
    "description": "The Trump administration may pay more taxpayer dollars to farmers harmed by Trump’s tariffs than on nuclear delivery systems and weapons.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/03/09/trump-tariff-aid-to-farmers-may-again-exceed-us-nuclear-weapons-cost/",
    "timestamp": "2025-03-09T13:31:12Z"
  },
  {
    "title": "Lady Gaga Creates Mayhem On ‘Saturday Night Live’",
    "description": "Lady Gaga returned to Saturday Night Live for her second time hosting and her fifth time as a musical guest.",
    "link": "https://www.forbes.com/sites/rosaescandon/2025/03/09/lady-gaga-creates-mayhem-on-saturday-night-live/",
    "timestamp": "2025-03-09T13:29:03Z"
  },
  {
    "title": "China learned from Trump’s first trade war and changed its tactics when tariffs came again",
    "description": "The leaders of both Canada and Mexico got on the phone with President Donald Trump this past week to seek solutions after he slapped tariffs on their countries, but China’s president appears unlikely to make a similar call soon.\nBeijing, which unlike America’…",
    "link": "https://biztoc.com/x/e50598de6086064f",
    "timestamp": "2025-03-09T13:29:03Z"
  },
  {
    "title": "Here’s Where Trump’s Government Layoffs Are Targeted—As NOAA Reportedly Set To Cut 20% Of Staff",
    "description": "The Trump administration has laid off thousands amid cost-cutting efforts.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/09/heres-where-trumps-government-layoffs-are-targeted-as-noaa-reportedly-set-to-cut-20-of-staff/",
    "timestamp": "2025-03-09T13:28:38Z"
  },
  {
    "title": "Armed Man Shot by Secret Service Near White House, Authorities Say",
    "description": "\"The individual brandished a firearm and an armed confrontation ensued,\" the Secret Service said in a statement.",
    "link": "https://time.com/7266169/armed-man-shot-by-secret-service-near-white-house-authorities-say/",
    "timestamp": "2025-03-09T13:28:25Z"
  },
  {
    "title": "L.A. Times: Mayor Karen Bass Is Deleting Her Text Messages",
    "description": "Los Angeles Mayor Karen Bass is deleting her text messages, thus defeating efforts by media organizations to obtain them as government communications subject to public records requests, according to the Los Angeles Times.\nThe post L.A. Times: Mayor Karen Bass…",
    "link": "https://www.breitbart.com/politics/2025/03/09/l-a-times-mayor-karen-bass-deleting-her-text-messages/",
    "timestamp": "2025-03-09T13:22:31Z"
  },
  {
    "title": "Elon Sinks Our Ships to Assure There Will Be No Going Back",
    "description": "A 500-year-old conquistador, hellbent on winning at any cost, has much to teach us about America today. If we have the stomach to see it.Hernán Cortés led the expedition from Spain to the New World that resulted in the fall of the Aztec Empire and its leader,…",
    "link": "https://www.commondreams.org/opinion/elon-sinks-our-ships",
    "timestamp": "2025-03-09T13:22:02Z"
  },
  {
    "title": "Trump wants to see more than just a minerals deal to restart aid and intel to Ukraine",
    "description": "As U.S. and Ukrainian officials prepare to meet in Saudi Arabia this week, President Donald Trump has privately made clear to aides that a signed minerals deal between Washington and Kyiv won’t be enough to restart aid and intelligence sharing with the war-to…",
    "link": "https://biztoc.com/x/b80b6ba50adc6c1b",
    "timestamp": "2025-03-09T13:17:43Z"
  },
  {
    "title": "Musk And DOGE Try To Slash Government By Cutting Out Those Who Answer To Voters",
    "description": "Conservatives have long talked about cutting government, but Republicans in Congress have shied away from approving deep reductions because of fear of how voters would react.",
    "link": "https://www.huffpost.com/entry/trump-musk-doge-slash-government-cut-out-those-who-answer-to-voters_n_67cd905ae4b08f027680480b",
    "timestamp": "2025-03-09T13:15:45Z"
  },
  {
    "title": "Seeking a “Plan B” under President Trump, some make plans to move to other countries",
    "description": "In Denver, interest in resettling abroad is burgeoning as Coloradans wary of Trump grapple with the realities of his second term and his quickly implemented new policies -- along with their own anxieties.",
    "link": "https://www.bostonherald.com/2025/03/09/immigration-donald-trump-colorado-dual-citizenship-visas-moving-abroad/",
    "timestamp": "2025-03-09T13:15:17Z"
  },
  {
    "title": "Attack on Iran's nuclear sites would contaminate Gulf water supply, Qatar PM says",
    "description": "DOHA (Reuters) - Qatar's prime minister has warned that an attack on Iran's nuclear facilities would \"entirely contaminate\" the waters of the Gulf and threaten life in Qatar, the UAE and Kuwait. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/09/attack-on-iran039s-nuclear-sites-would-contaminate-gulf-water-supply-qatar-pm-says",
    "timestamp": "2025-03-09T13:11:00Z"
  },
  {
    "title": "The dark future of American child care",
    "description": "States have been more assertive than ever before in developing their own child care policies.",
    "link": "https://www.bostonherald.com/2025/03/09/american-child-care-future/",
    "timestamp": "2025-03-09T13:10:30Z"
  },
  {
    "title": "Another Trump tariffs reprieve, Poilievre’s big business woes and our guide to Buy Canadian: Must-read business and investing stories",
    "description": "Trump partly waives 25% tariffs on Canada, Mexico until April 2\nAfter a long week that saw the beginnings of a continental trade war, U.S. President Donald Trump granted Canada and Mexico a partial reprieve from punishing 25-per-cent tariffs until April 2. Mr…",
    "link": "https://biztoc.com/x/91f9e6c38451c0ea",
    "timestamp": "2025-03-09T13:06:28Z"
  },
  {
    "title": "Bitcoin reserve backlash signals unrealistic industry expectations",
    "description": "“Not that long ago, even the idea of BTC Reserve held and supported by a federal government was a revolutionary idea,” a blockchain regulatory expert told Cointelegraph.",
    "link": "https://cointelegraph.com/news/us-bitcoin-reserve-disappoints-investors-trump-crypto-summit",
    "timestamp": "2025-03-09T13:06:06Z"
  },
  {
    "title": "Armed man shot by Secret Service near White House while Trump out of town",
    "description": "An armed man believed to be traveling from Indiana was shot by U.S. Secret Service agents near the White House after a confrontation early Sunday, according to authorities. \n\n\nNo one else was injured in the shooting that happened around midnight about a block…",
    "link": "https://www.voanews.com/a/armed-man-shot-by-secret-service-near-white-house-while-trump-out-of-town-/8004195.html",
    "timestamp": "2025-03-09T13:05:09Z"
  },
  {
    "title": "Making the bloom a desert",
    "description": "Israel's founding myth of \"making the desert bloom\" could only work if it eliminated all traces of the society that came before it. That's why Zionism has always sought to erase the Palestinian people, from the Nakba to the genocide in Gaza.",
    "link": "https://mondoweiss.net/2025/03/making-the-bloom-a-desert/",
    "timestamp": "2025-03-09T13:05:00Z"
  },
  {
    "title": "The US Is Undergoing a Corporate Coup. Sudan Shows How Dangerous It Can Become.",
    "description": "Musk’s DOGE takeover is the first step in shaping government to his whims. The next steps could be even more terrifying.",
    "link": "https://truthout.org/articles/the-us-is-undergoing-a-corporate-coup-sudan-shows-how-dangerous-it-can-become/",
    "timestamp": "2025-03-09T13:00:31Z"
  },
  {
    "title": "Bitcoin: Analyzing Divergence In Investor Behavior – Who’s Buying And Selling BTC?",
    "description": "The Bitcoin price started the week on a strong footing, jumping back above $90,000 following the announcement of a strategic crypto reserve by US President Donald Trump. However, the flagship cryptocurrency barely sustained this momentum, dropping back beneat…",
    "link": "https://bitcoinist.com/analyzing-bitcoin-divergent-investor-behavior/",
    "timestamp": "2025-03-09T13:00:19Z"
  },
  {
    "title": "Exclusive: Inside the campaign that won Doug Ford his third majority",
    "description": "Ford's team was preparing for an early election for a year, 'with some knowledge that things could be disruptive with Trump,' says campaign director Kory Teneycke",
    "link": "https://nationalpost.com/news/canada/inside-doug-ford-campaign",
    "timestamp": "2025-03-09T13:00:05Z"
  },
  {
    "title": "Krugman: Trump Planning 'Biggest Heist In History' With Crypto 'Rug Pull Scam'",
    "description": "As we already discussed here, Trump's ‘Strategic Crypto Reserve’ appears to be just another way to legalize bribery, but as award winning economist Paul Krugman discussed in his latest post on Substack and during an interview with CNN's Erin Burnett this Frid…",
    "link": "https://crooksandliars.com/2025/03/krugman-trump-planning-biggest-heist",
    "timestamp": "2025-03-09T13:00:01Z"
  },
  {
    "title": "‘We’re losing our environmental history’: The future of government information under Trump",
    "description": "The administration’s wrecking-ball approach has raised profound questions about the integrity and future of vast amounts of information.",
    "link": "http://grist.org/politics/were-losing-our-environmental-history-the-future-of-government-information-under-trump/",
    "timestamp": "2025-03-09T13:00:00Z"
  },
  {
    "title": "U.S. Will Acquire Greenland “One Way Or The Other”",
    "description": "United States ruler Donald Trump has said that Greenland will become a part of the U.S., “on way or the other.” During a keynote address to Congress, Trump reiterated his desire to acquire the autonomous territory of Denmark, regardless of Greenland’s dismiss…",
    "link": "https://www.activistpost.com/u-s-will-acquire-greenland-one-way-or-the-other/",
    "timestamp": "2025-03-09T13:00:00Z"
  },
  {
    "title": "J. D. Vance Finally Found a Use for the Vice Presidency",
    "description": "The VP has made social media into a vehicle for his ascent.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/why-vance-cant-stop-posting/681962/",
    "timestamp": "2025-03-09T13:00:00Z"
  },
  {
    "title": "Yes, Trump pardoned creator of 'Silk Road' dark web marketplace, Ross Ulbricht",
    "description": "U.S. President Donald Trump pardoned Ross Ulbricht, the creator of dark web marketplace Silk Road.",
    "link": "https://www.snopes.com//fact-check/trump-pardoned-silk-road-founder/",
    "timestamp": "2025-03-09T13:00:00Z"
  },
  {
    "title": "Government Shutdown 2025: Will You Still Have to Pay Taxes?",
    "description": "Congress has less than a week to avert a government shutdown that could cause widespread pains for taxpayers.",
    "link": "https://www.cnet.com/personal-finance/taxes/government-shutdown-2025-will-you-still-have-to-pay-taxes/",
    "timestamp": "2025-03-09T13:00:00Z"
  }
]