[
  {
    "title": "Donald Trump Declares War On Mexico After Attack On Brooklyn Bridge",
    "description": "WASHINGTON, D.C. — Just days after a catastrophic incident involving a sailing vessel belonging to the Mexican navy, President Donald Trump held a press conference to declare war on Mexico for its flagrant attack on the Brooklyn Bridge.",
    "link": "https://babylonbee.com/news/a-day-that-will-live-in-infamy-donald-trump-declares-war-on-mexico-after-attack-on-brooklyn-bridge",
    "timestamp": "2025-05-19T20:51:48Z"
  },
  {
    "title": "Apple to continue building in India, regardless of US President Trump’s thoughts",
    "description": "Apple continues to invest heavily in India for increasing production of its products, as part of its China +1 policy. The trend has recently garnered heightened attention from Donald Trump, as he spoke about the topic during his visit to Qatar. He said that h…",
    "link": "https://www.ilounge.com/news/apple-make-in-india-trump",
    "timestamp": "2025-05-19T20:50:56Z"
  },
  {
    "title": "Joe Biden's Family Tragedies, Health Struggles Through the Years",
    "description": "Former President Joe Biden and his family have endured several tragedies over the years. Biden married his first wife, Neilia Hunter, in 1966. The couple shared two sons, Joseph “Beau” Biden III and Hunter Biden, and a daughter, Naomi “Amy” Biden. Weeks after…",
    "link": "https://www.usmagazine.com/celebrity-news/news/joe-bidens-cancer-diagnosis-and-family-losses-over-the-yearspage/#article",
    "timestamp": "2025-05-19T20:49:42Z"
  },
  {
    "title": "Trump considers former defense attorney Emil Bove for federal appeals court vacancy",
    "description": "Emil Bove, known for his aggressive DOJ tactics, is a potential nominee for the U.S. Court of Appeals, raising concerns over Trump's judicial appointments.",
    "link": "https://www.foxnews.com/politics/trump-considers-former-defense-attorney-emil-bove-federal-appeals-court-vacancy",
    "timestamp": "2025-05-19T20:49:11Z"
  },
  {
    "title": "Trump signs bill outlawing ‘revenge porn’",
    "description": "US President Donald Trump signed a bill on Monday making it a federal crime to post \"revenge porn\" -- whether it is real or generated by AI.\nThe post Trump signs bill outlawing ‘revenge porn’ appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/trump-signs-bill-outlawing-revenge-porn/article",
    "timestamp": "2025-05-19T20:47:49Z"
  },
  {
    "title": "Trump signs bill outlawing ‘revenge porn’",
    "description": "US President Donald Trump signed a bill on Monday making it a federal crime to post “revenge porn” — whether it is real or generated by artificial intelligence. The “Take It Down Act,” passed with overwhelming bipartisan congressional support, criminalizes no…",
    "link": "https://www.digitaljournal.com/world/trump-signs-bill-outlawing-revenge-porn/article",
    "timestamp": "2025-05-19T20:47:49Z"
  },
  {
    "title": "Apparently a big-ass jet bribe is the one grift over the line for MAGA elites [Followup]",
    "description": "Apparently a big-ass jet bribe is the one grift over the line for MAGA elites",
    "link": "https://www.fark.com/comments/13676796/Apparently-a-big-ass-jet-bribe-is-one-grift-over-line-for-MAGA-elites",
    "timestamp": "2025-05-19T20:44:15Z"
  },
  {
    "title": "Jay Jones, running for AG, launches ad featuring former Gov. Ralph Northam",
    "description": "“There’s no one I trust more to stand up to Trump and Musk than you, Jay,” says Northam, who served as governor from 2018 to 2022.",
    "link": "https://richmond.com/news/state-regional/government-politics/elections/article_1da1030c-a3ce-45a1-a4f0-848236a9ef9e.html",
    "timestamp": "2025-05-19T20:44:00Z"
  },
  {
    "title": "JD Vance Can F*ck All The Way Off For This Swipe At Biden After Diagnosis",
    "description": "News of former President Handsome Old Joe Biden's diagnosis of an 'aggressive form' of prostate cancer is bringing out the best and worst in people. One of the worst responses is from co-vice-president J.D. Vance, who questioned Biden's fitness while in offic…",
    "link": "https://crooksandliars.com/2025/05/jd-vance-can-fck-all-way-swipe-biden-after",
    "timestamp": "2025-05-19T20:43:00Z"
  },
  {
    "title": "Bernie Sanders Agrees Democrats Are 'Threat to Democracy' on Podcast",
    "description": "On Andrew Schulz's popular show Flagrant, Sanders agreed the party hasn't held a fair primary since 2008 and questioned its impact on democracy.",
    "link": "https://www.newsweek.com/bernie-sanders-agrees-democrats-are-threat-democracy-podcast-2074336",
    "timestamp": "2025-05-19T20:42:41Z"
  },
  {
    "title": "Biden Thanks Supporters For 'Love' After Cancer Diagnosis",
    "description": "Former US president Joe Biden expressed gratitude Monday for an outpouring of \"love and support\" following his cancer diagnosis, even as some in President Donald Trump's orbit leveled fresh accusations of a health cover-up.",
    "link": "https://www.ibtimes.com.au/biden-thanks-supporters-love-after-cancer-diagnosis-1858972",
    "timestamp": "2025-05-19T20:42:07Z"
  },
  {
    "title": "Trump seeks 'major' probe of celebs who backed Harris",
    "description": "WASHINGTON: US President Donald Trump called Monday (May 19) for a \"major investigation\" into Beyonce, Bruce Springsteen and other celebrities, alleging they were paid millions of dollars to endorse his Democratic opponent in the 2024 election, Kamala Harris.…",
    "link": "https://www.channelnewsasia.com/world/trump-seeks-major-probe-celebs-who-backed-harris-5140511",
    "timestamp": "2025-05-19T20:42:00Z"
  },
  {
    "title": "Trump seeks 'major' probe of celebs who backed Harris",
    "description": "WASHINGTON: US President Donald Trump called on Monday (May 19) for a \"major investigation\" into Beyonce, Bruce Springsteen and other celebrities, alleging they were paid millions of dollars to endorse his Democratic opponent in the 2024 election, Kamala Harr…",
    "link": "https://www.channelnewsasia.com/world/trump-major-probe-celebs-kamala-harris-5140511",
    "timestamp": "2025-05-19T20:42:00Z"
  },
  {
    "title": "Wilmington Diocese, politicians urge prayers for Biden amid cancer diagnosis",
    "description": "Former president Joe Biden’s office revealed his prostate cancer diagnosis on Sunday, May 18, 2025. / Credit: Maxim Elramsisy/Shutterstock\n\nWashington, D.C. Newsroom, May 19, 2025 / 16:42 pm (CNA).\nThe Diocese of Wilmington, Delaware, and politicians from bot…",
    "link": "https://www.catholicnewsagency.com/news/264205/wilmington-diocese-politicians-urge-prayers-for-biden-amid-cancer-diagnosis",
    "timestamp": "2025-05-19T20:42:00Z"
  },
  {
    "title": "JP Morgan Boss Jamie Dimon Says Bank Will Allow Clients to Buy Bitcoin",
    "description": "The well-known critic of the biggest cryptocurrency by market cap said Monday that his bank would allow customers to buy BTC.",
    "link": "https://decrypt.co/320941/jp-morgan-boss-jamie-dimon-says-bank-allow-clients-buy-bitcoin",
    "timestamp": "2025-05-19T20:40:46Z"
  },
  {
    "title": "'Sick to my stomach': Critics appalled as taxpayers ordered to pay $5M to J6 rioter's kin",
    "description": "Critics of the Jan. 6, 2021, Capitol insurgency were dumbfounded to learn that the Trump administration had agreed to pay nearly $5 million to the family of slain rioter Ashli Babbitt, as first reported by The Washington Post.An internal Justice Department in…",
    "link": "https://www.rawstory.com/ashli-babbitt-2672134585/",
    "timestamp": "2025-05-19T20:37:57Z"
  },
  {
    "title": "‘Most ruthless’: Big name ex-Dem says Democratic Party actually is the ‘threat’ to democracy",
    "description": "'I'm not going to argue with that'",
    "link": "https://www.wnd.com/2025/05/most-ruthless-big-name-ex-dem-says-democratic-party-actually-is-the-threat-to-democracy/",
    "timestamp": "2025-05-19T20:37:56Z"
  },
  {
    "title": "CBS News CEO Wendy McMahon quits as potential Trump lawsuit settlement looms",
    "description": "CBS News CEO Wendy McMahon said Monday that she is resigning after four years, the latest fallout at the network as its parent company considers settling a lawsuit with President Donald Trump over a “60 Minutes” interview with his former political opponent.\nM…",
    "link": "https://biztoc.com/x/6f7ce2ee4a6d7c38",
    "timestamp": "2025-05-19T20:35:25Z"
  },
  {
    "title": "Supreme Court Justice Ketanji Brown Jackson Comes Under MAGA Fire",
    "description": "Trump's acolytes took aim at Justice Ketanji Brown Jackson after Biden's cancer diagnosis and Jackson's position on a recent ruling.",
    "link": "https://www.newsweek.com/supreme-court-ketanji-brown-jackson-maga-biden-2074344",
    "timestamp": "2025-05-19T20:34:00Z"
  },
  {
    "title": "GOP lawmaker rallies around Trump's tax-cut campaign as competitive 2026 House race looms: 'Big issue'",
    "description": "Rep. Ryan Mackenzie joined Americans for Prosperity for a day of action, designed to educate constituents on his work to extend President Donald Trump's 2017 Tax Cuts and Jobs Act (TCJA).",
    "link": "https://www.foxnews.com/politics/gop-lawmaker-rallies-trumps-tax-cut-campaign-competitive-2026-house-race-looms-big-issue",
    "timestamp": "2025-05-19T20:32:24Z"
  },
  {
    "title": "What is “Efilism,” the Obscure Anti-Natalist Ideology of the Palm Springs Bomber?",
    "description": "Palm Springs bomber Guy Bartkus was an adherent of an anti-natalist ideology sometimes known as “efilism.” But was he really “anti-pro-life”\nThe post What is “Efilism,” the Obscure Anti-Natalist Ideology of the Palm Springs Bomber? appeared first on The Inter…",
    "link": "https://theintercept.com/2025/05/19/efilism-palm-springs-bomber-fertility-clinic/",
    "timestamp": "2025-05-19T20:30:29Z"
  },
  {
    "title": "Reverse Discrimination Case Another Nail In The Coffin For DEI",
    "description": "Marlean Ames, a straight woman, alleges the Ohio Department of Youth Services discriminated against her on the basis of her sexuality",
    "link": "https://dailycaller.com/2025/05/19/marlean-ames-supreme-court-samuel-alito-reverse-discrimination-ohio-hiring-xiao-wang/",
    "timestamp": "2025-05-19T20:30:14Z"
  },
  {
    "title": "Amnesty International Defiant After Russia Dubs It 'Undesirable Organization'",
    "description": "A decade after Amnesty International warned that \"Russia is set to bolster an ongoing draconian crackdown which is squeezing the life out of civil society by adopting the 'undesirable organizations' law,\" Russian authorities on Monday hit the human rights gro…",
    "link": "https://www.commondreams.org/news/amnesty-international-russia",
    "timestamp": "2025-05-19T20:29:28Z"
  },
  {
    "title": "Putin’s Still In Charge",
    "description": "Trump can’t end the Ukraine war, and he knows it.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/putin-trump-russia-ukraine/682848/",
    "timestamp": "2025-05-19T20:29:18Z"
  },
  {
    "title": "No Trump, no FEMA? Tornado-ravaged city’s mayor pleads for help",
    "description": "At least 28 people across three states were killed when tornadoes struck Kentucky, Missouri, and Virginia on Friday, with a governor and a mayor calling them among the worst they’ve ever seen. Unseen, however, has been any acknowledgment or support from Presi…",
    "link": "https://www.rawstory.com/web-push-notification/no-trump-no-fema-tornado-ravaged-citys-mayor-pleads-for-federal-assistance/",
    "timestamp": "2025-05-19T20:29:10Z"
  },
  {
    "title": "Bernie Sanders Urges CBS News, Shari Redstone to ‘Not Capitulate’ to Trump Lawsuit",
    "description": "The Vermont senator pleads with the network not to settle the president's $20 billion lawsuit\nThe post Bernie Sanders Urges CBS News, Shari Redstone to ‘Not Capitulate’ to Trump Lawsuit appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bernie-sanders-urges-cbs-news-not-settle-lawsuit/",
    "timestamp": "2025-05-19T20:28:51Z"
  },
  {
    "title": "Wynn Resorts drops bid for NYC casino license",
    "description": "The company said Monday it has become clear through the rezoning process that there are better uses for its capital. Wynn had partnered with Related Companies to develop an integrated casino resort in the posh Hudson Yards neighborhood of Manhattan, where hig…",
    "link": "https://freerepublic.com/focus/f-chat/4317946/posts",
    "timestamp": "2025-05-19T20:28:22Z"
  },
  {
    "title": "Report: Venezuela Using ‘Forced Disappearances’ to Jail Dozens of Foreign Political Prisoners",
    "description": "The regime of socialist dictator Nicolás Maduro in Venezuela is imprisoning at least 31 unjustly detained foreign nationals under conditions of forced disappearance, the Argentine outlet Infobae reported on Sunday.\nThe post Report: Venezuela Using ‘Forced Dis…",
    "link": "https://www.breitbart.com/latin-america/2025/05/19/report-venezuela-using-forced-disappearances-to-jail-dozens-of-foreign-political-prisoners/",
    "timestamp": "2025-05-19T20:27:46Z"
  },
  {
    "title": "Free Trade Has Hurt Global Labor Conditions. Trump’s Tariffs Won’t Help Them.",
    "description": "Corporations are likely to respond to the tariffs by further exploiting overseas workers to keep the profits flowing.",
    "link": "https://truthout.org/articles/free-trade-has-hurt-global-labor-conditions-trumps-tariffs-wont-help-them/",
    "timestamp": "2025-05-19T20:26:19Z"
  },
  {
    "title": "Elizabeth Warren blasts stablecoin bill ahead of key vote, warning it'll help Trump 'line his pockets'",
    "description": "Sen. Warren, the ranking member of the Banking Committee, is on the opposing side of the so-called GENIUS Act.",
    "link": "https://www.businessinsider.com/elizabeth-warren-trump-stablecoin-bill-cryptocurrency-meme-coin-congress-2025-5",
    "timestamp": "2025-05-19T20:25:09Z"
  },
  {
    "title": "Donald Trump leaves Russia and Ukraine to settle war in talks (Financial Times)",
    "description": "Financial Times:\nDonald Trump leaves Russia and Ukraine to settle war in talks  —  US president's claim that negotiations will begin ‘immediately’ contrasts with more guarded statements from Vladimir Putin  —  Polina Ivanova in Warsaw, Guy Chazan in New York,…",
    "link": "https://www.memeorandum.com/250519/p100",
    "timestamp": "2025-05-19T20:25:01Z"
  },
  {
    "title": "Trump: Some progress has been made on Ukraine war",
    "description": "US President Donald Trump indicated that he thinks \"some progress has been made\" after engaging in a 2-hour telephone discussion with Russian President Vladimir Putin regarding the Ukraine conflict.\"H...",
    "link": "https://biztoc.com/x/8e15b3c6f0444a4e",
    "timestamp": "2025-05-19T20:24:20Z"
  },
  {
    "title": "Trump tries to jump start peace talks with calls to Zelenskyy, Putin",
    "description": "US President Donald Trump spoke with the leaders of both Ukraine and Russia in back-to-back calls.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/5/19/trump-tries-to-jump-start-peace-talks-with-calls-to-zelenskyy-putin",
    "timestamp": "2025-05-19T20:23:36Z"
  },
  {
    "title": "JD Vance Gifts Pope Leo XIV Chicago Bears Jersey: 'Good Choice'",
    "description": "Vice President JD Vance met with Pope Leo XIV on Monday and gave the Chicago-born pontiff a Bears football jersey inscribed with his title.\nThe post JD Vance Gifts Pope Leo XIV Chicago Bears Jersey: ‘Good Choice’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/faith/2025/05/19/jd-vance-gifts-pope-leo-xiv-chicago-bears-jersey-good-choice/",
    "timestamp": "2025-05-19T20:23:09Z"
  },
  {
    "title": "The tech billionaires are missing the point of their favorite sci-fi series",
    "description": "One of the most momentous developments of the new Trump era is how major billionaires in the tech industry — frequently known as the broligarchs — have thrown their weight behind the president. During the 2024 election, they offered high-profile support and m…",
    "link": "https://www.vox.com/culture/413502/iain-banks-culture-series-elon-musk-jeff-bezos-mark-zuckerberg",
    "timestamp": "2025-05-19T20:23:00Z"
  },
  {
    "title": "Trump hosts the Kennedy Center board as he seeks to remake arts and culture in America",
    "description": "The meeting comes after Trump fired the board's previous members.",
    "link": "https://www.bostonherald.com/2025/05/19/trump-kennedy-center-board/",
    "timestamp": "2025-05-19T20:21:21Z"
  },
  {
    "title": "CBS correspondent Scott Pelley hits Trump for suing journalists 'for nothing' in fiery commencement speech",
    "description": "In a commencement address at Wake Forest University, \"60 Minutes\" correspondent Scott Pelley took clear digs at President Donald Trump over his lawsuit against CBS News.",
    "link": "https://www.foxnews.com/media/cbs-correspondent-scott-pelley-hits-trump-suing-journalists-for-nothing-fiery-commencement-speech",
    "timestamp": "2025-05-19T20:20:55Z"
  },
  {
    "title": "Trump: Russia, Ukraine Will Immediately Begin 'Negotiations Toward a Ceasefire'",
    "description": "President Donald Trump announced on Monday that Ukraine and Russia would begin negotiations toward a ceasefire and suggested that talks could take place at the Vatican.\nThe post Trump: Russia, Ukraine Will Immediately Begin ‘Negotiations Toward a Ceasefire’ a…",
    "link": "https://www.breitbart.com/politics/2025/05/19/trump-russia-ukraine-will-immediately-begin-negotiations-toward-a-ceasefire/",
    "timestamp": "2025-05-19T20:18:00Z"
  },
  {
    "title": "Port Of Los Angeles Warns Of 'Lower Inventory' For Retailers Amid Trump Tariff Uncertainty",
    "description": "President Donald Trump's 90-day China tariff cut isn't a lot of time for new orders.",
    "link": "https://www.investors.com/news/trump-trade-war-los-angeles-port-lower-inventory-china-shipments/",
    "timestamp": "2025-05-19T20:17:49Z"
  },
  {
    "title": "Can You Watch 'Sesame Street' Without a Netflix Subscription? What to Know",
    "description": "Netflix and PBS will churn out episodes more quickly than the current streaming model occupied by HBO Max.",
    "link": "https://www.newsweek.com/sesame-street-netflix-streaming-pbs-kids-2074266",
    "timestamp": "2025-05-19T20:16:58Z"
  },
  {
    "title": "MSNBC host mocks Trump as he 'backs off' major campaign pledge",
    "description": "MSNBC host Katy Tur mocked President Donald Trump on Monday as he backed off peace talks between Ukraine and Russia. Speaking in the White House garden for an event about artificial intelligence, Trump told the gathering a little about his conversation with R…",
    "link": "https://www.rawstory.com/russia-negotiations-trump/",
    "timestamp": "2025-05-19T20:16:39Z"
  },
  {
    "title": "Trump, alongside the first lady, signs a bill to make posting 'revenge porn' a federal crime",
    "description": "Trump, alongside the first lady, signs a bill to make posting 'revenge porn' a federal crimewftv.com",
    "link": "https://www.wftv.com/news/trump-alongside/DDZGTARJFNFBJKZILQG46WI3H4/",
    "timestamp": "2025-05-19T20:16:36Z"
  },
  {
    "title": "Trump Plans to Rally House Republicans Divided on Tax Cut Bill",
    "description": "President Donald Trump plans to go to the Capitol on Tuesday to urge fractious House Republicans to overcome divisions and unite behind his signature tax-cut legislation.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plans-to-rally-house-republicans-divided-on-tax-cut-bill",
    "timestamp": "2025-05-19T20:15:49Z"
  },
  {
    "title": "I'm sorry Biden has cancer. But lies about his health make the timing suspicious. | Opinion - NewsBreak",
    "description": "Let me start by sending my sincere sympathy to former President Joe Biden and his family about his cancer diagnosis. I hope he’s able to receive effective",
    "link": "https://www.newsbreak.com/share/4014511358835-i-m-sorry-biden-has-cancer-but-lies-about-his-health-make-the-timing-suspicious-opinion?s=a2&amp;share_destination_id=MjQ4NTM3MzQ2LTE3NDc2ODU3MTQ4Mzk%3D&amp;pd=0Gopusvc&amp;hl=en_US&amp;send_time=1747685714&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v8%2Cns_foryou_blend_exp_25q2-v8%2Cns_foryou_recall_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_local_strategy_25q1_exp-v9",
    "timestamp": "2025-05-19T20:15:49Z"
  },
  {
    "title": "Trump Signs Bill Outlawing 'Revenge Porn'",
    "description": "US President Donald Trump signed a bill on Monday making it a federal crime to post \"revenge porn\" -- whether it is real or generated by artificial intelligence.",
    "link": "https://www.ibtimes.com/trump-signs-bill-outlawing-revenge-porn-3774031",
    "timestamp": "2025-05-19T20:15:17Z"
  },
  {
    "title": "Trump, alongside the first lady, signs a bill to make posting ‘revenge porn’ a federal crime",
    "description": "Melania Trump helped usher the measure through Congress.",
    "link": "https://www.bostonherald.com/2025/05/19/take-it-down-act-trump/",
    "timestamp": "2025-05-19T20:14:56Z"
  },
  {
    "title": "Whoopi Claims: No Biden ‘Health Cover-Up,’ Trump Could Be Deported",
    "description": "Whoopi Claims: No Biden ‘Health Cover-Up,’ Trump Could Be Deportednewsbusters.org",
    "link": "https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/05/19/whoopi-claims-no-biden-health-cover-trump-could-be-deported",
    "timestamp": "2025-05-19T20:14:42Z"
  },
  {
    "title": "Trump descends on Capitol Hill to patch Republican divides on his 'one big, beautiful bill'",
    "description": "President Donald Trump will be at House Republicans' weekly closed-door meeting on Tuesday morning, sources confirmed.",
    "link": "https://www.foxnews.com/politics/trump-descends-capitol-hill-patch-republican-divides-his-one-big-beautiful-bill",
    "timestamp": "2025-05-19T20:13:41Z"
  },
  {
    "title": "Libya looms large in Trump's global forced migration plans",
    "description": "The Trump administration is increasingly looking to Libya as a destination for immigrants it is displacing throughout the globe.",
    "link": "https://www.msnbc.com/top-stories/latest/libya-gaza-trump-deportations-palestinians-rcna207770",
    "timestamp": "2025-05-19T20:12:57Z"
  },
  {
    "title": "S.Africa says talks with Trump aim to salvage trade",
    "description": "Securing South Africa’s trade ties with the United States will be a key aim of President Cyril Ramaphosa, who Monday began a Washington visit that will feature a meeting with Donald Trump, Ramaphosa’s office said. Ramaphosa arrived late Monday accompanied by …",
    "link": "https://www.digitaljournal.com/world/s-africa-says-talks-with-trump-aim-to-salvage-trade/article",
    "timestamp": "2025-05-19T20:12:32Z"
  },
  {
    "title": "CBS News boss resigns amid tensions with Trump admin",
    "description": "The CEO of CBS News, one of America’s best-known broadcast media outlets, quit Monday citing a “challenging” last few months as the network became embroiled in legal and business tensions with the Trump administration. US President Donald Trump is suing CBS o…",
    "link": "https://www.digitaljournal.com/world/cbs-news-boss-resigns-amid-tensions-with-trump-admin/article",
    "timestamp": "2025-05-19T20:12:32Z"
  },
  {
    "title": "Trump says Russia, Ukraine to start ceasefire negotiations after Putin call",
    "description": "President Donald Trump and Russian President Vladimir Putin held a 2-hour call on Monday in what the U.S. said was a push to get Russia to end its deadly war in Ukraine. Both Trump and Putin described the call in a positive light, with the Kremlin chief sayin…",
    "link": "https://freerepublic.com/focus/f-news/4317942/posts",
    "timestamp": "2025-05-19T20:11:25Z"
  },
  {
    "title": "Hillary Clinton bashes Republican women, says GOP female president would be 'handmaiden to the patriarchy' (Jeffrey Clark/Fox News)",
    "description": "Jeffrey Clark / Fox News:\nHillary Clinton bashes Republican women, says GOP female president would be ‘handmaiden to the patriarchy’  —  Hillary Clinton failed to beat Donald Trump in 2016  —  Hillary Clinton took a swipe at female Republicans in an interview…",
    "link": "https://www.memeorandum.com/250519/p96",
    "timestamp": "2025-05-19T20:10:00Z"
  },
  {
    "title": "Investors shrug off Moody's downgrade as stocks, U.S. borrowing costs stay largely flat",
    "description": "Investors largely shrugged off a downgrade of the U.S.'s credit rating in Monday trading as stocks ended the day mostly flat.",
    "link": "https://www.nbcnews.com/business/markets/markets-closing-numbers-monday-moodys-us-credit-downgrade-rcna207730",
    "timestamp": "2025-05-19T20:09:25Z"
  },
  {
    "title": "Zelensky creates permanent negotiating team for talks with Russia",
    "description": "Following a phone call with Vladimir Putin, US President Donald Trump claimed that Moscow and Kiev “will immediately start” negotiations Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617872-zelensky-creates-permanent-negotiating-team-russia/",
    "timestamp": "2025-05-19T20:06:12Z"
  },
  {
    "title": "Canada coach Jesse Marsch understands why some fans may not want to travel to US for Gold Cup",
    "description": "Canada coach Jesse Marsch understands some of his team's supporters might not want to travel to the CONCACAF Gold Cup for fear of difficulty at the U.S. border.",
    "link": "https://www.cbc.ca/sports/soccer/canada-gold-cup-us-travel-1.7538663",
    "timestamp": "2025-05-19T20:05:52Z"
  },
  {
    "title": "Ex-Biden aides suspect another cover-up after former president’s prostate cancer diagnosis",
    "description": "\"I just don't know how they just, kind of find this out on a Friday, and it's this far advanced and serious,\" a former Biden White House aide said.",
    "link": "https://nypost.com/2025/05/19/us-news/ex-biden-aides-suspect-another-cover-up-after-former-presidents-prostate-cancer-diagnosis/",
    "timestamp": "2025-05-19T20:05:29Z"
  },
  {
    "title": "For the first time, the U.S. is absent from WHO's annual assembly. What's the impact?",
    "description": "In the wake of President Trump's decision to withdraw from the World Health Organization, the agency is holding its first major meeting. How will that affect WHO — and the United States?",
    "link": "https://www.npr.org/sections/goats-and-soda/2025/05/19/nx-s1-5399684/world-health-organization-assembly-united-states-trump",
    "timestamp": "2025-05-19T20:05:16Z"
  },
  {
    "title": "May Mortgage Predictions: Prepare for Rates to Stay Above 6.5%",
    "description": "Tariffs threaten to drive up prices, delay Fed rate cuts and keep mortgage rates higher for longer.",
    "link": "https://www.cnet.com/personal-finance/mortgages/may-mortgage-predictions-prepare-for-rates-to-stay-above-65/",
    "timestamp": "2025-05-19T20:05:00Z"
  },
  {
    "title": "Walmart just made it even easier for everyone else to raise prices",
    "description": "Walmart's announcement gives other retailers cover to raise their own prices — and acts as a warning of what not to do.",
    "link": "https://www.businessinsider.com/walmart-tariff-raise-prices-retail-trump-2025-5",
    "timestamp": "2025-05-19T20:04:29Z"
  },
  {
    "title": "Target worker exposes MASSIVE tariff price hike for popular items: 'Kinda scared'",
    "description": "For months, big retailers have been warning that prices will rise. Now, thanks to insider information from Target workers, the extent of the raises are becoming apparent. Staff say it is just the beginning. A $9.99 USB-C cord from the store's in-house Heyday …",
    "link": "https://freerepublic.com/focus/f-news/4317938/posts",
    "timestamp": "2025-05-19T20:01:53Z"
  },
  {
    "title": "When non-interference becomes policy",
    "description": "What US President Donald Trump said in Saudi Arabia on May 14 resonates very well in Thailand. Last week in Riyadh, Mr Trump reiterated that the Middle East had changed because \"local people did it\", and not because \"Western countries interfered and told you …",
    "link": "https://www.bangkokpost.com/opinion/opinion/3029677/when-non-interference-becomes-policy",
    "timestamp": "2025-05-19T20:00:00Z"
  },
  {
    "title": "Asean countries are facing their own 'China shock'",
    "description": "As the United States and Europe have sought to loosen their economic ties with China in recent years, Beijing has focused on expanding its export markets across the \"Global South\", particularly in Southeast Asia. But this could create significant economic ris…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3029607/asean-countries-are-facing-their-own-china-shock",
    "timestamp": "2025-05-19T20:00:00Z"
  },
  {
    "title": "Trump's tariffs are not simply about dolls",
    "description": "In a famous scene from the hit American television series Succession, the savvy patriarch of a family-owned media empire is infuriated to learn that none of his children knows the price of a gallon of milk. He understands that such a disconnect between decisi…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3029757/trumps-tariffs-are-not-simply-about-dolls",
    "timestamp": "2025-05-19T20:00:00Z"
  },
  {
    "title": "Index dips to lowest level since October 2024",
    "description": "The Thai Industries Sentiment Index (TISI) fell to 89.9 points in April, the lowest level since October 2024, due to a raft of factors ranging from US President Donald Trump's tariff policy to the Songkran holiday, said the Federation of Thai Industries (FTI).",
    "link": "https://www.bangkokpost.com/business/general/3029577/index-dips-to-lowest-level-since-october-2024",
    "timestamp": "2025-05-19T20:00:00Z"
  },
  {
    "title": "Ashli Babbitt: Trump administration to settle wrongful death suit for $5 million, source says",
    "description": "The Trump administration has agreed to pay nearly $5 million to the family of Ashli Babbitt, a pro-Donald Trump rioter who was shot and killed after breaching the US Capitol on January 6, 2021, according to a person familiar with the matter.",
    "link": "https://www.cnn.com/2025/05/19/politics/ashli-babbitt-settlement-capitol-riot",
    "timestamp": "2025-05-19T19:58:51Z"
  },
  {
    "title": "Here's What Happened Today: Monday",
    "description": "Hundreds skipping bail, the Michael Gaine investigation continues, and a thunderstorm warning for five counties.",
    "link": "https://www.thejournal.ie/heres-what-happened-today-monday-84-6709304-May2025/",
    "timestamp": "2025-05-19T19:58:05Z"
  },
  {
    "title": "Wendy Orthman named Jeep VP of brand marketing, communications",
    "description": "Orthman has worked at Genesis Motor America, Infiniti Motor Company, Nissan, Chrysler and General Motors.",
    "link": "https://www.prweek.com/article/1918595/wendy-orthman-named-jeep-vp-brand-marketing-communications",
    "timestamp": "2025-05-19T19:56:01Z"
  },
  {
    "title": "Donald Trump Calls for Investigation Into Bruce Springsteen, Beyoncé & More Celebrities for Endorsing Kamala Harris",
    "description": "President Donald Trump is demanding an investigation for multiple celebrities for supporting Kamala Harris during the 2024 presidential election. On Sunday (May 18), Trump took to his Truth Social account to accuse Bruce Springsteen, Beyoncé, Bono, and Oprah …",
    "link": "https://www.justjared.com/2025/05/19/donald-trump-calls-for-investigation-into-bruce-springsteen-beyonce-more-celebrities-for-endorsing-kamala-harris/",
    "timestamp": "2025-05-19T19:55:08Z"
  },
  {
    "title": "Russia-Ukraine talks to begin ‘immediately,’ Trump says after call with Putin",
    "description": "President Donald Trump stated Monday that Russia and Ukraine will “immediately” begin negotiation talks.In a post on Truth Social, Trump revealed some details regarding a two-hour call he had with Russian President Vladimir Putin, adding that the conversation…",
    "link": "https://www.theblaze.com/news/russia-ukraine-talks-to-begin-immediately-trump-says-after-call-with-putin",
    "timestamp": "2025-05-19T19:55:00Z"
  },
  {
    "title": "Bernie Sanders warns Shari Redstone 'not to capitulate' to Trump after the head of CBS News resigned",
    "description": "Bernie Sanders said that the latest shake-up at CBS News shows \"enough is enough.\"",
    "link": "https://www.businessinsider.com/bernie-sanders-shari-redstone-cbs-news-paramount-merger-2025-5",
    "timestamp": "2025-05-19T19:54:33Z"
  },
  {
    "title": "In 'Call to Duty' for 'Civic Courage,' Free Speech Champions Challenge Trump Assault on Key Rights",
    "description": "In an open letter on Monday, seven leading free speech organizations in the United States warned that the capitulation of universities and other institutions to President Donald Trump's demands for suppressed speech affect not just those organizations, their …",
    "link": "https://www.commondreams.org/news/trump-on-free-speech",
    "timestamp": "2025-05-19T19:52:01Z"
  },
  {
    "title": "Trump Is Giving Millions in Taxpayer Money to Family of Rioter Killed on Jan. 6",
    "description": "Donald Trump's Justice Department will reportedly pay $5 million to the family of Jan. 6 rioter Ashli Babbitt in a wrongful death settlement.",
    "link": "http://www.rollingstone.com/politics/politics-news/ashli-babbitt-family-5-million-wrongful-death-settlement-1235342908/",
    "timestamp": "2025-05-19T19:51:54Z"
  },
  {
    "title": "Louisiana Gov. Jeff Landry attends White House bill signing on 'revenge porn,' 'deepfakes'",
    "description": "Louisiana Gov. Jeff Landry attended a ceremony at the White House on Monday in which President Donald Trump signed a bill that aims to crack down on 'revenge porn' and 'deepfakes.'",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/louisianas-jeff-landry-attends-white-house-deepfake-even/article_911b6555-bd03-5171-950a-16bbac698b92.html",
    "timestamp": "2025-05-19T19:51:00Z"
  },
  {
    "title": "Supreme Court lets Trump end deportation protections for Venezuelans",
    "description": "The U.S. Supreme Court let Donald Trump’s administration on Monday strip temporary protected status from Venezuelans living in the United States that had been granted under his predecessor Joe Biden, as the Republican president moves to ramp up deportations a…",
    "link": "https://biztoc.com/x/7c9805fd5fad84dd",
    "timestamp": "2025-05-19T19:50:31Z"
  },
  {
    "title": "Trump signs bill criminalizing revenge porn and explicit deepfakes | TechCrunch",
    "description": "President Donald Trump is expected to sign the Take It Down Act today, a bipartisan law that enacts stricter penalties for distributing non-consensual explicit images, including deepfakes and revenge porn.",
    "link": "https://techcrunch.com/2025/05/19/trump-signs-bill-criminalizing-revenge-porn-and-explicit-deepfakes/",
    "timestamp": "2025-05-19T19:50:31Z"
  },
  {
    "title": "Trump signs bill criminalizing revenge porn and explicit deepfakes",
    "description": "President Donald Trump signed the Take It Down Act on Monday, a bipartisan law that enacts stricter penalties for distributing nonconsensual explicit images, including deepfakes and revenge porn.\nThe bill criminalizes the publication of such images, whether t…",
    "link": "https://biztoc.com/x/58f1b23b21946801",
    "timestamp": "2025-05-19T19:50:31Z"
  },
  {
    "title": "Trump signs bill combating deepfakes and revenge porn",
    "description": "The new law makes it illegal to post real or AI-generated \"intimate images\" online without the individual's consent.",
    "link": "https://www.bbc.com/news/articles/c74qnyz89y3o",
    "timestamp": "2025-05-19T19:50:20Z"
  },
  {
    "title": "‘The Republic Is Under Siege By a Moron’: Everything Bruce Springsteen Has Said About Donald Trump",
    "description": "Donald Trump has spent the past few days blasting Bruce Springsteen for calling his administration \"treasonous,\" but it wasn't the first time the rock star took aim at the President",
    "link": "http://www.rollingstone.com/music/music-features/everything-bruce-springsteen-said-about-donald-trump-1235342533/",
    "timestamp": "2025-05-19T19:49:43Z"
  },
  {
    "title": "I'm sorry Biden has cancer. But lies about his health make the timing suspicious. | Opinion - NewsBreak",
    "description": "Let me start by sending my sincere sympathy to former President Joe Biden and his family about his cancer diagnosis. I hope he’s able to receive effective",
    "link": "https://www.newsbreak.com/share/4014511358835-i-m-sorry-biden-has-cancer-but-lies-about-his-health-make-the-timing-suspicious-opinion?_f=app_share&amp;pd=0GWY2mGG&amp;lang=en_US&amp;send_time=1747684080&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.20.0.20%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q2-v8%2Cns_foryou_blend_exp_25q2-v6%2Cns_local_strategy_25q1_exp-v13&amp;s=i2",
    "timestamp": "2025-05-19T19:49:39Z"
  },
  {
    "title": "Biden cancer diagnosis: Veteran presidential health reporter weighs in",
    "description": "Some are criticizing Biden’s team for not testing him earlier for prostate cancer. But overtesting is a particular concern for all men, including presidents.",
    "link": "https://www.statnews.com/2025/05/19/biden-cancer-analysis-by-lawrence-altman-physician-reporter-presidential-health-expert/",
    "timestamp": "2025-05-19T19:49:38Z"
  },
  {
    "title": "After Putin call, Trump says Russia, Ukraine will start ceasefire talks",
    "description": "US president says two sides will 'immediately' start talks to reach a truce, as Putin says efforts on 'right track'.",
    "link": "https://www.aljazeera.com/news/2025/5/19/after-putin-call-trump-says-russia-ukraine-will-start-ceasefire-talks",
    "timestamp": "2025-05-19T19:49:19Z"
  },
  {
    "title": "Oil Ends Higher After Volatile Day",
    "description": "Uncertainty over sanctions on Iran and Russia kept markets volatile despite modest gains.",
    "link": "https://www.rigzone.com/news/wire/oil_ends_higher_after_volatile_day-19-may-2025-180574-article/",
    "timestamp": "2025-05-19T19:48:25Z"
  },
  {
    "title": "Bernie Sanders Warns Paramount Not To Settle Trump’s ‘Bogus’ Lawsuit",
    "description": "\"Enough is enough. Do not capitulate to Trump’s attack on a free press,\" the Vermont senator said.",
    "link": "https://www.huffpost.com/entry/bernie-sanders-paramount-settle-trump-lawsuit_n_682b5fc7e4b095274facdda9",
    "timestamp": "2025-05-19T19:47:51Z"
  },
  {
    "title": "Putin has a two-hour phone call with Donald Trump; is the Ukraine war coming to an end? Here's what they discussed",
    "description": "Putin and Trump had a phone call about peace in Ukraine. Putin said he's open to talks, but tensions remain high after Russia's big drone strike and failed missile test. No U.S. response yet.",
    "link": "https://economictimes.indiatimes.com/news/international/us/putin-has-a-two-hour-phone-call-with-donald-trump-is-the-ukraine-war-coming-to-an-end-heres-what-they-discussed/articleshow/121276391.cms",
    "timestamp": "2025-05-19T19:47:23Z"
  },
  {
    "title": "With His Prostate Cancer Battle, Joe Biden Can Do As Jimmy Carter Did",
    "description": "The important role of the venture buyer, and venture tryer when it comes to progress, is something the 46th president could elevate.",
    "link": "https://www.forbes.com/sites/johntamny/2025/05/19/with-his-prostate-cancer-battle-joe-biden-can-do-as-jimmy-carter-did/",
    "timestamp": "2025-05-19T19:45:37Z"
  },
  {
    "title": "Trump Justice Department appointee suggests criminal charges for Jill Biden",
    "description": "As the country grapples with the news that former President Joe Biden has stage four prostate cancer, the right wing made jokes and attacks that extended beyond the president. One of those came from a President Donald Trump's political appointee to the Justic…",
    "link": "https://www.rawstory.com/trump-justice-department-2672134549/",
    "timestamp": "2025-05-19T19:43:42Z"
  },
  {
    "title": "US Supreme Court lets Trump end deportation protections for some Venezuelans",
    "description": "Temporary Protected Status allows people to live and work in the US legally if their home countries are deemed to be unsafe.",
    "link": "https://www.bbc.com/news/articles/cvg78471n85o",
    "timestamp": "2025-05-19T19:43:08Z"
  },
  {
    "title": "The Business Roundtable is MIA Against Trump’s Attacks",
    "description": "CEOs are yet to collectively, and definitively, stand up to President Donald Trump's attacks against businesses.",
    "link": "https://time.com/7286691/business-roundtable-mia-trumps-attacks/",
    "timestamp": "2025-05-19T19:42:20Z"
  },
  {
    "title": "Trump signs Take It Down Act",
    "description": "United States President Donald Trump signed on Monday the Take It Down Act, first introduced by Republican Senator Ted Cruz and later promoted and supported by First Lady Melania Trump. The law target...",
    "link": "https://biztoc.com/x/570d9a59d520f3cb",
    "timestamp": "2025-05-19T19:39:38Z"
  },
  {
    "title": "Trump says he made progress during call with Putin",
    "description": "US President Donald Trump said he made progress on Monday during his call with Russia's President Vladimir Put",
    "link": "https://www.jpost.com/breaking-news/article-854647",
    "timestamp": "2025-05-19T19:39:36Z"
  },
  {
    "title": "The two-hour phone call between Donald Trump and Vladimir Putin appears to create a glimmer of hope for a peace process in Ukraine",
    "description": "Diplomatic maneuver or the Russian president’s sincere intention — Trump clarified that the ceasefire and peace terms will be agreed only between the two warring countries — What Zelensky says\nThe post The two-hour phone call between Donald Trump and Vladimir…",
    "link": "https://en.protothema.gr/2025/05/19/the-two-hour-phone-call-between-donald-trump-and-vladimir-putin-appears-to-create-a-glimmer-of-hope-for-a-peace-process-in-ukraine/",
    "timestamp": "2025-05-19T19:39:07Z"
  }
]