[
  {
    "title": "Ron DeSantis Tells Andrew Tate ‘Florida Is Not a Place Where You’re Welcome’ as He Arrives in Fort Lauderdale",
    "description": "Governor Ron DeSantis firmly stated that Florida will not accommodate Andrew and Tristan Tate, emphasizing the state's zero tolerance for human trafficking as legal inquiries into their conduct begin.\nThe post Ron DeSantis Tells Andrew Tate ‘Florida Is Not a …",
    "link": "https://www.thegatewaypundit.com/2025/02/ron-desantis-tells-andrew-tate-florida-not-place/",
    "timestamp": "2025-02-28T02:20:29Z"
  },
  {
    "title": "Chiefs’ Harrison Butker Invited To The White House Before The Eagles",
    "description": "Kansas City Chiefs kicker Harrison Butker got an invite to the White House before the Philadelphia Eagles despite barely playing in a loss during the Super Bowl. Last week, the Eagles found themselves at the center of controversy when it was reported that sev…",
    "link": "https://brobible.com/sports/article/chiefs-harrison-butker-invited-to-the-white-house-before-the-eagles/",
    "timestamp": "2025-02-28T02:18:30Z"
  },
  {
    "title": "North Korea reopens to tourists after 5 years, but Pyongyang remains closed",
    "description": "Beijing-based tour operators are the first to lead groups into the reclusive nation’s Rason Special Economic Zone, which borders Russia and China.",
    "link": "https://www.channelnewsasia.com/east-asia/north-korea-reopens-foreign-tourists-special-economic-zone-pyongyang-closed-4966381",
    "timestamp": "2025-02-28T02:17:02Z"
  },
  {
    "title": "It’s Time to End the War Between Ukraine and Russia",
    "description": "Three years have now passed since war broke out between Russia and Ukraine. The toll this needless conflict has taken is unbearable and needless. From... Read More\nThe post It’s Time to End the War Between Ukraine and Russia appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/27/its-time-to-end-the-war-between-ukraine-and-russia/",
    "timestamp": "2025-02-28T02:16:32Z"
  },
  {
    "title": "Exclusive: Israel To Resume War in Gaza and ‘Eradicate Hamas,’ Cutting Off Aid and Bombarding Strip with Troops",
    "description": "TEL AVIV—Israeli decision-makers plan to resume the Gaza war in four to six weeks with overwhelming force, sending in tens of thousands of troops to conquer the entire strip in a single coordinated offensive against Hamas.\nIncoming military chief of staff Eya…",
    "link": "https://freebeacon.com/israel/exclusive-israel-to-resume-war-in-gaza-and-eradicate-hamas-cutting-off-aid-and-bombarding-strip-with-troops/",
    "timestamp": "2025-02-28T02:10:47Z"
  },
  {
    "title": "Ontario's Progressive Conservatives cruise to rare 3rd-straight majority",
    "description": "Ontario Premier Doug Ford and his Progressive Conservatives cruised to their third straight majority government Thursday, after a snap winter election fought amid the spectre of U.S. tariffs.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-election-2025-results-ford-1.7470513",
    "timestamp": "2025-02-28T02:08:55Z"
  },
  {
    "title": "Judge orders DOGE employee to testify in lawsuit against the Trump administration",
    "description": "U.S. District Judge John Bates called the Department of Government Efficiency's work \"opaque\" as he ordered an official to shed more light on its structure and activity.",
    "link": "https://www.nbcnews.com/politics/doge/judge-orders-doge-employee-testify-lawsuit-trump-administration-rcna194145",
    "timestamp": "2025-02-28T02:08:52Z"
  },
  {
    "title": "North Korea's Kim orders nuclear readiness after missile test, KCNA says",
    "description": "SEOUL, SOUTH KOREA — North Korean leader Kim Jong Un supervised a test-launch of strategic cruise missiles and ordered full readiness to use nuclear attack capability to ensure the most effective defense for the country, state media announced Friday.\n\n\nThe te…",
    "link": "https://www.voanews.com/a/north-korea-s-kim-orders-nuclear-readiness-after-missile-test-kcna-says/7991171.html",
    "timestamp": "2025-02-28T02:08:14Z"
  },
  {
    "title": "Mel Gibson joins efforts to recall Gov. Gavin Newsom",
    "description": "Mel Gibson is calling out California Gov. Gavin Newsom and LA Mayor Karen Bass for \"gross mismanagement\" of the Palisades and Eaton fires that devastated Southern California.",
    "link": "https://www.foxnews.com/entertainment/mel-gibson-joins-governor-gavin-newsom-recall-efforts-blames-him-gross-mismanagement-la-fires",
    "timestamp": "2025-02-28T02:07:17Z"
  },
  {
    "title": "트럼프 3월4일부터 중국 10% 추가 관세, 캐나다·멕시코도 예정대로 25%, 상호관세는 4월 2일 부과될 것",
    "description": "UK Prime Minister Keir Starmer says his country is ready to put boots on the ground to support a peace deal between Russia and Ukraine. President Donald Trump says talks to end the war are moving rapidly. They spoke at the White House https://t.co/iQ7ifRVd9p …",
    "link": "https://ryueyes11.tistory.com/511507",
    "timestamp": "2025-02-28T02:05:43Z"
  },
  {
    "title": "US attorney general presses FBI to release all files on Epstein",
    "description": "The attorney general is accusing federal agents in New York of withholding documents related to sex offender Jeffrey Epstein.",
    "link": "https://www.bbc.com/news/articles/cyvee9rpdq6o",
    "timestamp": "2025-02-28T02:02:45Z"
  },
  {
    "title": "3 underrated (HBO) Max movies you should watch this weekend (February 28-March 2)",
    "description": "From February 28 to March 2, watch these three underrated movies on Max: a crime thriller, a moving portrait about a real hero, and a gripping drama.",
    "link": "https://www.digitaltrends.com/movies/underrated-hbo-max-movies-this-weekend-february-28-march-2-2025/",
    "timestamp": "2025-02-28T02:00:55Z"
  },
  {
    "title": "USAID squeeze: Trump’s cut-back of aid is a wake-up call for India",
    "description": "Ignore political slugfests over USAID allocations. America’s self-harming aid cut-off isn’t a big worry for India either, but China filling that vacuum to gain clout could be. We must step up our global outreach.",
    "link": "https://www.livemint.com/opinion/online-views/usaid-trump-india-china-aid-beijing-aids-ebola-africa-south-america-south-asia-elon-musk-doge-african-union-g20-bri-11740666382054.html",
    "timestamp": "2025-02-28T02:00:19Z"
  },
  {
    "title": "'(Don't) put a chick in it': Lucasfilm head Kathleen Kennedy out | Blaze Media",
    "description": "'(Don't) put a chick in it': Lucasfilm head Kathleen Kennedy out | Blaze Mediatheblaze.com",
    "link": "https://www.theblaze.com/align/don-t-put-a-chick-in-it-lucasfilm-head-kathleen-kennedy-out",
    "timestamp": "2025-02-28T02:00:00Z"
  },
  {
    "title": "Constitutional crisis looms as Trump admin flirts with defying the courts",
    "description": "US teeters on a constitutional crisis as President Trump faces court setbacks, with key figures like Vice President JD Vance and Elon Musk challenging judicial authority. Defiance threatens the balance of power among government branches, drawing concern from …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/constitutional-crisis-looms-as-trump-admin-flirts-with-defying-the-courts/articleshow/118614933.cms",
    "timestamp": "2025-02-28T01:58:43Z"
  },
  {
    "title": "Fired L.A. Fire Chief Kristin Crowley Fights Back; Appeals to City Council",
    "description": "Former Los Angeles Fire Department Chief Kristin Crowley is contesting her dismissal by Mayor Karen Bass, appealing directly to the City Council to reinstate her, which it can do by a two-thirds vote (10 of 15 members).\nThe post Fired L.A. Fire Chief Kristin …",
    "link": "https://www.breitbart.com/politics/2025/02/27/fired-l-a-fire-chief-kristin-crowley-fights-back-appeals-to-city-council/",
    "timestamp": "2025-02-28T01:57:37Z"
  },
  {
    "title": "Accused rapist Andrew Tate flies to the US after travel restrictions lifted",
    "description": "The brothers are facing serious charges in Romania and are being sued in the UK for over allegations of sexual violence and physical abuse.",
    "link": "https://www.abc.net.au/news/2025-02-28/andrew-tate-tristan-human-trafficking-travel-restrictions/104993326",
    "timestamp": "2025-02-28T01:55:44Z"
  },
  {
    "title": "Oklahoma Republicans clash over requiring schoolchildren to prove citizenship status",
    "description": "A proposal approved by the state's Board of Education exposed divisions over how far should states go to enforce President Donald Trump's immigration policies.",
    "link": "https://www.nbcnews.com/news/latino/oklahoma-republicans-clash-citizenship-schoolchildren-immigration-rcna194091",
    "timestamp": "2025-02-28T01:55:24Z"
  },
  {
    "title": "S&P 500 ends down as Nvidia tumbles following report",
    "description": "S&P 500 and Nasdaq ended sharply lower on Thursday due to Nvidia's disappointing quarterly report and data indicating a cooling U.S. economy, despite an upbeat revenue outlook. Nvidia's stock fell 8.5%, pulling down other chipmakers like Broadcom and Advanced…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-down-as-nvidia-tumbles-following-report/articleshow/118614872.cms",
    "timestamp": "2025-02-28T01:50:45Z"
  },
  {
    "title": "Trump Says Proposed Tariffs Will Take Effect March 4",
    "description": "The U.S. will impose new tariffs on Canada, Mexico and China, President Donald Trump announced Thursday (Feb. 27). Trump wrote in a post on Truth Social that the tariffs aim to deter the importation of drugs from Canada and Mexico and the manufacturing and su…",
    "link": "https://www.pymnts.com/politics/2025/trump-says-proposed-tariffs-will-take-effect-march-4/",
    "timestamp": "2025-02-28T01:49:31Z"
  },
  {
    "title": "Zelensky to sign Trump’s rare earth deal with ‘no more negotiation’ – US treasury secretary",
    "description": "The US and Ukraine have finalized their agreement on rare earths, and Vladimir Zelensky is expected to sign the final document Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613420-ukraine-minerals-deal-done/",
    "timestamp": "2025-02-28T01:47:48Z"
  },
  {
    "title": "Trump says tariffs on Chinese goods will double to 20%, effective next week",
    "description": "<p>NEW YORK &mdash; United States President Donald Trump announced on Thursday that the US would not only impose his originally outlined 10% tariffs on all Chinese imports beginning on Tuesday, but that these were now being doubled for an effective rate of 20…",
    "link": "https://www.bangkokpost.com/business/general/2970093/united-states-president-donald-trump-says-tariffs-on-chinese-imports-will-double-to-20-and-go-into-effect-next-week",
    "timestamp": "2025-02-28T01:44:00Z"
  },
  {
    "title": "‘I Object’: Megyn Kelly Says ‘Eff You’ To Anyone Still Supporting USAID",
    "description": "Megyn Kelly said she fully objects to the support of the USAID, adding, “eff\" anyone who still supports the agency after further information emerged.",
    "link": "https://dailycaller.com/2025/02/27/megyn-kelly-usaid-doge-hamas/",
    "timestamp": "2025-02-28T01:42:03Z"
  },
  {
    "title": "Taiwanese academia: Establishing US subsidiary may be TSMC's best option to navigate US pressure",
    "description": "With US President Donald Trump accusing Taiwan of taking away America's semiconductor manufacturing, his remarks have already sent ripples through Taiwan's industry and even its national security landscape. In response, Taiwan's academic experts propose that …",
    "link": "https://www.digitimes.com/news/a20250227PD201/tsmc-us-subsidiary-manufacturing-intel-taiwan.html",
    "timestamp": "2025-02-28T01:38:44Z"
  },
  {
    "title": "Trump, Starmer meeting: UK ready to put 'boots on the ground' for Ukraine; US, UK trade deal to be 'done quickly'",
    "description": "US President Trump met UK Prime Minister Starmer at the White House to discuss support for Ukraine's peace efforts, potential economic deals, and a strategic agreement on the Chagos Islands. Trump praised Ukrainian President Zelensky and hinted at softening t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-starmer-meeting-uk-ready-to-put-boots-on-the-ground-for-ukraine-us-uk-trade-deal-to-be-done-quickly/articleshow/118614771.cms",
    "timestamp": "2025-02-28T01:37:46Z"
  },
  {
    "title": "Breitbart Business Digest: Trump Inherited a Biden Economy Riddled with Hidden Weaknesses",
    "description": "The latest GDP report released Thursday by the Bureau of Economic Analysis confirms what many economists had been quietly warning: beneath the surface, the economy is weaker than it seemed.\nThe post Breitbart Business Digest: Trump Inherited a Biden Economy R…",
    "link": "https://www.breitbart.com/economy/2025/02/27/breitbart-business-digest-trump-inherited-a-biden-economy-riddled-with-hidden-weaknesses/",
    "timestamp": "2025-02-28T01:35:28Z"
  },
  {
    "title": "America's appetite for gold is 'sucking' bullion out of other countries",
    "description": "\"Supply chains have been disrupted because of this huge sucking sound, which has been the United States,\" said World Gold Council's John Reade.",
    "link": "https://www.cnbc.com/2025/02/28/us-gold-demand-is-sucking-bullion-out-of-other-countries.html",
    "timestamp": "2025-02-28T01:34:51Z"
  },
  {
    "title": "Five key takeaways as Donald Trump hosts UK Prime Minister Keir Starmer",
    "description": "Faced with criticisms of the UK's handling of free speech and trade, Starmer offered mild but indirect pushback.",
    "link": "https://www.aljazeera.com/news/2025/2/28/five-key-takeaways-as-donald-trump-hosts-uk-prime-minister-keir-starmer",
    "timestamp": "2025-02-28T01:34:33Z"
  },
  {
    "title": "India's Oct-Dec GDP growth seen stronger on improved rural demand, government spending",
    "description": "India's economic growth is expected to have picked up in the October-December quarter due to improved rural demand and increased government spending. GDP growth is projected at 6.3%, although still below the central bank's estimate. Urban demand shows some im…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/indias-oct-dec-gdp-growth-seen-stronger-on-improved-rural-demand-government-spending/articleshow/118614750.cms",
    "timestamp": "2025-02-28T01:33:12Z"
  },
  {
    "title": "Kash Patel May Ask UFC To Train FBI Agents—Report",
    "description": "FBI Director Kash Patel floated the idea, inspired by his new Deputy Director Dan Bongino, which would see FBI agents train in martial arts and self-defense.",
    "link": "https://www.newsweek.com/kash-patel-ask-ufc-train-fbi-agents-report-2037584",
    "timestamp": "2025-02-28T01:32:50Z"
  },
  {
    "title": "Thai Scion Taps U.S. Gas Wells To Help Family’s Coal Giant Go Green",
    "description": "Banpu CEO Sinon Vongkusolkit is charging ahead with a bold makeover of the Southeast Asian coal miner into a clean energy player— but it won’t be an easy run.",
    "link": "https://www.forbes.com/sites/phisanuphromchanya/2025/02/27/thai-scion-taps-us-gas-wells-to-help-familys-coal-giant-go-green/",
    "timestamp": "2025-02-28T01:30:00Z"
  },
  {
    "title": "Israel and Hamas have begun negotiating next phase of Gaza ceasefire, Egypt says",
    "description": "Negotiations on the Gaza ceasefire's next phase began in Cairo as Israel, Hamas, and mediators aim to settle key issues, including hostage returns and military withdrawals. Hamas' release of four hostages' remains in exchange for Palestinian prisoners marks t…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-and-hamas-have-begun-negotiating-next-phase-of-gaza-ceasefire-egypt-says/articleshow/118614726.cms",
    "timestamp": "2025-02-28T01:29:10Z"
  },
  {
    "title": "Bharat BillPay turns to education; From archives to AI",
    "description": "Happy Friday! Education sector has emerged as the next major opportunity for NPCI BharatBillPay. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/bharat-billpay-turns-to-education-from-archives-to-ai/articleshow/118614661.cms",
    "timestamp": "2025-02-28T01:28:31Z"
  },
  {
    "title": "Starmer Gives Trump UK State Visit Invite From King Charles III",
    "description": "British Prime Minister Keir Starmer has extended a state visit invitation to President Donald Trump on behalf of King Charles. Trump accepted the invitation, which came at the start of a face-to-face meeting on Thursday between Trump and Starmer at the White …",
    "link": "https://biztoc.com/x/d3ace867a9a8a69a",
    "timestamp": "2025-02-28T01:25:09Z"
  },
  {
    "title": "CNBC Daily Open: Nvidia’s slump and Trump’s renewed tariffs rocked markets",
    "description": "U.S. President Donald Trump said Thursday he would give tariffs on Canada and Mexico, which are temporarily paused, the go-ahead, while separately threatening on Wednesday to slap a 25% levy on the European Union.\nThose are some of the U.S.' closest allies an…",
    "link": "https://biztoc.com/x/710b7d58b377379b",
    "timestamp": "2025-02-28T01:25:07Z"
  },
  {
    "title": "Will have immediate, extremely strong response: Canada on US' tariffs",
    "description": "Canadian Prime Minister Justin Trudeau warned of a strong response to potential US tariffs set to begin on March 4 related to illicit drug flow. US President Donald Trump cited the fentanyl crisis and aims to impose tariffs on Canada, Mexico, and China to cur…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/will-have-immediate-extremely-strong-response-canada-on-us-tariffs/articleshow/118614701.cms",
    "timestamp": "2025-02-28T01:23:03Z"
  },
  {
    "title": "\"That's enough\": Donald Trump shoots down question on Canada during presser",
    "description": "US President Donald Trump interrupted UK Prime Minister Keir Starmer during a joint press conference when discussing Canada. Trump decided to continue tariffs on Canada and Mexico starting March 4 due to the illicit drug flow. He also announced a 10% tariff o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/thats-enough-donald-trump-shoots-down-question-on-canada-during-presser/articleshow/118614698.cms",
    "timestamp": "2025-02-28T01:22:05Z"
  },
  {
    "title": "Kim Jong Un oversees missile test, calls for full nuclear readiness",
    "description": "North Korean leader personally oversees test-launch of a strategic cruise missile, orders full preparedness for nuclear strikes.",
    "link": "https://www.israelnationalnews.com/news/404645",
    "timestamp": "2025-02-28T01:20:18Z"
  },
  {
    "title": "NYPost: Thomas Crooks May Have Had Accomplice, FBI Stonewalling — Ignores Obvious Evidence from July of Accomplices, FBI Lies, Possible FBI Involvement",
    "description": "The New York Post's recent coverage of alleged Trump assassin Thomas Crooks raises critical questions about possible accomplices and FBI transparency, highlighting discrepancies in the investigation that warrant deeper examination.\nThe post NYPost: Thomas Cro…",
    "link": "https://www.thegatewaypundit.com/2025/02/nypost-thomas-crooks-may-have-had-accomplice-fbi/",
    "timestamp": "2025-02-28T01:20:08Z"
  },
  {
    "title": "Trump trusts Putin to 'keep his word' and more takeaways from Starmer meet on Ukraine",
    "description": "President Trump hosted United Kingdom Prime Minister Keir Starmer at the White House on Thursday for discussions focused on the Russia-Ukraine war.",
    "link": "https://abcnews.go.com/Politics/trump-hosts-uks-keir-starmer-ukraine-talks-amid/story?id=119249871",
    "timestamp": "2025-02-28T01:19:06Z"
  },
  {
    "title": "Refugee aid groups say Trump administration is trying to circumvent court order",
    "description": "Major refugee aid groups say President Donald Trump’s administration appears to be trying to circumvent a federal court ruling this week that blocked his efforts to suspend the nation’s refugee admissions program",
    "link": "https://abcnews.go.com/Politics/wireStory/refugee-aid-groups-trump-administration-circumvent-court-order-119274438",
    "timestamp": "2025-02-28T01:18:17Z"
  },
  {
    "title": "Refugee aid groups say Trump administration is trying to circumvent court order",
    "description": "Refugee aid groups claim the Trump administration is attempting to bypass a court ruling that blocked the suspension of the U.S. Refugee Admissions Program. They have requested an emergency hearing after their cooperative agreements with the State Department …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/refugee-aid-groups-say-trump-administration-is-trying-to-circumvent-court-order/articleshow/118614665.cms",
    "timestamp": "2025-02-28T01:18:06Z"
  },
  {
    "title": "Iowa gives final approval to a bill to remove gender identity protections despite massive protests",
    "description": "The bill — the first legislative action in the country to remove nondiscrimination protections based on gender identity — heads to Republican Gov. Kim Reynolds.",
    "link": "https://www.nbcnews.com/politics/politics-news/iowa-gives-final-approval-bill-removing-gender-identity-protections-ma-rcna194146",
    "timestamp": "2025-02-28T01:16:37Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent on USA-Ukraine Minerals Deal: ‘The Deal Is Done,’ Zelensky Coming to White House to Sign It",
    "description": "U.S. Treasury Secretary Scott Bessent announced on Thursday that the United States and Ukraine have struck a deal on strategic minerals.\nThe post Treasury Secretary Scott Bessent on USA-Ukraine Minerals Deal: ‘The Deal Is Done,’ Zelensky Coming to White House…",
    "link": "https://www.breitbart.com/politics/2025/02/27/treasury-secretary-scott-bessent-usa-ukraine-minerals-deal-done/",
    "timestamp": "2025-02-28T01:16:15Z"
  },
  {
    "title": "Did the White House help end the Tate brothers travel ban?",
    "description": "The release of Tate and his brother came after discussions between US and Romanian officials.",
    "link": "https://www.bbc.com/news/articles/cly22wdedqeo",
    "timestamp": "2025-02-28T01:16:11Z"
  },
  {
    "title": "Firing top generals makes the U.S. less secure",
    "description": "How should we think about this rare purge at the very top of the uniformed military? Is it unprecedented?",
    "link": "https://www.japantimes.co.jp/commentary/2025/02/28/world/firing-top-generals-a-mistake/",
    "timestamp": "2025-02-28T01:15:00Z"
  },
  {
    "title": "Iowa gives final approval to a bill removing gender identity protections despite massive protests",
    "description": "A bill that would strip gender identity protections from Iowa’s civil rights code has received final legislative approval and now goes to the governor",
    "link": "https://abcnews.go.com/Health/wireStory/iowa-final-approval-bill-removing-gender-identity-protections-119270561",
    "timestamp": "2025-02-28T01:10:14Z"
  },
  {
    "title": "Hundreds of scientists and experts at key U.S. climate agency fired",
    "description": "Hundreds of scientists and experts have been fired from the National Oceanic and Atmospheric Administration (NOAA), a leading U.S. agency responsible for weather forecasting, climate analysis, marine conservation and more, a Democratic lawmaker said Thursday.…",
    "link": "https://japantoday.com/category/world/hundreds-of-firings-at-key-us-climate-agency-lawmaker",
    "timestamp": "2025-02-28T01:09:59Z"
  },
  {
    "title": "Commentary: The West's profit-driven playbook resurfaces in Ukraine",
    "description": "Photo taken on Feb. 27, 2022 shows smoke rising in the sky in Kiev, Ukraine. (Xinhua/Lu Jinbo)\nLook",
    "link": "http://en.people.cn/n3/2025/0228/c90000-20282685.html",
    "timestamp": "2025-02-28T01:07:39Z"
  },
  {
    "title": "Judge Rules Against Mass Firing Order: Here’s Where Trump And Musk Are Winning—And Losing—In Court",
    "description": "Dozens of lawsuits have been filed challenging the Trump administration’s policies.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/27/judge-rules-against-mass-firing-order-heres-where-trump-and-musk-are-winning-and-losing-in-court/",
    "timestamp": "2025-02-28T01:07:27Z"
  },
  {
    "title": "Asian shares echo US drop as tariffs hit sentiment",
    "description": "Shares in Australia and Japan opened lower after the S&P 500 lost 1.6% Thursday, erasing its gains for the year. The Nasdaq 100 declined 2.8%, as tech stocks weighed on US benchmarks.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-echo-us-drop-as-tariffs-hit-sentiment/articleshow/118614628.cms",
    "timestamp": "2025-02-28T01:07:20Z"
  },
  {
    "title": "January 6 Convict Pardoned by Trump Shot by Sheriff's Deputy",
    "description": "The man pardoned by President Donald Trump for his January 6 crimes was caught on camera threatening to shoot himself after getting into a heated altercation with a sheriff's deputy who ended up firing several rounds, killing the man. Check out the…",
    "link": "https://www.tmz.com/2025/02/27/matthew-huttle-j6-pardon-shot-by-deputy-jasper-county-indiana/",
    "timestamp": "2025-02-28T01:06:31Z"
  },
  {
    "title": "Trump’s E.P.A. Seeks to Deny Science That Americans Discovered",
    "description": "It’s in this country that scientists, funded by or working for the government, came to understand the role of carbon in our atmosphere, Bill McKibben reports.",
    "link": "https://www.newyorker.com/news/the-lede/trumps-epa-seeks-to-deny-science-that-americans-discovered",
    "timestamp": "2025-02-28T01:01:54Z"
  },
  {
    "title": "Trump’s DOJ Publicly Releases ‘Phase 1’ Of Jeffrey Epstein Files—What To Know",
    "description": "Attorney General Pam Bondi has suggested she’ll release “a lot of names” connected to the late financier.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/27/trumps-doj-publicly-releases-phase-1-of-jeffrey-epstein-files-what-to-know/",
    "timestamp": "2025-02-28T01:01:51Z"
  },
  {
    "title": "Woman suspected in Colorado Tesla dealership vandalism charged in federal court",
    "description": "A woman suspected in a string of vandalism against a Colorado Tesla dealership that included Molotov cocktails thrown at vehicles and a message apparently directed against Tesla co-founder Elon Musk has been charged in federal court",
    "link": "https://abcnews.go.com/US/wireStory/woman-suspected-colorado-tesla-dealership-vandalism-charged-federal-119269582",
    "timestamp": "2025-02-28T01:01:44Z"
  },
  {
    "title": "PM meeting with President Trump: 27 February 2025",
    "description": "Prime Minister Keir Starmer met President Trump in the White House.",
    "link": "https://www.gov.uk/government/news/pm-meeting-with-president-trump-27-february-2025",
    "timestamp": "2025-02-28T01:01:23Z"
  },
  {
    "title": "North Korea's Kim orders nuclear readiness after missile test, KCNA says",
    "description": "SEOUL (Reuters) -North Korean leader Kim Jong Un supervised a test-launch of strategic cruise missiles and ordered full readiness to use nuclear attack capability, which would ensure the most effective defence for the country, state media said on Friday. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/02/28/north-korea039s-kim-orders-nuclear-readiness-after-missile-test-kcna-says",
    "timestamp": "2025-02-28T01:01:00Z"
  },
  {
    "title": "Illinois Governor JB Pritzker Compares Trump Administration to Nazi Germany",
    "description": "In a provocative statement, Illinois Governor JB Pritzker draws stark parallels between the Trump administration and Nazi Germany, igniting a contentious debate on historical comparisons in contemporary politics.\nThe post Illinois Governor JB Pritzker Compare…",
    "link": "https://gatewayhispanic.com/video/illinois-governor-jb-pritzker-compares-trump-administration-to-nazi-germany/",
    "timestamp": "2025-02-28T01:00:13Z"
  },
  {
    "title": "A Fed Takeover By Trump — Or Any Other President — Is A Scary Thought",
    "description": "Actions of the central bank can be mistaken. But long history shows that no matter the party, presidents often push for actions that may not be good for the economy.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/02/27/a-fed-takeover-by-trump---or-any-other-president---is-a-scary-thought/",
    "timestamp": "2025-02-28T00:59:04Z"
  },
  {
    "title": "Fort Knox: Is gold there?",
    "description": "WASHINGTON — “Is the gold there?”\n\n\nAs the decades-old question about the legendary Fort Knox makes headlines again, U.S. President Donald Trump is on the hunt for answers.\n\n\n“We're actually going to Fort Knox to see if the gold is there, because maybe somebo…",
    "link": "https://www.voanews.com/a/fort-knox-is-gold-there-/7991126.html",
    "timestamp": "2025-02-28T00:57:13Z"
  },
  {
    "title": "After Crawling Under A Rock For Four Years, Dems Suddenly Reappear To Complain About High Prices",
    "description": "Throughout his presidential campaign, Trump promised to address the rampant inflation that took hold during Biden's term.",
    "link": "https://dailycaller.com/2025/02/27/democrats-inflation-trump-biden-prices/",
    "timestamp": "2025-02-28T00:56:42Z"
  },
  {
    "title": "Trump commends Zelensky ahead of White House talks",
    "description": "The US leader plays down earlier frictions and predicts a \"very good meeting\" on Friday.",
    "link": "https://www.bbc.com/news/articles/cqjdd2ej4peo",
    "timestamp": "2025-02-28T00:56:41Z"
  },
  {
    "title": "Kevin McCarthy Claims America Didn’t Build Rockets Until Elon Musk Arrived: ‘He Should Be Given a Medal’",
    "description": "Former Speaker Kevin McCarthy falsely credited South Africa-born billionaire Elon Musk with building the first rockets in the United States. \nThe post Kevin McCarthy Claims America Didn’t Build Rockets Until Elon Musk Arrived: ‘He Should Be Given a Medal’ fir…",
    "link": "https://www.mediaite.com/tv/kevin-mccarthy-claims-america-didnt-build-rockets-until-elon-musk-arrived-he-should-be-given-a-medal/",
    "timestamp": "2025-02-28T00:53:24Z"
  },
  {
    "title": "N. Korea says launched cruise missiles in ‘counterattack’ drills",
    "description": "North Korea carried out a test-launch of strategic cruise missiles in the Yellow Sea this week, in a drill Pyongyang said Friday aimed at showing off its “counterattack” capabilities. Leader Kim Jong Un was at the exercise, which took place on Wednesday, the …",
    "link": "https://www.digitaljournal.com/world/n-korea-says-launched-cruise-missiles-in-counterattack-drills/article",
    "timestamp": "2025-02-28T00:52:20Z"
  },
  {
    "title": "Remote US federal employees get ultimatum to move to Washington",
    "description": "The U.S. government's human resources agency has given employees nine days to decide whether to relocate to Washington, a move seen as an attempt to force federal workers to quit. Critics, including labor unions, argue that this abrupt directive is part of th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/remote-us-federal-employees-get-ultimatum-to-move-to-washington/articleshow/118614557.cms",
    "timestamp": "2025-02-28T00:51:45Z"
  },
  {
    "title": "Iowa lawmakers vote to remove gender identity protections from civil rights code",
    "description": "Iowa lawmakers on Thursday became the first in the nation to approve legislation that removes gender identity protections from the state's civil rights code. That's despite massive protests by opponents who say it could expose transgender people to discrimina…",
    "link": "https://www.cbc.ca/news/world/iowa-gender-identity-bill-1.7470831",
    "timestamp": "2025-02-28T00:50:15Z"
  },
  {
    "title": "Verizon becomes latest company to face probe by FCC boss over DEI policies",
    "description": "Verizon is awaiting FCC approval for its $9.6 billion purchase of Frontier Communications.",
    "link": "https://nypost.com/2025/02/27/business/fcc-chair-opens-probe-into-diversity-practices-at-verizon/",
    "timestamp": "2025-02-28T00:48:22Z"
  },
  {
    "title": "Social Security Administration Announces 'Significant Workforce Reductions' Ahead",
    "description": "Democrats accused the Trump administration of \"putting Social Security benefits at risk by firing the staff who help beneficiaries.\"",
    "link": "https://www.huffpost.com/entry/social-security-administration-buyouts-restructuring_n_67c0fb89e4b07026632971d6",
    "timestamp": "2025-02-28T00:43:22Z"
  },
  {
    "title": "US Postal Service chief urges employees to ignore Trump takeover rumors",
    "description": "Postmaster General Louis DeJoy urged USPS employees to disregard rumors of a takeover by President Trump, emphasizing that any structural changes would require federal law amendments. Despite financial struggles, new service standards aim to save $36 billion …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-postal-service-chief-urges-employees-to-ignore-trump-takeover-rumors/articleshow/118614513.cms",
    "timestamp": "2025-02-28T00:41:49Z"
  },
  {
    "title": "Is the tide starting to turn against Trump? – podcast",
    "description": "This week, Donald Trump continued to dominate the world stage, welcoming a procession of global leaders to Washington, including Keir Starmer. But while the ‘special relationship’ is front and centre in the UK, attention in the US is very much elsewhere. As t…",
    "link": "https://biztoc.com/x/9b83c46e7aab7914",
    "timestamp": "2025-02-28T00:40:21Z"
  },
  {
    "title": "Trump dodges plea from Britain's Starmer for Ukraine security guarantee",
    "description": "Britain's prime minister had argued that there could be no long-term peace in Ukraine without firm U.S. security guarantees.",
    "link": "https://www.japantimes.co.jp/news/2025/02/28/world/politics/trump-starmer-ukraine-security-dodge/",
    "timestamp": "2025-02-28T00:40:00Z"
  },
  {
    "title": "NATO’s utter failure and Zelensky’s blustering BS",
    "description": "'U.S. President Joe Biden and his intel team flipped off Russia, and 1 million people died'",
    "link": "https://www.wnd.com/2025/02/natos-utter-failure-and-zelenskys-blustering-bs/",
    "timestamp": "2025-02-28T00:39:10Z"
  },
  {
    "title": "FPIs shy away from G-Secs, FAR inflows to stay volatile",
    "description": "The first week of the month saw inflows of ₹4,970 crore as funds flowed into Indian debt in anticipation of a rate cut. The second week, however, saw outflows of ₹8,163 crore as a rate cut materialised and the rupee touched record lows, making Indian bonds le…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-shy-away-from-g-secs-far-inflows-to-stay-volatile/articleshow/118614499.cms",
    "timestamp": "2025-02-28T00:38:38Z"
  },
  {
    "title": "The top task for Team Trump",
    "description": "'There should be serious consideration of reevaluating means-tested welfare programs'",
    "link": "https://www.wnd.com/2025/02/the-top-task-for-team-trump/",
    "timestamp": "2025-02-28T00:35:07Z"
  },
  {
    "title": "European countries vow retaliation against Trump's tariff threat",
    "description": "Flags of the European Union fly outside the Berlaymont Building, the European Commission headquarte",
    "link": "http://en.people.cn/n3/2025/0228/c90000-20282593.html",
    "timestamp": "2025-02-28T00:33:13Z"
  },
  {
    "title": "Trump dodges plea from Britain's Starmer for Ukraine security guarantees",
    "description": "President Donald Trump said on Thursday that a minerals deal with Ukraine is the security guarantee Kyiv needs against Russia, brushing aside a plea from British Prime Minister Keir Starmer for a commitment of more U.S. military support. Starmer, who was meet…",
    "link": "https://japantoday.com/category/world/trump-dodges-plea-from-britain%27s-starmer-for-ukraine-security-guarantees",
    "timestamp": "2025-02-28T00:32:55Z"
  },
  {
    "title": "House budget resolution doesn't cut taxes on tips, overtime or Social Security. Here's why",
    "description": "A budget resolution lays out a blueprint for government spending but can't change tax laws.",
    "link": "https://www.snopes.com//news/2025/02/27/budget-resolution-taxes-tips/",
    "timestamp": "2025-02-28T00:31:00Z"
  },
  {
    "title": "Trump says WH working 'very hard' to pass stopgap bill",
    "description": "United States President Donald Trump stated that his administration is working \"very hard\" with Congress to pass a \"clean and temporary government funding Bill\" and called for its adoption.\"As usual, ...",
    "link": "https://biztoc.com/x/ba2aadc01290e384",
    "timestamp": "2025-02-28T00:29:20Z"
  },
  {
    "title": "USAGM announces Kari Lake as special adviser",
    "description": "The U.S. Agency for Global Media on Thursday announced that journalist-turned-politician Kari Lake will join the agency as a special adviser.\n\n\nA journalist for 30 years, Lake was named by President Donald Trump in December as the person he would like to have…",
    "link": "https://www.voanews.com/a/usagm-announces-kari-lake-as-special-adviser-/7990843.html",
    "timestamp": "2025-02-28T00:28:26Z"
  },
  {
    "title": "Mexico sends drug lord Caro Quintero and 28 others to the US as officials meet with Trump team",
    "description": "The 29 prisoners sent to the U.S. faced charges related to drug trafficking.",
    "link": "https://www.denverpost.com/2025/02/27/mexico-drug-lord-traffickers/",
    "timestamp": "2025-02-28T00:25:41Z"
  },
  {
    "title": "Mexico sends drug lord Caro Quintero and 28 others to the US as officials meet with Trump team",
    "description": "The 29 prisoners sent to the U.S. faced charges related to drug trafficking.",
    "link": "https://www.bostonherald.com/2025/02/27/mexico-drug-lord-traffickers/",
    "timestamp": "2025-02-28T00:25:41Z"
  },
  {
    "title": "What to know about the Feb. 28 economic boycott",
    "description": "A grassroots organization is encouraging U.S. residents not to spend any money Friday as an act of “economic resistance” to protest what the group's founder sees as the malign influence of billionaires, big corporations and both major political parties on the…",
    "link": "https://www.pbs.org/newshour/politics/what-to-know-about-the-feb-28-economic-boycott",
    "timestamp": "2025-02-28T00:24:40Z"
  },
  {
    "title": "Team Trump want to MAGAfy the world. Our leaders need a plan, fast",
    "description": "Donald Trump 2.0 is a very different beast. What are our leaders going to do about it?\nThe post Team Trump want to MAGAfy the world. Our leaders need a plan, fast appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/28/donald-trump-maga-world-australia/",
    "timestamp": "2025-02-28T00:22:49Z"
  },
  {
    "title": "Laura Loomer: Americans 'Can't Trust' Epstein Files Released by Trump's DOJ",
    "description": "Conservative influencers were photographed holding \"Epstein Files\" binders outside the White House on Thursday.",
    "link": "https://www.newsweek.com/laura-loomer-americans-cant-trust-epstein-files-released-trumps-doj-2037542",
    "timestamp": "2025-02-28T00:21:03Z"
  },
  {
    "title": "Trump says ongoing Gaza talks are 'pretty good'",
    "description": "US President Donald Trump said \"We'll have to see what happens\" in regards to a second phase of the hostage deal.",
    "link": "https://www.jpost.com/middle-east/article-844116",
    "timestamp": "2025-02-28T00:20:38Z"
  },
  {
    "title": "Exclusive — Rubio: ‘Strong Desire’ in Middle East for Abraham Accords Expansion, ‘World Has Been Dying for’ Trump’s ‘Kind of Leadership’",
    "description": "WASHINGTON — Secretary of State Marco Rubio told Breitbart News that his conversations with leaders across the Middle East suggest a \"strong desire\" in the region to see expansion of the historic Abraham Accords, and that worldwide the planet is thrilled Pres…",
    "link": "https://www.breitbart.com/politics/2025/02/27/exclusive-rubio-strong-desire-in-middle-east-for-abraham-accords-expansion-world-has-been-dying-for-trumps-kind-of-leadership/",
    "timestamp": "2025-02-28T00:20:26Z"
  },
  {
    "title": "Report: Meta Looks to Raise $35 Billion to Develop Data Centers",
    "description": "Meta is reportedly in talks to raise $35 billion to help finance the development of data centers in the U.S. The talks are at an early stage and there’s no certainty a deal will be reached, Bloomberg reported Thursday (Feb. 27), citing unnamed sources. Meta d…",
    "link": "https://www.pymnts.com/meta/2025/report-meta-looks-to-raise-35-billion-to-develop-data-centers/",
    "timestamp": "2025-02-28T00:19:52Z"
  },
  {
    "title": "Immediately orders new carpeting, window coverings for 'dingy' office...",
    "description": "FBI Director Kash Patel walked into his new office on the seventh floor of the bureau’s headquarters last week and made an immediate order – he wanted new carpeting and window coverings, calling the office “dingy.”",
    "link": "https://www.cnn.com/2025/02/27/politics/kash-patel-first-week-fbi/index.html",
    "timestamp": "2025-02-28T00:19:38Z"
  },
  {
    "title": "Trump could meet King in Scotland to plan state visit",
    "description": "The US president is invited to a royal residence in Scotland to discuss the logistics of a second state visit.",
    "link": "https://www.bbc.com/news/articles/cly4403gjxdo",
    "timestamp": "2025-02-28T00:18:12Z"
  },
  {
    "title": "Trumpworld views MAGA aides as 'glorified babysitters' for Elon Musk and DOGE: report",
    "description": "Tech billionaire Elon Musk has two \"glorified babysitters\" — Stephen and Katie Miller — who insiders say are the main reasons Musk hasn't clashed with President Donald Trump, according to a report.Musk's Department of Government Efficiency initiative is taske…",
    "link": "https://www.rawstory.com/stephen-miller-2671236797/",
    "timestamp": "2025-02-28T00:15:55Z"
  },
  {
    "title": "UK's Starmer urges Trump not to abandon Ukraine in press to end Russian war",
    "description": "Trump expressed confidence Russian President Vladimir Putin won't press to restart the war if a truce can be reached. \"I think he'll keep his word.\"",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_53ae7139-3338-552e-9823-73b4a881bca5.html",
    "timestamp": "2025-02-28T00:15:00Z"
  },
  {
    "title": "Trump tariffs and tax cut have Alberta's finance minister seeing red (ink)",
    "description": "Nate Horner really didn't want a deficit. But he has one, thanks to a new threat and an old campaign pledge.",
    "link": "https://www.cbc.ca/news/canada/calgary/alberta-2025-budget-deficit-tax-cut-trump-nate-horner-analysis-1.7470814",
    "timestamp": "2025-02-28T00:13:57Z"
  },
  {
    "title": "FCC Commissioner Trolls Time-Wasting Dem By Showing Off His Own Linguistic Skills",
    "description": "Commissioner Nathan Simington of the FCC repeated his remarks in Romanian Thursday in a jab at Commissioner Anna Gomez during the agency's monthly open meeting.",
    "link": "https://dailycaller.com/2025/02/27/fcc-commissioner-trolls-time-wasting-dem-by-showing-off-his-own-linguistic-skills/",
    "timestamp": "2025-02-28T00:13:13Z"
  },
  {
    "title": "Why Aren’t We in the Streets?",
    "description": "Susan B. Glasser on President Donald Trump’s power trip, and how Democrats in Washington seem to have agreed on the strategic response of doing nothing.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/why-arent-we-in-the-streets",
    "timestamp": "2025-02-28T00:11:50Z"
  }
]