[
  {
    "title": "Jimmy Kimmel Floats Escape From US",
    "description": "Jimmy Kimmel is a desperate man looking for a way out, he revealed in a recent interview. The late-night host sees the writing on the wall, including the likely evisceration of his own ABC show. Rather than bear it, Kimmel said he’s giving serious thought to …",
    "link": "https://freerepublic.com/focus/f-chat/4333983/posts",
    "timestamp": "2025-08-11T18:18:42Z"
  },
  {
    "title": "Illegal Alien Sentenced to Life in Prison Without Parole for Raping, Murdering Rachel Morin",
    "description": "An illegal alien MS-13 gang member, convicted of raping and murdering 37-year-old Rachel Morin — a mother of five children — in April, was sentenced to life in prison without the possibility of parole on Monday.\nThe post Illegal Alien Sentenced to Life in Pri…",
    "link": "https://www.breitbart.com/politics/2025/08/11/illegal-alien-sentenced-for-raping-murdering-rachel-morin/",
    "timestamp": "2025-08-11T18:16:37Z"
  },
  {
    "title": "Experts stunned as judge 'unloads' on Trump DOJ over ‘disingenuous’ legal move",
    "description": "Judge Paul A. Engelmayer called out President Donald Trump's administration for what he called a \"disingenuous\" effort to unseal the grand jury documents around Jeffrey Epstein. Legal analysts were quick to point out the harshness of the judge's language. \"Ju…",
    "link": "https://www.rawstory.com/jeffrey-epstein-files/",
    "timestamp": "2025-08-11T18:16:22Z"
  },
  {
    "title": "Satellite Photo Shows Israel Military Buildup Near Gaza",
    "description": "A new image reveals Israel is massing troops, signaling a possible ground invasion as the government approves a plan to seize Gaza City.",
    "link": "https://www.newsweek.com/satellite-photo-israel-military-buildup-gaza-2111854",
    "timestamp": "2025-08-11T18:16:08Z"
  },
  {
    "title": "Trump administration stops illegal freeze of $5B EV charger funds after losing in court | TechCrunch",
    "description": "The money is on the table again, but with fewer requirements for proving out safety, environmental impacts, and inclusion of minority- and women-owned businesses.",
    "link": "https://techcrunch.com/2025/08/11/trump-administration-stops-illegal-freeze-of-5b-ev-charger-funds-after-losing-in-court/",
    "timestamp": "2025-08-11T18:16:06Z"
  },
  {
    "title": "Trump says his administration looking at reclassifying marijuana",
    "description": "Trump says his administration looking at reclassifying marijuanago.com",
    "link": "https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149",
    "timestamp": "2025-08-11T18:16:00Z"
  },
  {
    "title": "Trump Says Gold Imports Won't Be Tariffed In Reprieve For Market",
    "description": "President Donald Trump said Monday imports of gold will not face US tariffs, weighing in after a federal ruling caused chaos and confusion in global bullion markets. “Gold will not be Tariffed!” Trump posted on social media.  Gold futures traded on New York’s…",
    "link": "https://www.ndtvprofit.com/world/trump-says-gold-imports-wont-be-tariffed-in-reprieve-for-market",
    "timestamp": "2025-08-11T18:15:53Z"
  },
  {
    "title": "Trump’s D.C. Police Takeover Is His Latest Made-Up ‘Emergency’ Power Grab",
    "description": "The president offered misleading statements about crime trends in the nation’s capital.",
    "link": "https://www.huffpost.com/entry/trump-dc-police-takeover-emergency_n_689a2794e4b0be3f5edc4aff",
    "timestamp": "2025-08-11T18:13:58Z"
  },
  {
    "title": "Trump on Putin talks: 'I'm not going to make a deal'",
    "description": "US President Donald Trump is not aiming for an agreement on the Ukraine war from his upcoming meeting with Russian President Vladimir Putin: \"I'm not going...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:250811-99-709974/",
    "timestamp": "2025-08-11T18:13:33Z"
  },
  {
    "title": "Putin Becomes First Russian Leader To Visit Alaska",
    "description": "Russian influence in Alaska – the setting for the high-stakes meeting between Presidents Donald Trump and Vladimir Putin – still lingers in parts of the state the U.S. bought from Russia more than 150 years ago.\nThe region’s connection to Russia dates back ce…",
    "link": "https://biztoc.com/x/a4d4162a774ec9f3",
    "timestamp": "2025-08-11T18:13:01Z"
  },
  {
    "title": "D.C. Police Put Under Federal Control, Are Now ‘Allowed to Do Whatever the Hell They Want’",
    "description": "Feds will take control of the Police, National Guard deployed after \"Big Balls\" car jacking",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-police-dc-national-guard-1235405198/",
    "timestamp": "2025-08-11T18:12:05Z"
  },
  {
    "title": "Trump Mistakes Alaska For Russia, And Yes, There's Snark",
    "description": "Some people wondered if the president was actually announcing he plans to give Alaska back to Russia during Friday's upcoming meeting.",
    "link": "https://www.huffpost.com/entry/social-media-roasts-trump-for-confusing-russia-with-alaska_n_689a17c6e4b0c2e59a932a07",
    "timestamp": "2025-08-11T18:09:03Z"
  },
  {
    "title": "Here Are The Leading Candidates For The Next Federal Reserve Chair",
    "description": "Currently Waller, Warsh and Hassett are the main candidates to replace Powell as Fed Chair in 2026.",
    "link": "https://www.forbes.com/sites/simonmoore/2025/08/11/here-are-the-leading-candidates-for-the-next-federal-reserve-chair/",
    "timestamp": "2025-08-11T18:07:41Z"
  },
  {
    "title": "Investors pause for breath at start of busy week for tariffs and talks on Ukraine",
    "description": "Defence stocks take a step back on prospect of a peace deal in talks between Donald Trump and Vladimir Putin",
    "link": "https://www.irishtimes.com/business/markets/2025/08/11/investors-pause-for-breath-at-start-of-busy-week-for-tariffs-and-talks-on-ukraine/",
    "timestamp": "2025-08-11T18:06:32Z"
  },
  {
    "title": "Epstein files: A judge confirms the Trump team’s smokescreen",
    "description": "A judge confirmed the Trump administration’s big initial move toward supposed transparency was, in fact, a smokescreen.",
    "link": "https://www.cnn.com/2025/08/11/politics/epstein-files-judge-ruling-grand-jury-materials",
    "timestamp": "2025-08-11T18:06:32Z"
  },
  {
    "title": "Bill Maher claims The View is not ‘the best advertisement for women’",
    "description": "The TV host appeared on ‘The View’ in May 2024",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/bill-maher-the-view-b2805657.html",
    "timestamp": "2025-08-11T18:06:12Z"
  },
  {
    "title": "In a Gross Exaggeration of Fact, Trump Deployed the National Guard in D.C. to “Jail” Violent Criminals",
    "description": "Crime in the nation’s capital is actually at a thirty-year low. But that won’t stop the president from evicting the homeless, too.",
    "link": "https://www.esquire.com/news-politics/politics/a65655587/trump-national-guard-deployment-washington-dc/",
    "timestamp": "2025-08-11T18:06:00Z"
  },
  {
    "title": "Russia is a warring country – Trump",
    "description": "Moscow has been fighting wars for centuries, the US president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622769-trump-russia-warring-nation/",
    "timestamp": "2025-08-11T18:04:07Z"
  },
  {
    "title": "Trump Assembles Top Cabinet Officials To Put The Swamp On Notice: Crime Stops Today",
    "description": "President Donald Trump gathered his top cabinet officials on Monday to declare that they are collectively cracking down on violent criminals in Washington DC.",
    "link": "https://dailycaller.com/2025/08/11/trump-top-cabinet-officials-dc-crime/",
    "timestamp": "2025-08-11T18:02:47Z"
  },
  {
    "title": "Gavin Newsom Issues New Warning to Donald Trump: 'Playing with Fire'",
    "description": "The GOP majority in Texas wants to redraw districts so that five more Republicans can be elected to the U.S. House.",
    "link": "https://biztoc.com/x/2958930d28eee5d6",
    "timestamp": "2025-08-11T18:02:20Z"
  },
  {
    "title": "Why Did Trump Deploy the National Guard to Washington D.C.? The Reason",
    "description": "Trump activated the national guard to D.C. and explained why in a press briefing on August 11.",
    "link": "https://hollywoodlife.com/2025/08/11/why-did-trump-deploy-the-national-guard-to-washington-d-c/",
    "timestamp": "2025-08-11T18:00:56Z"
  },
  {
    "title": "Coffee Break: Larry Ellison + Oracle + AI + Paramount + Trump = Total Info Control",
    "description": "Oracle billionaire CEO Larry Ellison is aggressively moving into media and military contracting to consolidate his power in the Trump 2.0 era.",
    "link": "https://www.nakedcapitalism.com/2025/08/larry-ellison-oracle-ai-paramount-trump-skydance.html",
    "timestamp": "2025-08-11T18:00:26Z"
  },
  {
    "title": "Multiple Men Have Impersonated ICE Agents To Kidnap And Assault Women",
    "description": "In a letter shared with HuffPost, the Democratic Women’s Caucus urged DHS to mandate ICE agents to “visibly and clearly identify themselves\" when making arrests.",
    "link": "https://www.huffpost.com/entry/multiple-men-have-impersonated-ice-agents-to-kidnap-and-assault-women_n_689a19a2e4b07a70fa09262d",
    "timestamp": "2025-08-11T18:00:20Z"
  },
  {
    "title": "Solar Stocks Outshine Oil and Gas Benchmarks After Climate Credit Cuts",
    "description": "Last month, U.S. President Donald Trump signed into law ‘One Big Beautiful Bill Act’, rolling back many clean energy credits enacted by former President Joe Biden under the Inflation Reduction Act (IRA) of 2022. As widely expected, OBBBA is far from beautiful…",
    "link": "https://oilprice.com/Alternative-Energy/Solar-Energy/Solar-Stocks-Outshine-Oil-and-Gas-Benchmarks-After-Climate-Credit-Cuts.html",
    "timestamp": "2025-08-11T18:00:00Z"
  },
  {
    "title": "Trump Promised to Fix Inflation. He’s Doing This Instead.",
    "description": "If Trump continues to conduct worksite raids, the cost of doing business for farms and other industries that rely on immigrant labor will rise.",
    "link": "https://slate.com/news-and-politics/2025/08/trump-promises-inflation-ice-raids-cost.html",
    "timestamp": "2025-08-11T18:00:00Z"
  },
  {
    "title": "Treasury for Trump-Backed World Liberty to Raise $1.5B for WLFI Buys",
    "description": "Financial infrastructure firm ALT5 Sigma Corporation signaled its plans to establish a $WLFI treasury, shortly after the token became poised to trade.",
    "link": "https://decrypt.co/334505/treasury-trump-backed-world-liberty-raise-1-5b-wlfi-buys",
    "timestamp": "2025-08-11T17:59:34Z"
  },
  {
    "title": "Gavin Newsom Issues New Warning to Donald Trump: 'Playing with Fire'",
    "description": "The GOP majority in Texas wants to redraw districts so that five more Republicans can be elected to the U.S. House.",
    "link": "https://www.newsweek.com/gavin-newsom-donald-trump-warning-texas-california-redistricting-2111940",
    "timestamp": "2025-08-11T17:59:07Z"
  },
  {
    "title": "Orsted Turns to Shareholders as U.S. Offshore Wind Market Sours",
    "description": "Shares in Orsted plunged to a record low on Monday as the wind farm developer asked shareholders for $9.4 billion to help fund a U.S. project, after potential partners were put off by U.S. President Donald Trump's hostility to wind power.",
    "link": "https://gcaptain.com/orsted-turns-to-shareholders-as-u-s-offshore-wind-market-sours/",
    "timestamp": "2025-08-11T17:58:27Z"
  },
  {
    "title": "Tegna Stock Rockets On Nexstar Merger Talks; FCC Appears Set To Ease Local TV Rules In Order To Smooth Deal’s Path",
    "description": "Shares in local TV giant Tegna surged nearly 30% in mid-day trading Monday on news that leading station owner Nexstar is in advanced talks to acquire the company. A source familiar with the discussions confirmed them to Deadline. The valuation remains unclear…",
    "link": "http://deadline.com/2025/08/tegna-nexstar-acquisition-talks-fcc-local-tv-1236483684/",
    "timestamp": "2025-08-11T17:57:14Z"
  },
  {
    "title": "Us to Take Cut of AI Chip Sales to China. Security Risk or Easy Money?",
    "description": "Nvidia and AMD agreed to share 15 percent of their revenues from AI chip sales to China with the U.S. government in an unusual export deal.",
    "link": "https://www.newsweek.com/us-take-cut-ai-chip-sales-china-security-risk-easy-money-2111850",
    "timestamp": "2025-08-11T17:56:38Z"
  },
  {
    "title": "Trump knocks Zelensky for resisting ‘land swap’ with Russia",
    "description": "President Trump on Monday criticized Ukrainian President Volodymyr Zelensky over the leader’s resistance to cede territory to Russia, saying he disagrees “very, very severely” with Zelensky. “I get along with Zelensky, but, you know, I disagree with what he’s…",
    "link": "https://freerepublic.com/focus/f-chat/4333977/posts",
    "timestamp": "2025-08-11T17:56:19Z"
  },
  {
    "title": "Trump slams DC crime as 'embarrassing' as he preps for high-stakes Putin meeting",
    "description": "President Trump calls D.C. crime situation embarrassing before Putin meeting, announces federal law enforcement deployment to combat violent gangs and criminals.",
    "link": "https://www.foxnews.com/politics/trump-slams-dc-crime-embarrassing-he-preps-high-stakes-putin-meeting",
    "timestamp": "2025-08-11T17:55:14Z"
  },
  {
    "title": "Trump announces federal takeover of D.C. police, deploys National Guard to fight crime (Washington Post)",
    "description": "Washington Post:\nTrump announces federal takeover of D.C. police, deploys National Guard to fight crime  —  President Donald Trump said Monday that he is putting the District police under federal control — a move expected to last 30 days — and deploying the D…",
    "link": "https://www.memeorandum.com/250811/p76",
    "timestamp": "2025-08-11T17:55:00Z"
  },
  {
    "title": "Top House Republican says Trump 'rightly' took over DC police, demands Bowser, others testify on crime",
    "description": "House Oversight Committee Chair James Comer lauded President Donald Trump's decision to take over the Washington, D.C., police and demanded that Mayor Muriel Bowser testify when lawmakers return.",
    "link": "https://www.foxnews.com/politics/top-house-republican-says-trump-rightly-took-over-dc-police-demands-mayor-bowser-others-testify-crime",
    "timestamp": "2025-08-11T17:52:27Z"
  },
  {
    "title": "Gold will not be tariffed, says Trump amid chaos that shook the bullion markets",
    "description": "Donald Trump has announced that gold imports will not face additional tariffs. This statement comes after confusion arose regarding recent duty hikes. US customs authorities had suggested certain gold bars might be subject to duties. The initial letter caused…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/gold-will-not-be-tariffed-says-trump-amid-chaos-that-shook-the-bullion-markets/articleshow/123242479.cms",
    "timestamp": "2025-08-11T17:51:03Z"
  },
  {
    "title": "Smithsonian Restores Trump to Impeachment Exhibit, With Updated Text",
    "description": "The National Museum of American History had removed a display that mentioned President Donald Trump's two prior impeachments.",
    "link": "https://www.artnews.com/art-news/news/smithsonian-american-history-museum-trump-impeachment-display-1234749215/",
    "timestamp": "2025-08-11T17:50:52Z"
  },
  {
    "title": "Domestic Violence Survivor and Son Detained Crossing Canadian Border",
    "description": "The mother of three thought she had her paperwork in order when making a quick trip to Vancouver.",
    "link": "https://www.newsweek.com/domestic-violence-survivor-detained-ice-us-canada-border-2111838",
    "timestamp": "2025-08-11T17:48:42Z"
  },
  {
    "title": "Trump says he will try to get back territory for Ukraine in talks with Putin",
    "description": "US President Donald Trump has said he will try to get some territory back for Ukraine during his meeting with Russian President Vladimir Putin on Friday. \"Russia's occupied a big portion of Ukraine. They occupied prime territory. We're going to try to get som…",
    "link": "https://freerepublic.com/focus/f-chat/4333973/posts",
    "timestamp": "2025-08-11T17:47:59Z"
  },
  {
    "title": "Trump and Newsom fight over National Guard heads to trial in California",
    "description": "A fight between President Donald Trump and Democratic Gov. Gavin Newsom over the National Guard's presence in California will come to a head in a three-day trial.",
    "link": "https://www.foxnews.com/politics/trump-and-newsom-fight-over-national-guard-heads-to-trial-in-california",
    "timestamp": "2025-08-11T17:47:56Z"
  },
  {
    "title": "It's The Trump/Putin Russia/Ukraine Farce, Alaska Edition!",
    "description": "They're going to carve up Ukraine, then make Ukraine say thank you.",
    "link": "https://www.wonkette.com/p/its-the-trumpputin-russiaukraine",
    "timestamp": "2025-08-11T17:46:49Z"
  },
  {
    "title": "Trump expected to meet with Intel CEO after calling for his ouster",
    "description": "US President Donald Trump said last week that Intel’s CEO Lip-Bu Tan was 'highly conflicted'.",
    "link": "https://www.aljazeera.com/economy/2025/8/11/trump-expected-to-meet-with-intel-ceo-after-calling-for-his-ouster",
    "timestamp": "2025-08-11T17:46:39Z"
  },
  {
    "title": "The youth of America have Donald Trump, Lawrence Taylor calling their plays",
    "description": "Lawrence Taylor never asked to serve on President Donald Trump’s Council on Sports, Fitness and Nutrition. The irony of Taylor, a registered sex offender, on a board at the behest of Trump, a leader whose alleged ties to a deceased, high-profile sex offender …",
    "link": "https://andscape.com/features/the-youth-of-america-have-donald-trump-lawrence-taylor-calling-their-plays/",
    "timestamp": "2025-08-11T17:46:17Z"
  },
  {
    "title": "President Trump says other US cities could be next as he deploys National Guard to DC",
    "description": "President Trump mentioned New York, Baltimore, Chicago and Oakland as cities where he may deploy the National Guard to crack down on crime.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/11/trump-national-guard-deployment-us-cities-dc/85610923007/",
    "timestamp": "2025-08-11T17:45:45Z"
  },
  {
    "title": "Chimaev rules himself out of UFC White House: \"With this face they won't let me in\"",
    "description": "Khamzat Chimaev (14-0) will have the opportunity of a lifetime this Saturday, August 16 at UFC 319, as he will face Dricus Du Plessis (23-2) for the middleweight title. The Chechen",
    "link": "https://www.marca.com/en/ufc/2025/08/11/689a2b55268e3ee7318b459f.html",
    "timestamp": "2025-08-11T17:45:32Z"
  },
  {
    "title": "Trump’s Anti-Voter Agenda Crystallizes",
    "description": "Will voters have the final say in 2026?  \nIn recent years, despite the pandemic, violence and intense pressure, American elections were secure and their results were reported accurately. Election officials worked together across party lines. The system held.\n…",
    "link": "https://msmagazine.com/2025/08/11/trump-voters-2026-stolen-election-voting-machines-justice-department/",
    "timestamp": "2025-08-11T17:44:27Z"
  },
  {
    "title": "Trump says gold will not face tariffs",
    "description": "U.S. President Donald Trump on Monday said gold would not be subject to tariffs, but gave no other details. \"Gold will not be Tariffed!\" Trump said in a...",
    "link": "https://finance.yahoo.com/news/trump-says-gold-not-face-174418642.html",
    "timestamp": "2025-08-11T17:44:18Z"
  },
  {
    "title": "Al Sharpton Says Trump’s Washington, D.C., Crime Crackdown Should Include Jan. 6 Rioters | Video",
    "description": "\"He's a man that pardoned scores of people for violating the law and beating up policemen,\" Sharpton says\nThe post Al Sharpton Says Trump’s Washington, D.C., Crime Crackdown Should Include Jan. 6 Rioters | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/al-sharpton-donald-trump-washington-dc-crime-crackdown-jan-6-riot-morning-joe/",
    "timestamp": "2025-08-11T17:43:28Z"
  },
  {
    "title": "Trump says gold will not be tariffed",
    "description": "Trump says gold will not be tariffedcnbc.com",
    "link": "https://www.cnbc.com/2025/08/11/trump-gold-tariffs-futures.html",
    "timestamp": "2025-08-11T17:43:07Z"
  },
  {
    "title": "Trump says Ukraine, Russia will have to swap some land for peace",
    "description": "WASHINGTON: US President Donald Trump said on Monday (Aug 11) that both Ukraine and Russia would need to cede land to each other to end the war, adding that his upcoming talks with Russian President Vladimir Pu",
    "link": "https://www.channelnewsasia.com/world/trump-says-ukraine-russia-will-have-swap-some-land-peace-5289181",
    "timestamp": "2025-08-11T17:42:00Z"
  },
  {
    "title": "Brazil-US meeting canceled amid tariff dispute, says finance minister",
    "description": "SAO PAULO (Reuters) -Brazil Finance Minister Fernando Haddad said on Monday that his virtual meeting with U.S. Treasury Secretary Scott Bessent had been canceled after initially being scheduled for Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/12/brazil-us-meeting-canceled-amid-tariff-dispute-says-finance-minister",
    "timestamp": "2025-08-11T17:40:00Z"
  },
  {
    "title": "Trump says crime in D.C. is out of control. Here's what the data shows. (Washington Post)",
    "description": "Washington Post:\nTrump says crime in D.C. is out of control.  Here's what the data shows.  —  Crime in D.C. and nationwide is declining from pandemic-era spikes.  But individual incidents can shake residents and capture the president's attention.  —  Presiden…",
    "link": "https://www.memeorandum.com/250811/p74",
    "timestamp": "2025-08-11T17:40:00Z"
  },
  {
    "title": "Secretary-General Welcomes Azerbaijan-Armenia Joint Declaration",
    "description": "The following statement was issued today by the Spokesman for UN Secretary-General António Guterres:",
    "link": "https://press.un.org/en/2025/sgsm22759.doc.htm",
    "timestamp": "2025-08-11T17:39:35Z"
  },
  {
    "title": "‘I Don’t Want You to Be Comfortable’: Trump Shoots Down Idea of ‘Big, Beautiful Briefing Room’ for Reporters",
    "description": "President Donald Trump jokingly pooh-poohed the idea of a \"big beautiful\" White House briefing room after announcing the federalization of Washington, D.C., on Monday, telling reporters, \"I don't want you to be comfortable.\"\nThe post ‘I Don’t Want You to Be C…",
    "link": "https://www.mediaite.com/media/news/i-dont-want-you-to-be-comfortable-trump-shoots-down-idea-of-big-beautiful-briefing-room-for-reporters/",
    "timestamp": "2025-08-11T17:37:50Z"
  },
  {
    "title": "Diane Francis: Trump sets his sights on the banking industry",
    "description": "It seems clear that the president wants to eliminate all barriers to entry so that American banks can directly compete in Canada against local banks",
    "link": "https://financialpost.com/diane-francis/trump-sets-sights-banking-industry",
    "timestamp": "2025-08-11T17:36:56Z"
  },
  {
    "title": "Trump Expects 'Constructive Conversation' With Putin",
    "description": "US President Donald Trump said Monday he expects to have \"constructive conversations\" with his Russian counterpart Vladimir Putin and expressed displeasure with Ukraine's Volodymyr Zelensky for ruling out territorial concessions.",
    "link": "https://www.ibtimes.com/trump-expects-constructive-conversation-putin-3780677",
    "timestamp": "2025-08-11T17:36:16Z"
  },
  {
    "title": "Trump Says Dealing 'Nicely' With China As Tariff Deadline Looms",
    "description": "President Donald Trump said Monday that the United States has been \"dealing very nicely with China\" -- while Beijing said it was seeking positive outcomes -- hours before a tariff truce between both countries was due to expire.",
    "link": "https://www.ibtimes.com/trump-says-dealing-nicely-china-tariff-deadline-looms-3780674",
    "timestamp": "2025-08-11T17:36:15Z"
  },
  {
    "title": "July CPI report expected to show inflation accelerated amid tariff pressures",
    "description": "July’s CPI is expected to show a quicker rise in prices than in June as investors closely monitor the impact of tariffs on consumer costs.",
    "link": "https://finance.yahoo.com/news/july-cpi-report-expected-to-show-inflation-accelerated-amid-tariff-pressures-173606177.html",
    "timestamp": "2025-08-11T17:36:06Z"
  },
  {
    "title": "Biographer claims Epstein and Bannon joked about Trump: 'Both thought he was a moron'",
    "description": "The U.S. House Oversight Committee should subpoena Steve Bannon for testimony about extensive interviews with Jeffrey Epstein in which both men made clear “they both thought that [Donald] Trump was a moron, and neither could ultimately believe that Trump had …",
    "link": "https://www.rawstory.com/2673875025/",
    "timestamp": "2025-08-11T17:34:29Z"
  },
  {
    "title": "Local Health Providers Prepare For Medi-Cal Cuts",
    "description": "Thousands in Central California could lose their individual healthcare coverage.",
    "link": "https://www.kqed.org/news/12051681/local-health-providers-prepare-for-medi-cal-cuts",
    "timestamp": "2025-08-11T17:34:23Z"
  },
  {
    "title": "Trump says dealing 'nicely' with China as tariff deadline looms",
    "description": "President Donald Trump said Monday that the United States has been \"dealing very nicely with China\" -- while Beijing said it was seeking positive outcomes --...",
    "link": "https://finance.yahoo.com/news/trump-says-dealing-nicely-china-173356764.html",
    "timestamp": "2025-08-11T17:33:56Z"
  },
  {
    "title": "U.S. allies think twice about buying F-35s in response to Trump’s antics",
    "description": "Why is the list of countries reassessing their F-35 purchases still growing? Because of the lack of international confidence in Donald Trump.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/f-35-fighter-jets-us-allies-switzerland-spain-france-rcna224350",
    "timestamp": "2025-08-11T17:33:43Z"
  },
  {
    "title": "Karoline Leavitt steps away from White House? Trump's 'superstar' showcases stylish weekend getaway",
    "description": "White House Press Secretary Karoline Leavitt shared personal moments on Instagram, including family time with her son Niko and husband Nicholas Riccio. She showcased weekend adventures, from breakfast at Founding Farmers to poolside relaxation. Leavitt also p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-karoline-leavitt-steps-away-from-white-house-trumps-superstar-showcases-stylish-weekend-getaway/articleshow/123241831.cms",
    "timestamp": "2025-08-11T17:33:19Z"
  },
  {
    "title": "Brazil-US meeting canceled amid tariff dispute, says finance minister",
    "description": "SAO PAULO (Reuters) -Brazil Finance Minister Fernando Haddad said on Monday that his virtual meeting with U.S. Treasury Secretary Scott Bessent had been...",
    "link": "https://finance.yahoo.com/news/brazil-us-meeting-canceled-amid-173317950.html",
    "timestamp": "2025-08-11T17:33:17Z"
  },
  {
    "title": "‘I’m Trying To Hold My Temper’: MSNBC Contrib On Verge Of Melting Down Over Trump’s DC Crime Crackdown",
    "description": "After Donald Trump announced his plans to combat violent crime in Washington, D.C., Eddie Glaude said he was refraining from losing his \"temper.\"",
    "link": "https://dailycaller.com/2025/08/11/msnbc-contributor-nearly-has-meltdown-over-trump-ordering-national-guard-to-dc/",
    "timestamp": "2025-08-11T17:33:09Z"
  },
  {
    "title": "MSNBC Airs Graphic Showing Drop in DC Crime as Trump Compares City to Baghdad in Wild Presser",
    "description": "As Donald Trump made claims that Washington, DC had become overrun with violent criminals, MSNBC aired a graphic with statistics revealing the opposite.\nThe post MSNBC Airs Graphic Showing Drop in DC Crime as Trump Compares City to Baghdad in Wild Presser fir…",
    "link": "https://www.mediaite.com/politics/msnbc-airs-graphic-showing-drop-in-dc-crime-as-trump-compares-city-to-baghdad-in-wild-presser/",
    "timestamp": "2025-08-11T17:32:46Z"
  },
  {
    "title": "The Impact On Organizations Post Trump’s DEI Executive Orders",
    "description": "A major change in U.S. policy is forcing many organizations to rethink their commitment to diversity, equity, and inclusion.",
    "link": "https://www.forbes.com/sites/karadennison/2025/08/11/the-impact-on-organizations-post-trumps-dei-executive-orders/",
    "timestamp": "2025-08-11T17:30:30Z"
  },
  {
    "title": "When the next recession hits, whoever is president will face intense pressure to cut tariffs, so don’t rely on them for revenue, top economist says",
    "description": "\"There's going to be a strong incentive on that president's part to say, 'OK, I'm going to cut the taxes.'\"",
    "link": "https://fortune.com/2025/08/11/recession-trump-tariffs-cut-consumer-tax-relief-federal-revenue/",
    "timestamp": "2025-08-11T17:30:02Z"
  },
  {
    "title": "Trump: 'I don't think Hamas will release hostages under current circumstances'",
    "description": "US President tells Israeli media that Hamas \"cannot stay\" in Gaza, stresses it is important to \"remember October 7th.\"",
    "link": "https://www.israelnationalnews.com/news/413115",
    "timestamp": "2025-08-11T17:30:00Z"
  },
  {
    "title": "Jimmy Kimmel says second Trump term is ‘so much worse’ as he reveals he has Italian citizenship",
    "description": "The talk show host has been a longtime critic of the president",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-trump-italian-citizenship-b2805639.html",
    "timestamp": "2025-08-11T17:29:40Z"
  },
  {
    "title": "Jeanine Pirro Rips D.C. Council, Soft-on-Crime Policies: 'Enough -- It Changes Today'",
    "description": "WASHINGTON–U.S. Attorney for the District of Washington, DC, Jeanine Pirro said Monday that \"young thugs\" are committing \"too much violent crime\" in the nation's capital as President Donald Trump federalizes the Metropolitan Police Department.\nThe post Jeanin…",
    "link": "https://www.breitbart.com/politics/2025/08/11/jeanine-pirro-rips-d-c-council-soft-on-crime-policies-enough-it-changes-today/",
    "timestamp": "2025-08-11T17:29:10Z"
  },
  {
    "title": "How Much You Could Save in Every State Under Trump’s Proposed Capital Gains Tax Cut",
    "description": "Last week, President Donald Trump told reporters he would consider legislation proposed by Representative Marjorie Taylor Green to eliminate capital gains taxes for homeowners who sell their primary home and earn a profit.\nLearn More: Here’s How Much Every Ta…",
    "link": "https://biztoc.com/x/70e1f5d0f4dbd955",
    "timestamp": "2025-08-11T17:28:47Z"
  },
  {
    "title": "Newsom slams Trump over DC military deployment",
    "description": "California Governor Gavin Newsom sharply criticized US President Donald Trump on MOnday after announcing the deployment of the National Guard to Washington DC and placed the city's police under federa...",
    "link": "https://biztoc.com/x/ff23c4de3735ed0b",
    "timestamp": "2025-08-11T17:28:44Z"
  },
  {
    "title": "Canada could be trade winner as U.S. tariffs undershoot global competitors by wide margin, says report",
    "description": "The \n \n \n \n \n \n \n \n \n \n tariff rate\n \n \n \n \n \n \n \n \n \n imposed on Canadian exports by the \n \n \n \n \n \n \n \n \n \n United States\n \n \n \n \n \n \n \n \n \n is estimated to be the lowest amongst the world’s trading countries, meaning that Canada could end up coming out ahe…",
    "link": "https://biztoc.com/x/6798f73030317ed8",
    "timestamp": "2025-08-11T17:28:25Z"
  },
  {
    "title": "Hostile Takeover: Trump Federalizes Law Enforcement and Deploys National Guard in D.C",
    "description": "President Donald Trump declared \"Liberation Day in D.C.\" on Monday, announcing a \"public safety emergency.\" The president will place the city's Metropolitan Police Department (MPD) under federal control and deploy 800 D.C. National Guardsmen to \"establish law…",
    "link": "https://biztoc.com/x/e08620b799c5051e",
    "timestamp": "2025-08-11T17:28:16Z"
  },
  {
    "title": "Russian Tool Trump Blames Zelensky For War With Russia",
    "description": "During today's press conference, Trump bashed Ukraine President Zelensky for starting the Ukraine war while discussing his possible peace talks with Vladimir Putin. (Jake Tapper, are you out there???)\nTrump saved his vitriol for Ukraine instead of Russia, bla…",
    "link": "https://crooksandliars.com/2025/08/trump-blames-zelensky-war-russia",
    "timestamp": "2025-08-11T17:27:44Z"
  },
  {
    "title": "‘Total Dud!’ CNN’s Harry Enten Reveals ‘Nothingburger’ Epstein Story Didn’t Hurt Trump at All",
    "description": "CNN's Harry Enten revealed that the furor around President Donald Trump's handling of the Jeffrey Epstein case turned out to be a \"total dud.\"\nThe post ‘Total Dud!’ CNN’s Harry Enten Reveals ‘Nothingburger’ Epstein Story Didn’t Hurt Trump at All first appeare…",
    "link": "https://www.mediaite.com/media/tv/total-dud-cnns-harry-enten-reveals-nothingburger-epstein-story-didnt-hurt-trump-at-all/",
    "timestamp": "2025-08-11T17:26:11Z"
  },
  {
    "title": "Canada could be trade winner as U.S. tariffs undershoot global competitors by wide margin, says report",
    "description": "The tariff rate imposed on Canadian exports by the U.S. is estimated to be the lowest amongst the world's trading countries. Find out more.",
    "link": "https://financialpost.com/news/economy/canada-trade-winner-us-tariffs-undershoot-competitors",
    "timestamp": "2025-08-11T17:23:46Z"
  },
  {
    "title": "Netanyahu says new military offensive in Gaza will be wider than announced",
    "description": "Israeli Prime Minister Benjamin Netanyahu has defended a new military offensive in Gaza that’s more sweeping than previously announced.",
    "link": "https://www.pbs.org/newshour/world/netanyahu-says-new-military-offensive-in-gaza-will-be-wider-than-announced",
    "timestamp": "2025-08-11T17:23:31Z"
  },
  {
    "title": "Trump's Foreign Aid Cuts Are Ruining Ethiopia's Progress on Maternal Mortality",
    "description": "And enabling the country's anti-abortion movement.",
    "link": "https://www.jezebel.com/trumps-foreign-aid-cuts-are-ruining-this-countrys-progress-on-maternal-mortality",
    "timestamp": "2025-08-11T17:22:32Z"
  },
  {
    "title": "Donald Trump Takes Savage Revenge on Rival Barack Obama by Moving Portrait of Ex-Prez From Grand Staircase at White House to Staff Area So It’s 'Out of Public Sight'",
    "description": "Donald Trump has cranked up his feud with Barack Obama by removing a portrait of the former president from public view in the White House to a room used by staff.",
    "link": "https://radaronline.com/p/donald-trump-savage-revenge-barack-obama-moving-portrait-white-house/",
    "timestamp": "2025-08-11T17:21:08Z"
  },
  {
    "title": "American Eagle Ad Controversy Hasn’t Driven Sales, Early Data Suggests",
    "description": "So far, the controversy surrounding American Eagle Outfitters’ campaign starring actress Sydney Sweeney has created a lot of noise for the brand, but not much else. Traffic to American Eagle’s […]",
    "link": "https://www.adweek.com/commerce/american-eagle-ad-controversy-hasnt-driven-sales-early-data-suggests/",
    "timestamp": "2025-08-11T17:20:05Z"
  },
  {
    "title": "Apple and Cook Are Back in Trump’s Good Books: How Should You Play AAPL Stock Here?",
    "description": "Apple and its CEO, Tim Cook, are back in Trump’s good books, at least for now. Does that make AAPL a buy?",
    "link": "https://www.barchart.com/story/news/34053373/apple-and-cook-are-back-in-trumps-good-books-how-should-you-play-aapl-stock-here",
    "timestamp": "2025-08-11T17:19:53Z"
  },
  {
    "title": "Trump says Ukraine, Russia will have to swap some land for peace",
    "description": "US President Donald Trump said on Monday that both Ukraine and Russia would have to cede land to each other to end the war and that his talks with Russian President Vladimir Putin would be aimed at taking the temperature on a possible deal.",
    "link": "https://www.independent.ie/world-news/north-america/trump-says-ukraine-russia-will-have-to-swap-some-land-for-peace/a1028004928.html",
    "timestamp": "2025-08-11T17:18:56Z"
  },
  {
    "title": "Teamsters Dole Out Cash to GOP Candidates as Union Boss Argues Dems Have Abandoned Working People",
    "description": "DAILY CALLER NEWS FOUNDATION—Republicans are continuing to receive labor union support amid Teamsters union President Sean O’Brien repeatedly lambasting Democrats for reputedly abandoning the working... Read More\nThe post Teamsters Dole Out Cash to GOP Candid…",
    "link": "https://www.dailysignal.com/2025/08/11/teamsters-dole-out-cash-to-gop-candidates-as-union-boss-argues-dems-have-abandoned-working-people/",
    "timestamp": "2025-08-11T17:18:55Z"
  },
  {
    "title": "India's Modi calls Zelensky, presses for end to Ukraine war",
    "description": "NEW DELHI: Indian Prime Minister Narendra Modi on Monday (Aug 11) reiterated his commitment to an “early and peaceful” end to the Ukraine war after a telephone call with Ukrainian President",
    "link": "https://www.channelnewsasia.com/world/indias-modi-calls-zelensky-presses-end-ukraine-war-5289141",
    "timestamp": "2025-08-11T17:18:00Z"
  },
  {
    "title": "Trump confirms he made a deal with Nvidia chief to let tech company sell chips to China",
    "description": "US President Donald Trump said on Monday that he had personally negotiated a deal with Nvidia chief executive Jensen Huang, letting the tech giant sell a lower-end chip in China in exchange for part of those sales revenues being paid to the US government.\nThe…",
    "link": "https://biztoc.com/x/44e3a1ed689e6b7d",
    "timestamp": "2025-08-11T17:17:13Z"
  },
  {
    "title": "Trump to take over D.C. police and deploy the National Guard. Here’s what to know",
    "description": "President Donald Trump said Monday that he’s deploying the National Guard across Washington and taking over the city’s police department in the hopes of reducing crime, even as the city’s mayor has noted that crime is falling in the nation’s capital.\nThe Repu…",
    "link": "https://biztoc.com/x/69e3c50fd9c937bb",
    "timestamp": "2025-08-11T17:17:08Z"
  },
  {
    "title": "Billionaire Bill Ackman floats bold fix for the housing market crisis",
    "description": "The Pershing Square chief's proposal could effectively reshape U.S. mortgage finance.",
    "link": "https://www.thestreet.com/real-estate/billionaire-bill-ackman-floats-bold-fix-for-the-housing-market-crisis",
    "timestamp": "2025-08-11T17:17:00Z"
  },
  {
    "title": "Record Short Against Maersk Backfires in Trade-War Defying Rally",
    "description": "Shorting the stock of the world’s largest listed shipping company during a global trade war may seem like a sure bet. But the investors who’ve loaded up on the trade since April have so far only been handed big losses.",
    "link": "https://gcaptain.com/record-short-against-maersk-backfires-in-trade-war-defying-rally/",
    "timestamp": "2025-08-11T17:16:22Z"
  },
  {
    "title": "Recession is Still Coming, Warns Reagan Economic Adviser",
    "description": "Steve Hanke, a member of Ronald Reagan's Council of Economic Advisers, believes the U.S. will slip into a recession this year.",
    "link": "https://www.newsweek.com/reagan-economist-warns-recession-coming-2111880",
    "timestamp": "2025-08-11T17:16:04Z"
  },
  {
    "title": "Judge to hear case on whether Trump violated federal law with National Guard deployment in LA",
    "description": "A federal judge will hear arguments on whether military troops deployed by the Trump administration to Los Angeles violated a federal law that bars troops from conducting law enforcement duties within the country.",
    "link": "https://www.pbs.org/newshour/nation/judge-to-hear-case-on-whether-trump-violated-federal-law-with-national-guard-deployment-in-la",
    "timestamp": "2025-08-11T17:13:58Z"
  },
  {
    "title": "Trump’s Bitcoin advisor David Bailey to execute $1B Bitcoin buy",
    "description": "Bailey's $1B Bitcoin purchase could significantly influence market dynamics and bolster political advocacy for cryptocurrency adoption.\nThe post Trump’s Bitcoin advisor David Bailey to execute $1B Bitcoin buy appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/trump-bitcoin-advisor-smash-buy/",
    "timestamp": "2025-08-11T17:13:21Z"
  },
  {
    "title": "US Treasury Yields Edge Lower as Traders Shift Focus to CPI",
    "description": "(Bloomberg) -- Treasury yields slipped as investors brace for a key reading of US inflation that may bolster the case for the Federal Reserve to cut interest...",
    "link": "https://finance.yahoo.com/news/treasury-yields-slide-cpi-fed-091307383.html",
    "timestamp": "2025-08-11T17:13:10Z"
  },
  {
    "title": "Trump describes upcoming summit with Russia's Putin as 'feel-out meeting'",
    "description": "Trump describes upcoming summit with Russia's Putin as 'feel-out meeting'go.com",
    "link": "https://abcnews.go.com/Politics/trump-describes-upcoming-summit-russias-putin-feel-meeting/story?id=124548807",
    "timestamp": "2025-08-11T17:13:00Z"
  },
  {
    "title": "Trump Vows To Drastically Reduce The Number Of Criminals In Washington By Sending Congress Home",
    "description": "WASHINGTON, D.C. — In response to growing concern across the country about rampant crime in the nation's capital, President Donald Trump vowed to drastically reduce the number of criminals in Washington, D.C., by sending members of Congress home.",
    "link": "https://babylonbee.com/news/trump-vows-to-drastically-reduce-the-number-of-criminals-in-washington-by-sending-congress-home",
    "timestamp": "2025-08-11T17:12:21Z"
  },
  {
    "title": "Trump Says Nvidia To Give US Cut Of China Chip Sales",
    "description": "President Donald Trump on Monday confirmed reports that semiconductor giant Nvidia would pay the United States 15 percent of its revenues from sales of certain artificial intelligence chips to China.",
    "link": "https://www.ibtimes.com/trump-says-nvidia-give-us-cut-china-chip-sales-3780673",
    "timestamp": "2025-08-11T17:12:12Z"
  },
  {
    "title": "Trump says he asked for 20% cut from Nvidia, calls H20 an 'obsolete' chip",
    "description": "\"The Blackwell is super-duper advanced. I wouldn't make a deal with that,\" Trump said.",
    "link": "https://www.cnbc.com/2025/08/11/trump-nvidia-20percent-cut-h20-obsolete-chip.html",
    "timestamp": "2025-08-11T17:11:46Z"
  }
]