[
  {
    "title": "Trump fan arrested for pointing gun at No Kings protesters: 'Very ignorant move'",
    "description": "A fan of President Donald Trump was arrested and charged with waving a gun at demonstrators at a No Kings protest in South Carolina.Mary Moriarty is accused of driving past a demonstration in Myrtle Beach and brandishing a gun toward two protesters Saturday a…",
    "link": "https://www.rawstory.com/no-kings-arrest/",
    "timestamp": "2025-10-20T14:56:43Z"
  },
  {
    "title": "Kremlin explains choice of host nation for next Putin-Trump summit",
    "description": "Kremlin spokesman Dmitry Peskov has outlined why Hungary was chosen to host the upcoming summit between Vladimir Putin and Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626712-budapest-putin-trump-summit/",
    "timestamp": "2025-10-20T14:56:06Z"
  },
  {
    "title": "Steelmaker Cleveland-Cliffs Is Exploring for Rare Earth Metals in the US",
    "description": "Shares of Cleveland-Cliffs Inc. jumped the most since June after third-quarter earnings beat analysts’ estimates, with the steelmaker also unveiling plans to search for rare earth metals and entering into an agreement with a “major global steel producer.”",
    "link": "https://financialpost.com/pmn/business-pmn/steelmaker-cleveland-cliffs-is-exploring-for-rare-earth-metals-in-the-us",
    "timestamp": "2025-10-20T14:55:49Z"
  },
  {
    "title": "Harry Sisson Has Brutal Comeback for JD Vance Over AI Trump Poop Jet Video",
    "description": "Sisson revived a very embarrassing episode as he and Vance jousted over Trump’s bizarre fecal-themed anti-“No Kings” AI meme.\nThe post Harry Sisson Has Brutal Comeback for JD Vance Over AI Trump Poop Jet Video first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/harry-sisson-has-brutal-comeback-for-jd-vance-over-ai-trump-poop-jet-video/",
    "timestamp": "2025-10-20T14:55:29Z"
  },
  {
    "title": "Antifa’s Beloved Terror Propaganda Site Goes Dark Over ‘Dire’ Threat Of Trump Admin",
    "description": "A major \"anti-fascist\" group that posts content taking credit for crimes is pulling the plug on its website amid Trump's crackdown on leftist criminal networks.",
    "link": "https://dailycaller.com/2025/10/20/antifa-propaganda-site-goes-offline-following-trump-crackdown/",
    "timestamp": "2025-10-20T14:52:31Z"
  },
  {
    "title": "Lavrov holds phone call with Rubio",
    "description": "The conversation between the top Russian and US diplomats comes ahead of a planned summit between Presidents Vladimir Putin and Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626726-lavrov-call-rubio-summit/",
    "timestamp": "2025-10-20T14:51:43Z"
  },
  {
    "title": "EU moves to ban Russian energy imports by 2028",
    "description": "A draft regulation approved by European Union energy ministers would phase out Russian import contracts by January 2028.",
    "link": "https://www.aljazeera.com/news/2025/10/20/eu-moves-to-ban-russian-energy-imports-by-2028",
    "timestamp": "2025-10-20T14:50:36Z"
  },
  {
    "title": "The Right Way to Finance Ukraine's Defense",
    "description": "Supporting Ukraine with a reparations loan drawing on frozen Russian funds is the right choice not only morally, financially, and legally, but also politically. With Ukraine's economy devastated by the exogenous shock of Russian aggression, Western leaders ha…",
    "link": "https://www.project-syndicate.org/commentary/russian-frozen-assets-reparations-loan-to-ukraine-by-vladyslav-rashkovan-and-greg-wilson-2025-10",
    "timestamp": "2025-10-20T14:50:31Z"
  },
  {
    "title": "Trump administration to defend Alina Habba’s tenure as top New Jersey prosecutor",
    "description": "The 3rd Circuit Court of Appeals has scheduled a hearing in Philadelphia over Habba’s appointment.",
    "link": "https://www.bostonherald.com/2025/10/20/trump-administration-defends-habba-nj/",
    "timestamp": "2025-10-20T14:50:08Z"
  },
  {
    "title": "Weapons Buy-Back Program and Plan to Disarm Hamas",
    "description": "Hamas will have the opportunity to turn in their weapons, according to Steve Witkoff, U.S. special envoy to the Middle East.   “We’re going to... Read More\nThe post Weapons Buy-Back Program and Plan to Disarm Hamas  appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/20/weapons-buy-back-program-and-plan-to-disarm-hamas/",
    "timestamp": "2025-10-20T14:49:34Z"
  },
  {
    "title": "Indian economy resilient but not immune to global challenges, RBI report says",
    "description": "The report reiterates the Monetary Policy Committee's view that current macroeconomic conditions have opened up policy space for further supporting growth",
    "link": "https://www.thehindubusinessline.com/economy/indian-economy-resilient-but-not-immune-to-global-challenges-rbi-report-says/article70184954.ece",
    "timestamp": "2025-10-20T14:49:27Z"
  },
  {
    "title": "Ultraconservative Sanae Takaichi on track to become Japan's first female prime minister",
    "description": "Sanae Takaichi is on track to become Japan's first female prime minister after her party secured a crucial coalition partner",
    "link": "https://abcnews.go.com/Business/wireStory/ultraconservative-sanae-takaichi-track-become-japans-female-prime-126671354",
    "timestamp": "2025-10-20T14:49:25Z"
  },
  {
    "title": "Palestinian woman in hospital after being clubbed by masked Israeli settler",
    "description": "The attacker is seen striking the 55-year-old woman with a large wooden stick during the assault in the West Bank village of Turmus Ayaa.",
    "link": "https://www.bbc.com/news/articles/cx20p0qx50no",
    "timestamp": "2025-10-20T14:48:06Z"
  },
  {
    "title": "Trump Admits He’s Using the Shutdown to Take Revenge on Democrats",
    "description": "Donald Trump on Sunday admitted, once again, that he is treating the ongoing government shutdown as a revenge tour against Democrats, boasting about impeding federal funds for a crucial transit route in the New York metropolitan area.On day one of the shutdow…",
    "link": "https://newrepublic.com/post/201990/trump-shutdown-funding-revenge-democrats",
    "timestamp": "2025-10-20T14:47:33Z"
  },
  {
    "title": "Indian economy not immune to global challenges, but resilient: RBI report",
    "description": "India's economy remains strong despite global challenges. The Reserve Bank of India sees domestic factors boosting growth. Low inflation and healthy corporate and banking sectors contribute to this resilience. The central bank has increased its growth forecas…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/indian-economy-not-immune-to-global-challenges-but-resilient-rbi-report/articleshow/124706851.cms",
    "timestamp": "2025-10-20T14:45:15Z"
  },
  {
    "title": "Sooner than Expected: Here’s when Trump and Putin Will Meet in Budapest for Potential Peace Talks",
    "description": "…\nThe post Sooner than Expected: Here’s when Trump and Putin Will Meet in Budapest for Potential Peace Talks appeared first on Global Research.",
    "link": "https://dailynewshungary.com/trump-putin-meeting-budapest-talks/",
    "timestamp": "2025-10-20T14:45:08Z"
  },
  {
    "title": "‘We would buy some beef from Argentina’: Trump’s plan to counter the flesh-eating parasite keeping red meat prices skyhigh",
    "description": "U.S. beef prices have been stubbornly high for a variety of reasons.",
    "link": "https://fortune.com/2025/10/20/trump-inflation-imported-beef-argentina/",
    "timestamp": "2025-10-20T14:43:58Z"
  },
  {
    "title": "Trump Threatens Use Of Insurrection Act In Blue Cities",
    "description": "Donald Trump told Maria Bartiromo he can use the Insurrection Act against blue states and cities any time wants because he's obsessed with the unconscionable need to put US troops on US soil. US soil in blue cities, specifically.\nTrump also lied when he said …",
    "link": "https://crooksandliars.com/2025/10/trump-claims-he-may-use-insurrection-act",
    "timestamp": "2025-10-20T14:43:46Z"
  },
  {
    "title": "Government Shutdown update: What’s open, what’s closed, and what you need to know",
    "description": "The U.S. government shutdown continues, affecting hundreds of thousands of federal workers. Essential services like the military, Social Security, Medicare, USPS, airports, and food programs are still running. Lawmakers are debating health care tax breaks and…",
    "link": "https://economictimes.indiatimes.com/news/international/us/government-shutdown-update-whats-open-whats-closed-and-what-you-need-to-know/articleshow/124706368.cms",
    "timestamp": "2025-10-20T14:41:46Z"
  },
  {
    "title": "WATCH: Will Trump’s endorsement be deciding factor in New York City mayor race?",
    "description": "'Would I rather have a Democrat than a communist? Barely. They're almost becoming the same thing'",
    "link": "https://www.wnd.com/2025/10/watch-will-trumps-endorsement-be-deciding-factor-new/",
    "timestamp": "2025-10-20T14:40:51Z"
  },
  {
    "title": "US Economy Report Sounds Alarm for Donald Trump",
    "description": "The Trump administration’s immigration policies could shrink the U.S. labor force, a new study warns.\nThe analysis, by the National Foundation for American Policy (NFAP), outlines potential long-term risks to the nation’s growth and fiscal stability.\nWhy It M…",
    "link": "https://biztoc.com/x/6057157c00d4d2fc",
    "timestamp": "2025-10-20T14:39:06Z"
  },
  {
    "title": "Rare Earths on the Menu as Australia’s PM Meets Trump",
    "description": "6 min ago\nRare Earths on the Menu as Australia’s PM Meets Trump\nAustralian Prime Minister Anthony Albanese will meet President Donald Trump at the White House today. The two will “no doubt” discuss U.S. demand for rare earths and critical minerals, Australian…",
    "link": "https://biztoc.com/x/69e719bceb7a9e2c",
    "timestamp": "2025-10-20T14:38:56Z"
  },
  {
    "title": "'Bomb had gone off': Whistleblower drops new details about Trump lawyer's 'stunning' order",
    "description": "A key whistleblower against President Donald Trump's former Justice Department lawyer turned federal circuit judge Emil Bove has come forward to reveal more details about an infamous conversation in which he was urged to defy federal courts, The Daily Beast r…",
    "link": "https://www.rawstory.com/emil-bove-2674214988/",
    "timestamp": "2025-10-20T14:38:40Z"
  },
  {
    "title": "Sovereign wealth funds: What every CIO should know",
    "description": "A U.S. sovereign wealth fund introduces a new force in global investment. CIOs must grasp its influence on markets, strategy and long-term business growth.",
    "link": "https://www.techtarget.com/searchcio/feature/Sovereign-wealth-funds-What-every-CIO-should-know",
    "timestamp": "2025-10-20T14:38:00Z"
  },
  {
    "title": "Trump gives Zelenskyy reality check in alleged 'shouting match' before sending him on his way",
    "description": "President Donald Trump has worked ardently to bring an end to the war between Russia and Ukraine — a war that has resulted in millions of casualties and transformed much of Eastern Ukraine into drone-netted wasteland.Fresh off brokering a tenuous ceasefire in…",
    "link": "https://www.theblaze.com/news/trump-gives-zelenskyy-reality-check-in-alleged-shouting-match-before-sending-him-on-his-way",
    "timestamp": "2025-10-20T14:35:00Z"
  },
  {
    "title": "‘No Kings’ Protester Wishes Trump Was ‘Absolutely’ Dead",
    "description": "A \"No Kings\" protester said on Saturday that she \"absolutely\" wishes for President Donald Trump to die.",
    "link": "https://dailycaller.com/2025/10/20/no-kings-protester-wishes-trump-dead/",
    "timestamp": "2025-10-20T14:33:39Z"
  },
  {
    "title": "Trump Yanks Aid for Foreign Leader Who Compared Him to Hitler",
    "description": "Donald Trump suspended aid to a country whose leader compared him to Adolf Hitler—and has since accused the U.S. president of murder. Trump announced Sunday that he would slash all financial assistance for Colombia. He claimed on Truth Social that the decisio…",
    "link": "https://newrepublic.com/post/201999/donald-trump-aid-colombia-boat-strikes",
    "timestamp": "2025-10-20T14:31:56Z"
  },
  {
    "title": "No Kings Day Was a Joyous Carnival for Democracy",
    "description": "Sasha Abramsky\n\n\n\nMillions of Constitution-loving Americans peacefully protested Trump’s authoritarian presidency. The GOP responded with military theatrics, threats, and scatological “jokes.”\r\n\n\r\n\n\nThe post No Kings Day Was a Joyous Carnival for Democracy ap…",
    "link": "https://www.thenation.com/article/activism/no-kings-day-democracy/",
    "timestamp": "2025-10-20T14:29:44Z"
  },
  {
    "title": "India pushes to expand rupee settlement with key trade partners",
    "description": "India's central bank is actively working to facilitate rupee settlements with free-trade partners, aiming to boost the local currency. This involves establishing direct rupee rates independent of the US dollar and developing reference rates with several count…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-pushes-to-expand-rupee-settlement-with-key-trade-partners/articleshow/124706616.cms",
    "timestamp": "2025-10-20T14:29:29Z"
  },
  {
    "title": "Lavrov, Rubio Hold Phone Call",
    "description": "MOSCOW (Sputnik) - Russian Foreign Minister Sergey Lavrov and US Secretary of State Marco Rubio held a telephone conversation, the Russian Foreign Ministry said on Monday.",
    "link": "https://sputnikglobe.com/20251020/lavrov-rubio-hold-phone-call-1122992658.html",
    "timestamp": "2025-10-20T14:29:25Z"
  },
  {
    "title": "Pete Hegseth’s Marine Party Such A Blast It Exploded Shrapnel Onto JD Vance’s Motorcade",
    "description": "Those wacky boys!",
    "link": "https://www.wonkette.com/p/pete-hegseths-marine-party-such-a",
    "timestamp": "2025-10-20T14:29:23Z"
  },
  {
    "title": "Live: Anthony Albanese to meet Donald Trump at the White House",
    "description": "It will be the first official in-person meeting between the leaders of Australia and the United States since their election wins. Follow live.",
    "link": "https://www.abc.net.au/news/2025-10-21/donald-trump-and-anthony-albanese-at-white-house-live-coverage/105912260",
    "timestamp": "2025-10-20T14:29:22Z"
  },
  {
    "title": "Mayor Brandon Johnson defends Chicago budget proposal: \"We're not going backwards\"",
    "description": "Mayor Brandon Johnson spoke with CBS News Chicago Monday morning to defend his 2026 budget proposal, which aims to close a fiscal hole of more than $1 billion.",
    "link": "https://www.cbsnews.com/chicago/news/mayor-brandon-johnson-chicago-budget-proposal/",
    "timestamp": "2025-10-20T14:28:45Z"
  },
  {
    "title": "Kenny Loggins Wants “Danger Zone” Removed from “King Trump” AI Video",
    "description": "Loggins says the song was used without his permission and requested it be \"removed immediately.\"\nKenny Loggins Wants “Danger Zone” Removed from “King Trump” AI Video\nEddie Fu",
    "link": "https://consequence.net/2025/10/kenny-loggins-trump-danger-zone-ai-video/",
    "timestamp": "2025-10-20T14:27:56Z"
  },
  {
    "title": "King Trump’s Deepest Fantasy: Crapping on America",
    "description": "Jeet Heer\n\n\n\nThe president’s scatological No Kings post expresses the ugly emotion fuelling his authoritarian rule.\r\n\n\r\n\n\nThe post King Trump’s Deepest Fantasy: Crapping on America appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-no-kings-post-crapping-on-america/",
    "timestamp": "2025-10-20T14:27:40Z"
  },
  {
    "title": "Canadians grow gloomy on the economy as U.S. trade war persists",
    "description": "Canadians are increasingly downbeat on the economy as a trade war with the U.S. grinds on, putting pressure on key industries. Read more.",
    "link": "https://financialpost.com/news/canadians-grow-economy-us-trade-war",
    "timestamp": "2025-10-20T14:26:53Z"
  },
  {
    "title": "President Trump Needs Much Better Protection",
    "description": "Sadly, President Donald Trump faces innumerable threats from both foreign adversaries and domestic radicals prone to violence. These are people suffering from severe “Trump Derangement Syndrome.” Last year, the President survived two assassination attempts. O…",
    "link": "https://freerepublic.com/focus/f-chat/4347477/posts",
    "timestamp": "2025-10-20T14:26:22Z"
  },
  {
    "title": "Colombia recalls ambassador to United States amid diplomatic spat",
    "description": "Colombia announced the move after US President Donald Trump called President Gustavo Petro an 'illegal drug leader'.",
    "link": "https://www.aljazeera.com/news/2025/10/20/colombia-recalls-ambassador-to-united-states-amid-diplomatic-spat",
    "timestamp": "2025-10-20T14:22:37Z"
  },
  {
    "title": "Trump Threw Zelenskiy’s Maps While Melting Down During Their Meeting",
    "description": "Donald Trump’s latest meeting with Ukrainian President Volodymyr Zelenskiy began with lunch and ended in a shouting match.The attempted peace negotiation Friday reportedly saw Trump cussing out the Ukrainian leader and throwing Zelenskiy’s maps of the battlef…",
    "link": "https://newrepublic.com/post/201995/donald-trump-melt-down-zelenskiy-meeting-russia",
    "timestamp": "2025-10-20T14:21:28Z"
  },
  {
    "title": "Battle for governor in closely watched election may be headed for a photo finish",
    "description": "Republican Jack Ciattarelli narrows gap with Democratic Rep. Mikie Sherrill in New Jersey governor race as new polls show tightening contest ahead of Election Day.",
    "link": "https://www.foxnews.com/politics/battle-governor-closely-watched-election-may-headed-photo-finish",
    "timestamp": "2025-10-20T14:19:16Z"
  },
  {
    "title": "ABC’s Jonathan Karl Corners House Speaker Mike Johnson on Pentagon Press Restrictions | Video",
    "description": "House Speaker Mike Johnson (R-LA) on Sunday tried to refute the idea that Defense Secretary Pete Hegseth was afraid of the Pentagon press corps that he recently helped evict from the complex — by equating transparency with delivering prepared remarks.",
    "link": "https://www.thewrap.com/mike-johnson-pentagon-press-restrictions-jonathan-karl-abc/",
    "timestamp": "2025-10-20T14:18:19Z"
  },
  {
    "title": "Exposing the Truth Behind Gaza Casualty Figures: Impressive IDF Combatant-to-Non-Combatant Ratio",
    "description": "Exposing the Truth Behind Gaza Casualty Figures: Impressive IDF Combatant-to-Non-Combatant RatioPublished: October 20, 2025In the ongoing conflict between Israel and Hamas, accurate casualty reporting has become a weapon in the information war. Hamas, a terro…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347474/posts",
    "timestamp": "2025-10-20T14:16:27Z"
  },
  {
    "title": "Trump Calls Colombian President 'Illegal Drug Dealer,' Cuts Off All Payments to the Country",
    "description": "President Donald Trump cuts off taxpayer money to Colombia as he denounces its leader as an \"illegal drug leader.\"",
    "link": "https://www.westernjournal.com/trump-calls-colombian-president-illegal-drug-dealer-cuts-off-payments-country/",
    "timestamp": "2025-10-20T14:16:21Z"
  },
  {
    "title": "MSM Trying To Derail Peace in Russia-Ukraine War, Reporting Trump Told Zelensky ‘Accept Putin’s Terms or Be Destroyed’ – Moscow Criticizes Kiev and EU Leaks – Trump Denies Reports",
    "description": "Ukraine and the EU want to throw a spanner in the works, and the MSM is ‘oh-so-happy’ to help.\nThe post MSM Trying To Derail Peace in Russia-Ukraine War, Reporting Trump Told Zelensky ‘Accept Putin’s Terms or Be Destroyed’ – Moscow Criticizes Kiev and EU Leak…",
    "link": "https://www.thegatewaypundit.com/2025/10/msm-trying-derail-peace-russia-ukraine-war-reporting/",
    "timestamp": "2025-10-20T14:15:29Z"
  },
  {
    "title": "Colombia Recalls Its Ambassador From US at Petro's Request",
    "description": "WASHINGTON (Sputnik) - Colombia's Ambassador to the United States Daniel Garcia-Pena has been recalled at the request of President Gustavo Petro, and is now back in Bogota, the Colombian Foreign Ministry said on Monday.",
    "link": "https://sputnikglobe.com/20251020/colombia-recalls-its-ambassador-from-us-at-petros-request--1122992498.html",
    "timestamp": "2025-10-20T14:15:05Z"
  },
  {
    "title": "Colombia recalls ambassador from US amid tariff, drug spat",
    "description": "BOGOTA (Reuters) -Colombia's foreign ministry said on Monday the country has recalled its ambassador from the United States after U.S. President Donald Trump said he would raise tariffs on the South American nation and stop all payments to it, in a feud stemm…",
    "link": "https://www.thestar.com.my/news/world/2025/10/20/colombia-recalls-ambassador-from-us-amid-tariff-drug-spat",
    "timestamp": "2025-10-20T14:15:00Z"
  },
  {
    "title": "Long Live 'No Kings' (The Bulwark)",
    "description": "The Bulwark:\nLong Live ‘No Kings’  —  Saturday's protests showed that a resistance can be large and organized.  But can it be sustained?  —  “Members of Congress say they're happy military troops are getting paid during the shutdown,” Politico reports, “but n…",
    "link": "https://www.memeorandum.com/251020/p34",
    "timestamp": "2025-10-20T14:15:00Z"
  },
  {
    "title": "'That's a BS remark!' Dan Bongino rages as Gavin Newsom pushes back on Trump",
    "description": "FBI Deputy Director Dan Bongino raged against California Gov. Gavin Newsom on Monday over his opposition to President Donald Trump’s impending deployment of National Guard troops to San Francisco, which Trump recently confirmed would be carried out soon.Speak…",
    "link": "https://www.rawstory.com/san-francisco/",
    "timestamp": "2025-10-20T14:10:56Z"
  },
  {
    "title": "Abraham Lincoln’s 1859 Lesson for Some 2028 Democrat",
    "description": "It was 1859. The analogies to the current state of American politics are not precise and even paradoxical. To begin with, John Brown, though crazy and bloodthirsty, was on the right side of history. He preferred wielding guns to scoring debating points. He ha…",
    "link": "https://newrepublic.com/article/201866/abraham-lincoln-1859-lesson-2028-democrat",
    "timestamp": "2025-10-20T14:04:13Z"
  },
  {
    "title": "Dan Bongino Provides Details About FBI Investigation Into Hunting Stand That Had Line Of Sight To Air Force One",
    "description": "FBI Deputy Director Dan Bongino said FBI Director Kash Patel ordered an “immediate response” following the discovery of a hunting stand near Air Force One.",
    "link": "https://dailycaller.com/2025/10/20/dan-bongino-details-fbi-investigation-hunting-stand-air-force-one/",
    "timestamp": "2025-10-20T14:03:12Z"
  },
  {
    "title": "'In your dreams!' Iran's supreme leader taunts Trump over brags",
    "description": "Supreme Leader of Iran Ali Khamenei took a jab at Donald Trump Monday over airstrikes\r\n the president authorized back in June, which Trump has repeatedly claimed “obliterated” Iran’s nuclear capabilities — despite an internal Pentagon report undermining those…",
    "link": "https://www.rawstory.com/trump-2674215039/",
    "timestamp": "2025-10-20T14:00:09Z"
  },
  {
    "title": "My Last Day as an Accomplice of the Republican Party (Miles Bruner/The Bulwark)",
    "description": "Miles Bruner / The Bulwark:\nMy Last Day as an Accomplice of the Republican Party  —  Why I'm leaving the GOP and why I'm urging my former colleagues to do the same.  —  1,315  —  SINCE DONALD TRUMP DESCENDED that golden escalator in 2015, the Republican party…",
    "link": "https://www.memeorandum.com/251020/p31",
    "timestamp": "2025-10-20T14:00:00Z"
  },
  {
    "title": "Federal Court Reversal in Reese v. ATF Strengthens Second Amendment Privacy Protections",
    "description": "Following last week’s initial ruling, a U.S. District Court has vacated its controversial order demanding SAF and FPC turn over member data\nThe post Federal Court Reversal in Reese v. ATF Strengthens Second Amendment Privacy Protections appeared first on The …",
    "link": "https://www.thetruthaboutguns.com/reese-v-atf-court-reversal-2a-privacy-rights/",
    "timestamp": "2025-10-20T14:00:00Z"
  },
  {
    "title": "US envoys arrive in Israel to shore up the Gaza ceasefire after a major flareup",
    "description": "This visit comes after Israel threatened to stop aid transfers, accusing Hamas of killing two soldiers.",
    "link": "https://www.bostonherald.com/2025/10/20/us-envoy-israel-hamas-ceasefire/",
    "timestamp": "2025-10-20T13:58:51Z"
  },
  {
    "title": "Quote of the Day",
    "description": "\"Don’t forget I can use the Insurrection Act... And that’s unquestioned power.\" -- Donald Trump, in a Fox News interview.",
    "link": "https://politicalwire.com/2025/10/20/quote-of-the-day-4306/",
    "timestamp": "2025-10-20T13:58:50Z"
  },
  {
    "title": "Reporter's Notebook: Government shutdown stalls as Democrats demand Obamacare subsidy extension",
    "description": "Republicans and Democrats battle over healthcare subsidies in shutdown negotiations, with premium increases affecting millions of Americans on Obamacare exchanges.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-government-shutdown-stalls-democrats-demand-obamacare-subsidy-extension",
    "timestamp": "2025-10-20T13:56:27Z"
  },
  {
    "title": "Indonesia's Subianto seeks global stage in his first year",
    "description": "From Gaza peace talks to an EU trade pact, Indonesian President Prabowo Subianto's diplomacy has drawn praise and concern as Indonesia seeks a bigger global role under his leadership.",
    "link": "https://www.dw.com/en/indonesias-subianto-seeks-global-stage-in-his-first-year/a-74425416",
    "timestamp": "2025-10-20T13:55:00Z"
  },
  {
    "title": "Trump's righteous fight against the UN's carbon tax (Washington Examiner)",
    "description": "Washington Examiner:\nTrump's righteous fight against the UN's carbon tax  —  President Donald Trump scored a victory for consumers on Friday by effectively blocking a United Nations carbon tax scheme for at least a year.  The battle isn't over yet, as the Tru…",
    "link": "https://www.memeorandum.com/251020/p30",
    "timestamp": "2025-10-20T13:55:00Z"
  },
  {
    "title": "Phil Mickelson Begs Donald Trump to 'Save' San Francisco",
    "description": "Professional golfer Phil Mickelson has called on Donald Trump to \"save\" San Francisco as the president weighs sending National Guard troops to the city.\nThe Ryder Cup legend, a vocal supporter of the president, responded to a post by California Governor Gavin…",
    "link": "https://biztoc.com/x/e13e6b337e3beae2",
    "timestamp": "2025-10-20T13:54:39Z"
  },
  {
    "title": "Abby Phillip Calls Scott Jennings A Liar As On-Air Fight Spills Onto Social Media",
    "description": "The two tangled over Trump's bombing attacks on vessels he alleged were carrying fentanyl to the U.S.",
    "link": "https://www.huffpost.com/entry/abby-phillip-scott-jennings-lie-nicolas-maduro-venezuela-fentanyl_n_68f61c67e4b02184e56ed849",
    "timestamp": "2025-10-20T13:54:08Z"
  },
  {
    "title": "Almost time to fall back! Here’s when Daylight Saving hits in 2025",
    "description": "Daylight saving time is ending soon in the U.S. On November 2, 2025, clocks will fall back one hour, giving people extra sleep. Some areas will have earlier sunsets. President Trump has talked about stopping the time change, but it is still in effect. Dayligh…",
    "link": "https://economictimes.indiatimes.com/news/international/us/almost-time-to-fall-back-heres-when-daylight-saving-hits-in-2025/articleshow/124705905.cms",
    "timestamp": "2025-10-20T13:54:06Z"
  },
  {
    "title": "Bari Weiss asked ‘60 Minutes’ senior staffers why the country thinks they’re biased: report",
    "description": "Weiss \"surprised senior staff … when she asked a provocative question: Why does the country think you’re biased?” the New York Times reported.",
    "link": "https://nypost.com/2025/10/20/media/bari-weiss-asked-60-minutes-staffers-why-the-country-thinks-theyre-biased/",
    "timestamp": "2025-10-20T13:53:06Z"
  },
  {
    "title": "China: New 5-year plan comes at critical economic crossroads",
    "description": "China's leadership is meeting to chart a policy course for the next five years. Beijing needs Chinese consumers to spend more, while at the same time it is trying to keep up in a high-tech race with the US. The Central Committee of the Communist Party of Chin…",
    "link": "https://www.dw.com/en/china-new-5-year-plan-comes-at-critical-economic-crossroads/a-74427963",
    "timestamp": "2025-10-20T13:51:00Z"
  },
  {
    "title": "Why Trump is seeking to remove aluminium from vaccines?",
    "description": "Aluminium has been proven to be safe, removing it could reduce immunity and increase disease risk, experts say.",
    "link": "https://www.aljazeera.com/news/2025/10/20/why-trump-is-seeking-to-remove-aluminium-from-vaccines",
    "timestamp": "2025-10-20T13:50:40Z"
  },
  {
    "title": "Ten Million Dukes (Anthony Esolen/American Greatness)",
    "description": "Anthony Esolen / American Greatness:\nTen Million Dukes … I see there were protests today, with the American people rising against the supposed King of the United States, Donald Trump.  They seem to be most enraged at his using the National Guard to enforce im…",
    "link": "https://www.memeorandum.com/251020/p29",
    "timestamp": "2025-10-20T13:50:00Z"
  },
  {
    "title": "Transcript: No Kings--How Mass Protests Weaken Autocrats Like Trump",
    "description": "This is a lightly edited transcript of the October 18 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: This is Right Now, the The New Republic show on politics and policy. I’m Pe…",
    "link": "https://newrepublic.com/article/201981/transcript-no-kings-how-mass-protests-weaken-autocrats-like-trump",
    "timestamp": "2025-10-20T13:46:44Z"
  },
  {
    "title": "Cardi B ‘Was Trying to Warn Y’all’ About Trump Administration Cuts to SNAP Benefits",
    "description": "\"What I was saying is bigger than me saying 'Shrump,'\" the rapper said, referencing the speech she delivered at a Kamala Harris rally ahead of the 2024 election",
    "link": "http://www.rollingstone.com/music/music-news/cardi-b-trump-cutting-food-program-benefits-1235450212/",
    "timestamp": "2025-10-20T13:43:42Z"
  },
  {
    "title": "Did the U.S. Just Kill a Random Fisherman?",
    "description": "Submarine struck: Colombian President Gustavo Petro has accused the U.S. of murdering one of his people—an innocent fisherman—in a strike intended for boats carrying drugs and narcotraffickers.\nThis accusation angered President Donald Trump, who responded by …",
    "link": "https://biztoc.com/x/61a27d5135a0ce34",
    "timestamp": "2025-10-20T13:43:34Z"
  },
  {
    "title": "Trump Tears ‘Animal’ Jay Jones Apart Over Violent Fantasies: ‘Anybody Would Be Put in Prison for What He Said’",
    "description": "President Donald Trump called Jay Jones, the Democratic nominee for attorney general in Virginia, an \"animal\" during a Q&A session with the press.\nThe post Trump Tears ‘Animal’ Jay Jones Apart Over Violent Fantasies: ‘Anybody Would Be Put in Prison for What H…",
    "link": "https://www.mediaite.com/media/news/trump-tears-animal-jay-jones-apart-over-violent-fantasies-anybody-would-be-put-in-prison-for-what-he-said/",
    "timestamp": "2025-10-20T13:43:33Z"
  },
  {
    "title": "US government shutdown likely to end this week: White House adviser Hassett",
    "description": "WASHINGTON: The 20-day United States federal government shutdown is likely to end this week, White House economic adviser Kevin Hassett said on Monday (Oct 20).\"I think the Schumer shutdown is likely to end sometime this week,\" White House economic adviser Ke…",
    "link": "https://www.channelnewsasia.com/world/us-government-shutdown-likely-end-week-white-house-hassett-5413276",
    "timestamp": "2025-10-20T13:43:00Z"
  },
  {
    "title": "US seeks bigger stake in African state’s minerals",
    "description": "Secretary of State Marco Rubio and Liberia’s Foreign Minister have discussed deepening bilateral ties during talks in Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/626716-us-seeks-expand-role-liberia-critical-minerals-sector/",
    "timestamp": "2025-10-20T13:42:31Z"
  },
  {
    "title": "Supreme Court Justice Scalia's ex-clerk latest to hammer Trump act:  'Very likely illegal'",
    "description": "President Donald Trump's military strikes on ships around South America have raised the ire of yet another prominent conservative legal expert.Trump has spent the last several weeks bombing ships that the administration claims, with little public evidence, ar…",
    "link": "https://www.rawstory.com/trump-killings/",
    "timestamp": "2025-10-20T13:41:15Z"
  },
  {
    "title": "Japanese Stocks Surge as Nikkei 225 Hits Record High Amid Trade Optimism",
    "description": "Japanese stocks led gains across Asia, with the Nikkei 225 hitting a record high after Japan's ruling party secured a coalition deal. Global markets climbed as easing US-China trade tensions boosted investor sentiment, while European markets saw mixed results…",
    "link": "https://www.ibtimes.com.au/japanese-stocks-surge-nikkei-225-hits-record-high-amid-trade-optimism-1860923",
    "timestamp": "2025-10-20T13:38:26Z"
  },
  {
    "title": "Putin warned of UK assassination plot if he travels to meet Trump",
    "description": "An ex-KGB spy has issued a warning to Vladimir Putin ahead of meeting Trump",
    "link": "https://www.ladbible.com/news/world-news/vladimir-putin-uk-assassination-donald-trump-warning-meeting-175840-20251020",
    "timestamp": "2025-10-20T13:37:57Z"
  },
  {
    "title": "Colombia recalls US ambassador after Trump announces tariffs increase",
    "description": "The Colombian foreign ministry said Daniel García-Peña had returned to Bogotá from Washington DC after Donald Trump also announced the US would slash financial assistance to the country.",
    "link": "https://www.abc.net.au/news/2025-10-21/colombia-recalls-us-ambassador-after-trump-tariff-increase/105914158",
    "timestamp": "2025-10-20T13:35:54Z"
  },
  {
    "title": "Trump Targets George Soros: Billionaire Accused Of Funding ‘No Kings’ Protests",
    "description": "The billionaire philanthropist—one of the great funders of left-wing causes—has been tied to numerous false claims for decades.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/20/trump-targets-george-soros-billionaire-accused-of-funding-no-kings-protests/",
    "timestamp": "2025-10-20T13:34:16Z"
  },
  {
    "title": "Kenny Loggins Slams Donald Trump for Using ‘Danger Zone’ in AI Video Bombing No Kings Protesters With Poop: ‘I Request That My Recording Is Removed Immediately’",
    "description": "Kenny Loggins has spoken out against Donald Trump using his song “Danger Zone” in a bizarre AI video of the president in a fighter jet bombing No Kings protesters with what appears to be fecal matter. “This is an unauthorized use of my performance of ‘Danger …",
    "link": "https://variety.com/2025/music/news/kenny-loggins-slams-donald-trump-danger-zone-ai-video-1236556964/",
    "timestamp": "2025-10-20T13:33:52Z"
  },
  {
    "title": "Did the U.S. Just Kill a Random Fisherman?",
    "description": "Plus: Karl Marxing my neighborhood, No Kings, the limits of tariff revenue, and more...",
    "link": "https://reason.com/2025/10/20/did-the-u-s-just-kill-a-random-fisherman/",
    "timestamp": "2025-10-20T13:32:46Z"
  },
  {
    "title": "US envoys arrive in Israel to shore up Gaza ceasefire after weekend airstrikes",
    "description": "US special envoy Steve Witkoff and Donald Trump's son-in-law Jared Kushner were in Israel on Monday to shore up the tenuous ceasefire that is holding in Gaza.",
    "link": "https://www.independent.ie/world-news/us-envoys-arrive-in-israel-to-shore-up-gaza-ceasefire-after-weekend-airstrikes/a917844004.html",
    "timestamp": "2025-10-20T13:31:01Z"
  },
  {
    "title": "Children Beat and STAB Trump Effigy as Unhinged Leftists Cheer and Laugh in Disturbing “No Kings Day” Protest Scene",
    "description": "Far-left protesters across America marked their so-called “No Kings Day” with grotesque anti-Trump demonstrations, including children violently attacking effigies of the president as adults cheered and laughed.\nThe post Children Beat and STAB Trump Effigy as …",
    "link": "https://www.thegatewaypundit.com/?p=1470445",
    "timestamp": "2025-10-20T13:30:00Z"
  },
  {
    "title": "Alaska Storm Damage So Bad Many Evacuees Won’t Go Home for at Least 18 Months",
    "description": "Damage to remote Alaska villages hammered by flooding last weekend is so extreme that many of the more than 2,000 people displaced won’t be able to return to their homes for at least 18 months, Gov. Mike Dunleavy said in …",
    "link": "https://www.insurancejournal.com/news/west/2025/10/20/844446.htm",
    "timestamp": "2025-10-20T13:29:21Z"
  },
  {
    "title": "Why Is Vance Fighting With a 23-Year-Old Over Trump’s AI Poop Video?",
    "description": "Our vice president is spending his days beefing with a 23-year-old liberal influencer over an AI video our president posted of himself dropping a massive load of shit on protesters from a fighter jet. The video, posted on Saturday, depicts Trump piloting a fi…",
    "link": "https://newrepublic.com/post/201986/vance-fight-23-year-old-trump-ai-poop-video-no-kings",
    "timestamp": "2025-10-20T13:25:03Z"
  },
  {
    "title": "Another Assassination Plot Against Trump? Hunting Stand Found near Air Force One Landing Zone",
    "description": "The US Secret Service has discovered a suspicious hunting stand with a direct line of sight to the area where President Donald Trump exits Air Force One at Palm Beach International Airport, officials have told Fox News Digital.",
    "link": "https://freerepublic.com/focus/f-news/4347461/posts",
    "timestamp": "2025-10-20T13:24:27Z"
  },
  {
    "title": "Another Assassination Plot Against Trump? Hunting Stand Found near Air Force One Landing Zone",
    "description": "The US Secret Service has discovered a suspicious hunting stand with a direct line of sight to the area where President Donald Trump exits Air Force One at Palm Beach International Airport, officials have told Fox News Digital.",
    "link": "https://freerepublic.com/focus/f-bloggers/4347461/posts",
    "timestamp": "2025-10-20T13:24:27Z"
  },
  {
    "title": "‘Absolutely appalling’: How leftists puppet children for climate lawfare schemes",
    "description": "'They're so scared about their future – they're not getting married, they're not having children'",
    "link": "https://www.wnd.com/2025/10/absolutely-appalling-how-leftists-puppet-children-climate-lawfare/",
    "timestamp": "2025-10-20T13:22:08Z"
  },
  {
    "title": "Karine Jean-Pierre explains why her new memoir, Independent, is a manifesto for a fractured democracy",
    "description": "On the back cover of Independent, Rachel Maddow calls Karine Jean-Pierre’s new memoir “not your typical Washington book,” praising it as “a brave firecracker of a book” that “[cuts] a swath through the political class, telling blunt, gritty truths and sparing…",
    "link": "https://www.advocate.com/politics/karine-jean-pierre-independent-democrats",
    "timestamp": "2025-10-20T13:22:00Z"
  },
  {
    "title": "How Americans will reap the consequences of the Trump administration's data purge",
    "description": "In President Donald Trump’s America, information that has been relied on for decades to make critical decisions has been scrubbed from government websites or no longer collected.",
    "link": "https://biztoc.com/x/593a3200221c0caf",
    "timestamp": "2025-10-20T13:21:02Z"
  },
  {
    "title": "Trump Quickly Boards AF1 With Small Stairs, Increased Security Over Possible Threat",
    "description": "President Donald Trump quickly boarded Air Force One at Palm Beach International Airport on Sunday with a smaller set of stairs due to increased security around the airport. Precautions were heightened at the airport on Friday, after Secret Service discovered…",
    "link": "https://www.mediaite.com/media/news/trump-quickly-boards-af1-with-small-stairs-increased-security-over-possible-threat/",
    "timestamp": "2025-10-20T13:19:30Z"
  },
  {
    "title": "A very naive Sen. Mark Kelly thinks the government shutdown could wrap up this week if Republicans will just \"sit down and have a negotiation with us\" [Unlikely]",
    "description": "A very naive Sen. Mark Kelly thinks the government shutdown could wrap up this week if Republicans will just \"sit down and have a negotiation with us\"",
    "link": "https://www.fark.com/comments/13850766/A-very-naive-Sen-Mark-Kelly-thinks-government-shutdown-could-wrap-up-this-week-if-Republicans-will-just-sit-down-have-a-negotiation-with-us",
    "timestamp": "2025-10-20T13:18:23Z"
  },
  {
    "title": "Appeals Court Backs School Administrators Who Banned ‘Let’s Go Brandon!’ Shirts",
    "description": "A divided federal appeals court has sided with Michigan school administrators who barred students from wearing shirts with the phrase “Let’s Go Brandon!”, which gained traction as a coded message of opposition to then-President Joe Biden. The 2-1 decision thi…",
    "link": "https://freerepublic.com/focus/f-news/4347459/posts",
    "timestamp": "2025-10-20T13:17:13Z"
  },
  {
    "title": "China Posts Lacklustre Q3 Economic Data As Key Beijing Conclave Starts",
    "description": "China's economy grew just 4.8% in the third quarter of 2025 — its slowest pace in a year — as exports offset weak consumer spending and a deepening property crisis. Leaders in Beijing are meeting this week to plan a new five-year strategy amid pressure from U…",
    "link": "https://www.ibtimes.com.au/china-posts-lacklustre-q3-economic-data-key-beijing-conclave-starts-1860920",
    "timestamp": "2025-10-20T13:15:13Z"
  }
]