[
  {
    "title": "Schumer turns Judas Iscariot as Democrat civil war breaks out!",
    "description": "It's been about two months since Trump has been in office. The price of eggs has dropped. The prices of gas and oil are down. The last alive-remaining American Hamas hostage has been released. Inflation has dropped. Companies have committed to over $1.5 trill…",
    "link": "https://freerepublic.com/focus/f-bloggers/4304340/posts",
    "timestamp": "2025-03-14T22:16:41Z"
  },
  {
    "title": "Here Are The Democrats Who Advanced A GOP Bill To Avoid A Government Shutdown",
    "description": "Expect them all to face heavy intra-party criticism in the coming days.",
    "link": "https://www.huffpost.com/entry/here-are-the-democrats-who-advanced-a-gop-bill-to-avoid-a-government-shutdown_n_67d4a02fe4b08455bb0719cc",
    "timestamp": "2025-03-14T22:14:56Z"
  },
  {
    "title": "The Art of the Yield: Democrats Surrender, Hand Trump Government Spending Win",
    "description": "Senate Democrats talked tough, but in the end they folded like a cheap tent as 10 Democrats joined with Republicans to end debate and proceed to a final vote on the continuing resolution (CR) to avert a shutdown.\nThe post The Art of the Yield: Democrats Surre…",
    "link": "https://www.breitbart.com/politics/2025/03/14/art-of-yield-democrats-surrender-hand-trump-government-spending-win/",
    "timestamp": "2025-03-14T22:13:12Z"
  },
  {
    "title": "‘That’s Absurd’: Karoline Leavitt Lights Into ‘Low-Level Judges’ Blocking Bureaucrat Firings",
    "description": "White House Press Secretary Karoline Leavitt criticized court rulings blocking Donald Trump from dismissing probationary workers at multiple federal agencies.",
    "link": "https://dailycaller.com/2025/03/14/thats-absurd-karoline-leavitt-lights-into-low-level-judges-blocking-bureaucrat-firings/",
    "timestamp": "2025-03-14T22:12:31Z"
  },
  {
    "title": "Trump Attacks Queer Communities Using Nazi Symbolism",
    "description": "Earlier this week, President Trump shared an article on his Truth Social platform celebrating his elimination of trans and queer people from military advertising. The opinion piece published by reporter Jeremy Hunt of The Washington Times, featured a crossed …",
    "link": "https://msmagazine.com/2025/03/14/trump-attacks-queer-communities-using-nazi-symbolism/",
    "timestamp": "2025-03-14T22:12:26Z"
  },
  {
    "title": "Video Shows Mahmoud Khalil's Arrest at His NYC Home",
    "description": "The Palestinian graduate student's wife filmed the video in their apartment building on Saturday night.",
    "link": "https://www.newsweek.com/mahmoud-khalil-arrest-video-columbia-university-2045270",
    "timestamp": "2025-03-14T22:10:31Z"
  },
  {
    "title": "Worries over Trump's promise to remake the economy showed up in a big way this week",
    "description": "As voters returned Donald Trump to the White House in November, many had the economy top of mind. Candidate Trump vowed to bring down prices right away and foresaw boom times for the market.\nThat’s not the case nearly two months into the administration, howev…",
    "link": "https://biztoc.com/x/e2fe70354dedc7b0",
    "timestamp": "2025-03-14T22:10:31Z"
  },
  {
    "title": "Cate Blanchett and Michael Fassbender on Playing Married Spies in Steven Soderbergh’s Thriller ‘Black Bag’: ‘It’s Got to Be Sexy’",
    "description": "“Black Bag,” an elegant, quick-witted new thriller that finds Cate Blanchett and Michael Fassbender playing married spies, isn’t the pair’s first time together on screen. That honor goes to 2017’s “Song to Song,” one of Terrence Malick’s most intangible and h…",
    "link": "https://variety.com/2025/film/news/cate-blanchett-michael-fassbender-spies-black-bag-1236337659/",
    "timestamp": "2025-03-14T22:08:00Z"
  },
  {
    "title": "Gold ETFs Winning the Asset Race With Bitcoin Funds–for Now",
    "description": "The price of the traditional safe-haven asset has soared recently, but bitcoin is the real “hot sauce,” says analyst Eric Balchunas.",
    "link": "https://decrypt.co/310003/gold-etfs-winning-the-asset-race-with-bitcoin-funds",
    "timestamp": "2025-03-14T22:07:16Z"
  },
  {
    "title": "Donald Trump, In DOJ Speech, Calls CNN And MSNBC “Illegal” For Reporting Negatively On Him",
    "description": "Donald Trump once again lashed out at the media, calling CNN and MSNBC “corrupt” and “illegal” for reporting negatively about him. Trump’s attacks on the media are nothing new, but his choice of venue is: The Justice Department, where, in his campaign-like sp…",
    "link": "http://deadline.com/2025/03/trump-cnn-msnbc-illegal-1236327237/",
    "timestamp": "2025-03-14T22:07:06Z"
  },
  {
    "title": "Donald Trump, In DOJ Speech, Calls CNN And MSNBC “Illegal” For Reporting Negatively On Him",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_374001d0-6a72-4e04-a465-3d3e251a7a95",
    "timestamp": "2025-03-14T22:07:06Z"
  },
  {
    "title": "Good chance of ending war in Ukraine quickly, says Zelenskyy",
    "description": "Ukraine President Volodymyr Zelenskyy has said there is a \"good chance\" to end the war with Russia.",
    "link": "https://news.sky.com/story/volodymyr-zelenskyy-says-there-is-a-good-chance-of-ending-war-in-ukraine-13328840",
    "timestamp": "2025-03-14T22:07:00Z"
  },
  {
    "title": "Fort Collins man arrested on suspicion of arson at Loveland Tesla",
    "description": "A Fort Collins man was arrested on suspicion of arson, possessing explosives and other charges after police found an \"incendiary device\" in a fire outside a Loveland Tesla store.",
    "link": "https://www.denverpost.com/2025/03/14/tesla-loveland-arson-vandalism-arrest-colorado-elon-musk/",
    "timestamp": "2025-03-14T22:06:49Z"
  },
  {
    "title": "AI boom could spark a Texas land rush — and raise demand for homes",
    "description": "The vast data centers needed to power artificial intelligence are in high demand, and Texas is at the center of a new boom to build the physical infrastructure behind the digital revolution.",
    "link": "https://nypost.com/2025/03/14/real-estate/ai-boom-could-spark-a-texas-land-rushand-raise-demand-for-homes/",
    "timestamp": "2025-03-14T22:05:06Z"
  },
  {
    "title": "Charlamagne says Democratic leaders Chuck Schumer and Hakeem Jeffries need to 'step down' from party",
    "description": "Charlamagne tha God argued that Democrats as a party need a massive overhaul in leadership, suggesting that people like Senate Minority Leader Chuck Schumer are the problem.",
    "link": "https://www.foxnews.com/media/charlamagne-says-democratic-leaders-chuck-schumer-hakeem-jeffries-need-step-down-from-party",
    "timestamp": "2025-03-14T22:00:50Z"
  },
  {
    "title": "Sen. Bernie Sanders to host Denver rally against Trump, Musk with Rep. Alexandria Ocasio-Cortez",
    "description": "U.S. Sen. Bernie Sanders of Vermont will make an appearance on March 21 in Denver's Civic Center Park, alongside liberal firebrand Rep. Alexandria Ocasio-Cortez of New York, for the latest stop on Sanders' national \"Fighting Oligarchy\" tour.",
    "link": "https://www.denverpost.com/2025/03/14/denver-rally-bernie-sanders-alexandria-ocasio-cortez-trump/",
    "timestamp": "2025-03-14T22:00:38Z"
  },
  {
    "title": "Commentary: Who is Anji Sinha? Trump’s ambassador pick for Singapore is a mystery, but the timing speaks volumes",
    "description": "That US President Donald Trump nominated an ambassador to Singapore not even two months into his second term is a positive sign for the US-Singapore relationship, says RSIS’ Kevin Chen.",
    "link": "https://www.channelnewsasia.com/commentary/us-ambassador-singapore-anji-sinha-donald-trump-foreign-policy-diplomat-5000731",
    "timestamp": "2025-03-14T22:00:00Z"
  },
  {
    "title": "What Happens When Elvis Goes Missing",
    "description": "From the March 14, 2025, edition of The New Yorker newsletter: Zach Helfand on an East Village caper. Plus: the Administration’s attack on free speech; the guerrilla archivists resisting DOGE’s purge; and the mind-set that spawned the Irish famine.",
    "link": "https://www.newyorker.com/newsletter/the-daily/what-happened-when-elvis-went-missing",
    "timestamp": "2025-03-14T22:00:00Z"
  },
  {
    "title": "Top Trump official blames ‘Michigan people’ for souring consumer confidence survey",
    "description": "Recent data from the University of Michigan shows consumer confidence in the economy has plummeted to its lowest level since 2022, as prices rise and stocks fall in response to Donald Trump’s unnecessary and rudderless trade war.",
    "link": "https://biztoc.com/x/e83cef735628d060",
    "timestamp": "2025-03-14T21:59:55Z"
  },
  {
    "title": "Worries over Trump's promise to remake the economy showed up in a big way this week",
    "description": "As voters returned Donald Trump to the White House in November, many had the economy top of mind.",
    "link": "https://www.nbcnews.com/business/economy/stock-market-and-economy-this-week-what-to-know-trump-tariffs-rcna196525",
    "timestamp": "2025-03-14T21:59:23Z"
  },
  {
    "title": "White House Attorney Wasn’t Admitted to the Bar Until a Year After His Firm Said He Was Representing Andrew Tate",
    "description": "Paul Ingrassia, an attorney currently working as the White House liaison to the Department of Homeland Security, has drawn controversy over the years for his outspoken views, but may find himself in trouble now over comments that probably seemed mundane at th…",
    "link": "https://www.mediaite.com/lawcrime/white-house-attorney-wasnt-admitted-to-the-bar-until-a-year-after-his-firm-said-he-was-representing-andrew-tate/",
    "timestamp": "2025-03-14T21:59:08Z"
  },
  {
    "title": "Indian doctoral candidate leaves US after student visa revoked over alleged pro-Hamas activities",
    "description": "The Department of Homeland Security also announced the arrest of a Palestinian student.",
    "link": "https://www.jpost.com/international/islamic-terrorism/article-846109",
    "timestamp": "2025-03-14T21:59:08Z"
  },
  {
    "title": "Monday a big day for Ukraine conflict – Trump",
    "description": "President Trump has said that negotiations with Moscow over a US-proposed Ukraine ceasefirehave been “going reasonably well” so far Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614250-trump-ukraine-conflict-monday/",
    "timestamp": "2025-03-14T21:59:03Z"
  },
  {
    "title": "Trump Brutally Roasted After Declaring Critical Reporting ‘Has to Be Illegal’: ‘Seriously, This Is Authoritarianism’",
    "description": "“Calling news outlets that hold the president accountable “illegal” is what dictators say to attack the free press and suppress freedom of speech.\"\nThe post Trump Brutally Roasted After Declaring Critical Reporting ‘Has to Be Illegal’: ‘Seriously, This Is Aut…",
    "link": "https://www.mediaite.com/politics/trump-brutally-roasted-after-declaring-negative-reporting-has-to-be-illegal-seriously-this-is-authoritarianism/",
    "timestamp": "2025-03-14T21:57:05Z"
  },
  {
    "title": "Ticker: Wall Street rallies to its best day in months",
    "description": "Ticker: Wall Street rallies to its best day in months",
    "link": "https://www.bostonherald.com/2025/03/14/ticker-wall-street-rallies-to-its-best-day-in-months/",
    "timestamp": "2025-03-14T21:56:29Z"
  },
  {
    "title": "The Parental Panic of “Adolescence”",
    "description": "The Netflix series about a thirteen-year-old killer, starring Stephen Graham and Owen Cooper, attempts to grapple with the crisis facing boys today—but its true sympathies lie with the baffled adults around them. Inkoo Kang writes.",
    "link": "https://www.newyorker.com/culture/on-television/the-parental-panic-of-adolescence",
    "timestamp": "2025-03-14T21:56:22Z"
  },
  {
    "title": "Donald Trump Calls CNN and MSNBC ‘Illegal’ During DOJ Speech",
    "description": "President Donald Trump referred to CNN and MSNBC \"illegal\" during a speech at the Department of Justice on Friday. It marked the latest escalation in his language about the news media and those two networks in particular since he returned to the Oval Office i…",
    "link": "https://www.adweek.com/tvnewser/donald-trump-cnn-msnbc-illegal/",
    "timestamp": "2025-03-14T21:56:19Z"
  },
  {
    "title": "Here's what happened today: Friday",
    "description": "Here’s your round-up of the day’s news.",
    "link": "https://www.thejournal.ie/news-fix-friday-67-6650536-Mar2025/",
    "timestamp": "2025-03-14T21:55:01Z"
  },
  {
    "title": "US expels South African ambassador, saying he ‘hates’ Trump",
    "description": "The United States is expelling South Africa’s ambassador to Washington, Secretary of State Marco Rubio said Friday, accusing the envoy of hating the country and President Donald Trump. “South Africa’s Ambassador to the United States is no longer welcome in ou…",
    "link": "https://punchng.com/us-expels-south-african-ambassador-saying-he-hates-trump/",
    "timestamp": "2025-03-14T21:53:09Z"
  },
  {
    "title": "Meta strives to stifle ex-employee memoir",
    "description": "Meta wants to derail a freshly released memoir by a former employee whose scandalous allegations the tech giant argues are untrue.\nThe post Meta strives to stifle ex-employee memoir appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/meta-strives-to-stifle-ex-employee-memoir/article",
    "timestamp": "2025-03-14T21:53:04Z"
  },
  {
    "title": "Rubio says South Africa ambassador no longer welcomed in USA...",
    "description": "Rubio says South Africa ambassador no longer welcomed in USA...\r\n\n \n \n \n (Second column, 17th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Travel Ban 2.0 coming...\r\nSecond anti-Israel university protester arrested by HOMELAND ...",
    "link": "https://www.jpost.com/breaking-news/article-846108",
    "timestamp": "2025-03-14T21:52:37Z"
  },
  {
    "title": "Kate Middleton's red Commonwealth Day dress hides a secret message for Donald Trump",
    "description": "Princess Kate was at her best during the recent Commonwealth Day Service as she turned heads in her red outfit.\n\nNow, there are some wondering whether her attire for the day was ac",
    "link": "https://www.marca.com/en/lifestyle/uk-news/2025/03/14/67d499e322601dd9308b4593.html",
    "timestamp": "2025-03-14T21:52:30Z"
  },
  {
    "title": "Tulsi Gabbard launches investigation into leaks at spy agencies",
    "description": "Director of National Intelligence Tulsi Gabbard said she has ordered an investigation into “politically motivated leaks” from inside the intelligence community.",
    "link": "https://www.nbcnews.com/politics/national-security/tulsi-gabbard-launches-investigation-leaks-spy-agencies-rcna196526",
    "timestamp": "2025-03-14T21:51:21Z"
  },
  {
    "title": "In Averting a Shutdown, Schumer Ignites a Rebellion",
    "description": "After Schumer helped Republicans avoid a shutdown, many Democrats are furious, with some calling for a new leader of Senate Democrats",
    "link": "https://time.com/7268506/chuck-schumer-democrats-vote/",
    "timestamp": "2025-03-14T21:50:19Z"
  },
  {
    "title": "Trump calls for jailing his perceived opponents in Justice Department speech",
    "description": "Speaking from the Great Hall of the Justice Department, Trump targeted former special counsel Jack Smith and referred to Jan. 6 rioters as \"hostages.\"",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-calls-jailing-perceived-opponents-justice-department-speech-rcna196515",
    "timestamp": "2025-03-14T21:50:18Z"
  },
  {
    "title": "Mark Caney sworn in as Canada's prime minister, dismisses US takeover speculation",
    "description": "Mark Carney says he has no immediate plans to talk to the US president but makes clear that the Trump administration's talk of annexing Canada is \"crazy\".",
    "link": "https://www.abc.net.au/news/2025-03-15/mark-carney-sworn-in-as-canada-prime-minister/105055688",
    "timestamp": "2025-03-14T21:50:09Z"
  },
  {
    "title": "The Data Hoarders Resisting Trump's Purge (Julian Lucas/New Yorker)",
    "description": "Julian Lucas / New Yorker:\nThe Data Hoarders Resisting Trump's Purge  —  Can librarians and guerrilla archivists save the country's files from DOGE?  —  The deletions began shortly after Donald Trump took office.  C.D.C. web pages on vaccines, H.I.V. preventi…",
    "link": "https://www.memeorandum.com/250314/p121",
    "timestamp": "2025-03-14T21:50:01Z"
  },
  {
    "title": "Fox News Politics Newsletter: 'FBI's \"Gotcha\" Scheme'",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-fbis-gotcha-scheme",
    "timestamp": "2025-03-14T21:49:51Z"
  },
  {
    "title": "Trump pledges to make US capital 'crime-free' and the ‘talk of the world’",
    "description": "Speaking at the Department of Justice on Friday President Donald Trump renewed his vow to clean up the city of Washington, D.C., saying, “we’re going to have a crime free capital.\"",
    "link": "https://www.foxnews.com/politics/trump-pledges-make-us-capital-crime-free-talk-world",
    "timestamp": "2025-03-14T21:49:19Z"
  },
  {
    "title": "Trump Pledges To 'Expel Rogue Actors' In Political Speech At Justice Department",
    "description": "President Donald Trump used a visit to the Justice Department on Friday to air a litany of grievances.",
    "link": "https://www.huffpost.com/entry/us-trump-justice-department-speech_n_67d4a1ace4b08455bb0719ee",
    "timestamp": "2025-03-14T21:48:34Z"
  },
  {
    "title": "As Azerbaijan Plummets Deeper Into Authoritarianism, Will Trump Respond As Promised? | Opinion",
    "description": "President Donald Trump should prove his words were more than an empty campaign promise.",
    "link": "https://biztoc.com/x/df1410b9252bb7db",
    "timestamp": "2025-03-14T21:48:32Z"
  },
  {
    "title": "U.S. crypto czar’s $200 million portfolio held Bitcoin, Coinbase, and Robinhood",
    "description": "David Sacks and his investment firm Craft Ventures have divested more than $200 million in crypto holdings since President Donald Trump named Sacks as the White House's AI and crypto czar, according to a Bitcoin, Ethereum, and Solana, according to the memo. S…",
    "link": "https://biztoc.com/x/1fe9fe7712f20a01",
    "timestamp": "2025-03-14T21:48:32Z"
  },
  {
    "title": "Senate advances GOP stopgap bill as shutdown deadline nears | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> The U.S. Senate today voted to advance a stopgap spending bill and avert a partial government shutdown, after Democrats backed down in a standoff driven by anger over President Donald Trump’s campaign to slash the federal workforce.",
    "link": "https://www.staradvertiser.com/2025/03/14/breaking-news/senate-advances-gop-stopgap-bill-as-shutdown-deadline-nears/",
    "timestamp": "2025-03-14T21:47:27Z"
  },
  {
    "title": "Yes, Billionaire Elon Musk Is Coming For Your Money Now Too",
    "description": "For all their vows to cut \"waste and abuse\" in entitlements, they seem oddly reluctant to go after an obvious target.",
    "link": "https://www.huffpost.com/entry/musk-trump-oz-cut-medicare-advantage_n_67d46b21e4b02949ebe101d7",
    "timestamp": "2025-03-14T21:47:25Z"
  },
  {
    "title": "Trump Admin Says South African Ambassador 'No Longer Welcome' in US",
    "description": "Rubio's remarks come after Trump signed an executive order that cut aid and assistance to the Black-led South African government.",
    "link": "https://www.newsweek.com/trump-admin-says-south-african-ambassador-no-longer-welcome-us-2045273",
    "timestamp": "2025-03-14T21:47:24Z"
  },
  {
    "title": "Trump blasts foes and media in speech at 'Department of Injustice'",
    "description": "<p>WASHINGTON - US President Donald Trump launched a bitter attack against the \"illegal\" media and his political enemies Friday, as a speech at the Department of Justice turned into a grievance-filled diatribe.</p>",
    "link": "https://www.bangkokpost.com/world/2980440/trump-blasts-foes-and-media-in-speech-at-department-of-injustice",
    "timestamp": "2025-03-14T21:45:00Z"
  },
  {
    "title": "Hyperliquid’s mystery 50x ETH whale is now betting on LINK",
    "description": "The cryptocurrency trader whose ultra-leveraged Ether (ETH) trade tested Hyperliquid’s limits on March 12 has entered another multimillion-dollar position, this time in Chainlink (LINK), onchain data shows. On March 14, the anonymous whale, referred to on X a…",
    "link": "https://cointelegraph.com/news/hyperliquid-mystery-50x-eth-whale-bet-link",
    "timestamp": "2025-03-14T21:45:00Z"
  },
  {
    "title": "Tesla Tells Trump Administration It’s Worried About Tariff Trade Wars",
    "description": "In a letter, Elon Musk's electric car company warned of the \"downstream impacts\" the tariffs could have.",
    "link": "https://www.huffpost.com/entry/tesla-tells-trump-administration-it-is-exposed-to-retaliatory-tariffs_n_67d48d86e4b08455bb0713e6",
    "timestamp": "2025-03-14T21:43:23Z"
  },
  {
    "title": "Trump Blasts Foes And Media In Speech At 'Department Of Injustice'",
    "description": "US President Donald Trump launched a bitter attack against the \"illegal\" media and his political enemies Friday, as a speech at the Department of Justice turned into a grievance-filled diatribe.",
    "link": "https://www.ibtimes.com/trump-blasts-foes-media-speech-department-injustice-3766349",
    "timestamp": "2025-03-14T21:42:13Z"
  },
  {
    "title": "Kohl's changes DEI officer title, broadens supplier diversity program",
    "description": "\"We have evolved our framework to focus on inclusion and belonging,\" said Michelle Banks, whose title changed from chief DEI officer to chief inclusion and...",
    "link": "https://finance.yahoo.com/news/kohls-changes-dei-officer-title-214157774.html",
    "timestamp": "2025-03-14T21:41:57Z"
  },
  {
    "title": "As Azerbaijan Plummets Deeper Into Authoritarianism, Will Trump Respond As Promised? | Opinion",
    "description": "President Donald Trump should prove his words were more than an empty campaign promise.",
    "link": "https://www.newsweek.com/azerbaijan-plummets-deeper-authoritarianism-will-trump-respond-promised-opinion-2045258",
    "timestamp": "2025-03-14T21:40:13Z"
  },
  {
    "title": "MSNBC host says covering Trump has 'exhausted' him, will take a break from show",
    "description": "MSNBC host Lawrence O'Donnell says he is \"exhausted\" by covering President Donald Trump's spirited second term and must take a break from his evening show. The 73-year-old liberal host has helmed his own show on the progressive network since 2010 after being …",
    "link": "https://www.theblaze.com/news/lawrence-odonnell-break-msnbc-exhausted",
    "timestamp": "2025-03-14T21:40:00Z"
  },
  {
    "title": "Rubio says South Africa’s ambassador to the US ‘is no longer welcome’ in the country",
    "description": "Rubio accused Ebrahim Rasool of being a 'race-baiting politician' who hates Trump.",
    "link": "https://www.bostonherald.com/2025/03/14/trump-south-africa-ambassador/",
    "timestamp": "2025-03-14T21:38:34Z"
  },
  {
    "title": "The man whose tweets helped kill DEI",
    "description": "Four years ago, Richard Hanania was a little-known right-wing intellectual, one of many posters building a brand with tweets and Substack posts attacking “wokeness” and other conservative bugbears.  But in the middle of 2021, one of his ideas took off. In an …",
    "link": "https://www.vox.com/today-explained-podcast/404120/richard-hanania-dei-policy-trump",
    "timestamp": "2025-03-14T21:38:23Z"
  },
  {
    "title": "Canada will never be part of US, says New PM Carney",
    "description": "Canada’s new Prime Minister, Mark Carney, launched his term in office on Friday with a firm rejection of US President Donald Trump’s repeated threats to annex its northern neighbour. Shortly after being sworn in as Canada’s 24th prime minister, replacing Just…",
    "link": "https://punchng.com/canada-will-never-be-part-of-us-says-new-pm-carney/",
    "timestamp": "2025-03-14T21:38:00Z"
  },
  {
    "title": "Trump Questions Whether Criticism of Aileen Cannon Is 'Legal'",
    "description": "President Donald Trump called Aileen Cannon a \"model\" of a judge during his speech on Friday at the Department of Justice.",
    "link": "https://biztoc.com/x/af8dbe36501472fd",
    "timestamp": "2025-03-14T21:37:54Z"
  },
  {
    "title": "Wall Street is turning its back on Trump and flashing an economic warning",
    "description": "On-again, off-again tariffs, mass government layoffs, funding cuts and immigration crackdowns have seriously spooked Wall Street, which is emphatically rejecting President Donald Trump’s chaotic economic agenda.\nThe market that embraced Trump for most of his …",
    "link": "https://biztoc.com/x/312380f16a7a24f7",
    "timestamp": "2025-03-14T21:37:52Z"
  },
  {
    "title": "Trump attacks Biden administration in rare visit to Justice Department",
    "description": "In a rare visit to the Justice Department, President Donald Trump claimed lashed out at his perceived political enemies and claimed the department was weaponized against him while he was running for office. NBC News Senior White House Correspondent Kelly O’Do…",
    "link": "https://biztoc.com/x/e4b10760ebcfd52f",
    "timestamp": "2025-03-14T21:37:43Z"
  },
  {
    "title": "Trump Questions Whether Criticism of Aileen Cannon Is 'Legal'",
    "description": "President Donald Trump called Aileen Cannon a \"model\" of a judge during his speech on Friday at the Department of Justice.",
    "link": "https://www.newsweek.com/trump-questions-whether-criticism-aileen-cannon-legal-2045248",
    "timestamp": "2025-03-14T21:37:14Z"
  },
  {
    "title": "CMS pick Oz vows to go after Medicare Advantage - Roll Call",
    "description": "Once a proponent of Medicare Advantage plans, Oz vowed Friday to go after those plans if they unfairly raise costs for the government.",
    "link": "https://rollcall.com/2025/03/14/cms-pick-oz-vows-to-go-after-medicare-advantage/",
    "timestamp": "2025-03-14T21:36:09Z"
  },
  {
    "title": "When Is the Election in Canada?",
    "description": "Canada's next round of elections will come under the cloud of a brewing trade war with the US and the Trump administration.",
    "link": "https://www.cnet.com/news/politics/when-is-the-election-in-canada/",
    "timestamp": "2025-03-14T21:35:33Z"
  },
  {
    "title": "Trump blasts foes and media in speech at 'Department of Injustice'",
    "description": "US President Donald Trump launched a bitter attack against the \"illegal\" media and his political enemies Friday, as a speech at the Department of Justice...",
    "link": "https://www.yahoo.com/news/trump-speak-us-justice-department-172329788.html",
    "timestamp": "2025-03-14T21:35:11Z"
  },
  {
    "title": "Trump calls for imprisoning his opponents in bellicose speech at Justice Department (Politico)",
    "description": "Politico:\nTrump calls for imprisoning his opponents in bellicose speech at Justice Department  —  For more than an hour, he delivered an insult-laden speech that shattered the traditional notion of DOJ independence.  —  President Donald Trump on Friday walked…",
    "link": "https://www.memeorandum.com/250314/p120",
    "timestamp": "2025-03-14T21:35:01Z"
  },
  {
    "title": "Taiwan tech giant Foxconn's 2024 profit misses forecasts",
    "description": "Taiwanese tech giant Foxconn reported on Friday a lower-than-expected net profit for 2024 as consumer electronic gadgets underperformed, although demand for its artificial intelligence servers remained robust. The world's largest contract electronics manufact…",
    "link": "https://japantoday.com/category/tech/taiwan-tech-giant-foxconn%27s-2024-profit-misses-forecasts1",
    "timestamp": "2025-03-14T21:34:24Z"
  },
  {
    "title": "A 10% drop for stocks is scary, but isn't that rare",
    "description": "The U.S. stock market has just dropped 10% from its high set last month, hurt by worries about the economy and a global trade war. T he fall for the S&amp;P 500 is steep enough that Wall Street has a name for it: a “correction.” Such drops have happened regul…",
    "link": "https://japantoday.com/category/business/a-10-drop-for-stocks-is-scary-but-isn%27t-that-rare",
    "timestamp": "2025-03-14T21:33:45Z"
  },
  {
    "title": "President Donald Trump criticized multiple media outlets during a speech at the DOJ, calling the press' coverage of judges and other topics \"totally illegal\" (Michael Luciano/Mediaite)",
    "description": "Michael Luciano / Mediaite:\nPresident Donald Trump criticized multiple media outlets during a speech at the DOJ, calling the press' coverage of judges and other topics “totally illegal”  —  Want to avoid video ads?  Subscribe to  —  President Donald Trump rip…",
    "link": "https://mediagazer.com/250314/p12",
    "timestamp": "2025-03-14T21:33:26Z"
  },
  {
    "title": "China, Russia, and Iran Hold Nuclear Talks",
    "description": "High-level diplomats urge Washington to lift nuclear sanctions on Tehran.",
    "link": "http://foreignpolicy.com/2025/03/14/china-russia-iran-nuclear-talks-us-sanctions-trump/",
    "timestamp": "2025-03-14T21:31:21Z"
  },
  {
    "title": "10 Senate Democrats Defy Pelosi, Left-Wing Base To Advance GOP Spending Bill",
    "description": "Democrats' public meltdown at Schumer for committing to advance the GOP spending bill is a remarkable moment for a party deeply divided.",
    "link": "https://dailycaller.com/2025/03/14/10-senate-democrats-defy-pelosi-left-wing-base-to-advance-gop-spending-bill/",
    "timestamp": "2025-03-14T21:30:42Z"
  },
  {
    "title": "Wall Street rallies to its best day in months",
    "description": "Worries have been rising that U.S. consumers may cut back on their spending because of uncertainty around tariffs.",
    "link": "https://www.reviewjournal.com/post/3320335",
    "timestamp": "2025-03-14T21:30:35Z"
  },
  {
    "title": "Top House Democrats Throw Chuck Schumer Under The Bus Amid Funding Fight",
    "description": "\"This false choice that some are buying instead of fighting is unacceptable,” Rep. Nancy Pelosi said as Schumer cast his vote for an extreme GOP spending bill.",
    "link": "https://www.huffpost.com/entry/nancy-pelosi-chuck-schumer-hakeem-jeffries-government-shutdown_n_67d473ece4b034e451a5db9f",
    "timestamp": "2025-03-14T21:29:54Z"
  },
  {
    "title": "DNI Nominee Yanked By Trump Admin Likens Himself to Christ on Cross",
    "description": "Daniel Davis, the onetime pick to serve as deputy director of national intelligence who was yanked from consideration this week over his anti-Israel views, likened himself to Jesus on the cross as he tacitly blamed Jews for detoning his nomination.\nThe post D…",
    "link": "https://freebeacon.com/trump-administration/dni-nominee-yanked-by-trump-admin-likens-himself-to-jesus-on-cross/",
    "timestamp": "2025-03-14T21:29:32Z"
  },
  {
    "title": "Senate Set to Advance Bill to Avert Shutdown",
    "description": "The Senate is voting to advance a Republican-written stopgap spending bill to avert a government shutdown at midnight, with enough Democrats joining Senator Chuck Schumer of New York, the Democratic leader, in voting with Republicans to push it past any filib…",
    "link": "https://freerepublic.com/focus/f-news/4304333/posts",
    "timestamp": "2025-03-14T21:29:11Z"
  },
  {
    "title": "Portugal's government wants to reconsider order of US-made F-35 jets — but it must be reelected first",
    "description": "Portugal's outgoing defense minister said his country must consider the United States' reliability as a NATO ally and a trading partner.",
    "link": "https://www.snopes.com//fact-check/portugal-f35-jets/",
    "timestamp": "2025-03-14T21:29:00Z"
  },
  {
    "title": "Careless People and Barbra Streisand",
    "description": "First, let me just put this book right at the top so you don’t miss it. What’s this? Careless People is a memoir about Meta aka Facebook, written by Sarah Wynn-Williams, a former employee of Facebook from 2011 to 2017 wrote a memoir telling everybody how very…",
    "link": "https://smartbitchestrashybooks.com/2025/03/careless-people-and-barbra-streisand/",
    "timestamp": "2025-03-14T21:28:56Z"
  },
  {
    "title": "'Probably illegal': Trump rants at 'scum' and 'bad people' criticizing right-wing judges",
    "description": "President Donald Trump spoke at the Justice Department on Friday, where he vocalized many of his problems with the justice system. Among his comments were attacks on the media and activists, who he said are abusing any judge who agrees with him. He specifical…",
    "link": "https://www.rawstory.com/trump-justice-department-2671332219/",
    "timestamp": "2025-03-14T21:28:55Z"
  },
  {
    "title": "AOC, Sanders tell supporters to mask up for West Coast town halls",
    "description": "Sen. Bernie Sanders, I-Vt., and Rep. Alexandria Ocasio-Cortez, D-N.Y., are taking the \"Fighting Oligarchy\" rallies out West next week – and advising supporters to mask up to participate.",
    "link": "https://www.foxnews.com/politics/dems-tell-supporters-mask-up-ahead-fighting-oligarchy-tour",
    "timestamp": "2025-03-14T21:28:25Z"
  },
  {
    "title": "New Canadian PM blasts Trump's 51st state idea: 'Crazy'",
    "description": "Newly minted Canadian Prime Minister Mark Carney has panned the idea of Canada becoming America’s 51st state amid tensions about a an all-out trade war between the neighboring nations.",
    "link": "https://www.foxnews.com/politics/new-canadian-pm-blasts-trumps-51st-state-idea-crazy",
    "timestamp": "2025-03-14T21:28:00Z"
  },
  {
    "title": "Ishiba apologizes for giving out gifts, clouding budget prospects",
    "description": "Japanese Prime Minister Shigeru Ishiba apologised on Friday for giving gift certificates to some ruling party lawmakers, a move that could hurt his administration's already low approval ratings and risk delaying passage of next fiscal year's budget. The polit…",
    "link": "https://japantoday.com/category/politics/japan-pm-apologises-for-giving-out-gifts-clouding-budget-prospects",
    "timestamp": "2025-03-14T21:27:41Z"
  },
  {
    "title": "Voice of America ending contracts with Associated Press, Reuters and Agence France Presse",
    "description": "The government agency that runs the Voice of America has moved to terminate contracts with The Associated Press, Reuters and Agence France-Presse, and told its journalists Friday to stop using material from the wire services. Kari Lake, the former broadcaster…",
    "link": "https://japantoday.com/category/world/voice-of-america-ending-contracts-with-associated-press-reuters-and-agence-france-presse",
    "timestamp": "2025-03-14T21:26:43Z"
  },
  {
    "title": "German parties agree deal to loosen debt limit, expand defense spending as Europe called to do more",
    "description": "German lawmakers reached an agreement on Friday to exempt some defense spending from the nation’s tight rules on running up debt as European leaders are scrambling to shore up the continent's defenses themselves in the face of a Trump administration that is t…",
    "link": "https://japantoday.com/category/world/german-parties-agree-deal-to-loosen-debt-limit-expand-defense-spending-as-europe-called-to-do-more",
    "timestamp": "2025-03-14T21:26:32Z"
  },
  {
    "title": "AOC Urged to Primary Chuck Schumer Amid GOP Funding Bill Backlash",
    "description": "Schumer sparked Democratic outrage over his position on the GOP-backed continuing resolution.",
    "link": "https://www.newsweek.com/aoc-urged-primary-chuck-schumer-government-shutdown-2045235",
    "timestamp": "2025-03-14T21:26:17Z"
  },
  {
    "title": "Immigration officials arrest second person who participated in pro-Palestinian protests at Columbia",
    "description": "Immigration officials have arrested a second person who participated in Pro-Palestinian protests at Columbia University, and have revoked the visa of another student, they announced Friday. Leqaa Kordia, a Palestinian from the West Bank, was arrested by immig…",
    "link": "https://japantoday.com/category/world/immigration-officials-arrest-second-person-who-participated-in-pro-palestinian-protests-at-columbia",
    "timestamp": "2025-03-14T21:26:10Z"
  },
  {
    "title": "Mark Carney sworn in as Canada's prime minister, says he can work with Trump",
    "description": "Ex-central banker Mark Carney was sworn in as prime minister of Canada on Friday and immediately said he could work with U.S. President Donald Trump, who is promising tariffs that could devastate the Canadian economy. Carney succeeds Justin Trudeau, who had a…",
    "link": "https://japantoday.com/category/world/mark-carney-sworn-in-as-canada%27s-prime-minister-says-he-can-work-with-trump",
    "timestamp": "2025-03-14T21:26:00Z"
  },
  {
    "title": "U.S. gov't shutdown in balance after top Democrat avoids fight",
    "description": "The U.S. Senate appeared closer Friday to avoiding an economically damaging government funding shutdown after the Democrats' top leader shied away from a major confrontation with President Donald Trump, prompting backlash from the left. Democrats are smarting…",
    "link": "https://japantoday.com/category/world/us-govt-shutdown-in-balance-after-top-democrat-avoids-fight",
    "timestamp": "2025-03-14T21:25:44Z"
  },
  {
    "title": "Grassley, Johnson Release Records Showing FBI Obtained Trump, Pence Cell Phones, Conducted Sweeping Interviews to Advance Anti-Trump Arctic Frost Investigation",
    "description": "WASHINGTON – In a letter to Attorney General Pam Bondi and Federal Bureau of Investigation (FBI) Director Kash Patel, Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa) and Senate Permanent Subcommittee on Investigations Chairman Ron Johnson (R-Wis.)…",
    "link": "https://freerepublic.com/focus/f-news/4304332/posts",
    "timestamp": "2025-03-14T21:25:20Z"
  },
  {
    "title": "Allies preserve unity even as Trump's tariffs and Canada taunts overshadow G7 meeting",
    "description": "Top diplomats from the Group of 7 industrialized democracies agreed Friday on a joint statement expressing support for Ukraine and a U.S. ceasefire proposal in the three-year-old war even as President Donald Trump’s trade policies and taunts toward host Canad…",
    "link": "https://japantoday.com/category/world/allies-wrap-up-a-g7-meeting-overshadowed-by-trump%27s-tariffs-and-canada-taunts",
    "timestamp": "2025-03-14T21:25:18Z"
  },
  {
    "title": "U.S. envoy taking Putin's comments on Ukraine ceasefire proposal to Trump, Kremlin official says",
    "description": "Russian President Vladimir Putin met with U.S. envoy Steve Witkoff to discuss details of the American proposal for a 30-day ceasefire in the war with Ukraine, asking him to convey Moscow's thoughts to Washington, Kremlin spokesman Dmitry Peskov said Friday. P…",
    "link": "https://japantoday.com/category/world/us-envoy-is-taking-putin%27s-comments-on-ukraine-ceasefire-proposal-to-trump-kremlin-official-says",
    "timestamp": "2025-03-14T21:25:08Z"
  },
  {
    "title": "Are COVID-19 Vaccines Safe and Effective?",
    "description": "Five years after Donald Trump declared a national COVID-19 emergency, here's what the research says.",
    "link": "https://reason.com/2025/03/14/are-covid-19-vaccines-safe-and-effective/",
    "timestamp": "2025-03-14T21:24:53Z"
  },
  {
    "title": "A Canadian tourist canceled his $7,000 Airbnb reservation amid growing tensions with the US",
    "description": "One Canadian visitor to Palm Springs, California canceled his $7,000 Airbnb reservation. It comes amid rising tensions between the US and Canada.",
    "link": "https://www.businessinsider.com/canadian-tourist-canceled-airbnb-reservation-growing-tensions-tariffs-2025-3",
    "timestamp": "2025-03-14T21:24:30Z"
  },
  {
    "title": "Trump Administration Kicks South African Ambassador Out of the U.S. After Breitbart News Report: 'Persona Non Grata'",
    "description": "The Trump administration has ejected South African Ambassador Ebrahim Rasool out of the country, declaring him persona non grata after he gave a lecture claiming that President Donald Trump is a white supremacist leader.\nThe post Trump Administration Kicks So…",
    "link": "https://www.breitbart.com/africa/2025/03/14/trump-administration-kicks-south-african-ambassador-out-of-the-u-s-breitbart-news-report-persona-non-grata/",
    "timestamp": "2025-03-14T21:23:57Z"
  },
  {
    "title": "Trump Calls for Opponents to Be Jailed in Dark, Retaliatory Speech at DoJ: ‘We Will Expel the Rogue Forces From Our Government’",
    "description": "Trump previously threatened to use presidential power against his enemies and rule as a \"dictator\" during the 2024 election\nThe post Trump Calls for Opponents to Be Jailed in Dark, Retaliatory Speech at DoJ: ‘We Will Expel the Rogue Forces From Our Government…",
    "link": "https://www.thewrap.com/donald-trump-threatens-to-jail-enemies-in-doj-speech/",
    "timestamp": "2025-03-14T21:22:35Z"
  },
  {
    "title": "Meta Strives To Stifle Ex-employee Memoir",
    "description": "Meta wants to derail a freshly released memoir by a former employee whose scandalous allegations the tech giant argues are untrue and should never have been published.",
    "link": "https://www.ibtimes.com/meta-strives-stifle-ex-employee-memoir-3766347",
    "timestamp": "2025-03-14T21:21:17Z"
  },
  {
    "title": "Donald Trump’s tariffs: What his presidency could mean for the UK",
    "description": "The US economy is a global superpower. The US’ trade decisions can either directly or indirectly affect the UK consumer’s spending power.\nThe post Donald Trump’s tariffs: What his presidency could mean for the UK appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/donald-trumps-tariffs-what-his-presidency-could-mean-for-the-uk/article",
    "timestamp": "2025-03-14T21:19:23Z"
  }
]