[
  {
    "title": "Trump loses latest bid to get Central Park Five defamation lawsuit tossed",
    "description": "A federal judge on Friday dealt another blow to President Donald Trump's efforts to throw out a defamation lawsuit against him filed by plaintiffs formerly known as the Central Park Five.\nU.S. District Judge Wendy Beetlestone said that Pennsylvania's Anti-SLA…",
    "link": "https://biztoc.com/x/77c6cb0d9265f1bc",
    "timestamp": "2025-06-28T21:24:29Z"
  },
  {
    "title": "Schumer to force Senate reading of Trump's entire 'big, beautiful bill'",
    "description": "Democrats led by Schumer will require Senate clerks to read the entire 940-page Republican bill, delaying proceedings in a tactical move against Trump's legislative agenda.",
    "link": "https://www.foxnews.com/politics/schumer-force-senate-reading-trumps-entire-big-beautiful-bill",
    "timestamp": "2025-06-28T21:23:50Z"
  },
  {
    "title": "Senate Plans To Vote On Trump’s Signature Spending Bill Today—What To Know As Elon Musk Blasts Draft",
    "description": "The measure has gone through several revisions as Republicans have sparred over provisions ahead of the bill’s July 4 deadline.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/06/28/senate-plans-to-vote-on-trumps-signature-spending-bill-today-what-to-know-as-elon-musk-blasts-draft/",
    "timestamp": "2025-06-28T21:22:47Z"
  },
  {
    "title": "The best of 2025 . . . so far",
    "description": "From shows about androids and morticians to psychosis-inducing albums, here's the best of what you may have missed.",
    "link": "https://www.salon.com/2025/06/28/the-best-of-2025-so-far/",
    "timestamp": "2025-06-28T21:21:20Z"
  },
  {
    "title": "Trump loses latest bid to get Central Park Five defamation lawsuit tossed",
    "description": "It is the latest blow to President Donald Trump's efforts to dismiss the defamation case filed against him.",
    "link": "https://www.cnbc.com/2025/06/28/trump-central-park-five-defamation.html",
    "timestamp": "2025-06-28T21:14:43Z"
  },
  {
    "title": "‘60 Minutes’ Kamala Harris interview at center of Trump lawsuit runs afoul of Cronkite-era CBS guidelines",
    "description": "Trump claims ’60 Minutes’ interfered with election through selective editing.",
    "link": "https://nypost.com/2025/06/28/media/60-minutes-kamala-harris-interview-at-center-of-trump-lawsuit-runs-afoul-of-cronkite-era-cbs-guidelines/",
    "timestamp": "2025-06-28T21:12:46Z"
  },
  {
    "title": "Thousands Gather in Tehran to Mourn Dead from Israel Strikes",
    "description": "Thousands of Iranians took to the streets to mourn around 60 people who were killed in Israeli strikes over the past few weeks.",
    "link": "https://www.newsweek.com/thousands-gather-tehran-mourn-dead-israel-strikes-2092063",
    "timestamp": "2025-06-28T21:05:07Z"
  },
  {
    "title": "2 Lawmakers Nominate Trump for Nobel Peace Prize",
    "description": "Rep. Claudia Tenney announced that she has “twice nominated” President Donald Trump the Nobel Peace Prize, writing, “No modern leader has done more for World... Read More\nThe post 2 Lawmakers Nominate Trump for Nobel Peace Prize appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/06/28/2-lawmakers-nominate-trump-for-nobel-peace-prize/",
    "timestamp": "2025-06-28T21:05:07Z"
  },
  {
    "title": "Democrats mocked for X post on anniversary of infamous Biden-Trump presidential debate: 'This aged well'",
    "description": "The Democrats were brutally trolled for their social media post on the first anniversary of the infamous Joe Biden and Donald Trump's presidential debate. The presidential debate was reportedly the turning point in the 2024 election, which led to the withdraw…",
    "link": "https://freerepublic.com/focus/f-chat/4325854/posts",
    "timestamp": "2025-06-28T21:03:54Z"
  },
  {
    "title": "Trump Blasts CNN 'Hoax, Fake News' Report That US Looking At $30BN Deal With Iran",
    "description": "Trump Blasts CNN 'Hoax, Fake News' Report That US Looking At $30BN Deal With Iran\n \nPresident Donald Trump has once again blasted CNN and the \"hoax\" media reports saying his administration was considering a $30 billion deal to assist Iran in developing civili…",
    "link": "https://biztoc.com/x/35e64b2807a2e0ab",
    "timestamp": "2025-06-28T21:02:12Z"
  },
  {
    "title": "Israel says it killed Hamas co-founder in Gaza City Strike",
    "description": "The Israeli Defense Forces and the Israel Securities Authority killed Hamas co-founder Hakham Muhammad Issa Al-Issa in a strike on Gaza City Friday, a statement from the IDF said.",
    "link": "https://www.nbcnews.com/world/israel/israel-killed-hamas-co-founder-hakham-muhammad-rcna215748",
    "timestamp": "2025-06-28T20:53:59Z"
  },
  {
    "title": "Rubio condemns Iran's 'unacceptable' threats against IAEA director",
    "description": "Iran bans IAEA Director Rafael Mariano Grossi and removes nuclear facility surveillance amid accusations, while Secretary of State Marco Rubio calls for the safety of IAEA personnel monitoring Iran's nuclear program.",
    "link": "https://www.foxnews.com/politics/rubio-condemns-irans-unacceptable-threats-against-iaea-director",
    "timestamp": "2025-06-28T20:52:19Z"
  },
  {
    "title": "Trump and His Online Alpha Males Have a Meltdown Over NYC’s Newest Socialist Star",
    "description": "Zohran Mamdani is facing a flood of Islamophobic and anti-immigrant attacks from Trump, influencers, and even some Democrats.",
    "link": "https://gizmodo.com/trump-and-his-online-alpha-males-have-a-meltdown-over-nycs-newest-socialist-star-2000621801",
    "timestamp": "2025-06-28T20:50:57Z"
  },
  {
    "title": "'They don't want you to know': Ex-Trump operative warns of secret 'power shift'",
    "description": "A former \"trusted operative\" of Donald Trump is sounding the alarm about a \"global power shift\" purportedly in the works.Lev Parnas, whose story of working with Trump on issues that led to the president's first impeachment is told in a documentary called From…",
    "link": "https://www.rawstory.com/trump-dont-know-power-shift/",
    "timestamp": "2025-06-28T20:48:47Z"
  },
  {
    "title": "Trump nearly won a majority of Latino voters in 2024, Pew study finds",
    "description": "A study of the 2024 vote found that Trump received more support from Latinos than previously believed President Donald Trump came within striking distance of winning the Latino vote in 2024, capturing higher numbers of Latino voters than previously believed, …",
    "link": "https://freerepublic.com/focus/f-news/4325851/posts",
    "timestamp": "2025-06-28T20:46:37Z"
  },
  {
    "title": "Israeli strikes kill at least 72 people in Gaza as war rages on",
    "description": "Israeli strikes have killed at least 72 people across Gaza overnight and into Saturday, according to Palestinian health workers, amid growing hopes for a ceasefire after 21 months of war.",
    "link": "https://www.abc.net.au/news/2025-06-29/israel-strikes-gaza-displacement-tents-ceasefire-talks-improve/105473676",
    "timestamp": "2025-06-28T20:40:55Z"
  },
  {
    "title": "VIDEO: Smerconish Admits Trump Is WINNING; Bluesky Bolsheviks Go NUTS!",
    "description": "VIDEOWINNING!!!On his latest CNN Sunday show, Michael Smerconish acknowledged the obvious, namely that President Trump is on a WINNING roll. This observation caused many Bluesky Bolsheviks to go BERSERK as you can see in their comments that accompany Smerconi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325850/posts",
    "timestamp": "2025-06-28T20:38:45Z"
  },
  {
    "title": "'In business, indecision is killer' - Canadian firms seek certainty in tariff war",
    "description": "Deal or no deal, what Wes Love wants is certainty. His Toronto-area business, Taurus Craco, imports machinery from overseas and distributes it across North America, mainly to the United States. But President Donald Trump's shifting tariffs on Canadian product…",
    "link": "https://freerepublic.com/focus/f-news/4325849/posts",
    "timestamp": "2025-06-28T20:37:15Z"
  },
  {
    "title": "Can China's MiniMax-M1 AI Topple US Rivals? We Put It to the Test",
    "description": "We break down China’s new open-source reasoning model, MiniMax-M1: real benchmarks, hidden tradeoffs, and how it stacks up against competitors.",
    "link": "https://decrypt.co/327569/can-china-minimax-m1-ai-topple-us-rivals-review",
    "timestamp": "2025-06-28T20:36:54Z"
  },
  {
    "title": "U.S. inflation edges up as Trump renews criticism of Fed chief",
    "description": "The U.S. Federal Reserve's preferred inflation measure logged a mild uptick Friday while spending weakened, triggering another tirade by President Donald Trump against the central bank chair for not cutting interest rates sooner. &quot;We have a guy that's ju…",
    "link": "https://japantoday.com/category/business/us-inflation-edges-up-as-trump-renews-criticism-of-fed-chief",
    "timestamp": "2025-06-28T20:36:40Z"
  },
  {
    "title": "GOP Sen. Moreno Dares Media, Democrats, Or ‘Anybody Listening’ to Fact Check His Extensive Big Beautiful Bill Praise",
    "description": "Sen. Moreno spent over 15 minutes praising the Big Beautiful Bill as the greatest legislation ever before Congress, and challenged \"anybody\" to dispute it.\nThe post GOP Sen. Moreno Dares Media, Democrats, Or ‘Anybody Listening’ to Fact Check His Extensive Big…",
    "link": "https://www.mediaite.com/politics/gop-sen-moreno-dares-media-democrats-or-anybody-listening-to-fact-check-his-extensive-big-beautiful-bill-praise/",
    "timestamp": "2025-06-28T20:35:36Z"
  },
  {
    "title": "G7 agrees to avoid higher taxes for U.S. and UK companies",
    "description": "The United States and the Group of Seven nations have agreed to support a proposal that would exempt U.S. companies from some components of an existing global agreement, the G7 said in a statement on Saturday. The group has created a 'side-by-side' system in …",
    "link": "https://japantoday.com/category/world/g7-agrees-to-avoid-higher-taxes-for-us-and-uk-companies",
    "timestamp": "2025-06-28T20:34:12Z"
  },
  {
    "title": "Chief Justice Roberts warns against heated political words about judges",
    "description": "Chief Justice John Roberts, speaking at a moment when threats against judges are on the rise, warned on Saturday that elected officials' heated words about judges can lead to threats or acts of violence by others. Without identifying anyone by name, Roberts c…",
    "link": "https://japantoday.com/category/world/chief-justice-roberts-warns-against-heated-political-words-about-judges",
    "timestamp": "2025-06-28T20:33:14Z"
  },
  {
    "title": "Israeli strikes kill at least 72 people in Gaza as ceasefire prospects move closer",
    "description": "Israeli strikes killed at least 72 people across Gaza overnight Friday and into Saturday, health workers said, as ceasefire prospects were said to be improving after 21 months of war. Three children and their parents were killed in an Israeli strike on a tent…",
    "link": "https://japantoday.com/category/world/at-least-60-people-killed-in-israeli-strikes-in-gaza-as-ceasefire-prospects-inch-closer",
    "timestamp": "2025-06-28T20:32:44Z"
  },
  {
    "title": "Exclusive: Kentuckian Nate Morris Running for Senate to End 'Reign of Mitch McConnell' and His 'Puppets'",
    "description": "Senate Republican candidate Nate Morris said on Breitbart News Saturday he is running to end the \"reign of Mitch McConnell\" and block McConnell's \"puppets\" from entering the Senate.\nThe post Exclusive: Kentuckian Nate Morris Running for Senate to End ‘Reign o…",
    "link": "https://www.breitbart.com/politics/2025/06/28/exclusive-kentuckian-nate-morris-running-senate-end-reign-mitch-mcconnell-his-puppets/",
    "timestamp": "2025-06-28T20:31:12Z"
  },
  {
    "title": "Powell and Lagarde Count Cost of Trump’s Turbulence",
    "description": "The global economy’s concussion from five months of Donald Trump’s presidency is likely to feature when five of the world’s leading central bank chiefs discuss monetary policy in public on Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/powell-and-lagarde-count-cost-of-trumps-turbulence",
    "timestamp": "2025-06-28T20:30:35Z"
  },
  {
    "title": "Justice Department abruptly fires 3 prosecutors involved in Jan. 6 cases, AP sources say",
    "description": "Trump’s pardons of the Jan. 6 rioters led to worries about actions being taken against attorneys involved in the massive prosecution.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_8c8d07d4-892f-5d5c-b73c-9e6bfaa6d0be.html",
    "timestamp": "2025-06-28T20:30:00Z"
  },
  {
    "title": "‘Utterly Insane’: Elon Musk Creeps Back Into Politics With Brutal Attack on Trump-Backed Big Beautiful Bill",
    "description": "Elon Musk took aim at President Donald Trump's Big Beautiful Bill on Saturday as lawmakers were making their way through a new draft of the budget.\nThe post ‘Utterly Insane’: Elon Musk Creeps Back Into Politics With Brutal Attack on Trump-Backed Big Beautiful…",
    "link": "https://www.mediaite.com/media/news/utterly-insane-elon-musk-creeps-back-into-politics-with-brutal-attack-on-trump-backed-big-beautiful-bill/",
    "timestamp": "2025-06-28T20:29:39Z"
  },
  {
    "title": "JOHN YOO: Trump scores historic win as Supreme Court reins in lower courts' overreach",
    "description": "The Supreme Court's 6-3 decision in Trump v. Casa limits federal judges' power to issue nationwide injunctions, allowing presidents to advance their constitutional interpretations",
    "link": "https://www.foxnews.com/opinion/john-yoo-trump-scores-historic-win-supreme-court-reins-lower-courts-overreach",
    "timestamp": "2025-06-28T20:29:09Z"
  },
  {
    "title": "Key blue state Republican says Senate's local tax write-off offer is a 'good deal'",
    "description": "New York Rep. Mike Lawler told Fox News Digital that he is pleased with the Senate's latest compromise on state and local tax deductions.",
    "link": "https://www.foxnews.com/politics/key-blue-state-republican-says-senates-local-tax-write-off-offer-good-deal",
    "timestamp": "2025-06-28T20:28:38Z"
  },
  {
    "title": "EXCLUSIVE — Rep Addison McDowell: Trump Could Be ‘Most Consequential President Since George Washington’",
    "description": "Rep. Addison McDowell (R-NC) told Breitbart News Saturday the Senate is nearing final passage of President Donald Trump’s One Big Beautiful Bill, setting the stage for a July 4 signing ceremony that would mark a landmark legislative victory and historic econo…",
    "link": "https://www.breitbart.com/politics/2025/06/28/exclusive-rep-addison-mcdowell-trump-could-be-most-consequential-president-since-george-washington/",
    "timestamp": "2025-06-28T20:26:51Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations.",
    "link": "https://www.local10.com/business/2025/06/28/whats-in-the-latest-version-of-trumps-big-bill-now-before-the-senate/",
    "timestamp": "2025-06-28T20:21:20Z"
  },
  {
    "title": "Chief Justice Roberts warns against elected officials’ heated political words about judges",
    "description": "Without identifying anyone by name, Roberts clearly referenced Republican President Donald Trump and Senate Democratic leader Chuck Schumer.",
    "link": "https://fortune.com/2025/06/28/chief-justice-john-roberts-supreme-court-elected-officials-political-rhetoric-trump/",
    "timestamp": "2025-06-28T20:19:06Z"
  },
  {
    "title": "Eric Trump suggests he could run for president when his father’s term ends",
    "description": "Eric Trump has hinted that he or another of the Trump family could run for president when his father’s second term in the White House comes to an end. Eric, who is co-executive vice-president of the Trump Organization, said, the road to the White House “would…",
    "link": "https://freerepublic.com/focus/f-news/4325848/posts",
    "timestamp": "2025-06-28T20:18:37Z"
  },
  {
    "title": "Donald Trump set for autumn state visit to UK as No10 denies Starmer 'over-ruled the King' to lay out red carpet after '51st state' Canada threats",
    "description": "Donald Trump is set to make a state visit to Britain this year - possibly as early as September - as Sir Keir Starmer lays out the red carpet for the US president. But No10 has been forced to deny claims that it over-ruled the wishes of the King after Trump v…",
    "link": "https://freerepublic.com/focus/f-news/4325846/posts",
    "timestamp": "2025-06-28T20:17:00Z"
  },
  {
    "title": "What’s in the latest version of Trump’s ‘big bill’ Senate Republicans are trying to pass",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations.",
    "link": "https://www.pbs.org/newshour/politics/whats-in-the-latest-version-of-trumps-big-bill-senate-republicans-are-trying-to-pass",
    "timestamp": "2025-06-28T20:04:48Z"
  },
  {
    "title": "Trump pollster warns Senate GOP against deeper Medicaid cuts (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nTrump pollster warns Senate GOP against deeper Medicaid cuts  —  Jim McLaughlin, one of President Donald Trump's top pollsters, said Hill Republicans should nix Senate Republicans' deeper Medicaid cuts in the megabill or risk dee…",
    "link": "https://www.memeorandum.com/250628/p74",
    "timestamp": "2025-06-28T20:00:33Z"
  },
  {
    "title": "What Would Trump’s Reindustrialized America Look Like?",
    "description": "On the campaign trail, President Donald Trump repeatedly promised to restore America’s manufacturing base. But what exactly is his vision of a reindustrialized America? “I’m... Read More\nThe post What Would Trump’s Reindustrialized America Look Like? appeared…",
    "link": "https://www.dailysignal.com/2025/06/28/what-would-trumps-reindustrialized-america-look-like/",
    "timestamp": "2025-06-28T20:00:00Z"
  },
  {
    "title": "Trump Learned the Lessons of Iraq",
    "description": "President Donald Trump has finally moved the United States past the traumas of the Iraq War. With the bombing of Iranian nuclear facilities in Fordow,... Read More\nThe post Trump Learned the Lessons of Iraq appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/28/trump-learned-the-lessons-of-iraq/",
    "timestamp": "2025-06-28T20:00:00Z"
  },
  {
    "title": "Iran's FM to Trump: Respect Khamenei if you’re serious about a deal",
    "description": "Iran’s Foreign Minister, Abbas Araghchi, on Friday responded to US President Donald Trump’s criticism of Iran’s Supreme Leader Ayatollah Ali Khamenei. In a post on his X account, Araghchi demanded that Trump show respect to Khamenei if he genuinely wants to r…",
    "link": "https://freerepublic.com/focus/f-news/4325844/posts",
    "timestamp": "2025-06-28T19:57:43Z"
  },
  {
    "title": "Newsom accuses GOP of 'literally throwing seniors out on the street' with bill",
    "description": "Donald Trump and Republicans are \"literally throwing seniors out on the street,\" according to California Governor Gavin Newsom.Newsom, a Democratic governor with widely reported sights on the Oval Office, perhaps in 2028, recently sued Fox News for hundreds o…",
    "link": "https://www.rawstory.com/newsum-accuses-gop-throwing-seniors/",
    "timestamp": "2025-06-28T19:52:39Z"
  },
  {
    "title": "Key GOP senator defects on crucial vote, imperiling Trump's 'big, beautiful bill' in narrow majority",
    "description": "Senate Republican Thom Tillis refuses to support Trump's healthcare bill vote, expressing concerns about Medicaid provider tax rate changes that would harm North Carolina",
    "link": "https://www.foxnews.com/politics/key-gop-senator-defects-crucial-vote-imperiling-trumps-big-beautiful-bill-narrow-majority",
    "timestamp": "2025-06-28T19:52:33Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations",
    "link": "https://abcnews.go.com/Business/wireStory/latest-version-trumps-big-bill-now-senate-123306736",
    "timestamp": "2025-06-28T19:50:18Z"
  },
  {
    "title": "Trump golfs with Republican senators Schmitt, Graham and Paul ahead of 'Big, Beautiful Bill' vote",
    "description": "President Donald Trump played golf with Republican senators as they work to pass the \"Big, Beautiful Bill\" by July 4, with Trump endorsing the latest revisions.",
    "link": "https://www.foxnews.com/sports/trump-golfs-republican-senators-schmitt-graham-paul-ahead-big-beautiful-bill-vote",
    "timestamp": "2025-06-28T19:46:36Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations.",
    "link": "https://www.wsls.com/business/2025/06/28/whats-in-the-latest-version-of-trumps-big-bill-now-before-the-senate/",
    "timestamp": "2025-06-28T19:43:26Z"
  },
  {
    "title": "What's In The Latest Version Of Trump's Big Bill Now Before The Senate",
    "description": "At some 940 pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities.",
    "link": "https://www.huffpost.com/entry/trump-congress-tax-cuts-explainer_n_686044bde4b0dd2969bb4f52",
    "timestamp": "2025-06-28T19:42:23Z"
  },
  {
    "title": "Senate votes to move forward on Trump’s ‘big, beautiful bill,’ though measure’s fate remains in question | CNN Politics",
    "description": "Senate Republicans took a major step toward delivering President Donald Trump his “big, beautiful bill” late Saturday, though the fate of the giant tax cuts and spending measure is still in question as other hurdles remain.",
    "link": "https://www.cnn.com/2025/06/28/politics/senate-gop-trump-agenda-bill",
    "timestamp": "2025-06-28T19:41:48Z"
  },
  {
    "title": "Eric Trump for US President? Donald Trump’s son reveals his plans for White House",
    "description": "Eric Trump currently holds the position of Co-Executive Vice President at the Trump Organization, which has recently expanded into the mobile communications industry. He oversees the family’s extensive real estate holdings and brand portfolio in partnership w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/eric-trump-for-us-president-donald-trumps-son-reveals-his-plans-for-white-house/articleshow/122135070.cms",
    "timestamp": "2025-06-28T19:41:41Z"
  },
  {
    "title": "Trump Demands Republicans Crack Down on Nonprofits That Protest ICE",
    "description": "The president endorsed a GOP lawmaker’s bill to take away the tax-exempt status of groups supposedly involved in “unlawful riots”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-ice-protests-republican-bill-nonprofits-1235375003/",
    "timestamp": "2025-06-28T19:38:44Z"
  },
  {
    "title": "Mary Trump Torches ‘Vile’ MAGA Crowd Attacking Mamdani: ‘Bigotry’ Will ‘Only Get Worse’",
    "description": "Mary Trump said \"vile\" attacks against Zohran Mamdani by supporters of President Donald Trump are \"extremely dangerous\" and will \"only get worse.\"\nThe post Mary Trump Torches ‘Vile’ MAGA Crowd Attacking Mamdani: ‘Bigotry’ Will ‘Only Get Worse’ first appeared …",
    "link": "https://www.mediaite.com/media/news/mary-trump-torches-vile-maga-crowd-attacking-mamdani-bigotry-will-only-get-worse/",
    "timestamp": "2025-06-28T19:38:39Z"
  },
  {
    "title": "DOJ Pressure Too Much, Major University President Resigns Amid DEI Investigation",
    "description": "The Trump administration had given the president plenty of warnings to correct the university's diversity, equity and inclusion practices.",
    "link": "https://www.westernjournal.com/doj-pressure-much-major-university-president-resigns-amid-dei-investigation/",
    "timestamp": "2025-06-28T19:34:08Z"
  },
  {
    "title": "RFK Jr. made promises about vaccines. Here's what he's done as health secretary",
    "description": "The Health and Human Services Department under Kennedy took unprecedented steps to change how vaccines are evaluated, approved and recommended.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_a1eed918-84d4-5c9c-b46a-c7959e47b1b5.html",
    "timestamp": "2025-06-28T19:30:00Z"
  },
  {
    "title": "DOGE Terminates Nearly 3,000 Government Phones",
    "description": "DOGE cuts nearly 3,000 government phones across agencies, saving $2.84M annually through cuts to mobile, landline, and VOIP services.",
    "link": "https://www.newsweek.com/doge-terminates-thousands-government-phones-2092060",
    "timestamp": "2025-06-28T19:27:25Z"
  },
  {
    "title": "Terror in Gaza: Hamas offers bounties to kill US and local aid workers, group says",
    "description": "Hamas has placed bounties on the heads of Gaza Humanitarian Foundation workers, including American security personnel and local staff. GHF is calling on the international community to condemn Hamas.",
    "link": "https://www.foxnews.com/world/terror-gaza-hamas-offers-bounties-kill-us-local-aid-workers-group-says",
    "timestamp": "2025-06-28T19:23:32Z"
  },
  {
    "title": "We just got a deafening message — ignore it at your peril",
    "description": "I want to spend just a few minutes on the blockbuster New York City mayoral race, because everybody else seems to be doing it, and very few of them seem to be getting it right.Zohran Mamdani flattened the establishment Democrat, Andrew Cuomo, in the city’s pr…",
    "link": "https://www.rawstory.com/raw-investigates/zohran-mamdani/",
    "timestamp": "2025-06-28T19:21:32Z"
  },
  {
    "title": "At least 81 people killed in Israeli strikes in Gaza, Hamas-run health ministry says",
    "description": "Hospital staff and witnesses said at least 11 people were killed after a strike near tents housing displaced people on Friday.",
    "link": "https://www.bbc.com/news/articles/czry8g5n80zo",
    "timestamp": "2025-06-28T19:20:18Z"
  },
  {
    "title": "Bret Baier Busts Out Killer Trump Impression To Recall President Dressing Him Down Back in the Day",
    "description": "Fox News Channel's Bret Baier busted out an impression of President Donald Trump to recall a time Trump dressed the reporter down.\nThe post Bret Baier Busts Out Killer Trump Impression To Recall President Dressing Him Down Back in the Day first appeared on Me…",
    "link": "https://www.mediaite.com/media/podcasts/bret-baier-busts-out-killer-trump-impression-to-recall-president-dressing-him-down-back-in-the-day/",
    "timestamp": "2025-06-28T19:19:48Z"
  },
  {
    "title": "Disgraced Pentagon still insists that Iranian nuclear facilities were ‘destroyed’",
    "description": "After the first Pentagon press briefing on Operation “Midnight Hammer”, even the mainstream propaganda machine remained “unconvinced”. Obviously, many will attribute this to the Trump Derangement Syndrome. However, while TDS is still a big part of their motiv…",
    "link": "https://www.globalresearch.ca/disgraced-pentagon-still-insists-that-iranian-nuclear-facilities-were-destroyed/5893087",
    "timestamp": "2025-06-28T19:19:16Z"
  },
  {
    "title": "Exclusive — Sen. Markwayne Mullin: 'Big, Beautiful Bill' Leaves Woke DEI Behind in the Trump Era of Prosperity",
    "description": "A \"yes\" vote for the \"big, beautiful bill\" is a vote moving away from woke Democrat policies and a vote for President Donald Trump's agenda, Sen. Markwayne Mullin (R-OK) said during an appearance on Breitbart News Saturday.\nThe post Exclusive — Sen. Markwayne…",
    "link": "https://www.breitbart.com/radio/2025/06/28/exclusive-sen-markwayne-mullin-big-beautiful-bill-leaves-woke-dei-behind-in-the-trump-era-of-prosperity/",
    "timestamp": "2025-06-28T19:17:58Z"
  },
  {
    "title": "Exclusive -- Sen. Markwayne Mullin: America Continues to Win with President Trump at the Helm",
    "description": "America continues to tally up win after win with President Donald Trump at the helm, Sen. Markwayne Mullin (R-OK) said during an appearance on Breitbart News Saturday.\nThe post Exclusive — Sen. Markwayne Mullin: America Continues to Win with President Trump a…",
    "link": "https://www.breitbart.com/radio/2025/06/28/exclusive-sen-markwayne-mullin-america-continues-win-president-trump-helm/",
    "timestamp": "2025-06-28T19:13:56Z"
  },
  {
    "title": "Dozens of Palestinians killed in Israeli airstrikes in Gaza",
    "description": "Dozens of Palestinians have died in several rounds of Israeli airstrikes from Friday night until Saturday morning, officials said.",
    "link": "https://www.upi.com/Top_News/World-News/2025/06/28/airstrikes-kills-people-Gaza/5201751129036/",
    "timestamp": "2025-06-28T19:13:05Z"
  },
  {
    "title": "New Jersey lawmaker, inspired by Trump’s Gulf of America, suggests new name for Delaware Bay",
    "description": "The Garden State should rename its historic Delaware Bay to “The Bay of New Jersey,” Republican state Sen. Michael Testa proposed in new legislation this week.",
    "link": "https://nypost.com/2025/06/28/us-news/new-jersey-lawmaker-suggests-new-name-for-historic-delaware-bay/",
    "timestamp": "2025-06-28T19:12:34Z"
  },
  {
    "title": "Republicans steamroll toward final vote on Trump's tax and spending cuts bill",
    "description": "The News\nRepublicans are closer than ever to passing President Donald Trump’s huge party-line tax and spending cuts bill before July 4, as its Senate prospects brightened on ahead of a critical initial vote on Saturday afternoon.\nTrump is getting increasingly…",
    "link": "https://biztoc.com/x/f3797cef0e571974",
    "timestamp": "2025-06-28T19:11:59Z"
  },
  {
    "title": "Trump pollster warns Senate GOP against deeper Medicaid cuts",
    "description": "Jim McLaughlin, one of President Donald Trump’s top pollsters, said Hill Republicans should nix Senate Republicans’ deeper Medicaid cuts in the megabill or risk deep backlash from voters. \n“The Senate needs to go back to the House version on Medicaid in the […",
    "link": "https://biztoc.com/x/92047e26a0a8064d",
    "timestamp": "2025-06-28T19:11:42Z"
  },
  {
    "title": "Young socialist defeats New York's Democratic establishment",
    "description": "It was a primary race that pitted competing visions for the Democratic Party against one another, and in the end, the New York progressives emerged victorious. They now believe they have the momentum to change their party.",
    "link": "https://www.abc.net.au/news/2025-06-29/zohran-mamdani-democratic-party-nyc-mayor-race-andrew-cuomo/105461744",
    "timestamp": "2025-06-28T19:03:23Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations.",
    "link": "https://www.news4jax.com/business/2025/06/28/whats-in-the-latest-version-of-trumps-big-bill-now-before-the-senate/",
    "timestamp": "2025-06-28T19:01:08Z"
  },
  {
    "title": "Trump Brokers Peace Deal Between DR Congo And Rwanda — Now Eyes Billions In US Investment",
    "description": "President Donald Trump revealed a peace agreement on June 27 between the Democratic Republic of the Congo and Rwanda, aimed at halting long-standing violence in eastern Congo and unlocking U.S.-backed economic development in the region.\nThe treaty announcemen…",
    "link": "https://biztoc.com/x/f6dbf0788e0e8a74",
    "timestamp": "2025-06-28T19:00:56Z"
  },
  {
    "title": "Gavin Newsom Defamed By Fox News, Demands Network Pay The F*ck Up",
    "description": "He also hints he's got something juicy on Trump.",
    "link": "https://www.wonkette.com/p/gavin-newsom-defamed-by-fox-news",
    "timestamp": "2025-06-28T19:00:46Z"
  },
  {
    "title": "Donald Trump for the Nobel Peace Prize? After Pakistan, now Congo joins the push",
    "description": "Donald Trump facilitated a peace agreement between the Democratic Republic of Congo and Rwanda. The deal aims to end a thirty-year conflict. As part of the agreement, Rwandan troops will withdraw from eastern Congo. The President of Congo is reportedly consid…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-for-the-nobel-peace-prize-after-pakistan-now-congo-joins-the-push-donald-trump-news-nobel-peace-prize-news/articleshow/122134302.cms",
    "timestamp": "2025-06-28T19:00:39Z"
  },
  {
    "title": "JD Vance rejects Democrats' narrative, names the 'real threat to democracy'",
    "description": "Democrats and elements of the liberal media have suggested ad nauseam that President Donald Trump, his supporters, and like-minded Republicans constitute threats to democracy.After a Biden official's group got Trump temporarily removed in 2023 from the presid…",
    "link": "https://www.theblaze.com/news/jd-vance-rejects-democrats-narrative-names-the-real-threat-to-democracy",
    "timestamp": "2025-06-28T19:00:00Z"
  },
  {
    "title": "Leigh Hart on his new show, career longevity and when he crossed the line – Ask Me Anything with Paula Bennett",
    "description": "The SportsCafe star is back on Radio Hauraki with a new show and podcast.",
    "link": "https://www.nzherald.co.nz/lifestyle/leigh-hart-on-his-new-show-the-longevity-of-his-career-and-when-he-crossed-the-line-ask-me-anything-with-paula-bennett/XFNICMXEFRD6ZE3KUG5RSBS5VI/",
    "timestamp": "2025-06-28T19:00:00Z"
  },
  {
    "title": "Black Trump DOJ appointee slammed for 'shameful' attack on Justice Jackson",
    "description": "A Black Fox News contributor who turned that gig into a Donald Trump nomination to serve in the Department of Justice, is facing blowback after he lashed out in an ugly way at Justice Ketanji Brown Jackson on Friday.Leo Terrrell, an attorney and radio host wh…",
    "link": "https://www.rawstory.com/on-ketanji-jackson/",
    "timestamp": "2025-06-28T18:58:45Z"
  },
  {
    "title": "Catnaps, piddle packs and pep pills: Inside a marathon B-2 bomber mission",
    "description": "Very few pilots know what it's like to fly a B-2 stealth bomber for more than 30 hours straight. But a couple of those who do reveal what goes on inside the cockpit on a marathon mission.",
    "link": "https://www.abc.net.au/news/2025-06-29/inside-a-marathon-b-2-bomber-mission/105472106",
    "timestamp": "2025-06-28T18:57:45Z"
  },
  {
    "title": "How the Emergency makes us immune to democracy damage",
    "description": "The author reflects on the anniversary of the Emergency in India. It coincides with his mother's birthday. He examines how the Emergency is now used to deflect criticism of current government actions. Comparisons are drawn to other historical events. The auth…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/how-the-emergency-makes-us-immune-to-democracy-damage/articleshow/122134910.cms",
    "timestamp": "2025-06-28T18:55:31Z"
  },
  {
    "title": "Trump Admin Terminating TPS for Haitians Slammed as Potential 'Death Sentence'",
    "description": "Outrage over U.S. President Donald Trump's administration terminating Temporary Protected Status for around half a million Haitians, despite dire conditions in the Caribbean country, continued to mount on Saturday, with critics decrying the decision as harsh …",
    "link": "https://www.commondreams.org/news/trump-tps",
    "timestamp": "2025-06-28T18:55:08Z"
  },
  {
    "title": "Cato Institute VP Dismisses Mass Fentanyl Deaths: Voluntary Overdoses 'Are Not Homicides'",
    "description": "The open-borders Cato Institute is on the defensive after one of its top pro-migration advocates dismissed the overdose deaths of many young Americans as \"voluntary\" transactions.\nThe post Cato Institute VP Dismisses Mass Fentanyl Deaths: Voluntary Overdoses …",
    "link": "https://www.breitbart.com/crime/2025/06/28/cato-advocate-dismisses-mass-drug-deaths-the-people-who-voluntarily-took-fentanyl/",
    "timestamp": "2025-06-28T18:54:27Z"
  },
  {
    "title": "With Supreme Court ruling, another check on Trump's power fades",
    "description": "A Supreme Court ruling limits judges' ability to block government actions, potentially expanding presidential power. This decision restricts lower courts from issuing universal injunctions, impacting policies like ending birthright citizenship. Critics argue …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/with-supreme-court-ruling-another-check-on-trumps-power-fades/articleshow/122134880.cms",
    "timestamp": "2025-06-28T18:51:44Z"
  },
  {
    "title": "Israeli strikes kill at least 62 people in Gaza as ceasefire prospects move closer",
    "description": "Israeli strikes across Gaza resulted in at least 62 deaths, including children, raising concerns as ceasefire prospects improve. Amidst ongoing indirect talks, the conflict has claimed over 56,000 Palestinian lives since October 7, 2023. Simultaneously, a dir…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-strikes-kill-at-least-62-people-in-gaza-as-ceasefire-prospects-move-closer/articleshow/122134874.cms",
    "timestamp": "2025-06-28T18:50:41Z"
  },
  {
    "title": "FBI back to nabbing violent criminals, after Biden-era politicization",
    "description": "14,000 cartel leaders, child predators, anti-deportation rioters, others, arrested in just 4 months, according to Deputy Director Dan Bongino",
    "link": "https://www.wnd.com/2025/06/fbi-back-nabbing-violent-criminals-after-biden-era/",
    "timestamp": "2025-06-28T18:48:30Z"
  },
  {
    "title": "A week of shifting descriptions of Iran attack spark ongoing questions",
    "description": "It's been a week since the U.S. attack on three Iranian nuclear sites and the administration's conclusions about the bombing's successes is still in flux.",
    "link": "https://abcnews.go.com/Politics/week-shifting-descriptions-iran-attack-spark-ongoing-questions/story?id=123279659",
    "timestamp": "2025-06-28T18:48:23Z"
  },
  {
    "title": "CNN's Honig: Biden Admin. Argued 'Exact Same Thing' as Trump Admin. on Injunctions",
    "description": "On Friday’s broadcast of CNN’s “The Source,” CNN Senior Legal Analyst Elie Honig stated that the Supreme Court’s ruling on nationwide injunctions “should not be seen as some mad power grab by Donald Trump. It’s the same thing Joe Biden\nThe post CNN’s Honig: B…",
    "link": "https://www.breitbart.com/clips/2025/06/28/cnns-honig-biden-admin-argued-exact-same-thing-as-trump-admin-on-injunctions/",
    "timestamp": "2025-06-28T18:44:02Z"
  },
  {
    "title": "Donald Trump’s Failed “12 Days War” against Iran. Trump and his Adminstration are Boldface “Liars”",
    "description": "Operation Midnight Hammer (OMH) consisting in the deployment of B-2 Aircraft out of Whitman Air Force Base  was in many regards improvised. \nOMH was undertaken by US Central Command (USCENTCOM), based in Florida in close coordination with US Strategic …\nThe p…",
    "link": "https://www.globalresearch.ca/donald-trumps-failed-12-days-war-against-iran-trump-and-his-adminstration-are-boldface-liars/5893036",
    "timestamp": "2025-06-28T18:42:32Z"
  },
  {
    "title": "5 Times The Trump Administration Had Fun With The News This Week",
    "description": "From the United States successfully bombing Iran’s nuclear sites to several Supreme Court wins, the news cycle this week has been a wild ride. President Donald Trump has continued his internet trolling through it all. Just in case you missed them amid fears o…",
    "link": "https://thefederalist.com/2025/06/28/5-times-the-trump-administration-had-fun-with-the-news-this-week/",
    "timestamp": "2025-06-28T18:36:58Z"
  },
  {
    "title": "12,000 German companies went bust in six months – economic tracker",
    "description": "Nearly 12,000 German companies went bankrupt in the first half of 2025, according to economic tracking agency Creditreform Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620721-germany-corporate-insolvencies-record/",
    "timestamp": "2025-06-28T18:36:05Z"
  },
  {
    "title": "Canada brutally hits back at Trump's tariffs ultimatum with huge hike that could cripple struggling US industry",
    "description": "Canada has dramatically hiked duties on American steel imports after Donald Trump shut down trade talks. The country imposed an import quota late Friday and if it is exceeded, certain US metal will face a new 50 percent surcharge. Canada's Finance Minister, F…",
    "link": "https://freerepublic.com/focus/f-news/4325838/posts",
    "timestamp": "2025-06-28T18:35:35Z"
  },
  {
    "title": "California Closes $12 Billion Budget Deficit With Hit to Migrants",
    "description": "Starting in 2026, California will halt new enrollments for undocumented adults in Medi-Cal, effectively capping the program's growth.",
    "link": "https://www.newsweek.com/california-closes-12-billion-budget-deficit-migrants-healthcare-2092041",
    "timestamp": "2025-06-28T18:32:32Z"
  },
  {
    "title": "Venice protests target Bezos over mounting grievances",
    "description": "ROME (Reuters) -Mass tourism, impossibly high rents, worker exploitation, inequality and elitism: Venice, Italy's protests in recent days against Jeff Bezos and Lauren Sanchez's high-profile wedding have highlighted growing global grievances. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/29/venice-protests-target-bezos-over-mounting-grievances",
    "timestamp": "2025-06-28T18:21:00Z"
  },
  {
    "title": "WATCH -- 'We're Doing Our Job': California Officers Rescue Carjacking Suspect from Burning Vehicle",
    "description": "Police officers in Sacramento, California, recently put their lives on the line to rescue a suspect from extreme danger.\nThe post WATCH — ‘We’re Doing Our Job’: California Officers Rescue Carjacking Suspect from Burning Vehicle appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/06/28/watch-were-doing-our-job-california-officers-rescue-carjacking-suspect-burning-vehicle/",
    "timestamp": "2025-06-28T18:18:51Z"
  },
  {
    "title": "SCOOP: Blue state Republican could oppose Trump tax bill over Medicaid changes",
    "description": "A key moderate House Republican could oppose the GOP's reconciliation bill over Senate changes to Medicaid.",
    "link": "https://www.foxnews.com/politics/scoop-blue-state-republican-could-oppose-trump-tax-bill-over-medicaid-changes",
    "timestamp": "2025-06-28T18:17:16Z"
  },
  {
    "title": "Trump’s Big, Beautiful Bill sparks panic among MAGA voters: ‘We’d lose everything’",
    "description": "President Trump's proposed $3.8 trillion tax cut bill, dubbed his \"big, beautiful bill,\" is sparking alarm among his supporters due to potential Medicaid cuts. These cuts, estimated to impact millions, could jeopardize healthcare access for vulnerable populat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-big-beautiful-bill-sparks-panic-among-maga-voters-wed-lose-everything-donald-trump-news-us-news-big-beautiful-bill-news/articleshow/122133770.cms",
    "timestamp": "2025-06-28T18:12:59Z"
  },
  {
    "title": "'I could do it': Eric Trump ponders a future run for president",
    "description": "President Donald Trump's 41-year-old middle son told the Financial Times he'd consider extending the family dynasty in presidential politics.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/28/eric-trump-run-for-president/84400062007/",
    "timestamp": "2025-06-28T18:10:08Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. Now it’s up to the Republican-controlled Congress to decide whether President…",
    "link": "https://www.seattlepi.com/business/article/what-s-in-the-latest-version-of-trump-s-big-bill-20398754.php",
    "timestamp": "2025-06-28T18:06:27Z"
  },
  {
    "title": "Chicago’s Water Runs Through Lead Pipes. Why Are They Taking Decades to Replace?",
    "description": "Chicagoans face continued exposure to toxic drinking water as the city struggles for funding to remedy the system.",
    "link": "https://grist.org/accountability/chicago-lead-pipe-service-line-replacement-plan-epa/",
    "timestamp": "2025-06-28T18:02:36Z"
  }
]