[
  {
    "title": "Americans are getting fed up with the economy. Does that mean we’re heading into a recession?",
    "description": "American consumers and businesses are feeling uneasy, fearing higher inflation is lurking around the corner as President Donald Trump talks massive tariffs. That’s raising questions on what America’s souring economic mood means for spending, hiring and the fu…",
    "link": "https://biztoc.com/x/d5bddad9624bb7ea",
    "timestamp": "2025-02-26T19:42:33Z"
  },
  {
    "title": "High-level EU-US diplomatic talks are called off as transatlantic tensions rise",
    "description": "A planned meeting between European Union foreign policy chief Kaja Kallas and Secretary of State Marco Rubio has abruptly canceled due to “scheduling issues.”",
    "link": "https://abcnews.go.com/US/wireStory/high-level-eu-us-diplomatic-talks-called-off-119222209",
    "timestamp": "2025-02-26T19:42:24Z"
  },
  {
    "title": "Michael Wolff at the Door: His New Bombshell Book on Donald Trump and the MAGA Bubble",
    "description": "Vanity Fair editors are joined by the ‘All or Nothing’ author to unpack the rotating cast of loyalists and opportunists who have fallen in and out of the president’s orbit, from Natalie Harp to Jared Kushner to Rupert Murdoch, and divine the fate of MAGA newc…",
    "link": "https://www.vanityfair.com/news/story/michael-wolff-donald-trump-inside-the-hive",
    "timestamp": "2025-02-26T19:42:15Z"
  },
  {
    "title": "How Sam Altman Could Break Up Elon Musk and Donald Trump",
    "description": "Two of the most powerful tech executives in the world are desperate for the president’s approval.",
    "link": "https://www.theatlantic.com/technology/archive/2025/02/sam-altman-elon-musk-trump/681838/",
    "timestamp": "2025-02-26T19:42:00Z"
  },
  {
    "title": "‘Fox & Friends’ extends ratings lead as MSNBC’s ‘Morning Joe’ loses nearly half its audience since election",
    "description": "\"Morning Joe\" saw its total audience shrink by 40% in the post-election period -- from 1.1 million to just 651,000 from Nov. 6 until Friday.",
    "link": "https://nypost.com/2025/02/26/media/fox-news-fox-amp-friends-outpaces-struggling-morning-joe-of-msnbc/",
    "timestamp": "2025-02-26T19:41:25Z"
  },
  {
    "title": "Tariffs will come, but there is still room to negotiate: White House",
    "description": "The White House official said that, as of now, tariffs against Canada would be going ahead Tuesday. That could change, the official added, depending on the outcome of ongoing negotiations.",
    "link": "https://www.nationalobserver.com/2025/02/26/news/tariffs-negotiate-white-house",
    "timestamp": "2025-02-26T19:41:10Z"
  },
  {
    "title": "Lapid's gazaplan would be 'national suicide' for Israel, Egypt, expert says",
    "description": "A former intelligence officer and Egypt expert spoke about the possibility that Egypt will take part in Trump's Gaza plan.",
    "link": "https://www.jpost.com/israel-news/article-843904",
    "timestamp": "2025-02-26T19:40:29Z"
  },
  {
    "title": "Donald Trump, Elon Musk caught in insane scandal - NewsBreak",
    "description": "United States President Donald Trump and his right-hand man, tech billionaire Elon Musk, have been extremely busy since Trump’s return to the Oval Office.",
    "link": "https://www.newsbreak.com/share/3830731901226-donald-trump-elon-musk-caught-in-insane-scandal?s=a2&share_destination_id=MTc5NTk0Nzc5LTE3NDA1OTg2NjQ0Mzg%3D&pd=0C9Ynzwh&hl=en_US&send_time=1740598664&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v7",
    "timestamp": "2025-02-26T19:38:08Z"
  },
  {
    "title": "Trump Budget Bill Passes on a Wave of Promises and Lies",
    "description": "The House budget resolution passed on a narrow party-line basis after Johnson and Trump made a lot of promises and told a lot of lies. But it’s one small step down a long road to big tax and budget cuts.",
    "link": "http://nymag.com/intelligencer/article/trump-budget-bill-passes-on-a-wave-of-promises-and-lies.html",
    "timestamp": "2025-02-26T19:38:06Z"
  },
  {
    "title": "Status of Oceanside Social Security office in doubt amid DOGE cuts",
    "description": "The Department of Government Efficiency (DOGE) website says a Social Security Administration office in Carlsbad was closed. However, the office is not in Carlsbad, it's in Oceanside.",
    "link": "https://www.kpbs.org/news/politics/2025/02/26/status-of-oceanside-social-security-office-in-doubt-amid-doge-cuts",
    "timestamp": "2025-02-26T19:37:34Z"
  },
  {
    "title": "Feds Identify Hacker Behind Disturbing Trump-Musk Foot-Kissing AI Video Broadcast On Government TVs: Report",
    "description": "Federal officials have reportedly identified the hacker who displayed an AI-generated video of President Trump kissing the feet of Elon Musk on HUD TVs.\nThe post Feds Identify Hacker Behind Disturbing Trump-Musk Foot-Kissing AI Video Broadcast On Government T…",
    "link": "https://www.mediaite.com/news/feds-identify-hacker-behind-disturbing-trump-musk-foot-kissing-ai-video-broadcast-on-government-tvs-report/",
    "timestamp": "2025-02-26T19:37:34Z"
  },
  {
    "title": "Chagos deal will not go ahead if US rejects it, says Lammy",
    "description": "David Lammy says the UK \"a shared military and intelligence interest\" with the US in the territory.",
    "link": "https://www.bbc.com/news/articles/c89y74pvp09o",
    "timestamp": "2025-02-26T19:35:47Z"
  },
  {
    "title": "Trump’s Plan for a Greatly Diminished America",
    "description": "Washington is rapidly destroying its international goodwill while Moscow and Beijing cheer along.",
    "link": "https://foreignpolicy.com/2025/02/26/trump-china-russia-virtue-ethics/",
    "timestamp": "2025-02-26T19:35:14Z"
  },
  {
    "title": "Judge blocks Trump’s pause on refugee admissions",
    "description": "null / Credit: Billion Photos/Shutterstock\n\nCNA Staff, Feb 26, 2025 / 14:35 pm (CNA).\nA federal judge in Seattle blocked the Trump administration’s suspension of the U.S. Refugee Admissions program on Tuesday.In a preliminary injunction, U.S. District Judge J…",
    "link": "https://www.catholicnewsagency.com/news/262447/judge-blocks-trump-s-pause-on-refugee-admissions",
    "timestamp": "2025-02-26T19:35:00Z"
  },
  {
    "title": "What will Keir Starmer try to achieve during talks with Donald Trump? - The Guardian US",
    "description": "What will Keir Starmer try to achieve during talks with Donald Trump?The Guardian US UK’s Starmer to Meet Trump With a Boost on Defense and Pleas for UkraineThe New York Times U.K. Prime Minister Keir Starmer is set to visit the White House. Here's what to kn…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176552647",
    "timestamp": "2025-02-26T19:32:49Z"
  },
  {
    "title": "Trump’s trade envoy Jamieson Greer confirmed by lawmakers",
    "description": "US lawmakers voted Wednesday to confirm lawyer Jamieson Greer as Donald Trump’s trade envoy, rounding out the president’s top economic team with a key figure in tariff policy as the president threatens levies on friend and foe alike. Trump has unveiled a voll…",
    "link": "https://www.digitaljournal.com/world/trumps-trade-envoy-jamieson-greer-confirmed-by-lawmakers/article",
    "timestamp": "2025-02-26T19:32:34Z"
  },
  {
    "title": "Zelensky also confirms his trip to US",
    "description": "Ukrainian President Volodymyr Zelensky also confirmed on Wednesday that he would be traveling to the United States on February 28, to meet with his US counterpart Donald Trump and sign the minerals de...",
    "link": "https://biztoc.com/x/ca55262e7af43326",
    "timestamp": "2025-02-26T19:31:44Z"
  },
  {
    "title": "Trump to Offer $5 Million ‘Gold Card’ Visas to Wealthy Foreigners",
    "description": "President Donald Trump said he is starting a program to offer residency and a path to citizenship to investors who pay $5 million, offering a new avenue for legal immigration even as he carries out a sweeping crackdown on undocumented migrants.\nTrump said the…",
    "link": "https://biztoc.com/x/e2b77144bf995ffc",
    "timestamp": "2025-02-26T19:31:14Z"
  },
  {
    "title": "‘Can I finish talking?’ ‘The View’ co-host shuts down Sunny Hostin’s attempt to make illegal immigration about race",
    "description": "'It has nothing to do with Canadians'",
    "link": "https://www.wnd.com/2025/02/can-i-finish-talking-the-view-co-host-shuts-down-sunny-hostins-attempt-to-make-illegal-immigration-about-race/",
    "timestamp": "2025-02-26T19:29:31Z"
  },
  {
    "title": "New poll indicates a tight race in upcoming federal election",
    "description": "A new survey from Ipsos released this week suggests that if an election were held today, 38 per cent of Canadians would support the Liberals and 36 per cent would back the Conservatives.",
    "link": "https://www.nationalobserver.com/2025/02/26/news/polls-tight-race-federal-election",
    "timestamp": "2025-02-26T19:28:05Z"
  },
  {
    "title": "Trump Hawks Hideous Merch Straight From the Oval Office",
    "description": "Donald Trump might as well set up a merch booth in the Oval Office.\r\nThe president, accompanied by Health Secretary Robert F. Kennedy Jr. and Commerce Secretary Howard Lutnick, decided to hawk some new MAGA merch near the end of an executive order signing ses…",
    "link": "https://newrepublic.com/post/192028/trump-was-right-merch-maga-cap-oval-office",
    "timestamp": "2025-02-26T19:27:53Z"
  },
  {
    "title": "Starmer slashes aid to fund major increase in defence spending",
    "description": "Keir Starmer has announced that Britain will “fight for peace in Europe” with a generational increase in defence spending paid for by slashing the foreign aid budget. The move, just two days before the prime minister is due to meet Donald Trump, raised immedi…",
    "link": "https://freerepublic.com/focus/f-news/4300684/posts",
    "timestamp": "2025-02-26T19:27:04Z"
  },
  {
    "title": "Conservatives say Carney is lying about his role moving investment firm's office to U.S.",
    "description": "The Liberal leadership front-runner is facing scrutiny for some of the decisions made by Brookfield Asset Management during his time as chairman of the board — including one to move the company's head office from Toronto to the U.S. to pull in more American i…",
    "link": "https://www.cbc.ca/news/politics/mark-carney-brookfield-1.7469116",
    "timestamp": "2025-02-26T19:25:43Z"
  },
  {
    "title": "EXCLUSIVE: Man Arrested For Allegedly Plotting ‘Mass Casualty’ Event Was ‘Transitioning’ Genders, Police Confirm",
    "description": "A Texas man arrested for allegedly planning a “mass casualty event” against law enforcement was “transitioning” genders, a police source confirmed to the Caller. The FBI’s Houston office announced Monday that it arrested Seth “Andrea” Gregori after he alleged…",
    "link": "https://freerepublic.com/focus/f-news/4300683/posts",
    "timestamp": "2025-02-26T19:25:27Z"
  },
  {
    "title": "Apple’s dictation system transcribes the word ‘racist’ as ‘Trump’",
    "description": "iPhone users noticed an issue with Apple’s automatic dictation when sending messages: the word “racist” briefly showed up as “Trump” before…\nThe post Apple’s dictation system transcribes the word ‘racist’ as ‘Trump’ appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/02/26/apples-dictation-system-transcribes-the-word-racist-as-trump/",
    "timestamp": "2025-02-26T19:25:20Z"
  },
  {
    "title": "Romania launches criminal inquiry against far-right presidential front-runner",
    "description": "Prosecutors investigating Calin Georgescu over alleged hate speech and anti-Semitism",
    "link": "https://www.irishtimes.com/world/europe/2025/02/26/romania-launches-criminal-inquiry-against-far-right-presidential-front-runner/",
    "timestamp": "2025-02-26T19:25:13Z"
  },
  {
    "title": "Zelensky Insists On \"Security Guarantees\" Ahead Of US Visit",
    "description": "Ukrainian President Volodymyr Zelensky said Wednesday that security guarantees were vital ahead of talks in Washington Friday on a mineral resources deal.",
    "link": "https://www.ndtv.com/world-news/zelensky-insists-on-security-guarantees-ahead-of-us-visit-7802683",
    "timestamp": "2025-02-26T19:24:40Z"
  },
  {
    "title": "Trump Signals Postposing Mexico and Canada Tariffs to April 2",
    "description": "U.S. President Donald Trump on Wednesday raised hopes for another pause on steep new tariffs on imports from Mexico and Canada by saying they would take effect on April 2, about a month later than a deadline next week.",
    "link": "https://gcaptain.com/trump-signals-postposing-mexico-and-canada-tariffs-to-april-2/",
    "timestamp": "2025-02-26T19:24:36Z"
  },
  {
    "title": "Frontrunner of Romania's Annulled Election Georgescu Indicted Just Days After Vance Democracy Warning",
    "description": "The sovereigntist frontrunner in Romania's annulled election, Călin Georgescu, was detained by police and charged by prosecutors on Wednesday amid accusations that his campaign was aided by Russia and shortly after U.S. Vice President JD Vance warned of threa…",
    "link": "https://www.breitbart.com/europe/2025/02/26/frontrunner-of-romanias-annulled-election-georgescu-indicted-after-vances-democracy-warning/",
    "timestamp": "2025-02-26T19:24:22Z"
  },
  {
    "title": "BBC Verify: The AI-generated video of Gaza shared by Trump",
    "description": "US President Donald Trump sparked a social media frenzy  when he posted a video of Gaza generated by artificial intelligence on his site Truth Social. Marianna Spring has been analysing the online tactics of Trump and his team.",
    "link": "https://www.bbc.co.uk/news/videos/cj675j69gxgo",
    "timestamp": "2025-02-26T19:24:15Z"
  },
  {
    "title": "South African President Ramaphosa Attacks Trump, Vows to Arrest Netanyahu",
    "description": "South African President Cyril Ramaphosa attacked U.S. President Donald Trump on Tuesday in an article in which he criticized the U.S. for its sanctions on the International Criminal Court (ICC), and also viciously attacked Israel.\nThe post South African Presi…",
    "link": "https://www.breitbart.com/politics/2025/02/26/south-african-president-ramaphosa-attacks-trump-vows-to-arrest-netanyahu/",
    "timestamp": "2025-02-26T19:23:41Z"
  },
  {
    "title": "Gavin Newsom Launches Apple Podcast Featuring Political Interviews – Including MAGA Leaders",
    "description": "\"There's an onslaught of information we take in. So let's take it to the sources without the typical mumbo jumbo,\" the California governor says of his new project\nThe post Gavin Newsom Launches Apple Podcast Featuring Political Interviews – Including MAGA Lea…",
    "link": "https://www.thewrap.com/gavin-newsom-podcast-maga-leader-interviews-apple/",
    "timestamp": "2025-02-26T19:23:23Z"
  },
  {
    "title": "Economic deal between US and Ukraine will tie the countries together for years. Here’s what it says",
    "description": "A preliminary economic agreement between Ukraine and the United States would ensure long-term U.S. involvement in rebuilding the country, but the deal leaves the question of security guarantees sought by Kyiv to future negotiations",
    "link": "https://abcnews.go.com/US/wireStory/economic-deal-us-ukraine-tie-countries-years-heres-119221532",
    "timestamp": "2025-02-26T19:22:49Z"
  },
  {
    "title": "Tulsi Gabbard fires more than 100 intelligence officers over messages in a chat tool",
    "description": "Tulsi Gabbard said she fired more than 100 intel officers for using a government chat tool to discuss topics including polyamory, gender transition, and their political views.",
    "link": "https://www.nbcnews.com/politics/national-security/gabbard-fires-100-intelligence-officers-messages-chat-tool-rcna193799",
    "timestamp": "2025-02-26T19:21:37Z"
  },
  {
    "title": "WATCH: Donald Trump's First Cabinet Meeting Begins with Prayer After President Touts Mineral Deal",
    "description": "President Donald Trump's first official White House cabinet meeting began with a prayer after he delivered brief remarks about his cabinet's performance.\nThe post WATCH: Donald Trump’s First Cabinet Meeting Begins with Prayer After President Touts Mineral Dea…",
    "link": "https://www.breitbart.com/politics/2025/02/26/donald-trumps-first-cabinet-meeting-begins-prayer-president-touts-mineral-deal/",
    "timestamp": "2025-02-26T19:21:26Z"
  },
  {
    "title": "A Tale Of Two Trumps: Clemency For Some, Death For Others In His Drug Policy Approach",
    "description": "U.S. President Donald Trump announced last week that he has appointed Alice Marie Johnson, a Tennessee woman whose drug-related life sentence he commuted in 2018, as his “pardon czar.” The move comes as Trump simultaneously calls for the death penalty for dru…",
    "link": "https://biztoc.com/x/7f52f7a09233eff4",
    "timestamp": "2025-02-26T19:20:23Z"
  },
  {
    "title": "EXCLUSIVE: Eagle-Eyed Political Commentators Spot Elon Musk's 'Creepy and Cringey' Photobomb of Donald Trump's Latest Promo Pic — After President Was 'Caught on Camera Sucking TOES of His First Buddy'",
    "description": "Elon Musk has been spotted in the background of Trump's latest promo pic, as the 'First Buddy' continues to hang around the administration.",
    "link": "https://radaronline.com/p/elon-musk-creepy-photobomb-donald-trump-promo-pic-toes-first-buddy/",
    "timestamp": "2025-02-26T19:20:00Z"
  },
  {
    "title": "WaPo Employees Collectively Struggling To Process Jeff Bezos’ Editorial Shakeup In Defense Of ‘Free Markets’",
    "description": "Jeff Bezos provoked ire among his staffers after he announced a new directive for the opinion section to begin defending \"personal liberties and free markets.\"",
    "link": "https://dailycaller.com/2025/02/26/wapo-employees-jeff-bezos-editorial-shakeup/",
    "timestamp": "2025-02-26T19:19:48Z"
  },
  {
    "title": "DOGE cuts are rattling GOP lawmakers as angry constituents flood town halls",
    "description": "Some Republican lawmakers are starting to balk at Elon Musk’s razing of the federal infrastructure, as they face pushback from angry constituents at town halls and protests at their district offices.",
    "link": "https://www.msnbc.com/top-stories/latest/doge-elon-musk-republicans-town-halls-trump-rcna193813",
    "timestamp": "2025-02-26T19:19:48Z"
  },
  {
    "title": "GOP-led lawsuit that could dismantle disability protections draws public backlash",
    "description": "Advocates say the suit over transgender protections imperils federal safeguards for people with disabilities.",
    "link": "https://www.bostonherald.com/2025/02/26/gop-led-lawsuit-that-could-dismantle-disability-protections-draws-public-backlash/",
    "timestamp": "2025-02-26T19:18:22Z"
  },
  {
    "title": "Did Russia Invade Ukraine? Is Putin a Dictator? We Asked Every Republican Member of Congress",
    "description": "Two simple questions, few straight answers",
    "link": "https://www.theatlantic.com/politics/archive/2025/02/republicans-dictator-putin-ukraine/681841/",
    "timestamp": "2025-02-26T19:18:00Z"
  },
  {
    "title": "Elon Musk says DOGE 'accidentally' cut Ebola prevention",
    "description": "Elon Musk said DOGE will make mistakes. He said an example is how the team briefly cut USAID funding for Ebola prevention.",
    "link": "https://www.businessinsider.com/elon-musk-doge-ebola-prevention-trump-cabinet-meeting-2025-2",
    "timestamp": "2025-02-26T19:17:20Z"
  },
  {
    "title": "Trump rift opens floodgates of disinformation on Ukraine",
    "description": "Disinformation targeting Ukraine and its leader Volodymyr Zelensky is surging as US President Donald Trump’s shift on the war frays relations with Kyiv and threatens to cripple support for the battle-worn nation. Deepfakes, specious videos of Ukrainian soldie…",
    "link": "https://www.digitaljournal.com/world/trump-rift-opens-floodgates-of-disinformation-on-ukraine/article",
    "timestamp": "2025-02-26T19:17:20Z"
  },
  {
    "title": "Trump memo calls on US federal agencies to prepare for mass layoffs",
    "description": "The US president and his allies continue their efforts to dismantle agencies long viewed with ire by conservatives.",
    "link": "https://www.aljazeera.com/news/2025/2/26/trump-memo-calls-on-us-federal-agencies-to-prepare-for-mass-layoffs",
    "timestamp": "2025-02-26T19:17:11Z"
  },
  {
    "title": "Trump says no security promises or NATO for Ukraine",
    "description": "WASHINGTON: President Donald Trump on Wednesday (Feb 26) ruled out offering US security guarantees or NATO membership for Ukraine as his counterpart Volodymyr Zelenskyy prepared to visit to seal a deal on handing",
    "link": "https://www.channelnewsasia.com/world/trump-says-no-security-promises-or-nato-ukraine-4962676",
    "timestamp": "2025-02-26T19:16:37Z"
  },
  {
    "title": "US Federal Agencies Ordered To Prepare Major Job Cuts",
    "description": "US federal agencies have been directed to prepare sweeping workforce reduction plans as part of President Donald Trump&#039;s Department of Government Efficiency initiative, according to a memo issued Wednesday by top administration officials.",
    "link": "https://www.ndtv.com/world-news/us-federal-agencies-ordered-to-prepare-major-job-cuts-7802648",
    "timestamp": "2025-02-26T19:16:36Z"
  },
  {
    "title": "Trump promotes Gaza ethnic cleansing in bizarre AI video",
    "description": "Donald Trump posted an AI-generated video to social media showing him and Benjamin Netanyahu sunbathing together in Gaza as Elon Musk eats hummus outside a resort called \"TRUMP GAZA.\"",
    "link": "https://mondoweiss.net/2025/02/trump-promotes-gaza-ethnic-cleansing-in-bizarre-ai-video/",
    "timestamp": "2025-02-26T19:16:12Z"
  },
  {
    "title": "US, Russia Mull Cooperation on Arctic Shipping and Exploration",
    "description": "US and Russian officials have identified the Arctic as a possible area for economic cooperation, according to people familiar with the situation, part of the broader detente President Donald Trump is pursuing with Moscow.",
    "link": "https://gcaptain.com/us-russia-mull-cooperation-on-arctic-shipping-and-exploration/",
    "timestamp": "2025-02-26T19:16:03Z"
  },
  {
    "title": "EXCLUSIVE: Trump’s Education Department Investigates Civil Rights Violations Ignored by Biden",
    "description": "FIRST ON THE DAILY SIGNAL—The Trump Education Department’s Office for Civil Rights has hit the ground running by initiating investigations into antisemitism, threats to women’s... Read More\nThe post EXCLUSIVE: Trump’s Education Department Investigates Civil R…",
    "link": "https://www.dailysignal.com/2025/02/26/exclusive-trumps-education-department-races-investigate-civil-rights-violations-ignored-biden/",
    "timestamp": "2025-02-26T19:15:51Z"
  },
  {
    "title": "President Shares Disgusting Vision in AI ‘Trump Gaza’ Video",
    "description": "In the ‘Trump Gaza’ AI video posted to Truth Social, the president shares his disgusting vision. Apparently, after expelling Palestinians, he wants to turn Gaza into a resort where he can party with Musk and Netanyahu and be worshipped as a god.",
    "link": "http://nymag.com/intelligencer/article/trump-gaza-ai-video.html",
    "timestamp": "2025-02-26T19:15:51Z"
  },
  {
    "title": "How Many Times Can Trump Be Humiliated By Foreign Leaders In One Week?",
    "description": "Oh how embarrassing for everyone.",
    "link": "https://www.wonkette.com/p/how-many-times-can-trump-be-humiliated",
    "timestamp": "2025-02-26T19:15:40Z"
  },
  {
    "title": "Watch: Trump Says European Union Created to 'Screw' The United States",
    "description": "The EU has \"done a good job\" screwing the U.S. on trade, Trump said during his first cabinet meeting, intoning those days are now over. \nThe post Watch: Trump Says European Union Created to ‘Screw’ The United States appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/02/26/watch-trump-says-european-union-created-to-screw-the-united-states/",
    "timestamp": "2025-02-26T19:15:02Z"
  },
  {
    "title": "Trump faces Truth Social backlash over AI video of Gaza with topless Netanyahu and bearded bellydancers (The Guardian)",
    "description": "The Guardian:\nTrump faces Truth Social backlash over AI video of Gaza with topless Netanyahu and bearded bellydancers  —  Users of president's own social media site criticise video showing reimagined Gaza featuring Trump and Israeli PM sipping cocktails  —  D…",
    "link": "https://www.memeorandum.com/250226/p88",
    "timestamp": "2025-02-26T19:15:00Z"
  },
  {
    "title": "Medicare Policy for Millions Would Get Extended Under New Bill",
    "description": "Medicare is set to run out of funding for telehealth coverage by end of March, but a new bill has been introduced to continue it.",
    "link": "https://www.newsweek.com/medicare-change-millions-under-new-bill-2036731",
    "timestamp": "2025-02-26T19:11:56Z"
  },
  {
    "title": "Threat of federal cuts looms large as NC legislators start budget meetings",
    "description": "State’s expanded Medicaid program is among the public services that could be in jeopardy. More than 600,000 would be affected.",
    "link": "https://www.ncspin.com/threat-of-federal-cuts-looms-large-as-nc-legislators-start-budget-meetings",
    "timestamp": "2025-02-26T19:11:11Z"
  },
  {
    "title": "Canadian dollar gets boost after Trump delays tariffs to April 2",
    "description": "The Canadian dollar got a boost after Donald Trump signalled the deadline for tariffs on goods would be pushed back. Find out more.",
    "link": "https://financialpost.com/news/economy/canadian-dollar-boost-trump-delays-tariffs-april-2",
    "timestamp": "2025-02-26T19:10:34Z"
  },
  {
    "title": "Exclusive -- Sen. Cynthia Lummis: Democrats Fighting Trump's National Energy Emergency Will 'Get Shot Down in a Big Way'",
    "description": "Democrats are chasing bad policy and bad politics in their short-sighted effort to thwart President Donald Trump's American energy renaissance, Sen. Cynthia Lummis (R-WY) explained to Breitbart News on Tuesday.\nThe post Exclusive — Sen. Cynthia Lummis: Democr…",
    "link": "https://www.breitbart.com/politics/2025/02/26/exclusive-sen-cynthia-lummis-democrats-fighting-trumps-national-energy-emergency-will-get-shot-down-in-a-big-way/",
    "timestamp": "2025-02-26T19:10:29Z"
  },
  {
    "title": "Musk and Trump's federal layoffs are just getting started (Politico)",
    "description": "Politico:\nMusk and Trump's federal layoffs are just getting started  —  At the first Cabinet meeting of the new administration, Donald Trump and Elon Musk also hinted that more demands for federal workers to explain their jobs could be coming.  —  Federal age…",
    "link": "https://www.memeorandum.com/250226/p87",
    "timestamp": "2025-02-26T19:10:00Z"
  },
  {
    "title": "When Do the Clocks Move Forward in the U.S.? Your 2025 Guide to Daylight Saving Time",
    "description": "As the practice of Daylight Saving Time continues to spark debate, here's your guide to when the clocks spring forward in 2025.",
    "link": "https://time.com/7261978/daylight-saving-time-march-2025-what-to-know/",
    "timestamp": "2025-02-26T19:09:41Z"
  },
  {
    "title": "Trump vows to slap 25% tariffs on EU and claims bloc was ‘formed to screw US’",
    "description": "President says at first cabinet meeting that levies would be applied ‘generally’ and that more details would come soon\nDonald Trump has threatened to slap 25% tariffs on the European Union claiming the 27-country bloc was “formed to screw the United States”.\n…",
    "link": "https://biztoc.com/x/361644195fb09fe4",
    "timestamp": "2025-02-26T19:09:09Z"
  },
  {
    "title": "Trump says no security promises or NATO for Ukraine",
    "description": "President Donald Trump on Wednesday ruled out offering US security guarantees or NATO membership for Ukraine as his counterpart Volodymyr Zelensky prepared to visit to seal a deal on handing over natural resources.Trump, who has upended U.S. policy by reachin…",
    "link": "https://www.rawstory.com/trump-says-no-security-promises-or-nato-for-ukraine/",
    "timestamp": "2025-02-26T19:08:34Z"
  },
  {
    "title": "‘Can I Finish Talking?’ The View’s Sunny Hostin Wonders Why Trump Isn’t Rounding Up Illegal Canadian Migrants — As Co-Host Tries Correcting Her",
    "description": "The View's Sunny Hostin claimed on Wednesday that President Donald Trump is only interested in deporting illegal migrants that \"look a certain way.\"\nThe post ‘Can I Finish Talking?’ The View’s Sunny Hostin Wonders Why Trump Isn’t Rounding Up Illegal Canadian …",
    "link": "https://www.mediaite.com/news/can-i-finish-talking-the-views-sunny-hostin-wonders-why-trump-isnt-rounding-up-illegal-canadian-migrants-as-co-host-tries-correcting-her/",
    "timestamp": "2025-02-26T19:06:11Z"
  },
  {
    "title": "EU squares up to US with deregulation, clean tech push",
    "description": "Von der Leyen is recasting her landmark climate laws as a bid to shore up the economic future of Europe, slashing red tape and frustrating environmental campaigners in the process.",
    "link": "https://www.dw.com/en/eu-squares-up-to-us-with-deregulation-clean-tech-push/a-71762713",
    "timestamp": "2025-02-26T19:06:00Z"
  },
  {
    "title": "The Washington Post’s Strategy Is to Do Whatever Jeff Bezos Wants",
    "description": "With a stunning change to its “Opinions” section, the paper of Bob Woodward and Carl Bernstein has officially become the Amazon CEO’s plaything.",
    "link": "http://nymag.com/intelligencer/article/the-washington-posts-strategy-is-to-do-jeff-bezoss-bidding.html",
    "timestamp": "2025-02-26T19:05:37Z"
  },
  {
    "title": "Bank of America Planning To Launch Its Own Stablecoin, According to CEO Brian Moynihan",
    "description": "Bank of America, one of the largest financial institutions in the US, is planning to launch its own stablecoin, according to its CEO. In a new interview at the Economic Club of Washington, D.C., Bank of America CEO Brian Moynihan says they intend to launch a …",
    "link": "https://dailyhodl.com/2025/02/26/bank-of-america-planning-to-launch-its-own-stablecoin-according-to-ceo-brian-moynihan/",
    "timestamp": "2025-02-26T19:05:22Z"
  },
  {
    "title": "Playbook PM: Trump and Musk's unified front on cuts (Eli Okun/Politico)",
    "description": "Eli Okun / Politico:\nPlaybook PM: Trump and Musk's unified front on cuts  —  THE CATCH-UP  —  FROM THE CABINET ROOM: It was a lovefest between President Donald Trump and Elon Musk at the first Cabinet meeting of the term, as the Trump administration steps up …",
    "link": "https://www.memeorandum.com/250226/p84",
    "timestamp": "2025-02-26T19:05:01Z"
  },
  {
    "title": "DOJ Targets States Allowing Trans Students in Women’s Sports",
    "description": "“[The DOJ] does not tolerate state officials who ignore federal law,” said Attorney General Pam Bondi.",
    "link": "https://truthout.org/articles/doj-targets-states-allowing-trans-students-in-womens-sports/",
    "timestamp": "2025-02-26T19:04:56Z"
  },
  {
    "title": "Trump eyes 65% staff cut at U.S. environmental agency",
    "description": "U.S. President Donald Trump on Wednesday said his administration aims to cut around 65 percent of staff at the Environmental Protection Agency, a key regulatory body that works on a range of areas, including climate change.\"I spoke with Lee Zeldin and he thin…",
    "link": "https://www.rawstory.com/trump-eyes-65-staff-cut-at-u-s-environmental-agency/",
    "timestamp": "2025-02-26T19:04:09Z"
  },
  {
    "title": "Durbin Defends Enforcing SCOTUS Ruling That Upheld Japanese Internment In Attempted ‘Gotcha’ For Trump Nominee",
    "description": "Dick Durbin apparently defended enforcement of the SCOTUS ruling that upheld the internment of thousands of Japanese Americans during WWII.",
    "link": "https://thefederalist.com/2025/02/26/durbin-defends-enforcing-scotus-ruling-that-upheld-japanese-internment-in-attempted-gotcha-for-trump-nominee/",
    "timestamp": "2025-02-26T19:03:04Z"
  },
  {
    "title": "Uncertainty surrounds Gaza ceasefire's future as deadline approaches",
    "description": "Sources estimate that, despite the lack of agreement and cohesion on the next steps, the ceasefire will continue, not collapse.",
    "link": "https://www.jpost.com/israel-news/article-843896",
    "timestamp": "2025-02-26T19:02:45Z"
  },
  {
    "title": "Senate Democrats Seek to Hamstring Trump on Energy Policies",
    "description": "Senate Democrats on Wednesday will attempt to limit President Donald Trump’s ability to combat the energy affordability crisis in the United States by forcing a... Read More\nThe post Senate Democrats Seek to Hamstring Trump on Energy Policies appeared first o…",
    "link": "https://www.dailysignal.com/2025/02/26/senate-democrats-attempt-to-hamstring-trump-energy-crisis/",
    "timestamp": "2025-02-26T19:01:50Z"
  },
  {
    "title": "New book on Biden by Jake Tapper and Alex Thompson reports a 'cover-up' about his decline (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nNew book on Biden by Jake Tapper and Alex Thompson reports a ‘cover-up’ about his decline  —  The day after Donald Trump won the 2024 election, CNN anchor Jake Tapper and Axios correspondent Alex Thompson decided to co-author a book about…",
    "link": "https://www.memeorandum.com/250226/p83",
    "timestamp": "2025-02-26T19:00:22Z"
  },
  {
    "title": "2:00PM Water Cooler 2/26/2025",
    "description": "~ Today's Water Cooler: Politics, syndemics; DOGE has a Palantir-friendly acting administrator; Gavin Newsome launches podcast; Problems with 737 FAA exemptions ~",
    "link": "https://www.nakedcapitalism.com/2025/02/200pm-water-cooler-2-26-2025.html",
    "timestamp": "2025-02-26T19:00:10Z"
  },
  {
    "title": "Trump Tariffs Reshape Global Metal Trade Dynamics",
    "description": "The so-called “Trump Tariffs” have shaken things up for metal traders worldwide. At least three countries in the Asia Pacific region will see significant impacts from U.S. President Donald Trump’s 25% tariff imposition on steel and aluminum.  In addition to i…",
    "link": "https://oilprice.com/Metals/Commodities/Trump-Tariffs-Reshape-Global-Metal-Trade-Dynamics.html",
    "timestamp": "2025-02-26T19:00:00Z"
  },
  {
    "title": "Trump sows confusion around global tariffs scope and timing",
    "description": "Donald Trump gave a series of contradictory answers about his plans to enact tariffs on Canada and Mexico, as well as the EU.  Read more",
    "link": "https://financialpost.com/news/trump-sows-confusion-around-global-tariffs-timing-scope",
    "timestamp": "2025-02-26T18:59:02Z"
  },
  {
    "title": "White Ribbon steps away from NRL after 'tone deaf' Trump invitation",
    "description": "Two domestic violence prevention organisations that have worked with the NRL have criticised its approaches to Donald Trump and Dana White, asking them to attend season-opening games in Las Vegas this weekend.",
    "link": "https://www.abc.net.au/news/2025-02-27/white-ribbon-nrl-las-vegas-donald-trump-dana-white/104984616",
    "timestamp": "2025-02-26T18:58:49Z"
  },
  {
    "title": "Map Shows How DOGE Cuts Could Affect Republicans' Chances in Midterms",
    "description": "More than 600,000 federal workers live in Congressional battleground districts across the country. These voters — and their families — could end up shaping the outcome of the midterms after President Donald Trump's sweeping cuts to the federal bureaucracy.\nWh…",
    "link": "https://biztoc.com/x/574de4b1ae679c5f",
    "timestamp": "2025-02-26T18:58:31Z"
  },
  {
    "title": "Emergency fundraisers offer a lifeline to groups who’ve lost foreign aid",
    "description": "Several nonprofit groups launched fundraising campaigns last week after the Trump administration’s freeze on foreign assistance.",
    "link": "https://www.bostonherald.com/2025/02/26/foreign-aid-freeze-philanthropy-fundraisers/",
    "timestamp": "2025-02-26T18:58:29Z"
  },
  {
    "title": "Trump Responds to Apple Keeping Diversity Policies",
    "description": "In an all-caps post on Truth Social today, U.S. President Donald Trump said Apple should fully end its diversity, equity, and inclusion (DEI) policies.\n\"APPLE SHOULD GET RID OF DEI RULES, NOT JUST MAKE ADJUSTMENTS TO THEM,\" he wrote.\nTrump's post comes one da…",
    "link": "https://biztoc.com/x/f19d2edc0d21a86b",
    "timestamp": "2025-02-26T18:58:18Z"
  },
  {
    "title": "Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’",
    "description": "The move was seen by some as a rightward shift.",
    "link": "https://www.bostonherald.com/2025/02/26/washington-post-columns/",
    "timestamp": "2025-02-26T18:58:02Z"
  },
  {
    "title": "Trump wants TSMC to take over Intel’s plants. That’s a terrible idea—here’s what needs to happen instead",
    "description": "Trump wants TSMC to take over Intel’s plants. That’s a terrible idea—here’s what needs to happen instead\nU.S. President Donald Trump.\nROBERTO SCHMIDT/AFP via Getty Images",
    "link": "https://biztoc.com/x/e6f2ed70cdd6bd8c",
    "timestamp": "2025-02-26T18:58:01Z"
  },
  {
    "title": "DHS quietly eliminates ban on surveillance based on sexual orientation and gender identity",
    "description": "The Department of Homeland Security has eliminated policies preventing the investigation of individuals or groups solely based on their sexual orientation or gender identity.",
    "link": "https://www.advocate.com/politics/dhs-allows-surveillance-sexual-orientation",
    "timestamp": "2025-02-26T18:56:21Z"
  },
  {
    "title": "Dozens of DOGE 'receipts' saved no money and killed contracts meant to boost efficiency",
    "description": "Take a quick look at the Department of Government Efficiency’s list of canceled contracts and you’d think the Agriculture Department spent $25 million on diversity trainings four separate times, while the Consumer Financial Protection Bureau spent $600 millio…",
    "link": "https://www.nbcnews.com/politics/doge/dozens-doge-receipts-saved-no-money-killed-contracts-meant-boost-effic-rcna193682",
    "timestamp": "2025-02-26T18:55:50Z"
  },
  {
    "title": "Australia weighs boosting foreign aid in event Trump slashes US funding",
    "description": "Australia's foreign policy priorities include our strategic position in the Pacific, expanding economic ties with South-East Asia and broadening ties with regional powers like India and Japan.",
    "link": "https://www.abc.net.au/news/2025-02-27/foreign-snapshot-aid-trump-administration/104986084",
    "timestamp": "2025-02-26T18:55:12Z"
  },
  {
    "title": "Trump froze out Project 2025 in his campaign. Now its blueprint is his health care playbook",
    "description": "Funding cuts to the NIH were presaged in Project 2025’s “Mandate for Leadership.\"",
    "link": "https://www.bostonherald.com/2025/02/26/project-2025-trump-health-care-playbook/",
    "timestamp": "2025-02-26T18:54:49Z"
  },
  {
    "title": "Map Shows How DOGE Cuts Could Affect Republicans' Chances in Midterms",
    "description": "Some 600,000 federal workers live in competitive Congressional districts across the country. Here's where the GOP could be particularly vulnerable to voter anger.",
    "link": "https://www.newsweek.com/map-doge-federal-worker-firings-affect-midterms-2036242",
    "timestamp": "2025-02-26T18:54:02Z"
  },
  {
    "title": "Did White House press secretary Karoline Leavitt take a jibe at Elon Musk with ‘five tasks’ mail? Post script message sparks speculations",
    "description": "Elon Musk's demand for federal employees' weekly task lists by February 24 faced backlash. Karoline Leavitt complied effectively, highlighting her work and subtly critiquing the directive. She reiterated her stance at a press conference, defending accountabil…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/did-white-house-press-secretary-karoline-leavitt-take-a-jibe-at-elon-musk-with-five-tasks-mail-post-script-message-sparks-speculations/articleshow/118586100.cms",
    "timestamp": "2025-02-26T18:53:21Z"
  },
  {
    "title": "DAVID BLACKMON: Can Trump Revive The Keystone Pipeline?",
    "description": "But one thing I’ve learned long ago is to never underestimate Donald Trump’s ability to get a deal done, so no one should give up hope just yet.",
    "link": "https://dailycaller.com/2025/02/26/opinion-can-trump-revive-the-keystone-pipeline-david-blackmon/",
    "timestamp": "2025-02-26T18:52:00Z"
  },
  {
    "title": "Market Rally Narrows Following Latest Trump Tariff Threat",
    "description": "5 min ago\nMarket Rally Narrows Following Latest Trump Tariff Threat\nThe stock market’s rally narrowed on Wednesday after President Donald Trump said he planned to unveil 25% tariffs on imports from Europe.\n\"We'll be announcing it very soon, and it'll be 25% g…",
    "link": "https://biztoc.com/x/aa1e623a7e147d97",
    "timestamp": "2025-02-26T18:46:56Z"
  },
  {
    "title": "What House Republicans' Budget Means for People's Taxes",
    "description": "Democrats are calling out Republicans for approving a budget that could benefit wealthy taxpayers. Here's what to know.",
    "link": "https://www.newsweek.com/taxes-impacted-house-republican-budget-cuts-2036690",
    "timestamp": "2025-02-26T18:46:47Z"
  },
  {
    "title": "MITZI PERDUE: Are Critics Of Trump’s Heated Rhetoric Against Zelensky Missing His Strategy?",
    "description": "Is it possible that Trump is playing a game that’s different from the one we’re seeing?",
    "link": "https://dailycaller.com/2025/02/26/opinion-critics-trumps-heated-rhetoric-against-zelensky-missing-strategy-mitzi-perdue/",
    "timestamp": "2025-02-26T18:46:43Z"
  },
  {
    "title": "Pennsylvania man harbored illegal immigrants in area hit by Haitian influx: Trump DOJ",
    "description": "The Department of Justice announced this week that a resident in Pennsylvania has pleaded guilty to harboring illegal immigrants in a town hit by Haitian migration.",
    "link": "https://www.foxnews.com/politics/pennsylvania-man-harbored-illegal-immigrants-area-hit-haitian-influx-trump-doj",
    "timestamp": "2025-02-26T18:45:50Z"
  },
  {
    "title": "Alabama lawmakers go on immigration law blitz as tide turns in favor of tough enforcement",
    "description": "Alabama lawmakers are considering a spate of bills in both chambers that focus on immigration reform and targeting illegal immigration.",
    "link": "https://www.foxnews.com/politics/alabama-lawmakers-go-immigration-law-blitz-tide-turns-favor-tough-enforcement",
    "timestamp": "2025-02-26T18:45:09Z"
  },
  {
    "title": "Was Medicaid Cut? Will Tips Be Taxed? What To Know About Trump's Budget Bill",
    "description": "It’s unclear how the spending cuts will be achieved as the plan does not include specifics and could be modified by the Senate.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/26/was-medicaid-cut-will-tips-be-taxed-what-to-know-about-trumps-budget-bill/",
    "timestamp": "2025-02-26T18:44:54Z"
  }
]