[
  {
    "title": "Russia to Set Out Its Position During Talks in Alaska - Lavrov",
    "description": "Russian President Vladimir Putin and US President Donald Trump will hold a meeting at Joint Base Elmendorf-Richardson on the northern outskirts of Anchorage in Alaska on Friday, marking the first face-to-face meeting since Trump’s reelection and their last su…",
    "link": "https://sputnikglobe.com/20250815/russia-to-set-out-its-position-during-talks-in-alaska---lavrov-1122614711.html",
    "timestamp": "2025-08-15T05:31:15Z"
  },
  {
    "title": "Ghosts of Russian imperialism haunt Alaska summit",
    "description": "From the onion domes of the Orthodox churches to the local penchant for potato dumplings, resonances of Russia's imperial past are not hard to find, writes Yvonne Murray from Anchorage in Alaska.",
    "link": "https://www.rte.ie/news/world/2025/0815/1528561-trump-putin-summit/",
    "timestamp": "2025-08-15T05:30:00Z"
  },
  {
    "title": "Ghosts of Russian imperialism haunt Alaska summit",
    "description": "From the onion domes of the Orthodox churches to the local penchant for potato dumplings, resonances of Russia's imperial past are not hard to find, writes Yvonne Murray from Anchorage in Alaska.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0815/1528561-trump-putin-summit/",
    "timestamp": "2025-08-15T05:30:00Z"
  },
  {
    "title": "NFL Cannot Force Black Coach’s Racial Claims Into Arbitration, Says Appeals Court",
    "description": "The National Football League cannot force Minnesota Vikings defensive coordinator Brian Flores’ racial bias claims into an arbitration controlled by the league, a federal appeals court ruled on Thursday. In a 3-0 decision, the 2nd U.S. Circuit Court of Appeal…",
    "link": "https://www.insurancejournal.com/news/national/2025/08/15/835868.htm",
    "timestamp": "2025-08-15T05:28:22Z"
  },
  {
    "title": "Trump says stakes 'high' ahead of summit with Putin",
    "description": "US President Donald Trump is headed to Alaska for what he has called a \"high stakes\" summit with Russia's Vladimir Putin to discuss a ceasefire deal for Ukraine to help end the deadliest war in Europe since World War Two.",
    "link": "https://www.rte.ie/news/ukraine/2025/0815/1528571-trump-putin/",
    "timestamp": "2025-08-15T05:21:58Z"
  },
  {
    "title": "Trump, Putin to spar over Ukraine peace at Alaska summit",
    "description": "Donald Trump and Vladimir Putin will hold talks in Alaska later today, with the US president's hopes of sealing a ceasefire agreement on Ukraine uncertain but with a last gasp offer from Mr Putin of a possible nuclear deal that could help both men save face.",
    "link": "https://www.rte.ie/news/world/2025/0815/1528571-trump-putin/",
    "timestamp": "2025-08-15T05:21:58Z"
  },
  {
    "title": "Trump and Putin in Alaska: How a strange relationship took shape",
    "description": "Donald Trump and Vladimir Putin's complex relationship takes center stage as they meet in Alaska to discuss the Ukraine war, a location hinting at Putin's strategic appeal to Trump's real-estate interests. Their history includes controversial summits, cancele…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-and-putin-in-alaska-how-a-strange-relationship-took-shape/articleshow/123317503.cms",
    "timestamp": "2025-08-15T05:21:02Z"
  },
  {
    "title": "Russia expects Trump visit after Alaska summit",
    "description": "Russia anticipates a visit from US President Donald Trump following his summit with Russian President Vladimir Putin in Alaska later today, the Russian Foreign Ministry's Ambassador-at-Large for the C...",
    "link": "https://biztoc.com/x/268bba842020350f",
    "timestamp": "2025-08-15T05:20:57Z"
  },
  {
    "title": "Asian shares mostly gain after uptick in inflation pulls US stocks lower",
    "description": "MANILA, Philippines (AP) — Asian are mostly higher after most stocks on Wall Street fell following a disappointing report that said inflation was worse last month at the U.S. wholesale level than economists had expected. U.S. futures rose while oil prices sli…",
    "link": "https://financialpost.com/pmn/asian-shares-mostly-gain-after-uptick-in-inflation-pulls-us-stocks-lower",
    "timestamp": "2025-08-15T05:20:39Z"
  },
  {
    "title": "California pushes left, Texas right, with US House control and Trump agenda in play",
    "description": "A political standoff in Texas over new U.S. House maps aimed at adding five Republican seats is poised to enter a new phase",
    "link": "https://abcnews.go.com/Politics/wireStory/california-pushes-left-texas-us-house-control-trump-124668621",
    "timestamp": "2025-08-15T05:17:43Z"
  },
  {
    "title": "What Ukrainians want from Trump and Putin’s meeting",
    "description": "As US President Donald Trump and Russia's Vladimir Putin get ready to meet in Alaska, there has been lots of talk about what ...",
    "link": "https://biztoc.com/x/61dd67c2d8d4b74d",
    "timestamp": "2025-08-15T05:15:10Z"
  },
  {
    "title": "Why a landmark ruling from the world’s top court puts financial markets on notice",
    "description": "The International Court of Justice recently delivered its first-ever advisory opinion on the obligations of states in respect of climate change.",
    "link": "https://www.cnbc.com/2025/08/15/climate-why-a-landmark-icj-ruling-puts-financial-markets-on-notice.html",
    "timestamp": "2025-08-15T05:11:29Z"
  },
  {
    "title": "Everyone is to blame for Ukraine conflict – Trump",
    "description": "The Ukraine conflict should have never happened, and all the parties involved did “everything” wrong, the US president says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622907-ukraine-conflcit-blame-everyone/",
    "timestamp": "2025-08-15T05:11:26Z"
  },
  {
    "title": "Trump's 'safe and beautiful' move against DC homeless camps looks like ugliness to those targeted",
    "description": "Under President Trump's \"Making D.C. Safe and Beautiful Task Force,\" authorities are clearing homeless encampments in Washington, D.C., using National Guard troops and local police. The effort has displaced many, including Ms. Jay and Andrew S., who feel targ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-safe-and-beautiful-move-against-dc-homeless-camps-looks-like-ugliness-to-those-targeted/articleshow/123317397.cms",
    "timestamp": "2025-08-15T05:10:27Z"
  },
  {
    "title": "Blackwater founder to deploy nearly 200 personnel to Haiti as gang violence soars",
    "description": "The deployment is meant to help the government of Haiti recover vast swaths of territory seized in the past year and now controlled by heavily armed gangs.",
    "link": "https://www.npr.org/2025/08/15/nx-s1-5503316/blackwater-erik-prince-haiti-gang-violence",
    "timestamp": "2025-08-15T05:10:20Z"
  },
  {
    "title": "Watch: Long line of historic US-Russia summits",
    "description": "When US President Donald Trump meets his Russian counterpart Vladimir Putin in Alaska it will be the latest in a long line of historic summits between leaders of two major world powers.",
    "link": "https://www.rte.ie/news/2025/0815/1528533-historic-us-russia-summits/",
    "timestamp": "2025-08-15T05:08:59Z"
  },
  {
    "title": "Live updates: Trump to meet Putin in Alaska to discuss Russia-Ukraine war | CNN Politics",
    "description": "US President Donald Trump and Russian President Vladimir Putin are set to meet in Alaska today to discuss Russia’s war in Ukraine. Follow here for the latest.",
    "link": "https://www.cnn.com/politics/live-news/trump-putin-meeting-news-08-15-25",
    "timestamp": "2025-08-15T05:03:03Z"
  },
  {
    "title": "China's economy lags in July under pressure from tariffs and a weak property market",
    "description": "China has reported its economy showed signs of slowing in July as factory output and retail sales slowed while housing prices fell further",
    "link": "https://abcnews.go.com/Business/wireStory/chinas-economy-lags-july-pressure-tariffs-weak-property-124668804",
    "timestamp": "2025-08-15T05:02:30Z"
  },
  {
    "title": "South Korea’s president vows to restore 2018 inter-Korean military agreement to ease tensions",
    "description": "South Korea’s new liberal president, Lee Jae Myung, says he will seek to restore a 2018 military agreement with North Korea aimed at reducing border tensions and urged Pyongyang to respond to Seoul’s efforts to rebuild trust and revive dialogue",
    "link": "https://abcnews.go.com/International/wireStory/south-koreas-president-vows-restore-2018-inter-korean-124667584",
    "timestamp": "2025-08-15T05:02:18Z"
  },
  {
    "title": "We cannot police the streets if online material is not regulated",
    "description": "Racism in this State goes back a bit, but vile discourse online is new and most of it comes from abroad – principally the US and UK",
    "link": "https://www.irishtimes.com/opinion/2025/08/15/we-cannot-police-the-streets-if-online-material-is-not-regulated/",
    "timestamp": "2025-08-15T05:00:01Z"
  },
  {
    "title": "Ireland set to feel the heat from Washington’s Maga brigade over Occupied Territories Bill",
    "description": "Trump’s shock troops need to have the proposed legislation explained because, it seems, they have not read it",
    "link": "https://www.irishtimes.com/opinion/2025/08/15/ireland-set-to-feel-the-heat-from-washingtons-maga-brigade-over-occupied-territories-bill/",
    "timestamp": "2025-08-15T05:00:01Z"
  },
  {
    "title": "PM Modi Vows to Protect Farmers Amid India-US Trade Tensions",
    "description": "HT DIGITAL NEW DELHI, AUGUST 15: On the 79th Independence Day, in his address to the nation from the Red Fort, Prime Minister Narendra Modi reiterated his unflinching commitment to the nation’s farmers. He asserted that he is “standing tall like a wall agains…",
    "link": "https://thehillstimes.in/national/pm-modi-vows-to-protect-farmers-amid-india-us-trade-tensions",
    "timestamp": "2025-08-15T04:59:19Z"
  },
  {
    "title": "Khamzat Chimaev Loudly Cheered In Chicago In First U.S. Fight In Nearly Three Years",
    "description": "Fans love Khamzat Chimaev in the United States. For nearly three years, Chimaev has been reportedly unable to fight in the US due to his friendly relationship with Chechen warlord Ramzan Kadyrov, who has been accused of war crimes and human rights violations.…",
    "link": "https://brobible.com/sports/article/khamzat-chimaev-ufc-319-chicago/",
    "timestamp": "2025-08-15T04:58:59Z"
  },
  {
    "title": "Trump and Putin to spar over Ukraine peace and arms control at Alaska summit",
    "description": "Donald Trump and Vladimir Putin met in Alaska to discuss a potential ceasefire in Ukraine, with Trump aiming for a peace deal to boost his global peacemaker image. Putin offered a possible nuclear arms control agreement, seeking relief from Western sanctions.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-and-putin-to-spar-over-ukraine-peace-and-arms-control-at-alaska-summit/articleshow/123317305.cms",
    "timestamp": "2025-08-15T04:58:52Z"
  },
  {
    "title": "Only Trump knows what's next...: Ex-NSA Pankaj Saran says India-US strain part of global disruption",
    "description": "Pankaj Saran suggests India-US relations are facing turbulence under President Trump, mirroring broader global disruptions. He highlights Trump's unpredictability and the need for India to adopt a measured policy response, acknowledging the power imbalance. S…",
    "link": "https://economictimes.indiatimes.com/news/india/only-trump-knows-whats-next-ex-nsa-pankaj-saran-says-india-us-strain-part-of-global-disruption/articleshow/123317303.cms",
    "timestamp": "2025-08-15T04:58:34Z"
  },
  {
    "title": "NYT Laments Troops Will Not Defy Trump’s D.C. Guard Orders: ‘Military Will Not Rescue Americans’",
    "description": "Two former Obama administration officials argue that President Donald Trump’s deployment of 800 National Guard troops to Washington shows the U.S. military will follow lawful orders rather than resist their commander-in-chief, writing, “it now seems clear to …",
    "link": "https://www.breitbart.com/politics/2025/08/14/nyt-laments-troops-wont-defy-trumps-dc-guard-orders-military-not-rescue-americans/",
    "timestamp": "2025-08-15T04:54:55Z"
  },
  {
    "title": "China's economy lags in July under pressure from tariffs and a weak property market",
    "description": "China has reported its economy showed signs of slowing in July as factory output and retail sales slowed while housing prices fell further. Monthly data released Friday showed retail sales rose 3.7% year-on-year, down from 4.8% in June. Investments in factory…",
    "link": "https://www.seattlepi.com/news/world/article/china-s-economy-lags-in-july-under-pressure-from-20818614.php",
    "timestamp": "2025-08-15T04:53:02Z"
  },
  {
    "title": "'Kimmel' Guest Host Nicole Byer Shares Exactly Why Americans Have Government 'Trust Issues'",
    "description": "The comedian used one survey's \"totally unsurprising\" findings to take aim at the president.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-nicole-byer-trump-government-trust-issues_n_689eac5ae4b0ef392c21eba3",
    "timestamp": "2025-08-15T04:49:12Z"
  },
  {
    "title": "Trump Revokes Biden’s Competition Executive Order",
    "description": "Donald Trump just scrapped President Biden’s 2021 “Executive Order on Promoting Competition in the American Economy.”\nThat’s good news. In a column that summer of four years ago (“How Biden’s Executive Order On Promoting Competition Instead Consolidates Gover…",
    "link": "https://biztoc.com/x/01af4ecb94d9c7ab",
    "timestamp": "2025-08-15T04:47:46Z"
  },
  {
    "title": "Alaska Summit: Trump has the tools to persuade Putin on Ukraine; one of them may involve India",
    "description": "Amidst lowered expectations, President Trump meets Putin in Alaska, facing pressure to address the Ukraine conflict. Despite past actions that weakened Ukrainian support, Trump possesses leverage, including potential secondary sanctions on Russian oil buyers …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/alaska-summit-trump-has-the-tools-to-persuade-putin-on-ukraine-one-of-them-may-involve-india/articleshow/123317151.cms",
    "timestamp": "2025-08-15T04:46:22Z"
  },
  {
    "title": "Trump's 'safe and beautiful' move against DC homeless camps looks like ugliness to those targeted",
    "description": "Ms. Jay didn't wait for the authorities to come before packing her tent and carrying what belongings she could across Pennsylvania Avenue on her way to...",
    "link": "https://www.yahoo.com/news/articles/trumps-safe-beautiful-move-against-044326446.html",
    "timestamp": "2025-08-15T04:43:26Z"
  },
  {
    "title": "Intel shares jump after report of possible US stake in chipmaker",
    "description": "Experts suggest the reported deal could give the US an edge in the chipmaking sector.",
    "link": "https://www.bbc.com/news/articles/cpv01pl208lo",
    "timestamp": "2025-08-15T04:40:12Z"
  },
  {
    "title": "China’s economy lags in July under pressure from tariffs and a weak property market",
    "description": "BANGKOK (AP) — China’s economy showed signs of slowing in July as factory output and retail sales slowed and housing prices dropped further, according to data released Friday. Uncertainty over tariffs on exports to the United States is still looming over the …",
    "link": "https://financialpost.com/pmn/chinas-economy-lags-in-july-under-pressure-from-tariffs-and-a-weak-property-market",
    "timestamp": "2025-08-15T04:37:42Z"
  },
  {
    "title": "Crypto group backed by Trump sons hunts for bitcoin companies in Asia",
    "description": "Donald Trump Jr and Eric Trump look to make inroads in region with enthusiasm for digital assets",
    "link": "https://biztoc.com/x/5908e0528c878aa8",
    "timestamp": "2025-08-15T04:37:01Z"
  },
  {
    "title": "Fla. flier caught trying to smuggle turtles in her bra: ‘Stop hiding animals in weird places!’",
    "description": "A Florida traveler was caught trying to smuggle two turtles through airport security by hiding them in her bra — prompting authorities to beg fliers not to stash things in “weird places.” The woman, who was not identified, was stopped at a Miami International…",
    "link": "https://freerepublic.com/focus/f-backroom/4334701/posts",
    "timestamp": "2025-08-15T04:35:47Z"
  },
  {
    "title": "Israeli minister Bezalel Smotrich reveals plans to ‘bury’ any hope of Palestinian state",
    "description": "Israel’s far-right finance minister ­Bezalel Smotrich has announced that work will start on a long-delayed settlement that would divide the West Bank and cut it off from East Jerusalem, a move his office said would “bury” the idea of a Palestinian state.",
    "link": "https://www.independent.ie/world-news/middle-east/israeli-minister-bezalel-smotrich-reveals-plans-to-bury-any-hope-of-palestinian-state/a1797057897.html",
    "timestamp": "2025-08-15T04:30:00Z"
  },
  {
    "title": "Steve Holland: Which version of Donald Trump will show up to negotiations with Vladimir Putin?",
    "description": "When US president Donald Trump and Russian president Vladimir Putin met in Helsinki in 2018, the pair alarmed allies with a friendly encounter where Trump sided with the Russian leader over his own intelligence agencies on election interference.",
    "link": "https://www.independent.ie/world-news/steve-holland-which-version-of-donald-trump-will-show-up-to-negotiations-with-vladimir-putin/a1974247472.html",
    "timestamp": "2025-08-15T04:30:00Z"
  },
  {
    "title": "‘Now is the time to go on the offensive’ – Swatch boss calls for Swiss levy on gold exports to the US",
    "description": "Switzerland’s gold industry has expressed scepticism about a proposal by the boss of watchmaker Swatch to introduce a levy on gold exports to the United States in retaliation for US president Donald Trump’s tariffs.",
    "link": "https://www.independent.ie/business/world/now-is-the-time-to-go-on-the-offensive-swatch-boss-calls-for-swiss-levy-on-gold-exports-to-the-us/a1423101615.html",
    "timestamp": "2025-08-15T04:30:00Z"
  },
  {
    "title": "Letters: Paschal Donohoe’s optimism out of place with the grim reality many in our country face",
    "description": "One has to admire the sunny disposition of Paschal Donohoe, who says the key to our success in the future will be dependent on increases in productivity (‘The resilience of Irish enterprise and our workforce will see us through hard times’, Irish Independent,…",
    "link": "https://www.independent.ie/opinion/letters/letters-paschal-donohoes-optimism-out-of-place-with-the-grim-reality-many-in-our-country-face/a1404231040.html",
    "timestamp": "2025-08-15T04:30:00Z"
  },
  {
    "title": "Tom Cruise turns down Trump’s invite for Kennedy Center Honor: report",
    "description": "Cruise reportedly declined the offer due to scheduling conflicts",
    "link": "https://www.the-independent.com/news/world/americas/tom-cruise-trump-kennedy-center-honors-b2808148.html",
    "timestamp": "2025-08-15T04:28:18Z"
  },
  {
    "title": "Live updates: Trump meets Putin in Alaska for Ukraine talks",
    "description": "\"We didn't get there,\" the US president says in a statement to the press after an almost three-hour meeting with Putin in Alaska.",
    "link": "https://www.bbc.com/news/live/c2kzn1nw1d4t",
    "timestamp": "2025-08-15T04:28:07Z"
  },
  {
    "title": "David Bailey’s Nakamoto closes KindlyMD merger for Bitcoin treasury",
    "description": "David Bailey’s Nakamoto and healthcare firm KindlyMD have closed their merger, officially establishing a Bitcoin treasury firm with the goal of accumulating 1 million BTC.",
    "link": "https://cointelegraph.com/news/nakamoto-kindlymd-close-merger-start-bitcoin-treasury",
    "timestamp": "2025-08-15T04:27:38Z"
  },
  {
    "title": "IOC buys 2 million barrels of US WTI crude for October, sources say",
    "description": "Sources said that the OMC purchased cargoes from Mercuria at a premium of $2.80-2.90 a barrel.",
    "link": "https://www.thehindubusinessline.com/companies/ioc-buys-2-million-barrels-of-us-wti-crude-for-october-sources-say/article69935789.ece",
    "timestamp": "2025-08-15T04:20:25Z"
  },
  {
    "title": "Indian Oil Corp buys 2 million barrels of US WTI crude for October: report",
    "description": "Indian Oil Corp (IOC) has purchased two million barrels of U.S. West Texas Intermediate crude for October delivery from Mercuria. The purchase occurred at a premium of $2.80-2.90 a barrel to dated Brent. This move comes as U.S. President Donald Trump increase…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/indian-oil-corp-buys-2-million-barrels-of-us-wti-crude-for-october-report/articleshow/123316827.cms",
    "timestamp": "2025-08-15T04:19:58Z"
  },
  {
    "title": "Japan's economy grows at 1% pace in the last quarter despite Trump's higher tariffs",
    "description": "Japan's economy exceeded expectations with a 1% annual growth rate in the last quarter, driven by robust exports despite US tariffs. A temporary tariff pause spurred export activity, while increased tourism also contributed. However, weak consumer spending pe…",
    "link": "https://economictimes.indiatimes.com/news/international/business/japans-economy-grows-at-1-pace-in-the-last-quarter-despite-trumps-higher-tariffs/articleshow/123316825.cms",
    "timestamp": "2025-08-15T04:19:47Z"
  },
  {
    "title": "Final arguments in Jimmy Lai's national security trial in Hong Kong delayed over health concerns",
    "description": "The final arguments in prominent Hong Kong activist Jimmy Lai’s national security trial were postponed Friday after his lawyer said the former pro-democracy ...",
    "link": "https://www.yahoo.com/news/articles/final-arguments-jimmy-lais-national-041942737.html",
    "timestamp": "2025-08-15T04:19:42Z"
  },
  {
    "title": "Modi Tilts Toward Beijing as Trump’s Tariffs Bite",
    "description": "Flights and Fertilizer Signal After U.S. President Donald Trump imposed a 50% tariff on Indian goods, widely seen as retaliation for discounted Russian oil purchases, Prime Minister Narendra Modi is quietly revisiting his China strategy. Sources say direct fl…",
    "link": "https://english.gossiplankanews.com/2025/08/modi-tilts-toward-beijing-as-trumps.html",
    "timestamp": "2025-08-15T04:16:00Z"
  },
  {
    "title": "Under the Sea: China’s Digital Silk Road and the Middle East",
    "description": "London (Special to Informed Comment; Feature) - China-US geopolitical rivalries have manifested in many arenas from esoteric ones like export controls over semiconductor chips, to high profile trade wars and confrontations over Taiwan. The outcome of the two …",
    "link": "https://www.juancole.com/2025/08/chinas-infrastructure-middle.html",
    "timestamp": "2025-08-15T04:15:44Z"
  },
  {
    "title": "Indian PM Modi vows to protect farmers, pushes self-reliance amid Trump tariff tensions",
    "description": "NEW DELHI :Indian Prime Minister Narendra Modi urged the country on Friday to move towards more self-reliance, manufacture everything from fertilisers to jet engines and EV batteries, and vowed to protect farmers in the face of a trade conflict with Washingto…",
    "link": "https://www.channelnewsasia.com/business/indian-pm-modi-vows-protect-farmers-pushes-self-reliance-amid-trump-tariff-tensions-5295986",
    "timestamp": "2025-08-15T04:15:20Z"
  },
  {
    "title": "Trump and Putin to spar Ukraine peace and arms control at Alaska summit",
    "description": "MOSCOW (Reuters) -Donald Trump and Vladimir Putin hold talks in Alaska on Friday, with the U.S. president's hopes of sealing a ceasefire agreement on Ukraine uncertain but with a last gasp offer from Putin of a possible nuclear deal that could help both men s…",
    "link": "https://www.thestar.com.my/news/world/2025/08/15/trump-and-putin-to-spar-ukraine-peace-and-arms-control-at-alaska-summit",
    "timestamp": "2025-08-15T04:10:00Z"
  },
  {
    "title": "New Israel-Iran War Looms*Israel, US Cozying Up To Iran's Neighbors For Regime Change*Renewed War Disrupts Netanyahu Corruption Trial*Russia, Turkey, Qatar, Epstein Files*",
    "description": "\"Israel is likely to launch another war with Iran before December--perhaps even as early as late August\" Trita Parsi-\"Foreign Policy' Commentary 8/11/2025... \"So here is the great news. The moment your country is free Israel's top water experts will flood int…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334698/posts",
    "timestamp": "2025-08-15T04:09:05Z"
  },
  {
    "title": "No Country is an Island: Trump’s Destruct of Global Heath will Bite us on the Posterior",
    "description": "By William deBuys ( Tomdispatch.com ) - The totalitarian playbook that Donald Trump seems to follow lacks a chapter. Power-crazed the president may be, but he fails to grasp soft power. Wise military and diplomatic minds understand it well. George C. Marshall…",
    "link": "https://www.juancole.com/2025/08/country-destruct-posterior.html",
    "timestamp": "2025-08-15T04:04:25Z"
  },
  {
    "title": "Confessions of an agency exec on using AI in global campaigns despite regulation",
    "description": "While most AI companies have headquarters in Silicon Valley, U.S. federal lawmakers have not yet broached regulating the sector. President Donald Trump has even gone so far as to encourage the tech’s development and removal of federal regulations that could h…",
    "link": "https://biztoc.com/x/20a53ef5231fd44c",
    "timestamp": "2025-08-15T04:03:18Z"
  },
  {
    "title": "Trump and Putin to spar Ukraine peace and arms control at Alaska summit",
    "description": "MOSCOW (Reuters) -Donald Trump and Vladimir Putin hold talks in Alaska on Friday, with the U.S. president's hopes of sealing a ceasefire agreement on Ukraine...",
    "link": "https://ca.news.yahoo.com/trump-putin-spar-ukraine-peace-040138502.html",
    "timestamp": "2025-08-15T04:01:38Z"
  },
  {
    "title": "Confessions of an agency exec on using AI in global campaigns despite regulation",
    "description": "A global agency's AI lead walks through the complex decision making process around AI in marketing strategy.",
    "link": "http://digiday.com/marketing/confessions-of-an-agency-exec-advising-clients-on-using-ai-in-global-campaigns-despite-its-inconsistent-regulation/",
    "timestamp": "2025-08-15T04:01:00Z"
  },
  {
    "title": "Melania Trump threatens to sue Hunter Biden for $1bn",
    "description": "The ex-US president’s son has claimed she had been introduced to Donald Trump by late sex trafficker Jeffrey Epstein Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622905-melania-trump-hunter-biden/",
    "timestamp": "2025-08-15T04:00:48Z"
  },
  {
    "title": "Lie another day: Clapper’s six-line marching orders that shaped Russiagate",
    "description": "“That’s OUR story, and we’re stickin’ to it.” \r\n\r\nIt sounds like a line from a cornered suspect—whose name has been changed to protect the (not so) innocent—in Dragnet. Or rather, a Three Stooges short. ...",
    "link": "https://www.americanthinker.com/blog/2025/08/lie_another_day_clapper_s_six_line_marching_orders_that_shaped_russiagate.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Trump’s the Hero Hollywood Needs",
    "description": "It’s no secret that Hollywood and the Democrat Party are joined at the hip.  Television shows and movies regularly promote leftwing messages, and whenever a project embraces even a minimally conservative worldview, commentators blast ...",
    "link": "https://www.americanthinker.com/blog/2025/08/trump_s_the_hero_hollywood_needs.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Alex Padilla bawls into the cameras with phony claim that Trump is cutting Social Security",
    "description": "It's one thing to bawl into the camera about budget cuts that are happening.\r\n\r\nBut Sen. Alex Padilla likes to get all lugubrious about cuts that aren't happening.\r\n\r\nHe's a pawn of whichever Mighty Integral is running the Democrats,...",
    "link": "https://www.americanthinker.com/blog/2025/08/alex_padilla_bawls_into_the_cameras_with_phony_claim_that_trump_is_cutting_social_security.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Trump’s Alaska Summit: Paving the Way for Ukrainian Peace and Democratic Revival",
    "description": "As tensions in Eastern Europe continue to simmer, all eyes are on the high-stakes summit scheduled for August 15 in Alaska, where U.S. President Donald Trump will meet Russian President Vladimir Putin to negotiate a potential end to the ongoing war i...",
    "link": "https://www.americanthinker.com/articles/2025/08/trump_s_alaska_summit_paving_the_way_for_ukrainian_peace_and_democratic_revival.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Murder in D.C.: There’s a New Sheriff in Town",
    "description": "Knowing people who have young adults in their family who previously received invitations to work as interns at the White House, when 21-year-old intern Eric Tarpinian-Jachym was murdered on June 30, it was alarming.  The crime happened just a mi...",
    "link": "https://www.americanthinker.com/articles/2025/08/murder_in_d_c_there_s_a_new_sheriff_in_town.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Trump is quarterbacking the Redskins’ comeback",
    "description": "Time to rename “Hail to the Redskins.”\r\n\r\nBetter: “Hail to Trump’s Redskins.”\r\n\r\nEither way, it’s still HTTR for old D.C. fans, who sing that fight song with fervor for the Redskins. And that team name co...",
    "link": "https://www.americanthinker.com/blog/2025/08/trump_is_quarterbacking_the_redskins_comeback.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Donald Trump’s ‘Rube Goldbergian’ comeback in 2024",
    "description": "Perhaps amidst these wild political and cultural times, we can spare a moment to “have some fun just for the fun of it.” Let’s take a rather off-beat look at the events surrounding the 2020 presidential election, which eventually sp...",
    "link": "https://www.americanthinker.com/blog/2025/08/donald_trump_s_rube_goldbergian_comeback_in_2024.html",
    "timestamp": "2025-08-15T04:00:00Z"
  },
  {
    "title": "Crunch time in Alaska: Trump set to meet Putin in push for Ukraine peace",
    "description": "Donald Trump will host Vladimir Putin in Alaska - their first meeting in six years - as he tries to secure a Ukraine war ceasefire.",
    "link": "https://www.bbc.com/news/articles/c9qy1neql8lo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-15T03:56:20Z"
  },
  {
    "title": "Putin-Trump summit: What each side wants",
    "description": "Expectations are high for the first summit between sitting US and Russian presidents in more than four years, but Russia and Ukraine remain far apart in their visions on how to end the conflict.",
    "link": "https://www.channelnewsasia.com/world/putin-trump-summit-alaska-what-each-side-wants-ukraine-europe-5295936",
    "timestamp": "2025-08-15T03:53:00Z"
  },
  {
    "title": "Tariffs on India over Russian oil prompted Moscow to seek talks with US: Trump",
    "description": "\"I think everything has an impact,\" and claimed that when he told India that \"we're going to charge you, because you're dealing with Russia and oil purchases, it essentially took them out of buying oil from Russia\"",
    "link": "https://www.thehindubusinessline.com/news/world/tariffs-on-india-over-russian-oil-prompted-moscow-to-seek-talks-with-us-trump/article69935744.ece",
    "timestamp": "2025-08-15T03:52:32Z"
  },
  {
    "title": "Former ABC Reporter Terry Moran Says Trump is ‘An Alpha Male In Every Room’ He Enters — ‘Until Vladimir Putin is There’",
    "description": "\"There's something about Trump and Putin,\" said Terry Moran on CNN. \"There's no question that he has trouble with this guy.\"\nThe post Former ABC Reporter Terry Moran Says Trump is ‘An Alpha Male In Every Room’ He Enters — ‘Until Vladimir Putin is There’ first…",
    "link": "https://www.mediaite.com/media/tv/former-abc-reporter-terry-moran-says-trump-is-an-alpha-male-in-every-room-he-enters-until-vladimir-putin-is-there/",
    "timestamp": "2025-08-15T03:50:55Z"
  },
  {
    "title": "EU leaders want to overthrow three European governments – Budapest",
    "description": "Brussels is pushing for regime change in Hungary, Serbia, and Slovakia due to their pro-peace stance, Peter Szijjarto has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622906-eu-leaders-want-to-overthrow-three-european-governments/",
    "timestamp": "2025-08-15T03:47:13Z"
  },
  {
    "title": "Hegseth Supports Women's Right To Vote, Pentagon Says, Despite His Having Reposted Video",
    "description": "In the reposted video, Pastor Jared Longshore, with the Christ Church, says he would support repealing the Constitution's 19th amendment which in 1920 granted women the right to vote.",
    "link": "https://www.huffpost.com/entry/hegseth-supports-womens-vote-pentagon_n_689eacaee4b0df16e32c0673",
    "timestamp": "2025-08-15T03:46:34Z"
  },
  {
    "title": "'Putin is a master of persuasion' - BBC reporters discuss summit strategy",
    "description": "The BBC’s US and Russia correspondents outline the leaders' different approaches to the high stakes summit on the Ukraine war.",
    "link": "https://www.bbc.com/news/videos/c6205ezp6nlo",
    "timestamp": "2025-08-15T03:35:15Z"
  },
  {
    "title": "Asian stocks trade mixed ahead of US-Russia summit",
    "description": "Asian stocks were mixed Friday after better-than-expected Japanese growth and weak Chinese data, while oil slipped back ahead of a US-Russia summit on Ukraine.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-trade-mixed-ahead-of-us-russia-summit/articleshow/123316280.cms",
    "timestamp": "2025-08-15T03:33:20Z"
  },
  {
    "title": "Alaska's quiet is pierced with a cacophony of questions over Trump-Putin summit",
    "description": "On the Alaska governor's desk, the horned skull of a musk ox, an ice age relic, is proudly displayed, resting on a collage of pictures of the state.",
    "link": "https://news.sky.com/story/alaskas-quiet-is-pierced-with-a-cacophony-of-questions-over-trump-putin-summit-13411944",
    "timestamp": "2025-08-15T03:31:00Z"
  },
  {
    "title": "Dana White has 'trust' in Conor McGregor for UFC White House",
    "description": "As far as Dana White is concerned, Conor McGregor has a better chance at competing at UFC White House than Jon Jones.",
    "link": "https://www.sportingnews.com/us/mma/news/dana-white-has-trust-conor-mcgregor-ufc-white-house/ed1fe10a3e25d1149ebb8d92",
    "timestamp": "2025-08-15T03:30:25Z"
  },
  {
    "title": "Who Is Terry Cole? Pam Bondi Names DC 'Emergency Police Commissioner'",
    "description": "President Donald Trump announced earlier this week the decision to federalize Washington, D.C., as he cited crime and violence.",
    "link": "https://biztoc.com/x/4ad45438236260cc",
    "timestamp": "2025-08-15T03:29:41Z"
  },
  {
    "title": "Putin-Trump Summit: What Each Side Wants",
    "description": "The US and Russian presidents Donald Trump and Vladimir Putin are to meet at a US air base in Alaska on Friday for talks on the Ukraine war.",
    "link": "https://www.ibtimes.com.au/putin-trump-summit-what-each-side-wants-1860128",
    "timestamp": "2025-08-15T03:27:15Z"
  },
  {
    "title": "800 National Guard personnel mobilized for DC mission: Pentagon",
    "description": "All 800 National Guard troops who were ordered to the US capital Washington to aid law enforcement personnel by President Donald Trump have now been...",
    "link": "https://www.yahoo.com/news/articles/800-national-guard-personnel-mobilized-211651604.html",
    "timestamp": "2025-08-15T03:27:13Z"
  },
  {
    "title": "Putin-Trump Summit: What Each Side Wants",
    "description": "The US and Russian presidents Donald Trump and Vladimir Putin are to meet at a US air base in Alaska on Friday for talks on the Ukraine war.",
    "link": "https://www.ibtimes.com/putin-trump-summit-what-each-side-wants-3780953",
    "timestamp": "2025-08-15T03:27:12Z"
  },
  {
    "title": "Who Is Terry Cole? Pam Bondi Names DC 'Emergency Police Commissioner'",
    "description": "President Donald Trump announced earlier this week the decision to federalize Washington, D.C., as he cited crime and violence.",
    "link": "https://www.newsweek.com/who-terry-cole-pam-bondi-names-dc-emergency-police-commissioner-2113825",
    "timestamp": "2025-08-15T03:22:04Z"
  },
  {
    "title": "Asia Stocks Mixed Before US-Russia Summit",
    "description": "Asian stocks were mixed Friday after better-than-expected Japanese growth and weak Chinese data, while oil slipped back ahead of a US-Russia summit on Ukraine.",
    "link": "https://www.ibtimes.com/asia-stocks-mixed-before-us-russia-summit-3780950",
    "timestamp": "2025-08-15T03:21:14Z"
  },
  {
    "title": "Lavrov, Ambassador to US Darchiev Arrived in Alaska",
    "description": "Russian Foreign Minister Sergey Lavrov and Ambassador to the United States Alexander Darchiev have arrived in Alaska, where the Russian-American summit will be held, Sputnik correspondent reported.",
    "link": "https://sputnikglobe.com/20250815/lavrov-ambassador-to-us-darchiev-arrived-in-alaska-1122614091.html",
    "timestamp": "2025-08-15T03:19:00Z"
  },
  {
    "title": "Trump administration claims powers of D.C. police chief",
    "description": "Attorney General Pam Bondi said in a directive issued Thursday evening that DEA boss Terry Cole will assume \"powers and duties vested in the District of Columbia Chief of Police.\"",
    "link": "https://www.npr.org/2025/08/14/nx-s1-5502883/trump-bondi-dc-police-chief",
    "timestamp": "2025-08-15T03:18:50Z"
  },
  {
    "title": "NFL will continue featuring social justice messages including 'End Racism' in end zones",
    "description": "The NFL has painted social justice messages such as \"Choose Love\" and \"Stop Hate\" since 2020.",
    "link": "https://sports.yahoo.com/nfl/article/nfl-will-continue-featuring-social-justice-messages-including-end-racism-in-end-zones-031820620.html",
    "timestamp": "2025-08-15T03:18:20Z"
  },
  {
    "title": "Why Tom Cruise Turned Down Trump's Invite to Receive a Kennedy Center Honor",
    "description": "Tom Cruise was reportedly considered for a Kennedy Center Honor under the Trump administration, but he turned down the invite. President Donald Trump announced this week that he will be hosting the annual Kennedy Center Honors special and he also says he was …",
    "link": "https://www.justjared.com/2025/08/14/why-tom-cruise-turned-down-trumps-invite-to-receive-a-kennedy-center-honor/",
    "timestamp": "2025-08-15T03:17:51Z"
  },
  {
    "title": "Trump promises to ‘save’ jailed Hong Kong media tycoon Jimmy Lai",
    "description": "Closing arguments are due to begin in the national security trial of Jimmy Lai, 77, a critic of China's Communist Party.",
    "link": "https://www.aljazeera.com/news/2025/8/15/trump-promises-to-save-jailed-hong-kong-media-tycoon-jimmy-lai",
    "timestamp": "2025-08-15T03:15:39Z"
  },
  {
    "title": "Crypto, fintech execs want Trump to ban bank fees for customer data",
    "description": "Over 80 crypto and fintech executives asked the Trump administration to stop banks from levying data access fees, which threaten their business models.",
    "link": "https://cointelegraph.com/news/crypto-execs-want-trump-ban-bank-fees-customer-data",
    "timestamp": "2025-08-15T03:11:46Z"
  },
  {
    "title": "Judge orders RFK Jr.'s health department to stop sharing Medicaid data with deportation officials - NewsBreak",
    "description": "WASHINGTON (AP) — A federal judge ordered the nation’s health department to stop giving deportation officials access to the personal information — includin",
    "link": "https://www.newsbreak.com/share/4175369879394-judge-orders-rfk-jr-s-health-department-to-stop-sharing-medicaid-data-with-deportation-officials?_f=app_share&amp;pd=092U3TeL&amp;lang=en_US&amp;send_time=1755227441&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.33.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-control%2Cns_foryou_model_exp_25q3-v8%2Cns_foryou_rank_exp_25q3-v6%2Cns_foryou_blend_exp_25q3-v3&amp;s=i2",
    "timestamp": "2025-08-15T03:11:10Z"
  }
]