[
  {
    "title": "1,500 Iranian Nationals Apprehended by Border Patrol During Biden Administration",
    "description": "During the four fiscal years of the Biden administration, approximately 1,500 Iranian nationals were apprehended by Border Patrol agents after illegally entering the United States. Officials say that nearly half of those were released into the U.S. interior.\n…",
    "link": "https://www.breitbart.com/border/2025/06/23/1500-iranian-nationals-apprehended-by-border-patrol-during-biden-administration/",
    "timestamp": "2025-06-23T20:11:43Z"
  },
  {
    "title": "Barron Trump’s $40 Million Crypto Win Shocks Wall Street: Forbes Confirms Massive Profit",
    "description": "Barron Trump, son of President Donald Trump, has now earned almost $40 million from cryptocurrency before his 20th birthday. Barron is left with about $25 million after taxes from a very clever investment, according to Forbes. This whopping amount is said to …",
    "link": "https://freerepublic.com/focus/f-chat/4324872/posts",
    "timestamp": "2025-06-23T20:11:04Z"
  },
  {
    "title": "Trump: No casualties in Iranian attack, Iran got it out of their 'system'",
    "description": "Following Iranian missile attack on US bases in Qatar, President Trump 'thanks' Iran for giving early notice of the attack, enabling the US to ensure no one would be harmed.",
    "link": "https://www.israelnationalnews.com/news/410543",
    "timestamp": "2025-06-23T20:10:18Z"
  },
  {
    "title": "Donald Trump Reacts to Iran's Strike on US Base",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump responded on Monday after Iran struck back against U.S. attacks on its nuclear facilities by targeting Al Udeid Air Base—a vast desert installation in Qatar that functions as a key regio…",
    "link": "https://biztoc.com/x/7ce787eb2ca21da3",
    "timestamp": "2025-06-23T20:09:38Z"
  },
  {
    "title": "Trump calls Iran's retaliatory attack 'very weak'",
    "description": "United States President Donald Trump said on Monday that Iran's retaliatory strikes on the US military bases in the Gulf region were \"very weak\" and expressed hope that Tehran can now \"proceed to peac...",
    "link": "https://biztoc.com/x/c75a4e557c6c8e42",
    "timestamp": "2025-06-23T20:09:33Z"
  },
  {
    "title": "Donald Trump Reacts to Iran's Strike on US Base",
    "description": "Iran said Monday that the number of missiles fired matched the number of bombs dropped by the U.S. over the weekend.",
    "link": "https://www.newsweek.com/trump-reacts-iran-missile-strike-us-base-qatar-2089620",
    "timestamp": "2025-06-23T20:06:49Z"
  },
  {
    "title": "Donald Trump Completely Destroyed The White House Rose Garden, And These Before-And-After Photos Are Unthinkable",
    "description": "President Donald Trump has vowed to pave over the grass...",
    "link": "https://www.buzzfeed.com/hilaryhanson/donald-trump-white-house-rose-garden-rennovation",
    "timestamp": "2025-06-23T20:06:21Z"
  },
  {
    "title": "Trump Thanks Iran For ‘Very Weak Response’ to His Bombing Their Nuclear Sites",
    "description": "President Donald Trump thanked Iran on Monday for “giving us early notice” of the missile attack on the U.S. air base in Qatar, while boasting of the “very weak response” to his bombing of Iranian nuclear sites on Saturday. “Iran has officially responded to o…",
    "link": "https://www.mediaite.com/media/news/trump-thanks-iran-for-very-weak-response-to-his-bombing-their-nuclear-sites/",
    "timestamp": "2025-06-23T20:06:11Z"
  },
  {
    "title": "‘Fascism Is Not a Side’: Journalists Strategize to Expose the ‘Extremism’ on the Right",
    "description": "NEW ORLEANS—When Turning Point USA Founder Charlie Kirk goes to speak on campus and attracts a large following, that’s not the story—the story is how... Read More\nThe post ‘Fascism Is Not a Side’: Journalists Strategize to Expose the ‘Extremism’ on the Right …",
    "link": "https://www.dailysignal.com/2025/06/23/fascism-is-not-side-journalists-strategize-expose-extremism-right/",
    "timestamp": "2025-06-23T20:05:18Z"
  },
  {
    "title": "Markets edge higher Monday after Iran fires missiles at U.S. base in Qatar",
    "description": "\"Historical precedent of markets selling off initially, only to recover and make new highs, has led investors to be a bit more level-headed about their reaction,\" says one analyst.",
    "link": "https://fortune.com/2025/06/23/markets-edge-higher-monday-after-iran-fires-missiles-at-u-s-base-in-qatar/",
    "timestamp": "2025-06-23T20:04:28Z"
  },
  {
    "title": "Hakeem Jeffries demands Trump 'justify' striking Iran, but side-steps impeachment question",
    "description": "House Democratic Leader Hakeem Jeffries blasted the Trump administration's strikes on Iran during a Monday press conference.",
    "link": "https://www.foxnews.com/politics/hakeem-jeffries-demands-trump-justify-striking-iran-side-steps-impeachment-question",
    "timestamp": "2025-06-23T20:04:16Z"
  },
  {
    "title": "“Good Trouble Lives On” National Day of Action Builds on Momentum Against Authoritarianism, Fight for Civil Rights",
    "description": "On July 17, five years since the passing of civil rights hero Congressman John Lewis, communities nationwide are mobilizing for Good Trouble Lives On, a national day of action to speak out against the Trump administration’s brazen rollback of our civil rights…",
    "link": "https://www.commondreams.org/newswire/good-trouble-lives-on-national-day-of-action-builds-on-momentum-against-authoritarianism-fight-for-civil-rights",
    "timestamp": "2025-06-23T20:04:05Z"
  },
  {
    "title": "Donald Trump speaks out after Iran attacks on US airbases",
    "description": "Donald Trump has spoken out after Iran launched missile strikes on US airbases.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-speaks-out-iran-us-airbases-628914-20250623",
    "timestamp": "2025-06-23T20:03:59Z"
  },
  {
    "title": "As Trump Calls for Rapid Stablecoin Bill Passage, Key Lawmaker Hints at More Talks",
    "description": "French Hill, the chair of the House Financial Services Committee, signaled the House still intends to hash out stablecoin details, suggesting a longer process.",
    "link": "https://www.coindesk.com/policy/2025/06/23/as-trump-calls-for-rapid-stablecoin-bill-passage-key-lawmaker-hints-at-more-talks",
    "timestamp": "2025-06-23T20:03:57Z"
  },
  {
    "title": "Oil Tumbles 7% After Iran Spares Energy Sites",
    "description": "Volatile swings reflect ongoing uncertainty despite signs of de-escalation.",
    "link": "https://www.rigzone.com/news/wire/oil_tumbles_7_after_iran_spares_energy_sites-23-jun-2025-180919-article/",
    "timestamp": "2025-06-23T20:03:17Z"
  },
  {
    "title": "Did the Neocons Plot to Get Rid of Tulsi? China Enters & Iran Refuses to Surrender",
    "description": "The firestorm that has erupted since Tulsi Gabbard testified on March 25, 2025, that WikiLeaks had released on X June 14th, 2025, that the Supreme Leader of Iran had suspended the nuclear bomb development back in 2003, and that it was the Intelligence Communi…",
    "link": "https://www.activistpost.com/did-the-neocons-plot-to-get-rid-of-tulsi-china-enters-iran-refuses-to-surrender/",
    "timestamp": "2025-06-23T20:03:00Z"
  },
  {
    "title": "US-Iran: Putin says Washington strikes are pushing world to a ‘very dangerous line’",
    "description": "Russian president meets Iranian foreign minister Abbas Araqchi Araqchi in the Kremlin",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/23/us-iran-putin-says-washington-strikes-are-pushing-world-to-a-very-dangerous-line/",
    "timestamp": "2025-06-23T20:02:45Z"
  },
  {
    "title": "Fed Chair Powell speaks on Capitol Hill this week with politics front and center",
    "description": "White House officials have raised the heat on Powell to lower rates. Now he's faced with two key Fed officials who have said they could favor a cut in July.",
    "link": "https://www.cnbc.com/2025/06/23/powell-speaks-on-capitol-hill-this-week-with-politics-front-and-center.html",
    "timestamp": "2025-06-23T20:00:41Z"
  },
  {
    "title": "Ticker: Federal Reserve’s Bowman says rate cut should be on table in July; Compass files lawsuit against Zillow",
    "description": "Ticker: Federal Reserve's Bowman says rate cut should be on table in July; Compass files lawsuit against Zillow",
    "link": "https://www.bostonherald.com/2025/06/23/ticker-federal-reserves-bowman-says-rate-cut-should-be-on-table-in-july-compass-files-lawsuit-against-zillow/",
    "timestamp": "2025-06-23T20:00:40Z"
  },
  {
    "title": "Major U.S. Cities Are On “High Alert” After Iran Strikes",
    "description": "Three major United States cities are on \"high alert\" or \"red alert\" after the United States struck some of Iran's nuclear facilities. The Department of Homeland Security issued a warning of possible cyber and physical attacks in response to the strikes over t…",
    "link": "https://www.shtfplan.com/headline-news/major-u-s-cities-are-on-high-alert-after-iran-strikes",
    "timestamp": "2025-06-23T20:00:35Z"
  },
  {
    "title": "Senate Republican Weighs Bailing On Party Amid Repeated Clashes With Trump: Open to ‘Exploring Something Different’",
    "description": "A more moderate Republican senator who has repeatedly clashed with President Donald Trump is keeping the door open on potentially leaving the party.\nThe post Senate Republican Weighs Bailing On Party Amid Repeated Clashes With Trump: Open to ‘Exploring Someth…",
    "link": "https://www.mediaite.com/media/news/senate-republican-weighs-bailing-on-party-amid-repeated-clashes-with-trump-open-to-exploring-something-different/",
    "timestamp": "2025-06-23T20:00:07Z"
  },
  {
    "title": "MSNBC host Scarborough defends Trump's decision to carry out Iran strike",
    "description": "MSNBC \"Morning Joe\" host Joe Scarborough defended Donald Trump's decision to strike Iran's nuclear sites and said other presidents might have made the same move.",
    "link": "https://www.foxnews.com/media/scarborough-defends-trumps-decision-strike-iran-suggests-other-presidents-would-have-done-same",
    "timestamp": "2025-06-23T20:00:05Z"
  },
  {
    "title": "Filing: CBS calls Trump's 60 Minutes lawsuit against the network \"meritless\" and an attempt to \"evade bedrock First Amendment principles\" (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nFiling: CBS calls Trump's 60 Minutes lawsuit against the network “meritless” and an attempt to “evade bedrock First Amendment principles”  —  As settlement talks continue between the legal teams of Paramount Global and Donald Trump, CB…",
    "link": "https://mediagazer.com/250623/p16",
    "timestamp": "2025-06-23T20:00:05Z"
  },
  {
    "title": "After Kanye West’s Wife Bianca Censori Wore Lingerie Made Out Of Candy, 50 Cent Didn’t Mince Words",
    "description": "The rapper didn't hold back his thoughts.",
    "link": "https://www.cinemablend.com/streaming-news/after-kanye-west-wife-bianca-censori-wore-lingerie-made-out-of-candy-50-cent-reaction",
    "timestamp": "2025-06-23T19:59:57Z"
  },
  {
    "title": "Oil Prices Slump 7% After Iran’s Muted Response To U.S. Attack",
    "description": "Following days of tension in the wake of a U.S. attack on Iran's nuclear facilities, oil markets appear to have de-risked after Tehran's token retaliation.",
    "link": "https://www.forbes.com/sites/gauravsharma/2025/06/23/oil-prices-slump-7-on-irans-token-response-to-us-attack/",
    "timestamp": "2025-06-23T19:59:15Z"
  },
  {
    "title": "Democratic senator introduces bill to address Trump’s crypto ties",
    "description": "The proposed bill from Senator Adam Schiff followed similar legislation in the House of Representatives from Maxine Waters in response to the president's memecoin dinner.",
    "link": "https://cointelegraph.com/news/adam-schiff-bill-donald-trump-crypto-corruption",
    "timestamp": "2025-06-23T19:59:00Z"
  },
  {
    "title": "Trump Warns Oil Producers: 'Don't Play Into Enemy Hands'",
    "description": "President Donald Trump on Monday warned oil producers against price hikes following U.S. airstrikes on Iran’s nuclear sites over the weekend. \nThe remarks come despite the White House playing down market concerns. National Economic Council Director Kevin Hass…",
    "link": "https://biztoc.com/x/274f2c7b4f4b0711",
    "timestamp": "2025-06-23T19:58:27Z"
  },
  {
    "title": "Amanda Seales Trashes Kamala Harris Again, But Here’s Why Folks are Responding Differently This Time",
    "description": "Would tensions in the Middle East have subsided if Kamala Harris was president instead of Donald Trump?\nThe post Amanda Seales Trashes Kamala Harris Again, But Here’s Why Folks are Responding Differently This Time appeared first on The Root.",
    "link": "https://www.theroot.com/amanda-seales-trashes-kamala-harris-again-but-heres-wh-2000046821",
    "timestamp": "2025-06-23T19:57:53Z"
  },
  {
    "title": "Iran sleeper cell threat hits U.S. soil after base attack? Trump’s sudden G7 exit linked to terror warning, reports say",
    "description": "Iran sleeper cell threat is now a growing concern in the U.S. after Donald Trump suddenly left the G7 summit, reportedly due to intelligence warning of possible attacks on American soil. Following Iran’s missile strike on a U.S. base, and America’s retaliator…",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-sleeper-cell-threat-hits-u-s-soil-after-base-attack-trumps-sudden-g7-exit-linked-to-terror-warning-reports-say/articleshow/122033287.cms",
    "timestamp": "2025-06-23T19:56:33Z"
  },
  {
    "title": "Canadian community foundations rally to support local news, calling it essential to democracy",
    "description": "As community foundations across Canada have realized, local news is crucial for democracy. They’re supporting local journalism in new ways.",
    "link": "https://theconversation.com/canadian-community-foundations-rally-to-support-local-news-calling-it-essential-to-democracy-257873",
    "timestamp": "2025-06-23T19:56:20Z"
  },
  {
    "title": "New York state to build nuclear power plant",
    "description": "New York Governor Kathy Hochul announced plans Monday to build a nuclear power facility, enlisting a state agency for the first major new US nuclear construction since 2009.",
    "link": "https://techxplore.com/news/2025-06-york-state-nuclear-power.html",
    "timestamp": "2025-06-23T19:50:04Z"
  },
  {
    "title": "Man ordered to pay $500K for assaulting officer who killed himself after Capitol riot",
    "description": "A federal jury has awarded $500,000 to the widow and estate of a police officer who killed himself nine days after he helped defend the U.S. Capitol from a mob of rioters, including a man who scuffled with the officer during the attack",
    "link": "https://abcnews.go.com/US/wireStory/jury-orders-man-pay-500k-assaulting-police-officer-123131670",
    "timestamp": "2025-06-23T19:49:41Z"
  },
  {
    "title": "Democratic Senators To Host Kennedy Center Pride Concert To Protest Trump Takeover – Report",
    "description": "Five Democratic senators will host an invitation-only Pride concert at the Kennedy Center Monday as a protest against President Donald Trump’s takeover of the Washington D.C. arts institution. The 90-minute concert, which is expected to feature Broadway perfo…",
    "link": "http://deadline.com/2025/06/kennedy-center-pride-concert-love-is-love-1236440057/",
    "timestamp": "2025-06-23T19:49:11Z"
  },
  {
    "title": "What to know about New York’s mayoral primary and ranked choice voting",
    "description": "Tuesday's election has drawn nationwide attention for its close race and use of ranked choice voting.",
    "link": "https://www.aljazeera.com/news/2025/6/23/what-to-know-about-new-yorks-mayoral-primary-and-ranked-choice-voting",
    "timestamp": "2025-06-23T19:48:38Z"
  },
  {
    "title": "'If You Can Keep It': The Separation Of Church And State",
    "description": "Donald Trump's new Commission on Religious Liberty met last week for the first time.<br><br>When Trump signed the executive order in May establishing the group, he marked the occasion by saying, \"We're bringing religion back to our country, and it's a big dea…",
    "link": "https://www.npr.org/2025/06/23/1254614609/1a-church-06-23-2025",
    "timestamp": "2025-06-23T19:47:50Z"
  },
  {
    "title": "Donald Trump Gets Good News From Federal Reserve",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA second Federal Reserve official signaled an openness to cutting interest rates on Monday, following months of President Donald Trump publicly pressuring Federal Reserve Chair Jerome Powell to slash rates.\nTh…",
    "link": "https://biztoc.com/x/fc054014768c2088",
    "timestamp": "2025-06-23T19:47:44Z"
  },
  {
    "title": "College Grad Now Heads Trump Admin's Terrorism Prevention Team Despite Lack of National Security Experience",
    "description": "After graduating college, Thomas Fugate went from campaigning for Donald Trump to serving in a director-level role at the Department of Homeland Security.",
    "link": "https://www.ibtimes.com/college-grad-now-heads-trump-admins-terrorism-prevention-team-despite-lack-national-security-3776591",
    "timestamp": "2025-06-23T19:47:14Z"
  },
  {
    "title": "Threat of Iranian ‘sleeper cells’ provokes paranoia among MAGA influencers",
    "description": "MAGA influencers have taken to fearmongering over threats of Iranian “sleeper cells” in the wake of President Donald Trump’s unilateral entry into Israel’s war with Iran.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-iran-bombing-sleeper-cell-threats-rcna214543",
    "timestamp": "2025-06-23T19:46:36Z"
  },
  {
    "title": "Mike Pence Heaps Praise on President Trump for Iran Strikes (VIDEO)",
    "description": "Mike Pence is back on the Trump Train following the US strikes on Iranian nuclear facilities. Pence heaped praise upon Trump for the attack, which has sharply divided many of the president’s conventional supporters, during an interview on Sunday’s edition of …",
    "link": "https://freerepublic.com/focus/f-news/4324870/posts",
    "timestamp": "2025-06-23T19:46:23Z"
  },
  {
    "title": "TMTG reaffirms Bitcoin commitment amid $400M share buyback plan",
    "description": "Trump Media and Technology Group announced plans to repurchase up to $400 million worth of its own shares while leaving intact the $2.3 billion it has earmarked for building a substantial Bitcoin (BTC) reserve. The board of directors authorized the buyback pl…",
    "link": "https://cryptoslate.com/tmtg-reaffirms-bitcoin-commitment-amid-400m-share-buyback-plan/",
    "timestamp": "2025-06-23T19:45:26Z"
  },
  {
    "title": "New York’s getting a new nuclear power plant",
    "description": "New York Governor Kathy Hochul announced plans today to develop a new nuclear power plant, the first to be built in the state in decades.  It’s the latest signal that nuclear energy could see a comeback in the US thanks to wide-ranging support from some stran…",
    "link": "https://www.theverge.com/news/691431/nuclear-power-plant-new-york-advanced-reactor",
    "timestamp": "2025-06-23T19:45:24Z"
  },
  {
    "title": "Donald Trump Gets Good News From Federal Reserve",
    "description": "Two high-ranking Federal Reserve officials have suggested cutting interest rates as soon as next month.",
    "link": "https://www.newsweek.com/trump-gets-good-news-federal-reserve-interest-rates-2089596",
    "timestamp": "2025-06-23T19:44:46Z"
  },
  {
    "title": "Trump Issues Confusing Veiled Threat to Putin Over Iran",
    "description": "Donald Trump just whacked the ball back to Russia with a string of eyebrow-furrowing comments on nuclear arms.\r\nOn Sunday, deputy chairman of the Security Council of Russia and former Russian President Dmitry Medvedev wrote on social media that Russia’s “prod…",
    "link": "https://newrepublic.com/post/197121/donald-trump-confusing-threat-nuclear-vladimir-putin-iran",
    "timestamp": "2025-06-23T19:43:51Z"
  },
  {
    "title": "Presidents of both parties have launched military action without Congress declaring war − Trump’s bombing of Iran is just the latest",
    "description": "Against the backdrop of US attacks on Iranian nuclear sites, a scholar of presidential powers examines the history and current use of the laws around US military action.",
    "link": "https://theconversation.com/presidents-of-both-parties-have-launched-military-action-without-congress-declaring-war-trumps-bombing-of-iran-is-just-the-latest-259636",
    "timestamp": "2025-06-23T19:43:22Z"
  },
  {
    "title": "US Health Plans Roll Out Major Reforms",
    "description": "Robert F. Kennedy Jr. and Dr. Mehmet Oz announced the health insurance changes during a Monday afternoon press conference.",
    "link": "https://www.newsweek.com/us-health-plans-major-reforms-oz-kennedy-2089601",
    "timestamp": "2025-06-23T19:42:05Z"
  },
  {
    "title": "Iran Targets US Base in Qatar With Limited Retaliation Strike",
    "description": "Iran fired missiles at a US air base in Qatar after promising it would respond “proportionately and decisively” to President Donald Trump’s weekend airstrikes on three of its nuclear facilities.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-targets-us-base-in-qatar-with-limited-retaliation-strike",
    "timestamp": "2025-06-23T19:41:30Z"
  },
  {
    "title": "'Answer yes or no!' Dem rages at Pam Bondi as House hearing gets heated",
    "description": "Rep. Rosa DeLauro (D-CT) admonished Attorney General Pam Bondi for failing to increase fentanyl seizures under President Donald Trump.\"Fentanyl seizures are down 30% compared to last year,\" DeLauro told Bondi during a Monday House Appropriations Committee hea…",
    "link": "https://www.rawstory.com/rosa-delauro-2672419288/",
    "timestamp": "2025-06-23T19:41:13Z"
  },
  {
    "title": "MAGA is split over the AI provision in Trump's Big Beautiful Bill",
    "description": "President Donald Trump himself has been quiet on the AI regulation moratorium, which has divided his supporters in Congress.",
    "link": "https://www.businessinsider.com/trump-big-beautiful-bill-ai-regulation-ban-tech-2025-6",
    "timestamp": "2025-06-23T19:41:10Z"
  },
  {
    "title": "Progressive Democrats of America Condemns Trump’s Bombing of Iran",
    "description": "Progressive Democrats of America (PDA) today issued the following statement:Progressive Democrats of America condemns Trump’s unconstitutional bombing of Iran. We’re outraged by these reckless, lawless, aggressive actions. We support the Khanna/Massie War Pow…",
    "link": "https://www.commondreams.org/newswire/progressive-democrats-of-america-condemns-trumps-bombing-of-iran",
    "timestamp": "2025-06-23T19:41:01Z"
  },
  {
    "title": "World War 3 begins? After Iran, Israel, US, Yemen, now Saudi Arabia, Qatar and Iraq get embroiled in conflict while Kuwait, Bahrain and the UAE close airspace. More nations may join either side soon. See what’s happening now and who may be Iran's next target",
    "description": "Iran has launched missile attacks on US bases in Qatar and Iraq in response to US strikes on its nuclear sites. The operation caused no casualties but led to regional airspace closures and warnings from Gulf countries. The conflict now includes multiple natio…",
    "link": "https://economictimes.indiatimes.com/news/international/us/world-war-3-begins-after-iran-israel-us-yemen-now-saudi-arabia-qatar-and-iraq-get-embroiled-in-conflict-while-kuwait-bahrain-and-the-uae-close-airspace-more-nations-may-join-either-side-soon-see-whats-happening-now-and-who-may-be-irans-next-target/articleshow/122033179.cms",
    "timestamp": "2025-06-23T19:41:00Z"
  },
  {
    "title": "Iran Just Carried Out a Missile Attack on Al Udeid Air Base",
    "description": "Iran fired 10 missiles at the base in Qatar, apparently equal to the number of bombs that the United States used in its strike over the weekend.\nThe post Iran Just Carried Out a Missile Attack on Al Udeid Air Base appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/iran-just-carried-out-a-missile-attack-on-al-udeid-air-base",
    "timestamp": "2025-06-23T19:40:36Z"
  },
  {
    "title": "Shocking accusation: JD Vance hints Iran hid Uranium after alleged tip-off — from Donald Trump?",
    "description": "US Vice President JS Vance has raised concerns about the effectiveness of recent US strikes on Iran's nuclear facilities, suggesting Iran may have moved uranium before the attacks. Satellite images showed suspicious truck activity near nuclear sites before th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shocking-accusation-jd-vance-hints-iran-hid-uranium-after-alleged-tip-off-from-donald-trump-jd-vance-news-donald-trump-iran-strike-news/articleshow/122033015.cms",
    "timestamp": "2025-06-23T19:39:17Z"
  },
  {
    "title": "CBS Blasts Trump’s $20 Billion Lawsuit as ‘Meritless’ Attempt to ‘Evade Bedrock First Amendment Principles’",
    "description": "In a new court filing, the network argues that its \"60 Minutes\" Kamala Harris interview is \"fully protected editorial speech\" \nThe post CBS Blasts Trump’s $20 Billion Lawsuit as ‘Meritless’ Attempt to ‘Evade Bedrock First Amendment Principles’ appeared first …",
    "link": "https://www.thewrap.com/cbs-blasts-meritless-trump-lawsuit-court-filing/",
    "timestamp": "2025-06-23T19:39:08Z"
  },
  {
    "title": "Trump FTC Secures Landmark Agreement to End Political Collusion in Advertising Industry",
    "description": "President Donald Trump’s top consumer protection and antitrust official has approved a massive $13.5 billion merger that will reshape the advertising industry, effectively putting the final nail in the coffin of coordination against outlets based on their pol…",
    "link": "https://biztoc.com/x/2872f463d958fd88",
    "timestamp": "2025-06-23T19:36:35Z"
  },
  {
    "title": "JD Vance is trying — and failing — to justify Trump's actions in Iran",
    "description": "President Donald Trump addresses the nation, alongside US Vice President JD Vance (L), from the White House in Washington, DC on June 21, 2025, following the announcement that the US bombed nuclear sites in Iran.",
    "link": "https://biztoc.com/x/ae04f270fdea5a4d",
    "timestamp": "2025-06-23T19:36:33Z"
  },
  {
    "title": "Powell Headed for Congressional Grilling Over Fed’s Rate Hold",
    "description": "Federal Reserve Chair Jerome Powell will have two chances this week to explain to lawmakers why he and most of his fellow policymakers seem resolved to continue holding interest rates steady at least until September, ignoring President Donald Trump’s persiste…",
    "link": "https://financialpost.com/pmn/business-pmn/powell-headed-for-congressional-grilling-over-feds-rate-hold",
    "timestamp": "2025-06-23T19:36:32Z"
  },
  {
    "title": "Trump faces bipartisan pushback to Iran strike as some question his war powers",
    "description": "President Donald Trump's strike against Iran will be met with pushback on Capitol Hill this week as some lawmakers argue the military action was unconstitutional.",
    "link": "https://abcnews.go.com/Politics/congress-faces-uphill-battle-challenge-trump-war-powers/story?id=123116301",
    "timestamp": "2025-06-23T19:35:45Z"
  },
  {
    "title": "Fears over Iran quitting NPT, reducing cooperation with IAEA",
    "description": "Despite Iranian parliament's vote to potentially block the Strait of Hormuz in response to US actions, the channel remains open, bringing temporary relief to India. While not entirely reliant on the strait, it remains crucial for oil supplies and the safety o…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fears-over-iran-quitting-npt-reducing-cooperation-with-iaea/articleshow/122033213.cms",
    "timestamp": "2025-06-23T19:34:27Z"
  },
  {
    "title": "Gun silencers deregulation in tax bill",
    "description": "The massive tax and spending cuts package that President Donald Trump wants on his desk by July 4 would loosen regulations on gun silencers and certain types of rifles and shotguns.",
    "link": "https://www.wmur.com/article/gun-silencers-deregulation-tax-bill/65149869",
    "timestamp": "2025-06-23T19:34:23Z"
  },
  {
    "title": "Former B-2 pilot shares details behind Iran nuclear facility strikes",
    "description": "A retired B-2 bomber pilot reveals details about the historic U.S. strike on Iran, including stealth tactics, pilot preparations and decadelong planning.",
    "link": "https://abcnews.go.com/US/former-2-pilot-shares-details-iran-nuclear-facility/story?id=123121102",
    "timestamp": "2025-06-23T19:33:17Z"
  },
  {
    "title": "The US military dropped new photos of the Operation Midnight Hammer B-2 Spirit bombers",
    "description": "The US Air Force released photos and imagery showing the stealth aircraft preparing to bomb Iran and returning back to base.",
    "link": "https://www.businessinsider.com/us-military-photos-show-operation-midnight-hammer-b-2-bombers-2025-6",
    "timestamp": "2025-06-23T19:33:09Z"
  },
  {
    "title": "Don't fall for video of King Charles III speaking 'to the world' about Trump's Iran strikes",
    "description": "A video authentically showed King Charles III speaking about U.S. President Donald Trump’s decision to bomb nuclear sites in Iran.",
    "link": "https://www.snopes.com//fact-check/iran-trump-video-king-charles-iii/",
    "timestamp": "2025-06-23T19:32:00Z"
  },
  {
    "title": "Everything we know about Iranian attack on US airbases in Qatar and Iraq as videos show missiles in the air",
    "description": "All the information known after Iran's missile attacks on US bases in Iraq and Qatar",
    "link": "https://www.ladbible.com/news/world-news/iran-attack-us-bases-iraq-qatar-everything-known-738757-20250623",
    "timestamp": "2025-06-23T19:30:36Z"
  },
  {
    "title": "Jury orders man to pay $500K for assaulting police officer who killed himself after Capitol riot",
    "description": "The judge presiding over the trial for his widow Erin Smith’s lawsuit had dismissed her wrongful-death claim.",
    "link": "https://www.bostonherald.com/2025/06/23/capitol-riot-civil-trial-payment/",
    "timestamp": "2025-06-23T19:29:55Z"
  },
  {
    "title": "Iran launches missile attack on US base in Qatar",
    "description": "Iran’s Islamic Revolutionary Guard Corps (IRGC) attacked US forces at the Al Udeid Air Base in Qatar in response to the June 21 US airstrikes against three Iranian nuclear facilities. \nThe post Iran launches missile attack on US base in Qatar appeared first o…",
    "link": "https://www.longwarjournal.org/archives/2025/06/iran-launches-missile-attack-on-us-base-in-qatar.php",
    "timestamp": "2025-06-23T19:29:27Z"
  },
  {
    "title": "California Dems Blame Wildfires On Trump After Their Party Created Tinderbox Of Regs",
    "description": "As California braces for another wildfire season, forestry experts warn that decades of regulatory mismanagement — not climate change or Trump-era budget cuts — have left forests dangerously overloaded with fuel. Democrats have blamed climate change and agenc…",
    "link": "https://freerepublic.com/focus/f-bloggers/4324867/posts",
    "timestamp": "2025-06-23T19:27:31Z"
  },
  {
    "title": "How developed was Iran's nuclear program and what's left now?",
    "description": "Israel and the United States have said different things about Iran's capabilities",
    "link": "https://theweek.com/world-news/iran-nuclear-program-development",
    "timestamp": "2025-06-23T19:27:15Z"
  },
  {
    "title": "Iranian Attack on US Base in Qatar Falls Flat",
    "description": "Iran launched ballistic missiles at a major U.S. military base in Qatar and quickly claimed to have \"destroyed\" it. None of the missiles landed, and the attack yielded no casualties.\nThe post Iranian Attack on US Base in Qatar Falls Flat appeared first on .",
    "link": "https://freebeacon.com/national-security/iranian-attack-on-us-base-in-qatar-falls-flat/",
    "timestamp": "2025-06-23T19:27:10Z"
  },
  {
    "title": "FBI Warns of Possible Iran Retaliation Following Strikes on Nuclear Sites",
    "description": "An internal memo warned of pro-Iran groups retaliating.",
    "link": "https://www.newsweek.com/fbi-warns-possible-iran-retaliation-following-strikes-nuclear-sites-2089590",
    "timestamp": "2025-06-23T19:26:57Z"
  },
  {
    "title": "Vance Claims US Doesn’t Want Iran Regime Change — But Trump Says It May Happen",
    "description": "Prior to the strikes this weekend, a poll found that 6 in 10 Americans opposed US military involvement in Iran.",
    "link": "https://truthout.org/articles/vance-claims-us-doesnt-want-iran-regime-change-but-trump-says-it-may-happen/",
    "timestamp": "2025-06-23T19:26:32Z"
  },
  {
    "title": "Democrats to choose new House Oversight Committee leader to take on Trump",
    "description": "Two senior Democrats on the panel, Reps. Stephen Lynch and Kwesi Mfume, are vying for the role against two younger members, Reps. Robert Garcia and Jasmine Crockett.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-choose-new-house-oversight-committee-leader-trump-rcna214491",
    "timestamp": "2025-06-23T19:26:27Z"
  },
  {
    "title": "Editor’s Picks: The rise of pro-natalist policies on the right",
    "description": "A handpicked article read aloud from the latest issue of The Economist. Donald Trump, Victor Orban and Nigel Farage want working-class women to have more children, but state incentives can’t replace family planning.\nListen on: Apple Podcasts | Spotify\nChecks …",
    "link": "https://biztoc.com/x/f1ca8761a439eabc",
    "timestamp": "2025-06-23T19:26:08Z"
  },
  {
    "title": "Vance Says Bombing Iran Is Different From Other 'Dumb' Presidents' Military Actions",
    "description": "Over the weekend, the U.S. bombed three nuclear facilities in Iran. \"The strikes were a spectacular military success\" President Donald Trump said Saturday night. \"Iran's key nuclear enrichment facilities have been completely and totally obliterated.\" Official…",
    "link": "https://biztoc.com/x/15b0ad1bbdc1c7ad",
    "timestamp": "2025-06-23T19:25:11Z"
  },
  {
    "title": "Tesla Stock’s 9% Robotaxi Boost Lifts Elon Musk’s Net Worth By $17 Billion",
    "description": "Tesla stock has officially recovered all losses from the falling out between Elon Musk and Donald Trump, wiping out what was once a 14% slide.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/06/23/tesla-stocks-9-robotaxi-boost-lifts-elon-musks-net-worth-by-17-billion/",
    "timestamp": "2025-06-23T19:24:25Z"
  },
  {
    "title": "Tesla Stock’s 8% Robotaxi Boost Lifts Elon Musk’s Net Worth By $15 Billion",
    "description": "Tesla stock has officially recovered all losses from the falling out between Elon Musk and Donald Trump, wiping out what was once a 14% slide.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/06/23/tesla-stocks-8-robotaxi-boost-lifts-elon-musks-net-worth-by-15-billion/",
    "timestamp": "2025-06-23T19:24:25Z"
  },
  {
    "title": "Federal Reserve’s Bowman says rate cut should be on table in July",
    "description": "Bowman said Trump’s tariffs have so far not caused the jump in inflation that many economists feared.",
    "link": "https://www.bostonherald.com/2025/06/23/federal-reserve-rates/",
    "timestamp": "2025-06-23T19:22:48Z"
  },
  {
    "title": "Marco Rubio Uses Iraq War Rationale To Attack Iran",
    "description": "Secretary of State Marco Rubio got into a heated conversation with Face the Nation host Margaret Brennan after she tried to pin him down on why the Trump administration attacked Iran, now.\n \"Weaponization ambitions,\" is the new catch phrase for the Trump admi…",
    "link": "https://crooksandliars.com/2025/06/marco-rubio-uses-iraq-war-rationals-attack",
    "timestamp": "2025-06-23T19:22:36Z"
  },
  {
    "title": "Bases, soldiers and firepower: Mapping the US military's stake in the Middle East",
    "description": "With a substantial military footprint in the Middle East, thousands of American troops are within Iran's striking distance if Tehran retaliates against US strikes on its nuclear facilities.",
    "link": "https://www.abc.net.au/news/2025-06-24/us-military-assets-bases-middle-east-iran-israel-conflict/105427980",
    "timestamp": "2025-06-23T19:21:42Z"
  },
  {
    "title": "Exclusive: Americans worry conflict with Iran could escalate, Reuters/Ipsos poll finds (Jason Lange/Reuters)",
    "description": "Jason Lange / Reuters:\nExclusive: Americans worry conflict with Iran could escalate, Reuters/Ipsos poll finds  —  Americans are anxious over a brewing conflict between the U.S. and Iran and worry the violence could escalate after President Donald Trump ordere…",
    "link": "https://www.memeorandum.com/250623/p101",
    "timestamp": "2025-06-23T19:20:06Z"
  },
  {
    "title": "Transcript: Trump Threat to Unleash Troops Darkens as Brutal Poll Hits (New Republic)",
    "description": "New Republic:\nTranscript: Trump Threat to Unleash Troops Darkens as Brutal Poll Hits … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  President Donald Trump thinks he's…",
    "link": "https://www.memeorandum.com/250623/p102",
    "timestamp": "2025-06-23T19:20:06Z"
  },
  {
    "title": "Bitcoin breaks to $103k as Iran attacks US base in Qatar",
    "description": "Bitcoin price rose more than 3% to break to $103k on Monday. Gains came despite Iran’s missile attacks on US bases in the Middle East. BTC also seemed to rally amid reports that US President Donald Trump seeks no further military action in Iran Bitcoin (BTC) …",
    "link": "https://coinjournal.net/news/bitcoin-breaks-to-103k-as-iran-attacks-us-base-in-qatar/",
    "timestamp": "2025-06-23T19:19:14Z"
  },
  {
    "title": "Are Americans now fearing possible world war 3, 9/11 like attacks? Survey shows shocking results",
    "description": "Iran Israel war is now turning into a US, Israel versus Iran conflict as Tehran on Monday said it had attacked an American air base in Qatar in response to US bombings at Iranian nuclear facilities.",
    "link": "https://economictimes.indiatimes.com/news/international/us/are-americans-now-fearing-possible-world-war-3-9/11-like-attacks-survey-shows-shocking-results/articleshow/122032956.cms",
    "timestamp": "2025-06-23T19:17:18Z"
  },
  {
    "title": "Stunning Hidden Cam Video Catches Trump Faith Office Group Speaking In Tongues On White House Grounds",
    "description": "A stunning viral video shows a group praying and speaking in tongues on the White House grounds at an event hosted by the Trump Faith Office.\nThe post Stunning Hidden Cam Video Catches Trump Faith Office Group Speaking In Tongues On White House Grounds first …",
    "link": "https://www.mediaite.com/media/news/stunning-hidden-cam-video-catches-trump-faith-office-group-speaking-in-tongues-on-white-house-grounds/",
    "timestamp": "2025-06-23T19:17:03Z"
  },
  {
    "title": "New York Goes Nuclear with First Major U.S. Plant in Over a Decade",
    "description": "New York is moving to construct the first major U.S. nuclear facility in more than 15 years.\nThe post New York Goes Nuclear with First Major U.S. Plant in Over a Decade appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/23/new-york-goes-nuclear-first-major-u-s-plant-over-decade/",
    "timestamp": "2025-06-23T19:17:00Z"
  },
  {
    "title": "As Trump floats regime change in Iran, past US attempts to remake the Middle East may offer warnings",
    "description": "Here's a look at some lessons learned from previous conflicts.",
    "link": "https://www.bostonherald.com/2025/06/23/middle-east-intervention-us/",
    "timestamp": "2025-06-23T19:16:45Z"
  },
  {
    "title": "Vance Says Bombing Iran Is Different From Other 'Dumb' Presidents' Military Actions",
    "description": "On Sunday talk shows, the vice president made the case for bombing Iran—a notable shift from his previous anti-war rhetoric.",
    "link": "https://reason.com/2025/06/23/vance-says-bombing-iran-is-different-from-other-dumb-presidents-military-actions/",
    "timestamp": "2025-06-23T19:14:59Z"
  },
  {
    "title": "Iranian TV Anchor Warns Thousands of American Soldiers Will Be Sent Home in 'Coffins' in Rebuke of Trump's Bombing",
    "description": "An Iranian TV host admonished the Trump administration for the attack on Iranian nuclear facilities, warning that Washington would receive \"coffins\" of soldiers.",
    "link": "https://www.ibtimes.com/iranian-tv-anchor-warns-thousands-american-soldiers-will-sent-home-coffins-rebuke-trumps-3776587",
    "timestamp": "2025-06-23T19:13:18Z"
  },
  {
    "title": "Trump’s War Gamble: “Isolationist” President Opens Pandora’s Box With Iran",
    "description": "Jacob Heilbrunn joins the editors to weigh in on potential military escalation, political divides, and economic fallout from Trump's strikes on Iran.\nThe post Trump’s War Gamble: “Isolationist” President Opens Pandora’s Box With Iran appeared first on Washing…",
    "link": "http://washingtonmonthly.com/2025/06/23/trumps-war-gamble-isolationist-president-opens-pandoras-box-with-iran/",
    "timestamp": "2025-06-23T19:12:39Z"
  },
  {
    "title": "Trump will finally have his way as Fed official hints July could bring long-awaited rate cut",
    "description": "A top Federal Reserve official indicated a potential interest rate cut in July if inflation remains controlled, amidst ongoing uncertainty from President Trump's tariffs. While the Fed has held steady at 4.25%-4.50% in 2025, some officials are considering adj…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-will-finally-have-his-way-as-fed-official-hints-july-could-bring-long-awaited-rate-cut-fed-rate-cut-news/articleshow/122032139.cms",
    "timestamp": "2025-06-23T19:12:34Z"
  },
  {
    "title": "‘ZERO CREDIBILITY!’ Trump erupts as he names names of worst fake news giants in Iran conflict",
    "description": "'It never ends with the sleazebags in the Media, and that's why their Ratings are at an ALL TIME LOW'",
    "link": "https://www.wnd.com/2025/06/zero-credibility-trump-erupts-as-he-names-names/",
    "timestamp": "2025-06-23T19:12:22Z"
  },
  {
    "title": "Former Biden Aide 'Can't Deny' Professionalism Of Iran Strikes",
    "description": "\"Can't deny.\" Looks like CNN has fallen back on those words to cover those unfortunate situations where—much as commentators would like to diminish the accomplishments of the Trump administration or address inconvenient truths—pesky facts have made that impos…",
    "link": "https://freerepublic.com/focus/f-bloggers/4324863/posts",
    "timestamp": "2025-06-23T19:12:09Z"
  },
  {
    "title": "Trump wants oil producers to pump more crude amid jitters that Iran may close shipping lane",
    "description": "President Trump urges increased oil production amid volatile prices following U.S. strikes on Iranian nuclear facilities and threats of Strait of Hormuz closure.",
    "link": "https://www.wishtv.com/news/business/increase-oil-production-iran-airstrikes/",
    "timestamp": "2025-06-23T19:10:25Z"
  },
  {
    "title": "A Brief, Bloody History of All the Times the U.S. Caused Chaos in the Middle East",
    "description": "The conflict with Iran is the latest in a decadeslong series of regime change operations, long-term entanglements, and all-out wars that always seem to invite more problems.",
    "link": "https://reason.com/2025/06/23/a-brief-bloody-history-of-all-the-times-the-u-s-caused-chaos-in-the-middle-east/",
    "timestamp": "2025-06-23T19:09:37Z"
  },
  {
    "title": "Gulf States want no winner in the conflict between Israel and Iran",
    "description": "Gulf states have long sought to contain Tehran through diplomacy rather than pursuing regime change.",
    "link": "https://theconversation.com/gulf-states-want-no-winner-in-the-conflict-between-israel-and-iran-259471",
    "timestamp": "2025-06-23T19:09:25Z"
  },
  {
    "title": "Why Democrats Can’t Get On the Same Page on Trump’s Iran Strike",
    "description": "Prominent Democrats including AOC, Chuck Schumer, and John Fetterman are at odds over the correct response to Trump's Iran strike. Here's why",
    "link": "https://time.com/7296889/iran-attack-democrat-aoc-trump/",
    "timestamp": "2025-06-23T19:07:27Z"
  }
]