[
  {
    "title": "Trump Job Approval: 38%...",
    "description": "Trump Job Approval: 38%...\r\n\n \n \n \n (Top headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:ICE prepares more raids in Dem sanctuaries... Developing...\r\nFarmworkers flee fields...\r\nMexican Flags Become Republican Fodder, but Protesters Keep Waving...\r\nRa…",
    "link": "https://poll.qu.edu/poll-release?releaseid=3924",
    "timestamp": "2025-06-11T22:43:36Z"
  },
  {
    "title": "Oracle Sees ‘Dramatically Higher’ Sales, Boosting Cloud Momentum",
    "description": "(Bloomberg) -- Oracle Corp. projected cloud infrastructure sales will jump more than 70% in the fiscal year that began this month, boosting shares in late...",
    "link": "https://finance.yahoo.com/news/oracle-sees-dramatically-higher-sales-224325821.html",
    "timestamp": "2025-06-11T22:43:25Z"
  },
  {
    "title": "James Mattis' statement allegedly condemning Trump's actions during 2025 LA protests published 5 years earlier",
    "description": "Former U.S. Secretary of Defense James Mattis wrote a statement titled “In Union There Is Strength” in which he condemned President Donald Trump’s actions regarding the 2025 immigration protests in Los Angeles.",
    "link": "https://www.snopes.com//fact-check/trump-la-protests-mattis-statement/",
    "timestamp": "2025-06-11T22:43:00Z"
  },
  {
    "title": "CAA Amplify Summit Tackles ICE Raids, DEI Rollback, Allyship and Our ‘New Chapter of Resistance’",
    "description": "\"We know that lives will change because of what we decide to do next, so let's commit to each other,\" CAA Foundation executive director Natalie Tran says\nThe post CAA Amplify Summit Tackles ICE Raids, DEI Rollback, Allyship and Our ‘New Chapter of Resistance’…",
    "link": "https://www.thewrap.com/caa-amplify-summit-2025-ice-raids-dei-rollback-trump/",
    "timestamp": "2025-06-11T22:42:16Z"
  },
  {
    "title": "Walmart heiress Christy Walton paid for NYT anti-Trump protest ad. Here's everything we know",
    "description": "Walmart heiress Christy Walton paid for a newspaper advertisement in The New York Times that promoted an anti-Trump “No Kings” protest on June 14, 2025.",
    "link": "https://www.snopes.com//fact-check/trump-walmart-heiress-nyt-protest-ad/",
    "timestamp": "2025-06-11T22:42:00Z"
  },
  {
    "title": "Newsom v Trump holds promise and peril for California governor",
    "description": "Democrat Gavin Newsom has not been afraid to square off against the president - but this confrontational strategy is not without political risk.",
    "link": "https://www.bbc.com/news/articles/c1ld3pzg2n2o",
    "timestamp": "2025-06-11T22:39:20Z"
  },
  {
    "title": "L.A. Mayor Bass Claims ICE Raids to Blame for Riots, Looting",
    "description": "Los Angeles Mayor Karen Bass (D) claimed that immigration raids conducted in Los Angeles on Friday are to blame for the rioting and looting that has occurred in the city.\nThe post L.A. Mayor Bass Claims ICE Raids to Blame for Riots, Looting appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/06/11/l-a-mayor-bass-claims-ice-raids-to-blame-for-riots-looting/",
    "timestamp": "2025-06-11T22:36:11Z"
  },
  {
    "title": "Trump's former Commerce Secretary, Wilbur Ross, says the US-China deal is still far from comprehensive",
    "description": "Wilbur Ross says the US-China deal is modest and incomplete.\nREUTERS/Carlos Barria\nWilbur Ross, Trump's first-term Secretary of Commerce, says the US-China deal is modest and incomplete.\nPresident Donald Trump posted on social media, saying that the US-China …",
    "link": "https://biztoc.com/x/67399eba9d5a2f40",
    "timestamp": "2025-06-11T22:32:56Z"
  },
  {
    "title": "Who Has Been Spending The Money To Equip The Protesters In Los Angeles With Brand New Riot Gear?",
    "description": "If the protests in Los Angeles are supposed to be peaceful, why is brand-new riot gear being trucked in and given to the protesters?  And why isn’t this making front-page news all over the country?  First of all, protesters only need riot gear if riots are go…",
    "link": "https://www.shtfplan.com/headline-news/who-has-been-spending-the-money-to-equip-the-protesters-in-los-angeles-with-brand-new-riot-gear",
    "timestamp": "2025-06-11T22:30:50Z"
  },
  {
    "title": "Silicon Valley city makes homeless people eligible for arrest if they refuse 3 offers of shelter",
    "description": "It's among the stricter anti-encampment deterrents proposed by elected officials since the Supreme Court in 2023 made it easier to ban homeless people from camping on public property.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_f9a76506-2e54-5393-ac7c-696e01ec1583.html",
    "timestamp": "2025-06-11T22:30:00Z"
  },
  {
    "title": "Silicon Valley city makes homeless people eligible for arrest if they refuse 3 offers of shelter",
    "description": "It's among the stricter anti-encampment deterrents proposed by elected officials since the Supreme Court in 2023 made it easier to ban homeless people from camping on public property.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_483a9a0b-a734-5bde-95d3-cd67b9e91565.html",
    "timestamp": "2025-06-11T22:30:00Z"
  },
  {
    "title": "'Like a British comedy': Nicolle Wallace mocks Trump with dramatic reading",
    "description": "MSNBC host Nicolle Wallace ridiculed President Donald Trump and Commerce Secretary Howard Lutnick during her Wednesday show while talking about the trade deals the administration promised would happen in 90 days. Ahead of a commercial break, Wallace spoke to …",
    "link": "https://www.rawstory.com/90-deals-in-90-days/",
    "timestamp": "2025-06-11T22:27:46Z"
  },
  {
    "title": "Trans Mountain Eyes Pipeline Capacity Increase by Early 2027",
    "description": "The Trans Mountain pipeline could handle an additional 75,000 barrels of crude a day by a early 2027, the government-owned company’s top executive said, potentially helping Canadian oil producers expand shipments to non-US markets.",
    "link": "https://financialpost.com/pmn/business-pmn/trans-mountain-eyes-pipeline-capacity-increase-by-early-2027",
    "timestamp": "2025-06-11T22:27:27Z"
  },
  {
    "title": "Dakota Johnson, Chris Evans, And Pedro Pascal Are A Press Tour Masterclass For ‘Materialists’",
    "description": "When I graduated college in 2012 and started my first full-time job, pop culture was at a pinnacle I now find myself nostalgic for. That year gave us Taylor Swift’s Vogue interview turned coo…",
    "link": "https://thoughtcatalog.com/nicole-stawiarski/2025/06/dakota-johnson-chris-evans-and-pedro-pascal-are-a-press-tour-masterclass-for-materialists/",
    "timestamp": "2025-06-11T22:27:15Z"
  },
  {
    "title": "Trump ends ‘Quiet Skies’ traveler surveillance program | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> The Trump administration is ending a counterterrorism program used to conduct surveillance on air travelers, contending that the program had been exploited to target conservatives, including Hawaii’s Tulsi Gabbard, while failing to stop \nany att…",
    "link": "https://www.staradvertiser.com/2025/06/11/hawaii-news/trump-ends-quiet-skies-traveler-surveillance-program/",
    "timestamp": "2025-06-11T22:26:24Z"
  },
  {
    "title": "Judge rules Trump admin cannot continue to detain Palestinian activist Mahmoud Khalil",
    "description": "The judge is staying his injunction until Friday to allow the Department of Homeland Security time to appeal the decision.",
    "link": "https://abcnews.go.com/US/judge-rules-trump-administration-cannot-continue-detain-mahmoud-khalil/story?id=122750911",
    "timestamp": "2025-06-11T22:26:19Z"
  },
  {
    "title": "Trump's former Commerce Secretary, Wilbur Ross, says the US-China deal is still far from comprehensive",
    "description": "President Donald Trump said the deal with China is \"done.\"  His former Commerce Secretary told Business Insider it's far from comprehensive.",
    "link": "https://www.businessinsider.com/wilbur-ross-says-us-china-deal-is-far-from-comprehensive-2025-6",
    "timestamp": "2025-06-11T22:23:42Z"
  },
  {
    "title": "A 'shadow' Fed chair could be coming. Who it could be and how markets might react.",
    "description": "Under normal circumstances, moderating inflation and a weakening labor market would make an easy case for interest rate cuts",
    "link": "https://www.nbcnews.com/business/economy/shadow-fed-chair-coming-markets-might-react-rcna212424",
    "timestamp": "2025-06-11T22:22:00Z"
  },
  {
    "title": "US-China framework of agreed-upon measures; Zhangjiajie trash; AUKUS blowing up?",
    "description": "The American and Chinese negotiators agreed on framework of measures to get back to the framework they thought they agreed on in Geneva a couple of weeks ago. It sounds like the PRC side has agreed to resume exports of rare earth magnets to civilian end users…",
    "link": "https://sinocism.com/p/us-china-framework-of-agreed-upon",
    "timestamp": "2025-06-11T22:19:46Z"
  },
  {
    "title": "BREAKING - Protesters have taken over the streets of Chicago, completely halting traffic, with Chicago Mayor Brandon Johnson refusing to take any action.",
    "description": "BREAKING - Protesters have taken over the streets of Chicago, completely halting traffic, with Chicago Mayor Brandon Johnson refusing to take any action.",
    "link": "https://freerepublic.com/focus/f-chat/4322481/posts",
    "timestamp": "2025-06-11T22:15:51Z"
  },
  {
    "title": "Three cheers for the US-China trade war ceasefire",
    "description": "Yay! High-level US-China talks in London this week reached a reached a trade-war ceasefire, offering some stability for nervous markets.",
    "link": "https://nypost.com/2025/06/11/opinion/three-cheers-for-the-us-china-trade-war-ceasefire/",
    "timestamp": "2025-06-11T22:15:40Z"
  },
  {
    "title": "From a 'day of love' to 'if they spit, we will hit': Trump's about-face on violence against police (Natasha Korecki/NBC News)",
    "description": "Natasha Korecki / NBC News:\nFrom a ‘day of love’ to ‘if they spit, we will hit’: Trump's about-face on violence against police  —  The way Trump has responded to protests in California is very different than how he treated the Jan. 6, 2021, riot at the U.S. C…",
    "link": "https://www.memeorandum.com/250611/p139",
    "timestamp": "2025-06-11T22:15:01Z"
  },
  {
    "title": "Judge says government must release Columbia University protester Mahmoud Khalil",
    "description": "Khalil's lawyers challenged the legality of his detention, accusing the Trump administration of trying to crack down on free speech.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_8df06ea2-ae40-544b-b870-c81e6e88cb80.html",
    "timestamp": "2025-06-11T22:15:00Z"
  },
  {
    "title": "Dispatches From the Death Chamber",
    "description": "A conversation with Elizabeth Bruenig about murder and forgiveness",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/06/execution-america-prison-death-row/683140/",
    "timestamp": "2025-06-11T22:15:00Z"
  },
  {
    "title": "Claims spread Trump wore catheter at UFC event. Here's what we know",
    "description": "The president has been the subject of numerous rumors about his health.",
    "link": "https://www.snopes.com//news/2025/06/11/trump-ufc-catheter/",
    "timestamp": "2025-06-11T22:14:00Z"
  },
  {
    "title": "Will Modi’s Trip to Canada Boost Bilateral Relations?",
    "description": "Tensions have recently abated, but New Delhi and Ottawa remain far apart on the issue that triggered them.",
    "link": "http://foreignpolicy.com/2025/06/11/india-canada-modi-carney-g7-trip-sikh-separatism/",
    "timestamp": "2025-06-11T22:13:47Z"
  },
  {
    "title": "Trump Claims ‘Great And Important’ Tariff Court Win: Here’s Why That’s Wrong",
    "description": "President Donald Trump hailed an appeals court ruling keeping his tariffs in place temporarily as a “great and important win” ...",
    "link": "https://biztoc.com/x/2dd5d2986896bc58",
    "timestamp": "2025-06-11T22:13:01Z"
  },
  {
    "title": "Mark Levin Accuses Tucker ‘Qatarlson’ Of Leaking ‘And Planting Stories’ About Him: ‘A Desperate Man’",
    "description": "Tucker Carlson, a longtime dove, has attacked Mark Levin in recent weeks over his hawkish stance on Iran and for being pro-Israel.\nThe post Mark Levin Accuses Tucker ‘Qatarlson’ Of Leaking ‘And Planting Stories’ About Him: ‘A Desperate Man’ first appeared on …",
    "link": "https://www.mediaite.com/media/mark-levin-accuses-tucker-qatarlson-of-leaking-and-planting-stories-about-him-a-desperate-man/",
    "timestamp": "2025-06-11T22:12:58Z"
  },
  {
    "title": "Trump and Thune grow closer as 'big, beautiful' vote nears",
    "description": "The News\nIt’s not exactly a good cop-bad cop routine, but Donald Trump and John Thune are tag-teaming to get the GOP’s “big, beautiful bill” passed with the president’s biggest priorities intact.\nWhile the Senate majority leader doesn’t lean on his relationsh…",
    "link": "https://biztoc.com/x/ea38446a6924580c",
    "timestamp": "2025-06-11T22:11:02Z"
  },
  {
    "title": "US, China Agree on Rare Earths Deal, White House Says",
    "description": "President Donald Trump announced that a trade framework with China has been completed, with Beijing supplying rare earths and magnets \"UP FRONT\" and the US allowing Chinese students into its colleges and universities. The US and China will maintain tariffs at…",
    "link": "https://biztoc.com/x/6cd0c5b9f4cf5b27",
    "timestamp": "2025-06-11T22:10:46Z"
  },
  {
    "title": "Democrats are in the polling dumps — fighting America on this key demand",
    "description": "The Democratic Party's vision of government dependency spurred their most notable policies of recent years, and explains their intransigent opposition to Republican reforms.",
    "link": "https://nypost.com/2025/06/11/opinion/democrats-woeful-polls-fighting-america-on-this-key-demand/",
    "timestamp": "2025-06-11T22:09:53Z"
  },
  {
    "title": "Report: State Dept. orders crisis drills for missions in range of Iran",
    "description": "According to The Washington Post, the US State Department has ordered embassies within striking distance of Iranian assets across the Middle East, Eastern Europe, and Northern Africa to convene emergency action committees.",
    "link": "https://www.israelnationalnews.com/news/409839",
    "timestamp": "2025-06-11T22:09:14Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Wednesday marked a losing session on Wall Street, with the S&P 500 snapping its three-day win streak, as did the Nasdaq Composite.",
    "link": "https://www.cnbc.com/2025/06/11/stock-market-today-live-updates.html",
    "timestamp": "2025-06-11T22:08:23Z"
  },
  {
    "title": "Live: Oil prices leap on Middle East tensions, ASX set to rise",
    "description": "Oil prices have leapt to two-month highs, with Brent crude up 5 per cent. On Wall Street, stocks fell as traders mulled the outcome of US-China trade talks. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-06-12/asx-markets-business-live-news-june-12-2025/105406510",
    "timestamp": "2025-06-11T22:08:04Z"
  },
  {
    "title": "Downtown LA set for second night of curfew as Trump crackdown expands",
    "description": "Los Angeles remained the epicenter of the protests, which have triggered roughly 600 arrests since the weekend and led to clashes with law enforcement.",
    "link": "https://www.japantimes.co.jp/news/2025/06/12/world/politics/la-second-curfew-trump-crackdown/",
    "timestamp": "2025-06-11T22:07:00Z"
  },
  {
    "title": "Yes, an iPhone Could Cost More Than $2,200 With Tariffs. Should You Buy One Now?",
    "description": "The latest tariff announcement doesn't change much, but you should still expect prices to increase. Here's how to save if you're shopping for one.",
    "link": "https://www.cnet.com/personal-finance/taxes/yes-an-iphone-could-cost-more-than-2200-with-tariffs-should-you-buy-one-now/",
    "timestamp": "2025-06-11T22:02:00Z"
  },
  {
    "title": "Connecticut Bans State and Local Governments From Investing in Crypto Assets",
    "description": "The state of Connecticut is barring itself and its local governments from being able to invest in digital assets. Connecticut has passed House Bill 7082, which bans state and local governments from being able to invest in crypto assets as well as accept them …",
    "link": "https://dailyhodl.com/2025/06/11/connecticut-bans-state-and-local-governments-from-investing-in-crypto-assets/",
    "timestamp": "2025-06-11T22:01:42Z"
  },
  {
    "title": "Trump tells judge he does not need Newsom’s permission to crack down on rioters, deploy National Guard",
    "description": "Trump lawyers told the court that Trump has \"no obligation\" to consult, or even notify California Gov. Newsom before federalizing National Guard troops to quell anti-ICE protests.",
    "link": "https://www.foxnews.com/politics/trump-tells-judge-he-does-not-need-newsoms-permission-crack-down-rioters-deploy-national-guard",
    "timestamp": "2025-06-11T22:00:37Z"
  },
  {
    "title": "WHERE'S DONIE? CNN's Emmy-Nominated 'Extremism' Reporter Goes Missing Amid Outburst of Left-Wing Violence",
    "description": "Donie O'Sullivan is a senior correspondent for CNN who purports to be an expert on political \"extremism\" in America. The esteemed journalist earned an Emmy nomination for his three-part series, MisinfoNation: Extreme America, in which he traveled \"around the …",
    "link": "https://freebeacon.com/media/wheres-donie-cnns-emmy-nominated-extremism-reporter-goes-missing-amid-outburst-of-left-wing-violence/",
    "timestamp": "2025-06-11T22:00:23Z"
  },
  {
    "title": "Barron Trump 'best friend' claims he gotworld's most followed TikToker deported...",
    "description": "BARRON Trump’s bestie has been gloating about getting TikTok star Khaby Lame kicked out of America. Immigration agents detained the popular influencer for allegedly overstaying his visa. Bo L…",
    "link": "https://www.the-sun.com/news/14453775/barron-trumps-friend-helped-tiktoker-khaby-lame-deported-us/",
    "timestamp": "2025-06-11T22:00:03Z"
  },
  {
    "title": "Soldiers Who Cheered President's Political Attacks While in Uniform Were Checked for Allegiance, Appearance...",
    "description": "As President Donald Trump viciously attacked his perceived political foes, he whipped up boos from the gathered troops directed at California leaders, including Gov. Gavin Newsom.",
    "link": "https://www.military.com/daily-news/2025/06/11/bragg-soldiers-who-cheered-trumps-political-attacks-while-uniform-were-checked-allegiance-appearance.html",
    "timestamp": "2025-06-11T22:00:03Z"
  },
  {
    "title": "Court Rejects Challenge to Trump's Executive Orders on Anti-Semitism",
    "description": "From Monday's decision by Judge Douglas Harpool (W.D. Mo.) in McClanahan v. Trump, which I think reaches the correct result: \nOn December 11, 2019, President Donald Trump issued Executive Order 13899, directing federal agencies to use the International Holoca…",
    "link": "https://biztoc.com/x/4de209bd4aedd535",
    "timestamp": "2025-06-11T21:59:55Z"
  },
  {
    "title": "The deep irony of Trump attending the Kennedy Center's 'Les Misérables' opening",
    "description": "Donald Trump is attending the opening of Les Miserables at the Kennedy Center despite its plot involving French student protesters launching a revolution.",
    "link": "https://biztoc.com/x/a838b42c47cd0185",
    "timestamp": "2025-06-11T21:59:53Z"
  },
  {
    "title": "Disapproval of Democrats in Congress Ticks Upward—New Poll",
    "description": "A Quinnipiac University poll shows disapproval of congressional Democrats has increased since February.",
    "link": "https://www.newsweek.com/disapproval-rating-democrats-congress-poll-2084270",
    "timestamp": "2025-06-11T21:59:21Z"
  },
  {
    "title": "‘Oof…Just Bad Stuff All Around’: CNN’s Data Guru Shocked by Trump’s Brutally Low New Approval Rating",
    "description": "The latest poll by Quinnipiac University had some grim numbers across the board for President Donald Trump, shocking CNN chief data analyst Harry Enten, who described it as \"definitely one of Trump's worst polls.\"\nThe post ‘Oof…Just Bad Stuff All Around’: CNN…",
    "link": "https://www.mediaite.com/politics/trump/oof-just-bad-stuff-all-around-cnns-data-guru-shocked-by-trumps-brutally-low-new-approval-rating/",
    "timestamp": "2025-06-11T21:58:31Z"
  },
  {
    "title": "Say again? Obama DHS secretary praises Trump’s border work",
    "description": "Janet Napolitano notes the president's actions have been 'useful'",
    "link": "https://www.wnd.com/2025/06/say-again-obama-dhs-secretary-praises-trumps-border-work/",
    "timestamp": "2025-06-11T21:57:20Z"
  },
  {
    "title": "Trump Screened Troops Standing Behind Him At Fort Bragg For Looks, Beliefs: Report",
    "description": "Partisan merch was also sold on base, including an item that read, \"White Privilege Card: Trumps Everything.\"",
    "link": "https://www.huffpost.com/entry/trump-screened-troops-standing-behind-him-at-fort-bragg-for-looks-beliefs-report_n_6849e126e4b0f2259d60aa3d",
    "timestamp": "2025-06-11T21:55:17Z"
  },
  {
    "title": "I'm Tracking 11 Key Products for Tariff Price Changes: Here's What You Need to Know",
    "description": "Trump's latest tariff moves will send rates against China back up to 55%, so CNET is continuing to keep an eye on the prices of several key products.",
    "link": "https://www.cnet.com/tech/im-tracking-11-key-products-for-tariff-price-changes-heres-what-you-need-to-know/",
    "timestamp": "2025-06-11T21:55:00Z"
  },
  {
    "title": "Elon Musk says some of his social media posts about Trump 'went too far' - NPR",
    "description": "Elon Musk says some of his social media posts about Trump 'went too far'NPR Trump Live Updates: Elon Musk Apology, Pete Hegseth Hearings and MoreThe New York Times Elon Musk called Donald Trump before expressing 'regret' for harsh attacksUSA Today Tesla stock…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178013299",
    "timestamp": "2025-06-11T21:52:56Z"
  },
  {
    "title": "U.S. and China De-escalate Supply Chain War—for Now",
    "description": "This will give factories a temporary reprieve, but both sides could still leverage economic chokepoints in the future absent a larger deal.",
    "link": "http://foreignpolicy.com/2025/06/11/us-china-trade-truce-trump-rare-earths-supply-chain-tariffs/",
    "timestamp": "2025-06-11T21:52:18Z"
  },
  {
    "title": "Ukraine’s Blitz Launches War in Dangerous New Direction",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Ukraine’s Blitz Launches War in Dangerous New Direction appeared first …",
    "link": "https://www.dailysignal.com/2025/06/11/ukraines-blitz-launches-war-in-dangerous-new-direction/",
    "timestamp": "2025-06-11T21:51:44Z"
  },
  {
    "title": "This Supreme Court Decision Might End Up Displacing Families For Good",
    "description": "Future access to gender-affirming care for transgender youth is in the hands of the Supreme Court — and the stakes couldn't be higher.",
    "link": "https://www.huffpost.com/entry/this-supreme-court-decision-might-end-up-displacing-families-for-good_n_6849ded7e4b03de6beafce6e",
    "timestamp": "2025-06-11T21:46:36Z"
  },
  {
    "title": "GM doubles down on American manufacturing with $4B investment",
    "description": "General Motors' investment will increase US production.",
    "link": "https://nypost.com/2025/06/11/business/gm-doubles-down-on-american-manufacturing-with-4b-investment/",
    "timestamp": "2025-06-11T21:45:30Z"
  },
  {
    "title": "Judge Says Government Must Release Columbia University Protester Mahmoud Khalil",
    "description": "The judge gave the government until Friday to appeal the decision.",
    "link": "https://www.huffpost.com/entry/mahmoud-khalil-ruling_n_6849f842e4b0cf5f0c9b0523",
    "timestamp": "2025-06-11T21:45:22Z"
  },
  {
    "title": "Reacting to ICE raids, Church in Mexico reminds: ‘Not all undocumented migrants are criminals’",
    "description": "Migrants walk alongside the railroad tracks after dismounting from the “La Bestia” train, which they rode through Mexico to reach the Mexico-U.S. border near Chihuahua, Mexico. / Credit: David Peinado Romero/Shutterstock\n\nPuebla, Mexico, Jun 11, 2025 / 17:44 …",
    "link": "https://www.catholicnewsagency.com/news/264691/reacting-to-ice-raids-church-in-mexico-reminds-not-all-undocumented-migrants-are-criminals",
    "timestamp": "2025-06-11T21:44:00Z"
  },
  {
    "title": "CNN’s Scott Jennings Calls California a ‘Failed State.’ It Just Became the World’s 4th Largest Economy",
    "description": "California's \"nominal GDP grew at a rate of 6% in 2024, outpacing the U.S.’ 5.3% rate, China’s 2.6% rate and Germany’s 2.9% rate”\nThe post CNN’s Scott Jennings Calls California a ‘Failed State.’ It Just Became the World’s 4th Largest Economy first appeared on…",
    "link": "https://www.mediaite.com/politics/cnns-scott-jennings-calls-california-a-failed-state-it-just-became-the-worlds-4th-largest-economy/",
    "timestamp": "2025-06-11T21:43:04Z"
  },
  {
    "title": "Springsteen's Berlin concert echoes with history and a stark warning",
    "description": "Veteran rock star Bruce Springsteen, a high-profile critic of President Donald Trump, slammed the U.S. administration as “corrupt, incompetent and treasonous” during a concert Wednesday in Berlin. He was addressing tens of thousands of fans at a stadium built…",
    "link": "https://japantoday.com/category/entertainment/springsteen%27s-berlin-concert-echoes-with-history-and-a-stark-warning",
    "timestamp": "2025-06-11T21:42:57Z"
  },
  {
    "title": "RFK ousts all 17 members of a vaccine advisory panel",
    "description": "Health and Human Services Sec. Robert F. Kennedy Jr. ousted all 17 members of a vaccine advisory board this week. It's a move that's been roundly condemned by the public health community and cheered by Kennedy's \"Make America Healthy Again\" base. <br><br>This…",
    "link": "https://www.npr.org/2025/06/11/1253992711/npr-politics-podcast-rfk-vaccines-acip-maha",
    "timestamp": "2025-06-11T21:42:24Z"
  },
  {
    "title": "Viral Graphic Makes False, Questionable Claims About House Reconciliation Bill",
    "description": "A viral graphic warns that if the House-passed reconciliation bill becomes law, \"we won't have another election.\" But there is no evidence to support that or some of the graphic's underlying claims about \"what's coming\" if the Senate also approves the legisla…",
    "link": "https://www.factcheck.org/2025/06/viral-graphic-makes-false-questionable-claims-about-house-reconciliation-bill/",
    "timestamp": "2025-06-11T21:41:56Z"
  },
  {
    "title": "[Eugene Volokh] Court Rejects Challenge to Trump's Executive Orders on Anti-Semitism",
    "description": "One of the Orders calls on federal agencies to use the International Holocaust Remembrance Alliance definition, which would label certain criticisms of Israel as anti-Semitic.",
    "link": "https://reason.com/volokh/2025/06/11/court-rejects-challenge-to-trumps-executive-orders-on-anti-semitism/",
    "timestamp": "2025-06-11T21:41:55Z"
  },
  {
    "title": "Newsom’s Threat That California Might Withhold Federal Taxes Called ‘Reckless,’ ‘a New Low’",
    "description": "Republican members of Congress on Wednesday assailed Democrat California Gov. Gavin Newsom’s suggesting that it might be time for his state to cut off taxpayer... Read More\nThe post Newsom’s Threat That California Might Withhold Federal Taxes Called ‘Reckless…",
    "link": "https://www.dailysignal.com/2025/06/11/congress-reacts-newsoms-suggestion-ca-withhold-taxes/",
    "timestamp": "2025-06-11T21:40:00Z"
  },
  {
    "title": "Trump’s team takes aim at a major climate rule",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is attacking Biden-era polici…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/416555/trump-epa-climate-environmental-regulation-coal-gas",
    "timestamp": "2025-06-11T21:39:39Z"
  },
  {
    "title": "IOC leaders praise Los Angeles amid unrest in 2028 Olympics host city",
    "description": "Olympic officials meeting Wednesday in Switzerland took a calm, longer view of the 2028 Summer Games in Los Angeles after days of images of deployed military and burning cars on the host city’s streets. IOC president Thomas Bach praised the strength of the ci…",
    "link": "https://japantoday.com/category/sports/ioc-leaders-praise-los-angeles-amid-unrest-in-2028-olympics-host-city",
    "timestamp": "2025-06-11T21:39:24Z"
  },
  {
    "title": "Polish Prime Minister Donald Tusk survives vote of confidence as he bids to reassert control",
    "description": "Prime Minister Donald Tusk’s government survived a vote of confidence in the Polish parliament on Wednesday, with supporters rising and applauding him and chanting his name. Lawmakers voted 243-210 in favor of the government. There were no abstentions. Tusk r…",
    "link": "https://japantoday.com/category/world/donald-tusk-makes-his-case-before-a-confidence-vote-in-poland",
    "timestamp": "2025-06-11T21:38:58Z"
  },
  {
    "title": "U.S. preparing to partially evacuate Iraq embassy over regional security risks, sources say",
    "description": "The United States is preparing a partial evacuation of its Iraqi embassy and will allow military dependents to leave locations around the Middle East due to heightened security risks in the region, U.S. and Iraqi sources said on Wednesday. The four U.S. and t…",
    "link": "https://japantoday.com/category/world/us-preparing-to-partially-evacuate-iraq-embassy-over-regional-security-risks-sources-say2",
    "timestamp": "2025-06-11T21:38:50Z"
  },
  {
    "title": "Fulbright board resigns citing interference by Trump administration",
    "description": "All members of the board that oversees the U.S. State Department's Fulbright Program, which facilitates international educational exchanges, have voted to resign over alleged political interference from President Donald Trump's administration, the board said …",
    "link": "https://japantoday.com/category/world/fulbright-board-resigns-citing-interference-by-trump-administration2",
    "timestamp": "2025-06-11T21:38:39Z"
  },
  {
    "title": "Musk-Trump Truce Sends Dogecoin Skyward, With Ethereum Along for the Ride: Analysis",
    "description": "Dogecoin skyrocketed after Elon Musk’s surprise apology to Trump amid fresh ETF optimism for the crypto market's leading meme coin.",
    "link": "https://decrypt.co/324715/musk-trump-truce-dogecoin-ethereum-price-analysis",
    "timestamp": "2025-06-11T21:38:33Z"
  },
  {
    "title": "Deal getting U.S.-China trade truce back on track is done, Trump says",
    "description": "A deal getting the fragile truce in the U.S.-China trade war back on track is done, U.S. President Donald Trump said on Wednesday, after negotiators from Washington and Beijing agreed on a framework covering tariff rates. The deal also removes Chinese export …",
    "link": "https://japantoday.com/category/world/deal-getting-us-china-trade-truce-back-on-track-is-done-trump-says",
    "timestamp": "2025-06-11T21:38:32Z"
  },
  {
    "title": "Trump administration reviewing Biden-era submarine pact with Australia, UK",
    "description": "U.S. President Donald Trump's administration has launched a formal review of a defense pact worth hundreds of billions of dollars that former President Joe Biden made with Australia and the United Kingdom, allowing Australia to acquire conventionally armed nu…",
    "link": "https://japantoday.com/category/world/trump-administration-reviewing-biden-era-submarine-pact-with-australia-uk",
    "timestamp": "2025-06-11T21:38:18Z"
  },
  {
    "title": "Musk regrets some of his Trump criticisms; says they 'went too far'",
    "description": "Elon Musk, the world's richest person and Donald Trump's former advisor, said Wednesday he regretted some of his recent criticisms of the U.S. president, after the pair's public falling-out last week. &quot;I regret some of my posts about President @realDonal…",
    "link": "https://japantoday.com/category/world/musk-regrets-some-of-his-trump-criticisms-says-they-%27went-too-far%27",
    "timestamp": "2025-06-11T21:38:02Z"
  },
  {
    "title": "LA Protests Pit Gavin Newsom as Antagonist Against Donald Trump",
    "description": "",
    "link": "https://biztoc.com/x/b37f983467c18a25",
    "timestamp": "2025-06-11T21:37:58Z"
  },
  {
    "title": "Nintendo says sales of its Switch 2 hit a record within four days",
    "description": "NEW YORK (AP) — Nintendo says it sold more than 3.5 million of its new Switch 2 gaming consoles within the first four days since its release — breaking a record for the company. In a Wednesday announcement, Nintendo said that this marks the “highest global sa…",
    "link": "https://financialpost.com/pmn/nintendo-says-sales-of-its-switch-2-hit-a-record-within-four-days",
    "timestamp": "2025-06-11T21:37:52Z"
  },
  {
    "title": "Police detain more than 20 people on first night of curfew in downtown Los Angeles",
    "description": "Police detained more than 20 people, mostly on curfew violations, on the first night of restrictions in downtown Los Angeles and used crowd-control projectiles to break up hundreds of protesters demonstrating against President Donald Trump’s immigration crack…",
    "link": "https://japantoday.com/category/world/Police-detain-more-than-20-people-on-first-night-of-curfew-in-downtown-Los-Angeles",
    "timestamp": "2025-06-11T21:37:09Z"
  },
  {
    "title": "After Iran Threat Over Nuclear Talks, US Evacuating Dependents and Non-Essential Staff from Embassies and Bases in Iraq, Kuwait and Bahrain",
    "description": "In response to a threat by Iran to attack U.S. bases in the region, the State and Defense Departments have authorized the evacuation of dependents and non-essential staff from embassies and bases in the region, mainly Iraq, Kuwait and Bahrain. The threat by I…",
    "link": "https://freerepublic.com/focus/f-news/4322471/posts",
    "timestamp": "2025-06-11T21:36:24Z"
  },
  {
    "title": "WH tries to clarify Trump's threat to use force on 'any' military parade protesters",
    "description": "The White House attempted to clarify Donald Trump's call for the use of force on \"any\" protesters who show up at the parade celebrating the Army's 250th anniversary.",
    "link": "https://abcnews.go.com/Politics/white-house-clarify-trumps-threat-heavy-force-military/story?id=122746297",
    "timestamp": "2025-06-11T21:35:43Z"
  },
  {
    "title": "Los Angeles protests follow weeks of intensifying immigration enforcement",
    "description": "The Pentagon's deployment of about 700 Marines to Los Angeles to join the National Guard's response to immigration protests follows weeks of rapid-fire developments as President Donald Trump pursues his top domestic priority for mass deportations. Stephen Mil…",
    "link": "https://japantoday.com/category/features/opinions/los-angeles-protests-follow-weeks-of-intensifying-immigration-enforcement",
    "timestamp": "2025-06-11T21:33:26Z"
  },
  {
    "title": "Operation Secure: INTERPOL dismantles 20,000+ malicious IPs in major cybercrime crackdown",
    "description": "INTERPOL announced that a joint operation code-named Operation Secure took down 20,000+ malicious IPs/domains tied to 69 info-stealers. Between January and April 2025, INTERPOL led Operation Secure, a global effort that took down over 20,000 malicious IPs and…",
    "link": "https://securityaffairs.com/178898/cyber-crime/operation-secure-interpol-dismantles-20000-malicious-ips-in-major-cybercrime-crackdown.html",
    "timestamp": "2025-06-11T21:32:49Z"
  },
  {
    "title": "‘No Fat Soldiers’: Military Pre-Screened Troops at Trump’s Fort Bragg Rally For Looks and Loyalty, Per Shocking Report",
    "description": "The Trump Administration handpicked soldiers based on appearance and political leaning for Trump's visit to Fort Bragg on Tuesday, according to a shocking new report.\nThe post ‘No Fat Soldiers’: Military Pre-Screened Troops at Trump’s Fort Bragg Rally For Loo…",
    "link": "https://www.mediaite.com/media/news/no-fat-soldiers-military-pre-screened-troops-at-trumps-fort-bragg-rally-for-looks-and-loyalty-per-shocking-report/",
    "timestamp": "2025-06-11T21:32:42Z"
  },
  {
    "title": "The deep irony of Trump attending the Kennedy Center's 'Les Misérables' opening",
    "description": "Donald Trump is attending the opening of Les Miserables at the Kennedy Center despite its plot involving French student protesters launching a revolution.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-les-miserables-kennedy-center-rcna212408",
    "timestamp": "2025-06-11T21:30:46Z"
  },
  {
    "title": "Why Trump could be the X factor in New Jersey: From the Politics Desk",
    "description": "Steve Kornacki looks at the role President Donald Trump will play in the New Jersey gubernatorial race now that the general election is set.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-x-factor-new-jersey-politics-desk-rcna212474",
    "timestamp": "2025-06-11T21:30:00Z"
  },
  {
    "title": "Poll: Americans Really, Really Hate Trump’s Big Beautiful Bill",
    "description": "A new Quinippiac poll shows that a majority of Americans are opposed to Trump’s One Big Beautiful Bill Act, confirming public aversion to a budget bill expected to add $2.4 trillion to the deficit, give a tax break to wealthy people and corporations, and slas…",
    "link": "https://newrepublic.com/post/196715/poll-americans-hate-trump-big-beautiful-bill-medicaid",
    "timestamp": "2025-06-11T21:29:53Z"
  },
  {
    "title": "Donald Trump's Approval Rating Is Slipping, Polls Show",
    "description": "Trump's overall approval rating has dipped in the latest poll, but the president is seeing massive gains on immigration.",
    "link": "https://www.newsweek.com/donald-trumps-approval-rating-slipping-polls-show-2084265",
    "timestamp": "2025-06-11T21:28:34Z"
  },
  {
    "title": "What do we know about the US-China trade deal?",
    "description": "At 55 percent, the tariffs are still high, but some experts expect they will drop further.",
    "link": "https://www.aljazeera.com/economy/2025/6/11/what-do-we-know-about-the-us-china-trade-deal",
    "timestamp": "2025-06-11T21:27:20Z"
  },
  {
    "title": "Trump’s use of the military to suppress protest is, like Trump himself, not popular",
    "description": "Everyone is aware of the phenomenon where articles in the news section of the Wall Street Journal provides readers with information efficiently debunking ridiculous claims made in the crank op-ed pages. At the New York Times, this can run the other direction.…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/trumps-use-of-the-military-to-suppress-protest-is-like-trump-himself-not-popular",
    "timestamp": "2025-06-11T21:26:00Z"
  },
  {
    "title": "‘Went Too Far’: Musk Apologizes To Trump After Public Feud",
    "description": "“I regret some of my posts about President @realDonaldTrump …”After a week of public feuding, billionaire entrepreneur Elon Musk delivered an apology to President Donald Trump via his X platform during the early morning hours Wednesday. Musk, who recently del…",
    "link": "https://freerepublic.com/focus/f-news/4322468/posts",
    "timestamp": "2025-06-11T21:24:01Z"
  },
  {
    "title": "Karoline Leavitt Snaps At Reporter For ‘Stupid Question’ About Peaceful Protests",
    "description": "The White House press secretary was quizzed about Trump saying protests during Saturday’s military parade will be met with “very heavy force.”",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-reporter-peaceful-protests-military-parade_n_6849d690e4b0f2259d609b45",
    "timestamp": "2025-06-11T21:21:55Z"
  },
  {
    "title": "MSNBC host tells Colbert that Trump has started to ‘f— around with the military’",
    "description": "MSNBC host Nicolle Wallace said Tuesday that it felt different to have President Donald Trump \"f--- around with the military\" in his second term during an interview with late-night host Stephen Colbert.",
    "link": "https://nypost.com/2025/06/11/media/msnbc-host-tells-colbert-that-trump-has-started-to-f-around-with-the-military/",
    "timestamp": "2025-06-11T21:19:28Z"
  },
  {
    "title": "Waters: Trump Started L.A. Riots, 'He Should Not Continue to Support Violence'",
    "description": "Representative Maxine Waters (D-CA) claimed Wednesday on CNN's \"News Central\" that President Donald Trump caused the Los Angeles immigration unrest.\nThe post Waters: Trump Started L.A. Riots, ‘He Should Not Continue to Support Violence’ appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2025/06/11/waters-trump-started-l-a-riots-he-should-not-continue-to-support-violence/",
    "timestamp": "2025-06-11T21:19:09Z"
  },
  {
    "title": "Live: AUKUS 'all or nothing' for Australia, ex-ambassador warns amid US review",
    "description": "A former ambassador to the US has warned AUKUS is \"all or nothing\" for Australia amid a review of security pact. Follow live.",
    "link": "https://www.abc.net.au/news/2025-06-12/federal-politics-live-june-12/105405484",
    "timestamp": "2025-06-11T21:19:07Z"
  },
  {
    "title": "How Indo-Pacific Allies Can Be ‘Model Allies’: Secretary Hegseth at Shangri-La",
    "description": "During his address at the Shangri-La Dialogue summit in Singapore May 31, Secretary of Defense Pete Hegseth touted Poland, the Baltic States, Israel, and the... Read More\nThe post How Indo-Pacific Allies Can Be ‘Model Allies’: Secretary Hegseth at Shangri-La …",
    "link": "https://www.dailysignal.com/2025/06/11/how-indo-pacific-allies-can-be-model-allies-secretary-hegseth-at-shangri-la/",
    "timestamp": "2025-06-11T21:17:32Z"
  },
  {
    "title": "Will Trump Weaken Washington’s Power To Tax?",
    "description": "It’s obvious that Donald Trump is a different president. His divergence from the norm manifests itself in various ways. He’s even broached the possibility of eliminating the Internal Revenue Service. Count us among the tens if not hundreds of millions of Amer…",
    "link": "https://biztoc.com/x/710c3d45dbaa7972",
    "timestamp": "2025-06-11T21:15:46Z"
  },
  {
    "title": "Bessent floats extending tariff pause for countries in 'good faith' trade talks",
    "description": "Treasury Secretary Scott Bessent signaled the Trump administration’s openness on Wednesday to extending President Donald Trump’s current 90-day tariff pause beyond July 9 for the United States’ top trading partners, as long as they show “good faith” in ongoin…",
    "link": "https://biztoc.com/x/9bcec915492ebb0c",
    "timestamp": "2025-06-11T21:15:43Z"
  },
  {
    "title": "Can Trump Really Use National Guard to Quell LA Protests?",
    "description": "President Donald Trump’s decision to deploy thousands of California National Guard troops and hundreds of active-duty Marines to Los Angeles amid protests against immigration raids marks a sharp departure from the usual federal response to domestic unrest.\nTh…",
    "link": "https://biztoc.com/x/eb8067afd5082a08",
    "timestamp": "2025-06-11T21:15:38Z"
  }
]