[
  {
    "title": "Gaza's Besieged Doctors Reveal 'Very Dark' Crisis On October 7 Milestone",
    "description": "Talks to stop the war in Gaza are still underway, two years on from the start of the brutal conflict that has mauled the densely populated strip and its two million inhabitants. If you believe President Donald Trump, there's a \"really good chance\" of a deal.\n…",
    "link": "https://biztoc.com/x/a61acab86c3ee615",
    "timestamp": "2025-10-07T15:11:07Z"
  },
  {
    "title": "Grilled Pam Bondi refuses to deny that Tom Homan kept $50K in FBI sting",
    "description": "Attorney General Pam Bondi declined to deny that President Donald Trump's border czar, Tom Homan, accepted $50,000 in cash during an FBI sting operation.On Tuesday, Sen. Sheldon Whitehouse (D-RI) questioned Bondi about the cash Homan allegedly received from F…",
    "link": "https://www.rawstory.com/pam-bondi-tom-homan/",
    "timestamp": "2025-10-07T15:09:55Z"
  },
  {
    "title": "Trump's farmer bailout raises concern about trade war 'winners and losers'",
    "description": "Plans to spend billions of dollars supporting farmers have frustrated many other kinds of businesses that have also been hurt by tariffs.",
    "link": "https://www.bbc.com/news/articles/c3rvy3z3rllo",
    "timestamp": "2025-10-07T15:08:00Z"
  },
  {
    "title": "Paddington creators sue after Spitting Image depicts him as crude podcast host",
    "description": "It follows Spitting Image creating a parody version of the children's character for its YouTube series.",
    "link": "https://www.bbc.com/news/articles/ckgq7klz7evo",
    "timestamp": "2025-10-07T15:06:13Z"
  },
  {
    "title": "AG Bondi: Trump's Crime Crackdown Yields 3,837 Arrests in D.C. and 273 in Memphis",
    "description": "U.S. Attorney General Pam Bondi revealed crime statistics on Monday as President Donald Trump works to protect American cities and their residents. \nThe post AG Bondi: Trump’s Crime Crackdown Yields 3,837 Arrests in D.C. and 273 in Memphis appeared first on B…",
    "link": "https://www.breitbart.com/crime/2025/10/07/ag-bondi-trumps-crime-crackdown-yields-3837-arrests-in-d-c-and-273-in-memphis/",
    "timestamp": "2025-10-07T15:06:13Z"
  },
  {
    "title": "S&P 500 Drifts Higher as Traders Await Fed Speakers for Rate Cue",
    "description": "US stocks crept higher on Tuesday to trade at record levels following their best winning streak since May. Investors are looking past the government shutdown, which is entering a seventh day, as announcements tied to artificial intelligence continued to prope…",
    "link": "https://financialpost.com/pmn/business-pmn/sp-500-drifts-higher-as-traders-await-fed-speakers-for-rate-cue",
    "timestamp": "2025-10-07T15:05:49Z"
  },
  {
    "title": "Gold tops $4K for first time as investors flee inflation, global turmoil",
    "description": "Prices have soared more than 50% this year, fueled by fears of a prolonged funding crisis in Washington.",
    "link": "https://nypost.com/2025/10/07/business/gold-tops-4k-for-first-time-as-investors-flee-inflation-global-turmoil/",
    "timestamp": "2025-10-07T15:05:08Z"
  },
  {
    "title": "Trump slams ‘absolutely ridiculous’ decision to have Bad Bunny do Super Bowl halftime show",
    "description": "The Puerto Rican superstar was announced as the Super Bowl 2026 halftime performer last month.",
    "link": "https://nypost.com/2025/10/07/sports/trump-slams-absolutely-ridiculous-bad-bunny-super-bowl-halftime-decision/",
    "timestamp": "2025-10-07T15:04:16Z"
  },
  {
    "title": "Trump's GOP seizes on violent rhetoric from Virginia AG candidate as high-stakes elections loom",
    "description": "RICHMOND, Va. (AP) — Republicans are seizing on recently unearthed violent rhetoric from Virginia's Democratic candidate for attorney general in a push to re-shape the state's governor's race — and tarnish the Democratic Party nationally — less than a month b…",
    "link": "https://freerepublic.com/focus/f-news/4344856/posts",
    "timestamp": "2025-10-07T15:02:24Z"
  },
  {
    "title": "Lithium Americas (LAC) Touches New High, Then Loses Momentum After ‘Sell’ Reco",
    "description": "We recently published 10 Stocks Investors Are Dumping. Lithium Americas Corp. (NYSE:LAC) is one of the worst performers on Monday. Lithium Americas fell by...",
    "link": "https://finance.yahoo.com/news/lithium-americas-lac-touches-high-150158657.html",
    "timestamp": "2025-10-07T15:01:58Z"
  },
  {
    "title": "Former Surgeons General Say It's Their Duty to Warn of 'Profound' Threat RFK Jr. Poses to Americans",
    "description": "Six former US surgeons general, who have worked across multiple presidential administrations, said Tuesday that they have a duty to warn Americans that US Health and Human Services Secretary Robert F. Kennedy Jr. is a danger to the health of the public.In a j…",
    "link": "https://www.commondreams.org/news/rfk-jr-surgeons-general",
    "timestamp": "2025-10-07T15:01:00Z"
  },
  {
    "title": "Trump Ends Diplomacy Wit Venezuela, Gearing Up For Escalation",
    "description": "Tensions between the United States and Venezuela have flared lately as the Pentagon continues to strike civilian boats in international waters allegedly carrying illegal drugs and headed toward the U.S. coastline. President Donald Trump has also commanded the…",
    "link": "https://www.shtfplan.com/headline-news/trump-ends-diplomacy-wit-venezuela-gearing-up-for-escalation",
    "timestamp": "2025-10-07T15:00:51Z"
  },
  {
    "title": "(Impress Watch, 10/8) 緇茘宴篋キ膩 ...",
    "description": "(Impress Watch, 10/8) 緇茘宴篋キ膩⑥絲若カ若綽九墾⒢パｃ劫с源篏茘絎uup吾≪膩泣ケ眼uup宴腆阪с",
    "link": "http://www.st.ryukoku.ac.jp/~kjm/security/memo/2025/10.html#20251008__luup",
    "timestamp": "2025-10-07T15:00:00Z"
  },
  {
    "title": "(CNET, 10/8) Windows 11サ≪若カ若❼c罘 ...",
    "description": "(CNET, 10/8) Windows 11サ≪若カ若❼c罘プ吾 篁ｃ若ォ「ヲ潟羈ev/Betaс鴻 (腦 10/7)",
    "link": "http://www.st.ryukoku.ac.jp/~kjm/security/memo/2025/10.html#20251008__win11",
    "timestamp": "2025-10-07T15:00:00Z"
  },
  {
    "title": "Trump is greenlighting an Alaska megamine—and taking a government stake in the company digging it up",
    "description": "President Donald Trump on Monday ordered approval of a proposed 211-mile road through an Alaska wilderness to allow mining of copper, cobalt, gold and other minerals.\nThe long-debated Ambler Road project was approved in Trump’s first term, but was later block…",
    "link": "https://biztoc.com/x/4055e44890993fd3",
    "timestamp": "2025-10-07T14:59:06Z"
  },
  {
    "title": "Disgusting Trump Tells Navy He Must 'Take Care' Of Democrat 'Little Gnats'",
    "description": "During a speech at the Norfolk Naval Base in Virginia marking the 250th anniversary of the U.S. Navy, Donald Trump left his critics and military leaders aghast by breaking protocol to active duty service members by telling them he needs to \"take care of the\" …",
    "link": "https://crooksandliars.com/2025/10/disgusting-trump-calls-democratic-party",
    "timestamp": "2025-10-07T14:58:48Z"
  },
  {
    "title": "Bondi Does Not Deny Epstein Had Pics Of Trump With 'Half-Naked Young Women'",
    "description": "Attorney General Pam Bondi tried to fend off tough questions on the Justice Department’s investigations of Donald Trump’s rivals and her flip-flop decision to hold back the release of more information on convicted sex offender Jeffrey Epstein as she sat for h…",
    "link": "https://crooksandliars.com/2025/10/bondi-does-not-deny-epstein-had-pics-trump",
    "timestamp": "2025-10-07T14:58:47Z"
  },
  {
    "title": "AG Bondi stonewalls question about Trump mentions in Epstein files at Senate hearing",
    "description": "The Trump administration for months has faced criticism for refusing to release files about Jeffrey Epstein, a former friend of President Trump.",
    "link": "https://www.cnbc.com/2025/10/07/pam-bondi-stonewalls-question-about-trump-mentions-in-epstein-files.html",
    "timestamp": "2025-10-07T14:55:51Z"
  },
  {
    "title": "CNN’s Kaitlin Collins Reveals What Staffers Dread Most About Traveling With Trump",
    "description": "CNN’s chief White House correspondent Kaitlan Collins has offered a revealing glimpse into what staffers dread most about traveling with President Donald Trump – the fact that he “does not sleep.” Speaking on Jason Tartick’s Trading Secrets podcast on Monday,…",
    "link": "https://freerepublic.com/focus/f-chat/4344854/posts",
    "timestamp": "2025-10-07T14:55:02Z"
  },
  {
    "title": "Pam Bondi repeats claim that triggered MAGA meltdown",
    "description": "Attorney General Pam Bondi clammed up during a Senate committee hearing on Tuesday after being pressed on an alleged order\r\n given to FBI agents in an apparent attempt to shield President Donald Trump from being exposed for his relationship with Jeffrey Epste…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674161957/",
    "timestamp": "2025-10-07T14:54:48Z"
  },
  {
    "title": "Trump says Diddy asked him for a pardon",
    "description": "Diddy's lawyers want him sent to FCI Fort Dix, a low-security federal prison in NJ. Also, President Trump told reporters that Sean Combs had asked him for a pardon.",
    "link": "https://www.fox5ny.com/news/nj-sean-diddy-combs-pardon-trump-fci-fort-dix-prison",
    "timestamp": "2025-10-07T14:53:29Z"
  },
  {
    "title": "Is America Contagious?",
    "description": "In late September, Hungarian Prime Minister Viktor Orbán announced a crackdown on a relatively new foe: antifa, which he said would be designated as a “terrorist organization.” This was, on its face, ridiculous, given that antifa is an ideology, not an organi…",
    "link": "https://www.motherjones.com/politics/2025/10/is-america-contagious/",
    "timestamp": "2025-10-07T14:52:39Z"
  },
  {
    "title": "Kimmel Roasts Trump After Beating Him in Approval Poll: “Lower Than Diddy and Diarrhea”",
    "description": "In an Economist and YouGov poll of 1,656 adult US citizens, Kimmel beat Trump by 16 points.\nKimmel Roasts Trump After Beating Him in Approval Poll: “Lower Than Diddy and Diarrhea”\nEddie Fu",
    "link": "https://consequence.net/2025/10/jimmy-kimmel-donald-trump-approval-poll/",
    "timestamp": "2025-10-07T14:51:13Z"
  },
  {
    "title": "Rs 13,000 crore at just 19: How Barron Trump built his teen fortune empire while still in college",
    "description": "At just 19, Barron Trump, the youngest son of Donald and Melania Trump, has amassed a net worth of around Rs 13,000 crore ($150 million), largely through cryptocurrency ventures. He played a key role in introducing his father to digital wallets and co-founded…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/rs-13000-crore-at-just-19-how-barron-trump-built-his-teen-fortune-empire-while-still-in-college/articleshow/124364568.cms",
    "timestamp": "2025-10-07T14:49:56Z"
  },
  {
    "title": "Kamala Harris ACCUSED Of Being Drunk On Her Book Tour!!",
    "description": "Kamala Harris’ Book Tour Sparks Concern — Fans Say the Former VP Appeared ‘Inebriated’ During Public Talks Vice President Kamala Harris is back in the public eye — this time not on the campaign trail, but on a nationwide book tour promoting her brand-new memo…",
    "link": "https://mediatakeout.com/kamala-harris-accused-of-being-drunk-on-her-book-tour/",
    "timestamp": "2025-10-07T14:49:29Z"
  },
  {
    "title": "Trump and his team add the NFL to its growing list of culture war targets",
    "description": "Given football's popularity, common sense might suggest that Donald Trump would be eager to align himself with the NFL. He just can't seem to help himself.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-nfl-culture-war-targets-rcna236136",
    "timestamp": "2025-10-07T14:49:02Z"
  },
  {
    "title": "Trump turned the shutdown into spectacle. That's not helping him",
    "description": "When the government shuts down, Congress usually takes the blame. But President Donald Trump's love of the spotlight has backfired among voters who blame him.",
    "link": "https://biztoc.com/x/1fb65a119a56f106",
    "timestamp": "2025-10-07T14:47:56Z"
  },
  {
    "title": "Trump is greenlighting an Alaska megamine—and taking a government stake in the company digging it up",
    "description": "While Trump has often said, “drill, baby, drill,” he also supports “mine, baby, mine,” Interior Secretary Doug Burgum said.",
    "link": "https://fortune.com/2025/10/07/trump-alaska-megamine-ambler-road-mine-trilogy-metals-stake/",
    "timestamp": "2025-10-07T14:47:11Z"
  },
  {
    "title": "Gold Hits $4,000 For The First Time—Here’s Why",
    "description": "One economist recommended investors store wealth in the precious metal as an economic haven, while others warned of uncertainty.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/07/gold-hits-4000-for-the-first-time-heres-why/",
    "timestamp": "2025-10-07T14:46:33Z"
  },
  {
    "title": "War on cartels? White House says it has an iron-clad case to strike narco-terrorist groups",
    "description": "White House says President Donald Trump has clear legal authority to strike drug cartels after deadly Caribbean raids, calling traffickers \"unlawful combatants.\"",
    "link": "https://www.foxnews.com/politics/war-cartels-white-house-says-has-iron-clad-case-strike-narcoterrorist-groups",
    "timestamp": "2025-10-07T14:45:51Z"
  },
  {
    "title": "Why talk of a “stalemate” in Ukraine misses the bigger picture",
    "description": "This is the war the West can’t win, can’t end, and can’t afford Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626032-war-west-cant-win/",
    "timestamp": "2025-10-07T14:44:36Z"
  },
  {
    "title": "​Pam Bondi stonewalls senator with pointblank refusal to discuss Epstein list",
    "description": "Attorney General Pam Bondi told a Democratic senator she would not answer any of his questions about FBI agents being told to flag any records about President Donald Trump in files on sex offender Jeffrey Epstein.During a Senate Judiciary Committee hearing on…",
    "link": "https://www.rawstory.com/bondi-durbin-epstein/",
    "timestamp": "2025-10-07T14:42:44Z"
  },
  {
    "title": "WTO downgrades global trade growth forecast to 0.5% for next year",
    "description": "GENEVA: The World Trade Organization sharply lowered its 2026 forecast for global merchandise trade volume growth to 0.5 per cent on Tuesday (Oct 7), citing expected delayed impacts from US President Donald Trump's tariffs.It marks a significant revision down…",
    "link": "https://www.channelnewsasia.com/business/world-trade-organization-downgrades-global-trade-growth-forecast-5388336",
    "timestamp": "2025-10-07T14:42:02Z"
  },
  {
    "title": "Hearing Watch: Will AG Pam Bondi Own Up To Her Conflicts of Interest?",
    "description": "This morning, corporate lobbyist turned U.S. Attorney General Pamela Bondi faces Senate Judiciary Committee questioning for the first time since her confirmation. The hearing comes as “[m]ore than 275 former Justice Department employees are demanding Congress…",
    "link": "https://www.commondreams.org/newswire/hearing-watch-will-ag-pam-bondi-own-up-to-her-conflicts-of-interest",
    "timestamp": "2025-10-07T14:41:43Z"
  },
  {
    "title": "Under Bondi's Leadership, DOJ Has Become the White House's Revenge Arm",
    "description": "Today Attorney General Pam Bondi is testifying before Congress amid mounting concerns that the Justice Department under her leadership is being weaponized to go after President Trump's perceived enemies. Lisa Gilbert, co-president of Public Citizen, issued th…",
    "link": "https://www.commondreams.org/newswire/under-bondi-s-leadership-doj-has-become-the-white-house-s-revenge-arm",
    "timestamp": "2025-10-07T14:40:25Z"
  },
  {
    "title": "Johnson: Trump supports shutdown backpay idea",
    "description": "United States House Speaker Mike Johnson insisted on Tuesday that President Donald Trump supports the idea of staff furloughed due to the ongoing government shutdown receiving back pay, having signed ...",
    "link": "https://biztoc.com/x/988be6d5de0ed5c4",
    "timestamp": "2025-10-07T14:37:21Z"
  },
  {
    "title": "Polymarket Valued at $9 Billion After NYSE Owner Invests $2B in Prediction Market",
    "description": "Polymarket said that Intercontinental Exchange would boost the prediction market's distribution following a $2 billion investment in the firm.",
    "link": "https://decrypt.co/343228/polymarket-valued-9-billion-nyse-owner-invests-2b-prediction-market",
    "timestamp": "2025-10-07T14:36:41Z"
  },
  {
    "title": "Billionaire Trump Donor Paulson Scores Windfall Thanks To Government’s Investment In Trilogy Metals",
    "description": "One of Donald Trump’s earliest supporters on Wall Street owns a stake in the tiny mining business that tripled overnight on news of the government’s investment.",
    "link": "https://www.forbes.com/sites/hanktucker/2025/10/07/billionaire-trump-donor-paulson-scores-windfall-thanks-to-governments-investment-in-trilogy-metals/",
    "timestamp": "2025-10-07T14:36:33Z"
  },
  {
    "title": "President Trump Says That ‘Puff Daddy’ Reached Out To Him And Asked For A Pardon",
    "description": "President Donald Trump has revealed that disgraced rapper and producer Sean ‘Diddy’ Combs reached out to him to ask for a pardon. Trump also said that he still calls Diddy by the moniker he went by in the 1990s, “Puff Daddy.” While fielding a question about C…",
    "link": "https://brobible.com/culture/article/trump-puff-daddy-asked-for-pardon/",
    "timestamp": "2025-10-07T14:36:27Z"
  },
  {
    "title": "Pritzker: Trump’s Goal Is Use Military to Confiscate Ballot Boxes to Steal 2026 Elections",
    "description": "On Monday, during an appearance on MSNBC's \"The Rachel Maddow Show,\" Gov. JB Pritzker (D-IL) said that the Trump administration was normalizing the presence of the military in cities, allowing them to use these forces to confiscate ballot boxes and recount vo…",
    "link": "https://www.breitbart.com/clips/2025/10/07/pritzker-trumps-goal-is-use-military-to-confiscate-ballot-boxes-to-steal-2026-elections/",
    "timestamp": "2025-10-07T14:36:10Z"
  },
  {
    "title": "Stock Market Today: S&P 500 In Search of 8th Consecutive Green Day Amid Gov't Shutdown",
    "description": "We'll be missing export, imports, and balance of trade data today because of the gov't closure",
    "link": "https://www.thestreet.com/markets/stock-market-today-october-7-2025",
    "timestamp": "2025-10-07T14:35:58Z"
  },
  {
    "title": "Canadian Prime Minister Mark Carney to meet Trump as tensions over trade war continue",
    "description": "Canadian Prime Minister Mark Carney to meet Trump as tensions over trade war continuego.com",
    "link": "https://abcnews.go.com/Politics/canadian-prime-minister-mark-carney-meet-trump-tensions/story?id=126288331",
    "timestamp": "2025-10-07T14:35:25Z"
  },
  {
    "title": "Italy to propose global ceasefire for 2026 Winter Olympics",
    "description": "A global truce for the duration of February's 2026 Milano Cortina Winter Olympics will be sought by hosts Italy.",
    "link": "https://www.aljazeera.com/sports/2025/10/7/italy-to-propose-global-ceasefire-for-2026-winter-olympics",
    "timestamp": "2025-10-07T14:35:06Z"
  },
  {
    "title": "Senator Durbin critiques attorney general Pam Bondi for politicizing DOJ and dismantling key divisions",
    "description": "Senator Dick Durbin has sharply criticized Attorney General Pam Bondi. He alleged she weaponized the Justice Department to shield President Trump and his allies. Durbin claimed Bondi forced out hundreds of experienced officials and dismantled key investigativ…",
    "link": "https://economictimes.indiatimes.com/news/international/us/senator-durbin-critiques-attorney-general-pam-bondi-for-politicizing-doj-and-dismantling-key-divisions/articleshow/124365791.cms",
    "timestamp": "2025-10-07T14:31:05Z"
  },
  {
    "title": "Trump Is Effortlessly Destroying Washington’s International Influence",
    "description": "Alfred McCoy\n\n\n\nWith Congress compliant, the Supreme Court complicit, and media corporations compromised, Trump has forged a clear path to international irrelevance.\r\n\n\r\n\n\nThe post Trump Is Effortlessly Destroying Washington’s International Influence appeared…",
    "link": "https://www.thenation.com/article/world/trump-foreign-policy-international-relations/",
    "timestamp": "2025-10-07T14:31:03Z"
  },
  {
    "title": "Stephen Miller Forced to Watch AOC Call Him a 4’10 Troll on Live TV",
    "description": "In an awkward end to his Fox News appearance on Monday night, White House deputy chief of staff Stephen Miller was shown a video of him being ridiculed by Democratic Representative Alexandria Ocasio-Cortez.Ocasio-Cortez on Sunday held an hour-long livestream …",
    "link": "https://newrepublic.com/post/201416/stephen-miller-fox-news-aoc-short-troll-live-tv",
    "timestamp": "2025-10-07T14:30:28Z"
  },
  {
    "title": "Trump Plays Shockingly Dumb (Even for Him) on Ghislaine Maxwell",
    "description": "Pardoning Ghislaine Maxwell is apparently back on the table, per the president.The Supreme Court tossed out the convicted sex trafficker’s appeal request Monday, unanimously declining to hear Maxwell’s attempt to reverse her 20-year prison sentence for aiding…",
    "link": "https://newrepublic.com/post/201423/donald-trump-plays-dumb-ghislaine-maxwell-pardon",
    "timestamp": "2025-10-07T14:29:44Z"
  },
  {
    "title": "George Conway warns 'mad at the world' aide has 'figured out how to push Trump's buttons'",
    "description": "Conservative attorney George Conway, one of President Donald Trump's loudest critics since early in his first term, warned Mondayd that one person in the president's orbit may be steering him more than anyone else.During a panel discussion on MSNBCs' \"The Wee…",
    "link": "https://www.rawstory.com/mad-at-the-world-trump-aide-has-maneuvered-his-way-to/",
    "timestamp": "2025-10-07T14:29:18Z"
  },
  {
    "title": "Trump turned the shutdown into spectacle. That's not helping him.",
    "description": "When the government shuts down, Congress usually takes the blame. But President Donald Trump's love of the spotlight has backfired among voters who blame him.",
    "link": "https://www.msnbc.com/news/news-analysis/trump-shutdown-blame-project-47-newsletter-rcna235861",
    "timestamp": "2025-10-07T14:29:03Z"
  },
  {
    "title": "Gold futures rise above $4,000 per ounce for the first time",
    "description": "Investors seek a “safe haven” for to park their money as the U.S. government shutdown continues.",
    "link": "https://www.bostonherald.com/2025/10/07/gold-prices-reach-new-milestone/",
    "timestamp": "2025-10-07T14:27:22Z"
  },
  {
    "title": "One question dominates conversations in Gaza: 'When will the war end?'",
    "description": "Palestinians have been reflecting on the toll on their lives since Hamas's attack on Israel on 7 October 2023, which triggered the war.",
    "link": "https://www.bbc.com/news/articles/czjvzxn0ekko",
    "timestamp": "2025-10-07T14:27:03Z"
  },
  {
    "title": "Rosie O’Donnell applies for Irish citizenship, White House says it’s ‘great news for America’",
    "description": "Rosie O’Donnell is applying for Irish citizenship amid her ongoing feud with President Donald Trump. In an interview with the UK’s Daily Telegraph, the 63-year-old comedian explained she is putting herself in “self-imposed (political exile)” in Ireland after …",
    "link": "https://freerepublic.com/focus/f-chat/4344844/posts",
    "timestamp": "2025-10-07T14:23:53Z"
  },
  {
    "title": "Public TV stations to benefit from Bob Ross painting auction",
    "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations. The Bonhams auction is to begin Nov. 11 in Los Angeles with three of the paintings. Other auctions will follow. All profits will help public TV stations with licensing…",
    "link": "https://apnews.com/article/bob-ross-auction-public-television-1029c1e91ac55d8030e6847310cebc59",
    "timestamp": "2025-10-07T14:23:40Z"
  },
  {
    "title": "Gold prices keep rising, and jewelry companies are sounding the alarm",
    "description": "Some jewelry companies who aim to offer gold pieces at lower price points are beginning to sound the alarm on higher prices for the precious metal.",
    "link": "https://www.cnbc.com/2025/10/07/gold-prices-jewelry.html",
    "timestamp": "2025-10-07T14:23:20Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Torches CNN For ‘New Dark Low’ On Trump",
    "description": "A weird interview with the president really riled the anchor.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-torches-cnn-new-dark-low-trump_n_68e4efcfe4b0b4dea1b66ef6",
    "timestamp": "2025-10-07T14:21:33Z"
  },
  {
    "title": "Republicans Caught Using Fake Image to Lie for Trump About Portland",
    "description": "President Donald Trump called Portland a war zone last week, and now state Republicans are trying to deliver one—by sharing fake photos of a fake riot. The official social media accounts of the Oregon Republican Party shared an image Sunday showing a crowd of…",
    "link": "https://newrepublic.com/post/201418/republicans-caught-fake-image-donald-trump-portland-riots",
    "timestamp": "2025-10-07T14:21:05Z"
  },
  {
    "title": "First half of 2025 sees renewables generate more electricity than coal",
    "description": "Global electricity demand increased 2.6%, or 369 TWh, in the first half of 2025 compared with the same period in 2024, which was more than met by a 306 TWh increase in solar power and a 97 TWh in wind power output.",
    "link": "https://www.thehindubusinessline.com/news/first-half-of-2025-sees-renewables-generate-more-electricity-than-coal/article70136054.ece",
    "timestamp": "2025-10-07T14:20:58Z"
  },
  {
    "title": "Blaming Russia Won’t Stop the Populist Right",
    "description": "Russian meddling and disinformation have been an important subtext of recent European elections in Moldova and the Czech Republic, as well as in earlier elections where right-wing populists have done well. But fixation on the Kremlin obscures a deeper, more t…",
    "link": "https://www.project-syndicate.org/commentary/russia-not-behind-popular-support-for-right-wing-parties-by-maciej-kisilowski-2025-10",
    "timestamp": "2025-10-07T14:20:38Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Confronts Trump To His Face on Rants Torpedoing Case Against Comey",
    "description": "CNN anchor Kaitlan Collins confronted President Donald Trump to his face about the potential for his frequent rants to torpedo the case against James Comey.\nThe post CNN’s Kaitlan Collins Confronts Trump To His Face on Rants Torpedoing Case Against Comey firs…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-confronts-trump-to-his-face-on-rants-torpedoing-case-against-comey/",
    "timestamp": "2025-10-07T14:20:05Z"
  },
  {
    "title": "Trump attempt to bully cities into working with ICE runs headfirst into wall: report",
    "description": "The threats and bullying that Donald Trump has successfully used against major law firms, educational institutions and media empires are increasingly falling flat when it comes to mayors of major cities, according to a report Tuesday.According to a report fro…",
    "link": "https://www.rawstory.com/trump-ice-2674161573/",
    "timestamp": "2025-10-07T14:17:52Z"
  },
  {
    "title": "WATCH LIVE: Trump holds meeting with Canada’s Carney as relationship between allies hits low point",
    "description": "Carney's second visit to the White House on Tuesday comes ahead of a review of the free trade agreement, which is critical to Canada's economy.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-holds-meeting-with-canadas-carney-as-relationship-between-allies-hits-low-point",
    "timestamp": "2025-10-07T14:15:35Z"
  },
  {
    "title": "The White House issues joyful statement after Rosie O’Donnell applies for Irish citizenship",
    "description": "Former daytime talk show host and POTUS have been feuding for decades",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/rosie-odonnell-trump-white-house-citizenship-b2840953.html",
    "timestamp": "2025-10-07T14:15:09Z"
  },
  {
    "title": "Legal Battles Rage Over National Guard Deployments To 5 States - What To Know",
    "description": "Legal Battles Rage Over National Guard Deployments To 5 States - What To Know\n \nAuthored by Sam Dorman via The Epoch Times (emphasis ours),\nPresident Donald Trump has announced his intent to send National Guard troops to major cities across the United States …",
    "link": "https://biztoc.com/x/7641b8ae315a6a6e",
    "timestamp": "2025-10-07T14:14:50Z"
  },
  {
    "title": "Gaza peace talks enter their second day on the war’s anniversary",
    "description": "The second day of talks on Tuesday are taking place on the two-year anniversary of Hamas's surprise attack on Israel that triggered the war.",
    "link": "https://www.pbs.org/newshour/world/gaza-peace-talks-enter-their-second-day-on-the-wars-anniversary",
    "timestamp": "2025-10-07T14:14:37Z"
  },
  {
    "title": "Gold futures rise above $4,000 per ounce for the first time",
    "description": "NEW YORK (AP) — Gold futures rose above $4,000 per ounce for the first time on Tuesday as many investors seek a “safe haven” for to park their money as the U.S. government shutdown continues. Gold futures in New York briefly jumped above the $4,000 mark just …",
    "link": "https://financialpost.com/pmn/gold-futures-rise-above-4000-per-ounce-for-the-first-time-2",
    "timestamp": "2025-10-07T14:14:29Z"
  },
  {
    "title": "Trump Admin Reportedly Floats Selling Parts Of $1.6 Trillion Federal Student Loan Portfolio",
    "description": "The Trump admin is considering selling off parts of the federal government’s $1.6 trillion student loan portfolio to the private market, according to Politico.",
    "link": "https://dailycaller.com/2025/10/07/trump-admin-reportedly-considering-selling-part-of-student-loan-debt/",
    "timestamp": "2025-10-07T14:14:25Z"
  },
  {
    "title": "More Trump Jackbootery? Body Camera Video Betrays DHS Account of Chicago Border Patrol Shooting, Attorney Says",
    "description": "More evidence of Trump law enforcement officials using unwarranted violence, here shooting, against protestors.",
    "link": "https://www.nakedcapitalism.com/2025/10/more-trump-jackbootery-body-camera-video-betrays-dhs-account-of-chicago-border-patrol-shooting-attorney-says.html",
    "timestamp": "2025-10-07T14:13:54Z"
  },
  {
    "title": "Gold futures rise above $4,000 per ounce for the first time",
    "description": "Gold futures rose above $4,000 per ounce for the first time on Tuesday, as many investors seek a “safe haven” for to park their money as the U.S. government shutdown continues",
    "link": "https://abcnews.go.com/Business/wireStory/gold-futures-rise-4000-ounce-time-126289013",
    "timestamp": "2025-10-07T14:13:48Z"
  },
  {
    "title": "Jimmy Kimmel Taunts Trump With New Poll Showing the President Is Less Popular Than the Late Night Host | Video",
    "description": "\"The guy who keeps saying I have no ratings? Well, that makes two of us,\" the ABC host jokes\nThe post Jimmy Kimmel Taunts Trump With New Poll Showing the President Is Less Popular Than the Late Night Host | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-more-popular-than-trump-poll-taunt/",
    "timestamp": "2025-10-07T14:13:48Z"
  },
  {
    "title": "‘Release the Hostages, End the Suffering’, Says Secretary-General, Marking 7 October Anniversary",
    "description": "Following is UN Secretary-General António Guterres’ message to mark two years since the 7 October 2023 attacks:",
    "link": "https://press.un.org/en/2025/sgsm22854.doc.htm",
    "timestamp": "2025-10-07T14:13:03Z"
  },
  {
    "title": "Facepalm: CNN couldn't find any pictures of rioting in Portland or Chicago for their Insurrection Act Explainer, so they took one from Los Angeles. FARK: In 1992 [Facepalm]",
    "description": "Facepalm: CNN couldn't find any pictures of rioting in Portland or Chicago for their Insurrection Act Explainer, so they took one from Los Angeles. FARK: In 1992",
    "link": "https://www.fark.com/comments/13836806/Facepalm-CNN-couldnt-find-any-pictures-of-rioting-in-Portland-Chicago-for-their-Insurrection-Act-Explainer-so-they-took-one-from-Los-Angeles-FARK-In-1992",
    "timestamp": "2025-10-07T14:12:21Z"
  },
  {
    "title": "Bob Ross paintings to be auctioned to support public TV stations after federal cuts",
    "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bob-ross-paintings-auctioned-support-public-tv-stations-126291683",
    "timestamp": "2025-10-07T14:09:20Z"
  },
  {
    "title": "Gold futures rise above $4,000 per ounce for the first time",
    "description": "NEW YORK (AP) — Gold futures rose above $4,000 per ounce for the first time on Tuesday as many investors seek a “safe haven” for to park their money as the U.S. government shutdown continues. Gold futures in New York briefly jumped above the $4,000 mark just …",
    "link": "https://financialpost.com/pmn/gold-futures-rise-above-4000-per-ounce-for-the-first-time",
    "timestamp": "2025-10-07T14:08:01Z"
  },
  {
    "title": "Jane Goodall Recorded a Message About Elon Musk Before Her Death",
    "description": "\"Bruh, if Jane Goodall roasts you in her final farewell, you done goofed.\"\nThe post Jane Goodall Recorded a Message About Elon Musk Before Her Death appeared first on Futurism.",
    "link": "https://futurism.com/future-society/jane-goodall-message-elon-musk",
    "timestamp": "2025-10-07T14:07:43Z"
  },
  {
    "title": "New IRS CEO is also head of the Social Security Administration. Here's why that dual role worries some experts",
    "description": "The new IRS CEO, Frank Bisignano, is also Commissioner of the Social Security Administration. Here's why the dual role worries policy experts, consumer advocates.",
    "link": "https://www.cnbc.com/2025/10/07/new-irs-ceo-heads-social-security.html",
    "timestamp": "2025-10-07T14:07:41Z"
  },
  {
    "title": "The Epstein Files: A Political Ticking Time Bomb",
    "description": "The summer of 2025 was a very eventful season for the US as the Department of Justice (DOJ) notified US President Donald Trump that he appeared multiple times in the Epstein files. Congress is involved and has formed committees. There has been backlash from T…",
    "link": "https://www.fairobserver.com/world-news/us-news/the-epstein-files-a-political-ticking-time-bomb/",
    "timestamp": "2025-10-07T14:07:15Z"
  },
  {
    "title": "President Trump Weighs In On Mark Sanchez Stabbing, 'Something Bad Happened'",
    "description": "Word of the Mark Sanchez stabbing has made it all the way to the Oval Office ... with President Donald Trump sharing his two cents on the former NFL quarterback's arrest. No. 45-47 addressed the wild story during his appearance on Greg Kelly…\n Permalink",
    "link": "https://www.tmz.com/2025/10/07/president-trump-mark-sanchez-stabbing/",
    "timestamp": "2025-10-07T14:07:11Z"
  },
  {
    "title": "Trump's threat to invoke Insurrection Act escalates showdown with Democratic cities",
    "description": "(Reuters) -Donald Trump's threat to invoke a federal anti-insurrection law to expand his deployment of military personnel to U.S. cities has intensified the legal battle between the president and Democratic-led cities, as hundreds of National Guard troops fro…",
    "link": "https://www.thestar.com.my/news/world/2025/10/07/trump039s-threat-to-invoke-insurrection-act-escalates-showdown-with-democratic-cities",
    "timestamp": "2025-10-07T14:06:00Z"
  },
  {
    "title": "Bob Ross paintings to be auctioned to support public TV stations after federal funding cuts",
    "description": "LOS ANGELES (AP) — Thirty paintings created by the bushy-haired, soft-spoken Bob Ross will soon be up for auction to defray the costs of programming for small and rural public television stations suffering under cuts in federal funding. Ross, a public televis…",
    "link": "https://financialpost.com/pmn/bob-ross-paintings-to-be-auctioned-to-support-public-tv-stations-after-federal-funding-cuts",
    "timestamp": "2025-10-07T14:05:06Z"
  },
  {
    "title": "Watchdog journalism’s future may lie in the work of independent reporters like Pablo Torre",
    "description": "In September 2025, podcaster Pablo Torre published an investigation alleging that the NBA’s Los Angeles Clippers may have used a side deal to skirt the league’s strict salary cap rules. His reporting, aired on multiple episodes of “Pablo Torre Finds Out,” foc…",
    "link": "https://www.niemanlab.org/2025/10/watchdog-journalisms-future-may-lie-in-the-work-of-independent-reporters-like-pablo-torre/",
    "timestamp": "2025-10-07T14:01:37Z"
  },
  {
    "title": "Carney says U.S., Canada stronger together, Trump vows to work on 'natural conflicts'",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/carney-says-u-s-canada-stronger-together-trump-vows-to-work-on-natural-conflicts-9.6929790",
    "timestamp": "2025-10-07T14:01:04Z"
  },
  {
    "title": "Exclusive Interview: Populist Leader Călin Georgescu on His Annulled Presidential Campaign Victory, Globalist Copy-Paste Lawfare, and Romania’s Fight for Sovereignty",
    "description": "Călin Georgescu—once viewed by Romania’s corrupt, entrenched political establishment as an “outsider”—stunned Europe and the world in November 2024 by cruising to a first-round victory in the presidential race.\nThe post Exclusive Interview: Populist Leader Că…",
    "link": "https://www.thegatewaypundit.com/2025/10/exclusive-interview-populist-leader-calin-georgescu-his-annulled/",
    "timestamp": "2025-10-07T14:00:57Z"
  },
  {
    "title": "What is Insurrection Act, could it help Trump deploy troops to US cities?",
    "description": "Threat to invoke the Act comes amid protests in Portland and legal challenges against his anti-immigration crackdown.",
    "link": "https://www.aljazeera.com/news/2025/10/7/what-is-the-insurrection-act-could-it-help-trump-deploy-troops-to-cities",
    "timestamp": "2025-10-07T14:00:44Z"
  },
  {
    "title": "Could a U.S. Bitcoin Reserve help tackle America’s $33T debt?",
    "description": "Park and Pompliano are proposing leveraging $1 trillion in unrealized gold gains to build the U.S. Bitcoin Reserve.",
    "link": "https://ambcrypto.com/could-a-u-s-bitcoin-reserve-help-tackle-americas-33t-debt/",
    "timestamp": "2025-10-07T14:00:42Z"
  },
  {
    "title": "ACLU Urging Brown University to Reject Trump Deal",
    "description": "\"the group accused the administration of weaponizing federal funding to force universities into compliance and undermine higher education\"\nThe post ACLU Urging Brown University to Reject Trump Deal first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/aclu-urging-brown-university-to-reject-trump-deal/",
    "timestamp": "2025-10-07T14:00:11Z"
  }
]