[
  {
    "title": "Philippine ambassador to US 'confident' Trump-era ties will stay strong",
    "description": "MANILA: The Philippines' ambassador to Washington said on Monday (Mar 3) he was \"confident\" the two countries' military ties would remain strong under the Donald Trump administration, while also acknowledging the",
    "link": "https://www.channelnewsasia.com/asia/philippine-ambassador-us-confident-trump-era-ties-will-stay-strong-4972041",
    "timestamp": "2025-03-03T08:52:00Z"
  },
  {
    "title": "What’s the emergency Arab summit on Gaza reconstruction? Everything to know",
    "description": "The summit has been called by Egypt, which has prepared a reconstruction plan that avoids ethnic cleansing of Gaza.",
    "link": "https://www.aljazeera.com/news/2025/3/3/whats-the-emergency-arab-summit-on-gaza-reconstruction-everything-to-know",
    "timestamp": "2025-03-03T08:49:41Z"
  },
  {
    "title": "Moscow mocks Ottawa’s troops in Ukraine idea",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova has ridiculed the prospect of Canadian troops deployed in Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613601-zakharova-canada-troops-ukraine/",
    "timestamp": "2025-03-03T08:48:56Z"
  },
  {
    "title": "Macron details French-UK ‘peace plan’ for Ukraine",
    "description": "Paris and London want to stop the fighting between Moscow and Kiev, but not at any cost, the president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613598-macron-france-ukraine-peace/",
    "timestamp": "2025-03-03T08:48:31Z"
  },
  {
    "title": "India's trade minister heads to US for talks as Trump tariffs loom, officials say",
    "description": "India's trade minister Piyush Goyal started on a trip to the United States on Monday to pursue trade talks, two government officials said, with weeks to go for President Donald Trump's planned reciprocal tariffs.",
    "link": "https://biztoc.com/x/d471c572efff8e14",
    "timestamp": "2025-03-03T08:45:07Z"
  },
  {
    "title": "Letters to the editor",
    "description": "Herald readers sound off on high energy prices and natural gas in Massachusetts, and President Donald Trump's actions on climate regulations.",
    "link": "https://www.bostonherald.com/2025/03/03/letters-to-the-editor-679/",
    "timestamp": "2025-03-03T08:44:52Z"
  },
  {
    "title": "Euro jumps as investors focus on fiscal spending, Ukraine talks",
    "description": "The euro jumped on Monday as investors weighed potential increases in fiscal spending across the euro area and prospects for a peace deal in Ukraine.Ukrainian President Volodymyr Zelenskiy received a warm welcome in Britain after his meeting with U.S. Preside…",
    "link": "https://www.channelnewsasia.com/business/euro-jumps-investors-focus-fiscal-spending-ukraine-talks-4971441",
    "timestamp": "2025-03-03T08:40:00Z"
  },
  {
    "title": "US tariffs will likely dent growth prospects in Central Europe, S&P Global says",
    "description": "U.S. President Donald Trump's proposal to impose 25% tariffs on imports from the European Union is likely to dent growth prospects in Central Europe, compounding existing fiscal challenges, S&P Global Ratings told Reuters.\nTrump said last week his administrat…",
    "link": "https://biztoc.com/x/c8395ce5a12bde4e",
    "timestamp": "2025-03-03T08:34:05Z"
  },
  {
    "title": "Trump names tokens in US Crypto Reserve",
    "description": "President Donald Trump offered more clarity on a US Crypto Reserve yesterday, saying in a post to Truth Social that his administration is moving forward with the plan and will include bitcoin, ethereum and smaller tokens solana, XRP, and cardano.\nThe news sen…",
    "link": "https://biztoc.com/x/2cb95c58bb7909e7",
    "timestamp": "2025-03-03T08:33:56Z"
  },
  {
    "title": "Curious Case Of Miley's Missing Eyebrows",
    "description": "Hollywood's biggest night was high on glitz and glamour but lacked the edge and excitement of the movies it was celebrating, observes Sukanya Verma.",
    "link": "https://www.rediff.com/movies/report/the-curious-case-of-mileys-missing-eyebrows/20250303.htm",
    "timestamp": "2025-03-03T08:31:29Z"
  },
  {
    "title": "Willpower, Not Manpower, is Europe’s Main Limitation for a Force in Ukraine",
    "description": "Following a dramatic meeting in the White House, U.S. military support for Ukraine is perilously uncertain. Sustaining Ukraine in this war, and afterwards, is a responsibility that Europe will have to shoulder sooner rather than later. Washington may now cut …",
    "link": "https://warontherocks.com/2025/03/willpower-not-manpower-is-europes-main-limitation-for-a-force-in-ukraine/",
    "timestamp": "2025-03-03T08:30:35Z"
  },
  {
    "title": "India must keep its strategic options open as Trump’s tariffs kick in",
    "description": "Trade tensions will multiply even as global value chains (GVCs) are reshaped. An ability to capitalize on GVC shifts will determine whether we emerge stronger in the new global economic order.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariffs-xi-jinping-mexico-canada-global-supply-chains-india-trade-balance-exports-imports-duties-us-trade-11740927875299.html",
    "timestamp": "2025-03-03T08:30:17Z"
  },
  {
    "title": "Donald Trump unveils US crypto reserve plan, triggering market volatility",
    "description": "Trump stated in a post on Truth Social that his executive order from January on digital assets would create a reserve consisting of bitcoin, ether, XRP, solana, and cardano.",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-unveils-us-crypto-reserve-plan-triggering-market-volatility/articleshow/118680539.cms",
    "timestamp": "2025-03-03T08:28:57Z"
  },
  {
    "title": "Gold maximalist Peter Schiff ‘understands’ US strategic Bitcoin reserve, questions XRP legitimacy",
    "description": "Peter Schiff disputed claims that he endorsed a Strategic Bitcoin Reserve in a series of social media posts after he posted, “I get the rationale for a Bitcoin reserve. I don’t agree with it, but I get it. We have a gold reserve. Bitcoin is digital gold, whic…",
    "link": "https://cryptoslate.com/insights/gold-maximalist-peter-schiff-understands-us-strategic-bitcoin-reserve-questions-xrp-legitimacy/",
    "timestamp": "2025-03-03T08:28:30Z"
  },
  {
    "title": "Petition calls on Finnish universities to oppose US attempts to censor use of terms such as equality, climate change",
    "description": "The chancellor of the University of Helsinki told a newspaper last month that US authorities had pressured the university to remove certain terms from its press release about Fulbright scholarships.",
    "link": "https://yle.fi/a/74-20147027",
    "timestamp": "2025-03-03T08:28:20Z"
  },
  {
    "title": "Editorial: White House transparency should extend to records",
    "description": "For the Trump administration to fully embrace transparency, it must also acknowledge the value of open records and instruct federal agencies to comply with Freedom of Information Act requests.",
    "link": "https://www.bostonherald.com/2025/03/03/editorial-white-house-transparency-should-extend-to-records/",
    "timestamp": "2025-03-03T08:27:34Z"
  },
  {
    "title": "Asian stocks gain as investors watch for China’s economic plans",
    "description": "Asian markets climbed on Monday on hopes that China will announce a huge stimulus package that will help offset US President Donald Trump’s looming tariffs against Chinese goods. Investors were also watching for any last-ditch deals to ward off the levies hit…",
    "link": "https://punchng.com/asian-stocks-gain-as-investors-watch-for-chinas-economic-plans/",
    "timestamp": "2025-03-03T08:25:43Z"
  },
  {
    "title": "Slovak Debt Chief Sees Budget Risk, Ukraine Keeping Yields High",
    "description": "Slovakia is likely to face elevated borrowing costs until the government reins in the budget deficit and the war in neighboring Ukraine comes to an end, according to the country’s debt management chief.",
    "link": "https://financialpost.com/pmn/business-pmn/slovak-debt-chief-sees-budget-risk-ukraine-keeping-yields-high",
    "timestamp": "2025-03-03T08:24:50Z"
  },
  {
    "title": "Monday's papers: Trump reaction, MP travel, and Lapland over-tourism",
    "description": "Lapland tourism is good for business, but bad for the climate.",
    "link": "https://yle.fi/a/74-20147030",
    "timestamp": "2025-03-03T08:22:56Z"
  },
  {
    "title": "Biggest CME gap ever at $85K: 5 things to know in Bitcoin this week",
    "description": "Bitcoin enjoys a major \"Trump pump,\" but traders warn that fresh BTC price support retests are still a risk ahead of this week’s key White House crypto summit.",
    "link": "https://cointelegraph.com/news/biggest-cme-gap-ever-85k-5-things-bitcoin-this-week",
    "timestamp": "2025-03-03T08:16:52Z"
  },
  {
    "title": "What is a 'coalition of the willing' and which countries could send peacekeeping troops to Ukraine?",
    "description": "A \"coalition of the willing\" could provide boots on the ground in Ukraine in the event of a ceasefire.",
    "link": "https://news.sky.com/story/what-is-a-coalition-of-the-willing-and-which-countries-could-send-peacekeeping-troops-to-ukraine-13320663",
    "timestamp": "2025-03-03T08:15:00Z"
  },
  {
    "title": "US tariffs will likely dent growth prospects in Central Europe, S&P Global says",
    "description": "U.S. President Donald Trump's proposal to impose 25% tariffs on imports from the European Union is likely to dent growth prospects in Central Europe...",
    "link": "https://finance.yahoo.com/news/us-tariffs-likely-dent-growth-081253707.html",
    "timestamp": "2025-03-03T08:12:53Z"
  },
  {
    "title": "People Are Tired of the Adults in the Room | Opinion",
    "description": "Despite President Donald Trump's claims, the 2024 election always felt less like a Trump victory and more like a Democratic collapse.",
    "link": "https://biztoc.com/x/44cf2507252db53e",
    "timestamp": "2025-03-03T08:11:44Z"
  },
  {
    "title": "Zelenskyy Hopeful On US Ties After Tense Trump Talks, Gains European Support For Ukraine Peace",
    "description": "European leaders vowed to ramp up efforts to support Ukraine, including discussing the formation of a \"coalition of the willing\" to create a peace plan and present it to U.S. President Donald Trump.",
    "link": "https://www.ibtimes.com/zelenskyy-hopeful-us-ties-after-tense-trump-talks-gains-european-support-ukraine-peace-3765057",
    "timestamp": "2025-03-03T08:11:15Z"
  },
  {
    "title": "People Are Tired of the Adults in the Room | Opinion",
    "description": "Despite President Donald Trump's claims, the 2024 election always felt less like a Trump victory and more like a Democratic collapse.",
    "link": "https://www.newsweek.com/people-are-tired-adults-room-opinion-2038012",
    "timestamp": "2025-03-03T08:11:01Z"
  },
  {
    "title": "Finland President Alexander Stubb on Ukraine, Donald Trump, European Security, Peace Deal",
    "description": "Finnish President Alexander Stubb discusses the current geopolitical situation following Ukrainian President Volodymyr ...",
    "link": "https://biztoc.com/x/a18e9923032f2119",
    "timestamp": "2025-03-03T08:05:07Z"
  },
  {
    "title": "Measles is back, and so are all the old antivax tropes about it",
    "description": "Measles is back, and so are all the old antivax tropes about the disease and the vaccine. Unfortunately, there's an antivaxxer in charge.\nThe post Measles is back, and so are all the old antivax tropes about it first appeared on Science-Based Medicine.",
    "link": "https://sciencebasedmedicine.org/measles-is-back-and-so-are-all-the-old-antivax-tropes-about-it/",
    "timestamp": "2025-03-03T08:02:00Z"
  },
  {
    "title": "Dogecoin To Join Trump’s Crypto Reserve? Elon Musk Reacts",
    "description": "Yesterday, March 2, US President Donald Trump announced the establishment of a US “strategic crypto reserve” designed to bolster America’s position in the crypto sector. The reserve will initially include major cryptocurrencies such as Bitcoin, Ethereum, XRP,…",
    "link": "http://www.newsbtc.com/news/dogecoin/dogecoin-to-join-trump-crypto-reserve-elon-musk-reacts/",
    "timestamp": "2025-03-03T08:00:16Z"
  },
  {
    "title": "Researchers in ‘Limbo’ as Trump Battles Courts",
    "description": "Researchers in ‘Limbo’ as Trump Battles Courts\n\n \n\n\n \nkathryn.palmer…\n\nMon, 03/03/2025 - 03:00 AM\n\nDespite court orders blocking Trump’s federal funding freeze, bans on DEI and other executive mandates, academic researchers are still in the dark on what all o…",
    "link": "https://www.insidehighered.com/news/government/science-research-policy/2025/03/03/researchers-remain-limbo-trump-battles-courts",
    "timestamp": "2025-03-03T08:00:00Z"
  },
  {
    "title": "Biggest Oscar Moments: Brody And Berry’s Oscar Kiss Call Back, Conan’s Drake Jibe, And Adam Sandler’s Sweatshirt",
    "description": "In his monologue Oscar host Conan O’Brien also took a jab at the controversy surrounding “Emilia Pérez” and its actor Karla Sofía Gascón.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/03/03/biggest-oscar-moments-brody-and-berrys-oscar-kiss-call-back-conans-drake-jibe-and-adam-sandlers-sweatshirt/",
    "timestamp": "2025-03-03T07:59:53Z"
  },
  {
    "title": "Why is Cardano (ADA) price up today?",
    "description": "ADA price is up 73% from its recent lows of $0.57 responding to President Trump’s directive for the establishment of a Strategic Crypto Reserve that includes Cardano.",
    "link": "https://cointelegraph.com/news/why-is-cardano-ada-price-up-today",
    "timestamp": "2025-03-03T07:58:43Z"
  },
  {
    "title": "Pro-Ukraine protests across US after Trump-Zelensky clash",
    "description": "Pro-Ukraine protests have taken place across the US after Donald Trump and JD Vance’s angry exchange with Volodymr Zelensky at the White House. Hundreds of people gathered in New York, Los Angeles and Boston to express their support for Ukraine after the furi…",
    "link": "https://thechronicle.com.gh/pro-ukraine-protests-across-us-after-trump-zelensky-clash/",
    "timestamp": "2025-03-03T07:58:04Z"
  },
  {
    "title": "Chris Christie Leaves No Doubt: Trump ‘Looks And Sounds Like An Ally Of Putin’",
    "description": "The onetime Trump ally pulled no punches, pointing out the issue with the president’s approach to Ukraine.",
    "link": "https://www.huffpost.com/entry/chris-christie-donald-trump-putin_n_67c55700e4b0b2967721a371",
    "timestamp": "2025-03-03T07:53:49Z"
  },
  {
    "title": "Europe seeks to take control of Ukraine negotiations",
    "description": "Britain’s Prime Minister Keir Starmer sought to wrestle control of negotiations over the Russia-Ukraine war away from the US on Sunday, hosting dozens of European leaders and outlining a pathway towards peace on a pivotal day of diplomacy in London. Starmer h…",
    "link": "https://thechronicle.com.gh/europe-seeks-to-take-control-of-ukraine-negotiations/",
    "timestamp": "2025-03-03T07:53:21Z"
  },
  {
    "title": "The case for and against Keir Starmer’s intervention",
    "description": "Sky News’ deputy political editor Sam Coates and Politico’s Anne McElvoy have their guide to the day ahead in British politics. After an extraordinary 96 hours on the world stage, Sir Keir Starmer faces his next challenge: a grilling from MPs in the Commons. …",
    "link": "https://www.politico.eu/podcast/eu-confidential/the-case-for-and-against-keir-starmers-intervention/",
    "timestamp": "2025-03-03T07:48:35Z"
  },
  {
    "title": "British ambassador's claim Ukraine should commit to ceasefire before Russia 'not government policy'",
    "description": "British ambassador to the US Lord Mandelson's claim that Ukraine should commit to a ceasefire before Russia \"is not government policy\", a minister has told Sky News.",
    "link": "https://news.sky.com/story/lord-mandelsons-claim-ukraine-should-commit-to-ceasefire-before-russia-not-government-policy-minister-says-13320651",
    "timestamp": "2025-03-03T07:46:00Z"
  },
  {
    "title": "China, Hong Kong stocks rise on upbeat data, focus on policy meetings",
    "description": "Chinese and Hong Kong stocks rebounded on Monday, recouping some of last week's losses after upbeat manufacturing data and expectation this week's key policy meetings in Beijing will bring new stimulus measures.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-hong-kong-stocks-rise-on-upbeat-data-focus-on-policy-meetings/articleshow/118679547.cms",
    "timestamp": "2025-03-03T07:45:29Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Monday",
    "description": "CDU and SPD to continue coalition talks on Monday, Social Democrats win Hamburg elections despite losses, ECB set to announce further rate cuts, and more news from Germany on Monday.",
    "link": "https://www.thelocal.de/20250303/today-in-germany-a-roundup-of-the-latest-news-on-monday-63",
    "timestamp": "2025-03-03T07:41:13Z"
  },
  {
    "title": "Conan O'Brien's Donald Trump Joke Met With Massive Cheer at Oscars",
    "description": "\"I guess Americans are excited to see somebody finally stand up to a powerful Russian,\" the host said.",
    "link": "https://biztoc.com/x/d3860c9121bc35b1",
    "timestamp": "2025-03-03T07:38:26Z"
  },
  {
    "title": "Trump takes actions to increase lumber supplies and curb wood imports",
    "description": "President Donald Trump has signed a pair of actions to increase domestic lumber production",
    "link": "https://biztoc.com/x/871005ad297c578b",
    "timestamp": "2025-03-03T07:38:15Z"
  },
  {
    "title": "Brazil's bond market could be an ‘oasis’ for some investors as Trump ramps up tariff threats",
    "description": "Brazil's government bonds could become an \"oasis\" for some investors, particularly as global trade tensions fester.",
    "link": "https://www.cnbc.com/2025/03/03/brazils-bond-market-could-be-an-oasis-amid-global-trade-tensions.html",
    "timestamp": "2025-03-03T07:33:18Z"
  },
  {
    "title": "Trump cutoff of humanitarian parole for immigrants from Ukraine, 6 other countries challenged",
    "description": "MIAMI (AP) — A group of American citizens and immigrants is suing the Trump administration for ending a long-standing legal tool presidents have used to allow people from countries where there’s war or political instability to enter and temporarily live in th…",
    "link": "https://freerepublic.com/focus/f-news/4301671/posts",
    "timestamp": "2025-03-03T07:32:49Z"
  },
  {
    "title": "Oscars 2025: Every Political Statement Made at This Year's Ceremony",
    "description": "The winners of the biggest night in film took their moment to address sex work, the war in Gaza and the fragility of democracy",
    "link": "https://www.newsweek.com/oscars-2025-every-political-statement-gaza-sex-work-democracy-2038552",
    "timestamp": "2025-03-03T07:31:41Z"
  },
  {
    "title": "CNBC Daily Open: Trump clashes on foreign policy, wields economic threat",
    "description": "It might seem questionable for a country to impose tariffs on its biggest trading partners, especially when its economy is showing signs of shrinking.",
    "link": "https://www.cnbc.com/2025/03/03/cnbc-daily-open-trumps-diplomatic-conflict-and-economic-assault.html",
    "timestamp": "2025-03-03T07:30:01Z"
  },
  {
    "title": "A ‘one-month truce on land, sea, air’. What’s in Europe’s Ukraine peace plan?",
    "description": "The deal proposed by France’s president Emmanuel Macron and UK Prime Minister Keir Starmer is said to cover air, sea and energy infrastructure",
    "link": "https://www.irishtimes.com/world/europe/2025/03/03/a-one-month-truce-on-land-sea-air-whats-in-europes-ukraine-peace-plan/",
    "timestamp": "2025-03-03T07:29:43Z"
  },
  {
    "title": "Bitcoin $100K Plays Back in Vogue After 10% BTC Price Surge from 'Trump Put'",
    "description": "The Deribit-listed $100K strike call has seen the biggest jump in open interest in the past 24 hours.",
    "link": "https://www.coindesk.com/markets/2025/03/03/bitcoin-usd100k-plays-back-in-vogue-after-10-btc-price-surge-from-trump-put",
    "timestamp": "2025-03-03T07:29:14Z"
  },
  {
    "title": "Trump says US should spend 'less time worrying about Putin,' calls his former advisor an 'ineffective loser'",
    "description": "President Donald Trump criticized his former national security advisor and said the U.S. government should spend less time worrying about Russian President Vladimir Putin.",
    "link": "https://www.foxnews.com/politics/trump-says-us-should-spend-less-time-worrying-about-putin-calls-his-former-advisor-ineffective-loser",
    "timestamp": "2025-03-03T07:28:30Z"
  },
  {
    "title": "Conan O'Brien's Donald Trump Joke Met With Massive Cheer at Oscars",
    "description": "\"I guess Americans are excited to see somebody finally stand up to a powerful Russian,\" the host said.",
    "link": "https://www.newsweek.com/conan-obrien-donald-trump-oscars-russia-ukraine-2038549",
    "timestamp": "2025-03-03T07:27:34Z"
  },
  {
    "title": "Trump names 5 cryptocurrencies for national reserve, sending prices soaring",
    "description": "United States President Donald Trump has named five cryptocurrencies for his proposed reserve of digital assets, sending prices of the tokens soaring.\nBitcoin, Ethereum, XRP, Solana, and Cardano will be included in a “Crypto Strategic Reserve”, Trump said on …",
    "link": "https://biztoc.com/x/e84fa92abe45f880",
    "timestamp": "2025-03-03T07:27:33Z"
  },
  {
    "title": "Tra smartphone e robot, l'IA protagonista a Barcellona",
    "description": "Dal 3 al 6 marzo torna il Mobile World Congress (ANSA)",
    "link": "https://www.ansa.it/canale_tecnologia/notizie/novita_recensioni/2025/03/02/lia-guida-la-ripresa-del-mercato-smartphone-in-europa_c79c9748-50f9-4af6-bbc6-b773b9806da6.html",
    "timestamp": "2025-03-03T07:26:12Z"
  },
  {
    "title": "Slow dancing in a burning room: Elon Musk in Europe",
    "description": "Musk’s interventions have sparked a polarized reaction. Far-right actors across Europe have embraced his rhetoric. On February 7, the European far-right parliamentary group Patriots EU gathered in Madrid, rallying behind “Make Europe Great Again”—the very slo…",
    "link": " https://en.setopati.com/International/164323 ",
    "timestamp": "2025-03-03T07:24:52Z"
  },
  {
    "title": "Trump is focused on Ukraine’s critical minerals. Here’s what Ukraine really has.",
    "description": "A deal with Ukraine would give the U.S. access to the country’s mineral wealth. Cullen Hendrix reviews the data in a guest commentary.",
    "link": "https://www.livemint.com/industry/trump-is-focused-on-ukraine-s-critical-minerals-here-s-what-ukraine-really-has-11740985822300.html",
    "timestamp": "2025-03-03T07:24:42Z"
  },
  {
    "title": "Cartel-plagued Mexican city pins hopes on Trump's anti-drug trafficking pressure",
    "description": "In Mexico's Culiacan, a city of 1 million residents, an elementary school principal starts each day checking for shootouts before deciding whether to cancel classes",
    "link": "https://abcnews.go.com/International/wireStory/cartel-plagued-mexican-city-pins-hopes-trumps-anti-119374194",
    "timestamp": "2025-03-03T07:18:27Z"
  },
  {
    "title": "US defense chief pauses cyber offensive against Russia: reports",
    "description": "U.S. Defense Secretary Pete Hegseth has ordered a pause on all of the country's cyber operations against Russia, including offensive actions, multiple U.S. media reports said on Sunday.",
    "link": "https://www.hurriyetdailynews.com/us-defense-chief-pauses-cyber-offensive-against-russia-reports-206453",
    "timestamp": "2025-03-03T07:15:00Z"
  },
  {
    "title": "Here is what Apple demands from Trump in return for its $500 billion investment",
    "description": "Apple has reportedly put forward a list of demands from the Trump administration in return for its massive investment in the US. Read more...",
    "link": "https://www.neowin.net/news/here-is-what-apple-demands-from-trump-in-return-for-its-500-billion-investment-/",
    "timestamp": "2025-03-03T07:14:02Z"
  },
  {
    "title": "Ethereum, Solana, and Trump’s big crypto reserve gamble—What investors need to know",
    "description": "President Donald Trump has unveiled the United States Strategic Crypto Reserve, a groundbreaking initiative aimed at integrating digital assets into the nation’s financial infrastructure. The move sparked an immediate crypto market rally, with Bitcoin and Eth…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ethereum-solana-and-trumps-big-crypto-reserve-gamblewhat-investors-need-to-know/articleshow/118677305.cms",
    "timestamp": "2025-03-03T07:13:56Z"
  },
  {
    "title": "Is the UN Facing its Biggest Single Crisis in 80 Years?",
    "description": "The United Nations, in its nearly 80-year-old history, is on the verge of fighting for its survival, as the Trump administration continues with its threats to drastically cut funding and pull out of several UN agencies which provide mostly humanitarian assist…",
    "link": "https://www.ipsnews.net/2025/03/un-facing-biggest-single-crisis-80-years/",
    "timestamp": "2025-03-03T07:12:26Z"
  },
  {
    "title": "Selected Articles: Video: “Peace Is Almost a Forbidden Word”",
    "description": "Video: “Peace Is Almost a Forbidden Word” By Drago Bosnic and Prof Michel Chossudovsky, March 02, 2025 Donald Trump has initiated bilateral peace negotiations with the Russian government of Vladimir Putin without the participation of (no longer president?) Mr…",
    "link": "https://www.globalresearch.ca/selected-articles-video-peace-forbidden-word/5881305",
    "timestamp": "2025-03-03T07:08:02Z"
  },
  {
    "title": "Europe higher premarket amid geopolitical tensions",
    "description": "Major European stocks traded higher on Monday morning amid the geopolitical turmoil caused by the White House spat between US President Donald Trump and his Ukrainian counterpart, Volodymyr Zelensky.I...",
    "link": "https://biztoc.com/x/fd3176aac81be561",
    "timestamp": "2025-03-03T07:05:41Z"
  },
  {
    "title": "Trump hails Treasury for halting Biden's business disclosure rule",
    "description": "United States President Donald Trump welcomed the Treasury Department's decision to stop enforcing the Beneficial Ownership Information (BOI) reporting rule for American citizens.Trump called the rule...",
    "link": "https://biztoc.com/x/fca62d38d8b235d6",
    "timestamp": "2025-03-03T07:05:27Z"
  },
  {
    "title": "Trump-Zelensky Oval Office Spat Could Mean Curtains For Liberal Global Order",
    "description": "The dramaticOvalOfficeshowdownbetween US President Donald Trump and Ukrainian President Volodymyr Zelensky on February 28 sent shivers through the transatlantic alliance.",
    "link": "https://www.ndtv.com/world-news/trump-zelensky-oval-office-spat-could-mean-curtains-for-liberal-global-order-7835535",
    "timestamp": "2025-03-03T07:04:28Z"
  },
  {
    "title": "Opinion: Flying Off The Tangent At Oval Office",
    "description": "Six weeks into Trump 2.0, the opening overture of the White House&#039;s high-adrenaline campaign to reconfigure the eight-decade global as well as domestic architecture has generated more heat than light.",
    "link": "https://www.ndtv.com/opinion/trump-zelensky-showdown-no-putin-is-not-the-winner-here-7835531",
    "timestamp": "2025-03-03T07:03:44Z"
  },
  {
    "title": "Chinese factories see improved orders as importers rush to beat tariffs",
    "description": "Chinese manufacturers reported stronger orders in February as importers rushed to beat higher U.S. tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/chinese-factories-improved-orders-importers-rush-beat-tariffs-119375893",
    "timestamp": "2025-03-03T07:02:22Z"
  },
  {
    "title": "As Europe mobilizes behind Ukraine, it's sitting on a $218 billion ace card — and it's being urged to play it",
    "description": "As relations between the US and Ukraine sour, Europe is scrambling to fill the gap. Russia's frozen assets may be a solution.",
    "link": "https://www.businessinsider.com/ukraine-frozen-russia-assets-europe-zelenskyy-trump-clash-putin-2025-3",
    "timestamp": "2025-03-03T07:01:01Z"
  },
  {
    "title": "Daryl Hannah Shared This Simple Message Of Support For Ukraine At Oscars",
    "description": "The \"Kill Bill\" actor turned to a notable rallying cry just days after President Donald Trump's Oval Office clash with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.huffpost.com/entry/daryl-hannah-ukraine-support-2025-oscars_n_67c5431ae4b04cc8a05f32d2",
    "timestamp": "2025-03-03T07:00:27Z"
  },
  {
    "title": "'Europe Must Do The Heavy Lifting' In Ukraine: Keir Starmer",
    "description": "UK leader Keir Starmer called for US backing to deter Russian President Vladimir Putin from violating any ceasefire.",
    "link": "https://www.ndtv.com/world-news/europe-must-do-the-heavy-lifting-in-ukraine-keir-starmer-7835473",
    "timestamp": "2025-03-03T06:57:36Z"
  },
  {
    "title": "Jasmine Crockett Sums Up GOP Lawmakers In 1 Damning Word On Trump And Musk",
    "description": "The Texas Democrat called out her colleagues on the other side of the aisle for how they're handling the new administration.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-republicans-musk_n_67c5219de4b04cc8a05f0570",
    "timestamp": "2025-03-03T06:56:57Z"
  },
  {
    "title": "Dutton says as PM he would ‘lobby’ Donald Trump to reconsider Ukraine stand",
    "description": "Peter Dutton and the government have continued to display their support for Ukraine in the face of the attacks by Donald Trump.",
    "link": "https://theconversation.com/dutton-says-as-pm-he-would-lobby-donald-trump-to-reconsider-ukraine-stand-251256",
    "timestamp": "2025-03-03T06:56:02Z"
  },
  {
    "title": "Nothing has changed in US crypto banking since Trump returned: Caitlin Long",
    "description": "The US government has done “nothing” to address crypto debanking issues since US President Donald Trump returned to the White House, according to Custodia Bank’s CEO Caitlin Long.\nSpeaking on stage at ETHDenver on Feb. 28, Long said while the “perception is t…",
    "link": "https://biztoc.com/x/fa9b7255c12b9580",
    "timestamp": "2025-03-03T06:54:14Z"
  },
  {
    "title": "The Trump-Putin Axis and Its Impact on Global Politics",
    "description": "Donald Trump’s forging of a political alliance with Russia’s Vladimir Putin at the expense of Ukraine’s struggle for self-determination may not be totally unexpected, but its speed and extent represent a dramatic transformation of world politics. Nothing more…",
    "link": "https://www.counterpunch.org/2025/03/03/the-trump-putin-axis-and-its-impact-on-global-politics/",
    "timestamp": "2025-03-03T06:51:53Z"
  },
  {
    "title": "Chinese factories see improved orders as importers rush to beat tariffs",
    "description": "Chinese manufacturers reported stronger orders in February as importers rushed to beat higher U.S. tariffs.",
    "link": "https://www.clickondetroit.com/business/2025/03/03/chinese-factories-see-improved-orders-as-importers-rush-to-beat-tariffs/",
    "timestamp": "2025-03-03T06:51:15Z"
  },
  {
    "title": "SEC’s ‘Demolition’ of Crypto Enforcement Met With Cheers as Well as Jeers",
    "description": "The US Securities and Exchange Commission has kicked off the new year with a makeover, wiping clean its slate of crypto enforcement actions and turning what was once a hostile landscape for digital assets into a potential haven. In the …",
    "link": "https://www.insurancejournal.com/news/national/2025/03/03/813890.htm",
    "timestamp": "2025-03-03T06:50:21Z"
  },
  {
    "title": "Spend Less Time Worrying About Putin, More About Migrants: Donald Trump",
    "description": "President Donald Trump said the US should worry &quot;less&quot; about Vladimir Putin, and more about &quot;migrant rape gangs, drug lords, murderers, and people from mental institutions entering the country&quot;.",
    "link": "https://www.ndtv.com/world-news/spend-less-time-worrying-about-putin-more-about-migrants-donald-trump-7835384",
    "timestamp": "2025-03-03T06:47:01Z"
  },
  {
    "title": "Zelenskyy says possible to repair ties with US, sign minerals deal",
    "description": "Ukrainian President Volodymyr Zelenskyy said Sunday his country remained ready to sign a rare earth minerals deal with the United States, and that he believes he can salvage relations with U.S. President Donald Trump.\n\n\nSpeaking to reporters after a gathering…",
    "link": "https://www.voanews.com/a/zelenskyy-says-possible-to-repair-ties-with-us-sign-minerals-deal-/7994831.html",
    "timestamp": "2025-03-03T06:45:48Z"
  },
  {
    "title": "Cartel-plagued Mexican city pins hopes on Trump’s anti-drug trafficking pressure",
    "description": "Before dawn, an elementary school principal in the capital of Mexico's Sinaloa state checks various chats on his phone for word of shootouts or other incidents. If there’s danger, he sends a message to his students’ parents suspending classes.",
    "link": "https://nypost.com/2025/03/03/world-news/cartel-plagued-mexican-city-pins-hopes-on-trumps-anti-drug-trafficking-pressure/",
    "timestamp": "2025-03-03T06:45:21Z"
  },
  {
    "title": "PEACE BID ‘I’ll quit in exchange for joining Nato’, Zelensky says – as Ukrainian leader ‘back in touch’ with US after Trump clash",
    "description": "VOLODYMYR Zelensky has insisted he will happily step down from office in exchange for Ukraine joining Nato.... Zelensky spoke to reporters at London Stansted airport after a day meeting European leaders and holding talks with Sir Keir Starmer over finding a l…",
    "link": "https://freerepublic.com/focus/f-news/4301669/posts",
    "timestamp": "2025-03-03T06:44:44Z"
  },
  {
    "title": "China May Hit US Crops in Tariff Response, Global Times Says",
    "description": "China is considering retaliatory measures on US agriculture and food products in response to tariffs from the Trump administration that are scheduled to take effect on Tuesday, according to the Global Times.",
    "link": "https://financialpost.com/pmn/business-pmn/china-may-hit-us-crops-in-tariff-response-global-times-says",
    "timestamp": "2025-03-03T06:43:11Z"
  },
  {
    "title": "US market already reached peak, likely to underperform going forward: Chris Wood",
    "description": "Christopher Wood from Jefferies predicts US stocks may underperform despite recent highs. He believes that tax cuts and deregulation might prevail over tariffs. There is uncertainty due to conflicting economic policies. Elon Musk's plan to cut $2 trillion fro…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/us-market-already-reached-peak-likely-to-underperform-going-forward-chris-wood/articleshow/118677625.cms",
    "timestamp": "2025-03-03T06:42:56Z"
  },
  {
    "title": "“Zelensky must go”, insists the US – “It will not be easy to replace me”, he replies",
    "description": "Republicans angry after what happened at the White House - \"I am ready to sign on to rare earths\", says Ukrainian president after London summit\nThe post “Zelensky must go”, insists the US – “It will not be easy to replace me”, he replies appeared first on Pro…",
    "link": "https://en.protothema.gr/2025/03/03/zelensky-must-go-insists-the-us-it-will-not-be-easy-to-replace-me-he-replies/",
    "timestamp": "2025-03-03T06:41:50Z"
  },
  {
    "title": "Ukraine war latest: Trump criticises Zelensky for saying end of Ukraine war is 'still very, very far away'",
    "description": "\"What are they thinking?\" the US president asks on Truth Social, a day after European leaders hold a Ukraine summit in the UK.",
    "link": "https://www.bbc.co.uk/news/live/c981p3dxnent",
    "timestamp": "2025-03-03T06:40:57Z"
  },
  {
    "title": "Trump names 5 cryptocurrencies for national reserve, sending prices soaring",
    "description": "US president says Bitcoin, Ethereum, XRP, Solana, and Cardano will be included in 'Crypto Strategic Reserve'.",
    "link": "https://www.aljazeera.com/economy/2025/3/3/trump-names-5-cryptocurrencies-for-national-reserve-sending-prices-soaring",
    "timestamp": "2025-03-03T06:39:14Z"
  },
  {
    "title": "Musk slams Zelensky for rejecting ceasefire",
    "description": "The SpaceX CEO has criticized the Ukrainian leader for rejecting peace talks with Russia, calling his stance “cruel and inhumane” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613597-musk-slams-zelensky-for-rejecting/",
    "timestamp": "2025-03-03T06:39:00Z"
  },
  {
    "title": "Lindsey Graham Slams Zelensky over Refusal to Resign: ‘Until There Is an Election, No One Has a Voice’",
    "description": "Sen. Lindsey Graham (R-SC) criticized Ukrainian President Volodymyr Zelensky for refusing to resign after Zelensky dismissed Graham’s previous comments calling for him to resign in the aftermath of his meeting with President Donald Trump in the Oval Office. I…",
    "link": "https://freerepublic.com/focus/f-news/4301668/posts",
    "timestamp": "2025-03-03T06:37:52Z"
  },
  {
    "title": "Jeremy Strong is changing men's red carpet fashion with one colour",
    "description": "The Succession star's head-to-toe brown outfits, of all the possible colours, turned him into the man to watch on the red carpet this awards season.",
    "link": "https://www.abc.net.au/news/2025-03-03/oscars-2025-jeremy-strong-and-the-broutfit/105003290",
    "timestamp": "2025-03-03T06:34:33Z"
  },
  {
    "title": "Trump Blasts UK's Apple Encryption Order, Warns Against 'Grave' Privacy Violations: 'That's Something… You Hear About With China'",
    "description": "President Donald Trump has strongly criticized the U.K. government's demand for Apple Inc. (NASDAQ:AAPL) to create a backdoor into its encrypted cloud storage, comparing the move to authoritarian surveillance tactics used in China.\nWhat Happened: In an interv…",
    "link": "https://biztoc.com/x/2d49b56ee9096449",
    "timestamp": "2025-03-03T06:31:54Z"
  },
  {
    "title": "Trump's past speeches to Congress asked them to pass his agenda. Now, he's willing to go it alone",
    "description": "Judging by his past speeches to Congress, President Donald Trump once felt the need to ask lawmakers to pass his agenda",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-past-speeches-congress-asked-pass-agenda-now-119375408",
    "timestamp": "2025-03-03T06:30:29Z"
  },
  {
    "title": "Trump Endorses 5 Cryptos For National Reserve – Bitcoin To Be ‘At The Heart’ Of It",
    "description": "United States President Donald Trump has made yet another bold move in the crypto field. After earlier announcing plans to establish a strategic Bitcoin reserve, he now intends to include several additional digital assets. Related Reading: XRP Sky-High Target…",
    "link": "http://www.newsbtc.com/news/trump-endorses-5-cryptos-for-national-reserve-bitcoin-to-be-at-the-heart-of-it/",
    "timestamp": "2025-03-03T06:30:17Z"
  },
  {
    "title": "USAID vs. India: How Trump’s crackdown alters Washington-Delhi dynamics",
    "description": "Trump’s war on the deep state has sparked global ripples, including in India where USAID funding was allegedly used to drive voter turnout Read Full Article at RT.com",
    "link": "https://www.rt.com/india/613553-foreign-interference-exposed-how-trump/",
    "timestamp": "2025-03-03T06:30:14Z"
  },
  {
    "title": "Oscars Dodge Mentioning Donald Trump, but Some Speeches Still Hit on Hot-Button Political Issues",
    "description": "The Oscars ceremony Sunday evening kept within the mold of prior awards ceremonies this year, steering clear of politics and avoiding even name-dropping Donald Trump. There was a brief zinger by host Conan O’Brien, spurred by trophies won by “Anora”: “Two win…",
    "link": "https://variety.com/2025/film/news/oscars-dodge-mentioning-trump-politics-1236325866/",
    "timestamp": "2025-03-03T06:30:05Z"
  },
  {
    "title": "Making history at the Oscars 2025: Five takeaways from the Academy Awards",
    "description": "A documentary makes a statement in support of Palestinian rights, while other artists break barriers in film diversity.",
    "link": "https://www.aljazeera.com/news/2025/3/3/making-history-at-the-academy-awards-five-takeaways-from-the-2025-oscars",
    "timestamp": "2025-03-03T06:30:03Z"
  },
  {
    "title": "Cardano Founder Speaks Out Over Rumored White House Ties",
    "description": "Charles Hoskinson, founder of Cardano, has addressed swirling speculations regarding his potential ties to the White House. The rumors gained traction over the past few weeks due to several subtle hints by Hoskinson. Last week, Hoskinson announced the cancell…",
    "link": "https://bitcoinist.com/cardano-founder-rumored-white-house-ties/",
    "timestamp": "2025-03-03T06:30:02Z"
  }
]