[
  {
    "title": "Russia Claims New Victories After Trump Sets Deadline",
    "description": "The latest advances come as Russia intensifies its war, despite fresh pressure from Trump to stop.",
    "link": "https://www.newsweek.com/russia-ukraine-war-trump-deadline-2099569",
    "timestamp": "2025-07-16T09:45:30Z"
  },
  {
    "title": "Prabowo Confirms US to Impose 19% Tariff on Indonesian Goods",
    "description": "Indonesia’s president said he struck a 19% tariff deal with US President Donald Trump, the first confirmation of the key agreement detail after months of talks between the countries.",
    "link": "https://financialpost.com/pmn/business-pmn/prabowo-confirms-us-to-impose-19-tariff-on-indonesian-goods",
    "timestamp": "2025-07-16T09:45:17Z"
  },
  {
    "title": "No One Has Exacted More Iconic Revenge Than The Yes Men. Can Their Tactics Live Up to 2025?",
    "description": "In Trump’s exhausting second term, we need them more than ever. But what happens when your target becomes revenge-proof?",
    "link": "https://slate.com/culture/2025/07/donald-trump-political-protest-hoax-revenge-yes-men.html",
    "timestamp": "2025-07-16T09:45:00Z"
  },
  {
    "title": "Trump on smaller nations in Africa and the Caribbean: ‘We’ll probably set one tariff for all of them’",
    "description": "President Donald Trump told reporters Tuesday that he plans to place tariffs of over 10% on smaller countries, including nations in Africa and the Caribbean.\n“We’ll probably set one tariff for all of them,” Trump said, adding that it could be “a little over 1…",
    "link": "https://biztoc.com/x/ae1f1c4042a0ad8b",
    "timestamp": "2025-07-16T09:43:42Z"
  },
  {
    "title": "Senate GOP barely move ahead on Trump request to cancel $9 billion in approved spending but spare Bush-era HIV/AIDS program",
    "description": "The amount of savings pales compared to the $3.4 trillion in projected deficits over the next decade that Republicans put in motion in passing Trump's big tax and spending cut bill two weeks ago.",
    "link": "https://fortune.com/2025/07/16/senate-gop-trump-cancel-9-billion-spending-spare-bush-era-hiv-aids-program/",
    "timestamp": "2025-07-16T09:41:27Z"
  },
  {
    "title": "Trump Threatens Drug Tariffs; Hassett Frontrunner For Fed Chair",
    "description": "On today's podcast: 1) President Donald Trump said he was likely to impose tariffs on pharmaceuticals as soon as the end of the month and that levies on semiconductors could come soon as well, suggesting that those import taxes could hit alongside broad “reci…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trump-threatens-drug-tariffs-bank-earnings-continue",
    "timestamp": "2025-07-16T09:40:38Z"
  },
  {
    "title": "NHL player Dominik Hasek slams US President Donald Trump over false Epstein files claim",
    "description": "NHL great Dominik Hasek has publicly criticized US President Donald Trump for spreading false claims about the origins of the Jeffrey Epstein files. Hasek also accused Trump of enabling Russian aggression in Ukraine. Known for taking firm political stands, th…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/nhl-player-dominik-hasek-slams-us-president-donald-trump-over-false-epstein-files-claim/articleshow/122569686.cms",
    "timestamp": "2025-07-16T09:38:23Z"
  },
  {
    "title": "Trump threatens to impose drug and chip tariffs as soon as 1 August",
    "description": "US president talks of low tariff to give pharmaceutical firms a year or so to build, and then making it ‘very high’\nDonald Trump has threatened to impose tariffs on pharmaceutical products and semiconductors as soon as 1 August, the latest deadline for the in…",
    "link": "https://biztoc.com/x/dcc8f4e6e6384e43",
    "timestamp": "2025-07-16T09:32:28Z"
  },
  {
    "title": "Donald Trump Suffers 'Brutal' Polling Over Jeffrey Epstein",
    "description": "Two new polls show that a majority of Americans think the government is covering up evidence related to Epstein.",
    "link": "https://biztoc.com/x/c6cbd2b8bed926b4",
    "timestamp": "2025-07-16T09:32:18Z"
  },
  {
    "title": "Despairing Hunter Biden Says Democrats Lost Election Due to Disloyalty to His Father",
    "description": "Democrat disloyalty to President Joe Biden sowed the seeds for the party's spectacular loss to President Donald Trump in the last election, according to no lesser authority than Hunter Biden.\nThe post Despairing Hunter Biden Says Democrats Lost Election Due t…",
    "link": "https://www.breitbart.com/politics/2025/07/16/despairing-hunter-biden-says-democrats-lost-election-due-to-disloyalty-to-his-father/",
    "timestamp": "2025-07-16T09:31:53Z"
  },
  {
    "title": "Trump on smaller nations in Africa and the Caribbean: ‘We’ll probably set one tariff for all of them’",
    "description": "Trump also said he would “probably” announce tariffs on pharmaceutical drugs at the “end of the month.”",
    "link": "https://fortune.com/2025/07/16/trump-on-smaller-nations-in-africa-and-the-caribbean-well-probably-set-one-tariff-for-all-of-them/",
    "timestamp": "2025-07-16T09:31:52Z"
  },
  {
    "title": "“We could do that”: Donald Trump floats ‘football’ rename, then sparks FIFA Final drama",
    "description": "Donald Trump's appearance at the FIFA Club World Cup final sparked controversy. He suggested renaming soccer as football in the US. This came before the 2026 FIFA World Cup. Trump's comment made global waves. Boos erupted during the anthem and medal ceremony.…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/we-could-do-that-donald-trump-floats-football-rename-then-sparks-fifa-final-drama/articleshow/122568641.cms",
    "timestamp": "2025-07-16T09:31:12Z"
  },
  {
    "title": "Trump is testing how far he can go",
    "description": "Trump’s threat to strip Rosie O’Donnell of her citizenship is a “test.”Kids do it all the time. Throw a tantrum in the store demanding cookies and if the parents don’t remove them from the store right away, every visit will see the tantrums escalate. Testing …",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-authoritarian-2673236826/",
    "timestamp": "2025-07-16T09:30:01Z"
  },
  {
    "title": "What Trump’s Cuba Policy Should Be to Advance US Interests",
    "description": "Peter Kornbluh\n\n\n\nThe danger of “maximum pressure” vs. the promise of “pragmatic engagement.”\r\n\n\r\n\n\nThe post What Trump’s Cuba Policy Should Be to Advance US Interests appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/trump-cuba-diplomacy-rubio-latin-america/",
    "timestamp": "2025-07-16T09:30:00Z"
  },
  {
    "title": "Nvidia’s win on chips reduces China tensions, raises questions on tech rivalry",
    "description": "The chip manufacturer said overnight that it had been given assurances that it could sell its H20 artificial-intelligence chips in China again.",
    "link": "https://www.livemint.com/companies/nvidias-win-on-chips-reduces-china-tensions-raises-questions-on-tech-rivalry-11752657428660.html",
    "timestamp": "2025-07-16T09:29:47Z"
  },
  {
    "title": "Donald Trump Suffers 'Brutal' Polling Over Jeffrey Epstein",
    "description": "Two new polls show that a majority of Americans think the government is covering up evidence related to Epstein.",
    "link": "https://www.newsweek.com/donald-trump-polling-jeffrey-epstein-2099513",
    "timestamp": "2025-07-16T09:27:56Z"
  },
  {
    "title": "Russia attacks Ukraine with hundreds of drones, energy infrastructure hit",
    "description": "KYIV (Reuters) -Russia attacked cities across Ukraine overnight with hundreds of drones and a missile strike, hitting energy infrastructure and wounding at least 15 people. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/16/russia-attacks-ukraine-with-hundreds-of-drones-energy-infrastructure-hit",
    "timestamp": "2025-07-16T09:27:00Z"
  },
  {
    "title": "‘Catalyst for progress’: Nvidia CEO hails China’s AI at Beijing expo",
    "description": "An estimated 650 companies from 60 countries have gathered at the China International Supply Chain Expo in Beijing.",
    "link": "https://www.aljazeera.com/news/2025/7/16/catalyst-for-progress-nvidia-ceo-hails-chinas-ai-at-beijing-expo",
    "timestamp": "2025-07-16T09:26:55Z"
  },
  {
    "title": "Los Angeles mayor celebrates ‘retreat’ as Pentagon ends deployment of 2,000 National Guard troops in city",
    "description": "It wasn't immediately clear what prompted the 60-day deployment to end suddenly, nor was it immediately clear how long the rest of the troops would stay in the region.",
    "link": "https://fortune.com/2025/07/16/los-angeles-mayor-retreat-pentagon-ends-deployment-2000-national-guard/",
    "timestamp": "2025-07-16T09:25:16Z"
  },
  {
    "title": "NATO chief warns India, Brazil, China over Russia trade ties",
    "description": "Mark Rutte urged the three BRICS countries to \"make the phone call\" to Russian President Vladimir Putin to stop the war in Ukraine — or face secondary sanctions from the US. NATO Secretary-General Mark Rutte has called on China, Brazil and India to pressure R…",
    "link": "https://www.dw.com/en/nato-chief-warns-india-brazil-china-over-russia-trade-ties/a-73292180",
    "timestamp": "2025-07-16T09:23:00Z"
  },
  {
    "title": "Ousting Jerome Powell risks setting off market panic, but Trump may have found a workaround",
    "description": "President Donald Trump says he has finally found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, accusing him of mismanaging the U.S. central bank’s $2.5 billion renovation project.\nThe push comes after a monthslong campaign by Trum…",
    "link": "https://biztoc.com/x/93cf71488200b35f",
    "timestamp": "2025-07-16T09:21:15Z"
  },
  {
    "title": "U.S. tariff cut shows Indonesia's strategic position: deputy minister",
    "description": "Deputy Minister for Investment and Downstream Todotua Pasaribu stated that the Republic of Indonesia holds a strategic position, as reflected by a significant ...",
    "link": "https://en.antaranews.com/news/366765/us-tariff-cut-shows-indonesias-strategic-position-deputy-minister",
    "timestamp": "2025-07-16T09:16:27Z"
  },
  {
    "title": "OOPS! Trump Taunts AOC And Crockett, Then Undermines Himself In Next Breath",
    "description": "The president's boast backfired on one crucial point.",
    "link": "https://www.huffpost.com/entry/donald-trump-aoc-crockett-demand_n_6877578ce4b0e02f048dc44e",
    "timestamp": "2025-07-16T09:14:57Z"
  },
  {
    "title": "Glorious Victory to the Revolution! Commandante Karen Exults as Trump Withdraws Some National Guard Troops from L.A.",
    "description": "Mario Tama / Getty)\nThe post Glorious Victory to the Revolution! Commandante Karen Exults as Trump Withdraws Some National Guard Troops from L.A. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/16/glorious-victory-to-the-revolution-commandante-karen-exults-as-trump-withdraws-some-national-guard-from-l-a/",
    "timestamp": "2025-07-16T09:13:30Z"
  },
  {
    "title": "Trump is signaling a change on Ukraine. What does it mean for Putin?: ANALYSIS",
    "description": "The key question now is how seriously will Putin take Trump's new approach?",
    "link": "https://abcnews.go.com/International/trump-ukraine-weapons-putin-reaction-analysis/story?id=123759522",
    "timestamp": "2025-07-16T09:12:25Z"
  },
  {
    "title": "How Will Putin React to Trump's Ukraine Pivot? Newsweek Contributors Debate",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced this week that the U.S. will send Patriot air-defense missiles to Ukraine and threatened new tariffs on Russia.\nWill Vladimir Putin back down? What should Trump's next move be?…",
    "link": "https://biztoc.com/x/f25f6c8cf143c130",
    "timestamp": "2025-07-16T09:10:53Z"
  },
  {
    "title": "How the One Big Beautiful Bill Act Will Affect Clean Energy Jobs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWhen President Donald Trump signed the \"One Big Beautiful Bill\" Act, or OBBBA, into law earlier this month, he delivered on his pledge to end many forms of federal support for clean energy—or, as Trump calls i…",
    "link": "https://biztoc.com/x/a6de20db1ac60fdd",
    "timestamp": "2025-07-16T09:10:51Z"
  },
  {
    "title": "EU trade chief heads to Washington as bloc readies retaliation against Trump tariffs",
    "description": "Brussels is hesitating over how strongly and how quickly to push back.",
    "link": "https://www.politico.eu/article/eu-trade-chief-to-head-to-washington-as-bloc-readies-retaliation-measures/",
    "timestamp": "2025-07-16T09:09:50Z"
  },
  {
    "title": "Japan's Kawasaki Kisen prepared to reroute more ships away from US over tariffs, CEO says",
    "description": "TOKYO (Reuters) -Japanese shipper Kawasaki Kisen (K-Line) is adjusting its U.S. services and is prepared to reroute more ships away to other regions as it...",
    "link": "https://ca.finance.yahoo.com/news/japans-kawasaki-kisen-prepared-reroute-090930918.html",
    "timestamp": "2025-07-16T09:09:30Z"
  },
  {
    "title": "Ousting Jerome Powell risks setting off market panic, but Trump may have found a workaround",
    "description": "The president indicated that Powell’s handling of an extensive renovation project could be grounds to take the unprecedented and possibly legally dubious step of firing him.",
    "link": "https://fortune.com/2025/07/16/jerome-powell-fed-chair-renovation-trump/",
    "timestamp": "2025-07-16T09:09:25Z"
  },
  {
    "title": "Republicans declared it 'crypto' week in the House. It's not going as planned",
    "description": "House Republicans are struggling with cryptocurrency legislation that they had expected to pass during what they dubbed “crypto week.”",
    "link": "https://abcnews.go.com/Politics/wireStory/republicans-declared-crypto-week-house-planned-123786800",
    "timestamp": "2025-07-16T09:08:35Z"
  },
  {
    "title": "Indonesia’s Prabowo hails ‘new era’ in US ties after Trump trade deal",
    "description": "Indonesian President Prabowo Subianto welcomes deal to lower tariff rate from 32 to 19 percent.",
    "link": "https://www.aljazeera.com/economy/2025/7/16/indonesias-prabowo-hails-new-era-in-us-ties-after-trump-trade-deal",
    "timestamp": "2025-07-16T09:07:31Z"
  },
  {
    "title": "Former US Marine Corps reservist charged in immigration detention center shooting",
    "description": "Federal prosecutors have charged a former U.S. Marine Corps reservist with attempted murder after an attack at a Texas immigration detention center",
    "link": "https://abcnews.go.com/US/wireStory/former-us-marine-corps-reservist-charged-texas-immigration-123789552",
    "timestamp": "2025-07-16T09:07:00Z"
  },
  {
    "title": "Native American radio stations at risk as Congress looks to cut $1B in funding",
    "description": "Native American radio stations could face shutdowns if Congress cuts over $1 billion from the Corporation for Public Broadcasting",
    "link": "https://abcnews.go.com/US/wireStory/native-american-radio-stations-risk-congress-cut-1b-123790107",
    "timestamp": "2025-07-16T09:05:09Z"
  },
  {
    "title": "COVID, tariffs help launch Amish-powered company in Lancaster County toward market dominance",
    "description": "Two historic events that challenged the viability of many businesses have vaulted an Amish-powered Lancaster County manufacturer into contention for the title of market leader, and has it moving on expansion plans.",
    "link": "https://lancasteronline.com/news/local/covid-tariffs-help-launch-amish-powered-company-in-lancaster-county-toward-market-dominance/article_0d3d2952-5d12-4b8b-81d2-58a5ed33d054.html",
    "timestamp": "2025-07-16T09:05:00Z"
  },
  {
    "title": "GOP chair counting on more voters than Dems next year. Can they flip a congressional seat?",
    "description": "The Palm Beach County Supervisor of Elections website shows Democrats with 329,122 voters to the Republicans' 297,787, a difference of just 31,335.",
    "link": "https://www.palmbeachpost.com/story/news/politics/2025/07/16/gop-chair-trump-palm-beach-county-majority-flip-congress-seat/84445349007/",
    "timestamp": "2025-07-16T09:02:46Z"
  },
  {
    "title": "Iran Makes Nuclear Threat",
    "description": "Tehran say it may increase uranium enrichment to 90 percent amid looming snapback sanctions deadline.",
    "link": "https://www.newsweek.com/iran-threatens-increase-nuclear-enrichment-snapback-sanctions-2099538",
    "timestamp": "2025-07-16T09:02:05Z"
  },
  {
    "title": "Trump hardens position as India, US trade teams resume talks for pact",
    "description": "US demands steep tariff reductions, conditional market access; India seeks lower import barriers, withdrawal of reciprocal duties.",
    "link": "https://www.thehindubusinessline.com/economy/trump-hardens-position-as-india-us-trade-teams-resume-talks-for-pact/article69818213.ece",
    "timestamp": "2025-07-16T09:01:59Z"
  },
  {
    "title": "If America doesn’t shape the world, our rivals will",
    "description": "Congress is considering cuts to critical national security funding that would reduce America's global footprint. That would undermine U.S. leadership when we need it",
    "link": "https://www.foxnews.com/opinion/america-doesnt-shape-world-our-rivals",
    "timestamp": "2025-07-16T09:00:56Z"
  },
  {
    "title": "BKPM urges US to import locally downstreamed copper",
    "description": "The Ministry of Investment/Investment Coordinating Board (BKPM) is collaborating with relevant institutions to ensure Indonesia&#39;s copper products exported ...",
    "link": "https://en.antaranews.com/news/366757/bkpm-urges-us-to-import-locally-downstreamed-copper",
    "timestamp": "2025-07-16T09:00:34Z"
  },
  {
    "title": "Citigroup CEO Confirms Interest In Issuing A Proprietary Stablecoin—Reuters",
    "description": "American multinational investment bank Citigroup announced plans to potentially issue its stablecoin, as CEO Jane Fraser revealed during a post-earnings conference call.  As first reported by Reuters, Fraser emphasized the bank’s focus on both the stablecoin …",
    "link": "http://www.newsbtc.com/news/citigroup-ceo-confirms-interest-in-issuing-a-proprietary-stablecoin-reuters/",
    "timestamp": "2025-07-16T09:00:29Z"
  },
  {
    "title": "Retailers caught red-handed using Trump's tariffs as cover for price gouging",
    "description": "Retailers exploit tariffs to justify price hikes on products not affected by trade policies, contradicting Trump's America First agenda to lower consumer costs",
    "link": "https://www.foxnews.com/opinion/retailers-caught-red-handed-using-trumps-tariffs-cover-price-gouging",
    "timestamp": "2025-07-16T09:00:09Z"
  },
  {
    "title": "How Will Putin React to Trump's Ukraine Pivot? Newsweek Contributors Debate",
    "description": "Will Vladimir Putin back down? What should Trump's next move be? And what does the future hold for Ukraine?",
    "link": "https://www.newsweek.com/how-will-putin-react-trumps-ukraine-pivot-newsweek-contributors-debate-2099195",
    "timestamp": "2025-07-16T09:00:02Z"
  },
  {
    "title": "Student Loan Payments To Change From August 1: What To Know",
    "description": "Overall, the change will see borrowers being charged more than $27 billion in interest over the next 12 months.",
    "link": "https://www.newsweek.com/student-loan-payments-change-august-2098994",
    "timestamp": "2025-07-16T09:00:01Z"
  },
  {
    "title": "Michael Jordan vs. LeBron James: Experts debate which icon had the bigger cultural impact",
    "description": "Michael Jordan's Nike contract was a game-changer. LeBron James has weighed in on social issues. Who was a bigger influencer off the court?",
    "link": "https://www.sportingnews.com/us/nba/news/michael-jordan-vs-lebron-james-experts-debate-cultural-impact/c59a05bd1833b6decf3a6083",
    "timestamp": "2025-07-16T09:00:01Z"
  },
  {
    "title": "How the One Big Beautiful Bill Act Will Affect Clean Energy Jobs",
    "description": "$522 billion of announced clean energy investments yet to come online had been linked to tax credits the OBBBA is axing—and could now be at risk.",
    "link": "https://www.newsweek.com/2025/07/25/how-one-big-beautiful-bill-act-will-affect-clean-energy-jobs-2099193.html",
    "timestamp": "2025-07-16T09:00:01Z"
  },
  {
    "title": "COVID, tariffs help launch Amish-powered company toward market dominance",
    "description": "Two historic events that challenged the viability of many businesses have vaulted an Amish-powered Lancaster County manufacturer into contention for the title of market leader, and has it moving on expansion plans.",
    "link": "https://lancasteronline.com/news/local/covid-tariffs-help-launch-amish-powered-company-toward-market-dominance/article_0d3d2952-5d12-4b8b-81d2-58a5ed33d054.html",
    "timestamp": "2025-07-16T09:00:00Z"
  },
  {
    "title": "We Have Always Been at War With Iran",
    "description": "Josef Burton\n\n\n\nSince 1979, the US has been in perpetual economic, military, and political combat with the Iranian state. The only difference now is that bombs are falling.\r\n\n\r\n\n\nThe post We Have Always Been at War With Iran appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=563564",
    "timestamp": "2025-07-16T09:00:00Z"
  },
  {
    "title": "Lost in Translation: Interpreter Cutbacks Could Put Patient Lives on the Line",
    "description": "Recent federal reductions in funding for language assistance and President Donald Trump’s executive order designating English as the official language of the United States have some health advocates worried that millions of people with limited English profici…",
    "link": "https://kffhealthnews.org/news/article/medical-interpreter-funding-staff-cuts-patient-lives-english-language-services/",
    "timestamp": "2025-07-16T09:00:00Z"
  },
  {
    "title": "President Trump Solidifies U.S. Position as Leader in AI",
    "description": "President Donald J. Trump is making America the undisputed world leader in artificial intelligence — and today marked a massive leap forward with the announcement of over $90 billion in groundbreaking AI and energy investments in Pennsylvania.\nJoined by leade…",
    "link": "https://biztoc.com/x/ca3a0874d312fddd",
    "timestamp": "2025-07-16T08:59:28Z"
  },
  {
    "title": "Kremlin: No new Trump-Putin call planned yet",
    "description": "Kremlin spokesperson Dmitry Peskov revealed on Wednesday that there are currently no plans to organize a phone call between Russian and United States presidents Vladimir Putin and Donald Trump. At the...",
    "link": "https://biztoc.com/x/a0c3de84c328ecb7",
    "timestamp": "2025-07-16T08:59:27Z"
  },
  {
    "title": "Stephen Colbert and Jon Stewart are angry about their parent company Paramount’s $16 million Trump settlement—a ‘big fat bribe’",
    "description": "This isn’t a joke. They’ve made that clear.\nCBS “Late Show” host Stephen Colbert condemned parent company Paramount Global’s settlement of President Donald Trump’s lawsuit over a “60 Minutes” story as a “big fat bribe” during his first show back from a vacati…",
    "link": "https://biztoc.com/x/394852ad82858e47",
    "timestamp": "2025-07-16T08:59:08Z"
  },
  {
    "title": "House GOP’s ‘crypto week’ wobbles as 13 Republicans join Democrats to block 3 bills",
    "description": "The procedural snafu brought the House’s so-called “crypto week” to a standstill — and dealt a blow to President Donald Trump.",
    "link": "https://fortune.com/crypto/2025/07/16/house-crypto-week-wobbles-13-republicans-join-democrats-block-3-bills/",
    "timestamp": "2025-07-16T08:57:58Z"
  },
  {
    "title": "Chelsea Lift Replica Club World Cup as Original Trophy Remains with Trump",
    "description": "Chelsea, Trump and the Club World Cup ConfusionWhy the real trophy stayed in Washington while the Blues lifted a replicaTrophy drama on a global stageChelsea’s recent celebration of their Club World...",
    "link": "https://www.eplindex.com/133678/chelsea-lift-replica-club-world-cup-as-original-trophy-remains-with-trump.html",
    "timestamp": "2025-07-16T08:50:00Z"
  },
  {
    "title": "Netherlands, Scandinavian states look to join Trump Ukraine arms plan",
    "description": "Brussels, Belgium (AFP) July 15, 2025\n\n\n Denmark, Sweden and the Netherlands on Tuesday said they wanted to participate in US President Donald Trump's plan for Europe to buy American weapons for Ukraine. \n\nTrump announced a tougher line on Moscow over its war…",
    "link": "https://www.spacewar.com/reports/Netherlands_Scandinavian_states_look_to_join_Trump_Ukraine_arms_plan_999.html",
    "timestamp": "2025-07-16T08:48:22Z"
  },
  {
    "title": "Ukraine 'shouldn't target' Moscow: Trump",
    "description": "Washington (AFP) July 15, 2025\n\n\n Donald Trump said Tuesday Ukraine should not target Moscow and that he had no plans to supply Kyiv with long-range missiles, following a report the US leader had encouraged President Volodymyr Zelensky to hit the Russian capi…",
    "link": "https://www.spacewar.com/reports/Ukraine_shouldnt_target_Moscow_Trump_999.html",
    "timestamp": "2025-07-16T08:48:22Z"
  },
  {
    "title": "China's Xi vows greater support for Russia as meets Lavrov",
    "description": "Beijing (AFP) July 15, 2025\n\n\n Chinese President Xi Jinping told Russia's top diplomat on Tuesday that their countries should \"strengthen mutual support\", state media said, as foreign ministers gathered in Beijing for Shanghai Cooperation Organisation talks. …",
    "link": "https://www.spacewar.com/reports/Chinas_Xi_vows_greater_support_for_Russia_as_meets_Lavrov_999.html",
    "timestamp": "2025-07-16T08:48:22Z"
  },
  {
    "title": "Pentagon inks contracts for Musk's xAI, competitors",
    "description": "New York (AFP) July 15, 2025\n\n\n The Pentagon announced contracts on Monday with multiple leading US artificial intelligence firms including Elon Musk's xAI, which has faced intense scrutiny in recent days over anti-Semitic posts by its Grok chatbot. \n\nEach of…",
    "link": "https://www.spacewar.com/reports/Pentagon_inks_contracts_for_Musks_xAI_competitors_999.html",
    "timestamp": "2025-07-16T08:48:22Z"
  },
  {
    "title": "Trump gives Russia 50 days to make Ukraine deal",
    "description": "Washington (AFP) July 15, 2025\n\n\n US President Donald Trump told Russia on Monday to end its war in Ukraine within 50 days or face massive new economic sanctions, as he laid out plans for infusions of weaponry for Kyiv via NATO. \n\nTrump said he was \"very, ver…",
    "link": "https://www.spacewar.com/reports/Trump_gives_Russia_50_days_to_make_Ukraine_deal_999.html",
    "timestamp": "2025-07-16T08:48:22Z"
  },
  {
    "title": "Asian bonds see first monthly foreign outflow in five months",
    "description": "Foreign investors pulled funds from Asian bonds in June for the first time in five months, as concerns over a U.S. tariff deadline and heightened tensions in...",
    "link": "https://finance.yahoo.com/news/asian-bonds-see-first-monthly-084812654.html",
    "timestamp": "2025-07-16T08:48:12Z"
  },
  {
    "title": "Stephen Colbert and Jon Stewart are angry about their parent company Paramount’s $16 million Trump settlement—a ‘big fat bribe’",
    "description": "Colbert's “bribe” reference was to the pending sale of Paramount to Skydance Media, which needs Trump administration approval.",
    "link": "https://fortune.com/2025/07/16/stephen-colbert-jon-stewart-paramount-16-million-trump-settlement-big-fat-bribe/",
    "timestamp": "2025-07-16T08:46:31Z"
  },
  {
    "title": "Trump's 50-day ultimatum gives Russia a chance to wear down Ukraine",
    "description": "President Donald Trump’s ultimatum to Russia to accept a peace deal in Ukraine within 50 days or face bruising sanctions has given the Kremlin extra time to pursue its summer offensive",
    "link": "https://abcnews.go.com/International/wireStory/trumps-50-day-ultimatum-russia-chance-wear-ukraine-123790290",
    "timestamp": "2025-07-16T08:46:17Z"
  },
  {
    "title": "FMCSA Administrator nominee Derek Barrs makes first Congressional appearance",
    "description": "Derek Barrs testified before the Senate Committee on Commerce, Science and Transportation Wednesday to answer questions related to his views on Congressional priorities for the agency.",
    "link": "https://www.overdriveonline.com/regulations/article/15750826/fmcsa-administrator-nominee-takes-step-toward-confirmation",
    "timestamp": "2025-07-16T08:46:12Z"
  },
  {
    "title": "Nvidia's Huang Says 'Doing Our Best' To Serve Chinese Market",
    "description": "Nvidia CEO Jensen Huang said on Wednesday his firm was \"doing our best\" to serve China's vast market for semiconductors after meeting Beijing officials.",
    "link": "https://www.ibtimes.com/nvidias-huang-says-doing-our-best-serve-chinese-market-3778628",
    "timestamp": "2025-07-16T08:45:19Z"
  },
  {
    "title": "Dow Jones Futuro recua com cautela antes de dados de inflação e balanços",
    "description": "Goldman Sachs, Morgan Stanley e Bank of America divulgam resultados hoje\nThe post Dow Jones Futuro recua com cautela antes de dados de inflação e balanços appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mercados/dow-jones-futuro-recua-com-cautela-antes-de-dados-de-inflacao-e-balancos/",
    "timestamp": "2025-07-16T08:43:59Z"
  },
  {
    "title": "France, UK and Germany to restore Iran sanctions if no progress on a deal",
    "description": "The United Kingdom, France and Germany have agreed to restore tough U.N. sanctions on Iran by the end of August if there has been no concrete progress on a nuclear deal",
    "link": "https://abcnews.go.com/Business/wireStory/france-uk-germany-restore-sanctions-iran-month-progress-123791508",
    "timestamp": "2025-07-16T08:36:09Z"
  },
  {
    "title": "CLARITY Act explained: What it means for Crypto Week and beyond",
    "description": "Discover how the CLARITY Act could reshape US crypto regulation, define SEC and CFTC roles and impact investors, innovators and markets beyond Crypto Week.",
    "link": "https://cointelegraph.com/explained/clarity-act-explained-what-it-means-for-crypto-week-and-beyond",
    "timestamp": "2025-07-16T08:35:00Z"
  },
  {
    "title": "Kremlin Calls on All Parties to Put Pressure on Ukraine to Continue Talks With Russia",
    "description": "Moscow is calling on all parties to put pressure on Ukraine so that a new round of negotiations with Russia can take place, Kremlin spokesman Dmitry Peskov said on Wednesday.",
    "link": "https://sputnikglobe.com/20250716/kremlin-calls-on-all-parties-to-put-pressure-on-ukraine-to-continue-talks-with-russia-1122446840.html",
    "timestamp": "2025-07-16T08:33:48Z"
  },
  {
    "title": "Trump tariffs once viewed as punitive now win market approval",
    "description": "While countries such as India and Vietnam have attempted to negotiate US tariffs of well below 20%, Trump has said he’s eyeing blanket tariffs of 15% to 20% on most trading partners",
    "link": "https://www.bloomberg.com/news/articles/2025-07-16/trump-tariffs-once-viewed-as-punitive-now-win-market-approval",
    "timestamp": "2025-07-16T08:32:12Z"
  },
  {
    "title": "India, China and Brazil facing ‘consequences’ for Russia trade ties – NATO chief",
    "description": "Mark Rutte has asked the BRICS leaders to call Vladimir Putin and convince him to get serious about peace talks Read Full Article at RT.com",
    "link": "https://www.rt.com/india/621548-india-china-and-brazil-facing/",
    "timestamp": "2025-07-16T08:31:53Z"
  },
  {
    "title": "Asian shares are mixed after Nvidia nudges Nasdaq to a record, while other US stocks slump",
    "description": "Shares in Asia are mixed after an update on U.S. inflation pulled most stocks on Wall Street lower, though gains for Nvidia pushed the Nasdaq to another record",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-mixed-after-nvidia-nudges-nasdaq-record-123790720",
    "timestamp": "2025-07-16T08:30:14Z"
  },
  {
    "title": "The US sends third-country deportees to the small African kingdom of Eswatini",
    "description": "The United States says it has sent five men to the small African nation of Eswatini in an expansion of the Trump administration’s third-country deportation program",
    "link": "https://abcnews.go.com/International/wireStory/us-sends-country-deportees-small-african-kingdom-eswatini-123791984",
    "timestamp": "2025-07-16T08:24:33Z"
  },
  {
    "title": "Russia Attacks Ukraine’s Central Regions as US Envoy in Kyiv",
    "description": "Russia launched a massive drone attack on Ukraine’s central regions overnight, hitting mostly civilian infrastructure and industrial enterprises.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-attacks-ukraines-central-regions-as-us-envoy-in-kyiv",
    "timestamp": "2025-07-16T08:23:26Z"
  },
  {
    "title": "Trump Tariffs Once Viewed as Punitive Now Win Market Approval",
    "description": "Financial markets greeted US President Donald Trump’s tariff deal with Indonesia with little fanfare Wednesday, signaling the rate of around 20% that was once viewed as punitive is now seen as workable.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-once-viewed-as-punitive-now-win-market-approval",
    "timestamp": "2025-07-16T08:18:25Z"
  },
  {
    "title": "Republicans declared it 'crypto' week in the House. It's not going as planned",
    "description": "House Republicans are struggling with cryptocurrency legislation that they had expected to pass during what they dubbed “crypto week.”.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/15/republicans-declared-it-crypto-week-in-the-house-its-not-going-as-planned/",
    "timestamp": "2025-07-16T08:17:14Z"
  },
  {
    "title": "Trump rules out long-range missiles for Ukraine",
    "description": "Trump has denied a Military Watch Magazine report that he is considering sending JASSM cruise missiles to Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621546-trump-ukraine-weapons-moscow/",
    "timestamp": "2025-07-16T08:17:04Z"
  },
  {
    "title": "EU funding ‘death’ of Ukraine – Moscow",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova has accused the EU of funding Ukraine’s walk toward destruction Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621547-zakharova-kallas-us-weapons/",
    "timestamp": "2025-07-16T08:16:58Z"
  },
  {
    "title": "Joe Rogan points out major contradiction as he slams Donald Trump's handling of Epstein files in scathing rant",
    "description": "Joe Rogan was pulling no punches as he criticised Donald Trump again, this time over the alleged Epstein files",
    "link": "https://www.ladbible.com/news/politics/joe-rogan-donald-trump-epstein-files-245689-20250716",
    "timestamp": "2025-07-16T08:14:57Z"
  },
  {
    "title": "Indonesia's 19-percent US tariff is Asia's lowest: Palace",
    "description": "The 19 percent import tariff imposed by the US President Donald Trump administration on Indonesian goods is among the lowest for Asian countries, according to ...",
    "link": "https://en.antaranews.com/news/366733/indonesias-19-percent-us-tariff-is-asias-lowest-palace",
    "timestamp": "2025-07-16T08:13:15Z"
  },
  {
    "title": "The Sino-American Battle for Brains",
    "description": "In the struggle for global economic, technological, and geopolitical leadership, higher education can make all the difference. While China invests heavily in building world-class universities, the US is actively undermining its elite institutions of higher ed…",
    "link": "https://www.project-syndicate.org/commentary/us-attacking-universities-while-china-invests-in-higher-education-by-lee-jong-wha-2025-07",
    "timestamp": "2025-07-16T08:12:33Z"
  },
  {
    "title": "Trump Says Most House GOP Holdouts Have Agreed To Back His Crypto Bills—What To Know",
    "description": "Thirteen Republicans, mostly hardline conservatives, voted alongside all Democrats to block a procedural vote on the crypto legislative package.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/16/trump-says-most-house-gop-holdouts-have-agreed-to-back-his-crypto-bills-what-to-know/",
    "timestamp": "2025-07-16T08:11:52Z"
  },
  {
    "title": "Budget needs to include cost-of-living measures - Doherty",
    "description": "Cost-of-living measures need to be included in Budget 2026, Sinn Féin Finance spokesperson Pearse Doherty has said.",
    "link": "https://www.rte.ie/news/politics/2025/0716/1523748-budget-measures/",
    "timestamp": "2025-07-16T08:05:00Z"
  },
  {
    "title": "Govt intends to throw 'families under the bus' - McDonald",
    "description": "Runaway prices are worrying households as the Government refuses to include a cost-of-living package in the next Budget, the Sinn Féin Leader has said.",
    "link": "https://www.rte.ie/news/politics/2025/0716/1523748-budget-measures-government/",
    "timestamp": "2025-07-16T08:05:00Z"
  },
  {
    "title": "Trump Reveals Melania's Role In Toughening His Stance On Vladimir Putin: 'I Go Home, I Tell The First Lady...'",
    "description": "President Donald Trump has credited First Lady Melania Trump for influencing his tougher stance on the Russia-Ukraine conflict.\nWhat Happened: During a meeting with NATO Secretary General Mark Rutte in the White House on Tuesday, Trump acknowledged Melania’s …",
    "link": "https://biztoc.com/x/b04181408f4f70b3",
    "timestamp": "2025-07-16T08:03:38Z"
  },
  {
    "title": "Marla Maples wants cleaner skies in America as EPA investigates weather altering",
    "description": "MAHA and wellness advocate Marla Maples talked to Fox News Digital about her concerns on weather engineering as it relates to public health as the EPA shares new resources about contrails.",
    "link": "https://www.foxnews.com/travel/marla-maples-wants-cleaner-skies-america-epa-investigates-weather-altering",
    "timestamp": "2025-07-16T08:00:38Z"
  },
  {
    "title": "Marla Maples wants cleaner skies in America as EPA pushes ban on weather altering",
    "description": "MAHA and wellness advocate Marla Maples talked to Fox News Digital about her concerns on weather engineering as it relates to public health as the EPA shares new resources about contrails.",
    "link": "https://www.foxnews.com/travel/marla-maples-wants-cleaner-skies-america-epa-pushes-ban-weather-altering",
    "timestamp": "2025-07-16T08:00:38Z"
  },
  {
    "title": "House Republicans Block Epstein Files Amendment To Landmark Crypto Bill – Details",
    "description": "As the ‘Crypto Week’ begins, House Republicans have blocked an amendment to one of the three landmark digital asset legislations that would have forced the US Department of Justice (DOJ) to release the controversial Epstein files. Related Reading: Battle For …",
    "link": "https://bitcoinist.com/house-republicans-block-epstein-files-amendment-to-landmark-crypto-bill-details/",
    "timestamp": "2025-07-16T08:00:11Z"
  },
  {
    "title": "Today in History: July 16, Trinity nuclear weapon test",
    "description": "The United States exploded its first experimental atomic bomb in the desert of Alamogordo, New Mexico.",
    "link": "https://www.denverpost.com/2025/07/16/today-in-history-july-16-trinity-nuclear-weapon-test-2/",
    "timestamp": "2025-07-16T08:00:05Z"
  },
  {
    "title": "Today in History: July 16, Trinity nuclear weapon test",
    "description": "The United States exploded its first experimental atomic bomb in the desert of Alamogordo, New Mexico.",
    "link": "https://www.bostonherald.com/2025/07/16/today-in-history-july-16-trinity-nuclear-weapon-test-2/",
    "timestamp": "2025-07-16T08:00:05Z"
  },
  {
    "title": "Russia may hope to use Trump's 50-day window to wear down Ukraine, but quick gains seem unlikely",
    "description": "Amidst Trump's ultimatum for a Ukraine peace deal, Russia's summer offensive faces staunch resistance. Despite territorial gains in eastern Ukraine and attacks on key cities, Moscow's progress remains slow. Capturing strategic strongholds like Pokrovsk and Ko…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-may-hope-to-use-trumps-50-day-window-to-wear-down-ukraine-but-quick-gains-seem-unlikely/articleshow/122564898.cms",
    "timestamp": "2025-07-16T08:00:02Z"
  },
  {
    "title": "“So actually I’m vegan now”: Customer calls off his McDonald’s Snack Wrap review after finding “chicken rotator cuff” inside",
    "description": "One McDonald's snack wrap review came to a screeching halt after he found what he called a \"rotator cuff\" in his meal. After taking a single bite, he showed the camera a stretchy bit of tissue that completely ruined his appetite.\n\n\nThis doesn't bode well for …",
    "link": "https://www.dailydot.com/news/mcdonalds-snack-wrap-chicken-rotator-cuff/",
    "timestamp": "2025-07-16T08:00:00Z"
  },
  {
    "title": "Former DNC chair Jaime Harrison launches a podcast — and invites Hunter Biden as an early guest",
    "description": "Former Democratic National Committee chair Jaime Harrison is stepping back into the political arena with a new podcast as he — and his party — look to bounce back from losing the White House last year.",
    "link": "https://www.nbcnews.com/politics/elections/former-dnc-chair-jaime-harrison-launches-podcast-invites-hunter-biden-rcna218788",
    "timestamp": "2025-07-16T08:00:00Z"
  },
  {
    "title": "Trump wants to take over some U.S. cities. It's unlikely — but he can make life hard for them",
    "description": "U.S. President Donald Trump is in a battle with American cities — and in the last few weeks, he's implied that he would use the powers of the presidency to order a federal takeover of New York City and Washington, D.C. Does he have the power to?",
    "link": "https://www.cbc.ca/news/world/trump-federal-takeover-new-york-washington-dc-1.7584505",
    "timestamp": "2025-07-16T08:00:00Z"
  }
]