[
  {
    "title": "Iranian Kurdish dissidents abroad watch for signs of Tehran vulnerability after war with Israel",
    "description": "Iranian Kurdish dissidents have been watching from abroad for signs that the government in Tehran might falter after the 12-day Israel-Iran war",
    "link": "https://abcnews.go.com/International/wireStory/iranian-kurdish-dissidents-abroad-watch-signs-tehran-vulnerability-123259848",
    "timestamp": "2025-06-27T05:58:26Z"
  },
  {
    "title": "The new populism of the Judeocidal left",
    "description": "The radical candidate poised to become New York’s mayor embodies an alliance between reactionary Islamism and left- wing progressivism. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410749",
    "timestamp": "2025-06-27T05:56:50Z"
  },
  {
    "title": "America is a Thing You can Move Easily",
    "description": "In the late morning of June 28, 2024, I told James Holloway the following: “James, my heart is broken.”  This was the first time I addressed Dr. Holloway in this fashion. Dr. Holloway is my cardiologist, a kind, cultured, and genteel physician who saved my li…",
    "link": "https://www.counterpunch.org/2025/06/27/america-is-a-thing-you-can-move-easily/",
    "timestamp": "2025-06-27T05:55:42Z"
  },
  {
    "title": "Trump Calls For Netanyahu's Pardon",
    "description": "US President Donald Trump said that Israeli Prime Minister Benjamin Netanyahu's trial must be immediately canceled or he should be pardoned as a \"great hero, who has done so much for the state.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/06/israel-250626-sputnik02.htm",
    "timestamp": "2025-06-27T05:53:12Z"
  },
  {
    "title": "Leader congratulates Iranian nation on victory, says Zionist regime was 'crushed'",
    "description": "In his message following the end of the Israeli aggression against the Islamic Republic and the regime's unilateral declaration of a ceasefire, the Leader of the Islamic Revolution on Thursday congratulated the Iranian nation on its glorious victory.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-presstv08.htm",
    "timestamp": "2025-06-27T05:53:12Z"
  },
  {
    "title": "Where's Iran's Uranium? In Wake Of US Bombing, A Mystery And An Anxious Hunt",
    "description": "The dust has settled over Fordow, Iran's remote mountain nuclear facility, and two other locations the United States says it \"obliterated\" over the weekend in a dramatic escalation of its efforts to hamstring Tehran's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-rferl03.htm",
    "timestamp": "2025-06-27T05:53:02Z"
  },
  {
    "title": "Iran says there is 'no plan' to restart nuclear negotiations with United States",
    "description": "Iran has consistently denied seeking a nuclear weapon while defending its “legitimate rights” to the peaceful use of atomic energy.",
    "link": "https://www.thejournal.ie/iran-says-there-is-no-plan-to-restart-nuclear-negotiations-with-united-states-6745040-Jun2025/",
    "timestamp": "2025-06-27T05:53:00Z"
  },
  {
    "title": "Ex-Foreign Minister Lee lifts curtain on Trump-Tsai call in new book",
    "description": "Former Foreign Minister David Lee (李大維) has shared a behind-the-scenes account of the historic 2016 phone call between then-President Tsai Ing-wen (蔡英文) and then-U.S. President-elect Donald Trump, in a new memoir published Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250626-cna06.htm",
    "timestamp": "2025-06-27T05:52:56Z"
  },
  {
    "title": "A Show Of Support But No Action: Ukraine's Diplomatic Disappointment in Brussels and The Hague",
    "description": "This could have been a momentous week in Ukraine's long-term wish of joining the European Union and NATO. In the end, it wasn't.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250627-rferl01.htm",
    "timestamp": "2025-06-27T05:52:56Z"
  },
  {
    "title": "NATO Hague declaration reflects underlying transatlantic rifts",
    "description": "Leaders of NATO member states concluded a two-day summit on Wednesday with a brief joint declaration committing to significantly higher defense spending, while sidestepping contentious issues such as support for Ukraine.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250626-pdo01.htm",
    "timestamp": "2025-06-27T05:52:55Z"
  },
  {
    "title": "European states yield to US pressure of 'unreasonable' military spending hike",
    "description": "NATO member countries have pledged to nearly triple their military spending under pressure from US President Donald Trump, deepening militarization across Europe despite ongoing social and economic strains.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250626-presstv01.htm",
    "timestamp": "2025-06-27T05:52:55Z"
  },
  {
    "title": "US call for zero enrichment in Iran against NPT; threatens global peace: Russia",
    "description": "A senior Russian diplomat says Washington's \"unjustifiable\" insistence on zero enrichment in Iran runs counter to the Nuclear Non-Proliferation Treaty (NPT) and poses a threat to global peace and security.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-presstv11.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Iran asserts right to peaceful nuclear energy under NPT; doubts US sincerity in diplomacy",
    "description": "Iranian Foreign Ministry spokesman Esmaeil Baghaei has reiterated the Islamic Republic's right to use nuclear energy for peaceful purposes as per Article IV of the Nuclear Non-Proliferation Treaty (NPT), saying the country is determined to preserve it \"under …",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-presstv07.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "No Nuclear Talks Scheduled But US, Iran Maintain Contact, Both Sides Say",
    "description": "The United States and Iran remain in contact over the resumption of talks on Tehran's nuclear program, but no formal negotiations are planned, officials from both sides said on June 26.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250627-rferl01.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Netanyahu Seeks 2-Week Delay in Trial Testimony Over Regional Tensions",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Thursday requested a two-week break in the court proceedings against him on corruption charges, citing pressing regional challenges and the need to focus on critical national issues, including the Gaza conflict and…",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/06/israel-250626-sputnik01.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "'Disgraceful': Tehran slams NATO chief's congratulatory message to Trump after Iran attack",
    "description": "Tehran has condemned a message from NATO Secretary-General Mark Rutte congratulating U.S. President Donald Trump following an airstrike against Iran, calling the gesture \"disgraceful, despicable and irresponsible.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250625-irna03.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "'Historically Successful' Strike on Iranian Nuclear Site Was 15 Years in the Making",
    "description": "This weekend's strike on Iran's Fordow Fuel Enrichment Plant used 30,000-pound GBU-57 \"massive ordnance penetrator\" bombs. The design of those weapons and plans for attacking the site had been in the works for some 15 years, which resulted in the destruction …",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-dodnews01.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Iran's Top Legislative Body Approves Bill Suspending Cooperation With IAEA",
    "description": "The bill suspending Tehran's cooperation with the International Atomic Energy Agency (IAEA) has been approved to become law by Iran's Guardian Council, Iranian Parliament Speaker Mohammad Bagher Ghalibaf said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-sputnik01.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Khamenei Reemerges In New Video, Says Iran Gave A 'Hard Slap' To US, Downplays Nuclear Damage",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei has declared \"victory\" over Israel in his first message to the public since a US-brokered cease-fire took effect two days ago.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-rferl01.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Leader: Iran crushed Israel",
    "description": "Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has congratulated the Iranian people on the victory over the Israeli regime.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250626-irna05.htm",
    "timestamp": "2025-06-27T05:52:54Z"
  },
  {
    "title": "Trump defends US strikes on Iran nuclear facilities at Nato summit",
    "description": "US president dismisses as 'fake news' reports that plants had only been partly damaged and that enriched uranium had been removed Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/27/trump-defends-us-strikes-on-iran-nuclear-facilities-at-nato-summit",
    "timestamp": "2025-06-27T05:50:00Z"
  },
  {
    "title": "India finds out about decisions important to it from White House: Congress' dig on trade deal",
    "description": "After U.S. President Donald Trump announced that a “very big” trade deal with India is imminent, India’s opposition Congress party criticized the government, suggesting that major decisions affecting India are being revealed first by the White House.",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/india-finds-out-about-decisions-important-to-it-from-white-house-congress-dig-on-trade-deal/articleshow/122105196.cms",
    "timestamp": "2025-06-27T05:43:25Z"
  },
  {
    "title": "Wolfspeed Plans Bankruptcy After Clinching Deal With Creditors",
    "description": "Wolfspeed Inc. is planning to file for bankruptcy by July 1 with a deal to slash its debt by about $4.6 billion and hand over control to convertible noteholders.",
    "link": "https://www.livemint.com/companies/news/wolfspeed-plans-bankruptcy-after-clinching-deal-with-creditors-11751002996478.html",
    "timestamp": "2025-06-27T05:43:15Z"
  },
  {
    "title": "First female US ambassador to Russia to leave her role",
    "description": "The first female US ambassador to Russia is leaving her role after serving through one of the most difficult periods in relations between the two countries.",
    "link": "https://news.sky.com/story/first-female-us-ambassador-to-russia-to-leave-her-role-13389210",
    "timestamp": "2025-06-27T05:40:00Z"
  },
  {
    "title": "India refuses to sign joint statement at defence summit over Kashmir",
    "description": "India has said that its concerns about terrorism were not adequately reflected in the document.",
    "link": "https://www.bbc.com/news/articles/czxe48njkxwo",
    "timestamp": "2025-06-27T05:39:30Z"
  },
  {
    "title": "ND “Locks In” double score, battle for second place in polls: Konstantopoulou ahead of Androulakis",
    "description": "New Democracy (ND) and PASOK show a slight decline compared to the May poll – Inflation remains the top social issue – Mitsotakis remains unchallenged in suitability for prime minister\nThe post ND “Locks In” double score, battle for second place in polls: Kon…",
    "link": "https://en.protothema.gr/2025/06/27/nd-locks-in-double-score-battle-for-second-place-in-polls-konstantopoulou-ahead-of-androulakis/",
    "timestamp": "2025-06-27T05:38:46Z"
  },
  {
    "title": "Diego Luna Hits Trump With Frank Reminder Of 1 Huge Failure",
    "description": "The actor also offered a tip on how to deal with authoritarian figures such as the president.",
    "link": "https://www.huffpost.com/entry/diego-luna-trump-border-wall_n_685e215ce4b0bb504500091e",
    "timestamp": "2025-06-27T05:33:26Z"
  },
  {
    "title": "Army Veteran Hits 'Thin-Skinned' Pete Hegseth With A Blunt 'Wish'",
    "description": "Paul Rieckhoff said the defense secretary for using a \"very dangerous shield\" during a wild Iran press conference.",
    "link": "https://www.huffpost.com/entry/army-veteran-paul-rieckhoff-pete-hegseth-iran-media_n_685e096de4b073fdc1d51c82",
    "timestamp": "2025-06-27T05:32:37Z"
  },
  {
    "title": "Spain PM alleges 'genocide' in Gaza as rescuers say 65 killed",
    "description": "Spanish Prime Minister Pedro Sanchez on Thursday became the most prominent European leader to describe the situation in Gaza as a \"genocide\", as rescuers in the war-ravaged Palestinian territory said Israeli forces killed 65 people.",
    "link": "https://www.hurriyetdailynews.com/spain-pm-alleges-genocide-in-gaza-as-rescuers-say-65-killed-210808",
    "timestamp": "2025-06-27T05:32:37Z"
  },
  {
    "title": "Iran says no plan for new US nuclear talks, plays down impact of strikes",
    "description": "Iran on Thursday denied it is set to resume nuclear talks with the United States after the end of a 12-day war with Israel, and accused Washington of exaggerating the impact of U.S. strikes.",
    "link": "https://www.hurriyetdailynews.com/iran-says-no-plan-for-new-us-nuclear-talks-plays-down-impact-of-strikes-210807",
    "timestamp": "2025-06-27T05:29:12Z"
  },
  {
    "title": "‘What If They Actually Had To Serve Themselves?’: Newt Gingrich Says Democrats Exposed Their Elitism On Deportations",
    "description": "Gingrich said Democrats exposed their \"remarkable\" privilege in how they’ve responded to the deportation of illegal migrants.",
    "link": "https://dailycaller.com/2025/06/27/newt-gingrich-democrats-deportations-illegal-migrants/",
    "timestamp": "2025-06-27T05:20:30Z"
  },
  {
    "title": "Chambers to focus on costs over design for big projects",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/06/27/chambers-to-focus-on-costs-over-design-for-big-projects-and-how-trump-could-hit-the-economy/",
    "timestamp": "2025-06-27T05:19:37Z"
  },
  {
    "title": "Confident in trajectory of most consequential partnership of 21st century: MEA on India-US ties",
    "description": "India acknowledged Pakistan Army chief's White House visit, emphasizing its robust partnership with the US, rooted in shared democratic values and growing strategic convergence. The India-US Comprehensive Global Strategic Partnership receives high-level atten…",
    "link": "https://economictimes.indiatimes.com/news/india/confident-in-trajectory-of-most-consequential-partnership-of-21st-century-mea-on-india-us-ties/articleshow/122104656.cms",
    "timestamp": "2025-06-27T05:17:03Z"
  },
  {
    "title": "Starmer's stormy first year ends in crisis - now he faces a bigger battle to turn it around",
    "description": "The PM is trying to prove to a volatile country that Labour can fix it - but that will be a challenge when profound policy disagreements are on full display",
    "link": "https://www.bbc.com/news/articles/cm2l8ge86z7o",
    "timestamp": "2025-06-27T05:16:58Z"
  },
  {
    "title": "Macron’s summit curveball",
    "description": "In today’s edition of The Capitals, read about what happened at the EU summit, how rare earths could make or break the EU’s defence ambitions, and how a motion of no confidence in Ursula von der Leyen is losing steam.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-macrons-summit-curveball/",
    "timestamp": "2025-06-27T05:16:46Z"
  },
  {
    "title": "Vessels Near Strait of Hormuz Transmit Unusual Messages to Prevent Attacks",
    "description": "Vessels near the Strait of Hormuz have been broadcasting unusual messages concerning nationality in a bid to avoid being attacked as doubts linger over the ceasefire between Israel and Iran, according to maritime risk analytics firm Windward and ship tracking…",
    "link": "https://www.insurancejournal.com/news/international/2025/06/27/829339.htm",
    "timestamp": "2025-06-27T05:15:20Z"
  },
  {
    "title": "Trump, Pharaoh, and the God who writes the story",
    "description": "Leadership is not always linear. And Divine Providence rarely unfolds in straight lines. Imagine if you had lived in Egypt in Moses' time. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410752",
    "timestamp": "2025-06-27T05:15:00Z"
  },
  {
    "title": "Coinbase US Perpetuals Are Arriving Next Month as Stock Soars to New Heights",
    "description": "Coinbase aims to fill what it describes as a “critical gap” in the U.S. market, where domestic traders have long relied on offshore platforms.",
    "link": "https://decrypt.co/327312/coinbase-us-perpetuals-are-arriving-next-month-as-stock-soars-to-new-heights",
    "timestamp": "2025-06-27T05:14:42Z"
  },
  {
    "title": "Lutnick Says US-China Trade Truce Signed, 10 Deals Imminent - Bloomberg",
    "description": "Lutnick Says US-China Trade Truce Signed, 10 Deals ImminentBloomberg Trump tariffs live updates: Trump announces trade deal with ChinaYahoo Finance US says deal with Beijing will expedite rare earth exports from ChinaReuters \"Very Big One\": Donald Trump Hints…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178200152",
    "timestamp": "2025-06-27T05:12:37Z"
  },
  {
    "title": "Investing in Space: NATO holds out its hand to the commercial space sector",
    "description": "NATO's new commercial space sector strategy and defense spend target hike could be a boon to private space players.",
    "link": "https://www.cnbc.com/2025/06/27/investing-in-space-nato-holds-out-hand-to-the-commercial-space-sector.html",
    "timestamp": "2025-06-27T05:09:22Z"
  },
  {
    "title": "USDA Finds Safety Issues at Top Research Site After Whistleblower Complaints",
    "description": "The U.S. Department of Agriculture found significant safety issues at its top research facility in an investigation of 2023 whistleblower complaints about the state of the site, the Office of Special Counsel said in a letter sent to the White …",
    "link": "https://www.insurancejournal.com/news/national/2025/06/27/829357.htm",
    "timestamp": "2025-06-27T05:08:25Z"
  },
  {
    "title": "GE Moves Washing Machine Production from China to Kentucky with $490M Invest",
    "description": "GE Appliances announced a nearly half-billion-dollar project Thursday that it says will create 800 new jobs and shift production of clothes washers from China to its massive manufacturing complex in Kentucky. The $490 million investment positions the Kentucky…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/06/27/829374.htm",
    "timestamp": "2025-06-27T05:02:51Z"
  },
  {
    "title": "Decision on nominating next Fed chair not ‘imminent’, White House says",
    "description": "US dollar fell after report that Donald Trump could name nominee to succeed Jay Powell as soon as this summer",
    "link": "https://www.irishtimes.com/business/2025/06/27/decision-on-nominating-next-fed-chair-not-imminent-white-house-says/",
    "timestamp": "2025-06-27T05:00:01Z"
  },
  {
    "title": "The Irishman who's 'kind of directly involved in trying to stop what Trump is doing with the support of corporate America'",
    "description": "Waterford native William Fitzgerald on quitting a career in tech to fight for workers’ rights",
    "link": "https://www.irishtimes.com/business/2025/06/27/its-going-to-get-harder-for-the-kind-of-irish-mainstream-establishment-to-continue-taking-nice-pictures-with-these-tech-executives/",
    "timestamp": "2025-06-27T05:00:01Z"
  },
  {
    "title": "Like Nixon before him, Trump is weakening the dollar in a bid to correct the US’s trade deficit",
    "description": "Trump is attempting to bend the global economy to his will but is being hamstrung by the US’s deteriorating fiscal metrics",
    "link": "https://www.irishtimes.com/business/economy/2025/06/27/like-nixon-before-him-trump-is-weakening-the-dollar-in-a-bid-to-correct-the-uss-trade-deficit/",
    "timestamp": "2025-06-27T05:00:01Z"
  },
  {
    "title": "Trump’s on-off tariff announcements now the main threat to global growth",
    "description": "Whiplash effect of US policies seen as limiting investment for now",
    "link": "https://www.irishtimes.com/business/2025/06/27/trumps-on-off-tariff-announcements-now-the-main-threat-to-global-growth/",
    "timestamp": "2025-06-27T05:00:01Z"
  },
  {
    "title": "Biden-Appointed Judge Orders Trump To Keep Throwing Money at EV Chargers",
    "description": "“Another day, another liberal judicial activist making nonsensical rulings from the bench because they hate President Trump,” a DOT spokesperson said in a statement provided to the Daily Caller News Foundation. “The Biden-[former Transportation Secretary Pete…",
    "link": "https://wattsupwiththat.com/2025/06/26/biden-appointed-judge-orders-trump-to-keep-throwing-money-at-ev-chargers/",
    "timestamp": "2025-06-27T05:00:00Z"
  },
  {
    "title": "Crude oil prices rise as markets focus on economic, supply factors",
    "description": "Crude oil futures traded higher on Friday morning as markets paid more attention to economic and supply-related issues such as US trade tariffs and OPEC’s July meeting than geopolitical issues such as tensions between Iran-Israel.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-prices-rise-as-markets-focus-on-economic-supply-factors/article69743278.ece",
    "timestamp": "2025-06-27T04:50:09Z"
  },
  {
    "title": "Michelle Obama addresses lack of public appearances with husband Barack following divorce rumors",
    "description": "The former president and first lady sparked divorce rumors when Michelle failed to attend Jimmy Carter’s funeral and President Donald Trump’s inauguration in January",
    "link": "https://www.the-independent.com/life-style/michelle-obama-barack-divorce-rumors-trump-inauguration-b2778029.html",
    "timestamp": "2025-06-27T04:48:11Z"
  },
  {
    "title": "Did Taylor Swift secretly support Donald Trump? Viral photo sparks debate",
    "description": "Taylor Swift recently found herself in the spotlight again,  but not for her music. \n\nDuring the Kansas City Chiefs&apos; annual Tight End University camp, a photo of Swift strikin",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/06/27/685e1a0946163fa8458b458a.html",
    "timestamp": "2025-06-27T04:40:26Z"
  },
  {
    "title": "Hot NATO idea signals start of the second Cold War",
    "description": "NATO is bracing for potential conflict, driven by concerns over Russian aggression. A new defense posture aims for a 5% of GDP spending target, reminiscent of Cold War levels. This significant increase signals a shift from post-Cold War optimism, with nations…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-5-percent-defence-spending-gdp-target-russia-ukraine-cold-war/articleshow/122103716.cms",
    "timestamp": "2025-06-27T04:33:54Z"
  },
  {
    "title": "Lutnick says U.S.-China trade truce signed, 10 deals imminent",
    "description": "“They’re going to deliver rare earths to us” and once they do that, “we’ll take down our countermeasures,” U.S. Commerce Secretary Howard Lutnick said.",
    "link": "https://fortune.com/asia/2025/06/27/lutnick-says-us-china-trade-truce-deals-imminent/",
    "timestamp": "2025-06-27T04:32:05Z"
  },
  {
    "title": "White House says July deadline for higher tariffs may be extended",
    "description": "WASHINGTON (AFP): US President Donald Trump's administration could extend a July deadline when higher tariffs on imports from dozens of countries are set to kick in, the White House said Thursday (June 26). Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/27/white-house-says-july-deadline-for-higher-tariffs-may-be-extended",
    "timestamp": "2025-06-27T04:31:00Z"
  },
  {
    "title": "Dollar slumps to lowest against the euro since 2021 as Donald Trump considers nominee for Fed chair",
    "description": "The US dollar hit a three-and-a-half-year low against the euro and sterling yesterday as markets eye the potential of a new Donald Trump-appointed chair of the Federal Reserve slashing interest rates.",
    "link": "https://www.independent.ie/business/irish/dollar-slumps-to-lowest-against-the-euro-since-2021-as-donald-trump-considers-nominee-for-fed-chair/a1431156478.html",
    "timestamp": "2025-06-27T04:30:00Z"
  },
  {
    "title": "Letters: As McStay leaves Mayo role, expect a few sparks ahead of the next appointment",
    "description": "Over the years, Mayo has had its fair share of negative and positive GAA supporters. Sometimes football managers are like car batteries – they need negative and positive leads to keep going.",
    "link": "https://www.independent.ie/opinion/letters/letters-as-mcstay-leaves-mayo-role-expect-a-few-sparks-ahead-of-the-next-appointment/a151928287.html",
    "timestamp": "2025-06-27T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Clock is ticking on Trump’s vicious trade sanctions deadline, so every minute counts",
    "description": "The substantial shadow of Donald Trump continues to loom over the 27 European Union leaders today as they enter the second day of a crucial summit.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-clock-is-ticking-on-trumps-vicious-trade-sanctions-deadline-so-every-minute-counts/a1219499789.html",
    "timestamp": "2025-06-27T04:30:00Z"
  },
  {
    "title": "Diego Luna Says Comedy Can Defend Freedom’: ‘You Know What Else These Strongmen Really Don’t Like? To Be Unpopular’ | Video",
    "description": "\"Without satire... democracy doesn’t just weaken, it can disappear, and we cannot let that happen,\" the actor says while guest-hosting \"Jimmy Kimmel Live\nThe post Diego Luna Says Comedy Can Defend Freedom’: ‘You Know What Else These Strongmen Really Don’t Lik…",
    "link": "https://www.thewrap.com/diego-luna-celebrates-comedy-defend-freedom-jimmy-kimmel-monologue/",
    "timestamp": "2025-06-27T04:26:49Z"
  },
  {
    "title": "Asian shares are mostly higher after US stocks rise to the brink of a record",
    "description": "Asian are mostly higher after U.S. stocks ran up to the edge of another record. U.S. futures and oil prices also logged slight gains. Investors were watching for further details following reports that the U.S. and China have signed a trade deal. On Thursday, …",
    "link": "https://www.seattlepi.com/news/world/article/asian-shares-are-mostly-higher-after-us-stocks-20396654.php",
    "timestamp": "2025-06-27T04:23:16Z"
  },
  {
    "title": "Rural schools feel the pinch from Trump administration's cuts to mental health grants",
    "description": "School districts around the country are cutting back plans to expand their staffing of mental health specialists because of Trump administration cuts to federal grants",
    "link": "https://abcnews.go.com/US/wireStory/rural-schools-feel-pinch-trump-administrations-cuts-mental-123258832",
    "timestamp": "2025-06-27T04:22:16Z"
  },
  {
    "title": "Vance Boelter’s wife says family was ‘completely blindsided’ by shootings of Minnesota lawmakers",
    "description": "‘We are absolutely shocked, heartbroken and completely blindsided,’ Jenny Boelter said",
    "link": "https://www.the-independent.com/news/world/americas/crime/vance-boelter-wife-blindsided-minnesota-lawmakers-shooting-b2778009.html",
    "timestamp": "2025-06-27T04:16:58Z"
  },
  {
    "title": "‘This Wasn’t Mission Impossible’: Cotton Destroys Doubts Over Trump’s Iran Operation",
    "description": "Senator Tom Cotton (R-AR) praised President Donald Trump and the U.S. military Thursday during a press conference following a classified briefing on Iran, declaring the joint U.S. Israeli mission a historic blow to Tehran’s nuclear ambitions while slamming me…",
    "link": "https://www.breitbart.com/politics/2025/06/26/this-wasnt-mission-impossible-cotton-destroys-doubts-over-trumps-iran-operation/",
    "timestamp": "2025-06-27T04:16:30Z"
  },
  {
    "title": "Megyn Kelly Guest Describes What ‘Deranged’ Mindset Led Progressives To Hand NYC To Socialist Nominee",
    "description": "\"Ruthless\" podcast co-host told Megyn Kelly the \"deranged\" mindset of \"white guilt\" led progressives in NYC to choose Mamdani as the Democratic mayoral nominee.",
    "link": "https://dailycaller.com/2025/06/27/megyn-kelly-guest-progressives-new-york-city-zohran-mamdani-democrats/",
    "timestamp": "2025-06-27T04:11:42Z"
  },
  {
    "title": "How Israel’s Domestic Crises and Netanyahu’s Power Projection are Reshaping the Middle East",
    "description": "By Spyros A. Sofos, Simon Fraser University (The Conversation) - Israel’s recent strikes on Iranian territory have been widely framed as an act of deterrence or yet another episode in a protracted regional rivalry. Such interpretations overlook the deeper mot…",
    "link": "https://www.juancole.com/2025/06/netanyahus-projection-reshaping.html",
    "timestamp": "2025-06-27T04:06:25Z"
  },
  {
    "title": "Silicon Valley execs sworn in to US Army reserves specialist unit",
    "description": "Four technology executives have been brought into the military fold with an explicit remit to make the Armed Forces ‘more lethal’, reflecting the softening attitudes throughout the sector towards ‘the business of inflicting violence’, but critics say the move…",
    "link": "https://www.computerweekly.com/news/366626673/Silicon-Valley-execs-sworn-in-to-US-Army-reserves-specialist-unit",
    "timestamp": "2025-06-27T04:06:00Z"
  },
  {
    "title": "Supreme Court meets Friday to decide 6 remaining cases, including birthright citizenship",
    "description": "The Supreme Court will decide six important cases. These include Trump's order on birthright citizenship. Also, a Maryland case on LGBTQ storybooks is up for decision. The court will also look into Louisiana's congressional districts. A Texas law on online po…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/supreme-court-meets-friday-to-decide-6-remaining-cases-including-birthright-citizenship/articleshow/122103373.cms",
    "timestamp": "2025-06-27T04:04:38Z"
  },
  {
    "title": "Republicans and Climate Breakdown: They Know Better",
    "description": "( Tomdispatch.com ) - In the annals of national suicide, the present dismantling of the American state will surely rank high. It may not reach the apogee attained by Russia in its final Tsarist days or by Louis XVI in the run-up to the French Revolution, but …",
    "link": "https://www.juancole.com/2025/06/republicans-climate-breakdown.html",
    "timestamp": "2025-06-27T04:04:05Z"
  },
  {
    "title": "Don’t Let Iran Become Another Iraq",
    "description": "Nuclear uncertainty is bad for regional stability.",
    "link": "http://foreignpolicy.com/2025/06/27/iran-new-nuclear-deal-trump/",
    "timestamp": "2025-06-27T04:01:55Z"
  },
  {
    "title": "What we don't know about the Israel-Iran war",
    "description": "It has been a chaotic two weeks since Israel launched its surprise attack on Iran, and although the fighting is on pause, many questions remain.",
    "link": "https://www.abc.net.au/news/2025-06-27/what-we-don-t-know-about-the-israel-iran-war-us-conflict/105457264",
    "timestamp": "2025-06-27T04:01:26Z"
  },
  {
    "title": "Hey, POTUS, America First Ain’t Got No Beef With Iran And Don’t Need No Bunker Busters, Neither",
    "description": "As the clock ticked away on the Donald’s two weeks ultimatum to Iran—-surrender or I will bomb you to smithereens—the bright line between legitimate homeland security, on the one hand, and the pursuit of Empire, on the other, has never been more illuminated. …",
    "link": "https://www.lewrockwell.com/2025/06/david-stockman/hey-potus-america-first-aint-got-no-beef-with-iran-and-dont-need-no-bunker-busters-neither/",
    "timestamp": "2025-06-27T04:01:00Z"
  },
  {
    "title": "Tit-for-tat, 10 for 10: Everything you missed at last night’s EUCO",
    "description": "EU chiefs dissected the latest US trade offer that arrived as they digested the summit dinner, but there were splits in outlook between the leaders.",
    "link": "https://www.euractiv.com/section/politics/news/tit-for-tat-10-for-10-everything-you-missed-at-last-nights-euco/",
    "timestamp": "2025-06-27T04:00:55Z"
  },
  {
    "title": "TRUMP Token In Trouble? Over $4 Million Liquidity Exit Sparks Crash Fears",
    "description": "US President Donald Trump’s namesake meme token has tumbled hard, slumping nearly 90% from its all-time high set six months ago. Related Reading: Double Win: Dogwifhat Jumps 24% Alongside Bitcoin’s $107K Push Today, TRUMP is trading at $8.80, down 6% in the l…",
    "link": "http://www.newsbtc.com/altcoin/trump-token-in-trouble-4-4-million-liquidity-exit-sparks-crash-fears/",
    "timestamp": "2025-06-27T04:00:52Z"
  },
  {
    "title": "In Its Own Way, Zohran Mamdani’s NYC Nomination Is A Miracle",
    "description": "There’s a miracle happening in New York City. It might be the greatest miracle since “Miracle on 34th Street,” that classic Christmas movie starring Edmund Gwenn and Maureen O’Hara, about a department store Santa who just migh...",
    "link": "https://www.americanthinker.com/articles/2025/06/in_its_own_way_zohran_mamdani_s_nyc_nomination_is_a_miracle.html",
    "timestamp": "2025-06-27T04:00:00Z"
  },
  {
    "title": "China asserts its military might in a new and uncertain world order",
    "description": "While its defence budget has more than doubled since 2010, its forces have not been in a war since the 1970s",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/06/27/china-asserts-its-military-might-in-a-new-and-uncertain-world-order/",
    "timestamp": "2025-06-27T04:00:00Z"
  },
  {
    "title": "A story out of Iowa explains why college grads were instrumental in Mamdani’s NYC victory",
    "description": "One of the facts that instantly emerged from Zohran Mamdani’s victory in the mayoral Democrat party primaries in New York City is that he was pushed over the top, not by working-class people, minorities, or immigrants. Instead, his victory came...",
    "link": "https://www.americanthinker.com/blog/2025/06/a_story_out_of_iowa_explains_why_college_grads_were_instrumental_in_mamdani_s_nyc_victory.html",
    "timestamp": "2025-06-27T04:00:00Z"
  },
  {
    "title": "Senators Diverge Sharply On Damage Done By Iran Strikes After Classified Briefing",
    "description": "Senators are emerging from a classified briefing with sharply diverging assessments of President Donald Trump’s bombing of three Iranian nuclear sites.",
    "link": "https://www.huffpost.com/entry/us-mideast-wars-congress_n_685e166de4b073fdc1d521d1",
    "timestamp": "2025-06-27T03:58:44Z"
  },
  {
    "title": "Idaho doctor, patients sue over new law halting public benefits to immigrants in US unlawfully",
    "description": "A new Idaho law restricting public benefits for undocumented immigrants is facing a legal challenge",
    "link": "https://abcnews.go.com/Health/wireStory/idaho-doctor-patients-sue-new-law-halting-public-123258155",
    "timestamp": "2025-06-27T03:58:26Z"
  },
  {
    "title": "Stocks Climb, Dollar Holds On Trade Hopes And Rate Bets",
    "description": "Asian markets rose Friday on fresh trade hopes and the dollar held around three-year lows amid bets of cuts to US interest rate cuts.",
    "link": "https://www.ibtimes.com/stocks-climb-dollar-holds-trade-hopes-rate-bets-3777032",
    "timestamp": "2025-06-27T03:42:09Z"
  },
  {
    "title": "Trump Says US-China Trade Deal Signed",
    "description": "US President Donald Trump said on Thursday that the United States signed a deal with China a day ago, and another agreement may be coming up with India.",
    "link": "https://sputnikglobe.com/20250627/trump-says-us-china-trade-deal-signed-1122346116.html",
    "timestamp": "2025-06-27T03:41:00Z"
  },
  {
    "title": "Idaho doctor, patients sue over new law halting public benefits to immigrants in US unlawfully",
    "description": "A new Idaho law restricting public benefits for undocumented immigrants is facing a legal challenge. The ACLU of Idaho filed a federal lawsuit Thursday night on behalf of a doctor and four HIV patients. The law limits access to programs like the Ryan White HI…",
    "link": "https://www.seattlepi.com/news/article/idaho-doctor-patients-sue-over-new-law-halting-20396597.php",
    "timestamp": "2025-06-27T03:35:56Z"
  },
  {
    "title": "Trump administration will put Abrego on trial before deporting him again",
    "description": "The case of Kilmar Abrego has become a flashpoint over U.S. President Donald Trump's hard-line immigration agenda.",
    "link": "https://www.japantimes.co.jp/news/2025/06/27/world/trump-abrego-trial-deport/",
    "timestamp": "2025-06-27T03:32:00Z"
  },
  {
    "title": "US talks to Pakistan about promoting 'durable peace between Israel and Iran'",
    "description": "WASHINGTON (Reuters) -U.S. Secretary of State Marco Rubio and Pakistan Prime Minister Shehbaz Sharif held a call on Thursday in which they discussed...",
    "link": "https://www.yahoo.com/news/us-talks-pakistan-promoting-durable-033138368.html",
    "timestamp": "2025-06-27T03:31:38Z"
  },
  {
    "title": "Bezos, Sanchez To Say 'I Do' In Venice",
    "description": "Amazon tycoon Jeff Bezos and Lauren Sanchez are expected to tie the knot Friday at a sumptuous, secluded ceremony attended by celebrity friends on an island in Venice's lagoon.",
    "link": "https://www.ibtimes.com/bezos-sanchez-say-i-do-venice-3777031",
    "timestamp": "2025-06-27T03:30:29Z"
  },
  {
    "title": "Macron cautions against Iran NPT exit after US strikes",
    "description": "Following US strikes on Iranian nuclear facilities, French President Emmanuel Macron declares the strikes \"genuinely effective\" but warns that Iran's potential withdrawal from the Non-Proliferation Treaty (NPT) would be the \"worst-case scenario.",
    "link": "https://www.israelnationalnews.com/news/410744",
    "timestamp": "2025-06-27T03:24:24Z"
  },
  {
    "title": "Trump says China deal signed, hints at “great” trade pact with India soon",
    "description": "Trump hints at a “very big” trade deal with India after signing a pact with China; US, India in advanced talks for a fair, balanced bilateral agreement.",
    "link": "https://www.thehindubusinessline.com/news/trump-india-us-trade-deal-soon-after-china-agreement-rare-earths/article69743128.ece",
    "timestamp": "2025-06-27T03:24:13Z"
  },
  {
    "title": "Performer Arrested for Displaying Palestinian, Sudanese Flags at Kendrick Lamar’s Halftime Show",
    "description": "Zul-Qarnain Kwame Nantambu, 41, was charged with resisting an officer and disturbing the peace by interrupting a lawful assembly\nPerformer Arrested for Displaying Palestinian, Sudanese Flags at Kendrick Lamar’s Halftime Show\nJo Vito",
    "link": "https://consequence.net/2025/06/performer-kendrick-lamar-halftime-arrested/",
    "timestamp": "2025-06-27T03:20:18Z"
  },
  {
    "title": "Family files for release in lawsuit considered first involving children challenging arrests at court",
    "description": "A mother and her two young kids are fighting for their release from a Texas immigration detention center",
    "link": "https://abcnews.go.com/US/wireStory/family-files-release-lawsuit-considered-involving-children-challenging-123257462",
    "timestamp": "2025-06-27T03:18:27Z"
  },
  {
    "title": "White House to limit intelligence sharing with Congress after leak of early Iran report",
    "description": "Top Cabinet officials are set to give senators a classified briefing Thursday about the strikes.WASHINGTON — The White House plans to limit intelligence sharing with members of Congress after an early assessment of damage caused by U.S. strikes on Iran’s nucl…",
    "link": "https://freerepublic.com/focus/f-news/4325542/posts",
    "timestamp": "2025-06-27T03:11:45Z"
  },
  {
    "title": "Trump tariffs: Nike says US trade policies could cost it $1bn",
    "description": "Nike says Trump tariffs could raise its costs by $1bn\nNike says US President Donald Trump's tariffs on key trading partners could add around $1bn (£730m) to its costs this year.\nCompany executives also said the the sportwear giant would cut its reliance on pr…",
    "link": "https://biztoc.com/x/9451fb0eeb5a6363",
    "timestamp": "2025-06-27T03:05:04Z"
  },
  {
    "title": "Former Supreme Court Justice Warns Freedom and Democracy 'At Risk'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAmid an uptick in threats to judges, former Supreme Court Justice Anthony Kennedy warned that the current hostility in America's political discourse imperils freedom and democracy.\nWhy It Matters\nRhetoric by P…",
    "link": "https://biztoc.com/x/549458a0f565fa24",
    "timestamp": "2025-06-27T03:04:52Z"
  },
  {
    "title": "Former Supreme Court Justice Warns Freedom and Democracy 'At Risk'",
    "description": "Amid the uptick in threats to judges, Kennedy issued a warning on the current tone of political discourse.",
    "link": "https://www.newsweek.com/former-supreme-court-justice-warns-freedom-democracy-risk-2091413",
    "timestamp": "2025-06-27T03:03:16Z"
  },
  {
    "title": "Trump administration plans to re-deport Abrego Garcia, Justice Department says",
    "description": "The US Justice Department says it intends to try Kilmar Abrego Garcia on federal smuggling charges before it moves to deport him.",
    "link": "https://www.abc.net.au/news/2025-06-27/kilmar-abrego-garcia-to-face-trial-before-second-deportation/105467906",
    "timestamp": "2025-06-27T02:56:59Z"
  }
]