[
  {
    "title": "Trump arrives to address US Congress",
    "description": "United States President Donald Trump addressed Congress on Tuesday, stating that his administration is bringing a \"new golden age\" to the US. Speaking to lawmakers, Trump declared, \"America is back.\" ...",
    "link": "https://biztoc.com/x/29393b05b7e3f50b",
    "timestamp": "2025-03-05T02:35:49Z"
  },
  {
    "title": "House Republican Rips Anti-Trump Sign Out of Congresswoman’s Hands as Trump Enters Joint Session",
    "description": "Rep. Melanie Stansbury (D-NM) held up a small sign as a protest Tuesday evening as President Donald Trump entered the joint session of Congress until a Republican colleague snatched it from her hands.\nThe post House Republican Rips Anti-Trump Sign Out of Cong…",
    "link": "https://www.mediaite.com/trump/house-republican-rips-anti-trump-sign-out-of-congresswomans-hands-as-trump-enters-joint-session/",
    "timestamp": "2025-03-05T02:35:15Z"
  },
  {
    "title": "Donald Trump Congress Speech: Here is what he announced about rising egg prices and relief measures",
    "description": "President Trump's address to Congress will highlight a $1-billion plan to tackle the high cost of eggs due to a bird flu crisis. The plan includes direct farmer relief, biosecurity enhancements, and increased egg imports to stabilize prices. Egg prices have s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-congress-speech-rising-egg-prices-key-announcements-and-relief-measures/articleshow/118721535.cms",
    "timestamp": "2025-03-05T02:33:32Z"
  },
  {
    "title": "Judge orders longer-term nationwide block on Trump orders on transgender youth health care",
    "description": "A federal judge has extended a nationwide block on President Donald Trump’s executive orders halting federal funding for providers of gender-affirming health care for transgender people under age 19.",
    "link": "https://www.wsls.com/news/politics/2025/03/05/second-judge-orders-longer-term-block-on-trump-orders-on-transgender-youth-health-care/",
    "timestamp": "2025-03-05T02:32:07Z"
  },
  {
    "title": "Raucous start as President Donald Trump addresses joint session of Congress",
    "description": "President Donald Trump addresses a joint session of Congress, the first of his second term since assuming office six weeks ago, as he lays out his domestic...",
    "link": "https://www.upi.com/Top_News/US/2025/03/04/president-Donald-Trump-address-joint-session-congress/7741741134024/",
    "timestamp": "2025-03-05T02:31:48Z"
  },
  {
    "title": "GOP lawmaker rips protest sign out of Dem's hand moments before Trump speech: video",
    "description": "As President Donald Trump entered Congress to deliver his first speech to the body following his re-election to office, a chaotic moment occurred on the House floor in which a member forcibly ripped a sign out of another's hand.Rep. Melanie Stansbury (D-NM) w…",
    "link": "https://www.rawstory.com/melanie-stansbury/",
    "timestamp": "2025-03-05T02:31:09Z"
  },
  {
    "title": "America is back! Trump commences his major address to Congress amid chants of \"USA, USA!\"",
    "description": "In his first address to Congress, President Trump claimed his administration achieved more in 43 days than others in years, highlighting the success of the American Dream and the country's imminent comeback. The speech comes amid economic declines due to tari…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/america-is-back-trump-commences-his-major-address-to-congress-amid-chants-of-usa-usa/articleshow/118721462.cms",
    "timestamp": "2025-03-05T02:30:16Z"
  },
  {
    "title": "Trump's 'Crypto Reserve' Is Such Brazen Corruption",
    "description": "Trump plans to use your money to buy fake money – benefiting the crypto donors who helped put him back in the White House.",
    "link": "https://zeteo.com/p/trumps-crypto-reserve-is-such-brazen",
    "timestamp": "2025-03-05T02:30:15Z"
  },
  {
    "title": "Trump's tariffs will impact what businesses buy — and sell you — worldwide",
    "description": "U.S. President Donald Trump's long-threatened tariffs are here, plunging the country into an escalating trade war with China, Canada and Mexico. Trump’s 25% tariffs on imports from Canada and Mexico went into effect Tuesday, along with a heightened 20% levy o…",
    "link": "https://japantoday.com/category/business/trump%27s-tariffs-are-now-in-effect.-they%27ll-impact-what-businesses-buy-%E2%80%94-and-sell-you-%E2%80%94-worldwide",
    "timestamp": "2025-03-05T02:30:04Z"
  },
  {
    "title": "Arab leaders meet to unveil Gaza reconstruction plan in response to Donald Trump’s displacement threat",
    "description": "Leaders of Arab countries are meeting in Cairo to endorse a Gaza reconstruction plan to counter the controversial ideas of US president Donald Trump, though a number of crucial details need to be ironed out before the proposal is finalised.",
    "link": "https://www.independent.ie/world-news/middle-east/arab-leaders-meet-to-unveil-gaza-reconstruction-plan-in-response-to-donald-trumps-displacement-threat/a384552718.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Zelensky opens door for US minerals deal in bid to get Trump back onside",
    "description": "The US and Ukraine could be poised to sign a much-debated minerals deal after Ukrainian president Volodymyr Zelensky said last week’s disastrous Oval Office clash with US president Donald Trump was “regrettable”.",
    "link": "https://www.independent.ie/world-news/europe/zelensky-opens-door-for-us-minerals-deal-in-bid-to-get-trump-back-onside/a506060283.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Digging into claim that Obama created DOGE and Trump just renamed it",
    "description": "Elon Musk, the public face of the Department of Government Efficiency, shared a claim that said the initiative has roots in an Obama-era entity.",
    "link": "https://www.snopes.com//news/2025/03/05/trump-doge-obama/",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Micheál Martin to get advice from Keir Starmer on dealing with Donald Trump",
    "description": "Taoiseach Micheál Martin is to get ­advice from UK prime minister Keir Starmer on how to handle an increasingly volatile Donald Trump.",
    "link": "https://www.independent.ie/irish-news/politics/micheal-martin-to-get-advice-from-keir-starmer-on-dealing-with-donald-trump/a611355887.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s view: Making Zelensky villain of the piece is a deception too far",
    "description": "According to Donald Trump, he has been “tested and challenged more than any president in our 250-year history”. In the wider world, his trials are shamefully trifling compared with those of Ukrainian president Volodymyr Zelensky.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-making-zelensky-villain-of-the-piece-is-a-deception-too-far/a1636499671.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Letters: Trump’s recent theatrics are doing particularly well with one happy audience",
    "description": "Whatever about the Nobel Peace Prize, which Donald Trump has said he wants to win, the US president must be a sure bet now for the Order of Lenin (‘Trump pauses all military aid to Ukraine after White House clash with Zelensky’, Independent.ie, March 4).",
    "link": "https://www.independent.ie/opinion/letters/letters-trumps-recent-theatrics-are-doing-particularly-well-with-one-happy-audience/a1351398881.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Stock markets across the west slide as Donald Trump’s tariff reality finally kicks in",
    "description": "Irish and European shares fell sharply yesterday, joining a global sell-off after US tariffs on Canada, Mexico and China took effect and as the White House has promised further anti-trade measures, including against the EU.",
    "link": "https://www.independent.ie/business/world/stock-markets-across-the-west-slide-as-donald-trumps-tariff-reality-finally-kicks-in/a1885079763.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Another ECB rate cut to benefit 130,000 homeowners with tracker mortgages",
    "description": "The European Central Bank (ECB) is set to deliver a sixth interest rate cut in a move that will benefit about 130,000 householders with tracker mortgages.",
    "link": "https://www.independent.ie/business/money/another-ecb-rate-cut-to-benefit-130000-homeowners-with-tracker-mortgages/a357886266.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Senan Molony: Why Micheál Martin won’t be waving any red flags to a bullish Donald Trump when he visits the White House",
    "description": "Taoiseach Micheál Martin and British prime minister Keir Starmer will meet face-to-face in Liverpool, the most Irish city in England, for a British-Irish summit tomorrow.",
    "link": "https://www.independent.ie/opinion/analysis/senan-molony-why-micheal-martin-wont-be-waving-any-red-flags-to-a-bullish-donald-trump-when-he-visits-the-white-house/a1827741701.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Micheál Martin to get advice from Keir Starmer on dealing with Donald Trump",
    "description": "Taoiseach Micheál Martin is to get ­advice from UK prime minister Keir Starmer on how to handle an increasingly volatile Donald Trump.",
    "link": "https://www.independent.ie/irish-news/micheal-martin-to-get-advice-from-keir-starmer-on-dealing-with-donald-trump/a611355887.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Democrat Removed as House Chamber Erupts into Chaos During Trump Speech",
    "description": "Mike Johnson removed House Democrat Al Green from the chamber after disruptions during President Trump's speech on Tuesday.",
    "link": "https://www.newsweek.com/democrat-removed-house-chamber-erupts-chaos-during-trump-speech-2039702",
    "timestamp": "2025-03-05T02:29:52Z"
  },
  {
    "title": "China aims for 5% economic growth despite challenges",
    "description": "Xi Jinping's government hopes to see a 5% economic growth in 2025, the same goal as 2024, despite slowing consumer demand at home and what looks like a new trade war with Trump.",
    "link": "https://www.dw.com/en/china-aims-for-5-economic-growth-despite-challenges/a-71828988",
    "timestamp": "2025-03-05T02:26:00Z"
  },
  {
    "title": "Trump declares 'America is back' in speech before Congress",
    "description": "President Donald Trump traveled to Capitol Hill Tuesday evening to deliver his first address before a joint session of Congress since his return to the Oval Office in January.",
    "link": "https://www.foxnews.com/politics/trump-declares-america-back-speech-before-congress",
    "timestamp": "2025-03-05T02:25:34Z"
  },
  {
    "title": "Trump Leaves White House to Deliver Address to US Congress",
    "description": "President Donald Trump will speak before a joint session of Congress on Tuesday, over a month into his unprecedented second term that’s already ushered in turmoil across the federal workforce and sparked consternation among allies.\nTrump has levied new tariff…",
    "link": "https://biztoc.com/x/01a5646b109553e8",
    "timestamp": "2025-03-05T02:24:35Z"
  },
  {
    "title": "The Oval Office blowup: What went wrong and how to fix it",
    "description": "The world may have underestimated this incident's significance due to media spin and partisan bias by those more focused on political allegiances.",
    "link": "https://www.japantimes.co.jp/commentary/2025/03/05/world/the-oval-office-blowup/",
    "timestamp": "2025-03-05T02:24:00Z"
  },
  {
    "title": "US dollar pressured by Trump trade war as China NPC begins",
    "description": "The U.S. dollar approached a three-month low as new tariffs from the U.S., Canada, and China heightened trade war fears. Chinese yuan surged with a stable 5% growth target. The euro hit near four-month highs due to a proposed German infrastructure fund. Crude…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-pressured-by-trump-trade-war-as-china-npc-begins/articleshow/118721664.cms",
    "timestamp": "2025-03-05T02:23:13Z"
  },
  {
    "title": "Trump says administration 'just getting started'",
    "description": "US President Donald Trump has addressed a joint session of Congress six weeks after he returned to the White House. His record long speech celebrated his decisions, saying that \"America is back.\" DW has the latest.",
    "link": "https://www.dw.com/en/trump-says-administration-just-getting-started/live-71815384",
    "timestamp": "2025-03-05T02:22:00Z"
  },
  {
    "title": "US: Trump addresses joint Congress session",
    "description": "US President Donald Trump is speaking to a joint session of Congress six weeks after he returned to the White House. His flurry of executive orders and cuts to services have sparked widespread anger. DW has the latest.",
    "link": "https://www.dw.com/en/us-trump-addresses-joint-congress-session/live-71815384",
    "timestamp": "2025-03-05T02:22:00Z"
  },
  {
    "title": "Trump Admin To Review $5 Billion in Columbia Grant Funding, Citing Ivy League School's 'Apparent Failure' To Address Anti-Semitism",
    "description": "The Trump administration’s multi-agency task force to combat anti-Semitism is launching a review of Columbia University's contracts and grants, citing the Ivy League institution's \"apparent failure\" to protect Jewish students. It will probe more than $5 billi…",
    "link": "https://freerepublic.com/focus/f-news/4302140/posts",
    "timestamp": "2025-03-05T02:20:38Z"
  },
  {
    "title": "Tariff-exposed stocks feel the squeeze as trade war heats up",
    "description": "U.S. stocks faced significant pressure following the latest escalation in the trade war, with new tariffs on imports from Canada and Mexico impacting sectors like automobiles, aerospace, retail, and housing. Automakers, homebuilders, and airline stocks notabl…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-exposed-stocks-feel-the-squeeze-as-trade-war-heats-up/articleshow/118721599.cms",
    "timestamp": "2025-03-05T02:17:15Z"
  },
  {
    "title": "Trump tariff uncertainty overshadows growth promises: analysts",
    "description": "by Beiyi SEOWPresident Donald Trump's tariffs and the retaliation they attracted will likely weigh on US growth and boost inflation, according to analysts, but, beyond that, uncertainty surrounding the levies threatens to overshadow optimism about his future …",
    "link": "https://www.rawstory.com/trump-tariffs-2671267110/",
    "timestamp": "2025-03-05T02:16:58Z"
  },
  {
    "title": "Judge blocks Trump's anti-transgender health care order",
    "description": "A federal judge in Maryland has issued a preliminary injunction against Donald Trump’s executive order threatening loss of federal funding for medical professionals and institutions that provide gender-affirming care to trans people under 19. That means the p…",
    "link": "https://www.advocate.com/news/anti-transgender-health-order-blocked",
    "timestamp": "2025-03-05T02:16:36Z"
  },
  {
    "title": "Trump's tariff chaos, briefly explained (Vox)",
    "description": "Vox:\nTrump's tariff chaos, briefly explained  —  The president took the global economy for a ride on Tuesday. … Donald Trump paused military aid to Ukraine on Monday night, a freeze that would fully undercut Ukraine's position ahead of planned peace talks wit…",
    "link": "https://www.memeorandum.com/250304/p173",
    "timestamp": "2025-03-05T02:15:01Z"
  },
  {
    "title": "Watch Live: Donald Trump Addresses Joint Session of Congress",
    "description": "President Donald Trump addresses a joint session of Congress on Tuesday, March 4.\nThe post Watch Live: Donald Trump Addresses Joint Session of Congress appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/04/watch-live-donald-trump-addresses-joint-session-of-congress/",
    "timestamp": "2025-03-05T02:14:49Z"
  },
  {
    "title": "CNN’s John King Says It’s ‘Not Fair’ to Expect Trump to Lower Costs on Day One: ‘The President Exaggerates’",
    "description": "CNN anchor John King told viewers it's \"not fair\" to judge Trump on his promise to immediately lower prices because \"the president exaggerates a lot.\"\nThe post CNN’s John King Says It’s ‘Not Fair’ to Expect Trump to Lower Costs on Day One: ‘The President Exag…",
    "link": "https://www.mediaite.com/news/cnns-john-king-says-its-not-fair-to-expect-trump-to-lower-costs-on-day-one-the-president-exaggerates/",
    "timestamp": "2025-03-05T02:14:44Z"
  },
  {
    "title": "Trump addresses US Congress: LIVE UPDATES",
    "description": "US President Donald Trump is delivering a speech to Congress, which he previewed as being “big” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613637-trump-makes-big-announcement/",
    "timestamp": "2025-03-05T02:14:06Z"
  },
  {
    "title": "Trump’s tariffs on Canada and Mexico just went into effect. Here are the products that could suddenly get more expensive",
    "description": "Trump’s tariffs on Canada and Mexico just went into effect. Here are the products that could suddenly get more expensive\nPresident Donald Trump on Tuesday instituted tariffs on three of its biggest trading partners, Mexico, Canada and China.\nAndrew Harnik—Get…",
    "link": "https://biztoc.com/x/cb056e9107b03e8a",
    "timestamp": "2025-03-05T02:13:34Z"
  },
  {
    "title": "US officials investigate brothers charged with human trafficking",
    "description": "TALLAHASSEE, FLORIDA — Florida's attorney general announced Tuesday that his office has opened a criminal investigation into Andrew and Tristan Tate, brothers who are charged with human trafficking in Romania, days after they returned to the United States.\n\n\n…",
    "link": "https://www.voanews.com/a/us-officials-investigate-brothers-charged-with-human-trafficking/7998201.html",
    "timestamp": "2025-03-05T02:13:29Z"
  },
  {
    "title": "Ivanka Trump Wears 3D Floral Oscar de la Renta Suit for President Donald Trump’s Address to Congress",
    "description": "Ivanka Trump wore a floral Oscar de la Renta suit on March 4 aligning with the American Dream theme of Donald Trump's 2025 speech to address Congress.",
    "link": "http://wwd.com/pop-culture/celebrity-news/ivanka-trump-floral-suit-congress-address-1237021817/",
    "timestamp": "2025-03-05T02:13:28Z"
  },
  {
    "title": "Oil falls as OPEC+ plans to raise output, U.S. tariffs hammer sentiment",
    "description": "Oil prices dropped for a third consecutive session as major producers plan to raise output in April, amidst concerns that U.S. tariffs on Canada, Mexico, and China will hamper economic growth and fuel demand. Brent futures fell to $70.89 a barrel and U.S. Wes…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-as-opec-plans-to-raise-output-u-s-tariffs-hammer-sentiment/articleshow/118721549.cms",
    "timestamp": "2025-03-05T02:11:33Z"
  },
  {
    "title": "Trump’s tariffs unleash ‘existential fight’ for Canada",
    "description": "Even if blanket tariffs are revoked, more tailored levies are likely to persist, stoking inflation, analysts say.",
    "link": "https://www.aljazeera.com/economy/2025/3/5/trumps-tariffs-unleash-existential-fight-for-canada",
    "timestamp": "2025-03-05T02:09:53Z"
  },
  {
    "title": "Trump cuts to NOAA already felt in San Diego",
    "description": "Cuts to the National Oceanic and Atmospheric Administration affect research and sea monitoring partnerships between NOAA and Scripps Institution of Oceanography.",
    "link": "https://www.kpbs.org/news/science-technology/2025/03/04/trump-cuts-to-noaa-already-felt-in-san-diego",
    "timestamp": "2025-03-05T02:07:38Z"
  },
  {
    "title": "US, Canadian officials in talks to possibly roll back Trump's tariffs, WSJ reports",
    "description": "The United States and Canadian officials are in talks about reducing or lifting tariffs that President Donald",
    "link": "https://www.jpost.com/breaking-news/article-844750",
    "timestamp": "2025-03-05T02:06:54Z"
  },
  {
    "title": "'America is back' Trump declares in first address",
    "description": "Trump touted his barrage of executive orders and actions as a massive success for America, second only to George Washington.",
    "link": "https://www.jpost.com/breaking-news/article-844748",
    "timestamp": "2025-03-05T02:05:16Z"
  },
  {
    "title": "‘Daredevil: Born Again’ TV Review: Disney+’s Long Awaited Man Without Fear Series Is Fearless & Trump 2.0 Timely",
    "description": "After several years of teasing cameos, Marvel’s the Man without Fear is finally back in Daredevil: Born Again and the Disney+ show’s timing is fearlessly fantastic. As Donald Trump prepares to address Congress tonight amidst tariffs, stock market slump and da…",
    "link": "http://deadline.com/2025/03/daredevil-born-again-review-1236309328/",
    "timestamp": "2025-03-05T02:01:00Z"
  },
  {
    "title": "Solana (SOL) Crashes 15% After Massive Profit-Taking Spike",
    "description": "On-chain data shows that investors on the Solana network participated in significant profit-taking ahead of the asset’s latest retrace. Solana Realized Profit Registered A Sharp Spike Yesterday According to data from the on-chain analytics firm Glassnode, the…",
    "link": "http://www.newsbtc.com/news/solana/solana-sol-crashes-15-massive-profit-taking-spike/",
    "timestamp": "2025-03-05T02:00:26Z"
  },
  {
    "title": "'She’s big doggin’ it': MAGA congressman takes a shot at Pam Bondi after 'stupid move'",
    "description": "Rep. Tim Burchett (R-TN) didn’t hide his views of Attorney General Pam Bondi, who he blasted on a right-wing podcast over her bombshell announcement that “blew up in her face\" last week when Bondi promised to release new Jeffrey Epstein files that never came.…",
    "link": "https://www.rawstory.com/pam-bondi-2671266530/",
    "timestamp": "2025-03-05T02:00:19Z"
  },
  {
    "title": "California’s Newsom Finally Bows to Trump’s Forest Wisdom – And It’s About Time!",
    "description": "The irony is thicker than the smoke over LA. For years, Newsom and his crew insisted they’d “surged” brush-clearing efforts since he took office in 2019. Yet here we are, with the governor admitting it’s not enough—implicitly conceding that Trump’s critique h…",
    "link": "https://wattsupwiththat.com/2025/03/04/californias-newsom-finally-bows-to-trumps-forest-wisdom-and-its-about-time/",
    "timestamp": "2025-03-05T02:00:00Z"
  },
  {
    "title": "‘Daredevil: Born Again’ Review: Disney+ Sequel Series Is Slightly Less Dark but Keeps the Crushing Violence",
    "description": "Showrunner Dario Scardapane keeps Charlie Cox and Vincent D’Onofrio at the center of a disturbingly topical political thriller\nThe post ‘Daredevil: Born Again’ Review: Disney+ Sequel Series Is Slightly Less Dark but Keeps the Crushing Violence appeared first …",
    "link": "https://www.thewrap.com/daredevil-born-again-review-disney-plus/",
    "timestamp": "2025-03-05T02:00:00Z"
  },
  {
    "title": "BlackRock to Buy Chinese Ports on Panama Canal",
    "description": "State of the Union: Trump has argued that Chinese influence in Panama endangers US interests.\nThe post BlackRock to Buy Chinese Ports on Panama Canal appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/blackrock-to-buy-chinese-ports-on-panama-canal/",
    "timestamp": "2025-03-05T01:58:14Z"
  },
  {
    "title": "Euro gets lift from German debt brake reform as currencies mired in trade war fallout",
    "description": "The euro surged to a nearly four-month high as Germany's political parties agreed on a significant debt overhaul to revive the economy. Amid volatile global currency trading due to new U.S. tariffs, the euro benefited from increased defense spending optimism …",
    "link": "https://economictimes.indiatimes.com/markets/forex/euro-gets-lift-from-german-debt-brake-reform-as-currencies-mired-in-trade-war-fallout/articleshow/118721425.cms",
    "timestamp": "2025-03-05T01:57:32Z"
  },
  {
    "title": "Trump tariff uncertainty overshadows growth promises: analysts",
    "description": "President Donald Trump’s tariffs and the retaliation they attracted will likely weigh on US growth and boost inflation, according to analysts, but, beyond that, uncertainty surrounding the levies threatens to overshadow optimism about his future policies. Tru…",
    "link": "https://www.digitaljournal.com/world/trump-tariff-uncertainty-overshadows-growth-promises-analysts/article",
    "timestamp": "2025-03-05T01:57:20Z"
  },
  {
    "title": "Guests of first couple rally around Trump's policies ahead of address to Congress: 'Incredible stories'",
    "description": "First lady Melania Trump invited 15 guests to President Donald Trump's first address to a joint Congress since his return to the Oval Office in January.",
    "link": "https://www.foxnews.com/politics/guests-first-couple-rally-around-trumps-policies-ahead-address-congress",
    "timestamp": "2025-03-05T01:56:10Z"
  },
  {
    "title": "The Daily Show Dedicates Trump Speech Drinking Game to Pete Hegseth",
    "description": "When they're not busy calling out Elon Musk to step up for the unedited interview he claims he wanted (more on that below), Comedy Central's The Daily Show is doing its part to make getting through POTUS Donald Trump's rant to Congress tonight a little easier…",
    "link": "https://bleedingcool.com/tv/the-daily-show-dedicates-trump-speech-drinking-game-to-pete-hegseth/",
    "timestamp": "2025-03-05T01:56:08Z"
  },
  {
    "title": "Gold slips as Treasury yields climb; Trump tariff moves on radar",
    "description": "Gold prices fell slightly on Wednesday, influenced by rising U.S. Treasury yields and concerns over the impact of President Trump's tariffs on inflation and global trade. The tariffs have led to trade tensions with China and Canada, prompting retaliatory meas…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-slips-as-treasury-yields-climb-trump-tariff-moves-on-radar/articleshow/118721406.cms",
    "timestamp": "2025-03-05T01:55:23Z"
  },
  {
    "title": "Day one of Trump’s trade war delivers wild ride for Wall Street",
    "description": "The S&P 500 index tumbled 2% shortly after the open Tuesday, wiping out its $3.4 trillion advance since Election Day on Nov. 5.",
    "link": "https://www.japantimes.co.jp/business/2025/03/05/markets/day-one-trump-trade-wall-street/",
    "timestamp": "2025-03-05T01:55:00Z"
  },
  {
    "title": "Japan and South Korea in the age of ‘America first’",
    "description": "Japan and South Korea are at their most fragile political states in decades just as their ally, the United States, has begun the second administration of Donald Trump.",
    "link": "https://www.japantimes.co.jp/commentary/2025/03/05/japan/japan-south-korea-age-of-america-first/",
    "timestamp": "2025-03-05T01:53:00Z"
  },
  {
    "title": "From Cabinet secretary to doomsday president: What being a designated survivor is like",
    "description": "For Trump's address, Doug Collins was chosen as designated survivor.",
    "link": "https://www.bostonherald.com/2025/03/04/trump-speech-designated-survivor/",
    "timestamp": "2025-03-05T01:52:35Z"
  },
  {
    "title": "FBI and Red Cross headquarters are among more than 440 federal buildings listed for potential sale by Trump Administration",
    "description": "The list includes the J. Edgar Hoover Building, which serves as FBI headquarters, the Robert F. Kennedy Department of Justice Building, the Old Post Office building, where President Donald Trump once ran a hotel, and the American Red Cross headquarters in Was…",
    "link": "https://biztoc.com/x/a53f6484952bd9b3",
    "timestamp": "2025-03-05T01:51:57Z"
  },
  {
    "title": "Walz: 'Our Policies Are Popular' But It 'Didn't Resonate'",
    "description": "During an interview on MSNBC on Tuesday, Minnesota Gov. Tim Walz (D) declared that the problem in 2024 was “not enough Americans believed that, we, as Democrats or Vice President Harris and myself, were on their side, and we are.\nThe post Walz: ‘Our Policies …",
    "link": "https://www.breitbart.com/clips/2025/03/04/walz-our-policies-are-popular-but-it-didnt-resonate/",
    "timestamp": "2025-03-05T01:51:34Z"
  },
  {
    "title": "Europe is running out of hope Trump is still open to persuasion over Ukraine",
    "description": "In the Four Quartets TS Eliot wrote “humankind cannot bear very much reality”. At moments in history like these, when there is simply too much head-spinning change and too many postwar assumptions being ripped from their moorings, it sometimes appears too muc…",
    "link": "https://freerepublic.com/focus/f-chat/4302135/posts",
    "timestamp": "2025-03-05T01:51:33Z"
  },
  {
    "title": "L.A. City Council Backs Karen Bass, Upholds Fire Chief's Dismissal",
    "description": "The Los Angeles City Council backed Mayor Karen Bass's decision to fire L.A. Fire Department Chief Kristin Crowley, voting 13-2 to affirm the firing. Crowley would have needed ten votes to be reinstated.\nThe post L.A. City Council Backs Karen Bass, Upholds Fi…",
    "link": "https://www.breitbart.com/politics/2025/03/04/l-a-city-council-backs-karen-bass-upholds-fire-chiefs-dismissal/",
    "timestamp": "2025-03-05T01:50:52Z"
  },
  {
    "title": "The Florida attorney general's office is investigating Andrew and Tristan Tate",
    "description": "Florida’s attorney general says his office has opened a criminal investigation into Andrew and Tristan Tate, who are charged with human trafficking in Romania",
    "link": "https://abcnews.go.com/Politics/wireStory/florida-attorney-generals-office-investigating-andrew-tristan-tate-119450112",
    "timestamp": "2025-03-05T01:50:09Z"
  },
  {
    "title": "Demonstrators across 50 states look to unify opposition to Trump and his agenda",
    "description": "The rallies and marches were set in motion by the fledgling 50501 Movement, a volunteer-driven group organized after Trump's inauguration.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_8509ccff-aa37-5e83-8deb-37d9bf68a36f.html",
    "timestamp": "2025-03-05T01:45:00Z"
  },
  {
    "title": "Demonstrators across 50 states look to unify opposition to Trump and his agenda",
    "description": "The rallies and marches were set in motion by the fledgling 50501 Movement, a volunteer-driven group organized after Trump's inauguration.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_65bfedeb-445b-581f-a411-fe2c4afe8a10.html",
    "timestamp": "2025-03-05T01:45:00Z"
  },
  {
    "title": "Days After White House Clash, Zelensky's \"Strong Leader\" Praise For Trump",
    "description": "A day after the United States suspended supplies of military aid to Kyiv, Ukrainian President Volodymyr Zelensky on Tuesday proposed a possible peace plan to end the war with Russia, saying he was willing to work &quot;constructively&quot; under Donald Trump.",
    "link": "https://www.ndtv.com/world-news/will-work-under-donald-trumps-strong-leadership-volodymyr-zelensky-proposes-ukraine-peace-plan-7850439",
    "timestamp": "2025-03-05T01:44:13Z"
  },
  {
    "title": "DOGE Stimulus Check Requirements: Who Qualifies for Potential Payment?",
    "description": "The \"DOGE Dividend\" proposal aims to return government savings to taxpayers. But who is eligible for the stimulus check?",
    "link": "https://www.newsweek.com/doge-stimulus-check-requirements-dividend-payment-donald-trump-2039631",
    "timestamp": "2025-03-05T01:43:38Z"
  },
  {
    "title": "'Very dumb': Justin Trudeau slams Trump for starting a trade war with Canada while appeasing Putin",
    "description": "Canadian Prime Minister Justin Trudeau criticized U.S. President Trump for imposing tariffs on Canadian imports while reducing tensions with Russia. Trudeau declared retaliation with over $100 billion in tariffs on American goods. Ontario Premier Doug Ford to…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/justin-trudeau-slams-trump-for-starting-a-trade-war-with-canada-while-appeasing-putin/articleshow/118721328.cms",
    "timestamp": "2025-03-05T01:43:24Z"
  },
  {
    "title": "Trump responds to Zelenskyy pledge in marathon Congress speech",
    "description": "Donald Trump has said he \"appreciates\" President Zelenskyy's renewed pledge to work with him on a peace deal - and that Russia has sent \"strong signals\" it's also ready for a truce.",
    "link": "https://news.sky.com/story/trump-responds-to-zelenskyy-letter-in-marathon-congress-speech-13321716",
    "timestamp": "2025-03-05T01:43:00Z"
  },
  {
    "title": "Live Updates: Donald Trump To Address Joint Session Of Congress",
    "description": "President Donald Trump&#039;s address to Congress focuses on &quot;the renewal of the American dream&quot;.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-congress-address-live-updates-tariffs-us-ukraine-ties-in-focus-7850437",
    "timestamp": "2025-03-05T01:42:38Z"
  },
  {
    "title": "Trump's first Congress speech descends into chaos as heckling Democrat Al Green KICKED OUT and Don blasts Biden's legacy",
    "description": "PRESIDENT Donald Trump has revealed Ukrainian leader Volodymyr Zelensky sent him a letter in a speech days after their historic spat. The commander-in-chief, 78, revealed a potential truce between …",
    "link": "https://www.the-sun.com/news/13691692/donald-trump-speech-congress-joint-address-time/",
    "timestamp": "2025-03-05T01:42:10Z"
  },
  {
    "title": "Florida governor spotlights timely golf outing he and Casey DeSantis had with President Trump",
    "description": "As the 2026 race to succeed Ron DeSantis as Florida governor heats up, with Byron Donalds announced and Casey DeSantis mulling a bid, President Trump plays golf with the Sunshine State's first couple",
    "link": "https://www.foxnews.com/politics/florida-governor-spotlights-timely-golf-outing-he-casey-desantis-president-trump",
    "timestamp": "2025-03-05T01:42:08Z"
  },
  {
    "title": "China aims for ambitious ‘around 5%’ growth despite Trump’s escalating trade war | CNN Business",
    "description": "China has set an ambitious target of “around 5%” growth for 2025, in a defiant show of confidence as it braces for the fallout from escalating American tariffs on its export-driven economy.",
    "link": "https://www.cnn.com/2025/03/04/business/china-npc-economy-growth-trade-hnk-intl/index.html",
    "timestamp": "2025-03-05T01:41:46Z"
  },
  {
    "title": "FBI and Red Cross headquarters are among more than 440 federal buildings listed for potential sale by Trump Administration",
    "description": "The list includes the J. Edgar Hoover Building, which serves as FBI headquarters, the Robert F. Kennedy Department of Justice Building, the Old Post Office building, where President Donald Trump once ran a hotel, and the American Red Cross headquarters in Was…",
    "link": "https://www.pbs.org/newshour/politics/fbi-and-red-cross-headquarters-are-among-more-than-440-federal-buildings-listed-for-potential-sale-by-trump-administration",
    "timestamp": "2025-03-05T01:41:41Z"
  },
  {
    "title": "Foxconn mega-AI plant ready in a year despite Trump tariffs",
    "description": "Foxconn's planned mega-AI server plant near Guadalajara, Mexico, will complete construction in a year despite the threat of new tariffs from President Donald Trump, according to Jalisco Governor Pablo Lemus Navarro.",
    "link": "https://www.digitimes.com/news/a20250305VL201/foxconn-plant-mexico-business-semiconductor-industry.html",
    "timestamp": "2025-03-05T01:41:18Z"
  },
  {
    "title": "Sen. Warren's warning on Trump agenda: 'Billionaires win, families lose' (MSNBC special coverage)",
    "description": "Senator Elizabeth Warren joins MSNBC’s Ari Melber and MSNBC’s Jen Psaki ahead of President Donald Trump’s first major joint address to Congress.",
    "link": "https://biztoc.com/x/5baab70dabe84f2c",
    "timestamp": "2025-03-05T01:41:08Z"
  },
  {
    "title": "Tim Walz dismisses Trump: ‘Tonight will be nothing but reality TV’",
    "description": "Minnesota Governor Tim Walz joins MSNBC’s Ari Melber and MSNBC’s Jen Paski ahead of President Donald Trump’s first major joint address to Congress. Walz reflects on the 2024 election and discusses the first weeks of the Trump administration.",
    "link": "https://biztoc.com/x/e6a7d48a2da61251",
    "timestamp": "2025-03-05T01:40:55Z"
  },
  {
    "title": "‘Are you better off now?’ Ari Melber & Jen Psaki ahead of Trump’s Congress speech",
    "description": "President Donald Trump is set to deliver his first major joint address to Congress, outlining his vision and goals for the future. MSNBC’s Ari Melber and Jen Psaki break down what to expect ahead of the speech. Ken Martin, Chair of the Democratic National Com…",
    "link": "https://biztoc.com/x/4b1a7a1d2ff3a346",
    "timestamp": "2025-03-05T01:40:54Z"
  },
  {
    "title": "What's an Illegal Protest? Trump Threatens Funding Cuts for Colleges",
    "description": "Donald Trump has threatened to cut federal funding for colleges that allow \"illegal\" protests, sparking debates on free speech and institutional policies.",
    "link": "https://biztoc.com/x/8d57f9b37ec59efa",
    "timestamp": "2025-03-05T01:40:47Z"
  },
  {
    "title": "Tate brothers hit with US criminal investigation days after landing in Florida",
    "description": "Self-described misogynist influencer Andrew Tate and his brother have denied raping and human trafficking allegations in Romania, saying they were \"largely misunderstood\".",
    "link": "https://www.abc.net.au/news/2025-03-05/criminal-investigation-against-andrew-tate-launched/105012088",
    "timestamp": "2025-03-05T01:38:43Z"
  },
  {
    "title": "Donald Trump’s Showtime: POTUS To Deliver Speech To Congress Amid Tariff Turmoil And Doubts About Ukraine",
    "description": "Donald Trump’s first speech to a joint session of Congress will focus on the theme of the Renewal of The American Dream, a chance for him to assure the American public after a chaotic first six weeks in office. Trump likely will present his speech as a kind o…",
    "link": "http://deadline.com/2025/03/trump-speech-congress-1236311018/",
    "timestamp": "2025-03-05T01:37:07Z"
  },
  {
    "title": "Trudeau slams Trump for starting ‘very dumb’ trade war with Canada while appeasing Russia’s Putin",
    "description": "Trudeau also called out Trump for appeasing Russian President Vladimir Putin while launching a trade war against Canada.",
    "link": "https://www.pbs.org/newshour/world/trudeau-slams-trump-for-starting-very-dumb-trade-war-with-canada-while-appeasing-russias-putin",
    "timestamp": "2025-03-05T01:34:56Z"
  },
  {
    "title": "폭주하는 트럼프의 미국 이유는?",
    "description": "ICYMI: Trump’s promises to “fix” America earned him a spot in the White House. But can he actually deliver on them?Our columnists looked at the  data  to decide. Take a look at the 12 key metrics to follow: https://t.co/bO6Fmzunj7— Bloomberg Opinion (@opi…",
    "link": "https://ryueyes11.tistory.com/511515",
    "timestamp": "2025-03-05T01:33:36Z"
  },
  {
    "title": "Trudeau gets smiles with stern speech to President 'Donald'",
    "description": "Prime Minister Justin Trudeau struck an informal tone on Tuesday, addressing the U.S. president several times as just “Donald” in a speech that was broadcast on Canadian and American television networks.",
    "link": "https://www.cbc.ca/news/canada/justin-trudeau-speech-first-name-donald-1.7474705",
    "timestamp": "2025-03-05T01:31:21Z"
  },
  {
    "title": "What's an Illegal Protest? Trump Threatens Funding Cuts for Colleges",
    "description": "Donald Trump has threatened to cut federal funding for colleges that allow \"illegal\" protests, sparking debates on free speech and institutional policies.",
    "link": "https://www.newsweek.com/illegal-protest-donald-trump-federal-funding-colleges-columbia-2039535",
    "timestamp": "2025-03-05T01:30:45Z"
  },
  {
    "title": "Mint Quick Edit | Trump’s trade war has flared up",
    "description": "China and Canada have both struck back at America’s import tariffs, while Mexico plans retaliatory barriers too. Expect this theatre of trade hostility to expand and reverberate across the world.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-trade-war-canada-tariffs-mexico-tariffs-china-tariffs-retaliatory-tariffs-reciprocal-tariffs-imports-export-11741098275827.html",
    "timestamp": "2025-03-05T01:30:11Z"
  },
  {
    "title": "Judge blocks Trump order threatening funding for institutions that provide gender-affirming care for minors",
    "description": "A federal judge on Tuesday issued a preliminary injunction blocking enforcement of the Trump administration’s executive order threatening federal funding for institutions that provide gender-affirming care for anyone under 19.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/judge-blocks-trump-order-funding-institutions-gender-affirming-care-rcna194800",
    "timestamp": "2025-03-05T01:30:02Z"
  },
  {
    "title": "DOGE Gets a Foreign Ally",
    "description": "Hungary has found a receptive partner in its efforts to investigate USAID: the American government.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/hungary-joins-doge-effort/681923/",
    "timestamp": "2025-03-05T01:30:00Z"
  },
  {
    "title": "In America’s Motor City, Trump’s trade war is met not with a battle cry but a shrug",
    "description": "If Motor City is having second thoughts about electing President Donald Trump last November, it hides its regret well.\nIn a parking lot near the Stellantis assembly plant in Sterling Heights, Mich., a suburb of Detroit, a man in a red pick-up truck festooned …",
    "link": "https://biztoc.com/x/50cc66738fd0d2d6",
    "timestamp": "2025-03-05T01:29:44Z"
  },
  {
    "title": "CNBC Daily Open: As tariffs come into force, stocks sell-off and prices might rise",
    "description": "Geopolitical trade and international relations may be fractured by U.S. tariffs, but it could be domestic consumers, the economy and markets that hurt the most.",
    "link": "https://www.cnbc.com/2025/03/05/cnbc-daily-open-tariffs-trigger-stock-sell-off-possible-price-hikes.html",
    "timestamp": "2025-03-05T01:29:21Z"
  },
  {
    "title": "‘Collage Of Idiocy’: Former Trump Campaign Co-Manager Rips Dems For Wasting Resources On Copy-Pasted Trump Rebuke",
    "description": "Chris Lacivita appeared on Fox News Tuesday to condemn the Democratic Party's repeated criticisms of Trump, labeling their strategy a \"collage of idiocy.\"",
    "link": "https://dailycaller.com/2025/03/04/chris-lacivita-dems-trump-rebuke/",
    "timestamp": "2025-03-05T01:29:05Z"
  },
  {
    "title": "WeChat Users React to Trump-Zelenskyy Oval Office Meeting: “Don’t You Have Any Respect for His Country or His People?”",
    "description": "The fallout from Friday’s heated Oval Office meeting between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy and today’s announcement that the U.S. would pause aid to Ukraine continues to reverberate around the world. In China, netizen…",
    "link": "https://chinadigitaltimes.net/2025/03/wechat-users-react-to-trump-zelenskyy-oval-office-meeting-dont-you-have-any-respect-for-his-country-or-his-people/",
    "timestamp": "2025-03-05T01:28:06Z"
  },
  {
    "title": "US embassies end pollution data popular in China and India",
    "description": "The United States on Tuesday ended pollution tracking by its embassies that had been a vital source of data especially in Beijing, as President Donald Trump slashes overseas and environmental spending. The State Department cited “budget constraints” as it sai…",
    "link": "https://www.digitaljournal.com/world/us-embassies-end-pollution-data-popular-in-china-and-india/article",
    "timestamp": "2025-03-05T01:27:20Z"
  },
  {
    "title": "‘Criminal investigation’ launched into Tate brothers: Florida attorney general",
    "description": "Florida’s attorney general said Tuesday that a criminal investigation has been opened into self-described misogynist influencer Andrew Tate and his brother, who flew to the southern US state last week from Romania, where they faced rape and human trafficking …",
    "link": "https://www.digitaljournal.com/world/criminal-investigation-launched-into-tate-brothers-florida-attorney-general/article",
    "timestamp": "2025-03-05T01:27:20Z"
  },
  {
    "title": "Trump is delivering a joint address to Congress tonight. Here's what to know about the president's speech.",
    "description": "Trump's speech is likely to cover tariffs, the economy, DOGE, and more. It's his first address to Congress in more than five years.",
    "link": "https://www.businessinsider.com/trump-speech-joint-address-congress-2025-3",
    "timestamp": "2025-03-05T01:27:05Z"
  },
  {
    "title": "Congressional delegation urges Trump administration to reinstate Maine Sea Grant funding amid concerns of retaliation",
    "description": "Maine's program is the only one of 34 nationwide that has lost its funding so far, and the move comes on the heels of the president's threat to cut Maine's federal funding over a disagreement about transgender athletes.",
    "link": "https://www.pressherald.com/2025/03/04/king-and-pingree-urge-trump-administration-to-reinstate-maine-sea-grant-funding/",
    "timestamp": "2025-03-05T01:26:33Z"
  },
  {
    "title": "Canada and China retaliate against U.S. tariffs, which Trudeau derides as 'Dumb'",
    "description": "President Trump’s tariffs on imports from Canada, Mexico, and China have ignited fears of a trade war, prompting retaliatory tariffs from affected countries. Canadian Prime Minister Trudeau criticized the tariffs, warning they would harm both economies. U.S. …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/canada-and-china-retaliate-against-u-s-tariffs-which-trudeau-derides-as-dumb/articleshow/118721221.cms",
    "timestamp": "2025-03-05T01:25:43Z"
  },
  {
    "title": "Lower vegetable, rice prices slow inflation to 2.1% in February 2025",
    "description": "The inflation rate for vegetables and tubers is at 7.1% in February from 21.1% in January, while for cereals and cereal products — including rice — the rate is at -3% from -1.1%",
    "link": "https://www.rappler.com/business/inflation-rate-philippines-february-2025/",
    "timestamp": "2025-03-05T01:25:08Z"
  }
]