[
  {
    "title": "Jury Finds Illegal Alien Guilty of Raping, Murdering Maryland Mother of 5",
    "description": "A Maryland jury has found an illegal alien guilty of murdering Rachel Morin, a mother of five.  Victor Martinez-Hernandez was charged with first-degree murder, first-degree... Read More\nThe post Jury Finds Illegal Alien Guilty of Raping, Murdering Maryland Mo…",
    "link": "https://www.dailysignal.com/2025/04/15/jury-finds-illegal-alien-guilty-of-raping-murdering-maryland-mother-of-5/",
    "timestamp": "2025-04-15T16:48:32Z"
  },
  {
    "title": "Harvard Tells Trump To Kick Rocks, X Salutes Its Stand",
    "description": "Harvard University has refused to comply with the demands of the Trump administration to end its diversity programs. The move was met with high praise on social media after it issued a statement.",
    "link": "https://hiphopwired.com/playlist/harvard-tells-trump-to-kick-rocks-x-salutes-its-stand/",
    "timestamp": "2025-04-15T16:48:06Z"
  },
  {
    "title": "Mark Zuckerberg Pushes Trump To 'Respond Aggressively' As EU Threatens Meta's Ad Revenue – A Big Tech Showdown?",
    "description": "Meta Platforms Inc. (NASDAQ:META) is back in the global spotlight, not over virtual reality or Threads—but its battle with European regulators. And now, Meta CEO Mark Zuckerberg reportedly wants help from President Donald Trump to calm the storm overseas.\nMet…",
    "link": "https://biztoc.com/x/1345693c32f01031",
    "timestamp": "2025-04-15T16:47:29Z"
  },
  {
    "title": "Bank of Canada should and will cut interest rates: CIBC's Benjamin Tal",
    "description": "Benjamin Tal, Deputy Chief Economist CIBC Capital Markets, talks with Financial Post’s Larysa Harapyn about the impact of uncertainty under \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n on \n \n \n \n \n \n Canada’s economy\n \n \n \n \n \n , which may already be in \n \n \n \n \n \n re…",
    "link": "https://biztoc.com/x/826ced6c501fd502",
    "timestamp": "2025-04-15T16:47:10Z"
  },
  {
    "title": "Delta Air Lines CEO shares unexpected plan to address Trump’s tariffs",
    "description": "President Donald Trump’s tariff roller coaster has caused some market instability over the past few months. After delaying most of them, U.S. stocks are recovering, likely due to Trump’s decision on exemptions for certain high-tech products.\nOn April 13, Trum…",
    "link": "https://biztoc.com/x/8ede9ecfe011cecd",
    "timestamp": "2025-04-15T16:47:00Z"
  },
  {
    "title": "Chile, Canada and Peru push back against Trump’s copper tariff probe",
    "description": "Three top copper suppliers to the United States told President Donald Trump’s administration that imports of the metal do not threaten U.S. security interests, as Chile, Canada and Peru aim to fend off potential tariffs on the metal needed for electric vehicl…",
    "link": "https://biztoc.com/x/7c6bb30780d44ff4",
    "timestamp": "2025-04-15T16:46:54Z"
  },
  {
    "title": "S&P 500 Rises as Traders Parse Earnings and Tariff Developments",
    "description": "US equities eked out modest gains as investors weighed the ongoing global trade war against a slew of positive earnings reports from Wall Street banks.",
    "link": "https://financialpost.com/pmn/business-pmn/sp-500-rises-as-traders-parse-earnings-and-tariff-developments",
    "timestamp": "2025-04-15T16:46:49Z"
  },
  {
    "title": "Nissan to cut Japanese production of top-selling US model due to tariffs, source says",
    "description": "TOKYO (Reuters) - Nissan (7201.T) will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new U.S. impor…",
    "link": "https://freerepublic.com/focus/f-news/4311164/posts",
    "timestamp": "2025-04-15T16:45:54Z"
  },
  {
    "title": "'Error from hell' that led to mistaken deportation could come for Americans next: opinion",
    "description": "An opinion piece in The Washington Post written by columnist Monica Hesse warned that the \"administrative error from hell\" that doomed Kilmar Abrego García to a notorious Salvadoran prison could easily condemn American citizens next.Garcia, originally from El…",
    "link": "https://www.rawstory.com/kilmar-garcia-deportation/",
    "timestamp": "2025-04-15T16:45:13Z"
  },
  {
    "title": "NATO chief reaffirms support for Ukraine during visit to Odesa",
    "description": "NATO’s support for Ukraine remains “unwavering,” the alliance’s secretary-general says",
    "link": "https://abcnews.go.com/International/wireStory/nato-chief-reaffirms-support-ukraine-visit-odesa-120829584",
    "timestamp": "2025-04-15T16:45:12Z"
  },
  {
    "title": "Trump showdown with courts in spotlight at migrant hearing",
    "description": "<p>WASHINGTON - US President Donald Trump's showdown with the judicial system will be in the spotlight Tuesday at a hearing on the fate of a migrant who was wrongly deported to El Salvador.</p>",
    "link": "https://www.bangkokpost.com/world/3003776/trump-showdown-with-courts-in-spotlight-at-migrant-hearing",
    "timestamp": "2025-04-15T16:45:00Z"
  },
  {
    "title": "CNN’s Paula Reid Laughs Out Loud At Trump Adviser Stephen Miller’s Oval Office Rant About ‘Kidnapping’",
    "description": "Paula Reid laughed out loud at Trump Deputy Chief of Staff Stephen Miller over his rant about \"kidnapping\" during President Donald Trump's photo op.\nThe post CNN’s Paula Reid Laughs Out Loud At Trump Adviser Stephen Miller’s Oval Office Rant About ‘Kidnapping…",
    "link": "https://www.mediaite.com/news/cnns-paula-reid-laughs-out-loud-at-trump-adviser-stephen-millers-oval-office-rant-about-kidnapping/",
    "timestamp": "2025-04-15T16:44:17Z"
  },
  {
    "title": "Nintendo Switch 2 Leak Suggests Preorders Resuming Soon",
    "description": "Preorders for Nintendo Switch 2 were supposed to launch on April 9th, but were postponed in the United States and Canada as a direct result of the current tariffs implemented by U.S. President Donald Trump. Things seem to have cooled down a bit since then, wi…",
    "link": "http://comicbook.com/gaming/news/nintendo-switch-2-leak-preorders-resuming-soon-canada-united-states/",
    "timestamp": "2025-04-15T16:42:28Z"
  },
  {
    "title": "As AOC and Sanders Draw Crowds, 72% of Democrats Want Party to Abandon Centrist Approach to Trump",
    "description": "Anyone observing the nationwide Fighting Oligarchy Tour led by Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez has taken notice of the massive crowds that the lawmakers have drawn in a wide variety of cities—including in deep-red states like Utah and Id…",
    "link": "https://www.commondreams.org/news/aoc-democrats",
    "timestamp": "2025-04-15T16:42:19Z"
  },
  {
    "title": "Dem Rep. Torres: 'Any American' Could Be Abducted, Deported, Tortured Under Trump",
    "description": "Representative Ritchie Torres (D-NY) claimed Tuesday on CNN's \"The Situation Room\" that \"any American\" could be abducted, deported and tortured under President Donald Trump's administration.\nThe post Dem Rep. Torres: ‘Any American’ Could Be Abducted, Deported…",
    "link": "https://www.breitbart.com/clips/2025/04/15/dem-rep-torres-any-american-could-be-abducted-deported-tortured-under-trump/",
    "timestamp": "2025-04-15T16:42:16Z"
  },
  {
    "title": "‘Common Sense Matters’: Orbán’s Hungary Passes Constitutional Amendment Banning Public LGBT Events",
    "description": "Hungary's recent constitutional amendment, spearheaded by Viktor Orbán, significantly restricts public LGBT events, raising critical questions about civil rights and the nation's political direction.\nThe post ‘Common Sense Matters’: Orbán’s Hungary Passes Con…",
    "link": "https://www.thegatewaypundit.com/2025/04/common-sense-matters-orbans-hungary-passes-constitutional-amendment/",
    "timestamp": "2025-04-15T16:40:34Z"
  },
  {
    "title": "Home Alone 2 Director Wants Trump Cameo Removed: “It’s Become This Curse”",
    "description": "Chris Columbus sarcastically added that doing so could get him \"sent out of the country.\"\nHome Alone 2 Director Wants Trump Cameo Removed: “It’s Become This Curse”\nEddie Fu",
    "link": "https://consequence.net/2025/04/home-alone-2-director-trump-cameo/",
    "timestamp": "2025-04-15T16:40:12Z"
  },
  {
    "title": "Trump says there's a 'real chance' tariffs could replace income tax",
    "description": "President Donald Trump told Fox Noticias on Tuesday that tariffs could replace the income tax during a conversation with Fox News host Rachel Campos-Duffy.",
    "link": "https://www.foxnews.com/media/trump-says-theres-real-chance-tariffs-could-replace-income-tax",
    "timestamp": "2025-04-15T16:39:36Z"
  },
  {
    "title": "Mark Zuckerberg back in US court amid push to break up Meta",
    "description": "The last time the US Federal Trade Commission broke up a major corporation was AT&T, more than four decades ago.",
    "link": "https://www.aljazeera.com/economy/2025/4/15/mark-zuckerberg-back-in-us-court-amid-push-to-break-up-meta",
    "timestamp": "2025-04-15T16:39:28Z"
  },
  {
    "title": "'The beginning of American state terror' is here: historian",
    "description": "A historian who has extensively studied the rise of fascism warned that president Donald Trump had crossed a dangerous line.The president met Monday in the Oval Office with El Salvador president Niyab Bukele, and both leaders claimed to be powerless to bring …",
    "link": "https://www.rawstory.com/donald-trump-state-terror/",
    "timestamp": "2025-04-15T16:39:24Z"
  },
  {
    "title": "Vivek Ramaswamy's Lead in Ohio Governor's Race Expands After Trump Endorsement",
    "description": "Vivek Ramaswamy's lead in the race for governor in Ohio jumped significantly after President Donald Trump offered his endorsement, internal polling by Trump pollster Tony Fabrizio reveals.\nThe post Vivek Ramaswamy’s Lead in Ohio Governor’s Race Expands After …",
    "link": "https://www.breitbart.com/politics/2025/04/15/vivek-ramaswamys-lead-in-ohio-governors-race-expands-after-trump-endorsement/",
    "timestamp": "2025-04-15T16:36:35Z"
  },
  {
    "title": "Tariff relief hopes boost recovery in global stocks",
    "description": "Iseq index up 2.3% as banks move higher, fuelled by positive updates from a trio of US lenders",
    "link": "https://www.irishtimes.com/business/2025/04/15/tariff-relief-hopes-boost-recovery-in-global-stocks/",
    "timestamp": "2025-04-15T16:36:29Z"
  },
  {
    "title": "Donald Trump Hit with New Demand Amid Deported Maryland Dad's Legal Fight",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKilmar Abrego Garcia's lawyers said Monday the Trump administration has to at least request the deported Maryland father's return from El Salvador in order to comply with court orders.\nTrump White House offici…",
    "link": "https://biztoc.com/x/a96f4e3cc4d9be54",
    "timestamp": "2025-04-15T16:36:26Z"
  },
  {
    "title": "Tariffs And Other Chaos: Business Decisions With Economic Uncertainty",
    "description": "Economic uncertainty makes decisions difficult, but a business leader must pay attention to the risks and opportunities that will arise. Real people depend on the it.",
    "link": "https://www.forbes.com/sites/billconerly/2025/04/15/tariffs-and-other-chaos-business-decisions-with-economic-uncertainty/",
    "timestamp": "2025-04-15T16:36:12Z"
  },
  {
    "title": "Trump’s Court-Defying Crusade Against The Associated Press Is a Page Out of the Authoritarian Playbook",
    "description": "It begins with lies and ends with eliminating the truth-tellers. Authoritarians thrive not by persuading a majority, but by confusing it. By overwhelming the public with contradictions, distortions, and doubt, would-be strongmen don’t need to win the argument…",
    "link": "https://www.mediaite.com/opinion/trumps-court-defying-crusade-against-the-associated-press-is-a-page-out-of-the-authoritarian-playbook/",
    "timestamp": "2025-04-15T16:35:54Z"
  },
  {
    "title": "'Home Alone 2' director says Donald Trump cameo has 'become this curse' (G. Allen Johnson/San Francisco Chronicle)",
    "description": "G. Allen Johnson / San Francisco Chronicle:\n‘Home Alone 2’ director says Donald Trump cameo has ‘become this curse’  —  San Francisco filmmaker Chris Columbus said Donald Trump's cameo in “Home Alone 2: Lost in New York” more than 30 years ago has been “an al…",
    "link": "https://www.memeorandum.com/250415/p59",
    "timestamp": "2025-04-15T16:35:01Z"
  },
  {
    "title": "Wrongly Deported Maryland Man Compared to Osama Bin Laden by Trump Official: 'Osama Bin Laden Was Also a Father'",
    "description": "A Trump official recently compared a wrongfully deported father from Maryland to deceased militant Osama bin Laden on account of both men being fathers.",
    "link": "https://www.ibtimes.com/wrongly-deported-maryland-man-compared-osama-bin-laden-trump-official-osama-bin-laden-was-also-3770166",
    "timestamp": "2025-04-15T16:33:10Z"
  },
  {
    "title": "'Home Alone 2' Director Speaks Out Against Donald Trump's Appearance in the Film: 'I Just Wish it Was Gone'",
    "description": "Home Alone 2: Lost in New York director Chris Columbus says he regrets including now-president Donald Trump in the movie. In the 1992 sequel film, Trump made a brief cameo when Macaulay Culkin‘s character, Kevin McCallister, asked him for directions in the Pl…",
    "link": "https://www.justjared.com/2025/04/15/home-alone-2-director-speaks-out-against-donald-trumps-appearance-in-the-film-i-just-wish-it-was-gone/",
    "timestamp": "2025-04-15T16:33:06Z"
  },
  {
    "title": "Donald Trump Hit with New Demand Amid Deported Maryland Dad's Legal Fight",
    "description": "Trump officials say a Supreme Court order regarding the return of a man improperly deported to El Salvador has been satisfied.",
    "link": "https://www.newsweek.com/donald-trump-hit-new-demand-amid-deported-maryland-dads-legal-fight-2060105",
    "timestamp": "2025-04-15T16:32:28Z"
  },
  {
    "title": "Media Rush To Downplay Space Force Colonel Fired For ‘Undermining’ The White House’s Greenland Policy",
    "description": "Since Donald Trump’s return to office, legacy media have been quick to elevate the voices of disgruntled executive employees unhappy with the president’s efforts to deliver on the agenda the American people voted for in the 2024 election. So, it comes as no s…",
    "link": "https://thefederalist.com/2025/04/15/media-rush-to-downplay-space-force-colonel-fired-for-undermining-the-white-houses-greenland-policy/",
    "timestamp": "2025-04-15T16:31:42Z"
  },
  {
    "title": "China Wins As Trump Torches U.S. Treasuries In Real Time",
    "description": "Year after year, decade after decade, officials in Tokyo, Beijing, Seoul and beyond dutifully bought U.S. Treasury securities. That’s now changing.",
    "link": "https://www.forbes.com/sites/williampesek/2025/04/15/china-wins-as-trump-torches-us-treasuries-in-real-time/",
    "timestamp": "2025-04-15T16:30:44Z"
  },
  {
    "title": "To Get Deportee Back, the Supreme Court Must Make Trump Feel Pain | Opinion",
    "description": "Trump has made it appear that retrieving a man being held at his own personal request is so diplomatically complex that it would have stumped both Henry Kissinger and Bill Nye the Science Guy.",
    "link": "https://www.newsweek.com/get-deportee-back-supreme-court-must-make-trump-feel-pain-opinion-2060103",
    "timestamp": "2025-04-15T16:30:31Z"
  },
  {
    "title": "The 5 at 5: Tuesday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-15-04-25-6679076-Apr2025/",
    "timestamp": "2025-04-15T16:30:09Z"
  },
  {
    "title": "Indonesia to Offer to Buy $10 Billion of Additional U.S. Energy Goods",
    "description": "As Indonesia seeks to negotiate a reduction of a planned tariff of 32% on Indonesian goods sold in the United States, the government of Southeast Asia’s biggest economy will offer to buy an additional $10 billion worth of American oil and liquefied petroleum …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indonesia-to-Offer-to-Buy-10-Billion-of-Additional-US-Energy-Goods.html",
    "timestamp": "2025-04-15T16:30:00Z"
  },
  {
    "title": "Amid US Tariff War, China Convenes Rare Central Conference on Neighborhood Diplomacy",
    "description": "As the China-U.S. trade war escalates, Beijing is turning its focus to its immediate periphery to ensure both economic and national security.",
    "link": "https://thediplomat.com/2025/04/amid-us-tariff-war-china-convenes-rare-central-conference-on-neighborhood-diplomacy/",
    "timestamp": "2025-04-15T16:30:00Z"
  },
  {
    "title": "Californians Are Seriously Unenthused About A Hypothetical Kamala Harris Gubernatorial Bid, Poll Finds",
    "description": "Political insiders in California are largely unenthused about the prospect of former Vice President Kamala Harris launching a gubernatorial bid, per a new poll.",
    "link": "https://dailycaller.com/2025/04/15/californians-are-seriously-unenthused-about-a-hypothetical-kamala-harris-gubernatorial-bid-poll-finds/",
    "timestamp": "2025-04-15T16:29:45Z"
  },
  {
    "title": "Columbia will not surrender independence in face of federal demands, acting president says",
    "description": "\"We would reject any agreement that would require us to relinquish our independence and autonomy as an educational institution,\" acting president Claire Shipman said on Monday.",
    "link": "https://www.jpost.com/international/article-850216",
    "timestamp": "2025-04-15T16:29:25Z"
  },
  {
    "title": "Dylan Mulvaney says trans rights 'shouldn't be political' - ahead of ruling to define 'woman'",
    "description": "Social media influencer Dylan Mulvaney has told Sky News discussion about transgender rights should not be political.",
    "link": "https://news.sky.com/story/dylan-mulvaney-says-trans-rights-shouldnt-be-political-ahead-of-ruling-to-define-woman-13349540",
    "timestamp": "2025-04-15T16:29:00Z"
  },
  {
    "title": "Jeffries backs stock trading ban after Greene buys market dip",
    "description": "House Minority Leader Hakeem Jeffries (D-N.Y.) on Monday backed a stock trading ban for sitting members of Congress, after ripping Rep. Marjorie Taylor Greene (R-Ga.) for reportedly profiting off market fluctuations during President Trump’s tariff roller-coas…",
    "link": "https://freerepublic.com/focus/f-news/4311161/posts",
    "timestamp": "2025-04-15T16:28:22Z"
  },
  {
    "title": "Trump Admin’s New Defense For Accidentally Sending Abrego Garcia To Salvadoran Torture Camp: We Meant To Do That",
    "description": "The Trump administration has settled on a terrifying new legal theory: they can declare anyone a “terrorist,” ship them to an offshore torture camp without due process, and courts can do nothing about it because it’s “foreign affairs.” This isn’t speculation …",
    "link": "https://www.techdirt.com/2025/04/15/trump-admins-new-defense-for-accidentally-sending-abrego-garcia-to-salvadoran-torture-camp-we-meant-to-do-that/",
    "timestamp": "2025-04-15T16:27:26Z"
  },
  {
    "title": "Obama Judge Blocks Trump’s Move To End Biden-Era Parole Program For Half A Million Migrants",
    "description": "A federal judge appointed by the Obama administration blocked President Donald Trump’s effort to end a controversial parole program that allowed roughly half-a-million foreign nationals into the United States. U.S. District Judge Indira Talwani in Boston, Mas…",
    "link": "https://dailycaller.com/2025/04/15/obama-judge-blocks-trumps-chnv-order/",
    "timestamp": "2025-04-15T16:26:11Z"
  },
  {
    "title": "Video: Trump struggles to say 'Make America Great Again' in Spanish during Fox News interview",
    "description": "Fox News Host Rachel Campos-Duffy tried to teach US President Donald Trump how to say ‘Make America Great Again’ in Spanish. A video of the conversation has gone viral on social media with netizens heaping praises on Trump. Trump responded with \"América grand…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/video-trump-struggles-to-say-make-america-great-again-in-spanish-during-fox-news-interview/articleshow/120317656.cms",
    "timestamp": "2025-04-15T16:25:51Z"
  },
  {
    "title": "Ro Khanna Slams Elon Musk And Reveals 1 Odd Trend Of His: 'Like You Do With An Ex'",
    "description": "The congressman condemned Musk's Department of Government Efficiency on Monday for gutting essential services when he shared some private insight.",
    "link": "https://www.huffpost.com/entry/ro-khanna-slams-elon-musk-and-doge-cuts_n_67fe5019e4b0095bc4905c06",
    "timestamp": "2025-04-15T16:25:49Z"
  },
  {
    "title": "Trump Has His Next Target for the Chopping Block: Entire Embassies",
    "description": "Donald Trump’s administration is planning to shutter U.S. embassies around the world, continuing to dilute American soft power in its latest effort to shrink the federal workforce.\r\nA memorandum that was part of a broader budget for 2026 that is due to the Of…",
    "link": "https://newrepublic.com/post/194019/donald-trump-next-target-chopping-block-entire-embassies",
    "timestamp": "2025-04-15T16:25:31Z"
  },
  {
    "title": "As administration digs in, case of wrongly deported Maryland man returns to court",
    "description": "The judge who ordered the government to facilitate the return of a wrongly deported Maryland man from El Salvador will hear from DOJ attorneys at a hearing Tuesday.",
    "link": "https://abcnews.go.com/US/trump-administration-digs-case-wrongly-deported-maryland-man/story?id=120822855",
    "timestamp": "2025-04-15T16:25:22Z"
  },
  {
    "title": "Watch: Hagerty Consultant Stumped When Asked What Company Actually Does in Disasters",
    "description": "A representative of Hagerty Consulting was stumped last week when asked by leaders within the Pacific Palisades about what his company is actually doing to help the community recover from recent wildfires.\nThe post Watch: Hagerty Consultant Stumped When Asked…",
    "link": "https://www.breitbart.com/politics/2025/04/15/watch-hagerty-consultant-stumped-when-asked-what-company-actually-does-in-disasters/",
    "timestamp": "2025-04-15T16:25:16Z"
  },
  {
    "title": "Trump says China 'reneged' on Boeing deal as tensions flare",
    "description": "US President Donald Trump said Tuesday that China has gone back on a major Boeing deal, after a news report that Beijing ordered airlines not to take further deliveries of the US aviation giant's jets. Trump took aim at Beijing again on Tuesday, saying on Tru…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-says-china-reneged-on-boeing-deal-as-tensions-flare/articleshow/120317775.cms",
    "timestamp": "2025-04-15T16:25:16Z"
  },
  {
    "title": "Major Hedge Fund Bets Against Trump Media",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nHedge fund Qube Research & Technologies has disclosed a $105-million short position in President Donald Trump's company, Trump Media & Technology Group (TMTG), according to a filing.\nWhen an investor takes a s…",
    "link": "https://biztoc.com/x/a1ec1bf10d6c3209",
    "timestamp": "2025-04-15T16:25:13Z"
  },
  {
    "title": "Van Hollen: Trump Believes in First Amendment Rights for Himself But Nobody Else",
    "description": "Senator Chis Van Hollen (D-MD) claimed on Tuesday on CNN's \"News Central\" that President Donald Trump \"believes in First Amendment rights for himself, but apparently for nobody else.\"\nThe post Van Hollen: Trump Believes in First Amendment Rights for Himself B…",
    "link": "https://www.breitbart.com/clips/2025/04/15/van-hollen-trump-believes-in-first-amendment-rights-for-himself-but-nobody-else/",
    "timestamp": "2025-04-15T16:24:00Z"
  },
  {
    "title": "Can Trump’s Tariffs Be Undone In Court? First Lawsuit Targets ‘Liberation Day’ Orders As Conservative Lawyers Protest Policy",
    "description": "Trump may have gone too far in how he justified his sweeping tariffs, some legal experts allege.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/04/15/can-trumps-tariffs-be-undone-in-court-first-lawsuit-targets-liberation-day-orders-as-conservative-lawyers-protest-policy/",
    "timestamp": "2025-04-15T16:23:58Z"
  },
  {
    "title": "Marjorie Taylor Greene brings town hall to Harris-won Georgia county, shrugs off possible 'outbursts'",
    "description": "Rep. Marjorie Taylor Greene spoke with Fox News Digital ahead of her Tuesday evening town hall in Cobb County.",
    "link": "https://www.foxnews.com/politics/marjorie-taylor-greene-brings-town-hall-harris-won-georgia-county-shrugs-off-possible-outbursts",
    "timestamp": "2025-04-15T16:23:25Z"
  },
  {
    "title": "Jimmy Kimmel Says ‘Manufactured’ Liberal Outrage Over Comedians Is a Big Reason Trump Got Reelected",
    "description": "\"A lot of these people who are angry aren’t really angry,\" the late-night host says\nThe post Jimmy Kimmel Says ‘Manufactured’ Liberal Outrage Over Comedians Is a Big Reason Trump Got Reelected appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-liberals-attacking-comedians-helped-trump/",
    "timestamp": "2025-04-15T16:23:09Z"
  },
  {
    "title": "Trump’s China Ship Fees Set to Hit Global Shipping Giants",
    "description": "(Bloomberg) — Container ships, the workhorses of global trade transporting almost 90% of the world’s manufactured goods, have become a target in Donald Trump’s conflict with China — and none...",
    "link": "https://gcaptain.com/trumps-china-ship-fees-set-to-hit-global-shipping-giants/",
    "timestamp": "2025-04-15T16:22:56Z"
  },
  {
    "title": "Crypto’s new prince? Donald Trump’s 29-year-old whiz kid Bo Hines is shaking up policy and drawing billionaire backers with bold plans",
    "description": "Bo Hines, a former college football player, now shapes US crypto policy under President Trump. Trump aims for crypto-friendly rules, reversing Biden's approach. Hines is meeting with industry leaders like Ripple's Brad Garlinghouse. Dismissal of SEC lawsuits …",
    "link": "https://economictimes.indiatimes.com/news/international/us/cryptos-new-prince-donald-trumps-29-year-old-whiz-kid-bo-hines-is-shaking-up-policy-and-drawing-billionaire-backers-with-bold-plans/articleshow/120316431.cms",
    "timestamp": "2025-04-15T16:21:59Z"
  },
  {
    "title": "Major Hedge Fund Bets Against Trump Media",
    "description": "Qube Research & Technologies disclosed a $105-million short position in Trump Media & Technology Group on Monday.",
    "link": "https://www.newsweek.com/qube-research-trump-media-hedge-fund-2059864",
    "timestamp": "2025-04-15T16:21:51Z"
  },
  {
    "title": "Texas Grandmother Detained by ICE After Car Bursts Into Flames",
    "description": "The Houston PD said that the woman was detained after an officer ran her ID and a system revealed an active ICE warrant.",
    "link": "https://www.newsweek.com/texas-grandmother-detained-ice-car-flames-2059965",
    "timestamp": "2025-04-15T16:21:39Z"
  },
  {
    "title": "DOGE Cuts Update Today: IRS Doesn't 'Have Time' for Tax Cases Amid Layoffs",
    "description": "The IRS began layoffs that could end up cutting as many as 20,000 workers,",
    "link": "https://www.newsweek.com/doge-cuts-update-irs-layoffs-2059957",
    "timestamp": "2025-04-15T16:18:10Z"
  },
  {
    "title": "'White Lotus' star Aimee Lou Wood says she wasn't crying over 'SNL' sketch",
    "description": "'The White Lotus' season 3 star Aimee Lou Wood reacted to paparazzi photos of herself crying in public, noting that she wasn't emotional over a recent 'Saturday Night Live' sketch.",
    "link": "https://ew.com/white-lotus-star-aimee-lou-wood-clarifies-crying-photos-11715396",
    "timestamp": "2025-04-15T16:15:50Z"
  },
  {
    "title": "Federal judge temporarily blocks Trump’s use of Alien Enemies Act to deport Venezuelans from Colorado",
    "description": "The ACLU filed a lawsuit on behalf of two Venezuelan men accused of being part of Tren de Aragua.",
    "link": "https://www.bostonherald.com/2025/04/15/colorado-alien-enemies-act-deporations-temporarily-blocked/",
    "timestamp": "2025-04-15T16:15:13Z"
  },
  {
    "title": "At US antitrust trial, Meta's Zuckerberg admits he bought Instagram because it was 'better'",
    "description": "WASHINGTON : Meta CEO Mark Zuckerberg made a key confession at a U.S. antitrust trial on Tuesday, saying he bought Instagram because it had a \"better\" camera than the one his company was trying to build for flagship app Facebook at the time.The acknowledgemen…",
    "link": "https://www.channelnewsasia.com/business/us-antitrust-trial-metas-zuckerberg-admits-he-bought-instagram-because-it-was-better-5067681",
    "timestamp": "2025-04-15T16:14:56Z"
  },
  {
    "title": "Meta's Zuckerberg admits he bought Instagram because its camera was 'better'",
    "description": "WASHINGTON :Meta CEO Mark Zuckerberg made a key concession at a U.S. antitrust trial on Tuesday, saying he bought Instagram because it had a \"better\" camera than the one his company was trying to build under its flagship Facebook brand at the time.The acknowl…",
    "link": "https://www.channelnewsasia.com/business/metas-zuckerberg-admits-he-bought-instagram-because-its-camera-was-better-5067681",
    "timestamp": "2025-04-15T16:14:56Z"
  },
  {
    "title": "Trump Blames China, Biden For Boeing Deal Collapse",
    "description": "Donald Trump has accused China of backing out of a major aircraft deal with Boeing, claiming the country is refusing delivery of jets it previously committed to purchase. In a Truth Social post, Trump said China “reneged” on the agreement and blamed President…",
    "link": "https://biztoc.com/x/d6539e3ca316969a",
    "timestamp": "2025-04-15T16:13:59Z"
  },
  {
    "title": "Flat exports, high imports widen India’s trade deficit to $21.54 b in March",
    "description": "Persistent global uncertainties slowed down exports in FY 25; exporters tense about future due to lack of clarity in US policies",
    "link": "https://www.thehindubusinessline.com/economy/flat-exports-high-imports-widen-indias-trade-deficit-to-2154-b-in-march/article69453882.ece",
    "timestamp": "2025-04-15T16:13:58Z"
  },
  {
    "title": "Here’s what’s about to become more expensive with the next round of tariffs | CNN Business",
    "description": "President Donald Trump is forging ahead with his aggressive tariff campaign, moving on from “reciprocal” tariffs to the sector-specific tariffs he promised.",
    "link": "https://www.cnn.com/2025/04/15/economy/next-round-of-tariffs-cost/index.html",
    "timestamp": "2025-04-15T16:13:48Z"
  },
  {
    "title": "Trump Showdown With Courts In Spotlight At Migrant Hearing",
    "description": "US President Donald Trump's showdown with the judicial system will be in the spotlight Tuesday at a hearing on the fate of a migrant who was wrongly deported to El Salvador.",
    "link": "https://www.ibtimes.com/trump-showdown-courts-spotlight-migrant-hearing-3770172",
    "timestamp": "2025-04-15T16:12:20Z"
  },
  {
    "title": "Nvidia says there's 'not a whole lot we can do about tariffs' should Trump nix the exemption around RTX 5060 and RTX 5060 Ti graphics cards",
    "description": "But really, will we see these cards at MSRP in the wild anyway?",
    "link": "https://www.pcgamer.com/hardware/graphics-cards/nvidia-says-theres-not-a-whole-lot-we-can-do-about-tariffs-should-trump-nix-the-exemption-around-rtx-5060-and-rtx-5060-ti-graphics-cards/",
    "timestamp": "2025-04-15T16:11:45Z"
  },
  {
    "title": "I Came to the U.S. to Study. Now I’m Afraid to Speak.",
    "description": "International students across the U.S. are losing their visas without warning. For many, the only explanation is a dream turned nightmare—and a government no longer pretending to welcome us.\nThe post I Came to the U.S. to Study. Now I’m Afraid to Speak. appea…",
    "link": "https://msmagazine.com/2025/04/15/usa-international-student-visa-revoked-trump-protest-deported/",
    "timestamp": "2025-04-15T16:11:05Z"
  },
  {
    "title": "FAIR: ‘They’re Doing Their Best to Turn People Who Have Not Committed Any Crime Into Criminals’: CounterSpin interview with Dara Lind on criminalizing immigrants",
    "description": "\"They're taking far more sweeping, categorical actions toward people with fewer protections under current law, and it's harder to talk about those.\"",
    "link": "https://fair.org/home/theyre-doing-their-best-to-turn-people-who-have-not-committed-any-crime-into-criminals/",
    "timestamp": "2025-04-15T16:10:56Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
    "description": "Indian markets surged on Tuesday, with Sensex rising 1,577 points and Nifty 500 points, as Trump's tariff exemptions spurred broad-based buying across sectors despite weak earnings forecasts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/120317230.cms",
    "timestamp": "2025-04-15T16:10:33Z"
  },
  {
    "title": "Tuesday, April 15. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,147.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/04/15/tuesday-april-15-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-04-15T16:09:29Z"
  },
  {
    "title": "Mar-a-Lago Has Gone to the Dogs: Inside a Surreal Canine Fundraising Gala",
    "description": "Inside the club’s gilded gates, photographer Sarah Rae Sherman turns her lens on Big Dog Ranch Rescue’s lavish charity fundraiser—where a presidential cameo, pampered rescue pups, and millions in donations blur the line between politics and a noble cause.",
    "link": "https://www.vanityfair.com/news/story/mar-a-lago-has-gone-to-the-dogs",
    "timestamp": "2025-04-15T16:08:59Z"
  },
  {
    "title": "A 'neo-Nazi' allegedly planned to kill Trump. Federal cuts could slow foiling similar plots.",
    "description": "The FBI says 17-year-old Nikita Casap plotted to assassinate the president as a way to spur a race war. Federal funding cuts could hamper similar probes.",
    "link": "https://www.msnbc.com/top-stories/latest/nikita-casap-neo-nazi-trump-assassination-plot-rcna201228",
    "timestamp": "2025-04-15T16:08:58Z"
  },
  {
    "title": "China Suspends All Future Boeing Deliveries Amid Ongoing US Trade Standoff – Reports",
    "description": "WASHINGTON (Sputnik) – China has ordered its airlines to halt all future deliveries of Boeing aircraft and any purchases of aircraft-related equipment and parts from US companies amid the ongoing trade war between Washington and Beijing, Bloomberg reported on…",
    "link": "https://sputnikglobe.com/20250415/china-suspends-all-future-boeing-deliveries-amid-ongoing-us-trade-standoff--reports-1121876780.html",
    "timestamp": "2025-04-15T16:08:54Z"
  },
  {
    "title": "At US antitrust trial, Meta's Mark Zuckerberg admits he bought Instagram because it was 'better'",
    "description": "The acknowledgement appeared to bolster allegations by US antitrust enforcers that Meta had used a \"buy or bury\" strategy to snap up potential rivals, keep smaller competitors at bay and maintain an illegal monopoly.",
    "link": "https://economictimes.indiatimes.com/tech/technology/at-us-antitrust-trial-metas-mark-zuckerberg-admits-he-bought-instagram-because-it-was-better/articleshow/120317266.cms",
    "timestamp": "2025-04-15T16:08:45Z"
  },
  {
    "title": "Donald Trump’s Tariff Whiplash Sparks Meme Storm and Online Economics Lessons",
    "description": "Social media was filled with AI-generated memes mocking America’s trade war with China, as well as explainers by small business owners on the real-world impact of Trump’s policies.",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-tariff-whiplash-sparks-meme-storm-and-online-economics-lessons",
    "timestamp": "2025-04-15T16:07:58Z"
  },
  {
    "title": "Trump showdown with courts in spotlight at migrant hearing",
    "description": "US President Donald Trump’s showdown with the judicial system will be in the spotlight Tuesday at a hearing on the fate of a migrant who was wrongly deported to El Salvador. The Trump administration admitted that Kilmar Abrego Garcia, who was living in the st…",
    "link": "https://www.digitaljournal.com/world/trump-showdown-with-courts-in-spotlight-at-migrant-hearing/article",
    "timestamp": "2025-04-15T16:07:20Z"
  },
  {
    "title": "Andrew Tate Will Face U.K. Abuse Trial In 2027—As Legal Issues Grow Internationally",
    "description": "Tate’s legal issues span the United Kingdom, Romania and United States, where he faces civil and criminal investigations over alleged abuse and sexual assault.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/15/andrew-tate-will-face-uk-abuse-trial-in-2027-as-legal-issues-grow-internationally/",
    "timestamp": "2025-04-15T16:06:19Z"
  },
  {
    "title": "Trump says Harvard should lose its tax exempt status, be treated as 'political entity' amid funding dispute",
    "description": "President Donald Trump said Harvard University's tax exempt status is \"contingent\" on acting in the public interest after pulling $2.2 billion in funding.",
    "link": "https://www.foxnews.com/politics/trump-says-harvard-should-lose-tax-exempt-status-treated-political-entity-funding-dispute",
    "timestamp": "2025-04-15T16:06:04Z"
  },
  {
    "title": "China escalates cyber fight with U.S., names alleged NSA hackers",
    "description": "China has for the first time publicly accused three hackers of working for the National Security Agency and offered a reward for information leading to their arrest, echoing tactics the U.S. routinely uses against alleged Chinese cyberspies.",
    "link": "https://www.nbcnews.com/tech/security/china-escalates-cyber-fight-us-names-alleged-nsa-hackers-rcna201286",
    "timestamp": "2025-04-15T16:05:50Z"
  },
  {
    "title": "Federal judge temporarily blocks Trump’s use of Alien Enemies Act to deport Venezuelans from Colorado",
    "description": "The American Civil Liberties Union filed a lawsuit on behalf of two Venezuelan men in Colorado who have been accused of being part of the Tren de Aragua gang.",
    "link": "https://www.denverpost.com/2025/04/15/colorado-alien-enemies-act-deporations-temporarily-blocked/",
    "timestamp": "2025-04-15T16:05:21Z"
  },
  {
    "title": "No Tariff Exemptions for American Farmers\nThey voted for the tariffs when they voted for Trump.",
    "description": "American farmers are pleading for exemptions from President Donald Trump’s tariffs. Republican members of Congress from farm states are working to deliver the relief farmers want. But farmers do not deserve special treatment and should not get it.",
    "link": "https://freerepublic.com/focus/f-news/4311159/posts",
    "timestamp": "2025-04-15T16:04:40Z"
  },
  {
    "title": "El Salvador should face 'severe' consequences for helping Trump scheme: Dem lawmaker",
    "description": "In an appearance on CNN, Rep. Richie Torres (D-NY) slammed President Donald Trump’s deportation of Maryland resident Abrego Garcia and also spoke about a new bill which “would require the U.S. to secure the return of mistakenly deported individuals.\"While spe…",
    "link": "https://www.rawstory.com/trump-immigration-2671773849/",
    "timestamp": "2025-04-15T16:04:29Z"
  },
  {
    "title": "JD Vance Clarifies Stance on Russia, Zelensky: 'Absurd'",
    "description": "Vice President JD Vance said the U.S. must understand both Russia and Ukraine's strategic red lines to end the war, and dismissed Ukrainian President Volodymyr Zelensky's \"absurd\" suggestion that Washington is taking Moscow's side. Zelensky had told CBS' 60 M…",
    "link": "https://freerepublic.com/focus/f-news/4311158/posts",
    "timestamp": "2025-04-15T16:04:07Z"
  },
  {
    "title": "How Nayib Bukele’s White House performance plays into Trump’s litigation defiance",
    "description": "Monday’s meeting between President Donald Trump and Salvadoran President Nayib Bukele made it clear that the two men are political partners in Trump’s deportation efforts.",
    "link": "https://biztoc.com/x/a389b6d4aff7fc3e",
    "timestamp": "2025-04-15T16:02:35Z"
  },
  {
    "title": "Is Donald Trump targeting Black Americans? President says he's studying options to deport heinous, violent criminals who are U.S. citizens to hell-hole El Salvador prison",
    "description": "Trump deportation proposal has sparked national outrage after President Donald Trump suggested deporting even U.S. citizens convicted of violent crimes to El Salvador. His controversial remarks—made during an Oval Office meeting with El Salvador’s president—a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-donald-trump-targeting-black-americans-president-says-hes-studying-options-to-deport-heinous-violent-criminals-who-are-u-s-citizens-to-hell-hole-el-salvador-prison/articleshow/120316254.cms",
    "timestamp": "2025-04-15T16:02:28Z"
  },
  {
    "title": "Putin wants permanent peace in Ukraine – Trump envoy",
    "description": "Steve Witkoff met with Russian President Vladimir Putin last week as part of ongoing talks between Moscow and Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615790-witkoff-putin-meeting-ukraine-conflict/",
    "timestamp": "2025-04-15T16:02:19Z"
  },
  {
    "title": "A-1 Steak Sauce Responds To Linda McMahon's Stupidity",
    "description": "Donald Trump's unqualified Education Secretary Linda McMahon embarrassed herself and the entire country when she started describing artificial intelligence as A1 steak sauce during a conference last week.\nMSNBC's Rachel Maddow explained that McMahon's job is …",
    "link": "https://crooksandliars.com/2025/04/trump-education-secretary-embarrasses",
    "timestamp": "2025-04-15T16:00:31Z"
  },
  {
    "title": "Matt Drudge broke the Lewinsky story — and the media gatekeepers",
    "description": "This article is part of The Poynter 50, a series reflecting on 50 moments and people that shaped journalism over the past half-century — and continue to influence its future. […]\nThe post Matt Drudge broke the Lewinsky story — and the media gatekeepers appear…",
    "link": "https://www.poynter.org/ethics-trust/2025/poynter-50-matt-drudge-report-clinton-lewinsky-newsweek-scoop/",
    "timestamp": "2025-04-15T16:00:13Z"
  },
  {
    "title": "I Own a Fashion Brand. Here's What Tariffs Will Do to My Industry | Opinion",
    "description": "For people like me—entrepreneurs who've built fashion brands that rely on undisturbed supply chains—these tariffs hit like a sledgehammer.",
    "link": "https://www.newsweek.com/i-own-fashion-brand-heres-what-tariffs-will-do-my-industry-opinion-2058719",
    "timestamp": "2025-04-15T16:00:07Z"
  },
  {
    "title": "Some U.S. Autos Get A Tariff Exemption From Canada—If They Keep Production Plants",
    "description": "President Donald Trump also suggested he may impose tariff relief for automakers, which face 25% levies in the U.S. and Canada.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/15/some-us-autos-get-a-tariff-exemption-from-canada-if-they-keep-production-plants/",
    "timestamp": "2025-04-15T16:00:06Z"
  },
  {
    "title": "We’re the biggest queer group you never see—it’s time we changed that",
    "description": "If you're bi+, you may not be very engaged in the queer community. You may not even consider queerness to be a part of your life or your identity. Given the current circumstances, though, bisexuals need to reconsider this lackluster approach to community buil…",
    "link": "https://www.advocate.com/voices/bisexual-identity-action",
    "timestamp": "2025-04-15T16:00:04Z"
  },
  {
    "title": "FED Snubs Trump; Powell Defiant...",
    "description": "The White House wants the Federal Reserve to let banks load up on Treasury bonds, a move that could steady an unnerved market for US debt. But the Fed isn’t in a hurry.",
    "link": "https://www.semafor.com/article/04/14/2025/federal-reserve-jerome-powell-has-no-plans-to-speed-up-change-to-bank-capital-rules-to-calm-treasury-market",
    "timestamp": "2025-04-15T16:00:03Z"
  },
  {
    "title": "Musk and Trump Are Increasingly Unpopular, New Polling Finds",
    "description": "The Tesla CEO's chaotic and aggressive push into federal agencies have made him a particular liability for the administration",
    "link": "http://www.rollingstone.com/politics/politics-features/musk-trump-increasingly-unpopular-new-poll-1235317605/",
    "timestamp": "2025-04-15T16:00:00Z"
  },
  {
    "title": "Jelly Like US Robot Battery Can Survive All Assaults Including Twists, Cuts, Stabbing",
    "description": "Researchers from UC Berkeley, Georgia Tech, and Hong Kong University have developed a new jelly-like lithium-ion battery that defies conventional limitations. Unlike traditional lithium-ion batteries, this innovative battery can withstand twists, cuts, and st…",
    "link": "https://www.ponoko.com/blog/ponoko/jelly-like-us-robot-battery-can-survive-all-assaults-including-twists-cuts-stabbing/",
    "timestamp": "2025-04-15T16:00:00Z"
  },
  {
    "title": "NBC News’ TikTok Viewership Surges 1,800% to 2.5 Billion Views in Q1 | Exclusive",
    "description": "President Trump's return to the White House helped NBC News hit record viewership on TikTok and pull in more website readers between January and March\nThe post NBC News’ TikTok Viewership Surges 1,800% to 2.5 Billion Views in Q1 | Exclusive appeared first on …",
    "link": "https://www.thewrap.com/nbc-news-tiktok-viewership-surges/",
    "timestamp": "2025-04-15T16:00:00Z"
  }
]