[
  {
    "title": "Trump to order closure of Department of Education",
    "description": "The News\nUS President Donald Trump will reportedly order the shutdown of the Department of Education today. \nConservatives have long targeted the agency, accusing it of pushing progressive agendas in its curricula, and saying education policy should be handle…",
    "link": "https://biztoc.com/x/7a29413544f9f7ae",
    "timestamp": "2025-03-20T11:34:27Z"
  },
  {
    "title": "US track star says she feels ‘defeated’ after Trump’s move against trans athletes | CNN",
    "description": "She’s a two-time All American in 200- and 400-meter races. A college athlete used to winning, with a goal of making the 2032 US Olympic team. But 21-year-old Sadie Schreiner says she feels “defeated.”",
    "link": "https://www.cnn.com/2025/03/20/us/sadie-schreiner-trans-athlete-ban/index.html",
    "timestamp": "2025-03-20T11:33:09Z"
  },
  {
    "title": "U.S. seeks to deport pro-Palestinian Georgetown University student",
    "description": "U.S. President Donald Trump's administration has detained an Indian man studying at Washington's Georgetown University and is seeking to deport him after deeming him a harm to U.S. foreign policy, the student's lawyer said on Wednesday.",
    "link": "https://www.cbc.ca/news/world/georgetown-university-badar-khan-suri-1.7488395",
    "timestamp": "2025-03-20T11:31:36Z"
  },
  {
    "title": "Stagflation, explained: What to know about the latest economic forecast",
    "description": "There’s no cocktail a central banker hates more than high unemployment mixed with high inflation. That cocktail, also known as stagflation, was in the limelight after the Federal Reserve’s March meeting.",
    "link": "https://www.cnn.com/2025/03/20/business/stagflation-explained/index.html",
    "timestamp": "2025-03-20T11:30:52Z"
  },
  {
    "title": "Former Supreme Court Justice says it’s not appropriate to ‘impeach’ judges over controversial decisions",
    "description": "It's \"not an appropriate\" move to impeach a federal judge if you dislike a decision, retired Supreme Court Justice Stephen Breyer said in a new interview.",
    "link": "https://www.foxnews.com/media/former-supreme-court-justice-says-its-not-appropriate-impeach-judges-over-controversial-decisions",
    "timestamp": "2025-03-20T11:30:45Z"
  },
  {
    "title": "Trump Threatens Houthi Rebels That They’ll be ‘Completely Annihilated’ as Airstrikes Pound Yemen",
    "description": "As the strikes hit, Trump wrote on his Truth Social platform that “tremendous damage has been inflicted upon the Houthi barbarians.”",
    "link": "https://time.com/7270075/trump-threatens-houthi-rebels-airstrikes-yemen/",
    "timestamp": "2025-03-20T11:30:36Z"
  },
  {
    "title": "Buyouts at the Sun-Times shrink the newsroom — and the dream",
    "description": "Good morning. Today’s Poynter Report is not totally Donald Trump-free, but we will not be leading the newsletter with the president, as we have for much of the past two […]\nThe post Buyouts at the Sun-Times shrink the newsroom — and the dream appeared first o…",
    "link": "https://www.poynter.org/?p=1151837",
    "timestamp": "2025-03-20T11:30:09Z"
  },
  {
    "title": "Rystad's Head of Geopolitical Analysis Looks at Limited Ceasefire",
    "description": "'The market's expectation of a quick resolution, in line with President Trump's desire, will need to be reassessed', Rystad Energy's Head of Geopolitical Analysis, Jorge Leon, said.",
    "link": "https://www.rigzone.com/news/rystads_head_of_geopolitical_analysis_looks_at_limited_ceasefire-20-mar-2025-179980-article/",
    "timestamp": "2025-03-20T11:30:08Z"
  },
  {
    "title": "With talk of a 51st state, a mystery: Why is Trump obsessed with Canada? (Martine Powers/Washington Post)",
    "description": "Martine Powers / Washington Post:\nWith talk of a 51st state, a mystery: Why is Trump obsessed with Canada? -- Canadians say President Trump's 51st-state rhetoric is a threat to national security. They're also perplexed by the origin of his vision for Canadian…",
    "link": "https://www.memeorandum.com/250320/p10",
    "timestamp": "2025-03-20T11:30:02Z"
  },
  {
    "title": "Trump Wants to go to Mars. That’s Not Happening",
    "description": "Elon Musk and Donald Trump have announced ambitious plans to send a mission to Mars in 2026 and 2028. It’s not going to happen",
    "link": "https://www.scientificamerican.com/article/trump-wants-to-go-to-mars-thats-not-happening/",
    "timestamp": "2025-03-20T11:30:00Z"
  },
  {
    "title": "John Roberts’ Obsession With SCOTUS Legitimacy Has Severely Delegitimized It",
    "description": "Ending universal injunctions once and for all is the least the chief justice can do to defend not only the judiciary, but our country.",
    "link": "https://thefederalist.com/2025/03/20/john-roberts-obsession-with-scotus-legitimacy-has-severely-delegitimized-it/",
    "timestamp": "2025-03-20T11:26:32Z"
  },
  {
    "title": "Lia Thomas former teammates react to UPenn federal funding pause amid Trump's vow to enforce Title IX",
    "description": "Three of Lia Thomas' former UPenn teammates provided a statement to Fox News Digital commending the Trump administration for pausing funding to the university.",
    "link": "https://www.foxnews.com/sports/lia-thomas-former-teammates-react-upenn-federal-funding-pause-amid-trumps-vow-enforce-title-ix",
    "timestamp": "2025-03-20T11:26:22Z"
  },
  {
    "title": "Danish Prime Minister & Former NATO Secretary General Defend Ukraine, Offer Implicit Criticism Of Trump As CPH:DOX Festival Opens",
    "description": "CPH:DOX, the world-class documentary festival in Copenhagen, is underway – kicking off with the world premiere of a film that could not be more timely. Facing War, directed by Tommy Gulliksen, examines the final years of Jens Stoltenberg’s 10-year stretch as …",
    "link": "http://deadline.com/2025/03/cphdox-opening-night-danish-prime-minister-former-nato-secretary-general-1236335810/",
    "timestamp": "2025-03-20T11:25:31Z"
  },
  {
    "title": "Heritage Foundation d-bags are now openly begging Prince Harry to ‘self-deport’",
    "description": "It was painful to watch the gleeful “will Prince Harry get deported?!?!” commentary in the past week. The deportation commentary reached a fever pitch ahead of Tuesday’s document release of Harry’s “visa records.” Even before the release, it was perfectly cle…",
    "link": "https://www.celebitchy.com/914328/heritage_foundation_d-bags_are_now_openly_begging_prince_harry_to_self-deport/",
    "timestamp": "2025-03-20T11:25:28Z"
  },
  {
    "title": "More than a dozen judges have said Trump and Co. probably broke the law (Aaron Blake/Washington Post)",
    "description": "Aaron Blake / Washington Post:\nMore than a dozen judges have said Trump and Co. probably broke the law -- Trump is now averaging one such finding about every four days. -- Just now -- From the start of his second term, President Donald Trump and his administr…",
    "link": "https://www.memeorandum.com/250320/p9",
    "timestamp": "2025-03-20T11:25:00Z"
  },
  {
    "title": "Amazon hit series ‘House of David’ portrays biblical King David as an ‘underdog’ with a ‘message of resilience’.",
    "description": "American culture these days is awash with stories of succession (the Murdoch empire), family drama (the Kennedys) and power (President Donald Trump on social media donning a kingly crown). Now comes a biblical tale to rival today’s news cycle — the coming-of-…",
    "link": "https://freerepublic.com/focus/f-religion/4305516/posts",
    "timestamp": "2025-03-20T11:24:57Z"
  },
  {
    "title": "Pentagon restores histories of Navajo Code Talkers, other Native veterans after public outcry",
    "description": "The Pentagon scrubbed some content as part of a broader sweep of information that promoted DEI.",
    "link": "https://www.bostonherald.com/2025/03/20/pentagon-dei-native-american-veterans/",
    "timestamp": "2025-03-20T11:23:55Z"
  },
  {
    "title": "Trump Targets Education Department With Shutdown Order: Live Updates",
    "description": "President Donald Trump is expected to sign an executive order on Thursday directing the closure of the U.S. Department of Education, fulfilling a key campaign promise to return education authority to the states. A White House official, speaking anonymously ah…",
    "link": "https://biztoc.com/x/1bae69f002e54fcd",
    "timestamp": "2025-03-20T11:23:19Z"
  },
  {
    "title": "U.S. Intelligence Contradicts Trump on Ukraine: Report",
    "description": "U.S. President Donald Trump had said Ukrainian troops were encircled in Kursk.",
    "link": "https://biztoc.com/x/5b0fba66366f581a",
    "timestamp": "2025-03-20T11:23:00Z"
  },
  {
    "title": "Tesla backer says Musk must reduce Trump work, as 46,000 Cybertrucks recalled",
    "description": "Dan Ives warns company is in ‘brand tornado crisis moment’ as protests are planned at car showrooms\nBusiness live latest updates\nTesla and Elon Musk are embroiled in a “brand tornado crisis moment” and the electric carmaker’s chief executive needs to cut back…",
    "link": "https://biztoc.com/x/6034cd5b0213fcb9",
    "timestamp": "2025-03-20T11:22:51Z"
  },
  {
    "title": "Small Business Optimism in Canada Collapses to 25-Year Low",
    "description": "Optimism among Canada’s small and medium-sized firms fell to the lowest level in at least a quarter-century after the US started a trade war with the country, according to the Canadian Federation of Independent Business.",
    "link": "https://financialpost.com/pmn/business-pmn/small-business-optimism-in-canada-collapses-to-25-year-low",
    "timestamp": "2025-03-20T11:21:17Z"
  },
  {
    "title": "Satellite Photo Shows US Aircraft Carrier Leading Strikes on Houthis",
    "description": "The USS Harry S. Truman carrier strike group is positioned approximately 480 miles from Houthi-controlled territory in Yemen.",
    "link": "https://www.newsweek.com/satellite-photo-shows-us-aircraft-carrier-leading-strikes-houthis-2047722",
    "timestamp": "2025-03-20T11:21:06Z"
  },
  {
    "title": "Transgender-Identifying Waterville City Councillor Resigns, Blaming Trump for Her Decline in Health",
    "description": "The transgender-identifying Waterville City Councilor Rien Finch—formerly known as Hannah Heidt—resigned from her position without warning on Monday, claiming that President Donald Trump’s election left physically unable to breathe, requiring hospitalization.…",
    "link": "https://www.themainewire.com/2025/03/transgender-identifying-waterville-city-councillor-resigns-blaming-trump-for-her-decline-in-health/",
    "timestamp": "2025-03-20T11:20:24Z"
  },
  {
    "title": "Transcript: Trump Seethes at Canada with “the Eyes of a Predator”",
    "description": "The following is a lightly edited transcript of the March 20 episode of theDaily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nIt’s beco…",
    "link": "https://newrepublic.com/article/192953/transcript-trump-seethes-canada-the-eyes-predator",
    "timestamp": "2025-03-20T11:20:18Z"
  },
  {
    "title": "Chris Miller, Former Acting U.S. Secretary of Defense Appointed by President Trump, Joins the Draganfly Board of Directors",
    "description": "Tampa, Florida, March 20, 2025 (GLOBE NEWSWIRE) — Draganfly Inc, (NASDAQ: DPRO) (CSE: DPRO) (FSE: 3U8A) (“Draganfly” or the “Company”), an award-winning, industry-leading drone solutions and systems developer, is proud to announce that Christopher C. Miller, …",
    "link": "https://financialpost.com/globe-newswire/chris-miller-former-acting-u-s-secretary-of-defense-appointed-by-president-trump-joins-the-draganfly-board-of-directors",
    "timestamp": "2025-03-20T11:18:38Z"
  },
  {
    "title": "Trump Targets Education Department With Shutdown Order: Live Updates",
    "description": "Trump to sign order Thursday to close Education Department, but Congress may block full shutdown. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-administration-executive-order-live-updates-2047743",
    "timestamp": "2025-03-20T11:17:40Z"
  },
  {
    "title": "5 things to know for March 20: Department of Education, Pentagon purge, Gaza, Taxpayer data, Alzheimer’s | CNN",
    "description": "5 things to know for March 20: Department of Education, Pentagon purge, Gaza, Taxpayer data, Alzheimer’s | CNNcnn.com",
    "link": "https://www.cnn.com/2025/03/20/us/5-things-to-know-for-march-20-department-of-education-pentagon-purge-gaza-taxpayer-data-alzheimers/index.html",
    "timestamp": "2025-03-20T11:17:37Z"
  },
  {
    "title": "Trump will order a plan to shut down the US Education Department",
    "description": "President Donald Trump plans to sign an executive order to shut down the U.S. Education Department and return education authority to states, fulfilling a campaign promise. The order instructs Secretary Linda McMahon to facilitate the closure while ensuring on…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-will-order-a-plan-to-shut-down-the-us-education-department/articleshow/119256002.cms",
    "timestamp": "2025-03-20T11:15:52Z"
  },
  {
    "title": "Federal Reserve sees tariffs raising inflation this year, keeps key rate unchanged",
    "description": "The Fed now expects the economy to grow more slowly this year.",
    "link": "https://www.denverpost.com/2025/03/20/federal-reserve-interest-rate-decision/",
    "timestamp": "2025-03-20T11:15:11Z"
  },
  {
    "title": "Federal Reserve sees tariffs raising inflation this year, keeps key rate unchanged",
    "description": "The Federal Reserve kept its benchmark interest rate unchanged Wednesday and signaled that it still expects to cut rates twice this year, though more policymakers forecast fewer cuts.",
    "link": "https://www.bostonherald.com/2025/03/20/federal-reserve-interest-rate-decision/",
    "timestamp": "2025-03-20T11:15:11Z"
  },
  {
    "title": "Dropkick Murphys calls out Maga hat wearer in crowd: you know who’s in a cult",
    "description": "I guess I’ve been listening to too much Lady Gaga and movie music scores, because I was today-years-old when I learned of Celtic punk band Dropkick Murphys. (Massachusetts, please forgive me!) Anyway, the band is touring and has won me over as a new mega fan.…",
    "link": "https://www.celebitchy.com/914287/dropkick_murphys_calls_out_maga_hat_wearer_in_crowd_you_know_whos_in_a_cult/",
    "timestamp": "2025-03-20T11:15:09Z"
  },
  {
    "title": "Chris Miller, Former Acting U.S. Secretary of Defense Appointed by President Trump, Joins the Draganfly Board of Directors",
    "description": "Tampa, Florida, March 20, 2025 (GLOBE NEWSWIRE) -- Draganfly Inc, (NASDAQ: DPRO) (CSE: DPRO) (FSE: 3U8A) (“Draganfly” or the “Company”), an award-winning, industry-leading drone solutions and systems developer, is proud to announce that Christopher C. Miller,…",
    "link": "https://www.globenewswire.com/news-release/2025/03/20/3046114/0/en/Chris-Miller-Former-Acting-U-S-Secretary-of-Defense-Appointed-by-President-Trump-Joins-the-Draganfly-Board-of-Directors.html",
    "timestamp": "2025-03-20T11:15:00Z"
  },
  {
    "title": "Gold Surges, Bitcoin Rallies, Stocks Down Since Trump's Electoral Win — What’s Driving the Chaos?",
    "description": "Initially BTC decoupled from stocks, but the positive correlation has strengthened during the recent downturn.",
    "link": "https://www.coindesk.com/markets/2025/03/20/gold-surges-bitcoin-rallies-stocks-down-since-trump-s-electoral-win-what-s-driving-the-chaos",
    "timestamp": "2025-03-20T11:14:46Z"
  },
  {
    "title": "U.S. Intelligence Contradicts Trump on Ukraine: Report",
    "description": "U.S. President Donald Trump had said Ukrainian troops were encircled in Kursk.",
    "link": "https://www.newsweek.com/us-intelligence-contradicts-trump-ukraine-report-2047747",
    "timestamp": "2025-03-20T11:14:40Z"
  },
  {
    "title": "This website allegedly exposed personal information about Tesla owners amid a wave of attacks. Check details",
    "description": "At a time when facilities and dealerships of Tesla are facing massive attacks, a website called 'Dogequest'  has posted what it claims is the personal information of Tesla owners across the US. This has sparked concerns about privacy of Tesla owners. The DOGE…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-dogequest-elon-musk-tesla-this-website-exposed-personal-information-about-tesla-owners-amid-a-wave-of-attacks-check-details/articleshow/119255723.cms",
    "timestamp": "2025-03-20T11:13:41Z"
  },
  {
    "title": "Exclusive: Intelligence shared with White House shows Ukrainians not 'encircled' in Kursk - Reuters",
    "description": "Exclusive: Intelligence shared with White House shows Ukrainians not 'encircled' in KurskReuters 'Everything is finished': Ukrainian troops relive retreat from KurskBBC.com Vladimir Putin says Ukraine must surrender after Donald Trump calls for soldiers to be…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176776743",
    "timestamp": "2025-03-20T11:13:02Z"
  },
  {
    "title": "Tesla recalls over 46,000 Cybertrucks as trim detaching from vehicle",
    "description": "Tesla is recalling 46,096 Cybertruck vehicles in the U.S. to fix an exterior panel issue that could detach while driving, posing a road hazard. The recall could impact the EV maker's growth amid rising competition and consumer shift towards less expensive hyb…",
    "link": "https://economictimes.indiatimes.com/news/international/business/tesla-recalls-over-46000-cybertrucks-as-trim-detaching-from-vehicle/articleshow/119255867.cms",
    "timestamp": "2025-03-20T11:12:48Z"
  },
  {
    "title": "Trump targets Education Department and Steve Kornacki's NCAA picks: Morning Rundown",
    "description": "Donald Trump is expected to sign an executive order to close the Education Department.",
    "link": "https://www.nbcnews.com/news/us-news/trump-education-department-steve-kornackis-ncaa-picks-morning-rundown-rcna197212",
    "timestamp": "2025-03-20T11:12:27Z"
  },
  {
    "title": "Donald Trump Says Gold Card Visa Could Be Renamed 'Trump Card'",
    "description": "President Donald Trump suggested renaming his proposed \"gold card\" visa as the \"Trump card,\" claiming the name would be more appealing.\n\"I will tell you what my people want to call it. It'll drive you crazy. It'll drive the left crazy. They want to call it th…",
    "link": "https://biztoc.com/x/13f61f4c412a4014",
    "timestamp": "2025-03-20T11:11:56Z"
  },
  {
    "title": "End of an era: Can Europe protect itself without the U.S.?",
    "description": "Barely a month ago, a phone call between Donald Trump and Vladimir Putin sent an unmistakable message across the Atlantic: the United States may not be there forever to keep Europe safe from an aggressive Russia.\nBy the time the pair spoke again this week, a …",
    "link": "https://biztoc.com/x/9a70bcfb4a51baff",
    "timestamp": "2025-03-20T11:11:50Z"
  },
  {
    "title": "Trump to sign executive order to begin shuttering the Education Department",
    "description": "President Donald Trump is expected to sign an executive order Thursday to close the Education Department, fulfilling a yearslong pledge to dismantle the federal agency, the White House confirmed.",
    "link": "https://biztoc.com/x/470605b53eb0043f",
    "timestamp": "2025-03-20T11:11:47Z"
  },
  {
    "title": "Tesla to recall more than 46,000 Cybertrucks due to exterior panel issue | CNN Business",
    "description": "is recalling 46,096 Cybertruck vehicles in the U.S. to fix an exterior panel that could detach while driving, the latest in a series of call-backs for the pickup truck since last year.",
    "link": "https://www.cnn.com/2025/03/20/business/tesla-cybertruck-recall/index.html",
    "timestamp": "2025-03-20T11:10:21Z"
  },
  {
    "title": "GOP Leaders Decry Report On Trump's Plan To Shake Up Pentagon Command, Possibly Affecting NATO Role",
    "description": "Two key Republican leaders have expressed opposition to reported plans by the Trump administration to potentially implement massive reorganization of Pentagon combatant commands, as well as the possible withdrawal from Washington's role of SACEUR in the NATO.",
    "link": "https://www.ibtimes.com/gop-leaders-decry-report-trumps-plan-shake-pentagon-command-possibly-affecting-nato-role-3767050",
    "timestamp": "2025-03-20T11:10:01Z"
  },
  {
    "title": "Donald Trump Says Gold Card Visa Could Be Renamed 'Trump Card'",
    "description": "The President suggests renaming his proposed \"gold card\" visa to the \"Trump card\" on The Ingraham Angle.",
    "link": "https://www.newsweek.com/donald-trump-gold-card-visa-immigration-2047682",
    "timestamp": "2025-03-20T11:09:30Z"
  },
  {
    "title": "\"Too Reliant On US\"? Why Canada PM Chose Europe Over US As First Foreign Visit",
    "description": "During his visit, Carney emphasised the importance of strengthening ties with reliable allies, particularly in the face of Trump&#039;s aggressive trade policies.",
    "link": "https://www.ndtv.com/world-news/too-reliant-on-us-why-canada-pm-mark-carney-chose-europe-over-us-as-first-foreign-visit-7968288",
    "timestamp": "2025-03-20T11:07:42Z"
  },
  {
    "title": "Cryptocurrency exchange Kraken to buy NinjaTrader for $1.5 billion",
    "description": "Kraken said on Thursday it would buy retail futures trading platform NinjaTrader for $1.5 billion, in a deal that would allow one of the world's largest cryptocurrency exchanges to expand into multiple asset classes and grow its user base.The acquisition come…",
    "link": "https://www.channelnewsasia.com/business/cryptocurrency-exchange-kraken-buy-ninjatrader-15-billion-5013291",
    "timestamp": "2025-03-20T11:06:34Z"
  },
  {
    "title": "Games eye L.A. 'rebirth,' Kendrick Lamar role",
    "description": "After deadly fires devastated much of Los Angeles, organizers of the 2028 Games told the IOC how the city will rebuild with their help.",
    "link": "https://www.espn.com/olympics/story/_/id/44326214/2028-olympics-leader-promises-la-rebuild-kendrick-lamar",
    "timestamp": "2025-03-20T11:05:03Z"
  },
  {
    "title": "Judge Denies Reinstatement Of US Institute Of Peace Leadership, Slams DOGE's 'Terrorizing' Takeover",
    "description": "\"Why those ways here -- just because DOGE is in a rush?\" U.S. District Judge Beryl Howell asked as she condemned the use of armed agents by DOGE to force USIP leaders out of office.",
    "link": "https://www.ibtimes.com/judge-denies-reinstatement-us-institute-peace-leadership-slams-doges-terrorizing-takeover-3767034",
    "timestamp": "2025-03-20T11:04:01Z"
  },
  {
    "title": "‘You know how you voted for extra public spending? Well…’ says Reeves",
    "description": "THE chancellor has explained to the electorate that, just like with voting for lower immigration and Boris, they will not be getting exactly what they asked for.",
    "link": "https://www.thedailymash.co.uk/politics/you-know-how-you-voted-for-extra-public-spending-well-says-reeves-20250320255703",
    "timestamp": "2025-03-20T11:03:28Z"
  },
  {
    "title": "Who Is Solomon Peña? GOP Candidate Found Guilty of Democrat Shooting Plot",
    "description": "Peña was convicted on all counts in connection with a series of drive-by shootings at the homes of four Democratic elected officials in New Mexico.",
    "link": "https://www.newsweek.com/solomon-pena-gop-candidate-guilty-democratic-plot-shooting-2047671",
    "timestamp": "2025-03-20T11:02:44Z"
  },
  {
    "title": "‘Don’t blame us, blame Musk.' Germany’s Tesla-owning taxi drivers appeal for customer tolerance",
    "description": "Popularity of tech billionaire’s car brand plummets in country where it has its only European factory",
    "link": "https://www.irishtimes.com/world/europe/2025/03/20/dont-blame-us-blame-musk-germanys-tesla-owning-taxi-drivers-appeal-for-customer-tolerance/",
    "timestamp": "2025-03-20T11:01:41Z"
  },
  {
    "title": "Legal Showdown Over Sanctuary Laws Tests Federal vs. State Power Again",
    "description": "The Trump administration is threatening to investigate and prosecute state and local officials who impede the enforcement of federal immigration laws. California cities and counties are in the crosshairs.",
    "link": "https://www.kqed.org/news/12031821/legal-showdown-over-sanctuary-laws-tests-federal-vs-state-power-again",
    "timestamp": "2025-03-20T11:00:41Z"
  },
  {
    "title": "US Denies Entry To French Scientist Over 'Hateful' Messages",
    "description": "France has expressed concern after US border agents read the contents of a visiting French space scientist's smartphone and deported him after accusing him of \"hateful\" messages against US policy.",
    "link": "https://www.ibtimes.com/us-denies-entry-french-scientist-over-hateful-messages-3767057",
    "timestamp": "2025-03-20T11:00:23Z"
  },
  {
    "title": "The future of nature is nonpartisan. Let's combat environmental extremism with common sense",
    "description": "If we wants to make environmental progress that lasts beyond the next Election Day, we need a group that fights to conserve our natural beauty regardless of which \"side\" is in power.",
    "link": "https://www.foxnews.com/opinion/future-nature-nonpartisan-lets-combat-environmental-extremism-common-sense",
    "timestamp": "2025-03-20T11:00:07Z"
  },
  {
    "title": "I learned my hometown paper died from Facebook. That’s the future we’re facing",
    "description": "I’m from a place called Cortland, a small college town nestled in New York’s Finger Lakes region about a half an hour south of Syracuse. If you haven’t heard of […]\nThe post I learned my hometown paper died from Facebook. That’s the future we’re facing appear…",
    "link": "https://www.poynter.org/commentary/2025/cortland-standard-local-newspaper-closure/",
    "timestamp": "2025-03-20T11:00:04Z"
  },
  {
    "title": "'Boebert hasn't held a town hall': Angry voters yell concerns at 'cardboard Lauren' cutout",
    "description": "U.S. Rep. Lauren Boebert (R-CO) hasn't been holding in-person town halls, so her constituents have resorted to yelling at a cardboard cutout of the lawmaker.Boebert has consistently stood by the side of Donald Trump and Elon Musk, prompting concern from some …",
    "link": "https://www.rawstory.com/lauren-boebert-cardboard-cutout-protest/",
    "timestamp": "2025-03-20T11:00:02Z"
  },
  {
    "title": "Feeling Sexy? In This Economy?",
    "description": "\"Our sex lives can suffer when the world around us feels uncertain or even dangerous,\" writes Myisha Battle.",
    "link": "https://time.com/7269612/feeling-sexy-high-stress-essay/",
    "timestamp": "2025-03-20T11:00:00Z"
  },
  {
    "title": "The October Story That Outlined Exactly What the Trump Administration Would Do to the Federal Bureaucracy",
    "description": "by Stephen Engelberg \n \n\n \n ProPublica is a nonprofit newsroom that investigates abuses of power. This story was originally published in our Dispatches newsletter; sign up to receive notes from our journalists.\n\n \n\n \n \n \n\n\n\n \nIn late October, ProPublica publi…",
    "link": "https://www.propublica.org/article/propublica-russell-vought-prophetic-trump-second-term",
    "timestamp": "2025-03-20T11:00:00Z"
  },
  {
    "title": "A Department of Education Office Changed My Life. Now It’s Been Cut",
    "description": "Novelist Lydia Kiesling on lost jobs and possibilities",
    "link": "https://time.com/7269589/department-of-education-cuts-essay/",
    "timestamp": "2025-03-20T11:00:00Z"
  },
  {
    "title": "'Great uncertainty': UC system orders hiring freeze amid steep Trump cuts",
    "description": "The University of California announced a systemwide hiring freeze as the Trump administration threatens to dramatically slash its funding. In a Wednesday statement, UC President Michael Drake said university leaders are preparing for “significant financial ch…",
    "link": "https://freerepublic.com/focus/f-news/4305512/posts",
    "timestamp": "2025-03-20T10:58:33Z"
  },
  {
    "title": "Released JFK files reveal Social Security numbers of former staffers",
    "description": "Released JFK files reveal Social Security numbers of former staffersgo.com",
    "link": "https://abcnews.go.com/US/released-jfk-files-reveal-social-security-numbers-former/story?id=119977628",
    "timestamp": "2025-03-20T10:56:39Z"
  },
  {
    "title": "U.S. energy stocks take the lead in the S&P 500 as inflation anxiety builds",
    "description": "The energy sector’s hedging appeal is key for investors looking to gird their portfolios against the risk of rising price pressure. Read on.",
    "link": "https://financialpost.com/investing/us-energy-stocks-lead-inflation-anxiety-builds",
    "timestamp": "2025-03-20T10:55:58Z"
  },
  {
    "title": "Is Trump Engineering the Decline and Fall of the Dollar?",
    "description": "Dollar devaluation and dollar dominance are not necessarily mutually exclusive. But the approach to weakening the greenback that US President Donald Trump’s administration is considering would almost certainly spell the end of the US dollar’s reign as the dom…",
    "link": "https://www.project-syndicate.org/commentary/mar-a-lago-accord-would-spell-the-end-of-dollar-dominance-by-jeffrey-frankel-2025-03",
    "timestamp": "2025-03-20T10:55:29Z"
  },
  {
    "title": "Pritzker: Trump Coerced Me Into Praising Him On Sunday Shows",
    "description": "Trump “could have fought for us. He really could have,” Gov. JB Pritzker said of the early days of the pandemic when masks and ventilators were in short supply for healthcare workers and patients. Via Mediaite:\n“Instead, he made self-serving deals. He would s…",
    "link": "https://crooksandliars.com/2025/03/pritzker-trump-coerced-me-praising-him",
    "timestamp": "2025-03-20T10:55:26Z"
  },
  {
    "title": "Junior: 'This Presidency Can Be Put To A Halt With This Vote'",
    "description": "For the past 16 months, Brad Schimel has been running for the Wisconsin Supreme Court, saying how he would bring \"impartiality\" back to the court. \nFor the past 16 months, Schimel has also been gleefully accepting millions of dollars from President Elmo, who …",
    "link": "https://crooksandliars.com/2025/03/junior-presidency-can-be-put-halt-vote",
    "timestamp": "2025-03-20T10:54:30Z"
  },
  {
    "title": "EU weighs Trump tariff response, fears being flooded with cheap steel: Live updates",
    "description": "The administration has already announced tariffs on steel and aluminium, and Trump has threatened 200% tariffs on EU wine and spirits.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/20/trump-tariffs-federal-layoffs-updates/82545448007/",
    "timestamp": "2025-03-20T10:54:28Z"
  },
  {
    "title": "In one call, more than 400 Fish & Wildlife workers lost their jobs. What they heard.",
    "description": "A recording from the Fish & Wildlife conference call provides an extraordinary glimpse into how one agency is handling mass cuts.",
    "link": "https://www.usatoday.com/story/news/nation/2025/03/20/fish-wildfire-workers-fired/82562139007/",
    "timestamp": "2025-03-20T10:50:53Z"
  },
  {
    "title": "Next US-Russia talks to take place Sunday or early next week: Kremlin",
    "description": "MOSCOW: The Kremlin said on Thursday (Mar 20) that the next US-Russia talks could take place on Sunday or early next week, as Washington is also due to hold talks with Kyiv in Saudi Arabia in the coming days. US President Donald Trump spoke to both",
    "link": "https://www.channelnewsasia.com/world/next-us-russia-talks-take-place-sunday-or-early-next-week-kremlin-5013226",
    "timestamp": "2025-03-20T10:50:49Z"
  },
  {
    "title": "John Roberts and Elon Musk are both wrong about impeaching judges",
    "description": "Donald Trump called for Judge James Boasberg to be impeached, a call John Roberts rejected and Elon Musk embraced to Speaker Mike Johnson's chagrin.",
    "link": "https://biztoc.com/x/4c191c0043c0a7ec",
    "timestamp": "2025-03-20T10:49:44Z"
  },
  {
    "title": "A guide to Karoline Leavitt's White House style, from designer shoes to 'Republican hair'",
    "description": "Karoline Leavitt's White House fashion has included classic blazers and bouclé sets.\nChip Somodevilla/Getty Images\nKaroline Leavitt, 27, is the current White House press secretary under Donald Trump.\nHer signature style on the job has included lots of blazers…",
    "link": "https://biztoc.com/x/7bb6fb8e669205dc",
    "timestamp": "2025-03-20T10:49:43Z"
  },
  {
    "title": "4 Takeaways From Trump-Zelensky Call: Russia-Ukraine War Update March 20",
    "description": "U.S. President Donald Trump spoke with his Ukrainian counterpart after a call with Russian President Vladimir Putin a day earlier.",
    "link": "https://biztoc.com/x/449f6ca5a3e3f1e8",
    "timestamp": "2025-03-20T10:49:23Z"
  },
  {
    "title": "A guide to Karoline Leavitt's White House style, from designer shoes to 'Republican hair'",
    "description": "Karoline Leavitt has quickly developed a signature White House style. It includes lots of blazers, one pair of designer shoes, and a famous purse.",
    "link": "https://www.businessinsider.com/karoline-leavitt-white-house-style",
    "timestamp": "2025-03-20T10:45:02Z"
  },
  {
    "title": "Moments sport acted as tool of diplomacy - as Trump and Putin discuss hockey match",
    "description": "There is still a war to end and yet Donald Trump and Vladimir Putin still found time to talk sport during their call on the fate of Ukraine.",
    "link": "https://news.sky.com/story/moments-sport-acted-as-tool-of-diplomacy-as-donald-trump-and-vladimir-putin-discuss-hockey-match-13332453",
    "timestamp": "2025-03-20T10:44:00Z"
  },
  {
    "title": "Reciprocal tariffs to have limited impact on India: Global rating agencies",
    "description": "Large domestic consumption likely to cushion impact of tit-for-tat Trump tariffs",
    "link": "https://www.businesstoday.in/latest/economy/story/reciprocal-tariffs-to-have-limited-impact-on-india-global-rating-agencies-468664-2025-03-20",
    "timestamp": "2025-03-20T10:43:52Z"
  },
  {
    "title": "Trump Administration Unfazed by Court Losses",
    "description": "CNN: “Even before President Donald Trump retook office, his advisers expected that his executive orders and other policy moves would face immediate legal challenges. It was expected that those challenges would be filed in districts",
    "link": "https://politicalwire.com/2025/03/20/trump-administration-unfazed-by-court-losses/",
    "timestamp": "2025-03-20T10:43:25Z"
  },
  {
    "title": "African Lessons Zelenskyy May Use In Ukraine",
    "description": "The live drama staged in the Oval Office on February 28 between US President Donald Trump and Ukrainian President Volodymyr Zelenskyy was such that Zelenskyy might never have rehearsed in all his former life as a comedian. Except that it wasn’t funny. It was …",
    "link": "https://thechronicle.com.gh/african-lessons-zelenskyy-may-use-in-ukraine/",
    "timestamp": "2025-03-20T10:40:24Z"
  },
  {
    "title": "4 Takeaways From Trump-Zelensky Call: Russia-Ukraine War Update March 20",
    "description": "U.S. President Donald Trump spoke with his Ukrainian counterpart after a call with Russian President Vladimir Putin a day earlier.",
    "link": "https://www.newsweek.com/four-takeaways-trump-zelensky-call-russia-ukraine-war-update-2047636",
    "timestamp": "2025-03-20T10:38:57Z"
  },
  {
    "title": "The real lesson of the JFK files",
    "description": "Conspiracy theories thrive in information vacuums, but that hasn’t stopped the government from withholding far too much information from the public. | Getty Images\nFor half a century, conspiracy theories about the assassination of John F. Kennedy have flouris…",
    "link": "https://biztoc.com/x/09115d6f5b30c2f5",
    "timestamp": "2025-03-20T10:38:35Z"
  },
  {
    "title": "Promise Made, Promise Kept: Trump to Sign Order Closing U.S. Education Department",
    "description": "U.S. President Donald Trump will sign an executive order Thursday that fulfills a key campaign promise of shutting down the Department of Education.\nThe post Promise Made, Promise Kept: Trump to Sign Order Closing U.S. Education Department appeared first on B…",
    "link": "https://www.breitbart.com/education/2025/03/20/promise-made-promise-kept-trump-to-sign-order-closing-u-s-education-department/",
    "timestamp": "2025-03-20T10:38:29Z"
  },
  {
    "title": "Trump to sign executive order calling for shutdown of US Education Department",
    "description": "Trump has derided the agency as wasteful and polluted by liberal ideology. However, finalizing its dismantling is likely impossible without an act of Congress, which created the department in 1979.",
    "link": "https://www.mlive.com/news/2025/03/trump-to-sign-executive-order-calling-for-shutdown-of-us-education-department.html",
    "timestamp": "2025-03-20T10:32:26Z"
  },
  {
    "title": "A shocking court ruling challenges Elon Musk's role in Trump administration. Is this the beginning of his end?",
    "description": "A federal judge ruled that Elon Musk's actions to shut down the USAID likely violated the Constitution by bypassing Senate confirmation. This decision could limit Musk's influence in the government, requiring approval from Senate-confirmed officials for his d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-usaid-judge-ruling-elon-musk-doge-a-shocking-court-ruling-challenges-elon-musks-role-in-trump-administration-is-this-the-beginning-of-his-end/articleshow/119253752.cms",
    "timestamp": "2025-03-20T10:31:23Z"
  },
  {
    "title": "Dr. Jerome Adams: America is getting a crash course in herd immunity",
    "description": "The former US surgeon general says Robert F. Kennedy Jr.’s tenure will not be defined by his work on nutrition or chronic disease but by how he responds to an inexorably increasing number of vaccine-preventable disease outbreaks.",
    "link": "https://www.cnn.com/2025/03/20/health/jerome-adams-measles-herd-immunity/index.html",
    "timestamp": "2025-03-20T10:30:52Z"
  },
  {
    "title": "Former US surgeon general: America is getting a crash course in herd immunity",
    "description": "The former US surgeon general says Robert F. Kennedy Jr.’s tenure will not be defined by his work on nutrition or chronic disease but by how he responds to...",
    "link": "https://www.cnn.com/2025/03/20/health/jerome-adams-measles-herd-immunity?cid=external-feeds_iluminar_yahoo",
    "timestamp": "2025-03-20T10:30:52Z"
  },
  {
    "title": "Vivian Jenna Wilson, Elon Musk's Estranged Daughter, Is Not Afraid of Her Dad",
    "description": "Vivian Wilson tells Teen Vogue that she isn’t scared of her estranged dad, Elon Musk, owner of X and a powerful figure in the Trump administration.",
    "link": "https://www.teenvogue.com/story/vivian-jenna-wilson-elon-musk-pathetic-man-child",
    "timestamp": "2025-03-20T10:30:00Z"
  },
  {
    "title": "EU antitrust regulators target Google and Apple in Big Tech crackdown",
    "description": "The EC has charged Google with two violations of EU regulations and directed Apple to facilitate competitor connectivity with its products.",
    "link": "https://www.techmonitor.ai/big-tech/eu-regulators-target-google-apple-big-tech-crackdown/",
    "timestamp": "2025-03-20T10:29:58Z"
  },
  {
    "title": "Relationships Expert Paul C. Brunson Joins Netflix Reality Show ‘Cheat’; Alan Sugar ‘Apprentice’ Contract Extended; Series Mania Secret Meeting; BBC Formula 1 Pod – Global Briefs",
    "description": "Relationships Expert Paul C. Brunson Joins Netflix Reality Show ‘Cheat’ Relationships expert Paul C. Brunson has boarded Netflix UK’s Cheat: Unfinished Business reality show with Amanda Holden. The series follows eight ex-couples whose relationships have been…",
    "link": "http://deadline.com/2025/03/paul-c-brunson-host-netflix-cheat-1236331737/",
    "timestamp": "2025-03-20T10:29:11Z"
  },
  {
    "title": "Hapag-Lloyd Posts 19% Lower Net Profit in 2024, to Cut Dividend",
    "description": "Container shipping liner Hapag-Lloyd HLAG.DE on Thursday reported an 18.9% lower net profit for 2024 and proposed a 11.4% cut in its divided versus 2023, citing lower interest income and higher tax expenses.",
    "link": "https://gcaptain.com/hapag-lloyd-posts-19-lower-net-profit-in-2024-to-cut-dividend/",
    "timestamp": "2025-03-20T10:26:09Z"
  },
  {
    "title": "Tesla Cars Smeared With Feces by Anti-Elon Musk Protesters",
    "description": "Two Tesla vehicles in different parts of the country were vandalized by passersby who appeared to wipe feces on them.",
    "link": "https://www.newsweek.com/tesla-elon-musk-feces-protest-damaged-car-2047657",
    "timestamp": "2025-03-20T10:21:53Z"
  },
  {
    "title": "Trump Demands Fed ‘Do the Right Thing’ and Slash Rates to ‘Ease’ Economy Into Tariff Regime",
    "description": "President Donald Trump demanded the Federal Reserve “do the right thing” and cut rates to help the economy “transition” with “ease” as his steep tariffs on Mexican and Canadian goods go into effect in April. Federal Reserve Chair Jerome Powell defended the ce…",
    "link": "https://www.mediaite.com/news/trump-demands-fed-do-the-right-thing-and-slash-rates-to-ease-economy-into-tariff-regime/",
    "timestamp": "2025-03-20T10:21:02Z"
  },
  {
    "title": "BlackRock Campaigns Soothe Tensions in Texas and Win Over GOP",
    "description": "The Wall Street behemoth is dialing back on ESG to placate its Republican critics.",
    "link": "https://financialpost.com/pmn/business-pmn/blackrock-campaigns-soothe-tensions-in-texas-and-win-over-gop",
    "timestamp": "2025-03-20T10:20:21Z"
  },
  {
    "title": "Trump's 200% tariff threat would be 'a real disaster' for Europe's wine and spirit industry",
    "description": "European wine producers face significant financial challenges after U.S. President Donald Trump's threat to impose a 200% tariff on European wine, Champagne, and spirits. This threat follows the EU's planned 50% tax on American whiskey, creating substantial c…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-200-tariff-threat-would-be-a-real-disaster-for-europes-wine-and-spirit-industry/articleshow/119253677.cms",
    "timestamp": "2025-03-20T10:19:31Z"
  },
  {
    "title": "Inflows, culling of shorts lift rupee to longest winning streak in over one year",
    "description": "The Indian rupee rose for the seventh straight session on Thursday, its longest winning streak since January 2024, as persistent dollar sales by foreign banks and paring of short bets on the currency helped it weather a stronger dollar.",
    "link": "https://economictimes.indiatimes.com/markets/forex/inflows-culling-of-shorts-lift-rupee-to-longest-winning-streak-in-over-one-year/articleshow/119253622.cms",
    "timestamp": "2025-03-20T10:17:22Z"
  },
  {
    "title": "Mercedes-Benz CEO pushes for zero tariffs as Trump embarks on EU auto trade war",
    "description": "German automaker Mercedes-Benz has called for both Europe and the United States to abolish tariffs on car imports, as US President Donald Trump threatens to hike duties on EU goods.\nOla Kallenius, head of the German premium carmaker, said in an interview publ…",
    "link": "https://biztoc.com/x/285f4c52a31b5d17",
    "timestamp": "2025-03-20T10:16:29Z"
  },
  {
    "title": "Donald Trump Hints At Barron Trump's Future Career -- And It May Surprise You",
    "description": "The president discussed his youngest son's aptitude in a Fox News interview with Laura Ingraham.",
    "link": "https://www.huffpost.com/entry/donald-trump-barron-trump-technology-laura-ingraham_n_67dbd67ee4b08c67f8f5d758",
    "timestamp": "2025-03-20T10:16:10Z"
  },
  {
    "title": "CK Hutchison Flags Political Risk as Port Deal Upsets China",
    "description": "CK Hutchison Holdings Ltd. warned of a deteriorating global business environment due to geopolitical and trade tensions, as the Hong Kong conglomerate reported weaker-than-expected profit while a ports sale plan faces uncertainty after infuriating Beijing.",
    "link": "https://financialpost.com/pmn/business-pmn/ck-hutchison-flags-political-risk-as-port-deal-upsets-china",
    "timestamp": "2025-03-20T10:15:14Z"
  },
  {
    "title": "Race to become Olympics supremo on a knife edge",
    "description": "<p>COSTA NAVARINO (GREECE) - The race to succeed Thomas Bach as president of the International Olympic Committee reaches a climax on Thursday with Juan Antonio Samaranch Junior, Sebastian Coe and Kirsty Coventry believed to be neck and neck but clear of the r…",
    "link": "https://www.bangkokpost.com/sports/2984155/race-to-become-olympics-supremo-on-a-knife-edge",
    "timestamp": "2025-03-20T10:15:00Z"
  },
  {
    "title": "LA 2028 Games organisers move to ease IOC concerns over visas",
    "description": "PYLOS, Greece : Organisers of the Los Angeles 2028 Olympics on Thursday moved to ease concerns among International Olympic Committee members over visas and entry requirements for athletes and officials for those Games.Since taking office on January 20, U.S. P…",
    "link": "https://www.channelnewsasia.com/sport/la-2028-games-organisers-move-ease-ioc-concerns-over-visas-5013171",
    "timestamp": "2025-03-20T10:13:19Z"
  }
]