[
  {
    "title": "In the BBC, Trump Faces an Opponent Beyond the White House’s Grasp | Analysis",
    "description": "Unlike Disney and Paramount, the British broadcaster doesn’t contend with government regulatory pressures, and this latest media clash will test the president’s ability to cow news organizations overseas\nThe post In the BBC, Trump Faces an Opponent Beyond the…",
    "link": "https://www.thewrap.com/donald-trump-bbc-legal-analysis/",
    "timestamp": "2025-11-14T14:15:00Z"
  },
  {
    "title": "Indonesia readies Gaza stabilisation force, hosts Jordan’s king for talks",
    "description": "The Indonesian Defence Ministry says troops are likely to focus on health and reconstruction if sent to the enclave.",
    "link": "https://www.aljazeera.com/news/2025/11/14/indonesia-readies-gaza-stabilisation-force-hosts-jordans-king-for-talks",
    "timestamp": "2025-11-14T14:13:23Z"
  },
  {
    "title": "Eric Trump Praises Bitcoin — But ABTC Faces Brutal Drop To $3.50",
    "description": "American Bitcoin Corp. (NASDAQ:ABTC) slipped to $4.74 on Thursday even as Eric Trump and Donald Trump Jr. boosted the company's Bitcoin (CRYPTO: BTC) holdings, widening the gap between rising treasury conviction and weakening price momentum.\nTrump Brothers Ex…",
    "link": "https://biztoc.com/x/cd61fc3134a2f2a7",
    "timestamp": "2025-11-14T14:07:42Z"
  },
  {
    "title": "In the trade negotiations, our politicians should learn how the business world plays follow the leader",
    "description": "Eileen Dooley is a talent and leadership development specialist, and a leadership coach, based in Calgary\nOne day in late October, Canadians woke to damaging news that the U.S. had broken off trade negotiations with our country. Turns out U.S. President Donal…",
    "link": "https://biztoc.com/x/910b51e76d542fa1",
    "timestamp": "2025-11-14T14:07:34Z"
  },
  {
    "title": "Why Trump’s Meeting With Saudi Crown Prince Could Redefine Middle East Security",
    "description": "Saudi Crown Prince Mohammed bin Salman is set to meet President Donald Trump in Washington next week in a visit that could reshape Middle East security for decades. \nWhile major investment deals and high-profile optics are expected, officials say the real foc…",
    "link": "https://biztoc.com/x/8ff2cd5c0372064e",
    "timestamp": "2025-11-14T14:07:34Z"
  },
  {
    "title": "A 'dirty neck,' 'evil witch': Why a furious China is unleashing on Japan's new leader",
    "description": "China and Japan are locked in a furious diplomatic spat over Prime Minister Sanae Takaich said an attack on Taiwan could draw a military response from Tokyo.",
    "link": "https://www.nbcnews.com/world/asia/china-japan-feud-takaichi-taiwan-attack-ambassador-summoned-rcna243877",
    "timestamp": "2025-11-14T14:07:31Z"
  },
  {
    "title": "Iran Block on Nuclear Monitoring Deepens Post-Strike Standoff",
    "description": "Iran is ignoring international calls to cooperate with the United Nations atomic watchdog and restart nuclear talks with the US, diplomats said, months into a tense stand off following Israeli-led airstrikes on the Islamic Republic.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-block-on-nuclear-monitoring-deepens-post-strike-standoff",
    "timestamp": "2025-11-14T14:06:31Z"
  },
  {
    "title": "Quit “sane-washing” Donald Trump",
    "description": "Trump's speeches and apparent naps are reaching a critical point",
    "link": "https://www.salon.com/2025/11/14/quit-sane-washing-donald-trump/",
    "timestamp": "2025-11-14T14:05:58Z"
  },
  {
    "title": "Weekly Coffee News: Support Through Coffee in D.C. + Popular Oakland Flagship Closing",
    "description": "Roast Magazine’s Daily Coffee News is proud to maintain advertising partnerships with many of the world’s leading coffee companies, yet maintains a focus on fair and objective editorial content, with no sponsored content or native advertising.",
    "link": "https://dailycoffeenews.com/2025/11/14/weekly-coffee-news-support-through-coffee-in-d-c-popular-oakland-flagship-closing/",
    "timestamp": "2025-11-14T14:05:47Z"
  },
  {
    "title": "GOP senators distance themselves from provision allowing them to sue over phone record searches",
    "description": "Most of the senators whose data was requested as part of the investigation that led to special counsel Jack Smith’s Jan. 6 probe have now distanced themselves from a provision included in the shutdown-ending bill, signed into law by President Donald Trump, th…",
    "link": "https://www.nbcnews.com/politics/congress/gop-senators-distance-provision-allowing-sue-phone-record-searches-rcna243902",
    "timestamp": "2025-11-14T14:04:23Z"
  },
  {
    "title": "\"Our Democracy\" (I'm Sure)",
    "description": "\"How do empires fall? Not by war, but by unbalanced minds disconnected from reality.\" — The Vigilant Fox on “X\"",
    "link": "https://www.kunstler.com/p/our-democracy-im-sure",
    "timestamp": "2025-11-14T14:02:31Z"
  },
  {
    "title": "Google pitches EU on adtech fixes to dodge breakup after €2.95B slap",
    "description": "Brussels reviewing proposal as Mountain View insists it will appeal antitrust ruling\nGoogle has proposed a plan to the European Commission aimed at addressing antitrust concerns following a €2.95 billion fine imposed on the company for its online advertising …",
    "link": "https://www.theregister.com/2025/11/14/google_antitrust_eu_remedy/",
    "timestamp": "2025-11-14T14:02:15Z"
  },
  {
    "title": "ESPN star in the hot seat as Senate campaign rumors swirl: 'Trump-hating RINO'",
    "description": "Football broadcasting “legend\" Paul Finebaum is taking heat for allegedly being a “Trump-hating\" weak Republican amid widespread rumors that he is planning a run for the Senate.",
    "link": "https://www.foxnews.com/politics/espn-star-hot-seat-as-senate-campaign-rumors-swirl-trump-hating-rino",
    "timestamp": "2025-11-14T14:00:39Z"
  },
  {
    "title": "San Diegans weigh in on life in an autocracy",
    "description": "As the United States increasingly leans toward authoritarianism, two local residents recount their time living under dictatorships.",
    "link": "https://www.kpbs.org/news/politics/2025/11/14/san-diegans-weigh-in-on-life-in-an-autocracy",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "When Political Rhetoric Becomes a Weapon",
    "description": "In a recent interview, former House Speaker Nancy Pelosi declared in unequivocal terms that President Donald Trump was “the worst thing on the face of... Read More\nThe post When Political Rhetoric Becomes a Weapon appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/14/political-rhetoric-becomes-weapon/",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "These Are the Best 'It's Always Sunny in Philadelphia' Jokes For Trump's Epstein Controversy",
    "description": "Frank's song always comes up when Trump and Epstein are in the headlines",
    "link": "https://www.cracked.com/article_49143_these-are-the-best-its-always-sunny-in-philadelphia-jokes-for-trumps-epstein-controversy.html",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "Don't buy claim that Trump proposed 15-year car loan",
    "description": "A graphic claiming the U.S. president had proposed a 15-year car loan stemmed from an X account known to post satirical content.",
    "link": "https://www.snopes.com//fact-check/trump-15-year-car-loan/",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "Shutdown Over, But Staff at Ed Department Still Threatened",
    "description": "With the government shutdown over, staff at the U.S. Department of Education return with fear for what lies ahead. Before the election, I assumed that Trump could not shutter the Department because he would never get Congress’s approval. Some Republicans woul…",
    "link": "https://dianeravitch.net/2025/11/14/shutdown-over-but-staff-at-ed-department-still-threatened/",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "Trump Is Turning the Screws on Vets So the Rich Can Get Richer",
    "description": "Donald Trump and his administration are making cuts to the Department of Veterans Affairs and benefits for veterans under false claims of fraud.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-cuts-veteran-employees-benefits-false-claims-fraud-1235464517/",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "The multisystemic roots of South African child and youth resilience: A scoping review",
    "description": "Introduction and objective A multisystemic approach to researching resilience investigates resources across multiple systems, including biological, psychological, social, institutional, structural, environmental, and cultural systems, with special interest in…",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0336716",
    "timestamp": "2025-11-14T14:00:00Z"
  },
  {
    "title": "The Trump administration plans major shift away from long-term housing for homelessness",
    "description": "The overhaul shifts funds to transitional housing requiring work and addiction treatment. The administration says it promotes \"self-sufficiency,\" but critics warn many will risk losing housing again.",
    "link": "https://www.npr.org/2025/11/14/nx-s1-5553561/homelessness-housing-funding-trump-administration-hud",
    "timestamp": "2025-11-14T13:59:32Z"
  },
  {
    "title": "Despite ‘Nazi streak’ controversy, Ingrassia lands a new gig in the Trump administration",
    "description": "Paul Ingrassia's history of radicalism made him politically radioactive. The president rewarded him with a promotion anyway.",
    "link": "https://www.ms.now/rachel-maddow-show/maddowblog/nazi-streak-controversy-ingrassia-lands-news-gig-trump-administration-rcna243894",
    "timestamp": "2025-11-14T13:59:05Z"
  },
  {
    "title": "Epstein files: Trump taunted from beyond the grave",
    "description": "Republicans who have contorted themselves into whatever shape requested by the president are beginning to think about the post-Trump era",
    "link": "https://www.irishtimes.com/world/us/2025/11/14/epstein-files-trump-taunted-from-beyond-the-grave/",
    "timestamp": "2025-11-14T13:59:04Z"
  },
  {
    "title": "Lawrence O’Donnell Slams ‘Absurd’ Sean Hannity Interview With JD Vance",
    "description": "MSNBC star was appalled by what he saw on Fox News.",
    "link": "https://www.tvinsider.com/1228088/msnbc-lawrence-odonnell-sean-hannity-interview-jd-vance-fox-news/",
    "timestamp": "2025-11-14T13:58:37Z"
  },
  {
    "title": "Despite ‘Nazi streak’ controversy, Ingrassia lands a new gig in the Trump administration",
    "description": "Paul Ingrassia's history of radicalism made him politically radioactive. Donald Trump rewarded him with a promotion anyway.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/nazi-streak-controversy-ingrassia-lands-news-gig-trump-administration-rcna243894",
    "timestamp": "2025-11-14T13:58:34Z"
  },
  {
    "title": "'No More Endless Wars,' Maduro Says to American People, Calling for 'Peace' in Face of Trump Threats",
    "description": "Just as Secretary of Defense Pete Hegseth announced new branding for the US military campaign in Latin America, now known as \"Operation Souther Spear,\" the president of Venezuela, Nicolas Maduro, on Thursday offered a message of peace directly to the people o…",
    "link": "https://www.commondreams.org/news/no-more-endless-wars-maduro-says-to-american-people-calling-for-peace-in-face-of-trump-threats",
    "timestamp": "2025-11-14T13:57:57Z"
  },
  {
    "title": "Saudi crown prince’s US visit could reshape MidEast security",
    "description": "When Saudi Arabia’s Crown Prince Mohammed bin Salman meets with US President Donald Trump in Washington next week, expect big investments and fanfare.\nBut beneath the pomp, what’s really at stake is Riyadh’s role in the new regional security architecture taki…",
    "link": "https://biztoc.com/x/aa3b949e76100f7d",
    "timestamp": "2025-11-14T13:57:16Z"
  },
  {
    "title": "Should Todd Blanche Take Away Ghislaine Maxwell’s Puppy Privileges?",
    "description": "You know, now that we have all this TOTALLY NEW information?",
    "link": "https://www.wonkette.com/p/should-todd-blanche-take-away-ghislaine",
    "timestamp": "2025-11-14T13:55:51Z"
  },
  {
    "title": "Earnings live: Applied Materials stock falls, Trump brothers' American Bitcoin revenue doubles",
    "description": "The third quarter earnings season has been mostly positive, with most of the reports in the rearview mirror.",
    "link": "https://finance.yahoo.com/news/live/earnings-live-applied-materials-stock-falls-trump-brothers-american-bitcoin-revenue-doubles-135356821.html",
    "timestamp": "2025-11-14T13:53:56Z"
  },
  {
    "title": "BBC Doctored Second Trump Speech",
    "description": "The British Broadcasting Corporation is facing a fresh allegation that it spliced together President Donald Trump's Jan. 6, 2021, speech to make it appear he issued a more explicit call for violence ahead of the unrest at the Capitol that day. The state-owned…",
    "link": "https://freerepublic.com/focus/f-bloggers/4352472/posts",
    "timestamp": "2025-11-14T13:48:43Z"
  },
  {
    "title": "BBC Doctored Second Trump Speech",
    "description": "The British Broadcasting Corporation is facing a fresh allegation that it spliced together President Donald Trump's Jan. 6, 2021, speech to make it appear he issued a more explicit call for violence ahead of the unrest at the Capitol that day. The state-owned…",
    "link": "https://freerepublic.com/focus/f-news/4352472/posts",
    "timestamp": "2025-11-14T13:48:43Z"
  },
  {
    "title": "New York Times: All The Epstein Connections Fit To Bury",
    "description": "Wednesday’s release of Jeffrey Epstein’s private emails not only uncovered further details of President Donald Trump’s connection to the accused leader of a sex-trafficking network, but they have also exposed the role of a New York Times reporter in the scand…",
    "link": "https://crooksandliars.com/2025/11/new-york-times-all-epstein-connections-0",
    "timestamp": "2025-11-14T13:48:20Z"
  },
  {
    "title": "Years After Conviction, Epstein Bragged About 2016 Trump Tower Visit",
    "description": "Emails released by the House Oversight Committee on Jeffrey Epstein offered a lot of insight into just how many people were involved with the notorious child sex trafficker, and how many were complicit in looking the other way (looking at you, New York Times!…",
    "link": "https://crooksandliars.com/2025/11/years-after-conviction-epstein-bragged",
    "timestamp": "2025-11-14T13:48:04Z"
  },
  {
    "title": "SNAP benefits have been cut and disrupted – causing more kids to go without enough healthy food and harming child development",
    "description": "Having stable access to nutritious food sets children up for better mental and physical health into adulthood.",
    "link": "https://theconversation.com/snap-benefits-have-been-cut-and-disrupted-causing-more-kids-to-go-without-enough-healthy-food-and-harming-child-development-269362",
    "timestamp": "2025-11-14T13:41:58Z"
  },
  {
    "title": "Making progress is more than making policy – what Mamdani can learn from de Blasio about the politics of urban progress",
    "description": "The mayor-elect can use his popularity to protect New York’s capacity for self-government from outside interference, while reaffirming what his campaign promises mean to the city.",
    "link": "https://theconversation.com/making-progress-is-more-than-making-policy-what-mamdani-can-learn-from-de-blasio-about-the-politics-of-urban-progress-269062",
    "timestamp": "2025-11-14T13:39:32Z"
  },
  {
    "title": "Foreclosures Are Surging Under Donald Trump",
    "description": "Foreclosure activity in the U.S. is on the rise in 2025, a notable shift that begins to undo a decade of relative stability.\nAccording to the property‑data and analytics firm ATTOM, 36,766 properties had a foreclosure filing in October, marking a three percen…",
    "link": "https://biztoc.com/x/084826bb6729be85",
    "timestamp": "2025-11-14T13:34:33Z"
  },
  {
    "title": "BBC Admits Editing Error As Trump Threatens Massive Lawsuit",
    "description": "The BBC apologized to President Donald Trump on Thursday after admitting it improperly edited a key portion of his January 6, 2021, speech in a documentary, according to CNN. \nTrump had threatened a $1 billion lawsuit, calling the edit defamatory and harmful.…",
    "link": "https://biztoc.com/x/f20a8ab7240ad10f",
    "timestamp": "2025-11-14T13:34:32Z"
  },
  {
    "title": "Chris Matthews Warns Trump He Can’t Control ‘Frankenstein’ MAGA’s Focus on Epstein: ‘Like Nixon With the Tapes!’",
    "description": "Matthews slammed Trump's refusal to address his mention in the Epstein emails as \"condescending\" to the base he cultivated around the issue.\nThe post Chris Matthews Warns Trump He Can’t Control ‘Frankenstein’ MAGA’s Focus on Epstein: ‘Like Nixon With the Tape…",
    "link": "https://www.mediaite.com/media/tv/chris-matthews-warns-trump-he-cant-control-frankenstein-maga-fringes-focus-on-epstein-like-nixon-with-the-tapes/",
    "timestamp": "2025-11-14T13:34:26Z"
  },
  {
    "title": "Kiev eyeing ‘good use’ for Ukrainians deported by Trump – WaPo",
    "description": "An aide to Vladimir Zelensky says Kiev welcomes deportations of Ukrainian citizens by Trump’s administration Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627796-ukraine-deportations-trump-conscription/",
    "timestamp": "2025-11-14T13:33:53Z"
  },
  {
    "title": "Trump Family-Linked American Bitcoin Posts Q3 Profit, Doubles Revenue",
    "description": "The shares slumped more than 13% in pre-market trading as the price of bitcoin tumbled.",
    "link": "https://www.coindesk.com/business/2025/11/14/trump-family-linked-american-bitcoin-posts-q3-profit",
    "timestamp": "2025-11-14T13:31:16Z"
  },
  {
    "title": "Trump's Granddaughter Makes Her LPGA Debut",
    "description": "The youngest golfer who teed off Thursday at the LPGA's Annika tournament may have had the most pressure—and eyes—on her. That would be Kai Trump, the 18-year-old granddaughter of President Trump and the daughter of Donald Trump Jr. The teen amateur and Unive…",
    "link": "https://www.newser.com/story/378700/trumps-granddaughter-makes-her-lpga-debut.html",
    "timestamp": "2025-11-14T13:31:00Z"
  },
  {
    "title": "France Says It Will Help Draft The Constitution For A Palestinian State As Israel And Iran Move Toward War",
    "description": "There have been stunning new developments in the Middle East.  France and the Palestinian Authority have agreed to establish a joint committee to draft a constitution for a Palestinian state.  Needless to say, this will give French President Emmanuel Macron a…",
    "link": "https://www.shtfplan.com/headline-news/france-says-it-will-help-draft-the-constitution-for-a-palestinian-state-as-israel-and-iran-move-toward-war",
    "timestamp": "2025-11-14T13:30:44Z"
  },
  {
    "title": "Vance trolls Biden over waiting ‘to croak’ (VIDEO)",
    "description": "US Vice President J.D. Vance joked with Fox News about the stress of being in line to succeed an ailing president Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627797-vance-biden-croack-hannity/",
    "timestamp": "2025-11-14T13:30:24Z"
  },
  {
    "title": "The Latest: Newly released Epstein emails reveal ties to influential figures even after conviction",
    "description": "Thousands of documents released by the House Oversight Committee offer a new glimpse into what Jeffery Epstein’s relationships with business executives...",
    "link": "https://www.yahoo.com/news/articles/latest-newly-released-epstein-emails-132744494.html",
    "timestamp": "2025-11-14T13:27:44Z"
  },
  {
    "title": "5 stories you must read today, November 14: From Centre notifying data protection rules to Red Fort bomber’s home razed and more",
    "description": "Read about the data protection rules, Uber rolling out recording feature for drivers in India and more here.",
    "link": "https://indianexpress.com/article/india/5-stories-you-must-read-today-november-14-from-centre-notifying-data-protection-rules-to-red-fort-bombers-home-razed-and-more-10365869/",
    "timestamp": "2025-11-14T13:26:53Z"
  },
  {
    "title": "Different needs but similar fears arise in communities on both ends of Missouri's redistricting",
    "description": "The rush to redraw America's congressional maps has put a historically Black neighborhood in downtown Kansas City, Missouri, and a mostly white farming community 100 miles away in the same district",
    "link": "https://abcnews.go.com/Politics/wireStory/similar-fears-arise-communities-ends-missouris-redistricting-127520928",
    "timestamp": "2025-11-14T13:25:34Z"
  },
  {
    "title": "Epstein Files: Thomas Massie Reveals Donald Trump, Allies' Private Comments",
    "description": "Republican U.S. Representative Thomas Massie said President Donald Trump and his top administration officials are saying privately that they are opposed to releasing the Jeffrey Epstein investigation files to spare the president's friends from embarrassment.\n…",
    "link": "https://biztoc.com/x/fdf198acc60b6303",
    "timestamp": "2025-11-14T13:23:14Z"
  },
  {
    "title": "Online ‘transvestigators’ are claiming that Charlie Kirk and his wife were actually a trans couple",
    "description": "People are “transvestigating” Charlie Kirk and his recent widow Erika, with online posts circulating that claim both members of the former couple were, and are, trans. The term transvestigating – a mash-up of trans and investigating – refers to conspiracy the…",
    "link": "https://www.thepinknews.com/2025/11/14/charlie-kirk-erika-trans/",
    "timestamp": "2025-11-14T13:21:12Z"
  },
  {
    "title": "Walmart CEO Doug McMillon announces his surprise retirement at age 59",
    "description": "Walmart CEO Doug McMillon, who turned America's largest retailer into a tech-powered giant and spearheaded a period of robust sales growth since becoming...",
    "link": "https://finance.yahoo.com/news/walmart-ceo-doug-mcmillon-retire-132057976.html",
    "timestamp": "2025-11-14T13:20:57Z"
  },
  {
    "title": "Florida carries out record 16th execution of the year, for child murderer sentenced to death in 1980",
    "description": "A man convicted of the 1979 killing of a six-year-old girl who was abducted from her bedroom has been put to death in a record 16th execution in Florida this year.",
    "link": "https://www.cbc.ca/news/world/fla-execution-jennings-state-record-9.6978728",
    "timestamp": "2025-11-14T13:17:55Z"
  },
  {
    "title": "What to know about the BBC's latest crisis after its apology to Trump",
    "description": "The BBC has apologized to U.S. President Donald Trump over a misleading edit of his speech on Jan. 6, 2021, but said it strongly disagreed that there was a basis for a defamation lawsuit",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bbcs-latest-crisis-after-apology-trump-127519428",
    "timestamp": "2025-11-14T13:17:42Z"
  },
  {
    "title": "‘Southern Charm’ Star Patricia Altschul Fires Back At “Irrelevant” Todd Chrisley: “We Just Don’t Need Any More Felons In Charleston”",
    "description": "Altschul had the last word.",
    "link": "https://decider.com/2025/11/14/southern-charm-patricia-altschul-todd-chrisley-irrelavant/",
    "timestamp": "2025-11-14T13:15:00Z"
  },
  {
    "title": "Donald Trump's 'grand conspiracy' theory begins to take shape — and it might work",
    "description": "In recent weeks, Donald Trump’s supporters have begun to align around the idea that a Democrat-led “grand conspiracy” – potentially involving former president Barack Obama – has been plotting against the US president since 2016. The narrative is that the 2016…",
    "link": "https://www.rawstory.com/donald-trump-s-grand-conspiracy-theory-begins-to-take-shape-and-it-might-work/",
    "timestamp": "2025-11-14T13:14:20Z"
  },
  {
    "title": "Why Another Government Shutdown Could Be Lurking",
    "description": "“The longest government shutdown ever may finally be over, but the Democratic Party is just beginning to reckon with angry voters who are sick and tired of seeing them lose to President Donald Trump,” the HuffPost reports. “The anger is clearly reminiscent of…",
    "link": "https://politicalwire.com/2025/11/14/why-another-government-shutdown-could-be-lurking/",
    "timestamp": "2025-11-14T13:10:19Z"
  },
  {
    "title": "Trump’s viral golfer granddaughter Kai has rough pro debut — fans say, total nightmare start",
    "description": "Kai Trump, the viral teenage golfer and granddaughter of Donald Trump, made her first big LPGA appearance and faced a very tough start. Fans called it a “nightmare” as she tried to handle nerves on the course. Even with the rough day, Kai stayed positive and …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-viral-golfer-granddaughter-kai-has-rough-pro-debut-fans-say-total-nightmare-start/articleshow/125327998.cms",
    "timestamp": "2025-11-14T13:08:00Z"
  },
  {
    "title": "Union demands Sir Robbie Gibb's removal from BBC board",
    "description": "The Broadcasting, Entertainment, Communications and Theatre Union said it was concerned about the BBC's ability to resist political pressure.",
    "link": "https://news.sky.com/story/union-demands-sir-robbie-gibbs-removal-from-bbc-board-to-defend-political-impartiality-13470229",
    "timestamp": "2025-11-14T13:05:00Z"
  },
  {
    "title": "Giving Foster Children Better Support: Donald Trump Signs New Executive Order To Provide Pathway After Exiting the System",
    "description": "United States President Donald Trump signed a new executive order that aims to support foster care children after transitioning out of the system.",
    "link": "https://www.ibtimes.com/giving-foster-children-better-support-donald-trump-signs-new-executive-order-provide-pathway-3790372",
    "timestamp": "2025-11-14T13:03:56Z"
  },
  {
    "title": "Lindsey Graham vows to cash in on GOP's 'million-dollar jackpot'",
    "description": "While critics fumed at the prospect of Republican US senators suing to collect $1 million or more each in taxpayer money as part of a bizarre provision slipped into the government funding bill, one senior GOP lawmaker said Wednesday that he’s all in on the pr…",
    "link": "https://www.rawstory.com/lindsey-graham-vows-to-cash-in-on-gop-s-million-dollar-jackpot/",
    "timestamp": "2025-11-14T13:03:45Z"
  },
  {
    "title": "Donald Trump and Jeffrey Epstein's Friendship Resurface as 'Paedophile' Old Photos Spark New Outrage",
    "description": "Old photos of Donald Trump and Jeffrey Epstein resurface, triggering outrage and scrutiny as new reporting reveals what is fact and what remains unproven.",
    "link": "https://www.ibtimes.com/donald-trump-jeffrey-epsteins-friendship-resurface-paedophile-old-photos-spark-new-outrage-3790369",
    "timestamp": "2025-11-14T13:02:33Z"
  },
  {
    "title": "Mike’s Blog Round-Up",
    "description": "On this day in 1964 an MST3K classic and one of the perennial favorites of rowdy, 2:00 AM screenings at science fiction conventions across the land hit US theaters with a mighty thud. It was the theatrical release of Santa Claus Conquers The Martians. Directe…",
    "link": "https://crooksandliars.com/2025/11/mike-s-blog-round-4",
    "timestamp": "2025-11-14T13:02:01Z"
  },
  {
    "title": "Trump Administration Eyes Tariff Reductions and Market Access With Latin American Partners",
    "description": "Trump administration announces trade frameworks with Argentina, Ecuador, El Salvador, and Guatemala to reduce tariffs and boost US exports.",
    "link": "https://www.ibtimes.com/trump-administration-eyes-tariff-reductions-market-access-latin-american-partners-3790362",
    "timestamp": "2025-11-14T13:01:32Z"
  },
  {
    "title": "Epstein Email About Giving Girlfriend To Trump Enrages Model ‘Groped’ By Him",
    "description": "The former Sports Illustrated model said Epstein, whom she dated in the early 1990s, “delivered” her to Trump.",
    "link": "https://www.huffpost.com/entry/stacey-williams-jeffrey-epstein-donald-trump-groped_n_6916fd4de4b0191be9d4ab31",
    "timestamp": "2025-11-14T13:01:28Z"
  },
  {
    "title": "US government threatens to ‘invalidate’ trans people’s passports under new policy",
    "description": "The US State Department has updated its FAQ page with a section that refers to them having the ability to ‘invalidate’ trans people’s passports, after the Supreme Court allowed it to enact a ban on changing gender markers. Supreme Court justices granted an em…",
    "link": "https://www.thepinknews.com/2025/11/14/us-government-threatens-to-invalidate-trans-peoples-passports/",
    "timestamp": "2025-11-14T13:00:42Z"
  },
  {
    "title": "Posthaste: CIBC economist says lenders stepping in to stem rising insolvencies with economy in ‘semi-recession’",
    "description": "CIBC's Benjamin Tal says the number of Canadians renegotiating loans is rising 'dramatically' which is better for the economy. Read on.",
    "link": "https://financialpost.com/news/cibc-lenders-stem-insolvencies-economy-semi-recession",
    "timestamp": "2025-11-14T13:00:24Z"
  },
  {
    "title": "Newsom's sanctuary policies under fire after drunk illegal immigrant kills elderly man",
    "description": "After an elderly man was killed in a hit-and-run involving an illegal alien, the Department of Homeland Security asked, \"How many Americans must be killed\" before Gov. Newsom cooperates.",
    "link": "https://www.foxnews.com/politics/newsoms-sanctuary-policies-under-scrutiny-after-drunk-illegal-kills-elderly-man",
    "timestamp": "2025-11-14T13:00:01Z"
  },
  {
    "title": "Scott Wiener Defeated California’s NIMBYs. Can He Fix America’s Housing Crisis?",
    "description": "For a moment, it looks like California—maybe the whole country!—is doomed. Usually, the last days of a legislative session in Sacramento are a blurry schlep through hundreds of votes as both sides of the Capitol try to get bills onto the governor’s desk. Toda…",
    "link": "https://www.motherjones.com/politics/2025/11/scott-wiener-defeated-californias-nimbys-can-he-fix-americas-housing-crisis/",
    "timestamp": "2025-11-14T13:00:00Z"
  },
  {
    "title": "International Insider: BBC In Crisis; Disney Goes To APAC; American Film Market Gets Going",
    "description": "Good afternoon Insiders, Max Goldbart coming to you after a week in which the British public broadcaster fell into crisis… once again. Read on. And sign up here. BBC In Crisis One Scandal Too Many: BBC crises bedeck these very newsletters with alarming regula…",
    "link": "http://deadline.com/2025/11/international-insider-bbc-donald-trump-in-crisis-1236616250/",
    "timestamp": "2025-11-14T13:00:00Z"
  },
  {
    "title": "All the Weird Things The Running Man Predicted About 2025",
    "description": "Even Stephen King is aghast at what he guessed correctly when he penned the dystopian novel in the early 1970s.",
    "link": "https://www.esquire.com/entertainment/movies/a69412139/best-the-running-man-stephen-king-predictions-2025/",
    "timestamp": "2025-11-14T13:00:00Z"
  },
  {
    "title": "Bolivia’s Turn From Socialist Rule",
    "description": "Socialism may be on the rise in New York with the election of Zohran Mamdani, but the story is different elsewhere. People may be familiar with... Read More\nThe post Bolivia’s Turn From Socialist Rule appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/14/bolivias-turn-from-socialist-rule/",
    "timestamp": "2025-11-14T13:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene Introduces Bill To End H-1B Visas Days After Trump Backs The Program: 'AMERICANS FIRST'",
    "description": "Republican Rep. Marjorie Taylor Greene said she will introduce a bill to end H-1B visas, which allow companies to bring skilled foreign workers, days after President Donald Trump backed the program.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-introduces-bill-end-h-1b-visas-days-after-trump-backs-program-americans-3790354",
    "timestamp": "2025-11-14T12:55:20Z"
  },
  {
    "title": "Trump Lifts More Arctic Drilling Curbs",
    "description": "The Trump administration rescinded restrictions on oil drilling in Alaska's mammoth state petroleum reserve, reversing a move by Biden that put an estimated 8.7 billion barrels of recoverable oil off limits.",
    "link": "https://www.rigzone.com/news/wire/trump_lifts_more_arctic_drilling_curbs-14-nov-2025-182324-article/",
    "timestamp": "2025-11-14T12:54:02Z"
  },
  {
    "title": "Peter Thiel Fights the Antichrist and Defends Mamdani Voters",
    "description": "Zohran Mamdani’s election as New York City’s new mayor predictably surprised a lot of people. Who in the United States a year ago would have believed a Muslim born in Africa who calls himself a “democratic socialist” might ever prevail in a high-stakes electo…",
    "link": "https://www.fairobserver.com/devils-advocate/peter-thiel-fights-the-antichrist-and-defends-mamdani-voters/",
    "timestamp": "2025-11-14T12:46:16Z"
  },
  {
    "title": "Stock futures plunge as tech selloff worsens Friday",
    "description": "Wall Street faced another difficult trading session Friday as stock futures pointed sharply lower, extending a brutal selloff in technology shares that has rattled investor confidence and sent ripples through cryptocurrency markets. Futures contracts tied to …",
    "link": "https://rollingout.com/2025/11/14/stock-futures-tech-selloff-bitcoin/",
    "timestamp": "2025-11-14T12:46:12Z"
  },
  {
    "title": "Epstein emails reveal enduring ties with influential figures even after his sex crime conviction",
    "description": "The documents, spanning at least a decade, show Epstein's interactions with business executives, reporters, academics, and political players.",
    "link": "https://www.bostonherald.com/2025/11/14/epstein-emails-enduring-influential-connections/",
    "timestamp": "2025-11-14T12:46:04Z"
  },
  {
    "title": "Epstein emails reveal enduring ties with influential figures even after his sex crime conviction",
    "description": "The documents, spanning at least a decade, show Epstein's interactions with business executives, reporters, academics, and political players.",
    "link": "https://www.denverpost.com/2025/11/14/epstein-emails-enduring-influential-connections/",
    "timestamp": "2025-11-14T12:46:04Z"
  },
  {
    "title": "Trump-Trashing Superstar Wins Big At 2025 Latin Grammys",
    "description": "The Puerto Rican superstar has criticized the president's aggressive immigration enforcement.",
    "link": "https://www.huffpost.com/entry/bad-bunny-latin-grammys-2025_n_69171f19e4b0a2c1a929b501",
    "timestamp": "2025-11-14T12:45:21Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to the end of the “work” week: Friday, November 14, 2025, and National Pickle Day.  What would a world without pickles be? A corned beef or pastrami sandwich would be worthless. Here’s one serving from Katz’s Deli in NYT: It’s also International Girl’…",
    "link": "https://whyevolutionistrue.com/2025/11/14/friday-hili-dialogue-550/",
    "timestamp": "2025-11-14T12:45:20Z"
  },
  {
    "title": "'Worst possible time': Trump said to be hit with Epstein scandal while at 'weakest moment'",
    "description": "The combination of election losses last week and new Jeffrey Epstein revelations this week has plunged the White House into a doom loop as once reliable Republican lawmakers are refusing to bail Donald Trump out of the Epstein mess and are looking to create s…",
    "link": "https://www.rawstory.com/trump-weakest-moment-worst/",
    "timestamp": "2025-11-14T12:41:13Z"
  },
  {
    "title": "Eilish Slams 'Pathetic P***y B***h Coward' Musk for Hoarding Wealth...",
    "description": "Eilish Slams 'Pathetic P***y B***h Coward' Musk for Hoarding Wealth...\r\n\n \n \n \n (Second column, 5th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'ELON UNVEILED': Controversial Doc Reveals Trailer...",
    "link": "https://www.nme.com/news/music/billie-eilish-calls-out-fucking-pathetic-elon-musk-for-hoarding-wealth-as-tesla-ceo-nears-trillionaire-status-3908340",
    "timestamp": "2025-11-14T12:40:39Z"
  },
  {
    "title": "JD Vance reveals thoughts about possible 2028 presidential run",
    "description": "Vance acknowledged Thursday that he's thought about the likelihood of running for president to succeed Donald Trump in 2028,",
    "link": "https://nypost.com/2025/11/14/us-news/jd-vance-reveals-thoughts-about-possible-2028-presidential-run/",
    "timestamp": "2025-11-14T12:40:24Z"
  },
  {
    "title": "BBC apologizes to Trump over misleading speech edit",
    "description": "The BBC apologized to US President Donald Trump for misleadingly editing one of his speeches, but refused to pay compensation after he threatened to sue for $1 billion.\nThe broadcaster’s leader resigned this week over a 2024 documentary featuring Trump’s rema…",
    "link": "https://biztoc.com/x/d34d5a9ffea6f28f",
    "timestamp": "2025-11-14T12:39:06Z"
  },
  {
    "title": "US approves weapons sale to Taiwan, risking Beijing’s ire",
    "description": "Washington approved the first tranche of military sales to Taiwan since US President Donald Trump took office, raising tensions with Beijing that had only recently eased over the superpowers’ trade war.\nThe $330 million package of aircraft parts comes with Ch…",
    "link": "https://biztoc.com/x/bbee8ca787f3f2cc",
    "timestamp": "2025-11-14T12:38:43Z"
  },
  {
    "title": "Trump’s defense of H-1B visa reverberates, while Bay Area business group lauds recognition of immigrants’ value",
    "description": "President Donald Trump’ defense this week of the controversial H-1B visa, intended for skilled foreign workers and heavily used by Silicon Valley’s technology industry continues to divide the Make America Great Again movement, as a Bay Area business group exp…",
    "link": "https://biztoc.com/x/0a59681e221d6166",
    "timestamp": "2025-11-14T12:38:24Z"
  },
  {
    "title": "Politics: Ireland’s latest housing plan; Trump takes aim at BBC; Áras aftermath; and more",
    "description": "Your essential end-of-week catch-up on the events that shape agendas",
    "link": "https://www.irishtimes.com/politics/2025/11/14/politics-irelands-latest-housing-plan-trump-takes-aim-at-bbc-aras-aftermath-and-more/",
    "timestamp": "2025-11-14T12:37:27Z"
  },
  {
    "title": "'That's a rare thing': JD Vance makes startling claim about Trump's sleep habits",
    "description": "Vice President JD Vance made a startling claim about President Donald Trump's habits during overseas trips.The vice president and president do not travel together for safety and national security reasons, and the 41-year-old Vance told Fox News host Sean Hann…",
    "link": "https://www.rawstory.com/donald-trump-sleep-schedule-vance/",
    "timestamp": "2025-11-14T12:37:11Z"
  },
  {
    "title": "Megyn Kelly Questions Whether Jeffrey Epstein Was Actually A P*dophile",
    "description": "Megyn Kelly is facing renewed scrutiny after offering a controversial take on Jeffrey Epstein during a recent episode of her SiriusXM program. While breaking down newly released congressional documents tied to the late financier, Kelly weighed in on how Epste…",
    "link": "https://mediatakeout.com/megyn-kelly-questions-whether-jeffrey-epstein-was-actually-a-pdophile/",
    "timestamp": "2025-11-14T12:33:00Z"
  },
  {
    "title": "Prepare For Doctors To Smuggle Suicide And Trans Drugs Into Red States Like Abortion Pills",
    "description": "State shield laws protecting abortion providers set a dangerous precedent — doctors could mail other dangerous drugs across state lines.",
    "link": "https://thefederalist.com/2025/11/14/prepare-for-doctors-to-smuggle-suicide-and-trans-drugs-into-red-states-like-abortion-pills/",
    "timestamp": "2025-11-14T12:31:39Z"
  },
  {
    "title": "Republicans Test the Limits of Gerrymandering and Voter Suppression",
    "description": "The math is tricky, but Republican gerrymandering (the political manipulation of electoral district boundaries to benefit a party, group or socioeconomic class within the constituency) in the US Congress could be setting Republicans up for an electoral catast…",
    "link": "https://www.fairobserver.com/politics/republicans-test-the-limits-of-gerrymandering-and-voter-suppression/",
    "timestamp": "2025-11-14T12:31:33Z"
  },
  {
    "title": "Trump's Death Squad",
    "description": "oday, Donald Trump presides over his own Murder Incorporated, less a government than a death squad.Many brushed off his proclamation early in his second term that the Gulf of Mexico would henceforth be called the Gulf of America as a foolish, yet harmless, sh…",
    "link": "https://www.commondreams.org/opinion/trump-death-squad",
    "timestamp": "2025-11-14T12:31:03Z"
  },
  {
    "title": "Did Anyone Care About the Sex Crimes?",
    "description": "Republicans went after Epstein only when it was politically useful.",
    "link": "https://www.theatlantic.com/ideas/2025/11/epstein-trump-sex-politics/684927/",
    "timestamp": "2025-11-14T12:31:00Z"
  },
  {
    "title": "Trillionaire fantasies, investor dreams, reality nightmares",
    "description": "Why Musk won't ever realize the shareholder-approved Tesla payout Opinion  At Tesla's annual shareholder meeting in Austin, Texas, more than 75 percent of voting shares backed a compensation deal for CEO Elon Musk that would make him history's first trilliona…",
    "link": "https://www.theregister.com/2025/11/14/opinion_musk_tesla_payout/",
    "timestamp": "2025-11-14T12:30:08Z"
  }
]