[
  {
    "title": "Bondi Fires Former FBI Director James Comey's Daughter from Role as Federal Prosecutor",
    "description": "Attorney General Pam Bondi fired former FBI Director James Comey’s daughter, Maurene Comey, from her role as a federal prosecutor, according to several reports. “Two people familiar with the matter” told Politico that Maurene Comey, who had served as a\nThe po…",
    "link": "https://www.breitbart.com/politics/2025/07/16/bondi-fire-comey-daughter-fed-prosecutor/",
    "timestamp": "2025-07-17T03:22:17Z"
  },
  {
    "title": "Make Coke Great Again: Trump says Coca-Cola US products to switch to real cane sugar",
    "description": "Donald Trump announced on Truth Social that Coca-Cola has agreed to use real cane sugar in its US products, a move he praised as \"very good.\" Trump's post included an image of a Coca-Cola bottle branded with his name. While Coca-Cola has not yet issued an off…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/make-coke-great-again-trump-says-coca-cola-us-products-to-switch-to-real-cane-sugar/articleshow/122610140.cms",
    "timestamp": "2025-07-17T03:19:39Z"
  },
  {
    "title": "Asian stocks struggle as traders eye Fed saga, trade war",
    "description": "Asian markets fluctuated Thursday after a rollercoaster day on Wall Street punctuated by fears Donald Trump was considering sacking the head of the US Federal Reserve. Traders have walked a cautious line this week as they ascertain the trade outlook after the…",
    "link": "https://www.digitaljournal.com/world/asian-stocks-struggle-as-traders-eye-fed-saga-trade-war/article",
    "timestamp": "2025-07-17T03:17:32Z"
  },
  {
    "title": "Indiana Fever’s Caitlin Clark becomes punchline in Shane Gillis’ risky ESPYs roast",
    "description": "Caitlin Clark, despite being absent due to injury, was a central figure at the 2025 ESPYs. While honored as Best WNBA Player, a controversial joke by host Shane Gillis overshadowed her win. Gillis's monologue, targeting various figures including Donald Trump …",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/indiana-fevers-caitlin-clark-becomes-punchline-in-shane-gillis-risky-espys-roast/articleshow/122609751.cms",
    "timestamp": "2025-07-17T03:16:22Z"
  },
  {
    "title": "Crypto bills move forward after nine-hour stalemate on House floor",
    "description": "The US House has moved forward three crypto bills after a record-long procedural vote saw a group of Republicans hold out to ensure language banning CBDCs.",
    "link": "https://cointelegraph.com/news/crypto-bills-move-forward-after-house-stalemate",
    "timestamp": "2025-07-17T03:15:47Z"
  },
  {
    "title": "Asian Stocks Struggle As Traders Eye Fed Saga, Trade War",
    "description": "Asian markets fluctuated Thursday after a rollercoaster day on Wall Street punctuated by fears Donald Trump was considering sacking the head of the US Federal Reserve.",
    "link": "https://www.ibtimes.com/asian-stocks-struggle-traders-eye-fed-saga-trade-war-3778704",
    "timestamp": "2025-07-17T03:15:26Z"
  },
  {
    "title": "Asian stocks struggle as traders eye Fed saga, trade war",
    "description": "Asian markets fluctuated Thursday after a rollercoaster day on Wall Street punctuated by fears Donald Trump was considering sacking the head of the US...",
    "link": "https://finance.yahoo.com/news/asian-stocks-struggle-traders-eye-031254766.html",
    "timestamp": "2025-07-17T03:12:54Z"
  },
  {
    "title": "Diddy Trial Lead Prosecutor – and James Comey’s Daughter – Fired by Trump DoJ",
    "description": "Maurene Comey also prosecuted Jeffrey Epstein accomplice Ghislaine Maxwell and was involved in the prosecution of the billionaire himself before his 2019 death\nThe post Diddy Trial Lead Prosecutor – and James Comey’s Daughter – Fired by Trump DoJ appeared fir…",
    "link": "https://www.thewrap.com/diddy-trial-lead-prosecutor-james-comeys-daughter-fired-by-trump-doj/",
    "timestamp": "2025-07-17T03:12:12Z"
  },
  {
    "title": "Shane Gillis Jabs at Trump During ESPYs: ‘There Was Supposed To Be an Epstein Joke Here, But…’",
    "description": "Comedian Shane Gillis dinged President Donald Trump while hosting the ESPYs on Wednesday night.\nThe post Shane Gillis Jabs at Trump During ESPYs: ‘There Was Supposed To Be an Epstein Joke Here, But…’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/shane-gillis-jabs-at-trump-during-espys-there-was-supposed-to-be-an-epstein-joke-here-but/",
    "timestamp": "2025-07-17T03:11:33Z"
  },
  {
    "title": "US House officially passes rule to advance GENIUS, Clarity, and Anti-CBDC acts after longest vote in chamber history",
    "description": "The advancement of these crypto measures could significantly influence the regulatory landscape and future innovation in the digital currency sector.\nThe post US House officially passes rule to advance GENIUS, Clarity, and Anti-CBDC acts after longest vote in…",
    "link": "https://cryptobriefing.com/us-crypto-legislation-genius-clarity/",
    "timestamp": "2025-07-17T03:08:05Z"
  },
  {
    "title": "China is winning Donald Trump’s trade war",
    "description": "While China does not want a trade war or to decouple, it is willing to risk a trade war that the United States may lose — and it would rather decouple than kowtow to Trump.",
    "link": "https://www.japantimes.co.jp/commentary/2025/07/17/world/china-winning-trumps-trade-war/",
    "timestamp": "2025-07-17T03:08:00Z"
  },
  {
    "title": "'Harms students!' White House official under fire from Republicans over new fund",
    "description": "A key member of President Donald Trump's administration is under fire over withholding Congressionally-approved education funds, according to a new report. Ten Republican Senators sent a stern letter to Russell Vought, who leads the Office of Management and B…",
    "link": "https://www.rawstory.com/harms-students-white-house-official-under-fire-from-republicans-over-new-fund/",
    "timestamp": "2025-07-17T03:01:45Z"
  },
  {
    "title": "Trump’s World Liberty crypto tokens are set to become tradable",
    "description": "Trump-backed crypto project World Liberty Financial will allow the platform’s governance token to be tradable after 99.94% of holders voted in favor of the proposal.",
    "link": "https://cointelegraph.com/news/trump-backed-wlfi-token-trading-approved-token-unlock",
    "timestamp": "2025-07-17T03:00:46Z"
  },
  {
    "title": "Trump says it's 'highly unlikely' he will fire Fed Chair Powell after broaching idea with GOP reps (NBC News)",
    "description": "NBC News:\nTrump says it's ‘highly unlikely’ he will fire Fed Chair Powell after broaching idea with GOP reps  —  A recent Supreme Court decision indicated the president doesn't have the authority to remove officials at the Federal Reserve at will.  —  Preside…",
    "link": "https://www.memeorandum.com/250716/p180",
    "timestamp": "2025-07-17T03:00:29Z"
  },
  {
    "title": "Trump North Las Vegas industrial park bill | North Las Vegas",
    "description": "The city of North Las Vegas can now issue permits and provide utility access for businesses in the Apex Industrial Park.",
    "link": "https://www.reviewjournal.com/post/3397245",
    "timestamp": "2025-07-17T03:00:28Z"
  },
  {
    "title": "Khamenei claims: Israeli strikes aimed to undermine Iranian system, spark unrest",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei charges that Israel's June offensive sought to \"weaken the system\" and incite internal unrest for regime overthrow.",
    "link": "https://www.israelnationalnews.com/news/411797",
    "timestamp": "2025-07-17T02:59:09Z"
  },
  {
    "title": "Coalition accuses PM of making 'excuses' for China as visit ends",
    "description": "Prime Minister Anthony Albanese paid a visit to \"great ambassador\" Fu Ni on the final leg of his visit to China — but the Coalition is ramping up its criticism of that trip, saying he leaves without a concrete outcome for Australia.",
    "link": "https://www.abc.net.au/news/2025-07-17/albanese-china-visit-giant-pandas-coalition-excuses/105542236",
    "timestamp": "2025-07-17T02:55:00Z"
  },
  {
    "title": "Joe Rogan confronts Gavin Newsom with ‘tough’ questions on pandemic record: ‘Motherf–ker’",
    "description": "Newsom admitted outdoor closures were a mistake as state prepares 'objective review' of COVID response.",
    "link": "https://nypost.com/2025/07/16/media/joe-rogan-confronts-gavin-newsom-with-tough-questions-on-pandemic-record/",
    "timestamp": "2025-07-17T02:54:55Z"
  },
  {
    "title": "Turnberry won’t be hosting British Open soon — but it’s not because Trump",
    "description": "President Donald Trump won’t be getting to host a British Open at his Turnberry resort anytime soon, according to the R&A, which governs the major.",
    "link": "https://nypost.com/2025/07/16/sports/donald-trump-not-reason-for-no-british-open-at-turnberry-mark-darbon/",
    "timestamp": "2025-07-17T02:54:17Z"
  },
  {
    "title": "Report: Hamas agrees to new withdrawal map proposed by Israel",
    "description": "Egyptian report: Hamas has agreed to a new withdrawal map presented by Israel, which includes a withdrawal from the Morag Corridor and limited IDF deployment. Negotiations expected to focus on framework for releasing hostages.",
    "link": "https://www.israelnationalnews.com/news/411796",
    "timestamp": "2025-07-17T02:45:11Z"
  },
  {
    "title": "Donald Trump goes nuclear in the GOP's war on science (Heather Digby Parton/Salon)",
    "description": "Heather Digby Parton / Salon:\nDonald Trump goes nuclear in the GOP's war on science  —  Billions of dollars in cuts to research are leaving lives at stake  —  One hundred years ago this month, the Scopes trial was held in Dayton, Tenn. For 11 days, jurors hea…",
    "link": "https://www.memeorandum.com/250716/p177",
    "timestamp": "2025-07-17T02:45:01Z"
  },
  {
    "title": "Joe Rogan Reveals the Reasons He Decided to Interview Trump on His Podcast Before the Election (VIDEO)",
    "description": "If you recall, early on in the 2024 election, Joe Rogan did not want to interview Trump on his podcast.\nThe post Joe Rogan Reveals the Reasons He Decided to Interview Trump on His Podcast Before the Election (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/joe-rogan-reveals-reasons-he-decided-interview-trump/",
    "timestamp": "2025-07-17T02:40:57Z"
  },
  {
    "title": "Alex Jones Says Trump Is ‘Destroying MAGA in Real Time’ Because He’s ‘Implicated’ in Epstein Files",
    "description": "Infowars founder Alex Jones accused President Donald Trump of \"destroying MAGA in real time\" on Wednesday as Trump continued to lash out at supporters.\nThe post Alex Jones Says Trump Is ‘Destroying MAGA in Real Time’ Because He’s ‘Implicated’ in Epstein Files…",
    "link": "https://www.mediaite.com/politics/alex-jones-says-trump-is-destroying-maga-in-real-time-because-hes-implicated-in-epstein-files/",
    "timestamp": "2025-07-17T02:36:34Z"
  },
  {
    "title": "Gold dips as dollar firms, Trump's Powell remarks ease market jitters",
    "description": "Gold prices experienced a slight dip in early Asian trading due to a stronger dollar and easing market concerns after President Trump suggested he wouldn't dismiss Federal Reserve Chair Jerome Powell. The dollar's rise made gold more expensive for internation…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-dips-as-dollar-firms-trumps-powell-remarks-ease-market-jitters/articleshow/122608278.cms",
    "timestamp": "2025-07-17T02:34:55Z"
  },
  {
    "title": "AI-powered 'nudify' apps fuel deadly wave of digital blackmail",
    "description": "A Kentucky teen’s suicide has spotlighted the rise of AI-driven sextortion, where scammers use “nudify” apps to blackmail minors with fake explicit images. Reports of such abuse are growing globally, prompting legal action and crackdowns, but experts warn the…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-powered-nudify-apps-fuel-deadly-wave-of-digital-blackmail/articleshow/122608219.cms",
    "timestamp": "2025-07-17T02:33:42Z"
  },
  {
    "title": "Meta privacy trial: Here's what shareholders allege against Mark Zuckerberg, from illegal data mining to board failures…",
    "description": "Meta shareholders are demanding $8 billion for an alleged privacy scandal at Mark Zuckerberg's Facebook, based on allegations that executives (including Zuckerberg himself and former COO Sheryl Sandberg) conducted illegal data harvesting, while the board fail…",
    "link": "https://www.livemint.com/companies/news/meta-privacy-trial-what-shareholders-alleged-mark-zuckerberg-insider-trading-illegal-data-mining-board-failure-facebook-11752716072298.html",
    "timestamp": "2025-07-17T02:33:24Z"
  },
  {
    "title": "Senator Tuberville Tells U.S. Citizens Swept Up in Immigration Raids, ‘Don’t Hang Around Illegals’",
    "description": "Sen. Tommy Tuberville advised U.S. citizens to avoid associating with undocumented immigrants, lest they be arrested during an immigration raid by federal agents.\nThe post Senator Tuberville Tells U.S. Citizens Swept Up in Immigration Raids, ‘Don’t Hang Aroun…",
    "link": "https://www.mediaite.com/politics/senator-tuberville-tells-u-s-citizens-swept-up-in-immigration-raids-dont-hang-around-illegals/",
    "timestamp": "2025-07-17T02:31:16Z"
  },
  {
    "title": "Australia’s defence establishment and media have a bad case of Trump Derangement Syndrome over China",
    "description": "Why has the media coverage of Anthony Albanese's China trip changed so markedly since his last visit? Because US apologists here are terrified of what Trump has done to alienate Australians.\nThe post Australia’s defence establishment and media have a bad case…",
    "link": "http://www.crikey.com.au/2025/07/17/australian-media-defence-donald-trump-derangement-syndrome-china/",
    "timestamp": "2025-07-17T02:30:36Z"
  },
  {
    "title": "Trump administration pulls $4B in federal funding for California's bullet train project",
    "description": "The Trump administration has revoked $4 billion in federal funding for California's long-delayed high speed rail project",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-administration-pulls-4b-federal-funding-californias-bullet-123821200",
    "timestamp": "2025-07-17T02:30:20Z"
  },
  {
    "title": "Oil Edges Higher With Stockpiles and Trade-War Twists in Focus",
    "description": "Oil edged higher after a three-day drop as traders tracked US stockpiles and the latest twists in the Washington-led trade wars.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-edges-higher-with-stockpiles-and-trade-war-twists-in-focus",
    "timestamp": "2025-07-17T02:29:39Z"
  },
  {
    "title": "Sensex, Nifty may open flat; Focus on India–US trade deal, key earnings today",
    "description": "Sensex, Nifty likely to open flat on July 17. Focus on India–US trade deal, earnings from Axis Bank, Wipro, Jio Financial. Derivatives suggest cautious optimism.",
    "link": "https://www.thehindubusinessline.com/markets/sensex-nifty-may-open-flat-focus-on-indiaus-trade-deal-key-earnings-today/article69821611.ece",
    "timestamp": "2025-07-17T02:26:09Z"
  },
  {
    "title": "Japan exports drop for second month as auto shipments to US plummet",
    "description": "TOKYO -- Japan's exports declined for the second consecutive month in June, as shipments to America, its biggest export destination, continued to fall as a result of the hefty tariffs U.S. President Donald Trump imposed on Japanese cars and other products.\nOv…",
    "link": "https://biztoc.com/x/1033628d4e55a9d2",
    "timestamp": "2025-07-17T02:22:33Z"
  },
  {
    "title": "ICC rejects Israel's bid to annul Netanyahu, Gallant arrest warrants",
    "description": "The ICC rejects Israel's request to withdraw arrest warrants for Netanyahu and Gallant, and to suspend its Gaza probe, insists the warrants stand.",
    "link": "https://www.israelnationalnews.com/news/411795",
    "timestamp": "2025-07-17T02:17:17Z"
  },
  {
    "title": "President Trump Mocked By Shane Gillis Over Epstein List & ICE Immigration Raids During ESPYs",
    "description": "Comedian Shane Gillis didn’t pull any punches during his ESPYs appearance. On Wednesday night, Gillis found himself trending on social media after telling edgy jokes about Caitlin Clark, Shedeur Sanders, and Deshaun Watson. During his appearance, Gillis also …",
    "link": "https://brobible.com/sports/article/president-trump-mocked-by-shane-gillis-over-epstein-list/",
    "timestamp": "2025-07-17T02:11:23Z"
  },
  {
    "title": "Simone Biles wins two ESPYS, beating out Stephen Curry, Freddie Freeman and Rory McIlroy",
    "description": "Simone Biles wins two ESPY awards, including Best Women's Athlete, after her stellar performance at the Paris Games.",
    "link": "https://www.stltoday.com/sports/professional/article_f42effc5-34f7-5bc9-adf5-c78882f81e69.html",
    "timestamp": "2025-07-17T02:10:00Z"
  },
  {
    "title": "Trump administration pulls $4B in federal funding for California's bullet train project",
    "description": "The Trump administration has revoked $4 billion in federal funding for California's long-delayed high speed rail project.",
    "link": "https://www.clickondetroit.com/business/2025/07/17/trump-administration-pulls-4b-in-federal-funding-for-californias-bullet-train-project/",
    "timestamp": "2025-07-17T02:09:52Z"
  },
  {
    "title": "Sen Tuberville Lists Staggering Amount Of Debt ‘Status Quo’ Spending In DC Could Still Create",
    "description": "Tommy Tuberville warned Wednesday that continuing Washington’s current spending trajectory could saddle the country with an additional $26 trillion in debt.",
    "link": "https://dailycaller.com/2025/07/16/tommy-tuberville-status-quo-rescissions-package/",
    "timestamp": "2025-07-17T02:09:01Z"
  },
  {
    "title": "Trump Doubles Down and Points the Finger in Bizarre Epstein Excuse Rant",
    "description": "Donald Trump intensified efforts to shift blame for the Epstein files controversy in a long-winded rant to a right-wing talk show. The president dialed in to...",
    "link": "https://www.thedailybeast.com/trump-doubles-down-and-points-the-finger-in-bizarre-epstein-excuse-rant/",
    "timestamp": "2025-07-17T02:08:41Z"
  },
  {
    "title": "Trump's World Liberty crypto tokens to become tradable",
    "description": "Holders of World Liberty Financial's $WLFI tokens, linked to Donald Trump's family, have voted to make them tradable, potentially boosting the value of Trump's holdings. This move allows for wider trading and speculation, despite criticism from lawmakers rega…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/trumps-world-liberty-crypto-tokens-to-become-tradable/articleshow/122607057.cms",
    "timestamp": "2025-07-17T02:05:33Z"
  },
  {
    "title": "Trump says Coca-Cola to switch to cane sugar in US",
    "description": "WASHINGTON: Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday (Jul 16) on social media. The company currently uses high-fructose corn syrup (HFCS) in its domestic beverages - a sweetene…",
    "link": "https://www.channelnewsasia.com/world/trump-coca-cola-switch-cane-sugar-us-5242621",
    "timestamp": "2025-07-17T02:03:58Z"
  },
  {
    "title": "This Controversial, Trump-Tied Comedian Just Ousted Joe Rogan From Top Podcast Spot On YouTube",
    "description": "The ranking is significant because it marks a possible shift in the podcast space, after Rogan and other right-wing podcasters propelled Trump to the White House last year.",
    "link": "https://www.huffpost.com/entry/controversial-trump-tied-comedian-ousted-joe-rogan-from-top-podcast-spot-youtube_n_68781cafe4b0eddd78bcacf5",
    "timestamp": "2025-07-17T02:02:48Z"
  },
  {
    "title": "Secret Meeting Opens Document Floodgates on Russia Hoax",
    "description": "The floodgates holding back long-buried classified documents exposing government efforts to claim Donald Trump conspired with Vladimir Putin to manipulate the 2016 U.S. presidential election might fin",
    "link": "https://www.realclearinvestigations.com/articles/2025/07/16/exclusive_secret_meeting_opens_document_floodgates_on_trumprussia_hoax_1123108.html",
    "timestamp": "2025-07-17T02:02:03Z"
  },
  {
    "title": "Trump administration pulls $4B in federal funding for California’s bullet train project",
    "description": "SACRAMENTO, Calif. (AP) — The Trump administration revoked federal funding for California’s high-speed rail project on Wednesday, intensifying uncertainty about how the state will make good on its long-delayed promise of building a bullet train to shuttle rid…",
    "link": "https://financialpost.com/pmn/trump-administration-pulls-4b-in-federal-funding-for-californias-bullet-train-project",
    "timestamp": "2025-07-17T02:00:56Z"
  },
  {
    "title": "Florida Defends Immigration Sovereignty Amid False Accusations",
    "description": "Recently, Democratic Representative Maxwell Frost visited an immigrant detention center in the Everglades, Florida, denouncing conditions he called a “moral atrocity” and a “detention camp.” However, from the Republican perspective and the administration of P…",
    "link": "https://gatewayhispanic.com/video/florida-defends-immigration-sovereignty-amid-false-accusations/",
    "timestamp": "2025-07-17T02:00:37Z"
  },
  {
    "title": "Trump ends funding for California's High-Speed Rail",
    "description": "United States President Donald Trump said that he was ending government funding for California's High-Speed Rail project, which he described as \"disastrously overpriced.\"\n\"This boo...",
    "link": "https://biztoc.com/x/62d1668158428d73",
    "timestamp": "2025-07-17T02:00:28Z"
  },
  {
    "title": "Major Trump tech deal at risk of blowing up — and 'angering' Middle East partner",
    "description": "President Donald Trump's administration has been working on a landmark deal to sell Nvidia chips to the United Arab Emirates — but a national security concern about China might blow the whole thing up before anything gets finalized, the Wall Street Journal re…",
    "link": "https://www.rawstory.com/trump-deal/",
    "timestamp": "2025-07-17T02:00:02Z"
  },
  {
    "title": "Trump says India trade agreement is close, hints at 10-15% tariff on smaller countries",
    "description": "President Trump stated the U.S. is nearing a trade agreement with India and potentially the EU, while a deal with Canada remains uncertain. These negotiations occur before an August 1 deadline that could see increased duties on U.S. imports. Trump emphasized …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-india-trade-agreement-is-close-hints-at-10-15-tariff-on-smaller-countries/articleshow/122606839.cms",
    "timestamp": "2025-07-17T01:58:23Z"
  },
  {
    "title": "Shane Gillis’ fiery ESPYs monologue completely divided the internet",
    "description": "If you were in the sports world or seemingly anywhere, for that matter, you were not safe from Shane Gillis on Wednesday night.",
    "link": "https://nypost.com/2025/07/16/sports/shane-gillis-espys-monologue-completely-divided-internet/",
    "timestamp": "2025-07-17T01:55:11Z"
  },
  {
    "title": "Trump’s Former Adviser Says Administration Should Release Epstein Files: ‘They’ve Painted Themselves into a Corner Here’",
    "description": "A former campaign adviser to President Donald Trump offered some unsolicited advice to his former boss on Wednesday night. \nThe post Trump’s Former Adviser Says Administration Should Release Epstein Files: ‘They’ve Painted Themselves into a Corner Here’ first…",
    "link": "https://www.mediaite.com/media/tv/trumps-former-adviser-says-administration-should-release-epstein-files-theyve-painted-themselves-into-a-corner-here/",
    "timestamp": "2025-07-17T01:53:46Z"
  },
  {
    "title": "Eswatini Says It Will Repatriate Migrants Deported by the Trump Administration - The New York Times",
    "description": "Eswatini Says It Will Repatriate Migrants Deported by the Trump AdministrationThe New York Times What to know about the African kingdom of Eswatini, where the US sent 5 deporteesKCRA US deports immigrants from Jamaica, Cuba and other countries to the African …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178397700",
    "timestamp": "2025-07-17T01:52:25Z"
  },
  {
    "title": "DOJ fires Maurene Comey, daughter of James Comey and a prosecutor in Sean Combs' and Ghislaine Maxwell's cases",
    "description": "Federal prosecutor Maurene Comey, the daughter of former FBI Director James Comey, was fired by the Justice Department on Wednesday, according to four sources familiar with the matter. It was not clear why. One of the sources said the U.S. Attorney’s Office f…",
    "link": "https://freerepublic.com/focus/f-news/4329107/posts",
    "timestamp": "2025-07-17T01:52:08Z"
  },
  {
    "title": "Democrat congressman dragged for ‘weird’ TikTok ‘aura farming’ trend video",
    "description": "Rep. Suhas Subramanyam posted a TikTok dancing in the House subway, but the clip drew backlash as critics called it “cringe\" and cited his vote against Trump’s impeachment.",
    "link": "https://www.foxnews.com/politics/democrat-congressman-dragged-weird-tiktok-aura-farming-trend-video",
    "timestamp": "2025-07-17T01:49:56Z"
  },
  {
    "title": "'Corrupt': Trump admin accused of 'domestic terrorism' by church",
    "description": "Delegates at the United Church of Christ’s 35th General Synod overwhelmingly passed an emergency resolution this week, condemning the ongoing Immigration and Customs Enforcement raids as “domestic terrorism” and accusing President Donald Trump's administratio…",
    "link": "https://www.rawstory.com/ice-raids-2673290592/",
    "timestamp": "2025-07-17T01:46:20Z"
  },
  {
    "title": "Construction Costs to ‘Go Up Radically,’ Prologis CEO Says",
    "description": "The chief executive officer of Prologis Inc., a real estate investment trust that owns and runs warehouses, said US immigration policy is causing a labor shortage that’s driving building costs higher.",
    "link": "https://www.livemint.com/companies/news/construction-costs-to-go-up-radically-prologis-ceo-says-11752716673842.html",
    "timestamp": "2025-07-17T01:44:33Z"
  },
  {
    "title": "‘It’s just better!’ Trump says he’s convinced Coca-Cola to use cane sugar",
    "description": "Beverage giant declines to either confirm or deny change to ingredients in its signature soft drink.",
    "link": "https://www.aljazeera.com/economy/2025/7/17/its-just-better-trump-says-hes-convinced-coca-cola-to-use-cane-sugar",
    "timestamp": "2025-07-17T01:44:02Z"
  },
  {
    "title": "Trump admin. pulls billions in funding for CA high-speed rail",
    "description": "In addition to terminating the funding, U.S. Transportation Secretary Sean P. Duffy directed the Federal Railroad Administration to review other grants related to the project.",
    "link": "https://www.kcra.com/article/trump-administration-pulls-billions-california-high-speed-rail/65430960",
    "timestamp": "2025-07-17T01:41:48Z"
  },
  {
    "title": "‘There Weren’t Many Challenges Left’",
    "description": "At the 2025 ESPYs tonight, Jones Jones gave his first public interview since the announcing his return from retirement",
    "link": "https://www.mmamania.com/2025/7/16/24469111/video-unchallenged-jon-jones-explains-latest-ufc-retirement-claims-hes-back-to-entertain-america",
    "timestamp": "2025-07-17T01:41:22Z"
  },
  {
    "title": "Walmart layoffs 2025: US retail giant is cutting hundreds of store-support roles",
    "description": "Walmart Jobs cut: Walmart is reportedly cutting hundreds of store-support roles as part of an ongoing effort to simplify its operational structure. The move eliminates market coordinator positions and some coach roles at Walmart Academy. Affected employees wi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/walmart-layoffs-2025-us-retail-giant-is-cutting-hundreds-of-store-support-roles/articleshow/122606071.cms",
    "timestamp": "2025-07-17T01:39:47Z"
  },
  {
    "title": "Dollar on shaky ground as markets fret about Fed independence",
    "description": "The dollar experienced fragility amidst concerns that President Trump might dismiss Federal Reserve Chair Jerome Powell, impacting U.S. market confidence. Trump denied immediate plans but kept the option open, criticizing Powell's interest rate policies. Inve…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-on-shaky-ground-as-markets-fret-about-fed-independence/articleshow/122606045.cms",
    "timestamp": "2025-07-17T01:39:08Z"
  },
  {
    "title": "Coca-Cola dodges after Trump says soda will switch back to cane sugar",
    "description": "President Donald Trump said Wednesday that Coca-Cola in the United States will begin to be made with cane sugar, but the company did not explicitly say that was the case when it was asked later about Trump’s claim.\nTrump said Wednesday afternoon on Truth Soci…",
    "link": "https://biztoc.com/x/8475e35003349db5",
    "timestamp": "2025-07-17T01:38:10Z"
  },
  {
    "title": "Senate majority leader says Republicans ready to move on Russia sanctions bill when Trump gives green light",
    "description": "Senate Majority Leader John Thune says Republicans will vote on a Russia sanctions bill once Trump approves it, as pressure mounts on Moscow to negotiate peace in Ukraine.",
    "link": "https://www.foxnews.com/media/senate-majority-leader-says-republicans-ready-move-russia-sanctions-bill-when-trump-gives-greenlight",
    "timestamp": "2025-07-17T01:38:06Z"
  },
  {
    "title": "Oil rises as demand hopes and economic data lift sentiment",
    "description": "Oil prices experienced a rebound following earlier losses, fueled by robust economic data from major oil-consuming nations and indications of reduced trade tensions. U.S. crude inventories saw a significant drop, signaling increased refinery activity and dema…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rises-as-demand-hopes-and-economic-data-lift-sentiment/articleshow/122605983.cms",
    "timestamp": "2025-07-17T01:37:20Z"
  },
  {
    "title": "Epstein, Maxwell prosecutor Maurene Comey fired",
    "description": "Maurene Comey was terminated from her position as a federal prosecutor in Manhattan, per reports",
    "link": "https://www.salon.com/2025/07/16/epstein-maxwell-prosecutor-maurene-comey-fired/",
    "timestamp": "2025-07-17T01:35:52Z"
  },
  {
    "title": "Wall Street ends up, after brief downward detour on Powell firing confusion",
    "description": "Wall Street experienced a volatile session Wednesday following reports of a potential dismissal of Federal Reserve Chair Jerome Powell, triggering market fluctuations. Equities recovered after President Trump denied the reports, with the Nasdaq reaching a rec…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-up-after-brief-downward-detour-on-powell-firing-confusion/articleshow/122605903.cms",
    "timestamp": "2025-07-17T01:34:16Z"
  },
  {
    "title": "2025 ESPYS: Shane Gillis Takes on Trump/UFC, Jan. 6th, Epstein Files",
    "description": "In the interest of full disclosure, we've never been a big fan of comedian and actor Shane Gillis (Netflix's Tires) ever since all of that stuff went down with him and NBC's Saturday Night Live. Even after all of that, Gillis was invited back twice to host SN…",
    "link": "https://bleedingcool.com/tv/2025-espys-shane-gillis-takes-on-trump-ufc-jan-6th-epstein-files/",
    "timestamp": "2025-07-17T01:34:05Z"
  },
  {
    "title": "Photo of SZA wearing shirt supporting Trump isn't what it seems",
    "description": "A photo authentically showed R&B artist SZA wearing a shirt indicating she supported U.S. President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/trump-shirt-sza/",
    "timestamp": "2025-07-17T01:30:00Z"
  },
  {
    "title": "'Egregious': Trump accused of turning courts into deportation 'traps'",
    "description": "A dozen immigrants and their legal advocates on Wednesday launched a class action lawsuit challenging the Trump administration's campaign of courthouse arrests \"designed to strip noncitizens of their rights\" and expedite deportations.\"We are witnessing an aut…",
    "link": "https://www.rawstory.com/trump-immigration-2673290117/",
    "timestamp": "2025-07-17T01:29:43Z"
  },
  {
    "title": "20 states sue FEMA over cancellation of disaster mitigation grants",
    "description": "Twenty Democratic-led states have filed a lawsuit against the Federal Emergency Management Agency over the cancellation of a disaster mitigation grant program.",
    "link": "https://www.wjcl.com/article/fema-lawsuit-bric-program-cancellation/65428978",
    "timestamp": "2025-07-17T01:29:24Z"
  },
  {
    "title": "AI-powered 'Nudify' Apps Fuel Deadly Wave Of Digital Blackmail",
    "description": "After a Kentucky teenager died by suicide this year, his parents discovered he had received threatening texts demanding $3,000 to suppress an AI-generated nude image of him.",
    "link": "https://www.ibtimes.com/ai-powered-nudify-apps-fuel-deadly-wave-digital-blackmail-3778697",
    "timestamp": "2025-07-17T01:27:18Z"
  },
  {
    "title": "20 states sue FEMA over cancellation of disaster mitigation grants",
    "description": "Twenty Democratic-led states have filed a lawsuit against the Federal Emergency Management Agency over the cancellation of a disaster mitigation grant program.",
    "link": "https://www.wtae.com/article/fema-lawsuit-bric-program-cancellation/65428978",
    "timestamp": "2025-07-17T01:25:41Z"
  },
  {
    "title": "As Your Senators Debate Cuts, Here’s A Reminder Of What Your Tax Dollars Have Helped Pay For At Public Broadcasting",
    "description": "As the rescissions package remains before the Senate, a Daily Caller review shows a left-wing slant in NPR and PBS news coverage.",
    "link": "https://dailycaller.com/2025/07/16/senators-rescissions-package-defund-npr-pbs-media-bias/",
    "timestamp": "2025-07-17T01:24:46Z"
  },
  {
    "title": "AI-powered ‘nudify’ apps fuel deadly wave of digital blackmail",
    "description": "After a Kentucky teenager died by suicide this year, his parents discovered he had received threatening texts demanding $3,000 to suppress an AI-generated nude image of him. The tragedy underscores how so-called sextortion scams targeting children are growing…",
    "link": "https://www.digitaljournal.com/world/ai-powered-nudify-apps-fuel-deadly-wave-of-digital-blackmail/article",
    "timestamp": "2025-07-17T01:22:49Z"
  },
  {
    "title": "Donald Trump's 'significant' health issue addressed by doctor after worrying photo - NewsBreak",
    "description": "EXCLUSIVE: A health expert has suggested that Donald Trump's swollen ankles could be the sign of something major as speculation about his health continues",
    "link": "https://www.newsbreak.com/share/4111484021135-donald-trump-s-significant-health-issue-addressed-by-doctor-after-worrying-photo?_f=app_share&amp;pd=0Ga78NlT&amp;lang=en_US&amp;send_time=1752714963&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v7%2Cns_foryou_blend_exp_25q2-v1%2Cns_foryou_recall_exp_25q3-v3&amp;s=i2",
    "timestamp": "2025-07-17T01:16:46Z"
  },
  {
    "title": "CNBC Daily Open: U.S. producer prices are flat — but they don't factor in imports",
    "description": "Still, we might not know the full effect of the tariffs until after Aug. 1 when the updated tariffs kick in.",
    "link": "https://www.cnbc.com/2025/07/17/cnbc-daily-open-us-producer-prices-are-flat-but-they-dont-factor-in-imports.html",
    "timestamp": "2025-07-17T01:15:05Z"
  },
  {
    "title": "US citizen says he was jailed for three days after California immigration raid",
    "description": "(Reuters) -A U.S. citizen and Army veteran who works as a security guard at a California cannabis farm said on Wednesday that U.S. officials arrested him during an immigration raid last week and held him for three days without explanation. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/us-citizen-says-he-was-jailed-for-three-days-after-california-immigration-raid",
    "timestamp": "2025-07-17T01:15:00Z"
  },
  {
    "title": "Prosecutor in Diddy and Epstein cases fired by justice department",
    "description": "It is not clear why Maurene Comey was removed from her job at the elite justice department office in Manhattan.",
    "link": "https://www.bbc.com/news/articles/cdjxkkpgn1ko",
    "timestamp": "2025-07-17T01:12:41Z"
  },
  {
    "title": "Trump claims he does not need support of 'weaklings' demanding information on Epstein",
    "description": "Donald Trump has criticized some of his supporters, labeling them as \"weaklings\" for believing Democratic narratives surrounding the Jeffrey Epstein case. He claims Democrats are exploiting the Epstein scandal to undermine him, diverting attention from his pr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-claims-he-does-not-need-support-of-weaklings-demanding-information-on-epstein/articleshow/122605059.cms",
    "timestamp": "2025-07-17T01:11:17Z"
  },
  {
    "title": "Singapore's exports rise 13% in June, stronger than forecast",
    "description": "The rise beat a Reuters poll forecast for 5 per cent annual growth, and followed a revised 3.9 per cent fall in May.",
    "link": "https://www.channelnewsasia.com/singapore/key-exports-growth-electronics-tariffs-5242556",
    "timestamp": "2025-07-17T01:10:27Z"
  },
  {
    "title": "Trump Tariffs News Updates: US President to sign executive orders on Thursday afternoon, says White House",
    "description": "U.S. President Donald Trump is scheduled to sign executive orders on Thursday afternoon at 16:00 ET (20:00 GMT), the White House said on Wednesday, without specifying the topics of those orders.",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-live-updates-weather-rain-monsoon-narendra-modi-donald-trump-tariffs-ukraine-gaza-war-israel-russia/liveblog/122605000.cms",
    "timestamp": "2025-07-17T01:09:40Z"
  },
  {
    "title": "Seth Meyers: Trump Calls Epstein Case a \"Hoax\" & Turns on His \"Stupid\" Supporters Amid MAGA Mutiny",
    "description": "Seth takes a closer look at Donald Trump calling the Jeffrey Epstein case a \"hoax,\" saying supporters of his who are still fixated on it are \"stupid\" and claiming the mysterious Epstein files were actually created by Democrats to damage him politically.",
    "link": "https://littlegreenfootballs.com/article/54762_Seth_Meyers-_Trump_Calls_Epste",
    "timestamp": "2025-07-17T01:09:23Z"
  },
  {
    "title": "Asian stocks waver at open after Trump-Powell saga",
    "description": "Asian stocks showed mixed performance following a turbulent session in US markets. This volatility stemmed from speculation surrounding Federal Reserve Chair Jerome Powell's future. Donald Trump downplayed the possibility of removing Powell, calming market an…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-waver-at-open-after-trump-powell-saga/articleshow/122604894.cms",
    "timestamp": "2025-07-17T01:07:33Z"
  },
  {
    "title": "Trump says Coca-Cola will use real sugar in its US flagship drink. The company isn’t confirming that",
    "description": "President Donald Trump said Wednesday that Coca-Cola has agreed to use real cane sugar in its flagship soft drink in the U.S. at his suggestion — though the company didn’t confirm such a move.",
    "link": "https://www.wtae.com/article/trump-coca-cola-real-sugar-drink-company-isnt-confirming/65430821",
    "timestamp": "2025-07-17T01:06:39Z"
  },
  {
    "title": "Trump Eyes Tariff Rate Of 10% Or 15% For More Than 150 Countries",
    "description": "President Donald Trump said he would send letters to more than 150 countries notifying them of tariff rates and that the levies imposed could be 10% or 15% as he forges ahead with his trade agenda.\n\n“We’ll have well, over 150 countries that we’re just going t…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-eyes-tariff-rate-of-10-or-15-for-more-than-150-countries",
    "timestamp": "2025-07-17T01:05:11Z"
  },
  {
    "title": "Shane Gillis' awkward ESPYS monologue draws mixed reactions",
    "description": "Comedian Shane Gillis ’ opening monologue as host of the ESPYS went over awkwardly in front of some of the biggest names in sports on Wednesday night. Early on, he called out various famous faces in the Dolby Theatre crowd, including retired WNBA star Diana T…",
    "link": "https://sports.yahoo.com/article/shane-gillis-awkward-espys-monologue-010502319.html",
    "timestamp": "2025-07-17T01:05:02Z"
  },
  {
    "title": "Quinnipiac: Approval for Congressional Democrats Sinks to 19%",
    "description": "Quinnipiac concedes this is a record low since they first began asking this question in March 2009.\nThe post Quinnipiac: Approval for Congressional Democrats Sinks to 19% first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/quinnipiac-approval-for-congressional-democrats-sinks-to-19/",
    "timestamp": "2025-07-17T01:00:47Z"
  },
  {
    "title": "Sunny Hostin appears to change tune on releasing Epstein files after Trump DOJ declares there's no list",
    "description": "\"The View\" co-host Sunny Hostin seemed to have changed her tune on the release of Jeffrey Epstein's files, after the DOJ declared there was no client list.",
    "link": "https://www.foxnews.com/media/sunny-hostin-appears-change-tune-epstein-files-after-trump-doj-declares-theres-no-list",
    "timestamp": "2025-07-17T01:00:35Z"
  },
  {
    "title": "The Real Housewives of Miami Recap: Sister Narcissists",
    "description": "It feels like a small miracle that Lisa and Larsa can see past their own narcissism just long enough to make up with each other.",
    "link": "http://www.vulture.com/article/the-real-housewives-of-miami-recap-season-7-episode-6.html",
    "timestamp": "2025-07-17T01:00:30Z"
  },
  {
    "title": "Trump Announces Massive Investments to Steer America Closer to Energy, Tech Dominance",
    "description": "President Donald Trump announced Tuesday in Pennsylvania that 20 companies are bringing $92 billion in energy and technology investment to the Keystone State, capital he says will help secure U.S. dominance in both fields.",
    "link": "https://wattsupwiththat.com/2025/07/16/trump-announces-massive-investments-to-steer-america-closer-to-energy-tech-dominance/",
    "timestamp": "2025-07-17T01:00:00Z"
  },
  {
    "title": "Asian Stocks Waver At Open",
    "description": "Equity-index futures for the S&P 500 fell 0.2% in early trading Thursday following a 0.3% gain for the index after President Donald Trump played down the prospect he may soon fire Powell. Shares in Japan and South Korea declined while MSCI’s broader gauge of …",
    "link": "https://www.ndtvprofit.com/markets/global-stock-market-july-17-check-nikkei-hang-seng-s-and-p-500-dow-jones-nasdaq-dollar",
    "timestamp": "2025-07-17T00:59:43Z"
  },
  {
    "title": "Trump: Coca-Cola to Start 'Using Real Cane Sugar in Coke' in U.S.",
    "description": "President Donald Trump revealed that Coca-Cola had agreed to start “using REAL Cane Sugar in Coke” in the United States, adding that “it’s just better.” “I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the\nThe post Trump: Coca-Cola to…",
    "link": "https://www.breitbart.com/politics/2025/07/16/trump-coca-cola-start-using-real-cane-sugar-coke-u-s/",
    "timestamp": "2025-07-17T00:58:25Z"
  },
  {
    "title": "Justice Department fires Maurene Comey, prosecutor on Epstein case and daughter of ex-FBI director",
    "description": "The Justice Department has fired Maurene Comey, the daughter of former FBI director James Comey and a federal prosecutor in Manhattan who worked on the cases against Sean “Diddy” Combs and Jeffrey Epstein, three people familiar with the matter told The Associ…",
    "link": "https://japantoday.com/category/world/justice-department-fires-maurene-comey-prosecutor-on-epstein-case-and-daughter-of-ex-fbi-director",
    "timestamp": "2025-07-17T00:57:51Z"
  },
  {
    "title": "Yen slides on tariff, election anxiety; Aussie hit by soft jobs",
    "description": "TOKYO :The yen slid on Thursday as concerns mounted over a pivotal election in Japan and a still elusive trade deal with the U.S. to avoid a punishing rise in tariffs.Japan's currency traded near a one-year low against the euro as polls showed Prime Minister …",
    "link": "https://www.channelnewsasia.com/business/yen-slides-tariff-election-anxiety-aussie-hit-soft-jobs-5242561",
    "timestamp": "2025-07-17T00:56:12Z"
  },
  {
    "title": "Yen slides as tariff, election concerns weigh; Aussie hit by soft jobs",
    "description": "TOKYO :The yen slid on Thursday as concerns mounted over a pivotal election in Japan and a still elusive trade deal with the U.S. to avoid a punishing rise in tariffs.Japan's currency traded near a one-year low against the euro as polls showed Prime Minister …",
    "link": "https://www.channelnewsasia.com/business/yen-slides-tariff-election-concerns-weigh-aussie-hit-soft-jobs-5242561",
    "timestamp": "2025-07-17T00:56:12Z"
  },
  {
    "title": "Dollar on shaky ground as markets fret about Fed independence",
    "description": "TOKYO :The dollar was on a fragile footing on Thursday having lost ground overnight as concerns U.S. President Donald Trump was preparing to fire the Federal Reserve chair shook confidence in U.S. markets.Trump denied reports he was planning to dismiss Fed Ch…",
    "link": "https://www.channelnewsasia.com/business/dollar-shaky-ground-markets-fret-about-fed-independence-5242561",
    "timestamp": "2025-07-17T00:56:12Z"
  }
]