[
  {
    "title": "Scientists Say Trump Cuts Threaten Climate Research, Public Safety",
    "description": "Climate scientist Tom Di Liberto had dreamed of working at the National Oceanic and Atmospheric Administration (NOAA) since college.",
    "link": "https://www.ibtimes.com.au/scientists-say-trump-cuts-threaten-climate-research-public-safety-1856760",
    "timestamp": "2025-03-10T12:57:56Z"
  },
  {
    "title": "Stock Markets Mainly Lower On China, US Economy Fears",
    "description": "European and Asian stock markets mostly fell Monday, as investors feared the impact of President Donald Trump's trade policy on the economic growth of the United States and China, the world's biggest economies.",
    "link": "https://www.ibtimes.com.au/stock-markets-mainly-lower-china-us-economy-fears-1856759",
    "timestamp": "2025-03-10T12:57:54Z"
  },
  {
    "title": "Trump Says US In Talks With Four Groups Over TikTok Sale",
    "description": "President Donald Trump said Sunday the United States was in talks with four groups interested in acquiring TikTok, with the Chinese-owned app facing an uncertain future in the country.",
    "link": "https://www.ibtimes.com.au/trump-says-us-talks-four-groups-over-tiktok-sale-1856755",
    "timestamp": "2025-03-10T12:57:50Z"
  },
  {
    "title": "Musk Spat Renews Opposition In Italy To Starlink Deal",
    "description": "Italian opposition parties stepped up criticism Monday of a proposed deal between the government and SpaceX's Starlink following founder Elon Musk's suggestion he could cut Ukraine from the satellite network.",
    "link": "https://www.ibtimes.com.au/musk-spat-renews-opposition-italy-starlink-deal-1856753",
    "timestamp": "2025-03-10T12:57:48Z"
  },
  {
    "title": "The Glow of the Gaslight",
    "description": "\"There’s a chance to restore democracy from the bureaucracy, but just a chance.\" —Elon Musk",
    "link": "https://www.kunstler.com/p/the-glow-of-the-gaslight",
    "timestamp": "2025-03-10T12:55:44Z"
  },
  {
    "title": "U.S. Has Already Mostly Lifted The Military Intelligence Sharing Ban on Ukraine, Says President Trump",
    "description": "U.S. \"just about\" lifting intel sharing ban on Ukraine, introduced last week to remind Kyiv of the importance of following the peace path.\nThe post U.S. Has Already Mostly Lifted The Military Intelligence Sharing Ban on Ukraine, Says President Trump appeared …",
    "link": "https://www.breitbart.com/europe/2025/03/10/trump-u-s-has-mostly-lifted-ukraine-military-intelligence-sharing-ban/",
    "timestamp": "2025-03-10T12:55:44Z"
  },
  {
    "title": "Madonna Says Transgenders Face a ‘Lynch Mob Mentality’: ‘It Breaks My Heart’",
    "description": "Pop singer Madonna said that transgenders have faced a “lynch mob mentality” in this country since the rise of President Donald Trump. The “Like a Virgin” singer expressed her sentiments in an Instagram Story over the weekend. It breaks my heart to witness th…",
    "link": "https://freerepublic.com/focus/f-chat/4303295/posts",
    "timestamp": "2025-03-10T12:55:15Z"
  },
  {
    "title": "Here's what we know and don't know about the plane crash at Brethren Village in Manheim Township",
    "description": "A plane crashed Sunday afternoon in the parking lot of Brethren Village in Manheim Township, leaving five people injured.",
    "link": "https://lancasteronline.com/news/local/heres-what-we-know-and-dont-know-about-the-plane-crash-at-brethren-village-in/article_e75ba004-fda6-11ef-91a4-93e89bb023b4.html",
    "timestamp": "2025-03-10T12:55:00Z"
  },
  {
    "title": "Small Town Courage Means the World in the Age of Trump",
    "description": "“It is pretty wild how you can make someone mad by just holding a sign,” my 18-year-old Ro told me, as an irate driver peeled out of the intersection, shaking both his middle fingers at us but managing not to hit us. Phew! Ro was right. It didn’t take much to…",
    "link": "https://tomdispatch.com/courage-is-contagious/",
    "timestamp": "2025-03-10T12:54:09Z"
  },
  {
    "title": "Irish PM to discuss antisemitism with US Jewish figures during St Patrick's Day tour",
    "description": "The Irish government published a statement saying that Taoiseach Micheál Martin will be meeting with the US Jewish community on Friday 14 March.",
    "link": "https://www.jpost.com/diaspora/article-845441",
    "timestamp": "2025-03-10T12:53:44Z"
  },
  {
    "title": "Ukraine to propose sky, sea truce at US talks in Saudi: official",
    "description": "Kyiv will propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia this week, a Ukrainian official told AFP on Monday as President Volodymyr Zelensky was due to arrive in the kingdom. Those discussions from Tuesday will…",
    "link": "https://www.digitaljournal.com/world/ukraine-to-propose-sky-sea-truce-at-us-talks-in-saudi-official/article",
    "timestamp": "2025-03-10T12:52:20Z"
  },
  {
    "title": "Elon Musk's Social Security Comments Called Out by Former Administrator",
    "description": "The billionaire said Social Security, which pays out benefits to tens of millions of Americans every month, is \"the biggest Ponzi scheme of all time.\"",
    "link": "https://www.newsweek.com/elon-musk-social-security-comments-ponzi-scheme-martin-omalley-2042006",
    "timestamp": "2025-03-10T12:51:46Z"
  },
  {
    "title": "Trump’s tariff ‘delay’ is a confusing mess",
    "description": "President Donald Trump did not totally reverse the 25% tariffs he enacted earlier this month on just about every Mexican and Canadian good shipped to the United States.\nAlthough he announced a tariff delay on Thursday through April 2, that was far from a comp…",
    "link": "https://biztoc.com/x/a14c1d1379a61f79",
    "timestamp": "2025-03-10T12:50:54Z"
  },
  {
    "title": "George Washington, a real estate investor and successful entrepreneur, knew the difference between running a business and running the government",
    "description": "The first president realized that working with Congress – not alone or against it – was the best way to actually create an efficient federal government.",
    "link": "https://theconversation.com/george-washington-a-real-estate-investor-and-successful-entrepreneur-knew-the-difference-between-running-a-business-and-running-the-government-250332",
    "timestamp": "2025-03-10T12:50:44Z"
  },
  {
    "title": "Trump rejects pleas from business for more clarity on tariffs: 'They always say that'",
    "description": "President Donald Trump has dismissed the growing chorus of CEOs, investors and policymakers who are pleading with the White House for greater clarity about his sweeping tariff agenda.\n\"They always say that. 'We want clarity,'\" Trump said in a Fox News intervi…",
    "link": "https://biztoc.com/x/370f9a82449b1fa3",
    "timestamp": "2025-03-10T12:50:43Z"
  },
  {
    "title": "Canada Official Issues Trump Recession Warning As Electricity Tariffs Start",
    "description": "President Donald Trump is going to \"cause\" a recession, according to a warning from Ontario Premier Doug Ford, the leader of Canada's most populous province.\nNewsweek has contacted Ford's office for comment via email.\nWhy It Matters\nTrump's announcement of ta…",
    "link": "https://biztoc.com/x/83ff4c9b11456449",
    "timestamp": "2025-03-10T12:50:39Z"
  },
  {
    "title": "The dark parallels between 1920s America and today’s political climate",
    "description": "The early 1920s in the US offers historical lessons on how current pessimism about the state of the country can manifest in dangerous, discriminatory ways.",
    "link": "https://theconversation.com/the-dark-parallels-between-1920s-america-and-todays-political-climate-249986",
    "timestamp": "2025-03-10T12:49:56Z"
  },
  {
    "title": "Who is Brooke Rollins, US Secretary of Agriculture",
    "description": "Brooke Rollins has been sworn in as the 33rd U.S. Secretary of Agriculture, with significant support from the Senate. She is set to focus on strengthening rural America, supporting farmers, and ensuring food security. Rollins brings extensive experience in pu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/brooke-rollins-secretary-of-agriculture/articleshow/118846877.cms",
    "timestamp": "2025-03-10T12:49:50Z"
  },
  {
    "title": "Young people who aspired to government service dismayed by Trump ending the federal fellows program",
    "description": "One of Trump’s early executive orders ended the Presidential Management Fellows program, which was seen as a building block to become leaders in the federal workforce.",
    "link": "https://www.bostonherald.com/2025/03/10/trump-doge-government-fellows/",
    "timestamp": "2025-03-10T12:49:46Z"
  },
  {
    "title": "Young people who aspired to government service dismayed by Trump ending the federal fellows program",
    "description": "One of Trump’s early executive orders ended the Presidential Management Fellows program, which was seen as a building block to become leaders in the federal workforce.",
    "link": "https://www.denverpost.com/2025/03/10/trump-doge-government-fellows/",
    "timestamp": "2025-03-10T12:49:46Z"
  },
  {
    "title": "DEI initiatives removed from federal agencies that fund science, but scientific research continues",
    "description": "Trump’s DEI-related executive orders may affect early career scientists and researchers who study representation in science, but most research grants are unaffected.",
    "link": "https://theconversation.com/dei-initiatives-removed-from-federal-agencies-that-fund-science-but-scientific-research-continues-248810",
    "timestamp": "2025-03-10T12:49:22Z"
  },
  {
    "title": "Monday, March 10, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/monday-march-10-2025/",
    "timestamp": "2025-03-10T12:48:30Z"
  },
  {
    "title": "The FACE Act was enacted to protect reproductive health clinics − here’s why its history matters today",
    "description": "The FACE Act was signed by Bill Clinton in 1994 to guarantee access to abortion and reproductive health care protected by the Roe v. Wade Supreme Court decision.",
    "link": "https://theconversation.com/the-face-act-was-enacted-to-protect-reproductive-health-clinics-heres-why-its-history-matters-today-249427",
    "timestamp": "2025-03-10T12:48:16Z"
  },
  {
    "title": "Secretary of State Rubio Says USAID Purge Complete, With 83% of Programs Gone",
    "description": "The U.S. Secretary of State also said some 5,200 of the agency's 6,200 programs have been eliminated.",
    "link": "https://time.com/7266323/rubio-usaid-purge-ending-trump-administration/",
    "timestamp": "2025-03-10T12:48:00Z"
  },
  {
    "title": "The White House line on Canada and fentanyl takes a bizarre turn",
    "description": "As a rule, it’s unsettling when U.S. officials claim to have secret evidence of foreign chemical labs. Take Kevin Hassett’s claims about Canada, for example.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-line-canada-fentanyl-takes-bizarre-turn-rcna195598",
    "timestamp": "2025-03-10T12:47:41Z"
  },
  {
    "title": "Trump rejects pleas from business for more clarity on tariffs: 'They always say that'",
    "description": "Trump and his aides warned amid the tariff controversy that Americans could be in store for some temporary economic strain — including higher prices.",
    "link": "https://www.cnbc.com/2025/03/10/trump-greater-tariff-and-trade-clarity-is-what-all-ceos-always-want.html",
    "timestamp": "2025-03-10T12:47:28Z"
  },
  {
    "title": "Your Guide To The Lawsuits Challenging A President’s Power To Fire Executive Officials",
    "description": "Since President Donald Trump reclaimed the executive branch in January, more than 50 lawsuits have been filed to halt his America-first efforts.",
    "link": "https://thefederalist.com/2025/03/10/your-guide-to-the-lawsuits-challenging-a-presidents-power-to-fire-executive-officials/",
    "timestamp": "2025-03-10T12:46:30Z"
  },
  {
    "title": "Ukraine to propose sky, sea truce at US talks in Saudi: official",
    "description": "<p>KYIV (UKRAINE) - Kyiv will propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia this week, a Ukrainian official told AFP on Monday as President Volodymyr Zelensky was due to arrive in the kingdom.</p>",
    "link": "https://www.bangkokpost.com/world/2976916/ukraine-to-propose-sky-sea-truce-at-us-talks-in-saudi-official",
    "timestamp": "2025-03-10T12:45:00Z"
  },
  {
    "title": "Canada Official Issues Trump Recession Warning As Electricity Tariffs Start",
    "description": "Ontario Premier Doug Ford has warned that US President Donald Trump is going to cause a recession.",
    "link": "https://www.newsweek.com/canada-trump-recession-warning-doug-ford-2042060",
    "timestamp": "2025-03-10T12:43:11Z"
  },
  {
    "title": "Sec. of State Rubio says purge of USAID programs complete, 83% of programs gone",
    "description": "Secretary of State Marco Rubio is signaling that the Trump administration has finished its six-week dismantling of the six-decade-old U.S. Agency for International Development",
    "link": "https://abcnews.go.com/US/wireStory/secretary-state-rubio-purge-usaid-programs-complete-83-119628492",
    "timestamp": "2025-03-10T12:43:00Z"
  },
  {
    "title": "Bitcoin falls below $83,000 as Trump's pro-crypto push fails to impress and recession fears grow",
    "description": "Bitcoin tumbled as low as $80,000 on Sunday, slightly bouncing back before hitting a new low this year, as fears of a recession loom.Read more...",
    "link": "https://qz.com/bitcoin-crypto-price-trump-strategic-reserve-recession-1851768749",
    "timestamp": "2025-03-10T12:43:00Z"
  },
  {
    "title": "Poland's Prime Minister Aims Dig at Elon Musk, Rubio in Starlink Dispute",
    "description": "Starlink is \"the backbone of the Ukrainian army,\" Musk said in a post to social media.",
    "link": "https://www.newsweek.com/poland-donald-tusk-radoslaw-sikorski-elon-musk-marco-rubio-ukraine-starlink-2042034",
    "timestamp": "2025-03-10T12:41:18Z"
  },
  {
    "title": "Nvidia, Tesla, Oracle, Palantir, Coinbase, Doordash: Stocks to watch today",
    "description": "Stock futures fell Monday morning amid growing concerns about U.S. economic growth. President Donald Trump declined to rule out a recession this year in an interview on Fox News, but said he expects a “period” of transition from the policy changes he’s making…",
    "link": "https://qz.com/nvidia-tesla-oracle-palantir-coinbase-doordash-stocks-1851768723",
    "timestamp": "2025-03-10T12:41:00Z"
  },
  {
    "title": "'Canada is not a given' says Trudeau in farewell speech touching on Trump threats",
    "description": "Prime Minister Justin Trudeau said that freedom, democracy and Canada \"are not a given\" in his farewell speech to Liberals just before former Bank of Canada governor Mark Carney was announced as the new Liberal leader.",
    "link": "https://www.nationalobserver.com/2025/03/10/news/canada-trudeau-farewell-trump-threats",
    "timestamp": "2025-03-10T12:40:48Z"
  },
  {
    "title": "'They are really mad!' CNN host stunned at Canadian fury at Trump",
    "description": "CNN's Sara Sidner reacted to a fiery speech by Canada's next prime minister, Mark Carney, who vowed a robust response to Donald Trump's trade war and annexation threats.The 59-year-old Carney will take over for Justin Trudeau after winning the race to lead th…",
    "link": "https://www.rawstory.com/mark-carney-canada/",
    "timestamp": "2025-03-10T12:40:39Z"
  },
  {
    "title": "Arab Nations Back Egypt’s $53 Billion Gaza Reconstruction Plan (proof: Art of the Deal. Again)",
    "description": "[Manama] Officials from Arab nations approved Egypt’s $53 billion plan to rebuild Gaza on Tuesday. The plan, which Egyptian President Abdel Fattah el-Sisi presented at the extraordinary summit in Cairo, aims to provide an alternative to US President Donald Tr…",
    "link": "https://freerepublic.com/focus/f-news/4303287/posts",
    "timestamp": "2025-03-10T12:40:39Z"
  },
  {
    "title": "What Happened To Khalid Sheikh Mohammed (AKA Mukhtar): Is He Still Alive?",
    "description": "Netflix has released American Manhunt: Osama bin Laden. A key figure in the 9/11 plot, Khalid Sheikh Mohammed, is still detained at Guantánamo.",
    "link": "https://screenrant.com/what-happened-to-khalid-sheikh-mohammed-mukhtar-alive/",
    "timestamp": "2025-03-10T12:40:13Z"
  },
  {
    "title": "Dow Jones Futures Tumble 500 Points On Trump Comments; Nvidia, Tesla Slide",
    "description": "The Dow Jones Industrial Average and other major stock futures traded sharply lower Monday, as President Donald Trump failed to rule out a recession. Meanwhile, Nvidia (NVDA) and Tesla (TSLA) sold off in premarket action on the stock market today. Early Monda…",
    "link": "https://biztoc.com/x/231b7634a100c242",
    "timestamp": "2025-03-10T12:39:54Z"
  },
  {
    "title": "Four US Groups Seeking to Buy TikTok, Trump Says",
    "description": "Four different groups are seeking to take over TikTok, the social media giant owned by China’s Bytedance, according to US President Donald Trump.\nTrump said his administration is in contact with the different groups about the sale of the social media platform…",
    "link": "https://biztoc.com/x/286b81b1835ff043",
    "timestamp": "2025-03-10T12:39:43Z"
  },
  {
    "title": "China Hits Its Largest US Import, Soybeans, With Tariffs Along With Other Agricultural Products: Here's A List Of Stocks, ETFs That Could Be Impacted",
    "description": "After President Donald Trump imposed an additional 10% levy on Chinese imports, China has retaliated with tariffs on major agricultural imports from the U.S. Many agricultural product manufacturers, suppliers, and related businesses are likely to be impacted …",
    "link": "https://biztoc.com/x/147aa006e0370985",
    "timestamp": "2025-03-10T12:39:33Z"
  },
  {
    "title": "Mahmoud Khalil: ICE Detains Green Card Holder over Columbia University Gaza Activism",
    "description": "Immigration agents with the Department of Homeland Security have detained a leader of the Gaza solidarity encampment at Columbia University in New York. Mahmoud Khalil, who is an Algerian citizen of Palestinian descent, is a green card holder and is married t…",
    "link": "https://www.democracynow.org/2025/3/10/columbia_university_mahmoud_khalil",
    "timestamp": "2025-03-10T12:38:56Z"
  },
  {
    "title": "Mark Carney chosen as next PM after resounding victory in Liberal leadership race",
    "description": "It's not clear when Carney will be sworn in as prime minister. After the Liberal event, hundreds of his supporters attended a victory party at an Ottawa venue, where Carney encouraged the crowd to party tonight, then get to work tomorrow.",
    "link": "https://www.nationalobserver.com/2025/03/09/news/mark-carney-pm-victory-liberal-leadership-race",
    "timestamp": "2025-03-10T12:38:11Z"
  },
  {
    "title": "Trump: Four different groups in talks to buy TikTok",
    "description": "US President Donald Trump announced that there are four different groups interested in buying the US TikTok operations. His administration did not disclose the identities of those behind the groups, but the 47th president confirmed that \"all four are good\" wh…",
    "link": "https://www.gsmarena.com/trump_four_different_groups_in_talks_to_buy_tiktok-news-66870.php",
    "timestamp": "2025-03-10T12:38:02Z"
  },
  {
    "title": "Madonna Says Transgenders Face a 'Lynch Mob Mentality': 'It Breaks My Heart'",
    "description": "Pop singer Madonna said that transgenders have faced a \"lynch mob mentality\" in this country since the rise of President Donald Trump.",
    "link": "https://www.breitbart.com/entertainment/2025/03/10/madonna-says-transgenders-face-a-lynch-mob-mentality-it-breaks-my-heart/",
    "timestamp": "2025-03-10T12:36:23Z"
  },
  {
    "title": "What I Got Wrong About Trump’s Second Term",
    "description": "I didn’t entirely see this coming. Here’s why.",
    "link": "http://foreignpolicy.com/2025/03/10/walt-got-wrong-trump-second-term/",
    "timestamp": "2025-03-10T12:36:08Z"
  },
  {
    "title": "Secretary of State Rubio says purge of USAID programs complete, with 83% of agency’s programs gone",
    "description": "The purge has marked a dramatic shift from decades of U.S. policy linking foreign aid to U.S. national security.",
    "link": "https://www.denverpost.com/2025/03/10/trump-foreign-aid-usaid-rubio/",
    "timestamp": "2025-03-10T12:35:56Z"
  },
  {
    "title": "Secretary of State Rubio says purge of USAID programs complete, with 83% of agency’s programs gone",
    "description": "The purge has marked a dramatic shift from decades of U.S. policy linking foreign aid to U.S. national security.",
    "link": "https://www.bostonherald.com/2025/03/10/trump-foreign-aid-usaid-rubio/",
    "timestamp": "2025-03-10T12:35:56Z"
  },
  {
    "title": "Meet the federal worker who went rogue: ‘I hope that it lights a fire under people’",
    "description": "To billionaire Elon Musk and his cost-cutting team at the Department of Government Efficiency, Karen Ortiz may just be one of many faceless bureaucrats.",
    "link": "https://www.local10.com/news/politics/2025/03/10/meet-the-federal-worker-who-went-rogue-i-hope-that-it-lights-a-fire-under-people/",
    "timestamp": "2025-03-10T12:35:34Z"
  },
  {
    "title": "Trump is shredding the First Amendment under the guise of \"national security\" (Nicole Narea/Vox)",
    "description": "Nicole Narea / Vox:\nTrump is shredding the First Amendment under the guise of “national security”  —  President Donald Trump is going after a pair of major law firms — and attacking the First Amendment in the process.  —  Trump issued an executive order on Th…",
    "link": "https://www.memeorandum.com/250310/p17",
    "timestamp": "2025-03-10T12:35:02Z"
  },
  {
    "title": "Trump: TikTok Has Interest From 4 Potential Buyers",
    "description": "The White House is reportedly in talks with four different potential buyers for TikTok. Speaking to reporters Sunday (March 9) on Air Force One, President Donald Trump said his administration has held discussions with these groups about purchasing the popular…",
    "link": "https://www.pymnts.com/acquisitions/2025/trump-tiktok-has-interest-from-4-potential-buyers/",
    "timestamp": "2025-03-10T12:33:39Z"
  },
  {
    "title": "Hundreds rally at Parliament Hill against U.S. threats to make Canada the 51st state",
    "description": "Hundreds of people gathered on Parliament Hill on Sunday for the \"Elbows up, Canada\" rally as U.S. President Donald Trump threatens economywide tariffs and making the country into the 51st state.",
    "link": "https://www.nationalobserver.com/2025/03/09/news/hundreds-rally-parliament-hill-us-threats-canada-51st-state",
    "timestamp": "2025-03-10T12:33:39Z"
  },
  {
    "title": "Crew of 5 injured after plane crashes into retirement community near Lancaster Airport - WGME",
    "description": "Crew of 5 injured after plane crashes into retirement community near Lancaster AirportWGME Plane With 5 Aboard Crashes in Lancaster County, Pa.The New York Times President Donald Trump asked about Lancaster plane crashWGAL Susquehanna Valley Pa. 5 injured aft…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176665989",
    "timestamp": "2025-03-10T12:33:01Z"
  },
  {
    "title": "Musk spat renews opposition in Italy to Starlink deal",
    "description": "Italian opposition parties stepped up criticism Monday of a proposed deal between the government and SpaceX’s Starlink following founder Elon Musk’s suggestion he could cut Ukraine from the satellite network. Prime Minister Giorgia Meloni’s hard-right governm…",
    "link": "https://www.digitaljournal.com/world/musk-spat-renews-opposition-in-italy-to-starlink-deal/article",
    "timestamp": "2025-03-10T12:32:33Z"
  },
  {
    "title": "RansomHouse gang claims the hack of the Loretto Hospital in Chicago",
    "description": "Another American hospital falls victim to a ransomware attack; the RansomHouse gang announced the hack of Loretto Hospital in Chicago.” The RansomHouse gang announced the hack of Loretto Hospital in Chicago, the groups claims to have stolen 1.5TB of sensitive…",
    "link": "https://securityaffairs.com/175187/cyber-crime/ransomhouse-gang-claims-the-hack-of-the-loretto-hospital-in-chicago.html",
    "timestamp": "2025-03-10T12:32:22Z"
  },
  {
    "title": "Charles Barkley defends Trump ally Wayne Gretzky and calls out 'fools up in Canada'",
    "description": "Former NBA legend and current analyst Charles Barkley has stepped forward to defend Wayne Gretzky from some recent criticism.\r\nGretzky has been feeling the heat from some Canadians as of late following his support of his friend and U.S. president Donald Trump…",
    "link": "https://dailyhive.com/toronto/charles-barkley-defends-wayne-gretzky",
    "timestamp": "2025-03-10T12:31:55Z"
  },
  {
    "title": "US Air Force Forced to Scramble F-16s Again After Two Aircraft Violates Airspace Near Trump’s Mar-a-Lago",
    "description": "In a troubling trend, U.S. Air Force F-16s were deployed twice in 48 hours to intercept civilian aircraft breaching restricted airspace near Trump’s Mar-a-Lago. The implications for national security are significant.\nThe post US Air Force Forced to Scramble F…",
    "link": "https://www.thegatewaypundit.com/2025/03/us-air-force-forced-scramble-f-16s-again/",
    "timestamp": "2025-03-10T12:30:17Z"
  },
  {
    "title": "Putin’s Puppy Love",
    "description": "Leonard Stokes\n\nTrump sells out Ukraine and the United States.\nThe post Putin’s Puppy Love appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/putins-puppy-love/",
    "timestamp": "2025-03-10T12:30:14Z"
  },
  {
    "title": "'Stop this nonsense': message from former prime minister Jean Chrétien to Trump",
    "description": "Moments before the new Liberal leader was announced on Sunday, former prime minister Jean Chrétien took to the stage to reprimand U.S. President Donald Trump over tariffs and threats to Canada's sovereignty.",
    "link": "https://www.nationalobserver.com/2025/03/09/news/former-prime-minister-jean-chretien-trump",
    "timestamp": "2025-03-10T12:29:04Z"
  },
  {
    "title": "US stock futures drop after Trump says he won’t rule out a recession",
    "description": "US stock futures fell Monday after President Donald Trump said the US economy would see “a period of transition” and refused to rule out a recession, in an interview that aired Sunday.\nWhen asked on Fox News’ “Sunday Morning Futures With Maria Bartiromo” if h…",
    "link": "https://biztoc.com/x/c4f082e786aadc28",
    "timestamp": "2025-03-10T12:28:53Z"
  },
  {
    "title": "Asked about a possible recession, Trump offers a discouraging answer",
    "description": "“Are you expecting a recession this year?” Donald Trump responded to the question with a great many words. None of them was “no.”",
    "link": "https://biztoc.com/x/0c146f4ca62b0203",
    "timestamp": "2025-03-10T12:28:16Z"
  },
  {
    "title": "'A big mess internally' as Elon Musk's DOGE team scrambles for 'wins': report",
    "description": "Increasing skepticism, growing Republican pushback and a string of embarrassing claims that swiftly fell apart have Elon Musk and his team at the Department of Government Efficiency (DOGE) scrambling to post some wins that don't fall apart so they can move on…",
    "link": "https://www.rawstory.com/musk-doge-mess/",
    "timestamp": "2025-03-10T12:26:58Z"
  },
  {
    "title": "Britain’s Abusive New Relationship With America",
    "description": "Keir Starmer is getting used to his very uncomfortable role in Donald Trump’s world.",
    "link": "http://foreignpolicy.com/2025/03/10/britain-special-relationship-starmer-trump-abusive/",
    "timestamp": "2025-03-10T12:26:34Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wcvb.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:25:56Z"
  },
  {
    "title": "US added to international watchlist for rapid decline in civic freedoms - NewsBreak",
    "description": "Civicus, an international non-profit, puts country alongside Democratic Republic of Congo, Italy, Pakistan and Serbia",
    "link": "https://www.newsbreak.com/share/3848325297451-us-added-to-international-watchlist-for-rapid-decline-in-civic-freedoms?s=a2&amp;share_destination_id=MTYzMDg5Mjg3LTE3NDE2MDk0MTk5OTU%3D&amp;pd=0B2IyNLo&amp;hl=en_US&amp;send_time=1741609419&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v1%2Cns_foryou_model_exp_25q1-control%2Cns_local_strategy_25q1_exp-v15%2Cns_foryou_blend_exp_25q1-v4",
    "timestamp": "2025-03-10T12:25:14Z"
  },
  {
    "title": "Listen: Air traffic control audio captures final moments leading up to Manheim Township plane crash",
    "description": "Air traffic control audio captured the final moments leading up to a plane carrying five passengers crashing in the parking lot of Brethren Village in Manheim Township on Sunday.",
    "link": "https://lancasteronline.com/news/local/listen-air-traffic-control-audio-captures-final-moments-leading-up-to-manheim-township-plane-crash/article_b85f1370-fda7-11ef-a22b-f3628b513a1c.html",
    "timestamp": "2025-03-10T12:25:00Z"
  },
  {
    "title": "Ukraine to propose sky and sea ceasefire at Saudi talks with US: Kyiv official",
    "description": "KYIV: Kyiv will propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia on Tuesday (Mar 11), a Ukrainian official told AFP on Monday. Ukrainian Pr",
    "link": "https://www.channelnewsasia.com/world/ukraine-propose-sky-sea-ceasefire-russia-saudi-talks-us-4990626",
    "timestamp": "2025-03-10T12:24:48Z"
  },
  {
    "title": "Canada's next PM Mark Carney vows to 'win' US trade war",
    "description": "Canada's incoming prime minister Mark Carney vowed to fight against US President Donald Trump's trade war, stating that Canada will never be part of the United States. Carney emphasized the need to stand up for Canadian sovereignty and resources while prepari…",
    "link": "https://economictimes.indiatimes.com/news/international/business/canadas-next-pm-mark-carney-vows-to-win-us-trade-war/articleshow/118846966.cms",
    "timestamp": "2025-03-10T12:24:38Z"
  },
  {
    "title": "Forbes Daily: Markets Rattled, But Trump Remains Resolute On Tariffs",
    "description": "Today’s Forbes Daily covers reactions to trade uncertainty, new leadership in Canada, the latest jobs numbers, Kettle & Fire’s $100M bone broth business and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/03/10/forbes-daily-markets-rattled-but-trump-remains-resolute-on-tariffs/",
    "timestamp": "2025-03-10T12:24:04Z"
  },
  {
    "title": "Young people who aspired to government service dismayed by end of fellows program",
    "description": "Young people who aspired to federal government service are dismayed by President Donald Trump ending a program created to entice highly qualified workers to join the government",
    "link": "https://abcnews.go.com/US/wireStory/young-people-aspired-government-service-dismayed-trump-ending-119628081",
    "timestamp": "2025-03-10T12:23:59Z"
  },
  {
    "title": "Pakistan to Explore Blockchain for Multibillion Dollar Remittances From Abroad: Adviser",
    "description": "Blockchain technology could help improve the speed and lower the cost of cash transfers from migrant workers, Bilal bin Saqib said in an interview.",
    "link": "https://www.coindesk.com/tech/2025/03/10/pakistan-to-explore-blockchain-for-multibillion-dollar-remittances-from-abroad",
    "timestamp": "2025-03-10T12:23:21Z"
  },
  {
    "title": "When UK would deploy nuclear weapons as Donald Trump makes chilling claim about 'greatest threat to humanity'",
    "description": "Here is how the UK would deploy its nuclear weapons as US President Donald Trump calls nuclear war the 'greatest threat to humanity' in new interview.",
    "link": "https://www.ladbible.com/news/uk-news/how-uk-would-deploy-nuclear-weapons-trident-809838-20250310",
    "timestamp": "2025-03-10T12:22:47Z"
  },
  {
    "title": "Ukraine To Propose Sky, Sea Truce At US Talks In Saudi: Official",
    "description": "Kyiv will propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia this week, a Ukrainian official told AFP on Monday as President Volodymyr Zelensky was due to arrive in the kingdom.",
    "link": "https://www.ibtimes.com.au/ukraine-propose-sky-sea-truce-us-talks-saudi-official-1856752",
    "timestamp": "2025-03-10T12:21:11Z"
  },
  {
    "title": "Ukraine To Propose Sky, Sea Truce At US Talks In Saudi: Official",
    "description": "Kyiv will propose an aerial and naval ceasefire with Russia during talks with US officials in Saudi Arabia this week, a Ukrainian official told AFP on Monday as President Volodymyr Zelensky was due to arrive in the kingdom.",
    "link": "https://www.ibtimes.com/ukraine-propose-sky-sea-truce-us-talks-saudi-official-3765792",
    "timestamp": "2025-03-10T12:21:07Z"
  },
  {
    "title": "US stocks drop after Trump says he won’t rule out a recession | CNN Business",
    "description": "US stocks opened sharply lower Monday after President Donald Trump said the US economy would see “a period of transition” and refused to rule out a recession, in an interview that aired Sunday.",
    "link": "https://www.cnn.com/2025/03/10/investing/us-stocks-drop-after-trump-says-he-wont-rule-out-a-recession/index.html",
    "timestamp": "2025-03-10T12:20:35Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wgal.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:20:26Z"
  },
  {
    "title": "Rubio heads to Saudi Arabia for US-Ukraine talks, then Canada for G7 (Nike Ching/Voice of America)",
    "description": "Nike Ching / Voice of America:\nRubio heads to Saudi Arabia for US-Ukraine talks, then Canada for G7  —  U.S. Secretary of State Marco Rubio will arrive in Jeddah, Saudi Arabia, on Monday for U.S.-Ukraine talks as President Donald Trump pushes to broker a swif…",
    "link": "https://www.memeorandum.com/250310/p15",
    "timestamp": "2025-03-10T12:20:00Z"
  },
  {
    "title": "Release Mahmoud Khalil Petition Gets Nearly 800,000 Signatures",
    "description": "\"We will vigorously be pursuing Mahmoud's rights in court,\" Khalil's attorney said in a statement.",
    "link": "https://www.newsweek.com/mahmoud-khalil-ice-arrest-palestinian-petition-2042067",
    "timestamp": "2025-03-10T12:19:40Z"
  },
  {
    "title": "M&A Advisory Firm JEGI Clarity Merges With Leonis Partners, Forming JCL",
    "description": "The merger and acquisition advisory firms JEGI Clarity and Leonis Partners announced a merger on Monday, creating a combined company whose area of expertise includes media, marketing, information, software, fintech, and technology. The newly minted company, w…",
    "link": "https://www.adweek.com/media/jegi-clarity-leonis-partners-merger/",
    "timestamp": "2025-03-10T12:19:02Z"
  },
  {
    "title": "Ex-CNN boss Jeff Zucker won’t join Paramount after Skydance merger — ‘no room’ for ‘larger-than-life’ exec: sources",
    "description": "“There’s legitimately no role for Jeff, “a source with knowledge said, citing a slew of execs that have been rumored to be tapped to join the combined company.",
    "link": "https://nypost.com/2025/03/10/media/ex-cnn-boss-jeff-zucker-wont-join-paramount-after-skydance-merger-sources/",
    "timestamp": "2025-03-10T12:18:50Z"
  },
  {
    "title": "Canada's next prime minister Mark Carney has managed the financial crisis, Brexit and now Trump's trade war",
    "description": "Mark Carney, former head of the Bank of Canada and Bank of England, will become Canada's next prime minister following a significant victory in the Liberal Party leadership election. Carney, succeeding Justin Trudeau, faces the challenge of addressing a loomi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/canadas-next-prime-minister-mark-carney-has-managed-the-financial-crisis-brexit-and-now-trumps-trade-war/articleshow/118846738.cms",
    "timestamp": "2025-03-10T12:18:12Z"
  },
  {
    "title": "'Send Musk to Mars': As Tesla protests intensify, Elon's 'reminder' video gains traction online. Watch here",
    "description": "Protests at Tesla showrooms worldwide are intensifying due to CEO Elon Musk's ties with the Trump administration's DOGE and his controversial actions. Demonstrators are challenging Musk's stance on environmental and labor policies, with many Tesla owners expr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-tesla-protests-send-musk-to-mars-as-tesla-protests-intensify-elons-reminder-video-gains-traction-online-watch-here/articleshow/118846539.cms",
    "timestamp": "2025-03-10T12:18:09Z"
  },
  {
    "title": "Ukrainian Refugee Asks Donald Trump for Green Card",
    "description": "Ukrainian refugee Serhii Denisov told Newsweek Trump should grant green cards to Ukrainians under Temporary Protected Status.",
    "link": "https://biztoc.com/x/253cb773c0f29f34",
    "timestamp": "2025-03-10T12:17:24Z"
  },
  {
    "title": "Malibu, Hit by Fires, Now Hit by Earthquakes as Well",
    "description": "Malibu, California, which was burned by the Franklin Fire in December and the Palisades Fire in January, suffered a 4.1-magnitude earthquake on Sunday -- and is apparently facing a series of similar small earthquakes in the future.\nThe post Malibu, Hit by Fir…",
    "link": "https://www.breitbart.com/politics/2025/03/10/malibu-hit-by-fires-now-hit-by-earthquakes-as-well/",
    "timestamp": "2025-03-10T12:17:03Z"
  },
  {
    "title": "The Dow tanks as Trump won't rule out a recession. Nvidia and Tesla stock take a hit",
    "description": "Stock futures fell on Monday as Wall Street’s fears tied to President Donald Trump’s tariffs continue to pressure the market and investors wait for new economic data.Read more...",
    "link": "https://qz.com/stocks-djia-sp500-nasdaq-trump-recession-tesla-nvidia-1851768746",
    "timestamp": "2025-03-10T12:15:00Z"
  },
  {
    "title": "Trump Lashes Out At Reporter On Air Force One After Triggering Putin Question",
    "description": "Trump was triggered by Washington Post correspondent Michael Birnbaum when he asked a pointed question about Russian President Vladimir Putin.\nThe post Trump Lashes Out At Reporter On Air Force One After Triggering Putin Question first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-lashes-out-at-reporter-on-air-force-one-after-triggering-putin-question/",
    "timestamp": "2025-03-10T12:14:35Z"
  },
  {
    "title": "Romania: Georgeskou appeals to the Constitutional Court against the rejection of his candidacy",
    "description": "Georgesku submitted his candidacy for the May presidential run-off election on Friday - Yesterday, the Romanian Central Electoral Authority announced on Sunday that it had decided to reject the candidacy\nThe post Romania: Georgeskou appeals to the Constitutio…",
    "link": "https://en.protothema.gr/2025/03/10/romania-georgeskou-appeals-to-the-constitutional-court-against-the-rejection-of-his-candidacy/",
    "timestamp": "2025-03-10T12:14:00Z"
  },
  {
    "title": "Donald Trump loves Gilded Age tariffs. Great time for rich but not for many",
    "description": "President Trump idealizes the Gilded Age, emphasizing high tariffs and low interest rates to stimulate the economy. He praises President McKinley's tariff policies, despite experts noting the era's inequality and corruption. Trump's tariff strategies aim to b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-loves-gilded-age-tariffs-great-time-for-rich-but-not-for-many/articleshow/118846538.cms",
    "timestamp": "2025-03-10T12:12:57Z"
  },
  {
    "title": "Musk Spat Renews Opposition In Italy To Starlink Deal",
    "description": "Italian opposition parties stepped up criticism Monday of a proposed deal between the government and SpaceX's Starlink following founder Elon Musk's suggestion he could cut Ukraine from the satellite network.",
    "link": "https://www.ibtimes.com/musk-spat-renews-opposition-italy-starlink-deal-3765788",
    "timestamp": "2025-03-10T12:12:08Z"
  },
  {
    "title": "Trump Loves The Gilded Age And Its Tariffs. It Was Great For The Rich But Not For The Many.",
    "description": "In Trump's idealized framing, America was at its zenith when top hats and shirtwaists were fashionable and typhoid fever often killed more soldiers than combat.",
    "link": "https://www.huffpost.com/entry/donald-trump-gilded-age-tariffs_n_67ced4cbe4b0d416d844e7fb",
    "timestamp": "2025-03-10T12:12:01Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wmur.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:26Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.ksbw.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:25Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.kmbc.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:17Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wxii12.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:10Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wlky.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:10Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wbaltv.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:09Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.kcra.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:04Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.wmtw.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:02Z"
  },
  {
    "title": "Trump administration offering public health workers $25k buyout",
    "description": "The Department of Health and Human Services is offering $25,000 buyouts to some 80,000 employees as part of the Trump administration's effort to slash the federal workforce.",
    "link": "https://www.ketv.com/article/trump-administration-offers-public-health-workers-buyout/64122845",
    "timestamp": "2025-03-10T12:11:02Z"
  }
]