[
  {
    "title": "CNBC Daily Open: Countries want to strike deals with U.S. — but are also making them without it",
    "description": "They may be bridges being built in the aftermath of Trump tariffs. But those connections could bypass the U.S. — which, according to Trump, does not need deals.",
    "link": "https://www.cnbc.com/2025/05/07/cnbc-daily-open-countries-are-making-deals-without-the-us.html",
    "timestamp": "2025-05-07T06:30:01Z"
  },
  {
    "title": "Whoopi Goldberg lashes out at Trump’s Hollywood tariffs",
    "description": "Goldberg noted 'it’s been very expensive to shoot in California' while explaining why movies are sometimes shot outside US.",
    "link": "https://nypost.com/2025/05/07/us-news/whoopi-goldberg-lashes-out-at-trumps-hollywood-tariffs/",
    "timestamp": "2025-05-07T06:27:09Z"
  },
  {
    "title": "Stephen Colbert Spots Reason For Trump's Unexpected New Fixation",
    "description": "The \"Late Show\" host mocked the president for the place he seemed to get his latest idea from.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-alcatraz_n_681ae658e4b0c2b15d96bcad",
    "timestamp": "2025-05-07T06:26:46Z"
  },
  {
    "title": "Israeli strikes on Yemen’s capital killed at least seven, say Houthi rebels",
    "description": "Airstrikes came in response to a Houthi missile striking grounds of Ben-Gurion International Airport near Tel Aviv",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/07/israeli-strikes-on-yemens-capital-killed-at-least-seven-say-houthi-rebels/",
    "timestamp": "2025-05-07T06:18:30Z"
  },
  {
    "title": "Iran's cautious game: Balancing US nuclear talks, Yemen policy",
    "description": "Iran wants a deal with the US, and it wants to have amicable relations with Europe today.",
    "link": "https://www.jpost.com/middle-east/article-852967",
    "timestamp": "2025-05-07T06:14:03Z"
  },
  {
    "title": "Operation Sindoor explained: Strikes, targets, and the message to Pakistan",
    "description": "In a strong retaliatory move, India launched Operation Sindoor targeting nine terror camps across Pakistan and Pakistan-occupied Kashmir (PoK). The action follows the devastating terror attack in Pahalgam, which claimed 26 civilian lives. The operation signal…",
    "link": "https://m.economictimes.com/news/india/operation-sindoor-explained-strikes-targets-and-the-message-to-pakistan/india-strikes-back-launch-of-operation-sindoor/slideshow/120954693.cms",
    "timestamp": "2025-05-07T06:14:00Z"
  },
  {
    "title": "Metaplanet Buys More Bitcoin Amid Easing US-China Trade Tensions",
    "description": "Metaplanet’s latest Bitcoin buy comes as Beijing and Washington signal a tentative return to trade talks following a rocky period for crypto.",
    "link": "https://decrypt.co/318289/metaplanet-buys-bitcoin-easing-us-china-trade-tensions",
    "timestamp": "2025-05-07T06:12:07Z"
  },
  {
    "title": "Explainer: Violence in disputed Kashmir has long risked an all-out war between India and Pakistan",
    "description": "There were 26 people killed in an attack in a popular tourist destination.",
    "link": "https://www.thejournal.ie/explainer-kashmir-6685226-May2025/",
    "timestamp": "2025-05-07T06:12:00Z"
  },
  {
    "title": "Europe trades mixed premarket ahead of Fed, data",
    "description": "Major European stock markets traded mixed during premarket hours on Wednesday ahead of the United States Federal Reserve's first monetary policy decision after US President Donald Trump announced his ...",
    "link": "https://biztoc.com/x/173303169f3366ed",
    "timestamp": "2025-05-07T06:11:49Z"
  },
  {
    "title": "Joe Biden accuses Donald Trump of ‘modern-day appeasement’ towards Russia",
    "description": "Former  president claims successor risks causing a breakdown of US-Europe relations",
    "link": "https://www.irishtimes.com/world/us/2025/05/07/biden-accuses-trump-of-modern-day-appeasement-towards-russia/",
    "timestamp": "2025-05-07T06:08:13Z"
  },
  {
    "title": "Israel strikes school sheltering displaced as plan for Gaza draws global criticism",
    "description": "Gaza's civil defense agency said Wednesday that Israeli strikes on a school sheltering displaced people in the war-ravaged Palestinian territory killed 31 people and wounded dozens, with Israel saying it had targeted Hamas militants.",
    "link": "https://www.hurriyetdailynews.com/israel-strikes-school-sheltering-displaced-as-plan-for-gaza-draws-global-criticism-208891",
    "timestamp": "2025-05-07T06:02:57Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.wcjb.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T06:00:42Z"
  },
  {
    "title": "Operation Sindoor: The IAF has struck terror camps in Pakistan",
    "description": "India launched military strikes last night at terror infrastructure in Pakistan and Pakistan-occupied Kashmir. The Pakistani military spokesperson has said Islamabad would respond but global calls for restraint need to be heeded.",
    "link": "https://www.livemint.com/opinion/online-views/operation-sindoor-indian-air-force-pakistan-occupied-kashmir-ajit-doval-marco-rubio-khawaja-asif-muzaffarabad-ispr-ahmed-11746596963868.html",
    "timestamp": "2025-05-07T06:00:06Z"
  },
  {
    "title": "Where Brands’ DEI Pledges Stand 5 Years After George Floyd",
    "description": "Names like Target and Starbucks made big DEI commitments in 2020. Here’s what they look like in 2025.",
    "link": "https://www.adweek.com/brand-marketing/brands-dei-pledges-five-years-after-george-floyd/",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Trump Energy Department halts $400B Biden-era green energy loans",
    "description": "The Trump administration has canceled billions in renewable energy loans and grants, targeting the Energy Department’s Loan Programs Office (LPO), which funded clean-energy projects under Biden. Energy Secretary Chris Wright criticizes past approvals but vows…",
    "link": "https://www.naturalnews.com/2025-05-07-trump-doe-halts-biden-green-energy-loans.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Trump halts U.S. funding for dangerous gain-of-function research in China tied to COVID origins",
    "description": "President Trump signed an executive order banning federal funding for gain-of-function research in poorly regulated countries like China, citing risks to public health and national security. The order follows evidence linking U.S.-backed research at the Wuhan…",
    "link": "https://www.naturalnews.com/2025-05-07-trump-funding-gain-of-function-covid.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Apple to shift iPhone production to India by 2026 amid U.S.-China trade war",
    "description": "Apple plans to move iPhone production from China to India, aiming to source all U.S.-sold iPhones from India by 2026. This is in response to U.S.-China trade tensions and high tariffs on Chinese imports. U.S. tariffs (up to 145% on Chinese goods) and geopolit…",
    "link": "https://www.naturalnews.com/2025-05-07-apple-shift-iphone-production-to-india-2026.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "China’s tariff evasion tactics could mean CHEAPER goods for American consumers",
    "description": "Chinese exporters evade tariffs by rerouting goods through third countries (e.g., Malaysia, Vietnam, South Korea) and relabeling them to hide their origin, bypassing U.S. duties. “Origin washing” exploits trade loopholes, where minor modifications in intermed…",
    "link": "https://www.naturalnews.com/2025-05-07-china-tariff-evasion-tactics-cheaper-goods-consumers.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Global tensions Soar as India-Pakistan strikes risk nuclear crisis and U.S.-Houthi truce splits allies",
    "description": "India-Pakistan conflict escalates – India conducted missile and airstrikes on Pakistan, claiming to target terrorist camps, while Pakistan warned of retaliation, raising nuclear war fears between the two rivals. Risk of catastrophic fallout – Analysts warn fu…",
    "link": "https://www.naturalnews.com/2025-05-07-india-pakistan-strikes-risk-nuclear-crisis-and-us-houthi-truce-splits-allies.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Trump ends Yemen strikes as Houthis â\u0080\u009ccapitulateâ\u0080\u009d, but rebels vow to keep fighting Israel",
    "description": "President Trump announced an immediate halt to U.S. airstrikes against Yemen’s Houthis, claiming they had surrendered, but Houthi leaders denied capitulation and vowed to keep fighting Israel. The ceasefire, brokered by Oman, only prevents U.S.-Houthi clashes…",
    "link": "https://www.naturalnews.com/2025-05-07-trump-ends-yemen-strikes-houthis-capitulate.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Nuclear neighbors at war: India strikes Pakistan, fighter jets shot down as Kashmir crisis spirals",
    "description": "India and Pakistan engaged in cross-border airstrikes over Kashmir, escalating tensions and raising global fears of an uncontrollable conflict. India conducted “Operation Sindoor,” targeting alleged terrorist camps in Pakistan in retaliation for a deadly atta…",
    "link": "https://www.naturalnews.com/2025-05-07-nuclear-war-india-pakistan-kashmir.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Oil production hike by OPEC+ nations triggers global market unrest, threatens U.S. energy dominance",
    "description": "OPEC+ member nations Saudi Arabia, Russia and Kazakhstan announced a tripling of oil production increases to 411,000 barrels per day (bpd) in June, causing crude prices to plummet to four-year lows. The move aims to discipline overproducing members (like Iraq…",
    "link": "https://www.naturalnews.com/2025-05-07-opec-oil-production-hike-triggers-market-unrest.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Trump’s defense of tariffs as economic strategy sparks debate over trade and consumer impact",
    "description": "President Trump defends tariffs as a corrective measure for U.S. trade imbalances, claiming they will “make us rich” by revitalizing domestic industries, reducing deficits, and lowering food prices, despite concerns about inflation and supply chain disruption…",
    "link": "https://www.naturalnews.com/2025-05-07-trump-defense-tariffs-economic-strategy-sparks-debate.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "Trump administration reaffirms: Gender-related procedures are CHILD ABUSE",
    "description": "The Trump administration labels gender transition procedures for minors as “child abuse” and vows to cut federal funding for schools promoting transgender ideology. The administration moves to halt taxpayer-funded medical interventions for minors with gender …",
    "link": "https://www.naturalnews.com/2025-05-07-trump-admin-reaffirms-gender-procedures-child-abuse.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "A pushback against green tyranny: Senate overturns strict Biden DOE regulations for home appliances",
    "description": "On April 30, the Senate voted 52-46 to repeal a controversial Department of Energy (DOE) rule that imposed stricter efficiency standards on household appliances, marking a victory for Republicans in their campaign against costly environmental regulations. The…",
    "link": "https://www.naturalnews.com/2025-05-07-senate-overturns-strict-doe-regulations-home-appliances.html",
    "timestamp": "2025-05-07T06:00:00Z"
  },
  {
    "title": "India Launches Missile Strikes Into Pakistan—Islamabad Calls It ‘Act Of War’ (Live Updates)",
    "description": "India claimed military strikes in Pakistan and the contested regions of Jammu and Kashmir targeted “terrorist infrastructure.”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/07/india-launches-missile-strikes-into-pakistan-islamabad-calls-it-act-of-war-live-updates/",
    "timestamp": "2025-05-07T05:59:14Z"
  },
  {
    "title": "BMW Earnings Drop on China Slump as Tariffs Cloud Outlook",
    "description": "BMW AG’s earnings plunged 23% in the first quarter as intense competition in China pushed sales in its biggest single market to a five-year low.",
    "link": "https://financialpost.com/pmn/business-pmn/bmw-earnings-drop-on-china-slump-as-tariffs-cloud-outlook",
    "timestamp": "2025-05-07T05:58:22Z"
  },
  {
    "title": "Liberal NGO Pushes for Harsher Venezuela Sanctions",
    "description": "It’s been over 100 days since Donald Trump’s return to the presidency. Most NGOs to the right of the Heritage Foundation are alarmed about his confrontational international posture and related erosion of the rule of law. Human Rights Watch (HRW), a supposedly…",
    "link": "https://www.counterpunch.org/2025/05/07/liberal-ngo-pushes-for-harsher-venezuela-sanctions/",
    "timestamp": "2025-05-07T05:56:40Z"
  },
  {
    "title": "America is becoming the world’s largest tax haven",
    "description": "Trump is turning the U.S. into a tax haven by weakening enforcement, deregulating crypto and abandoning international tax cooperation, favoring secrecy and the ultrarich.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/07/world/america-worlds-largest-tax-haven/",
    "timestamp": "2025-05-07T05:55:00Z"
  },
  {
    "title": "Why is an end to the war in Gaza so elusive?",
    "description": "After 19 months of conflict, the Israel-Hamas war persists due to irreconcilable demands. Israel aims to dismantle Hamas, while Hamas seeks a full Israeli withdrawal and end to the war. Political factors, including Netanyahu's coalition and Trump's support, f…",
    "link": "https://economictimes.indiatimes.com/news/defence/why-is-an-end-to-the-war-in-gaza-so-elusive/articleshow/120954241.cms",
    "timestamp": "2025-05-07T05:53:02Z"
  },
  {
    "title": "How world leaders are reacting to India-Pakistan military strikes",
    "description": "Nations call for restraint as India launches 'Operation Sindoor', attacking several sites in Pakistan.",
    "link": "https://www.aljazeera.com/news/2025/5/7/how-world-leaders-are-reacting-to-india-pakistan-military-strikes",
    "timestamp": "2025-05-07T05:49:59Z"
  },
  {
    "title": "Mark Carney said he's glad people couldn't tell what was going through his mind when he met Trump",
    "description": "\"I am glad you could not tell what was going through my mind,\" Canadian Prime Minister Mark Carney said of his meeting with President Donald Trump.\nAnna Moneymaker via Getty Images\nCanadian Prime Minister Mark Carney met President Donald Trump in the Oval Off…",
    "link": "https://biztoc.com/x/faa8c7219a64205c",
    "timestamp": "2025-05-07T05:49:23Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Wednesday",
    "description": "The new federal government has been sworn in with Friedrich Merz as Chancellor, Germany has become 'main driver of insolvencies' in Western Europe, Tesla sales continue to fall and more news on Wednesday.",
    "link": "https://www.thelocal.de/20250507/today-in-germany-a-roundup-of-the-latest-news-on-wednesday-69",
    "timestamp": "2025-05-07T05:49:22Z"
  },
  {
    "title": "Navigating the Trade Storm: China’s Strategic Moves",
    "description": "The ongoing trade war between the U.S. and China has intensified, with high tariffs imposed by U.S. President Donald Trump placing pressure on China’s export-driven economy. Already weakened by a prolonged slump in the property sector, China now faces additio…",
    "link": "https://m.economictimes.com/markets/stocks/news/navigating-the-trade-storm-chinas-strategic-moves/trade-tensions-escalate/slideshow/120954372.cms",
    "timestamp": "2025-05-07T05:45:44Z"
  },
  {
    "title": "Canada 'never for sale', Carney tells Trump",
    "description": "Canadian Prime Minister Mark Carney told U.S. President Donald Trump on Tuesday that his country would be \"never for sale\" as they met at the White House amid tensions on tariffs and sovereignty.",
    "link": "https://www.hurriyetdailynews.com/canada-never-for-sale-carney-tells-trump-208889",
    "timestamp": "2025-05-07T05:42:43Z"
  },
  {
    "title": "Mark Carney said he's glad people couldn't tell what was going through his mind when he met Trump",
    "description": "Carney told Trump during his meeting that Canada was not for sale.",
    "link": "https://www.businessinsider.com/mark-carney-glad-people-not-tell-he-thought-trump-meeting-2025-5",
    "timestamp": "2025-05-07T05:40:44Z"
  },
  {
    "title": "Maggie Haberman Names 1 Big Thing Trump Failed To Get After Canada Meeting",
    "description": "The New York Times journalist described the exact headline that Trump \"wants to see\" after meeting with Canadian Prime Minister Mark Carney.",
    "link": "https://www.huffpost.com/entry/cnn-maggie-haberman-trump-canada-mark-carney-meeting_n_681ad1a0e4b035302f24b692",
    "timestamp": "2025-05-07T05:40:26Z"
  },
  {
    "title": "China vows to defend 'justice' in looming trade talks with US",
    "description": "China vowed Wednesday to defend \"justice\" in upcoming trade talks with the United States in Switzerland — the two sides' first negotiations following President Donald Trump's sweeping tariff rollout that roiled global markets.",
    "link": "https://www.hurriyetdailynews.com/china-vows-to-defend-justice-in-looming-trade-talks-with-us-208888",
    "timestamp": "2025-05-07T05:40:01Z"
  },
  {
    "title": "Biden defends last-minute decision to end 2024 re-election bid in first interview since leaving WH: ‘I don’t think it would have mattered’",
    "description": "Biden, now 82, bowed out of the race on July 21 following a Democratic Party revolt over his disastrous performance in a June 27 debate against former -- and future -- President Donald Trump.",
    "link": "https://nypost.com/2025/05/07/us-news/biden-defends-decision-to-end-2024-presidential-re-election-bid-in-bbc-interview/",
    "timestamp": "2025-05-07T05:38:17Z"
  },
  {
    "title": "Carney defiant, Zelenskyy weak; what Trump’s body language tells us about his stance on Canada and Ukraine",
    "description": "Donald Trump's meetings with Volodymyr Zelenskyy and Mark Carney showed contrasting approaches. Trump confronted Zelenskyy openly, reflecting Ukraine's dependence on US aid. The meeting with Carney displayed restraint, though Trump dominated the conversation.…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carney-defiant-zelenskyy-weak-what-trumps-body-language-tells-us-about-his-stance-on-canada-and-ukraine/articleshow/120953790.cms",
    "timestamp": "2025-05-07T05:37:45Z"
  },
  {
    "title": "US, Yemen's Houthis agree ceasefire: mediator Oman",
    "description": "The United States and Yemen's Houthis have reached a ceasefire agreement, mediators announced Tuesday, saying the deal would ensure \"freedom of navigation\" in the Red Sea where the Iran-backed rebels have attacked shipping for months.",
    "link": "https://www.hurriyetdailynews.com/us-yemens-houthis-agree-ceasefire-mediator-oman-208887",
    "timestamp": "2025-05-07T05:36:30Z"
  },
  {
    "title": "Trump critics launch new group to highlight rising costs",
    "description": "NEW YORK, May 6 (Xinhua) -- A bipartisan group of President Donald Trump's critics is launching a ne",
    "link": "http://en.people.cn/n3/2025/0507/c90000-20311367.html",
    "timestamp": "2025-05-07T05:35:14Z"
  },
  {
    "title": "Mark Carney holds his own in Oval Office encounter with Donald Trump - Financial Times",
    "description": "Mark Carney holds his own in Oval Office encounter with Donald TrumpFinancial Times Carney says Canada is not for sale, Trump replies, 'Never say never'Fox News Trump’s Oval Office meeting with Carney didn’t reach Zelensky-level tension. But it wasn’t all nei…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177358311",
    "timestamp": "2025-05-07T05:32:57Z"
  },
  {
    "title": "India launches strikes on Pakistan, Islamabad vows to 'settle the score'",
    "description": "India and Pakistan exchanged heavy artillery along their contested frontier on Wednesday, after New Delhi launched deadly missile strikes on its arch-rival in the worst violence between the nuclear-armed neighbours in two decades.",
    "link": "https://www.hurriyetdailynews.com/india-launches-strikes-on-pakistan-islamabad-vows-to-settle-the-score-208886",
    "timestamp": "2025-05-07T05:31:08Z"
  },
  {
    "title": "How do you put a tariff on movies? Here’s what Trump’s plan could mean for Australia",
    "description": "Many countries around the world have become important hubs in the global system of film and TV production. Trump’s proposed tariffs could have a massive impact.",
    "link": "https://theconversation.com/how-do-you-put-a-tariff-on-movies-heres-what-trumps-plan-could-mean-for-australia-255948",
    "timestamp": "2025-05-07T05:28:39Z"
  },
  {
    "title": "Carney tells Trump that Canada 'won't be for sale, ever'",
    "description": "The Canadian PM responds firmly as the president proposes a \"wonderful marriage\" of incorporating Canada into the US.",
    "link": "https://www.bbc.com/news/articles/c4g4gw18753o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-07T05:28:34Z"
  },
  {
    "title": "Aussiewood to Mel Gibson: save us from Trump's movie tariffs",
    "description": "SYDNEY/GOLD COAST, Australia, May 7 (Reuters) - Australia's film industry wants actor Mel Gibson to do what he does in his action-hero movies and save the day, by convincing U.S. President Donald Trump to drop his film tariffs which could devastate its A$1 bi…",
    "link": "https://biztoc.com/x/3b7274399e9fc81c",
    "timestamp": "2025-05-07T05:27:37Z"
  },
  {
    "title": "Shame or support: What is US's true stand on Operation Sindoor?",
    "description": "As tensions rose between India and Pakistan after Operation Sindoor, China called India’s actions regrettable and other world leaders called for restraint. But it is US President Donald Trump’s reaction that will worry India",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/shame-or-support-what-is-uss-true-stand-on-operation-sindoor/articleshow/120953227.cms",
    "timestamp": "2025-05-07T05:17:43Z"
  },
  {
    "title": "Turkish, Pakistani FMs discuss escalating India-Pakistan tensions",
    "description": "Foreign Minister Hakan Fidan held a phone call with his Pakistani counterpart, Muhammad Ishaq Dar, late Tuesday to address the escalating tensions between Pakistan and India, Turkish diplomatic sources said on May 7.",
    "link": "https://www.hurriyetdailynews.com/turkish-pakistani-fms-discuss-escalating-india-pakistan-tensions-208885",
    "timestamp": "2025-05-07T05:17:00Z"
  },
  {
    "title": "Gold Rate Today: Gold dip to Rs 96,900/10g amid US-China trade talk hopes; Fed policy in focus",
    "description": "Gold prices declined due to optimism surrounding potential US-China trade discussions. This reduced the demand for safe-haven assets. Investors are closely monitoring the US Federal Reserve's policy decision. US Treasury Secretary Scott Bessent and Chinese Vi…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rate-today-gold-dip-to-rs-96900/10g-amid-us-china-trade-talk-hopes-fed-policy-in-focus/articleshow/120953278.cms",
    "timestamp": "2025-05-07T05:16:01Z"
  },
  {
    "title": "Berkshire Shareholders Reject Diversity, AI Proposals",
    "description": "Berkshire Hathaway shareholders on May 3 rejected a resolution requiring the company to report on risks from its subsidiaries’ race-based initiatives, one of seven proposals tied to diversity, artificial intelligence and other issues that were voted down. Sha…",
    "link": "https://www.insurancejournal.com/news/national/2025/05/07/822771.htm",
    "timestamp": "2025-05-07T05:10:49Z"
  },
  {
    "title": "What to know about the conclave to elect the next pope",
    "description": "The last few popes have been elected within a few days, but there is no formal deadline.",
    "link": "https://www.bostonherald.com/2025/05/07/conclave-pope/",
    "timestamp": "2025-05-07T05:10:08Z"
  },
  {
    "title": "Bigger Bitcoin wallets are stacking while others sell: Santiment",
    "description": "Key takeaways:<ul><li>Large Bitcoin holders have accumulated 81,338 BTC over the past six weeks, showing confidence in a future price uptrend.\r\n</li><li>Wallets with less than 0.1 BTC sold around 290 BTC, indicating smaller retail investors are either panic s…",
    "link": "https://cointelegraph.com/news/big-bitcoin-wallets-accumulate-smaller-retail-investors-fade-santiment",
    "timestamp": "2025-05-07T05:09:28Z"
  },
  {
    "title": "Watch: Biden's first interview since leaving the White House",
    "description": "Former US President Joe Biden talks Trump, Russia and US-Europe relations with the BBC's Today programme.",
    "link": "https://www.bbc.co.uk/news/videos/cn8085j2jnno",
    "timestamp": "2025-05-07T05:08:31Z"
  },
  {
    "title": "Shock Poll: Majority of American Muslims DON’T Oppose Trump’s Gaza Plan; Take Anger Out on DEMOCRATS!",
    "description": "Of all the Middle East peace plans that’ve been proposed since 1948, President Trump’s was the first one that featured bearded dancers and casinos. His video representation of “Trump Gaza” (that he posted online) speaks for itself:CLICK ABOVE ARTICLE LINK FOR…",
    "link": "https://freerepublic.com/focus/f-news/4315474/posts",
    "timestamp": "2025-05-07T05:06:54Z"
  },
  {
    "title": "Joe Biden on Trump: 'What president ever talks like that? That's not who we are'",
    "description": "The former president on his successor's first 100 days and his \"grave concern\" for the future of the Atlantic Alliance",
    "link": "https://www.bbc.com/news/articles/c89g491e8ewo",
    "timestamp": "2025-05-07T05:05:25Z"
  },
  {
    "title": "Ted Cruz Takes Heat Over Stance on Auctioning Spectrum",
    "description": "A pro-Trump group, Patriots for American Securit, released an advertisement that is calling for President Donald Trump to ignore Sen. Ted Cruz's (R-TX) stance in favor of auctioning off government-controlled electromagnetic spectrum.\nThe post Ted Cruz Takes H…",
    "link": "https://www.breitbart.com/politics/2025/05/06/ted-cruz-takes-heat-over-stance-on-auctioning-spectrum/",
    "timestamp": "2025-05-07T05:03:19Z"
  },
  {
    "title": "China May Cave to Trump on Tariffs Soon",
    "description": "President Donald Trump's tough stance on China is already producing results, and the evidence suggests that Chairman Xi Jinping will have no choice but to back down. China's economy, long propped up by unfair trade practices, is starting to crumble under the …",
    "link": "https://freerepublic.com/focus/f-news/4315472/posts",
    "timestamp": "2025-05-07T05:01:01Z"
  },
  {
    "title": "South Sudan’s Conflict Escalates",
    "description": "A deadly hospital bombing raises fears that the country has returned to civil war.",
    "link": "http://foreignpolicy.com/2025/05/07/south-sudan-conflict-hospital-bombing-civil-war-civilian-casualties/",
    "timestamp": "2025-05-07T05:00:12Z"
  },
  {
    "title": "Explainer: What the Department of Finance says on the impact of Trump’s tariffs",
    "description": "What does the Government’s latest economic report tell us about its fears for the State’s finances?",
    "link": "https://www.irishtimes.com/business/2025/05/07/explainer-what-the-department-of-finance-says-on-the-impact-of-trumps-tariffs/",
    "timestamp": "2025-05-07T05:00:01Z"
  },
  {
    "title": "Trump’s tentacles reach into the AIB boardroom",
    "description": "Chaos in world markets caused by US president may upend bank’s plan to buy back shares off State",
    "link": "https://www.irishtimes.com/business/2025/05/07/trumps-tentacles-reach-into-the-aib-boardroom/",
    "timestamp": "2025-05-07T05:00:01Z"
  },
  {
    "title": "Trump’s tariffs could see up to 25,000 fewer jobs created in Ireland",
    "description": "Department of Finance warns of growth shock if EU does not secure a trade deal",
    "link": "https://www.irishtimes.com/business/economy/2025/05/07/department-of-finance-warns-of-growth-shock-from-trumps-tariffs/",
    "timestamp": "2025-05-07T05:00:01Z"
  },
  {
    "title": "‘Woke’ keeps coming up in elections but it is a meaningless insult",
    "description": "Insistent users should take a long hard look at their bedfellows",
    "link": "https://www.irishtimes.com/opinion/2025/05/07/woke-keeps-coming-up-in-elections-but-as-an-insult-it-is-utterly-meaningless/",
    "timestamp": "2025-05-07T05:00:01Z"
  },
  {
    "title": "Ministers need to stop pointing out obstacles to delivery - and start tackling them",
    "description": "Constant headlines about housing schemes being struck down by councils, the planning board and the courts are chipping away at public confidence",
    "link": "https://www.irishtimes.com/opinion/2025/05/07/ministers-need-to-stop-pointing-out-obstacles-to-delivery-and-start-tackling-them/",
    "timestamp": "2025-05-07T05:00:01Z"
  },
  {
    "title": "‘There’s a war on academia’: US faces brain drain of its brightest and best teachers and students",
    "description": "Europe may benefit as Trump’s campaign against Ivy League colleges is causing academics to consider emigrating",
    "link": "https://www.irishtimes.com/ireland/education/2025/05/05/theres-a-war-on-academia-us-faces-brain-drain-of-its-brightest-and-best-teachers-and-students/",
    "timestamp": "2025-05-07T05:00:00Z"
  },
  {
    "title": "Wikipedia Has Put a Few Precious Words on T-shirts",
    "description": "German sustainable brand Armedangels has cooked up a collaboration with Wikipedia that champions peace, freedom, equality and access to information.",
    "link": "http://wwd.com/fashion-news/fashion-scoops/wikipedia-collab-angels-trump-musk-1237686262/",
    "timestamp": "2025-05-07T05:00:00Z"
  },
  {
    "title": "Trump appeasing Putin with pressure on Ukraine, Biden tells BBC",
    "description": "In his first interview since leaving office, the 82-year-old criticises his successor's handling of the war and is challenged on his own record.",
    "link": "https://www.bbc.com/news/articles/c0m9mvemxrwo",
    "timestamp": "2025-05-07T04:59:22Z"
  },
  {
    "title": "Kristi Noem Wins at Hearing amid Democrats' Jabs",
    "description": "Border security chief Kristi Noem casually batted away numerous Democrat complaints and barbs during her first hearing at the House appropriations committee on Tuesday.\nThe post Kristi Noem Wins at Hearing amid Democrats’ Jabs appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/05/06/kristi-noem-swats-democrats-jabs-house-hearing/",
    "timestamp": "2025-05-07T04:58:42Z"
  },
  {
    "title": "Watch: Biden's first interview since leaving the White House",
    "description": "Former US President Joe Biden talks Trump, Russia and US-Europe relations with the BBC's Today programme.",
    "link": "https://www.bbc.com/news/videos/cn8085j2jnno",
    "timestamp": "2025-05-07T04:58:17Z"
  },
  {
    "title": "The College-For-All Fallacy",
    "description": "For years, would-be higher-education reformers have warned that America’s higher education crisis—soaring tuition, crippling student debt, and weak learning—was rooted in a dangerous myth: every high school graduate should go to college.In 2025, the proof is …",
    "link": "https://freerepublic.com/focus/f-bloggers/4315471/posts",
    "timestamp": "2025-05-07T04:57:37Z"
  },
  {
    "title": "How world leaders reacted to Indian strikes in Pakistan after Kashmir attack",
    "description": "India said it attacked Pakistan early on Wednesday following a deadly attack on tourists in Kashmir last month. Pakistan reported eight deaths and said it was responding to the Indian strikes.",
    "link": "https://www.thehindubusinessline.com/news/national/how-world-leaders-reacted-to-indian-strikes-in-pakistan-after-kashmir-attack/article69547813.ece",
    "timestamp": "2025-05-07T04:57:18Z"
  },
  {
    "title": "Trump, Ukraine Propel EU And UK Towards Defence Pact",
    "description": "The EU and Britain look set to seal a defence pact at a landmark summit this month as worries about US President Donald Trump and the war in Ukraine spur them beyond the wrangles of Brexit.",
    "link": "https://www.ibtimes.com/trump-ukraine-propel-eu-uk-towards-defence-pact-3772735",
    "timestamp": "2025-05-07T04:57:13Z"
  },
  {
    "title": "ABC News: DoJ Now Investigating 2022 Abrego Garcia Human Trafficking Stop",
    "description": "Better late than never? When Tennessee state police pulled over Kilmar Abrego Garcia in a car owned by a convicted human trafficker, carrying eight people without identification, the FBI and ICE couldn't be bothered to even ask the troopers to detain the grou…",
    "link": "https://freerepublic.com/focus/f-news/4315469/posts",
    "timestamp": "2025-05-07T04:54:35Z"
  },
  {
    "title": "‘Most Corrupt Act’: Sen. Chris Murphy Moves to Ban Donald Trump From Shilling Meme Coin",
    "description": "In brief\n- Democratic Connecticut Senator Chris Murphy's bill on Tuesday would prohibit U.S. President Donald Trump from promoting his meme coin.\n- The MEME Act would apply broadly to securities and digital assets.\n- Trump has received fierce criticism for hi…",
    "link": "https://biztoc.com/x/0e515b3625cd3d1d",
    "timestamp": "2025-05-07T04:54:30Z"
  },
  {
    "title": "Bitcoin, $XRP, Other Altcoins Pump On Trump's Upcoming 'Big Announcement' Before Middle East Trip",
    "description": "Bitcoin, $XRP, and other major altcoins were up overnight after U.S. President Donald Trump said his administration will soon make a \"very, very big announcement\" – will it even be related to crypto?",
    "link": "https://www.ibtimes.com/bitcoin-xrp-other-altcoins-pump-trumps-upcoming-big-announcement-before-middle-east-trip-3772712",
    "timestamp": "2025-05-07T04:53:29Z"
  },
  {
    "title": "Trump, Ukraine propel EU and UK towards defence pact",
    "description": "The EU and Britain look set to seal a defence pact at a landmark summit this month as worries about US President Donald Trump and the war in Ukraine spur them beyond the wrangles of Brexit. Multiple EU diplomats and officials told AFP the signs are positive t…",
    "link": "https://www.digitaljournal.com/world/trump-ukraine-propel-eu-and-uk-towards-defence-pact/article",
    "timestamp": "2025-05-07T04:53:16Z"
  },
  {
    "title": "A bigger, bolder Labor government won’t reform the economy. Why would it?",
    "description": "Anyone who hopes that a strengthened Albanese government will take on bigger issues is due for a reality check.\nThe post A bigger, bolder Labor government won’t reform the economy. Why would it? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/07/albanese-labor-government-economy-productivity-wages-taxation/",
    "timestamp": "2025-05-07T04:52:46Z"
  },
  {
    "title": "Republicans, Dems Hold Separate Crypto Roundtables As Tensions Simmer Over Trump Projects",
    "description": "Republicans and Democrats on Sunday held separate crypto roundtables after Rep. Maxine Waters walked out of a crypto hearing seeking to discuss crypto legislation as she alleged that GOP members of the House Financial Services Committee refused to discuss Pre…",
    "link": "https://www.ibtimes.com/republicans-dems-hold-separate-crypto-roundtables-tensions-simmer-over-trump-projects-3772716",
    "timestamp": "2025-05-07T04:48:43Z"
  },
  {
    "title": "Insane: Over One-Third of Payments Issued by Treasury Cannot Be Tracked Back to Appropriation",
    "description": "With so much going on these days — on multiple fronts — it's difficult to keep up with it all. On Tuesday alone, there were multiple cabinet secretaries testifying before Congress, President Donald Trump made multiple appearances, commenting on everything fro…",
    "link": "https://freerepublic.com/focus/f-bloggers/4315467/posts",
    "timestamp": "2025-05-07T04:48:27Z"
  },
  {
    "title": "Jimmy Kimmel Compares Canadian PM’s Trump Meeting to ‘an Ewok Going to a Meeting on the Death Star’ | Video",
    "description": "The ABC host also jokes that Trump's obsession with Canada bears similarity to the crimes he was accused of by E. Jean Carroll \nThe post Jimmy Kimmel Compares Canadian PM’s Trump Meeting to ‘an Ewok Going to a Meeting on the Death Star’ | Video appeared first…",
    "link": "https://www.thewrap.com/jimmy-kimmel-trump-canadian-pm-meeting-monologue-abc/",
    "timestamp": "2025-05-07T04:47:57Z"
  },
  {
    "title": "China's Xi Aims To Beef Up 'No Limits' Putin Partnership",
    "description": "Chinese President Xi Jinping headed to Moscow on Wednesday for a key three-day visit including a grand Victory Day parade and a show of support for Vladimir Putin.",
    "link": "https://www.ibtimes.com/chinas-xi-aims-beef-no-limits-putin-partnership-3772725",
    "timestamp": "2025-05-07T04:33:22Z"
  },
  {
    "title": "China’s Xi aims to beef up ‘no limits’ Putin partnership",
    "description": "Chinese President Xi Jinping headed to Moscow on Wednesday for a key three-day visit including a grand Victory Day parade and a show of support for Vladimir Putin. Moscow and Beijing declared a “no limits partnership” weeks before Putin ordered Russia’s Ukrai…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-aims-to-beef-up-no-limits-putin-partnership/article",
    "timestamp": "2025-05-07T04:33:17Z"
  },
  {
    "title": "Trump’s White House creates own media universe",
    "description": "From influencer-only briefings to memes of Donald Trump as the pope and a “Star Wars” Jedi master, the White House is creating its own alternate media reality. Since Trump’s return to the US presidency in January, his team has given right-wing “new media” an …",
    "link": "https://www.digitaljournal.com/world/trumps-white-house-creates-own-media-universe/article",
    "timestamp": "2025-05-07T04:33:17Z"
  },
  {
    "title": "George W. Bush not expected at White House event honoring his mother",
    "description": "Former president George W. Bush is not expected to attend a Thursday event at the White House honoring his late mother, two White House officials familiar with the plans told The Washington Post. First lady Melania Trump is hosting the event in the East Room,…",
    "link": "https://freerepublic.com/focus/f-news/4315464/posts",
    "timestamp": "2025-05-07T04:32:25Z"
  },
  {
    "title": "Trump Admin Warns FIFA World Cup Fans: ‘Don’t Overstay Your Visa’",
    "description": "President Trump held his first World Cup task force meeting that included some Cabinet members, as well as FIFA president Gianni Infantino.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-admin-warns-fifa-world-cup-fans-visa-1235333403/",
    "timestamp": "2025-05-07T04:31:07Z"
  },
  {
    "title": "'Daily Show' Roasts The 'F**k' Out Of Trump's Carney Meeting With Charming Takedown",
    "description": "Desi Lydic joked that the Canadian prime minister \"friend-zoned\" the president in the Oval Office.",
    "link": "https://www.huffpost.com/entry/daily-show-desi-lydic-trump-canada-mark-carney-meeting_n_681abff9e4b035302f24b0ea",
    "timestamp": "2025-05-07T04:31:04Z"
  },
  {
    "title": "US trade deficit hits record high as businesses, consumers try to get ahead of Trump tariffs",
    "description": "The U.S. trade deficit soared to a monthly record of $140.5 billion in March, signaling a rush for imports from businesses and consumers alike ahead of President Donald Trump’s latest — and most sweeping — tariffs taking effect.",
    "link": "https://www.ksat.com/business/2025/05/06/us-trade-deficit-hits-record-high-as-businesses-consumers-try-to-get-ahead-of-trump-tariffs/",
    "timestamp": "2025-05-07T04:30:40Z"
  },
  {
    "title": "‘Blueprint’ bill that avoids some of the most severe education cuts is signed into law",
    "description": "Even as changes to the state's education reform act were being signed into law Tuesday, state officials and advocates were already talking about changes they...",
    "link": "https://marylandmatters.org/2025/05/07/blueprint-bill-that-avoids-some-of-the-most-severe-education-cuts-is-signed-into-law/",
    "timestamp": "2025-05-07T04:27:55Z"
  },
  {
    "title": "VA secretary says job cuts would improve efficiency",
    "description": "Washington DC (UPI) May 6, 2025 \n\n\n Veterans Affairs Secretary Doug Collins on Tuesday accused Democrats of fearmongering while they oppose proposed cuts to the Department of Veterans Affairs workforce. \n Reports have suggested Collins wants to eliminate more…",
    "link": "https://www.spacewar.com/reports/VA_secretary_says_job_cuts_would_improve_efficiency_999.html",
    "timestamp": "2025-05-07T04:25:24Z"
  },
  {
    "title": "Trump talks tough on China, but early focus elsewhere",
    "description": "Washington (AFP) May 7, 2025\n\n\n Voicing frustration over the lack of success in ending Russia's invasion of Ukraine, US Secretary of State Marco Rubio called for renewed focus on \"our number-one geopolitical foe\" - China. \n\n\"Not that a war in Ukraine is not i…",
    "link": "https://www.spacewar.com/reports/Trump_talks_tough_on_China_but_early_focus_elsewhere_999.html",
    "timestamp": "2025-05-07T04:25:24Z"
  },
  {
    "title": "India launches strikes on Pakistan, Islamabad vows to 'settle the score'",
    "description": "Muzaffarabad, Pakistan (AFP) May 7, 2025\n\n India and Pakistan exchanged heavy artillery along their contested frontier on Wednesday, after New Delhi launched missile strikes on its arch-rival in a major escalation between the nuclear-armed neighbours. \n\nDead …",
    "link": "https://www.spacewar.com/reports/India_launches_strikes_on_Pakistan_Islamabad_vows_to_settle_the_score_999.html",
    "timestamp": "2025-05-07T04:25:24Z"
  },
  {
    "title": "China says 'concerned' by India strikes on Pakistan, urges restraint",
    "description": "Beijing (AFP) May 7, 2025\n\n China on Wednesday expressed regret and concern over Indian strikes on Pakistan, urging both sides to show restraint in response to a major escalation between its nuclear-armed neighbours. \n\nIndia and Pakistan exchanged heavy artil…",
    "link": "https://www.spacewar.com/reports/China_says_concerned_by_India_strikes_on_Pakistan_urges_restraint_999.html",
    "timestamp": "2025-05-07T04:25:24Z"
  },
  {
    "title": "Boris Pistorius, party soldier in charge of Germany's defence",
    "description": "Berlin (AFP) May 6, 2025\n\n\n Germany's Defence Minister Boris Pistorius - who has led the push to make the military \"ready for war\" so it doesn't have to fight one - was the only cabinet member to survive the new government taking office. \n\nHailed as a straigh…",
    "link": "https://www.spacewar.com/reports/Boris_Pistorius_party_soldier_in_charge_of_Germanys_defence_999.html",
    "timestamp": "2025-05-07T04:25:24Z"
  },
  {
    "title": "Relief felt by Australians as cost of crude oil drops to four year low",
    "description": "A sharp drop in the price of crude oil promises cost-of-living relief for Australians not only at the petrol station but also in the shops.",
    "link": "https://www.abc.net.au/news/2025-05-07/oil-and-fuel-prices-four-year-low/105257870",
    "timestamp": "2025-05-07T04:24:29Z"
  },
  {
    "title": "China eases monetary policy to support an economy threatened by Trump tariffs—yet more stimulus may be needed",
    "description": "China on Wednesday eased key monetary policy tools in a bid to boost its ailing economy as it struggles with the effects of weak consumption and Donald Trump's trade war.\nThe country's leaders are battling to reignite growth, which has not fully recovered sin…",
    "link": "https://biztoc.com/x/0f36be84504149c6",
    "timestamp": "2025-05-07T04:20:50Z"
  },
  {
    "title": "India and Pakistan have fought many wars in the past. Are we on the precipice of a new one?",
    "description": "The worry is no other country will step in to mediate, leaving both sides to settle the conflict alone. A war between the two nuclear nations could be devastating.",
    "link": "https://theconversation.com/india-and-pakistan-have-fought-many-wars-in-the-past-are-we-on-the-precipice-of-a-new-one-256080",
    "timestamp": "2025-05-07T04:10:48Z"
  },
  {
    "title": "Hit by Trump cuts, journalists at Dubai-based US channel face uncertain future",
    "description": "Sara, a Dubai-based journalist, joined the US-funded Alhurra TV news channel hoping for job security. But after it abruptly stopped broadcasting and fired most staff, she’s wondering how to make ends meet. Alhurra, the only Arabic-language US station in a reg…",
    "link": "https://www.digitaljournal.com/world/hit-by-trump-cuts-journalists-at-dubai-based-us-channel-face-uncertain-future/article",
    "timestamp": "2025-05-07T04:07:32Z"
  },
  {
    "title": "Hit By Trump Cuts, Journalists At Dubai-based US Channel Face Uncertain Future",
    "description": "Sara, a Dubai-based journalist, joined the US-funded Alhurra TV news channel hoping for job security.",
    "link": "https://www.ibtimes.com/hit-trump-cuts-journalists-dubai-based-us-channel-face-uncertain-future-3772723",
    "timestamp": "2025-05-07T04:06:19Z"
  }
]