[
  {
    "title": "Comedian Jeff Dye Flees California for Texas: 'Gavin Newsom Scares the Sh*t Out of Me,' 'Those Fires Were a Wake-Up Call'",
    "description": "Comedian Jeff Dye is the latest Hollywood celebrity to flee the state of California. He says it is because of the Democrat leadership destroying the state.",
    "link": "https://www.breitbart.com/entertainment/2025/11/18/comedian-jeff-dye-flees-california-for-texas-gavin-newsom-scares-the-sht-out-of-me-those-fires-were-a-wake-up-call/",
    "timestamp": "2025-11-18T13:44:44Z"
  },
  {
    "title": "Venezuela's Maduro 'ready to talk' as US ramps up pressure",
    "description": "Following increased US pressure on the Venezuelan government, the two sides say they are open to talks.",
    "link": "https://www.bbc.com/news/articles/c3epgzvpj3lo",
    "timestamp": "2025-11-18T13:42:35Z"
  },
  {
    "title": "New Yorker: Trump Occupies 'Negative Space' in Epstein Files (As In Nothing There)",
    "description": "Epstein slop has now apparently reached the outermost limits of absurdity with Monday's New Yorker entirely incapable finding anything actually incriminating about President Donald Trump in the latest release of the Jeffrey Epstein documents. So what to do? W…",
    "link": "https://freerepublic.com/focus/f-bloggers/4353149/posts",
    "timestamp": "2025-11-18T13:41:56Z"
  },
  {
    "title": "New Yorker: Trump Occupies 'Negative Space' in Epstein Files (As In Nothing There)",
    "description": "Epstein slop has now apparently reached the outermost limits of absurdity with Monday's New Yorker entirely incapable finding anything actually incriminating about President Donald Trump in the latest release of the Jeffrey Epstein documents. So what to do? W…",
    "link": "https://freerepublic.com/focus/f-news/4353149/posts",
    "timestamp": "2025-11-18T13:41:56Z"
  },
  {
    "title": "What is the international stabilisation force for Gaza?",
    "description": "A UNSC resolution passed backing the creation of an international stabilisation force in Gaza. So what does that mean?",
    "link": "https://www.aljazeera.com/news/2025/11/18/what-is-the-international-stabilisation-force-for-gaza",
    "timestamp": "2025-11-18T13:38:14Z"
  },
  {
    "title": "Netanyahu lauds UN vote on Trump's Gaza plan, avoids mentioning Palestinian statehood",
    "description": "The Israeli prime minister also called on countries to 'join us in expelling Hamas,' as the militant Palestinian group reiterated that it will not disarm and that its factions reject the UN plan",
    "link": "https://www.haaretz.com/israel-news/2025-11-18/ty-article/netanyahu-lauds-un-vote-on-trumps-gaza-plan-avoids-mentioning-palestinian-statehood/0000019a-9681-d0a6-a3fe-f6852daf0000",
    "timestamp": "2025-11-18T13:37:37Z"
  },
  {
    "title": "Toyota Lays Out $912 Million Plan to Boost US Hybrid Production",
    "description": "Toyota Motor Corp. detailed plans to invest $912 million to increase output of hybrid components and vehicles across five states, part of a broader $10 billion commitment in the US over the next five years.",
    "link": "https://financialpost.com/pmn/business-pmn/toyota-lays-out-912-million-plan-to-boost-us-hybrid-production",
    "timestamp": "2025-11-18T13:37:09Z"
  },
  {
    "title": "A Dave Ramsey Caller Went From Making $2.5 Million As A Consultant To Owing $250,000 Thanks To Trump's Policies. The Host Tells Her To Get A Job",
    "description": "Ashley from San Francisco used to bring in $2.5 million a year running a consulting firm that helped schools and corporations donate unused furniture and...",
    "link": "https://finance.yahoo.com/news/dave-ramsey-caller-went-making-133116050.html",
    "timestamp": "2025-11-18T13:31:16Z"
  },
  {
    "title": "In Surprise Reversal, Trump Now Supports GOP Release Of Epstein Files",
    "description": "Less than 24 hours after President Donald Trump called Rep. Marjorie Taylor Greene a traitor and mocked Thomas Massie's dead wife - because they were among four Republicans pushing for a House floor vote to force the DOJ to release the Epstein files, Trump - …",
    "link": "https://www.shtfplan.com/headline-news/in-surprise-reversal-trump-now-supports-gop-release-of-epstein-files",
    "timestamp": "2025-11-18T13:30:54Z"
  },
  {
    "title": "Trump, Brendan Carr Threaten To Censor Some More Comedians For The Crime Of Comedy",
    "description": "Donald Trump and his earlobe nibbler (FCC boss Brendan Carr) are threatening to try and censor some more comedians after their efforts to cancel Jimmy Kimmel went so well (read: not well at all). Over at the right wing white propaganda website formerly known …",
    "link": "https://www.techdirt.com/2025/11/18/trump-brendan-carr-threaten-to-censor-some-more-comedians-for-the-crime-of-comedy/",
    "timestamp": "2025-11-18T13:30:00Z"
  },
  {
    "title": "Epstein files and affordability concerns threaten to knock Trump's 2nd presidency off course",
    "description": "Trump's political dominance is showing cracks as he faces challenges on affordability and the Jeffrey Epstein case.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_51367ccc-31cf-513c-8e99-fb6cc6059321.html",
    "timestamp": "2025-11-18T13:30:00Z"
  },
  {
    "title": "Fighter jet, investment deals on agenda as Saudi crown prince visits White House",
    "description": "President Donald Trump is set to fete Crown Prince Mohammed bin Salman on Tuesday when the de facto leader of Saudi Arabia makes his first White House visit since the 2018 killing of Jamal Khashoggi, a Saudi citizen and U.S. resident, by Saudi agents.",
    "link": "https://www.cbc.ca/news/world/washington-saudi-prince-mbs-salman-trump-white-house-9.6982672",
    "timestamp": "2025-11-18T13:24:46Z"
  },
  {
    "title": "Concern grows over Trump’s strained voice after he says he snapped at ‘stupid’ people",
    "description": "President Donald Trump's hoarse voice at a recent briefing raised health concerns. He explained he strained his voice shouting about trade.  Recent medical reports confirm Trump is in excellent health for his age. His cardiac age is significantly younger than…",
    "link": "https://economictimes.indiatimes.com/news/international/us/concern-grows-over-trumps-strained-voice-after-he-says-he-snapped-at-stupid-people/articleshow/125412235.cms",
    "timestamp": "2025-11-18T13:23:59Z"
  },
  {
    "title": "President Donald Trump unveils 'FIFA Pass' to help World Cup travelers get their visas faster",
    "description": "",
    "link": "https://biztoc.com/x/18fee7af2a54f2b0",
    "timestamp": "2025-11-18T13:18:01Z"
  },
  {
    "title": "Rosie O'Donnell Spreads Conspiracies, Shrieks About Food Stamps and Fascism in Anti-Trump Tirade",
    "description": "Leftist comedian Rosie O'Donnell told her 2.9 million TikTok followers that President Donald Trump has settled cases with parents over child abuse.\nThe post Rosie O’Donnell Spreads Conspiracies, Shrieks About Food Stamps and Fascism in Anti-Trump Tirade appea…",
    "link": "https://www.breitbart.com/entertainment/2025/11/18/rosie-odonnell-spreads-conspiracies-shrieks-about-food-stamps-and-fascism-in-anti-trump-tirade/",
    "timestamp": "2025-11-18T13:17:57Z"
  },
  {
    "title": "Research breakthroughs often come through collaborations − attacks on academic freedom threaten this vital work",
    "description": "Academic freedom grew strongly after World War II, with greater university funding, protections and autonomy, yet global data now shows a decline.",
    "link": "https://theconversation.com/research-breakthroughs-often-come-through-collaborations-attacks-on-academic-freedom-threaten-this-vital-work-266644",
    "timestamp": "2025-11-18T13:17:33Z"
  },
  {
    "title": "'Get it done!' Trump orders rush on $2K handouts in attack on 'rip off' health companies",
    "description": "President Donald Trump issued a demand Tuesday that Congress quickly approve his proposal to send checks directly to Americans as an alternative to extending government health care subsidies, ordering lawmakers to “get it done, now.”“THE ONLY HEALTHCARE I WIL…",
    "link": "https://www.rawstory.com/trump-2674305231/",
    "timestamp": "2025-11-18T13:17:11Z"
  },
  {
    "title": "Trump threatens World Cup host cities over ‘safety’ concerns as White House announces visa scheme for fans - The New York Times",
    "description": "Trump threatens World Cup host cities over ‘safety’ concerns as White House announces visa scheme for fansThe New York Times President Donald Trump unveils ‘FIFA Pass’ to help World Cup travelers get their visas fasterAP News Trump Unveils \"FIFA Visas\" For 20…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180121749",
    "timestamp": "2025-11-18T13:12:17Z"
  },
  {
    "title": "Judge blasts ‘disturbing pattern of profound investigative missteps’ in DOJ’s case against former FBI chief James Comey",
    "description": "Problems include \"fundamental misstatements of the law,\" the judge said, ordering prosecutors to provide defense lawyers with all grand jury materials.",
    "link": "https://fortune.com/2025/11/18/james-comey-indictment-grand-jury-disturbing-pattern-missteps-misstatements/",
    "timestamp": "2025-11-18T13:11:42Z"
  },
  {
    "title": "‘China was playing chess while the rest of us were playing checkers’: Bombshell study finds $200 billion of secret loans to U.S. businesses over 25 years",
    "description": "Many of the loans from China’s state lenders were routed through shell companies in the Cayman Islands, Bermuda, Delaware and elsewhere, according to AidData.",
    "link": "https://fortune.com/2025/11/18/secret-china-loans-to-us-business-200-billion-over-25-years-shell-companies/",
    "timestamp": "2025-11-18T13:09:51Z"
  },
  {
    "title": "Will Zelenskyy’s trip to Turkey and talks with a US envoy restart efforts to end the war?",
    "description": "Turkey hosted several rounds of low-level contacts between Ukraine and Russia earlier this year, but progress was limited. International efforts led by the United States have also not produced a breakthrough.",
    "link": "https://indianexpress.com/article/world/will-zelenskyys-trip-to-turkey-and-talks-with-a-us-envoy-restart-efforts-to-end-the-war-10372675/",
    "timestamp": "2025-11-18T13:09:11Z"
  },
  {
    "title": "Home Depot earnings, 'quiet time' in the job market, Panera's new strategy and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/11/18/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-11-18T13:05:35Z"
  },
  {
    "title": "Trump, Gianni Infantino unveil ‘FIFA Pass’ to help foreign visitors to World Cup dodge immigration crackdown",
    "description": "Trump again raised the prospect of moving World Cup games away from liberal cities, noting the recent election of a progressive mayor in Seattle.",
    "link": "https://fortune.com/2025/11/18/world-cup-pass-trump-fifa-gianni-infantino/",
    "timestamp": "2025-11-18T13:04:19Z"
  },
  {
    "title": "Earnings live: Home Depot stock falls on downbeat outlook, China's PDD Holdings slides, Medtronic pops",
    "description": "The third quarter earnings season has been mostly positive, with most of the reports in the rearview mirror.",
    "link": "https://finance.yahoo.com/news/live/earnings-live-home-depot-stock-falls-on-downbeat-outlook-chinas-pdd-holdings-slides-medtronic-pops-130348525.html",
    "timestamp": "2025-11-18T13:03:48Z"
  },
  {
    "title": "Trump Shuts Down Reporter Over Epstein Questions: Quiet Piggy!",
    "description": "Former President Donald Trump is facing criticism after lashing out at a reporter who questioned him about newly released emails tied to Jeffrey Epstein. The exchange occurred on November 14 aboard Air Force One as Trump traveled to Mar-a-Lago. Reporters aske…",
    "link": "https://mediatakeout.com/trump-shuts-down-reporter-over-epstein-questions-quiet-piggy/",
    "timestamp": "2025-11-18T13:02:58Z"
  },
  {
    "title": "Trump attacks Taylor Greene and Massie for standing up to him on Epstein but has no harsh words for antisemitism on Tucker Carlson’s show",
    "description": "In fact, Trump praised Carlson for having “said good things about me over the years.”",
    "link": "https://fortune.com/2025/11/18/trump-tucker-carlson-antisemitism-nick-fuentes/",
    "timestamp": "2025-11-18T13:00:47Z"
  },
  {
    "title": "Ex-BBC CEO Deborah Turness oversaw a string of media controversies",
    "description": "A look back at the controversies that Deborah Turness oversaw as a top media excecutive from the Brian Williams scandal at NBC News to multiple documentary blunders at the BBC.",
    "link": "https://www.foxnews.com/media/ex-bbc-ceo-deborah-turness-oversaw-string-media-controversies",
    "timestamp": "2025-11-18T13:00:32Z"
  },
  {
    "title": "New coalition forms to keep Colorado an aerospace, defense leader",
    "description": "The decision to move U.S. Space Command out of Colorado was a red flag for business leaders who have formed a new coalition to work on seeing that the state holds onto its edge in the aerospace and defense fields.",
    "link": "https://www.denverpost.com/2025/11/18/colorado-aerospace-coalition-space-command/",
    "timestamp": "2025-11-18T13:00:03Z"
  },
  {
    "title": "House conservatives rally behind push to impeach Judge Boasberg over role in Trump investigation",
    "description": "House Freedom Caucus rallies behind Rep. Brandon Gill's push to impeach Judge James Boasberg over his role in subpoenas targeting Republican lawmakers.",
    "link": "https://www.foxnews.com/politics/house-conservatives-rally-behind-push-impeach-judge-boasberg-over-role-trump-investigation",
    "timestamp": "2025-11-18T13:00:02Z"
  },
  {
    "title": "Toyota to invest $912 million in U.S. plants to increase hybrid vehicle production",
    "description": "Toyota Motor on Tuesday announced plans to invest $912 million in U.S. manufacturing plants in five southern states.",
    "link": "https://www.cnbc.com/2025/11/18/toyota-hybrid-plants.html",
    "timestamp": "2025-11-18T13:00:01Z"
  },
  {
    "title": "Valar Atomics Says It's the First Nuclear Startup To Achieve Criticality",
    "description": "An anonymous reader quotes a report from Wired: Startup Valar Atomics said on Monday that it achieved criticality -- an essential nuclear milestone -- with the help of one of the country's top nuclear laboratories. The El Segundo, California-based startup, wh…",
    "link": "https://hardware.slashdot.org/story/25/11/18/0425258/valar-atomics-says-its-the-first-nuclear-startup-to-achieve-criticality",
    "timestamp": "2025-11-18T13:00:00Z"
  },
  {
    "title": "Mark Guiducci on Our 2026 Hollywood Issue",
    "description": "'Vanity Fair''s global editorial director on why the internet boyfriend is Hollywood's new leading man, a town on the verge of an AI revolution, and Olivia Nuzzi’s 'American Canto.'",
    "link": "https://www.vanityfair.com/hollywood/story/mark-guiducci-on-the-2026-hollywood-issue",
    "timestamp": "2025-11-18T13:00:00Z"
  },
  {
    "title": "U.N. Cries Poor: Demands Billions in Cash Donations to Solve 'Unacceptable' World Hunger",
    "description": "Send cash in large amounts, most urgently. No questions asked. That was the call from the U.N.'s World Food Programme on Tuesday as it warned it is struggling to feed even a third of the 318 million people facing severe hunger in 2026.\nThe post U.N. Cries Poo…",
    "link": "https://www.breitbart.com/europe/2025/11/18/u-n-cries-poor-demands-billions-in-cash-donations-to-solve-unacceptable-world-hunger/",
    "timestamp": "2025-11-18T12:56:45Z"
  },
  {
    "title": "Trump gets warning that his 'biggest problem' has become 'crisis' — and it wasn't expected",
    "description": "As part of a discussion about the House of Representatives’ vote on releasing the Jeffrey Epstein files on Tuesday, Donald Trump was warned things will take a turn for the worse — and Democrats and the press are not his biggest problem going forward.Discussin…",
    "link": "https://www.rawstory.com/trump-problem-2674305087/",
    "timestamp": "2025-11-18T12:52:30Z"
  },
  {
    "title": "Jeffrey Epstein’s Brother Rages as Chris Cuomo Grills Him on ‘Bubba’ Email",
    "description": "Epstein furiously stonewalled Cuomo during a tense on-air call after he was grilled on an email from him mentioning Trump.\nThe post Jeffrey Epstein’s Brother Rages as Chris Cuomo Grills Him on ‘Bubba’ Email first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/jeffrey-epsteins-brother-rages-as-chris-cuomo-grills-him-on-bubba-email/",
    "timestamp": "2025-11-18T12:51:38Z"
  },
  {
    "title": "US has warned others to avoid loans from Chinese state banks. But it’s the biggest recipient of all",
    "description": "Much of the lending was to help Chinese companies buy stakes in U.S. businesses, many tied to critical technology and national security.",
    "link": "https://www.bostonherald.com/2025/11/18/china-banks-united-state-loans/",
    "timestamp": "2025-11-18T12:51:34Z"
  },
  {
    "title": "Mike Pence Raises Concerns on Saudi F-35 Sales and China Policy",
    "description": "Mike Pence, Donald Trump’s first-term vice president, said he was worried about the potential sale of F-35 jets to Saudi Arabia without concrete guarantees that the technology embedded in the world’s most advanced fighter would be kept secure.",
    "link": "https://financialpost.com/pmn/business-pmn/mike-pence-raises-concerns-on-saudi-f-35-sales-and-china-policy",
    "timestamp": "2025-11-18T12:51:14Z"
  },
  {
    "title": "US House expected to approve resolution to release Epstein files",
    "description": "But it may take a while to see the documents following Tuesday's vote, as the Senate must also approve the resolution.",
    "link": "https://www.bbc.com/news/articles/cn0gdzrklr7o",
    "timestamp": "2025-11-18T12:50:45Z"
  },
  {
    "title": "US to sell F-35s to Saudi Arabia, Trump says ahead of crown prince's visit",
    "description": "Trump will welcome Saudi Crown Prince Mohammed bin Salman to the White House for the first time since Jamal Khashoggi's murder.",
    "link": "https://www.bbc.com/news/articles/c7512rkvg7ro",
    "timestamp": "2025-11-18T12:50:24Z"
  },
  {
    "title": "House vote expected on full release of Epstein files as Trump backs down",
    "description": "It appeared a longshot when a small bipartisan group of House lawmakers petitioned in July to maneuver around control of which bills see the floor.",
    "link": "https://fortune.com/2025/11/18/when-will-house-vote-on-epstein-files-trump-republicans/",
    "timestamp": "2025-11-18T12:49:56Z"
  },
  {
    "title": "South Africa rises above US snub as G20 nears",
    "description": "As Johannesburg prepares to host Africa's first ever G20 summit, South Africa aims to showcase its diplomatic and economic potential despite the US boycott.",
    "link": "https://www.dw.com/en/south-africa-rises-above-us-snub-as-g20-nears/a-74781094",
    "timestamp": "2025-11-18T12:48:00Z"
  },
  {
    "title": "South Africa tries to shake off US 'snub cloud' as G20 nears",
    "description": "As Johannesburg prepares to host Africa's first ever G20 summit, South Africa aims to showcase its diplomatic and economic potential despite an American boycott. In South Africa's largest city, Johannesburg, preparations for hosting the world's biggest econom…",
    "link": "https://www.dw.com/en/south-africa-tries-to-shake-off-us-snub-cloud-as-g20-nears/a-74781094",
    "timestamp": "2025-11-18T12:48:00Z"
  },
  {
    "title": "Cheapest places to eat a cheeseburger meal",
    "description": "The Fox News Lifestyle Newsletter brings you trending stories on family, travel, food, neighbors helping neighbors, pets, autos, military veterans, heroes, faith and American values.",
    "link": "https://www.foxnews.com/lifestyle/cheapest-places-eat-cheeseburger-meal",
    "timestamp": "2025-11-18T12:47:58Z"
  },
  {
    "title": "Donald Trump told a female reporter ‘quiet, piggy’ when she asked about Epstein",
    "description": "Yesterday, Donald Trump changed course on the Epstein Files. For months, Trump whined, cried and sh-t his pants over the Epstein Files, using whatever tools at his disposal to blackmail and threaten Republicans from ever releasing the files. Then, last week, …",
    "link": "https://www.celebitchy.com/950695/donald_trump_told_a_female_reporter_quiet_piggy_when_she_asked_about_epstein/",
    "timestamp": "2025-11-18T12:45:30Z"
  },
  {
    "title": "Senators seek probe of Trump crypto venture over alleged token sales linked to North Korea and Russia",
    "description": "Two U.S. Senators are pressing the Department of Justice and the Treasury to investigate a crypto company closely tied to the family of U.S. President Donald Trump over alleged links to illicit actors in North Korea and Russia.\nIn a letter on Tuesday, U.S. Se…",
    "link": "https://biztoc.com/x/9b5c9585e7559f86",
    "timestamp": "2025-11-18T12:45:23Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to The Cruelest Day: Tuesday, November 18, 2025, and Mickey Mouse Day, celebrating the rodent’s first appearance in a Disney cartoon. It was in Steamboat Willie, released on this day in 1928.  Here’s the cartoon, and they don’t make them like this any…",
    "link": "https://whyevolutionistrue.com/2025/11/18/tuesday-hili-dialogue-554/",
    "timestamp": "2025-11-18T12:45:11Z"
  },
  {
    "title": "Man Regrets Trump Vote After CBP Drags Him From Truck: 'Worst Decision'",
    "description": "A Charlotte man who voted for President Donald Trump said he regretted his vote after he was briefly detained by federal agents.\nWilly Aceituno, 46, a Honduran-born U.S. citizen, described being stopped twice by Border Patrol agents while on his way to work i…",
    "link": "https://biztoc.com/x/8cba6a915d218573",
    "timestamp": "2025-11-18T12:45:05Z"
  },
  {
    "title": "Daredevil, The Mighty Nein, Percy Jackson & More: BCTV Daily Dispatch",
    "description": "Welcome back, folks! With My Chemical Romance setting the perfect tone with \"Sing\" (BCTV DD's unofficial \"official\" theme), we've got your latest edition of BCTV Daily Dispatch! Here's where we look back at what we've been doing for the past 24 hours that you…",
    "link": "https://bleedingcool.com/tv/daredevil-the-mighty-nein-percy-jackson-more-bctv-daily-dispatch/",
    "timestamp": "2025-11-18T12:37:04Z"
  },
  {
    "title": "Donald Trump Suffers Two Major Legal Setbacks Within Hours",
    "description": "Two swift court rulings in New York and Tennessee stall Trump’s agenda, with growing judicial resistance to his enforcement plans.",
    "link": "https://biztoc.com/x/f6aa91ff0ab39605",
    "timestamp": "2025-11-18T12:33:35Z"
  },
  {
    "title": "Global climate progress visible but major emitters lag, new report finds",
    "description": "Renewables are booming and emissions are easing, yet fossil-fuel states are holding back momentum on slowing climate change. Who are the surprising leaders and laggers in the latest climate rankings?",
    "link": "https://www.dw.com/en/denmark-tops-us-flops-index-ranks-countries-climate-performance-progress-but-petrostates-stall/a-74781925",
    "timestamp": "2025-11-18T12:30:00Z"
  },
  {
    "title": "In pursuit of democracy",
    "description": "Analyzing every mention of ‘democracy’ in the American Congressional Record.",
    "link": "https://pudding.cool/2025/11/democracy/",
    "timestamp": "2025-11-18T12:25:13Z"
  },
  {
    "title": "New poll delivers big blow to Trump as approval rating takes sharp dive",
    "description": "A new AP-NORC poll reveals a significant drop in President Trump's approval ratings following the prolonged government shutdown.  His overall approval now stands at 33%, with even Republican support declining, as the public expresses frustration over delayed …",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-poll-delivers-big-blow-to-trump-as-approval-rating-takes-sharp-dive/articleshow/125411614.cms",
    "timestamp": "2025-11-18T12:24:03Z"
  },
  {
    "title": "Trump Media Stock Hits Record Low as President Faces Mounting Political Woes",
    "description": "Shares in Donald Trump’s media company tumbled to a new low on Monday, extending a weeks-long slide, amid a period of political turmoil for the president.\nTrump Media & Technology Group (TMTG) stock closed at $10.85 per share on November 17, marking a 32 perc…",
    "link": "https://biztoc.com/x/a24a05eec14b9754",
    "timestamp": "2025-11-18T12:22:51Z"
  },
  {
    "title": "House expected to vote on bill forcing release of Jeffrey Epstein files",
    "description": "the president has bowed to the growing momentum behind the bill and even said Republicans should vote for it.",
    "link": "https://www.denverpost.com/2025/11/18/congress-house-vote-epstein-files/",
    "timestamp": "2025-11-18T12:22:31Z"
  },
  {
    "title": "House expected to vote on bill forcing release of Jeffrey Epstein files",
    "description": "the president has bowed to the growing momentum behind the bill and even said Republicans should vote for it.",
    "link": "https://www.bostonherald.com/2025/11/18/congress-house-vote-epstein-files/",
    "timestamp": "2025-11-18T12:22:31Z"
  },
  {
    "title": "‘We Ain’t Buying It’ campaign plans boycott of Target, Amazon and Home Depot",
    "description": "Last week, we talked about how Target is currently panicking because their stock value, profits, and foot traffic are all down this year. This is a direct result of a nationwide boycott that’s in response to their caving to the president’s demands that Americ…",
    "link": "https://www.celebitchy.com/950659/we_aint_buying_it_campaign_plans_boycott_of_target_amazon_and_home_depot/",
    "timestamp": "2025-11-18T12:20:52Z"
  },
  {
    "title": "Olivia Nuzzi: Robert Kennedy Jr. said ‘don’t worry’ about the worm eating his brain",
    "description": "Olivia Nuzzi had a digital affair with Robert Kennedy Jr. for many months last year, and in the wake of the affair, she lost her job at New York Magazine, her engagement to Ryan Lizza and her East Coast life. She bounced back though, because the American medi…",
    "link": "https://www.celebitchy.com/950606/olivia_nuzzi_robert_kennedy_jr_said_dont_worry_about_the_worm_eating_his_brain/",
    "timestamp": "2025-11-18T12:20:13Z"
  },
  {
    "title": "House to vote on full release of Epstein files",
    "description": "The vote is the culmination of a monthslong effort that advanced despite initial opposition from Trump and Republican leadership.",
    "link": "https://www.newsnationnow.com/politics/house-vote-epstein-files-trump-reversal/",
    "timestamp": "2025-11-18T12:19:05Z"
  },
  {
    "title": "Conor McGregor ‘back at the gym early most mornings’ after ‘spiritual awakening’",
    "description": "Conor McGregor is back in the gym training for a comeback fight, and he wants it to be at the White House against Michael Chandler. What “The Notorious” wants isn’t really news — McGregor has been talking about fighting at the June UFC White House card since …",
    "link": "https://www.mmamania.com/ufc-news/404136/conor-mcgregor-back-at-the-gym-early-most-mornings-after-spiritual-awakening",
    "timestamp": "2025-11-18T12:18:23Z"
  },
  {
    "title": "Trump says whether he would sign Epstein files bill",
    "description": "President Donald Trump says he would sign legislation forcing the Justice Department to release all Jeffrey Epstein files as the House prepares to vote.",
    "link": "https://www.foxnews.com/politics/trump-says-whether-he-would-sign-epstein-files-bill",
    "timestamp": "2025-11-18T12:16:06Z"
  },
  {
    "title": "After years away from Washington, Saudi crown prince to get warm embrace from Trump, US business",
    "description": "Trump sees the crown prince as an indispensable player in shaping the Middle East in the decades to come.",
    "link": "https://www.bostonherald.com/2025/11/18/saudi-prince-visits-white-house/",
    "timestamp": "2025-11-18T12:15:47Z"
  },
  {
    "title": "House to Move Ahead With Epstein Vote Following Trump Reversal",
    "description": "The House of Representatives is set to vote to force the release of documents related to the late sex offender Jeffrey Epstein case. It comes after a dramatic reversal from President Donald Trump following months of resistance, with the president now saying h…",
    "link": "https://www.today.com/video/trump-says-he-would-sign-bill-releasing-epstein-files-if-it-passes-252261957602",
    "timestamp": "2025-11-18T12:15:33Z"
  },
  {
    "title": "Bitcoin drops below US$90,000 for the first time in seven months",
    "description": "The largest cryptocurrency extended its decline from a record of more than US$126,000 set in early October. Read on to find out more",
    "link": "https://financialpost.com/investing/bitcoin-drops-below-us90000",
    "timestamp": "2025-11-18T12:15:24Z"
  },
  {
    "title": "Trump faces a splintering GOP — and rare dissent from his party (Natalie Allison/Washington Post)",
    "description": "Natalie Allison / Washington Post:\nTrump faces a splintering GOP — and rare dissent from his party  —  The House of Representatives on Tuesday will vote to release additional investigation files related to the deceased sexual predator Jeffrey Epstein.  —  Jus…",
    "link": "https://www.memeorandum.com/251118/p7",
    "timestamp": "2025-11-18T12:15:03Z"
  },
  {
    "title": "Why Trump can never win on Epstein (Politico)",
    "description": "Politico:\nWhy Trump can never win on Epstein  —  With help from Eli Okun, Bethany Irvine, Ali Bianco and Rachel Umansky-Castro  —  On today's Playbook Podcast: Jack and Dasha discuss why Donald Trump U-turned on Epstein ... and why the White House fears it's …",
    "link": "https://www.memeorandum.com/251118/p5",
    "timestamp": "2025-11-18T12:15:03Z"
  },
  {
    "title": "US to sell fighter jets to Saudi as MBS meets Trump",
    "description": "The US plans to sell advanced F-35 fighter jets to Saudi Arabia, one of several deals expected to emerge from today’s talks between their leaders.\nWhile US President Donald Trump and Saudi Crown Prince Mohammed bin Salman’s Oval Office meeting may result in t…",
    "link": "https://biztoc.com/x/e53c1f262c4a4f8d",
    "timestamp": "2025-11-18T12:11:27Z"
  },
  {
    "title": "Dems seek probe into Trump-backed crypto firm",
    "description": "United States Democratic Senators Elizabeth Warren (pictured) and Jack Reed are pushing the US Department of Justice and the US Treasury to conduct an investigation into US President Donald Trump's cr...",
    "link": "https://biztoc.com/x/f124b722a3490bb7",
    "timestamp": "2025-11-18T12:11:17Z"
  },
  {
    "title": "Newsom wants more battery plants. This agricultural town has had enough.",
    "description": "Residents of Vacaville are opposing the Corby Battery Energy Storage System Project, the second a lithium ion power plant that has been proposed in the city.",
    "link": "https://www.sfgate.com/politics/article/vacaville-residents-oppose-corby-battery-plant-21171342.php",
    "timestamp": "2025-11-18T12:09:49Z"
  },
  {
    "title": "Donald Trump says US will sell advanced fighter jets to Saudis, despite Pentagon concerns",
    "description": "US president to meet Saudi Crown Prince at White House on Tuesday",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/17/us/politics/trump-f35-jets-saudi-arabia.html",
    "timestamp": "2025-11-18T12:07:29Z"
  },
  {
    "title": "US House votes on releasing Epstein files: What to expect",
    "description": "Trump said he will sign off on a bill to release the Epstein files if it passes in Congress on Tuesday.",
    "link": "https://www.aljazeera.com/news/2025/11/18/us-house-votes-on-releasing-epstein-files-what-to-expect",
    "timestamp": "2025-11-18T12:06:35Z"
  },
  {
    "title": "What’s on the agenda as Saudi Arabia’s MBS meets Trump in the US?",
    "description": "Agenda to include security, weapons, trade, investment and Trump's ambition to add Saudi Arabia to the Abraham Accords.",
    "link": "https://www.aljazeera.com/news/2025/11/18/whats-on-the-agenda-as-saudi-arabias-mbs-meets-trump-in-the-us",
    "timestamp": "2025-11-18T12:06:12Z"
  },
  {
    "title": "UN says lacks billions of dollars to feed world's hungry",
    "description": "The U.N.'s World Food Programme warned Tuesday that funding cuts mean it will struggle to feed even a third of the 318 million people facing severe hunger in 2026.",
    "link": "https://www.hurriyetdailynews.com/un-says-lacks-billions-of-dollars-to-feed-worlds-hungry-215874",
    "timestamp": "2025-11-18T12:05:59Z"
  },
  {
    "title": "Saudi crown prince's White House visit and the impending release of the Epstein files: Morning Rundown",
    "description": "Saudi Arabia’s crown prince visits the White House for the first time since ordering the killing of a journalist.",
    "link": "https://www.nbcnews.com/news/us-news/saudi-crown-princes-white-house-visit-impending-release-epstein-files-rcna244554",
    "timestamp": "2025-11-18T12:03:21Z"
  },
  {
    "title": "Surroundings Are The New Groceries. Tabs, Tues., Nov. 18, 2025",
    "description": "Can't wait to taste your mom's homemade Giblet Surroundings next week.",
    "link": "https://www.wonkette.com/p/surroundings-are-the-new-groceries",
    "timestamp": "2025-11-18T12:03:09Z"
  },
  {
    "title": "Potential GOP challenger warns Hochul that a corporate tax hike would be a 'disaster' for New York's economy",
    "description": "Nassau County Executive Bruce Blakeman slammed Gov. Kathy Hochul's potential corporate tax increase, warning it would be a \"disaster\" for New York's economy.",
    "link": "https://www.foxnews.com/politics/potential-gop-challenger-bruce-blakeman-warns-hochul-against-raising-taxes",
    "timestamp": "2025-11-18T12:00:57Z"
  },
  {
    "title": "Longtime Obamacare critic says Trump plan won't solve program's fatal flaws",
    "description": "Avik Roy believes sending Obamacare subsidies to Health Savings Accounts (HSAs) instead of insurance companies won't solve high healthcare costs without broader reforms.",
    "link": "https://www.foxnews.com/politics/longtime-obamacare-critic-says-trump-plan-wont-solve-programs-fatal-flaws",
    "timestamp": "2025-11-18T12:00:25Z"
  },
  {
    "title": "What If ‘America First’ Appears to Work?",
    "description": "“Might makes right” is still wrong for America, but opposing it just got harder.",
    "link": "https://www.theatlantic.com/international/2025/11/trump-foreign-policy/684969/",
    "timestamp": "2025-11-18T12:00:00Z"
  },
  {
    "title": "Beware of image showing Trump kissing young girl",
    "description": "Following the November 2025 release of thousands of documents related to Jeffrey Epstein, the image began making the rounds again.",
    "link": "https://www.snopes.com//fact-check/photo-trump-kissing-girl/",
    "timestamp": "2025-11-18T12:00:00Z"
  },
  {
    "title": "Retail roulette: How Trump’s tariffs altered buying",
    "description": "Ever-changing tariff rates have introduced uncertainty and confusion for retail buyers. But could they also present an opportunity for new supply chain strategies?",
    "link": "https://www.retaildive.com/news/trump-tariffs-retail-merchant-buying-holiday-behavior-patterns/805578/",
    "timestamp": "2025-11-18T12:00:00Z"
  },
  {
    "title": "A Political Disaster: Right-Wing Activists Begin To Turn Against The Trump Administration Over The Epstein Files",
    "description": "Tony Perkins warns that the Trump administration's handling of the Epstein files risks becoming a \"political disaster\" while Mark Meckler calls for Attorney General Pam Bondi to be fired.",
    "link": "https://www.peoplefor.org/rightwingwatch/political-disaster-right-wing-activists-begin-turn-against-trump-administration-over",
    "timestamp": "2025-11-18T12:00:00Z"
  },
  {
    "title": "Quiet Piggy",
    "description": "<ul>\n<li>Nearly Unanimous</li>\n<li>Helping Out Accused Sex Traffickers</li>\n<li>Highly Offensive</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/quiet-piggy",
    "timestamp": "2025-11-18T12:00:00Z"
  },
  {
    "title": "Missouri’s Eric Schmitt goes silent as a fight over Nazis and antisemitism roils the GOP",
    "description": "For several weeks now, the American right has been embroiled in a bitter internal fight about Nazis and antisemitism. Specifically, the fight has centered on...",
    "link": "https://missouriindependent.com/2025/11/18/eric-schmitt-nazis-antisemitism/",
    "timestamp": "2025-11-18T11:55:59Z"
  },
  {
    "title": "Rob Urie: American Decline in Three Parts",
    "description": "Rob Urie looks at a trifecta of failure: a looming Ukraine loss in Ukraine, desperation among workers, and the unfixable problems with generative AI",
    "link": "https://www.nakedcapitalism.com/2025/11/rob-urie-american-decline-in-three-parts.html",
    "timestamp": "2025-11-18T11:54:39Z"
  },
  {
    "title": "Is the US Trying to Set in Motion a Colour Revolution in Mexico?",
    "description": "For the moment there is no smoking gun. But the US is clearly, wilfully destabilising the country. And this effort predates Trump 2.0.",
    "link": "https://www.nakedcapitalism.com/2025/11/is-the-us-trying-to-organise-a-colour-revolution-in-mexico.html",
    "timestamp": "2025-11-18T11:45:01Z"
  },
  {
    "title": "Why Democrats can’t stay united — even in victory",
    "description": "Stagnant leadership and a culture of learned helplessness keep holding the party back",
    "link": "https://www.salon.com/2025/11/18/why-democrats-cant-stay-united-even-in-victory/",
    "timestamp": "2025-11-18T11:45:00Z"
  },
  {
    "title": "CNN Comedy Show Host Michael Ian Black Say 'I Kinda Think' Trump 'F**ked Around with Kids'",
    "description": "Michael Ian Black, comedian and host of CNN's \"Have I Got News for You,\" says he now believes President Donald Trump is guilty of having sexual relations with children.\nThe post CNN Comedy Show Host Michael Ian Black Say ‘I Kinda Think’ Trump ‘F**ked Around w…",
    "link": "https://www.breitbart.com/entertainment/2025/11/18/cnn-comedy-show-host-michael-ian-black-say-i-kinda-think-trump-fked-around-with-kids/",
    "timestamp": "2025-11-18T11:44:41Z"
  },
  {
    "title": "Glencore cuts Century Aluminum stake to 33% after tariff-driven rally",
    "description": "LONDON (Reuters) -Glencore has cut its stake in Century Aluminum by 10% to 33%, raking in millions following a share price rally ​triggered by U. tariffs on ...",
    "link": "https://finance.yahoo.com/news/glencore-cuts-century-aluminum-stake-114241356.html",
    "timestamp": "2025-11-18T11:42:41Z"
  },
  {
    "title": "How Trump's comments about Fuentes and Carlson could prolong a Republican rift over antisemitism",
    "description": "President Donald Trump is facing criticism for not condemning antisemitism within the conservative movement",
    "link": "https://abcnews.go.com/US/wireStory/trumps-comments-fuentes-carlson-prolong-republican-rift-antisemitism-127618844",
    "timestamp": "2025-11-18T11:41:29Z"
  },
  {
    "title": "Federal agents to begin immigration operations in Raleigh, mayor says",
    "description": "The mayor of Raleigh, North Carolina, said that federal agents will be continuing their operations in the area Tuesday.",
    "link": "https://abcnews.go.com/US/federal-agents-begin-immigration-operations-raleigh-mayor/story?id=127620994",
    "timestamp": "2025-11-18T11:41:06Z"
  },
  {
    "title": "How Donald Trump shifted on releasing the Jeffrey Epstein files",
    "description": "Trump called Epstein file demands a hoax but now urges Republicans to release them, saying he has nothing to hide.",
    "link": "https://www.aljazeera.com/news/2025/11/18/how-donald-trump-shifted-on-releasing-the-jeffrey-epstein-files",
    "timestamp": "2025-11-18T11:38:58Z"
  }
]