[
  {
    "title": "Colorado Rep. Jeff Hurd signs on to letter urging House leadership ‘to preserve’ Medicaid",
    "description": "The letter comes as a budget blueprint, which could contain steep Medicaid cuts, makes its way through Congress.",
    "link": "https://www.cpr.org/2025/04/16/jeff-hurd-joins-letter-against-medicaid-cuts/",
    "timestamp": "2025-04-16T23:48:57Z"
  },
  {
    "title": "Rom Braslavski: Palestinian Islamic Jihad releases first-ever video of Israeli hostage",
    "description": "A Palestinian militant group in Gaza released a video on Wednesday of Rom Braslavski, a 21-year-old Israeli soldier who was taken hostage from the Nova music festival on October 7, 2023.",
    "link": "https://www.cnn.com/2025/04/16/middleeast/rom-braslavski-hostage-video-palestinian-islamic-jihad-intl-latam/index.html",
    "timestamp": "2025-04-16T23:48:27Z"
  },
  {
    "title": "White House, Florida promote Canada drug imports while tariff threat looms",
    "description": "The White House and Florida’s state government are promoting the importation of Canadian medication as a way to lower drug costs, just a day after the United States began a process that could lead to tariffs on pharmaceuticals.\nLate Tuesday, U.S. President Do…",
    "link": "https://biztoc.com/x/ba7a272f86905bf2",
    "timestamp": "2025-04-16T23:43:33Z"
  },
  {
    "title": "Watch out for rumor that Amy Coney Barrett tried to jail Jasmine Crockett",
    "description": "U.S. Supreme Court Justice Amy Coney Barrett tried to jail Rep. Jasmine Crockett, D-Texas, who then exposed Barrett's association with a military operation that ended with the deaths of U.S. soldiers, leading Barrett to resign from the high court.",
    "link": "https://www.snopes.com//fact-check/jasmine-crockett-amy-coney-barrett-jail/",
    "timestamp": "2025-04-16T23:43:00Z"
  },
  {
    "title": "Stefanik May Propel MAGA Stardom Into New York Governor’s Race",
    "description": "New York Congresswoman Elise Stefanik’s political career in Washington has seen her go from a bipartisan lawmaker representing a mostly rural upstate district to a MAGA star soaring in President Donald Trump’s orbit.",
    "link": "https://financialpost.com/pmn/business-pmn/stefanik-may-propel-maga-stardom-into-new-york-governors-race",
    "timestamp": "2025-04-16T23:42:04Z"
  },
  {
    "title": "Trump Admin Spending Over $1 Million to Recruit 'Diverse' Talent",
    "description": "Recruiting talent for foreign service is tied between the U.S. State Department and a historically Black college.",
    "link": "https://www.newsweek.com/trump-elon-doge-payments-recruit-howard-2060729",
    "timestamp": "2025-04-16T23:36:00Z"
  },
  {
    "title": "National Weather Service prepares for ‘degraded operations’ amid cuts | Honolulu Star-Advertiser",
    "description": "The National Weather Service is preparing for the probability that fewer forecast updates will be fine-tuned by specialists, among other cutbacks, because of “severe shortages” of meteorologists and other employees, according to an internal agency document.",
    "link": "https://www.staradvertiser.com/2025/04/16/breaking-news/national-weather-service-prepares-for-degraded-operations-amid-cuts/",
    "timestamp": "2025-04-16T23:35:43Z"
  },
  {
    "title": "Can America tame Iran?",
    "description": "The expression on Benjamin Netanyahu’s face on 7 May as Donald Trump announced that the United States would begin “direct talks with Iran” suggested physical pain. Israel’s prime minister insists that Iran’s nuclear facilities must be blown up “under American…",
    "link": "https://biztoc.com/x/cf4cb2885d473622",
    "timestamp": "2025-04-16T23:32:43Z"
  },
  {
    "title": "Time 100 Most Influential People Includes Elon Musk, Mark Zuckerberg, Alex Karp And More Public Company CEOs",
    "description": "President Donald Trump was named the Time Person of the Year in 2024 and is one of the 100 people named to the 2025 Time Most Influential People list.\nAside from Trump and political leaders like J.D. Vance, Robert F. Kennedy Jr. and Javier Milei, the list als…",
    "link": "https://biztoc.com/x/75f9bf5302d853b2",
    "timestamp": "2025-04-16T23:32:35Z"
  },
  {
    "title": "Additional Recession Indicators",
    "description": "Everyone looks to the stock market to figure out if we’re heading into a recession. Sure, it has some info—for example, the market right now would tell us we definitely are—but that’s not the only recession warning sign we should be on the lookout for. If you…",
    "link": "https://www.mcsweeneys.net/articles/additional-recession-indicators",
    "timestamp": "2025-04-16T23:30:00Z"
  },
  {
    "title": "Charlie Kirk Criticizes Efforts to ‘Deport’ and ‘Imprison’ Critics of Israel: ‘Won’t Make Antisemitism Go Away’",
    "description": "Charlie Kirk criticized former U.S. ambassador to Israel David M. Friedman after Friedman celebrated Trump's recent crackdowns on critics of Israel.\nThe post Charlie Kirk Criticizes Efforts to ‘Deport’ and ‘Imprison’ Critics of Israel: ‘Won’t Make Antisemitis…",
    "link": "https://www.mediaite.com/politics/charlie-kirk-criticizes-efforts-to-deport-and-imprison-critics-of-israel-wont-make-antisemitism-go-away/",
    "timestamp": "2025-04-16T23:28:27Z"
  },
  {
    "title": "Trump reports 'big progress' in tariff talks with Japanese officials",
    "description": "WASHINGTON: President Donald Trump said there was \"big progress\" when he made the surprise move on Wednesday (Apr 17) to negotiate directly with Japanese officials about the barrage of tariffs h",
    "link": "https://www.channelnewsasia.com/east-asia/donald-trump-reports-big-progress-tariff-talks-japan-officials-5070711",
    "timestamp": "2025-04-16T23:27:11Z"
  },
  {
    "title": "U.S. Stocks Drop As Nvidia Slides And The Fog Of Trump's Trade War Thickens",
    "description": "U.S. stocks dropped as the costs of U.S. restrictions on global trade compounded.",
    "link": "https://www.huffpost.com/entry/us-stocks-drop-nvidia-slide-trump-trade-war_n_68002dade4b0485a7732bf67",
    "timestamp": "2025-04-16T23:25:55Z"
  },
  {
    "title": "Trump’s drive to lock in trade wins and end the maddening mixed messages",
    "description": "President Donald Trump’s decision to sit in on Wednesday’s trade talks with Japanese envoy Ryosei Akazawa sends a clear and excellent message: The prez wants this deal done fast, with more trade agreements to follow.",
    "link": "https://nypost.com/2025/04/16/opinion/trumps-drive-to-lock-in-trade-wins-and-end-the-maddening-mixed-messages/",
    "timestamp": "2025-04-16T23:25:48Z"
  },
  {
    "title": "ICE Agents Smash Guatemalan Immigrant's Car Window As He Calmly Waits For Lawyer",
    "description": "A spokesperson for ICE endorsed the violent force used to detain a married father in Massachusetts.",
    "link": "https://www.huffpost.com/entry/ice-agents-smash-guatemalan-immigrants-car-window-as-he-waits-for-lawyer_n_67ffca09e4b0b55f47db2669",
    "timestamp": "2025-04-16T23:23:47Z"
  },
  {
    "title": "AOC has made herself a legit White House contender — and a GOP threat",
    "description": "As Ronald Reagan put it, the American electorate rewards those who bear banners of “bold unmistakable colors” rather than “pale pastels.”",
    "link": "https://nypost.com/2025/04/16/opinion/aoc-has-made-herself-a-legit-white-house-contender-and-a-gop-threat/",
    "timestamp": "2025-04-16T23:22:23Z"
  },
  {
    "title": "Trump blocked planned Israeli strike on Iranian nuclear sites, in favor of deal talks",
    "description": "Trump's decision signals the debate resulted in a \"rough consensus, for now, against military action, with Iran signaling a willingness to negotiate,\" according to NYT.",
    "link": "https://www.jpost.com/breaking-news/article-850402",
    "timestamp": "2025-04-16T23:22:11Z"
  },
  {
    "title": "Front-runner Carney faces jabs from all sides at French-language debate",
    "description": "Liberal Leader Mark Carney faced jabs from his opponents at Wednesday's French-language leaders' debate, with accusations he's out of touch with working people and won't offer enough change from his unpopular predecessor.",
    "link": "https://www.cbc.ca/news/politics/french-language-debate-main-file-1.7512429",
    "timestamp": "2025-04-16T23:21:18Z"
  },
  {
    "title": "Even with tariffs looming, Jim Cramer says consumer companies must cut prices",
    "description": "CNBC's Jim Cramer on Wednesday told investors it is likely consumer-oriented companies will be compelled to lower prices.",
    "link": "https://www.cnbc.com/2025/04/16/even-with-tariffs-looming-jim-cramer-says-consumer-companies-must-cut-prices.html",
    "timestamp": "2025-04-16T23:17:33Z"
  },
  {
    "title": "Hillary Clinton's Warning to Americans About Abrego Garcia's Deportation",
    "description": "Kilmar Abrego Garcia was deported to El Salvador in an \"error\" by the Trump Administration.",
    "link": "https://www.newsweek.com/hillary-clinton-warning-americans-abrego-garcia-deportation-2060765",
    "timestamp": "2025-04-16T23:15:38Z"
  },
  {
    "title": "EXCLUSIVE: State Department Divide Breaks Open Between Establishment, MAGA Loyalists Over USAID Cuts",
    "description": "Inside the State Department, a battle is brewing over how to implement President Donald Trump's agenda to dismantle USAID.",
    "link": "https://dailycaller.com/2025/04/16/marco-rubio-state-department-usaid-cuts-pete-marocco/",
    "timestamp": "2025-04-16T23:14:28Z"
  },
  {
    "title": "Lebanon Bans Disney's 'Snow White' Due to Film Starring Israeli Actress Gal Gadot",
    "description": "Lebanon banned Disney's \"Snow White\" remake from playing in the country's movie theaters due to the film starring Israeli actress Gal Gadot, who is on Lebanon's boycott list.\nThe post Lebanon Bans Disney’s ‘Snow White’ Due to Film Starring Israeli Actress Gal…",
    "link": "https://www.breitbart.com/entertainment/2025/04/16/lebanon-bans-disneys-snow-white-due-to-film-starring-israeli-actress-gal-gadot/",
    "timestamp": "2025-04-16T23:12:41Z"
  },
  {
    "title": "Why Joe Rogan’s Recent Tilt Is So Dangerous",
    "description": "With guests like Ian Carroll, Darryl Cooper and a major vax denalist, the world's biggest podcaster is slowly moving from conspiracy-curious to a launderer of antisemitic and anti-scientific ideas right before our eyes.Did Douglas Murray’s arrow hit the bulls…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311452/posts",
    "timestamp": "2025-04-16T23:12:27Z"
  },
  {
    "title": "Why Joe Rogan’s Recent Tilt Is So Dangerous",
    "description": "With guests like Ian Carroll, Darryl Cooper and a major vax denalist, the world's biggest podcaster is slowly moving from conspiracy-curious to a launderer of antisemitic and anti-scientific ideas right before our eyes.Did Douglas Murray’s arrow hit the bulls…",
    "link": "https://freerepublic.com/focus/f-news/4311452/posts",
    "timestamp": "2025-04-16T23:12:27Z"
  },
  {
    "title": "Federal actions cast shadow over health outcomes in Santa Cruz County",
    "description": "“We’re really all connected,” said one local health care provider. “It’s really only when everyone in the county is able to access high quality health care that we&#82…",
    "link": "https://www.santacruzsentinel.com/2025/04/16/federal-actions-cast-shadow-over-health-outcomes-in-santa-cruz-county/",
    "timestamp": "2025-04-16T23:11:23Z"
  },
  {
    "title": "Trump's tariff policies have put Big Tech in a jam, Jim Cramer says",
    "description": "CNBC's Jim Cramer on Wednesday opined on how Trump's tariffs will impact Big Tech.",
    "link": "https://www.cnbc.com/2025/04/16/trumps-tariff-policies-have-put-big-tech-in-a-jam-jim-cramer-says-.html",
    "timestamp": "2025-04-16T23:06:09Z"
  },
  {
    "title": "Taiwan’s chip dominance faces new test as Trump targets tech reshoring",
    "description": "Donald Trump’s evolving trade policies could introduce significant uncertainty for global economies and supply chains, including those of the United States. Taiwan’s semiconductor and AI server industries may encounter heightened pressure if the U.S. pursues …",
    "link": "https://www.digitimes.com/news/a20250416PD206/taiwan-donald-trump-production-ai-server-tsmc.html",
    "timestamp": "2025-04-16T23:05:48Z"
  },
  {
    "title": "What happens next after judge warns of possible contempt prosecution over deportation flights order",
    "description": "The judge is giving the administration a chance to remedy the violation first.",
    "link": "https://www.bostonherald.com/2025/04/16/trump-deportations-what-to-know/",
    "timestamp": "2025-04-16T23:05:16Z"
  },
  {
    "title": "Analysis-More Japanese embracing foreign rice, even before it became a tariff topic",
    "description": "When a severe rice shortage sent prices skyrocketing in Japan last year, Tokyo restaurant owner Arata Hirano did what had once seemed unthinkable: he...",
    "link": "https://finance.yahoo.com/news/analysis-more-japanese-embracing-foreign-230440157.html",
    "timestamp": "2025-04-16T23:04:40Z"
  },
  {
    "title": "Trump Fires 2 Board Members of National Credit Union Administration",
    "description": "President Donald Trump fired two Democratic board members of the National Credit Union Administration (NCUA), leaving the board that traditionally has three members with just one member, Republican Chairman Kyle Hauptmann. Those who were fired are Todd Harper…",
    "link": "https://www.pymnts.com/credit-unions/2025/trump-fires-2-board-members-of-national-credit-union-administration/",
    "timestamp": "2025-04-16T23:03:31Z"
  },
  {
    "title": "'I would speak out vigorously!' Republicans who once decried IRS weaponization now silent",
    "description": "Republicans who once had their hair on fire over the use of the IRS as a political weapon are completely silent as Trump is openly doing just that, longtime Republican pollster Sarah Longwell noted in a thread posted to X on Wednesday.President Donald Trump i…",
    "link": "https://www.rawstory.com/trump-irs-2671785381/",
    "timestamp": "2025-04-16T23:02:46Z"
  },
  {
    "title": "El Salvador Blocks Sen. Van Hollen's Visit with Deported Illegal Alien",
    "description": "The government of El Salvador refused to allow Sen. Chris Van Hollen (D-MD) to see an alleged MS-13 gang member, who was mistakenly deported to the country.\nThe post El Salvador Blocks Sen. Van Hollen’s Visit with Deported Illegal Alien appeared first on Brei…",
    "link": "https://www.breitbart.com/immigration/2025/04/16/el-salvador-blocks-sen-van-hollens-visit-with-deported-illegal-alien/",
    "timestamp": "2025-04-16T23:02:28Z"
  },
  {
    "title": "Former cyber official targeted by Trump quits company over move",
    "description": "Chris Krebs, the former senior cybersecurity official whom President Donald Trump fired for affirming the 2020 presidential election was secure, is leaving his private sector cybersecurity job after he and the company were targeted by Trump last week.",
    "link": "https://www.nbcnews.com/tech/tech-news/former-cyber-official-targeted-trump-quits-company-move-rcna201656",
    "timestamp": "2025-04-16T23:02:04Z"
  },
  {
    "title": "Trump’s Tariffs Just Torched His Own Energy Agenda",
    "description": "The Trump Administration insists that U.S. shale will survive lower oil prices and could work well and innovate further at current price levels of WTI crude prices of about $60 per barrel, and even lower.   The industry is not convinced. While public statemen…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Trumps-Tariffs-Just-Torched-His-Own-Energy-Agenda.html",
    "timestamp": "2025-04-16T23:00:00Z"
  },
  {
    "title": "Trump sues Maine over transgender athletes",
    "description": "The Trump administration on Wednesday sued Maine for not complying with the government's push to ban transgender athletes in girls and women's sports, escalating a dispute over whether the state is abiding by a federal law that bars discrimination in educatio…",
    "link": "https://www.bostonherald.com/2025/04/16/trump-sues-maine-over-transgender-athletes/",
    "timestamp": "2025-04-16T22:57:55Z"
  },
  {
    "title": "AMD says US rule on chips to China could cost it $800 mn",
    "description": "Chip developer Advanced Micro Devices (AMD) on Wednesday said it expects new US  licensing requirements for semiconductors exported to China to cost it as much as $800 million. The Silicon Valley company’s earnings warning, filed with the US Securities and Ex…",
    "link": "https://www.digitaljournal.com/world/amd-says-us-rule-on-chips-to-china-could-cost-it-800-mn/article",
    "timestamp": "2025-04-16T22:57:33Z"
  },
  {
    "title": "The Pardon-to-Prison Pipeline",
    "description": "Trump granted clemency to people who keep ending up back in trouble with the law.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/04/january-6-pardon-prison-trump/682485/",
    "timestamp": "2025-04-16T22:55:00Z"
  },
  {
    "title": "S&P 500 sinks as tech stocks fall amid thickening fog of Trump’s trade war",
    "description": "U.S. stocks fell Wednesday after Nvidia warned new restrictions on exports to China will chisel billions of dollars off its results, while companies around the world said President Donald Trump’s trade war is clouding forecasts for how they and the economy wi…",
    "link": "https://www.pbs.org/newshour/economy/sp-500-sinks-as-tech-stocks-fall-amid-thickening-fog-of-trumps-trade-war",
    "timestamp": "2025-04-16T22:53:50Z"
  },
  {
    "title": "Tehran will offer nuke concessions to satisfy Trump 'victory,' ensure regime lives on",
    "description": "Steve Witkoff said that the US was \"open to compromise\" within Iran nuclear talks, only to backtrack his comments and call for the elimination of Iran's nuclear enrichment and weaponization program.",
    "link": "https://www.jpost.com/opinion/article-850363",
    "timestamp": "2025-04-16T22:53:49Z"
  },
  {
    "title": "Israel-Saudi normalization has been sidelined in favor of more realistic progress",
    "description": "The further Israel sinks into its one-state reality, the more irrelevant we become in key geopolitical considerations and regional diplomacy.",
    "link": "https://www.jpost.com/opinion/article-850362",
    "timestamp": "2025-04-16T22:53:43Z"
  },
  {
    "title": "Federal judge finds ‘probable cause’ to hold Trump administration in contempt – a legal scholar explains what this means",
    "description": "Judge James Boasberg’s order stops short of holding any government officials in contempt, but leaves open the possibility for these sanctions.",
    "link": "https://theconversation.com/federal-judge-finds-probable-cause-to-hold-trump-administration-in-contempt-a-legal-scholar-explains-what-this-means-254767",
    "timestamp": "2025-04-16T22:52:57Z"
  },
  {
    "title": "Trump Tries To Distance Himself From PA Arsonist",
    "description": "During Donald Trump's presser with the El Salvador's president yesterday, he claimed Cody Balmer, the man who set fire to Pennsylvania Governor Josh Shapiro's residence was \"no fan of his.\" This, in an effort to whitewash any connection the arsonist had with …",
    "link": "https://crooksandliars.com/2025/04/trump-tried-distance-arson-attacker-no",
    "timestamp": "2025-04-16T22:52:35Z"
  },
  {
    "title": "Trump officials threaten Harvard with foreign student ban",
    "description": "The White House said it would stop Harvard from enrolling international students if it doesn't agree to certain demands. Trump said Harvard \"teaches hate and stupidity\" and should not recieve federal funds. DW has more. The US State Department will close its …",
    "link": "https://www.dw.com/en/trump-officials-threaten-harvard-with-foreign-student-ban/live-72269083",
    "timestamp": "2025-04-16T22:49:00Z"
  },
  {
    "title": "Internal Trump administration document reveals massive budget cut proposal for federal health agencies | CNN Politics",
    "description": "The Trump administration is formulating plans to cut roughly a third of the federal health budget, eliminate dozens of programs and vastly whittle down health agencies, according to an internal document reviewed by CNN.",
    "link": "https://www.cnn.com/2025/04/16/politics/trump-rfk-jr-budget-cut-health/index.html",
    "timestamp": "2025-04-16T22:48:52Z"
  },
  {
    "title": "Seth Rogen goes rogue at science awards show to slam tech billionaires for backing Trump: 'It’s amazing how much good science you can destroy with $320 million and RFK Jr'",
    "description": "You invite Seth Rogen on stage, you take your chances, as the scientific community recently discovered.",
    "link": "https://www.pcgamer.com/gaming-industry/events-conferences/seth-rogen-goes-rogue-at-science-awards-show-to-slam-tech-billionaires-for-backing-trump-its-amazing-how-much-good-science-you-can-destroy-with-usd320-million-and-rfk-jr/",
    "timestamp": "2025-04-16T22:47:42Z"
  },
  {
    "title": "U.S. Businesses Can Benefit From International Treaties—If We Don’t Pull Out Of Them",
    "description": "The Trump administration can help our economy thrive by promoting U.S. business interests in international treaties and organizations.",
    "link": "https://www.forbes.com/sites/kristenkaufman/2025/04/16/us-businesses-can-benefit-from-international-treaties-if-we-dont-pull-out-of-them/",
    "timestamp": "2025-04-16T22:45:14Z"
  },
  {
    "title": "Carney clashes with chief rival for first time during Canada debate",
    "description": "OTTAWA (Reuters) - Prime Minister Mark Carney clashed with his chief rival for the first time during Canada's election campaign on Wednesday, in a French-language debate that could help determine who wins the April 28 vote and then deals with U.S. tariffs. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/17/carney-clashes-with-chief-rival-for-first-time-during-canada-debate",
    "timestamp": "2025-04-16T22:43:00Z"
  },
  {
    "title": "Exclusive — Guilfoyle-Mania Sweeps Greece: Hellenic Republic Ready for Kimberly as U.S. Ambassador",
    "description": "ATHENS, Greece — Kimberly Guilfoyle is already a sensation in Greece, and she has not even had her U.S. Senate confirmation hearing yet.\nThe post Exclusive — Guilfoyle-Mania Sweeps Greece: Hellenic Republic Ready for Kimberly as U.S. Ambassador appeared first…",
    "link": "https://www.breitbart.com/politics/2025/04/16/exclusive-guilfoyle-mania-sweeps-greece-hellenic-republic-ready-for-kimberly-as-u-s-ambassador/",
    "timestamp": "2025-04-16T22:40:04Z"
  },
  {
    "title": "US envoy says war in Gaza would ‘end immediately’ if captives released",
    "description": "Adam Boehler tells Al Jazeera 'nothing goes forward' on ceasefire deal until captives are released.",
    "link": "https://www.aljazeera.com/news/2025/4/16/us-envoy-says-war-in-gaza-would-end-immediately-if-captives-released",
    "timestamp": "2025-04-16T22:39:21Z"
  },
  {
    "title": "Trump admin asks IRS to revoke Harvard's tax-exempt status",
    "description": "The Trump administration has asked the Internal Revenue Service (IRS) to strip Harvard University of its tax-exempt status amid accusations of antisemitism on campus.",
    "link": "https://www.foxnews.com/politics/trump-admin-asks-irs-revoke-harvards-tax-exempt-status",
    "timestamp": "2025-04-16T22:39:19Z"
  },
  {
    "title": "Can the U.S. banish its citizens?",
    "description": "The Trump administration's move to send immigrants to a maximum security prison in El Salvador is the subject of <a href=\"https://www.npr.org/2025/04/16/g-s1-60696/judge-contempt-alien-enemies-act\">multiple on-going fights in court. <br></a><br>But in an Oval…",
    "link": "https://www.npr.org/2025/04/16/1245044470/can-the-u-s-banish-its-citizens",
    "timestamp": "2025-04-16T22:37:33Z"
  },
  {
    "title": "Trump says 'big progress' made in Japan trade talks",
    "description": "United States President Donald Trump said he met with a Japanese delegation to discuss trade matters, announcing on Truth Social that \"big progress\" was made. He described the meeting as &qu...",
    "link": "https://biztoc.com/x/22acff2eb1e1de29",
    "timestamp": "2025-04-16T22:37:20Z"
  },
  {
    "title": "Trump wants to pay immigrants under a self-deportation program",
    "description": "Trump’s recent remarks reveal how he has come to embrace the idea of self-deportation — essentially, the same proposal that earned Mitt Romney mockery in 2012.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-self-deportation-immigration-border-fox-noticias-rcna201629",
    "timestamp": "2025-04-16T22:36:45Z"
  },
  {
    "title": "America (and I) Went on a Pre-Tariff Splurge in March",
    "description": "With higher prices on the horizon, consumers have gone shopping, as reflected in retail sales figures for March. Car sales in particular were up sharply.",
    "link": "https://www.nerdwallet.com/article/cars/car-sales-march-2025#article",
    "timestamp": "2025-04-16T22:36:35Z"
  },
  {
    "title": "'I'm in ruins': MAGA MyPillow CEO insists he 'doesn't have 5 cents' to pay court tab",
    "description": "MyPillow CEO Mike Lindell told a court this week he's broke and won't be able to write a check for all of the sanctions he's been ordered to pay. Lindell claimed in court Wednesday that he and his company had \"a combined $70 million in debt.\" He said the IRS …",
    "link": "https://www.rawstory.com/mike-lindell-2671785289/",
    "timestamp": "2025-04-16T22:35:19Z"
  },
  {
    "title": "Island-wide power outage hits Puerto Rico ahead of Easter weekend",
    "description": "All 1.4 million Luma Energy clients across Puerto Rico were without power. The blackout comes less than five months after another island-wide power outage on New Year's Eve.",
    "link": "https://www.cbsnews.com/news/puerto-rico-power-outage-april-2025/",
    "timestamp": "2025-04-16T22:34:19Z"
  },
  {
    "title": "Are tariffs breaking up Trump’s working-class coalition?",
    "description": "Nearly two weeks since his “Liberation Day” tariff announcements, President Donald Trump has roundly lost the majority of the American public’s support. According to polling, his chaotic trade policy has hammered trust in his economic stewardship, his economi…",
    "link": "https://www.vox.com/politics/409112/trump-tariff-working-class-party-democrats-brand-coalition",
    "timestamp": "2025-04-16T22:34:19Z"
  },
  {
    "title": "척 슈머 처 돌았냐?",
    "description": "NEW: California Governor Gavin Newsom said his state is suing to halt President Donald Trump’s tariffs, citing harm to consumers and businesses. https://t.co/LPXXs0ihv8— Bloomberg Law (@BLaw) April 16, 2025 Sen. Chuck Schumer (D-NY) said he plans to block the…",
    "link": "https://ryueyes11.tistory.com/511567",
    "timestamp": "2025-04-16T22:30:41Z"
  },
  {
    "title": "US shuts down Biden-era ‘censorship’ agency",
    "description": "The US has shut down the State Department’s “disinformation” office Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615865-us-state-dept-shuts-biden/",
    "timestamp": "2025-04-16T22:26:43Z"
  },
  {
    "title": "Shein, Temu to get pricier as Trump cracks down on cheap imports",
    "description": "The two companies said they will be increasing prices starting April 25 and encouraged shoppers to purchase \"now at today's rates\".",
    "link": "https://www.abc.net.au/news/2025-04-17/shein-temu-to-get-pricier-as-trump-cracks-down-on-cheap-imports/105186260",
    "timestamp": "2025-04-16T22:26:01Z"
  },
  {
    "title": "Trump cites ‘big progress’ after talks with Japan on tariff deal",
    "description": "The talks were aimed at securing a deal that would avoid higher levies Trump has threatened against U.S. trading partners.",
    "link": "https://www.japantimes.co.jp/business/2025/04/17/economy/trump-japan-trade-talks/",
    "timestamp": "2025-04-16T22:26:00Z"
  },
  {
    "title": "IRS Is Considering Revoking Harvard’s Tax-Exempt Status After School Rejects Trump’s Demands",
    "description": "The Trump administration on Monday froze $2.2 billion in federal funding for Harvard after the school refused to agree to a list of White House demands.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/16/irs-is-considering-revoking-harvards-tax-exempt-status-after-school-rejects-trumps-demands/",
    "timestamp": "2025-04-16T22:23:29Z"
  },
  {
    "title": "Trump's Trade War Ripples Through Business World, Hits Stocks Again",
    "description": "The ripple effects of Trump&#039;s global trade war are increasingly being felt across numerous industries all at once and on Wednesday were once again exerting pressure on U.S. stock markets that have been roiled for weeks by his erratic trade policies.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-trade-war-ripples-through-business-world-hits-stocks-again-8183120",
    "timestamp": "2025-04-16T22:23:17Z"
  },
  {
    "title": "White House Fires Back After Judge Boasberg Issues 'Criminal Contempt' Decision Against Trump Admin",
    "description": "Judge James Boasberg issued an order Wednesday stating that he has found probable cause to hold the Trump administration in contempt.",
    "link": "https://www.westernjournal.com/white-house-fires-back-judge-boasberg-issues-criminal-contempt-decision-trump-admin/",
    "timestamp": "2025-04-16T22:22:58Z"
  },
  {
    "title": "Trump expands role of Adam Boehler as special envoy for hostage response",
    "description": "US President grants Adam Boehler broad authority to coordinate across government agencies on hostage-related matters. The move follows controversy over Boehler’s meeting with Hamas and comes as efforts intensify to secure the release of American hostages in G…",
    "link": "https://www.israelnationalnews.com/news/406944",
    "timestamp": "2025-04-16T22:22:44Z"
  },
  {
    "title": "California sues US government over Trump tariffs",
    "description": "California is suing the federal government over Donald Trump's on-again-off-again tariffs, the governor and attorney general said Wednesday, claiming the American president does not have the right to impose them.The move marks the strongest pushback yet again…",
    "link": "https://www.rawstory.com/newsom-vs-trump-2671785445/",
    "timestamp": "2025-04-16T22:21:53Z"
  },
  {
    "title": "Trump admin and Gov. Hochul in war of words over explosive claims she threatened president with her power over NY appeal judges",
    "description": "White House sources claim Gov. Hochul told President Trump “I control the judges” during a February meeting in the Oval Office to discuss policy issues such as the Manhattan congestion tax.",
    "link": "https://nypost.com/2025/04/16/opinion/trump-admin-and-gov-hochul-in-war-of-words-over-explosive-claims-she-threatened-president-with-her-power-over-ny-appeal-judges/",
    "timestamp": "2025-04-16T22:21:47Z"
  },
  {
    "title": "The fate of this beloved American creature is in Trump’s hands",
    "description": "In late 2021, I stood in a forest about two hours from Mexico City and watched as a river of butterflies passed overhead. They were monarchs — the iconic, Halloween-colored butterflies — and they were coming here from the US to rest for the cold winter months…",
    "link": "https://www.vox.com/down-to-earth/408915/endangered-species-monarch-butterfly-recovery-trump-climate",
    "timestamp": "2025-04-16T22:21:18Z"
  },
  {
    "title": "Are Shein and Temu Prices Going Up Amid Trump's Tariffs? What to Know",
    "description": "The e-commerce price hikes follow the Trump administration's decision to impose a 145 percent tariff on goods shipped from China.",
    "link": "https://www.newsweek.com/are-shein-temu-prices-going-amid-trumps-tariffs-what-know-2060762",
    "timestamp": "2025-04-16T22:19:40Z"
  },
  {
    "title": "Former cybersecurity agency chief Chris Krebs leaves SentinelOne after Trump targets him in executive order",
    "description": "A week after President Trump specifically targeted Chris Krebs in an executive order, the former head of CISA has left SentinelOne.",
    "link": "https://www.cnbc.com/2025/04/16/former-cisa-chief-krebs-leaves-sentinelone-after-trump-exec-order.html",
    "timestamp": "2025-04-16T22:19:39Z"
  },
  {
    "title": "El Salvador rejects US senator's plea to free wrongly deported migrant",
    "description": "A US federal judge has ordered the man’s return to the United States.",
    "link": "https://www.thejournal.ie/el-salvador-rejects-us-senators-plea-to-free-wrongly-deported-migrant-6680390-Apr2025/",
    "timestamp": "2025-04-16T22:18:33Z"
  },
  {
    "title": "TikTok tests letting users add informative ‘Footnotes’",
    "description": "The feature being tested in the United States, where the short-form video sharing app has some 170 million users.\nThe post TikTok tests letting users add informative ‘Footnotes’ appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/tiktok-tests-letting-users-add-informative-footnotes/article",
    "timestamp": "2025-04-16T22:18:18Z"
  },
  {
    "title": "Gov. Janet Mills Doesn’t Know It Yet, But She’s an ‘Insurrectionist’",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Gov. Janet Mills Doesn’t Know It Yet, But She’s an ‘Insurrectionist’ ap…",
    "link": "https://www.dailysignal.com/2025/04/16/gov-janet-mills-doesnt-know-it-yet-but-shes-an-insurrectionist/",
    "timestamp": "2025-04-16T22:18:15Z"
  },
  {
    "title": "Breaking down claims that China halted all its orders of Boeing planes",
    "description": "The claim came from a Bloomberg News report based on anonymous sources.",
    "link": "https://www.snopes.com//news/2025/04/16/china-cancels-boeing-order/",
    "timestamp": "2025-04-16T22:18:00Z"
  },
  {
    "title": "Chinese e-commerce sites Temu and Shein say they’re raising prices due to tariffs",
    "description": "China-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week.",
    "link": "https://www.clickorlando.com/business/2025/04/16/chinese-e-commerce-sites-temu-and-shein-say-theyre-raising-prices-due-to-tariffs/",
    "timestamp": "2025-04-16T22:15:28Z"
  },
  {
    "title": "Trump to Join Japan Talks on Tariffs, Military Support",
    "description": "US President Donald Trump said he’ll attend a meeting Wednesday with Japan to negotiate tariffs, American military support and “trade fairness.”\n“Hopefully something can be worked out which is good (GREAT!) for Japan and the USA!” Trump wrote in a post on Tru…",
    "link": "https://biztoc.com/x/dd74ee1557d30d29",
    "timestamp": "2025-04-16T22:15:20Z"
  },
  {
    "title": "George Clooney says there should have been a Democratic primary after Biden dropped out | CNN Politics",
    "description": "Actor and major Democratic donor George Clooney told CNN there should have been a primary election last summer after then-President Joe Biden dropped out of the presidential race, while sharing which Democrat has caught his attention for 2028.",
    "link": "https://www.cnn.com/2025/04/16/politics/george-clooney-biden-wes-moore-cnntv/index.html",
    "timestamp": "2025-04-16T22:14:31Z"
  },
  {
    "title": "Report: IRS Plans to Revoke Harvard’s Tax-Exempt Status",
    "description": "The Internal Revenue Service is reportedly planning to rescind Harvard University’s tax-exempt status amid its showdown with the Trump administration over academic freedom, CNN reported.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/04/16/report-irs-plans-revoke-harvards-tax-exempt-status",
    "timestamp": "2025-04-16T22:11:00Z"
  },
  {
    "title": "Iran Warns Six Neighboring Countries They Will Be Targeted If Aiding Any Potential US Attack",
    "description": "While Trump may have preferred that Iran capitulated to his threats to bomb them if it refused to come to Trump’s unweildly negotiations table, the Iranian government has decided instead to push back firmly against Trump’s crazed demands, with Tehran now warn…",
    "link": "https://www.activistpost.com/iran-warns-six-neighboring-countries-they-will-be-targeted-if-aiding-any-potential-us-attack/",
    "timestamp": "2025-04-16T22:10:00Z"
  },
  {
    "title": "Judge escalates deportation fight",
    "description": "A federal judge on Wednesday said he has found probable cause to hold the Trump administration in criminal contempt of court and warned he could seek officials' prosecution for violating his orders last month to turn around planes carrying deportees to an El …",
    "link": "https://www.bostonherald.com/2025/04/16/judge-escalates-deportation-fight/",
    "timestamp": "2025-04-16T22:09:23Z"
  },
  {
    "title": "Marquette student's visa revoked amid Trump administration crackdown",
    "description": "The Trump administration terminated a Marquette University student's visa amid a nationwide immigration crackdown.",
    "link": "https://www.fox6now.com/news/trump-student-visas-marquette-university-president",
    "timestamp": "2025-04-16T22:08:33Z"
  },
  {
    "title": "Beijing Red-Faced As Ukraine Breaks Humanitarian Law To Prove China Wrong",
    "description": "After China&#039;s outright denial of its citizens fighting the war alongside Russians, Ukraine decided to take some drastic actions.",
    "link": "https://www.ndtv.com/world-news/ukraine-war-beijing-red-faced-as-kyiv-breaks-humanitarian-law-to-prove-china-wrong-8183057",
    "timestamp": "2025-04-16T22:07:24Z"
  },
  {
    "title": "‘Maybe go to the grocery store’: CNN conservative cuts off congressman in fiery clash",
    "description": "CNN conservative Scott Jennings sparked an on-air clash with Rep. Robert Garcia (D-CA) as the two found themselves on opposite sides of the brewing debate over the deportation of Kilmar Abrego Garcia – and the Democratic efforts to retrieve him.The heated exc…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2671785344/",
    "timestamp": "2025-04-16T22:07:08Z"
  },
  {
    "title": "Rachel Morin’s Mother Blasts Sen. Van Hollen for Trying to Free Suspected MS-13 Member",
    "description": "\"And to have a senator from Maryland who didn't even acknowledge or barely acknowledged my daughter and the brutal death that she endured..so that he can use my taxpayer money to fly to El Salvador to bring back someone that's not even an American citizen.\"\nT…",
    "link": "https://legalinsurrection.com/2025/04/rachel-morins-mother-blasts-sen-van-hollen-for-trying-to-free-suspected-ms-13-member/",
    "timestamp": "2025-04-16T22:06:35Z"
  },
  {
    "title": "Trump’s Mysterious Hand Bruise Reappears During Navy Trophy Presentation as Health Speculation Grows",
    "description": "A large, dark bruise on Donald Trump’s right hand is once again raising eyebrows — this time during a high-profile ceremony at the White House. The mark was clearly visible as the 78-year-old President handed the Commander-in-Chief’s Trophy to the Navy footba…",
    "link": "https://dailyboulder.com/trumps-mysterious-hand-bruise-reappears-during-navy-trophy-presentation-as-health-speculation-grows/",
    "timestamp": "2025-04-16T22:06:25Z"
  },
  {
    "title": "Republican States Pause Lawsuit Against SEC Over Crypto Authority",
    "description": "Crypto lobbyists also dropped a lawsuit against the IRS.",
    "link": "https://www.coindesk.com/policy/2025/04/16/republican-states-pause-lawsuit-against-sec-over-crypto-authority",
    "timestamp": "2025-04-16T22:05:15Z"
  },
  {
    "title": "White House restricts wire services’ access to Trump",
    "description": "The Associated Press says that a new White House media policy violates a court order by giving the administration sole discretion over who gets to question President Donald Trump, and the news agency asked a federal judge on Wednesday to enforce that order.\nT…",
    "link": "https://biztoc.com/x/ed89b4c6621d86ef",
    "timestamp": "2025-04-16T22:04:00Z"
  },
  {
    "title": "Chinese e-commerce sites Temu and Shein say they’re raising prices due to tariffs",
    "description": "Both companies said they would be making “price adjustments” starting April 25.",
    "link": "https://www.bostonherald.com/2025/04/16/tariffs-temu-shein-prices/",
    "timestamp": "2025-04-16T22:03:57Z"
  },
  {
    "title": "Trump Administration Halts Major New York Offshore Wind Project",
    "description": "U.S. Interior Secretary Doug Burgum has ordered an immediate halt to construction on Equinor’s Empire Wind project off the coast of New York, marking a significant development for the U.S....",
    "link": "https://gcaptain.com/trump-administration-halts-major-new-york-offshore-wind-project/",
    "timestamp": "2025-04-16T22:03:39Z"
  },
  {
    "title": "Chinese e-commerce sites Temu and Shein say they’re raising prices due to tariffs",
    "description": "NASHVILLE, Tenn. (AP) — China-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump’s attempts to correct the trade imbalance between the world’s two largest ec…",
    "link": "https://financialpost.com/pmn/chinese-e-commerce-sites-temu-and-shein-say-theyre-raising-prices-due-to-tariffs",
    "timestamp": "2025-04-16T22:02:22Z"
  },
  {
    "title": "President Trump Planning Launch of New Monopoly-Inspired Crypto Game: Report",
    "description": "President Donald Trump is reportedly planning on launching a new crypto video game inspired by the popular board game Monopoly. According to a new report by Fortune, an anonymous source familiar with the matter says that Trump is further venturing into the wo…",
    "link": "https://dailyhodl.com/2025/04/16/president-trump-planning-launch-of-new-monopoly-inspired-crypto-game-report/",
    "timestamp": "2025-04-16T22:01:31Z"
  },
  {
    "title": "TSMC Q1 profit set to jump, but Trump's policies cloud its future",
    "description": "TAIPEI : TSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57 per cent leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade po…",
    "link": "https://www.channelnewsasia.com/business/tsmc-q1-profit-set-jump-trumps-policies-cloud-its-future-5070636",
    "timestamp": "2025-04-16T22:01:28Z"
  },
  {
    "title": "Anti-Trump progressives see fundraising boom: From the Politics Desk",
    "description": "Vocal anti-Trump progressives like Bernie Sanders and AOC posted massive fundraising hauls during the first three months of the year.",
    "link": "https://www.nbcnews.com/politics/politics-news/anti-trump-progressives-fundraising-boom-politics-desk-rcna201652",
    "timestamp": "2025-04-16T22:00:22Z"
  },
  {
    "title": "Commentary: What Donald Trump’s tariffs might end up doing to Taiwan",
    "description": "Taiwan can little afford Donald Trump’s 32 per cent tariff and China knows that, says J Capital Research’s Anne Stevenson-Yang.",
    "link": "https://www.channelnewsasia.com/commentary/trump-tariffs-china-trade-taiwan-tsmc-chips-5069436",
    "timestamp": "2025-04-16T22:00:00Z"
  },
  {
    "title": "US Oil Production to Peak in 2027, Natural Gas by 2032: EIA",
    "description": "The idea of peak oil is familiar to most readers. It refers to the point at which global petroleum production reaches its maximum point and begins an irreversible decline. The concept was first introduced by M. King Hubbert in the 1950s. His theory proposed t…",
    "link": "https://oilprice.com/Energy/Crude-Oil/US-Oil-Production-to-Peak-in-2027-Natural-Gas-by-2032-EIA.html",
    "timestamp": "2025-04-16T22:00:00Z"
  }
]