[
  {
    "title": "2 Incredible Stocks I'm Buying in the Stock Market Downturn",
    "description": "In This Article:\nEver since President Donald Trump announced his tariff plan, there's been no shortage of stocks that are trading for a big discount to their previous highs. This includes some of the most rock-solid brands in the world.\nI've been gradually ta…",
    "link": "https://biztoc.com/x/176ec5b24e8e1820",
    "timestamp": "2025-04-09T10:09:59Z"
  },
  {
    "title": "Trump’s trade war: the hidden cost for US packaging firms",
    "description": "With Donald Trump in his second term in office, the economic landscape in the US continues to reflect the long-lasting impacts of his trade policies, particularly within industries like packaging.\nThough the headlines during the US-China trade war of 2018-201…",
    "link": "https://biztoc.com/x/c339fd10713e0515",
    "timestamp": "2025-04-09T10:09:53Z"
  },
  {
    "title": "Is China Negotiating or Retaliating? Weaker Yuan Is a Flashpoint",
    "description": "4 min ago\nIs China Negotiating or Retaliating? Weaker Yuan Is a Flashpoint.\nChina is signaling it could be ready to talk over tariffs but the weakening of its currency is likely to anger President Donald Trump.\nBeijing on Wednesday called for dialogue with th…",
    "link": "https://biztoc.com/x/661a69f0a78fbb25",
    "timestamp": "2025-04-09T10:08:44Z"
  },
  {
    "title": "Trump signs executive orders to boost coal mining and energy production: ‘We’re ending Joe Biden’s war on beautiful, clean coal once and for all’",
    "description": "President Donald Trump on Tuesday signed a series of executive orders aimed at boosting the struggling coal industry, a reliable but polluting energy source that’s long been in decline.\nUnder the four orders, Trump uses his emergency authority to allow some o…",
    "link": "https://biztoc.com/x/024f157f64594445",
    "timestamp": "2025-04-09T10:08:43Z"
  },
  {
    "title": "Who stands to lose from Trump’s stock market chaos?",
    "description": "Traders work on the floor of the New York Stock Exchange on April 7, 2025. | Michael Nagle/Bloomberg via Getty Images\nThe US stock market has lost trillions of dollars in value in the days since President Donald Trump announced major tariffs on American impor…",
    "link": "https://biztoc.com/x/aa791920ad113266",
    "timestamp": "2025-04-09T10:08:34Z"
  },
  {
    "title": "New Mexico governor mobilizes National Guard to tackle crime emergency in Albuquerque",
    "description": "Gov. Michelle Lujan Grisham on Tuesday declared a state of emergency in New Mexico’s largest city, saying that a significant increase in crime in Albuquerque warrants the help of the New Mexico National Guard.",
    "link": "https://www.nbcnews.com/news/us-news/new-mexico-governor-mobilizes-national-guard-tackle-crime-emergency-al-rcna200354",
    "timestamp": "2025-04-09T10:08:14Z"
  },
  {
    "title": "Suspected US strikes in Yemen kill at least 8 people, Houthi rebels say",
    "description": "Suspected U.S. airstrikes have pounded the area around Yemen’s Red Sea port city of Hodeida, killing at least eight people and wounding 16 others",
    "link": "https://abcnews.go.com/International/wireStory/suspected-us-strikes-yemen-kill-8-people-houthi-120605234",
    "timestamp": "2025-04-09T10:06:25Z"
  },
  {
    "title": "Netanyahu-Trump Meeting Reveals Unexpected Gaps on Key Issues",
    "description": "Here is a look at where Israeli Prime Minister Benjamin Netanyahu and U.S. President Donald Trump appear to have diverged.",
    "link": "https://time.com/7275986/netanyahu-trump-meeting-reveals-unexpected-gaps-on-key-issues/",
    "timestamp": "2025-04-09T10:05:53Z"
  },
  {
    "title": "Fed minutes may show scope of tariff debate ahead of Trump's 'Liberation Day'",
    "description": "How concerned Federal Reserve officials were over stagflation risks as they met last month may become more clear on Wednesday in a readout of a gathering...",
    "link": "https://ca.finance.yahoo.com/news/fed-minutes-may-show-scope-100546597.html",
    "timestamp": "2025-04-09T10:05:46Z"
  },
  {
    "title": "The heavy toll of Trump’s trade war on America’s small retailers",
    "description": "While Trump aims to strengthen domestic manufacturing, small retailers are grappling with the fallout of increased costs, logistical disruptions, and market ...",
    "link": "https://www.retail-insight-network.com/news/the-heavy-toll-of-trumps-trade-war-on-americas-small-retailers/",
    "timestamp": "2025-04-09T10:03:35Z"
  },
  {
    "title": "Trump’s trade war: the hidden cost for US packaging firms",
    "description": "Amid the noise of tariff battles and political soundbites, one industry quietly absorbed the shockwaves of America’s trade upheaval: packaging.",
    "link": "https://www.packaging-gateway.com/news/trumps-trade-war-the-hidden-cost-for-us-packaging-firms/",
    "timestamp": "2025-04-09T10:03:31Z"
  },
  {
    "title": "US podcasts leader who backed Trump are now questioning tariffs",
    "description": "As President Donald Trump's tariffs roil global markets, some of the thought leaders and influential podcasters who backed the Republican's campaign are voicing doubts. Media pesonalities like Joe Rogan and Ben Shaprio are adding their voices to a number of c…",
    "link": "https://www.france24.com/en/video/20250409-us-podcasts-leaders-angry-with-trump-tariffs",
    "timestamp": "2025-04-09T10:03:18Z"
  },
  {
    "title": "I’m a Tax Expert: 4 Predictions I Have for Trump’s Tax Plan in 2025",
    "description": "President Donald Trump's second term has been defined by volatility and uncertainty. Early on, he proposed replacing income taxes with tariffs, and, after...",
    "link": "https://finance.yahoo.com/news/m-tax-expert-4-predictions-100310480.html",
    "timestamp": "2025-04-09T10:03:10Z"
  },
  {
    "title": "U.S. Wind Power Growth Will Be 40% Lower Than Expected Due to Trump Policy",
    "description": "Despite a relatively stable short-term pipeline of U.S. wind power projects under construction, the five-year outlook of America’s wind capacity additions has been significantly limited due to the Trump Administration’s energy policies, Wood Mackenzie said in…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Wind-Power-Growth-Will-Be-40-Lower-Than-Expected-Due-to-Trump-Policy.html",
    "timestamp": "2025-04-09T10:02:04Z"
  },
  {
    "title": "No, Mr. President, Executive Orders Are Not Royal Decrees | Opinion",
    "description": "President Donald Trump's promise to be a \"dictator on day one\" was not an empty threat. The beginning of his second term has been marked by an egregious presidential power grab.",
    "link": "https://www.newsweek.com/no-mr-president-executive-orders-are-not-royal-decrees-opinion-2057160",
    "timestamp": "2025-04-09T10:01:01Z"
  },
  {
    "title": "Trump tariffs could slash Bitcoin miner prices abroad, warns mining exec",
    "description": "Trump's tariffs disrupt U.S. Bitcoin mining, shaking confidence, slashing stocks, and boosting global market opportunities.",
    "link": "https://ambcrypto.com/trump-tariffs-could-slash-bitcoin-miner-prices-abroad-warns-mining-exec/",
    "timestamp": "2025-04-09T10:00:57Z"
  },
  {
    "title": "Terence Corcoran: Trump’s tariffs promote rising interventionism",
    "description": "Donald Trump’s tariffs promote rising interventionism, while Elon Musk promotes the ideas of free-trade advocate Milton Friedman. Read more.",
    "link": "https://financialpost.com/opinion/trump-tariffs-promote-rising-interventionism",
    "timestamp": "2025-04-09T10:00:49Z"
  },
  {
    "title": "Nuveen Green Capital’s Jessica Bailey, Alexandra Cooley Pioneer C-PACE Movement",
    "description": "A visual in the Darien, Conn., headquarters of Nuveen Green Capital (NGC) provides a daily reminder of how far the company and the Commercial Property Assessed Clean Energy (C-PACE) lending sector it specializes in has grown over the past decade as the indust…",
    "link": "http://commercialobserver.com/2025/04/nuveen-green-capital-jessica-bailey-alexandra-cooley-c-pace/",
    "timestamp": "2025-04-09T10:00:29Z"
  },
  {
    "title": "A photographic history of Five Points and other books for Coloradans",
    "description": "For nearly 40 years, beginning in 1938, Burnis \"Mac\" McCloud photographed Denver’s Five Points.",
    "link": "https://www.denverpost.com/2025/04/09/book-review-mac-mccloud-five-points-william-wyckoff/",
    "timestamp": "2025-04-09T10:00:17Z"
  },
  {
    "title": "NATO’s Article 5 is on life support",
    "description": "President Trump is taking a sledgehammer to 75 years of consensus understanding of NATO's collective defense commitment.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/nato-article-5-collective-defense-trump-rcna196981",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "Why Elite Colleges Aren’t Pushing Back on Trump, and Why Silence Is Dangerous",
    "description": "America is witnessing an unprecedented series of attacks on higher education that commenced well before Donald Trump was re-elected, amid the contentious protests that followed Hamas’ attacks on Israel and Israel’s ruthless (and ongoing) retaliation on Gaza a…",
    "link": "https://www.motherjones.com/politics/2025/04/elite-ivy-league-colleges-caving-trump-administration-endowment-donors-deals-harvard-columbia-princeton-charlie-eaton-interview/",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "How Trump’s Tariffs Could Lead to a Global Recession",
    "description": "Economists warn the U.S. economy may suffer most—but a range of knock-on effects will ripple across the world.",
    "link": "https://time.com/7275987/trump-tariffs-global-economy-recession-trade-war-asia-world-impacts/",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "Trump’s tariffs are a farce. We who are in Congress can — and must — act.",
    "description": "President Trump fabricated an emergency under the International Emergency Economic Powers Act, but we in Congress should end this sham emergency and his tariffs.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-congress-resolution-house-democrats-rcna200305",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "Republicans who say they didn't vote for this economic crisis are wrong",
    "description": "As Bill Ackman, Elon Musk and others turn on Trump over tariffs, it's worth remembering that this is exactly what Trump promised.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/tariffs-trump-china-republican-regret-ackman-rcna200205",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "The Best “New” Idea for Middle East Peace? It’s 25 Years Old.",
    "description": "On February 4, President Donald Trump came up with one of his trademark tremendous ideas. Vacate the entire Gaza Strip and turn it into the Las Vegas Strip. Here was the agent of chaos, a.k.a. the president of the United States, blurting out a paradigm-breaki…",
    "link": "https://newrepublic.com/article/193526/israel-palestine-middle-east-peace-gaza-trusteeship",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": " The calm before the storm?",
    "description": "Good morning, Quartz readers!Read more...",
    "link": "https://qz.com/emails/daily-brief/1851775363/the-calm-before-the-storm",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "In Canada's election campaign, a warming planet sits on the back burner",
    "description": "All three main federalist parties have vowed to keep the consumer carbon tax dead and buried. If you're looking for something more ambitious in the way of climate policy in this election, prepare to be underwhelmed.",
    "link": "https://www.cbc.ca/news/canada/manitoba/climate-election-1.7505024",
    "timestamp": "2025-04-09T10:00:00Z"
  },
  {
    "title": "Duelling visions for Canada’s future kick off in Ottawa",
    "description": "As US President Donald Trump unravels the status quo, something will have to be built to replace it. In Ottawa this week, the country's left and right wings are separately trying to hash out what that new vision is.",
    "link": "https://www.nationalobserver.com/2025/04/08/news/duelling-visions-canadas-future-kick-ottawa",
    "timestamp": "2025-04-09T09:59:46Z"
  },
  {
    "title": "What India Can Learn from the New US Federal AI Strategy",
    "description": "The federal AI strategy seeks to promote responsible AI usage to boost the efficiency of agencies but lacks clarity on data training and boundaries of the use cases. \nThe post What India Can Learn from the New US Federal AI Strategy appeared first on MEDIANAM…",
    "link": "https://www.medianama.com/2025/04/223-what-india-learn-us-federal-ai-strategy/",
    "timestamp": "2025-04-09T09:59:39Z"
  },
  {
    "title": "Focus on earnings not Trump tariffs, says HSBC, picks RIL, ICICI Bank stocks in ‘India Five’ bets",
    "description": "HSBC Global Research highlights five Indian stocks—TVS Motor, RIL, Shriram Finance, ICICI Bank, and Adani Ports—for their structural strengths, profitability, and earnings visibility, advising investors to focus on fundamentals over geopolitical tensions and …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/focus-on-earnings-not-trump-tariffs-says-hsbc-picks-ril-icici-bank-stocks-in-india-five-bets/articleshow/120123768.cms",
    "timestamp": "2025-04-09T09:59:03Z"
  },
  {
    "title": "China's Options Against US Economy As Trump's Tariffs Bite",
    "description": "A Chinese commentator affiliated with state media has outlined a number of possible countermeasures Beijing could take if President Donald Trump proceeds with another round of sweeping tariffs on Chinese goods.\nChina's Foreign Ministry has vowed to \"fight to …",
    "link": "https://biztoc.com/x/352f77b052e6d4df",
    "timestamp": "2025-04-09T09:58:11Z"
  },
  {
    "title": "China calls US trade surplus 'inevitable', warns it's ready for trade war",
    "description": "China on Wednesday called its trade surplus with the United States an inevitability and warned it had the \"determination and means\" to continue the fight if Trump kept hitting Chinese goods with tariffs to try and bring it down.\nU.S. President Donald Trump de…",
    "link": "https://biztoc.com/x/bdb06f443a341ef9",
    "timestamp": "2025-04-09T09:58:03Z"
  },
  {
    "title": "China vows to fight tariffs to the end, saying trade with US is already balanced",
    "description": "China again vowed to “fight to the end” against Donald Trump’s tariffs in a lengthy policy statement published Wednesday, while arguing that trade between the two countries is in balance as a 104% tax on the country’s exports to the U.S. came into effect.",
    "link": "https://www.news4jax.com/news/world/2025/04/09/china-vows-to-fight-tariffs-to-end-saying-trade-with-us-is-already-balanced/",
    "timestamp": "2025-04-09T09:57:37Z"
  },
  {
    "title": "Trump Tariffs Take Effect; Vicious Treasury Sell-Off",
    "description": "On today's podcast: 1) President Donald Trump’s so-called reciprocal tariffs are now in place, dealing a thunderous blow to the world economy as he pushes forward efforts to drastically reorder global trade. 2) China hasn’t immediately responded to the new US…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trump-tariffs-take-effect-vicious-treasury-sell-off",
    "timestamp": "2025-04-09T09:57:04Z"
  },
  {
    "title": "Bank of England warns UK is exposed to risks of global hit from Trump tariffs",
    "description": "Risks of a hit to the global economy and further sharp falls in financial markets have grown due to U.S. President Donald Trump's import tariffs and the UK...",
    "link": "https://finance.yahoo.com/news/bank-england-warns-uk-exposed-095704884.html",
    "timestamp": "2025-04-09T09:57:04Z"
  },
  {
    "title": "India Backs EV Tariff Cuts for Trump Trade Deal Amidst Auto Lobby Opposition: Report",
    "description": "India plans to lower import tariffs on electric cars, rejecting requests from local automakers to delay such cuts by four years.",
    "link": "https://www.ndtv.com/auto/india-backs-ev-tariff-cuts-for-trump-trade-deal-amidst-auto-lobby-opposition-report-8124104",
    "timestamp": "2025-04-09T09:56:35Z"
  },
  {
    "title": "In US-China trade war, Indian tyre makers could be collateral damage",
    "description": "Indian tyre makers and other auto parts manufacturers were spared additional US tariffs on 2 April above the 25% levy imposed on the global auto sector a week earlier. But the escalating global trade war brings fresh tension.",
    "link": "https://www.livemint.com/industry/indian-tyre-exporters-us-china-trade-war-europe-latin-america-supply-chain-diversion-mrf-ceat-apollo-tyres-balkrishna-11744171125039.html",
    "timestamp": "2025-04-09T09:56:12Z"
  },
  {
    "title": "China's Options Against US Economy As Trump's Tariffs Bite",
    "description": "The lastest round of U.S. tariffs, including a 104-percent blanket duty on Chinese goods, when into effect Wednesday.",
    "link": "https://www.newsweek.com/china-countermeasures-us-economy-trump-tariffs-2057006",
    "timestamp": "2025-04-09T09:52:34Z"
  },
  {
    "title": "BOE Warns Risk of ‘Further Sharp Corrections’ in Markets Is High",
    "description": "The Bank of England said hedge funds have faced “significant” margin calls from their prime brokers as they navigated extreme market volatility in the aftermath of US President Donald Trump’s tariff announcements and warned that the risk of “further sharp cor…",
    "link": "https://financialpost.com/pmn/business-pmn/boe-warns-risk-of-further-sharp-corrections-in-markets-is-high",
    "timestamp": "2025-04-09T09:52:21Z"
  },
  {
    "title": "China calls on India to join forces in trade war against US",
    "description": "A Chinese official has said Beijing and New Delhi should work together to overcome the challenges posed by US tariffs Read Full Article at RT.com",
    "link": "https://www.rt.com/india/615430-china-calls-on-india-trump-tariff/",
    "timestamp": "2025-04-09T09:52:00Z"
  },
  {
    "title": "Ken Paxton's Chances of Beating John Cornyn in Texas: Polls",
    "description": "Senator Cornyn described Paxton as \"a fraud\" after he announced his Senate bid.",
    "link": "https://www.newsweek.com/ken-paxtons-chances-beating-john-cornyn-texas-polls-2057284",
    "timestamp": "2025-04-09T09:50:15Z"
  },
  {
    "title": "What Is The 'Fell For It Again Award' Meme? The 'Got What I Voted For Award' Meme And Other Variants Explained",
    "description": "Let’s break down the origin of the Fell For It Again Award meme and its bizarre variants.",
    "link": "https://knowyourmeme.com/editorials/guides/what-is-the-fell-for-it-again-award-meme-the-got-what-i-voted-for-award-meme-and-other-variants-explained",
    "timestamp": "2025-04-09T09:48:59Z"
  },
  {
    "title": "Trump says he told Taiwan's TSMC he'd slap a 100% tax on it if it didn't make its chips in the US",
    "description": "In March, TSMC said it would invest $100 billion to build five new chip factories in the US.\n- President Donald Trump said he threatened TSMC with taxes if it didn't manufacture in the US.\n- \"These chip companies are loaded,\" Trump said.\nPresident Donald Trum…",
    "link": "https://biztoc.com/x/b201c3a68c5c13fd",
    "timestamp": "2025-04-09T09:47:13Z"
  },
  {
    "title": "Could China’s Strategic Pivot to Global South Spell Trouble for US?",
    "description": "Additional tariffs on Chinese goods at 104% will remain in place \"until they make a deal with us,\" US President Donald Trump said at the NRCC Dinner on Tuesday evening.",
    "link": "https://sputnikglobe.com/20250409/could-chinas-strategic-pivot-to-global-south-spell-trouble-for-us--1121844252.html",
    "timestamp": "2025-04-09T09:47:13Z"
  },
  {
    "title": "Donald Trump Administration Warns Migrants of Nearly $1,000 Fine per Day",
    "description": "Illegal immigrants could face fines of up to $998 per day if they fail to self-deport, under plans by the Donald Trump administration.\n\"Illegal aliens should use the CBP [Customs and Border Protection] Home app to self-deport and leave the country now. If the…",
    "link": "https://biztoc.com/x/6f75e2aab8d85a04",
    "timestamp": "2025-04-09T09:47:11Z"
  },
  {
    "title": "10-year Treasury yield spikes higher as Trump tariffs continue to rattle markets",
    "description": "U.S. Treasury yields surged Wednesday as U.S. President Donald Trump's tariffs regime continued to rattle markets.\nAt 5:40 a.m. ET, the 10-year Treasury jumped 10 basis points to 4.363%, with the 2-year Treasury yield rising 7 points to 3.808%.\nOne basis poin…",
    "link": "https://biztoc.com/x/15d02f0a5ce5f816",
    "timestamp": "2025-04-09T09:47:00Z"
  },
  {
    "title": "Trump Administration Warns Migrants of Nearly $1,000 Fine per Day",
    "description": "\"Illegal aliens should use the CBP Home app to self-deport and leave the country now,\" a DHS official told Newsweek.",
    "link": "https://www.newsweek.com/donald-trump-warns-migrants-fine-2057259",
    "timestamp": "2025-04-09T09:45:39Z"
  },
  {
    "title": "The Latest: Asia and European shares sink as US tariffs take effect",
    "description": "Stocks surged to one of their biggest gains since World War II after President Donald Trump paused his tariffs against most other nations, as investors had desperately hoped he would.",
    "link": "https://www.clickorlando.com/business/2025/04/09/the-latest-asia-shares-sink-as-us-tariffs-take-effect/",
    "timestamp": "2025-04-09T09:45:18Z"
  },
  {
    "title": "The Bizarre Legal Theory Behind Mahmoud Khalil’s Detention",
    "description": "The foreign policy deportability ground was introduced into immigration law in 1990.",
    "link": "https://slate.com/news-and-politics/2025/04/free-mahmoud-khalil-detention-doj-trump-law.html",
    "timestamp": "2025-04-09T09:45:00Z"
  },
  {
    "title": "Auto giants extend losses as Trump’s sweeping global tariffs take effect",
    "description": "Europe's auto giants slipped on Wednesday, extending recent losses as U.S. President Donald Trump's sweeping tariffs on dozens of countries came into effect.",
    "link": "https://www.cnbc.com/2025/04/09/auto-giants-fall-as-trumps-sweeping-global-tariffs-take-effect.html",
    "timestamp": "2025-04-09T09:44:58Z"
  },
  {
    "title": "104% tariff: Is Trump pushing US, China into a Thucydides's Trap?",
    "description": "After Trump’s 104% tariff on Chinese imports took effect, China pledged firm retaliation and is planning urgent economic measures. Analysts warn the US-China standoff risks falling into the Thucydides’s Trap, where a rising power challenges a dominant one. De…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/104-tariff-is-trump-pushing-us-china-into-a-thucydidess-trap/articleshow/120122784.cms",
    "timestamp": "2025-04-09T09:44:21Z"
  },
  {
    "title": "Futures struggle as Trump's reciprocal tariffs shake up global trade",
    "description": "As hopes of concessions faded and tariffs on dozens of countries, including a massive 104% duties on Chinese goods, came into force, investors accelerated...",
    "link": "https://finance.yahoo.com/news/futures-struggle-trumps-reciprocal-tariffs-094400028.html",
    "timestamp": "2025-04-09T09:44:00Z"
  },
  {
    "title": "Trump's latest round of tariffs are now in effect",
    "description": "A number of sweeping new tariffs on goods from other countries are already here — and more took effect on Wednesday.",
    "link": "https://www.wmur.com/article/trump-tariff-wars-global-trade/64428477",
    "timestamp": "2025-04-09T09:43:41Z"
  },
  {
    "title": "Why UnitedHealth Group Incorporated (UNH) Surged On Tuesday?",
    "description": "We recently published a list of 10 Stocks Lead Rally Amid Market Bloodbath. In this article, we are going to take a look at where UnitedHealth Group...",
    "link": "https://finance.yahoo.com/news/why-unitedhealth-group-incorporated-unh-094309580.html",
    "timestamp": "2025-04-09T09:43:09Z"
  },
  {
    "title": "Iran’s president insists Tehran does not seek a nuclear bomb and dangles US business opportunities",
    "description": "TEHRAN, Iran (AP) — Iran’s president again pledged Wednesday that his nation is “not after a nuclear bomb” ahead of talks between Tehran and the United States, going as far as dangling the prospect of direct American investment in the Islamic Republic if the …",
    "link": "https://financialpost.com/pmn/irans-president-insists-tehran-does-not-seek-a-nuclear-bomb-and-dangles-us-business-opportunities",
    "timestamp": "2025-04-09T09:42:46Z"
  },
  {
    "title": "Tesla’s $584 billion wipeout: 4 forces behind the EV giant’s accelerating 45% stock car",
    "description": "Tesla’s lead in EV infrastructure is at risk. In March, Chinese competitor BYD launched a next-gen fast-charging station that provides 400 kilometers (around 250 miles) of range in just five minutes, surpassing Tesla's top Supercharger performance.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/teslas-584-billion-wipeout-4-forces-behind-the-ev-giants-accelerating-45-stock-car/articleshow/120123479.cms",
    "timestamp": "2025-04-09T09:42:37Z"
  },
  {
    "title": "10-year Treasury yield spikes higher as Trump tariffs continue to rattle markets",
    "description": "U.S. Treasury yields surged Wednesday as U.S. President Donald Trump's tariffs regime continued to rattle markets.",
    "link": "https://www.cnbc.com/2025/04/09/us-treasury-yields-investors-weigh-new-reciprocal-tariffs-.html",
    "timestamp": "2025-04-09T09:42:11Z"
  },
  {
    "title": "German Journalist Given Seven Month Sentence for Meme Mocking Government's 'Hatred' of Free Speech",
    "description": "Germany has been accused of violating basic tenets of Western values yet again, as a news editor was convicted by a court for posting a meme mocking the government's \"hatred\" of free speech.\nThe post German Journalist Given Seven Month Sentence for Meme Mocki…",
    "link": "https://www.breitbart.com/europe/2025/04/09/german-journalist-given-seven-month-sentence-for-meme-mocking-governments-hatred-of-free-speech/",
    "timestamp": "2025-04-09T09:41:46Z"
  },
  {
    "title": "Instagram could finally get an iPad app soon – but here’s a workaround while you wait",
    "description": "Instagram might soon launch a native iPad app, ending a lengthy wait for fans of Apple’s tablet.",
    "link": "https://www.techradar.com/tablets/ipad/instagram-could-finally-get-an-ipad-app-soon-rumors-predict-but-heres-a-workaround-while-you-wait",
    "timestamp": "2025-04-09T09:41:22Z"
  },
  {
    "title": "Powell Likely to Wait Until Trump Blinks, 'Dr. Doom' Roubini Says",
    "description": "Roubini, known as Dr. Doom for predicting the 2008 financial meltdown, warned against relying on the Fed for a swift resolution to market instability.",
    "link": "https://www.coindesk.com/markets/2025/04/09/powell-likely-to-wait-until-trump-blinks-dr-doom-roubini-says",
    "timestamp": "2025-04-09T09:40:40Z"
  },
  {
    "title": "Everyone Who Could Have Stood Up to Donald Trump Has Failed. Except, Maybe, for the Most Unlikely One of All.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5f4f50ef-8774-4ea9-95f4-3e21c6e3d92f",
    "timestamp": "2025-04-09T09:40:00Z"
  },
  {
    "title": "One Unlikely Sensation Has Given Rattled Americans Hope for Life After Trump. I Went to See It for Myself.",
    "description": "The protests drawing the biggest—and most rousing—crowds have a surprising figurehead.",
    "link": "https://slate.com/news-and-politics/2025/04/donald-trump-protest-bernie-sanders-aoc-tour-news.html",
    "timestamp": "2025-04-09T09:40:00Z"
  },
  {
    "title": "Jim Chalmers, RBA meet as billions wiped from Aussie market and Donald Trump boasts ‘it’s our turn to do the rippin’’",
    "description": "Jim Chalmers, RBA meet as billions wiped from Aussie market and Donald Trump boasts ‘it’s our turn to do the rippin’’7news.com.au",
    "link": "https://7news.com.au/news/jim-chalmers-rba-meet-as-billions-wiped-from-aussie-market-and-donald-trump-boasts-its-our-turn-to-do-the-rippin-c-18319119",
    "timestamp": "2025-04-09T09:39:17Z"
  },
  {
    "title": "China calls US trade surplus 'inevitable', warns it's ready for trade war",
    "description": "China called its trade surplus with the United States an inevitability and warned it had the \"determination and means\" to continue the fight if Trump kept hitting Chinese goods with tariffs to try and bring it down.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-calls-us-trade-surplus-inevitable-warns-its-ready-for-trade-war/articleshow/120123387.cms",
    "timestamp": "2025-04-09T09:37:21Z"
  },
  {
    "title": "China plans high-level meet to craft support measures after US tariff hikes, say sources",
    "description": "The planned gathering is the first to become publicly known since US President Donald Trump clamped 'reciprocal' tariffs on China last week, and follows the near doubling to 104% in US duties on imports from China",
    "link": "https://www.rappler.com/world/asia-pacific/china-plans-meeting-craft-support-measures-us-tariff-hikes/",
    "timestamp": "2025-04-09T09:36:56Z"
  },
  {
    "title": "Kevin O'Leary Calls EU Tariff Proposal A 'Huge Opportunity' For Trump To Find An 'Off-Ramp' Amid Global Market Volatility",
    "description": "Kevin O’Leary of Shark Tank fame says that the European Union’s “zero-for-zero” tariff proposal on industrial goods has offered President Donald Trump a meaningful opportunity to de-escalate trade tensions.\nWhat Happened: According to O’Leary, the EU is prepa…",
    "link": "https://biztoc.com/x/5f298f238218513e",
    "timestamp": "2025-04-09T09:36:00Z"
  },
  {
    "title": "Italy’s luxury furniture industry faces fresh crisis as Trump tariffs threaten a third of their exports: ‘We always find a solution’",
    "description": "Even the most sumptuous cushions cannot ease the pain that Italian luxury furniture makers -- gathered at their annual fair -- can already feel from US President Donald Trump's tariffs.\nSome companies at the Milan Furniture Fair, which opened Tuesday, compare…",
    "link": "https://biztoc.com/x/e0d390e97b9b9f8a",
    "timestamp": "2025-04-09T09:35:49Z"
  },
  {
    "title": "U.S. Treasuries crater as global tariff war unleashed by Trump triggers asset damage",
    "description": "The steep selloff in U.S. government bonds overnight has alarmed investors, leading to speculation that China is unloading Treasuries in retaliation for President Donald Trump’s punishing 104-per-cent tariffs imposed on the country’s exports on Tuesday.\nTreas…",
    "link": "https://biztoc.com/x/604b281b4dc65846",
    "timestamp": "2025-04-09T09:35:40Z"
  },
  {
    "title": "Lego opens factory in Vietnam, says will make toys without adding emissions",
    "description": "Lego has opened a $1 billion factory in Vietnam that it says will make toys without adding planet-warming gas to the atmosphere by relying entirely on clean energy",
    "link": "https://abcnews.go.com/International/wireStory/lego-opens-factory-vietnam-make-toys-adding-emissions-120627519",
    "timestamp": "2025-04-09T09:35:09Z"
  },
  {
    "title": "Trump thinks Apple can manufacture iPhones in the US, but can it?",
    "description": "In a recent press briefing, it seems that Trump believes that Apple can manufacture its iPhones in the US, but the reality is complicated.",
    "link": "https://www.androidheadlines.com/2025/04/trump-thinks-apple-can-manufacture-iphones-in-the-us.html",
    "timestamp": "2025-04-09T09:33:12Z"
  },
  {
    "title": "Sweden Should Add Bitcoin To FX Reserves, Says MP",
    "description": "Swedish Member of Parliament Rickard Nordin (C) has asked thevfinance minister to diversify foreign currency holdings into Bitcoin. A recent written question submitted to the Swedish Riksdag is sparking renewed debate about how the country manages its foreign…",
    "link": "https://bitcoinist.com/sweden-add-bitcoin-to-fx-reserves-says-mp/",
    "timestamp": "2025-04-09T09:30:25Z"
  },
  {
    "title": "Trump’s tariffs take effect: EU countries set to approve first retaliation against US tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/trumps-tariffs-take-effect-eu-countries-set-to-approve-first-retaliation-against-us-tariffs/a424526381.html",
    "timestamp": "2025-04-09T09:30:00Z"
  },
  {
    "title": "Tariff war: China responds with 84pc tariff on US goods as 20pc levy on EU goods takes effect",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/tariff-war-china-responds-with-84pc-tariff-on-us-goods-as-20pc-levy-on-eu-goods-takes-effect/a424526381.html",
    "timestamp": "2025-04-09T09:30:00Z"
  },
  {
    "title": "Trump's top tariffs for 'worst offenders' take effect",
    "description": "China has been hit with a 104% rate amid an escalating standoff between the world's two biggest economies.",
    "link": "https://www.bbc.com/news/articles/cgkgg1krg63o",
    "timestamp": "2025-04-09T09:29:20Z"
  },
  {
    "title": "‘We Owe Our Lives to You’ -- Former Hamas Hostages Thank Trump, Ask Him to Help Save Remaining Captives",
    "description": "Former Hamas terrorist hostages Iair Horn alongside Keith and Aviva Siegel were invited to tell their stories Tuesday night at a Republican National Committee event in front of 3,000 guests.\nThe post ‘We Owe Our Lives to You’ — Former Hamas Hostages Thank Tru…",
    "link": "https://www.breitbart.com/middle-east/2025/04/09/we-owe-our-lives-to-you-former-hamas-hostages-thank-trump-ask-him-to-help-save-remaining-captives/",
    "timestamp": "2025-04-09T09:27:26Z"
  },
  {
    "title": "Meta To Face Trial In US Over Instagram, WhatsApp Acquisitions",
    "description": "Barring any eleventh-hour intervention, social media juggernaut Meta will stand trial next week facing serious US government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors.",
    "link": "https://www.ndtv.com/world-news/meta-to-face-trial-in-us-over-instagram-whatsapp-acquisitions-8123872",
    "timestamp": "2025-04-09T09:26:41Z"
  },
  {
    "title": "Indonesia remains open to investment despite tariff war: Expert",
    "description": "The Indonesian government&#39;s approach of prioritizing negotiations over retaliatory measures in response to the United States&#39; import tariff policy has ...",
    "link": "https://en.antaranews.com/news/351105/indonesia-remains-open-to-investment-despite-tariff-war-expert",
    "timestamp": "2025-04-09T09:26:17Z"
  },
  {
    "title": "Trump reciprocal tariffs: Global markets react to new increase on goods",
    "description": "Asian and European shares sank again on Wednesday as the latest set of U.S. tariffs, including a 104% levy on Chinese imports, went into effect.",
    "link": "https://abc13.com/post/trump-reciprocal-tariffs-global-markets-react-new-increase-goods/16147858/",
    "timestamp": "2025-04-09T09:26:00Z"
  },
  {
    "title": "Pharma Stocks Plummet After Trump Says ‘Major’ Tariffs Are Coming",
    "description": "2 min ago\nPharma Stocks Plummet After Trump Says ‘Major’ Tariffs Are Coming\nPharmaceutical stocks across the globe fell in the wake of President Donald Trump’s latest comments on tariffs for the sector.\nPharma was exempted from Trump’s sweeping tariffs announ…",
    "link": "https://biztoc.com/x/46d944b361c166ec",
    "timestamp": "2025-04-09T09:25:19Z"
  },
  {
    "title": "Trump voters are prepared to trust him on tariffs — but there are signs of cracks in the coalition",
    "description": "As President Donald Trump’s sweeping tariff plans sent stocks tumbling and economists warning of a broader economic slowdown, many of Trump’s supporters say they support the move as part of a broader vision for the U.S. economy, even if prices rise.",
    "link": "https://biztoc.com/x/04d72bae8643ce7d",
    "timestamp": "2025-04-09T09:24:53Z"
  },
  {
    "title": "Trump Predicts 'Tremendous, Thundering Landslide' In 2026 Midterms, Says Tariffs Will Help Republicans Win Big",
    "description": "On Tuesday, President Donald Trump presented his latest round of tariffs as a political boost for the GOP leading up to the 2026 midterms.\nWhat Happened: Speaking at a Republican fundraising event in Washington, he insisted they would solidify his party's pos…",
    "link": "https://biztoc.com/x/6332a102736120e7",
    "timestamp": "2025-04-09T09:24:46Z"
  },
  {
    "title": "ARK Invest Buys the Coinbase Dip, Adding $30M of Shares in 3 Days",
    "description": "The company purchased the shares for a total of $31.51 million, but they are now worth $29.3 million based on COIN's closing price Tuesday of $146.90.",
    "link": "https://www.coindesk.com/markets/2025/04/09/ark-invest-buys-the-coinbase-dip-adding-usd30m-of-shares-in-3-days",
    "timestamp": "2025-04-09T09:21:55Z"
  },
  {
    "title": "Lego opens a factory in Vietnam it says will make toys without adding emissions to the atmosphere",
    "description": "Lego has opened a $1 billion factory in Vietnam that it says will make toys without adding planet-warming gas to the atmosphere by relying entirely on clean energy. The factory is the Danish company's sixth worldwide and second in Asia. Even though its produc…",
    "link": "https://www.seattlepi.com/news/world/article/lego-opens-a-factory-in-vietnam-it-says-will-make-20266450.php",
    "timestamp": "2025-04-09T09:20:44Z"
  },
  {
    "title": "Stephen Colbert Strikes Out Trump’s Latest 'Word Goulash' With Perfect Baseball Burn",
    "description": "The \"Late Show\" audience lapped up the mockery of the president's weird tribute to the Los Angeles Dodgers.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-donald-trump-baseball_n_67f6334ce4b09acb3d74541d",
    "timestamp": "2025-04-09T09:19:23Z"
  },
  {
    "title": "China Again Vows to Fight Tariffs to End, Saying Trade With U.S. Is Already Balanced",
    "description": "\"China has the firm will and abundant means to take necessary countermeasures and fight to the end.\"",
    "link": "https://time.com/7275975/china-again-vows-to-fight-us-tariffs-to-end/",
    "timestamp": "2025-04-09T09:16:37Z"
  },
  {
    "title": "‘Bond King’ Jeffrey Gundlach Issues Stock Market Warning, Unveils Bottom Price Target for S&P 500",
    "description": "The founder and CEO of investment firm DoubleLine Capital Jeffrey Gundlach is leaning bearish on the US stock market amid the imposition of import tariffs as high as 50% by the world’s largest economy. In a new CNBC interview, Gundlach says he sees the S&P 50…",
    "link": "https://dailyhodl.com/2025/04/09/bond-king-jeffrey-gundlach-issues-stock-market-warning-unveils-bottom-price-target-for-sp-500/",
    "timestamp": "2025-04-09T09:15:57Z"
  },
  {
    "title": "US Bonds Skyrocket: 'Market Meltdown'",
    "description": "U.S. Treasury yields surged as the latest round of President Donald Trump's tariffs went into effect.",
    "link": "https://www.newsweek.com/bond-skyrocket-market-2057266",
    "timestamp": "2025-04-09T09:14:19Z"
  },
  {
    "title": "'Red flag': Shorten seizes on Dutton's policy backflip",
    "description": "Peter Dutton had a rough week on the policy front but it might be matters instigated abroad that truly cause him pain at the polling booth.",
    "link": "https://www.abc.net.au/news/2025-04-09/peter-dutton-policy-backflip-red-flag-shorten-pyne-unconcerned/105156118",
    "timestamp": "2025-04-09T09:14:10Z"
  },
  {
    "title": "In negotiating with Trump, flattery and playing hardball both work, but leverage is key",
    "description": "The practice of negotiation hasn’t changed much over the course of human history. We have haggled, cajoled, given and taken for centuries. In this sense, U.S. President Donald Trump represents an established archetype within the academic study of negotiation.…",
    "link": "https://biztoc.com/x/2ee0cd5622f81469",
    "timestamp": "2025-04-09T09:14:04Z"
  },
  {
    "title": "Deal within reach if US shows genuine will in Oman talks: Araghchi",
    "description": "Iran's foreign minister has voiced optimism ahead of the upcoming round of indirect talks with the United States, saying a deal can be reached if Washington demonstrates genuine will.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250408-presstv06.htm",
    "timestamp": "2025-04-09T09:13:45Z"
  }
]