[
  {
    "title": "Iran's FM in Russia to 'consult on matters of common concern'",
    "description": "Iranian Foreign Minister Abbas Araghchi is visiting Moscow to \"consult on matters of common interest and concern\" with Russian officials, Foreign Ministry spokesman Esmaeil Baghaei says.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250417-presstv03.htm",
    "timestamp": "2025-04-18T06:15:22Z"
  },
  {
    "title": "President Trump Hints At Cooling Tariff War With China, Says TikTok Divestment Will Be Postponed Until Trade Issues Are Settled",
    "description": "President Donald Trump on Thursday indicated that the tariff impasse between the United States and China may be on the path to resolution, even as a proposed negotiation involving TikTok hangs in the balance.\nThe remarks come amid signals that both countries …",
    "link": "https://biztoc.com/x/b65f32d7c58b3a5d",
    "timestamp": "2025-04-18T06:14:20Z"
  },
  {
    "title": "Xi Jinping talks of former fights and future shocks on Southeast Asian tour",
    "description": "Chinese President Xi Jinping ramped up rhetoric of unity in the face of protectionism and shocks to the global order as he continued his Southeast Asian tour on Thursday amid a tariff war with the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250417-rfa02.htm",
    "timestamp": "2025-04-18T06:11:47Z"
  },
  {
    "title": "Florida shooting: Suspect (20) ‘used police officer mother’s gun’ to kill two in university attack",
    "description": "Six taken to hospital after Florida State University shooting, gunman (20) shot and wounded by police",
    "link": "https://www.irishtimes.com/world/us/2025/04/18/florida-shooting-suspect-20-used-police-officer-mothers-gun-to-kill-two-in-university-attack/",
    "timestamp": "2025-04-18T06:10:31Z"
  },
  {
    "title": "France Says Europe Now 'At The Table' As Paris Peace Talks End",
    "description": "French officials have praised talks held between key European countries, Ukraine, and the United States, the first involving the three sides since US President Donald Trump took power, as they look to end Europe's largest conflict since the end of World War I…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250417-rferl03.htm",
    "timestamp": "2025-04-18T06:07:06Z"
  },
  {
    "title": "Ukraine, US Sign Memorandum On Economic Partnership, Ukrainian Official Says",
    "description": "Ukraine and the United States have \"taken a step\" toward a joint economic partnership agreement, Economy Minister Yulia Svyrydenko said on April 17.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250417-rferl04.htm",
    "timestamp": "2025-04-18T06:07:02Z"
  },
  {
    "title": "Analysis: After Paris Talks, A New Chapter In Ukraine Peace Drive?",
    "description": "There was recently talk of getting a Ukraine cease-fire in place by Easter. That hasn't happened, but there may have been some tangible progress in diplomatic efforts to cheer hearts this weekend.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250418-rferl02.htm",
    "timestamp": "2025-04-18T06:03:01Z"
  },
  {
    "title": "Binance Goes Diplomatic: Advising Governments On Crypto Laws",
    "description": "Crypto exchange Binance is remodeling its attitude toward regulation, flipping the script on its former notoriety as a pain in the neck of sorts to a role as an insider policy adviser to governments worldwide. The organization currently advises governments in…",
    "link": "https://bitcoinist.com/binance-goes-diplomatic-advising-governments-on-crypto-laws/",
    "timestamp": "2025-04-18T06:00:27Z"
  },
  {
    "title": "Media Censorship in the Age of Palestinian Genocide",
    "description": "In the feverish days leading up to the 2003 invasion of Iraq. Colin Powell presented his dubious evidence to the United Nations Security Council, claiming Saddam Hussein possessed WMDs. The result was The Iraq Resolution, which authorized the use of force aga…",
    "link": "https://www.counterpunch.org/2025/04/18/media-censorship-in-the-age-of-palestinian-genocide/",
    "timestamp": "2025-04-18T06:00:18Z"
  },
  {
    "title": "Parkland Victim's Dad Shares Gut-Wrenching Discovery After Florida State Shooting",
    "description": "Fred Guttenberg said he's angered \"beyond measure\" at Donald Trump, who was also president when his daughter was killed in a 2018 school shooting.",
    "link": "https://www.huffpost.com/entry/parkland-victim-father-fred-guttenberg-florida-state-shooting_n_6801c3a4e4b0a7d855242b19",
    "timestamp": "2025-04-18T06:00:02Z"
  },
  {
    "title": "Dollar dominance under threat as markets react to Trumpâ\u0080\u0099s trade policies",
    "description": "Trump’s tariffs risk speeding up the decline of the dollar’s global reserve status, unsettling markets. The dollar’s dominance has long lowered U.S. borrowing costs, but alternatives from China and Russia threaten it. Trade wars and sanctions push countries t…",
    "link": "https://www.naturalnews.com/2025-04-18-dollar-dominance-threatened-markets-react-trump-trade.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Trump administration BANS Associated Press reporters from Oval Office, defying court order",
    "description": "The Trump administration barred Associated Press reporters from covering a press conference with President Donald Trump and Salvadoran President Nayib Bukele, defying a federal court injunction ordering the White House to restore AP‘s access. A Trump-appointe…",
    "link": "https://www.naturalnews.com/2025-04-18-trump-admin-bans-ap-reporters-oval-office.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "U.S. demands U.K. protect FREE SPEECH, repeal hate speech authoritarianism, in latest trade deal negotiations",
    "description": "In a move that has sparked intense debate on both sides of the Atlantic, the Trump administration is reportedly demanding that the UK repeal its hate speech laws as a condition for securing a trade deal. This demand, according to sources close to U.S. Vice Pr…",
    "link": "https://www.naturalnews.com/2025-04-18-us-demands-uk-protect-free-speech.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Chinese vent anger at Trump's trade war with memes, mockery",
    "description": "While China's leaders use their economic and political might to fight Donald Trump's trade war \"to the end\", its army of social media soldiers are embarking on a more humorous campaign online. Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/04/18/chinese-vent-anger-at-trump039s-trade-war-with-memes-mockery",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Manufacturing surge under Trump sparks optimism amid concerns over economic strains",
    "description": "President Trump’s tariff-driven strategy has boosted U.S. factory output, with a 5.1% annualized gain in Q1 2025 and 10,000 new manufacturing jobs in February, reversing prior losses. While job growth (228,000 in March) and cooling inflation (2.4%) are positi…",
    "link": "https://www.naturalnews.com/2025-04-18-manufacturing-surge-under-trump-sparks-optimism.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "SpaceX emerges as frontrunner for Trump’s Golden Dome missile shield",
    "description": "SpaceX, Palantir, and Anduril are frontrunners to develop Trump’s Golden Dome missile defense shield. The consortium proposes launching up to 1,000 satellites to detect and track missiles globally. SpaceX has pitched a subscription model rather than governmen…",
    "link": "https://www.naturalnews.com/2025-04-18-spacex-frontrunner-trump-golden-dome-missile-shield.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Supreme Court weighs birthright citizenship restriction amid claims of executive overreach",
    "description": "The U.S. Supreme Court will hear arguments on May 15 regarding Trump’s executive order restricting birthright citizenship, challenging interpretations of the 14th Amendment and presidential authority. The policy denies automatic citizenship to children born t…",
    "link": "https://www.naturalnews.com/2025-04-18-supreme-court-weighs-birthright-citizenship-restriction.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "DOJ takes over Maine Title IX case as battle over trans athletes in girls’ sports escalates",
    "description": "The Department of Justice (DOJ) is poised to take legal action against Maine after a Department of Education (DOE) investigation found the state violated Title IX by allowing biological males to compete in girls’ sports. Maine refused to comply with a federal…",
    "link": "https://www.naturalnews.com/2025-04-18-doj-takes-over-maine-title-ix-case.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Trump vows to work with American farmers to avoid deporting migrant workers essential to agricultural sector",
    "description": "President Donald Trump has vowed to collaborate with American farmers to prevent the deportation of migrant workers essential to the agricultural sector, addressing concerns over labor shortages and rising costs. Georgia Senator (and farmer) Sam Watson warns …",
    "link": "https://www.naturalnews.com/2025-04-18-trump-to-avoid-deporting-essential-migrant-workers.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "BlackRockâ\u0080\u0099s Panama port deal stirs debate over Chinese chokehold on strategic shipping routes",
    "description": "Trump warns of strategic risks as BlackRock seeks $22B Panama Canal ports deal. Panama Canal’s US-built legacy at stake amid China’s opposition to the acquisition. BlackRock’s global port control could weaken China’s Belt and Road Initiative influence. Milita…",
    "link": "https://www.naturalnews.com/2025-04-18-blackrock-panama-port-deal-chinese-chokehold.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s critical Ukraine minerals deal nears completion",
    "description": "The U.S. is finalizing a deal with Ukraine for privileged access to its critical minerals, oil, and gas. The agreement reflects Trump’s transactional policy, demanding repayment via resource extraction for past U.S. aid. Ukraine’s rare earth deposits help cou…",
    "link": "https://www.naturalnews.com/2025-04-18-trump-critical-ukraine-minerals-deal-completion.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Majority of Americans now favor mass deportation of illegal immigrants, polls show shift in public sentiment",
    "description": "A new Washington Post/CNN poll shows 56% of Americans now support deporting all 11 million undocumented immigrants — a significant increase from 38% in 2016. The shift reflects growing alignment with former President Trump’s hardline immigration stance, empha…",
    "link": "https://www.naturalnews.com/2025-04-18-majority-of-americans-now-favor-mass-deportation.html",
    "timestamp": "2025-04-18T06:00:00Z"
  },
  {
    "title": "Why the Supreme Court May Ultimately Side With Trump in the Abrego Garcia Case",
    "description": "President Bill Clinton’s former secretary of labor, Robert Reich, as well as many liberals and progressives, is leading the chorus in arguing that Donald Trump and his “bottom-feeding fanatics…have overreached” in taking on “China, Harvard, and the Supreme Co…",
    "link": "https://www.counterpunch.org/2025/04/18/why-the-supreme-court-may-ultimately-side-with-trump-in-the-abrego-garcia-case/",
    "timestamp": "2025-04-18T05:59:17Z"
  },
  {
    "title": "US airstrikes targeting a Yemeni oil port killed 20 people, Houthis say",
    "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others",
    "link": "https://abcnews.go.com/Business/wireStory/us-airstrikes-targeting-yemeni-oil-port-killed-20-120933524",
    "timestamp": "2025-04-18T05:58:17Z"
  },
  {
    "title": "Social Democracy isn’t Going to Save the West",
    "description": "Over the last five or so decades, American elections have become increasingly defined by what they don’t accomplish. The classical liberal model of free and fair elections to select representatives who act in the public interest has been replaced with a rogue…",
    "link": "https://www.counterpunch.org/2025/04/18/social-democracy-isnt-going-to-save-the-west/",
    "timestamp": "2025-04-18T05:58:00Z"
  },
  {
    "title": "Law firms, universities and now civil society groups are in Trump's sights for punitive action",
    "description": "Law firms, universities and now civil society groups are in Trump's sights for punitive actionclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/18/law-firms-universities-and-now-civil-society-groups-are-in-trumps-sights-for-punitive-action/",
    "timestamp": "2025-04-18T05:56:10Z"
  },
  {
    "title": "Despite Trade War, 30-Year-Old Lists His Chinese Tea Chain In The U.S.",
    "description": "Zhang Junjie, the 30-year-old founder of Chinese milk tea company Chagee Holdings, listed his firm on the Nasdaq Thursday and shares rose 16%.",
    "link": "https://www.forbes.com/sites/ywang/2025/04/18/despite-trade-war-30-year-old-lists-his-chinese-tea-chain-in-the-us/",
    "timestamp": "2025-04-18T05:54:11Z"
  },
  {
    "title": "Douglas H. White, Past is Prologue in the Trump Era",
    "description": "I recently went to the protest in New York City — one of more than 1,400 demonstrations in all 50 states across this country and elsewhere in the world — against what increasingly should be known as the Trump regime. Tens of thousands of people marched in my …",
    "link": "https://www.counterpunch.org/2025/04/18/douglas-h-white-past-is-prologue-in-the-trump-era/",
    "timestamp": "2025-04-18T05:52:29Z"
  },
  {
    "title": "“PATCO on Steroids”: Will Labor’s Response be Different Today?",
    "description": "I had recently turned twenty-one in 1981, when President Ronald Reagan fired thirteen thousand striking air traffic controllers. It was a hot muggy August day in Boston. I remember that myself and one of my oldest friends Bill Almy were driving past the Bosto…",
    "link": "https://www.counterpunch.org/2025/04/18/patco-on-steroids-will-labors-response-be-different-today/",
    "timestamp": "2025-04-18T05:50:59Z"
  },
  {
    "title": "The Plot to Kill Social Security",
    "description": "How ironic: The most inefficient bureaucracy in government turns out to be Donald Trump’s “Department of Government Efficiency.” That could be humorous, except that DOGE — a creature of the right-wing Project 2025 — has been devastating to millions of people.…",
    "link": "https://www.counterpunch.org/2025/04/18/the-plot-to-kill-social-security-2/",
    "timestamp": "2025-04-18T05:50:55Z"
  },
  {
    "title": "Jimmy Kimmel Says It’s Weird How ‘Anti-DEI’ Trump Has ‘the Same Taste as Liberace’ After White House Gold Makeover | Video",
    "description": "\"You think Donald Trump understands that the story of King Midas is a cautionary tale?\" the ABC host asks\nThe post Jimmy Kimmel Says It’s Weird How ‘Anti-DEI’ Trump Has ‘the Same Taste as Liberace’ After White House Gold Makeover | Video appeared first on The…",
    "link": "https://www.thewrap.com/jimmy-kimmel-trump-white-house-gold-makeover-monologue/",
    "timestamp": "2025-04-18T05:50:42Z"
  },
  {
    "title": "Chinese vent anger at Trump's trade war with memes, mockery",
    "description": "<p>BEIJING &mdash; While China's leaders use their economic and political might to fight United States President Donald Trump's trade war \"to the end\", its army of social media soldiers are embarking on a more humorous campaign online.</p>",
    "link": "https://www.bangkokpost.com/business/general/3005884/chinese-vent-anger-at-trumps-trade-war-with-memes-mockery",
    "timestamp": "2025-04-18T05:45:00Z"
  },
  {
    "title": "‘We will fight back’ – Canadian leader tells nation Trump tariff war can help domestic trade",
    "description": "Prime Minister Mark Carney has said he will cut out the red tape for internal, domestic trade for Canadian businesses while dealing with US President Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/we-will-fight-back-canadian-leader-tells-nation-trump-tariff-war-can-help-domestic-trade/a1823329965.html",
    "timestamp": "2025-04-18T05:43:04Z"
  },
  {
    "title": "U.S. Escalates Airstrikes on Iran-backed Houthis",
    "description": "The conflict near the Red Sea is intensifying as the Yemeni rebel group has continued attacks",
    "link": "https://www.newsweek.com/houthis-trump-iran-yemen-attacks-2061332",
    "timestamp": "2025-04-18T05:42:36Z"
  },
  {
    "title": "Cathie Wood Says She's Trusting Trump Will Get Call On Tariffs Right: 'Investors Shorting The Equity Market Now Will Be Caught Flat Footed Or Worse'",
    "description": "Asset manager Cathie Wood hinted at her support for President Donald Trump’s trade and economic playbook by sharing an article on the destructive impact of tariffs, written by renowned supply-side economist Arthur Laffer.\nWhat Happened: On Wednesday, Cathie W…",
    "link": "https://biztoc.com/x/e13e2240901c2e01",
    "timestamp": "2025-04-18T05:41:07Z"
  },
  {
    "title": "Trump suggests September date being set for UK visit",
    "description": "Donald Trump has suggested a date for September is being set for him to meet the King of Britain.",
    "link": "https://www.independent.ie/world-news/britain/trump-suggests-september-date-being-set-for-uk-visit/a621193306.html",
    "timestamp": "2025-04-18T05:36:10Z"
  },
  {
    "title": "UN nuclear chief says Iran, US running out of time to secure deal",
    "description": "U.N. nuclear watchdog chief Rafael Grossi said Thursday that Iran and the United States were running out of time to secure a deal as they prepare to hold fresh nuclear talks this weekend.",
    "link": "https://www.hurriyetdailynews.com/un-nuclear-chief-says-iran-us-running-out-of-time-to-secure-deal-208208",
    "timestamp": "2025-04-18T05:35:38Z"
  },
  {
    "title": "Indonesia plans business incentives to advance US tariff talks",
    "description": "The Indonesian government intends to offer facilities and incentives to US companies operating in the country to smooth the ongoing negotiations over the new ...",
    "link": "https://en.antaranews.com/news/352169/indonesia-plans-business-incentives-to-advance-us-tariff-talks",
    "timestamp": "2025-04-18T05:35:31Z"
  },
  {
    "title": "Chinese vent anger at Trump's trade war with memes, mockery",
    "description": "As the US-China trade war escalates, Chinese social media users are employing humor to counter Trump's tariffs. They mock American dependence on Chinese-made goods through viral AI-generated videos and posts. These online campaigns target perceived hypocrisy …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chinese-vent-anger-at-trumps-trade-war-with-memes-mockery/articleshow/120400056.cms",
    "timestamp": "2025-04-18T05:35:11Z"
  },
  {
    "title": "Ukraine and US sign outline minerals deal in lead-up to full agreement",
    "description": "Donald Trump says he expects to sign a full minerals deal with Ukraine next week",
    "link": "https://www.irishtimes.com/world/europe/2025/04/18/ukraine-and-us-sign-outline-minerals-deal-in-lead-up-to-full-agreement/",
    "timestamp": "2025-04-18T05:32:32Z"
  },
  {
    "title": "Asia mixed after Japan's inflation data",
    "description": "Asia-Pacific markets traded mixed on Friday as United States President Donald Trump stated he didn't want tariffs on China to \"go higher,\" as he clarified that higher tariffs \"you make it where people...",
    "link": "https://biztoc.com/x/b7cd9fce8919e2da",
    "timestamp": "2025-04-18T05:30:19Z"
  },
  {
    "title": "Judge extends ban on DOGE access to private Social Security data",
    "description": "A federal judge granted a preliminary injunction on Thursday that extends a ban on billionaire Elon Musk's aides from accessing private information on millions of Americans held in the Social Security Administration's computer systems. U.S. District Judge Ell…",
    "link": "https://japantoday.com/category/world/judge-extends-ban-on-musk%27s-doge-access-to-private-social-security-data",
    "timestamp": "2025-04-18T05:30:12Z"
  },
  {
    "title": "France hails 'positive process' as Europe, US discuss Ukraine ceasefire",
    "description": "France hailed talks on the Ukraine war between top U.S. and European officials on Thursday during which U.S. Secretary of State Marco Rubio again pressed a U.S. peace plan.",
    "link": "https://www.hurriyetdailynews.com/france-hails-positive-process-as-europe-us-discuss-ukraine-ceasefire-208207",
    "timestamp": "2025-04-18T05:28:51Z"
  },
  {
    "title": "Rattled by visa risks, Chinese students rethink US study plans",
    "description": "<p>Chinese students studying or planning to study in the United States are finding themselves in the crossfire between US President Donald Trump's aggressive immigration action and Beijing's firm pushback against US policies.</p>",
    "link": "https://www.bangkokpost.com/world/3005874/rattled-by-visa-risks-chinese-students-rethink-us-study-plans",
    "timestamp": "2025-04-18T05:23:00Z"
  },
  {
    "title": "Chinese Vent Anger At Trump's Trade War With Memes, Mockery",
    "description": "While China's leaders use their economic and political might to fight Donald Trump's trade war \"to the end\", its army of social media soldiers are embarking on a more humorous campaign online.",
    "link": "https://www.ibtimes.com/chinese-vent-anger-trumps-trade-war-memes-mockery-3770549",
    "timestamp": "2025-04-18T05:21:21Z"
  },
  {
    "title": "Chinese Vent Anger At Trump's Trade War With Memes, Mockery",
    "description": "While China's leaders use their economic and political might to fight Donald Trump's trade war \"to the end\", its army of social media soldiers are embarking on a more humorous campaign online.",
    "link": "https://www.ibtimes.com.au/chinese-vent-anger-trumps-trade-war-memes-mockery-1857996",
    "timestamp": "2025-04-18T05:21:14Z"
  },
  {
    "title": "Will 'unhappy' Trump fire Federal Reserve Chair Jerome Powell over interest rate amid 'recession risk'?",
    "description": "Donald Trump has publicly criticised Federal Reserve Chair Jerome Powell for not lowering interest rates, even suggesting he could remove him from his position. Trump believes there's no significant inflation, while Powell maintains the Fed's independence and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/will-unhappy-trump-fire-federal-reserve-chair-jerome-powell-over-interest-rate-amid-recession-risk/articleshow/120399651.cms",
    "timestamp": "2025-04-18T05:18:45Z"
  },
  {
    "title": "Chinese vent anger at Trump’s trade war with memes, mockery",
    "description": "While China’s leaders use their economic and political might to fight Donald Trump’s trade war “to the end”, its army of social media soldiers are embarking on a more humorous campaign online. The US president’s tariff blitz has seen Washington and Beijing im…",
    "link": "https://www.digitaljournal.com/world/chinese-vent-anger-at-trumps-trade-war-with-memes-mockery/article",
    "timestamp": "2025-04-18T05:17:22Z"
  },
  {
    "title": "Under fire at debate, Canada PM Carney tries to focus on Trump",
    "description": "Canada’s Prime Minister Mark Carney faced sustained attacks from his Conservative rival at an election debate Thursday, but the Liberal leader sought to focus attention on what he calls Canada’s top threat, President Donald Trump.  Most opinion polls show Pie…",
    "link": "https://www.digitaljournal.com/world/under-fire-at-debate-canada-pm-carney-tries-to-focus-on-trump/article",
    "timestamp": "2025-04-18T05:17:22Z"
  },
  {
    "title": "Chinese vent anger at Trump’s trade war with memes, mockery",
    "description": "Defiant posts have shot to the top of most-searched lists on social media, flooding platforms with patronising comments and jokes.\nThe post Chinese vent anger at Trump’s trade war with memes, mockery appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/chinese-vent-anger-at-trumps-trade-war-with-memes-mockery/article",
    "timestamp": "2025-04-18T05:17:22Z"
  },
  {
    "title": "Trump Is Reluctant To Keep Raising China Tariffs, Hints At Lowering Them",
    "description": "The US and China have escalated import duties in an economic clash between the two superpowers, part of a broader wave of sweeping tariffs Trump has sought to impose on major trading partners.",
    "link": "https://www.ndtv.com/world-news/donald-trump-is-reluctant-to-keep-raising-china-tariffs-hints-at-lowering-them-8193564",
    "timestamp": "2025-04-18T05:15:59Z"
  },
  {
    "title": "Malaysia's economy grew 4.4% y/y in Q1, exports to US surge in March",
    "description": "KUALA LUMPUR : Malaysia's economy grew 4.4 per cent in the first quarter of 2025 from a year earlier and the country's exports to the United States surged in March, data showed on Friday, as authorities warned that U.S. tariffs were creating uncertainty.The o…",
    "link": "https://www.channelnewsasia.com/business/malaysias-economy-grew-44-yy-q1-exports-us-surge-march-5073801",
    "timestamp": "2025-04-18T05:14:20Z"
  },
  {
    "title": "Chinese stocks fall as Trump hits Chinese ships with fees",
    "description": "Markets in Asia traded mixed in Friday's afternoon trading, with Chinese indexes falling on persisting trade war concerns after the administration of United States President Donald Trump announced fee...",
    "link": "https://biztoc.com/x/8d6a749dcd6a0e40",
    "timestamp": "2025-04-18T05:08:05Z"
  },
  {
    "title": "US lawmakers' bipartisan Taiwan visit signals support despite harsh words, tariffs",
    "description": "Republican and Democratic lawmakers are making their first trip to Taiwan under the new Trump administration a bipartisan one",
    "link": "https://abcnews.go.com/International/wireStory/us-lawmakers-bipartisan-taiwan-visit-signals-support-despite-120935417",
    "timestamp": "2025-04-18T05:07:39Z"
  },
  {
    "title": "With his promises of peace unmet in Gaza and Ukraine, Trump may find Iran just as tough",
    "description": "Adding to regional tensions is Trump's repeated threat to bomb Iran's nuclear sites if a deal cannot be reached.",
    "link": "https://www.japantimes.co.jp/news/2025/04/18/world/crime-legal/trump-iran-negotiations-tough/",
    "timestamp": "2025-04-18T05:06:00Z"
  },
  {
    "title": "With his promises of peace unmet in Gaza and Ukraine, Trump may find Iran just as tough",
    "description": "President Trump is pursuing talks with Iran to curb its nuclear program, despite skepticism and regional tensions. Negotiations, led by Steve Witkoff, face challenges due to Witkoff's lack of diplomatic experience and conflicting signals on enrichment. While …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/with-his-promises-of-peace-unmet-in-gaza-and-ukraine-trump-may-find-iran-just-as-tough/articleshow/120399468.cms",
    "timestamp": "2025-04-18T05:04:46Z"
  },
  {
    "title": "Study the basics again?",
    "description": "I live different & think different I live different Why Bitcoin is the lethal dagger to online advertising. . The Eric Kim effect. . I have too much T! . Are people intimidated by me? Eric Kim is the ultimate glitch? . . TEAM AMERICA. Why is there so much in …",
    "link": "https://erickimphotography.com/blog/2025/04/18/study-the-basics-again-2/",
    "timestamp": "2025-04-18T05:03:03Z"
  },
  {
    "title": "Federal Judge Blocks Labor Department From Enforcing DEI Ban for Contractors",
    "description": "A federal judge on Tuesday issued a preliminary injunction that prevents the U.S. Department of Labor from requiring government contractors and grant recipients to certify they do not operate any diversity, equity and inclusion programs that run afoul of anti…",
    "link": "https://www.insurancejournal.com/news/national/2025/04/18/820173.htm",
    "timestamp": "2025-04-18T05:01:46Z"
  },
  {
    "title": "Europe’s Easter illusions on Ukraine",
    "description": "In today’s edition of *The Capitals*, read about Trump and Meloni saying they ‘fully expect’ an EU-US trade deal, Poland boosting its troop presence and eyeing defence ties with Latvia, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-europes-easter-illusions-on-ukraine/",
    "timestamp": "2025-04-18T05:01:02Z"
  },
  {
    "title": "Pat Leahy: Poll shows voters are already grumpy with the Government",
    "description": "Fears over Donald Trump and impatience on housing highlighted by new survey",
    "link": "https://www.irishtimes.com/politics/2025/04/18/pat-leahy-poll-shows-voters-are-already-grumpy-with-the-government/",
    "timestamp": "2025-04-18T05:00:01Z"
  },
  {
    "title": "Fears over Donald Trump and impatience on housing: Poll shows voters are already grumpy with the Government",
    "description": "Fears over Donald Trump and impatience on housing highlighted by new survey",
    "link": "https://www.irishtimes.com/politics/2025/04/18/fears-over-donald-trump-and-impatience-on-housing-voters-are-already-grumpy-with-the-government/",
    "timestamp": "2025-04-18T05:00:01Z"
  },
  {
    "title": "Irish Times poll: Housing is main concern for all population groups",
    "description": "Government can take little comfort in how the electorate regards its performance on housing",
    "link": "https://www.irishtimes.com/politics/2025/04/18/housing-is-main-concern-for-all-population-groups-according-to-latest-poll/",
    "timestamp": "2025-04-18T05:00:00Z"
  },
  {
    "title": "How three Irish companies are adapting to Trump’s tariffs",
    "description": "Clonakility Distillery, dairy giant Ornua and machine-maker Edge Innovate in the crosshairs of disruptive policy programme",
    "link": "https://www.irishtimes.com/business/2025/04/18/were-reassessing-the-us-now-how-three-irish-companies-are-adapting-to-trumps-tariffs/",
    "timestamp": "2025-04-18T05:00:00Z"
  },
  {
    "title": "Irish Times poll shows 82% of voters are ‘worried’ about economic future after Trump re-election",
    "description": "Following Donald Trump’s re-election as US president, 82 per cent of those polled said they were ‘more worried’ about the future",
    "link": "https://www.irishtimes.com/politics/2025/04/18/trade-war-fear-82-of-irish-citizens-worried-about-the-economic-future/",
    "timestamp": "2025-04-18T05:00:00Z"
  },
  {
    "title": "Affirmative action for US students",
    "description": "It is clear that the Trump gang is going after foreign students by revoking their student visas willy-nilly for the most trivial of reasons, while pretending that it is about fighting anti-Semitism. “The fight for the freedom of Palestine and the fight agains…",
    "link": "https://freethoughtblogs.com/singham/2025/04/18/affirmative-action-for-us-students/",
    "timestamp": "2025-04-18T04:57:31Z"
  },
  {
    "title": "Trump Admin Exempts US Exporters From China-Built Ship Fees Amid Industry Pushback",
    "description": "The Donald Trump administration has announced exemptions for domestic exporters and vessel owners from port fees on China-built ships, aimed at bolstering the U.S. shipbuilding industry and countering China’s maritime influence\nWhat Happened: According to a R…",
    "link": "https://biztoc.com/x/69639b8b6b6e7ff1",
    "timestamp": "2025-04-18T04:56:57Z"
  },
  {
    "title": "Mazda to pause U.S. production of CX-50 cars destined for Canada",
    "description": "The Japanese automaker will halt production of CX-50 sport utility vehicles destined for Canada at its Alabama plant effective May 12.",
    "link": "https://www.japantimes.co.jp/business/2025/04/18/companies/mazda-pose-production/",
    "timestamp": "2025-04-18T04:55:00Z"
  },
  {
    "title": "Judge extends ban on Musk's DOGE access to private Social Security data",
    "description": "(Reuters) - A federal judge granted a preliminary injunction on Thursday that extends a ban on billionaire Elon Musk's aides from accessing private information on millions of Americans held in the Social Security Administration's computer systems. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/18/judge-extends-ban-on-musk039s-doge-access-to-private-social-security-data",
    "timestamp": "2025-04-18T04:52:00Z"
  },
  {
    "title": "Indonesia, US target completion of tariff talks within 60 days",
    "description": "The Indonesian and United States governments have agreed to a 60-day deadline for concluding negotiations regarding the 32 percent tariff imposed on ...",
    "link": "https://en.antaranews.com/news/352165/indonesia-us-target-completion-of-tariff-talks-within-60-days",
    "timestamp": "2025-04-18T04:50:44Z"
  },
  {
    "title": "Yemenis are turning to DeFi as US sanctions target Houthi group",
    "description": "Yemeni citizens are increasingly using decentralized finance (DeFi) protocols to bank themselves amid US sanctions aimed at the Houthi group, which they have deemed a terrorist organization. In the past, internet infrastructure challenges and low financial li…",
    "link": "https://cointelegraph.com/news/local-yemenis-turning-defi-in-force-amid-us-sanctions",
    "timestamp": "2025-04-18T04:50:16Z"
  },
  {
    "title": "Trump administration seeks explosive expansion of nation's immigration detention system",
    "description": "The US government is planning a massive expansion of its immigration detention system, potentially holding tens of thousands more migrants. Private prison companies stand to gain significantly from this initiative. Critics argue that the administration intend…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-seeks-explosive-expansion-of-nations-immigration-detention-system/articleshow/120399289.cms",
    "timestamp": "2025-04-18T04:49:44Z"
  },
  {
    "title": "Thai beef farmers oppose opening door to US beef",
    "description": "REPRESENTATIVES of nationwide beef farmers today (Apr. 17) submitted a letter to Agriculture and Cooperatives Minister Narumon Pinyosinwat opposing import\nThe post Thai beef farmers oppose opening door to US beef appeared first on ThaiResidents.com - Thai Loc…",
    "link": "https://thairesidents.com/around-town/thai-beef-farmers-oppose-opening-door-to-us-beef/",
    "timestamp": "2025-04-18T04:46:56Z"
  },
  {
    "title": "The US has a single rare earths mine. Chinese export limits are energizing a push for more",
    "description": "America’s only rare earths mine has fielded calls from anxious companies since China responded to President Donald Trump's tariffs by limiting exports of seven heavy metals",
    "link": "https://abcnews.go.com/Technology/wireStory/us-single-rare-earths-mine-chinese-export-limits-120936625",
    "timestamp": "2025-04-18T04:46:17Z"
  },
  {
    "title": "Dozens killed in US airstrikes on Yemen port, Houthis say | CNN",
    "description": "US airstrikes on an oil port in western Yemen have killed at least 38 people, Houthi-run Al-Masirah TV reported Friday, marking one of the deadliest days since the United States escalated its aerial military campaign against the Iranian-backed group in recent…",
    "link": "https://www.cnn.com/2025/04/18/middleeast/dozens-killed-us-airstrikes-yemen-intl-hnk/index.html",
    "timestamp": "2025-04-18T04:45:12Z"
  },
  {
    "title": "The US has a single rare earths mine. Chinese export limits are energizing a push for more",
    "description": "OMAHA, Neb. (AP) — America’s only rare earths mine heard from anxious companies soon after China responded to President Donald Trump’s tariffs this month by limiting exports of those minerals used for military applications and in many high-tech devices. “Base…",
    "link": "https://financialpost.com/pmn/the-us-has-a-single-rare-earths-mine-chinese-export-limits-are-energizing-a-push-for-more",
    "timestamp": "2025-04-18T04:28:47Z"
  },
  {
    "title": "U.S. intelligence contradicts Trump claims linking gang to Venezuelan government to speed deportations",
    "description": "A new U.S. intelligence assessment found no coordination between Tren de Aragua and the Venezuelan government, contradicting statements that Trump administration officials have made to justify their invocation of the Alien Enemies Act and deporting Venezuelan…",
    "link": "https://japantoday.com/category/world/us-intelligence-contradicts-trump-claims-linking-gang-to-venezuelan-government-to-speed-deportations",
    "timestamp": "2025-04-18T04:27:19Z"
  },
  {
    "title": "Polish President Backs Push For Access to French Nuclear Shield",
    "description": "Poland’s President Andrzej Duda said his country should seek the protection of France’s nuclear deterrent against a potential Russian threat as he continued to call for access to US atomic weapons.",
    "link": "https://financialpost.com/pmn/business-pmn/polish-president-backs-push-for-access-to-french-nuclear-shield",
    "timestamp": "2025-04-18T04:24:35Z"
  },
  {
    "title": "Tariffs ignore the reality of global tech supply chains",
    "description": "Nvidia has become a symbol of the looming business nightmare unleashed by Donald Trump",
    "link": "https://biztoc.com/x/a845ba515303e18d",
    "timestamp": "2025-04-18T04:24:19Z"
  },
  {
    "title": "Trump's Reason Behind Alien Enemies Act Contradicted By New Intel",
    "description": "A new assessment says there is no coordination between Tren de Aragua and the Venezuelan government.",
    "link": "https://www.newsweek.com/trumps-reason-behind-alien-enemies-act-contradicted-new-intel-2061341",
    "timestamp": "2025-04-18T04:23:44Z"
  },
  {
    "title": "Law firms, universities and now civil society groups are in Trump's sights for punitive action",
    "description": "First, the nation’s top law firms",
    "link": "https://abcnews.go.com/Health/wireStory/law-firms-universities-now-civil-society-groups-trumps-120935897",
    "timestamp": "2025-04-18T04:22:27Z"
  },
  {
    "title": "Career diplomat becomes the face of Trump's 'America First' agenda at the UN",
    "description": "Veteran diplomat Dorothy Shea, currently the top U.S. representative at the UN, embodies a stark shift in American foreign policy. Despite previously condemning Russia's actions in Ukraine, she recently voiced the U.S.'s refusal to back a UN resolution blamin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/career-diplomat-becomes-the-face-of-trumps-america-first-agenda-at-the-un/articleshow/120398969.cms",
    "timestamp": "2025-04-18T04:20:23Z"
  },
  {
    "title": "Indonesia says to increase US imports, lower orders from other countries",
    "description": "Indonesia plans to boost imports from the U.S. This includes food, commodities, and energy. Airlangga Hartarto announced this in Washington. The move aims to address trade surplus concerns. Indonesia will also buy agricultural products and capital goods. The …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/indonesia-says-to-increase-us-imports-lower-orders-from-other-countries/articleshow/120398956.cms",
    "timestamp": "2025-04-18T04:19:31Z"
  },
  {
    "title": "From Infosys to TCS: Are IT companies in a downturn? Are IT jobs in danger? Zoho CEO Sridhar Vembu says...",
    "description": "Zoho CEO Sridhar Vembu attributes the downturn in Indian IT services to internal inefficiencies rather than external factors like US tariffs or AI. IT majors – Infosys, TCS, and Wipro – reported disappointing earnings in Q4.",
    "link": "https://www.livemint.com/companies/people/from-infosys-to-tcs-are-it-companies-in-a-downturn-are-it-jobs-in-danger-zoho-ceo-sridhar-vembu-says-11744940660866.html",
    "timestamp": "2025-04-18T04:14:53Z"
  },
  {
    "title": "US strikes ‘Houthi-controlled’ fuel port in Yemen",
    "description": "The US has struck a Houthi-linked fuel port in Yemen Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615921-us-hits-yemen-houthi-port/",
    "timestamp": "2025-04-18T04:10:54Z"
  },
  {
    "title": "US Unveils New Port Fees For Chinese-Linked Ships",
    "description": "The United States unveiled new port fees on Chinese built and operated ships, in a bid to boost the domestic shipbuilding industry and curb China&#039;s dominance in the sector.",
    "link": "https://www.ndtv.com/world-news/us-unveils-new-port-fees-for-chinese-linked-ships-8193185",
    "timestamp": "2025-04-18T04:10:27Z"
  },
  {
    "title": "Mideast Peace Depends on an unlikely Trump-Iran Nuclear Deal",
    "description": "By Simon Mabon, Lancaster University For the second week in a row, senior officials from the United States and Iran will get together to take part in talks about the Iranian nuclear programme. It’s the second round in the latest negotiations – the first havin…",
    "link": "https://www.juancole.com/2025/04/mideast-depends-unlikely.html",
    "timestamp": "2025-04-18T04:06:17Z"
  },
  {
    "title": "Trump threatens to fire Fed Chair Powell",
    "description": "Jerome Powell drew the ire of President Donald Trump yesterday, with the leader of the free world posting to social media, “Powell’s termination cannot come fast enough!”\nTrump’s latest frustration arose as the European Central Bank lowered its borrowing rate…",
    "link": "https://biztoc.com/x/9783d3f095aed1c8",
    "timestamp": "2025-04-18T04:02:21Z"
  },
  {
    "title": "Other Countries Can Fill U.S. Void in FCPA Enforcement",
    "description": "Shifting U.S. enforcement priorities may soon create a crisis in international anti-corruption efforts. For decades, the United States spearheaded those efforts through prosecutions under the Foreign Corrupt Practices Act (FCPA). On February 10, however, Pres…",
    "link": "https://clsbluesky.law.columbia.edu/2025/04/18/other-countries-can-fill-u-s-void-in-fcpa-enforcement/",
    "timestamp": "2025-04-18T04:01:26Z"
  },
  {
    "title": "2 Dead, At Least 6 Injured In FSU Shooting; Trump Under Fire For 'Insensitive' Comments",
    "description": "Two people have been killed and at least six others are being treated after a gunman fired at the Florida State University Thursday.",
    "link": "https://www.ibtimes.com/2-dead-least-6-injured-fsu-shooting-trump-under-fire-insensitive-comments-3770546",
    "timestamp": "2025-04-18T04:00:58Z"
  },
  {
    "title": "Ukraine sees no chance of Easter truce as Trump’s deadline looms",
    "description": "A new US+E3 format has marked a shift in Washington’s approach.",
    "link": "https://www.euractiv.com/section/politics/news/ukraine-sees-no-chance-of-easter-truce-as-trumps-deadline-looms/",
    "timestamp": "2025-04-18T04:00:57Z"
  },
  {
    "title": "Why Trump voters will love him even more if he faces public protest over Social Security",
    "description": "In a recent edition, I wrote about how most people most of the time choose to believe in the existence of certain eternal rules that powerful figures must obey, and how they continue to believe in these rules even as powerful figures break them over and over …",
    "link": "https://www.rawstory.com/raw-investigates/trump-voters-social-security/",
    "timestamp": "2025-04-18T04:00:16Z"
  },
  {
    "title": "Starmer Wants Trump’s Free Trade Deal—But Free Speech Comes First",
    "description": "British Prime Minister Sir Keir Starmer keeps saying that Britain is open for business. The issue is that the type of business the UK needs requires engaging with President Donald Trump—and he’s not buying what Starmer’s selling. No...",
    "link": "https://www.americanthinker.com/articles/2025/04/starmer_wants_trump_s_free_trade_deal_but_free_speech_comes_first.html",
    "timestamp": "2025-04-18T04:00:00Z"
  },
  {
    "title": "The new conservatives",
    "description": "It turns out that being raised around the fallout from crazy people may affect your political views. I say this because a new poll shows that there’s cause for optimism about the younger generation.\r\n\r\nThat’s actually not news to me. Four...",
    "link": "https://www.americanthinker.com/blog/2025/04/the_new_conservatives.html",
    "timestamp": "2025-04-18T04:00:00Z"
  },
  {
    "title": "Trump took over the Kennedy Center. In Ireland we have a much subtler way of diminishing the arts",
    "description": "JD Vance’s arrival at the Washington venue sparked a viral drama. In Dublin, the National Concert Hall has suffered from decades of political indifference",
    "link": "https://www.irishtimes.com/culture/music/2025/04/18/trump-took-over-the-kennedy-center-in-ireland-we-have-a-much-subtler-way-of-diminishing-the-arts/",
    "timestamp": "2025-04-18T04:00:00Z"
  },
  {
    "title": "On Newstalk, Bertie Ahern’s talent for mangling everyday phrases is undimmed by years away from politics",
    "description": "Radio: The former taoiseach joins former tánaiste Simon Coveney to analyse the turmoil surrounding Donald Trump’s tariffs",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/04/18/on-newstalk-bertie-aherns-talent-for-mangling-everyday-phrases-is-undimmed-by-years-away-from-politics/",
    "timestamp": "2025-04-18T04:00:00Z"
  }
]