[
  {
    "title": "Republican Rep. Backs Trump Declaring U.S. Is In 'Non-International Armed Conflict' With Cartels: 'Until The End'",
    "description": "Republican Rep. Carlos Gimenez said he backs President Donald Trump's decision to declare that the U.S. is in a \"non-international armed conflict\" with cartels as it will help the administration \"annihilate the Cartel de los Soles led by Nicolas Maduro in Ven…",
    "link": "https://www.ibtimes.com/republican-rep-backs-trump-declaring-us-non-international-armed-conflict-cartels-until-3785321",
    "timestamp": "2025-10-02T22:48:15Z"
  },
  {
    "title": "Argentina’s Congress overturns President Javier Milei’s veto on funding",
    "description": "The congressional setback arrives as Milei's political party faces slumping popularity headed into a midterm election.",
    "link": "https://www.aljazeera.com/news/2025/10/2/argentinas-congress-overturns-president-javier-mileis-veto-on-funding",
    "timestamp": "2025-10-02T22:46:39Z"
  },
  {
    "title": "JORGE MARTINEZ: Democrats Chose Illegal Immigrant Benefits Over The American People, And Now Washington Is Closed",
    "description": "The government is officially shut down. This crisis is not the product of fiscal prudence or a careful budgeting process",
    "link": "https://dailycaller.com/2025/10/02/opinion-democrats-chose-illegal-immigrant-benefits-over-the-american-people-and-now-washington-is-closed-jorge-martinez/",
    "timestamp": "2025-10-02T22:44:05Z"
  },
  {
    "title": "Fact-checking what politicians are saying about the 2025 government shutdown",
    "description": "When Congress can’t reach a funding agreement, both sides of the political aisle whip up talking points about what a shutdown means for the economy, immigration, worker paychecks, disaster response and services for low-income families. The blame is nearly alw…",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-what-politicians-are-saying-about-the-2025-government-shutdown",
    "timestamp": "2025-10-02T22:42:16Z"
  },
  {
    "title": "Trump will help Ukraine hit Putin where it hurts — to finally end his bloody war",
    "description": "As Moscow continues to flout his efforts to broker peace, Trump is giving Kyiv the intel it needs to take the war to Vladimir Putin’s doorstep.",
    "link": "https://nypost.com/2025/10/02/opinion/trump-helps-ukraine-hit-putin-where-it-hurts-to-end-his-bloody-war/",
    "timestamp": "2025-10-02T22:42:03Z"
  },
  {
    "title": "Judge quits major National Guard case after Trump admin files 'suggestion of recusal'",
    "description": "A federal judge targeted by President Donald Trump and his Department of Justice recused himself Friday just hours before he was set to oversee a case involving the Trump administration's deployment of troops to Portland.Judge Michael H. Simon has been replac…",
    "link": "https://www.rawstory.com/donald-trump-2674149657/",
    "timestamp": "2025-10-02T22:39:25Z"
  },
  {
    "title": "Illegal migrant school chief’s sordid past revealed: Sex, lies and DEI payouts",
    "description": "The school district superintendent arrested by ICE this week lied about attending MIT and was the subject of two sex discrimination lawsuits, The Post has learned. Snappy-dresser Ian Andre Roberts, 51, was fired by Des Moines Public Schools after it emerged h…",
    "link": "https://freerepublic.com/focus/f-news/4343998/posts",
    "timestamp": "2025-10-02T22:39:00Z"
  },
  {
    "title": "The chaos at the Pentagon, explained",
    "description": "When Secretary of Defense Pete Hegseth summoned around 800 top military officers to Quantico, Virginia, this week, there was widespread speculation about mass firings, new geopolitical priorities, even a declaration of war. None of that happened. Instead, Pre…",
    "link": "https://www.vox.com/podcasts/463675/pentagon-hegseth-trump-quantico-chaos",
    "timestamp": "2025-10-02T22:37:25Z"
  },
  {
    "title": "Failing to Stop Them, Russia Announces Plan to Ignore U.N. Sanctions on Iran",
    "description": "The government of Russia confirmed on Wednesday that it would entirely disregard United Nations \"snapback\" sanctions on Iran reimposed this week after the International Atomic Energy Agency (IAEA) ruled Iran in violation of international laws governing nuclea…",
    "link": "https://www.breitbart.com/middle-east/2025/10/02/failing-to-stop-them-russia-announces-plan-to-ignore-u-n-sanctions-on-iran/",
    "timestamp": "2025-10-02T22:37:18Z"
  },
  {
    "title": "Pope Leo chides climate skeptics, embraces Francis’s environmental legacy",
    "description": "Pope Leo chides climate skeptics, embraces Francis’s environmental legacyPope Leo XIV took aim Wednesday at climate skeptics who “ridicule those who speak of global warming,” as he strongly embraced Pope Francis’ environmental legacy and made it his own in so…",
    "link": "https://freerepublic.com/focus/f-religion/4343997/posts",
    "timestamp": "2025-10-02T22:37:01Z"
  },
  {
    "title": "Russian leader responds to American conservative's murder: 'A disgusting atrocity'",
    "description": "Russian President Vladimir Putin called Charlie Kirk's assassination a sign of deep division in American society while offering his condolences.",
    "link": "https://www.foxnews.com/world/russian-leader-responds-american-conservatives-murder-a-disgusting-atrocity",
    "timestamp": "2025-10-02T22:34:12Z"
  },
  {
    "title": "Online attacks threaten major climate-friendly diet report",
    "description": "A major scientific update to one of the most influential food and planetary health reports of the last decade is in the crosshairs of a pro-meat misinformation campaign. A healthy diet, for people and the planet, would include a more varied menu of nut and le…",
    "link": "https://www.dw.com/en/online-attacks-threaten-major-climate-friendly-diet-report/a-74219482",
    "timestamp": "2025-10-02T22:33:00Z"
  },
  {
    "title": "Laotian refugee living in U.S. since childhood faces threat of deportation",
    "description": "As President Trump intensifies his sweeping crackdown on immigration, more longtime residents, people who have lived in this country for years, are being caught up in the effort. Deportation flights to Laos have resumed for the first time in years. Stephanie …",
    "link": "https://www.pbs.org/newshour/show/laotian-refugee-living-in-u-s-since-childhood-faces-threat-of-deportation",
    "timestamp": "2025-10-02T22:30:48Z"
  },
  {
    "title": "Trump Announces “TrumpRx” Website and Pfizer Deal to Slash Drug Prices, Boost U.S. Manufacturing",
    "description": "President Donald Trump announced a landmark agreement with Pfizer to implement \"most-favored-nation\" pricing for Medicaid, ensuring the U.S. pays no more than the lowest prices offered to other developed nations.",
    "link": "https://www.shtfplan.com/headline-news/trump-announces-trumprx-website-and-pfizer-deal-to-slash-drug-prices-boost-u-s-manufacturing",
    "timestamp": "2025-10-02T22:30:32Z"
  },
  {
    "title": "Join Us at The New Yorker Festival",
    "description": "From the daily newsletter: join Salman Rushdie, Emma Thompson, Christopher Guest, Jamaica Kincaid, and more.",
    "link": "https://www.newyorker.com/newsletter/the-daily/join-us-at-the-new-yorker-festival",
    "timestamp": "2025-10-02T22:30:00Z"
  },
  {
    "title": "Sean Combs Gets Personal In One Last Pitch For Freedom Before Sentencing: “The Old Me Died In Jail & A New Version Of Me Was Reborn”",
    "description": "With less than 24 hours to go before Sean Combs learns if he will spend years or just months in prison for being found guilty this summer on two counts of transportation to engage in prostitution, the one time high-flying “All About the Benjamins” performer i…",
    "link": "http://deadline.com/2025/10/sean-combs-letter-sentencing-jail-release-1236568906/",
    "timestamp": "2025-10-02T22:29:25Z"
  },
  {
    "title": "Trump’s “war” with drug cartels, briefly explained",
    "description": "President Donald Trump speaks to senior military leaders at Marine Corps Base Quantico on September 30, 2025, in Quantico, Virginia. | Andrew Harnik/Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Tru…",
    "link": "https://biztoc.com/x/f3d260aa24ec5a19",
    "timestamp": "2025-10-02T22:24:42Z"
  },
  {
    "title": "Devout Catholic Karoline Leavitt Slammed Pope Leo's Viral \"Inhuman\" Comment About How The US Is Treating Immigrants",
    "description": "Karoline Leavitt, a devout Catholic, fired back at the leader of the Catholic Church.",
    "link": "https://www.buzzfeed.com/elysewanshel1/karoline-leavitt-slams-pope-leo-immigration-comment",
    "timestamp": "2025-10-02T22:23:11Z"
  },
  {
    "title": "Texas megachurch founder Robert Morris pleads guilty to child sex abuse charges",
    "description": "The founder and senior pastor of Gateway Church struck a plea agreement.",
    "link": "https://www.bostonherald.com/2025/10/02/texas-megachurch-founder-child-sex-abuse/",
    "timestamp": "2025-10-02T22:22:32Z"
  },
  {
    "title": "'Emergency' nude bike ride planned to 'stand up' to Trump",
    "description": "Activists in Portland, Oregon, plan to hold an \"emergency\" nude bike ride to \"stand up for justice\" against President Donald Trump as he pushes to bring National Guard troops to the Pacific Northwest town. An offshoot organization of the World Naked Bike Ride…",
    "link": "https://www.rawstory.com/donald-trump-2674149607/",
    "timestamp": "2025-10-02T22:22:03Z"
  },
  {
    "title": "Trump’s “war” with drug cartels, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is claiming that the US is en…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/463681/donald-trump-war-drug-cartels-venezuela-international-law",
    "timestamp": "2025-10-02T22:20:41Z"
  },
  {
    "title": "Judge recuses himself from Oregon National Guard case",
    "description": "(Reuters) -An Oregon federal judge on Thursday recused himself from a court battle over President Donald Trump's decision to send National Guard troops to...",
    "link": "https://www.yahoo.com/news/articles/judge-recuses-himself-oregon-national-221927215.html",
    "timestamp": "2025-10-02T22:19:27Z"
  },
  {
    "title": "A year of horror: Halloween industry shaken by tariffs",
    "description": "Chris Zephro’s warehouse full of latex masks, “Saw” movie props, and zombie apocalypse games is a testament to his love of horror.",
    "link": "https://www.cnn.com/2025/10/02/business/tariff-halloween-prices",
    "timestamp": "2025-10-02T22:18:31Z"
  },
  {
    "title": "5 Democrats Who May Fold Under Pressure to End Government Shutdown",
    "description": "Senate Republicans need five more votes from Democrats to pass their continuing resolution (CR) to reopen the government, with some eyeing moderates from the other side of the aisle who may be convinced to cross over.\nThe post 5 Democrats Who May Fold Under P…",
    "link": "https://www.breitbart.com/politics/2025/10/02/5-democrats-who-may-fold-under-pressure-to-end-government-shutdown/",
    "timestamp": "2025-10-02T22:18:25Z"
  },
  {
    "title": "The Bob Cesca Podcast: Weird, Whiny, and Racist",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Weird, Whiny, and Racist -- The government shutdown is underway. Federal workers are being forced to blame Democrats. Donald's racist sombrero memes. Republicans need affordable healthcare pre…",
    "link": "https://littlegreenfootballs.com/article/54959_The_Bob_Cesca_Podcast-_Weird_W",
    "timestamp": "2025-10-02T22:15:33Z"
  },
  {
    "title": "Trump Floated A Seriously Disturbing Plan For U.S. Cities. Experts Say It's 'Very Concerning.'",
    "description": "Experts in political science and constitutional law are sounding the alarm on the president's speech, which featured language of \"totalitarianism\" and \"authoritarian\" rhetoric.",
    "link": "https://www.huffpost.com/entry/donald-trump-us-cities-dangerous-experts_n_68de8f3be4b028d81f309e8f",
    "timestamp": "2025-10-02T22:14:59Z"
  },
  {
    "title": "Johnson said to have met with Trump at White House",
    "description": "United States House Speaker Mike Johnson met with President Donald Trump at the White House Thursday afternoon, CNN reported, citing an unnamed White House official.\nJohnson, who the news agency obse...",
    "link": "https://biztoc.com/x/e2208c0f0d3d6f91",
    "timestamp": "2025-10-02T22:14:00Z"
  },
  {
    "title": "Trump Pressures Elite Universities to Accept More Americans over Foreigners, DEI",
    "description": "President Donald Trump is pressuring elite universities to open their classrooms to more Americans by sharply reducing their enrollment of job-seeking foreign students.\nThe post Trump Pressures Elite Universities to Accept More Americans over Foreigners, DEI …",
    "link": "https://www.breitbart.com/immigration/2025/10/02/trump-pressures-elite-universities-to-accept-more-americans-over-foreigners-dei/",
    "timestamp": "2025-10-02T22:13:21Z"
  },
  {
    "title": "Democrats Ask For Money While Blaming Trump, GOP For Shutdown",
    "description": "Leading Democrats are fundraising off of the government shutdown — and blaming Republicans and President Donald Trump for it — despite voting against keeping government operations running, according to emails reviewed by the Daily Caller News Foundation.  Sen…",
    "link": "https://dailycaller.com/2025/10/02/democrats-fundraising-government-shutdown-trump-republicans/",
    "timestamp": "2025-10-02T22:12:30Z"
  },
  {
    "title": "Amnesty calls for immediate release of hostages, but excludes Goldin, soldiers",
    "description": "Previous Amnesty calls for the release of hostages, such as a November 2023 statement, demanded the release of civilians but only called for the humane and...",
    "link": "https://www.jpost.com/israel-news/article-869269",
    "timestamp": "2025-10-02T22:10:44Z"
  },
  {
    "title": "Trump Cabinet member isn't bright enough to keep Epstein cover-up going: Ex-GOP strategist",
    "description": "President Donald Trump's Commerce Secretary, Howard Lutnick, is too dumb to keep any possible Jeffrey Epstein cover-up going, argued former GOP spokesperson and strategist Tim Miller in an MSNBC discussion with anchor Nicolle Wallace and reporter Tara Palmeri…",
    "link": "https://www.rawstory.com/tim-miller-2674149463/",
    "timestamp": "2025-10-02T22:10:22Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The three major U.S. indexes notched record highs across the board on Thursday as strength in the AI trade persisted.",
    "link": "https://www.cnbc.com/2025/10/02/stock-market-today-live-updates.html",
    "timestamp": "2025-10-02T22:06:09Z"
  },
  {
    "title": "Japan’s next leader may be its first woman or youngest in modern era",
    "description": "TOKYO (Reuters) -Japan stands a good chance of having its first woman prime minister or its youngest leader in the modern era after a vote on Saturday to pick the head of the nation's ruling party. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/03/japans-next-leader-may-be-its-first-woman-or-youngest-in-modern-era",
    "timestamp": "2025-10-02T22:06:00Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez says Schumer and Jeffries are leading the Democrats' shutdown fight",
    "description": "In an interview with NBC News, Rep. Ocasio-Cortez says her caucus is \"tremendously united\" in demand to end shutdown.",
    "link": "https://www.nbcnews.com/politics/politics-news/alexandria-ocasio-cortez-says-schumer-jeffries-are-leading-democrats-s-rcna235300",
    "timestamp": "2025-10-02T22:03:50Z"
  },
  {
    "title": "Trump floats rebates for Americans, signals project cuts",
    "description": "United States President Donald Trump said projects could be cut permanently if a government shutdown, which is now in its second day, continues, while also signaling possible tariff-funded rebates for...",
    "link": "https://biztoc.com/x/255685b50d2587b6",
    "timestamp": "2025-10-02T22:02:47Z"
  },
  {
    "title": "Thune digs in on 'stupid' shutdown: Talks with Schumer are 'not going to accomplish a lot'",
    "description": "Republican Senate Leader John Thune said the government shutdown is \"stupid\" and a negotiation with Democratic Leader Chuck Schumer won't \"accomplish a lot.\"",
    "link": "https://www.nbcnews.com/politics/congress/thune-digs-in-shutdown-talks-schumer-are-not-going-accomplish-lot-rcna235281",
    "timestamp": "2025-10-02T22:01:07Z"
  },
  {
    "title": "FBI fires agent trainee who displayed Pride flag...",
    "description": "FBI Director Kash Patel has fired a longtime bureau employee who displayed a Pride flag in his workspace during a past assignment, according to multiple people familiar with the termination.",
    "link": "https://www.cnn.com/2025/10/02/politics/kash-patel-fires-fbi-trainee-for-displaying-pride-flag",
    "timestamp": "2025-10-02T22:00:08Z"
  },
  {
    "title": "Moldova: The Next Front in the West’s Confrontation With Russia?",
    "description": "Moldova’s September 28, 2025, parliamentary elections are shaping up to be another highly contentious struggle between pro-Russia and anti-Russia factions.  Both the European Union and Moscow also are accusing each other of illicit election meddling to put th…",
    "link": "https://www.activistpost.com/moldova-the-next-front-in-the-wests-confrontation-with-russia/",
    "timestamp": "2025-10-02T22:00:00Z"
  },
  {
    "title": "Government Shutdown and Free Speech Showdown",
    "description": "Amid the Republican-Democrat blame game, a federal judge’s extraordinary ruling takes on the Trump administration’s unlawful detentions of pro-Palestine protesters.\nThe post Government Shutdown and Free Speech Showdown appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/02/podcast-government-shutdown-free-speech/",
    "timestamp": "2025-10-02T22:00:00Z"
  },
  {
    "title": "Next Church of Latter-day Saints President is a Fierce Defender of Religious Liberty",
    "description": "The Church of Jesus Christ of Latter-day Saints, previously known as the Mormon Church, lost its leader over the weekend, and his replacement is a... Read More\nThe post Next Church of Latter-day Saints President is a Fierce Defender of Religious Liberty appea…",
    "link": "https://www.dailysignal.com/2025/10/02/new-church-of-latter-day-saints-president-is-fierce-defender-religious-liberty/",
    "timestamp": "2025-10-02T22:00:00Z"
  },
  {
    "title": "Trump Wants To Turn U.S. Military Against American People With Latest Plan, LA Mayor Says",
    "description": "Karen Bass (D) slammed Trump for suggesting that the military use some of the country’s “dangerous cities as training grounds.”",
    "link": "https://www.huffpost.com/entry/los-angeles-mayor-karen-bass-donald-trump-military_n_68de8ffee4b07cde51cd5994",
    "timestamp": "2025-10-02T21:57:00Z"
  },
  {
    "title": "Operation ‘clog the toilet’: Far-right trolls target H-1B Indians with fake flight bookings",
    "description": "“Indians are just waking up after Trump nuked the H1B program. Want to keep them in India? Clog the flight reservation system!” “Operation Clog the toilet needs your help. 4chan hatched a diabolical plan to clog up flight schedules to keep the Poopjeets in In…",
    "link": "https://freerepublic.com/focus/f-chat/4343996/posts",
    "timestamp": "2025-10-02T21:56:04Z"
  },
  {
    "title": "The Next Industry to Bow to Trump",
    "description": "Pfizer is granting the president’s long-standing demands. Other drug companies could soon follow suit.",
    "link": "https://www.theatlantic.com/health/2025/10/pfizer-trump-deal/684442/",
    "timestamp": "2025-10-02T21:55:00Z"
  },
  {
    "title": "Senior member of Venezuela's Tren de Aragua gang arrested",
    "description": "The alleged head of the gang's armed wing was arrested in an operation between Colombia, the US and the UK.",
    "link": "https://www.bbc.com/news/articles/c5yezvz4nppo",
    "timestamp": "2025-10-02T21:52:13Z"
  },
  {
    "title": "The Trump administration is already falling into the Bad Bunny trap",
    "description": "President Donald Trump and Puerto Rican rapper Bad Bunny are headed for a Super Bowl halftime show clash after Corey Lewandowski threatens ICE patrols.",
    "link": "https://biztoc.com/x/a31c7e75e74619d3",
    "timestamp": "2025-10-02T21:51:51Z"
  },
  {
    "title": "Trump signals project cuts, floats rebates for Americans",
    "description": "United States President Donald Trump said projects could be cut permanently if a government shutdown, which is now in its second day, continues, while also signaling possible tariff-funded rebate chec...",
    "link": "https://biztoc.com/x/2d62b34177a4ef49",
    "timestamp": "2025-10-02T21:51:47Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs will be sentenced under the Mann Act, a prostitution law from 1910",
    "description": "The Mann Act makes it illegal to transport someone across state lines for prostitution.",
    "link": "https://www.bostonherald.com/2025/10/02/sexual-misconduct-diddy-mann-act/",
    "timestamp": "2025-10-02T21:51:44Z"
  },
  {
    "title": "Federal government shutdown not slowing down ICE Boston in Massachusetts",
    "description": "Agents with the ICE Boston field office are not slowing down during the federal government shutdown as they continue to target criminal illegal aliens across the region, but for no pay.",
    "link": "https://www.bostonherald.com/2025/10/02/federal-government-shutdown-not-slowing-down-ice-boston-in-massachusetts/",
    "timestamp": "2025-10-02T21:50:48Z"
  },
  {
    "title": "No Pro-Life Voice on CNN Panel On Pope Leo on Abortion and Death Penalty",
    "description": "It's a matter of logic. If you're not pro-life if you oppose abortion but support the death penalty, then you're not pro-life if you oppose the death penalty but support abortion. But it's not clear that Pope Leo embraces that logic. And no one on the panel o…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343993/posts",
    "timestamp": "2025-10-02T21:50:41Z"
  },
  {
    "title": "Trump offers Qatar, which gave him a fancy plane, a NATO-like security guarantee (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTrump offers Qatar, which gave him a fancy plane, a NATO-like security guarantee  —  Without bothering to go through Congress, the president signed an executive order this week vowing to defend Qatar in the event of a foreign attack.  —  …",
    "link": "https://www.memeorandum.com/251002/p116",
    "timestamp": "2025-10-02T21:50:01Z"
  },
  {
    "title": "Trump Reportedly Eyeing $10 Billion Farmer Bailout—Using Tariffs: Here’s What To Know",
    "description": "Treasury Secretary Scott Bessent said information on “substantial support” for farmers would be released next week.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/02/trump-reportedly-eyeing-10-billion-farmer-bailout-using-tariffs-heres-what-to-know/",
    "timestamp": "2025-10-02T21:48:28Z"
  },
  {
    "title": "Dave Chappelle Addresses Free Speech in America During Set at Saudi Arabia Comedy Festival: “It’s Easier to Talk Here”",
    "description": "The comedian was one of more than 50 high-profile acts who performed at the controversial Riyadh Comedy Festival.\nDave Chappelle Addresses Free Speech in America During Set at Saudi Arabia Comedy Festival: “It’s Easier to Talk Here”\nJonah Krueger",
    "link": "https://consequence.net/2025/10/dave-chappelle-free-speech-in-america-saudi-arabia-comedy-festival/",
    "timestamp": "2025-10-02T21:47:45Z"
  },
  {
    "title": "'Complete betrayal': Mike Pence melts down as Trump admin abandons major promise",
    "description": "Former Vice President Mike Pence melted down Thursday after President Donald Trump's administration approved a generic version of an abortion drug, thereby abandoning a key promise to a part of his base. The Food and Drug Administration on Thursday approved a…",
    "link": "https://www.rawstory.com/mike-pence-2674149470/",
    "timestamp": "2025-10-02T21:46:03Z"
  },
  {
    "title": "Americans Aren't Buying Trump's Blame Game Over Government Shutdown",
    "description": "Voters revealed which party they think is most responsible for the political stalemate in a fresh poll from The Washington Post.",
    "link": "https://www.huffpost.com/entry/trump-government-shutdown-responsible-poll_n_68dec382e4b07cde51cd8fac",
    "timestamp": "2025-10-02T21:45:09Z"
  },
  {
    "title": "14 new October driving laws you need to know — $425 camera fines included",
    "description": "October 1 ushers in 14 new road laws and driving rule changes across the US, impacting millions. Maryland introduces a $425 speed camera fine and stricter reckless driving penalties. Connecticut cracks down on street takeovers and impaired driving, while Flor…",
    "link": "https://economictimes.indiatimes.com/news/international/us/14-new-october-driving-laws-you-need-to-know-425-camera-fines-included/articleshow/124278864.cms",
    "timestamp": "2025-10-02T21:43:23Z"
  },
  {
    "title": "Japan, U.S. arranging Trump visit on Oct 27 for talks with new PM",
    "description": "The Japanese and U.S. governments are arranging for President Donald Trump to visit Japan for talks with the country's new prime minister, diplomatic sources said Thursday. At their planned summit, Trump and the new leader are expected to reaffirm the importa…",
    "link": "https://japantoday.com/category/politics/Japan-US-arranging-Trump-visit-on-Oct-27-for-talks-with-new-PM",
    "timestamp": "2025-10-02T21:41:36Z"
  },
  {
    "title": "Trump warns of project cuts, floats rebates for Americans",
    "description": "United States President Donald Trump said projects could be cut permanently if a government shutdown, which is now in its second day, continues, while also making note of possible tariff-funded rebate...",
    "link": "https://biztoc.com/x/01ceb011d09a62e9",
    "timestamp": "2025-10-02T21:40:45Z"
  },
  {
    "title": "Trump Is Shifting Strategy on Putin",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump Is Shifting Strategy on Putin appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/02/trump-is-shifting-strategy-on-putin/",
    "timestamp": "2025-10-02T21:39:06Z"
  },
  {
    "title": "Federal shutdowns usually don't do much economic damage. There are reasons to worry about this one",
    "description": "Shutdowns of the federal government usually don't leave much economic damage. But the one that started Wednesday looks riskier, not least because President Donald Trump is threatening to use the standoff to permanently eliminate thousands of government jobs a…",
    "link": "https://japantoday.com/category/business/federal-shutdowns-usually-don%27t-do-much-economic-damage.-there-are-reasons-to-worry-about-this-one",
    "timestamp": "2025-10-02T21:37:07Z"
  },
  {
    "title": "114,650 voters in Palm Beach County may go without representation in Florida's 2026 legislative session",
    "description": "FORT LAUDERDALE, Fla. — President Donald Trump, first lady Melania Trump and the other 114,648 registered voters in a state House district in Palm Beach...",
    "link": "https://www.sun-sentinel.com/2025/10/02/114650-voters-in-palm-beach-county-may-go-without-representation-in-2026-legislative-session/",
    "timestamp": "2025-10-02T21:35:00Z"
  },
  {
    "title": "Health care costs for many Californians will nearly double in three months because of Donald Trump, Governor Newsom warns",
    "description": "Health care costs for many Californians will nearly double in three months because of Donald Trump, Governor Newsom warnsca.gov",
    "link": "https://www.gov.ca.gov/2025/10/02/health-care-costs-for-many-californians-will-nearly-double-in-three-months-because-of-donald-trump-governor-newsom-warns/",
    "timestamp": "2025-10-02T21:33:17Z"
  },
  {
    "title": "Japan, U.S. arranging Trump visit Oct 27 for talks with new PM",
    "description": "The Japanese and U.S. governments are arranging for President Donald Trump to visit Japan for talks with the country's new prime minister, diplomatic sources said Thursday. At their planned summit, Trump and the new leader are expected to reaffirm the importa…",
    "link": "https://japantoday.com/category/politics/Japan-U.S.-arranging-Trump-visit-Oct-27-for-talks-with-new-PM",
    "timestamp": "2025-10-02T21:33:13Z"
  },
  {
    "title": "Egypt says it is seeking Hamas approval for Trump plan to end Gaza war",
    "description": "Egypt's foreign minister warned of escalation if the Palestinian group rejects plan to end the nearly two-year conflict.",
    "link": "https://www.aljazeera.com/news/2025/10/2/egypt-says-it-is-seeking-hamas-approval-for-trump-plan-to-end-gaza-war",
    "timestamp": "2025-10-02T21:33:02Z"
  },
  {
    "title": "US Farmers Hit By Trade War To Get 'Substantial' Aid: Treasury Chief",
    "description": "US Treasury Secretary Scott Bessent signaled Thursday that \"substantial support\" for farmers would be announced next week, particularly for those growing soybeans, as they struggle with fallout from President Donald Trump's trade conflicts.",
    "link": "https://www.ibtimes.com/us-farmers-hit-trade-war-get-substantial-aid-treasury-chief-3785315",
    "timestamp": "2025-10-02T21:30:20Z"
  },
  {
    "title": "How will lawmakers find a way out of shutdown?",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn't extend or restore health benefits. Now they have to figure out how to get out of it.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_b4470f86-aa49-5290-9703-69f188e91ee0.html",
    "timestamp": "2025-10-02T21:30:00Z"
  },
  {
    "title": "“It was his come-to-Jesus moment”: Mom explains what “finally” made her MAGA son turn on Trump",
    "description": "A TikTok mom says her son, a longtime supporter of President Donald Trump, has finally broken with the president. On Oct. 1, 2025, Paula (@genxpaula58v2) explained that her son’s turning point came during Trump’s remarks at Charlie Kirk’s memorial service. Di…",
    "link": "https://www.dailydot.com/viral-politics/son-180d-trump-mom-tiktok/",
    "timestamp": "2025-10-02T21:30:00Z"
  },
  {
    "title": "Lawmakers Lay Into Trump’s FDA After It Quietly Approves New Abortion Pill",
    "description": "Multiple GOP lawmakers blasted the Food and Drug Administration (FDA) following the agency’s greenlighting of a new abortion drug on Thursday. The flurry of criticism comes after the FDA approved of a new abortion pill from the drugmaker Evita Solutions, a co…",
    "link": "https://dailycaller.com/2025/10/02/josh-hawley-riley-moore-mark-harris-fda-generic-mifepristone/",
    "timestamp": "2025-10-02T21:28:22Z"
  },
  {
    "title": "Trump openly threatens to use shutdown to target Democrats for cuts",
    "description": "The White House also said the prospect of mass firings of federal workers was \"very real.\"",
    "link": "https://abcnews.go.com/Politics/trump-openly-threatens-shutdown-target-democrats-cuts/story?id=126151790",
    "timestamp": "2025-10-02T21:28:05Z"
  },
  {
    "title": "Trump says U.S. is in 'armed conflict' with drug cartels after ordering strikes in the Caribbean",
    "description": "President Donald Trump has declared drug cartels to be unlawful combatants and says the United States is now in a “non-international armed conflict,” according to a Trump administration memo obtained by The Associated Press on Thursday, following recent U.S. …",
    "link": "https://japantoday.com/category/world/trump-declares-drug-cartels-in-caribbean-unlawful-combatants",
    "timestamp": "2025-10-02T21:27:22Z"
  },
  {
    "title": "U.S. sends $230 million to Lebanon as it moves to disarm Hezbollah, sources say",
    "description": "U.S. President Donald Trump's administration approved $230 million for Lebanon's security forces this week as they push to disarm the once powerful armed group Hezbollah, sources in Washington and Beirut said. A Lebanese source familiar with the decision said…",
    "link": "https://japantoday.com/category/world/us-sends-230-million-to-lebanon-as-it-moves-to-disarm-hezbollah-sources-say",
    "timestamp": "2025-10-02T21:26:55Z"
  },
  {
    "title": "Trump asks 9 colleges to commit to his political agenda in exchange for favorable access to federal money",
    "description": "The White House is asking nine major universities to commit to President Donald Trump’s political priorities in exchange for more favorable access to federal money. A document sent to the universities encourages them to adopt the White House’s vision for Amer…",
    "link": "https://japantoday.com/category/world/trump-asks-9-colleges-to-commit-to-his-political-agenda-and-get-favorable-access-to-federal-money",
    "timestamp": "2025-10-02T21:26:49Z"
  },
  {
    "title": "'Come-to-Jesus meeting’: Military community reacts to Hegseth's get fit, get in line or get out speech",
    "description": "Military leaders received blunt orders from War Secretary Pete Hegseth about fitness standards and Trump administration policies at a historic Quantico meeting.",
    "link": "https://www.foxnews.com/politics/come-to-jesus-meeting-military-community-reacts-hegseths-get-fit-get-line-get-out-speech",
    "timestamp": "2025-10-02T21:26:28Z"
  },
  {
    "title": "Trump ally threatens immigration sweep at Bad Bunny Super Bowl show",
    "description": "U.S. authorities could conduct immigration sweeps at next year's Super Bowl, a Trump administration official has warned, following the announcement that Puerto Rican megastar Bad Bunny will headline the halftime show. &quot;There is nowhere that you can provi…",
    "link": "https://japantoday.com/category/world/trump-ally-threatens-immigration-sweep-at-bad-bunny-super-bowl-show",
    "timestamp": "2025-10-02T21:26:22Z"
  },
  {
    "title": "Putin swipes back at Trump's 'paper tiger' comment",
    "description": "The Russian president says it is NATO that is the \"paper tiger,\" and \"if anyone still has a desire to compete with us in the military sphere, as we say, feel free, let them try\".",
    "link": "https://www.abc.net.au/news/2025-10-03/vladimir-putin-swipes-back-at-donald-trump-paper-tiger/105847048",
    "timestamp": "2025-10-02T21:26:17Z"
  },
  {
    "title": "Israeli strikes kill dozens in Gaza as Hamas considers its response to Trump's peace proposal",
    "description": "Israeli strikes and gunfire killed at least 57 Palestinians in the Gaza Strip, health officials said Thursday, as Hamas was still considering its response to U.S. President Donald Trump's proposal for ending the nearly two-year war. The plan requires Hamas to…",
    "link": "https://japantoday.com/category/world/israeli-strikes-kill-dozens-in-gaza-as-hamas-considers-its-response-to-trump%27s-peace-proposal",
    "timestamp": "2025-10-02T21:26:10Z"
  },
  {
    "title": "Food Program For Women, Infants And Children At Risk During Shutdown",
    "description": "In a role reversal, Republicans are highlighting the shutdown threat to a program championed by Democrats.",
    "link": "https://www.huffpost.com/entry/wic-government-shutdown-food-benefits_n_68dee2e3e4b061291b1436c7",
    "timestamp": "2025-10-02T21:26:10Z"
  },
  {
    "title": "Trump piles pain on Democrats over U.S. government shutdown",
    "description": "Donald Trump signaled Thursday that he plans to follow through on his threat for mass layoffs of U.S. federal workers as he ratcheted pressure on Democrats to back moves to end the government shutdown. The Republican president announced he would meet budget c…",
    "link": "https://japantoday.com/category/world/trump-ramps-up-pressure-on-democrats-over-us-government-shutdown",
    "timestamp": "2025-10-02T21:26:01Z"
  },
  {
    "title": "Putin swipes back at Trump for calling Russia a 'paper tiger'",
    "description": "Russian President Vladimir Putin swiped back on Thursday at U.S. President Donald Trump for calling Russia a &quot;paper tiger&quot;, suggesting NATO might be one and warning the United States that if it supplied Tomahawk missiles to Ukraine it would trigger …",
    "link": "https://japantoday.com/category/world/putin-swipes-back-at-trump-is-nato-a-%27paper-tiger%27",
    "timestamp": "2025-10-02T21:25:48Z"
  },
  {
    "title": "Putin praises Trump but warns that supplies of US long-range missile to Ukraine will badly hurt ties",
    "description": "Putin appeared to appeal to Trump and his conservative supporters.",
    "link": "https://www.bostonherald.com/2025/10/02/russia-putin/",
    "timestamp": "2025-10-02T21:25:45Z"
  },
  {
    "title": "Elon Musk’s big week, from spurring a Netflix cancelation wave to blowing out EV sales estimates; Tesla stock falls",
    "description": "Tesla stock closed Thursday down 4.5% to $439 amid skepticism the new number really signals a turnaround given all the anti-Musk backlash.",
    "link": "https://fortune.com/2025/10/02/elon-musk-big-week-netflix-tesla-record-sales-ev-tax-credit/",
    "timestamp": "2025-10-02T21:23:48Z"
  },
  {
    "title": "Sean 'Diddy' Combs will be sentenced under the Mann Act, a prostitution law from 1910",
    "description": "Sean “Diddy” Combs is set to be sentenced Friday for violating the federal Mann Act, an anti-prostitution law with a century-old history.  Although he was...",
    "link": "https://www.yahoo.com/news/articles/sean-diddy-combs-sentenced-under-212320223.html",
    "timestamp": "2025-10-02T21:23:20Z"
  },
  {
    "title": "The Trump administration is already falling into the Bad Bunny trap",
    "description": "President Donald Trump and Puerto Rican rapper Bad Bunny are headed for a Super Bowl halftime show clash after Corey Lewandowski threatens ICE patrols.",
    "link": "https://www.msnbc.com/news/news-analysis/trump-administration-bad-bunny-trap-ice-corey-lewandowski-rcna235219",
    "timestamp": "2025-10-02T21:23:03Z"
  },
  {
    "title": "OPM Director Russ Vought To Cut Billions In Green Energy Funds",
    "description": "Russ Vought, often referred to as one of the masterminds behind Project 2025, aimed the cuts at 16 Democrat-led states.",
    "link": "https://hiphopwired.com/2856290/russ-vought-cut-billions-green-energy-funds/",
    "timestamp": "2025-10-02T21:23:02Z"
  },
  {
    "title": "Trump declares ‘armed conflict’ with drug cartels",
    "description": "President Donald Trump has declared that the United States is engaged in “armed conflict” with drug cartels, his administration said in a notice sent to Congress after recent strikes on boats off Venezuela. The letter, a copy of which was obtained by AFP on T…",
    "link": "https://www.digitaljournal.com/world/trump-declares-armed-conflict-with-drug-cartels/article",
    "timestamp": "2025-10-02T21:22:20Z"
  },
  {
    "title": "Trump Declares 'Armed Conflict' With Drug Cartels",
    "description": "President Donald Trump has declared that the United States is engaged in \"armed conflict\" with drug cartels, his administration said in a notice sent to Congress after recent strikes on boats off Venezuela.",
    "link": "https://www.ibtimes.com/trump-declares-armed-conflict-drug-cartels-3785313",
    "timestamp": "2025-10-02T21:21:09Z"
  },
  {
    "title": "Texas megachurch founder Robert Preston Morris pleads guilty to child sex abuse charges",
    "description": "The founder of a Texas megachurch who resigned last year after a woman in Oklahoma accused the pastor of sexually abusing her in the 1980s pleaded guilty Thursday to five counts of lewd and indecent acts with a child, authorities said.",
    "link": "https://www.cnn.com/2025/10/02/us/robert-morris-texas-megachurch-guilty-plea",
    "timestamp": "2025-10-02T21:19:15Z"
  },
  {
    "title": "Dietitian reveals the protein foods she eats every day, and why you should too",
    "description": "A sustainability-focused dietitian shares her eight favorite protein sources, which she incorporates daily for health and environmental benefits. Her plant-forward selections, including tofu, black beans, and chia seeds, offer significant nutritional value an…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dietitian-reveals-the-protein-foods-she-eats-every-day-and-why-you-should-too/articleshow/124278848.cms",
    "timestamp": "2025-10-02T21:19:06Z"
  },
  {
    "title": "Virginia voters sue to boot Democrat off ballot in district that could decide state House majority",
    "description": "Three Stafford County voters challenge Democrat Stacey Carroll's candidacy, claiming she lives in district 23 rather than district 64 where she filed to run for Virginia House.",
    "link": "https://www.foxnews.com/politics/virginia-voters-sue-boot-democrat-off-ballot-district-could-decide-state-house-majority",
    "timestamp": "2025-10-02T21:18:33Z"
  },
  {
    "title": "What is the significance of Trump's effort to remove the Fed's Lisa Cook?",
    "description": "President Donald Trump's effort to remove a member of the Federal Reserve's Board of Governors comes amid his push to reshape the composition of the central bank's panel that makes interest rate decisions.\nTrump attempted to fire Fed Governor Lisa Cook for ca…",
    "link": "https://biztoc.com/x/2299a32b65a2e72d",
    "timestamp": "2025-10-02T21:18:29Z"
  },
  {
    "title": "ICE makes 1.2K arrests in DC since fed takeover in August, compared to 85 in first 7 months of '25",
    "description": "From the start of President Trump's term this year through July, ICE had only made 85 arrests in Washington, D.C. U.S. Immigration and Customs Enforcement has made 1,200 arrests since the federal takeover in Washington, D.C., began in August, according to a r…",
    "link": "https://freerepublic.com/focus/f-news/4343991/posts",
    "timestamp": "2025-10-02T21:18:20Z"
  },
  {
    "title": "‘Cancel Netflix’ Campaign Backed By Elon Musk May Have Led to Stock Slide",
    "description": "Reading Time: 3 minutesElon Musk has launched a war against Netflix.\n‘Cancel Netflix’ Campaign Backed By Elon Musk May Have Led to Stock Slide was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/cancel-netflix-campaign-backed-by-elon-musk-may-have-led-to-stock-decline/",
    "timestamp": "2025-10-02T21:18:12Z"
  },
  {
    "title": "Senior Analyst: 'Ron Dermer deserves the Israel Prize, not delegitimization'",
    "description": "Senior analyst Amit Segal denounced the protests against Minister Ron Dermer, one of the key figures in the hostage negotiations, who has recently announced his resignation.",
    "link": "https://www.israelnationalnews.com/news/415720",
    "timestamp": "2025-10-02T21:16:42Z"
  }
]