[
  {
    "title": "Trump Fires Back at Frey: ‘Mayor and Governor Are Inciting Insurrection’",
    "description": "President Donald J. Trump delivered a forceful rebuke Saturday to Minneapolis Mayor Jacob Frey and Minnesota Governor Tim Walz, accusing both leaders of “inciting insurrection” through their handling of the Border Patrol agent‑involved shooting and the violen…",
    "link": "https://www.breitbart.com/border/2026/01/24/trump-fires-back-at-frey-mayor-and-governor-are-inciting-insurrection/",
    "timestamp": "2026-01-24T20:35:16Z"
  },
  {
    "title": "NBA postpones Timberwolves game",
    "description": "There’s something happening here: The Minnesota Timberwolves game scheduled for 4:30 p.m. Saturday at Target Center was postponed until Sunday, the NBA announced. The decision was made hours before tip off. The news came in the wake of a man being shot to dea…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/nba-postpones-timberwolves-game",
    "timestamp": "2026-01-24T20:30:02Z"
  },
  {
    "title": "Renée Fleming Latest Artist to Cancel Concerts at Kennedy Center Amid Donald Trump’s Takeover",
    "description": "The actress-singer previously departed as the Kennedy Center's Artistic Advisor-at-Large.\nRenée Fleming Latest Artist to Cancel Concerts at Kennedy Center Amid Donald Trump’s Takeover\nChris Coplan",
    "link": "https://consequence.net/2026/01/renee-fleming-latest-artist-to-cancel-concerts-at-kennedy-center-amid-donald-trumps-takeover/",
    "timestamp": "2026-01-24T20:27:01Z"
  },
  {
    "title": "Data: Federal immigration officers involved in 19 shootings in Trump's second term",
    "description": "In at least 19 incidents, federal immigration officers have fired guns at civilians under President Trump's immigration enforcement crackdown. In addition to the five killed, at least eight have been injured.",
    "link": "https://www.wcvb.com/article/immigration-officer-shooting-brandishing-timeline/70121247",
    "timestamp": "2026-01-24T20:26:07Z"
  },
  {
    "title": "PENGUIN memecoin surges 564% following White House social media post",
    "description": "The Nietzschean Penguin memecoin surged by triple digits after the White House published a social media post featuring US President Donald Trump and a penguin.",
    "link": "https://cointelegraph.com/news/penguin-memecoin-surge-564-white-house",
    "timestamp": "2026-01-24T20:24:23Z"
  },
  {
    "title": "Millions brace for 'catastrophic' ice as 18 states declare emergency amid historic winter storm",
    "description": "Officials urge Americans to stay indoors as historic winter storm creates \"catastrophic\" ice conditions and triggers the largest weather alert ever.",
    "link": "https://www.foxnews.com/media/millions-brace-catastrophic-ice-18-states-declare-emergency-amid-historic-winter-storm",
    "timestamp": "2026-01-24T20:24:23Z"
  },
  {
    "title": "Streamer-turned-singer d4vd under investigation for murder as Celeste Rivas Hernandez case unfolds",
    "description": "Singer d4vd is under investigation for the murder of Celeste Rivas Hernandez, whose body was found in a car. A key witness, d4vd's friend Neo Langston, was arrested for failing to appear in court. While no charges have been filed against the musician, authori…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/streamer-turned-singer-d4vd-under-investigation-for-murder-as-celeste-rivas-hernandez-case-unfolds/articleshow/127425681.cms",
    "timestamp": "2026-01-24T20:22:44Z"
  },
  {
    "title": "Trump teases next blue state he will target with 'worse' fraud allegations than Minnesota",
    "description": "Donald Trump clued supporters in on the next blue state he will target with \"massive\" fraud allegations, as Minnesota has faced similar claims from the federal government.The president took to Truth Social on Saturday, as Minnesota is under protest stemming f…",
    "link": "https://www.rawstory.com/trump-california-2675022165/",
    "timestamp": "2026-01-24T20:20:37Z"
  },
  {
    "title": "President Trump Goes Scorched Earth on Minnesota Democrats After Federal Agent Fatally Shoots Armed Man in Minneapolis",
    "description": "President Trump on Saturday went scorched earth on Minnesota Democrats after a federal agent fatally shot an armed man in Minneapolis.\nThe post President Trump Goes Scorched Earth on Minnesota Democrats After Federal Agent Fatally Shoots Armed Man in Minneapo…",
    "link": "https://www.thegatewaypundit.com/2026/01/trump-reacts-fatal-shooting-minneapolis/",
    "timestamp": "2026-01-24T20:20:00Z"
  },
  {
    "title": "Women shortchanged in Bengaluru civic polls: Draft reservation list misses 50% mark",
    "description": "Bengaluru: The draft ward reservation matrix released for the upcoming elections to Bengaluru's newly carved city corporations reveals a possible shor.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/women-shortchanged-in-bengaluru-civic-polls-draft-reservation-list-misses-50-mark/articleshow/127418058.cms",
    "timestamp": "2026-01-24T20:19:00Z"
  },
  {
    "title": "Bengaluru cop held in Pocso case after Freedom Park complaint",
    "description": "Bengaluru: A 30-year-old police constable was arrested for allegedly inappropriately touching a 16-year-old student at Freedom Park Friday evening.The.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-cop-held-in-pocso-case-after-freedom-park-complaint/articleshow/127418045.cms",
    "timestamp": "2026-01-24T20:18:00Z"
  },
  {
    "title": "Trump’s Move to Send US Ships To Mideast Renews Iran Threat",
    "description": "By Courtney McBride, Roxana Tiron and Hadriana Lowenkron Jan 23, 2026 (Bloomberg) –President Donald Trump has dispatched naval assets to the Middle East, prompting fresh speculation that he’ll follow through on...",
    "link": "https://gcaptain.com/trumps-move-to-send-us-ships-to-mideast-renews-iran-threat/",
    "timestamp": "2026-01-24T20:16:43Z"
  },
  {
    "title": "Trump Warns Canada ‘Governor’ His China Chickens Will Come Home To Roost",
    "description": "President Donald Trump threatened Canadian Prime Minister Mark Carney with a 100% tariff if the U.S.'s northern neighbor \"makes a deal with China.\"",
    "link": "https://dailycaller.com/2026/01/24/donald-trump-mark-carney-governor-canada-tariffs-china-truth-social/",
    "timestamp": "2026-01-24T20:16:15Z"
  },
  {
    "title": "World Health Organization says it regrets US decision to withdraw",
    "description": "Jan 24 (Reuters) - The World Health Organization (WHO) said it regrets that the U.S. has officially withdrawn from the U.N. health agency and it hopes Washington returns … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/24/world-health-organization-says-it-regrets-us-decision-to-withdraw",
    "timestamp": "2026-01-24T20:15:43Z"
  },
  {
    "title": "India votes against UN resolution censuring Iran",
    "description": "India voted against a UN Human Rights Council resolution condemning Iran's protest crackdown, extending a fact-finding mission. This move, aligning with China and Pakistan, signals India's commitment to non-interference and its strategic interests, particular…",
    "link": "https://timesofindia.indiatimes.com/india/india-votes-against-un-resolution-censuring-iran/articleshow/127425477.cms",
    "timestamp": "2026-01-24T20:12:49Z"
  },
  {
    "title": "CNN’s Kasie Hunt Calls Out Trump’s Loyalty Demands In Bill Maher Hit On Election Lies: ‘Let’s Be Real’",
    "description": "Kasie Hunt called out the way Trump \"commands loyalty\" from Republicans in a discussion of the 2020 election and the riot Trump's election lies inspired.\nThe post CNN’s Kasie Hunt Calls Out Trump’s Loyalty Demands In Bill Maher Hit On Election Lies: ‘Let’s Be…",
    "link": "https://www.mediaite.com/media/news/cnns-kasie-hunt-calls-out-trumps-loyalty-demands-in-bill-maher-hit-on-election-lies-lets-be-real/",
    "timestamp": "2026-01-24T20:12:15Z"
  },
  {
    "title": "Supreme Court judge slams collegium for transfer on government nudge",
    "description": "Supreme Court Justice Ujjal Bhuyan voiced strong dissent over the collegium's decision to transfer Justice Atul Sreedharan, citing executive influence. He argued that such transfers, especially when prompted by the central government, compromise judicial inde…",
    "link": "https://timesofindia.indiatimes.com/india/supreme-court-judge-slams-collegium-for-transfer-on-govt-nudge/articleshow/127424979.cms",
    "timestamp": "2026-01-24T20:10:50Z"
  },
  {
    "title": "Week 53",
    "description": "ICE, or it’s looking more like CBP, murdered another Minnesotan this morning, this time a nurse named Alex Pretti. They are lying about it, of course. The available videos, which are said to be extremely disturbing, show that the man was complying with the go…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/week-53",
    "timestamp": "2026-01-24T20:01:11Z"
  },
  {
    "title": "Border Patrol Chief: Shooting Victim Wanted to Cause ‘Maximum Damage’ and ‘Massacre’ Agents With Handgun",
    "description": "Border Patrol Chief Greg Bovino said the man who was shot and killed by a Border Patrol agent interrupted a targeted operation and wanted to \"massacre\" agents\nThe post Border Patrol Chief: Shooting Victim Wanted to Cause ‘Maximum Damage’ and ‘Massacre’ Agents…",
    "link": "https://www.mediaite.com/media/news/border-patrol-chief-shooting-victim-wanted-to-cause-maximum-damage-and-massacre-agents-with-handgun/",
    "timestamp": "2026-01-24T20:00:37Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-24-01-26-6937455-Jan2026/",
    "timestamp": "2026-01-24T20:00:06Z"
  },
  {
    "title": "In Real Life, There’s No New ‘CBS Newsmax’ Under Bari Weiss",
    "description": "The leftists on social media have hilariously caricatured CBS News under new Editor-in-Chief Bari Weiss as “CBS Newsmax,” like it’s lurched dramatically to the right.... Read More\nThe post In Real Life, There’s No New ‘CBS Newsmax’ Under Bari Weiss appeared f…",
    "link": "https://www.dailysignal.com/2026/01/24/in-real-life-theres-no-new-cbs-newsmax-under-bari-weiss/",
    "timestamp": "2026-01-24T20:00:00Z"
  },
  {
    "title": "Rep. Ilhan Omar Calls Minneapolis Shooting 'An Execution'",
    "description": "Rep. Ilhan Omar, D-Minn., said Saturday that immigration enforcement \"killed another Minnesota resident,\" calling it \"an execution\" and demanding Immigration and Customs Enforcement and Customs and Border Protection immediately leave the state. Her comments f…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363775/posts",
    "timestamp": "2026-01-24T19:58:24Z"
  },
  {
    "title": "‘I’m Trying To Breathe!’ CNN Cuts Away From Struggling Sara Sidner As Trump Feds Tear Gas Protesters",
    "description": "CNN's Fredricka Whitfield has to cut away from colleague Sara Sidner as she struggled to breathe as she was hit with tear gas in Minneapolis.\nThe post ‘I’m Trying To Breathe!’ CNN Cuts Away From Struggling Sara Sidner As Trump Feds Tear Gas Protesters first a…",
    "link": "https://www.mediaite.com/media/tv/im-trying-to-breathe-cnn-cuts-away-from-struggling-sara-sidner-as-trump-feds-tear-gas-protesters/",
    "timestamp": "2026-01-24T19:56:57Z"
  },
  {
    "title": "Donald Trump Reacts To Fatal Minneapolis Shooting (Peter Aitken/Newsweek)",
    "description": "Peter Aitken / Newsweek:\nDonald Trump Reacts To Fatal Minneapolis Shooting  —  President Donald Trump took to Truth Social on Saturday afternoon to respond to the reports of a fatal shooting in Minneapolis involving federal agents and a 37-year-old man.  —  I…",
    "link": "https://www.memeorandum.com/260124/p55",
    "timestamp": "2026-01-24T19:55:00Z"
  },
  {
    "title": "Donald Trump walks back comments about UK soldiers in Afghanistan - The Guardian",
    "description": "Donald Trump walks back comments about UK soldiers in AfghanistanThe Guardian Seaham veteran demands 'massive apology' from TrumpBBC Starmer Denounces Trump’s ‘Appalling’ Remarks About NATO Troops in AfghanistanTime Magazine U.K., including Prince Harry, voic…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180650788",
    "timestamp": "2026-01-24T19:52:59Z"
  },
  {
    "title": "US immigration agents shoot dead another person in Minneapolis",
    "description": "Federal immigration agents shot dead a man in Minneapolis on Saturday, in the second fatal shooting of a civilian during the Trump administration’s controversial operation in the city, sparking fresh protests and outrage from state officials. The death came l…",
    "link": "https://www.digitaljournal.com/world/us-immigration-agents-shoot-dead-another-person-in-minneapolis/article",
    "timestamp": "2026-01-24T19:52:20Z"
  },
  {
    "title": "Snow, ice hit western, central US as massive storm sweeps nation",
    "description": "Winter storm Fern threatens tens of millions of Americans with blackouts, transportation chaos and bone-chilling cold.",
    "link": "https://www.channelnewsasia.com/world/snow-storm-us-fern-flights-new-york-cold-5881081",
    "timestamp": "2026-01-24T19:50:00Z"
  },
  {
    "title": "Protestor Watches Federal Officers Pin Down Her Husband: 'We Were Just Running Away From The Gas'",
    "description": "“I'm a United States citizen! You're gonna kill me! Is that what you want?\" the man being pinned down by immigration officers can be heard saying on video.",
    "link": "https://www.huffpost.com/entry/minneapolis-protest-distrissed-running-away-from-the-gas_n_6975117ce4b068aff7af24bf",
    "timestamp": "2026-01-24T19:48:55Z"
  },
  {
    "title": "Trump praises UK troops as brave warriors after widespread condemnation (Michael Holden/Reuters)",
    "description": "Michael Holden / Reuters:\nTrump praises UK troops as brave warriors after widespread condemnation  —  U.S. President Donald Trump on Saturday praised “brave” British soldiers, calling them warriors, a day after remarks he made about NATO troops in Afghanistan…",
    "link": "https://www.memeorandum.com/260124/p53",
    "timestamp": "2026-01-24T19:45:00Z"
  },
  {
    "title": "The Rio Grande Has Transformed From Environmental Haven to Militarized Border",
    "description": "Dozens of environmental, wildlife, and public access regulations have been waived to make way for a border wall.",
    "link": "https://capitalandmain.com/the-rio-grande-was-once-an-inviting-river-its-now-a-militarized-border",
    "timestamp": "2026-01-24T19:43:09Z"
  },
  {
    "title": "US Warship Visit to Cambodia Base Shows Continued Warming Ties",
    "description": "By Philip J. Heijmans Jan 24, 2026 (Bloomberg) –A US warship docked at Cambodia’s Ream Naval Base on Saturday for a five-day visit, signaling a continued thaw in military relations after...",
    "link": "https://gcaptain.com/us-warship-visit-to-cambodia-base-shows-continued-warming-ties/",
    "timestamp": "2026-01-24T19:41:24Z"
  },
  {
    "title": "Trump cites armed suspect, lack of police support following fatal Border Patrol shooting in Minneapolis",
    "description": "President Donald Trump reacted on Truth Social after a Border Patrol agent fatally shot an armed U.S. citizen in Minneapolis, blaming local leaders for failing to support federal agents.",
    "link": "https://www.foxnews.com/politics/trump-cites-armed-suspect-lack-police-support-following-fatal-border-patrol-shooting-minneapolis",
    "timestamp": "2026-01-24T19:40:15Z"
  },
  {
    "title": "Germany considers boycotting 2026 World Cup over Trump’s actions",
    "description": "A German FA official calls for serious discussion about a 2026 World Cup boycott, citing political tensions following actions by Donald Trump.\n\nRead More: https://punchng.com/germany-considers-boycotting-2026-world-cup-over-trumps-actions/",
    "link": "https://punchng.com/germany-considers-boycotting-2026-world-cup-over-trumps-actions/",
    "timestamp": "2026-01-24T19:39:56Z"
  },
  {
    "title": "Murdered man identified",
    "description": "We now know a few things about the man killed by federal agents. The man fatally shot by federal officers in Minneapolis this morning has been identified as Alex Jeffrey Pretti, according to sources familiar with the investigation. Pretti, 37, has an address …",
    "link": "https://freethoughtblogs.com/pharyngula/2026/01/24/murdered-man-identified/",
    "timestamp": "2026-01-24T19:30:49Z"
  },
  {
    "title": "Minneapolis Man Curses Out ICE Agents After Fatal Shooting: 'I'm F**king Angry!'",
    "description": "A 37-year-old man authorities believe was a U.S. citizen was shot multiple times Saturday morning by federal agents, killing him.",
    "link": "https://www.huffpost.com/entry/minnesota-man-curses-out-ice-agents-at-scene-of-fatal-shooting-tktktk-fuck-you-tktkt_n_697506d2e4b0dcc40307a358",
    "timestamp": "2026-01-24T19:30:29Z"
  },
  {
    "title": "Donald Trump Unveils Classified 'Discombobulator' Weapon, Claims It Crippled Maduro’s Army and Left Russian and Chinese Rockets Dead in Their Silos",
    "description": "Donald Trump revealed details of a secret weapon he calls the 'Discombobulator,' claiming it was used to capture Nicolás Maduro.",
    "link": "https://radaronline.com/p/donald-trump-unveils-classified-discombobulator-weapon-crippled-maduro-army/",
    "timestamp": "2026-01-24T19:30:00Z"
  },
  {
    "title": "Fox News Reporter: Tear Gas Has Been ‘Completely Ineffective’ Against Protesters — Only Causing ‘More Turmoil’ in Chaotic Minneapolis Streets",
    "description": "Fox News reporter Steve Harrigan reported the tear gas used by federal officers has been \"completely ineffective\" and only led to \"more turmoil.\"\nThe post Fox News Reporter: Tear Gas Has Been ‘Completely Ineffective’ Against Protesters — Only Causing ‘More Tu…",
    "link": "https://www.mediaite.com/politics/fox-news-reporter-tear-gas-has-been-completely-ineffective-against-protesters-only-causing-more-turmoil-in-chaotic-minneapolis-streets/",
    "timestamp": "2026-01-24T19:27:13Z"
  },
  {
    "title": "Keith Olbermann, Alexandria Ocasio-Cortez and More Call for Tim Walz Response to ICE Shootings: ‘Activate the National Guard’",
    "description": "Senate Democrats should \"activate the National Guard\" in response to a second shooting of an American citizen by ICE agents in Minneapolis, Sen. Alexandria Ocasio-Cortez wrote on social media Saturday. AOC was one of dozens of political voices who called for …",
    "link": "https://www.thewrap.com/media-platforms/politics/tim-walz-respond-ice-shootings-activate-national-guard-keith-olbermann-aoc/",
    "timestamp": "2026-01-24T19:26:48Z"
  },
  {
    "title": "Ticker: Toyota recalls 162,000 trucks over faulty screens",
    "description": "Toyota announced it would recall about 162,000 Tundra pickup trucks in the U.S. due to concerns over the vehicles' multimedia displays. Plus: Trump housing finance chief OKs more mortgage spending",
    "link": "https://www.bostonherald.com/2026/01/24/ticker-toyota-recalls-162000-trucks-over-faulty-screens/",
    "timestamp": "2026-01-24T19:24:03Z"
  },
  {
    "title": "Meidas: Trump's Forces Kill Again!",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump’s border patrol forces killing another person in Minnesota as all hell breaks loose and Trump continues to escalate his invasion of American cities and towns.",
    "link": "https://littlegreenfootballs.com/article/55233_Meidas-_Trumps_Forces_Kill_Aga",
    "timestamp": "2026-01-24T19:23:49Z"
  },
  {
    "title": "Man shot dead by US federal agents in Minneapolis; officials appeal for calm amid unrest",
    "description": "US federal immigration officers shot and killed a man in Minneapolis on Saturday, drawing hundreds of protesters to the streets in a city already shaken by another fatal shooting weeks earlier.",
    "link": "https://www.independent.ie/world-news/north-america/man-shot-dead-by-us-federal-agents-in-minneapolis-officials-appeal-for-calm-amid-unrest/a1886120098.html",
    "timestamp": "2026-01-24T19:23:00Z"
  },
  {
    "title": "Coinbase CEO says Big banks now view crypto as an ‘existential’ threat to their business",
    "description": "Brian Armstrong returns from World Economic Forum with message: traditional finance is taking crypto seriously",
    "link": "https://www.coindesk.com/business/2026/01/24/coinbase-ceo-says-big-banks-now-view-crypto-as-an-existential-threat-to-their-business",
    "timestamp": "2026-01-24T19:22:36Z"
  },
  {
    "title": "Minneapolis Mayor’s Ultimatum to Trump, 'End This Operation, Safety Will Be Restored'",
    "description": "Minneapolis Mayor Jacob Frey rushed to a news conference on Saturday within hours of a man being shot and killed by a Border Patrol agent on the city’s south side. The mayor said little to calm Minneapolis residents but did propose an ultimatum to President D…",
    "link": "https://www.breitbart.com/border/2026/01/24/minneapolis-mayors-ultimatum-to-trump-end-this-operation-safety-will-be-restored/",
    "timestamp": "2026-01-24T19:22:19Z"
  },
  {
    "title": "Trump accuses Minnesota officials of ‘inciting insurrection’ in wake of deadly shooting",
    "description": "President Donald Trump unloaded on Minnesota elected officials Saturday in the wake of the fatal federal immigration officer shooting\r\n earlier that morning, going as far as to accuse state leadership of “inciting insurrection.”A 37-year-old Minneapolis resid…",
    "link": "https://www.rawstory.com/msn/shooting/",
    "timestamp": "2026-01-24T19:21:22Z"
  },
  {
    "title": "Trump backed down from NATO tariffs over Greenland but may cross a ‘red line’ on U.S. military bases there",
    "description": "“Yeah,” Trump told the New York Post. “We’ll have everything we want. We have some interesting talks going on.”",
    "link": "https://fortune.com/2026/01/24/trump-nato-tariffs-greenland-sovereignty-red-line-denmark-us-military-bases/",
    "timestamp": "2026-01-24T19:20:20Z"
  },
  {
    "title": "JUST IN: Trump Blames Democrats After Second ICE Shooting in Minneapolis",
    "description": "Trump blamed Democrats and local leaders in his first comments after the second ICE shooting, accusing them of blocking police, enabling crime, fueling unrest.\nThe post JUST IN: Trump Blames Democrats After Second ICE Shooting in Minneapolis first appeared on…",
    "link": "https://www.mediaite.com/politics/trump/just-in-trump-blames-democrats-after-second-ice-shooting-in-minneapolis/",
    "timestamp": "2026-01-24T19:19:26Z"
  },
  {
    "title": "Federal Immigration Agents Shoot and Kill Another Person in Minneapolis",
    "description": "Video taken by bystanders shows agents wrestling the man to the ground and beating him before firing multiple shots.",
    "link": "https://minnesotareformer.com/2026/01/24/another-minnesotan-shot-and-killed-by-feds/",
    "timestamp": "2026-01-24T19:17:09Z"
  },
  {
    "title": "Trump briefed on Border Patrol-involved shooting as Minneapolis mayor demands end to enforcement operation",
    "description": "A White House official told Fox News Digital that President Donald Trump has been briefed on the Border Patrol-involved shooting in Minneapolis.",
    "link": "https://www.foxnews.com/us/trump-briefed-border-patrol-involved-shooting-minneapolis-mayor-demands-end-enforcement-operation",
    "timestamp": "2026-01-24T19:16:41Z"
  },
  {
    "title": "Trump briefed on Border Patrol-involved shooting as Minneapolis mayor demands end to enforcement operation",
    "description": "A White House official told Fox News Digital that President Donald Trump has been briefed on the Border Patrol-involved shooting in Minneapolis.",
    "link": "https://www.foxnews.com/politics/trump-briefed-border-patrol-involved-shooting-minneapolis-mayor-demands-end-enforcement-operation",
    "timestamp": "2026-01-24T19:16:41Z"
  },
  {
    "title": "Pritzker urges 'unified response' from Democrat, Republican governors after Border Patrol shoots armed man",
    "description": "Illinois Gov. JB Pritzker and New York Gov. Kathy Hochul slammed thee Trump administration after Border Patrol shot an armed man in Minneapolis.",
    "link": "https://www.foxnews.com/politics/pritzker-urges-unified-response-democrat-republican-governors-border-patrol-shoots-armed-man",
    "timestamp": "2026-01-24T19:16:41Z"
  },
  {
    "title": "Identity of Man Shot and Killed By Federal Agents in Shocking Video Revealed",
    "description": "The 37-year-old man shot and killed by federal agents on Saturday morning was identified as Alex Jeffrey Pretti, according to the Minnesota Star Tribune.\nThe post Identity of Man Shot and Killed By Federal Agents in Shocking Video Revealed first appeared on M…",
    "link": "https://www.mediaite.com/media/news/identity-of-man-shot-and-killed-by-federal-agents-in-shocking-video-revealed/",
    "timestamp": "2026-01-24T19:14:49Z"
  },
  {
    "title": "JUST IN: Identity of Man Shot and Killed By Federal Agents in Shocking Video Revealed",
    "description": "The 37-year-old man shot and killed by federal agents on Saturday morning was identified as Alex Jeffrey Pretti, according to the Minnesota Star Tribune.\nThe post JUST IN: Identity of Man Shot and Killed By Federal Agents in Shocking Video Revealed first appe…",
    "link": "https://www.mediaite.com/media/news/just-in-identity-of-man-shot-and-killed-by-federal-agents-in-shocking-video-revealed/",
    "timestamp": "2026-01-24T19:14:49Z"
  },
  {
    "title": "Finance chiefs at Davos: World order is changing, not rupturing",
    "description": "DAVOS: The world order is changing but not enduring a rupture, finance leaders said on Friday, pushing back on Canadian Prime Minister Mark Carney’s narrativ...",
    "link": "https://kuwaittimes.com/article/38876/business/finance-chiefs-at-davos-world-order-is-changing-not-rupturing/",
    "timestamp": "2026-01-24T19:11:35Z"
  },
  {
    "title": "Report Says the E.U. Is Gearing Up to Weaponize Europe’s Tech Industry Against the U.S.",
    "description": "Don't worry. No one is threatening to take away your access to Sweden-based Spotify.",
    "link": "https://gizmodo.com/report-says-the-e-u-is-gearing-up-to-weaponize-europes-tech-industry-against-the-u-s-2000712327",
    "timestamp": "2026-01-24T19:10:37Z"
  },
  {
    "title": "Trump threatens Canada with a 100% tariff over its China trade deal",
    "description": "President Trump said in a social media post that if PM Mark Carney “thinks he is going to make Canada a ‘Drop Off Port’ for China to send goods and products into the United States, he is sorely mistaken.”",
    "link": "https://www.bostonherald.com/2026/01/24/trump-threatens-canada-with-a-100-tariff-over-its-china-trade-deal/",
    "timestamp": "2026-01-24T19:09:49Z"
  },
  {
    "title": "Police chief calls for calm after a man is shot and killed during Minneapolis immigration crackdown",
    "description": "Police chief calls for calm after a man is shot and killed during Minneapolis immigration crackdownlocal10.com",
    "link": "https://www.local10.com//news/2026/01/24/man-is-shot-and-killed-during-minneapolis-immigration-crackdown-national-guard-activated/",
    "timestamp": "2026-01-24T19:07:43Z"
  },
  {
    "title": "Minneapolis Mayor Calls on Trump to End ICE Raids After 2nd Shooting: ‘How Many More Americans Need to Die?’ | Video",
    "description": "Jacob Frey calls on the country to \"stand with Minneapolis\" and to \"stand up for America\" \nThe post Minneapolis Mayor Calls on Trump to End ICE Raids After 2nd Shooting: ‘How Many More Americans Need to Die?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/minneapolis-mayor-jacob-frey-trump-end-ice-raids-shooting/",
    "timestamp": "2026-01-24T19:03:17Z"
  },
  {
    "title": "Don Lemon’s Former CNN Colleague Wonders Whether He Should Be Considered A Journalist",
    "description": "Chris Cillizza, a former CNN editor-at-large, is publicly questioning whether his ex-colleague Don Lemon deserves to be called a journalist.",
    "link": "https://dailycaller.com/2026/01/24/cillizza-don-lemon-journalist-minnesota-church-doj-bondi-cnn/",
    "timestamp": "2026-01-24T19:02:57Z"
  },
  {
    "title": "Iranian Regime Threatens “All-Out” War as U.S. Carrier Strike Group Nears Persian Gulf",
    "description": "Iran's IRGC chief boasts he has \"finger on the trigger\" amid U.S. naval buildup.\nThe post Iranian Regime Threatens “All-Out” War as U.S. Carrier Strike Group Nears Persian Gulf first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/iranian-regime-threatens-all-out-war-as-u-s-carrier-strike-group-nears-persian-gulf/",
    "timestamp": "2026-01-24T19:00:33Z"
  },
  {
    "title": "Bureaucrats’ Political Donations Hint Census Bureau Overcounting for Democrats May Not Be Coincidental",
    "description": "Undercounting the population in red states like Texas and Florida in 2020 cost Republicans at least six seats in the House of Representatives, while overcounting... Read More\nThe post Bureaucrats’ Political Donations Hint Census Bureau Overcounting for Democr…",
    "link": "https://www.dailysignal.com/2026/01/24/bureaucrats-political-donations-hint-census-bureau-over-counting-for-democrats-may-not-be-coincidental/",
    "timestamp": "2026-01-24T19:00:00Z"
  },
  {
    "title": "Donald Trump will not attend Super Bowl because it’s ‘too far away’",
    "description": "Donald Trump said he will not attend next month’s Super Bowl in northern California, citing the distance to the game, amid an ongoing culture-war backlash over the NFL’s choice of half-time and pre-game performers. Trump told the New York Post he plans to ski…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b0639314-c2e7-4cc6-9c52-bbc92e3d441a",
    "timestamp": "2026-01-24T18:53:18Z"
  },
  {
    "title": "Cops Say Deportation Force Shooting Victim Was 37-Year-Old White Male — And ‘Lawful Gun Owner’",
    "description": "Minneapolis Police Chief Brian O'Hara said the man shot and killed by Border Patrol agents was a 37-year-old white man who was a \"lawful gun owner\"\nThe post Cops Say Deportation Force Shooting Victim Was 37-Year-Old White Male — And ‘Lawful Gun Owner’ first a…",
    "link": "https://www.mediaite.com/politics/cops-say-deportation-force-shooting-victim-was-37-year-old-white-male-and-lawful-gun-owner/",
    "timestamp": "2026-01-24T18:49:24Z"
  },
  {
    "title": "Donald Trump to Skip Super Bowl, Rips Bad Bunny and Green Day Bookings: “I’m Anti-Them”",
    "description": "\"I'm anti-them. I think it's a terrible choice. All it does is sow hatred. Terrible.\"\nDonald Trump to Skip Super Bowl, Rips Bad Bunny and Green Day Bookings: “I’m Anti-Them”\nAlex Young",
    "link": "https://consequence.net/2026/01/trump-super-bowl-rips-bad-bunny-green-day/",
    "timestamp": "2026-01-24T18:48:57Z"
  },
  {
    "title": "US federal agents shoot and kill another person in Minneapolis",
    "description": "The death occurred less than three weeks after US citizen Renee Good was shot and killed by an Immigration and Customs Enforcement officer involved in a Trump-ordered sweep to round up immigrants.",
    "link": "https://www.channelnewsasia.com/world/us-federal-agents-shoot-and-kill-another-person-in-minneapolis-5881046",
    "timestamp": "2026-01-24T18:45:00Z"
  },
  {
    "title": "Controversial Lane Kiffin Continues Noisy Start At LSU By Deleting Political Post About Donald Trump After Backlash",
    "description": "New LSU Tigers football coach Lane Kiffin, certainly not unfamiliar with controversy, has continued his noisy start to his tenure at the school with an error usually reserved for teenagers and 20-somethings: posting too much online. Over the weekend, Kiffin t…",
    "link": "https://brobible.com/sports/article/lane-kiffin-deleted-trump-tweet-reaction/",
    "timestamp": "2026-01-24T18:44:43Z"
  },
  {
    "title": "Trump Rattles Off Random Unrelated Posts As ICE Battle Rages After New Shooting",
    "description": "President Donald Trump rattled off a series of unrelated posts in the hour after chaos erupted in Minneapolis over a new shooting by Trump deportation forces.\nThe post Trump Rattles Off Random Unrelated Posts As ICE Battle Rages After New Shooting first appea…",
    "link": "https://www.mediaite.com/media/news/trump-rattles-off-random-unrelated-posts-as-ice-battle-rages-after-new-shooting/",
    "timestamp": "2026-01-24T18:43:14Z"
  },
  {
    "title": "Trump claims he has new 'secret weapon' he is not allowed to talk about",
    "description": "Donald Trump has claimed the US has a new 'secret weapon' called 'The Discombobulator' which was used in the capture of Venezuela's President.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-secret-weapon-discombobulator-claims-413321-20260124",
    "timestamp": "2026-01-24T18:41:58Z"
  },
  {
    "title": "Virginia Democrats frustrate law enforcement with bill axing prison time for violent crime, expert warns",
    "description": "A new bill proposed by Democrats in the Virginia state legislature is raising concerns regarding the removal of minimum prison sentences for various violent felony crimes. Within days of Democratic Gov. Abigail Spanberger being sworn in, members of her party …",
    "link": "https://freerepublic.com/focus/f-news/4363767/posts",
    "timestamp": "2026-01-24T18:41:06Z"
  },
  {
    "title": "Can Minnesota prosecute the federal officers who just killed a man?",
    "description": "The video of the latest killing in Minneapolis is truly horrific. In it, about half a dozen men in military garb, who appear to be federal immigration officers sent to Minnesota by President Donald Trump, wrestle a man to the ground and repeatedly strike him.…",
    "link": "https://www.vox.com/policy/476374/minneapolis-second-killing-prosecution-supreme-court",
    "timestamp": "2026-01-24T18:39:00Z"
  },
  {
    "title": "Minneapolis TV Reporter Pepper Sprayed While Covering 2nd Deadly Shooting by ICE Agents | Video",
    "description": "\"I said, 'Do not push me, I'm press,'\" KARE 11 reporter Jana Shortal explains, saying she was behind police lines at the time\nThe post Minneapolis TV Reporter Pepper Sprayed While Covering 2nd Deadly Shooting by ICE Agents | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/minneapolis-tv-reporter-pepper-sprayed-while-covering-2nd-deadly-shooting-by-ice-agents-video/",
    "timestamp": "2026-01-24T18:38:42Z"
  },
  {
    "title": "Donald Trump says he's 'anti' Bad Bunny, explains skipping Super Bowl",
    "description": "Will President Donald Trump attend the Super Bowl this year? He recently said an interview that he will be skipping.",
    "link": "https://www.usatoday.com/story/sports/nfl/super-bowl/2026/01/24/president-trump-attend-super-bowl-2026-bad-bunny/88337191007/",
    "timestamp": "2026-01-24T18:38:32Z"
  },
  {
    "title": "New Video Appears to Contradict DHS Narrative in Minneapolis ICE Shooting",
    "description": "New video of the protester who was killed by ICE agents iappeared to contradict the narrative put out by the Department of Homeland Security.\nThe post New Video Appears to Contradict DHS Narrative in Minneapolis ICE Shooting first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/new-video-appears-to-contradict-dhs-narrative-in-minneapolis-ice-shooting/",
    "timestamp": "2026-01-24T18:38:13Z"
  },
  {
    "title": "Trump hails UK troops after NATO controversy",
    "description": "Donald Trump praises UK soldiers after his remarks discounting NATO troops in Afghanistan sparked a major controversy and backlash from European allies.\n\nRead More: https://punchng.com/trump-hails-uk-troops-after-nato-controversy/",
    "link": "https://punchng.com/trump-hails-uk-troops-after-nato-controversy/",
    "timestamp": "2026-01-24T18:38:07Z"
  },
  {
    "title": "Q & A: Bruce Blakeman vows to thwart Mamdani’s socialist agenda for NYC, rips Hochul for ‘embracing’ it",
    "description": "Nassau County Executive and presumptive Republican gubernatorial nominee Bruce Blakeman said in a wide-ranging interview with The Post that he’s the last line of defense to protect New Yorkers from NYC Mayor Zohran Mamdani’s socialist agenda.",
    "link": "https://nypost.com/2026/01/24/us-news/q-amp-a-bruce-blakeman-vows-to-thwart-mamdanis-socialist-agenda-for-nyc-rips-hochul-for-embracing-it/",
    "timestamp": "2026-01-24T18:36:28Z"
  },
  {
    "title": "GOP senator backs Trump deploying National Guard to quash unrest in wake of shooting",
    "description": "Sen. Shelley Moore Capito (R-WV) voiced her support Saturday for President Donald Trump deploying the National Guard to Minnesota to quash the civil unrest sparked by the latest federal immigration officer-involved shooting\r\n in Minneapolis.At least seven fed…",
    "link": "https://www.rawstory.com/minneapolis-2675022036/",
    "timestamp": "2026-01-24T18:33:33Z"
  },
  {
    "title": "Risky business: Sex workers demand soars in Davos during World Economic Forum",
    "description": "Demand for sex workers in Davos skyrocketed during this year’s World Economic Forum — including one client who allegedly shelled out a whopping $114,000 for four days with five women. The apparent work hard, party harder attitude of the global elite was appar…",
    "link": "https://freerepublic.com/focus/f-news/4363766/posts",
    "timestamp": "2026-01-24T18:32:07Z"
  },
  {
    "title": "People brace themselves for the winter storm moving across the US, in photos",
    "description": "A monster storm is expected to wreak havoc across much of the United States. The storm threatens to knock out power for days and snarl major roadways. Roughly 140 million people were under a winter storm warning from New Mexico to New England.",
    "link": "https://www.the-independent.com/news/world/americas/weather-winter-storm-news-update-us-b2906972.html",
    "timestamp": "2026-01-24T18:29:54Z"
  },
  {
    "title": "After Another ICE Shooting, Minneapolis Mayor Tells Trump: 'Act Like A Leader'",
    "description": "Minneapolis Mayor Jacob Frey urged Trump to \"take action now\" to remove thousands of federal agents from his city following another fatal ICE shooting.",
    "link": "https://www.huffpost.com/entry/minneapolis-ice-shooting-trump_n_69750958e4b0dcc40307a3f7",
    "timestamp": "2026-01-24T18:29:53Z"
  },
  {
    "title": "Stephen King compares ICE to Nazi Germany's Gestapo amid growing celebrity criticism",
    "description": "Author Stephen King and celebrities, including Bruce Springsteen, compared ICE to Nazi Germany's Gestapo following Renee Nicole Good's death in Minneapolis.",
    "link": "https://www.foxnews.com/media/stephen-king-compares-ice-nazi-germanys-gestapo-amid-growing-celebrity-criticism",
    "timestamp": "2026-01-24T18:28:28Z"
  },
  {
    "title": "Trumps statement on NATO troops in Afghanistan. The Brits are not happy.",
    "description": "Donald Trump was \"wrong\" to diminish the role of Nato and British troops in Afghanistan, Downing Street has said, after the US president claimed allies stayed away from the front line.",
    "link": "https://freerepublic.com/focus/f-news/4363763/posts",
    "timestamp": "2026-01-24T18:25:18Z"
  },
  {
    "title": "‘There is no pursuit of a free trade deal with China,’ says LeBlanc in response to Trump",
    "description": "Prime Minister Mark Carney's government is pushing back against U.S. President Donald Trump’s latest threat to impose 100 per cent tariffs.",
    "link": "https://nationalpost.com/news/canada/there-is-no-pursuit-of-a-free-trade-deal-with-china-says-leblanc-in-response-to-trump",
    "timestamp": "2026-01-24T18:25:16Z"
  },
  {
    "title": "Trump says UK soldiers in Afghanistan 'among greatest warriors of all time'",
    "description": "The US president's praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict.",
    "link": "https://www.bbc.com/news/articles/c3edwx37pd9o",
    "timestamp": "2026-01-24T18:19:15Z"
  },
  {
    "title": "Rod Stewart Slams Donald Trump Over NATO Troops Comments",
    "description": "Rod Stewart is slamming Donald Trump after the president claimed NATO troops avoided frontline combat in Afghanistan.",
    "link": "http://www.billboard.com/music/music-news/rod-stewart-donald-trump-nato-troops-afghanistan-comments-1236162083/",
    "timestamp": "2026-01-24T18:18:22Z"
  },
  {
    "title": "Over 11,000 flights canceled as massive winter storm bears down across the U.S.",
    "description": "More than 11,000 flights across the U.S. set to take off over the weekend were canceled as a monster storm started to wreak havoc Saturday across much of the country.",
    "link": "https://www.pbs.org/newshour/nation/over-11000-flights-canceled-as-massive-winter-storm-bears-down-across-the-u-s",
    "timestamp": "2026-01-24T18:17:08Z"
  },
  {
    "title": "Thousands of flights canceled as massive winter storm bears down across the U.S.",
    "description": "Thousands of flights across the U.S. set to take off over the weekend were canceled as a monster storm started to wreak havoc Saturday across much of the country, knocking out power and snarling major roadways with dangerous ice.",
    "link": "https://www.pbs.org/newshour/nation/thousands-of-flights-canceled-as-massive-winter-storm-bears-down-across-the-u-s",
    "timestamp": "2026-01-24T18:17:08Z"
  },
  {
    "title": "Over 10,000 flights canceled as massive winter storm bears down across the U.S.",
    "description": "More than 11,000 flights across the U.S. set to take off over the weekend were canceled as a monster storm started to wreak havoc Saturday across much of the country.",
    "link": "https://www.pbs.org/newshour/nation/over-10000-flights-canceled-as-massive-winter-storm-bears-down-across-the-u-s",
    "timestamp": "2026-01-24T18:17:08Z"
  },
  {
    "title": "Almost 12,000 flights canceled as massive winter storm bears down across the U.S.",
    "description": "Almost 12,000 flights across the U.S. set to take off over the weekend were canceled as a monster storm started to wreak havoc Saturday across much of the country.",
    "link": "https://www.pbs.org/newshour/nation/almost-12000-flights-canceled-as-massive-winter-storm-bears-down-across-the-u-s",
    "timestamp": "2026-01-24T18:17:08Z"
  },
  {
    "title": "Trump Approves Emergency Declarations for South Carolina, Virginia Due to 'Historic Winter Storms'",
    "description": "President Donald Trump has approved emergency declarations for South Carolina and Virginia due to major snow and freezing conditions forecast to rock the eastern half of the United States.\nThe post Trump Approves Emergency Declarations for South Carolina, Vir…",
    "link": "https://www.breitbart.com/weather/2026/01/24/trump-approves-emergency-declarations-for-south-carolina-virginia-due-to-historic-winter-storms/",
    "timestamp": "2026-01-24T18:16:19Z"
  },
  {
    "title": "‘Act Like a Leader’: Minneapolis Mayor Calls on Trump to ‘Achieve Peace’ After New ICE Shooting",
    "description": "Mayor Frey criticized the Trump administration and called for an end to federal immigration enforcement operations in the city after another fatal shooting\nThe post ‘Act Like a Leader’: Minneapolis Mayor Calls on Trump to ‘Achieve Peace’ After New ICE Shootin…",
    "link": "https://www.mediaite.com/media/news/act-like-a-leader-minneapolis-mayor-calls-on-trump-to-achieve-peace-after-new-ice-shooting/",
    "timestamp": "2026-01-24T18:08:27Z"
  },
  {
    "title": "Trump threatens 100% tariff on Canada if it makes a deal with China",
    "description": "Trump threatens 100% tariff on Canada if it makes a deal with Chinago.com",
    "link": "https://abcnews.go.com/US/trump-threatens-100-tariff-canada-makes-deal-china/story?id=129519812",
    "timestamp": "2026-01-24T18:07:49Z"
  },
  {
    "title": "SEC drops lawsuit against Winklevoss twins’ Gemini crypto exchange | TechCrunch",
    "description": "The Securities and Exchange Commission has dropped its lawsuit against Gemini, the crypto exchange founded by Trump backers Cameron and Tyler Winklevoss.",
    "link": "https://techcrunch.com/2026/01/24/sec-drops-lawsuit-against-winklevoss-twins-gemini-crypto-exchange/",
    "timestamp": "2026-01-24T18:07:00Z"
  },
  {
    "title": "Judy Shelton and the Federal Reserve: Gold Standard Revival Debate.",
    "description": "Who Is Judy Shelton and Why Does She Matter? Judy Shelton's Background and Expertise Judy Shelton is an economist with decades of experience in monetary policy, particularly in advocating for sound money systems. Her academic and professional work emphasizes …",
    "link": "https://freerepublic.com/focus/f-chat/4363760/posts",
    "timestamp": "2026-01-24T18:06:38Z"
  },
  {
    "title": "Judy Shelton and the Federal Reserve: Gold Standard Revival Debate.",
    "description": "Who Is Judy Shelton and Why Does She Matter? Judy Shelton's Background and Expertise Judy Shelton is an economist with decades of experience in monetary policy, particularly in advocating for sound money systems. Her academic and professional work emphasizes …",
    "link": "https://freerepublic.com/focus/f-news/4363760/posts",
    "timestamp": "2026-01-24T18:06:38Z"
  },
  {
    "title": "Man shot and killed during Minneapolis immigration crackdown - Boston News, Weather, Sports | WHDH 7News",
    "description": "MINNEAPOLIS (AP) — Federal immigration officers shot and killed a man Saturday in Minneapolis, drawing hundreds of protesters in a city already shaken by another<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/man-shot-and-killed-during-minneapolis-im…",
    "link": "https://whdh.com/news/man-shot-and-killed-during-minneapolis-immigration-crackdown/",
    "timestamp": "2026-01-24T18:06:21Z"
  }
]