[
  {
    "title": "Suspect in Charlie Kirk killing caught, widow vows to carry on fight",
    "description": "The widow of prominent right-wing activist Charlie Kirk pledged Friday to carry on her husband’s work, after US authorities announced his alleged assassin had finally been captured. Investigators had appeared to be making slow progress in the hunt for whoever…",
    "link": "https://www.digitaljournal.com/world/suspect-in-charlie-kirk-killing-caught-widow-vows-to-carry-on-fight/article",
    "timestamp": "2025-09-13T02:37:20Z"
  },
  {
    "title": "Erika Kirk: ‘I’ll Make Turning Point USA the Biggest Thing This Nation Has Ever Seen’",
    "description": "Erika Kirk delivered her first public remarks Friday following the assassination of her husband, Turning Point USA founder Charlie Kirk, speaking from the Phoenix studio where he recorded his radio show and vowing to carry forward his mission.\nThe post Erika …",
    "link": "https://www.breitbart.com/politics/2025/09/12/erika-kirk-ill-make-turning-point-usa-the-biggest-thing-this-nation-has-ever-seen/",
    "timestamp": "2025-09-13T02:36:55Z"
  },
  {
    "title": "Suspect In Charlie Kirk Killing Caught, Widow Vows To Carry On Fight",
    "description": "The widow of prominent right-wing activist Charlie Kirk pledged Friday to carry on her husband's work, after US authorities announced his alleged assassin had finally been captured.",
    "link": "https://www.ibtimes.com.au/suspect-charlie-kirk-killing-caught-widow-vows-carry-fight-1860492",
    "timestamp": "2025-09-13T02:36:20Z"
  },
  {
    "title": "Suspect In Charlie Kirk Killing Caught, Widow Vows To Carry On Fight",
    "description": "The widow of prominent right-wing activist Charlie Kirk pledged Friday to carry on her husband's work, after US authorities announced his alleged assassin had finally been captured.",
    "link": "https://www.ibtimes.com/suspect-charlie-kirk-killing-caught-widow-vows-carry-fight-3783265",
    "timestamp": "2025-09-13T02:36:10Z"
  },
  {
    "title": "Charlie Kirk's widow pays tribute to husband's legacy",
    "description": "In the Kirk's widow's first remarks since the shooting, she vowed to fight on against 'evil-doers'.",
    "link": "https://www.bbc.com/news/articles/cz9je8lxge4o",
    "timestamp": "2025-09-13T02:35:02Z"
  },
  {
    "title": "Trump shelves Chicago crackdown plans for now as advisers warn of legal headaches - CNN",
    "description": "Trump shelves Chicago crackdown plans for now as advisers warn of legal headachesCNN President Donald Trump sending National Guard to Memphis, not Chicago; local leaders reactABC7 Chicago This Week In Photos: Chicagoans Protest ICE, Ronnie Woo Woo Returns To …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179197594",
    "timestamp": "2025-09-13T02:32:52Z"
  },
  {
    "title": "Dowd says MSNBC reacted to a right-wing mob in firing him for Charlie Kirk commentary",
    "description": "Political analyst Matthew Dowd says MSNBC reacted to a right-wing mob this week in firing him for commentary on assassinated conservative activist Charlie Kirk.",
    "link": "https://www.news4jax.com/news/politics/2025/09/12/dowd-says-msnbc-reacted-to-a-right-wing-mob-in-firing-him-for-charlie-kirk-commentary/",
    "timestamp": "2025-09-13T02:30:35Z"
  },
  {
    "title": "Wall Street coasts to the finish of its best week in the last five",
    "description": "NEW YORK: Wall Street coasted to the finish of its best week in the last five on Friday (Sep 12) as US stocks hung near their record levels.The S&P 500 barely budged and edged down by less than 0.1 per cent from the all-time high it set the day before. The Do…",
    "link": "https://www.channelnewsasia.com/business/wall-street-us-federal-reserve-interest-rate-5347601",
    "timestamp": "2025-09-13T02:29:04Z"
  },
  {
    "title": "Vigil service held at LSU for Turning Point USA founder Charlie Kirk",
    "description": "A vigil service honoring conservative activist Charlie Kirk was held Friday night at the LSU Student Union Theater in Baton Rouge. The hourlong event drew students, community members, university leaders and state officials — and it included remarks from U.S.…",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/vigil-charlie-kirk-lsu-mike-johnson-jeff-landry/article_9d98cec9-3dc9-528a-8262-c4fd5f54769f.html",
    "timestamp": "2025-09-13T02:25:00Z"
  },
  {
    "title": "Secretary of Commerce Howard Lutnick says Elon Musk got DOGE 'backward'",
    "description": "Howard Lutnick, who recruited Elon Musk for DOGE, is now criticizing his approach to federal staff cuts.",
    "link": "https://www.businessinsider.com/howard-lutnick-says-elon-musk-got-doge-backward-federal-worker2025-9",
    "timestamp": "2025-09-13T02:24:47Z"
  },
  {
    "title": "Trump Files to Cancel Approval of Maryland Offshore Wind Farm",
    "description": "The Trump administration asked a federal court to cancel the approval of a $6 billion wind project planned off the coast of Maryland as part of a wider effort to halt the development of the offshore clean- energy resource.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-files-to-cancel-approval-of-maryland-offshore-wind-farm",
    "timestamp": "2025-09-13T02:22:20Z"
  },
  {
    "title": "Trump Files to Cancel Approval of Maryland Offshore Wind Farm",
    "description": "The Trump administration asked a federal court to cancel the approval of a $6 billion wind project planned off the coast of Maryland as part of a wider effort to halt the development of the offshore clean- energy resource.",
    "link": "https://www.livemint.com/companies/news/trump-files-to-cancel-approval-of-maryland-offshore-wind-farm-11757730074744.html",
    "timestamp": "2025-09-13T02:21:14Z"
  },
  {
    "title": "Utah Moves to Charge Suspect in Charlie Kirk Murder with Aggravated Murder",
    "description": "WASHINGTON (Sputnik) - The state of Utah is recommending charging Tyler Robinson, the suspect in the murder of political activist Charlie Cook, with aggravated murder and two other charges, according to court documents filed on Friday.",
    "link": "https://sputnikglobe.com/20250913/utah-moves-to-charge-suspect-in-charlie-kirk-murder-with-aggravated-murder-1122775704.html",
    "timestamp": "2025-09-13T02:20:00Z"
  },
  {
    "title": "Aaron Judge hits his 362nd career homer, passing Joe DiMaggio for 4th in New York Yankees history",
    "description": "The 468-foot shot gave New York a 1-0 lead over Boston as the longtime rivals battle for playoff position.",
    "link": "https://www.nbcsports.com/mlb/news/aaron-judge-hits-his-362nd-career-homer-passing-joe-dimaggio-for-4th-in-new-york-yankees-history",
    "timestamp": "2025-09-13T02:17:34Z"
  },
  {
    "title": "Charlie Kirk’s Wife Erika: ‘The Cries of This Widow Will Echo Around the World Like a Battle Cry’",
    "description": "Erika Kirk, the widow of Turning Point USA founder Charlie Kirk, said she will never stop fighting to keep her husband's mission and legacy alive after his assassination at the first stop of his “American Comeback Tour” at Utah Valley University on Wednesday.…",
    "link": "https://www.breitbart.com/politics/2025/09/12/charlie-kirk-wife-erika-cries-widow-will-echo-around-world-like-battle-cry/",
    "timestamp": "2025-09-13T02:11:55Z"
  },
  {
    "title": "Bessent will meet Chinese officials in Spain for trade and TikTok talks",
    "description": "U.S. Treasury Secretary Scott Bessent is traveling to Madrid this weekend for trade talks with Chinese counterparts",
    "link": "https://www.wsbtv.com/news/bessent-will-meet/FSP2QIYO3NCA5PSX75UKWS6M6E/",
    "timestamp": "2025-09-13T02:11:23Z"
  },
  {
    "title": "Daddy’s on a work trip with Jesus: Erika Kirk’s heartbreaking words to her 3-year-old daughter while explaining Charlie’s death",
    "description": "Erika Kirk, wife of slain conservative activist Charlie Kirk, addressed the public following his fatal shooting at Utah Valley University. She recounted telling their daughter about her father's passing and thanked supporters, including Vice President JD Vanc…",
    "link": "https://economictimes.indiatimes.com/news/international/us/daddys-on-a-work-trip-with-jesus-erika-kirks-heartbreaking-words-to-her-3-year-old-daughter-while-explaining-charlies-death/articleshow/123862299.cms",
    "timestamp": "2025-09-13T02:10:25Z"
  },
  {
    "title": "Brittany Mahomes shares cryptic post after Charlie Kirk's death",
    "description": "Brittany Mahomes doesn&apos;t often make headlines for political commentary, but her latest Instagram post has people talking.\n\nOn Thursday night, the Kansas City Current co-owner",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/09/13/68c4d203e2704e83488b45af.html",
    "timestamp": "2025-09-13T02:09:16Z"
  },
  {
    "title": "Missouri passes Trump-backed redistricting plan that may give Republicans another House seat",
    "description": "Missouri approves a Trump-backed redistricting plan aiming to add a GOP House seat.",
    "link": "https://apnews.com/article/missouri-redistricting-trump-republicans-a89de205d535c8a8cd6054ed191b161c",
    "timestamp": "2025-09-13T02:07:47Z"
  },
  {
    "title": "NYT's Maggie Haberman says Steve Bannon is actually 'right' about one major thing",
    "description": "A prominent New York Times reporter said President Donald Trump seems to be struggling with the killing of MAGA ally Charlie Kirk, and acknowledged that fellow ally Steve Bannon was right about one big thing.Maggie Haberman joined CNN anchor Kaitlan Collins o…",
    "link": "https://www.rawstory.com/maggie-haberman-2673990793/",
    "timestamp": "2025-09-13T02:07:04Z"
  },
  {
    "title": "Lisa Cook's bank documents appear to contradict Trump administration's mortgage fraud allegations",
    "description": "President Donald Trump is seeking to remove Cook, a board member at the Federal Reserve, over claims that she falsified financial forms regarding a secondary home.",
    "link": "https://www.nbcnews.com/politics/trump-administration/lisa-cook-federal-reserve-bank-documents-mortgage-fraud-allegations-rcna230964",
    "timestamp": "2025-09-13T02:06:21Z"
  },
  {
    "title": "Erika King Issues Emotional Statement in Wake of Husband’s Assassination",
    "description": "Reading Time: 4 minutesErika King has broken her silence. This is her first message since husband Charlie Kirk was murdered.\nErika King Issues Emotional Statement in Wake of Husband’s Assassination was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/erika-king-issues-emotional-statement-in-wake-of-husbands-assassination/",
    "timestamp": "2025-09-13T02:03:11Z"
  },
  {
    "title": "Donald Trump Jr. warns political violence is 'not going both ways' as he mourns Charlie Kirk's death",
    "description": "Following Charlie Kirk's assassination, Donald Trump Jr argued that Democrats and liberal media rhetoric about fascism encourages violence against conservative figures.",
    "link": "https://www.foxnews.com/media/donald-trump-jr-warns-political-violence-not-going-both-ways-he-mourns-charlie-kirks-death",
    "timestamp": "2025-09-13T02:00:33Z"
  },
  {
    "title": "'We're Not Going to Take Lectures From You': Marlow Calls Out CBS Host for Telling Republicans to Calm Down",
    "description": "On Thursday’s “Alex Marlow Show,” host and Breitbart News Editor-in-Chief Alex Marlow reacted to CBS’s Nate Burleson asking about GOP rhetoric in the wake of the Charlie Kirk assassination. Marlow stated that Charlie Kirk just wanted to debate people and\nThe …",
    "link": "https://www.breitbart.com/clips/2025/09/12/were-not-going-to-take-lectures-from-you-marlow-calls-out-cbs-host-for-telling-republicans-to-calm-down/",
    "timestamp": "2025-09-13T02:00:22Z"
  },
  {
    "title": "Zahid F Sarder Saddi Condemns Charlie Kirk’s Killing, Calls for End to Political Violence",
    "description": "WASHINGTON, Sept.  12, 2025  (GLOBE NEWSWIRE) -- Tributes poured in across the United States and abroad following the killing of conservative...",
    "link": "https://www.globenewswire.com/news-release/2025/09/13/3149483/0/en/Zahid-F-Sarder-Saddi-Condemns-Charlie-Kirk-s-Killing-Calls-for-End-to-Political-Violence.html",
    "timestamp": "2025-09-13T01:57:00Z"
  },
  {
    "title": "After Kirk assassination, political left social media posts list 'next' targets",
    "description": "(The Center Square) – In the wake of the assassination of Turning Point USA founder Charlie Kirk, thousands of social media posts appear to list politically conservative targets for assassination by the political left. Those on the list include podcaster Joe …",
    "link": "https://freerepublic.com/focus/f-news/4340124/posts",
    "timestamp": "2025-09-13T01:54:37Z"
  },
  {
    "title": "Iowa Official Defies Orders to Lower Flags to Half-Staff in Honor of Charlie Kirk",
    "description": "An Iowa official defied orders from Gov. Kim Reynolds (R) to lower flags in the state to half-staff in honor of Turning Point USA founder Charlie Kirk, who was assassinated on Wednesday.\nThe post Iowa Official Defies Orders to Lower Flags to Half-Staff in Hon…",
    "link": "https://www.breitbart.com/politics/2025/09/12/iowa-official-defies-orders-lower-flags-half-staff-honor-charlie-kirk/",
    "timestamp": "2025-09-13T01:54:13Z"
  },
  {
    "title": "Charlie Kirk’s hobbies, his favourite sports teams, his top priority and his beliefs- Here’s everything Charlie Kirk's widow revealed about him",
    "description": "Erika Kirk, wife of the late right-wing activist Charlie Kirk, spoke at a Utah event. She remembered Charlie as a loving family man and patriot. Erika shared personal memories of their life together. She thanked supporters, including Donald Trump. Erika also …",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirks-hobbies-his-favourite-sports-teams-his-top-priority-and-his-beliefs-heres-everything-charlie-kirks-widow-revealed-about-him/articleshow/123862009.cms",
    "timestamp": "2025-09-13T01:53:28Z"
  },
  {
    "title": "‘You Have No Idea What You Have Unleashed’: Erika Kirk Addresses Supporters For First Time Since Kirk’s Assassination",
    "description": "The widow of Charlie Kirk, Erika Kirk, addressed supporters for the first time, stating that the movement will \"never surrender.\"",
    "link": "https://dailycaller.com/2025/09/12/erika-kirk-addresses-nation-charlie-kirk-assassination/",
    "timestamp": "2025-09-13T01:52:17Z"
  },
  {
    "title": "UC Berkeley shares information on dozens of students, staff with Trump administration",
    "description": "The University of California, Berkeley has provided information on 160 faculty members and students to President Donald Trump's administration as part of a federal investigation into alleged antisemitic incidents, amid a broader crackdown against educational …",
    "link": "https://japantoday.com/category/world/uc-berkeley-shares-information-on-dozens-of-students-staff-with-trump-administration",
    "timestamp": "2025-09-13T01:48:36Z"
  },
  {
    "title": "After Tyler Robinson, the left must finally quit encouraging political violence",
    "description": "From all early signs, Tyler Robinson's \"reasons\" for taking Charlie Kirk's life came straight from the lefty disinformation machine that has been screaming about right-wing fascism for at least half the confessed assassin's life.",
    "link": "https://nypost.com/2025/09/12/opinion/after-tyler-robinson-the-left-must-finally-quit-encouraging-political-violence/",
    "timestamp": "2025-09-13T01:45:20Z"
  },
  {
    "title": "Charlie Kirk's widow vows husband's mission will continue",
    "description": "The wife of slain prominent conservative activist Charlie Kirk on Friday said her husband was a good man who wanted to be remembered for his courage and faith, vowing that his movement will continue",
    "link": "https://www.nbcnews.com/news/us-news/charlie-kirks-widow-vows-husbands-mission-will-continue-rcna230951",
    "timestamp": "2025-09-13T01:41:30Z"
  },
  {
    "title": "Democratic donors reluctant to give to Biden's presidential library: report",
    "description": "Former President Joe Biden's new effort to raise money for a presidential library is struggling to attract Democrat donors, according to a report.",
    "link": "https://www.foxnews.com/politics/democratic-donors-reluctant-give-bidens-presidential-library-report",
    "timestamp": "2025-09-13T01:40:57Z"
  },
  {
    "title": "Russia cautions Poland against drone ‘hysteria’",
    "description": "Russia’s envoy to the UN, Vassily Nebenzia, has dismissed accusations that Moscow intentionally violated Polish airspace earlier this week Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624593-russia-un-poland-drones/",
    "timestamp": "2025-09-13T01:40:24Z"
  },
  {
    "title": "Aaron Judge passes Joe DiMaggio on Yankees all-time home run list, after meeting with Trump",
    "description": "New York Yankees captain Aaron Judge has hit three home runs in the two games since shaking hands with President Donald Trump. And Judge's latest homer was a historic one. Judge passed franchise icon Joe DiMaggio to leap into fourth place on the Yankees' all-…",
    "link": "https://freerepublic.com/focus/f-chat/4340121/posts",
    "timestamp": "2025-09-13T01:38:57Z"
  },
  {
    "title": "UK turns to British royals, once heads of the largest empire, to soothe Trump, the most powerful person in the world",
    "description": "Donald Trump will visit Britain next week. The British royals will use their influence during the visit. They aim to positively influence the US President. King Charles had offered Trump a second state visit. Prince William and Kate will greet Trump. There wi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/uk-turns-to-british-royals-once-heads-of-the-largest-empire-to-mollify-trump-the-most-powerful-person-in-the-world/articleshow/123862187.cms",
    "timestamp": "2025-09-13T01:37:14Z"
  },
  {
    "title": "Arizona Republican under investigation for excessive donations",
    "description": "After numerous counties turned down the case over the past few weeks, Coconino County has finally agreed to investigate allegations that Republican candidate for Attorney General Rodney Glassman violated campaign finance law.Glassman, a perennial candidate fo…",
    "link": "https://www.rawstory.com/arizona-republican-under-investigation-for-excessive-donations/",
    "timestamp": "2025-09-13T01:37:02Z"
  },
  {
    "title": "Judge belts 362nd homer to pass DiMaggio on Yankees list",
    "description": "New York slugger Aaron Judge belted his 362nd career home run in he first inning of a game in Boston Friday to surpass Yankees legend Joe DiMaggio on the franchise's all-time list.\"Just two legends, greats of the game, great all-time Yankees,” Judge said afte…",
    "link": "https://sports.yahoo.com/article/judge-belts-362nd-homer-pass-013604575.html",
    "timestamp": "2025-09-13T01:36:04Z"
  },
  {
    "title": "South Korea after the Hyundai raid: Those were going to be some nice factories we aren't building anymore [Fail]",
    "description": "South Korea after the Hyundai raid: Those were going to be some nice factories we aren't building anymore",
    "link": "https://www.fark.com/comments/13809936/South-Korea-after-Hyundai-raid-Those-were-going-to-be-some-nice-factories-we-arent-building-anymore",
    "timestamp": "2025-09-13T01:35:03Z"
  },
  {
    "title": "Belarus: Freed prisoners were forcibly deported — opposition",
    "description": "Dozens of political prisoners in Belarus were released after a deal between Minsk and Washington. Belarus' opposition says the move amounts to \"forced deportation.\"",
    "link": "https://www.dw.com/en/belarus-freed-prisoners-were-forcibly-deported-opposition/a-73982327",
    "timestamp": "2025-09-13T01:34:00Z"
  },
  {
    "title": "In America, Kirk's supporters still love guns, despite his violent death",
    "description": "\"The fact that he's dead doesn't make me afraid of guns. It makes me afraid of people,\" one supporter said.",
    "link": "https://www.japantimes.co.jp/news/2025/09/13/world/kirk-supporters-guns/",
    "timestamp": "2025-09-13T01:34:00Z"
  },
  {
    "title": "Trump says he'll send National Guard to Memphis, escalating his use of troops in US cities",
    "description": "President Trump announced he would deploy the National Guard to Memphis to address crime concerns, despite recent data showing crime decreases. While the governor supports the move, the mayor expressed reservations, preferring federal assistance focused on ad…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-hell-send-national-guard-to-memphis-escalating-his-use-of-troops-in-us-cities/articleshow/123862176.cms",
    "timestamp": "2025-09-13T01:33:54Z"
  },
  {
    "title": "Erika Kirk Responds to Husband’s Assassination: ‘You Have No Idea the Fire You Have Ignited’",
    "description": "Erika Kirk, the widow of the slain conservative activist Charlie Kirk, vowed in a primetime address Friday that her husband’s mission will only grow stronger. ... Read More\nThe post Erika Kirk Responds to Husband’s Assassination: ‘You Have No Idea the Fire Yo…",
    "link": "https://www.dailysignal.com/2025/09/12/erika-kirk-responds-to-husbands-assassination-you-have-no-idea-the-fire-you-have-ignited/",
    "timestamp": "2025-09-13T01:31:47Z"
  },
  {
    "title": "Charlie Kirk's Widow, Erika, Speaks for First Time Since Assassination",
    "description": "The deadly shooting this week targeted a high-profile conservative organizer and has sent shock waves throughout the country.",
    "link": "https://www.newsweek.com/charlie-kirks-widow-erika-speaks-first-time-since-assassination-2129283",
    "timestamp": "2025-09-13T01:31:26Z"
  },
  {
    "title": "'No idea what you have unleashed': Charlie Kirk’s wife delivers first public address",
    "description": "A tearful Erika Kirk spoke from her husband’s studio where she vowed that his message would only be amplified by people who tried to silence him.",
    "link": "https://www.usatoday.com/story/news/nation/2025/09/12/charlie-kirks-wife-delivers-first-public-address/86123453007/",
    "timestamp": "2025-09-13T01:30:16Z"
  },
  {
    "title": "Charlie Kirk’s wife, Erika, reiterates his ‘love’ for Chicago Cubs",
    "description": "Charlie Kirk's wife stressed his love for the Chicago Cubs hours after the team honored the conservative activist by flying flags at half-staff and holding a…",
    "link": "https://www.nbcchicago.com/news/local/charlie-kirk-loved-the-chicago-cubs-his-wife-says-as-team-pays-tribute-to-lifelong-fan/3823488/",
    "timestamp": "2025-09-13T01:26:02Z"
  },
  {
    "title": "Charlie Kirk’s wife Erika Kirk speaks publicly for the first time since conservative influencer’s shooting death",
    "description": "Charlie Kirk’s wife Erika Kirk speaks publicly for the first time since conservative influencer’s shooting death7news.com.au",
    "link": "https://7news.com.au/news/charlie-kirks-wife-erika-kirk-speaks-publicly-for-the-first-time-since-his-shooting-death-c-20005863",
    "timestamp": "2025-09-13T01:24:22Z"
  },
  {
    "title": "'Like a military operation': Koreans narrate horror stories of US immigration raid",
    "description": "South Korean workers returned home after being detained in the US. They described a raid at a car battery plant in Georgia. US authorities arrested workers on visa issues. Detainees reported poor conditions. Families expressed relief and anger. Some fear care…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/like-a-military-operation-koreans-narrate-horror-stories-of-us-immigration-raid/articleshow/123862130.cms",
    "timestamp": "2025-09-13T01:22:23Z"
  },
  {
    "title": "Charlie Kirk's devastated wife Erika breaks into tears as she gives passionate tribute to MAGA star and makes defiant promise",
    "description": "Erika Kirk, wife of slain conservative activist Charlie Kirk made her first public address since her husband's assassination on Friday evening and promised to continue the political movement her husband started. Speaking from the same studio that was used by …",
    "link": "https://freerepublic.com/focus/f-chat/4340118/posts",
    "timestamp": "2025-09-13T01:19:51Z"
  },
  {
    "title": "Nancy Mace careens from ‘death penalty’ call to prayers for ‘lost’ Charlie Kirk suspect",
    "description": "Over the course of two days, U.S. Rep. Nancy Mace (R-SC) has taken starkly shifting positions on the alleged assassin of right-wing commentator Charlie Kirk—repeatedly blaming Democrats, calling for the death penalty, then urging prayer for the suspect to fin…",
    "link": "https://www.rawstory.com/nancy-mace-2673990779/",
    "timestamp": "2025-09-13T01:17:09Z"
  },
  {
    "title": "Trump shelves Chicago crackdown plans for now as advisers warn of legal headaches (CNN)",
    "description": "CNN:\nTrump shelves Chicago crackdown plans for now as advisers warn of legal headaches  —  President Donald Trump shelved his plans to target Chicago as the next city for his domestic crime push after advisers warned him that sending in troops to help with lo…",
    "link": "https://www.memeorandum.com/250912/p144",
    "timestamp": "2025-09-13T01:15:05Z"
  },
  {
    "title": "Sergio Gor ticks the right boxes",
    "description": "The US Ambassador-designate to India has raised hopes of a trade deal and a mending of ties",
    "link": "https://www.thehindubusinessline.com/opinion/sergio-gor-ticks-the-right-boxes/article70042956.ece",
    "timestamp": "2025-09-13T01:15:00Z"
  },
  {
    "title": "Targeted abroad and shunned at home: Chinese overseas students caught in limbo | CNN",
    "description": "For Chinese students, a degree from a US university was once considered a “golden ticket” to coveted jobs back home. But many are now finding that geopolitics is blunting their ambitions.",
    "link": "https://www.cnn.com/2025/09/12/china/china-us-students-golden-ticket-hnk-intl",
    "timestamp": "2025-09-13T01:14:32Z"
  },
  {
    "title": "Washington Week with The Atlantic full episode, 9/12/25",
    "description": "The assassination Charlie Kirk, conservative activist and close ally of President Donald Trump, has raised new questions about escalating political violence in the country. Join moderator Jeffrey Goldberg, Peter Baker of The New York Times, Laura Barrón-López…",
    "link": "https://www.pbs.org/weta/washingtonweek/video/2025/09/washington-week-with-the-atlantic-full-episode-91225",
    "timestamp": "2025-09-13T01:14:19Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as 'vacation home,' undercutting Trump fraud claims",
    "description": "Federal Reserve Governor Lisa Cook referred to a condominium she purchased in June 2021 as a “vacation home” in a loan estimate",
    "link": "https://abcnews.go.com/US/wireStory/fed-governor-lisa-cook-claimed-2nd-residence-vacation-125529248",
    "timestamp": "2025-09-13T01:10:28Z"
  },
  {
    "title": "Breitbart Business Digest: Lies, Damned Lies, and Jobs Statistics",
    "description": "Welcome to the inaugural Friday Wrap, our weekly survey of the economy, Wall Street, Silicon Valley, and the bureaucrats who pretend they can read the future by staring at spreadsheets.\nThe post Breitbart Business Digest: Lies, Damned Lies, and Jobs Statistic…",
    "link": "https://www.breitbart.com/economy/2025/09/12/breitbart-business-digest-lies-damned-lies-and-jobs-statistics/",
    "timestamp": "2025-09-13T01:10:24Z"
  },
  {
    "title": "Aaron Judge passes Joe DiMaggio on Yankees all-time home run list, after meeting with Trump",
    "description": "Yankees captain Aaron Judge passed Joe DiMaggio with his 362nd home run after meeting President Trump, who visited the clubhouse before Judge's recent hot streak.",
    "link": "https://www.foxnews.com/sports/aaron-judge-passes-joe-dimaggio-yankees-all-time-home-run-list-after-meeting-trump",
    "timestamp": "2025-09-13T01:10:18Z"
  },
  {
    "title": "Erika Kirk delivers moving tribute to husband, Charlie: 'I will never let your legacy die'",
    "description": "Charlie Kirk's widow, Erika, spoke publicly for the first time since her husband's assassination on Friday evening outside Turning Point USA's headquarters in Phoenix.",
    "link": "https://www.foxnews.com/politics/erika-kirk-breaks-silence-after-husband-charlies-assassination-address-turning-point-usa-headquarters",
    "timestamp": "2025-09-13T01:09:52Z"
  },
  {
    "title": "Charlie Kirk shooting: What we know about murder suspect Tyler Robinson",
    "description": "Family members say the alleged killer was ‘full of hate’ as he became more political.",
    "link": "https://7news.com.au/news/charlie-kirk-shooting-what-we-know-about-murder-suspect-tyler-robinson-c-20005025",
    "timestamp": "2025-09-13T01:08:49Z"
  },
  {
    "title": "House Minority Leader Hakeem Jeffries in western Washington, talking 2026, health care",
    "description": "Hakeem Jeffries is the likely Speaker of the House if he can convince unenthused Democrats and Independents to flip the House next fall.",
    "link": "https://komonews.com/news/local/house-minority-leader-hakeem-jeffries-in-western-washington-talking-2026-health-care-democrats-midterm-elections",
    "timestamp": "2025-09-13T01:08:16Z"
  },
  {
    "title": "Did WWE's WrestleMania Move to Saudi Arabia Get Donald Trump Blessing?",
    "description": "We have to give Triple H and TKO a whole lot of credit. They can find some very unique ways to bring the WWE Universe together. For example, it was announced earlier today that WWE WrestleMania would be taking place in Riyadh, Saudi Arabia, in 2027. When the …",
    "link": "https://bleedingcool.com/tv/did-wwes-wrestlemania-move-to-saudi-arabia-get-donald-trump-blessing/",
    "timestamp": "2025-09-13T01:08:05Z"
  },
  {
    "title": "Charlie Kirk once said prominent Black women didn't have 'brain processing power' to be taken seriously",
    "description": "Claim:Turning Point USA founder and CEO Charlie Kirk once said some prominent Black women did not have \"the brain processing power to otherwise be taken really seriously.\" Rating:True Context:Kirk was speaking on his show, \"The Charlie Kirk Show,\" on July 13,…",
    "link": "https://freerepublic.com/focus/f-news/4340115/posts",
    "timestamp": "2025-09-13T01:07:57Z"
  },
  {
    "title": "Lawmakers are on edge about their own safety following Charlie Kirk's killing in Utah",
    "description": "Members of Congress are on high alert, calling for increased security, after the assassination of conservative activist Charlie Kirk in Utah",
    "link": "https://www.msnbc.com/msnbc/news/charlie-kirks-killing-intensifies-fears-members-congress-rcna230922",
    "timestamp": "2025-09-13T01:07:31Z"
  },
  {
    "title": "Charlie Kirk’s Wife Erika Kirk Breaks Silence After His Death",
    "description": "Charlie Kirk’s wife, Erika Kirk (née Frantzve), broke her silence following the death of her husband at age 31. “Charlie loved life. He loved his life, he loved America, he loved nature which always helped him closer to God,” Erika, 36, said in a live stream …",
    "link": "https://www.usmagazine.com/celebrity-news/news/charlie-kirks-wife-erika-kirk-breaks-silence-after-his-death/#article",
    "timestamp": "2025-09-13T01:05:03Z"
  },
  {
    "title": "The pretextual case against Cook collapses",
    "description": "These are not very bright etc.: A loan estimate for an Atlanta home purchased by Lisa Cook, the Federal Reserve governor accused of mortgage fraud by the Trump administration, shows that Cook had declared the property as a “vacation home,” according to a docu…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/the-pretextual-case-against-cook-collapses",
    "timestamp": "2025-09-13T01:04:52Z"
  },
  {
    "title": "Erika Kirk: ‘My Husband Witnessed for His Lord and Savior Jesus Christ’ on His Final Day",
    "description": "Turning Point USA founder Charlie Kirk's wife Erika Kirk made her first public address on Friday, two days after her husband was assassinated at the first stop of his “American Comeback Tour” at Utah Valley University.\nThe post Erika Kirk: ‘My Husband Witness…",
    "link": "https://www.breitbart.com/politics/2025/09/12/erika-kirk-my-husband-witnessed-for-his-lord-and-savior-jesus-christ-on-his-final-day/",
    "timestamp": "2025-09-13T01:03:11Z"
  },
  {
    "title": "Watching The End Game Of New York’s Climate Madness Begin To Play Out",
    "description": "From the Manhattan Contrarian Francis Menton As I have written many times, with New York’s fantasy “net zero” energy plans, it is not a question of whether they will fail, but only when and how. The Democrats, who dominate state politics, and their environmen…",
    "link": "https://wattsupwiththat.com/2025/09/12/watching-the-end-game-of-new-yorks-climate-madness-begin-to-play-out/",
    "timestamp": "2025-09-13T01:00:00Z"
  },
  {
    "title": "\"WHAT IF...TARIFFS?\": How Swiss watchmaker cheekily ticks back at Trump’s tariff hit",
    "description": "Swatch, the Swiss watchmaker, has launched a special edition watch called \"WHAT IF...TARIFFS?\" with reversed numbers three and nine. This is in response to the 39% tariffs imposed by the U.S. on Swiss imports. Priced at 139 Swiss francs, the watch is exclusiv…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-if-tariffs-how-swiss-watchmaker-cheekily-ticks-back-at-trumps-tariff-hit/articleshow/123862044.cms",
    "timestamp": "2025-09-13T00:59:49Z"
  },
  {
    "title": "Emotional Erika Kirk Thanks Trump: ‘Mr. President, My Husband Loved You’",
    "description": "Erika Kirk, the wife of late conservative activist Charlie Kirk, thanked President Donald Trump on Friday in her first public words since her husband was shot and killed, saying, “Mr. President, my husband loved you.” In the emotional appearance in front of r…",
    "link": "https://www.mediaite.com/media/tv/emotional-erika-kirk-thanks-trump-mr-president-my-husband-loved-you/",
    "timestamp": "2025-09-13T00:58:58Z"
  },
  {
    "title": "Charlie Kirk’s Widow Strikes Cryptic Note Directed at ‘The Evildoers Responsible for My Husband’s Assassination’",
    "description": "Erika Kirk, the widow of conservative activist Charlie Kirk, blamed unspecified \"evildoers\" for the murder of her husband.\nThe post Charlie Kirk’s Widow Strikes Cryptic Note Directed at ‘The Evildoers Responsible for My Husband’s Assassination’ first appeared…",
    "link": "https://www.mediaite.com/crime/charlie-kirks-widow-strikes-cryptic-note-directed-at-the-evildoers-responsible-for-my-husbands-assassination/",
    "timestamp": "2025-09-13T00:55:19Z"
  },
  {
    "title": "Charlie Kirk’s widow, Erika, breaks her silence on husband’s death after fatal shooting",
    "description": "Charlie died on Wednesday after he was fatally shot during a speaking engagement at Utah Valley University.",
    "link": "https://pagesix.com/2025/09/12/celebrity-news/charlie-kirks-widow-erika-breaks-her-silence-on-husbands-death-after-fatal-shooting/",
    "timestamp": "2025-09-13T00:55:00Z"
  },
  {
    "title": "Erika Kirk vows to carry Charlie Kirk’s mission forward in her first public appearance since the death of her husband, tells husband’s killers they ‘unleashed a fire across America; Here's everything she said",
    "description": "Erika Kirk, wife of late activist Charlie Kirk, addressed the public. She expressed gratitude and resolve to continue his work. Kirk thanked first responders and law enforcement. She vowed to strengthen Turning Point USA. She recalled Charlie's passion for fa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/erika-kirk-vows-to-carry-charlie-kirks-mission-forward-in-her-first-public-appearance-since-the-death-of-her-husband-tells-husbands-killers-they-unleashed-a-fire-across-america/articleshow/123862026.cms",
    "timestamp": "2025-09-13T00:54:12Z"
  },
  {
    "title": "Charlie Kirk's Wife Erika Makes First Public Speech Since His Death - Watch the Full Video",
    "description": "Charlie Kirk‘s widow Erika Frantzve Kirk just spoke out with her first public address since his death earlier this week. The conservative activist was shot and killed at the age of 31 on Wednesday (September 10) while participating in a public debate at Utah …",
    "link": "https://www.justjared.com/2025/09/12/charlie-kirks-wife-erika-makes-first-public-speech-since-his-death-watch-the-full-video/",
    "timestamp": "2025-09-13T00:52:53Z"
  },
  {
    "title": "Charlie Kirk Widow Addresses Shooter in First Public Statement: ‘You Have No Idea What You Have Unleashed’ | Video",
    "description": "“The movement my husband built will not die — I refuse to let that happen,” Erika Kirk says in a tearful ode to her late husband from his Turning Point USA Phoenix headquarters\nThe post Charlie Kirk Widow Addresses Shooter in First Public Statement: ‘You Have…",
    "link": "https://www.thewrap.com/charlie-kirk-widow-erika-assassination-speech/",
    "timestamp": "2025-09-13T00:50:05Z"
  },
  {
    "title": "Charlie Kirk's Widow Erika Hails Him As A 'Martyr' In First Remarks Since His Death",
    "description": "\"You have no idea what you just have unleashed across this entire country,\" Erika Kirk said, speaking to her husband's killer.",
    "link": "https://www.huffpost.com/entry/charlie-kirk-erika-kirk-first-public-remarks-fatal-shooting_n_68c4a04be4b0efc9da5fcb0f",
    "timestamp": "2025-09-13T00:49:51Z"
  },
  {
    "title": "WATCH: Young Bagpiper Plays 'America the Beautiful' to Honor Charlie Kirk at Turning Point USA Headquarters",
    "description": "A young bagpiper was seen playing outside the Turning Point USA headquarters in Phoenix, Arizona, near a makeshift memorial for the organization's founder, Charlie Kirk, who was assassinated this week.\nThe post WATCH: Young Bagpiper Plays ‘America the Beautif…",
    "link": "https://www.breitbart.com/local/2025/09/12/watch-young-bagpiper-honors-charlie-kirk-turning-point-usa-hq/",
    "timestamp": "2025-09-13T00:44:19Z"
  },
  {
    "title": "Marlow: 'We Need to Have a March on Washington on Behalf of Charlie'",
    "description": "Friday on Newsmax TV's \"Rob Schmitt Tonight,\" Breitbart Editor-in-Chief Alex Marlow called for a march on Washington to honor Turning Point USA founder Charlie Kirk.\nThe post Marlow: ‘We Need to Have a March on Washington on Behalf of Charlie’ appeared first …",
    "link": "https://www.breitbart.com/clips/2025/09/12/marlow-we-need-to-have-a-march-on-washington-on-behalf-of-charlie/",
    "timestamp": "2025-09-13T00:43:49Z"
  },
  {
    "title": "'What an idiot': Trump's attack dog mocked as 'mortgage fraud' allegation crumbles",
    "description": "President Donald Trump's Federal Housing Finance Agency director Bill Pulte has been on a tear accusing various critics of the administration of mortgage fraud — most recently Federal Reserve governor Lisa Cook, whom he claimed improperly took out mortgages o…",
    "link": "https://www.rawstory.com/bill-pulte-2673990722/",
    "timestamp": "2025-09-13T00:43:34Z"
  },
  {
    "title": "U.S. to deploy National Guard to Memphis, Trump says",
    "description": "The move follows his administration's unprecedented police takeover in Washington, D.C., last month.",
    "link": "https://www.japantimes.co.jp/news/2025/09/13/world/politics/us-national-guard-memphis-trump/",
    "timestamp": "2025-09-13T00:42:00Z"
  },
  {
    "title": "Democrat Rep Tells CNN That Labeling GOP ‘Fascist’ Or ‘Hitler’ Doesn’t Incite People",
    "description": "Dem Rep. Pat Ryan said he does not believe labeling Republicans as \"fascist,\" \"Nazi\" or \"Hitler\" contributes to the \"overall problem\" between the two parties.",
    "link": "https://dailycaller.com/2025/09/12/democrat-rep-pat-ryan-cnn-kasie-hunt-gop-names-hitler-doesnt/",
    "timestamp": "2025-09-13T00:41:15Z"
  },
  {
    "title": "U.S. moves to scrap emissions reporting by polluters",
    "description": "U.S. President Donald Trump has heavily promoted new oil, gas, and coal extraction while moving to suppress competition from solar and wind.",
    "link": "https://www.japantimes.co.jp/environment/2025/09/13/climate-change/us-scraps-emissions-reporting/",
    "timestamp": "2025-09-13T00:35:00Z"
  },
  {
    "title": "NATO to beef up defense of Europe's eastern flank after Poland drone incursions",
    "description": "Poland's drone shootdown was the first known action of its kind by a NATO member during Russia's war in Ukraine.",
    "link": "https://www.japantimes.co.jp/news/2025/09/13/world/nato-eastern-flank-poland-drones/",
    "timestamp": "2025-09-13T00:33:00Z"
  },
  {
    "title": "I am not surprised that the shooter was far right",
    "description": "I’ve been disturbed for the last day by all the unfounded speculation that Charlie Kirk’s killer was a far left fanatic, gay or trans, and that this was a hate crime against conservatives, which I had to recognize as a possibility. That was the constant drum …",
    "link": "https://freethoughtblogs.com/pharyngula/2025/09/12/i-am-not-surprised-that-the-shooter-was-far-right/",
    "timestamp": "2025-09-13T00:32:35Z"
  },
  {
    "title": "Ivanka Trump Makes Rare TV Appearance to Honor Charlie Kirk",
    "description": "First daughter Ivanka Trump paid tribute to Turning Point USA co-founder Charlie Kirk during a rare television appearance on Friday.",
    "link": "https://www.westernjournal.com/ivanka-trump-makes-rare-tv-appearance-honor-charlie-kirk/",
    "timestamp": "2025-09-13T00:28:49Z"
  },
  {
    "title": "Watch: President Trump’s White House Releases Heartfelt Tribute Video to Charlie Kirk",
    "description": "The White House released a touching video tribute to Turning Point USA founder Charlie Kirk, who was assassinated on Wednesday at the first stop of his “American Comeback Tour” at Utah Valley University.\nThe post Watch: President Trump’s White House Releases …",
    "link": "https://www.breitbart.com/politics/2025/09/12/watch-president-trumps-white-house-releases-heartfelt-tribute-video-to-charlie-kirk/",
    "timestamp": "2025-09-13T00:25:28Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as ‘vacation home,’ undercutting Trump fraud claims",
    "description": "Documents showed that on a second form, she described the property as a “second home.”",
    "link": "https://www.bostonherald.com/2025/09/12/fed-lisa-cook-vacation-home/",
    "timestamp": "2025-09-13T00:22:19Z"
  },
  {
    "title": "Charlie Kirk Shooting: Shooter Arrested, Cops Refute ‘Trans Ideology’ on Bullets Claim",
    "description": "22-year-old Tyler James Robinson of Washington County in Utah, has been arrested in connection with the fatal shooting of conservative commentator Charlie Kirk. “We got him,” Utah Governor Spencer Cox ...\nThe post Charlie Kirk Shooting: Shooter Arrested, Cops…",
    "link": "https://www.starobserver.com.au/news/charlie-kirk-shooting-shooter-arrested-cops-refute-trans-ideology-on-bullets-claim/238653",
    "timestamp": "2025-09-13T00:22:14Z"
  },
  {
    "title": "Restaurant in major city faces fallout over 'offensive' Charlie Kirk post by co-owner (Lucius Q in Cincinnati)",
    "description": "A popular Ohio barbecue restaurant is facing major backlash after one of its co-owners called conservative activist Charlie Kirk a \"piece of s---\" in a social media post after his assassination. Shortly after Kirk, 31, was shot Wednesday while speaking at a c…",
    "link": "https://freerepublic.com/focus/f-chat/4340106/posts",
    "timestamp": "2025-09-13T00:20:10Z"
  },
  {
    "title": "Trump's Crackdown On Prescription Drug Ads: What To Know",
    "description": "Trump's Crackdown On Prescription Drug Ads: What To Know\n \nAuthored by Lawrence Wilson via The Epoch Times (emphasis ours),\nPresident Donald Trump has directed the Food and Drug Administration (FDA) to ramp up its efforts to ensure that advertising of prescri…",
    "link": "https://biztoc.com/x/4063ccccb5682787",
    "timestamp": "2025-09-13T00:19:38Z"
  },
  {
    "title": "It’s Never Too Soon For the Right to Blame Trans People",
    "description": "When Utah authorities announced on Friday morning that 22-year-old Tyler Robinson had been apprehended in connection with the killing of conservative influencer Charlie Kirk, they quelled a storm of rumors and inaccurate reporting about the gender identity an…",
    "link": "https://www.motherjones.com/politics/2025/09/charlie-kirk-shooter-trans-ideology-false/",
    "timestamp": "2025-09-13T00:17:13Z"
  },
  {
    "title": "Appeals court rules Trump administration can end legal protections for more than 400,000 migrants",
    "description": "The ruling applies to migrants from Cuba, Haiti, Nicaragua and Venezuela.",
    "link": "https://www.bostonherald.com/2025/09/12/trump-humanitarian-parole/",
    "timestamp": "2025-09-13T00:15:34Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as ‘vacation home,’ undercutting Trump fraud claims",
    "description": "WASHINGTON (AP) — Federal Reserve Governor Lisa Cook referred to a condominium she purchased in June 2021 as a “vacation home” in a loan estimate, a characterization that could undermine claims by the Trump administration that she committed mortgage fraud. Pr…",
    "link": "https://financialpost.com/pmn/fed-governor-lisa-cook-claimed-2nd-residence-as-vacation-home-undercutting-trump-fraud-claims",
    "timestamp": "2025-09-13T00:10:39Z"
  },
  {
    "title": "US Caught Napping While Global Green Hydrogen Industry Moves On",
    "description": "The Estonian electrolyzer firm Stargate Hydrogen is among the startups pursuing the global green hydrogen market.\nThe post US Caught Napping While Global Green Hydrogen Industry Moves On appeared first on CleanTechnica.",
    "link": "https://cleantechnica.com/2025/09/12/us-caught-napping-while-global-green-hydrogen-industry-moves-on/",
    "timestamp": "2025-09-13T00:10:01Z"
  },
  {
    "title": "How Charlie Kirk's influence with younger voters helped Donald Trump: ANALYSIS",
    "description": "Kirk energized young voters, and persuaded GOP leaders to buy into his vision.",
    "link": "https://abcnews.go.com/Politics/charlie-kirks-influence-younger-voters-helped-donald-trump/story?id=125518800",
    "timestamp": "2025-09-13T00:09:00Z"
  },
  {
    "title": "Democratic Strategist Says He Called Cops After Laura Loomer Told Him He and His Son ‘Are Going to Hell’",
    "description": "Mike Nellis, a Democratic strategist and former Senior Advisor to Vice President Kamala Harris, said on X Friday that he has called the police after conservative personality Laura Loomer direct-messaged him, saying he and his son “are going to hell.” Loomer i…",
    "link": "https://www.mediaite.com/media/democratic-strategist-says-he-called-cops-after-laura-loomer-told-him-he-and-his-son-are-going-to-hell/",
    "timestamp": "2025-09-13T00:08:22Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as 'vacation home,' undercutting Trump fraud claims",
    "description": "Federal Reserve Governor Lisa Cook referred to a condominium she purchased in June 2021 as a “vacation home\" in a loan estimate, a characterization that...",
    "link": "https://www.yahoo.com/news/articles/fed-governor-lisa-cook-claimed-000741776.html",
    "timestamp": "2025-09-13T00:07:41Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as 'vacation home,' undercutting Trump fraud claims",
    "description": "Federal Reserve Governor Lisa Cook referred to a condominium she purchased in June 2021 as a “vacation home” in a loan estimate. That characterization that could undermine claims by the Trump administration that she committed mortgage fraud. President Donald …",
    "link": "https://apnews.com/article/federal-reserve-lisa-cook-trump-852820c83e5001ec3b6e2d14047965c9",
    "timestamp": "2025-09-13T00:07:41Z"
  },
  {
    "title": "Prosecution continues case against the man accused in a Trump assassination attempt",
    "description": "Witnesses from the FBI and the Palm Beach County Sheriff’s Office focused mostly on the law enforcement response, as well evidence collection and analyses, as prosecutors continued their case with a second day of testimony in the case of a man accused ...",
    "link": "https://abcnews.go.com/US/wireStory/prosecution-continues-case-man-accused-trump-assassination-attempt-125527941",
    "timestamp": "2025-09-13T00:06:27Z"
  }
]