[
  {
    "title": "Swalwell demands 2028 Dem candidates vow to destroy Trump's White House ballroom project",
    "description": "California Democrat wants future presidential nominees to destroy $250M addition on day one -------------------------------------------- Rep. Eric Swalwell, D-Calif., said the next Democratic presidential nominee must vow to demolish President Donald Trump's …",
    "link": "https://freerepublic.com/focus/f-news/4348742/posts",
    "timestamp": "2025-10-26T17:49:25Z"
  },
  {
    "title": "US warship arrives in Trinidad and Tobago, near Venezuela",
    "description": "USS Gravely's arrival comes as US military build-up in the region has increased tensions between Washington and Caracas.",
    "link": "https://www.aljazeera.com/news/2025/10/26/us-warship-arrives-in-trinidad-and-tobago-near-venezuela",
    "timestamp": "2025-10-26T17:48:43Z"
  },
  {
    "title": "Poll results: Herald readers tell Congress to ‘Get back to work’",
    "description": "Last week, we asked Herald readers if the Democrats' health care fight was worth a government shutdown, to which readers responded with a resounding call to get back to work.",
    "link": "https://www.bostonherald.com/2025/10/26/poll-results-herald-readers-tell-congress-to-get-back-to-work/",
    "timestamp": "2025-10-26T17:48:39Z"
  },
  {
    "title": "US and China To Pause 100 Percent Tariffs and Rare Earth Export Controls",
    "description": "In a major breakthrough, top economic officials from the U.S. and China have drafted a trade deal, which is expected to be finalized by President Donald Trump and Chinese President Xi Jinping.\nThe agreement is set to halt the escalation of 100 percent tariffs…",
    "link": "https://biztoc.com/x/c54f59810db5f96d",
    "timestamp": "2025-10-26T17:43:51Z"
  },
  {
    "title": "India Is Withstanding Tariffs To Remain The World’s Fastest-Growing Major Economy",
    "description": "In the past few months, India has taken steps to effectively adapt to the barrage of trade policies being weaponized by U.S. President Donald Trump, who implemented tariffs to disrupt India’s pharmaceutical drugs in October, and raised H-1B visa costs that ar…",
    "link": "https://www.forbes.com/sites/krnkashyap/2025/10/26/india-is-withstanding-tariffs-to-remain-the-worlds-fastest-growing-major-economy/",
    "timestamp": "2025-10-26T17:41:07Z"
  },
  {
    "title": "Fact-checking claims that a Canadian ad was misleading about Reagan’s tariff warning",
    "description": "The one-minute ad included some of Reagan’s remarks out of chronological order and omitted that Reagan recorded the address after imposing duties on some Japanese products. However, the ad’s overall message doesn’t misrepresent Reagan’s views on tariffs. Reag…",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-claims-that-a-canadian-ad-was-misleading-about-reagans-tariff-warning",
    "timestamp": "2025-10-26T17:40:27Z"
  },
  {
    "title": "Carney Pushes Back on Provinces Spoiling for a Fight With Trump",
    "description": "Canadian Prime Minister Mark Carney’s government appeared to distance itself from the Ontario premier’s interventions on trade following US President Donald Trump’s decision to increase tariffs because of an Ontario government television ad.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-pushes-back-on-provinces-spoiling-for-a-fight-with-trump",
    "timestamp": "2025-10-26T17:35:27Z"
  },
  {
    "title": "The East Wing of the White House is gone. Here’s a look at some of the history made there.",
    "description": "Here’s a look at some of the history that came out of the East Wing and the first ladies who spent time there.",
    "link": "https://www.denverpost.com/2025/10/26/white-house-east-wing-history/",
    "timestamp": "2025-10-26T17:33:48Z"
  },
  {
    "title": "Trump in Asia: Making Deals, Trading Dance Moves",
    "description": "President Donald Trump is only one day into his week-long Asia tour, and he’s already overseen Cambodia and Thailand sign a peace deal and secured... Read More\nThe post Trump in Asia: Making Deals, Trading Dance Moves appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/26/trump-in-asia-making-deals-trading-dance-moves/",
    "timestamp": "2025-10-26T17:30:00Z"
  },
  {
    "title": "Trump and Xi will ‘consummate’ TikTok deal on Thursday, treasury secretary says",
    "description": "The United States and China are ready to move forward on a TikTok deal, according to Treasury Secretary Scott Bessent.",
    "link": "https://techcrunch.com/2025/10/26/trump-and-xi-will-consummate-tiktok-deal-on-thursday-treasury-secretary-says/",
    "timestamp": "2025-10-26T17:29:27Z"
  },
  {
    "title": "US Treasury chief Bessent says 'substantial' trade framework with China reached",
    "description": "United States Treasury secretary Scott Bessent said \"substantial\" progress has been made on a US-China trade deal, igniting hopes of a sustained bull rally.",
    "link": "https://cointelegraph.com/news/bessent-substantial-trade-framework-china",
    "timestamp": "2025-10-26T17:28:39Z"
  },
  {
    "title": "Disney’s ‘Springsteen: Deliver Me from Nowhere’ Bombs in the U.S.A.",
    "description": "As great as I found director Scott Cooper’s Springsteen: Deliver Me from Nowhere, nothing about its box office failure is surprising. And it is not only a failure; it is a shocking failure for box office analysts who projected an opening as high as $25 millio…",
    "link": "https://freerepublic.com/focus/f-chat/4348739/posts",
    "timestamp": "2025-10-26T17:27:05Z"
  },
  {
    "title": "Trump Ends Canada Access At Shared Border Library",
    "description": "Yet another symbol of unity and peace destroyed by the Trump administration. Everything Trump touches dies.\nvia Haskell Free Library\nThe Haskell Free Library and Opera House was founded in 1901 and completed in 1904 by Canadian-American philanthropist Martha …",
    "link": "https://crooksandliars.com/2025/10/trump-ends-canada-access-shared-border",
    "timestamp": "2025-10-26T17:26:49Z"
  },
  {
    "title": "'Doesn't feel the same pain': Scott Bessent ridiculed for claim to be a 'soybean farmer'",
    "description": "Scott Bessent, Donald Trump's Secretary of Treasury, was mercilessly mocked on Sunday after claiming to be \"a soybean farmer\" during an interview.Bessent appeared on ABC on Sunday, where he said, \"Martha, in case you don't know it, I'm actually a soybean farm…",
    "link": "https://www.rawstory.com/scott-bessent-soybean-farmer/",
    "timestamp": "2025-10-26T17:26:37Z"
  },
  {
    "title": "Pakistan says five soldiers and 25 fighters killed in Afghan border clashes",
    "description": "Fighting comes as Taliban submits proposal at peace talks in Turkiye, while Islamabad warns of 'open war' if deal fails.",
    "link": "https://www.aljazeera.com/news/2025/10/26/pakistan-says-five-soldiers-and-25-fighters-killed-in-afghan-border-clashes",
    "timestamp": "2025-10-26T17:24:38Z"
  },
  {
    "title": "“I’ve felt pain too”: Bessent claims to be a soybean farmer while defending Trump trade war",
    "description": "The yeoman Treasury Secretary and former hedge fund manager said the trade war with China has hurt him.",
    "link": "https://www.salon.com/2025/10/26/ive-felt-pain-too-bessent-claims-to-be-a-soybean-farmer-while-defending-trump-trade-war/",
    "timestamp": "2025-10-26T17:22:21Z"
  },
  {
    "title": "Rigetti, MP Materials, And STMicroelectronics Are Among Top 10 Large Cap Losers Last Week (Oct. 20-Oct. 24): Are the Others in Your Portfolio?",
    "description": "These ten large-cap stocks were the worst performers last week. Are they a part of your portfolio?\nOklo Inc. (NYSE:OKLO) lost 15.15% this week.\nRigetti Computing, Inc. (NASDAQ:RGTI) lost 17.94% this week. The Donald Trump administration is reportedly in talks…",
    "link": "https://biztoc.com/x/6f33b76eb75cdd48",
    "timestamp": "2025-10-26T17:21:34Z"
  },
  {
    "title": "East Timor joins ASEAN in bloc’s first expansion since the 1990s on opening day of summit",
    "description": "The Association of Southeast Asian Nations welcomed East Timor as its newest member Sunday, which its prime minister said was a “dream realized” for the tiny nation. Meanwhile, Cambodia and Thailand signed an agreement expanding a ceasefire on their borders w…",
    "link": "https://www.pbs.org/newshour/world/east-timor-joins-asean-in-blocs-first-expansion-since-the-1990s-on-opening-day-of-summit",
    "timestamp": "2025-10-26T17:19:51Z"
  },
  {
    "title": "Jennifer Lawrence Needed The Tea, Asked Robert Pattinson About The Time Trump Tweeted About His Breakup With Kristen Stewart",
    "description": "Nothing's better than reheated tea!",
    "link": "https://www.cinemablend.com/movies/jennifer-lawrence-asked-robert-pattinson-about-time-trump-tweeted-about-kristen-stewart-breakup",
    "timestamp": "2025-10-26T17:19:17Z"
  },
  {
    "title": "Biden-Era Border Policies Blamed by DHS for Alleged Murder of Texas Woman at Hands of 3 Illegal Aliens",
    "description": "Three illegal aliens from Mexico have been arrested in connection with the shooting death of 43-year-old Mary Gonzales, whose body was found in a North Austin field on October 6. Texas authorities apprehended one suspect, while U.S. Immigration and Customs En…",
    "link": "https://www.breitbart.com/border/2025/10/26/biden-era-border-policies-blamed-by-dhs-for-murder-of-texas-woman-at-hands-of-3-illegal-aliens/",
    "timestamp": "2025-10-26T17:19:01Z"
  },
  {
    "title": "Report: Anti-Abortion Leaders Helped Tank Trump’s Promise of Free IVF",
    "description": "Anti-abortion advocates haven’t just played key roles in rolling back abortion rights in recent years. They also helped tank President Donald Trump’s campaign-trail promise to make in vitro fertilization free. That’s according to a new report published Saturd…",
    "link": "https://www.motherjones.com/politics/2025/10/anti-abortion-leaders-trump-ivf-politico/",
    "timestamp": "2025-10-26T17:18:59Z"
  },
  {
    "title": "Abraham Accords to expand soon as Hamas and Hezbollah regroup, Israeli diplomat says",
    "description": "Ofir Akunis said that Israel will insist upon the demilitarization of Gaza and the disarmament of Hamas, which are conditions in the second part of the US...",
    "link": "https://www.jpost.com/israel-news/article-871699",
    "timestamp": "2025-10-26T17:17:20Z"
  },
  {
    "title": "US, Brazil Launch Trade Talks After Trump, Lula Repair Ties",
    "description": "Top trade negotiators from the US and Brazil are set to meet Monday after President Donald Trump predicted the nations could “pretty quickly” strike a trade deal as he met with counterpart Luiz Inacio Lula da Silva. Trump said the pair “get along very well” a…",
    "link": "https://www.ndtvprofit.com/world/us-brazil-launch-trade-talks-after-trump-lula-repair-ties",
    "timestamp": "2025-10-26T17:16:28Z"
  },
  {
    "title": "The challenge of Golden Dome",
    "description": "'The president intends to render the United States impervious to air attack originating anywhere on the globe, from any enemy possessing any level of sophistication'",
    "link": "https://www.wnd.com/2025/10/challenge-golden-dome/",
    "timestamp": "2025-10-26T17:12:55Z"
  },
  {
    "title": "Trump Treasury Secretary Talks Side Gig As A Soybean Farmer. Technically, He’s Not Wrong.",
    "description": "Scott Bessent talked about personally feeling the \"pain\" of Trump's trade war with China.",
    "link": "https://www.huffpost.com/entry/scott-bessent-soybean-farmer_n_68fe3bb5e4b0049ce5fd2fd5",
    "timestamp": "2025-10-26T17:12:43Z"
  },
  {
    "title": "US Fed will likely cut again despite economic murkiness from shutdown",
    "description": "The Federal Reserve is poised to announce its second rate cut of the year despite a lack of economic data due to the government shutdown. Officials face a dilemma balancing inflation concerns with a weakening labor market, as they navigate this uncertainty wi…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-fed-will-likely-cut-again-despite-economic-murkiness-from-shutdown/articleshow/124830843.cms",
    "timestamp": "2025-10-26T17:12:18Z"
  },
  {
    "title": "Hakeem Jeffries: Only Republicans Are Initiating 'Partisan Gerrymandering'",
    "description": "Sunday on CBS's \"Face the Nation,\" House Minority Leader Hakeem Jeffries (D-NY) claimed that only Republicans have initiated \"partisan gerrymandering.\"\nThe post Hakeem Jeffries: Only Republicans Are Initiating ‘Partisan Gerrymandering’ appeared first on Breit…",
    "link": "https://www.breitbart.com/clips/2025/10/26/hakeem-jeffries-only-republicans-are-initiating-partisan-gerrymandering/",
    "timestamp": "2025-10-26T17:11:11Z"
  },
  {
    "title": "The Kremlin’s blitz to make Ukraine “go dark”",
    "description": "The Kremlin’s blitz to make Ukraine “go dark”\nDive-bombing drone attacks aim to shatter its energy system as winter approaches\nWHEN DONALD TRUMP met Volodymyr Zelensky on October 17th he was reported to have urged Ukraine to pull back from the Donbas and to h…",
    "link": "https://biztoc.com/x/12a7e3377c9ad112",
    "timestamp": "2025-10-26T17:10:54Z"
  },
  {
    "title": "Biden to receive award from Edward M. Kennedy Institute",
    "description": "Former President Joe Biden will be in Boston on Sunday to receive a lifetime achievement award from the Edward M. Kennedy Institute.",
    "link": "https://www.wcvb.com/article/biden-lifetime-achievement-kennedy-institute/69097845",
    "timestamp": "2025-10-26T17:07:45Z"
  },
  {
    "title": "Kamala Harris expects a woman to be president, and says it could ‘possibly’ be her — ‘I’m not done’",
    "description": "“I have lived my entire career a life of service and it’s in my bones. And there are many ways to serve,” she said. “I’ve never listened to polls.”",
    "link": "https://fortune.com/2025/10/26/kamala-harris-political-future-woman-us-president-2028-election/",
    "timestamp": "2025-10-26T17:02:09Z"
  },
  {
    "title": "After Epstein Scandal, Former US Ambassador Lord Peter Mandelson Returns to Britain, Where Reports Suggest He May Be Writing a ‘Tell-All’ Memoir To Get Back at PM Keir Starmer",
    "description": "‘Petey’ is back in Britain, looking for a vengeance.\nThe post After Epstein Scandal, Former US Ambassador Lord Peter Mandelson Returns to Britain, Where Reports Suggest He May Be Writing a ‘Tell-All’ Memoir To Get Back at PM Keir Starmer appeared first on The…",
    "link": "https://www.thegatewaypundit.com/2025/10/after-epstein-scandal-former-us-ambassador-lord-peter/",
    "timestamp": "2025-10-26T17:00:52Z"
  },
  {
    "title": "Trump officials reveal devastating impact of shutdown on small businesses",
    "description": "President has cut taxes, regulation and unfair trade deals, and Dems' response has been to close government",
    "link": "https://www.wnd.com/2025/10/trump-officials-reveal-devastating-impact-shutdown-small-businesses/",
    "timestamp": "2025-10-26T16:59:22Z"
  },
  {
    "title": "‘You Know It, Kristen!’: Scott Bessent Calls Out NBC Host’s Cherry Picking Economic Numbers",
    "description": "Treasury Secretary Scott Bessent called out NBC host Kristen Welker for cherry-picking inflation data during a Sunday interview on \"Meet the Press.\"",
    "link": "https://dailycaller.com/2025/10/26/scott-bessent-kristen-welker-cherry-picking-economic-numbers-food-prices-nbc-meet-press/",
    "timestamp": "2025-10-26T16:56:16Z"
  },
  {
    "title": "US and China reach agreement in principle on rare earths and soybeans ahead of Trump-Xi Jinping meeting",
    "description": "China processes about 90% of the world's rare earths and is the world's leading importer of soybeans\nThe post US and China reach agreement in principle on rare earths and soybeans ahead of Trump-Xi Jinping meeting appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/26/us-and-china-reach-agreement-in-principle-on-rare-earths-and-soybeans-ahead-of-trump-xi-jinping-meeting/",
    "timestamp": "2025-10-26T16:51:45Z"
  },
  {
    "title": "Gallego: White House Ballroom Example of Trump Being 'Marie Antoinette'",
    "description": "Sunday on NBC’s “Meet the Press,” Sen. Ruben Gallego (D-AZ) said the White House ballroom project was an example of President Donald Trump acting like Marie Antoinette. Host Kristen Welker said, “I do want to ask you about something that has\nThe post Gallego:…",
    "link": "https://www.breitbart.com/clips/2025/10/26/gallego-white-house-ballroom-example-of-trump-being-marie-antoinette/",
    "timestamp": "2025-10-26T16:49:32Z"
  },
  {
    "title": "Talks between Putin aide and White House enter third day",
    "description": "A Russian delegation led by Vladimir Putin’s aide, Kirill Dmitriev, has been holding talks in the US for three consecutive days Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626987-putin-aide-us-talks/",
    "timestamp": "2025-10-26T16:36:01Z"
  },
  {
    "title": "How New Trump Multiyear Policy Makes NIH Grants Even Harder To Get",
    "description": "The new Trump administration multiyear funding policy for NIH grants has dropped National Cancer Institute grant funding rates from one in 10 applicants to one in 25.",
    "link": "https://www.forbes.com/sites/brucelee/2025/10/26/how-new-trump-multiyear-policy-makes-nih-grants-even-harder-to-get/",
    "timestamp": "2025-10-26T16:35:58Z"
  },
  {
    "title": "Ukraine conflict can’t be resolved overnight – Kremlin",
    "description": "While Moscow appreciates Washington’s desire to end the hostilities swiftly, their root causes must not be ignored, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626985-kremlin-peskov-trump-ukraine-peace-efforts/",
    "timestamp": "2025-10-26T16:35:40Z"
  },
  {
    "title": "Russia has tested a new nuclear-capable missile, Putin and top general say",
    "description": "Russia tested a new nuclear-capable and powered cruise missile fit to confound existing defences, inching closer to deploying it to its military, President Vladimir Putin said in remarks released on Sunday.",
    "link": "https://www.cbc.ca/news/world/russia-nuclear-capable-missile-putin-9.6954208",
    "timestamp": "2025-10-26T16:33:14Z"
  },
  {
    "title": "Cleveland Browns Week 8 update: David Njoku returns from injury as Shedeur Sanders sidelined in shocking move | What this means for the offense",
    "description": "Cleveland Browns welcome back star tight end David Njoku for Week 8, boosting their offense after a Week 7 loss. However, rookie quarterback Shedeur Sanders is a surprise inactive due to a back injury, impacting quarterback depth. The Browns aim for a crucial…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/cleveland-browns-week-8-update-david-njoku-returns-from-injury-as-shedeur-sanders-sidelined-in-shocking-move-what-this-means-for-the-offense/articleshow/124829966.cms",
    "timestamp": "2025-10-26T16:30:12Z"
  },
  {
    "title": "STATE OF OREGON V. DONALD J. TRUMP Case Underscores Vital Role of Court Reporters, Says Naegeli Deposition & Trial",
    "description": "Naegeli Deposition & Trial highlights the vital role of court reporters in the landmark State of Oregon v. Donald J. Trump case.......",
    "link": "https://www.globenewswire.com/news-release/2025/10/26/3174249/0/en/STATE-OF-OREGON-V-DONALD-J-TRUMP-Case-Underscores-Vital-Role-of-Court-Reporters-Says-Naegeli-Deposition-Trial.html",
    "timestamp": "2025-10-26T16:28:00Z"
  },
  {
    "title": "Here are the 3 big things we're watching in the stock market this week",
    "description": "A strong start to the third-quarter earnings season has propelled the stock market back to record highs. Investors are hoping an even busier week of corporate reports — oh, and a Fed meeting — can keep the good times rolling. A wild card: President Donald Tru…",
    "link": "https://biztoc.com/x/1d44ddfc1c32fcc4",
    "timestamp": "2025-10-26T16:26:54Z"
  },
  {
    "title": "Scott Bessent says he's 'felt this pain' from China because 'I'm actually a soybean farmer'",
    "description": "Treasury Secretary Scott Bessett said Sunday he, too, has \"felt pain\" from China refusing to buy U.S.-grown soybeans during a trade conflict with President Donald Trump because \"I'm actually a soybean farmer.\"\nBessent's comment came during an interview with A…",
    "link": "https://biztoc.com/x/16038538d0db2174",
    "timestamp": "2025-10-26T16:26:36Z"
  },
  {
    "title": "Going as Trump for Halloween? Here’s what it says about your mental well-being",
    "description": "Costumes are an important way people externalize their inner world, experts say",
    "link": "https://www.the-independent.com/life-style/halloween-donald-trump-costume-b2848836.html",
    "timestamp": "2025-10-26T16:25:01Z"
  },
  {
    "title": "Transcript: Sen. Lindsey Graham on \"Face the Nation with Margaret Brennan,\" Oct. 26, 2025",
    "description": "The following is the transcript of the interview with Sen. Lindsey Graham, Republican of South Carolina, that aired on \"Face the Nation with Margaret Brennan\" on Oct. 26, 2025.",
    "link": "https://www.cbsnews.com/news/lindsey-graham-south-carolina-republican-face-the-nation-transcript-10-26-2025/",
    "timestamp": "2025-10-26T16:24:39Z"
  },
  {
    "title": "Jake Tapper Point-Blank Asks Chris Murphy If He’s Willing To Let Americans Go Hungry Over ObamaCare Subsidies",
    "description": "Jake Tapper on Sunday asked Sen. Murphy whether his party was prepared to let food stamp funding run dry to force an extension of expiring Obamacare subsidies.",
    "link": "https://dailycaller.com/2025/10/26/cnn-state-union-jake-tapper-asks-chris-murphy-food-stamps-obamacare-subsidies-government-shutdown/",
    "timestamp": "2025-10-26T16:21:40Z"
  },
  {
    "title": "California Gov. Gavin Newsom says he'd be 'lying' if he denied plans to consider a presidential run",
    "description": "California Gov. Gavin Newsom said in an interview on “CBS News Sunday Morning” that he would be “lying” if he denied plans to consider a presidential bid",
    "link": "https://www.nbcnews.com/politics/2028-election/gavin-newsom-consider-presidential-run-midterms-white-house-campaign-rcna239839",
    "timestamp": "2025-10-26T16:21:13Z"
  },
  {
    "title": "US and China agree framework of trade deal ahead of Donald Trump-Xi Jinping meeting",
    "description": "Talks between US and Chinese officials covered export controls, fentanyl and rare earth metals",
    "link": "https://www.irishtimes.com/business/2025/10/26/us-and-china-agree-framework-of-trade-deal-ahead-of-donald-trump-xi-jinping-meeting/",
    "timestamp": "2025-10-26T16:20:34Z"
  },
  {
    "title": "Scott Bessent says he's 'felt this pain' from China because 'I'm actually a soybean farmer'",
    "description": "Treasury Secretary Scott Bessent's estimated hundreds and millions of dollars in wealth includes soybean and corn farmland in North Dakota.",
    "link": "https://www.cnbc.com/2025/10/26/trump-treasury-bessent-trade-tariffs-china-soybean-farm.html",
    "timestamp": "2025-10-26T16:15:46Z"
  },
  {
    "title": "China will make ‘substantial’ purchases of U.S. soybeans and should avoid an extra 100% tariff, Bessent says",
    "description": "Treasury Secretary Scott Bessent signaled on Sunday that the U.S. and China will significantly de-escalate their trade war under a framework he negotiated.\nIn an interview on CBS News’ Face the Nation with Margaret Brennan, Bessent said an additional 100% tar…",
    "link": "https://biztoc.com/x/3dcab300c0ca59a8",
    "timestamp": "2025-10-26T16:15:34Z"
  },
  {
    "title": "Shutdown Gift of $130 Million For Military Sparks Legal Questions, Trump Says Donor Is a 'Friend'",
    "description": "In the midst of the government shutdown, an anonymous benefactor, called a “friend” by President Donald Trump, has donated $130 million to the Pentagon.\nOn Friday, Trump revealed that an anonymous friend donated a whopping $130 million to the Defense Departme…",
    "link": "https://biztoc.com/x/24c5abf68933e5b2",
    "timestamp": "2025-10-26T16:15:30Z"
  },
  {
    "title": "Israel will decide which foreign troops are acceptable to secure Gaza ceasefire, Netanyahu says",
    "description": "Prime Minister Benjamin Netanyahu said on Sunday Israel would determine which foreign forces it would allow as part of a planned international force in Gaza to help secure a fragile ceasefire under US President Donald Trump's plan.",
    "link": "https://www.independent.ie/world-news/middle-east/israel-will-decide-which-foreign-troops-are-acceptable-to-secure-gaza-ceasefire-netanyahu-says/a900710389.html",
    "timestamp": "2025-10-26T16:15:27Z"
  },
  {
    "title": "Donald Trump Got Mad at the TV, So Now Stuff Costs More",
    "description": "Last month, Donald Trump’s administration assured the US Supreme Court that the president’s massive tariffs were intended to address an “unusual and extraordinary threat” and were “essential to the country’s future.” This weekend, Trump announced that he was …",
    "link": "https://www.motherjones.com/politics/2025/10/donald-trump-world-series-canada-tariffs-reagan-carney-ford-bessent/",
    "timestamp": "2025-10-26T16:13:02Z"
  },
  {
    "title": "Pakistan reports fatal border clashes amid Afghanistan talks",
    "description": "The attacks are the latest flare-up of violence along the Pakistan-Afghanistan border. It comes as the two countries meet for peace talks in Istanbul.",
    "link": "https://www.dw.com/en/pakistan-reports-fatal-border-clashes-amid-afghanistan-talks/a-74503614",
    "timestamp": "2025-10-26T16:12:00Z"
  },
  {
    "title": "Trump’s outrage toward Canada ‘super childish behaviour,’ says U.S. Democratic senator",
    "description": "Democratic Sen. Tim Kaine of Virginia says U.S. President Donald Trump’s outrage toward Canada over an anti-tariff advertisement by the Ontario government is “a temper tantrum” that will blow over — but it’s embarrassing for the United States.",
    "link": "https://www.cbc.ca/news/politics/trump-tariff-canada-democratic-senator-9.6954115",
    "timestamp": "2025-10-26T16:11:12Z"
  },
  {
    "title": "US-China new deal sends markets reeling",
    "description": "A fresh U.S.–China trade “framework” buoyed crypto on Oct. 26 after negotiators said they reached “basic consensuses” to address tariff and export-control...",
    "link": "https://www.thestreet.com/crypto/business/us-china-new-deal-sends-markets-reeling",
    "timestamp": "2025-10-26T16:11:03Z"
  },
  {
    "title": "Newsom Vs. Trump 2028: California Governor To Decide On White House Bid After Midterms; Says Trump Presidency Over If Democrats Win In 2026",
    "description": "California’s Gavin Newsom seems to have been running for president for months, today he made it a little bit more official “Yeah, I’d be lying otherwise,” the two-term Democrat told CBS Sunday Morning’s Robert Costa’s of what he giving ‘serious thought” to a …",
    "link": "http://deadline.com/2025/10/gavin-newsom-presidency-trump-1236598071/",
    "timestamp": "2025-10-26T16:07:51Z"
  },
  {
    "title": "Our new obsession with wide-leg pants is causing a crisis of soggy bottoms [Sad]",
    "description": "Our new obsession with wide-leg pants is causing a crisis of soggy bottoms",
    "link": "https://www.fark.com/comments/13857428/Our-new-obsession-with-wide-leg-pants-is-causing-a-crisis-of-soggy-bottoms",
    "timestamp": "2025-10-26T16:05:58Z"
  },
  {
    "title": "Xi Jinping is at his boldest and brashest. How will Donald Trump fare this week?",
    "description": "What 14,000 communications over 13 years tell you about China’s evolving leader",
    "link": "https://biztoc.com/x/80a8701fbd26a94c",
    "timestamp": "2025-10-26T16:04:26Z"
  },
  {
    "title": "White House reporter: Let's put the Temple Mount on the table",
    "description": "White House reporter Jake Turx says solution to disarming Hamas is to 'put the Temple Mount on the table,' says terror group 'doesn't care' about anything else.",
    "link": "https://www.israelnationalnews.com/news/416841",
    "timestamp": "2025-10-26T16:03:28Z"
  },
  {
    "title": "CBS’s Margaret Brennan Grills Hakeem Jeffries About His Claim Trump is Trying to ‘Rig’ the 2026 Election: ‘How Do You Justify’ That Language?!",
    "description": "In a tense exchange on Sunday's Face the Nation, Brennan called out Jeffries for recent comments accusing Trump of trying to \"rig\" the 2026 election.\nThe post CBS’s Margaret Brennan Grills Hakeem Jeffries About His Claim Trump is Trying to ‘Rig’ the 2026 Elec…",
    "link": "https://www.mediaite.com/media/news/cbss-margaret-brennan-grills-hakeem-jeffries-about-his-claim-trump-is-trying-to-rig-the-2026-election-how-do-you-justify-that-language/",
    "timestamp": "2025-10-26T16:00:29Z"
  },
  {
    "title": "Lockheed Targets 2028 Orbit Test for Trump’s Golden Dome Shield",
    "description": "New reports suggest China may have beaten U.S. in race for country-level missile interception potential.\nThe post Lockheed Targets 2028 Orbit Test for Trump’s Golden Dome Shield first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/lockheed-targets-2028-orbit-test-for-trumps-golden-dome-shield/",
    "timestamp": "2025-10-26T16:00:24Z"
  },
  {
    "title": "Trump: US is 100% behind Asean",
    "description": "KUALA LUMPUR: President Donald Trump has reaffirmed the United States' commitment to the Indo-Pacific, saying Washington is \"100%\" behind Asean. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/27/trump-us-is-100-behind-asean",
    "timestamp": "2025-10-26T16:00:00Z"
  },
  {
    "title": "Peace pact brings joy to leaders",
    "description": "KUALA LUMPUR: A sense of jubilation prevailed as the Prime Ministers of Thailand and Cam-bodia, alongside Prime Minister Anwar Ibrahim and US President Donald Trump, formally signed the landmark \"KL Peace Accord\".  Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/27/peace-pact-brings-joy-to-leaders",
    "timestamp": "2025-10-26T16:00:00Z"
  },
  {
    "title": "China will make ‘substantial’ purchases of U.S. soybeans and should avoid an extra 100% tariff, Bessent says",
    "description": "\"So I would expect that the threat of the 100% has gone away, as has the threat of the immediate imposition of the Chinese initiating a worldwide export control regime.\"",
    "link": "https://fortune.com/2025/10/26/china-trade-deal-us-soybean-purchase-100-percent-tariff-bessent-trump-xi-jinping/",
    "timestamp": "2025-10-26T15:58:25Z"
  },
  {
    "title": "US Military May Miss Paychecks by November 15 - Treasury Secretary",
    "description": "WASHINGTON (Sputnik) - US military personnel may miss paychecks by November 15 if the government shutdown continues, US Treasury Secretary Scott Bessent said on Sunday.",
    "link": "https://sputnikglobe.com/20251026/us-military-may-miss-paychecks-by-november-15---treasury-secretary-1123018721.html",
    "timestamp": "2025-10-26T15:53:37Z"
  },
  {
    "title": "Murphy: Trump Transitioning U.S. from Democracy to 'Totalitarian State'",
    "description": "Sunday on CNN's \"State of the Union,\" Sen. Chris Murphy (D-CT) argued President Donald Trump was attempting to turn the United States into a \"totalitarian state.\"\nThe post Murphy: Trump Transitioning U.S. from Democracy to ‘Totalitarian State’ appeared first …",
    "link": "https://www.breitbart.com/clips/2025/10/26/murphy-trump-transitioning-u-s-from-democracy-to-totalitarian-state/",
    "timestamp": "2025-10-26T15:52:55Z"
  },
  {
    "title": "US, China reach rare earths, tariff pause for Trump and Xi to consider",
    "description": "KUALA LUMPUR (Reuters) -Top Chinese and U. economic officials on Sunday hashed out the framework of a trade deal for U.",
    "link": "https://finance.yahoo.com/news/us-china-reach-rare-earths-155114389.html",
    "timestamp": "2025-10-26T15:51:14Z"
  },
  {
    "title": "Why Fentanyl Smuggling isn't War and Cannot Justify Extrajudicial Killing (Ilya Somin/Reason)",
    "description": "Ilya Somin / Reason:\nWhy Fentanyl Smuggling isn't War and Cannot Justify Extrajudicial Killing  —  Thus, Trump's attacks on boats in the Carribean have no moral or legal justification.  —  Donald Trump continues to order strikes on boats carrying supposed dru…",
    "link": "https://www.memeorandum.com/251026/p25",
    "timestamp": "2025-10-26T15:50:00Z"
  },
  {
    "title": "IShowSpeed’s Fortnite early stream scores perfect 10/10 on IMDb and fans are loving every moment",
    "description": "IShowSpeed's \"Early Stream!\" Fortnite broadcast from December 2021 has achieved a perfect 10/10 rating on IMDb, a rare feat for a livestream. The four-hour session is celebrated for its raw, unscripted humor and viral moments, including the infamous \"my mom i…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/ishowspeeds-fortnite-early-stream-scores-perfect-10-on-imdb-and-fans-are-loving-every-moment/articleshow/124829622.cms",
    "timestamp": "2025-10-26T15:42:47Z"
  },
  {
    "title": "US–China reach trade framework that could avert 100% tariffs and pause rare-earth curbs — development comes as Trump and Xi prepare to meet this week",
    "description": "US and Chinese trade negotiators say they’ve reached a framework agreement that, if approved by both governments this week, would roll back proposed 100% tariffs on Chinese imports and pause Beijing’s escalating export restrictions on rare-earth materials.",
    "link": "https://www.tomshardware.com/tech-industry/us-china-trade-framework-could-avoid-tariffs-and-rare-earth-curbs",
    "timestamp": "2025-10-26T15:42:02Z"
  },
  {
    "title": "Border Patrol Faces Attacks from Violent Chicago Rioters on 'Most Violent Days' of Operation Midway Blitz",
    "description": "The Border Patrol is not letting threats and violence prevent it from doing its job to root out illegal immigrants in Chicago.",
    "link": "https://www.westernjournal.com/border-patrol-faces-attacks-violent-chicago-rioters-violent-days-operation-midway-blitz/",
    "timestamp": "2025-10-26T15:41:40Z"
  },
  {
    "title": "SNL’s Most Popular Sketches This Season Make It Clear What Still Moves The Needle",
    "description": "Let's talk about what works.",
    "link": "https://www.cinemablend.com/television/snl-most-popular-sketches-this-season-politics-trump",
    "timestamp": "2025-10-26T15:39:59Z"
  },
  {
    "title": "California Governor Newsom mulls 2028 US presidential run",
    "description": "California Governor Gavin Newsom is eyeing a 2028 presidential bid. He will make a final decision following the 2026 midterm elections. Newsom has actively challenged Republican President Donald Trump on various issues. He is also leading Democratic efforts t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/california-governor-newsom-mulls-2028-us-presidential-run/articleshow/124829581.cms",
    "timestamp": "2025-10-26T15:34:05Z"
  },
  {
    "title": "Chris Murphy: Tariffs a Political Tool Trump Is Using to 'Enrich Himself'",
    "description": "Sunday on CNN's \"State of the Union,\" Sen. Chris Murphy (D-CT) claimed President Donald Trump was using tariffs to \"enrich himself.\"\nThe post Chris Murphy: Tariffs a Political Tool Trump Is Using to ‘Enrich Himself’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/10/26/chris-murphy-tariffs-a-political-tool-trump-is-using-to-enrich-himself/",
    "timestamp": "2025-10-26T15:30:33Z"
  },
  {
    "title": "New Yorkers are getting inflation relief — but the IRS wants a cut. Would Trump’s proposed tariff checks be taxed too?",
    "description": "The president recently said some tariff revenues will \"probably\" be distributed to Americans.",
    "link": "https://finance.yahoo.com/news/yorkers-getting-inflation-relief-irs-153000169.html",
    "timestamp": "2025-10-26T15:30:00Z"
  },
  {
    "title": "USDA blames Democrats for potential SNAP benefits lapse in new message",
    "description": "The USDA on Saturday posted a new message to their website, blaming Democrats for the upcoming suspension of Supplemental Nutrition Assistance Program benefits, or food stamps program.",
    "link": "https://www.nbcnews.com/politics/trump-administration/usda-blames-democrats-snap-benefits-lapse-new-message-website-shutdown-rcna239835",
    "timestamp": "2025-10-26T15:29:36Z"
  },
  {
    "title": "‘Stop importing Indians’, Former DOGE architect calls for dismantling H-1B Visa program, claims to reveal ‘ugly truth’",
    "description": "Like many Americans, James Fishback, the CEO of investment firm Azoria, appears to be highly critical of the H-1B visa because he feels that foreign workers are stealing American jobs. -snip- Fishback, the initial developer of the “DOGE checks” tool, has been…",
    "link": "https://freerepublic.com/focus/f-chat/4348717/posts",
    "timestamp": "2025-10-26T15:29:21Z"
  },
  {
    "title": "Israel allows Red Cross and Egyptian teams into Gaza as search for bodies of hostages widens",
    "description": "On Saturday, the Egyptian team arrived with an excavator and bulldozers to help search for bodies, as part of efforts by international mediators to make sure the ceasefire holds.",
    "link": "https://news.sky.com/story/israel-allows-red-cross-and-egyptian-teams-into-gaza-as-search-for-bodies-of-hostages-widens-13458151",
    "timestamp": "2025-10-26T15:28:00Z"
  },
  {
    "title": "Hillary Clinton Called 'Devil in Disguise' for Posting Own Birthday Message",
    "description": "Twice-failed presidential candidate Hillary Clinton (D) got some pushback on Sunday for sharing her own birthday message.",
    "link": "https://www.breitbart.com/health/2025/10/26/hillary-clinton-called-the-devil-in-disguise-after-posting-her-own-78th-birthday-message/",
    "timestamp": "2025-10-26T15:25:15Z"
  },
  {
    "title": "“Wimp”: Trump tried to bully Pence out of certifying election on Jan. 6",
    "description": "A new book reveals details of a tense conversation between Trump and Pence shortly before a mob stormed the Capitol",
    "link": "https://www.salon.com/2025/10/26/wimp-trump-tried-to-bully-pence-out-of-certifying-election-on-jan-6/",
    "timestamp": "2025-10-26T15:25:12Z"
  },
  {
    "title": "Swalwell demands 2028 Dem candidates vow to destroy Trump's White House ballroom project",
    "description": "Rep. Swalwell demands 2028 Democratic candidates pledge to destroy Trump's new White House ballroom on day one, creating controversy over presidential renovations.",
    "link": "https://www.foxnews.com/politics/swalwell-demands-2028-democratic-candidates-vow-destroy-trumps-white-house-ballroom-project",
    "timestamp": "2025-10-26T15:23:43Z"
  },
  {
    "title": "California Governor Newsom mulls 2028 US presidential run",
    "description": "WASHINGTON (Reuters) -Democratic California Governor Gavin Newsom said in an interview aired on Sunday that he is considering running for U.S. president in...",
    "link": "https://www.yahoo.com/news/articles/california-governor-newsom-mulls-2028-151917931.html",
    "timestamp": "2025-10-26T15:19:17Z"
  },
  {
    "title": "US and China say trade deal drawing closer as Trump and Xi prepare for meeting",
    "description": "China's top trade negotiator, Li Chenggang, told reporters the two had reached a \"preliminary consensus,\" while Trump's treasury secretary, Scott Bessent, said there was \"a very successful framework.\"",
    "link": "https://www.npr.org/2025/10/26/nx-s1-5586646/us-china-trade-deal-drawing-closer",
    "timestamp": "2025-10-26T15:18:38Z"
  },
  {
    "title": "Newsom to Consider White House Run After 2026 Midterms",
    "description": "California Governor Gavin Newsom told CBS News Sunday Morning that he is considering a White House run after the 2026 midterms. When asked if he would give \"serious thought\" to a run for national office, Newsom said, \"Yeah, I'd be lying otherwise,\" adding, \"I…",
    "link": "https://freerepublic.com/focus/f-news/4348714/posts",
    "timestamp": "2025-10-26T15:16:15Z"
  },
  {
    "title": "Defense Minister: Israel will continue defending northern border against every threat",
    "description": "Defense Minister Israel Katz visits Israel-Lebanon border with US envoy Morgan Ortagus, receiving briefing on IDF efforts to thwart Hezbollah terror activities.",
    "link": "https://www.israelnationalnews.com/news/416836",
    "timestamp": "2025-10-26T15:16:05Z"
  },
  {
    "title": "Brazil’s President Luiz Inacio Lula da Silva grew increasingly frustrated with the MAGA leader as their pre-talk press conference dragged on for almost ten minutes.",
    "description": "Donald Trump deflected from a fellow world leader’s annoyance at how long their press conference was dragging on by telling journalists they were “boring...",
    "link": "https://www.thedailybeast.com/donald-trump-deflects-tensions-with-brazils-luiz-inacio-lula-da-silva-by-blasting-boring-reporters/",
    "timestamp": "2025-10-26T15:07:37Z"
  },
  {
    "title": "PM: Ukraine seeing positive development",
    "description": "Russia's advance had stalled, while Ukraine's capacity to hit targets inside Russia had grown, according to Petteri Orpo.",
    "link": "https://yle.fi/a/74-20190474",
    "timestamp": "2025-10-26T15:07:36Z"
  },
  {
    "title": "President Stephen Miller Sounds Dead Set On War With Venezuela",
    "description": "While Donald Trump keeps busy with his “main priority” of demolishing the White House and building his Marie Antoinette Ballroom, Presidential Puppetmaster Stephen Miller seems closer than ever to at least one of his Nazi wet dreams: invading Venezuela and sl…",
    "link": "https://crooksandliars.com/2025/10/stephen-miller-sounds-dead-set-war",
    "timestamp": "2025-10-26T15:07:19Z"
  }
]