[
  {
    "title": "FBI launches probes into 3 children's hospitals for alleged genital mutilation of minors",
    "description": "The Trump administration is targeting three major children's hospitals in FBI investigations looking into whether their transgender medical treatments violate federal law.",
    "link": "https://www.foxnews.com/politics/fbi-launches-probes-against-3-childrens-hospitals-genital-mutilation-minors",
    "timestamp": "2025-06-24T21:48:42Z"
  },
  {
    "title": "Nissan sees ¥200 bil net loss in April-June; shareholders grill management",
    "description": "Nissan Motor Co on Tuesday said it forecasts a net loss of 200 billion yen for the April-June quarter and apologized for the worsening performance as it faced criticism from shareholders at their annual meeting. New President and CEO Ivan Espinosa, who took o…",
    "link": "https://japantoday.com/category/business/update1-nissan-forecasts-net-loss-in-april-june-as-shareholders-grill-management",
    "timestamp": "2025-06-24T21:47:51Z"
  },
  {
    "title": "DOJ ‘Digging and Looking’ Into Anti-Parent School Board Activity Under Biden Admin",
    "description": "The U.S. Department of Justice is “digging and looking” into the Biden administration’s weaponization of school boards against parents, DOJ official Ed Martin said. Former... Read More\nThe post DOJ ‘Digging and Looking’ Into Anti-Parent School Board Activity …",
    "link": "https://www.dailysignal.com/2025/06/24/doj-digging-looking-anti-parent-school-board-activity-biden/",
    "timestamp": "2025-06-24T21:46:00Z"
  },
  {
    "title": "Senate Republicans scramble to resolve tense divisions as Trump ramps up pressure to pass his big bill",
    "description": "GOP leaders are hoping to vote on the legislation this week, but they still need to work through key issues across both chambers on Medicaid, clean energy and SALT.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-tense-divisions-trump-pressure-big-bill-rcna214750",
    "timestamp": "2025-06-24T21:45:53Z"
  },
  {
    "title": "The Left Calls Trump’s Iran Strike ‘Illegal.’ Its History of Inconsistency Says Otherwise.",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Left Calls Trump’s Iran Strike ‘Illegal.’ Its History of Inconsiste…",
    "link": "https://www.dailysignal.com/2025/06/24/the-left-calls-trumps-iran-strike-illegal-its-history-of-inconsistency-says-otherwise/",
    "timestamp": "2025-06-24T21:45:12Z"
  },
  {
    "title": "A nasal spray company wants to make it harder for the FTC to police health claims",
    "description": "In the midst of the covid-19 pandemic, a health products company called Xlear began advertising its saline nasal spray to people desperately searching for ways to protect themselves from a new virus. In its marketing, Xlear pointed to studies that it said sup…",
    "link": "https://www.theverge.com/policy/692327/xlear-ftc-lawsuit-covid-health-claims-consumer-protection",
    "timestamp": "2025-06-24T21:43:54Z"
  },
  {
    "title": "Trump Poses with World Leaders After Arriving in Netherlands for NATO Summit",
    "description": "President Donald Trump posed with other world leaders for the \"NATO Family Photo\" after arriving in the Netherlands for the NATO Summit.\nThe post Trump Poses with World Leaders After Arriving in Netherlands for NATO Summit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/24/trump-poses-with-world-leaders-after-arriving-in-netherlands-for-nato-summit/",
    "timestamp": "2025-06-24T21:43:24Z"
  },
  {
    "title": "‘Unconstitutional’: House Speaker thinks Congress can’t limit Trump’s war powers",
    "description": "After several lawmakers backed war power resolutions\r\n to check President Donald Trump’s ability to declare war – a power constitutionally reserved for Congress – Trump ally and House Speaker Mike Johnson (R-LA) said Tuesday that he believes such checks thems…",
    "link": "https://www.rawstory.com/mike-johnson-2672426083/",
    "timestamp": "2025-06-24T21:43:19Z"
  },
  {
    "title": "Court orders Trump administration to facilitate another deported man's return from El Salvador",
    "description": "A federal appeals court in New York has ordered the Trump administration to facilitate the return of a man who was deported to El Salvador roughly 30 minutes after the court suspended an order to remove him from the U.S. Tuesday's ruling in Jordin Alex...",
    "link": "https://abcnews.go.com/Politics/wireStory/court-orders-trump-administration-facilitate-deported-mans-return-123173629",
    "timestamp": "2025-06-24T21:42:29Z"
  },
  {
    "title": "GOP plan to sell more than 3,200 square miles of federal lands is found to violate Senate rules",
    "description": "A plan to sell more than 3,200 square miles of federal lands has been ruled out of Republicans’ big tax and spending cut bill after the Senate parliamentarian determined the proposal by Senate Energy Chairman Mike Lee would violate the chamber’s rules",
    "link": "https://abcnews.go.com/US/wireStory/gop-plan-sell-3200-square-miles-federal-lands-123161729",
    "timestamp": "2025-06-24T21:42:29Z"
  },
  {
    "title": "Matt Gaetz Caught Texting His Mom About How He's 'Guiding' Trump",
    "description": "A video secretly recording the former congressman while he was on a flight was uploaded to TikTok and went viral.",
    "link": "https://www.huffpost.com/entry/matt-gaetz-caught-texting-his-mom-about-how-hes-guiding-trump_n_685acefae4b0124a7193e196",
    "timestamp": "2025-06-24T21:42:25Z"
  },
  {
    "title": "More than 100 Dems join GOP to block own party's Trump impeachment effort",
    "description": "The House of Representatives voted along bipartisan lines to quash a lone progressive lawmaker's bid to impeach President Donald Trump Tuesday afternoon. Lawmakers agreed to table the measure in a 344–79 vote. A vote to table is a procedural mechanism allowin…",
    "link": "https://freerepublic.com/focus/f-news/4325091/posts",
    "timestamp": "2025-06-24T21:42:06Z"
  },
  {
    "title": "Whistleblower Says Top DOJ Official Pushed to Ignore Court Orders to Carry Out Deportations",
    "description": "With the Senate scheduled to hold a confirmation hearing on federal judicial nominee Emil Bove on Wednesday, Democrats urged the Republican Party to consider an explosive whistleblower complaint as they weighed Bove's nomination—one that revealed allegations …",
    "link": "https://www.commondreams.org/news/emil-bove-iii",
    "timestamp": "2025-06-24T21:41:23Z"
  },
  {
    "title": "Trump truce gains ground as nuclear watchdog seeks Iran access",
    "description": "Israel and Iran said they’d honor the truce provided their enemy did likewise, with no attacks reported since ones in the ceasefire’s early hours enraged Trump.",
    "link": "https://www.japantimes.co.jp/news/2025/06/25/world/politics/trump-truce-iran-israel/",
    "timestamp": "2025-06-24T21:41:00Z"
  },
  {
    "title": "Trump’s twitter-fingers reportedly could have put his bombing of Iran at risk",
    "description": "The president’s social media habits reportedly created additional obstacles for the U.S. armed forces as his being extremely online forced them to come up with a diversion in the bombing of Iran's nuclear sites.",
    "link": "https://www.msnbc.com/top-stories/latest/iran-bombing-trump-truth-social-diversion-rcna214838",
    "timestamp": "2025-06-24T21:39:03Z"
  },
  {
    "title": "What to know about 'Alligator Alcatraz,' Florida's immigration detention site in the Everglades",
    "description": "An immigration detention facility located at an isolated Everglades airfield surrounded by mosquito-, python- and alligator-filled swamplands is just days away from being operational, federal officials said Tuesday. Florida officials are racing ahead with the…",
    "link": "https://japantoday.com/category/world/what-to-know-about-%27alligator-alcatraz-%27-florida%27s-immigration-detention-site-in-the-everglades",
    "timestamp": "2025-06-24T21:38:00Z"
  },
  {
    "title": "Trump administration asks Supreme Court to clear way for South Sudan-bound deportation flight",
    "description": "President Donald Trump's administration asked the Supreme Court on Tuesday to clear the way for the deportation of several immigrants to South Sudan, a war-ravaged country where they have no ties. The motion comes a day after the justices allowed immigration …",
    "link": "https://japantoday.com/category/world/trump-administration-asks-supreme-court-to-clear-the-way-for-a-south-sudan-bound-deportation-flight",
    "timestamp": "2025-06-24T21:37:42Z"
  },
  {
    "title": "Russian attacks kill 26 civilians in Ukraine as Zelenskyy seeks more Western help",
    "description": "Russian drones, missiles and artillery killed at least 26 civilians and injured more than 200 others in Ukraine, officials said Tuesday, as President Volodymyr Zelenskyy sought guarantees at a NATO summit of further Western help to repel Moscow’s invasion. Ru…",
    "link": "https://japantoday.com/category/world/russian-attacks-kill-13-civilians-in-ukraine-as-zelenskyy-seeks-more-western-aid",
    "timestamp": "2025-06-24T21:37:23Z"
  },
  {
    "title": "'Dear Donald.' Trump posts fawning private text from NATO chief on social media",
    "description": "The message started by congratulating Donald Trump on his “decisive action in Iran” and then got even more flattering, gushing about reaching the precipice of achieving “something NO American president in decades could have done.” This wasn't an ardent suppor…",
    "link": "https://japantoday.com/category/world/%27dear-donald.%27-trump-posts-fawning-private-text-from-nato-chief-on-social-media",
    "timestamp": "2025-06-24T21:37:02Z"
  },
  {
    "title": "Trump says whether he'll commit to NATO mutual defense guarantee 'depends on your definition'",
    "description": "U.S. President Donald Trump on Tuesday injected some uncertainty over whether the U.S. would abide by the mutual defense guarantees outlined in the NATO treaty as he headed to its summit — comments that could revive long-standing concern from European allies …",
    "link": "https://japantoday.com/category/world/trump-says-whether-he%27ll-commit-to-nato-mutual-defense-guarantee-%27depends-on-your-definition%27",
    "timestamp": "2025-06-24T21:36:51Z"
  },
  {
    "title": "U.S. intel says strikes did not destroy Iran nuclear program",
    "description": "A classified preliminary U.S. intelligence report has concluded that American strikes on Iran set back Tehran's nuclear program by just a few months -- rather than destroying it as claimed by President Donald Trump. U.S. media on Tuesday cited people familiar…",
    "link": "https://japantoday.com/category/world/us-intel-says-strikes-did-not-destroy-iran-nuclear-program",
    "timestamp": "2025-06-24T21:36:38Z"
  },
  {
    "title": "Iran-Israel ceasefire takes hold as Trump applies pressure",
    "description": "A shaky ceasefire began to take hold between Israel and Iran on Tuesday under pressure from U.S. President Donald Trump, raising hopes for an end to the biggest ever military confrontation between the Middle East arch-foes. Both Iran and Israel sent signals t…",
    "link": "https://japantoday.com/category/world/iran-israel-ceasefire-takes-hold-as-trump-applies-pressure",
    "timestamp": "2025-06-24T21:36:29Z"
  },
  {
    "title": "Fragile Israel-Iran Cease-Fire Holds Despite Shaky Start",
    "description": "After an initial tit-for-tat exchange that enraged U.S. President Donald Trump, the two sides have refrained from further strikes.",
    "link": "http://foreignpolicy.com/2025/06/24/israel-iran-cease-fire-trump-nuclear-weapons/",
    "timestamp": "2025-06-24T21:34:54Z"
  },
  {
    "title": "U.S. strikes on Iran add to global travel disruptions and flight cancellations",
    "description": "The U.S. entry into Israel’s war with Iran caused travel disruptions to pile up globally this week — with flight cancellations continuing Tuesday, even after President Donald Trump claimed a ceasefire was “in effect.” Following unprecedented bombings ordered …",
    "link": "https://japantoday.com/category/features/travel/U.S.-strikes-on-Iran-add-to-global-travel-disruptions-and-flight-cancellations",
    "timestamp": "2025-06-24T21:34:41Z"
  },
  {
    "title": "Trump 'Not Happy' With Israel, Iran for Breaking Ceasefire",
    "description": "\"I'm not happy with Israel,\" US President Donald Trump told reporters on Tuesday. \"I'm not happy with Iran either,\" he added. Israel said a missile had been fired by the Islamic Republic, accusing it of breaching the truce that Trump had declared overnight. I…",
    "link": "https://biztoc.com/x/241f87206d62c8c2",
    "timestamp": "2025-06-24T21:34:11Z"
  },
  {
    "title": "Iranian Nuclear Program Damaged, Not ‘Obliterated’ by U.S. Attack",
    "description": "The bombing of three Iranian nuclear facilities on June 21 by American B-2 aircraft damaged the sites and set back Iran's nuclear enrichment program, but didn't completely destroy the sites or Iran's nuclear capabilities, according to experts we spoke with an…",
    "link": "https://www.factcheck.org/2025/06/iranian-nuclear-program-damaged-not-obliterated-by-u-s-attack/",
    "timestamp": "2025-06-24T21:33:45Z"
  },
  {
    "title": "Trump's Bombing Probably Set Iran's Nuclear Program Back By Mere Months, Report Says",
    "description": "The White House issued a snarky comment saying the assessment was leaked by an \"anonymous, low-level loser.\"",
    "link": "https://www.huffpost.com/entry/trumps-bombing-probably-set-irans-nuclear-program-back-by-mere-months-report-says_n_685b0444e4b04f1da81c663a",
    "timestamp": "2025-06-24T21:33:04Z"
  },
  {
    "title": "Do Israel and Iran know ‘what the f***’ they’re doing now?",
    "description": "Listen to The World with Richard Engel and Yalda Hakim on your podcast app",
    "link": "https://news.sky.com/story/do-israel-and-iran-know-what-the-f-they-re-doing-now-13388198",
    "timestamp": "2025-06-24T21:30:00Z"
  },
  {
    "title": "Stephen Miller Has Financial Stake in Company Helping ICE With Deportations: Report",
    "description": "The president's chief immigration hawk has a substantial amount of stock in Palantir, one of ICE's most prominent contractors",
    "link": "http://www.rollingstone.com/politics/politics-news/stephen-miller-financial-stake-palantir-ice-contractor-1235371343/",
    "timestamp": "2025-06-24T21:28:53Z"
  },
  {
    "title": "Candace Owens Torches Trump: ‘I Feel Embarrassed That I Told People to Go Vote For Him’",
    "description": "Candace Owens hammered President Donald Trump in an interview with Piers Morgan on Tuesday, decrying his handling of the conflict between Israel and Iran and his decision to bomb the latter's nuclear facilities.\nThe post Candace Owens Torches Trump: ‘I Feel E…",
    "link": "https://www.mediaite.com/media/candace-owens-torches-trump-i-feel-embarrassed-that-i-told-people-to-go-vote-for-him/",
    "timestamp": "2025-06-24T21:26:03Z"
  },
  {
    "title": "US strikes did not destroy Iran nuclear programme, says Pentagon assessment",
    "description": "The White House says the initial damage assessment about Iran's uranium stockpile is \"flat-out wrong\".",
    "link": "https://www.bbc.com/news/articles/ckglxwp5x03o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-24T21:25:49Z"
  },
  {
    "title": "The Problem With Trump’s Cease-Fire",
    "description": "Abandoning diplomacy could make Iranian nuclear progress harder to stop.",
    "link": "https://www.theatlantic.com/international/archive/2025/06/problem-with-trumps-ceasefire/683314/",
    "timestamp": "2025-06-24T21:25:22Z"
  },
  {
    "title": "Trump’s Iran Strikes Reveal We’re in a New Era of Manufacturing Consent",
    "description": "Trump’s direct-to-consumer style helps fuel his image as a man with unparalleled control over levers of global power.",
    "link": "https://truthout.org/articles/trumps-iran-strikes-reveal-were-in-a-new-era-of-manufacturing-consent/",
    "timestamp": "2025-06-24T21:25:09Z"
  },
  {
    "title": "Pepperoni, Pre-Strikes, and the Pentagon’s Favorite Pie Shops",
    "description": "Pizza places near the Pentagon got a spike in business over this past week of international warfare – and one social media account may have actually predicted the U.S. bombing of Iran’s nuclear sites.  On Saturday, June 21, at 7:13 p.m. EST – less than an hou…",
    "link": "https://dc.eater.com/restaurant-news/159791/pentagon-pizza-report-papa-johns-president-donald-trump-iran-strike",
    "timestamp": "2025-06-24T21:24:23Z"
  },
  {
    "title": "Notable & Quotable: Robert Kagan",
    "description": "‘Donald Trump has assumed dictatorial control over the nation’s law enforcement.’",
    "link": "https://biztoc.com/x/c5f8cb27d881952e",
    "timestamp": "2025-06-24T21:23:07Z"
  },
  {
    "title": "Tucker Carlson shares eye-popping request from ex-Fox News bosses after ouster",
    "description": "Former Fox News host Tucker Carlson claimed Tuesday that his shock firing wasn't the last of his dealings with the powerful Murdoch family.Fox Corp. Chairman Rupert Murdoch reportedly fired Carlson — arguably the network's biggest star — over his conspiratori…",
    "link": "https://www.rawstory.com/tucker-carlson-2672426836/",
    "timestamp": "2025-06-24T21:21:52Z"
  },
  {
    "title": "US strikes did not destroy Iran nuclear programme, says Pentagon assessment",
    "description": "The White House says the initial damage assessment about Iran's uranium stockpile is \"flat-out wrong\".",
    "link": "https://www.bbc.com/news/articles/ckglxwp5x03o",
    "timestamp": "2025-06-24T21:21:27Z"
  },
  {
    "title": "Rep. Khanna: The Question For The Democratic Party Is, \"Are We Going To Take The Mantle Of Being The Anti-War Party?\"",
    "description": "Rep. Ro Khanna (D-CA), a member of the House Armed Services Committee, on \"Democracy Now!\" criticized President Donald Trump’s decision to bomb Iran’s nuclear sites as \"blatantly unconstitutional\" and a clear instance of executive overreach.\r\n\r\n\"Donald Trump …",
    "link": "https://www.realclearpolitics.com/video/2025/06/24/rep_khanna_the_question_for_the_democratic_party_is_are_we_going_to_take_the_mantle_of_being_the_anti-war_party.html",
    "timestamp": "2025-06-24T21:21:14Z"
  },
  {
    "title": "Report suggests US strikes only set back Iran’s nuclear programme by months",
    "description": "US President Donald Trump had claimed the facilities were ‘obliterated’ in US attacks.",
    "link": "https://www.thejournal.ie/report-us-strikes-only-set-back-irans-nuclear-programme-by-months-6742904-Jun2025/",
    "timestamp": "2025-06-24T21:21:06Z"
  },
  {
    "title": "Tucker Carlson Exposes Murdoch Plot to Take Down Trump — Says They Urged Him to Run Against 45 Right After Axing His Show",
    "description": "Former Fox News host Tucker Carlson has come forward with explosive claims: the Murdoch family — the globalist puppet-masters behind Fox News, The Wall Street Journal, and the New York Post — tried to recruit him to run against President Donald Trump for the …",
    "link": "https://www.thegatewaypundit.com/2025/06/tucker-carlson-exposes-murdoch-plot-take-down-trump/",
    "timestamp": "2025-06-24T21:20:43Z"
  },
  {
    "title": "Usha Vance shares her thoughts on becoming First Lady with Meghan McCain",
    "description": "Meghan McCain sat down with Usha Vance at the Vice President’s residence. With J.D. Vance stretching out a convincing lead in the polls for the 2028 presidential race, Usha Vance shared her thoughts with Meghan McCain on becoming First Lady of the United Stat…",
    "link": "https://pagesix.com/2025/06/24/society/usha-vance-shares-her-thoughts-on-becoming-first-lady-with-meghan-mccain/",
    "timestamp": "2025-06-24T21:20:32Z"
  },
  {
    "title": "Trump asks appeals court to toss $83M judgment he owes E. Jean Carroll (Erica Orden/Politico)",
    "description": "Erica Orden / Politico:\nTrump asks appeals court to toss $83M judgment he owes E. Jean Carroll  —  He wants the defamation judgment thrown out on the basis of presidential immunity.  —  NEW YORK — Donald Trump waged his latest courtroom bid Tuesday to avoid p…",
    "link": "https://www.memeorandum.com/250624/p127",
    "timestamp": "2025-06-24T21:20:01Z"
  },
  {
    "title": "Trump Claims Iran Nuclear Sites ‘Totally Destroyed’—But That Clashes With Vance And U.S. Intelligence",
    "description": "Trump claimed Iran’s nuclear sites sustained “monumental damage,” while other administration officials say an assessment is ongoing.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/06/24/did-the-us-destroy-irans-uranium-supply-or-not-vance-experts-clash-with-trumps-claims/",
    "timestamp": "2025-06-24T21:17:36Z"
  },
  {
    "title": "Israel and Iran trade strikes, ceasefire goes into effect (June 24 updates)",
    "description": "Israel and Iran traded strikes hours before and after a ceasefire brokered by the US went into effect. President Donald Trump castigated both sides for violating the agreement, and a tentative truce has held since the rebuke. \nThe post Israel and Iran trade s…",
    "link": "https://www.longwarjournal.org/archives/2025/06/israel-and-iran-trade-strikes-ceasefire-goes-into-effect-june-24-updates.php",
    "timestamp": "2025-06-24T21:16:31Z"
  },
  {
    "title": "Trump Administration Will Help Fund Florida's $450 Million 'Alligator Alcatraz' and Other Migrant Detention Facilities",
    "description": "The Florida attorney general stated that the facilities will add 5,000 beds and be operational as early as the first week of July.",
    "link": "https://reason.com/2025/06/24/trump-administration-will-help-fund-floridas-450-million-alligator-alcatraz-and-other-migrant-detention-facilities/",
    "timestamp": "2025-06-24T21:14:41Z"
  },
  {
    "title": "Trump Says He Will Likely Meet with Zelensky at NATO Summit",
    "description": "President Donald Trump said Tuesday that he would likely meet with Ukrainian President Volodymyr Zelensky during the NATO Summit in the Hague, Netherlands.\nThe post Trump Says He Will Likely Meet with Zelensky at NATO Summit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/24/trump-says-he-will-likely-meet-with-zelensky-at-nato-summit/",
    "timestamp": "2025-06-24T21:12:44Z"
  },
  {
    "title": "GOP rep scrambles on CNN to defend Trump’s Iran claims: 'Matter of semantics'",
    "description": "Rep. Michael McCaul (R-TX) tried to deflect on CNN when confronted with newly revealed intelligence that President Donald Trump's strike on Iranian nuclear sites barely affected the viability of their nuclear program — a report the White House has vehemently …",
    "link": "https://www.rawstory.com/michael-mccaul/",
    "timestamp": "2025-06-24T21:12:24Z"
  },
  {
    "title": "API CHIEF: New Records in Fracking Help Achieve Energy Independence",
    "description": "The \"fracking revolution\" in the U.S. oil and gas industry has reached a new milestone, with the American Petroleum Institute (API) announcing an incredible new record during a Tuesday event with Breitbart News and Energy Secretary Chris Wright.\nThe post API …",
    "link": "https://www.breitbart.com/politics/2025/06/24/api-chief-new-records-in-fracking-help-achieve-energy-independence/",
    "timestamp": "2025-06-24T21:11:55Z"
  },
  {
    "title": "American Petroleum Institute President: Durable Permit Reform Will Cement America's Energy Dominance",
    "description": "Mike Sommers, president and CEO of the American Petroleum Institute, said at a policy event hosted by Breitbart News that durable, bipartisan permitting reform will help cement America's energy dominance.\nThe post American Petroleum Institute President: Durab…",
    "link": "https://www.breitbart.com/politics/2025/06/24/american-petroleum-institute-president-durable-permit-reform-will-cement-americas-energy-dominance/",
    "timestamp": "2025-06-24T21:11:43Z"
  },
  {
    "title": "Shane Gillis to host 2025 ESPYs years after being fired from SNL over racist comments. What to know",
    "description": "Controversial comedian is about to emcee one of the biggest nights in sports",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/shane-gillis-espy-host-controversy-b2776113.html",
    "timestamp": "2025-06-24T21:11:18Z"
  },
  {
    "title": "White House responds to new developments in probe of SJSU trans athlete allegedly conspiring to harm teammate",
    "description": "The White House responded to reporting on allegations against trans volleyball player Blaire Fleming as Trump commits to ending men in women's sports.",
    "link": "https://www.foxnews.com/sports/white-house-responds-new-developments-probe-sjsu-trans-athlete-allegedly-conspiring-harm-teammate",
    "timestamp": "2025-06-24T21:11:15Z"
  },
  {
    "title": "“Flying into another big success”: Trump posts adoring message from NATO official",
    "description": "Trump shared a message from Mark Rutte, in which the NATO head effusively praised his \"decisive action in Iran\"",
    "link": "https://www.salon.com/2025/06/24/flying-into-another-big-success-trump-posts-adoring-message-from-nato-official/",
    "timestamp": "2025-06-24T21:10:46Z"
  },
  {
    "title": "Japan bishops on nuclear bombs: ‘This tragedy must not be repeated’",
    "description": "Mass at a cathedral in Nagasaki, Japan, after the U.S. dropped a nuclear weapon on the city in August of 1945. The Japanese bishops asked for international nuclear disarmament in a June 20, 2025, letter. / Credit: Nagasaki City Office (長崎市役所), Public domain, …",
    "link": "https://www.catholicnewsagency.com/news/264973/japan-bishops-on-nuclear-bombs-this-tragedy-must-not-be-repeated",
    "timestamp": "2025-06-24T21:07:00Z"
  },
  {
    "title": "Trump Plays Deft Hand With Iran-Israel Ceasefire But Doubts Remain",
    "description": "With his surprise announcement of a ceasefire between Israel and Iran, US President Donald Trump has turned his flair for social media into diplomatic deftness, despite continued uncertainty in the Middle East.",
    "link": "https://www.ibtimes.com/trump-plays-deft-hand-iran-israel-ceasefire-doubts-remain-3776742",
    "timestamp": "2025-06-24T21:06:31Z"
  },
  {
    "title": "Trump Plays Deft Hand With Iran-Israel Ceasefire But Doubts Remain",
    "description": "With his surprise announcement of a ceasefire between Israel and Iran, US President Donald Trump has turned his flair for social media into diplomatic deftness, despite continued uncertainty in the Middle East.",
    "link": "https://www.ibtimes.com.au/trump-plays-deft-hand-iran-israel-ceasefire-doubts-remain-1859377",
    "timestamp": "2025-06-24T21:06:17Z"
  },
  {
    "title": "US strikes may have set back Iran nuclear programme only months, intelligence report says",
    "description": "WASHINGTON: A preliminary US intelligence assessment has determined that US strikes over the weekend on Iranian nuclear facilities have set back Tehran's programme by only",
    "link": "https://www.channelnewsasia.com/world/us-strikes-may-have-set-back-iran-nuclear-programme-only-months-intelligence-report-says-5201536",
    "timestamp": "2025-06-24T21:06:00Z"
  },
  {
    "title": "US strikes may have set back Iran nuclear program only months, sources say",
    "description": "WASHINGTON: A preliminary US intelligence assessment has determined that US strikes over the weekend on Iranian nuclear facilities have set back Tehran's program by only a",
    "link": "https://www.channelnewsasia.com/world/us-strikes-may-have-set-back-iran-nuclear-program-only-months-sources-say-5201536",
    "timestamp": "2025-06-24T21:06:00Z"
  },
  {
    "title": "US strikes may have set back Iran nuclear programme only months, sources say",
    "description": "WASHINGTON: A preliminary US intelligence assessment has determined that US strikes over the weekend on Iranian nuclear facilities have set back Tehran's programme by only",
    "link": "https://www.channelnewsasia.com/world/us-strikes-may-have-set-back-iran-nuclear-programme-only-months-sources-say-5201536",
    "timestamp": "2025-06-24T21:06:00Z"
  },
  {
    "title": "Trump lashes Israel again amid fragile ceasefire with Iran",
    "description": "After a foul-mouthed tirade against the warring countries, an increasingly frustrated Trump has scolded the US ally once more.",
    "link": "https://7news.com.au/news/trump-lashes-israel-again-amid-fragile-ceasefire-with-iran-c-19144183",
    "timestamp": "2025-06-24T21:05:06Z"
  },
  {
    "title": "Early US intel assessment finds strikes set back Iran's nuclear program only by months (ABC News)",
    "description": "ABC News:\nEarly US intel assessment finds strikes set back Iran's nuclear program only by months  —  It's at odds with President Trump's claim it was “obliterated.”  —  President Donald Trump speaks to reporters about the Israel-Iran conflict, aboard Air Forc…",
    "link": "https://www.memeorandum.com/250624/p124",
    "timestamp": "2025-06-24T21:05:01Z"
  },
  {
    "title": "Donald Trump Nobel Peace Prize Nomination Withdrawn (Ellie Cook/Newsweek)",
    "description": "Ellie Cook / Newsweek:\nDonald Trump Nobel Peace Prize Nomination Withdrawn  —  A senior Ukrainian lawmaker who nominated U.S. President Donald Trump for a Nobel Peace Prize has withdrawn it, as peace talks between Kyiv and Moscow slip under the radar and the …",
    "link": "https://www.memeorandum.com/250624/p123",
    "timestamp": "2025-06-24T21:05:01Z"
  },
  {
    "title": "More Russians warming to US – poll",
    "description": "A new survey suggests that Russians’ opinion of the US is improving, but still negative overall Read Full Article at RT.com",
    "link": "https://www.rt.com/business/620449-russians-us-attitude-poll/",
    "timestamp": "2025-06-24T21:05:00Z"
  },
  {
    "title": "Nukes, negotiations and malign neglect: What's comes next after the Iran-Israel war",
    "description": "The current question facing both Israel and the U.S. is how to turn the cease-fire into a longer-term solution to the underlying problem. Here's how U.S. President Donald Trump and Prime Minister Benjamin Netanyahu should approach Tehran",
    "link": "https://www.haaretz.com/opinion/2025-06-25/ty-article-opinion/.premium/nukes-negotiations-and-malign-neglect-whats-comes-next-after-the-iran-israel-war/00000197-a3a8-d5d0-a7b7-b3e896cd0000",
    "timestamp": "2025-06-24T21:04:10Z"
  },
  {
    "title": "New U.S. intelligence report suggests Iran’s nuclear program only set back by months after strikes",
    "description": "The report found that while the Saturday strikes at the Fordo, Natanz and Isfahan nuclear sites did significant damage, they were not \"completely and totally obliterated,\" as Trump said.",
    "link": "https://www.pbs.org/newshour/politics/new-u-s-intelligence-report-suggests-irans-nuclear-program-only-set-back-by-months-after-strikes",
    "timestamp": "2025-06-24T21:01:45Z"
  },
  {
    "title": "Early US intelligence report suggests US strikes only set back Iran’s nuclear program by months",
    "description": "The report found that the Fordo, Natanz and Isfahan nuclear sites were not totally destroyed.",
    "link": "https://www.denverpost.com/2025/06/24/us-intelligence-iran-strikes/",
    "timestamp": "2025-06-24T21:01:36Z"
  },
  {
    "title": "Early US intelligence report suggests US strikes only set back Iran’s nuclear program by months",
    "description": "The report found that the Fordo, Natanz and Isfahan nuclear sites were not totally destroyed.",
    "link": "https://www.bostonherald.com/2025/06/24/us-intelligence-iran-strikes/",
    "timestamp": "2025-06-24T21:01:36Z"
  },
  {
    "title": "Trump is trying to script the perfect ending to war in Iran. Will the rest of the world go along? (Chris Megerian/Associated Press)",
    "description": "Chris Megerian / Associated Press:\nTrump is trying to script the perfect ending to war in Iran.  Will the rest of the world go along?  —  President Donald Trump wanted the brief and explosive American intervention in the Middle East to end with the satisfying…",
    "link": "https://www.memeorandum.com/250624/p122",
    "timestamp": "2025-06-24T21:00:04Z"
  },
  {
    "title": "Inside Economics: Why do we need more migrants when there are 200,000 people on the dole? Plus the lessons from the Iran conflict",
    "description": "ANALYSIS: We already know what happens to NZ's economy when the borders are closed.",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-why-did-we-need-more-migrants-when-there-are-200000-people-on-the-doleplus-lessons-from-iran-conflict/6ZSGLSMIKZDJFGDAICMZIYJXVU/",
    "timestamp": "2025-06-24T21:00:00Z"
  },
  {
    "title": "Stephen Miller Owns Up to $250,000 in Palantir Stock, Report Finds",
    "description": "Palantir is reportedly building a mega-database of Americans’ personal information for the Trump administration.",
    "link": "https://truthout.org/articles/stephen-miller-owns-up-to-250000-in-palantir-stock-report-finds/",
    "timestamp": "2025-06-24T20:59:54Z"
  },
  {
    "title": "JENNY BETH MARTIN: Bombing Iran’s Nuclear Facilities Is ‘America First’",
    "description": "President Trump’s decision to bomb Iran’s nuclear facilities is as “America First” as it gets – especially in the wake of the agreement between Israel and Iran to enter into a ceasefire. With one decisive blow, Trump acted to prevent a major American adversar…",
    "link": "https://dailycaller.com/2025/06/24/opinion-bombing-irans-nuclear-facilities-is-america-first-jenny-beth-martin/",
    "timestamp": "2025-06-24T20:59:33Z"
  },
  {
    "title": "Trump’s foul-mouthed fury at faltering Iran-Israel ceasefire",
    "description": "Donald Trump had some choice words for Israel and Iran after the ceasefire he announced was broken almost immediately, and Sussan Ley is bringing the Coalition back to the National Press Club.\nThe post Trump’s foul-mouthed fury at faltering Iran-Israel ceasef…",
    "link": "http://www.crikey.com.au/2025/06/25/donald-trump-israel-iran-ceasefire-sussan-ley-national-press-club/",
    "timestamp": "2025-06-24T20:59:28Z"
  },
  {
    "title": "The Latest: Shaky ceasefire between Israel and Iran appears to hold",
    "description": "U.S. President Donald Trump claimed a ceasefire between Iran and Israel was “in effect” on Tuesday, after expressing deep frustration with both sides and accusing them of violating the agreement he brokered. Israel earlier accused Iran of launching missiles i…",
    "link": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-24-2025-ba92f3cd565d6ae3bce8e46a54dd6cbf",
    "timestamp": "2025-06-24T20:58:31Z"
  },
  {
    "title": "Pentagon's Own Report Determined Iran's Nuclear Sites Were Just Damaged Despite Trump Insisting They Were 'Obliterated': Report",
    "description": "A Pentagon report revealed that the Iranian nuclear facilities struck by the US were damaged but not obliterated, contradicting assertions made by Donald Trump.",
    "link": "https://www.ibtimes.com/pentagons-own-report-determined-irans-nuclear-sites-were-just-damaged-despite-trump-insisting-3776737",
    "timestamp": "2025-06-24T20:58:14Z"
  },
  {
    "title": "Trump's Approval Rating Keeps Sliding With Millennials: Polls",
    "description": "In a new poll on Tuesday, Trump's approval rating with millennial U.S. adults dropped four points from the previous week.",
    "link": "https://www.newsweek.com/trumps-approval-rating-keeps-sliding-millennials-polls-2090232",
    "timestamp": "2025-06-24T20:57:06Z"
  },
  {
    "title": "Tariffs Likely to ‘Weigh on Economic Activity’ Fed Chair Says",
    "description": "The Federal Reserve wants more time to study the impact of tariffs before cutting rates. [contact-form-7] That’s according to Jerome Powell, the central bank’s chair, testifying Tuesday (June 24) that the Fed needs to see if tariffs push inflation higher befo…",
    "link": "http://www.pymnts.com/economy/2025/tariffs-likely-to-weigh-on-economic-activity-fed-chair-says/",
    "timestamp": "2025-06-24T20:56:39Z"
  },
  {
    "title": "Pentagon Report Finds Iran’s Nuclear Program Probably Only Set Back a Few Months",
    "description": "The Trump administration insists U.S. strikes \"obliterated\" Iran's nuclear program. Early assessments reportedly say that's not the case",
    "link": "http://www.rollingstone.com/politics/politics-news/iran-nuclear-program-set-back-months-pentagon-1235371286/",
    "timestamp": "2025-06-24T20:56:02Z"
  },
  {
    "title": "Republican busts 'big lies' behind GOP megabill on MAGA-friendly podcast",
    "description": "Rep. Thomas Massie (R-KY) has become a thorn in President Donald Trump's side as the president attempts to usher his spending and tax bill through Congress. Known as the \"One Big, Beautiful Bill Act,\" the megabill could make wide-ranging changes to U.S. fisca…",
    "link": "https://www.rawstory.com/thomas-massie-2672426739/",
    "timestamp": "2025-06-24T20:55:29Z"
  },
  {
    "title": "Trump administration ordered to fix yet another illegal removal of immigrant",
    "description": "Just when the Trump administration might’ve thought it was out of having to rectify its illegal removals of immigrants, yet another court pulled it back into compliance.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-ordered-fix-another-illegal-removal-immigrant-rcna214808",
    "timestamp": "2025-06-24T20:54:00Z"
  },
  {
    "title": "Fox News Host Declares Trump Presidency ‘On the Level of Mount Rushmore’",
    "description": "Fox's Will Cain began Tuesday's episode of The Will Cain Show by suggesting that President Donald Trump should be immortalized in Mount Rushmore fashion.\nThe post Fox News Host Declares Trump Presidency ‘On the Level of Mount Rushmore’ first appeared on Media…",
    "link": "https://www.mediaite.com/media/tv/fox-news-host-declares-trump-presidency-on-the-level-of-mount-rushmore/",
    "timestamp": "2025-06-24T20:53:58Z"
  },
  {
    "title": "Tuesday, June 24. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,217.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/06/24/tuesday-june-24-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-06-24T20:53:50Z"
  },
  {
    "title": "Purple Heart Army Veteran Forced To Self-Deport After ICE Order",
    "description": "Sae Joon Park, 55, who’s lived in the U.S. since age 7, was reportedly deported Monday to South Korea over a 2009 drug conviction he says was tied to his PTSD.",
    "link": "https://www.huffpost.com/entry/purple-heart-army-veteran-forced-to-self-deport_n_685aba3ce4b0ede248bacec0",
    "timestamp": "2025-06-24T20:53:07Z"
  },
  {
    "title": "How changes to Medicaid in the federal budget could affect Maine",
    "description": "State officials, health care providers and advocates say the proposed cuts would have drastic consequences.",
    "link": "http://www.bangordailynews.com/2025/06/24/state/state-health/how-changes-to-medicaid-in-the-federal-budget-could-affect-maine/",
    "timestamp": "2025-06-24T20:53:02Z"
  },
  {
    "title": "Israel bombed an Iraqi nuclear reactor in 1981 − it pushed program underground and spurred Saddam Hussein’s desire for nukes",
    "description": "Nonproliferation experts believe Iraq’s nuclear program went underground after Israel destroyed its reactor just outside Baghdad.",
    "link": "https://theconversation.com/israel-bombed-an-iraqi-nuclear-reactor-in-1981-it-pushed-program-underground-and-spurred-saddam-husseins-desire-for-nukes-259618",
    "timestamp": "2025-06-24T20:52:32Z"
  },
  {
    "title": "Guests descend on Venice for Bezos's £41m wedding - amid last-minute change after protests",
    "description": "Guests have begun arriving in Venice for Amazon founder Jeff Bezos's multimillion-pound wedding, which has had to find a new venue.",
    "link": "https://news.sky.com/story/guests-descend-on-venice-for-jeff-bezos-wedding-amid-last-minute-change-after-protests-13388179",
    "timestamp": "2025-06-24T20:52:00Z"
  },
  {
    "title": "US Intel Says Strikes Did Not Destroy Iran Nuclear Program",
    "description": "A classified preliminary US intelligence report has concluded that American strikes on Iran set back Tehran's nuclear program by just a few months -- rather than destroying it as claimed by President Donald Trump.",
    "link": "https://www.ibtimes.com/us-intel-says-strikes-did-not-destroy-iran-nuclear-program-3776735",
    "timestamp": "2025-06-24T20:51:19Z"
  },
  {
    "title": "Trump knows he did Israel a huge favor in Iran. Will Netanyahu pay back with a Gaza deal?",
    "description": "Netanyahu's standing has risen, and polls show votes shifting from the far right back to Likud. This may give Netanyahu greater room to maneuver",
    "link": "https://www.haaretz.com/israel-news/2025-06-24/ty-article/.premium/trump-knows-he-did-israel-a-huge-favor-in-iran-will-netanyahu-pay-back-with-a-gaza-deal/00000197-a349-d5d0-a7b7-b3e9d1f80000",
    "timestamp": "2025-06-24T20:50:50Z"
  },
  {
    "title": "US strikes may have set back Iran nuclear program only months, sources say",
    "description": "WASHINGTON (Reuters) -A preliminary U.S. intelligence assessment has determined that U.S. strikes over the weekend on Iranian nuclear facilities have set back Tehran's program by only a matter of months, three sources with knowledge of the matter told Reuters…",
    "link": "https://www.thestar.com.my/news/world/2025/06/25/us-strikes-may-have-set-back-iran-nuclear-program-only-months-sources-say",
    "timestamp": "2025-06-24T20:48:00Z"
  },
  {
    "title": "Trump Complains Biden Let Thunderstorms Into the U.S. (Will Neal/The Daily Beast)",
    "description": "Will Neal / The Daily Beast:\nTrump Complains Biden Let Thunderstorms Into the U.S.  —  FORCE OF NATURE  —  The president made an embarrassing flub aboard Air Force One while en route to a summit where he will discuss mounting global instability with other NAT…",
    "link": "https://www.memeorandum.com/250624/p119",
    "timestamp": "2025-06-24T20:45:00Z"
  }
]