[
  {
    "title": "Trump Says Venezuelan Airspace Closed Off",
    "description": "President Donald Trump warned airlines and pilots Saturday to stay away from Venezuelan skies. This follows weeks of military buildup in Latin American waters.",
    "link": "https://dailycaller.com/2025/11/29/trump-closes-venezuelan-airspace-drug-trafficking/",
    "timestamp": "2025-11-29T16:51:11Z"
  },
  {
    "title": "Consider airspace around Venezuela closed, Trump says",
    "description": "The US cannot legally close another country's airspace, but Trump's comments could deter airlines from operating in Venezuela.",
    "link": "https://www.bbc.com/news/articles/c741mpdyw9no",
    "timestamp": "2025-11-29T16:43:24Z"
  },
  {
    "title": "Letitia James faces new headache after court victory",
    "description": "Letitia James celebrated a significant legal victory this week when a federal judge dismissed criminal charges against her, but the New York attorney general’s troubles aren’t over yet. A conservative advocacy group filed a bar complaint against her on Friday…",
    "link": "https://rollingout.com/2025/11/29/letitia-james-bar-complaint-mortgage/",
    "timestamp": "2025-11-29T16:42:34Z"
  },
  {
    "title": "Powerful Republican Turns on Pentagon Pete’s ‘Kill’ Orders",
    "description": "Secretary of Defense Pete Hegseth’s alleged order to “kill” everyone aboard a suspected Venezuelan drug boat is slated to face intense oversight by the...",
    "link": "https://www.thedailybeast.com/powerful-republican-turns-on-pentagon-petes-kill-orders/",
    "timestamp": "2025-11-29T16:37:28Z"
  },
  {
    "title": "Trump to pardon former Honduran president convicted for cocaine trafficking—while U.S. military attacks suspected drug boats",
    "description": "President Donald Trump said Friday that he will be pardoning former Honduran President Juan Orlando Hernandez, who in 2024 was convicted for drug trafficking and weapons charges and sentenced to 45 years in prison.\nThe president explained his decision on soci…",
    "link": "https://biztoc.com/x/ee91233579edb603",
    "timestamp": "2025-11-29T16:35:17Z"
  },
  {
    "title": "Trump orders total shutdown of Venezuelan Airspace: Will the US also block land and sea routes?",
    "description": "US President Donald Trump has announced a complete closure of the airspace over and around Venezuela, marking a sharp escalation in the ongoing stand-off between Washington and Caracas.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-orders-total-shutdown-of-venezuelan-airspace-will-the-us-also-block-land-and-sea-routes/articleshow/125660492.cms",
    "timestamp": "2025-11-29T16:31:45Z"
  },
  {
    "title": "Katie Miller Straight-Up Asks Abby Phillip If She Thinks Trump Chief Husband Stephen ‘Is A Nazi’ In CNN Brawl",
    "description": "Katie Miller straight-up asked CNN anchor Abby Phillip if she thinks her husband — Trump Deputy Chief of Staff Stephen Miller — \"is a Nazi.\"\nThe post Katie Miller Straight-Up Asks Abby Phillip If She Thinks Trump Chief Husband Stephen ‘Is A Nazi’ In CNN Brawl…",
    "link": "https://www.mediaite.com/media/news/katie-miller-straight-up-asks-abby-phillip-if-she-thinks-trump-chief-husband-stephen-is-a-nazi-in-cnn-brawl/",
    "timestamp": "2025-11-29T16:25:54Z"
  },
  {
    "title": "Trump to pardon former Honduran president convicted for cocaine trafficking—while U.S. military attacks suspected drug boats",
    "description": "The post was part of a broader message by Trump backing Nasry “Tito” Asfura for Honduras' presidency.",
    "link": "https://fortune.com/2025/11/29/trump-pardon-former-honduran-president-juan-orlando-hernandez-cocaine-trafficking-venezuela-suspected-drug-boats/",
    "timestamp": "2025-11-29T16:24:54Z"
  },
  {
    "title": "Trump and Maduro Spoke by Phone Last Week",
    "description": "State of the Union: The leaders discussed the possibility of meeting in the United States.\nThe post Trump and Maduro Spoke by Phone Last Week appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-and-maduro-spoke-by-phone-last-week/",
    "timestamp": "2025-11-29T16:21:24Z"
  },
  {
    "title": "'CLOSED IN ITS ENTIRETY:' Trump issues warning on Venezuelan airspace",
    "description": "President Donald Trump warned pilots on Saturday that the airspace surrounding Venezuela should be considered completely closed amid escalating tensions with the Latin American country.",
    "link": "https://www.wcvb.com/article/closed-in-its-entirety-trump-issues-new-warning-on-venezuelan-airspace/69581165",
    "timestamp": "2025-11-29T16:14:37Z"
  },
  {
    "title": "'CLOSED IN ITS ENTIRETY:' Trump issues warning on Venezuelan airspace",
    "description": "President Donald Trump warned pilots on Saturday that the airspace surrounding Venezuela should be considered completely closed amid escalating tensions with the Latin American country.",
    "link": "https://www.wgal.com/article/closed-in-its-entirety-trump-issues-new-warning-on-venezuelan-airspace/69581165",
    "timestamp": "2025-11-29T16:14:12Z"
  },
  {
    "title": "Trump Declares Venezuelan Airspace Closed - The New York Times",
    "description": "Trump Declares Venezuelan Airspace ClosedThe New York Times Trump tells airlines to consider Venezuelan airspace closedFox Business Venezuela revokes flight rights for six airlines as tensions with US escalateReuters LIVE: Donald Trump says Venezuela airspace…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180238523",
    "timestamp": "2025-11-29T16:13:11Z"
  },
  {
    "title": "Since Trump’s Return, Bets on His Brand Have Soured",
    "description": "",
    "link": "https://biztoc.com/x/e28b5c74c9321ca3",
    "timestamp": "2025-11-29T16:12:54Z"
  },
  {
    "title": "Nationwide Raids Nab 250 Foreign CDL Truck Drivers — DHS Warns Cartel Exploitation Threatens Homeland Security",
    "description": "Federal and state authorities arrested nearly 250 foreign commercial truck drivers in November alone, warning that cartel operatives and foreign nationals are exploiting America’s commercial driver licensing system to infiltrate freight corridors and endanger…",
    "link": "https://freerepublic.com/focus/f-news/4355168/posts",
    "timestamp": "2025-11-29T16:06:38Z"
  },
  {
    "title": "Capehart: Trump Immigration Crackdown Hurts Security, Alleged Shooter 'Was Helping Us' in Afghanistan",
    "description": "On Friday’s “PBS NewsHour,” MS NOW host Jonathan Capehart stated that President Donald Trump’s recent immigration cutoffs will “hurt America’s national security. This perpetrator worked with the CIA in Afghanistan with the United States. And we all know what …",
    "link": "https://www.breitbart.com/clips/2025/11/29/capehart-trump-immigration-crackdown-hurts-security-alleged-shooter-was-helping-us-in-afghanistan/",
    "timestamp": "2025-11-29T16:00:44Z"
  },
  {
    "title": "Syracuse Student Columnist Calls Thanksgiving ‘Celebration of Genocide’",
    "description": "\"Without genocide, the foundation of our traditional American identity falls apart\"\nThe post Syracuse Student Columnist Calls Thanksgiving ‘Celebration of Genocide’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/syracuse-student-columnist-calls-thanksgiving-celebration-of-genocide/",
    "timestamp": "2025-11-29T16:00:35Z"
  },
  {
    "title": "Michael Chandler explains why Conor McGregor fight at the White House is a must-win for him",
    "description": "Michael Chandler might get his wish to face Conor McGregor at the UFC White House card in 2026 but if that fight gets made official, the pressure immediately starts to mount. Now that’s not just because the former Bellator lightweight champion is currently su…",
    "link": "https://www.mmafighting.com/ufc/404962/michael-chandler-explains-why-conor-mcgregor-fight-at-the-white-house-is-a-must-win-for-him",
    "timestamp": "2025-11-29T16:00:00Z"
  },
  {
    "title": "Trump’s “Golden Era” or Golden Shower? Job Market Chaos, Farmers Going Bankrupt… Poverty in America",
    "description": "Trump is clearly a ‘Globalist’ who is pushing part of the World Economic Forum’s (WEF) “You will own nothing and be happy” agenda by floating the idea of a 50-Year mortgage which is worse than the old-standard 30-year mortgage. Yes, …\nThe post Trump’s “Golden…",
    "link": "https://www.globalresearch.ca/trump-golden-era-golden-shower/5907290",
    "timestamp": "2025-11-29T15:58:21Z"
  },
  {
    "title": "Patel's gallivanting with his girlfriend has earned him a new nickname at the FBI: insider",
    "description": "Before getting around to describing FBI Director Kash Patel tenure at the law enforcement agency as a “dumpster fire,” former FBI Special Agent Christopher O’Leary claimed the Donald Trump appointee has been bestowed with a new nickname behind his back at hea…",
    "link": "https://www.rawstory.com/patel-travel/",
    "timestamp": "2025-11-29T15:58:21Z"
  },
  {
    "title": "Donald Trump says airspace above and around Venezuela is closed - The Guardian",
    "description": "Donald Trump says airspace above and around Venezuela is closedThe Guardian Trump Declares Venezuelan Airspace ClosedThe New York Times Trump tells airlines Venezuela's airspace is 'closed in its entirety' as tensions riseNBC News Venezuela revokes flight rig…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180238457",
    "timestamp": "2025-11-29T15:53:00Z"
  },
  {
    "title": "US FDA memo links 10 child deaths to Covid vaccines, reports",
    "description": "During Trump's first term, when the pandemic erupted, and under his successor Joe Biden, US health officials strongly endorsed the vaccines as lifesaving.",
    "link": "https://indianexpress.com/article/world/us-fda-memo-links-10-child-deaths-to-covid-vaccines-reports-10393418/",
    "timestamp": "2025-11-29T15:49:56Z"
  },
  {
    "title": "President Trump: Consider Venezuelan Airspace 'Closed in Its Entirety'",
    "description": "President Donald Trump announced Saturday that airlines and pilots should consider the airspace over Venezuela to be shut down.\nThe post President Trump: Consider Venezuelan Airspace ‘Closed in Its Entirety’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/29/president-trump-consider-venezuelan-airspace-closed-in-its-entirety/",
    "timestamp": "2025-11-29T15:48:38Z"
  },
  {
    "title": "ICE Is Targeting Workers. Here’s How Employers and Unions Are Fighting Back.",
    "description": "These are the tactics farms, factories, restaurants, and other job sites are using to shield employees from ICE raids.",
    "link": "https://capitalandmain.com/how-employers-and-labor-groups-are-trying-to-protect-workers-from-ice",
    "timestamp": "2025-11-29T15:43:58Z"
  },
  {
    "title": "Jan. 6 Cop Fanone Torpedoes CNN’s Scott Jennings — Says He ‘Does Not Deserve A Platform!’",
    "description": "Michael Fanone ripped Scott Jennings, saying that he \"does not deserve a platform\" because he believes Jennings frequently lies in defense of Trump.\nThe post Jan. 6 Cop Fanone Torpedoes CNN’s Scott Jennings — Says He ‘Does Not Deserve A Platform!’ first appea…",
    "link": "https://www.mediaite.com/media/tv/jan-6-cop-fanone-torpedoes-cnns-scott-jennings/",
    "timestamp": "2025-11-29T15:42:52Z"
  },
  {
    "title": "China-US trade war yields unprecedented Asian partnership",
    "description": "The Thai king’s historic China visit signals Bangkok’s deeper embrace of Beijing in a shifting global order Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628669-china-thailand-royal-visit/",
    "timestamp": "2025-11-29T15:35:19Z"
  },
  {
    "title": "Trump Offer? Recognize Crimea to End War?",
    "description": "The United States is reportedly prepared to recognize Russia's control over Crimea and other Ukrainian territories currently occupied by Russian forces as part of a proposed peace deal to end the nearly four-year war. The move would mark a major shift in long…",
    "link": "https://freerepublic.com/focus/f-news/4355163/posts",
    "timestamp": "2025-11-29T15:34:44Z"
  },
  {
    "title": "Trump Offer? Recognize Crimea to End War?",
    "description": "The United States is reportedly prepared to recognize Russia's control over Crimea and other Ukrainian territories currently occupied by Russian forces as part of a proposed peace deal to end the nearly four-year war. The move would mark a major shift in long…",
    "link": "https://freerepublic.com/focus/f-chat/4355163/posts",
    "timestamp": "2025-11-29T15:34:44Z"
  },
  {
    "title": "Trump Declares Venezuelan Airspace ‘Closed’ in Fiery Post",
    "description": "\"...please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY!\"\nThe post Trump Declares Venezuelan Airspace ‘Closed’ in Fiery Post first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-declares-venezuelan-airspace-closed-in-fiery-post/",
    "timestamp": "2025-11-29T15:33:52Z"
  },
  {
    "title": "White House blasts Boston Globe, CBS News and The Independent for coverage of 'illegal orders' video",
    "description": "Last week, six Democrats with military or national security experience, released a video reminding service members they have the right to refuse illegal orders.",
    "link": "https://www.cnbc.com/2025/11/29/white-house-blasts-news-outlets-for-coverage-of-illegal-orders-video.html",
    "timestamp": "2025-11-29T15:32:44Z"
  },
  {
    "title": "JONATHAN TURLEY: Wasserman Schultz blames Trump, guns for DC attack, but spares Biden",
    "description": "Rep. Wasserman Schultz sparks outrage by blaming Trump for National Guard shooting instead of the actual attacker in controversial CNN interview.",
    "link": "https://www.foxnews.com/opinion/jonathan-turley-wasserman-schultz-blames-trump-guns-dc-attack-spares-biden",
    "timestamp": "2025-11-29T15:30:15Z"
  },
  {
    "title": "Trump trashed chip act then bought Intel stake",
    "description": "When President Donald Trump stood before Congress in March to denounce the Creating Helpful Incentives to Produce Semiconductors and Science Act of 2022, he minced no words. The legislation, passed under President Joe Biden, amounted to little more than a dis…",
    "link": "https://rollingout.com/2025/11/29/trump-slams-chip-law-then-bought-intel/",
    "timestamp": "2025-11-29T15:30:12Z"
  },
  {
    "title": "Trump Says Airspace Above and Around Venezuela Should Be Closed",
    "description": "WASHINGTON, Nov 29 (Reuters) – U.S. President Donald Trump said on Saturday that the airspace above and surrounding Venezuela should be considered “closed in its entirety”, but... Read More\nThe post Trump Says Airspace Above and Around Venezuela Should Be Clo…",
    "link": "https://www.dailysignal.com/2025/11/29/trump-says-airspace-above-and-around-venezuela-should-be-closed/",
    "timestamp": "2025-11-29T15:30:00Z"
  },
  {
    "title": "WSJ Bombshell: Trump Chiefs Met With Putin Honcho On Peace Plan To Access Billions Frozen In Europe",
    "description": "Steve Witkoff and Jared Kushner met with Kirill Dmitriev to hammer out a peace deal that would unlock hundreds of billions in funds frozen in Europe\nThe post WSJ Bombshell: Trump Chiefs Met With Putin Honcho On Peace Plan To Access Billions Frozen In Europe f…",
    "link": "https://www.mediaite.com/media/news/wsj-bombshell-trump-chiefs-met-with-putin-honcho-on-peace-plan-to-access-billions-frozen-in-europe/",
    "timestamp": "2025-11-29T15:26:24Z"
  },
  {
    "title": "Russian attacks kill 3 in Kyiv as Ukrainian delegation travels to U.S.",
    "description": "Russian drone and missile attacks in and around the Ukrainian capital killed at least three people early Saturday, officials said.",
    "link": "https://www.cbsnews.com/news/russia-ukraine-war-peace-talks-delegation-washington/",
    "timestamp": "2025-11-29T15:25:58Z"
  },
  {
    "title": "Trump’s $2 Trillion Plan to Cash in on Ukraine ‘Peace’ Leaks",
    "description": "At the center of President Trump’s contentious plan to end the Russia-Ukraine war isn’t peace: it’s profit. Trump envoys Steve Witkoff and Jared Kushner are ...",
    "link": "https://www.thedailybeast.com/trumps-2-trillion-plan-to-cash-in-on-ukraine-peace-leaks/",
    "timestamp": "2025-11-29T15:22:14Z"
  },
  {
    "title": "Trump may never recover from this breathtaking backfire",
    "description": "US Sen. Mark Kelly (D-AZ) is one of six Democrats with national security backgrounds who released a video last week reminding military personnel they are obligated by law to refuse to obey illegal orders.The reaction by the Trump regime is a distillation of a…",
    "link": "https://www.rawstory.com/raw-investigates/2674353778/",
    "timestamp": "2025-11-29T15:19:39Z"
  },
  {
    "title": "Trump says Venezuela airspace should be considered ‘closed in its entirety’",
    "description": "US President Donald Trump warned on Saturday that the airspace above and near Venezuela should be considered closed, the latest escalation in a standoff with leftist leader Nicolas Maduro. “To all Airlines, Pilots, Drug Dealers, and Human Traffickers,” Trump …",
    "link": "https://www.digitaljournal.com/world/trump-says-venezuela-airspace-should-be-considered-closed-in-its-entirety/article",
    "timestamp": "2025-11-29T15:12:20Z"
  },
  {
    "title": "Educators Worry Palestine Censorship Could Reshape Public Education Entirely",
    "description": "New efforts to shut down honest discussion of Palestine could restrict everything from literature to science classes.",
    "link": "https://truthout.org/articles/educators-worry-palestine-censorship-could-reshape-public-education-entirely/",
    "timestamp": "2025-11-29T15:11:10Z"
  },
  {
    "title": "Walz hits back at Trump with four-word taunt after president’s mental health slur - NewsBreak",
    "description": "Governor Tim Walz has hit back at Donald Trump after the president used a mental health slur against him in a Thanksgiving rant. Trump’s post began by tell",
    "link": "https://www.newsbreak.com/share/4371027075088-walz-hits-back-at-trump-with-four-word-taunt-after-president-s-mental-health-slur?_f=app_share&amp;pd=00UhHWCu&amp;lang=en_US&amp;send_time=1764429006&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-29T15:10:56Z"
  },
  {
    "title": "US Progressives Warn Trump Against Interference in Honduras Election",
    "description": "The US Congressional Progressive Caucus on Friday accused President Donald Trump of \"flagrantly interfering\" in Honduras' upcoming presidential election after Trump announced his endorsement of right-wing candidate Nasry “Tito” Asfura and repeated threats he'…",
    "link": "https://www.commondreams.org/news/trump-honduras",
    "timestamp": "2025-11-29T15:10:05Z"
  },
  {
    "title": "South Park Craps in Hand, Throws It at Pete Hegseth",
    "description": "Pete Hegseth has done an admirable job, restoring standards and respect for US military after Democrats had been reducing it to a social engineering lab focused on promoting DEI and sexual psychosis. For this, the liberal establishment punishes him: Comedy … …",
    "link": "https://moonbattery.com/south-park-craps-in-hand-throws-it-at-pete-hegseth/",
    "timestamp": "2025-11-29T15:09:25Z"
  },
  {
    "title": "Trump Administration Shuts Down All Asylum Decisions Following National Guard Attack",
    "description": "The Trump admin is dramatically restricting immigration after an Afghan man allegedly killed one National Guard member and left another in critical condition.",
    "link": "https://dailycaller.com/2025/11/29/citizenship-immigration-services-joe-edlow-halts-asylum-applications-national-guard-shooting/",
    "timestamp": "2025-11-29T15:06:57Z"
  },
  {
    "title": "'This is Not Home Depot Stuff' — Trump Says Oval Office Decorations Are Real Gold",
    "description": "President Donald Trump's interior design choices became the unlikely focus of a Fox News interview in which the president was forced to defend the authenticity of the \"24-karat\" gold decorations he added to the Oval Office. \nDuring a wide-ranging sit-down int…",
    "link": "https://biztoc.com/x/c21ce238d5b91189",
    "timestamp": "2025-11-29T15:05:13Z"
  },
  {
    "title": "WaPo: Hegseth Ordered Civilians To Be Murdered, A War Crime",
    "description": "While Donald Trump and Pete “WhiskeyLeaks” Hegseth threaten Democrats for urging members of the military to follow the law, it sure looks like Secretary Signalgate has been caught breaking it. This time it’s not just shocking sloppiness and negligence from He…",
    "link": "https://crooksandliars.com/2025/11/wapo-hegseth-ordered-civilians-be-murdered",
    "timestamp": "2025-11-29T15:05:12Z"
  },
  {
    "title": "Nationwide Raids Nab 250 Foreign CDL Truck Drivers — DHS Warns Cartel Exploitation Threatens Homeland Security",
    "description": "Federal and state authorities arrested nearly 250 foreign commercial truck drivers in November alone, warning that cartel operatives and foreign nationals are exploiting America’s commercial driver licensing system to infiltrate freight corridors and endanger…",
    "link": "https://www.breitbart.com/border/2025/11/29/nationwide-raids-nab-250-foreign-cdl-truck-drivers-dhs-warns-cartel-exploitation-threatens-homeland-security/",
    "timestamp": "2025-11-29T15:02:56Z"
  },
  {
    "title": "Trump’s approval rating is plummeting, but the real story is what’s happening among his own voters: New poll",
    "description": "Non-MAGA conservatives more likely to disapprove of Trump's economic performance in 2025, with only 46% believing he's improved economic conditions.",
    "link": "https://www.nj.com/politics/2025/11/trumps-approval-rating-is-plummeting-but-the-real-story-is-whats-happening-among-his-own-voters-new-poll.html",
    "timestamp": "2025-11-29T14:59:30Z"
  },
  {
    "title": "The Best Black Friday Deals Under $25 Still Available From Apple, JBL, Roku and More",
    "description": "Black Friday is behind us, but there are still plenty of budget deals to be had. Here are our favorites you should check out before they expire.",
    "link": "https://www.cnet.com/deals/best-black-friday-deals-under-25-2025-11-29/",
    "timestamp": "2025-11-29T14:56:00Z"
  },
  {
    "title": "Trump's Tariffs Are Squeezing Small Businesses",
    "description": "According to the Pew Research Center, Americans have big trust in small businesses versus big corporations.Mom-and-pop shops will need that positive vibe and more as they approach the make-or-break year end business season, beginning with Small Business Satur…",
    "link": "https://www.commondreams.org/opinion/trump-tariffs-small-businesses",
    "timestamp": "2025-11-29T14:54:01Z"
  },
  {
    "title": "Trump says Venezuela airspace to be closed - Financial Times",
    "description": "Trump says Venezuela airspace to be closedFinancial Times Trump says he has ordered closure of Venezuelan airspaceThe Washington Post Trump Wants Air Space Above Venezuela Closed ‘In Its Entirety’Forbes Donald Trump says airspace above and around Venezuela is…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180238219",
    "timestamp": "2025-11-29T14:53:07Z"
  },
  {
    "title": "TRUMP DECLARES VENEZUELA AIRSPACE CLOSED",
    "description": "TRUMP DECLARES VENEZUELA AIRSPACE CLOSED\r\n\n \n \n \n (Main headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'STAY AWAY'",
    "link": "https://www.the-sun.com/news/15567278/trump-closes-venezuela-airspace-warns-strikes-drug-gangs/",
    "timestamp": "2025-11-29T14:49:36Z"
  },
  {
    "title": "Trump closes airspace 'above and surrounding' Venezuela",
    "description": "The US president made the announcement on Truth Social amid a growing row over drug trafficking with Venezuelan counterpart Nicolas Maduro.",
    "link": "https://news.sky.com/story/trump-closes-airspace-above-and-surrounding-venezuela-13476971",
    "timestamp": "2025-11-29T14:48:00Z"
  },
  {
    "title": "Comer: Court Will Back Trump Voiding Biden Executive Orders Signed with Autopen",
    "description": "During Friday's broadcast of Fox News Channel's \"Hannity,\" Rep. James Comer (R-KY), chairman of the House Oversight Committee, predicted that his committee's work on Biden-era autopen use would result in the court backing President Donald Trump's cancellation…",
    "link": "https://www.breitbart.com/clips/2025/11/29/comer-court-will-back-trump-voiding-biden-executive-orders-signed-with-autopen/",
    "timestamp": "2025-11-29T14:45:47Z"
  },
  {
    "title": "Trump Says He'll Pardon Former Honduran President Hernandez",
    "description": "President Donald Trump says that he plans to pardon the former leader of Honduras who was found guilty of conspiring to import cocaine into the United States. Former Honduran President Juan Orlando Hernandez was convicted by a U.S. jury for drug trafficking a…",
    "link": "https://www.today.com/video/trump-to-pardon-former-honduran-president-juan-hernandez-253290565546",
    "timestamp": "2025-11-29T14:42:33Z"
  },
  {
    "title": "‘Outrageous!’ Newsmax host flips after guest calls out Trump’s ‘touch of evil’",
    "description": "Newsmax host T.W. Shannon exploded at his guest Saturday after they rebuked his condemnation of those criticizing the Trump administration’s potentially illegal military orders, calling his guest’s remarks \"outrageous.\"“We're seeing the left now comparing our…",
    "link": "https://www.rawstory.com/pete-hegseth-2674355131/",
    "timestamp": "2025-11-29T14:39:52Z"
  },
  {
    "title": "Trump Says Air Space Above Venezuela Will Be Closed",
    "description": "The U.S. has ramped up its military presence off the coast of Venezuela amid its war with drug cartels and push to oust President Nicolás Maduro.",
    "link": "https://www.forbes.com/sites/saradorn/2025/11/29/trump-says-air-space-above-venezuela-will-be-closed/",
    "timestamp": "2025-11-29T14:36:53Z"
  },
  {
    "title": "Judge relaunches contempt probe after migrants' flights landed in El Salvador",
    "description": "A federal judge has relaunched his contempt probe of the Trump administration for failing to turn around two planes carrying Venezuelan migrants to El Salvador",
    "link": "https://www.wmur.com/article/judge-probe-migrant-flights-el-salvador/69581038",
    "timestamp": "2025-11-29T14:35:04Z"
  },
  {
    "title": "Judge relaunches contempt probe after migrants' flights landed in El Salvador",
    "description": "A federal judge has relaunched his contempt probe of the Trump administration for failing to turn around two planes carrying Venezuelan migrants to El Salvador",
    "link": "https://www.wtae.com/article/judge-probe-migrant-flights-el-salvador/69581038",
    "timestamp": "2025-11-29T14:34:43Z"
  },
  {
    "title": "Trump says airspace above and surrounding Venezuela to be closed in its entirety",
    "description": "Move follows warning from US aviation regulator of a ‘potentially hazardous situation’ when flying over Venezuela",
    "link": "https://www.irishtimes.com/world/americas/2025/11/29/trump-says-airspace-above-and-surrounding-venezuela-to-be-closed-in-its-entirety/",
    "timestamp": "2025-11-29T14:33:37Z"
  },
  {
    "title": "Trump Snaps at Reporter Who Repeatedly Insists All Afghan Refugees Are Vetted: 'Are You Stupid?'",
    "description": "Trump Snaps at Reporter Who Repeatedly Insists All Afghan Refugees Are Vetted: 'Are You Stupid?'westernjournal.com",
    "link": "https://www.westernjournal.com/trump-snaps-reporter-repeatedly-insists-afghan-refugees-vetted-stupid/",
    "timestamp": "2025-11-29T14:33:21Z"
  },
  {
    "title": "Trump says airspace above and surrounding Venezuela to be closed in its entirety - Reuters",
    "description": "Trump says airspace above and surrounding Venezuela to be closed in its entiretyReuters Donald Trump says airspace above and around Venezuela is closedThe Guardian Venezuela revokes flight rights for six airlines as tensions with US escalateReuters Trump shut…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180238131",
    "timestamp": "2025-11-29T14:32:59Z"
  },
  {
    "title": "Trump tells airlines Venezuela's airspace is 'closed in its entirety' as tensions rise",
    "description": "President Donald Trump said Saturday morning that Venezuela's airspace should be considered \"closed\" as he weighs military action against the South American nation.",
    "link": "https://www.nbcnews.com/world/venezuela/trump-airlines-venezuela-airspace-closed-entirety-tensions-rcna246422",
    "timestamp": "2025-11-29T14:32:53Z"
  },
  {
    "title": "Kevin O’Leary blasts Trump’s $2,000 tariff dividend as a ‘silent tax’ on Americans. What to do with it if you get it",
    "description": "Kevin O’Leary blasts Trump’s $2,000 tariff dividend as a ‘silent tax’ on Americans. What to do with it if you get it\nMoneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below.\nRecently, President Donald Trump shared a s…",
    "link": "https://biztoc.com/x/916b78f482c0cd42",
    "timestamp": "2025-11-29T14:32:02Z"
  },
  {
    "title": "Trump Announces Airspace Above Venezuela ‘Closed in Its Entirety’ Amid Threats of Land Strikes",
    "description": "The announcement comes days after Trump said the U.S. would launch strikes inside Venezuela against alleged drug traffickers 'very soon.'",
    "link": "https://time.com/7337463/venezuela-airspace-closed-trump-strikes/",
    "timestamp": "2025-11-29T14:31:44Z"
  },
  {
    "title": "Consider airspace 'above and surrounding' Venezuela closed, Trump warns airlines",
    "description": "Pete Marovich/Getty Images\nPresident Donald Trump has warned that airspace \"above and surrounding\" Venezuela should be considered closed.\nIt comes amid mounting tensions between Trump and Venezuelan leader Nicolás Maduro.\nTrump on Thursday said the US would \"…",
    "link": "https://biztoc.com/x/cb57538f91f35a06",
    "timestamp": "2025-11-29T14:31:41Z"
  },
  {
    "title": "The American Soup Kitchen Is Officially Closed",
    "description": "There’s a particular kind of innocence in believing that generosity will be recognized for what it is. A nation opens its doors, offers a warm meal, provides a safe bed, and assumes the visitor understands the privilege. For decades, America set out the banqu…",
    "link": "https://freerepublic.com/focus/f-news/4355154/posts",
    "timestamp": "2025-11-29T14:29:49Z"
  },
  {
    "title": "The American Soup Kitchen Is Officially Closed",
    "description": "There’s a particular kind of innocence in believing that generosity will be recognized for what it is. A nation opens its doors, offers a warm meal, provides a safe bed, and assumes the visitor understands the privilege. For decades, America set out the banqu…",
    "link": "https://freerepublic.com/focus/f-chat/4355154/posts",
    "timestamp": "2025-11-29T14:29:49Z"
  },
  {
    "title": "Manitoba conservation officers assigned to U.S. border have seen 'no activity' in nearly a year: minister",
    "description": "It's been 11 months since Manitoba started using conservation officers as extra sets of eyes on the United States border in response to U.S. President Donald Trump's claims that migrants and drug-smugglers were pouring in from Canada.",
    "link": "https://www.cbc.ca/news/canada/manitoba/us-border-manitoba-conservation-officers-9.6997511",
    "timestamp": "2025-11-29T14:29:07Z"
  },
  {
    "title": "Consider airspace 'above and surrounding' Venezuela closed, Trump warns airlines",
    "description": "In a post on Truth Social, Trump told airlines to consider the airspace \"closed in its entirety.\"",
    "link": "https://www.businessinsider.com/trump-says-airspace-above-surrounding-venezuela-to-be-closed-2025-11",
    "timestamp": "2025-11-29T14:26:15Z"
  },
  {
    "title": "Trump Drops Early Morning Rant To Coerce Bombshell Supreme Court Case",
    "description": "Trump got up early to drop a post bragging about a policy that many experts blame for rising costs, and tried to influence a Supreme Court case in the process.\nThe post Trump Drops Early Morning Rant To Coerce Bombshell Supreme Court Case first appeared on Me…",
    "link": "https://www.mediaite.com/online/trump-drops-early-morning-rant-to-coerce-bombshell-supreme-court-case/",
    "timestamp": "2025-11-29T14:22:56Z"
  },
  {
    "title": "Precursors of Trumpism",
    "description": "This is another post inspired by John Ganz’s very thought-provoking study of America in the early 1990s, When the Clock Broke. Given his subject matter, Ganz shows considerable restraint in not talking about Donald Trump much at all — Trump’s financial fortun…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/precursors-of-trumpism",
    "timestamp": "2025-11-29T14:21:29Z"
  },
  {
    "title": "Turkeys pardoned, Democrats roasted: How Trump turned Thanksgiving into political spectacle",
    "description": "US News: Donald the merciful was in a forgive, but not forget mood as he bestowed “unconditional” pardons on Gobble and Waddle, two pampered Thanksgiving turke.",
    "link": "https://timesofindia.indiatimes.com/world/us/turkeys-pardoned-democrats-roasted-how-trump-turned-thanksgiving-into-political-spectacle/articleshow/125659023.cms",
    "timestamp": "2025-11-29T14:20:54Z"
  },
  {
    "title": "Kevin O’Leary blasts Trump’s $2,000 tariff dividend as a ‘silent tax’ on Americans. What to do with it if you get it",
    "description": "Mr. Wonderful calls it a quick 'money for nothing' band-aid. Do you agree?",
    "link": "https://finance.yahoo.com/news/kevin-o-leary-blasts-trump-141900527.html",
    "timestamp": "2025-11-29T14:19:00Z"
  },
  {
    "title": "Europe secures record space budget to boost independence",
    "description": "Bremen, Germany (AFP) Nov 27, 2025\n\n\n The European Space Agency announced Thursday it had secured a record budget of 22.1 billion euros to fund its programmes for the next three years, as the continent seeks greater independence in space. \n\nThe ESA also appro…",
    "link": "https://www.spacedaily.com/reports/Europe_secures_record_space_budget_to_boost_independence_999.html",
    "timestamp": "2025-11-29T14:10:07Z"
  },
  {
    "title": "National Guardsman shot in DC is 'hanging on' as family calls for prayer: lawmaker",
    "description": "National Guardsman Andrew Wolfe, 24, is \"hanging on\" Saturday after being shot in Washington, D.C., earlier this week, Rep. Riley Moore, R-W.Va., said.",
    "link": "https://www.foxnews.com/us/national-guardsman-shot-dc-hanging-on-family-pleading-prayer-congressman-says",
    "timestamp": "2025-11-29T14:09:53Z"
  },
  {
    "title": "Donald Trump Says Venezuela Airspace To Be Closed Entirely",
    "description": "President Donald Trump has said that the airspace above and around Venezuela is to be \"closed in its entirety.”\n\"To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENT…",
    "link": "https://biztoc.com/x/2e177a0e56e4bde6",
    "timestamp": "2025-11-29T14:09:08Z"
  },
  {
    "title": "Trump administration scrutinizes migrant vetting after National Guard shooting",
    "description": "The person accused of shooting two National Guard soldiers is an Afghan national, raising questions about a resettlement program under the Biden administration.",
    "link": "https://www.wcvb.com/article/trump-administration-scrutinizes-migrant-vetting-after-national-guard-shooting/69580886",
    "timestamp": "2025-11-29T14:08:00Z"
  },
  {
    "title": "Trump warns against flying over Venezuela airspace",
    "description": "The US president's warning is the latest in a string of escalatory measures against Venezuela, whose leftist President Maduro accuses the Trump administration of trying to depose him. US President Donald Trump on Saturday warned against flying over Venezuela,…",
    "link": "https://www.dw.com/en/trump-warns-against-flying-over-venezuelan-airspace/a-74950892",
    "timestamp": "2025-11-29T14:08:00Z"
  },
  {
    "title": "'It's murder. Period': George Conway warns Hegseth that Trump may not be able to save him",
    "description": "Reacting to a Washington Post report that Defense Secretary Pete Hegseth instructed military officials to “kill them all,” in an attack on what the Donald Trump administration has labeled “narco-terrorists,” attorney George Conway claimed the former Fox perso…",
    "link": "https://www.rawstory.com/hegseth-2674355077/",
    "timestamp": "2025-11-29T14:06:09Z"
  },
  {
    "title": "Trump is wise to tackle Obamacare but real answers mean a massive overhaul",
    "description": "Yet while an extension will kick the can down the road for the short term, it’s obvious President Barack Obama’s Affordable Care Act will need a massive overhaul to save it.",
    "link": "https://nypost.com/2025/11/29/opinion/trump-is-wise-to-tackle-obamacare-but-nothing-but-a-massive-overhaul-can-save-it/",
    "timestamp": "2025-11-29T14:03:00Z"
  },
  {
    "title": "AI fuels a new wave of political lies",
    "description": "Across races from Georgia to New York, deepfakes are steering political narratives and voter perception",
    "link": "https://www.salon.com/2025/11/29/ai-fuels-a-new-wave-of-political-lies/",
    "timestamp": "2025-11-29T14:00:45Z"
  },
  {
    "title": "Unpacking rumor Education Department no longer counts nursing, other programs as 'professional degrees'",
    "description": "In late 2025, the Department of Education said it would no longer classify these credentials as professional degrees: education (including teaching master’s degrees), nursing (MSN, DNP), social work (MSW, DSW), public health (MPH, DrPH), physician assistant, …",
    "link": "https://www.snopes.com//fact-check/trump-education-department-professional-degrees/",
    "timestamp": "2025-11-29T14:00:00Z"
  },
  {
    "title": "Blue States vs. Red States on ‘Affordability’",
    "description": "“Affordability” has become the word of the month as American economic anxieties become a major point of political contention between Democrats and Republicans. Socialist Democrat... Read More\nThe post Blue States vs. Red States on ‘Affordability’ appeared fir…",
    "link": "https://www.dailysignal.com/2025/11/29/blue-states-vs-red-states-on-affordability/",
    "timestamp": "2025-11-29T14:00:00Z"
  },
  {
    "title": "The Greatest Victims of Trump’s Greatest Grift Are America’s Greatest Heroes",
    "description": "The so-called Department of Government Efficiency (DOGE) no longer exists, but its negative impact on veterans will last for decades.",
    "link": "http://www.rollingstone.com/politics/political-commentary/doge-dead-impact-veterans-decades-1235473077/",
    "timestamp": "2025-11-29T14:00:00Z"
  },
  {
    "title": "‘The affordability president!’ Trump doubles down on rebrand in wake of election losses",
    "description": "President Donald Trump declared himself to be “the affordability president” early Saturday, a continuation of his attempt to rebrand the GOP as the party of affordability in the wake of the party’s colossal election losses\r\n earlier this month.“Because I have…",
    "link": "https://www.rawstory.com/trump-2674355072/",
    "timestamp": "2025-11-29T13:57:52Z"
  },
  {
    "title": "Trump says Venezuela airspace should be considered 'closed in its entirety'",
    "description": "WASHINGTON: US President Donald Trump warned on Saturday (Nov 29) that the airspace above and near Venezuela should be considered closed, the latest escalation in a standoff with leftist leader Nicolas Maduro.\"To all Airlines, Pilots, Drug Dealers, and Human …",
    "link": "https://www.channelnewsasia.com/world/trump-venezuela-airspace-considered-closed-5497291",
    "timestamp": "2025-11-29T13:57:36Z"
  },
  {
    "title": "Trump warns Venezuela airspace ‘closed’ as tensions spike",
    "description": "WASHINGTON: US President Donald Trump warned on Saturday (Nov 29) that the airspace above and near Venezuela should be considered closed, the latest escalation in a standoff with leftist leader Nicolas Madur",
    "link": "https://www.channelnewsasia.com/world/trump-warns-venezuela-airspace-closed-tensions-spike-5497291",
    "timestamp": "2025-11-29T13:57:00Z"
  },
  {
    "title": "Trump says airspace above and surrounding Venezuela to be closed",
    "description": "US President Donald Trump says the entire airspace above the South American nation of Venezuela should be considered closed in its entirety.",
    "link": "https://www.abc.net.au/news/2025-11-30/donald-trump-says-airspace-above-venezuela-closed/106082656",
    "timestamp": "2025-11-29T13:53:54Z"
  },
  {
    "title": "Trump says Venezuela airspace should be considered 'closed in its entirety'",
    "description": "President Donald Trump has declared Venezuelan airspace closed. This move escalates tensions with President Nicolas Maduro. The US has deployed a major military force to the Caribbean. Washington claims the deployment aims to stop drug trafficking. Caracas be…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-venezuela-airspace-should-be-considered-closed-in-its-entirety/articleshow/125658841.cms",
    "timestamp": "2025-11-29T13:53:36Z"
  },
  {
    "title": "Russia attack on Kyiv kills three as efforts to end Ukraine war gain momentum",
    "description": "Trump said Tuesday that his plan to end the war had been “fine-tuned” and that he’s sending envoy Steve Witkoff to Russia to meet with Putin and Army Secretary Dan Driscoll to meet with Ukrainian officials.",
    "link": "https://nypost.com/2025/11/29/world-news/russian-attacks-kill-3-as-efforts-to-end-war-in-ukraine-gain-momentum/",
    "timestamp": "2025-11-29T13:50:50Z"
  },
  {
    "title": "Trump bump impact: Social Security raises 2026 benefits by 2.8% – find out how much you’ll get and what it means for retirees",
    "description": "Social Security benefits will see a 2.8 percent rise in 2026. This adjustment, nicknamed the 'Trump bump', is partly due to President Trump's trade policies. The average retired worker will receive an extra $56 monthly. This marks five consecutive years of at…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-bump-impact-social-security-raises-2026-benefits-by-2-8-find-out-how-much-youll-get-and-what-it-means-for-retirees/articleshow/125658339.cms",
    "timestamp": "2025-11-29T13:44:55Z"
  },
  {
    "title": "Trump Declares Airspace Above And Around Venezuela 'Closed' Amid Escalating Tensions",
    "description": "President Donald Trump said airlines should consider airspace above and surrounding Venezuela to be closed, in a post on his Truth Social platform on Saturday.",
    "link": "https://www.ndtvprofit.com/world/trump-declares-airspace-above-and-around-venezuela-closed-amid-escalating-tensions",
    "timestamp": "2025-11-29T13:39:13Z"
  },
  {
    "title": "LIVE: Donald Trump says Venezuela airspace now closed as tensions surge",
    "description": "No immediate response from Venezuela after President Trump’s makes the announcement on social media on Saturday.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/11/29/live-donald-trump-says-venezuela-airspace-now-closed-as-tensions-surge",
    "timestamp": "2025-11-29T13:38:28Z"
  },
  {
    "title": "Northwestern to pay $75 million in deal with Trump administration to restore federal funding",
    "description": "Northwestern University has agreed to pay $75 million to the U.S. government in a deal with the Trump administration to end a series of investigations and restore hundreds of millions of dollars in federal research funding",
    "link": "https://abcnews.go.com/Politics/wireStory/northwestern-pay-75-million-deal-trump-administration-restore-127960995",
    "timestamp": "2025-11-29T13:33:33Z"
  },
  {
    "title": "Trump declares Venezuelan airspace closed",
    "description": "US President Donald Trump has declared Venezuela’s airspace closed following threats to launch military action over alleged drug trafficking Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628672-trump-venezuela-airspace-closed/",
    "timestamp": "2025-11-29T13:31:41Z"
  },
  {
    "title": "Experts doubt the Pentagon can punish Kelly over the 'illegal orders' video",
    "description": "The Pentagon’s investigation of Sen. Mark Kelly over a video that urges American troops to defy “illegal orders” has raised a slew of questions, and some...",
    "link": "https://www.yahoo.com/news/articles/experts-doubt-pentagon-punish-kelly-132958475.html",
    "timestamp": "2025-11-29T13:29:58Z"
  },
  {
    "title": "How Trump’s crypto empire became the center of a new influence economy",
    "description": "A new staff report released by House Judiciary Committee Ranking Member Jamie Raskin alleges that President Donald Trump has significantly utilized the presidency to expand his personal wealth through cryptocurrency ventures. The report, titled Trump, Crypto,…",
    "link": "https://cryptoslate.com/how-trumps-crypto-empire-became-the-center-of-a-new-influence-economy/",
    "timestamp": "2025-11-29T13:29:30Z"
  }
]