[
  {
    "title": "\"Set An Example\": Barack Obama As Harvard Rejects Trump's Demands",
    "description": "The US government has frozen $2.2 billion in Harvard University&#039;s federal funding for rejecting Donald Trump&#039;s demands.",
    "link": "https://www.ndtv.com/world-news/barack-obama-as-harvard-university-rejects-donald-trumps-demands-set-an-example-8167157",
    "timestamp": "2025-04-15T05:40:54Z"
  },
  {
    "title": "Why stock market is rising today: Sensex jumps 1,600 pts; Nifty above 23,300; 6 key factors behind today's rally",
    "description": "Stock Market Today: Private sector lenders HDFC Bank and ICICI Bank each gained around 3%, with Jefferies noting that declining deposit rates are a positive for the banking sector. Combined, the two banks added 638 points to the Sensexs over 1,500-point rally.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-rising-today-sensex-jumps-1600-pts-nifty-above-23300-6-key-factors-behind-todays-rally/articleshow/120300308.cms",
    "timestamp": "2025-04-15T05:40:25Z"
  },
  {
    "title": "Tariff truce for Big Tech will be short-lived",
    "description": "The Tame Apple Press celebrated on Friday after Donald Trump announced that tariffs on Big Tech giants would be temporarily suspended \u0096 only to have its hopes dashed 24 hours later.\n\nhttps://fudzilla.com/news/60854-tariff-truce-for-big-tech-will-be-short-lived",
    "link": "http://www.madshrimps.be/news/item/238492",
    "timestamp": "2025-04-15T05:39:04Z"
  },
  {
    "title": "China’s Xi Jinping is in Vietnam to figure out how to ‘screw’ the US, says Trump",
    "description": "US president issues scathing view of Chinese counterpart’s motivations amid escalating trade war with Beijing \nXi Jinping’s tour of South-east Asia this week is likely intended to “screw” the United States, President Donald Trump has suggested, as the Chinese…",
    "link": "https://biztoc.com/x/d7a24a3f2df4ffa7",
    "timestamp": "2025-04-15T05:36:48Z"
  },
  {
    "title": "Trump envoy says Putin open to 'permanent peace' deal with Ukraine",
    "description": "U.S. President Donald Trump's special envoy said Monday that Russian leader Vladimir Putin was open to a \"permanent peace\" deal with Ukraine, following talks seeking to end the more than three-year war.",
    "link": "https://www.hurriyetdailynews.com/trump-envoy-says-putin-open-to-permanent-peace-deal-with-ukraine-208071",
    "timestamp": "2025-04-15T05:30:48Z"
  },
  {
    "title": "Russia says it is not easy to agree Ukraine peace deal with US",
    "description": "Lavrov praised Trump's \"common sense\" and for saying that previous US support of Ukraine's bid to join the NATO military alliance was a major cause of the war in Ukraine.",
    "link": "https://www.jpost.com/breaking-news/article-850154",
    "timestamp": "2025-04-15T05:30:21Z"
  },
  {
    "title": "Tariffs uncertainty clouds outlook for ASML's earnings",
    "description": "ASML, the biggest supplier of equipment used to make computer chips, derived 17% of its revenue from the U.S. market last year. That is expected to grow as Trump seeks to push chipmaking investments back to the U.S. ASML's biggest customer, Taiwan's TSMC is a…",
    "link": "https://economictimes.indiatimes.com/tech/technology/tariffs-uncertainty-clouds-outlook-for-asmls-earnings/articleshow/120300067.cms",
    "timestamp": "2025-04-15T05:29:39Z"
  },
  {
    "title": "LVMH says it's looking into moving more manufacturing to the US after Trump's tariff threats",
    "description": "The group's CFO said it was looking into shifting some segments of its manufacturing process, but it won't happen \"overnight.\"",
    "link": "https://www.businessinsider.com/lvmh-looking-into-moving-manufacturing-to-us-after-tariff-threats-2025-4",
    "timestamp": "2025-04-15T05:27:30Z"
  },
  {
    "title": "A Call to Defend What’s Best about America",
    "description": "Millions of Americans in more than 1,200 cities and towns gathered with friends and neighbors on April 5 in a beautiful, energetic, nonviolent, and urgently needed expression of patriotism. We used our freedom of speech to send urgent messages to our politica…",
    "link": "https://www.counterpunch.org/2025/04/15/a-call-to-defend-whats-best-about-america/",
    "timestamp": "2025-04-15T05:25:42Z"
  },
  {
    "title": "Jensen Huang Praised By Trump: Nvidia 'Wouldn't Be Doing' $500 Billion AI Infrastructure Commitment Without Tariffs",
    "description": "President Donald Trump credited his tariff policies for driving Nvidia Corp.’s (NASDAQ:NVDA) massive $500 billion commitment to build artificial intelligence infrastructure in the United States during a White House press conference on Monday.\nWhat Happened: “…",
    "link": "https://biztoc.com/x/0931ddb4e5034bd8",
    "timestamp": "2025-04-15T05:25:11Z"
  },
  {
    "title": "AUKUS exemption to U.S. defense trade controls doesn't cover nuclear subs, officials say",
    "description": "The controls create hurdles to defense industry collaboration on U.S. Virginia-class sub production.",
    "link": "https://www.japantimes.co.jp/news/2025/04/15/asia-pacific/aukus-nuclear-sub-us-trade-controls/",
    "timestamp": "2025-04-15T05:24:00Z"
  },
  {
    "title": "White House Proposes Elimination of NOAA Climate Research in Budget Proposal",
    "description": "The administration of President Donald Trump aims to eliminate the arm of the National Oceanic and Atmospheric Administration that oversees research on climate change, and refocus the U.S. fisheries service to support energy development, according to a draft …",
    "link": "https://www.insurancejournal.com/news/national/2025/04/15/819747.htm",
    "timestamp": "2025-04-15T05:24:00Z"
  },
  {
    "title": "Trade troubles weaken France’s resistance to EU-Mercosur deal",
    "description": "In today’s edition of The Capitals, read about allies cheering Germany’s Taurus announcement as Russia labels Merz a ‘Nazi’, Hungary set to oppose an EU military training mission in Ukraine, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-trade-troubles-weaken-frances-resistance-to-eu-mercosur-deal/",
    "timestamp": "2025-04-15T05:22:51Z"
  },
  {
    "title": "Fed Chair Powell’s successor search to start this fall, says Treasury Secretary Bessent",
    "description": "During a Bloomberg TV interview in Argentina, Bessent emphasised that the Trump administration has about six months to prepare for this transition",
    "link": "https://www.thehindubusinessline.com/money-and-banking/fed-chair-powells-successor-search-to-start-this-fall-says-treasury-secretary-bessent/article69451491.ece",
    "timestamp": "2025-04-15T05:22:27Z"
  },
  {
    "title": "Three nightmare Trump scenarios we should be planning for",
    "description": "Donald Trump has already inflicted economic chaos on the world. But things could get much, much worse...\nThe post Three nightmare Trump scenarios we should be planning for appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/04/15/three-nightmare-donald-trump-scenarios-australia-must-plan/",
    "timestamp": "2025-04-15T05:21:26Z"
  },
  {
    "title": "Xi's Vietnam trip aiming to 'screw' US, says Trump",
    "description": "HANOI: China's President Xi Jinping paid tribute to Vietnam's late revolutionary leader Ho Chi Minh on Tuesday (Apr 15), his last day of a trip to Hanoi that President Donald Trump said was aiming to \"screw\" the United States. Xi is in Vietnam as part of a",
    "link": "https://www.channelnewsasia.com/asia/xi-jinping-vietnam-trip-aiming-screw-us-donald-trump-5066476",
    "timestamp": "2025-04-15T05:21:09Z"
  },
  {
    "title": "Auto stocks jump 3% after Trump floats tariff exemptions",
    "description": "Speaking on Monday at the White House, Trump said he was considering a modification to the 25 per cent tariffs imposed on foreign auto and auto parts imports from Mexico, Canada and other places",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/auto-stocks-jump-3-after-trump-floats-tariff-exemptions/article69451460.ece",
    "timestamp": "2025-04-15T05:19:44Z"
  },
  {
    "title": "U.S. announces probe into chip, electronics imports, paving the way for new tariffs",
    "description": "The U.S. Commerce Department is conducting an investigation into imports of various semiconductor technologies and electronics, a federal notice shows.",
    "link": "https://www.cnbc.com/2025/04/15/us-discloses-details-on-chips-probe-as-it-prepares-new-tariffs-.html",
    "timestamp": "2025-04-15T05:18:54Z"
  },
  {
    "title": "Tehran says next round of Iran-US nuclear talks in Oman after Rome named by officials",
    "description": "Talks between Iran and the United States over Tehran’s rapidly advancing nuclear program had appeared ready to leave the Middle East, as an Italian source and others said the next round of negotiations would take place in Rome",
    "link": "https://abcnews.go.com/US/wireStory/tehran-round-iran-us-nuclear-talks-oman-after-120779816",
    "timestamp": "2025-04-15T05:18:13Z"
  },
  {
    "title": "US has ‘countless’ ways to bolster Bitcoin reserve: Bo Hines",
    "description": "The US is exploring many ways to increase its Bitcoin reserve without taxpayer dollars, including through tariff revenue and revaluing the government’s gold certificates, according to the executive director of the Trump administration’s crypto council.“We're …",
    "link": "https://cointelegraph.com/news/us-countless-ways-stack-bitcoin-reserve-bo-hines-says",
    "timestamp": "2025-04-15T05:13:57Z"
  },
  {
    "title": "Chinese Envoy Claims White House Press Secretary's Dress Is 'Made In China'",
    "description": "Many came to her defence, arguing that the Chinese website&#039;s dress was a knockoff, while some accused her of hypocrisy for wearing Chinese-made products while publicly slamming China.",
    "link": "https://www.ndtv.com/world-news/chinese-diplomat-claims-white-house-press-secretarys-dress-is-made-in-china-internet-reacts-8166955",
    "timestamp": "2025-04-15T05:10:24Z"
  },
  {
    "title": "China’s economy will grow just 3.4 per cent in 2025 as US tariffs choke exports, says UBS",
    "description": "Other global banks have cut their outlook for China in recent days. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/chinas-economy-will-grow-just-3-4-per-cent-in-2025-as-us-tariffs-choke-exports-says-ubs",
    "timestamp": "2025-04-15T05:08:57Z"
  },
  {
    "title": "Labor surges to 7-point lead in Resolve poll, and has sizeable leads in two other national polls",
    "description": "Mid-way through the election campaign, the Labor leader’s popularity has also surged.",
    "link": "https://theconversation.com/labor-surges-to-7-point-lead-in-resolve-poll-and-has-sizeable-leads-in-two-other-national-polls-254516",
    "timestamp": "2025-04-15T05:03:43Z"
  },
  {
    "title": "Nissan to cut Japanese production of top-selling US model due to tariffs, source says",
    "description": "Nissan is set to reduce Rogue SUV production in Japan by 13,000 units between May and July due to U.S. import tariffs. This decision impacts the Kyushu plant, with potential work hour reductions and production halts. The company is reassessing its production …",
    "link": "https://economictimes.indiatimes.com/news/international/business/nissan-to-cut-japanese-production-of-top-selling-us-model-due-to-tariffs-source-says/articleshow/120299440.cms",
    "timestamp": "2025-04-15T05:02:26Z"
  },
  {
    "title": "Government's case against Mahmoud Khalil shaky and reliant on tabloid accounts, review of evidence shows",
    "description": "The former Columbia University student arrested on campus and slated for deportation has filed evidence that shows claims underlying the government's case are dubious.",
    "link": "https://www.nbcnews.com/news/us-news/governments-case-mahmoud-khalil-shaky-reliant-tabloid-accounts-review-rcna201254",
    "timestamp": "2025-04-15T05:00:48Z"
  },
  {
    "title": "There’s a psychosexual dimension to Trump’s tariffs. You don’t have to be Freud to see it",
    "description": "When they bought into Trump, the tech bros purchased his whole inflated persona – every whim, craze and dark fantasy",
    "link": "https://www.irishtimes.com/opinion/2025/04/15/fintan-otoole-theres-a-psychosexual-dimension-to-trumps-tariffs-you-dont-have-to-be-freud-to-see-it/",
    "timestamp": "2025-04-15T05:00:02Z"
  },
  {
    "title": "Meta warned Government of ‘unsustainable’ operating environment for tech companies in EU",
    "description": "Senior executive Joel Kaplan called for ‘urgent action’ by Ireland to ‘address the challenges we face collectively’",
    "link": "https://www.irishtimes.com/politics/2025/04/15/meta-warned-government-of-unsustainable-operating-environment-for-tech-companies-in-eu/",
    "timestamp": "2025-04-15T05:00:00Z"
  },
  {
    "title": "White Lotus star hits out at ‘mean’ parody",
    "description": "<p>Aimee Lou Wood, a star of <strong>The White Lotus</strong>, the hit TV show filmed in <strong>Thailand</strong>, has criticised the US comedy sketch show Saturday Night Live for a skit that mocked her smile, calling it &ldquo;mean and unfunny&rdquo;.</p>",
    "link": "https://www.bangkokpost.com/life/arts-and-entertainment/3003586/white-lotus-star-hits-out-at-mean-parody",
    "timestamp": "2025-04-15T05:00:00Z"
  },
  {
    "title": "Core Democratic groups are preparing to be targeted by the Trump administration",
    "description": "Some of the Democratic Party’s core political groups are preparing for the possibility that President Donald Trump’s allies may soon launch criminal investigations that could handicap Democratic infrastructure",
    "link": "https://abcnews.go.com/US/wireStory/core-democratic-groups-preparing-targeted-trump-administration-120813282",
    "timestamp": "2025-04-15T04:54:24Z"
  },
  {
    "title": "Harvard University defies Trump’s demands, faces $2.3bn in funding cuts",
    "description": "The Ivy League school becomes first US university to defy Trump administration's demands after campus protests.",
    "link": "https://www.aljazeera.com/news/2025/4/15/harvard-university-defies-trumps-demands-faces-2-3bn-in-funding-cuts",
    "timestamp": "2025-04-15T04:53:13Z"
  },
  {
    "title": "Crude oil futures gain as Trump hints at another tariff exemption",
    "description": "At 9.58 am on Tuesday, June Brent oil futures were at $65.04, up by 0.25%, and May crude oil futures on WTI were at $61.73, up by 0.33%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-gain-as-trump-hints-at-another-tariff-exemption/article69451420.ece",
    "timestamp": "2025-04-15T04:52:11Z"
  },
  {
    "title": "Tata Motors shares rally 6% after Trump signals possible tariff relief for automakers",
    "description": "Tata Motors shares: The rally spilled over to other auto component manufacturers, with shares of Samvardhana Motherson climbing 7.2% to ₹126.73 and Sona BLW advancing 7.1% to ₹457.50 in early trade. Both firms generate part of their revenue—4% and 2%, respect…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rally-6-after-trump-signals-possible-tariff-relief-for-automakers/articleshow/120299169.cms",
    "timestamp": "2025-04-15T04:51:45Z"
  },
  {
    "title": "S. Korea Plans Extra $4.9 Bn Help For Chips Amid US Tariff Anxiety",
    "description": "South Korea on Tuesday announced plans to invest almost $5 billion extra in the country's semiconductor industry, citing \"growing uncertainty\" over US tariffs.",
    "link": "https://www.ibtimes.com/s-korea-plans-extra-49-bn-help-chips-amid-us-tariff-anxiety-3770101",
    "timestamp": "2025-04-15T04:48:12Z"
  },
  {
    "title": "Trump says Zelensky shares blame for war dead",
    "description": "Donald Trump has said Volodymyr Zelensky shares the blame with Russian President Vladimir Putin for \"millions of people dead\" in the Ukraine war. \"When you start a war you got to know you can win,\" he said, also blaming former US President Joe Biden for the c…",
    "link": "https://freerepublic.com/focus/f-news/4311074/posts",
    "timestamp": "2025-04-15T04:48:10Z"
  },
  {
    "title": "Chinese TikTok Users Claim Luxury Brands Use Cheap Local Manufacturers",
    "description": "U.S. and China are currently embroiled in a trade war with each country imposing  125 percent tariffs on the other.",
    "link": "https://www.complex.com/style/a/jose-martinez/china-tiktok-claims-luxury-brands-use-local-manufacturers-at-low-cost",
    "timestamp": "2025-04-15T04:46:22Z"
  },
  {
    "title": "Xi’s Vietnam trip aims to ‘screw’ US, Trump complains",
    "description": "<p>HANOI - Chinese President Xi Jinping paid tribute to Vietnam&rsquo;s late revolutionary leader Ho Chi Minh on Tuesday as he wrapped up a trip to Hanoi that President Donald Trump said was aiming to &ldquo;screw&rdquo; the United States.</p>",
    "link": "https://www.bangkokpost.com/world/3003559/xis-vietnam-trip-aims-to-screw-us-trump-complains",
    "timestamp": "2025-04-15T04:45:00Z"
  },
  {
    "title": "Xi's Vietnam Trip Aiming To 'Screw' US, Says Trump",
    "description": "China's President Xi Jinping paid tribute to Vietnam's late revolutionary leader Ho Chi Minh on Tuesday, his last day of a trip to Hanoi that President Donald Trump said was aiming to \"screw\" the United States.",
    "link": "https://www.ibtimes.com/xis-vietnam-trip-aiming-screw-us-says-trump-3770097",
    "timestamp": "2025-04-15T04:42:14Z"
  },
  {
    "title": "Exclusive-Nissan to cut Japanese production of top-selling US model due to tariffs, source says",
    "description": "TOKYO : Nissan will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new U.S. import tariffs.U.S. Pres…",
    "link": "https://www.channelnewsasia.com/business/exclusive-nissan-cut-japanese-production-top-selling-us-model-due-tariffs-source-says-5066401",
    "timestamp": "2025-04-15T04:42:07Z"
  },
  {
    "title": "Donald Trump’s campus crackdown hits Harvard university - and it’s just the beginning",
    "description": "Harvard University is in conflict with the Trump administration, which froze $2.2 billion in federal grants due to ideological disagreements. Harvard refuses to comply with demands to alter admissions policies and eliminate DEI programs, citing academic freed…",
    "link": "https://timesofindia.indiatimes.com/world/us/donald-trump-harvard-university-harvard-university-endowment-trump-vs-harvard/articleshow/120298191.cms",
    "timestamp": "2025-04-15T04:42:01Z"
  },
  {
    "title": "Asian shares are mostly higher after Trump eases some of his tariffs on electronics, for now",
    "description": "Asian shares have mostly gained, echoing a rally on Wall Street after President Donald Trump relaxed some of his tariffs, for now at least, and as stress from within the U.S. bond market seems to be easing. U.S. futures edged lower and oil prices were little …",
    "link": "https://www.seattlepi.com/news/world/article/asian-shares-are-mostly-higher-after-trump-eases-20276304.php",
    "timestamp": "2025-04-15T04:39:52Z"
  },
  {
    "title": "Iran’s top diplomat to visit Russia after US nuclear talks",
    "description": "Iran’s foreign minister is to visit ally Russia this week to discuss nuclear negotiations with the United States, ahead of a new round of talks planned between the foes. On Saturday, Abbas Araghchi held talks with US Middle East envoy Steve Witkoff in Oman — …",
    "link": "https://www.digitaljournal.com/news/irans-top-diplomat-to-visit-russia-after-us-nuclear-talks/article",
    "timestamp": "2025-04-15T04:37:21Z"
  },
  {
    "title": "Iran’s top diplomat to visit Russia after US nuclear talks",
    "description": "Iran’s foreign minister is to visit ally Russia this week to discuss nuclear negotiations with the United States, ahead of a new round of talks planned between the foes. On Saturday, Abbas Araghchi held talks with US Middle East envoy Steve Witkoff in Oman — …",
    "link": "https://www.digitaljournal.com/world/irans-top-diplomat-to-visit-russia-after-us-nuclear-talks/article",
    "timestamp": "2025-04-15T04:37:21Z"
  },
  {
    "title": "Xi’s Vietnam trip aiming to ‘screw’ US, says Trump",
    "description": "China’s President Xi Jinping paid tribute to Vietnam’s late revolutionary leader Ho Chi Minh on Tuesday, his last day of a trip to Hanoi that President Donald Trump said was aiming to “screw” the United States. Xi is in Vietnam as part of a Southeast Asia tou…",
    "link": "https://www.digitaljournal.com/world/xis-vietnam-trip-aiming-to-screw-us-says-trump/article",
    "timestamp": "2025-04-15T04:37:21Z"
  },
  {
    "title": "Iran's Top Diplomat To Visit Russia After US Nuclear Talks",
    "description": "Iran's foreign minister is to visit ally Russia this week to discuss nuclear negotiations with the United States, ahead of a new round of talks planned between the foes.",
    "link": "https://www.ibtimes.com/irans-top-diplomat-visit-russia-after-us-nuclear-talks-3770095",
    "timestamp": "2025-04-15T04:36:16Z"
  },
  {
    "title": "Briefings reveal EU faces choice between US and China",
    "description": "Further tariffs on pharma now seen as likely despite 90-day pause",
    "link": "https://www.irishtimes.com/politics/2025/04/15/briefings-suggest-eu-faces-choice-between-us-and-china/",
    "timestamp": "2025-04-15T04:36:10Z"
  },
  {
    "title": "Trump Envoy Suggests One Out-Of-The-Box Way To ‘Reshape Russian-United States Relationship’ And Bring Stability",
    "description": "Trump’s special envoy Steve Witkoff suggested there’s a \"possibility\" for the U.S. and Russia to reshape their relationship through \"commercial opportunities.\"",
    "link": "https://dailycaller.com/2025/04/15/steve-witkoff-putin-russia-us-deal-peace-ukraine-donald-trump/",
    "timestamp": "2025-04-15T04:32:02Z"
  },
  {
    "title": "USAID cuts leave African health systems in crisis as malaria, cholera surge",
    "description": "As clouds gather and humidity rises across West Africa, whose annual rains bring an uptick of deadly, malaria-carrying mosquitoes, Musa Adamu Ibrahim, a nurse, is sitting at home, unemployed. In Nigeria — home to 30 percent of the world’s annual 600,000 malar…",
    "link": "https://punchng.com/usaid-cuts-leave-african-health-systems-in-crisis-as-malaria-cholera-surge/",
    "timestamp": "2025-04-15T04:31:55Z"
  },
  {
    "title": "‘Significant effort’ needed to avoid Trump tariffs, says EU trade chief",
    "description": "Maroš Šefčovič reiterated the EU's commitment to removing duties on industrial goods and suggested Brussels could also abolish \"non-tariff barriers\" to transatlantic trade.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/significant-effort-needed-to-avoid-trump-tariffs-says-eu-trade-chief/",
    "timestamp": "2025-04-15T04:30:58Z"
  },
  {
    "title": "Mohsen Mahdawi: Palestinian student activist arrested at US citizenship interview",
    "description": "The green card holder was held \"in direct retaliation\" for his role in campus protests, says his lawyer.",
    "link": "https://www.bbc.co.uk/news/articles/cwy0332y7xzo",
    "timestamp": "2025-04-15T04:30:53Z"
  },
  {
    "title": "Joe Biden will speak about Social Security in his return to national stage",
    "description": "Former President Joe Biden is returning to the national stage to help elevate concerns that President Donald Trump’s agenda is threatening the health of Social Security",
    "link": "https://abcnews.go.com/US/wireStory/joe-biden-speak-social-security-return-national-stage-120813737",
    "timestamp": "2025-04-15T04:30:18Z"
  },
  {
    "title": "Trump 'Appreciates' Nayib Bukele For Accepting Deportees, El Salvador's President Refuses To Return Maryland Resident: 'I'm Not Going To Do It'",
    "description": "President Donald Trump met President Nayib Bukele of El Salvador at the White House on Monday, where they discussed the mistaken deportation of a Maryland resident to the Central American country and their prospective return.\nWhat Happened: Trump thanked Buke…",
    "link": "https://biztoc.com/x/f3052e435862d59c",
    "timestamp": "2025-04-15T04:30:08Z"
  },
  {
    "title": "Joe Biden will speak about Social Security in his return to national stage",
    "description": "Former President Joe Biden is returning to the national stage to help elevate concerns President Donald Trump’s agenda is threatening the health of Social Security",
    "link": "https://www.wsbradio.com/news/politics/joe-biden-will-speak/T7NN3EEQCBGFPHCVMKXCUNTOVQ/",
    "timestamp": "2025-04-15T04:23:40Z"
  },
  {
    "title": "Jon Stewart Takes Serious Tone as He Slams Trump Over the Deportation of Kilmar Abrego Garcia: ‘I Did Not Think He Would Get This Authoritarian This Fast’",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart took a more serious tone than usual as he slammed President Donald Trump for the deportation of Kilmar Abrego Garcia. Stewart opened the segment by explaining the situation surrounding Garcia. According …",
    "link": "https://variety.com/2025/tv/news/jon-stewart-trump-kilmar-abrego-garcia-the-daily-show-1236369544/",
    "timestamp": "2025-04-15T04:23:00Z"
  },
  {
    "title": "Vance says US and UK 'working very hard' on trade deal and will come to a 'great agreement'",
    "description": "US vice president JD Vance has said America and the UK are \"working very hard\" on a trade deal and he believes they will reach a \"great agreement\".",
    "link": "https://news.sky.com/story/jd-vance-says-us-and-uk-working-very-hard-on-trade-deal-and-will-come-to-a-great-agreement-13349142",
    "timestamp": "2025-04-15T04:23:00Z"
  },
  {
    "title": "Trump defies court order to stop blacklisting journalists",
    "description": "US President Donald Trump has reaffirmed the ban on AP reporters covering his events Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615765-trump-bans-ap-reporters/",
    "timestamp": "2025-04-15T04:21:22Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez Hits Marjorie Taylor Greene With 1 Damning Question",
    "description": "The New York Democrat slammed the Georgia Republican for stock trades just before Trump announced his tariff pause.",
    "link": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-marjorie-taylor-greene-stocks_n_67fdc21be4b070cabdc40068",
    "timestamp": "2025-04-15T04:17:16Z"
  },
  {
    "title": "Trump Seemingly Claims He Helped Tim Cook With Tariff Exclusions: 'I Don't Want to Hurt Anybody'",
    "description": "President Trump seemingly revealed that he 'helped' Tim Cook with US tariff exclusions amidst Apple dealing with its effects.",
    "link": "https://www.ibtimes.com/trump-seemingly-claims-he-helped-tim-cook-tariff-exclusions-i-dont-want-hurt-anybody-3770094",
    "timestamp": "2025-04-15T04:12:42Z"
  },
  {
    "title": "Trump says Zelensky shares blame for war dead",
    "description": "The US president says Ukraine's leader shares blame for the war with Vladimir Putin and Joe Biden.",
    "link": "https://www.bbc.com/news/articles/cg5q0mev07lo",
    "timestamp": "2025-04-15T04:11:29Z"
  },
  {
    "title": "Asian shares are mostly higher after Trump eases some of his tariffs on electronics, for now",
    "description": "Asian benchmarks mostly rose Tuesday, echoing a rally on Wall Street after President Donald Trump relaxed some of his tariffs, for now at least, and as...",
    "link": "https://finance.yahoo.com/news/asian-shares-mostly-higher-trump-041109059.html",
    "timestamp": "2025-04-15T04:11:09Z"
  },
  {
    "title": "Trump Hints At U-Turn On Auto Tariffs: \"Some Car Companies Need Time To...\"",
    "description": "Asian stocks edged slightly higher on Tuesday as some stability returned to markets, as US President Donald Trump floated a potential pause in auto-related, giving a boost to the sector after last week&#039;s rollercoaster ride.",
    "link": "https://www.ndtv.com/world-news/donald-trump-hints-at-u-turn-on-auto-tariffs-some-car-companies-need-time-to-8166600",
    "timestamp": "2025-04-15T04:08:48Z"
  },
  {
    "title": "How Wall Street got Donald Trump wrong",
    "description": "Titans of finance and business are beginning to realise they misread the president’s second-term priorities",
    "link": "https://biztoc.com/x/406cf1b0352ca106",
    "timestamp": "2025-04-15T04:07:38Z"
  },
  {
    "title": "‘Immoral, Inhumane, and Illegal’: ICE Arrests Palestinian Columbia Protest Leader at urging of Far Right Zionist Betar Org.",
    "description": "'He came to this country hoping to be free to speak out about the atrocities he has witnessed, only to be punished for such speech,' said Mohsen Mahdawi's lawyer. ( Common Dreams ) - A month after the international far-right pro-Israel group Betar named Colum…",
    "link": "https://www.juancole.com/2025/04/inhumane-palestinian-columbia.html",
    "timestamp": "2025-04-15T04:04:28Z"
  },
  {
    "title": "'Good chance' of US-UK trade deal, says Vance",
    "description": "The Trump administration's trade policy shakeup has caused global economic turmoil.",
    "link": "https://www.bbc.com/news/articles/cly1j4yg872o",
    "timestamp": "2025-04-15T04:02:21Z"
  },
  {
    "title": "Beauty M&A Faces Further Uncertainty Amid Tariffs",
    "description": "U.S. tariffs, recession fears, and shifting market dynamics are disrupting beauty M&A activity.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/beauty-maanda-faces-further-uncertainty-amid-tariffs-1237082132/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "The Real Costello",
    "description": "A change of pace is always welcome, especially when writing a column about politics. The latter can be as boring as writing about cooking, and the only newspaper that used a cookery writer as a political pundit is The New York Times. I think he’s called Frank…",
    "link": "https://www.lewrockwell.com/2025/04/taki-theodoracopulos/the-real-costello/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "The FBI Knew All Along",
    "description": "You do not have to wade far into the recently declassified Crossfire Hurricane documents to be shocked.  I had only read three pages of the FBI’s December 19, 2016 interview with the DoJ’s Bruce Ohr before learning just how early in the game the FBI brass kne…",
    "link": "https://www.lewrockwell.com/2025/04/no_author/the-fbi-knew-all-along/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "Is ‘De-Dollerization’ on the Table? BRICS Summit Approaches as Trade War Simmers",
    "description": "For many years now I have been talking about the growing global economic divide between East and West. This volatile opposition between the BRICS nations and the US is not a product of the Trump era. It has been decades in the making with a myriad of complex …",
    "link": "https://www.lewrockwell.com/2025/04/brandon-smith/is-de-dollerization-on-the-table-brics-summit-approaches-as-trade-war-simmers/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "Expect Them To Lie About China Just Like They Lied About Gaza",
    "description": "As Washington’s cold war with China escalates, we can expect to see a massively reinvigorated anti-China propaganda campaign in the west. As this unfolds, please know that everything you learned about the mass media’s dishonesty regarding Gaza is equally true…",
    "link": "https://www.lewrockwell.com/2025/04/no_author/expect-them-to-lie-about-china-just-like-they-lied-about-gaza/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "Standing at the Edge of the Iran War Cliff",
    "description": "Millions of people around the world were at the edge of their seats over the weekend, waiting to hear whether Trump special envoy Steve Witkoff’s indirect talks with the Iranian foreign minister would ratchet down tensions or would break down and bring on a m…",
    "link": "https://www.lewrockwell.com/2025/04/ron-paul/standing-at-the-edge-of-the-iran-war-cliff/",
    "timestamp": "2025-04-15T04:01:00Z"
  },
  {
    "title": "Sensex jumps over 1,500 points; Nifty tops 23,300 on US tariff relief",
    "description": "Indian benchmark indices Sensex and Nifty50 witnessed a significant surge on Tuesday morning, fueled by widespread buying across various sectors. This rally was triggered by U.S. President Donald Trump's decision to exempt electronics from proposed tariffs, p…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-1500-points-nifty-tops-23300-on-us-tariff-relief/articleshow/120298003.cms",
    "timestamp": "2025-04-15T04:00:16Z"
  },
  {
    "title": "The Best Cameras Under $1500 to Buy Today",
    "description": "Buying a new camera today can be very daunting. Mirrorless cameras are getting more expensive every year, and the new set of tariffs by Donald Trump makes the dream of buying new cameras just another dream. While the world deals with the financial meltdown th…",
    "link": "https://www.thephoblographer.com/2025/04/15/the-best-cameras-under-1500-to-buy-today/",
    "timestamp": "2025-04-15T04:00:00Z"
  },
  {
    "title": "Biden’s illegal aliens came like the ‘killer bees’",
    "description": "In the 1950s, Brazil began experimenting with crossbreeding domestic bees with Africanized bees—the latter known as “killer bees” due to their aggressive behavior and tendency to attack in swarms. Unsurprisingly, swarms of the kille...",
    "link": "https://www.americanthinker.com/blog/2025/04/biden_s_illegal_aliens_came_like_the_killer_bees.html",
    "timestamp": "2025-04-15T04:00:00Z"
  },
  {
    "title": "Iran: Next round of talks with US will be held Saturday in Oman",
    "description": "Iran's foreign ministry says the next round of talks between the United States and Iran over Tehran's nuclear program will be held in Oman on Saturday.",
    "link": "https://www.israelnationalnews.com/news/406844",
    "timestamp": "2025-04-15T03:59:27Z"
  },
  {
    "title": "Sensex Rallies 1,500 Points, Trump's Tariff Relief Hint Boosts Auto Stocks",
    "description": "Indian equities rallied over 2% this morning - following its Asian peers - as Donald Trump hinted at relief from steep tariffs in the automobile sector.",
    "link": "https://www.ndtv.com/india-news/sensex-rallies-1-500-points-auto-stocks-rise-as-donald-trump-hints-at-tariff-relief-8166546",
    "timestamp": "2025-04-15T03:57:28Z"
  },
  {
    "title": "Trump considers pausing auto tariffs as world economy endures whiplash",
    "description": "President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.",
    "link": "https://biztoc.com/x/8406f75551322505",
    "timestamp": "2025-04-15T03:56:13Z"
  },
  {
    "title": "No ‘Time To Convince People Of Our Position’: Jasmine Crockett Tells Followers To Fight Republican ‘Sideshow’",
    "description": "Rep. Crockett said Democrats don’t “have time” to convince voters of their \"position\" with upcoming elections, but should focus on their friends and families.",
    "link": "https://dailycaller.com/2025/04/14/jasmine-crockett-dems-elections-voters-convince/",
    "timestamp": "2025-04-15T03:55:15Z"
  },
  {
    "title": "‘The Daily Show’s Jon Stewart Says Trump Has “All The Ingredients To Be A Top-Tier Authoritarian” — Except The “Ruthless Competence”",
    "description": "The Daily Show‘s Jon Stewart dedicated tonight’s episode to playing a game called “How Authoritarian Is We?” highlighting President Donald Trump’s sycophantic cabinet and his taste for the opulent and absurd — and mocking the fact that he’s missing one crucia…",
    "link": "http://deadline.com/2025/04/the-daily-show-jon-stewart-trump-authoritarian-1236368657/",
    "timestamp": "2025-04-15T03:48:35Z"
  },
  {
    "title": "04/14/25",
    "description": "Hi y'all,",
    "link": "https://www.advocate.com/newsletter/04-14-25",
    "timestamp": "2025-04-15T03:46:23Z"
  },
  {
    "title": "JACKSON HEWITT: Five things we learned from the RBA minutes release",
    "description": "JACKSON HEWITT: The first meeting of the new Monetary Policy Board at the Reserve Bank has revealed it has an optimistic view of the domestic economy, but global turmoil is a looming threat.",
    "link": "https://thenightly.com.au/business/jackson-hewitt-five-things-we-learned-from-the-rba-minutes-release-c-18380079",
    "timestamp": "2025-04-15T03:35:43Z"
  },
  {
    "title": "Feds Borrowed $1.3 Trillion in the First 6 Months of This Fiscal Year (Eric Boehm/Reason)",
    "description": "Eric Boehm / Reason:\nFeds Borrowed $1.3 Trillion in the First 6 Months of This Fiscal Year  —  That's the highest total outside of the COVID-19 pandemic, and now Congress wants to borrow even more.  —  President Donald Trump stood before a joint session of Co…",
    "link": "https://www.memeorandum.com/250414/p134",
    "timestamp": "2025-04-15T03:35:01Z"
  },
  {
    "title": "Will ASX 200 investors get an interest rate cut in May? Here's what the RBA minutes tell us",
    "description": "With inflation slowing and a global trade war looming, will ASX 200 investors receive an RBA interest rate cut in May?\nThe post Will ASX 200 investors get an interest rate cut in May? Here's what the RBA minutes tell us appeared first on The Motley Fool Austr…",
    "link": "https://www.fool.com.au/2025/04/15/will-asx-200-investors-get-an-interest-rate-cut-in-may-heres-what-the-rba-minutes-tell-us/",
    "timestamp": "2025-04-15T03:32:35Z"
  },
  {
    "title": "China's largest iPhone factory resumes hiring after Trump spares electronics from tariffs",
    "description": "<p>Apple supplier Foxconn Technology Group has resumed recruitment at the world's largest iPhone factory, located in the central Chinese city of Zhengzhou, following a brief suspension after US President Donald Trump imposed new tariffs on Chinese goods earli…",
    "link": "https://www.bangkokpost.com/business/general/3003511/chinas-largest-iphone-factory-resumes-hiring-after-trump-spares-electronics-from-tariffs",
    "timestamp": "2025-04-15T03:27:00Z"
  },
  {
    "title": "China's largest iPhone factory resumes hiring after tariff break",
    "description": "<p>Apple supplier Foxconn Technology Group has resumed recruitment at the world's largest iPhone factory, located in the central Chinese city of Zhengzhou, following a brief suspension after US President Donald Trump imposed new tariffs on Chinese goods earli…",
    "link": "https://www.bangkokpost.com/business/general/3003511/chinas-largest-iphone-factory-resumes-hiring-after-tariff-break",
    "timestamp": "2025-04-15T03:27:00Z"
  },
  {
    "title": "US argues Meta built a social media monopoly",
    "description": "The FTC has launched a landmark antitrust trial accusing Meta of illegally monopolizing social media by acquiring Instagram and WhatsApp to stifle competition. The case could lead to divestitures and reshape Big Tech's acquisition playbook, though legal exper…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-argues-meta-built-a-social-media-monopoly/articleshow/120297339.cms",
    "timestamp": "2025-04-15T03:24:17Z"
  },
  {
    "title": "EU officials get spy-proof gear for US visits as Trump-era tensions heat up trasatlantic relations",
    "description": "The European Commission is now providing burner phones and basic laptops to senior officials visiting the U.S., mirroring precautions taken for trips to China and Ukraine. This unprecedented move reflects growing mistrust due to strained transatlantic relatio…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-officials-get-spy-proof-gear-for-us-visits-as-trump-era-tensions-heat-up-trasatlantic-relations/articleshow/120297194.cms",
    "timestamp": "2025-04-15T03:20:57Z"
  },
  {
    "title": "Confusion over chip, smartphone tariffs unfolds in US",
    "description": "After the Trump administration exempted smartphones and semiconductors from tariffs on Friday, the president backtracked and warned no one was \"getting off the hook\".",
    "link": "https://www.abc.net.au/news/2025-04-15/trump-electronics-semiconductor-tariff-exemption-explained/105178380",
    "timestamp": "2025-04-15T03:14:11Z"
  },
  {
    "title": "Auto stocks jump in Asia as Trump considers tariff exemption",
    "description": "TOKYO -- From Japan to South Korea, shares of automakers and auto parts manufacturers jumped Tuesday morning, following U.S. President Donald Trump's suggestion that he is considering temporarily exempting the industry from his previously announced 25% tariff…",
    "link": "https://biztoc.com/x/22dcb1e66397fc12",
    "timestamp": "2025-04-15T03:12:10Z"
  },
  {
    "title": "A Palestinian activist expecting a US citizenship interview is arrested instead by ICE in Vermont",
    "description": "A Palestinian man who led protests against the war in Gaza as a student at Columbia University has been arrested at a Vermont immigration office where he expected to be interviewed about finalizing his U.S. citizenship.",
    "link": "https://apnews.com/article/immigration-palestine-protest-trump-deportation-columbia-fca7e73fe2cbd616c1eacf3bdececdbe",
    "timestamp": "2025-04-15T03:09:00Z"
  },
  {
    "title": "Inside factories in China, a struggle to survive Trump's tariffs",
    "description": "Chinese factories in Guangzhou face challenges as President Trump's tariffs reach 125%, causing order cancellations and uncertainty. Small factories, vital to China's economy, grapple with finding new buyers amid existing overcapacity and frugal domestic cons…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/inside-factories-in-china-a-struggle-to-survive-trumps-tariffs/articleshow/120297021.cms",
    "timestamp": "2025-04-15T03:07:08Z"
  },
  {
    "title": "Witkoff: Trump seeks to limit Iran's uranium enrichment",
    "description": "US President Donald Trump is seeking to limit Iran's uranium enrichment to 3.67%, White House special envoy St",
    "link": "https://www.jpost.com/breaking-news/article-850149",
    "timestamp": "2025-04-15T03:06:48Z"
  },
  {
    "title": "AOC Says Trump ‘Should Look in the Mirror’ When ‘He Talks About Rapists and Criminals’",
    "description": "Rep. Alexandria Ocasio-Cortez (D-NY) told President Donald Trump to \"look in the mirror\" when \"he talks about rapists and criminals\" during a rally.\nThe post AOC Says Trump ‘Should Look in the Mirror’ When ‘He Talks About Rapists and Criminals’ first appeared…",
    "link": "https://www.mediaite.com/politics/aoc-says-trump-should-look-in-the-mirror-when-he-talks-about-rapists-and-criminals/",
    "timestamp": "2025-04-15T03:05:49Z"
  },
  {
    "title": "South Korea unveils $23 billion support package for chips amid US tariff uncertainty",
    "description": "Seoul will also ramp up a financial assistance programme for the chips industry to 20 trillion won, versus the previous 17 trillion won, according to the joint statement from various ministries including the trade ministry.",
    "link": "https://economictimes.indiatimes.com/tech/technology/south-korea-unveils-23-billion-support-package-for-chips-amid-us-tariff-uncertainty/articleshow/120296955.cms",
    "timestamp": "2025-04-15T03:03:51Z"
  },
  {
    "title": "'I Thought This Day Would Never Come': Ex-Prosecutor Reveals Trump's 'Crisis' Moment",
    "description": "Andrew Weissman issued a dire warning if SCOTUS doesn't take \"drastic steps\" in response to Donald Trump's deportations.",
    "link": "https://www.huffpost.com/entry/msnbc-andrew-weissmann-trump-deportations-supreme-court_n_67fd8e79e4b070cabdc3efd1",
    "timestamp": "2025-04-15T03:03:37Z"
  },
  {
    "title": "China's economy likely grew 5.1% in Q1 on export surge: Poll",
    "description": "China's first-quarter growth is projected at around five percent, fueled by exporters anticipating higher US tariffs. Despite this boost, sluggish domestic consumption and a property market crisis continue to weigh on the economy. Analysts anticipate further …",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-economy-likely-grew-5-1-in-q1-on-export-surge-poll/articleshow/120296946.cms",
    "timestamp": "2025-04-15T03:03:35Z"
  },
  {
    "title": "Asian Stocks Mixed As Stability Returns, Autos Lifted By Exemption Hope",
    "description": "Asian stocks were mixed Tuesday as some stability returned to markets after last week's rollercoaster ride, with auto firms boosted by Donald Trump's possible compromise over steep tariffs on the sector.",
    "link": "https://www.ibtimes.com/asian-stocks-mixed-stability-returns-autos-lifted-exemption-hope-3770083",
    "timestamp": "2025-04-15T03:03:16Z"
  }
]