[
  {
    "title": "Trump unveils UK trade deal, first since tariff blitz",
    "description": "U.S. President Donald Trump and British Prime Minister Keir Starmer unveiled a \"historic\" trade agreement Thursday, Trump's first deal with any country since he unleashed a blitz of sweeping global tariffs.",
    "link": "https://www.hurriyetdailynews.com/trump-unveils-uk-trade-deal-first-since-tariff-blitz-208975",
    "timestamp": "2025-05-09T05:44:07Z"
  },
  {
    "title": "Former spy chiefs: PET has no problem monitoring U.S. diplomats",
    "description": "In the 1970s, Denmark expelled three CIA agents. One of PET’s tasks is to counter foreign espionage, which may now include keeping an eye on the United States.",
    "link": "https://politiken.dk/edition/news/art10405343/PET-has-no-problem-monitoring-U.S.-diplomats",
    "timestamp": "2025-05-09T05:42:40Z"
  },
  {
    "title": "China's exports rose a higher than expected 8% in April",
    "description": "China's exports rose a higher than expected 8% in Aprilwgal.com",
    "link": "https://www.wgal.com/article/chinas-exports-rose-a-higher-than-expected/64721609",
    "timestamp": "2025-05-09T05:42:27Z"
  },
  {
    "title": "Leo XIV and the “diplomacy of the conclave”: geopolitics, demographics and… Trump behind the election of the new Pope",
    "description": "Will Leo IV bring the Catholic Church closer to the right-wing policies of the West or will he \"counter\" the MAGA movement, like Francis? What international analysts say\nThe post Leo XIV and the “diplomacy of the conclave”: geopolitics, demographics and… Trum…",
    "link": "https://en.protothema.gr/2025/05/09/leo-xiv-and-the-diplomacy-of-the-conclave-geopolitics-demographics-and-trump-behind-the-election-of-the-new-pope/",
    "timestamp": "2025-05-09T05:42:11Z"
  },
  {
    "title": "The aluminum sector isn't moving to the U.S. despite tariffs — due to one key reason",
    "description": "Tariffs are reshaping global trade flows and inflating costs for American consumers, but are falling to revive domestic aluminum production.",
    "link": "https://www.cnbc.com/2025/05/09/the-aluminum-sector-isnt-moving-to-the-us-despite-tariffs.html",
    "timestamp": "2025-05-09T05:31:58Z"
  },
  {
    "title": "U.S. tariff pressure has retailers evaluating their prices",
    "description": "Household brands including Pandora, Puma and Hugo Boss have all said they are evaluating their pricing strategies in the U.S.",
    "link": "https://www.cnbc.com/2025/05/09/us-tariff-pressures-has-retailers-evaluating-their-prices.html",
    "timestamp": "2025-05-09T05:30:20Z"
  },
  {
    "title": "Trump UK Trade Deal Pumps Crypto: $ETH Skyrockets, $BTC Hits $103K, $XRP Surges",
    "description": "President Trump has announced a trade agreement with a long-time ally, pumping crypto prices, including Bitcoin, which had been struggling to return to $100,000 in recent weeks.",
    "link": "https://www.ibtimes.com/trump-uk-trade-deal-pumps-crypto-eth-skyrockets-btc-hits-103k-xrp-surges-3773020",
    "timestamp": "2025-05-09T05:22:14Z"
  },
  {
    "title": "Lindsey Graham: 'No support for security deal with Saudi without normalization'",
    "description": "Republican Senator stated that he would not support the Trump administration's move if it waives the demand for normalization as a condition for a security agreement with Saudi Arabia.",
    "link": "https://www.israelnationalnews.com/news/408083",
    "timestamp": "2025-05-09T05:22:00Z"
  },
  {
    "title": "President Trump fires Librarian of Congress Carla Hayden",
    "description": "Hayden, who became the first woman and the first African American to serve as the Librarian of Congress when she was appointed in 2016, was abruptly fired via email late Thursday.",
    "link": "https://www.npr.org/2025/05/09/g-s1-65271/librarian-of-congress-fired",
    "timestamp": "2025-05-09T05:18:52Z"
  },
  {
    "title": "Today in Sweden: A roundup of the latest news on Friday",
    "description": "Bishop who delivered sermon that enraged Trump invited to opening of Swedish parliament, Sweden's new national security adviser quits ill-fated position over Grindr pictures, and migration minister rejects extending 'three-month deadline' for laid-off Northvo…",
    "link": "https://www.thelocal.se/20250509/today-in-sweden-a-roundup-of-the-latest-news-on-friday-179",
    "timestamp": "2025-05-09T05:18:13Z"
  },
  {
    "title": "Trump Continues Poaching From Fox, Taps Host Jeanine Pirro as D.C. Prosecutor",
    "description": "President Trump tapped Fox News host Jeanine Pirro, a former county prosecutor and elected judge, to serve as the interim U.S. attorney for D.C.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-jeanine-pirro-replace-ed-martin-dc-prosecutor-1235335192/",
    "timestamp": "2025-05-09T05:17:52Z"
  },
  {
    "title": "Karachi Stock Exchange's benchmark index recovers 2% after steep fall amid India-Pakistan tensions",
    "description": "As of 10:10 am IST on Friday, the KSE-100 index climbed 1,940.9 points, or 1.9%, to 105,467.7, as investors cautiously re-entered the market following two days of sharp declines triggered by Operation Sindoor.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/karachi-stock-exchanges-benchmark-index-recovers-2-after-steep-fall-amid-india-pakistan-tensions/articleshow/121019099.cms",
    "timestamp": "2025-05-09T05:16:45Z"
  },
  {
    "title": "Letter to Trump from members of Congress: Erdogan has been threatening to invade Greece and Israel for years",
    "description": "The letter refers to US-Turkey bilateral relations, security in the Eastern Mediterranean and regional stability\nThe post Letter to Trump from members of Congress: Erdogan has been threatening to invade Greece and Israel for years appeared first on ProtoThema…",
    "link": "https://en.protothema.gr/2025/05/09/letter-to-trump-from-members-of-congress-erdogan-has-been-threatening-to-invade-greece-and-israel-for-years/",
    "timestamp": "2025-05-09T05:15:57Z"
  },
  {
    "title": "Toyota: Trump tariffs will cost $1.3B over 2 months",
    "description": "",
    "link": "https://biztoc.com/x/02d329835e5b2315",
    "timestamp": "2025-05-09T05:14:42Z"
  },
  {
    "title": "Jimmy's T-Shirt Company opens in former Wyndridge Farm tasting room in Lancaster",
    "description": "A T-shirt shop has begun operating out of the former home of Wyndridge Farm’s Lancaster city tasting room, which won’t be reopening.",
    "link": "https://lancasteronline.com/business/whats_in_store/jimmys-t-shirt-company-opens-in-former-wyndridge-farm-tasting-room-in-lancaster/article_d0090214-1749-4990-b02b-2dc2a821c788.html",
    "timestamp": "2025-05-09T05:14:40Z"
  },
  {
    "title": "NBA legend Charles Barkley goes scorched earth on transgender athletics debate",
    "description": "The 62-year-old Hall of Famer's views come as the sports world continues to debate the polarizing subject.",
    "link": "https://nypost.com/2025/05/09/sports/nba-legend-charles-barkley-shares-views-out-on-transgender-athletes-debate/",
    "timestamp": "2025-05-09T05:14:23Z"
  },
  {
    "title": "TV Legend William Shatner Fires Back At Trump's 'Insulting' Offer",
    "description": "The Canadian actor found \"joy\" in countering the U.S. president's \"unserious\" annexation talk.",
    "link": "https://www.huffpost.com/entry/william-shatner-trump-canada-united-states-province-deal_n_681d768be4b0a178bc00251d",
    "timestamp": "2025-05-09T05:06:25Z"
  },
  {
    "title": "The first US pope is a moderate like Francis. Will he bump up against Trump?",
    "description": "In broad political terms, Robert Prevost's election stands as the latest rebuke to Trumpism.\nThe post The first US pope is a moderate like Francis. Will he bump up against Trump? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/09/pope-leo-xiv-donald-trump/",
    "timestamp": "2025-05-09T05:01:11Z"
  },
  {
    "title": "Donald Trump’s chilling assault on universities mirrors that of the Nazis in 1930s Germany",
    "description": "Expect book burnings soon to further scapegoat the “enemies of the nation”",
    "link": "https://www.irishtimes.com/opinion/2025/05/09/donald-trumps-chilling-assault-on-universities-mirrors-that-of-the-nazis-in-1930s-germany/",
    "timestamp": "2025-05-09T05:00:01Z"
  },
  {
    "title": "Anyone not coupled up gets the message – no dogs or singletons welcome",
    "description": "Single? You'll pay more on holiday, in the supermarket and for your tax bill",
    "link": "https://www.irishtimes.com/opinion/2025/05/09/justine-mccarthy-single-unmarried/",
    "timestamp": "2025-05-09T05:00:01Z"
  },
  {
    "title": "‘My message is clear for Ireland, electricity is the future,’ IEA director Fatih Birol",
    "description": "Electrification should be overriding priority for Irish economy, industry and society, says International Energy Agency chief",
    "link": "https://www.irishtimes.com/business/economy/2025/05/09/electricity-renewables-ireland-iea-birol/",
    "timestamp": "2025-05-09T05:00:00Z"
  },
  {
    "title": "Starmer agrees to quick US trade deal to save UK car industry",
    "description": "Negotiations continue over US’s across-the-board 10% reciprocal tariffs",
    "link": "https://www.irishtimes.com/business/2025/05/09/starmer-agrees-to-quick-us-trade-deal-to-save-the-uk-car-industry/",
    "timestamp": "2025-05-09T05:00:00Z"
  },
  {
    "title": "Asian stocks are mixed after hopes for China-US talks, trade deal with the UK lift Wall Street",
    "description": "HONG KONG (AP) — Shares were mixed in Asia on Friday as investors pinned their hopes on weekend trade talks between China and the U.S. U.S. futures and oil prices logged modest gains. China reported that its exports rose at a faster-than-expected 8.1% annual …",
    "link": "https://financialpost.com/pmn/asian-stocks-are-mixed-after-hopes-for-china-us-talks-trade-deal-with-the-uk-lift-wall-street",
    "timestamp": "2025-05-09T04:57:58Z"
  },
  {
    "title": "Crude oil futures rise as market awaits US-China talks",
    "description": "At 9.58 am on Friday, July Brent oil futures were at $63.10, up by 0.41 per cent, and June crude oil futures on WTI (West Texas Intermediate) were at $60.16, up by 0.42 per cent.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-market-awaits-us-china-talks/article69556033.ece",
    "timestamp": "2025-05-09T04:55:34Z"
  },
  {
    "title": "The Big Picture",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/lessons-from-a-scholar-of-power-doc-2025-05",
    "timestamp": "2025-05-09T04:52:08Z"
  },
  {
    "title": "China’s April exports rise even as tariffs undercut US shipments",
    "description": "Total exports expanded 8.1 % last month, above the 2% increase forecast by economists; Shipments to the US fell 21% after the imposition of tariffs in early April and imports fell 0.2 per cent%, leaving a trade surplus of $96 billion",
    "link": "https://www.bloomberg.com/news/articles/2025-05-09/china-s-april-exports-rise-even-as-tariffs-undercut-us-shipments",
    "timestamp": "2025-05-09T04:49:39Z"
  },
  {
    "title": "[In This Economy] Slowest pre-election economic growth in more than two decades: How come?",
    "description": "I’m not optimistic that we’ll elect the right leaders fit for the job of fixing the economy’s many ills. Don’t be surprised if it takes us a lot longer to catch up with our regional peers.",
    "link": "https://www.rappler.com/voices/thought-leaders/in-this-economy-slowest-pre-election-economic-growth-decades-how-come/",
    "timestamp": "2025-05-09T04:47:48Z"
  },
  {
    "title": "Palantir Revisited: Who’s Us in Us vs. Them?",
    "description": "Further discussion of the reductivist \"Your with us or your against us\" world view, which Newspeak-wise, is being reduced to hatred of Them.",
    "link": "https://www.nakedcapitalism.com/2025/05/palantir-revisited-whos-us-in-us-vs-them.html",
    "timestamp": "2025-05-09T04:40:36Z"
  },
  {
    "title": "EU to reassess Israel trade deal amid Gaza war concerns",
    "description": "European Union foreign ministers are set to formally discuss reviewing a trade agreement with Israel amid deepening concern over the humanitarian crisis in Gaza.",
    "link": "https://www.israelnationalnews.com/news/408082",
    "timestamp": "2025-05-09T04:35:08Z"
  },
  {
    "title": "Crypto news today: Bitcoin pushes past $102K as record ETF flows, trade news fuel rally",
    "description": "Bitcoin surged over 3% in 24 hours, topping $104,000 (highest since Jan 31). Nearly $400 million in bearish BTC short positions were liquidated in 24 hours (highest since Nov). The significant short squeeze suggests potential for further upside as bearish pre…",
    "link": "https://coinjournal.net/news/crypto-news-today-bitcoin-pushes-past-102k-as-record-etf-flows-trade-news-fuel-rally/",
    "timestamp": "2025-05-09T04:34:11Z"
  },
  {
    "title": "Trump Firing Librarian of Congress Carla Hayden Sparks Backlash Online",
    "description": "Dr. Carla Hayden, nominee of former President Barack Obama, was the first woman and Black congressional librarian.",
    "link": "https://www.newsweek.com/trump-firing-librarian-congress-carla-hayden-sparks-backlash-online-2069976",
    "timestamp": "2025-05-09T04:33:54Z"
  },
  {
    "title": "China export growth beats forecasts despite Trump tariffs",
    "description": "TOKYO -- China's exports recorded solid growth in April even after U.S. President Donald Trump imposed 145% tariffs on goods from the country, showing more resilience than expected thanks to increased trade with Asian and other economies.\nTotal overseas shipm…",
    "link": "https://biztoc.com/x/ddc0ec9c9874ff97",
    "timestamp": "2025-05-09T04:30:38Z"
  },
  {
    "title": "China sales to US slump even as exports beat forecasts amid trade war",
    "description": "BEIJING: China on Friday (May 9) said sales to the United States slumped last month while its total exports topped forecasts, as Beijing fought a gruelling trade war with its superpower rival. Trade between the world's two largest economies has nearly skidded…",
    "link": "https://www.channelnewsasia.com/business/china-exports-april-ships-us-trump-tariffs-5119036",
    "timestamp": "2025-05-09T04:23:00Z"
  },
  {
    "title": "China sales to US slump even as exports beat forecasts amid trade war",
    "description": "<![CDATA[ Overall outbound shipments beat expectations by rising 8.1 per cent year-on-year, giving Beijing some relief ahead of ice-breaker tariff talks with the US this weekend. ]]>",
    "link": "https://www.channelnewsasia.com/business/china-exports-april-us-shipments-trump-tariffs-trade-war-5119036",
    "timestamp": "2025-05-09T04:23:00Z"
  },
  {
    "title": "Thailand bids to join Alaska gas project before tariff talks",
    "description": "Thailand said it&rsquo;s interested in co-developing a  massive gas pipeline project  in Alaska backed by President Donald Trump, as the Southeast Asian nation explores ways to  cut its $46 billion trade surplus  with the US before tariff talks.",
    "link": "https://www.bangkokpost.com/business/general/3021621/thailand-bids-to-join-alaska-gas-project-before-tariff-talks",
    "timestamp": "2025-05-09T04:21:00Z"
  },
  {
    "title": "Pope Leo XIV Didn't Spare Trump Administration Criticism On Social Media — Now The President Says He's 'Excited' And Looking Forward To Meeting The First American Catholic Pontiff",
    "description": "On Thursday, Cardinal Robert Prevost, now Pope Leo XIV, became the first American pope — despite previously using social media to push back on Donald Trump-era policies, the president says he looks forward to their historic meeting.\nWhat Happened: A review of…",
    "link": "https://biztoc.com/x/c18bc6f77c0c72e6",
    "timestamp": "2025-05-09T04:19:26Z"
  },
  {
    "title": "Trump officials seek to bring first white South African refugees to US next week, NYT reports",
    "description": "(Reuters) - The Trump administration is working to bring the first group of white South Africans it has classified as refugees to the United States early next week, The New York Times reported on Friday, citing officials briefed on the plans and documents obt…",
    "link": "https://www.thestar.com.my/news/world/2025/05/09/trump-officials-seek-to-bring-first-white-south-african-refugees-to-us-next-week-nyt-reports",
    "timestamp": "2025-05-09T04:18:00Z"
  },
  {
    "title": "China sales to US slump even as exports beat forecasts",
    "description": "China said Friday sales to the United States slumped last month while its total exports topped forecasts, as Beijing fought a gruelling trade war with its superpower rival. Trade between the world’s two largest economies has nearly skidded to a halt since US …",
    "link": "https://www.digitaljournal.com/world/china-sales-to-us-slump-even-as-exports-beat-forecasts/article",
    "timestamp": "2025-05-09T04:17:32Z"
  },
  {
    "title": "Antisemitism Awareness Act – Protecting Jews from What?",
    "description": "Last year, Congress proposed the Antisemitism Awareness Act (AAA) (S.558 and H.R. 1007) to combat anti-Semitism, but Rep. Marjorie Taylor Greene, Sen. Tommy Tuberville and other Republican officials object to the bill because it infringes on the right of far-…",
    "link": "https://www.juancole.com/2025/05/antisemitism-awareness-protecting.html",
    "timestamp": "2025-05-09T04:15:16Z"
  },
  {
    "title": "China Sales To US Slump Even As Exports Beat Forecasts",
    "description": "China said Friday sales to the United States slumped last month while its total exports topped forecasts, as Beijing fought a gruelling trade war with its superpower rival.",
    "link": "https://www.ibtimes.com/china-sales-us-slump-even-exports-beat-forecasts-3773017",
    "timestamp": "2025-05-09T04:15:15Z"
  },
  {
    "title": "Justice Sonia Sotomayor says lawyers should stand up and fight amid turmoil in nation's legal system",
    "description": "Justice Sonia Sotomayor says lawyers should stand up and fight in battles faced by the nation's legal system",
    "link": "https://abcnews.go.com/Politics/wireStory/justice-sonia-sotomayor-lawyers-stand-fight-amid-turmoil-121627110",
    "timestamp": "2025-05-09T04:14:18Z"
  },
  {
    "title": "Did you buy the dip on Wesfarmers shares? You just made a motza!",
    "description": "Buying the dip on this ASX 200 conglomerate last month would have been a very good call. \nThe post Did you buy the dip on Wesfarmers shares? You just made a motza! appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/05/09/did-you-buy-the-dip-on-wesfarmers-shares-you-just-made-a-motza/",
    "timestamp": "2025-05-09T04:09:25Z"
  },
  {
    "title": "Trump hints tariffs on China may drop as talks set to begin",
    "description": "US President's comments come as top officials from Washington and Beijing meet hold talks in Switzerland.",
    "link": "https://www.bbc.com/news/articles/c4gkvp6438ko?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-09T04:08:57Z"
  },
  {
    "title": "Trump hints tariffs on China may drop as talks set to begin",
    "description": "Trump hints tariffs on China may drop as talks set to begin\nUS President Donald Trump has hinted that US tariffs on goods from China may come down as top trade officials from the world's two biggest economies are set to hold talks.\n\"You can't get any higher. …",
    "link": "https://biztoc.com/x/c5fed8dc94700d9e",
    "timestamp": "2025-05-09T04:07:59Z"
  },
  {
    "title": "Justice Sonia Sotomayor says lawyers should stand up and fight amid turmoil in nation's legal system",
    "description": "Justice Sonia Sotomayor says lawyers should stand up and fight in battles faced by the nation's legal system",
    "link": "https://abcnews.go.com/US/wireStory/justice-sonia-sotomayor-lawyers-stand-fight-amid-turmoil-121627109",
    "timestamp": "2025-05-09T04:06:30Z"
  },
  {
    "title": "Thailand Bids to Join Alaska Gas Project Before Tariff Talks",
    "description": "Thailand said it’s interested in co-developing a massive gas pipeline project in Alaska backed by President Donald Trump, as the Southeast Asian nation explores ways to cut its $46 billion trade surplus with the US before tariff talks.",
    "link": "https://financialpost.com/pmn/business-pmn/thailand-bids-to-join-alaska-gas-project-before-tariff-talks",
    "timestamp": "2025-05-09T04:05:00Z"
  },
  {
    "title": "The Real Evil Empire May Surprise You",
    "description": "( Tomdispatch.com ) - Forty years ago this month, I was commissioned a second lieutenant in the U.S. Air Force. I would be part of America’s all-volunteer force (AVF) for 20 years, hitting my marks and retiring as a lieutenant colonel in 2005. In my two decad…",
    "link": "https://www.juancole.com/2025/05/real-empire-surprise.html",
    "timestamp": "2025-05-09T04:04:26Z"
  },
  {
    "title": "Nearing 100, Malaysian ex-PM Dr M blasts 'old world' Trump",
    "description": "PUTRAJAYA (AFP): Former Malaysian prime minister Tun Dr Mahathir Mohamad is giving US President Donald Trump three months before his fellow Americans force him to rethink his stringent global tariff strategy, accusing the US leader of \"living in an old world\"…",
    "link": "https://www.thestar.com.my/news/nation/2025/05/09/nearing-100-malaysian-ex-pm-dr-m-blasts-039old-world039-trump",
    "timestamp": "2025-05-09T04:04:00Z"
  },
  {
    "title": "Bitcoin's Price Surge to $104K Liquidates Nearly $400M in Bearish BTC Bets, Opening Doors to Further Gains",
    "description": "The rally followed a U.K. trade deal announcement and record ETF inflows exceeding $40 billion.",
    "link": "https://www.coindesk.com/markets/2025/05/09/bitcoin-s-price-surge-to-usd104k-liquidates-nearly-usd400m-in-bearish-btc-bets-opening-doors-to-further-gains",
    "timestamp": "2025-05-09T04:03:56Z"
  },
  {
    "title": "Donald Trump Names Jeanine Pirro As Top Washington Prosecutor",
    "description": "Jeanine Pirro briefly entered politics in ill-fated attempts to run for the US Senate and for New York Attorney General, losing the latter race to Democrat Andrew Cuomo.",
    "link": "https://www.ndtv.com/world-news/donald-trump-names-jeanine-pirro-as-top-washington-prosecutor-8368581",
    "timestamp": "2025-05-09T04:03:30Z"
  },
  {
    "title": "Vance: 'Rich' for Biden to Comment on Anything Trump Admin Doing on Russia, Ukraine",
    "description": "Thursday on FNC's \"The Story,\" Vice President JD Vance dismissed former President Joe Biden's criticism regarding the Oval Office dustup between him, President Donald Trump, and Ukrainian Volodymyr Zelensky.\nThe post Vance: ‘Rich’ for Biden to Comment on Anyt…",
    "link": "https://www.breitbart.com/clips/2025/05/08/vance-rich-for-biden-to-comment-on-anything-trump-admin-doing-on-russia-ukraine/",
    "timestamp": "2025-05-09T04:02:37Z"
  },
  {
    "title": "US Change in Tone May Not be to Ukraine’s Benefit",
    "description": "The Trump administration warned recently that, if progress is not made in negotiations to end the war in Ukraine, they could walk away from the talks. On April 18, U.S. President Donald Trump said, “If for some reason one of the two parties makes it very diff…",
    "link": "https://original.antiwar.com/ted_snider/2025/05/08/us-change-in-tone-may-not-be-to-ukraines-benefit/",
    "timestamp": "2025-05-09T04:00:36Z"
  },
  {
    "title": "The new pope, the old pope, Trump and … Rush Limbaugh",
    "description": "So the world’s got a new pope. \r\n\r\nBecause Catholicism is the largest Christian denomination in the United States – and perhaps the world – and because Catholics live in almost every nation, and certainly on every continent, th...",
    "link": "https://www.americanthinker.com/blog/2025/05/the_new_pope_the_old_pope_trump_and_rush_limbaugh.html",
    "timestamp": "2025-05-09T04:00:00Z"
  },
  {
    "title": "US: Don’t Forcibly Transfer Migrants to Libya",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Men at a detention center in Tripoli, Libya, June 8, 2017.\n © 2017 Florian Gaertner/Photothek via Getty Images \n \n \n\n\n \n(New York) – The United States should not forcibly transfer migrants to Libya, where inhumane de…",
    "link": "https://www.hrw.org/news/2025/05/09/us-dont-forcibly-transfer-migrants-libya",
    "timestamp": "2025-05-09T04:00:00Z"
  },
  {
    "title": "President Trump’s Bold Statement: Greenland as America’s Strategic Imperative",
    "description": "President Donald Trump has once again done the unthinkable: he spoke a strategic truth the establishment refuses to hear. Declaring that he “doesn’t rule out” military force to annex Greenland, the POTUS turned what others would whi...",
    "link": "https://www.americanthinker.com/articles/2025/05/president_trump_s_bold_statement_greenland_as_america_s_strategic_imperative.html",
    "timestamp": "2025-05-09T04:00:00Z"
  },
  {
    "title": "The Presidency and the Media",
    "description": "Having watched the pathological media coverage of Donald Trump from the moment he threw his hat into the political ring by coming down that escalator, I wondered how other presidents did with their media portrayals.&nbsp...",
    "link": "https://www.americanthinker.com/articles/2025/05/the_presidency_and_the_media.html",
    "timestamp": "2025-05-09T04:00:00Z"
  },
  {
    "title": "Trump Calls for Russia-Ukraine Ceasefire, Threatens Sanctions",
    "description": "US President Donald Trump said on Thursday that Washington is still engaged in discussions with Moscow and Kiev, and called for a 30-day unconditional ceasefire in Ukraine, warning that new sanctions would be imposed if the ceasefire is not upheld.",
    "link": "https://sputnikglobe.com/20250509/trump-calls-for-russia-ukraine-ceasefire-threatens-sanctions-1122010159.html",
    "timestamp": "2025-05-09T03:59:00Z"
  },
  {
    "title": "Trump hints tariffs on China may drop as talks set to begin",
    "description": "US President's comments come as top officials from Washington and Beijing meet hold talks in Switzerland.",
    "link": "https://www.bbc.com/news/articles/c4gkvp6438ko",
    "timestamp": "2025-05-09T03:56:09Z"
  },
  {
    "title": "Where does Pope Leo XIV stand on key issues facing the Catholic Church?",
    "description": "Chicago-born Robert Prevost, now Pope Leo XIV, has been elected as pontiff. Here's what's anticipated from his papacy when it comes to key issues facing the Church.",
    "link": "https://www.abc.net.au/news/2025-05-09/pope-leo-xiv-key-issues-catholic-church/105272410",
    "timestamp": "2025-05-09T03:53:58Z"
  },
  {
    "title": "Trump has opened the door to a new Saudi oil-price war",
    "description": "Markets should prepare for a sharp downturn in the oil price, analysts with a satellite oil-tracking firm write in a guest commentary.",
    "link": "https://www.livemint.com/opinion/trump-has-opened-the-door-to-a-new-saudi-oil-price-war-11746758936416.html",
    "timestamp": "2025-05-09T03:52:20Z"
  },
  {
    "title": "Vance fires back at Biden’s criticism, calls his foreign policy a ‘total disaster’",
    "description": "Vice President JD Vance fired back at Joe Biden's new criticism of the infamous Oval Office meeting with Ukrainian President Volodymyr Zelensky.",
    "link": "https://nypost.com/2025/05/08/us-news/vance-fires-back-at-bidens-criticism-calls-his-foreign-policy-a-total-disaster/",
    "timestamp": "2025-05-09T03:48:35Z"
  },
  {
    "title": "Letitia James: 'We Were Ready on Day One' to File Lawsuits Against Trump",
    "description": "New York Attorney General Letitia James said Thursday on MSNBC's \"The Briefing\" that her office was \"ready on day one\" to sue President Donald Trump.\nThe post Letitia James: ‘We Were Ready on Day One’ to File Lawsuits Against Trump appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/05/08/letitia-james-we-were-ready-on-day-one-to-file-lawsuits-against-trump/",
    "timestamp": "2025-05-09T03:46:54Z"
  },
  {
    "title": "Leo XIV, first US pope, to celebrate first mass as pontiff",
    "description": "VATICAN CITY -  Pope Leo XIV  will celebrate mass Friday, the day after becoming the first US head of the Catholic Church, with the world watching for signs of what kind of pope he will be.",
    "link": "https://www.bangkokpost.com/world/3021592/leo-xiv-first-us-pope-to-celebrate-first-mass-as-pontiff",
    "timestamp": "2025-05-09T03:45:00Z"
  },
  {
    "title": "Migrant Family Drives Selves into ICE Deportation",
    "description": "ICE officials detained an illegal migrant in Georgia after she was caught violating multiple driving laws -- but she is a good-looking college student with an illegal migrant family, so she is getting extra doses of media sympathy.\nThe post Migrant Family Dri…",
    "link": "https://www.breitbart.com/immigration/2025/05/08/mexican-family-drove-themselves-deportation/",
    "timestamp": "2025-05-09T03:43:10Z"
  },
  {
    "title": "Seth Meyers: New Pope Criticized JD Vance; Conclave Upstages Trump's Underwhelming U.K. Trade Deal",
    "description": "Seth takes a closer look at Donald Trump announcing a meaningless trade deal with the United Kingdom, which is the first deal he's reached after claiming he already had 200, and him getting upstaged by the new pope.  ...",
    "link": "https://littlegreenfootballs.com/article/54592_Seth_Meyers-_New_Pope_Criticiz",
    "timestamp": "2025-05-09T03:41:00Z"
  },
  {
    "title": "US to stay out of war that's none of our business: Vance on India-Pak tensions",
    "description": "Vance quoted US President Donald Trump and Secretary of State Marco Rubio who have said that Washington wants the tensions to \"de-escalate\" as quickly as possible",
    "link": "https://www.thehindubusinessline.com/news/world/us-to-stay-out-of-war-thats-none-of-our-business-vance-on-india-pak-tensions/article69555932.ece",
    "timestamp": "2025-05-09T03:40:59Z"
  },
  {
    "title": "'Reckless Lunatic': Trump Critics Flabbergasted By His Latest Pick For A Crucial Post",
    "description": "The president once again turned to his favorite place to fill a job opening.",
    "link": "https://www.huffpost.com/entry/donald-trump-jeanine-pirro-reaction_n_681d6287e4b02fbba8e7ce5f",
    "timestamp": "2025-05-09T03:38:23Z"
  },
  {
    "title": "Charles Payne Lists Tricks That Other Countries Use To Undermine America’s Free Trade",
    "description": "Charles Payne warned Americans on Fox News Thursday not to be fooled by misleading trade statistics or globalist talking points",
    "link": "https://dailycaller.com/2025/05/08/charles-payne-tariff-barriers/",
    "timestamp": "2025-05-09T03:31:23Z"
  },
  {
    "title": "India says it thwarted Pakistan air strikes as tensions soar",
    "description": "India said it &ldquo;neutralised&rdquo; Pakistani  drone and missile attacks  targeting several military sites on Thursday night, marking an escalation in hostilities between the two nuclear-armed neighbours.",
    "link": "https://www.bangkokpost.com/world/3021565/india-says-it-thwarted-pakistan-air-strikes-as-tensions-soar",
    "timestamp": "2025-05-09T03:31:00Z"
  },
  {
    "title": "Asian stocks lifted by hopes for US-China talks after UK deal",
    "description": "HONG KONG: Most Asian equities rose Friday (May 9) on growing optimism that the worst of Donald Trump's trade war is past after he reached a deal with Britain and suggested he could lower tariffs on C",
    "link": "https://www.channelnewsasia.com/asia/asian-stocks-lifted-hopes-us-china-talks-after-uk-deal-5119031",
    "timestamp": "2025-05-09T03:30:39Z"
  },
  {
    "title": "China Can Play Hardball At Looming Trade Talks With US: Analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in upcoming trade talks with the United States in Geneva, analysts say.",
    "link": "https://www.ibtimes.com.au/china-can-play-hardball-looming-trade-talks-us-analysts-1858666",
    "timestamp": "2025-05-09T03:27:16Z"
  },
  {
    "title": "Japanese stocks jump, dollar firms on trade hopes; bitcoin soars - Markets - The Jakarta Post",
    "description": "Japanese stocks jumped on Friday, supported by the dollar's surge against the yen, after a US trade deal with Britain fueled hopes of progress in tariff talks with other countries.",
    "link": "http://www.thejakartapost.com/business/2025/05/09/japanese-stocks-jump-dollar-firms-on-trade-hopes-bitcoin-soars.html",
    "timestamp": "2025-05-09T03:27:12Z"
  },
  {
    "title": "China Can Play Hardball At Looming Trade Talks With US: Analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in upcoming trade talks with the United States in Geneva, analysts say.",
    "link": "https://www.ibtimes.com/china-can-play-hardball-looming-trade-talks-us-analysts-3773012",
    "timestamp": "2025-05-09T03:27:09Z"
  },
  {
    "title": "Pope Leo shared content critical of Trump, Vance's immigration policies in social media posts",
    "description": "Pope Leo shared content critical of Trump, Vance's immigration policies in social media postsgo.com",
    "link": "https://abcnews.go.com/International/pope-leo-shared-content-critical-trump-vances-immigration/story?id=121619905",
    "timestamp": "2025-05-09T03:26:04Z"
  },
  {
    "title": "Consumer watchdog halts Biden-era Google Payment supervision",
    "description": "The US Consumer Financial Protection Bureau (CFPB) has dropped its bid to supervise Google Payment Corp, prompting Google to withdraw its related lawsuit. The CFPB's Trump-appointed director called the oversight unnecessary. Google argued the regulator target…",
    "link": "https://economictimes.indiatimes.com/tech/technology/consumer-watchdog-halts-biden-era-google-payment-supervision-google-spokesperson/articleshow/121016214.cms",
    "timestamp": "2025-05-09T03:25:21Z"
  },
  {
    "title": "AG Letitia James heckled over mortgage fraud case at town hall: ‘Apologize to Donald Trump’",
    "description": "“Apologize to Donald Trump for wasting millions of dollars in the state of New York,” the MAGA booster shouted from the audience.",
    "link": "https://nypost.com/2025/05/08/us-news/ag-tish-james-heckled-over-mortgage-fraud-case-at-town-hall-apologize-to-donald-trump/",
    "timestamp": "2025-05-09T03:25:08Z"
  },
  {
    "title": "US Senate Blocks Stablecoin Legislation Over Trump Memecoin Controversy",
    "description": "A bill to promote stablecoins was blocked in the U.S. Senate on Thursday (May 8) over political disagreements and controversy surrounding President Donald Trump’s crypto ventures, according to reporting from Bloomberg.\nThe bill only garnered 48 votes, falling…",
    "link": "https://biztoc.com/x/355d6d17c2ae46a9",
    "timestamp": "2025-05-09T03:24:01Z"
  },
  {
    "title": "\"Likely to generate inflation\": Fed Chair Powell paints bleak picture of US under Trump tariffs",
    "description": "Jerome Powell hasn't offered Donald Trump any slack during his second term, but he's certainly giving the president enough rope.\nThe Federal Reserve chair once again refused to lower key interest rates as economic uncertainty around Trump's tariff scheme has …",
    "link": "https://biztoc.com/x/441f2a9b45e37bc0",
    "timestamp": "2025-05-09T03:23:49Z"
  },
  {
    "title": "China can play hardball at looming trade talks with US: analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in upcoming trade talks with the United States in Geneva, analysts say. Trade between the world’s two larg…",
    "link": "https://www.digitaljournal.com/world/china-can-play-hardball-at-looming-trade-talks-with-us-analysts/article",
    "timestamp": "2025-05-09T03:22:20Z"
  },
  {
    "title": "China can play hardball at looming trade talks with US: analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in...",
    "link": "https://www.yahoo.com/news/china-play-hardball-looming-trade-032041326.html",
    "timestamp": "2025-05-09T03:20:41Z"
  },
  {
    "title": "Leo XIV, First US Pope, To Celebrate First Mass As Pontiff",
    "description": "Pope Leo XIV will celebrate mass Friday, the day after becoming the first US head of the Catholic Church, with the world watching for signs of what kind of pope he will be.",
    "link": "https://www.ibtimes.com/leo-xiv-first-us-pope-celebrate-first-mass-pontiff-3773010",
    "timestamp": "2025-05-09T03:18:20Z"
  },
  {
    "title": "Nearing 100, Malaysian Ex-PM Mahathir Blasts 'Old World' Trump",
    "description": "Former Malaysian prime minister Mahathir Mohamad is giving President Donald Trump three months before his fellow Americans force him to rethink his stringent global tariff strategy, accusing the US leader of \"living in an old world\".",
    "link": "https://www.ibtimes.com/nearing-100-malaysian-ex-pm-mahathir-blasts-old-world-trump-3773007",
    "timestamp": "2025-05-09T03:18:17Z"
  },
  {
    "title": "What will the Antichrist look like? According to Western thought, an authoritarian king – or the pope",
    "description": "In casting himself as supreme leader and pope, Donald Trump inadvertently invoked the Christian understanding of the Antichrist.",
    "link": "https://theconversation.com/what-will-the-antichrist-look-like-according-to-western-thought-an-authoritarian-king-or-the-pope-256205",
    "timestamp": "2025-05-09T03:17:47Z"
  },
  {
    "title": "Nearing 100, Malaysian ex-PM Mahathir blasts ‘old world’ Trump",
    "description": "Former Malaysian prime minister Mahathir Mohamad is giving President Donald Trump three months before his fellow Americans force him to rethink his stringent global tariff strategy, accusing the US leader of “living in an old world”. Speaking to AFP in an int…",
    "link": "https://www.digitaljournal.com/world/nearing-100-malaysian-ex-pm-mahathir-blasts-old-world-trump/article",
    "timestamp": "2025-05-09T03:17:20Z"
  },
  {
    "title": "Leo XIV, first US pope, to celebrate first mass as pontiff",
    "description": "Pope Leo XIV will celebrate mass Friday, the day after becoming the first US head of the Catholic Church, with the world watching for signs of what kind of pope he will be. Chicago-born Robert Francis Prevost was on Thursday elected by fellow cardinals to lea…",
    "link": "https://www.digitaljournal.com/world/leo-xiv-first-us-pope-to-celebrate-first-mass-as-pontiff/article",
    "timestamp": "2025-05-09T03:17:20Z"
  },
  {
    "title": "China’s April exports jump 8.1% to beat estimates despite U.S. tariffs; import decline slows",
    "description": "The prohibitive levels of duties would have halted all trade flows between the world's two largest economies.",
    "link": "https://www.cnbc.com/2025/05/09/chinas-exports-jump-us-tariffs-imports-tumble.html",
    "timestamp": "2025-05-09T03:16:49Z"
  },
  {
    "title": "Chris Hayes Says Health News in the Trump Era ‘Feels Like a Dark Joke’ After New Surgeon General Pick | Video",
    "description": "The MSNBC host talks to Kathleen Sebelius about \"wellness\" influencer Casey Means \nThe post Chris Hayes Says Health News in the Trump Era ‘Feels Like a Dark Joke’ After New Surgeon General Pick | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-casey-means-surgeon-general-dark-joke-msnbc/",
    "timestamp": "2025-05-09T03:15:53Z"
  },
  {
    "title": "Kaine: GOP Senators Saying We Need to Be a Check Against Trump's Overreach",
    "description": "Senator Tim Kaine (D-VA) claimed Thursday on CNN's \"The Source\" that \"some Republicans have stood up\" to say Congress needed to be a check against President Donald Trump's executive overreach.\nThe post Kaine: GOP Senators Saying We Need to Be a Check Against …",
    "link": "https://www.breitbart.com/clips/2025/05/08/kaine-gop-senators-saying-we-need-to-be-a-check-against-trumps-overreach/",
    "timestamp": "2025-05-09T03:15:01Z"
  },
  {
    "title": "MAGA CNN Guest Told ‘No’ After Demanding Trump Get ‘Credit’ for Congratulating New Pope",
    "description": "Conservative radio host Ben Ferguson insisted that President Donald Trump should be praised for the way he reacted to the ascension of the first American pope.\nThe post MAGA CNN Guest Told ‘No’ After Demanding Trump Get ‘Credit’ for Congratulating New Pope fi…",
    "link": "https://www.mediaite.com/tv/maga-cnn-guest-told-no-after-demanding-trump-get-credit-for-congratulating-new-pope/",
    "timestamp": "2025-05-09T03:13:19Z"
  },
  {
    "title": "In President Trump's Middle East show, Israelis are part of a captive audience",
    "description": "It's important to cast a sober gaze at reality. The IDF doesn't have sufficient forces to realize the right-wing fantasies about maintaining a military government across most of the Gaza Strip, over time",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-09/ty-article/.premium/in-president-trumps-middle-east-show-israelis-are-part-of-a-captive-audience/00000196-b12d-d9bf-a1b6-f9ad7b090000",
    "timestamp": "2025-05-09T03:12:10Z"
  },
  {
    "title": "Trump abruptly fires Librarian of Congress",
    "description": "WASHINGTON—President Donald Trump fired the Librarian of Congress, Carla Hayden, on Thursday, according to a copy of her termination email obtained by NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-abruptly-fires-librarian-congress-rcna205749",
    "timestamp": "2025-05-09T03:11:06Z"
  }
]