[
  {
    "title": "No Kings Day: Protests Of Love & Hope For Democracy & Climate",
    "description": "Saturday, October 18th, 2025 was a big day across the US. People across all demographics gathered to protest President Donald Trump and his administration. Organizers of the No Kings Day rallies have reported that more than 7 million people attended protests …",
    "link": "https://cleantechnica.com/2025/10/20/no-kings-day-protests-of-love-hope-for-democracy-climate/",
    "timestamp": "2025-10-20T19:24:20Z"
  },
  {
    "title": "Secret Service Paid Millions to Secure Charlie Kirk's Memorial",
    "description": "Charlie Kirk's memorial cost taxpayers a pretty penny to keep safe ... 'cause we've learned the United States Secret Service paid an event company millions to secure the perimeter. We've obtained documents that show the Secret Service paid ARCUS…\n Permalink",
    "link": "https://www.tmz.com/2025/10/20/secret-service-paid-millions-for-charlie-kirk-memorial/",
    "timestamp": "2025-10-20T19:21:19Z"
  },
  {
    "title": "What Is Trump's True Endgame in Venezuela?",
    "description": "It’s ironic that in the same week that President Donald Trump escalated the drug war in the Caribbean by unleashing the CIA against Nicolás Maduro’s regime in Venezuela, the Department of Justice won an indictment against former National Security Adviser John…",
    "link": "https://responsiblestatecraft.org/trump-attack-venezuela/",
    "timestamp": "2025-10-20T19:20:44Z"
  },
  {
    "title": "China ETFs See Outflows As Trump Comments Trigger Volatility",
    "description": "Exchange-traded funds tracking China stocks recorded outflows for the second consecutive week as Donald Trump first stoked, then tried to calm market jitters over a trade dispute with China.",
    "link": "https://www.ndtvprofit.com/markets/china-etfs-see-outflows-as-trump-comments-trigger-volatility",
    "timestamp": "2025-10-20T19:19:54Z"
  },
  {
    "title": "NY Young Republicans Group Dissolved, Including Online Presence",
    "description": "The NY GOP dissolved its state Young Republicans group after members were found in a group chat with racist and antisemitic messages published in an expose.",
    "link": "https://hiphopwired.com/2876893/ny-young-republicans-dissolved-including-online-presence/",
    "timestamp": "2025-10-20T19:19:06Z"
  },
  {
    "title": "Folk legend Kenny Loggins shreds Trump for using his song in bizarre AI poop bomb video",
    "description": "Loggins’ song ‘Danger Zone’ was recorded for the soundtrack of ‘Top Gun’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/kenny-loggins-trump-danger-zone-video-b2848778.html",
    "timestamp": "2025-10-20T19:18:55Z"
  },
  {
    "title": "Democrats have an advertising advantage in this year's biggest elections",
    "description": "Democrats have something important in common across the three highest-profile elections coming in November: an ad-spending edge.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-advertising-advantage-years-biggest-elections-rcna238145",
    "timestamp": "2025-10-20T19:18:47Z"
  },
  {
    "title": "US steps up diplomacy as Israeli strikes test Gaza ceasefire",
    "description": "US officials travel to Israel as new strikes threaten to unravel progress towards achieving peace in Gaza.",
    "link": "https://www.abc.net.au/news/2025-10-21/us-steps-up-diplomacy-as-israeli-strikes-test-gaza-ceasefire/105914460",
    "timestamp": "2025-10-20T19:18:22Z"
  },
  {
    "title": "The Ceasefire Has Not Yet Ended the Genocide",
    "description": "Phyllis Bennis, Khury Petersen-Smith\n\n\n\nAs Israel continues to launch air strikes on Gaza, the weakness of both the ceasefire and Trump’s 20-point plan are becoming ever clearer.\r\n\n\r\n\n\nThe post The Ceasefire Has Not Yet Ended the Genocide appeared first on Th…",
    "link": "https://www.thenation.com/article/world/ceasefire-has-not-ended-the-genocide/",
    "timestamp": "2025-10-20T19:18:06Z"
  },
  {
    "title": "Why Moonbats Pretend Trump Is a King",
    "description": "One of the many ways Donald Trump has made America a better place is by compelling progressives to drop their mask. The greater the president he turns out to be, the more unhinged they become. By now they seem hardly … Continue reading →\nThe post Why Moonbats…",
    "link": "https://moonbattery.com/why-moonbats-pretend-trump-is-a-king/",
    "timestamp": "2025-10-20T19:17:23Z"
  },
  {
    "title": "Trump Says China Could Face 155% Tariffs If No Deal",
    "description": "President Donald Trump listed rare earths, fentanyl, soybeans and Taiwan as the US’s top issues with China, underlining the divisive topics the two sides plan to tackle at the negotiating table as a fragile trade truce nears its expiration.\n“I don’t want them…",
    "link": "https://biztoc.com/x/42d106a12f162b58",
    "timestamp": "2025-10-20T19:16:17Z"
  },
  {
    "title": "NASA May Ditch SpaceX for Moon Landing Because It’s So Behind",
    "description": "NASA is getting ready to ditch SpaceX for its first attempt to deliver astronauts to the Moon's surface in over half a century due to delays.",
    "link": "https://futurism.com/space/nasa-spacex-moon-delays",
    "timestamp": "2025-10-20T19:14:06Z"
  },
  {
    "title": "Veterinarian criticizes Hasan Piker for using electronic collar on dog Kaya during streams",
    "description": "A veterinarian has accused Twitch streamer Hasan Piker of animal abuse, citing clips of his dog Kaya confined to a raised bed and corrected with an electronic collar for normal movements. The vet argues this violates welfare standards, even if only vibrations…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/veterinarian-criticizes-hasan-piker-for-using-electronic-collar-on-dog-kaya-during-streams/articleshow/124710116.cms",
    "timestamp": "2025-10-20T19:13:51Z"
  },
  {
    "title": "Trump Locks Rare Earths Deal With Australia, Throws Shade At Envoy",
    "description": "\"We're going to be signing an agreement that's been negotiated over a period of four or five months.\"WASHINGTON— President Donald Trump on Monday signed a critical minerals and rare earths deal with Australian Prime Minister Anthony Albanese, calling the lead…",
    "link": "https://freerepublic.com/focus/f-news/4347564/posts",
    "timestamp": "2025-10-20T19:12:08Z"
  },
  {
    "title": "Who is Elias Pettersson’s wife Katelyn Byrd?: A look into their dating history, marriage, and love life",
    "description": "Vancouver Canucks star Elias Pettersson has married model Katelyn Byrd in a private ceremony in Sweden during the summer of 2025. The couple, who had been the subject of fan speculation, confirmed their union in September. Byrd, a model and influencer, balanc…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/who-is-elias-petterssons-wife-katelyn-byrd-a-look-into-their-dating-history-marriage-and-love-life/articleshow/124709228.cms",
    "timestamp": "2025-10-20T19:10:58Z"
  },
  {
    "title": "Trump is pushing allies to buy US gas. It’s bad economics – and a catastrophe for the climate",
    "description": "As China secures its role in clean tech exports, the US is doubling down on fossil fuels – and pushing allies to buy US gas.",
    "link": "https://theconversation.com/trump-is-pushing-allies-to-buy-us-gas-its-bad-economics-and-a-catastrophe-for-the-climate-266792",
    "timestamp": "2025-10-20T19:09:06Z"
  },
  {
    "title": "Corporate Media, Democrats Finally Giving Up Shoving Climate Messaging Down Americans’ Throats",
    "description": "Several corporate media outlets and Democrats have been pivoting away from climate policy and instead hammering on the issue of rising electricity costs.",
    "link": "https://dailycaller.com/2025/10/20/corporate-media-starting-realize-leftists-lost-climate/",
    "timestamp": "2025-10-20T19:08:12Z"
  },
  {
    "title": "White House War: Kamala Harris 'Turned Against and Hated' Joe Biden Behind Closed Doors Before Former Veep Was Forced to Take Over Ex-Prez's Campaign",
    "description": "Top Democratic insiders claimed the former vice president warned about Biden being a 'loser in 2024' years before she had to take over his campaign.",
    "link": "https://radaronline.com/p/kamala-harris-joe-biden-white-house-war-erupted-before-failed-relection-campaign/",
    "timestamp": "2025-10-20T19:08:08Z"
  },
  {
    "title": "FBI investigating “suspicious” hunting stand near Air Force One landing zone",
    "description": "The agency said the stand had a \"sight line\" of Air Force One's landing area.",
    "link": "https://www.salon.com/2025/10/20/fbi-investigating-suspicious-hunting-stand-near-air-force-one-landing-zone/",
    "timestamp": "2025-10-20T19:08:05Z"
  },
  {
    "title": "Witkoff and Kushner land in Israel to ensure ceasefire holds after weekend flare-ups",
    "description": "Senior members of President Donald Trump’s diplomatic team arrived in Israel on Monday as the United States seeks to hold together the fragile Gaza ceasefire and intensify efforts to implement phase two of the peace agreement. Special envoy Steve Witkoff and …",
    "link": "https://freerepublic.com/focus/f-news/4347561/posts",
    "timestamp": "2025-10-20T19:06:28Z"
  },
  {
    "title": "Weapons buy-back program and the plan to disarm Hamas",
    "description": "'This is all linked to amnesty and disavowing violence' if members of terror group want to stay there",
    "link": "https://www.wnd.com/2025/10/weapons-buy-back-program-plan-disarm-hamas/",
    "timestamp": "2025-10-20T19:05:43Z"
  },
  {
    "title": "Trump’s video response to the ‘No Kings’ protest shows how comfortable he and Vance are with AI slop",
    "description": "President Donald Trump responded to this weekend’s massive ‘No Kings’ protests with an AI-generated video of him in a fighter jet, dropping what appears to be sewage (or poop) on American protesters, and told reporters on Sunday that the nearly 7 million peop…",
    "link": "https://biztoc.com/x/e60f854f6085fbe7",
    "timestamp": "2025-10-20T19:05:15Z"
  },
  {
    "title": "CleanSpark shares soar as Bitcoin miner announces AI expansion",
    "description": "Large Bitcoin mining companies are looking to expand into AI services for new sources of revenue amid the post-Bitcoin halving pressure.",
    "link": "https://cointelegraph.com/news/cleanspark-soar-13-bitcoin-miner-ai-expansion",
    "timestamp": "2025-10-20T19:03:41Z"
  },
  {
    "title": "Next phases of Trump’s Gaza plan get harder",
    "description": "'The reality remains that Israelis reside in a dangerous neighborhood, and the Jewish state is a long way from living in peace and harmony with its neighbors'",
    "link": "https://www.wnd.com/2025/10/next-phases-trumps-gaza-plan-get-harder/",
    "timestamp": "2025-10-20T19:03:25Z"
  },
  {
    "title": "How to Save a Democracy in 159 Weeks",
    "description": "In the morning thread, we were shooting the shit about the state of the country and what it will take to save democracy. Responding to a comment from Rusty about the Supreme Court’s role in our current authoritarian moment, I said: Agree 100% that the SCOTUS …",
    "link": "https://balloon-juice.com/2025/10/20/how-to-save-a-democracy-in-159-weeks/",
    "timestamp": "2025-10-20T19:02:20Z"
  },
  {
    "title": "Gaza truce back on, says Israel after heavy clashes with Hamas",
    "description": "In the aftermath of fierce weekend skirmishes, Israel and Hamas have cautiously stepped back into a truce in Gaza. US representatives are on the ground, striving to solidify the fragile agreement. President Trump has issued a stark warning to Hamas, threateni…",
    "link": "https://economictimes.indiatimes.com/news/defence/gaza-truce-back-on-says-israel-after-heavy-clashes-with-hamas/articleshow/124710039.cms",
    "timestamp": "2025-10-20T19:02:16Z"
  },
  {
    "title": "Why did Donald Trump commute George Santos' prison sentence? The proof is in the party",
    "description": "Trump has commuted George Santos' sentence, saving the disgraced gay Republican from more than seven years in prison.",
    "link": "https://www.advocate.com/politics/why-trump-pardon-george-santos",
    "timestamp": "2025-10-20T19:02:02Z"
  },
  {
    "title": "‘White Lotus’ Star Hits Trump Daily With The Same 3-Word Insult — Making Her ‘No Kings’ Sign Hilarious",
    "description": "‘White Lotus’ Star Hits Trump Daily With The Same 3-Word Insult — Making Her ‘No Kings’ Sign Hilarioushuffpost.com",
    "link": "https://www.huffpost.com/entry/white-lotus-star-hits-trump-daily-with-the-same-3-word-insult-so-heres-her-no-kings-sign_n_68f66350e4b09d351b44a068",
    "timestamp": "2025-10-20T19:01:49Z"
  },
  {
    "title": "On National Guard Deployments, Trump Tells SCOTUS His Power Is 'Unreviewable'",
    "description": "According to President Trump, he alone gets to decide the conditions for when state National Guard members are called into federal service.",
    "link": "https://reason.com/2025/10/21/on-national-guard-deployments-trump-tells-scotus-his-power-is-unreviewable/",
    "timestamp": "2025-10-20T19:01:37Z"
  },
  {
    "title": "Trump to Announce Tariffs on Colombia, Ends Aid Over Drugs",
    "description": "\"Petro, a low rated and very unpopular leader, with a fresh mouth toward America, better close up these killing fields immediately, or the United States will close them up for him, and it won’t be done nicely.\"\nThe post Trump to Announce Tariffs on Colombia, …",
    "link": "https://legalinsurrection.com/2025/10/trump-to-announce-tariffs-on-colombia-ends-aid-over-drugs/",
    "timestamp": "2025-10-20T19:00:35Z"
  },
  {
    "title": "Trump says Ukraine war ‘nasty’ but still solvable as Zelenskyy touts Patriot deal",
    "description": "WASHINGTON: US President Donald Trump said Monday (Oct 20) that ending the war in Ukraine remained possible despite what he called a “nasty” conflict between two leaders who “truly hate eac",
    "link": "https://www.channelnewsasia.com/world/trump-says-ukraine-war-nasty-still-solvable-zelenskyy-touts-patriot-deal-5413616",
    "timestamp": "2025-10-20T19:00:00Z"
  },
  {
    "title": "'He's not sharp': Trump ripped as 'not right in the head' by far-right influencer",
    "description": "White nationalist influencer Nick Fuentes, who infamously once dined with President Donald Trump and Kanye West (Ye) at Mar-a-Lago, blasted the president last week as a “weird guy” who is “not right in the head.”“Look, something’s wrong with him, man,” Fuente…",
    "link": "https://www.rawstory.com/nick-fuentes-2674216071/",
    "timestamp": "2025-10-20T18:58:38Z"
  },
  {
    "title": "Can Trump deliver a farmer bailout in time?",
    "description": "Planting decisions, food prices in the balance",
    "link": "https://theweek.com/politics/trump-farmer-bailout-food-prices-agriculture-tariffs",
    "timestamp": "2025-10-20T18:57:59Z"
  },
  {
    "title": "Europeans rush to Volodymyr Zelenskiy’s defence after tense Donald Trump meeting",
    "description": "EU seeks to secure deal on frozen Russian assets and more sanctions on Moscow to show support for Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/10/20/europeans-rush-to-volodymyr-zelenskiys-defence-after-tense-donald-trump-meeting/",
    "timestamp": "2025-10-20T18:57:40Z"
  },
  {
    "title": "Lia Thomas Unrepentant over Taking Titles from Women: 'It's Easier to Fight the World Than Fight Yourself'",
    "description": "Controversial UPenn transgender swimmer Lia Thomas is unrepentant that he took several college swimming records away from female competitors.\nThe post Lia Thomas Unrepentant over Taking Titles from Women: ‘It’s Easier to Fight the World Than Fight Yourself’ a…",
    "link": "https://www.breitbart.com/sports/2025/10/20/lia-thomas-unrepentant-taking-titles-women-its-easier-fight-world-than-fight-yourself/",
    "timestamp": "2025-10-20T18:55:19Z"
  },
  {
    "title": "How No Kings Embraced the Good Kind of Weird—and Won the Normies",
    "description": "Unicorns are supposed to be rare and mythical. But at Saturday’s No Kings protests I saw the largest outbreak in America outside a Lisa Frank store. They were everywhere, but I was surprised to see almost a dozen of them down in New Braunfels, Texas. As at ma…",
    "link": "https://freerepublic.com/focus/f-news/4347558/posts",
    "timestamp": "2025-10-20T18:53:54Z"
  },
  {
    "title": "Trump Should Be Wary of Partnering With Pakistan",
    "description": "Despite a recent boost in ties, history shows that Islamabad is a fickle friend in South Asia.",
    "link": "http://foreignpolicy.com/2025/10/20/trump-us-pakistan-shift-partnership-india-kashmir/",
    "timestamp": "2025-10-20T18:51:44Z"
  },
  {
    "title": "Trump: I can threaten China with 'many other things,' like access to airplane parts",
    "description": "President Donald Trump said Monday he thinks the U.S. will reach a trade deal with China, but he has \"many other things\" in ...",
    "link": "https://biztoc.com/x/fe1bdc8013f998a8",
    "timestamp": "2025-10-20T18:50:36Z"
  },
  {
    "title": "Gushing Trump says there has 'never been anybody better' to US than Australia",
    "description": "Donald Trump lavishes praise on Australia and Anthony Albanese during the pair's landmark meeting in Washington, but takes a swipe at a former prime minister in the room.",
    "link": "https://www.abc.net.au/news/2025-10-21/donald-trump-and-anthony-albanese-meet-in-washington/105914030",
    "timestamp": "2025-10-20T18:46:21Z"
  },
  {
    "title": "Don Lemon urges ‘black and brown people’ to buy guns during illegal immigration crackdown",
    "description": "During his appearance on former New York Times writer Wajahat Ali’s podcast, Lemon advised “people who are here legally” to invoke their Second Amendment right.",
    "link": "https://nypost.com/2025/10/20/media/don-lemon-urges-black-and-brown-people-to-buy-guns-during-illegal-immigration-crackdown/",
    "timestamp": "2025-10-20T18:46:21Z"
  },
  {
    "title": "Bill Maher Says He’d ‘Love’ to Sit Down With George W. Bush: Trump Has Changed My ‘Perspective’",
    "description": "Bill Maher said he would \"love\" to interview George W. Bush on one of his programs and admitted he has more \"perspective\" on his presidency after Trump\nThe post Bill Maher Says He’d ‘Love’ to Sit Down With George W. Bush: Trump Has Changed My ‘Perspective’ fi…",
    "link": "https://www.mediaite.com/media/bill-maher-says-hed-love-to-sit-down-with-george-w-bush-trump-has-changed-my-perspective/",
    "timestamp": "2025-10-20T18:45:59Z"
  },
  {
    "title": "Why so many universities are rejecting the White House’s proposed ‘compact’",
    "description": "The Trump White House sent several U.S. universities a proposed one-sided deal. The schools are now rejecting the \"compact,\" and it's worth understanding why.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/many-universities-are-rejecting-white-houses-proposed-compact-rcna238704",
    "timestamp": "2025-10-20T18:43:55Z"
  },
  {
    "title": "Bolivia Elects 'Capitalism for All' Candidate Rodrigo Paz President, Ending 20 Years of Socialism",
    "description": "Bolivian centrist Senator Rodrigo Paz became the President-elect of Bolivia after winning Sunday's runoff election.\nThe post Bolivia Elects ‘Capitalism for All’ Candidate Rodrigo Paz President, Ending 20 Years of Socialism appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/10/20/bolivia-elects-capitalism-all-candidate-rodrigo-paz-president-ending-20-years-socialism/",
    "timestamp": "2025-10-20T18:43:51Z"
  },
  {
    "title": "Trump threatens to ‘eradicate’ Hamas",
    "description": "The US president has said he would “straighten it out” if the militant group fails to honor the Gaza truce deal with Israel Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626734-trump-threatens-eradicate-hamas/",
    "timestamp": "2025-10-20T18:43:09Z"
  },
  {
    "title": "Trump Melts Down After Learning White House Guest Thinks He’s ‘Nuts’",
    "description": "President Donald Trump has lashed out against a top Australian diplomat who was invited to the White House, after learning that his guest had been highly...",
    "link": "https://www.thedailybeast.com/trump-melts-down-at-learning-white-house-guest-kevin-rudd-thinks-hes-nuts/",
    "timestamp": "2025-10-20T18:41:05Z"
  },
  {
    "title": "'Humiliating': Pete Hegseth’s tie ignites social media firestorm",
    "description": "Defense Secretary Pete Hegseth earned mockery Monday over his fashion choices — and pointed questions about where his loyalties lie. Hegseth stirred up an international reaction after he wore a white, blue and red striped tie similar to the order of the Russi…",
    "link": "https://www.rawstory.com/msn/pete-hegseth-2674215790/",
    "timestamp": "2025-10-20T18:40:40Z"
  },
  {
    "title": "Best Donald Trump meme ever and also starring in his band are Cruz, Hegseth and Rubio.",
    "description": "This is the best all-time Trump I have ever seen (Unfotunately, it's for Spanish-speakers.). It features Trump as lead Cuban-style singer, Hegseth and Rubio on guitars and Cruz on the drums and backup singer. The gals may be Bondi, Noem and I can't recognize …",
    "link": "https://freerepublic.com/focus/f-chat/4347551/posts",
    "timestamp": "2025-10-20T18:40:09Z"
  },
  {
    "title": "Trump, Albanese sign critical minerals deal, discuss AUKUS submarine plan",
    "description": "WASHINGTON: US President Donald Trump and Australian Prime Minister Anthony Albanese on Monday (Oct 20) signed a new agreement to boost cooperation on rare earths and critical minerals,",
    "link": "https://www.channelnewsasia.com/world/trump-albanese-sign-critical-minerals-deal-discuss-aukus-submarine-plan-5413601",
    "timestamp": "2025-10-20T18:40:00Z"
  },
  {
    "title": "Florida AD: Napier didn't meet goal of winning championships [Gator's Coach fired]",
    "description": "Florida athletic director Scott Stricklin said Monday he has one goal when it comes to hiring the next football coach: Find someone who can win championships. During a news conference in Gainesville, Florida, Stricklin said his decision to fire Billy Napier o…",
    "link": "https://freerepublic.com/focus/f-chat/4347550/posts",
    "timestamp": "2025-10-20T18:39:49Z"
  },
  {
    "title": "Trump says will meet Chinese President Xi in South Korea",
    "description": "U.S. President Donald Trump said on Oct. 20 that he will meet with Chinese President Xi Jinping in South Korea \"in a couple of weeks.\"",
    "link": "https://www.hurriyetdailynews.com/trump-says-will-meet-chinese-president-xi-in-south-korea-214866",
    "timestamp": "2025-10-20T18:38:32Z"
  },
  {
    "title": "Trump signs $8.5 billion rare earths deal with Australia",
    "description": "Donald Trump and Anthony Albanese announced an agreement on rare earth minerals and expressed support for the \"AUKUS\" nuclear submarine deal. The agreement comes as the US seeks to reduce dependence on China.",
    "link": "https://www.dw.com/en/trump-signs-85-billion-rare-earths-deal-with-australia/a-74432572",
    "timestamp": "2025-10-20T18:36:00Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Closes Billion-Dollar Deals with Australia (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nFact Sheet: President Donald J. Trump Closes Billion-Dollar Deals with Australia  —  ACHIEVING CRITICAL MINERAL AND ENERGY DOMINANCE: Today, President Donald J. Trump and Australian Prime Minister Anthony Albanese …",
    "link": "https://www.memeorandum.com/251020/p77",
    "timestamp": "2025-10-20T18:35:02Z"
  },
  {
    "title": "DHS Closing in on Half-Million Arrests of Criminal Illegal Aliens",
    "description": "Since President Donald Trump returned to the White House nine months ago Monday, the Department of Homeland Security has arrested some 480,000 criminal illegal aliens,... Read More\nThe post DHS Closing in on Half-Million Arrests of Criminal Illegal Aliens  ap…",
    "link": "https://www.dailysignal.com/2025/10/20/dhs-closing-half-million-arrests-criminal-illegal-aliens/",
    "timestamp": "2025-10-20T18:35:00Z"
  },
  {
    "title": "Exclusive: FEMA Workers Improperly Collected Data About Politics of Disaster Victims",
    "description": "Joe Biden and former FEMA administrator Deanne Criswell in Florida after Hurricane Milton last yearLast November 8th, on the Saturday after Election Day, one of the more bizarre post-scripts to Donald Trump’s re-election emerged in the form of a Federal Emerg…",
    "link": "https://freerepublic.com/focus/f-news/4347549/posts",
    "timestamp": "2025-10-20T18:34:12Z"
  },
  {
    "title": "Planned Parenthood Abortion Biz Will Close 7 California Centers",
    "description": "Planned Parenthood’s abortion empire continued its downward spiral as the abortion organization announced the closure of seven centers in California, That pushes the total number of its facilities shuttered across the country this year to 50 and highlights th…",
    "link": "https://freerepublic.com/focus/f-chat/4347548/posts",
    "timestamp": "2025-10-20T18:34:07Z"
  },
  {
    "title": "U.S. Tries To Shore Up Shaky Gaza Truce After Weekend Of Increased Violence",
    "description": "Israel killed at least 28 Palestinians after accusing Hamas of targeting soldiers, which the group denied, saying Israel has repeatedly violated the week-old deal.",
    "link": "https://www.huffpost.com/entry/us-shores-gaza-truce-weekend-increased-violence_n_68f67a06e4b0dbac459031ac",
    "timestamp": "2025-10-20T18:33:11Z"
  },
  {
    "title": "Trump accelerates tensions with Venezuela — and risks a longer, messier crisis",
    "description": "COMPOSITE\nLEFT: US President Donald Trump speaks in the Oval Office of the White House in Washington, DC, US, on Thursday, Aug. 14, 2025. Photographer: Will Oliver/EPA/Bloomberg via Getty Images\nRIGHT: Venezuela's President Nicolas Maduro looks on during a me…",
    "link": "https://biztoc.com/x/eee892ac48aa5224",
    "timestamp": "2025-10-20T18:32:02Z"
  },
  {
    "title": "‘Ultimate rugpull’: MAGA fumes over who Trump’s helping in 2026 fundraiser",
    "description": "MAGA world was displeased Monday after learning that President Donald Trump’s first in-person fundraiser for the 2026 midterm campaign cycle will be in support of Sen. Lindsey Graham (R-SC), who’s drawn scrutiny\r\n from the more anti-interventionist wing of th…",
    "link": "https://www.rawstory.com/lindsey-graham-2674215923/",
    "timestamp": "2025-10-20T18:32:02Z"
  },
  {
    "title": "Liberals press Poilievre to apologize after calling RCMP leadership ‘despicable’",
    "description": "The federal Liberals are calling on Conservative Leader Pierre Poilievre to apologize for questioning the independence and integrity of the RCMP after he accused the nation’s police of covering up for the Liberal government.",
    "link": "https://www.cbc.ca/news/politics/poilievre-rcmp-trudeau-despicable-9.6945609",
    "timestamp": "2025-10-20T18:31:32Z"
  },
  {
    "title": "Rocker Kenny Loggins Demands Trump Remove ‘Danger Zone’ from His Truth Social Video Trolling ‘No Kings’ Protesters",
    "description": "Rocker Kenny Loggins is demanding that President Donald Trump remove his 1986 song \"Danger Zone\" from a Truth Social video trolling \"No Kings\" protesters.\nThe post Rocker Kenny Loggins Demands Trump Remove ‘Danger Zone’ from His Truth Social Video Trolling ‘N…",
    "link": "https://www.breitbart.com/entertainment/2025/10/20/rocker-kenny-loggins-demands-trump-remove-danger-zone-from-his-truth-social-video-trolling-no-kings-protesters/",
    "timestamp": "2025-10-20T18:31:11Z"
  },
  {
    "title": "UK 'ready to spend well over £100m' on possible deployment of British troops to Ukraine",
    "description": "The UK is ready to spend \"well over\" £100m on a possible deployment of British forces to Ukraine if Donald Trump secures a peace deal with Russia, the defence secretary has said.",
    "link": "https://news.sky.com/story/uk-ready-to-spend-well-over-100m-on-possible-deployment-of-british-troops-to-ukraine-13454120",
    "timestamp": "2025-10-20T18:27:00Z"
  },
  {
    "title": "5 Best-Performing Rare Earth Stocks in October",
    "description": "Strategic metals like lithium and neodymium are important to high-tech manufacturing. We're looking at the top rare earth stocks, and why recent U.S.-China tariff drama has moved them.",
    "link": "https://www.nerdwallet.com/article/investing/rare-earth-stocks#article",
    "timestamp": "2025-10-20T18:26:45Z"
  },
  {
    "title": "Mike Johnson Calls Donald Trump's A.I.-Generated Video 'Satire'",
    "description": "It looks like Mike Johnson got a kick out of Donald Trump's A.I.-generated response to the \"No Kings\" protests ... because he just defended the clip at a news conference. Here's the deal ... POTUS shared a video created with A.I. on his Truth…\n Permalink",
    "link": "https://www.tmz.com/2025/10/20/mike-johnson-defends-donald-trump/",
    "timestamp": "2025-10-20T18:25:57Z"
  },
  {
    "title": "Why are you seeing cowboys everywhere?",
    "description": "Across advertising and popular media, seemingly everyone is grabbing their fringe, denim and Stetson boots, in a wholehearted embrace of the American West. It’s cowboys – and they’re “everywhere,” said Emily Keegin, a photo director for both magazines and bra…",
    "link": "https://freerepublic.com/focus/f-chat/4347545/posts",
    "timestamp": "2025-10-20T18:25:09Z"
  },
  {
    "title": "Jack Dorsey backs GOP Rep. Thomas Massie for president in surprise X post",
    "description": "The Twitter co-founder and Block CEO posted a six-word message on X on Saturday night: “.@RepThomasMassie for president.”",
    "link": "https://nypost.com/2025/10/20/business/jack-dorsey-backs-gop-rep-thomas-massie-for-president-in-x-post/",
    "timestamp": "2025-10-20T18:25:03Z"
  },
  {
    "title": "Trump Says He’s Not a King. A Majority of Americans Believe He Wants to Be.",
    "description": "Around 6 in 10 Americans say they are dissatisfied with the current state of democracy in the US.",
    "link": "https://truthout.org/articles/trump-says-hes-not-a-king-a-majority-of-americans-believe-he-wants-to-be/",
    "timestamp": "2025-10-20T18:20:47Z"
  },
  {
    "title": "Trump Empowers Hunters To Do Their Thing As Gov’t Shutdown Threatens Way Of Life",
    "description": "As the shutdown leaves thousands of federal workers furloughed, American hunters won't see their way of life threatened, thanks to a fantastic move from Trump.",
    "link": "https://dailycaller.com/2025/10/20/trump-administration-fish-wildlife-service-hunting-refuges-shutdown/",
    "timestamp": "2025-10-20T18:20:39Z"
  },
  {
    "title": "Trump Melts Down At Australian Ambassador: 'I Don't Like You Either'",
    "description": "US President Donald Trump on Monday expressed disdain towards Australia's ambassador, former prime minister Kevin Rudd, as the two sat face-to-face across the cabinet table in the White House.",
    "link": "https://www.ibtimes.com/trump-melts-down-australian-ambassador-i-dont-like-you-either-3787685",
    "timestamp": "2025-10-20T18:20:23Z"
  },
  {
    "title": "Trump Endorses Republican Winsome Earle-Sears to be Governor of Virginia",
    "description": "Virginia Lt. Gov. Winsome Earle-Sears has been awaiting backing from President Donald Trump in her tight race for governor of Virginia, and with just 15... Read More\nThe post Trump Endorses Republican Winsome Earle-Sears to be Governor of Virginia  appeared f…",
    "link": "https://www.dailysignal.com/2025/10/20/trump-endorses-republican-winsome-earle-sears-governor-virginia/",
    "timestamp": "2025-10-20T18:18:58Z"
  },
  {
    "title": "‘No Kings’ Protests Sweep the Nation, in Photos",
    "description": "Millions of demonstrators took to streets across the United States over the weekend for the second \"No Kings\" protest against Donald Trump.",
    "link": "http://www.rollingstone.com/politics/politics-pictures/no-kings-protests-photos-1235450452/",
    "timestamp": "2025-10-20T18:17:47Z"
  },
  {
    "title": "Andy Ngo Breaks Down What's Next for Antifa, DOJ Strategy",
    "description": "Few people understand the far-left extremist group Antifa as well as investigative journalist Andy Ngo, author of “Unmasked: Inside Antifa's Radical Plan to Destroy Democracy.” He has been beaten, attacked, and nearly killed by Antifa for his undercover repor…",
    "link": "https://freerepublic.com/focus/f-news/4347542/posts",
    "timestamp": "2025-10-20T18:17:13Z"
  },
  {
    "title": "Pardoned J6 rioters demanding refunds for payments they made for damage to Capitol",
    "description": "When President Donald Trump mass pardoned nearly all of the Jan. 6 defendants, he set in motion further legal questions about the restitution some judges ordered to be paid. But it's a little all over the place when it comes to the former defendants having th…",
    "link": "https://www.rawstory.com/january-6-2674215278/",
    "timestamp": "2025-10-20T18:16:01Z"
  },
  {
    "title": "‘No Kings’ Protesters Reject Political Violence, Survey Shows",
    "description": "Massive marches nationwide in the U.S. marked a turn against an increasing acceptance of political violence among protesters, report sociologists",
    "link": "https://www.scientificamerican.com/article/no-kings-protesters-reject-political-violence-survey-shows/",
    "timestamp": "2025-10-20T18:15:00Z"
  },
  {
    "title": "Trump’s First Campaign Stop For 2026 Will Be With Lindsey Graham",
    "description": "President Donald Trump's first campaign stop for the 2026 midterms will be with Republican South Carolina Sen. Lindsey Graham.",
    "link": "https://dailycaller.com/2025/10/20/donald-trump-lindsey-graham-midterms-2026-campaign-golf-fundraiser/",
    "timestamp": "2025-10-20T18:13:02Z"
  },
  {
    "title": "Watch Mamdani’s Fave Imam Call U.S. “Filthy”, Tout “Jihad” and Call for Takeover of U.S. (VIDEO)",
    "description": "\"Politics is a weapon in the cause of Islam\"Zohran Mamdani’s decision to visit the Al-Taqwa Mosque, which used to be under NYPD surveillance, and then embraced its imam, Imam Siraj Wahhaj, an unindicted co-conspirator in the WTC bombing, ends any debate about…",
    "link": "https://freerepublic.com/focus/f-news/4347541/posts",
    "timestamp": "2025-10-20T18:12:40Z"
  },
  {
    "title": "Trump Signs Rare Earths Deal with Australian PM Anthony Albanese During White House Meeting",
    "description": "WASHINGTON – President Donald Trump and Australian Prime Minister Anthony Albanese signed a rare earths and critical minerals deal Monday at the White House during Trump's latest bilateral meeting with yet another world leader.\nThe post Trump Signs Rare Earth…",
    "link": "https://www.breitbart.com/politics/2025/10/20/trump-signs-rare-earths-deal-with-australian-pm-anthony-albanese-during-white-house-meeting/",
    "timestamp": "2025-10-20T18:12:23Z"
  },
  {
    "title": "Millions turn out for anti-Trump ‘No Kings’ rallies",
    "description": "What happened\nMillions of Americans turned out Saturday at more than 2,500 “No Kings” rallies across the U.S. to protest what participants called President Donald Trump’s increasingly authoritarian governance. Organizers estimated that nearly 7 million people…",
    "link": "https://biztoc.com/x/dc190f62c4b7e495",
    "timestamp": "2025-10-20T18:09:33Z"
  },
  {
    "title": "US, Australia seal billion-dollar defense, energy deals",
    "description": "The White House revealed on Monday details on new billion-dollar deals between President Donald Trump and Australian Prime Minister Anthony Albanese, aimed at strengthening cooperation in defense, ene...",
    "link": "https://biztoc.com/x/1362eaeb27b025aa",
    "timestamp": "2025-10-20T18:09:30Z"
  },
  {
    "title": "Capitol agenda: Troop pay fight tests the GOP (Mia McCarthy/Politico)",
    "description": "Mia McCarthy / Politico:\nCapitol agenda: Troop pay fight tests the GOP  —  Tensions over troop pay are taking center stage as the shutdown heads into Week 4.  A number of Republican lawmakers are uneasy with President Donald Trump once again sidestepping the …",
    "link": "https://www.memeorandum.com/251020/p72",
    "timestamp": "2025-10-20T18:05:01Z"
  },
  {
    "title": "Disney+, Hulu Churn Rates Spiked Around Jimmy Kimmel Suspension, Antenna Says; Firm Also Gauges Fox One & ESPN Progress",
    "description": "Last month’s suspension of Jimmy Kimmel Live! coincided with a doubling of subscriber churn rates on Disney+ and Hulu, according to the latest streaming report from Antenna. Churn, the industry term for the number of subscribers canceling their service in a g…",
    "link": "http://deadline.com/2025/10/disney-hulu-subscriber-churn-jimmy-kimmel-fox-one-espn-1236592294/",
    "timestamp": "2025-10-20T18:04:24Z"
  },
  {
    "title": "White House: Gavin Newsom Closed Highway During JD Vance's Trip to U.S. Marine Corps Event — 'Petty Little Man'",
    "description": "California Gov. Gavin Newsom (D) unnecessarily shut down a highway over Vice President JD Vance's appearance at the U.S. Marine Corps 250th anniversary celebration at Camp Pendleton on Saturday, according to the White House.\nThe post White House: Gavin Newsom…",
    "link": "https://www.breitbart.com/politics/2025/10/20/white-house-gavin-newsom-closed-highway-during-jd-vances-trip-to-u-s-marine-corps-petty-little-man/",
    "timestamp": "2025-10-20T18:02:46Z"
  },
  {
    "title": "Interesting – Damning Email Surfaces Showing Mary McCord Sending FBI Information on Her Surveillance of Oathkeepers Group Following 2020 Election Result",
    "description": "Obviously, readers here are well aware of our research files on former DOJ-NSD head, Mary McCord, and her various tentacles of operations against Donald Trump before and after the 2016 election.To enhance this ongoing effort, Twitter user “pepesgrandma” share…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347536/posts",
    "timestamp": "2025-10-20T18:02:34Z"
  },
  {
    "title": "Interesting – Damning Email Surfaces Showing Mary McCord Sending FBI Information on Her Surveillance of Oathkeepers Group Following 2020 Election Result",
    "description": "Obviously, readers here are well aware of our research files on former DOJ-NSD head, Mary McCord, and her various tentacles of operations against Donald Trump before and after the 2016 election.To enhance this ongoing effort, Twitter user “pepesgrandma” share…",
    "link": "https://freerepublic.com/focus/f-news/4347536/posts",
    "timestamp": "2025-10-20T18:02:34Z"
  },
  {
    "title": "‘400 Years Old’: Trump Scolds Cameraman Over Priceless White House Decor",
    "description": "President Donald Trump openly scolded a cameraman on Monday who accidentally hit a 400-year-old mirror with his camera.",
    "link": "https://dailycaller.com/2025/10/20/trump-scolds-cameraman-white-house-mirror/",
    "timestamp": "2025-10-20T18:02:28Z"
  },
  {
    "title": "Lavrov and Rubio will soon have telephone contact",
    "description": "In the coming days, the preparations for Donald Trump's new summit with Vladimir Putin will be discussed\nThe post Lavrov and Rubio will soon have telephone contact appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/20/lavrov-and-rubio-will-soon-have-telephone-contact/",
    "timestamp": "2025-10-20T18:02:00Z"
  },
  {
    "title": "Price predictions 10/20: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, HYPE",
    "description": "Bitcoin staged a rebound rally to $111,705 as the market recovers from last the recent catastrophic sell-off, but data suggests sellers will continue to take profit at each breakout top.",
    "link": "https://cointelegraph.com/news/price-predictions-10-20-spx-dxy-btc-eth-bnb-xrp-sol-doge-ada-hype",
    "timestamp": "2025-10-20T18:00:55Z"
  },
  {
    "title": "EU’s top diplomat unhappy over Putin-Trump peace summit",
    "description": "Kaja Kallas has cited an ICC arrest warrant for the Russian president ahead of upcoming talks with his US counterpart Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626724-eu-kallas-putin-hungary-visit-not-nice/",
    "timestamp": "2025-10-20T18:00:07Z"
  },
  {
    "title": "Ghislaine Maxwell's New 'Cushy' Prison Helping Keep Former Madam's Life Behind Bars a Secret... as Jeffrey Epstein's Ex Attempts to Escape 20-Year Sentence",
    "description": "Ghislaine Maxwell's life behind bars is being kept out of the news, as the prison is said to be doing all it can to make sure no information leaks.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-new-cushy-prison-helping-life-behind-bars-secret-for-trump/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Centralized Exchanges Are Still Criminals’ Favorite Crypto Money Laundering Tool",
    "description": "Focusing regulatory energy on mixers while letting exchanges remain the primary fiat gateways for illicit funds is like locking the windows while leaving the front door wide open, argues Dr. Jan Philipp Fritsche, managing director of Oak Security.",
    "link": "https://www.coindesk.com/opinion/2025/10/20/centralized-exchanges-are-still-criminals-favorite-crypto-money-laundering-tool",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Seven Million Turn Out for “No Kings” Protests Nationwide. Next Up Massive Disruptions Backed by Unions.",
    "description": "People from across the country marched. Now what?",
    "link": "https://inthesetimes.com/article/no-kings-march-union-organizing-trump-democrats-ice",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Ghislane Maxwell's New 'Cushy' Prison Helping Keep Former Madam's Life Behind Bars a Secret... as Jeffrey Epstein's Ex Attempts to Escape 20-Year Sentence",
    "description": "Ghislaine Maxwell's life behind bars is being kept out of the news, as the prison is said to be doing all it can to make sure no information leaks.",
    "link": "https://radaronline.com/p/ghislane-maxwell-new-cushy-prison-helping-keep-former-madams-life-behind-bars-a-secret-all-for-trump/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "“I’m back!!!”: Fresh out of prison, George Santos makes a speedy Cameo comeback",
    "description": "Former New York Rep. George Santos wasted no time jumping back into the spotlight by reopening his Cameo account, and people have a lot to say about it. \n\n\nLess than 24 hours after President Donald Trump commuted his 87-month prison sentence, the 37-year-old …",
    "link": "https://www.dailydot.com/viral-politics/george-santos-returns-cameo/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Charlamagne Lashes Out at MSNBC for Accusing Him of Pushing ‘MAGA Messaging’ in Tense Exchange With Nicolle Wallace",
    "description": "Charlamagne tha God slammed MSNBC for abusing him of pushing \"MAGA messaging\" during a conversation on anchor Nicolle Wallace's podcast.\nThe post Charlamagne Lashes Out at MSNBC for Accusing Him of Pushing ‘MAGA Messaging’ in Tense Exchange With Nicolle Walla…",
    "link": "https://www.mediaite.com/media/podcasts/charlamagne-lashes-out-at-msnbc-for-accusing-him-of-pushing-maga-messaging-in-tense-exchange-with-nicolle-wallace/",
    "timestamp": "2025-10-20T17:59:09Z"
  }
]