[
  {
    "title": "Democratic Gov. Tony Evers says he won't seek third term in battleground Wisconsin",
    "description": "Democratic Gov. Tony Evers of Wisconsin will not seek a third term in 2026, creating the first open race for governor in the battleground state in 16 years",
    "link": "https://abcnews.go.com/Politics/wireStory/democratic-gov-tony-evers-seek-term-battleground-wisconsin-124041755",
    "timestamp": "2025-07-24T17:26:48Z"
  },
  {
    "title": "Boom fades for US clean energy as Trump guts subsidies",
    "description": "Summary Policy shift risks $373 billion in clean energy investments New tax credit rules could make even fewer projects eligible for incentives Solar manufacturers concerned about demand for U.S.-made products once credits expire July 24 (Reuters) - Singapore…",
    "link": "https://freerepublic.com/focus/f-news/4330536/posts",
    "timestamp": "2025-07-24T17:26:40Z"
  },
  {
    "title": "Republican Senators Call for Special Counsel to Investigate Barack Obama",
    "description": "Senators Lindsey Graham and John Cornyn are calling for a special counsel to be appointed to investigate incendiary allegations against Barack Obama.\nThe post Republican Senators Call for Special Counsel to Investigate Barack Obama first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/republican-senators-call-for-special-counsel-to-investigate-barack-obama/",
    "timestamp": "2025-07-24T17:26:08Z"
  },
  {
    "title": "'Get out of here!' DeSantis hurls man who calls him 'pedophile' from media event",
    "description": "Things got heated during a press conference\r\n led by Florida Gov. Ron DeSantis Thursday after the event was disrupted by an individual asking about the state’s new migrant prison Alligator Alcatraz, while also labeling the governor as a “pedophile” for suppor…",
    "link": "https://www.rawstory.com/ron-desantis-2673753882/",
    "timestamp": "2025-07-24T17:25:50Z"
  },
  {
    "title": "Epstein files divide House Republicans in growing 'summer of discontent'",
    "description": "House Republicans face a growing divide over the Epstein files, creating a \"summer of discontent\" as the chamber adjourns early amid pressure from MAGA-aligned members.",
    "link": "https://www.foxnews.com/politics/epstein-files-divide-house-republicans-growing-summer-discontent",
    "timestamp": "2025-07-24T17:25:38Z"
  },
  {
    "title": "Hulk Hogan Has Died at 71",
    "description": "Hulk Hogan as died at 71, according to TMZ. The pro wrestler reportedly suffered cardiac arrest at his home in Florida.",
    "link": "http://www.thecut.com/article/hulk-hogan-died-71.html",
    "timestamp": "2025-07-24T17:24:11Z"
  },
  {
    "title": "How CISOs Can Break Through Communication Barriers",
    "description": "Also in the Forbes CIO newsletter: The problems with recognition and unclear responsibility, Trump unveils his AI policy, Alphabet beats earnings expectations.",
    "link": "https://www.forbes.com/sites/cio/2025/07/24/how-cisos-can-break-through-communication-barriers/",
    "timestamp": "2025-07-24T17:23:43Z"
  },
  {
    "title": "Tulsi Gabbard’s original mistake: She’s pushing the wrong answer to the wrong question",
    "description": "As Tulsi Gabbard's claims about Barack Obama and Donald Trump's Russia scandal fall apart, she would've been better off sticking to the \"no collusion\" line.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tulsi-gabbards-russia-hoax-mistake-s-pushing-wrong-answer-wrong-questi-rcna220828",
    "timestamp": "2025-07-24T17:23:37Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "After weeks of talks in Qatar, there have been small signs of progress.",
    "link": "https://www.bostonherald.com/2025/07/24/witkoff-cutting-short-gaza-ceasefire-talks/",
    "timestamp": "2025-07-24T17:22:25Z"
  },
  {
    "title": "White House sends mixed signals in Russia 'hoax' blame game",
    "description": "DNI Tulsi Gabbard releases documents suggesting Obama administration manufactured intelligence about Russian election interference despite evidence it didn't impact 2016 results.",
    "link": "https://www.foxnews.com/politics/white-house-sends-mixed-signals-russia-hoax-blame-game",
    "timestamp": "2025-07-24T17:22:07Z"
  },
  {
    "title": "2026 … Already?",
    "description": "With Virginia’s 45-day-long early voting window, the commonwealth is just slightly less than a month away from the beginning of the 2025 statewide election for... Read More\nThe post 2026 … Already? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/24/2026-already/",
    "timestamp": "2025-07-24T17:21:33Z"
  },
  {
    "title": "Oliver Darcy Rips CNN Execs Hurting Network With ‘Softer’ Trump Coverage",
    "description": "Darcy hit out at CNN’s leadership for hurting the network by overseeing a sluggish transition to digital and \"softer\" coverage of Trump.\nThe post Oliver Darcy Rips CNN Execs Hurting Network With ‘Softer’ Trump Coverage first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/oliver-darcy-rips-cnn-execs-hurting-network-with-softer-trump-coverage/",
    "timestamp": "2025-07-24T17:20:57Z"
  },
  {
    "title": "Trump Administration Pulls U.S. out of UNESCO -- Again -- Reversing Biden",
    "description": "The Trump administration officially withdrew from the United Nations Educational, Scientific and Cultural Organization (UNESCO) on Tuesday, reversing another policy of President Joe Biden's administration.\nThe post Trump Administration Pulls U.S. out of UNESC…",
    "link": "https://www.breitbart.com/national-security/2025/07/24/trump-administration-pulls-u-s-out-of-unesco-again-reversing-biden/",
    "timestamp": "2025-07-24T17:20:47Z"
  },
  {
    "title": "Butthurt Stephen Colbert Lashes Out After Show’s Cancellation — Starts Mocking Trump’s ‘Micropenis’ (VIDEO)",
    "description": "Late Show host Stephen Colbert is clearly taking his show’s cancellation to heart.\nThe post Butthurt Stephen Colbert Lashes Out After Show’s Cancellation — Starts Mocking Trump’s ‘Micropenis’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/butthurt-stephen-colbert-lashes-after-shows-cancellation-starts/",
    "timestamp": "2025-07-24T17:20:16Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "President Donald Trump’s special envoy Steve Witkoff says the U_S_ is cutting short Gaza ceasefire talks and bringing home its negotiating team from Qatar for consultations after the latest response from Hamas “shows a lack of desire to reach a ceasefi...",
    "link": "https://abcnews.go.com/US/wireStory/trump-envoy-witkoff-us-cutting-short-gaza-ceasefire-124042445",
    "timestamp": "2025-07-24T17:18:53Z"
  },
  {
    "title": "Hulk Hogan: The controversial wrestling legend who helped launch a global industry",
    "description": "The charismatic strongman who helped form WWE into the multibillion-dollar juggernaut it is today, and whose later life was marred by controversy, has passed away at 71, writes Ryan Coogan",
    "link": "https://www.the-independent.com/arts-entertainment/hulk-hogan-death-wwe-wrestling-obituary-b2586383.html",
    "timestamp": "2025-07-24T17:18:36Z"
  },
  {
    "title": "Elon Musk’s Net Worth Drops $17 Billion As Tesla Shares Plunge",
    "description": "Musk said his automaker “probably could have a few rough quarters” ahead as federal electric vehicle credits expire soon.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/24/elon-musks-net-worth-drops-17-billion-as-tesla-shares-plunge/",
    "timestamp": "2025-07-24T17:18:26Z"
  },
  {
    "title": "Trump backs Musk as Tesla stock slides 9%: ‘I want Elon, and all businesses within our Country, to THRIVE’",
    "description": "The day before, Tesla said revenue fell 12% and profit dropped 16% in the April-June quarter.",
    "link": "https://fortune.com/2025/07/24/trump-wants-elon-musk-to-thrive-earnings-tesla/",
    "timestamp": "2025-07-24T17:18:00Z"
  },
  {
    "title": "‘The View’s Joy Behar Declares The “Tide Is Turning” On Trump As His Supporters Question His Handling Of The Jeffrey Epstein Case",
    "description": "\"I want to see how this plays out,\" she said, adding that she's feeling \"optimistic.\"",
    "link": "https://decider.com/2025/07/24/views-joy-behar-tide-turning-trump-supporters-question-jeffrey-epstein-case/",
    "timestamp": "2025-07-24T17:17:28Z"
  },
  {
    "title": "Democratic Gov. Tony Evers Says He Won't Seek Third Term In Wisconsin",
    "description": "The battleground state hasn’t seen an open race for governor in 16 years.",
    "link": "https://www.huffpost.com/entry/tony-evers-wisconsin-governor-election-2026_n_688268b9e4b01be72b3e5a10",
    "timestamp": "2025-07-24T17:16:14Z"
  },
  {
    "title": "Hulk Hogan, wrestling superstar who helped reshape American media law, dies at 71",
    "description": "Hogan's lawsuit—and $140 million jury verdict—against Gawker Media sent shockwaves through American culture.",
    "link": "https://fortune.com/2025/07/24/hulk-hogan-obituary-wrestling-dead-71-peter-thiel-donald-trump/",
    "timestamp": "2025-07-24T17:15:45Z"
  },
  {
    "title": "How Hulk Hogan came to endorse Trump in 2024",
    "description": "Trump paid tribute to Hogan, writing he \"was MAGA all the way.\"",
    "link": "https://abcnews.go.com/Politics/hulk-hogan-endorse-trump-2024/story?id=124039602",
    "timestamp": "2025-07-24T17:15:09Z"
  },
  {
    "title": "US Justice Department to discuss Epstein with Ghislaine Maxwell",
    "description": "Talks with imprisoned ex-girlfriend of sex offender Jeffrey Epstein come as pressure mounts on Trump administration.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-justice-department-to-discuss-epstein-with-ghislaine-maxwell",
    "timestamp": "2025-07-24T17:14:56Z"
  },
  {
    "title": "Iran says it’s ready for nuclear talks with Washington but only if the U.S. rebuilds trust",
    "description": "The comments Thursday by Deputy Foreign Minister Kazem Gharibabadi come a day before talks are to be held between Tehran and European nations.",
    "link": "https://www.pbs.org/newshour/world/iran-says-its-ready-for-nuclear-talks-with-washington-but-only-if-the-u-s-rebuilds-trust",
    "timestamp": "2025-07-24T17:14:51Z"
  },
  {
    "title": "Hulk Hogan wasn’t just an American icon, he was America",
    "description": "You may not have liked Hulk Hogan, either inside the ring or out, but you can’t deny he was an American original.",
    "link": "https://sports.yahoo.com/wrestling/article/hulk-hogan-wasnt-just-an-american-icon-he-was-america-171422611.html",
    "timestamp": "2025-07-24T17:14:22Z"
  },
  {
    "title": "Hulk Hogan dies: World reacts",
    "description": "Wrestling fans are mourning the death of icon Hulk Hogan, who died on July 24 at the age of 71.",
    "link": "https://www.wftv.com/news/trending/hulk-hogan-dies-world-reacts/BRQNYNZIVZHDFJX3RE4XJKWZGE/",
    "timestamp": "2025-07-24T17:14:21Z"
  },
  {
    "title": "Senator Grassley Urges Trump to Protect Federal Employee Whistleblowers",
    "description": "Senator Charles Grassley (R-IA) issued a letter today to President Donald Trump requesting that federal employee whistleblowers be fully protected under the laws\nThe post Senator Grassley Urges Trump to Protect Federal Employee Whistleblowers appeared first o…",
    "link": "https://whistleblowersblog.org/exclusives/senator-grassley-urges-trump-to-protect-federal-employee-whistleblower/",
    "timestamp": "2025-07-24T17:14:02Z"
  },
  {
    "title": "Bevan: Progressives Won't Fold For A Centrist Without Trump Looming, No Coronation For Rahm In 2028",
    "description": "RCP co-founder Tom Bevan spoke with Emily Jashinsky on \"Afterparty\" about former Chicago Mayor Rahm Emanuel's presidential aspirations and why Democrats shouldn't count on the progressive wing of the party folding and rallying around a centrist like Rahm, as …",
    "link": "https://www.realclearpolitics.com/video/2025/07/24/tom_bevan_2028_primary_will_be_a_dogfight_progressives_wont_fold_for_a_centrist_like_they_did_in_2020.html",
    "timestamp": "2025-07-24T17:13:39Z"
  },
  {
    "title": "South Park Declares War On Donald Trump With Its Shocking Season 27 Premiere",
    "description": "South Park went full scorched earth in its season 27 premiere with a storyline that took several direct shots at Donald Trump, Paramount, and more.",
    "link": "https://www.slashfilm.com/1921066/south-park-season-27-premiere-donald-trump-war/",
    "timestamp": "2025-07-24T17:12:31Z"
  },
  {
    "title": "Trump's AI plans will strip AI of intelligence and humanity – and nobody wants this",
    "description": "President Donald Trump's latest series of Executive Orders makes it clear that his administration will do all it can to prevent future AI models from taking into consideration any form of diversity, equity, and inclusion.",
    "link": "https://www.techradar.com/ai-platforms-assistants/trumps-ai-plans-will-strip-ai-of-intelligence-and-humanity-and-nobody-wants-this",
    "timestamp": "2025-07-24T17:12:15Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "President Donald Trump’s special envoy Steve Witkoff said Thursday the U.S. is cutting short Gaza ceasefire talks and bringing home its negotiating team from...",
    "link": "https://www.yahoo.com/news/articles/trump-envoy-witkoff-says-us-171140868.html",
    "timestamp": "2025-07-24T17:11:40Z"
  },
  {
    "title": "US mulls limited authorizations for oil firms in Venezuela, sources say",
    "description": "HOUSTON/WASHINGTON (Reuters) -U.S. President Donald Trump's administration is preparing to grant new authorizations to key partners of Venezuela's state-run ...",
    "link": "https://finance.yahoo.com/news/us-mulls-limited-authorizations-oil-171112412.html",
    "timestamp": "2025-07-24T17:11:12Z"
  },
  {
    "title": "Britain and India sign free trade pact during Modi visit",
    "description": "LONDON: Britain and India signed a free trade agreement on Thursday (Jul 24) during Indian Prime Minister Narendra Modi’s visit, marking the UK’s biggest post-Brexit trade deal and Ind",
    "link": "https://www.channelnewsasia.com/world/britain-and-india-sign-free-trade-pact-during-modi-visit-5257026",
    "timestamp": "2025-07-24T17:11:00Z"
  },
  {
    "title": "NEW POLL: Trump Hits Second-Term Low in Latest Gallup Poll, Nears All-Time Worst",
    "description": "Trump — who has falsely claimed that his approval rating is currently at its highest level ever — is actually approaching an all-time low, according to Gallup.\nThe post NEW POLL: Trump Hits Second-Term Low in Latest Gallup Poll, Nears All-Time Worst first app…",
    "link": "https://www.mediaite.com/media/news/new-poll-trump-hits-second-term-low-in-latest-gallup-poll-nears-all-time-worst/",
    "timestamp": "2025-07-24T17:10:28Z"
  },
  {
    "title": "Gaza and Ukraine are both waiting for action",
    "description": "Israel’s allies need to take concrete steps to increase pressure on the Netanyahu government.",
    "link": "https://theconversation.com/gaza-and-ukraine-are-both-waiting-for-action-261894",
    "timestamp": "2025-07-24T17:10:06Z"
  },
  {
    "title": "Trump's fossil-fueled AI Action Plan pushes deregulation",
    "description": "The Trump administration's AI Action Plan and executive orders include deregulation that would fast-track data center and chip buildouts while boosting the power grid.",
    "link": "https://www.techtarget.com/searchdatacenter/news/366628044/Trumps-fossil-fueled-AI-Action-Plan-pushes-deregulation",
    "timestamp": "2025-07-24T17:10:00Z"
  },
  {
    "title": "Governor Evers won’t seek third term in battleground Wisconsin",
    "description": "Wisconsin’s Democratic governor, Tony Evers, announced Thursday that he will not seek a third term in 2026, creating the first open race for governor in the battleground state in 16 years.",
    "link": "https://www.fox6now.com/news/governor-evers-wont-seek-third-term-wisconsin",
    "timestamp": "2025-07-24T17:08:34Z"
  },
  {
    "title": "Trump Has Lost The QAnon Shaman",
    "description": "Donald Trump is losing some of his biggest supporters - and it is unknown if they will come back or if the tide really is turning. Jacob Chansley (also known as the QAnon shaman) is apparently furious at Donald Trump - replying to a post of Trump’s 2023 mugsh…",
    "link": "https://crooksandliars.com/2025/07/trump-has-lost-qanon-shaman",
    "timestamp": "2025-07-24T17:07:12Z"
  },
  {
    "title": "Linda McMahon Is An Idiot, Part Infinity",
    "description": "Education Secretary Linda McMahon took a victory lap over Columbia University, who paid a bribe\r\n reached a deal with the Trump administration to pay more than $220 million to the federal government so Trump would restore federal research money that was cance…",
    "link": "https://crooksandliars.com/2025/07/linda-mcmahon-left-big-part-out-about",
    "timestamp": "2025-07-24T17:07:11Z"
  },
  {
    "title": "Trump threatens to escalate trade war with new round of tariffs up to 50%",
    "description": "Speaking at an AI summit in Washington, Trump laid out his latest tariff plans, describing them as “reciprocal” duties ahead of an Aug. 1 deadline.",
    "link": "https://nypost.com/2025/07/24/business/trump-threatens-to-escalate-trade-war-with-new-round-of-tariffs-up-to-50/",
    "timestamp": "2025-07-24T17:07:10Z"
  },
  {
    "title": "Could climate anxiety be a form of pre-traumatic stress disorder? A psychologist explains the research",
    "description": "Climate anxiety is not yet officially recognised as a mental disorder, but it’s a natural fear response.",
    "link": "https://theconversation.com/could-climate-anxiety-be-a-form-of-pre-traumatic-stress-disorder-a-psychologist-explains-the-research-260849",
    "timestamp": "2025-07-24T17:06:32Z"
  },
  {
    "title": "Wrestling superstar Hulk Hogan dies age 71",
    "description": "WWE: 'One of pop culture’s most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s'",
    "link": "https://www.wnd.com/2025/07/wrestling-superstar-hulk-hogan-dies-age-71/",
    "timestamp": "2025-07-24T17:05:51Z"
  },
  {
    "title": "Wisconsin Gov. Tony Evers won't run for re-election in 2026",
    "description": "Wisconsin Democratic Gov. Tony Evers' decision not to seek a third term will set off a wide open race to replace him in the closely divided battleground state.",
    "link": "https://www.nbcnews.com/politics/2026-election/wisconsin-gov-tony-evers-wont-run-re-election-rcna220797",
    "timestamp": "2025-07-24T17:05:25Z"
  },
  {
    "title": "Pro-Trump Tech Billionaire Palmer Luckey Considers Offering Laptops Made in the USA",
    "description": "Palmer Luckey, the founder of military tech firm Anduril Industries and a VR innovator once fired by Mark Zuckerberg for supporting Donald Trump, is considering entering the laptop market with a fully American-made product.\nThe post Pro-Trump Tech Billionaire…",
    "link": "https://www.breitbart.com/tech/2025/07/24/pro-trump-tech-billionaire-palmer-luckey-considers-offering-laptops-made-in-the-usa/",
    "timestamp": "2025-07-24T17:01:36Z"
  },
  {
    "title": "UK and India sign free trade agreement during Modi visit",
    "description": "The two countries hope the accord will boost trade between them by 25.5 billion pounds.",
    "link": "https://www.aljazeera.com/news/2025/7/24/uk-and-india-sign-free-trade-agreement-during-modi-visit",
    "timestamp": "2025-07-24T17:01:16Z"
  },
  {
    "title": "Anchorage Digital announces stablecoin issuance platform on GENIUS' heels",
    "description": "Digital asset service company Anchorage Digital has launched a stablecoin issuance platform after the GENIUS stablecoin bill became law in the United States.",
    "link": "https://cointelegraph.com/news/anchorage-digital-stablecoin-platform-genius-signing",
    "timestamp": "2025-07-24T17:00:48Z"
  },
  {
    "title": "Trump, Epstein and a Doodle: The birthday letter that set off a political firestorm - that is burning MAGA",
    "description": "A 2003 birthday scrapbook for Jeffrey Epstein, featuring a nude sketch and a cryptic note allegedly signed by Donald Trump, has ignited a political firestorm. The Wall Street Journal's publication of the note led to a $20 billion lawsuit from Trump, who denie…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-epstein-and-a-doodle-the-birthday-letter-that-set-off-a-political-firestorm-that-is-burning-maga/articleshow/122886274.cms",
    "timestamp": "2025-07-24T17:00:48Z"
  },
  {
    "title": "U.S. Senate has ‘different ideas’ about crypto bill – Why it’s delaying progress",
    "description": "Will the Congress beat the September deadline and pass a crypto market structure bill?",
    "link": "https://ambcrypto.com/senate-has-different-ideas-about-crypto-bill-why-its-delaying-progress/",
    "timestamp": "2025-07-24T17:00:40Z"
  },
  {
    "title": "Hulk Hogan dies aged 71",
    "description": "Hulk Hogan, the WWE wrestler and ally of President Donald Trump, has died at the age of 71. Hogan suffered a cardiac arrest and emergency responders were called to his home in Clearwater, Florida where they were unable to revive him, according to TMZ. The for…",
    "link": "https://freerepublic.com/focus/f-news/4330530/posts",
    "timestamp": "2025-07-24T16:59:08Z"
  },
  {
    "title": "WH may have allowed Chevron to pump oil in Venezuela",
    "description": "The administration of United States President Donald Trump has supposedly given a license to Chevron Corporation to resume pumping oil in Venezuela after revoking it earlier this year, the Wall Street...",
    "link": "https://biztoc.com/x/8b5557d987c21193",
    "timestamp": "2025-07-24T16:58:36Z"
  },
  {
    "title": "Trump offers support to Tesla in surprising post after results send stock lower",
    "description": "U.S. President Donald Trump took to social media Thursday morning to support Elon Musk’s car company, a startling development given their bitter public feud.\n“I want Elon, and all businesses within our Country, to THRIVE,” Trump wrote on Truth Social.",
    "link": "https://biztoc.com/x/fd088c38682974f7",
    "timestamp": "2025-07-24T16:58:24Z"
  },
  {
    "title": "Trump Dredges Up the Russian Oil Fight",
    "description": "Familiar partners face familiar grievances—with more threats and unpredictability.",
    "link": "http://foreignpolicy.com/2025/07/24/trump-rutte-graham-russian-oil-india-brazil-china/",
    "timestamp": "2025-07-24T16:58:21Z"
  },
  {
    "title": "This Satan Scene In \"South Park's\" New Trump Episode Is Being Called \"Pure Magic\"",
    "description": "\"High art.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/south-park-trump-episode",
    "timestamp": "2025-07-24T16:58:18Z"
  },
  {
    "title": "‘Fourth-Rate Show’: Trump White House Rages at ‘South Park’ Over Searing Satire",
    "description": "Parker and Stone also explicitly roasted Paramount for settling a recent lawsuit with Trump and for cancelling late-night host Stephen Colbert\nThe post ‘Fourth-Rate Show’: Trump White House Rages at ‘South Park’ Over Searing Satire first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fourth-rate-show-trump-white-house-rages-at-south-park-over-searing-satire/",
    "timestamp": "2025-07-24T16:57:11Z"
  },
  {
    "title": "Slog AM: City Council Ghosts the Renters Commission, the State GOP Is Trying to Suppress the Vote, Trump's in the Epstein Files",
    "description": "The Stranger's Morning News Roundup.\n \n by Marcus Harrison Green\n \n \n \n Today's weather is mostly sunny with a high near 78, which means half our fair city will pretend it’s a heatwave while the other half will refuse to give up their Patagonia fleece.\nTrump …",
    "link": "https://www.thestranger.com/slog-am/2025/07/24/80163610/slog-am-city-council-ghosts-the-renters-commission-the-state-gop-is-trying-to-suppress-the-vote-trumps-in-the-epstein-files",
    "timestamp": "2025-07-24T16:57:00Z"
  },
  {
    "title": "Trump overheard in vulgar Oval Office panic over Epstein",
    "description": "President Donald Trump is reportedly in full panic mode, using profanity during a heated Oval Office moment as pressure mounts over his ties to Jeffrey Epstein, according to an inside source who spoke with Politico\r\n.“They’re going to accuse me of some funny …",
    "link": "https://www.rawstory.com/trump-2673753778/",
    "timestamp": "2025-07-24T16:56:23Z"
  },
  {
    "title": "Wallets Linked to Trump-Affiliated World Liberty Financial (WLFI) Add $36,767,736 Worth of Ethereum: Report",
    "description": "The Trump-affiliated decentralized finance (DeFi) project World Liberty Financial (WLFI) has been on an Ethereum-buying spree. On-chain analyst Ai tells their 102,900 followers on the social media platform X that three WLFI addresses accumulated 10,013.54 Eth…",
    "link": "https://dailyhodl.com/2025/07/24/wallets-linked-to-trump-affiliated-world-liberty-financial-wlfi-add-36767736-worth-of-ethereum-report/",
    "timestamp": "2025-07-24T16:55:15Z"
  },
  {
    "title": "US wrestling icon Hulk Hogan dies at 71",
    "description": "Hogan helped elevate US wrestling to a global phenomenon during the 1980s with his flair and bravado.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-wrestling-icon-hulk-hogan-dies-at-71",
    "timestamp": "2025-07-24T16:54:42Z"
  },
  {
    "title": "Fed prepares for Trump visit as tensions with White House escalate",
    "description": "WASHINGTON: The US Federal Reserve said on Thursday (Jul 24) it is working with the White House to accommodate President Donald Trump's visit to the central bank’s Washington headquarters, a",
    "link": "https://www.channelnewsasia.com/world/fed-prepares-trump-visit-tensions-white-house-escalate-5257001",
    "timestamp": "2025-07-24T16:54:00Z"
  },
  {
    "title": "US fertility rate drops to a new low, CDC data finds",
    "description": "The US birth rate has fluctuated over the years and can be influenced by factors such as economic stability.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-fertility-rate-drops-to-a-new-low-cdc-data-finds",
    "timestamp": "2025-07-24T16:53:15Z"
  },
  {
    "title": "Trump’s White House Throws Hissy Fit In Response To ‘South Park’ Portrayal Of Him And His ‘Teeny-Tiny Manhood’",
    "description": "President Trump’s White House has issued a statement in response to how he was portrayed on the iconic animated series South Park. The season 27 premiere of the long-running Comedy Central series portrayed Trump as having a “teeny-tiny” manhood and literally …",
    "link": "https://brobible.com/culture/article/trump-white-house-responds-to-south-park/",
    "timestamp": "2025-07-24T16:53:04Z"
  },
  {
    "title": "US Fertility Rate Plummeted To All-Time Low In 2024, New Data Shows",
    "description": "The U.S. fertility rate dropped to a new all-time low of 1.6 children per woman in 2024, according to data from the CDC released Thursday.",
    "link": "https://dailycaller.com/2025/07/24/fertility-rate-all-time-low-cdc/",
    "timestamp": "2025-07-24T16:52:56Z"
  },
  {
    "title": "Hulk Hogan, pro wrestling icon, dead at age 71",
    "description": "The pop culture icon saw his widespread popularity fade in recent years due to allegations of racism and his support for Donald Trump",
    "link": "https://www.msnbc.com/top-stories/latest/hulk-hogan-dead-71-www-rcna220833",
    "timestamp": "2025-07-24T16:52:43Z"
  },
  {
    "title": "Commerce Secretary Lutnick states that TikTok will go Dark in America in mid-September if China doesn’t give the U.S. Control of the App",
    "description": "In a new CNBC report and interview this morning with Commerce Secretary Howard Lutnick he stated that TikTok will go dark for Americans on September ...",
    "link": "https://www.patentlyapple.com/2025/07/commerce-secretary-lutnick-states-that-tiktok-will-go-dark-in-america-in-mid-september-if-china-does.html",
    "timestamp": "2025-07-24T16:52:43Z"
  },
  {
    "title": "Specter of Epstein Looms Over Congress’ Long Recess",
    "description": "As members of the House head off to a six-week summer recess, the specter of Jeffrey Epstein still looms large. “If you ask my staff,... Read More\nThe post Specter of Epstein Looms Over Congress’ Long Recess appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/24/specter-epstein-controversy-looms-over-august-recess/",
    "timestamp": "2025-07-24T16:52:01Z"
  },
  {
    "title": "Harvard now being investigated for use of foreign student visa program",
    "description": "State Department questioning whether school violated regulations of the Exchange Visitor Program",
    "link": "https://www.wnd.com/2025/07/harvard-now-being-investigated-use-foreign-student-visa/",
    "timestamp": "2025-07-24T16:51:22Z"
  },
  {
    "title": "FCC Chair Backs White House Threat to Cancel The View After Hosts Rip Trump: 'Consequences Aren't Finished'",
    "description": "The FCC chair appeared to back the White House's threat to cancel \"The View\" after the show's hosts mocked Donald Trump's recent targeting of Barack Obama.",
    "link": "https://www.ibtimes.com/fcc-chair-backs-white-house-threat-cancel-view-after-hosts-rip-trump-consequences-arent-3779358",
    "timestamp": "2025-07-24T16:51:17Z"
  },
  {
    "title": "White House Fires Back at South Park: “Show Hasn’t Been Relevant for Over 20 Years”",
    "description": "The White House has responded to South Park’s brutal portrayal of Donald Trump, calling the long-running comedy series no longer \"relevant\" and accusing it of \"hanging on by a thread with uninspired ideas in a desperate attempt for attention.\"",
    "link": "https://consequence.net/2025/07/white-house-responds-south-park/",
    "timestamp": "2025-07-24T16:50:15Z"
  },
  {
    "title": "Hulk Hogan’s ex-wife Linda shared poignant post about WWE legend days before his death",
    "description": "The former wrestler died July 24 aged 71",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/hulk-hogan-dead-linda-wife-picture-b2795442.html",
    "timestamp": "2025-07-24T16:49:30Z"
  },
  {
    "title": "Charlie Kirk fears world will be 'toxically feminine' after Hulk Hogan's death",
    "description": "MAGA influencer Charlie Kirk lamented that the world will be \"toxically feminine\" following the death of wrestling entertainer Hulk Hogan at 71.\"He was an icon for so many young men in this country and in a world now that is just so toxically feminine, we're …",
    "link": "https://www.rawstory.com/charlie-kirk-hulk-hogan-feminism/",
    "timestamp": "2025-07-24T16:48:40Z"
  },
  {
    "title": "The Business of Obedience—Trump's Blueprint for Authoritarian Capitalism | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThree days after comedian Stephen Colbert called Paramount's $16 million settlement with President Donald Trump \"a big fat bribe,\" CBS canceled his top-rated late-night show. The timing wasn't coincidental, it…",
    "link": "https://biztoc.com/x/171997abb0d7ee23",
    "timestamp": "2025-07-24T16:47:44Z"
  },
  {
    "title": "Anti-Trump Protests Planned for President's Scotland Visit: What to Know",
    "description": "The president is expected to land in Scotland on Friday to visit his golf courses.",
    "link": "https://www.newsweek.com/anti-trump-protests-planned-scotland-visit-what-know-aberdeen-edinburgh-dumfries-golf-course-2103560",
    "timestamp": "2025-07-24T16:47:40Z"
  },
  {
    "title": "Ms. on Men: Rethinking Masculinity in the Wake of the 2025 Election",
    "description": "When the editors of Ms. asked me to guest-edit “Ms. on Men,” a feature section in the latest print issue highlighting key issues related to men and masculinity, I knew this was more than a symbolic gesture—it was a necessary intervention. \nIn the wake of the …",
    "link": "https://msmagazine.com/2025/07/24/ms-magazine-men-masculinity-jackson-katz-special-feature/",
    "timestamp": "2025-07-24T16:47:06Z"
  },
  {
    "title": "Coca-Cola hopes a major change will win back customers",
    "description": "The beverage giant has made a bold announcement amid weak sales.",
    "link": "https://www.thestreet.com/retail/coca-cola-hopes-a-major-change-will-win-back-customers",
    "timestamp": "2025-07-24T16:47:00Z"
  },
  {
    "title": "Trump assassination attempt suspect Ryan Routh can represent himself at trial, federal judge rules",
    "description": "Ryan Routh, the man accused of trying to assassinate President Donald Trump at his Florida golf course last year, can represent himself in his trial, judge rules.",
    "link": "https://www.foxnews.com/us/trump-assassination-attempt-suspect-ryan-routh-can-represent-himself-trial-federal-judge-rules",
    "timestamp": "2025-07-24T16:46:57Z"
  },
  {
    "title": "Wrestling legend Hulk Hogan dies at 71",
    "description": "Hulk Hogan, who helped turn pro wrestling into billion-dollar spectacle, dies at 71",
    "link": "https://www.rediff.com/sports/report/wrestling-legend-hulk-hogan-dies-at-71/20250724.htm",
    "timestamp": "2025-07-24T16:46:51Z"
  },
  {
    "title": "Hulk Hogan stole the show at 2024 RNC — you won’t believe what he did on stage",
    "description": "Wrestling icon Hulk Hogan passed away at 71 due to cardiac arrest. Beyond wrestling, Hogan was a cultural phenomenon, known for his charisma and signature style. Even in his final year, he made a memorable appearance at the 2024 Republican National Convention…",
    "link": "https://economictimes.indiatimes.com/news/international/us/hulk-hogan-stole-the-show-at-2024-rnc-you-wont-believe-what-he-did-on-stage/articleshow/122887183.cms",
    "timestamp": "2025-07-24T16:46:09Z"
  },
  {
    "title": "AG Pam Bondi launches ‘strike force’ after declassified intel reveals Obama admin’s flawed 2016 Trump-Russia probe",
    "description": "\"We will investigate these troubling disclosures fully and leave no stone unturned to deliver justice,” Bondi said.",
    "link": "https://nypost.com/2025/07/24/us-news/pam-bondi-launches-strike-force-after-declassified-intel-reveals-obama-admins-flawed-2016-trump-russia-probe/",
    "timestamp": "2025-07-24T16:46:06Z"
  },
  {
    "title": "Hulk Hogan, wrestling icon and Trump backer, dies at 71 | Honolulu Star-Advertiser",
    "description": "Hulk Hogan, the American sports and entertainment star who made professional wrestling a global phenomenon and loudly supported Donald Trump for president, has died at the age of 71, World Wrestling Entertainment said today.",
    "link": "https://www.staradvertiser.com/2025/07/24/sports/sports-breaking/hulk-hogan-wrestling-icon-and-trump-backer-dies-at-71/",
    "timestamp": "2025-07-24T16:45:04Z"
  },
  {
    "title": "CNET Daily Tariff Price Impact Tracker: How 11 Key Products Are Reacting to Inflation",
    "description": "With inflation back on the rise, keeping track of specific products for price changes can help give you a clearer picture of where things stand.",
    "link": "https://www.cnet.com/tech/cnet-daily-tariff-price-impact-tracker-how-11-key-are-reacting-to-inflation/",
    "timestamp": "2025-07-24T16:45:00Z"
  },
  {
    "title": "Trump administration reaches agreement with Columbia on racial discrimination",
    "description": "School to pay $200 million in the largest employment discrimination public settlement in decades",
    "link": "https://www.wnd.com/2025/07/trump-administration-reaches-agreement-columbia-racial-discrimination/",
    "timestamp": "2025-07-24T16:44:44Z"
  },
  {
    "title": "Hulk Hogan, icon in professional wrestling, dies at age 71",
    "description": "Hulk Hogan, the mustachioed, headscarf-wearing icon in the world of professional wrestling, has died at age 71",
    "link": "https://www.wftv.com/entertainment/hulk-hogan-icon/HGN36FYJPRAYJHYELKZFSJTBWA/",
    "timestamp": "2025-07-24T16:44:39Z"
  },
  {
    "title": "'South Park' mocks Paramount's settlement with Trump after creators sign $1.5B deal",
    "description": "The media conglomerate Paramount announced Wednesday afternoon that the creators of “South Park” had agreed to produce 50 new episodes over the next five years in a deal reportedly valued at $1.5 billion. Ten hours later, “South Park” creators Matt Stone and …",
    "link": "https://freerepublic.com/focus/f-chat/4330528/posts",
    "timestamp": "2025-07-24T16:44:28Z"
  },
  {
    "title": "Mike Johnson risks Trump's wrath as he loses control of the GOP caucus: expert",
    "description": "House Speaker Mike Johnson (R-LA) may go from hero to zero in Donald Trump's eyes as a \"rift\" grows within the House GOP caucus over the Jeffrey Epstein files and Republicans side with Democrats in demanding transparency.Johnson chalked up a big win with the …",
    "link": "https://www.rawstory.com/johnson-trump-epstein/",
    "timestamp": "2025-07-24T16:42:52Z"
  },
  {
    "title": "The Risks of Israel’s Druze Policy",
    "description": "Picking and choosing between Druze leaders will prove counterproductive.",
    "link": "http://foreignpolicy.com/2025/07/24/the-risks-of-israels-druze-policy/",
    "timestamp": "2025-07-24T16:42:51Z"
  },
  {
    "title": "Wrestling legend Hulk Hogan once called Trump the 'toughest of them all' at Republican National Convention",
    "description": "Hogan appeared at the Republican National Convention in July 2024 to endorse President Donald Trump.",
    "link": "https://www.foxnews.com/politics/wrestling-legend-hulk-hogan-once-called-trump-toughest-them-all-republican-national-convention",
    "timestamp": "2025-07-24T16:42:24Z"
  },
  {
    "title": "DOJ forms strike force to assess Obamagate evidence declassified by Gabbard",
    "description": "Will assess next legal steps that are available and advise on what cases could be brought against former president and his entourage",
    "link": "https://www.wnd.com/2025/07/doj-forms-strike-force-assess-obamagate-evidence-declassified/",
    "timestamp": "2025-07-24T16:40:23Z"
  },
  {
    "title": "Trump walks back threat to strip fed money from Elon Musk companies as feud cools",
    "description": "President Trump said Thursday he has no interest in stripping Elon Musk-owned companies of billions in federal money -- adding that he wants the former \"first buddy\" to \"thrive.\"",
    "link": "https://nypost.com/2025/07/24/us-news/trump-walks-back-threat-to-strip-fed-money-from-elon-musk-companies-as-feud-cools/",
    "timestamp": "2025-07-24T16:40:13Z"
  },
  {
    "title": "Average long-term US mortgage rate eases to 6.74%, keeping home loan borrowing costs elevated",
    "description": "The average rate on a 30-year U.S. mortgage eased this week, offering little relief for prospective homebuyers facing record-high home prices",
    "link": "https://abcnews.go.com/Business/wireStory/average-long-term-us-mortgage-rate-eases-674-124039799",
    "timestamp": "2025-07-24T16:38:38Z"
  },
  {
    "title": "White House Bashes ‘South Park’ After Trump Parody: ‘This Show Hasn’t Been Relevant for Over 20 Years’ and Can’t ‘Derail Trump’s Hot Streak’",
    "description": "Donald Trump’s White House has responded to Wednesday night’s explosive “South Park” Season 27 premiere, which portrayed the president begging for sex from Satan and featured a Deepfake-assisted PSA where Trump goes fully nude. “The Left’s hypocrisy truly has…",
    "link": "https://variety.com/2025/tv/news/white-house-slams-south-park-donald-trump-parody-1236468583/",
    "timestamp": "2025-07-24T16:37:36Z"
  },
  {
    "title": "South Park Posts Trump PSA Online; White House Responds to Episode",
    "description": "Though Donald Trump (at least at the time of this writing) hasn't taken to social media to address the Season 27 opener to the long-running animated series, The White House has responded as best it can to what Trey Parker and Matt Stone's South Park had to sa…",
    "link": "https://bleedingcool.com/tv/south-park-posts-trump-psa-online-white-house-responds-to-episode/",
    "timestamp": "2025-07-24T16:37:04Z"
  },
  {
    "title": "The Business of Obedience—Trump's Blueprint for Authoritarian Capitalism | Opinion",
    "description": "The oligarchy has arrived. The only question is whether anyone will fight it.",
    "link": "https://www.newsweek.com/business-obediencetrumps-blueprint-authoritarian-capitalism-opinion-2103628",
    "timestamp": "2025-07-24T16:36:51Z"
  },
  {
    "title": "Trump Stands By Alina Habba",
    "description": "\"President Donald Trump is doubling down on his nomination of Alina Habba after federal judges in New Jersey declined to extend her term as interim U.S. attorney, and instead chose to replace her with a",
    "link": "https://politicalwire.com/2025/07/24/trump-stands-by-alina-habba/",
    "timestamp": "2025-07-24T16:36:43Z"
  },
  {
    "title": "Trump says he won't 'destroy' Musk's companies by taking away subsidies",
    "description": "President Donald Trump denied claims that he wants to wreck Elon Musk's companies and their work with the U.S. government.",
    "link": "https://biztoc.com/x/ed7acb2417863adc",
    "timestamp": "2025-07-24T16:36:29Z"
  },
  {
    "title": "Trump To Visit Fed HQ As Criticism Of Powell Continues",
    "description": "Trump To Visit Fed HQ As Criticism Of Powell Continues\n \nAuthored by Veronica Friedman via The Epoch Times,\nPresident Donald Trump will visit the Federal Reserve headquarters on Thursday, the White House said, amid ongoing tensions between the administration …",
    "link": "https://biztoc.com/x/91eafacf5c0959bf",
    "timestamp": "2025-07-24T16:36:19Z"
  },
  {
    "title": "Uber dials up new fights with plaintiffs lawyers",
    "description": "In a lawsuit filed on Monday in federal court in Los Angeles, Uber said a group of lawyers had conspired with medical providers to create and submit artificially inflated medical bills.",
    "link": "https://economictimes.indiatimes.com/tech/technology/uber-dials-up-new-fights-with-plaintiffs-lawyers/articleshow/122887215.cms",
    "timestamp": "2025-07-24T16:36:17Z"
  },
  {
    "title": "Trump Commerce Sec. Lutnick says U.S. auto CEOs are 'cool with' higher tariffs than Japan",
    "description": "The head of the American Automotive Policy Council, which represents General Motors, Ford and Stellantis, raised concerns about Trump's Japan deal.",
    "link": "https://www.cnbc.com/2025/07/24/lutnick-trump-japan-deal-auto-trade-tariffs.html",
    "timestamp": "2025-07-24T16:35:40Z"
  },
  {
    "title": "No meaningful edge from 19% duty for PH",
    "description": "THE Philippines will have to work more to attract foreign direct investments (FDI) and sustain economic growth given a marginal tariff gain under a trade deal with the United States, an analyst said.",
    "link": "https://www.manilatimes.net/2025/07/25/business/top-business/no-meaningful-edge-from-19-duty-for-ph/2155736",
    "timestamp": "2025-07-24T16:35:19Z"
  }
]