[
  {
    "title": "Gabbard revokes 37 security clearances at Trump’s direction | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> Director of National Intelligence Tulsi Gabbard said today that she directed the revocation of security clearances of 37 current and former intelligence professionals whom she accused of “politicizing and manipulating intelligence.”",
    "link": "https://www.staradvertiser.com/2025/08/19/breaking-news/gabbard-revokes-37-security-clearances-at-trumps-direction/",
    "timestamp": "2025-08-19T22:47:08Z"
  },
  {
    "title": "Zelensky must show ‘flexibility’ – UK envoy",
    "description": "Ukraine’s Vladimir Zelensky needs to be more flexible during peace talks, a UK diplomat has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623297-uk-envoy-zelensky-flexible/",
    "timestamp": "2025-08-19T22:46:11Z"
  },
  {
    "title": "Tulsi Gabbard Revokes Nearly 40 More Security Clearances In Wake Of Russiagate Fallout",
    "description": "Director of National Intelligence Tulsi Gabbard announced Tuesday that she pulled 37 security clearances from former and current intelligence professionals.",
    "link": "https://dailycaller.com/2025/08/19/tulsi-gabbard-james-clapper-odni-security-clearance-russia-hoax-intelligence/",
    "timestamp": "2025-08-19T22:45:53Z"
  },
  {
    "title": "Trump: Zelensky-Putin meeting being arranged",
    "description": "United States President Donald Trump said that the bilateral meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky is \"in the process\" of being arranged...",
    "link": "https://biztoc.com/x/715fbfbff679a18d",
    "timestamp": "2025-08-19T22:45:00Z"
  },
  {
    "title": "Trump criticizes Smithsonian museums for discussing “how bad slavery was”",
    "description": "The president wondered why the Smithsonian couldn't talk about \"success\" and \"the future.\"",
    "link": "https://www.salon.com/2025/08/19/trump-criticizes-smithsonian-museums-for-discussing-how-bad-slavery-was/",
    "timestamp": "2025-08-19T22:44:26Z"
  },
  {
    "title": "Trump Is Ready to Use ‘Every Element of American Power’ Against Venezuela’s ‘Narco-Terrorist’ Nicolas Maduro to ‘Stop Drugs From Flooding Into the US’",
    "description": "Maduro is in a tough stot, right now.\nThe post Trump Is Ready to Use ‘Every Element of American Power’ Against Venezuela’s ‘Narco-Terrorist’ Nicolas Maduro to ‘Stop Drugs From Flooding Into the US’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/trump-is-ready-use-every-element-american-power/",
    "timestamp": "2025-08-19T22:40:42Z"
  },
  {
    "title": "Sen. Lindsey Graham says Trump ready to ‘crush’ Russian economy if Putin avoids talks with Zelenskyy",
    "description": "Graham’s call with Trump came after high-stakes meetings with Zelenskyy and European leaders.",
    "link": "https://www.bostonherald.com/2025/08/19/congress-russia-sanctions/",
    "timestamp": "2025-08-19T22:40:05Z"
  },
  {
    "title": "Sen. Lindsey Graham says Trump ready to ‘crush’ Russian economy if Putin avoids talks with Zelenskyy",
    "description": "President Donald Trump is willing to “crush” Russia's economy with sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Volodymyr Zelenskyy",
    "link": "https://abcnews.go.com/Politics/wireStory/sen-lindsey-graham-trump-ready-crush-russian-economy-124794272",
    "timestamp": "2025-08-19T22:38:26Z"
  },
  {
    "title": "Hit Putin with sanctions NOW to get him to sit down with Zel and talk peace",
    "description": "Holding off on punishing Moscow isn’t getting President Donald Trump any closer to peace.",
    "link": "https://nypost.com/2025/08/19/opinion/hit-putin-with-sanctions-now-to-get-him-to-sit-down-with-zel-and-talk-peace/",
    "timestamp": "2025-08-19T22:36:38Z"
  },
  {
    "title": "Nationalism Under Attack",
    "description": "Nationalism Under Attack: Globalists Declare War on Freedom The world is embroiled in a profound struggle that extends beyond battlefields to encompass narratives, sanctions, legal warfare, and political ostracism. At its heart lies a clash between two compet…",
    "link": "https://freerepublic.com/focus/f-news/4335537/posts",
    "timestamp": "2025-08-19T22:35:47Z"
  },
  {
    "title": "Trump Tells Zelensky To “Make The Deal” As Rubio Warns Ukraine’s War Is Only Getting Worse",
    "description": "The U.S. is pushing Ukraine toward painful concessions as Secretary of State Marco Rubio warns the war will only worsen after three and a half years of brutal fighting.",
    "link": "https://www.shtfplan.com/headline-news/trump-tells-zelensky-to-make-the-deal-as-rubio-warns-ukraines-war-is-only-getting-worse",
    "timestamp": "2025-08-19T22:30:15Z"
  },
  {
    "title": "Is Trump's Hooters-Obsessed Ambassador Nominee Toning Down His Shtick? (Joe Perticone/The Bulwark)",
    "description": "Joe Perticone / The Bulwark:\nIs Trump's Hooters-Obsessed Ambassador Nominee Toning Down His Shtick?  —  Plus: Take a look inside Frank Lloyd Wright's magnificent government building.  —  NICK ADAMS, THE MASCULINITY HOBBYIST and naturalized immigrant from Aust…",
    "link": "https://www.memeorandum.com/250819/p121",
    "timestamp": "2025-08-19T22:30:00Z"
  },
  {
    "title": "FACT FOCUS: Trump says he has ended seven wars. That’s not accurate",
    "description": "President Donald Trump has projected himself as a peacemaker since returning to the White House .",
    "link": "https://www.twincities.com/2025/08/19/fact-check-trump-wars/",
    "timestamp": "2025-08-19T22:28:29Z"
  },
  {
    "title": "'Pound sand': Arizona election chief hits back at Trump's voting threats",
    "description": "Arizona Secretary of State Adrian Fontes is not amused by President Donald Trump's demand to eliminate mail voting around the country.\"After I tell him to pound sand, I will probably ask the attorney general to file suit,\" Fontes told Axios, noting that mail-…",
    "link": "https://www.rawstory.com/adrian-fontes-2673901970/",
    "timestamp": "2025-08-19T22:28:03Z"
  },
  {
    "title": "Trump says no ground troops, but maybe air support, to back Ukraine peace deal",
    "description": "The path to peace remained uncertain as the U.S. and allies prepared to work out what military support for Kyiv might include.",
    "link": "https://www.japantimes.co.jp/news/2025/08/20/world/politics/ukraine-trump-security-support/",
    "timestamp": "2025-08-19T22:27:00Z"
  },
  {
    "title": "Why the DOJ is looking into DC crime stats",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: As President Donald Trump’s takeover of Washington, DC…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/458579/trump-washington-dc-violent-crime-statistics-national-guard",
    "timestamp": "2025-08-19T22:26:07Z"
  },
  {
    "title": "Kristi Noem Reveals New Measures Making It Harder To Cross US-Mexico Border",
    "description": "Homeland Security Secretary Kristi Noem announced Tuesday that the U.S.-Mexico border wall is being painted black in an attempt to make it more difficult for migrants to climb.",
    "link": "https://www.newsweek.com/kristi-noem-reveals-new-measures-making-it-harder-cross-us-mexico-border-2115998",
    "timestamp": "2025-08-19T22:25:42Z"
  },
  {
    "title": "Sen. Lindsey Graham says Trump ready to ‘crush’ Russian economy if Putin avoids talks with Zelenskyy",
    "description": "Republican Sen. Lindsey Graham said Tuesday that he believes President Donald Trump is prepared to “crush” Russia’s economy with a new wave of sanctions if...",
    "link": "https://www.yahoo.com/news/articles/sen-lindsey-graham-says-trump-222050684.html",
    "timestamp": "2025-08-19T22:20:50Z"
  },
  {
    "title": "US Airman from St. Louis dies in 'vehicle-related incident' on Alaska base",
    "description": "U.S. Airman First Class Tatyana A. Salceda, from St. Louis was killed last week at an Anchorage Air Force base.",
    "link": "https://www.stltoday.com/news/local/crime-courts/article_65ed29c0-a93e-4317-b210-262f6584ba3e.html",
    "timestamp": "2025-08-19T22:20:00Z"
  },
  {
    "title": "D.C. Restaurants Try to Keep Calm and Carry On as More Military Troops Roll In",
    "description": "Canceled karaoke parties. A glaring dip in online restaurant reservations. Food delivery drivers detained in broad daylight. Weekend bar sales sliced in half. A sandwich-hurling protestor who’s now being hailed a national hero. It’s only week two of President…",
    "link": "https://dc.eater.com/restaurant-news/163085/dc-restaurants-federalization-national-guard-donald-trump",
    "timestamp": "2025-08-19T22:19:59Z"
  },
  {
    "title": "Is Gavin Newsom Rigging California for 2028?",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Is Gavin Newsom Rigging California for 2028? appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/08/19/is-gavin-newsom-rigging-california-for-2028/",
    "timestamp": "2025-08-19T22:19:57Z"
  },
  {
    "title": "Trump Hands Travel-Loving Vance Ultimate Poisoned Chalice",
    "description": "Donald Trump has given Vice President J.D. Vance an expanded role in coordinating a peace deal between Russia and Ukraine, in what could end up being a...",
    "link": "https://www.thedailybeast.com/trump-hands-vance-ukraine-peace-deal-he-cant-win/",
    "timestamp": "2025-08-19T22:12:59Z"
  },
  {
    "title": "Trump Attacks Smithsonian For Focus On 'How Bad Slavery Was' And, Boy, The Responses",
    "description": "Social media users wondered what the good parts of slavery were.",
    "link": "https://www.huffpost.com/entry/trump-attacks-smithsonian-slavery-bad_n_68a4deaae4b0d42cc1e38440",
    "timestamp": "2025-08-19T22:12:53Z"
  },
  {
    "title": "Trump Attacks Smithsonian For Focus On 'How Bad Slavery Was' And, Boy, The Responses",
    "description": "Social media users wondered what the good parts of slavery were.",
    "link": "https://www.huffpost.com/entry/trump-attacks-smithsonian-slavery-bad_n_68a4deaae4b0d42cc1e38440?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-19T22:12:53Z"
  },
  {
    "title": "‘We Get the Joke!’ Dana Perino Defends Her Criticism of Newsom Mocking Trump",
    "description": "“I mean, I thought they hated Trump, but they're trying to be more like him and they have to pay people to do it.\"\nThe post ‘We Get the Joke!’ Dana Perino Defends Her Criticism of Newsom Mocking Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/we-get-the-joke-dana-perino-defends-her-criticism-of-newsom-mocking-trump/",
    "timestamp": "2025-08-19T22:10:09Z"
  },
  {
    "title": "Minnesota sues TikTok, alleging it preys on young people with addictive algorithms",
    "description": "Minnesota has joined a wave of states suing TikTok, claiming the app uses addictive algorithms that harm young people's mental health",
    "link": "https://www.wsbtv.com/news/minnesota-sues/FNQDUPP7VBGOPGJUEZ7KYM3Y5Y/",
    "timestamp": "2025-08-19T22:10:00Z"
  },
  {
    "title": "White House Launches TikTok Account as Ban Remains on Hold",
    "description": "Trump has previously praised the app, saying it helped him connect with younger voters and boost support in his win over Kamala Harris.",
    "link": "https://www.newsweek.com/white-house-trump-launches-tik-tok-ban-hold-2115997",
    "timestamp": "2025-08-19T22:08:34Z"
  },
  {
    "title": "Donald Trump Sparks More Health Concerns With Surprise ‘Heaven’ Declaration",
    "description": "Some are theorizing the president’s sudden desire to get into heaven may be tied to a still-secret health issue.",
    "link": "https://www.thedailybeast.com/donald-trump-sparks-more-health-concerns-with-surprise-heaven-declaration/",
    "timestamp": "2025-08-19T22:08:21Z"
  },
  {
    "title": "Netanyahu's criticism of Albanese is following a familiar playbook",
    "description": "Anthony Albanese joins a growing club of prime ministers and presidents personally berated by Benjamin Netanyahu, who is finding himself increasingly isolated on the world stage.",
    "link": "https://www.abc.net.au/news/2025-08-20/analysis-netanyahu-takes-aim-at-albanese-and-australia/105674058",
    "timestamp": "2025-08-19T22:08:08Z"
  },
  {
    "title": "Why Anti-Trans Hate Makes a Toxic Environment for Women Athletes",
    "description": "Laws, rules or regulations ban trans athletes from competing in sports consistent with their gender identity in 29 states, with 21 beginning the ban in kindergarten. The majority-conservative Supreme Court announced last month it’ll be taking on the question …",
    "link": "https://msmagazine.com/2025/08/19/trans-women-athletes-sports/",
    "timestamp": "2025-08-19T22:07:58Z"
  },
  {
    "title": "‘Weak Ass President,’ ‘Pee Pee Tapes,’ Hollywood Celebrities Throw Conspiracy-Filled Tantrums over Trump’s Russia-Ukraine Peace Talks",
    "description": "The peace talks being hosted by President Donald Trump in the White House have spurred a throng of left-wing Hollywood celebrities to take to their social media to spew debunked conspiracy theories and indulge in one tantrum after another.\nThe post ‘Weak Ass …",
    "link": "https://www.breitbart.com/entertainment/2025/08/19/weak-ass-president-pee-pee-tapes-hollywood-celebrities-throw-conspiracy-filled-tantrums-over-trumps-russia-ukraine-peace-talks/",
    "timestamp": "2025-08-19T22:04:48Z"
  },
  {
    "title": "‘Preventable tragedy’: Illegal-alien truck driver accused of killing 3 in crash failed English, traffic-sign tests",
    "description": "During Language Proficiency assessment, foreigner provided 2 correct answers out of a 12-question verbal exam",
    "link": "https://www.wnd.com/2025/08/preventable-tragedy-illegal-alien-truck-driver-accused-killing/",
    "timestamp": "2025-08-19T22:03:29Z"
  },
  {
    "title": "Schiff launches legal defense fund in response to claims Trump is 'weaponizing' justice system",
    "description": "California Democrat Sen. Adam Schiff launched a legal defense fund in response to the Trump administration allegedly 'weaponizing the justice process.'",
    "link": "https://www.foxnews.com/politics/schiff-launches-legal-defense-fund-response-claims-trump-weaponizing-justice-system",
    "timestamp": "2025-08-19T22:03:06Z"
  },
  {
    "title": "What’s behind Gavin Newsom’s “Thank you, Nancy Mace” tweet? Posting like Trump and misgendering the South Carolina representative",
    "description": "California Governor Gavin Newsom's new political strategy drew outrage from both flanks following a dig at South Carolina representative Rep. Nancy Mace on X. The brief tweet, which appeared to draw comparisons between the appearance of Mace and gay right-win…",
    "link": "https://www.dailydot.com/viral-politics/gavin-newsom-thank-you-nancy-mace/",
    "timestamp": "2025-08-19T22:00:00Z"
  },
  {
    "title": "Kodak Black “Imma Shoot,” Peewee Longway “Indo” & More | Daily Visuals 8.19.25",
    "description": "It’s been a few years since Kodak Black surprisingly secured a Presidential Pardon from Donald Trump during his first term as President of The United States, and though Trump doesn’t seem too keen on once again helping any rappers (or people of color of that …",
    "link": "https://hiphopwired.com/2810981/kodak-black-imma-shoot-peewee-longway-indo-more-daily-visuals-8-19-25/",
    "timestamp": "2025-08-19T22:00:00Z"
  },
  {
    "title": "There’s No Easy End to the War in Ukraine",
    "description": "From the daily newsletter: an interview with Joshua Yaffa about yesterday’s White House meeting.",
    "link": "https://www.newyorker.com/newsletter/the-daily/theres-no-easy-end-to-the-war-in-ukraine",
    "timestamp": "2025-08-19T22:00:00Z"
  },
  {
    "title": "Financial Trade Associations Call for Changes in BCBS Crypto Standards",
    "description": "Several global financial trade associations are calling on the Basel Committee on Banking Supervision (BCBS) to reconsider the Crypto Asset Exposure Standard (SCO60) before its January 2026 effective date. [contact-form-7] The associations said in a Tuesday (…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/financial-trade-associations-call-changes-bcbs-crypto-standards/",
    "timestamp": "2025-08-19T21:59:26Z"
  },
  {
    "title": "Don't buy claims Trump runs a White House MAGA gift shop",
    "description": "Trump showed off a collection of hats and other merchandise to Ukrainian President Volodymyr Zelenskyy and French President Emmanuel Macron.",
    "link": "https://www.snopes.com//news/2025/08/19/trump-maga-gift-shop/",
    "timestamp": "2025-08-19T21:59:00Z"
  },
  {
    "title": "Trump, European Leaders Agree Ukraine Must Have Security Guarantees. What Could Those Include?",
    "description": "President Donald Trump, Ukrainian President Volodymyr Zelenskyy, and other European leaders agree: Ukraine must have security protections in any Ukraine-Russia peace deal.   During the... Read More\nThe post Trump, European Leaders Agree Ukraine Must Have Secu…",
    "link": "https://www.dailysignal.com/2025/08/19/trump-european-leaders-agree-ukraine-must-have-security-guarantees-what-could-those-include/",
    "timestamp": "2025-08-19T21:58:55Z"
  },
  {
    "title": "Colorado urges Supreme Court to uphold state’s ban on conversion therapy for minors",
    "description": "Colorado is one of 25 states with laws banning conversion therapy on minors.",
    "link": "https://www.denverpost.com/2025/08/19/conversion-therapy-ban-supreme-court/",
    "timestamp": "2025-08-19T21:58:30Z"
  },
  {
    "title": "Alaska man gifted $22,000 motorcycle by Russian government after viral interview",
    "description": "An Alaska man might have walked away as the biggest winner of last week’s high stakes summit between U.S. President Donald Trump and Russian President Vladimir Putin in Anchorage",
    "link": "https://abcnews.go.com/Politics/wireStory/alaska-man-gifted-22000-motorcycle-russian-government-after-124793317",
    "timestamp": "2025-08-19T21:58:29Z"
  },
  {
    "title": "Trump’s federal law-enforcement crackdown ripples through DC neighborhoods",
    "description": "The Republican president declared a crisis in the Democratic-controlled city, despite declining crime statistics, and took control of the police department for 30 days.",
    "link": "https://www.pbs.org/newshour/politics/trumps-federal-law-enforcement-crackdown-ripples-through-dc-neighborhoods",
    "timestamp": "2025-08-19T21:58:22Z"
  },
  {
    "title": "Security clearance revoked for dozens of current and former US officials",
    "description": "Some had been critical of Trump, while others were involved in investigating Russian meddling in 2020 US elections.",
    "link": "https://www.aljazeera.com/news/2025/8/19/security-clearance-revoked-for-dozens-of-current-and-former-us-officials",
    "timestamp": "2025-08-19T21:58:05Z"
  },
  {
    "title": "Russia gives Alaska man $22,000 motorcycle after viral interview",
    "description": "All the Russians asked in return was to take his picture and interview him.",
    "link": "https://abcnews.go.com/US/wireStory/alaska-man-gifted-22000-motorcycle-russian-government-after-124793316",
    "timestamp": "2025-08-19T21:57:55Z"
  },
  {
    "title": "Con-man Cuomo pretends Trump will come to his rescue",
    "description": "Donald Trump, he explained, is going to order New York City Republican voters — who always do what they’re told, after all — to forget about Curtis Sliwa, forget about Eric Adams and vote instead for the beloved “Luv Guv.”",
    "link": "https://nypost.com/2025/08/19/opinion/donald-trump-is-not-going-to-rescue-andrew-cuomo/",
    "timestamp": "2025-08-19T21:47:07Z"
  },
  {
    "title": "Mexico’s President Claudia Sheinbaum denies knowledge of US drug initiative",
    "description": "Sheinbaum's remarks come in response to the US unveiling a 'bold bilateral initiative' to combat drug trafficking.",
    "link": "https://www.aljazeera.com/news/2025/8/19/mexicos-president-claudia-sheinbaum-denies-knowledge-of-us-drug-initiative",
    "timestamp": "2025-08-19T21:46:38Z"
  },
  {
    "title": "Exclusive: Derek Dooley talks about run for Senate: ‘We need some Georgia common sense’",
    "description": "The one-time head coach said he became interested in running for office after seeing the federal response to COVID-19.",
    "link": "https://www.wsbtv.com/news/local/atlanta/exclusive-derek-dooley-talks-about-run-senate-we-need-some-georgia-common-sense/JBW7TKBQAVHYLOTMSHUIACBNQU/",
    "timestamp": "2025-08-19T21:46:29Z"
  },
  {
    "title": "FACT FOCUS: Trump says he has ended seven wars. That’s not accurate",
    "description": "President Donald Trump has projected himself as a peacemaker since returning to the White House .",
    "link": "https://www.bostonherald.com/2025/08/19/fact-check-trump-wars/",
    "timestamp": "2025-08-19T21:45:20Z"
  },
  {
    "title": "Exclusive-White House launches official TikTok account",
    "description": "WASHINGTON :The White House launched an official TikTok account on Tuesday, taking advantage of its more than 150 million U.S. users to spread the gospel of Donald Trump.Trump has a soft spot for the popular app, crediting it with helping him gain support amo…",
    "link": "https://www.channelnewsasia.com/business/exclusive-white-house-launches-official-tiktok-account-5303471",
    "timestamp": "2025-08-19T21:44:08Z"
  },
  {
    "title": "Wall Street mostly declines as tech names pull back from highs",
    "description": "The Dow Jones Industrial Average rises 10.5 points to 44,922.27. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/wall-street-mostly-declines-as-tech-names-pull-back-from-highs",
    "timestamp": "2025-08-19T21:43:58Z"
  },
  {
    "title": "National Guard troops from six red states head to DC to help tackle crime",
    "description": "Six states send National Guard troops to Washington as Trump deploys soldiers to combat crime, and federalizes Metropolitan Police Department.",
    "link": "https://www.foxnews.com/politics/national-guard-troops-from-six-red-states-head-dc-help-tackle-crime",
    "timestamp": "2025-08-19T21:43:43Z"
  },
  {
    "title": "National Guard Troops From Four States Begin Arriving In D.C.",
    "description": "National Guard members from West Virginia, South Carolina, Mississippi and Louisiana have begun arriving in Washington.",
    "link": "https://www.huffpost.com/entry/national-guard-arriving-federal-intervention-dc_n_68a4ef47e4b0153547aef193",
    "timestamp": "2025-08-19T21:42:39Z"
  },
  {
    "title": "Venezuela Says 66 Children 'Kidnapped' By The United States",
    "description": "The Venezuelan government on Tuesday claimed that 66 Venezuelan children are being illegally held in the United States after being separated from their parents during deportation, as the White House cracks down on immigration.",
    "link": "https://www.ibtimes.com/venezuela-says-66-children-kidnapped-united-states-3781222",
    "timestamp": "2025-08-19T21:42:06Z"
  },
  {
    "title": "Can Trump really ban mail-in voting?",
    "description": "Trump, who has said that \"mail-in ballots are corrupt\" and susceptible to voter fraud, now wants to lead a movement to get rid of it.",
    "link": "https://www.bbc.com/news/articles/crev0n5vlp0o",
    "timestamp": "2025-08-19T21:40:59Z"
  },
  {
    "title": "Trump’s narrow road to Ukraine peace has three milestones for success — or failure",
    "description": "America holds powerful cards. President Trump should play them to halt the fighting, resist Putin's land demands and — most important — bring Ukraine's stolen children home.",
    "link": "https://nypost.com/2025/08/19/opinion/trumps-road-to-ukraine-peace-has-three-milestones-for-success/",
    "timestamp": "2025-08-19T21:40:23Z"
  },
  {
    "title": "Live: ASX to recover as tech slump drags Wall Street lower",
    "description": "The Australian share market is likely to edge higher despite a sell-off across Nvidia and other US tech stocks overnight, while the Reserve Bank of New Zealand is expected to deliver another interest rate cut. Follow live.",
    "link": "https://www.abc.net.au/news/2025-08-20/asx-markets-business-live-news/105674804",
    "timestamp": "2025-08-19T21:40:06Z"
  },
  {
    "title": "Texas State Rep Says Assigned Police Escort 'Made A Scene' And Threatened To Arrest Her",
    "description": "Texas Republicans forced Democrats to sign a slip authorizing a police officer to surveil them until Wednesday, when the House is scheduled to reconvene.",
    "link": "https://www.huffpost.com/entry/texas-state-rep-assigned-dps-escort-threatened-arrest_n_68a4c40ce4b028ce775468d5?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-19T21:39:46Z"
  },
  {
    "title": "Texas State Rep Says Assigned Police Escort 'Made A Scene' And Threatened To Arrest Her",
    "description": "Texas Republicans forced Democrats to sign a slip authorizing a police officer to surveil them until Wednesday, when the House is scheduled to reconvene.",
    "link": "https://www.huffpost.com/entry/texas-state-rep-assigned-dps-escort-threatened-arrest_n_68a4c40ce4b028ce775468d5",
    "timestamp": "2025-08-19T21:39:46Z"
  },
  {
    "title": "Venezuela says 66 children ‘kidnapped’ by the United States",
    "description": "The Venezuelan government on Tuesday claimed that 66 Venezuelan children are being illegally held in the United States after being separated from their parents during deportation, as the White House cracks down on immigration. Caracas is demanding the childre…",
    "link": "https://www.digitaljournal.com/world/venezuela-says-66-children-kidnapped-by-the-united-states/article",
    "timestamp": "2025-08-19T21:38:24Z"
  },
  {
    "title": "Just When You Thought Andrew Cuomo’s Campaign Couldn’t Get Any Sadder…",
    "description": "Andrew Cuomo is reportedly hoping Trump can help boost his chances to defeat Zohran Mamdani, while using memes from one of the president's supporters.",
    "link": "http://www.rollingstone.com/politics/politics-news/andrew-cuomo-campaign-memes-trump-supporter-1235411555/",
    "timestamp": "2025-08-19T21:37:56Z"
  },
  {
    "title": "Adam Schiff Sets Up Legal Defense Fund Amid DOJ Probe Into Finances",
    "description": "Democratic California Sen. Adam Schiff has created a new legal defense fund amid a Department of Justice (DOJ) probe into his finances over alleged mortgage fraud. Schiff, a longtime adversary of President Donald Trump, could be staring down a protracted lega…",
    "link": "https://dailycaller.com/2025/08/19/schiff-legal-defense-fund-doj-probe/",
    "timestamp": "2025-08-19T21:37:34Z"
  },
  {
    "title": "'Cornhusker Clink' Becomes Latest Trump Immigration Detention Center",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNebraska Gov. Jim Pillen, a Republican, announced Tuesday that an immigration detention center will be established in the state's southwest farming region as President Donald Trump's administration accelerates…",
    "link": "https://biztoc.com/x/d3f2c5387e2bab4f",
    "timestamp": "2025-08-19T21:37:08Z"
  },
  {
    "title": "Questions For The Fed",
    "description": "Glenn Hubbard, Project Syndicate | August 18, 2025\nAlthough Donald Trump is wrong to impugn the US Federal Reserve chair's motives, the central bank has made some serious mistakes. To avoid repeating them, the next chair will have to confront fundamental ques…",
    "link": "https://biztoc.com/x/2e4ce80f708c03d8",
    "timestamp": "2025-08-19T21:36:57Z"
  },
  {
    "title": "Questions For The Fed",
    "description": "Glenn Hubbard, Project Syndicate | August 18, 2025\nAlthough Donald Trump is wrong to impugn the US Federal Reserve chair's motives, the central bank has made some serious mistakes. To avoid repeating them, the next chair will have to confront fundamental ques…",
    "link": "https://biztoc.com/x/2e4ce80f708c03d8",
    "timestamp": "2025-08-19T21:36:57Z"
  },
  {
    "title": "Trump Slams Smithsonian for Harping on How ‘How Bad Slavery Was’",
    "description": "President Donald Trump slammed the Smithsonian as \"WOKE\" and \"OUT OF CONTROL\" for harping on \"how bad Slavery was.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-slams-smithsonian-slavery-1235411589/",
    "timestamp": "2025-08-19T21:33:57Z"
  },
  {
    "title": "'Cornhusker Clink' Becomes Latest Trump Immigration Detention Center",
    "description": "Some of the new centers have already drawn lawsuits and community backlash over conditions, environmental compliance and transparency.",
    "link": "https://www.newsweek.com/trump-nebraska-immigration-detention-center-noem-pillen-2115990",
    "timestamp": "2025-08-19T21:32:15Z"
  },
  {
    "title": "10 Questions You Should Be Able To Answer In Order To Vote",
    "description": "With President Donald Trump making election reform a priority, cleaning up the process and determining qualifications for voting are important. Who should vote, and how can it be determined?",
    "link": "https://babylonbee.com/news/10-questions-you-should-be-able-to-answer-in-order-to-vote",
    "timestamp": "2025-08-19T21:32:03Z"
  },
  {
    "title": "Zelensky's Red Line for Putin Peace Talks",
    "description": "Analysts weighed in on what concessions Zelensky may consider making to end the war and what's likely to be off the table.",
    "link": "https://www.newsweek.com/zelensky-concessions-red-line-peace-talks-2115963",
    "timestamp": "2025-08-19T21:31:11Z"
  },
  {
    "title": "Gabbard removes clearances from 37 officials at Trump's direction over politicizing intelligence",
    "description": "Director of National Intelligence Tulsi Gabbard revokes clearances for former CIA, NSA and State Department officials accused of manipulating intelligence assessments.",
    "link": "https://www.foxnews.com/politics/gabbard-removes-clearances-from-37-officials-trumps-direction-over-politicizing-intelligence",
    "timestamp": "2025-08-19T21:28:02Z"
  },
  {
    "title": "Trump Blurts Out Unnerving New Plot to Rig Midterms",
    "description": "Greg Sargent: “President Donald Trump raged at Democrats Monday for supposedly cheating in elections in a long and unhinged Truth Social rant—and buried in his tirade is a clear indication of how he hopes to",
    "link": "https://politicalwire.com/2025/08/19/trump-blurts-out-unnerving-new-plot-to-rig-midterms/",
    "timestamp": "2025-08-19T21:27:19Z"
  },
  {
    "title": "Some Texas Democrats to rip up agreements to leave House floor under police escort and return to chamber in protest",
    "description": "Several Texas state House Democrats ripped up the written agreements that allowed them to leave the chamber with a police escort and returned to the House floor Tuesday night, the caucus announced.",
    "link": "https://www.cnn.com/2025/08/19/politics/texas-democrats-protest",
    "timestamp": "2025-08-19T21:26:48Z"
  },
  {
    "title": "Josh Hawley is ruffling GOP feathers as he stakes out his ground: From the Politics Desk",
    "description": "In today’s edition, we have a deep dive into Sen. Josh Hawley’s effort to stake out ground for himself in the modern Republican Party.",
    "link": "https://www.nbcnews.com/politics/politics-news/josh-hawley-ruffling-gop-feathers-politics-desk-rcna225923",
    "timestamp": "2025-08-19T21:26:37Z"
  },
  {
    "title": "Minnesota sues TikTok, alleging it preys on young people with addictive algorithms",
    "description": "Many of the earlier lawsuits stemmed from a nationwide investigation into TikTok launched in 2022.",
    "link": "https://www.bostonherald.com/2025/08/19/tiktok-states-minnesota/",
    "timestamp": "2025-08-19T21:26:33Z"
  },
  {
    "title": "After Tension With Washington, Intel Is Suddenly a Hot Asset",
    "description": "SoftBank is investing $2 billion in Intel, giving it a 2 percent stake.",
    "link": "https://observer.com/2025/08/softbank-invests-in-intel/",
    "timestamp": "2025-08-19T21:25:59Z"
  },
  {
    "title": "Trump: I won't send US troops to Ukraine - but might help by air",
    "description": "The US president is \"willing to help\" Ukraine's European allies enforce a hoped-for peace deal to end the three-year conflict, \"probably, … by air\". It comes as possible venues are drawn up for a meeting between Volodymyr Zelenskyy and Vladimir Putin.",
    "link": "https://news.sky.com/story/trump-i-wont-send-us-troops-to-ukraine-but-might-help-by-air-13414934",
    "timestamp": "2025-08-19T21:24:00Z"
  },
  {
    "title": "UK ‘agreed to drop’ backdoor encryption demand for Apple, DNI says",
    "description": "Director of National Intelligence Tulsi Gabbard said the United Kingdom has abandoned its effort to require that Apple provide its law enforcement and intelligence personnel with “blanket capability” to access customers’ encrypted files.",
    "link": "https://www.nextgov.com/cybersecurity/2025/08/uk-agreed-drop-backdoor-encryption-demand-apple-dni-says/407556/",
    "timestamp": "2025-08-19T21:24:00Z"
  },
  {
    "title": "UK drops demand for access to Apple user data",
    "description": "Britain has dropped its request for access to Apple users' encrypted data, which had created friction between London and Washington, U.S. intelligence chief Tulsi Gabbard said Tuesday. The UK government wanted the tech giant to create a &quot;back door&quot; …",
    "link": "https://japantoday.com/category/tech/uk-drops-demand-for-access-to-apple-user-data",
    "timestamp": "2025-08-19T21:23:11Z"
  },
  {
    "title": "Trump administration vying to own big stake in Intel after SoftBank's $2 billion bet on company",
    "description": "U.S. Commerce Secretary Howard Lutnick on Tuesday confirmed the U.S. government is vying for a 10% stake in Silicon Valley pioneer Intel in an unusual deal that would deepen the Trump administration’s financial ties with major computer chip manufacturers and …",
    "link": "https://japantoday.com/category/tech/trump-administration-vying-to-own-big-stake-in-intel-after-softbank%27s-2-billion-bet-on-company",
    "timestamp": "2025-08-19T21:22:43Z"
  },
  {
    "title": "Mexican boxer Chavez Jr deported from U.S. over alleged cartel ties",
    "description": "Former champion boxer Julio Cesar Chavez Jr has been detained in Mexico after deportation by the United States to face drug cartel-related charges, Mexican authorities said Tuesday. Chavez, the son of legendary fighter Julio Cesar Chavez, was handed over at m…",
    "link": "https://japantoday.com/category/sports/mexican-boxer-chavez-jr.-deported-from-us-over-alleged-cartel-ties",
    "timestamp": "2025-08-19T21:21:05Z"
  },
  {
    "title": "U.S. destroyers head toward waters off Venezuela as Trump aims to pressure drug cartels",
    "description": "The United States is deploying three Aegis guided-missile destroyers to the waters off Venezuela as part of President Donald Trump's effort to combat threats from Latin American drug cartels, according to a U.S. official briefed on the planning. The USS Grave…",
    "link": "https://japantoday.com/category/world/us-destroyers-head-toward-waters-off-venezuela-as-trump-aims-to-pressure-drug-cartels",
    "timestamp": "2025-08-19T21:20:01Z"
  },
  {
    "title": "Trump says no ground troops, but maybe air support, to back Ukraine peace deal",
    "description": "U.S. President Donald Trump said on Tuesday the United States would not put troops on the ground in Ukraine but might provide air support as part of a deal to end Russia's war in the country. A day after Trump pledged security guarantees to help end the war a…",
    "link": "https://japantoday.com/category/world/trump-says-no-ground-troops-but-maybe-air-support-to-back-ukraine-peace-deal",
    "timestamp": "2025-08-19T21:19:46Z"
  },
  {
    "title": "EEOC data requests to law firms were not mandatory, agency says in court filing",
    "description": "A letter to 20 BigLaw firms seeking detailed information about diversity-program applicants and other attorney job seekers constituted “informal information gathering” rather than a mandatory demand, according to a court filing by the Equal Employment Opportu…",
    "link": "https://www.abajournal.com/news/article/law-firms-didnt-have-to-respond-to-eeoc-data-requests-and-any-damage-to-law-student-plaintiffs-is-their-fault-eeoc-says",
    "timestamp": "2025-08-19T21:18:00Z"
  },
  {
    "title": "Trump administration vying to own a big stake in Intel after SoftBank’s $2 billion bet on company",
    "description": "The ambitions that Lutnick confirmed in a televised interview with CNBC came the day after various news outlets reported on the negotiations between the Trump administration and Intel.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-vying-to-own-a-big-stake-in-intel-after-softbanks-2-billion-bet-on-company",
    "timestamp": "2025-08-19T21:16:46Z"
  },
  {
    "title": "Illegal Migrant Truck Driver Accused Of Killing Three On Highway Failed English, Traffic Sign Tests",
    "description": "The illegal migrant truck driver accused of killing three in a highway accident failed an English proficiency and traffic sign tests given by investigators.",
    "link": "https://dailycaller.com/2025/08/19/illegal-migrant-truck-driver-fails-english/",
    "timestamp": "2025-08-19T21:16:41Z"
  },
  {
    "title": "Trump escalates attacks against Smithsonian museums, says there's too much focus on 'how bad slavery was' (CNN)",
    "description": "CNN:\nTrump escalates attacks against Smithsonian museums, says there's too much focus on ‘how bad slavery was’  —  President Donald Trump escalated his campaign to purge cultural institutions of materials that conflict with his political directives on Tuesday…",
    "link": "https://www.memeorandum.com/250819/p110",
    "timestamp": "2025-08-19T21:15:01Z"
  },
  {
    "title": "Trump’s Wacko Team of Attorneys Will Try to Prove D.C. Officials Faked Crime Data",
    "description": "The president desperately wants to justify the National Guard’s occupation of Washington.",
    "link": "https://www.esquire.com/news-politics/politics/a65823368/washington-dc-police-investigation-trump/",
    "timestamp": "2025-08-19T21:15:00Z"
  },
  {
    "title": "Despite flurry of meetings on Russia's war in Ukraine, major obstacles to peace remain",
    "description": "The second Oval Office meeting in six months between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy went off smoothly Monday, in sharp contrast to their disastrous encounter in February. European leaders joined the discussions in a sh…",
    "link": "https://japantoday.com/category/features/opinions/despite-a-flurry-of-meetings-on-russia%27s-war-in-ukraine-major-obstacles-to-peace-remain",
    "timestamp": "2025-08-19T21:14:35Z"
  },
  {
    "title": "Trump sees Ukraine peace deal as road to heaven",
    "description": "The US president has said that he wants the fighting to stop to save the lives of both Russians and Ukrainians Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623295-trump-ukraine-conflict-heaven/",
    "timestamp": "2025-08-19T21:14:35Z"
  },
  {
    "title": "GOP senator says Obama could be charged — and Trump's immunity ruling doesn't count",
    "description": "President Donald Trump and his administration officials have repeatedly suggested, with no basis, that former President Barack Obama committed a crime in pursuing an investigation of Russian interference into the 2016 presidential election — but even Trump ha…",
    "link": "https://www.rawstory.com/eric-schmitt-2673901702/",
    "timestamp": "2025-08-19T21:13:02Z"
  },
  {
    "title": "HUD chief moves to make English the sole language for all agency business following Trump order",
    "description": "The Department of Housing and Urban Development will shift to an English-only policy after President Trump designated English as the United States' official language.",
    "link": "https://www.foxnews.com/politics/hud-chief-moves-make-english-sole-language-all-agency-business-trump-order",
    "timestamp": "2025-08-19T21:12:56Z"
  },
  {
    "title": "Trump administration vying to own a big stake in Intel after SoftBank’s $2 billion bet on company",
    "description": "The talks come on the heels of a $2 billion investment that SoftBank Group announced.",
    "link": "https://www.bostonherald.com/2025/08/19/intel-softbank-trump-administration/",
    "timestamp": "2025-08-19T21:12:01Z"
  },
  {
    "title": "White House sees ‘light at end of tunnel’ on Ukraine",
    "description": "The conflict has an “opportunity for lasting peace,” according to press secretary Karoline Leavitt Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623296-white-house-sees-light-ukraine-conflict/",
    "timestamp": "2025-08-19T21:11:02Z"
  },
  {
    "title": "California Republicans sue to stop Newsom, Democrats from pushing redistricting plan",
    "description": "California Republicans sue to stop Democrat redistricting push as Texas GOP advances similar map changes in high-stakes congressional battle ahead of midterms.",
    "link": "https://www.foxnews.com/politics/california-republicans-file-lawsuit-stop-newsom-democrats-from-pushing-redistricting-plan",
    "timestamp": "2025-08-19T21:10:10Z"
  }
]