[
  {
    "title": "Trump set to ease tariff impact on US carmakers",
    "description": "Trump is due to hold a rally in Michigan, which is home to Ford, General Motors and Stellantis.",
    "link": "https://www.bbc.com/news/articles/c70zy5w983go",
    "timestamp": "2025-04-29T03:27:11Z"
  },
  {
    "title": "Canada: Liberals Projected Winners, Mark Carney Retains Leadership",
    "description": "The Canadian Broadcasting Corporation (CBC) has called the election in Canada for the Liberal Party, with Prime Minister Mark Carney expected to retain leadership.\nThe post Canada: Liberals Projected Winners, Mark Carney Retains Leadership appeared first on B…",
    "link": "https://www.breitbart.com/politics/2025/04/28/canada-liberals-projected-winners-mark-carney-retains-leadership/",
    "timestamp": "2025-04-29T03:22:47Z"
  },
  {
    "title": "We’re Cooked: Jennifer Lopez Says Her Love 'Will Now Be Costing a Thing' Due to Inflation",
    "description": "With global recession fears growing, Jenny from the Block has spoken.",
    "link": "https://www.complex.com/music/a/alex-ocho/jennifer-lopez-says-love-will-now-cost-a-thing-due-to-inflation",
    "timestamp": "2025-04-29T03:22:12Z"
  },
  {
    "title": "Big Tech’s earnings problem is estimates may be way too high",
    "description": "There’s little expectation executives will be able to give estimates with any degree of confidence, given the high level of macroeconomic uncertainty.",
    "link": "https://www.japantimes.co.jp/business/2025/04/29/tech/big-tech-earnings-estimates/",
    "timestamp": "2025-04-29T03:22:00Z"
  },
  {
    "title": "US fighter 'lost' after falling off aircraft carrier in the Red Sea, Navy says",
    "description": "The F/A-18E Super Hornet fell off the USS Harry S. Truman as sailors were towing the aircraft into the hangar bay, according to the Navy.",
    "link": "https://www.usatoday.com/story/news/nation/2025/04/28/navy-fighter-jet-red-sea/83333990007/",
    "timestamp": "2025-04-29T03:21:19Z"
  },
  {
    "title": "Canadian Prime Minister Mark Carney’s Liberals win an election upended by Trump",
    "description": "Prime Minister Mark Carney’s Liberal Party won Canada’s federal election on Monday, capping a stunning turnaround in fortunes fueled by Donald Trump’s annexation threats and trade war.",
    "link": "https://nypost.com/2025/04/28/world-news/canadian-prime-minister-mark-carneys-liberals-win-an-election-upended-by-trump/",
    "timestamp": "2025-04-29T03:20:52Z"
  },
  {
    "title": "In stunning comeback, Mark Carney’s Liberals win Canada’s federal election",
    "description": "OTTAWA — Prime Minister Mark Carney’s Liberals won a federal election Monday, the country’s public broadcaster, the CBC, projected, an extraordinary comeback that was fueled in part by President Donald Trump’s tariff policies and attacks on Canada. Just month…",
    "link": "https://freerepublic.com/focus/f-news/4313906/posts",
    "timestamp": "2025-04-29T03:19:06Z"
  },
  {
    "title": "Anti-Trump Liberals projected to win elections in Canada",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616466-canada-liberals-win-elections/",
    "timestamp": "2025-04-29T03:18:40Z"
  },
  {
    "title": "Morton Klein: You don’t make deals with Iran — you destroy their facilities",
    "description": "In an interview with Arutz Sheva-Israel National News, ZOA President Morton Klein warns that Iran will violate any nuclear deal, urging military action instead. He criticizes efforts to achieve peace through negotiation, citing historical failures, and stress…",
    "link": "https://www.israelnationalnews.com/news/407554",
    "timestamp": "2025-04-29T03:18:06Z"
  },
  {
    "title": "US Congressman Introduces Resolution to Impeach President Trump",
    "description": "Shri Thanedar (D-Michigan) accuse Trump of obstruction of justice, abuse of trade powers and international aggression.",
    "link": "https://sputnikglobe.com/20250429/us-congressman-introduces-resolution-to-impeach-president-trump-1121950422.html",
    "timestamp": "2025-04-29T03:18:00Z"
  },
  {
    "title": "Why Trump's economic disruption will be hard to reverse",
    "description": "In his first 100 days, Donald Trump began dismantling the global economic order through trade wars, treaty withdrawals, and weakened alliances. While his presidency is temporary, experts warn some changes—like eroded trust and empowered rivals like China—may …",
    "link": "https://economictimes.indiatimes.com/tech/technology/why-trumps-economic-disruption-will-be-hard-to-reverse/articleshow/120714759.cms",
    "timestamp": "2025-04-29T03:17:00Z"
  },
  {
    "title": "Carney's Liberals win Canada election, will form minority government, CTV says",
    "description": "OTTAWA: Canadian Prime Minister Mark Carney's Liberals retained power in the country's election on Monday (Apr 28), but CTV News predicted they would fall short of the majority government he had wante",
    "link": "https://www.channelnewsasia.com/world/canada-carney-liberals-win-election-majority-government-5096126",
    "timestamp": "2025-04-29T03:13:53Z"
  },
  {
    "title": "Canadian Dollar Edges Higher as Carney’s Liberals Win Election",
    "description": "Canada’s dollar rose against the greenback as Mark Carney was projected to win in the election, keeping the former central banker in the Prime Minister role and his Liberal Party in power.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-dollar-edges-higher-as-carneys-liberals-win-election",
    "timestamp": "2025-04-29T03:12:22Z"
  },
  {
    "title": "Trump wants NFL to keep the tush-push — but hates the new kick-off rule",
    "description": "President Donald Trump made a key endorsement on Monday at the White House, though it had nothing to do with a piece of legislation or a political campaign.",
    "link": "https://nypost.com/2025/04/28/sports/trump-wants-nfl-to-keep-eagles-tush-push-but-hates-new-kick-off-rule/",
    "timestamp": "2025-04-29T03:11:00Z"
  },
  {
    "title": "Carney's Liberals win Canada election, will form minority government, CTV says",
    "description": "The Liberals are predicted to fall short of the majority governement they want to help negotiate US tariffs.",
    "link": "https://www.jpost.com/breaking-news/article-851902",
    "timestamp": "2025-04-29T03:09:56Z"
  },
  {
    "title": "Prime Minister Mark Carney wins Canada following fresh Trump threats",
    "description": "Canada’s Liberal Party party has fought off the Conservative Party to win the nation’s federal poll.",
    "link": "https://7news.com.au/news/prime-minister-mark-carney-wins-canada-following-fresh-trump-threats-c-18521828",
    "timestamp": "2025-04-29T03:09:56Z"
  },
  {
    "title": "Piers Morgan Tells Dem Candidate He Would Take Her ‘A Lot More Seriously’ If She Acknowledged Recent Trump Success",
    "description": "Piers Morgan ripped into Dem candidate Kat Abughazaleh, stating he would be able to take her \"a lot more seriously\" if she would acknowledge Trump's successes.",
    "link": "https://dailycaller.com/2025/04/28/piers-morgan-demmocrat-candidate-donald-trump-success-border-crisis/",
    "timestamp": "2025-04-29T03:09:35Z"
  },
  {
    "title": "Another federal judge expresses skepticism over Trump law firm executive orders",
    "description": "Another federal judge in Washington has expressed skepticism about the legality of a Trump administration executive order targeting a prominent law firm, saying he was concerned that the clear purpose of the edict was punishment. U.S. District Judge John Bate…",
    "link": "https://japantoday.com/category/world/another-federal-judge-expresses-skepticism-over-trump-law-firm-executive-orders",
    "timestamp": "2025-04-29T03:08:30Z"
  },
  {
    "title": "Carney's Liberals win Canada election; unclear if they have majority, CTV and CBC say",
    "description": "Canadian Prime Minister Mark Carney's Liberals retained power in the country's election on Monday, but it is too soon to say whether they will form a majority government, CTV News and the Canadian Broadcasting Corp predicted. Carney had asked for a strong man…",
    "link": "https://japantoday.com/category/world/carney%27s-liberals-win-canada-election-unclear-if-they-have-majority-ctv-and-cbc-say",
    "timestamp": "2025-04-29T03:07:27Z"
  },
  {
    "title": "Venezuelan president slams US over little girl’s ‘abduction’",
    "description": "Venezuela’s president Nicolas Maduro accused Washington Monday of committing a crime in the case of a two-year-old girl separated from her migrant parents, who were deported from the United States without her. The US Department of Homeland Security (DHS) has …",
    "link": "https://www.digitaljournal.com/world/venezuelan-president-slams-us-over-little-girls-abduction/article",
    "timestamp": "2025-04-29T03:07:20Z"
  },
  {
    "title": "Inside the Vietnamese factory preparing for the worst since Trump's tariff threat",
    "description": "On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks.",
    "link": "https://news.sky.com/story/inside-the-vietnamese-factory-preparing-for-the-worst-since-trumps-tariff-threat-13357895",
    "timestamp": "2025-04-29T03:07:00Z"
  },
  {
    "title": "Venezuelan President Slams US Over Little Girl's 'Abduction'",
    "description": "Venezuela's president Nicolas Maduro accused Washington Monday of committing a crime in the case of a two-year-old girl separated from her migrant parents, who were deported from the United States without her.",
    "link": "https://www.ibtimes.com/venezuelan-president-slams-us-over-little-girls-abduction-3771722",
    "timestamp": "2025-04-29T03:06:12Z"
  },
  {
    "title": "Donald Trump takes advantage of the Philadelphia Eagles' visit to the White House to mock Taylor Swift once again",
    "description": "Following the Kansas City Chiefs&apos; 22-40 loss to the Philadelphia Eagles, President Donald Trump took the opportunity to lash out at Taylor Swift, recalling her endorsement of",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/04/29/6810348dca474173238b4587.html",
    "timestamp": "2025-04-29T03:04:42Z"
  },
  {
    "title": "Asian Stocks Rise, Futures Gain on Tariff Reprieve: Markets Wrap",
    "description": "Asian stocks advanced and US equity futures gained on expectations President Donald Trump is on track to ease the impact of his auto tariffs, boosting hopes for further dialing down of trade tensions.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-rise-futures-gain-on-tariff-reprieve-markets-wrap",
    "timestamp": "2025-04-29T03:02:11Z"
  },
  {
    "title": "Confidence in NATO security guarantees plunges in Finland: Survey",
    "description": "A recent survey reveals a significant decline in Finns' confidence in NATO's security guarantees following Donald Trump's return as US president. Only 32% now believe NATO's guarantees are a robust deterrent, a sharp drop from autumn 2023. While a majority st…",
    "link": "https://economictimes.indiatimes.com/news/defence/confidence-in-nato-security-guarantees-plunges-in-finland-survey/articleshow/120714381.cms",
    "timestamp": "2025-04-29T03:01:43Z"
  },
  {
    "title": "KKR-backed InCred is said to be in talks with advisers on Rs 4,000 crore IPO",
    "description": "InCred Financial Services, an Indian lending firm, is preparing for an initial public offering. The company aims to raise approximately 40 billion rupees. Discussions are underway with advisers like IIFL Securities and Kotak Mahindra Bank. The IPO could happe…",
    "link": "https://economictimes.indiatimes.com/markets/ipos/fpos/kkr-backed-incred-is-said-to-be-in-talks-with-advisers-on-rs-4000-crore-ipo/articleshow/120714358.cms",
    "timestamp": "2025-04-29T03:00:57Z"
  },
  {
    "title": "Trump Administration: Penn Violated Title IX With Trans Swimmer",
    "description": "The Trump administration said Monday that the University of Pennsylvania violated laws guaranteeing women equal opportunities in athletics by letting a transgender swimmer compete on the school's women's team and into team facilities. The administration's sta…",
    "link": "https://freerepublic.com/focus/f-news/4313901/posts",
    "timestamp": "2025-04-29T03:00:34Z"
  },
  {
    "title": "A Trip To Tim Hortons With Prime Minister Mark Carney",
    "description": "Canadian Conservative Leader Pierre Pollievre did not agree to an interview with the satirical show 22 Minutes and wants to do away with the publicly-funded CBC. He probably did not care for this interview with Carney either.\nCarney's Liberals are expected to…",
    "link": "https://crooksandliars.com/2025/04/trip-tim-hortons-prime-minister-mark",
    "timestamp": "2025-04-29T03:00:01Z"
  },
  {
    "title": "Israel carrying out ‘live-streamed genocide’ in Gaza, Amnesty says",
    "description": "Amnesty also says US President Donald Trump is responsible for 'multiplicity of assaults' on human rights.",
    "link": "https://www.aljazeera.com/news/2025/4/29/israel-carrying-out-live-streamed-genocide-in-gaza-amnesty-says",
    "timestamp": "2025-04-29T02:59:30Z"
  },
  {
    "title": "Special Report: Election Night In Canada The Trump Election Liberals Capture Left-Wing Votes To Win",
    "description": "The numbers at 1045 pm Eastern Time the Liberals leading-elected 158, the Conservatives 130, the Bloc Quebecois 24, the NDP 9. Liberal Party leader Mark Carney declared elected in his riding of Nepean a seat in the Ottawa area. The central banker turned polit…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313899/posts",
    "timestamp": "2025-04-29T02:58:16Z"
  },
  {
    "title": "How Mark Carney led Liberal Party towards potential victory despite Justin Trudeau's waning popularity before polls",
    "description": "Mark Carney's Liberal Party secured victory in Canada's federal election. This win marks a turnaround fueled by Donald Trump's actions. The Liberals are projected to win more seats than the Conservatives. Justin Trudeau's resignation and Carney's leadership w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-mark-carney-led-liberal-party-towards-potential-victory-despite-justin-trudeaus-waning-popularity-before-polls/articleshow/120713517.cms",
    "timestamp": "2025-04-29T02:57:48Z"
  },
  {
    "title": "How the Philadelphia Eagles handled their visit to Donald Trump and the White House without Jalen Hurts",
    "description": "The Philadelphia Eagles finally got their long-awaited White House visit after their Super Bowl LIX victory over the Kansas City Chiefs. However, the event was marked by the notice",
    "link": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/04/29/681030d8268e3eb23a8b45b1.html",
    "timestamp": "2025-04-29T02:56:39Z"
  },
  {
    "title": "Japan worries Trump tariffs will push countries toward China",
    "description": "Many nations are looking to negotiate with the U.S. over the Trump administration’s reciprocal tariffs, which could undermine security in the region.",
    "link": "https://www.japantimes.co.jp/news/2025/04/29/japan/politics/japan-onodera-trump-tariffs/",
    "timestamp": "2025-04-29T02:56:00Z"
  },
  {
    "title": "'If you're a fascist, get a Tesla': Neil Young targets Elon Musk in new song (Aidin Vaziri/San Francisco Chronicle)",
    "description": "Aidin Vaziri / San Francisco Chronicle:\n'If you're a fascist, get a Tesla': Neil Young targets Elon Musk in new song  —  Neil Young debuted a politically charged new song at a benefit concert in Los Angeles over the weekend to deliver pointed criticism of Pre…",
    "link": "https://www.memeorandum.com/250428/p148",
    "timestamp": "2025-04-29T02:55:00Z"
  },
  {
    "title": "Trump to ease impact of tariffs on U.S. automakers, Lutnick says",
    "description": "President Donald Trump will soon announce moves to reduce the impact of his tariffs on the U.S. auto industry, a top Trump administration official confirmed late Monday.",
    "link": "https://biztoc.com/x/b4e6533dca535ced",
    "timestamp": "2025-04-29T02:52:56Z"
  },
  {
    "title": "Canadians keep Liberal Party and Mark Carney in power as country digs in on Trump’s trade war",
    "description": "President Donald Trump injected himself into the race with his tariffs on Canadian imports and repeatedly saying Canada should become the 51st U.S. state.",
    "link": "https://biztoc.com/x/72df6c70325109e4",
    "timestamp": "2025-04-29T02:52:38Z"
  },
  {
    "title": "Mark Carney’s Liberals win Canadian election upended by Trump, CBC projects",
    "description": "Prime Minister Mark Carney’s Liberal Party won Canada’s federal election on Monday, capping a stunning turnaround in fortunes fueled by U.S. President Donald Trump’s annexation threats and trade war.",
    "link": "https://biztoc.com/x/2d17da6421e2a2b4",
    "timestamp": "2025-04-29T02:52:33Z"
  },
  {
    "title": "US auto tariffs: Lutnick says ‘deal’ has been reached with automakers",
    "description": "Commerce Secretary Howard Lutnick appeared to confirm reporting on​ Monday that a deal has been reached with automakers to​ ease tariffs, in another potential policy reversal that could grant a major reprieve for a beleaguered industry.",
    "link": "https://www.cnn.com/2025/04/28/business/us-auto-tariffs-easing-deal-intl-hnk/index.html",
    "timestamp": "2025-04-29T02:51:59Z"
  },
  {
    "title": "Commentary: Coercion-first only makes America the world's super-bully",
    "description": "BEIJING, April 29 (Xinhua) -- In an era marked by pressing global challenges, the iconic adage",
    "link": "http://en.people.cn/n3/2025/0429/c90000-20309000.html",
    "timestamp": "2025-04-29T02:50:36Z"
  },
  {
    "title": "Trump's call for free U.S. passage through Suez Canal sparks outcry in Egypt",
    "description": "CAIRO, April 28 (Xinhua) -- U.S. President Donald Trump's recent call for free passage of American s",
    "link": "http://en.people.cn/n3/2025/0429/c90000-20308997.html",
    "timestamp": "2025-04-29T02:49:40Z"
  },
  {
    "title": "Apple to shift all US iPhone assembly to India by 2026 amid trade war with China",
    "description": "In a strategic move driven by escalating trade tensions between the United States and China, Apple is set to transition all production of iPhones destined for the US market to India. Apple is looking to move most of its manufacturing and production out of Chi…",
    "link": "https://freerepublic.com/focus/f-news/4313896/posts",
    "timestamp": "2025-04-29T02:49:17Z"
  },
  {
    "title": "Canadians keep Liberal Party and Mark Carney in power as country digs in on Trump's trade war (Phil Helsel/NBC News)",
    "description": "Phil Helsel / NBC News:\nCanadians keep Liberal Party and Mark Carney in power as country digs in on Trump's trade war  —  President Donald Trump injected himself into the race with his tariffs on Canadian imports and repeatedly saying Canada should become the…",
    "link": "https://www.memeorandum.com/250428/p146",
    "timestamp": "2025-04-29T02:45:03Z"
  },
  {
    "title": "‘Welcome to the Thunderdome’: Inside the dizzying start of Trump 2.0",
    "description": "The administration's breakneck speed is both one of the administration’s most effective tools and most glaring vulnerabilities.",
    "link": "https://www.japantimes.co.jp/news/2025/04/29/world/politics/thunderdome-100-days-trump/",
    "timestamp": "2025-04-29T02:45:00Z"
  },
  {
    "title": "US probes Harvard and its law review for 'race-based discrimination'",
    "description": "BOSTON: President Donald Trump's administration on Monday (Apr 28) said it was probing whether Harvard University and the Harvard Law Review violated civil rights laws when the journal's editors fast-tracked consideration of an article written by a member of …",
    "link": "https://www.channelnewsasia.com/world/us-harvard-law-review-race-based-discrimination-5096101",
    "timestamp": "2025-04-29T02:44:53Z"
  },
  {
    "title": "Sebastian Stan Debuts Shaved Head in Shocking Hair Transformation",
    "description": "Marvel at Sebastian Stan's new look.\nThe Captain America star unveiled a major hair transformation on April 28, stepping out to the Los Angeles premiere of Thunderbolts*—in which he reprises his...",
    "link": "https://www.eonline.com/news/1416782/sebastian-stan-shaves-head-in-hair-transformation",
    "timestamp": "2025-04-29T02:44:23Z"
  },
  {
    "title": "Canadians keep Liberal Party and Mark Carney in power in national election",
    "description": "President Donald Trump injected himself into the race with his tariffs on Canadian imports and repeatedly saying Canada should become the 51st U.S. state.",
    "link": "https://www.cnbc.com/2025/04/29/canadians-keep-liberal-party-and-mark-carney-in-power-in-national-election.html",
    "timestamp": "2025-04-29T02:44:18Z"
  },
  {
    "title": "Sen. Josh Hawley Reintroduces 'PELOSI Act' to Ban Congress from Trading Stocks",
    "description": "Sen. Josh Hawley (R-MO) reintroduced legislation Monday during the current 119th U.S. Congress, which would ban members of Congress and their family members from being able to trade or hold stocks.\nThe post Sen. Josh Hawley Reintroduces ‘PELOSI Act’ to Ban Co…",
    "link": "https://www.breitbart.com/politics/2025/04/28/sen-josh-hawley-reintroduces-pelosi-act-ban-congress-trading-stocks/",
    "timestamp": "2025-04-29T02:43:34Z"
  },
  {
    "title": "Cross-border fire continues for fifth night amid soaring India-Pakistan tensions",
    "description": "Tensions between India and Pakistan have surged following a deadly terror attack in Jammu and Kashmir's Pahalgam that killed 26 people, mostly tourists. For a fifth consecutive night, Pakistani troops fired across the Line of Control, with the Indian Army res…",
    "link": "https://economictimes.indiatimes.com/news/defence/cross-border-fire-continues-for-fifth-night-amid-soaring-india-pakistan-tensions/articleshow/120713411.cms",
    "timestamp": "2025-04-29T02:41:14Z"
  },
  {
    "title": "Trump abandons Ukraine election demand – US state media",
    "description": "The US has quietly dropped its demand for new elections in Ukraine, RFE/RL has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616465-trump-drops-ukraine-election-demand/",
    "timestamp": "2025-04-29T02:40:46Z"
  },
  {
    "title": "Carney’s Liberals Win Canada Election, Setting Up Talks With US",
    "description": "Canada’s Liberal Party won a fourth consecutive election, giving a mandate to former central banker Mark Carney after a campaign in which he pledged to boost economic growth and stand up to US President Donald Trump in a trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/carneys-liberals-win-canada-election-setting-up-talks-with-us",
    "timestamp": "2025-04-29T02:37:44Z"
  },
  {
    "title": "New York Giants Deny Trump’s Story About Saquon Barkley",
    "description": "President Donald Trump welcomed the Super Bowl champion Philadelphia Eagles to the White House on Monday after they downed the Kansas City Chiefs back in February.\nThe post New York Giants Deny Trump’s Story About Saquon Barkley first appeared on Mediaite.",
    "link": "https://www.mediaite.com/trump/new-york-giants-deny-trumps-story-about-saquon-barkley/",
    "timestamp": "2025-04-29T02:37:22Z"
  },
  {
    "title": "Mark Carney’s Liberals win Canadian election upended by Trump, CBC projects",
    "description": "Prime Minister Mark Carney’s Liberal Party won Canada’s federal election on Monday, capping a stunning turnaround in fortunes fueled by U.S. President Donald Trump’s annexation threats and trade war.",
    "link": "https://www.pbs.org/newshour/world/mark-carneys-liberals-win-canadian-election-upended-by-trump-cbc-projects",
    "timestamp": "2025-04-29T02:37:21Z"
  },
  {
    "title": "US Congress Passes 'Revenge Porn' Ban, Sends It To Donald Trump",
    "description": "In March, Donald Trump vowed to sign the bill into law and said, &quot;I&#039;m going to use that bill for myself too if you don&#039;t mind, because nobody gets treated worse than I do online, nobody.&quot;",
    "link": "https://www.ndtv.com/world-news/take-it-down-act-us-congress-passes-revenge-porn-ban-sends-it-to-donald-trump-8282676",
    "timestamp": "2025-04-29T02:37:20Z"
  },
  {
    "title": "Can Bitcoin Benefit From Trump Firing Powell? Turkey’s Lira Crisis May Provide Clues",
    "description": "Turkey’s President Erdogan’s experience with central bank interference serves as a warning, as it led to a currency collapse and increased investment in bitcoin and stablecoins. What to know: The week has begun on an interesting note, with the U.S. dollar cra…",
    "link": "https://www.activistpost.com/can-bitcoin-benefit-from-trump-firing-powell-turkeys-lira-crisis-may-provide-clues/",
    "timestamp": "2025-04-29T02:36:00Z"
  },
  {
    "title": "Canada Liberals Win Election Donald Trump Looms",
    "description": "Pierre Poilievre’s Conservative Party saw pre-election polling momentum stall amid the trade war with the U.S. and Trump's \"51st state\" taunts.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/canada-liberals-win-election-1236202428/",
    "timestamp": "2025-04-29T02:35:22Z"
  },
  {
    "title": "Giants clap back at Donald Trump’s story of Saquon Barkley warning: ‘Stop yapping’",
    "description": "The Giants are pushing back on President Donald Trump’s claim that he told members of the Giants – including head coach Brian Daboll –  not to let Saquon Barkley leave before he became a free agent and signed with the Eagles in 2024.",
    "link": "https://nypost.com/2025/04/28/sports/giants-clap-back-at-donald-trumps-story-of-saquon-barkley-warning-stop-yapping/",
    "timestamp": "2025-04-29T02:34:24Z"
  },
  {
    "title": "BRICS meeting in Brazil discusses Ukraine, Gaza and Trump's trade war",
    "description": "Ministers from the bloc — which has traditionally been cautious in comments about the Ukraine war — met to hone their agenda ahead of a leaders' summit in July.",
    "link": "https://www.japantimes.co.jp/news/2025/04/29/world/politics/trump-trade-war-brics-brazil/",
    "timestamp": "2025-04-29T02:33:00Z"
  },
  {
    "title": "Liberals win Canada's election; unclear if they have majority government",
    "description": "Canada's Liberals held onto power but may fall short of a majority, with results hinging on final counts in British Columbia.",
    "link": "https://www.japantimes.co.jp/news/2025/04/29/world/politics/liberals-canada-election-majority/",
    "timestamp": "2025-04-29T02:32:00Z"
  },
  {
    "title": "'Not recognised': What politicians don't get about young women",
    "description": "Experts say young women are a \"really important\" voting category but are sometimes \"not recognised\", as Vote Compass data shows gen Z females to be deeply progressive.",
    "link": "https://www.abc.net.au/news/2025-04-29/vote-compass-shows-gen-z-women-shifting-left-federal-election/105213284",
    "timestamp": "2025-04-29T02:30:47Z"
  },
  {
    "title": "Game change Canadian election: Mark Carney projected to lead Liberals to their fourth consecutive win",
    "description": "The Liberals helmed by Mark Carney are projected to have felled yet another Conservative opponent amid continuing threats by U.S. President Donald Trump to make Canada a 51st American state.",
    "link": "https://theconversation.com/game-change-canadian-election-mark-carney-projected-to-lead-liberals-to-their-fourth-consecutive-win-253721",
    "timestamp": "2025-04-29T02:30:38Z"
  },
  {
    "title": "Game change Canadian election: Mark Carney leads Liberals to their fourth consecutive win",
    "description": "The Liberals helmed by Mark Carney have felled yet another Conservative opponent amid continuing threats by U.S. President Donald Trump to make Canada a 51st American state.",
    "link": "https://theconversation.com/game-change-canadian-election-mark-carney-leads-liberals-to-their-fourth-consecutive-win-253721",
    "timestamp": "2025-04-29T02:30:38Z"
  },
  {
    "title": "Game change Canadian election: Mark Carney leads Liberals to their fourth consecutive win consécutive",
    "description": "The Liberals helmed by Mark Carney have felled yet another Conservative opponent amid continuing threats by U.S. President Donald Trump to make Canada a 51st American state.",
    "link": "https://theconversation.com/game-change-canadian-election-mark-carney-leads-liberals-to-their-fourth-consecutive-win-consecutive-253721",
    "timestamp": "2025-04-29T02:30:38Z"
  },
  {
    "title": "Game change Canadian election: Mark Carney projected to have lead Liberals to their fourth consecutive win",
    "description": "The Liberals helmed by Mark Carney are projected to have felled yet another Conservative opponent amid continuing threats by U.S. President Donald Trump to make Canada a 51st American state.",
    "link": "https://theconversation.com/game-change-canadian-election-mark-carney-projected-to-have-lead-liberals-to-their-fourth-consecutive-win-253721",
    "timestamp": "2025-04-29T02:30:38Z"
  },
  {
    "title": "The game change Canadian election: Mark Carney leads Liberals to their fourth consecutive win",
    "description": "The Liberals helmed by Mark Carney have felled yet another Conservative opponent amid continuing threats by U.S. President Donald Trump to make Canada a 51st American state.",
    "link": "https://theconversation.com/the-game-change-canadian-election-mark-carney-leads-liberals-to-their-fourth-consecutive-win-253721",
    "timestamp": "2025-04-29T02:30:38Z"
  },
  {
    "title": "Donald Trump speech looms: can Bitcoin leverage exchange outflows, safe haven status for $100K?",
    "description": "Bitcoin climbed above $95,490 Monday ahead of Trump’s 100-day speech, eyeing policy clarity. Potential confirmation of a US Bitcoin strategic reserve could be a major catalyst towards $100K. Bitcoin shows resilience (YTD +5.6%) vs. US stocks (YTD -5%) amid ta…",
    "link": "https://coinjournal.net/news/donald-trump-speech-looms-can-bitcoin-leverage-exchange-outflows-safe-haven-status-for-100k/",
    "timestamp": "2025-04-29T02:30:33Z"
  },
  {
    "title": "Mark Carney Wins Canada's Federal Election as Trump's Shadow Looms",
    "description": "Carney, Canada's liberal party candidate, beat conservative Pierre Poilievre, the AP reported.",
    "link": "https://www.newsweek.com/canada-prime-minister-election-results-mark-carney-wins-2065366",
    "timestamp": "2025-04-29T02:30:21Z"
  },
  {
    "title": "Crypto group asks Trump to end prosecution of crypto devs, Roman Storm",
    "description": "The crypto lobby group, the DeFi Education Fund, has petitioned the Trump administration to end what it claimed was the “lawless prosecution” of open-source software developers, including Roman Storm, a creator of the crypto mixing service Tornado Cash.In an …",
    "link": "https://cointelegraph.com/news/crypto-group-trump-end-prosecution-crypto-devs-roman-storm",
    "timestamp": "2025-04-29T02:29:24Z"
  },
  {
    "title": "Carney declares victory in Canada election, securing 4th term for Liberals",
    "description": "It's not yet clear if the Liberals will win an outright majority in an election that drew a record number of voters.",
    "link": "https://www.abc.net.au/news/2025-04-29/mark-carney-declares-victory-in-canada-election/105228246",
    "timestamp": "2025-04-29T02:28:49Z"
  },
  {
    "title": "Breaking: Mark Carney's ruling Liberal Party projected to win Canada elections, CBC says",
    "description": "A record number of Canadians voted in this election, which also became a referendum on Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-04-29/mark-carney-liberal-party-to-win-canada-elections/105228246",
    "timestamp": "2025-04-29T02:28:49Z"
  },
  {
    "title": "Canadians keep Liberal Party and Mark Carney in power as country digs in on Trump’s trade war",
    "description": "President Donald Trump injected himself into the race with his tariffs on Canadian imports and repeatedly saying Canada should become the 51st U.S. state.",
    "link": "https://www.nbcnews.com/politics/politics-news/canada-election-results-prime-minister-carney-poilievre-rcna203321",
    "timestamp": "2025-04-29T02:27:45Z"
  },
  {
    "title": "Trump administration targets scientists behind key climate assessment",
    "description": "Dismissal of nearly 400 contributors leaves the future of the U.S. National Climate Assessment in doubt under Trump's administration.",
    "link": "https://www.japantimes.co.jp/environment/2025/04/29/climate-change/national-climate-assessment-authors/",
    "timestamp": "2025-04-29T02:26:00Z"
  },
  {
    "title": "LIVE: Mark Carney's Liberals Set To Win Canada Polls Defined By Trump Threats",
    "description": "Canadians are voting today to decide whether to extend the Prime Minister Mark Carney-led Liberal Party's decade in power or hand over the country's control to Pierre Poilievre's Conservative Party.",
    "link": "https://www.ndtv.com/world-news/canadian-election-results-2025-live-updates-voting-results-mark-next-pm-carney-pierre-poilievre-riding-wise-federal-polls-vote-tracker-justin-trudeau-8275801",
    "timestamp": "2025-04-29T02:25:46Z"
  },
  {
    "title": "Canada Rebukes Trump & Tariffs With Big Election Win For PM Carney & Once Flailing Liberals",
    "description": "In a near unprecedented political comeback and a very clear elbows up to Donald Trump and his tariffs, Canada’s ruling Liberals will continue to reign following tonight’s Great North election results. While the incumbents were once presumed heading for a huge…",
    "link": "http://deadline.com/2025/04/canada-election-results-trump-liberal-party-1236379458/",
    "timestamp": "2025-04-29T02:25:29Z"
  },
  {
    "title": "Brit Hume Says He’s Mystified Why Democrats Attack Trump ‘On An Issue In Which He’s Clearly Succeeding’",
    "description": "Brit Hume warned Democrats on Fox News Monday against making immigration a central campaign issue, arguing that President Donald Trump is clearly succeeding.",
    "link": "https://dailycaller.com/2025/04/28/brit-hume-democrats-attack-trump/",
    "timestamp": "2025-04-29T02:25:24Z"
  },
  {
    "title": "Canada election results: Liberals projected to win, Mark Carney on course to secure full term",
    "description": "Canada’s Liberal Party, led by Prime Minister Mark Carney, is on course to win the country’s federal election, Canadian media projects, in a campaign that has been overshadowed by provocations and tariffs from US President Donald Trump.",
    "link": "https://www.cnn.com/2025/04/28/americas/canada-election-results-carney-poilievre-intl-hnk/index.html",
    "timestamp": "2025-04-29T02:21:53Z"
  },
  {
    "title": "US House passes bill to ban sharing of revenge porn, awaits Donald Trump's signature",
    "description": "The US House has approved the bipartisan Take It Down Act, making it illegal to share explicit images and AI deepfakes without consent. Platforms must remove such content within two days. The bill passed 409-2 and now awaits President Donald Trump’s expected …",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-house-passes-bill-to-ban-sharing-of-revenge-porn-awaits-donald-trumps-signature/articleshow/120713351.cms",
    "timestamp": "2025-04-29T02:21:27Z"
  },
  {
    "title": "100 days of destruction: Trump’s first three months are a sea of red ink",
    "description": "Donald Trump’s second time in the White House has produced the worst 100 days for financial markets in half a century.",
    "link": "https://www.smh.com.au/business/markets/100-days-of-destruction-trump-s-first-three-months-are-a-sea-of-red-ink-20250429-p5luz0.html",
    "timestamp": "2025-04-29T02:21:11Z"
  },
  {
    "title": "Mark Carney's Liberals secure victory amid Trump threats in Canadian elections",
    "description": "Prime Minister Mark Carney’s Liberal Party has won Canada's federal election, fuelled by a wave of nationalism sparked by U.S. President Donald Trump's annexation threats and trade war rhetoric. The Liberals reversed an expected defeat, as Canadians reacted s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/mark-carneys-liberals-secure-victory-amid-trump-threats-in-canadian-elections/articleshow/120713314.cms",
    "timestamp": "2025-04-29T02:20:38Z"
  },
  {
    "title": "Mark Carney projected as winner of Canadian federal election",
    "description": "The 45th Canadian federal election results are in, and the Liberal Party of Canada, led by Mark Carney, is projected to form government.Either party needed 172 seats out of a possible 343 to form a majority.As of this article's publication, the count shows th…",
    "link": "https://dailyhive.com/canada/liberal-party-mark-carney-win-election-canada-2025",
    "timestamp": "2025-04-29T02:20:37Z"
  },
  {
    "title": "White evangelicals continue to stand out in their support for Trump (Chip Rotolo/Pew Research Center)",
    "description": "Chip Rotolo / Pew Research Center:\nWhite evangelicals continue to stand out in their support for Trump  —  Roughly three months into President Donald Trump's second term, White evangelical Protestants continue to be among his strongest supporters:  — 72% appr…",
    "link": "https://www.memeorandum.com/250428/p144",
    "timestamp": "2025-04-29T02:20:01Z"
  },
  {
    "title": "Mark Carney Wins Canadian Election Dominated By Trump",
    "description": "Carney, who was picked to take over the leadership of the Liberals in March, reaped the benefits of Trump’s adversarial stance toward the neighboring country.",
    "link": "https://www.huffpost.com/entry/mark-carney-wins-canadian-election_n_680f95a0e4b049bc73d5b74e",
    "timestamp": "2025-04-29T02:18:12Z"
  },
  {
    "title": "'Popular as bed bugs': Rachel Maddow rips into Trump policy that has people 'freaking out'",
    "description": "MSNBC’s Rachel Maddow ripped into President Donald Trump Monday night as she blasted his latest political threats against his own party as a desperate attempt to salvage his deeply unpopular MAGA agenda.“Today, Donald Trump started threatening Republican U.S.…",
    "link": "https://www.rawstory.com/trump-tariffs-2671859634/",
    "timestamp": "2025-04-29T02:16:58Z"
  },
  {
    "title": "Florida Man Loses Canadian Election",
    "description": "Preliminary results projected by CBC in Canada’s snap federal election, which took place Monday, suggest that the country’s Liberal Party—which is currently in power—will win enough seats in the Canadian parliament to allow party leader Mark Carney to remain …",
    "link": "https://www.motherjones.com/politics/2025/04/trump-canada-election-carney-liberal-musk/",
    "timestamp": "2025-04-29T02:15:56Z"
  },
  {
    "title": "THC seltzers rise in popularity: What to know about the drinks",
    "description": "The THC beverage industry is expected to be a $4 billion industry by 2028.",
    "link": "https://abc30.com/post/thc-seltzers-rise-popularity-what-know-drinks/16269734/",
    "timestamp": "2025-04-29T02:14:58Z"
  },
  {
    "title": "Rob Manfred to rule on posthumous Pete Rose reinstatement after Trump talk",
    "description": "Rob Manfred is considering a petition to have Pete Rose posthumously removed from MLB's permanently ineligible list after meeting with President Donald Trump.",
    "link": "https://nypost.com/2025/04/28/sports/rob-manfred-to-rule-on-pete-rose-reinstatement-after-trump-talk/",
    "timestamp": "2025-04-29T02:12:54Z"
  },
  {
    "title": "Trump to tout US investments from Nvidia, J&J, Hyundai, Toyota",
    "description": "President Trump is set to host an \"Investing in America\" event at the White House, showcasing U.S. investments across various sectors like defense, tech, and healthcare. CEOs from Nvidia, Johnson & Johnson, Hyundai, Toyota, and SoftBank are expected to attend.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-to-tout-us-investments-from-nvidia-jj-hyundai-toyota/articleshow/120713239.cms",
    "timestamp": "2025-04-29T02:11:08Z"
  },
  {
    "title": "MLB commissioner says he plans to issue ruling on possible reinstatement for Pete Rose",
    "description": "Major League Baseball commissioner Rob Manfred could soon determine whether Cincinnati Reds legend Pete Rose will be posthumously removed from baseball’s ineligible list.",
    "link": "https://www.wlwt.com/article/pete-rose-reinistatement-ruling-rob-manfred-mlb-baseball/64614311",
    "timestamp": "2025-04-29T02:10:34Z"
  },
  {
    "title": "CNN Data Chief Spots This GOP ‘Illusion’ With Trump",
    "description": "Harry Enten turned to the president's \"historically awful\" polling numbers with one key voting demographic.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-donald-trump-gop-independents-polling_n_681011f1e4b0c99c9f24161d",
    "timestamp": "2025-04-29T02:07:47Z"
  },
  {
    "title": "After yield surge, US Treasury expected to keep auction sizes steady",
    "description": "The U.S. Treasury is likely to maintain current auction sizes for the fifth consecutive quarter, but investors are keenly awaiting clues about future increases or potential near-term cuts. The focus is on any forward guidance changes that could impact markets…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/after-yield-surge-us-treasury-expected-to-keep-auction-sizes-steady/articleshow/120713195.cms",
    "timestamp": "2025-04-29T02:06:33Z"
  },
  {
    "title": "'Screamingly obvious': Columnist tears into Trump's coming betrayal",
    "description": "New York Times columnist Michelle Goldberg says Trump’s real motives are clear behind his battle against antisemitism.“About a decade ago, conservatives would often denounce Muslim immigration on the grounds that it threatened Western progress on gay rights. …",
    "link": "https://www.rawstory.com/donald-trump-antisemitism-2671859652/",
    "timestamp": "2025-04-29T02:04:05Z"
  },
  {
    "title": "Sauce Gardner pokes fun at Saquon Barkley controversy over Trump golf outing",
    "description": "Barkley was criticized for golfing and traveling with President Donald Trump over the weekend.",
    "link": "https://nypost.com/2025/04/28/sports/sauce-gardner-pokes-fun-at-saquon-barkley-controversy-over-trump-golf-outing/",
    "timestamp": "2025-04-29T02:01:27Z"
  },
  {
    "title": "MAGA man leads the field before Romanian election rerun",
    "description": "George Simion, the candidate tipped to win the first round of the presidential election, has publicly aligned himself with Donald Trump.",
    "link": "https://www.politico.eu/article/maga-romanian-election-rerun-donald-trump-romania-presidency-sunday-vote/",
    "timestamp": "2025-04-29T02:01:00Z"
  },
  {
    "title": "The political novice now elected by Canadian voters as prime minister",
    "description": "Mark Carney is set to be elected as prime minister of Canada after his ruling Liberal Party were projected to win the election.",
    "link": "https://news.sky.com/story/who-is-mark-carney-the-political-novice-now-elected-by-canadian-voters-as-prime-minister-13357798",
    "timestamp": "2025-04-29T02:00:00Z"
  },
  {
    "title": "Dollar limps along on U.S.-China trade standoff",
    "description": "The dollar struggled to recover losses amid conflicting signals on Sino-U.S. trade talks, with the U.S. placing the onus on China. Investors, rattled by the uncertainty, sought refuge in the yen and Swiss franc. Despite softened stances from both sides, a nea…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-limps-along-on-u-s-china-trade-standoff/articleshow/120713110.cms",
    "timestamp": "2025-04-29T01:59:02Z"
  },
  {
    "title": "White House Jokingly Credits President Trump for Stopping Shedeur Sanders' Draft Slide",
    "description": "White House press secretary Karoline Leavitt joked during Monday's presser that the president can be credited with Shedeur Sanders' fifth-round NFL Draft pick.\nThe post White House Jokingly Credits President Trump for Stopping Shedeur Sanders’ Draft Slide app…",
    "link": "https://www.breitbart.com/sports/2025/04/28/white-house-jokingly-credits-president-trump-stopping-shedeur-sanders-draft-slide/",
    "timestamp": "2025-04-29T01:58:13Z"
  },
  {
    "title": "Amazon launches first Starlink-rival internet satellites",
    "description": "Backers of the $16.7 billion initiative plan to deploy thousands of satellites.",
    "link": "https://www.nzherald.co.nz/business/amazon-launches-first-starlink-rival-internet-satellites/RF3NTD4355C3FECZP544VDSFTE/",
    "timestamp": "2025-04-29T01:58:02Z"
  },
  {
    "title": "F/A-18 Hornet Fighter Jet Falls Off USS Harry S. Truman, Lost at Sea",
    "description": "An F/A-18E Super Hornet fighter jet has been reported to be lost at sea after it fell overboard while being “actively under tow in the hang bay” on the USS Harry S. Truman. In a press release from the Office\nThe post F/A-18 Hornet Fighter Jet Falls Off USS Ha…",
    "link": "https://www.breitbart.com/politics/2025/04/28/f-a-18-hornet-fighter-jet-falls-off-uss-harry-s-truman-lost-sea/",
    "timestamp": "2025-04-29T01:57:00Z"
  },
  {
    "title": "Stop scaring future world leaders off U.S. campuses",
    "description": "To the extent that a U.S. education gets others to think as Americans think, it is the ideal tool of soft power",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/29/world/stop-scaring-future-world-leaders/",
    "timestamp": "2025-04-29T01:56:00Z"
  }
]