[
  {
    "title": "UK Export Orders Fall at Fastest Pace in Five Months, PMI Shows",
    "description": "Demand for British exports declined at the fastest pace since April when US President Donald Trump announced his global tariffs, according to a closely watched survey.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-export-orders-fall-at-fastest-pace-in-five-months-pmi-shows",
    "timestamp": "2025-09-23T08:51:22Z"
  },
  {
    "title": "Trump's Controversial Tariffs Generate Nearly $350 Billion, Becoming 'Very Significant' US Revenue Source, Says Economist",
    "description": "The controversial tariffs imposed by President Donald Trump have turned into a major revenue stream for the U.S. government, amassing approximately $350 billion at an annualized pace.\nTariffs Now A Major Federal Revenue Source, Says Economist\nThe tariffs, whi…",
    "link": "https://biztoc.com/x/ec87ded43f729594",
    "timestamp": "2025-09-23T08:50:42Z"
  },
  {
    "title": "Clean energy, dirty tactics: Inside the shady world of door-to-door solar sales",
    "description": "On-site solar can be an incredible tool for lowering both energy costs and greenhouse gas emissions. But homeowners face a complicated — and sometimes intentionally misleading — process.",
    "link": "https://grist.org/business/clean-energy-dirty-tactics-inside-the-shady-world-of-door-to-door-solar-sales/",
    "timestamp": "2025-09-23T08:45:00Z"
  },
  {
    "title": "Eric Trump’s Latest Sales Pitch Gets Instantly Repurposed Online",
    "description": "The Trump scion's new product promises to be \"eye-opening,\" but critics aren't convinced.",
    "link": "https://www.huffpost.com/entry/eric-trump-new-sales-pitch_n_68d24fe9e4b06a8b846e03c9",
    "timestamp": "2025-09-23T08:41:50Z"
  },
  {
    "title": "AI Is Pointless If It Doesn’t Boost Productivity",
    "description": "If all those pushing AI want it to serve society, they should develop a serious, clear, evidence-based plan to ensure that the technology contributes to productivity growth where it is needed most. Otherwise, we all must ask what the current massive sums of i…",
    "link": "https://www.project-syndicate.org/commentary/ai-investment-boom-pointless-unless-boosts-productivity-by-jim-o-neill-2025-09",
    "timestamp": "2025-09-23T08:40:20Z"
  },
  {
    "title": "View from The Hill: Albanese left off Trump’s meeting list, as Ley oversteps the mark",
    "description": "Foreign policy is proving a sticking point for both the prime minister and the opposition leader,  with both presenting lacklustre performances.",
    "link": "https://theconversation.com/view-from-the-hill-albanese-left-off-trumps-meeting-list-as-ley-oversteps-the-mark-265856",
    "timestamp": "2025-09-23T08:38:46Z"
  },
  {
    "title": "Right-wing Twitter is up in arms about Gwar “disembowelling” Donald Trump",
    "description": "The intergalactic heavy metal warlords from the planet Scumdogia are being accused of having Democratic sympathies and inciting political violence",
    "link": "https://www.loudersound.com/news/gwar-upsets-maga-donald-trump-riot-fest-chicago-2025",
    "timestamp": "2025-09-23T08:38:26Z"
  },
  {
    "title": "Who recognises the State of Palestine, who doesn't, and why does it matter?",
    "description": "Following nearly two years of conflict in Gaza, a majority of European nations, including France, Belgium, and the UK, have officially recognized the State of Palestine. This move, declared at the UN, reflects a shifting global perspective, with over 151 coun…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/who-recognises-the-state-of-palestine-who-doesnt-and-why-does-it-matter/articleshow/124066136.cms",
    "timestamp": "2025-09-23T08:36:08Z"
  },
  {
    "title": "Tampa mom reacts after Trump links Tylenol use in pregnancy to autism",
    "description": "President Donald Trump, alongside Health Secretary Robert F. Kennedy Jr., announced on Monday that they believe acetaminophen — the active ingredient in Tylenol — is linked to higher autism rates when used during pregnancy.",
    "link": "https://www.fox13news.com/news/tampa-mom-reacts-after-trump-links-tylenol-use-pregnancy-autism",
    "timestamp": "2025-09-23T08:35:08Z"
  },
  {
    "title": "Harris Attacks ‘Feckless’ Business Leaders For Not Standing Up To ‘Tyrant’ Trump In First Big TV Interview Since Leaving Office",
    "description": "In the 40-minute-long sit-down interview with MSNBC’s Rachel Maddow, Harris also addresses her criticism of former President Joe Biden in her new book.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/09/23/harris-calls-trump-a-tyrant-attacks-feckless-business-leaders-in-first-big-tv-interview-since-leaving-office/",
    "timestamp": "2025-09-23T08:24:15Z"
  },
  {
    "title": "Bryson DeChambeau is a ‘captain’s nightmare’, says Brandel Chamblee",
    "description": "NBC analyst says golfer is an ‘odd duck’ whose YouTube views are generated by bots",
    "link": "https://www.irishtimes.com/sport/golf/2025/09/23/bryson-dechambeau-is-a-captains-nightmare-says-brandel-chamblee/",
    "timestamp": "2025-09-23T08:22:41Z"
  },
  {
    "title": "Kamala Harris Hails Jimmy Kimmel’s Return: ‘We Saw the Power of the People’",
    "description": "The Democratic presidential nominee sat down for an interview with Rachel Maddow on MSNBC, also discussing her book and her relationship with Joe Biden",
    "link": "http://www.rollingstone.com/politics/politics-news/kamala-harris-jimmy-kimmel-return-maddow-interview-1235432991/",
    "timestamp": "2025-09-23T08:20:48Z"
  },
  {
    "title": "Zelenskyy to meet Trump as Russian troops advance towards Ukraine's 'fortress belt'",
    "description": "Despite intense lobbying by European leaders concerned with alleged airspace violations by Russian drones and aircraft, President Donald Trump is not expected to announce fresh sanctions.",
    "link": "https://news.sky.com/story/zelenskyy-to-meet-trump-as-russian-troops-advance-towards-ukraines-fortress-belt-13436560",
    "timestamp": "2025-09-23T08:18:00Z"
  },
  {
    "title": "Charlie Kirk’s memorial was one of the most heavily fortified events of its kind, expert says—and that doesn’t include the fireworks",
    "description": "Charlie Kirk’s memorial was granted the highest U.S. security designation, and included a bulletproof-glass-encased podium area, TSA-like metal detectors, and counter-sniper teams.\nThe event on Sunday included remarks from President Donald Trump, Vice Preside…",
    "link": "https://biztoc.com/x/65f489b8bd344670",
    "timestamp": "2025-09-23T08:17:05Z"
  },
  {
    "title": "UK health officials address Trump announcing paracetamol in pregnancy causes autism",
    "description": "Donald Trump said there was a link between Tylenol and autism",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-paracetamol-autism-uk-health-advice-056839-20250923",
    "timestamp": "2025-09-23T08:12:46Z"
  },
  {
    "title": "Closing arguments to begin in trial of man accused of trying to assassinate Trump",
    "description": "Closing arguments will begin Tuesday in the trial of Ryan Routh, the man charged with trying to assassinate Donald Trump last year on his Florida golf course.",
    "link": "https://www.npr.org/2025/09/23/nx-s1-5550265/closing-arguments-to-begin-in-trial-of-man-accused-of-trying-to-assassinate-trump",
    "timestamp": "2025-09-23T08:11:54Z"
  },
  {
    "title": "A ship comes under attack off the coast of Yemen as Houthi rebels continue to threaten vessels",
    "description": "A ship traveling off the coast of Yemen in the Gulf of Aden has come under attack",
    "link": "https://abcnews.go.com/International/wireStory/ship-attack-off-coast-yemen-houthi-rebels-continue-125841926",
    "timestamp": "2025-09-23T08:06:23Z"
  },
  {
    "title": "President Trump to discuss his foreign policy priorities with world leaders at UNGA",
    "description": "President Trump will meet with world leaders Tuesday to discuss his foreign policy priorities at the UN General Assembly.",
    "link": "https://www.npr.org/2025/09/23/nx-s1-5546864/trump-foreign-policy-priorities-unga",
    "timestamp": "2025-09-23T08:05:45Z"
  },
  {
    "title": "Altman, Huang and the last-minute negotiations that sealed the $100 billion OpenAI-Nvidia deal",
    "description": "The $100 billion deal between Nvidia and OpenAI was struck under the pressure of a looming deadline during President Trump's U.K. trip.",
    "link": "https://www.cnbc.com/2025/09/23/altman-huang-negotiations-that-sealed-100-billion-openai-nvidia-deal.html",
    "timestamp": "2025-09-23T08:03:39Z"
  },
  {
    "title": "Ukraine seeks support as Zelensky visits US to address UN, meet Trump",
    "description": "Ukrainian President Volodymyr Zelensky will seek more support from allies when he addresses the UN and meets Donald Trump this week, but behind the scenes, Kyiv is quietly preparing for a new phase of the war in which it relies more on itself.",
    "link": "https://nypost.com/2025/09/23/world-news/ukraine-seeks-support-as-zelensky-visits-us-to-address-un-meet-trump/",
    "timestamp": "2025-09-23T08:03:21Z"
  },
  {
    "title": "Charlie Kirk’s memorial was one of the most heavily fortified events of its kind, expert says—and that doesn’t include the fireworks",
    "description": "“Pyrotechnics are usually designed for visual impact, not for addressing security threats.”",
    "link": "https://fortune.com/2025/09/23/charlie-kirk-memorial-trump-super-bowl-security-sear-bulletproof-glass-2025-fireworks/",
    "timestamp": "2025-09-23T08:02:00Z"
  },
  {
    "title": "Europe is in a culture war with Trump’s America – and it shouldn’t be afraid to fight",
    "description": "To view the transatlantic relationship only through a lens of security or economy is to miss the forest for the trees. Europe faces a culture war – one in which its values and its identity are at stake",
    "link": "https://www.euractiv.com/news/europe-is-in-a-culture-war-with-trumps-america-and-it-shouldnt-be-afraid-to-fight/",
    "timestamp": "2025-09-23T08:00:02Z"
  },
  {
    "title": "UNGA: Trump questions UN's purpose",
    "description": "Donald Trump has strongly criticized the United Nations in his speech to the UN General Assembly, where leaders from over 140 countries have gathered after France's recognition of a Palestinian state. DW has more. Some 140 world leaders are in New York as the…",
    "link": "https://www.dw.com/en/unga-trump-questions-uns-purpose/live-74097199",
    "timestamp": "2025-09-23T08:00:00Z"
  },
  {
    "title": "UNGA: Trump slams UN, calls climate change a 'con job'",
    "description": "Donald Trump has strongly criticized the United Nations in his speech to the UN General Assembly, where leaders from over 140 countries have gathered after France's recognition of a Palestinian state. DW has more. Some 140 world leaders are in New York as the…",
    "link": "https://www.dw.com/en/unga-trump-slams-un-calls-climate-change-a-con-job/live-74097199",
    "timestamp": "2025-09-23T08:00:00Z"
  },
  {
    "title": "Under the radar: The possible link between U.S. Baltic security cuts and airspace incursions",
    "description": "A Canadian expert on Russian warfare says he believes a direct line can be drawn between Moscow's repeated testing of the airspace belonging to NATO allies in Eastern Europe and the Pentagon's recent, quietly announced plan to cut security assistance to the B…",
    "link": "https://www.cbc.ca/news/politics/russian-drone-incursions-1.7640816",
    "timestamp": "2025-09-23T08:00:00Z"
  },
  {
    "title": "UNGA: Trump questions UN's purpose",
    "description": "Donald Trump has strongly criticized the United Nations in his speech to the UN General Assembly, where leaders from over 140 countries have gathered after France's recognition of a Palestinian state. DW has more.",
    "link": "https://www.dw.com/en/unga-trump-questions-uns-purpose/live-74097199",
    "timestamp": "2025-09-23T08:00:00Z"
  },
  {
    "title": "How I learned to stop worrying and love the datacenter",
    "description": "Stargates or black holes? Risks and rewards from the B(r)itbarn boom Comment  The UK has bitterly expensive power, an energy minister who sees electricity as bad, a lethargic planning system, and a grid with a backlog for connections running to 2039.…",
    "link": "https://www.theregister.com/2025/09/23/datacenter_builds_risk_rewards/",
    "timestamp": "2025-09-23T07:58:04Z"
  },
  {
    "title": "US bank sees India as a ‘bright spot’ despite Trump tariffs – Bloomberg",
    "description": "JPMorgan Chase’s Asia-Pacific head is confident that New Delhi can navigate its trade woes with Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625090-us-bank-sees-india-as/",
    "timestamp": "2025-09-23T07:55:18Z"
  },
  {
    "title": "Divided Europe on the Palestinian state: The message conveyed by Macron’s recognition and the cautious, wait-and-see stance of Rome and Berlin",
    "description": "Dozens of world leaders expressed their support for a Palestinian state at the UN yesterday\nThe post Divided Europe on the Palestinian state: The message conveyed by Macron’s recognition and the cautious, wait-and-see stance of Rome and Berlin appeared first …",
    "link": "https://en.protothema.gr/2025/09/23/divided-europe-on-the-palestinian-state-the-message-conveyed-by-macrons-recognition-and-the-cautious-wait-and-see-stance-of-rome-and-berlin/",
    "timestamp": "2025-09-23T07:54:54Z"
  },
  {
    "title": "Orsted shares jump 12% after US judge lifts Trump ban on Revolution Wind project",
    "description": "COPENHAGEN (Reuters) -Shares in Orsted rose as much as 12% in early trade on Tuesday after a U.S. federal judge ruled that it can resume work on the almost...",
    "link": "https://finance.yahoo.com/news/orsted-shares-jump-12-us-074440609.html",
    "timestamp": "2025-09-23T07:44:40Z"
  },
  {
    "title": "CZ’s $10B crypto fund YZi Labs ‘may’ open to external investors",
    "description": "CZ’s $10 billion fund, YZi Labs, is considering opening to outside investors. The fund manages a portfolio of over 230 crypto and Web3 firms, including Aptos and Polygon.",
    "link": "https://cointelegraph.com/news/cz-yzi-labs-may-open-to-external-investors",
    "timestamp": "2025-09-23T07:42:28Z"
  },
  {
    "title": "GST 2.0: Aam aadmi and these 5 sectors are about to make a killing",
    "description": "India's recent GST reform, implemented on September 22, has brought welcome relief to both businesses and consumers. The tax adjustments have lowered the cost of essential goods and services, including healthcare and transportation. Industry leaders anticipat…",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/gst-2-0-aam-aadmi-and-fmcg-insurance-auto-tourism-hospitality-sectors-are-about-to-make-a-killing/articleshow/124064775.cms",
    "timestamp": "2025-09-23T07:40:35Z"
  },
  {
    "title": "EU, Indonesia Seal Zero-Tariff Trade Deal for Most Goods",
    "description": "The European Union and Indonesia have secured a trade deal that will eliminate tariffs on most goods, boosting relations between the partners amid US President Donald Trump’s moves to upend global commerce.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-indonesia-seal-zero-tariff-trade-deal-for-most-goods",
    "timestamp": "2025-09-23T07:39:58Z"
  },
  {
    "title": "What’s happened to diplomatic efforts to end the war in Ukraine?",
    "description": "Russia and Ukraine intensify attacks a month after US President Donald Trump met their leaders.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/9/23/whats-happened-to-diplomatic-efforts-to-end-the-war-in-ukraine",
    "timestamp": "2025-09-23T07:38:05Z"
  },
  {
    "title": "Australian experts dispute Trump's autism and Tylenol link",
    "description": "An expert from the University of Wollongong in Australia refutes Trump's claims linking autism to Tylenol use during pregnancy.",
    "link": "https://www.illawarramercury.com.au/story/9073138/australian-experts-dispute-trumps-autism-and-tylenol-link/",
    "timestamp": "2025-09-23T07:36:17Z"
  },
  {
    "title": "Global investment in renewable energy up 10% on 2024 despite Trump rollback",
    "description": "Growth rate slightly lower than previous first-half years but sector still strong and resilient, experts say\nInvestment in renewable energy has continued to increase around the world despite moves by Donald Trump’s White House to cancel and derail low-carbon …",
    "link": "https://biztoc.com/x/55e337d8d6b4d347",
    "timestamp": "2025-09-23T07:32:31Z"
  },
  {
    "title": "Trump to present plan on ending Israel’s Gaza war to Arab, Muslim leaders",
    "description": "US President will meet with leaders from Saudi Arabia, Qatar, UAE, Egypt, Jordan, Turkiye, Indonesia and Pakistan.",
    "link": "https://www.aljazeera.com/news/2025/9/23/trump-to-present-plan-on-ending-israels-gaza-war-to-arab-muslim-leaders",
    "timestamp": "2025-09-23T07:31:56Z"
  },
  {
    "title": "Zelensky to meet Trump at UN summit after drone attacks",
    "description": "Russian aerial attacks on Ukraine killed two people overnight, Ukrainian officials said, while Russia's defence ministry reported several Ukrainian drones had targeted the capital, Moscow.",
    "link": "https://www.rte.ie/news/world/2025/0923/1534837-ukraine-russia/",
    "timestamp": "2025-09-23T07:29:14Z"
  },
  {
    "title": "What you will and won't see at this year's UN General Assembly",
    "description": "The annual high-level gathering at the U.N. General Assembly this week will see more than 140 world leaders descend upon New York City in an effort to secure global peace and security despite growing divides on how to do that",
    "link": "https://abcnews.go.com/US/wireStory/years-general-assembly-125835092",
    "timestamp": "2025-09-23T07:26:24Z"
  },
  {
    "title": "Jon Stewart, Stephen Colbert Credit ‘Upset’ Viewers for Jimmy Kimmel’s Return",
    "description": "\"Pretending that you were going to cancel Hulu while secretly racing through four seasons of Only Murders in the Building, that really worked,\" Stewart said",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-stephen-colbert-jimmy-kimmel-return-late-night-1235432983/",
    "timestamp": "2025-09-23T07:24:20Z"
  },
  {
    "title": "Explainer-Why is leucovorin being considered as an autism treatment?",
    "description": "(Reuters) -On Monday, the U.S. Food and Drug Administration published a notice to the Federal Register ahead of a speech by President Donald Trump, approving a version of leucovorin made by GlaxoSmithKline that the company had previously withdrawn from the FD…",
    "link": "https://www.thestar.com.my/news/world/2025/09/23/explainer-why-is-leucovorin-being-considered-as-an-autism-treatment",
    "timestamp": "2025-09-23T07:22:00Z"
  },
  {
    "title": "Trump links autism to Tylenol use during pregnancy, contradicting decades of evidence | CNN",
    "description": "Joined by top health officials and parents of children with autism, President Donald Trump announced the FDA will be notifying physicians that the use of acetaminophen during pregnancy can be linked to an increased risk of autism, despite decades of evidence …",
    "link": "https://www.cnn.com/2025/09/22/health/video/trump-rfk-announce-autism-acetaminophen-connection-lead-digvid",
    "timestamp": "2025-09-23T07:21:58Z"
  },
  {
    "title": "Boeing's Deal Pipeline: Major Jet Purchases Eyed By Kazakhstan, Turkey, China Amid Trump Push",
    "description": "President Donald Trump revealed that Uzbekistan Airways has entered into an agreement with Boeing Co. (NYSE:BA) for the purchase of up to 22 Boeing 787 Dreamliners, while reports of Turkey ordering Boeing follow.\nBoeing’s Uzbekistan And Reported Turkey Deal\nT…",
    "link": "https://biztoc.com/x/18764ba0851df4aa",
    "timestamp": "2025-09-23T07:20:52Z"
  },
  {
    "title": "USFDA red flags use of acetaminophen in pregnant women",
    "description": "Spotlight on Kenvue’s (formerly J&J consumer health) Tylenol and similar paracetamols; USFDA collaborates with GSK on leucovorin calcium for cerebral folate deficiency",
    "link": "https://www.thehindubusinessline.com/companies/usfda-red-flags-use-of-acetaminophen-in-pregnant-women/article70083692.ece",
    "timestamp": "2025-09-23T07:20:25Z"
  },
  {
    "title": "Good Morning Britain doctor hits out at Trump’s autism claims",
    "description": "Dr Hillary Jones has hit out at Donald Trump’s autism claims, branding them as “unsubstantiated theories based on no evidence whatsoever”.",
    "link": "https://www.the-independent.com/tv/news/trump-autism-tylenol-doctor-hillary-jones-gmb-b2831752.html",
    "timestamp": "2025-09-23T07:18:13Z"
  },
  {
    "title": "All the health claims made by Trump - and what experts have said",
    "description": "Various medical bodies, health professionals and charities have rebuked comments made by Donald Trump and his officials on autism and vaccinations. Here's what was said on both sides.",
    "link": "https://news.sky.com/story/all-the-health-claims-made-by-trump-and-what-experts-have-said-13436533",
    "timestamp": "2025-09-23T07:09:00Z"
  },
  {
    "title": "Gaza crisis dominates as world leaders meet",
    "description": "It is ‘offensive’ that Palestinian Authority officials were blocked from travelling to New York summit, says Simon Harris",
    "link": "https://www.irishtimes.com/politics/2025/09/23/taoiseach-and-tanaiste-join-world-leaders-for-un-summit-on-gaza/",
    "timestamp": "2025-09-23T07:06:40Z"
  },
  {
    "title": "Explainer-What does the expiry of a US trade deal mean for African economies?",
    "description": "NAIROBI (Reuters) -African officials and business executives are fretting over the impending expiry of a crucial, duty-free trade programme with the United States at the end of September, without any word from Washington on whether it will be extended or not.…",
    "link": "https://www.thestar.com.my/news/world/2025/09/23/explainer-what-does-the-expiry-of-a-us-trade-deal-mean-for-african-economies",
    "timestamp": "2025-09-23T07:06:00Z"
  },
  {
    "title": "Alternative for Germany's Björn Höcke sees 'common ground' with US",
    "description": "The regional chairman of the far-right Alternative for Germany party in Thuringia points to 'remigration' policies under US President Donald Trump as an example for what he would like to see in Germany.",
    "link": "https://www.thelocal.de/20250923/alternative-for-germanys-bjorn-hocke-sees-common-ground-with-us",
    "timestamp": "2025-09-23T07:02:54Z"
  },
  {
    "title": "Spain's top diplomat dismisses Israeli leader's vow of no Palestinian state, saying it will happen",
    "description": "Spain’s top diplomat dismissed Israeli Prime Minister Benjamin Netanyahu’s statement that there will never be a Palestinian state",
    "link": "https://abcnews.go.com/US/wireStory/spains-top-diplomat-dismisses-israeli-leaders-vow-palestinian-125833921",
    "timestamp": "2025-09-23T07:02:09Z"
  },
  {
    "title": "Kamala Harris breaks silence on Biden dropout, admits she has regrets about her handling of situation",
    "description": "Harris discusses her new book with Rachel Maddow, describing the unprecedented scenario of Biden's late withdrawal from the 2024 presidential race.",
    "link": "https://www.foxnews.com/media/kamala-harris-breaks-silence-biden-dropout-admits-she-has-regrets-about-her-handling-situation",
    "timestamp": "2025-09-23T07:00:51Z"
  },
  {
    "title": "Why ABC brings back Jimmy Kimmel today after its debacle over free speech",
    "description": "Amid free speech controversy, celebrity backlash, PR turmoil, and claims of government pressure, Disney and ABC were forced to end Jimmy Kimmel’s suspension.",
    "link": "https://www.foxnews.com/opinion/why-abc-brings-back-jimmy-kimmel-today-after-its-debacle-over-free-speech",
    "timestamp": "2025-09-23T07:00:45Z"
  },
  {
    "title": "International Enrollment Down at Regional Publics, Small Private Colleges",
    "description": "International Enrollment Down at Regional Publics, Small Private Colleges\n\n \n\n\n \nAshley Mowreader\n\nTue, 09/23/2025 - 03:00 AM\n\nLarge, selective colleges enroll the greatest share of international students. But they’re not the institutions feeling enrollment d…",
    "link": "https://www.insidehighered.com/news/global/international-students-us/2025/09/23/international-enrollment-down-small-regional",
    "timestamp": "2025-09-23T07:00:00Z"
  },
  {
    "title": "What’s So Conservative About Civics, Anyway?",
    "description": "What’s So Conservative About Civics, Anyway?\n\n \n\n\n \nElizabeth Redden\n\nTue, 09/23/2025 - 03:00 AM\n\nEric Hartman asks how colleges can move civics education beyond this hyperpartisan moment.\n \n Byline(s)\r\n\n \n Eric Hartman",
    "link": "https://www.insidehighered.com/opinion/views/2025/09/23/whats-so-conservative-about-civics-anyway-opinion",
    "timestamp": "2025-09-23T07:00:00Z"
  },
  {
    "title": "The imposition of $100,000 on H-1B visa: Extortion, blackmail, or a self-inflicted wound?",
    "description": "The $100,000 H1B visa fee hike, introduced under Trump, was framed as protecting U.S. jobs but risks weakening American innovation, talent inflows, and competitiveness. While India bore the brunt with higher costs and reduced opportunities, it may benefit fro…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-imposition-of-100000-on-h-1b-visa-extortion-blackmail-or-a-self-inflicted-wound/articleshow/124064174.cms",
    "timestamp": "2025-09-23T06:59:21Z"
  },
  {
    "title": "India’s cheap birth control pills in US could vanish under Trump’s 250% tariff threat",
    "description": "Donald Trump's tariff threat jeopardizes affordable Indian medicines in the US. Birth control pills, hypertension, and depression treatments are most vulnerable. India, the world's pharmacy, faces potential export losses. Analysts foresee price hikes and supp…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indias-cheap-birth-control-pills-in-us-could-vanish-under-trumps-250-tariff-threat/articleshow/124064086.cms",
    "timestamp": "2025-09-23T06:57:28Z"
  },
  {
    "title": "Venezuelans in 'reverse migration' pushed to new perils in effort to return home",
    "description": "Venezuelan migrants are attempting a \"reverse migration\" back to South America after facing challenges in the U.S. Thousands have returned since immigration policies tightened under President Donald Trump",
    "link": "https://abcnews.go.com/International/wireStory/venezuelans-reverse-migration-pushed-new-perils-effort-return-125821064",
    "timestamp": "2025-09-23T06:54:23Z"
  },
  {
    "title": "Employee fired after writing 'nonsense' message on cup after customer asked for 'Charlie Kirk drink'",
    "description": "A Starbucks employee has been fired after writing a 'nonsense' message on a cup after a customer asked for 'Charlie Kirk drink'",
    "link": "https://www.ladbible.com/news/us-news/charlie-kirk-starbucks-drink-us-employee-fired-905635-20250923",
    "timestamp": "2025-09-23T06:50:52Z"
  },
  {
    "title": "China’s latest aircraft carrier showcases new fighter jet launch system. Only the US has the same tech | CNN",
    "description": "China’s latest and most capable aircraft carrier has used its new electromagnetic catapult to successfully launch three types of aircraft, according to Chinese state media, which released footage of the launches for the first time to mark the technological br…",
    "link": "https://www.cnn.com/2025/09/23/china/china-aircraft-carrier-launch-system-intl-hnk-ml",
    "timestamp": "2025-09-23T06:47:28Z"
  },
  {
    "title": "The 8 at 8: Tuesday",
    "description": "Trump to address UN later, TikTok accused of ‘quiet layoffs’ in Ireland, and ‘capable actor’ behind Copenhagen Airport drone disruption",
    "link": "https://www.thejournal.ie/morning-news-rundown-tuesday-september-2-6824114-Sep2025/",
    "timestamp": "2025-09-23T06:46:26Z"
  },
  {
    "title": "Kayleigh McEnany’s Pity Party For ICE Agents Melts Down Online",
    "description": "Critics witheringly corrected the former Trump White House press secretary's hot take.",
    "link": "https://www.huffpost.com/entry/kayleigh-mcenany-workers-reaction_n_68d239f0e4b02b5b9fb2c2df",
    "timestamp": "2025-09-23T06:36:49Z"
  },
  {
    "title": "European stocks set to rise after Wall Street sets fresh records",
    "description": "U.S. stocks rallied on Monday, after news that Nvidia plans to invest up to $100 billion in OpenAI.",
    "link": "https://www.cnbc.com/2025/09/23/european-stocks-set-to-rise-after-wall-street-sets-fresh-records.html",
    "timestamp": "2025-09-23T06:33:19Z"
  },
  {
    "title": "‘Craze for going to the US is gone’: IIT Madras director calls Trump’s H-1B visa fee hike a ‘blessing in disguise’",
    "description": "The new visa policy, announced by Trump in a White House statement, significantly raises the cost barrier for companies in the US looking to hire foreign tech workers.",
    "link": "https://indianexpress.com/article/trending/trending-in-india/iit-madras-director-calls-trump-h-1b-visa-fee-hike-a-blessing-in-disguise-10266083/",
    "timestamp": "2025-09-23T06:30:37Z"
  },
  {
    "title": "Jon Stewart said Jimmy Kimmel's return shows Americans must 'fight like hell for this constitutional republic'",
    "description": "Jon Stewart celebrated Jimmy Kimmel's show being brought back, saying Americans need to \"fight like hell\" for their right to free speech.",
    "link": "https://www.businessinsider.com/jon-stewart-jimmy-kimmel-live-fight-for-free-speech-2025-9",
    "timestamp": "2025-09-23T06:28:16Z"
  },
  {
    "title": "Judge rules Trump can't block Rhode Island wind project",
    "description": "Danish offshore wind developer Orsted can restart work on the nearly finished Revolution Wind project off the coast of Rhode Island, a federal judge has ruled, after President Donald Trump's administration halted the project last month.",
    "link": "https://www.rte.ie/news/business/2025/0923/1534833-orsted-rhode-island-project/",
    "timestamp": "2025-09-23T06:27:38Z"
  },
  {
    "title": "Kenvue, Tylenol maker, rebuts Trump’s claim linking painkiller to autism, calls it ‘safest’ for pregnant women; here’s what the company said after US govt’s warning",
    "description": "Kenvue, the maker of Tylenol, has strongly refuted claims made by the Trump administration. These claims link Tylenol use during pregnancy to autism. The company asserts that scientific evidence does not support such a connection. Kenvue, which is a spinoff o…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kenvue-tylenol-maker-rebuts-trumps-claim-linking-painkiller-to-autism-calls-it-safest-for-pregnant-women-heres-what-the-company-said-after-us-govts-warning/articleshow/124063480.cms",
    "timestamp": "2025-09-23T06:26:49Z"
  },
  {
    "title": "STEPHEN MOORE: The Case Against Jerome Powell",
    "description": "Jerome Powell should admit he's in over his head and exit stage left now before he does more harm.",
    "link": "https://dailycaller.com/2025/09/23/opinion-the-case-against-jerome-powell-stephen-moore/",
    "timestamp": "2025-09-23T06:23:08Z"
  },
  {
    "title": "Nvidia to invest up to $100 billion in OpenAI",
    "description": "Nvidia will invest up to $100 billion in OpenAI and supply it with data centre chips, the companies said today, marking a tie-up between two of the highest-profile players in the global artificial intelligence race.",
    "link": "https://www.rte.ie/news/business/2025/0923/1534831-nvidia-to-invest-100-billion-in-openai/",
    "timestamp": "2025-09-23T06:22:37Z"
  },
  {
    "title": "Stars and fellow hosts react to Jimmy Kimmel’s return: ‘Late-nightmare is over’",
    "description": "Disney announces ‘Jimmy Kimmel Live!’ returning on Tuesday night",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-return-reactions-stephen-colbert-seth-meyers-b2831720.html",
    "timestamp": "2025-09-23T06:17:27Z"
  },
  {
    "title": "Zohran Mamdani lands endorsement from Kamala Harris, his biggest yet",
    "description": "Kamala Harris supported Zohran Mamdani for New York City mayor. This is a notable endorsement. Other Democrats are cautious about backing Mamdani. He is a democratic socialist. Harris mentioned other candidates like Barbara Drummond and Helena Moreno. She als…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/zohran-mamdani-lands-endorsement-from-kamala-harris-his-biggest-yet/articleshow/124063327.cms",
    "timestamp": "2025-09-23T06:14:54Z"
  },
  {
    "title": "Harris endorses Mamdani, calls Trump a 'tyrant'",
    "description": "Former United States Vice President Kamala Harris endorsed Zohran Mamdani's candidacy for mayor of New York in an interview with MSNBC and criticized US President Donald Trump, repeatedly calling him ...",
    "link": "https://biztoc.com/x/8da8096da946524e",
    "timestamp": "2025-09-23T06:13:51Z"
  },
  {
    "title": "US envoy: Trump-Xi meeting 'certainly' next year",
    "description": "United States Ambassador to China David Perdue (pictured) said on Tuesday that a meeting between US President Donald Trump and Chinese President Xi Jinping is much more likely to take place early next...",
    "link": "https://biztoc.com/x/296c29967a33444c",
    "timestamp": "2025-09-23T06:13:48Z"
  },
  {
    "title": "Jimmy Fallon Takes Down Trump's Pressure Campaign In Just 7 Words",
    "description": "The \"Tonight Show\" host let Trump's demands for his attorney general speak for themselves.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-trump-pam-bondi-political-opponents_n_68d22c31e4b03fb4d933e903",
    "timestamp": "2025-09-23T06:12:08Z"
  },
  {
    "title": "Hungary Refuses to Stop Russian Oil Imports",
    "description": "Hungary has no intention of suspending Russian oil imports despite pressure on the whole of the European Union from U.S. President Donald Trump and EU pressure on Hungary specifically. “We can’t ensure the safe supply [of energy products] for our country with…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Hungary-Refuses-to-Stop-Russian-Oil-Imports.html",
    "timestamp": "2025-09-23T06:10:38Z"
  },
  {
    "title": "Analysis-Ukraine expects no miracles as Zelenskiy visits US to address UN, meet Trump",
    "description": "NEW YORK (Reuters) -Ukrainian President Volodymyr Zelenskiy will seek more support from allies when he addresses the UN and meets Donald Trump this week, but behind the scenes Kyiv is quietly preparing for a new phase of the war in which it relies more on its…",
    "link": "https://www.thestar.com.my/news/world/2025/09/23/analysis-ukraine-expects-no-miracles-as-zelenskiy-visits-us-to-address-un-meet-trump",
    "timestamp": "2025-09-23T06:08:00Z"
  },
  {
    "title": "The 'terrifying' notion underneath Trump's unproven autism claims",
    "description": "The Trump administration's rhetoric only adds to the noise around autism and will make it harder for the community to feel understood and accepted, write Nas Campanella and Evan Young.",
    "link": "https://www.abc.net.au/news/2025-09-23/trump-unproven-autism-claims-risk-undoing-decades-of-progress/105807344",
    "timestamp": "2025-09-23T06:06:16Z"
  },
  {
    "title": "US pledges to do ‘what is needed’ to support Argentina’s economy",
    "description": "Treasury secretary says US considering measures to stabilise Latin American country amid asset selloff.",
    "link": "https://www.aljazeera.com/economy/2025/9/23/us-pledges-to-do-what-is-needed-to-support-argentinas-economy",
    "timestamp": "2025-09-23T06:05:45Z"
  },
  {
    "title": "Man Charged With Shining Laser Pointer At Marine One With Trump Aboard",
    "description": "The helicopter was airborne near the White House when the incident allegedly occurred.",
    "link": "https://www.huffpost.com/entry/laser-pointer-marine-one-trump_n_68d2371de4b03fb4d933ed4e",
    "timestamp": "2025-09-23T06:03:42Z"
  },
  {
    "title": "What Trump’s $100,000 H-1B Visa Fee Means For Tech Jobs And Workers",
    "description": "President Trump’s new $100,000 H-1B visa fee is drastically changing the immigration policy for skilled foreign workers. The rule applies to new applications, raising alarm across industries while sparking diplomatic tensions with India.",
    "link": "https://www.forbes.com/sites/anishasircar/2025/09/23/what-trumps-100000-h-1b-visa-fee-means-for-tech-jobs-and-workers/",
    "timestamp": "2025-09-23T06:02:43Z"
  },
  {
    "title": "Donald Trump says Tylenol is dangerous during pregnancy: Why this everyday painkiller matters for women",
    "description": "In 2025, President Trump's claims linking Tylenol use during pregnancy to autism sparked widespread panic, despite scientific consensus supporting its safety when used as directed. Experts emphasize that while some studies explore potential links, they don't …",
    "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/donald-trump-says-tylenol-is-dangerous-during-pregnancy-why-this-everyday-painkiller-matters-for-women/articleshow/124063055.cms",
    "timestamp": "2025-09-23T06:01:08Z"
  },
  {
    "title": "The ‘golden billion’ has lost its crown",
    "description": "In economics and sociology, there’s a well-known observation called the Pareto Principle. Named after the Franco-Italian thinker Vilfredo Pareto, it is often summarized as the “80/20 rule”: 20 percent of efforts yield 80 percent of results, while the remainin…",
    "link": "https://www.naturalnews.com/2025-09-23-the-golden-billion-has-lost-its-crown.html",
    "timestamp": "2025-09-23T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s bold vaccine overhaul empowers parents and challenges outdated policies",
    "description": "President Trump proposes altering vaccine schedules to spaced doses, separating the MMR vaccine, eliminating neurotoxins like mercury and delaying hepatitis B until 12 years. Trump and Health Secretary Kennedy link current vaccine protocols to rising autism r…",
    "link": "https://www.naturalnews.com/2025-09-23-trumps-vaccine-overhaul-empowers-parents-challenges-outdated-policies.html",
    "timestamp": "2025-09-23T06:00:00Z"
  },
  {
    "title": "Who wants to be a Milei-aire? Trump ditches America-first to help a mate",
    "description": "For a while, Argentina's Trump-style president Javier Milei was fashionable among right-wing economists. Now an all-too-familiar sight is playing out.\nThe post Who wants to be a Milei-aire? Trump ditches America-first to help a mate appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/09/23/argentina-peso-currency-javier-milei-donald-trump-united-states/",
    "timestamp": "2025-09-23T05:59:40Z"
  },
  {
    "title": "'Paracetamol Is A Proven Safe Drug': Dr Soumya Swaminathan, Former Chief Scientist At WHO",
    "description": "Paracetamol is a proven safe drug and there is no need to panic about its use, according to Dr Soumya Swaminathan, a pediatrician and former Chief Scientist at WHO. Dr Soumya said, 'I see no proven scientific evidence' of linking paracetamol to autism. Accord…",
    "link": "https://www.ndtvprofit.com/science/paracetamol-is-a-proven-safe-drug-dr-soumya-swaminathan-former-chief-scientist-at-who",
    "timestamp": "2025-09-23T05:58:43Z"
  }
]