[
  {
    "title": "Trump appears 'fighting for his life' to stay awake during health event - NewsBreak",
    "description": "Trump appeared unable to keep his eyes open during the conference announcing they were launching a new program that will allow Americans to share personal",
    "link": "https://www.newsbreak.com/share/4151021251095-trump-appears-fighting-for-his-life-to-stay-awake-during-health-event?s=a2&amp;share_destination_id=MzA3ODg1MTc3LTE3NTQwOTY5ODQ4OTA%3D&amp;pd=0KpqzxIY&amp;hl=en_US&amp;send_time=1754096984&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v3%2Cns_foryou_blend_exp_25q3-v3%2Cns_foryou_rank_exp_25q3-v6%2Cns_foryou_model_exp_25q3-v9",
    "timestamp": "2025-08-02T01:10:47Z"
  },
  {
    "title": "Fed Governor Adriana Kugler steps down, giving Trump slot to fill",
    "description": "Governor Adriana Kugler's resignation from the Federal Reserve has created an opportunity for President Trump to nominate a replacement, potentially influencing future interest rate decisions. Trump, critical of current Fed Chair Jerome Powell, expressed enth…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fed-governor-adriana-kugler-steps-down-giving-trump-slot-to-fill/articleshow/123054138.cms",
    "timestamp": "2025-08-02T01:09:12Z"
  },
  {
    "title": "Major public broadcasting group to close after Trump-led funding cuts",
    "description": "The Corporation for Public Broadcasting announces it will cease operations in a massive blow to the public media network in the United States.",
    "link": "https://www.abc.net.au/news/2025-08-02/us-corporation-for-public-broadcasting-to-close/105604428",
    "timestamp": "2025-08-02T01:09:04Z"
  },
  {
    "title": "Chattanooga business owners says tariffs ‘bad idea for the customers’ | Chattanooga Times Free Press",
    "description": "President Donald Trump imposed a flurry of tariffs by executive order ahead of a Friday deadline the White House said was aimed at renegotiating trade agreements with foreign countries and moving more manufacturing to the U.S.",
    "link": "https://www.timesfreepress.com/news/2025/aug/01/chattanooga-business-owners-says-tariffs-bad-idea/",
    "timestamp": "2025-08-02T01:08:13Z"
  },
  {
    "title": "Proposed Canada-US trade deal could still be weeks away, says Ottawa",
    "description": "Ottawa's chief negotiator suggests a U.S.-Canada trade deal remains weeks away, despite Trump's imposition of higher tariffs on Canadian goods. Prime Minister Carney insists on resetting bilateral relations, but negotiations have yielded little progress, with…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/proposed-canada-us-trade-deal-could-still-be-weeks-away-says-ottawa/articleshow/123054079.cms",
    "timestamp": "2025-08-02T01:05:10Z"
  },
  {
    "title": "Millions face $300 monthly hike as SAVE Student Loan interest resumes in August",
    "description": "Millions of Americans enrolled in the SAVE student lan repayment plan must begin repaying their loans after a federal interest pause ends in August 2025. Monthly costs could rise by $300, and interest will now accrue, even for those in forbearance. Borrowers …",
    "link": "https://economictimes.indiatimes.com/news/international/us/millions-americans-student-loan-repayment-august-2025-save-plan-interest-resume-300-monthly/articleshow/123053932.cms",
    "timestamp": "2025-08-02T01:02:21Z"
  },
  {
    "title": "BREAKING: Office of Special Counsel Launches Investigation Into Jack Smith",
    "description": "The Office of Special Counsel has launched an investigation into Jack Smith for possible violations of the Hatch Act. Jack Smith was appointed as Special Counsel in 2022 by Joe Biden’s Attorney General Merrick Garland to investigate Trump just one day after T…",
    "link": "https://freerepublic.com/focus/f-news/4332182/posts",
    "timestamp": "2025-08-02T01:02:03Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shut down after being defunded by Congress, targeted by Trump",
    "description": "The Corporation for Public Broadcasting will shut down. Congress cut its funding. This ends a long era of public media support. President Trump targeted the organisation. The closure impacts local radio and TV. Key programs like 'Sesame Street' benefited. Fun…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/corporation-for-public-broadcasting-to-shut-down-after-being-defunded-by-congress-targeted-by-trump/articleshow/123053952.cms",
    "timestamp": "2025-08-02T00:55:32Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,255",
    "description": "Here are the key events on day 1,255 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/8/2/russia-ukraine-war-list-of-key-events-day-1255",
    "timestamp": "2025-08-02T00:51:51Z"
  },
  {
    "title": "Who is Dmitry Medvedev? Ex-Russian President who has dared Donald Trump, stoked fears of World War 3",
    "description": "Dmitry Medvedev has frequently wielded nuclear threats and lobbed insults at Western leaders on social media. Some observers have argued that with his extravagant rhetoric, Medvedev is seeking to score political points with Putin and Russian military hawks.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-dmitry-medvedev-ex-russian-president-who-has-dared-donald-trump-stoked-fears-of-world-war-3/articleshow/123053855.cms",
    "timestamp": "2025-08-02T00:49:45Z"
  },
  {
    "title": "Trump Claims Fed Chair Is ‘Building a Palace for Himself’ Day After Revealing Plan for $200 Million Golden Ballroom",
    "description": "President Donald Trump accused Federal Reserve Chair Jerome Powell of “building a palace for himself,” saying that Powell is “not going to be there much longer” in an interview Friday with Newsmax’s Rob Finnerty. When asked by Finnerty if it’s possible he wil…",
    "link": "https://www.mediaite.com/media/tv/trump-claims-fed-chair-is-building-a-palace-for-himself-day-after-revealing-plan-for-200-million-golden-ballroom/",
    "timestamp": "2025-08-02T00:48:56Z"
  },
  {
    "title": "'It's a gossip page!' Trump trashes WSJ on right-wing TV after bevy of explosive reports",
    "description": "President Donald Trump launched into an angry tirade about the Wall Street Journal during an interview with Rob Finnerty on the far-right Newsmax cable network Friday evening.Trump is suing the Journal, a right-leaning publication under the umbrella of Rupert…",
    "link": "https://www.rawstory.com/trump-wsj-2673800159/",
    "timestamp": "2025-08-02T00:46:25Z"
  },
  {
    "title": "Trump Says He ‘Most Likely’ Won’t Try To Fire Jerome Powell Because It Would Be ‘Very Disruptive’",
    "description": "President Donald Trump indicated on Friday that he is not inclined to attempt to fire Federal Reserve Chair Jerome Powell.\nThe post Trump Says He ‘Most Likely’ Won’t Try To Fire Jerome Powell Because It Would Be ‘Very Disruptive’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-says-he-most-likely-wont-try-to-fire-jerome-powell-because-it-would-be-very-disruptive/",
    "timestamp": "2025-08-02T00:45:52Z"
  },
  {
    "title": "Trump Fired the Person in Charge of the Job Numbers. It Brings Him Closer to a Sinister Goal.",
    "description": "Yes, Trump firing the BLS commissioner is bad. Really bad.",
    "link": "https://slate.com/business/2025/08/july-jobs-report-trump-fires-bls-commissioner-for-telling-the-truth-about-his-economy.html",
    "timestamp": "2025-08-02T00:41:27Z"
  },
  {
    "title": "US Army helicopter in deadly Washington crash had technical issues",
    "description": "An investigative hearing into a deadly mid-air collision of a US Army helicopter and a passenger plane that killed 67 people in Washington has revealed a...",
    "link": "https://www.yahoo.com/news/articles/us-army-helicopter-deadly-washington-003840966.html",
    "timestamp": "2025-08-02T00:38:40Z"
  },
  {
    "title": "Democratic states sue Trump admin over ending sex change surgeries for minors",
    "description": "Over a dozen states sue Trump administration over policies threatening providers of sex change procedures for people under 19 with criminal investigations.",
    "link": "https://www.foxnews.com/us/democratic-states-sue-trump-admin-ending-sex-change-surgeries-minors",
    "timestamp": "2025-08-02T00:38:27Z"
  },
  {
    "title": "Wall Street tumbles as Trump tariffs and weak jobs data rattle markets",
    "description": "US stocks plunge as Trump tariffs, weak jobs data, and Amazon’s earnings miss shake investor confidence; S&P sees biggest one-day drop since May.",
    "link": "https://www.thehindubusinessline.com/markets/wall-street-tumbles-as-trump-tariffs-and-weak-jobs-data-rattle-markets/article69885904.ece",
    "timestamp": "2025-08-02T00:35:36Z"
  },
  {
    "title": "Trump steps up attacks on Fed’s independence amid interest rates row",
    "description": "US president called on top Fed officials to seize control from chair Jerome Powell if he fails to cut interest rates",
    "link": "https://finance.yahoo.com/news/trump-steps-attacks-fed-independence-145727003.html",
    "timestamp": "2025-08-02T00:35:28Z"
  },
  {
    "title": "India reportedly halting Russian oil would be 'a good step', says Trump, as New Delhi defends energy security",
    "description": "US President Donald Trump suggested India might halt Russian oil purchases, calling it a positive step. However, India defended its right to formulate energy policies based on national interests and market dynamics. Amidst this, the US imposed tariffs on Indi…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-reportedly-halting-russian-oil-would-be-a-good-step-says-trump-as-new-delhi-defends-energy-security/articleshow/123053687.cms",
    "timestamp": "2025-08-02T00:34:04Z"
  },
  {
    "title": "Trump’s new tariffs give some countries a break, while shares and US dollar sink",
    "description": "Trump’s new tariffs give some countries a break, while shares and US dollar sinklocal10.com",
    "link": "https://www.local10.com//business/2025/08/01/trumps-new-tariffs-give-some-countries-a-break-while-shares-and-us-dollar-sink/",
    "timestamp": "2025-08-02T00:33:30Z"
  },
  {
    "title": "Trump slaps 25% tariff on all Indian goods; exports worth $85 billion at risk",
    "description": "The United States has levied high tariffs on India, potentially affecting a significant portion of Indian exports. This move places India among the most heavily penalized nations under the new tariff regime. Ongoing trade negotiations between India and the US…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-slaps-25-tariff-on-all-indian-goods-exports-worth-85-billion-at-risk/articleshow/123050948.cms",
    "timestamp": "2025-08-02T00:30:00Z"
  },
  {
    "title": "US, NATO developing novel funding mechanism for Ukraine weapons transfers",
    "description": "The U.S. and NATO are working on a novel approach to supply Ukraine with weapons using funds from NATO countries to pay for the purchase or transfer of U.S. arms, according to three sources familiar with the matter. The renewed transatlantic cooperation on Uk…",
    "link": "https://freerepublic.com/focus/f-news/4332176/posts",
    "timestamp": "2025-08-02T00:23:43Z"
  },
  {
    "title": "Trump orders nuclear submarines moved after Russian 'provocative statements'",
    "description": "U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in &quot;the appropriate regions&quot; in response to remarks from former Russian President Dmitry Medvedev about the risk of war between the nuclear-armed adver…",
    "link": "https://japantoday.com/category/world/trump-orders-nuclear-submarines-moved-after-russian-%27provocative-statements%271",
    "timestamp": "2025-08-02T00:22:42Z"
  },
  {
    "title": "ICE Agents Attacked During Migration Operation in Colorado",
    "description": "A new assault on immigration authorities has reignited concern across the country.\nThe post ICE Agents Attacked During Migration Operation in Colorado appeared first on The Gateway Pundit.",
    "link": "https://gatewayhispanic.com/video/ice-agents-attacked-during-migration-operation-colorado/",
    "timestamp": "2025-08-02T00:20:31Z"
  },
  {
    "title": "India Aghast at Donald Trump’s ‘Dead’ Economy Jibe, 25% Tariffs",
    "description": "",
    "link": "https://biztoc.com/x/a1fc31eca45d0674",
    "timestamp": "2025-08-02T00:19:53Z"
  },
  {
    "title": "Trump says he'd fire Powell, but fears market fallout",
    "description": "United States President Donald Trump said in an interview with Newsmax that he would remove Federal Reserve Chair Jerome Powell \"in a heartbeat\" if he believed it wouldn't disrupt financ...",
    "link": "https://biztoc.com/x/15416c7df16df624",
    "timestamp": "2025-08-02T00:19:42Z"
  },
  {
    "title": "India Aghast at Donald Trump’s ‘Dead’ Economy Jibe, 25% Tariffs",
    "description": "Shock, dismay and angst swept across India as businesses, policymakers and citizens digested US President Donald Trump’s sharp remarks and a surprise 25% tariff rate earlier this week.",
    "link": "https://financialpost.com/pmn/business-pmn/india-aghast-at-donald-trumps-dead-economy-jibe-25-tariffs",
    "timestamp": "2025-08-02T00:18:15Z"
  },
  {
    "title": "Epstein associate Ghislaine Maxwell moved to Texas prison",
    "description": "Maxwell, the ex-girlfriend of disgraced financier Jeffrey Epstein, is serving a 20-year prison sentence on child sex trafficking charges. Her prison transfer comes after she met a top US Justice Department official.",
    "link": "https://www.dw.com/en/epstein-associate-ghislaine-maxwell-moved-to-texas-prison/a-73504250",
    "timestamp": "2025-08-02T00:18:00Z"
  },
  {
    "title": "EXCLUSIVE: DOJ Official Who Approved $2 Million Payout To Disgraced Russia Hoaxers Identified As Left-Wing Activist Brian Netter",
    "description": "Netter now works for a group chaired by Marc Elias, who helped run the Russia collusion hoax.The Department of Justice official who signed off on $2 million in taxpayer-funded payments to disgraced Russia collusion hoax participants left the Department of Jus…",
    "link": "https://freerepublic.com/focus/f-news/4332175/posts",
    "timestamp": "2025-08-02T00:17:16Z"
  },
  {
    "title": "Federal Reserve Governor Kugler resigns, giving Trump key vacancy to fill",
    "description": "Fed Governor Adriana Kugler resigns early, giving Trump a chance to appoint her successor. Her exit may shape future Fed leadership and rate policy direction.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/federal-reserve-governor-kugler-resigns-giving-trump-key-vacancy-to-fill/article69885899.ece",
    "timestamp": "2025-08-02T00:14:10Z"
  },
  {
    "title": "Who is Erika McEntarfer, the Bureau of Labor Statistics commissioner fired by Trump?",
    "description": "Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, has been fired after releasing a jobs report that angered President Donald Trump",
    "link": "https://biztoc.com/x/fcb242807f2dcfee",
    "timestamp": "2025-08-02T00:13:10Z"
  },
  {
    "title": "President Trump Orders Repositioning of Two Nuclear Subs After Medvedev Threatens U.S.",
    "description": "\"In a late-night post, Trump confirmed he ordered two nuclear subs to deploy 'in the appropriate regions' after what he called foolish and inflammatory statements by Medvedev...The era of weakness is over\"\nThe post President Trump Orders Repositioning of Two …",
    "link": "https://legalinsurrection.com/2025/08/president-trump-orders-repositioning-of-two-nuclear-subs-after-medvedev-threatens-u-s/",
    "timestamp": "2025-08-02T00:12:30Z"
  },
  {
    "title": "Nobel-winning economist Paul Krugman warns US faces Venezuela-style collapse under Trump",
    "description": "Nobel Prize-winning economist turned political commentator Paul Krugman tore into President Donald Trump on MSNBC for firing the nation's chief labor statistics analyst for reporting weak jobs numbers — and told anchor Ari Melber this is the same blueprint th…",
    "link": "https://www.rawstory.com/paul-krugman-2673800091/",
    "timestamp": "2025-08-02T00:11:52Z"
  },
  {
    "title": "Ex-Trump Commissioner Warns of 'Dangerous Precedent' After New Firing",
    "description": "The removal followed the release of bleak job figures as Trump accused the numbers of being \"rigged.\"",
    "link": "https://www.newsweek.com/ex-trump-commissioner-warns-dangerous-precedent-after-new-firing-2107884",
    "timestamp": "2025-08-02T00:09:24Z"
  },
  {
    "title": "Trump tariffs: Asian reaction to new US 'reciprocal' rates",
    "description": "TOKYO -- Hours ahead of his Aug. 1 deadline for new \"reciprocal\" tariffs, U.S. President Donald Trump has announced the rates he is going to impose on imports of goods from dozens of countries.\nThe new rates include 25% on India, 20% on Taiwan and 19% on Thai…",
    "link": "https://biztoc.com/x/bbb7efe0f627756e",
    "timestamp": "2025-08-02T00:08:21Z"
  },
  {
    "title": "Kyiv mourns after deadliest attack in a year kills 31 people in Ukraine, including 5 children",
    "description": "The Ukrainian capital Kyiv observed an official day of mourning Friday, a day after a Russian drone and missile attack on the city killed 31 people, including five children, and injured more than 150, officials said. The youngest victim in Thursday’s strikes …",
    "link": "https://japantoday.com/category/world/kyiv-mourns-after-deadliest-attack-in-a-year-kills-31-people-in-ukraine-including-5-children",
    "timestamp": "2025-08-02T00:07:20Z"
  },
  {
    "title": "US job growth slumps amid Trump’s tariff turbulence",
    "description": "US hiring slumps to 73,000 in July amid Trump’s trade policies; unemployment ticks up, markets tumble, and economists warn of a harder landing ahead.",
    "link": "https://www.thehindubusinessline.com/news/world/us-job-growth-slumps-amid-trumps-tariff-turbulence/article69885893.ece",
    "timestamp": "2025-08-02T00:04:01Z"
  },
  {
    "title": "U.S.-Russia nuclear war: Is World War 3 happening? What we know so far",
    "description": "Russia and the USA have exchanged nuclear threats which have raised apprehensions over whether there will be World War III or not.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-russia-nuclear-war-is-world-war-3-happening-what-we-know-so-far/articleshow/123053170.cms",
    "timestamp": "2025-08-02T00:01:06Z"
  },
  {
    "title": "Bruce Ramer on CPB Shutdown: ‘A Good Part of Public Radio and Broadcasting Will Be Out of Business’",
    "description": "The repercussions will be enormous. Venerable entertainment lawyer Bruce Ramer, of Gang Tyre Ramer Brown and Passman, tells Variety that the shuttering of the Corporation for Public Broadcasting will have deep impact on public media across the country. “The p…",
    "link": "https://variety.com/2025/tv/news/bruce-ramer-cpb-shutdown-sad-day-public-pbs-npr-1236477111/",
    "timestamp": "2025-08-02T00:00:53Z"
  },
  {
    "title": "World economies reel from Trump's tariffs punch",
    "description": "Stock markets in Hong Kong, London and New York slumped as they digested the turmoil, while weak U.S. employment data added to worries.",
    "link": "https://www.japantimes.co.jp/business/2025/08/02/economy/global-economy-trump-tariffs/",
    "timestamp": "2025-08-01T23:56:00Z"
  },
  {
    "title": "Who is Erika McEntarfer, the Bureau of Labor Statistics commissioner fired by Trump?",
    "description": "Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, has been fired after releasing a jobs report that angered President Donald Trump",
    "link": "https://abcnews.go.com/Business/wireStory/erika-mcentarfer-bureau-labor-statistics-commissioner-fired-trump-124297038",
    "timestamp": "2025-08-01T23:50:31Z"
  },
  {
    "title": "Donald Trump's Effort to Overturn Birthright Citizenship Struggles in Court",
    "description": "President Donald Trump's executive order has faced repeated roadblocks, but the administration continues appealing up to the Supreme Court.",
    "link": "https://www.newsweek.com/donald-trump-effort-overturn-birthright-citizenship-struggles-court-2107880",
    "timestamp": "2025-08-01T23:47:11Z"
  },
  {
    "title": "Trump says he moved U.S. nuclear subs after barbs with Russia",
    "description": "President Donald Trump said the U.S. is moving two nuclear submarines to respond to what he called \"highly provocative statements” from former Russian President Dmitry Medvedev.",
    "link": "https://www.japantimes.co.jp/news/2025/08/02/world/politics/trump-us-nuclear-submarines-russia/",
    "timestamp": "2025-08-01T23:46:00Z"
  },
  {
    "title": "Enough nukes to track Trump’s subs, says Russian lawmaker",
    "description": "Russia mocks Trump’s submarine orders, says US subs are already tracked. Lavrov, lawmakers urge diplomacy, even as markets dip amid rising nuclear rhetoric.",
    "link": "https://www.thehindubusinessline.com/news/world/enough-nukes-to-track-trumps-subs-says-russian-lawmaker/article69885597.ece",
    "timestamp": "2025-08-01T23:45:28Z"
  },
  {
    "title": "EXCLUSIVE: Epstein Sex Slave Virginia Giuffre's Revealed Horrors Of Pedo's Nude Massage Trials In Palm Beach Arranged By Jailed Madame Ghislaine Maxwell In Chilling Unpublished Memoir",
    "description": "In a disturbing never-before-seen memoir, Jeffrey Epstein survivor Virginia Giuffre details how Ghislaine Maxwell arranged nude massage 'tryouts' at his mansion.",
    "link": "https://radaronline.com/p/epstein-virginia-giuffre-unpublished-memoir-ghislaine-maxwell-massage-details/",
    "timestamp": "2025-08-01T23:45:00Z"
  },
  {
    "title": "Conor McGregor officially returns to UFC drug testing pool in potential step toward comeback",
    "description": "McGregor submitted his first UFC test of 2025",
    "link": "https://www.cbssports.com/mma/news/conor-mcgregor-officially-returns-to-ufc-drug-testing-pool-in-potential-step-toward-comeback/",
    "timestamp": "2025-08-01T23:44:25Z"
  },
  {
    "title": "Ghislaine Maxwell Moved to Lower-Security Texas Prison Where She’ll Be Housed With Two Famous Inmates",
    "description": "Jeffrey Epstein's right-hand woman, incarcerated for 20 years and teeming with knowledge about the late financier, met with a Department of Justice liaison...",
    "link": "https://www.hollywoodreporter.com/news/general-news/ghislaine-maxwell-moved-texas-prison-jeffrey-epstein-1236336169/",
    "timestamp": "2025-08-01T23:41:56Z"
  },
  {
    "title": "Court allows Trump to end union bargaining for federal workers",
    "description": "(Reuters) -A federal appeals court on Friday lifted a judge's order blocking U.S. President Donald Trump's administration from stripping hundreds of...",
    "link": "https://www.yahoo.com/news/articles/court-allows-trump-end-union-234002927.html",
    "timestamp": "2025-08-01T23:40:02Z"
  },
  {
    "title": "No Wonder They All Covered up Biden's Health - One Aide Was Reportedly Set to Get $4 Million Bonus if Biden Was Re-Elected",
    "description": "No Wonder They All Covered up Biden's Health - One Aide Was Reportedly Set to Get $4 Million Bonus if Biden Was Re-Electedwesternjournal.com",
    "link": "https://www.westernjournal.com/no-wonder-covered-bidens-health-one-aide-reportedly-set-get-4-million-bonus-biden-re-elected/",
    "timestamp": "2025-08-01T23:40:00Z"
  },
  {
    "title": "Trump and the dollar are doing something we saw just before the October 1987 stock market crash",
    "description": "The current political environment and currency market disruption are disturbingly similar.",
    "link": "https://www.marketwatch.com/story/weve-seen-how-stocks-react-to-white-house-pressure-for-low-interest-rates-and-a-weak-dollar-in-october-1987-833d64b0",
    "timestamp": "2025-08-01T23:38:00Z"
  },
  {
    "title": "Trump's long history of bashing jobs report numbers dates back to 2016: ANALYSIS",
    "description": "Trump's history of criticizing the Bureau of Labor Statistics' jobs report has surfaced in the wake of his decision to fire commissioner Erika McEntarfer on Friday.",
    "link": "https://abcnews.go.com/US/trumps-long-history-bashing-jobs-report-numbers-dates/story?id=124294975",
    "timestamp": "2025-08-01T23:36:05Z"
  },
  {
    "title": "Trump orders nuclear submarine deployment after Medvedev’s threats escalate",
    "description": "Trump moves nuclear subs in response to Medvedev’s threats, shortens Russia’s ceasefire deadline to 10 days, and warns of sanctions if no progress is made.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-orders-nuclear-submarine-deployment-after-medvedevs-threats-escalate/article69885037.ece",
    "timestamp": "2025-08-01T23:35:49Z"
  },
  {
    "title": "Trump Administration Suspends $200 Million in Research Funding to UCLA",
    "description": "The Trump administration withdrew $200 million in federal research funding to the University of California Los Angeles (UCLA) after a Department of Justice (DOJ) finding Thursday that it had violated the civil rights of Jewish students.\nThe post Trump Adminis…",
    "link": "https://www.breitbart.com/education/2025/08/01/trump-admin-suspends-200-million-in-research-funding-ucla/",
    "timestamp": "2025-08-01T23:35:36Z"
  },
  {
    "title": "A Fed governor is resigning, opening a spot for a Trump appointee",
    "description": "A member of the Federal Reserve’s Board of Governors announced Friday that she is resigning several months before the end of her term, handing President Donald Trump an early opportunity to fill a key vacancy.\nFed Governor Adriana Kugler is stepping down from…",
    "link": "https://biztoc.com/x/21dc55daf41caf4f",
    "timestamp": "2025-08-01T23:35:25Z"
  },
  {
    "title": "Jobs Take Massive Downward Revisions: Uncertainty And Risk Ride High",
    "description": "Jobs saw a -258K revision. Trump changes tariffs again. Q2 GDP was up for all the wrong reasons. Wages ran hot. Manufacturing is hurting. Nobody knows what will happen.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/08/01/jobs-take-massive-downward-revisions-uncertainty-and-risk-ride-high/",
    "timestamp": "2025-08-01T23:34:47Z"
  },
  {
    "title": "Sensible And Steely: How Mexico's Sheinbaum Has Dealt With Trump",
    "description": "A combination of tact and tenacity is credited for Mexican President Claudia Sheinbaum's successful dealings with US counterpart Donald Trump, most recently convincing him to delay a sky-high import tariff meant to come into effect Friday.",
    "link": "https://www.ibtimes.com/sensible-steely-how-mexicos-sheinbaum-has-dealt-trump-3780039",
    "timestamp": "2025-08-01T23:30:15Z"
  },
  {
    "title": "Ghislaine Maxwell Subpoena Update as House Waits on Supreme Court",
    "description": "Maxwell's legal team warned she would invoke her Fifth Amendment right against self-incrimination unless certain conditions were met.",
    "link": "https://www.newsweek.com/ghislaine-maxwell-update-house-subpoena-epstein-files-2107886",
    "timestamp": "2025-08-01T23:30:10Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shut down in 2026 after loss of federal funding",
    "description": "The Corporation for Public Broadcasting will shut down in early 2026 due to funding cuts by Congress. Founded in 1967, CPB has supported NPR and PBS, but the loss of federal aid poses risks to local stations and children's programming.",
    "link": "https://www.livemint.com/companies/corporation-for-public-broadcasting-to-shut-down-in-2026-after-loss-of-federal-funding-11754089996015.html",
    "timestamp": "2025-08-01T23:26:12Z"
  },
  {
    "title": "Epstein files: Where is Jeffrey Epstein's ex-girlfriend Ghislaine Maxwell now?",
    "description": "Jeffrey Epstein's former girlfriend Ghislaine Maxwell’s case has been the subject of heightened public focus since an outcry over the Justice Department's statement last month saying that it would not be releasing any additional documents from the Epstein sex…",
    "link": "https://economictimes.indiatimes.com/news/international/us/epstein-files-where-is-jeffrey-epsteins-ex-girlfriend-ghislaine-maxwell-now/articleshow/123052638.cms",
    "timestamp": "2025-08-01T23:25:51Z"
  },
  {
    "title": "Talks with Trump’s team constructive before boosted tariff announced, ambassador says",
    "description": "WASHINGTON — Canada’s ambassador to the United States said much progress has been made with her American counterparts on trade _ despite President Donald Trump’s decision to boost tariffs on Canada to 35 per cent on Friday. Kirsten Hillman, who also serves as…",
    "link": "https://financialpost.com/pmn/talks-with-trumps-team-constructive-before-boosted-tariff-announced-ambassador-says",
    "timestamp": "2025-08-01T23:25:35Z"
  },
  {
    "title": "Breitbart Business Digest: Trump Vindicated by Jobs Slump; Powell Humiliated",
    "description": "The July jobs report was a disaster for the American worker, the U.S. economy, the Federal Reserve, and Jerome Powell.\nThe post Breitbart Business Digest: Trump Vindicated by Jobs Slump; Powell Humiliated appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/08/01/breitbart-business-digest-trump-vindicated-by-jobs-slump-powell-humiliated/",
    "timestamp": "2025-08-01T23:25:03Z"
  },
  {
    "title": "A MAGA Attorney Hired Epstein's Lawyer for His 'Valuable' Experience (Shane Harris/The Atlantic)",
    "description": "Shane Harris / The Atlantic:\nA MAGA Attorney Hired Epstein's Lawyer for His ‘Valuable’ Experience  —  A firm that represents Pete Hegseth and once represented Donald Trump now employs the co-executor of the disgraced financier's estate.  —  in the summer of 2…",
    "link": "https://www.memeorandum.com/250801/p126",
    "timestamp": "2025-08-01T23:25:01Z"
  },
  {
    "title": "Trump Says He Moved US Nuclear Subs After Barbs With Russia",
    "description": "President Donald Trump said the US is moving two nuclear submarines to respond to what he called “highly provocative statements” from former Russian President Dmitry Medvedev.\n“I have ordered two Nuclear Submarines to be positioned in the appropriate regions,…",
    "link": "https://biztoc.com/x/2b0cc8351a56ddc9",
    "timestamp": "2025-08-01T23:24:23Z"
  },
  {
    "title": "Kevin O’Leary Criticizes Trump for Canning Jobs Data Official: ‘You Don’t Shoot the Messenger’",
    "description": "Kevin O’Leary, the chairman of O’Leary Ventures, joined Friday’s edition of CNN’s The Arena with Kasie Hunt to make clear that he disapproved of President Donald Trump’s decision to “whack” the Commissioner of the Bureau of Labor Statistics, saying, “You don’…",
    "link": "https://www.mediaite.com/media/tv/kevin-oleary-criticizes-trump-for-canning-jobs-data-official-you-dont-shoot-the-messenger/",
    "timestamp": "2025-08-01T23:22:35Z"
  },
  {
    "title": "US Slaps 25% Tariff on Indian Goods",
    "description": "WASHINGTON/NEW DELHI, Aug 1: US President Donald Trump unveiled sweeping new tariffs on dozens of countries including a steep 25 per cent for India, marking a new era of American protectionism and triggering fears of fresh turbulence in trade across the globe…",
    "link": "https://thehillstimes.in/international/us-slaps-25-tariff-on-indian-goods",
    "timestamp": "2025-08-01T23:20:00Z"
  },
  {
    "title": "Corporation for Public Broadcasting to shutter following Trump-era cuts",
    "description": "President Trump has called public media a 'monstrosity' that deserves to be defunded, despite millions of US viewers.",
    "link": "https://www.aljazeera.com/news/2025/8/1/corporation-for-public-broadcasting-to-shutter-following-trump-era-cuts",
    "timestamp": "2025-08-01T23:19:42Z"
  },
  {
    "title": "In Boost to 'Dictator' Bukele, El Salvador Abolishes Presidential Term Limits",
    "description": "El Salvador's Legislative Assembly—which is controlled by Salvadoran President Nayib Bukele's New Ideas party—on Thursday approved a series of constitutional reforms, including abolition of presidential term limits, that critics warned pose a grave threat to …",
    "link": "https://www.commondreams.org/news/bukele-term-limits",
    "timestamp": "2025-08-01T23:19:37Z"
  },
  {
    "title": "Economic Reality Bites Trump and His Protectionist Trade Policies",
    "description": "The White House promised that tariffs would make America boom. But job growth has stalled and the President has been reduced to firing an official scorekeeper.",
    "link": "https://www.newyorker.com/news/the-financial-page/economic-reality-bites-trump-and-his-protectionist-trade-policies",
    "timestamp": "2025-08-01T23:17:41Z"
  },
  {
    "title": "Trump Admin Moves To Curb ‘Environmentally Damaging’ Green Energy Projects",
    "description": "The DOI will be mindful of energy projects' capacity density and the environmental impacts before permitting them, singling out wind and solar.",
    "link": "https://dailycaller.com/2025/08/01/trump-admin-moves-to-curb-environmentally-damaging-green-energy-projects/",
    "timestamp": "2025-08-01T23:17:07Z"
  },
  {
    "title": "Vance: Trump can fire who he wants",
    "description": "United States Vice President JD Vance backed President Donald Trump's decision to remove Bureau of Labor Statistics (BLS) Commissioner Erika McEntarfer, NBC News reported, citing his spokesperson ...",
    "link": "https://biztoc.com/x/ace99f970ea83e0a",
    "timestamp": "2025-08-01T23:13:23Z"
  },
  {
    "title": "US sanctions force vessels with Russian oil to divert from India, sources say",
    "description": "At least two vessels loaded with Russian oil bound for refiners in India have diverted to other destinations following new U.S. sanctions, trade sources said, and LSEG trade flows showed. The U.S. Treasury Department this week imposed sanctions on more than 1…",
    "link": "https://freerepublic.com/focus/f-news/4332166/posts",
    "timestamp": "2025-08-01T23:13:09Z"
  },
  {
    "title": "Who is Erika McEntarfer, the Bureau of Labor Statistics commissioner fired by Trump?",
    "description": "Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, has been fired after releasing a jobs report that angered President Donald Trump.",
    "link": "https://www.clickondetroit.com/news/politics/2025/08/01/who-is-erika-mcentarfer-the-bureau-of-labor-statistics-commissioner-fired-by-trump/",
    "timestamp": "2025-08-01T23:12:51Z"
  },
  {
    "title": "Republican Senators raise concerns about Trump's firing of BLS Commissioner",
    "description": "Some Republican Senators have expressed concern about President Donald Trump’s decision Friday to fire the head of the Bureau of Labor Statistics hours after the release of the July jobs report",
    "link": "https://www.nbcnews.com/politics/donald-trump/republican-senators-raise-concerns-trumps-firing-bls-commissioner-rcna222584",
    "timestamp": "2025-08-01T23:11:10Z"
  },
  {
    "title": "Source: United Nations Continues to Struggle to Deliver Aid in Gaza",
    "description": "The United Nations is continuing to struggle to deliver aid to Palestinians in Gaza, leaving hundreds of truckloads of material at the border, while the Gaza Humanitarian Foundation (GHF) continues to succeed.\nThe post Source: United Nations Continues to Stru…",
    "link": "https://www.breitbart.com/middle-east/2025/08/01/source-united-nations-continues-to-struggle-to-deliver-aid-in-gaza/",
    "timestamp": "2025-08-01T23:09:59Z"
  },
  {
    "title": "Who is Erika McEntarfer, the Bureau of Labor Statistics commissioner fired by Trump?",
    "description": "Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, has been fired after releasing a jobs report that angered President Donald Trump. Trump announced her dismissal on his Truth Social platform, accusing her of manipulating numbers without pr…",
    "link": "https://www.seattlepi.com/news/politics/article/who-is-erika-mcentarfer-the-bureau-of-labor-20798677.php",
    "timestamp": "2025-08-01T23:09:48Z"
  },
  {
    "title": "Klobuchar: Dems Polling Low Because of Trump's 'Chaos' and 'Corruption'",
    "description": "Friday on CNN's \"The Arena,\" Sen. Amy Klobuchar (D-MN) said Democrats were polling low because voters are overwhelmed by President Donald Trump's \"chaos\" and \"corruption.\"\nThe post Klobuchar: Dems Polling Low Because of Trump’s ‘Chaos’ and ‘Corruption’ appear…",
    "link": "https://www.breitbart.com/clips/2025/08/01/klobuchar-dems-polling-low-because-of-trumps-chaos-and-corruption/",
    "timestamp": "2025-08-01T23:09:04Z"
  },
  {
    "title": "Smithsonian museum removes references to Trump impeachment",
    "description": "US News: The Smithsonian's National Museum of American History removed a label referencing Donald Trump's two impeachments last month following pressure from t.",
    "link": "https://timesofindia.indiatimes.com/world/us/smithsonian-museum-removes-references-to-trump-impeachment/articleshow/123052641.cms",
    "timestamp": "2025-08-01T23:08:32Z"
  },
  {
    "title": "Hulk Hogan Death Certificate Released",
    "description": "Hulk Hogan's always going to be remembered as one of the most famous wrestlers of all time ... and that even holds true on his death certificate. TMZ Sports obtained the certification of death for Hulk ... and as you can see, the document lists his…",
    "link": "https://www.tmz.com/2025/08/01/hulk-hogan-death-certificate/",
    "timestamp": "2025-08-01T23:08:12Z"
  },
  {
    "title": "The enforcer that could break up Apple and Google is facing upheaval",
    "description": "The sudden firing of two high-ranking antitrust officials this week is signaling upheaval at an agency responsible for arguing some of the biggest tech monopoly cases in decades. Two top deputies to Department of Justice Antitrust Division chief Gail Slater w…",
    "link": "https://www.theverge.com/policy/717303/justice-department-antitrust-division-slater-alford-rinner-firing",
    "timestamp": "2025-08-01T23:06:06Z"
  },
  {
    "title": "Donald Trump says he heard India may stop buying oil from Russia: 'Good step’",
    "description": "US President Donald Trump on Saturday said that he had heard that India might no longer buy oil from Russia, though he acknowledged he was not certain about the claim. \"I understand that India is no longer going to be buying oil from Russia. That's what I hea…",
    "link": "https://freerepublic.com/focus/f-news/4332163/posts",
    "timestamp": "2025-08-01T23:05:05Z"
  },
  {
    "title": "Trump removes official overseeing jobs data after dismal employment report",
    "description": "President Donald Trump on Friday had his team remove the head of the agency that produces the monthly jobs figures, after a weak report showed hiring slowed and was much weaker in April and May than previously reported.",
    "link": "https://www.wsls.com/news/politics/2025/08/01/trump-seeks-to-fire-official-overseeing-jobs-data-after-weak-employment-report/",
    "timestamp": "2025-08-01T23:04:21Z"
  },
  {
    "title": "Montana health insurers request double-digit rate increase for 2026",
    "description": "One company suggested an average 30% rate increase for individual plans purchased through the federal Marketplace.",
    "link": "http://montanafreepress.org/2025/08/01/montana-health-insurers-propose-double-digit-rate-increase-for-2026/",
    "timestamp": "2025-08-01T23:03:31Z"
  },
  {
    "title": "Trump Gets Rid of Those Pesky Statistics",
    "description": "The numbers were simply not patriotic enough.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/trump-statistics-bureau-labor/683749/",
    "timestamp": "2025-08-01T23:03:00Z"
  },
  {
    "title": "Trump increases tariff on Canada to 35% from 25%, cites fentanyl",
    "description": "U.S. President Donald Trump on Thursday signed an executive order increasing tariffs on Canadian goods to 35% from 25% on all products not covered by the U.S.-Mexico-Canada trade agreement, the White House said. Goods transshipped to another country to evade …",
    "link": "https://japantoday.com/category/world/trump-increases-tariff-on-canada-to-35-from-25-cites-fentanyl1",
    "timestamp": "2025-08-01T23:02:37Z"
  },
  {
    "title": "GOP lawmaker confronted with clip of 'frustrated' constituents booing and shouting at him",
    "description": "A Wisconsin Republican was confronted Friday afternoon with shouts and boos from his own constituents, irate over Gaza and President Donald Trump's agenda.Rep. Bryan Steil joined CNN's Phil Mattingly on \"The Lead\" to go over what happened Thursday. Mattingly …",
    "link": "https://www.rawstory.com/bryan-steil-2673800040/",
    "timestamp": "2025-08-01T23:01:46Z"
  },
  {
    "title": "Colbert fails to ask Harris about Biden decline, avoids her involvement in Trump's '60 Minutes' lawsuit",
    "description": "Outgoing \"Late Show\" host Stephen Colbert gave a fawning interview with former Vice President Kamala Harris, who is out promoting her new book about her failed presidential bid.",
    "link": "https://www.foxnews.com/media/colbert-fails-ask-harris-about-biden-decline-avoids-her-involvement-trumps-60-minutes-lawsuit",
    "timestamp": "2025-08-01T23:00:18Z"
  },
  {
    "title": "The Corp for Public Broadcasting, Which Funds NPR and PBS, Will Close its Doors",
    "description": "Every Republican presidential administration has attempted to defund CPB. ... One has finally succeeded.\nThe post The Corp for Public Broadcasting, Which Funds NPR and PBS, Will Close its Doors first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/the-corp-for-public-broadcasting-which-funds-npr-and-pbs-will-close-its-doors/",
    "timestamp": "2025-08-01T23:00:09Z"
  },
  {
    "title": "New Tariffs Threaten American Battery Production",
    "description": "Trump-era clean energy policies are slamming the breaks on the United States’ battery war with China. While lithium-ion batteries were invented in the United States, China has been outpacing the nation in terms of both battery manufacturing and technological …",
    "link": "https://oilprice.com/Energy/Energy-General/New-Tariffs-Threaten-American-Battery-Production.html",
    "timestamp": "2025-08-01T23:00:00Z"
  },
  {
    "title": "Trump moves nuclear submarines towards Russia",
    "description": "Donald Trump announced that he had ordered the deployment of two nuclear submarines towards Russia in response to threats from the country’s former president. The US president said he was sending the vessels to “appropriate regions” in a move that broke decad…",
    "link": "https://freerepublic.com/focus/f-news/4332162/posts",
    "timestamp": "2025-08-01T22:58:56Z"
  },
  {
    "title": "Some Edmonton builders see up to 20% cost increases as tariff war continues",
    "description": "Construction experts say it's too soon to say how swiftly Edmonton's industry will be hit as U.S. president Donald Trump unveils a new set of tariffs — but some builders say they've had to deal with sharp increases of up to 20 per cent on supplies.",
    "link": "https://www.cbc.ca/news/canada/edmonton/some-edmonton-builders-see-up-to-20-cost-increases-as-tariff-war-continues-1.7600082",
    "timestamp": "2025-08-01T22:58:50Z"
  },
  {
    "title": "Tech manufacturing has powered Asia - now it's a casualty of Trump's tariffs",
    "description": "Trump's tariffs in his first term took aim at China - but this time they are going beyond.",
    "link": "https://www.bbc.com/news/articles/c5ykd997kjjo",
    "timestamp": "2025-08-01T22:57:34Z"
  },
  {
    "title": "Jeffrey Epstein: White House monitors coverage of controversy and can’t make it disappear",
    "description": "President Donald Trump has begged his base to stop thinking about Jeffrey Epstein. But 25 days after his Justice Department declared it had nothing more to say on the convicted sex offender, the drumbeat for action continues.",
    "link": "https://www.cnn.com/2025/08/01/politics/epstein-trump-white-house-controversy",
    "timestamp": "2025-08-01T22:57:24Z"
  },
  {
    "title": "U.S. stocks sink on tepid U.S. jobs data, erratic trade policies",
    "description": "NEW YORK, Aug. 1 (Xinhua) -- U.S. stocks tumbled Friday, weighed down by a weaker-than-expected jobs report that signaled a cooling labor market and growing investor unease over the Trump administration's erratic trade policies. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/02/us-stocks-sink-on-tepid-us-jobs-data-erratic-trade-policies",
    "timestamp": "2025-08-01T22:56:00Z"
  },
  {
    "title": "Trump officials weigh fate of $9M contraceptives stockpile feared earmarked for destruction",
    "description": "Funded by U.S taxpayers, the family planning supplies were intended for women in war zones, refugee camps and elsewhere, according to a bipartisan letter of protest to Secretary of State Marco Rubio from two U.S. senators.",
    "link": "https://www.pbs.org/newshour/politics/trump-officials-weigh-fate-of-9m-contraceptives-stockpile-feared-earmarked-for-destruction",
    "timestamp": "2025-08-01T22:54:19Z"
  },
  {
    "title": "Markets dive after Trump hits more countries with steep tariffs - Reuters",
    "description": "Markets dive after Trump hits more countries with steep tariffsReuters These are the countries affected by Trump’s latest tariffsCNN Switzerland, Taiwan: The World Reacts to Trump's Aug. 1 Tariff WarForeign Policy Live updates: US stock market and global trad…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178538528",
    "timestamp": "2025-08-01T22:53:06Z"
  },
  {
    "title": "Trump fires labor data chief over disappointing jobs report",
    "description": "The US president said the latest jobs report was \"rigged\" to \"make him look bad,\" accusing BLS chief McEntarfer of manipulating the data. Trump did not provide evidence of such manipulation.",
    "link": "https://www.dw.com/en/trump-fires-labor-data-chief-over-disappointing-jobs-report/a-73504303",
    "timestamp": "2025-08-01T22:52:00Z"
  },
  {
    "title": "With never-ending tariff drama, the Canadian economy limps along",
    "description": "Canadian businesses are left in limbo after Ottawa failed to clinch a deal with U.S. President Donald Trump by his Friday deadline, making Canada an outlier among its neighbour’s big trading partners. \nCanadian negotiators have been in Washington this week tr…",
    "link": "https://biztoc.com/x/2c51ec420411579e",
    "timestamp": "2025-08-01T22:50:30Z"
  }
]