[
  {
    "title": "Monday, February 9, 2026",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/monday-february-9-2026/",
    "timestamp": "2026-02-09T13:47:04Z"
  },
  {
    "title": "IOC, HPCL buy Venezuelan oil in second deal since imports resumed",
    "description": "State-owned Indian Oil Corporation (IOC) and Hindustan Petroleum Corporation Ltd (HPCL) have jointly bought 2 million barrels of Venezuelan crude oil - the second deal that Indian refiners have struck since oil restarted flowing into international markets.\nTh…",
    "link": "https://www.business-standard.com/economy/news/ioc-hpcl-buy-venezuelan-oil-through-trader-126020901272_1.html",
    "timestamp": "2026-02-09T13:44:01Z"
  },
  {
    "title": "The Latest: Justice Department will allow lawmakers to see unredacted Epstein files",
    "description": "President Donald Trump has lashed out at reporters raising questions about the Epstein files, demanding that the country “get onto something else,” but...",
    "link": "https://www.yahoo.com/news/articles/latest-justice-department-allow-lawmakers-134311392.html",
    "timestamp": "2026-02-09T13:43:11Z"
  },
  {
    "title": "Kevin Warsh’s Past Policy Positions Have Commercial Real Estate Guessing",
    "description": "s the commercial real estate industry adapts to a likely future of Kevin Warsh leading the Federal Reserve, the former Fed governor’s past record provides only mixed signals on how his monetary policy may dictate transaction activity. President Donald Trump n…",
    "link": "http://commercialobserver.com/2026/02/kevin-warsh-policy-positions/",
    "timestamp": "2026-02-09T13:40:58Z"
  },
  {
    "title": "Cuba warns airlines they can’t refuel amid Trump tariff threat",
    "description": "Cuba could lose airline service as it prepares to run out of aviation fuel, while Nicaragua cut off an escape valve for migrants. Read more.",
    "link": "https://financialpost.com/transportation/airlines/cuba-airlines-refuel-trump-tariff-threat",
    "timestamp": "2026-02-09T13:40:58Z"
  },
  {
    "title": "The President’s Gold. G20 Summit at the Trump National Doral Miami",
    "description": "The United States will assume the Presidency of the G20 in 2026, coinciding with the 250th anniversary of the founding of the United States of America, making it a particularly important year for the country. In December, President Trump will …\nThe post The P…",
    "link": "https://www.globalresearch.ca/president-gold-g20-summit-trump-national-doral-miami/5915185",
    "timestamp": "2026-02-09T13:36:46Z"
  },
  {
    "title": "Russia Crude Output Shrinks",
    "description": "Russia's crude output declined for a second straight month in January.",
    "link": "https://www.rigzone.com/news/wire/russia_crude_output_shrinks-09-feb-2026-182948-article/",
    "timestamp": "2026-02-09T13:35:34Z"
  },
  {
    "title": "As Black History Month Turns 100, Trump Refuses to Apologize for Video Depicting Obamas as Apes",
    "description": "President Donald Trump is refusing to apologize for sharing a racist video on social media that depicts former President Barack Obama and Michelle Obama as apes. The video remained available on Trump’s Truth Social page for 12 hours before it was deleted arou…",
    "link": "https://www.democracynow.org/2026/2/9/naacp_trump",
    "timestamp": "2026-02-09T13:34:13Z"
  },
  {
    "title": "This unspeakable Trump attack took my breath away — but the response truly shocked",
    "description": "I’ve been talking into microphones since I did the morning news on WITL in Lansing Michigan in the late 1960s, and I’ve seen a lot of ugly moments in American politics. But every so often something happens that still takes your breath away, not because it’s s…",
    "link": "https://www.rawstory.com/raw-investigates/trump-obama-2675108831/",
    "timestamp": "2026-02-09T13:32:31Z"
  },
  {
    "title": "By Slashing Foreign Aid, Trump Is Fueling the Spread of HIV in Uganda",
    "description": "Reporting from Uganda, The Intercept saw how Trump’s effort to slash foreign aid is encouraging the transmission of HIV.\nThe post By Slashing Foreign Aid, Trump Is Fueling the Spread of HIV in Uganda appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/09/trump-usaid-pepfar-uganda-hiv-aids/",
    "timestamp": "2026-02-09T13:29:47Z"
  },
  {
    "title": "Silver price prediction futures: Could silver price surge to $200 in 2026? Here’s what would have to happen",
    "description": "Silver price prediction futures: Silver prices shocked markets in 2026 after hitting $121 an ounce, then crashing over 30% in days. Federal Reserve leadership signals, a stronger U.S. dollar, and surging retail speculation drove extreme volatility. Most insti…",
    "link": "https://economictimes.indiatimes.com/news/international/us/silver-price-prediction-futures-siw00-could-silver-price-surge-to-200-in-2026-heres-what-would-have-to-happen/articleshow/128114643.cms",
    "timestamp": "2026-02-09T13:29:28Z"
  },
  {
    "title": "US-Iran talks are not a countdown to conflict",
    "description": "Diplomacy remains the most preferable option both for Iran and the US as tensions between the two countries rise.",
    "link": "https://theconversation.com/us-iran-talks-are-not-a-countdown-to-conflict-275349",
    "timestamp": "2026-02-09T13:28:13Z"
  },
  {
    "title": "Epstein files 2026: Who resigned, who was fired, who apologised as Europe’s elite face reckoning",
    "description": "The latest release of the Epstein files has triggered a wave of resignations, dismissals and public apologies, with Europe displaying far less tolerance for ethical lapses than the United States.",
    "link": "https://indianexpress.com/article/world/us-news/jeffrey-epstein-2026-files-europe-political-fallout-uk-norway-resignations-10522763/",
    "timestamp": "2026-02-09T13:27:23Z"
  },
  {
    "title": "Muslim countries slam Israel for ‘illegal annexation’ push in West Bank",
    "description": "In joint statement, countries urge international community to 'compel Israel to halt its dangerous escalation'.",
    "link": "https://www.aljazeera.com/news/2026/2/9/muslim-countries-slam-israel-for-illegal-annexation-push-in-west-bank",
    "timestamp": "2026-02-09T13:26:14Z"
  },
  {
    "title": "Israeli forces kill four militants in Gaza, farmer also shot dead",
    "description": "CAIRO, Feb 9 (Reuters) - Israeli forces killed four militants in Rafah in the southern Gaza Strip on Monday after they emerged from an underground tunnel and opened fire … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/israeli-forces-kill-four-militants-in-gaza-farmer-also-shot-dead",
    "timestamp": "2026-02-09T13:17:34Z"
  },
  {
    "title": "US figure skater Amber Glenn faces backlash over politics and copyright issues",
    "description": "Amber Glenn wins Olympic gold in the team event but faces backlash over her political and LGBTQ+ comments",
    "link": "https://abcnews.go.com/Sports/wireStory/us-figure-skater-amber-glenn-faces-backlash-politics-129985310",
    "timestamp": "2026-02-09T13:17:25Z"
  },
  {
    "title": "That new tax break comes at a cost: How it could be weakening Social Security",
    "description": "Social Security supports millions of retirees in the U.S. But the program is under pressure from money shortages, population changes, and new tax breaks. Experts warn that if nothing changes, future benefits could be reduced. While payments will not stop, low…",
    "link": "https://economictimes.indiatimes.com/news/international/us/that-new-tax-break-comes-at-a-cost-how-it-could-be-weakening-social-security/articleshow/128115875.cms",
    "timestamp": "2026-02-09T13:16:20Z"
  },
  {
    "title": "Here’s why ‘crypto’ search volume on Google hovers near yearly low",
    "description": "Low searches and high fear reveal a market shedding speculation.",
    "link": "https://ambcrypto.com/heres-why-crypto-search-volume-on-google-hovers-near-yearly-low/",
    "timestamp": "2026-02-09T13:15:35Z"
  },
  {
    "title": "Bad Bunny brought out Ricky Martin & Lady Gaga for his spectacular Halftime show",
    "description": "I “accidentally” fell asleep in the first half of the Super Bowl, but magically, I woke up just in time for the Halftime Show. I’m so glad I got to experience that live, it was such a vibe. Just in case anyone didn’t know – it seems a lot of the MAGA dumbasse…",
    "link": "https://www.celebitchy.com/961034/bad_bunny_brought_out_ricky_martin_lady_gaga_for_his_super_bowl_halftime_show/",
    "timestamp": "2026-02-09T13:15:27Z"
  },
  {
    "title": "Meet Aliya Rahman, Disabled U.S. Citizen Assaulted, Jailed & Traumatized by ICE in Minneapolis",
    "description": "We speak with Aliya Rahman, a U.S. citizen who was violently dragged from her car by federal immigration officers in Minneapolis last month and detained at the Whipple Federal Building, which has become the epicenter of the government’s immigration crackdown …",
    "link": "https://www.democracynow.org/2026/2/9/minneapolis_ice",
    "timestamp": "2026-02-09T13:14:53Z"
  },
  {
    "title": "The blowback to Trump's racist video reveals his weakness (Noah Berlatsky/Public Notice)",
    "description": "Noah Berlatsky / Public Notice:\nThe blowback to Trump's racist video reveals his weakness  —  Public Notice is supported by paid subscribers.  Become one ⬇️  —   Subscribe to PN   —  Late Thursday night, President Donald Trump posted a short video which i…",
    "link": "https://www.memeorandum.com/260209/p9",
    "timestamp": "2026-02-09T13:10:00Z"
  },
  {
    "title": "Cryptic message on Super Bowl pitch invader's chest explained",
    "description": "Here is an explanation for the cryptic message worn by a pitch invader at last night's Super Bowl, which appeared to be a promo for trader Alex Gonzalez.",
    "link": "https://www.ladbible.com/news/sport/superbowl-2026-pitch-invader-message-explained-178742-20260209",
    "timestamp": "2026-02-09T13:08:56Z"
  },
  {
    "title": "Chris Christie slams Mamdani over handling of New York City snowstorm, garbage 'piled up everywhere'",
    "description": "Former New Jersey Gov. Chris Christie criticized New York City Mayor Zohran Mamdani for snow pileups during an appearance on \"Overtime\" of Bill Maher's show.",
    "link": "https://www.foxnews.com/media/chris-christie-slams-mamdani-over-handling-new-york-city-snowstorm-garbage-piled-up-everywhere",
    "timestamp": "2026-02-09T13:05:03Z"
  },
  {
    "title": "What to know about Takaichi's conservative policies after big election win",
    "description": "Japanese Prime Minister Sanae Takaichi’s big election win paves the way for her ruling party to dominate the crucial lower house of parliament",
    "link": "https://abcnews.go.com/International/wireStory/takaichis-conservative-policies-after-big-election-win-129985682",
    "timestamp": "2026-02-09T13:04:57Z"
  },
  {
    "title": "With Democrats, the I’s Have It: Impeachment and Insurrection",
    "description": "For the Democrats, it’s been a short, slippery slope from demanding Trump’s impeachment to likening him, ICE, and all Republicans to Nazis. Trump “is impeached forever,” declared Nancy Pelosi, voicing an accidental truth after Democrats impeached Trump for hi…",
    "link": "https://freerepublic.com/focus/f-chat/4366083/posts",
    "timestamp": "2026-02-09T13:02:27Z"
  },
  {
    "title": "Soybean oil rallies in CBOT as India agrees to cut duties on US supplies",
    "description": "Traders said prices might rise more if India scales back purchases from South America",
    "link": "https://www.business-standard.com/industry/agriculture/soybean-oil-rallies-in-cbot-as-india-agrees-to-cut-duties-on-us-supplies-126020901229_1.html",
    "timestamp": "2026-02-09T13:00:12Z"
  },
  {
    "title": "Modern Science Is Smart Public Policy for a Healthy Nation and Economy",
    "description": "The news two weeks ago from the National Institutes of Health could be downplayed as a tidbit of politics by the Trump administration around the... Read More\nThe post Modern Science Is Smart Public Policy for a Healthy Nation and Economy appeared first on The…",
    "link": "https://www.dailysignal.com/2026/02/09/modern-science-is-smart-public-policy-for-a-healthy-nation-and-economy/",
    "timestamp": "2026-02-09T13:00:00Z"
  },
  {
    "title": "Why Is Everyone So Angry? This Is What We Voted for, Right?",
    "description": "I don’t get what everyone on all sides is so angry about. Isn’t this exactly what the country voted for? Do we not remember the affordability crisis from 2024 and the price of everything? With the cost of food, energy, and housing, it was no surprise that Ame…",
    "link": "https://www.mcsweeneys.net/articles/why-is-everyone-so-angry-this-is-what-we-voted-for-right",
    "timestamp": "2026-02-09T13:00:00Z"
  },
  {
    "title": "China rejects US claims of secret nuclear tests",
    "description": "At the UN Conference on Disarmament in Geneva on Friday, Thomas DiNanno, US under secretary of state for arms control  accused China of conducting the tests, including one on 22 June 2020, and of preparing for more tests with massive yields.",
    "link": "https://economictimes.indiatimes.com/news/defence/china-rejects-us-claims-of-secret-nuclear-tests/articleshow/128115611.cms",
    "timestamp": "2026-02-09T12:59:51Z"
  },
  {
    "title": "‘Together We Are America’: Unpacking Bad Bunny’s Super Bowl performance",
    "description": "The Puerto Rican superstar’s unequivocal celebration of immigrant culture provided a much-needed message of unity",
    "link": "https://www.dazeddigital.com/music/article/69588/1/together-we-are-america-unpacking-bad-bunny-super-bowl-performance-2026?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=together-we-are-america-unpacking-bad-bunny-s-super-bowl-performance",
    "timestamp": "2026-02-09T12:59:00Z"
  },
  {
    "title": "People spot what Bad Bunny did during Lady Gaga performance that wasn't shown on TV",
    "description": "Bad Bunny brought out Lady Gaga mid-set during his Super Bowl halftime performance",
    "link": "https://www.ladbible.com/news/bad-bunny-super-bowl-halftime-lady-gaga-261799-20260209",
    "timestamp": "2026-02-09T12:56:56Z"
  },
  {
    "title": "Couple shown during Bad Bunny's Super Bowl halftime show got legally married during the performance: reports",
    "description": "The couple shown during Bad Bunny's Super Bowl LX halftime show was legally married ongoing during the performance, according to multiple reports.",
    "link": "https://www.foxnews.com/sports/couple-shown-during-bad-bunnys-super-bowl-halftime-show-got-legally-married-during-performance-reports",
    "timestamp": "2026-02-09T12:54:20Z"
  },
  {
    "title": "Masks emerge as symbol of Trump's ICE crackdown and a flashpoint in Congress",
    "description": "The images of masked federal officers has become a flashpoint in the Trump administration’s immigration enforcement operations",
    "link": "https://abcnews.go.com/Politics/wireStory/masks-emerge-symbol-trumps-ice-crackdown-flashpoint-congress-129986936",
    "timestamp": "2026-02-09T12:53:49Z"
  },
  {
    "title": "Turning Point USA Super Bowl halftime show, reviewed",
    "description": "Turning Point USA’s halftime show highlighted a deepening culture war, as entertainment is increasingly built for separate, politically defined audiences.",
    "link": "https://www.deseret.com/sports/2026/02/08/tpusa-halftime-show-review-super-bowl/",
    "timestamp": "2026-02-09T12:51:11Z"
  },
  {
    "title": "In a reversal, Trump endorses Nexstar's $6.2B acquisition of Tegna, saying \"We need more competition against THE ENEMY, the Fake News National TV Networks\" (Laya Neelakandan/CNBC)",
    "description": "Laya Neelakandan / CNBC:\nIn a reversal, Trump endorses Nexstar's $6.2B acquisition of Tegna, saying “We need more competition against THE ENEMY, the Fake News National TV Networks”  —  President Donald Trump on Saturday endorsed Nexstar Media's proposed $6.2 …",
    "link": "https://mediagazer.com/260209/p8",
    "timestamp": "2026-02-09T12:50:02Z"
  },
  {
    "title": "Binance adds $300M in Bitcoin to SAFU reserve during market dip",
    "description": "The most recent news about crypto industry at Cointelegraph. Latest news about bitcoin, ethereum, blockchain, mining, cryptocurrency prices and more",
    "link": "https://cointelegraph.com/news/binance-buys-bitcoin-safu-reserve-market-dip?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "timestamp": "2026-02-09T12:48:50Z"
  },
  {
    "title": "Raging Donald Trump lays into Bad Bunny's 'Disgusting' Super Bowl Halftime Show Branding Spanish-Speaking Performance 'the Worst Ever' and 'A Slap in the Face' to America",
    "description": "Donald Trump has branded Bad Bunny's Super Bowl Halftime show a 'slap in the face' to America during blistering rant on Truth Social at the Puerto Rican singer.",
    "link": "https://radaronline.com/p/donald-trump-lays-into-bad-bunny-disgusting-super-bowl-halftime-show-worst-ever/",
    "timestamp": "2026-02-09T12:46:17Z"
  },
  {
    "title": "China rejects US claims of secret nuclear tests",
    "description": "BEIJING: China on Monday (Feb 9) denied US allegations it had conducted secret nuclear explosive tests, calling them \"outright lies\" and accusing Washington of making excuses to start up its o",
    "link": "https://www.channelnewsasia.com/east-asia/china-reject-us-claim-secret-nuclear-tests-weapons-5917816",
    "timestamp": "2026-02-09T12:45:00Z"
  },
  {
    "title": "Top Democrats fawn over Bad Bunny's Super Bowl halftime show, attack Trump and other conservative critics",
    "description": "Democrat leaders praisd Bad Bunny's Spanish-language Super Bowl halftime show as Alexandria Ocasio-Cortez and Senator Ruben Gallego celebrate the performance.",
    "link": "https://www.foxnews.com/sports/top-democrats-fawn-over-bad-bunnys-super-bowl-halftime-show-amid-conservative-backlash",
    "timestamp": "2026-02-09T12:44:46Z"
  },
  {
    "title": "Trump Blames Staffer for Offensive Obama Video & Refuses to Apologize",
    "description": "Donald Trump responded to backlash after a racially offensive video depicting Barack Obama and Michelle Obama appeared on his Truth Social account, distancing himself from the post and declining to apologize. When asked about the video, Trump said it was shar…",
    "link": "https://mediatakeout.com/trump-blames-staffer-for-offensive-obama-video-refuses-to-apologize/",
    "timestamp": "2026-02-09T12:44:35Z"
  },
  {
    "title": "Even Bootlicking Dr. Oz Is Telling People To Get Measles Vaccine",
    "description": "How about that? A Trump administration official is actually encouraging Americans to get measles vaccines at a time when outbreaks across several states and puts the U.S. at risk of losing its measles elimination status.\n\"Take the vaccine, please,\" said Mehme…",
    "link": "https://crooksandliars.com/2026/02/even-bootlicking-dr-oz-telling-people-get",
    "timestamp": "2026-02-09T12:41:55Z"
  },
  {
    "title": "Singer seemingly takes swipe at Bad Bunny's Super Bowl LX halftime show: 'They need me'",
    "description": "Singer Chris Brown appeared to take a swipe at Bad Bunny's Super Bowl LX halftime performance on Sunday, saying that it was clear the game needs him.",
    "link": "https://www.foxnews.com/sports/singer-seemingly-takes-swipe-bad-bunnys-super-bowl-lx-halftime-show-they-need-me",
    "timestamp": "2026-02-09T12:40:02Z"
  },
  {
    "title": "Kendall Jenner watches ex Bad Bunny perform at Super Bowl LX in viral, uncomfortable moment",
    "description": "Kendall Jenner found herself at the center of an awkward Super Bowl subplot as she watched her ex-boyfriend, Bad Bunny, command the halftime stage at Super Bowl LX. While millions",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/09/6989d46046163ff9268b45db.html",
    "timestamp": "2026-02-09T12:39:31Z"
  },
  {
    "title": "US is undermining LGBTQ+ rights worldwide, new report claims",
    "description": "A new human rights report has claimed the US is undermining LGBTQ+ and wider human rights across the world, with the second Trump administration marked by a “blatant disregard for human rights and egregious violations”. The report from Human Rights Watch, ent…",
    "link": "https://www.thepinknews.com/2026/02/09/us-human-rights-lgbtq/",
    "timestamp": "2026-02-09T12:39:05Z"
  },
  {
    "title": "China rejects US claims of secret nuclear tests",
    "description": "China has denied US allegations of conducting secret nuclear tests, calling the claims ‘outright lies’ and an excuse for Washington to resume its own trial\n\nRead More: https://punchng.com/china-rejects-us-claims-of-secret-nuclear-tests/",
    "link": "https://punchng.com/china-rejects-us-claims-of-secret-nuclear-tests/",
    "timestamp": "2026-02-09T12:38:41Z"
  },
  {
    "title": "Bad Bunny brings Gaga, Martin and Puerto Rican pride to Super Bowl as Green Day, Puth play pregame",
    "description": "SANTA CLARA, Calif. (AP) — Stars were front-and-center at Super Bowl 60, with Chris Pratt and Jon Bon Jovi introducing the teams, a series of<a class=\"excerpt-read-more\" href=\"https://wsvn.com/entertainment/bad-bunny-brings-gaga-martin-and-puerto-rican-pride-…",
    "link": "https://wsvn.com/entertainment/bad-bunny-brings-gaga-martin-and-puerto-rican-pride-to-super-bowl-as-green-day-puth-play-pregame/",
    "timestamp": "2026-02-09T12:38:39Z"
  },
  {
    "title": "'Existential crisis' hits MAGA as Super Bowl show leaves Trump scrambling: analysis",
    "description": "President Donald Trump's reaction to Bad Bunny's Super Bowl halftime show has left MAGA facing an uncomfortable truth about its own movement, a political analyst claimed. While Bad Bunny drew a staggering 113 million viewers, those in the MAGA sphere sought e…",
    "link": "https://www.rawstory.com/trump-super-bowl-2675211928/",
    "timestamp": "2026-02-09T12:35:37Z"
  },
  {
    "title": "Kylie Kelce sends a powerful message that reinforces Bad Bunny and eclipses Donald Trump's comments",
    "description": "The fallout seen after the Super Bowl LX finished has extended far beyond the final score at Levi&apos;s Stadium. While the Seattle Seahawks celebrated their victory on the field,",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/09/6989d3edca4741e1558b4585.html",
    "timestamp": "2026-02-09T12:32:57Z"
  },
  {
    "title": "What Being a Billionaire Scion Taught JB Pritzker About Standing Up to One",
    "description": "In the late 1970s, after building a small airport hotel into one of the biggest names in hospitality, the Pritzkers of Chicago joined forces with an ambitious young developer to convert an unfashionable hotel on New York’s 42nd Street into a sparkling Grand H…",
    "link": "https://www.motherjones.com/politics/2026/02/jb-pritzker-chicago-ice-metro-surge-ice-authoritarianism/",
    "timestamp": "2026-02-09T12:30:00Z"
  },
  {
    "title": "Can He Really Do That? Black History Month in the Age of Trump",
    "description": "Last year, shortly after his second inauguration, President Donald Trump issued a proclamation on January 31 to mark the start of Black History Month the next day—just as presidents before him had done, beginning with Gerald Ford in the bicentennial year of 1…",
    "link": "https://www.motherjones.com/politics/2026/02/can-he-really-do-that-black-history-month-in-the-age-of-trump/",
    "timestamp": "2026-02-09T12:30:00Z"
  },
  {
    "title": "Trump’s NIH Slashed Research on Chronic Diseases in 2025. Will It Happen Again?",
    "description": "As disease researchers around the country received letters last year that their grants had been cancelled, National Institutes of Health (NIH) director Jay Bhattacharya declared his agency was merely clearing out the clutter. Those terminated grants do “not a…",
    "link": "https://www.motherjones.com/politics/2026/02/trump-nih-research-budget-cuts-chronic-diseases/",
    "timestamp": "2026-02-09T12:30:00Z"
  },
  {
    "title": "Masks emerge as symbol of Trump’s ICE crackdown and a flashpoint in Congress",
    "description": "Democrats want to ban masks as one of several proposals to rein in immigration operations.",
    "link": "https://www.bostonherald.com/2026/02/09/ice-masks-trump-congress-budget/",
    "timestamp": "2026-02-09T12:25:26Z"
  },
  {
    "title": "New poll shows low approval of Trump's handling of the economy",
    "description": "A new poll reveals most Americans are unhappy with the way President Donald Trump has handled the economy.During an interview with &ldquo;NBC Nightly News&rdquo; anchor Tom",
    "link": "https://weartv.com/news/nation-world/new-poll-shows-low-approval-of-trumps-handling-of-the-economy",
    "timestamp": "2026-02-09T12:16:05Z"
  },
  {
    "title": "‘Scam’ claims spread after Trump’s Super Bowl crypto donation pitch",
    "description": "AI concerns and lack of disclosure sparked controversy, raising questions about legality, ethics, and campaign transparency rules.",
    "link": "https://ambcrypto.com/scam-claims-spread-after-trumps-super-bowl-crypto-donation-pitch/",
    "timestamp": "2026-02-09T12:15:50Z"
  },
  {
    "title": "‘Tell the truth’: Epstein survivors demand justice in Super Bowl ad",
    "description": "The advertisement urges US Attorney General Pam Bondi to disclose all remaining files related to the late sex offender.",
    "link": "https://www.aljazeera.com/news/2026/2/9/tell-the-truth-epstein-survivors-demand-justice-in-super-bowl-ad",
    "timestamp": "2026-02-09T12:15:29Z"
  },
  {
    "title": "Monday: Hili dialogue",
    "description": "Welcome to Monday, February 9, 2026, and National Bagel and Lox Day, one of the few ways I’ll eat fish. I don’t know who got the idea to put salmon on a bagel with cream cheese, but the idea was, as the kids say, “genius”.  Below is a a photo from the Wikiped…",
    "link": "https://whyevolutionistrue.com/2026/02/09/monday-hili-dialogue-555/",
    "timestamp": "2026-02-09T12:15:27Z"
  },
  {
    "title": "NSA Monitors Foreign Intelligence Call About 'Someone Close To Trump'",
    "description": "Last spring, the NSA flagged an unusual phone call between two members of foreign intelligence, who were discussing a person close to Donald Trump, according to the attorney for a whistleblower who reported the call.\nThe call was brought to to attention of Tu…",
    "link": "https://crooksandliars.com/2026/02/nsa-monitors-foreign-intelligence-call",
    "timestamp": "2026-02-09T12:13:48Z"
  },
  {
    "title": "Top FBI agent who tracked MN assassin switched to probe ICE victims: 'Americans less safe'",
    "description": "In June 2025, following a two-day manhunt leading to the arrest\r\n of Vance Boelter, FBI Special Agent Terry Getsch submitted an affidavit supporting criminal charges in the murder of Melissa Hortman, a former Democratic speaker of the Minnesota House, and her…",
    "link": "https://www.rawstory.com/raw-investigates/fbi-agent-who-tracked-mn-assassin-switched-to-ice-cases-in-sign-of-stretched-res/",
    "timestamp": "2026-02-09T12:12:15Z"
  },
  {
    "title": "When a President Dismantles the Language of Democracy: Trump and His Racial Humiliation of Obama",
    "description": "Democracy is not merely a collection of institutions, laws, and elections; democracy is, above all, a language. A language grounded in minimum respect, legitimate competition, and recognition of human dignity. When this language collapses, even if ballot boxe…",
    "link": "https://www.commondreams.org/opinion/trump-racism-obamas-2675214440",
    "timestamp": "2026-02-09T12:11:42Z"
  },
  {
    "title": "Is King Charles ‘incandescent’ over Keir Starmer’s comments about Prince Andrew?",
    "description": "I’ve paid more attention to the controversies of the Windsor family in the past month, but it’s also been an exceptionally bad time for Britain’s Prime Minister Keir Starmer. Starmer is also mired in controversy related to Jeffrey Epstein and FBI’s Epstein Fi…",
    "link": "https://www.celebitchy.com/960898/is_king_charles_incandescent_over_keir_starmers_comments_about_prince_andrew/",
    "timestamp": "2026-02-09T12:10:45Z"
  },
  {
    "title": "Obama Foundation Appears To Subtly Troll MAGA With Bad Bunny Super Bowl Message",
    "description": "The caption set social media alight.",
    "link": "https://www.huffpost.com/entry/obama-foundation-bad-bunny-super-bowl_n_6989c148e4b02d49a778df4f",
    "timestamp": "2026-02-09T12:09:22Z"
  },
  {
    "title": "Bessent warns of 'gigantic loss' if Supreme Court strips Trump's emergency tariff powers",
    "description": "Treasury Secretary Scott Bessent warns Supreme Court ruling against Trump's emergency tariffs would be \"gigantic loss\" for all Americans nationwide.",
    "link": "https://www.foxnews.com/media/bessent-warns-gigantic-loss-supreme-court-strips-trumps-emergency-tariff-powers",
    "timestamp": "2026-02-09T12:08:58Z"
  },
  {
    "title": "Donald Trump Calls Out Hunter Hess For His Comment: ‘Real Loser’",
    "description": "Donald Trump publicly addressed the controversy surrounding U.S. Olympian Hunter Hess following remarks Hess made about competing for Team USA during a tense political climate. The president responded with sharp criticism, weighing in on the skier’s comments …",
    "link": "https://www.realitytea.com/2026/02/09/donald-trump-slams-winter-olympian-hunter-hess-us-comment/",
    "timestamp": "2026-02-09T12:08:00Z"
  },
  {
    "title": "Trump Freaks Out About Bad Bunny, Royals React To Epstein News: Live Updates",
    "description": "Follow along for the latest news on the major headlines of the day.",
    "link": "https://www.huffpost.com/entry/latest-news-live-updates_n_6989c9d4e4b0a89b5c061101",
    "timestamp": "2026-02-09T12:07:49Z"
  },
  {
    "title": "Japan election win boosts Takaichi's foreign-policy hand",
    "description": "Reinstalled with a supermajority, Japanese leader Sanae Takaichi is likely to maintain a hard line on China while seeking even closer security and trade ties with the US. Japanese Prime Minister Sanae Takaichi scored a resounding victory in Sunday's general e…",
    "link": "https://www.dw.com/en/japan-election-win-boosts-takaichis-foreign-policy-hand/a-75875134",
    "timestamp": "2026-02-09T12:07:00Z"
  },
  {
    "title": "Japan election win improves Takaichi's foreign-policy hand",
    "description": "Reinstalled with a supermajority, Japanese leader Sanae Takaichi is likely to maintain a hard line on China while seeking even closer security and trade ties with the US. Japanese Prime Minister Sanae Takaichi scored a resounding victory in Sunday's general e…",
    "link": "https://www.dw.com/en/japan-election-win-improves-takaichis-foreign-policy-hand/a-75875134",
    "timestamp": "2026-02-09T12:07:00Z"
  },
  {
    "title": "What Are Kevin Warsh’s Priorities?",
    "description": "President Donald Trump’s pick to take over as chair of the Federal Reserve in May is preoccupied with moral hazard, the concern that Fed balance-sheet expansion encourages risky behavior by banks, inflates asset prices, and promotes fiscal profligacy. But whi…",
    "link": "https://www.project-syndicate.org/commentary/warsh-priorities-at-fed-inflation-and-employment-by-barry-eichengreen-2026-02",
    "timestamp": "2026-02-09T12:06:42Z"
  },
  {
    "title": "Parliamentary delegation due in US for defense, regional talks",
    "description": "A delegation from the Turkish parliament's foreign affairs commission was set to visit Washington beginning Feb. 9 for a six-day series of meetings aimed at strengthening bilateral ties and discussing key regional and defense issues.",
    "link": "https://www.hurriyetdailynews.com/parliamentary-delegation-due-in-us-for-defense-regional-talks-218758",
    "timestamp": "2026-02-09T12:05:38Z"
  },
  {
    "title": "Piers Morgan Defends Bad Bunny’s ‘Unifying’ Halftime Show After Trump Attack: ‘Best in Super Bowl History’",
    "description": "Piers Morgan praised Puerto Rican rapper Bad Bunny after President Donald Trump tore into the musician's Super Bowl halftime show on Sunday.\nThe post Piers Morgan Defends Bad Bunny’s ‘Unifying’ Halftime Show After Trump Attack: ‘Best in Super Bowl History’ fi…",
    "link": "https://www.mediaite.com/media/tv/piers-morgan-defends-bad-bunnys-unifying-halftime-show-after-trump-attack-best-in-super-bowl-history/",
    "timestamp": "2026-02-09T12:05:25Z"
  },
  {
    "title": "¡Viva La Puerto Rico!: Tabs, Mon., Feb. 9, 2026",
    "description": "News and things to read and watch",
    "link": "https://www.wonkette.com/p/bloody-footprints-where-mercy-should",
    "timestamp": "2026-02-09T12:02:43Z"
  },
  {
    "title": "‘Take the vaccine, please,’ a top US health official says in an appeal as measles cases rise",
    "description": "A leading U.S. health official is urging people to get inoculated against the measles.",
    "link": "https://www.bostonherald.com/2026/02/09/measles-oz-urges-taking-vaccine/",
    "timestamp": "2026-02-09T12:01:37Z"
  },
  {
    "title": "Why Missile Defense Now Raises the Risk of War",
    "description": "The delusion of invulnerability tempts leaders to take risks.",
    "link": "http://foreignpolicy.com/2026/02/09/missile-defense-war-us-trump-israel-iran-russia-ukraine-middle-east/",
    "timestamp": "2026-02-09T12:00:36Z"
  },
  {
    "title": "Mark Meckler Says It's 'Revolting' For Zohran Mamdani To Discuss His Muslim Faith",
    "description": "Christian nationalist activist Mark Meckler says that it's \"revolting as a non-Muslim\" to hear New York City Mayor Zohran Mamdani talk about his Muslim faith.",
    "link": "https://www.peoplefor.org/rightwingwatch/mark-meckler-says-its-revolting-zohran-mamdani-discuss-his-muslim-faith",
    "timestamp": "2026-02-09T12:00:00Z"
  },
  {
    "title": "67 people died in ICE custody during Obama's presidency. That's not the full story",
    "description": "During former U.S. President Barack Obama's eight years in office, 67 people in the custody of U.S. Immigration and Customs Enforcement died.",
    "link": "https://www.snopes.com//fact-check/ice-obama-67-deaths/",
    "timestamp": "2026-02-09T12:00:00Z"
  },
  {
    "title": "China’s trade war battle plan for this region is simple",
    "description": "In 2025, China announced the elimination of tariffs on all imports for 53 African nations Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/632199-us-increases-china-eliminates-tariffs/",
    "timestamp": "2026-02-09T11:57:37Z"
  },
  {
    "title": "Migrants languish in US detention centers facing dire conditions and prolonged waits",
    "description": "With people in ICE detention over 70,000 for the first time, 7,252 people had been in custody at least 6 months in mid-January. including 79 held for over 2 years, according to agency data.",
    "link": "https://www.sun-sentinel.com/2026/02/09/migrants-languish-in-us-detention-centers-facing-dire-conditions-and-prolonged-waits/",
    "timestamp": "2026-02-09T11:56:01Z"
  },
  {
    "title": "Rubio leads US delegation to MSC on 'wrecking-ball politics'",
    "description": "The Munich Security Conference comes at \"a moment of profound uncertainty,\" its chairman says, much of it driven by US President Donald Trump's foreign policy.",
    "link": "https://www.dw.com/en/marco-rubio-lead-us-delegation-to-msc-trump-named-as-driving-force-behind-wrecking-ball-politics/a-75874710",
    "timestamp": "2026-02-09T11:56:00Z"
  },
  {
    "title": "Transcript: A MAGA Voter’s Remarkable Takedown of Trump: “Pathetic!”",
    "description": "The following is a lightly edited transcript of the February 10 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. It’s not…",
    "link": "https://newrepublic.com/article/206323/transcript-maga-voter-remarkable-takedown-trump-pathetic",
    "timestamp": "2026-02-09T11:55:53Z"
  },
  {
    "title": "‘Hypocrite!’ Internet Slams Logan Paul Even After He Condemned Brother’s Bad Bunny Jab",
    "description": "Paul publicly split with his brother, Jake Paul, to defend Bad Bunny, after his brother branded the artist a “fake American.”\nThe post ‘Hypocrite!’ Internet Slams Logan Paul Even After He Condemned Brother’s Bad Bunny Jab first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/hypocrite-internet-slams-logan-paul-even-after-he-condemned-brothers-bad-bunny-jab/",
    "timestamp": "2026-02-09T11:54:35Z"
  },
  {
    "title": "Robert Griffin III hits Donald Trump with a clear message about Bad Bunny and his halftime performance",
    "description": "The Super Bowl LX will be remembered for many things, and most of them did not take place on the field. The main topic of conversation shifted from the Seattle Seahawks&apos; victo",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/09/6989ca9022601dbf7f8b45a3.html",
    "timestamp": "2026-02-09T11:53:01Z"
  },
  {
    "title": "Team USA snowboarders respond to Hunter Hess, Donald Trump drama",
    "description": "As drama involving Hunter Hess and Donald Trump spreads, Team USA snowboarders offer their reactions and perspective on the situation.",
    "link": "https://www.usatoday.com/story/sports/olympics/2026/02/09/team-usa-snowboarders-chloe-kim-donald-trump-hunter-hess/88585906007/",
    "timestamp": "2026-02-09T11:52:55Z"
  },
  {
    "title": "Migrants languish in US detention centers facing dire conditions and prolonged waits",
    "description": "The number of people in Immigration and Customs Enforcement detention has topped 70,000 for the first time.",
    "link": "https://www.bostonherald.com/2026/02/09/migrants-prolonged-detention-dire-conditions/",
    "timestamp": "2026-02-09T11:52:44Z"
  },
  {
    "title": "Native Families Were Promised Free Solar. Trump Took It Away.",
    "description": "This story is published in partnership with The Daily Yonder.  It was sunny and warm for the end of November on the Rocky Boy’s Reservation in northern Montana. Joseph Eagleman was standing on a grassy hill, looking at a 20-panel solar array in the backyard o…",
    "link": "https://www.motherjones.com/politics/2026/02/native-families-were-promised-free-solar-trump-took-it-away/",
    "timestamp": "2026-02-09T11:47:00Z"
  },
  {
    "title": "One year later, how Trump’s USAID cuts are affecting the world",
    "description": "From health care to food security, the effects of slashing U.S. foreign aid are now being felt on the ground",
    "link": "https://www.salon.com/2026/02/09/one-year-later-how-trumps-usaid-cuts-are-affecting-the-world/",
    "timestamp": "2026-02-09T11:45:38Z"
  },
  {
    "title": "Olympics crowd showed ‘European pride’ by booing JD Vance, EU top diplomat says",
    "description": "\"Our public also has a pride, a European pride,\" foreign policy chief Kaja Kallas told an interviewer.",
    "link": "https://www.politico.eu/article/winter-olympics-european-pride-boo-jd-vance-kaja-kallas/",
    "timestamp": "2026-02-09T11:43:48Z"
  },
  {
    "title": "Trade cheer and global cues push benchmarks higher; Nifty above 25,850",
    "description": "The S&P BSE Sensex jumped 485.35 points or 0.58% to 84,065.75. The Nifty 50 index rallied 173.60 points or 0.68% to 25,867.30. In the two consecutive trading sessions, Sensex and Nifty jumped 0.90% and 0.88%, respectively.",
    "link": "https://www.business-standard.com/markets/capital-market-news/trade-cheer-and-global-cues-push-benchmarks-higher-nifty-above-25-850-126020900972_1.html",
    "timestamp": "2026-02-09T11:36:44Z"
  },
  {
    "title": "Soy Oil Rallies as India Agrees to Cut Duties on US Supplies",
    "description": "Chicago soybean oil rose to its highest level in more than six months, driven by expectations that India will buy more after proposing to open parts of its agriculture market to cheaper US imports.",
    "link": "https://financialpost.com/pmn/business-pmn/soy-oil-rallies-as-india-agrees-to-cut-duties-on-us-supplies",
    "timestamp": "2026-02-09T11:31:00Z"
  },
  {
    "title": "A Super Bowl ad promised ‘free money’ for kids. Here’s what Trump Accounts actually offer.",
    "description": "A Super Bowl TV ad tells parents to expect “free money” from the federal government to help their children achieve their dreams. Invest America, a nonprofit advocacy group, created the […]\nThe post A Super Bowl ad promised ‘free money’ for kids. Here’s what T…",
    "link": "https://www.poynter.org/fact-checking/2026/free-money-babies-super-bowl-ad/",
    "timestamp": "2026-02-09T11:30:19Z"
  },
  {
    "title": "Nexstar, Tegna merger will challenge ‘Fake News’ networks, claims Trump",
    "description": "US president Donald Trump has thrown his weight behind the planned merger of US station groups Nexstar Media and Tegna, saying it would help in his fight against “the Fake News National TV Networ...",
    "link": "https://www.c21media.net/news/nexstar-tegna-merger-will-challenge-fake-news-networks-claims-trump/",
    "timestamp": "2026-02-09T11:25:01Z"
  },
  {
    "title": "Affirmative Action Quotas in Question as Female, Minority Pilots Caused Half of Pilot-Error Crashes",
    "description": "Daniel Huff, a former White House lawyer, noted in a recent analysis that the drive toward diversity and inclusion in the airline industry has put passengers at risk. In an article for the New York Post, Huff wrote that President Donald Trump was right to res…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366076/posts",
    "timestamp": "2026-02-09T11:24:23Z"
  },
  {
    "title": "Irish adviser’s resignation may not be enough to save Keir Starmer",
    "description": "Democrats in US are getting worked up about what Donald Trump might do in advance of November’s midterm elections",
    "link": "https://www.irishtimes.com/politics/2026/02/09/irish-advisers-resignation-may-not-be-enough-to-save-keir-starmer/",
    "timestamp": "2026-02-09T11:22:39Z"
  },
  {
    "title": "Chinese cars are coming to the US — like it or not",
    "description": "Despite US tariffs and software bans, Chinese automakers are signaling potential entry into the American market. While President Trump expressed openness to Chinese manufacturing, industry insiders suggest a permanent exclusion is unlikely, especially as Chin…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinese-cars-are-coming-to-the-us-like-it-or-not/articleshow/128111728.cms",
    "timestamp": "2026-02-09T11:15:35Z"
  },
  {
    "title": "US figure skater Amber Glenn faces backlash over politics and copyright issues after Olympic gold",
    "description": "US figure skater Amber Glenn won gold, but faces backlash over comments and now a copyright issue over music in her program.",
    "link": "https://www.bostonherald.com/2026/02/09/figure-skater-glenn-bakclash-copyright/",
    "timestamp": "2026-02-09T11:12:53Z"
  },
  {
    "title": "5 iconic moments from Bad Bunny’s Super Bowl performance",
    "description": "Bad Bunny’s Apple Music Super Bowl Half Time show was a landmark celebration of Latin American culture of the past, present and future. The 31-year-old musician, born Benito Antonio Martínez Ocasio, made history before he’d even stepped out onto the Super Bow…",
    "link": "https://www.thepinknews.com/2026/02/09/5-iconic-moments-from-bad-bunnys-super-bowl-performance/",
    "timestamp": "2026-02-09T11:09:07Z"
  },
  {
    "title": "Yarn maker Trident posts quarterly profit slump as exports soften",
    "description": "Indian towel and bedsheet maker Trident reported a 44% profit fall in the third quarter due to a U.S. tariff-induced export slowdown. Revenue dropped 6%, with bedsheet sales declining by a third. The company is establishing a domestic subsidiary to boost over…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yarn-maker-trident-posts-quarterly-profit-slump-as-exports-soften/articleshow/128111504.cms",
    "timestamp": "2026-02-09T11:08:34Z"
  }
]