[
  {
    "title": "Military Commanders Will Be Told To Send Transgender Troops To Medical Checks To Oust Them",
    "description": "The new order to commanders relies on routine annual health checks that service members are required to undergo.",
    "link": "https://www.huffpost.com/entry/trump-transgender-military-ban_n_68267de7e4b029d8a610b012",
    "timestamp": "2025-05-15T23:57:26Z"
  },
  {
    "title": "Trump’s pledge to lift Syrian sanctions faces a complex road",
    "description": "The move was seen as a highlight of Trump’s trip to the Arabian Peninsula this week, but actual implementation will be a protracted and thorny challenge.",
    "link": "https://www.japantimes.co.jp/news/2025/05/16/world/politics/trump-syria-complex-road/",
    "timestamp": "2025-05-15T23:56:00Z"
  },
  {
    "title": "Saving Christmas?",
    "description": "MONEY | Holiday shoppers could encounter a shortage of toys",
    "link": "https://wng.org/articles/slim-christmas-1746816303",
    "timestamp": "2025-05-15T23:54:00Z"
  },
  {
    "title": "Cerebras CEO says chipmaker's 'aspiration' is to hold IPO in 2025",
    "description": "Cerebras CEO Andrew Feldman said his hope is that the AI chipmaker goes public in 2025 after a delay last year.",
    "link": "https://www.cnbc.com/2025/05/15/cerebras-ceo-says-chipmakers-aspiration-is-to-hold-ipo-in-2025.html",
    "timestamp": "2025-05-15T23:52:42Z"
  },
  {
    "title": "If Russia won’t go for peace, US must boost Ukraine aid",
    "description": "Thursday’s talks in Turkey between Moscow and Kyiv will serve as the latest test of whether Vladimir Putin is serious about a cease-fire deal. And if Putin fails, President Donald Trump faces a test of his own. The prez expressed optimism that “some pretty go…",
    "link": "https://freerepublic.com/focus/f-bloggers/4317259/posts",
    "timestamp": "2025-05-15T23:52:25Z"
  },
  {
    "title": "Receiver of troubled Boston nursing home defends hire of disgraced ex-senator Dianne Wilkerson",
    "description": "A court-appointed receiver of a financially-strapped Boston nursing home defended his hire of disgraced ex-senator Dianne Wilkerson, after “allegations of nepotism and self-dealing” were lodged against her in Superior Court.",
    "link": "https://www.bostonherald.com/2025/05/15/receiver-of-troubled-boston-nursing-home-defends-hire-of-disgraced-ex-senator-dianne-wilkerson/",
    "timestamp": "2025-05-15T23:51:58Z"
  },
  {
    "title": "US tariffs take centre stage at APEC trade gathering, joint statement in doubt",
    "description": "SEOGWIPO, South Korea (Reuters) -The Asia-Pacific Economic Cooperation's trade gathering comes to a close on Friday with divisions over U.S. tariffs and...",
    "link": "https://www.yahoo.com/news/us-tariffs-centre-stage-apec-234946737.html",
    "timestamp": "2025-05-15T23:49:46Z"
  },
  {
    "title": "'Paradigm shift': Germany says to meet Trump's NATO spending target",
    "description": "Germany, with its dark World War II history, has long been reluctant to spend big on defense.",
    "link": "https://www.japantimes.co.jp/news/2025/05/16/world/politics/germany-nato-defense-boost/",
    "timestamp": "2025-05-15T23:49:00Z"
  },
  {
    "title": "As Alaska lawmakers ask Congress to protect existing federal health care programs, Begich remains noncommittal",
    "description": "Alaska’s lone U.S. House member has declined to comment on whether he would support cuts to Medicaid spending, even as the Alaska Legislature asked him to protect existing programs.",
    "link": "https://www.adn.com/politics/2025/05/15/as-alaska-lawmakers-ask-congress-to-protect-existing-federal-health-care-programs-begich-remains-noncommittal/",
    "timestamp": "2025-05-15T23:46:24Z"
  },
  {
    "title": "Raskin: Birthright Citizenship Executive Order a 'Loser' for Trump",
    "description": "On Thursday's broadcast of CNN's \"The Arena,\" Rep. Jamie Raskin (D-MD) said President Donald Trump's executive order on birthright citizenship was \"a loser.\"\nThe post Raskin: Birthright Citizenship Executive Order a ‘Loser’ for Trump appeared first on Breitba…",
    "link": "https://www.breitbart.com/clips/2025/05/15/raskin-birthright-citizenship-executive-order-a-loser-for-trump/",
    "timestamp": "2025-05-15T23:40:00Z"
  },
  {
    "title": "Secret Service investigating ex-FBI chief James Comey for allegedly threatening Trump in since-deleted ‘8647’ Instagram post: ‘Deeply concerning’",
    "description": "“Disgraced former FBI Director James Comey just called for the assassination of @POTUS Trump,” Noem wrote on X. “DHS and Secret Service is investigating this threat and will respond appropriately.”…",
    "link": "https://nypost.com/2025/05/15/us-news/ex-fbi-chief-james-comey-accused-of-threatening-trump-in-since-deleted-8647-instagram-post-deeply-concerning/",
    "timestamp": "2025-05-15T23:38:43Z"
  },
  {
    "title": "Kathy Griffin Says Stephen Colbert Was ‘Laced With Misogyny,’ Pushed Her to Tears in Interview About Trump Head Scandal | Video",
    "description": "\"He's wildly talented, and he's obviously very bright – but man, what a dick,\" the comedian reflects of the \"Late Show\" host\nThe post Kathy Griffin Says Stephen Colbert Was ‘Laced With Misogyny,’ Pushed Her to Tears in Interview About Trump Head Scandal | Vid…",
    "link": "https://www.thewrap.com/kathy-griffin-stephen-colbert-interview-cry-trump-head/",
    "timestamp": "2025-05-15T23:38:17Z"
  },
  {
    "title": "Rand Paul: Trump’s Big Beautiful Bill Is a 'Slap In the Face'",
    "description": "Senator Rand Paul (R-KY) said Thursday on FNC's \"Fox & Friends\" that President Donald Trump's spending big was a \"slap in the face\" to conservatives who want government spending reduced.\nThe post Rand Paul: Trump’s Big Beautiful Bill Is a ‘Slap In the Face’ a…",
    "link": "https://www.breitbart.com/clips/2025/05/15/rand-paul-trumps-big-beautiful-bill-is-a-slap-in-the-face/",
    "timestamp": "2025-05-15T23:38:01Z"
  },
  {
    "title": "Trump 'can't spin his way out’ of this major campaign 'lie': Never-Trump strategist",
    "description": "Bulwark publisher Sarah Longwell sounded the alarm Thursday as she warned that President Donald Trump is losing steam among his own voters amid growing economic worries – particularly over grocery prices.Appearing on MSNBC, Longwell, who also hosts The Focus …",
    "link": "https://www.rawstory.com/trump-grocery-prices-2672026071/",
    "timestamp": "2025-05-15T23:37:18Z"
  },
  {
    "title": "Israeli onslaught kills scores in Gaza as Trump visits Gulf",
    "description": "Most of the victims were killed in Khan Younis in southern Gaza in airstrikes that hit homes and tents, Palestinian medics said.",
    "link": "https://www.japantimes.co.jp/news/2025/05/16/world/israel-strike-gaza-trump-trip/",
    "timestamp": "2025-05-15T23:37:00Z"
  },
  {
    "title": "Pentagon To Use Health Screenings to Remove Transgender Troops",
    "description": "A senior defense official described the rollout as a \"complicated and lengthy\" process intended to implement Trump's directive.",
    "link": "https://www.newsweek.com/pentagon-use-health-screenings-remove-transgender-troops-2073048",
    "timestamp": "2025-05-15T23:36:30Z"
  },
  {
    "title": "‘Party Of The Inside Cabal’: Victor Davis Hanson Predicts What Democrats Might Do With Fetterman In 2028",
    "description": "Victor Davis Hanson predicted Democrats will eventually attempt to primary Democrat Pennsylvania Sen. John Fetterman in the 2028 elections.",
    "link": "https://dailycaller.com/2025/05/15/victor-davis-hanson-prediction-democrats-john-fetterman-elections/",
    "timestamp": "2025-05-15T23:34:54Z"
  },
  {
    "title": "FTX Will Hand Out Over $5 Billion in Bankruptcy Repayments This Month",
    "description": "The next wave of FTX creditor distributions will begin on May 30, with over $5 billion worth of recovered funds set to be sent out.",
    "link": "https://decrypt.co/320340/ftx-hand-out-over-5-billion-repayments",
    "timestamp": "2025-05-15T23:34:00Z"
  },
  {
    "title": "Noem: DHS, Secret Service Investigating Comey’s ‘8647’ Post",
    "description": "\"86\" is slang to get rid of or murder someone.\nThe post Noem: DHS, Secret Service Investigating Comey’s ‘8647’ Post first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/noem-dhs-secret-service-investigating-comeys-8647-post/",
    "timestamp": "2025-05-15T23:33:51Z"
  },
  {
    "title": "White House Says James Comey’s Trump Social Media Post ‘Is Being Taken Seriously’",
    "description": "The White House revealed that a social media post by former FBI director James Comey was \"being taken seriously\" after it was interpreted as a threat.\nThe post White House Says James Comey’s Trump Social Media Post ‘Is Being Taken Seriously’ first appeared on…",
    "link": "https://www.mediaite.com/politics/white-house-says-james-comeys-trump-social-media-post-is-being-taken-seriously/",
    "timestamp": "2025-05-15T23:32:17Z"
  },
  {
    "title": "US, UAE Unveil Plan For New 5GW AI Campus In Abu Dhabi",
    "description": "It’s being reported in the Gulf region that a new 5GW UAE-US AI Campus in Abu Dhabi was unveiled on Thursday at Qasr Al Watan in the presence of President His Highness Sheikh Mohamed bin Zayed Al Nahyan and US. President Donald Trump, who is on a state visit …",
    "link": "https://slashdot.org/submission/17336029/us-uae-unveil-plan-for-new-5gw-ai-campus-in-abu-dhabi",
    "timestamp": "2025-05-15T23:31:37Z"
  },
  {
    "title": "Chief SCOTUS Justice John Roberts Stops Justice Sotomayor from Interrupting Questions",
    "description": "Supreme Court Chief Justice John Roberts stopped fellow Justice Sonia Sotomayor interrupting during oral arguments over birthright citizenship and nationwide injunctions on Thursday. \nThe post Chief SCOTUS Justice John Roberts Stops Justice Sotomayor from Int…",
    "link": "https://www.breitbart.com/politics/2025/05/15/chief-scotus-justice-john-roberts-stops-justice-sotomayor-from-interrupting-questions/",
    "timestamp": "2025-05-15T23:29:11Z"
  },
  {
    "title": "Trump Announces $200 Billion In Deals With UAE, AI Agreement Also Signed",
    "description": "President Donald Trump on Thursday pledged to strengthen U.S. ties to the United Arab Emirates and announced deals with the Gulf state totalling over $200 billion and the two countries also agreed to deepen cooperation in artificial intelligence.",
    "link": "https://www.ndtv.com/world-news/donald-trump-announces-200-billion-in-deals-with-uae-ai-agreement-also-signed-8425877",
    "timestamp": "2025-05-15T23:28:52Z"
  },
  {
    "title": "President outlines the Trump Doctrine: Prosperity equals peace — for the entire world",
    "description": "President Donald Trump gave an important speech in Riyadh that may come as close to outlining a “Trump doctrine” for his second term as we’ll probably see.",
    "link": "https://nypost.com/2025/05/15/opinion/president-outlines-the-trump-doctrine-prosperity-equals-peace-for-the-entire-world/",
    "timestamp": "2025-05-15T23:28:20Z"
  },
  {
    "title": "US judge in Huawei criminal case questions Trump order against law firm",
    "description": "The judge overseeing the U.S. criminal case against Chinese telecom Huawei said at a hearing that President Donald Trump's executive order stripping security clearances from lawyers at Jenner & Block could be a hurdle for the company's defense in the case.U.S…",
    "link": "https://www.channelnewsasia.com/business/us-judge-huawei-criminal-case-questions-trump-order-against-law-firm-5133751",
    "timestamp": "2025-05-15T23:25:04Z"
  },
  {
    "title": "Peace breakthrough unlikely as Putin declines to meet Zelensky in Turkey",
    "description": "US Secretary of State Marco Rubio noted that the US didn't have high expectations for the talks, and several world leaders slammed Putin's decision to not come.",
    "link": "https://www.jpost.com/breaking-news/article-854201",
    "timestamp": "2025-05-15T23:22:40Z"
  },
  {
    "title": "Old Video Of Barbara Walters Needling Trump Has Everyone Saying The Same Thing",
    "description": "A short clip from a 1990 interview Walters did with Trump for ABC’s “20/20” made its way onto TikTok, and users say not much has changed.",
    "link": "https://www.huffpost.com/entry/barbara-walters-donald-trump-1990-interview_n_68265096e4b02c37b4dfb9fe",
    "timestamp": "2025-05-15T23:21:57Z"
  },
  {
    "title": "U.S., UAE Presidents attend Unveiling of Phase 1 of A new 5GW AI Campus in Abu Dhabi that will be Powered by NVIDIA chips, OpenAI & others",
    "description": "It’s being reported in the Gulf region that a new 5GW UAE-US AI Campus in Abu Dhabi was unveiled on Thursday at Qasr Al Watan in the presence of President His Highness Sheikh Mohamed bin Zayed Al Nahyan and US. President Donald Trump, who is on a state visit …",
    "link": "https://www.patentlyapple.com/2025/05/us-uae-presidents-attend-unveiling-of-phase-1-of-a-new-5gw-ai-campus-in-abu-dhabi-that-will-be-powered-by-nvidia-chips-op.html",
    "timestamp": "2025-05-15T23:18:02Z"
  },
  {
    "title": "Report: Trump to Put 7K Troops in Govt Offices for Parade",
    "description": "The Trump administration is reportedly planning to house more than 7,000 soldiers in government office buildings for a parade next month on the National Mall that will celebrate the Army's 250th anniversary. According to planning documents obtained by USA Tod…",
    "link": "https://freerepublic.com/focus/f-news/4317252/posts",
    "timestamp": "2025-05-15T23:17:52Z"
  },
  {
    "title": "Democrats look to block UAE arms sales, as Trump announces new deals",
    "description": "WASHINGTON (Reuters) -U.S. congressional Democrats on Thursday sought to block arms sales to the United Arab Emirates over its alleged involvement in Sudan's civil war and concern about crypto currency ties, the same day Republican President Donald Trump anno…",
    "link": "https://www.thestar.com.my/news/world/2025/05/16/democrats-look-to-block-uae-arms-sales-as-trump-announces-new-deals",
    "timestamp": "2025-05-15T23:17:00Z"
  },
  {
    "title": "Is there a genocide of white South Africans as Trump claims?",
    "description": "US President Donald Trump says a genocide is taking place in South Africa, a claim a judge dismissed as \"imaginary\".",
    "link": "https://www.bbc.com/news/articles/c9wg5pg1xp5o",
    "timestamp": "2025-05-15T23:15:49Z"
  },
  {
    "title": "US judge dismisses case against migrants caught in new military zone",
    "description": "The magistrate ruled that apprehended migrants may not have been aware they were crossing into a military zone.",
    "link": "https://www.aljazeera.com/news/2025/5/15/us-judge-dismisses-case-against-migrants-caught-in-new-military-zone",
    "timestamp": "2025-05-15T23:15:25Z"
  },
  {
    "title": "'Callous': Senator shreds Trump for kneecapping key allies who helped US troops",
    "description": "Sen. Tammy Duckworth (D-IL), speaking to CNN, tore into President Donald Trump's move to strip deportation protections away from thousands of Afghans who risked their lives to help U.S. troops carry out their mission against the Taliban in that country.The de…",
    "link": "https://www.rawstory.com/tammy-duckworth-2672025913/",
    "timestamp": "2025-05-15T23:13:31Z"
  },
  {
    "title": "How proposed Medicaid cuts could impact health care in Oregon",
    "description": "A bill that passed a key committee vote in Congress this week would add a work requirement for some on Medicaid and would jeopardize billions in Medicaid funding for Oregon.",
    "link": "https://www.opb.org/article/2025/05/15/how-proposed-medicaid-cuts-could-impact-health-care-in-oregon/",
    "timestamp": "2025-05-15T23:12:41Z"
  },
  {
    "title": "Report: Trump administration tables formal nuclear deal proposal to Iran",
    "description": "Axios reports White House envoy Steve Witkoff delivered an \"elegant\" and \"very big\" offer for a nuclear deal to Iranian Foreign Minister Abbas Araghchi, who has taken it to Tehran for high-level consultations.",
    "link": "https://www.israelnationalnews.com/news/408446",
    "timestamp": "2025-05-15T23:12:22Z"
  },
  {
    "title": "Why was Elon Musk’s AI chatbot Grok preoccupied with South Africa’s racial politics?",
    "description": "Musk spent years criticizing the “woke AI” outputs he says come out of rival chatbots.",
    "link": "https://www.bostonherald.com/2025/05/15/musk-grok-south-africa/",
    "timestamp": "2025-05-15T23:11:59Z"
  },
  {
    "title": "Ontario projects $14.6-billion deficit amid tariff impacts",
    "description": "TORONTO — United States President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n ‘s \n \n \n \n \n \n tariffs\n \n \n \n \n \n cast a pall over \n \n \n \n \n \n Ontario’s budget\n \n \n \n \n \n Thursday, dragging down \n \n \n \n \n \n GDP growth\n \n \n \n \n \n and knocking the province off its path t…",
    "link": "https://biztoc.com/x/ace911a6bc8dec26",
    "timestamp": "2025-05-15T23:11:58Z"
  },
  {
    "title": "'It's Incredible The Trump Administration Is Acting Like This Isn't A Big Deal,' Says Fox Host As LA Port Volume Drops 35% And Layoffs Loom",
    "description": "The Port of Los Angeles, the busiest in the Western Hemisphere, has seen a 35% drop in cargo volume compared to the same period last year, according to Gene Seroka, the port’s executive director. The drop reflects the harsh impact of recent tariffs imposed by…",
    "link": "https://biztoc.com/x/33d14ce6c9518bba",
    "timestamp": "2025-05-15T23:11:55Z"
  },
  {
    "title": "James Comey Deletes Post Depicting '8647' After Backlash Online",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFormer FBI Director James Comey apparently posted a photo of shells on a beach that were aligned to read \"8647\" and has since sparked backlash online by those saying it is a \"threat\" aimed at President Donald …",
    "link": "https://biztoc.com/x/189908319c4c79f9",
    "timestamp": "2025-05-15T23:11:34Z"
  },
  {
    "title": "Beware Qataris bearing jets",
    "description": "Tiny gulf nation 'does not offer gifts without golden strings attached. Ever'",
    "link": "https://www.wnd.com/2025/05/beware-qataris-bearing-jets/",
    "timestamp": "2025-05-15T23:11:00Z"
  },
  {
    "title": "James Comey Deletes Post Depicting '8647' After Backlash Online",
    "description": "Comey's post on Instagram sparked MAGA backlash online Thursday.",
    "link": "https://www.newsweek.com/james-comey-deletes-post-depicting-8647-after-backlash-online-2073031",
    "timestamp": "2025-05-15T23:09:06Z"
  },
  {
    "title": "US Supreme Court grapples with Trump bid to restrict birthright citizenship",
    "description": "SummaryTrump order targeted children of certain immigrants Three judges issued orders blocking policy nationwide Administration challenges nationwide injunctions WASHINGTON, May 15 (Reuters) - The U.S. Supreme Court wrestled on Thursday over Donald Trump's at…",
    "link": "https://freerepublic.com/focus/f-news/4317250/posts",
    "timestamp": "2025-05-15T23:07:37Z"
  },
  {
    "title": "'Calling for my dad to be murdered!' MAGA melts down over Jim Comey's beach photo",
    "description": "MAGA allies melted down Thursday afternoon over former FBI Director Jim Comey's beach photo referencing President Donald Trump.Comey posted on Instagram a photo of rocks on a sandy beach that spell out \"86 47.\" He captioned the photo, \"Cool shell formation on…",
    "link": "https://www.rawstory.com/jim-comey-2672026096/",
    "timestamp": "2025-05-15T23:06:17Z"
  },
  {
    "title": "Border czar Homan shrugs off Ocasio-Cortez's ICE arrest warning, tells her 'you can't intimidate me'",
    "description": "Trump's border czar Tom Homan challenges Ocasio-Cortez, emphasizing his long career in immigration enforcement and criticizing her stance on ICE and sanctuary cities.",
    "link": "https://www.foxnews.com/media/border-czar-homan-shrugs-off-ocasio-cortezs-ice-arrest-warning-tells-her-you-cant-intimidate-me",
    "timestamp": "2025-05-15T23:05:03Z"
  },
  {
    "title": "EXCLUSIVE: Meet Harris Faulkner, The Fox News Host Who Is Bearing Down On ‘The View’ In Ratings Duel",
    "description": "At first glance, it seems like an unfair competition: On one side, five co-hosts, some of whom are relatively well-known. On the other side, just one anchor.",
    "link": "https://dailycaller.com/2025/05/15/exclusive-meet-harris-faulkner-fox-news-host-the-view-ratings-duel/",
    "timestamp": "2025-05-15T23:04:32Z"
  },
  {
    "title": "Trump’s Gulf Dealmaking Bonanza",
    "description": "Saudi Arabia and Qatar made splashy economic commitments worth nearly $2 trillion during the U.S. president’s visit.",
    "link": "http://foreignpolicy.com/2025/05/15/trump-dealmaking-gulf-saudi-arabia-qatar/",
    "timestamp": "2025-05-15T23:04:14Z"
  },
  {
    "title": "Rob Manfred’s Donald Trump fan service",
    "description": "Combine a guy who palpably hates the sport he’s in charge of and a Donald Trump courtier and whammo you get terrible policy decisions: If anybody ever earned it, Pete Rose has certainly earned his place on Major League Baseball’s permanently ineligible list. …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/rob-manfreds-donald-trump-fan-service",
    "timestamp": "2025-05-15T23:03:17Z"
  },
  {
    "title": "Gen Z men are becoming more religious. The women, not so much.",
    "description": "Among the persistent mysteries of the 2024 election is the roots of the modern political gender gap, particularly among young people. Though their final vote choices were a bit more nuanced than some pre-election polls suggested, young men and women, aged 18 …",
    "link": "https://www.vox.com/life/413227/gen-z-men-women-religion-spiritual-christianity-politics",
    "timestamp": "2025-05-15T23:01:44Z"
  },
  {
    "title": "Dollar under threat led to Trump’s about-face on tariffs",
    "description": "President Trump’s so-called tariff “liberation day” brought significant financial fallout for the US, threatening the dollar’s supremacy and revealing deeper vulnerabilities in the US macroeconomic outlook. Fabio Sabatini writes that the threat to the dominan…",
    "link": "https://blogs.lse.ac.uk/businessreview/2025/05/16/dollar-under-threat-led-to-trumps-about-face-on-tariffs/",
    "timestamp": "2025-05-15T23:01:00Z"
  },
  {
    "title": "Canadian travel numbers to the US keep getting worse",
    "description": "While President Donald Trump has dialed back his earlier rhetoric calling Canada the \"51st state\" and then-Prime Minister Justin Trudeau its \"governor,\" Canadians are largely holding firm on the choice not to travel to the U.S. in protest of the current admin…",
    "link": "https://biztoc.com/x/0191e3dd9c83ec79",
    "timestamp": "2025-05-15T23:00:43Z"
  },
  {
    "title": "What do the Gulf states gain from the US president’s historic visit?",
    "description": "US President Donald Trump hails deals during his three-country tour of the Gulf region.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/5/15/what-do-the-gulf-states-gain-from-the-us-presidents-historic-visit",
    "timestamp": "2025-05-15T23:00:30Z"
  },
  {
    "title": "Why First Solar Has Surged More Than 40% in One Month",
    "description": "First Solar (NASDAQ:FSLR) has emerged as one of the biggest gainers in the long-suffering solar sector, jumping nearly 20% on Tuesday after a report that U.S. House GOP lawmakers have come up with a big tax and spending package that includes less extreme cred…",
    "link": "https://oilprice.com/Energy/Energy-General/Why-First-Solar-Has-Surged-More-Than-40-in-One-Month.html",
    "timestamp": "2025-05-15T23:00:00Z"
  },
  {
    "title": "GOP Congressman Slips Up by Talking About ‘Medicaid Cuts, Uh, Medicaid Reforms, I Should Say’",
    "description": "Rep. Jason Smith briefly admitted that House Republicans plan to cut Medicaid, which Republicans have insisted they are not actually doing. \nThe post GOP Congressman Slips Up by Talking About ‘Medicaid Cuts, Uh, Medicaid Reforms, I Should Say’  first appeared…",
    "link": "https://www.mediaite.com/tv/gop-congressman-slips-up-by-talking-about-medicaid-cuts-uh-medicaid-reforms-i-should-say/",
    "timestamp": "2025-05-15T22:58:48Z"
  },
  {
    "title": "Stocks, Bonds Climb as Trade-Truce Rally Holds: Markets Wrap",
    "description": "Asian equity futures were supported by gains on Wall Street in a sign the stock market rally has further to run. Treasuries advanced as traders priced in two Federal Reserve rate cuts this year.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-bonds-climb-as-trade-truce-rally-holds-markets-wrap",
    "timestamp": "2025-05-15T22:56:43Z"
  },
  {
    "title": "Is America prepared for all the horrors we might find on Donald Trump Jr's laptop? [Scary]",
    "description": "Is America prepared for all the horrors we might find on Donald Trump Jr's laptop?",
    "link": "https://www.fark.com/comments/13672454/Is-America-prepared-for-all-horrors-we-might-find-on-Donald-Trump-Jrs-laptop",
    "timestamp": "2025-05-15T22:55:33Z"
  },
  {
    "title": "Money Printer Go Brr? Arthur Hayes Thinks It's Coming—And Bitcoin Will Go Nuts",
    "description": "Bitcoin is the \"perfect and only lifeboat,\" crypto entrepreneur Hayes has argued.",
    "link": "https://decrypt.co/320320/money-printer-go-brr-arthur-hayes-bitcoin-go-nuts",
    "timestamp": "2025-05-15T22:51:55Z"
  },
  {
    "title": "EX-FBI chief Comey’s post to ‘86’ Trump condemned by White House as attempt to put ‘hit’ on president",
    "description": "FBI head James Comey is getting lambasted online after he shared a post on social media that many are taking as a \"hit\" on President Donald Trump's life.",
    "link": "https://www.foxnews.com/politics/ex-fbi-chief-comeys-post-86-trump-condemned-white-house-attempt-put-hit-president",
    "timestamp": "2025-05-15T22:49:35Z"
  },
  {
    "title": "James Comey accused of posting 'hit' against Trump on Instagram",
    "description": "FBI head James Comey is getting lambasted online after he shared a post on social media that many are taking as a \"hit\" on President Donald Trump's life.",
    "link": "https://www.foxnews.com/politics/ex-fbi-chief-comeys-86-47-social-media-post-condemned-white-house-attempt-put-hit-president",
    "timestamp": "2025-05-15T22:49:35Z"
  },
  {
    "title": "Qatar “Gifts” Trump a $400 Million Luxury Jet",
    "description": "Is a free plane ever really a free plane? Nope.",
    "link": "https://slate.com/podcasts/political-gabfest/2025/05/politics-crypto-deals-and-jumbo-jets-are-on-the-menu-as-trump-tours-middle-east",
    "timestamp": "2025-05-15T22:44:53Z"
  },
  {
    "title": "Space Force, governors at odds over plans to pull talent from National Guard units",
    "description": "The National Governors Association said the transfers violate their right to retain control over their state units.",
    "link": "https://www.bostonherald.com/2025/05/15/space-force-national-guard-talent/",
    "timestamp": "2025-05-15T22:43:44Z"
  },
  {
    "title": "'Tools!' MTG lashes out after report Trump team pushed her out of Senate bid",
    "description": "Rep. Marjorie Taylor Greene (R-GA) is pushing back hard against new reporting by the Wall Street Journal that President Donald Trump personally intervened to talk her out of running for Senate.For weeks, Greene had publicly entertained the idea of a run condi…",
    "link": "https://www.rawstory.com/mtg-senate-poll/",
    "timestamp": "2025-05-15T22:42:22Z"
  },
  {
    "title": "Trump's Middle East visit brings relief to Nvidia and AI supply chain",
    "description": "Industry insiders revealed that just as the market believed the rapid growth of AI was slowing down and Nvidia's performance would no longer be spectacular, US President Donald Trump demonstrated a dual strategy of \"carrot and stick\" by leading several top Am…",
    "link": "https://www.digitimes.com/news/a20250515PD209/nvidia-market-supply-chain-middle-east-growth.html",
    "timestamp": "2025-05-15T22:41:34Z"
  },
  {
    "title": "Kid Rock's Restaurant Shields Illegal Employees From ICE Agents: Report",
    "description": "Three establishments in downtown Nashville have reportedly had fewer workers on staff because of concerns about arrests.",
    "link": "https://www.newsweek.com/kid-rock-ice-raids-nashville-restaurant-2073012",
    "timestamp": "2025-05-15T22:41:08Z"
  },
  {
    "title": "Republicans Are Back To Arresting People In Wheelchairs",
    "description": "Over two dozen people were arrested at the U.S. Capitol on Tuesday for protesting Republicans' plans to cut Medicaid as part of a sweeping reconciliation package that would gut programs for the working class to\nprovide tax giveaways to the wealthy.\n\n\n\"Around …",
    "link": "https://crooksandliars.com/2025/05/republicans-are-back-arresting-people",
    "timestamp": "2025-05-15T22:39:58Z"
  },
  {
    "title": "These retailers have announced higher prices amid President Trump’s tariffs",
    "description": "NEW YORK — Volley after volley of tariffs — and at times on-again, off-again trade actions — have put companies around the world on edge. And a handful of major retailers have already raised prices across the U.S., or warned of future hikes.\nPresident Donald …",
    "link": "https://biztoc.com/x/7670e1538d1ff185",
    "timestamp": "2025-05-15T22:38:42Z"
  },
  {
    "title": "Military commanders will be told to send transgender troops to medical checks to oust them",
    "description": "The process raises comparisons to the early “Don’t Ask, Don’t Tell” policy.",
    "link": "https://www.bostonherald.com/2025/05/15/us-military-transgender-medical-checks/",
    "timestamp": "2025-05-15T22:38:31Z"
  },
  {
    "title": "White South African refugees reveal partisan pundits’ true colors — and they’re ugly",
    "description": "Leftists are so steeped in a worldview of oppression and victimhood that it’s impossible for them to believe white people could ever be on the receiving end of racial hate.",
    "link": "https://nypost.com/2025/05/15/opinion/white-refugees-reveal-partisan-pundits-true-colors/",
    "timestamp": "2025-05-15T22:36:08Z"
  },
  {
    "title": "Trump's scheme to ensnare migrants with massive defense zone 'falls flat' with judge",
    "description": "President Donald Trump lost another court case on Thursday regarding his crackdown on immigration. One of the administration's ideas was to make part of New Mexico's border with Mexico a National Defense Area. It would allow the Justice Department to charge b…",
    "link": "https://www.rawstory.com/trump-border-2672025948/",
    "timestamp": "2025-05-15T22:36:02Z"
  },
  {
    "title": "Roy Cooper's Chances of Beating Thom Tillis in North Carolina—Polls",
    "description": "Democrats face a tough Senate map in 2026, but North Carolina will be one of the key states they aim to flip.",
    "link": "https://www.newsweek.com/roy-coopers-chances-beating-thom-tillis-north-carolinapolls-2073022",
    "timestamp": "2025-05-15T22:35:58Z"
  },
  {
    "title": "After Two SpaceX Explosions, U.K. Officials Ask FAA to Change Starship Flight Plans",
    "description": "by Heather Vogell \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nBritish officials told the U.S. they are concerned about the safety of SpaceX…",
    "link": "https://www.propublica.org/article/spacex-starship-explosions-uk-turks-caicos-faa-launches",
    "timestamp": "2025-05-15T22:35:00Z"
  },
  {
    "title": "Nicolas Maduro Claims He 'Rescued' Venezuelan Toddler Repatriated from U.S.",
    "description": "Venezuela's socialist dictator Nicolás Maduro celebrated on Wednesday the scheduled return of two-year-old Venezuelan Maikelys Espinoza.\nThe post Nicolás Maduro Claims He ‘Rescued’ Venezuelan Toddler Repatriated from U.S. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/05/15/nicolas-maduro-claims-he-rescued-venezuelan-toddler-repatriated-from-u-s/",
    "timestamp": "2025-05-15T22:30:44Z"
  },
  {
    "title": "Supreme Court could block Trump's birthright citizenship order but limit injunctions",
    "description": "The Supreme Court seemed intent Thursday on keeping a block on President Donald Trump's restrictions on birthright citizenship while looking for a way to scale back nationwide court orders.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_4cefd287-9565-5aee-8f50-01f14efcb2f4.html",
    "timestamp": "2025-05-15T22:30:00Z"
  },
  {
    "title": "'I didn't come here for fun' - Afrikaner defends refugee status in US",
    "description": "Charl Kleinhaus tells the BBC he had no choice but to leave his farm in South Africa after receiving death threats.",
    "link": "https://www.bbc.com/news/articles/c98p3eple9eo",
    "timestamp": "2025-05-15T22:28:58Z"
  },
  {
    "title": "'I didn't come here for fun': Afrikaner defends refugee status in US",
    "description": "Charl Kleinhaus tells the BBC he had no choice but to leave his farm in South Africa after receiving death threats.",
    "link": "https://www.bbc.co.uk/news/articles/c98p3eple9eo",
    "timestamp": "2025-05-15T22:28:58Z"
  },
  {
    "title": "Democrats are delusional to blame Biden for their election mess",
    "description": "Now that they've admitted the truth about Joe Biden's mental decline, Democrats are rushing to pin their party's troubles on him.",
    "link": "https://nypost.com/2025/05/15/opinion/democrats-are-delusional-to-blame-biden-for-their-mess/",
    "timestamp": "2025-05-15T22:27:29Z"
  },
  {
    "title": "JD Vance Takes Jab At ‘Far-Left Prosecutors,’ ‘Weak-Willed’ Politicians At National Police Memorial Event",
    "description": "Vice President Vance promised that the Trump administration will \"stand behind the men and women in blue\" in a Thursday speech at the U.S. Capitol.",
    "link": "https://dailycaller.com/2025/05/15/jd-vance-prosecutors-politicians-national-police-memorial/",
    "timestamp": "2025-05-15T22:25:43Z"
  },
  {
    "title": "James Comey appears to call for the assassination of President Trump",
    "description": "Former FBI director's caption on Instagram post: 'Cool shell formation on my beach walk'",
    "link": "https://www.wnd.com/2025/05/james-comey-appears-to-call-for-the-assassination-of-president-trump/",
    "timestamp": "2025-05-15T22:24:16Z"
  },
  {
    "title": "JD Vance, Marco Rubio to attend Pope Leo XIV’s inaugural Mass at the Vatican",
    "description": "Vice President JD Vance speaks at a film-screening event April 1, 2025, at the Heritage Foundation in Washington, D.C. / Credit: Erin Granzow/Courtesy of the Heritage Foundation\n\nWashington, D.C. Newsroom, May 15, 2025 / 18:23 pm (CNA).\nU.S. Vice President JD…",
    "link": "https://www.catholicnewsagency.com/news/264135/jd-vance-marco-rubio-to-attend-pope-leo-xivs-inaugural-mass-at-the-vatican",
    "timestamp": "2025-05-15T22:23:00Z"
  },
  {
    "title": "Trump Can’t Stop Talking About Pete Buttigieg’s Bike",
    "description": "President Donald Trump’s current rotation of hyperfixations include an illegal third term and gaudy office décor. Recently, a new subject seems to have found its way into his brain and got stuck there: Pete Buttigieg’s commute to work.",
    "link": "http://www.thecut.com/article/donald-trump-comments-pete-buttigieg-bike.html",
    "timestamp": "2025-05-15T22:22:28Z"
  },
  {
    "title": "Is birthright citizenship safe from Trump?",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Supreme Court heard arguments about a birthright c…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/413300/supreme-court-birthright-citizenship-case-nationwide-injunction",
    "timestamp": "2025-05-15T22:21:45Z"
  },
  {
    "title": "Putin Snubs Peace Talks With Zelensky in Istanbul",
    "description": "Despite having proposed the face-to-face meeting, the Russian leader chose not to show.",
    "link": "http://foreignpolicy.com/2025/05/15/russia-ukraine-peace-talks-putin-zelensky-istanbul-turkey-trump/",
    "timestamp": "2025-05-15T22:18:32Z"
  },
  {
    "title": "Trump admin sends warning to California as trans athlete advances in state track and field championship",
    "description": "Trump's administration challenges California's CIF over trans athlete inclusion in girls' sports, sparking protests and a Title IX investigation.",
    "link": "https://www.foxnews.com/sports/california-facing-growing-controversy-trans-athlete-advances-state-track-field-postseason",
    "timestamp": "2025-05-15T22:18:22Z"
  },
  {
    "title": "Tiffany Trump Welcomes Baby Boy, President Trump’s 11th Grandchild",
    "description": "First daughter Tiffany Trump, 31, and her husband, Michael Boulos, welcomed a baby boy on Thursday. \nThe post Tiffany Trump Welcomes Baby Boy, President Trump’s 11th Grandchild appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/15/tiffany-trump-welcomes-baby-boy-president-donald-trumps-11th-grandchild/",
    "timestamp": "2025-05-15T22:17:42Z"
  },
  {
    "title": "FEMA Chief Says Agency Will Raise State Burden for Disasters to 50%",
    "description": "David Richardson, the new head of the Federal Emergency Management Agency, said on Thursday that states would in the future bear half the costs for responding to natural disasters, up from 25% under current cost-sharing levels. Richardson, who took the …",
    "link": "https://www.insurancejournal.com/news/national/2025/05/15/823980.htm",
    "timestamp": "2025-05-15T22:17:38Z"
  },
  {
    "title": "Senate Republicans put House on notice: We won't accept your Trump agenda bill without changes",
    "description": "As House Republicans scramble to corral the votes to pass a massive bill for President Donald Trump's agenda, their Senate counterparts are making clear the emerging package won’t fly as written when it reaches them.",
    "link": "https://biztoc.com/x/8a8eaa12f4617261",
    "timestamp": "2025-05-15T22:16:42Z"
  },
  {
    "title": "Gaza aid impasse: UN declines role in US-led humanitarian effort",
    "description": "UN says it will not participate in a new US-backed Gaza aid operation, citing concerns over impartiality and independence.",
    "link": "https://www.israelnationalnews.com/news/408445",
    "timestamp": "2025-05-15T22:16:40Z"
  },
  {
    "title": "Putin Refuses to Meet Zelenskiy for Peace Talks in Turkey",
    "description": "US President Donald Trump said there’ll be no resolution of Russia’s war in Ukraine until he meets with Russian leader Vladimir Putin, as a delegation from Kyiv set off to Istanbul for potential ceasefire talks with Moscow counterparts.\nRead more:…",
    "link": "https://biztoc.com/x/0adb6caa8138fddb",
    "timestamp": "2025-05-15T22:16:27Z"
  },
  {
    "title": "Green Energy Think Tank Reportedly Cuts Staff After DOE Grant Cancellations",
    "description": "A renewable energy nonprofit is reportedly cutting 10% of its staff just weeks after the Trump administration pulled Biden-era grants worth millions of dollars.",
    "link": "https://dailycaller.com/2025/05/15/green-energy-think-tank-cuts-staff-doe-grant-cancellations/",
    "timestamp": "2025-05-15T22:15:10Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The S&P 500 rose for a fifth straight day on Friday, riding a relief rally in response to the U.S. and China agreeing to temporarily slash tariffs.",
    "link": "https://www.cnbc.com/2025/05/15/stock-market-today-live-updates.html",
    "timestamp": "2025-05-15T22:14:50Z"
  }
]