[
  {
    "title": "Donald Trump Plans to Skip the Super Bowl This Year",
    "description": "Donald Trump Plans to Skip the Super Bowl This Yearlittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-super-bowl",
    "timestamp": "2026-01-27T15:37:53Z"
  },
  {
    "title": "Donald Trump's Eerie Prediction: President Rattled Allies After Claiming He'll Be Dead in 10 Years as Health Fears Mount",
    "description": "Donald Trump's Eerie Prediction: President Rattled Allies After Claiming He'll Be Dead in 10 Years as Health Fears Mountnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4462678963154-donald-trump-s-eerie-prediction-president-rattled-allies-after-claiming-he-ll-be-dead-in-10-years-as-health-fears-mount?_f=app_share&amp;pd=04sXyM5Z&amp;lang=en_US&amp;send_time=1769527981&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.1.11%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-27T15:37:44Z"
  },
  {
    "title": "Trinidadian Families Sue the Trump Admin Over Wrongful Deaths in October Boat Strike",
    "description": "The families of Trinidadian fishermen killed by the U.S. military in an October boat strike are demanding justice.",
    "link": "https://www.jezebel.com/boat-strikes-venezuela-lawsuit-wrongful-death-trinidad-and-tobago-families-pete-hegseth-donald-trump",
    "timestamp": "2026-01-27T15:36:00Z"
  },
  {
    "title": "Israel retrieves final hostage’s body from Gaza",
    "description": "The 24-year-old police officer was killed during the initial Hamas attack",
    "link": "https://theweek.com/world-news/israel-retrieves-final-hostage-body-gaza",
    "timestamp": "2026-01-27T15:35:50Z"
  },
  {
    "title": "'Bonjour!': Starmer Mocks President Macron's WEF Sunglasses",
    "description": "UK PM Starmer poked some fun at French President Emmanuel Macrons' appearance at globalist talking shop behind a pair of aviator sunglasses.\nThe post ‘Bonjour!’: Starmer Mocks President Macron’s WEF Sunglasses appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/27/bonjour-starmer-mocks-president-macrons-wef-sunglasses/",
    "timestamp": "2026-01-27T15:34:31Z"
  },
  {
    "title": "EU-India trade deal leaves bloc's carbon border tariff intact",
    "description": "India and the EU have reached a trade deal, but the EU's carbon border tariff will remain unchanged despite India's concerns. The EU pledged no country will receive favorable treatment under the scheme, while agreeing to technical talks and providing support …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/eu-india-trade-deal-leaves-blocs-carbon-border-tariff-intact/articleshow/127635656.cms",
    "timestamp": "2026-01-27T15:29:53Z"
  },
  {
    "title": "‘Closer than ever’: Doomsday Clock moves to 85 seconds to midnight as world faces fresh nuclear threats",
    "description": "Nuclear and climate threats among reasons time is set at its closest-ever point to global catastrophe",
    "link": "https://www.irishtimes.com/world/us/2026/01/27/closer-than-ever-doomsday-clock-moves-to-85-seconds-to-midnight-as-world-faces-fresh-nuclear-threats/",
    "timestamp": "2026-01-27T15:29:48Z"
  },
  {
    "title": "Trump Fan Draws Fire on CNN Claiming Alex Pretti ‘Was Obviously Not Murdered’ — Was In ‘Scrum’ That ‘Ended in Bad Shoot’",
    "description": "Trump supporter and NewsNation host Batya Ungar-Sargon drew flak on CNN when she declared that Alex Pretti \"was obviously not murdered.\"\nThe post Trump Fan Draws Fire on CNN Claiming Alex Pretti ‘Was Obviously Not Murdered’ — Was In ‘Scrum’ That ‘Ended in Bad…",
    "link": "https://www.mediaite.com/media/news/trump-fan-draws-fire-on-cnn-claiming-alex-pretti-was-obviously-not-murdered-was-in-scrum-that-ended-in-bad-shoot/",
    "timestamp": "2026-01-27T15:29:27Z"
  },
  {
    "title": "Did Trump Send Tom Homan to Minnesota Because Fox News Begged Him?",
    "description": "The president’s favorite TV network still has some sway with the Oval Office.On Monday morning, Fox & Friends host Brian Kilmeade floated a novel idea on air: Solve the collapsing environment in Minnesota by introducing border czar Tom Homan into the situatio…",
    "link": "https://newrepublic.com/post/205751/donald-trump-tom-homan-minnesota-fox-news",
    "timestamp": "2026-01-27T15:27:52Z"
  },
  {
    "title": "White, Liberal Women on the Warpath: Guys, We Missed the Warning Signs",
    "description": "Agatha Christie never spun a mystery as perplexing as that of white liberal women going all in on protecting criminal illegal immigrants. Screaming, screeching, blowing... Read More\nThe post White, Liberal Women on the Warpath: Guys, We Missed the Warning Sig…",
    "link": "https://www.dailysignal.com/2026/01/27/white-liberal-women-on-the-warpath-guys-we-missed-the-warning-signs/",
    "timestamp": "2026-01-27T15:27:12Z"
  },
  {
    "title": "Trump inches back ICE deployment in Minnesota",
    "description": "The decision comes following the shooting of Alex Pretti by ICE agents",
    "link": "https://theweek.com/politics/trump-inches-back-ice-minnesota",
    "timestamp": "2026-01-27T15:25:43Z"
  },
  {
    "title": "Trump whines that he's facing possible midterm losses: 'Doesn't make sense'",
    "description": "President Donald Trump complained Tuesday that he could lose control of Congress in the upcoming midterm elections.During a Tuesday interview with WABC's Sid & Friends, Trump argued that Democratic leaders opposing his immigration policies were \"not good peop…",
    "link": "https://www.rawstory.com/trump-midterm-losses/",
    "timestamp": "2026-01-27T15:24:23Z"
  },
  {
    "title": "Support slipping for Trump immigration push as majority say crackdown ‘goes too far’: poll",
    "description": "Trump's immigration approval hits new low as 53% disapprove of his handling, down from 50% approval last year amid aggressive ICE enforcement operations.",
    "link": "https://www.foxnews.com/politics/support-slipping-trump-immigration-push-majority-say-crackdown-goes-too-far-poll",
    "timestamp": "2026-01-27T15:23:37Z"
  },
  {
    "title": "It Sure Looks Like This Is the End of the Road for CBP Chief",
    "description": "Customs and Border Patrol Commander-at-Large Greg Bovino may be on his way out after delivering a full-throated defense for killing a U.S. citizen in broad daylight. Bovino has reportedly been removed from his position as commander-at-large. He will depart Mi…",
    "link": "https://newrepublic.com/post/205750/customs-border-protection-cbp-bovino-minnesota-retire",
    "timestamp": "2026-01-27T15:23:23Z"
  },
  {
    "title": "Jeff Bezos jetted off to Paris amid fears of mass layoffs at the Washington Post",
    "description": "Here are some photos of Jeff Bezos and Lauren Sanchez at Paris Fashion Week (this week). On Monday, they attended the Schiaparelli show. Bezos has grown a beard and I hate to admit this, but it’s a good look for him. He looks more distinguished. But then I us…",
    "link": "https://www.celebitchy.com/958991/jeff_bezos_jetted_off_to_paris_amid_fears_of_mass_layoffs_at_the_washington_post/",
    "timestamp": "2026-01-27T15:20:25Z"
  },
  {
    "title": "‘Mother of all deals’: How India-EU trade deal creates $27 trillion market",
    "description": "Major agreement reached after 20 years of negotiations and during ongoing tensions with the US.",
    "link": "https://www.aljazeera.com/economy/2026/1/27/mother-of-all-deals-how-india-eu-trade-deal-creates-27-trillion-market",
    "timestamp": "2026-01-27T15:19:25Z"
  },
  {
    "title": "Iran’s currency drops to record low against dollar as tensions soar",
    "description": "Rial hits record ‍1,500,000 rials to ‍the US ⁠dollar, weeks after protests prompted by currency's falling value.",
    "link": "https://www.aljazeera.com/news/2026/1/27/irans-currency-drops-to-record-low-against-dollar-as-tensions",
    "timestamp": "2026-01-27T15:18:45Z"
  },
  {
    "title": "Anti-ICE Rioters See Full Moon, Bird, While Mobbing Hotel Reportedly Housing Federal Agents",
    "description": "A patron at a Minneapolis-area hotel mooned a left-wing mob targeting the establishment before delivering a mid-digital salute in video posted to social media.",
    "link": "https://dailycaller.com/2026/01/27/anti-ice-rioters-see-full-moon-bird-while-mobbing-hotel-reportedly-housing-federal-agents/",
    "timestamp": "2026-01-27T15:17:21Z"
  },
  {
    "title": "People on Polymarket Are Making a Fortune by Betting Against Elon Musk’s Famously Worthless Promises",
    "description": "\"He does have a solid fan base, and so if I can help separate them from some of their money, I’m always happy to do that.\"\nThe post People on Polymarket Are Making a Fortune by Betting Against Elon Musk’s Famously Worthless Promises appeared first on Futurism.",
    "link": "http://futurism.com/future-society/polymarket-fortune-betting-against-elon-musk",
    "timestamp": "2026-01-27T15:17:18Z"
  },
  {
    "title": "Editor Daily Rundown: Trump Deploys Border Czar Tom Homan To Address Minnesota Chaos",
    "description": "TRUMP CALLS ON HOMAN TO BRING DOWN THE TEMPERATURE IN MINNESOTA ... Trump Turns To Beloved Border Czar Tom Homan As Fractures Open In DHS\n\nDrama between Border Czar Tom Homan and Homeland Security Secretary Kristi Noem has been trickling into the media for mo…",
    "link": "https://dailycaller.com/2026/01/27/editor-daily-rundown-trump-deploys-border-czar-tom-homan-to-address-minnesota-chaos/",
    "timestamp": "2026-01-27T15:17:15Z"
  },
  {
    "title": "Steven Everts' interview for De Standaard",
    "description": "“Phenomenal.” It will not be Donald Trump’s long, rambling speech that Steven Everts remembers from Davos, but the impressive address by Canadian Prime Minister Mark Carney.",
    "link": "https://www.iss.europa.eu/activities/news/we-need-build-new-world-order-what-unifying-idea-steven-everts-interview-de",
    "timestamp": "2026-01-27T15:17:10Z"
  },
  {
    "title": "Germany's Green Party under pressure over Mercosur vote",
    "description": "The Greens are big supporters of international agreements. But now, eight German lawmakers in the European Parliament have all but scuppered the Mercosur free trade agreement — defying their party leadership. Green Party co-chair Franziska Brantner seemed ver…",
    "link": "https://www.dw.com/en/germanys-green-party-under-pressure-over-mercosur-vote/a-75677747",
    "timestamp": "2026-01-27T15:17:00Z"
  },
  {
    "title": "Rick Rieder, a rising favorite for Trump's Fed chair pick, sees bitcoin as new gold",
    "description": "As Trump mulls the next leader of the U.S. Federal Reserve, the BlackRock executive has caught a surge of online wagers, and he'd bring a pro-crypto view.",
    "link": "https://www.coindesk.com/news-analysis/2026/01/27/rick-rieder-a-rising-favorite-for-trump-s-fed-chair-pick-sees-bitcoin-as-new-gold",
    "timestamp": "2026-01-27T15:15:51Z"
  },
  {
    "title": "Korean Cars Are About To Get More Expensive As Trump Raises Tariffs To 25%",
    "description": "Bad news for Hyundai Motor Group and expensive times for GM. Turns out, making cars is complicated.",
    "link": "https://www.jalopnik.com/2086126/trump-raises-korean-car-tariff-to-25-percent/",
    "timestamp": "2026-01-27T15:14:20Z"
  },
  {
    "title": "I’ve Covered Migration and Borders for Years. This Is What I’ve Learned.",
    "description": "Patrick Strickland\n\n\n\nBorders are both crime scenes and crimes, with nationalism the motive.\r\n\n\r\n\n\nThe post I’ve Covered Migration and Borders for Years. This Is What I’ve Learned. appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/borders-migration-imperialism-refugees/",
    "timestamp": "2026-01-27T15:13:49Z"
  },
  {
    "title": "Fetterman Urges Trump To Fire ‘Grossly Incompetent’ Noem",
    "description": "Fetterman is a moderate Democrat who has broken with his party in the past to support some of Trump’s deportation efforts.",
    "link": "https://www.forbes.com/sites/saradorn/2026/01/27/fetterman-urges-trump-to-fire-grossly-incompetent-noem/",
    "timestamp": "2026-01-27T15:13:40Z"
  },
  {
    "title": "First wrongful death lawsuit filed against Trump administration over boat strikes",
    "description": "WASHINGTON — Family members of two Trinidadian men who were killed in a U.S. strike on an alleged drug-smuggling boat in October sued the U.S. government Tuesday, accusing it of wrongful death and extrajudicial killings",
    "link": "https://www.nbcnews.com/politics/white-house/first-wrongful-death-lawsuit-filed-trump-administration-drug-boat-stri-rcna256022",
    "timestamp": "2026-01-27T15:13:16Z"
  },
  {
    "title": "Trump ally tells government to 'wake up' after deadly federal agent shootings in Minneapolis",
    "description": "Rep. Mike Lawler, R-N.Y., called for immigration policy reform following two fatal shootings in Minneapolis, demanding reassessment of tactics and for Congress to take action.",
    "link": "https://www.foxnews.com/media/trump-ally-tells-government-wake-up-after-deadly-federal-agent-shootings-minneapolis",
    "timestamp": "2026-01-27T15:11:00Z"
  },
  {
    "title": "GSEB HSC 2026 hall ticket for practical exams out: Direct link to download Gujarat board admit card here",
    "description": "The Gujarat Secondary and Higher Secondary Education Board (GSHSEB) has released hall tickets for Class 12 practical exams, scheduled from February 5 to 13, 2026. Schools will distribute these admit cards to students, who must present them with valid ID for e…",
    "link": "https://timesofindia.indiatimes.com/education/news/gseb-hsc-2026-hall-ticket-for-practical-exams-out-direct-link-to-download-gujarat-board-admit-card-here/articleshow/127634272.cms",
    "timestamp": "2026-01-27T15:07:38Z"
  },
  {
    "title": "Kimmel, Colbert, Jon Stewart Address Alex Pretti’s Murder, Fallon Says Nothing",
    "description": "The \"apolitical\" Tonight Show host even welcomed NYC mayor Zohran Mamdani during his opening monologue\nKimmel, Colbert, Jon Stewart Address Alex Pretti’s Murder, Fallon Says Nothing\nAlex Young",
    "link": "https://consequence.net/2026/01/alex-pretti-kimmel-colbert-daily-show-fallon/",
    "timestamp": "2026-01-27T15:07:29Z"
  },
  {
    "title": "Trump on US troop reinforcements: Hope we don't have to use them",
    "description": "The US military is conducting a multi-day air exercise in the Middle East as part of a regional preparedness.US President Donald Trump referred to the transfer of American forces and said: \"I hope we don't have to use them.\"",
    "link": "https://www.israelnationalnews.com/flashes/675236",
    "timestamp": "2026-01-27T15:06:03Z"
  },
  {
    "title": "The Trump Administration’s “Ransom Note” To Minnesota",
    "description": "Officials are warning that states need to be prepared for what happens next.",
    "link": "https://www.huffpost.com/entry/minnesota-trump-ice-voter-rolls_n_6978c376e4b0a848d14f2477",
    "timestamp": "2026-01-27T15:05:45Z"
  },
  {
    "title": "Glenfarne announces next wave of nonbinding agreements",
    "description": "The majority owner of the Alaska LNG project announced last week that major preliminary agreements had been reached, advancing the project into an early construction phase.",
    "link": "https://www.newsminer.com/news/local_news/glenfarne-announces-next-wave-of-nonbinding-agreements/article_e78f87fd-9434-4cc2-8525-79e85c3ee6ca.html",
    "timestamp": "2026-01-27T15:05:00Z"
  },
  {
    "title": "Investors Bet Sheinbaum Can Shield Mexican Peso From Trump",
    "description": "Investors are betting President Claudia Sheinbaum’s ability to defuse disputes with Donald Trump will help extend one of the best currency rallies in emerging markets this year.",
    "link": "https://financialpost.com/pmn/business-pmn/investors-bet-sheinbaum-can-shield-mexican-peso-from-trump",
    "timestamp": "2026-01-27T15:03:19Z"
  },
  {
    "title": "Trump administration sued over 2 deaths in boat strike off Venezuela's coast",
    "description": "BOSTON, Jan 27 (Reuters) - Family members of ‌two men killed in a U.S. missile strike against a suspected drug boat near Venezuela filed a wrongful ‌death lawsuit on Tuesday, alleging the pair were murdered in a \"manifestly unlawful\" military campaign targeti…",
    "link": "https://www.thestar.com.my/news/world/2026/01/27/trump-administration-sued-over-2-deaths-in-boat-strike-off-venezuela039s-coast",
    "timestamp": "2026-01-27T15:02:00Z"
  },
  {
    "title": "1 Year In, California Trump Voters Take Stock of His Second Term",
    "description": "A year into President Donald Trump’s second term, Californians who supported him offer a mixed verdict — from staunch approval to sharp disappointment.",
    "link": "https://www.kqed.org/news/12070480/one-year-in-california-trump-voters-take-stock-of-his-second-term",
    "timestamp": "2026-01-27T15:00:44Z"
  },
  {
    "title": "CNN’s Elie Honig Points Out ‘Irregularities’ In Investigation Into Shooting Of Alex Pretti",
    "description": "CNN's Elie Honig laid out several \"irregularities\" into the investigation surrounding the Border Patrol-related shooting of anti-ICE protester Alex Pretti.",
    "link": "https://dailycaller.com/2026/01/27/cnn-elie-honig-alex-pretti-investigation/",
    "timestamp": "2026-01-27T15:00:39Z"
  },
  {
    "title": "US judge threatens ICE chief with contempt, orders court appearance",
    "description": "Jan 27 (Reuters) - The chief judge of Minnesota’s federal court ordered the acting chief of U.S. Immigration and Customs Enforcement to appear in court on Friday to perso… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/27/us-judge-threatens-ice-chief-with-contempt-orders-court-appearance",
    "timestamp": "2026-01-27T15:00:20Z"
  },
  {
    "title": "Trump Reverses Course On European Tariffs, Saying Europe Is “Destroying” Itself",
    "description": "According to the United States ruler, Donald Trump, the European countries he threatened with tariffs don’t need his help to fall into ruin. Trump claimed that they are making “horrible” decisions and “destroying” themselves. Trump’s Unhinged Tariffs On NATO …",
    "link": "https://www.activistpost.com/trump-reverses-course-on-european-tariffs-saying-europe-is-destroying-itself/",
    "timestamp": "2026-01-27T15:00:00Z"
  },
  {
    "title": "Canada could gain nearly 7% in real GDP by removing internal trade barriers, says IMF",
    "description": "Canada’s economy could gain nearly seven per cent, or $210 billion, in real GDP by fully removing internal trade barriers between the country’s 13 provinces and territories, according to a report published Tuesday by the International Monetary Fund.",
    "link": "https://www.cbc.ca/news/business/canadian-economy-report-imf-interprovincial-trade-9.7062567",
    "timestamp": "2026-01-27T15:00:00Z"
  },
  {
    "title": "WATCH LIVE: Trump gives speech on energy and the economy as Minnesota shooting fallout continues",
    "description": "President Donald Trump is headed to Iowa on Tuesday as part of the White House's midterm year pivot toward affordability, even as his administration remains mired in the fallout in Minneapolis over a second fatal shooting by federal immigration officers this …",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-gives-speech-on-energy-and-the-economy-as-minnesota-shooting-fallout-continues",
    "timestamp": "2026-01-27T14:59:18Z"
  },
  {
    "title": "Public defiance, private deals: Delcy Rodríguez tests fragile U.S.–Venezuela truce",
    "description": "Venezuela’s new socialist leader, Delcy Rodríguez, has launched a public campaign aimed at reassuring the regime’s radical base that she has not become a puppet of Washington — even as President Donald Trump publicly praises her leadership for fostering what …",
    "link": "https://freerepublic.com/focus/f-chat/4364170/posts",
    "timestamp": "2026-01-27T14:59:16Z"
  },
  {
    "title": "Factbox-EU adds India in rush for trade deals after Trump’s return",
    "description": "By Philip BlenkinsopBRUSSELS, Jan 27 (Reuters) - The European Union concluded negotiations on a free trade agreement with India on Tuesday, in the latest of a series of d… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/27/factbox-eu-adds-india-in-rush-for-trade-deals-after-trump-s-return",
    "timestamp": "2026-01-27T14:58:23Z"
  },
  {
    "title": "Bill O’Reilly Flips Out When Host Says Trump ‘Backing Down’ After Horrific Shooting: ‘Trying to Get a CNN Contract?’",
    "description": "Bill O'Reilly flipped out on Leland Vittert for saying Trump is \"backing down\" in the wake of the horrific killing of Alex Pretti by deportation agents.\nThe post Bill O’Reilly Flips Out When Host Says Trump ‘Backing Down’ After Horrific Shooting: ‘Trying to G…",
    "link": "https://www.mediaite.com/media/news/bill-oreilly-flips-out-when-host-says-trump-backing-down-after-horrific-shooting-trying-to-get-a-cnn-contract/",
    "timestamp": "2026-01-27T14:57:39Z"
  },
  {
    "title": "Bovino Put Out To Pasture",
    "description": "After the killing of Alex Pretti, Trump sidelined Greg Bovino, the public face of ICE raids in Minnesota, and sent Tom Homan to take over.",
    "link": "https://reason.com/2026/01/27/bovino-put-out-to-pasture/",
    "timestamp": "2026-01-27T14:57:02Z"
  },
  {
    "title": "S&P 500 Nears Record on Technology Gains Ahead of Fed Meeting",
    "description": "US equities climbed, pushing back toward record highs, as technology stocks advanced ahead key earnings reports and the Federal Reserve’s interest-rate decision this week.",
    "link": "https://financialpost.com/pmn/business-pmn/sp-500-nears-record-on-technology-gains-ahead-of-fed-meeting",
    "timestamp": "2026-01-27T14:56:59Z"
  },
  {
    "title": "Anti-ICE Agitators Arrested After Targeting Gregory Bovino's Hotel",
    "description": "Protesters who came to harass Border Patrol chief Greg Bovino went so far over the line that police had to intervene and arrest them.",
    "link": "https://www.westernjournal.com/anti-ice-agitators-arrested-targeting-gregory-bovinos-hotel/",
    "timestamp": "2026-01-27T14:56:34Z"
  },
  {
    "title": "Jimmy Kimmel Delivers Emotional Rebuke After ICE Killing of Alex Pretti: ‘One Atrocity After Another’",
    "description": "Jimmy Kimmel fought back tears as he delivered an emotional rebuke of ICE's immigration crackdown in Minneapolis, and the killing of Alex Pretti.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-alex-pretti-shooting-ice-1235505322/",
    "timestamp": "2026-01-27T14:55:19Z"
  },
  {
    "title": "Neil Young Gifts Catalogue to Greenland Amid Trump's Takeover Threats",
    "description": "\"I hope my Music and Music Films will ease some of the unwarranted stress and threats you are experiencing from our unpopular and hopefully temporary government\"",
    "link": "https://exclaim.ca/music/article/neil-young-gifts-catalogue-to-greenland-amid-trump-s-takeover-threats",
    "timestamp": "2026-01-27T14:54:38Z"
  },
  {
    "title": "Republican Criticism Of Pretti Shooting Grows: ICE Approach ‘Is Not Working’",
    "description": "Pence called for a “full and transparent investigation of this officer involved shooting.”",
    "link": "https://www.forbes.com/sites/saradorn/2026/01/27/republican-criticism-of-pretti-shooting-grows-ice-approach-is-not-working/",
    "timestamp": "2026-01-27T14:53:16Z"
  },
  {
    "title": "Trump family-backed American Bitcoin achieves 116% BTC yield",
    "description": "American Bitcoin’s BTC reserve has grown to 5,843 BTC since its Nasdaq debut. The company has achieved 116% BTC yield from Sept 2025 to Jan 2026. Trump family backs ABTC’s mining and crypto expansion strategy. American Bitcoin (ABTC), the publicly traded Bitc…",
    "link": "https://coinjournal.net/news/trump-family-backed-american-bitcoin-achieves-116-btc-yield/",
    "timestamp": "2026-01-27T14:52:10Z"
  },
  {
    "title": "Canada’s Carney Told Trump He Meant What He Said in Davos Speech",
    "description": "Canadian Prime Minister Mark Carney said he stood by his Davos warning about great-power coercion in a call with President Donald Trump, pushing back on US Treasury Secretary Scott Bessent’s account of the conversation.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-carney-told-trump-he-meant-what-he-said-in-davos-speech",
    "timestamp": "2026-01-27T14:51:47Z"
  },
  {
    "title": "Carney told Trump he meant what he said in Davos speech",
    "description": "Prime Minister Mark Carney said he stood by his Davos warning about great-power coercion in a call with U.S. President Donald Trump. Read on",
    "link": "https://financialpost.com/news/carney-trump-davos-speech",
    "timestamp": "2026-01-27T14:51:47Z"
  },
  {
    "title": "Senate commends US military support, mourns terror victims",
    "description": "Nigeria’s Senate commends the growing Nigeria-US military collaboration to combat terrorism, mourning victims and highlighting new levels of US support.\n\nRead More: https://punchng.com/senate-commends-us-military-support-mourns-terror-victims/",
    "link": "https://punchng.com/senate-commends-us-military-support-mourns-terror-victims/",
    "timestamp": "2026-01-27T14:50:11Z"
  },
  {
    "title": "US ICE agents to support security at Winter Olympics in Italy, source confirms",
    "description": "ROME, Jan 27 : U.S. Immigration and Customs Enforcement (ICE) personnel will help protect U.S. delegations at the Winter Olympics in Italy, a U.S. embassy source said on Tuesday, confirming local media reports and prompting anger among some Italian politician…",
    "link": "https://www.channelnewsasia.com/sport/us-ice-agents-support-security-winter-olympics-in-italy-source-confirms-5888861",
    "timestamp": "2026-01-27T14:48:12Z"
  },
  {
    "title": "Anger as branch of ICE to help with security at Winter Olympics",
    "description": "ROME: A branch of the US Immigration and Customs Enforcement (ICE) will help with security for the Winter Olympics in Italy, it confirmed on Tuesday (Jan 27), sparking anger and warnings they were not welcome.Reports had been circulating for days that the age…",
    "link": "https://www.channelnewsasia.com/sport/us-ice-immigration-agents-provide-winter-olympics-security-5888861",
    "timestamp": "2026-01-27T14:48:00Z"
  },
  {
    "title": "Minnesota launched a website to correct misinformation coming from the Department of Homeland Security",
    "description": "Department of Corrections leaders said the site was intended to correct the public record after the death of Alex Pretti.",
    "link": "https://fortune.com/2026/01/27/minnesota-launched-a-website-to-correct-misinformation-coming-from-the-department-of-homeland-security/",
    "timestamp": "2026-01-27T14:47:58Z"
  },
  {
    "title": "Biomass could play a key role in Canada’s transition to a carbon-neutral economy",
    "description": "Canada needs to move towards a carbon-neutral economy, and the biomass sectors have a key role to play in this transition.",
    "link": "https://theconversation.com/biomass-could-play-a-key-role-in-canadas-transition-to-a-carbon-neutral-economy-271179",
    "timestamp": "2026-01-27T14:46:15Z"
  },
  {
    "title": "Trump’s ‘Board of Peace’ puts rights abusers in charge of global order",
    "description": "Trump’s latest assault on the UN replaces international law with power, money and impunity.",
    "link": "https://www.aljazeera.com/opinions/2026/1/27/trumps-board-of-peace-puts-rights-abusers-in-charge-of-global-order",
    "timestamp": "2026-01-27T14:45:56Z"
  },
  {
    "title": "Judge snaps as he threatens Trump's ICE head with contempt: 'Patience is at an end'",
    "description": "A federal judge in Minnesota ran out of patience with one of President Donald Trump's top immigration officials.Chief Judge Patrick J. Schiltz found the administration had failed to comply with court orders to hold hearings for detained immigrants and ordered…",
    "link": "https://www.rawstory.com/todd-lyons-ice/",
    "timestamp": "2026-01-27T14:45:41Z"
  },
  {
    "title": "Fetterman calls for Trump to ‘immediately fire’ DHS Secretary Kristi Noem",
    "description": "U.S. Senator John Fetterman asked President Donald Trump to fire Department of Homeland Security Secretary Kristi Noem in a social media post Tuesday, . “President Donald J. Trump: I’m making a direct appeal to immediately fire Secretary Kristi Noem,“ Fetterm…",
    "link": "https://freerepublic.com/focus/f-news/4364168/posts",
    "timestamp": "2026-01-27T14:44:20Z"
  },
  {
    "title": "Oil jumps over 1% on US storm disruption, Kazakh oilfield's slow restart",
    "description": "Oil prices ⁠jumped over 1% on Tuesday as a massive winter storm hit crude production and affected refineries on the U.S. Gulf Coast, with the market also finding support from the slow restart of output from the Tengiz oilfield in Kazakhstan.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-jumps-over-1-on-us-storm-disruption-kazakh-oilfields-slow-restart/articleshow/127632528.cms",
    "timestamp": "2026-01-27T14:42:59Z"
  },
  {
    "title": "Selected Articles: Video: Is America against Europe? Donald Trump: “We Are No Longer Friends”",
    "description": "Video: Is America against Europe? Donald Trump: “We Are No Longer Friends”\nBy Prof Michel Chossudovsky and Drago Bosnic, January 26, 2026\nDonald Trump’s administration made plans to pull four friendly countries out of the EU, in an effort …\nThe post Selected …",
    "link": "https://www.globalresearch.ca/selected-articles-video-america-against-europe/5913729",
    "timestamp": "2026-01-27T14:42:51Z"
  },
  {
    "title": "Carney says he told Trump 'I meant what I said in Davos,' despite U.S. claims",
    "description": "Prime Minister Mark Carney is dismissing reports he walked back the remarks he made in Davos last week during a conversation with U.S. President Donald Trump on Monday.",
    "link": "https://www.cbc.ca/news/politics/carney-denies-walking-back-davos-speech-9.7062599",
    "timestamp": "2026-01-27T14:41:30Z"
  },
  {
    "title": "Return of the last hostage is ‘Never Again’ in action",
    "description": "81 years after the world refused to lift a finger to save Jews, and the Nazis reduced them to numbers tattooed on their forearms, the army of the Jewish State showed that every Jew matters and brought home one of its own. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421550",
    "timestamp": "2026-01-27T14:41:23Z"
  },
  {
    "title": "Sam Altman Says ICE Is Going ‘Too Far'—Becomes First Major CEO To Speak Out",
    "description": "Altman made the comments while also praising President Donald Trump as a “strong leader” and hoping he can unite the country.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/01/27/sam-altman-says-ice-is-going-too-far-becomes-first-major-ceo-to-speak-out/",
    "timestamp": "2026-01-27T14:41:14Z"
  },
  {
    "title": "Fetterman calls on Trump to fire Noem for 'trashing your border security legacy'",
    "description": "Sen. John Fetterman (D-PA) said that President Donald Trump would be making a \"mistake\" if he does not fire Department of Homeland Security Secretary Kristi Noem.\"President Trump: I make a direct appeal to immediately fire Secretary Noem,\" Fetterman said, acc…",
    "link": "https://www.rawstory.com/fetterman-trump-ice/",
    "timestamp": "2026-01-27T14:40:18Z"
  },
  {
    "title": "Trump Is Demolishing the Global Order. Here's What Might Come Next. (Politico)",
    "description": "Politico:\nTrump Is Demolishing the Global Order.  Here's What Might Come Next. … Greenland is safe, for now.  But it's no overstatement to say the rest of the world has come to see the United States in a new light, even after President Donald Trump backed dow…",
    "link": "https://www.memeorandum.com/260127/p37",
    "timestamp": "2026-01-27T14:40:01Z"
  },
  {
    "title": "“Sounds Fishy”: Barron Trump’s Late-Night Emergency Call To Save Close Friend Challenged By Judge",
    "description": "“The whole thing sounds fishy,” one said after a judge’s recent comments about Barron Trump’s late-night call to the UK police about his “close friend.”",
    "link": "https://www.boredpanda.com/judge-casts-doubt-on-barron-trump-testimony/",
    "timestamp": "2026-01-27T14:36:23Z"
  },
  {
    "title": "ICE/Minneapolis Shootings Bring Anger, Tears to Late Night on Monday",
    "description": "Emotions were running understandably high heading into Monday night's late-night lineup, and ABC's Jimmy Kimmel Live! host Jimmy Kimmel and Comedy Central's The Daily Show host Jon Stewart brought a range of tears and rage to their opening monologues and comm…",
    "link": "https://bleedingcool.com/tv/ice-minneapolis-shootings-bring-anger-tears-to-late-night-on-monday/",
    "timestamp": "2026-01-27T14:36:08Z"
  },
  {
    "title": "Trump administration uses ICE to pressure blue states (Washington Post)",
    "description": "Washington Post:\nTrump administration uses ICE to pressure blue states  —  The Trump administration is trying to push states to capitulate on several fronts — including voting issues and “sanctuary city” policies — and using officers and agents in the streets…",
    "link": "https://www.memeorandum.com/260127/p35",
    "timestamp": "2026-01-27T14:35:00Z"
  },
  {
    "title": "The Gangster’s Brief: The AG William Barr Doctrine, Noriega and Maduro",
    "description": "US President Donald Trump might leave an impression of violent novelty, at least for the leader of a nominal liberal democracy, soiling international relations with the gangster’s touch. This sense of iconoclasm is misplaced. While his conduct regarding the a…",
    "link": "https://www.globalresearch.ca/barr-doctrine-noriega-maduro/5913715",
    "timestamp": "2026-01-27T14:34:16Z"
  },
  {
    "title": "Trump left ‘amazed’ this top rival may run for president in 2028",
    "description": "The president believes this one project will hurt the Democrat's floated presidential chances.",
    "link": "https://www.nj.com/politics/2026/01/trump-left-amazed-this-top-rival-may-run-for-president-in-2028.html",
    "timestamp": "2026-01-27T14:33:34Z"
  },
  {
    "title": "Trump’s Davos Declaration: U.S. Must Beat China in Crypto Race With Comprehensive Regulatory Framework",
    "description": "President Donald Trump has doubled down on his commitment to making the United States the “cryptocurrency capital of the world.”",
    "link": "https://zycrypto.com/trumps-davos-declaration-u-s-must-beat-china-in-crypto-race-with-comprehensive-regulatory-framework/",
    "timestamp": "2026-01-27T14:31:00Z"
  },
  {
    "title": "Is Trump’s ‘Board of Peace’ a threat to the United Nations?",
    "description": "Trump’s ‘Board of Peace’ was to focus on Gaza’s reconstruction but it's now being promoted as a global conflict-resolver",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/27/is-trumps-board-of-peace-a-threat-to-the-united-nations",
    "timestamp": "2026-01-27T14:29:55Z"
  },
  {
    "title": "Neil Young removes songs from Amazon Music and gives free access to Greenland residents",
    "description": "The Heart of Gold singer has been vocal in his opposition to US President Donald Trump and the actions of Immigration and Customs Enforcement (ICE).",
    "link": "https://www.thejournal.ie/neil-young-removes-songs-from-amazon-music-and-gives-free-access-to-greenland-residents-6939592-Jan2026/",
    "timestamp": "2026-01-27T14:26:10Z"
  },
  {
    "title": "Norway parliament approves $2 billion artillery plan",
    "description": "OSLO, Jan 27 (Reuters) - Norway's parliament ‌on Tuesday approved a $2 billion procurement plan for long-range artillery ‌to boost the NATO country's deterrence against Russia in the Arctic, ‌where the two nations share a border. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/27/norway-parliament-approves-2-billion-artillery-plan",
    "timestamp": "2026-01-27T14:24:00Z"
  },
  {
    "title": "Oil Rises as Traders Weigh Fallout From US Freeze",
    "description": "West Texas Intermediate traded near $62, while a gauge of the greenback fell to its lowest level in four years, making commodities priced in the currency...",
    "link": "https://finance.yahoo.com/news/oil-holds-loss-supply-outlook-070052833.html",
    "timestamp": "2026-01-27T14:23:10Z"
  },
  {
    "title": "Bill O’Reilly Totally Loses It With NewsNation Host And People Are Talking",
    "description": "Why is the ex-Fox News star “yelling at the guy?” one viewer wanted to know.",
    "link": "https://www.huffpost.com/entry/bill-oreilly-you-want-cnn-contract-newsnation-leland-vittery_n_6978a8e1e4b0a848d14f1753",
    "timestamp": "2026-01-27T14:21:53Z"
  },
  {
    "title": "Melania Trump Calls for Peaceful Protest in Minneapolis",
    "description": "Melania Trump is urging demonstrators in Minneapolis to keep things peaceful as outrage over federal agents' fatal shooting of ICU nurse Alex Pretti on Saturday continues strong in city streets. The First Lady appeared on \"Fox & Friends\"…\n Permalink",
    "link": "https://www.tmz.com/2026/01/27/melania-trump-peaceful-protest-minneapolis/",
    "timestamp": "2026-01-27T14:21:09Z"
  },
  {
    "title": "Donald Trump couldn’t remember the word ‘Alzheimer’s,’ his father’s condition",
    "description": "Instead of focusing on Donald Trump’s profound cognitive decline and his visibly terrible health during the 2024 election, the media has only *really* started talking about Trump’s health in the past year. They have to be dragged kicking and screaming into th…",
    "link": "https://www.celebitchy.com/958894/donald_trump_couldnt_remember_the_word_alzheimers_his_fathers_condition/",
    "timestamp": "2026-01-27T14:20:39Z"
  },
  {
    "title": "Bessent warns Canada breaking from the US on trade would be a ‘disaster’",
    "description": "Treasury Secretary Scott Bessent calls Canada's potential pivot to China trade \"a disaster,\" directly challenging PM Mark Carney's recent economic stance.",
    "link": "https://www.foxnews.com/media/bessent-warns-canada-breaking-from-us-trade-would-disaster",
    "timestamp": "2026-01-27T14:17:31Z"
  },
  {
    "title": "Red Sea Rivalries Risk Unraveling the Horn of Africa",
    "description": "If Sudan’s civil war spreads to Ethiopia, it will be a humanitarian and strategic disaster.",
    "link": "http://foreignpolicy.com/2026/01/27/sudan-united-arab-emirates-saudi-arabia-ethiopia-trump-red-sea/",
    "timestamp": "2026-01-27T14:16:49Z"
  },
  {
    "title": "ICE chief ordered to appear in court to explain why detainees have been denied due process",
    "description": "The chief federal judge in Minnesota says the Trump administration has failed to comply with orders to hold hearings for detained immigrants and ordered the head of Immigration and Customs Enforcement to appear before him Friday to explain why he shouldn't be…",
    "link": "https://www.pbs.org/newshour/politics/ice-chief-ordered-to-appear-in-court-to-explain-why-detainees-have-been-denied-due-process",
    "timestamp": "2026-01-27T14:16:13Z"
  },
  {
    "title": "Kendall Jenner Strips Down to Nothing in Bedroom Photoshoot",
    "description": "Reading Time: 3 minutesPutting her peach on display, Kendall Jenner shows that modeling is a clothing-optional affair.\nKendall Jenner Strips Down to Nothing in Bedroom Photoshoot was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/kendall-jenner-no-clothes-on-bed/",
    "timestamp": "2026-01-27T14:15:04Z"
  },
  {
    "title": "Trump Believes Ukraine Conflict Resolution 'Coming'",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump on Tuesday reiterated his hope in ending the \"ninth\" conflict, allegedly referring to Ukraine.",
    "link": "https://sputnikglobe.com/20260127/trump-believes-ukraine-conflict-resolution-coming-1123534885.html",
    "timestamp": "2026-01-27T14:14:49Z"
  },
  {
    "title": "What is at stake for Starmer in China?",
    "description": "The British PM will have to ‘play it tough’ to achieve ‘substantive’ outcomes, while China looks to draw Britain away from US influence",
    "link": "https://theweek.com/politics/what-is-at-stake-for-starmer-in-china",
    "timestamp": "2026-01-27T14:14:40Z"
  },
  {
    "title": "Norway parliament approves $2 billion artillery plan",
    "description": "OSLO, Jan 27 () - Norway's parliament on Tuesday approved a $2 billion procurement plan for long-range artillery to boost the NATO country's ​deterrence...",
    "link": "https://uk.news.yahoo.com/norway-parliament-approves-2-billion-141238589.html",
    "timestamp": "2026-01-27T14:14:21Z"
  },
  {
    "title": "Bovino is out of Minneapolis — but Trump isn’t backing down",
    "description": "The president's firing of Gregory Bovino and softening rhetoric are superficial changes for a heartless policy",
    "link": "https://www.salon.com/2026/01/27/bovino-is-out-of-minneapolis-but-trump-isnt-backing-down/",
    "timestamp": "2026-01-27T14:10:43Z"
  },
  {
    "title": "Carney says he told Trump he meant what he said in WEF speech, during call on trade",
    "description": "Carney says he told Trump he \"meant what (he) said\" during his speech at the WEF and it was about responding to a \"broader set of issues.\"",
    "link": "https://toronto.citynews.ca/2026/01/27/carney-trump-trade-tariffs/",
    "timestamp": "2026-01-27T14:10:40Z"
  },
  {
    "title": "Millions could receive $1,000 this year under Trump plan, but you need an account - here's how to create one",
    "description": "Millions of US parents may get up to $1,000 for their children under a new Trump Accounts program. The money is not automatic and requires opening a government-backed account during tax filing. Extra funds are possible for some families due to a major private…",
    "link": "https://economictimes.indiatimes.com/news/international/us/millions-could-receive-1000-this-year-under-trump-plan-but-you-need-an-account-heres-how-to-create-one/articleshow/127630534.cms",
    "timestamp": "2026-01-27T14:09:48Z"
  }
]