[
  {
    "title": "GOP lawmaker demands Trump apologize for racist Obamas video: 'Incredibly offensive'",
    "description": "Rep. Mike Lawler (R-NY) called President Donald Trump \"wrong and incredibly offensive\" after he posted a video depicting Barack and Michelle Obama as apes.\"The President's post is wrong and incredibly offensive — whether intentional or a mistake — and should …",
    "link": "https://www.rawstory.com/lawler-trump-racist-video/",
    "timestamp": "2026-02-06T16:36:03Z"
  },
  {
    "title": "Trump at the Pearly Gates (The Bulwark)",
    "description": "The Bulwark:\nTrump at the Pearly Gates  —  Why the president thinks he's going to Heaven.  —  Donald Trump posts a lot of election conspiracy theories online, and he posts a lot of racist memes, too.  But it's not every day that he makes an elections-conspira…",
    "link": "https://www.memeorandum.com/260206/p66",
    "timestamp": "2026-02-06T16:35:04Z"
  },
  {
    "title": "FACT FOCUS: Trump says tariffs have created an economic miracle. The facts tell a different story (Associated Press)",
    "description": "Associated Press:\nFACT FOCUS: Trump says tariffs have created an economic miracle.  The facts tell a different story  —  Looking back on the first year of his second term, President Donald Trump boasts that he has resurrected the American economy by imposing …",
    "link": "https://www.memeorandum.com/260206/p67",
    "timestamp": "2026-02-06T16:35:04Z"
  },
  {
    "title": "Amazon Leverages New Tax Laws to Fuel AI Buildout",
    "description": "New tax laws around research and capital investment reduced Amazon’s U.S. corporate income taxes by more than half in 2025, even as the company’s profits rose, the Wall Street Journal reported Friday (Feb. 6). Amazon’s current U.S. taxes declined from $9 bill…",
    "link": "https://www.pymnts.com/amazon/2026/amazon-leverages-new-tax-laws-to-fuel-ai-buildout/",
    "timestamp": "2026-02-06T16:34:41Z"
  },
  {
    "title": "'Beyond Crazy': FBI Summons State Election Officials to Secretive Meeting After Trump Threat to ‘Nationalize’ Midterms",
    "description": "State election officials were left unnerved after being summoned by the FBI to a mysterious conference to discuss \"preparations\" for this year's midterm elections, which President Donald Trump has recently called for Republicans to \"nationalize\" in violation …",
    "link": "https://www.commondreams.org/news/fbi-secret-election-meeting",
    "timestamp": "2026-02-06T16:34:17Z"
  },
  {
    "title": "What happened to Stellantis shares? Stellantis stock crashes 25% in a single day as Jeep, Ram, and Dodge owner’s €22 billion EV reset shocks investors",
    "description": "Stellantis (STLA) stock tumbles 25% today: Stellantis shares crashed 25% in one session. A €22 billion EV write-down triggered the collapse. The company cut its 2026 dividend completely. A €5 billion bond sale added pressure. EV demand slowed sharply. Costs s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-happened-to-stellantis-shares-stellantis-stock-crashes-25-in-a-single-day-as-jeep-ram-and-dodge-owners-22-billion-ev-reset-shocks-investors/articleshow/127999423.cms",
    "timestamp": "2026-02-06T16:33:28Z"
  },
  {
    "title": "The WSJ on the negotiations in Oman: Iran rejects the US demand to halt uranium enrichment",
    "description": "Both sides describe the talks as a good start, although neither has moved from its longstanding positions. The United States is also insisting on addressing Iran’s missile program, while Tehran says it wishes to continue working toward a diplomatic solution. …",
    "link": "https://en.protothema.gr/2026/02/06/the-wsj-on-the-negotiations-in-oman-iran-rejects-the-us-demand-to-halt-uranium-enrichment/",
    "timestamp": "2026-02-06T16:31:52Z"
  },
  {
    "title": "800 Google employees demand an end to any cloud contracts with ICE and CBP",
    "description": "The petition also called for executives to protect vulnerable Google employees, \"from cafeteria workers to data center employees.\"",
    "link": "https://www.businessinsider.com/800-google-employees-demand-no-ice-cbp-cloud-contracts-2026-2",
    "timestamp": "2026-02-06T16:26:28Z"
  },
  {
    "title": "BREAKING: Madman President Promotes Racist Video of the Obamas as Apes (Asawin Suebsaeng/Zeteo)",
    "description": "Asawin Suebsaeng / Zeteo:\nBREAKING: Madman President Promotes Racist Video of the Obamas as Apes  —  Trump's policies and actions are fueled by explicit racism and election denial.  The Obama-ape video encompasses both.  —  On Thursday, during his latest late…",
    "link": "https://www.memeorandum.com/260206/p65",
    "timestamp": "2026-02-06T16:25:00Z"
  },
  {
    "title": "Trump shares a racist video that depicts the Obamas as primates",
    "description": "President Donald Trump removed a post from his social media account that depicted former President Barack Obama and Michelle Obama as primates.",
    "link": "https://www.nbcwashington.com/news/national-international/trump-shares-racist-video-obama-primate/4055489/",
    "timestamp": "2026-02-06T16:24:03Z"
  },
  {
    "title": "Marco Rubio: China's Nuclear Buildup Makes Any Deal Between Only U.S. and Russia 'Obsolete'",
    "description": "Secretary of State Marco Rubio affirmed in an essay published on Friday that the administration of President Donald Trump would not pursue a new nuclear arms reduction agreement with only Russia, arguing that China's \"rapid and opaque\" nuclear buildup made su…",
    "link": "https://www.breitbart.com/asia/2026/02/06/marco-rubio-chinas-nuclear-buildup-makes-any-deal-between-only-u-s-and-russia-obsolete/",
    "timestamp": "2026-02-06T16:23:51Z"
  },
  {
    "title": "Facing high Trump tariffs, Africa's leading economy says it's close to a new trade deal with China",
    "description": "South Africa's Ministry of Trade and Industry said the agreement would start negotiations over a deal that would give some South African goods, such as fruit, duty-free access to the Chinese market.",
    "link": "https://www.pbs.org/newshour/world/facing-high-trump-tariffs-africas-leading-economy-says-its-close-to-a-new-trade-deal-with-china",
    "timestamp": "2026-02-06T16:22:26Z"
  },
  {
    "title": "Trump’s aggressive tactics force a reckoning between local leaders and Washington",
    "description": "Local leaders feel pressured by federal priorities, affecting trust and stability.",
    "link": "https://www.bostonherald.com/2026/02/06/trump-federal-government-vs-cities/",
    "timestamp": "2026-02-06T16:22:23Z"
  },
  {
    "title": "EU Says TikTok’s ‘Addictive Design’ Likely Violates the Law, Will Need to Change",
    "description": "European regulators issued a preliminary finding that the app’s design likely violates the bloc’s laws.",
    "link": "https://gizmodo.com/eu-says-tiktoks-addictive-design-likely-violates-the-law-will-need-to-change-2000718882",
    "timestamp": "2026-02-06T16:20:34Z"
  },
  {
    "title": "Kid Rock Shares Kobe Bryant Quote Ahead of Alternative Halftime Show",
    "description": "Kid Rock shared a message about hate amid the controversy surrounding Turning Point USA’s alternative 2026 Super Bowl halftime show. “Mamba Mentality,” read a graphic shared via X by the singer, 55, on Thursday, February 5, quoting late basketball star Kobe B…",
    "link": "https://www.usmagazine.com/celebrity-news/news/kid-rock-shares-kobe-bryant-quote-ahead-of-alternative-halftime-show/",
    "timestamp": "2026-02-06T16:19:39Z"
  },
  {
    "title": "Trump launches website that helps Americans buy drugs at discount",
    "description": "U.S. President seeks to counter cost-of-living concerns that pose a threat to his party in November’s congressional elections. Read on",
    "link": "https://financialpost.com/news/retail-marketing/trump-launches-website-discount-drugs",
    "timestamp": "2026-02-06T16:19:32Z"
  },
  {
    "title": "‘Flash of Orange’ Caught on Video Sparks More Questions About Jeffrey Epstein’s Death",
    "description": "A \"flash of orange\" spotted on video heading to the jail tier housing Jeffrey Epstein on the night before his death may have been an inmate.\nThe post ‘Flash of Orange’ Caught on Video Sparks More Questions About Jeffrey Epstein’s Death first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/flash-of-orange-caught-on-video-sparks-more-questions-about-jeffrey-epsteins-death/",
    "timestamp": "2026-02-06T16:17:03Z"
  },
  {
    "title": "US accuses China of secret nuclear tests as calls grow for new arms deal",
    "description": "The claim comes as the US calls for China to be involved in a new deal limiting the use of nuclear weapons, after the New START deal expired this week.",
    "link": "https://www.abc.net.au/news/2026-02-07/us-accuses-china-of-secret-nuclear-testing/106316826",
    "timestamp": "2026-02-06T16:14:30Z"
  },
  {
    "title": "What to expect from Bad Bunny's Super Bowl halftime show",
    "description": "Fresh off his historic win at the Grammys for his love letter to Puerto Rico, \"Debí Tirar Más Fotos,\" Bad Bunny will once again surprise audiences with a performance that is gearing up to be a landmark moment for Latino culture.",
    "link": "https://www.pbs.org/newshour/arts/what-to-expect-from-bad-bunnys-super-bowl-halftime-show",
    "timestamp": "2026-02-06T16:14:06Z"
  },
  {
    "title": "Two ‘Seditious Six’ Democrats Refuse To Comply With Trump Admin Probe",
    "description": "Two Democratic lawmakers who participated in the viral November \"illegal orders\" video are refusing to comply with an investigation by the DOJ.",
    "link": "https://dailycaller.com/2026/02/06/elissa-slotkin-chrissy-houlahan-seditious-six-video-doj-probe/",
    "timestamp": "2026-02-06T16:12:34Z"
  },
  {
    "title": "Sudan siege ends, violence in Pakistan, and who’s in the Epstein files? The Cheat Sheet",
    "description": "Sudan siege ends, violence in Pakistan, and who’s in the Epstein files? The Cheat Sheet\n\nsofia\n\nFri, 02/06/2026 - 16:09",
    "link": "https://www.thenewhumanitarian.org/news/2026/02/06/sudan-siege-ends-violence-pakistan-epstein-files-cheat-sheet",
    "timestamp": "2026-02-06T16:09:35Z"
  },
  {
    "title": "Who’s performing at Super Bowl 2026? From Green Day’s pre-game set to Bad Bunny’s halftime show",
    "description": "Super Bowl LX will take place February 8 in California",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/super-bowl-2026-performers-bad-bunny-green-day-b2915508.html",
    "timestamp": "2026-02-06T16:07:52Z"
  },
  {
    "title": "Remi Tinubu’s US visit resets Nigeria’s global image — Jimoh Ibrahim",
    "description": "Senator Jimoh Ibrahim says First Lady Remi Tinubu’s US visit has reset Nigeria’s global image, countering negative propaganda and religious persecution cla\n\nRead More: https://punchng.com/remi-tinubus-us-visit-resets-nigerias-global-image-jimoh-ibrahim/",
    "link": "https://punchng.com/remi-tinubus-us-visit-resets-nigerias-global-image-jimoh-ibrahim/",
    "timestamp": "2026-02-06T16:07:51Z"
  },
  {
    "title": "Trump sparks outrage with video depicting Obamas as monkeys",
    "description": "Donald Trump sparks outrage by posting a video depicting Barack and Michelle Obama as monkeys, prompting top Democrats to condemn the post as racist.\n\nRead More: https://punchng.com/trump-sparks-outrage-with-video-depicting-obamas-as-monkeys/",
    "link": "https://punchng.com/trump-sparks-outrage-with-video-depicting-obamas-as-monkeys/",
    "timestamp": "2026-02-06T16:06:23Z"
  },
  {
    "title": "Epstein files set off Norwegian political storm: What we know",
    "description": "Two high-profile Norwegian politicians and the country's crown princess have been linked to the late sex offender.",
    "link": "https://www.aljazeera.com/news/2026/2/6/epstein-files-set-off-norwegian-political-storm-what-we-know",
    "timestamp": "2026-02-06T16:05:13Z"
  },
  {
    "title": "Trump sparks backlash after sharing video depicting Barack and Michelle Obama as primates",
    "description": "The post quickly drew backlash for its treatment of the nation’s first Black president and first lady.",
    "link": "https://indianexpress.com/article/world/us-news/donald-trump-truth-social-obama-primate-video-backlash-election-claims-10518067/",
    "timestamp": "2026-02-06T16:04:18Z"
  },
  {
    "title": "WH Responds To Backlash Over Trump's Racist Post Of The Obamas",
    "description": "Donald Trump's racism was evident the day he went down the escalator and announced his campaign in 2015, but last night on Truth Social, he outdid himself by channeling Nick Fuentes.\nEchoing a former video he posted months ago, the Grand Wizard of MAGA posted…",
    "link": "https://crooksandliars.com/2026/02/trump-goes-kkk-racist-obamas-depicting",
    "timestamp": "2026-02-06T16:04:09Z"
  },
  {
    "title": "Bad Bunny Super Bowl 2026 halftime show: Setlist predictions & guest rumors",
    "description": "Cardi B, Daddy Yankee and Rosalía are some of the superstars rumored to be joining Bad Bunny on pop culture’s biggest stage",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-set-list-super-bowl-halftime-b2915500.html",
    "timestamp": "2026-02-06T16:01:49Z"
  },
  {
    "title": "White House Speaks Out After Donald Trump Shares Racist Video of Barack & Michelle Obama as Apes",
    "description": "Donald Trump is reposting a shocking video of Barack and Michelle Obama as apes. On Friday night (February 5), Trump shared a video on Truth Social that featured unsubstantiated allegations of voter fraud during the 2020 election, where he lost to Joe Biden. …",
    "link": "https://www.justjared.com/2026/02/06/white-house-speaks-out-after-donald-trump-shares-racist-video-of-barack-michelle-obama-as-apes/",
    "timestamp": "2026-02-06T16:01:14Z"
  },
  {
    "title": "As Crash Deepens, Investors Say Bitcoin Is Headed for Zero Dollars",
    "description": "\"That’s not just for shock factor. It’s where the math takes us.\"\nThe post As Crash Deepens, Investors Say Bitcoin Is Headed for Zero Dollars appeared first on Futurism.",
    "link": "http://futurism.com/future-society/crash-bitcoin-headed-zero-dollars",
    "timestamp": "2026-02-06T16:01:00Z"
  },
  {
    "title": "Ramaphosa hails Agoa lifeline as SA secures US trade boost",
    "description": "Cape Town – President Cyril Ramaphosa has welcomed South Africa’s continued participation in the African Growth and Opportunity Act (Agoa) after US President Donald Trump signed its one-year extension into law, allowing eligible African countries to export ce…",
    "link": "https://www.africaninsider.com/business/ramaphosa-hails-agoa-lifeline-as-sa-secures-us-trade-boost/",
    "timestamp": "2026-02-06T16:00:33Z"
  },
  {
    "title": "Shameful 'LION KING' excuse...",
    "description": "The White House defended Trump after he faced widespread outrage for posting a racist image of the Obamas as apes",
    "link": "https://www.themirror.com/news/politics/white-house-offers-shameful-excuse-1666608",
    "timestamp": "2026-02-06T16:00:17Z"
  },
  {
    "title": "Good Morning, News: MultCo DA Doesn't Wanna FAFO, Police Shooting in the Pearl, Breaking: Democracy Dies in Darkness, and Shorting the Bitcoin Economy",
    "description": "by Mercury Staff\n \n \n \n If you appreciate the Mercury's interesting and useful news & culture reporting, consider making a small monthly contribution to support our editorial team. Your donation is tax-deductible. You can also subscribe and have our papers de…",
    "link": "https://www.portlandmercury.com/good-morning-news/2026/02/06/48299131/good-morning-news-multco-da-doesnt-wanna-fafo-police-shooting-in-the-pearl-breaking-democracy-dies-in-darkness-and-shorting-the-bitcoin",
    "timestamp": "2026-02-06T16:00:00Z"
  },
  {
    "title": "Award-Winning Amy Goodman Documentary ‘Steal This Story, Please!’ To Be Self-Distributed Across U.S.",
    "description": "EXCLUSIVE: Oscar-nominated filmmakers Carl Deal and Tia Lessin will self-release their acclaimed documentary Steal This Story, Please!, a feature that examines the career of famed progressive journalist and Democracy Now! host Amy Goodman. The documentary is …",
    "link": "http://deadline.com/2026/02/steal-this-story-please-amy-goodman-documentary-distribution-1236710948/",
    "timestamp": "2026-02-06T16:00:00Z"
  },
  {
    "title": "Trump Posts Racist Video Of Obamas As Apes, Anger Erupts",
    "description": "On Thursday night (February 5), President Donald Trump went on another posting spree on his Truth Social media platform, which included a blatantly racist video of former President Barack Obama and former First Lady Michelle Obama as apes.",
    "link": "https://hiphopwired.com/3033395/trump-posts-racist-video-of-obamas-as-apes-anger-erupts/",
    "timestamp": "2026-02-06T15:59:55Z"
  },
  {
    "title": "Trump removes video with racist clip depicting Obamas as apes",
    "description": "The White House defended the post at first, calling to \"stop the fake outrage\", as members of both parties condemned the video.",
    "link": "https://www.bbc.co.uk/news/articles/ce8r8y78g10o",
    "timestamp": "2026-02-06T15:58:07Z"
  },
  {
    "title": "Sen Tim Scott calls Trump post 'most racist thing I've seen out of this White House'",
    "description": "Sen. Tim Scott, R-S.C., called President Donald Trump's post depicting the Obamas as monkeys \"the most racist thing I’ve seen out of this White House,\" and demanded it be taken down.",
    "link": "https://www.foxnews.com/politics/sen-tim-scott-calls-trump-post-most-racist-thing-ive-seen-out-white-house",
    "timestamp": "2026-02-06T15:56:36Z"
  },
  {
    "title": "Three-time Trump voter denounces president over racist Obamas video: 'I want to apologize'",
    "description": "A man who voted for Donald Trump in his three presidential elections denounced the commander-in-chief after he posted a racist video of Barack and Michelle Obama depicted as apes.During Friday's edition of C-SPAN's Washington Journal program, a man named John…",
    "link": "https://www.rawstory.com/trump-voter-apologizes-racist-video/",
    "timestamp": "2026-02-06T15:56:24Z"
  },
  {
    "title": "Chairman of prominent law firm Paul Weiss resigns after release of emails linking him to Epstein",
    "description": "He said in a statement from the firm that \"recent reporting has created a distraction and has placed a focus on me that is not in the best interests\" of Paul Weiss.",
    "link": "https://www.pbs.org/newshour/politics/chairman-of-prominent-law-firm-paul-weiss-resigns-after-release-of-emails-linking-him-to-epstein",
    "timestamp": "2026-02-06T15:55:27Z"
  },
  {
    "title": "Gallego Says ‘Grind the Country to a Halt’ With National Strike If Trump Tries to Rig Midterms",
    "description": "A centrist Democratic US senator is now talking about taking drastic measures to protect democracy from President Donald Trump.Speaking with the Court of History podcast on Thursday, Sen. Ruben Gallego (D-Ariz.) outlined a plan to stop Trump in case he tries …",
    "link": "https://www.commondreams.org/news/ruben-gallego-general-strike",
    "timestamp": "2026-02-06T15:54:36Z"
  },
  {
    "title": "Trump links funding to name on Penn Station",
    "description": "Trump “can restart the funding with a snap of his fingers,” a Schumer insider said",
    "link": "https://theweek.com/politics/trump-funding-name-penn-station-dulles",
    "timestamp": "2026-02-06T15:54:04Z"
  },
  {
    "title": "What Green Day has said about Trump and MAGA as they’re set to perform at Super Bowl",
    "description": "Rock band are preparing to take the stage at the Super Bowl alongside MAGA-despised singer and rapper Bad Bunny",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/green-day-trump-super-bowl-b2915492.html",
    "timestamp": "2026-02-06T15:53:50Z"
  },
  {
    "title": "Europe Should Reject US-Style Competitiveness",
    "description": "European leaders seem increasingly convinced that, to succeed in the 21st century, they must reshape Europe's economy in America’s image. But the American brand of \"competitiveness\" contributes to major imbalances and far-reaching harm, which the European Uni…",
    "link": "https://www.project-syndicate.org/commentary/europe-should-not-emulate-us-style-competitiveness-by-sandeep-vaheesan-2026-02",
    "timestamp": "2026-02-06T15:51:44Z"
  },
  {
    "title": "EU tells TikTok to change ‘addictive’ design",
    "description": "The EU said Friday that it had told TikTok it needs to change its \"addictive design\" or risk heavy fines.\nThe post EU tells TikTok to change ‘addictive’ design appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/eu-tells-tiktok-to-change-addictive-design/article",
    "timestamp": "2026-02-06T15:49:11Z"
  },
  {
    "title": "Pam Bondi comment about Trump's memory leads to mockery online: 'He can barely remember'",
    "description": "Mockery erupted online Friday over Attorney General Pam Bondi's comment that \"Donald Trump never forgets.\"Bondi was speaking at a press conference where the Department of Justice announced an arrest of a suspect in the 2012 Benghazi attack when she made the r…",
    "link": "https://www.rawstory.com/pam-bondi-donald-trump-2675105825/",
    "timestamp": "2026-02-06T15:48:10Z"
  },
  {
    "title": "Consumer sentiment ticks up for third month in a row",
    "description": "The closely watched consumer sentiment gauge has now risen for three consecutive months, although it is still low by historical standards.",
    "link": "https://www.washingtonexaminer.com/policy/finance-and-economy/4448711/consumer-sentiment-index-february-up-third-consecutive-month/",
    "timestamp": "2026-02-06T15:47:53Z"
  },
  {
    "title": "Trump Unveils Drug Savings Website ‘Trump Rx’",
    "description": "President Donald Trump unveiled a new website seeking to offer Americans massively discounted prescription drugs. The website, TrumpRx.gov, offers “Most-Favored-Nation” prices on prescription drugs. “This... Read More\nThe post Trump Unveils Drug Savings Websi…",
    "link": "https://www.dailysignal.com/2026/02/06/trump-unveils-drug-savings-website-trump-rx/",
    "timestamp": "2026-02-06T15:47:00Z"
  },
  {
    "title": "Trump shares racist video depicting the Obamas as monkeys (Rebecca Shabad/NBC News)",
    "description": "Rebecca Shabad / NBC News:\nTrump shares racist video depicting the Obamas as monkeys  —  The White House defended Trump's post, saying it was “from an internet meme video depicting President Trump as the King of the Jungle.”  —  Listen to this article with a …",
    "link": "https://www.memeorandum.com/260206/p58",
    "timestamp": "2026-02-06T15:45:01Z"
  },
  {
    "title": "FBI’s Fulton County Election Raid: Better Six Years Late Than Never",
    "description": "The FBI’s Jan. 28 raid on Fulton County, Georgia’s election offices was sorely needed. It should have happened in 2020. Americans should be proud of... Read More\nThe post FBI’s Fulton County Election Raid: Better Six Years Late Than Never appeared first on Th…",
    "link": "https://www.dailysignal.com/2026/02/06/fbis-fulton-county-election-raid-better-six-years-late-than-never/",
    "timestamp": "2026-02-06T15:45:00Z"
  },
  {
    "title": "US, Russia restart military dialogue as treaty ends",
    "description": "New START was the last remaining nuclear arms treaty between the countries",
    "link": "https://theweek.com/world-news/us-russia-military-talks-nuclear-treaty",
    "timestamp": "2026-02-06T15:44:30Z"
  },
  {
    "title": "Greenland villagers focus on ‘normal life’ amid stress of US threat",
    "description": "The US president has repeatedly threatened to seize the mineral-rich island, an autonomous territory of Denmark.\nThe post Greenland villagers focus on ‘normal life’ amid stress of US threat appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/greenland-villagers-focus-on-normal-life-amid-stress-of-us-threat/article",
    "timestamp": "2026-02-06T15:44:22Z"
  },
  {
    "title": "Benghazi Terror Suspect Apprehended, Extradited to U.S.",
    "description": "Never ever forget Ambassador Chris Stevens, Sean Smith, Glen Doherty, and Tyrone Woods.\nThe post Benghazi Terror Suspect Apprehended, Extradited to U.S. first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/benghazi-terror-suspect-apprehended-extradited-to-u-s/",
    "timestamp": "2026-02-06T15:41:09Z"
  },
  {
    "title": "Republican Tim Scott Calls Donald Trump’s Post That Depicted The Obamas As Apes: “The Most Racist Thing I’ve Seen Out Of This White House”",
    "description": "While Democrats have condemned Donald Trump’s Truth Social post of a video featuring a racist AI depiction of Barack and Michelle Obama as apes, one of the president’s strident defenders also called it out. Sen. Tim Scott (R-SC), who is chairing the GOP’s Sen…",
    "link": "http://deadline.com/2026/02/trump-racist-truth-social-post-obama-reaction-1236711128/",
    "timestamp": "2026-02-06T15:40:58Z"
  },
  {
    "title": "Trump's Depraved Racist Attack on the Obamas Matters Deeply and Must Be Condemned",
    "description": "I’ve been talking into microphones since I did the morning news on WITL in Lansing Michigan in the late 1960s, and I’ve seen a lot of ugly moments in American politics. But every so often something happens that still takes your breath away, not because it’s s…",
    "link": "https://www.commondreams.org/opinion/trump-racism-obamas",
    "timestamp": "2026-02-06T15:40:35Z"
  },
  {
    "title": "Trump shares racist video that depicts Obamas as primates",
    "description": "The Republican president's Thursday night post immediately drew backlash for its treatment of the nation's first Black president and first lady.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-shares-racist-video-that-depicts-obamas-as-primates/articleshow/127997583.cms",
    "timestamp": "2026-02-06T15:39:07Z"
  },
  {
    "title": "Trump's boast backfires as medical expert points out mental and physical side effects",
    "description": "The administration backing Donald Trump may boast about his energy levels but it does not change his ailing health, a medical professional has said. The president said just last week that he does not \"sleep much\" while Vice President JD Vance says other staff…",
    "link": "https://www.rawstory.com/trump-health-2675105377/",
    "timestamp": "2026-02-06T15:37:54Z"
  },
  {
    "title": "Netanyahu gives the IDF more leeway to attack as he hopes Trump fumbles on peace in Gaza",
    "description": "The Americans' plan lacks a key element: How do you separate Hamas and the Palestinian population? ■ The prime minister's appointing of David Zini was hardly a case of naively falling for a talented officer tapped to shake up Israel's Shin Bet security service",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-06/ty-article/.premium/netanyahu-gives-the-idf-more-leeway-to-attack-as-he-hopes-trump-fumbles-on-peace-in-gaza/0000019c-3335-d37f-affc-77b5ad560000",
    "timestamp": "2026-02-06T15:36:16Z"
  },
  {
    "title": "Tim Scott Slams Trump’s Obama Ape Clip as ‘Most Racist Thing I’ve Seen Out of This White House’",
    "description": "Sen. Tim Scott (R-SC) posted a rare critique of President Donald Trump Friday after the president shared a video depicting the Obamas as apes.\nThe post Tim Scott Slams Trump’s Obama Ape Clip as ‘Most Racist Thing I’ve Seen Out of This White House’ first appea…",
    "link": "https://www.mediaite.com/online/tim-scott-slams-trumps-obama-ape-clip-as-most-racist-thing-ive-seen-out-of-this-white-house/",
    "timestamp": "2026-02-06T15:35:33Z"
  },
  {
    "title": "Trump reclassifies 50,000 federal jobs to ease firings",
    "description": "The rule strips longstanding job protections from federal workers",
    "link": "https://theweek.com/politics/trump-reclassifies-50000-federal-job-firings",
    "timestamp": "2026-02-06T15:35:18Z"
  },
  {
    "title": "Islamic State-Linked Attacks in Nigeria Claim 162 Lives",
    "description": "Below is a SOFX Report, Islamic State-Linked Attacks in Nigeria Claim 162 Lives. Gunmen killed 162 residents in coordinated attacks on Woro and Nuku villages in Nigeria’s Kwara state Tuesday, according to Mohammed Omar Bio, a member of parliament representing…",
    "link": "https://smallwarsjournal.com/2026/02/06/islamic-state-attacks-nigeria-february-2026/",
    "timestamp": "2026-02-06T15:35:13Z"
  },
  {
    "title": "Trump shares a racist video that depicts the Obamas as primates - Boston News, Weather, Sports | WHDH 7News",
    "description": "WASHINGTON (AP) — President Donald Trump used his social media account to share a video about election conspiracy theories that includes a racist depiction of former President Barack<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/trump-shares-a-racis…",
    "link": "https://whdh.com/news/trump-shares-a-racist-video-that-depicts-the-obamas-as-primates/",
    "timestamp": "2026-02-06T15:34:30Z"
  },
  {
    "title": "EXCLUSIVE: Why This Minnesota Sheriff Won’t Back Out Of ICE Partnership",
    "description": "An East Central Minnesota sheriff argues that Democratic officials' hostility toward ICE creates \"chaos\" as other sheriffs walk back their support.",
    "link": "https://dailycaller.com/2026/02/06/exclusive-minnesota-sheriff-ice-partnership-tim-walz-jacob-frey-chaos-riots-alex-pretti-renee-good-somalis-mass-deportations/",
    "timestamp": "2026-02-06T15:33:30Z"
  },
  {
    "title": "Starbucks Wins Dismissal of Missouri Lawsuit Over DEI Policies",
    "description": "A federal judge in Missouri on Thursday dismissed a lawsuit by the Republican-led state accusing Starbucks SBUX.O of using its commitment to diversity, equity and inclusion as a pretext to systematically discriminate based on race, gender and sexual orientati…",
    "link": "https://www.insurancejournal.com/news/midwest/2026/02/06/857236.htm",
    "timestamp": "2026-02-06T15:31:50Z"
  },
  {
    "title": "Trump’s cannabis rescheduling order was just smoke",
    "description": "Even with an order to expedite the process, federal cannabis reform faces long delays and legal hurdle",
    "link": "https://www.salon.com/2026/02/06/trumps-cannabis-rescheduling-order-was-just-smoke/",
    "timestamp": "2026-02-06T15:30:59Z"
  },
  {
    "title": "Rich Liberals: Please, Please Step up and Save The Washington Post",
    "description": "By far the most widely read piece I’ve written in my time at The New Republic is this one, which I wrote right after the 2024 election and headlined “Why Does No One Understand the Real Reason Trump Won?” My answer to that question was the media—specifically,…",
    "link": "https://newrepublic.com/post/206237/liberals-save-washington-post-jeff-bezos-layoffs",
    "timestamp": "2026-02-06T15:30:45Z"
  },
  {
    "title": "A timeline of the Jeffrey Epstein investigation and the fight to make the government's files public",
    "description": "The release is the culmination of a yearslong fight over the records underpinning one of the Justice Department's most high-profile and highly debated cases.",
    "link": "https://www.pbs.org/newshour/politics/a-timeline-of-the-jeffrey-epstein-investigation-and-the-fight-to-make-the-governments-files-public",
    "timestamp": "2026-02-06T15:30:11Z"
  },
  {
    "title": "The Brilliant New Movie About Alexander Skarsgård Making Dudley Dursley His Toy",
    "description": "It’s the kinkiest major release in years, if not decades. It’s also really sweet.",
    "link": "https://slate.com/culture/2026/02/pillion-movie-alexander-skarsgard-harry-melling-dudley-dursley.html",
    "timestamp": "2026-02-06T15:30:02Z"
  },
  {
    "title": "Grant Guidelines for Libraries and Museums Take “Chilling” Political Turn Under Trump",
    "description": "Former Institute of Museum and Library Services leaders from both political parties expressed concern that the new funding guidelines could encourage a more constrained or distorted view of American history.",
    "link": "http://www.propublica.org/article/institute-of-museum-and-library-services-grant-guidelines-donald-trump",
    "timestamp": "2026-02-06T15:30:00Z"
  },
  {
    "title": "Rents fall again as Trump’s deportations rise",
    "description": "President Donald Trump’s mass deportation policies are not the only reason for the decline, but they are a big contributing factor. Enforcing immigration law and allowing more homes to be built are doing more for renters than slogans and rent control ever did…",
    "link": "https://freerepublic.com/focus/f-chat/4365690/posts",
    "timestamp": "2026-02-06T15:28:37Z"
  },
  {
    "title": "Trump posts video depicting Obamas as apes sparking backlash across political divide",
    "description": "Donald Trump has posted a video on Truth Social depicting Barack and Michelle Obama as apes. The clip, which he shared late last night, focuses on his accusations of fraud during the 2020 election. An AI video shows the faces of the former president and first…",
    "link": "https://freerepublic.com/focus/f-news/4365689/posts",
    "timestamp": "2026-02-06T15:28:08Z"
  },
  {
    "title": "China – New Strategic Option for America’s European Allies",
    "description": "Having lost their primary source of supply from the United States due to tariffs and the unpredictability of President Donald Trump’s policies, European allies have expanded their global reach in search of economic opportunities, and China is their strategic …",
    "link": "https://www.globalresearch.ca/china-new-strategic-option-america-european-allies/5915085",
    "timestamp": "2026-02-06T15:27:06Z"
  },
  {
    "title": "'Fake!' Black pro-Trump comedian scrambles to cover for president’s racist Obama post",
    "description": "Terrance Williams, a Black comedian, MAGA influencer and loyal supporter of President Donald Trump, scrambled Friday to cover for the president’s racist social media post that included depictions of Barack and Michelle Obama as primates, and was promptly dogp…",
    "link": "https://www.rawstory.com/trump-2675105727/",
    "timestamp": "2026-02-06T15:26:33Z"
  },
  {
    "title": "Foreign Auto Giant Makes Big Change Following Trump Tariff Onslaught",
    "description": "Toyota announced Friday that its chief executive officer Koji Sato is stepping down and will be succeeded by its chief financial officer, Kenta Kon.",
    "link": "https://dailycaller.com/2026/02/06/toyota-ceo-trump-tariffs-kenta-kon/",
    "timestamp": "2026-02-06T15:26:31Z"
  },
  {
    "title": "Jimmy Kimmel Makes Bombshell Accusations About Melania Trump’s “Rigged” Documentary",
    "description": "The documentary about the first lady reportedly exceeded box office expectations, earning more than $7 million during its opening weekend.",
    "link": "https://www.boredpanda.com/jimmy-kimmel-accusation-about-melania-rigged-documentary/",
    "timestamp": "2026-02-06T15:26:09Z"
  },
  {
    "title": "Trump's aggressive tactics force reckoning between local leaders and Washington",
    "description": "Local and state officials across the US report an increasingly hostile relationship with Washington, preparing for federal interference in areas like elections and public services. This shift, particularly after federal agents' actions in Minneapolis, has str…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-aggressive-tactics-force-reckoning-between-local-leaders-and-washington/articleshow/127997190.cms",
    "timestamp": "2026-02-06T15:26:08Z"
  },
  {
    "title": "Vance attends Olympic skating, then meets with Italian Prime Minister Meloni",
    "description": "Vance and Meloni held talks at the Prefettura di Milano, followed by a private lunch.",
    "link": "https://www.bostonherald.com/2026/02/06/vance-olympics-milan-meloni-meeting/",
    "timestamp": "2026-02-06T15:24:56Z"
  },
  {
    "title": "The UK’s Anti-Migrant Right Is Surging. Local Elections Will Test Their Power.",
    "description": "As the anti-immigrant Reform UK Party has risen in the polls, the Labour Party has co-opted some of its toxic policies.",
    "link": "https://truthout.org/articles/the-uks-anti-migrant-right-is-surging-local-elections-will-test-their-power/",
    "timestamp": "2026-02-06T15:23:29Z"
  },
  {
    "title": "CNN Anchors Call Out ‘Vile’ and ‘Racist’ Trump Post About Barack and Michelle Obama",
    "description": "CNN anchors like John Berman and Jake Tapper called out a \"vile\" and \"racist\" post by President Donald Trump that depicts the Obamas as apes.\nThe post CNN Anchors Call Out ‘Vile’ and ‘Racist’ Trump Post About Barack and Michelle Obama first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchors-call-out-vile-and-racist-trump-post-about-barack-and-michelle-obama/",
    "timestamp": "2026-02-06T15:23:00Z"
  },
  {
    "title": "Joe Rogan Slams 'Dangerous F**k' Tim Walz: 'It's Not a Coincidence' Anti-ICE Protests Broke Out Amid Minnesota Fraud Allegations",
    "description": "Joe Rogan slammed Minnesota Gov. Tim Walz (D) as a \"dangerous f**k\" during Wednesday's episode of \"The Joe Rogan Experience.\" \"It's not a coincidence\" that anti-ICE protests broke out amid Minnesota fraud allegations, the podcast powerhouse said.\nThe post Joe…",
    "link": "https://www.breitbart.com/entertainment/2026/02/06/joe-rogan-slams-dangerous-fk-tim-walz-its-not-a-coincidence-anti-ice-protests-broke-out-amid-minnesota-fraud-allegations/",
    "timestamp": "2026-02-06T15:22:33Z"
  },
  {
    "title": "Why bitcoin is losing its luster after stratospheric rise",
    "description": "Bitcoin, the world’s biggest cryptocurrency, sank this week, wiping out gains sparked by Donald Trump’s presidential election victory in November 2024.  The digital currency slumped to $60,033.01 on Friday before trimming losses, and is down around half from …",
    "link": "https://www.digitaljournal.com/world/why-bitcoin-is-losing-its-luster-after-stratospheric-rise/article",
    "timestamp": "2026-02-06T15:22:20Z"
  },
  {
    "title": "Donald Trump Reached A New Low By Posting A Blatantly Racist Video Depicting Barack And Michelle Obama As Apes",
    "description": "Y'all's president is racist. Period.View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/internet-reacts-trump-obama-video",
    "timestamp": "2026-02-06T15:22:09Z"
  },
  {
    "title": "Trump's leadership restores US influence in Latin America (Peter Laffin/Washington Examiner)",
    "description": "Peter Laffin / Washington Examiner:\nTrump's leadership restores US influence in Latin America  —  In Davos last month, President Donald Trump offered the world a clear demonstration of peace through strength, reintroducing an unapologetic “America First” agen…",
    "link": "https://www.memeorandum.com/260206/p55",
    "timestamp": "2026-02-06T15:20:01Z"
  },
  {
    "title": "Trump sparks fury with video depicting Obamas as monkeys",
    "description": "US President Donald Trump has triggered outrage after he posted a video depicting Barack Obama, the first Black president in American history, and his wife Michelle as monkeys.",
    "link": "https://www.rte.ie/news/world/2026/0206/1557135-trump-obama/",
    "timestamp": "2026-02-06T15:18:39Z"
  },
  {
    "title": "Top fiery moments as Democrats clash with Treasury Secretary Bessent in chaotic Hill hearings",
    "description": "Treasury Secretary nominee Scott Bessent faced explosive confirmation hearings as Democratic lawmakers erupted into shouting matches on Capitol Hill.",
    "link": "https://www.foxnews.com/politics/top-fiery-moments-democrats-clash-treasury-secretary-bessent-chaotic-hill-hearings",
    "timestamp": "2026-02-06T15:18:21Z"
  },
  {
    "title": "WATCH: WH offers shifting explanations of why Gabbard was at Georgia election office raid",
    "description": "President Donald Trump on Thursday again shifted explanations of why Director of National Intelligence Tulsi Gabbard was at a FBI search of a Georgia election office where 2020 ballots were seized.",
    "link": "https://abcnews.go.com/US/video/wh-offers-shifting-explanations-gabbard-georgia-election-office-129919568",
    "timestamp": "2026-02-06T15:18:18Z"
  },
  {
    "title": "Loyal Trump ally sickened by Obama attack: 'Most racist I've seen out of this White House'",
    "description": "Sen. Tim Scott (R-SC) lashed out after President Donald Trump posted a racist video that depicted Barack and Michelle Obama as apes.\"Praying it was fake because it's the most racist thing I've seen out of this White House,\" Scott wrote Friday on X. \"The Presi…",
    "link": "https://www.rawstory.com/tim-scott-2675105725/",
    "timestamp": "2026-02-06T15:17:34Z"
  },
  {
    "title": "Americans Vote With Their Feet",
    "description": "It may seem that it’s impossible to get anything done in Washington these days. Nevertheless, the free spirit of Americans cannot be suppressed. Americans are... Read More\nThe post Americans Vote With Their Feet appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/06/americans-vote-with-their-feet/",
    "timestamp": "2026-02-06T15:17:27Z"
  },
  {
    "title": "White House dismisses ‘fake outrage’ over video Trump posted showing Obamas as gorillas",
    "description": "Sen. Tim Scott (R-SC) broke with the White House over the video, saying on X: \"Praying it [the post] was fake because it’s the most racist thing I’ve seen out of this White House.\"",
    "link": "https://nypost.com/2026/02/06/us-news/white-house-dismisses-fake-outrage-over-video-trump-posted-showing-obamas-as-gorillas/",
    "timestamp": "2026-02-06T15:17:21Z"
  },
  {
    "title": "Trump shares racist video depicting the Obamas as monkeys",
    "description": "President Donald Trump reposted a racist video clip on his Truth Social account late Thursday night that depicted former President Barack Obama and former first lady Michelle Obama as apes.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-shares-racist-video-depicting-obamas-monkeys-rcna257756",
    "timestamp": "2026-02-06T15:16:00Z"
  },
  {
    "title": "Republicans warn Democrats' ICE reform push is cover to defund border enforcement",
    "description": "Senate Minority Leader Chuck Schumer, D-N.Y., and congressional Democrats unveiled their revamped list of demands for DHS funding, but Senate Republicans aren't taking many of the asks seriously.",
    "link": "https://www.foxnews.com/politics/republicans-warn-democrats-ice-reform-push-cover-defund-border-enforcement",
    "timestamp": "2026-02-06T15:15:50Z"
  },
  {
    "title": "Trump Posts Wildly Racist Video of the Obamas (Ryan Bort/Rolling Stone)",
    "description": "Ryan Bort / Rolling Stone:\nTrump Posts Wildly Racist Video of the Obamas  —  The president shared an election conspiracy video that included a clip depicting Barack and Michelle Obama as apes  —  President Donald Trump went on a wild social media posting spre…",
    "link": "https://www.memeorandum.com/260206/p53",
    "timestamp": "2026-02-06T15:15:00Z"
  },
  {
    "title": "On the Road to Nuclear War: Lawrence Wittner",
    "description": "On January 27, 2026, the editors of the Bulletin of the Atomic Scientists moved the hands of their famous “Doomsday Clock” to 85 seconds to midnight – the closest setting, since the appearance of the clock in 1946, to nuclear annihilation. This grim appraisal…",
    "link": "https://www.antiwar.com/blog/2026/02/06/on-the-road-to-nuclear-war-lawrence-wittner/",
    "timestamp": "2026-02-06T15:14:06Z"
  },
  {
    "title": "Lawsuit accuses Cornell University of excluding White candidates from faculty hiring",
    "description": "Cornell University faces a federal lawsuit alleging it excluded White candidates from a faculty position, violating Title VII of the Civil Rights Act. The complaint claims diversity administrators created an interview list solely of \"underrepresented minority…",
    "link": "https://timesofindia.indiatimes.com/education/news/lawsuit-accuses-cornell-university-of-excluding-white-candidates-from-faculty-hiring/articleshow/127996523.cms",
    "timestamp": "2026-02-06T15:09:47Z"
  }
]