[
  {
    "title": "Trump signals he plans to speak to China's Xi about Nvidia's 'super duper' chips",
    "description": "U.S. President Donald Trump says he plans to discuss Nvidia’s advanced Blackwell AI chips with Chinese President Xi Jinping later this week.",
    "link": "https://biztoc.com/x/981c21ffd3199fe7",
    "timestamp": "2025-10-29T03:34:59Z"
  },
  {
    "title": "South Korea to award Trump its highest medal, gift him a golden crown",
    "description": "South Korea is hosting U.S. President Donald Trump. He will receive a replica gold crown and the nation's highest award. President Trump is on the final leg of his Asia trip. High-level trade talks are scheduled. He will also tour a museum and attend a workin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/south-korea-to-award-trump-its-highest-medal-gift-him-a-golden-crown/articleshow/124887989.cms",
    "timestamp": "2025-10-29T03:33:39Z"
  },
  {
    "title": "Trump signals he plans to speak to China's Xi about Nvidia's 'super duper' chips",
    "description": "U.S. President Donald Trump says he plans to discuss Nvidia’s advanced Blackwell AI chips with Chinese President Xi Jinping later this week.",
    "link": "https://www.cnbc.com/2025/10/29/trump-signals-he-plans-to-speak-to-chinas-xi-about-nvidias-super-duper-chips.html",
    "timestamp": "2025-10-29T03:31:58Z"
  },
  {
    "title": "Parsi sanatorium property in Sanjan receives highest bid of Rs 8 crore amid opposition",
    "description": "A 2.5-acre Parsi sanatorium in Sanjan fetched ₹8 crore at auction, with Chandan Steel emerging as the highest bidder. Despite opposition from some community members and the original owners' family, the trustees proceeded with the sale. Proceeds are earmarked …",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/parsi-sanatorium-property-in-sanjan-receives-highest-bid-of-rs-8-crore-amid-opposition/articleshow/124887902.cms",
    "timestamp": "2025-10-29T03:30:04Z"
  },
  {
    "title": "Adin Ross makes a shocking confession about his deleted Donald Trump posts and the wild fallout that no one saw coming",
    "description": "Streamer Adin Ross revealed a surprising outcome after removing all Donald Trump-related posts from his Instagram: his inbox exploded with messages from famous individuals. This move, described as a strategic clean-up, has significantly altered his online int…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/adin-ross-makes-a-shocking-confession-about-his-deleted-donald-trump-posts-and-the-wild-fallout-that-no-one-saw-coming/articleshow/124887763.cms",
    "timestamp": "2025-10-29T03:28:26Z"
  },
  {
    "title": "Trump lands in South Korea, says Xi talks will be 'great outcome for world'",
    "description": "US President Donald Trump and his Chinese counterpart Xi Jinping are expected to meet on Thursday.",
    "link": "https://www.channelnewsasia.com/world/trump-lands-south-korea-apec-summit-meeting-xi-jinping-lee-jae-myung-5431651",
    "timestamp": "2025-10-29T03:25:16Z"
  },
  {
    "title": "China's Xi to meet Trump, who touts South Korea deal on last stop of Asia tour",
    "description": "\"The relationship with China is very good. So I think we're going to have a very good outcome for our country and for the world, actually,\" Trump told reporters earlier.",
    "link": "https://www.channelnewsasia.com/world/us-donald-trump-china-xi-jinping-meet-busan-trade-5431651",
    "timestamp": "2025-10-29T03:25:00Z"
  },
  {
    "title": "NVIDIA Could Receive Approval for Blackwell AI Chip in China, Marking a Major “Bonus” for Its Market Share in the Region",
    "description": "NVIDIA's market position in China could see a significant boost following the Trump-Xi meeting, as President Trump hints at discussing 'Blackwell' AI chips for Beijing. NVIDIA's Blackwell AI Chip Will Be a Topic of Discussion Under Trump-Xi Meeting, With a Po…",
    "link": "https://wccftech.com/nvidia-could-receive-approval-for-blackwell-ai-chip-in-china/",
    "timestamp": "2025-10-29T03:24:30Z"
  },
  {
    "title": "Trump arrives in South Korea for trade talks",
    "description": "United States President Donald Trump arrived in South Korea, where he is to attend the Asia-Pacific Economic Cooperation (APEC).Shortly upon arrival, he boarded his Marine One presidential helicopter ...",
    "link": "https://biztoc.com/x/6fe1242c6c7c76fa",
    "timestamp": "2025-10-29T03:23:53Z"
  },
  {
    "title": "Wedding season glitter returns as gold dips below ₹1.2 lakh, jewellers restock",
    "description": "Gold prices have fallen below ₹1.2 lakh per 10 gm for the first time in three weeks, a decline expected to boost sales during the upcoming wedding season. Jewellers are restocking as prices dropped 9% since Dhanteras, with further movements dependent on US-Ch…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/wedding-season-glitter-returns-as-gold-dips-below-1-2-lakh-jewellers-restock/articleshow/124887864.cms",
    "timestamp": "2025-10-29T03:20:16Z"
  },
  {
    "title": "Gold steadies on Fed rate cut expectations after three-day fall",
    "description": "Gold stabilizes at $3,950 an ounce amid expectations of a Federal Reserve rate cut after a three-day decline.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-28/gold-steady-after-three-day-drop-as-trade-hopes-sap-haven-demand",
    "timestamp": "2025-10-29T03:18:59Z"
  },
  {
    "title": "Senator Blocks Trump-Backed Effort To Make Daylight Saving Time Permanent",
    "description": "Sen. Tom Cotton wasn’t fast enough in 2022 to block Senate passage of legislation that would make daylight saving time permanent. Three years later, he wasn’t about to repeat that same mistake. The Arkansas Republican was on hand Tuesday afternoon to thwart a…",
    "link": "https://slashdot.org/submission/17341854/senator-blocks-trump-backed-effort-to-make-daylight-saving-time-permanent",
    "timestamp": "2025-10-29T03:18:02Z"
  },
  {
    "title": "Obamacare enrollees get first look at 2026 prices as premiums soar",
    "description": "Premiums for Affordable Care Act coverage will skyrocket 26%, on average, next year, according to a KFF analysis released Tuesday evening, just days before open enrollment starts on Nov. 1.",
    "link": "https://www.abc12.com/news/health/obamacare-enrollees-get-first-look-at-2026-prices-as-premiums-soar/article_53d41c5c-1f72-596b-810c-5c248b3d884d.html",
    "timestamp": "2025-10-29T03:10:00Z"
  },
  {
    "title": "Trump Concedes, ‘I’m Not Allowed’ To Serve a Third Term – ‘But We Have a Lot of Great People’",
    "description": "President Donald Trump finally admitted on Tuesday that he is not allowed to serve a third term as president.\nThe post Trump Concedes, ‘I’m Not Allowed’ To Serve a Third Term – ‘But We Have a Lot of Great People’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-concedes-im-not-allowed-to-serve-a-third-term-but-we-have-a-lot-of-great-people/",
    "timestamp": "2025-10-29T03:09:12Z"
  },
  {
    "title": "Trump says US law blocks bid for a third presidential term",
    "description": "U.S. President Donald Trump has ruled out seeking a third term, acknowledging that the U.S. Constitution prevents him from running again after his current term ends in January 2029. “If you read it, it’s pretty clear – I’m not allowed to run. It’s too bad,” T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-law-blocks-bid-for-a-third-presidential-term/articleshow/124887660.cms",
    "timestamp": "2025-10-29T03:08:24Z"
  },
  {
    "title": "Channel 12 News analyst: Hamas exploiting US stance to harm Israel",
    "description": "Ohad Hemo assesses Hamas tactics: “They’re playing a double game and acting with excessive confidence, based on the assumption that Trump does not want to reignite the war.”",
    "link": "https://www.israelnationalnews.com/news/416980",
    "timestamp": "2025-10-29T03:06:07Z"
  },
  {
    "title": "Trump-Xi meeting looms over APEC conference in South Korea as free trade falters",
    "description": "SEOUL, South Korea (AP) — South Korea this week will host leaders from major Pacific Rim economies, including the United States, China and Japan, for an annual summit that has long championed free trade. But this year’s Asia-Pacific Economic Cooperation meeti…",
    "link": "https://financialpost.com/pmn/trump-xi-meeting-looms-over-apec-conference-in-south-korea-as-free-trade-falters",
    "timestamp": "2025-10-29T03:06:06Z"
  },
  {
    "title": "Trump Says 'Pretty Clear I'm Not Allowed to Run' for Third Term (Jennifer A Dlouhy/Bloomberg)",
    "description": "Jennifer A Dlouhy / Bloomberg:\nTrump Says 'Pretty Clear I'm Not Allowed to Run' for Third Term  —  US President Donald Trump conceded Wednesday that it was “pretty clear” the Constitution didn't allow him to seek a third term as president, despite frequently …",
    "link": "https://www.memeorandum.com/251028/p161",
    "timestamp": "2025-10-29T03:05:00Z"
  },
  {
    "title": "Executive Order To Go Back To Steam Catapults On New Aircraft Carriers Coming: Trump (Joseph Trevithick/The War Zone)",
    "description": "Joseph Trevithick / The War Zone:\nExecutive Order To Go Back To Steam Catapults On New Aircraft Carriers Coming: Trump  —  The electromagnetic catapults and weapons elevators for Ford class carriers have historically been a headache, but changing now would cr…",
    "link": "https://www.memeorandum.com/251028/p160",
    "timestamp": "2025-10-29T03:00:01Z"
  },
  {
    "title": "Surgeon general nominee Casey Means says she'll focus on 'healing and prevention' instead of 'overmedicalization'",
    "description": "Surgeon general nominee Casey Means says she'll focus on 'healing and prevention' instead of 'overmedicalization'go.com",
    "link": "https://abcnews.go.com/Health/surgeon-general-nominee-casey-means-shell-focus-healing/story?id=126951316",
    "timestamp": "2025-10-29T02:58:33Z"
  },
  {
    "title": "White House fires commission charged with advising the president on design as Trump pushes construction projects",
    "description": "The White House has fired all six members of the Commission of Fine Arts, an independent federal agency charged with advising the president, Congress and the city of Washington, DC, on “matters of design and aesthetics,” according to a source familiar with th…",
    "link": "https://freerepublic.com/focus/f-news/4349313/posts",
    "timestamp": "2025-10-29T02:56:33Z"
  },
  {
    "title": "Reduction of US tariffs on China linked to fentanyl possible, Trump signals ahead of Xi meeting",
    "description": "US President Donald Trump plans to ease tariffs on Chinese fentanyl-related goods. This move is contingent on China strengthening controls over chemicals used to make the deadly opioid. The announcement precedes a meeting with Chinese President Xi Jinping at …",
    "link": "https://economictimes.indiatimes.com/news/international/us/reduction-of-us-tariffs-on-china-linked-to-fentanyl-possible-trump-signals-ahead-of-xi-meeting/articleshow/124887290.cms",
    "timestamp": "2025-10-29T02:50:45Z"
  },
  {
    "title": "Newsom invokes Scripture in attack on GOP over shutdown affecting food assistance: ‘Cruelty is the policy’",
    "description": "Newsom cites biblical teachings to slam federal leaders, Trump admin over government shutdown's impact on food assistance, as California sues USDA over suspended SNAP benefits.",
    "link": "https://www.foxnews.com/politics/newsom-invokes-scripture-attack-gop-over-shutdown-affecting-food-assistance-cruelty-policy",
    "timestamp": "2025-10-29T02:50:21Z"
  },
  {
    "title": "U.S. ambassador to Canada goes on expletive-laced tirade at Ontario’s trade representative, witnesses say",
    "description": "The U.S. ambassador to Canada delivered an expletive-laced tirade at Ontario's trade representative at an event in Ottawa on Monday, multiple witnesses tell CBC News",
    "link": "https://www.cbc.ca/news/politics/ambassador-hoekstra-rant-9.6957854",
    "timestamp": "2025-10-29T02:49:50Z"
  },
  {
    "title": "Nvidia will build AI supercomputers for US Energy Department, wants to get back into China",
    "description": "Nvidia CEO Jensen Huang announced the company will build seven AI supercomputers for the U.S. Department of Energy, aiding nuclear arsenal and alternative energy research. Huang emphasized the need for U.S. tech leadership while also advocating for continued …",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-will-build-ai-supercomputers-for-us-energy-department-wants-to-get-back-into-china/articleshow/124887341.cms",
    "timestamp": "2025-10-29T02:48:58Z"
  },
  {
    "title": "Trump lands in South Korea to face trade talks and North Korean missiles",
    "description": "GYEONGJU, South Korea (Reuters) -U. President Donald Trump landed in South Korea on Wednesday for the final leg of his Asia trip, optimistic about striking a...",
    "link": "https://www.yahoo.com/news/articles/trump-lands-south-korea-face-024850009.html",
    "timestamp": "2025-10-29T02:48:50Z"
  },
  {
    "title": "How Venezuela's Nobel Prize winner built a high-stakes alliance with Trump",
    "description": "Members of Maria Corina Machado’s team helped Washington build the case for an aggressive stance against the Venezuelan government led by President Nicolas Maduro.",
    "link": "https://www.japantimes.co.jp/news/2025/10/29/world/politics/venezuela-nobel-alliance-trump/",
    "timestamp": "2025-10-29T02:48:00Z"
  },
  {
    "title": "Trump Expects Lower Fentanyl Tariff, Nvidia Talks With Xi",
    "description": "“I expect to be lowering that because I believe they’re going to help us with the fentanyl situation,” Trump told reporters on Air Force One as he headed to ...",
    "link": "https://finance.yahoo.com/news/trump-expects-lower-fentanyl-tariff-024554324.html",
    "timestamp": "2025-10-29T02:45:54Z"
  },
  {
    "title": "The East Wing demolition was 'jarring.' But a White House history buff sees a silver lining",
    "description": "Stewart McLaurin knew it was coming",
    "link": "https://abcnews.go.com/US/wireStory/east-wing-demolition-jarring-white-house-history-buff-126960791",
    "timestamp": "2025-10-29T02:45:35Z"
  },
  {
    "title": "US Senate moves to overturn Trump’s Brazil tariffs amid Bolsonaro prosecution row",
    "description": "The resolution, backed by five Republicans, seeks to terminate the national emergency Trump declared in July after Brazil prosecuted former President Jair Bolsonaro for an alleged coup attempt",
    "link": "https://www.thehindubusinessline.com/news/world/us-senate-moves-to-overturn-trumps-brazil-tariffs-amid-bolsonaro-prosecution-row/article70215273.ece",
    "timestamp": "2025-10-29T02:44:09Z"
  },
  {
    "title": "White House fires board that reviews presidential construction projects",
    "description": "The firing of fired all six members of the Commission of Fine Arts comes as Trump plans to build a triumphal arch along the Potomac River, and a new ballroom on the White House grounds.",
    "link": "https://www.nbcnews.com/politics/donald-trump/white-house-fires-commission-fine-arts-board-trump-ballroom-projects-rcna240405",
    "timestamp": "2025-10-29T02:44:07Z"
  },
  {
    "title": "Breaking News Live Updates: Trump lands in South Korea, eyes talks with Xi & future meeting with North Korea",
    "description": "Breaking News Live Updates: US President Donald Trump landed in South Korea on Wednesday after departing from Japan, marking the third stop of his Asia tour. The two-time US President is set to hold a crucial meeting with Chinese President Xi Jinping on which…",
    "link": "https://m.economictimes.com/news/newsblogs/breaking-world-india-news-live-updates-trump-xi-meeting-us-china-trade-deal-bihar-assembly-elections-ukraine-russia-conflict-pakistan-afghanistan-israel-gaza-war/liveblog/124887272.cms",
    "timestamp": "2025-10-29T02:43:35Z"
  },
  {
    "title": "Man struck dead by vehicle on Virginia highway after trying to flee immigration agents",
    "description": "A 24-year-old Honduran man who was fleeing federal immigration agents in Virginia died on a highway after being struck by a vehicle. The death of Josué Castro Rivera follows recent incidents in which three other immigrants in Chicago and California were kille…",
    "link": "https://freerepublic.com/focus/f-news/4349311/posts",
    "timestamp": "2025-10-29T02:40:40Z"
  },
  {
    "title": "Asia mostly higher on Trump remarks, Fed cut hopes",
    "description": "Asia-Pacific markets traded mostly higher on Wednesday after United States President Donald Trump said that he expects to lower fentanyl-linked tariffs on Chinese goods. Japan's benchmark Nikkei 225 i...",
    "link": "https://biztoc.com/x/4b7af00dd4bac5d2",
    "timestamp": "2025-10-29T02:40:04Z"
  },
  {
    "title": "China stocks near 3-year high on US plan to cut fentanyl-linked tariffs",
    "description": "Chinese stocks rose, driving the benchmark close to a more than three-year high as investors bet on further easing of tariff tensions after US President Donald Trump said he would lower import levies in exchange for Beijing taking action to stem fentanyl prod…",
    "link": "https://biztoc.com/x/7aec81e6ff02f245",
    "timestamp": "2025-10-29T02:39:50Z"
  },
  {
    "title": "Trump says Toyota's US pledge among industry's largest",
    "description": "United States President Donald Trump told reporters aboard Air Force One that Toyota Motor Corp.'s planned $10 billion expansion in the United States will rank among the largest commitments in the...",
    "link": "https://biztoc.com/x/5494de41a440f203",
    "timestamp": "2025-10-29T02:39:42Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang Delivers Stark Message In Washington — US Can't Win AI Battle By Shutting Out China's Developers: 'It Hurts Us More'",
    "description": "On Tuesday, Nvidia Corporation (NASDAQ:NVDA) CEO Jensen Huang warned that the push to isolate China from advanced AI chips could go wrong.\nHuang Urges Balance Between American Leadership And Global Access\nAt Nvidia's first developers' conference in Washington…",
    "link": "https://biztoc.com/x/c15adb8871e5c4ea",
    "timestamp": "2025-10-29T02:39:36Z"
  },
  {
    "title": "Inflation kills November rate cut, next RBA move could be up",
    "description": "A November rate cut is dead, buried and cremated. It now looks far from certain that interest rates will fall again at all.",
    "link": "https://www.abc.net.au/news/2025-10-29/september-quarter-inflation-kills-interest-rate-cut/105946770",
    "timestamp": "2025-10-29T02:39:23Z"
  },
  {
    "title": "India’s geoeconomic options in a Trumpian world",
    "description": "India resists Trump-era U.S. pressure through selective concessions, strategic patience and diversified partnerships, safeguarding its sovereignty.",
    "link": "https://www.japantimes.co.jp/commentary/2025/10/29/world/indias-options-in-a-trumpian-world/",
    "timestamp": "2025-10-29T02:33:00Z"
  },
  {
    "title": "With gifts and hospitality, Takaichi taps Abe's legacy to forge bond with Trump",
    "description": "Talk turned to Abe as soon as the U.S. leader stepped into the Akasaka Palace in Tokyo to exchange pleasantries with Japan's recently appointed prime minister.",
    "link": "https://www.japantimes.co.jp/news/2025/10/29/japan/politics/abe-bonds-takaichi-trump-gifts/",
    "timestamp": "2025-10-29T02:32:00Z"
  },
  {
    "title": "Indian buyers resume US green lentils imports, but drive hard bargain",
    "description": "Indian buyers resume US green lentil imports, seeking price renegotiations amid a collapsing global pulses market.",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/indian-buyers-resume-us-green-lentils-imports-but-drive-hard-bargain/article70213147.ece",
    "timestamp": "2025-10-29T02:30:00Z"
  },
  {
    "title": "Trump says he expects to lower fentanyl tariff against China during Xi meeting",
    "description": "Trump says he expects to lower fentanyl tariff against China during Xi meeting\nInvesting.com-- U.S. President Donald Trump said on Wednesday he expects to lower his fentanyl-related trade tariffs against China as part of an upcoming meeting with President Xi …",
    "link": "https://biztoc.com/x/3523259b3aeb7993",
    "timestamp": "2025-10-29T02:28:56Z"
  },
  {
    "title": "Trump says Taiwan may not come up in meeting with Xi",
    "description": "United States President Donald Trump told reporters Taiwan may not feature prominently in his talks with Chinese President Xi Jinping, though he left open the possibility that Xi could raise the issue...",
    "link": "https://biztoc.com/x/3bee7589abedde7a",
    "timestamp": "2025-10-29T02:28:52Z"
  },
  {
    "title": "Nvidia will build AI supercomputers for U.S. Energy Department, wants to get back into China",
    "description": "In Washington, Nvidia CEO Jensen Huang walked a fine line between praising U.S. President Donald Trump and risking further antagonism of China.",
    "link": "https://biztoc.com/x/2f2e744e6d3993d9",
    "timestamp": "2025-10-29T02:28:44Z"
  },
  {
    "title": "Outrage as Sikh trucker who killed 3 in US crash brought in court without turban",
    "description": "A 21-year-old Indian truck driver, Jashanpreet Singh, accused of causing an eight-vehicle crash in Southern California that killed three people, appeared in a US court without his turban—sparking outrage in India. Many, including Shiromani Akali Dal (SAD) pre…",
    "link": "https://freerepublic.com/focus/f-chat/4349309/posts",
    "timestamp": "2025-10-29T02:26:53Z"
  },
  {
    "title": "Oil edges up on US crude inventory draw",
    "description": "Oil prices saw a slight increase on Wednesday after three days of declines, driven by a significant drop in U.S. crude inventories. However, gains were tempered by concerns over Russian sanctions and potential OPEC+ production increases. U.S. crude, gasoline,…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-edges-up-on-us-crude-inventory-draw/articleshow/124886955.cms",
    "timestamp": "2025-10-29T02:24:39Z"
  },
  {
    "title": "Inside The Trump Family's Global Crypto Cash Machine",
    "description": "The U.S. president’s family raked in more than $800 million from sales of crypto assets in the first half of 2025 alone, a Reuters examination found.",
    "link": "https://www.huffpost.com/entry/trump-family-global-crypto-cash_n_69016671e4b0522875e88258",
    "timestamp": "2025-10-29T02:23:21Z"
  },
  {
    "title": "Nvidia will build AI supercomputers for U.S. Energy Department, wants to get back into China",
    "description": "In Washington, Nvidia CEO Jensen Huang walked a fine line between praising U.S. President Donald Trump and risking further antagonism of China.",
    "link": "https://www.japantimes.co.jp/business/2025/10/29/tech/nvidia-ai-supercomputers-us-china/",
    "timestamp": "2025-10-29T02:21:00Z"
  },
  {
    "title": "As Trump and Xi near deal, few see letup in heated US-China rivalry",
    "description": "Expectations are modest for how far a US-China deal will go to resolve the differences between the superpowers.",
    "link": "https://www.aljazeera.com/news/2025/10/29/as-trump-and-xi-near-deal-few-see-letup-in-heated-us-china-rivalry",
    "timestamp": "2025-10-29T02:18:54Z"
  },
  {
    "title": "Trump says 'not allowed' to run for third term",
    "description": "United States President Donald Trump said that he is \"not allowed to run\" for a third term.\"Based on what I read, I guess I'm not allowed to run. So we'll see what happens,\" Trump told reporters aboar...",
    "link": "https://biztoc.com/x/dc2ca74928bff315",
    "timestamp": "2025-10-29T02:18:10Z"
  },
  {
    "title": "Trump expects to lower China fentanyl tariffs after Xi talks",
    "description": "United States President Donald Trump told reporters aboard Air Force One that he expects to reduce tariffs tied to fentanyl after his upcoming meeting with Chinese President Xi Jinping.\nTrump said he...",
    "link": "https://biztoc.com/x/485c062fe1ab3b6c",
    "timestamp": "2025-10-29T02:17:56Z"
  },
  {
    "title": "Trump: Hamas has to behave or be terminated",
    "description": "When asked about Israel's latest strikes on Gaza, United States President Donald Trump said that \"nothing is going to jeopardize\" the ceasefire between Israel and Hamas.\"You have to understand, Hamas ...",
    "link": "https://biztoc.com/x/cf3448cdb399e288",
    "timestamp": "2025-10-29T02:17:44Z"
  },
  {
    "title": "Court Throws Out Ruling Backing Trump’s Portland National Guard Deployment",
    "description": "Judges on the Court of Appeals voted Tuesday to rehear a case over the deployment of Oregon’s National Guard.",
    "link": "https://dailycaller.com/2025/10/28/court-appeals-trump-portland-national-guard/",
    "timestamp": "2025-10-29T02:15:06Z"
  },
  {
    "title": "Trump bonds with new Japan PM over baseball and US beef",
    "description": "US News: Inside a gold-drenched palace in Tokyo on Tuesday morning, President Donald Trump heaped praise on Sanae Takaichi, Japan's new prime minister, telling.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-bonds-with-new-japan-pm-over-baseball-and-us-beef/articleshow/124886857.cms",
    "timestamp": "2025-10-29T02:14:03Z"
  },
  {
    "title": "Ohio refugees will lose their SNAP benefits next month under Trump’s ‘Big Beautiful Bill’",
    "description": "Upcoming changes to the Supplemental Nutrition Assistance Program (SNAP) will soon restrict which Ohioans are eligible for benefits. The One Big Beautiful Bill, which President Donald Trump signed into law on July 4, changes “non-citizen eligibility for SNAP.…",
    "link": "https://freerepublic.com/focus/f-news/4349308/posts",
    "timestamp": "2025-10-29T02:10:48Z"
  },
  {
    "title": "North Korea boasts missile test-firings as Trump makes South Korea visit",
    "description": "North Korea’s official Korean Central News Agency said the missiles fired Tuesday flew for more than two hours before accurately striking targets in its western waters.",
    "link": "https://nypost.com/2025/10/28/world-news/north-korea-boasts-missile-test-firings-as-trump-makes-south-korea-visit/",
    "timestamp": "2025-10-29T02:10:44Z"
  },
  {
    "title": "Trump warns: If Hamas does not behave, they will be terminated",
    "description": "President Trump backs Israel’s right to retaliate after Hamas attacked soldiers in Rafah: Hamas is a limited factor in the Middle East deal.",
    "link": "https://www.israelnationalnews.com/news/416977",
    "timestamp": "2025-10-29T02:09:08Z"
  },
  {
    "title": "Toyota to ship Its U.S.-made vehicles to Japan",
    "description": "Tokyo has agreed to work toward allowing safety certified U.S.-made vehicles to be sold in Japan without undergoing additional testing.",
    "link": "https://www.japantimes.co.jp/business/2025/10/29/companies/toyota-car-imports-us/",
    "timestamp": "2025-10-29T02:08:00Z"
  },
  {
    "title": "Now He Tells Us: Bill Gates Backflips and Says ‘Climate Change’ No Threat to Humanity After All",
    "description": "Why are people panicking about the weather? Climate doomer Bill Gates thinks everyone should just calm down. He believes “climate change” is a serious problem but it won’t be the end of humanity as we know it, a 17-page memo released Tuesday by the billionair…",
    "link": "https://freerepublic.com/focus/f-chat/4349307/posts",
    "timestamp": "2025-10-29T02:05:11Z"
  },
  {
    "title": "Trump Administration Retreats on Push for Atlantic Oil Drilling",
    "description": "The Trump administration is ruling out selling offshore oil and gas leases along the US East Coast, after its initial plan for auctioning them drew alarm from Republican strongholds in the Southeast.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-administration-retreats-on-push-for-atlantic-oil-drilling",
    "timestamp": "2025-10-29T02:03:33Z"
  },
  {
    "title": "Trump says he expects to lower fentanyl-related tariffs on Beijing, discuss 'farmers' with China's Xi",
    "description": null,
    "link": "https://www.cnbc.com/2025/10/29/trump-says-he-expects-to-lower-fentanyl-related-tariffs-on-beijing-discuss-farmers-with-chinaxi.html",
    "timestamp": "2025-10-29T02:02:15Z"
  },
  {
    "title": "‘South Park’ Has Been Mysteriously Delayed Yet Again",
    "description": "Spend your Halloween with Donald Trump and Satan",
    "link": "https://www.cracked.com/article_48934_south-park-has-been-mysteriously-delayed-yet-again.html",
    "timestamp": "2025-10-29T02:01:00Z"
  },
  {
    "title": "The world has lifted millions out of poverty but the climate crisis could undo decades of progress",
    "description": "With global climate talks scheduled shortly at CoP-30 in Belém, Brazil, a new UN report delivers a stark warning: the world’s success in lifting millions out of poverty may be at risk of reversal, as global warming deepens deprivation and exposes the poorest …",
    "link": "https://www.livemint.com/opinion/online-views/global-multidimensional-poverty-index-2025-mpi-india-climate-change-poverty-floods-drought-refugee-cop30-belem-brazil-11761655659689.html",
    "timestamp": "2025-10-29T02:00:19Z"
  },
  {
    "title": "How Donald Trump Jr.'s daughter Kai Trump brings 6M followers to LPGA spotlight",
    "description": "Kai Trump is about to make her biggest swing yet. The 18-year-old granddaughter of U.S. President Donald Trump will make her LPGA debut this November at The ANNIKA driven by Gainbr",
    "link": "https://www.marca.com/en/golf/pga-tour/2025/10/29/690174d8e2704edd678b45e5.html",
    "timestamp": "2025-10-29T01:59:56Z"
  },
  {
    "title": "Donald Trump’s granddaughter Kai Trump turns heads with bold LPGA Tour debut at The Annika in Florida",
    "description": "Donald Trump's granddaughter, 18-year-old Kai Trump, is making her professional golf debut at The Annika, an elite LPGA Tour event. Earning a sponsor's exemption, she will compete alongside top golfers, fulfilling a lifelong dream. The LPGA sees her participa…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/donald-trumps-granddaughter-kai-trump-turns-heads-with-bold-lpga-tour-debut-at-the-annika-in-florida/articleshow/124886654.cms",
    "timestamp": "2025-10-29T01:58:55Z"
  },
  {
    "title": "US Senate passes bill to terminate Trump tariffs against Brazil",
    "description": "The Republican-led Senate passed legislation to overturn President Trump's tariffs on Brazil, terminating the national emergency declared in retaliation for Brazil's prosecution of former President Bolsonaro. This measure, approved 52-48 with bipartisan suppo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senate-passes-bill-to-terminate-trump-tariffs-against-brazil/articleshow/124886704.cms",
    "timestamp": "2025-10-29T01:58:37Z"
  },
  {
    "title": "Gold rebounds on bargain hunting ahead of Fed verdict",
    "description": "Gold prices saw a slight increase on Wednesday. Bargain hunters entered the market after a recent dip. Investors are now keenly awaiting the Federal Reserve's interest rate decision later today. The European Central Bank is also set to announce its decision t…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rebounds-on-bargain-hunting-ahead-of-fed-verdict/articleshow/124886679.cms",
    "timestamp": "2025-10-29T01:56:15Z"
  },
  {
    "title": "Dollar on backfoot ahead of expected Fed cut, Aussie gains on CPI",
    "description": "The US dollar is trading near a one-week low. Markets anticipate a Federal Reserve interest rate cut today. Investors await guidance from Fed Chair Jerome Powell. A meeting between US President Donald Trump and Chinese President Xi Jinping is scheduled for to…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-on-backfoot-ahead-of-expected-fed-cut-aussie-gains-on-cpi/articleshow/124886671.cms",
    "timestamp": "2025-10-29T01:55:46Z"
  },
  {
    "title": "Wall Street indexes post record closing highs as Nvidia jumps, megacap earnings ahead",
    "description": "Indian markets are buzzing as US stock indexes reach new peaks. Nvidia's AI deals and strong corporate earnings are fueling optimism. Investors await key results from tech giants like Apple and Microsoft. The Federal Reserve is expected to cut interest rates …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-post-record-closing-highs-as-nvidia-jumps-megacap-earnings-ahead/articleshow/124886663.cms",
    "timestamp": "2025-10-29T01:55:33Z"
  },
  {
    "title": "Steve Bannon Calls For Netanyahu To Be Toppled ‘Immediately’: ‘We Need Regime Change in Jerusalem and We Need It Tonight’",
    "description": "Former White House chief strategist Steve Bannon called for Israeli Prime Minister Benjamin Netanyahu to be toppled \"immediately\" on Tuesday.\nThe post Steve Bannon Calls For Netanyahu To Be Toppled ‘Immediately’: ‘We Need Regime Change in Jerusalem and We Nee…",
    "link": "https://www.mediaite.com/media/tv/steve-bannon-calls-for-netanyahu-to-be-toppled-immediately-we-need-regime-change-in-jerusalem-and-we-need-it-tonight/",
    "timestamp": "2025-10-29T01:52:43Z"
  },
  {
    "title": "Trump in Japan: How the US president's stay unfolded",
    "description": "TOKYO -- U.S. President Donald Trump is on a whirlwind trip to Asia, reconnecting with partners shaken by his global tariff policies and maneuvering in his trade war with China.\nAfter a stop in Malaysia for the ASEAN Summit, Trump arrived in Japan on Monday. …",
    "link": "https://biztoc.com/x/1ece41b7f53a4f1f",
    "timestamp": "2025-10-29T01:44:32Z"
  },
  {
    "title": "Trump Administration Brings Back A Confederate Statue In DC",
    "description": "The move adds to Trump's efforts to preserve monuments that honor Confederate leaders.",
    "link": "https://www.huffpost.com/entry/trump-albert-pike-confederate-general-statue_n_690153cce4b09e940236abfa",
    "timestamp": "2025-10-29T01:43:35Z"
  },
  {
    "title": "Fuming SNAP recipients threaten to loot if food stamps are cut Nov. 1: ‘Stay the f–k out of my way’",
    "description": "SNAP recipients are taking to TikTok and threatening to loot grocery stores if their food stamp payments don’t go through on Nov. 1 due to the government shutdown. “I’ma tell y’all straight up like this, I just got that text that the link is definitely cut th…",
    "link": "https://freerepublic.com/focus/f-news/4349301/posts",
    "timestamp": "2025-10-29T01:41:30Z"
  },
  {
    "title": "Trump’s visit to Asia: Pacts with Southeast Asian nations show US’s need to counter China’s control over critical-mineral supply chains",
    "description": "Should there be a détente in the trade war, India will need to swiftly recalibrate its China strategy. Regardless of what happens between Trump and Xi, New Delhi needs to mend fences with Washington",
    "link": "https://indianexpress.com/article/opinion/editorials/trumps-visit-to-asia-pacts-with-southeast-asian-nations-show-uss-need-to-counter-chinas-control-over-critical-mineral-supply-chains-10332723/",
    "timestamp": "2025-10-29T01:39:34Z"
  },
  {
    "title": "Substrate raises $100M to do the impossible and reinvent the chipmaking industry",
    "description": "An extremely ambitious startup called Substrate Inc. said today it has raised an initial $100 million to fund its mission to disrupt the global semiconductor industry and reinvent chipmaking. The company is being backed by high-profile investors including Pet…",
    "link": "https://siliconangle.com/2025/10/28/substrate-raises-100m-impossible-reinvent-chipmaking-industry/",
    "timestamp": "2025-10-29T01:38:09Z"
  },
  {
    "title": "‘They’ve Been Falling For It For 10 Years’: Scott Jennings Has Theory On Trump’s Third Term Talk",
    "description": "Scott Jennings said Tuesday that the talk about President Donald Trump serving a third term is part of a familiar pattern.",
    "link": "https://dailycaller.com/2025/10/28/scott-jennings-theory-trump-third-term/",
    "timestamp": "2025-10-29T01:37:14Z"
  },
  {
    "title": "North Korea test-fires cruise missiles as Trump visits South Korea",
    "description": "Pyongyang says the tests in the Yellow Sea were aimed at impressing its abilities upon its 'enemies'.",
    "link": "https://www.aljazeera.com/news/2025/10/29/north-korea-test-fires-cruise-missiles-as-trump-visits-south-korea",
    "timestamp": "2025-10-29T01:37:07Z"
  },
  {
    "title": "South Korea's trade chief charts path for surviving US-China competition",
    "description": "GYEONGJU, South Korea (Reuters) -South Korea aims to deepen cooperation with the United States, stabilise supply chains with China, and diversify its trading...",
    "link": "https://www.yahoo.com/news/articles/south-koreas-trade-chief-charts-013635140.html",
    "timestamp": "2025-10-29T01:36:35Z"
  },
  {
    "title": "US strikes drug-smuggling boats in Pacific, 14 killed",
    "description": "The U.S. military conducted multiple strikes on four drug-smuggling boats in the eastern Pacific, resulting in 14 deaths and one survivor. These operations, part of President Trump's intensified campaign against narco-trafficking networks, occurred in interna…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-strikes-drug-smuggling-boats-in-pacific-14-killed/articleshow/124886491.cms",
    "timestamp": "2025-10-29T01:35:30Z"
  },
  {
    "title": "U.S. Sought To Lure Nicolás Maduro’s Pilot Into Betraying The Venezuelan Leader",
    "description": "A federal agent had a daring plan: persuade Nicolas Maduro's chief pilot to surreptitiously divert the Venezuelan president’s plane to a place where U.S. authorities could nab the strongman.",
    "link": "https://www.huffpost.com/entry/venezuela-maduro-pilot-us_n_69016c12e4b09e940236b646",
    "timestamp": "2025-10-29T01:34:54Z"
  },
  {
    "title": "Trump departs Japan for South Korea",
    "description": "United States President Donald Trump departed Japan on Tuesday aboard Air Force One, concluding a stop in Tokyo before traveling to South Korea.\nHis next destination is Seoul, where he will attend th...",
    "link": "https://biztoc.com/x/4979abc75ea0c925",
    "timestamp": "2025-10-29T01:33:34Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,343",
    "description": "Here are the key events from day 1,343 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/10/29/russia-ukraine-war-list-of-key-events-day-1343",
    "timestamp": "2025-10-29T01:32:31Z"
  },
  {
    "title": "With Trump, flattery will get Takaichi everything",
    "description": "Whereas Takaichi’s predecessor, Shigeru Ishiba, played for a draw at his White House meeting in February, this encounter was redolent of Abe’s best moments.",
    "link": "https://www.japantimes.co.jp/commentary/2025/10/29/trump-flattery-will-get-takaichi-everywhere/",
    "timestamp": "2025-10-29T01:31:00Z"
  },
  {
    "title": "India’s US oil imports have risen sharply: Sweetener or cost saver?",
    "description": "On the face of it, India’s recent surge in crude oil imports from the US may seem like geopolitics at work, but a closer look suggests we mustn’t over-interpret this data. Here’s another explanation.",
    "link": "https://www.livemint.com/opinion/online-views/india-us-oil-imports-october-2025-russian-india-latest-news-brent-wti-crude-price-arbitrage-donald-trump-kpler-america-11761657692805.html",
    "timestamp": "2025-10-29T01:30:19Z"
  },
  {
    "title": "Australian government reviewing petition that would ban Trump from entering country",
    "description": "The Australian government was reviewing a citizen-led petition asking to bar U.S. President Donald Trump, his family and his administration from entering the country in October 2025.",
    "link": "https://www.snopes.com//fact-check/trump-australia-petition-travel/",
    "timestamp": "2025-10-29T01:30:00Z"
  },
  {
    "title": "Two gay men in Britain welcomed a refugee into their home… He wound up chopping off both of their heads and stuffed their bodies into suitcases…",
    "description": "Two gay men in Britain welcomed a refugee into their home… He wound up chopping off both of their heads and stuffed their bodies into suitcases…",
    "link": "https://freerepublic.com/focus/f-news/4349296/posts",
    "timestamp": "2025-10-29T01:29:00Z"
  },
  {
    "title": "Amnesty says US strike on a Yemen prison that killed dozens of African migrants may be a war crime",
    "description": "Amnesty International says a U.S. airstrike in April that killed 60 detained African migrants should be investigated as a possible war crime",
    "link": "https://abcnews.go.com/International/wireStory/amnesty-us-strike-yemen-prison-killed-dozens-african-126960513",
    "timestamp": "2025-10-29T01:25:46Z"
  },
  {
    "title": "“Get Out There and Ravish!”: Woman “Out of Food Stamps” Shows Off Stolen Goods, Urges Others to Steal at Will and “Infiltrate” Churches for Cash",
    "description": "(WARNING: Graphic language in some videos in this story) (WND News Center)—Four weeks into the federal government shutdown, a woman claiming she’s out of food stamps is bragging online about stealing from a grocery store while urging others to steal at will a…",
    "link": "https://freerepublic.com/focus/f-chat/4349295/posts",
    "timestamp": "2025-10-29T01:23:52Z"
  },
  {
    "title": "Stock Market Highlights 29th October 2025: Sensex ended 368.97 pts or 0.44% positive at 84,997.13, Nifty 50 gained 117.70 pts or 0.45% to close at 26,053.90",
    "description": "Sensex, Nifty, Share Prices highlights: Indian equity benchmarks traded with a positive bias on Wednesday, buoyed by firm global cues and optimism ahead of the US Federal Reserve’s policy decision. At 1:17 p.m., the Sensex climbed 411 points to 85,039, while …",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-29th-oct-2025/article70213908.ece",
    "timestamp": "2025-10-29T01:23:48Z"
  },
  {
    "title": "Trump Makes 'Emergency' Supreme Court Power Grab Amid AI Coup By Billionaire Pals",
    "description": "President Donald Trump's administration filed an \"emergency\" Supreme Court plea to remove the register of copyrights at the Library of Congress, which had refused to support the plans of AI companies owned by his billionaire supporters.\n\n\nIn September, the U.…",
    "link": "https://crooksandliars.com/2025/10/trump-makes-emergency-supreme-court-power",
    "timestamp": "2025-10-29T01:21:49Z"
  },
  {
    "title": "Trump fires board that oversees D.C. construction projects",
    "description": "President Trump fired all six sitting members of a board that oversees architecture in D.C., as he plans a slate of major building projects — including a massive White House ballroom.",
    "link": "https://www.cbsnews.com/news/trump-fires-board-that-oversees-d-c-construction-projects-as-he-plans-major-changes-to-white-house/",
    "timestamp": "2025-10-29T01:17:44Z"
  },
  {
    "title": "Dutch vote in elections in test of European populism's reach",
    "description": "THE HAGUE (Reuters) -The Dutch vote in a national election on Wednesday with a choice between doubling down on the anti-immigration nationalism of populist Geert Wilders, who sank the last conservative coalition after a fractious two years, or a return to the…",
    "link": "https://www.thestar.com.my/news/world/2025/10/29/dutch-vote-in-elections-in-test-of-european-populism039s-reach",
    "timestamp": "2025-10-29T01:17:00Z"
  },
  {
    "title": "Asian stocks open higher as AI, Fed lift sentiment",
    "description": "Asian markets opened higher today. Investors are optimistic about artificial intelligence driving profits for tech giants. Bets on a Federal Reserve interest rate cut are also boosting sentiment. Major tech companies are set to report earnings, with investors…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-open-higher-as-ai-fed-lift-sentiment/articleshow/124886377.cms",
    "timestamp": "2025-10-29T01:16:31Z"
  },
  {
    "title": "The End Is Near! MSNBC Announces When It Will Go Dark, Turn into MSNOW",
    "description": "Cue the Sinatra music!On Monday, MSNBC’s parent company Versant — the name of the company consisting of seven cable news channels Comcast no longer wanted to be tied down to — decreed the much-lampooned name-change for the far-left hot take factory to MS NOW …",
    "link": "https://freerepublic.com/focus/f-chat/4349290/posts",
    "timestamp": "2025-10-29T01:11:56Z"
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "description": "North Korea announced successful sea-to-surface cruise missile tests. These firings occurred as U.S. President Donald Trump visited South Korea. The missiles flew for over two hours, hitting targets accurately. This demonstration highlights North Korea's expa…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-touts-missile-tests-as-trump-visits-south-korea/articleshow/124886352.cms",
    "timestamp": "2025-10-29T01:11:54Z"
  },
  {
    "title": "Can Trump charm President Xi?",
    "description": "Donald Trump is a creative fellow with a pronounced tendency to personalise his inventions — see his eponymous tower. Yet as he tours East Asia this week, it is worth recalling that he did not invent the hyper-personalised approach to diplomacy that overrides…",
    "link": "https://biztoc.com/x/13e092db56ec77e3",
    "timestamp": "2025-10-29T01:11:41Z"
  },
  {
    "title": "Trump Admin. Ends Biden-Era Abortion Rule Likely Linked to Child Sex Trafficking",
    "description": "President Donald Trump and his administration are undoing a Biden-era immigration provision that would have facilitated abortions for children. The Daily Signal reported that the U.S. Department of Health and Human Services (HHS) is terminating rules and prog…",
    "link": "https://freerepublic.com/focus/f-chat/4349289/posts",
    "timestamp": "2025-10-29T01:11:07Z"
  }
]