[
  {
    "title": "Times Square to feature patriotic ball drop for New Year’s Eve, kicking off US’s 250th birthday",
    "description": "This patriotic touch previews the hundreds of events planned nationwide.",
    "link": "https://www.bostonherald.com/2025/12/26/times-square-patriotic-ball-drop/",
    "timestamp": "2025-12-26T13:35:59Z"
  },
  {
    "title": "Times Square to feature patriotic ball drop for New Year’s Eve, kicking off US’s 250th birthday",
    "description": "This patriotic touch previews the hundreds of events planned nationwide.",
    "link": "https://www.denverpost.com/2025/12/26/times-square-patriotic-ball-drop/",
    "timestamp": "2025-12-26T13:35:59Z"
  },
  {
    "title": "Trump orders strikes on Nigeria: Is the African country witnessing the persecution of Christians?",
    "description": "Nigeria is officially a secular country. Its population comprises Muslims (53%), Christians (45%), and a small section that practices traditional African religions.",
    "link": "https://indianexpress.com/article/explained/explained-global/trump-strikes-nigeria-10440419/",
    "timestamp": "2025-12-26T13:33:45Z"
  },
  {
    "title": "Copper Hits Record in China, Jumps in New York on Supply Concern",
    "description": "In China, prices gained as much as 4.7% to trade near 100,000 yuan ($14,270) a ton on the Shanghai Futures Exchange for the first time.  Futures traded on...",
    "link": "https://finance.yahoo.com/news/copper-hits-record-china-jumps-072825736.html",
    "timestamp": "2025-12-26T13:32:20Z"
  },
  {
    "title": "Nigeria courts controversy by cooperating with U.S. on anti-ISIS airstrikes",
    "description": "By publicly cooperating with the United States on Christmas Day airstrikes, Nigeria’s government may have averted humiliating unilateral military action threatened a month ago by President Donald Trump.",
    "link": "https://www.nbcnews.com/world/africa/nigeria-averts-unilateral-us-action-cooperating-airstrikes-rcna251001",
    "timestamp": "2025-12-26T13:30:40Z"
  },
  {
    "title": "US Strikes Islamic State Militants in Nigeria",
    "description": "REUTERS—The United States carried out a strike against Islamic State militants in northwest Nigeria at the request of Nigeria’s government, President Donald Trump and the... Read More\nThe post US Strikes Islamic State Militants in Nigeria appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/12/26/us-strikes-islamic-state-militants-in-nigeria/",
    "timestamp": "2025-12-26T13:30:31Z"
  },
  {
    "title": "Russia 'downs seven Storm Shadow missiles' - as Zelenskyy set for Trump meeting on Sunday",
    "description": "Russia said it has downed seven British-supplied Storm Shadow missiles over the past week, as Volodymyr Zelenskyy said he plans to hold a meeting with Donald Trump on Sunday.",
    "link": "https://news.sky.com/story/russia-downs-seven-storm-shadow-missiles-as-zelenskyy-set-for-trump-meeting-on-sunday-13487427",
    "timestamp": "2025-12-26T13:25:00Z"
  },
  {
    "title": "Zelenskyy 'doesn't have anything until I've approved it', says Trump - as peace talks loom",
    "description": "Donald Trump said President Zelenskyy \"doesn't have anything until I approve it\", ahead of a meeting with the Ukrainian leader on Sunday.",
    "link": "https://news.sky.com/story/zelenskyy-doesnt-have-anything-until-ive-approved-it-says-donald-trump-as-peace-talks-loom-13487427",
    "timestamp": "2025-12-26T13:25:00Z"
  },
  {
    "title": "Indonesia's Danantara in talks on US access to critical minerals",
    "description": "Indonesia&#39;s sovereign wealth fund Danantara has started talks on US access to the country&#39;s critical minerals, Coordinating Minister for Economic ...",
    "link": "https://en.antaranews.com/news/397807/indonesias-danantara-in-talks-on-us-access-to-critical-minerals",
    "timestamp": "2025-12-26T13:23:53Z"
  },
  {
    "title": "Trump overturned decades of US trade policy in 2025. See the impact of his tariffs, in four charts",
    "description": "By WYATTE GRANTHAM-PHILIPS and PAUL WISEMAN Since returning to the White House in January, President Donald Trump has overturned decades of U.S. trade policy — building a wall of tariffs arou…",
    "link": "https://www.orlandosentinel.com/2025/12/26/trump-overturned-decades-of-us-trade-policy-in-2025-see-the-impact-of-his-tariffs-in-four-charts/",
    "timestamp": "2025-12-26T13:19:09Z"
  },
  {
    "title": "Even Trump-Aligned Economists Warn President Is About to Upend U.S. Health Care - NewsBreak",
    "description": "President Donald Trump has spent months promising a straightforward solution for one of America’s biggest frustrations: prescription drug prices. Last week",
    "link": "https://www.newsbreak.com/share/4413413595231-even-trump-aligned-economists-warn-president-is-about-to-upend-u-s-health-care?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3NjY3NTQ5OTc3ODA%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1766754997&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.51.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-26T13:17:04Z"
  },
  {
    "title": "US bombs target ISIL in Nigeria: What’s really going on?",
    "description": "Trump says strikes are related to 'Christian genocide' but attacks on Christian farmers happened in different area.",
    "link": "https://www.aljazeera.com/news/2025/12/26/us-bombs-target-isil-in-nigeria-whats-really-going-on",
    "timestamp": "2025-12-26T13:16:37Z"
  },
  {
    "title": "Zelenskiy Says He’ll Meet Trump Soon Signaling Progress on Peace - Bloomberg.com",
    "description": "Zelenskiy Says He’ll Meet Trump Soon Signaling Progress on PeaceBloomberg.com Trump and Zelensky to meet Sunday to try and close out peace planAxios Zelenskiy Expects Meeting With Trump on Sunday in FloridaBloomberg.com Ukraine updates: Zelenskyy says he plan…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180459213",
    "timestamp": "2025-12-26T13:12:40Z"
  },
  {
    "title": "Zelensky says he plans to meet Trump in Florida for peace talks Sunday | CNN",
    "description": "Ukrainian President Volodymyr Zelensky said that he plans to meet his US counterpart Donald Trump in Florida Sunday, as part of efforts to reach a peace deal to end Russia’s nearly four-year war in Ukraine.",
    "link": "https://www.cnn.com/2025/12/26/europe/zelensky-trump-talks-ukraine-russia-intl",
    "timestamp": "2025-12-26T13:11:30Z"
  },
  {
    "title": "China sanctions 30 US firms, individuals over Taiwan weapons sales",
    "description": "Beijing urged the US to cease 'dangerous' efforts to arm the island, which it claims as its own.",
    "link": "https://www.aljazeera.com/news/2025/12/26/china-sanctions-30-us-firms-individuals-over-taiwan-weapons-sales",
    "timestamp": "2025-12-26T13:09:04Z"
  },
  {
    "title": "'Shook the whole town': Nigerians surprised by US strikes",
    "description": "Nigerians across Sokoto state awoke to loud blasts Thursday night, worried their village was being attacked by one of the multiple armed groups that plague northwest Nigeria. \"We initially thought it was an attack by Lakurawa,\" the main jihadist group in Soko…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/shook-the-whole-town-nigerians-surprised-by-us-strikes/articleshow/126190922.cms",
    "timestamp": "2025-12-26T13:08:15Z"
  },
  {
    "title": "US strikes Islamic State in Nigeria",
    "description": "President Donald Trump announced that US forces struck Islamic State targets in northwestern Nigeria on December 25 after the Nigerian government reportedly requested military action from the United States. The strikes took place in Sokoto State, which border…",
    "link": "https://www.longwarjournal.org/archives/2025/12/us-strikes-islamic-state-in-nigeria.php",
    "timestamp": "2025-12-26T13:01:50Z"
  },
  {
    "title": "JonBenet Ramsey case could benefit from new DNA technology as police renew commitment",
    "description": "Boulder police renew efforts in JonBenet Ramsey murder case with new chief praising advanced DNA testing, nearly 30 years after the Christmas tragedy that shocked America.",
    "link": "https://www.foxnews.com/us/jonbenet-ramsey-case-could-benefit-from-new-dna-technology-police-renew-commitment",
    "timestamp": "2025-12-26T13:00:56Z"
  },
  {
    "title": "Latin America’s Year in Review",
    "description": "In 2025, the region went up against tariffs, deportations, and a major U.S. military buildup.",
    "link": "http://foreignpolicy.com/2025/12/26/latin-america-trump-us-tariffs-deportations-venezuela-brazil-argentina-mexico/",
    "timestamp": "2025-12-26T13:00:35Z"
  },
  {
    "title": "Trump launched global tariff wars in 2025. Here's a recap of his trade actions this year",
    "description": "It’s been a rollercoaster of a year for U.S. trade policy. President Donald Trump launched a barrage of new tariffs in 2025, plunging the U.S. into trade wars with nearly every country in the world. Volley after volley of threats and steeper import taxes ofte…",
    "link": "https://apnews.com/article/trump-tariffs-timeline-economy-2b10860dfdb2a5d9c3c4527136314992",
    "timestamp": "2025-12-26T13:00:33Z"
  },
  {
    "title": "Trump's 'Liberation Day' Tariffs Worked — They Liberated Americans From Their Jobs",
    "description": "Trump’s economy since he imposed tariffs has created one-tenth of the jobs per month as Biden’s economy, while manufacturing has lost jobs each month.",
    "link": "https://www.huffpost.com/entry/trump-weak-jobs-numbers_n_69496c1ce4b0c3ddb223098a",
    "timestamp": "2025-12-26T13:00:17Z"
  },
  {
    "title": "GameAbove Pizza City Motor Sports Bowl Preview",
    "description": "Chippewas! Wildcats! A PREVIEW! Today, in the bowels of the Rust Belt, two mediocre football teams play a postseason game that means something, damnit, and that I earnestly care about, because I am an idiot online. Let’s talk about… The GameAbove Sports Bowl …",
    "link": "https://www.offtackleempire.com/northwestern/49235/watch-northwestern-central-michigan-football-preview-live-discussion-gameabove-sports-bowl-time-tv-streaming-odds-line-picks",
    "timestamp": "2025-12-26T13:00:00Z"
  },
  {
    "title": "Trump’s Health Care Cost Transparency Action is a Dose of Good News",
    "description": "Americans grappling with affordability just got a helpful boost from the Trump administration, which on Friday announced a new push to reduce health care costs. ... Read More\nThe post Trump’s Health Care Cost Transparency Action is a Dose of Good News appeare…",
    "link": "https://www.dailysignal.com/2025/12/26/trumps-health-care-cost-transparency-action-is-a-dose-of-good-news/",
    "timestamp": "2025-12-26T13:00:00Z"
  },
  {
    "title": "Tariff-ravaged farmers exhausted with Trump using them as 'pawns': report",
    "description": "Donald Trump faces growing fury among farmers who, despite a promised bailout, fear they may face bankruptcy regardless of additional administration assistance.In interviews with the Washington Post, farmers express quiet frustration over tariffs that have de…",
    "link": "https://www.rawstory.com/trump-farmers-bailout-pawns/",
    "timestamp": "2025-12-26T12:55:24Z"
  },
  {
    "title": "Zelensky Says He Will Meet With Trump ‘in the Near Future’ After Talks With Steve Witkoff, Jared Kushner",
    "description": "Ukrainian President Volodymyr Zelensky said he has agreed to a meeting with President Trump after what was described as a \"good conversation\" on Christmas Day with U.S. Special Envoy Steve Witkoff and Trump's son-in-law Jared Kushner.\nThe post Zelensky Says H…",
    "link": "https://www.mediaite.com/media/news/zelensky-says-he-will-meet-with-trump-in-the-near-future-after-talks-with-steve-witkoff-jared-kushner/",
    "timestamp": "2025-12-26T12:51:39Z"
  },
  {
    "title": "Zelensky To Meet Trump As US-Backed Peace Push Gains Momentum",
    "description": "Zelensky described recent discussions with Trump's special envoys, Steve Witkoff and Jared Kushner, as \"very good\" and suggested that the upcoming summit could help secure significant progress before the New Year.",
    "link": "https://www.ibtimes.com/zelensky-meet-trump-us-backed-peace-push-gains-momentum-3793768",
    "timestamp": "2025-12-26T12:51:26Z"
  },
  {
    "title": "Jimmy Kimmel says tyranny rising under Trump, taunts president over show's return",
    "description": "Jimmy Kimmel delivered the \"Alternative Christmas Message\" in the U.K., telling viewers that tyranny was booming in the U.S. and taunting President Trump over his show being back on air.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-says-tyranny-rising-under-trump-taunts-president-over-shows-return",
    "timestamp": "2025-12-26T12:49:40Z"
  },
  {
    "title": "PS Commentators’ Predictions for 2026",
    "description": "Donald Trump’s second presidency has reset global expectations, making uncertainty the defining feature of today’s geopolitical and economic landscape. While the path forward remains unclear, the year ahead will likely be marked by greater geopolitical and fi…",
    "link": "https://www.project-syndicate.org/onpoint/ps-commentators-predictions-for-2026-by-ps-editors-2025-12",
    "timestamp": "2025-12-26T12:45:44Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to Friday, December 26, 2025, known in the British Commonwealth as Boxing Day, a name whose origin is unclear.  But for cats, it is clear, as this picture shows: It’s also the Second Day of Koynezaa, which extends until December 30.  This picture was …",
    "link": "https://whyevolutionistrue.com/2025/12/26/friday-hili-dialogue-556/",
    "timestamp": "2025-12-26T12:45:20Z"
  },
  {
    "title": "Andrew Windsor asked Ghislaine Maxwell to find him ‘some new inappropriate friends’",
    "description": "Just before Christmas, the Department of Justice did a major document dump with the Epstein Files. DOJ hoped that by releasing certain documents before Christmas, people wouldn’t pay that much attention to the disclosures about Donald Trump. They were sort of…",
    "link": "https://www.celebitchy.com/955006/andrew_windsor_asked_ghislaine_maxwell_to_find_him_some_new_inappropriate_friends/",
    "timestamp": "2025-12-26T12:45:08Z"
  },
  {
    "title": "Trump's Christmas comment about Epstein leads to brutal six-word reply by survivor",
    "description": "Donald Trump's Christmas day comments about Jeffrey Epstein aren't sitting well with a survivor of the deceased child sex abuser.Trump on the holy day for Christians wrote, \"Merry Christmas to all, including the many Sleazebags who loved Jeffrey Epstein, gave…",
    "link": "https://www.rawstory.com/trump-epstein-2674829902/",
    "timestamp": "2025-12-26T12:45:06Z"
  },
  {
    "title": "US launches strikes against Islamic State group in Nigeria after attacks target Christians",
    "description": "Trump said the airstrikes were launched against Islamic State militants “who have been targeting and viciously killing, primarily, innocent Christians.”",
    "link": "https://www.denverpost.com/2025/12/26/usa-strikes-islamic-state-nigeria/",
    "timestamp": "2025-12-26T12:42:01Z"
  },
  {
    "title": "Trump says US struck Islamic State targets in Nigeria after group targeted Christians",
    "description": "Trump said the airstrikes were launched against Islamic State militants “who have been targeting and viciously killing, primarily, innocent Christians.”",
    "link": "https://www.bostonherald.com/2025/12/26/usa-strikes-islamic-state-nigeria/",
    "timestamp": "2025-12-26T12:42:01Z"
  },
  {
    "title": "Trump Is Getting Weaker, and the Resistance Is Getting Stronger (Michelle Goldberg/New York Times)",
    "description": "Michelle Goldberg / New York Times:\nTrump Is Getting Weaker, and the Resistance Is Getting Stronger  —  It has been a gruesome year for those who see Donald Trump's kakistocracy clearly.  He returned to office newly emboldened, surrounded by obsequious tech b…",
    "link": "https://www.memeorandum.com/251226/p3",
    "timestamp": "2025-12-26T12:40:00Z"
  },
  {
    "title": "Our Nation Is Reversing Course",
    "description": "President Donald Trump early in his second term renamed the Department of Defense the Department of War. This was the original name given to our federal military in 1789 and it had been in effect until it was eliminated by legislation in 1947 and actively bec…",
    "link": "https://freerepublic.com/focus/f-chat/4359039/posts",
    "timestamp": "2025-12-26T12:39:02Z"
  },
  {
    "title": "Binge-drinking ferrets and dogs on cocaine in $1.6trn US ‘government waste’ list",
    "description": "The US spent $1.6 trillion on wasteful programs in 2025, including teaching ferrets to binge-drink alcohol, according to Senator Rand Paul Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630046-us-government-waste-2025/",
    "timestamp": "2025-12-26T12:38:45Z"
  },
  {
    "title": "Nigeria says it shared intelligence to support US strikes on ISIS",
    "description": "Nigeria confirmed it shared intelligence with the U.S. ahead of Christmas night airstrikes against ISIS targets accused of killing Christians.",
    "link": "https://www.foxnews.com/world/nigeria-says-shared-intelligence-support-us-strikes-isis",
    "timestamp": "2025-12-26T12:34:23Z"
  },
  {
    "title": "Zelenskyy says meeting with Trump to happen ‘in the near future’",
    "description": "Zelenskyy mentioned Friday on X that a lot can be decided before the New Year.",
    "link": "https://www.bostonherald.com/2025/12/26/zelenskyy-hints-trump-peace-talks/",
    "timestamp": "2025-12-26T12:34:07Z"
  },
  {
    "title": "Zelenskyy says he will meet with Trump in Florida on Sunday for talks on Ukraine security guarantees",
    "description": "Zelenskyy said he will meet with Trump Sunday to discuss security guarantees for Ukraine.",
    "link": "https://www.denverpost.com/2025/12/26/zelenskyy-hints-trump-peace-talks/",
    "timestamp": "2025-12-26T12:34:07Z"
  },
  {
    "title": "How Africa is asserting itself globally — despite Trump",
    "description": "2025 was a year heavily dominated by US President Donald Trump's disruptive policies. While some of his actions caused harm, African governments also managed to improve their geo-political position. January 20 was a turning point for the entire world: The day…",
    "link": "https://www.dw.com/en/how-africa-is-asserting-itself-globally-despite-trump/a-75116234",
    "timestamp": "2025-12-26T12:32:00Z"
  },
  {
    "title": "Trump Claims 'High Aptitude' Son Barron Has Outgrown 'Child-Dom' At NYU",
    "description": "Barron Trump moves into the White House after transferring to NYU's D.C. campus. Discover the truth behind his $150m crypto empire and his new 'DeFi' visionary role.",
    "link": "https://www.ibtimes.com/trump-claims-high-aptitude-son-barron-has-outgrown-child-dom-nyu-3793763",
    "timestamp": "2025-12-26T12:31:49Z"
  },
  {
    "title": "Today News Headlines for School Assembly, Dec 26, 2025: MEA condemns B’desh lynching, Trump to meet Zelenskyy on Dec 28",
    "description": "Today News Headlines for School Assembly, December 25, 2025: Get important National, International, Sports, Business, and GK current affairs updates curated for students, teachers, and morning assemblies.",
    "link": "https://indianexpress.com/article/education/today-news-headlines-for-school-assembly-26-december-2025-india-foreign-ministry-condemns-bangladesh-lynching-trump-zelenskyy-meet-10440304/",
    "timestamp": "2025-12-26T12:30:52Z"
  },
  {
    "title": "Zelenskyy Says Meeting With Trump To Happen 'In The Near Future'",
    "description": "“A lot can be decided before the New Year,” Zelenskyy said.",
    "link": "https://www.huffpost.com/entry/zelenskyy-meeting-trump-near-future_n_694e7d74e4b0b9ab57f1d143",
    "timestamp": "2025-12-26T12:30:52Z"
  },
  {
    "title": "What Mess Will Trump Have Made of the USA by 2029?",
    "description": "For writers, the future has long been a tricky terrain. While the past can prove unsettling and the present uncomfortable, the future seems to free the mind from reality’s restraints and let the imagination soar. Yet it has also proven full of political pitfa…",
    "link": "https://tomdispatch.com/ending-the-american-dream-by-2029/",
    "timestamp": "2025-12-26T12:29:02Z"
  },
  {
    "title": "US Strikes ISIS in Nigeria; Trump Speaks Out on Epstein Files",
    "description": "President Donald Trump announced “numerous perfect strikes” against ISIS in northwest Nigeria, with the military operation killing “multiple ISIS terrorists.” The surprise strikes come after Trump claimed Christians were being targeted and killed by Islamist …",
    "link": "https://www.today.com/video/us-strikes-isis-in-nigeria-trump-speaks-out-on-epstein-files-255026757954",
    "timestamp": "2025-12-26T12:28:23Z"
  },
  {
    "title": "Lizzo Says She's \"Not Surprised\" By Nicki Minaj And More Celebs Supporting Donald Trump",
    "description": "Lizzo shared her thoughts on Nicki Minaj’s support of Donald Trump, warning that more celebrities may politically shift for financial gain. Read more on Rap-Up.",
    "link": "https://www.rap-up.com/article/lizzo-nicki-minaj-donald-trump-support",
    "timestamp": "2025-12-26T12:16:48Z"
  },
  {
    "title": "DOGE hits, insurance premiums and school vouchers underscore 2025 in health and education - WyoFile",
    "description": "Reporter Katie Klingsporn also spent much of the year following rural health care challenges, library battles and a notorious shortcut.",
    "link": "http://wyofile.com/doge-hits-insurance-premiums-and-school-vouchers-underscore-2025-in-health-and-education/",
    "timestamp": "2025-12-26T12:13:59Z"
  },
  {
    "title": "Lizzo Warns Fans as Nicki Minaj MAGA Drama Explodes",
    "description": "Lizzo is sounding the alarm over celebrity politics after Nicki Minaj sat down with MAGA-aligned conservative activist Erika Kirk. “I’m getting texts about Nicki, and I’m like, what are you talking about?” Lizzo said. “I didn’t even know. Then I researched an…",
    "link": "https://mediatakeout.com/lizzo-warns-fans-as-nicki-minaj-maga-drama-explodes/",
    "timestamp": "2025-12-26T12:09:00Z"
  },
  {
    "title": "Trump could unveil Gaza ‘peace council’, ‘government’ soon: Israeli media",
    "description": "US wants to move to phase 2 of ceasefire in January, is frustrated by Israeli 'delays', reports Israel's Channel 12.",
    "link": "https://www.aljazeera.com/news/2025/12/26/trump-could-unveil-gaza-peace-council-government-soon-israeli-media",
    "timestamp": "2025-12-26T12:04:52Z"
  },
  {
    "title": "Zelensky announces meeting with Trump",
    "description": "An Axios reporter has claimed the two leaders are set to talk at Mar-a-Lago on Sunday, citing officials in Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630047-zelensky-announces-meeting-with-trump/",
    "timestamp": "2025-12-26T12:03:54Z"
  },
  {
    "title": "2026 deadlines loom as Congress leaves DC with several unfinished battles",
    "description": "Congress faces critical January deadlines as lawmakers return, with government funding for 2026 unresolved and only eight joint session days remaining.",
    "link": "https://www.foxnews.com/politics/congress-stares-down-several-big-deadlines-new-year",
    "timestamp": "2025-12-26T12:00:44Z"
  },
  {
    "title": "5 Times Tooze in 2025",
    "description": "Notable episodes of FP’s economics podcast from the past year.",
    "link": "http://foreignpolicy.com/2025/12/26/tooze-top-podcast-episodes-economics-china-mamdani-abundance-2025/",
    "timestamp": "2025-12-26T12:00:19Z"
  },
  {
    "title": "The Trump Administration’s Uses, and Abuses, of History",
    "description": "For better and worse, 2025 was a historical year.",
    "link": "http://foreignpolicy.com/2025/12/26/donald-trump-presidency-history-us-geopolitics-new-era/",
    "timestamp": "2025-12-26T12:00:01Z"
  },
  {
    "title": "Epstein owned painting of Bill Clinton in a blue dress. Here's context",
    "description": "At Congress' behest, the U.S. Department of Justice released hundreds of files related to Epstein, a convicted sex offender, on Dec. 19, 2025.",
    "link": "https://www.snopes.com/news/2025/12/24/epstein-bill-clinton-blue-dress/",
    "timestamp": "2025-12-26T12:00:00Z"
  },
  {
    "title": "Epstein owned painting of Bill Clinton in a blue dress. Here's context",
    "description": "At Congress' behest, the U.S. Department of Justice released hundreds of files related to Epstein, a convicted sex offender, on Dec. 19, 2025.",
    "link": "https://www.snopes.com//news/2025/12/24/epstein-bill-clinton-blue-dress/",
    "timestamp": "2025-12-26T12:00:00Z"
  },
  {
    "title": "U.S. strikes ISIS targets in Nigeria and a vaccine additive is scrutinized: Morning Rundown",
    "description": "The U.S. strikes ISIS targets in Nigeria. Aluminum salts may be RFK Jr.'s 2026 vaccine focus. A new generation of Pelosis and Kennedys are running for office.",
    "link": "https://www.nbcnews.com/news/us-news/us-strikes-isis-nigeria-aluminum-salts-vaccines-morning-rundown-rcna250913",
    "timestamp": "2025-12-26T11:58:48Z"
  },
  {
    "title": "Panic as explosions hit Kwara community after US strikes",
    "description": "Explosions rock Offa, Kwara State, causing panic and property damage. The incident occurred hours after US airstrikes in northwest Nigeria.\n\nRead More: https://punchng.com/panic-as-explosions-hit-kwara-community-after-us-strikes/",
    "link": "https://punchng.com/panic-as-explosions-hit-kwara-community-after-us-strikes/",
    "timestamp": "2025-12-26T11:52:00Z"
  },
  {
    "title": "'Weak' Trump ending the year with his 'mystique' evaporating as his defenders flee: column",
    "description": "Donald Trump's first year in his second term is concluding with mounting setbacks that have prompted some former supporters to distance themselves from the president, no longer viewing him as politically invincible.In a post-Christmas column, New York Times c…",
    "link": "https://www.rawstory.com/trump-mystique/",
    "timestamp": "2025-12-26T11:50:48Z"
  },
  {
    "title": "Trump launched global tariff wars in 2025. Here's a recap of his trade actions this year",
    "description": "President Trump's trade policy saw a turbulent year. New tariffs were imposed on many countries, sparking global trade wars. Businesses faced uncertainty due to fluctuating duties and retaliatory measures. Steel and aluminum tariffs were raised significantly.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-launched-global-tariff-wars-in-2025-heres-a-recap-of-his-trade-actions-this-year/articleshow/126189724.cms",
    "timestamp": "2025-12-26T11:44:38Z"
  },
  {
    "title": "Children's Hospital Colorado fighting gender-affirming care subpoena",
    "description": "Children's Hospital Colorado is fighting in court to quash a U.S. Department of Justice subpoena about gender-affirming care.",
    "link": "http://coloradosun.com/2025/12/26/childrens-hospital-colorado-gender-affirming-care-subpoena/",
    "timestamp": "2025-12-26T11:43:52Z"
  },
  {
    "title": "Jimmy Kimmel's Christmas message to the UK: 'Tyranny is booming' in the US",
    "description": "The talk show host appeared on British TV station Channel 4 to deliver its annual \"alternative Christmas message.\"",
    "link": "https://www.businessinsider.com/jimmy-kimmel-message-uk-dont-give-up-on-us-trump-2025-12",
    "timestamp": "2025-12-26T11:43:49Z"
  },
  {
    "title": "From OpenAI to Nvidia, firms channel billions into AI infrastructure as demand booms",
    "description": "Nvidia has agreed to license technology from AI startup Groq for use in some of its artificial intelligence chips, marking the chipmaker's largest deal and ‍underscoring its push to strengthen competitiveness amid surging demand.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/from-openai-to-nvidia-firms-channel-billions-into-ai-infrastructure-as-demand-booms/articleshow/126189709.cms",
    "timestamp": "2025-12-26T11:43:38Z"
  },
  {
    "title": "Jimmy Kimmel Attacks Trump, Warns of ‘Tyranny Booming’ in Christmas Address on UK TV: ‘We Won, the President Lost’",
    "description": "A comfortably smug Jimmy Kimmel sent a personal message to UK television viewers saying \"tyranny is booming over here” when he delivered a fireside chat across the pond on Christmas Day.",
    "link": "https://www.breitbart.com/entertainment/2025/12/26/jimmy-kimmel-attacks-trump-warns-of-tyranny-booming-in-christmas-address-on-uk-tv-we-won-the-president-lost/",
    "timestamp": "2025-12-26T11:42:09Z"
  },
  {
    "title": "US Launches Christmas Strikes on Nigeria—the 9th Country Bombed by Trump",
    "description": "With Nigeria, Trump—who calls himself “the most anti-war president in history”—has now bombed more countries than any president in history.",
    "link": "https://www.nakedcapitalism.com/2025/12/us-launches-christmas-strikes-on-nigeria-the-9th-country-bombed-by-trump.html",
    "timestamp": "2025-12-26T11:42:06Z"
  },
  {
    "title": "Trump overturned decades of US trade policy in 2025. See the impact of his tariffs, in four charts",
    "description": "Since returning to the White House in January, President Donald Trump has overturned decades of U.S. trade policy — building a wall of tariffs around what used to be a wide open economy. His double-digit taxes on imports from almost every country have disrupt…",
    "link": "https://financialpost.com/pmn/trump-overturned-decades-of-us-trade-policy-in-2025-see-the-impact-of-his-tariffs-in-four-charts",
    "timestamp": "2025-12-26T11:39:39Z"
  },
  {
    "title": "How Trump's import taxes are impacting global commerce",
    "description": "Since returning to the White House in January, President Donald Trump has overturned decades of U.S. trade policy — building a wall of tariffs around what used to be a wide open economy. His double-digit taxes on imports from almost every country on earth hav…",
    "link": "https://apnews.com/article/trump-tariffs-economy-liberation-day-d3458da225c1fdfade97ed494b23e868",
    "timestamp": "2025-12-26T11:35:16Z"
  },
  {
    "title": "Weber calls for EU military force to secure peace in Ukraine",
    "description": "Europe must take charge of Ukraine’s security instead of leaving it to Donald Trump and US forces, he said",
    "link": "https://www.euractiv.com/news/weber-calls-for-eu-military-force-to-secure-peace-in-ukraine/",
    "timestamp": "2025-12-26T11:35:06Z"
  },
  {
    "title": "US Strikes ISIS Targets In Nigeria As Attacks Continue Across Regions",
    "description": "US Africa Command (AFRICOM) said the strikes were conducted on Dec. 25 in Sokoto state, close to Nigeria's border with Niger, targeting what it described as Islamic State camps.",
    "link": "https://www.ibtimes.com/us-strikes-isis-targets-nigeria-attacks-continue-across-regions-3793751",
    "timestamp": "2025-12-26T11:34:55Z"
  },
  {
    "title": "The judiciary’s Christmas gift to Trump",
    "description": "With two adverse rulings, this year the courts gave Trump a stocking of humility",
    "link": "https://www.salon.com/2025/12/26/the-judiciarys-christmas-gift-to-trump/",
    "timestamp": "2025-12-26T11:30:22Z"
  },
  {
    "title": "US Trade Dominance Will Soon Begin to Crack",
    "description": "Savvy countries will discover there’s a way to mitigate the harm incurred by Trump’s tariffs—and it’ll boost their own economies while making goods cheaper too.",
    "link": "https://www.wired.com/story/us-trade-dominance-will-begin-to-crack/",
    "timestamp": "2025-12-26T11:30:00Z"
  },
  {
    "title": "Trump launched global tariff wars in 2025. Here’s a recap of his trade actions this year",
    "description": "It’s been a rollercoaster of a year for U.S. trade policy. President Donald Trump launched a barrage of new tariffs in 2025, plunging the U.S. into trade wars with nearly every country in the world. Volley after volley of threats and steeper import taxes ofte…",
    "link": "https://financialpost.com/pmn/trump-launched-global-tariff-wars-in-2025-heres-a-recap-of-his-trade-actions-this-year",
    "timestamp": "2025-12-26T11:25:53Z"
  },
  {
    "title": "Trump's 'Beautiful and Cute' Remark to Eight-Year-Old on Christmas Call Sparks Explosive Backlash",
    "description": "President Trump's remark calling an eight-year-old girl 'beautiful and cute' on a festive NORAD Santa tracker call has ignited widespread commentary and controversy across social media and political discourse.",
    "link": "https://www.ibtimes.com/trumps-beautiful-cute-remark-eight-year-old-christmas-call-sparks-explosive-backlash-3793730",
    "timestamp": "2025-12-26T11:23:37Z"
  },
  {
    "title": "Trump launched global tariff wars in 2025. Here's a recap of his trade actions this year",
    "description": "It's been a rollercoaster of a year for U.S. trade policy.  President Donald Trump launched a barrage of new tariffs in 2025, plunging the U.S. into trade...",
    "link": "https://finance.yahoo.com/news/trump-launched-global-tariff-wars-112255136.html",
    "timestamp": "2025-12-26T11:22:55Z"
  },
  {
    "title": "Melania Trump Fires Back At Claim She Married Donald 'Because He's Rich'",
    "description": "A resurfaced 1999 interview reveals Melania Trump's sharp response to claims she married Donald for money, sparking fresh debate on their 20-year relationship.",
    "link": "https://www.ibtimes.com/melania-trump-fires-back-claim-she-married-donald-because-hes-rich-3793736",
    "timestamp": "2025-12-26T11:22:48Z"
  },
  {
    "title": "DOJ Says Epstein Files Surge Past One Million — Full Disclosure Still Weeks Away",
    "description": "The US Department of Justice has uncovered over one million additional Epstein-related documents, delaying mandated public release as lawmakers and victims demand transparency, amid controversy over redactions and missing files.",
    "link": "https://www.ibtimes.com/doj-says-epstein-files-surge-past-one-million-full-disclosure-still-weeks-away-3793738",
    "timestamp": "2025-12-26T11:22:35Z"
  },
  {
    "title": "Mass Shootings Expose Divide as Australia Moves to Act While US Offers 'Thoughts and Prayers'",
    "description": "After parallel mass shootings at Bondi Beach and Brown University, Australia accelerates gun-law reform while the United States issues condolences and limited policy responses, exposing deep contrasts in gun-violence politics.",
    "link": "https://www.ibtimes.com/mass-shootings-expose-divide-australia-moves-act-while-us-offers-thoughts-prayers-3793741",
    "timestamp": "2025-12-26T11:22:19Z"
  },
  {
    "title": "GOP Rep. Massie Says DOJ Broke The Law By Making 'Illegal Redaction' Of Epstein Files",
    "description": "Republican Rep. Thomas Massie said the Department of Justice broke the law by making \"illegal redactions\" of the Epstein files and \"missing the deadline\" for their complete release.",
    "link": "https://www.ibtimes.com/gop-rep-massie-says-doj-broke-law-making-illegal-redaction-epstein-files-3793743",
    "timestamp": "2025-12-26T11:21:55Z"
  },
  {
    "title": "Michelle Obama Reveals Why She Once Told Kids She's 'Done' Parenting—How A Bedtime Battle With Sasha Backfired",
    "description": "Michelle Obama admits she once told her 'rambunctious' daughters she was 'done parenting' in a candid new revelation about life inside her home. The former First Lady also pays an emotional tribute to her late friends Rob and Michele Reiner following their tr…",
    "link": "https://www.ibtimes.com/michelle-obama-reveals-why-she-once-told-kids-shes-done-parentinghow-bedtime-battle-sasha-3793746",
    "timestamp": "2025-12-26T11:21:21Z"
  },
  {
    "title": "J.D. Vance's 'Don't Apologise For Being White' Speech Sparks Viral Tim Walz Fury",
    "description": "Minnesota Governor Tim Walz has accused Vice President J.D. Vance of 'no longer hiding' white supremacy following a controversial speech celebrating the end of DEI regulations. The heated exchange comes as Vance receives a major endorsement for a potential 20…",
    "link": "https://www.ibtimes.com/jd-vances-dont-apologise-being-white-speech-sparks-viral-tim-walz-fury-3793747",
    "timestamp": "2025-12-26T11:21:05Z"
  },
  {
    "title": "The crypto events that reshaped the industry in 2025",
    "description": "From hacks and macro shocks to stablecoin regulation and market-structure upgrades, 2025 reshaped how crypto operates and what mainstream adoption really means.",
    "link": "https://cointelegraph.com/explained/the-crypto-events-that-reshaped-the-industry-in-2025",
    "timestamp": "2025-12-26T11:15:00Z"
  },
  {
    "title": "Here's Why Your Boots, Bags, and Furniture Are About to Get 22% More Expensive Next Year",
    "description": "Leather goods prices are set to surge 22% over the next two years as tariffs, cattle shortages, and global supply chain bottlenecks squeeze manufacturers of everything from handbags to sofas.",
    "link": "https://www.ibtimes.com/heres-why-your-boots-bags-furniture-are-about-get-22-more-expensive-next-year-3793715",
    "timestamp": "2025-12-26T11:12:08Z"
  },
  {
    "title": "Thai defence minister to attend truce talks with Cambodia, PM says",
    "description": "If Thailand and Cambodia can come to an agreement, they will make a deal in line with the previous pact brokered with the help of US President Donald Trump, said Thai Prime Minister Anutin Charnvirakul.",
    "link": "https://www.channelnewsasia.com/asia/thailand-cambodia-truce-talks-ceasefire-defence-minister-5723666",
    "timestamp": "2025-12-26T11:10:00Z"
  },
  {
    "title": "Epstein's 13-Year-Old 'First Victim' Reportedly Names Trump In DOJ File Release",
    "description": "A shocking 2025 DOJ release reveals how Jeffrey Epstein groomed his first victim at 13 and allegedly introduced her to Donald Trump.",
    "link": "https://www.ibtimes.com/epsteins-13-year-old-first-victim-reportedly-names-trump-doj-file-release-3793706",
    "timestamp": "2025-12-26T11:09:58Z"
  },
  {
    "title": "Trump's 'Kryptonite' Releasing The Epstein Files Could Reportedly End His Presidency",
    "description": "President Donald Trump faces a bipartisan revolt and potential subpoenas as his administration misses a legal deadline to release all Jeffrey Epstein files.",
    "link": "https://www.ibtimes.com/trumps-kryptonite-releasing-epstein-files-could-reportedly-end-his-presidency-3793704",
    "timestamp": "2025-12-26T11:09:55Z"
  },
  {
    "title": "Melania Trump's Frosty 'Anybody Else?' Moment Silences Donald On Christmas Eve",
    "description": "Explore the awkward Christmas Eve exchange between Donald and Melania Trump during the NORAD Santa Tracker calls.",
    "link": "https://www.ibtimes.com/melania-trumps-frosty-anybody-else-moment-silences-donald-christmas-eve-3793702",
    "timestamp": "2025-12-26T11:09:28Z"
  },
  {
    "title": "Zelensky says meeting with Trump to happen ‘in the near future’",
    "description": "“We are not losing a single day. We have agreed on a meeting at the highest level – with President Trump in the near future,” Zelensky wrote on X.",
    "link": "https://nypost.com/2025/12/26/world-news/trump-zelensky-meeting-planned-for-near-future-signaling-ukraine-war-progress/",
    "timestamp": "2025-12-26T11:07:36Z"
  },
  {
    "title": "Tucker Carlson Asks Matt Gaetz A Wild Question About AOC",
    "description": "The former Fox News host and the right-wing ex-congressman got into a surprising exchange about Alexandria Ocasio-Cortez.",
    "link": "https://www.huffpost.com/entry/tucker-carlson-matt-gaetz-alexandria-ocasio-cortez_n_694e4c0be4b0414a52f6cf62",
    "timestamp": "2025-12-26T11:07:29Z"
  },
  {
    "title": "A murder, a manhunt and the grandmother who wouldn't stop the search for her daughter's killer",
    "description": "Josephine Wentzel spent years tracking down the suspect in her daughter’s death and is now helping others grieving cold cases.",
    "link": "https://www.nbcnews.com/news/us-news/murder-manhunt-grandmother-wouldnt-stop-search-daughters-killer-rcna249562",
    "timestamp": "2025-12-26T11:07:00Z"
  },
  {
    "title": "How Profit Beat Out Geopolitics in the AI Race",
    "description": "In 2025, too many people were making too much money to slow down.",
    "link": "http://foreignpolicy.com/2025/12/26/the-year-profit-beat-out-geopolitics-in-the-ai-race/",
    "timestamp": "2025-12-26T11:00:55Z"
  },
  {
    "title": "As ICE ramps up deportations, Texas prosecutors say they’re losing key witnesses in criminal cases",
    "description": "Texas DAs say some cases, including murders, have been hobbled or lost because witnesses were detained or deported.",
    "link": "https://www.salon.com/2025/12/26/as-ice-ramps-up-deportations-texas-prosecutors-say-theyre-losing-key-witnesses-in-criminal-cases-partner/",
    "timestamp": "2025-12-26T11:00:50Z"
  },
  {
    "title": "The Year the World Started to Recognize Genocide in Sudan",
    "description": "International actors may be sounding the alarm, but that doesn’t equate to meaningful action.",
    "link": "http://foreignpolicy.com/2025/12/26/sudan-civil-war-genocide-darfur-famine-war-crimes/",
    "timestamp": "2025-12-26T11:00:47Z"
  },
  {
    "title": "After U.S. outreach, Alberta separatists will head to Latin America to rustle up support for their cause",
    "description": "Andrew Hale of the Heritage Foundation said wooing U.S. support could backfire in Alberta, owing to the anti-American sentiment generated by President Donald Trump",
    "link": "https://nationalpost.com/news/after-u-s-outreach-alberta-separatists-will-head-to-latin-america-to-rustle-up-support-for-their-cause",
    "timestamp": "2025-12-26T11:00:28Z"
  }
]