[
  {
    "title": "India is world’s second-largest shrimp producer. That is now under threat",
    "description": "US tariffs have dealt a deadly blow to the Indian shrimp industry that relies predominantly on exports.",
    "link": "https://www.aljazeera.com/economy/2025/11/8/india-is-worlds-second-largest-shrimp-producer-that-is-now-under-threat",
    "timestamp": "2025-11-08T04:33:04Z"
  },
  {
    "title": "Trump Administration Wins Temporary Supreme Court Reprieve In Fight Over Billions In SNAP Payments For 42 Million Americans",
    "description": "On Friday, the Supreme Court granted the Donald Trump administration a brief reprieve in its escalating battle over Supplemental Nutrition Assistance Program payments. The court temporarily halted a lower court order that required full food aid distribution t…",
    "link": "https://biztoc.com/x/e5fda086c3198cdb",
    "timestamp": "2025-11-08T04:31:48Z"
  },
  {
    "title": "Trump says he plans to visit India at Modi’s invitation",
    "description": "In recent weeks, Trump has said that Modi has pledged to wind down purchases of crude from Russia and expressed optimism about trade talks",
    "link": "https://www.bloomberg.com/news/articles/2025-11-06/trump-says-he-plans-to-visit-india-at-modi-s-invitation",
    "timestamp": "2025-11-08T04:23:50Z"
  },
  {
    "title": "Nvidia share price fall hints U.S Stocks Bull Market may crash one day. How to safeguard your money during Bear Market days?",
    "description": "Nvidia shares sell off has triggered fears over possible AI bubble exposure. Chip and other tech-related stocks have been some of the biggest losers this week, while the Nasdaq fell about 3 per cent for the week.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nvidia-share-price-fall-hints-u-s-stocks-bull-market-may-crash-one-day-how-to-safeguard-your-money-during-bear-market-days/articleshow/125178121.cms",
    "timestamp": "2025-11-08T04:20:30Z"
  },
  {
    "title": "Report: Justice Department Issues Flurry Of Subpoenas In Fresh Inquiry Into Trump-Russia Probe",
    "description": "The Justice Department has embarked on a fresh investigation into one of President Donald Trump’s chief grievances.",
    "link": "https://www.huffpost.com/entry/trump-russia-probe_n_690ec335e4b0dd4ea75bbd87",
    "timestamp": "2025-11-08T04:17:14Z"
  },
  {
    "title": "Trump pardons ex-NYPD officer who was convicted of helping China stalk an expat",
    "description": "President Donald Trump has pardoned Michael McMahon, a former New York Police Department sergeant. McMahon was convicted of assisting China in its efforts to pressure a former official to return to his homeland. He maintained his innocence, claiming he was un…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-pardons-ex-nypd-officer-who-was-convicted-of-helping-china-stalk-an-expat/articleshow/125178125.cms",
    "timestamp": "2025-11-08T04:15:12Z"
  },
  {
    "title": "SOURCES: DOJ issues flurry of subpoenas in new inquiry into Trump-Russia probe",
    "description": "The Justice Department has embarked on a fresh investigation into one of President Donald Trump's chief grievances, issuing a flurry of subpoenas related to the U.S. government's inquiry into Russian interference in the 2016 presidential election",
    "link": "https://www.wmtw.com/article/trump-doj-russia-investigation-subpoenas/69293204",
    "timestamp": "2025-11-08T04:14:33Z"
  },
  {
    "title": "Donald Trump endorses ‘young, strong, and smart’ Vivek Ramaswamy for Ohio Governor 2026",
    "description": "Donald Trump has thrown his weight behind Vivek Ramaswamy for Ohio Governor in 2026, calling the entrepreneur \"young, strong, and smart.\" Trump's endorsement, announced on Truth Social, highlights Ramaswamy's conservative platform and promises he'll be a \"GRE…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-endorses-young-strong-and-smart-vivek-ramaswamy-for-ohio-governor-2026/articleshow/125177981.cms",
    "timestamp": "2025-11-08T04:12:44Z"
  },
  {
    "title": "Daily Briefing: Cashing in post the World Cup win",
    "description": "Also in today's edition: Land linked to Ajit Pawar's son debacle; Dalmianagar: Bihar’s ghost town; 'Haq' movie review",
    "link": "https://indianexpress.com/article/live-news/daily-briefing-top-news-november-8-cricket-ajit-pawar-10352968/",
    "timestamp": "2025-11-08T04:06:15Z"
  },
  {
    "title": "Laura Ingraham Tells Senate Republican, ‘Y’all Gonna Get Wiped Out’ in the Midterms if GOP Keeps Filibuster",
    "description": "Fox News host Laura Ingraham urged Sen. Roger Marshall and other Senate Republicans to eliminate the filibuster, lest the GOP \"get wiped out\" in the next year's midterm elections.\nThe post Laura Ingraham Tells Senate Republican, ‘Y’all Gonna Get Wiped Out’ in…",
    "link": "https://www.mediaite.com/media/tv/laura-ingraham-tells-senate-republican-yall-gonna-get-wiped-out-in-the-midterms-if-gop-keeps-filibuster/",
    "timestamp": "2025-11-08T04:00:46Z"
  },
  {
    "title": "What does the Supreme Court’s ruling mean for SNAP payments in Michigan?",
    "description": "The U.S. Supreme Court granted President Donald Trump's appeal on Friday, Nov. 7, temporarily blocking a court order requiring the USDA to issue full SNAP benefits in the month of November.",
    "link": "https://www.mlive.com/politics/2025/11/what-does-the-supreme-courts-ruling-mean-for-snap-payments-in-michigan.html",
    "timestamp": "2025-11-08T03:59:31Z"
  },
  {
    "title": "Crude recovers late in session on hopes over US-Hungary meeting",
    "description": "Crude prices recovered Friday as hopes emerged that Hungary could utilize Russian oil following a meeting between President Trump and Prime Minister Orban. Despite this, both Brent and WTI benchmarks are set for weekly declines due to increased global product…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/crude-recovers-late-in-session-on-hopes-over-us-hungary-meeting/articleshow/125177967.cms",
    "timestamp": "2025-11-08T03:58:11Z"
  },
  {
    "title": "12 Reasons Why Donald Trump May Be Losing The Plot",
    "description": "A series of confusing rants and apparent naps have prompted fresh questions about the president’s health.",
    "link": "https://www.thedailybeast.com/12-reasons-why-donald-trump-may-be-losing-the-plot/",
    "timestamp": "2025-11-08T03:50:34Z"
  },
  {
    "title": "Nasdaq posts worst week since April amid AI rally jitters, US yields slip",
    "description": "Indian markets saw a dip mirroring global trends. The Nasdaq experienced its largest weekly fall since April due to concerns over artificial intelligence stock sustainability. U.S. Treasury yields also declined. China's trade data showed the impact of tariffs…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-posts-worst-week-since-april-amid-ai-rally-jitters-us-yields-slip/articleshow/125177839.cms",
    "timestamp": "2025-11-08T03:45:41Z"
  },
  {
    "title": "‘Warned them months ago’: System crash, flight disruptions could have been avoided, say Air Traffic Controllers",
    "description": "A recent system crash grounding numerous Indian flights could have been prevented. Air traffic controllers had previously flagged performance issues and urged timely system upgrades to meet global safety standards. Despite repeated warnings to airport authori…",
    "link": "https://timesofindia.indiatimes.com/city/delhi/we-warned-them-system-crash-flight-disruptions-could-have-been-avoided-say-air-traffic-controllers/articleshow/125177794.cms",
    "timestamp": "2025-11-08T03:44:34Z"
  },
  {
    "title": "Great groups, not great men, do great things",
    "description": "Mind Field News: But not every ‘team’ fits the criteria",
    "link": "https://timesofindia.indiatimes.com/world/mind-field/great-groups-not-great-men-do-great-things/articleshow/125177743.cms",
    "timestamp": "2025-11-08T03:42:46Z"
  },
  {
    "title": "Crypto founder pardoned by Trump denies having ties to president's family",
    "description": "Binance founder Changpeng \"CZ\" Zhao addresses President Donald Trump pardoning him and denies reports of his ties to the Trump family on \"Special Report.\"",
    "link": "https://www.foxnews.com/media/crypto-founder-pardoned-trump-denies-having-ties-trump-family",
    "timestamp": "2025-11-08T03:32:58Z"
  },
  {
    "title": "Judge rules Trump lacked grounds for Portland National Guard order",
    "description": "A federal judge in Oregon has ruled that President Donald Trump's administration failed to meet the legal requirements for deploying the National Guard to Portland",
    "link": "https://www.wcvb.com/article/judge-rules-against-trump-portland-national-guard-deployment/69293064",
    "timestamp": "2025-11-08T03:26:16Z"
  },
  {
    "title": "Coons Claims Trump 'Taking Concrete Actions that Hurt Americans'",
    "description": "Friday on MSNBC's \"The Weeknight,\" Sen. Chris Coons (D-DE) said President Donald Trump was \"taking concrete actions that hurt Americans,\" while dealing with other nations.\nThe post Coons Claims Trump ‘Taking Concrete Actions that Hurt Americans’ appeared firs…",
    "link": "https://www.breitbart.com/clips/2025/11/07/coons-claims-trump-taking-concrete-actions-that-hurt-americans/",
    "timestamp": "2025-11-08T03:24:54Z"
  },
  {
    "title": "Flake: Trump Is 'Completely Out of Touch' on the Economy",
    "description": "Friday on CNN's \"OutFront,\" former Sen. Jeff Flake (R-AZ) said President Donald Trump was \"completely out of touch\" with how Americans feel about the economy.\nThe post Flake: Trump Is ‘Completely Out of Touch’ on the Economy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/07/flake-trump-is-completely-out-of-touch-on-the-economy/",
    "timestamp": "2025-11-08T03:23:21Z"
  },
  {
    "title": "Justice Department issues flurry of subpoenas in fresh inquiry into Trump-Russia probe: Report",
    "description": "The Justice Department is diving deep into history with a revived investigation into the Russian meddling in the 2016 elections. Subpoenas have been sent out, targeting crucial documents from an intelligence assessment crafted by the Obama administration. Thi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/justice-department-issues-flurry-of-subpoenas-in-fresh-inquiry-into-trump-russia-probe-report/articleshow/125177625.cms",
    "timestamp": "2025-11-08T03:15:56Z"
  },
  {
    "title": "UNC vs Kansas halftime: Major takeaways that expose hints of trouble while leaving questions unanswered",
    "description": "Halftime revealed UNC's struggles against Kansas, with freshmen Caleb Wilson and Henri Veesaar providing the only offensive spark. The Tar Heels' inconsistent play and reliance on a few players contrasted sharply with Kansas' poised execution. Defensively, UN…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/unc-vs-kansas-halftime-major-takeaways-that-expose-hints-of-trouble-while-leaving-questions-unanswered/articleshow/125177595.cms",
    "timestamp": "2025-11-08T03:14:52Z"
  },
  {
    "title": "Democrats consider prolonging government shutdown as Republicans prepare new bills without health care fix - NewsBreak",
    "description": "WASHINGTON (AP) — Republican senators are trying to end the government shutdown by preparing a bipartisan package of spending bills that they hope will win",
    "link": "https://www.newsbreak.com/share/4336857652862-democrats-consider-prolonging-government-shutdown-as-republicans-prepare-new-bills-without-health-care-fix?s=a2&amp;share_destination_id=MTExMjY5MTUtMTc2MjU3MTU2MDIxMQ%3D%3D&amp;pd=00kgcNB3&amp;hl=en_US&amp;send_time=1762571560&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.44.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-08T03:14:16Z"
  },
  {
    "title": "SCOTUS allows govt to withhold some SNAP funds",
    "description": "The United States Supreme Court granted the emergency appeal filed by the administration of President Donald Trump to withhold some payments under the Supplemental Nutrition Assistance Program (SNAP),...",
    "link": "https://biztoc.com/x/32b4f63fd4cb50bf",
    "timestamp": "2025-11-08T03:14:12Z"
  },
  {
    "title": "'He is something special': Trump backs Vivek Ramaswamy for 2026 Ohio Governor race, calls him ‘young and smart’",
    "description": "Donald Trump has thrown his weight behind Indian-origin entrepreneur and politician Vivek Ramaswamy for the 2026 Ohio governor race, calling him 'young, smart and strong.' Despite this backing, polls indicate a close contest with Democrat Amy Acton. The Ohio …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-he-is-something-special-trump-backs-vivek-ramaswamy-for-2026-ohio-governor-race-calls-him-young-and-smart/articleshow/125177540.cms",
    "timestamp": "2025-11-08T03:11:11Z"
  },
  {
    "title": "Transgenderism Is in Rapid Decline Among Young Americans",
    "description": "Transgenderism is in rapid decline among young Americans, indicating it was a social contagion.\n\n\n\n\nA few weeks ago, I\n\npublished results\n\nfrom six waves of the massive Foundation for Individual Rights and Expression (FIRE) annual survey of undergraduate stud…",
    "link": "https://www.skeptic.com/article/transgenderism-is-in-rapid-decline-among-young-americans/",
    "timestamp": "2025-11-08T03:07:13Z"
  },
  {
    "title": "'Shame On Him!': Ex-Prosecutor Schools JD Vance Over 'Absurd' SNAP Comments",
    "description": "Barbara McQuade checked the vice president using his own educational background.",
    "link": "https://www.huffpost.com/entry/msnbc-barbara-mcquade-jd-vance-trump-snap-benefits_n_690e9457e4b03cb1290019ab",
    "timestamp": "2025-11-08T03:04:41Z"
  },
  {
    "title": "War for Ukraine Day 1,352: Once Again Russian Missiles and Drones Are Striking Ukrainian Civilian Targets In the Small Hours of the Night",
    "description": "(Image by NEIVANMADE) Once again the small hours of the night are the deadliest hours as Russia is targeting Ukrainian civilian targets with missiles and drones. This was from about 3 hours ago: Nationwide air alert in democratic Ukraine now due to activity o…",
    "link": "https://balloon-juice.com/2025/11/07/war-for-ukraine-day-1352-once-again-russian-missiles-and-drones-are-striking-ukrainian-civilian-targets-in-the-small-hours-of-the-night/",
    "timestamp": "2025-11-08T03:03:07Z"
  },
  {
    "title": "SCOTUS Pauses Order to Fully Fund SNAP",
    "description": "Reuters reported that the U.S. Supreme Court put a hold on a lower court’s order to fully fund the SNAP program, which provides food for low-income people. About one of every eight Americans will go hungry because of the Court’s order. The lower federal distr…",
    "link": "https://dianeravitch.net/2025/11/07/scotus-pauses-order-to-fully-fund-snap/",
    "timestamp": "2025-11-08T03:00:00Z"
  },
  {
    "title": "U.S. Supreme Court pauses judge's order requiring Trump to fully fund food aid",
    "description": "The ruling came after the administration said it would provide $4.65 billion in emergency funding to partially cover food benefits for November.",
    "link": "https://www.japantimes.co.jp/news/2025/11/08/world/trump-partial-food-aid/",
    "timestamp": "2025-11-08T02:57:00Z"
  },
  {
    "title": "Rep. Crockett Bashes Trump Tariffs, Hopes Supreme Court Will Act",
    "description": "Rep. Jasmine Crockett told CNN she hoped the Supreme Court would rule against Trump's tariffs, and if they do she wants to make sure they get the credit for helping the economy.\nCrockett rightfully explained how Trump's yo-yo tariffs are inflicting pain on th…",
    "link": "https://crooksandliars.com/2025/11/rep-crockett-bashes-trump-tariffs-hopes",
    "timestamp": "2025-11-08T02:56:27Z"
  },
  {
    "title": "US judge says Trump cannot deploy National Guard to Portland",
    "description": "The Trump administration did not have a legal basis to use troops to quell immigration protests, the judge wrote in a 106-page ruling.",
    "link": "https://www.bbc.com/news/articles/cddrq0plr1zo",
    "timestamp": "2025-11-08T02:54:51Z"
  },
  {
    "title": "Supreme Court issues emergency order to block full SNAP food aid payments",
    "description": "The Supreme Court on Friday granted the Trump administration’s emergency appeal to temporarily block a court order to fully fund SNAP food aid payments amid the government shutdown.",
    "link": "https://www.wpxi.com/news/local/supreme-court-issues-emergency-order-block-full-snap-food-aid-payments/46GAGJN3PVCIHFHHNKZI5JI2G4/",
    "timestamp": "2025-11-08T02:53:49Z"
  },
  {
    "title": "Trump's Unpredictability Keeps Beijing Off Balance: Analysts",
    "description": "Trump's Unpredictability Keeps Beijing Off Balance: Analysts\n \nAuthored by Terri Wu via The Epoch Times (emphasis ours),\nSince day one in office, President Donald Trump has taken Beijing on a roller coaster ride of tariffs and export controls. For a regime th…",
    "link": "https://biztoc.com/x/09d6e02003ad9b19",
    "timestamp": "2025-11-08T02:52:21Z"
  },
  {
    "title": "Sean Duffy Warns Of 20% Flight Reductions As Shutdown Threatens To Cripple Holiday Travel: 'Going To Make Decisions Based On...'",
    "description": "The Donald Trump administration has warned that worsening air traffic controller shortages caused by the prolonged government shutdown could soon ground thousands more flights, disrupting travel just as the busy holiday season approaches.\nFAA Orders Airlines …",
    "link": "https://biztoc.com/x/4b53fbb29a3f4224",
    "timestamp": "2025-11-08T02:52:10Z"
  },
  {
    "title": "Trump's signature policy poised to 'melt into a puddle of humiliation': Nobel laureate",
    "description": "President Donald Trump's tariff regime looks likely to be killed by the Supreme Court, Nobel Prize-winning economist turned political pundit Paul Krugman wrote for his Substack on Friday — and he has no one to blame but himself.Trump premised his ability to d…",
    "link": "https://www.rawstory.com/paul-krugman-2674277052/",
    "timestamp": "2025-11-08T02:51:56Z"
  },
  {
    "title": "DHS Reportedly Sought to Buy Spirit Airlines Planes That Didn’t Have Engines and the Carrier Didn’t Own",
    "description": "Secretary of Homeland Security Kristi Noem and top adviser Corey Lewandowski ordered officials at Immigration and Customs Enforcement to purchase 10 jets from Spirit Airlines, before learning that the airline not only didn’t own the planes, but they also didn…",
    "link": "https://www.mediaite.com/media/news/dhs-reportedly-sought-to-buy-spirit-airlines-planes-that-didnt-have-engines-and-the-carrier-didnt-own/",
    "timestamp": "2025-11-08T02:50:56Z"
  },
  {
    "title": "Hungary is the only Christian government in EU ‘liberal ocean’ – Orban",
    "description": "Hungary is the only EU nation that stands for peace and has “philosophical” differences with Brussels, Prime Minister Viktor Orban has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627487-hungary-christian-government-liberal-ocean/",
    "timestamp": "2025-11-08T02:48:31Z"
  },
  {
    "title": "Supreme Court issues emergency order to block full SNAP food aid payments",
    "description": "The Supreme Court temporarily allowed the Trump administration to block full SNAP food aid payments during the shutdown.",
    "link": "https://www.newschannel5.com/news/supreme-court-issues-emergency-order-to-block-full-snap-food-aid-payments",
    "timestamp": "2025-11-08T02:44:18Z"
  },
  {
    "title": "US judge rules Trump illegally ordered National Guard troops to Portland",
    "description": "US district judge blocks Donald Trump's use of military force to tackle protests against immigration officers.",
    "link": "https://www.aljazeera.com/news/2025/11/8/us-judge-rules-trump-illegally-ordered-national-guard-troops-to",
    "timestamp": "2025-11-08T02:39:52Z"
  },
  {
    "title": "BREAKING: Supreme Court Blocks Lower Court Ruling That Ordered Trump Administration to Pay Full SNAP Benefits",
    "description": "The U.S. Supreme Court on Friday night blocked a lower court ruling that ordered the Trump administration to pay recipients of the Supplemental Nutrition Assistance Program their full benefits. Last week, two U.S. district court judges ordered the administrat…",
    "link": "https://www.mediaite.com/politics/breaking-supreme-court-blocks-lower-court-ruling-that-ordered-trump-administration-to-pay-full-snap-benefits/",
    "timestamp": "2025-11-08T02:39:15Z"
  },
  {
    "title": "U.S. Supreme Court allows Trump admin to avoid fully funding SNAP payments for now",
    "description": "The U.S. Supreme Court on Friday allowed U.S. President Donald Trump's administration to withhold for now about $4 billion US needed to fully fund a food aid program for 42 million low-income Americans this month amid the federal government shutdown.",
    "link": "https://www.cbc.ca/news/world/us-supreme-court-snap-ruling-trump-9.6972034",
    "timestamp": "2025-11-08T02:36:16Z"
  },
  {
    "title": "Todd Blanche on defending Trump policies: 'It's a war, man' (Josh Gerstein/Politico)",
    "description": "Josh Gerstein / Politico:\nTodd Blanche on defending Trump policies: 'It's a war, man'  —  The Justice Department's No. 2 official, Todd Blanche, let loose Friday, railing against judges blocking administration policies and denying that prosecutions of Preside…",
    "link": "https://www.memeorandum.com/251107/p89",
    "timestamp": "2025-11-08T02:35:00Z"
  },
  {
    "title": "‘Everything Is Starting To Change’: Victor Davis Hanson Says Pressure Mounting On Putin And His War On Ukraine",
    "description": "Victor Davis Hanson said Friday that Russian President Vladimir Putin faces mounting pressure as Ukraine steps up its counteroffensive.",
    "link": "https://dailycaller.com/2025/11/07/victor-davis-hanson-vladimir-putin-faces-pressure/",
    "timestamp": "2025-11-08T02:27:59Z"
  },
  {
    "title": "North Korea threatens 'offensive action', condemns US-South Korea security talks",
    "description": "SEOUL: North Korea's defence minister No Kwang Chol threatened on Saturday (Nov 8) to take \"more offensive action\" as he condemned US security talks with Seoul and the arrival of a US aircraft carrier in South Korea.A day earlier, North Korea",
    "link": "https://www.channelnewsasia.com/east-asia/north-korea-threats-offensive-action-us-talks-south-5454751",
    "timestamp": "2025-11-08T02:27:44Z"
  },
  {
    "title": "Court orders Trump to continue SNAP payments",
    "description": "A United States appeals court rejected a request by the administration of President Donald Trump to set aside a lower court ruling ordering the federal government to continue payments under the Supple...",
    "link": "https://biztoc.com/x/07a5ff3f6d437f7f",
    "timestamp": "2025-11-08T02:18:37Z"
  },
  {
    "title": "Trump asks Supreme Court to step into fight over food stamp benefits (CNN)",
    "description": "CNN:\nTrump asks Supreme Court to step into fight over food stamp benefits  —  President Donald Trump asked the Supreme Court on Friday evening to block a lower court ruling that required the administration to fully cover food stamp benefits for tens of millio…",
    "link": "https://www.memeorandum.com/251107/p85",
    "timestamp": "2025-11-08T02:15:01Z"
  },
  {
    "title": "Soaring electricity rates fueled Democratic victories — now comes the hard part",
    "description": "While there's plenty for voters to be worried about right now, rising utility bills have become a hot-button issue. The success of Democrats in New Jersey, Virginia, and Georgia in this week's elections can be seen as something of a referendum on the state of…",
    "link": "https://www.theverge.com/report/816946/electricity-rates-election-democrats",
    "timestamp": "2025-11-08T02:12:50Z"
  },
  {
    "title": "Washington Week with The Atlantic full episode, 11/7/25",
    "description": "President Trump enjoys hosting leaders, projecting power and his central role in world affairs. But there’s a different reality outside the Oval Office, one in which polls are showing him unpopular with the majority of Americans. Join Jeffrey Goldberg, Leigh …",
    "link": "https://www.pbs.org/weta/washingtonweek/video/2025/11/washington-week-with-the-atlantic-full-episode-111725",
    "timestamp": "2025-11-08T02:12:15Z"
  },
  {
    "title": "US gives Hungary exemption from Russian oil sanctions",
    "description": "The United States has granted Hungary a one-year exemption from US sanctions for using Russian oil and gas, a White House official has said, after Hungarian Prime Minister Viktor Orbán pressed his case for a reprieve during a meeting with President Donald Tru…",
    "link": "https://www.rte.ie/news/world/2025/1108/1542847-us-hungary-russia/",
    "timestamp": "2025-11-08T02:12:13Z"
  },
  {
    "title": "US gives Hungary exemption from Russian oil sanctions",
    "description": "The United States has granted Hungary a one-year exemption from US sanctions for using Russian oil and gas, a White House official has said, after Hungarian Prime Minister Viktor Orbán pressed his case for a reprieve during a meeting with President Donald Tru…",
    "link": "https://www.rte.ie/news/world/2025/1108/1542847-us-gives-hungary-exemption-from-russian-oil-sanctions/",
    "timestamp": "2025-11-08T02:12:13Z"
  },
  {
    "title": "Ex-CIA chief subpoenaed in Russiagate probe – media",
    "description": "John Brennan and several other Obama-era officials were asked for records about the 2017 report that triggered the conspiracy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627491-cia-brennan-russiagate-probe/",
    "timestamp": "2025-11-08T02:04:02Z"
  },
  {
    "title": "Trump admin asks Supreme Court to halt order providing full SNAP payments for November",
    "description": "Residents across the nation started to receive their full SNAP food aid benefits on Friday after an appeals court left in place, for now, a requirement that the Trump administration fund such benefits during the government shutdown.",
    "link": "https://nypost.com/2025/11/07/us-news/trump-admin-asks-supreme-court-to-halt-order-providing-full-snap-payments-for-november/",
    "timestamp": "2025-11-08T02:02:29Z"
  },
  {
    "title": "Trump is ramping up a new effort to convince a skeptical public he can fix affordability worries",
    "description": "Amid growing concerns about escalating living costs, President Trump is revamping his voter outreach strategy. He intends to introduce fresh tax breaks and highlight his commitment to stabilizing prices as central themes of his campaign. Recognizing that affo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-is-ramping-up-a-new-effort-to-convince-a-skeptical-public-he-can-fix-affordability-worries/articleshow/125177049.cms",
    "timestamp": "2025-11-08T01:56:12Z"
  },
  {
    "title": "Judge Rules Trump Administration Failed To Meet Legal Requirements For Deploying Troops To Portland",
    "description": "The ruling from U.S. District Court Judge Karin Immergut, a Trump appointee, followed a three-day trial last week.",
    "link": "https://www.huffpost.com/entry/federal-enforcement-trial-oregon_n_690ea133e4b0d142901f55da",
    "timestamp": "2025-11-08T01:51:56Z"
  },
  {
    "title": "Trump's order to send National Guard troops to Portland, Ore., was illegal, U.S. judge rules",
    "description": "U.S. President Donald Trump unlawfully ordered National Guard troops to Portland, Oregon, a federal judge ruled Friday, a legal setback to the administration's use of the military in American cities.",
    "link": "https://www.cbc.ca/news/world/trump-national-guard-troops-portland-illegal-judge-rules-9.6972044",
    "timestamp": "2025-11-08T01:47:01Z"
  },
  {
    "title": "Thousands of US flights cancelled or delayed over government shutdown cuts",
    "description": "Friday marked the first day of flight cuts mandated by the US government at 40 of the nation's airports",
    "link": "https://www.bbc.com/news/articles/c20eq1vnjj5o",
    "timestamp": "2025-11-08T01:46:27Z"
  },
  {
    "title": "Kamala Harris says there’s enough room for everyone to be successful—and that professionals who think otherwise are guilty of ‘provincial thinking’",
    "description": "Many workers climb the career ladder believing that someone else has to fall off for them to rise. But former U.S. Vice President Kamala Harris says that’s not only wrong—it’s what’s holding people back. “There are far too many people in this world and in pro…",
    "link": "https://freerepublic.com/focus/f-chat/4351380/posts",
    "timestamp": "2025-11-08T01:44:40Z"
  },
  {
    "title": "Trump administration asks Supreme Court to halt order providing full SNAP payments for November",
    "description": "Residents in several US states received full SNAP food aid Friday. An appeals court order compelled President Trump's administration to fund these monthly benefits. This decision came amid a US government shutdown. Some states acted swiftly to disburse funds.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-asks-supreme-court-to-halt-order-providing-full-snap-payments-for-november/articleshow/125176980.cms",
    "timestamp": "2025-11-08T01:44:14Z"
  },
  {
    "title": "Trump wants to abolish the filibuster. GOP senators aren't on board. (Theodoric Meyer/Washington Post)",
    "description": "Theodoric Meyer / Washington Post:\nTrump wants to abolish the filibuster.  GOP senators aren't on board.  —  The president wants to end the filibuster to reopen the government and to do “so many things.”  —  Senate Republicans have largely backed President Do…",
    "link": "https://www.memeorandum.com/251107/p79",
    "timestamp": "2025-11-08T01:40:01Z"
  },
  {
    "title": "US judge rules Trump illegally ordered National Guard to Portland, Oregon",
    "description": "(Reuters) -President Donald Trump unlawfully ordered National Guard troops to Portland, Oregon, a federal judge ruled Friday, a legal setback to the administration's use of the military in American cities.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/08/us-judge-rules-trump-illegally-ordered-national-guard-to-portland-oregon",
    "timestamp": "2025-11-08T01:37:00Z"
  },
  {
    "title": "Judge rules Trump illegally ordered National Guard to Portland, Oregon",
    "description": "President Donald Trump unlawfully ordered National Guard troops to Portland, Oregon, a federal judge ruled Friday, a legal setback to the administration's use of the military in American cities. The ruling by U.S. District Judge Karin Immergut is the first to…",
    "link": "https://japantoday.com/category/world/us-judge-rules-trump-illegally-ordered-national-guard-to-portland-oregon",
    "timestamp": "2025-11-08T01:36:09Z"
  },
  {
    "title": "Former DACA recipient with violent criminal past flees ICE, tries balcony jump during Chicago arrest",
    "description": "Two ICE officers were injured during the arrest of a Mexican national who allegedly struck agents. The suspect's DACA status was previously denied in 2019 under Trump administration.",
    "link": "https://www.foxnews.com/us/former-daca-recipient-violent-criminal-past-flees-ice-tries-balcony-jump-chicago-arrest",
    "timestamp": "2025-11-08T01:33:35Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,353",
    "description": "Here are the key events from day 1,353 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/8/russia-ukraine-war-list-of-key-events-day-1353",
    "timestamp": "2025-11-08T01:30:33Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemykoco.com",
    "link": "https://www.koco.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:25:57Z"
  },
  {
    "title": "US judge rules against Trump officials for using work emails to send partisan messages blaming Democrats for shutdown",
    "description": "A court has delivered a decisive blow to the Trump administration, siding against the use of federal employees' email communications for political finger-pointing amid a government shutdown. The judge found that this practice infringed upon the constitutional…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-judge-rules-against-trump-officials-for-using-work-emails-to-send-partisan-messages-blaming-democrats-for-shutdown/articleshow/125176879.cms",
    "timestamp": "2025-11-08T01:25:47Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywlwt.com",
    "link": "https://www.wlwt.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:23:59Z"
  },
  {
    "title": "Trump Responds to Walmart's 'Cheaper' Thanksgiving",
    "description": "US President Donald Trump answered question from reporters while meeting with Hungarian Prime Minister Viktor Orban. Trump signaled an openness to exempting Hungary from sanctions on purchases of Russian energy as he hosted Prime Minister Viktor Orban. The Pr…",
    "link": "https://biztoc.com/x/76e873d1dd28cdbb",
    "timestamp": "2025-11-08T01:23:09Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywlky.com",
    "link": "https://www.wlky.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:20:30Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywbaltv.com",
    "link": "https://www.wbaltv.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:20:28Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywmur.com",
    "link": "https://www.wmur.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:20:28Z"
  },
  {
    "title": "Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation",
    "description": "President Donald Trump is accusing foreign-owned meat packers of driving up the price of beef in the U.S. and is asking the Department of Justice to open an investigation",
    "link": "https://abcnews.go.com/US/wireStory/trump-accuses-foreign-owned-meat-packers-inflating-us-127313811",
    "timestamp": "2025-11-08T01:17:48Z"
  },
  {
    "title": "Trump Accused Boat Crews Of Being Narco-Terrorists. The Truth Is More Nuanced.",
    "description": "The Associated Press learned the identities of four of the men who were slain, providing the first detailed account of those who died in the U.S. military strikes.",
    "link": "https://www.huffpost.com/entry/trump-venezuela-boat-crews-narco-terrorists-ap_n_690e955de4b03cb1290019b1",
    "timestamp": "2025-11-08T01:16:50Z"
  },
  {
    "title": "Protesters at 100+ Campuses Tell Trump 'Hands Off Higher Ed!'",
    "description": "Students and professors at over 100 universities across the United States on Friday joined protests against President Donald Trump's sweeping assault on higher education, including a federal funding compact that critics call \"extortion.\"Crafted in part by bil…",
    "link": "https://www.commondreams.org/news/trump-higher-education",
    "timestamp": "2025-11-08T01:16:38Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court to Block Ruling Ordering It to Pay Full Food Benefits",
    "description": "President Donald Trump's administration asked the Supreme Court to block an order forcing the government to resume full funding for federal food assistance.\nThe post Trump Administration Asks Supreme Court to Block Ruling Ordering It to Pay Full Food Benefits…",
    "link": "https://www.mediaite.com/media/news/trump-administration-asks-supreme-court-to-block-ruling-ordering-it-to-pay-full-food-benefits/",
    "timestamp": "2025-11-08T01:16:22Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywcvb.com",
    "link": "https://www.wcvb.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:15:10Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywmtw.com",
    "link": "https://www.wmtw.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:14:50Z"
  },
  {
    "title": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemywyff4.com",
    "link": "https://www.wyff4.com/article/letitia-james-requests-trump-fraud-case-dismissal/69291802",
    "timestamp": "2025-11-08T01:14:43Z"
  },
  {
    "title": "Warnock, Ossoff vote with Republicans to pay federal workers as government shutdown continues",
    "description": "President Donald Trump called on senators not to leave Washington, DC, for the weekend until they have a deal to end the shutdown.",
    "link": "https://www.wsbtv.com/news/local/atlanta/warnock-ossoff-vote-with-republicans-pay-federal-workers-government-shutdown-continues/ZZRKCMMXGBF75CJNC44T6MUULA/",
    "timestamp": "2025-11-08T01:13:54Z"
  },
  {
    "title": "Republicans swat down Democratic offer to end shutdown as impasse continues into 38th day",
    "description": "Government shutdown continues for 38 days as Senate Republicans reject a Democratic proposal. The offer aimed to reopen the government and extend healthcare subsidies for a year. Senate Majority Leader John Thune calls the offer a 'nonstarter'. Moderate Democ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/republicans-swat-down-democratic-offer-to-end-shutdown-as-impasse-continues-into-38th-day/articleshow/125176786.cms",
    "timestamp": "2025-11-08T01:12:21Z"
  },
  {
    "title": "Trump urges immediate end to govt shutdown",
    "description": "United States President Donald Trump urged Republican Senators to \"stop playing games\" with \"Radical Left Democrats\" and immediately end the ongoing government shutdown.\"IMMEDIATELY OPEN OUR COUNTRY, ...",
    "link": "https://biztoc.com/x/5f20fc6e1c45b575",
    "timestamp": "2025-11-08T01:12:02Z"
  },
  {
    "title": "Former GOP Senator Deems Trump ‘Completely Out of Touch’ With Americans",
    "description": "During a Friday appearance on CNN, former Senator Jeff Flake (R-AZ) deemed President Donald Trump “completely out of touch” with how Americans feel about the economy, adding that prices “really aren’t” down everywhere, and “people know that.” Speaking to CNN’…",
    "link": "https://www.mediaite.com/media/tv/former-gop-senator-deems-trump-completely-out-of-touch-with-americans/",
    "timestamp": "2025-11-08T01:10:08Z"
  },
  {
    "title": "Judge permanently bars Trump from deploying National Guard troops to Portland in response to immigration protests",
    "description": "A federal judge in Oregon on Friday issued a permanent injunction barring the Trump administration from deploying the National Guard on the streets of Portland in response to protests against the president's immigration policies.\"This Court arrives at the nec…",
    "link": "https://www.nbcnews.com/news/us-news/judge-permanently-bars-trump-deploying-national-guard-troops-portland-rcna236421",
    "timestamp": "2025-11-08T01:09:25Z"
  },
  {
    "title": "‘Pluribus’ Episode 2 Recap: No One Woman Should Have All That Power",
    "description": "Fighters and traitors seems about the size of things, yeah.",
    "link": "https://decider.com/2025/11/07/pluribus-episode-2-recap/",
    "timestamp": "2025-11-08T01:05:00Z"
  },
  {
    "title": "Jamie Lee Curtis Rejoices Over Democrat Election Victories: 'Repudiation of the Authoritative Regime'",
    "description": "Left-wing actress Jamie Lee Curtis celebrated Tuesday's Democrat Party victories calling them a \"repudiation\" of Donald Trump, despite most of the victories were in deep blue states and cities.\nThe post Jamie Lee Curtis Rejoices Over Democrat Election Victori…",
    "link": "https://www.breitbart.com/entertainment/2025/11/07/jamie-lee-curtis-rejoices-over-democrat-election-victories-repudiation-of-the-authoritative-regime/",
    "timestamp": "2025-11-08T01:03:46Z"
  },
  {
    "title": "Conservative Texas Judge Let Boeing Off Too Easy On Its 737 Crash Case",
    "description": "Conservative Texas Judge Let Boeing Off Too Easy, Dismissing Its 737 Crash Case the Judge Had Neatly Delayed from 2024",
    "link": "https://www.forbes.com/sites/charlestiefer/2025/11/07/conservative-texas-judge-let-boeing-off-too-easy-on-its-737-crash-case/",
    "timestamp": "2025-11-08T01:03:14Z"
  },
  {
    "title": "The Latest Controversial Ziwe Interview Was Actually Quite Good",
    "description": "Interviewing politicians is always a minefield, especially for a comedy show",
    "link": "https://www.cracked.com/article_49059_the-latest-controversial-ziwe-interview-was-actually-quite-good.html",
    "timestamp": "2025-11-08T01:00:00Z"
  },
  {
    "title": "Trump hints at easing Russian oil sanctions on Hungary, says Russia-Ukraine war \"taking a big toll on Moscow\"",
    "description": "US President Donald Trump is considering an exemption for Hungary from Russian oil sanctions. This move aims to help Hungary secure energy supplies. Hungarian Prime Minister Viktor Orban requested the exemption due to Hungary's heavy reliance on Russian oil a…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/trump-hints-at-easing-russian-oil-sanctions-on-hungary-says-russia-ukraine-war-taking-a-big-toll-on-moscow/articleshow/125176731.cms",
    "timestamp": "2025-11-08T00:57:56Z"
  },
  {
    "title": "Trump hints at easing Russian oil sanctions on Hungary, says Russia-Ukraine war \"taking a big toll on Moscow\"",
    "description": "US President Donald Trump is considering an exemption for Hungary from Russian oil sanctions. This move aims to help Hungary secure energy supplies. Hungarian Prime Minister Viktor Orban requested the exemption due to Hungary's heavy reliance on Russian oil a…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/trump-hints-at-easing-russian-oil-sanctions-on-hungary-says-russia-ukraine-war-taking-a-big-toll-on-moscow/articleshow/125176716.cms",
    "timestamp": "2025-11-08T00:57:56Z"
  },
  {
    "title": "Trump’s Threat: We Have Enough Nukes “To Blow Up The World 150 Times”",
    "description": "In a world where conflicts often unfold far from the public eye, satellites are quietly becoming witnesses from above, documenting destruction, displacement, and crimes that would otherwise remain hidden. The United Nations Satellite Centre (UNOSAT), a progra…",
    "link": "https://www.activistpost.com/trumps-threat-we-have-enough-nukes-to-blow-up-the-world-150-times/",
    "timestamp": "2025-11-08T00:57:00Z"
  },
  {
    "title": "Trump accuses foreign-owned meat packers of inflating U.S. beef prices and calls for investigation",
    "description": "President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation. The Republican president announced the move on social media days after his party suff…",
    "link": "https://japantoday.com/category/business/trump-accuses-foreign-owned-meat-packers-of-inflating-us-beef-prices-and-calls-for-investigation",
    "timestamp": "2025-11-08T00:56:36Z"
  },
  {
    "title": "Trump says U.S. to boycott G20 in South Africa, repeating allegations about treatment of white farmers",
    "description": "President Donald Trump said Friday that no U.S. government officials would be attending the Group of 20 summit this year in South Africa, citing the country’s treatment of white farmers. Trump had already announced he would not attend the annual summit for he…",
    "link": "https://japantoday.com/category/world/trump-says-us-to-boycott-g20-in-south-africa-repeating-allegations-about-treatment-of-white-farmers",
    "timestamp": "2025-11-08T00:55:08Z"
  },
  {
    "title": "'Suing to starve people': Trump under fire over new Supreme Court plea",
    "description": "President Donald Trump found himself under fire from critics on Friday night after his administration begged the Supreme Court on Friday night to block a ruling forcing him to fully cover food stamp benefits for tens of millions of Americans in need.Trump's t…",
    "link": "https://www.rawstory.com/trump-snap-2674276966/",
    "timestamp": "2025-11-08T00:53:25Z"
  },
  {
    "title": "Morrisey takes to the road to discuss health care efforts",
    "description": "PARKERSBURG – Improving health outcomes will lead to better economic opportunities for the state, Gov. Patrick Morrisey said Thursday in Parkersburg. Morrisey was in Parkersburg to talk to local officials about West Virginia’s application for federal governme…",
    "link": "https://www.newsandsentinel.com/zweekendnewsletter/2025/11/morrisey-takes-to-the-road-to-discuss-health-care-efforts-2/",
    "timestamp": "2025-11-08T00:53:14Z"
  },
  {
    "title": "Breaking News Live Updates: U.S. judge rules Trump illegally ordered National Guard to Portland, Oregon",
    "description": "Breaking News Live Updates: U.S. judge rules Trump illegally ordered National Guard to Portland, Oregon",
    "link": "https://m.economictimes.com/news/newsblogs/breaking-news-live-updates-november-8-2025-sir-pm-modi-delhi-weather-aqi-mumbai-bengaluru-donald-trump-israel-gaza-russia-ukraine-liveblog/liveblog/125176663.cms",
    "timestamp": "2025-11-08T00:49:25Z"
  }
]