[
  {
    "title": "Rushing to earn: Why India's Gen Z enters the workforce before it is ready",
    "description": "As India’s Gen Z rushes to earn early amid rising costs and hustle culture, data from Deloitte, the World Bank, OECD, and PLFS reveals a quieter cost. While part-time work can build skills, premature entry into low-quality jobs risks academic erosion, stress,…",
    "link": "https://timesofindia.indiatimes.com/education/careers/news/rushing-to-earn-why-indias-gen-z-enters-the-workforce-before-it-is-ready/articleshow/126946758.cms",
    "timestamp": "2026-01-21T07:17:42Z"
  },
  {
    "title": "Trump Tries to Keep Second Set of Damning Files Secret Forever",
    "description": "President Donald Trump is seeking to stop his own Justice Department from releasing a whole new set of files he’d rather keep away from public view. Trump...",
    "link": "https://www.thedailybeast.com/trump-tries-to-keep-second-set-of-damning-files-secret-forever/",
    "timestamp": "2026-01-21T07:17:34Z"
  },
  {
    "title": "Wall Street tumbles more than 2% and dollar suffers biggest fall in over a month",
    "description": "Tensions high over US threats to acquire Greenland ahead of president Donald Trump’s Davos speech",
    "link": "https://www.irishtimes.com/business/2026/01/21/wall-street-tumbles-more-than-2-and-dollar-suffers-biggest-fall-in-over-a-month/",
    "timestamp": "2026-01-21T07:15:56Z"
  },
  {
    "title": "Swedish minister: 'EU needs to step up on defence'",
    "description": "This week’s episode of Sweden in Focus Extra features an interview with Jessica Rosencrantz, Sweden's Minister for EU Affairs.",
    "link": "https://www.thelocal.se/20260121/swedish-minister-eu-needs-to-step-up-on-defence",
    "timestamp": "2026-01-21T07:14:50Z"
  },
  {
    "title": "'Your Children Will Be Ashamed': Dem Rep Tells Off Hannity On Live TV",
    "description": "<p>A Fox News segment with Tennessee state Rep. Justin Jones quickly went off the rails.</p>",
    "link": "https://www.huffpost.com/entry/sean-hannity-justin-jones-ice_n_697052eae4b06c2b973701b9",
    "timestamp": "2026-01-21T07:12:12Z"
  },
  {
    "title": "Absolute DC's K.O. Boss Battle in The Daily LITG, 21st January, 2026",
    "description": "The Absolute DC's K.O. Boss Battle was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded seventeen years ago and steeped in a his…",
    "link": "https://bleedingcool.com/comics/absolute-dcs-k-o-boss-battle-in-the-daily-litg-21st-january-2026/",
    "timestamp": "2026-01-21T07:12:08Z"
  },
  {
    "title": "Trump doubts whether NATO would defend US",
    "description": "Donald Trump has cast doubt on whether NATO would aid the US in the event of an attack Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631245-trump-doubts-nato-defense/",
    "timestamp": "2026-01-21T07:08:21Z"
  },
  {
    "title": "Israel's Netanyahu agrees to join Trump’s Board of Peace",
    "description": "Prime Minister Benjamin Netanyahu of Israel says he's agreed to join Trump’s Board of Peace. Netanyahu made the announcement Wednesday from his office.",
    "link": "https://www.wgal.com/article/israel-netanyahu-joins-trump-peace-board/70069311",
    "timestamp": "2026-01-21T07:08:14Z"
  },
  {
    "title": "RSSB Clerk Grade II, Junior Assistant recruitment 2026: Apply for 10,644 posts, direct link here",
    "description": "The Rajasthan Staff Selection Board is recruiting for Clerk Grade II and Junior Assistant positions. Over 10,000 vacancies are available across state government departments. Candidates need Class 12 and basic computer knowledge. Applications open January 15, …",
    "link": "https://timesofindia.indiatimes.com/education/news/rssb-clerk-grade-ii-junior-assistant-recruitment-2026-apply-for-10644-posts-direct-link-here/articleshow/126946958.cms",
    "timestamp": "2026-01-21T07:07:00Z"
  },
  {
    "title": "Most EU Countries Reject US Invitation to Join Board of Peace for Gaza",
    "description": "MOSCOW (Sputnik) - Most EU countries have rejected the US invitation to join the Board of Peace for Gaza, media reported on Wednesday, citing people familiar with the situation.",
    "link": "https://sputnikglobe.com/20260121/most-eu-countries-reject-us-invitation-to-join-board-of-peace-for-gaza-1123500839.html",
    "timestamp": "2026-01-21T07:06:04Z"
  },
  {
    "title": "Israel's Netanyahu agrees to join Trump's Board of Peace",
    "description": "Prime Minister Benjamin Netanyahu of Israel said Wednesday he had agreed to join U.S. President Donald Trump's Board of Peace, after his office earlier criticized makeup of the board.",
    "link": "https://www.npr.org/2026/01/21/g-s1-106641/netanyahu-join-trump-board-of-peace",
    "timestamp": "2026-01-21T07:05:31Z"
  },
  {
    "title": "Millionaires ask leaders at Davos to tax the rich",
    "description": "The letter said that a handful of those with extreme wealth are negatively influencing nearly every aspect of society.",
    "link": "https://www.businessinsider.com/millionaires-ask-davos-leaders-to-tax-rich-people-ruffalo-disney-2026-1",
    "timestamp": "2026-01-21T07:02:51Z"
  },
  {
    "title": "Davos updates: Trump speech looms as Greenland threats fuel global tension",
    "description": "The rich and powerful at Davos are bracing for President Donald Trump's speech. His threats against Greenland have sparked outcry from world leaders.",
    "link": "https://www.businessinsider.com/davos-trump-speech-wef-live-updates-jan-21-2026-1",
    "timestamp": "2026-01-21T07:00:02Z"
  },
  {
    "title": "Trump’s Foreign Policy, the Comic Book Edition",
    "description": "Writers often try to gild their tawdry times or dignify their flawed leaders with lofty literary analogies — notably, America as the New Jerusalem; Lincoln as Moses leading his people through the wilderness of the Civil War; the Kennedy White House as an inca…",
    "link": "https://www.counterpunch.org/2026/01/21/trumps-foreign-policy-the-comic-book-edition/",
    "timestamp": "2026-01-21T06:59:29Z"
  },
  {
    "title": "Israel orders Gaza families to move in first forced evacuation since ceasefire; Netanyahu agrees to join Trump’s Board of Peace",
    "description": "Israeli forces ordered dozens of Palestinian families in the southern Gaza Strip to leave their homes in the first forced evacuation since October's ceasefire, as residents and Hamas said on Tuesday the military was expanding the area it controls.",
    "link": "https://www.independent.ie/world-news/middle-east/israel-orders-gaza-families-to-move-in-first-forced-evacuation-since-ceasefire-netanyahu-agrees-to-join-trumps-board-of-peace/a1740859235.html",
    "timestamp": "2026-01-21T06:55:39Z"
  },
  {
    "title": "Air Force One turned back as it carried Trump to Davos",
    "description": "US president resumed journey to Europe on Boeing 757 that departed just after midnight on Wednesday.",
    "link": "https://www.aljazeera.com/news/2026/1/21/air-force-one-turned-back-as-it-carried-trump-to-davos",
    "timestamp": "2026-01-21T06:54:28Z"
  },
  {
    "title": "It's Donald Trump's 'world without rules' and we're living in it",
    "description": "As Donald Trump celebrates one year of his second term in the White House he is re-writing all the rules for global order and no one seems ready to stop his \"imperial ambitions\".",
    "link": "https://www.abc.net.au/news/2026-01-21/donald-trumps-year-one-lays-ground-for-new-world-order/106252232",
    "timestamp": "2026-01-21T06:53:41Z"
  },
  {
    "title": "Selected Articles: The World Economic Forum and the Juliaca, Puno, Peru Massacre of 9th of January 2023",
    "description": "The World Economic Forum and the Juliaca, Puno, Peru Massacre of 9th of January 2023\nBy Peter Koenig, January 21, 2026\nThe world is becoming every day more absurd, lawless, and criminal, and the braindead populace just lets it …\nThe post Selected Articles: Th…",
    "link": "https://www.globalresearch.ca/selected-articles-world-economic-forum-juliaca-massacre/5913067",
    "timestamp": "2026-01-21T06:51:55Z"
  },
  {
    "title": "Iran warns Trump not to take action against Khamenei",
    "description": "Iran on Tuesday warned Donald Trump not to take any action against the country's Supreme Leader Ayatollah Ali Khamenei, days after the U.S. president called for an end to the nearly 40-year reign.",
    "link": "https://www.npr.org/2026/01/21/g-s1-106639/iran-warns-trump-khamenei",
    "timestamp": "2026-01-21T06:51:25Z"
  },
  {
    "title": "Newsom’s Latest Disaster: A Davos Tantrum",
    "description": "The governor has been an unmitigated disaster for California. Why is he urging global resistance to a duly elected president? Mr. Newsom is in Davos, Switzerland this week, not for a ski holiday, but to attend the 2026 World Economic Forum (WEF) meeting. His …",
    "link": "https://freerepublic.com/focus/f-news/4363229/posts",
    "timestamp": "2026-01-21T06:41:17Z"
  },
  {
    "title": "Gold Extends Powerful Rally as Crisis Over Greenland Worsens",
    "description": "Gold extended its record rally as the crisis over Greenland and a meltdown in Japanese government debt supported haven demand.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-extends-powerful-rally-as-crisis-over-greenland-worsens",
    "timestamp": "2026-01-21T06:41:09Z"
  },
  {
    "title": "Mitsotakis heads to Davos with deep concern over geopolitical developments and the Europe–US clash",
    "description": "The Prime Minister departs this afternoon for the World Economic Forum, where he will remain until Thursday - He will then travel to Brussels for the extraordinary European Council focused on Greenland\nThe post Mitsotakis heads to Davos with deep concern over…",
    "link": "https://en.protothema.gr/2026/01/21/mitsotakis-heads-to-davos-with-deep-concern-over-geopolitical-developments-and-the-europe-us-clash/",
    "timestamp": "2026-01-21T06:40:10Z"
  },
  {
    "title": "Netanyahu to join Trump's Board of Peace",
    "description": "Prime Minister Benjamin Netanyahu says he will join US President Donald Trump's Board of Peace, composed of world leaders.",
    "link": "https://www.israelnationalnews.com/news/421235",
    "timestamp": "2026-01-21T06:40:00Z"
  },
  {
    "title": "Israel’s Netanyahu to join ‘Board of Peace’",
    "description": "This is a breaking news story.",
    "link": "https://www.aljazeera.com/news/2026/1/21/israels-netanyahu-to-join-board-of",
    "timestamp": "2026-01-21T06:35:56Z"
  },
  {
    "title": "White House vs. Brussels: Why Trump is targeting his allies",
    "description": "With a cold tone, targeted insults, and public irony, Trump’s speech marking one year in office - Less foreign policy, more power is his “message” - Greenland as a test of discipline for Europe\nThe post White House vs. Brussels: Why Trump is targeting his all…",
    "link": "https://en.protothema.gr/2026/01/21/white-house-vs-brussels-why-trump-is-targeting-his-allies/",
    "timestamp": "2026-01-21T06:35:21Z"
  },
  {
    "title": "Trump heads for Davos maelstrom over Greenland",
    "description": "France's Macron vows to stand up against 'bullies', EU promises an 'unflinching' response.",
    "link": "https://timesofmalta.com/article/trump-heads-davos-maelstrom-greenland.1122821",
    "timestamp": "2026-01-21T06:35:01Z"
  },
  {
    "title": "Trade war fears swamp Davos and how to pay for your car",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2026/01/21/trade-war-fears-swamp-davos-and-how-to-pay-for-your-car/",
    "timestamp": "2026-01-21T06:32:28Z"
  },
  {
    "title": "Azerbaijan says it agreed to join Trump's 'Board of Peace'",
    "description": "MOSCOW, Jan ‌21 (Reuters) - Azerbaijan said ‌on on Wednesday that ‌it had accepted an invitation from U.S. President Donald Trump ‍to join his \"Board ‍of Peace\". Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/21/azerbaijan-says-it-agreed-to-join-trump039s-039board-of-peace039",
    "timestamp": "2026-01-21T06:31:00Z"
  },
  {
    "title": "CNBC's UK Exchange newsletter: A diplomacy tightrope for Britain’s Starmer after Trump’s tirades",
    "description": "U.K. PM Keir Starmer is treading a fine line in diplomacy — and appears to be banking on Britain’s “special relationship” with the U.S. to deliver a compromise.",
    "link": "https://www.cnbc.com/2026/01/21/cnbcs-uk-exchange-newsletter-a-diplomacy-tightrope-for-britains-starmer-after-trumps-tirades.html",
    "timestamp": "2026-01-21T06:30:01Z"
  },
  {
    "title": "European stocks set for mixed open ahead of Trump's speech in Davos",
    "description": "European stocks are expected to open in mixed territory on Wednesday with all eyes on U.S. President Donald Trump's address at the World Economic Forum later.",
    "link": "https://www.cnbc.com/2026/01/21/european-stocks-stoxx-600-ftse-dax-trump-speech-davox-wef.html",
    "timestamp": "2026-01-21T06:28:33Z"
  },
  {
    "title": "‘If we’re not at table, we’re on menu’: At Davos, Canada PM Carney urges middle powers to unite, affirms support to Greenland",
    "description": "In a speech at the World Economic Forum in Davos, Switzerland, Carney said: \"Middle powers must act together because if we're not at the table, we're on the menu.\"",
    "link": "https://indianexpress.com/article/world/davos-canada-carney-greenland-donald-trump-us-10486147/",
    "timestamp": "2026-01-21T06:26:44Z"
  },
  {
    "title": "EU Has Two Tools to Counter US Pressure, But Lacks Unity and Guts – French Politician",
    "description": "The EU is reportedly weighing its so-called “bazooka” option—the Anti-Coercion Instrument (ACI)—after Washington slapped tariffs over Greenland, with France leading the initiative. But are they really ready to take on the US?",
    "link": "https://sputnikglobe.com/20260121/eu-has-two-tools-to-counter-us-pressure-but-lacks-unity-and-guts--french-politician-1123497533.html",
    "timestamp": "2026-01-21T06:21:00Z"
  },
  {
    "title": "Navy admiral removed by Hegseth announces run for Congress",
    "description": "A senior Navy official removed from her post by Defense Secretary Pete Hegseth last year is running for Congress. Nancy Lacore, who served in the Navy for 35 years as a Navy helicopter pilot, three-star admiral and the chief of the Navy Reserve, announced a r…",
    "link": "https://freerepublic.com/focus/f-news/4363226/posts",
    "timestamp": "2026-01-21T06:13:22Z"
  },
  {
    "title": "Allianz Executive Pushes EU to Pressure US With Market Volatility",
    "description": "European policymakers should fuel market turbulence to pressure US President Donald Trump to back down from his Greenland claim, according to a senior executive at Allianz Global Investors. “If I were an adviser to some European governments, I would say …",
    "link": "https://www.insurancejournal.com/news/international/2026/01/21/854902.htm",
    "timestamp": "2026-01-21T06:05:43Z"
  },
  {
    "title": "Mexico sends 37 cartel members to US in latest offer to Trump administration",
    "description": "Mexico's security minister says the country has sent 37 more cartel members to the United States",
    "link": "https://abcnews.go.com/US/wireStory/mexico-sends-37-cartel-members-us-latest-offer-129390808",
    "timestamp": "2026-01-21T06:05:27Z"
  },
  {
    "title": "Mexico sends 37 more drug cartel suspects to US amid Trump attack threats",
    "description": "Mexican Security Minister Omar Garcia Harfuch says the US promised that suspects will not face the death penalty.",
    "link": "https://www.aljazeera.com/news/2026/1/21/mexico-sends-37-more-drug-cartel-suspects-to-us-amid-trump-attack-threats",
    "timestamp": "2026-01-21T06:05:02Z"
  },
  {
    "title": "Stephen Colbert’s Studio Audience Erupts In Boos Over Anniversary of Trump’s 2nd Term | Video",
    "description": "\"Every single day there's some new Trump horror dominating the headlines,\" the late night host says\nThe post Stephen Colbert’s Studio Audience Erupts In Boos Over Anniversary of Trump’s 2nd Term | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/stephen-colbert-trump-anniversary-second-term-audience-boos/",
    "timestamp": "2026-01-21T06:04:38Z"
  },
  {
    "title": "‘I Have Very Firm Instructions’: Trump Makes Clear What Happens To Iran If He’s Assassinated",
    "description": "President Donald Trump told NewsNation host Katie Pavlich that he left instructions to wipe Iran “off the face of this earth” if he were to be assassinated.",
    "link": "https://dailycaller.com/2026/01/21/i-have-very-firm-instructions-trump-makes-clear-what-happens-to-iran-if-hes-assassinated/",
    "timestamp": "2026-01-21T06:02:49Z"
  },
  {
    "title": "Trumps Crypto Empire: One-Fifth Of Family’s $6.8B Fortune Tied To Digital Assets",
    "description": "A year into his presidency, US President Donald Trump and his family have reportedly seen a notable shift in their wealth distribution, with a growing concentration of crypto ventures linked to the presidential family. Related Reading: Hong Kong Professionals…",
    "link": "https://bitcoinist.com/trump-crypto-empire-one-fifth-familys-6-8b-fortune/",
    "timestamp": "2026-01-21T06:00:38Z"
  },
  {
    "title": "Satoshi Nakamoto’s BTC stash – 17 years later, how much is it worth?",
    "description": "Seventeen years of untouched Bitcoin outweighs any single week of tariffs, sell-offs, or headline-driven volatility.",
    "link": "https://ambcrypto.com/satoshi-nakamotos-btc-stash-17-years-later-how-much-is-it-worth/",
    "timestamp": "2026-01-21T06:00:32Z"
  },
  {
    "title": "Judge Allows Virginia Offshore Wind Project to Restart in Another Setback for Trump",
    "description": "A federal judge on Friday cleared U.S. power company Dominion Energy to resume work on its Virginia offshore wind project, the third legal blow this week to President Donald Trump’s anti-offshore wind agenda. Judge Jamar Walker of the U.S. District …",
    "link": "https://www.insurancejournal.com/news/east/2026/01/21/854924.htm",
    "timestamp": "2026-01-21T06:00:31Z"
  },
  {
    "title": "Michael McDowell: The worse Trump behaves, the more room there is for optimism",
    "description": "Are the scales of Maga delusion finally falling from the eyes of Trump voters?",
    "link": "https://www.irishtimes.com/opinion/2026/01/21/michael-mcdowell-the-worse-trump-behaves-the-more-room-there-is-for-optimism/",
    "timestamp": "2026-01-21T06:00:01Z"
  },
  {
    "title": "The EU should channel Michael O’Leary when dealing with Trump",
    "description": "EU needs to watch and learn from Michael O’Leary’s  interactions with Donald Trump and Elon Musk",
    "link": "https://www.irishtimes.com/business/2026/01/21/the-eu-should-channel-michael-oleary-when-dealing-with-trump/",
    "timestamp": "2026-01-21T06:00:01Z"
  },
  {
    "title": "Time for EU to put the tariffs bazooka on the table",
    "description": "EU needs to watch and learn from Michael O’Leary’s  interactions with Donald Trump and Elon Musk",
    "link": "https://www.irishtimes.com/business/2026/01/21/time-for-eu-to-put-the-tariffs-bazooka-on-the-table/",
    "timestamp": "2026-01-21T06:00:01Z"
  },
  {
    "title": "Macron accuses Trump of trying to ‘subordinate’ Europe in pursuit of Greenland",
    "description": "EU leaders preparing diplomatic blitz in Davos to lobby US president to retract Greenland and tariff threats",
    "link": "https://www.irishtimes.com/politics/2026/01/21/macron-accuses-trump-of-trying-to-subordinate-europe-in-pursuit-of-greenland/",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "Trump’s new ‘Peace Council’ invites Putin and other controversial billionaires to carve up Gaza’s ruins",
    "description": "U.S. President Donald Trump is assembling a so-called “board of peace” to oversee the reconstruction of the Gaza Strip. This initiative, revealed to be a costly, expansive international body, has extended an invitation to Russian President Vladimir Putin, a l…",
    "link": "https://www.naturalnews.com/2026-01-21-trump-peace-council-putin-carve-up-gazas-ruins.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "Miriam Lord: Three more Trump years to go? For God’s sake, Holly, don’t be reminding us",
    "description": "US president’s increasingly disturbing behaviour dominates Leaders’ Questions in the Dáil",
    "link": "https://www.irishtimes.com/politics/oireachtas/2026/01/21/three-more-trump-years-to-go-for-gods-sake-holly-dont-be-reminding-us/",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "Macron urges G7 to build bridges with BRICS as Trump’s Greenland push fractures the West",
    "description": "French President Macron criticizes Trump’s foreign policy as bullying at Davos. He urges the G7 to cooperate with the BRICS bloc instead of confronting it. Trump’s threats over Greenland and tariffs are pushing allies toward new alliances. BRICS nations demon…",
    "link": "https://www.naturalnews.com/2026-01-21-macron-g7-brics-trump-greenland.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "U.S. shifts Syria policy: Ends support for Kurds, backs new Damascus government",
    "description": "The Trump administration shifts policy, withdrawing military aid from Syria’s Kurdish-led Syrian Democratic Forces (SDF) in favor of the new Syrian government under President Ahmed al-Sharaa. U.S. Special Envoy Tom Barrack justifies the move, citing al-Sharaa…",
    "link": "https://www.naturalnews.com/2026-01-21-us-ends-kurds-support-backs-damascus-government.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "Inside the world of Nicola Peltz: the ‘strong’ woman at the heart of the Beckham row",
    "description": "As Brooklyn Beckham unleashes an explosive statement about his feud with the rest of his family, Katie Rosseinsky takes a look at his actor wife, Nicola, and what her background and previous romantic relationships tell us about her – and him",
    "link": "https://www.the-independent.com/life-style/nicola-peltz-brooklyn-beckham-family-feud-statement-b2903973.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "A new car doesn’t have to mean falling into a debt trap",
    "description": "Buying too much car can lead to big money problems. Here’s how to avoid them",
    "link": "https://www.irishtimes.com/your-money/2026/01/21/a-new-car-doesnt-have-to-mean-falling-into-a-debt-trap/",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "Zelensky prolonging war, refusing elections – now reinstated as DICTATOR",
    "description": "In a stark confrontation over the future of Ukraine, former U.S. President Donald Trump has directly challenged Ukrainian leader Volodymyr Zelensky, accusing him of being the primary obstacle to peace. As Zelensky warns of an imminent “massive” Russian strike…",
    "link": "https://www.naturalnews.com/2026-01-21-zelensky-prolonging-war-refusing-elections-reinstated-as-dictator.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "The Coming Showdown: Trump’s Insurrection Act Gambit and America’s Final Tribal War",
    "description": "Introduction: The Final Battle for America’s Soul According to insider reports, President Donald Trump is preparing to declare victory on November 5th and then immediately invoke the Insurrection Act upon taking office in January 2025. This will complete a po…",
    "link": "https://www.naturalnews.com/2026-01-21-trumps-insurrection-act-gambit-americas-final-tribal-war.html",
    "timestamp": "2026-01-21T06:00:00Z"
  },
  {
    "title": "A look at Trump's Board of Peace and who has been invited",
    "description": "The Board of Peace led by U.S. President Donald Trump was originally envisioned as a small group of world leaders overseeing the Gaza ceasefire plan",
    "link": "https://abcnews.go.com/International/wireStory/trumps-board-peace-invited-129393897",
    "timestamp": "2026-01-21T05:57:24Z"
  },
  {
    "title": "Trump heads for Davos maelstrom over Greenland",
    "description": "U.S. President Donald Trump descends on Davos for a showdown with European leaders Wednesday as his bid to seize Greenland threatens to tear the transatlantic alliance apart.",
    "link": "https://www.hurriyetdailynews.com/trump-heads-for-davos-maelstrom-over-greenland-218056",
    "timestamp": "2026-01-21T05:55:27Z"
  },
  {
    "title": "Stopping Wall Street from Competing with Main Street Homebuyers (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nStopping Wall Street from Competing with Main Street Homebuyers  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1. …",
    "link": "https://www.memeorandum.com/260121/p4",
    "timestamp": "2026-01-21T05:50:00Z"
  },
  {
    "title": "Türkiye 'closely' following situation in Syria, Erdoğan tells Trump",
    "description": "President Recep Tayyip Erdoğan and his U.S. counterpart Donald Trump held a phone call Tuesday to discuss bilateral ties and regional and global issues, Türkiye's Communications Directorate said.",
    "link": "https://www.hurriyetdailynews.com/turkiye-closely-following-situation-in-syria-erdogan-tells-trump-218054",
    "timestamp": "2026-01-21T05:46:34Z"
  },
  {
    "title": "Gold outpaces silver with 5% rally today. What should investors do?",
    "description": "Gold prices have reached new record highs on the MCX. This surge is fueled by safe-haven buying due to geopolitical tensions and a weak rupee. Experts believe the upward trend will continue, supported by global factors.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-outpaces-silver-with-5-rally-today-what-should-investors-do/articleshow/126936257.cms",
    "timestamp": "2026-01-21T05:38:26Z"
  },
  {
    "title": "Trump row over Greenland derails Ukraine postwar deal, FT reports",
    "description": "Jan 21 (Reuters) - ‌European opposition to ‌U.S. President Donald ‌Trump's bid to acquire Greenland and his proposed \"Board of ‍Peace\" initiative ‍has disrupted plans ‌for an economic support ‍package ​for postwar Ukraine, the ⁠Financial Times reported on Wed…",
    "link": "https://www.thestar.com.my/news/world/2026/01/21/trump-row-over-greenland-derails-ukraine-postwar-deal-ft-reports",
    "timestamp": "2026-01-21T05:37:00Z"
  },
  {
    "title": "NZ sharemarket drops a whopping 1.15% - Market close",
    "description": "The S&P/NZX 50 Index dropped 1.15%, its sharpest fall in two months.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/nz-sharemarket-drops-a-whopping-115-market-close/premium/5T6TOSC53RCZ7FIKEPM6CWAUWE/",
    "timestamp": "2026-01-21T05:36:05Z"
  },
  {
    "title": "Iran's top diplomat issues most direct threat yet to US",
    "description": "Iranian state TV has issued the first official death toll from recent protests, saying 3,117 people were killed in the demonstrations that began Dec. 28. The figure is lower than the 4,560 people activists say died. State television on Wednesday night carried…",
    "link": "https://apnews.com/article/iran-protests-araghchi-trump-threat-crackdown-299375ebfd004dd6098c77a6bb8079a5",
    "timestamp": "2026-01-21T05:34:47Z"
  },
  {
    "title": "Trump - no more Mr. Nice Guy",
    "description": "Trump wants Greenland, and since I am a betting man, my money says he is going to get it one way or another. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421231",
    "timestamp": "2026-01-21T05:34:00Z"
  },
  {
    "title": "After Minneapolis, Democrats confront political vulnerabilities to battle Trump on immigration",
    "description": "Democrats are rethinking their midterm election strategy due to the controversial immigration crackdown in Minnesota",
    "link": "https://abcnews.go.com/Politics/wireStory/after-minneapolis-democrats-confront-political-vulnerabilities-battle-trump-129409178",
    "timestamp": "2026-01-21T05:33:51Z"
  },
  {
    "title": "Bitcoin search, social chatter slumped in 2025 despite record prices",
    "description": "Bitcoiner Jameson Lopp shared data on Tuesday showing that the number of X posts containing the word “Bitcoin” fell by around a third in 2025 compared to 2024.",
    "link": "https://cointelegraph.com/news/bitcoin-x-posts-google-searches-fell-2025",
    "timestamp": "2026-01-21T05:30:58Z"
  },
  {
    "title": "Markets tumble as Canada’s prime minister Mark Carney announces death of ‘rules-based order’",
    "description": "The dollar fell, stocks tumbled and gold hit fresh highs yesterday as US president Donald Trump doubled down on threats to annex Greenland from Nato-ally Denmark. US borrowing costs also rose.",
    "link": "https://www.independent.ie/business/markets-tumble-as-canadas-prime-minister-mark-carney-announces-death-of-rules-based-order/a896473011.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Ireland will urge EU to deploy trade ‘big bazooka’ only if diplomacy fails, as Taoiseach warns of major job losses",
    "description": "?Ireland remains cautious about deploying the so-called “big bazooka” economic mechanism against the US, despite Europe moving closer to using the trade weapon in response to threats to take Greenland.",
    "link": "https://www.independent.ie/irish-news/ireland-will-urge-eu-to-deploy-trade-big-bazooka-only-if-diplomacy-fails-as-taoiseach-warns-of-major-job-losses/a1740416864.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "ICE agents drag US citizen wearing only shorts into street in –10C temperatures",
    "description": "A Minnesota man said he felt fear, shame and desperation a day after ICE officers broke down his door with guns drawn, handcuffed him and dragged him into the snow wearing shorts and Crocs.",
    "link": "https://www.independent.ie/world-news/north-america/ice-agents-drag-us-citizen-wearing-only-shorts-into-street-in-10c-temperatures/a770537273.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Europe rethinks role in ‘disaster’ US co-ordination centre in Gaza",
    "description": "Several European countries are considering whether to stop sending personnel to a US military-led co-ordination centre for Gaza, saying it has failed to increase aid flows to the war-shattered enclave or achieve political change.",
    "link": "https://www.independent.ie/world-news/europe-rethinks-role-in-disaster-us-co-ordination-centre-in-gaza/a1927372236.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Europe cannot allow itself to be bullied as old alliances crumble",
    "description": "One might have a degree of sympathy for Europe’s leaders, for what exactly are the political protocols for conversing with a fire-eater? Every time US president ­Donald Trump opens his mouth, they appear to get scorched.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-europe-cannot-allow-itself-to-be-bullied-as-old-alliances-crumble/a10165681.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Russians are weaponising the safety of Chernobyl nuclear plant – Zelensky says",
    "description": "Russian attacks on Ukraine’s energy system threaten nuclear safety and show Moscow is using the risk of nuclear disaster as a tool of coercion, Kyiv’s foreign minister said yesterday after the UN’s atomic watchdog said substations vital for nuclear safety wer…",
    "link": "https://www.independent.ie/world-news/europe/russians-are-weaponising-the-safety-of-chernobyl-nuclear-plant-zelensky-says/a1968397678.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "John Downing: Ireland is at the mercy of a bully until we get our defences in order",
    "description": "You have no head at all if you’re not worried by the globe’s number-one self-absorbed bully, Donald J Trump. And you have no heart if you are not distressed by his antics, which have damaged many lives in the US and across the world.",
    "link": "https://www.independent.ie/opinion/comment/john-downing-ireland-is-at-the-mercy-of-a-bully-until-we-get-our-defences-in-order/a614961986.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Letters: Europe has nothing to lose in standing up to threats from supposed ‘partner’",
    "description": "Neither Ireland nor the rest of Europe should follow the US ­Congressional playbook of not standing up to ­Donald Trump’s coercion and threats.",
    "link": "https://www.independent.ie/opinion/letters/letters-europe-has-nothing-to-lose-in-standing-up-to-threats-from-supposed-partner/a1255147213.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Ireland will urge EU to deploy trade ‘big bazooka’ only if diplomacy fails, as Taoiseach warns of major job losses",
    "description": "?Ireland remains cautious about deploying the so-called “big bazooka” economic mechanism against the US, despite Europe moving closer to using the trade weapon in response to threats to take Greenland.",
    "link": "https://www.independent.ie/irish-news/politics/ireland-will-urge-eu-to-deploy-trade-big-bazooka-only-if-diplomacy-fails-as-taoiseach-warns-of-major-job-losses/a1740416864.html",
    "timestamp": "2026-01-21T05:30:00Z"
  },
  {
    "title": "Trump is on his way to Davos, where his quest to own Greenland could overshadow his other goals",
    "description": "President Donald Trump is insisting that he wants to “get Greenland, including right, title and ownership.”.",
    "link": "https://www.news4jax.com/news/world/2026/01/21/trump-is-on-his-way-to-davos-where-his-quest-to-own-greenland-could-overshadow-his-other-goals/",
    "timestamp": "2026-01-21T05:27:25Z"
  },
  {
    "title": "Trump is on his way to Davos, where his quest to own Greenland could overshadow his other goals",
    "description": "President Donald Trump is heading to the World Economic Forum in the Swiss Alps where his ambitions to wrest control of Greenland from NATO ally Denmark could tear relations with European allies.",
    "link": "https://www.clickondetroit.com/news/world/2026/01/21/trump-is-on-his-way-to-davos-where-his-quest-to-own-greenland-could-overshadow-his-other-goals/",
    "timestamp": "2026-01-21T05:27:21Z"
  },
  {
    "title": "Asian shares fall, gold prices hit a record on Trump's tariff threats",
    "description": "U.S. futures are higher and world shares are mixed ahead of U.S. President Donald Trump’s speech to the World Economic Forum in Davos, Switzerland. Markets appeared to steady somewhat after gyrating following Trump’s threats to slap higher tariffs on eight Eu…",
    "link": "https://apnews.com/article/stocks-markets-trump-bonds-gold-82e0341ef60b2719d79e1631e006bfed",
    "timestamp": "2026-01-21T05:27:09Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang plans China trip amid push to reopen key market — Check out his itinerary",
    "description": "The China visit — a trip that Huang regularly takes at this time of year — comes at a pivotal moment for the world’s most valuable company. The US is loosening export restrictions on AI processors, letting Nvidia sell its H200 model in the Asian nation.",
    "link": "https://www.livemint.com/companies/people/nvidia-ceo-jensen-huang-plans-china-trip-amid-push-to-reopen-key-market-check-out-his-itinerary-11768972492003.html",
    "timestamp": "2026-01-21T05:26:58Z"
  },
  {
    "title": "Rs 6 lakh crore gone! Sensex crashes 1,000 points, Nifty below 25,000 for first time since Oct. 5 factors behind today's market meltdown",
    "description": "Sensex Crash Today: Indian equities experienced a significant selloff for the third consecutive session, with the BSE Sensex and Nifty 50 tumbling due to global uncertainties and weak domestic earnings. Escalating tensions from U.S. President Trump's threats,…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-rs-3-lakh-crore-gone-sensex-cracks-over-700-points-nifty-below-25100-5-key-factors-behind-the-stock-market-fall-today/articleshow/126933526.cms",
    "timestamp": "2026-01-21T05:22:07Z"
  },
  {
    "title": "Midnight Mania! White, Paul Share Awkward Encounter With Trump Watching On",
    "description": "Welcome to Midnight Mania! Let’s start the night off by taking a look back over the three biggest stories of Tuesday, Jan. 20, 2026. Insomnia Dana White and Jake Paul had an interesting face-to-face meeting during Monday’s college football championship, as Pr…",
    "link": "https://www.mmamania.com/midnight-mmamania-news/414168/midnight-mania-president-trump-looks-on-as-dana-white-jake-paul-share-awkward-face-to-face-encounter-at-cfp-championship-video",
    "timestamp": "2026-01-21T05:19:15Z"
  },
  {
    "title": "Trump signs order to ban Wall Street investors from buying single-family homes - What this means",
    "description": "The executive order details a multi-part process designed to limit institutional home purchases, though stops short of immediately implementing new rules or regulations that would tie the hands of companies with significant housing portfolios.",
    "link": "https://www.livemint.com/industry/infrastructure/trump-signs-order-to-ban-wall-street-investors-from-buying-single-family-homes-what-this-means-11768971298279.html",
    "timestamp": "2026-01-21T05:18:08Z"
  },
  {
    "title": "US trade with Southeast Asia and Taiwan surging despite Trump tariffs",
    "description": "While trade data show exports from China have fallen dramatically, US customers are still buying from elsewhere.",
    "link": "https://www.aljazeera.com/news/2026/1/21/us-trade-with-southeast-asia-and-taiwan-surging-despite-trump-tariffs",
    "timestamp": "2026-01-21T05:18:06Z"
  },
  {
    "title": "US futures edge higher and gold hits another record as markets swoon over Greenland dispute",
    "description": "Asian shares have extended their losses while gold prices hit a record high as concerns over U.S. President Donald Trump’s tariff threats on Greenland fueled unease among investors",
    "link": "https://abcnews.go.com/Business/wireStory/us-futures-edge-higher-gold-hits-record-markets-129408758",
    "timestamp": "2026-01-21T05:17:42Z"
  },
  {
    "title": "US futures edge higher and gold hits another record as markets swoon over Greenland dispute",
    "description": "Asian shares have extended their losses while gold prices hit a record high as concerns over U.S. President Donald Trump’s tariff threats on Greenland fueled unease among investors",
    "link": "https://abcnews.go.com/US/wireStory/us-futures-edge-higher-gold-hits-record-markets-129408757",
    "timestamp": "2026-01-21T05:17:41Z"
  },
  {
    "title": "Azerbaijan says it agreed to join Trump’s ‘Board of Peace’",
    "description": "MOSCOW, Jan 21 (Reuters) - Azerbaijan said on on Wednesday that it had accepted an invitation from U.S. President Donald Trump to join his “Board of Peace”.“Azerbaijan, a… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/21/azerbaijan-says-it-agreed-to-join-trump-s-board-of-peace",
    "timestamp": "2026-01-21T05:17:26Z"
  },
  {
    "title": "Gov Whitmer says America 'ready for a woman president,' contrasting Michelle Obama",
    "description": "Michigan Gov. Gretchen Whitmer said she disagrees with former first lady Michelle Obama's claim that America is not ready for a woman president.",
    "link": "https://www.foxnews.com/politics/gov-whitmer-says-america-ready-woman-president-contrasting-michelle-obama",
    "timestamp": "2026-01-21T05:15:49Z"
  },
  {
    "title": "Trump undermines key allies UK and France before Davos visit",
    "description": "United States President Donald Trump has doubled down on his bid to take over Greenland before his appearance at the World Economic Forum in Davos, Switzerland, by slamming key allies. Trump shared private text messages from French President Emmanuel Macron a…",
    "link": "https://thechronicle.com.gh/trump-undermines-key-allies-uk-and-france-before-davos-visit/",
    "timestamp": "2026-01-21T05:14:51Z"
  },
  {
    "title": "Man who assassinated former Japanese leader Abe is sentenced to life in prison",
    "description": "A Japanese court on Wednesday sentenced a 45-year-old man to life imprisonment for fatally shooting former Prime Minister Shinzo Abe, public broadcaster NHK reported, in an incident that stunned the nation three and a half years ago.",
    "link": "https://www.nbcnews.com/world/asia/man-assassinated-former-japanese-leader-abe-sentenced-life-prison-rcna255140",
    "timestamp": "2026-01-21T05:13:10Z"
  },
  {
    "title": "After Trump Salvo, Macron Says: We Don't Give In To Bullies",
    "description": "France, and Europe, will not \"passively accept the law of the strongest,\" French President Emmanuel Macron said at the World Economic Forum in Davos.",
    "link": "https://www.huffpost.com/entry/trump-macron-bullies-davos_n_69705e13e4b0559a8591aff8",
    "timestamp": "2026-01-21T05:09:01Z"
  },
  {
    "title": "Nigerian police confirm gunmen abducted villagers, after initial denials",
    "description": "The head of a Christian church alliance says 172 people were kidnapped by armed men, and that nine later escaped.",
    "link": "https://www.aljazeera.com/news/2026/1/21/nigerian-police-confirm-gunmen-abducted-villagers-after-initial-denials",
    "timestamp": "2026-01-21T05:07:04Z"
  },
  {
    "title": "Why Donald Trump always thanks you ‘for your attention to this matter’",
    "description": "How a simple catchphrase sums up the US president’s theory of executive power",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/15/books/review/trump-thank-you-for-your-attention-to-this-matter.html",
    "timestamp": "2026-01-21T05:07:00Z"
  },
  {
    "title": "Trump laid out his plans to restrict institutional housing investors — with some notable carveouts",
    "description": "The order comes with a carveout: build-to-rent properties that were designed to be rental communities will not be affected.",
    "link": "https://www.businessinsider.com/trump-laid-out-his-plans-to-restrict-institutional-housing-investors-2026-1",
    "timestamp": "2026-01-21T05:05:51Z"
  },
  {
    "title": "How Greenland Could Destroy Half the World",
    "description": "President Donald Trump is freaking out Europe and Canada for no good reason.\nThe post How Greenland Could Destroy Half the World appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/how-greenland-could-destroy-half-the-world/",
    "timestamp": "2026-01-21T05:05:00Z"
  },
  {
    "title": "Trump’s Comic Book Foreign Policy",
    "description": "'How to Read Donald Duck,' that classic guide to U.S. cultural imperialism in Latin America: there was always more to a Disney comic than gags.",
    "link": "https://www.juancole.com/2026/01/trumps-comic-foreign-policy.html",
    "timestamp": "2026-01-21T05:04:29Z"
  },
  {
    "title": "Determined to seize Greenland, Trump faces tough reception in Davos",
    "description": "WASHINGTON, Jan 21 (Reuters) - U.S. President Donald Trump barrels into Davos, Switzerland, on Wednesday, and he is likely to use the World Economic Forum to escalate his… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/21/determined-to-seize-greenland-trump-faces-tough-reception-in-davos",
    "timestamp": "2026-01-21T05:03:38Z"
  },
  {
    "title": "Switzerland-Bound Air Force One Forced To Turn Back Due To ‘Minor’ Issue—Trump Will Take Backup Jet",
    "description": "The White House said the president’s scheduled trip to Davos will not be affected, as he and his team will fly on an alternate jet.",
    "link": "https://www.forbes.com/sites/siladityaray/2026/01/21/switzerland-bound-air-force-one--forced-to-turn-back-due-to-minor-issue-trump-will-take-backup-jet/",
    "timestamp": "2026-01-21T05:02:54Z"
  },
  {
    "title": "Trump Gives Head-Scratching Answer About 2026 Agenda: ‘Water Coming Out of a Sink’",
    "description": "President Donald Trump gave a head-scratching answer about \"water coming out of a sink\" on Tuesday after he was asked what was on his agenda for 2026.\nThe post Trump Gives Head-Scratching Answer About 2026 Agenda: ‘Water Coming Out of a Sink’ first appeared o…",
    "link": "https://www.mediaite.com/media/tv/trump-gives-head-scratching-answer-about-2026-agenda-water-coming-out-of-a-sink/",
    "timestamp": "2026-01-21T05:00:50Z"
  }
]