[
  {
    "title": "Sales of Many Hemp-Made THC Drinks Blocked in Spending Bill - Bloomberg.com",
    "description": "Sales of Many Hemp-Made THC Drinks Blocked in Spending BillBloomberg.com Donald Trump signs THC ban, dealing blow to Texas hemp industryHouston Chronicle Congress tightens THC restrictions on hemp, closing farm bill loopholeThe Washington Post The bill to reo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180064042",
    "timestamp": "2025-11-13T15:12:58Z"
  },
  {
    "title": "Trump Hosts Al Nusra Terrorist at the White House. History of U.S. Sponsored “Religious Fundamerntalism” and “Regime Change”",
    "description": "Yesterday’s meeting at the White House between President Trump and Syria’s new President Ahmed al-Sharaa was simply a continuation of a policy first conjured up by Carter National Security Advisor and Rockefeller lieutenant Zbigniew Brzezinski.\nThe post Trump…",
    "link": "https://www.globalresearch.ca/trump-hosts-al-nusra-terrorist-white-house/5905577",
    "timestamp": "2025-11-13T15:11:13Z"
  },
  {
    "title": "‘Humiliated’ transgender TSA officer sues Kristi Noem after being prevented from doing her job",
    "description": "A trans Transportation Security Administration (TSA) officer has filed a federal lawsuit against Kristi Noem after an executive order prevented her from doing an important part of her job.  Vocal opponent of LGBTQ+ rights, Kristi Noem, saw her loyalty to Trum…",
    "link": "https://www.thepinknews.com/2025/11/13/humiliated-transgender-tsa-officer-sues-kristi-noem-after-being-prevented-from-doing-her-job/",
    "timestamp": "2025-11-13T15:10:42Z"
  },
  {
    "title": "Makhachev 'cools' fight with Topuria and Khabib Nurmagomedov is not thinking about the White House",
    "description": "The possible fight with Ilia Topuria (17-0) was one of the usual questions presented at the &apos;Media Day&apos; of UFC 322 to Islam Makhachev (27-1). However, the Dagestani, who",
    "link": "https://www.marca.com/en/ufc/2025/11/13/6915f309268e3e286e8b45a0.html",
    "timestamp": "2025-11-13T15:08:14Z"
  },
  {
    "title": "Lawrence O’Donnell Explains Exactly Why And How Trump May Lose His Biggest Fight Yet",
    "description": "Democrats on the House Oversight Committee recently released some damning messages involving the president.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-trump-may-lose-biggest-fight-jeffrey-epstein_n_6915bb97e4b0dd708f396bab",
    "timestamp": "2025-11-13T15:08:11Z"
  },
  {
    "title": "Elon Musk Backs Rep. Byron Donalds as Next Governor of Florida",
    "description": "Former Department of Government Efficiency (DOGE) head Elon Musk has formally endorsed Rep. Byron Donalds (R-FL) to be the next governor of Florida.\nThe post Elon Musk Backs Rep. Byron Donalds as Next Governor of Florida appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/13/elon-musk-backs-rep-byron-donalds-as-next-governor-of-florida/",
    "timestamp": "2025-11-13T15:07:58Z"
  },
  {
    "title": "Trump Wants Immigrants—Sometimes",
    "description": "The president is alarming the MAGA faithful by saying he wants more high-skilled immigration. But that doesn’t mean he’s rethinking the rest of his nativism.",
    "link": "https://reason.com/2025/11/13/trump-wants-immigrants-sometimes/",
    "timestamp": "2025-11-13T15:07:11Z"
  },
  {
    "title": "Trump stan Nicki Minaj shares anti-trans White House post set to ‘Va Va Voom’",
    "description": "In her latest show of support for Donald Trump, Nicki Minaj has shared an anti-trans White House post set to her “Va Va Voom” song.  The rapper, who at the start of the month responded after being criticised by LGBTQ+ fans for sharing a post praising Donald T…",
    "link": "https://www.thepinknews.com/2025/11/13/trump-stan-nicki-minaj-shares-anti-trans-white-house-post-set-to-va-va-voom/",
    "timestamp": "2025-11-13T15:05:37Z"
  },
  {
    "title": "The right’s war on the poor hits a new low with attack on legal aid",
    "description": "Millions of dollars that would have gone to support legal aid programs are frozen. The cuts are already having a big and destructive impact.",
    "link": "https://www.ncspin.com/the-rights-war-on-the-poor-hits-a-new-low-with-attack-on-legal-aid",
    "timestamp": "2025-11-13T15:04:17Z"
  },
  {
    "title": "The Elections Were a Referendum on Energy—And Democrats Won",
    "description": "On the campaign trail in 2024, President Donald Trump promised to halve Americans’ energy bills by January 2026.  After his win, his administration pushed policies that undoubtedly contributed to their rise. They tried to squash cheap, local energy from renew…",
    "link": "https://www.motherjones.com/politics/2025/11/democrats-elections-energy-electricity-power-bills/",
    "timestamp": "2025-11-13T15:03:59Z"
  },
  {
    "title": "'Dummy alert': Trump aide rages against 'stupidest member of Congress' for explosive claim",
    "description": "President Donald Trump's communications chief Steven Cheung posted a furious tirade to X after Rep. Melanie Stansbury (D-NM) called out the president's efforts to conceal the Jeffrey Epstein sex trafficking case files in an interview this week.The controversy…",
    "link": "https://www.rawstory.com/steven-cheung-2674291897/",
    "timestamp": "2025-11-13T15:03:40Z"
  },
  {
    "title": "Sean Hannity Learns All About The Epstein Files!",
    "description": "With the help of liberal radio superhero Stephanie Miller.",
    "link": "https://www.wonkette.com/p/sean-hannity-learns-all-about-the",
    "timestamp": "2025-11-13T15:03:24Z"
  },
  {
    "title": "IRS announces 401(k) catch-up contributions for 2026, raises cap",
    "description": "The IRS has announced the 401(k) catch-up contribution limits for 2026. Here’s what investors need to know.",
    "link": "https://www.cnbc.com/2025/11/13/401-k-catch-up-contribution-limits-2026.html",
    "timestamp": "2025-11-13T15:02:50Z"
  },
  {
    "title": "IRS unveils 2026 IRA contribution limits, raises savings cap",
    "description": "The IRS has announced the IRA contribution limits for 2026. Here’s what savers need to know.",
    "link": "https://www.cnbc.com/2025/11/13/2026-ira-contribution-limits-irs.html",
    "timestamp": "2025-11-13T15:02:43Z"
  },
  {
    "title": "IRS announces 2026 401(k) contribution limits, raises savings cap",
    "description": "The IRS has announced higher 401(k) contribution limits for 2026. Here’s what savers need to know.",
    "link": "https://www.cnbc.com/2025/11/13/401-k-contribution-limits-2026.html",
    "timestamp": "2025-11-13T15:02:36Z"
  },
  {
    "title": "Donald Trump’s disapproval rating jumps to 58 percent: Poll",
    "description": "The poll also shows 44 percent of Democrats were 'very enthusiastic' about voting in the 2026 midterm elections.",
    "link": "https://www.aljazeera.com/news/2025/11/13/donald-trumps-disapproval-rating-jumps-to-58-percent-poll",
    "timestamp": "2025-11-13T15:01:42Z"
  },
  {
    "title": "Clinton bashes Pentagon's America First reset as a 'disaster'",
    "description": "Hillary Clinton and Mike Pompeo find rare common ground, rejecting Pentagon's spheres of influence strategy that could benefit China and Russia globally.",
    "link": "https://www.foxnews.com/politics/clinton-pompeo-unite-against-pentagon-spheres-influence-say-would-help-china-russia-gain-power",
    "timestamp": "2025-11-13T15:01:40Z"
  },
  {
    "title": "Russia vows to 'fully act' as US sends warships to Venezuela...",
    "description": "Russia has pledged to be 'ready' to help Venezuela as the US continues to reinforce its military presence near the South American nation",
    "link": "https://www.the-express.com/news/world-news/190436/russia-vows-fully-act-us-sends-warships-venezuela-amid-ww3-fears",
    "timestamp": "2025-11-13T15:00:20Z"
  },
  {
    "title": "A bipartisan group of former FCC commissioners wants to take away Brendan Carr’s biggest weapon against journalism",
    "description": "Brendan Carr shouldn’t be able to do what he’s been doing at the Federal Communications Commission. That’s the argument put forth by seven former FCC commissioners — five of them Republicans — after seeing Carr dig up a rarely used old policy to twist the med…",
    "link": "https://www.niemanlab.org/2025/11/a-bipartisan-group-of-former-fcc-commissioners-wants-to-take-away-brendan-carrs-biggest-weapon-against-journalism/",
    "timestamp": "2025-11-13T15:00:13Z"
  },
  {
    "title": "Gunboats and Drones: Trump’s Dangerous New Monroe Doctrine in the Caribbean",
    "description": "The United States has once again taken up its old role as the self-appointed police of the Western Hemisphere. Under the disingenuous pretext of combating “narco-terrorism,” US forces have launched a violent campaign across the Caribbean and Eastern Pacific t…",
    "link": "https://www.commondreams.org/opinion/trump-monroe-doctrine",
    "timestamp": "2025-11-13T15:00:06Z"
  },
  {
    "title": "Trump, JD Vance Erotica Leaves ‘South Park’ Viewers 'Traumatized': What To Know About The Latest Episode",
    "description": "The latest episode of “South Park” has fans thanking the show “for the nightmares” after it depicted a sex scene between Donald Trump and JD Vance.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/11/13/trump-jd-vance-erotica-leaves-south-park-viewers-traumatized-what-to-know-about-the-latest-episode/",
    "timestamp": "2025-11-13T15:00:03Z"
  },
  {
    "title": "Faith, Money, and Algorithms: Inside Israel’s U.S. Influence Operation",
    "description": "Israel has ramped up efforts to shape public opinion in the United States, pouring millions of dollars into campaigns that strategically target both faith communities and digital platforms. Central to this initiative are U.S. evangelical Christians, who have …",
    "link": "https://www.activistpost.com/faith-money-and-algorithms-inside-israels-u-s-influence-operation/",
    "timestamp": "2025-11-13T15:00:00Z"
  },
  {
    "title": "Investing app Public acquires crypto IRA business for $65 million",
    "description": "The deal will make the brokerage the first to offer a wide range of crypto assets for retirement accounts.",
    "link": "https://fortune.com/2025/11/13/investing-app-public-acquires-crypto-ira-business-for-65-million/",
    "timestamp": "2025-11-13T15:00:00Z"
  },
  {
    "title": "What If AI Is a Bubble?",
    "description": "America’s economic fate looks tied to AI—for better or worse.",
    "link": "https://www.theatlantic.com/podcasts/2025/11/ai-bubble-us-economy/684906/",
    "timestamp": "2025-11-13T15:00:00Z"
  },
  {
    "title": "Here’s How ‘The Tonight Show’ Helped Elect Richard Nixon",
    "description": "Johnny Carson's make-up man became Nixon's secret weapon",
    "link": "https://www.cracked.com/article_49131_heres-how-the-tonight-show-helped-elect-richard-nixon.html",
    "timestamp": "2025-11-13T15:00:00Z"
  },
  {
    "title": "The Corruption Probe Rocking Ukraine’s Wartime Government",
    "description": "Ukraine has been rocked by a corruption scandal in which suspects allegedly discussed millions of dollars worth of kickbacks on protection for energy plants, even as Russian bombs raining down on them plunged citizens into cold and darkness. But it's not only…",
    "link": "https://oilprice.com/Geopolitics/Europe/The-Corruption-Probe-Rocking-Ukraines-Wartime-Government.html",
    "timestamp": "2025-11-13T15:00:00Z"
  },
  {
    "title": "Sharon Osbourne Breaks Down In Tears After Revealing Voicemail Donald Trump Left About Ozzy",
    "description": "After Sharon Osbourne played Donald Trump’s voicemail for listeners, netizens accused her of “sucking up” to the US president.",
    "link": "https://www.boredpanda.com/sharon-osbourne-breaks-down-donald-trump-voicemail-about-ozzy/",
    "timestamp": "2025-11-13T14:59:56Z"
  },
  {
    "title": "Lions' Amon-Ra St. Brown Apologizes to Anyone 'Offended' by His Trump Dance",
    "description": "Amon-Ra St. Brown, star wide receiver for the Detroit Lions, has apologized to anyone \"offended\" by his celebratory Donald Trump dance during his team's matchup against the Washington Commanders this past Sunday.\nThe post Lions’ Amon-Ra St. Brown Apologizes t…",
    "link": "https://www.breitbart.com/sports/2025/11/13/lions-amon-ra-st-brown-apologizes-to-anyone-offended-by-his-trump-dance/",
    "timestamp": "2025-11-13T14:59:37Z"
  },
  {
    "title": "Full SNAP payments to resume in Colorado as federal government reopens",
    "description": "Colorado officials are working to restore federally funded food assistance \"as rapidly as possible\" after the longest federal government shutdown in U.S. history ended Wednesday.",
    "link": "https://www.denverpost.com/2025/11/13/colorado-snap-benefits-government-shutdown/",
    "timestamp": "2025-11-13T14:57:22Z"
  },
  {
    "title": "Why is the US restarting military drills with Cambodia?",
    "description": "The US and Cambodia will resume joint exercises following years of tension over Phnom Penh's China ties. Analysts say the move is meant to generate much-needed diplomatic stability with Washington. The United States and Cambodia have agreed to revive their an…",
    "link": "https://www.dw.com/en/why-is-the-us-restarting-military-drills-with-cambodia/a-74727764",
    "timestamp": "2025-11-13T14:57:00Z"
  },
  {
    "title": "CNN Host Fact-Checks Jasmine Crockett In Real-Time About Trump-Epstein Claim",
    "description": "Democratic Texas Rep. Jasmine Crockett indicated on Wednesday that Republicans may have doctored the files surrounding sex offender Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/11/13/jasmine-crockett-republicans-doctored-epstein-files-fact-check-cnn-pamela-brown/",
    "timestamp": "2025-11-13T14:56:32Z"
  },
  {
    "title": "Epstein Bragged in Email That He “Gave” His Young Girlfriend to Trump",
    "description": "Jeffrey Epstein’s newly released private emails mention Donald Trump over and over again.",
    "link": "https://newrepublic.com/post/203132/epstein-bragged-email-gave-young-girlfriend-trump",
    "timestamp": "2025-11-13T14:55:48Z"
  },
  {
    "title": "Kai Trump At The Annika LPGA Event: When and where to watch live — TV and streaming details",
    "description": "The 2025 Annika event on the LPGA Tour, one of the most anticipated stops on the women’s golf calendar, has officially teed off at the Pelican Golf Club in Belleair, Florida.",
    "link": "https://economictimes.indiatimes.com/news/international/us/kai-trump-at-the-annika-lpga-event-when-and-where-to-watch-live-tv-and-streaming-details/articleshow/125302675.cms",
    "timestamp": "2025-11-13T14:55:14Z"
  },
  {
    "title": "Challenge to appointment of prosecutor who charged James Comey, Letitia James goes before federal judge",
    "description": "Lawyers for two of President Donald Trump's foes who have been charged by the Justice Department are set to ask a federal judge Thursday to dismiss the cases against them, saying the prosecutor who secured the indictments was illegally installed in the role.",
    "link": "https://www.pbs.org/newshour/politics/challenge-to-appointment-of-prosecutor-who-charged-james-comey-letitia-james-goes-before-federal-judge",
    "timestamp": "2025-11-13T14:54:36Z"
  },
  {
    "title": "Latest Epstein files knock White House on it heels - Politico",
    "description": "Latest Epstein files knock White House on it heelsPolitico Trump is getting pulled deeper and deeper into the Epstein dramaCNN First Thing: Trump knew about Epstein’s conduct, newly released emails suggestThe Guardian Epstein offered reporter photos of 'donal…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180063918",
    "timestamp": "2025-11-13T14:53:28Z"
  },
  {
    "title": "Trump Team Ends Press Briefing Right as Reporters Ask About Epstein",
    "description": "Donald Trump’s team quickly rushed reporters out of the Oval Office.",
    "link": "https://newrepublic.com/post/203135/donald-trump-ends-press-briefing-reporters-ask-epstein",
    "timestamp": "2025-11-13T14:53:09Z"
  },
  {
    "title": "John Fetterman Takes Shot At Democrats For Not Releasing Epstein Files When Biden Was President",
    "description": "John Fetterman criticized the Biden administration for not releasing files pertaining to registered sex offender Jeffrey Epstein when it was in office.",
    "link": "https://dailycaller.com/2025/11/13/john-fetterman-takes-shot-at-democrats-for-not-releasing-epstein-files-when-biden-was-president/",
    "timestamp": "2025-11-13T14:52:19Z"
  },
  {
    "title": "Epstein Files: Marjorie Taylor Greene Defends Donald Trump Over 'Smears'",
    "description": "Greene is one of only four Republicans who signed a discharge petition to force a House vote on releasing the Epstein files.",
    "link": "https://biztoc.com/x/518265cb612d7cc1",
    "timestamp": "2025-11-13T14:51:54Z"
  },
  {
    "title": "Trump to pardon British billionaire and former Tottenham owner",
    "description": "Joe Lewis was fined $5m and given three years probation by New York judge over ‘brazen’ insider trading scheme\nJoe Lewis, the British billionaire and former owner of Tottenham Hotspur FC, is to be pardoned by Donald Trump over a 2024 conviction for his part i…",
    "link": "https://biztoc.com/x/0f3c9b3255392da0",
    "timestamp": "2025-11-13T14:51:38Z"
  },
  {
    "title": "Trump signs government funding bill, ending record 43-day shutdown",
    "description": "President Donald Trump signed a government funding bill Wednesday night, ending a record 43-day shutdown that caused financial stress for federal workers who went without paychecks, stranded scores of travelers at airports and generated long lines at some foo…",
    "link": "https://biztoc.com/x/4fe82055a71bbe67",
    "timestamp": "2025-11-13T14:51:37Z"
  },
  {
    "title": "US Government Shutdown Ends as Trump Signs Spending Bill",
    "description": "President Donald Trump signed legislation to end the longest government shutdown in US history, allowing the government to resume normal operations.\nThe shutdown had halted food aid to millions of households, canceled thousands of flights, and forced federal …",
    "link": "https://biztoc.com/x/1c8b3cfff5f6c0b5",
    "timestamp": "2025-11-13T14:51:28Z"
  },
  {
    "title": "IRS Stimulus Payment November 2025: Are you getting $1,390 direct deposit? Is IRS Stimulus Payment buzz true?",
    "description": "IRS Stimulus Payment November 2025: IRS Stimulus Payment buzz is exploding online right now. And everyone wants to know if a $1,390 direct deposit is real. The truth is simple. No new IRS payment is approved. No November deposit is scheduled. No $1,390 relief…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-stimulus-payment-november-2025-are-you-getting-1390-direct-deposit-is-irs-stimulus-payment-buzz-true/articleshow/125301879.cms",
    "timestamp": "2025-11-13T14:51:09Z"
  },
  {
    "title": "Six key details could unlock $2,000 rebate check after Trump teases new stimulus for all",
    "description": "Many Americans are hoping for a new $2,000 rebate check after Donald Trump hinted at fresh relief for everyone. Early talks suggest low and middle-income earners could get the help, possibly funded by tariff money. The plan is still being discussed, and no of…",
    "link": "https://economictimes.indiatimes.com/news/international/us/six-key-details-could-unlock-2000-rebate-check-after-trump-teases-new-stimulus-for-all/articleshow/125302302.cms",
    "timestamp": "2025-11-13T14:48:26Z"
  },
  {
    "title": "Top Democrats slam Trump for delaying export curbs on China",
    "description": "WASHINGTON: Top Senate Democrats including Senate Minority Leader Chuck Schumer took aim at the Trump administration on Wednesday (Nov 12) for suspending a measure that blocked thousands of Chinese companies from accessing US technology in the last round of t…",
    "link": "https://www.channelnewsasia.com/world/trump-delay-china-export-curbs-democrats-slam-5465171",
    "timestamp": "2025-11-13T14:47:40Z"
  },
  {
    "title": "Caitlin Clark issues a special warning to Sophie Cunningham about her diet at the LPGA's Annika Pro-Am",
    "description": "The famous &quot;Tres Leches&quot; trio of Caitlin Clark, Sophie Cunningham, and Lexie Hull stole the spotlight once again, but this time it wasn&apos;t for their performances with",
    "link": "https://www.marca.com/en/basketball/wnba/indiana-fever/2025/11/13/6915eeee268e3e8d5d8b45cf.html",
    "timestamp": "2025-11-13T14:45:35Z"
  },
  {
    "title": "Trump Organization requested record number of foreign workers in 2025",
    "description": "The Trump Organization requested 184 foreign workers to work across various company properties, a record number that has increased over the years. The company sought to hire workers through H-2A and H-2B visas for temporary positions at Mar-a-Lago, two golf c…",
    "link": "https://freerepublic.com/focus/f-news/4352293/posts",
    "timestamp": "2025-11-13T14:43:19Z"
  },
  {
    "title": "US Military Shielded From Legal Liability for Attacks on Boats in Caribbean Sea",
    "description": "MOSCOW (Sputnik) The US Justice Department’s Office of Legal Counsel issued a classified opinion stating that US military personnel involved in attacks on boats in the Caribbean Sea will not face legal liability in the future, the Washington Post reported, ci…",
    "link": "https://sputnikglobe.com/20251113/us-military-shielded-from-legal-liability-for-attacks-on-boats-in-caribbean-sea-1123111614.html",
    "timestamp": "2025-11-13T14:41:34Z"
  },
  {
    "title": "7 Former FCC Commissioners Want ‘News Distortion Policy’ Rescinded for Threatening First Amendment",
    "description": "The bipartisan coalition -- including five Republicans -- urges the FCC to repeal the \"outdated\" rule after chairman Brendan Carr and Trump invoked it to threaten ABC and Jimmy Kimmel\nThe post 7 Former FCC Commissioners Want ‘News Distortion Policy’ Rescinded…",
    "link": "https://www.thewrap.com/fcc-commissioners-petition-trump-carr-news-distortion-policy/",
    "timestamp": "2025-11-13T14:41:16Z"
  },
  {
    "title": "Trump unveils vision for Eisenhower Executive Office Building makeover",
    "description": "Trump reveals exclusive plans to transform the historic Eisenhower Executive Office Building with a striking white makeover, showcasing dramatic before-and-after renderings.",
    "link": "https://www.foxnews.com/media/trump-unveils-vision-eisenhower-executive-office-building-makeover",
    "timestamp": "2025-11-13T14:40:20Z"
  },
  {
    "title": "Trump & Epstein Emails: See Alleged Messages From the Sex Offender to Ghislaine Maxwell & Michael Wolff",
    "description": "Democrats unveiled a series of emails from what appeared to be Epstein's account about his relationship with Trump.",
    "link": "https://hollywoodlife.com/2025/11/13/trump-epstein-emails/",
    "timestamp": "2025-11-13T14:39:11Z"
  },
  {
    "title": "Nigeria Brutalizes Peaceful Protesters Demanding Protection from Jihadis, Killing One",
    "description": "Multiple Nigerian newspapers reported on an incident on Wednesday in which the Nigerian military attacked peaceful protesters organizing to demand that the government act to protect civilians from genocidal jihadist attacks, which have persisted for over a de…",
    "link": "https://www.breitbart.com/africa/2025/11/13/nigeria-brutalizes-peaceful-protesters-demanding-protection-from-jihadis-killing-one/",
    "timestamp": "2025-11-13T14:38:39Z"
  },
  {
    "title": "Trump finds new ways to contradict JD Vance, this time on legal immigration",
    "description": "Donald Trump's criticisms of Americans and their employment skills weren't just controversial, they were also the opposite of JD Vance's views.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-finds-new-ways-contradict-jd-vance-time-legal-immigration-rcna243680",
    "timestamp": "2025-11-13T14:38:12Z"
  },
  {
    "title": "Trump signs government funding bill, ending record 43-day shutdown",
    "description": "WASHINGTON (AP) — President Donald Trump signed a government funding bill Wednesday night, ending a record 43-day shutdown that caused financial stress for federal workers who went without paychecks, stranded scores of travelers at airports and generated long…",
    "link": "https://www.pbs.org/newshour/politics/trump-signs-government-funding-bill-ending-record-43-day-shutdown",
    "timestamp": "2025-11-13T14:36:58Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Roasts Trump Over ‘Pressure Campaign’ to Block Vote Amid Bombshell Epstein Reveal",
    "description": "CNN's Kaitlan Collins roasted Trump over the location of a damage control meeting to lean on Lauren Boebert over her efforts to release more Epstein documents.\nThe post CNN’s Kaitlan Collins Roasts Trump Over ‘Pressure Campaign’ to Block Vote Amid Bombshell E…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-roasts-trump-over-pressure-campaign-to-block-vote-amid-bombshell-epstein-reveal/",
    "timestamp": "2025-11-13T14:35:05Z"
  },
  {
    "title": "'She's Native American!' Screwup leads to ICE effort to deport ancient tribe member",
    "description": "A day before Arizona native Leticia Jacobo was scheduled to be released from an Iowa jail, her mom visited to verify pickup details with the staff. Ericka Burns was excited to drive her daughter home after spending a month apart and wanted to make sure Jacobo…",
    "link": "https://www.rawstory.com/she-s-native-american-screwup-leads-to-ice-effort-to-deport-ancient-tribe-member/",
    "timestamp": "2025-11-13T14:34:42Z"
  },
  {
    "title": "What new Epstein emails say. And, ACA subsidies in limbo - NPR",
    "description": "What new Epstein emails say. And, ACA subsidies in limboNPR Epstein offered reporter photos of 'donald and girls in bikinis in my kitchen': Emailabcnews.go.com White House downplays new Epstein emails that mention TrumpNPR First Thing: Trump knew about Epstei…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180063748",
    "timestamp": "2025-11-13T14:33:07Z"
  },
  {
    "title": "US shutdown ends: What happens now, when will services resume?",
    "description": "Trump signed the Republican bill ending the longest US government shutdown, resuming funding until the end of January.",
    "link": "https://www.aljazeera.com/news/2025/11/13/us-shutdown-ends-what-happens-now-when-will-services-resume",
    "timestamp": "2025-11-13T14:31:23Z"
  },
  {
    "title": "Heartland/Rasmussen Poll: 52% of Young Voters Have Favorable Impression of Democratic Socialist Zohran Mamdani",
    "description": "58% of likely voters aged 18-39 support government-run grocery stores in every town in America; 62% of likely voters aged 18-39 said they would support more government housing and nationwide rent freeze; 44% think their economic future and personal happiness …",
    "link": "https://www.globenewswire.com/news-release/2025/11/13/3187500/0/en/Heartland-Rasmussen-Poll-52-of-Young-Voters-Have-Favorable-Impression-of-Democratic-Socialist-Zohran-Mamdani.html",
    "timestamp": "2025-11-13T14:30:00Z"
  },
  {
    "title": "Did Donald Trump Spend Thanksgiving With Epstein as President? What We Know",
    "description": "Sean Casten, an Illinois Democrat, has said Trump \"spent his first Thanksgiving after getting elected President\" with Epstein.",
    "link": "https://biztoc.com/x/ccd0de4e63819f3b",
    "timestamp": "2025-11-13T14:29:15Z"
  },
  {
    "title": "Swiss billionaires pivotal in wooing Trump ahead of tariff deal",
    "description": "As Switzerland closes in on a deal with the US to lower tariffs on the country, it will owe thanks to some of its richest executives who played a key role in wooing President Donald Trump.\nIf the shuttle diplomacy of Switzerland’s top trade diplomat laid the …",
    "link": "https://biztoc.com/x/095bd6c25cc9ee63",
    "timestamp": "2025-11-13T14:28:55Z"
  },
  {
    "title": "Sara Sharif was tortured to death by her father after a catalogue of blunders by authorities - who missed bruises under her hijab because they feared causing offence, damning review finds",
    "description": "Sara Sharif was tortured to death by her father after a catalogue of blunders by authorities who missed bruises under her hijab as they feared causing offence, a report reveals today. The ten-year-old was beaten to death by Urfan Sharif after the risk posed b…",
    "link": "https://freerepublic.com/focus/f-news/4352290/posts",
    "timestamp": "2025-11-13T14:28:12Z"
  },
  {
    "title": "The End of 'Housing First'",
    "description": "Plus: Shutdown over, Mexican murder rate, UES spews Mamdani hate, and more...",
    "link": "https://reason.com/2025/11/13/the-end-of-housing-first/",
    "timestamp": "2025-11-13T14:27:40Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Thursday",
    "description": "Stocks were down early Thursday morning after the Dow reached a record high during yesterday's session.",
    "link": "https://www.cnbc.com/2025/11/13/jim-cramers-top-10-things-to-watch-in-the-stock-market-thursday.html",
    "timestamp": "2025-11-13T14:26:35Z"
  },
  {
    "title": "John Fetterman Doesn’t Bite As Katie Couric Prods Him To Condemn Charlie Kirk",
    "description": "Katie Couric attempted to push John Fetterman to criticize Charlie Kirk, but the senator declined to do so.",
    "link": "https://dailycaller.com/2025/11/13/katie-couric-john-fetterman-interview-charlie-kirk/",
    "timestamp": "2025-11-13T14:26:22Z"
  },
  {
    "title": "COVER UP: How the DOJ Tried — and Failed — to Bury Trump’s Epstein Files",
    "description": "Newly released emails reveal Trump’s name in Epstein’s files — and raise hard questions about how and why the DOJ declared the case “closed.”\nThe post COVER UP: How the DOJ Tried — and Failed — to Bury Trump’s Epstein Files first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/cover-up-how-the-doj-buried-epsteins-trump-files-and-failed-to-close-the-case/",
    "timestamp": "2025-11-13T14:25:49Z"
  },
  {
    "title": "18 Trump voters reveal frustrating economic reality",
    "description": "Billy Edmonson thought his vote for Donald Trump in 2024 would mean financial relief. The 35-year-old construction worker from Missouri backed the president because of his positions on border security, gun rights and economic policy. Now, a year later, he fin…",
    "link": "https://rollingout.com/2025/11/13/18-trump-voters-reveal-economic-reality/",
    "timestamp": "2025-11-13T14:23:36Z"
  },
  {
    "title": "Chris Matthews blames Democratic Party 'snobbery and attitude' for losing working-class voters to Trump",
    "description": "Former MSNBC host Chris Matthews blamed the Democratic Party's snobbery and attitude as a reason why the working class supported President Donald Trump.",
    "link": "https://www.foxnews.com/media/chris-matthews-blames-democratic-party-snobbery-attitude-losing-working-class-voters-trump",
    "timestamp": "2025-11-13T14:19:49Z"
  },
  {
    "title": "Coalition Socialism",
    "description": "The intertwined relationship between liberalism and socialism offers important lessons for today’s fractious intra-left fights.",
    "link": "https://dissentmagazine.org/article/coalition-socialism/",
    "timestamp": "2025-11-13T14:17:42Z"
  },
  {
    "title": "FO° Talks: SNAP in Danger: What the US Government Shutdown Means for 40 Million Americans",
    "description": "[On November 12, US President Donald Trump signed a funding bill, officially ending the US government shutdown.] Fair Observer’s Video Producer Rohan Khattar Singh and political analyst Sam Raus discuss the historically long US government shutdown that began …",
    "link": "https://www.fairobserver.com/world-news/us-news/fo-talks-snap-in-danger-what-the-us-government-shutdown-means-for-40-million-americans/",
    "timestamp": "2025-11-13T14:17:27Z"
  },
  {
    "title": "Kai Trump golf earnings: Rising young golfer and Donald Trump’s granddaughter makes big impact with LPGA debut",
    "description": "Amateur golfer Kai Trump commands a significant NIL valuation, estimated between $1.2 million and $2 million, primarily from sponsorships and brand deals rather than tournament winnings. Her amateur status prevents her from accepting LPGA prize money, but her…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/kai-trump-golf-earnings-rising-young-golfer-and-donald-trumps-granddaughter-makes-big-impact-with-lpga-debut/articleshow/125302117.cms",
    "timestamp": "2025-11-13T14:15:39Z"
  },
  {
    "title": "The Epstein Firestorm Comes Roaring Back, and Donald Trump Is Getting Scorched | Analysis",
    "description": "\"I know how dirty Donald is,” Epstein wrote in August 2018 to a top lawyer who served in the Obama administration\nThe post The Epstein Firestorm Comes Roaring Back, and Donald Trump Is Getting Scorched | Analysis  appeared first on TheWrap.",
    "link": "https://www.thewrap.com/epstein-firestorm-and-donald-trump-is-getting-scorched/",
    "timestamp": "2025-11-13T14:15:00Z"
  },
  {
    "title": "Xi Joins Trump In Skipping G-20 Summit In Blow To South Africa",
    "description": "Xi’s decision means the summit, created to address global economic issues and typically attended by heads of state, will lack the leaders of the world’s two largest economies and fellow member Russia.",
    "link": "https://www.ndtvprofit.com/world/xi-joins-trump-in-skipping-g-20-summit-in-blow-to-south-africa",
    "timestamp": "2025-11-13T14:14:31Z"
  },
  {
    "title": "Treasuries Stumble as Shutdown Ends and Traders Brace for Swings",
    "description": "Yields were higher by as much as three basis points, led by tenors more sensitive to changes in Fed policy.  The odds of a December rate cut assigned by the ...",
    "link": "https://finance.yahoo.com/news/treasuries-steady-traders-brace-post-102242756.html",
    "timestamp": "2025-11-13T14:13:20Z"
  },
  {
    "title": "Swiss billionaires pivotal in wooing Trump ahead of tariff deal",
    "description": "The meeting was like a gathering of old buddies, according to a person briefed on the encounter.",
    "link": "https://fortune.com/2025/11/13/swiss-billionaires-trump-tariff-deal/",
    "timestamp": "2025-11-13T14:13:13Z"
  },
  {
    "title": "Nancy Pelosi Is Retiring up 595%, but She’s Still Holding on to These 3 Stocks",
    "description": "Nancy Pelosi announced her retirement last week. She has been a leading voice in Congress for decades, and her term will end in January 2027. She’s currently...",
    "link": "https://247wallst.com/investing/2025/11/13/nancy-pelosi-is-retiring-up-595-but-shes-still-holding-on-to-these-3-stocks/",
    "timestamp": "2025-11-13T14:12:44Z"
  },
  {
    "title": "Donald Trump and JD Vance have graphic sex (in South Park) - The Guardian",
    "description": "Donald Trump and JD Vance have graphic sex (in South Park)The Guardian Is there a new 'South Park' episode this week? See show's scheduleUSA Today ‘South Park’ Fans React To Trump, Vance Erotica As Show Takes On Sora: “Thanks For The Nightmares”Deadline ‘Sout…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180063582",
    "timestamp": "2025-11-13T14:12:34Z"
  },
  {
    "title": "South Park Takes Trump Attacks to Wild New Level With Graphic Trump-Vance Sex Scene",
    "description": "Trey Parker and Matt Stone upped the ante on their hits against Trump, depicting him having intercourse with JD Vance in the latest South Park.\nThe post South Park Takes Trump Attacks to Wild New Level With Graphic Trump-Vance Sex Scene first appeared on Medi…",
    "link": "https://www.mediaite.com/media/entertainment/south-park-takes-trump-attacks-to-wild-level-showing-president-and-vance-having-affair/",
    "timestamp": "2025-11-13T14:12:06Z"
  },
  {
    "title": "Humiliating moment Jasmine Crockett is SCHOOLED by CNN after her Epstein-Trump smear",
    "description": "Jasmine Crockett was fact-checked by CNN anchors while flaming Donald Trump over his connections to pedophile Jeffrey Epstein. Democrats on the House Oversight Committee released bombshell emails from the deceased billionaire Wednesday morning where he claims…",
    "link": "https://freerepublic.com/focus/f-news/4352286/posts",
    "timestamp": "2025-11-13T14:11:52Z"
  },
  {
    "title": "White House Says Trump Committed To $2,000 Tariff Dividend Payments For Many Americans",
    "description": "White House Says Trump Committed To $2,000 Tariff Dividend Payments For Many Americans\n \nAuthored by Kimberley Hayek via The Epoch Times,\nPresident Donald Trump remains committed to paying $2,000 to many Americans from funds from tariff revenues, the White Ho…",
    "link": "https://biztoc.com/x/683cf28b5927c900",
    "timestamp": "2025-11-13T14:06:48Z"
  },
  {
    "title": "CNN host cuts off Republican lawmaker for changing subject from Epstein to Obama",
    "description": "CNN's John Berman cut off a Republican congressman when he tried to change the subject from Jeffrey Epstein to Barack Obama.The House Oversight Committee released thousands of emails written by the late sex offender, many of which mention President Donald Tru…",
    "link": "https://www.rawstory.com/donald-trump-jeffrey-epstein-2674291790/",
    "timestamp": "2025-11-13T14:04:14Z"
  },
  {
    "title": "EU doesn’t determine international law – Rubio",
    "description": "US Secretary of State Marco Rubio has rejected criticisms of Washington’s strikes on alleged drug running boats in the Caribbean Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627744-rubio-caribbeans-tomahawk-missiles/",
    "timestamp": "2025-11-13T14:03:43Z"
  },
  {
    "title": "EXCLUSIVE: Watchdog Sounds Alarm On Hundreds Of Millions In Medicaid Payments To ‘Walking Dead’ Enrollees",
    "description": "A new report exposes the widespread problem of deceased individuals on Medicaid rolls and the taxpayer dollars wasted each year as a result.",
    "link": "https://dailycaller.com/2025/11/13/exclusive-watchdog-sounds-alarm-on-hundreds-of-millions-in-medicaid-payments-to-walking-dead-enrollees/",
    "timestamp": "2025-11-13T14:02:45Z"
  },
  {
    "title": "How to Measure Climate Progress",
    "description": "Ending reliance on oil, coal, and gas, and embracing technologies that will only improve and become cheaper over time, is not just smart climate policy. It is the best way to improve economic competitiveness and human prosperity for decades to come.",
    "link": "https://www.project-syndicate.org/commentary/measure-climate-progress-in-lives-improved-by-gernot-wagner-2025-11",
    "timestamp": "2025-11-13T14:01:42Z"
  },
  {
    "title": "Syrian embassy reopens in London after more than a decade",
    "description": "Syrian flag raised again in London as embassy reopens after more than a decade, signaling a cautious renewal of diplomatic activity between London and Damascus.",
    "link": "https://www.israelnationalnews.com/news/417745",
    "timestamp": "2025-11-13T14:01:24Z"
  },
  {
    "title": "Trump Signs Bill to End the Schumer Shutdown",
    "description": "Six House Democrats crossed the aisle.\nThe post Trump Signs Bill to End the Schumer Shutdown first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-signs-bill-to-end-the-schumer-shutdown/",
    "timestamp": "2025-11-13T14:00:46Z"
  },
  {
    "title": "Texas Democrats have the last laugh over MAGA gerrymandering",
    "description": "After initial success in Texas, Trump's 2026 gerrymandering strategy is facing roadblocks",
    "link": "https://www.salon.com/2025/11/13/texas-democrats-have-the-last-laugh-over-maga-gerrymandering/",
    "timestamp": "2025-11-13T14:00:30Z"
  },
  {
    "title": "WHITE HOUSE: Operation Dirtbag Secures Arrest of 150 Illegal Alien Sex Predators in Florida",
    "description": "White House press secretary Karoline Leavitt posted on social media that \"Operation Dirt Bag\" yielded the arrest of more than 150 illegal alien sexual predators in Florida. Earlier, Department of Homeland Security (DHS) Secretary Noem said, \"As a mother and g…",
    "link": "https://www.breitbart.com/border/2025/11/13/white-house-operation-dirtbag-secures-arrest-of-150-illegal-alien-sex-predators-in-florida/",
    "timestamp": "2025-11-13T14:00:25Z"
  },
  {
    "title": "RFK Jr. probes health dangers of offshore wind turbines",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. has ordered the Centers for Disease Control and Prevention (CDC) to investigate wind projects’ effects on the health and safety of commercial fishermen, Bloomberg News reports. Specifically, Kennedy in…",
    "link": "https://wattsupwiththat.com/2025/11/13/rfk-jr-probes-health-dangers-of-offshore-wind-turbines/",
    "timestamp": "2025-11-13T14:00:00Z"
  },
  {
    "title": "’60 Minutes’ Acts as Handmaid to a Feminist ‘Titan’",
    "description": "The self-appointed enforcers of “progressive” media indoctrination are satisfied that CBS hasn’t yet changed the tone of “60 Minutes,” which they call a “crown jewel”... Read More\nThe post ’60 Minutes’ Acts as Handmaid to a Feminist ‘Titan’ appeared first on …",
    "link": "https://www.dailysignal.com/2025/11/13/60-minutes-act-handmaids-feminist-titan/",
    "timestamp": "2025-11-13T14:00:00Z"
  }
]