[
  {
    "title": "The Justice Department has now sued 18 states in an effort to access voter data",
    "description": "The Department of Justice has sued four more states as part of the Trump administration's far-reaching attempt to access sensitive voter data. The DOJ is also suing Fulton County in Georgia.",
    "link": "https://www.npr.org/2025/12/12/nx-s1-5642610/doj-voter-data-lawsuits-colorado-hawaii-massachusetts-nevada",
    "timestamp": "2025-12-12T18:43:56Z"
  },
  {
    "title": "‘No President Is Legally Allowed to Tear Down’ White House Without Review: National Trust Sues to Stop Trump’s White House Ballroom",
    "description": "On Friday, a congressionally chartered historic preservation group filed suit against President Donald Trump's administration in an effort to halt construction of his planned White House ballroom.\nThe post ‘No President Is Legally Allowed to Tear Down’ White …",
    "link": "https://www.mediaite.com/media/news/no-president-is-legally-allowed-to-tear-down-white-house-without-review-national-trust-sues-to-stop-trumps-white-house-ballroom/",
    "timestamp": "2025-12-12T18:41:08Z"
  },
  {
    "title": "Trump Calls for National AI Framework, Curbing 'Onerous' State-Based Regulations",
    "description": "President Donald Trump on Thursday signed an executive order calling for a national policy framework on AI regulation, curbing states from pushing \"onerous\" laws.\nThe post Trump Calls for National AI Framework, Curbing ‘Onerous’ State-Based Regulations appear…",
    "link": "https://www.breitbart.com/politics/2025/12/12/trump-calls-for-national-ai-framework-curbing-onerous-state-based-regulations/",
    "timestamp": "2025-12-12T18:40:20Z"
  },
  {
    "title": "Trump administration delays decision on federal protections for monarch butterflies",
    "description": "MADISON, Wis. (AP) — President Donald Trump’s administration has delayed a decision on whether to extend federal protections to monarch butterflies indefinitely despite years of warnings from conservationists that populations are shrinking. The U.S. Fish and …",
    "link": "https://freerepublic.com/focus/f-news/4357105/posts",
    "timestamp": "2025-12-12T18:39:08Z"
  },
  {
    "title": "NIPR faults exclusion of communication experts in Nigeria’s delegation to US",
    "description": "The NIPR criticizes Nigeria’s delegation to the US for excluding communication experts, stressing the need for proper narrative management on security issu\n\nRead More: https://punchng.com/nipr-faults-exclusion-of-communication-experts-in-nigerias-delegation-t…",
    "link": "https://punchng.com/nipr-faults-exclusion-of-communication-experts-in-nigerias-delegation-to-us/",
    "timestamp": "2025-12-12T18:39:06Z"
  },
  {
    "title": "Thai and Cambodian leaders have agreed to renew a ceasefire after days of deadly clashes, Trump says",
    "description": "Both Cambodia and Thailand will “go back to the original Peace Accord”, Trump announced on his Truth Social platform, following calls with leaders of both countries.",
    "link": "https://www.channelnewsasia.com/world/thailand-cambodia-fighting-ceasefire-conflict-trump-anutin-hun-5579731",
    "timestamp": "2025-12-12T18:37:00Z"
  },
  {
    "title": "House Democrats release photos from Jeffrey Epstein's estate",
    "description": "House Democrats released 19 photos from Jeffrey Epstein's estate featuring Donald Trump, Bill Clinton and the former Prince Andrew.",
    "link": "https://www.kcra.com/article/epstein-estate-photos-trump-clinton-prince-andrew/69710874",
    "timestamp": "2025-12-12T18:35:12Z"
  },
  {
    "title": "Why Capital Pride is rescheduling its DC parade and festival 2026",
    "description": "Capital Pride announced its D.C. parade and festival for June 2026 would be pushed back. Here are the dates and reason for the change.",
    "link": "https://www.nbcwashington.com/entertainment/the-scene/capital-pride-parade-festival-pushed-back-as-dc-prepares-for-america-250/4027867/",
    "timestamp": "2025-12-12T18:35:11Z"
  },
  {
    "title": "House Democrats release photos from Jeffrey Epstein's estate",
    "description": "House Democrats released 19 photos from Jeffrey Epstein's estate featuring Donald Trump, Bill Clinton and the former Prince Andrew.",
    "link": "https://www.wgal.com/article/epstein-estate-photos-trump-clinton-prince-andrew/69710874",
    "timestamp": "2025-12-12T18:35:05Z"
  },
  {
    "title": "House Democrats release photos from Jeffrey Epstein's estate",
    "description": "House Democrats released 19 photos from Jeffrey Epstein's estate featuring Donald Trump, Bill Clinton and the former Prince Andrew.",
    "link": "https://www.wtae.com/article/epstein-estate-photos-trump-clinton-prince-andrew/69710874",
    "timestamp": "2025-12-12T18:34:48Z"
  },
  {
    "title": "Preservationists sue to halt Trump’s White House ballroom construction",
    "description": "Trump has championed 90,000-square-foot addition, as critics say his has circumvented legally required approvals.",
    "link": "https://www.aljazeera.com/news/2025/12/12/preservationists-sue-to-halt-trumps-white-house-ballroom-construction",
    "timestamp": "2025-12-12T18:34:20Z"
  },
  {
    "title": "Efforts to require Asian American history in schools after anti-Asian hate starting to pay off",
    "description": "Classes are diving into topics like stereotypes of South Asians and Vietnamese refugees.",
    "link": "https://www.bostonherald.com/2025/12/12/us-schools-asian-american-history/",
    "timestamp": "2025-12-12T18:33:53Z"
  },
  {
    "title": "Justice Department asks appeals court to block judge’s contempt inquiry in mass deportation case",
    "description": "Boasberg is scheduled to hear testimony Monday over a whistleblower complaint.",
    "link": "https://www.bostonherald.com/2025/12/12/trump-deportations-appeal/",
    "timestamp": "2025-12-12T18:33:18Z"
  },
  {
    "title": "Waltz hails ‘night-and-day’ Middle East shift as Trump’s Gaza plan reshapes region",
    "description": "EXCLUSIVE: United States Ambassador to the United Nations Michael Waltz recently returned from a Middle East swing, touting the \"amazing progress\" in the implementation of President Donald Trump’s Israel–Gaza peace deal.",
    "link": "https://www.foxnews.com/politics/waltz-hails-night-and-day-middle-east-shift-trumps-gaza-plan-reshapes-region",
    "timestamp": "2025-12-12T18:32:37Z"
  },
  {
    "title": "Trump administration delays decision on federal protections for monarch butterflies",
    "description": "The Trump administration has delayed a decision on whether to extend federal protections to monarch butterflies indefinitely",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-delays-decision-federal-protections-monarch-butterflies-128354259",
    "timestamp": "2025-12-12T18:31:23Z"
  },
  {
    "title": "Sydney Sweeney Takes Lie Detector Test And Is Asked ‘Question On Everyone’s Mind’",
    "description": "A Vanity Fair segment took a very personal turn with “The Housemaid” actors.",
    "link": "https://www.huffpost.com/entry/sydney-sweeney-lie-detector-boobs-amandy-seyfried_n_693c401ee4b0898f0300acab",
    "timestamp": "2025-12-12T18:30:35Z"
  },
  {
    "title": "Justice Department asks appeals court to block judge's contempt inquiry in mass deportation case",
    "description": "The Justice Department on Friday asked an appeals court to block a contempt investigation of the Trump administration for failing to turn around planes...",
    "link": "https://www.yahoo.com/news/articles/justice-department-asks-appeals-court-182853912.html",
    "timestamp": "2025-12-12T18:28:53Z"
  },
  {
    "title": "Lame duck Trump is suffering one political defeat after another",
    "description": "This is an adapted excerpt from the Dec. 11 episode of “All In with Chris Hayes.”\nThursday was a brutal day for President Donald Trump, with the president suffering one humiliating political defeat after another. \nFor much of his second term, Trump — and thos…",
    "link": "https://biztoc.com/x/f41cc0d0d6876fcd",
    "timestamp": "2025-12-12T18:26:14Z"
  },
  {
    "title": "Jeffrey Epstein estate photos released from House Democrats",
    "description": "House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton, and the former Prince Andrew.",
    "link": "https://www.wbaltv.com/article/epstein-estate-photos-released/69711942",
    "timestamp": "2025-12-12T18:26:02Z"
  },
  {
    "title": "'Shouldn't be falling asleep': Battleground Trump voters reveal why they soured on him",
    "description": "President Donald Trump continues to receive bad news about his support from voters, with a Friday report from Axios revealing some 2024 supporters in a key swing state now think \"he's full of it\" and have some familiar complaints about his leadership.North Ca…",
    "link": "https://www.rawstory.com/alternet-posts/swing-state-trump-voters/",
    "timestamp": "2025-12-12T18:25:26Z"
  },
  {
    "title": "Somali flag flown outside Vermont school building over Trump ‘garbage’ slur brings threats",
    "description": "The Winooski School District has a student body of about 9% people of Somali descent.",
    "link": "https://www.bostonherald.com/2025/12/12/us-vermont-school-somali-flag/",
    "timestamp": "2025-12-12T18:24:43Z"
  },
  {
    "title": "US flies bombers, fighters, drones along Venezuela coast",
    "description": "The US military has flown bombers, fighters, and surveillance drones along Venezuela’s coast, increasing regional tensions amid a counter-narcotics buildup\n\nRead More: https://punchng.com/us-flies-bombers-fighters-drones-along-venezuela-coast/",
    "link": "https://punchng.com/us-flies-bombers-fighters-drones-along-venezuela-coast/",
    "timestamp": "2025-12-12T18:22:11Z"
  },
  {
    "title": "Trump Worried Reports Of Venezuelan Oil Tanker Seizure Have Ruined The Surprise Of Melania’s Christmas Gift",
    "description": "WASHINGTON, D.C. — President Donald Trump expressed concern that his wife, Melania, may now be aware of what he got her for Christmas after news reports surfaced that the U.S. military had seized a Venezuelan oil tanker this week.",
    "link": "https://babylonbee.com/news/trump-worried-reports-of-venezuelan-oil-tanker-seizure-have-ruined-the-surprise-of-melanias-christmas-gift",
    "timestamp": "2025-12-12T18:21:51Z"
  },
  {
    "title": "Trump says Thailand and Cambodia agree to cease all shooting effective Friday (Reuters)",
    "description": "Reuters:\nTrump says Thailand and Cambodia agree to cease all shooting effective Friday  —  Thailand and Cambodia have agreed “to cease all shooting” effective Friday, U.S. President Donald Trump said after he held a call with the countries' leaders.  —  “Both…",
    "link": "https://www.memeorandum.com/251212/p60",
    "timestamp": "2025-12-12T18:20:02Z"
  },
  {
    "title": "Trump sued by preservation group seeking to halt White House ballroom construction",
    "description": "The lawsuit argues that President Trump was legally required to get federal approvals before demolishing the historic East Wing of the White House.",
    "link": "https://www.cnbc.com/2025/12/12/trump-lawsuit-ballroom-white-house-east-wing.html",
    "timestamp": "2025-12-12T18:19:12Z"
  },
  {
    "title": "Trump’s Hot Mic Moment Exposes ‘Blue Slip’ Beef With Senate GOP",
    "description": "resident Trump was caught raging that the Senate's tradition, preventing him from delivering the results voters expected after his landslide 2024 victory.",
    "link": "https://dailycaller.com/2025/12/12/trump-hot-mic-blue-slip-senate-gop-democrats-chuck-grassley-judicial-nominees-us-attorneys-vacancies/",
    "timestamp": "2025-12-12T18:19:02Z"
  },
  {
    "title": "A Good Republican",
    "description": "Did we find another one? At least for this, anyway.Minnesota Republican Sen. Jim Abeler was frustrated after hearing President Donald Trump call Somalis “garbage” and say he wants them out of the U.S.\r\nAbeler decided to write Trump a letter, admonishing the p…",
    "link": "https://www.eschatonblog.com/2025/12/a-good-republican.html",
    "timestamp": "2025-12-12T18:17:00Z"
  },
  {
    "title": "Dems set a trap for Trump with timing of new Epstein photo drop: conservative reporter",
    "description": "A decision by Democrats to release yet another batch of Jeffrey Epstein photos, this time including one of Donald Trump with his arms around six women who had their faces blacked out, was a calculated move to bait him, according to one conservative journalist…",
    "link": "https://www.rawstory.com/trump-2674395442/",
    "timestamp": "2025-12-12T18:16:58Z"
  },
  {
    "title": "House Passes Bill to Undo Trump Order to End Federal Workers’ Bargaining Rights",
    "description": "The bill passed with 20 Republicans joining all Democrats in voting “yes,” in a rare rebuke to Trump.",
    "link": "https://truthout.org/articles/house-passes-bill-to-undo-trump-order-to-end-federal-workers-bargaining-rights/",
    "timestamp": "2025-12-12T18:16:32Z"
  },
  {
    "title": "Leaders of Thailand and Cambodia agree to renew ceasefire, says Donald Trump",
    "description": "Trump said he spoke to Anutin Charnvirakul, the Prime Minister of Thailand, and Hun Manet, the Prime Minister of Cambodia, over the recent clashes between the two sides.",
    "link": "https://indianexpress.com/article/world/leaders-of-thailand-and-cambodia-agree-to-renew-ceasefire-says-donald-trump-10417574/",
    "timestamp": "2025-12-12T18:16:32Z"
  },
  {
    "title": "US Democrats release fresh Epstein photos featuring Trump, Clinton, Gates",
    "description": "The photos, drawn from a larger archive of more than 95,000 images, also include appearances by Bill Clinton, Steve Bannon, Bill Gates and Larry Summers, as well as several redacted images of women.",
    "link": "https://www.thehindubusinessline.com/news/world/us-democrats-release-fresh-epstein-photos-featuring-trump-clinton-gates/article70390263.ece",
    "timestamp": "2025-12-12T18:16:17Z"
  },
  {
    "title": "Ігор Смешко: Where is Ukraine's active diplomacy and why is there no Ukrainian peace plan on the negotiating table?",
    "description": "’You can do a lot with DIPLOMACY, but with diplomacy backed up by FORCE, you can get a lot more done’ (",
    "link": "https://blogs.pravda.com.ua/authors/smeshko/693c69f1a9f69/",
    "timestamp": "2025-12-12T18:16:01Z"
  },
  {
    "title": "Karoline Leavitt Lashes Out Over Inflation: ‘Nobody Reported It Being High Under Biden!’",
    "description": "“The president is digging our country out of the economic hole that the previous administration put us in,” Leavitt told CNN's Kaitlan Collins.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-kaitlan-collins-trump-economy-brawl_n_693c4592e4b0898f0300c5a5",
    "timestamp": "2025-12-12T18:15:50Z"
  },
  {
    "title": "House Democrats release a new batch of photos tied to Jeffrey Epstein’s estate—here are the high-profile names under fire yet again",
    "description": "House Democrats have released photographs from Jeffrey Epstein's estate. These images offer a new look at his connections with prominent figures. The release adds pressure as a deadline for the Epstein files approaches. Republicans accuse Democrats of creatin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/house-democrats-release-a-new-batch-of-photos-tied-to-jeffrey-epsteins-estatehere-are-the-high-profile-names-under-fire-yet-again/articleshow/125937652.cms",
    "timestamp": "2025-12-12T18:15:46Z"
  },
  {
    "title": "Jeffrey Epstein's Freaky Sex Toys Seen in New Photo Dump",
    "description": "Just when you thought the Jeffrey Epstein saga couldn't get any freakier ... the House Oversight Committee released a bunch of photos showing the late child sex predator's favorite toys, including a ball gag, anal beads, and a weird suction cup contraption.",
    "link": "https://www.tmz.com/2025/12/12/jeffrey-epstein-donald-trump-bill-clinton-house-oversight/",
    "timestamp": "2025-12-12T18:15:19Z"
  },
  {
    "title": "Nvidia share price: NVDA stocks fall big even after big H200 AI chips development. What to know?",
    "description": "Nvidia has told Chinese clients it is evaluating adding production capacity for its powerful H200 AI chips after orders exceeded its current output level, according to two sources briefed on the matter.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nvidia-share-price-nvda-stocks-fall-big-even-after-big-h200-ai-chips-development-what-to-know/articleshow/125938550.cms",
    "timestamp": "2025-12-12T18:15:06Z"
  },
  {
    "title": "Trump’s Immigration Crackdown Isn't Working",
    "description": "Some right-wing political leaders view Donald Trump’s immigration crackdown as a model to emulate. But a closer look at the numbers confirms that, while denouncing foreigners can be politically fruitful, attempting to get rid of them is both economically cost…",
    "link": "https://www.project-syndicate.org/commentary/trump-immigration-crackdown-is-no-model-to-emulate-by-jorge-g-castaneda-2025-12",
    "timestamp": "2025-12-12T18:14:56Z"
  },
  {
    "title": "Crummy, Slightly Cheaper Versions Of The Model 3 And Model Y Aren't Saving Tesla's Sales",
    "description": "Like the rest of the EV industry, Tesla is sort of going through it right now.",
    "link": "https://www.jalopnik.com/2050419/crummy-cheaper-tesla-sales-not-working/",
    "timestamp": "2025-12-12T18:14:47Z"
  },
  {
    "title": "Donald Trump Makes Big Announcement on Thailand-Cambodia War",
    "description": "The dispute between the countries over their border, largely mapped by France when it ruled Cambodia, reignited in May.",
    "link": "https://biztoc.com/x/43a16b40c0acc318",
    "timestamp": "2025-12-12T18:14:41Z"
  },
  {
    "title": "Five-year-olds taught 'abortion is a superpower' in new children's book",
    "description": "Children as young as five are being taught \"abortion is a superpower\" in a new book. \"Abortion Is Everything\" by Amelia Bonow and Rachel Kessler is billed as a non-fiction book, and will begin shipping to purchasers in January 2026. It is being promoted by pr…",
    "link": "https://freerepublic.com/focus/f-chat/4357101/posts",
    "timestamp": "2025-12-12T18:14:35Z"
  },
  {
    "title": "Thai, Cambodian leaders agree to renew ceasefire after days of deadly clashes: Trump",
    "description": "President Donald Trump says Thai and Cambodian leaders have agreed to renew a truce after days of deadly clashes had threatened to undo a ceasefire the U.S. administration had helped broker earlier this year",
    "link": "https://abcnews.go.com/US/wireStory/thai-cambodian-leaders-agreed-renew-ceasefire-after-days-128353046",
    "timestamp": "2025-12-12T18:12:35Z"
  },
  {
    "title": "“People will die”: Senate deadlocked as ACA subsidies are set to expire",
    "description": "Without subsidies, the median cost of ACA health care will increase by 18%",
    "link": "https://www.salon.com/2025/12/12/people-will-die-senate-deadlocked-as-aca-subsidies-are-set-to-expire/",
    "timestamp": "2025-12-12T18:11:13Z"
  },
  {
    "title": "Russia Sees the Former Soviet Union as a ‘Fiefdom,’ Moldova’s Foreign Minister Says",
    "description": "The foreign minister also said if anyone can bring peace to the region, it’s U.S. President Donald Trump.",
    "link": "http://foreignpolicy.com/2025/12/12/russia-putin-ukraine-moldova-foreign-minister-popsoi-interview/",
    "timestamp": "2025-12-12T18:08:52Z"
  },
  {
    "title": "Arkansas becoming 1st state to sever ties with PBS, effective July 1",
    "description": "Arkansas is becoming the first state to officially end its public television affiliation with PBS. The Arkansas Educational Television Commission, whose members are all appointed by the governor, voted to disaffiliate from PBS effective July 1, 2026, citing t…",
    "link": "https://slashdot.org/submission/17343189/arkansas-becoming-1st-state-to-sever-ties-with-pbs-effective-july-1",
    "timestamp": "2025-12-12T18:08:40Z"
  },
  {
    "title": "Stephen Colbert Offers Rich Immigrants Alternative to Trump’s Gold Card Visa: ‘Have You Considered Canada?’ | Video",
    "description": "\"They have Katy Perry now. We used to have her, now they have her,\" the \"Late Show\" host notes\nThe post Stephen Colbert Offers Rich Immigrants Alternative to Trump’s Gold Card Visa: ‘Have You Considered Canada?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-trump-gold-card-immigration-visa-canada/",
    "timestamp": "2025-12-12T18:08:26Z"
  },
  {
    "title": "Senate Filibuster Derails Dual Efforts to Prevent Massive ACA Premium Increases",
    "description": "Tax credits to help families afford insurance premium costs on ACA marketplaces will expire this month.",
    "link": "https://truthout.org/articles/senate-filibuster-derails-dual-efforts-to-prevent-massive-aca-premium-increases/",
    "timestamp": "2025-12-12T18:06:40Z"
  },
  {
    "title": "Big Baby Claims It's 'Seditious' for Reporters to Note He's Rambling, Falling Asleep",
    "description": "Barf Bag: Somebody's upset that people have noticed his televised naps, bonkers speeches, and suspiciously bruised hand!",
    "link": "https://www.jezebel.com/big-baby-claims-its-seditious-for-reporters-to-note-hes-rambling-falling-asleep",
    "timestamp": "2025-12-12T18:06:04Z"
  },
  {
    "title": "Consumers aren’t having a very merry holiday season, AP-NORC poll finds",
    "description": "Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts, and similar numbers are delaying big purchases or cutting back on nonessential purchases more than they would normally.",
    "link": "https://www.pbs.org/newshour/economy/consumers-arent-having-a-very-merry-holiday-season-ap-norc-poll-finds",
    "timestamp": "2025-12-12T18:05:14Z"
  },
  {
    "title": "Two Sides To Every Story",
    "description": "We could worry about this story. Republicans’ Senate campaign arm has actively worked behind the scenes to encourage Rep. Jasmine Crockett to jump into the Senate Democratic primary in Texas, believing she will be the easiest opponent to beat. Just a month ag…",
    "link": "https://balloon-juice.com/2025/12/12/two-sides-to-every-story/",
    "timestamp": "2025-12-12T18:04:44Z"
  },
  {
    "title": "Thai and Cambodian leaders have agreed to renew a ceasefire after days of deadly clashes, Trump says",
    "description": "President Donald Trump announced a renewed truce between Thailand and Cambodia. Leaders of both nations agreed to cease all shooting. This comes after days of deadly clashes threatened an earlier ceasefire. Malaysian Prime Minister Anwar Ibrahim also played a…",
    "link": "https://economictimes.indiatimes.com/news/defence/thai-and-cambodian-leaders-have-agreed-to-renew-a-ceasefire-after-days-of-deadly-clashes-trump-says/articleshow/125938401.cms",
    "timestamp": "2025-12-12T18:03:47Z"
  },
  {
    "title": "White House’s Leavitt keeps arguing with reporters. Her real fight is with reality",
    "description": "Earlier this week, White House press secretary Karoline Leavitt told Fox News that China had refused to purchase American soybeans during Joe Biden’s presidency because Chinese leaders “had no respect for our president, Biden, or for the country at the time.”…",
    "link": "https://biztoc.com/x/f41108ba53353879",
    "timestamp": "2025-12-12T18:03:47Z"
  },
  {
    "title": "Preservation Group Moves To Block Trump’s White House Expansion Plan",
    "description": "The National Trust for Historic Preservation has sued the Trump administration to halt construction of President Donald Trump’s proposed White House ballroom, arguing the project is moving forward without legally required review.\nThe nonprofit says the admini…",
    "link": "https://biztoc.com/x/fcb06a6bc5ea30ea",
    "timestamp": "2025-12-12T18:03:30Z"
  },
  {
    "title": "Trump's DOJ sues Georgia's Fulton County for 2020 voting records amid president's fixation",
    "description": "The Department of Justice's Civil Rights Division announced a lawsuit against a Georgia county, where President Donald Trump faced charges for election interference until recently.In a statement on Friday, the DOJ said it was suing Fulton County in Georgia, a…",
    "link": "https://www.rawstory.com/doj-sues-fulton-county-2020/",
    "timestamp": "2025-12-12T18:01:23Z"
  },
  {
    "title": "Falling tech stocks drag global shares lower",
    "description": "Broadcom drops after sales outlook falls short of lofty expectations",
    "link": "https://www.irishtimes.com/business/2025/12/12/falling-tech-stocks-drag-global-shares-lower/",
    "timestamp": "2025-12-12T18:00:31Z"
  },
  {
    "title": "US Congress releases Epstein estate photos featuring Trump, Clinton",
    "description": "House Democrats urge White House to end 'cover-up' of Jeffry Epstein case and bring justice to sex abuse victims.",
    "link": "https://www.aljazeera.com/news/2025/12/12/us-congress-releases-epstein-estate-photos-featuring-trump-clinton",
    "timestamp": "2025-12-12T18:00:11Z"
  },
  {
    "title": "Trump's quietly released national security strategy didn't escape Europe's attention",
    "description": "When the White House quietly released its national security strategy late one night last week, it instead seemed to get lost in other news. Except, perhaps, in Europe.",
    "link": "https://www.abc.net.au/news/2025-12-13/donald-trump-foreign-policy-national-security-strategy-europe/106136354",
    "timestamp": "2025-12-12T18:00:00Z"
  },
  {
    "title": "Trump says Thailand and Cambodia agree to cease all shooting effective Friday",
    "description": "WASHINGTON, Dec 12 (Reuters) - Thailand and Cambodia have agreed \"to cease all shooting\" effective Friday, U.S. President Donald Trump said after he held a call with the countries' leaders. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/trump-says-thailand-and-cambodia-agree-to-cease-all-shooting-effective-friday",
    "timestamp": "2025-12-12T17:59:00Z"
  },
  {
    "title": "Trump says Thailand, Cambodia agree to renew ceasefire after deadly clashes",
    "description": "Neither side has independently confirmed agreement, which comes amid five-day flare-up of cross-border fighting.",
    "link": "https://www.aljazeera.com/news/2025/12/12/trump-says-thailand-cambodia-agree-to-renew-ceasefire-after-deadly-clashes",
    "timestamp": "2025-12-12T17:58:34Z"
  },
  {
    "title": "Newly Released Epstein Photos Feature Donald Trump, Woody Allen and More",
    "description": "President Donald Trump, Woody Allen, former President Bill Clinton and Andrew Mountbatten-Windsor are all seen in newly released photos obtained from the late convicted sex offender Jeffrey Epstein’s estate. On Friday, December 12, Democrats on the House Over…",
    "link": "https://www.usmagazine.com/celebrity-news/news/newly-released-epstein-photos-feature-donald-trump-woody-allen-and-more/#article",
    "timestamp": "2025-12-12T17:58:30Z"
  },
  {
    "title": "AP Pushes Misleading 'Noticing Inflation' Holiday Shopping Narrative",
    "description": "Are Americans feeling worse this holiday season than in recent years? That’s the narrative emerging from the legacy press but there’s very little to support it. The Associated Press published a widely distributed story this week claiming American shoppers fac…",
    "link": "https://www.breitbart.com/economy/2025/12/12/ap-pushes-misleading-noticing-inflation-holiday-shopping-narrative/",
    "timestamp": "2025-12-12T17:58:02Z"
  },
  {
    "title": "RNC Chairman Joe Gruters: We're Unleashing 'Flurry of Campaign Tactics on Democrats' to Win the Midterms",
    "description": "Republicans are set to unleash a \"flurry of campaign tactics\" on Democrats to win the midterms, Republican National Committee (RNC) Chairman Joe Gruters said during a discussion on Breitbart News Daily.\nThe post RNC Chairman Joe Gruters: We’re Unleashing ‘Flu…",
    "link": "https://www.breitbart.com/politics/2025/12/12/rnc-chairman-joe-gruters-were-unleashing-flurry-of-campaign-tactics-on-democrats-to-win-the-midterms/",
    "timestamp": "2025-12-12T17:57:32Z"
  },
  {
    "title": "Thai and Cambodian leaders have agreed to renew a ceasefire after days of deadly clashes, Trump says",
    "description": "Trump announced the agreement to restart the ceasefire in a social media posting.",
    "link": "https://www.bostonherald.com/2025/12/12/trump-thailand-cambodia/",
    "timestamp": "2025-12-12T17:56:51Z"
  },
  {
    "title": "Trump Left Stumped! The Don, 79, Admits He Doesn't Know What Wife Melania Is 'Doing' After First Lady Reveals Her Plans for Next Year",
    "description": "Donald Trump seemed confused when Melania Trump announced a legislative initiative.",
    "link": "https://radaronline.com/p/donald-trump-melania-legislative-initiative-confused/",
    "timestamp": "2025-12-12T17:56:31Z"
  },
  {
    "title": "Trump Advisor Awarded A Nobel (Not That One)",
    "description": "Though Trump did not win the Nobel Peace Prize, another organization started by the Nobel family honored him with an award on Dec. 5.",
    "link": "https://dailycaller.com/2025/12/12/trump-nobel-prize-green-energy-miami-qatar/",
    "timestamp": "2025-12-12T17:56:30Z"
  },
  {
    "title": "House Democrats release images of Trump, Clinton and Andrew from Epstein’s estate - Boston News, Weather, Sports | WHDH 7News",
    "description": "WASHINGTON (AP) — House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton and the<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/house-democrats-release-images-of-trump…",
    "link": "https://whdh.com/news/house-democrats-release-images-of-trump-clinton-and-andrew-from-epsteins-estate/",
    "timestamp": "2025-12-12T17:56:11Z"
  },
  {
    "title": "'Bad for Bannon': Ex-GOP strategist warns new Epstein photos may hurt MAGA influencer",
    "description": "Former Republican strategist Rick Wilson warned Friday that MAGA influencer Steve Bannon could be under fire next after a new batch of images showed Bannon with late financier and convicted sex offender Jeffrey Epstein, who was also seen with filmmaker Woody …",
    "link": "https://www.rawstory.com/bad-for-bannon-ex-republican-strategist-warns-maga-influencer-could-be-under-fire-next/",
    "timestamp": "2025-12-12T17:55:06Z"
  },
  {
    "title": "‘He is Not a Lame Duck!’ Mike Johnson Claims Failure of Trump Pressure Campaign in Indiana Redistricting Is ‘Inconsequential’",
    "description": "Mike Johnson emphasized Friday that the Republican failure to secure Trump's redistricting plan in Indiana was not indicative of a loss of power.\nThe post ‘He is Not a Lame Duck!’ Mike Johnson Claims Failure of Trump Pressure Campaign in Indiana Redistricting…",
    "link": "https://www.mediaite.com/media/news/he-is-not-a-lame-duck-mike-johnson-claims-failure-of-trump-pressure-campaign-in-indiana-redistricting-is-inconsequential/",
    "timestamp": "2025-12-12T17:54:40Z"
  },
  {
    "title": "‘Most Dangerous Media Consolidation in History:’ MAGA Personalities Slam Netflix Bid to Acquire Warner Bros.",
    "description": "Netflix is pursuing a deal to acquire Warner Bros. Discovery, a move that would create the largest consolidated streaming platform in U.S. history. Together, the two companies would control an estimated 139 million domestic subscribers — roughly 50 million mo…",
    "link": "https://www.breitbart.com/tech/2025/12/12/most-dangerous-media-consolidation-in-history-maga-personalities-slam-netflix-bid-to-acquire-warner-bros/",
    "timestamp": "2025-12-12T17:54:14Z"
  },
  {
    "title": "Kristi Noem might not be long for Trumpland",
    "description": "The Homeland Security secretary has been one of the most visible and vocal architects of Trump’s anti-immigration efforts, even as her own star risks fading",
    "link": "https://theweek.com/politics/kriti-noem-trump-cabinet-deportation-shakeup",
    "timestamp": "2025-12-12T17:53:57Z"
  },
  {
    "title": "Trump: Thailand, Cambodia to CEASE all shooting",
    "description": "United States President Donald Trump said on Friday that he had a \"very good\" conversation with Thai Prime Minister Anutin Charnvirakul and Cambodian Prime Minister Hun Manet, with both leaders agreei...",
    "link": "https://biztoc.com/x/d43a8e36b1a58a9a",
    "timestamp": "2025-12-12T17:52:40Z"
  },
  {
    "title": "MAGA vs machine: Republicans split over AI",
    "description": "President Donald Trump says he will punish any state that implements its own regulations on artificial intelligence. The bodyshot to federalism is a gift to the tech industry, and one that upsets many Trump supporters who worry about AI’s effects on jobs, nat…",
    "link": "https://biztoc.com/x/d6d89b78d8929736",
    "timestamp": "2025-12-12T17:52:24Z"
  },
  {
    "title": "Trump Assembles Seemingly Motley Crew Of Allies To Stop China From Becoming World’s #1 Power",
    "description": "President Donald Trump is assembling a coalition of US allies across the globe to challenge China's dominance on rare earth minerals and technology.",
    "link": "https://dailycaller.com/2025/12/12/trump-assembles-seemingly-motley-crew-of-allies-to-stop-china-from-becoming-worlds-1-power/",
    "timestamp": "2025-12-12T17:52:22Z"
  },
  {
    "title": "Preservation group sues Trump over ballroom plan",
    "description": "The National Trust for Historic Preservation took US President Donald Trump to federal court, seeking to halt his planned White House ballroom. According to the lawsuit, filed Friday in Washington, th...",
    "link": "https://biztoc.com/x/1e9580523239b522",
    "timestamp": "2025-12-12T17:52:17Z"
  },
  {
    "title": "Dem Rep. Crow: Trump's Actions in Caribbean 'Exactly How Wars Start'",
    "description": "Friday on CNN's \"The Situation Room,\" Rep. Jason Crow (D-CO) said the Trump administration's military strikes on alleged drug boats and the U.S. Coast Guard seizing an oil tanker in the Caribbean were \"exactly how wars start.\"\nThe post Dem Rep. Crow: Trump’s …",
    "link": "https://www.breitbart.com/clips/2025/12/12/dem-rep-crow-trumps-actions-in-caribbean-exactly-how-wars-start/",
    "timestamp": "2025-12-12T17:52:13Z"
  },
  {
    "title": "WHO Releases Infertility Guidelines As Global Fertility Rates Fall",
    "description": "New WHO guidelines on infertility highlight access and affordability as key to advancing equity.",
    "link": "https://www.forbes.com/sites/jamilataylor/2025/12/12/who-releases-infertility-guidelines-as-global-fertility-rates-fall/",
    "timestamp": "2025-12-12T17:52:07Z"
  },
  {
    "title": "Democrat State Lawmaker Sarah Stalker: 'I Don't Feel Good About Being White Every Day'",
    "description": "Kentucky State Rep. Sarah Stalker (D) confessed this week that she does not feel good about being white, claiming that it is a \"point of privilege\" she feels bad about.\nThe post Democrat State Lawmaker Sarah Stalker: ‘I Don’t Feel Good About Being White Every…",
    "link": "https://www.breitbart.com/politics/2025/12/12/democrat-state-lawmaker-sarah-stalker-i-dont-feel-good-about-being-white-every-day/",
    "timestamp": "2025-12-12T17:49:19Z"
  },
  {
    "title": "Trump’s Own RNC Chair Issues Chilling 2026 Prediction",
    "description": "President Donald Trump’s handpicked Republican National Committee chair is predicting GOP obliteration in the 2026 midterms. With party operatives fearing...",
    "link": "https://www.thedailybeast.com/trumps-own-republican-chair-issues-chilling-2026-prediction/",
    "timestamp": "2025-12-12T17:44:54Z"
  },
  {
    "title": "'Looming disaster': Top Republicans fear 'certain defeat' because Trump's 'message sucks'",
    "description": "President Donald Trump's handpicked chairman of the Republican National Committee predicted a dismal outcome for the GOP in next year's midterm elections.RNC chairman Joe Gruters tried to set expectations for 2026 as low as possible, according to The Bulwark'…",
    "link": "https://www.rawstory.com/republican-midterm-defeat/",
    "timestamp": "2025-12-12T17:44:19Z"
  },
  {
    "title": "White House will work with Congress on single framework for AI, adviser says",
    "description": "The Trump administration will work with Congress in coming weeks and months to craft a single national framework to regulate developments in the field of artificial intelligence (AI), White House adviser Sriram Krishnan said.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/white-house-will-work-with-congress-on-single-framework-for-ai-adviser-says/articleshow/125937946.cms",
    "timestamp": "2025-12-12T17:42:28Z"
  },
  {
    "title": "How to deal with US-Pak arms biradari",
    "description": "Donald Trump has lined up $686 mn military aid for Pakistan, this time to sustain interoperability in counterterrorism operations and joint exercises. The US Defense Security Cooperation Agency (DSCA) proposal to Congress this week will be reviewed over a 30-…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/how-to-deal-with-us-pak-arms-biradari/articleshow/125937894.cms",
    "timestamp": "2025-12-12T17:42:21Z"
  },
  {
    "title": "New Batch of Epstein Photos Include Bill Gates, Richard Branson, and Segway Inventor",
    "description": "President Trump is in there too, but you could probably guess that by now.",
    "link": "https://gizmodo.com/new-batch-of-epstein-photos-include-bill-gates-richard-branson-and-segway-inventor-2000699130",
    "timestamp": "2025-12-12T17:41:27Z"
  },
  {
    "title": "Germany Summons Russian Ambassador Over Alleged Sabotage and Election Interference",
    "description": "German officials have previously accused Russia of hybrid warfare attacks to destabilize Europe.\nThe post Germany Summons Russian Ambassador Over Alleged Sabotage and Election Interference appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/12/12/germany-summons-russian-ambassador-over-alleged-sabotage-and-election-interference/",
    "timestamp": "2025-12-12T17:41:24Z"
  },
  {
    "title": "Trump Signs Order to Limit State-Level AI Regulation",
    "description": "President Donald Trump signed an order aimed at thwarting state-level regulation of artificial intelligence through lawsuits and funding cuts.\nThe order directs the US attorney general to establish an \"AI Litigation Task Force\" to challenge state AI laws that…",
    "link": "https://biztoc.com/x/0d334556a65190b6",
    "timestamp": "2025-12-12T17:41:07Z"
  },
  {
    "title": "AI is powering Trump’s economy, but American voters are getting worried",
    "description": "(Bloomberg/Mark Niquette and Nancy Cook) — President Donald Trump is heading into the 2026 election year vowing to pull out all the stops to promote artificial intelligence — just as American voters are starting to voice some doubts.\nAll through Trump’s first…",
    "link": "https://biztoc.com/x/54bca223017e01db",
    "timestamp": "2025-12-12T17:41:01Z"
  },
  {
    "title": "Treasury rachets up investigations targeting Minnesota’s Somali community for fraud",
    "description": "WASHINGTON (AP) — The Treasury Department is targeting businesses that people use to wire money to family members abroad as the Trump administration rachets up investigations into fraud within Minnesota’s Somali community, Treasury Secretary Scott Bessent sai…",
    "link": "https://financialpost.com/pmn/treasury-rachets-up-investigations-targeting-minnesotas-somali-community-for-fraud",
    "timestamp": "2025-12-12T17:38:44Z"
  },
  {
    "title": "‘Unfairly convicted’: Trump hands Tina Peters ‘full Pardon for her attempts to expose Voter Fraud’",
    "description": "'The left wants her dead'",
    "link": "https://www.wnd.com/2025/12/unfairly-convicted-trump-hands-tina-peters-full-pardon/",
    "timestamp": "2025-12-12T17:38:11Z"
  },
  {
    "title": "Newly released photos from Epstein estate include images of Trump, Clinton",
    "description": "Democrats on the House Oversight Committee have released more photos from the estate of Jeffrey Epstein, including ones of Donald Trump and Bill Clinton.",
    "link": "https://abcnews.go.com/US/newly-released-photos-epstein-estate-include-images-trump/story?id=128345597",
    "timestamp": "2025-12-12T17:38:01Z"
  },
  {
    "title": "Danish intelligence report warns of U.S. military threat under Trump",
    "description": "The United States is using its economic power to “assert its will\" and threaten military force against friend and foe alike, a Danish intelligence agency said in a new report.",
    "link": "https://www.pbs.org/newshour/world/danish-intelligence-report-warns-of-u-s-military-threat-under-trump",
    "timestamp": "2025-12-12T17:35:22Z"
  },
  {
    "title": "Trump Touts U.S. Economy During EO Signing: 'Hottest Country Anywhere in the World'",
    "description": "President Donald Trump touted the U.S. economy Thursday during an Oval Office signing, highlighting a record-high stock market and falling gas prices.\nThe post Trump Touts U.S. Economy During EO Signing: ‘Hottest Country Anywhere in the World’ appeared first …",
    "link": "https://www.breitbart.com/economy/2025/12/12/trump-touts-u-s-economy-during-eo-signing-hottest-country-anywhere-in-the-world/",
    "timestamp": "2025-12-12T17:32:05Z"
  },
  {
    "title": "Letitia James Not Indicted Again, That'll Teach Her To Continue Not Being Criminal",
    "description": "This round unsurprisingly goes to the New York Attorney General.",
    "link": "https://www.wonkette.com/p/letitia-james-not-indicted-again",
    "timestamp": "2025-12-12T17:31:57Z"
  },
  {
    "title": "Former Iraqi President Salih slated to lead UN refugee agency",
    "description": "Salih, who fled Saddam Hussein's regime, campaigned for job on basis that he knows what it is like to be a refugee.",
    "link": "https://www.aljazeera.com/news/2025/12/12/former-iraqi-president-salih-slated-to-take-over-un-refugee",
    "timestamp": "2025-12-12T17:31:24Z"
  },
  {
    "title": "Trump’s Affordability Weave",
    "description": "The president can’t seem to stay focused on the issue that voters care about most.",
    "link": "https://www.theatlantic.com/politics/2025/12/trump-affordability-message/685236/",
    "timestamp": "2025-12-12T17:30:47Z"
  }
]