[
  {
    "title": "India has already started winding down purchases of Russian energy products: US Trade Representative",
    "description": "India is reducing Russian oil purchases and increasing energy imports from the US, says US Trade Representative Jamieson Greer.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/india-has-already-started-winding-down-purchases-of-russian-energy-products-us-trade-representative/article70618169.ece",
    "timestamp": "2026-02-11T04:33:26Z"
  },
  {
    "title": "Iran claims Netanyahu's US visit aimed at undermining negotiations",
    "description": "Iran warns that Netanyahu’s US visit is aimed at derailing nuclear talks as it insists it is serious about negotiations.",
    "link": "https://www.israelnationalnews.com/news/422249",
    "timestamp": "2026-02-11T04:23:27Z"
  },
  {
    "title": "India-Pak war could have been nuclear: Trump reiterates claim of ending war",
    "description": "US President Donald Trump repeated the claim that he stopped the war between India and Pakistan last year, which he said could have turned nuclear, through tariffs.\n\"I settled eight wars. Of the eight wars, at least six were settled because of tariffs. In oth…",
    "link": "https://www.business-standard.com/world-news/india-pak-war-could-have-been-nuclear-trump-reiterates-claim-of-ending-war-126021100221_1.html",
    "timestamp": "2026-02-11T04:20:16Z"
  },
  {
    "title": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs",
    "description": "Speaker Mike Johnson failed to reinstate a ban on lawmakers’ ability to challenge President Donald Trump’s tariffs when three Republicans crossed party lines...",
    "link": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
    "timestamp": "2026-02-11T04:17:29Z"
  },
  {
    "title": "USTR Greer calls India a potential \"way station\" for US supply chains as alternative to China",
    "description": "In a Fox News interview, Ambassador Greer stated that India is a viable option for US companies looking to diversify supply chains away from China, highlighting its manufacturing capacity and workforce strength",
    "link": "https://www.thehindubusinessline.com/news/world/ustr-greer-calls-india-a-potential-way-station-for-us-supply-chains-as-alternative-to-china/article70618165.ece",
    "timestamp": "2026-02-11T04:15:49Z"
  },
  {
    "title": "Bad Beginnings: The End of The New Strategic Arms Reduction Treaty (New START). Washington Wants the Nuclear Stockpile to Grow?",
    "description": "How awful could it get? \nThe New Strategic Arms Reduction Treaty (New START) expired on February 5, terminating an era of arms control and imposed limits on lunatically contrived nuclear weapons programs of the United States and Russia. The New …\nThe post Bad…",
    "link": "https://www.globalresearch.ca/bad-beginnings-end-new-start/5915368",
    "timestamp": "2026-02-11T04:14:09Z"
  },
  {
    "title": "No charges filed: Kelly, Slotkin & fellow Democrats dodge Trump’s sedition push",
    "description": "Federal prosecutors did not indict six Democratic lawmakers who released a video advising military personnel to refuse illegal orders. President Trump had demanded jail time for the politicians. A grand jury denied the Justice Department's request for indictm…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-charges-filed-kelly-slotkin-fellow-democrats-dodge-trumps-sedition-push/articleshow/128187549.cms",
    "timestamp": "2026-02-11T04:10:47Z"
  },
  {
    "title": "Trump to Direct Pentagon to Buy Coal Power to Revive Industry (Jennifer A Dlouhy/Bloomberg)",
    "description": "Jennifer A Dlouhy / Bloomberg:\nTrump to Direct Pentagon to Buy Coal Power to Revive Industry  —  President Donald Trump will unveil plans to use government funding and Pentagon contracts to sustain US coal-fired power plants as he seeks to drive domestic reli…",
    "link": "https://www.memeorandum.com/260210/p185",
    "timestamp": "2026-02-11T04:05:05Z"
  },
  {
    "title": "Trump: Iran Would Be ‘Foolish’ Not to Make Nuclear, Missile Deal — Mulls Sending Second Aircraft Carrier to Region",
    "description": "President Donald Trump warned Iran that it would be “foolish” not to make a deal as a massive flotilla heads toward the region, with the United States again prepared to take “very tough” military action — including the possible dispatch of a second aircraft c…",
    "link": "https://www.breitbart.com/politics/2026/02/10/trump-iran-foolish-not-make-nuclear-missile-deal/",
    "timestamp": "2026-02-11T04:00:45Z"
  },
  {
    "title": "$108 oil threat: Can Middle East conflicts disrupt the world economy?",
    "description": "Historical and economic models suggest that even in the worst case, oil prices could rise toward $108 per barrel, impacting global inflation and growth modestly.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-10/the-108-oil-war-can-the-middle-east-crash-the-world-economy",
    "timestamp": "2026-02-11T04:00:16Z"
  },
  {
    "title": "‘Shut up and focus on the mission’: Tech workers are frustrated by their companies’ silence about ICE",
    "description": "Keep your head down. Compartmentalize. Don't make trouble. That's what many tech workers are taking their CEOs' strategic silence to mean, amid an immigration crackdown across the US by the Trump administration's Department of Homeland Security. Widespread vi…",
    "link": "https://www.theverge.com/ai-artificial-intelligence/876558/tech-workers-ice-resistance-google-microsoft-clear-abbott",
    "timestamp": "2026-02-11T03:55:49Z"
  },
  {
    "title": "Leavitt: Trump admin. set to repeal 2009 Obama-era finding that greenhouse gas emissions from motor vehicles endanger public health",
    "description": "The Trump administration is planning to repeal the 2009 Obama-era Endangerment Finding — which determined that greenhouse gas emissions from motor vehicles endanger public health and welfare — this week, White House Press Secretary Karoline Leavitt announced …",
    "link": "https://www.oann.com/newsroom/leavitt-trump-admin-set-to-repeal-2009-obama-era-finding-that-greenhouse-gas-emissions-from-motor-vehicles-endanger-public-health/",
    "timestamp": "2026-02-11T03:41:05Z"
  },
  {
    "title": "U.S. House rejects ban on challenges to Trump tariffs as Democrats ready vote on Canada",
    "description": "The U.S. House of Representatives rejected a Republican plan to block challenges to President Donald Trump's tariffs. Lawmakers voted to allow debate on tariffs, a move that could enable Democrats to try and undo trade measures on Canada. This outcome present…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/u-s-house-rejects-ban-on-challenges-to-trump-tariffs-as-democrats-ready-vote-on-canada/articleshow/128186656.cms",
    "timestamp": "2026-02-11T03:36:30Z"
  },
  {
    "title": "Grand jury rejects charges over Democrats’ military video",
    "description": "A grand jury in Washington has refused to indict Democratic lawmakers in connection with a video in which they urged U.S. military members to resist \"illegal orders,\" according to a person familiar with the matter",
    "link": "https://www.wmur.com/article/washington-grand-jury-rejects-charges-democrats-military-video/70306883",
    "timestamp": "2026-02-11T03:35:21Z"
  },
  {
    "title": "Donald Trump confesses ‘big mistake’ in major admission on economy - MassLive.com",
    "description": "Donald Trump confesses ‘big mistake’ in major admission on economyMassLive.com Trump says the Federal Reserve is 'in theory' an 'independent body'NBC News Bessent says Trump's comment about suing his Fed chief nominee was a jokeThe Detroit News Trump Says Fed…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180768864",
    "timestamp": "2026-02-11T03:32:59Z"
  },
  {
    "title": "Grand jury refuses to indict Democratic lawmakers in connection with illegal military orders video",
    "description": "A grand jury in Washington refused Tuesday to indict Democratic lawmakers in connection with a video in which they urged U.S. military members to resist “illegal orders,” according to a person familiar with the matter. The Justice Department opened an investi…",
    "link": "https://japantoday.com/category/world/grand-jury-refuses-to-indict-democratic-lawmakers-in-connection-with-illegal-military-orders-video",
    "timestamp": "2026-02-11T03:29:20Z"
  },
  {
    "title": "Person of interest detained for questioning in Nancy Guthrie disappearance, sources tell AP",
    "description": "A person has been detained for questioning in the disappearance of Nancy Guthrie, according to two people familiar with the matter.",
    "link": "https://www.bostonherald.com/2026/02/10/person-of-interest-detained-for-questioning-in-nancy-guthrie-disappearance-sources-tell-ap/",
    "timestamp": "2026-02-11T03:29:15Z"
  },
  {
    "title": "Indonesia to send up to 8,000 troops to Gaza under Trump's Board of Peace",
    "description": "The move makes Indonesia the first country to clearly commit troops to a multinational peacekeeping effort in the war-torn enclave.",
    "link": "https://www.abc.net.au/news/2026-02-11/indonesia-to-send-8000-troops-to-gaza-idf-peacekeeping/106330718",
    "timestamp": "2026-02-11T03:29:05Z"
  },
  {
    "title": "Trump Tariffs Face House Rebuke as Johnson Fails to Block Votes",
    "description": "House lawmakers could vote as soon as later this week on whether to reject some of President Donald Trump’s tariff policies, ahead of a midterm election focused heavily on anxiety over the US cost of living.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-face-house-rebuke-as-johnson-fails-to-block-votes",
    "timestamp": "2026-02-11T03:28:25Z"
  },
  {
    "title": "CNN Host Asks Ro Khanna If Lawmakers Can Just ‘Control-F’ For Names In Epstein Files",
    "description": "Kasie Hunt pressed Rep. Ro Khanna on Tuesday whether members of Congress can simply \"hit control-f\" to search for names in the Epstein files.",
    "link": "https://dailycaller.com/2026/02/10/kasie-hunt-ro-khanna-control-f-names-epstein-files/",
    "timestamp": "2026-02-11T03:25:32Z"
  },
  {
    "title": "Donald Trump to direct Pentagon to buy coal to revive industry: Report",
    "description": "President Trump is set to direct the Pentagon to use government funds and contracts to support US coal power plants. An executive order will instruct the Defense Secretary to secure electricity from coal facilities for military needs. The Department of Energy…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-to-direct-pentagon-to-buy-coal-to-revive-industry-carbon-emissions/articleshow/128186335.cms",
    "timestamp": "2026-02-11T03:24:28Z"
  },
  {
    "title": "Suspect in Nancy Guthrie's abduction detained in Arizona, law enforcement official says: Reuters",
    "description": "Authorities have said she was last seen on the night of January 31, when her family dropped her off at her home after dining with her.",
    "link": "https://www.cnbc.com/2026/02/11/suspect-in-nancy-guthries-abduction-detained-in-arizona-law-enforcement-official-says-reuters.html",
    "timestamp": "2026-02-11T03:24:23Z"
  },
  {
    "title": "3 Republicans break ranks to torpedo GOP bid to shield Trump tariffs",
    "description": "House Republicans suffered a surprise setback Tuesday after three members broke ranks to defeat a procedural rule designed to block votes challenging President Donald Trump’s tariff policies. According to Punchbowl News reporter Jake Sherman, the House voted …",
    "link": "https://www.rawstory.com/trump-tariffs-2675257611/",
    "timestamp": "2026-02-11T03:22:05Z"
  },
  {
    "title": "Don Lemon hires ex-U.S. prosecutor who quit amid concerns over investigation into Renee Good's killing",
    "description": "A federal prosecutor who quit amid concerns over how the Trump administration was handling the investigation into Renee Nicole Good's killing is now representing journalist Don Lemon.",
    "link": "https://www.nbcnews.com/news/us-news/don-lemon-hires-ex-us-prosecutor-quit-concerns-investigation-renee-goo-rcna258467",
    "timestamp": "2026-02-11T03:12:55Z"
  },
  {
    "title": "3 Republicans Defy Trump, Side With Democrats On President’s Tariffs",
    "description": "The House failed to clear a procedural rule Tuesday evening that would prevent any lawmaker from forcing a vote on terminating President Donald Trump's tariffs.",
    "link": "https://dailycaller.com/2026/02/10/republicans-trump-democrats-tariffs-procedural-rule/",
    "timestamp": "2026-02-11T03:11:09Z"
  },
  {
    "title": "DOJ fails to secure indictments for Democrats in military video case",
    "description": "The DOJ failed to secure indictments for Democratic members of Congress who participated in a video telling the military they could disobey illegal orders.",
    "link": "https://abcnews.com/US/doj-fails-secure-indictments-democratic-members-congress-military/story?id=130047628",
    "timestamp": "2026-02-11T03:08:12Z"
  },
  {
    "title": "Man detained for questioning in Nancy Guthrie’s disappearance, reports say",
    "description": "A man has been detained for questioning in connection with Nancy Guthrie’s disappearance, reports say.",
    "link": "https://www.wpxi.com/news/local/man-detained-questioning-nancy-guthries-disappearance-reports-say/LPRSARPZVBCY3KXXVYADXGDOKE/",
    "timestamp": "2026-02-11T03:07:40Z"
  },
  {
    "title": "US visa denied over 'weak ties to India': Entrepreneur calls system flawed",
    "description": "A Knot Dating co-founder says business ownership and tax history were not enough to prove intent to return to India",
    "link": "https://www.business-standard.com/immigration/us-visa-denied-over-weak-ties-to-india-entrepreneur-calls-system-flawed-126021000937_1.html",
    "timestamp": "2026-02-11T02:59:57Z"
  },
  {
    "title": "India-US trade deal: WH removes pulses from fact sheet, revises key text",
    "description": "The US has revised its interim trade deal fact sheet with India, removing pulses from tariff talks and softening language on India's $500 billion purchase plans, even as negotiations continue",
    "link": "https://www.business-standard.com/economy/news/india-us-trade-deal-wh-removes-pulses-from-fact-sheet-revises-key-text-126021100120_1.html",
    "timestamp": "2026-02-11T02:57:57Z"
  },
  {
    "title": "Nigeria: all Christians kidnapped by bandits now free",
    "description": "They are said to be in generally good condition.",
    "link": "https://www.christiantoday.com/news/all-christians-kidnapped-by-bandits-now-free",
    "timestamp": "2026-02-11T02:55:00Z"
  },
  {
    "title": "Nancy Guthrie Breakthrough: Person Detained For Questioning in Missing Mom Case After SWAT Armored Vehicles Rushed to Scene",
    "description": "A person was detained for questioning in the disappearance of Nancy Guthrie, as the SWAT team descended on an area in South Tucson.",
    "link": "https://radaronline.com/p/nancy-guthrie-abduction-person-detained-missing-mom-case/",
    "timestamp": "2026-02-11T02:52:23Z"
  },
  {
    "title": "Democrats criticize reported unsuccessful attempt by US prosecutors to indict lawmakers",
    "description": "By Kanishka SinghWASHINGTON, Feb 10 (Reuters) - Democratic U.S. lawmakers on Tuesday decried the reported unsuccessful attempt by the Justice Department of President Dona… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/11/democrats-criticize-reported-unsuccessful-attempt-by-us-prosecutors-to-indict-lawmakers",
    "timestamp": "2026-02-11T02:43:51Z"
  },
  {
    "title": "Grand jury declines to indict Democratic lawmakers who urged service members to disobey illegal Trump orders | CNN Politics",
    "description": "A federal grand jury on Tuesday declined to indict Democratic lawmakers who posted a video urging service members and intelligence officials to disobey any illegal orders from the Trump administration, according to two people familiar with the matter.",
    "link": "https://www.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
    "timestamp": "2026-02-11T02:42:35Z"
  },
  {
    "title": "Eileen Gu garners backlash for commenting on Trump's statement while representing China",
    "description": "Eileen Gu faces social media backlash after criticizing President Donald Trump while remaining silent on China's alleged human rights abuses. Enes Kanter Freedom calls her a \"traitor.\"",
    "link": "https://www.foxnews.com/sports/eileen-gu-garners-backlash-commenting-trumps-statement-while-representing-china",
    "timestamp": "2026-02-11T02:41:49Z"
  },
  {
    "title": "Trump administration plans to hold back grant money for some Democratic-led states (Geoff Mulvihill/Associated Press)",
    "description": "Geoff Mulvihill / Associated Press:\nTrump administration plans to hold back grant money for some Democratic-led states  —  President Donald Trump's administration is planning to withhold some public health and transportation money from a group of Democratic-l…",
    "link": "https://www.memeorandum.com/260210/p171",
    "timestamp": "2026-02-11T02:40:04Z"
  },
  {
    "title": "SkyBridge's Scaramucci is buying the bitcoin dip, calls Trump a crypto President",
    "description": "Scaramucci noted that SkyBridge has been purchasing bitcoin at various price points, including around $84,000, $63,000 and in the current lower range.",
    "link": "https://www.coindesk.com/markets/2026/02/11/we-are-a-buyer-of-bitcoin-in-this-market-skybridge-s-scaramucci-says",
    "timestamp": "2026-02-11T02:39:40Z"
  },
  {
    "title": "'Absolutely obscene': Trump DOJ sparks massive backlash as bid to indict Dems blows up",
    "description": "Outrage erupted across social media Tuesday after reports that the Trump administration attempted – and failed – to secure indictments against Democratic lawmakers over a video urging members of the military and intelligence communities to refuse unlawful ord…",
    "link": "https://www.rawstory.com/trump-indictments-2675257563/",
    "timestamp": "2026-02-11T02:37:42Z"
  },
  {
    "title": "ON HIDDEN CAMERA:Former Project Veritas Board Member Admits Being FBI Informant Against O'Keefe (O'Keefe confronts him on camera)",
    "description": "Informant calls O'Keefe the most evil person on earth. Wished that it was O'Keefe who was killed instead of Charlie Kirk. Said he wants to see Donald Trump, Jr. in jail. Wrote a book with a picture of O'Keefe on the cover with a bullet hole in his chest.",
    "link": "https://freerepublic.com/focus/f-bloggers/4366350/posts",
    "timestamp": "2026-02-11T02:34:44Z"
  },
  {
    "title": "Bea Kim looked up to Chloe Kim. Now they're teammates at Winter Olympics.",
    "description": "Snowboarder Bea Kim, 19, could be a breakout star for Team USA at the 2026 Winter Olympics.",
    "link": "https://www.usatoday.com/story/sports/olympics/2026/02/10/chloe-kim-bea-kim-idol-team-usa-winter-olympics/88614992007/",
    "timestamp": "2026-02-11T02:34:22Z"
  },
  {
    "title": "Bernie Sanders: 'Trump Is Completely Crazy and Delusional or Just a Pathological Liar'",
    "description": "Tuesday on MS NOW's \"All In,\" Sen. Bernie Sanders (I-VT)  said President Donald Trump was \"completely crazy and delusional, or just a pathological liar\" for praising the economy.\nThe post Bernie Sanders: ‘Trump Is Completely Crazy and Delusional or Just a Pat…",
    "link": "https://www.breitbart.com/clips/2026/02/10/bernie-sanders-trump-is-completely-crazy-and-delusional-or-just-a-pathological-liar/",
    "timestamp": "2026-02-11T02:34:04Z"
  },
  {
    "title": "US sanctions officials from Marshall Islands and Palau, citing China fears",
    "description": "The Trump administration has accused Hokkons Baules of Palau and Anderson Jibas of the Marshall Islands of corruption.",
    "link": "https://www.aljazeera.com/news/2026/2/11/us-sanctions-officials-from-marshall-islands-and-palau-citing-china-fears",
    "timestamp": "2026-02-11T02:32:44Z"
  },
  {
    "title": "The two revisions in India-US trade deal fact sheet by White House",
    "description": "US-India trade agreement: The United States has updated its trade deal fact sheet with India, removing \"pulses\" from the list of agricultural products eligible for tariff reductions. India now intends to purchase over $500 billion in energy, technology, and o…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/the-two-revisions-in-india-us-trade-deal-factsheet-by-white-house-tariff-on-pulses-removed-donald-trump-narendra-modi-intends-to-purchase-500-billion-goods/articleshow/128184777.cms",
    "timestamp": "2026-02-11T02:32:28Z"
  },
  {
    "title": "Person detained in connection to Nancy Guthrie’s abduction",
    "description": "It comes after the FBI released the first images of a masked man at her door.",
    "link": "https://www.wsbtv.com/news/local/person-detained-connection-nancy-guthries-abduction/K5VLMNGGUFBG3FCT6TESBQE6K4/",
    "timestamp": "2026-02-11T02:30:57Z"
  },
  {
    "title": "‘A Good Way To Destroy Your Country’: Joe Rogan Comes Down Hard Against Democrats’ Policy On Illegals",
    "description": "Podcast host Joe Rogan said Tuesday that Democratic immigration policies are fueling crime and political manipulation.",
    "link": "https://dailycaller.com/2026/02/10/joe-rogan-against-democrats-policy-illegals/",
    "timestamp": "2026-02-11T02:28:22Z"
  },
  {
    "title": "DC grand jury declines to indict Sens. Kelly, Slotkin for seditious conpiracy: MS Now",
    "description": "President Donald Trump had previously called for prosecution of members of Congress who participated in a video related to the U.S. military.",
    "link": "https://www.cnbc.com/2026/02/11/kelly-slotkin-grand-jury-trump-hegseth.html",
    "timestamp": "2026-02-11T02:20:46Z"
  },
  {
    "title": "Nancy Guthrie Suspect Video Obtained With Help From Google: Report",
    "description": "The retrieval of security camera footage showing a masked “potential subject” in the disappearance of Nancy Guthrie was made possible due in part to technical support from Google. The 84-year-old mom of NBC star Savannah Guthrie had been missing for over a we…",
    "link": "https://www.mediaite.com/media/news/nancy-guthrie-suspect-video-obtained-with-help-from-google-report/",
    "timestamp": "2026-02-11T02:18:04Z"
  },
  {
    "title": "Another Win For The First Amendment",
    "description": "When six Democratic members of Congress reminded military personnel of their obligation to refuse to obey unlawful orders, Donald Trump was furious. “SEDITIOUS BEHAVIOR, punishable by DEATH!” Mr. Trump wrote on his social media site. He shared another person’…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/another-win-for-the-first-amendment",
    "timestamp": "2026-02-11T02:17:15Z"
  },
  {
    "title": "California Democrats Pass Bill to Give $90M to Abortion Giant Planned Parenthood",
    "description": "California lawmakers passed a measure on Monday to send $90 million to abortion giant Planned Parenthood and other clinics.\nThe post California Democrats Pass Bill to Give $90M to Abortion Giant Planned Parenthood appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/10/california-democrats-pass-bill-90m-abortion-giant-planned-parenthood/",
    "timestamp": "2026-02-11T02:17:14Z"
  },
  {
    "title": "Trump to Direct Pentagon to Buy Coal in Bid to Revive Industry",
    "description": "President Donald Trump will unveil plans to use government funding and Pentagon contracts to sustain US coal-fired power plants as he seeks to drive domestic reliance on the fossil fuel.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-direct-pentagon-to-buy-coal-in-bid-to-revive-industry",
    "timestamp": "2026-02-11T02:16:58Z"
  },
  {
    "title": "What's next in New Jersey's special election: From the Politics Desk",
    "description": "This is the online version of From the Politics Desk, a daily newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/new-jerseys-special-election-politics-desk-rcna258478",
    "timestamp": "2026-02-11T02:15:28Z"
  },
  {
    "title": "Airlines start halting flights to Cuba amid US fuel blockade",
    "description": "Three Canadian airlines have suspended flights to Cuba due to a lack of guaranteed fuel supply. Germany also issued a travel warning. What to know:\n\n\nTwo more Canadian airlines have suspended their services to Cuba\nGermany issued an advisory against all non-e…",
    "link": "https://www.dw.com/en/airlines-start-halting-flights-to-cuba-amid-us-fuel-blockade/a-75903665",
    "timestamp": "2026-02-11T02:12:00Z"
  },
  {
    "title": "Report: Trump officials debate seizing tankers to cut Iran’s main revenue source",
    "description": "US officials say seizure of more tankers carrying Iranian oil is under consideration to pressure Tehran, but fears of retaliation and market disruption have so far kept Washington cautious.",
    "link": "https://www.israelnationalnews.com/news/422245",
    "timestamp": "2026-02-11T02:11:25Z"
  },
  {
    "title": "Is MAGA pushing the Catholic Church to the left?",
    "description": "A quiet cold war is happening across America — one that many Americans might not be aware of if they’re not tuned into the changes underway in America’s Christian communities. On one side is the religious right’s use of scripture and faith to justify and defe…",
    "link": "https://freerepublic.com/focus/f-backroom/4366347/posts",
    "timestamp": "2026-02-11T02:07:57Z"
  },
  {
    "title": "Trump administration plans to hold back grant money for some Democratic-led states",
    "description": "President Donald Trump's administration plans to withhold public health and transportation funds from several Democratic-led states.",
    "link": "https://www.wlky.com/article/trump-hold-back-grant-money-democratic-states/70304846",
    "timestamp": "2026-02-11T02:06:05Z"
  },
  {
    "title": "Trump 'kicked' Epstein out because he was a 'creep', says WH Press Secy",
    "description": "While addressing her press briefing, Leavitt asserted that the release of Epstein files now shows the transparency Trump has",
    "link": "https://www.business-standard.com/world-news/trump-kicked-epstein-out-because-he-was-a-creep-says-wh-press-secy-126021100090_1.html",
    "timestamp": "2026-02-11T02:03:05Z"
  },
  {
    "title": "FBI search of Georgia election offices relied on years-old claims of fraud, affidavit shows",
    "description": "The FBI obtained a warrant to seize ballots from Fulton County, Georgia. This action was based on claims about the 2020 election that had already been investigated and found to be unsubstantiated. The affidavit reveals the investigation began with a referral …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fbi-search-of-georgia-election-offices-relied-on-years-old-claims-of-fraud-affidavit-shows/articleshow/128183605.cms",
    "timestamp": "2026-02-11T01:58:00Z"
  },
  {
    "title": "'Would have been a nuclear war,' Trump reiterates claim of stopping India-Pakistan conflict",
    "description": "Former US President Donald Trump claimed he prevented an India-Pakistan conflict in May 2025, asserting tariffs were the key to de-escalation. He stated the Pakistani Prime Minister acknowledged his role in saving millions of lives. India, however, has consis…",
    "link": "https://economictimes.indiatimes.com/news/india/would-have-been-a-nuclear-war-trump-reiterates-claim-of-stopping-india-pakistan-conflict/articleshow/128184021.cms",
    "timestamp": "2026-02-11T01:53:26Z"
  },
  {
    "title": "Trump Bridge Threat Came After Lutnick Met Rival Crossing Owner",
    "description": "President Donald Trump’s threat to block a new bridge from Detroit to Canada followed a meeting between his Commerce Secretary and a billionaire who owns an existing border-crossing bridge just miles from the new span, according to two people familiar with th…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-bridge-threat-came-after-lutnick-met-rival-crossing-owner",
    "timestamp": "2026-02-11T01:51:27Z"
  },
  {
    "title": "Oil holds steady as US-Iran tensions provide support",
    "description": "On Wednesday, oil prices held steady as investors keep a close eye on the diplomatic discussions unfolding between the U.S. and Iran. The backdrop of geopolitical strife continues to lend support to prices. In addition, traders are eager for the upcoming U.S.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-holds-steady-as-us-iran-tensions-provide-support/articleshow/128183946.cms",
    "timestamp": "2026-02-11T01:51:11Z"
  },
  {
    "title": "Nikki Haley urges Trump to make Iran action a 'legacy-defining moment' before leaving office",
    "description": "Former U.S. Amb. to the UN Nikki Haley said Iran has \"never been weaker\" and urged President Donald Trump to finish the job before leaving office on \"Special Report.\"",
    "link": "https://www.foxnews.com/media/nikki-haley-urges-trump-make-iran-action-legacy-defining-moment-before-leaving-office",
    "timestamp": "2026-02-11T01:49:49Z"
  },
  {
    "title": "Judge dismisses DOJ lawsuit seeking Michigan's voter roll data",
    "description": "The ruling is the third time this year a court has tossed out a lawsuit by the Trump administration in its push to get details on state voter registration lists.",
    "link": "https://www.nbcnews.com/politics/elections/judge-dismisses-doj-lawsuit-seeking-michigan-voter-roll-data-rcna258465",
    "timestamp": "2026-02-11T01:48:12Z"
  },
  {
    "title": "Trump admin plans to hold back grant money for some Democratic-led states",
    "description": "President Donald Trump's administration is planning to withhold some public health and transportation money from a group of Democratic-led states.\nFull details have not been released, including whether the states could take any steps to avoid losing the fundi…",
    "link": "https://www.business-standard.com/world-news/trump-admin-plans-to-hold-back-grant-money-for-some-democratic-led-states-126021100065_1.html",
    "timestamp": "2026-02-11T01:47:36Z"
  },
  {
    "title": "President Trump to visit Fort Bragg, meet with military families",
    "description": "The president and first lady will meet with military families and members of special forces involved in the operation to capture former Venezuelan President Nicolas Maduro.",
    "link": "https://www.wsoctv.com/news/local/president-trump-visit-fort-bragg-meet-with-military-families/QEVNTCTJMJFP5FOWN7V7DGYPPI/",
    "timestamp": "2026-02-11T01:44:58Z"
  },
  {
    "title": "Ex-SafeMoon chief sentenced to 8 years over $9M investor fraud",
    "description": "SafeMoon’s former chief technology officer, Thomas Smith, has also pleaded guilty and is awaiting sentencing. Alleged co-conspirator Kyle Nagy remains at large.",
    "link": "https://cointelegraph.com/news/safemoon-ceo-sentenced-8-years-crypto-scam",
    "timestamp": "2026-02-11T01:42:58Z"
  },
  {
    "title": "Netanyahu meets Witkoff and Kushner in Washington",
    "description": "Prime Minister Benjamin Netanyahu met at Blair House in Washington with the special envoys of US President Donald Trump, Steve Witkoff and Jared Kushner.",
    "link": "https://www.israelnationalnews.com/flashes/676079",
    "timestamp": "2026-02-11T01:38:10Z"
  },
  {
    "title": "Trump, Netanyahu meet to likely focus on energy, deregulation: White House",
    "description": "Heading to Washington on Tuesday to meet Trump, Netanyahu said he planned to convey Israel's position on US nuclear talks with Tehran during the meeting",
    "link": "https://www.business-standard.com/world-news/trump-netanyahu-meet-to-likely-focus-on-energy-deregulation-white-house-126021100059_1.html",
    "timestamp": "2026-02-11T01:37:03Z"
  },
  {
    "title": "Trump admin removes Pride flag from Stonewall National Monument | CNN Politics",
    "description": "The Trump administration has removed an LGBTQ Pride flag from the Stonewall National Monument in New York City, the United States’ first national monument to LGBTQ rights, following a directive restricting what kinds of flags can be flown on National Park sit…",
    "link": "https://www.cnn.com/2026/02/10/politics/pride-flag-removed-stonewall-monument-trump-administration",
    "timestamp": "2026-02-11T01:36:16Z"
  },
  {
    "title": "Netanyahu again flies through Canadian airspace en route to Washington",
    "description": "Online flight trackers show that Israeli Prime Minister Benjamin Netanyahu flew hundreds of kilometres through Canadian airspace on his way to meet U.S. President Donald Trump this week — despite Prime Minister Mark Carney previously saying he would honour an…",
    "link": "https://www.cbc.ca/news/politics/netanyahu-canadian-airspace-9.7083737",
    "timestamp": "2026-02-11T01:35:35Z"
  },
  {
    "title": "ICE chief backs officers' actions before Congress after 2 protesters' death",
    "description": "Todd Lyons, the acting head of Immigration and Customs Enforcement, defended his agency's officers before Congress on Tuesday, standing behind their tactics and saying they would not be intimidated as they carry out the president's mass deportation plans.\nLyo…",
    "link": "https://www.business-standard.com/world-news/ice-chief-backs-officers-actions-before-congress-after-2-protesters-death-126021100068_1.html",
    "timestamp": "2026-02-11T01:35:28Z"
  },
  {
    "title": "President Donald Trump slurs his words, fueling new fears ‘something is very wrong’ with his health - NewsBreak",
    "description": "CNN abruptly cut into its regular programming to air live coverage of a press conference held by President Donald Trump following his announcement that U.S",
    "link": "https://www.newsbreak.com/share/4486748683209-president-donald-trump-slurs-his-words-fueling-new-fears-something-is-very-wrong-with-his-health?s=a2&amp;share_destination_id=MjM0MDQ4ODgtMTc3MDc3MzY0NDM1OA%3D%3D&amp;pd=01aCgCa3&amp;hl=en_US&amp;send_time=1770773644&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.5.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-11T01:34:57Z"
  },
  {
    "title": "US to scrap legal cornerstone of climate regulations this week",
    "description": "WASHINGTON: President Donald Trump is set this week to scrap a landmark scientific finding that greenhouse gases jeopardise public health by driving climate change - the bedrock of US regulations to curb planet-warming pollution.The Environmental Protection A…",
    "link": "https://www.channelnewsasia.com/world/us-scrap-legal-cornerstone-climate-regulations-week-5920561",
    "timestamp": "2026-02-11T01:32:29Z"
  },
  {
    "title": "Trump Ponders Another ‘Big Beautiful Bill’",
    "description": "President Donald Trump weighed in Tuesday on the possibility of another sweeping legislative package.",
    "link": "https://dailycaller.com/2026/02/10/trump-ponders-another-big-beautiful-bill/",
    "timestamp": "2026-02-11T01:30:18Z"
  },
  {
    "title": "Trump Says He Raised Country’s Tariffs By 9% After Not Approving of Leader’s Tone in Phone Call: Didn’t ‘Like the Way She Talked To Us’",
    "description": "President Donald Trump recalled punishing a world leader with steeper tariffs after being dissatisfied with her tone during a phone conversation.\nThe post Trump Says He Raised Country’s Tariffs By 9% After Not Approving of Leader’s Tone in Phone Call: Didn’t …",
    "link": "https://www.mediaite.com/media/tv/trump-says-he-raised-countrys-tariffs-by-9-after-not-approving-of-leaders-tone-in-phone-call-didnt-like-the-way-she-talked-to-us/",
    "timestamp": "2026-02-11T01:26:43Z"
  },
  {
    "title": "FAA says air traffic control overhaul management contract worth $1.5 billion",
    "description": "The FAA has awarded Peraton a $1.5 billion contract to manage the $12.5 billion overhaul of the U.S. air traffic control system, with President Trump securing a $200 million discount. This modernization effort aims to transition to a cloud-based system, upgra…",
    "link": "https://economictimes.indiatimes.com/news/international/business/faa-says-air-traffic-control-overhaul-management-contract-worth-1-5-billion/articleshow/128183392.cms",
    "timestamp": "2026-02-11T01:25:28Z"
  },
  {
    "title": "Trump administration fails to secure indictment in connection with Democrats involved in 'illegal orders' video (NBC News)",
    "description": "NBC News:\nTrump administration fails to secure indictment in connection with Democrats involved in ‘illegal orders’ video  —  President Donald Trump had accused six Democratic lawmakers of “seditious behavior” after they urged members of the military and inte…",
    "link": "https://www.memeorandum.com/260210/p157",
    "timestamp": "2026-02-11T01:25:03Z"
  },
  {
    "title": "Minister Regev to Arutz Sheva: An opportunity to completely change the situation in Iran",
    "description": "Transportation Minister Miri Regev speaks with Arutz Sheva-Israel National News ahead of the meeting between Prime Minister Netanyahu and US President Trump, which will focus on the Iranian threat.",
    "link": "https://www.israelnationalnews.com/news/422244",
    "timestamp": "2026-02-11T01:16:24Z"
  },
  {
    "title": "Trump Says He Punished World Leader with Steeper Tariffs Because He Didn't Like Her Tone",
    "description": "President Donald Trump recalled punishing a world leader with steeper tariffs after being dissatisfied with her tone during a phone conversation.",
    "link": "https://www.yahoo.com/news/videos/trump-says-punished-world-leader-011354633.html",
    "timestamp": "2026-02-11T01:13:54Z"
  },
  {
    "title": "FAA says air traffic control overhaul management contract worth $1.5 billion",
    "description": "WASHINGTON, Feb 10 : The Federal Aviation Administration said on Tuesday its contract with national security firm Peraton, the project manager of a $12.5-billion effort to overhaul the aging U.S. air traffic control system, was worth $1.5 billion.In a briefin…",
    "link": "https://www.channelnewsasia.com/business/faa-says-air-traffic-control-overhaul-management-contract-worth-15-billion-5921936",
    "timestamp": "2026-02-11T01:13:48Z"
  },
  {
    "title": "FAA says air traffic control overhaul management contract worth $1.5 billion",
    "description": "By David Shepardson WASHINGTON, Feb 10 (Reuters) - The Federal Aviation Administration said on Tuesday its contract with national security firm Peraton, the ...",
    "link": "https://www.yahoo.com/news/articles/faa-says-air-traffic-control-011348853.html",
    "timestamp": "2026-02-11T01:13:48Z"
  },
  {
    "title": "Dad shot daughter after 'arguing about Donald Trump' (Jonny HumphriesNorth West/BBC)",
    "description": "Jonny HumphriesNorth West / BBC:\nDad shot daughter after ‘arguing about Donald Trump’  —  A British woman who was shot dead by her father while visiting his home in Texas had argued with him about US President Donald Trump earlier that day, an inquest has hea…",
    "link": "https://www.memeorandum.com/260210/p156",
    "timestamp": "2026-02-11T01:10:00Z"
  },
  {
    "title": "DOJ fails to indict in case of Democrats' video about refusing illegal military orders",
    "description": "President Donald Trump had accused six lawmakers of \"seditious behavior\" after they urged members of the military to refuse unlawful orders in a video.",
    "link": "https://www.nbcnews.com/politics/trump-administration/doj-fails-secure-indictment-democrats-involved-illegal-orders-video-rcna258385",
    "timestamp": "2026-02-11T01:09:21Z"
  },
  {
    "title": "Bitcoin price: Trump’s crypto dream is turning into a nightmare",
    "description": "Bitcoin price: Trump’s crypto dream is turning into a nightmaresmh.com.au",
    "link": "https://www.smh.com.au/business/markets/trump-s-digital-gold-dream-is-turning-into-a-nightmare-20260211-p5o19o.html",
    "timestamp": "2026-02-11T01:05:09Z"
  },
  {
    "title": "New Gallup poll reveals depth of Americans' gloom about the future",
    "description": "In 2025, only about 59% of Americans gave high ratings when asked to evaluate how good their life will be in about five years, the lowest annual measure since Gallup began asking this question almost 20 years ago.",
    "link": "https://www.pbs.org/newshour/politics/new-gallup-poll-reveals-depth-of-americans-gloom-about-the-future",
    "timestamp": "2026-02-11T01:03:10Z"
  },
  {
    "title": "Trump Vows to Block US-Canada Bridge Until Canada Treats the US with ‘Fairness and Respect’",
    "description": "Warning that cozying up to China will spell disaster for Canada, President Donald Trump says he will block the opening of a bridge connecting Ontario and Michigan until Canada undergoes a long-overdue attitude adjustment.\nThe post Trump Vows to Block US-Canad…",
    "link": "https://www.thegatewaypundit.com/2026/02/trump-vows-block-us-canada-bridge-canada-treats/",
    "timestamp": "2026-02-11T01:00:36Z"
  },
  {
    "title": "Susan Collins shrugs off attacks by Democrats and Trump, says Maine voters ‘Don’t vote party line’",
    "description": "Sen. Susan Collins announces 2026 re-election bid in Maine as Democrats target the Republican senator. The 73-year-old faces tough competition in the race.",
    "link": "https://www.foxnews.com/politics/susan-collins-shrugs-off-attacks-democrats-trump-says-maine-voters-dont-vote-party-line",
    "timestamp": "2026-02-11T01:00:22Z"
  },
  {
    "title": "Bill Maher Says He And Jimmy Kimmel 'May Never Talk Again' After Falling Out",
    "description": "Maher has previously criticized Kimmel's wife, Molly McNearney, who acknowledged cutting ties with loved ones who backed President Donald Trump.",
    "link": "https://www.huffpost.com/entry/bill-maher-jimmy-kimmel-falling-out_n_698b463be4b0d9287221a51f",
    "timestamp": "2026-02-11T00:59:01Z"
  },
  {
    "title": "Gov. Cox promises U.S. is still a 'welcoming place' as Utah prepares to host 2034 Olympics",
    "description": "The United States is \"still a very welcoming place,\" Utah Gov. Spencer Cox said Tuesday at the Milan Cortina Olympics, which have been a focus of global concern about the country's political direction.",
    "link": "https://www.pbs.org/newshour/world/gov-cox-promises-u-s-is-still-a-welcoming-place-as-utah-prepares-to-host-2034-olympics",
    "timestamp": "2026-02-11T00:54:21Z"
  },
  {
    "title": "Exclusive-Trump's spy chief Gabbard winds down intelligence task force",
    "description": "WASHINGTON, Feb 10 (Reuters) - U.S. spy ⁠chief Tulsi Gabbard told Reuters on Tuesday that she has wound down a task force she launched last year with the declared goal of rooting ⁠out politicization from intelligence agencies, but which critics accused of bei…",
    "link": "https://www.thestar.com.my/news/world/2026/02/11/exclusive-trump039s-spy-chief-gabbard-winds-down-intelligence-task-force",
    "timestamp": "2026-02-11T00:50:00Z"
  },
  {
    "title": "Trump told ex-police chief 'everyone' knew about Epstein's behaviour, FBI file says",
    "description": "The document appears to contradict claims by the president that he \"had no idea\" about the crimes of the convicted sex offender.",
    "link": "https://news.sky.com/story/epstein-files-trump-told-ex-police-chief-everyone-knew-about-epsteins-behaviour-fbi-document-says-13506034",
    "timestamp": "2026-02-11T00:48:00Z"
  },
  {
    "title": "‘Let Me Be Clear’: The Warning Savannah Chrisley Issued To The View’s Panelists Ahead Of Her Co-Hosting Stint",
    "description": "This should be interesting!",
    "link": "https://www.cinemablend.com/television/warning-savannah-chrisley-issued-to-the-view-panelists-co-hosting-stint",
    "timestamp": "2026-02-11T00:45:34Z"
  },
  {
    "title": "President Donald Trump slurs his words, fueling new fears ‘something is very wrong’ with his health - NewsBreak",
    "description": "CNN abruptly cut into its regular programming to air live coverage of a press conference held by President Donald Trump following his announcement that U.S",
    "link": "https://www.newsbreak.com/share/4486748683209-president-donald-trump-slurs-his-words-fueling-new-fears-something-is-very-wrong-with-his-health?s=a2&amp;share_destination_id=NzI1ODg2OTUtMTc3MDc3MDU2ODAwOA%3D%3D&amp;pd=04uZdPbD&amp;hl=en_US&amp;send_time=1770770568&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.5.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-11T00:44:41Z"
  },
  {
    "title": "Leavitt brushes off Lutnick–Epstein heat with list of admin wins media ignored before ending briefing",
    "description": "White House Press Secretary Karoline Leavitt defends Commerce Secretary Howard Lutnick amid questions about his Jeffrey Epstein connections during Tuesday briefing.",
    "link": "https://www.foxnews.com/politics/leavitt-brushes-off-lutnick-epstein-heat-list-admin-wins-media-ignored-before-ending-briefing",
    "timestamp": "2026-02-11T00:43:43Z"
  },
  {
    "title": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stalls",
    "description": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stallsnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4485832183633-millions-lost-health-care-so-washington-republicans-could-give-their-rich-friends-yet-another-tax-cut-warnock-says-as-aca-subsidy-fight-stalls?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1770770502&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.4.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-02-11T00:43:08Z"
  },
  {
    "title": "Xi's Beijing inspection; Li on rare earths; Hong Kong white paper; Taiwan Affairs Work Conference; PBoC report",
    "description": "Wang Huning stated that it is necessary to adhere to the one-China principle and the “1992 Consensus,” unite the vast number of Taiwan compatriots, firmly support patriotic reunification forces on the island, resolutely crack down on “Taiwan independence” sep…",
    "link": "https://sinocism.com/p/xis-beijing-inspection-li-on-rare",
    "timestamp": "2026-02-11T00:36:50Z"
  },
  {
    "title": "Nikki Haley Trashes Trump Economy, Warns ‘We Will Lose’ if Americans Don’t Start to ‘Feel Some Hope’",
    "description": "Nikki Haley trashed the economy under her former boss President Donald Trump and warned Republicans some big losses could be coming in the midterms.\nThe post Nikki Haley Trashes Trump Economy, Warns ‘We Will Lose’ if Americans Don’t Start to ‘Feel Some Hope’ …",
    "link": "https://www.mediaite.com/media/tv/nikki-haley-trashes-trump-economy-warns-we-will-lose-if-americans-dont-start-to-feel-some-hope/",
    "timestamp": "2026-02-11T00:36:15Z"
  }
]