[
  {
    "title": "Trump sues Wall Street Journal and Rupert Murdoch over story reporting on Epstein ties",
    "description": "President Donald Trump filed a $10 billion lawsuit against The Wall Street Journal and media mogul Rupert Murdoch Friday, a day after the newspaper published a story reporting on his ties to wealthy financier Jeffrey Epstein.",
    "link": "https://www.pbs.org/newshour/politics/trump-sues-wall-street-journal-and-rupert-murdoch-over-story-reporting-on-epstein-ties",
    "timestamp": "2025-07-19T15:32:19Z"
  },
  {
    "title": "'This ranks near the top': Analyst points to Trump's 'weird' Ghislaine Maxwell remark",
    "description": "On the heels of the damning Wall Street Journal report on a birthday wish that Donald Trump allegedly wrote to accused pedophile Jeffrey Epstein, CNN's Aaron Blake claimed there needs to be more questions asked and answered about the relationship between the …",
    "link": "https://www.rawstory.com/trump-2673383962/",
    "timestamp": "2025-07-19T15:29:55Z"
  },
  {
    "title": "Trump sues Wall Street Journal for $10 billion after lewd Epstein letter report",
    "description": "\"Defendants concocted this story to malign President Trump’s character and integrity and deceptively portray him in a false light,\" the suit alleged.",
    "link": "https://nypost.com/2025/07/19/us-news/trump-sues-wall-street-journal-for-10-billion-after-lewd-epstein-letter-story/",
    "timestamp": "2025-07-19T15:17:31Z"
  },
  {
    "title": "A Pro-Trump Community Reckons With Losing a Beloved Immigrant Neighbor (Nicholas Kristof/New York Times)",
    "description": "Nicholas Kristof / New York Times:\nA Pro-Trump Community Reckons With Losing a Beloved Immigrant Neighbor  —  A photograph of Moises Sotelo held by his daughter, Alondra Sotelo Garcia.Christopher Valentine for The New York Times  —  Voters here in Oregon's ru…",
    "link": "https://www.memeorandum.com/250719/p29",
    "timestamp": "2025-07-19T15:15:01Z"
  },
  {
    "title": "Will ‘The Daily Show’ Be Canceled? Inside the Jon Stewart Show’s Future",
    "description": "The long-running Comedy Central show made headlines quickly after Stephen Colbert announced 'The Late Show's cancelation because both are owned by Paramount.",
    "link": "https://hollywoodlife.com/feature/will-jon-stewart-be-canceled-5429298/",
    "timestamp": "2025-07-19T15:14:52Z"
  },
  {
    "title": "Visitors to the US could soon pay a hefty new fee",
    "description": "The One Big Beautiful Bill Act that Congress passed at the start of the month and President Donald Trump signed into law on July 4 has several provisions targeting those from foreign countries who come to visit or work in the United States.\nThe budget for 202…",
    "link": "https://biztoc.com/x/2c237974ef14da95",
    "timestamp": "2025-07-19T15:11:06Z"
  },
  {
    "title": "Leading Contenders To Replace Jerome Powell as Fed Chair",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKevin Warsh is the favorite to be the next chair of the Federal Reserve if President Donald Trump appoints a successor to Jerome Powell before the end of 2025, according to a leading bookmaker.\nNewsweek contac…",
    "link": "https://biztoc.com/x/eb76d4e93140edbd",
    "timestamp": "2025-07-19T15:10:49Z"
  },
  {
    "title": "July 19 editorial cartoons",
    "description": "(Image credit: Christopher Weyant / Copyright 2025 Cagle Cartoons, Inc.)\n(Image credit: Nick Anderson / Copyright 2025 Tribune Content Agency)\nThis cartoon is set in Federal Reserve Chairman Jerome Powell’s office. He’s watching television where Donald Trump …",
    "link": "https://biztoc.com/x/837e00c645d0d274",
    "timestamp": "2025-07-19T15:10:40Z"
  },
  {
    "title": "$10 billion lawsuit. More documents coming. Here's the latest on Trump and Epstein.",
    "description": "President Trump is seeking an unprecedented amount of damages in his lawsuit challenging a Wall Street Journal report about his Jeffrey Epstein.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/19/trump-epstein-lawsuit-documents/85288688007/",
    "timestamp": "2025-07-19T15:09:27Z"
  },
  {
    "title": "While Trump celebrates the demise of Stephen Colbert’s show, the economics of late-night TV are crumbling",
    "description": "As recently as 2018, broadcast networks took in $439 million in ad revenue for its late-night programs. Last year, that number dwindled to $220 million.",
    "link": "https://fortune.com/2025/07/19/trump-stephen-colbert-show-late-night-tv-network-ad-revenue/",
    "timestamp": "2025-07-19T15:08:24Z"
  },
  {
    "title": "Trump Threatens to Destroy New Iran Nuclear Objects",
    "description": "US President Donald Trump on the social network Truth Social threatened to destroy new Iranian nuclear facilities if they are built.",
    "link": "https://sputnikglobe.com/20250719/trump-threatens-to-destroy-new-iran-nuclear-objects---1122459848.html",
    "timestamp": "2025-07-19T15:03:31Z"
  },
  {
    "title": "Writers guild seeks probe after CBS axes Colbert show",
    "description": "The WGA claims the US network acted under political pressure following a $16 million Trump settlement Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621688-writers-guild-probe-cbs-colbert/",
    "timestamp": "2025-07-19T15:02:34Z"
  },
  {
    "title": "Federal Court Upholds Arkansas Law Targeting Critical Race Theory",
    "description": "“teaching that would indoctrinate students with [such] ideologies”\nThe post Federal Court Upholds Arkansas Law Targeting Critical Race Theory first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/federal-court-upholds-arkansas-law-targeting-critical-race-theory/",
    "timestamp": "2025-07-19T15:00:21Z"
  },
  {
    "title": "Ripplecoin Mining caters to the GENIUS Act and releases a new free AI cloud mining app that supports XRP and BTC",
    "description": "The first stablecoin regulatory framework in the United States has officially landed, and Ripplecoin Mining has simultaneously launched an AI-driven mobile cloud mining app to help XRP and BTC holders open a new path for daily passive income The first stablec…",
    "link": "https://www.globenewswire.com/news-release/2025/07/19/3118267/0/en/Ripplecoin-Mining-caters-to-the-GENIUS-Act-and-releases-a-new-free-AI-cloud-mining-app-that-supports-XRP-and-BTC.html",
    "timestamp": "2025-07-19T15:00:00Z"
  },
  {
    "title": "Leading Contenders To Replace Jerome Powell as Fed Chair",
    "description": "President Donald Trump refused to rule out firing Jerome Powell on Wednesday.",
    "link": "https://www.newsweek.com/leading-contenders-replace-jerome-powell-fed-chair-2101184",
    "timestamp": "2025-07-19T14:59:40Z"
  },
  {
    "title": "Trump says releasing Epstein files wouldn’t satisfy ‘troublemakers,’ as pressure mounts",
    "description": "President Donald Trump said Saturday that even if the courts release the grand jury transcripts in the criminal cases of notorious sex offender Jeffrey Epstein and his convicted procurer of young girls, Ghislaine Maxwell, \"nothing will be good enough for the …",
    "link": "https://biztoc.com/x/6e25e1248c1a0002",
    "timestamp": "2025-07-19T14:59:40Z"
  },
  {
    "title": "Trump claims five jets were shot down in India-Pakistan skirmish",
    "description": "US News: TOI correspondent from Washington: US President Donald Trump on Friday claimed that up to five fighter jets were shot down during the recent India-Pak.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-claims-five-jets-were-shot-down-in-india-pakistan-skirmish/articleshow/122784581.cms",
    "timestamp": "2025-07-19T14:57:29Z"
  },
  {
    "title": "Trump says releasing Epstein files wouldn’t satisfy ‘troublemakers,’ as pressure mounts",
    "description": "Trump's post comes after the Justice Department asked federal judges to unseal the grand jury testimonies in the criminal case of Jeffrey Epstein.",
    "link": "https://www.cnbc.com/2025/07/19/trump-jeffrey-epstein-files-pam-bondi.html",
    "timestamp": "2025-07-19T14:56:12Z"
  },
  {
    "title": "Do you remember Donald Trump’s promise to America a year ago? Sadly, I do. | Opinion",
    "description": "Saturday is the one year anniversary of Trump’s historic third nomination as the Republican presidential candidate and the gripping nomination speech where he told a rapt audience about his brush with death not long before. The chairman of the Republican Part…",
    "link": "https://freerepublic.com/focus/f-news/4329570/posts",
    "timestamp": "2025-07-19T14:53:01Z"
  },
  {
    "title": "President Trump releases attack ad against Rep. Thomas Massie (R-Ky.)",
    "description": "Trump’s political operation just dropped this ad against Thomas Massie in Kentucky:",
    "link": "https://freerepublic.com/focus/f-chat/4329569/posts",
    "timestamp": "2025-07-19T14:50:43Z"
  },
  {
    "title": "Trump Slams 'Troublemakers' After Grand Jury Order To Unseal Epstein Files",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has requested testimony to be unsealed in relation to the Jeffrey Epstein case, he said in a post on Truth Social Saturday.\nThe statement comes a day after the DOJ requested the unsealin…",
    "link": "https://biztoc.com/x/1554874aa6ae3a7a",
    "timestamp": "2025-07-19T14:48:23Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records—but not the Justice Department files his critics are demanding",
    "description": "Under intense pressure from President Donald Trump’s own supporters, his administration on Friday asked a federal court to unseal secret documents related to Jeffrey Epstein’s case in an effort to put to rest for good a political crisis largely of its own mak…",
    "link": "https://biztoc.com/x/33950e8aac7e6180",
    "timestamp": "2025-07-19T14:48:12Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records—but not the Justice Department files his critics are demanding",
    "description": "The uproar over the Epstein files was never about the grand jury transcripts — it was about the thousands of other pages in the government's possession.",
    "link": "https://fortune.com/2025/07/19/trump-jeffry-epstein-files-justice-department-documents-grand-jury-records/",
    "timestamp": "2025-07-19T14:44:13Z"
  },
  {
    "title": "White House Asks Court to Release Epstein Docs",
    "description": "State of the Union: The move came amid an escalating PR fiasco.\nThe post White House Asks Court to Release Epstein Docs appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/white-house-asks-court-to-release-epstein-docs/",
    "timestamp": "2025-07-19T14:43:53Z"
  },
  {
    "title": "CBS canned ‘The Late Show’ over tens of millions in financial losses annually — not Stephen Colbert’s politics: sources",
    "description": "CBS brass say they pulled the plug on “The Late Show with Stephen Colbert” because of its punishing losses — pegged between $40 million and $50 million a year — and claim politics had nothing to do with it. The 61-year-old host got canned just days after he t…",
    "link": "https://freerepublic.com/focus/f-news/4329567/posts",
    "timestamp": "2025-07-19T14:43:25Z"
  },
  {
    "title": "Trump Slams 'Troublemakers' After Grand Jury Order To Unseal Epstein Files",
    "description": "The President posted his thoughts on Truth Social Saturday.",
    "link": "https://www.newsweek.com/trump-slams-troublemakers-after-grand-jury-order-unseal-epstein-files-2101187",
    "timestamp": "2025-07-19T14:40:42Z"
  },
  {
    "title": "Coffee Pot: My Visit To Bill Maher And Woody Harrelson’s WeHo Cannibis Café",
    "description": "I stumbled upon a coffee shop in West Hollywood yesterday called Cafe Woods owned by Bill Maher and Woody Harrelson…how would the coffee measure up? Coffee At Cafe Woods in WeHo – Coffee, Not Cannabis, Please! Regular readers know I am a big fan of Bill Maher…",
    "link": "https://liveandletsfly.com/cafe-woods-coffee/",
    "timestamp": "2025-07-19T14:39:33Z"
  },
  {
    "title": "‘Should we give him a slow clap?’ Dem laughs at Trump attack as it's read live on MSNBC",
    "description": "Rep. Melanie Stansbury (D-NM) tore into President Donald Trump Saturday, reacting live to a social media post from the president that she labeled “typical conman BS.”Trump, embroiled in controversy around his connections to Jeffrey Epstein, officially asked t…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2673383944/",
    "timestamp": "2025-07-19T14:38:55Z"
  },
  {
    "title": "Congo, M23 rebels pledge to reach peace deal next month",
    "description": "Congo and the M23 rebel group on Saturday pledged to sign a peace agreement by Aug. 18, a sign of progress even as outstanding details need to be negotiated. Representatives for both sides were at a ceremony in Doha following months of Qatari mediation.",
    "link": "https://www.cbc.ca/news/world/congo-m23-rebels-pledge-to-reach-peace-deal-next-month-1.7589324",
    "timestamp": "2025-07-19T14:38:28Z"
  },
  {
    "title": "Who was Edwin J. Feulner? Conservative hero and Heritage Foundation founder dies at 83 after driving Trump’s Project 2025 vision",
    "description": "Heritage Foundation founder Edwin J. Feulner has passed away at age 83, leaving behind a major legacy in conservative politics. Feulner led the think tank for decades and helped shape both the Reagan and Trump administrations. His work on Project 2025—a bold …",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-was-edwin-j-feulner-conservative-hero-and-heritage-foundation-founder-dies-at-83-after-driving-trumps-project-2025-vision/articleshow/122784327.cms",
    "timestamp": "2025-07-19T14:38:22Z"
  },
  {
    "title": "The Fed’s architects wanted glass in the HQ renovation, but Trump appointees to a local commission pushed for marble",
    "description": "President Donald Trump has looked to the marble finishes and hefty price tag of the Federal Reserve headquarters to claim grounds to fire Chair Jerome Powell, with whom he has tussled for years over interest rates. But the extensive use of marble in the build…",
    "link": "https://biztoc.com/x/fbbc3d0862365af4",
    "timestamp": "2025-07-19T14:37:24Z"
  },
  {
    "title": "New: Unearthed Video Provides Smoking Gun for Adam Schiff's Alleged Mortgage Fraud",
    "description": "With a new president in charge and the Department of Justice not looking to give Democrats anymore passes, Sen. Adam Schiff's chickens may finally be coming home to roost. As RedState reported back in 2023, the senator claimed a Maryland home as his \"primary …",
    "link": "https://freerepublic.com/focus/f-news/4329565/posts",
    "timestamp": "2025-07-19T14:33:21Z"
  },
  {
    "title": "Colbert's Termination Is a Win for Trump—and the Corporate Assault on Dissent",
    "description": "When media critic A.J. Liebling wrote in The New Yorker 65 years ago that “freedom of the press is guaranteed only to those who own one,” he might have glimpsed a media system dangerously dominated by a small number of companies. But it’s unlikely he could ha…",
    "link": "https://www.commondreams.org/opinion/colbert-cancellation-trump",
    "timestamp": "2025-07-19T14:32:10Z"
  },
  {
    "title": "Trump and SCOTUS are weakening the separation of powers",
    "description": "Conservative justices permit Trump's Education Department purge — and increase his power",
    "link": "https://www.salon.com/2025/07/19/trump-and-scotus-are-weakening-the-separation-of-powers/",
    "timestamp": "2025-07-19T14:30:29Z"
  },
  {
    "title": "More than 30 killed after Israeli forces open fire on people seeking food in Gaza, health ministry says | CNN",
    "description": "Israeli troops opened fire on Gazans seeking food aid in the territory, killing at least 32 people, the Palestinian health ministry and witnesses said.",
    "link": "https://www.cnn.com/2025/07/19/middleeast/israel-gaza-food-aid-shooting-intl",
    "timestamp": "2025-07-19T14:30:19Z"
  },
  {
    "title": "Crypto Lawyer Argues GENIUS Act Sets The Stage For DeFi Expansion",
    "description": "In a historic move for the digital asset industry, US President Donald Trump signed the GENIUS Act into law on Friday, marking the first major federal legislation governing cryptocurrency. The bill, which passed the Senate last month and was approved by the H…",
    "link": "https://bitcoinist.com/crypto-lawyer-argues-genius-act-sets-the-stage-for-defi-expansion/",
    "timestamp": "2025-07-19T14:30:09Z"
  },
  {
    "title": "Why There Could Be an Epstein Files Cover-Up That’s Much Deeper Than We Imagined",
    "description": "Oregon Sen. Ron Wyden just made a bombshell claim about the files that brings up even more questions. \nThe post Why There Could Be an Epstein Files Cover-Up That’s Much Deeper Than We Imagined appeared first on The Root.",
    "link": "https://www.theroot.com/why-there-could-be-an-epstein-files-cover-up-thats-much-2000051558",
    "timestamp": "2025-07-19T14:29:15Z"
  },
  {
    "title": "The Fed’s architects wanted glass in the HQ renovation, but Trump appointees to a local commission pushed for marble",
    "description": "Russ Vought, Trump's top budget adviser, cited “premium marble” in a letter to Powell last week as an example of the “ostentatious overhaul.”",
    "link": "https://fortune.com/2025/07/19/federal-reserve-headquarters-renovation-glass-marble-trump-appointees-powell/",
    "timestamp": "2025-07-19T14:27:03Z"
  },
  {
    "title": "Report: Stephen Colbert's 'Late Show' Operated at a $40M Loss for Years",
    "description": "While the left is lamenting the loss of Stephen Colbert, the network had already given Colbert years of operating at a loss.",
    "link": "https://www.breitbart.com/entertainment/2025/07/19/report-stephen-colberts-late-show-operated-at-a-40-million-loss-for-years/",
    "timestamp": "2025-07-19T14:24:43Z"
  },
  {
    "title": "Trump Tariffs Spell Trouble for Hawaii’s Few Coffee Farmers",
    "description": "Hawaiian coffee farmers have a message for President Donald Trump: Steep tariffs on major exporters such as Brazil will end up hurting them, too.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-spell-trouble-for-hawaiis-few-coffee-farmers",
    "timestamp": "2025-07-19T14:23:06Z"
  },
  {
    "title": "Fact check: Is Zohran Mamdani a communist?",
    "description": "No, Donald Trump’s claim that New York City mayoral candidate’s platform is akin to communism is false, experts say. Zohran Mamdani, the 33-year-old who soared to the lead in the New York City mayoral Democratic primary, describes himself as a democratic soci…",
    "link": "https://freerepublic.com/focus/f-chat/4329561/posts",
    "timestamp": "2025-07-19T14:15:06Z"
  },
  {
    "title": "Gabbard claims Obama's goal with Russia narrative was to 'subvert’ the will of the American people",
    "description": "Tulsi Gabbard claimed on \"Hannity\" on Friday that Barack Obama and his national security team manufactured the Russia hoax to \"subvert the American people's will\" in the 2016 election.",
    "link": "https://www.foxnews.com/media/gabbard-claims-obamas-goal-russia-narrative-subvert-american-people",
    "timestamp": "2025-07-19T14:14:44Z"
  },
  {
    "title": "Trump’s tariffs may wreck your holidays — expert warns of a major inflation spike by year-end",
    "description": "Wall Street economist Torsten Sløk warns that Donald Trump's tariffs could trigger significant inflation, peaking in November or December, impacting consumer prices on gifts and groceries. This could lead to stagflation, potentially delaying Fed rate cuts and…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-tariffs-may-wreck-your-holidays-expert-warns-of-a-major-inflation-spike-by-year-end/articleshow/122784138.cms",
    "timestamp": "2025-07-19T14:14:40Z"
  },
  {
    "title": "Trump Says He’s Ordering Release of Epstein ‘Grand Jury Testimony’ To Try and Appease ‘Troublemakers and Radical Left Lunatics’",
    "description": "Donald Trump announced he is ordering the release of \"all grand jury testimony\" related to Jeffrey Epstein after facing massive MAGA backlash.\nThe post Trump Says He’s Ordering Release of Epstein ‘Grand Jury Testimony’ To Try and Appease ‘Troublemakers and Ra…",
    "link": "https://www.mediaite.com/media/news/trump-says-hes-ordering-release-of-epstein-grand-jury-testimony-to-try-and-appease-troublemakers-and-radical-left-lunatics/",
    "timestamp": "2025-07-19T14:14:05Z"
  },
  {
    "title": "What We Know About Americans Freed in Venezuela Prisoner Swap",
    "description": "A U.S. Navy sailor was among the 10 U.S. citizens released in the exchange on Friday.",
    "link": "https://www.newsweek.com/venezuela-prisoner-swap-maduro-2101144",
    "timestamp": "2025-07-19T14:09:48Z"
  },
  {
    "title": "'Get a job': Medicaid work requirements included in Trump's megabill sparks partisan debate on Capitol Hill",
    "description": "Political battle erupts over Medicaid work requirements as Republicans frame them as preserving the safety net while Democrats argue they harm vulnerable populations.",
    "link": "https://www.foxnews.com/politics/get-job-medicaid-work-requirements-included-trumps-megabill-sparks-partisan-debate-capitol-hill",
    "timestamp": "2025-07-19T14:05:28Z"
  },
  {
    "title": "Bank of England scrutinizes lenders for dollar risk amid Trump worries, sources tell Reuters",
    "description": "LONDON -- The Bank of England has asked some lenders to test their resilience to potential U.S. dollar shocks, three sources said, the latest sign of how the Trump administration's policies are eroding trust in the U.S. as a bedrock of financial stability. As…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329558/posts",
    "timestamp": "2025-07-19T14:04:45Z"
  },
  {
    "title": "Bank of England scrutinizes lenders for dollar risk amid Trump worries, sources tell Reuters",
    "description": "LONDON -- The Bank of England has asked some lenders to test their resilience to potential U.S. dollar shocks, three sources said, the latest sign of how the Trump administration's policies are eroding trust in the U.S. as a bedrock of financial stability. As…",
    "link": "https://freerepublic.com/focus/f-news/4329558/posts",
    "timestamp": "2025-07-19T14:04:45Z"
  },
  {
    "title": "House GOP put on notice to expect a Tuesday Epstein files reckoning",
    "description": "Rep. Greg Landsman (D-OH) is betting the house on the House of Representatives being forced to vote on a measure that would unseal all files related to Jeffrey Epstein.Calls for the release of more files related to Epstein, the disgraced financier alleged to …",
    "link": "https://www.rawstory.com/jeffrey-epstein-2673383911/",
    "timestamp": "2025-07-19T14:04:43Z"
  },
  {
    "title": "Trump calls for Epstein grand jury testimony release",
    "description": "United States President Donald Trump requested the Justice Department release all Grand Jury testimony concerning Jeffrey Epstein, pending court approval.\n\"Even if the Court gave its full and un...",
    "link": "https://biztoc.com/x/929023535c8f850b",
    "timestamp": "2025-07-19T14:03:53Z"
  },
  {
    "title": "Trump calls for Epstein grand jury testimony release",
    "description": "United States President Donald Trump requested the Justice Department release all Grand Jury testimony concerning Jeffrey Epstein, pending court approval.\n\"Even if the Court gave its full and un...",
    "link": "https://biztoc.com/x/929023535c8f850b",
    "timestamp": "2025-07-19T14:03:53Z"
  },
  {
    "title": "CNN Data Analyst: Dems Way Off Track Ahead of Midterms, GOP Has More Pick-up Opportunities",
    "description": "\"At this particular point, this election cycle looks a lot more like 2024 than it does then either 2018 or 2006. And so, of course, Republicans actually held onto the House back in 2024. Will it happen this time around? We'll just have to wait and see.\"\nThe p…",
    "link": "https://legalinsurrection.com/2025/07/cnn-data-analyst-dems-way-off-track-ahead-of-midterms-gop-has-more-pick-up-opportunities/",
    "timestamp": "2025-07-19T14:00:53Z"
  },
  {
    "title": "Joy Behar gives wild theory about how Trump's using Rosie O'Donnell to distract from Epstein",
    "description": "Joy Behar speculates on \"The View\" podcast that Trump threatened Rosie O'Donnell's citizenship to shift media focus away from his controversial stance on the Jeffrey Epstein case.",
    "link": "https://www.foxnews.com/media/joy-behar-gives-wild-theory-about-how-trumps-using-rosie-odonnell-distract-from-epstein",
    "timestamp": "2025-07-19T14:00:50Z"
  },
  {
    "title": "Trump's antitrust cops are OK with new mergers. Old tech monopolies, not so much.",
    "description": "President Trump's antitrust cops are so far friendlier about mergers than their predecessors, but they are refusing to let up on one prominent priority of...",
    "link": "https://finance.yahoo.com/news/trumps-antitrust-cops-are-ok-with-new-mergers-old-tech-monopolies-not-so-much-140038953.html",
    "timestamp": "2025-07-19T14:00:38Z"
  },
  {
    "title": "WATCH: Nancy Pelosi silent on why Biden did not release Epstein files",
    "description": "Leading Democrat Rep. Nancy Pelosi, D-Calif., says President Trump should release the Epstein files, but is silent on why former President Biden did not do so for the entire four years of his term.",
    "link": "https://www.foxnews.com/politics/watch-nancy-pelosi-silent-why-biden-did-not-release-epstein-files",
    "timestamp": "2025-07-19T14:00:15Z"
  },
  {
    "title": "Tax Breaks: The Tax Community Talks About The One Big Beautiful Bill Act Edition",
    "description": "Plus: Social Security ends paper checks, Live Aid, changes to Forms 1099, filling out Form W-9, national debt costs, filing deadlines, tax trivia, and more.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/07/19/tax-breaks-the-tax-community-talks-about-the-one-big-beautiful-bill-act-edition/",
    "timestamp": "2025-07-19T14:00:00Z"
  },
  {
    "title": "Americans Are Tanning Like It’s 1999",
    "description": "This time, it’s not just about looking good.",
    "link": "https://www.theatlantic.com/health/archive/2025/07/tanning-sunburn-safety-maha-rfk/683608/",
    "timestamp": "2025-07-19T14:00:00Z"
  },
  {
    "title": "These Right-Wingers Won’t Shut Up About Epstein, No Matter What Trump Says",
    "description": "Donald Trump doesn't want to talk about the Epstein files, but his most vocal supporters refuse to let him change the subject until they're released.",
    "link": "http://www.rollingstone.com/culture/culture-features/epstein-files-right-wing-trump-1235388286/",
    "timestamp": "2025-07-19T14:00:00Z"
  },
  {
    "title": "What Does Voguing Have to Do With Political Resistance? It All Starts With One Simple Word.",
    "description": "The queer ballroom scene will always find a way.",
    "link": "https://slate.com/life/2025/07/ballroom-house-voguing-resistance-lgbtq-backlash.html",
    "timestamp": "2025-07-19T14:00:00Z"
  },
  {
    "title": "‘Somebody has to speak for the Irish people’: Michael Flatley ‘seriously’ considering presidential bid",
    "description": "Businessman has assembled team of advisers and has had contact with ‘some very weighted individuals’",
    "link": "https://www.irishtimes.com/politics/2025/07/19/michael-flatley-considering-irish-presidential-bid/",
    "timestamp": "2025-07-19T13:58:15Z"
  },
  {
    "title": "Wherefore, Cincinnatus? A Tale of Staggering American Political Corruption.",
    "description": "A little over 2,500 years ago, there lived a man named Lucius Quinctius Cincinnatus. If his name seems familiar, that's because one of the United States' great cities is named after him. Cincinnatus had served the Roman Republic in several capacities, includi…",
    "link": "https://freerepublic.com/focus/f-news/4329556/posts",
    "timestamp": "2025-07-19T13:55:20Z"
  },
  {
    "title": "The Landlord Gutting America’s Hospitals",
    "description": "In April 2024, medical staff testified before Louisiana’s House Health and Welfare Committee about just how bad things had gotten at the Glenwood Regional Medical Center.  The West Monroe hospital had been under fire from the state Health Department over laps…",
    "link": "https://www.motherjones.com/politics/2025/07/the-landlord-gutting-americas-hospitals/",
    "timestamp": "2025-07-19T13:55:09Z"
  },
  {
    "title": "Dan Abrams Breaks Down Why There Is No ‘Epstein List’ But Files Release Could Be ‘Embarrassing’ for Trump",
    "description": "Dan Abrams argued President Donald Trump's administration is between a rock and a hard place when it comes to MAGA fallout on the \"Epstein Files.\"\nThe post Dan Abrams Breaks Down Why There Is No ‘Epstein List’ But Files Release Could Be ‘Embarrassing’ for Tru…",
    "link": "https://www.mediaite.com/media/podcasts/dan-abrams-breaks-down-why-there-is-no-epstein-list-but-files-release-could-be-embarrassing-for-trump/",
    "timestamp": "2025-07-19T13:54:15Z"
  },
  {
    "title": "Jesse Watters Gives On-Air Apology To Gavin Newsom, But It's Not Enough To Stop Lawsuit",
    "description": "Fox News' Watters apologized to the California governor for saying he lied about a call with Trump. \"See you in court, buddy,\" Newsom replied.",
    "link": "https://www.huffpost.com/entry/jesse-watters-gives-on-air-apology-to-gavin-newsom-but-its-not-enough-to-stop-lawsuit_n_687b9208e4b02a024c985430",
    "timestamp": "2025-07-19T13:52:49Z"
  },
  {
    "title": "Trump says Iran 'better off starting anew' after nuclear site strikes",
    "description": "United States President Donald Trump reiterated his claim that all three of Iran's nuclear sites were \"completely destroyed and/or obliterated\" in recent strikes carried out under his ad...",
    "link": "https://biztoc.com/x/9ce26695e9bf7edd",
    "timestamp": "2025-07-19T13:52:13Z"
  },
  {
    "title": "What have Trump's tariffs achieved so far? Experts weigh in",
    "description": "What have Trump's tariffs achieved so far? Experts weigh in.\nThe policy remains in flux months after \"Liberation Day.\"\nPresident Donald Trump’s tariffs tanked markets and unleashed recession forecasts when the president unveiled sweeping levies little more th…",
    "link": "https://biztoc.com/x/bd749d2006977c38",
    "timestamp": "2025-07-19T13:52:05Z"
  },
  {
    "title": "VDH: Elite Universities Final Cave to Trump",
    "description": "Elite universities know they’re in the wrong. For years, they’ve been: Charging upwards of 60% for “overhead” costs for federal research grants. Blatantly violating the U.S. Supreme Court’s 2023 Civil Rights ruling barring race-based admissions and hiring pra…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329555/posts",
    "timestamp": "2025-07-19T13:49:41Z"
  },
  {
    "title": "Ether ETFs See Record $2.18B Weekly Inflow as ETH Rallies During 'Crypto Week'",
    "description": "The price of ether rose over 20% in the past week to briefly top $3,600, before correcting to $3,560.",
    "link": "https://www.coindesk.com/markets/2025/07/19/ether-etfs-see-record-218b-weekly-inflow-as-eth-rallies",
    "timestamp": "2025-07-19T13:42:26Z"
  },
  {
    "title": "Trump: Iran better off moving nuclear program to new sites",
    "description": "United States President Donald Trump reiterated his claim that all three of Iran's nuclear sites were \"completely destroyed and/or obliterated\" in recent strikes carried out under his ad...",
    "link": "https://biztoc.com/x/d16f951f53b1e29b",
    "timestamp": "2025-07-19T13:41:05Z"
  },
  {
    "title": "Donald Trump Disapproval Rating Hits New High",
    "description": "Several polls have shown Trump's net approval rating at an all-time low in recent days.",
    "link": "https://biztoc.com/x/7c5b1016a90af7d7",
    "timestamp": "2025-07-19T13:41:03Z"
  },
  {
    "title": "Trump deserves a decision on his fraud-ruling appeal — free of political foot-dragging",
    "description": "Judge Arthur Engoron ruled in a summary judgement that Trump and the Trump Organization had engaged in massive fraud.",
    "link": "https://nypost.com/2025/07/19/opinion/trump-deserves-a-decision-on-his-fraud-ruling-appeal-free-of-political-foot-dragging/",
    "timestamp": "2025-07-19T13:40:54Z"
  },
  {
    "title": "'The Liberals Were Right': Nick Fuentes Unloads On Trump Over Epstein Cover-Up",
    "description": "Nick Fuentes, who once was an Ultra MAGA supporter of Donald Trump and even dined with Trump at Mar-a-Lago in 2022, has had a change of mind after his one-time hero did a 180 on releasing the Epstein Files. \"And the liberals were right,\" the far-right politic…",
    "link": "https://crooksandliars.com/2025/07/liberals-were-right-nick-fuentes-unloads",
    "timestamp": "2025-07-19T13:40:44Z"
  },
  {
    "title": "The ‘Leather-Bound’ Epstein Book Reeks Of Being A Fake Plant To Implicate Trump",
    "description": "President Trump’s claim that some of the Epstein files are ‘made up’ by Democrats and the FBI makes a lot more sense now. When President Trump first started ranting, really out of nowhere, about the so-called “Epstein files” being “made up” by his Democrat pr…",
    "link": "https://freerepublic.com/focus/f-chat/4329552/posts",
    "timestamp": "2025-07-19T13:40:17Z"
  },
  {
    "title": "July 18, 2025 — [There is a lot about sexual assault in tonight's letter.] (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nJuly 18, 2025  —  [There is a lot about sexual assault in tonight's letter.]  —  Now we know why President Donald J. Trump earlier this week began saying nonsensically that Democrats he dislikes wrote the Eps…",
    "link": "https://www.memeorandum.com/250719/p22",
    "timestamp": "2025-07-19T13:40:01Z"
  },
  {
    "title": "Durbin: DOJ Had FBI Agents Flag Epstein Records With Trump’s Name",
    "description": "Sen. Dick Durbin, the ranking member of the Judiciary Committee, wrote to Attorney General Pam Bondi on Friday, saying he received information she had “pressured the FBI” to put more than 1,000 personnel “on 24-hour shifts to review approximately 100,000 Epst…",
    "link": "https://crooksandliars.com/2025/07/durbin-doj-had-fbi-agents-flag-epstein",
    "timestamp": "2025-07-19T13:39:56Z"
  },
  {
    "title": "This Week, 'Bipartisanship' In The US Senate Died",
    "description": "Senate Judiciary Committee Democrats walked out of a hearing on Thursday in protest of their GOP colleagues advancing President Donald Trump's nomination of his scandal-plagued personal criminal defense lawyer, Emil Bove, to serve as a lifetime judge on the 3…",
    "link": "https://crooksandliars.com/2025/07/week-bipartisanship-us-senate-died",
    "timestamp": "2025-07-19T13:38:34Z"
  },
  {
    "title": "'This Was No Accident': Trump-GOP Policies Blamed as Health Insurers Prepare to Jack Up Premiums",
    "description": "Next year, Americans who buy health insurance through the Affordable Care Act exchanges are set to pay significantly more for coverage—and experts say policies advanced by President Donald Trump and congressional Republicans are at least partially to blame.An…",
    "link": "https://www.commondreams.org/news/health-insurance-premiums",
    "timestamp": "2025-07-19T13:38:19Z"
  },
  {
    "title": "Trump accused of ‘slowly losing it’ as latest signs of ‘dementia’ unravel sparking health worries - NewsBreak",
    "description": "The president forgot names, showed confusion over who was with him at the event, and appeared to fabricate stories that could not possibly be true",
    "link": "https://www.newsbreak.com/share/4111006214288-trump-accused-of-slowly-losing-it-as-latest-signs-of-dementia-unravel-sparking-health-worries?s=a2&amp;share_destination_id=Mjc5MTI0OTcwLTE3NTI5MzIyMzQxMDQ%3D&amp;pd=0ItB9e23&amp;hl=en_US&amp;send_time=1752932234&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.29.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_blend_exp_25q2-v5",
    "timestamp": "2025-07-19T13:37:50Z"
  },
  {
    "title": "Irish man faces backlash after being wrongly accused as man at centre of viral Coldplay footage",
    "description": "An Irish man has been caught up in a global viral internet scandal that saw a tech executive and his employee caught in an intimate embrace on a ‘kiss cam’ at a Coldplay concert.",
    "link": "https://www.independent.ie/irish-news/irish-man-faces-backlash-after-being-wrongly-accused-as-man-at-centre-of-viral-coldplay-footage/a1274908724.html",
    "timestamp": "2025-07-19T13:36:40Z"
  },
  {
    "title": "India, US conclude this week’s crucial negotiations for a trade pact",
    "description": "India and US trade teams conclude crucial BTA negotiations in Washington DC before August 1 tariff deadline.",
    "link": "https://www.thehindubusinessline.com/economy/india-us-conclude-this-weeks-crucial-negotiations-for-a-trade-pact/article69831593.ece",
    "timestamp": "2025-07-19T13:36:07Z"
  },
  {
    "title": "Donald Trump Disapproval Rating Hits New High",
    "description": "Several polls have shown Trump's net approval rating at an all-time low in recent days.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2101138",
    "timestamp": "2025-07-19T13:34:26Z"
  },
  {
    "title": "US strikes on Iran's nuclear sites heighten safety fears",
    "description": "While no radiation leaks have been confirmed following the US strikes on nuclear enrichment facilities in Fordo, Natanz and Isfahan, the extent of the damage remains uncertain. Even a month after the US attacks on three major nuclear sites inside Iran, the ef…",
    "link": "https://www.dw.com/en/us-strikes-on-irans-nuclear-sites-heighten-safety-fears/a-73326007",
    "timestamp": "2025-07-19T13:34:00Z"
  },
  {
    "title": "Victims of LA County sheriff training facility explosion ID’d as 3 deputies with combined 74 years on the job",
    "description": "Three Los Angeles County Sheriff’s deputies were killed in a blast at a compound that houses the agency’s arson and explosive unit on Friday morning. The explosion at the Biscailuz Center Academy Training facility in East Los Angeles resulted in the departmen…",
    "link": "https://freerepublic.com/focus/f-news/4329550/posts",
    "timestamp": "2025-07-19T13:31:33Z"
  },
  {
    "title": "Trump might fire Jerome Powell, but it could spark a legal war like nothing America’s seen before",
    "description": "Donald Trump is again considering firing Federal Reserve Chairman Jerome Powell, potentially igniting a complex legal battle. Powell asserts his removal is unlawful and vows to resist. The dispute centers on the \"for cause\" clause for dismissing Fed board mem…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-might-fire-jerome-powell-but-it-could-spark-a-legal-war-like-nothing-americas-seen-before/articleshow/122783509.cms",
    "timestamp": "2025-07-19T13:30:19Z"
  },
  {
    "title": "Alex Jones Backpedals: 'I Love The President'",
    "description": "Alex Jones has now flipped back into Trump's arms after telling Real America's Voice Steve Bannon that the media blew his angst put of proportion and he still loves Demented Donald.\nThe fact that a lying scumbag who lost a billion-dollar lawsuit against the S…",
    "link": "https://crooksandliars.com/2025/07/alex-jones-backpedals-trump",
    "timestamp": "2025-07-19T13:30:01Z"
  },
  {
    "title": "Soccer Fans Are Revolting as Teams Stay Silent on ICE Crackdowns",
    "description": "Major League Soccer fans face bans for protesting ICE, and are boycotting teams like LA Galaxy and Chicago Fire staying silent on immigration issues.",
    "link": "http://www.rollingstone.com/politics/politics-features/mls-protests-fan-groups-boycott-team-silence-ice-raids-1235387537/",
    "timestamp": "2025-07-19T13:30:00Z"
  },
  {
    "title": "Trump: Iran better off rebuilding nuclear program at new sites",
    "description": "United States President Donald Trump reiterated his claim that all three of Iran's nuclear sites were 'completely destroyed and/or obliterated\" in recent strikes carried out under his adm...",
    "link": "https://biztoc.com/x/f35a072a530f6b76",
    "timestamp": "2025-07-19T13:29:53Z"
  },
  {
    "title": "Unraveling the legal, economic and market ramifications if Trump tries to fire Fed Chair Powell",
    "description": "If President Donald Trump tries to fire Federal Reserve Chair Jerome Powell, it would almost certainly set off a courtroom battle that legal and policy experts say is bound to get messy, with uncertain impacts on the central bank, financial markets and the ec…",
    "link": "https://biztoc.com/x/58d6e076cddc7f00",
    "timestamp": "2025-07-19T13:29:50Z"
  },
  {
    "title": "Sleepless in Kyiv: How Ukraine's capital copes with Russia's nighttime attacks",
    "description": "Kyiv residents are increasingly seeking refuge in subway stations due to intensified Russian drone and missile attacks. The increased frequency and lethality of strikes have led to a surge in underground shelter visits, impacting sleep and mental health. As e…",
    "link": "https://economictimes.indiatimes.com/news/defence/sleepless-in-kyiv-how-ukraines-capital-copes-with-russias-nighttime-attacks/articleshow/122783815.cms",
    "timestamp": "2025-07-19T13:29:00Z"
  },
  {
    "title": "A Test Case for Future Funding Cuts",
    "description": "Panelists joined to discuss Trump’s request to cancel $9 billion in already-approved federal funding.",
    "link": "https://www.theatlantic.com/national/archive/2025/07/republicans-funding-cuts-washington-week/683609/",
    "timestamp": "2025-07-19T13:28:03Z"
  },
  {
    "title": "Trump pulls US from World Health pandemic reforms",
    "description": "Donald Trump's administration said Friday the US was rejecting changes agreed last year for the WHO on its pandemic response, saying they violated the country's sovereignty.",
    "link": "https://www.standardmedia.co.ke/health/health-science/article/2001524723/trump-pulls-us-from-world-health-pandemic-reforms",
    "timestamp": "2025-07-19T13:22:37Z"
  },
  {
    "title": "Trump Sues Dow Jones, Rupert Murdoch For Libel Over WSJ Epstein Story",
    "description": "US President Donald Trump sued Dow Jones & Co., News Corp. and Rupert Murdoch for libel, according to court records. The lawsuit comes a day after the Wall Street Journal published a story alleging that Trump once sent a suggestive birthday letter to Jeffrey …",
    "link": "https://www.ndtvprofit.com/world/trump-sues-dow-jones-rupert-murdoch-for-libel-over-wsj-epstein-story",
    "timestamp": "2025-07-19T13:19:14Z"
  },
  {
    "title": "Immigration arrest outside Oregon preschool rattles parents",
    "description": "Parents at a preschool in Oregon are reeling after immigration officers arrested a father in front of the school",
    "link": "https://abcnews.go.com/US/wireStory/immigration-arrest-oregon-preschool-rattles-parents-123889057",
    "timestamp": "2025-07-19T13:18:52Z"
  },
  {
    "title": "Nvidia's Jensen Huang has done something that no other CEO or leader has done before - ease US-China tensions",
    "description": "Nvidia’s $4 trillion move is making headlines after CEO Jensen Huang pulled off a major turnaround by resuming H20 chip sales to China. Just days after meeting President Donald Trump, Huang landed in Beijing, met Chinese trade officials, and announced the big…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nvidias-jensen-huang-has-done-something-that-no-other-ceo-or-leader-has-done-before-ease-us-china-tensions/articleshow/122782982.cms",
    "timestamp": "2025-07-19T13:16:19Z"
  },
  {
    "title": "Jon Stewart Fears Paramount May End ‘Daily Show’ After Colbert Canceled, Knocks Comedy Central as 'Like Muzak'",
    "description": "The Daily Show host Jon Stewart chimed in on the news that CBS had decided not to renew the Late Show with host Stephen Colbert, taking a shot at the relevance of Comedy Central -- the channel that airs his program.\nThe post Jon Stewart Fears Paramount May En…",
    "link": "https://www.breitbart.com/entertainment/2025/07/19/jon-stewart-fears-paramount-may-end-daily-show-after-colbert-canceled-knocks-comedy-central-as-like-muzak/",
    "timestamp": "2025-07-19T13:15:24Z"
  },
  {
    "title": "Dozens killed by Israeli gunfire near aid sites in south Gaza, Hamas-run ministry says",
    "description": "More than 100 others were also injured near two sites run by the Gaza Humanitarian Foundation, according to the Hamas-run health ministry and civil defence agency.",
    "link": "https://www.bbc.com/news/articles/ce3n04w19qlo",
    "timestamp": "2025-07-19T13:14:02Z"
  },
  {
    "title": "Trump’s WSJ Lawsuit Inadvertently Mutes His Biggest Megaphone: Fox News",
    "description": "Trump's lawsuit against WSJ may backfire—because it will mute Fox News hosts and weaken his anti-media attacks just when he needs them most.\nThe post Trump’s WSJ Lawsuit Inadvertently Mutes His Biggest Megaphone: Fox News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trumps-wsj-lawsuit-inadvertently-mutes-his-biggest-megaphone-fox-news/",
    "timestamp": "2025-07-19T13:12:57Z"
  },
  {
    "title": "Tulsi Gabbard Says Obama Could Face Criminal Charges as She Alleges ‘Treasonous Conspiracy’ Against Trump",
    "description": "Tulsi Gabbard did not close the door on the possibility of Barack Obama facing criminal charges over what she called a \"treasonous conspiracy\" against Trump.\nThe post Tulsi Gabbard Says Obama Could Face Criminal Charges as She Alleges ‘Treasonous Conspiracy’ …",
    "link": "https://www.mediaite.com/media/tv/tulsi-gabbard-says-obama-could-face-criminal-charges-as-she-alleges-treasonous-conspiracy-against-trump/",
    "timestamp": "2025-07-19T13:12:37Z"
  },
  {
    "title": "'Make sure you get a WSJ': MSNBC host predicts more to come on Trump on Monday",
    "description": "According to MSNBC host Jonathan Capehart, the Wall Street Journal will likely have more to say on Donald Trump in the Monday edition after the president filed a lawsuit over reporting on a letter the president allegedly wrote to accused pedophile Jeffrey Eps…",
    "link": "https://www.rawstory.com/trump-wall-street-journal-2673383838/",
    "timestamp": "2025-07-19T13:10:05Z"
  }
]